{"doi":"10.1017\/S1365100507060221","coreId":"66201","oai":"oai:dro.dur.ac.uk.OAI2:2540","identifiers":["oai:dro.dur.ac.uk.OAI2:2540","10.1017\/S1365100507060221"],"title":"Optimal dynamic labour taxation.","authors":["Basu,  P.","Renström,  T. I."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-11","abstract":"We analyze optimal dynamic taxation when labor supply is indivisible. As in Hansen (1985) and Rogerson (1988), markets are complete, and an employment lottery determines who works. The consumer can buy insurance to diversify this income uncertainty. The optimal wage tax is generally positive except for some special cases when leisure is nonnormal and the government can use debt as a policy instrument in addition to its tax instruments. We derive a HARA class of preferences, for which we characterize the dynamic paths of the wage tax. The optimal paths of the labor tax differ between divisible- and indivisible-labor economies","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66201.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/2540\/1\/2540.pdf","pdfHashValue":"e70b6e1571c232a0928efd39dbf1f44af8cb1128","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:2540<\/identifier><datestamp>\n      2011-08-19T08:55:13Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Optimal dynamic labour taxation.<\/dc:title><dc:creator>\n        Basu,  P.<\/dc:creator><dc:creator>\n        Renström,  T. I.<\/dc:creator><dc:description>\n        We analyze optimal dynamic taxation when labor supply is indivisible. As in Hansen (1985) and Rogerson (1988), markets are complete, and an employment lottery determines who works. The consumer can buy insurance to diversify this income uncertainty. The optimal wage tax is generally positive except for some special cases when leisure is nonnormal and the government can use debt as a policy instrument in addition to its tax instruments. We derive a HARA class of preferences, for which we characterize the dynamic paths of the wage tax. The optimal paths of the labor tax differ between divisible- and indivisible-labor economies.<\/dc:description><dc:subject>\n        Optimal taxation<\/dc:subject><dc:subject>\n         Dynamic taxation; Indivisible labor. \\ud\n<\/dc:subject><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:source>\n        Macroeconomic dynamics, 2007, Vol.11(5), pp.567-588 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-11<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:2540<\/dc:identifier><dc:identifier>\n        issn:1365-1005<\/dc:identifier><dc:identifier>\n        issn: 1469-8056<\/dc:identifier><dc:identifier>\n        doi:10.1017\/S1365100507060221<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2540\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1017\/S1365100507060221<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2540\/1\/2540.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["1365-1005","issn:1365-1005","issn: 1469-8056"," 1469-8056"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Optimal taxation","Dynamic taxation; Indivisible labor. \\ud"],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n13 May 2009\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBasu, P. and Renstrm, T. I. (2007) ’Optimal dynamic labour taxation.’, Macroeconomic dynamics., 11 (5).\npp. 567-588.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1017\/S1365100507060221\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n \n \n \nDurham Research Online \n \nDeposited in DRO: \n13 May 2009 \n \nPeer-review status of attached file: \nPeer-reviewed \n \nPublication status of attached file: \nPublished \n \nCitation for published item: \nBasu, P. and Renström, T. I. (2007) 'Optimal dynamic labour taxation.', Macroeconomic \ndynamics., 11 (5). pp. 567-588. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1017\/S1365100507060221 \n \nPublisher’s copyright statement \nCopyright © 2007 Cambridge University Press \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nMacroeconomic Dynamics, 11, 2007, 567–588. Printed in the United States of America.\nDOI: 10.1017\/S1365100507060221\nARTICLES\nOPTIMAL DYNAMIC LABOR\nTAXATION\nPARANTAP BASU\nUniversity of Durham\nTHOMAS I. RENSTRO¨M\nUniversity of Durham\nand\nCEPR\nWe analyze optimal dynamic taxation when labor supply is indivisible. As in Hansen\n(1985) and Rogerson (1988), markets are complete, and an employment lottery\ndetermines who works. The consumer can buy insurance to diversify this income\nuncertainty. The optimal wage tax is generally positive except for some special cases\nwhen leisure is nonnormal and the government can use debt as a policy instrument in\naddition to its tax instruments. We derive a HARA class of preferences, for which we\ncharacterize the dynamic paths of the wage tax. The optimal paths of the labor tax differ\nbetween divisible- and indivisible-labor economies.\nKeywords: Optimal Taxation, Dynamic Taxation, Indivisible Labor\n1. INTRODUCTION\nThere are two ways of introducing second-best government policy in a competitive\neconomy. The first is when the government has to raise an exogenously specified\namount of revenue without recourse to lump-sum taxation. The second-best tax\nsystem then minimizes the distortions.1 The second alternative is to highlight\nthe redistributive role of the government when individuals are heterogeneous in\nterms of factor ownership. The government then resorts to distortionary taxation\nfor redistributive reasons. Under both approaches, considerable research has been\ndevoted to finding the optimal capital-income tax. The central result is typically\nthat the optimal capital-income tax is zero in the steady state. This is the well-\nknown Judd-Chamley result [Judd (1985) and Chamley (1986)].2\nWe would like to thank Satyajit Ghosh, Gary Hansen, Barthalow Moore, William T. Smith, and two anonymous\nreferees for useful comments. We also thank workshop participants at the University of Sydney, University of\nWarwick, and the 2002 meetings of the Society for Economic Dynamics and the 2003 European Meeting of the\nEconometric Society. Basu gratefully acknowledges the research support given by Tilburg University and NWO, and\nRenstro¨m gratefully acknowledges financial support from the European Commission (TMR Grant FMBI983151).\nM. Armellini and K. Cowton are acknowledged for secretarial support. Address correspondence to: P. Basu, De-\npartment of Economics and Finance, University of Durham, 23-26 Old Elvet, Durham, DH1 3HY, UK; e-mail:\nparantap.basu@durham.ac.uk.\nc© 2007 Cambridge University Press 1365-1005\/07 $18.00 567\n568 PARANTAP BASU AND THOMAS I. RENSTRO¨M\nIn this paper, we focus our attention on analyzing the second-best labor income\ntaxation in the Judd-Chamley model. The goal of our paper is to find conditions on\npreferences that give rise to positive labor taxation.3 We do this in a fairly general\nsetting, which includes physical capital and public debt, and allows for both capital\nand labor to be taxed.4 The issue is important because one may question whether\nthe labor income tax is also zero in the steady state like the capital tax. If the\ngovernment can accumulate capital, it could raise all necessary revenues by taxing\ncapital and labor at the beginning of the optimization period, and set all taxes zero\nat the steady state.5 Renstro¨m (1999) investigates this issue in an economy with\ndivisible labor, and finds that the labor tax is positive in the steady state if leisure\nis normal. In this paper, we allow labor supply to be indivisible, as in Hansen\n(1985) and Rogerson (1988), and we establish conditions not only for positive\nlabor taxation but also for zero and negative taxation.6,7\nWhy is the issue of optimal taxation in an environment with indivisible labor\nworth exploring? With indivisible labor, we can unravel a rich set of preferences for\nwhich labor is taxable. We accomplish this by establishing a connection between\nthe household’s demand for unemployment insurance and the normality of leisure.\nWhen leisure is normal, in order to raise the tax base, the fiscal authority would\ntax labor to induce the household to work harder. When labor supply is indivisible,\nand the leisure is normal, the individual buys insurance to equate the utility gain\nfrom not working to the utility cost of the insurance purchase. The novelty of our\napproach is that we further derive a HARA class of preferences (i.e., preferences\nwith Hyperbolic Absolute Risk Aversion) with nonseparable leisure for which\nthis insurance is a linear function of after-tax wage income. Because positive\ninsurance demand and normality of leisure are inextricably connected, one can\nthen answer the tax policy question posed in this paper: What class of preferences\nwould warrant positive labor taxation? For those preferences, we can derive the\ntime path of the optimal labor tax. In addition, we can compare the optimal time\npaths of labor income taxes between divisible and indivisible labor economies,\nwhich turn out to be very different between these two scenarios. This happens\nbecause labour supply elasticities are different between these two models.\nThere is also a pedagogical reason for exploring the optimal labor taxation in\nan indivisible labor scenario. There is a literature on optimal taxation arguing\nthat labor should be taxed when market is incomplete in the sense that there is\nneither an insurance market nor a set of contingent-claims markets (where the\nhousehold can diversify income risk). The government then uses corrective taxes\nfor the missing markets.8 However, the issue still remains whether labor should\nbe taxed in a complete-markets environment. Our exercise with indivisible labor\nprovides insights why labor may be taxed even when there are no missing insurance\nmarkets.9\nWe also characterize the short-run dynamics of the labor income tax. We find\nthat when leisure is normal, the optimal labor tax is increasing over time as long\nas capital is taxed. When leisure is inferior, and labor is subsidized, the subsidy is\nincreasing over time as long as capital is taxed. We also look at two special cases\nOPTIMAL DYNAMIC LABOR TAXATION 569\nof the HARA class, iso-elastic utility and negative exponential utility. We find that\nfor widely used iso-elastic preferences, the optimal labor income tax is positive\nboth in the short and long run. For negative exponential utility, where leisure is\nneutral, the optimal labor-income tax is zero in the short and long run when the\ngovernment can use debt as an instrument. Optimal taxation of labor is, therefore,\ngenerally positive except for some special types of preferences.\nThe paper is organized as follows. The following section presents the model.\nSection 3 derives the optimal-tax implications in a second-best world. Section 4\nderives a class of HARA preferences, and presents examples of the time path of\nthe optimal labor tax. Section 5 compares the time paths of optimal taxes between\ndivisible and indivisible labor economies. Section 6 briefly discusses the case\nwhen public debt is zero. Section 7 concludes.\n2. AN ECONOMY WITH INDIVISIBLE LABOR\n2.1. Individual Economic Behavior\nFollowing Hansen (1985) and Rogerson (1988), we consider an economy where\nlabor supply is indivisible. The consumption set is restricted so that that the individ-\nuals can work either full time, h0, or not at all. Households have access to an insur-\nance market where they can buy insurance. In each period, the household member\nengages in an employment lottery, choosing the probability of working, α(t), and\nthe probability of not working, (1−α(t)). This makes her wage income uncertain.\nShe has access to an insurance market where she buys unemployment insurance,\ny(t).The household’s consumption (cs(t)) and asset accumulation (a˙s(t)) are thus\npotentially contingent on whether the household works (s = 1) or not (s = 2).\nThere is no intrinsic uncertainty, which means that preferences and technology are\nnonstochastic. The household thus solves the following maximization problem:\nJ (a0) ≡ max\nc,y,α\n∫ ∞\n0\ne−θt [α(t)u(c1(t), 1 − h0) + (1 − α(t))u(c2(t), 1)] dt (1)\na˙1(t) = ρ(t)a(t) + ω(t)h0 − p(α(t))y(t) − c1(t) (2)\na˙2(t) = ρ(t)a(t) + y(t) − p(α(t))y(t) − c2(t) (3)\na(0) = a0, (4)\nwhere a(t) equals the sum of outstanding public debt, b(t), and the capital stock,\nk(t), that earn the after-tax interest at rate ρ(t)= (1 − τK(t))r(t), and ω(t)=\n(1− τL(t))w(t) is the after tax wage; r(t) and w(t) are the rental- and wage-rates,\nrespectively, τK(t) and τL(t) are the proportional tax rates on capital- and labor-\nincome, respectively, and p(α(t)) is the competitive price of insurance.10 The\ninsurance company behaves competitively and maximizes the expected profit,\np(α(t))y(t) − (1 − α(t))y(t), which gives rise to the zero-profit condition,\np(α(t)) = 1 − α(t).11\n570 PARANTAP BASU AND THOMAS I. RENSTRO¨M\nSubstituting the zero-profit condition into (2) and (3), the current value\nHamiltonian of the representative household can be written as\nH = α(t)u(c1(t), 1 − h0) + (1 − α(t))u(c2(t), 1)\n+α(t)q1(t)[ρ(t)a(t) + ω(t)h0 − (1 − α(t)y(t) − c1(t)]\n+ (1 − α(t))q2(t)[ρ(t)a(t) + α(t)y(t) − c2(t)]. (5)\nThe first-order conditions are (subscripts denoting partial derivatives)\n∂H\n∂c1(t)\n= uc(c1(t), 1 − h0) − q1(t) = 0 (6)\n∂H\n∂c2(t)\n= uc(c2(t), 1) − q2(t) = 0 (7)\n∂H\n∂y(t)\n= q1(t) − q2(t) = 0. (8)\nUsing (6), (7), and (8) it follows that\nuc(c\n1(t), 1 − h0) = uc(c2(t), 1) = q(t), (9)\nwhich means perfect insurance. In other words, by buying insurance, the individual\nequalizes the marginal utilities across states. Equation (9) gives the optimal time\npaths of state-contingent consumption, c1(q(t)) and c2(q(t)), as functions of the\nco-state variable q(t). However, this does not necessarily imply that household will\nequalize consumption across states. For consumption equalization, one requires\nan additional restriction on the preferences that the utility function is additively\nseparable between consumption and leisure, meaning uc(1−h) = 0. It turns out that\nwithout any such restriction on the preferences, the household will not choose to\nhave full consumption insurance as in Hansen (1985).12 This can be seen from\n(6), (7), and (8). Because 1 − h0 is not equal to unity, c1 cannot equal c2 unless\nuc(1−h) is equal to 0. Next, because q1(t) = q2(t) it follows that the optimal asset\nholding decisions must satisfy\na˙1(t) = a˙2(t), (10a)\nq˙(t) = (θ − ρ(t))q(t). (10b)\nAn individual’s asset accumulation is thus independent of her employment\nhistory. This implies that individuals starting with the same a0 will have the same\na(t) at all t , regardless of their employment history. Substituting (10a) in (2) and\n(3) gives\ny(t) = ω(t)h0 + c2(q(t)) − c1(q(t)). (11)\nNotice now that the household chooses full insurance if the optimal consumption\nbundles are such that c1(q(t))= c2(q(t)). In the absence of any restriction on y(t),\nOPTIMAL DYNAMIC LABOR TAXATION 571\nthe household can choose to have positive, negative or zero insurance.13 Finally,\nthe optimal choice of α(t) must be such that\n∂H\n∂α(t)\n= u(c1(q(t)), 1 − h0) − u(c2(q(t)), 1)\n− q(t)[c1(q(t)) − c2(q(t)) − ω(t)h0] = 0, (12)\nwhich upon the use of (11) can be rewritten as\nu(c2(q(t)), 1) − u(c1(q(t)), 1 − h0) = q(t)y(t). (12′)\nThe household chooses to buy a positive insurance, y(t), if the utility gain from\nnot working balances the utility cost of the insurance purchase.\n2.2. Production\nThere is large number of competitive firms in the economy each operating under\nthe following constant returns-to-scale technology:\nf (k(t), α(t)h0) = f1 · k(t) + f2 · α(t)h0, (13)\nwhere f1 = ∂f∂k and f2 = ∂f∂αh0 .\n2.3. The Government\nThe government taxes labor and capital income to finance an exogenously specified\nsequence of public spending, g(t), the use of which is not explicitly modeled. It\nadjusts two tax rates, τL(t) and τK(t), continuously. The government is assumed\nto borrow and lend freely at the market rate of interest, r(t). The government’s\nbudget constraint is, therefore, given by\n.\nb = r(t)b(t) − τ k(t)r(t)a(t) − τL(t)w(t)α(t)h0 + g(t), (14)\nwith b(0) = b0.\n2.4. Equilibrium\nThe equilibrium is characterized by the following conditions:\n(a) Facing w(t), r(t), τL(t), τK(t), the household chooses optimal sequences of c(t),\na(t), α(t),y(t) that solves the problem stated in (1), (2) and (3).14\n(b) Given an exogenous steam of government spending, g(t), the government precommits\nto a tax sequence, τL(t) and τK(t), and a debt sequence, b(t), that satisfies the\ngovernment budget constraint (14).\n(c) Goods, labor, rental markets clear meaning\nk˙(t) = f (k(t), α(t)h0) − α(t)c1(t) − [1 − α(t)]c2(t) − g(t), (15)\nω(t) = (1 − τL(t))f2(k(t), α(t)h0), (16)\nρ(t) = (1 − τK(t))f1(k(t), α(t)h0). (17)\n572 PARANTAP BASU AND THOMAS I. RENSTRO¨M\nNotice that the equilibrium level of employment, h(t) (≡ α(t)h0) is determined\nby the time path of the probability of work, α(t). The equilibrium time path of\nα(t) can be determined in two steps. First, using (12) one determines the market\nclearing after tax wage, ω(t) as a function of q(t). Define that equilibrium wage\nfunction as\nω(t) = \u0007(q(t)). (18)\nNext, using (16) and (18), one can characterize the path of α(t) as a function of\nk(t), q(t), and τL(t) as follows:\nα(t) = α(k(t), τL(t), q(t)) (19)\nPROPOSITION 1. In equilibrium, y(t) > 0, if and only if ∂α(t)\n∂a0\n< 0 (leisure is\nnormal at date t); y(t) < 0, if and only if ∂α(t)\n∂a0\n> 0 (leisure is inferior at date t).\nProof. See Appendix A.\nPositive insurance demand and normality of leisure are inextricably\nconnected.15 To see the intuition, start from a scenario where the initial wealth,\na0 is such that y(t)= 0. In this case, the individual is indifferent between work\nand no work (see Equation 12′). Starting from this scenario suppose a0 increases.\nA higher wealth makes the consumer value leisure more if leisure is normal. The\nhousehold cannot choose hours of work in this indivisible labor world. The only\nchoice is to decrease the probability of work and buy positive insurance in response\nto increase in wealth. This is why a positive insurance demand is associated with\na positive utility gain from not working as in (12′).16\n3. SECOND-BEST OPTIMAL TAXATION\nWe now solve for the optimal tax problem for the government for this economy\nwith indivisible labor. The government solves a Ramsey problem for precommitted\ntax sequences, τL(t) and τK(t), that maximize the household’s utility functional\n(1) subject to its own budget constraint (14), the economy wide resource constraint\n(15), the first-order optimality conditions (9), (10b), and (12), and a no-confiscation\nconstraint on capital income as follows:17\nρ(t) ≥ 0. (20)\nUsing (16) and (17), and the CRS property of the production function, the\ngovernment’s budget constraint, (14), can be rewritten as\nb˙(t) = ρ(t)b(t) + ρ(t)k(t) + α(t)ω(t)h0 − f (k(t), α(t)h0) + g(t). (21)\nOPTIMAL DYNAMIC LABOR TAXATION 573\nWe may write the government’s current value Hamiltonian as follows (ignoring\nthe time indices from now on):\nHg = αu(c1, 1 − h0) + (1 + α)u(c2, 1)\n+µ{ρb + ρk + αωh0 − f (k, αh0) + g}\n+ λ{f (k, αh0) − αc1 − (1 − α)c2 − g} + ψ(θ − ρ)q + νρ. (22)\nIn principle, the government faces the states, k, b, and q, and chooses the\ncontrols ρ and τL. For algebraic convenience, we pose the government’s problem\nas follows. The government chooses the controls ρ and α. Then using the equi-\nlibrium sequence of α as in (19), one can determine the optimal labor tax, τL.18\nDenoting u1 = u(c1,1−h0) and u2 = u(c2,1), the first-order conditions facing the\ngovernment are as follows:\n∂Hg\n∂α\n= u1 − u2 + µ[ωh0 − f2 · h0] + λ[f2h0 + c2 − c1] = 0 (23)\n∂Hg\n∂q\n= −ψ˙ + θψ\n⇒ ψ˙ = ρψ − αu1cc1q − (1 − α)u2cc2q − µα\u0007′(q)h0 + λ\n[\nαc1q + (1 − α)c2q\n]\n(24)\n∂Hg\n∂ρ\n= µ(b + k) − ψq + ν = 0 (25)\n∂Hg\n∂k\n= µ(ρ − f1) + λf1 = θλ − λ˙ (26)\n∂Hg\n∂b\n= µρ = θµ − µ˙. (27)\n3.1. The Optimal Capital-Income Tax\nOne may now establish, as in Judd (1985) and Chamley (1986), that the optimal\ncapital-income tax is zero in the steady state, also in our economy with indivisible\nlabor. This can be verified as follows. At steady state the individual’s marginal\nutility of consumption is constant over time, implying, by (10b), that θ = ρ. This\nin turn implies, by (27), that µ is constant in the steady state. With µ being\nconstant (and q constant), equation (23) implies that also λ is constant in the\nsteady state. Setting the time derivative of λ to zero in (26), and using θ = ρ gives\n(ρ − f1)(λ−µ) = 0, which holds if and only if f1 = ρ because (λ−µ) > 0. We\nsummarize this result in terms of the following proposition.\n574 PARANTAP BASU AND THOMAS I. RENSTRO¨M\nPROPOSITION 2. If the indivisible labor economy converges to a steady state\nunder the second-best tax program, then in the steady state the optimal capital-\nincome tax is zero, τK = 0.\n3.2. The Optimal Labor-Income Tax\nOur primary interest in this paper is to explore carefully the optimal labor-tax\nimplications. The problem is complicated by the fact that in an economy with in-\ndivisible labor and lottery, the consumer has the option to transfer consumption not\nonly across dates but also across states. Whether the government should tax wage\nincome in the second best depends crucially on the household’s risk preference,\nwhich will determine its demand for insurance. The following proposition states\na key result about the relationship between the household’s demand for insurance\nand the second-best wage taxation.\nPROPOSITION 3. Under the second-best tax program, from the date when the\nno-confiscation constraint (20) on capital ceases to bind, the optimal wage-income\ntax is positive (negative) if the household’s demand for insurance, y, is positive\n(negative).\nProof. See Appendix B.\nThus, there is a direct link between the sign of y and the sign of the labor-\nincome tax. The question arises whether the optimal labor-income tax is zero\nwhen y = 0, the case when leisure is neutral. This cannot be directly inferred\nfrom Proposition 3, because it is based on an equilibrium wage equation subject\nto the condition that y is nonzero.19 We next analyze a benchmark case when the\noptimal labor income tax is zero.\nPROPOSITION 4. If the preferences of the consumer are such that the con-\nsumer chooses to buy zero insurance (meaning y = 0), the optimal labor-income\ntax is zero at all dates.\nProof. Plugging (12′) into (23) and using (11), one obtains\nf2 − ω = (q − λ)y\n(λ − µ)h0 . (29)\nIt immediately follows that when y = 0, f2 = ω, which means τL = 0.\nBecause Proposition 1 gave us a one-to-one relationship between normal-\nity\/neutrality\/inferiority of leisure and positive\/zero\/negative insurance, we can\nconclude from Propositions 3 and 4 that there is a one-to-one relationship be-\ntween normality\/neutrality\/inferiority of leisure and the sign of the optimal la-\nbor tax. That is, the labor tax should be positive\/zero\/negative if leisure in nor-\nmal\/neutral\/inferior. Notice that this is not just a steady-state result but holds at\nleast from date when the nonconfiscation constraint does not bind.\nOPTIMAL DYNAMIC LABOR TAXATION 575\nThe issue arises whether for normal\/inferior leisure, the labor-income\ntax\/subsidy rises or falls over time. It is difficult to characterize the exact time\npath without fully specifying the preferences. In the next section, we derive a\nbroad class of HARA preferences for which it is possible to characterize the exact\nshort run path of the labor tax.\n4. DYNAMICS OF THE LABOR TAX: A PARAMETRIC EXAMPLE\nConsider a class of preferences for which insurance demand is proportional to the\nwage income as follows:\ny = (1 − π)ω h0, (30)\nwhere π is a parameter that can be either positive, negative, or zero. It turns out\nthat the parameter π pins down alternative preference structures for which leisure\nmay be normal, neutral or inferior.\n4.1. Full Insurance\nThe benchmark case of full insurance arises π = 0. We have the following result.\nPROPOSITION 5. Necessary and sufficient for π = 0 is that the utility func-\ntion u (c, 1 − h0) is additively separable in leisure: uc(1−h) = 0.\nProof. If π = 0, from (11) and (30) it follows that c1 = c2. Next, note that\nwhen c1 = c2, the only way marginal utilities can be equalized in (9) is by setting\nuc(1−h) = 0. This proves necessity. Next we prove the sufficiency. If uc(1−h) = 0,\nthe = from (9) it follows that c1 = c2, which on plugging in (11) and (30) gives\nπ = 0.\nThe additive separable leisure in the utility function is widely used in the\nliterature. When the utility function is additively separable in leisure, it implies that\nleisure is a normal good. In this case, evidently labor is taxed as per Proposition 2.\nHowever, the converse is not true. For normality of leisure, it is not necessary that\nuc(1−h)v = 0. We now derive a wide range of preferences involving nonseparable\nleisure that belongs to a family of preferences known as the Hyperbolic Absolute\nRisk Aversion (HARA) class. Such a family of preferences can be derived when\nπ \u0006= 0.\n4.2. HARA Preferences\nWe shall establish now that for π \u0006= 0, the derived HARA class can encompass\nvarious possibilities: (a) 0 <π < 1, partial insurance; (b) π = 1 no insurance;\n(c) π > 1, negative insurance, and (d) π < 0, over-insurance.\nPlugging (30) into (11) to eliminate ω, we get\ny = 1 − π\nπ\n(c1 − c2). (31)\n576 PARANTAP BASU AND THOMAS I. RENSTRO¨M\nPlugging (31) into (12′) gives\nu1 − u2 + q 1 − π\nπ\n(c1(q) − c2(q)) = 0, (32)\nwhere u1 = u(c1(q), 1 − h0) and u2 = u(c2(q), 1). Equation (32) holds for all\npreferences for which π \u0006= 0.20 We wish to find the class of preferences for which\nπ is constant (i.e., independent of q). We have the following lemma.\nLEMMA 1. It is necessary that the class of preferences for which π \u0006= 0, sat-\nisfies the following condition:\nu1c c\n1\nq −u2c c2q +(1 − π)(c1 − c2) = 0, (33)\nwhere usc and csq denote the derivatives of u and c in state s = {1, 2} w.r.t. c and\nq, respectively.\nProof. Define (32) as the implicit function J (q, π)= 0. Using the implicit\nfunction theorem,\n∂π\n∂q\n= − Jq\nJπ\n. (34)\nFor (34) to be zero, it is necessary that either Jq = 0 or Jπ = ∞. However,\nJπ = ∞ would mean\n−q(c1 − c2)\/π2 = ∞, (35)\nq being the marginal utility of consumption cannot be infinity at the optimum.\nThus, for (35) to hold, π must equal zero, which violates the restriction that π \u0006= 0.\nThus, it is necessary that Jq =0, which yields (33).\nLEMMA 2. For Jq = 0 ∀ q, it is necessary that the utility function is of the\nfollowing Hyperbolic Absolute Risk Aversion (HARA) form:\nu(cs, 1 − hs) = Ds − B\ns\nπ\n(A + (1 − π) cs )π\/(π−1), (36)\nfor s = {1, 2}. Bs and Ds are constants (possibly dependent of h), with B > 0,\nand A is a constant independent of h.\nProof. Taking the derivative of (9) w.r.t. q gives csq(q)= 1\/uscc, s ={1, 2}.\nPlugging this into (33), we get\nu1c\nu1cc\n+ (1 − π) c1 = u\n2\nc\nu2cc\n+ (1 − π) c2. (37)\nBecause preferences are state independent (i.e., expected utility), the left- and\nright-hand sides must equal the same constant, (say −A), that is,\nusc\nuscc\n= −A − (1 − π) cs, (38)\nOPTIMAL DYNAMIC LABOR TAXATION 577\nfor s = {1, 2}. This means that A and π cannot be state dependent (i.e., dependent\nof h). Integrating (38) twice (see, Appendix C for derivation) yields (36).\nWe next show that for the class of HARA preferences (36), the constant D is\nstate independent (i.e., independent of leisure).\nLEMMA 3. For (32) and (36) to hold, it is necessary that that D1 = D2.\nProof. Take the derivative of (36)\nuc(c\ns, 1 − hs) = Bs(A + (1 − π) cs )1\/(π−1) . (39)\nThen, by using (9), we find cs as functions of q:\ncs = 1\n1 − π\n(\nq\nBs\n)π−1\n− A\nπ − 1 . (40)\nInserting (40) into (36) gives\nus = Ds − (Bs )1−π qπ \/π. (41)\nPlugging (40) and (41) into (32), it follows that D1 = D2.\nBecause in the preference class (36), only Bs and cs can be state-dependent, it\nmust be the case that Bs is a function of leisure. Using this insight, define Bs =φh,\nwhere h can take two possible states 0 and h0. Our next task is to characterize\nthe precise restrictions on π , which generates leisure as a “good” (with positive\nmarginal utility) in the utility function. We are ready to state a key proposition.\nPROPOSITION 6. Necessary and sufficient for insurance to be a constant\nfraction of the after-tax wage income is that the preferences belong to the following\nclass:\nu(c, 1 − h) = D − φ\nh\nπ\n(A + (1 − π)c )π\/(π−1), (42)\nwhere A and D are constants. φh is a function of leisure as follows:\n(a) If π > 0, then φh = φ(h), with φ(h0) > φ(0).\n(b) If π < 0, then φh = φ(1 − h), with φ(1) > φ(1 − h0).\nProof. Necessity of (42) follows from Lemma 2 and 3. Sufficiency can be\nchecked by evaluating equation (32) for the class in (42). Finally, conditions (a)\nand (b) imply that utility of working is less than of not working, everything else\nequal.\n4.3. The Case of Zero Labor-Income Taxation\nIn the next step we derive a subclass of preferences from the HARA class for\nwhich labor should not be taxed at the second-best optimum. This is a special case\nwhen leisure is neutral.\n578 PARANTAP BASU AND THOMAS I. RENSTRO¨M\nPROPOSITION 7. If the utility function is of the following exponential class\nu(c, 1 − h) = D − φh e−c, (43)\nwhere D is a constant, and φh =φ(h), with φ(h0)>φ(0), then the household\nself-insures meaning y = 0, and the optimal labor-income tax is zero at all\ndates.\nProof. Recall from Proposition 3 that when the individual takes no insurance,\nthe optimal wage tax is zero. In the present context, y = 0 ifπ = 1 (see equation 30).\nTake limits of (42) as π → 1 (which requires setting A equal to unity) and apply\nl’Hoˆpital’s rule to obtain (43).\nProposition 7 has an important implication. It basically provides a special case\nwhere self-insurance could be optimal. Even if the insurance market is present,\nhouseholds choose to self-insure (meaning the demand for insurance, y = 0) in\nthis special environment by using saving and labor supply as instruments.21\n4.4. Why Does Normality of Leisure Mean a Positive Tax on Labor?\nWe have found that whether labor should be taxed or not depends on whether the\nindividual demands positive insurance or not, which in turn depends on whether\nleisure is normal or inferior. A relationship thus exists between normality of leisure\nand the insurance demand via the individual’s preferences. To see this connection\nclearly, differentiate (19) with respect to τL(t), (keeping k(t) constant), to obtain\nthe following useful decomposition of a change in tax rate, τL(t) on work effort,\nα(t):\ndα(t)\ndτL(t)\n∣∣∣∣\nk(t)\n= ∂α(t)\n∂τL(t)\n+ ∂α(t)\n∂q(t)\n· ∂q(t)\n∂τL(t)\n. (44)\nThe first term in (44) represents the compensated labor-supply response when\nthe tax rate changes (the substitution effect). If q(t) is held constant, it follows\nfrom (18) that ω(t) is also constant and it is straightforward to verify from (16) that\nthe first term is: f2\/[(1−τL)f22 ·h0], and is negative. This substitution effect thus\ncaptures the distortionary effect of the wage-income tax. As far as this substitution\neffect is concerned, a higher labor tax lowers labor supply and thus lowers the tax\nbase.\nThe second term in (44) reflects the income effect of a change in the wage tax\nrate, which works through the effect of τL(t) on α(t) via its effect on q(t). When\nτL(t) is higher, it lowers the permanent income of the household, thus lowering\nconsumption in both states for given α(t). The marginal utility of consumption,\nq(t), thus rises, which means ∂q(t)\/∂τL(t)> 0. A loss of permanent income\n(represented by higher q(t)) would boost the labor supply, α(t), if leisure is a\nOPTIMAL DYNAMIC LABOR TAXATION 579\nnormal good. Next, verify that (44) can be rewritten as:22\ndα(t)\ndτL(t)\n∣∣∣∣\nk(t)\n= f2[1 − τL(t)]f22h0 −\n(1 − π)f2\nf22q(t)h0\n∂q(t)\n∂τL(t)\n. (44′)\nThe normality of leisure (π < 1) thus makes the income effect of a higher wage\ntax positive. This positive income effect tends to increase the tax base (w(t)α(t)h0)\nwhen τL(t) rises, which countervails the distortionary effect of a higher τL(t).\nThe government can thus tax labor more in those economies. By contrast, if\nπ > 1, leisure is inferior. The income effect is then negative, reinforcing the\ndistortionary effect of wage taxation. In this case, the government should subsidize\nlabor.\n4.5. Should Labor Be Taxed When the Utility Function\nIs Isoelastic in Consumption?\nConsider now a special case of the HARA class, equation (42), when A= 0. We\nhave the following lemma concerning the elasticity of interstate substitution (call\nit σ hereafter).\nLEMMA 4. For a specific class of HARA utility functions with A= 0, the\nelasticity of interstate substitution (σ ) is given by 1 − π .\nProof. By definition,\nσ =\nd ln\n(\nc2\nc1\n)\nd ln\n(\nu1c\nu2c\n) . (45)\nUsing (42) gives σ = 1 − π .\nThe utility function thus becomes isoelastic in consumption, and the elasticity of\ninterstate substitution in consumption is uniquely characterized byπ . Furthermore,\nwe must have π < 1 when A= 0, otherwise positive marginal utility, uc > 0, is\nviolated. This immediately implies that leisure is normal when the utility function\nis isoelastic in consumption, and thus labor must be taxed.\nTo summarize, the HARA class of preferences (42) embraces a variety of utility\nfunctions, and thus covers a wide range of optimal taxation schemes. These cases\ninclude: (a) isoelastic utility in consumption (A= 0), in which case the optimal\nlabor tax is positive, (b) negative exponential utility function (π = 1), where the\noptimal labor tax is zero, and (c) quadratic when π = 2 (where A> maxt c(t)), in\nwhich case the optimal labor tax is negative (i.e., a subsidy).\n580 PARANTAP BASU AND THOMAS I. RENSTRO¨M\n4.6. Transitional Dynamics of the Wage-Income Tax in the HARA Case\nWe shall now analyze the transitional dynamics of labor income tax for the range\nof preferences discussed earlier. Using (29) one obtains\nτL\n1 − τL = (1 − π) ·\nq − λ\nλ − µ, (46)\nthen taking the time derivative of (46) using (10b), (26), and (27), one obtains\nd\ndt\nτL\n1 − τL = (1 − π)\nd\ndt\nq − λ\nλ − µ = (1 − π)(f1 −ρ)\nq − µ\nλ − µ. (47)\nAppendix C outlines the steps in deriving the second equality. Based on the\nsecond equality in (47), and the fact that q − µ > 0, and λ − µ > 0, we have the\nfollowing proposition.\nPROPOSITION 8. If π < 1 labor is taxed (at least from the date at which the\nnonconfiscation constraint does not bind), and the wage tax is increasing as long\nas capital is taxed. If π = 1 labor is always untaxed. If π > 1 labor is subsidized\n(at least from the date at which the nonconfiscation constraint does not bind ), and\nthe subsidy is increasing as long as capital is taxed.23\n5. COMPARING THE LABOR TAX IN INDIVISIBLE AND DIVISIBLE\nLABOR ECONOMIES\nIn this section, we compare the optimal tax paths of the indivisible and divisible\nlabor economies. We establish here in terms of an example that the optimal labor\ntax paths could be very different between these two economies because of different\nlabor supply elasticities. The current value Hamiltonian for the household for the\ndivisible labor economy is\nH = u(c(t), 1 − h(t)) + q(t){ρ(t)a(t) + ω(t)h(t) − c(t)}. (48)\nThe first-order conditions are\nuc(c(t), 1 − h(t)) − q(t) = 0, (49)\nu1−h(c(t), 1 − h(t)) − q(t)ω(t) = 0, (50)\nq(t)ρ(t) = θq(t) − .q(t). (51)\nEquations (49) through (50) form a system of equations such that c and h can be\nsolved in terms of q and ω. For our purpose we are interested in the compensated\nlabor supply response with respect to a change in ω holding q constant. We get\n∂h(t)\n∂ω(t)\n= −uccq(t)\nuccull − u2lc\n> 0. (52)\nOPTIMAL DYNAMIC LABOR TAXATION 581\nDenoting η(t) = ∂h(t)\n∂ω(t)\nω(t)\nh(t)\nas the compensated labor supply, and assuming an\nadditively separable utility function, U(c, 1 − h)=V (c)+L(1 − h), Renstro¨m\n(1999) shows that for this divisible labor economy, the time path of labor tax is\ngiven by\nτL\n1 − τL =\nq − λ\nλ − µ − η\n−1 · µ\nλ − µ. (53)\nIn order to make a valid comparison between divisible and indivisible labor\neconomies, we need to assume the same preference structures for both. Recall\nfrom Proposition 5 that for the indivisible laboreconomy π = 0 in (30) if and only\nif the utility function is additively separable. Substituting (30), with π = 0, into\n(29) gives\nτL\n1 − τL =\nq − λ\nλ − µ. (46a)\nComparing (46a) and (53), we see that the time paths of labor taxes are very\ndifferent for these two economies because of the presence of the labor-supply\nelasticity term η on the right-hand side of (53).\nHansen (1985) shows that the equilibrium allocation of an indivisible labor\neconomy can be replicated in a divisible labor economy with a utility function\nlinear in leisure. From (53), this immediately means that η is infinite for such a\ndivisible labor economy. The optimal labor tax path described in (53) thus reduces\nto the indivisible labor case (46a) in such a case. Except this special case, the\noptimal paths for τL are generally different between these two economies.24\n6. NO DEBT SCENARIO\nUntil now, we assumed that the government intertemporally balances the budget\nby using public debt as an instrument. How would the optimal tax formula change\nwhen public debt is disallowed meaning b= 0? In the absence of public debt,\nthe government is left only with two policy instruments, namely, wage tax and\ncapital tax. The zero capital tax still remains socially optimal in steady state,\nwhich means that labor has to be always taxed to finance the exogenous stream\nof government spending in the steady state. In certain cases, we may even have a\ncorner solution for the labor supply where the labor supply hits the upper bound\n(α = 1).\nThe intuition for the possibility of corner solution goes as follows. To sustain\nsuch a zero capital tax regime, the household may have to stretch the labor supply\nto the upper bound (a corner solution) to finance the government spending. This\nhappens particularly when the household values leisure as an inferior or neutral\ngood. As the economy-wide capital stock grows, the household does not then\nmind working harder to finance the government spending just to sustain a socially\noptimal zero capital tax regime. Thus labor supply hits the corner when leisure is\nnonnormal. This kind of a corner solution does not arise when debt is allowed as an\n582 PARANTAP BASU AND THOMAS I. RENSTRO¨M\ninstrument because the benevolent government can always float debt to alleviate\nthe strain on laborsupply.25\n7. CONCLUSION\nIn this paper, we address the issue of optimal wage taxation in a dynamic complete-\nmarkets setting. We find that the second-best labor tax depends crucially on the\ndegree of complementarity between consumption and leisure. If leisure is a not\nneutral, there is scope for government intervention in the form of labor taxation or\nsubsidy in a complete market environment. We investigated this question in a fairly\ngeneral setting with preferences allowing nonseparability between consumption\nand leisure. Our conclusion is that labor should be taxed if leisure is normal.\nThe optimal wage tax could be zero or negative only for very special scenarios\nwhere leisure is nonnormal, and the government has access to public debt as a\npolicy instrument. If the government is restricted to balance the budget period\nby period, the wage subsidy result ceases to hold. Thus, a normative theory of\ntaxation generally implies that labor should be taxed in the long run. We also find\nthat the optimal labor tax paths are generally different between the divisible and\nindivisible labor economies. The results obtained here provide useful guidance in\ndesigning optimal tax policy in a dynamic environment. A useful extension of this\npaper would be to investigate similar issues in a third-best environment where the\ngovernment may not necessarily commit to a specific tax design.\nNOTES\n1. In the second-best, the government designs an optimal dynamic tax formula at date zero, and\nremains precommitted to it (i.e., the government chooses all future consumer prices at date zero). If\nlump-sum taxation is allowed, the analysis reduces to the first-best.\n2. Although Chamley (1986) takes the first view of second-best taxation where the government is\njust revenue raising, Judd (1985) views the government as redistributive. The zero capital-income tax\nis a result robust to several generalizations. Atkeson et al. (1999) provides a survey of the robustness\nof the zero capital taxation result using the primal approach. See also Renstro¨m (1999) for a survey of\nthe dynamic optimal tax literature using the dual approach.\n3. Chamley (1985) analyzes second-best wage taxation in the absence of a capital tax and suggests\nthat the exact tax policy depends on the utility function. We explore this issue and show that the\nfunctional form of the utility function is important in determining the sign of the labor-income tax.\n4. There is a literature looking at this issue from various perspectives. Lucas and Stokey (1983),\nand Ayagiri et al. (2002) look at optimal labor taxation in the absence of capital. For our purposes, it is\nimportant to include physical capital. One may then explore various optimal-tax outcomes, including\nthe possibility of zero tax on both capital and labor. Jones, Manuelli, and Rossi (1993) address the\nissue of optimal labor taxation including physical and either human capital or productive government\nspending. However, their analysis is mostly based on simulation with specific functional forms, and\ndoes not admit a closed form solution with a fairly general preference structure.\n5. Jones, Manuelli, and Rossi (1997) include human capital in addition to physical capital, so that\nthe labor tax has an intertemporal distortion. They show that there are certain cases when the labor\ntax is zero in steady state. See also Reinhorn (2006) for a clarification of those results, in particular\nregarding interior solutions of a model with human capital in addition to physical.\nOPTIMAL DYNAMIC LABOR TAXATION 583\n6. Hansen (1985) and Rogerson (1988) establish that indivisible labor explains aggregate fluctua-\ntions better than models with divisible labor. A subsequent literature explored further into the business\ncycle implications of indivisible labor [see Greenwood and Huffman (1988), Hansen and Sargent\n(1988)]. Mulligan (1999) points out that the tax implications are different for these two classes of\nmodels.\n7. A related paper, Basu, Marsiliani, and Renstro¨m (2004), derives necessary and sufficient\nconditions on preferences for the capital tax to become zero in finite time in an indivisible\nlabor setting. Those preferences are special cases of our HARA class derived in Section 4 of this\npaper.\n8. This has been explored in the literature on risk sharing. There, even without a government\nrevenue constraint, a labor tax may be levied. The labor tax then corrects for a market failure (a\nmissing insurance market). In a two-period setting, Hamilton (1987) demonstrates that the optimal\nwage tax is positive if the second period labor income is uncertain. The issue is indirectly dealt in\nthe macroeconomics literature concerning debt nonneutrality. Chan (1983) and Barsky et al. (1986),\nas well as Basu (1996), examine the debt nonneutrality hypothesis when future income is uncertain.\nAlthough none of these models explicitly deals with the labor-supply decision, there is one common\nresult: taxing future income at a flat rate would be welfare improving if markets were unable to fully\ninsure households from future income risk.\n9. As expected, we find that the second-best capital-income tax is zero at the steady state.\n10. The optimization problem laid out in our paper resembles Hansen (1985). We make it explicit\nthat the agent starts with the same asset but potentially can transit to two possible states: work or no-\nwork. In equilibrium, they will, however, have the same asset equation via insuring themselves against\nincome risk. Alternatively, we can transform the problem into a single state variable by defining\na = αa1(t) + (1 − α)a2(t), and get exactly the same first-order conditions.\n11. The household randomizes the labor-supply decision in this setting by choosing a probability\nof work α(t). A realistic description of this arrangement is that the representative household consists\nof a family of N members. In each period, the household decides the proportion, α(t), of members\nworking. The labor supply is then α(t)h0N . The household can buy insurance on a competitive market\nto diversify the income uncertainty arising from (1 −α(t))N of its members not working. After\nchoosing the probability of work, α(t) the household is precommitted to it, and cannot renege. The\ninsurance company then charges the actuarially fair premium, 1 −α. This rules out adverse selection in\nthe model. The household then realizes that, when choosing work probability, the insurance premium\nis a linear function of the probability.\n12. Note that if the utility function is nonseparable, then the household optimally chooses not to\nhave full consumption insurance. One can easily set up a social planning problem and demonstrate\nthat no other consumption allocation dominates the allocation governed by (12).\n13. One needs to be careful about the non-negativity constraint on consumption while thinking\nabout negative unemployment benefit. y(t) can be negative as long as c2(t) is nonnegative. We assume\ninterior solutions, meaning c2(t)> 0.\n14. We assume no-Ponzi games.\n15. In a divisible labor economy, Renstro¨m (1999) finds that noninferiority of leisure is sufficient\nfor the wage-income tax to be positive. In the indivisible-labor setting, normality is both necessary and\nsufficient for a positive labor-income tax.\n16. The insurance market is added to obtain insights about the relationship between normality\nof leisure and the optimal tax, as well as deriving preference structures for which leisure is normal.\nOne can alternatively construct an environment with contingent-claims markets as in Shell and Wright\n(1993), and derive the same equilibrium allocation as a sunspot equilibrium. A proof of this equivalence\nis available from the authors on request.\n17. No such confiscation constraint is relevant for labor income taxation because if labor income\nis confiscated by the government it is optimal for the household to set α(t)= 0, which means no\nproduction. By contrast, the capital income can be confiscated and the government can eventually own\nall the capital to run production.\n584 PARANTAP BASU AND THOMAS I. RENSTRO¨M\n18. It is straightforward to verify that for given k and q, α′(τL)< 0 and hence α(·) can be inverted\nwith respect to τL.\n19. To see this clearly note that the proof of Proposition 3 rests on the fact that \u0007′(q)= −y\/qh0,\nwhich holds when y is nonzero.\n20. Note that π = 0 cannot be nested under this case, which means additively separable utility\nfunction does not belong to our derived class of preferences.\n21. In general, savings alone would not equalize marginal utilities across states. To see this clearly,\nnote that in the absence of an insurance market, there is no equation (8), and hence (9) will not hold\ngenerally. Thus, savings alone cannot equalize marginal utilities across states. If the insurance market\nis dropped, the model reduces to an incomplete market scenario where the intertemporal marginal\nrates of substitution in consumption (which is governed by the two co-state variables q1 and q2 in our\nmodel) will not be equalized across states because of the emergence of uninsurable income risk. This\nuninsurable risk arises because a fraction of the households do not work.\n22. To see this, insert (30) into (A.5) and use (16) to obtain ∂α(t)\/∂q(t)= −(1 − π)f2\/f22q(t)\nh0.\n23. When π = 1, it turns out that the nonconfiscation constraint is binding for a period t ∈ [0, T ∗),\nand capital income is taxed at 100%. From T ∗ and onward, capital is untaxed, and the economy is at\nits steady state level. T ∗ is a function of the present value of the stream of gt , t ∈ [0,∞) discounted at\nthe rate θ .\n24. One suspects that in general the optimal labor tax is lower in an indivisible labor economy\nbecause of a higher labor supply elasticity. In order to make such a quantitative comparison, we need\nto solve the differential equations in λ, q and µ in both economies. Although differential equations\nlook the same for both economies, the solution will be different. The reason is that the initial values\nof these co-state variables are different for these two economies (except the special case when η is\ninfinite), and also the time from which the nonconfiscation constraint does not bind also will differ.\nThe details of these derivations are available from the authors on request.\n25. The details of the derivation of the zero debt case are available from the authors on request.\nREFERENCES\nAyagiri, R., A. Marcet, T.J. Sargent and J. Seppa¨la¨ (2002) Optimal taxation without state contingent\ndebt. Journal of Political Economy 110, 1220–1254.\nAtkeson A., V.V. Chari and P.J. Kehoe (1999) Taxing capital income: A bad idea. Quarterly Review,\nFederal Reserve Bank of Minneapolis 23, 3–17.\nBarsky, R.B., N.G. Mankiw and S.P. Zeldes (1986) Ricardian consumers with Keynesian propensities.\nAmerican Economic Review 76, 676–691.\nBasu, P. (1996) Proportional income tax and the Ricardian equivalence in a nonexpected utility\nmaximizing model. Southern Economic Journal 63, 233–243.\nBasu, P., L. Marsiliani and T.I. Renstro¨m (2004) Optimal dynamic taxation with indivisible labour.\nThe Manchester School 72, 34–54.\nChamley, C. (1985) Efficient taxation in a stylized model of intertemporal general equilibrium. Inter-\nnational Economic Review 26, 451–468.\nChamley, C. (1986) Optimal taxation of capital income in general equilibrium with infinite lives.\nEconometrica 54, 607–622.\nChan, L.K.C. (1983) Uncertainty and the neutrality of government financing policy. Journal of Mone-\ntary Economics 11, 351–372.\nGreenwood, J. and G.W. Huffman (1988) On modelling the natural rate of unemployment with\nindivisible labour. Canadian Journal of Economics 21, 587–609.\nHamilton, J.H. (1987) Optimal wage and income taxation with wage uncertainty. International Eco-\nnomic Review 28, 373–388.\nHansen, G.D. (1985) Indivisible labour and the business cycle. Journal of Monetary Economics 16,\n309–327.\nOPTIMAL DYNAMIC LABOR TAXATION 585\nHansen, G.D. and T.J. Sargent (1988) Straight time and overtime in equilibrium. Journal of Monetary\nEconomics 21, 281–308.\nJones, L., R. Manuelli and P. Rossi (1993) Optimal taxation in models of endogenous growth. Journal\nof Political Economy 101, 485–517.\nJones, L., R. Manuelli and P. Rossi (1997) On the optimal taxation of capital Income. Journal of\nEconomic Theory 73, 93–117.\nJudd, K.L. (1985) Redistributive taxation in a simple perfect foresight model. Journal of Public\nEconomics 28, 59–83.\nLucas, R.E.J. and N.L. Stokey (1983) Optimal fiscal and monetary policy in an economy without\ncapital. Journal of Monetary Economics 12(1), 55–83.\nMulligan, C.B. (1999) Microfoundations and Macro Implications of Indivisible Labour. NBER working\npaper 7116.\nReinhorn, L.J. (2003) Dynamic Optimal Taxation with Human Capital. Mimeo, University of Durham.\nRenstro¨m, T.I. (1999) Optimal dynamic taxation. In S.B. Dahiya (ed.), The Current State of Economic\nScience, Vol. 4, pp. 1717–1734. Spellbound Publications, Rohtak, India.\nRogerson, R. (1988) Indivisible labour, lotteries and equilibrium. Journal of Monetary Economics 21,\n3–16.\nShell, K. and R. Wright (1993) Indivisibilities, lotteries, and sunspot equilibria. Economic Theory 3,\n1–17.\nAPPENDIX A\nProof of Proposition 1. First note that leisure in an indivisible labor economy is normal\nif ∂α(t)\n∂a0\n< 0, which means the household chooses a lower probability of work when its wealth\nis higher. Next observe that\n∂α(t)\n∂a0\n= ∂α(t)\n∂q(t)\n· ∂q(t)\n∂a0\n. (A.1)\nUsing (10a), one obtains\n∂q(t)\n∂a0\n= exp\n(∫ ∞\n0\n(θ − ρ(s)) ds\n)\n· ∂q0\n∂a0\n. (A.2)\nNext note by the application of Envelope property of the value function J (a0) in (1) that\nJ ′(a0) = q0. By strict concavity of the value function (J ′′(a0) < 0), it follows that ∂q0∂a0 < 0.\nThus from (A.2), it follows that ∂q(t)\n∂a0\n< 0. From (A.1), it means that\nsign\n(\n∂α(t)\n∂a0\n)\n= −sign\n(\n∂α(t)\n∂q(t)\n)\n. (A.3)\nUsing (12) and (16), define the following implicit function (time indices suppressed)\nG(q, α) = U(c1(q), 1−h0)−U(c2(q), 1)+q ·\u000b(1 − τL) · f2(k, αh0)h0 + c2(q) − c1(q)\f.\n(A.4)\nUsing the implicit function theorem and (9) one obtains\n∂α(t)\n∂q(t)\n= −Gq\nGα\n= − y(t)\nq(t)(1 − τL(t))f22 · h20\n. (A.5)\n586 PARANTAP BASU AND THOMAS I. RENSTRO¨M\nFrom (A.3) and (A.5), it follows that ∂α(t)\n∂a0\nis negative, zero, or positive if and only y(t)\nis positive, negative, or zero.\nAPPENDIX B\nProof of Proposition 2. Plugging (12) into (23) and using (11), one obtains\nf2 − ω = (q − λ)y\n(λ − µ)h0 . (B.1)\nPremultiply (24) by q and exploiting the fact that \u0007′(q) = [c1 − c2 − ωh0]\/qh0, one\nobtains\nqψ˙ = qρψ+(λ − q) [α c1q q + (1 − α) c2q q] + µα[ωh0 − c1 + c2]. (B.2)\nNext note that\nd\ndt\n(ψq) = ψ˙q + ψq˙ = ψ˙q + ψ(θ − ρ)q. (B.3)\nPlugging (B.3) into (B.2) gives\nd\ndt\n(ψq) = θψq + (λ − q) [α c1q q + (1 − α) c2q q] + µα [ωh0 − c1 + c2] . (B.4)\nNext note that\nd\ndt\n(µa) = µ˙a + µa˙. (B.5)\nPlugging (27) into (B.5)\nd\ndt\n(µa) = µ(θ − ρ)a + µa˙. (B.6)\nUsing (2), (3), and (10a), the household’s budget constraint can be rewritten as\na˙ = ρa + αωh0 − αc1 − (1 − α)c2, (B.7)\nwhich after plugging into (B.6) gives\nd\ndt\n(µa) = θµa + µ[αωh0 − αc1 − (1 − α)c2]. (B.8)\nNext noting that a = b + k, rewrite (25) as\nν = ψq − µa. (B.9)\nTaking the time derivative of (B.9), one obtains\nν˙ = d\ndt\n(ψq) − d\ndt\n(µa). (B.10)\nOPTIMAL DYNAMIC LABOR TAXATION 587\nUsing (B.4) and (B.8) in (B.10) one obtains\n.\nν = θν + (λ − q) [α c1q q + (1 − α) c2q q] + µc2. (B.11)\nChamley (1986) shows that the confiscation constraint, (20) cannot be binding forever.\nIn our case, if it is binding forever, consumption falls to zero in both states. Suppose that\nit ceases to bind at date t1. Because ν is the multiplier associated with the confiscation\nconstraint, (20), this implies that\nν(t) = ν˙(t) = 0, (B.12)\nfor t ≥ t1. Plugging (B.12) into (B.11) and simplifying terms, we get\nq − λ\nµ\n= c\n2[\nαc1qq + (1 − α)c2qq\n] , (B.13)\nfor t ≥ t1.\nPlugging (B.13) into (B.1), one obtains\nλ − µ\n−µ (f2 − ω) =\n−c2y[\nα c1q q + (1 − α) c2q q\n]\nh0\n. (B.14)\nBecause λ> 0 and µ< 0 and c1q < 0, and c2q < 0 (by concavity of u), it follows that\nthe sign of (f2 − ω) is the same as the sign of y. Hence, the labor income tax is positive\n(negative) when y > (<) 0. \u0001\nAPPENDIX C\nDerivation of equation (36): Inverting (38) gives\nuscc\n\/\nusc = −1\/[A + (1 − π)cs], (C.1)\nfor s = {1, 2}. Or equivalently\nd ln\n(\nusc\n)\ndcs\n= − 1\n1 − π\nd ln(A + (1 − π)cs)\ndcs\n. (C.2)\nIntegrating both sides with respect to cs gives\nln\n(\nusc\n) = Ms − 11 − π ln(A + (1 − π) cs), (C.3)\nwhere Ms is any constant, possibly dependent on s.\nTaking exponents of both sides gives\nus\nc = Bs(A + (1 − π) cs )−1\/(1−π), (C.4)\nwhere Bs = exp(Ms), and consequently is positive.\n588 PARANTAP BASU AND THOMAS I. RENSTRO¨M\nIntegrating both sides with respect to cs finally gives\nus = Ds −B\ns\nπ\n(A + (1 − π) cs )−π\/(1−π), (C.5)\nwhere Ds is any constant, possibly dependent on s.\nDerivation of equation (46). Note that\nd\ndt\n[\nq − λ\nλ − µ\n]\n=\n[\n(dq\/dt) − (dλ\/dt)\nλ − µ\n]\n−\n[\nq − λ\nλ − µ\n]\n.\n[\n(dλ\/dt) − (dµ\/dt)\nλ − µ\n]\n. (C.6)\nNext plug in (10b), (26), and (27) into the right-hand side of (C.6) to obtain (47).\n"}