{"doi":"10.5194\/angeo-23-2903-2005","coreId":"70869","oai":"oai:eprints.lancs.ac.uk:9996","identifiers":["oai:eprints.lancs.ac.uk:9996","10.5194\/angeo-23-2903-2005"],"title":"Double Star, Cluster, and ground-based observations of magnetic reconnection during an interval of duskward oriented IMF: preliminary results","authors":["Wild, J. A.","Milan, S. E.","Davies, J. A.","Cowley, S. W. H.","Carr, C. A.","Balogh, A."],"enrichments":{"references":[{"id":16392310,"title":"A new functional form to study the solar wind control of the magnetopause size and shape,","authors":[],"date":"1997","doi":"10.1029\/97ja00196","raw":"Shue, J.-H., Chao, J. K., Fu, H. C., et al.: A new functional form to study the solar wind control of the magnetopause size and shape, J. Geophys. Res., 102, 9497–9511, 1997.","cites":null},{"id":16392279,"title":"al: The Double Star magnetic ﬁeld investigation: instrument design, performance and highlights of the ﬁrst year’s observation,","authors":[],"date":"2005","doi":"10.5194\/angeo-23-2713-2005","raw":"Carr, C., Brown, P., Zhang, T. L., et al: The Double Star magnetic ﬁeld investigation: instrument design, performance and highlights of the ﬁrst year’s observation, Ann. Geophys., 23, 2713– 2732, 2005.","cites":null},{"id":16392295,"title":"Dayside merging and cusp geometry,","authors":[],"date":"1979","doi":"10.1029\/ja084ia03p00951","raw":"Crooker, N. U.: Dayside merging and cusp geometry, J. Geophys. Res., 84, 951–959, 1979.","cites":null},{"id":16392300,"title":"et al.: Darn\/SuperDARN: a global view of the dynamics of highlatitude convection,","authors":[],"date":"1995","doi":"10.1007\/bf00751350","raw":"Greenwald, R. A., Baker, K. B., Dudeney, J. R., et al.: Darn\/SuperDARN: a global view of the dynamics of highlatitude convection, Space Sci. Rev., 71, 761–796, 1995.","cites":null},{"id":16392319,"title":"et al.: First simultaneous observations of ﬂux transfer events at the high-latitude magnetopause by the Cluster spacecraft and pulsed radar signatures in the conjugate ionosphere by the CUTLASS and EISCAT radars,","authors":[],"date":"2001","doi":"10.5194\/angeo-19-1491-2001","raw":"Wild, J. A., Cowley, S. W. H., Davies, et al.: First simultaneous observations of ﬂux transfer events at the high-latitude magnetopause by the Cluster spacecraft and pulsed radar signatures in the conjugate ionosphere by the CUTLASS and EISCAT radars, Ann. Geophys., 19, 1491–1508, 2001, SRef-ID: 1432-0576\/ag\/2001-19-1491.","cites":null},{"id":16392306,"title":"Initial ISEE magnetometer results: magnetopause observations,","authors":[],"date":"1978","doi":"10.1007\/bf00212619","raw":"Russell, C. T. and Elphic, R. C.: Initial ISEE magnetometer results: magnetopause observations, Space Sci. Rev., 22, 681–715, 1978.","cites":null},{"id":16392304,"title":"Large-scale imaging of highlatitude convection with Super Dual Auroral Radar Network HF radar observations,","authors":[],"date":"1998","doi":"10.1029\/98ja01288","raw":"Ruohoniemi, J. M. and Baker, K. B.: Large-scale imaging of highlatitude convection with Super Dual Auroral Radar Network HF radar observations, J. Geophys. Res., 103, 20797–20811, 1998.","cites":null},{"id":16392322,"title":"Simultaneous insitu observations of the signatures of dayside reconnection at the high and low latitude magnetopause,","authors":[],"date":"2005","doi":"10.5194\/angeo-23-445-2005","raw":"Wild, J. A., Milan, S. E., Cowley, S. W. H., et al.: Simultaneous insitu observations of the signatures of dayside reconnection at the high and low latitude magnetopause, Ann. Geophys., 23, 445– 460, 2005, SRef-ID: 1432-0576\/ag\/2005-23-445.","cites":null},{"id":16392314,"title":"The ACE Magnetic Fields Experiment, Space Sci.","authors":[],"date":"1998","doi":"10.1007\/978-94-011-4762-0_21","raw":"Smith, C. W., Acuna, M. H., Burlaga, L. F., et al.: The ACE Magnetic Fields Experiment, Space Sci. Rev., 86, 613–631, 1998.J. A. Wild et al.: Cluster, Double Star, and ground-based observations of FTEs 2907 Wannberg, G., Wolf, L., Vanhainen, L. G., et al.: The EISCAT Svalbard radar: A case study in modern incoherent scatter radar system design, Radio Sci., 32, 2283–2308, 1997.","cites":null},{"id":16392278,"title":"The Cluster Magnetic Field Investigation: overview of in-ﬂight performance and initial results,","authors":[],"date":"2001","doi":"10.5194\/angeo-19-1207-2001","raw":"Balogh, A., Carr, C. M., Acuna, M. H., et al.: The Cluster Magnetic Field Investigation: overview of in-ﬂight performance and initial results, Ann. Geophys., 19, 1207–1217, 2001, SRef-ID: 1432-0576\/ag\/2001-19-1207.","cites":null},{"id":16392280,"title":"The ionospheric footprint of antiparallel merging regions on the dayside magnetopause,","authors":[],"date":"2000","doi":"10.1007\/s00585-000-0511-2","raw":"Coleman, I. J., Pinnock, M., and Rodger, A. S.: The ionospheric footprint of antiparallel merging regions on the dayside magnetopause, Ann. Geophys., 18, 511–516, 2000, SRef-ID: 1432-0576\/ag\/2000-18-511.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-11-08","abstract":"We present a space- and ground-based study exploiting data from the coordinated Cluster and Double Star missions in order to investigate dayside magnetic reconnection under BY+ dominated IMF conditions. In-situ observations of magnetosheath flux transfer events combined with measurements of pulsed poleward and dawnward directed flows in the pre-noon sector high-latitude northern hemisphere ionosphere are interpreted as indications of pulsed magnetic reconnection during an interval in which the IMF remained relatively steady. Observations of newly- reconnected magnetic flux tubes anchored in the northern hemisphere both at mid-latitudes and in the vicinity of the subsolar point suggests that during BY+ dominated IMF, reconnection is not, as proposed previously, limited to the high-latitude magnetopause","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70869.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/9996\/1\/art_715.pdf","pdfHashValue":"1546a1a8db83a7db0a4fef1b83b45e0cf43a9720","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:9996<\/identifier><datestamp>\n      2018-01-24T03:23:57Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Double Star, Cluster, and ground-based observations of magnetic reconnection during an interval of duskward oriented IMF: preliminary results<\/dc:title><dc:creator>\n        Wild, J. A.<\/dc:creator><dc:creator>\n        Milan, S. E.<\/dc:creator><dc:creator>\n        Davies, J. A.<\/dc:creator><dc:creator>\n        Cowley, S. W. H.<\/dc:creator><dc:creator>\n        Carr, C. A.<\/dc:creator><dc:creator>\n        Balogh, A.<\/dc:creator><dc:description>\n        We present a space- and ground-based study exploiting data from the coordinated Cluster and Double Star missions in order to investigate dayside magnetic reconnection under BY+ dominated IMF conditions. In-situ observations of magnetosheath flux transfer events combined with measurements of pulsed poleward and dawnward directed flows in the pre-noon sector high-latitude northern hemisphere ionosphere are interpreted as indications of pulsed magnetic reconnection during an interval in which the IMF remained relatively steady. Observations of newly- reconnected magnetic flux tubes anchored in the northern hemisphere both at mid-latitudes and in the vicinity of the subsolar point suggests that during BY+ dominated IMF, reconnection is not, as proposed previously, limited to the high-latitude magnetopause.<\/dc:description><dc:date>\n        2005-11-08<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/9996\/1\/art_715.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.5194\/angeo-23-2903-2005<\/dc:relation><dc:identifier>\n        Wild, J. A. and Milan, S. E. and Davies, J. A. and Cowley, S. W. H. and Carr, C. A. and Balogh, A. (2005) Double Star, Cluster, and ground-based observations of magnetic reconnection during an interval of duskward oriented IMF: preliminary results. Annales Geophysicae, 23 (8). pp. 2903-1907. ISSN 0992-7689<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/9996\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.5194\/angeo-23-2903-2005","http:\/\/eprints.lancs.ac.uk\/9996\/"],"year":2005,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"Annales Geophysicae, 23, 2903–2907, 2005\nSRef-ID: 1432-0576\/ag\/2005-23-2903\n© European Geosciences Union 2005\nAnnales\nGeophysicae\nDouble Star, Cluster, and ground-based observations of magnetic\nreconnection during an interval of duskward oriented IMF:\npreliminary results\nJ. A. Wild1, S. E. Milan1, J. A. Davies2, S. W. H. Cowley1, C. M. Carr3, and A. Balogh3\n1Dept. of Physics & Astronomy, University of Leicester, Leicester LE1 7RH, UK\n2Rutherford Appleton Laboratory, Didcot, Oxfordshire, OX11 0QX, UK\n3Blackett Laboratory, Imperial College, London SW7 2BZ, UK\nReceived: 21 January 2005 – Revised: 9 March 2005 – Accepted: 8 April 2005 – Published: 8 November 2005\nPart of Special Issue “Double Star – First Results”\nAbstract. We present a space- and ground-based study\nexploiting data from the coordinated Cluster and Double\nStar missions in order to investigate dayside magnetic re-\nconnection under BY+ dominated IMF conditions. In-situ\nobservations of magnetosheath flux transfer events com-\nbined with measurements of pulsed poleward and dawnward\ndirected flows in the pre-noon sector high-latitude north-\nern hemisphere ionosphere are interpreted as indications of\npulsed magnetic reconnection during an interval in which\nthe IMF remained relatively steady. Observations of newly-\nreconnected magnetic flux tubes anchored in the northern\nhemisphere both at mid-latitudes and in the vicinity of the\nsubsolar point suggests that during BY+ dominated IMF, re-\nconnection is not, as proposed previously, limited to the high-\nlatitude magnetopause.\nKeywords. Magnetopause, cusp, arid boundary layers –\nMagnetosheath – Magnetospheric configuration and dynam-\nics\n1 Introduction\nDespite being the principle mechanism by which solar wind\nenergy and momentum are transferred to the magnetosphere,\nthe magnetic reconnection process is not fully understood.\nThe controlling influence that the orientation of the inter-\nplanetary magnetic field (IMF) exerts over the location and\nspatial extent of the reconnection site is still uncertain. It is\ngenerally accepted that during periods of southward directed\nIMF, low latitude or subsolar reconnection plays a domi-\nnant role in solar wind-magnetosphere coupling, but during\nintervals of northward IMF the reconnection site shifts to\nhigher latitudes, most probably in the vicinity of the cusps\n(e.g. Crooker, 1979; Coleman et al., 2000). However, the\nlocation of the reconnection site, or sites, during intervals\nCorrespondence to: J. A. Wild\n(j.wild@ion)\nof intermediate IMF orientation remains unclear (see Wild\net al., 2005, and references therein), although a systematic\ndawnward\/duskward shift of the reconnection region when\nthe dawn-dusk component of the IMF dominates is well doc-\numented. In this study we shall introduce ground- and space-\nbased observations during a favourable conjunction of the\nCluster and equatorial Double Star spacecraft (TC-1) with\nnorthern hemisphere ionospheric radars. This occurred dur-\ning an interval of predominantly duskward oriented IMF on\n25 March 2004. These data are then employed in order to\nconstrain the location of the reconnection site. For this first\nresults paper, we have limited our exploitation of the in-\nsitu data to magnetic field measurement from the TC-1 and\nCluster spacecraft 1 only. A comprehensive multi-spacecraft\nanalysis including plasma measurements will form the basis\nof a later study.\n2 Instrumentation\nThe positions of the various spacecraft relevant to this study\nare indicated in Fig. 1. During this interval, TC-1 was mov-\ning inbound from the magnetosheath to the magnetosphere,\nencountering the boundary slightly southward of the sub-\nsolar point at approximately 07:00 UT. The Cluster space-\ncraft, moving in the outbound direction, encountered the\nmid-latitude magnetopause at∼08:00 UT. Both of the space-\ncraft encountered the magnetopause in the 11:00–12:00 MLT\nsector. In this preliminary review of the data, we shall in-\ntroduce magnetic field measurements recorded by the flux-\ngate magnetometer (FGM) experiments on board the Cluster\n1 and TC-1 spacecraft (Balogh et al., 2001; Carr et al., 2005,\nrespectively). Ionospheric observations made by the Super-\nDARN network (Greenwald et al., 1995) and the EISCAT\nSvalbard radar (ESR: Wannberg et al., 1997) are compared\nto the in-situ magnetic field measurements recorded by Clus-\nter 1 and TC-1. The northern hemisphere SuperDARN radar\nobservations presented here synthesise ionospheric plasma\n2904 J. A. Wild et al.: Cluster, Double Star, and ground-based observations of FTEs\nFig. 1. The locations of the Cluster 1 (circles) and equatorial Dou-\nble Star (stars) spacecraft in the noon-midnight meridian during the\ninterval under scrutiny. The location of a Shue et al. (1997) magne-\ntopause is also indicated.\nvelocity measurements from 9 radars using the “map poten-\ntial” technique of Ruohoniemi and Baker (1998) in order to\nestimate the global ionospheric convection pattern. We also\npresent measurements of the high-latitude ionosphere made\nby the 32 m steerable dish of the incoherent-scatter ESR fa-\ncility, which was directed northward from Svalbard at low\nelevation (azimuth 336◦, elevation 30◦). Finally, upstream\ninterplanetary magnetic field conditions are provided by the\nmagnetic fields (MAG) experiment (Smith et al., 1998) on\nboard the Advance Composition Explorer (ACE) spacecraft\nlocated some 235RE upstream of the Earth.\n3 Observations\nFigure 2 presents a comparison between the IMF clock an-\ngle (defined as arctan(BY \/BZ)) measured at the ACE space-\ncraft and the equivalent parameter derived from Cluster 1\nand TC-1 data. The ACE data have been time-shifted by\n80 min in order to account for the propagation delay of IMF\nstructures from the spacecraft to the magnetopause. Dur-\ning the interval that extended from 06:00 to 09:00 UT, the\nIMF was typically oriented duskward (BY+) and northward\n(BZ+). The uniform time delay applied to the upstream\ndata brings the ACE clock angle variations into broad agree-\nment with those observed at Cluster 1 and TC-1 when these\nspacecraft were located in the magnetosheath. For example,\nprior to ∼07:00 UT, TC-1 was located in the magnetosheath\nwhere the clock angle orientation closely matched the equiv-\nalent lagged IMF data from ACE (i.e. duskward and gener-\nally northward). TC-1 entered the magnetospheric cavity at\n06:52 UT where it observed the northward pointing magne-\ntospheric field (∼0◦ clock angle). TC-1 emerged back into\nthe magnetosheath (or possibly the magnetosheath bound-\nary layer) for approximately 15 min at ∼07:00 UT before re-\nFig. 2. A comparison of the magnetic field clock angle observed at\nACE, Cluster 1, and TC-1 between 06:00–09:00 UT. Cluster 1 and\nTC-1 magnetopause crossings discussed in the text are indicated by\nappropriately coloured dashed lines.\nentering the magnetosphere for final time. Similar examina-\ntion of the Cluster 1 magnetic field clock angle indicates that\nthe spacecraft was located within the mid-latitude magneto-\nspheric cavity (northward and duskward oriented magnetic\nfield) until ∼07:50 UT when the spacecraft emerged into a\nmagnetosheath-like magnetic field configuration. Prelimi-\nnary plasma data (not shown) indicates that between 07:50–\n08:00 UT Cluster 1 traversed the magnetopause several time,\ndefinitively entering the magnetosheath at 08:00 UT.\nFigure 3 presents an overview of magnetic field obser-\nvations from the Double Star TC-1 (Fig. 3a) and Cluster 1\n(Fig. 3b) spacecraft. In order to highlight FTEs in the vicin-\nity of the magnetopause boundary, the data are presented in\na boundary-normal coordinate system (Russell and Elphic,\n1978). More specifically we show the component of the\nmeasured magnetic field in the direction normal to the lo-\ncal magnetopause (BN ) and the total magnetic field strength\n(|B|). In the case of the TC-1 data, the local boundary normal\nwas determined via minimum variance analysis (MVA) of\nthe 07:00 UT magnetopause encounter, the derived unit nor-\nmal having GSM components [+0.96, −0.13, −0.25]. De-\ntailed examination reveals this determination to be robust,\nas well as being consistent with the expected outward point-\ning boundary normal in the pre-noon, low (southern) latitude\nsector. Cluster 1’s departure from the magnetosphere was\nnot accompanied by a definitive reorientation of the mea-\nsured magnetic field. Consequently, MVA proved to be un-\nsatisfactory in determining the boundary normal in the case\nof this, and the other Cluster spacecraft. Instead, we have\nestimated the local orientation of the magnetopause by us-\ning a Shue et al. (1997) model magnetopause constrained to\npass through the location of Cluster 1 at 08:00 UT (the ap-\nproximate time of the magnetopause crossing). The outward\nnormal to the model magnetopause at this location was thus\nfound to have GSM components [+0.89, −0.14, +0.42].\nInspection of the in-situ magnetometer data reveals char-\nacteristic bipolar fluctuations in the BN component of the\nJ. A. Wild et al.: Cluster, Double Star, and ground-based observations of FTEs 2905\nFig. 3. Magnetic field measurements from the (a) TC-1 and (b)\nCluster 1 spacecraft. The component of the magnetic field normal\nto the local magnetopause and the overall magnetic field strength\nare presented. Magnetopause crossings and FTEs discussed in the\ntext are indicated by dashed lines and red arrows, respectively.\nmagnetic field observed at both Cluster and TC-1. We inter-\npret these classic FTE signatures as evidence of pulsed mag-\nnetic reconnection at the dayside magnetopause. Beginning\nwith the TC-1 data, Fig. 3a presents 60 min of data begin-\nning at 06:30 UT. At this time Cluster was located within the\nmagnetospheric cavity, moving outbound towards the mid-\nlatitude pre-noon sector magnetopause. The clearest bipolar\nsignatures occurred when TC-1 was located in the magne-\ntosheath\/boundary layer between 07:00 and 07:15 UT. Sev-\neral large (∼10 nT peak-to-peak) oscillations were observed,\nat least three of which appear to be associated with enhance-\nments in |B| (indicated by arrows in Fig. 3a). The timing of\nthese oscillations with respect to the |B| enhancements sug-\ngest that these are normal (positive-negative) polarity fluc-\ntuations (Russell and Elphic, 1978). Additional FTE-like\nsignatures were also observed at 06:52 UT and from 07:22–\n07:25 UT, although these are less clear and do not appear to\nbe associated with clear |B| enhancements. Observations of\nFTEs by Cluster 1 began shortly after the spacecraft first en-\ncountered the magnetopause at ∼07:50 UT. The first bipolar\nFTE signature was observed at 07:52 UT (accompanied by\nrapid fluctuations in |B|), with several other clear examples\nobserved over the next 45 min. Figure 3b presents data dur-\nFig. 4. SuperDARN northern hemisphere ionospheric convection\npattern at 07:30 UT on 25 March 2004, derived using the technique\nof Ruohoniemi and Baker (1998). The location of the ESR and the\nmagnetic footprints of the Cluster 1 and TC-1 spacecraft are also\nindicated.\ning the 07:45–08:45 UT interval, by which time TC-1 was\nmoving at inbound low latitudes towards perigee. The ob-\nservations culminated in a series of at least 6 classic, nor-\nmal (positive-negative) polarity bipolar oscillations. In these\ncases, the bipolar perturbations were associated with |B| en-\nhancements and field-tilting effects in the plane of the mag-\nnetopause (not shown). The observed bipolar FTE signatures\nat both spacecraft exhibited normal polarity were indicative\nof northern hemisphere flux tubes contracting northward un-\nder the action of the field tension following magnetic recon-\nnection (e.g. Russell and Elphic, 1978).\nWhen in the magnetosphere, the northern hemisphere\nionospheric footprints of both Cluster and Double Star were\nlocated within the fields-of-view of the easternmost pair of\nSuperDARN radars. Figure 4 presents the ionospheric con-\nvection pattern at 07:30 UT, inferred from all available north-\nern hemisphere SuperDARN data. At this time, both space-\ncraft were located within the magnetosphere, TC-1 having\nrecently traversed the low latitude magnetopause from the\nmagnetosheath (where FTEs were observed), while Clus-\nter 1 was approaching the mid-latitude magnetopause (where\nFTE signatures were also observed). The estimated iono-\nspheric flow pattern is as expected for convection driven\nby a dominant IMF BY component (in this case duskward)\nwith ionospheric plasma in the noon sector flowing dawn-\nward and poleward into the polar cap as newly reconnected\nmagnetic field lines, one end of which remains embedded\nin the solar wind, respond to magnetic tension forces and\nthe influence of the anti-sunward directed solar wind flow.\nDetailed examination of line-of-sight velocity measurements\nfrom individual radars located in the noon and pre-noon sec-\ntor reveals pulsed ionospheric flows (PIFs) – bursts of high\nspeed (∼1000 m s−1) ionospheric plasma flow directed into\n2906 J. A. Wild et al.: Cluster, Double Star, and ground-based observations of FTEs\n78\n79\n80\n81\nM\nag\n L\nat\n (d\neg\n)\n0.8\n0.9\n1.1\n1.4\n1.5\n1.8\n2.0\n2.2\n2.3\n2.5\nElectron D\nensity (x10\n11\n m\n-3)\nM\nag\n L\nat\n (d\neg\n)\n0600 0630 0700 0730 0800 0830 0900\n78\n79\n80\n81\nM\nag\n L\nat\n (d\neg\n)\n1200\n1300\n1400\n1500\n1600\n1700\n1800\n1900\n2000\n2100 Ion Tem\nperature (K)\nUT:\nM\nag\n L\nat\n (d\neg\n)\nFig. 5. Ionospheric electron density and ion temperature measure-\nments made by the ESR during the interval of interest.\nthe polar cap (for a discussion of PIFs, see Wild et al., 2001).\nThe ESR also recorded poleward moving structures in the\nhigh-latitude ionosphere north of Svalbard (MLT∼UT+3 h).\nFigure 5 presents an overview of electron density and ion\ntemperature measurements during the 3-h interval of interest.\nRegions of elevated ion temperature, which can be consid-\nered a proxy for enhanced ion flow velocity, were observed\nmoving poleward at ∼1.5 km s−1. While requiring further\ndetailed anlysis, these structures appear to be roughly cor-\nrelated with depletions in the measured ionospheric electron\ndensity (the enhanced ion temperatures most likely resulting\nin an increased rate of electron-ion recombination).\n4 Discussion & conclusions\nThe 07:30 UT satellite footprints shown in Fig. 4 indicate\nthe ionospheric region corresponding to reconnecting mag-\nnetospheric field lines located adjacent to the magnetopause.\nOn 25 March 2004, this region was situated in the vicin-\nity of the EISCAT Svalbard radar and elements of the Su-\nperDARN radar network. Just prior to this time, the TC-1\nspacecraft had observed magnetosheath FTEs in the vicin-\nity of the subsolar region. Shortly afterwards, the Cluster\nspacecraft observed FTEs at the same magnetic local time,\nbut in the mid-latitude magnetosphere\/magnetosheath. Al-\nthough the observations of FTEs were separated by∼1 h, the\nIMF conditions remained approximately constant through-\nout (i.e. duskward dominated but generally northward point-\ning). We therefore infer that during this interval dayside\nmagnetic reconnection was relatively steady, resulting in the\nFTE signatures observed at the low- and mid-latitude mag-\nnetopause. Given the steady IMF conditions, we consider it\nlikely that the multiple magnetopause encounters recorded\nby TC-1 were a result of variations in the solar wind dy-\nnamic pressure (although the unavailability of upstream solar\nwind plasma data does not allow us to confirm this). The\npulsing of ionospheric plasma flow dawnwards and pole-\nwards across the high-latitude noon-sector ionosphere, as ob-\nserved by the ESR and SuperDARN radars, is further ev-\nidence of magnetic reconnection at the dayside ionosphere\ndriving ionospheric convection typical of +BY dominated\nIMF conditions. Bursty flows such as the observed PIFs are\nnow accepted as the ionospheric counterparts of FTEs. While\nthe temporally displaced in-situ observations presented here\ndo not allow a one-to-one comparison of FTEs at widely\nseparated latitudes, they are evidence of newly-reconnected\nmagnetic flux tubes propagating over much of the surface\nof the magnetopause, including the subsolar region, during\nBZ>0, |BY |\u001dBZ IMF conditions. This is not consistent\nwith an antiparallel description of magnetic reconnection un-\nder BY+ dominated IMF conditions (e.g. Crooker, 1979)\nwhich suggests that newly-opened flux tubes would not tra-\nverse the subsolar region, as they appear to do here. A future\ninvestigation will therefore consider the motion and recent\nhistory of reconnected magnetic field lines in this region un-\nder BY dominated IMF conditions.\nAcknowledgements. We thank the ACE Science Center and\nthe EISCAT scientific association for the data presented here.\nResearch at Leicester was supported by PPARC grant number\nPPA\/G\/O\/2003\/0013.\nTopical Editor T. Pulkkinen thanks O. Amm and\nK. A. McWilliams for their help in evaluating this paper.\nReferences\nBalogh, A., Carr, C. M., Acuna, M. H., et al.: The Cluster Magnetic\nField Investigation: overview of in-flight performance and initial\nresults, Ann. Geophys., 19, 1207–1217, 2001,\nSRef-ID: 1432-0576\/ag\/2001-19-1207.\nCarr, C., Brown, P., Zhang, T. L., et al: The Double Star magnetic\nfield investigation: instrument design, performance and high-\nlights of the first year’s observation, Ann. Geophys., 23, 2713–\n2732, 2005.\nColeman, I. J., Pinnock, M., and Rodger, A. S.: The ionospheric\nfootprint of antiparallel merging regions on the dayside magne-\ntopause, Ann. Geophys., 18, 511–516, 2000,\nSRef-ID: 1432-0576\/ag\/2000-18-511.\nCrooker, N. U.: Dayside merging and cusp geometry, J. Geophys.\nRes., 84, 951–959, 1979.\nGreenwald, R. A., Baker, K. B., Dudeney, J. R., et al.:\nDarn\/SuperDARN: a global view of the dynamics of high-\nlatitude convection, Space Sci. Rev., 71, 761–796, 1995.\nRuohoniemi, J. M. and Baker, K. B.: Large-scale imaging of high-\nlatitude convection with Super Dual Auroral Radar Network HF\nradar observations, J. Geophys. Res., 103, 20 797–20 811, 1998.\nRussell, C. T. and Elphic, R. C.: Initial ISEE magnetometer results:\nmagnetopause observations, Space Sci. Rev., 22, 681–715, 1978.\nShue, J.-H., Chao, J. K., Fu, H. C., et al.: A new functional form to\nstudy the solar wind control of the magnetopause size and shape,\nJ. Geophys. Res., 102, 9497–9511, 1997.\nSmith, C. W., Acuna, M. H., Burlaga, L. F., et al.: The ACE Mag-\nnetic Fields Experiment, Space Sci. Rev., 86, 613–631, 1998.\nJ. A. Wild et al.: Cluster, Double Star, and ground-based observations of FTEs 2907\nWannberg, G., Wolf, L., Vanhainen, L. G., et al.: The EISCAT Sval-\nbard radar: A case study in modern incoherent scatter radar sys-\ntem design, Radio Sci., 32, 2283–2308, 1997.\nWild, J. A., Cowley, S. W. H., Davies, et al.: First simultaneous\nobservations of flux transfer events at the high-latitude magne-\ntopause by the Cluster spacecraft and pulsed radar signatures in\nthe conjugate ionosphere by the CUTLASS and EISCAT radars,\nAnn. Geophys., 19, 1491–1508, 2001,\nSRef-ID: 1432-0576\/ag\/2001-19-1491.\nWild, J. A., Milan, S. E., Cowley, S. W. H., et al.: Simultaneous in-\nsitu observations of the signatures of dayside reconnection at the\nhigh and low latitude magnetopause, Ann. Geophys., 23, 445–\n460, 2005,\nSRef-ID: 1432-0576\/ag\/2005-23-445.\n"}