{"doi":"10.1179\/174329408X315607","coreId":"52198","oai":"oai:eprints.lincoln.ac.uk:3692","identifiers":["oai:eprints.lincoln.ac.uk:3692","10.1179\/174329408X315607"],"title":"Laser surface colouring of titanium for contemporary jewellery","authors":["O'Hana, Sarah","Pinkerton, A. J.","Shoba, Kalsang","Gale, A. W.","Li, L."],"enrichments":{"references":[{"id":674802,"title":"Abstracting Craft: The Practiced Digital Hand,","authors":[],"date":"1998","doi":"10.1093\/jdh\/11.1.102","raw":"McCullough M, 1998, Abstracting Craft: The Practiced Digital Hand, The MIT Press.","cites":null},{"id":675997,"title":"An unusual phenomenon observed when anodising CP titanium to produce coloured surfaces for jewellery and other decorative uses,","authors":[],"date":"2006","doi":"10.1016\/j.optlastec.2005.06.026","raw":"Bartlett L, 2006, An unusual phenomenon observed when anodising CP titanium to produce coloured surfaces for jewellery and other decorative uses, Optics and Laser Technology 38(4-6), 440-444.","cites":null},{"id":675753,"title":"Anodizing Titanium for Space Applications, Thin Solid Films","authors":[],"date":"1992","doi":"10.1016\/0040-6090(92)90946-9","raw":"Sharma A K, 1992, Anodizing Titanium for Space Applications, Thin Solid Films 208(1), 48-54.","cites":null},{"id":674135,"title":"Art of steel, (re Antony Gormley), Professional Engineering","authors":[],"date":null,"doi":null,"raw":"Reidy, H, Art of steel, (re Antony Gormley), Professional Engineering 20(10), PE Publishing, London.","cites":null},{"id":675260,"title":"Auger and X-Ray Photoelectron Spectroscopic and Electrochemical Characterization of Titanium Thin-Film Electrodes,","authors":[],"date":"1977","doi":"10.1016\/0039-6028(77)90007-3","raw":"Armstrong N R and Quinn R K, 1977, Auger and X-Ray Photoelectron Spectroscopic and Electrochemical Characterization of Titanium Thin-Film Electrodes, Surface Science 67(2), 451-468.","cites":null},{"id":676222,"title":"Coloring of titanium by pulsed laser processing in air,","authors":[],"date":"2002","doi":"10.1016\/s0040-6090(02)00632-6","raw":"Pérez del Pino A, Serra P and Morenza J L, 2002, Coloring of titanium by pulsed laser processing in air, Thin Solid Films 415(1-2), 201-205.","cites":null},{"id":676345,"title":"Coloring of titanium through laser oxidation: comparative study with anodizing,","authors":[],"date":"2004","doi":"10.1016\/j.surfcoat.2004.02.001","raw":"Perez del Pino A, Fernandez-Pradas J M, Serra P and Morenza J L, 2004, Coloring of titanium through laser oxidation: comparative study with anodizing, Surface & Coatings Technology 187(1), 106-112.","cites":null},{"id":676779,"title":"Coloured Refractory Metals for Jewellery, Issue 11, The Worshipful Company of Goldsmiths,","authors":[],"date":"1984","doi":"10.1007\/bf03215097","raw":"Goldsmiths, 1984, Coloured Refractory Metals for Jewellery, Issue 11, The Worshipful Company of Goldsmiths, London.","cites":null},{"id":673630,"title":"Cross Pollination. Artists Newsletter.","authors":[],"date":"2005","doi":null,"raw":"Coode-Adams, B. (2005) Cross Pollination. Artists Newsletter. June. Pp 18-19","cites":null},{"id":673868,"title":"From science in art to the art of science.","authors":[],"date":"2005","doi":"10.1038\/434308a","raw":"Kemp, M. (2005) From science in art to the art of science. Nature. Vol. 434, pp 308 – 309","cites":null},{"id":675505,"title":"Galvanostatic Anodization of Titanium .1.","authors":[],"date":"1988","doi":"10.1016\/0013-4686(88)80223-8","raw":"Delplancke J L and Winand R, 1988, Galvanostatic Anodization of Titanium .1. Structures and Compositions of the Anodic Films, Electrochimica Acta 33(11), 1539-1549.","cites":null},{"id":673310,"title":"Genesis of the Jet: Frank Whittle and the Invention of the Jet Engine,","authors":[],"date":"1997","doi":null,"raw":"Golley J, 1997, Genesis of the Jet: Frank Whittle and the Invention of the Jet Engine, Crowood Press","cites":null},{"id":674367,"title":"Heirlooms, an exhibition of rings,","authors":[],"date":"2006","doi":null,"raw":"Callinicos E, 2006, Heirlooms, an exhibition of rings, St. Botolphs. London. Buckinghamshire Chilterns University College.","cites":null},{"id":673064,"title":"New Directions in jewellery II.","authors":[],"date":"2006","doi":null,"raw":"Cheung, L., Clarke, B., Clarke, I. (2006) New Directions in jewellery II. Black Dog Publishing.","cites":null},{"id":672839,"title":"Ojo! An exhibition of Spanish Contemporary Jewellery.","authors":[],"date":"2003","doi":null,"raw":"O’Hana, S. (2003) ¡Ojo! An exhibition of Spanish Contemporary Jewellery. pp.19","cites":null},{"id":676580,"title":"Oxidation of titanium surface under laser irradiation,","authors":[],"date":"2003","doi":"10.1117\/12.515850","raw":"Fedenev A V, Alekseev S B, Orlovskii V M, Tarasenko V F, Tkachev A N, Shulepov M A and Yakovlenko S I, 2003, Oxidation of titanium surface under laser irradiation, Proceedings of the Proceedings of SPIE - The International Society for Optical Engineering, Wroclaw, Poland, 713-716.","cites":null},{"id":677016,"title":"Structure formation on titanium during oxidation induced by cumulative pulsed Nd:YAG laser irradiation,","authors":[],"date":"2004","doi":"10.1007\/s00339-002-2054-8","raw":"Gyorgy E, Del Pino A P, Serra P and Morenza J L, 2004, Structure formation on titanium during oxidation induced by cumulative pulsed Nd:YAG laser irradiation, Applied Physics A (Materials Science Processing) A78(5), 765-70.","cites":null},{"id":676100,"title":"Surface modification and tribological behaviour of titanium and titanium alloys after YAG-laser treatments,","authors":[],"date":"1998","doi":"10.1016\/s0257-8972(97)00653-1","raw":"Langlade C, Vannes A B, Krafft J M and Martin J R, 1998, Surface modification and tribological behaviour of titanium and titanium alloys after YAG-laser treatments, Surface & Coatings Technology 101(1-3), 383-387.","cites":null},{"id":673391,"title":"The Triumph of Technology, Reith lectures,","authors":[],"date":"2005","doi":"10.1017\/cbo9780511492204","raw":"Broers, A. (2005) The Triumph of Technology, Reith lectures, BBC Radio 4","cites":null},{"id":674589,"title":"Walking with Scientists. Between Two Cultures: A dialogue in Jewellery, The Museum of Manchester,","authors":[],"date":"2007","doi":null,"raw":"O’Hana S, Shoba K, Gale A W and Bond B, 2007, Walking with Scientists. Between Two Cultures: A dialogue in Jewellery, The Museum of Manchester, Manchester, UK.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-03-01","abstract":"This paper describes work which emerged through a need to understand more about the potential of laser surface engineering for use in the creative industries. The method of creation of contemporary jewellery pieces and the resultant 'Ocular' jewellery series are described from the creative point of view. The work demonstrates how laser controlled oxide growth on Ti–6Al–4V alloy under ambient conditions can be used as an artistic tool by producing precisely defined colours. Use of the method to produce regular areas of even colour and to reproduce freehand drawings on a titanium alloy surface is described. Analysis highlights interference as the main colouring mechanism and suggests a graded surface layer, progressing from an outer layer of TiO2 to lower layers rich in TiO and Ti2O. The model of research by practice presented in this paper offers a contribution to the current debate on partnerships between art and science and engineering","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/52198.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/3692\/1\/smt_21_OHana_complete-1.pdf","pdfHashValue":"10b9b28cbdcf473383db31fcc8a2b1dd03151c31","publisher":"Maney Publishing","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:3692<\/identifier><datestamp>\n      2014-01-24T12:58:14Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F57:6A6163735F57373230<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48393930<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F57:6A6163735F57373231<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48313330<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/3692\/<\/dc:relation><dc:title>\n        Laser surface colouring of titanium for contemporary jewellery<\/dc:title><dc:creator>\n        O'Hana, Sarah<\/dc:creator><dc:creator>\n        Pinkerton, A. J.<\/dc:creator><dc:creator>\n        Shoba, Kalsang<\/dc:creator><dc:creator>\n        Gale, A. W.<\/dc:creator><dc:creator>\n        Li, L.<\/dc:creator><dc:subject>\n        W720 Metal Crafts<\/dc:subject><dc:subject>\n        H990 Engineering not elsewhere classified<\/dc:subject><dc:subject>\n        W721 Silversmithing\/Goldsmithing<\/dc:subject><dc:subject>\n        H130 Computer-Aided Engineering<\/dc:subject><dc:description>\n        This paper describes work which emerged through a need to understand more about the potential of laser surface engineering for use in the creative industries. The method of creation of contemporary jewellery pieces and the resultant 'Ocular' jewellery series are described from the creative point of view. The work demonstrates how laser controlled oxide growth on Ti–6Al–4V alloy under ambient conditions can be used as an artistic tool by producing precisely defined colours. Use of the method to produce regular areas of even colour and to reproduce freehand drawings on a titanium alloy surface is described. Analysis highlights interference as the main colouring mechanism and suggests a graded surface layer, progressing from an outer layer of TiO2 to lower layers rich in TiO and Ti2O. The model of research by practice presented in this paper offers a contribution to the current debate on partnerships between art and science and engineering.<\/dc:description><dc:publisher>\n        Maney Publishing<\/dc:publisher><dc:date>\n        2008-03-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/3692\/1\/smt_21_OHana_complete-1.pdf<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/3692\/4\/Lincoln-UOA34-SOHana-2.pdf<\/dc:identifier><dc:identifier>\n          O'Hana, Sarah and Pinkerton, A. J. and Shoba, Kalsang and Gale, A. W. and Li, L.  (2008) Laser surface colouring of titanium for contemporary jewellery.  Surface Engineering, 24  (2).   pp. 147-153.  ISSN 0267-0844  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1179\/174329408X315607<\/dc:relation><dc:relation>\n        10.1179\/174329408X315607<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/3692\/","http:\/\/dx.doi.org\/10.1179\/174329408X315607","10.1179\/174329408X315607"],"year":2008,"topics":["W720 Metal Crafts","H990 Engineering not elsewhere classified","W721 Silversmithing\/Goldsmithing","H130 Computer-Aided Engineering"],"subject":["Article","PeerReviewed"],"fullText":" 1\nFrom Art to Engineering \n \nSarah O’Hana1*, Andrew J Pinkerton2, Kalsang Shoba3 \n* Corresponding author \n1Laser Processing Research Centre, \nSchool of Mechanical, Aerospace and Civil Engineering \nThe University of Manchester \nSackville Street Building, PO Box 88, Manchester, M60 1QD \nUnited Kingdom. \nE-mail: Sarah.O'hana@postgrad.manchester.ac.uk \n \n2Laser Processing Research Centre, \nSchool of Mechanical, Aerospace and Civil Engineering \nThe University of Manchester \nSackville Street Building, PO Box 88, Manchester, M60 1QD \nUnited Kingdom. \nE-mail: andrew.pinkerton@manchester.ac.uk \n \n3TheVirtualCompany \nCity College Manchester \nWhitworth Street \nManchester M1 3HB \nUnited Kingdom \nE-mail: kalsang@thevirtualcompany.co.uk \n \nAbstract \nThis paper describes work which emerged through a need to understand more about the \npotential of laser surface engineering for use in the creative industries. The method of \ncreation of contemporary jewellery pieces and the resultant ‘Ocular’ jewellery series are \ndescribed from the points of view of an artist and an engineer. The work demonstrates \nhow laser controlled oxide growth on commercially pure titanium under ambient \nconditions can be used as an artistic tool by producing even, defined colours or by \nreproducing a simulation of freehand drawings on a titanium surface. It also asks the \nquestion: how different are artists from scientists and engineers? \nKeywords: jewellery, art, laser, titanium oxide \n 2\n1. Introduction \nThe nature of an artist is one of enquiry and investigation. By continually looking for answers to the self-\ninflicted problems of design and execution, they experiment with and exploit the materials until they yield \ninto place [1]. The search continues as outcomes often prove unsatisfactory. An extraordinary \nunderstanding of materials through years of research is gained in this way, making applied artists heavily \nresponsible for the direct implementation of this knowledge. The accumulated material knowledge is \napplied together with much underrated practical expertise to create three-dimensional artefacts with \nawesome results [2]. <1st author> \nThe nature of a (research) engineer or scientist is one of seeking to understand and advance in a never \nending cycle. Analysis is one dimension of their work, but the creation of a new process, protein, part, \nassembly, building, mathematical model or any other advancement all requires engineers and scientists to \nthink beyond the purely analytical. For example, a turbine engine requires immense amounts of testing, \nanalysis and painstaking assembly down to the tiniest detail, but who would argue that Frank Whittle and \nother pioneers of this technology were not men or extraordinary creativity and imagination? [3]. <2nd \nauthor> \nIt is easy to make superficial generalisations about either culture, but the lateral thought process that artists \nare renowned for is quite often the gateway that opens new territory and applications for emerging \ntechnologies. The work of Lynne Murray RCA with rapid prototyping [8] is a good example of this. A \nlanguage that can be understood by the non-expert [4] helps to demystify the technology by bringing inside \ninformation out to new audiences, encouraging hybrid practices that can be extraordinary fruitful [5]. \nThe work carried out in this research uses this dialogue and laser technology to create artefacts that prove \nthe success of the art \/ engineering and art \/ science partnerships. Currently, it is rare to have this symbiotic \nstate emerge as jewellery; far more common are the links made to science with fine art, photography and \ndigital art [6,7]. \n2. Artistic and Scientific Techniques \n2.1. Artistic Perspective \n2.1.1 Background \nThe first author and contemporary jewellery artist Sarah O’Hana. has specialised in the promotion, support \nand implementation of new digital technologies, in particular laser processing, for the applied arts in the \nNorth West, UK. After initiating the only Professional Development Qualification (PDQ) that addressed \nthese issues in the UK, she curated the resulting exhibition of 14 artists called In the Making [9], launched \nin the headquarters of Foment de les Arts Decoratives (FAD), Barcelona. This groundbreaking exhibition \nand resulting round table discussion ‘Iniciatives de recolzament i projecció per a joves artistes i \ndissenyadors’ caused the current research to be carried out into laser processing for the creative industries \nat The University of Manchester.  \nJewellery and objects in response to this research are predominantly made with laser coloured titanium \nsurfaces. They have been exhibited at Heirlooms (St Botolphs Church, London) [10] as part of the \nAssociation for Contemporary Jewellery’s (ACJ) conference of  “Carry the Can” in London, July 2006. \nRecent work will be shown at Walking with Scientists in The Museum of Manchester, UK [11], 30th June \n– 2nd September 2007. Jewellery is unique within the design and visual arts in its demand to be ‘finished’ \nas a predominantly wearable art form; skill and ability in the making are important, even if the final \naesthetic is chosen to be ‘rough’ or ‘unfinished’. Observation of the everyday affects the final work. \nEngineering components, conversations with scientists or engineers, experiments by other researchers and \nthe whole environment of life in the laboratory works its way, often subconsciously, into the design \nprocess. \n 3\n2.1.2 Current Work \nThe finished series of three-dimensional work described in this paper is the Ocular Series 1-6. This series is \nbased on the aesthetic of optical measuring equipment and relates to concepts of vision: ‘seeing the bigger \npicture’, ‘clouded vision’, ‘seeing through tinted glasses’, ‘blurred vision’.... all expressions used in the \nEnglish language that are linked to the problems of not seeing correctly because of an impediment, be it \nphysical or psychological. Background research was done for this work in the area of optometry and the \nmeasuring systems that exist there in order to understand the process of eyesight correction which is also \nlinked to a personal lifelong condition of hyperopia and astigmatism. Trays of optician’s trial lenses \nincluding prisms and frames were acquired with the intention of creating a range of work based on seeing, \nobserving, peering and clarifying vision. This is an analogy for the deficient situation existing between art \nand engineering that appears short sighted despite the current popular discussions that, interestingly, are \nusually initiated by the art and design culture. \nThe pieces include some unique features including fingerprints, marked by laser onto the acrylic portions of \nthe pieces. These were included to add a dimension that simulates the reduction of distance between artist \nand workpiece, a concern rising from the increased use of digital technology that drives the laser. \nDirect contact with material is important for the understanding of its properties [12], and drawing has \nbecome a prime ingredient that helps balance the regular shapes that appear on some pieces. In the attempt \nto render the technology transparent a more direct ‘freehand’ approach to laser processing is called for. \nDrawing is understanding and helps feed creativity. The link between drawing and making within the \njewellery practice is perhaps obvious, although not always linear or calculated. \n2.2. Engineering Perspective \nIn order to meet the requirements for the series is was necessary to be able to produce defined colours and \nrecreate hand drawn shapes to predefined geometries on both sides of pieces of commercial titanium. \n2.2.1 Background \nTraditionally, a spectrum of colours can be achieved on titanium either by applying heat using traditional \nmethods such as gas torches or more commonly by electrolytic oxidation (anodising). A titanium \nworkpiece is immersed in an electrolytic solution as an anode and current is drawn. Oxygen generated at \nthe anodic surface then combines with the titanium to form titanium oxide. As the oxide thickens it \nincreasingly acts as an electrical insulator between the electrolyte and the anode until the point where there \nare too few OH- ions available to support further growth, The oxide thickness at which this occurs is \nprimarily a function of the applied voltage but there have been a large number of studies on the properties \nof the oxide films [13-16], which have showed that the composition and microstructure of the anodic \noxides are also strongly dependent on other factors such as electrolyte concentration, temperature and \nanodic surface conditions [17]. This means there are a lot of variables to control for an artist. Additionally \nthe technique requires a high power supply and hazardous electrolytic bath and masking is difficult \nespecially when detailed two-sided parts are to be created, as in this case. \nThe surface appearance of the workpiece after anodizing is due to the formation of a titanium oxide layer. \nInterference between light reflecting from the surfaces of the metal and oxide coating can be constructive \nor destructive as particular wavelengths depending on the oxide film thickness, meaning the frequencies of \nlight reflected become a function of that thickness [16]. The oxide films grown on reactive metals in \ngeneral have a higher refractive index than diamond which accounts for the brilliance of the colours seen. \nLangdale et al [18] treated commercially pure titanium with a pulsed Nd:YAG laser (2-17 kHz frequency, \n2-50 mm\/s traverse speed) in ambient air. The authors found a range of titanium oxides and concluded that \nalthough the layer thickness may have an effect, the different colours they observed corresponded to \ndifferent titanium oxides. A similar study by Perez del Pino et al [19] (Nd:YAG laser, 30 kHz frequency, \n56.7 W mean power, 25-300 mm\/s) confirmed these results; additionally a greater range of oxides was \nfound to form at higher specific energies. However, a later study by the same authors [20], comparing the \ncolours obtained from anodizing and laser treating titanium, concluded that light interference phenomena \nwithin an upper TiO2 surface layer were the mechanism in both cases. The additional oxides created during \nlaser treatment were said to be part of a deeper layer which was not significant for appearance. Carey et al \n 4\n[21] drew attention to the potential of lasers in the Jewellery industry, but Bartlett noted the unpredictability \nof the evenness of colours developed in this way, attributing it to ‘flower oxides’ [17]. \n2.2.2 Current Work \nThe base material was commercially pure titanium plate; it was initially cut into the required shape for the \nfinal piece using a 35W Nd:YAG laser (100ns, 680mJ pulses at 20Hz pulse frequency) with argon gas \nshroud. The shaped piece was then placed on a honeycombed bed and a Universal X-660 Laser Platform \nfitted with a pulsed 60W CO2 laser used to treat the surface. This free-standing unit comprises the laser, an \nX-Y beam positioning system with 0.81 × 0.46 m work area, interchangeable focussing optics and \ncomputer interface. The laser beam was focussed by a 2.0” (50mm) focal length lens in an enclosed lens \ncartridge to a spot of diameter 0.15 mm at the workpiece. The pulse frequency was varied in proportion to \nspeed in order to maintain a constant spatial distribution of pulses on the surface; for this work it was set at \n1000 pulses \/ dots per inch.  \nIn order for artistic designs to be created on the workpiece by the system two different control methods \nwere used. \n• Where an area of even, predefined colour was required, the laser scanning parameters and area were \npre-programmed with the help of Adobe Illustrator and Corel Draw software packages. A series of \nparallel beam traces performed in a raster pattern on the required area in ambient air was then used to \nform a titanium oxide film on the surface. The relationship between the laser parameters and final \ncolour were obtained through experience. Existing literature in the field can provide a guide but many \nfactors are difficult to predict. For example the specific energy parameters used by Pérez del Pino et al \n[19,20]and Fedenev et al [22] to produce comparable results differed by orders of magnitude because \nof different surface absorptivity, heat conduction at the workpiece and other effects pointed out by \nFedenev et al. \n• Where rapidly varying colour was required, the same CO2 laser was driven by a bitmap obtained from \na digital graphics package such or scanned drawing. The intensity of laser flux delivered to the \nworkpiece surface at each position was based on the bitmap. The resulting marks on the titanium \nsurface replicated the original drawing and appeared to have been applied by hand quite \nspontaneously. The exact colours obtained were however less predictable than those obtained by the \nformer method. \nAfter completion of a part, surfaces were tested by non-destructive methods. The samples were \nphotographed under natural light using a Canon EOS digital camera set to maximum resolution. Images \nwith no colour correction were transferred directly to microcomputer and treated areas analysed using \nAdobe Photoshop software for colour balance. This is a considerably simpler method of characterising the \nsurface appearance than the spectrophotometry-based techniques used by previous researchers, but as the \nrelationship between visible appearance and TiO2 layer thickness is now well established [20,23] it was not \nnecessary to repeat that analysis. The surface produced by one set of laser parameters was also tested for \nphase composition with a Phillips X-Pert MPD diffractometer using Cu Kα radiation (λ = 1.54 A) \nmeasuring using a thin film method. The incidence angle was approximately 0.7°. \n3. Results and Discussion \n3.1. Artistic Perspective \nFigure 1 shows Ocular no 5. This object was made with the intention to hold rather than wear. Thumb and \nindex finger prints of the author’s have been marked onto acrylic holding points, directly informing the \nviewer about where to hold the piece. The lens, reclaimed from a camera, distorts the vision. The colours \nand order of the pattern applied are the author’s aesthetic choice which are based, as all this work, on the \noriginal experiments done by CO2 laser on the titanium. Figure 2 shows the laser process parameters used \nto produce the upper and lower surfaces of this  piece. \n 5\n \nFigure 1: Ocular no. 5.  The colour visible on the titanium is controlled by different laser parameters \nshown in Figure 2 \n \n \nFigure 2: Laser parameters for Ocular Series no. 5. (power and speed are given as a % of the maximums \nof 60 W and mm\/s repectively) \n \nFigure 3 shows Ocular 2, containing a square lens. The author’s thumbprints and other fingerprints are an \nimportant feature of this piece. Prints were taken using indelible ink then scanned. Various techniques in \nPhotoshop were then used to manipulate the resulting image with added text in layers that were sent \nthrough to the laser for marking in different stages. The position of the fingerprints indicates the manner in \nwhich the viewer should hold the piece to look through the lens which has also been recovered from a \ncamera and greatly distorts the view. \n 6\n \nFigure 3: Ocular Series no. 2.  The colour visible on the titanium is controlled by different laser \nparameters shown in Figure 2 \n \nFigure 4 shows Ocular 3, with chain and random marking. The design for this piece is grounded in the \naesthetic of instruments used for optical measuring as well as in a fundamental need to get away from the \npredictable digital appearance of laser processed work. For this reason the marks are taken directly from \noriginal drawings which were scanned into digital form (Figure 5). This is an important strand of on-going \npractice as it is essential to understand form, shape and colour. For a maker of objects this is logical \nalthough the link between drawing and making is obvious but not always straightforward and linear. The \nsimultaneous advance of the multi-stranded animal that is art practice is in constant evolution. It is a \nquestion of harnessing the resulting energy into considered shape and form. \n \nFigure 4: Ocular Series no 3.  Titanium marked on the basis of the bitmap file shown in Figure 5 \n \n \nFigure 5: Drawing converted to bitmap for control of laser surface oxidation of titanium \n 7\n3.2. Engineering Perspective \nThe range of colours created on the titanium surface in Ocular mo. 5 were analysed as described in section \n2.1. Results of the optical analysis are shown in Tables 1 (constant speed, variable power) and Table 2 \n(variable speed, constant power). \nTable 1. Laser treated titanium surfaces – parameters and effects at constant traverse speed \nMean power \n(W) \nSpeed \n(mm\/s) \nColour R G B \nTiO2 depth \n(nm) ** \n10 30 Golden 137 102 64 35 \n20 30 Deep blue 28 45 71 60 \n30 30 Green-blue 81 109 110 80 \n40 30 Pale green 124 130 118 95 \n50 30 Pink-brown 132 119 111 130 \n60 30 Brown 84 81 72 190 \n*by matching colours to the results of [20,23] \nTable 2. Laser treated titanium surfaces – parameters and effects at constant laser power \nMean power \n(W) \nSpeed \n(mm\/s) \nColour R G B \nTiO2 depth \n(nm) ** \n100 10 Grey 70 89 96 200+ \n100 30 Brown-Grey 62 61 56 190 \n100 50 Dull green-red 110 95 88 180 \n100 80 Pink-brown 114 116 94 130 \n100 100 Mid green 82 89 81 100 \n100 150 Blue-green 34 52 62 70 \n*by matching colours to the results of [20,23] \nFigure 6 shows the results obtained from grazing incidence X-ray diffraction analysis of the surface treated \nat 60 W and 100 mm\/s and appearing dull green in colour. The four significant phases highlighted were \nhexagonal α-Ti, cubic TiO, tetragonal rutile TiO2 and hexagonal Ti2O titanium oxides. The reference peak \npositions of these phases are shown on separate spectra for clarity. \nPeaks corresponding to the underlying α-Ti are very strong, evidencing the very thin nature of the surface \nlayer that had developed. They also provide an almost perfect match to reference angles of diffraction \ngiving good confidence in the accuracy of the measurements. There is evidence for the presence of TiO, \nalthough as can be seen from Figure 6(b), the diffraction peaks are smaller than the reference values by \nincreasing amounts on moving from left to right. This indicates a slightly larger lattice parameter than \nexpected which could have been caused by a gradual transition between phases. Indeed, it can be seen that \na number of the peaks are quite broad which can be indication of a graded phase structure. \nRutile TiO2, which is normally obtained at high temperatures such as 800°C, and held by most authors to be \nresponsible for the interference colours seen on the surfaces is clearly present. Gyorgy et al [24] concluded \nthat during pulsed (300 ns) Nd:YAG laser irradiation of Ti under ambient conditions, oxidation proceeds \nfrom TiO present in the early stage of the irradiation, through Ti2O3, until the formation of the TiO2 rutile \nphase at high number of pulses. In this case each part of the surface received only 6 pulses (1000 dpi \nsurface coverage, spot diameter 0.15 mm) so it is likely another mechanism was responsible for this phase. \nNo Ti2O3 or anatase TiO2 was detected in this investigation. \nThe third oxide found was the hexagonal Ti2O titanium oxide. This is of the same lattice structure as the \nunderlying α-Ti and probably formed lower in the surface layer, partly integrated with it. In all the XRD \n 8\nresults are in agreement with the theory of a graded surface layer progressing from an outer layer of TiO2 to \nlower layers of more Ti rich oxides [20]. \n \n \nFigure 6: Grazing incidence X-ray diffraction spectrum from the surface of a laser treated titanium sample \n(60 W, 100 mm\/s) \n \n4. Conclusion \nA moderate power (60 W), pulsed CO2 laser directed via an X-Y beam positioning system within an \nintegrated system and interfaced with commercial graphics software has been found a very efficient tool for \ncreation of controlled and even areas of colour and of designs that appear spontaneous on the surface of \ncommercial purity Titanium plate. Rutile nitrogen oxide, TiO2, usually considered to form an outer surface \nlayer and be responsible for interference colours, plus TiO and Ti2O titanium oxides were detected on the \nsurface. Results are consistent with the theory of a graded surface layer progressing from an outer layer of \nTiO2 to lower layers of more Ti rich oxides. \nThe artefacts shown in this paper are an illustration of how the tools and techniques used by researchers in \nscience and engineering can be adopted by the creative industries. The exhibition at The Manchester \n 9\nMuseum that this paper accompanies is also a demonstration of how art can help the public understanding \nof a particular discipline that can seem remote and alien. An alloy of two different cultures has been \nreached by mutual collaboration, demonstrating how both stand to gain much from each other. \n5. Acknowledgement \nThe authors would like to thank Professors Andrew Gale and Lin Li of the School of Mechanical, \nAerospace and Civil Engineering at The University of Manchester for support throughout this project and \nfor providing facilities for the work. Thanks also to Manchester Material Science Centre, specifically Judith \nShackleton and Richard Moat, for assistance with X-ray diffraction analysis and useful discussions on the \nresults and to Dr Marc Schmidt of The Laser Processing Research Centre for assistance with laser cutting \nof samples. \n6. References \n[1] O’Hana, S. (2003) ¡Ojo! An exhibition of Spanish Contemporary Jewellery. pp.19 \n[2] Cheung, L., Clarke, B., Clarke, I. (2006) New Directions in jewellery II. Black Dog Publishing. \n[3] Golley J, 1997, Genesis of the Jet: Frank Whittle and the Invention of the Jet Engine, Crowood \nPress \n[4] Broers, A. (2005) The Triumph of Technology, Reith lectures, BBC Radio 4 \n[5] Coode-Adams, B. (2005) Cross Pollination. Artists Newsletter. June. Pp 18-19 \n[6] Kemp, M. (2005) From science in art to the art of science. Nature. Vol. 434, pp 308 – 309  \n[7] Reidy, H, Art of steel, (re Antony Gormley), Professional Engineering 20(10), PE Publishing, \nLondon. \n[8] Murray L K, 2007, Pavement Schmuck, Proceedings of the Inside Out:11th Ars Ornata \nEuropeana symposium, Manchester, UK. \n[9] Grainger J, O’Hana S, Hare-Duke B, Rose N and Gaspar M, 2003, In The Making Foment de les \nArts Decoratives, Convent dels Angels, Barcelona. \n[10] Callinicos E, 2006, Heirlooms, an exhibition of rings, St. Botolphs. London. Buckinghamshire \nChilterns University College. \n[11] O’Hana S, Shoba K, Gale A W and Bond B, 2007, Walking with Scientists. Between Two \nCultures: A dialogue in Jewellery, The Museum of Manchester, Manchester, UK. \n[12] McCullough M, 1998, Abstracting Craft: The Practiced Digital Hand, The MIT Press. \n[13] Armstrong N R and Quinn R K, 1977, Auger and X-Ray Photoelectron Spectroscopic and \nElectrochemical Characterization of Titanium Thin-Film Electrodes, Surface Science 67(2), 451-\n468. \n[14] Lausmaa J, Kasemo B, Mattsson H and Odelius H, 1990, Multitechnique Surface Characterization \nof Oxide-Films on Electropolished and Anodically Oxidized Titanium, Applied Surface Science \n45(3), 189-200. \n[15] Delplancke J L and Winand R, 1988, Galvanostatic Anodization of Titanium .1. Structures and \nCompositions of the Anodic Films, Electrochimica Acta 33(11), 1539-1549. \n[16] Sharma A K, 1992, Anodizing Titanium for Space Applications, Thin Solid Films 208(1), 48-54. \n[17] Bartlett L, 2006, An unusual phenomenon observed when anodising CP titanium to produce \ncoloured surfaces for jewellery and other decorative uses, Optics and Laser Technology 38(4-6), \n440-444. \n[18] Langlade C, Vannes A B, Krafft J M and Martin J R, 1998, Surface modification and tribological \nbehaviour of titanium and titanium alloys after YAG-laser treatments, Surface & Coatings \nTechnology 101(1-3), 383-387. \n[19] Pérez del Pino A, Serra P and Morenza J L, 2002, Coloring of titanium by pulsed laser processing \nin air, Thin Solid Films 415(1-2), 201-205. \n[20] Perez del Pino A, Fernandez-Pradas J M, Serra P and Morenza J L, 2004, Coloring of titanium \nthrough laser oxidation: comparative study with anodizing, Surface & Coatings Technology \n187(1), 106-112. \n[21] Carey A M, Steen W M and Watkins D, 1998, Laser Surface Ornamentation, International \nConference on Applications of Lasers and Electro-Optics (ICALEO), LIA, Orlando. \n 10\n[22] Fedenev A V, Alekseev S B, Orlovskii V M, Tarasenko V F, Tkachev A N, Shulepov M A and \nYakovlenko S I, 2003, Oxidation of titanium surface under laser irradiation, Proceedings of the \nProceedings of SPIE - The International Society for Optical Engineering, Wroclaw, Poland, 713-\n716. \n[23] Goldsmiths, 1984, Coloured Refractory Metals for Jewellery, Issue 11, The Worshipful Company \nof Goldsmiths, London. \n[24] Gyorgy E, Del Pino A P, Serra P and Morenza J L, 2004, Structure formation on titanium during \noxidation induced by cumulative pulsed Nd:YAG laser irradiation, Applied Physics A (Materials \nScience Processing) A78(5), 765-70. \n \n \n \n"}