{"doi":"10.1109\/LPT.2006.884751","coreId":"113601","oai":"oai:epubs.surrey.ac.uk:276","identifiers":["oai:epubs.surrey.ac.uk:276","10.1109\/LPT.2006.884751"],"title":"Spectrally resolved approach for modeling short pulse amplification in Er3+-doped fibers","authors":["Yahel, E","Hess, O","Hardy, A"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-11-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"IEEE-INST ELECTRICAL ELECTRONICS ENGINEERS INC","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:276<\/identifier><datestamp>\n      2017-10-31T13:57:33Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/276\/<\/dc:relation><dc:title>\n        Spectrally resolved approach for modeling short pulse amplification in Er3+-doped fibers<\/dc:title><dc:creator>\n        Yahel, E<\/dc:creator><dc:creator>\n        Hess, O<\/dc:creator><dc:creator>\n        Hardy, A<\/dc:creator><dc:publisher>\n        IEEE-INST ELECTRICAL ELECTRONICS ENGINEERS INC<\/dc:publisher><dc:date>\n        2006-11-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/276\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Yahel, E, Hess, O and Hardy, A  (2006) Spectrally resolved approach for modeling short pulse amplification in Er3+-doped fibers   IEEE PHOTONICS TECHNOLOGY LETTERS, 18 (21-24).  pp. 2227-2229.      <\/dc:identifier><dc:relation>\n        10.1109\/LPT.2006.884751<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/276\/","10.1109\/LPT.2006.884751"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"IEEE PHOTONICS TECHNOLOGY LETTERS, VOL. 18, NO. 21, NOVEMBER 1, 2006 2227\nSpectrally Resolved Approach for Modeling Short\nPulse Amplification in Er3+-Doped Fibers\nEldad Yahel, Ortwin Hess, and Amos Hardy, Fellow, IEEE\nAbstract—We study pulse propagation in Er3+-doped fiber am-\nplifiers (EDFA) within the framework of a spectrally resolved pulse\nrate-propagation equations model. Our model accounts for the ef-\nfects of gain dispersion, gain saturation, waveguide and chromatic\ndispersion, and amplified spontaneous emission. This model allows\nus to approximate the effects of nonlinear resonant dispersion on\nshort pulse amplification in doped fibers, without reverting to the\ngeneralized nonlinear Schroedinger equation. Numerical results of\nthe time-dependent power spectrum of the amplified pulse demon-\nstrate subpicosecond pulse propagation in EDFAs.\nIndex Terms—Erbium (Er), optical fiber amplifiers, optical fiber\ndispersion, optical pulse amplifiers.\nI. INTRODUCTION\nRARE-EARTH-DOPED fibers have a broad gain band-width which makes them very attractive for the amplifi-\ncation of subpicosecond optical pulses. For such short pulses,\nnonlinear resonant effects associated with the dopants inversion\nare an important amplifier design consideration. In particular,\nthe finite gain bandwidth, and gain-induced dispersion, can\nseverely distort short amplified pulses [1]–[4]. Optical pulse\npropagation in doped optical fibers is mainly considered ana-\nlytically [5], and in the framework of a generalized nonlinear\nSchroedinger equation [6]. In modeling the amplified pulse,\nthe pulse bandwidth is assumed to be relatively narrow, and\nthe gain is assumed to have either constant, parabolic, or a\nLorentzian lineshape [3]–[6], which does not accurately pre-\ndict the observed atomic susceptibility of the dopant ions in\na glass system [7]. In this contribution, we extend well-es-\ntablished quasi-continuous-wave rate-propagation models of\nerbium-doped fiber amplifiers (EDFA) [8] to the short pulsed\nregime. To this end, a transport equation for the coupled pulse\nspectral components is derived, which accounts for the changes\nin the distribution of the pulse power along the fiber. In our\nmodel, the spectral gain is resolved using experimentally mea-\nsured cross sections, Taylor expansion is not assumed for the\ndispersion, and the modeled pulse bandwidth is not restricted to\nthe precondition of a quasi-monochromatic pulse. The model\nallows us to calculate the time-dependent power spectrum of\nthe pulse, and thus to simultaneously analyze the signal in\nManuscript received February 23, 2006; revised June 27, 2006. The work\nof A. Hardy was supported by the Chana and Heinrich Manderman Chair in\nOptoelectronics at Tel-Aviv University.\nE. Yahel and O. Hess are with the Advanced Technology Institute, University\nof Surrey, Guildford, Surrey GU2 7XH, U.K. (e-mail: E.Yahel@surrey.ac.uk).\nA. Hardy is with the Department of Electrical Engineering, Physical Elec-\ntronics, Tel Aviv University, Tel Aviv 69978, Israel.\nDigital Object Identifier 10.1109\/LPT.2006.884751\nthe time and spectral domains, which is more compliant with\nthe experimentalist’s observations. Furthermore, our model\nincludes the effect of spontaneous emission noise on the pulse\ndynamics [9]. Our approach is limited to pulsewidths of a few\nhundred femtoseconds, for which we can assume thermal equi-\nlibrium of the atomic populations within each Er manifold\n[9]. The new model is employed to demonstrate the effects of\ndopant dispersion on the amplification of short optical pulses\nin the technologically important 1.55- m range wavelengths.\nII. THEORETICAL MODEL\nWe consider a single-clad fiber geometry, for which the core\nsupports a single mode. The core is doped with Er ions with\nuniform concentration . The spectral power densities per\nunit wavelength , representing signal pulse spectral\ncomponents that are emitted and amplified due to the Er ions,\npropagate in the forward direction with a wavelength-depen-\ndent power filling factor . The analysis is based on the\nassumption that the spatial changes in the refractive index are\nsmall. Under this condition, the power transport equation can\nbe extended to take into account dispersion through the pho-\ntons equations of motion [10], as well as the effects of transients\nin the refractive index on the wavelength of streaming photons\n[11]. In particular, the following equation can be derived for the\nrate of change in the spectral power densities per unit wave-\nlength of the propagating pulse (based on [11]):\n(1)\nwhere\nis the speed of light in vacuum, and\nis the effective\ngroup velocity of the pulse spectral component at the vacuum\nwavelength . The effective refractive index of\nthe fundamental LP mode in the core is given by the sum\nof passive and active index contributions [6]. The passive\ncontribution is given by the effective index of the host fiber.\nThe active contribution is derived, to a good approximation,\nusing the Kramers–Kronig transform of the imaginary part of\nthe Er susceptibility [7]. Additional, nonlinear contributions,\ne.g., due to the intensity dependence of the refractive index,\nare disregarded in this work, as we limit ourselves to relatively\nlow pulse intensities. The terms and are\nthe atomic populations of the and Er mani-\nfolds, respectively. Other terms in (1) are representing\nwavelength-dependent emission and absorption cross section\n1041-1135\/$20.00 © 2006 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:55 from IEEE Xplore.  Restrictions apply.\n2228 IEEE PHOTONICS TECHNOLOGY LETTERS, VOL. 18, NO. 21, NOVEMBER 1, 2006\nFig. 1. Dependence of the dispersion parameter (D) on the wavelength. The\ninset shows the spectrum of the integrated gain (see [12, eq. (14)]).\nbetween levels and , and the fiber scattering loss\ncoefficient. The power density per unit wavelength term\nrepresents the contribution of the spontaneous emission into the\nguided mode [12]. We note that in contrast to the linear power\nequation that appears in “classical” EDFA theory [8], [9], (1)\nincludes additional terms due to the varying refractive index\ncontributions. Equation (1), coupled with a set of rate equations\nfor the atomic populations of Er ions [12], formulate the\nbasis of our spectrally resolved pulse model.\nIn order to solve (1) numerically, we transform it into a re-\ntarded time frame moving with a reference group velocity\n, by defining a reduced time . Thus, (1)\ncan be written as\n(2)\nwhere the second term on the left-hand side of (2) is due to\nthe dispersion of the pulse spectral components relative to the\nreference frame.\nIII. EXAMPLES\nThe parameters that we consider in the numerical calcu-\nlations correspond to a dispersion-shifted alumino–silicate\nEr -doped fiber. In particular, the Er concentration is\nassumed to be m , the core area is\nm , and the numerical aperture is\nNA . We also assume a constant input pump power of\nmW at m and an m long fiber.\nUnder these assumptions, the gain-induced contribution to the\nrefractive index strongly modifies the fiber dispersion charac-\nteristics. Fig. 1 shows the calculated spectrum of the dispersion\nparameter, i.e., , based on\ncross section data taken from [13]. Here, the passive fiber con-\ntribution includes the waveguide dispersion, and the chromatic\ndispersion of the host, e.g., as calculated from Sellmeier’s\nFig. 2. Contour plot of the pulse intensity (in watts per unit wavelength) at\nthe fiber output, as function of the wavelength and time delay, for an incident\npulse around \u0015 = 1522 nm. Darker shades correspond to higher power levels\n(see inset). Top: temporal intensity, i.e., P (z; t; \u0015)d\u0015 (normalized). Right\nside: spectral intensity, i.e., P (z; t; \u0015)dt (normalized). The solid and dashed\nlines correspond to the intensity distribution of the pulse at z = L and z = 0,\nrespectively. The gain in pulse energy is \u001824.5 dB.\nequation [14]. We note that due to the Er contribution, the\ndispersion parameter takes both positive and negative values at\na spectral range near nm.\nIn what follows, we employ our model in order to an-\nalyze short pulse propagation around nm and\nnm, namely in the anomalous and normal disper-\nsion regimes of the fiber (cf. Fig. 1), respectively. We assume\nthat the incident pulse shape is an unchirped Gaussian, centered\nat with width (FWHM) of fs. We further\nassume that the peak power of the incident pulse is 1 W, and\ntherefore, saturation effects are small in the present calcula-\ntions. The distribution of the incident pulse in the hybrid time\nand wavelength space, i.e., , is calculated using\nthe Wigner distribution function [15]. Thus, the resulting pulse\ndistribution is a transform-limited bell-shaped surface centered\nat . It is worth mentioning, however, that the incident pulse\ncan be resolved using other time-frequency distributions that\nsatisfy the physical margins (i.e., energy conservation).\nFig. 2 shows contour plots of the pulse intensity around\nnm, after amplification along the EDFA, as function of the\nwavelength and the time delay relative to the arrival time of the\npulse temporal intensity peak. That is, we plot .\nThe calculated output pulse intensity is a complex interplay be-\ntween the dispersion and the wavelength dependence of the gain,\nand it significantly deviates from the incident Gaussian pulse\ndistribution. In particular, the short spectral components of the\npulse acquire negative chirp, i.e., longer wavelengths travel in\nslower velocities, due to the anomalous dispersion in the EDFA\n(see Fig. 1). On the other hand, the pulse chirp gradually changes\nsign in the limit of longer pulse spectral components. This, in\nturn, broadens the output pulse by approximately fs\nrelative to the width of the incident pulse. We note that the peak\nof the output pulse spectrum is shifted toward longer wave-\nlengths, due to the preferential amplification of pulse spectral\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:55 from IEEE Xplore.  Restrictions apply.\nYAHEL et al.: SPECTRALLY RESOLVED APPROACH FOR MODELING SHORT PULSE AMPLIFICATION 2229\nFig. 3. Same as Fig. 2, but for an incident pulse around \u0015 = 1535 nm. The\nenergy gain is \u001827.8 dB.\ncomponents near the gain peak ( nm, see inset of\nFig. 1) [6]. We also note that the bandwidth of the output pulse\nis narrower, in about nm, relative to the incident\npulse bandwidth. The output pulse intensity distribution shows\nsomewhat different characteristics for a pulse incident around\nnm, as illustrated in Fig. 3. Here, the shorter pulse\nspectral components acquire positive chirp due to propagation\nin the normal dispersion regime, in agreement with the nega-\ntive value of (see Fig. 1). Also the temporal broadening and\nbandwidth narrowing of the output pulse are fs and\nnm, respectively. Furthermore, the output pulse\nspectrum is strongly asymmetrical due to the gain spectrum,\nand it is pulled towards the gain peak at shorter wavelengths.\nWe also found that the temporal width of an incident pulse can\nbe decreased, provided that the pulse is initially chirped and the\nfiber dispersion induces chirp with opposite sign [1]. We con-\nclude that the output pulse spectrogram strongly depends on the\nrelative position of the gain peak wavelength with respect to the\nincident pulse wavelength.\nIt is worth noting that our calculated intensity distribution,\ni.e., the quantity in (1), can be obtained, to a good\napproximation, by experimentally measuring the spectrogram\nof the amplified pulse using a known gate function. For ex-\nample, using the cross-correlation frequency-resolved optical\ngating pulse measurement setup [16].\nIV. CONCLUSION\nWe have analyzed the effects of resonant dispersion due to\nEr ions on subpicosecond pulse propagation in dispersion-\nshifted EDFA, using a new, spectrally resolved pulse rate-prop-\nagation equations model. Our results demonstrate the temporal\nand spectral characteristics of the amplified pulse. In partic-\nular, the output pulse spectrum, chirp, and temporal broadening\n(or compression) are strongly dependent on the fiber dispersion\nregime and spectral gain, and hence on the incident pulse wave-\nlength. The mathematical model presented in this work allows\nus to approximate broad bandwidth pulse propagation in doped\noptical fibers, without considering the complex field envelope of\nthe pulse. More intense signal pulses, for which nonlinear fiber\neffects are significant, are the subject of a subsequent publica-\ntion.\nACKNOWLEDGMENT\nE. Yahel would like to thank Dr. R. Z. Yahel for drawing his\nattention to the works of G. C. Pomraning, and K. Boehringer\nfor some very fruitful discussions.\nREFERENCES\n[1] J. M. Dudley, L. P. Barry, P. G. Bollond, J. D. Harvey, and R. Leon-\nhardt, “Characterizing pulse propagation in optical fibers around 1550\nnm using frequency-resolved optical gating,” Opt. Fiber Tech., vol. 4,\npp. 237–265, 1998.\n[2] M. Romagnoli, F. S. Locati, F. Matera, M. Settembre, M. Tamburrini,\nand S. Wabnitz, “Role of pump-induced dispersion on femtosecond\nsoliton amplification in erbium-doped fibers,” Opt. Lett., vol. 17, no.\n13, pp. 923–925, Jul. 1992.\n[3] A. C. Peacock, R. J. Kruhlak, J. D. Harvey, and J. M. Dudley, “Soli-\ntary pulse propagation in high gain optical fiber amplifiers with normal\ngroup velocity dispersion,” Opt. Commun., vol. 206, pp. 171–177, May\n2002.\n[4] D. B. S. Soh, J. Nilsson, and A. B. Grudinin, “Efficient femtosecond\npulse generation using a parabolic amplifier combined with a pulse\ncompressor. ii. finite gain-bandwidth effect,” J. Opt. Soc. Amer. B, vol.\n23, no. 1, pp. 10–19, Jan. 2006.\n[5] M. B. Hoffman and J. A. Buck, “Erbium resonance-based dispersion\neffects on subpicosecond pulse propagation in fiber amplifiers: Analyt-\nical studies,” J. Opt. Soc. Amer. B, vol. 13, no. 9, pp. 2012–2016, Sep.\n1996.\n[6] G. P. Agrawal, “Optical pulse propagation in doped fiber amplifiers,”\nPhys. Rev. A, vol. 44, no. 11, pp. 7493–7501, Dec. 1991.\n[7] E. Desurvire, “Study of the complex atomic susceptibility of er-\nbium-doped fiber amplifiers,” J. Lightw. Technol., vol. 8, no. 10, pp.\n1517–1527, Oct. 1990.\n[8] C. R. Giles and E. Desurvire, “Modeling erbium-doped fiber ampli-\nfiers,” J. Lightw. Technol., vol. 9, no. 2, pp. 271–283, Feb. 1991.\n[9] E. Desurvire, Erbium-Doped Fiber Amplifiers Principles and Applica-\ntions, 1st ed. New York: Wiley, 1994.\n[10] E. G. Harris, “Radiative transfer in dispersive media,” Phys. Rev., vol.\n138, no. 2B, pp. 479–485, Apr. 1965.\n[11] G. C. Pomraning, “Radiative transfer in dispersive media,” Astrophys.\nJ., vol. 153, pp. 321–324, Jul. 1968.\n[12] E. Yahel and A. Hardy, “Efficiency optimization of high-power,\nEr -Yb -codoped fiber amplifiers for wavelength-division-mul-\ntiplexing applications,” J. Opt. Soc. Amer. B, vol. 20, no. 6, pp.\n1189–1197, Jun. 2003.\n[13] W. L. Barnes, R. I. Laming, E. J. Tarbox, and P. R. Morkel, “Absorp-\ntion and emission cross section of Er doped silica fibers,” IEEE J.\nQuantum Electron., vol. 27, no. 4, pp. 1004–1010, Apr. 1991.\n[14] G. Ghosh, M. Endo, and T. Iwasaki, “Temperature-dependent sellmeier\ncoefficients and chromatic dispersions for some optical fiber glasses,”\nJ. Lightw. Technol., vol. 12, no. 8, pp. 1338–1342, Aug. 1994.\n[15] J. Paye, “The chronocyclic representation of ultrashort light pulses,”\nIEEE J. Quantum Electron., vol. 28, no. 10, pp. 2262–2273, Oct. 1992.\n[16] S. Linden, J. Kuhl, and H. Giessen, “Amplitude and phase characteri-\nzation of weak blue ultrashort pulses by downconversion,” Opt. Lett.,\nvol. 24, no. 8, pp. 569–571, Apr. 1999.\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:55 from IEEE Xplore.  Restrictions apply.\n"}