{"doi":"10.1179\/174963106x123250","coreId":"65557","oai":"oai:dro.dur.ac.uk.OAI2:5907","identifiers":["oai:dro.dur.ac.uk.OAI2:5907","10.1179\/174963106x123250"],"title":"Book review of 'Living on the lake in prehistoric Europe : 150 years of lake-dwelling research' edited by F. Menotti,  London : Routledge, 2004.","authors":["Skeates, R."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-03-26","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65557.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5907\/1\/5907.pdf","pdfHashValue":"029a02a88177e81ebf081d62e91bac68d23de3f5","publisher":"Maney","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5907<\/identifier><datestamp>\n      2011-11-17T09:40:36Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Book review of 'Living on the lake in prehistoric Europe : 150 years of lake-dwelling research' edited by F. Menotti,  London : Routledge, 2004.<\/dc:title><dc:creator>\n        Skeates, R.<\/dc:creator><dc:publisher>\n        Maney<\/dc:publisher><dc:source>\n        Environmental archaeology, 2007, Vol.12(1), pp.95-97 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-03-26<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5907<\/dc:identifier><dc:identifier>\n        issn:1461-4103<\/dc:identifier><dc:identifier>\n        issn: 1749-6314<\/dc:identifier><dc:identifier>\n        doi:10.1179\/174963106x123250<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5907\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1179\/174963106x123250<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5907\/1\/5907.pdf<\/dc:identifier><dc:rights>\n        © 2007 Association for Environmental Archaeology.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":[" 1749-6314","issn: 1749-6314","1461-4103","issn:1461-4103"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n01 December 2009\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nSkeates, R. (2007) ’Book review of ’Living on the lake in prehistoric Europe : 150 years of lake-dwelling\nresearch’ edited by F. Menotti, London : Routledge, 2004.’, Environmental archaeology., 12 (1). pp. 95-97.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1179\/174963106x123250\nPublisher’s copyright statement:\n2007 Association for Environmental Archaeology.\nAdditional information:\nwww.maney.co.uk\/journals\/env ; www.ingentaconnect.com\/content\/maney\/env\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \nDurham Research Online \n \nDeposited in DRO: \n01 December 2009 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nPublished version \n \nCitation for published item: \nSkeates, R. (2007) 'Book review of 'Living on the lake in prehistoric Europe : 150 years of \nlake-dwelling research' edited by F. Menotti, London : Routledge, 2004.', Environmental \narchaeology., 12 (1). pp. 95-97. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1179\/174963106x123250 \nwww.maney.co.uk\/journals\/env \nwww.ingentaconnect.com\/content\/maney\/env \n \nPublisher’s statement: \n© 2007 Association for Environmental Archaeology. \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nPu\nbl\nish\ned\n b\ny \nM\nan\ney\n P\nub\nlis\nhi\nng\n (c\n) A\nss\noc\niat\nion\n of\n E\nnv\niro\nnm\nen\ntal\n A\nrch\nae\nolo\ngy\nReviews\nMenotti, F. (ed.). 2004. Living on the Lake in\nPrehistoric Europe: 150 Years of Lake-Dwelling\nResearch. London: Routledge. ISBN 0415317207.\n286 pp. £22.99 (paperback).\nIn 1854, Ferdinand Keller initiated excavations at\nMeilen on Lake Zurich and published a first report\non his fieldwork, in which he sensationally inter-\npreted the archaeological remains as evidence of a\nprehistoric village built on piles in the water. His\nsuccessive publications, evocatively illustrated with\nreconstructions based upon ethnographic analogies,\ngenerated widespread scientific excitement. Indeed,\nthey arguably changed the course of European\nprehistoric archaeology, inspiring scholars to search\nfor similar remains throughout Europe, including\nBritain.\nThis volume celebrates the 150th anniversary of\nKeller’s pioneering work. It presents 12 papers on\nEuropean lake-dwelling research, packaged between\na foreword by Barry Cunliffe, an introduction by the\neditor, Francesco Menotti, and a strong conclusion\nby Andrew Sherratt, which situates this distinctive\ncircum-Alpine settlement form in the context of\nEurasian settlement archaeology. The chapters are\nillustrated by a good number of high quality\nphotographs, and rounded off by an index.\nA characteristic feature of the prehistoric lake-\nvillages, rightly reiterated throughout the volume, is\nthe exceptional state of preservation of organic\nmaterials found at them. This has provided archae-\nologists with a wealth of detailed evidence concerning\npast ways of life and environmental conditions.\nComplete plans of prehistoric villages have been\nidentified, consisting of rows or clusters of 10 to 40\nhouses, enclosed initially by fences, palisades or more\ncomplex fortifications, and reached by a path or\ntrackway. Large wooden artefacts provide some of\nthe earliest direct evidence of wheeled transport and\nploughing in Europe. A wide range of smaller\nartefacts of wood, wicker, leather and textiles are\nalso present, while plant remains include grain, seeds,\nwild fruits, moss, leaves and weeds of cultivation.\nSeen in this light, the contemporary Iceman’s\nequipment seems altogether less exceptional. At the\nsame time, as some of the contributors point out,\nthere are limitations to this evidence. The state of\npreservation of archaeobotanical remains, for exam-\nple, is by no means the same at all lake villages.\nFocusing on this material, the volume begins with\nan interesting group of papers, which provide\nhistorical overviews of the achievements of lake-\ndwelling research in the six circum-Alpine countries\nwhere wetland archaeology was born (Switzerland,\nGermany, France, Austria, Slovenia and Italy), as\nwell as the UK where it is now thriving. Amongst\nthese, Helmut Schlichtherle provides an outstanding\nsynthesis of work in South-West Germany, including\nreference to relevant environmental research, the\nrelationship between lake-dwelling studies and\nNational Socialist politics in the 1920s and 30s, and\ndebates over the interpretation of lake-dwellings. The\nlatter have been dominated by the ‘Pfahlbauproblem’,\na long-running academic dispute concerning the\nform, location and function of the lake-dwellings.\nOver time, the focus of this debate has gradually\nshifted towards the diversity, origins and develop-\nment of the lake dwellings. It is now widely accepted\nthat lake villages included houses built on piles above\nthe water, houses with slightly raised floors, and\nhouses built on the ground. Dendrochronological\nanalyses have also shown that their construction was\ndynamic and also more complicated than the\nregularity of the village plans previously led us to\nbelieve. In South-West Germany, for example,\ncontemporary lake villages were spaced every 2.5 to\n5 km, they were normally inhabited for periods of 10\nto 80 years, their central areas shifted, the number of\ncoeval buildings varied greatly, and their buildings\nwere renovated or rebuilt at least every few decades.\nThe following set of papers explores the contribu-\ntion of a range of multidisciplinary scientific techni-\nques and studies to lake-dwelling research. This is,\nperhaps, the strongest section of the book. Andre´\nBillamboz provides an excellent chapter on dendro-\nchronology, clearly defining its relation to past and\npresent lake-dwelling research. Looking to the future,\nhe predicts further dendrochronology building south\nof the Alps, and new dendroecology work contribut-\ning to palaeoecological studies. Michel Magny offers\na valuable synthesis of palaeoclimatology research,\nincluding its relevance to questions concerning the\nrelationship between lake levels, lake dwellings and\n\u0001 2007 Association for Environmental Archaeology\nPublished by Maney\nDOI 10.1179\/174963106x123250 Environmental Archaeology 2007 VOL 12 NO 1 95\nPu\nbl\nish\ned\n b\ny \nM\nan\ney\n P\nub\nlis\nhi\nng\n (c\n) A\nss\noc\niat\nion\n of\n E\nnv\niro\nnm\nen\ntal\n A\nrch\nae\nolo\ngy\nlong-term settlement patterns. Long-term research in\nFrance and Switzerland, for example, indicates that\nthe whole Holocene period was punctuated by\nalternate higher and lower lake-level phases, related\nto a rather unstable Holocene climate, and that\nprehistoric lake-shore villages coincided with phases\nof lower lake-levels in the sub-Alpine area. Jo¨rg\nSchibler’s chapter on animal bones identifies some\ninteresting diachronic patterns, and makes useful\nconnections to other lines of archaeological and\npalaeoenvironmental evidence, with reference to\nsubsistence economies and environmental change.\nHe argues, for example, that during unfavourable\nclimatic conditions people hunted more intensively\nand collected more plants, leading to the extinction of\nred deer in the Zurich region during the 37th century\nBC. Pigs, on the other hand, flourished from this time\nonwards, as forest management led to more open,\nstructured, woodland in the lacustrine hinterland.\nStefanie Jacomet clearly summarises the contribution\nof archaeobotany, with particular reference to food\nplants and weeds of cultivation. Archaeobotanical\nstudies at Alleshausen-Grundwiesen, for example,\nindicate a specialisation in flax cultivation without\nany sign of cereal cultivation in the mid-3rd\nmillennium BC. Albert Hafner then offers an inter-\nesting historical overview of underwater excavations\nand related techniques, while Gary Lock outlines the\nrelevance of computer usage in wetland archaeology.\nThe final set of papers covers public archaeology\nthemes. Gunter Scho¨bel provides an original analysis\nof museums, covering the very wide range of media\nused in them to represent lake-dwellings. He calls for\ngreater public accessibility in displays. He also\nexplores their historical development and socio-\npolitical context, including their manipulation for\nNational Socialist propaganda and education, when\n‘The merry lake-dweller at the cosy campfire mutated\nnow into a sinisterly staring Teuton’ (p. 227). Urs\nLeuzinger offers a clear overview of experimental and\napplied archaeology, with particular reference to the\ndecay of pile dwellings, including the impact of lake\nwater flooding. Stefan Hochuli and Gishan Schaeren\nthen provide a useful outline of the heritage manage-\nment of lake villages in Switzerland, emphasising the\nsheer scale of the archaeological enterprise, and\ncalling for archaeologists to ‘market’ their research\nto the fee-paying public.\nOverall, the volume delivers most of what its\npromises on its cover: to provide an overview of the\ndevelopment of lake-village studies, to explore the\nimpact of a range of scientific techniques on our\nunderstanding of the settlements from an environ-\nmental as well as a cultural perspective, and to consider\nhow the public can relate to this evocative branch of\narchaeology. The major value of this book is, then, as a\nsynthesis: of past and present lake-dwelling research,\nand its place within circum-Alpine prehistoric archae-\nology. As Bryony Coles states, ‘So many archaeologists\nworking in wetlands are submerged by the data,\nswamped by the quantities of things and facts’\n(p. 106). This book floats, and congratulations should\nbe offered to Menotti for captaining it. Furthermore,\nthis clear introduction to the subject will be particularly\nwelcome to English-speaking students unfamiliar with\na range of European languages.\nThe volume could, however, have delivered even\nmore. Menotti’s brief introductory chapter is\nslightly disappointing, in contrast to his interesting\npaper on settlement patterns, which highlights\ndiscontinuity in lake settlement compared to\nextensive Middle Bronze Age settlement in neigh-\nbouring dry-land areas. The latter might have\nbeen incorporated within the introduction or first\nset of papers, rather than given its own special\nsection. The first group of papers could have been\nbetter presented in the introduction, especially\nthrough a comparative analysis of the spread of\nlake-dwelling research across Europe. It would also\nhave been useful to learn something of the editorial\nbrief provided to the contributors, particularly\nconsidering the inclusion of two papers by British\nscholars which move well beyond lake-dwelling\nresearch, to the much broader field of wetland\narchaeology, useful as that may be in contextualising\nthe former. The European scope of the volume is also\nundermined by the absence of lake-dwelling studies\nfrom East-Central Europe, and by the regional focus\nof most of the papers. Certain topics might also have\nbeen given greater consideration, including Upper\nPalaeolithic and Mesolithic lacustrine settlement in\nEurope, human remains, post-excavation research,\nand conservation.\nBut the real weakness of the book, which reflects\nan apparent intellectual complacency of lake-\ndwelling studies, is its limited engagement with social\ntheory and the archaeology of people. With the\nexception of Andrew Sherratt, who emphasises this\npoint in his concluding chapter, the contributors\nto the volume maintain traditional functionalist,\nculture-historical and processual perspectives, typi-\nfied by recourse to invading Bell Beaker folk and\nthe defensive function of lake-villages. They conse-\nquently have surprisingly little to say about the\nReviews\n96 Environmental Archaeology 2007 VOL 12 NO 1\nPu\nbl\nish\ned\n b\ny \nM\nan\ney\n P\nub\nlis\nhi\nng\n (c\n) A\nss\noc\niat\nion\n of\n E\nnv\niro\nnm\nen\ntal\n A\nrch\nae\nolo\ngy\npeople who actually built the lake-villages, and\nhow they lived together, experienced, valued and\nidentified with them. Such themes are currently\nbeing addressed by a new kind of anthropological\narchaeology, which seeks to integrate theory,\nmethodology, evidence and interpretations, as well\nas large-scale and more personal histories.\nUltimately, what this volume shows is that the\nEuropean lake-villages still offer a very rich\npotential for exciting future archaeological research.\nA new generation of archaeologists must seize this\nopportunity.\nROBIN SKEATES\nUniversity of Durham, UK\nMonks, G. (ed.). 2005. The Exploitation and Cultural\nImportance of Sea Mammals (Proceedings of the\n9th conference of the International Council for\nArchaeozoology, Durham, August 2002). Oxford:\nOxbow Books. ISBN 1842171267. 192 pp. £40.00\n(hardback).\nThis book is a collection of articles originally given\nat a session at the ICAZ meetings in Durham, 2002.\nAs the focus of the session was a type of animal, and\nnot a particular research question, a wide variety of\ntopics from all over the world are covered. Although\nthis makes it difficult to summarise the book, it also\ngives a broad view of research on marine mammals\nand certainly introduced me to new geographic areas.\nThe papers cover both pinnipeds and cetaceans,\nalthough there are more dealing specifically with\npinnipeds.\nThis volume opens with Sabin’s look at marine\nmammal research and the cetacean collections found\nat the Natural History Museum of London. As\nanyone who works with marine mammals knows,\nextensive comparative collections are rare, especially\nfor whales, so it is instructive to learn of their large\nexisting collection and even more satisfying to know\nthat they are actively adding to that collection. A\nbrief discussion gives a feel for the breadth and time\ndepth of the research projects ongoing at the\nmuseum.\nTwo papers provide summaries of marine mammal\nuse from opposite (or almost opposite!) ends of the\nworld: the Aleutian Islands of Alaska and Tierra\ndel Fuego in South America. Johnson, writing about\nthe Aleutian Islands, brings together ethnographic\ninformation on hunting techniques, equipment and\nmythology with the archaeological information on\ntools and fauna and attempts to find patterns in\nmarine mammal use over time and space. The\nethnographic information is broken down by marine\nmammal and is an extremely useful summary. The\narchaeological data are presented by geographic\nregion with NISP and MNI data from a number of\nsites. The usefulness of this data is marred by\nnumerous errors in the tables, in particular clear\naddition errors in the total columns (see Tables 2 and\n8) and, in some cases, inconsistencies between the\nnumbers on the tables and the numbers used in the\ntext (see p. 49). Even with these problems this paper\nserves as a very useful compilation of information not\neasily available in one place.\nPiana provides a similar summary for Tierra del\nFuego, although he focuses on cetaceans in particu-\nlar. One of Piana’s conclusions is that whales were\nscavenged, but not actively hunted, except possibly in\nthe late historic period. He finds no archaeological\nindication of large harpoons and no whale bones\nshow evidence of being pierced by harpoons. An\ninteresting proposal revolves around the idea of a\nwhale carcass as a quarry for raw materials, which\nthen becomes the basis of a permanent settlement.\nThe extensive bibliography is particularly useful for\nthose of us with little knowledge of the literature from\nthis area.\nSmith and Gifford-Gonzalez et al. both look\nspecifically at interactions between fur seals and\npeople. Smith examines the response of the southern\nfur seal of New Zealand to the arrival of first the\nMaori and then the Europeans. Although hunted\nextensively by both new arrivals the fur seals did not\nbecome extinct, unlike many land-based animals.\nSmith hypothesises this is because neither the Maori\nnor the Europeans could affect the marine environ-\nment as extensively as they could, and did, affect the\nterrestrial environment. In addition, fur seals had\naccess to coastal areas that were difficult for both\nthe Maoris and Europeans to access and could\nadapt to the new hunting pressures by changing their\ndistribution.\nArchaeologists on the west coast of North America\nhave recognised for many years that the modern\ndistribution of marine mammals conflicts with that\nshown archaeologically. Gifford-Gonzales et al. very\nusefully summarise the data supporting these differ-\nences, discuss the possible causes suggested by a\nvariety of authors and propose several avenues of\nresearch to determine the cause (or causes) of these\ndistribution changes. Although in the introductory\nsummary all marine mammal species are discussed at\nleast briefly, the main focus of the authors’ research is\nReviews\nEnvironmental Archaeology 2007 VOL 12 NO 1 97\n"}