{"doi":"10.1109\/TMTT.2007.904064","coreId":"135382","oai":"oai:bradscholars.brad.ac.uk:10454\/4171","identifiers":["oai:bradscholars.brad.ac.uk:10454\/4171","10.1109\/TMTT.2007.904064"],"title":"Computation of Electromagnetic Fields in Assemblages of Biological Cells using a Modified Finite-Difference Time-Domain Scheme","authors":["Abd-Alhameed, Raed A.","Excell, Peter S.","See, Chan H."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"YesWhen modeling objects that are small compared with the wavelength, e.g., biological cells at radio frequencies, the standard finite-difference time-domain (FDTD) method requires extremely small time-step sizes, which may lead to excessive computation times. The problem can be overcome by implementing a quasi-static approximate version of FDTD based on transferring the working frequency to a higher frequency and scaling back to the frequency of interest after the field has been computed. An approach to modeling and analysis of biological cells, incorporating a generic lumped-element membrane model, is presented here. Since the external medium of the biological cell is lossy material, a modified Berenger absorbing boundary condition is used to truncate the computation grid. Linear assemblages of cells are investigated and then Floquet periodic boundary conditions are imposed to imitate the effect of periodic replication of the assemblages. Thus, the analysis of a large structure of cells is made more computationally efficient than the modeling of the entire structure. The total fields of the simulated structures are shown to give reasonable and stable results at 900,1800, and 2450 MHz. This method will facilitate deeper investigation of the phenomena in the interaction between electromagnetic fields and biological systems","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/135382.pdf","fullTextIdentifier":"https:\/\/bradscholars.brad.ac.uk\/bitstream\/10454\/4171\/1\/abd_alhamee.pdf","pdfHashValue":"61e9513b7486c4c22e987f87afa083ce82b9f632","publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/4171<\/identifier><datestamp>\n                2017-03-31T09:45:07Z<\/datestamp><setSpec>\n                com_10454_413<\/setSpec><setSpec>\n                col_10454_6345<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nComputation of Electromagnetic Fields in Assemblages of Biological Cells using a Modified Finite-Difference Time-Domain Scheme<\/dc:title><dc:creator>\nAbd-Alhameed, Raed A.<\/dc:creator><dc:creator>\nExcell, Peter S.<\/dc:creator><dc:creator>\nSee, Chan H.<\/dc:creator><dc:subject>\nElectromagnetic Fields<\/dc:subject><dc:subject>\nBiological Cells<\/dc:subject><dc:subject>\nStandard Finite-Difference Time-Domain<\/dc:subject><dc:subject>\nFDTD<\/dc:subject><dc:description>\nYes<\/dc:description><dc:description>\nWhen modeling objects that are small compared with the wavelength, e.g., biological cells at radio frequencies, the standard finite-difference time-domain (FDTD) method requires extremely small time-step sizes, which may lead to excessive computation times. The problem can be overcome by implementing a quasi-static approximate version of FDTD based on transferring the working frequency to a higher frequency and scaling back to the frequency of interest after the field has been computed. An approach to modeling and analysis of biological cells, incorporating a generic lumped-element membrane model, is presented here. Since the external medium of the biological cell is lossy material, a modified Berenger absorbing boundary condition is used to truncate the computation grid. Linear assemblages of cells are investigated and then Floquet periodic boundary conditions are imposed to imitate the effect of periodic replication of the assemblages. Thus, the analysis of a large structure of cells is made more computationally efficient than the modeling of the entire structure. The total fields of the simulated structures are shown to give reasonable and stable results at 900,1800, and 2450 MHz. This method will facilitate deeper investigation of the phenomena in the interaction between electromagnetic fields and biological systems.<\/dc:description><dc:date>\n2009-12-18T09:21:14Z<\/dc:date><dc:date>\n2009-12-18T09:21:14Z<\/dc:date><dc:date>\n2007<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\npublished version paper<\/dc:type><dc:identifier>\nAbd-Alhamee, R.A., Excell, P.S. and See, C.H. (2007). Computation of Electromagnetic Fields in Assemblages of Biological Cells using a Modified Finite-Difference Time-Domain Scheme. IEEE Transactions on Microwave Theory and Techniques. Vol. 55, No. 9, pp. 1986-1994.<\/dc:identifier><dc:identifier>\n90002586<\/dc:identifier><dc:identifier>\n90013992<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/4171<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/dx.doi.org\/10.1109\/TMTT.2007.904064<\/dc:relation><dc:rights>\nCopyright © 2007 IEEE.  Reprinted from  IEEE Transactions on Microwave  Theory and Techniques, Vol. 55, No. 9.\\ud\nThis material is posted here with permission of the IEEE. Such permission of the IEEE does not in any way imply IEEE endorsement of any of the University of Bradford's products or services.  Internal or personal use of this material is permitted.  However, permission to reprint\/republish this material for advertising or promotional purposes or for creating new collective works for resale or redistribution must be obtained from the IEEE by writing to pubs-permissions@ieee.org.\\ud\nBy choosing to view this document, you agree to all provisions of the copyright laws protecting it.<\/dc:rights>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1109\/TMTT.2007.904064"],"year":2007,"topics":["Electromagnetic Fields","Biological Cells","Standard Finite-Difference Time-Domain","FDTD"],"subject":["Article","published version paper"],"fullText":"1986 IEEE TRANSACTIONS ON MICROWAVE THEORY AND TECHNIQUES, VOL. 55, NO. 9, SEPTEMBER 2007\nComputation of Electromagnetic Fields in\nAssemblages of Biological Cells Using a Modified\nFinite-Difference Time-Domain Scheme\nChan H. See, Raed A. Abd-Alhameed, and Peter S. Excell, Senior Member, IEEE\nAbstract—When modeling objects that are small compared with\nthe wavelength, e.g., biological cells at radio frequencies, the stan-\ndard finite-difference time-domain (FDTD) method requires ex-\ntremely small time-step sizes, which may lead to excessive com-\nputation times. The problem can be overcome by implementing a\nquasi-static approximate version of FDTD based on transferring\nthe working frequency to a higher frequency and scaling back to\nthe frequency of interest after the field has been computed. An ap-\nproach to modeling and analysis of biological cells, incorporating a\ngeneric lumped-element membrane model, is presented here. Since\nthe external medium of the biological cell is lossy material, a mod-\nified Berenger absorbing boundary condition is used to truncate\nthe computation grid. Linear assemblages of cells are investigated\nand then Floquet periodic boundary conditions are imposed to im-\nitate the effect of periodic replication of the assemblages. Thus, the\nanalysis of a large structure of cells is made more computation-\nally efficient than the modeling of the entire structure. The total\nfields of the simulated structures are shown to give reasonable and\nstable results at 900, 1800, and 2450 MHz. This method will facil-\nitate deeper investigation of the phenomena in the interaction be-\ntween electromagnetic fields and biological systems.\nIndex Terms—Finite difference time domain (FDTD), Floquet\nperiodic boundary conditions, quasi-static method.\nI. INTRODUCTION\nRESEARCH INTO possible mechanisms of interactionof electromagnetic (EM) fields with biological tissues\nand cells in culture has motivated a growing need for accurate\nmodels describing the EM behavior of cells exposed to these\nfields. Therefore, several numerical models have been created\nin order to study the interaction between EM fields and biolog-\nical entities, at the tissue, cell, and ionic levels. In this area, the\nmost frequently used technique for computing the EM field is\nthe finite-difference time-domain (FDTD) method [1], [2] due\nto its independence from the material parameters.\nThe original FDTD method requires extremely small\ntime-step sizes when modeling electrically small regions (much\nsmaller than a wavelength): this is especially the case when\nmodeling biological cells since they have maximum dimensions\nof a few tens of micrometers. Thus, it can become impractical\ndue to the unaffordable computation times required. This\nproblem can be solved by implementing a quasi-static approxi-\nmate version of FDTD. This approach is based on transferring\nManuscript received August 4, 2006; revised March 24, 2007.\nThe authors are with the Mobile and Satellite Communication Re-\nsearch Centre, University of Bradford, Bradford BD7 1DP, U.K. (e-mail:\nc.h.see1@brad.ac.uk; r.a.a.abd@brad.ac.uk; p.s.excell@brad.ac.uk).\nDigital Object Identifier 10.1109\/TMTT.2007.904064\nthe working frequency to a higher frequency to reduce the\nnumber of time steps required. The generated internal field at\nthe higher frequency can then be scaled back to the frequency\nof interest [3]–[6].\nCells are surrounded by thin membranes, typically a few\nnanometers thick [7]. They are the major barrier in the cell,\nseparating the inside of the cell from the exterior medium. It\nis this structure that allows cells to selectively interact with\ntheir environment. Therefore, the cell membrane has been\nidentified as the primary target for the study of possible actions\nof EM fields on biological structures. Since the thickness of the\nmembrane is approximately 1000 times smaller than the width\nof a typical biological cell, if the standard FDTD procedure\nwere to be blindly applied to model detail in the membrane\nwithin a complete cell model, this would cause some millions\nof iterations to be required to complete one cycle of simula-\ntion. This again would cause excessive computation time. To\novercome this drawback in standard FDTD, the lumped-ele-\nment FDTD method [8]–[11] was implemented to model the\nbehavior of the membrane. A generic long-established model\n(the Hodgkin–Huxley (HH) model [12]–[16]) was used to\ndemonstrate the functionality of this method: it is known that\nthe HH model is imperfect for microwave frequencies, but it\nis reasonable to use it as a working hypothesis (as have others\n[4]) to develop modeling techniques while operational versions\nof improved models are still in development.\nFor the sake of simplicity, the analyzed structure has been\nrepresented with spherical or cubical cells, and Floquet periodic\nboundary conditions [17]–[20] have been applied to the border\nof the analyzed structure in order to mimic the presence of the\nsurrounding cells. Although cellular tissues are not perfectly pe-\nriodic and living cells are not precisely spheres or cubes, these\napproximations allow a reasonable approach to the modeling of\nbiological tissue using only a small part of the structure, while\nalleviating the problem of the huge requirement of computer re-\nsources for the simulation of a complete body of tissue. Since\nthe external medium of the biological tissue is lossy fluid, the\nmodified Berenger perfectly matched layer (PML) absorbing\nboundary condition [21]–[24] is used to truncate the compu-\ntation grid, in order to reduce the reflections on the interface\nlayers: this is more accurate than the Mur boundary condition\n[25], [26] used in other recent work [4].\nA further difficulty is the limited extent of studies on the di-\nelectric properties of cell tissues [27]; thus, the complex per-\nmittivity of each cell tissue is not clearly established for radio\nfrequencies. However, in this study, an analytical method for es-\ntimating the electrical properties of cell tissues in the RF band\n0018-9480\/$25.00 © 2007 IEEE\nAuthorized licensed use limited to: University of Bradford. Downloaded on December 18, 2009 at 04:19 from IEEE Xplore.  Restrictions apply. \nSEE et al.: COMPUTATION OF EM FIELDS IN ASSEMBLAGES OF BIOLOGICAL CELLS USING MODIFIED FDTD SCHEME 1987\n[28] will be adopted throughout the analysis. Earlier work only\nconsidered two media (water and membrane) [4], but the pro-\ncedure adopted here enables the tissue model to consist of three\nmedia (lossy medium, membrane, and cytoplasm). In addition,\na mass of connected biological tissue is simulated by creating\nan equivalent stack of compacted cells (both spherical, with in-\nterstices, and fully compacted cubical). The total electric fields\nalong the central axes of rows of these spherical and cubical cel-\nlular structures will be investigated.\nII. SUMMARY OF METHOD\nA. Quasi-Static FDTD Scheme\nThe interaction between animals and humans exposed to ex-\ntremely low-frequency electric fields was investigated by Kaune\nand Gillis [29] and Guy et al. [30] in 1981 and 1982, respec-\ntively. Their research results furnish valuable analytical and ex-\nperimental verification of the concept of quasi-static coupling\nat power-line frequencies. Later authors [5], [6], [31] imple-\nmented the same principles using FDTD to study the numerical\ndosimetry of anatomically based models. Recently, the same\nidea was further extended to modeling the interaction between\nEM fields and biological tissue at mobile communication fre-\nquencies, i.e., GSM900 and GSM1800 [4].\nIn order to implement the quasi-static approximation to ana-\nlyze scattering problems, the maximum dimension of the struc-\nture under investigation must be less than approximately one-\ntenth of the wavelength in the surrounding medium [29], [30].\nAccording to the scaling relationship between the fields at fre-\nquencies and that was derived in [5] and [30], a higher\nworking frequency that still falls within the quasi-static\nregime can be chosen to excite the model to reduce the com-\nputation time.\nB. Modified Berenger PML\nThe PML, introduced by Berenger [21] in 1994, allowed\nboundary reflections below 80 dB to be realized. The PML is\nbased on surrounding the FDTD problem space with a highly\nlossy and matched nonphysical absorber. It has been found\nto be the most accurate technique of the absorbing boundary\nconditions available and has become standard in most current\nFDTD implementations [32]. For the case of PML layers with\nconductivities increasing geometrically, the geometric grading\nfactor ( ) can be modified in order to reduce the reflection on\nthe interface layer when the problem space is entirely within\na lossy-medium environment. An empirical expression from\nwhich can be found, and which has been found to give good\nresults [23], [24] is\n(1)\nwhere is the spatial increment of the FDTD mesh, is\nthe normal reflection coefficient, is the number of the cells\nin the PML thickness, and is the velocity of EM waves in the\nenvironment concerned.\nC. Floquet Periodic Boundary Condition\nMany structures of EM interest are electrically very large and,\nhence, pose great difficulties for computational simulation. One\napproach that can be used to reduce the size of the computational\ntask is to exploit any periodicity in the structure in one or more\ndimensions: this concept will be exploited here, assuming that\na sample of tissue is formed from a periodic grid of biological\ncells. In order to perform EM analysis on these types of structure\nwith reasonable computational time, the structures are assumed\nto be an infinite grid and the problem can then be reduced to a\nunit-cell analysis via use of the Floquet boundary condition to\nsimulate the effect of the periodic replication.\nThe FDTD technique was applied to the basic structure due\nto its simplicity and flexibility. FDTD has already been success-\nfully extended to incorporate the Floquet theorem for the case\nof normal [17], [33] and oblique incidence [34], [35] for 2-D\nand 3-D problems. The techniques used to combine FDTD with\nthe Floquet periodic boundary condition can be classified into\ntwo categories, i.e., direct field methods and field transforma-\ntion methods [2].\nD. Lumped-Element Membrane Model\nCells are surrounded by a thin membrane, which is the major\nbarrier separating the cell from its environment (normally a\nliquid). Since the cell needs to get nutrients in and waste out,\nthe membrane must be able to accommodate this. Therefore,\nthe membrane has to act as a selective barrier, allowing nutri-\nents to pass in, but keeping out many substances harmful to\nthe cell, and acting as a dynamic barrier medium, constantly\nadapting to changing environmental conditions (e.g., different\nconcentrations of ions).\nThe dimensions of a biological cell are around a few tens of\nmicrometers and the thicknesses of the membranes are in the\nscale of a few nanometers, strongly depending on the type of the\ntissue. Depending on the type of the cell, voltages in the range of\n20–200 mV can arise across the membrane. When the cell is in\na resting state, the current across the membrane averages zero,\nbut more generally, it depends on the variation of the membrane\nvoltage [12].\nHodgkin and Huxley gave a general description of the time\ncourse of the current that flows through the membrane of the\nsquid giant axon when the potential difference across the mem-\nbrane was suddenly changed from its steady state. The results in\n[12] suggest that the behavior of membrane may be represented\nby an electric circuit [4], [12]. Current can be carried through\nthe membrane either by charging the membrane capacitance or\nby movement of ions through the nonlinear conductance in par-\nallel with the membrane capacitance. A set of equations gov-\nerning the model is given in [4] and [12].\nIII. IMPLEMENTATION AND VALIDATION\nA. Lumped-Element Model Implementation\nTo verify the correctness of the implementation of the HH\nmodel within the FDTD framework, the results of the analyt-\nically computed solution have been used for comparison. The\nAuthorized licensed use limited to: University of Bradford. Downloaded on December 18, 2009 at 04:19 from IEEE Xplore.  Restrictions apply. \n1988 IEEE TRANSACTIONS ON MICROWAVE THEORY AND TECHNIQUES, VOL. 55, NO. 9, SEPTEMBER 2007\nFig. 1. Field distribution in and around a single isolated cell.\nHH model was implemented on a spherical structure with di-\nameter of 50 m and discretized with 1- m steps in order to\ncheck for the expected polarization voltage of 60.27 mV on\nthe membrane [4]. The HH model was included on the sur-\nface of the cell, while the regions internal and external to the\nsphere were considered as cytoplasm and lossy medium, re-\nspectively. It should be noted that the lumped-element FDTD\nmethod has been successfully modified in order to allow ar-\nbitrary positioning of lumped elements inside FDTD elements\nrepresenting the membrane, not necessarily aligned with the\nFDTD grid [4], so that they represent the structure more ex-\nactly than simple FDTD. Fig. 1 depicts the expected polarization\nvoltage of 60.27 mV appearing on the membrane of the spher-\nical structure without any external excitation.\nB. Quasi-Static FDTD Validation\nHere, a simple example will be given to illustrate this\nmethod: the results will be compared with the Mie series\nanalytical solution [36], [37]. A two-layer sphere simulating\na biological cell inside a lossy medium was considered for\nwhich the assumed properties were as follows [38]: cyto-\nplasm (internal) , S\/m; membrane\n, S\/m; external lossy medium ,\nS\/m. The radius of the internal region was 25 m\nand the membrane thickness was set to 2 m. The operating\nfrequency was 2.45 GHz, whereas the interim transformed\nfrequency used in this example was 30 GHz. From (1), the\noptimum grading factor is 6.07 for an FDTD cell size of 1 m.\nIt should be noted that this model in the FDTD computation\ndomain is excited by a standard plane wave of amplitude 1 V\/m,\npropagating in the -direction and polarized in the -direction.\nThe field distributions along the two central axes of the layered\ncell are depicted in Figs. 2 and 3. As can be seen, the numerical\nresults are in good agreement with the analytical ones. It should\nFig. 2. Electric field (E ) distribution along principal axes of a double-layer\nsphere in lossy medium, excited by a plane wave of 1 V\/m at 2450 GHz.\nFig. 3. Electric field (E ) distribution along the x-axis for double-layer sphere\nin lossy medium, excited by plane wave of 1 V\/m at 2450 GHz.\nbe noted that the method was executed for a total time equal to\nfour cycles.\nC. Implementation of Floquet Boundary Condition\nThe implementation of Floquet boundary conditions, quasi-\nstatic FDTD, and the current modified PML for a lossy medium\nexcited by a 100-V\/m plane wave at an operating frequency of\n900 MHz is demonstrated here. The lossy medium properties\nwere and S\/m. The problem space and cell\nsizes were 21 21 121 and 10 m, respectively. The Floquet\nboundary conditions were imposed on four sides of the lossy\nmedium. The remaining two sides were each terminated by a\nPML of six cells. The analyses were performed at 10, 15, and\n20 GHz and then transferred back to the desired operating fre-\nquency of 900 MHz. As can be observed in Fig. 4, the analytical\nand computed results are in good agreement.\nAuthorized licensed use limited to: University of Bradford. Downloaded on December 18, 2009 at 04:19 from IEEE Xplore.  Restrictions apply. \nSEE et al.: COMPUTATION OF EM FIELDS IN ASSEMBLAGES OF BIOLOGICAL CELLS USING MODIFIED FDTD SCHEME 1989\nFig. 4. Electric field along the center of the lossy medium.\nFig. 5. 2-D view of the simulated periodic structure in the FDTD computational\ndomain, extended by the Floquet boundary condition.\nIV. SIMULATION AND RESULTS\nA. Connected Tissue Model Using Spherical Cells\nA stack of ten spherical cells was investigated, as shown in\nFigs. 5 and 6. The radius of the each cell was 10 m. The model\ncontained three media, cytoplasm, membrane, and extracellular\nmedium, and the dielectric properties of these were obtained\nfrom [28], as tabulated in Table I. A plane wave of 100 V\/m\npropagating in the -direction and polarized in the -direction\nwas used as the excitation. Note that the incident plane wave\nexcitation was applied on a plane lying between the PML re-\ngion and the outer limit of the FDTD grid. In addition, in order\nto reduce high-frequency transients [39], [40] and dc offsets\n[41], [42] sometimes associated with unramped sine-wave exci-\ntations, the ramped sinusoidal source in (2) was adopted, multi-\nplying the excitation source of 100 V\/m with the functions\ngiven [41]\n(2)\nFig. 6. 3-D view of the basic simulated spherical structures in the FDTD com-\nputational domain.\nTABLE I\nELECTRICAL PROPERTIES OF THE SIMULATED MEDIA\nAT RELEVANT FREQUENCIES\nwhere is the duration of the ramped cosine regime, which is\napproximately three source cycles.\nThe PML, shown in Fig. 6, was six FDTD elements wide, the\ngrading factor was 10.1383, and the grid structure was effec-\ntively extended to infinity in the - and -directions by imposing\nthe Floquet boundary condition along the - and -axes. The\nFloquet periodic boundary condition plays an important role to\nmimic the presence of an extended 3-D structure of biological\ncells, simulating connected tissue. This can be easily imagined\nin two dimensions, as shown in Fig. 5. The FDTD problem space\nwas 220 20 20 FDTD elements of size 1 m, while a dis-\ncretization time step of 1.3 fs was chosen to drive the FDTD\ncomputation to meet the requirements of the Courant stability\ncriterion.\nBefore implementing the HH lumped-element model into the\nsimulated structure, the effect of moving the Floquet boundaries\ngradually away from the simulated structure was studied. Figs. 7\nand 8 depict the field distribution through the center of the sim-\nulated structure at 10 GHz with varying locations of the Floquet\nboundaries, where is the number of FDTD elements be-\ntween the Floquet boundaries and the boundaries of the biolog-\nical cells, in the - and -directions. Fig. 9 shows the field distri-\nbution on the -plane of the simulated structure for the case of\n. When the Floquet boundaries are exactly adjacent\nto the simulated structure , the strongest coupling\neffect between cells can be obtained: the highest induced field\non the membrane and lowest induced field in the cytoplasm of\nthe cell can be observed. Conversely, when the Floquet bound-\naries are far away from the simulated structure ,\nAuthorized licensed use limited to: University of Bradford. Downloaded on December 18, 2009 at 04:19 from IEEE Xplore.  Restrictions apply. \n1990 IEEE TRANSACTIONS ON MICROWAVE THEORY AND TECHNIQUES, VOL. 55, NO. 9, SEPTEMBER 2007\nFig. 7. Electric field distribution along z-axis, through the center of the sim-\nulated structure, showing effect of different spacings to the Floquet boundary\ncondition (Ncell is the number of FDTD elements from the biological cell wall\nto the boundary).\nFig. 8. Electric field distribution (enlargement of Fig. 7).\nFig. 9. Modulus of the electric field on the xz-plane at intermediate frequency\n10 GHz, with Floquet boundary spaced 20 FDTD elements from the biological\ncell walls.\nthe lowest induced field on the membrane and highest induced\nfield in the cytoplasm of the cell are observed. It should be noted\nthat all the following analysis will be based on , which\nis assumed to be the most appropriate model for the real living\nbiological tissues or cells in this microdosimetry study.\nThe simulations were performed at the transformed interme-\ndiate frequency of 10 GHz and the overall model was then trans-\nformed to the intended lower frequencies. Table II reports the\nTABLE II\nFREQUENCY SCALING TRANSFORMATION FACTOR FROM 10 GHz\nTO THE MOBILE COMMUNICATION FREQUENCIES GIVEN\nFig. 10. Modulus of the electric field on xz-plane at intermediate frequency of\n10 GHz with Floquet boundary adjacent to the biological cell walls.\nFig. 11. Electric field distribution along z-axis through the center of the simu-\nlated structure in Fig. 10.\ntransformation factors at 900, 1800, 2000, and 2450 MHz that\nwere used in the analysis [43].\nFig. 10 illustrates the 10-GHz field distribution on the\n-plane of the simulated structure. The distributions of the\nelectric field through the center of the simulated structure,\nalong the incident wave propagation direction at 900, 1800,\n2000, and 2450 MHz, are given in Figs. 11 and 12, where\nFig. 12 is an enlarged version of Fig. 11. From inspection of\nFig. 12, the field inside the cells is not constant and the induced\nfield intensity is directly proportional to the frequency. In the\nother words, the higher the operating frequency used to excite\nthe model, the higher the electric field intensity that will be\ninduced within the analyzed structures.\nTo complete the simulation, the HH models were embedded\nin the surface of the spherical cells, in a direction normal to the\nsurface, to represent the membrane effect of the tissue model.\nVersions including this were studied at frequencies of 900 and\n2450 MHz. As can be seen in Figs. 13 and 14, there is a dif-\nference of approximately 15% in the field strength due to the\ncontribution of the membrane effect from the HH model: these\nvariations were in good agreement with expectations [4], [12],\n[28].\nAuthorized licensed use limited to: University of Bradford. Downloaded on December 18, 2009 at 04:19 from IEEE Xplore.  Restrictions apply. \nSEE et al.: COMPUTATION OF EM FIELDS IN ASSEMBLAGES OF BIOLOGICAL CELLS USING MODIFIED FDTD SCHEME 1991\nFig. 12. Electric field distribution along z-axis through the center of the simu-\nlated structure in Fig. 11 (enlargement).\nFig. 13. Electric field distribution along z-axis through the center of the sim-\nulated spherical structure in Fig. 10, incorporating HH model, and driven at\n900 MHz.\nFig. 14. Same as Fig. 13, driven at 2450 MHz.\nFig. 15. 3-D view of the simulated cubical structures in the FDTD computa-\ntional domain.\nFig. 16. Modulus of the electric field on xz-plane at intermediate frequency\n10 GHz with Floquet boundary adjacent to the biological cell walls.\nFig. 17. Electric field distribution along z-axis through the center of the simu-\nlated cubical structure.\nB. Connected Tissue Model Using Cubical Cells\nSince living cells, when compacted into connected tissue, are\nnot perfect spheres, a cluster of cubical cells was chosen for\nstudy on the foundation of the previous spherical-cells analysis.\nFig. 15 depicts the proposed cluster of cubical cells in a 3-D\nview of the FDTD computational domain. In order to compare\nthe results obtained from the previous model with this analysis,\nan FDTD simulation was executed, keeping the same param-\neter values as in the previous configuration. The 2-D view of the\nelectric field inside the cubical-cell tissue is shown in Fig. 16.\nThe field distributions along the propagation direction of the in-\ncident wave, through the center of the simulated structure at var-\nious frequencies, are illustrated in Figs. 17 and 18. The contribu-\ntion of the HH model to the cubical tissue model has also been\nAuthorized licensed use limited to: University of Bradford. Downloaded on December 18, 2009 at 04:19 from IEEE Xplore.  Restrictions apply. \n1992 IEEE TRANSACTIONS ON MICROWAVE THEORY AND TECHNIQUES, VOL. 55, NO. 9, SEPTEMBER 2007\nFig. 18. Electric field distribution along z-axis through the center of the simu-\nlated cubical structure (enlargement of Fig. 17).\nFig. 19. Electric field distribution along z-axis through the center of the sim-\nulated cubical-cell structure in Fig. 16, incorporating HH model, and driven at\n900 MHz.\nFig. 20. Same as Fig. 19, driven at 2450 MHz.\ninvestigated, as shown in Figs. 19 and 20. The effect of adding\nthis model is approximately 15% difference in field, as can be\nseen from these figures.\nThe peak field on the membrane of the cubical structure is\nobserved to be approximately three times higher than in the cy-\ntoplasm, which agrees well with the results from the structure\nbased on spherical cells. However, the absolute field strength\nis approximately doubled in the spherical-cell case, presumably\nbecause of the curvature at the points studied: it is to be expected\nthat much higher fields would be observed at the corners of the\ncubical cells, but it might be argued that, as a localized matter,\nthese points do not correspond well with biological reality.\nV. CONCLUSION\nAn approach to microdosimetric modeling of bioelectromag-\nnetic interactions at the cellular level has been presented. This\nuses the FDTD method, combined with an arbitrarily oriented\nimplementation of a generic lumped-element (HH) cell-mem-\nbrane model and the Floquet periodic boundary condition. By\nimplementing a frequency-scaling approach, the number of\nFDTD time steps for such an electrically small structure can be\nreduced from several millions to a few tens of thousands. The\nreflection on the interface layers inside the FDTD computation\ndomain has also been successfully reduced, even though it is\nwithin lossy penetrable media, by using a modified version of\nBerenger’s absorbing boundary condition. The accuracy of the\nFDTD scaling approach was verified with idealized models of\nspherical cells in lossy media. The feasibility of the inclusion\nof the lumped-element model inside the FDTD computation\ndomain was demonstrated. This leads to the conclusion that the\napplication of such models allows cells of arbitrary geometries\nto be handled and demonstrates the viability of embedding other\ntypes of lumped-element model for membrane behavior, which\nis desirable since the HH model is imperfect for microwave\nfrequencies, although it is reasonable to use it as a working\nhypothesis [4] to develop modeling techniques.\nUse of the Floquet boundary condition enables a nontrivial\nregion of connected biological tissue to be simulated. Such a\ntool will facilitate deeper investigation of the phenomena in the\ninteraction between EM fields and biological systems at var-\nious levels of spatial definition. The combination of quasi-static\nFDTD with an arbitrarily oriented lumped-element membrane\nmodel, the modified Berenger absorbing boundary condition,\nand the Floquet periodic boundary condition represents a sig-\nnificant advance in verisimilitude of biological cell modeling.\nREFERENCES\n[1] K. S. Yee, “Numerical solution of initial boundary value problems in-\nvolving Maxwell’s equation in isotropic media,” IEEE Trans. Antennas\nPropag., vol. AP-14, no. 3, pp. 302–307, May 1966.\n[2] A. Taflove and S. C. Hagness, Computational Electrodynamics: The Fi-\nnite-Difference Time-Domain Method, 2nd ed. Boston, MA: Artech\nHouse, 2000.\n[3] O. P. Gandhi, “FDTD in bioelectromagnetics: Safety assessment\nand medical applications,” in Advances in Computational Electrody-\nnamics: The Finite-Difference Time-Domain Method, A. Taflove, Ed.,\n1st ed. : Artech House, 1998, pp. 627–632.\n[4] G. Emili, A. Schiavoni, F. L. Roselli, and R. Sorrentino, “Computa-\ntion of electromagnetic field inside a tissue at mobile communications\nfrequencies,” IEEE Trans. Microw. Theory Tech., vol. 51, no. 1, pp.\n178–186, Jan. 2003.\nAuthorized licensed use limited to: University of Bradford. Downloaded on December 18, 2009 at 04:19 from IEEE Xplore.  Restrictions apply. \nSEE et al.: COMPUTATION OF EM FIELDS IN ASSEMBLAGES OF BIOLOGICAL CELLS USING MODIFIED FDTD SCHEME 1993\n[5] O. P. Gandhi and J. Chen, “Numerical dosimetry at power-line frequen-\ncies using anatomically based models,” Bioelectromagnetics, vol. 13,\npp. 43–60, 1992, Suppl. 1.\n[6] M. E. Potter, M. Okoniewski, and M. A. Stuchly, “Low frequency fi-\nnite difference time domain (FDTD) for modelling of induced fields in\nhumans close to line sources,” J. Comput. Phys., vol. 162, pp. 82–103,\n2000.\n[7] L. M. Liu and S. F. Cleary, “Absorbed energy distribution from radio\nfrequency electromagnetic radiation in a mammalian cell model:\nEffect of membrane-bound water,” Bioelectromagnetics, vol. 16, pp.\n160–171, 1995.\n[8] W. Sui, D. A. Christensen, and C. H. Durney, “Extending the two-di-\nmensional FDTD method to hybrid electromagnetic systems with ac-\ntive and passive lumped elements,” IEEE Trans. Microw. Theory Tech.,\nvol. 40, no. 4, pp. 724–730, Apr. 1992.\n[9] M. Piket-May, A. Taflove, and J. Baron, “FDTD modeling of digital\nsignal propagation in 3-D circuits with passive and active loads,” IEEE\nTrans. Microw. Theory Tech., vol. 42, no. 8, pp. 1514–1523, Aug. 1994.\n[10] P. Ciampolini, P. Mezzanotte, L. Roselli, D. Sereni, P. Torti, and R.\nSorrentino, “Simulation of HF circuits with FDTD technique including\nnonideal lumped elements,” in IEEE MTT-S Int. Microw. Symp. Dig.,\nOrlando, FL, 1995, pp. 361–364.\n[11] C. N. Kuo, B. Houshmand, and T. Itoh, “Full-wave analysis of pack-\naged microwave circuits with active and nonlinear devices: An FDTD\napproach,” IEEE Trans. Microw. Theory Tech., vol. 45, no. 5, pp.\n819–826, May 1997.\n[12] A. L. Hodgkin and A. F. Huxley, “A quantitative description of mem-\nbrane current and its application to conduction and excitation in nerve,”\nJ. Physiol., vol. 117, pp. 500–544, 1952.\n[13] A. L. Hodgkin and A. F. Huxley, “Current carried by sodium and\npotassium ions through the membrane of the giant axon of Loligo,” J.\nPhysiol., vol. 116, pp. 449–472, 1952.\n[14] A. L. Hodgkin, A. F. Huxley, and B. Katz, “Measurement of cur-\nrent-voltage relations in the membrane of the giant axon of Loligo,” J.\nPhysiol., vol. 116, pp. 424–448, 1952.\n[15] A. L. Hodgkin and A. F. Huxley, “The components of membrane\nconductance in the giant axon of Loligo,” J. Physiol., vol. 116, pp.\n473–496, 1952.\n[16] A. L. Hodgkin and A. F. Huxley, “The dual effect of membrane poten-\ntial on sodium conductance in the giant axon of Loligo,” J. Physiol.,\nvol. 116, pp. 497–506, 1952.\n[17] W. J. Tsay and D. M. Pozar, “Application of the FDTD technique to\nperiodic problems in scattering and radiation,” IEEE Microw. Guided\nWave Lett., vol. 3, no. 8, pp. 250–252, Aug. 1993.\n[18] J. Ren, O. P. Gandhi, L. R. Walker, J. Fraschilla, and C. R. Boerman,\n“Floquet-based FDTD analysis of two-dimensional phased array an-\ntennas,” IEEE Microw. Guided Wave Lett., vol. 4, no. 4, pp. 109–111,\nApr. 1994.\n[19] A. Alexanian, N. J. Kolias, R. C. Compton, and R. A. York, “Three-di-\nmensional FDTD analysis of quasi-optical arrays using Floquet\nboundary conditions and Berenger’s PML,” IEEE Microw. Guided\nWave Lett., vol. 6, no. 3, pp. 138–140, Mar. 1996.\n[20] J. G. Maloney and M. P. Kesler, “Analysis of periodic structures,” in\nComputational Electrodynamics: The Finite-Difference Time-Domain\nMethod, A. Taflove, Ed., 2nd ed. London, U.K.: Artech House, 2000,\npp. 569–625.\n[21] J. Berenger, “A perfectly matched layer for absorption of electromag-\nnetic waves,” J. Comput. Phys., vol. 114, pp. 185–200, 1994.\n[22] D. S. Katz, E. T. Thiele, and A. Taflove, “Validation and extension to\nthree dimensions of the Berenger PML absorbing boundary condition\nfor FD-TD meshes,” IEEE Microw. Guided Wave Lett., vol. 4, no. 8,\npp. 268–270, Aug. 1994.\n[23] J. Berenger, “Perfectly matched layer for the FDTD solution of wave-\nstructure interaction problems,” IEEE Trans. Antennas Propag., vol.\n44, no. 1, pp. 110–117, Jan. 1996.\n[24] J. Berenger, “Improved PML for the FDTD solution of wave-structure\ninteraction problems,” IEEE Trans. Antennas Propag., vol. 45, no. 3,\npp. 466–473, Mar. 1997.\n[25] International FDTD databas. [Online]. Available: http:\/\/www.fdtd.org\n[26] G. Mur, “Absorbing boundary conditions for the finite-difference\napproximation of the time-domain electromagnetic-field equations,”\nIEEE Trans. Electromagn. Compat., vol. EMC-23, no. 4, pp. 377–382,\nNov. 1981.\n[27] H. Ebara, K. Tani, T. Onishi, S. Uebayashi, and O. Hashimoto,\n“Method for estimating complex permittivity based on measuring\neffective permittivity of dielectric mixtures in radio frequency band,”\nIEICE Trans. Commun., vol. E88-B, pp. 3269–3274, 2005.\n[28] T. Kotnik and D. Miklavcic, “Theoretical evaluation of the distributed\npower dissipation in biological cells exposed to electric fields,” Bio-\nelectromagnetics, vol. 21, pp. 385–394, 2000.\n[29] W. T. Kaune and M. F. Gillis, “General properties of the interaction\nbetween animals and ELF electric fields,” Bioelectromagnetics, vol. 2,\npp. 1–11, 1981.\n[30] A. W. Guy, S. Davidow, G. Y. Yang, and C. K. Chou, “Determination\nof electric current distributions in animals and humans exposed to a\nuniform 60-Hz high-intensity electric field,” Bioelectromagnetics, vol.\n3, pp. 47–71, 1982.\n[31] J. D. Moerloose, T. W. Dawson, and M. A. Stuchly, “Application of the\nfinite difference time domain algorithm to quasi-static field analysis,”\nRadio Sci., vol. 32, pp. 329–341, 1997.\n[32] D. T. Prescott and N. V. Shuley, “Reflection analysis of FDTD\nboundary conditions—Part II: Berenger’s PML absorbing layers,”\nIEEE Trans. Microw. Theory Tech., vol. 45, no. 8, pp. 1171–1178,\nAug. 1997.\n[33] E. A. Navarro, B. Gimeno, and J. L. Cruz, “Modelling of periodic struc-\ntures using the finite-difference time-domain method combined with\nthe Floquet theorem,” Electron. Lett., vol. 29, pp. 446–447, 1993.\n[34] M. E. Veysoglu, R. T. Shin, and J. A. Kong, “A finite-difference time-\ndomain analysis of wave scattering from periodic surfaces: Oblique in-\ncidence case,” J. Electromagn. Waves Applicat., vol. 7, pp. 1595–1607,\n1993.\n[35] D. T. Prescott and N. V. Shuley, “Extensions to the FDTD method for\nthe analysis of infinitely periodic arrays,” IEEE Microw. Guided Wave\nLett., vol. 4, no. 10, pp. 352–354, Oct. 1994.\n[36] G. Mie, “Contributions to the optics of diffusing media,” Ann. Phys.,\nvol. 25, p. 377, 1908.\n[37] J. R. Mautz, “Mie series solution for a sphere,” IEEE Trans. Microw.\nTheory Tech., vol. MTT-26, no. 5, p. 375, May 1978.\n[38] C. H. See, R. A. Abd-Alhameed, M. Mutardi, P. S. Excell, and J. Vaul,\n“Quasi-static FDTD scheme for electrically-small regions in free space\nand lossless or lossy penetrable media,” in 5th Int. Computat. Electro-\nmagn. Conf., Stratford-Upon-Avon, U.K., Apr. 2004, pp. 155–156.\n[39] C. M. Furse, J. Y. Chen, and O. P. Gandhi, “The use of the frequency-\ndependent finite-difference time-domain method for induced current\nand SAR calculations for a heterogeneous model of the human body,”\nIEEE Trans. Electromagn. Compat., vol. 36, no. 2, pp. 128–133, May\n1994.\n[40] D. H. Roper and J. M. Baird, “Analysis of overmoded waveguides using\nthe finite-difference time domain method,” in IEEE MTT-S Int. Microw.\nSymp. Dig., 1992, pp. 401–404.\n[41] C. M. Furse, S. P. Mathur, and O. P. Gandhi, “Improvements to the\nfinite-difference time-domain method for calculating the radar cross\nsection of a perfectly conducting target,” IEEE Trans. Microw. Theory\nTech., vol. 38, no. 7, pp. 919–927, Jul. 1990.\n[42] C. M. Furse, D. H. Roper, D. N. Buechler, D. A. Christensen, and C.\nH. Durney, “The problem of treatment of DC offsets in FDTD simula-\ntions,” IEEE Trans. Antennas Propag., vol. 48, no. 8, pp. 1198–1201,\nAug. 2000.\n[43] C. H. See, R. A. Abd-Alhameed, and P. S. Excell, “Computational\nmodelling of electromagnetics of biological cells using lumped ele-\nments in quasi-static FDTD,” in Inst. Phys. Eng. Med. Symp., Glasgow,\nU.K., Sep. 7–9, 2005, pp. 81–82.\nChan H. See was born in Klang, Malaysia, in\n1979. He received the B.Eng degree in electronic,\ntelecommunication and computer engineering\n(with first-class honors) from the University of\nBradford, Bradford, U.K., in 2002, and is currently\nworking toward the Ph.D. degree at the University\nof Brandford.\nFrom 2003 to 2006, he was with the Antennas and\nApplied Electromagnetic Research Group, Bradford\nUniversity, where he was involved with numerous\nprojects concentrating on antenna design and com-\nputational electromagnetics. He recently became a Research Assistant for a\nknowledge transfer partnership (KTP) project, to develop wireless low cost\ncommunication system for Yorkshire Water, U.K. His main research interests\nare in the field of computational electromagnetics, antenna design, RF circuit\ndesign and wireless sensor network.\nMr. See is a member of the Institution of Electrical Engineers (IEE), U.K.\nAuthorized licensed use limited to: University of Bradford. Downloaded on December 18, 2009 at 04:19 from IEEE Xplore.  Restrictions apply. \n1994 IEEE TRANSACTIONS ON MICROWAVE THEORY AND TECHNIQUES, VOL. 55, NO. 9, SEPTEMBER 2007\nRaed A. Abd-Alhameed was born in Basrah, Iraq, in\n1959. He received the B.Sc. and M.Sc. degrees from\nBasrah University, Basrah, Iraq, in 1982 and 1985, re-\nspectively, and the Ph.D. degree from the University\nof Bradford, Bradford, U.K., in 1997, all in electrical\nengineering.\nFrom 1997 to 1999, he was a Post-Doctoral\nResearch Fellow with the University of Bradford,\nwhere he specialized in computational modeling\nof EM field problems, microwave nonlinear circuit\nsimulation, signal processing of preadaption filters\nfor adaptive antenna arrays, and simulation of active inductance. From 2000\nto 2003, he was a Lecturer with the University of Bradford. In August 2003,\nhe became a Senior Lecturer of applied electromagnetics with the University\nof Bradford. Since September 2005, has been a Reader of radio frequency\nengineering with the School of Engineering, Design and technology, Bradford\nUniversity. His current research interests include hybrid EM computational\ntechniques, genetic algorithms, multiple-input–multiple-output (MIMO) sys-\ntems, antenna design, low specific absorption rate (SAR) antennas for mobile\nhandsets, RF mixers, and active antennas.\nDr. Abd-Alhameed is a Chartered Engineer in the U.K. He is a member of\nthe Institution of Electrical Engineers (IEE), U.K. He is a Fellow of the Higher\nEducation Academy.\nPeter S. Excell (M’80–SM’84) received the B.Sc.\ndegree in engineering science from the University\nof Reading, Reading, U.K., in 1970, and the Ph.D.\ndegree from the University of Bradford, Bradford,\nU.K., in 1980. His doctoral research concerned EM\nhazards.\nHe is currently a Professor of applied electro-\nmagnetics and Associate Dean for Research with\nthe School of Informatics, University of Bradford,\nwhere he has worked since 1971. He has authored\nor coauthored over 200 papers. He also holds two\npatents. His research interests cover computational electromagnetics, elec-\ntromagnetic compatibility (EMC), antenna design, bioelectromagnetics, and\nmobile content.\nDr. Excell is a Chartered Engineer in the U.K. He is a Fellow of the Institution\nof Electrical Engineers (IEE), U.K.\nAuthorized licensed use limited to: University of Bradford. Downloaded on December 18, 2009 at 04:19 from IEEE Xplore.  Restrictions apply. \n"}