{"doi":"10.1111\/j.1467-8330.2008.00655.x","coreId":"65131","oai":"oai:dro.dur.ac.uk.OAI2:6821","identifiers":["oai:dro.dur.ac.uk.OAI2:6821","10.1111\/j.1467-8330.2008.00655.x"],"title":"Algorithmic war : everyday geographies of the war on terror.\\ud","authors":["Amoore,  L."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-01-01","abstract":"Technologies that deploy algorithmic calculation are becoming ubiquitous to the homeland securitization of the war on terror. From the surveillance networks of the city subway to the biometric identifiers of new forms of border control, the possibility to identify \"association rules\" between people, places, objects and events has brought the logic of pre-emption into the most mundane and prosaic spaces. Yet, it is not the case that the turn to algorithmic calculation simply militarizes society, nor even that we are witnessing strictly a commercialization of security. Rather, algorithmic war is one form of Foucault's sense of a \"continuation of war by other means\", where the war-like architectures of self\/other, here\/there, safe\/risky, normal\/suspicious are played out in the politics of daily life. This paper explores the situated interplay of algorithmic practices across commercial, security, and military spheres, revealing the violent geographies that are concealed in the glossy techno-science of algorithmic calculation.\\ud\n\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65131.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6821\/1\/6821.pdf","pdfHashValue":"95f7178c06c599b47124fa8c15d943bdd33e641c","publisher":"Blackwell","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6821<\/identifier><datestamp>\n      2011-05-03T09:28:23Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Algorithmic war : everyday geographies of the war on terror.\\ud\n<\/dc:title><dc:creator>\n        Amoore,  L.<\/dc:creator><dc:description>\n        Technologies that deploy algorithmic calculation are becoming ubiquitous to the homeland securitization of the war on terror. From the surveillance networks of the city subway to the biometric identifiers of new forms of border control, the possibility to identify \"association rules\" between people, places, objects and events has brought the logic of pre-emption into the most mundane and prosaic spaces. Yet, it is not the case that the turn to algorithmic calculation simply militarizes society, nor even that we are witnessing strictly a commercialization of security. Rather, algorithmic war is one form of Foucault's sense of a \"continuation of war by other means\", where the war-like architectures of self\/other, here\/there, safe\/risky, normal\/suspicious are played out in the politics of daily life. This paper explores the situated interplay of algorithmic practices across commercial, security, and military spheres, revealing the violent geographies that are concealed in the glossy techno-science of algorithmic calculation.\\ud\n\\ud\n<\/dc:description><dc:subject>\n        Algorithm<\/dc:subject><dc:subject>\n         Risk<\/dc:subject><dc:subject>\n         Security<\/dc:subject><dc:subject>\n         War on terror<\/dc:subject><dc:subject>\n         Data.<\/dc:subject><dc:publisher>\n        Blackwell<\/dc:publisher><dc:source>\n        Antipode, 2009, Vol.41(1), pp.49-69 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2009-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6821<\/dc:identifier><dc:identifier>\n        issn:0066-4812<\/dc:identifier><dc:identifier>\n        issn: 1467-8330<\/dc:identifier><dc:identifier>\n        doi:10.1111\/j.1467-8330.2008.00655.x <\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6821\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1111\/j.1467-8330.2008.00655.x <\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6821\/1\/6821.pdf<\/dc:identifier><dc:rights>\n        The definitive version is available at www.interscience.wiley.com\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0066-4812"," 1467-8330","issn: 1467-8330","0066-4812"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["Algorithm","Risk","Security","War on terror","Data."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n03 May 2011\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nAmoore, L. (2009) ’Algorithmic war : everyday geographies of the war on terror.’, Antipode., 41 (1). pp.\n49-69.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1111\/j.1467-8330.2008.00655.x\nPublisher’s copyright statement:\nThe definitive version is available at www.interscience.wiley.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n 1 \nAlgorithmic War: Everyday Geographies of the War on Terror \n \n \n \nLouise Amoore \n \nDepartment of Geography \nUniversity of Durham \nSouth Road \nDurham DH1 3LE \nUK \n \nlouise.amoore@durham.ac.uk \ntel: 00 (+44) 0191 334 1969 \nfax: 00 (+44) 0191 334 1801 \n \nAbstract \n \nTechnologies that deploy algorithmic calculation are becoming ubiquitous to the \nhomeland securitization of the war on terror. From the surveillance networks of the \ncity subway to the biometric identifiers of new forms of border control, the \npossibility to identify „association rules‟ between people, places, objects and events \nhas brought the logic of pre-emption into the most mundane and prosaic spaces. \nYet, it is not the case that the turn to algorithmic calculation simply militarizes \nsociety, nor even that we are witnessing strictly a commercialization of security. \nRather, algorithmic war is one form of Foucault‟s sense of a “continuation of war by \nother means”, where the war-like architectures of self\/other, here\/there, safe\/risky, \nnormal\/suspicious are played out in the politics of daily life. This paper explores the \nsituated interplay of algorithmic practices across commercial, security, and military \nspheres, revealing the violent geographies that are concealed in the glossy techno-\nscience of algorithmic calculation.  \n 2 \nAlgorithmic War: Everyday Geographies of the War on Terror \n \nIn the search for terrorists and terrorist cells, we are employing predictive \ntechnology that was previously utilized by the business community. \n(US Department of Justice 2002). \n \nThe final decision can come only from war. \n(Foucault 2003 [1976]: 16). \n \nIn 2005, the then US Secretary of Homeland Security, Tom Ridge, and the under \nSecretary Asa Hutchinson, resigned their government positions and established \nbusinesses supplying expert systems in the burgeoning homeland security market. Ridge, \nhaving taken a directorship of Savi Technology, a radio frequency identification (RFID) \ntechnology company, founded Ridge Global LLC, a consulting firm specializing in \ndomestic security and crisis risk management (New York Times 2006: 34). By 2006, \nwhen RFID had become a primary security technology proposed for passports, visas, and \ntransportation systems, Ridge had been appointed government applications consultant for \nDeloitte and Touche‟s RFID services. Hutchinson, for his part, established the \neponymous Hutchinson Group, a homeland security consulting company, and held stocks \nin Fortress America Acquisition Corp, a company trading in the public procurement of \nprivate security technologies.  \n \nAs key figures in an administration that authorized algorithmic computing applications, \nbiometrics, risk management systems and surveillance technologies to help fight the „war \non terror‟, their move to the private commercial world illustrates an emerging geography \nof securitization in everyday life. From the remote sensing of bodies on a railway \nplatform, to the securing of identity via biometric algorithms, or the profiling of risk at \nthe airport, the practices of the war on terror exceed any clear distinction between \nmilitary\/civil\/commercial spheres. It is not that algorithmic techniques have their origins \nstrictly in the military domain (though as we will see many of them do), nor that society \nis strictly undergoing renewed militarization, but that security practices oscillate back and \n 3 \nforth across different domains. There is, as William Connolly describes it, an emerging \n“resonance” between security activities: \n \nAirport surveillance, internet filters, passport tracking devices, legal detention \nwithout criminal charges, security internment camps, secret trials, “free speech \nzones”, DNA profiles, border walls and fences, erosion of the line between \ninternal security and external military action – these security activities resonate \ntogether, engendering a national security machine that pushes numerous issues \noutside the range of legitimate dissent and mobilizes the populace to support new \nsecurity and surveillance practices against underspecified enemies. \n(Connolly 2005: 54). \n \nNeither a militarization of society, nor even a commercialization of security, then, what \nwe are seeing is a stitching together of the mundane and prosaic calculations of business, \nthe security decisions authorized by the state, and the mobilized vigilance of a fearful \npublic. It is important to stress here that questioning the logic of militarization is not to \nunderplay the acute violence inherent to this different kind of war. What I call here \n„algorithmic war‟ is one specific appearance of Foucault‟s Clausewitzian inversion – the \n“continuation of war by other means”, its appeal to technology and expertise rendering \nthe violent force of war somewhat ordinary and invisible (1976\/2003: 16). “The role of \npolitical power”, writes Foucault, “is perpetually to use a sort of silent war to reinscribe \nthe relationship of force, and to reinscribe it in institutions, economic inequalities, \nlanguage, and even the bodies of individuals” (16-17). Understood in this way, the \npolitical practices of homeland security – what Derek Gregory and Alan Pred call “expert \nsolutions” (2007: 1) – are actually sanctioning and reproducing the war-like relations of \npower seen in the overtly militarized spaces of Afghanistan and Iraq. They target \nindividual bodies, designate communities as dangerous or risky, delineate safe zones \nfrom targeted locations, invoke the pre-emptive strike on the city streets.  \n \nAlgorithmic security is war-like, then, not primarily because it brings military force into \ncloser proximity with our daily commute or airport check-in queue (though of course it \n 4 \ndoes do this), but because it functions through a war-like architecture. It deploys an \n“architecture of enmity”, a drawing of the lines between self\/other; us\/them; safe\/risky; \ninside\/outside, that makes going to war possible (Shapiro 1997). Though political \ngeography has given critical attention to the performativity of the violent imagination of \nthreat, this has most commonly focused on spaces where the presence of war is visceral \nand visible – where uniformed military personnel are present of the city streets (Katz \n2007); when urban spaces are the targeted sites of war (Graham 2004); or in the tangible \nviolences of Abu Ghraib and Guantanamo Bay (Minca 2005). In this paper, I explore the \nless visible spaces where the architecture of enmity is present in the form of algorithmic \nwar. In the first section, I trace an extended example of algorithmic calculations deployed \nto identify „hidden‟ associations between people, groups, behaviours and transactions. \nInitially developed to allow commercial retail players to take strategic decisions in an \nuncertain future marketplace, algorithmic „rules of association‟ have become the basis for \npre-emptive state security decisions. In the second section, I focus on the spatiality of \nalgorithmic war, arguing that it has a geography of locatability. Discussing the homeland \nsecurity applications of radio frequency identification (RFID) technologies, I suggest that \nthe dispersed and diffuse locations of the supply chain (offshore, export processing, \ncontrol from a distance) are incorporated into state border controls (RFID passports and \nvisas, tracking technologies in public space). Algorithmic war appears to make it possible \nfor the imagination of an open global economy of mobile people, objects and monies, to \nbe reconciled with the post 9\/11 rendering of a securitized nation-state.  \n \n \nProbability\/Security: Algorithms at the Checkout and in the Subway \n \nIn the immediate aftermath of 9\/11, the homeland face of the war on terror identified an \nenemy whose probable future actions were already visible in the traces of life left in \nexisting data. Giving evidence at a US Congressional hearing only five months after 9\/11, \nIBM‟s federal business manager testified that “in this war, our enemies are hiding in open \nand available information across a spectrum of databases” (Intelligent Enterprise 2002: \n8). Technology consultants and IT providers such as IBM have made the generation of \n 5 \nprobabilistic association rules the forefront of homeland security practices. The idea is \nthat locating regularities in large and disparate patterns of data can enable associations to \nbe established between apparently „suspicious‟ people, places, financial transactions, \ncargo shipments and so on (Amoore and de Goede 2005; Ericson 2007). Rules of \nassociation are produced by algorithms – models or “decision trees” for a calculation \n(Quinlan 1986). In effect, algorithms appear to make it possible to translate probable \nassociations between people or objects into actionable security decisions. In 2003, for \nexample, a US joint inquiry concluded that “on September 11, enough relevant data was \nresident in existing databases”, so that “had the dots been connected”, the events could \nhave been “exposed and stopped” (2003: 14). It is precisely this „connecting of dots‟ that \nis the work of the algorithm. By connecting the dots of probabilistic associations, the \nalgorithm becomes a means of foreseeing or anticipating a course of events yet to take \nplace: \n \nIf we learned anything from September 11 2001, it is that we need to be better at \nconnecting the dots of terrorist-related information. After September 11, we used \ncredit card and telephone records to identify those linked with the hijackers. But \nwouldn‟t it be better to identify such connections before a hijacker boards a plane? \n(US Secretary of Homeland Security, Michael Chertoff 2006). \n \nThe algorithm appears to make possible the conversion of ex post facto evidence in the \nwar on terror into a judgement made in advance of the event. The significant point here is \nthat probabilistic knowledge, based on the databased residue of daily life, becomes a \nmeans of securitization. As the US Inspector General concluded in his survey of \ngovernment applications of algorithmic techniques, “association does not imply a direct \ncausal connection”, but instead it “uncovers, interprets and displays relationships between \npersons, places and events” (Department of Homeland Security 2006: 10). It is the \nspecific visualization of threat, then, that marks out the algorithm as a distinctive mode of \ncalculation – to be displayed on the screens of border guards, stored on subway travel \ncards, shared between multiple public and private agencies. In this sense, the algorithm \n 6 \nproduces a screened geography of suspicion, on the basis of which „other‟ people are \nintercepted, detained, stopped and searched (Amoore 2007). \n \nHow has it become possible, then, for the algorithmic rules of association to become the \nbasis for everyday securitization in the war on terror? In one sense the algorithmic mining \nof data on the population within the war on terror is but one specific turn in a long history \nof incorporating uncertainty into calculations via statistics, what Ian Hacking (1990) has \ncalled the “taming of chance”. Yet, it is in the more prosaic recent histories of \nprobabilistic knowledge in the commercial sphere that algorithmic logics have really \nbegun to define the management of uncertain futures of many kinds – from flood risk in \nthe insurance industry to catastrophe risk in the financial markets (Baker 2002). One \nparticular resonance between the mathematical sciences and commercial worlds is \nespecially worthy of discussion for its subsequent role in processes of securitization. In \nthe summer of 1992, IBM research fellow Rakesh Agrawal met for lunch with a senior \nexecutive of UK retailers Marks & Spencer (M&S). Working on mathematical models for \nlocating associations between items in “accumulated data” at the IBM-Almaden research \ncentre, Agrawal proposed that M&S‟s vast data on daily transactions could be used to \ntake strategic corporate decisions. The research paper that resulted from the IBM-M&S \nmeeting, and from subsequent work with US retailer Wal-Mart, has become the world‟s \nmost cited work on commercial algorithmic techniques for data mining (Agrawal, \nImielinski and Swami 1993). \n \nLet us pause here and briefly reflect on the logic of Agrawal‟s algorithmic model. \n“Consider a supermarket with a large collection of items”, he writes, “typical business \ndecisions might include what to put on sale, how to design coupons, how to place \nmerchandise on shelves in order to maximize profit” (Agrawal, Imielinski and Swami \n1993: 207). Progress in bar-code technology, the research finds, has made it possible to \nscreen transactions “for association rules between sets of items” and “to present an \nefficient algorithm for that purpose” (1993: 207). Agrawal‟s examples of commercial \nquestions that the algorithm could model include such prosaic queries as: What pattern of \npurchases is associated with Diet Coke?; What pattern of items has to be sold with \n 7 \nsausages in order for it to be likely that mustard will also be sold? What proportion of \ntransactions that include bread and butter also include milk? The deployment of \nalgorithmic calculations in this context signals an important move – from the effort to \npredict future trends on the basis of fixed statistical data to a means of pre-empting the \nfuture, drawing probable futures into imminent and immediate commercial decision. \n \nThe IBM work on association rules in the mathematical and computer sciences, though it \nachieved ubiquity by „connecting the dots‟ in prosaic settings and everyday transactions, \nsignificantly established a way of thinking about taking security decisions in the face of \nan uncertain future. By 2004, Agrawal and his IBM team were leading the export of \ncommercial algorithmic techniques to the security sphere, presenting the possibilities of \nassociation rules for the “mathematical sciences role in homeland security” (BMSA \n2004). The promise that algorithmic calculations held out to the commercial authorities \nof the 1990s – to enable surveillance from a distance, to make market judgements in \nadvance, to generate patterns of normal and atypical consumer behaviour – is now being \nre-made in the context of state security desires. At the time of writing IBM currently have \nthe software contracts for the Heathrow airport „MiSense‟ biometrics system, the UK e-\nborders „Iris‟ and „Semaphore‟ trials, and the US biometric borders programme (DHS \n2005; Computing 2004; 1). As the logics of commercial data mining cross into security \nspheres, association rules become a form of „guilt by association‟, within which risky \nbodies, transactions, mobilities are designated and identified.  \n \nThe decisions taken on the back of algorithmic calculations – detention at international \nborders (Sparke 2006), freezing of financial assets and targeting of migrant remittances \n(de Goede 2003; Aitken 2006), interception of cargo at ports (Chalfin 2004) – conceal \npolitical difficulty, even discrimination and violence, within an apparently neutral and \nglossy techno-science. Thus, for example, the algorithmic technologies of the US VISIT \n„smart borders‟ programme, promise to make the “border guard the last line of defense, \nnot the first, in identifying potential threats” (Accenture digital forum 2004: 4; see \nAmoore 2006). Because the identification of risk is assumed to be already present within \nthe calculation, the border guard is somehow taken off the „front line‟. The screened \n 8 \nappearance of a security threat, then, is always already calculated by the algorithmic \nperformance of association rules – was the ticket paid in cash?; what is the past pattern of \ntravel?; is this a frequent flier?; what in-flight meal was ordered?\n1\n The risk flag that \nappears on the border guard‟s screen is the result of a calculation, itself made on the basis \nof prior judgments about norm and deviation from norm. \n \nOf course, in one sense there is nothing at all novel in the co-authorization of security \ndecisions by the mathematical and computing sciences, the military and the state \n(Edwards 1996; Light 2003; Martin 2003). Indeed, a reading of Jenny Edkins‟ study of \nthe physicists Werner Heisenberg and Niels Bohr suggests historical parallels between \nthe “uncertainty principle in physics”, the “cosmology that made the atomic bomb \npossible”, and the “interpretation of human actions” (2003b: 363\/369). Put simply, the \nrejection of causality by quantum physics (embodied also in Agrawal‟s non-causal \nassociations) resonates with the science that makes the absolute violence of the atomic \nbomb possible, as well as with the idea of uncertainty in the social world. Taking Edkins‟ \nargument to our concern here – the deployment of algorithms in everyday securitization – \nwe can point to a coalescence between indeterminacy in the physical sciences, the \nemergence of virtual and „network‟ warfare, and the rise of inference and suspicion in the \nsecurity decision. What is novel in the contemporary moves to algorithmic war, then, is \nthe specific form that the aligning of science, commerce, military and the state is taking.   \n \nIn the emerging geography of algorithmic war, the relationships between science, \nexpertise and decision are radically rearticulated so that distinctions between “science” \nand “non-science”, “expert” and “inexpert” knowledge become more malleable. It is not \nstrictly the case, then, as Richard Ericson and Aaron Doyle have it, that where “scientific \ndata on risk is absent” there is a turn to “non-scientific forms of knowledge that are \nintuitive, emotional, aesthetic, moral, and speculative” (2004: 138). Instead, on the one \nhand, scientific data begins to incorporate the emotional, affective and speculative \ndomains while, on the other, knowledges considered to be “non-scientific” are authorized \nas science. Data-led algorithms that model and track the movement of bodies or objects \n 9 \nthrough space now coalesce with intuitive, speculative and inferential knowledges that \nimagine future scenarios.  \n \nConsider, by way of example, the multiple interacting forms of algorithmic knowledge \nthat are emerging in the transitory spaces of the subway. Surveillance cameras, equipped \nwith facial and gait recognition technologies, track „atypical‟ movements such as \nrepeated traversals of a platform (Hale 2005); „smart‟ travel payment cards store journey \ndata and identify anomalies; and poster displays urge the public “if you suspect it, report \nit”.2 The calculations of the algorithm appear to translate the observation of uncertain and \ncontingent human life into something with the credibility of scientific judgement. The \nUK‟s Metropolitan Police public vigilance campaigns, for example, use algorithms on the \nscreens of „terror hotline‟ call centres, ascribing a level of scientific and technical \ncertitude to the reported suspicions of the „out of the ordinary‟.3 The specific deployment \nof scientific knowledge, then, incorporates the affective domain, rendering fears and \nanxieties a means of anticipating the future. “The precautionary principle”, writes \nFrançois Ewald, “presupposes a new relationship with science and with knowledge”, one \nwhich “invites one to anticipate what one does not yet know, to take into account \ndoubtful hypotheses and simple suspicions” (2002: 288). Algorithmic security \ntechnologies allow the embracing of the precautionary principle in just this way, inviting \nanticipatory actions and making scientific and certain what would otherwise be mere \nuncertain doubts or suspicions.  \n \nIf algorithmic techniques are concerned with anticipating an uncertain future, then the \nlogic of algorithmic war is one of identifying norm and multiple deviations from the \nnorm. To be clear, this is not the norm that is familiar to studies of disciplinary society. \nAs Foucault explains, “disciplinary normalization posits a model and tries to get people, \nmovements, and actions to conform to this model [the norm]” (2007: 57). In the security \napparatus, by contrast, we find “exactly the opposite of the disciplines”, where we have \n“a plotting of different curves of normality… the interplay of differential normalities” \n(63). Understood in this way, the algorithm becomes a very specific modality of the \n“imaginative geography” of the war on terror. It plays it part in making possible the \n 10 \ninterplay of differential normalities – not forever settling out normal and abnormal, \npermitted and prohibited, but allowing degrees of normality.  \n \nCiting international relations scholar Michael Shapiro, Derek Gregory argues that \n“geography is inextricably linked to the architecture of enmity”, to the overlapping \npractices through which “collectivities locate themselves in the world and thus how they \npractice the meanings of Self and Other that provide the conditions of possibility for \nregarding others as threats or antagonists” (2004: 20). Yet, Gregory‟s “spiraling \nnetworks” do not fully push the limits of Shapiro‟s architecture because they return the \ngeopolitics of violence to the disciplinary norms of battlefield spaces, obscuring the \nsubtle differential violences of the “surveillance network” of the “end-of-violence \norganization” that Shapiro later depicts (2004: 121). In the name of homeland security \n(the end of violence), algorithmic war reinscribes the imaginative geography of the \ndeviant, atypical, abnormal „other‟ inside the spaces of daily life. The figure of enmity to \nbe feared and intercepted need not only dwell in a represented outside in the geographies \nof Iraq or Afghanistan, for the outside can be inside – in the body of the migrant worker \n(differentially normal in the space of the economy and abnormal in the spaces of \nimmigration), the young Muslim student (permitted to study but observed in the college‟s \nIslamic society), the refugee (afforded the hospitality of the state but biometrically \nidentified and risk rated), the British Asian traveler (granted visa waiver but ascribed an \nautomated risk score).  \n \nThus, the emergent geography of a twisted and conjoined figure of inside and outside, \nwhere “one does not know on which face of the strip one is located” (Bigo 2001: 115). \nFor Didier Bigo, this is a spatiality of the policing of multiple and variant lines between \nself and other, an “everyday securitization from the enemy within” (2001: 112). Here the \narchitecture of enmity becomes the means of securitization itself, such that the distinction \nbetween „real‟ war (with accompanying visceral violence and bloodshed) and the war by \nother means (legitimated by securing against future violence) becomes permeable. The \nnetwork warfare depicted in accounts of a “military-industrial-media-entertainment \n(MIME) complex”, where “information is no longer a subsidiary of war”, extends the \n 11 \nstealthy war-like practices “more widely and deeply into our everyday lives (Der Derian \n2002; see also Dillon and Reid 2007). Consider, for example, the Oracle Corporation‟s \nsoftware, already ubiquitous in our lives, providing IT platforms for payroll, pensions, \nhealth care, the bibliographic searches used in academic research, and so on. Their \nalgorithmic security systems - Non-Obvious Relationship Awareness (NORA) software – \ndeveloped for the entertainment industry and used in the Las Vegas casinos – are now \ndeployed by the US Justice and federal intelligence agencies for counter-terror. \nAccording to Oracle consultants, NORA enables clients to identify “obscure relationships \nbetween customers, employees, vendors, and other internal and external data sources”. \nNORA searches for behaviour patterns or personal associations that hint at terrorist \nactivity, turning data into actionable intelligence” (IDC 2004: 11). \n \nThe association rules of the algorithm claim precisely to identify associations, to connect \ntogether here and there, to link that location of suspicion and this embodied risk, to \nsuture together the forces of war in one place and the possibility of threat in the spaces of \neveryday life. In essence, as it traverses the spheres of commerce and consumption, \ntransportation, military strategy and state surveillance, the algorithm simultaneously \nconceals the architecture of enmity through which it functions. Giving the appearance of \nan advanced security decision based on the technical and scientific computation of norms \nand deviations from norm, beneath its skin the algorithm contains all of the categories, \ncodes and measures that we see in other violent geographies – the racial profiles \nembedded within biometric facial measures, the ethnic or religious practices flagged as \nanomalous in air passenger data, the identification of risk by algorithmic screening of \nname or address. These are the more subtle violences of science and state that are not \nmeasured by a linear experience of harm, but instead attach themselves to daily prosaic \npractices, limiting the possibilities for life, of life itself (Das and Kleinman 2000).  \n \n \nLocatability\/Security: Sensors at the Border and in the Supply Chain \n \n 12 \nIn August 2004, the US Department for Homeland Security (DHS) announced the testing \nof a new tracking technology at five US land border ports of entry. The trial – conducted \nby consultants Accenture and Deloitte in collaboration with Philips Semiconductors – \nembedded radio frequency identification (RFID) tags into paper I-94 customs and border \nprotection forms.\n4\n The RFID tags contain a „passive‟ chip and antenna, capable of \ntransmitting a unique numeric identifier to a remote reader. By October 2006, though \nrejected for US passports, the same RFID technology became a US entry requirement for \nvisa waiver programme passports. Later the same year, the UK‟s Transport for London \nannounced that its RFID-enabled Oyster travel payment card was to integrate with a Visa \ncredit card, allowing the tracking and tracing of all small transactions, actions and \nmovements on the London Underground system. \n \nHow might we understand what is at work here? A virtually invisible technology, \nconcealed within a paper document or „smart‟ card, is deployed with the precise purpose \nof rendering a person visible, identifiable and locatable. As architect Dana Cuff has \nnoted, “there is an irony here”, it is “invisible, miniaturized sensors that are making \nformerly inaccessible realms visible” (2003: 45). In part, of course, the apparent \ninvisibility of the techniques for making visible is assured because of their already \nexisting ubiquity in everyday commercial transactions. As the Vice President of Philips \nSemiconductors had testified to the US Congress Committee on Energy and Commerce in \n2004, “consumers are already likely to encounter RF-enabled personal identification \ndevices in their daily lives, such as secure access cards for building entry, speedy \ngasoline purchasing such as the Exxon Speedpass, vehicle anti-theft systems, and in \ntransportation systems all over the world” (US House of Representatives 2004: 3). What \nis taking place, then, is the redeployment of sensor technologies used in the commercial \ntracking of mobile things, objects, animals and vehicles into the domain of the tracking of \nmobile people. \n \nAs a technology of location, tracking is central to the processes and practices of \nmilitarization. As performance artist and social theorist Jordan Crandall has argued, \n“militarization and movement intersect through the activity of tracking” (2005: 19). The \n 13 \ndomains of geopolitics and geoeconomics cross over here (see Cowen and Smith, this \nissue) as the governing of the global economy draws into common assemblage with a \nstate that is concerned to make visible the minutiae of daily life, to seek security in the \ntransactions, journeys and movements that are the norm and those that are suspicious. Put \nsimply, algorithmic war requires a target for its calculations, preferably a moving target. \nThe practice of tracking, then, seeks to “detect, process and strategically codify a moving \nphenomenon in a competitive theatre”, whether this space is a “battlefield, the social \narena, or the marketplace” (Crandall 2006: 4). In this sense, tracking technologies enable \nthe identification and location of moving targets. In the war on terror, the specific form \nhas become what Samuel Weber calls a “target of opportunity”, a competitive “seizing” \nof “targets that were not foreseen or planned” (2005: 4). The targets of opportunity in the \nwar on terror, then, involve the depiction of mobile enemies: \n \nHowever different the war on terror was going to be from traditional wars, with \ntheir relatively well-defined enemies, it would still involve one of the basic \nmechanisms of traditional hunting and combat, in however modified and \nmodernized a form: namely “targeting”. The enemy would have to be identified \nand localized, named and depicted, in order to be made into an accessible target… \nNone of this was, per se, entirely new. What was, however, was the mobility, \nindeterminate structure, and unpredictability of the spatio-temporal medium in \nwhich such targets had to be sited… In theatres of conflict that had become highly \nmobile and changeable, “targets” and “opportunity” were linked as never before. \n (Weber 2005: 3-4, emphasis in original). \n \nSamuel Weber‟s key point of discussion is the theatre of war, though his argument sheds \nsignificant light on the algorithmic wars on terror that I depict here. The identification, \nlocalization, naming and depiction of mobile targets is, in this war by other means, \nconducted in and through daily life, in advance of any possible future strike or \nintervention. The targeting of mobile bodies, things, objects or monies is becoming a \nmatter of locating – positioning in the sights, if you like – so that the opportunities of a \nmobile global economy might be seized, while the capability to take out the target \n 14 \nremains. “Freedom is nothing but the correlative of the deployment of apparatuses of \nsecurity”, states Foucault, “the very possibility of movement, change of place, and \nprocesses of circulation of both people and things” (2007: 49). For this reason, the \ngeography of algorithmic war is a spatiality of locatability in movement, with origins in \nthe interplay between military logistics and the commercial logistics of tracking objects \nthrough a supply chain. As consultants Accenture, Deloitte, IBM and \nPricewaterhouseCoopers lead the drive for multiple networked public and private \napplications of technologies of location such as RFID, the commercial “targets of \nopportunity” that allowed the production of goods to become dispersed and diffuse are \nclearing space for more diffuse modes of sovereign power. The technologies that have \nmade possible a global supply chain of export processing zones and offshore sites, are \nsimultaneously being embedded into border crossing cards, visas, passports and \nimmigrant ID cards that include mobile people within governable space by means of their \ntargeted exclusion.  \n \nHow has locatability emerged as a key means of tracking mobile targets? The emergence \nof knowledges of location, what Nigel Thrift has called “our conventions of address”, \nfollows a tacit and often unacknowledged sense that we somehow know “what will show \nup where and what will show up next” (2004: 176). In other words, a system of address \nhas been central to our ability to spatially and temporally locate events, objects, people \nand so on. The history of addressability displays a significant playing back and forth of \nmilitary logistical knowledges and commercial supply and transportation knowledges. \nThus, for example, the origins of 1940s bar code technologies lie in the communication \ntechniques of Morse code. Historical records of early bar code techniques describe a \ngraduate student, Joseph Woodland, marking the dots and dashes of Morse code into the \nsand on a beach as he thought through a research problem of how to identify a product at \na check-out (Shepherd 2004: 13). Extending the dots and dashes to two-dimensional wide \nand narrow lines in the sand, Woodland later successfully patented the first binary \nbarcode system.  \n \n 15 \nAs computing technologies began to enable the electronic reading and recognition of \npatterns, new relationships between the identifier (postal code, ZIP, barcode, personal \nidentifiers such as date of birth) and the identified (people, places, parcels, vehicles..) \nbecome possible. Consider, for example, IBM‟s „punch cards‟ of the 1950s, patterns of \npunched holes in a card to be fed into the pattern recognition programmes of IBM \nmachines.\n5\n The “patterns of data on the IBM cards”, writes architect Reinhold Martin, \n“made visible what was invisible” (2003: 158). The machine‟s ability to „read‟ the cards \nextended beyond the mere processing of data and into the almost magical realm of \nanimating a life unseen. In a 1955 publicity brochure, IBM reminded the American \npublic of how their lives were locatable in the traces of actions and transactions left in the \ncard and „read‟ by the machine: \n \nIBM first came into your life when your birth was recorded on a punched card. \nFrom then on many such cards have been compiled, giving a lifetime of history of \nyour important decisions and actions. If you went to school, entered a hospital, \nbought a home, paid income tax, got married or purchased an automobile, the \nchances are that permanent records were made of these and other personal stories. \n (Cited in Martin 2003: 159). \n   \nWhat we begin to see with the intersection of systems of address with systems of \nrecognition, or the marrying of addressability and readability, if you like, is a computer-\nenabled system of locatability. While even rudimentary systems of address involve \nrecognizing identifying markings, whether these are numbers, features of the natural \nlandscape, or codes, the computer reading of markings and the recognition of patterns \nmakes possible novel forms of location. Here, the emphasis is on a more mobile and agile \nmode of address that does not „stop at the door‟ of delivery, but instead dwells inside, \nmaking visible, readable and locatable the traces of daily life. With the rise of what Jerry \nKang and Dana Cuff call “computer addressability”, the fixed location of the address is \nloosened via “unique identification codes” (2005: 94). Because the codes dwell inside a \nbody or object in the physical environment, they do, at least in theory, make it locatable \nin movement. \n 16 \n \nIn this shift from addressability to locatability, the ability to track and trace mobility is \nachieved by animating the physical environment so that it is able to “respond directly to \nwhat it sees” (Kang and Cuff 2005: 94). Thus, the „reader‟ of traces, markings or \ntransactions, established via the early technologies of punch cards and barcodes, becomes \never more important to the system of location as “addresses move with human and non-\nhuman actants” (Thrift 2004: 183). Rather as IBMs early computers inferred people‟s life \nhistories from the patterns punched into the cards, and from the intervals between them, \ncontemporary readers of location, as a group of researchers at Intel have put it: “infer \npeople‟s actions from their effect on the environment, especially on the objects with \nwhich they interact” (Smith et al. 2005: 39). The embedding of RFID tags into objects, as \nSmith and his colleagues have shown at Intel, can be understood as one means to achieve \na novel and mobile form of targeting. \n \nThe origins of contemporary RFID technology, perhaps unsurprisingly, also find some \nroots in military communications and logistics, with the earliest writings on the problem \nto be found in research by radio engineers seeking more efficient readability of signals \n(Stockman 1948). It should be clear, then, that we cannot say that contemporary security \napplications of RFID are simply drawing on commercial knowledges of location. The \n1940s research was, in many ways, the precedent for contemporary RFID technologies \nthat deploy miniature tags, emitting a radio signal with a unique numeric identifier that \ncan be received by a reader up to 25 feet away (Borriello 2005). Composed of a silicon \nchip and coiled antenna, usually sandwiched inside a plastic tag, so called „passive‟ \nRFIDs use the power supply from the reader to send their signal and are, therefore, \nsmaller and require closer proximity to the reader than „active‟ tags that carry their own \npower supply. For example, a passive RFID application such as a supermarket loyalty \ncard that is read at the till is, in effect, inert until it is in range of the reader that activates \nit. Once in range of the reader, the RFID‟s numeric identifier allows the reader to locate \nthe tag and to associate data on past readings of transactions. For a supermarket shopper‟s \n„loyalty card‟ this might include patterns of past purchases, coupons or vouchers for \nsavings and such like. For a US-Mexico border crossing card holder, the passive tag \n 17 \nsignals an identifier that can be mapped across past patterns of travel, criminal \nconvictions or terrorist watch lists. In this way, the RFID identifies the target for \nalgorithmic calculation, at the border, at the supermarket check-out, at the entrance to the \nsports stadium, in the subway ticket hall. “Through RFID tags”, as Jerry Kang and Dana \nCuff have it, address is specified “to a fine level of granularity, much finer than a zip \ncode”, so that we “will likely authenticate our identity to multiple queries of „who are \nyou‟ made by the enacted environment” (2005: 106).  \n \nWhat are the implications of mobile forms of locatability for algorithmic war and, in \nparticular, for the exercise of sovereign power? As RFID stands on the brink of replacing \nbar code and paper-based markers of location (I 94 forms, passports, train tickets, paper \nmoney at toll booths, tickets for sports events),\n6\n how does the war on terror become \nenmeshed with the geographies of everyday life? To be clear here, the seizing of targets \nof opportunity by commercial players can in no sense be interpreted as transcending the \nnation-state or outsourcing state security decisions to the market. Rather, a logic of \noutsourcing and targeting that exceeds any specific public or private domain – that is, as \nSamuel Weber suggests, a “militarization of thinking” – works to sustain the “hyphen” in \nthe imagination of nation-state differently (Sparke 2005: 48). It does so, I will argue here, \nvia a spatial and temporal deferral of security decision that follows the dispersed \ngeography of the commercial supply chain. \n \nThe state‟s ability to track and trace people or objects in movement, across or beyond its \nborders, is increasingly bound up with commercial techniques for tracking and tracing \nobjects through the supply chain. The paradox of security and mobility – the problematic \nof the moving target – is given the appearance of being fixed by technologies of \nlocatability. As David Campbell writes, “were it possible to bring about the absence of \nmovement”, that would represent “pure security”, yet it would be at that moment that \n“the state would wither away” (1992: 12). The question is not one of how to arrest \nmobility, then, but how to govern mobility in such a way as to allow circulation and to \nsustain the impression of securability. Put simply, to secure the sovereign power of the \n 18 \nstate in a global economy of mobile things and people precisely by means of targeting \nbodies in movement. \n \nThe contemporary decentred state shares much of its spatial character with the diffuse \nand dispersed capillaries of global capital. If William Connolly (2005: 148) is correct and \nsovereignty is “migrating to a layered global assemblage”, then one aspect of this \nlayering is the profusion of ambiguous locations of many kinds, where the distinctions \nbetween legality and illegality, work and violence, onshore and offshore are increasingly \nblurred. Just as the dispersal of a global supply chain into offshore sites and export \nprocessing zones permits the deferral of many kinds of commercial decision – at least in \nterms of Jacques Derrida‟s sense of decision as responsibility (1995: 25) – so the \ndiffusion of state authority into ambiguous locations of many kinds appears to institute \nthe deferral of decision on behalf of the state. In the marketplace that is the test laboratory \nfor RFID applications, for example, the tagging at item level by Wal-Mart, M&S and \nGillette has allowed these commercial players to seek efficient locations in distant places, \nand yet to sustain the ability to control with precision (Eckfeldt 2005). The very idea of \nan animated supply chain, making its own algorithmic calculations and judgements – \nfrom “smart refrigerators” to smart supermarket shelving and tracked shipments (Günther \nand Spiekerman 2005) – incorporates the bodies and objects of production and \nconsumption, from the growers, pickers and producers of raw materials, through \nmanufacturing, supply and retail workers.  \n \nIn the most vulnerable offshore spaces of the global economy, where commercial firms \nseek only the most fleeting of finger holds in a specific territorial space, we begin to see \nhow the commercial targeting of things and objects plays into and through the targeting \nof people. Thailand‟s export processing zones – or „free zones‟ – for example, have \nbecome “e-free-zones”, using RFID to track the movement of imported materials, \ndeliveries, exported goods, and, significantly, the bodies of workers, as they traverse the \nboundaries of the zone. The fortified security fences associated with export processing \nzones, then, are augmented by equally carceral, but less obviously visible, lines that track \nand trace the movements of workers via “contactless” smart cards, and the mobility of \n 19 \nobjects via RF enabled smart labels. Similarly, the extension of RFID into border \ncrossing cards and immigration documents allows the feigned impression of an open \nworld, while it institutes new lines and boundaries. There is a growing resonance, then, \nbetween apparently geo-economic systems of locatability (of course always also political) \nthat target the bodies of workers and the movement of the objects with which they \ninteract, and the algorithmic security practices of the state:  \n \nIt plays out in new systems of production that aim to narrow the intervals between \nconception, manufacturing, distribution and consumption – shrinking the delays \nbetween detecting an audience pattern and formatting a new enticement that can \naddress it. It plays out in pre-emptive policing and warfare systems that aim to \nclose the gap between sensing and shooting. \n (Crandall 2006: 13). \n \nAs Jordan Crandall depicts the geographies of tracking and targeting, they play in and out \nof the plural spaces of our world. As the commercial tracking technologies enter the \nsphere of security – RFID passports, „smart‟ national ID cards, RF-enabled immigration \nand visa documents, the tagging of detained asylum seekers, employee „contactless‟ \nbuildings access cards – they defer security decisions into algorithmic calculation. The \nparticipation of RFID in violent geographies is thus often obscured. When global \nconsultants Accenture made their successful bid for the USVISIT „Smart Borders‟ \ncontract, for example, they simulated the ability of RFID to target from a distance: \n \nUsing a nearby facility belonging to Raytheon, a subcontractor on its team, the \nAccenture team constructed a mock border point kiosk at which the government \nteam had an RFID tag attached to their passports. They also constructed a mock \nland border crossing where a scanner read the RFID passport tags of the \ngovernment officials inside the car. Even though the car became momentarily \nairborne after hitting a speed bump – the scanner read the digital information \ncontained on the RFID chips of all four government officials in the vehicle, \ndisplaying their pictures on an electronic billboard as they passed by. \n 20 \n (Accenture 2005: 242, emphasis added).     \n      \nAccenture‟s business partner Raytheon, the world‟s largest manufacturer of so-called \n„smart weapons‟, produces the cluster bombs widely reported to be responsible for the \nviolent deaths of civilians in Iraq and Afghanistan. Here we see the targeting of markets \nand neighbourhoods by military hardware segueing into the targeting of people at border \ncrossings and in the spaces of the airport. Indeed, it is Raytheon that, in November 2007, \nwas awarded the £650 million UK e-borders contract as the leading contractor of the \nTrusted Borders consortium, with Accenture the IT systems subcontractor. Where RFID \nappears to render movement around the subways, highways and superstores of the global \neconomy as a smooth and seamless experience, it does so by aligning the security \npractices of the state with the mobilities of the consumer. In this sense, our everyday \ngeographies do spiral into and across the daily violences of the algorithmic targeting of \n„others‟ and the visceral military violence of bombing campaigns.  \n \nIt is important to recognise at this point that we can only gain a limited understanding of \nthe technologies of algorithmic war by seeing them as explainable by the post 9\/11 \ndeepening of political economies of surveillance (Lyon 2003). The capacity of RFID to \nmake us locatable is actually acutely ambivalent: we feel its potential to watch and to \nincarcerate just as we simultaneously feel it fulfil some of our desires and pleasures. As \nMatt Sparke has illustrated in his study of the biometric proximity cards used in the US-\nCanadian border NEXUS programme, the appeal is made to “the fast lane, where you \nwant to be” (2006: 167). Similarly, RFID is offered as a means of expediting mobility in \nthe UK‟s Heathrow airport “MiSense” programme, promising to “simplify your journey \nthrough the airport while maintaining security”.7 The MiSense programme, by \nincorporating smart sensors into the possession of the subject – „my sense‟ – invites an \nalmost playful encounter with RFID sensors. This stitching together of playful leisurely \nRFID encounters with security practice asks the subject to voluntarily offer themselves \nup to tracking technologies in return for expedited movement. In some of the most \nplayful forms of RFID use in the leisure industry – subcutaneous chips inserted into the \narms of customers at a Glasgow nightclub so that they may pay for their drinks without \n 21 \nthe hindrance of cash or cards; RFID golf balls that communicate their location to a \nremote reader – we can see security dreams fulfilled. Night club patrons secure their pre-\ncleared identity and financial details beneath their skin, and golfers seek out a means of \nsecurely locating distant objects. Where RFID “pleasures and anxieties cohabit”, the \ntargeted line of sight sorts and segregates finite degrees of visibility so that, for some, \n“the edges are smoothed” as they “blend seamlessly into the crowd” (Crandall 2006: 12). \nFor others, of course, the line of sight targets for heightened exposure to visibility – to \nstop and search, to continually verify identity, to have movement in public space checked \nand intercepted.  \n \n \nConclusions: Securability and Algorithmic War \n \nYou won‟t get by the booth… You look too young to be driving out of state”… \nBut there is nobody in the booth built to hold a toll-taker. Nobody. A green light \nflashes E-Z PASS PAID and Ahmad and the white truck are admitted to the \ntunnel. \n(Updike 2006: 298). \n \nIn a final scene of John Updike‟s novel Terrorist, the protagonist Ahmad drives his truck \nbomb to the entrance of the Manhattan-bound Lincoln tunnel. His passenger and reluctant \nmentor, Jack Levy, urges him that the security guard will detain him on the grounds that \nhe looks too young to have a state license permitting him to drive out of state. At the \nboundary line of the city, Levy feels sure, their fatal journey will be halted, their \nmovement intercepted. What Levy does not anticipate is the RFID transponder on the \nwindshield of the truck, sending a signal to the barrier reader, algorithmically calculating \n– is the truck licensed?; is the toll pre-paid?; has the vehicle been reported stolen? The \ncalculation is made, a green light flashes and the truck enters the tunnel.  \n \nIn Updike‟s novel, the practices of homeland securitization are revealed in all their \ncontingency and unpredictability (asked by his wife what the Homeland Security \n 22 \ndepartment‟s elevation of threat from yellow to orange means, Levy replies “It means \nthey want us to feel they have a handle on this thing, but they don‟t”). The algorithmic \ntechnologies, so readily established at the forefront of the securitization of borders and \nboundaries of many kinds, are revealed in Updike‟s novel to be intrinsic to the feigning \nof securability. The point here is that we know not, in any meaningful sense, what \nalgorithmic war will do beyond giving the impression that things\/people\/commodities can \nbe secured against an imagined enemy. It could have been the case – had the association \nrules shown the white truck to be on a watch list database, or the E-Z Pass to be expired, \nor had a previous transaction flagged a risk – that the algorithm signalled a red light and \nthe movement of the truck would have been intercepted. Yet, these are the contingencies \nof the relationship of the algorithmic calculation to the actual everyday geographies they \nseek to model and simulate. These are the unknowns, the indeterminacies of algorithmic \nwar. \n \nThe question, then, is how to open up these contingencies and ambiguities in order to \npoliticize what would otherwise be a highly technologized set of moves. “Uncertainty \nand unpredictability can be unsettling”, writes Jenny Edkins, “in the rational west, we \ntend to seek certainty and security above all. We don‟t like not knowing. So we pretend \nthat we do” (2003a: 12). The algorithmic war I have described here – with its dividing \ngeographies of us\/them, safe\/risky – is precisely one means by which we “pretend that we \ndo”. Algorithmic logics appear to make it possible to translate probable associations \nbetween people and objects into actionable security decisions, or to incorporate the \nuncertain future into the present. The practices of this war by other means, then, are \nthemselves productive of quite specific pre-emptive forms of war and violence. Though \nthe everyday geographies of this „other‟ war on terror are partially militarizing, in the \nsense of drawing military practice more closely into proximity with everyday life, they \nare more meaningfully drawing on a militarization of thinking that is co-present in \ncorporate calls for risk targets and the riding out of uncertainty, in state drives to target, \ntrack and trace people and objects, and in the suspicions and prejudices of an enlisted \nvigilant public. \n  \n 23 \n \nReferences \n \nAccenture (2005) Values, Driven, Leadership: The History of Accenture, Chantilly VA: \nHistory Factory. \nAccenture Digital Forum (2004) „US DHS to develop and implement US VISIT \nprogram‟, available at www.digitalforum.accenture.com, last accessed February 2007. \nAgrawal, Rakesh, Tomasz Imielinski and Arun Swami (1993) „Mining Association Rules \nBetween Sets of Items in Large Databases‟ SIGMOD Proceedings pp.914-925. \nAitken, Rob (2006) „Capital at its Fringes‟, New Political Economy 11:4 \nAmoore, Louise (2007) „Vigilant Visualities: The Watchful Politics of the War on Terror, \nSecurity Dialogue 38: 2. \nAmoore, Louise (2006) „Biometric Borders: Governing Mobilities in the War on Terror‟, \nPolitical Geography 25: 3, pp.336-351. \nAmoore, Louise and Marieke de Goede (2005) „Governance, Risk and Dataveillance in \nthe War on Terror‟, Crime, Law and Social Change 43, pp.149-173.   \nBaker, Tom (2002) „Liability and Insurance after September 11: Embracing Risk Meets \nthe Precautionary Principle‟, University of Connecticut School of Law Working Papers \nSeries. 4  \nBigo, Didier (2001) „The Möbius Ribbon of Internal and External Security(ies)‟, in M. \nAlbert, D.Jacobson and Y.Lapid (eds) Identities, Borders, Orders: Rethinking \nInternational Relations Theory, Minneapolis: University of Minnesota press.  \nBMSA (2004) The Mathematical Sciences’ Role in the War on Terror, National \nAcademies Press. \nBorriello, G. (2005) „RFID: Tagging the World‟, Communications of the ACM 48, pp.34-\n37. \nCampbell, David (1992) Writing Security: US Foreign Policy and the Politics of Identity, \nManchester: Manchester University Press.  \nChalfin, Brenda (2004) „Border Scans: Sovereignty, Surveillance and the Customs \nService in Ghana‟, Identities: Global Studies in Culture and Power 11, pp.397-416.  \n 24 \nChertoff, Michael (2006) „A Tool we Need to Stop the Next Airliner Plot‟, Washington \nPost, August 29: A15. \nComputing (2004) „Government Confirms IBM‟s Semaphore Win‟, November 3 2004.  \nCrandall, Jordan (2006) „Precision+Guided+Seeing‟, C.theory.net\/articles.aspx?id=502. \nCrandall, Jordan (2005) „Envisioning the Homefront: Militarization, Tracking and \nSecurity Culture, Journal of Visual Culture 4: 1, pp.5-15. \nConnolly, William (2005) Pluralism, Durham and London: Duke University Press. \nCuff, Dana (2003) „Immanent Domain: Pervasive Computing and the Public Realm‟, \nJournal of Architectural Education, pp.43-49. \nDas, Veena and Arthur Kleinman (2000) „Introduction‟, in Veena Das, Arthur Kleinman, \nMamphala Ramphele and Pamela Reynolds (eds)  Violence and Subjectivity, Berkeley: \nUniversity of California Press.  \nDe Goede, Marieke (2003) „Hawala Discourses and the War on Terrorist Finance,‟ \nEnvironment and Planning D: Society and Space 21 (5): 513-532. \nDepartment of Homeland Security (2006) „Survey of DHS Data Mining Activities‟, \nWashington DC: Office of the Inspector General. \nDepartment of Homeland Security (2003) „US VISIT Begins Testing RFID Technology \nto Improve Border Security and Travel‟, press release August 8, available at \nwww.dhs.gov\/xnews\/releases\/press_release_0713-shtm last accessed November 2006.  \nDer Derian, James (2002) „The War of Networks‟, Theory & Event 5: 4. \nDerrida, Jacques (1999) The Gift of Death, Chicago: University of Chicago Press. \nDillon, Michael and Julian Reid (2007) The Liberal Way of War, London: Routedge.  \nEckfeldt, Bruce (2005) „What Does RFID Do for the Consumer?‟, Communications of \nthe ACM 48: 9, pp.77-79.  \nEdkins, Jenny (2003a) Trauma and the Memory of Politics, Cambridge: Cambridge \nUniversity Press. \nEdkins, Jenny (2003b) „Security, Cosmology, Copenhagen‟, Contemporary Politics 9: 4, \npp.361-370. \nEdwards, Paul N. (1996) The Closed World: Computers and the Politics of Discourse in \nCold War America, MIT Press. \n 25 \nEricson, Richard and Aaron Doyle (2004) „Catastrophe Risk, Insurance and Terrorism‟, \nEconomy and Society 33: 2, pp.135-173. \nFoucault, Michel (2003[1976]) Society Must be Defended: Lectures at the Còllege de \nFrance, New York: Picador. \nFoucault, Michel (2007[1977]) Security, Territory, Population: Lectures at the Còllege \nde France, Basingstoke:Macmillan. \nGraham, Stephen (ed.) (2004) Cities, War and Terrorism: Towards an Urban \nGeopolitics, Oxford: Blackwell.  \nGregory, Derek and Alan Pred (eds) (2007) Violent Geographies: Fear, Terror and \nPolitical Violence, New York: Routledge. \nGregory, Derek (2004) The Colonial Present, Oxford: Blackwell. \nGuild, Elspeth and Evelien Brouwer (2006) „The Political Life of Data: The ECJ \nDecision on the PNR Agreement between the EU and the US‟, CEPS Policy Brief 109, \nwww.libertysecurity.org\/IMG\/pdf\/1363.pdf  \nEwald, François (2002) „The Return of Descartes‟s Malicious Demon: An Outline of a \nPhilosophy of Precaution‟, in Tom Baker and Jonathan Simon (eds) Embracing Risk: The \nChanging Culture of Insurance and Responsibility, Chicago: University of Chicago \nPress.    \nHacking, Ian (1990) The Taming of Chance \nHale, Benjamin (2005) „Identity Crisis: Facial Recognition Technology and the Freedom \nof the Will‟, Ethics, Place and Environment 8: 2, pp.141-158. \nIDC (2004) „Identity Management‟s Role in an Application-Centric Security Model‟, \nWhite Paper, Framingham MA: IDC. \nIntelligent Enterprise (2002) „For Want of a Nail‟, 5:7, p.8. \nKang, Jerry and Dana Cuff (2005) „Pervasive Computing: Embedding the Public Sphere‟, \nPublic Law Research Paper Series no.04-23, Los Angeles: University of California.   \nKatz, Cindi (2007) „Banal Terrorism‟, in Gregory, Derek and Alan Pred (eds) (2007) \nViolent Geographies: Fear, Terror and Political Violence, New York: Routledge. \nLight, Jennifer (2003) From Warfare to Welfare, Baltimore MD: Johns Hopkins \nUniversity Press.  \n 26 \nMartin, Reinhold (2003) The Organizational Complex: Architecture, Media and \nCorporate Space, MIT Press. \nNew York Times (2006) „Private Sector Entices Anti-Terror Officials‟, June 18 pp.6-18. \nQuinlan, J.R. (1986) „Induction of Decision Trees‟, Machine Learning 1, pp.81-106. \nScience News (2006) „Beyond Bar Codes: Tuning Up Plastic Radio Labels‟, Science \nNews 169: 6. \nShapiro, Michael (1997) Violent Cartographies: Mapping Cultures of War, Minneapolis: \nUniversity of Minnesota Press. \nShapiro, Michael (2004) „“The Nation-State and Violence”: Wim Wenders contra \nImperial Sovereignty‟, in Jenny Edkins, Veronique Pin-Fat and Michael Shapiro (eds) \nSovereign Lives: Power in Global Politics, New York; Routledge.   \nSmith J.R. et al. (2005) „RFID-based techniques for human-activity detection‟, \nCommunications of the ACM, 48: 9, pp.39-44. \nSparke, Matthew (2005) In the Space of Theory: Postfoundational Geographies of the \nNation-State, Minneapolis: University of Minnesota Press. \nSparke, Matthew (2006) „A neoliberal nexus: economy, security and the biopolitics of \ncitizenship on the border‟, Political Geography 25(2): 151-180. \nStockman, H. (1948) „Communicating by Means of Reflected Power‟, Proceedings of the \nInstitute of Radio Engineers, October, pp.1196-1204.  \nThrift, Nigel (2004) „Remembering the Technological Unconscious by Foregrounding \nKnowledges of Position‟, Environment and Planning D: Society and Space 22, 175-190. \nUS Department of Justice (2002) „Hearing on the financial war on terrorism and the \nadministration‟s implementation of the anti-money-laundering provisions of the USA \nPATRIOT Act‟, Washington DC: US Senate Committee on Banking, Housing and Urban \nAffairs.  \nUS Joint Inquiry (2003) „Report of the Joint Inquiry into the Terrorist Attacks of \nSeptember 11, 2001‟, Washington DC: House Permanent Select Committee on \nIntelligence (HPSCI) and the Senate Select Committee on Intelligence (SSCI). \nWeber, Samuel (2005) Targets of Opportunity: On the Militarization of Thinking, New \nYork: Fordham University Press. \n                                                 \n \n 27 \n                                                                                                                                                 \nAcknowledgements \nThis article was first presented at the „Militarization, Society and Space‟ symposium, Institute of \nGeography, University of Edinburgh, 23 November 2006. Profound thanks are due to Andrea Nightingale \nand Jane Jacobs for their inspirational event and for their comments on the paper that emerged as a result. \nDeb Cowen and two anonymous reviewers have also made important interventions that I hope I have done \nsome degree of justice to. Funding for the research of which this paper is part is provided by ESRC, „Data \nWars: New Spaces of Governing in the European War on Terror‟, award number RES 062230594, with \nMarieke deGoede (Amsterdam).    \n \n \nNOTES \n1\n Among the 34 items of passenger data required under the EU-US passenger name record (PNR) or \nAdvance passenger information system (APIS) agreement, legally challenged by the European Court of \nJustice in 2006, are credit card details, criminal records and in-flight meal choices. The data is extradited to \nthe US within 15 minutes of flight departures from Europe (Guild and Brouwer 2006). \n2\n In 2005, London‟s Metropolitan Police launched a public vigilance campaign, „If you suspect it, report it‟, \nthat has now been extended across the UK. The campaign urges people to report “suspicions about \nsomebody‟s behaviour” to an anti-terrorist hotline (Metropolitan Police 2005). \n3\n The call centre operator will ask the caller questions about the nature of the suspicion, generating a risk \nprofile from the associations between different items of information – how many trains have passed the \nplatform?; what type of clothing?; carrying a bag?; alone or accompanied?  (insights from confidential \ninterview conducted London, November 2006). \n4\n The green paper I-94 documents are familiar to visa waiver citizens as the declarations completed on \nairline flights to the United States. \n5\n IBM‟s generation of punch-card computers used technology derived from Herman Hollerith‟s patterned \ncards developed for the US census of 1890, itself having roots in pattern cards used in weaving (Hacking \n1990: 53). The IBM Hollerith technologies and techniques were used in the Nazi death camps to identify \nindividuals and to track the „transports‟. After the War, Hollerith machines were also deployed by the Red \nCross to trace survivors. \n6\n At an electronics conference in San Francisco in February 2006, researchers from Philips‟ laboratories in \nthe Netherlands announced their new RFID chips with plastic in place of silicon semi-conductors. \nAccording to Science News, the replacement of silicon “brings closer the prospect of RFID tags becoming \nas common as bar codes, or perhaps even more so as plastic tags make novel electronic tracking and \ntransactions possible, from computer monitoring of what is in the refrigerator to mail routing by means of \nsmart address labels” (2006: 1). \n7\n Full text of the miSense programme is available at www.misense.org, last accessed December 2006. \n"}