{"doi":"10.1007\/s00192-010-1156-7","coreId":"177283","oai":"oai:aura.abdn.ac.uk:2164\/2070","identifiers":["oai:aura.abdn.ac.uk:2164\/2070","10.1007\/s00192-010-1156-7"],"title":"Systematic review of the efficacy and safety of using mesh in surgery for uterine or vaginal vault prolapse","authors":["Jia, Xueli","Glazener, Cathryn M A","Mowatt, Graham","Jenkinson, David","Fraser, Cynthia","Bain, Christine","Burr, Jennifer"],"enrichments":{"references":[{"id":9071,"title":"(30-83) 3\/144 NR Abdominal (open) Sacrocolpopexy Dacron graft (NR details); polytetrafluoroethylene, GoreTex (Amid type II), and other type of mesh (NR)","authors":[],"date":null,"doi":null,"raw":"Snyder 1991[57]  147  62 (30-83)  3\/144  NR  Abdominal (open)  Sacrocolpopexy  Dacron graft (NR details); polytetrafluoroethylene, GoreTex (Amid type II), and other type of mesh (NR)","cites":null},{"id":9066,"title":"(37-124) Efficacy Safety Wu 2006[61] 212 66 (11) 0\/212 212\/0 Abdominal (open) Sacrocolpopexy Polyethylene tetraphalate, Mersilene (Amid type III); polypropylene (NR trade name); or Gore-Tex NR 15m (0.3-121) Safety","authors":[],"date":null,"doi":null,"raw":"39\/103  66m (37-124)  Efficacy Safety Wu 2006[61]  212  66 (11)  0\/212  212\/0  Abdominal (open)  Sacrocolpopexy   Polyethylene  tetraphalate, Mersilene (Amid type III); polypropylene (NR trade name); or Gore-Tex NR  15m (0.3-121)  Safety UTERINE AND\/OR VAULT RCT Benson 1996[8]  A, 40 B, 48 A, 66 (10) B, 64 (9) NR  NR  A, abdominal B, vaginal A, sacrocolpopexy B, bilateral sacrospinous ligament vault suspension  A, NR B, no mesh Anti-incontinence: A, 14\/40; B, 20\/48 Hysterectomy: A, 20\/40; B, 24\/48","cites":null},{"id":9067,"title":"2.5y (1-5.5) Efficacy Safety Lo 1998[10]","authors":[],"date":null,"doi":null,"raw":"2.5y (1-5.5)  Efficacy Safety Lo 1998[10]  A, 52 B, 66 A, 63 (9) B, 60 (10) NR  NR  A, abdominal (open) B, vaginal A, sacrocolpopexy B, sacrospinous ligament suspension A, polyethylene tetraphalate, Mersilene (Amid type III) B, no mesh Anti-incontinence: A, 0\/52; B, 0\/66 Hysterectomy: A, 33\/52; B, 20\/66 2.1y (1-5.2)  Efficacy Safety  Non-randomised comparative studies Altman 2005[16]  A, 25 B, 27 A, 66 (54-83) B, 69 (55-84) NR  NR  A, abdominal B, abdominal A, sacrocolpopexy B, sacrocolpopexy A, 12 polypropylene, 13 polytetrafluoroethylene (NR trade name) B, porcine dermis, Pelvicol  Hysterectomy: A, 2\/25; B, 5\/27 Efficacy A, 7.4m; B, 7.1m Safety A, 4.3y; B, 2.5y  Safety Bai 2006[17]  A, 20 B, 54 NR  NR  NR  A, abdominal B, abdominal A, sacrocolpopexy B, high uterosacral colpopexy A, polyethylene tetraphalate, Mersilene (Amid type III) B, no mesh  Performed if needed but NR numbers.","cites":null},{"id":9069,"title":"36m (0-74) Efficacy Safety Bradley 2007[36] 305 NR NR NR Abdominal (open) Sacrocolpopexy Non-absorbable synthetic, xenograft, autologous or cadaveric fascia lata Anti-incontinence: 148\/305 1y Efficacy Safety Culligan","authors":[],"date":null,"doi":null,"raw":"36m (0-74)  Efficacy Safety Bradley 2007[36]  305  NR  NR  NR  Abdominal (open)  Sacrocolpopexy   Non-absorbable synthetic, xenograft, autologous or cadaveric fascia lata Anti-incontinence: 148\/305 1y  Efficacy Safety Culligan 2002[38] 245  61 (32-83)  NR  NR  Abdominal   Sacrocolpopexy   Synthetic mesh (NR trade name) Anti-incontinence: 171\/245 Hysterectomy: 11\/245 Objective failure: >=4y; subjective failure: 3.3y (0.8-6.9) Efficacy Safety De Vries 1995[39] 101  59 (37-82)  15\/83  NR  Abdominal (open)  Sacrocolpopexy   Polyethylene  tetraphalate, Mersilene (Amid type III)  Anti-incontinence : 20\/101 Hysterectomy : NR","cites":null},{"id":9070,"title":"4y (1-13) Efficacy Safety Higgs 2005b[46] 148 58 (10) 24\/123 NR Abdominal (open) Sacrocolpopexy Combined mesh, polyproglactine and prolene 1 :1, Vypro; fascia lata; polypropylene, Prolene; polyethylene tetraphalate,","authors":[],"date":null,"doi":null,"raw":"4y (1-13)  Efficacy Safety Higgs 2005b[46]  148  58 (10)  24\/123  NR  Abdominal (open)  Sacrocolpopexy   Combined mesh, polyproglactine and prolene 1 :1, Vypro; fascia lata; polypropylene, Prolene; polyethylene tetraphalate, Mersilene.  Anti-incontinence : 76\/148 Hysterectomy : 25\/148 45m (15)  Efficacy Safety Lindeque 2002[51] 262  28-79  4\/258  8\/254  Abdominal (open)  Sacrocolpopexy   18 dura mater strips, then changed to polytetrafluoroethylene, GoreTex (Amid type II)  Anti-incontinence: 106\/262 Hysterectomy: NR All >=16m  Efficacy Safety","cites":null},{"id":9065,"title":"51m (12-115) Efficacy Safety Griffis 2006[23]","authors":[],"date":null,"doi":null,"raw":"51m (12-115)  Efficacy Safety Griffis 2006[23]  A, 60 B, 28 NR  A, 60\/0 B, 28\/0 NR  A, abdominal B, abdominal A, total hysterectomy + sacrocolpopexy B, supracervical hysterectomy + sacrocolpopexy A, polypropylene, Prolene soft, Prolene (Amid type I), or Atrium (NR Amid type); polyethylene tetraphalate, Mersilene (Amid type III) B, same as A NR  13m (12-15)  Safety Case series Wu 2006[61]  101  64 (12)  101\/0  101\/0  Abdominal (open)  Hysterectomy + sacrocolpopexy  polyethylene tetraphalate, Mersilene (Amid type III); polypropylene (NR trade name); or Gore-Tex (Amid type II) NR  15m (0.2-120)  Safety VAULT RCT Culligan 2005[9]  A, 54 B, 46 A, 60 (10) B, 58 (11) A, 0\/54 B, 0\/46 NR  A, abdominal (open) B, abdominal (open) A, sacrocolpopexy B, sacrocolpopexy A, polypropylene, Trelex B, cadaveric fascia lata, Tutoplast NR  1y  Efficacy Safety Maher 2004[11]  A, 47 B, 48 A, 63 (39-84) B, 63 (35-88) A, 0\/47 B, 0\/48 NR  A, abdominal B, vaginal A, sacrocolpopexy B, unilateral vaginal sacrospinous colpopexy A, polypropylene, Prolene (Amid type I) B, no mesh NR  24m (6-60)  Efficacy Safety  Non-randomised comparative studies Govier 2005[21]  A, 24 B, 21 A+B, 67 (51-86) A, 0\/24 B, 0\/21 NR  A, abdominal (open or laparoscopic) B, abdominal (open or laparoscopic)  A, sacrocolpopexy B, sacrocolpopexy A, polypropylene, Prolene B, silicone-covered polyethylene mesh, American Medical Systems A+B, 20\/45  A, 12m (1-38) B, 23m (16-41) Efficacy Safety  Marcickiewicz 2007[26] A, 60 B, 51 A, 58 (30-83) B, 66 (43-88) A, 0\/60 B, 0\/51 NR  A, abdominal (laparoscopic) B, vaginal  A, sacrocolpopexy B, sacrospinous colpopexy A, polypropylene, Prolene B, no mesh A, 6\/60; B, 8\/51  A, 34m (13-60) B, 38m (7-108)  Efficacy Safety Paraiso 2005[29]  A, 56 B, 61 A, 62 (39-85) B, 61 (35-81) A, 0\/56 B, 0\/61 NR  A, abdominal (laparoscopic) B, abdominal (open) A, sacrocolpopexy B, sacrocolpopexy A, cadaveric fascia lata, Tutoplast, or polypropylene, Prolene B, save as above A, 24\/56; B, 38\/61  A, 14m (1-46) B, 16m (1-73) Safety 3 7","cites":null},{"id":9039,"title":"A new technique of uterine suspension to pectineal ligaments in the management of uterovaginal prolapse.","authors":[],"date":"1993","doi":null,"raw":"49. Joshi VM (1993). A new technique of uterine suspension to pectineal ligaments in the management of uterovaginal prolapse. Obstet Gynecol  81:790-793.","cites":null},{"id":9008,"title":"A prospective randomized study comparing posterior IVS and sacrospinous suspension for the surgical treatment of uterine or vaginal vault prolapse.","authors":[],"date":"2006","doi":"10.1016\/j.ijgo.2007.07.015","raw":"15. Tayrac R, Bader G, Deffieux X, Fazel A, Mathe ML, Fernandez H (2006). A prospective randomized study comparing posterior IVS and sacrospinous suspension for the surgical treatment of uterine or vaginal vault prolapse. Int Urogynecol J 17:S234-S235.","cites":null},{"id":9006,"title":"A randomised controlled trial comparing abdominal and vaginal prolapse surgery: effect on urogenital function.","authors":[],"date":"2004","doi":"10.1111\/j.1471-0528.2004.00001.x","raw":"12. Roovers JP, van der Vaart C, van der Bom JG, van Leeuwen JH, Scholten PC, Heintz PM (2004). A randomised controlled trial comparing abdominal and vaginal prolapse surgery: effect on urogenital function. BJOG 111:50-56.","cites":null},{"id":9003,"title":"A randomized controlled trial comparing fascia lata and synthetic mesh for sacral colpopexy.","authors":[],"date":"2005","doi":"10.1097\/01.AOG.0000165824.62167.c1","raw":"9. Culligan PJ, Blackwell L, Goldsmith LJ, Graham CA, Rogers A, Heit MH (2005). A randomized controlled trial comparing fascia lata and synthetic mesh for sacral colpopexy. Obstet Gynecol 106:29-37.","cites":null},{"id":9022,"title":"A retrospective comparison of abdominal sacrocolpopexy with Burch colposuspension versus sacrospinous fixation with transvaginal needle suspension for the management of vaginal vault prolapse and coexisting stress incontinence.","authors":[],"date":"1999","doi":"10.1007\/s001920050066","raw":"30. Sze EH, Kohli N, Miklos JR, Roat T, Karram MM (1999). A retrospective comparison of abdominal sacrocolpopexy with Burch colposuspension versus sacrospinous fixation with transvaginal needle suspension for the management of vaginal vault prolapse and coexisting stress incontinence. Int Urogynecol J 10:390-393.","cites":null},{"id":9024,"title":"A survey of the complications of vaginal prolapse surgery performed by members of the Society Of Gynecologic Surgeons.","authors":[],"date":"2004","doi":"10.1007\/s00192-004-1127-y","raw":"32. Young SB, Kohorn EI, Braz-Martin S, Baker SP (2004). A survey of the complications of vaginal prolapse surgery performed by members of the Society Of Gynecologic Surgeons. Int Urogynecol J 15:165-170.","cites":null},{"id":9063,"title":"a,b.c Results from the two arms of one\/two\/four studies were combined 32 Table 2 Median and ranges of mesh erosion rates for sacrocolpopexya,b No. study n\/N (%) Median (range) Non-absorbable synthetic mesh","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":9004,"title":"Abdominal colposacropexy and sacrospinous ligament suspension for severe uterovaginal prolapse: A comparison.","authors":[],"date":"1998","doi":"10.1089\/gyn.1998.14.59","raw":"10. Lo T-S (1998). Abdominal colposacropexy and sacrospinous ligament suspension for severe uterovaginal prolapse: A comparison. J Gynecol Surg 14:59-64.","cites":null},{"id":9010,"title":"Abdominal high uterosacral colpopexy and abdominal sacral colpopexy with mesh for pelvic organ prolapse.","authors":[],"date":"2006","doi":"10.1016\/j.ijgo.2005.10.007","raw":"17. Bai SW, Kwon HS, Chung DJ (2006). Abdominal high uterosacral colpopexy and abdominal sacral colpopexy with mesh for pelvic organ prolapse. Int J Gynecol Obstet 92:147-148.","cites":null},{"id":9048,"title":"Abdominal sacral colpopexy in 163 women with posthysterectomy vaginal vault prolapse and enterocele. Evolution of operative techniques.","authors":[],"date":"1992","doi":"10.1097\/00006254-199209000-00015","raw":"59. Timmons MC, Addison WA, Addison SB, Cavenar MG (1992). Abdominal sacral colpopexy in 163 women with posthysterectomy vaginal vault prolapse and enterocele. Evolution of operative techniques. J Reprod Med 37:323-327.","cites":null},{"id":9005,"title":"Abdominal sacral colpopexy or vaginal sacrospinous colpopexy for vaginal vault prolapse: a prospective randomized study.","authors":[],"date":"2004","doi":"10.1016\/j.ajog.2003.08.031","raw":"11. Maher CF, Qatawneh AM, Dwyer PL, Carey MP, Cornish A, Schluter PJ (2004). Abdominal sacral colpopexy or vaginal sacrospinous colpopexy for vaginal vault prolapse: a prospective randomized study. Am J Obstet Gynecol 190:20-26.","cites":null},{"id":9027,"title":"Abdominal sacral suspensions: analysis of complications using permanent mesh.","authors":[],"date":"2005","doi":"10.1016\/j.ajog.2005.07.066","raw":"35. Bensinger G, Lind L, Lesser M, Guess M, Winkler HA (2005). Abdominal sacral suspensions: analysis of complications using permanent mesh. Am J Obstet Gynecol 193:2094-2098.","cites":null},{"id":9031,"title":"Abdominal sacrocolpopexy for vault prolapse without burial of mesh: a case series.","authors":[],"date":"2005","doi":"10.1111\/j.1471-0528.2004.00426.x","raw":"40. Elneil S, Cutner AS, Remy M, Leather AT, Toozs-Hobson P,Wise B (2005). Abdominal sacrocolpopexy for vault prolapse without burial of mesh: a case series. BJOG 112:486-489.","cites":null},{"id":9046,"title":"Abdominal-retroperitoneal sacral colpopexy for the correction of vaginal prolapse.","authors":[],"date":"1991","doi":"10.1016\/0020-7292(92)90055-N","raw":"57. Snyder TE, Krantz KE (1991). Abdominal-retroperitoneal sacral colpopexy for the correction of vaginal prolapse. Obstet Gynecol 77:944-949.","cites":null},{"id":9047,"title":"Abdominovaginal sacral colpoperineopexy: patient perceptions, anatomical outcomes, and graft erosions.","authors":[],"date":"2007","doi":"10.1007\/s00192-006-0196-5","raw":"58. Su KC, Mutone MF, Terry CL, Hale DS (2007). Abdominovaginal sacral colpoperineopexy: patient perceptions, anatomical outcomes, and graft erosions. Int Urogynecol J 18:503-511.","cites":null},{"id":9049,"title":"Anterior intravaginal slingplasty tunneller device for stress incontinence and posterior intravaginal slingplasty for apical vault prolapse: a 2-year prospective multicenter study.","authors":[],"date":"2007","doi":"10.1016\/j.ajog.2007.03.056","raw":"60. Vardy MD, Brodman M, Olivera CK, Zhou HS, Flisser AJ, Bercik RS (2007). Anterior intravaginal slingplasty tunneller device for stress incontinence and posterior intravaginal slingplasty for apical vault prolapse: a 2-year prospective multicenter study. Am J Obstet Gynecol 197:104-108.","cites":null},{"id":9028,"title":"Bowel symptoms in women 1 year after sacrocolpopexy.","authors":[],"date":"2007","doi":"10.3834\/uij.1939-4810.2008.06.49","raw":"36. Bradley CS (2007). Bowel symptoms in women 1 year after sacrocolpopexy. Am J Obstet Gynecol 197:642 e1-642 e8.   24 37. Brizzolara S, Pillai-Allen A (2003). Risk of mesh erosion with sacral colpopexy and concurrent hysterectomy. Obstet Gynecol 102:306-310.","cites":null},{"id":9042,"title":"Coker A","authors":[],"date":"2006","doi":"10.1007\/s10397-005-0168-7","raw":"52. Oliver R, Dasgupta C, Coker A (2006). Posterior intravaginal slingplasty for vault and uterovaginal prolapse: An initial experience. Gynecol Surg 3:88-92.","cites":null},{"id":9021,"title":"Comparison of effectiveness of vaginal and abdominal routes in treating severe uterovaginal or vault prolapse.","authors":[],"date":"2004","doi":null,"raw":"28. Ng CC, Han WH (2004). Comparison of effectiveness of vaginal and abdominal routes in treating severe uterovaginal or vault prolapse. Singapore Med J 45:475-481.   23 29. Paraiso MF, Walters MD, Rackley RR, Melek S, Hugney C (2005). Laparoscopic and abdominal sacral colpopexies: a comparative cohort study. Am J Obstet Gynecol 192:1752-1758.","cites":null},{"id":9018,"title":"Comparison of laparoscopic and abdominal sacrocolpopexy for the treatment of vaginal vault prolapse.","authors":[],"date":"2007","doi":"10.1089\/end.2006.0381","raw":"25. Hsiao KC (2007). Comparison of laparoscopic and abdominal sacrocolpopexy for the treatment of vaginal vault prolapse. J Endourol 21:926-930.","cites":null},{"id":9020,"title":"Conservation of the prolapsed uterus is a valid option: medium term results of a prospective comparative study with the posterior intravaginal slingoplasty operation.","authors":[],"date":"2007","doi":"10.1007\/s00192-006-0262-z","raw":"27. Neuman M, Lavy Y (2007). Conservation of the prolapsed uterus is a valid option: medium term results of a prospective comparative study with the posterior intravaginal slingoplasty operation. Int Urogynecol J 18:889-893.","cites":null},{"id":8996,"title":"Conservative management of pelvic organ prolapse in women.","authors":[],"date":"2006","doi":"10.1002\/14651858.cd003882.pub3","raw":"1. Hagen S, Stark D, Maher C, Adams EJ (2006). Conservative management of pelvic organ prolapse in women. Cochrane Database of Systematic Reviews Issue 4. Art. No.: CD003882. DOI: 10.1002\/14651858.CD003882.pub3.","cites":null},{"id":8999,"title":"DOI: 10.1002\/14651858.CD004014.pub3.: 4. Systematic review of the efficacy and safety of using mesh or grafts in surgery for uterine or vaginal vault prolapse","authors":[],"date":"2008","doi":null,"raw":"No.: CD004014. DOI: 10.1002\/14651858.CD004014.pub3.: 4. Systematic review of the efficacy and safety of using mesh or grafts in surgery for uterine or vaginal vault prolapse (2008). National Institute for Health and Clinical Excellence, London [accessed September 2009]. Available from : URL: http:\/\/www.nice.org.uk\/guidance\/index.jsp?action=download&o=41728.","cites":null},{"id":9068,"title":"Efficacy Safety Hardiman 1996[24]","authors":[],"date":null,"doi":null,"raw":"Performed but NR numbers A, 26 (10-48) B, 21 (11-34) Efficacy Safety Hardiman 1996[24] A, 80 B, 125 A, 61 B, 64 NR  NR  A, abdominal B, vaginal A, sacrocolpopexy B, sacrospinous vault suspension A, polypropylene, Marlex (Amid type I) B, no mesh  Anti-incontinence: A, 76\/80; B, 45\/125 Hysterectomy: A, 18\/80; B, 45\/125  A, 3.9y B, 2.2y A+B, 6m-5y Efficacy Safety Hsiao 2007[25]  A, 25 B, 22 A, 66 B, 71 A, 2\/23 B, 3\/19 NR  A, abdominal (laparoscopic) B, abdominal (open) A, sacrocolpopexy B, sacrocolpopexy A, 19 polypropylene, Prolene; 3 silicone mesh B, 2 fascia lata; 13 polypropylene, Prolene; 5 silicon mesh; 2 polypropylene, Gore-Tex  Anti-incontinence: A, 9\/25; B, 10\/22 Hysterectomy: NR A, 6m B, 10m Safety Ng 2004[28]      A, 113 B, 64 A, 60 B, 63 A, 78\/35 B, 37\/27 NR  A, abdominal (open) B, vaginal A, sacrocolpopexy B, sacrospinous ligament fixation A, polytetrafluoroethylene, Gore-Tex (Amid type II) B, no mesh Anti-incontinence: A, 28\/113; B, 12\/64 Hysterectomy: A, 78\/113; B, 38\/64  A, 18m (1-48) B, 13m (1-29) Efficacy Safety Sze 1999[30]  A, 56 B, 61 A, 57 (34-74) B, 64 (43-76) A, 19\/35 B, 7\/40 NR  A, abdominal (open) B, vaginal A, sacrocolpopexy B, sacrospinous ligament fixation A, NR B, no mesh Anti-incontinence: A, 56\/56; B, 61\/61 Hysterectomy: A, 7\/56; B, 19\/61  A, 23m (4-51) B, 24m (7-72) Safety Visco 2001[31]  A, 155 B, 88 C, 25 D, 5 A+B+C+D, 61 (31-84) NR  NR  A, abdominal B, abdominal C, vaginal+ abdominal D, vaginal+ abdominal  A, sacrocolpopexy B, sacrocolpoperineopexy C, sacrocolpoperineopexy D, sacrocolpoperineopexy with mesh placed to vaginal field  A, polyethylene tetraphalate, Mersilene (Amid type III) or Gore-Tex (Amid type II) B, C, D, same as above Anti-incontinence: NR Hysterectomy: A+B+C+D: 45\/273 A, 7m (1-87) B, 5 (1-45) C, 6m (1-28) D, 7m (2-11)  Young 2004[32] (prospective registry) A, 92 B, 187 C, 70 A, 61 (28-84) B, 37-87 C, 64 (34-84) NR  NR  A, abdominal (laparoscopic) B, vaginal C, vaginal A, sacrocolpopexy B, sacrospinous fixation C, high uterosacral suspension A, a mixture of biological grafts and non-absorbable synthetic mesh B, no mesh C, no mesh Anti-incontinence: A, 44\/92; B, 28\/187; C, 8\/70 Hysterectomy: A, 6\/92; B, 63\/187; C, 17\/70 NR, a safety registry in a year (Oct. 1998-Oct. 1999) Safety Case series Bensinger 2005[35] 121  53 (10)  86\/35  121\/0  Abdominal   Sacrocolpopexy   Polypropylene (NR trade name)  Anti-incontinence: 82\/121 Hysterectomy: NR 13m (0.3-63)  Safety 3 9","cites":null},{"id":9057,"title":"Epidemiology of surgically managed pelvic organ prolapse and urinary incontinence.","authors":[],"date":"1997","doi":"10.1016\/S0029-7844(97)00058-6","raw":"69. Olsen AL, Smith VJ, Bergstrom JO, Colling JC, Clark AL (1997). Epidemiology of surgically managed pelvic organ prolapse and urinary incontinence.  Obstet Gynecol 89:501-506.","cites":null},{"id":9061,"title":"for Health and Clinical Excellence,","authors":[],"date":"2009","doi":"10.1111\/j.1478-5153.2009.00346.x","raw":"National Institute for Health and Clinical Excellence, London [accessed September 2009]. Available from: URL: http:\/\/www.nice.org.uk\/nicemedia\/pdf\/IPG281Guidance.pdf.","cites":null},{"id":9045,"title":"Haberal A","authors":[],"date":"2005","doi":"10.1111\/j.1479-828X.2005.00374.x","raw":"56. Sivaslioglu AA, Gelisen O, Dolen I, Dede H, Dilbaz S, Haberal A (2005). Posterior sling (infracoccygeal sacropexy): An alternative procedure for vaginal vault prolapse. Aust N Z J Obstet Gynaecol 45:159-160.","cites":null},{"id":9014,"title":"High complication rate identified in sacrocolpopexy patients attributed to silicone mesh.","authors":[],"date":"2005","doi":"10.1016\/j.urology.2004.12.056","raw":"(2005). High complication rate identified in sacrocolpopexy patients attributed to silicone mesh. Urology 65:1099-1103.","cites":null},{"id":9011,"title":"Incidence and management of abdominal sacrocolpopexy mesh erosions.","authors":[],"date":"2005","doi":"10.1016\/j.ajog.2005.02.062","raw":"18. Begley JS, Kupferman SP, Kuznetsov DD, Kobashi KC, Govier FE, McGonigle KF et al (2005). Incidence and management of abdominal sacrocolpopexy mesh erosions. Am J Obstet Gynecol 192:1956-1962.","cites":null},{"id":9034,"title":"Infracoccygeal sacropexy.","authors":[],"date":"2007","doi":"10.1111\/j.1479-828X.2007.00728.x","raw":"43. Foote AJ (2007). Infracoccygeal sacropexy. Aust N Z J Obstet Gynaecol 47:250-251.","cites":null},{"id":9074,"title":"IVS Tunneller Anti-incontinence: NR Hysterectomy: 3\/7 Efficacy: 6w Safety: 5m (2-11) Safety 42 ID N Age, y Uterine\/ vault Primary\/ secondary Intervention route Technique Mesh\/graft Anti-incontinence procedures Follow up Outcomes Petros","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":9051,"title":"Laparoscopic versus robotic assisted laparoscopic sacrocolpopexy for vaginal prolapse.","authors":[],"date":"2007","doi":"10.1016\/S0084-4071(08)70060-5","raw":"63. Chen CC (2007). Laparoscopic versus robotic assisted laparoscopic sacrocolpopexy for vaginal prolapse. ClinicalTrials.gov Identifier NCT00551993.  ClinicalTrials.gov [accessed September 2009]. Available from: URL: http:\/\/clinicaltrials.gov\/ct2\/show\/NCT00551993?term=nct00551993&rank=1.","cites":null},{"id":6017915,"title":"laparoscopic) D, abdominal (open) A, sacrocolpopexy B, sacrocolpopexy C, sacrocolpopexy D, sacrocolpopexy A, polypropylene,","authors":[],"date":null,"doi":"10.1016\/s1074-3804(04)80488-2","raw":"1y  Safety Begley 2005[18]  A, 24 B, 33 C, 21 D, 14 A, 69 (49-86) B, 66 (37-84) C, 66 (40-85) D, 63 (25-83) NR  A+B, 85\/7  A, abdominal (19 open, 5 laparoscopic) B, abdominal (open) C, abdominal (18 open, 3 laparoscopic) D, abdominal (open) A, sacrocolpopexy B, sacrocolpopexy C, sacrocolpopexy D, sacrocolpopexy A, polypropylene, Marlex or Prolene (Amid type I) B, polypropylene, Gore-Tex (Amid type II) C, silicon-covered polyester, American Medical Systems D, 1 autologous and 13 cadaveric fascia lata, Tutoplast Anti-incontinence: A, 9\/24; B, 14\/33; C, 9\/21; D, 5\/14 Hysterectomy: A, 1\/24; B, 8\/33; C, 3\/21; D, 7\/14 A, 10m B, 29m C, 16m D, 19m Efficacy Safety  3 8","cites":null},{"id":9053,"title":"LAS study - a randomised controlled trial of abdominal versus laparoscopic sacrocolpopexy for the treatment of post-hysterectomy vaginal vault prolapse.","authors":[],"date":"2006","doi":"10.1007\/s00192-012-1885-x","raw":"65. Freeman R (2006). LAS study - a randomised controlled trial of abdominal versus laparoscopic sacrocolpopexy for the treatment of post-hysterectomy vaginal vault prolapse.","cites":null},{"id":9037,"title":"Long term review of laparoscopic sacrocolpopexy.","authors":[],"date":"2005","doi":"10.1111\/j.1471-0528.2005.00646.x","raw":"47. Higgs PJ, Chua HL, Smith AR (2005). Long term review of laparoscopic sacrocolpopexy. BJOG 112:1134-1138.","cites":null},{"id":9009,"title":"Long-term outcome of abdominal sacrocolpopexy using xenograft compared with synthetic mesh.","authors":[],"date":"2006","doi":"10.1016\/j.urology.2005.10.034","raw":"16. Altman D, Anzen B, Brismar S, Lopez A, Zetterstrom J (2006). Long-term outcome of abdominal sacrocolpopexy using xenograft compared with synthetic mesh. Urology 67:719-724.","cites":null},{"id":9029,"title":"Longterm success of abdominal sacral colpopexy using synthetic mesh.","authors":[],"date":"2002","doi":"10.1067\/mob.2002.129160","raw":"38. Culligan PJ, Murphy M, Blackwell L, Hammons G, Graham C, Heit MH (2002). Longterm success of abdominal sacral colpopexy using synthetic mesh. Am J Obstet Gynecol 187:1473-1480.","cites":null},{"id":8997,"title":"Mechanical devices for pelvic organ prolapse in women.","authors":[],"date":"2004","doi":"10.1002\/14651858.cd004010.pub2","raw":"2. Adams EJ, Thomson A, Maher C, Hagen S (2004). Mechanical devices for pelvic organ prolapse in women. Cochrane Database of Systematic Reviews Issue 2. Art. No.: CD004010. DOI: 10.1002\/14651858.CD004010.pub2.","cites":null},{"id":9016,"title":"Mesh erosion and abdominal sacrocolpopexy: A comparison of prior, total, and supracervical hysterectomy.","authors":[],"date":"2006","doi":"10.1097\/01.spv.0000134007.32982.65","raw":"23. Griffis K, Evers MD, Terry CL, Hale DS (2006). Mesh erosion and abdominal sacrocolpopexy: A comparison of prior, total, and supracervical hysterectomy. J Pelvic Med Surg 12:25-30.","cites":null},{"id":9050,"title":"Mesh erosion in abdominal sacral colpopexy with and without concomitant hysterectomy.","authors":[],"date":"2006","doi":"10.1016\/j.ajog.2006.01.051","raw":"61. Wu JM, Wells EC, Hundley AF, Connolly A, Williams KS, Visco AG (2006). Mesh erosion in abdominal sacral colpopexy with and without concomitant hysterectomy. Am J Obstet Gynecol 194:1418-1422.   27 62. Brown M (2004). Long-term effectiveness of abdominal sacrocolpopexy for the treatment of pelvic organ prolapse. ClinicalTrials.gov Identifier NCT00099372.  ClinicalTrials.gov [accessed September  2009] Available from: URL: http:\/\/clinicaltrials.gov\/ct2\/show\/NCT00099372?term=nct00099372&rank=1.","cites":null},{"id":9036,"title":"Morbidity associated with posterior intravaginal slingplasty for uterovaginal and vault prolapse. Arch Gynecol Obstet 276:499-504. 25 46. Higgs","authors":[],"date":"2007","doi":"10.1007\/s00404-007-0375-8","raw":"45. Hefni M (2007). Morbidity associated with posterior intravaginal slingplasty for uterovaginal and vault prolapse. Arch Gynecol Obstet 276:499-504.   25 46. Higgs P, Goh J, Krause H, Sloane K, Carey M (2005). Abdominal sacral colpopexy: an independent prospective long-term follow-up study. Aust N Z J Obstet Gynaecol 45:430-434.","cites":null},{"id":9062,"title":"National Institute for Health and Clinical Excellence","authors":[],"date":"2009","doi":"10.1111\/j.1478-5153.2009.00346.x","raw":"74. National Institute for Health and Clinical Excellence (2009). Sacrocolpopexy with hysterectomy using mesh for uterine prolapse repair. Interventional Procedure Guidance IPG284. National Institute for Health and Clinical Excellence, London [accessed September 2009]. Available from: URL: http:\/\/www.nice.org.uk\/nicemedia\/pdf\/IPG%20284%20Guidance%20LR%20FINAL.PDF.p df.      30 Figure 1 Flow diagram for screening process.  Potentially relevant reports identified and screened for retrieval (n=853) Reports retrieved for more detailed evaluation (n=281) Studies included (n=54, in 67 reports): 5 full text RCTs, 3 RCTs available as conference abstract, 17 non-randomised comparative studies, 29 case series Excluded reports (n=227): Case series reporting sacrocolpopexy but sample size < 100 (n=100), No mesh used (n=18), Data not presented separately for uterine or vault repair or for mesh techniques (n=14), No data reported (n=4), Other reasons, e.g. reviews (n=91) Excluded reports (n=572): not meeting inclusion criteria, e.g. no mesh was used 3 1","cites":null},{"id":9059,"title":"National Institute for Health and Clinical Excellence (2009). Infracoccygeal sacropexy using mesh for uterine prolapse repair.","authors":[],"date":"2009","doi":null,"raw":"71. National Institute for Health and Clinical Excellence (2009). Infracoccygeal sacropexy using mesh for uterine prolapse repair. Interventional Procedure Guidance IPG280. National Institute for Health and Clinical Excellence, London [accessed September 2009]. Available from: URL: http:\/\/www.nice.org.uk\/nicemedia\/pdf\/IPG280Guidance.pdf.","cites":null},{"id":9060,"title":"National Institute for Health and Clinical Excellence (2009). Insertion of mesh uterine suspension sling (including sacrohysteropexy) for uterine prolapse repair.","authors":[],"date":"2009","doi":null,"raw":"72. National Institute for Health and Clinical Excellence (2009). Insertion of mesh uterine suspension sling (including sacrohysteropexy) for uterine prolapse repair. Interventional Procedure Guidance IPG282.  National Institute for Health and Clinical Excellence, London [accessed September 2009]. Available from: URL: http:\/\/www.nice.org.uk\/nicemedia\/pdf\/IPG282guidance.pdf.   29 73. National Institute for Health and Clinical Excellence (2009). Infracoccygeal sacropexy using mesh for vaginal vault prolapse repair. Interventional Procedure Guidance IPG281.","cites":null},{"id":9058,"title":"National Institute for Health and Clinical Excellence (2009). Sacrocolpopexy using mesh for vaginal vault.","authors":[],"date":"2009","doi":null,"raw":"70. National Institute for Health and Clinical Excellence (2009). Sacrocolpopexy using mesh for vaginal vault. Interventional Procedure Guidance IPG283. National Institute for Health and Clinical Excellence, London [accessed September 2009]. Available from: URL: http:\/\/www.nice.org.uk\/nicemedia\/pdf\/IPG283Guidance.pdf.","cites":null},{"id":6017931,"title":"NR 13m Efficacy Oliver 2006[52] 14 73 (18) 7\/7 NR Vaginal Modified infracoccygeal sacropexy with uterine preservation","authors":[],"date":null,"doi":null,"raw":"NR  13m   Efficacy Oliver 2006[52]  14  73 (18)  7\/7  NR  Vaginal   Modified infracoccygeal sacropexy with uterine preservation  Polypropylene tape, IVS Tunneller  Anti-incontinence: NR Hysterectomy: 3\/7 Efficacy: 6w Safety: 5m (2-11) Safety 4 2","cites":null},{"id":9072,"title":"NR 43m (1m-17y) Efficacy Safety Timmons 1992[59] 163 58 (19-81) 163\/3 NR Abdominal (open) Sacrocolpopexy Fascial lata (NR trade name); polyethylene tetraphalate,","authors":[],"date":null,"doi":null,"raw":"NR  43m (1m-17y)  Efficacy Safety  Timmons 1992[59] 163  58 (19-81)  163\/3  NR  Abdominal (open)  Sacrocolpopexy   Fascial lata (NR trade name); polyethylene  tetraphalate, Mersilene (Amid type III) NR  33m (9m-18y)  Safety 4 0  Appendix 2   Sacrocolpoperineopexy: summary of patient characteristics and surgical procedures","cites":null},{"id":9056,"title":"Observational data collection of surgical outcomes in the treatment of vaginal prolapse with AMS products. ClincialTrials.gov Identifier NCT00388947.","authors":[],"date":"2006","doi":null,"raw":"68. Zylstra S (2006). Observational data collection of surgical outcomes in the treatment of vaginal prolapse with AMS products. ClincialTrials.gov Identifier NCT00388947.","cites":null},{"id":9013,"title":"Perioperative complications in abdominal sacrocolpopexy and vaginal sacrospinous ligament fixation procedures. Int Urogynecol J Pelvic Floor Dysfunct 18:257-261. 22 21. Govier","authors":[],"date":"2007","doi":"10.1007\/s00192-006-0134-6","raw":"20. Demirci F (2007). Perioperative complications in abdominal sacrocolpopexy and vaginal sacrospinous ligament fixation procedures. Int Urogynecol J Pelvic Floor Dysfunct 18:257-261.   22 21. Govier FE, Kobashi KC, Kozlowski PM, Kuznetsov DD, Begley SJ, McGonigle KF et al.","cites":null},{"id":9026,"title":"Pigne A","authors":[],"date":"2003","doi":"10.1067\/S0002-9378(03)00665-3","raw":"34. Barranger E, Fritel X, Pigne A (2003). Abdominal sacrohysteropexy in young women with uterovaginal prolapse: long-term follow-up. Am J Obstet Gynecol 18:1245-1250.","cites":null},{"id":9032,"title":"Posterior intravaginal slingplasty (infracoccygeal sacropexy) for severe posthysterectomy vaginal vault prolapse--a preliminary report on efficacy and safety.","authors":[],"date":"2002","doi":"10.1007\/s001920200001","raw":"41. Farnsworth BN (2002). Posterior intravaginal slingplasty (infracoccygeal sacropexy) for severe posthysterectomy vaginal vault prolapse--a preliminary report on efficacy and safety. Int Urogynecol J 13:4-8.","cites":null},{"id":9035,"title":"Posterior intravaginal slingplasty (infracoccygeal sacropexy) in the treatment of vaginal vault prolapse.","authors":[],"date":"2006","doi":"10.1016\/j.ijgo.2006.03.027","raw":"44. Ghanbari Z, Baratali BH, Mireshghi MS (2006). Posterior intravaginal slingplasty (infracoccygeal sacropexy) in the treatment of vaginal vault prolapse. Int J Gynaecol Obstet 94:147-148.","cites":null},{"id":9038,"title":"Posterior intravaginal slingplasty for vaginal prolapse.","authors":[],"date":"2006","doi":"10.1007\/s00192-005-0007-4","raw":"48. Jordaan DJ, Prollius A, Cronje HS, Nel M (2006). Posterior intravaginal slingplasty for vaginal prolapse. Int Urogynecol J 17:326-329.","cites":null},{"id":9007,"title":"Prospective randomised study to compare colposacropexy and Mayo McCall technique in the correction of severe genital central prolapse.","authors":[],"date":"2007","doi":null,"raw":"13. Braun H, Fernandez M, Delloro A, Gonzalez F, Cuevas R, Rojas I (2007). Prospective randomised study to compare colposacropexy and Mayo McCall technique in the correction of severe genital central prolapse. Int Urogynecol J 18:S12.   21 14. Meschia M, Barbacini P, Longatti D, Gattei U, Pifarotti P (2005). Randomized comparison between infracoccygeal sacropexy (posterior IVS) and sacrospinous ligament fixation in the management of vault prolpase. Int Urogynecol J 16:S54.","cites":null},{"id":9052,"title":"Randomized controlled trial comparing acellular collagen biomesh (Pelvisoft) to polypropylene mesh (Pelvitex) for sacral colpopexy.","authors":[],"date":"2005","doi":null,"raw":"64. Culligan P (2005). Randomized controlled trial comparing acellular collagen biomesh (Pelvisoft) to polypropylene mesh (Pelvitex) for sacral colpopexy. ClinicalTrials.gov Identifier NCT00564083.  ClinicalTrials.gov [accessed September 2009]. Available from: URL: http:\/\/clinicaltrials.gov\/ct2\/show\/NCT00564083?term=nct00564083&rank=1.","cites":null},{"id":9055,"title":"Randomized multicentric study to treat prolapse after hysterectomy with Amreich procedure or total Prolift procedure.","authors":[],"date":"2007","doi":null,"raw":"67. Halaska M (2007). Randomized multicentric study to treat prolapse after hysterectomy with Amreich procedure or total Prolift procedure. ClinicalTrials.gov Identifier   28 NCT00572702.  ClinicalTrials.gov [accessed September 2009]. Available from: URL: http:\/\/clinicaltrials.gov\/ct2\/show\/NCT00572702?term=nct00572702&rank=1.","cites":null},{"id":9041,"title":"Sacrocolpopexy--a report on 262 consecutive operations.","authors":[],"date":"2002","doi":null,"raw":"51. Lindeque BG, Nel WS (2002). Sacrocolpopexy--a report on 262 consecutive operations. S Afr Med J 92:982-985.","cites":null},{"id":9040,"title":"Sacrohysteropexy with synthetic mesh for the management of uterovaginal prolapse.","authors":[],"date":"2001","doi":"10.1111\/j.1471-0528.2001.00138.x","raw":"50. Leron E, Stanton SL (2001). Sacrohysteropexy with synthetic mesh for the management of uterovaginal prolapse. BJOG 108:629-633.","cites":null},{"id":9017,"title":"Sacrospinous vault suspension and abdominal colposacropexy: success rates and complications.","authors":[],"date":"1996","doi":"10.1053\/ob.1996.v175.a74410","raw":"24. Hardiman PJ, Drutz HP (1996). Sacrospinous vault suspension and abdominal colposacropexy: success rates and complications. Am J Obstet Gynecol 175:612-616.","cites":null},{"id":9030,"title":"Shortterm results and long-term patients' appraisal of abdominal colposacropexy for treatment of genital and vaginal vault prolapse.","authors":[],"date":"1995","doi":"10.1016\/0028-2243(94)02015-7","raw":"39. de Vries MJ, van Dessel TH, Drogendijk AC, de Haas I, Huikeshoven FJ (1995). Shortterm results and long-term patients' appraisal of abdominal colposacropexy for treatment of genital and vaginal vault prolapse. Eur J Obstet Gynecol Reprod Biol 59:35-38.","cites":null},{"id":8998,"title":"Surgical management of pelvic organ prolapse in women. Cochrane Database of Systematic Reviews Issue 3.","authors":[],"date":"2007","doi":"10.1002\/nau.20542","raw":"3. Maher C, Baessler K, Glazener CM, Adams EJ, Hagen S (2007). Surgical management of pelvic organ prolapse in women. Cochrane Database of Systematic Reviews Issue 3. Art.","cites":null},{"id":9015,"title":"Surgical outcome of abdominal sacrocolpopexy with synthetic mesh versus abdominal sacrocolpopexy with cadaveric fascia lata.","authors":[],"date":"2005","doi":"10.1007\/s00192-004-1257-2","raw":"22. Gregory WT, Otto LN, Bergstrom JO, Clark AL (2005). Surgical outcome of abdominal sacrocolpopexy with synthetic mesh versus abdominal sacrocolpopexy with cadaveric fascia lata. Int Urogynecol J 16:369-374.","cites":null},{"id":9025,"title":"Synthetic sling for genital prolapse in young women.","authors":[],"date":"1997","doi":"10.1016\/S0020-7292(97)02847-6","raw":"33. Banu LF (1997). Synthetic sling for genital prolapse in young women. Int J Gynecol Obstet 57:57-64.","cites":null},{"id":9000,"title":"Systematic reviews: CRD's guidance for undertaking systematic reviews in health care (2009). Centre for Reviews and Dissemination,","authors":[],"date":"2009","doi":"10.1016\/S1473-3099(10)70065-7","raw":"5. Systematic reviews: CRD's guidance for undertaking systematic reviews in health care (2009). Centre for Reviews and Dissemination, University of York [accessed September 2009]. Available from: URL: http:\/\/www.york.ac.uk\/inst\/crd\/SysRev\/!SSL!\/WebHelp\/SysRev3.htm.","cites":null},{"id":6017904,"title":"Table 2 Median and ranges of mesh erosion rates for sacrocolpopexy a,b No. study n\/N (%) Median (range) Non-absorbable synthetic mesh","authors":[],"date":null,"doi":null,"raw":"Table 2   Median and ranges of mesh erosion rates for sacrocolpopexy a,b No. study  n\/N (%)  Median (range) Non-absorbable synthetic mesh Uterine  3  19\/280 (6.8%)  6.9% (4.0-8.7) Vault  7  42\/806 (5.2%)  4.7% (0-8.9) Uterine and\/or vault  11  26\/783 (3.3%)  5.0% (0-12.0) Total   21  87\/1869 (4.7%)  4.0% (0-12) Absorbable synthetic mesh (no study reported data on this) Absorbable biological graft Uterine  0 Vault  1  0\/46 (0%)  0% Uterine and\/or vault  4  1\/183 (0.5%)  0% (0-0.8%) Total   5  1\/229 (0.4%)  0% (0-0.8) Combined (contain both non-absorbable and absorbable material) Uterine  1  1\/23 (4.3%)  4.3% Vault  0 Uterine and\/or vault  0 Total   1  1\/23 (4.3%)  4.3%  aFour studies reported two different types of mesh separately.  bFive studies (5\/27, 18.5 %) that reported data on mesh erosion were not included in this table because they either did not report type of mesh used or used a mixture of different types but not reported them separately. 3 3  Table 3   Median and ranges of event rates for primary efficacy and safety outcomes for sacrocolpoperineopexy Sacrocolpoperineopexy (not reported separately by uterine and vault) No. study  n\/N, %  Median (range) Patient reported persistent prolapse symptoms RCT  0 RCT (abstract)  0 Non-randomised comparative studies  0 Case series  1  2\/169 (1.2%)  1.2% Total  Median 1.2%, based on 1 study (169 women) Clinician reported recurrent prolapse at original site RCT  0 RCT (abstract)  0 Non-randomised comparative studies  0 Case series  1  1\/169 (0.6%)  0.6% Total  Median 0.6%, based on 1 study (169 women) Mesh erosion RCT  0 RCT (abstract)  0 Non-randomised comparative studies  1  10\/118 (8.5%)  8.5% Case series  1  14\/169 (8.3%)  8.3% Total  Median 8.4% (range 8.3-8.5), based on 2 studies (287 women)  3 4  Table 4   Median and ranges of event rates for primary efficacy and safety outcomes for infracoccygeal sacropexy Uterine  Vault  Uterine and\/or vault No. study  n\/N, %  Median (range)  No. study  n\/N, %  Median (range)  No. study  n\/N, %  Median (range) Patient reported persistent prolapse symptoms RCT  0      0      0 RCT (abs.)  0      0      0 Non-rand  0      0      0 Case series  0      1  8\/91 (8.8%)  8.8%  2  28\/171 (16%)  12% (2.3-21) Total  Median 8.8% (range 2-21), based on 3 studies (262 women) Clinician reported recurrent prolapse at original site RCT  0      0      0 RCT (abs.)  0      0      1  1\/21 (4.8%)  4.8% Non-rand  1 a  1\/79 (1.3%)  1.3%  0      0 Case series  1  1\/10 (10%)  10%  2  4\/60 (6.7%)  5.0% (0-10)  4  17\/232 (7.3%)  6.5% (0-25) Total  Median 4.8% (range 0-25), based on 9 studies (402 women) Mesh erosion RCT  0      0      0 RCT (abs.)  0      1  2\/30 (6.7%)  6.7%  1  0\/21 (0%)  0% Non-rand  1 a  10\/79 (13%)  13%  0      0 Case series  0      4  22\/235 (9.4%)  6.6% (5.3-21%)  4  33\/524 (6.3%)  5.6% (1.5-17) Total  Median 6.7% (range 0-21), based on 11 studies (889 women)  a Results from the two arms of one study were combined 3 5  Table 5   Median and ranges of event rates for primary efficacy and safety outcomes for uterine suspension sling Uterine suspension sling (for uterine prolapsed only) No. study  n\/N, %  Median (range) Patient reported persistent prolapse symptoms RCT  1  16\/41 (39%)  39% RCT (abstract)  0 Non-randomised comparative studies  0 Case series  2  1\/50 (2.0%)  1.6% (0-3.3) Total  Median 3.3% (range 0-39), based on 3 studies (91 women) Clinician reported recurrent prolapse at original site RCT  1  2\/38 (5.3%)  5.3% RCT (abstract)  0 Non-randomised comparative studies  1  0\/36 (0%)  0% Case series  3  2\/62 (3.2%)  3.3% (0-7.7) Total  Median 3.3% (range 0-7.7), based on 5 studies (136 women) Mesh erosion RCT  0 RCT (abstract)  0 Non-randomised comparative studies  1  0\/36 (0%)  0 Case series  1  1\/30 (3.3%)  3.3% Total  Median 1.7% (range 0-3.3), based on 2 studies (66 women)  3 6  Appendix 1   Sacrocolpopexy: summary of patient characteristics and surgical procedures","cites":null},{"id":9001,"title":"The feasibility of creating a checklist for the assessment of the methodological quality both of randomised and non-randomised studies of health care interventions.","authors":[],"date":"1998","doi":"10.1136\/jech.52.6.377","raw":"6. Downs SH, Black N. (1998). The feasibility of creating a checklist for the assessment of the methodological quality both of randomised and non-randomised studies of health care interventions. J Epidemiol Community Health 52:377-384.   20 7. Verhagen AP, de Vet HC, de Bie RA, Kessels AG, Boers M, Bouter LM et al (1998). The Delphi list: a criteria list for quality assessment of randomized clinical trials for conducting systematic reviews developed by Delphi consensus. J Clin Epidemiol 51:1235-1241.","cites":null},{"id":9044,"title":"Tissue Fixation System posterior sling for repair of uterine\/vault prolapse -- a preliminary report.","authors":[],"date":"2005","doi":"10.1111\/j.1479-828X.2005.00449.x","raw":"54. Petros PE, Richardson PA (2005). Tissue Fixation System posterior sling for repair of uterine\/vault prolapse -- a preliminary report. Aust N Z J Obstet Gynaecol 45:376-379.   26 55. Sentilhes L, Sergent F, Resch B, Verspyck E, Descamps P, Marpeau L (2007). Midterm Follow-up of High-Grade Genital Prolapse Repair by the Trans-obturator and Infracoccygeal Hammock Procedure after Hysterectomy. Eur Urol 51:1065-1072.","cites":null},{"id":9033,"title":"Total abdominal hysterectomy at abdominal sacrovaginopexy - a comparative-study.","authors":[],"date":"1993","doi":"10.1016\/0020-7292(94)90336-0","raw":"42. Fedorkow DM, Kalbfleisch RE (1993). Total abdominal hysterectomy at abdominal sacrovaginopexy - a comparative-study. Am J Obstet Gynecol 169:641-643.","cites":null},{"id":9054,"title":"Treatment of stress and mixed urinary incontinence and vaginal vault prolapse.","authors":[],"date":"2005","doi":null,"raw":"66. Gannon NA (2005). Treatment of stress and mixed urinary incontinence and vaginal vault prolapse. ClinicalTrials.gov Identifier NCT00223106.  ClinicalTrials.gov [September 2009]. Available from: URL: http:\/\/clinicaltrials.gov\/ct2\/show\/NCT00223106?term=nct00223106&rank=1.","cites":null},{"id":9012,"title":"Uterus preservation in surgical correction of urogenital prolapse.","authors":[],"date":"2005","doi":"10.1016\/j.eururo.2005.04.022","raw":"19. Costantini E, Mearini L, Bini V, Zucchi A, Mearini E, Porena M (2005). Uterus preservation in surgical correction of urogenital prolapse. Eur Urol 48:642-649.","cites":null},{"id":9023,"title":"Vaginal mesh erosion after abdominal sacral colpopexy.","authors":[],"date":"2001","doi":"10.1097\/00006254-200107000-00012","raw":"31. Visco AG, Weidner AC, Barber MD, Myers ER, Cundiff GW, Bump RC et al (2001). Vaginal mesh erosion after abdominal sacral colpopexy. Am J Obstet Gynecol 184:297-302.","cites":null},{"id":9019,"title":"Vaginal sacrospinous colpopexy and laparoscopic sacral colpopexy for vaginal vault prolapse.","authors":[],"date":"2007","doi":"10.1080\/00016340701332811","raw":"26. Marcickiewicz J, Kjollesdal M, Engh ME, Eklind S, Axen C, Brannstrom M et al (2007). Vaginal sacrospinous colpopexy and laparoscopic sacral colpopexy for vaginal vault prolapse. Acta Obstet Gynecol Scand 86:733-738.","cites":null},{"id":9002,"title":"Vaginal versus abdominal reconstructive surgery for the treatment of pelvic support defects: a prospective randomized study with long-term outcome evaluation.","authors":[],"date":"1996","doi":"10.1016\/S0002-9378(96)70084-4","raw":"8. Benson JT, Lucente V, McClellan E (1996). Vaginal versus abdominal reconstructive surgery for the treatment of pelvic support defects: a prospective randomized study with long-term outcome evaluation. Am J Obstet Gynecol 175:1418-1421.","cites":null},{"id":9043,"title":"Vault prolapse II: Restoration of dynamic vaginal supports by infracoccygeal sacropexy, an axial day-case vaginal procedure.","authors":[],"date":"2001","doi":"10.1007\/PL00004039","raw":"53. Papa Petros PE (2001). Vault prolapse II: Restoration of dynamic vaginal supports by infracoccygeal sacropexy, an axial day-case vaginal procedure. Int Urogynecol J Pelvic Floor Dysfunct 12:296-303.","cites":null},{"id":9073,"title":"y Uterine\/ vault Primary\/ secondary Intervention route Technique Mesh\/graft Concomitant procedure Follow up (mean) Outcomes Non-randomised comparative studies Visco","authors":[],"date":"2001","doi":null,"raw":"ID  N  Age, y  Uterine\/ vault Primary\/ secondary Intervention route  Technique   Mesh\/graft  Concomitant procedure  Follow up (mean)  Outcomes Non-randomised comparative studies Visco 2001 [31] A, 155 B, 88 C, 25 D, 5 A+B+C+D, 61 (31-84) NR  NR  A, abdominal B, abdominal C, vaginal+ abdominal D, vaginal+ abdominal A, sacrocolpopexy B, sacrocolpoperineopexy C, sacrocolpoperineopexy D, sacrocolpoperineopexy with mesh placed to vaginal field  A, polyethylene tetraphalate, Mersilene (Amid type III) or Gore-Tex (Amid type II) B, C, D, same as above Anti-incontinence: NR Hysterectomy: A+B+C+D: 45\/273 A, 7m (1-87) B, 5m (1-45) C, 6m (1-28) D, 7m (2-11) Safety Case series Su 2007[40,58] 169  62 (10)  5\/164  NR  Abdominal + vaginal  Sacrocolpoperineopexy   Porcine dermis, Pelvicol; cadaveric fascia, Tutoplast; polypropylene, Gynemesh, Prolite, or Prolene (all Amid type I) Anti-incontinence: 155\/169 Hysterectomy: 11\/169 14m (1.5-24)  Efficacy Safety  NR: not reported 4 1","cites":null},{"id":428479,"title":"y Uterine\/ vault Primary\/ secondary Intervention route Technique Mesh\/graft Concomitant procedure Follow up (mean) Outcomes RCT Roovers 2004[12]","authors":[],"date":null,"doi":null,"raw":"ID  N  Age, y  Uterine\/ vault Primary\/ secondary Intervention route  Technique   Mesh\/graft  Concomitant procedure  Follow up (mean)  Outcomes RCT Roovers 2004[12] A, 41 B, 41 A, 58 (9) B, 56 (11) A, 41\/0 B, 41\/0 NR  A, abdominal B, vaginal A, sacrohysteropexy B, hysterectomy + anterior and\/or posterior colporrhaphy A, polypropylene, Gore-Tex (Amid type II) B, no mesh Anti-incontinence: A, 16\/41; B,11\/41 Hysterectomy: A, 2\/41 (B was performed); B, 41\/41 1y  Efficacy Safety  Non-randomised comparative studies Costantini 2005[19] A, 36 B, 39 A, 61 (12) B, 62 (8) A, 36\/0 B, 39\/0 NR  A, abdominal B, abdominal A, sacrohysteropexy B, hysterectomy + sacropexy A, polypropylene, Marlex (Amid type I) B, same as A Anti-incontinence: A, 28\/36; B, 30\/39 Hysterectomy: A, 0\/36; B, 39\/39 51m (12-115)  Efficacy Safety Case series (n <100) Banu 1997[33]  19  17-27  19\/0  NR  Abdominal (open)  Sacrohysteropexy   Polyester, Mersilene (Amid type III) Hysterectomy: 0\/19  3-5y  Efficacy Safety  Barranger 2003[34] 30  35.7 (29-43)  30\/0  29\/1  Abdominal (open)  Sacrohysteropexy   Polyester, Mersuture  Anti-incontinence: 30\/30 Hysterectomy: 0\/30 Efficacy: 44.5m (2-156); Safety: 94.6m (8-160)  Efficacy Safety Leron 2001[50]  13  39 (27-60)  13\/0  NR  Abdominal (open)  Sacrohysteropexy   Non-absorbable synthetic mesh, Teflon Anti-incontinence: 4\/13 Hysterectomy: 0\/13","cites":null},{"id":6017919,"title":"y Uterine\/ vault Primary\/ secondary Intervention route Technique Mesh\/graft, trade name Concomitant procedure Follow up,","authors":[],"date":null,"doi":null,"raw":"ID  N  Age, y  Uterine\/ vault Primary\/ secondary Intervention route  Technique   Mesh\/graft, trade name  Concomitant procedure Follow up, mean  Outcomes  Brizzolara 2003[37] 124  65 (9)  60\/64  NR  Abdominal   Sacrocolpopexy    Polypropylene, Prolene, or allograft (NR trade name) Anti-incontinence: 92\/124 Hysterectomy: NR","cites":null},{"id":6017910,"title":"y Uterine\/ vault Primary\/ secondary Intervention route Technique Mesh\/graft, trade name Concomitant procedure Follow up, mean Outcomes Case series Fedorkow","authors":[],"date":null,"doi":null,"raw":"ID  N  Age, y  Uterine\/ vault Primary\/ secondary Intervention route  Technique   Mesh\/graft, trade name  Concomitant procedure Follow up, mean  Outcomes Case series Fedorkow 1993[42]  149  58 (11)  0\/149  NR  Abdominal   Sacrocolpopexy","cites":null},{"id":6017916,"title":"y Uterine\/ vault Primary\/ secondary Intervention route Technique Mesh\/graft, trade name Concomitant procedure Follow up, mean Outcomes Gregory 2005[22]","authors":[],"date":null,"doi":null,"raw":"ID  N  Age, y  Uterine\/ vault Primary\/ secondary Intervention route  Technique   Mesh\/graft, trade name  Concomitant procedure Follow up, mean  Outcomes  Gregory 2005[22] A, 49 B, 33 NR   NR  NR  A, abdominal (open) B, abdominal (open) A, sacrocolpopexy B, sacrocolpopexy A, polypropylene, Marlex (Amid type I); polyethylene tetraphalate, Mersilene (Amid type II) B, fascia lata, Community Tissue Services","cites":null},{"id":9064,"title":"y Uterine\/ vault Primary\/ secondary Intervention route Technique Mesh\/graft, trade name Concomitant procedure Follow up, mean Outcomes UTERINE RCT (abs.)","authors":[],"date":null,"doi":null,"raw":"ID  N  Age, y  Uterine\/ vault Primary\/ secondary Intervention route  Technique   Mesh\/graft, trade name  Concomitant procedure Follow up, mean  Outcomes UTERINE RCT (abs.) Braun 2007[13]  A, 23 B, 24 A, 57 B, 56 A, 23\/0 B, 24\/0 NR  A, abdominal B, vaginal A, hysterectomy + sacrocolpopexy; B, hysterectomy + anteroposterior colporrhaphy + Mayo McCall stitch A, combined mesh, polyglactin and prolene 1 :1, Vypro B, no mesh NR  33m (20-41)  Efficacy Safety Non-randomised comparative studies Costantini 2005[19] A, 36 B, 39 A, 61 (12) B, 62 (8) A, 36\/0 B, 39\/0 NR  A, abdominal B, abdominal A, sacrohysteropexy B, hysterectomy + sacrocolpopexy A, polypropylene, Marlex (Amid type I) B, same as A Anti-incontinence: A, 28\/36; B, 30\/39 Hysterectomy: A, 0\/36; B, 39\/39","cites":null}],"documentType":{"type":1}},"contributors":["University of Aberdeen, Medicine, Medical Sciences & Nutrition, Institute of Applied Health Sciences","University of Aberdeen, Medicine, Medical Sciences & Nutrition, Other Applied Health Sciences","University of Aberdeen, Medicine, Medical Sciences & Nutrition, HSRU"],"datePublished":"01-11-20","abstract":"The original publication is available at www.springerlink.comPeer reviewedPostprin","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:aura.abdn.ac.uk:2164\/2070<\/identifier><datestamp>\n                2018-01-02T00:03:07Z<\/datestamp><setSpec>\n                com_2164_632<\/setSpec><setSpec>\n                com_2164_364<\/setSpec><setSpec>\n                com_2164_330<\/setSpec><setSpec>\n                com_2164_705<\/setSpec><setSpec>\n                col_2164_633<\/setSpec><setSpec>\n                col_2164_706<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nSystematic review of the efficacy and safety of using mesh in surgery for uterine or vaginal vault prolapse<\/dc:title><dc:creator>\nJia, Xueli<\/dc:creator><dc:creator>\nGlazener, Cathryn M A<\/dc:creator><dc:creator>\nMowatt, Graham<\/dc:creator><dc:creator>\nJenkinson, David<\/dc:creator><dc:creator>\nFraser, Cynthia<\/dc:creator><dc:creator>\nBain, Christine<\/dc:creator><dc:creator>\nBurr, Jennifer<\/dc:creator><dc:contributor>\nUniversity of Aberdeen, Medicine, Medical Sciences & Nutrition, Institute of Applied Health Sciences<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Medicine, Medical Sciences & Nutrition, Other Applied Health Sciences<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Medicine, Medical Sciences & Nutrition, HSRU<\/dc:contributor><dc:subject>\nefficacy<\/dc:subject><dc:subject>\nmesh<\/dc:subject><dc:subject>\nmesh erosion<\/dc:subject><dc:subject>\nNICE<\/dc:subject><dc:subject>\npelvic organ prolapsed<\/dc:subject><dc:subject>\nsafety<\/dc:subject><dc:subject>\nsystematic review<\/dc:subject><dc:subject>\nRG Gynecology and obstetrics<\/dc:subject><dc:subject>\nRG<\/dc:subject><dc:description>\nThe original publication is available at www.springerlink.com<\/dc:description><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPostprint<\/dc:description><dc:date>\n2011-06-14T23:01:01Z<\/dc:date><dc:date>\n2011-06-14T23:01:01Z<\/dc:date><dc:date>\n2010-11-01<\/dc:date><dc:date>\n01-11-20<\/dc:date><dc:type>\nJournal article<\/dc:type><dc:identifier>\nJia , X , Glazener , C M A , Mowatt , G , Jenkinson , D , Fraser , C , Bain , C & Burr , J 2010 , ' Systematic review of the efficacy and safety of using mesh in surgery for uterine or vaginal vault prolapse ' International Urogynecology Journal , vol 21 , no. 11 , pp. 1413-1431 . DOI: 10.1007\/s00192-010-1156-7<\/dc:identifier><dc:identifier>\n0937-3462<\/dc:identifier><dc:identifier>\nPURE: 1174345<\/dc:identifier><dc:identifier>\nPURE UUID: e1030a18-acab-4311-9894-df64b3607956<\/dc:identifier><dc:identifier>\nScopus: 78650093295<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2164\/2070<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.1007\/s00192-010-1156-7<\/dc:identifier><dc:language>\neng<\/dc:language><dc:relation>\nInternational Urogynecology Journal<\/dc:relation><dc:format>\n19<\/dc:format>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0937-3462","0937-3462"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["International Urogynecology Journal"],"year":1,"topics":["efficacy","mesh","mesh erosion","NICE","pelvic organ prolapsed","safety","systematic review","RG Gynecology and obstetrics","RG"],"subject":["Journal article"],"fullText":" 1 \n \nThis is the author version of an article originally published in the International \nUrogynecology Journal and Pelvic Floor Dysfunction 2010;21(11):1413-1421 \nhttp:\/\/www.springerlink.com\/content\/d10316t026637340\/  \n \nSystematic review of the efficacy and safety of using mesh in surgery for uterine or \nvaginal vault prolapse  \n \nXueli Jiaa, Cathryn Glazenera, Graham Mowatta, David Jenkinsona, Cynthia Frasera, Christine \nBainb, Jennifer Burra \n \naHealth Services Research Unit, University of Aberdeen, Aberdeen, UK  \nbAberdeen Royal Infirmary, NHS Grampian, Aberdeen, UK  \n \nCorrespondence: Xueli Jia, Health Services Research Unit, University of Aberdeen, \nAberdeen, AB25 2ZD, UK. Email x.jia@abdn.ac.uk  \n \n \nDisclosure of Interests \nThere is no conflict of interest. \n \n 2 \nAbstract \nIntroduction The aim of this study is to estimate efficacy and safety of mesh in surgery for \nuterine or vault prolapse. \nMethods Seventeen electronic databases were searched for relevant studies that \npublished from 1980 onwards.   \nResults Fifty-four studies involving 7054 women were included.  For sacrocolpopexy \n(average follow up 23 months), the risk of clinical recurrence ranged from 0% to 6%, \npersistent symptoms ranged from 3% to 31%, and mesh erosion from 0% to 12%.  For \ninfracoccygeal sacropexy (average follow up 13 months), the risk of clinical recurrence \nranged from 0% to 25%, persistent symptoms from 2% to 21%, and mesh erosion 0% to 21%. \nLimited evidence was available for sacrocolpoperineopexy and uterine suspension sling to \ndraw reliable estimates.  \nConclusion Sacrocolpopexy was associated with a low risk of recurrence but with a \nrelatively high risk of mesh erosion. Ranges of estimates for outcomes for other mesh \ntechniques were wide.  \n(Word limit set by journal: 150) \n \nKeywords efficacy, mesh, mesh erosion, NICE, pelvic organ prolapsed, safety, systematic \nreview  \n \nBrief summary  Sacrocolpopexy was associated with a low risk of recurrence but a \nhigher risk of mesh erosion. Ranges of estimates for other mesh techniques were wide.  \n(Word limit set by journal: 25) \n 3 \nIntroduction \nProlapse of the uterus or vaginal vault (middle compartment) affects a woman’s health by its \nlocal physical effects (pressure, bulging, heaviness or discomfort) or its effect on urinary, \nbowel or sexual function. Current treatment options for uterine or vault prolapse include \npelvic floor muscle training,[1] use of pessaries (mechanical devices such as rings or \nshelves)[2] and surgery.[3]  \nProlapse surgery not involving mesh includes hysterectomy, cervical amputation, and \nuterine\/vault attachment with sutures to the pelvic ligaments.  Surgical techniques using mesh \ninclude sacrocolpopexy, sacrocolpoperineopexy, infracoccygeal sacropexy (also known as \nPosterior IntraVaginal Slingplasty, IVS), and uterine suspension sling.   \nIn sacrocolpopexy, the vaginal vault is attached with a mesh bridge to the periosteum \nof the sacral promontory.  If this is carried out at the same time as hysterectomy, the aim of \nthe sacrocolpopexy is prophylaxis to prevent future vault prolapse.  Sacrocolpoperineopexy is \na variation of sacrocolpopexy where extra mesh is inserted between the posterior vaginal wall \nand the rectum down to the perineum.  Use of sacrocolpoperineopexy is contentious because \nthe relatively large amount of mesh may increase risks of mesh erosion. In infracoccygeal \nsacropexy, the uterus or vault is suspended using a mesh tape with the aid of a trochar \n(tunnelling device) through each of the ischiorectal fossae.  The uterine suspension sling \ntechnique can only be used in women who wish to conserve their uterus, i.e. for uterine \nprolapse repair. In this procedure, the uterus is attached with mesh to pelvic ligaments or to \nthe periosteum of the sacral promontory.   \nBoth the efficacy and safety of mesh in surgery for uterine or vault prolapse are \nuncertain.  This report presents the estimated efficacy and safety of mesh in surgery for \nuterine or vault prolapse. It is based on a review that was commissioned through the UK \n 4 \nNational Institute for Health and Clinical Excellence (NICE) Interventional Procedures \nProgramme.   An electronic version of the full report is available from the NICE website.[4] \n \nMethods \nSearch strategy \nWe searched electronic databases, conference proceedings and relevant websites, contacted \n11 manufacturers, and scrutinised bibliographies of retrieved papers to identify reports of \npublished and ongoing studies on the efficacy and safety of mesh in surgery for uterine or \nvault prolapse repair.  Searches, designed to be highly sensitive and using both controlled \nvocabulary and free-text terms, were restricted to publications from 1980 onwards, to those \npublished in the English language and, for conference proceedings, to randomised controlled \ntrials published from 2005 onwards. Studies that reported only procedures without mesh were \nnot identified separately.  Full details of the search strategies used are reproduced in the \noriginal report[4] or are available from the authors.   \nThe databases searched were: Medline (1980 – Nov Wk 2 2007), Medline In-Process \n(4th Jan 2008), EMBASE (1980 – 2008 Wk 1), Biosis (1985 – 3rd Jan 2008), Science Citation \nIndex (1980 – 5th Jan 2008), Cochrane Controlled Trials Register (The Cochrane Library, \nIssue 4 2007), and ISI Conference Proceedings (1990 – 11th Feb 2008) as well as current \nresearch registers (National Research Register (Issue 2, 2007), Current Controlled Trials (Jan \n2008) and Clinical Trials (Jan 2008).  Additional databases searched for systematic reviews \nand other background information included the Cochrane Database of Systematic Reviews \n(The Cochrane Library, Issue 4, 2007), Database of Abstracts of Reviews of Effectiveness \n(Jan 2008) and the HTA Database (Jan 2008). Conference proceedings of major \nurogynaecological organisations (American Urogynecologic Society (2005-6), American \nUrological Association (2005-7), European Association of Urology (2005-7), European \n 5 \nSociety of Gynecological Endoscopy (2005-6), International Continence Society (2005-7)  \nand International Urogynecological Association (2005-7) were scrutinised. \n \nInclusion and exclusion criteria \nOne reviewer screened titles\/abstracts.  Any uncertainties were discussed with a second \nreviewer and consensus was reached.  Full text copies of all reports deemed to be potentially \nrelevant were obtained and assessed by the main reviewer for inclusion. \n Full-text RCTs, RCTs published as conference abstracts from 2005 onwards, non-\nrandomised comparative studies, and case series using mesh were sought.  As the volume of \nliterature for sacrocolpopexy was substantial, only case series with a sample size of at least \n100 women were included.  There was no sample size restriction placed on case series that \nreported other mesh techniques because the volume of literature for these techniques was \nvery limited.   \nCase series with a mean follow up of at least one year were included for both efficacy \nand safety.  Case series with a mean follow up of less than one year were included for safety \noutcomes only.  We considered one year to be a minimum adequate period of time in which to \nassess the efficacy of prolapse repair.   \nThe participants were women undergoing uterine or vault prolapse surgery.  Studies \nof women with cancer or with prolapse caused by congenital anomalies, inherited conditions, \nor creation of a neovagina were excluded.  Studies with women undergoing other \nconcomitant operations, such as anterior or posterior vaginal wall prolapse repair or anti-\nincontinence procedures were included providing the main indication for surgery was uterine \nor vault prolapse.   \nWe considered all surgical techniques for uterine or vault prolapse repair which \ninvolved the use of mesh.  There were no restrictions on the type of mesh used.  For RCTs \n 6 \nand non-randomised comparative studies, the comparators were any other surgical techniques \nwith or without mesh.   \nThe primary outcomes for efficacy were patient-reported persistent prolapse \nsymptoms and clinician-reported recurrence of prolapse at the original site measured with a \nvalidated quantitative tool, e.g. the Pelvic Organ Prolapse-Quantification (POP-Q) system or \nBaden-Walker system.  Secondary outcomes for efficacy included:  new (de novo) prolapse \nat other sites that were free of prolapse before surgery; the need for repeat surgery for \nprolapse (both recurrent at the same site and de novo); persistent urinary symptoms; \npersistent bowel symptoms; and persistent sexual symptoms. For urinary, bowel, and sexual \nsymptoms, only women who reported these symptoms at baseline were counted.  If possible, \nonly women who were sexually active were considered for sexual function outcomes.   \nThe primary outcome for safety was mesh erosion. Secondary outcomes included: \nblood loss; damage to surrounding organs during the operation; an operation for mesh erosion \nor removal; new urinary, bowel or sexual symptoms; and infection. For new urinary, bowel \nor sexual symptoms, only women who were free of these symptoms at baseline were \nconsidered for these outcomes.   \nWe also considered other serious and minor adverse effects not otherwise specified, \noperation time, and hospital stay.  Details on these outcomes are provided in the full report.[4]  \n \nData extraction and quality assessment \nData extraction and methodological quality assessment of the RCTs were conducted by two \nreviewers (XJ, CG) independently. The main reviewer (XJ) extracted data and assessed the \nquality of the remaining studies (due to resource constraints imposed by the review timelines).  \nTwo separate quality assessment checklists were used according to study design.  Both \nchecklists were developed by the Review Body for Interventional Procedures (ReBIP; Health \n 7 \nServices Research Units at the Universities of Aberdeen and Sheffield), an independent \nreview body that carries out systematic reviews for NICE’s Interventional Procedures \nProgramme. The checklists were adapted from several sources.[5-7] \n \nData analysis \nFour techniques that use mesh were identified: sacrocolpopexy, sacrocolpoperineopexy, \ninfracoccygeal sacropexy, and uterine suspension sling. Data analyses were conducted \nseparately for each of the technique, and for each technique, data were presented separately \nfor three subgroups of women according to the type of prolapse being repaired:  uterine \nprolapse; vault prolapse; and uterine and\/or vault prolapse (where the data were not reported \nseparately).   \nMeta-analyses were conducted of full-text RCTs, RCTs available as conference \nabstracts, and non-randomised comparative studies (using Cochrane Collaboration Review \nManager, RevMan 4.3 software).  These allowed the efficacy and safety of procedures using \nmesh versus procedures without mesh, and between different techniques that used mesh, to be \ncompared directly.  All tests of significance were performed at the 5% level.  For each \noutcome, the median and the range of the event rates were calculated by study design (RCTs, \nnon-randomised comparative studies, case series\/registries).  This required each arm of an \nRCT or comparative study to be considered as a separate case series.   \n Pre-specified subgroup analyses were planned for different surgical approaches \n(vaginal; open abdominal; and laparoscopic), different mesh types (non-absorbable synthetic \nmesh; absorbable synthetic mesh; biological absorbable graft; and combined mesh containing \nboth absorbable and non-absorbable material) and for women having primary versus \nsecondary repairs.   \n \n 8 \nResults \nNumber and type and quality of included studies \nFrom the initial 853 publications identified by the search strategy, 54 studies (reported in 60 \npublications) were included, of which 5 were full-text RCTs,[8-12] 3 were RCTs available as \nconference abstracts,[13-15] 17 were non-randomised comparative studies,[16-32] and 29 \nwere case series.[33-61] Seven manufacturers provided relevant studies, all of which had \nalready been identified by our searches. The screening process is summarised in Figure 1.  \nAppendix 1 to 4 show details of study design, methods, participants, and interventions for \nsacrocolpopexy, sacrocolpoperineopexy, infracoccygeal sacropexy, and uterine suspension \nsling. Two studies involving 238 women reported a mixture of above techniques but did not \nreport them separately.[20,40] Details and results of these two studies are available in the full \nreport.[4] Seven ongoing RCTs[62-67] (personal communication: A Griffiths, Johnson & \nJohnson, 2007), one ongoing registry,[68] and one ongoing case series[66]  were also \nidentified.   \nThe included studies took place during the period 1991 – 2007 in 16 countries.  \nOverall, 7054 women were treated in total, of whom 4456 were treated with sacrocolpopexy, \n282 with sacrocolpoperineopexy, 976 with infracoccygeal sacropexy, 159 with uterine \nsuspension sling, 238 a mixture of the above mesh techniques, and 943 with no-mesh \ntechniques.   \nAcross studies, the average age of the women was 61 years.  Women who were treated \nwith uterine suspension sling (a technique allows uterus to be preserved for future pregnancy) \nwere younger (average age 37 years) than those treated with other techniques (average age \naround 65 years).  Only six studies provided information on whether the procedures were \nprimary or secondary, of which two presented data on primary surgery alone.   \n 9 \nWe assessed the methodological quality of the full-text studies only because the \nabstracts only provided limited information about quality.  The study quality of RCTs, non-\nrandomised comparative studies, and case series is summarised in Figure  S1, S2 and S3 \nrespectively (supplementary data). \n \nSacrocolpopexy \nThirty-two studies (4 full-text RCTs,[8-11] 1 RCT available as conference abstract,[13] 15 \nnon-randomised comparative studies,[16-19,21-26,28-32] and 12 case series with sample \nsizes over 100) involving a total of 4456 women provided data on sacrocolpopexy.  Two \nstudies[13,19] reported on uterine prolapse (hysterectomy followed by sacrocolpopexy in the \nsame procedure), seven studies reported vault prolapse (sacrocolpopexy \nalone),[9,11,21,26,29,42,47] two studies reported uterine and vault prolapse separately,[23,61] \nand 21 studies[8,10,16-18,22,24,25,28,30-32,35-39,46,51,57,59] reported data from women \nhaving uterine and\/or vault prolapse together (Appendix 1).  Mesh types varied across studies.  \nThe median (range) of mean follow up across these 32 studies was 23 months (8 to 66 \nmonths).  Table 1 shows, for each type of study, the medians and ranges of event rates across \nstudies for primary outcomes for sacrocolpopexy. \n \nEfficacy \nOne small RCT involving 89 women with vault prolapse compared sacrocolpopexy (mesh) \nwith sacrospinous colpopexy (no mesh): differences in risk of persistent symptom (RR 0.70, \n95% CI 0.17 to 2.95) and risk of prolapse recurrence (RR 0.23, 95% CI 0.05 to 1.04) were \nnot statistically significant.[11]   \nThe risks of recurrence across all study designs ranged from 0% to 6% in 14 studies \ninvolving 1054 women (median 1.2%, Table 1), while the risks for persistent prolapse \n 10 \nsymptoms ranged from 3% to 31% in 9 studies involving 638 women (median 22%).  In 4 \nstudies involving 451 women, risks of needing a further operation for recurrent or de novo \nprolapse ranged from 0% to 14% (median 8%).  Estimates for other outcomes were based on \nsingle studies only.   \n \nSafety \nThe risk of mesh erosion ranged from 0% to 12% (median 5.4%, 27 studies, n=2922, Table \n1). Zero to 11% of women required an operation for mesh erosion (median 3.8%, 17 studies, \nn=2074).  In studies reporting mesh erosion, most studies used non-absorbable synthetic \nmesh (Table 2). The median mesh erosion rates across studies were 4.0% (range 0% to 12.0%, \n21 studies, n=1869) for non-absorbable synthetic mesh compared with 0% (range 0% to 0.8%, \n5 studies, n=229) for absorbable biological graft. No studies reported mesh erosion data for \nabsorbable synthetic mesh and only one study reported mesh erosion for combined mesh \n(4.3%, 1\/23). \nFor other safety outcomes, the proportion of women who required a blood transfusion \nfor sacrocolpopexy ranged from 0% to 17% (median 1.7%, 19 studies, n=2080).  The range \nfor women suffering organ damage varied from 0% to 8% (median 2.1%, 15 studies, n=1723).  \nNew urinary symptoms in women who did not have these symptoms at baseline occurred in \n4% to 9% (median 6.8%, 4 studies, n=294).  The estimate for new bowel symptoms (1%, \n2\/178) was based on a single study, and the estimate for new sexual symptoms (range 9% to \n15%, n=87) was based on two small studies.  The range for infection was wide, which \nreflected the variety of ways used to define it (0.8% to 68%, 17 studies, n=1391).   \nData were available for meta-analysis comparing blood transfusion, damage to \nsurrounding organs, infection and new urinary symptoms between sacrocolpopexy (mesh) \n 11 \nand sacrospinous colpopexy (no mesh).  There was not enough evidence to demonstrate a \ndifference in any of these outcomes between the operations.[4]   \n \nSacrocolpoperineopexy \nTwo studies involving 442 women reported on sacrocolpoperineopexy.[31,58] (Appendix 2). \nTable 3 shows the event rates for primary outcomes for sacrocolpoperineopexy. Neither of the \ntwo studies gave details of uterine and vault prolapse separately. Risks of mesh erosion \nreported by these two studies were similar (8.5% in 118 women in 6 months and 8.3% in 169 \nwomen in 14 months). \n \nInfracoccygeal sacropexy (posterior IVS) \nFourteen studies (2 RCTs available as conference abstracts,[14,15] 1 non-randomised \ncomparative study,[27] 2 case series with sample sizes ≥100, [45,60] and 9 case series with \nsample sizes <100[41,43,44,48,52-56]) involving 976 women provided data on \ninfracoccygeal sacropexy. One study[27] reported uterine repair (uterus conserved), \n5[14,41,43,44,53] reported vault repair, onereported uterine and vault repairs separately[56], \nand 7[15,45,48,52,54,55,60] studies reported uterine and vault repairs together (Appendix 3).  \nThe median follow up across these 14 studies was 13 months (range 5 to 30 months).  The \nranges of event rates for primary outcomes are shown in Table 4.  Meta-analysis was not \npossible because the comparative studies used different comparators.   \n \nEfficacy \nThe proportion of women with persistent prolapse symptoms ranged from 2% to 21% \n(median 8.8%, n=262, 3 studies) after infracoccygeal sacropexy, whereas the range for \nprolapsed recurrence was 0% to 25% (median 4.8%, 9 studies, n=402).  In 3 studies (n=288), \n 12 \nthe re-operation rate varied from none to 30% (median 7.9%).  Estimates for other outcomes \nwere based on single studies with few women.   \n \nSafety \nThe risks of mesh erosion ranged from 0% to 21% (median 6.7%, 11 studies, n=889), and \n0.3% to 17% of women needed an operation for mesh erosion (median 7.2%, 6 studies, \nn=678).  All studies reporting mesh erosion used non-absorbable synthetic mesh. The need \nfor blood transfusion ranged from 0% to 2% (7 studies, n=383).  The risks of organ damage \nranged from 0% to 2.7% (median 0%, 9 studies, n=684).  Little evidence was available for \nnew urinary symptoms, bowel symptoms, and sexual symptoms in women who did not have \nthese symptoms at baseline.  Infection ranged from 0% to 9% (8 studies, n=698).   \n \nUterine suspension sling \nSix studies[12,19,33,34,49,50] involving 239 women reported on uterine suspension sling \noperations.  One was a full-text RCT,[12] one was a non-randomised comparative study,[19] \nand four were case series[33,34,49,50] (Appendix 4).  All of the case series had a sample size \nof less than 100.  Five of the six studies reported sacrohysteropexy (uterus suspended to the \nsacrum with a mesh bridge) and the other[49] reported a different technique (suspending the \nuterus to the pectineal ligaments).  The median follow up across the six studies was 33 \nmonths (12 to 95 months).  Meta-analysis was not possible because the comparative studies \nused different comparators.   \n \nEfficacy, safety, operation time and hospital stay  \nTable 5 shows the event rates for primary outcomes.  The range of persistent prolapse \nsymptoms was wide (0% to 39%, median 3.3%, 3 studies, n=91).  The risks of recurrence \n 13 \nranged from 0% to 8% (median 3.3%, 5 studies, n=136), while the risks of requiring a re-\noperation for prolapse ranged from 0% to 22% (median 3.3%, 3 studies, n=107).  Little \nevidence was available for estimating other efficacy outcomes or any of the safety outcomes.   \n \nDiscussion \nSummary of the evidence \nThe review indicated that although sacrocolpopexy is associated with an apparent risk of \nclinical recurrence ranging from 0% to 6% (at an average follow up of two years), the \nincidence of persistent prolapse symptoms (range 3% to 31%) and need for a further prolapse \noperation (range 2% to 25%) were relatively high.  There were risks from adverse effects \nsuch as mesh erosion (range 0% to 12%), which often required a further operation for mesh \nerosion (range 1% to 11%).  Non-absorbable mesh was associated with a higher risk of mesh \nerosion (median 4.0%, range 0% to 12.0%) compared with absorbable biological graft \n(median 0%, range 0% to 0.8%).  \nSacrocolpoperineopexy was associated with 8% of mesh erosion at an average follow \nup of one year. Little evidence was available for other outcomes.    \nFor infracoccygeal sacropexy, persistent symptoms ranged from 2% to 21% at an \naverage follow up of one year, clinical recurrence varied from 0% to 25%, mesh erosion from \n0% to 21%, and operation for mesh erosion from 2% to 17%.   \nFor uterine suspension sling, the clinical recurrence rates ranged from 0% to 8% at an \naverage follow up of three years, whereas persistent symptoms ranged from 0% to 39%. \nHowever, little evidence was available for safety outcomes.   \n \nAssumptions, limitations, and uncertainties \n 14 \nWe aimed to review separately data from women having uterine prolapse and vault prolapse, \nbecause the operations, and hence the efficacy and safety, might be different in these two \npopulations.  However, the majority of the studies (32\/54) reported data from women having \nuterine or vault repairs without separating the groups.  As there was limited evidence for \nuterine prolapse repair and for vault prolapse repair alone, we did review evidence from \nstudies that reported a mixture of uterine and vault prolapse.   \n  We did not separate data by surgical approach. We are aware that the laparoscopic \napproach is gaining in popularity. This could be applied in sacrocolpopexy, \nsacrocolpoperineopexy, or uterine suspension sling. A small proportion of the included \nstudies reported that the operations were done laparoscopically and were all for \nsacrocolpopexy (7.5%, 336\/4456).[25,26,29,32,46] \nIt is important to determine whether safety and efficacy of mesh differ in women \nhaving primary versus recurrent prolapse repairs.  However, of the 54 included studies, only \ntwo case series[35,61] reported exclusively on women having primary repairs.  Another four \nstudies[18,34,49,51] reported the case mix of primary and secondary operations but did not \nreport outcome data separately for the two groups.  It is likely that the remaining 48 studies \nincluded women having both primary and secondary surgery but this was not reported.   \nThere was a very limited number of RCTs available (20%, 11\/54) of which five were \navailable only as conference abstracts. The number of RCTs in each subgroup (by two types \nof prolapse, and by four different surgical techniques) was even smaller (Appendices 1 to 4). \nData were therefore too few to compare efficacy and safety between surgical techniques \nusing mesh (each type) and no mesh and between different mesh techniques.   \nWe pragmatically considered one year as an adequate minimum period of time to \nassess the efficacy of middle compartment prolapse repair.  However, as the mean time to \nreoperation is 12 years[69] one year may be too short to judge success.  Therefore failure rates \n 15 \nat one year may not be representative of longer-term efficacy.  Prospective studies will require \nextended follow up to assess meaningful mesh failure rates.   \nNevertheless, the results were considered generalisable as the majority of studies \nrecruited participants from a spectrum of routine practice, without restrictions for the severity \nof prolapse or other patient characteristics.   \n \nConclusions and implications \nIn general, sacrocolpopexy was associated with a low risk of recurrence, but the risks of \npersistent prolapse symptoms, re-operation, and mesh erosion were relatively high.  The \nestimates for the efficacy and safety outcomes for infracoccygeal sacropexy were wide.  \nThere was only limited evidence for efficacy and safety for sacrocolpoperineopexy or uterine \nsuspension sling.   \nIn consequence, in January 2009, NICE (UK) recommended that, for all but \nsacrocolpopexy for vaginal vault prolapse repair,[70] ‘special arrangements for clinical \ngovernance, consent and audit or research’ should be used.[71-74]  The implications are that \nthe ‘clinical governance leads in their Trusts should be informed, and patients need to be \nexplicitly counselled about the uncertainty regarding safety and efficacy.  Clear written \ninformation must be provided’.  NICE also recommend that clinicians should enter details \nabout all patients undergoing the procedures on the British Society for Urogynaecology \nDatabase so that a UK-wide audit of current practice can be carried out.   \nIn addition, rigorous RCTs, with adequate power to detect clinically meaningful \ndifferences and long-term outcomes, are needed to determine the comparative efficacy of \nmesh techniques and their optimal place in the treatment of middle compartment prolapse.  \nThey should use validated patient-reported outcome measures, primarily to compare the \n 16 \nfailure rates and safety profiles, between mesh and no-mesh techniques, between different \ntypes of mesh techniques, and between different types of mesh.   \n \n(Word count: 3503). \n \n 17 \nAcknowledgements \nThe authors thank Adrian Grant (Health Services Research Unit, University of Aberdeen) for \ncommenting on the study design; Georgios Lyratzopoulos and Sally Wortley (Interventional \nProcedures Programme, National Institute for Health and Clinical Excellence (NICE), UK) \nfor commenting on the draft. James Browning (Mpathy Medical Devices Ltd.), Christine \nClarke (Bard Ltd.), Hazel Edwards (American Medical Systems (UK), Ltd.), Adrian Griffiths \n(Johnson & Johnson Medical Ltd.), William Hynes (WL Gore & Associates (UK) Ltd.), and \nColoplast Ltd. for providing properties of mesh produced by the manufacturers and published \nstudies relating to mesh; and Paul Moran for providing additional information for a study \nidentified from the National Research Register database. \n \nContribution to Authorship \nXJ and CG wrote this paper and all authors contributed to its content.  XJ screened the search \nresults, contacted manufacturers, assessed studies for inclusion, undertook data abstraction \nand quality assessment, conducted data analysis, and drafted the Interventional Procedures \nreview on which this paper is based.  CG drafted the scope, provided advice on study \ninclusion, determined outcome categories, drafted the background and methods sections of \nthe review, and commented on drafts of the review.  GM commented on the scope of the \nreview, drafted letters for contacting mesh manufacturers for additional information, \nsupervised the conduct of the review, and commented on drafts of the review.  DJ provided \nadvice on statistical analysis, checked the analysis results, and commented on drafts of the \nreview.  CF developed and ran the literature search strategies, obtained papers, formatted the \nreferences, and drafted sections concerning search strategies and search results. CB provided \nspecialist advice on classification of mesh techniques, and commented on drafts of the review. \nJB supervised the conduct of the review, and commented on drafts of the review.   \n 18 \n \nFunding \nThis manuscript is based on a systematic review commissioned and funded by the National \nInstitute for Health and Clinical Excellence through its Interventional Procedures Programme. \nThe Health Services Research Unit receives a core grant from the Chief Scientist Office of the \nScottish Government Health Directorates.  The views expressed are those of the authors and \nnot necessarily those of the funding bodies.   \n \n 19 \nReferences \n \n1. Hagen S, Stark D, Maher C, Adams EJ (2006). Conservative management of pelvic organ \nprolapse in women. Cochrane Database of Systematic Reviews Issue 4. Art. No.: CD003882. \nDOI: 10.1002\/14651858.CD003882.pub3.  \n 2. Adams EJ, Thomson A, Maher C, Hagen S (2004). Mechanical devices for pelvic organ \nprolapse in women. Cochrane Database of Systematic Reviews Issue 2. Art. No.: CD004010. \nDOI: 10.1002\/14651858.CD004010.pub2.  \n 3. Maher C, Baessler K, Glazener CM, Adams EJ, Hagen S (2007). Surgical management of \npelvic organ prolapse in women. Cochrane Database of Systematic Reviews Issue 3. Art. \nNo.: CD004014. DOI: 10.1002\/14651858.CD004014.pub3.: \n 4. Systematic review of the efficacy and safety of using mesh or grafts in surgery for uterine \nor vaginal vault prolapse (2008). National Institute for Health and Clinical Excellence, \nLondon [accessed September 2009]. Available from : URL: \nhttp:\/\/www.nice.org.uk\/guidance\/index.jsp?action=download&o=41728. \n 5. Systematic reviews: CRD's guidance for undertaking systematic reviews in health care \n(2009). Centre for Reviews and Dissemination, University of York [accessed September \n2009]. Available from: URL: \nhttp:\/\/www.york.ac.uk\/inst\/crd\/SysRev\/!SSL!\/WebHelp\/SysRev3.htm. \n 6. Downs SH, Black N. (1998). The feasibility of creating a checklist for the assessment of \nthe methodological quality both of randomised and non-randomised studies of health care \ninterventions. J Epidemiol Community Health 52:377-384. \n 20 \n 7. Verhagen AP, de Vet HC, de Bie RA, Kessels AG, Boers M, Bouter LM et al (1998). The \nDelphi list: a criteria list for quality assessment of randomized clinical trials for conducting \nsystematic reviews developed by Delphi consensus. J Clin Epidemiol 51:1235-1241. \n 8. Benson JT, Lucente V, McClellan E (1996). Vaginal versus abdominal reconstructive \nsurgery for the treatment of pelvic support defects: a prospective randomized study with \nlong-term outcome evaluation. Am J Obstet Gynecol 175:1418-1421. \n 9. Culligan PJ, Blackwell L, Goldsmith LJ, Graham CA, Rogers A, Heit MH (2005). A \nrandomized controlled trial comparing fascia lata and synthetic mesh for sacral colpopexy. \nObstet Gynecol 106:29-37. \n 10. Lo T-S (1998). Abdominal colposacropexy and sacrospinous ligament suspension for \nsevere uterovaginal prolapse: A comparison. J Gynecol Surg 14:59-64. \n 11. Maher CF, Qatawneh AM, Dwyer PL, Carey MP, Cornish A, Schluter PJ (2004). \nAbdominal sacral colpopexy or vaginal sacrospinous colpopexy for vaginal vault prolapse: a \nprospective randomized study. Am J Obstet Gynecol 190:20-26. \n 12. Roovers JP, van der Vaart C, van der Bom JG, van Leeuwen JH, Scholten PC, Heintz PM \n(2004). A randomised controlled trial comparing abdominal and vaginal prolapse surgery: \neffect on urogenital function. BJOG 111:50-56. \n 13. Braun H, Fernandez M, Delloro A, Gonzalez F, Cuevas R, Rojas I (2007). Prospective \nrandomised study to compare colposacropexy and Mayo McCall technique in the correction \nof severe genital central prolapse. Int Urogynecol J 18:S12. \n 21 \n 14. Meschia M, Barbacini P, Longatti D, Gattei U, Pifarotti P (2005). Randomized \ncomparison between infracoccygeal sacropexy (posterior IVS) and sacrospinous ligament \nfixation in the management of vault prolpase. Int Urogynecol J 16:S54. \n 15. Tayrac R, Bader G, Deffieux X, Fazel A, Mathe ML, Fernandez H (2006). A prospective \nrandomized study comparing posterior IVS and sacrospinous suspension for the surgical \ntreatment of uterine or vaginal vault prolapse. Int Urogynecol J 17:S234-S235. \n 16. Altman D, Anzen B, Brismar S, Lopez A, Zetterstrom J (2006). Long-term outcome of \nabdominal sacrocolpopexy using xenograft compared with synthetic mesh. Urology 67:719-\n724. \n 17. Bai SW, Kwon HS, Chung DJ (2006). Abdominal high uterosacral colpopexy and \nabdominal sacral colpopexy with mesh for pelvic organ prolapse. Int J Gynecol Obstet \n92:147-148. \n 18. Begley JS, Kupferman SP, Kuznetsov DD, Kobashi KC, Govier FE, McGonigle KF et al \n(2005). Incidence and management of abdominal sacrocolpopexy mesh erosions. Am J \nObstet Gynecol 192:1956-1962. \n 19. Costantini E, Mearini L, Bini V, Zucchi A, Mearini E, Porena M (2005). Uterus \npreservation in surgical correction of urogenital prolapse. Eur Urol 48:642-649. \n 20. Demirci F (2007). Perioperative complications in abdominal sacrocolpopexy and vaginal \nsacrospinous ligament fixation procedures. Int Urogynecol J Pelvic Floor Dysfunct 18:257-\n261. \n 22 \n 21. Govier FE, Kobashi KC, Kozlowski PM, Kuznetsov DD, Begley SJ, McGonigle KF et al. \n(2005). High complication rate identified in sacrocolpopexy patients attributed to silicone \nmesh. Urology 65:1099-1103. \n 22. Gregory WT, Otto LN, Bergstrom JO, Clark AL (2005). Surgical outcome of abdominal \nsacrocolpopexy with synthetic mesh versus abdominal sacrocolpopexy with cadaveric fascia \nlata. Int Urogynecol J 16:369-374. \n 23. Griffis K, Evers MD, Terry CL, Hale DS (2006). Mesh erosion and abdominal \nsacrocolpopexy: A comparison of prior, total, and supracervical hysterectomy. J Pelvic Med \nSurg 12:25-30. \n 24. Hardiman PJ, Drutz HP (1996). Sacrospinous vault suspension and abdominal \ncolposacropexy: success rates and complications. Am J Obstet Gynecol 175:612-616. \n 25. Hsiao KC (2007). Comparison of laparoscopic and abdominal sacrocolpopexy for the \ntreatment of vaginal vault prolapse. J Endourol 21:926-930. \n 26. Marcickiewicz J, Kjollesdal M, Engh ME, Eklind S, Axen C, Brannstrom M et al (2007). \nVaginal sacrospinous colpopexy and laparoscopic sacral colpopexy for vaginal vault \nprolapse. Acta Obstet Gynecol Scand 86:733-738. \n 27. Neuman M, Lavy Y (2007). Conservation of the prolapsed uterus is a valid option: \nmedium term results of a prospective comparative study with the posterior intravaginal \nslingoplasty operation. Int Urogynecol J 18:889-893. \n 28. Ng CC, Han WH (2004). Comparison of effectiveness of vaginal and abdominal routes in \ntreating severe uterovaginal or vault prolapse. Singapore Med J 45:475-481. \n 23 \n 29. Paraiso MF, Walters MD, Rackley RR, Melek S, Hugney C (2005). Laparoscopic and \nabdominal sacral colpopexies: a comparative cohort study. Am J Obstet Gynecol 192:1752-\n1758. \n 30. Sze EH, Kohli N, Miklos JR, Roat T, Karram MM (1999). A retrospective comparison of \nabdominal sacrocolpopexy with Burch colposuspension versus sacrospinous fixation with \ntransvaginal needle suspension for the management of vaginal vault prolapse and coexisting \nstress incontinence. Int Urogynecol J 10:390-393. \n 31. Visco AG, Weidner AC, Barber MD, Myers ER, Cundiff GW, Bump RC et al (2001). \nVaginal mesh erosion after abdominal sacral colpopexy. Am J Obstet Gynecol 184:297-302. \n 32. Young SB, Kohorn EI, Braz-Martin S, Baker SP (2004). A survey of the complications of \nvaginal prolapse surgery performed by members of the Society Of Gynecologic Surgeons. \nInt Urogynecol J 15:165-170. \n 33. Banu LF (1997). Synthetic sling for genital prolapse in young women. Int J Gynecol \nObstet 57:57-64. \n 34. Barranger E, Fritel X, Pigne A (2003). Abdominal sacrohysteropexy in young women \nwith uterovaginal prolapse: long-term follow-up. Am J Obstet Gynecol 18:1245-1250. \n 35. Bensinger G, Lind L, Lesser M, Guess M, Winkler HA (2005). Abdominal sacral \nsuspensions: analysis of complications using permanent mesh. Am J Obstet Gynecol \n193:2094-2098. \n 36. Bradley CS (2007). Bowel symptoms in women 1 year after sacrocolpopexy. Am J Obstet \nGynecol 197:642 e1-642 e8. \n 24 \n 37. Brizzolara S, Pillai-Allen A (2003). Risk of mesh erosion with sacral colpopexy and \nconcurrent hysterectomy. Obstet Gynecol 102:306-310. \n 38. Culligan PJ, Murphy M, Blackwell L, Hammons G, Graham C, Heit MH (2002). Long-\nterm success of abdominal sacral colpopexy using synthetic mesh. Am J Obstet Gynecol \n187:1473-1480. \n 39. de Vries MJ, van Dessel TH, Drogendijk AC, de Haas I, Huikeshoven FJ (1995). Short-\nterm results and long-term patients' appraisal of abdominal colposacropexy for treatment of \ngenital and vaginal vault prolapse. Eur J Obstet Gynecol Reprod Biol 59:35-38. \n 40. Elneil S, Cutner AS, Remy M, Leather AT, Toozs-Hobson P,Wise B (2005). Abdominal \nsacrocolpopexy for vault prolapse without burial of mesh: a case series. BJOG 112:486-489. \n 41. Farnsworth BN (2002). Posterior intravaginal slingplasty (infracoccygeal sacropexy) for \nsevere posthysterectomy vaginal vault prolapse--a preliminary report on efficacy and safety. \nInt Urogynecol J 13:4-8. \n 42. Fedorkow DM, Kalbfleisch RE (1993). Total abdominal hysterectomy at abdominal \nsacrovaginopexy - a comparative-study. Am J Obstet Gynecol 169:641-643. \n 43. Foote AJ (2007). Infracoccygeal sacropexy. Aust N Z J Obstet Gynaecol 47:250-251. \n 44. Ghanbari Z, Baratali BH, Mireshghi MS (2006). Posterior intravaginal slingplasty \n(infracoccygeal sacropexy) in the treatment of vaginal vault prolapse. Int J Gynaecol Obstet \n94:147-148. \n 45. Hefni M (2007). Morbidity associated with posterior intravaginal slingplasty for \nuterovaginal and vault prolapse. Arch Gynecol Obstet 276:499-504. \n 25 \n 46. Higgs P, Goh J, Krause H, Sloane K, Carey M (2005). Abdominal sacral colpopexy: an \nindependent prospective long-term follow-up study. Aust N Z J Obstet Gynaecol 45:430-434. \n 47. Higgs PJ, Chua HL, Smith AR (2005). Long term review of laparoscopic sacrocolpopexy. \nBJOG 112:1134-1138. \n 48. Jordaan DJ, Prollius A, Cronje HS, Nel M (2006). Posterior intravaginal slingplasty for \nvaginal prolapse. Int Urogynecol J 17:326-329. \n 49. Joshi VM (1993). A new technique of uterine suspension to pectineal ligaments in the \nmanagement of uterovaginal prolapse. Obstet Gynecol  81:790-793. \n 50. Leron E, Stanton SL (2001). Sacrohysteropexy with synthetic mesh for the management \nof uterovaginal prolapse. BJOG 108:629-633. \n 51. Lindeque BG, Nel WS (2002). Sacrocolpopexy--a report on 262 consecutive operations. S \nAfr Med J 92:982-985. \n 52. Oliver R, Dasgupta C, Coker A (2006). Posterior intravaginal slingplasty for vault and \nuterovaginal prolapse: An initial experience. Gynecol Surg 3:88-92. \n 53. Papa Petros PE (2001). Vault prolapse II: Restoration of dynamic vaginal supports by \ninfracoccygeal sacropexy, an axial day-case vaginal procedure. Int Urogynecol J Pelvic \nFloor Dysfunct 12:296-303. \n 54. Petros PE, Richardson PA (2005). Tissue Fixation System posterior sling for repair of \nuterine\/vault prolapse -- a preliminary report. Aust N Z J Obstet Gynaecol 45:376-379. \n 26 \n 55. Sentilhes L, Sergent F, Resch B, Verspyck E, Descamps P, Marpeau L (2007). Midterm \nFollow-up of High-Grade Genital Prolapse Repair by the Trans-obturator and Infracoccygeal \nHammock Procedure after Hysterectomy. Eur Urol 51:1065-1072. \n 56. Sivaslioglu AA, Gelisen O, Dolen I, Dede H, Dilbaz S, Haberal A (2005). Posterior sling \n(infracoccygeal sacropexy): An alternative procedure for vaginal vault prolapse. Aust N Z J \nObstet Gynaecol 45:159-160. \n 57. Snyder TE, Krantz KE (1991). Abdominal-retroperitoneal sacral colpopexy for the \ncorrection of vaginal prolapse. Obstet Gynecol 77:944-949. \n 58. Su KC, Mutone MF, Terry CL, Hale DS (2007). Abdominovaginal sacral \ncolpoperineopexy: patient perceptions, anatomical outcomes, and graft erosions. Int \nUrogynecol J 18:503-511. \n 59. Timmons MC, Addison WA, Addison SB, Cavenar MG (1992). Abdominal sacral \ncolpopexy in 163 women with posthysterectomy vaginal vault prolapse and enterocele. \nEvolution of operative techniques. J Reprod Med 37:323-327. \n 60. Vardy MD, Brodman M, Olivera CK, Zhou HS, Flisser AJ, Bercik RS (2007). Anterior \nintravaginal slingplasty tunneller device for stress incontinence and posterior intravaginal \nslingplasty for apical vault prolapse: a 2-year prospective multicenter study. Am J Obstet \nGynecol 197:104-108. \n 61. Wu JM, Wells EC, Hundley AF, Connolly A, Williams KS, Visco AG (2006). Mesh \nerosion in abdominal sacral colpopexy with and without concomitant hysterectomy. Am J \nObstet Gynecol 194:1418-1422. \n 27 \n 62. Brown M (2004). Long-term effectiveness of abdominal sacrocolpopexy for the treatment \nof pelvic organ prolapse. ClinicalTrials.gov Identifier NCT00099372.  ClinicalTrials.gov \n[accessed September  2009] Available from: URL: \nhttp:\/\/clinicaltrials.gov\/ct2\/show\/NCT00099372?term=nct00099372&rank=1. \n 63. Chen CC (2007). Laparoscopic versus robotic assisted laparoscopic sacrocolpopexy for \nvaginal prolapse. ClinicalTrials.gov Identifier NCT00551993.  ClinicalTrials.gov [accessed \nSeptember 2009]. Available from: URL: \nhttp:\/\/clinicaltrials.gov\/ct2\/show\/NCT00551993?term=nct00551993&rank=1. \n 64. Culligan P (2005). Randomized controlled trial comparing acellular collagen biomesh \n(Pelvisoft) to polypropylene mesh (Pelvitex) for sacral colpopexy. ClinicalTrials.gov \nIdentifier NCT00564083.  ClinicalTrials.gov [accessed September 2009]. Available from: \nURL: http:\/\/clinicaltrials.gov\/ct2\/show\/NCT00564083?term=nct00564083&rank=1. \n 65. Freeman R (2006). LAS study - a randomised controlled trial of abdominal versus \nlaparoscopic sacrocolpopexy for the treatment of post-hysterectomy vaginal vault prolapse. \nNRR ID N0185181850.  National Research Register Archive [accessed September 2009]. \nAvailable from: URL: \nhttps:\/\/portal.nihr.ac.uk\/Profiles\/NRR.aspx?Publication_ID=N0185181850. \n 66. Gannon NA (2005). Treatment of stress and mixed urinary incontinence and vaginal vault \nprolapse. ClinicalTrials.gov Identifier NCT00223106.  ClinicalTrials.gov [September 2009]. \nAvailable from: URL: \nhttp:\/\/clinicaltrials.gov\/ct2\/show\/NCT00223106?term=nct00223106&rank=1. \n 67. Halaska M (2007). Randomized multicentric study to treat prolapse after hysterectomy \nwith Amreich procedure or total Prolift procedure. ClinicalTrials.gov Identifier \n 28 \nNCT00572702.  ClinicalTrials.gov [accessed September 2009]. Available from: URL: \nhttp:\/\/clinicaltrials.gov\/ct2\/show\/NCT00572702?term=nct00572702&rank=1. \n 68. Zylstra S (2006). Observational data collection of surgical outcomes in the treatment of \nvaginal prolapse with AMS products. ClincialTrials.gov Identifier NCT00388947.  \nClinicalTrials.gov [accessed September 2009]. Available from: URL: \nhttp:\/\/clinicaltrials.gov\/ct2\/show\/NCT00388947?term=nct00388947&rank=1. \n 69. Olsen AL, Smith VJ, Bergstrom JO, Colling JC, Clark AL (1997). Epidemiology of \nsurgically managed pelvic organ prolapse and urinary incontinence.  Obstet Gynecol  \n89:501-506. \n 70. National Institute for Health and Clinical Excellence (2009). Sacrocolpopexy using mesh \nfor vaginal vault. Interventional Procedure Guidance IPG283. National Institute for Health \nand Clinical Excellence, London [accessed September 2009]. Available from: URL: \nhttp:\/\/www.nice.org.uk\/nicemedia\/pdf\/IPG283Guidance.pdf. \n 71. National Institute for Health and Clinical Excellence (2009). Infracoccygeal sacropexy \nusing mesh for uterine prolapse repair. Interventional Procedure Guidance IPG280. National \nInstitute for Health and Clinical Excellence, London [accessed September 2009]. Available \nfrom: URL: http:\/\/www.nice.org.uk\/nicemedia\/pdf\/IPG280Guidance.pdf. \n 72. National Institute for Health and Clinical Excellence (2009). Insertion of mesh uterine \nsuspension sling (including sacrohysteropexy) for uterine prolapse repair. Interventional \nProcedure Guidance IPG282.  National Institute for Health and Clinical Excellence, London \n[accessed September 2009]. Available from: URL: \nhttp:\/\/www.nice.org.uk\/nicemedia\/pdf\/IPG282guidance.pdf. \n 29 \n 73. National Institute for Health and Clinical Excellence (2009). Infracoccygeal sacropexy \nusing mesh for vaginal vault prolapse repair. Interventional Procedure Guidance IPG281.  \nNational Institute for Health and Clinical Excellence, London [accessed September 2009]. \nAvailable from: URL: http:\/\/www.nice.org.uk\/nicemedia\/pdf\/IPG281Guidance.pdf. \n 74. National Institute for Health and Clinical Excellence (2009). Sacrocolpopexy with \nhysterectomy using mesh for uterine prolapse repair. Interventional Procedure Guidance \nIPG284. National Institute for Health and Clinical Excellence, London [accessed September \n2009]. Available from: URL: \nhttp:\/\/www.nice.org.uk\/nicemedia\/pdf\/IPG%20284%20Guidance%20LR%20FINAL.PDF.p\ndf. \n \n \n \n \n \n \n 30 \nFigure 1 Flow diagram for screening process. \n \nPotentially relevant reports identified \nand screened for retrieval (n=853) \nReports retrieved for more detailed \nevaluation (n=281) \nStudies included (n=54, in 67 reports):  \n5 full text RCTs,  \n3 RCTs available as conference abstract, \n17 non-randomised comparative studies,  \n29 case series  \nExcluded reports (n=227): \nCase series reporting sacrocolpopexy but \nsample size < 100 (n=100), \nNo mesh used (n=18), \nData not presented separately for uterine or \nvault repair or for mesh techniques (n=14), \nNo data reported (n=4), \nOther reasons, e.g. reviews (n=91) \nExcluded reports (n=572): not meeting \ninclusion criteria, e.g. no mesh was used \n 31 \nTable 1 Median and ranges of event rates for primary efficacy and safety outcomes for sacrocolpopexy \n Uterine Vault Uterine and\/or vault \n No. study n\/N, % Median (range) No. study n\/N, % Median (range) No. study n\/N, % Median (range) \nPatient reported persistent prolapse symptoms \nRCT 0   1 3\/46 (6.5%) 6.5% 1 6\/38 (16%) 16% \nRCT (abs.) 0   0   0   \nNon-rand 0   1 13\/60 (22%) 22% 2a 11\/97 (11%) 14% (3.3-24) \nCase series 0   1 22\/103 (21%) 21% 3 77\/294 (26%) 26% (23-31) \nTotal Median 2.2% (range 3-31), based on 9 studies (638 women) \nClinician reported recurrent prolapse at original site \nRCT 0   2a 2\/135 (1.5%) 2.2% (0-4.3) 1 0\/52 (0%) 0% \nRCT (abs.) 1 0\/23 (0%) 0% 0   0   \nNon-rand 1 0\/39 (0%) 0% 2a 2\/105 (1.9%) 2.2% (0-4.4) 2 4\/140 (2.9%) 3.1% (1.3-5.0) \nCase series 0   1 4\/66 (6.1%) 6.1% 4 8\/494 (1.6%) 1.8% (0-3.1) \nTotal Median 1.2% (range 0-6.1), based on 14 studies (1054 women) \nMesh erosion \nRCT 0   2a 3\/147 (2.0%) 2.1% (2.0-2.1) 0   \nRCT (abs.) 1 1\/23 (4.3%) 4.3% 0   0   \nNon-rand 2a 12\/143 (8.4%) 8.2% (7.7-8.7) 2b 7\/162 (4.3%) 5.7% (2.6-8.9) 8c 22\/577 (3.8%) 2.4% (0-12) \nCase series 1 7\/101 (6.9%) 6.9% 4 35\/660 (5.3%) 6.5% (0-8.7) 7 31\/1109 (2.8%) 2.4% (1.0-6.5) \nTotal Median 5.4% (range 0-12), based on 27 studies (2922 women) \n \na,b.c Results from the two arms of one\/two\/four studies were combined\n 32 \nTable 2 Median and ranges of mesh erosion rates for sacrocolpopexya,b \n No. study n\/N (%) Median (range) \nNon-absorbable synthetic mesh \nUterine 3 19\/280 (6.8%) 6.9% (4.0-8.7) \nVault 7 42\/806 (5.2%) 4.7% (0-8.9) \nUterine and\/or vault 11 26\/783 (3.3%) 5.0% (0-12.0) \nTotal  21 87\/1869 (4.7%) 4.0% (0-12) \nAbsorbable synthetic mesh (no study reported data on this) \nAbsorbable biological graft \nUterine 0   \nVault 1 0\/46 (0%) 0% \nUterine and\/or vault 4 1\/183 (0.5%) 0% (0-0.8%) \nTotal  5 1\/229 (0.4%) 0% (0-0.8) \nCombined (contain both non-absorbable and absorbable material) \nUterine 1 1\/23 (4.3%) 4.3% \nVault 0   \nUterine and\/or vault 0   \nTotal  1 1\/23 (4.3%) 4.3% \n \naFour studies reported two different types of mesh separately. \nbFive studies (5\/27, 18.5 %) that reported data on mesh erosion were not included in this table because they either did not report type of mesh used or used a \nmixture of different types but not reported them separately. \n 33 \nTable 3 Median and ranges of event rates for primary efficacy and safety outcomes for sacrocolpoperineopexy \n Sacrocolpoperineopexy \n(not reported separately by uterine and vault) \n No. study n\/N, % Median (range) \nPatient reported persistent prolapse symptoms \nRCT 0   \nRCT (abstract) 0   \nNon-randomised comparative studies 0   \nCase series 1 2\/169 (1.2%) 1.2% \nTotal Median 1.2%, based on 1 study (169 women) \nClinician reported recurrent prolapse at original site \nRCT 0   \nRCT (abstract) 0   \nNon-randomised comparative studies 0   \nCase series 1 1\/169 (0.6%) 0.6% \nTotal Median 0.6%, based on 1 study (169 women) \nMesh erosion \nRCT 0   \nRCT (abstract) 0   \nNon-randomised comparative studies 1 10\/118 (8.5%) 8.5% \nCase series 1 14\/169 (8.3%) 8.3% \nTotal Median 8.4% (range 8.3-8.5), based on 2 studies (287 women) \n \n 34 \nTable 4 Median and ranges of event rates for primary efficacy and safety outcomes for infracoccygeal sacropexy  \n Uterine Vault Uterine and\/or vault \n No. study n\/N, % Median (range) No. study n\/N, % Median (range) No. study n\/N, % Median (range) \nPatient reported persistent prolapse symptoms \nRCT 0   0   0   \nRCT (abs.) 0   0   0   \nNon-rand 0   0   0   \nCase series 0   1 8\/91 (8.8%) 8.8% 2 28\/171 (16%) 12% (2.3-21) \nTotal Median 8.8% (range 2-21), based on 3 studies (262 women) \nClinician reported recurrent prolapse at original site \nRCT 0   0   0   \nRCT (abs.) 0   0   1 1\/21 (4.8%) 4.8% \nNon-rand 1a 1\/79 (1.3%) 1.3% 0   0   \nCase series 1 1\/10 (10%) 10% 2 4\/60 (6.7%) 5.0% (0-10) 4 17\/232 (7.3%) 6.5% (0-25) \nTotal Median 4.8% (range 0-25), based on 9 studies (402 women) \nMesh erosion \nRCT 0   0   0   \nRCT (abs.) 0   1 2\/30 (6.7%) 6.7% 1 0\/21 (0%) 0% \nNon-rand 1a 10\/79 (13%) 13% 0   0   \nCase series 0   4 22\/235 (9.4%) 6.6% (5.3-21%) 4 33\/524 (6.3%) 5.6% (1.5-17) \nTotal Median 6.7% (range 0-21), based on 11 studies (889 women) \n \na Results from the two arms of one study were combined \n 35 \nTable 5 Median and ranges of event rates for primary efficacy and safety outcomes for uterine suspension sling  \n Uterine suspension sling \n(for uterine prolapsed only) \n No. study n\/N, % Median (range) \nPatient reported persistent prolapse symptoms \nRCT 1 16\/41 (39%) 39% \nRCT (abstract) 0   \nNon-randomised comparative studies 0   \nCase series 2 1\/50 (2.0%) 1.6% (0-3.3) \nTotal Median 3.3% (range 0-39), based on 3 studies (91 women) \nClinician reported recurrent prolapse at original site \nRCT 1 2\/38 (5.3%) 5.3% \nRCT (abstract) 0   \nNon-randomised comparative studies 1 0\/36 (0%) 0% \nCase series 3 2\/62 (3.2%) 3.3% (0-7.7) \nTotal Median 3.3% (range 0-7.7), based on 5 studies (136 women) \nMesh erosion \nRCT 0   \nRCT (abstract) 0   \nNon-randomised comparative studies 1 0\/36 (0%) 0 \nCase series 1 1\/30 (3.3%) 3.3% \nTotal Median 1.7% (range 0-3.3), based on 2 studies (66 women) \n \n 36 \nAppendix 1  Sacrocolpopexy: summary of patient characteristics and surgical procedures \n \nID N Age, y Uterine\/ \nvault \nPrimary\/ \nsecondary \nIntervention route Technique  Mesh\/graft, trade name Concomitant \nprocedure \nFollow up, mean Outcomes  \nUTERINE            \nRCT (abs.)           \nBraun 2007[13] A, 23 \nB, 24 \nA, 57 \nB, 56 \nA, 23\/0 \nB, 24\/0 \nNR A, abdominal  \nB, vaginal \nA, hysterectomy + sacrocolpopexy; \nB, hysterectomy + anteroposterior \ncolporrhaphy + Mayo McCall stitch \nA, combined mesh, polyglactin \nand prolene 1 :1, Vypro \nB, no mesh \nNR 33m (20-41) Efficacy \nSafety  \nNon-randomised comparative studies \nCostantini \n2005[19] \nA, 36 \nB, 39 \nA, 61 (12) \nB, 62 (8) \nA, 36\/0 \nB, 39\/0 \nNR A, abdominal \nB, abdominal \nA, sacrohysteropexy \nB, hysterectomy + sacrocolpopexy \nA, polypropylene, Marlex \n(Amid type I) \nB, same as A \nAnti-incontinence: \nA, 28\/36; B, 30\/39 \nHysterectomy: \nA, 0\/36; B, 39\/39 \n \n51m (12-115) Efficacy \nSafety  \nGriffis 2006[23] A, 60 \nB, 28 \nNR A, 60\/0 \nB, 28\/0 \nNR A, abdominal \nB, abdominal \nA, total hysterectomy + sacrocolpopexy \nB, supracervical hysterectomy + \nsacrocolpopexy \nA, polypropylene, Prolene soft, \nProlene (Amid type I), or \nAtrium (NR Amid type); \npolyethylene tetraphalate, \nMersilene (Amid type III) \nB, same as A \nNR 13m (12-15) Safety  \nCase series           \nWu 2006[61] 101 64 (12) 101\/0 101\/0 Abdominal (open) Hysterectomy + sacrocolpopexy polyethylene tetraphalate, \nMersilene (Amid type III); \npolypropylene (NR trade name); \nor Gore-Tex (Amid type II) \nNR 15m (0.2-120) Safety  \nVAULT           \nRCT           \nCulligan 2005[9] A, 54 \nB, 46 \nA, 60 (10) \nB, 58 (11) \nA, 0\/54 \nB, 0\/46 \nNR A, abdominal (open) \nB, abdominal (open) \nA, sacrocolpopexy \nB, sacrocolpopexy \nA, polypropylene, Trelex \nB, cadaveric fascia lata, \nTutoplast \nNR 1y Efficacy \nSafety \nMaher 2004[11] A, 47 \nB, 48 \nA, 63 (39-84) \nB, 63 (35-88) \nA, 0\/47 \nB, 0\/48 \nNR A, abdominal \nB, vaginal \nA, sacrocolpopexy \nB, unilateral vaginal sacrospinous \ncolpopexy \nA, polypropylene, Prolene \n(Amid type I) \nB, no mesh \nNR 24m (6-60) Efficacy \nSafety \n \nNon-randomised comparative studies \nGovier 2005[21] A, 24 \nB, 21 \nA+B, 67 (51-\n86) \nA, 0\/24 \nB, 0\/21 \nNR A, abdominal (open or \nlaparoscopic) \nB, abdominal (open or \nlaparoscopic) \n \nA, sacrocolpopexy \nB, sacrocolpopexy \nA, polypropylene, Prolene  \nB, silicone-covered \npolyethylene mesh, American \nMedical Systems \nA+B, 20\/45 A, 12m (1-38) \nB, 23m (16-41) \nEfficacy \nSafety \n \nMarcickiewicz \n2007[26] \nA, 60 \nB, 51 \nA, 58 (30-83) \nB, 66 (43-88) \nA, 0\/60 \nB, 0\/51 \nNR A, abdominal \n(laparoscopic) \nB, vaginal \n \nA, sacrocolpopexy \nB, sacrospinous colpopexy \nA, polypropylene, Prolene \nB, no mesh \nA, 6\/60; B, 8\/51 A, 34m (13-60) \nB, 38m (7-108) \n \nEfficacy \nSafety  \nParaiso 2005[29] A, 56 \nB, 61 \nA, 62 (39-85) \nB, 61 (35-81) \nA, 0\/56 \nB, 0\/61 \nNR A, abdominal \n(laparoscopic) \nB, abdominal (open) \nA, sacrocolpopexy \nB, sacrocolpopexy \nA, cadaveric fascia lata, \nTutoplast, or polypropylene, \nProlene \nB, save as above \nA, 24\/56; B, 38\/61 \n  \nA, 14m (1-46) \nB, 16m (1-73) \nSafety \n 37 \nID N Age, y Uterine\/ \nvault \nPrimary\/ \nsecondary \nIntervention route Technique  Mesh\/graft, trade name Concomitant \nprocedure \nFollow up, mean Outcomes  \nCase series           \nFedorkow \n1993[42] \n \n149 58 (11) 0\/149 NR Abdominal  Sacrocolpopexy  \n \nPolypropylene, Prolene (Amid \ntype I) \nNR NR Safety \nGriffis 2006[23] 196 NR 0\/196 NR Abdominal  Sacrocolpopexy  Polypropylene, Prolene-Soft, \nProlene (Amid type I), or \nAtrium (NR Amid type); \npolyethylene tetraphalate, \nMersilene (Amid type III). \n \nNR 13m Safety  \nHiggs 2005a[47] 103 58 (10) 0\/103 NR Abdominal \n(laparoscopic) \nSacrocolpopexy  Polypropylene, Prolene (Amid \ntype I) \n \n39\/103 66m (37-124) Efficacy \nSafety  \nWu 2006[61] 212 66 (11) 0\/212 212\/0 Abdominal (open) Sacrocolpopexy  Polyethylene  tetraphalate, \nMersilene (Amid type III); \npolypropylene (NR trade \nname); or Gore-Tex \nNR 15m (0.3-121) Safety  \nUTERINE AND\/OR VAULT         \nRCT           \nBenson 1996[8] A, 40 \nB, 48 \nA, 66 (10) \nB, 64 (9) \nNR NR A, abdominal \nB, vaginal \nA, sacrocolpopexy  \nB, bilateral sacrospinous ligament vault \nsuspension \n \nA, NR \nB, no mesh \nAnti-incontinence:  \nA, 14\/40; B, 20\/48 \nHysterectomy:  \nA, 20\/40; B, 24\/48 \n \n2.5y (1-5.5) Efficacy  \nSafety  \nLo 1998[10] A, 52 \nB, 66 \nA, 63 (9) \nB, 60 (10) \nNR NR A, abdominal (open) \nB, vaginal \nA, sacrocolpopexy \nB, sacrospinous ligament suspension \nA, polyethylene tetraphalate, \nMersilene (Amid type III) \nB, no mesh \nAnti-incontinence: \nA, 0\/52; B, 0\/66 \nHysterectomy: \nA, 33\/52; B, 20\/66 \n2.1y (1-5.2) Efficacy \nSafety \n \nNon-randomised comparative studies \nAltman 2005[16] A, 25 \nB, 27 \nA, 66 (54-83) \nB, 69 (55-84) \nNR NR A, abdominal \nB, abdominal \nA, sacrocolpopexy \nB, sacrocolpopexy \nA, 12 polypropylene, 13 \npolytetrafluoroethylene (NR \ntrade name) \nB, porcine dermis, Pelvicol \n \nHysterectomy: \nA, 2\/25; B, 5\/27 \nEfficacy \nA, 7.4m; B, 7.1m \nSafety \nA, 4.3y; B, 2.5y \n \nSafety  \nBai 2006[17] A, 20 \nB, 54 \nNR NR NR A, abdominal \nB, abdominal \nA, sacrocolpopexy \nB, high uterosacral colpopexy \nA, polyethylene tetraphalate, \nMersilene (Amid type III) \nB, no mesh \n \nPerformed if needed \nbut NR numbers. \n1y Safety  \nBegley 2005[18] A, 24 \nB, 33 \nC, 21 \nD, 14 \nA, 69 (49-86)  \nB, 66 (37-84) \nC, 66 (40-85) \nD, 63 (25-83) \nNR A+B, 85\/7 A, abdominal (19 \nopen, 5 laparoscopic) \nB, abdominal (open) \nC, abdominal (18 \nopen, 3 laparoscopic) \nD, abdominal (open) \nA, sacrocolpopexy \nB, sacrocolpopexy \nC, sacrocolpopexy \nD, sacrocolpopexy \nA, polypropylene, Marlex or \nProlene (Amid type I) \nB, polypropylene, Gore-Tex \n(Amid type II) \nC, silicon-covered polyester, \nAmerican Medical Systems  \nD, 1 autologous and 13 \ncadaveric fascia lata, Tutoplast \nAnti-incontinence: \nA, 9\/24; B, 14\/33; \nC, 9\/21; D, 5\/14 \nHysterectomy: \nA, 1\/24; B, 8\/33; C, \n3\/21; D, 7\/14 \nA, 10m \nB, 29m \nC, 16m \nD, 19m \nEfficacy \nSafety \n \n 38 \nID N Age, y Uterine\/ \nvault \nPrimary\/ \nsecondary \nIntervention route Technique  Mesh\/graft, trade name Concomitant \nprocedure \nFollow up, mean Outcomes  \n \nGregory \n2005[22] \nA, 49 \nB, 33 \nNR  NR NR A, abdominal (open) \nB, abdominal (open) \nA, sacrocolpopexy \nB, sacrocolpopexy \nA, polypropylene, Marlex \n(Amid type I); polyethylene \ntetraphalate, Mersilene (Amid \ntype II) \nB, fascia lata, Community \nTissue Services  \n \nPerformed but NR \nnumbers \nA, 26 (10-48) \nB, 21 (11-34) \nEfficacy \nSafety  \nHardiman \n1996[24] \nA, 80 \nB, 125 \nA, 61  \nB, 64 \nNR NR A, abdominal \nB, vaginal \nA, sacrocolpopexy \nB, sacrospinous vault suspension \nA, polypropylene, Marlex \n(Amid type I) \nB, no mesh \n \nAnti-incontinence: \nA, 76\/80; B, 45\/125 \nHysterectomy: \nA, 18\/80; B, 45\/125 \n \nA, 3.9y \nB, 2.2y \nA+B, 6m-5y \nEfficacy \nSafety  \nHsiao 2007[25] A, 25 \nB, 22 \nA, 66 \nB, 71 \nA, 2\/23 \nB, 3\/19 \nNR A, abdominal \n(laparoscopic) \nB, abdominal (open) \nA, sacrocolpopexy \nB, sacrocolpopexy \nA, 19 polypropylene, Prolene; \n3 silicone mesh \nB, 2 fascia lata; 13 \npolypropylene, Prolene; 5 \nsilicon mesh; 2 polypropylene, \nGore-Tex \n \nAnti-incontinence: \nA, 9\/25; B, 10\/22 \nHysterectomy:  \nNR \nA, 6m \nB, 10m \nSafety  \nNg 2004[28] \n \n \n \n \n \nA, 113 \nB, 64 \nA, 60 \nB, 63 \nA, 78\/35 \nB, 37\/27 \nNR A, abdominal (open) \nB, vaginal \nA, sacrocolpopexy \nB, sacrospinous ligament fixation \nA, polytetrafluoroethylene, \nGore-Tex (Amid type II) \nB, no mesh \nAnti-incontinence: \nA, 28\/113; B, 12\/64 \nHysterectomy:  \nA, 78\/113; B, 38\/64 \n \nA, 18m (1-48) \nB, 13m (1-29) \nEfficacy \nSafety  \nSze 1999[30] A, 56 \nB, 61 \nA, 57 (34-74) \nB, 64 (43-76) \nA, 19\/35 \nB, 7\/40 \nNR A, abdominal (open) \nB, vaginal \nA, sacrocolpopexy \nB, sacrospinous ligament fixation \nA, NR \nB, no mesh \nAnti-incontinence: \nA, 56\/56; B, 61\/61 \nHysterectomy: \nA, 7\/56; B, 19\/61 \n \nA, 23m (4-51) \nB, 24m (7-72) \nSafety \nVisco 2001[31] A, 155 \nB, 88 \nC, 25 \nD, 5 \nA+B+C+D, 61 \n(31-84) \nNR NR A, abdominal \nB, abdominal \nC, vaginal+ abdominal \nD, vaginal+ abdominal \n \nA, sacrocolpopexy \nB, sacrocolpoperineopexy  \nC, sacrocolpoperineopexy \nD, sacrocolpoperineopexy with mesh \nplaced to vaginal field \n \nA, polyethylene tetraphalate, \nMersilene (Amid type III) or \nGore-Tex (Amid type II) \nB, C, D, same as above \nAnti-incontinence: \nNR \nHysterectomy: \nA+B+C+D: 45\/273 \nA, 7m (1-87) \nB, 5 (1-45) \nC, 6m (1-28) \nD, 7m (2-11) \n \nYoung 2004[32] \n(prospective \nregistry) \nA, 92 \nB, 187 \nC, 70 \nA, 61 (28-84) \nB, 37-87 \nC, 64 (34-84) \nNR NR A, abdominal \n(laparoscopic) \nB, vaginal \nC, vaginal \nA, sacrocolpopexy \nB, sacrospinous fixation \nC, high uterosacral suspension \nA, a mixture of biological \ngrafts and non-absorbable \nsynthetic mesh \nB, no mesh \nC, no mesh \nAnti-incontinence: \nA, 44\/92; B, 28\/187; \nC, 8\/70 \nHysterectomy: \nA, 6\/92; B, 63\/187; C, \n17\/70 \nNR, a safety \nregistry in a year \n(Oct. 1998-Oct. \n1999) \nSafety  \nCase series           \nBensinger \n2005[35] \n121 53 (10) 86\/35 121\/0 Abdominal  Sacrocolpopexy  Polypropylene (NR trade \nname) \n \nAnti-incontinence: \n82\/121 \nHysterectomy: NR \n13m (0.3-63) Safety  \n 39 \nID N Age, y Uterine\/ \nvault \nPrimary\/ \nsecondary \nIntervention route Technique  Mesh\/graft, trade name Concomitant \nprocedure \nFollow up, mean Outcomes  \n \nBrizzolara \n2003[37] \n124 65 (9) 60\/64 NR Abdominal  Sacrocolpopexy   Polypropylene, Prolene, or \nallograft (NR trade name) \nAnti-incontinence: \n92\/124 \nHysterectomy: NR \n \n36m (0-74) Efficacy  \nSafety  \nBradley 2007[36] 305 NR NR NR Abdominal (open) Sacrocolpopexy  Non-absorbable synthetic, \nxenograft, autologous or \ncadaveric fascia lata  \nAnti-incontinence: \n148\/305 \n1y Efficacy \nSafety  \nCulligan \n2002[38] \n245 61 (32-83) NR NR Abdominal  Sacrocolpopexy  Synthetic mesh (NR trade \nname) \nAnti-incontinence: \n171\/245 \nHysterectomy: 11\/245 \nObjective \nfailure: >=4y; \nsubjective \nfailure: 3.3y (0.8-\n6.9) \nEfficacy \nSafety  \nDe Vries \n1995[39] \n101 59 (37-82) 15\/83 NR Abdominal (open) Sacrocolpopexy  Polyethylene  tetraphalate, \nMersilene (Amid type III) \n \nAnti-incontinence : \n20\/101 \nHysterectomy : NR \n \n4y (1-13) Efficacy \nSafety  \nHiggs 2005b[46] 148 58 (10) 24\/123 NR Abdominal (open) Sacrocolpopexy  Combined mesh, \npolyproglactine and prolene \n1 :1, Vypro; fascia lata; \npolypropylene, Prolene;  \npolyethylene tetraphalate, \nMersilene. \n \nAnti-incontinence : \n76\/148 \nHysterectomy : 25\/148 \n45m (15) Efficacy \nSafety  \nLindeque \n2002[51] \n262 28-79 4\/258 8\/254 Abdominal (open) Sacrocolpopexy  18 dura mater strips, then \nchanged to \npolytetrafluoroethylene, Gore-\nTex (Amid type II) \n \nAnti-incontinence: \n106\/262 \nHysterectomy: NR \nAll >=16m Efficacy \nSafety  \n \nSnyder 1991[57] 147 62 (30-83) 3\/144 NR Abdominal (open) Sacrocolpopexy Dacron graft (NR details); \npolytetrafluoroethylene, Gore-\nTex (Amid type II), and other \ntype of mesh (NR) \n \nNR 43m (1m-17y) Efficacy \nSafety \n \nTimmons \n1992[59] \n163 58 (19-81) 163\/3 NR Abdominal (open) Sacrocolpopexy  Fascial lata (NR trade name); \npolyethylene  tetraphalate, \nMersilene (Amid type III) \nNR 33m (9m-18y) Safety  \n 40 \nAppendix 2  Sacrocolpoperineopexy: summary of patient characteristics and surgical procedures  \n \nID N Age, y Uterine\/\nvault \nPrimary\/ \nsecondary  \nIntervention route Technique  Mesh\/graft Concomitant procedure Follow up (mean) Outcomes  \nNon-randomised comparative studies \nVisco 2001 \n[31] \nA, 155 \nB, 88 \nC, 25 \nD, 5 \nA+B+C+D, 61 \n(31-84) \nNR NR A, abdominal \nB, abdominal \nC, vaginal+ abdominal \nD, vaginal+ abdominal \nA, sacrocolpopexy \nB, sacrocolpoperineopexy  \nC, sacrocolpoperineopexy \nD, sacrocolpoperineopexy \nwith mesh placed to vaginal \nfield \n \nA, polyethylene tetraphalate, \nMersilene (Amid type III) or \nGore-Tex (Amid type II) \nB, C, D, same as above \nAnti-incontinence: \nNR \nHysterectomy: \nA+B+C+D: 45\/273 \nA, 7m (1-87) \nB, 5m (1-45) \nC, 6m (1-28) \nD, 7m (2-11) \nSafety  \nCase series           \nSu \n2007[40,58] \n169 62 (10) 5\/164 NR Abdominal + vaginal Sacrocolpoperineopexy  Porcine dermis, Pelvicol; \ncadaveric fascia, Tutoplast; \npolypropylene, Gynemesh, \nProlite, or Prolene (all Amid \ntype I) \nAnti-incontinence: 155\/169 \nHysterectomy: 11\/169 \n14m (1.5-24) Efficacy \nSafety  \n \nNR: not reported \n 41 \nAppendix 3  Infracoccygeal sacropexy: summary of patient characteristics and surgical procedures \nID N Age, y Uterine\/ \nvault \nPrimary\/ \nsecondary \nIntervention \nroute \nTechnique  Mesh\/graft Anti-incontinence \nprocedures \nFollow up Outcomes  \nUTERINE           \nNon-randomised comparative studies \nNeuman 2007[27] A, 44 \nB, 35 \nA, 64 (13) \nB, 51 (10) \nA, 44\/0 \nB, 35\/0 \nNR A, vaginal \nB, vaginal \nA, hysterectomy + infracoccygeal \nsacropexy \nB, infracoccygeal sacropexy with \nuterus preservation \nNR Anti-incontinence: \nA, 9\/44; B, 6\/35 \nHysterectomy: \nA, 44\/44; B, 0\/35 \n30m (12-44) Efficacy \nSafety  \nCase series (n<100)          \nSivaslioglu 2005[56]  10 60 (7) 10\/0 NR Vaginal  Infracoccygeal sacropexy (presume \nuterus was preserved, as mean \noperation time was only 45min.) \nNR NR 16m (6) Efficacy \nSafety  \nVAULT           \nRCT (abs.)           \nMeschia 2005[14] A, 30 \nB, 30 \nNR A, 0\/30 \nB, 0\/30 \nNR A, vaginal \nB, vaginal \nA, infracoccygeal sacropexy \nB, sacrospinous fixation \nA, NR \nB, no mesh \nNR 24m Safety  \nCase series (n<100)          \nFarnsworth 2002[41] 93 65 (36-77) 0\/93 NR Vaginal  Infracoccygeal sacropexy \n \nPolypropylene tape (IVS Tunneller) \n \nNR 12m (2-24) Efficacy \nSafety  \nFoote 2007[43] \n \n52 64 0\/52 NR Vaginal  Infracoccygeal sacropexy Multifilament polypropylene (NR trade \nname) \n \n5\/52 20wk Safety  \nGhanbari 2006[44] \n \n15 67 (50-\n81)00 \n0\/15 NR Vaginal Infracoccygeal sacropexy Polypropylene tape (IVS Tunneller) \n \nNR NR Safety \nPetros 2001[53] 75 54 (40-74) 0\/75 NR Vaginal Infracoccygeal sacropexy \n \nNylon tape (NR trade name) NR 1-4.5y Efficacy \nSafety  \nSivaslioglu 2005[56] \n \n20 60 (7) 0\/20 NR Vaginal  Infracoccygeal sacropexy NR NR 16m (6) Efficacy \nSafety  \nUTERINE AND\/OR VAULT         \nRCT (abs.)           \nDe Tayrac 2006[15] A, 21 \nB, 20 \nNR NR NR A, vaginal \nB, vaginal \nA, infracoccygeal sacropexy \nB, unilateral sacrospinous suspension \nA, Tyco Healthcare \nB, no mesh \nHysterectomy was \nperformed as needed \nA, 11m (1.5-34) \nB, 16m (1.5-32) \nEfficacy \nSafety  \nCase series (n ≥100)           \nHefni 2007[45] 127 59 (9) 83\/44 NR Vaginal  Infracoccygeal sacropexy Multifilament polypropylene tape, IVS \nTunneller \n \nAnti-incontinence : \n8\/127 \nHysterectomy : 22\/127 \n14m (2-26) Efficacy \nSafety  \nVardy 2007[60] 286 \n(53 for \nefficacy) \n61 (14) NR NR Vaginal  Infracoccygeal sacropexy Multifilament polypropylene tape, IVS \nTunneller device (approved by FDA) \nAnti-incontinence: \n122\/186 \nHysterectomy : NR \n1y Efficacy \nSafety  \nCase series (n <100)           \nJordaan 2006[48] 8 NR NR NR Vaginal  Infracoccygeal sacropexy Absorbable and non-absorbable \ncombined mesh, polyproglactine and \nprolene 1 :1, Vypro \n \nNR 13m  Efficacy  \nOliver 2006[52] 14 73 (18) 7\/7 NR Vaginal  Modified infracoccygeal sacropexy \nwith uterine preservation \n \nPolypropylene tape, IVS Tunneller Anti-incontinence: NR \nHysterectomy: 3\/7 \nEfficacy: 6w \nSafety: 5m (2-11) \nSafety  \n 42 \nID N Age, y Uterine\/ \nvault \nPrimary\/ \nsecondary \nIntervention \nroute \nTechnique  Mesh\/graft Anti-incontinence \nprocedures \nFollow up Outcomes  \nPetros 2005[54] 67 65 (35-87) 23\/40 NR Vaginal  Tissue Fixation System posterior \nsling (a direct evolution of the \ninfracoccygeal sacropexy) \nPolypropylene, Tissue Fixation System \ndevice, approved by the Australian and \nEuropean Government regulatory \nbodies \n \nNR 9m (3-15) Safety  \nSentihes 2007[55] 44 66 (50-84) 24\/20 NR Vaginal  Non-absorbable hammock placement \nusing anterior trans-obturator and \nposterior infracoccygeal extensions \nPolyester, Parietex, then changed to \nmultifilament polypropylene, Surgipro, \nthen low-weight monofilament \npolypropylene, Ugytex \nAnti-incontinence: \n0\/44 \nHysterectomy: 24\/44 \n29m (9-47) Efficacy \nSafety  \n \n 43 \nAppendix 4  Uterine suspension sling: summary of patient characteristics and surgical procedures (uterine prolapse only)   \n \nID N Age, y Uterine\/\nvault \nPrimary\/ \nsecondary  \nIntervention route Technique  Mesh\/graft Concomitant procedure Follow up (mean) Outcomes  \nRCT           \nRoovers \n2004[12] \nA, 41 \nB, 41 \nA, 58 (9) \nB, 56 (11) \nA, 41\/0 \nB, 41\/0 \nNR A, abdominal \nB, vaginal \nA, sacrohysteropexy \nB, hysterectomy + anterior \nand\/or posterior colporrhaphy \nA, polypropylene, Gore-Tex \n(Amid type II) \nB, no mesh \nAnti-incontinence: \nA, 16\/41; B,11\/41 \nHysterectomy: \nA, 2\/41 (B was performed); B, \n41\/41  \n1y Efficacy \nSafety \n \nNon-randomised comparative studies \nCostantini \n2005[19] \nA, 36 \nB, 39 \nA, 61 (12) \nB, 62 (8) \nA, 36\/0 \nB, 39\/0 \nNR A, abdominal \nB, abdominal \nA, sacrohysteropexy \nB, hysterectomy + sacropexy \nA, polypropylene, Marlex \n(Amid type I) \nB, same as A \nAnti-incontinence: \nA, 28\/36; B, 30\/39 \nHysterectomy: \nA, 0\/36; B, 39\/39 \n51m (12-115) Efficacy \nSafety  \nCase series (n <100)          \nBanu 1997[33] 19 17-27 19\/0 NR Abdominal (open) Sacrohysteropexy  Polyester, Mersilene (Amid \ntype III) \nHysterectomy: 0\/19 3-5y Efficacy  \nSafety \n \nBarranger \n2003[34] \n30 35.7 (29-43) 30\/0 29\/1 Abdominal (open) Sacrohysteropexy  Polyester, Mersuture Anti-incontinence: 30\/30 \nHysterectomy: 0\/30 \nEfficacy: 44.5m (2-\n156); \nSafety: 94.6m (8-\n160) \n \nEfficacy \nSafety  \nLeron 2001[50] 13 39 (27-60) 13\/0 NR Abdominal (open) Sacrohysteropexy  Non-absorbable synthetic \nmesh, Teflon \nAnti-incontinence: 4\/13 \nHysterectomy: 0\/13 \n \n16m (4-49) Efficacy \nSafety  \nJoshi 1993[49] 20 27.5 (17-32) 20\/0 19\/1 Abdominal (open) Uterine suspension sling (uterus \nis suspended to the pectineal \nligaments) \nNon-absorbable synthetic \nmesh, Mersilene (Amid type \nIII) \nAnti-incontinence: 5\/20 \nHysterectomy: 0\/19 \n6-30m Efficacy \nSafety  \n \nNR: not reported \n \n \n \n 44 \nFigure S1 Summary of quality assessment of the RCTs (full text, n=5) \n0% 20% 40% 60% 80% 100%\nQ13. Experienced practitioner\nQ12. ITT or no w ithdraw s\/drop-outs after recruitment\nQ11. Withdraw als\/drop-outs unlikely to cause bias \nQ10. For continuous data, variability reported\nQ9. Patients blinded\nQ8. Outcome assessor blinded\nQ7. Mean follow -up ≥1y\nQ6. Treatments w ere similar betw een groups \nQ5. Intervention cleary defined\nQ4. Inclusion criteria clearly specif ied\nQ3. Similar baseline characteristics betw een groups\nQ2. Concealment of allocation\nQ1. Randomisation adequate\nYes\nNo\nUnclear\n \n \nFigure S2 Summary of quality assessment of the non-randomised comparative studies \n(n=17) \n0% 20% 40% 60% 80% 100%\nQ18. Analyses adjusted for confounding factors\nQ17. Important prognostic factors identif ied\nQ16. Follow -up similar betw een groups\nQ15. Withdraw als\/drop-outs unlikely to cause bias \nQ14. Information provided on non-respondents\/drop-outs\nQ13. Mean follow -up ≥1y\nQ12. Outcome assessor blinded\nQ11.Objective outcome measures used\nQ10. Important outcomes considered\nQ9. Appropriate treatment place\nQ8. Experienced practitioner\nQ7. Intervention clearly defined\nQ6. Similar baseline characteristics betw een groups\nQ5. Data collection w as undertaken prospectively\nQ4. Selection of patients w as consecutive\nQ3. Similar participant baseline characteristics\nQ2. Participant inclusion\/exclusion criteria described\nQ1. Participant representativeness\nYes\nNo\nUnclear\n 45 \nFigure S3 Summary of quality assessment of the case series (n=29) \n0% 20% 40% 60% 80% 100%\nQ17. Important prognostic factors identif ied\nQ15. Withdraw als\/drop-outs unlikely to cause bias \nQ14. Information provided on non-respondents\/drop-outs\nQ13. Mean follow -up ≥1y\nQ11.Objective outcome measures used\nQ10. Important outcomes considered\nQ9. Appropriate treatment place\nQ8. Experienced practitioner\nQ7. Intervention clearly defined\nQ5. Data collection w as undertaken prospectively\nQ4. Selection of patients w as consecutive\nQ3. Similar participant baseline characteristics\nQ2. Participant inclusion\/exclusion criteria described\nQ1. Participant representativeness\nYes\nNo\nUnclear\n \n \n \n \n \n \n \n"}