{"doi":"10.1080\/0968776960040106","coreId":"14346","oai":"oai:generic.eprints.org:197\/core5","identifiers":["oai:generic.eprints.org:197\/core5","10.1080\/0968776960040106"],"title":"Conversion of a mathematics course to CAL: A case study of a large‐scale rapid change of resources and organization","authors":["Pollock, Maggie","McAteer, Erica","Doughty, Gordon","Turner, Ian"],"enrichments":{"references":[{"id":201266,"title":"Bridge the gap with CALMAT',","authors":[],"date":"1994","doi":null,"raw":"Cook, J. (1994), 'Bridge the gap with CALMAT', Proceedings of the International Conference on Technology in Collegiate Mathematics, November 1994.","cites":null},{"id":201267,"title":"CALMAT mathematics courseware for access to higher education',","authors":[],"date":"1995","doi":null,"raw":"Cook, J. and Hornby, J. (1995), 'CALMAT mathematics courseware for access to higher education', Proceedings of the SMC Conference, Stirling, May 1995 (in press).","cites":null},{"id":201268,"title":"Reading the Sines, final report of the mid-term evaluation of the Transitional Mathematics\/Transmath Project,","authors":[],"date":"1995","doi":null,"raw":"Noss, R. (1995), Reading the Sines, final report of the mid-term evaluation of the Transitional Mathematics\/Transmath Project, Institute of Education, University of London.","cites":null},{"id":201269,"title":"Using CALMAT in &quot;levelling up&quot; teaching',","authors":[],"date":"1993","doi":null,"raw":"Tabor, J.H. (1993), 'Using CALMAT in &quot;levelling up&quot; teaching', CTI Quarterly Newsletter, 4 (1).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1996","abstract":"During 1994–95, first‐year maths for the BTechEd degree at the University of Glasgow was student‐centred, teacher‐supported A modular online maths course replaced a traditional, lecture‐based course. Students worked at their own pace, with timetabled and open access computer classes and\/or paper handbooks. The course was evaluated by open‐ended measures, and study of examination outcomes, providing us with some pedagogical questions and some recommendations for change. With some adaptation, and with important questions still open, the new course will continue to run","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14346.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/197\/1\/ALT_J_Vol4_No1_1996_Conversion%20of%20a%20mathematics%20co.pdf","pdfHashValue":"1ba8a5efa2006162ba4b63fef315e2acd1124d22","publisher":"Universit of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:197<\/identifier><datestamp>\n      2011-04-04T09:24:42Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/197\/<\/dc:relation><dc:title>\n        Conversion of a mathematics course to CAL: A case study of a large‐scale rapid change of resources and organization<\/dc:title><dc:creator>\n        Pollock, Maggie<\/dc:creator><dc:creator>\n        McAteer, Erica<\/dc:creator><dc:creator>\n        Doughty, Gordon<\/dc:creator><dc:creator>\n        Turner, Ian<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        During 1994–95, first‐year maths for the BTechEd degree at the University of Glasgow was student‐centred, teacher‐supported A modular online maths course replaced a traditional, lecture‐based course. Students worked at their own pace, with timetabled and open access computer classes and\/or paper handbooks. The course was evaluated by open‐ended measures, and study of examination outcomes, providing us with some pedagogical questions and some recommendations for change. With some adaptation, and with important questions still open, the new course will continue to run.<\/dc:description><dc:publisher>\n        Universit of Wales Press<\/dc:publisher><dc:date>\n        1996<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/197\/1\/ALT_J_Vol4_No1_1996_Conversion%20of%20a%20mathematics%20co.pdf<\/dc:identifier><dc:identifier>\n          Pollock, Maggie and McAteer, Erica and Doughty, Gordon and Turner, Ian  (1996) Conversion of a mathematics course to CAL: A case study of a large‐scale rapid change of resources and organization.  Association for Learning Technology Journal, 4 (1).  pp. 28-34.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776960040106<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/197\/","10.1080\/0968776960040106"],"year":1996,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Conversion of a mathematics course\nto CAL: a case study of a large-scale rapid change of\nresources and organization\nMaggie Pollock,* Erica McAteer,** Gordon Doughty* and Ian Turner*\n*Robert Clark Centre for Technological Education, University of Glasgow\n**Department of Psychology, University of Glasgow\nDuring 1994-95, first-year maths for the BTechEd degree at the University of Glasgow was student-\ncentred, teacher-supported A modular online maths course replaced a traditional, lecture-based course.\nStudents worked at their own pace, with timetabled and open access computer classes and\/or paper\nhandbooks. The course was evaluated by open-ended measures, and study of examination outcomes,\nproviding us with some pedagogical questions and some recommendations for change. With some\nadaptation, and with important questions still open, the new course will continue to run.\nBackground\nGlasgow University's Teaching With Independent Learning Technologies (TILT) project is an\ninstitutional initiative funded under Phase 1 of the Higher Education Funding Councils'\nTeaching and Learning Technology Programme (TLTP), We have developed or adapted and\nintegrated computer-assisted learning programs into a variety of courses in subjects ranging\nfrom Accountancy to Zoology.\nThis paper reports a complete change of learning resources and teaching strategies in a Faculty\nof Engineering course. Overcoming 'not invented here' resistance, we used an externally\nproduced program to deliver all maths teaching over a first-year class, and evaluated\neffectiveness for both teachers and students.\nThe course is for first-year students in the Faculty of Engineering taking the Bachelor of\nTechnological Education (BTechEd) concurrent initial teacher education degree, taught by the\nRobert Clark Centre for Technological Education in collaboration with St. Andrew's College,\nGlasgow. It produces school teachers of Technological Studies, Craft and Design and Graphic\nCommunication.\n28\nALT-} Volume 4 Number I\nProblems\nThe students vary widely in age and past experience, and in maths background. The 1994-95\ncohort entered with any of Scottish Higher 'A', 'B' or ' C \\ A-level (pass), HND, HNC, ONC,\nScottish Wider Access Programme, or SCOTVEC modules. Most qualifications were recent,\nbut some were years old.\nFor these students, the purpose of their maths learning is to acquire manipulative skills rather\nthan high theoretical understanding. The level aimed for approximates that of first-year\nengineers. Before 1992, the class was taught separately, with close co-operation between maths\nteachers and technology teachers. Then partnership changes and timetabling problems put the\nstudents in with 200 first-year engineers and spread the (lecture-based) course over two years.\nThe BTechEd students struggled, neglecting other subjects, and 29% (6 out of 21) failed the\ncourse and dropped out. Our teaching dilemma, ubiquitous in maths, was how to\nsimultaneously motivate the students by applying maths learning to real life problems of\nconcern to them, and help them to quickly gain the basic skills to do the necessary maths\nmanipulations almost automatically. In practice, students cycle between the two. The duration\nof a cycle may range from the few minutes required to tackle a real-life maths problem to\nseveral months' delay before an application to the maths skills learning emerges in another\ncourse.\nAlthough the joint class of 200 did cycle between theory, example and practice within the\nlecture period, our target students were not able to keep up with the manipulative skills. The\ndegree course organizers would have preferred to change to teaching all maths inside the\ntechnology courses, as and when needed, but could not get agreement from all course teachers.\nAn efficient and manageable alternative was needed urgently.\nSolution?\nWe designed a change to learning with long cycle times, providing the first year of a two-year\nmaths course on basic skills, and treating their application in other courses. Integration of the\ncycles would be provided by two of the authors, who also teach or organize several other\ncourses.\nWe bought in a computer-based maths course: CALMAT, developed by Jean Cook (Cook,\n1994, Cook and Hornby, 1995) and colleagues at Glasgow Caledonian University. This\nprovides 50 modules of drill and practice tutorial exercises, with self-assessment tests and a\nbuilt-in diagnostic examination. A handbook with paper exercises is provided as a supplement\n(or even alternative) to each module. Although DOS-based (a Windows version is under\ndevelopment), it has a clear and easy-to-use interface, has evolved over many years use in\nhigher-education institutions with students much like our own (Tabor, 1993), and is supported\nby a maths teaching team.\nWe felt that its pedagogy suited our objectives: to provide practical maths knowledge and\nskills, applicable in engineering and technology project work and beyond, when students are\nthemselves teaching in secondary-school classrooms. For practical as well as pedagogical\nreasons, we also needed to provide student-centred learning with independent study resources\nwhile being able to access diagnostic information to promote appropriate teacher support.\n29\nMoggie Pollock et 0\/ Rapid conversion of a mathematics course to CAL\nCourse procedure\nAt the beginning of the course, all students sat a diagnostic test of 20 multiple-choice\nquestions. This allowed individual programmes of work to be scheduled for the first term. A\nweekly three-hour (non-compulsory) class was timetabled in the computer laboratory for the\nyear's teaching period, which had at least one tutor present. Students were free to use the\ncomputer lab at other times during term or vacation, with teaching assistance available - often\non demand, but always by appointment Copies of the software could be purchased for home\nuse. No formal lectures or tutorials were run throughout the year, except to go over class-\nexamination outcomes. Two text books were recommended to complement coursework. A\nrepeat of the diagnostic test was taken by students at the end of term 1. During term 2, all\nstudents followed the same work programme (rather than individualized programmes), but at\ntheir own pace. 'Poor achievers', who reported themselves as falling behind schedule, were\ngiven extra tutor support.\nThe course was assessed by a degree examination half-way through the third term. Exemption\ncould be gained by students achieving an average of at least 60% by combining the results of\nthe two class examinations, held at the end of the first term and the beginning of the third term.\nA summer re-sit examination was also available.\nInformation from students\nComputer experience and attitudes\nMaths learning experience and attitudes\nConfidence about specific maths tasks\nCourse attitudes and experience\nSkills gain\nInformation from teachers\nAdvantages, disadvantages, questions\n- questionnaire\n— focus group\n— checklist\n- questionnaire\n— focus group\n- diagnostic test and exam marks\n- interviews\n- debriefing session\nTable I: Evaluation targets and methods\nEvaluation\nWith less than three evaluation staff, working across 20 sites, we could provide no more than a\nminimal evaluation of the course. Table 1 lists the information sought and the methods used.\nStudents' attitudes to computers, and their knowledge and experience of basic computing, were\nsurveyed. Feelings about learning maths and preferred teaching methods were addressed by\ninformal interviews and a focus-group meeting. Students' statements of confidence about\nspecific mathematical principles and practices, before and after working through relevant\nmodules, were gathered throughout the course. A 'task experience' questionnaire was\ncompleted by students during term 1, to get an idea of how the course was progressing from\ntheir point of view. At the end of the course, shortly before the examination, a second focus\nmeeting was held. The year's assessment grades were studied.\n30\nALT-J Volume 4 Number I\nTeaching staff, who had collaborated in both the planning and the implementation of the\nevaluation exercise, as well as in the interpretation of interim findings, were interviewed.\nEvaluation outcomes\nStudent perspective *\nTable 2 summarizes findings from questionnaires and interviews. Most of the students came\ninto the course computer-literate, in that 14 had had some training in computer use, either at\nschool or at college, with the software they had used ranging from MacWrite to C++. Most\nused a computer at least once a week. Modestly they stated themselves as 'novice' more often\nthan 'competent' - almost all said they had at least some confidence about using a computer.\nComputing experience\nAttitudes, practical knowledge\nConfidence with computers\nMaths Experience\nExperiences with maths learning\nConfidence about practical maths\nExperience of BTechEd course\nPositive\nNeutral\nNegative\n- high\n- middling to good\n- generally negative\n- increasing\nwith CALMAT\n- independent learning\n- own pace\n- immediate feedback\n- peer support\n- learning with computer\n- three-hour sessions\n— occasional incorrect feedback,\n- 'one method' teaching\n- need for tutorial support when 'losing it'\nTable 2: Student information summary\nStudents' attitudes to and basic knowledge of computers were surveyed (with permission) by\nquestions from a questionnaire developed by Queen's University, Belfast. Almost all attitudes\nwere positive, and almost all knowledge questions were answered correctly.\nTheir experience with maths learning was varied and, generally, negative. The main\nimpression was that it worried them. Lectures were definitely not favoured: 'Once you get\nbehind, you stay there', 'Two hours and aching fingers', were two students' views about\nlistening and note-taking, a third adding: 'You're concentrating on getting everything down,\nnot on taking it in'.\nQuestioned at the end of term 1, students' experience with CALMAT was positive, with some\n31\nMaggie Pollock et al Rapid conversion of a mathematics course to CAL\ncriticisms. The human-computer interaction presented no problems - except where they felt it\ngave them 'wrong' when it should not (an issue of decimal places), and when they could not\nretry a question without restarting a complete module. For the majority of students, three hours\n(with coffee break) at the computer screen was not a problem. However, for a few it was -\nthese students would spend some time at the machine, then work through paper exercises in the\nrelevant handbook: They very much liked the own-pace element, although there were still\nsome fears of 'getting lost' or falling behind. Students were encouraged (rather than required)\nto complete their recommended exercises to a schedule - by three-quarters of the way through\nthe term, many were behind on this. In general, they rated themselves more confident about\nmaths principles and practice as they went through the course, and most students actively\nliked the working environment, which they felt included a lot of peer support.\nTeacher perspective\nDiscussions with teachers during the course and afterwards showed them to be even more\npositive than the students. Table 3 summarizes the information. The feedback from the\nevaluation exercises fitted in with their own perceptions.\n• Importing established and supported software, in this case, has been very cost\neffective.\n• No time needed to prepare and deliver lectures.\n• Less stressful, allows support structures to be developed where needed rather than\nglobally.\n• Possible improvement in students' practical application of maths in other courses.\n• Intend to provide weekly tutorial sessions and support further 'peer' tutorials at\nneed.\n• Intend to closely monitor next year's project work for evidence of practical maths\nknowledge.\nTable 3: Teacher information summary\nInformation from diagnostic test and class-examination results\nThe first class-examination posed 40 multiple-choice questions and 10 standard problems.\nAmong the multiple-choice questions were the original 20 questions from the diagnostic test,\nto measure any improvement. The second class-examination set 10 problem-type questions.\nThe degree examination had the same format as the second class-examination. Table 4 gives an\noverview of the results.\nThe diagnostic post-test at the end of term 1 indicates some improvement in their skills - the\nrange is wide both before and after, and the central tendency is high. Ten students scored 70%\nor over at pre-test, so had little scope or need for improvement. Polynomials, equations of\nstraight lines, and trigonometry were all topics which showed a significant overall\nimprovement.\n32\nALT-J Volume 4 Number I\nDiagnostic test\n- significant overall improvement in scores\n- from high start 65% (range 30% to 85%)\n- at end of Term I 76% (range 40% to 100%)\n- better on some topics than others\n(e.g. improvement in algebra, co-ordinate geometry and trigonometry)\nClass exams\n- December multiple choice 69%\n- December open questions 36%\n(some students did not attempt these questions)\n- May open questions 38%\n. (five students obtained < 8%)\nExemptions\nI student with > 80%\n6 students with > 60%\nFirst year degree exam assessment grades '\nI student with £ 70%\nI students with > 60%\n3 students with > 50%\n4 students with > 45%\n5 students with < 35%\nResit Exams\nI student with £ 45%\n4 students with > 35%\nTable 4: Diagnostic test, class- and degree-examination outcomes\nWe are concerned about the outcomes for the 'open' questions - standard mathematical\nproblems which depend on knowledge of different topics covered in the course. We do not yet\nknow whether the material is not teaching, the learners are not learning, or the questions are\ninappropriate probes of their skills. It should be noted that the average in the May class-\nexamination included five students whose marks were below 8%. Without these marks, the\naverage would have been 48%.\nThe first-year degree examination outcomes were acceptable in that they were on a par with\nthe previous year. It is encouraging that, unlike findings elsewhere (Noss, 1995), entry\nqualifications were not direct predictors of grades. The top six had entered with a mixture of\nHighers, HNC and ONC, the lowest six with Highers, HNC, HND and Access.\nAlthough the assessment procedures, of necessity, differed from those for previous years, the\nsame external examiner's criteria had been satisfied. It is not, however, possible to make any\ndirect comparisons between the examination outcomes of 1994-95 and the previous year, apart\nfrom being encouraged that the number of failures after re-sits fell from six (after normative\n33\nMoggie Pollock et al Rapid conversion of a mathematics course to CAL\nscaling was applied to the raw marks) to four (out of 21) with no normative scaling. A good\nmeasure of their learning will be their competence and progress during next year's courses —\nelectronics, energy, design, etc. - where much of their work will depend upon maths 'fluency'.\nThe best predictor of examination performance was the post-test diagnostic scores - those who\ncame out best on this at the end of term 1 got the best degree grades, those at the bottom end\nstayed there.\nConclusions\nChanging the first-year maths course to student-centred, self-paced learning using a CAL\npackage, plus supplementary written material and textbooks, has been shown to be no worse\nthan if the course were delivered using traditional lectures, and in fact was preferred by both\nthe students and lecturers. The students responded well to self-paced learning and peer self-\n• help groups developed spontaneously. Staff found it less stressful to supervise the computer\nlabs than to prepare and deliver lectures. They could devote more time to those students who\nwere slow and struggling with the work.\nEvery effort will be made to identify earlier those students who are having difficulty. We\nintend to improve the learning of these students with the second year of the new course. We\nare planning fortnightly tutorial classes, led by 'demand issues' and supported by some peer\ntutoring. We also intend a closer monitoring of students' progress through the modules, though\ninterfering as little as possible with the student-centred, own-pace independent-learning model,\nwhich we feel is right for these students.\nReferences\nCook, J. (1994), 'Bridge the gap with CALMAT', Proceedings of the International Conference\non Technology in Collegiate Mathematics, November 1994.\nCook, J. and Hornby, J. (1995), 'CALMAT mathematics courseware for access to higher\neducation', Proceedings of the SMC Conference, Stirling, May 1995 (in press).\nNoss, R. (1995), Reading the Sines, final report of the mid-term evaluation of the Transitional\nMathematics\/Transmath Project, Institute of Education, University of London.\nTabor, J.H. (1993), 'Using CALMAT in \"levelling up\" teaching', CTI Quarterly Newsletter, 4\n(1).\n34\n"}