{"doi":"10.1080\/0968776020100101","coreId":"14237","oai":"oai:generic.eprints.org:363\/core5","identifiers":["oai:generic.eprints.org:363\/core5","10.1080\/0968776020100101"],"title":"Editorial: Letting go of the old and embracing the new","authors":["Seale, Jane","Haywood, Jeff","Mogey, Nora"],"enrichments":{"references":[{"id":198376,"title":"The importance of &quot;goodness of fit&quot; between organizational culture and climate in the management of change: a case study in the development of online learning',","authors":[],"date":"2001","doi":"10.1080\/09687760108656777","raw":"McMurray, D. W. (2001), 'The importance of &quot;goodness of fit&quot; between organizational culture and climate in the management of change: a case study in the development of online learning', Association for Learning Technology Journal, 9 (1), 73-83.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14237.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/363\/1\/ALT_J_Vol10_No1_2002_Editorial_%20Letting%20go%20of%20the%20o.pdf","pdfHashValue":"072f0045245100c4816e9da25d424c0b31fd28fa","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:363<\/identifier><datestamp>\n      2011-04-04T09:12:45Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/363\/<\/dc:relation><dc:title>\n        Editorial: Letting go of the old and embracing the new<\/dc:title><dc:creator>\n        Seale, Jane<\/dc:creator><dc:creator>\n        Haywood, Jeff<\/dc:creator><dc:creator>\n        Mogey, Nora<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2002<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/363\/1\/ALT_J_Vol10_No1_2002_Editorial_%20Letting%20go%20of%20the%20o.pdf<\/dc:identifier><dc:identifier>\n          Seale, Jane and Haywood, Jeff and Mogey, Nora  (2002) Editorial: Letting go of the old and embracing the new.  Association for Learning Technology Journal, 10 (1).  pp. 2-4.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776020100101<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/363\/","10.1080\/0968776020100101"],"year":2002,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Editorial\nLetting go of the old and embracing the new\nChange... is not a one-step process, for academics, but one that sees them in transition,\nas they let go of the old and prepare to embrace the new. A key question that needs to\nbe asked is: How much of the past do they need to let go in order to embrace the future?\n(McMurray,2001:80)\nA major focus of the research and practice in the field of Learning Technology is\nimplementing and developing learning technologies in order to change or influence the\nstudent learning experience. We are all aware, however, that the process of developing or\nimplementing learning technologies often requires adaptation or changes in staff roles and\nskills, in organizational culture and structures, in strategies and policies, in attitudes and\nperceptions as in well as the theories and models we use to explain and understand the\nlearning and teaching experience. In this issue of ALT-J we present ten papers. On first\nreading these papers represent quite an eclectic mixture of subjects and methods: a closer\ninspection, however, reveals a common theme that runs through all the papers, that of\nchange. Linked to this theme are notions of evolution, innovation and experimentation.\nThe first two papers present a commentary on a paper published in a previous edition of\nALT-J. The following six papers were presented at the ALT-C annual conference entitled\n'Changing Learning Environments' in Edinburgh last year, while the final two papers\nreport on the results of two different evaluation studies.\nThe papers by Conole et al., by Davis and Denning, and by Wise represent an attempt to\ndevelop the relationship between ALT-J authors and readers and facilitate a more\ninteractive and perhaps reflective dialogue between the two parties. Conole, Oliver and\nSeale summarize readers' comments on an article by Davis and Denning published in issue\n9.2 of this journal entitled 'Almost as helpful as good theory: some conceptual possibilities\nfor the online classroom'. This is followed by a response from Davis and Denning who\n2\nALT-J Volume 10 Number I\nremark that 'some of the comments made by readers have indicated a way forward'. Wise\ndescribes a program he has written using Javascript that is designed to help life sciences\nstudents prepare a research protocol. In an attempt to engage with ALT-J readers, he has\nmade the program available on the Web and invites comments and suggestions from ALT-J\nreaders for 'future collaborative research'.\nThe notion of change through meaningful dialogue is also highlighted in the papers by\nMcAvinia and by Lockyer et al. McAvinia describes two approaches to the design and\ndelivery of Web-based key skills resources: the central resource and customized,\nindividualized sets of departmental pages. McAvinia argues that the adaptation of the\ncentralized key skills resources to departmental contexts is not simply a question of\nchanging the packaging or 're-branding' them. It requires a meaningful dialogue with\nmembers of the department in order to produce a product that has contextual relevance for\nstudents. Lockyer, Patterson, Rowland and Hearne describe a small pilot study, which used\nasynchronous Web-based communication tools with student teachers in Australia to\nfacilitate mentoring and peer support during teaching placements. The study found that\nwhile students seemed comfortable using the online peer support, they were not as\n'reflective' as the authors had hoped they would be. In considering the implications of their\nfindings Lockyer et al. conclude that changing students' descriptions of teaching\nexperience into reflections on teaching experience may be achieved by 'preparing both the\nstudents and the lecturers to identify the difference between a reflective and descriptive\nposting and developing strategies to support reflection'.\nThe papers by Riley and Gunn et al. use knowledge gained from theory and practice in\norder to develop our understanding or use of learning technology. The paper by Gunn,\nFrench, Macleod, McSporran and Conole combines literature review, case studies and\nfeedback from discussion groups held at ALT-C to offer a range of interpretations for the\nunderlying causes and implications of gender differences in computer-supported learning.\nThe paper seeks to change and move our understanding of gender differences beyond\nconsidering differences in computer access and skills and challenges us to think about\nwhether it is possible to change the computer-supported learning environments available to\nstudents so that they offer more 'widely applicable solutions' to the gender issues\nidentified. The paper by Riley outlines the concept and theoretical underpinnings of\n'virtual culture' and explores how it might be developed to evaluate the 'innovative'\npotential of learning technologies in tertiary education. The notion of 'virtual culture' was\nfirst conceived to explain human cultural evolution, but Riley develops and applies the\nconcept to learning technologies by proposing four criteria by which they can be evaluated\nfor their 'virtual culture potential'.\nFoster-Jones and Beazleigh, in their paper, describe two Open University metadata projects\nin order to illustrate how they have tried to apply the IMS Object metadata scheme. In\ndiscussing the implications of their experiences for future work they argue that 'it is crucial\nthat we invest our efforts and resources in this development phase so that we can contribute\nto the evolution of metadata standards, using our experiences to create one that best suits\nour needs'.\nFiddes et al. and Duffy et al. present two experimental studies that attempt to further our\nknowledge of how student performance in computer-based learning environments\n3\nEditorial\ncompares with that in non-computer-based environments. Fiddes, Korabinski, McGuire,\nYoungson and McMillan present results from an experiment that sets out to compare\nsecondary students' mathematical performance in a computer-based examination with that\nin a paper-based examination. The experiment was specifically designed to examine the\neffect of two variables: rewording and medium. A major conclusion drawn from the project\nis that the assessment medium had no effect on student marks. Duffy, Gilbert, Kennedy\nand Poon Wai Kwong present a comparison of assessment results achieved by distance\nlearning students and classroom-based students undertaking the same module in a Health\nStudies degree course. Through a comparison of assessment results the authors found that\nstudents studying by distance learning obtained significantly higher end-of-module results\nthan their classroom-based colleagues. The challenge faced by the authors of both papers\nis to use their results to build on the research of the previous decade in order to develop\nnew ways of interpreting them.\nThe ten papers in this issue have all addressed in some way issues of change, evolution,\ninnovation or experimentation. Whilst the papers offer us new ways of conceptualizing or\nunderstanding our practice they do not encourage us to let go of the old in order to\nembrace the new. They encourage us to use what we know or have experienced already in\norder to explore or investigate (with others where appropriate) what might be possible in\nthe future. In answer to the question posed by McMurray, 'How much of the past do they\nneed to let go in order to embrace the future?', the answer is not all of it. Whilst transition\ndoes involve a passing from one place to another, the bridge to the future needs a firm\nfoundation in our past experiences.\nJane Seale, Deputy Editor ALT-J\nJeff Haywood, ALT-C 2001 Organizing Committee, University of Edinburgh\nNora Mogey, ALT-C 2001 Organizing Committee, University of Edinburgh\nReference\nMcMurray, D. W. (2001), 'The importance of \"goodness of fit\" between organizational\nculture and climate in the management of change: a case study in the development of\nonline learning', Association for Learning Technology Journal, 9 (1), 73-83.\n4\n"}