{"doi":"10.1007\/s11633-010-0514-8","coreId":"177340","oai":"oai:aura.abdn.ac.uk:2164\/2142","identifiers":["oai:aura.abdn.ac.uk:2164\/2142","10.1007\/s11633-010-0514-8"],"title":"Modelling and remote control of an excavator","authors":["Liu, Yang","Hasan, Mohammed Shahidul","Yu, Hong-Nian"],"enrichments":{"references":[{"id":5647,"title":"A low-cost solution for excavator simulation with realistic visual effect,&quot; presented at the IEEE Conf. on Robotics, Automation and Mechatronics,","authors":[],"date":"2008","doi":"10.1109\/RAMECH.2008.4681325","raw":"N. Tao, D. Zhao, H. Yamada, and N. Shui, &quot;A low-cost solution for excavator simulation with realistic visual effect,&quot; presented at the IEEE Conf. on Robotics, Automation and Mechatronics, 2008.","cites":null},{"id":5646,"title":"A virtual excavator for controller development and evaluation,&quot; presented at the","authors":[],"date":"1998","doi":"10.1109\/37.806913","raw":"S. P. Dimaio, S. E. Salcudean, C. Reboulet, S. Tafazoli, and K. H. Zaad, &quot;A virtual excavator for controller development and evaluation,&quot; presented at the IEEE Int. Conf. on Robotics and Automation, 1998.","cites":null},{"id":5643,"title":"An autonomous excavator with vision-based track-slippage control,&quot;","authors":[],"date":"2005","doi":"10.1109\/TCST.2004.838551","raw":"P. Saeedi, P. D. Lawrence, D. G. Lowe, J. P., D. Kusalovic, K. Ardron, and P. H. Sorensen, &quot;An autonomous excavator with vision-based track-slippage control,&quot; IEEE Trans. on Control Systems Technology, vol. 13, no. 1, pp. 67-84, 2005.","cites":null},{"id":5644,"title":"Application of force feedback to heavy duty hydraulic machines,&quot; presented at the","authors":[],"date":"1993","doi":"10.1109\/robot.1993.292010","raw":"N. R. Parker, S. E. Salcudean, and P. D. Lawrence, &quot;Application of force feedback to heavy duty hydraulic machines,&quot; presented at the IEEE Conf. on Robotics and Automation, Atlanta, USA, 1993.","cites":null},{"id":5653,"title":"Cosimulation of wireless networked control systems over mobile ad hoc network using SIMULINK and OPNET,&quot;","authors":[],"date":"2009","doi":"10.1049\/iet-com.2008.0536","raw":"M. S. Hasan, H. Yu, A. Carrington, and T. C. Yang, &quot;Cosimulation of wireless networked control systems over mobile ad hoc network using SIMULINK and OPNET,&quot; the Journal of IET Communications, vol. 3, no. 8, pp. 1297-1310, 2009.","cites":null},{"id":5633,"title":"Dynamic model of excavator,&quot;","authors":[],"date":"1993","doi":"10.1061\/(ASCE)0893-1321(1993)6:2(148)","raw":null,"cites":null},{"id":5635,"title":"Identification of inertial and friction parameters for excavator arms,&quot;","authors":[],"date":"1999","doi":"10.1109\/70.795801","raw":"S. Tafazoli, P. D. Lawrence, and S. E. Salcudean, &quot;Identification of inertial and friction parameters for excavator arms,&quot; IEEE Trans. on Robotics and Automation, vol. 15, no. 5, pp. 966-971, 1999.","cites":null},{"id":5636,"title":"Identification Schemes for Unmanned Excavator Arm Parameters,&quot;","authors":[],"date":"2008","doi":"10.1007\/s11633-008-0185-x","raw":"Y. H. Zweiri, &quot;Identification Schemes for Unmanned Excavator Arm Parameters,&quot; Int. J. Automation and Computing, vol. 05, no. 2, pp. 185-192, 2008.","cites":null},{"id":5640,"title":"Impedance control of a hydraulically-actuated robotic excavator,&quot;","authors":[],"date":"2000","doi":"10.1016\/S0926-5805(00)00056-X","raw":"Q. P. Ha, Q. H. Nguyen, D. C. Rye, and H. F. DurrantWhyte, &quot;Impedance control of a hydraulically-actuated robotic excavator,&quot; Automat. Construction, vol. 9, no. 5, pp. 421-435, 2000.","cites":null},{"id":5638,"title":"Impedance control of a teleoperated excavator,&quot;","authors":[],"date":"2002","doi":"10.1109\/87.998021","raw":"S. Tafazoli, Salcudean, S. E., Hashtrudi-Zaad, K., and Lawrence, P. D., &quot;Impedance control of a teleoperated excavator,&quot; IEEE Trans. on Control Systems Technology, vol. 10, no. 3, pp. 355-367, 2002.","cites":null},{"id":5654,"title":"Interactive co-simulation of MATLAB and OPNET for Networked Control Systems,&quot;","authors":[],"date":"2007","doi":"10.1109\/ICNSC.2007.372865","raw":"M. S. Hasan, H. Yu, A. Griffiths, and T. C. Yang, &quot;Interactive co-simulation of MATLAB and OPNET for Networked Control Systems,&quot; presented at the 13th International Conference on Automation and Computing, Stafford, UK, pp. 237-242, 2007.","cites":null},{"id":5632,"title":"Kinematics of excavators (backhoes) for transferring surface material,&quot;","authors":[],"date":"1994","doi":"10.1061\/(ASCE)0893-1321(1994)7:1(17)","raw":"A. J. Koivo, &quot;Kinematics of excavators (backhoes) for transferring surface material,&quot; J. Aerosp. Eng, vol. 7, no. 1, pp. 17-32, 1994.","cites":null},{"id":5652,"title":"Machines for Earthmoving Work: Theory and Calculations:","authors":[],"date":"1986","doi":null,"raw":"T. V. Alekseeva, K. A. Artem’ev, A. A. Bromberg, R. L. Voitsekhovskii, and N. A. Ul’yanov, Machines for Earthmoving Work: Theory and Calculations: Rotterdam : A.A. Balkema, 1986.","cites":null},{"id":5634,"title":"Modelling and control of excavator dynamics during digging operation,&quot;","authors":[],"date":"1996","doi":"10.1061\/(ASCE)0893-1321(1996)9:1(10)","raw":"A. J. Koivo, M. Thoma, E. Kocaoglan, and J. AndradeCetto, &quot;Modelling and control of excavator dynamics during digging operation,&quot; J. Aerosp. Eng., vol. 9, no. 1, pp. 10-18, 1996.","cites":null},{"id":5641,"title":"Motion and path control for robotic excavation,&quot;","authors":[],"date":"1993","doi":"10.1061\/(ASCE)0893-1321(1993)6:1(1)","raw":"L. E. Bernold, &quot;Motion and path control for robotic excavation,&quot; J. Aerosp. Eng., vol. 6, no. 1, pp. 1-18, 1993.","cites":null},{"id":5649,"title":"Nonlinear Motion Control of Mobile Robot Dynamic Model,&quot; in Mobile Robots Motion Planning,","authors":[],"date":"2008","doi":"10.1109\/ICIT.2006.372707","raw":"J. Velagic, B. Lacevic, and N. Osmic, &quot;Nonlinear Motion Control of Mobile Robot Dynamic Model,&quot; in Mobile Robots Motion Planning, New Challenges. Vienna: Advanced Robotic System International, 2008, pp. 531-552.","cites":null},{"id":5637,"title":"Online soil parameter estimation scheme based on Newton-raphson method for autonomous excavation,&quot;","authors":[],"date":"2005","doi":"10.1109\/TMECH.2005.844706","raw":"C. P. Tan, Y. H. Zweiri, K. Althoefer, and L. D. Seneviratne, &quot;Online soil parameter estimation scheme based on Newton-raphson method for autonomous excavation,&quot; IEEE\/ASME Trans. on Mechatronics, vol. 10, no. 2, pp. 221-229, 2005.","cites":null},{"id":5650,"title":"Reduction of Control Torques of Mobile Robot Using Hybrid Nonlinear Position Controller,&quot; presented at","authors":[],"date":"2005","doi":"10.1109\/eurcon.2005.1629924","raw":"B. Lacevic, J. Velagic, and B. Perunicic, &quot;Reduction of Control Torques of Mobile Robot Using Hybrid Nonlinear Position Controller,&quot; presented at the International Conference on Computer as a Tool, EUROCON 2005, Serbia & Montenegro, Belgrade, pp. 314-317, 2005.","cites":null},{"id":5645,"title":"Remote control of excavator with designed haptic device,&quot; presented at the Int.","authors":[],"date":"2008","doi":"10.1109\/ICCAS.2008.4694397","raw":"D. Kim, K. W. Oh, D. Hong, J. Park, and S. Hong, &quot;Remote control of excavator with designed haptic device,&quot; presented at the Int. Conf. on Control, Automation and Systems, Seoul, Korea, 2008.","cites":null},{"id":5631,"title":"Review of modelling and remote control for excavators,&quot;","authors":[],"date":"2009","doi":"10.1504\/IJAMECHS.2010.030850","raw":"H. Yu, Y. Liu, and M. S. Hasan, &quot;Review of modelling and remote control for excavators,&quot; International Journal of Advanced Mechatronic Systems (accepted for publication), vol. 2, no. 1\/2, 2009.","cites":null},{"id":5651,"title":"Robust combined adaptive and variable structure adaptive control of robot manipulators,&quot;","authors":[],"date":"1998","doi":"10.1017\/S0263574798000563","raw":"H. Yu, &quot;Robust combined adaptive and variable structure adaptive control of robot manipulators,&quot; Robotica, vol. 16, pp. 623-650, 1998.","cites":null},{"id":5639,"title":"Robust impedance control and force regulation: theory and experiment,&quot;","authors":[],"date":"1995","doi":"10.1177\/027836499501400303","raw":"Z. Lu and A. A. Goldenberg, &quot;Robust impedance control and force regulation: theory and experiment,&quot; Int. J. Robotic. Res., vol. 14, no. 3, pp. 225-254, 1995.","cites":null},{"id":5642,"title":"Synthesis of tactical plans for robotic excavation,&quot; in Robot.","authors":[],"date":"1995","doi":null,"raw":"S. Singh, &quot;Synthesis of tactical plans for robotic excavation,&quot; in Robot. Inst., PhD thesis, Carnegie Mellon University, Pittsburgh, PA, USA, 1995.","cites":null},{"id":5648,"title":"The analysis of excavator operation by skilful operator,&quot; presented at the SICE Annual Conf.,","authors":[],"date":"2008","doi":"10.1109\/SICE.2008.4654714","raw":"Y. Sakaida, D. Chugo, H. Yamamoto, and H. Asama, &quot;The analysis of excavator operation by skilful operator,&quot; presented at the SICE Annual Conf., Japan, 2008.","cites":null},{"id":5655,"title":"The Ns Manual (formerly ns","authors":[],"date":null,"doi":null,"raw":"K. Fall and K. Varadhan, &quot;The Ns Manual (formerly ns","cites":null},{"id":6018612,"title":"V a h a a n d M . J . S k ibniewski, &quot;Dynamic model of excavator,&quot;","authors":[],"date":"1993","doi":null,"raw":"P .  K .  V a h a  a n d  M .  J .  S k ibniewski, &quot;Dynamic model of excavator,&quot; J. Aerosp. Eng., vol. 6,  pp. 148-158, 1993.","cites":null}],"documentType":{"type":1}},"contributors":["University of Aberdeen, School of Engineering"],"datePublished":"01-08-20","abstract":"Peer reviewedPostprin","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:aura.abdn.ac.uk:2164\/2142<\/identifier><datestamp>\n                2018-01-02T00:05:07Z<\/datestamp><setSpec>\n                com_2164_677<\/setSpec><setSpec>\n                com_2164_371<\/setSpec><setSpec>\n                com_2164_331<\/setSpec><setSpec>\n                com_2164_705<\/setSpec><setSpec>\n                col_2164_678<\/setSpec><setSpec>\n                col_2164_706<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nModelling and remote control of an excavator<\/dc:title><dc:creator>\nLiu, Yang<\/dc:creator><dc:creator>\nHasan, Mohammed Shahidul<\/dc:creator><dc:creator>\nYu, Hong-Nian<\/dc:creator><dc:contributor>\nUniversity of Aberdeen, School of Engineering<\/dc:contributor><dc:subject>\nexcavator<\/dc:subject><dc:subject>\nremote control<\/dc:subject><dc:subject>\nmechatronics<\/dc:subject><dc:subject>\nmodelling<\/dc:subject><dc:subject>\nTJ Mechanical engineering and machinery<\/dc:subject><dc:subject>\nTJ<\/dc:subject><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPostprint<\/dc:description><dc:date>\n2011-10-10T15:03:09Z<\/dc:date><dc:date>\n2011-10-10T15:03:09Z<\/dc:date><dc:date>\n2010-08<\/dc:date><dc:date>\n01-08-20<\/dc:date><dc:type>\nJournal article<\/dc:type><dc:identifier>\nLiu , Y , Hasan , M S & Yu , H-N 2010 , ' Modelling and remote control of an excavator ' International Journal of Automation and Computing , vol 7 , no. 3 , pp. 349-358 . DOI: 10.1007\/s11633-010-0514-8<\/dc:identifier><dc:identifier>\n1476-8186<\/dc:identifier><dc:identifier>\nPURE: 4944391<\/dc:identifier><dc:identifier>\nPURE UUID: 0641a585-e4e9-45b6-bc86-84ee47c7b85b<\/dc:identifier><dc:identifier>\nScopus: 77955803542<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2164\/2142<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.1007\/s11633-010-0514-8<\/dc:identifier><dc:language>\neng<\/dc:language><dc:relation>\nInternational Journal of Automation and Computing<\/dc:relation><dc:rights>\nThe original publication is available at www.springerlink.com<\/dc:rights><dc:format>\n10<\/dc:format>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["1476-8186","issn:1476-8186"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["International Journal of Automation and Computing"],"year":1,"topics":["excavator","remote control","mechatronics","modelling","TJ Mechanical engineering and machinery","TJ"],"subject":["Journal article"],"fullText":"Modelling and Remote Control of an Excavator \nYang Liu, Mohammad S Hasan, and Hongnian Yu \nFaculty of Computing, Engineering and Technology, Staffordshire University, Stafford, UK, ST18 0AD \n{y.liu, m.s.hasan, h.yu}@staffs.ac.uk \n \nAbstract—This paper reposts the results of an on-going \nproject and investigates modelling and remote control issues \nof an industry excavator. The details of modelling, \ncommunication and control of a remotely controllable \nexcavator are studied. The paper mainly focuses on \ntrajectory tracking control of the excavator base and robust \ncontrol of the excavator arm. These will provide the \nfundamental base for our next research step. In addition, \nextensive simulation results for trajectory tracking of the \nexcavator base and robust control of the excavator arm are \ngiven. Finally, conclusions and further work have been \nidentified. \nKeywords – excavator; remote control; mechatronics; \nmodelling \nI.  INTRODUCTION \nRemote control of an excavator plays a significant role \nin real-life applications, such as nuclear decommissioning, \nbuilding demolition, military operations and rescue \nmissions, etc. The advantage of remote control is that it \nallows the operator to control the machine in a remote safe \nenvironment via the wired\/wireless network. In order to \ncarry out a specific task, there are two subtasks for an \nexcavator. Firstly, the excavator has to find a feasible path \nfrom its initial location to the destination. Secondly, a \nrobust control approach has to be designed to execute the \ndesired excavation tasks. According to these requirements, \nwe proposed a framework of remote control of an \nexcavator in [1].  This paper further expands the work \nconducted in [1] in the following aspects: 1) modelling of \nthe excavator base; 2) control of the excavator base; 3) \nrobust control of the excavator arm; 4) remote control of \nthe excavator base. \nBased on the earlier work, implementation of a \nremote-control excavator mainly focused on modelling \nand control of the machine. The modelling work includes \nkinematic [2] and dynamic [3] modelling, modelling of \ninteraction between the machine and the environment [4] \nand parameter identification [5][6][7]. The key reason for \nmodelling and parameter identification during the digging \noperation is to provide online parameters for the real-time \nmonitoring and remote control. In [5], a novel approach \nfor experimental determination of the joint parameters and \nfriction coefficients was developed on the excavator arm. \nZweiri et al. [6] presented another robust, fast, and simple \ntechnique for the experimental identification of the joint \nparameters and friction coefficients of a full-scale \nexcavator arm. Furthermore, an online soil parameter \nestimation scheme was proposed in [7]. During the earlier \nstage of excavation control, impedance control was \nconsidered as a prevalent robust control approach to \nachieve compliant motion in contact tasks. In [8], a \nposition-based impedance controller was presented on \nvarious contact experiments by using an instrumented \nmini-excavator. Details of robust impedance control for a \nhydraulic excavator have been presented in [9][10].  \nIn contrast to control of the excavator arm, motion \ncontrol and path planning for the excavator base have also \nbeen studied in a number of research papers [11][12]. In \n[13], a vision-based control system for a tracked excavator \nwas presented. The system includes several controllers \nthat collaborate to move the excavator from a starting \nposition to a goal position. Furthermore, a number of \nresearchers have investigated the feasibility of remote-\ncontrol excavation. Many of these studies have addressed \nthe possible use of the remote control approach on the \nexcavator [1][8]. However, in a remote-control excavator \nsystem, if the operator cannot sense the condition of \ncontact, the work efficiency will decrease in comparison \nto direct control by the human operator. So, design of the \njoystick with proper force feedback [14][15] is key to \ncontrolling an excavator remotely.  The joystick can make \nskilful operators adapt their operation to the excavating \nenvironment based on their empirical knowledge, and can \nfurther realize efficient excavation. Moreover, in contrast \nto controlling a real hydraulic excavator, there are many \nstudies which implement their work on the virtual \nexcavator [16][17].  The virtual excavator system appears \nto be a low-cost, safe, and reliable system that can be used \nto test both the system and the control strategy in a virtual \nenvironment. \nAs discussed above, many research studies have \nfocused on the modelling and controller development \nstages, but there is less literature studying the remote \noperation from a network communication point of view. \nFurthermore, it is found that efficiency of excavation by a \nhuman operator  [18] is a notable issue that has potential \ncommercial value. On the other hand, a remote-control \nexcavator has been the wish of both industry and \nmanufacturing over the past two decades. Much of the \nwork on terrestrial excavation has focused on tele-\noperation, rather than on the system requirements for \nautonomous operation. However, although remarkable \nand valuable progress has been made on automated \nexcavation, remote control of a full-scale excavator has \nnot been commercially demonstrated. \nIn this paper, we will report the further development \nbased on the work in [1] and will focus on the work from \nthe following two aspects: 1) trajectory tracking control of \nthe excavator base and 2) robust control of the excavator \narm. Section II studies the models of the excavator base \nand the excavator arm. Those models will provide the \nbasis for the system design, development of the \ncontrollers, task\/path planning, simulation, and validation, \netc. Section III investigates the control approaches for \ncontrolling the excavator base and the excavator arm. \nSection IV proposes a wireless networked control scheme \nfor the excavator base. Finally, the conclusions and future \nwork are given in section V. \nII. MODELLING OF AN EXCAVATOR \nA. Modelling of the excavator base \nThe excavator base model is taken from [19] and [20]. \nIt has two driving wheels and a free rotating front wheel. \nTwo wheels are independently driven by actuators to \nproduce transition and orientation. The excavator base \nmodel is shown in Figure 1, and the parameters are given \nin Appendix. The centre of mass and the centre of the \nexcavator base gear are represented by points C and A, \nrespectively. \n2r\nX\nY\nx\ny\nA\nC\nv\nd\nxm\nym\nO\nθc\n \nFigure 1 The excavator base model for position control given in [19] \nand [20]. \nThe kinematic model of the excavator base is \npresented as below. \n θθθ cos)(\n2 LRA\nrx &&& +=  (1) \n θθθ sin)(\n2 LRA\nry &&& +=  (2) \n Rr LRc 2)( θθθ &&& −=\n \n(3) \nThe dynamic model of the excavator base is expressed \nas follows.  \n ccc qCqD τ=+ &&&  (4) \nwhere  \n⎥⎦\n⎤⎢⎣\n⎡=\nL\nRq θ\nθ , ⎥⎦\n⎤⎢⎣\n⎡=\nAB\nBA\nDc , ⎥⎦\n⎤⎢⎣\n⎡=\n0\n0\nK\nK\nCc , ⎥⎦\n⎤⎢⎣\n⎡=\nL\nR\nc τ\nττ  \n02\n222\n4\n)(\n4\nI\nR\nrMdIMrA A +++=   \n2\n222\n4\n)(\n4 R\nrMdIMrB A +−=   \nand K=A\/2.   \nB. Modelling of the excavator arm \nThe dynamic model of the excavator can be expressed \nconcisely using the form of the well-known rigid-link \nmanipulator equations of motion [21]: \n Laaaaa FBGCD −=+++ τΓθθθθθθθ )()(),()( &&&&&  (5) \nwhere [ ]T4321 θθθθθ =  is the vector of measured \njoint angles as defined in Figure 2; Da(θ) represents \ninertia; ),( θθ &aC  represents Coriolis and centripetal effects; \nGa(θ) represents gravity forces; )(θ&aB  represents frictions; \nΓ is the corresponding input matrix; vector τa=[τ1 τ2 τ3 τ4]T \nspecifies the torques acting on the joint shafts; FL \nrepresents the interactive torques between the bucket and \nthe environment during the digging operation. \n \nFigure 2 Schematic diagram of an excavator [4] \nAccording to [4], Da(θ), ),( θθ &aC , Ga(θ), Γ, and FL are \ngiven by the following expression: \n \n⎥⎥\n⎥⎥\n⎦\n⎤\n⎢⎢\n⎢⎢\n⎣\n⎡\n=\n44434241\n34333231\n24232221\n14131211\n)(\nDDDD\nDDDD\nDDDD\nDDDD\nDa θ  (6) \nwhere \n2\n444 rMID bubu +=  \n)]cos(2[ 4443\n2\n3\n2\n34433 αθ +++++= raaMrMIDD bustst  \n)]cos(22[\n)]cos(2[\n43442332\n2\n2\n3332\n2\n2\n2\n23322\nαθ\nαθ\n++++\n+++++=\nracaaaM\nraaMrMIDD\nbu\nstbobo\n \n)cos( 4443444334 αθ ++== raMDDD bu  \n)cos( 43442344224 αθ ++== raMDDD bu  \n)]cos([\n)]cos([\n4443332\n2\n3\n3332\n2\n3243223\nαθ\nαθ\n++++\n++++==\nracaaaM\nrarMIDDD\nbu\nstst\n \n \n⎥⎥\n⎥⎥\n⎦\n⎤\n⎢⎢\n⎢⎢\n⎣\n⎡\n=\n44434241\n34333231\n24232221\n14131211\n),(\nCCCC\nCCCC\nCCCC\nCCCC\nCa θθ &  (7) \nwhere \n)sin(\n)sin(\n43423442\n3233233233222\nαθθ\nθαθθ\n+−\n−+−=\n&\n&&\nraM\nsaaMraMC\nbu\nbust\n \n)sin(\n)sin(\n43423442\n3233233233223\nαθθ\nθαθθ\n+−\n−+−=\n&\n&&\nraM\nsaaMraMC\nbu\nbust\n \n)sin( 4342344224 αθθ +−= &raMC bu  \n)sin(\n)]sin([\n4423443\n333332232\nαθθ\nαθθ\n+−\n++=\n&\n&\nraM\nrMsaMaC\nbu\nstbu\n \n)sin( 442344333 αθθ +−= &raMC bu  \n)sin( 442344334 αθθ +−= &raMC bu  \n)sin(\n)]sin()sin([\n44343\n44343422442\nαθθ\nαθαθθ\n++\n+++=\n&\n&\nraM\naarMC\nbu\nbu\n \n)sin( 444343 αθ += raMC bu  \n044 =C  \n [ ]Ta GGGGG 4321)( =θ  (8) \nwhere \n)cos()( 222222 αθ +++= grMcgaMMG bostbu  \n)cos( 32332333 αθ ++= grMcgaMG stbu  \n)cos( 423444 αθ += grMG bu  \n [ ]Tbustbobaa BBBBB 4321)( θθθθθ &&&&& =  (9) \n \n⎥⎥\n⎥⎥\n⎦\n⎤\n⎢⎢\n⎢⎢\n⎣\n⎡\nΓ\n−Γ\n−Γ\nΓΓΓΓ\n=Γ\n100\n110\n011\n41\n31\n21\n14131211\n (10) \nThe interaction between the excavator bucket and the \nenvironment is presented in Figure 3. \n \nFigure 3 The interaction between the excavator bucket and the \nenvironment [4] \nAccording to [22], Ft and Fn are the tangential and \nnormal components of the soil reaction force at the \nbucket, respectively. The tangential component can be \ncalculated as \n bhkFt 1=  (11) \nwhere k1 is the specific digging force in N\/m2, and h and b \nare the thickness and width of the cut slice of soil. The \nnormal component Fn is calculated as \n tn FF Ψ=  (12) \nwhere Ψ=0.1–0.45 is a dimensionless factor that depends \non the digging angle, digging conditions, and the wear of \nthe cutting edge. \nSo according to Figure 3, the loading torque is given \nas below: \n \n⎥⎥\n⎥⎥\n⎦\n⎤\n⎢⎢\n⎢⎢\n⎣\n⎡\n+−\n+−+\n−−−=\n)cossin(\n)]cos()sin([\n)]cos()sin([\n4\n23233\n222\nbnbt\ndgndgt\ndgndgt\nb\nL\nFFa\nFFa\nFFa\nF\nθθ\nθθθθ\nθθθθ\nτ\n  \n(13) \nSince this paper is mainly on the motion control, the \nelements D1i, Di1, C1i, Ci1, Γ1i, Γi1 (i=1, 2, 3, and 4), G1, \nBba, τ1 and τb are not used in the proposed control law. \nHowever, those parameters are important in the forced \ncontrol and will be investigated in the future work. \nIII. CONTROL OF AN EXCAVATOR \nA. Control of the excavator base \nTwo PD controllers have been implemented and tuned \nas suggested in [19] and [20]. Equations (14) to (19) are \napplied to control the right and left wheel actuator torques. \nThe gains of the applied PD controllers are given in Table \n1. \n )()()()( 1 tvutvtvte refv −=−=  (14) \n )()()()( 2 tuttte ref ωωωω −=−=  (15) \n )()()()( tdteKteKtu vivvpvv ∫+=  (16) \n )()()()( tdteKteKtu ip ∫+= ωωωωω  (17) \n )()()( 2121 tututu vRR ωτ +==  (18) \n )()()( 2121 tututu vLL ωτ −==  (19) \n \nParameter Description Value \nKpv The proportional component for the forward \nspeed control \n6.48 \nKiv The integral component for the forward speed \ncontrol \n56.9098 \nKpω The proportional component for the turning \nspeed control \n2.05 \nKiω The integral component for the turning speed \ncontrol \n8.4803 \nTable 1 Parameters of PD controllers for wheel torque control of the \nexcavator base model given in [19] and [20]. \nThe extended backstepping position controller which \nis proposed in paper [20] is used in the outer loop for \nposition control. The position controller outputs are \ndefined by (20) to (22) where the parameter values are \ngiven in Table 2.  \nParameter Value \nk1 18.2620 \nk2 18.75 \nk3 9.8229 \nk4 26.5370 \nk5 1.0164 \nk6 k6=2.0028 \nTable 2 Parameters of the backstepping position control of the excavator \nbase model given in [20]. \n \n⎥⎥\n⎥\n⎦\n⎤\n⎢⎢\n⎢\n⎣\n⎡\n−\n−\n−\n⎥⎥\n⎥\n⎦\n⎤\n⎢⎢\n⎢\n⎣\n⎡\n−=\n⎥⎥\n⎥\n⎦\n⎤\n⎢⎢\n⎢\n⎣\n⎡\ncr\nr\nr\ncc\ncc\nyy\nxx\ne\ne\ne\nθθ\nθθ\nθθ\n100\n0cossin\n0sincos\n3\n2\n1\n (20) \n \n2\n2\n2\n14\n11\n31 cos\neek\nekevu r ++\n+=  (21) \n \n2\n36\n33\n2\n2\n2\n15\n22\n2\nsin\nek\nevk\neek\nevku rrr +\n+\n++\n+=ω  (22) \nB.  Robust control of the excavator arm \nUsually, the excavator is required to carry out tasks \ninvolving contact with its environment, such as levelling \nand digging. In moving towards autonomous excavation, \nit is necessary to develop a controller that is robust to \nuncertainties associated with such tasks. \nAlthough there are some pronounced differences \nbetween the classical robot manipulator and robotic \nexcavation, there are also some parallels. Therefore, there \nare many control approaches which have been developed \nfor the robot manipulator that can be adopted by the \nrobotic excavation. In this section, we will firstly study \ncontrol of the excavator using the conventional computed \ntorque control which has been developed on the fully-\nactuated robot manipulator. Then, we will develop a \nrobust control approach which is effective to reject \nexternal disturbance during excavation. After that, \nextensive simulation results will be compared. \nUsing the dynamic model of the excavator arm in (5), \nthe computed torque control (CTC) law is given as below: \n )(ˆ)(ˆ),(ˆ)(ˆ θθθθθθθ &&&& aaavaa BGCDU +++=  (23) \nwhere apavdv ekek −−= &&&& θθ , dae θθ −= , kv and kp are \nlinear gains to be designed, )(ˆ θaD is the estimated inertia; \n),(ˆ θθ &aC  is the estimated Coriolis and centripetal effects; \n)(ˆ θaG  is the estimated gravity forces; )(ˆ θ&aB  is the \nestimated friction effects, Ua is the computed torques \napplied to the system, ddd θθθ &&& ,,  are the desired joint link \nangle, angular velocity, and angular acceleration, \nrespectively. \nIt is found that the CTC approach is specified by the \ninverse dynamics of the excavator (5). The controller (23) \ngenerates the generalized torques to be applied to the \nexcavator producing the desired motion. The simulation is \ncarried out in two cases: 1) tracking the desired motion \nwithout payload and 2) tracking the desired motion with \npayload (Mload=500kg) but it is assumed to be unknown. \nThe parameters of the excavator arm are given in \nAppendix. For both cases, the linear gains kv=100 and \nkp=150 are used.  \n5.8 6 6.2 6.4 6.6 6.8 7 7.2\n-0.4\n-0.2\n0\n0.2\n0.4\n0.6\n0.8\n1\n1.2\n1.4\nX0 (m)\nZ0\n (m\n)\n \n \nDesired Trajectory\nActual Trajectory\n \nFigure 4 The bucket (O3) trajectory under the CTC law without payload \n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.01\n0.02\n0.03\n0.04\n0.05\n0.06\nO\n3 \ntra\nck\nin\ng \ner\nro\nr (\nm\n)\nTime (sec.)  \nFigure 5 The bucket (O3) tracking errors (solid line: without payload; \ndash line: with unknown payload) \n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.01\n0.02\n0.03\n0.04\n0.05\n0.06\n0.07\n0.08\n0.09\nO\n4 \ntra\nck\nin\ng \ner\nro\nr (\nm\n)\nTime (sec.)  \nFigure 6 The bucket head (O4) tracking errors (solid line: without \npayload; dash line: with unknown payload) \nThe simulation results are presented as follows. In \nFigure 4, the actual bucket motion under the CTC law \nwithout payload is shown. To analyze the performance of \nthe CTC law, Figure 5 and Figure 6 present the tracking \nerrors of the bucket and the bucket head, respectively. The \ntracking error is the absolute distance from the actual \ntrajectory to the desired trajectory. From Figure 5, it can \nbe seen that the case with unknown payload gives a \nmaximal tracking error which is about 0.056m, and the \naverage tracking error with payload is apparently larger \nthan the case without payload. Also, in Figure 6, the \ntracking performance is not as good as desired when the \nsystem is loaded with unknown payload. In Figure 7, the \ncontrol inputs by using the CTC law with payload are \ngiven. \n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n-5\n0\n5\nx 106\nτ2\n (N\nm\n)\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n-2\n0\n2\nx 106\nτ3\n (N\nm\n)\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n-2\n0\n2\nx 105\nτ4\n (N\nm\n)\nTime (sec.)  \nFigure 7 The control torques under the CTC law with unknown payload \nFrom the simulation results above, it can be found that \nthe CTC law cannot give a desired tracking performance \nunder the case with unknown payload. So, a robust control \napproach is required to adapt to an uncertain circumstance. \nAccording to the dynamic model in (5), the robust control \n(RC) law [21] is introduced as below \n [ ]Ttetetx )()()(~ &=  (24) \n \n)(),()}(){(\n)()()(\n12\n0\nθθθμθ GvCePevD\ntWttW\n+++−=\n+Θ\n&&&  \n(25) \n (t)T(t)TT(t) lf +=  (26) \n )()(~)PPP-(P(t)T 1cc\n-1\ncclll tePtx cc+Γ+=  (27) \n \n)()()((t)T 0f tWttW v +Θ=  (28) \n Θ−=Θ )()( 1 tFtv ii ∀≥ θθ  (29) \n { })sgn(),...,sgn(),sgn()( 211 pfffdiagtF =  (30) \n [ ])(),...,(),()(~)( 211 tftftftWPxtF pTT ==  (31) \nwhere ePv d 12−= θ& , Θ is a vector containing the unknown \nexcavator and load parameters, which are known to lie in \na bounded set: { }piii ,...,2,1,| =≤Θ=Ω θθ , Θv(t) is a \nswitching-function vector, Pcc, Γ, Pll∈Rnxn are symmetric \npositive definite matrices, P12=Pcc-1Γ, P1=[Inxn P12].  \nIn the simulation, the coefficients are chosen as \nPcc=100I3x3, Pll=80I3x3, P12=40I3x3 and μ=3.5. The resulting \nlinear feedback control law is \n )(3200)(5.82(t)Tl tete −−= &  (32) \nThe payload in the bucket is assumed unknown, but \nwith known bounds 0≤Mload≤Mmax, where Mmax=Vb·ρ is \nthe maximal weight that the excavator can load, Vb is the \nvolume of the bucket, ρ is the soil density. In the \nsimulation Mload=500kg and Mmax=1114.6kg. According \nto (28)-(31), the RC law is given as below: \n )]()}(40)([{f(t) tWtete += &  (33) \n )}(sgn{)()( max tfMMt buv +−=Θ  (34) \n )()()((t)T 0f tWttW v +Θ=  (35) \n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.01\n0.02\n0.03\n0.04\n0.05\n0.06\nO\n3 \ntra\nck\nin\ng \ner\nro\nr (\nm\n)\nTime (sec.)  \nFigure 8 The bucket (O3) tracking errors with unknown payload (solid \nline: the CTC law; dash line: the RC law) \n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.01\n0.02\n0.03\n0.04\n0.05\n0.06\n0.07\n0.08\n0.09\nO\n4 \ntra\nck\nin\ng \ner\nro\nr (\nm\n)\nTime (sec.)  \nFigure 9 The bucket head (O4) tracking errors with unknown payload \n(solid line: the CTC law; dash line: the RC law) \nThe comparison between the CTC law and the RC law \nis made by using the simulation results as follows. The \ntracking results of the desired bucket motion by using both \ncontrol laws are presented in Figure 8. For both \nsimulations, the mass of the payload is assumed unknown \nfor the controller design. As shown in Figure 8, it can be \nseen that the CTC law gives a maximal tracking error \nwhich is about 0.056m, while the RC law gives a better \ntracking performance, i.e. the average tracking errors \ngiven by the RC law is obviously less than the average \ntracking errors given by the CTC law. In Figure 9, it can \nbe found that the tracking results are consistent with the \nresults shown in Figure 8. Although the RC law gives a \nlarge tracking error at the beginning, but the error \nbecomes smaller finally. Therefore, the comparison can \nvalidate that the RC law is more effective and more robust \nto uncertain circumstance. Furthermore, the control \ntorques by using the CTC law and the RC law are \ncompared in Figure 10. From the figure, it can be found \nthat the control inputs of the RC law are much larger than \nthe control inputs of the CTC law. It gives a reasonable \nresult that the RC law effectively reduces the tracking \nerror during the excavation, and gives a better tracking \nperformance. \n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n-1\n0\n1\nx 10\n7\nτ2\n (N\nm\n)\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n-5\n0\n5\nx 10\n6\nτ3\n (N\nm\n)\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n-5\n0\n5\nx 10\n5\nτ4\n (N\nm\n)\nTime (sec.)  \nFigure 10 The control torques with unknown payload (solid line: the \nCTC law; dash line: the RC law) \nIV. REMOTE CONTROL OF THE EXCAVATOR BASE \nThe co-simulation framework [23][24] that utilizes \nMATLAB-SIMULINK to model the plant-controller and \nOPNET to simulate the network has been used to \nimplement the position control of the excavator base and \nis shown in Figure 11. The co-simulation parameters are \ngiven in Table 3. \n \nFigure 11 Interactive SIMULINK-OPNET co-simulation  \nThe motive of position control is to control x and y \ncoordinates as well as the orientation. The desired x and y \ncoordinate profiles and the orientation or direction are \ntaken from [19] and are shown in Figure 12(a), Figure \n12(b) and Figure 12(c), respectively. The desired \ntrajectory on x-y plane with time of the excavator base is \ndepicted in Figure 12(d). \nParameter Value \nSimulation area 174metre × 174metre \nNumber of nodes 13 \nWireless \ncommunication \nstandard \nThe IEEE 802.11b (Direct Sequence)  \nSignal propagation \nmodel \nThe pass loss and the fading [25][26] \nMANET routing \nprotocol \nThe DSR protocol [27][28] \nMAC protocol The Carrier Sense Multiple Access with \nCollision Avoidance (the CSMA\/CA) [29] \nPacket size 98 bytes \nData rate 11 Mbps [30] \nWireless card The Lucent ORINOCO wireless network \ncard [30] \nWireless card output \npower \n15 dBm [30] \nWireless card \nreception sensitivity \n-82 dBm (11 Mbps) [30] \nConnection protocol The User Datagram Protocol (UDP) \n[31][32][33][34] \nNode movement \nmodel \nThe random way-point model [35][36] \nSampling mechanism Clock driven [37][38][39][34][40] \nControl mechanism Event driven (upon the arrival of the state \npacket) [37][38][39][34][40] \nActuation mechanism Event driven (upon the arrival of the control \npacket) [37][38][39][34][40] \nDesired output The reference x, y coordinates and \norientation with time, Figure 12 \nSampling period 0.05s [29][41][42] \nTable 3 Parameters of SIMULINK-OPNET co-simulation for the \nexcavator base position control given in [19] and [20]. \n \n(a) Desired x coordinates \n \n(b) Desired y coordinates \n \n(c) Desired orientation \n \n(d) Desired trajectory of the excavator base on x-y plane with time \nFigure 12 The desired x, y coordinates, orientation and trajectory with \ntime [19]. \nThe excavator model sends the x coordinate x, y \ncoordinate y and the orientation theta to the backstepping \ncontroller over the OPNET MANET model. The \ncontroller compares the x, y and theta values with the \nreference x_ref, y_ref and theta_ref and sends the required \ninput u1 and u2 to the velocity controller at the excavator \nsite. The trajectory of the excavator base at the data rate of \n11 Mbps is shown in Figure 13. The control torques for \nthe excavator right and left wheels are shown in Figure 14 \nand Figure 15, respectively. \n \nFigure 13 Actual trajectories of the excavator base under various data \nrates. \n \nFigure 14 The control torque of the excavator right wheel \n \nFigure 15 The control torque of the excavator left wheel \nV. CONCLUSIONS AND FURTURE WORK \nThis paper has reported the work conducted in an on-\ngoing project. The key issues in remotely controllable \nexcavators have been identified. An overall architecture \nhas been proposed and functions of each block of the \narchitecture have been discussed. Some simulation work \nhas been conducted to demonstrate the proposed system.  \nWe will conduct further simulation on the whole \nsystem. The experimental study will also be investigated. \nACKNOWLEDGEMENT \nThe authors would like to thank Mr Sam Wane for the \nuseful discussion and J C Bamford Excavators Limited, \nSellafield Limited for initiating this work. \nAPPENDIX \nParameters of the excavator base model: \nM=10kg: mass of the entire base \nIA=1.0kg·m2: moment of inertia of the entire base \nconsidering point A \nI0=0.001kg·m2: moment of inertia of the wheel complex \nL=0.35m: width of the base \nr=0.035m: radius of the wheels \nd=0.05m: distance between point A and C \nθc: angle representing the orientation of the base \nθR: angle position of the right wheel \nθL: angle position of the left wheel \nτR: actuation torque of the right wheel \nτL: actuation torque of the left wheel \nParameters of the excavator arm model: \nMbo=1566 kg: mass of boom \nMst=735 kg: mass of stick \nMbu=432 kg: mass of bucket \nMload=500kg: mass of load \nVb=0.58m3: volume of bucket \nρ=1921.8kg\/m3: soil density \nMmax=Vb·ρ: maximal load weight  \nIbo=14250.6 kg·m2: moment of inertia of boom \nIst=727.7 kg·m2: moment of inertia of stick \nIbu=224.6 kg·m2: moment of inertia of bucket \nθ1: angle of base \nθ2: angle of boom \nθ3: angle of stick \nθ4: angle of bucket \nθb: angle between bucket bottom and X4-axis \nθdg: angle between bucket edge and horizontal line \na1=0.05 m: O0O1 \na2=5.16 m: O1O2 \na3=2.59 m: O2O3 \na4=1.33 m: O3O4 \nr2=2.71 m: O1G2 \nr3=0.64 m: O2G3 \nr4=0.65 m: O3G4 \nα2=0.2566 rad: ∠G2O1O2 \nα3=0.3316 rad: ∠G3O2O3 \nα4=0.3944 rad: ∠G4O3O4 \nBbo: viscous friction coefficient of boom \nBst: viscous friction coefficient of stick \nBbu: viscous friction coefficient of bucket \ng=9.81 N\/kg: acceleration due to gravity \nTs=10 ms: sampling time \nREFERENCES \n[1] H. Yu, Y. Liu, and M. S. Hasan, \"Review of modelling and \nremote control for excavators,\" International Journal of \nAdvanced Mechatronic Systems (accepted for publication), \nvol. 2, no. 1\/2, 2009. \n[2] A. J. Koivo, \"Kinematics of excavators (backhoes) for \ntransferring surface material,\" J. Aerosp. Eng, vol. 7, no. 1, \npp. 17-32, 1994. \n[3] P. K. Vaha and M. J. Skibniewski, \"Dynamic model of \nexcavator,\" J. Aerosp. Eng., vol. 6,  pp. 148-158, 1993. \n[4] A. J. Koivo, M. Thoma, E. Kocaoglan, and J. Andrade-\nCetto, \"Modelling and control of excavator dynamics \nduring digging operation,\" J. Aerosp. Eng., vol. 9, no. 1, \npp. 10-18, 1996. \n[5] S. Tafazoli, P. D. Lawrence, and S. E. Salcudean, \n\"Identification of inertial and friction parameters for \nexcavator arms,\" IEEE Trans. on Robotics and \nAutomation, vol. 15, no. 5, pp. 966-971, 1999. \n[6] Y. H. Zweiri, \"Identification Schemes for Unmanned \nExcavator Arm Parameters,\" Int. J. Automation and \nComputing, vol. 05, no. 2, pp. 185-192, 2008. \n[7] C. P. Tan, Y. H. Zweiri, K. Althoefer, and L. D. \nSeneviratne, \"Online soil parameter estimation scheme \nbased on Newton-raphson method for autonomous \nexcavation,\" IEEE\/ASME Trans. on Mechatronics, vol. 10, \nno. 2, pp. 221-229, 2005. \n[8] S. Tafazoli, Salcudean, S. E., Hashtrudi-Zaad, K., and \nLawrence, P. D., \"Impedance control of a teleoperated \nexcavator,\" IEEE Trans. on Control Systems Technology, \nvol. 10, no. 3, pp. 355-367, 2002. \n[9] Z. Lu and A. A. Goldenberg, \"Robust impedance control \nand force regulation: theory and experiment,\" Int. J. \nRobotic. Res., vol. 14, no. 3, pp. 225-254, 1995. \n[10] Q. P. Ha, Q. H. Nguyen, D. C. Rye, and H. F. Durrant-\nWhyte, \"Impedance control of a hydraulically-actuated \nrobotic excavator,\" Automat. Construction, vol. 9, no. 5, \npp. 421-435, 2000. \n[11] L. E. Bernold, \"Motion and path control for robotic \nexcavation,\" J. Aerosp. Eng., vol. 6, no. 1, pp. 1-18, 1993. \n[12] S. Singh, \"Synthesis of tactical plans for robotic \nexcavation,\" in Robot. Inst., PhD thesis, Carnegie Mellon \nUniversity, Pittsburgh, PA, USA, 1995. \n[13] P. Saeedi, P. D. Lawrence, D. G. Lowe, J. P., D. \nKusalovic, K. Ardron, and P. H. Sorensen, \"An \nautonomous excavator with vision-based track-slippage \ncontrol,\" IEEE Trans. on Control Systems Technology, vol. \n13, no. 1, pp. 67-84, 2005. \n[14] N. R. Parker, S. E. Salcudean, and P. D. Lawrence, \n\"Application of force feedback to heavy duty hydraulic \nmachines,\" presented at the IEEE Conf. on Robotics and \nAutomation, Atlanta, USA, 1993. \n[15] D. Kim, K. W. Oh, D. Hong, J. Park, and S. Hong, \n\"Remote control of excavator with designed haptic \ndevice,\" presented at the Int. Conf. on Control, Automation \nand Systems, Seoul, Korea, 2008. \n[16] S. P. Dimaio, S. E. Salcudean, C. Reboulet, S. Tafazoli, \nand K. H. Zaad, \"A virtual excavator for controller \ndevelopment and evaluation,\" presented at the IEEE Int. \nConf. on Robotics and Automation, 1998. \n[17] N. Tao, D. Zhao, H. Yamada, and N. Shui, \"A low-cost \nsolution for excavator simulation with realistic visual \neffect,\" presented at the IEEE Conf. on Robotics, \nAutomation and Mechatronics, 2008. \n[18] Y. Sakaida, D. Chugo, H. Yamamoto, and H. Asama, \"The \nanalysis of excavator operation by skilful operator,\" \npresented at the SICE Annual Conf., Japan, 2008. \n[19] J. Velagic, B. Lacevic, and N. Osmic, \"Nonlinear Motion \nControl of Mobile Robot Dynamic Model,\" in Mobile \nRobots Motion Planning, New Challenges. Vienna: \nAdvanced Robotic System International, 2008, pp. 531-\n552. \n[20] B. Lacevic, J. Velagic, and B. Perunicic, \"Reduction of \nControl Torques of Mobile Robot Using Hybrid Nonlinear \nPosition Controller,\" presented at the International \nConference on Computer as a Tool, EUROCON 2005, \nSerbia & Montenegro, Belgrade, pp. 314-317, 2005. \n[21] H. Yu, \"Robust combined adaptive and variable structure \nadaptive control of robot manipulators,\" Robotica, vol. 16,  \npp. 623-650, 1998. \n[22] T. V. Alekseeva, K. A. Artem’ev, A. A. Bromberg, R. L. \nVoitsekhovskii, and N. A. Ul’yanov, Machines for \nEarthmoving Work: Theory and Calculations: Rotterdam : \nA.A. Balkema, 1986. \n[23] M. S. Hasan, H. Yu, A. Carrington, and T. C. Yang, \"Co-\nsimulation of wireless networked control systems over \nmobile ad hoc network using SIMULINK and OPNET,\" \nthe Journal of IET Communications, vol. 3, no. 8, pp. \n1297-1310, 2009. \n[24] M. S. Hasan, H. Yu, A. Griffiths, and T. C. Yang, \n\"Interactive co-simulation of MATLAB and OPNET for \nNetworked Control Systems,\" presented at the 13th \nInternational Conference on Automation and Computing, \nStafford, UK, pp. 237-242, 2007. \n[25] K. Fall and K. Varadhan, \"The Ns Manual (formerly ns \nNotes and Documentation), The VINT project,\" 2006, \nAvailable: http:\/\/www.isi.edu\/nsnam\/ns\/doc\/ns_doc.pdf, \nMar 2006. \n[26] S. Han and N. B. Abu-Ghazaleh, \"On the Effect of Fading \non Ad-hoc Networks,\" 2005, Available: \nhttp:\/\/arxiv.org\/PS_cache\/cs\/pdf\/0504\/0504002v1.pdf. \n[27] C. E. Perkins, Ad Hoc Networking. Boston, USA: Addison-\nWesley, 2001. \n[28] D. B. Johnson, D. A. Maltz, and J. Broch, Ad Hoc \nNetworking. Boston, USA: Addison-Wesley, 2001. \n[29] F. D. Pellegrini, D. Miorandi, S. Vitturi, and A. Zanella, \n\"On the Use of Wireless Networks at Low Level of \nFactory Automation Systems,\" IEEE Transactions on \nIndustrial Informatics, vol. 2, no. 2, pp. 129-143, 2006. \n[30] Lucent Technologies Inc., \"ORiNOCO PC Card, Home, \noffice, and Public Mobile Broadband Internet Access,\" \n2000, Available: \nhttp:\/\/www.a1datacom.com\/pdf\/wavelan_PC.pdf, Jul 2009. \n[31] M. Conti and S. Giordano, \"Multihop Ad Hoc Networking: \nThe Theory,\" IEEE Communications Magazine, vol. 45, \nno. 4, pp. 76-86, 2007. \n[32] K. Goldberg, S. Gentner, C. Sutter, and J. Wiegley, \"The \nMercury Project: A Feasibility Study for Internet Robots,\" \nthe IEEE Robotics and Automation Magazine, vol. 7,  pp. \n35-40, 2000. \n[33] P. X. Liu, M. Meng, X. Ye, and J. Gu, \"An UDP-Based \nProtocol for Internet Robots,\" presented at the 4th World \nCongress on Intelligent Control and Automation, China, \nvol. 1, pp. 59-65, 2002. \n[34] N. J. Ploplys, P. A. Kawka, and A. G. Alleyne, \"Closed-\nloop Control over Wireless Networks,\" IEEE Control \nSystems Magazine, vol. 24, no. 3, pp. 58-71, 2004. \n[35] J. Liu, Y. Yuan, D. M. Nicol, R. S. Gray, C. C. Newport, \nD. F. Kotz, and L. F. Perrone, \"Simulation validation using \ndirect execution of wireless ad-hoc routing protocols,\" \npresented at the 18th Workshop on Parallel and Distributed \nSimulation (PADS’04), Austria, pp. 7-16, 2004. \n[36] C. Newport, \"Simulating mobile ad hoc networks: a \nquantitative evaluation of common MANET simulation \nmodels,\" Dartmouth College Science Technical Report \nTR2004-504, 2004, Available: \nhttp:\/\/cmc.cs.dartmouth.edu\/cmc\/papers\/newport:thesis.pdf\n. \n[37] W. Zhang, M. S. Branicky, and S. M. Phillips, \"Stability of \nNetworked Control Systems,\" IEEE Control Systems \nMagazine, vol. 21, no. 1, pp. 84-99, 2001. \n[38] J. Colandairaj, G. W. Irwin, and W. G. Scanlon, \"An \nintegrated approach to wireless feedback control,\" \npresented at the UKACC International Control Conference, \nGlasgow, UK, 2006. \n[39] N. J. Ploplys, \"Wireless feedback control of mechanical \nsystems,\" in Mechanical Engineering, MSc thesis, \nUniversity of Illinois, Champaign, 2003, Available: \nhttp:\/\/mr-\nroboto.me.uiuc.edu\/ARGWeb\/theses\/NicksThesis\/Ploplys_\nMS2003.pdf. \n[40] S. Zampieri, \"Trends in Networked Control Systems,\" \npresented at the 17th World Congress, the International \nFederation of Automatic Control, Seoul, Korea, pp. 2886-\n2894, 2008. \n[41] J. Nilsson, \"Real-time Control Systems with Delays,\" in \nAutomatic Control, PhD thesis, Lund Institute of \nTechnology, Lund, Sweden, 1998, Available: \nhttp:\/\/www.control.lth.se\/documents\/1998\/nilj98dis.pdf. \n[42] D. Henriksson, \"Flexible Scheduling Methods and Tools \nfor Real Time Control Systems,\" in Automatic Control, \nPhD thesis, Lund Institute of Technology, Lund, Sweden, \n2003, Available: \nhttp:\/\/www.control.lth.se\/documents\/2003\/hen03.pdf. \n \n \n \n \n \n \n \n"}