{"doi":"10.1136\/adc.2006.099416","coreId":"65678","oai":"oai:dro.dur.ac.uk.OAI2:5099","identifiers":["oai:dro.dur.ac.uk.OAI2:5099","10.1136\/adc.2006.099416"],"title":"Randomised trial of infant sleep location on the postnatal ward.","authors":["Ball, H. L.","Ward-Platt, M. P.","Heslop, E.","Leech, S. J.","Brown, K. A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-12-01","abstract":"Objective: To determine whether postnatal mother–infant sleep proximity affects breastfeeding initiation and infant safety. \\ud\n\\ud\nDesign: Randomised non-blinded trial analysed by intention to treat. \\ud\n\\ud\nSetting: Postnatal wards of the Royal Victoria Hospital (RVI), Newcastle upon Tyne, UK. \\ud\n\\ud\nParticipants: 64 newly delivered mother–infant dyads with a prenatal intention to breastfeed (vaginal deliveries, no intramuscular or intravenous opiate analgesics taken in the preceding 24 h). \\ud\n\\ud\nIntervention: Infants were randomly allocated to one of three sleep conditions: baby in mother’s bed with cot-side; baby in side-car crib attached to mother’s bed; and baby in stand-alone cot adjacent to mother’s bed. \\ud\n\\ud\nMain outcome measures: Breastfeeding frequency and infant safety observed via night-time video recordings. \\ud\n\\ud\nResults: During standardised 4-h observation periods, bed and side-car crib infants breastfed more frequently than stand-alone cot infants (mean difference (95% confidence interval (CI)): bed v stand-alone cot = 2.56 (0.72 to 4.41); side-car crib v stand-alone cot = 2.52 (0.87 to 4.17); bed v side-car crib = 0.04 (–2.10 to 2.18)). No infant experienced adverse events; however, bed infants were more frequently considered to be in potentially adverse situations (mean difference (95% CI): bed v stand-alone cot = 0.13 (0.03 to 0.23); side-car crib v stand-alone cot = 0.04 (–0.03 to 0.12); bed v side-car crib = 0.09 (–0.03–0.21)). No differences were observed in duration of maternal or infant sleep, frequency or duration of assistance provided by staff, or maternal rating of postnatal satisfaction. \\ud\n\\ud\nConclusion: Suckling frequency in the early postpartum period is a well-known predictor of successful breastfeeding initiation. Newborn babies sleeping in close proximity to their mothers (bedding-in) facilitates frequent feeding in comparison with rooming-in. None of the three sleep conditions was associated with adverse events, although infrequent, potential risks may have occurred in the bed group. Side-car cribs are effective in enhancing breastfeeding initiation and preserving infant safety in the postnatal ward","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65678.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5099\/1\/5099.pdf","pdfHashValue":"a2c0dd88d57ba5d4c3958aa502cbe9f9bc1769ee","publisher":"BMJ Publishing Group & Royal College of Paediatrics and Child Health","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5099<\/identifier><datestamp>\n      2011-06-01T16:08:48Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Randomised trial of infant sleep location on the postnatal ward.<\/dc:title><dc:creator>\n        Ball, H. L.<\/dc:creator><dc:creator>\n        Ward-Platt, M. P.<\/dc:creator><dc:creator>\n        Heslop, E.<\/dc:creator><dc:creator>\n        Leech, S. J.<\/dc:creator><dc:creator>\n        Brown, K. A.<\/dc:creator><dc:description>\n        Objective: To determine whether postnatal mother–infant sleep proximity affects breastfeeding initiation and infant safety. \\ud\n\\ud\nDesign: Randomised non-blinded trial analysed by intention to treat. \\ud\n\\ud\nSetting: Postnatal wards of the Royal Victoria Hospital (RVI), Newcastle upon Tyne, UK. \\ud\n\\ud\nParticipants: 64 newly delivered mother–infant dyads with a prenatal intention to breastfeed (vaginal deliveries, no intramuscular or intravenous opiate analgesics taken in the preceding 24 h). \\ud\n\\ud\nIntervention: Infants were randomly allocated to one of three sleep conditions: baby in mother’s bed with cot-side; baby in side-car crib attached to mother’s bed; and baby in stand-alone cot adjacent to mother’s bed. \\ud\n\\ud\nMain outcome measures: Breastfeeding frequency and infant safety observed via night-time video recordings. \\ud\n\\ud\nResults: During standardised 4-h observation periods, bed and side-car crib infants breastfed more frequently than stand-alone cot infants (mean difference (95% confidence interval (CI)): bed v stand-alone cot = 2.56 (0.72 to 4.41); side-car crib v stand-alone cot = 2.52 (0.87 to 4.17); bed v side-car crib = 0.04 (–2.10 to 2.18)). No infant experienced adverse events; however, bed infants were more frequently considered to be in potentially adverse situations (mean difference (95% CI): bed v stand-alone cot = 0.13 (0.03 to 0.23); side-car crib v stand-alone cot = 0.04 (–0.03 to 0.12); bed v side-car crib = 0.09 (–0.03–0.21)). No differences were observed in duration of maternal or infant sleep, frequency or duration of assistance provided by staff, or maternal rating of postnatal satisfaction. \\ud\n\\ud\nConclusion: Suckling frequency in the early postpartum period is a well-known predictor of successful breastfeeding initiation. Newborn babies sleeping in close proximity to their mothers (bedding-in) facilitates frequent feeding in comparison with rooming-in. None of the three sleep conditions was associated with adverse events, although infrequent, potential risks may have occurred in the bed group. Side-car cribs are effective in enhancing breastfeeding initiation and preserving infant safety in the postnatal ward. <\/dc:description><dc:subject>\n        Bedding-in<\/dc:subject><dc:subject>\n         Breastfeeding initiation<\/dc:subject><dc:subject>\n         Post-natal care<\/dc:subject><dc:subject>\n         Rooming-in<\/dc:subject><dc:subject>\n         Side-car crib.<\/dc:subject><dc:publisher>\n        BMJ Publishing Group & Royal College of Paediatrics and Child Health<\/dc:publisher><dc:source>\n        Archives of disease in childhood, 2006, Vol.91(12), pp.1005-1010 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2006-12-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5099<\/dc:identifier><dc:identifier>\n        issn:0003-9888<\/dc:identifier><dc:identifier>\n        issn: 1468-2044<\/dc:identifier><dc:identifier>\n        doi:10.1136\/adc.2006.099416<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5099\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1136\/adc.2006.099416<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5099\/1\/5099.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":[" 1468-2044","issn:0003-9888","issn: 1468-2044","0003-9888"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Bedding-in","Breastfeeding initiation","Post-natal care","Rooming-in","Side-car crib."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n05 January 2009\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBall, H. L. and Ward-Platt, M. P. and Heslop, E. and Leech, S. J. and Brown, K. A. (2006) ’Randomised trial\nof infant sleep location on the postnatal ward.’, Archives of disease in childhood., 91 (12). pp. 1005-1010.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1136\/adc.2006.099416\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n \n \nRandomised trial of infant sleep location on the postnatal ward \n \n \n \nHelen L Ball, Parent-Infant Sleep Lab & Medical Anthropology Research Group, Department of \nAnthropology, Durham University \n \nMartin P Ward-Platt, Newcastle Neonatal Service, Royal Victoria Infirmary, Newcastle upon Tyne \n \nEmma Heslop, Research Associate, Parent-Infant Sleep Lab, Department of Anthropology, \nDurham University \n \nStephen J Leech, Research Associate, Parent-Infant Sleep Lab, Department of Anthropology, \nDurham University \n \nKath A Brown, Research Nurse, Midwifery Services, Royal Victoria Infirmary, Newcastle upon \nTyne \n \n \n \nCorresponding author: Dr Helen Ball, Dept Anthropology, Durham University, 43 Old Elvet, \nDurham, DH1 3HN. Email H.L.Ball@dur.ac.uk. Tel: 0191 334 0260. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nRunning header\/short title: Mother-Infant Sleep Proximity \nText word count = 2578 plus 1 figure & 4 tables \nConflict of interest: No conflict of interest to declare. \n \n“The Corresponding Author has the right to grant on behalf of all authors and does grant \non behalf of all authors, an exclusive licence (or non exclusive for government \nemployees) on a worldwide basis to the BMJ Publishing Group Ltd and its Licensees to \npermit this article (if accepted) to be published in Archives of Disease in Childhood \neditions and any other BMJPGL products to exploit all subsidiary rights, as set out in our \nlicence (http:\/\/adc.bmjjournals.com\/ifora\/licence.dtl).” \n 1\nABSTRACT \n \nObjective: To determine whether postnatal mother-infant sleep proximity affects \nbreastfeeding initiation and infant safety. \nDesign: Randomised non-blinded trial analysed by intention to treat. \nSetting: Postnatal wards of the Royal Victoria Hospital (RVI), Newcastle-upon-Tyne. \nParticipants: 64 newly delivered mother-infant dyads with a prenatal intention to \nbreastfeed (vaginal deliveries, no intra-muscular \/ intra-venous opiate analgesics in \npreceding 24 hours). \nIntervention: Infants were randomly allocated to one of 3 sleep conditions: Baby in \nmother’s bed with cot-side; baby in side-car crib attached to mother’s bed; baby in stand-\nalone cot adjacent to mother’s bed.  \nMain outcome measures: Breastfeeding frequency and infant safety observed via \nnight-time video-recordings. \nResults: During standardised 4-hour observation periods bed and side-car crib infants \nbreastfed more frequently than stand-alone cot infants [mean difference (95% CI): bed \nvs stand-alone cot =2.56 (0.72-4.41); side-car crib vs stand-alone cot =2.52 (0.87-4.17); \nbed vs. side-car crib = 0.04 (-2.10-2.18)]. No infants experienced adverse events, \nhowever bed infants were more frequently considered to be in potentially adverse \nsituations [mean difference (95% CI): bed vs stand-alone cot 0.13 (0.03-0.23); side-car \ncrib vs stand-alone cot 0.04 (-0.03-0.12); bed vs side-car crib 0.09 (-0.03-0.21)]. No \ndifferences were observed in duration of maternal or infant sleep, frequency or duration \nof assistance provided by staff; or maternal rating of post-natal satisfaction. \nConclusion: Suckling frequency in the early post-partum period is a well known \npredictor of successful breastfeeding initiation. Sleeping newborn babies in close \nproximity to their mothers (bedding-in) facilitates frequent feeding in comparison with \nrooming-in. None of the 3 sleep conditions was associated with adverse events; \nalthough infrequent, potential risks may have occurred in the bed-group. Side-car cribs \nare effective in enhancing breastfeeding initiation and preserving infant safety on the \npost-natal ward. \n \nKey words: Bedding-In; Rooming-In; Side-car crib; Breastfeeding initiation; Infant \nsafety; Post-natal care. \nAbstract word count = 281 \n \n \n \nWhat is already known on this topic? \n• Frequent suckling and skin-to-skin contact following delivery enhances \nbreastfeeding initiation, and mother-infant sleep contact is commonly practiced in \nthe home by breastfeeding mothers \n• Rooming-in facilitates breastfeeding on demand in comparison with nursery care, \nbut does not permit continuous mother-infant contact or spontaneous suckling \n \nWhat this study adds: \n• Examines two forms of mother-infant sleep contact (baby-in-bed and side-car \ncrib) on postnatal ward and demonstrates increased night-time feed frequency in \nbed and side-car crib conditions where mother and infant experience unhindered \naccess \n• Use of side-car cribs on post-natal ward increases breastfeeding frequency while \nmaintaining infant safety. \n 2\nINTRODUCTION \nAlthough the beneficial effects of early and frequent suckling and skin-to-skin contact on \nbreastfeeding initiation are well known [1-6] there has been little work on the effect of \nsubsequent mother-infant contact in the first postnatal days. Night-time rooming-in has \nbeen shown to enhance breastfeeding on demand in comparison with night-time nursery-\ncare [7, 8]; however ‘rooming-in’ involves babies sleeping in stand-alone cots that do not \npermit continuous contact or spontaneous feeding between mothers and infants. Yet such \ncontact may be of importance for mothers to understand their babies’ signals and to \nrespond effectively.  \n \nUnhindered contact can only be provided for mother and baby at night on the post-natal \nward through some arrangement whereby mother and baby can maintain continuous \ncontact to allow spontaneous breastfeeding. Two forms of bedding-in currently practised in \nUK hospitals involve either sleeping the baby in the mother’s bed, usually with the \nprovision of removable cot-sides to prevent falls; or sleeping the baby in a side-car crib that \nattaches to the frame of the mother’s bed and is enclosed on three sides, allowing the \nbaby a separate sleep surface, but one that is contiguous with the mother’s bed.  We also \nrecognised that breastfeeding mothers commonly take their babies into their own beds for \nfeeding, and that both parties often fall asleep in this situation, whether or not this was \nplanned, or advised against by midwives, or whether appropriate cot sides were provided. \n \nWe therefore designed a trial to determine the way in which different degrees of mother-\ninfant contact in the immediate postnatal period affects infant care, including \nbreastfeeding, and to ascertain whether infant safety is compromised when babies and \nmothers are in close proximity.  \n \n \nMETHODS \n \nRecruitment \nFollowing approval from the research ethics committee we recruited pregnant women \nattending ante-natal breastfeeding workshops (held once or twice per month) in \nNewcastle upon Tyne, UK. Those returning completed consent and enrolment forms \nwere entered into the trial if they were healthy, non-smoking first-time mothers, pregnant \nwith a single infant, anticipating a normal vaginal delivery and intending to breastfeed.  \n \nAssignment \nRecruits were randomly allocated, by a concealed sequence compiled with a random \nnumber generator, to one of three sleep conditions: rooming-in with standalone cot; \nbedding-in with a side-car crib; or bedding-in in mother’s bed with cot side. Recruitment, \nenrolment and anonymous randomisation were conducted by three different members of \nthe research team (KB, EH and SL respectively). Post-partum exclusion criteria included \ncaesarean delivery, ill baby or mother, and receipt of intra-venous or intra-muscular \nopiate analgesics in the preceding 24 hours. Following delivery the research nurse \nconfirmed each mother’s continuing eligibility and willingness to participate in the study.  \n \nVideo protocol \nA small camcorder with infra-red filming capability was erected atop a two metre \nmonopod attached to the foot of the mother’s bed with the recorder housed in an attaché \ncase placed under the bed. Mothers were provided with a remote control and requested \nto start the recording whenever they intended to settle down for sleep. The tape \nrecorded for 8 hours or until the mother chose to terminate filming. Mothers were \nrequested to keep their baby in the allocated sleep location while they were asleep. We \ndid not specify how or where mothers should feed their infants. Mothers and babies were \nfilmed on the first two postnatal nights. \n 3\n \nFollowing filming we offered mothers the opportunity to view their video-tapes as per \nstandard guidelines [9] and obtained further consent for the videos to be analysed. \nMothers then participated in a semi-structured interview regarding their postnatal \nexperience, and we abstracted labour and delivery information from the case notes. \nUpon completion of the study mothers received a £10 gift voucher for baby products and \na tape of clips from their 2 nights of filming (approved by the Local NHS Research Ethics \nCommittee). We report here on the short-term outcomes.  \n \nMasking \nWe described the study as an infant sleep study to investigate effects of the three \nconditions on the postnatal experience generally.  True blinding was not possible either \nfor investigators or participants.  \n \nOutcome measures  \nThe outcome on which we powered the study was successful initiation of breastfeeding, \ndefined on the basis of observed infant behaviour (attempted feeds, successful feeds, \nfeeding effort), but we regarded infant safety as a second primary outcome even though \nthere was no published or unpublished data on which to base a power calculation.  \nFeeding effort was calculated as the frequency per hour of unsuccessful and successful \nfeeding attempts. Infant safety was determined by assessing ‘potential risk exposure’: \nfrequency per hour and proportional duration of potentially adverse situations \ncategorised as breathing risk (external airways covered); overheating risk (head \ncompletely covered); falling risk (precarious positioning with no means of fall prevention); \nentrapment risk (wedged between bed and side-rail); and overlaying risk (trapped under \nmother’s torso). Infant safety was monitored according to the hospital’s extant bedding-in \npolicy involving regular checks on mothers and infants known to be bedding-in. \n \nOther outcome measures were maternal and infant sleep duration, maternal satisfaction, \nand staff contact time with the mother.   \n \nSample size \nPrevious studies of mother-infant sleep contact had found that night-time breastfeeding \nfrequency was three-times greater when mothers and infants slept in the same bed in \ncomparison to separate sleep locations [10]. In order to observe a difference between \nbedding-in (bed or side-car crib conditions) and rooming-in (stand-alone cot condition) \nwe used short-term outcomes (feed frequency) as the basis for our power calculations: \n28 participants were required in each group to achieve 90% power at 95% precision. To \nachieve 80% power at the same precision, each group required 20 participants. We \naimed, therefore, to obtain data on 90 mother-infant pairs (30 allocated to each arm of \nthe trial), however as half of all mothers recruited were lost due to ineligibility following \ndelivery 64 mother-infant pairs participated in the intervention. \n \nAnalysis \nThe video tapes of mother-infant behaviour on the first and second postnatal nights were \ncoded using Noldus Observer 5 behavioural analysis software at the University of \nDurham Parent-Infant Sleep Lab, employing behavioural taxonomies developed in \nprevious studies.[11] Three researchers coded the video tapes, coding equal proportions \nof tapes from each condition in order to minimise any potential observer bias. Inter- and \nintra-observer reliability was regularly tested via re-coding of identical sections of tape to \nensure kappa scores greater than 90%. Statistical analyses were conducted using \nSPSS: all analyses employed pair-wise comparisons between the conditions using \nparametric or non-parametric tests according to whether or not the data were normally \ndistributed. \n \n 4\nRESULTS \n \nRecruitment rate \nFifteen to 20 pregnant women participated in each of the 35 breastfeeding workshops \nattended; a mean of 4.1 women from each workshop volunteered for the study. Not all of \nthe women attending workshops were eligible to volunteer for the trial (multiple \npregnancies, scheduled c-sections, planned opiate analgesia, planned home delivery) \nwhich we estimate reduced the pool of potential volunteers to a mean of 11.5 women per \nworkshop, resulting in an approximate recruitment rate of 35%. We were not able to \ncompare characteristics of volunteers and non-volunteers due to lack of consent to \naccess the records of non-volunteers. \n \nParticipant flow \nFigure 1 illustrates the recruitment and loss of participants to the trial. Table 1 gives a \nbreakdown of reasons for exclusion or loss following delivery. Due to room availability, \nlate notification or early discharge 17 mothers-infant dyads were filmed on only one night \n(9 missed 1st night, 8 missed 2nd night). \n \nFigure 1 Recruitment and exclusion of participants. \n \n \nRecruitment population \n \nAll pregnant women attending bi-\nweekly breastfeeding workshops at \nRVI between 3.2003 and 12.2004 \nVolunteers meeting  \nprenatal eligibility  \ncriteria \n \nPostnatal eligibility \n144 women randomly allocated: \nBed = 48; Side-car Crib = 50;  \nStand-alone Cot = 46\n \nFinal sample analysed \n \nFollow-up  \n \n \n \n61 pairs filmed \nBed=18; Side-car Crib=23; \nStand-alone Cot=20 \nAll 64 pairs receiving intervention were followed up via \ntelephone at 2, 4, 8 & 16 weeks post-partum. Follow-up \ncompleted by 4.2005 \n3 pairs not filmed (See \nTable 1) \n80 mother-infant pairs excluded \n(See Table 1) \n64 pairs received intervention \nBed = 19; Side-car Crib = 23; \nStand-alone Cot = 22 \n \n \n 5\nTable 1: Reasons for participant exclusion and ineligibility between enrolment and \ndelivery \n \n144 participants enrolled -- Randomly allocated to: \n Bed=48 Side-car crib=50 Stand-alone cot=46 \nExclusion following delivery: \nC-section 9 14 12 \nParticipant withdrew 1 3 5 \nOpiate analgesia 3 3 1 \nBaby unwell 1 0 1 \nStillbirth 1 0 0 \nMother unwell 1 0 0 \nTotal excluded 16 20 19 \nIneligible mothers: \nNo camera available 2 1 0 \nNo single room available 7 5 3 \nMissed notification of delivery  4 1 2 \nTotal ineligible 13 7 5 \nTotal excluded\/ineligible 29 27 24 \nTotal eligible participants 19 23 22 \nTotal eligible & videoed 18 dyads 23 dyads 20 dyads \n \nAll 61 mothers who participated in filming were interviewed before discharge. A \ncomparison of eligible and ineligible participants found no statistical differences in \nmaternal age, marital status, education and income. \n \nCompliance with the allocated sleeping condition was defined as the infant spending \ngreater than 50% of observed sleep time in the allocated condition per night. Of the 61 \nparticipants eligible for analysis, 5 did not comply with their allocated condition on both \nnights, while a further 14 did not comply on one night. All 61 videoed participants were \nanalysed according to their randomly allocated condition (Intention to Treat Analysis) \nregardless of cross-over. Participants who crossed-over from bed to stand-alone cot, \nside-car crib to bed, and stand-alone cot to bed did so of their own preference. Baseline \ndemographic and clinical characteristics of the three intervention groups are provided in \nTable 2. \n \nTable 2: Characteristics of the three randomised groups that were videoed. \n  \n Mother’s Bed \n(n=18) \nSide-car Crib \n(n=23) \nStand-alone Cot \n(n=20) \nMean maternal age [years] (range) 32.8  (28-39) 31.4 (21-40) 30.9 (22-37) \nMean infant age at filming [hours] (range)  15.4 (3.5-26) 16.6 (6.8-27.5) 17.6 (6.5-28) \nMean gestation length [days] (range) 283.9 (268-298) 283.2 (270-293) 280.6 (263-292) \nMean birth weight [kg] (range)  3.3 (2.8-4.0) 3.4 (2.6-4.3) 3.5 (2.9-4.3) \nEthnicity n (%) \n    White European \n    Asian \n \n16 (89%) \n 2 (11%) \n \n22 (96%) \n 1 (4%) \n \n29 (95%) \n1 (5%) \nLabour n (%) \n    Spontaneous \n    Induced \n \n16 (89%) \n 2 (11%) \n \n17 (77%) \n 5 (22%) \n \n16 (80%) \n 4  (20%) \nMedian 5 min APGAR (range) 9 (8-10) 9 (9-10) 9 (9-10) \nMedian time at delivery since previous \nmaternal sleep [hours] (range)  \n36.0 (20-60) 36.0 (4-96) 36.0 (12-72) \nMedian duration of maternal sleep post-\ndelivery before filming [hours] (range)  \n0.3 (0-8) 1.3 (0-8) 0.8 (0-6) \nMean duration of initial breastfeeding \nopportunity  on delivery suite [mins] (range) \n25.0 (5-60) 19.0 (5-90) 23.0 (5-35) \n \n 6\n 7\nPrimary outcomes  \nWe analysed data by ‘intention to treat’. As shown in Table 3 mothers and babies \nallocated to the bed and side-car crib conditions made significantly more attempts to \nfeed (both successful and unsuccessful); and exhibited more feeding effort, than babies \nallocated to the stand-alone cot, but there was no difference between infants allocated to \nthe bed and side-car crib.  \n \nNone of the 61 infants experienced adverse events or side effects in the course of this \nstudy. However we observed potential risk-events for 2 of the 6 pre-defined hypothetical \nrisk categories: breathing risk and falling risk. Potential breathing risk, but not falling risk, \nwas recorded significantly more frequently and for a significantly greater duration, in the \nbed condition, than in the side-car crib or stand-alone cot conditions.  \nTable 3: Breastfeeding outcome and potential risk events by allocated sleep condition.   \n Bed \nn=18 \nSide-car \ncrib \nn=23 \nStand-alone \ncot \nn=20 \nBed vs Stand-alone cot \n \nSide-car crib vs Stand-alone cot \n \nBed vs Side-car crib \n \n Median frequency per hour (range) Mean difference \n(95% CI) \np (Mann-\nWhitney U) \nMean difference \n(95% CI) \np (Mann-\nWhitney U) \nMean difference \n(95% CI) \np (Mann-\nWhitney U) \nAttempted feeds \n \n1.3 (0.0-11.5) 2.1 (0.0-9.1) 0.7 (0.0-6.9) 1.87 (0.63-3.11) 0.012 1.57 (0.58-2.57) 0.008 0.30(-1.12-1.72) 0.64 \nSuccessful feeds \n \n1.2 (0.0-6.0) 1.3 (0.0-7.3) 0.5 (0.0-6.6) 0.90 (0.19-1.61) 0.003 0.96 (0.18-1.73) 0.013 -0.06(-0.95-0.83) 0.93 \nFeeding effort \n \n2.5 (0.0-17.5) 3.4(0.0-14.3) 1.3 (0.0-12.9) 2.56 (0.72-4.41) 0.008 2.52 (0.87-4.17) 0.006 0.04(-2.10-2.18) 0.97 \nAll potential risk \n \n0.0 (0.0-1.0) 0.0 (0.0-1.2) 0.0 (0.0-0.6) 0.13 (0.03-0.23) 0.100 0.04 (-0.03-0.12) 0.196 0.09 (-0.03-0.21) 0.006 \nBreathing risk \n \n0.0 (0.0-1.0) 0.0 (0.0-0.6) 0.0 (0.0-0.6) 0.11 (0.01-0.21) 0.158 0.02 (-0.03-0.07) 0.328 0.09 (-0.01-0.19) 0.027 \nFalling risk \n \n0.0 (0.0-0.5) 0.0 (0.0-0.6) 0.0 (0.0-0.0) 0.02 (-0.01-0.06) 0.858 0.02 (-0.12-0.06) 0.166 0.002 (-0.05-0.51) 0.125 \n Median proportional (%) duration (range)       \nAll potential risk \n \n0.0 (0.0-13.3) 0.0 (0.0-2.3) 0.0 (0.0-6.0) 1.03 (-0.07-2.12) 0.145 -0.05 (-0.40-0.30) 0.118 1.08 (0.06-2.10) 0.007 \nBreathing risk \n \n0.0 (0.0-13.3) 0.0 (0.0.-1.3) 0.0 (0.0-6.0) 0.92 (-0.16-1.99) 0.130 -0.12 (-0.44-0.21) 0.355 1.04 (0.05-2.02) 0.030 \nFalling risk \n \n0.0 (0.0-0.5) 0.0 (0.0-0.2) 0.0 (0.0-0.0) 0.02 (-0.02-0.06) 0.835 0.01 (-0.00-0.02) 0.166 0.01 (-0.02-0.05) 0.125 \n \n 8 \nOther outcomes \nMaternal and infant sleep duration, maternal satisfaction and the amount of staff \ncontact time with the mother were analysed (see Table 4). The median proportional \nsleep duration (range) for mothers was 64.5% (11.8-99.8) and for infants was 65.9% \n(6.5-99.8).  Maternal satisfaction scores were below the mid-point of the scale for \nmothers allocated to the stand-alone cot condition, and above the mid-point for \nmothers allocated to the bed and side-car crib conditions, but none of the differences \nwere significant.  We assessed demands on staff time in three ways: frequency per \nhour of calls to staff made by mothers, frequency per hour of visits to mothers by \nward-staff, and duration of staff visits. Mothers allocated to the bed and side-car crib \nconditions called staff significantly more frequently than mothers allocated to the \nstand-alone cot condition; however we found no differences in the frequency or \nduration of visits to mothers initiated by staff. \n 9\nTable 4: Comparison of sleep, satisfaction and staff time across 3 sleeping conditions \n Bed \nn=18 \nSide-car crib \nn=23 \nStand-alone \ncot \nn=20 \nBed vs Stand-alone cot \n \nSide-car crib vs Stand-alone \ncot \n \nBed vs Side-car crib \n \n  \nMedian proportional duration (range) \nMean difference \n(95% CI) \np  \n(M-W U) \nMean difference \n(95% CI) \np  \n(M-W U) \nMean difference \n(95% CI) \np  \n(M-W U) \nMaternal sleep \nduration \n59.4 (18.7-\n98.2) \n65.6 (11.8-\n98.2) \n66.7 (12.5-\n99.8) \n-0.29 (-11.0-10.4) 0.499 -5.26 (-15.8-5.2) 0.287 4.97 (-4.6-14.6) 0.642 \nInfant sleep duration 64.6 (20.6-\n99.8) \n66.6 (6.5-98.1) 67.2 (22.8-\n98.6) \n-2.87 (-13.5-7.7) 0.962 -5.29 (-16.0-5.4) 0.375 2.42 (-8.3-13.1) 0.513 \n Mean score (SD)  p (t test)  p (t test)  p (t test) \nMaternal satisfaction 3.1(1.1) 3.2 (0.9) 2.8 (0.8) 0.39 (-0.2-1.0) 0.217 0.46 (-0.9-1.0) 0.096 -0.08 (-0.7-0.6) 0.820 \n Mean frequency per hour (SD)       \nCalls to staff \n(Frequency\/hr) \n0.13 (0.2) 0.17 (0.3) 0.03 (0.1) 0.10 (0.02-0.2) 0.017 0.14 (0.03-0.24) 0.010 -0.03 (-0.2-0.1) 0.617 \nVisits by staff \n(frequency\/hr) \n0.40 (0.5) 0.35 (0.6) 0.28 (0.7) 0.12 (-0.17-0.41) 0.401 0.06 (-0.22-0.35) 0.654 0.05 (0.2-0.3) 0.657 \n Mean proportional duration (SD)       \nDuration of visits by \nstaff \n2.12 (3.6) 1.25 (1.9) 1.05 (3.6) 1.1 (-0.7-2.8) 0.233 0.20 (-1.1-1.6) 0.763 0.87 (-0.5-2.2) 0.205 \n 10 \n \nDISCUSSION \n \nThe results of this randomised trial of three infant sleep locations on the postnatal ward \nillustrate the benefits of unhindered mother-infant contact on the initiation of breastfeeding \nover the immediate postnatal period. Mothers and infants experiencing unhindered \nopportunity for night-time breastfeeding demonstrated greater breastfeeding effort, both in \nattempting to feed, and feeding successfully more often, than when the infants were \nphysically separated by being in a plastic bassinette (stand-alone cot).  \n \nThe importance of the frequency of both successful and unsuccessful feeding attempts in \nthe early post-natal period has long been recognised as a key factor in establishing milk \nproduction, and in learning how to suckle,[2, 12-14] with the frequency of night-time feeds \nbeing of particular significance.[15] High prolactin levels are critical for breastfeeding \ninitiation, and successful long-term lactation depends on the development of sufficient \nprolactin receptors during this initial period – which depends upon frequent feeding.[16] Any \nintervention that increases feeding frequency in the early post-partum period, therefore, has \nthe potential to affect not just breastfeeding initiation, but also long-term breastfeeding \nduration (see [17]). \n \nRegarding infant safety, we found that infants were exposed to potentially hazardous \nsituations (in the form of airway covering) more frequently when allocated to their mothers’ \nbeds than when allocated to the side-car crib or stand-alone cot. It is important to \nacknowledge that all situations identified as potential risks were made using the judgement \nof the observers coding the video tapes, and it is possible that episodes appearing to be a \nrisk on camera may have seemed otherwise from the vantage point of someone in the room. \nThis possibility is supported by the observation that during one episode coded as a potential \nrisk (due to a mother’s arm apparently resting across her infant’s face) a midwife entered the \nroom, checked on the sleeping pair, and left again. What appeared as a risk from our \ncamera angle did not seem to alarm the midwife; however the event remained in the coded \ndata as a potential risk, and therefore contributed to the final outcomes.   \n \nWe also emphasise that as we observed no actual risks, we have no means of assessing \nthe likelihood of a potential risk becoming a real one; none of the infants in this study \nexperienced any adverse effects relating to their experience of potential risks. The infant \nallocated to the bed condition who experienced the greatest frequency of potential breathing \nrisks was a cross-over from the bed to the stand-alone cot, whose observed bouts of airway \ncovering all occurred while sleeping in the stand-alone cot and were all related to swaddling. \nThis demonstrates that the stand-alone cot environment is not free of potential hazards.  \n \nOther analysis of maternal and infant sleep duration on the 1st and 2nd post-natal nights \nrevealed no differences in sleep duration across conditions. Despite the common argument \nthat mothers need an uninterrupted night’s sleep following delivery in order to aid \nrecuperation, two studies [18, 19] found that rooming-in mothers obtained no more or less \nsleep on their initial postpartum nights than did mothers whose infants were consigned to a \nhospital nursery. To this we can now add further evidence that the degree of mother-infant \nproximity does not impact upon post-natal sleep duration, even to the point of the infant \nsharing the mother’s bed.  \n \nWe acknowledge that it is normal practice in randomised trials that all participants who are \nallocated to a randomised condition are followed up and included in the data analysis, \nregardless of whether they subsequently dropped out of the trial. However in this study, due \nto the ethical requirement that mothers be randomised prior to delivery, we experienced a \nhigh post-randomisation exclusion rate due to delivery and postnatal factors, so we confined \nthe analysis to the actual participants. This has the potential to bias the results if the \nexclusions disproportionately cluster in certain randomised groups. Analysis of the effects of \nthe exclusions on the overall sample resulted in the study having lower power than originally \nintended, but as the exclusions were equally distributed across the randomly allocated \nconditions no disproportionate clustering could be observed. The results may still reflect bias \nif the exclusions differed from the participants in some systematic way that we have been \nunable to assess.  \n \nThe results of this study can only be generalised to mothers and infants experiencing vaginal \ndeliveries without receipt of opiate analgesia in the preceding 24 hours. The effect of opiates \nupon infant behaviour is known to be profound,[20-23] and we were sufficiently wary of their \neffects on maternal awareness to consider the use of opiates within 24 hours to be a \ncontraindication for either of the bedding-in conditions.[24] Likewise these results cannot be \ngeneralised to mothers and infants experiencing caesarean section delivery due to the \ncomplicating effects of caesarean section on breastfeeding initiation, mother-infant \ninteraction, and maternal sleep.[25-27] \n \nAs equally frequent feeding took place in both the side-car crib and mother’s bed; and the \npotential for infant risks was equally low for both side-car crib and stand-alone cot, the side-\ncar crib emerges from this study as the most effective post-natal ward sleeping environment \nfor infants in optimising both breastfeeding initiation and infant safety. Bedding-in with the \ninfant in the mother’s bed was effective in breastfeeding initiation. Limitations of the fixed \ncamera-angle used in this study in facilitating assessment of potentially hazardous events \nmeans that the bed-condition may be shown to be an equally sound option with further \nstudy. Future studies to examine the effects on breastfeeding duration from the postnatal \nuse of a side-car crib, and on breastfeeding initiation in groups of mothers with high rates of \nbreastfeeding failure (such as caesarean section) are underway. \n \nACKNOWLEDGEMENTS \n \nNewcastle upon Tyne Hospitals NHS Trust granted approval for this trial to be conducted at \nthe Royal Victoria Infirmary. We are grateful to all the families who volunteered for their \nwillingness to allow us to intrude into the first days of their infants’ lives; and to all the \nmidwifery staff and managers who supported and facilitated this project. We appreciate the \nresearch assistance provided by Paul Macphail, Katherine Guinto and Beverly Bland. \n \nFUNDING \n \nFunding was provided by Babes-in-Arms (www.babes-in-arms.org). The funders had no \ninvolvement in the conduct of the trial or the writing of this paper. \n \nFIGURE LEGENDS \n \nFigure 1: Recruitment and loss of participants \n \nREFERENCES \n \n1 Widstrom AM, Whalberg V, Matthiesen AS, et al. Short term effects of early suckling and touch of \nthe nipple on maternal behaviour. Early Hum Dev 1990;21:153-63. \n2 Inch S. Postnatal care relating to breastfeeding. In: Alexander J, Levy V,  Roch S, eds Midwifery \nPractice - Postnatal Care. A Research Based Approach. Toronto; University of Toronto Press \n1993:19-44. \n 12\n 13\n3 Renfrew MJ, Woolridge MW, Ross McGill H. Enabling women to breastfeed. A review of practices \nwhich promote or inhibit breastfeeding-with evidence-based guidance for practice. London; The \nStationary Office 2000. \n4 Matthiesen A, Ransjo-Arvidson A, Nissen E, et al. Postpartum maternal oxytocin release by \nnewborns: effects of infant hand massage and sucking. Birth 1990;28(1):13-9. \n5 Mikiel-Kostyra K, Mazur J, Boltruszko I. Effect of early skin-to-skin contact after delivery on duration \nof breastfeeding: a prospective cohort study. Acta Paediatr. 2002;91(12):1301-6. \n6 Anderson GC, Moore E, Hepworth J, Bergman N. Early skin-to-skin contact for mothers and their \nhealthy newborn infants. Cochrane Database Syst Rev 2003;2:CD003519. \n7 Yamauchi Y, Yamanouchi I. The relationship between rooming-in\/not rooming-in and breast-feeding \nvariables. Acta Paediatr Scand.1990;79(11):1017-22. \n8 Perez-Escamilla R, Pollitt E, Lonnerdale B, et al. Infant feeding policies in maternity wards and their \neffect on breast-feeding success: an analytical overview. Am J Public Health 1994;84(1):89-97. \n9 General Medical Council. Making and using visual and audio recordings of patients. GMC website: \nhttp:\/\/www.gmc-uk.org\/guidance\/library\/making_audiovisual.asp May 2002. \n10 McKenna JJ. Mosko SS, Richard CA. Bedsharing promotes breastfeeding. Pediatrics  1997 100: \n214-219. \n11 Ball HL. Parent-Infant bed-sharing behaviour: effects of feeding type, and presence of father. Hum \nNat in press. \n12 Salariya F, Easton PM, Cater JI. Duration of breastfeeding after early initiation and frequent \nfeeding. Lancet 1978;2(8100):1141-43 \n13 Hörnell A, Aarts C, Kylberg E, et al. Breastfeeding patterns in exclusively breastfed infants: a \nlongitudinal prospective study in Uppsala, Sweden Acta Paedr 1999;88(2):203-11 \n14 Auerbach K. Evidence-based care and the breastfeeding couple: key concerns. J Midwifery \nWomen's Health 2000;45(3):205-11.  \n15 Tennekoon KH, Arulambalam PD, Karunanayake EH, et al. Prolactin response to suckling in a \ngroup of fully breast feeding women during the early postpartum period. Asia Oceania J Obstet \nGynaecol 1994:20(3):311-9 \n16 Marasco L, Barger J. Cue Feeding: Wisdom and Science Breastfeeding Abstracts. 1999;18(4):28-\n9.  \n17 Ball HL, Ward-Platt, MP Evolutionary medicine on the postnatal ward: a test of mother-infant \nproximity. Evolutionary Anthropology (under review). \n18 Keefe M. The impact of infant rooming-in on maternal sleep at night. J Obstet Gynecol Neonatal \nNurs 1988;17(2):122-6. \n19 Waldenstrom U, Swenson A. Rooming-in at night in the postpartum ward. Midwifery 1991;7(2): 82-\n9. \n20 Righard L, Alade MO.Effect of delivery room routines on success of first breast-feed. Lancet \n1990;336(8723):1105-7. \n21 Nissen E, Lilja G, Widstrom AM, et al. Elevation of oxytocin levels early post partum in women. \nActa Obstet Gynecol Scand 1995;74(7):530-3. \n22 Ransjo-Arvidson AB, Matthiesen AS, Lilja G, et al. Maternal analgesia during labor disturbs \nnewborn behavior: effects on breastfeeding, temperature, and crying. Birth 2001;28:5-12. \n23 Jordan S, Emery S, Bradshaw C, et al. The impact of intrapartum analgesia on infant feeding. Br J \nObstet Gynaecol 2005;112 (7):927-34. \n24 Matheson I, Nylander G. Should pethidine still be administered to women in labor? Tidsskr Nor \nLaegeforen 1999;119(2):234-6.(English abstract) \n25 Perez-Escamilla R, Maulen-Radovan I, Dewey KG. The association between cesarean delivery \nand breast-feeding outcomes among Mexican women. Am J Public Health 1996;86(6):832-36. \n26 Rowe-Murray H, Fisher J. Operative intervention in delivery is associated with comprised early \nmother-infant interaction. Obstet Gynecol 2001;108(10):1068-75. \n27 Rowe-Murray H, Fisher J. Baby friendly hospital practices: cesarean section is a persistent barrier \nto early initiation of breastfeeding. Birth 2002;29(2):124-31. \n \n  \n \n \n \n \n"}