{"doi":"10.1080\/10714420903124168","coreId":"95698","oai":"oai:eprints.lse.ac.uk:26565","identifiers":["oai:eprints.lse.ac.uk:26565","10.1080\/10714420903124168"],"title":"Watching how others watch us: the Israeli media's treatment of international coverage of the Gaza War","authors":["Orgad, Shani"],"enrichments":{"references":[{"id":17240432,"title":"[1929]. Theory of Prose.","authors":[],"date":"1991","doi":"10.2307\/1772546","raw":"Shklovsky, V. 1991 [1929]. Theory of Prose. Illinois, US: Dalkey Archove Press.","cites":null},{"id":17240424,"title":"After Empire: Melancholia or Convivial Culture?","authors":[],"date":"2004","doi":"10.1177\/1474474007082298","raw":"Gilroy, P. (2004). After Empire: Melancholia or Convivial Culture? London: Routledge.","cites":null},{"id":17240436,"title":"Between the nation and the profession: journalists as members of contradicting communities.","authors":[],"date":"2005","doi":"10.1177\/0163443705049073","raw":"Zandberg, E. and Neiger, M. (2005) Between the nation and the profession: journalists as members of contradicting communities. Media, Culture & Society, 27(1), 131-142.","cites":null},{"id":17240428,"title":"from, http:\/\/www.keshev.org.il\/siteEn\/FullNews.asp?NewsID=133&CategoryID=9 Keshev (2009b). The Israeli Media and the War in Gaza: Fourth Review (in Hebrew). Keshev Publications. Retrieved","authors":[],"date":"2009","doi":null,"raw":"Keshev Publications. Retrieved June 2009 from, http:\/\/www.keshev.org.il\/siteEn\/FullNews.asp?NewsID=133&CategoryID=9 Keshev (2009b). The Israeli Media and the War in Gaza: Fourth Review (in Hebrew). Keshev Publications. Retrieved June 2009 from, http:\/\/www.keshev.org.il\/site\/FullNews.asp?NewsID=177&CategoryID=9 Liebes, T. and Kampf, Z. (2009). Black and white and shades of gray: Palestinians in the Israeli media during the 2nd Intifada. The International Journal of Press\/Politics.","cites":null},{"id":17240429,"title":"Have you seen Bloomberg?:’ Satellite news channels as agents of the new visibility.","authors":[],"date":"2008","doi":"10.1177\/1742766508096083","raw":"Liebes, T. and Kampf, Z. (forthcoming). [tbc] Orgad, S. (2008). ‘Have you seen Bloomberg?:’ Satellite news channels as agents of the new visibility. Global Media and Communication, 4(3), 301-327.","cites":null},{"id":17240435,"title":"Journalism, risk and patriotism.","authors":[],"date":"2002","doi":"10.4324\/9780203218136_chapter_11","raw":"Waisbord, S. (2002) Journalism, risk and patriotism. In B. Zelizer and S. Allan (eds) Journalism After September 11 (pp. 201-219). New York: Routledge.","cites":null},{"id":17240433,"title":"Media and Morality.","authors":[],"date":"2007","doi":"10.1177\/02673231070220040804","raw":"Silverstone, R. (2007). Media and Morality. Cambridge: Polity Press.","cites":null},{"id":17240423,"title":"Re-Educating the Imagination: Toward a Poetics, Politics, and Pedagogy of Literary Engagement.","authors":[],"date":"1992","doi":null,"raw":"Bogdan, D. (1992). Re-Educating the Imagination: Toward a Poetics, Politics, and Pedagogy of Literary Engagement. Portsmouth, NH: Boynton\/Cook.","cites":null},{"id":17240426,"title":"The Israeli Media and the War in Gaza: First Review. Keshev Publications. Retrieved","authors":[],"date":"2008","doi":null,"raw":"Keshev (2008). The Israeli Media and the War in Gaza: First Review. Keshev Publications. Retrieved June 2009 from, http:\/\/www.keshev.org.il\/siteEn\/FullNews.asp?NewsID=131&CategoryID=9 Keshev (2009a). The Israeli Media and the War in Gaza: Third Review.","cites":null},{"id":17240430,"title":"The Media and Collective Memory of Yitzhak Rabin's Remembrance.","authors":[],"date":"1999","doi":"10.1093\/joc\/49.3.106","raw":"Peri, Y. (1999). The Media and Collective Memory of Yitzhak Rabin's Remembrance. Journal of Communication, 49(3), 106–124.","cites":null},{"id":17240434,"title":"The new visibility.","authors":[],"date":"2005","doi":"10.1177\/0263276405059413","raw":"Thompson, J. B. (2005) The new visibility. Theory, Culture & Society, 22(6), 31-51.","cites":null},{"id":17240425,"title":"The Uncensored War: The Media and Vietnam.","authors":[],"date":"1986","doi":"10.1017\/s0021875800023288","raw":"Hallin, D. (1986). The Uncensored War: The Media and Vietnam. Oxford: Oxford University Press.","cites":null},{"id":17240431,"title":"What’s unusual about covering politics as usual?","authors":[],"date":"2002","doi":"10.4324\/9780203218136_chapter_2","raw":"Schudson, M. (2002) What’s unusual about covering politics as usual? In B. Zelizer and S. Allan (eds) Journalism After September 11 (pp. 36-47). New York: Routledge.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2009-07","abstract":"This article examines how national broadcast media in Israel reported on the international coverage of the Gaza war. It show how, on the one hand, the national media's treatment of international coverage generated effective estrangement: casting doubt on commonsensical national discourses and encouraging a critical and reflexive reporting. At the same time, the Israeli media's coverage of “how others see us” reinforced attachment: it reproduced consensual and familiar narratives and denied alternative voices. The discussion highlights the significance of journalism during war for cultivating critical distance from national commonsensical narratives, and demonstrates how effective estrangement may be achieved","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/95698.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/26565\/1\/Watching_how_others_watch_us_%28LSERO%29.doc.pdf","pdfHashValue":"b38228e69a8fe24397ce87099716e1952dbef525","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n  \n    \n    \n      oai:eprints.lse.ac.uk:26565<\/identifier><datestamp>\n      2011-05-13T10:24:24Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4D43<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/26565\/<\/dc:relation><dc:title>\n        Watching how others watch us: the Israeli media's treatment of international coverage of the Gaza War<\/dc:title><dc:creator>\n        Orgad, Shani<\/dc:creator><dc:subject>\n        JZ International relations<\/dc:subject><dc:subject>\n        PN1990 Broadcasting<\/dc:subject><dc:description>\n        This article examines how national broadcast media in Israel reported on the international coverage of the Gaza war. It show how, on the one hand, the national media's treatment of international coverage generated effective estrangement: casting doubt on commonsensical national discourses and encouraging a critical and reflexive reporting. At the same time, the Israeli media's coverage of “how others see us” reinforced attachment: it reproduced consensual and familiar narratives and denied alternative voices. The discussion highlights the significance of journalism during war for cultivating critical distance from national commonsensical narratives, and demonstrates how effective estrangement may be achieved.<\/dc:description><dc:publisher>\n        Routledge<\/dc:publisher><dc:date>\n        2009-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/26565\/1\/Watching_how_others_watch_us_%28LSERO%29.doc.pdf<\/dc:identifier><dc:identifier>\n          Orgad, Shani  (2009) Watching how others watch us: the Israeli media's treatment of international coverage of the Gaza War.  Communication Review, 12 (3).  pp. 250-261.  ISSN 1071-4421     <\/dc:identifier><dc:relation>\n        http:\/\/www.tandf.co.uk\/journals\/titles\/10714421.html<\/dc:relation><dc:relation>\n        10.1080\/10714420903124168<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/26565\/","http:\/\/www.tandf.co.uk\/journals\/titles\/10714421.html","10.1080\/10714420903124168"],"year":2009,"topics":["JZ International relations","PN1990 Broadcasting"],"subject":["Article","PeerReviewed"],"fullText":"  \nShani Orgad\nWatching how others watch us: the Israeli \nmedia's treatment of international coverage \nof the Gaza War \n \nArticle (Accepted version) \n(Refereed) \nOriginal citation: \nOrgad, Shani (2009) Watching how others watch us: the Israeli media's treatment of \ninternational coverage of the Gaza War. Communication review, 12 (3). pp. 250-261. \n \nDOI: 10.1080\/10714420903124168\n \n© 2009 Taylor & Francis Group\n \nThis version available at: http:\/\/eprints.lse.ac.uk\/26565\/\n \nAvailable in LSE Research Online: January 2011 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \nWatching How Others Watch Us: \nThe Israeli Media’s Treatment of International Coverage of the \nGaza War \nShani Orgad \n \nINTRODUCTION: WAR REPORTING AND PROPER DISTANCE \n \nJournalists are faced with an extremely difficult challenge in reporting on a \nwar that affects their own people: it requires a level of professional \ndetachment from the events they cover, while at the same time conveying a \nsense of closeness with their community. Yonit Levy, one of Israel’s most \npopular news anchors, was accused of expressing what was perceived as \nexcessive sympathy for the enemy in her coverage of the Gaza war. Channel \n2, which enjoys the highest number of viewers among Israel’s television \nstations, was flooded with complaints and demands that she be fired. Levy’s \nreporting was perceived as too far: she was seen as standing outside her \nnational community. Roni Daniel, Channel 2’s military correspondent, on the \nother hand was criticized by many for being too close: his embrace of Israel \nDefense Force’s (IDF) narrative and his eagerness for battle were satirized on \nEretz Nehederet, an Israeli television show that depicted him, bare chested, \nwith machine-gun bullets strung across his chest and wearing a Rambo-style \nheadband. Daniel represents an extreme case of what Hallin (1986) describes \nas journalists’ tendency in times of crisis to move towards a “sphere of \nconsensus:” reporting events as members of the national community, invoking \npatriotism, adopting unquestioned binary categories of “us” and “them” and \nreasserting the dominant national narrative (Peri, 1999; Schudson, 2002; \nWaisbord, 2002; Zandberg and Neiger, 2005).  \nHow can journalists achieve “proper distance” when reporting on war affecting \ntheir own communities? Silverstone (2007) introduced the term “proper \ndistance” as a way for understanding our mediated relationship to the “other”; \nhere I use it to refer to our relationship to ourselves, as a nation, in time of \nwar. I contend that a degree of estrangement - de-familiarization from the \n 1\ncommonsensical national narrative of “us” - is vital, and especially in times of \nconflict, if journalism is to fulfill its democratic commitment of enabling an \nunderstanding of the issues in more complex, inclusive and moral ways. \nEstrangement describes the process or act that endows an object or image \nwith strangeness; the replacement of the familiar by the strange (Shklovsky, \n1991). It is a discursive and aesthetic technique – removing objects from the \nautomatism of perception (Shklovsky, 1991) by making them strange. But it \nis, fundamentally, also a moral project. The act of distancing the familiar \nclarifies values and decenters our consciousness (Bogdan, 1992). And while, \nas Gilroy (2004, p. 78) argues, it “cannot guarantee undistorted perception of \nthe world,” estrangement “can still be used to show where overfamiliarity \nenters and taken-for-grantedness corrupts.”  \nHowever, estrangement has explosive potential; it can trigger instabilities, \ntensions, and considerable vulnerability, the case of the Abu-Ghraib photos \nbeing a vivid example. The images of the practices of US military personnel in \nthe hidden worlds of Iraqi jails, invited, perhaps forced viewers to see the \nfamiliar and commonsensical – our upstanding and humane soldiers – as \nalien and strange: “our boys” as capable of evil. The photographs were \nextremely disturbing and unsettling to the Western imagination.  \n \nThus, for the media to engender effective estrangement - encourage a self-\nreflexive process of introspection and critical discussion - they must constantly \nstrive for the cultivation of proper distance, both close and far, from ourselves. \nThis is not to imply that journalists should give their audiences only what they \ncan immediately digest; the very essence of estrangement is that it \ndestabilizes consciousness. But reporting, especially in war, should also \nreassure, and at times, console.  \n \nHow can the media engender effective estrangement at times of conflict? In \ntoday’s competitive and complex media environment, visibility is substantially \nexpanded: we can access more stories, from more sources, potentially \nacquiring different visions and achieving distance from the “sphere of \nconsensus” which often governs the national public sphere in time of war. A \n 2\nfundamental aspect of this “new visibility” (Thompson, 2005) is the ability to \nhave alternative visions of the other and see “the enemy” in its humanity. The \nonline documentary series Hometown Baghdad, for example, relates the \nstories of young Iraqis and their daily struggles to survive under the American \noccupation. The series destabilizes commonsensical perceptions of the other \nas depraved, violent, and evil, and as such constitutes a powerful intervention \nin American national consciousness. Similarly, the visibility of Palestinian \nsuffering during the second Intifada, through regular interviews on prime-time \nIsraeli television, encouraged a more reflexive view of the “other” than the \nnarrative that had governed earlier decades and excluded such images from \nnational screens (Liebes and Kampf, 2009).   \n  \nAnother way of engendering estrangement that is becoming central in \ncontemporary mediated wartime, is seeing how others see us. We are \nincreasingly exposed to multiple storytellers relating our story: from \ninternational networks and foreign newspapers to bloggers and citizen \njournalists. As I have shown elsewhere (Orgad, 2008), international networks \nprovide a potent means through which viewers can gain different visions of \ntheir country. During and after conflicts, particularly in small-medium \ndemocratic countries, the question of “how the world sees us” is thoroughly \ndiscussed in national media (e.g. France and Spain, see Orgad, 2008).  \n \nThis article examines the opportunities and limits of seeing how others see us \nthrough the filter of national media, for cultivating effective estrangement. I \nuse the context of the war in Gaza to analyze how national broadcast media \nin Israel reported on the international coverage. I show how, on the one hand, \nthe national media’s treatment of international coverage cast doubt on \ncommonsensical national discourses and encouraged more critical, reflexive \nreporting (estrangement), while reinforcing the consensual, reproducing the \nfamiliar narrative, and denying alternative voices on the other (attachment).  \n \nTHE WAR IN GAZA, AND THE MEDIA \nOn December 19, 2008, after six-months of calm, Hamas resumed rocket \nattacks on villages and towns in Southern Israel. On December 27, 2008, \n 3\nIsrael responded with operation Cast Lead – the most ferocious attack on the \nGaza Strip since the beginning of the Israeli-Palestinian conflict. Hamas \nescalated its rocket attacks on Israel, hitting several major cities: 13 Israelis \nand over 1,300 Palestinians were reported killed. On January 17, 2009, the \nIsraeli government announced a unilateral cease fire and the following day, \nHamas reciprocated, demanding that Israel withdraw its forces from the Gaza \nStrip within a week.  \nFor the first 12 days of the war, the IDF banned correspondents from crossing \ninto the Gaza Strip, defying a Supreme Court order to let in a pool of \nreporters. Correspondents were herded onto a designated hill, overlooking the \nterritory, away from the fighting, which frustrated and angered international \nnews organizations. While some pictures were coming out of Gaza from news \nagencies, such as Reuters and AP, and from networks whose reporters were \nin place before the war started (e.g. Al Jazeera, the BBC), most reporters \nwere restricted to the Israeli side of the border.  \nThe decision to ban the media from entering Gaza was largely a reaction to \nIsrael’s experience in the 2006 Lebanon war when reporters had almost \nunfettered access to the front lines and were able to project, in real time, \npictures from the battlefields. It was claimed that this helped Hezbollah, \nconfused and destabilized the home front, and put soldiers’ lives at risk. Thus, \nthe IDF’s decision to ban the media from Gaza went largely unchallenged by \nthe Israeli public and reporters, notwithstanding the harsh criticism it \nengendered among foreign correspondents and countries. While a sentiment \nof “who cares what the world says” seems to have prevailed among the Israeli \npublic, how the world saw “us” did matter. Discussions in the mainstream \nIsraeli media included ongoing references to international media coverage \nand to “how we are seen by the world”.   \n \nThe following analysis discusses news pieces broadcast on Israel’s two \ncommercial television stations – Channel 2 and Channel 10 - from the \nbeginning of the war to January 19, 2009, two days after the ceasefire came \ninto effect. The 12 news items that were analyzed do not constitute a \n 4\ncomplete or representative sample of all reports that discussed international \ncoverage of the war, however, they are illustrative of how the Israeli media \ninterpreted foreign coverage, and shed light on the opportunities and limits to \nwatching how others watch us.  \n \nANALYSIS:  \nGLIMPSES OF ESTRANGEMENT IN A SPHERE OF CONSENSUS \nOne item was broadcast on Channel 10 on the second day of the war; \nhowever, most of the rest were broadcast after the shelling of the UN school \nin the Jabaliya refugee camp on January 6, 2009, in which, according to UN \nreports, 43 Palestinian civilians, mostly children, were killed. This event \nsparked international condemnation and increasingly critical media coverage \nof Israel’s military operation.  \n \nIn all the reports analyzed, reference to international – mainly American and \nEuropean media and Al Jazeera - was made in the context of discussing the \nIsraeli government’s public diplomacy (“Hasbara”) efforts to cope with the \nimages being shown on foreign networks. All the reports incorporated footage \nfrom foreign channels’ coverage and\/or showed the front pages of foreign \nnewspapers. The footage was often accompanied by voiceovers paraphrasing \nthe content, and sometimes by Hebrew subtitles. \n \nEstrangement  \nI want briefly to highlight three strategies of estrangement which recurred in \nthe news reports’ treatment of international coverage. These are discursive \nand visual techniques that invite de-familiarization and invoke distance from \nthe way in which events commonly were presented by the mainstream \nnational media.1 It is important to note, however, that the distinctions among \nthese strategies are merely analytical; their manifestation in the news reports \nis more messy and harder to distinguish. Also, as I argue later, these \nelements of estrangement in the reports, existed in constant tension with \nelements of attachment – ways in which international coverage was used to \nreproduce and reinforce the familiar, dominant narrative.  \n \n 5\nREVERSAL  \nAll the international news reports that were shown included footage of human \nsuffering of Gazan civilians: distraught Palestinians in scenes of devastation, \nweeping women, wounded adults and children, and dead bodies. In some \nreports, the impact was reinforced by commentary from the Israeli reporter. \nFor example, Channel 10’s reporter, Ilan Goren, described Al Jazeera’s \ndisturbing pictures of wounded children as “indeed difficult to watch…they \nshow bleeding corpses, massacred children” (December 28). The aggressor \nin the international footage shown in the Israeli news reports was the IDF; the \nvisual focus was on the military machinery and the destruction and death it \nwas causing; the verbal narrative focused on the military’s culpability. By \ncontrast, though unsurprisingly, in the Israeli media the victims were primarily \nIsraeli civilians and soldiers (notwithstanding the increased visibility of \nPalestinian suffering, Liebes and Kampf, forthcoming). The aggressor, almost \nexclusively, was Hamas, described as the evil attacking Israeli civilians and \nendangering its own people, especially children, by using them as human \nshields (see Keshev, 2009a).    \n \nShowing these images disrupts - even if in a limited way – dominant \nrepresentations of the war (and the Israeli-Palestinian conflict more broadly) \non national media. It reverses the commonsensical roles - suddenly the main \nvictims are them, and the prime aggressor is us. It is not surprising, therefore, \nthat its exposure provoked denial, and claims that the images had been \nmanipulated to be used as anti-Israel propaganda. At the same time, this \nreversal is a potentially important intervention in the national dominant \nnarrative – together with other changes in the representation of “the enemy” \n(see Liebes and Kampf, forthcoming). Overturning commonsensical roles can \ncreate surprise and distance, and demand reflection. It can trigger a call to \nacknowledge the far more complex and painful reality of war, to admit the \nhuman suffering of “our enemy” and to force a recognition of our part in it and \nour responsibility for its alleviation.  \n \nChannel 2’s report on January 19 is an example of such a call elicited by the \nshowing of international footage. The report starts with a collection of footage \n 6\nfrom foreign networks showing the absolute devastation of houses, and the \nreactions of civilians returning to this ruin the day after the war ended. Then \nthe report moves to the studio where correspondent Suliman al-Shafi \ncomments: “the pictures we’ve seen from the foreign networks cannot do \njustice to the difficult daily reality that the people of Gaza now face.” This is \nfollowed by interviews with Palestinians returning to find their homes \ndestroyed. The report closes with former high-rank military officer, Eyal Ben-\nReuven, in the studio, responding to the international footage shown:  \n \nIn this horrid world of war, there are no happy conflicts…Now, after all \nof this, we should let ourselves feel the pain [of the Palestinians]. We \nare even allowed to view this horror with tears in our eyes, and Israel, \ntogether with the rest of the world, should try to help…We, the soldiers, \nthe commanders, must experience the real the pain of this matter.”  \n \nThis statement (notwithstanding discursive elements of denial, e.g. the use of \neuphemisms and indirect reference to Palestinians’ pain), together with \nSuliman al-Shafi’s comment and interviews with Palestinian survivors, \nconstitute a call to acknowledge the suffering of the other. The reversal \noffered here by international coverage, seemed to have triggered reactions – \nincluding, most unusually, that of a military officer - which challenge the \nnormalized denial of Palestinians’ suffering. It invites viewers to entertain a \ndifferent view of the “enemy,” as human beings, and to feel compassion for \ntheir pain and a responsibility to help them.  \n \nUSE OF ALTERNATIVE VOCABULARY \nAnother way in which the use of international coverage introduces the \npossibility for estrangement is in exposing viewers to a fundamentally different \nvocabulary to describe events, from the language they would normally be \nexposed to. This occurred most vividly after the shelling on January 6 of the \nUN school. Israeli reports showed international footage of wounded children \nand dead bodies described by foreign correspondents as “Carnage in Gaza” \n(Sky News, in Channel 2’s report on January 11), “Gaza Offensive” (CNN, in \nChannel 2’s report on January 11); “Panic and chaos and many bodies” (Sky \n 7\nNews, in Channel 10’s report on January 10); “School Slaughter” (front page \nof the Irish Independent, in Channel 10’s report on January 10), and \n“murderer…genocide…real massacre” (Hugo Chavez on Venezuelan \ntelevision, in Channel 10’s report on January 8). This contrasts with the major \nIsraeli media’s embrace of the IDF narrative, which described the shelling as \na response to Hamas launching attacks from the school compound (Keshev, \n2009b), and used words such as “bombing,” “attack,” and “hit,” (my \ntranslation) to describe Israel’s actions. The international version of events \nwas largely rejected in mainstream media coverage (Keshev, 2009b), but \npresenting viewers with international coverage using a radically different \nvocabulary and offering a fundamentally different interpretation of the event, \nwas a potentially important intervention in the national commonsensical \nnarrative. It demands some questioning, however limited, of our version. And \nit highlights the vulnerability of our truth: we are forced to realize that our story \nis less stable than we had believed, and to consider, even momentarily, \nalternative explanations.  \n \nChannel 10’s report on January 8 is an example of such invitation to viewers \nto rethink the Israeli version of events, following the introduction of an \nalternative vocabulary in international news. It starts with a highly estranging \nexposition of an edited collection of headlines and pictures of bleeding \nchildren being evacuated from the chaos, from Sky News, CBS, ABC, and Al \nJazeera, and the front pages of the UK Guardian and Daily Telegraph \nnewspapers, describing “massacre” and “slaughter.” The Israeli reporter uses \nthis as a springboard for comparing between the UN school event and what \nhappened at Kana in the 2006 Lebanon war - “an event that transformed \nIsrael from a state operating its army, into a war criminal” - a comparison that \nincreases the estrangement.  \n \nGIVING FACE AND VOICE TO CRITICISM \nA third way in which the use of international coverage in national news \ncontributes to the creation of distance from the dominant narrative, and \npresents an opportunity to destabilize Israeli self-righteousness, is in giving \nvoice and face to criticism. The international news footage includes world \n 8\nleaders, well known intellectuals, citizens, and foreign correspondents \ncriticizing Israel, often harshly. While viewers are used to seeing world leaders \nand intellectuals criticizing Israel, the angry faces and voices of foreign \ncorrespondents and international citizens are less familiar – at least in their \ncentrality during this war. “Israel is hiding the facts by keeping us out” said \nDutch reporter Koni Moss in a Channel 2 report (January 11); “the numbers \nspeak for themselves – there are now as we speak 1,000 casualties in Gaza \nand there are 13 casualties in Israel,” BBC Anchor Lyse Doucet criticized \nIsrael in another Channel 2 report (January 14). Seeing the fury on the faces \nof foreign reporters and hearing their criticism invites viewers to see things \nthrough the other’s lens, and perhaps, as a consequence, to position their \nstory in relation to that of the stranger. \n \nThis call to see things through the foreigner’s lens was most effective when \nthe faces and voices were those of citizens across the world. Channel 10’s \nreport (January 10), focusing on the diplomatic initiative of the Israeli \nambassador to the UK, combined footage from UK news networks with \nscenes from the London demonstration against Israel’s military operation. The \ndemonstrators, aware that they are being interviewed for Israeli television, \nlook directly at the camera to convey their rage to the Israeli audience. This is \na rare and powerful moment of estrangement: a call for viewers to view \nthemselves and their story from a distance; to think of themselves as \nstrangers. It is effective because the demonstrators’ criticism is not \nparaphrased by a reporter; it is filmed almost as if the viewers were part of the \ndemonstration and being obliged to face the angry crowd. The critics are not \n“the enemy” – whose criticism it is commonplace to dismiss and deny. Rather, \nthese are citizens of the west – who we (the Israeli viewers), would like to \nthink are similar to ourselves – citizens of liberal, democratic countries. The \ncamera pulls out to a panoramic view of mass march in the streets of London, \nwith the reporter’s voiceover establishing further distance: “From Trafalgar \nSquare to Hyde Park, Israel was looking this week as an absurd history \nrepeating itself.”  \n       \n 9\nAttachment  \nIn exposing Israeli viewers to pictures and stories being shown around the \nworld, the national media provided viewers with “glimpses of estrangement:” \nmomentary opportunities to de-familiarize events and gain a degree of critical \ndistance from the convictions governing the national public sphere during the \nwar. At the same time, those opportunities for estrangement were in constant \ntension with elements reinforcing attachment. Clips of international coverage \nwere often incorporated to reassert commonsensical conceptions of “us” and \n“them,” and to reproduce attachment to a dominant narrative of self-\nrighteousness. Below, I discuss three ways in which the use of international \ncoverage in news reports contained, and in some cases almost erased, the \npotential of the foreigner’s vision for generating a critical questioning of the \nnational commonsensical story. \n \nAESTHETIC DISTANCE FROM THE OTHER’S SUFFERING \nImages of Palestinians’ suffering from international coverage were discussed \nalmost always in terms of their being tools of anti-Israel propaganda rather \nthan evidence of human suffering. The way the footage was edited – often \n“jumping” from one brief excerpt of wounded children to another - and the \ndescription of images as weapons against which Israel has to fight to gain the \nworld’s support, reinforce a distance from the images. Take, for example, \nChannel 2 reporter’s voiceover describing international footage of chaos in \nGaza streets: “The pictures coming from Gaza this week are bleeding more \nand more” (January 11). This description imposes a clear aesthetic (and \ntherefore moral) distance from the reality being documented: it is the pictures \nthat are bleeding, not the human beings within them. It invites the viewers to \nlook at them analytically, rather than as compassionate human beings \nconfronted by distant sufferers. This discursive and visual treatment of the \nfootage of Palestinian sufferers stands in contrast to the portrayal of Israeli \nvictims on national television whose stories received greater length and depth, \nand a personalized, human interest focus - the implication being that these \nwere real accounts of real human suffering.  \n \n 10\nSELECTION, EDITING AND CENSORING  \nIn many of the items, the foreign footage selected mirrored the dominant story \nin the national media. For example, in a Channel 10 report (December 28), a \nshort excerpt from the BBC was selected, showing interviewer, Peter Dobbie, \nfiercely challenging the Hamas spokesperson, ending with Dobbie’s comment \nthat “everybody knows Israel is not a pussycat when it comes to its relations \nwith Hamas.” The BBC, reputed among the Israeli public to be biased against \nIsrael, is shown as Israel’s supporter (“Gillerman!” Israeli reporter Goren \njokingly praises Dobbie, referring to Dan Gillerman, seen by many Israelis as \none of Israel’s greatest spokespersons). Though much criticism of Israel was \naired by the BBC (including in other parts of Dobbie’s interview), the excerpt \nselected was supportive of Israel’s operation. Similarly, a Channel 2 piece \n(January 1) pertaining to present viewers “a range of reports from around the \nworld,” includes a rather selective collection of edited footage from CNN and \nSky News, presenting similar stories of destruction in Gaza as a consequence \nof Israel’s killing of Hamas commander, Niza Rayan. While both networks’ \nfootage includes images of devastated civilians facing the ruins of their town, \nthe emphasis is on the justification for the suffering and destruction: Rayan \nwas “one of the most… outspoken supporters of the suicide bombings” (Sky \nNews shown in this Channel 2 report) and thus Israel regards the operation as \na “major success” (ibid.). These accounts generally mirror the dominant \nofficial narrative governing the Israeli media.  \n \nTwo other editorial choices used repeatedly, contributed to reinforcing familiar \nperceptions of the war. The first refers to selectivity. Many of the international \nnews images shown were the kind of sterile images Israeli television \naudiences have become familiar with over the years: studio presenters, \nelectronic maps of the region, long-shots of the Gaza skyline, and smoke \nplumes. They depict war from a distance. The second refers to the decision to \ncensor images of Palestinian suffering. Channel 10, for example, censored \nfootage from Al Jazeera explaining that the images were too difficult to watch. \nThe editorial decision to blur parts of the international footage denied Israeli \nviewers from seeing pictures they otherwise cannot or did not want to see. \nWhile some would argue that this decision was grounded in an awareness of \n 11\nviewers’ moral sensibilities, it can be seen equally as an act of denial, \ncontributing to a sanitization of war.  \n \nWATCHING OURSELVES ON OTHERS’ SCREENS \nA substantial part of the international news footage shown was of Israeli \nofficials appearing on foreign channels. A Channel 10 report on December 28, \nshows extracts from Defense Minister Ehud Barak’s interviews on Fox, CNN \nand BBC. Barak is seen convinced and assertive, reiterating Israel’s official \nnarrative. There are no challenges from his interviewers; no crack in the \nfamiliar, automatic, dominant narrative of “our just war.” Similarly, a report \n(January 8) following the shelling of the UN school, which provoked severe \ncriticism of Israel’s military operation and block on the supply of humanitarian \naid to the civilian population, shows an excerpt from a foreign news channel’s \ninterview with President Shimon Peres in which, calmly and confidently, he \ndenies claims of a humanitarian crisis in Gaza: “With Israel providing \nhumanitarian aid there is no problem. It’s a false impression.” Peres’s denial \nerases the criticism raised in the first part of the report in footage from \ninternational networks and newspaper headlines, of Israel’s breach of \ninternational law and targeting of children and civilians. This denial is further \navowed by footage of an interview with the French philosopher, Bernard \nHenry-Levy, shown after Peres’s interview, in which Henry-Levy explains that \n“Hamas is the malediction of its people.” This serves as a powerful \nconfirmation of “our” truth, and denial of “their” claims. Excerpts from the \nappearances of other officials on foreign channels are along similar lines. \nRarely are the spokespersons criticized, rather, this self-referential practice \nworks to reinforce the Israeli public’s conviction in Israel’s just war and \nreassure them that Israel’s public diplomacy is successful.   \n \nCONCLUSION: STRIVING FOR EFFECTIVE ESTRANGEMENT \n“Journalism never stands entirely outside the community it reports on” \n(Schudson, 2002, p. 43) and clearly, should not be expected to do so. At the \nsame time, a proper degree of distance from events, particularly in time of \ncrisis, is vital. The ability to see how others picture us in times of crisis, when \nvisions that differ from the dominant national narrative are scarce and difficult \n 12\nto accept, presents an important opportunity for gaining this pivotal distance. \nYet as the analysis of the Israeli media’s treatment of international coverage \nof the Gaza war has shown, realizing this opportunity is far from simple or \nstraightforward.    \n \nIn an attempt to consider ways that reporting can better realize the potential \nfor estrangement in times of war, I want to conclude with a news report that \nrepresents what I consider as “effective estrangement.” The three-minute \nChannel 2 piece broadcast on January 19, provides viewers with the gaze of \na stranger, by using footage from international network coverage. At the same \ntime, it avoids being too critical and invoking too great a distance – a risk that \ncan surface in the act of estrangement, as the case of Yonit Levy illustrates.  \n \nThe piece opens with the reporter’s voiceover: “And now, the pictures we did \nnot see, or did not want to see, or could not see. Today, there is a foreign \nreporter standing by every house in Jabaliya, showing the world, without \ncensorship, what they are seeing.” This rather dramatic introduction, which \nspeaks precisely to the project of estrangement and the battle against denial – \nacknowledging what we could not or did not want to know – is followed by a \ncollection of footage from BBC, ABC, TVE, CNN and Al Jazeera. Foreign \nreporters are shown standing amongst the rubble of Gaza, describing the \nhuge destruction and the helplessness of survivors returning to their homes. \nThe editing of these extracts is minimal; the reporting is accompanied by \nsubtitles in Hebrew. The selected excerpts pose critical questions rarely \nvoiced in the Israeli public sphere during the war: the CNN piece suggests \nvandalism by Israeli soldiers; the ABC reporter discusses accusations that \nIsrael deliberately tried to destroy mosques; Al Jazeera quotes a Palestinian \nwho returns to his home to find his money and jewellery have been plundered, \nas asking: “What kind of human does this to someone’s home?”                   \n \nThe item includes the elements of estrangement discussed earlier, offering \nIsraeli viewers a distance from the narrative of “us,” raising critical questions \nabout Israeli soldiers’ activities and their consequences for the Gaza \npopulation. However, the piece also includes international news reports of \n 13\nPalestinians criticizing Hamas, thus challenging the dominant construction of \nPalestinian society as a single entity that supports Hamas. Including footage \nof Palestinian civilians criticizing both Israel and Hamas breaks down the “us” \nand “them” dichotomy – both sides are presented as accountable for the war; \nboth sides are called to take responsibility for helping the survivors. The \npiece’s sophisticated use and discussion of international news reports de-\nfamiliarizes viewers from the commonsensical narratives and imagery of the \nwar. At the same time it maintains a clear sense of the reporter standing \nwithin the national community he is reporting on, primarily through the \nemployment of the collective “we.” The reporter is the estranger, but \nfundamentally, he is also estranged, as a member of his national community, \nby the pictures of international networks. This news report demonstrates that \njournalism during war can help in effectively cultivating critical distance from \n“our” truth, however difficult this project may be. It is a goal for which I believe \nwar reporters should strive: to help the public gain a new visibility of \nthemselves – constantly considering alternative views and narratives of their \ncountry’s involvement and responsibility in war, and of the other – seeing \nthem as human beings.  \n \nNotes \n                                                 \n1 Surely, claims about the meanings of these news reports should be complemented by research into \naudiences’ reception and the meanings they make of these texts. This investigation is beyond the scope \nof this article. \n \n \nReferences  \n \nBogdan, D. (1992). Re-Educating the Imagination: Toward a Poetics, Politics, \nand Pedagogy of Literary Engagement. Portsmouth, NH: Boynton\/Cook. \n \nGilroy, P. (2004). After Empire: Melancholia or Convivial Culture? London: \nRoutledge.  \n \n 14\n                                                                                                                                            \nHallin, D. (1986). The Uncensored War: The Media and Vietnam. Oxford: \nOxford University Press.  \n \nKeshev (2008). The Israeli Media and the War in Gaza: First Review. Keshev \nPublications. Retrieved June 2009 from, \nhttp:\/\/www.keshev.org.il\/siteEn\/FullNews.asp?NewsID=131&CategoryID=9\n \nKeshev (2009a). The Israeli Media and the War in Gaza: Third Review. \nKeshev Publications. Retrieved June 2009 from, \nhttp:\/\/www.keshev.org.il\/siteEn\/FullNews.asp?NewsID=133&CategoryID=9\n \nKeshev (2009b). The Israeli Media and the War in Gaza: Fourth Review (in \nHebrew). Keshev Publications. Retrieved June 2009 from, \nhttp:\/\/www.keshev.org.il\/site\/FullNews.asp?NewsID=177&CategoryID=9\n \nLiebes, T. and Kampf, Z. (2009). Black and white and shades of gray: \nPalestinians in the Israeli media during the 2nd Intifada. The International \nJournal of Press\/Politics.   \n \nLiebes, T. and Kampf, Z. (forthcoming). [tbc]  \n \nOrgad, S. (2008). ‘Have you seen Bloomberg?:’ Satellite news channels as \nagents of the new visibility. Global Media and Communication, 4(3), 301-327. \n \nPeri, Y. (1999). The Media and Collective Memory of Yitzhak Rabin's \nRemembrance. Journal of Communication, 49(3), 106–124. \n \nSchudson, M. (2002) What’s unusual about covering politics as usual? In B. \nZelizer and S. Allan (eds) Journalism After September 11 (pp. 36-47). New \nYork: Routledge.      \n \nShklovsky, V. 1991 [1929]. Theory of Prose. Illinois, US: Dalkey Archove \nPress.    \n 15\n                                                                                                                                            \n \nSilverstone, R. (2007). Media and Morality. Cambridge: Polity Press.  \n \nThompson, J. B. (2005) The new visibility. Theory, Culture & Society, 22(6), \n31-51.   \n \nWaisbord, S. (2002) Journalism, risk and patriotism. In B. Zelizer and S. Allan \n(eds) Journalism After September 11 (pp. 201-219). New York: Routledge.      \n \nZandberg, E. and Neiger, M. (2005) Between the nation and the profession: \njournalists as members of contradicting communities. Media, Culture & \nSociety, 27(1), 131-142.  \n \n 16\n"}