{"doi":"10.1029\/2010JD014781","coreId":"52439","oai":"oai:nora.nerc.ac.uk:14114","identifiers":["oai:nora.nerc.ac.uk:14114","10.1029\/2010JD014781"],"title":"Is the stratospheric quasi-biennial oscillation affected by solar wind dynamic pressure via an annual cycle modulation?","authors":["Lu, Hua","Jarvis, Martin J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2011","abstract":"In this study, statistical evidence of a possible modulation of the equatorial stratospheric quasi-biennial oscillation (QBO) by the solar wind dynamic pressure is provided. When solar wind dynamic pressure is high, the QBO at 30-70 hPa is found to be preferably more easterly during July-October. These lower stratospheric easterly anomalies are primarily linked to the high-frequency component of solar wind dynamic pressure with periods shorter than 3 years. In annually and seasonally aggregated daily averages, the signature of solar wind dynamic pressure in the equatorial zonal wind is characterized by a vertical three-cell anomaly pattern with westerly anomalies in both the troposphere and the upper stratosphere and easterly anomalies in the lower stratosphere. This anomalous behavior in tropical winds is accompanied by a downward propagation of positive temperature anomalies from the upper stratosphere to the lower stratosphere over a period of a year. These results suggest that the solar wind dynamic pressure exerts a seasonal change of the tropical upwelling that results in a systemic modulation of the annual cycle in the lower stratospheric temperature, which in turn affects the QBO during austral late winter and spring","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/52439.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/14114\/1\/jgrd16759.pdf","pdfHashValue":"63ce1fe3e1229880ec85c54ed5d6492a94377103","publisher":"American Geophysical Union","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:14114<\/identifier><datestamp>\n      2013-11-13T14:50:35Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533234<\/setSpec><setSpec>\n      7375626A656374733D5334<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/14114\/<\/dc:relation><dc:title>\n        Is the stratospheric quasi-biennial oscillation affected by solar wind dynamic pressure via an annual cycle modulation?<\/dc:title><dc:creator>\n        Lu, Hua<\/dc:creator><dc:creator>\n        Jarvis, Martin J.<\/dc:creator><dc:subject>\n        Physics<\/dc:subject><dc:subject>\n        Atmospheric Sciences<\/dc:subject><dc:description>\n        In this study, statistical evidence of a possible modulation of the equatorial stratospheric quasi-biennial oscillation (QBO) by the solar wind dynamic pressure is provided. When solar wind dynamic pressure is high, the QBO at 30-70 hPa is found to be preferably more easterly during July-October. These lower stratospheric easterly anomalies are primarily linked to the high-frequency component of solar wind dynamic pressure with periods shorter than 3 years. In annually and seasonally aggregated daily averages, the signature of solar wind dynamic pressure in the equatorial zonal wind is characterized by a vertical three-cell anomaly pattern with westerly anomalies in both the troposphere and the upper stratosphere and easterly anomalies in the lower stratosphere. This anomalous behavior in tropical winds is accompanied by a downward propagation of positive temperature anomalies from the upper stratosphere to the lower stratosphere over a period of a year. These results suggest that the solar wind dynamic pressure exerts a seasonal change of the tropical upwelling that results in a systemic modulation of the annual cycle in the lower stratospheric temperature, which in turn affects the QBO during austral late winter and spring.<\/dc:description><dc:publisher>\n        American Geophysical Union<\/dc:publisher><dc:date>\n        2011<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/14114\/1\/jgrd16759.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Lu, Hua; Jarvis, Martin J..  2011  Is the stratospheric quasi-biennial oscillation affected by solar wind dynamic pressure via an annual cycle modulation?   Journal of Geophysical Research, 116 (D6), D06117. 14, pp.  https:\/\/doi.org\/10.1029\/2010JD014781 <https:\/\/doi.org\/10.1029\/2010JD014781>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.agu.org\/journals\/jd\/jd1106\/2010JD014781\/<\/dc:relation><dc:relation>\n        10.1029\/2010JD014781<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/14114\/","http:\/\/www.agu.org\/journals\/jd\/jd1106\/2010JD014781\/","10.1029\/2010JD014781"],"year":2011,"topics":["Physics","Atmospheric Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"  1 \n 1 \nIs the Stratospheric QBO affected by Solar Wind Dynamic 2 \nPressure via an Annual Cycle Modulation? 3 \n 4 \nHua Lu\na,1\n, and Martin J. Jarvis\na\n 5 \n 6 \n 7 \nPrepared for Journal of Geophysics Research 8 \n 9 \n 10 \nRevised December 2010 11 \n 12 \n 13 \n 14 \n 15 \n 16 \n  17 \n1Corresponding author Email: hlu@bas.ac.uk  18 \na Hua Lu, Martin. J. Jarvis, British Antarctic Survey, High Cross, Madingley Road, Cambridge CB3 0ET, 19 \nUnited Kingdom. (email: hlu@bas.ac.uk; mjja@bas.ac.uk) 20 \n 21 \n 22 \n23 \n  2 \n 24 \nAbstract: In this study, statistical evidence of a possible modulation of the equatorial 25 \nstratospheric Quasi-biennial Oscillation (QBO) by the solar wind dynamic pressure is 26 \nprovided. When solar wind dynamic pressure is high, the QBO at 30-70 hPa is found to be 27 \npreferably more easterly during July to October. These lower stratospheric easterly anomalies 28 \nare primarily linked to the high frequency component of solar wind dynamic pressure with 29 \nperiods shorter than 3-years. In annually and seasonally aggregated daily averages, the 30 \nsignature of solar wind dynamic pressure in the equatorial zonal wind is characterized by a 31 \nvertical three-cell anomaly pattern with westerly anomalies both in the troposphere and the 32 \nupper stratosphere and easterly anomalies in the lower stratosphere. This anomalous behavior 33 \nin tropical winds is accompanied by a downward propagation of positive temperature 34 \nanomalies from the upper stratosphere to the lower stratosphere over a period of a year. These 35 \nresults suggest that the solar wind dynamic pressure exerts a seasonal change of the tropical 36 \nupwelling which results in a systemic modulation of the annual cycle in the lower 37 \nstratospheric temperature, which in turn affects the QBO during Austral late winter and 38 \nspring. 39 \n 40 \n41 \n  3 \n 42 \n1. Introduction  43 \nThe quasi-biennial oscillation (QBO) of the equatorial stratosphere is characterized by 44 \nalternating easterly and westerly wind regimes and dominates the variability of the tropical 45 \nlower stratosphere [Naujokat, 1986; Baldwin et al., 2001]. The winds descend from 10 hPa to 46 \n100 hPa at an averaging speed of 1 km\/month and repeat at intervals from 18-36 months, 47 \nwith an average periodicity of ~28 months [Pascoe et al., 2005]. Our current understanding 48 \nof the QBO is largely based on the theoretical augment of Holton and Lindzen [1972] who 49 \nshowed how vertically propagating equatorial waves are absorbed at a critical layer by the 50 \nmean flow and in turn generate alternating acceleration of the zonal flow in either easterly or 51 \nwesterly directions [Plumb and Bell, 1982].  52 \nIn addition to this wave-driven mechanism, seasonal or interannual variation of the QBO 53 \nmay also arise from seasonal changes in tropical upwelling [Dunkerton, 1991; 2000; Holton 54 \net al., 1995; Kinnersley and Pawson, 1996], shifting of latitudinal gradients in the subtropics 55 \n[Randel et al., 1998], or variation of the semi-annual oscillation (SAO) in the tropical upper 56 \nstratosphere [Dunkerton and Delisi, 1997].  Additional temperature change may be caused by 57 \nthe secondary circulation, induced by the QBO itself, which consists of an increase in the 58 \nupwelling at the easterly shear zone and a suppression of the upwelling at the westerly shear 59 \nzone [Plumb and Bell, 1982].  60 \nWhile the QBO is primarily driven by internal wave dynamics, a possible modulation of 61 \nthe QBO via external forcing cannot be ruled out. There is increasing evidence that part of 62 \nvariability in the stratosphere may be linked to the solar activity [Haigh, 2003; Labiztke et al., 63 \n2006; Lockwood et al., 2010; Gray et al., 2010].  Studies have indicated that solar variability 64 \nmay indirectly modulate the QBO through the variation in solar UV irradiance [Salby and 65 \n  4 \nCallaghan, 2000;  Soukharev and Hood, 2001; McCormack, 2003;  Mayr et al., 2005; 2006; 66 \nMcCormack et al., 2007]. Absorption of solar ultraviolet (UV) radiation by ozone may cause 67 \nchanges in temperature and hence in the QBO near the equatorial stratosphere [Hood, 2004; 68 \nCrooks and Gray, 2005; Pascoe et al., 2005]. Such anomalous heating in the upper 69 \nstratosphere may alter Rossby wave propagation and breaking [Cordero and Nathan, 2005; 70 \nMcCormack et al., 2007] and hence cause an indirect dynamic feedback through modulation 71 \nof the polar vortex and the Brewer-Dobson (BD) circulation [Kodera and Kuroda, 2002].  72 \nSalby and Callaghan [2000] examined the radiosonde equatorial zonal wind at 45 hPa for the 73 \nperiod of 1956 1996 and found that the average duration of the westerly QBO (wQBO) 74 \naround solar maxima is ~3 6 months shorter than that around solar minimum. Soukharev and 75 \nHood [2001] performed composite analysis using the radiosonde-derived equatorial zonal 76 \nwind at 50 to 10 hPa from 1957 to 1999 and found that the duration of both QBO phases was 77 \nshorter at solar maxima than at solar minima. Using ECMWF ERA-40 reanalysis, Pascoe et 78 \nal. [2005] found that the average time required for the eQBO to descend from 15 hPa to 44 79 \nhPa is ~2 months less at solar maxima than at solar minima. By using a fully interactive 2D 80 \nChemical\/Dynamical Model, McCormack [2003] and McCormack et al. [2007] found that the 81 \nduration of the wQBO can be 1-3 months shorter at solar maximum than solar minimum. 82 \nThey suggested that the ozone heating induced by solar UV in the upper stratosphere reduces 83 \nthe tendency for a westerly wind and hence produces an anomalously stronger easterly wind 84 \nin the tropical upper stratosphere.  By generating the QBO internally using a high resolution 85 \ngeneral circulation model (GCM), Palmer and Gray [2005] showed that the durations of both 86 \nQBO phases may be reduced by up to 2 months at solar maximum. Cordero and Nathan 87 \n[2005] showed that prescribing higher solar UV inputs produces a QBO with shorter duration 88 \nand larger amplitude.  In addition to the direct ozone heating, wave-ozone feedback has been 89 \nshown to modify the refraction of tropical quasi-stationary Rossby waves, reducing the 90 \n  5 \ntropical upwelling and resulting in faster descent of eQBO [Nathan and Cordero, 2007].  91 \nMayr et al. [2006] prescribed a synthetic period of 10-years with varying amplitude of 92 \nradiative forcing at three different heights (0.2%  surface, 2%  50 km, 20% 100 km) and 93 \ntheir model simulation also resulted in a modulation of the QBO in the stratospheric 94 \nequatorial region which appeared to be generated by this synthetic SC modulation. Mayr et 95 \nal. [2005] suggested that an annual oscillation can originate near 60 km, through which the 96 \nprescribed 10-year modulation could be transferred downward and amplified by tapping the 97 \nmomentum from the upward propagating gravity waves. 98 \nIn contrast, other studies have been unable to find a significant link between solar UV 99 \nand QBO variability. Hamilton [2002] used data from 1950 to 2000 and found a quasi-100 \ndecadal variation in the duration length of the wQBO at 40-50 hPa but the connection with 101 \nthe  11-year solar cycle noted by Salby and Callaghan [2000] did not always hold and the 102 \ncorrelation coefficient was only 0.1 when computed over a longer period which included 22 103 \nwesterly phases. Fischer and Tung [2008] used radiosonde measurements for 1953-2005 and 104 \nshowed that the correlations between the duration of the QBO and the 11-yr SC for either 105 \nphase of the QBO were close to zero. In addition, oppositely-signed correlations were found 106 \nto exist in the pre-1990 and post-1990 periods. More recently, Kuai et al. [2009] also dismiss 107 \nthe solar cycle modulation of the QBO period. With exceedingly long model runs, those 108 \nauthors found that a strong synchronization of the QBO period with integer multiples of the 109 \nSemi-Annual Oscillation (SAO) in the upper stratosphere may generate „„decadal‟‟ variability 110 \nin the QBO period causing a waxing and waning of the correlation between solar forcing and 111 \nthe QBO period. They therefore suggested that the SC-QBO duration relationship reported 112 \npreviously reflects only a chance behaviour resulting from the use of relatively short 113 \nobservational records.   114 \n  6 \nIn addition to solar UV, signature of the solar wind streaming out from the Sun has also 115 \nbeen found in various climate records [Lu et al., 2008a; Lockwood et al., 2010a,b; Woollings 116 \net al., 2010]. The solar wind variability manifests itself at Earth in a number of ways but most 117 \nprominently through geomagnetic activity, thermospheric heating and the aurorae. 118 \nObservational studies have shown that the solar wind induced geomagnetic activity may alter 119 \nstratospheric chemistry indirectly through particle precipitation [Solomon et al. 1982; Randall 120 \net al., 2005; 2007; Seppälä et al. 2007; Siskind et al., 2007]. Chemical-dynamical coupled 121 \ngeneral circulation models (GCMs) have indicated that odd nitrogen (NOx) induced by 122 \nenergetic charged particle precipitation during geomagnetic storms may cause temperature 123 \nchanges in both the polar and equatorial regions and in the stratosphere and the troposphere 124 \n[Langematz et al., 2005; Rozanov et al., 2005; Seppälä et al. 2009].  125 \nOther studies suggested that solar wind induced geomagnetic activity may perturb 126 \natmospheric circulation through a change in planetary wave reflection conditions [Arnold and 127 \nRobinson, 2001; Lu et al. 2008b]. Model simulations by Arnold and Robinson [2001] have 128 \nindicated that a change in planetary wave reflection conditions at the lower thermospheric 129 \nboundary caused by thermsopheric heating induced by solar wind driven geomagnetic 130 \nactivity can reduce planetary wave propagation into the stratosphere, leading to a 131 \nstrengthening of the stratospheric polar vortex and a weakening of the BD-circulation.  132 \nSignificant correlations have also been established between geomagnetic activity and lower 133 \nstratospheric temperature by Lu et al. [2007].  They found that the temperature response to 134 \nthe 11-yr SC and geomagnetic Ap index tend to enhance each other in the tropical upper 135 \ntroposphere and lower stratosphere, the magnitude of the response to geomagnetic activity 136 \nbeing slightly larger than that associated with the 11-yr SC. de Artigasa and Elias [2005] 137 \nhave shown that, when solar flux is high, the eQBO (at 15-50 hPa) is more likely to be 138 \nassociated with high geomagnetic activity and the wQBO is more likely to be associated with 139 \n  7 \nlow geomagnetic activity; at solar minimum, this relationship is reversed. Lu et al. [2008a] 140 \nhave shown that there is a robust relationship between solar wind dynamic pressure and the 141 \nzonal wind and temperature in the northern polar winter. Stratospheric wind and temperature 142 \nvariations are positively projected onto the Northern Annular Mode (NAM) when the 11-yr 143 \nSC is at its maximum phase, and negatively projected onto the NAM during the 11-yr SC 144 \nminimum phase. This implies a weakening of the BD-circulation with reduced upwelling into 145 \nthe lower stratosphere at low-latitude under high solar wind forcing, consistent with the 146 \ntropical warming signals detected by Lu et al. [2007].  147 \nWhile variations in solar radiation are most strongly seen in the 11-year solar cycle, the 148 \nsolar wind induced geomagnetic activity exhibits a strong variability at shorter time scales. 149 \nLu et al. [2008a] shows that the solar wind dynamic pressure and F10.7 solar flux are poorly 150 \ncorrelated, largely due to those shorter time variations. Their weak statistical dependence 151 \nallows the signals associated with the 11-year solar irradiance and the solar wind dynamic 152 \npressure to be separated. However, their mechanisms may not be mutually exclusive and they 153 \ncould be acting together to either enhance or cancel the overall atmospheric responses. 154 \nMotivated by these results and rather strong extra-tropical signals in NH winter and 155 \nspring observed by Lu et al. [2008a], a statistical analysis is conducted here to study possible 156 \nsolar wind dynamic pressure perturbations near the tropics, with a primary focus on detecting 157 \npossible solar wind perturbation of the QBO. We use solar wind dynamic pressure, instead of 158 \ngeomagnetic indices, because geomagnetic indices are measured through the interaction of 159 \nthe terrestrial environment with the solar wind and are therefore not completely independent 160 \nof internal Earth atmospheric processes. For instance, Sugiura and Poros [1977] identified a 161 \nQBO-like periodicity in the disturbed storm time current (Dst) and hence in geomagnetic 162 \nactivity, and Jarvis [1996] has shown a QBO periodicity in geomagnetic daily range induced 163 \nby the semidiurnal tide. Conversely, the solar wind dynamic pressure is measured well 164 \n  8 \noutside of Earth‟s magnetosphere and is therefore wholly independent to the internal 165 \nvariability of the Earth‟s atmosphere. Nevertheless, it can be shown that similar but slightly 166 \nweaker results are obtainable by using geomagnetic Ap index. 167 \n2. Data and Methods  168 \nIn this study, daily QBO is defined as the deseasonalized daily zonal-mean zonal wind 169 \naveraged over the latitude band of 5 S-5 N for five pressure levels at 70, 50, 30 20 and 10 170 \nhPa. Zonal-mean zonal winds are extracted from the ECMWF (European Centre for Medium 171 \nRange Weather Forecasting) ERA40 Reanalysis (September 1957 to August 2002) and 172 \nECMWF Operational analyses (September 2002 to December 2009). The ERA-40 Reanalysis 173 \nwas assimilated using direct radiosonde and satellite measurements [Uppala et al., 2005]. It 174 \nhas a spectral resolution of T159, corresponding to a 1.125º horizontal resolution in latitude 175 \nand longitude and are available at 23 standard pressure surfaces from 1000 hPa to 1 hPa. The 176 \nECMWF Operational data were output from the ongoing analyses produced by the most 177 \nrecent ECMWF Integrated Forecasting System (IFS) model. Data from September 2002 to 178 \nthe present day are available on the same 1.125º grid and but on 21 pressure levels (before 179 \n07\/11\/2007) and 25 pressure levels (since 07\/11\/2007). The ERA-40 and the Operational data 180 \nsets share 21 pressure levels; the exceptions are four levels in the lower troposphere (i.e. 600, 181 \n775, 900, and 950 hPa) which are excluded from this analysis. Nevertheless, the two data sets 182 \nshare the same five pressure heights where the QBOs are estimated.  183 \n It has been established that before the satellite era (i.e. before September 1978), the 184 \nscarcity of SH radiosonde measurements and lack of direct measurement at altitudes above 185 \n10 hPa resulted in unreliable estimations in ERA-40, particularly in the southern hemisphere 186 \nand in the upper stratosphere.  In the tropics, however, Baldwin and Gray [2005] showed that 187 \nthe QBO extracted from ERA-40 is consistent with rocketsonde winds (that were not 188 \n  9 \nassimilated by ERA-40) measured at Ascension and Kwajalein up to the 2-3 hPa altitude 189 \nlevel, even for those years before the satellite era. Pascoe et al. [2005] also found that the 190 \nERA-40 accurately describes the QBO and the tropical stratospheric circulation. We also 191 \ncompared the monthly averaged QBO with those available at the Free University of Berlin 192 \n(FUB) [Naujokat, 1986] for the five pressure levels used here. The two data sets are in good 193 \nagreement with a correlation coefficient greater than 0.9 for all five pressure levels.  In 194 \naddition, the response to solar wind dynamic pressure reported in this paper is found 195 \nprimarily below 10 hPa.  Hence, for these reasons, the results reported here make use of all 196 \navailable data since 1963. Figure 1 shows latitudinally integrated zonal-mean zonal wind at 197 \n5 S-5 N as a function of height (1-100 hPa) for the period of 1958-2009. 198 \n[insert figure 1 here] 199 \nThe upper two panels of figure 1 display the original monthly mean data while the lower 200 \ntwo panels show its deseasonalized anomalies. A prominent Semi-Annual Oscillation (SAO) 201 \nexists near the stratopause level when the data is not deseasonalized. Once deseasonalization 202 \nis applied, the descending alternating easterly and westerly winds of the QBO are the 203 \ndominant feature, with maximum amplitude of ~40 m s\n-1 \nat ~3-5 hPa, where the QBO is 204 \ninitialized. In the upper stratosphere, discernible enhancement of easterly anomalies occurred 205 \nin the 1970s while an enhancement of westerly anomalies occurred from the mid- 1980s to 206 \nthe late 1990s. From 2000 onwards, it becomes comparable to the earlier pattern again. It has 207 \nbeen suggested that the enhanced westerly anomalies seen in the upper stratosphere during 208 \nthe 1980s and 1990s might be a result of data assimilation pre-\/post- satellite era [Punge and 209 \nGiorgetta, 2007]. The extended data seem to suggest it is more likely to be a real 210 \nphenomenon in which a multi-decadal variation is superimposed upon the upper stratospheric 211 \nSAO.   212 \n  10 \nSolar wind dynamic pressure (Psw) measured in Geocentric Earth Magnetic (GEM) 213 \ncoordinates is obtained from the NASA-OMNI site (http:\/\/omniweb.gsfc.nasa.gov\/). This 214 \ndata set is produced from solar wind and interplanetary magnetic field measurements from 15 215 \ngeocentric satellites and 3 spacecraft in orbit around the L1 Sun-Earth Lagrange point and has 216 \nbeen carefully compiled through cross-calibration. Psw has been calculated by NASA-OMNI 217 \nas , where Nsw is the flow density in number of particles per cm\n3\n 218 \nand Vsw is the solar wind speed in km s\n-1\n.\n \nIn physical terms, Psw represents the momentum 219 \nflux of the solar wind and has a unit of nPa (nano Pascals). Daily averages of solar wind Psw 220 \nfrom January 1963 to December 2009, covering ~4.5 solar cycles, together with its monthly 221 \nmean are used here. The main advantage of using the daily data over the monthly mean is that 222 \nthe downward decent of the signals can be studied in more detail. 223 \nThere are a few missing data periods of Psw due to inappropriate positioning of satellites 224 \nor instrument failure. For instance, before August 1965, and also between September 1982 225 \nand October 1994, the data availability is below 50% at hourly resolution, with 8–15 226 \ncomplete days showing as missing data in each month [King and Papitashvili, 2005]. For up 227 \nto 3 days of missing values, a simple interpolation is used to fill the gap. For longer missing 228 \ndata periods, no treatment is applied and those days are ignored by the analysis. For the 229 \nmonths with more than 15 day missing values, monthly Psw is treated as missing data. The 230 \neffect of missing data for running composite\/regression is that different months or seasons 231 \nunder investigation may involve different sample lengths. While the monthly Psw varies from 232 \n1.2 to 6.7, the daily Psw varies from 0.1 to 27 nPa with an arithmetic mean value of 2.5 nPa 233 \nand standard deviation of 1.5 nPa (not shown). 234 \nFigure 2 shows monthly mean Psw and its high and low frequency components, where the 235 \nseparation cutoff period is 36-month. The low frequency Psw shows a quasi-decadal variation 236 \nsuperimposed on a slow varying trend. Its quasi-decadal variation peaks at the minimum 237 \n  11 \nphase of the 11-year solar cycle suggesting an 11-year solar cycle modulation on Psw. There 238 \nis clear evidence of slow-varying 11-year cycle in its high frequency component. 239 \nNevertheless, over the period 1963-2009, the correlation coefficient between Psw and sunspot 240 \nnumber or F10.7 solar flux is below 0.1 on a daily timescale and remains below 0.2 for the 241 \nmonthly mean. This is largely due to the high frequency variation of Psw. Thus, any 242 \nsignificant Psw , signals especially those associated with its high frequency component, should 243 \nbe fairly statistically independent to the signature associated with the 11-year solar cycle. 244 \n [Insert figure 2 here] 245 \nFor simplicity, we use  < 0.25 and  > 0.25 to define low and high solar wind 246 \ndynamic pressure either for the raw Psw or its high frequency component, where stands 247 \nfor the median-normalized values of Psw; transition periods where  ≤ 0.25 are excluded. 248 \nThe same rule is applied to differentiate the westerly and easterly QBO phases. Qualitatively 249 \nsimilar results can be obtained if other definitions, such as mean instead of median for , 250 \nare used. Hereinafter, high and low solar wind dynamic pressure are abbreviated as HP and 251 \nLP.  252 \n3. Results  253 \n3.1 Perturbations caused by Solar Wind Dynamic Pressure  254 \nFigure 3 shows the QBO phase occurrence by month as a percentage separated into high 255 \n(upper panel) and low (lower panel) solar wind dynamic pressure  for 70hPa (left), 50 hPa 256 \n(central) and 30hPa (right) estimated using daily data. Under HP, the difference in occurrence 257 \nbetween eQBO and wQBO is noticeably smaller than it is under LP at all three pressure 258 \nlevels and the difference even reverses at 30 hPa. The largest difference occurs under LP 259 \nconditions during the Austral winter and spring and reduces with increasing altitude. The 260 \ndeparture between the QBO phase occurrence under HP and LP begins in June to July. By 261 \n  12 \nassuming that both the QBO and Psw follow a first-order auto-regressive (AR1) process, we 262 \nuse a Monte Carlo trial-based test [Wang et al., 2006] to determine the significance of the 263 \ndifferences. It is found that the differences under LP at 50 hPa and 70 hPa are significant at 264 \nthe 95% confidence level only for July to October while the difference at 30 hPa are 265 \nsignificant at the 95% for almost the entire year (except December and January).  As a whole, 266 \nthe behavior of the QBO phase occurrence differs from January to June, when the occurrence 267 \nof wQBO hardly changes from LP to HP, to July to December when the occurrence of 268 \nwQBO increases and the occurrence of eQBO decreases significantly under LP. This 269 \nsuggests a higher eQBO to wQBO occurrence ratio in the lower stratosphere under HP than 270 \nunder LP conditions. It suggests that under HP conditions there is either anomalously more 271 \neQBO descent down from higher altitudes or a slower descent rate of the eQBO at 30-70 hPa. 272 \nThe difference becomes weaker and not significant at higher altitudes.  273 \n [Insert Figure 3 here] 274 \nThe same conclusion can be reached if the QBO phase occurrence is grouped according 275 \nto QBO phase and then the occurrence percentages calculated for HP and LP conditions (see 276 \nfigure 4). At 70 hPa during September, nearly 50% of eQBO occurrence takes place under 277 \nHP compared with only 20% under LP; the difference becomes considerably smaller for 278 \nwQBO. The differences under eQBO for August-October for the all three pressure levels 279 \nfrom 30 to 70 hPa are significant at the 95% confidence level or above and at the 90% 280 \nconfidence level for July. This confirms that significantly more eQBO occurred in the lower 281 \nstratosphere during the Austral late winter and spring and a positive relationship exists 282 \nbetween Psw and increased eQBO occurrence. 283 \n[Insert Figure 4 here] 284 \n  13 \nFigure 5a shows the vertical profile of annual mean equatorial zonal wind (solid line) plus 285 \nand minus its one standard deviation. Greater variability exists in the stratosphere than in the 286 \ntroposphere largely due to the QBO. Figure 5b;c;d shows the vertical profile of tropical zonal 287 \nwind anomalies for separated HP and LP conditions under three different sampling 288 \nconditions, i.e. for (b) for 1963-2009, (c) for 1979-2009 and (d) for 1963-2009 but with 289 \nvolcanic eruption affected data excluded. All the vertical profiles of zonal wind anomalies are 290 \ncalculated by using daily deviation from its long-term mean and then aggregating to its 291 \nannual average.  It shows that the modulation of solar wind dynamic pressure on daily 292 \nequatorial zonal wind is marked by a vertically 3-cell structure with westerly anomalies 293 \n(~0.3-0.5 m s\n-1\n) in the troposphere, easterly anomalies (~2 m s\n-1\n) at 20-70 hPa and westerly 294 \nanomalies (~3 m s\n-1\n) at 3-10 hPa under HP-LP. As a whole, this vertical structure accounts 295 \nfor ~5-10% of one standard deviation of the tropical zonal wind for each associated vertical 296 \nregion and these wind differences are significant at the 95% confidence level. Changing the 297 \ndata period from 1963-2009 (figure 5b) to 1979-2009 (figure 5c) or excluding the years 298 \naffected by major volcanic eruptions (figure 5d) does not alter its general pattern or 299 \nsignificant levels. Similar results can also be obtained by excluding the years affected by the 300 \nmajor Niño events.      301 \n[Insert Figure 5 here] 302 \nFigure 6 shows that the same vertical profile of equatorial zonal wind anomalies also 303 \nholds on a seasonal time scale and the general vertical structure remains across all four 304 \nseasons (i.e. December-February, March-May, June-August, and September-November). In 305 \nthe lower stratosphere, the largest and most significant departure from zero wind occurs 306 \nduring Austral winter (June-August). A closer examination also suggests that there is a 307 \nnoticeable seasonal variation in its vertical structure. From December to February, an upward 308 \nshift is obtained for the bottom cell of the stratosphere; from September to November, a 309 \n  14 \ndownward shift is apparent for both top and bottom cells in the stratosphere. The largest 310 \ndifferences between HP and LP conditions in the upper stratosphere occur in SON and DJF 311 \nwhile in the lower stratosphere they occur in MAM and JJA. Similar results can also be 312 \nobtained by excluding the years affected by either the major Niño events or the major 313 \nVolcanic eruptions.  314 \n[Insert Figure 6 here] 315 \nFigure 7a shows the 31-day running composite difference (HP  LP) of the equatorial 316 \nzonal mean zonal wind from June to October. Significant easterly anomalies (~8 m s\n-1\n) are 317 \nfound in 30-70 hPa pressure levels while westerly anomalies (~1 m s\n-1\n) are simultaneously 318 \ndetected in the upper troposphere.  It is apparent that the stratospheric easterly anomalies 319 \ndescend from 10 hPa or above from June and become significant from late July to early 320 \nOctober. Figure 7b shows the same running composite difference except that a high pass 321 \nfilter with a cut-off period of 1095-days (~3 years) is applied to the daily Psw. Note that both 322 \nthe strength of the composite difference and the statistical confidence level are enhanced in 323 \nthe stratosphere, suggesting that not the decadal-scale variability of Psw but the variation of 324 \nPsw at periods below 3 years is responsible for the easterly anomalies at 30-50 hPa. Longer 325 \nterm variation of Psw appears to be responsible to the anomalies at and below 70 hPa.  326 \n[Insert Figure 7 here] 327 \nThe radiative heating induced by volcanic aerosols may also influence the lower 328 \nstratospheric temperature which in turn may lead to stalling of the downward propagation of 329 \nthe QBO [Dunkerton, 1983]. To examine possible contamination by the temporary heating 330 \ncaused by volcanic aerosols, Figure 7c shows the same composite difference as Figure 7b but 331 \nwith the major volcanic affected data (i.e. Agung in March, 1963, El Chichón in March, 332 \n1982, and Pinatubo in June, 1991) excluded.  A quantitatively similar result is obtained, 333 \n  15 \nsuggesting that those easterly anomalies in the lower stratosphere are not strongly biased by 334 \nthe major volcanic induced warming in the lower stratosphere. Note that there are quite a lot 335 \nof missing data in the daily Psw during 1963, 1964, 1982 and 1983 (see figure 2), the 336 \ncontamination of those years are already excluded in the analysis of figure 7a;b, meaning that 337 \nthe data affected by Pinatubo volcanic eruptions are the only difference between figure 7b 338 \nand 7c.  339 \n It has been observed that ozone concentrations and temperature in the tropical lower 340 \nstratosphere (~70 hPa) are anomalously low during the El Niño phase of the El Nino – 341 \nSouthern Oscillation (ENSO) [Randel et al., 2009]. To examine possible bias due to the large 342 \ncooling effect caused by the major El Niño events, figure 7d shows the same analysis as 343 \nfigure 7b but with the major El Niño (i.e. 1972, 1973, 1982, 1983, 1997, and 1998) affected 344 \nyears excluded. Note that, due to missing Psw in 1982 and 1983, the data affected by 1972, 345 \n1973, 1997 and 1998 represent the only difference between figure 7b and 7d.  Again a 346 \nquantitatively similar result is obtained, suggesting that the major El Niño events do not alter 347 \nthe QBO- Psw relationship significantly.  348 \nFigure 8 summarizes the effect of the higher frequency (< 3-yrs, the red line in figure 2) 349 \ncomponents of Psw on the QBO at 50 hPa and 30 hPa (figure 8a;d ), where both Psw and the 350 \nQBO are averaged from July to October. These pressure levels and months are chosen 351 \nbecause the results shown in figures 3, 4 and 7 suggest the largest effect of Psw on the QBO at 352 \nthose levels and during those months.  At both pressure levels, there are significant negative 353 \ncorrelations between mean Psw and the mean QBO. Neither Volcanic eruption nor El Niño 354 \naffected years are found to dominate or alter the correlations significantly. This helps to rule 355 \nout a possible linear contamination of the QBO- Psw relationship by volcanic eruption and the 356 \nmajor El Niño events. However, it does not rule out the possibility that the ENSO might 357 \nmodulate the QBO- Psw relationship through non-linear processes and a possibility 358 \n  16 \nmodulation in other calendar months or at different frequency. This is beyond the scope of 359 \nthe current study. 360 \n[Insert Figure 8 here] 361 \nFigure 9 shows the running composite HP  LP difference of the equatorial zonal mean 362 \ntemperature from January to December. The largest positive anomalies (~2 K) are found from 363 \nAugust to November at 30-50 hPa. Positive anomalies (~ 1 K) are also found at 70-150 hPa 364 \n(becoming significant between 100 and 150 hPa) during the December to June period while 365 \nsignificant negative anomalies (~ 0.5 K) are detected at 300-700 hPa between July and 366 \nOctober.  The two most striking and significant features of figure 9 are: 1) downward 367 \npropagation of positive temperature anomalies in the upper stratosphere from December of 368 \nthe previous year to the lower stratosphere in December of the following year; 2) the 369 \nanomalous warming at ~100 hPa during the Boreal winter and spring and anomalous cooling 370 \nat 700-300 hPa during the Austral winter. The combined effect of these temperature 371 \nanomalies is a systematic annual modulation of the annual oscillation of temperature in the 372 \nlower stratosphere related to solar wind dynamic pressure.  373 \n [Insert Figure 9 here] 374 \nSuch annual cycle modulation can be compared to the annual oscillation normally 375 \npresent in the stratosphere. Figure 10a shows the climatological mean annual pattern of the 376 \ntropical zonal mean zonal wind. The strongest variation appears in the upper stratosphere (1-5 377 \nhPa) with a semi-annual cycle clearly visible. In the lower stratosphere (50-100 hPa), a 378 \nweaker semi-annual cycle also exists and this is roughly in phase of that in the upper 379 \nstratosphere.  In addition, there is a pronounced annual cycle both in the upper and lower 380 \nstratospheres. In the upper stratosphere, the annual cycle is marked by nearly 3 times stronger 381 \neasterly winds in the Boreal winter (~40 m s\n-1\n) than in the Austral winter (~15 m s\n-1\n).  In the 382 \nlower stratosphere, the situation reverses with weaker easterlies occurring in the Boreal 383 \n  17 \nwinter (~2 m s\n-1\n) and stronger easterlies in the Austral winter (~5 m s\n-1\n).  In the 10-50 hPa 384 \nregion where the QBO prevails, the magnitude of zonal mean wind is primarily easterly (~15 385 \nm s\n-1\n). It also shows a modulation by an annual cycle, albeit weak, with stronger easterly 386 \nwinds occurring in the Austral winter.  387 \n[Insert Figure 10 here] 388 \nFigure 10b shows the temperature anomaly (shaded contours) compared to the 389 \nclimatological altitude dependent mean value of tropical zonal mean temperature (thick solid 390 \nlines). In the upper stratosphere, similar to the winds, the SAO dominates. The amplitude of 391 \ntemperature there during the Boreal winter and spring (4-5 K) is about twice as large as it is 392 \nin Austral winter and spring (2-3 K), implying an additional annual cycle influence.  An 393 \nannual cycle dominates at 50-100 hPa with a magnitude of 3 K during the Boreal winter and 394 \n4 K in Austral winter, a peak-to-peak value of ~8 K at 70 hPa. The semi-annual cycle in the 395 \nupper and the annual cycle in the lower stratosphere oppose each other during the Austral 396 \nwinter, resulting in a close to flat temperature climatology at ~20 hPa. The climatological 397 \ntropical mean wind and temperature compare well with previously studies [Baldwin et al., 398 \n2001; Pascoe et al., 2005; Fueglistaler et al., 2009].  399 \nThus the annual oscillation linked to solar wind dynamic pressure (figure 9) works in 400 \nopposition to the normal annual oscillation in the lower stratosphere (i.e. 50-100 hPa), 401 \nreducing its amplitude. It is possible that, because the eQBO is most sensitive to diabatic 402 \nchange in the lower stratosphere and particularly to temperature changes near the tropopause 403 \n[Kinnersley and Pawson, 1996], the modulation effect of solar wind dynamic pressure is 404 \nstronger for eQBO than for wQBO. 405 \nThe seasonal variations of the equatorial wind and temperature anomalies in relation to 406 \nthe variation of solar wind dynamic pressure can also be compared with the seasonal statistics 407 \nof QBO phase transitions.  Figure 11 shows every major phase transition of the QBO between 408 \n  18 \n1953 and 2009 at five different pressure levels grouped by months into histograms, where the 409 \ntransitions before 1958 were determined by using deseasonalized monthly radiosonde data 410 \nand after 1958 were based daily data. The months where the transitions occurred may differ 411 \nby a month or two when compared to the earlier findings [Dunkerton, 1990; Baldwin et al., 412 \n2001; Hampson and Haynes, 2004; Christiansen, 2010] as our deseasonalization is based on 413 \nextended daily (instead of monthly) data from 1958-2009.  In terms of the general 414 \ndistribution of the transitions, they remain similar to the previous studies based on radiosonde 415 \nestimates, especially at 50 hPa. At 30 hPa, the peak of the phase transition tends to occur 416 \nabout two months earlier than those based on monthly NCEP reanalysis [see fig. 1 of 417 \nHampson and Haynes, 2004].   418 \nThe histograms of transitions at 30-70 hPa show a noticeable annual cycle variation for 419 \nboth QBO phases. It is clear from Figure 11 that at 30 and 50hPa the transitions occur less 420 \noften from July to November than other months. The months and pressure levels with 421 \nreduced QBO phase transition coincide with the period\/the height when\/where the effect of 422 \nsolar wind dynamic pressure on both equatorial zonal wind and temperature is most 423 \nsignificant (see figures 9 and 7).  Similarly, the transitions of both the QBO phases at 10 hPa 424 \noccurred far less often during NH winter and spring than during other months. Again, this 425 \ncoincides with the period when solar wind dynamic pressure related positive temperature 426 \nanomalies were found to be present at that pressure level and above (see figure 9).  427 \n [Insert Figure 11 here] 428 \n4. Discussions 429 \nThe variability of the stratospheric QBO is known to be largely characterized by the 430 \n“stalling” of easterly QBO (eQBO) near 30 to 50 hPa as the easterly shear zone tends to 431 \ndescend more irregularly than the westerly shear zone [Naujokat, 1986]. Modeling 432 \n  19 \nsimulations have suggested that the “stalling” of the QBO depends critically on whether 433 \ndeposition of easterly momentum at the equator is sufficient to overcome the tendency for the 434 \neasterly shear zone to be advected upward or held static by the combination of the BD-435 \ncirculation and the QBO-induced residual circulation [Dunkerton, 1991; 2000; Kinnersley 436 \nand Pawson, 1996].  The tropical upwelling of the BD-circulation acts to slow down the 437 \ndescent rate of the QBO and consequently extends the QBO period, or increases the 438 \noccurrence frequency for a given QBO phase. Because of the QBO-induced residual 439 \ncirculation, the effect of the tropical upwelling on the descent of the shear zone depends on 440 \nthe QBO phase. Upward motion is associated with eQBO [Plumb and Bell, 1982]: it 441 \nstrengthens the upwelling so that the descent of the easterly shear zone is slowed further. 442 \nConversely, downward motion is associated with wQBO: it causes cancellation of the 443 \ntropical upwelling so that the BD-circulation imposes a smaller slowing effect on the descent 444 \nof westerly shear zone. As a whole, the descent rate of the wQBO is less affected by 445 \nvariations associated with the BD-circulation than that of the eQBO [Kinnersley and Pawson, 446 \n1996; Dunkerton, 2000; Hampson and Haynes, 2004].  447 \nThe annual variation of the QBO may arise from a seasonal variation of the BD-448 \ncirculation, which is explained by the „„extratropical stratospheric pump‟‟ mechanism 449 \n[Holton et al., 1995]. This is dynamically driven by momentum dissipation of extratropical 450 \nwaves so that air is drawn upward from the tropical troposphere and then poleward and 451 \ndownward at high latitudes causing a seasonal variation in the BD circulation [Yulaeva et al., 452 \n1994]. The periods with stronger overturning require stronger diabatic heating at the 453 \nascending branch and cooling at the descending branch, which cools the stratosphere in the 454 \ntropics and warms it in the polar region.  Because the planetary wave drag in the stratosphere 455 \nis stronger in the northern hemisphere (NH) winter than in the southern hemisphere (SH) 456 \nwinter, it drives stronger upwelling and lower temperatures in the tropical lower stratosphere 457 \n  20 \nduring NH winter. As a result, the descent of the eQBO is preferentially stronger during the 458 \nmonths of May to July, when the tropical upwelling in the lower stratosphere is weakest 459 \n[Baldwin et al., 2001]. Here we show that, on top of the modulation due to the extratropical 460 \nwave-driven BD-circulation, solar wind dynamic pressure may also perturb the tropical zonal 461 \nwind in the lower stratosphere and the largest effect is detected during July to October.     462 \nIt is known that the annual cycle in lower stratospheric temperature plays an important 463 \nrole in the QBO phase transition and occurrence [Fueglistaler et al., 2009]. Previous studies 464 \nhave suggested that the annual synchronization of the QBO phase transition is linked to 465 \nseasonally varying tropical upwelling [Dunkerton, 1990; Hampson and Haynes 2004] and the 466 \nannual cycle is a consequence of faster (slower) tropical upwelling in the Boreal (Austral) 467 \nwinter [Yulaeva et al., 1994; Holton et al., 1995; Rosenlof, 1995]. More recent studies have 468 \nhowever challenged the “extratropical pump mechanism” and have resulted in some debate 469 \nregarding the processes driving upwelling in the tropical BD branch [Fueglistaler et al., 470 \n2009].  It has been shown by both observation and numerical calculation that tropical wave 471 \nforcing produced by convective motion may also be partially responsible for the variation in 472 \nthe lower stratospheric temperature and the QBO [Norton, 2006; Randel et al., 2008; Lu et 473 \nal., 2009; Taguchi, 2009]. Here, we present some statistical evidence of a possible 474 \nmodulation of the lower stratospheric annual cycle via solar wind dynamic pressure Psw and 475 \nthe descent pattern of the QBO and tropical temperature anomalies.  We show that there is a 476 \nsignificant perturbation of tropical zonal wind, apparently related to Psw, in both the 477 \nstratosphere and the troposphere. Based on these results, we suggest that, in addition to 478 \natmospheric internal variability, solar wind driven modulation may also play a role in causing 479 \ninter-annual variation in the strength and descent pattern of the QBO.  480 \nMore recently, Lu et al. [2009] found that the processes that synchronize the QBO exert 481 \ndifferent effects on different QBO phases from season to season. During July and August, the 482 \n  21 \nphase speed is significantly slowed when westerlies prevail through the pressure levels, and 483 \nbecomes more irregular when easterlies are dominating there. They found that tropical 484 \nupwelling alone is insufficient to explain the more irregular behaviour of the eQBO shear 485 \nzone during SH winter and suggested that changes in tropical waves could be involved. A 486 \npossible modulation of the QBO by solar wind dynamic pressure may provide a partial 487 \nexplanation for their observation. Our results on solar wind dynamic pressure related 488 \nperturbation of the QBO add another element to this general picture of the QBO variability 489 \nmechanisms.  As tropical upwelling is generally lower during the Austral winter and spring, a 490 \nseasonal temperature perturbation linked to high Psw may create an environment which 491 \nfavours significantly more easterly shear zone to descend from higher altitudes into the lower 492 \nstratosphere, and\/or a slower descent of the QBO overall.   493 \nIt is worth noting that the seasonal temperature change that we find to be related to solar 494 \nwind dynamic pressure in the stratosphere is ~1 K in the lower stratosphere and ~2 K in the 495 \nupper stratosphere. These values are comparable to the inter-annual variability of tropical 496 \ntemperature associated with ENSO, volcanic eruptions, and the QBO [Randel et al., 2004; 497 \nFueglistaler et al., 2009].  498 \nOur analysis of including or excluding the data affected by the major Volcanic eruptions 499 \nor the major El Niño events showed no obvious bias on the statistically significant 500 \nmodulation of Psw on the QBO. Nevertheless, more detailed study is needed to separate the 501 \neffects of Volcano, ENSO, solar UV and solar wind. One obvious method is multivariate 502 \nregression. However, the main drawback of such analysis is that these mechanisms may not 503 \nbe mutually exclusive and they could act together in a non-linear fashion to either enhance or 504 \ncancel the overall responses. In addition, multivariate regression effectively reduces the 505 \ndegree of the freedom in the data and results in statistically less significant results. Thus, it 506 \nremains technically challenging to separate the different origin\/cause based on limited 507 \n  22 \nobservational data, especially when the interaction is non-linear between the regressive 508 \nvariables. 509 \nLu et al. [2008a] showed that the winter Northern Annular Mode (NAM) is positively 510 \ncorrelated with Psw when the 11-yr SC is at its maximum phase while negative correlation 511 \nbetween Psw and the stratospheric NAM exists in spring at solar minimum. Those 512 \nextratropical signals suggested a weakening of the BD-circulation during winter months with 513 \nreduced upwelling in the low-latitude lower stratosphere when both solar activity and solar 514 \nwind dynamic pressure are high. The reversed relationship in spring implies enhanced BD-515 \ncirculation and anomalous stronger upwelling at low latitudes. Our findings here (see figure 516 \n9) further confirm a seasonal modulation of the BD-circulation, reflected by a significant 517 \nincrease of tropical lower stratospheric temperature which corresponds to an anomalously 518 \nweaker upwelling near the tropics.  . It is also consistent with earlier findings of Lu et al. 519 \n[2007] based on geomagnetic Ap index.  520 \nIt should be noted that distinct differences exist in the extratropical and tropical 521 \nresponses. Firstly, the tropical response reported here does not change sign between winter 522 \nand spring as opposed to the Psw projection onto the NAM which tends to switch from 523 \npositive to negative from NH winter to spring [Lu et al., 2008a]. Secondly, the tropical Psw 524 \nsignals are independent of the 11-yr SC while conversely the extratopical signals are only 525 \nstatistically significant once the data are separated into high and low solar activity. Finally, a 526 \nsignificant response of the QBO to the Psw variation is detected during SH late winter and 527 \nspring rather than during NH winter, when the most robust Psw versus NAM relationship 528 \nholds. Hence, there is no clear evidence to suggest that the tropical response is a direct result 529 \nof the NH extra-tropical response reported previously by Lu et al. [2008a]. This implies that a 530 \nchange in extratropical wave forcing alone is insufficient to explain the signals observed in 531 \nboth the NH polar region during the Boreal winter and spring and the equatorial region 532 \n  23 \nduring the Austral winter and spring. There must be either extra or different mechanisms at 533 \nplay to cause the incompatible signals in the extratropical NH winter.   534 \n5. Summary 535 \nBy using daily and monthly data extending from 1963 to 2009, we have revealed a 536 \nsignificant solar wind dynamics pressure (Psw) relationship to the annual cycle of temperature 537 \nin the tropical tropopause region, which in turn affects the QBO during Austral late winter 538 \nand spring. The main characteristics of this relationship can be summarized as follows. 539 \n1) A significant change in both the strength and phase occurrence frequency of the QBO 540 \nin the lower stratosphere are found in the lower stratosphere in relation to the solar 541 \nwind dynamic pressure. The signature is manifested by stronger and more frequent 542 \noccurrence of easterly anomalies associated with high Psw during July-October in the 543 \nlower stratosphere. The effect is related to much higher frequency variations of Psw 544 \nthan the 11-year solar cycle and the most significant response is found at 30-50 hPa.   545 \n2) The annual averaged vertical profile of the tropical zonal wind anomalies caused by 546 \nPsw perturbation is characterized by a vertical three-cell anomaly pattern with \n \n547 \nwesterly anomalies in the troposphere, easterly anomalies at 20-70 hPa and westerly 548 \nanomalies at 3-10 hPa. Despite its smaller amplitude in comparison to those obtained 549 \nfrom Austral winter and spring months, this well-structured wind anomaly pattern is 550 \nstatistically significant all-year around. There is additional seasonal variation 551 \nsuperimposed on this annual average with noticeable upward movement during the 552 \nBoreal winter and spring and downward movement during the Austral late winter and 553 \nspring, consistent with the known annual cycle effect with stronger upwelling during 554 \nNH winter and weaker upwelling during SH winter. 555 \n3) The tropical temperature response to Psw is characterized by anomalous warming of 2 556 \nK at 30-50 hPa and up to 1 K near the tropopause during the Boreal winter and spring 557 \n  24 \naccompanied by up to 0.5 K cooling in the troposphere during the Austral winter and 558 \nspring. There is an anomalous downward propagation of positive temperature 559 \nanomalies from the upper stratosphere to the lower stratosphere over a period of a 560 \nyear starting from December. The combined effect may cause a systematic 561 \nmodulation of the annual cycle in the tropical stratospheric temperature and wind.  562 \nIt remains to be understood what mechanism can cause the observed seasonal 563 \nmodulation of the annual cycle by solar wind dynamic pressure leading to statistically 564 \nsignificant changes of the QBO. As the annual cycle in tropical temperature and zonal 565 \nwind is strongly coupled to the annual cycle in stratospheric water vapour, ozone and 566 \nwave activity from the troposphere [Mote et al., 1995; Fueglistaler et al., 2009], a next 567 \nstep would be to look for changes in convective water vapour, ozone and\/or upward 568 \npropagating equatorial waves. Through such related research, the pathways by which the 569 \neffect of solar wind variability, which is observable mainly in the lower thermosphere and 570 \nabove, may propagate to the lower atmosphere can be better understood. 571 \n 572 \nAcknowledgements 573 \nWe are very grateful to three anonymous reviewers for their constructive and 574 \ninsightful comments, which helped to reshape the original manuscript. We also thank 575 \nPeter Kirsch at British Antarctic Survey for help with acquiring and managing the ERA-40 576 \nand ECWMF Operational data. 577 \n578 \n  25 \n 579 \nReferences 580 \nArnold, N. F., and T. R. Robinson (2001), Solar magnetic flux influences on the dynamics of the winter middle 581 \natmosphere, Geophys. Res. Lett., 28(12), 2381-2384. 582 \nBaldwin, M. P., and L. J. Gray (2005), Tropical stratospheric zonal winds in ECMWF ERA-40 reanalysis, 583 \nrocketsonde data, and rawinsonde data, Geophys. Res. Lett., 32(9), art. no.-L09806. 584 \nBaldwin, M. P., et al. (2001), The quasi-biennial oscillation, Reviews of Geophysics, 39(2), 179-229. 585 \nChristiansen, B. (2010), Stratospheric bimodality: Can the equatorial QBO explain the regime behavior of the 586 \nNH winter vortex?, J. Clim., 23, 3953-3966. 587 \nCordero, E. C., and T. R. Nathan (2005), A new pathway for communicating the 11-year solar cycle signal to 588 \nthe QBO, Geophys. Res. Lett., 32, L18805, doi:18810.11029\/12005GL023696. 589 \nCrooks, S. A., and L. J. Gray (2005), Characterization of the 11-year solar signal using a multiple regression 590 \nanalysis of the ERA-40 dataset, J. Clim., 18(7), 996-1015. 591 \nde Artigasa, M. Z., and A. Elias (2005), The equatorial stratospheric QBO and geomagnetic activity, J. Atmos. 592 \nSol.-Terr. Phys., 67, 1280–1286. 593 \nDunkerton, T. J. (1983), Modification of stratospheric circulation by race constituent changes?, J. Geophys. 594 \nRes., 88, 10 831–810 836. 595 \nDunkerton, T. J. (1990), Annual variation of deseasonalized mean flow acceleration the the equatorial lower 596 \nstratosphere, J. Meteor. Soc. Japan, 68, 499-508. 597 \nDunkerton, T. J. (1991), Nonlinear propagation of zonal winds in an atmosphere with Newtonian cooling and 598 \nequatorial wavedriving, J. Atmos. Sci., 48, 236–263. 599 \nDunkerton, T. J. (2000), Inferences about QBO dynamics from the atmospheric „„Tape Recorder‟‟ effect, J. 600 \nAtmos. Sci., 57, 230-245. 601 \nDunkerton, T. J., and D. P. Delisi (1997), Interaction of the quasi-biennial oscillation and stratopause 602 \nsemiannual oscillation, J. Geophys. Res., 102(D22), 26,107–26. 603 \nFischer, P., and K. K. Tung (2008), A reexamination of the QBO period modulation by the solar cycle, J. 604 \nGeophys. Res., 113, D07114, doi:07110.01029\/02007JD008983. 605 \nFueglistaler, S., A. E. Dessler, T. J. Dunkerton, I. Folkins, Q. Fu, and P. W. Mote (2009), Tropical tropopause 606 \nlayer, Rev. Geophys., 47, RG1004, doi:1010.1029\/2008RG000267. 607 \n  26 \nGray, L. J., et al. (2010), Solar influence on climate, Rev. Geophys., doi:10.1029\/2009RG000282. 608 \nGray, L. J., S. J. Phipps, T. J. Dunkerton, M. P. Baldwin, E. F. Drysdale, and M. R. Allen (2001), A data study 609 \nof the influence of the equatorial upper stratosphere on northern-hemisphere stratospheric sudden 610 \nwarmings, Q. J. R. Meteorol. Soc., 127(576), 1985-2003. 611 \nHaigh, J. D. (2003), The effects of solar variability on the Earth's climate, Philos. Trans. R. Soc. Lond. Ser. A-612 \nMath. Phys. Eng. Sci., 361(1802), 95-111. 613 \nHamilton, K. (2002), A note on the quasi-decadal modulation of the stratospheric QBO period, J. Clim., 15, 614 \n2562-2565. 615 \nHampson, J., and P. Haynes (2004),  Phase alignment of the tropical stratospheric QBO in the annual cycle. J. 616 \nAtmos. Sci., 61, 2627–2637. 617 \nHolton, J. R., and R. S. Lindzen (1972), An updated theory for the quasi biennial oscillation of the tropical 618 \nstratosphere, J. Atmos. Sci., 29, 1076-1080. 619 \nHolton, J. R., P. H. Haynes, M. E. Mcintyre, A. R. Douglass, R. B. Rood, and L. Pfister (1995), Stratosphere-620 \ntroposphere exchange, Reviews of Geophysics, 33, 403-439. 621 \nHood, L. L. (2004), Effects of solar UV variability on the stratosphere, in Solar variability and its effect on the 622 \nEarth.s atmosphere and climate system, edited by J. Pap, P. Fox, C. Frolich, H. Hudson, J. Kuhn, J. 623 \nMcCormack, G. R. North, W. Sprigg and S. Wu, AGU Monograph Series, Washington D.C. 624 \nJarvis, M. J. (1996), Quasi‐Biennial Oscillation effects in the semidiurnal tide of the Antarctic lower 625 \nthermosphere, Geophys. Res. Lett., 23(19), 2661–2664, doi:10.1029\/96GL02394. 626 \nKane, R. P. (2005), Differences in the quasi-biennial oscillation and quasi-triennial oscillation characteristics of 627 \nthe solar, interplanetary, and terrestrial parameters, J. Geophys. Res., 110, A01108, 628 \ndoi:01110.01029\/02004JA010606. 629 \nKing, J. H., and N. E. Papitashvili (2005), Solar wind spatial scales in and comparisons of hourly Wind and 630 \nACE plasma and magnetic field data, J. Geophys. Res., 110, A02104, doi:02110.01029\/02004JA010649. 631 \nKinnersley, J. S., and S. Pawson (1996), The descent rates of the shear zones of the equatorial QBO, J. Atmos. 632 \nSci., 53, 1937–1949. 633 \nKodera, K., and Y. Kuroda (2002), Dynamical response to the solar cycle, J. Geophys. Res., 107(D24), D4749, 634 \ndoi:4710.1029\/2002JD002224. 635 \nKuai, L., R.-L. Shia, X. Jiang, K. K. Tung, and Y. L. Yung (2009a), Modulation of the period of the Quasi-636 \nBiennial Oscillation by the solar cycle, J. Atmos. Sci., 66(8), 2418-2428. 637 \n  27 \nKuai, L., R. L. Shia, X. Jiang, K. K. Tung, and Y. L. Yung (2009b), Nonstationary Synchronization of 638 \nEquatorial QBO with SAO in Observations and a Model, J. Atmos. Sci., 66, 1654–1664. 639 \nLabitzke, K., M. Kunze, and S. Bronnimann (2006), Sunspots, the QBO and the stratosphere in the North Polar 640 \nRegion - 20 years later, Meteorol. Zeitschrift, 15, 355-363. 641 \nLangematz, U., J. L. Grenfell, K. Matthes, P. Mieth, M. Kunze, B. Steil, and C. Brühl (2005), Chemical effects 642 \nin 11-year solar cycle simulations with the Freie Universität Berlin Climate Middle Atmosphere Model 643 \nwith online chemistry (FUB-CMAM-CHEM), Geophys. Res. Lett., 32, L13803, 644 \ndoi:13810.11029\/12005GL022686. 645 \nLockwood, M., Bell, C., T. Woollings, R. G. Harrison, L. J. Gray, and J. D. Haigh (2010a), Top-down solar 646 \nmodulation of climate: Evidence for centennial-scale change, Environ. Res. Lett., 5, 034008, 647 \ndoi:034010.031088\/031748-039326\/034005\/034003\/034008. 648 \nLockwood, M., R. G. Harrison, T. Woollings, S. K. Solanki (2010b),  Are cold winters in Europe associated 649 \nwith low solar activity? Environ. Res. Lett. 5, 024001. 650 \nLu , B. W., L. Pandolfo, K. Hamilton (2009), Nonlinear representation of the quasi-biennial oscillation. J Atmos 651 \nSci., 66, 1886–1904. 652 \nLu, H., M. J. Jarvis, and R. E. Hibbins (2008a), Possible solar wind effect on the Northern Annular Mode and 653 \nnorthern hemispheric circulation during winter and spring, J. Geophys. Res., 113, D23104, 654 \ndoi:23110.21029\/12008JD010848. 655 \nLu, H., M. A. Clilverd, A. Seppälä, and L. L. Hood (2008b), Geomagnetic perturbations on stratospheric 656 \ncirculation in late winter and spring, J. Geophys. Res., 113, D16106, doi:16110.11029\/12007JD008915. 657 \nLu, H., M. J. Jarvis, H. F. Graf, P. C. Young, and R. B. Horne (2007), Atmospheric temperature response to 658 \nsolar irradiance and geomagnetic activity, J. Geophys. Res., 112, D11109, 659 \ndoi:11110.11029\/12006JD007864. 660 \nMayr, H. G., J. G. Mengel, and C. L. Wolff (2005), Wave-driven equatorial annual oscillation induced and 661 \nmodulated by the solar cycle, Geophys. Res. Lett., 32, L20811, doi:20810.21029\/22005GL023090. 662 \nMayr, H. G., J. G. Mengel, C. L. Wolff, and H. S. Porter (2006), QBO as potential amplifier of solar cycle 663 \ninfluence, Geophys. Res. Lett., 33, L05812, doi:05810.01029\/02005GL025650. 664 \nMcCormack, J. P. (2003), The influence of the 11-year solar cycle on the quasi-biennial oscillation, Geophys. 665 \nRes. Lett.,  30(22), 2162, doi:2110.1029\/2003GL018314. 666 \n  28 \nMcCormack, J. P., D. E. Siskind, and L. L. Hood (2007), Solar-QBO interaction and its impact on stratospheric 667 \nozone in a zonally averaged photochemical transport model of the middle atmosphere, J. Geophys. Res., 668 \n112, D16109, doi:16110.11029\/12006JD008369. 669 \nMote, P. W., K. H. Rosenlof, J. R. Holton, R. S. Harwood, and J. W. Waters (1995), Seasonal-Variations of 670 \nWater-Vapor in the Tropical Lower Stratosphere, Geophys. Res. Lett., 22(9), 1093-1096. 671 \nNathan, T. R., and E. C. Cordero (2007), An ozone-modified refractive index for vertically propagating 672 \nplanetary waves, J. Geophys. Res., 112, D02105, doi:02110.01029\/02006JD007357. 673 \nNaujokat, B. (1986), An update of the observed quasi-biennial oscillation of the stratospheric winds over the 674 \ntropics., J. Atmos. Sci., 43, 1873-1877. 675 \nNorton, W. A. (2006), Tropical wave driving of the annual cycle in tropical tropopause temperatures. Part II: 676 \nModel results, J. Atmos. Sci., 63, 1420–1431. 677 \nPalmer, M. A., and L. J. Gray (2005), Modeling the atmospheric response to solar irradiance changes using a 678 \nGCM with a realistic QBO, Geophys. Res. Lett., 32(24). 679 \nPascoe, C. L., L. J. Gray, S. A. Crooks, M. N. Juckes, and M. P. Baldwin (2005), The quasi-biennial oscillation: 680 \nAnalysis using ERA-40 data, J. Geophys. Res., 110(D8), D08105, doi:08110.01029\/02004JD004941. 681 \nPlumb, R. A., and R. C. Bell (1982), A model of the quasi-biennial oscillation on an equatorial beta-plane, Q. J. 682 \nR. Meteorol. Soc., 108, 335-352. 683 \nPunge, H. J., and M. A. Giorgetta (2007), Differences between the QBO in the first and in the second half of the 684 \nERA-40 reanalysis, Atmos. Chem. Phys., 7, 599–608. 685 \nRandall, C.E., V.L. Harvey, G.L. Manney, Y. Orsolini, M. Codrescu, C. Sioris, S. Brohede, C.S. Haley, L.L. 686 \nGordley, J.M. Zawodny, and J.M. Russell (2005), Stratospheric effects of energetic particle precipitation 687 \nin 2003-2004, Geophys. Res. Lett., 32 (5), L05802, doi:10.1029\/2004GL022003. 688 \nRandall, C.E., V.L. Harvey, C.S. Singleton, S.M. Bailey, P.F. Bernath, M. Codrescu, H. Nakajima, and J.M. 689 \nRussell III (2007), Energetic particle precipitation effects on the Southern Hemisphere stratosphere in 690 \n1992–2005, , J. Geophys. Res., 112, D08308, doi:10.1029\/2006JD007696. 691 \nRandall, C.E., V.L. Harvey, C.S. Singleton, P.F. Bernath, C.D. Boone, and J.U. Kozyra (2006), Enhanced NOx 692 \nin 2006 linked to strong upper stratospheric Arctic vortex, Geophys. Res. Lett., 33, L18811, 693 \ndoi:10.1029\/2006GL027160. 694 \nRandel, W. J., R. R. Garcia, N. Calvo, and D. Marsh (2009), ENSO influence on zonal mean temperature and 695 \nozone in the tropical lower stratosphere, Geophys. Res. Lett., 36, L15822, doi:10.1029\/2009GL039343. 696 \n  29 \nRandel, W. J., F. Wu,  J. M. Russel III,  A. Roche,  J. W. Waters (1998), Seasonal cycles and QBO variations in 697 \nstratospheric CH4 and H2O observed in UARS HALOE data, J. Atmos. Sci., 55, 163-185. 698 \nRandel, W. J., F. Wu, S. J. Oltmans, K. H. Rosenlof, and G. E. Nedoluha (2004), Interannual changes of 699 \nstratospheric water vapor and correlations with tropical tropopause temperatures, J. Atmos. Sci., 61, 2133–700 \n2148. 701 \nRosenlof, K. H. (1995), Seasonal cycle of the residual mean meridional circulation in the stratosphere, J. 702 \nGeophys. Res., 100(D3), 5173–5191, doi:5110.1029\/5194JD03122. 703 \nRozanov, E., L. Callis, M. Schlesinger, F. Yang, N. Andronova, and V. Zubov (2005), Atmospheric response to 704 \nNOy source due to energetic electron precipitation, Geophys. Res. Lett., 32(14), L14811, 705 \ndoi:10.1029\/2005GL023041. 706 \nSalby, M., and P. Callaghan (2000), Connection between the solar cycle and the QBO: The missing link, J. 707 \nClim., 13(14), 2652-2662. 708 \nSeppälä, A., C. E. Randall, M. A. Clilverd, E. Rozanov, and C. J. Rodger (2009), Geomagnetic activity and 709 \npolar surface air temperature variability, J. Geophys. Res., 114, A10312, doi:10.1029\/2008JA014029. 710 \nSeppälä, A., P.T. Verronen, M.A. Clilverd, C.E. Randall, J. Tamminen, V. Sofieva, L. Backman, and E. Kyrölä 711 \n(2007), Arctic and Antarctic polar winter NOX and energetic particle precipitation in 2002-2006, Geophys. 712 \nRes. Lett.,  34, L12810, doi:10.1029\/2007GL029733. 713 \nSiskind, D.E., S.D. Eckermann, L. Coy, J.P. McCormack, and C.E. Randall (2007), On recent interannual 714 \nvariability of the Arctic winter mesosphere: Implications for tracer descent, Geophys. Res. Lett., 34, 715 \nL09806, doi:10.1029\/2007GL029293. 716 \nSolomon, S., P.J. Crutzen, and R.G. Roble, Photochemical coupling between the thermosphere and the lower 717 \natmosphere: 1. Odd nitrogen from 50 to 120 km, J. Geophys. Res., 87, 7206-7220, 1982. 718 \nSoukharev, B. E., and L. L. Hood (2001), Possible solar modulation of the equatorial quasi-biennial oscillation: 719 \nAdditional statistical evidence, J. Geophys. Res., 106(D14), 14855-14868. 720 \nSugiura, M., and D. J. Poros (1977), Solar-Generated Quasi-Biennial Geomagnetic Variation, J. geophys. Res., 721 \n82, 5621–5628. 722 \nTaguchi, M. (2009), Wave driving in the tropical lower stratosphere as simulated by WACCM. Part I: Annual 723 \ncycle, J. Atmos. Sci., 66, 2029–2043. 724 \nUppala, S. M., et al. (2005), The ERA-40 reanalysis, Q. J. R. Meteorol. Soc., 131(612), 2961-3012. 725 \n  30 \nWang, M., J. E. Overland, D. B. Percival, and H. O. Mofjeld (2006), Change in the Arctic influence on Bering 726 \nSea climate during the twentieth century, Int J Climatol, 26(4), 531-539. 727 \nWoollings, T., M. Lockwood, G. Masato, C. Bell, and L. Gray (2010), Enhanced signature of solar variability in 728 \nEurasian winter climate, Geophys. Res. Lett., 37, L20805, doi:20810.21029\/22010GL044601. 729 \nYulaeva, E., J. R. Holton, and J. M. Wallace (1994), On the cause of the annual cycle in tropical lower 730 \nstratospheric temperature, J. Atmos. Sci., 51, 169-174. 731 \n732 \n  31 \n Figure Captions 733 \nFigure 1. Height-time cross section of the monthly-mean zonal wind (top two panels) and the 734 \nQBO time series (i.e. de-seasonalized monthly mean zonal mean zonal wind averaged over 735 \n5 S-5 N) (bottom two panels) for the period of 1958-2009. Red and blue colors represent 736 \nwesterly and easterly winds respectively.  737 \nFigure 2. Time series of monthly solar wind dynamic pressure Psw (blue line), with its high & 738 \nlow frequency components shown as the red and dark solid black lines. The frequency 739 \nseparation is done by treating the original monthly Psw with an order 11 Butterworth high-740 \npass filter with a cut-off period of 36 months. 741 \nFigure 3. The QBO phase occurrences under HP (1\nst\n row), and under LP (2\nnd\n row) at 70-30 742 \nhPa pressure levels (from left to right), calculated based on daily data. Westerly winds 743 \n(wQBO) are donated as solid lines and easterly winds (eQBO) are donated as gray shaded 744 \nand dashed contour lines. wQBO and eQBO are defined as > 0.25 and < 0.25 of the 745 \nnormalized monthly mean of the QBO. 746 \nFigure 4. The QBO phase occurrences in relation to high (HP, solid line with +) and low 747 \n(LP, dashed line with o) solar wind dynamic pressure for eQBO (1\nst\n row), under wQBO (2\nnd\n 748 \nrow) phases at 70-30 hPa pressure levels (from left to right).  HP and LP are defined as > 749 \n0.25 and < 0.25 of the normalized monthly Psw median. 750 \nFigure 5. (a) Vertical profile of the annual mean tropical wind (solid line) and ± one standard 751 \ndeviation (dotted lines); (b) Departure from the annual mean for HP and LP conditions (solid 752 \nlines) for the period of 1963-2009; (c) same as (b) but based on data from 1979-2009; (d) 753 \nsame as (b) but based on data when two years after each major volcanic eruption are 754 \nexcluded. In (b), (c) and (d), 95% confidence intervals are shown as dotted lines for both HP 755 \nand LP conditions.  When the dotted lines do not overlap, it indicates that the average 756 \n  32 \ndifferences between the HP and LP groups are significant at or above the 95% confidence 757 \nlevel. All the departures are calculated as deviations from the monthly mean based on daily 758 \ndata which is then aggregated to give the annual mean departure.  759 \nFigure 6. Same as figure 5b but for December-February (a), March-May (b), June-August 760 \n(c), and September-November (d) means. The departures from the seasonal means are 761 \ncalculated based on daily data aggregated into a seasonal mean departure. The usage of the 762 \nlines and the definition of significant levels are the same as figure 5. 763 \nFigure 7.  Height-time cross section of running composite difference of the daily equatorial 764 \nzonal wind (in m s\n-1\n) from 1\nst\n of June to 30\nth\n of October for HP-LP condition. A 31-day 765 \nrunning window is applied to both the wind and Psw without any time lag. (a): the linear 766 \nregression is based on raw Psw. (b): A high-pass filter with cut-off period of 1095-day (~3-767 \nyears). (c): same as (b) but data affected by the major volcanic eruptions are excluded. (d): 768 \nsame as (b) but data affected by the major El Niño (1972, 1973, 1982, 1983, 1997, and 1998) 769 \nare excluded.  770 \nFigure 8. Correlations between the July to October averaged high frequency Psw (i.e. with 771 \nperiod shorter than 3 years, denoted as Psw JASO) and the averaged QBO for the same calendar 772 \nmonths (denoted as QBO JASO) at 50 hPa (a) and 30 hPa (b), respectively. Individual years are 773 \nshown as two digital numbers. Years affected by major volcanic eruptions and major El Niño 774 \nevents are highlighted as red and green squares. The correlation coefficient, statistical 775 \nconfidence level (in brackets), and number of samples used are given in the top of the panels 776 \n(also in brackets).   777 \nFigure 9.  Same as Figure 7(a), except that the equatorial zonal-mean zonal wind is replaced 778 \nby equatorial zonal-mean temperature and the x-axis are extended from 1\nst\n of the January to  779 \n31\nst\n of the December and y-axis from 1000 hPa to 1 hPa. 780 \n  33 \nFigure 10. (a) Vertical profile of tropical (5 S-5 N) climatological mean annual pattern of 781 \nzonal-mean zonal wind in m s\n-1\n. Westerly winds are donated as solid lines and easterly winds 782 \nare donated as gray shaded and dashed contour lines. (b) Vertical profile of tropical 783 \nclimatological mean annual variation of temperature (thick black lines, lower panel) and 784 \ntemperature anomalies from annual mean profile (shaded contour) in K. Negative 785 \ntemperature anomalies are donated with gray shading. 786 \nFigure 11.  Histograms of the QBO phase transitions (zero crossings based on daily data) at 787 \n10hPa, 20hPa, 30hPa, 50hPa and 70hPa (top to bottom) grouped by month. Westerly to 788 \neasterly transitions are displayed in the left-hand panels, while easterly to westerly transitions 789 \nare shown in the right-hand panels. The climatology and variability faster than 6 months were 790 \nremoved before the transitions were determined. The years of the transitions are donated by 791 \ntwo digital numbers. 792 \nFigure 1\n56\n7  \nraw monthly data\n36-mths highpass\nremaining low frequency\n2\n3\n4\nP\nsw\n   \n (n\nP\n)\n0\n1\nP\n1960 1970 1980 1990 2000\n-2\n-1\nyear\n \nFigure 2\n60\n80\n(%\n)\n70 hPaHP 50 hPaHP\n \n30 hPaHP\n80\n70 hPaLP\n20\n40\nO\ncc\nur\nre\nnc\ne \n50 hPaLP 30 hPaLP\n \neQBO\nwQBO\n40\n60\nO\ncc\nur\nre\nnc\ne \n(%\n)\nJ F M A M J J A S O N D\n20\nJ F M A M J J A S O N D\nCalendar Month\nJ F M A M J J A S O N D\nFigure 3\n40\n50\n60\nur\nre\nnc\ne \n(%\n)\n70 hPaeQBO 50 hPaeQBO 30 hPaeQBO\n50\n60\n70 hPawQBO\n20\n30\nO\ncc\nu\n50 hPawQBO\n \n30 hPawQBO\nJ F M A M J J A S O N D\n20\n30\n40\nO\ncc\nur\nre\nnc\ne \n(%\n)\nJ F M A M J J A S O N D J F M A M J J A S O N D\n \nHP\nLP\nCalendar Month\nFigure 4\n1  \nHP\nLP\n(a) (b)\n10\n100\npr\nes\nsu\nre\n le\nve\nls\n  (\nhP\na)\n1  \nHP\nLP\n-40 -30 -20 -10 0 10 20 30 40\n1000\nU  (m\/s)\n-4 -2 0 2 4\nU\nanomaly\n  (m\/s)\n \n \nHP\nLP\n(c) (d)\n10\n100\npr\nes\nsu\nre\n le\nve\nls\n  (\nhP\na)\n-4 -2 0 2 4\n1000\nU\nanomaly\n  (m\/s)\np\n \n-4 -2 0 2 4\nU\nanomaly\n  (m\/s)\n \nFigure 5\n110\nur\ne \nle\nve\nls\n  (\nhP\na)\nDJF\n \nMAM JJA SON(a) (b) (c) (d)\n-4 -2 0 2 4\n100\n1000\nUanomaly  (m\/s)\npr\nes\nsu\n \nHP\nLP\n-4 -2 0 2 4\nUanomaly  (m\/s)\n-4 -2 0 2 4\nUanomaly  (m\/s)\n-4 -2 0 2 4\nUanomaly  (m\/s)\nFigure 6\n(a)\n(b)\n(c)\n(d)\nFigure 7\n-6\n3\n12\n66\n67\n73\n74\n75\n76 78\n80\n81\n8385 688\n89\n90\n91\n93\n95\n97\n99 0002\n03\n04\n06\n08\n09\n50\nhP\na \n  J\nAS\nO\n(a)    r = -0.41   (98.75%)     (n = 37)\n1\n15\n66\n67\n73\n75\n76\n77\n78\n80\n83\n85\n86\n87\n88\n90\n92\n93\n95\n97\n9902\n04\n0608\n30\nhP\na \n  J\nAS\nO\n(d)    r = -0.42   (99.1%)     (n = 37)(b\n-0.8 -0.4 0 0.4 0.8\n-24\n-15\n77\n79 87\n92\n94\n9698\n01\n05\n07\nPsw  JASO     (nT)\nQ\nB\nO\n5\n-0.8 -0.4 0 0.4 0.8\n-27\n-13\n7479\n81\n89\n91\n94\n96\n98\n00\n01\n030507\n09\nPsw  JASO     (nT)\nQ\nB\nO\n3\nFigure 8\nFigure 9\n(a)\n(b)\nmonth\nFigure 10\nWesterly->Easterly Easterly->Westerly\n10 hPa 06\n04\n90 03\n80 98 00\n85 75 94 81\n02 69 61 84 07 05 76\n88 95 99 08 66 59 68 96 70 79 91 72 62\n64 83 93 78 73 97 57 55 87 54 89 56 74 60 65 58\nJ F M A M J J A S O N D J F M A M J J A S O N D\n20 hPa 07\n06 05\n83 04 97 03 89\n09 67 02 85 96 98 79\n86 91 64 93 95 99 61 86 75 92 87 01 68 84 96 72\n58 60 72 88 53 76 78 73 69 55 66 59 63 82 77 54 60 70 56\nJ F M A M J J A S O N D J F M A M J J A S O N D\n30 hPa 04\n97\n07 00 80 08 92\n74 05 91 09 88 73 90 87\n03 65 79 62 81 86 83 69 71 69 75 82 01 98\n98 56 60 58 72 67 76 93 95 53 57 61 06 66 59 63 77 94 54 84\nJ F M A M J J A S O N D J F M A M J J A S O N D\n50 hPa 07\n03\n98 05 91 08 90\n96 70 89 06 80\n94 65 79 02 04 97 69\n01 84 60 74 62 99 85 71 66 75 87\n77 87 68 54 56 72 58 81 95 78 55 73 61 57 59 63 82 92\nJ F M A M J J A S O N D J F M A M J J A S O N D\n70 hPa\n98 05\n96 79\n84 01 74 07 75\n92 78 73 71 07 08 99 06 85 66\n82 87 70 72 65 89 03 93 95 97 78 90 59 87 91\n63 77 68 94 60 56 54 58 91 09 55 53 73 69 71 80 61 57 63 82\nJ F M A M J J A S O N D J F M A M J J A S O N D\nFigure 11\n"}