{"doi":"10.1109\/TSP.2007.909320","coreId":"102358","oai":"oai:epubs.surrey.ac.uk:1817","identifiers":["oai:epubs.surrey.ac.uk:1817","10.1109\/TSP.2007.909320"],"title":"Novel low-density signature for synchronous CDMA systems over AWGN channel","authors":["Hoshyar, R","Wathan, PP","Tafazolli, Rahim"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-04","abstract":"<p>Novel low-density signature (LDS) structure is proposed for transmission and detection of symbol-synchronous communication over memoryless Gaussian channel. Given N as the processing gain, under this new arrangement, users' symbols are spread over N chips but virtually only d(v) &lt; N chips that contain nonzero-values. The spread symbol is then so uniquely interleaved as the sampled, at chip rate, received signal contains the contribution from only d(c) &lt; K number of users, where K denotes the total number of users in the system. Furthermore, a near-optimum chip-level iterative soft-in-soft-out (SISO) multiuser decoding (MUD), which is based on message passing algorithm (MPA) technique, is proposed to approximate optimum detection by efficiently exploiting the LDS structure. Given beta = K\/N as the system loading, our simulation suggested that the proposed system alongside the proposed detection technique, in AWGN channel, can achieve an overall performance that is close to single-user performance, even when the system has 200% loading, i.e., when beta = 2. Its robustness against near-far effect and its performance behavior that is very similar to optimum detection are demonstrated in this paper. In addition, the complexity required for detection is now exponential to d(c) instead of K as in conventional code division multiple access (CDMA) structure employing optimum multiuser detector.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"IEEE-INST ELECTRICAL ELECTRONICS ENGINEERS INC","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1817<\/identifier><datestamp>\n      2017-07-26T09:05:24Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:63637372<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1817\/<\/dc:relation><dc:title>\n        Novel low-density signature for synchronous CDMA systems over AWGN channel<\/dc:title><dc:creator>\n        Hoshyar, R<\/dc:creator><dc:creator>\n        Wathan, PP<\/dc:creator><dc:creator>\n        Tafazolli, Rahim<\/dc:creator><dc:description>\n        <p>Novel low-density signature (LDS) structure is proposed for transmission and detection of symbol-synchronous communication over memoryless Gaussian channel. Given N as the processing gain, under this new arrangement, users' symbols are spread over N chips but virtually only d(v) &lt; N chips that contain nonzero-values. The spread symbol is then so uniquely interleaved as the sampled, at chip rate, received signal contains the contribution from only d(c) &lt; K number of users, where K denotes the total number of users in the system. Furthermore, a near-optimum chip-level iterative soft-in-soft-out (SISO) multiuser decoding (MUD), which is based on message passing algorithm (MPA) technique, is proposed to approximate optimum detection by efficiently exploiting the LDS structure. Given beta = K\/N as the system loading, our simulation suggested that the proposed system alongside the proposed detection technique, in AWGN channel, can achieve an overall performance that is close to single-user performance, even when the system has 200% loading, i.e., when beta = 2. Its robustness against near-far effect and its performance behavior that is very similar to optimum detection are demonstrated in this paper. In addition, the complexity required for detection is now exponential to d(c) instead of K as in conventional code division multiple access (CDMA) structure employing optimum multiuser detector.<\/p><\/dc:description><dc:publisher>\n        IEEE-INST ELECTRICAL ELECTRONICS ENGINEERS INC<\/dc:publisher><dc:date>\n        2008-04<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1817\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Hoshyar, R, Wathan, PP and Tafazolli, Rahim  (2008) Novel low-density signature for synchronous CDMA systems over AWGN channel   IEEE T SIGNAL PROCES, 56 (4).  pp. 1616-1626.      <\/dc:identifier><dc:relation>\n        10.1109\/TSP.2007.909320<\/dc:relation><dc:language>\n        EN<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1817\/","10.1109\/TSP.2007.909320"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"1616 IEEE TRANSACTIONS ON SIGNAL PROCESSING, VOL. 56, NO. 4, APRIL 2008\nNovel Low-Density Signature for Synchronous\nCDMA Systems Over AWGN Channel\nReza Hoshyar, Member, IEEE, Ferry P. Wathan, Student Member, IEEE, and Rahim Tafazolli\nAbstract—Novel low-density signature (LDS) structure is pro-\nposed for transmission and detection of symbol-synchronous\ncommunication over memoryless Gaussian channel. Given as\nthe processing gain, under this new arrangement, users’ symbols\nare spread over chips but virtually only chips that\ncontain nonzero-values. The spread symbol is then so uniquely\ninterleaved as the sampled, at chip rate, received signal contains\nthe contribution from only number of users, where\ndenotes the total number of users in the system. Further-\nmore, a near-optimum chip-level iterative soft-in-soft-out (SISO)\nmultiuser decoding (MUD), which is based on message passing\nalgorithm (MPA) technique, is proposed to approximate optimum\ndetection by efficiently exploiting the LDS structure. Given\n= as the system loading, our simulation suggested that\nthe proposed system alongside the proposed detection technique,\nin AWGN channel, can achieve an overall performance that is\nclose to single-user performance, even when the system has 200%\nloading, i.e., when = 2. Its robustness against near-far effect\nand its performance behavior that is very similar to optimum de-\ntection are demonstrated in this paper. In addition, the complexity\nrequired for detection is now exponential to instead of as\nin conventional code division multiple access (CDMA) structure\nemploying optimum multiuser detector.\nIndex Terms—Chip-level iterative SISO MUD, Gaussian\nchannel, low-density signature, message passing algorithm, over-\nloaded condition.\nI. INTRODUCTION\nOVER the last decades, code-division multiple access(CDMA) technique has been used by many commercial\nsystems, IS-95 and UMTS to name a few. It formats several\nusers to share a common communication channel simulta-\nneously. Users’ separation can be done by assigning codes,\nnamely the spreading signatures, to each user uniquely. As\nconsequences of this channel sharing, the interference: inter-\nsymbol interference (ISI) and\/or multiple access interference\n(MAI), is inevitable in CDMA-based systems. Precisely, it is\nthese interference that practically limits the performance of\nCDMA-based systems.\nManuscript received August 7, 2006; revised July 28, 2007. The associate ed-\nitor coordinating the review of this manuscript and approving it for publication\nwas Dr. Kostas Berberidis.\nThe authors are with the Mobile Communication Research Group, Centre\nfor Communication Systems Research, University of Surrey, U.K. (e-mail:\nf.wathan@surrey.ac.uk).\nColor versions of one or more of the figures in this paper are available online\nat http:\/\/ieeexplore.ieee.org.\nDigital Object Identifier 10.1109\/TSP.2007.909320\nAs interference-limited systems, logically, their performance\nshould improve if the interference could be mitigated. Signif-\nicant efforts have been made to address different aspects that\nmight reduce the amount of interference and it include spreading\nsignatures optimization, spreading strategy, intensive multiuser\ndetection techniques, and the employment of forward error cor-\nrection (FEC) coding scheme in the form of turbo multiuser de-\ncoding (MUD). However, since this paper will deal with un-\ncoded systems, the FEC techniques will not be discussed fur-\nther.\nIn communication of symbol-synchronous, uncoded CDMA-\nbased systems over memoryless Gaussian channel, where this\npaper concentrates on, the optimal signatures are the orthogonal\nsets. Currently there are many orthogonalizing algorithms avail-\nable, for example Householder and Gram-Schmidt algorithms\n[1], that can be used to construct orthogonal sets. However, it\nis impossible to obtain orthogonal sets in the condition where\nthe number of active users is bigger than processing gain ,\nnamely the overloaded condition. For that condition and without\nthe luxury of optimum MUD techniques at the receiver, it has\nbeen well-studied in the literatures that the optimum sequences\nfor symbol-synchronous memoryless channel are the ones that\nare derived to meet the Welch-bound-equality (WBE), which\nminimizes the variance of the MAI. The equality comes from\nthe fact that the sum of the squared cross-correlations among\nsignatures is equal to Welch’s lower bound devised in [2].\nThe real-valued WBE-based techniques have been proposed in\n[3], [4], while the complex valued ones can be found in [5]\nand [6]. Another techniques to handle overloading (or oversat-\nurated) condition are the family of hierarchy of orthogonal sub-\nsets (HoS) have been proposed in [7]–[9].\nAnother interesting attempts to optimize the signature sets is\nmade by utilizing a feedback to jointly optimize the signature\nand the receiver as proposed in [10]–[12]. Furthermore, Users’\ngrouping strategy has also caught our attention as proposed in\n[13] and its references therein.\nWithout channel information at the transmitter, the interfer-\nence can, thence, be mitigated by using sophisticated multiuser\ndetection techniques at the receiver. The optimum multiuser\ndetector [14] yields the best performance in terms of the achiev-\nable probability of error yet its computational complexity that\nis exponential to prohibit its practical implementation. Later,\nnumerous suboptimum low-complexity detectors have been\nproposed and the tradeoff between performance and complexity\nhave been studied extensively. Some references and tutorial\nabout multiuser detection can be found in [15]–[17]. In the\nclass of linear detector, decorrelator [18], [19] and MMSE\ndetector [20], [21] provide good performance with much lower\n1053-587X\/$25.00 © 2008 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 13,2010 at 14:41:21 UTC from IEEE Xplore.  Restrictions apply. \nHOSHYAR et al.: SYNCHRONOUS CDMA SYSTEMS OVER AWGN CHANNEL 1617\ncomplexity compared to their optimum counterparts. However,\nthey fail to perform at satisfactory level under an overloaded\ncondition as the desired (as well as the interferers’) signal sub-\nspaces become rank-deficient. Furthermore, group multiuser\ndetection strategy have been studied in [22]. Group multiuser\ndetection can be implemented based on both decorrelator [22]\nand MMSE detector [23] and can be used to handle overloaded\ncondition up to some extent. A generalized and improvised\nform of group MUD for overloaded condition have been eval-\nuated in [24], where a decision-feedback detector proposed in\n[25] and [26] is also considered for users grouping strategy.\nAs for class of nonlinear detector, e.g., multistage detection\n[27], successive interference cancellation (SIC) [28] and par-\nallel interference cancelation (PIC) [29], while they offer a very\nsimple detection process yet the performance is highly depen-\ndent on the first estimate being fed to the IC detector. More\nrecently, iterative multiuser detection have also been recom-\nmended by using probabilistic data association (PDA) [30] and\nhave been shown to achieve close to optimum detector. Yet\nagain, its performance degrades rapidly in overloaded condition.\nRecently, another investigation have been conducted and the\nauthor has concluded that to achieve the theoretical capacity\nlimit, the whole channel bandwidth should be devoted for\ncoding. Taking that into account, interleave-division multiple\naccess (IDMA) [31] have been proposed, whereas in contrast\nwith CDMA, IDMA distinguishes its users by assigning a\nunique interleaver for each user and, thus, removing the need of\nspreading process. The reason behind this is that the spreading\nonly adds redundancy to distinguish user without giving any\ncoding gain. By employing a simple convolutional code as FEC\nand with turbo-style processing at the receiver, it results in a\nvery good system performance that achieve near capacity limit.\nThen, the performance will be too dependent on the FEC codes\nbeing employed.\nFrom the above discussions, it is the fact that in CDMA sys-\ntems the interference is sometimes unavoidable at the receiver\ndue to nonorthogonality of the signatures and\/or the effect of\nthe channel. The question is that, if we are to allow some inter-\nference to exist then what is the best possible to manage it such\nthat it can play into our advantage.\nIn conventional CDMA structure, when transmitting over\nmemoryless symbol-synchronous channel, every sample (at\nchip-rate, then it will be named chip for later discussion) of the\nreceived signal will carry the contribution from all users in the\nsystem. In other words, each user sees the contribution from\nall other users at every received chip. If the cross-correlation\nmatrix of the signatures follows some format, optimum MUDs\ncan be deployed with lower complexity, e.g., tree detector\n[7], however, its complexity is still much higher than that of\nlinear-detectors. Recall the result from [7], [31] and the resultant\nsignature matrices derived from WBE-bound [5], we reckon\nthat it is not very necessary to set nonzero-values to all of the\nsignature chips. Our investigation suggests that if an intelligent\narrangement can be made to change the system’s interference\npattern, a performance improvement can be achieved.\nFurthermore, inspired by our investigation above and the\nrecent success of the low-density parity check (LDPC) codes,\ndevised in [32], we propose a novel low-density signature\n(LDS) structure that follows the parity-check matrix in LDPC\ncodes. Notice that, unlike [10] that projects a signature into\nlower-rank subspaces and may, depending on the optimization,\nswitch off some of the chips, the LDS structure intentionally\nswitches a large fraction of the spreading chips off. Moreover,\nby switching-off those chips, we can facilitate an affordable\nclose to optimum MUD that is based on message-passing\nalgorithm (MPA). Therefore, to complement the proposed LDS\nstructure, it is necessary to submit a new iterative chip-level\nMPA-based detection to approximate the optimum maximum a\nposteriori (MAP) detector. While the proposed iterative detec-\ntion technique has similar features as the sum-product algorithm\nexplained in [33], the application of this kind of iterative pro-\ncessing in uncoded systems is novel (for coded CDMA using\nconventional structure, the similar iterative frame-by-frame\nprocessing to exploit the FEC-powered turbo-MUD property\ncan be found in [34]) and to best of our knowledge has never\nbeen considered.\nOur simulations showed that the proposed LDS structure\ncomplemented with the proposed iterative detector can achieve\na robust near single-user performance with the loading of up\nto 200% with an affordable computational complexity com-\npared to conventional structure employing optimum multiuser\ndetection.\nThis paper is organized as follows. Section II presents a\ncanonical synchronous CDMA system model. Then, a novel\nLDS structure will be explained in more detail in III, where the\ndesign criterions and an example will be presented. The novel\nchip-level iterative receiver is discussed in Section IV. Later,\nthe simulation results are presented and analyzed in Section V.\nIt includes several scenarios, as well as the performance against\nnear-far effect problem. Furthermore, the convergence rate of\nthe iterative receiver is given. Finally, we conclude this paper\nin Section VI.\nThroughout this paper, we use the following notations. A\nvector and a matrix will be represented by lower-caps and cap-\nital, respectively, both in bold case. All vector is defined as a\ncolumn vector. Constants and variables are denoted in capital\nand lower-caps, correspondingly. Superscripts and repre-\nsent transpose and Hermitian version of the vector and\/or ma-\ntrix, respectively. The symbol and constitute “is distributed\naccording to” and “is proportional to,” respectively.\nII. SYNCHRONOUS CDMA SYSTEM MODEL\nConsider a symbol-synchronous uncoded CDMA system\nwith users and processing gain of . Let and be,\nrespectively, the transmitted symbol with period of and the\nconstellation alphabet, from which will take its value, for\nuser . Thus, the modulated symbol is formed by mapping a\nsequence of independent information bits to and\ncan be represented by the function , where\nis the number of information bits per symbol. Given ,\nis then normalized to have a unit average energy such that\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 13,2010 at 14:41:21 UTC from IEEE Xplore.  Restrictions apply. \n1618 IEEE TRANSACTIONS ON SIGNAL PROCESSING, VOL. 56, NO. 4, APRIL 2008\nFig. 1. LDS CDMA system model.\nwhere denotes the cardinality of . Without loss\nof generality and for notation brevity, all users are assumed to\ntake their symbol from the same constellation alphabet, i.e.,\n, .\nFor an uplink transmission over memoryless Gaussian\nchannel, where this paper concentrates on, the signal\nis sufficiently detected on symbol-by-symbol basis. Let\n, and\nbe the received, effective signature for\nuser and the noise vector of size , respectively, which are\nformed by stacking successive chips together. Assuming\nthat all users are perfectly aligned in time, the received signal,\nwhich is the superimposed version of the transmitted signals\nfrom all users, can be written in discrete-form as\n(1)\n(2)\nwhere , and\ndenote effective received signature matrix, trans-\nmitted symbols and noise vectors, respectively. The effective\nreceive signature can also be decomposed as\n(3)\nwhere , ,\nand represent the users’ transmit gain,\nthe corresponding channel gain and the spreading signa-\nture matrices for each user, respectively. From (1) and\n(3), the receive spreading signature for user is denoted\nas , where .\nIn particular, the received signature at chip of user is\n.\nIII. NOVEL LDS STRUCTURE\nThe spreading sequences are assigned uniquely to each user\nand are fully transparent to receiver. In conventional structure,\neach element of the spreading sequences takes, usually, nonzero\nvalues, which is optimized to certain constraints, e.g., good\nauto- and\/or cross-correlation. Then, from (1) the received\nsignal at chip with conventional structure can be denoted as\n(4)\nFrom (4), it is easy to see in conventional structure that, at re-\nceived chip , each user will see the interference coming\nfrom other users.\nInstead of optimizing the -chips signatures, we propose\na novel LDS structure that intentionally arranges each user to\nspread its data over a small number of chips and then zero-\npadding is done such that the processing gain is still . The\nspreading sequences are then interleaved uniquely for each user\nsuch that the resultant signatures matrix become very sparse.\nThis proposed LDS system model is depicted in Fig. 1.\nThe interleaving process is so designed that at each received\nchip there exists a contribution of, instead of all users, only a\nsmall number of users. Consequently, the interference pattern\nbeing seen by each user is different. Let be the\nreceived signal at the th chip due to user . It can be seen\nthat, for the LDS structure, at the chip-level, user 1 sees an in-\nterference coming from different users at different chips. Fur-\nthermore, the interference from several chips, over which user\n1 does not send its information, can be simply neglected in the\ndetection process. The LDS philosophy is that if a fraction of\nsignal of some user is superimposed by a fraction of signals\ncoming from a relatively small number of interferers, then the\nsearch-space should be smaller and, hence, more affordable de-\ntection technique can be used to recover the corrupted fraction\nof signal. Moreover, apart from more convenient implementa-\ntion of the detector, LDS structure also is benefited from having\nan intrinsic interference diversity by avoiding strong interferers\nto corrupt all chips of a user.\nLet and be the maximum number of chips over which\na single user is allowed to spread its data and the maximum\nnumber of users that is allowed to interfere within a single chip,\nrespectively. The new spreading sequences for each user will,\nthen, have a maximum of nonzero values and zero-\nvalues. In order to make this new structure clearer, we introduce\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 13,2010 at 14:41:21 UTC from IEEE Xplore.  Restrictions apply. \nHOSHYAR et al.: SYNCHRONOUS CDMA SYSTEMS OVER AWGN CHANNEL 1619\nan indicator vector , where its th element is denoted\nby and is given by\nthen\nthen\nThe position of 1’s in the indicator vector denotes the posi-\ntion, after interleaving process, over which user may spread\nits data. These arrangements can be also seen as chip-hopping\nstructure where the position of 1’s in represents the time (rel-\native to the first chip) when user is allowed to transmit a copy\nversion of its data.\nIndicator matrix is given by . The set of po-\nsition of 1’s in the th row of denotes the set of users that\ncontribute their data at the th chip, while its th column rep-\nresents the set of chips over which user spreads its data. Note\nthat the 1’s components of the indicator matrix represents the\nnonzero components of matrix and the nonzero components\nof matrix can take any complex-valued.\nLet and be set of 1’s position in the th row and in the\nth column, respectively, then we can modify (4) as\n(5)\n(6)\nwhere and denote the vector stacking the symbols\ntransmitted by every user participating in chip index and their\ncorresponding fraction of effective receive signature values, re-\nspectively. Note that, in LDS structure, we still assume the sig-\nnature waveforms for all users are supported within one symbol\ninterval and are normalized that its power spectral density is one,\ni.e., , .\nRule 1 (Requirements for LDS Indicator Matrix): LDS indi-\ncator matrix is designed with the following requirements.\n1) The maximum number of 1’s in each column must be\nsufficiently smaller than .\n2) The maximum number of 1’s in each row must be suf-\nficiently smaller than .\n3) Full connectivity on the associated Bipartite graph of the\nindicator matrix.\nFrom the aforementioned requirements, we can easily see that\nit is very similar to the requirements of LDPC matrix. Unlike\nLDPC matrix, the proposed LDS structure do not strictly pre-\nvent the associated Bipartite graph of the indicator matrix from\nhaving short cycles, therefore, any LDPC matrix can be used as\nour LDS matrix. The LDS matrices being used in this paper are\neither constructed by manually or from the LDPC matrices [35].\nHowever, another constraint is imposed as stated in the third re-\nquirement, i.e., full-connectivity. It means that each and every\nnode in the associated graph should be able to reach other nodes.\nThis constraint will pave way to full-cooperative processing to\nbe carried out iteratively.\nThe LDS indicator matrix is created to meet with the\nrequired , , and . As it is difficult to find the relationship\nbetween all that three variables mentioned earlier for irregular\nstructure, we can find their relationship for (quasi)-regular1\nstructure, i.e., .\nFurthermore, if the LDS indicator matrix has the same\nnumber of 1’s in each column, i.e., and also the same\nnumber of 1’s in each row, i.e., , but is not necessarily\nequal to , then the structure is called regular LDS, otherwise\nirregular LDS. To explain the LDS structure in more detail,\nin the following, we present an example of LDS structure and\nsome parameters we have introduced in this paper.\nExample 1: Regular LDS structure is designed to serve up to\n16 users with processing gain of 12 chips. The corresponding\nindicator vector is given by with and .\n(See the matrix at the bottom of the page.)\nFrom , we create a set of users that are interfering\nto each other in third chip, i.e., and a set\nof position over which user 11 will spread its data, i.e.,\n. Furthermore, while observing ninth chip, the corre-\nsponding effective received signature vector is given by\n.\nIV. CHIP-LEVEL ITERATIVE SOFT-IN-SOFT-OUT (SISO)\nMULTIUSER DECODING\nThe optimum multiuser detection problem can be solved by\nfinding the maximum joint a posteriori probability mass func-\ntion (pmf) of all users’ transmitted symbols, i.e., by using MAP\n1when d are the same for all users, d may vary in the minority of the chips\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 13,2010 at 14:41:21 UTC from IEEE Xplore.  Restrictions apply. \n1620 IEEE TRANSACTIONS ON SIGNAL PROCESSING, VOL. 56, NO. 4, APRIL 2008\ndetection with excessive search. It will minimize the probability\nthat not all users are detected correctly or, in other words, it will\nminimize the average BER for all users. However, employing\nthe optimum MAP to the proposed LDS CDMA systems gives\nno complexity reduction over the conventional CDMA systems,\nwhich is one of the intentions of the proposed LDS structure.\nTherefore, in this section we propose and derive a novel sub-\noptimum iterative chip-level SISO multiuser detection, which\nis based on MPA principle, to exploit the LDS structure effi-\nciently. This technique will iteratively approximate the global\noptimum MAP detection by factorizing it into a product of sim-\npler local observations and, then, combining it at the later stage.\nThe factor-graph representation of the factorized optimum MAP\ndetection will be constructed to give more insight detail into the\nproposed iterative multiuser detection technique.\nA. Optimum MAP Detection on LDS Structure\nGiven as the observation and the assumption that is avail-\nable at the receiver, the joint optimum MAP detection will es-\ntimate that maximizes the joint a posteriori pmf of the trans-\nmitted symbols , i.e., , and can be written as\n(7)\nThe transmitted symbol can also be estimated by maxi-\nmizing its a posteriori pmf, which can be found by calculating\nthe marginal of the joint a posteriori pmf function defined in (7)\nwith respect to and can be written as\n(8)\nand by using Bayes’ rule, we have the following:\n(9)\nwhere and\nare the joint a priori pmf of all users’ symbols assuming that\nthey are independent to each other and the pdf of the received\nsignal, respectively.\nFurthermore, with the assumption that the noise vector is\nidentically independently distributed (i.i.d.) and is uncorrelated\nwith the transmitted symbols, we are allowed to factorize\n(10)\nwhere is the channel observation function at chip .\nInterestingly, since, with LDS structure, only maximum of\nusers are allowed to interfere to each other, therefore, the calcu-\nlation of this function can be simplified and is given by\n(11)\nFurthermore, by combining (9), (10), and (11) into (8) and re-\nmoving all the unnecessary constant scalars, we can write\n(12)\nFrom (12), we can see that the proposed LDS structure allows\nus to translate the MAP detection problem into the marginalize\nproduct of functions (MPF) [33] problem much more efficiently.\nWhile the same translation can be done for conventional re-\nceiver, there is no obvious advantage of doing that in order to\nmake the detection less-complex as each chips from a user sees\nthe interference from other users.\nB. Factor Graph Representation\nA class of optimum multiuser detection described previously\nfor the proposed LDS structure can be represented by its factor\ngraph [33], which is the bipartite graph representation\nof its factorization defined in (12). In this factor graph, the trans-\nmitted symbols , and the chip observation ,\nare denoted as variable nodes and function\nnodes , respectively.\nLet edge be the edge that connects a function node to\na variable node . At the function node , the local channel\nobservation at chip is made and is given by\n(13)\nWith the LDS structure, it is easy to see in that each\nvariable node is connected only to function nodes ,\nand that each function node is connected only to\nvariable nodes , . Fig. 2 depicts an example of factor-\ngraph representation of the LDS structure used in Example 1\nC. MPA\nAs shown earlier, by employing the proposed LDS structure,\nwe can translate the joint MAP detection problem into an MPF\nproblem as shown in (12), where each function is much simpler\nto resolve. However, solving this MPF problem with brute-force\nstill necessities exponential complexity.\nFortunately, there exists a general algorithm to iteratively ap-\nproximate the solution of this MPF problem that is by applying\nan MPA onto the underlying factor-graph. This fact has mo-\ntivated us to propose a novel suboptimum iterative chip-level\nMUD that is based on the generic MPA, i.e., sum-product al-\ngorithm(SPA) that is used for the decoding of LDPC. While\nthe proposed iterative detection technique has similar feature as\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 13,2010 at 14:41:21 UTC from IEEE Xplore.  Restrictions apply. \nHOSHYAR et al.: SYNCHRONOUS CDMA SYSTEMS OVER AWGN CHANNEL 1621\nFig. 2. Factor graph representation of the joint MAP detection for LDS scheme.\nthe one explained in [33], the application of this kind of itera-\ntive processing in uncoded systems is novel2 and to best of our\nknowledge, MPA algorithm for symbol-by-symbol processing\nhas never been considered. Furthermore, our proposed iterative\ndetector work on symbol-level instead of bit-level as shown in\n[33].\nOperating on the factor-graph , the proposed itera-\ntive MUD works as follow. The messages are updated by iter-\natively exchanging them between function and variable nodes\nalong the respective edges. Those messages are the soft-values\nthat represent the inference or the reliability of the symbol asso-\nciated to each edge. When the factor-graph has no cycles, after\nsome iterations, the messages can be used to do exact infer-\nences to each symbol [33]. However, when it contains cycles,\nthe local computations, hence, become an iterative algorithm,\nwhich hopefully converges to a good approximation of .\nRemark 1 (Representation of a Message): For antipodal\nmodulation, e.g., BPSK, log-likelihood ratio (LLR) value of\nthe symbol can be used to represent the message. However, for\nhigher order modulation, the message being exchanged must\nbe in the form of a vector of size comprising the reliability\nvalues for each of the possible values taken from the symbol\nconstellation alphabet .3 Note that, the message must be\nnormalized such that the sum of all probability values for all\nalphabet symbols is one.\nIt is important to note that in the proposed detection tech-\nnique, the messages that are exchanged along the edges during\niteration contain only the extrinsic information as suggested for\nSPA in [36]. The message received from one edge cannot be\nused to update the message to be transmitted onto that edge.\nRule 2 (Updating a Message): Let edge the edge of ob-\nservation. The message being sent from function node onto\nedge is the product4 of the messages received from edges\n2the similar iterative frame-by-frame processing to exploit the FEC-powered\nturbo-MUD property has been used for coded-CDMA systems. Interested reader\nis referred to [34]\n3The message can even be represented to vector of size j j\u00001 by taking one\nvalue as reference to others.\n4If the message is represented by its logarithmic values of its probability\nvalues, then the summation operation shall be used instead of product opera-\ntion\nwith the local function at and being sum-\nmarized for the variable associated with the edge, i.e., . Sim-\nilarly, the variable node will send a message, which is the\nproduct of the messages received from edges ,\nonto edge .\nFor notation brevity and simplicity, throughout this paper,\nBPSK will be used as the modulation scheme and, therefore,\nand the LLR values are sufficiently used to\nconstitute the messages. The extension for higher order modu-\nlation is, however, straightforward and, therefore, it will not be\npresented.\nLet and be the message sent along edge\nfrom variable node and function node , respectively. The\nmessage gives an updated inference of based on the\nobservation taken at chips . To comply with\nRule 2, we introduce a subscript “ext” to some pdfs to denote\nthat only the extrinsic information should be used to calculate\nthose particular pdfs. Therefore, we can write as fol-\nlows:\n(14)\nBy using the message formulated in (14) and we can represent\n(15)\nwhere is chosen such that\n.\nAt the function node , the inference of is updated and is\ngiven by\n(16)\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 13,2010 at 14:41:21 UTC from IEEE Xplore.  Restrictions apply. \n1622 IEEE TRANSACTIONS ON SIGNAL PROCESSING, VOL. 56, NO. 4, APRIL 2008\nBy using Bayes’ rule as in (9), the second equality is formed and\nby following rule 2, then the a priori pmf of is not included\nin the computation of a posteriori pmf of .\nCombining (13), (14), and (15) into (16), we can write a com-\nplete message being sent from function node onto edge\nshown in (17) and (18) at the bottom of the page. After the mes-\nsage coming to variable nodes , have con-\nverged or the number of maximum iteration has been met, the\nvariable nodes will use all message received from all connected\nedges to calculate the final estimated inference for symbols ,\nand, akin to (15), is given by\n(19)\nwhere is chosen so as .\nThe operation, as suggested in [37], used in (18), is a\nnumerically stable operation and is defined as follows:\n(20)\nThe second term of (20) expresses that the operation can\nbe represented as the operation plus a correction term. In\nthe high SNR region, that correction term becomes very small,\ntherefore max operation is enough to represent (20).\nV. SIMULATION RESULTS\nIn this section, we present the simulation performance of\nLDS-CDMA system with different LDS schemes.\n1) Overloaded with 133% load: Regular LDS 12 16 with\n;\n2) Overloaded with 133% load: Regular LDS 60 80 with\n;\n3) Overloaded with 133% load: Irregular LDS 100 133 with\n;\n4) Overloaded with 150% load: Irregular LDS 48 72 with\n;\n5) Overloaded with 200% load: Regular LDS 12 24 with\n.\nNote that all simulations for LDS structure have been done by\nusing the same spreading signatures associated for each of the\naforementioned regular LDS schemes. Otherwise stated, novel\nnear-optimum chip-level iterative SISO MAP-based algorithm,\nwith maximum of 15 iterations,5 is deployed at the receiver.\nBPSK modulation is used throughout the simulation and users\nare transmitting their data with, otherwise stated, equal average\nreceived SNR. LDS denotes an LDS structure that serves\nup to users by using processing gain of chips. Each user’s\ndata will be phase-rotated randomly uniquely each time it is\ntransmitted. By doing so, we also check the system robustness\nagainst phase rotation effect in case of practical memoryless\nGaussian channel.\nA. Small-System and Large-System Loading\nHere, we compare the spreading signatures for conventional\nstructure derived from several signature optimization techniques\nfor overloading condition and the proposed LDS structure, in\nterms of bit error rate (BER) for the system with\nand . The detection being used are the MMSE-based\nPPIC and the proposed iterative chip-level detector with max-\nimum iteration (or stages) of 15. The MMSE detector will give\nan unconstrained MMSE estimate of the transmitted symbols\nand PPIC will smooth it further with the smoothing-coefficient\nvaries in ascending-order from 0.6 to 0.86 with the same step-\nsize.\nFig. 3(a) shows that the random signature with LDS structure\nperformed better than the one with conventional structure. In\naddition, by using the optimized signatures, the conventional\nstructure performed better than the LDS structure using random\nsignatures. Furthermore, if the LDS structure is employed\nusing the best-found7 signatures, interestingly, it outperformed\nthe ones with optimization. Yet the performance of the LDS\nstructure deploying best-found signatures with MMSE-PPIC\ndetector became saturated after . Furthermore,\nwhen the proposed structure is complemented with the pro-\nposed chip-level detector, i.e., Chip-level(CL)-MAP (with the\n5No stopping criterion is implemented, therefore the system stops only after\nreaching the maximum iterations\n6It is assumed that as the iteration goes further, the estimated value become\nmore reliable.\n7 The best-found signatures for each of the LDS schemes were found by trial-\nand-error.\n(17)\n(18)\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 13,2010 at 14:41:21 UTC from IEEE Xplore.  Restrictions apply. \nHOSHYAR et al.: SYNCHRONOUS CDMA SYSTEMS OVER AWGN CHANNEL 1623\nFig. 3. Performance of LDS structures for DS-CDMA systems. (a) Comparison of different signatures structure with MMSE-PPIC. (b) large-system LDS schemes.\nFig. 4. Performance behavior of users in LDS structure. (a) LDS 12 \u0002 16 (133% loaded). (b) LDS 12 \u0002 24 (200% loaded).\npenalty of slightly more complex signature the MMSE-based\nPPIC), it is shown superior to the conventional structure with\nany optimized signatures and its performance approached the\nsingle-user bound with penalty of 1.17 dB at BER of .\nFurthermore, we also designed the LDS schemes for large-\nsystem, where the number of users is more than 75 with different\nnumber of chips. From Fig. 3(b), the performance of different\nLDS schemes, using best-found signatures, with similar loading\ncondition is shown to be similar. Notice, LDS for large-system\nperform even better, at higher SNR, than the small-system (e.g.,\nLDS 12 16), especially when some degree of irregularity is\nimposed on the underlying factor-graph of the LDS schemes.\nObserving the performance of the LDS structure with the best-\nfound signatures, we conclude that, when we allow some irreg-\nularity and due to unit-energy-constraint of a user, the user’s\nenergy at some particular chip (where at this chip is lower\nthan the average) dominate other interferers and make this user\neasier to be detected.\nTo gain more insight to the LDS structure, we also present\nanother set of results that are showing the performance of indi-\nvidual users. Fig. 4(a) and (b) presents the performance of worst\nuser and best user in LDS 12 16 and LDS 12 24, respec-\ntively. They show that some users will have weaker performance\nthan other users. To be more precise, we can see that at low SNR\nregion the performance degradation is not as high as in the high\nSNR region. This behavior can be explained by observing the\nsignal constellation at each chip and the dominating effect of\nnoise at low SNR region.\nB. Robustness Against Unequal Receive Power\nHere, unequal average receive power scenario was simulated.\nMoreover, it should be noted that the proposed LDS scheme\ndoes not give equal multiuser efficiency or in other words it does\nnot result in the same performance for all the users as can be seen\nfrom Fig. 4.\nFig. 5 shows the performance of the LDS 12 24 system with\nunequal receive power. The performance of the best user and the\nworst user from the system with perfect-power control (PPC)\nwere compared with the ones without power control, i.e., the\nsystem experiences a near-far effect (NFE) problem. As afore-\nmentioned, we know that each user, due to their signatures, will\nhave different performance depending on the constellation of\nthose chips, over which that a particular user spreads its data.\nTherefore, in this condition, to analyze the system performance,\nthe observation should be made from different user’s point of\nview, i.e., the weak user and the strong user.\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 13,2010 at 14:41:21 UTC from IEEE Xplore.  Restrictions apply. \n1624 IEEE TRANSACTIONS ON SIGNAL PROCESSING, VOL. 56, NO. 4, APRIL 2008\nFig. 5. Performance of LDS scheme under near-far effect condition. (a) From weak user point of view. (b) From stronger user point of view.\nFig. 6. Convergence behavior of different LDS schemes. (a) LDS 12 \u0002 16. (b) LDS 12 \u0002 24.\nTo simulate the unequal receive power scenario, we divide\nusers into four groups of the same size, where the users from\neach group will be received at a power level that is 1 dB higher\nthan previous groups. For instance, in LDS 12 24, there will\nbe four groups of size 6.\nFrom weak users’ point of view, the simulation suggests that\nthe weak users will have their performance improved when there\nis strong user in the system compared and it is depicted in Fig.\n5(a). But from the strong users’ point of view, as Fig. 5(b) shows,\nthey have a degraded performance. This phenomenon is due to\nthe iterative joint processing being employed at our multiuser\ndecoding algorithm. And exactly this phenomenon [27] that ap-\npears in the optimum detector for conventional CDMA systems,\ne.g., MAP detector.\nC. Convergence Rate\nIn this subsection, the convergence rate of several LDS struc-\ntures is investigated. By setting a maximum of 15 iterations, we\ncan see the result in Fig. 6(a). In various LDS scheme being sim-\nulated, the performance will saturate after five iterations. The\nreason behind this is that, after certain threshold (iteration limit),\nthe more iteration we run at the factor graph, the more corre-\nlated the messages become and, therefore, the extrinsic infor-\nmation become not very reliable to update the message. Without\nthe independency of the extrinsic message, the performance will\nnot increase any further or saturate. This problem has been ad-\ndressed for LDPC decoding and the density evolution (DE) tech-\nniques have been used as the tool for its analysis [36] (see the\nreferences therein).\nVI. CONCLUSION\nA novel LDS for synchronous CDMA have been proposed\nand investigated for communicaton over AWGN channel. The\nidea behind this proposal is basically to change the interfer-\nence pattern being seen by each user; the proposed LDS struc-\nture limits the amount of interference occurred on each chip\nover which the user transmit a copy of his symbol. Having de-\nsigned the LDS structure, the iterative chip-level SISO MUD\nalgorithm, which is based on MPA, is proposed to efficiently\napproximate the APP of the symbols simultaneously. In this\npaper, MAP detection is done at chip-level, hence, its computa-\ntional complexity with brute-force search is exponential to ,\nwhich is designed to be much smaller than , instead of to\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 13,2010 at 14:41:21 UTC from IEEE Xplore.  Restrictions apply. \nHOSHYAR et al.: SYNCHRONOUS CDMA SYSTEMS OVER AWGN CHANNEL 1625\nas in conventional structure employing joint optimum MAP de-\ntection. Operating in memoryless Gaussian channel with BPSK\nmodulation, the proposed structure and detection can approach\nvery close to single-user performance without FEC coding in\nthe overloaded condition of 200%.\nNote that, unlike conventional CDMA based employing mul-\ntiuser detection, the LDS structure utilizing the proposed iter-\native chip-level MUD does not give the same multiuser effi-\nciency for all users; some users will have better performance\nthan others.\nThe extension of this new structure to multipath fading\nchannel is still under investigation. It is understandable that\nthe multipath fading channel will destroy the LDS structure;\nit creates multi short-cycles within the underlying graph and,\nhence, the proposed iterative MUD will not always converge\nto its true APP. Node-clustering can be utilized to minimize\nthe number of short-cycles, yet it comes with the price of\nan added computational complexity. Therefore, a design of\nlow-complexity receiver is imminent. Another way of tackling\nthe frequency-selectivity of the channel is by employing LDS\nstructure in multicarrier CDMA (MC-CDMA). The investiga-\ntion and analysis of the proposed LDS structure of MC-CDMA\nwill be presented in our other correspondences.\nREFERENCES\n[1] G. Golub and C. V. Loan, Matrix Computations, 3rd ed. Baltimore,\nMD: The John Hopkins Univ. Press, 1996.\n[2] L. Welch, “Lower bounds on the maximum cross-correlation of sig-\nnals,” IEEE Trans. Inf. Theory, vol. 20, pp. 397–399, 1974.\n[3] M. Rupf and J. Masey, “Optimum sequences multisets for synchronous\ncode-division multiple-access channels,” IEEE Trans. Inf. Theory, vol.\n40, no. 4, pp. 1261–1266, Jul. 1994.\n[4] P. Viswanath and V. Anantharam, “Optimal sequences and sum ca-\npacity of synchronous CDMA systems,” IEEE Trans. Inf. Theory, vol.\n45, no. 6, pp. 1984–1991, Sep. 1999.\n[5] P. Cotae, “Transmitter adaptation algorithm for multicelullar syn-\nchronous DS-CDMA systems with multipath,” IEEE J. Sel. Areas\nCommun., vol. 24, no. 1, pp. 94–103, Jan. 2006.\n[6] J. Tropp, I. Dhillon, and R. Heath, “Finite-step algoriths for con-\nstructing optimal CDMA signature sequences,” IEEE Trans. Inf.\nTheory, vol. 50, no. 11, pp. 2916–2921, Nov. 2004.\n[7] R. Learned, A. Willisky, and D. Boroson, “Low-complexity joint detec-\ntion for oversaturated multiple access communications,” IEEE Trans.\nSignal Process., vol. 45, no. 1, pp. 113–122, Jan. 1997.\n[8] F. Vanhaverbeke, M. Moeneclaey, and H. Sari, “DS\/CDMA with two\nsets of orthogonal sequences and iterative detection,” IEEE Commun.\nLett., vol. 4, no. 9, pp. 289–291, Sep. 2000.\n[9] F. Vanhaverbeke and M. Moeneclaey, “Optimal signature sets for\noversaturated quasi-scalable direct-sequence spread-spectrum sys-\ntems,” IEEE Trans. Inf. Theory, vol. 51, no. 3, pp. 1136–1139, Mar.\n2005.\n[10] G. Rajappan and M. L. Honig, “Signature sequence adaptation for\nDS-CDMA with multipath,” IEEE J. Sel. Areas Commun., vol. 20, no.\n2, pp. 384–395, Feb. 2002.\n[11] V. Khrishnamurthy, X. Wang, and G. Yin, “Spreading code optimiza-\ntion and adaptation in cdma via discrete stochastic approximation,”\nIEEE Trans. Inf. Theory, vol. 50, no. 9, pp. 1927–1949, Sep. 2004.\n[12] W. Santipach and M. Honig, “Signature optimization for CDMA\nwith limited feedback,” IEEE Trans. Inf. Theory, vol. 51, no. 10, pp.\n3475–3492, Oct. 2005.\n[13] H. Nguyen and E. Shwedyk, “A new construction of signature wave-\nforms for synchronous CDMA systems,” IEEE Trans. Broadcast., vol.\n51, no. 4, pp. 520–529, Dec. 2005.\n[14] S. Verdú, “Minimum probability of error asynchronous gaussian mul-\ntiple-access channels,” IEEE Trans. Inf. Theory, vol. 32, pp. 85–94, Jan.\n1986.\n[15] A. Duel-Hallen, M. Simon, and Z. Zvonar, “Multiuser detection for\nCDMA systems,” IEEE Pers. Commun., vol. 2, pp. 46–58, Apr. 1995.\n[16] M. Moshavi, “Multiuser detection for DS-CDMA communications,”\nIEEE Commun. Mag., vol. 34, no. 10, pp. 124–136, Oct. 1996.\n[17] S. Verdú, Multiuser Detection. New York: Cambridge Univ. Press,\n1998.\n[18] R. Lupas and S. Verdú, “Linear multiuser detectors for synchronous\ncode-division multiple-access channels,” IEEE Trans. Inf. Theory, vol.\n35, pp. 123–136, Jan. 1989.\n[19] M. Tsatsanis, “Inverse filtering criteria for CDMA systems,” IEEE\nTrans. Signal Process., vol. 45, pp. 102–112, Jan. 1997.\n[20] U. Madhow and M. Honig, “Mmse interference suppression for direct-\nsequence spread-spectrum CDMA,” IEEE Trans. Commun., vol. 32,\npp. 3178–3188, Dec. 1994.\n[21] H. Poor and S. Verdu, “Probability of error in MMSE multiuser detec-\ntion,” IEEE Trans. Inf. Theory, vol. 43, pp. 858–871, May 1997.\n[22] M. Varanasi, “Group detection for synchronous gaussian code-divi-\nsion multiple-access channels,” IEEE Trans. Inf. Theory, vol. 41, pp.\n1083–1096, Jul. 1995.\n[23] S. Buzzi, M. Lops, and G. Ricci, “A new group detection strategy for\nDS-CDMA systems,” in Proc. Int. Symp. Inf. Theory, 2000, p. 357.\n[24] A. Kapur and M. Varanasi, “Multiuser detection for overloaded CDMA\nsystems,” IEEE Trans. Inf. Theory, vol. 49, no. 7, pp. 1728–1742, Jul.\n2003.\n[25] A. Duel-Hallen, “Decorrelating decision feedback multiuser detector\nfor synchronous code-division multiple-access channels,” IEEE Trans.\nCommun., vol. 41, pp. 285–290, Feb. 1993.\n[26] M. Varanasi, “Decision feedback multiuser detection: A systematic ap-\nproach,” IEEE Trans. Inf. Theory, vol. 45, no. 1, pp. 219–240, Jan.\n1999.\n[27] M. Varanasi and B. Aazhang, “Near-optimum detection for syn-\nchronous code-division multiple-access system,” IEEE Trans.\nCommun., vol. 39, pp. 725–736, May 1991.\n[28] A. Viterbi, “Very low rate convolutional codes for maximum theoret-\nical performance of spread-spectrum multiple-access channels,” IEEE\nJ. Sel. Areas Commun., vol. 8, pp. 641–649, May 1990.\n[29] D. Divsalar, M. Simon, and D. Raphaeli, “Improved parallel interfer-\nence cancellation for CDMA,” IEEE Trans. Commun., vol. 46, no. 2,\npp. 258–268, Feb. 1998.\n[30] J. Luo, “Near-optimal multiuser detection is synchronous cdma using\nprobabilistic data association,” IEEE Commun. Lett., vol. 5, no. 9, pp.\n361–363, Sep. 2001.\n[31] L. Ping, “Interleave-division multiple access and chip-by-chip iterative\nmultiuser detection,” IEEE Commun. Mag., vol. 43, no. 6, pp. S19–S23,\nJun. 2005.\n[32] R. Gallager, “Low-density parity check codes,” IRE Trans. Inf. Theory,\nvol. 8, pp. 21–28, Jan. 1962.\n[33] F. Kschischang, B. Frey, and H. Loeliger, “Factor graphs and the\nsum-product algorithm,” IEEE Trans. Inf. Theory, vol. 47, no. 2, pp.\n498–519, Feb. 2001.\n[34] J. Boutros and G. Caire, “Iterative multiuser joint decoding: Unified\nframework and asymptotic analysis,” IEEE Trans. Inf. Theory, vol. 48,\nno. 7, pp. 1772–1793, Jul. 2002.\n[35] D. Mackay, Encyclopedia of Sparse Graph Codes [Online]. Available:\nhttp:\/\/www.inference.phy.cam.ac.uk\/mackay\/codes\/data.html\n[36] T. Richardson and R. Urbanke, “The capacity of low-density\nparity-check codes under message-passing decoding,” IEEE Trans.\nInf. Theory, vol. 47, no. 2, pp. 599–618, Feb. 2001.\n[37] B. Hochwald and S. Brink, “Achieving near-capacity on multiple-an-\ntenna channel,” IEEE Trans. Commun., vol. 51, no. 3, pp. 389–399,\nMar. 2003.\nReza Hoshyar (M’03) received the B.S. degree\nin communications engineering and the M.S. and\nPh.D. degrees, both in mobile communications, from\nTehran University, Tehran, Iran, in 1991, 1996, and\n2001, respectively. He received the top and second\nrank awards for his B.S. and M.S. degrees from\nTehran University.\nFrom 2002 to June 2006, he has been a Research\nFellow in the Mobile Communications Research\nGroup, Center for Communication Systems Re-\nsearch (CCSR), University of Surrey, Surrey, U.K.\nDuring this period, he has been actively involved in IST European projects\nMUMOR, STRIKE, and WINNER. Currently, he is a Senior Research Fellow at\nCCSR and participating as the technical work package leader in IST European\nproject FIREWORKS, focusing on advanced digital signal processing, coding\nand modulation, and scheduling techniques for relaying, and cooperative\ncommunications in OFDM\/OFDMA systems.\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 13,2010 at 14:41:21 UTC from IEEE Xplore.  Restrictions apply. \n1626 IEEE TRANSACTIONS ON SIGNAL PROCESSING, VOL. 56, NO. 4, APRIL 2008\nFerry P. Wathan (S’01) received the B.S. (with\ndistinction) and M.S. degrees, both in electrical\nengineering, from Bandung Institute of Technology,\nIndonesia, in 1999 and Dresden University of\nTechnology, Germany, in 2002, respectively. He\nis currently pursuing the Ph.D. degree in mobile\ncommunications at the University of Surrey, Surrey,\nU.K.\nHis research interests include information theory,\nadvanced multiuser detection and decoding, and sto-\nchastic processes.\nRahim Tafazolli is a Professor of mobile\/personal\ncommunication and Head of Mobile Communica-\ntions Research Group, University of Surrey, Surrey,\nU.K. He has been active in research for 20 years and\nhas authored and coauthored more than 300 papers\nin referred international journals and conferences.\nHe has been a consultant to many mobile companies.\nProf. Tafazolli has lectured and chaired a number\nof IEE Summer schools and IEEE workshops and\nconferences. He is the Founder and Chairman of IEE\nInternational Conference on 3rd Generation Mobile\nCommunications. He is the chairman of e. mobility technology platform expert\ngroup tasked with defining the strategic research agenda for EU FP7 programme\nof research on mobile\/wireless communications.\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 13,2010 at 14:41:21 UTC from IEEE Xplore.  Restrictions apply. \n"}