{"doi":"10.1093\/pan","coreId":"214764","oai":"oai:eprints.lse.ac.uk:27972","identifiers":["oai:eprints.lse.ac.uk:27972","10.1093\/pan"],"title":"The level of democracy during interregnum periods: recoding the polity2 score","authors":["Plumper, Thomas","Neumayer, Eric"],"enrichments":{"references":[{"id":17295164,"title":"Analyzing Incomplete Political Science Data. An Alternative Algorithm for Multiple Imputation.","authors":[],"date":"2001","doi":null,"raw":"King, Gary, Honaker, James, Joseph, Anne and Scheve, Kenneth. 2001. Analyzing Incomplete Political Science Data. An Alternative Algorithm for Multiple Imputation. American Political Science Review 95:1, 49-69.","cites":null},{"id":17295161,"title":"Armed Conflict 1946-2001. A New Dataset.","authors":[],"date":"2002","doi":"10.1177\/0022343302039005007","raw":"Gleditsch, Nils Petter, Wallensteen, Peter, Erikson, Mikael, Sollenberg, Margareta and Strand, Håvard, 2002. Armed Conflict 1946-2001. A New Dataset. Journal of Peace Research 39: 5, 615-637.","cites":null},{"id":17295167,"title":"Causes of Civil War in Asia and Sub-Saharan Africa: A Comparison.","authors":[],"date":"2005","doi":"10.1111\/j.0038-4941.2005.00296.x","raw":"Krause, Volker and Suzuki, Susumu. 2005. Causes of Civil War in Asia and Sub-Saharan Africa: A Comparison. Social Science Quarterly 86:1, 160-177.","cites":null},{"id":17295154,"title":"Comparative Democracy. The Economic Development Thesis.","authors":[],"date":"1994","doi":"10.2307\/2082715","raw":"Burkhart, Ross E. and Lewis-Beck, Michael S., 1994. Comparative Democracy. The Economic Development Thesis. American Political Science Review 88:4, 903-910.","cites":null},{"id":17295170,"title":"Conceptualizing and Measuring Democracy.","authors":[],"date":"2002","doi":"10.1177\/0010414002035001001","raw":"Munck, Gerardo L. and Verkuilen, Jay 2002. Conceptualizing and Measuring Democracy. Comparative Political Studies 35:1, 5-34.","cites":null},{"id":17295156,"title":"Correlation versus Interchangeability. The Limited Robustness of Empirical Findings of Democracy using Highly Correlated Data.","authors":[],"date":"2003","doi":"10.1093\/pan\/mpg009","raw":"Casper, Gretchen and Claudiu Tufis, 2003. Correlation versus Interchangeability. The Limited Robustness of Empirical Findings of Democracy using Highly Correlated Data. Political Analysis 11: 2, 196-203.","cites":null},{"id":17295153,"title":"Determinants of Democracy.","authors":[],"date":"1999","doi":"10.1086\/250107","raw":"Barro, Robert J., 1999. Determinants of Democracy. Journal of Political Economy 107:6, S158-S183 Brittain, Victoria, 1998. The Death of Dignity. Angola’s Civil War. Pluto Press, London.","cites":null},{"id":17295160,"title":"Diffusion and the International Context of Democratization.","authors":[],"date":"2006","doi":"10.1017\/s0020818306060309","raw":"Gleditsch, Kristian S. and Ward, Michael, 2006. Diffusion and the International Context of Democratization. International Organization 60: 4, 911-933.","cites":null},{"id":17295159,"title":"Expanded Trade and GDP Data.","authors":[],"date":"2002","doi":"10.1177\/002200202236171","raw":"Gleditsch, Kristian S. 2002. Expanded Trade and GDP Data. Journal of Conflict Resolution 46: 712-24. 35 Gleditsch, Kristian S. and Ward, Michael, 1997. Double Take. A Reexamination of Democracy and Autocracy in Modern Politics. Journal of Conflict Resolution 41:3, 361-383.","cites":null},{"id":17295169,"title":"for Systemic Peace. http:\/\/www.systemicpeace.org\/inscr\/p4manualv2006.pdf McLaughlin,","authors":[],"date":"1998","doi":null,"raw":"George Mason University and Center for Systemic Peace. http:\/\/www.systemicpeace.org\/inscr\/p4manualv2006.pdf McLaughlin, Sara, Gates, Scott, Hegre, Håvard, Gissinger, Ranveig and Gleditsch, Nils Petter. 1998. Timing the Changes in Political Structures – A New Polity Database. Journal of Conflict Resolution 42:2, 231-242.","cites":null},{"id":17295166,"title":"How no to lie with Statistics. Avoiding Common Mistakes in Quantitative Political Science.","authors":[],"date":"1986","doi":"10.2307\/2111095","raw":"King, Gary, 1986. How no to lie with Statistics. Avoiding Common Mistakes in Quantitative Political Science. American Journal of Political Science 30, 666-687.","cites":null},{"id":17295157,"title":"Indra and Eric Neumayer,","authors":[],"date":"2007","doi":"10.1111\/j.1467-9701.2007.01060.x","raw":"De Soysa, Indra and Eric Neumayer, 2007. Natural Resources and Civil War: Another Look with New Data. Conflict Management and Peace Science 24:3, 201-218.","cites":null},{"id":17295173,"title":"Inference and Missing Data.","authors":[],"date":"1976","doi":"10.1093\/biomet\/63.3.581","raw":"Rubin, Donald B. 1976. Inference and Missing Data. Biometrika 63, 581-592.","cites":null},{"id":17295176,"title":"Measures and Mismeasures of Democracy. Working Paper.","authors":[],"date":"2007","doi":null,"raw":"Strand, Håvard. 2007. Measures and Mismeasures of Democracy. Working Paper. University of Oslo: Department of Political Science. 37 Vanhanen, Tatu, 2000. A New Dataset for Measuring Democracy, 1810–1998. Journal of Peace Research 37:2, 251–265.","cites":null},{"id":17295171,"title":"Modernization: Theories and Facts.","authors":[],"date":"1997","doi":"10.1353\/wp.1997.0004","raw":"Przeworski, Adam and Limongi, Fernando, 1997. Modernization: Theories and Facts. World Politics 49:2, 155-183.","cites":null},{"id":17295174,"title":"Multiple Imputation after 18+ Years.","authors":[],"date":"1996","doi":"10.1080\/01621459.1996.10476908","raw":"Rubin, Donald B. 1996. Multiple Imputation after 18+ Years. Journal of the American statistical Association 91, 473-489.","cites":null},{"id":17295151,"title":"Multiple Imputation for Missing Data. A Cautionary Tale.","authors":[],"date":"2000","doi":"10.1177\/0049124100028003003","raw":"Allison, Paul. D. 2000. Multiple Imputation for Missing Data. A Cautionary Tale. Sociological Methods and Research 28, 301-309.","cites":null},{"id":17295158,"title":"Patterns of Authority: A Structural Basis for Political Inquiry.","authors":[],"date":"1975","doi":"10.2307\/2066447","raw":"Eckstein, Harry, and Ted Robert Gurr, 1975. Patterns of Authority: A Structural Basis for Political Inquiry. New York: Wiley-Interscience.","cites":null},{"id":17295155,"title":"Reliability and Validity Assessment.","authors":[],"date":"1979","doi":"10.4135\/9781412985642","raw":"Carmines, Edward G. and Richard A. Zeller, 1979. Reliability and Validity Assessment. London: Sage.","cites":null},{"id":17295152,"title":"Roots of Violence. A History of war in Chad.","authors":[],"date":"1998","doi":"10.4324\/9780203988749","raw":"Azevedo, Mario Joaquim. 1998. Roots of Violence. A History of war in Chad. Routledge, Oxford.","cites":null},{"id":17295178,"title":"Sierra Leone. The Political Economy of Civil War,","authors":[],"date":"1999","doi":"10.1080\/01436599913965","raw":"Zack-Williams, Alfred B. 1999. Sierra Leone. The Political Economy of Civil War, 1991-1998. Third World Quarterly 20: 1, 143-162. 38","cites":null},{"id":17295168,"title":"Some Social Requisites of Democracy. Economic Development and Political Legitimacy.","authors":[],"date":"1959","doi":"10.2307\/1951731","raw":"Lipset, Seymour Martin, 1959. Some Social Requisites of Democracy. Economic Development and Political Legitimacy. American Political Science Review 53:1, 69-105. 36 Marsden, Peter. 1998. The Taliban: War, Religion and the New Order in Afghanistan. Zed Books, London.","cites":null},{"id":17295172,"title":"State Functioning and State Failure in the South Pacific.","authors":[],"date":"2004","doi":"10.1080\/1035771042000304742","raw":"Reilly, Benjamin, 2004. State Functioning and State Failure in the South Pacific. Australian Journal of International Affairs 58:4, 479-493.","cites":null},{"id":17295175,"title":"The Correlates of War Data on War. An Update to","authors":[],"date":"2000","doi":"10.1177\/073889420001800105","raw":"Sarkees, M.R., 2000. The Correlates of War Data on War. An Update to 1997. Conflict Management and Peace Science 18:1, 123-144.","cites":null},{"id":17295177,"title":"The Prague Spring and its Aftermath: Czechoslovak Politics, 1968-1970,","authors":[],"date":"1997","doi":"10.1017\/cbo9780511562990","raw":"Williams, Kieran. 1997. The Prague Spring and its Aftermath: Czechoslovak Politics, 1968-1970, Cambridge University Press, Cambridge.","cites":null},{"id":17295163,"title":"Tracking Democracy's Third Wave with the Polity III Data,","authors":[],"date":"1995","doi":"10.1177\/0022343395032004007","raw":"Jaggers, Keith and Gurr, Ted Robert, 1995. Tracking Democracy's Third Wave with the Polity III Data, Journal of Peace Research 32:4, 469-482.","cites":null},{"id":17295162,"title":"What to Do about Missing Values in Time Series Cross-Section Data.","authors":[],"date":"2010","doi":"10.1111\/j.1540-5907.2010.00447.x","raw":"Honaker, James and Gary King. 2010. What to Do about Missing Values in Time Series Cross-Section Data. American Journal of Political Science, forthcoming.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"The polity2 variable from the Polity IV project is the most popular measure of a country's political regime. This article contends that the coding rules employed to create a polity2 score during years of so-called interregnum and affected transitions produce a measure of democracy that lacks face validity. Using both single and multiple imputation methods, we construct and evaluate several variables that offer alternative measures to polity2 during such periods. We recommend that scholars using polity2 test whether their results are robust to using our alternatives and using multiple imputation techniques instead. Where robustness cannot be established, scholars need to theoretically justify the choice of either polity2 or one of the alternatives","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/214764.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/27972\/1\/The%20level%20of%20democracy%20during%20interregnum%20periods%28lsero%29.pdf","pdfHashValue":"db3d3fd7af3f14a3f5c6287919c1ca298b140c06","publisher":"Oxford University Press on behalf of the Society for Political Methodology","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:27972<\/identifier><datestamp>\n      2017-05-04T09:36:08Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4759<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/27972\/<\/dc:relation><dc:title>\n        The level of democracy during interregnum periods: recoding the polity2 score<\/dc:title><dc:creator>\n        Plumper, Thomas<\/dc:creator><dc:creator>\n        Neumayer, Eric<\/dc:creator><dc:subject>\n        JC Political theory<\/dc:subject><dc:description>\n        The polity2 variable from the Polity IV project is the most popular measure of a country's political regime. This article contends that the coding rules employed to create a polity2 score during years of so-called interregnum and affected transitions produce a measure of democracy that lacks face validity. Using both single and multiple imputation methods, we construct and evaluate several variables that offer alternative measures to polity2 during such periods. We recommend that scholars using polity2 test whether their results are robust to using our alternatives and using multiple imputation techniques instead. Where robustness cannot be established, scholars need to theoretically justify the choice of either polity2 or one of the alternatives.<\/dc:description><dc:publisher>\n        Oxford University Press on behalf of the Society for Political Methodology<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/27972\/1\/The%20level%20of%20democracy%20during%20interregnum%20periods%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Plumper, Thomas and Neumayer, Eric  (2010) The level of democracy during interregnum periods: recoding the polity2 score.  Political Analysis, 18 (2).  pp. 206-226.  ISSN 1047-1987     <\/dc:identifier><dc:relation>\n        http:\/\/pan.oxfordjournals.org\/<\/dc:relation><dc:relation>\n        10.1093\/pan\/mpp039<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/27972\/","http:\/\/pan.oxfordjournals.org\/","10.1093\/pan\/mpp039"],"year":2010,"topics":["JC Political theory"],"subject":["Article","PeerReviewed"],"fullText":"  \nThomas Plumper and Eric Neumayer  \nThe level of democracy during interregnum \nperiods: recoding the polity2 score \n \nArticle (Accepted version) \n(Refereed) \n \n \nOriginal citation: \nPlumper, Thomas and Neumayer, Eric (2010) The level of democracy during interregnum \nperiods: recoding the polity2 score. Political analysis, 18 (2). pp. 206-226. ISSN 1047-1987  \nDOI: 10.1093\/pan\/mpp039 \n \n© 2010 The Author. Published by Oxford University Press on behalf of the Society for Political \nMethodology \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/27972\/ \nAvailable in LSE Research Online: September 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \n1 \nThe Level of Democracy during Interregnum Periods: \nRecoding the polity2 Score \n \nPublished in: \nPolitical Analysis, 18 (2), 2010, pp. 206-226 \n \nThomas Plümpera and Eric Neumayerb  \n \n \n \na\n Department of Government, University of Essex, Wivenhoe Park, Colchester CO4 3SQ, \nUK, and Centre for the Study of Civil War, International Peace Research Institute Oslo \n(PRIO), tpluem@essex.ac.uk \nb\n Department of Geography and Environment, London School of Economics and Political \nScience, London WC2A 2AE, UK, and Centre for the Study of Civil War, International Peace \nResearch Institute Oslo (PRIO), e.neumayer@lse.ac.uk \n \n \n \n \n \n \n \nCorresponding author: Thomas Plümper. Equal authorship. We thank three anonymous \nreferees, the editors as well as Kristian S. Gleditsch, Nils Petter Gleditsch, Håvard Strand and \nMichael D. Ward for helpful comments. The data for the replication analyses as well as our \nalternative polity variables will be made available for download from \nhttp:\/\/personal.lse.ac.uk\/neumayer or http:\/\/www.polsci.org\/pluemper\/. \n2 \nThe Level of Democracy during Interregnum Periods: \nRecoding the polity2 Score \n \n \nAbstract \nThe polity2 variable from the Polity IV project is the most popular measure of a country’s \npolitical regime. This article contends that the coding rules employed to create a polity2 score \nduring years of so-called interregnum and affected transitions produce a measure of \ndemocracy that lacks face validity. Using both single and multiple imputation methods, we \nconstruct and evaluate several variables that offer alternative measures to polity2 during such \nperiods. We recommend that scholars using polity2 test whether their results are robust to \nusing our alternatives and using multiple imputation techniques instead. Where robustness \ncannot be established, scholars need to theoretically justify the choice of either polity2 or one \nof the alternatives. \n \n \n3 \n1.  Introduction \nOf the data sets available to scholars researching questions relating to democracy, the Polity \ndata set (Jaggers and Gurr 1995; Marshall and Jaggers 2002) is by far the most popular one. \nSocial scientists in general, and political scientists in particular, are much more likely to trust \nPolity as their main source of information and use, if at all, one of its competitors as an \nadditional robustness check.1 There are many good reasons for Polity’s apparent dominance. \nIt offers the broadest coverage of all democracy indicators, including 187 countries from \neither 1800 or the year of independence up to 2008, currently the latest year available. It also \nrelies on a fairly comprehensive definition of democracy, which includes electoral rules and \nvarious measures of the openness of political institutions, and provides detailed information \non aspects of institutionalized democracy and autocracy in a country at any point of time. \nNotwithstanding this wealth of information, the polity variable, a composite score of the \nvarious variables included in the Polity data set, is by far the most commonly used \ninformation. Indeed, most researchers have a theoretical interest in the causes and \nconsequences of a country’s level of democracy. No surprise, then, that to many scholars the \ndata set became even more attractive when – with the move from the Polity III (Jaggers and \nGurr 1995) to the Polity IV (Marshall and Jaggers 2002) version – a new variant of the polity \nscore, called polity2, was added. While both variables are in principle computed by \nsubtracting Polity’s institutionalized autocracy score (autoc) from its institutionalized \ndemocracy score (democ) to generate an aggregate democracy variable that runs from -10 to \n10, the polity2 variable has one main advantage over polity: it seemingly provides a \n                                     \n1\n  See Munck and Verkuilen (2002) and Strand (2007) for a review and evaluation of available \ndata sets. For robustness test with different democracy scores see Casper and Tufis (2003).  \n4 \ndemocracy score for periods of so-called ‘interregnum’ and ‘transition’, whereas polity coded \nthese with placeholder values as -77 and -88, respectively, and therefore as essentially \nmissing. In developing the polity2 variable, the principal investigators of Polity IV decided on \nsimple rules for coding the political regime in events of ‘interregnum’ and ‘transition’. The \nexplicitly stated aim of the polity2 coding is “to facilitate the use of the POLITY regime \nmeasure in time-series analyses” (Marshall and Jaggers 2007: 8). \nThis article contends that the polity2 coding rules for the creation of what seems to be a \nmeasure of the level of democracy during periods of ‘interregnum’ and ‘affected transitions’2 \nare problematic and produce democracy scores for some affected country years that lack face \nvalidity. They also have the potential to invalidate causal inferences from quantitative \nanalyses using the polity2 variable. This becomes more likely if researchers use polity2 as an \nexplanatory variable in a quantitative analysis in which the dependent variable is civil war or \nstate collapse. \nOur paper makes two contributions. First, we alert potential users of polity2 to the \nnecessity of paying careful attention to the problematic treatment of countries during periods \nof interregnum and affected transitions. Though we do not claim to have a unique better \nsolution for this imputation problem, we contend that the several alternative imputation \nstrategies we suggest result in alternative variables to polity2 that have higher face validity \nand treat the uncertainty associated with the imputed values more appropriately. \nOur second contribution is normative: This paper is motivated by the normative prior that \nestimation results should not be determined by the specific imputation rule used to impute \n                                     \n2\n  Transition periods are affected if they are either followed or preceded by an interregnum \nperiod because the authors of Polity decided to first recode interregnum periods and only then \nto recode transition periods using the previously imputed values of the interregnums. \n5 \nmissing values unless researchers can provide a compelling argument that the specific \nimputation rule used is optimal. If such an argument cannot be made, researchers should \ncheck the robustness of their results to using different imputation rules. \nWe are hardly the first to argue that imputation by a simple single rule as conducted by \nthe Polity authors can be misleading and – in any case – misrepresents the uncertainty of the \nestimate. This critique of simple imputation rules along with enhanced computational power \nof modern computers lead to the rapid increase in the popularity of multiple imputation \ntechniques (Rubin 1976, 1996; Allison 2000; King et al. 2001). In brief, multiple imputation \nalgorithms analyze the estimation model at hand repeatedly, each time using imputed values \nfor missing observations derived from imputation models with random variation. Final \ncoefficients are then averaged over the various iterations with the standard errors coming from \nthe variation of the estimated coefficients across the imputation variations – what Rubin \n(1976: 585) refers to as sampling distribution inference. This approach has clear advantages \nover a simple, poorly justified imputation rule. Yet, the flipside of this approach results from \nthe fact that ‘models’ used for imputation purposes are often poorly specified. \nThe approach that we employ here accepts the general underlying premise of the multiple \nimputation approach, namely uncertainty about how to impute missing values. Having this \nimportant aspect in common, we part with the traditional multiple imputation approach in two \nimportant aspects. First, rather than regarding multiple imputation as the always best approach \nfor dealing with missings, we see it as one additional strategy, complementary to rule- and \ntheory-based single imputation strategies. Thus, we prefer to interpret the different model \nestimates employing various alternative imputation strategies as robustness checks. If various \nsimilarly plausible imputation strategies exist, the parameter estimates of the final model \nshould be robust (not significantly different). If this is not the case, then the choice of the \n6 \nimputation strategy drives the results. Second, we highlight the importance of using theory to \nspecify the imputation stage of the multiple imputation strategy, simply because the multiple \nimputation procedure can only be as good as the model from which values are generated. As \nGary King (1986: 669) reminded social scientists many years ago: “Some a priori knowledge, \nor at least some logic, always exists to make selection better than an a-theoretical computer \nalgorithm.” We thus use information on the best-performing of our single imputation alterna-\ntive variables to construct a more theory-based multiple imputation model. We apply our \napproach to two re-analyses of Fearon and Laitin’s (2003) and Krause and Suzuki’s (2005) \nstudies of civil war onset to demonstrate the influence of Polity’s imputation rule. Re-\nanalyzing these two studies we find that the hypothesis that semi-democracies or anocracies \nare more likely to experience civil war onset is less robust than previously thought. \n2. Polity IV’s Coding Rules for Regime Interruption, Transition, and Interregnum \nyears: polity2 \nPolity is based on expert judgment on aspects of institutionalized democracy and autocracy \nwithin a country (Jaggers and Gurr, 1995), based on theories of institutions and authority \ndeveloped by Gurr (1974) and Eckstein and Gurr (1975). Critical evaluations of Polity can be \nfound in, for example, Gleditsch and Ward (1997) and Munck and Verkuilen (2002). In this \narticle, we are exclusively interested in the coding of the polity2 variable, which is identical to \nthe polity variable with the exception of periods of interruption, interregnum and transition. \nInterruptions are periods of foreign occupation as well as periods in which two or more \ncountries became “involved in short-lived attempts at the creation of ethnic, religious, or \nregional federations” (Marshall and Jaggers 2007: 17). 183 out of 15,036 observations fall \ninto this category (1.2 per cent). Interregnums signify the complete collapse of the central \n7 \npolitical authority, typically during periods of civil war (179 observations or 1.2 per cent). \nTransitions are periods between two political regimes that substantially differ from each \nother. They are periods in which “the implementation of generally accepted and substantially \naltered principles of governance is incomplete and fluid, resulting in mixed patterns that are \ndifficult to define as either those of the old regime or those of the new regime” (Marshall and \nJaggers 2007: 18). They account for 316 observations in the data set or roughly 2.1 per cent. \nWhile the polity variable flags these periods with values of -66, -77 and -88, respectively, \nand thus as essentially missing, the polity2 variable converts these placeholder values based \non simple coding rules. We cannot describe the modification leading to polity2 any better than \nthe codebook, so we quote from there (Marshall and Jaggers 2007: 16):  \n \nIt modifies the combined annual POLITY score by applying a simple \ntreatment, or “fix,” to convert instances of “standardized authority scores” (i.e., \n-66, -77, and -88) to conventional polity scores (i.e., within the range, -10 to \n+10). The values have been converted according to the following rule set: \n-66 Cases of foreign ‘interruption’ are treated as ‘system missing’. \n-77 Cases of ‘interregnum’ or anarchy, are converted to a ‘neutral’ \nPolity score of ‘0’. \n-88 Cases of ‘transition’ are prorated across the span of the transition. \n(…) \nOngoing (-88) transitions in the most recent year (…) are converted to system \nmissing values. Transitions (-88) following a year of independence, \ninterruption (-66), or interregnum (-77) are prorated from the value 0. \n \n8 \nPolity2 thus provides modified democracy scores during periods of interregnum and transition \nin addition to the conventional democracy scores provided by polity for normal times. \n3.  Consequences of the polity2 Imputation Rules \nGiven that there is no disaggregated information in the Polity IV data set on the political \nregime during periods of interruption, interregnum and transition, the coding rules appear \nreasonable at first sight: years in which foreign powers exert political control over a country \nare coded as missing, interregnum years are coded as what the authors of Polity IV deem a \n‘neutral’ score and transition years are linearly interpolated. Yet, on closer inspection, the \npolity2 variable turns out to be problematic. \nAny good measure has to fulfill two requirements: it has to be reliable and valid \n(Carmines and Zeller 1979). Reliable here means that in repeated measurements the measured \nvalues will be the same or sufficiently similar. With the exception of countries under German \noccupation during the Second World War, the Polity IV authors seem to have applied their \nmodification rules consistently. We thus do not doubt that repeated measurements would lead \nto reliable measures. However, we doubt that the coding rules provide a valid measure of \ndemocracy during affected country years, i.e. we question whether polity2 validly measures \nthe level of democracy in these circumstances. This is because on closer inspection the rules \nfor the coding of polity2 for interregnum and affected transition years give values that are \nimplausible and likely to be misleading regarding the political regime in many of the affected \ncountry years.3 In other words, polity2 lacks what is called face validity. To persuade readers \n                                     \n3\n  We say implausible rather than wrong and likely to be misleading rather than misleading \nbecause in the absence of knowledge on the values of the variables underlying the polity score \nin interregnum and affected transition years it is of course impossible to know what the “true” \naggregate democracy score should be. \n9 \nthat this is not just our own idiosyncratic judgment, we will discuss some concrete examples \nbelow. On a general level, however, it is not surprising that a mechanic imputation of a score \nof 0 for all cases of interregnum without using any country-specific information cannot \nproduce a democracy score that commands face validity. \nWe identify two problems. We dub them the interregnum and the interregnum-cum-\ntransition problem. Note that both problems are caused by the modification of polity during \ninterregnum periods. Since the authors of Polity recode interregnum years before they recode \ntransition years, the interregnum recoding rule influences the recoding result of the transition \nrecoding rule if transition years either precede or follow interregnum years. We discuss both \nproblems separately. \nThe Interregnum Problem \nThe interregnum problem emerges from the coding of interregnum periods with a value of \nzero, which is meant to represent a neutral regime score. However, just because 0 lies in the \nmiddle between -10 and 10 does not make this a democracy score that is any more neutral \nthan 0 degrees Celsius or Fahrenheit would represent a neutral temperature. Depending on the \npolitical regime before and after the interregnum period, a value of zero can represent \neverything but a neutral regime. To illustrate our argument, figures 1a and 1b compare the \npolity2 scores of Afghanistan over the period 1989-1998 to those of Cyprus over the period \n1960-1969. \n \n10 \n1989 1990 1991 1992 1993 1994 1995 1996 1997 1998\n-10\n-8\n-6\n-4\n-2\n0\n2\n4\n6\n8\n10\npo\nliy\ny2\nyear\n \n1960 1961 1962 1963 1964 1965 1966 1967 1968 1969\n-10\n-8\n-6\n-4\n-2\n0\n2\n4\n6\n8\n10\npo\nlit\ny2\nyear\n \nNote: interregnum years are indicated by dark grey bars \nFigures 1a and 1b: polity2 scores of Afghanistan (left) and Cyprus (right) \n \nThe two figures reveal that the coding rule for interregnum years can generate two rather \ndifferent effects. First, for some countries with an undemocratic regime before and after \ninterregnum (here exemplified by Afghanistan), the interregnum years are the most \ndemocratic years these countries have experienced over a certain time period. In other words: \nfor Afghanistan and similar cases, an interregnum marks an improvement in the level of \ndemocracy. In the case of Afghanistan, if we trusted polity2, then the country would have \ngone through a much more democratic period during the four years of civil war than under the \nCommunist rule of Najibullah before or the Taliban-regime after the interregnum. If we \ncompare the polity2 scores to the scholarly literature on Afghanistan’s political regime, then \nfor most if not all observers, polity2 does not accurately portray the state of Afghan \ndemocracy during the years 1992 to 1995 (Rubin 2000; Marsden 1998). Such likely mis-\nrepresentation is not restricted to one isolated case. Instead, for example, along similar lines, \nCzechoslovakia in 1968, Ethiopia in 1974, Cambodia in 1975, Afghanistan in 1978, \nNicaragua from 1979 to 1980 as well as Somalia from 1991 onwards are coded as much more \ndemocratic during years of social unrest and civil war than either before or after. While the \n11 \ncoding of Czechoslovakia is perhaps broadly in line with historical accounts of the Prague \nSpring (Williams 1997), the other cases are clearly at odds with common perceptions. In fact, \nfor Afghanistan and Somalia, state collapse and anarchy represent by far the most democratic \nperiods in their entire post-independence history. The fundamental problem is that when a \ncountry has an undemocratic regime before and after an interregnum period, then a \ndemocracy score of zero is unlikely to represent a neutral democracy score.  \nThe polity2 rules create the opposite effect in the case of Cyprus. Polity IV interprets the \nyears 1963 to 1967 as interregnum years, even though neither the Correlates of War (Sarkees \n2000) nor the Uppsala\/PRIO (Gleditsch et al. 2002) data sets indicate an armed civil conflict. \nWhatever the reasons behind the decision to treat this period as interregnum, the effect is to \nmake Cyprus far less democratic than either before or after these years. In fact, the allegedly \nneutral value of zero during the period 1963 to 1967 amounts to the country’s most \nundemocratic period in its entire post-independence history.  Similarly, in Sierra Leone during \n1997 to 2001, the Solomon Islands during 2000 to 2002 and Comoros in 1995 civil unrest \nprompted the Polity IV authors to code an interregnum, leading to a decline in the polity2 \nscore relative to previous years. For Sierra Leone with its brutal civil war the polity2 score \nmay not be far off the true state of democracy during this period (Zack-Williams 1999). The \nsame may apply to the Solomon Islands, which slipped into chaos after rebels kidnapped \nPrime Minister Bartholomew Ulufa'alu in June 2000 (Reilly 2004). But for Comoros in 1995 \nthe polity2 score is likely to be misleading since its semi-democratic regime did not become \nany more autocratic when French troops helped to thwart a military coup led by Bob Denard \n(Anonymous 1998). \nSimilar to the other cases discussed previously, the (reverse) problem is that when a \ncountry has a democratic regime before and after an interregnum period, then a score of zero \n12 \nis unlikely to represent an appropriate level of democracy either. Comparing both types of \ncases, we find that according to polity2 an interregnum increases the level of democracy in \nautocracies and reduces the level of democracy in democracies, an outcome we do not find \nplausible. \nMaking things worse, the problematic polity2 coding rules are not applied consistently, as \nthe countries occupied by Germany during the Second World War show. To recall, foreign \noccupation should lead to a polity score of -66 and thus to a system missing value for the \npolity2 variable. However, for no clear reason, the Polity IV project codes Austria, \nCzechoslovakia, Poland, Albania, Greece and Bulgaria as interregnums during their period of \nGerman occupation (thus their polity2 score is 0), whereas Belgium, Denmark, the \nNetherlands and Norway are coded as interruptions (thus their polity2 score is missing).4 \nWithout doubt, periods of interregnum are difficult to code. However, we contend that the \nauthors of Polity IV made inconsistent and implausible decisions when facing this difficulty. \nCoding all interregnum years as zero on the assumption that this represents a politically \nneutral value is naïve for basically three reasons. First, the political processes which cause the \ncoders of Polity IV to treat country-years as interregnum periods vary largely. Both moderate \npolitical turbulence and unrest as in Cyprus, civil wars as in Afghanistan, and the German \n                                     \n4\n  The case of Austria is particularly problematic. In 1938, German troops invaded Austria to \nbring its South-Eastern neighbour ‘Heim ins Reich’ (‘home into the empire’), which was the \nNazi-euphemism for the annexation of the country. After annexation, Austrians had the same \nrights (or lack thereof) and the same obligations and were subjected to the same political \nregime as Germans. However, while Germany has a polity2 score of -9 from 1938 onwards, \nAustria is coded as 0. This is inconsistent because either Austria was occupied by a foreign \npower or experienced a short-lived attempt at building an ethnic federation, in which case its \npolity2 score should be set to missing, or Austrians shared the same fate as Germans, in which \ncase its polity2 score should be set to -9. \n13 \noccupations of Poland, Czechoslovakia, Albania, Yugoslavia, Greece and Bulgaria are \nequally treated as interregnum years and assigned a score of zero, which we contend in most \ncases provides implausible information on the state of political regime in these countries \nduring these years. Second, treating interregnum periods equally without regard to the \npolitical regime context leads to arbitrary dynamics in the level of democracy. Interregnum \nperiods bring about an increase in the level of democracy in most countries, while in others \nthe level of democracy declines during periods of anarchy. Third, if polity2 is used in \nregression analysis, then coding interregnum years as zero is not “neutral” either because the \nestimation of the coefficients of the polity2 as well as in principle of all other explanatory \nvariables correlated with polity2 are affected. Thus, the coding of 0 for periods of interregnum \nis potentially not “neutral” to causal inferences based on regression analysis either – a point to \nwhich we come back later. \nThe Interregnum-cum-Transition Problem \nThe lack of validity in the polity2 variable caused by the coding of interregnum periods \npotentially worsens if such periods are preceded or followed by periods of transition.5 The \ninterregnum-cum-transition problem emerges because the Polity IV authors decided to first \ncode the polity2 score for the interregnum years and only then to code the transition years. As \na consequence, any problematic coding of interregnum years carries over to the coding of \ntransition years if a transition follows an interregnum or vice versa. In Polity IV, 128 \nobservations are affected by the interregnum-cum-transition problem. \n                                     \n5\n  Note that we see no reason to alter the re-coding rule employed by the Polity project for pure \ntransition periods – that is, transition periods which are neither preceded nor followed by an \ninterregnum period. \n14 \nTo illustrate our arguments, figures 2a and 2b plot the polity2 scores for Chad and Angola \nover the periods 1976 to 1985 and 1989 to 1998, respectively. \n \n1976 1977 1978 1979 1980 1981 1982 1983 1984 1985\n-10\n-8\n-6\n-4\n-2\n0\n2\n4\n6\n8\n10\npo\nlit\ny2\nyear\n \n1989 1990 1991 1992 1993 1994 1995 1996 1997 1998\n-10\n-8\n-6\n-4\n-2\n0\n2\n4\n6\n8\n10\npo\nlit\ny2\nyear\n \nNote: interregnum years indicated by dark grey bars, and transition periods by patterned bars \nFigure 2a and 2b: polity2 Score of Chad (left) and Angola (right) \n \nAs in the case of Afghanistan, we find that the coding rules underlying the polity2 variable \nlead to a sudden increase in the democracy score of both countries during interregnum years \n(see Azevedo 1998; Brittain 1998). The problem resulting from assigning a value of zero to \nChad during 1979 to 1983 and to Angola in 1992 is potentially worsened by interpolating \nfrom this value, which results in an artificial upward movement in the polity2 score for Chad \nin 1978 and for Angola in 1991 and an artificial downward movement in the polity2 score for \nChad in 1984 and Angola in 1993 to 1996. Similar cases in the period after the Second World \nWar include Burundi from 1991 to 1996, Congo from 1962 to 1965, Cuba from 1958 to 1961, \nGuinea-Bissau from 1997 to 2000, Laos from 1960 to 1975, Lesotho from 1997 to 2002, \nLiberia from 1989 to 1997, Pakistan from 1968 to 1973 and Sierra Leone from 1996 to 2002. \n15 \n4.  Existing Strategies Available to Researchers with polity2 \nWith the emergence of polity2, researchers using Polity can choose any of at least four \nexisting strategies for their research designs. First, they can stick to the old polity variable and \nthereby listwise exclude -66, -77, and -88 observations – thus accepting that the democracy \nscore for these types of regimes is impossible to identify. Second, they can use polity2 and \nthereby accept the imputations to polity undertaken by the authors of Polity IV on the basis of \ntheir coding rules. Third, they can employ the polity2 variable plus adding, in multivariate \nregression analysis, a set of three dummy variables: one for values of -77 in countries that \nhave negative polity2 values before and after interregnum, one for values of -77 in countries \nthat have positive polity2 scores before and after interregnum, and one for -88 observations. \nFourth, they can apply a Heckman selection model which treats interruption, interregnum, and \ntransition years as non-selected in the first stage and then accounts for the non-selection \nhazard in the second stage of their estimations. \nEach of these options is problematic. Listwise exclusion generates a non-random \nselection criterion which will often be correlated with many variables included in the \nestimations. As a consequence, in many cases listwise exclusion will lead to biased estimates \n(Honaker and King 2010). Using polity2 is problematic because its scores lack face validity, \nas argued in the previous section, and, more importantly, may impact causal inference as \nargued in section 7. Using polity2 with correction via dummy variables for interregnums and \naffected transition periods should give less biased, but also less efficient estimates if the \ndummy variables are correlated with variables of interest. Also, an identification problem \noccurs because it is impossible to interpret the effect of these dummy variables as either the \neffect of interregnums and affected transition periods per se or as correction for the coding \nrule applied by the authors of Polity IV. The Heckman selection model is not very \n16 \nproblematic from an econometric point of view. But it requires the development of a \ntheoretical model for the first, the selection stage, i.e. a model which can explain interruption, \ninterregnum and transition periods. Such a task appears to be difficult, if not impossible. \nGiven this set of rather unsatisfactory existing options, we will now suggest alternatives. \n5.  Alternative Imputation Strategies \nIn this section we discuss three methods that provide alternative imputation strategies to \nPolity’s coding of polity2. One method uses no information from outside the Polity IV data \nset, but applies different coding rules to impute values for periods of interregnum and affected \ntransitions. The second method employs outside information. Specifically, we generate out-\nof-sample predictions for interregnum years by using another measure of democracy (from \nthe Freedom House data set) and theoretical determinants of democracy. For both methods, \nwe then use the out-of-sample predictions for interregnum years to re-code those transition \nyears that either follow or precede interregnum years. The increasingly popular method of \nmultiple imputation, already mentioned in the introduction, provides a third solution to the \nimputation problem. \n \nRecoding According to Different Rules \nWe suggest three alternative coding rules for interregnum and affected transition years that do \nnot depend on any information from outside the Polity IV data set. All three start from \npolity2, but set all observations during interregnum years and all transition years that \nimmediately follow or precede interregnum periods to missing. \n17 \nRule 1 (minimum level). Set the interregnum years to the lower of the two polity \nscores bordering the interregnum period. Then use linear interpolation to \nadd the affected transition years (we dub this variable polity2min). \nRule 2 (interpolation). Use linear interpolation to fill in both interregnum and \ninterregnum-cum-transition years (polity2inter). \nRule 3 (maximum level). Set the interregnum years to the higher of the two polity \nscores bordering the interregnum period. Then use linear interpolation to \nadd the affected transition years (polity2max). \nIn all three rules, interpolated values are rounded to the nearest integer in case the interpolated \nvalue is not an integer. Of course, the choice of these three recoding rules is somewhat \narbitrary. However, they have three advantages. First, contrary to the mechanic polity2 coding \nrules, they use country-specific information immediately preceding and\/or following the \nperiod of interregnum. Second, they therefore do not treat interregnums in countries with \notherwise low or high levels of democracy equally. Third, they constrain the level of \ndemocracy to lie within the range before and after the interregnum. Even though exceptions \nare of course possible, in most cases it seems plausible that interregnums were neither less nor \nmore democratic than the regime either before or after this period. \n \nOut-of-sample Predictions \nAlternative measures of democracy are likely to be powerful candidates for out-of-sample \npredictions. Of the data sets reviewed and evaluated in Munck and Verkuilen (2002), the \nmajority is unsuitable due to poor country coverage or because they only provide a \ndichotomous regime type measure. Vanhanen’s (2000) data set has very large spatio-temporal \ncoverage, but we doubt whether regime type can be measured solely based on election results \n18 \ndata, which not only ignores important institutional features of democracies, but also \nprecludes a change in the democracy score between elections. \nThe one suitable candidate for our purposes is the Freedom House data set. Covering the \nperiod since 1972, it is nowhere near as comprehensive in the temporal domain, but it covers \nall countries that are also contained in the Polity IV data set.6 The use of Freedom House data \nfor research spanning a period of time is not unproblematic since its scale changes slightly \nover time and it was not originally designed as a time-series. However, the authors of \nFreedom House and of Polity use similar definitions of democracy and both are based on \nexpert judgments. And even though the indicated level of democracy in certain countries can \ndiffer between the two sources – for example, Freedom House considers Qatar and Kuwait as \nmore democratic than Polity IV, whereas the reverse is true for Russia – the correlation of the \ntwo democracy scores is very high. Given that Freedom House is the second most used data \nset for measuring democracy after Polity and since it provides values for all country years \nsince 1972 that are coded as interregnum and transition in Polity, using Freedom House data \nfor out-of-sample prediction of the missing polity scores is an obvious choice. \nIn lieu of or in addition to the Freedom House values, one can use theoretically informed \nvariables commonly regarded as determinants of democracy. Our choice of explanatory \nvariables is informed by the number of missing observations. Specifically, we exclude \nvariables with poor spatio-temporal availability. Analyses of the determinants of democracy \ntypically find the level of economic development (Lipset 1959; Burkhart and Lewis-Beck \n                                     \n6\n  www.freedomhouse.org. In fact, it covers all countries in the world and therefore a good deal \nmore than Polity, which restricts itself to countries with population size above half a million. \nIn principle, one could apply our method to create out-of-sample predicted values to generate \nimputed Polity scores for states with small population sizes, but we do not do so here since our \nonly concern lies with the polity2 recoding rules. \n19 \n1994; Przeworski and Limongi 1997; Barro 1999) and neighborhood effects (Gleditsch and \nWard 2006) to exert the largest effect on the level of democracy. Accordingly, our theoretical \nmodel includes per capita income and its squared term, with data taken from Gleditsch \n(2002), as well as the lagged mean value of democracy in neighboring countries within a \nradius of 500 kilometers. To account for some heterogeneity across countries, we also include \na dummy variable which is coded 1 if a developing country shares the main language with a \ndeveloped country, a dummy variable for former Western colonies, dummy variables for \nregions as per World Bank classification as well as a dummy for countries with a \npredominantly Muslim population. \nTo generate new variables based on out-of-sample predictions, we start with the polity \nvariable and, first, set interruption, interregnum and interregnum-cum-transition periods to \nmissing. Using an ordered logit estimator, we regress this variable on three sets of explanatory \nvariables: once only the determinants of democracy (polity2 (det)), once only Freedom \nHouse’s political rights and civil liberties measures (polity2 (FH)) and, finally, once \ncombining these two sets of variables (polity2 (FH & det)).7 We then reset all interruptions \nback to missing, replace all interregnum years by the rounded predicted values of our \nestimations and fill the interregnum-cum-transition years by linear interpolation (rounding to \nthe nearest integer if necessary).8 \n                                     \n7\n  Adding 10 to the revised polity variable to create a strictly non-negative categorical variable \nand then employing the negative binomial regression model leads to very similar out-of-\nsample predictions for interregnum years (correlated at .97 with the ones from the ordered \nlogit model). We found that the ordered logit model has a small advantage over the negative \nbinomial model in terms of goodness of fit of the predicted values with the in-sample polity \nobservations. \n8\n  To construct predicted values we multiply the predicted probabilities of each polity category \nwith the respective polity value and then round it to the nearest integer. \n20 \nMultiple imputation \nBoth our recoding rules and our out-of-sample predictions generate single imputed values. An \nalternative is provided by the technique of multiple imputation. In a first, multiple imputation \nstage, a specified number M of imputed values are created based on some imputation model. \nThen, in the estimation stage, the estimation is performed on each of the M imputations and \nfinal results are typically obtained pooling the M set of multiple imputation estimates. We \nwill discuss multiple imputation in more detail in section 8, where we use it in our re-analysis \nexercise and where we propose to employ information on the best-performing single \nimputation variables in the imputation stage this strategy. Before we do so, we use a relatively \nsimple out-of-sample prediction technique to evaluate the performance of our theory-based \nsingle imputed value variables based on recoding and out-of-sample predictions.  \n6.  An Evaluation of the Alternative Single Imputation Polity Scores \nThe imputation methods described above generate six new single imputation variables, three \nfor the rule-based method that uses no information outside Polity IV and three for the out-of-\nsample predictions using outside information. One research design option would simply be to \nuse all these alternatives to polity2 in robustness tests. However, the different single \nimputation variables are of varying quality, so it appears to be good praxis to narrow down \nthe set of imputation rules used in a robustness test. For this reason, this section analyzes the \nquality of the different single imputation variables based on out-of-sample techniques. In \nsection 7, where we provide a re-analysis of two studies of civil war onset, we then use the \nbest-performing single imputation variables, use a standard multiple imputation model as well \nas a combination of the two techniques, in which we employ the information on the best-\n21 \nperforming single imputation variables to construct a more theory-based multiple imputation \nmodel. \nTo start, table 1 provides a simple correlation matrix of the seven new variables and \npolity2. Clearly, the correlation between polity2 and our recoded variables are close to one \ndue to the small number of missings, the correlation between polity2 and polity2 (det) is rather \nlow, while the correlations with polity2 (FH) and polity2 (FH & det) are very high. \n \nTable 1. Correlation matrix for polity2 and alternative measures (N = 4519). \n \n polity2 min inter max (det) (FH) \npolity2min 0.995      \npolity2inter 0.997 0.999     \npolity2max 0.998 0.998 0.999    \npolity2 (det) 0.711 0.711 0.711 0.710   \npolity2 (FH) 0.916 0.918 0.919 0.918 0.702  \npolity2 (FH & det) 0.930 0.931 0.932 0.931 0.772 0.983 \n \nSince the true level of democracy is unknown for interregnum years, we cannot establish a \npriori which of the six alternatives is superior. In the following we will assume that \nprocedures which predict values that are closer to the conventional polity2 scores during \nnormal times also produce superior values for years of interregnums. We admit that this is a \nstrong assumption. Using it, however, we can establish a ranking of the three variables based \non out-of-sample predictions, while we cannot apply this criterion to the variables derived \nfrom our re-coding rules since by design they would be perfectly collinear to polity2.  \n \n22 \nTable 2. Goodness-of-Fit Tests between Out-of-Sample Predictions and Conventional Polity \nScores (N varies) \n \n correlation regression  \n(R²)  \nregression \n(RMSE) \n Dependent variable: conventional polity scores \n higher is better higher is better lower is better \npolity2 (det) 0.67 0.45 5.70 \npolity2 (FH) 0.92 0.85 2.92 \npolity2 (FH & det) 0.93 0.87 2.74 \n \nThe emerging picture from table 2 is clear: using another measure for democracy like the \nFreedom House data predicts conventional polity2 scores much better than using a \ntheoretically informed democracy model according to all three criteria (correlation, pseudo R2 \nand root mean square error). Adding the theoretical determinants as additional regressors to \nthe Freedom House variables improves the goodness-of-fit further, but only marginally. \nHence, if our assumption that an imputation rule is better the better it predicts conventional \npolity scores is correct, then the variables based on out-of-sample predictions using the \nFreedom House data together with the theoretical determinants of democracy performs best. \nWe call this variable polity2pred, discarding the other two variables as they are inferior to \npolity2pred. \nWe can now use the polity2pred variable to evaluate the rule-based imputations and \nthe mean of the multiply imputed values. Similar to before, we assume that the rule whose \nimputed values fit more closely with polity2pred during periods of interregnum and affected \ntransitions is superior. Table 3 displays the results from the same set of goodness-of-fit tests \nas we already used in table 1, to compare polity2min, polity2inter, and polity2max with the \nout-of-sample-predictions of polity2pred for interregnum and affected transition periods. \n \n23 \nTable 3. Goodness-of-Fit Tests between Out-of-Sample Predictions and Rule-Based \nImputations for Interregnum and Affected Transition Years (N = 39) \n \n correlation regression  \n(R²)  \nregression \n(RMSE) \n Dependent variable: Out-of-sample predictions from model using \nFreedom House data and determinants of democracy \n higher is better higher is better lower is better \npolity2min 0.83 0.67 2.23 \npolity2inter 0.80 0.64 2.35 \npolity2max 0.77 0.58 2.54 \n \nApparently, the minimum level rule performs better than the interpolation rule, which in turn \nperforms better than the maximum level rule. \n7.  Improving Inferences by Combining Theory-based Single Imputation with \nMultiple Imputation: Two Re-analysis Examples \nWe have argued above that the Polity IV project’s coding rules for interregnum and affected \ntransition years lead to democracy scores that lack face validity and have proposed several \nalternative variables. Given that country years of interregnum and interregnum-cum-transition \nrepresent a very small share of the total observations and replacing polity2 with one of our \nalternative variables may thus only affect a small proportion of a sample used in research, the \nquestion is whether scholars must be concerned about the manifest problems with the polity2 \nvariable. Does the lack of validity in polity2 affect either descriptive or causal inference? \nIf researchers are mainly interested in global population descriptives (e.g., changes in \nthe global mean of democracy), then the affected share of observations is so small that our \nproposed alternative measures would be very unlikely to make a significant difference. If, \nhowever, they are interested in sub-sample population description (e.g., the number or share \nof autocracies, democracies or anocracies, that is countries in between autocracy and \ndemocracy), then descriptive inference can be affected as polity2 would often code affected \n24 \ncountry years as anocracies whereas our alternative variables would often code them as either \nautocracies or democracies. \nMost researchers use the Polity data for causal inference, however. We therefore explore \nthe effect of using our alternative variable on causal inference in greater detail. Researchers \nshould indeed be concerned about the problems that polity2 can create for several reasons. \nFirst, using more accurate information is a value in itself. Social science data are often noisy, \nwhich renders estimations inefficient. More valid measures lower measurement error and thus \nlead to more reliable estimation results. \nSecond, using the polity2 variable can lead to significantly different estimates compared \nto using each of our alternative variables. This is more likely to happen the larger the share of \ninterregnum and interregnum-cum-transition country years in the sample. Examples consist of \na pre-First World War sample of predominantly Latin American countries, a sample of \npredominantly European countries during or around the Second World War, or a post-Second \nWorld War sample of mainly Asian and Sub-Saharan African countries. \nThird, even global samples can be affected if scholars transform the polity2 variable into \nthree dummy variables for autocracies, democracies and semi-democracies (sometimes \nreferred to as anocracies) or test for a non-linear effect in the continuous polity2 variable. \nInterregnums will always be categorized as periods of anocracies in polity2 (as will some \naffected transition years), whereas our alternative variables will sometimes categorize them as \nautocracies, anocracies or even democracies, depending on the case, thus changing the \ndistribution and means of covariates in these three groups of countries. \nFourth, other global samples can also be affected if scholars employ a fixed effects or a \nfirst differences model. In these cases, the between-variation of the variables is ignored so that \nthe within-variation in the polity2 variable becomes the sole information used in the \n25 \nestimation. Accordingly, the large upward and downward changes in polity2 that often happen \nduring interregnum and interregnum-cum-transition years become an issue and are likely to \nexert a large influence on the estimates. \nFifth, any of the causes of wrong inference discussed so far will become exacerbated if \nthe dependent variable is either state failure (collapse of central political authority) itself or a \ndeterminant of state failure. These events make it very likely that a country will be coded by \nPolity IV as going through an interregnum. In other words, the dependent variable determines \nthe coding of polity2, hence using polity2 as an explanatory variable will lead to biased \nestimates due to endogeneity. Thus, studies of civil war and state collapse are more likely to \nfind that country years with a polity2 score of zero have a higher likelihood of civil war and \nstate collapse because civil wars and state collapse to some extent cause a polity2 score of \nzero, rather than the other way around. \nTo illustrate some of the potential problems with inference based on polity2, we re-\nanalyze two empirical analyses of civil war onset using a) our best-performing single \nimputation variables; b) a standard multiple imputation model; and c) a combination of the \ntwo in which information on the best-performing single imputation variables is used to \nconstruct a more theory-based multiple imputation model. One of these studies, Krause and \nSuzuki (2005), was selected because it employs two separate samples for Asian and Sub-\nSaharan African countries over the period 1950 to 1992, which according to our discussion \nabove should make problems with statistical inference using polity2 more likely. The other, \nFearon and Laitin’s (2003) prominent study of civil war onset, was chosen to show that such \nproblems can occur, if to a far lesser extent, even in a global sample over the period 1945 to \n1999. Both Fearon and Laitin (2003) and Krause and Suzuki (2005) find that anocracies are \nmore likely to experience civil war onsets than either autocracies or democracies. \n26 \nFearon and Laitin define anocracies as countries with a polity2 score between -5 and 5 \nwhile democracies are countries with a polity2 score between 6 and 10. Political instability is \na dummy variable set to one if there has been a 3-point or more change in polity2 in the \nprevious three years or a period of interregnum or transition. Model 4.1 of table 4 replicates \nmodel 3 of table 1 from Fearon and Laitin (2003), which is their preferred model. The \nanocracy dummy variable is positive and statistically significant at p = 0.028, whereas the \ndemocracy dummy variable is not. This implies that anocracies have a statistically \nsignificantly higher risk of civil war onset compared to autocracies, the omitted reference \ncategory, whereas democracies do not. Note, however, that the anocracy and democracy \ndummy variables are not statistically significantly different from each other.  \nIn models 4.2 and 4.3 we replace the anocracy and democracy dummies, which were \nbased on polity2, with similarly constructed dummy variables for anocracies and democracies \nderived from polity2min and polity2pred, respectively, the two best-performing single \nimputation variables from section 6. The anocracy dummy, which was significant at the 5 per \ncent level in Fearon and Laitin (2003) is no longer statistically significant if polity2min or \npolity2pred are used. These changes in the estimated coefficients and the standard errors \nresult from the re-classification of several observations from anocracies in polity2 to \nautocracies in polity2min.  \nModel 4.4 uses a multivariate normal regression multiple imputation technique based on \nBayesian iterative Markov chain Monte Carlo (MCMC) procedures to impute the 66 \ninterregnum and affected transition observations, using all the variables in the estimation \n27 \nmodel plus regional dummy variables to create 100 sets of imputed values.9 We call this a \nstandard multiple imputation model. The coefficient of the anocracy dummy variable is again \nno longer statistically significant at the 10 per cent level. \nIn model 4.5, we repeat the MCMC multiple imputation procedure, but this time \nspecifying the imputation stage differently. Honaker and King (2010) argue that standard \nimputation models often work very poorly for time-series cross-section data as such data \nviolate the assumptions of conditional independence and exchangeability of observations. \nThey suggest, among other things, to include lags and leads of the variables that have \nmissings as variables in the imputation model in order to impose smoother trends in the \nvariables to be imputed than what is typically generated by a standard imputation model. One \nof the two best-performing variables from section 6, polity2min, allows us to do exactly that \n(we additionally include polity2max to follow their recommendation to include leads in \naddition to lags). Honaker and King (2010) also propose to incorporate expert knowledge in \nthe form of new types of Bayesian priors. We agree with the idea of including expert \nknowledge, but do so in the form of including variables based on expert knowledge in the \nimputation stage. In section 6, the out-of-sample predictions based on Freedom House data \nproved to be a good predictor of polity and since the Freedom House data can be regarded as \nreflecting expert knowledge, we also include them in the imputation stage (after 1972).10 With \n                                     \n9\n  We convert the continuous imputed values to discrete values of 0 or 1 to be consistent with the \ndummy variable approach of Fearon and Laitin (2003). Using a logit imputation technique \ninstead leads to similar results. \n10\n  In principle, one could include further variables such as the theoretical determinants of \ndemocracy in the imputation stage, but since these variables themselves have missings and, as \nsection 6 showed, did not add much to the out-of-sample predictions based on Freedom House \ndata alone, we do not include them here. \n28 \nthis alternative multiple imputation model, the anocracy dummy variable is now statistically \nsignificant at the 5 per cent level. If one accepts that, being theory-based, this multiple \nimputation model 4.5 is superior to model 4.4, then the analysis would again corroborate the \nhypothesis that anocracies are more prone to experience civil war onset. \nModel 4.6 repeats the MCMC imputation, but this time combines the variables from the \nrespective imputation stages of models 4.4 and 4.5. In other words, the imputation stage now \nincludes all the variables of the estimation model plus the polity2min, polity2max and the \nFreedom House variables. The estimation results are very similar to the ones from model 4.5, \nwhich suggests that the variables from the estimation model add very little information to the \nimputation stage. We take this as evidence suggesting that imputing the interregnum and \naffected transition years exclusively with polity2min, polity2max and Freedom House \nvariables is sufficiently good for making valid inferences. In fact, if one were to run a \nstandard logit estimation model in which one included the average of the 100 imputed polity \nvalues of the imputation stage from model 4.5, then results are very, very similar to the ones \nfrom the multiple imputation model 4.5 (results not shown). We take this as evidence that if \nresearchers do not want to undertake multiple imputation based on our polity2min, polity2max \nand Freedom House variables themselves, then they can safely use the mean of imputed polity \nvalues from an imputation model, in which these variables were used.11 \nTable 5 exactly repeats this exercise for the estimation results from table 1 of Krause and \nSuzuki (2005) for their sample of Asian countries. Whereas Fearon and Laitin use anocracy \n                                     \n11\n  Employing the mean of imputed values instead of using multiple imputation will slightly \nunder-estimate standard errors as one single value is used instead of the multiply imputed \nvalues, but due to the relatively small share of imputed values, there is almost no difference to \nthe standard errors that would result from employing multiple imputation. \n29 \nand democracy dummies, Krause and Suzuki employ the continuous polity2 score (to which \nthey add 10 to make it strictly non-negative) and its squared term. They find a non-linear \neffect in both samples: polity2 is positive and statistically significant, whereas its squared \nterm is negative and statistically significant, which again suggests that the risk of civil war \nonset is highest in countries with an intermediate polity2 score, i.e. in semi-democracies or \nanocracies (model 5.1). Estimating, with one small exception12, the same set of models (in the \nsame order) as in the replication of Fearon and Laitin (2003), we find the evidence for the \nanocracy hypothesis to be non-robust. The coefficients of the regime and regime squared \nvariables become less significant or even insignificant when our single imputed alternative \nvariables are used and become altogether insignificant in any of the multiple imputation \nexercises. We have also replicated Krause and Suzuki’s estimations for their Sub-Saharan \nAfrica sample (re-analysis results not shown). Neither regime nor regime squared is \nsignificant in any of the models that does not use polity2. \nThe results presented in Krause and Suzuki (2005) and, to a far lesser extent, in Fearon \nand Laitin (2003) are thus sensitive to our recoding of the polity2 variable or to using multiple \nimputation for interregnums and affected transition periods.13 In polity2 all interregnums and \nsome of the affected interregnum-cum-transition periods are coded as anocracies. Moreover, \ncivil war onset, the dependent variable, is correlated with the likelihood that a country \nexperiences a period of interregnum and interregnum-cum-transition since civil wars are the \nprime cause of interregnums. Thereby, the polity2 score inflates the probability that a study of \n                                     \n12\n  The maximum likelihood did not converge when using polity2pred. We therefore used the \nout-of-sample predictions based on the theoretical determinants of democracy instead. \n13\n  For additional evidence that the anocracy result in Fearon and Laitin (2003) is fairly robust to \nchanges in research design, see De Soysa and Neumayer (2007). \n30 \ncivil war onset will find that anocracies have a higher likelihood of civil war onset. In sum, \nthe evidence for the anocracy-hypothesis seems to be less robust than previously believed.  \n8.  Conclusion \nPolitical system attributes in general and the level of democracy in particular are difficult to \nmeasure. This holds true even more so in difficult times – years in which the execution of \npolitical power is hampered by civil wars, coups, social unrest, foreign intervention, \nleadership struggles and similar events. It was thus a good idea of the makers of the Polity \nproject to flag these years, which allows researchers to give them special attention. It was not \nan equally good idea, however, to apply a seemingly plausible, but in fact problematic fix for \nproviding a polity2 score for years of interregnum and transition. A polity score of zero is not \na “neutral”, equally suitable score for all instances of interregnum. Neutrality in an arbitrarily \nchosen scale does not exist. For most countries experiencing interregnums, these years were \ncoded as more democratic than either before or after interregnum. Similarly, for some other \ncountries experiencing interregnums, these years were coded as less democratic than either \nbefore or after interregnum. We have argued that the polity2 coding rules produce values that \nlack face validity. \nWe have briefly evaluated existing strategies available to researchers, but found all of \nthem problematic. We therefore used three methods to construct alternative variables to \npolity2. We discussed several general conditions under which using our alternative variables \nwould change causal inference compared to polity2. For Krause and Suzuki (2005), we have \nshown in a re-analysis that applying these alternative variables or using multiple imputation \ntechniques leads to different statistical inferences concerning the effect of anocracy on the risk \nof civil war onset. The results of Fearon and Laitin (2003), however, appear to be more robust \n31 \nif our theory-based single imputation values are in turn included in the multiple imputation \nmodel. \nWhat then should applied researchers do? We recommend that scholars test whether their \nresults derived from using polity2 are robust to using our alternative variables or using \nmultiple imputation techniques instead. If results turn out to be robust, then causal inference \ndoes not seem to suffer much from the problems of polity2. If results differ significantly then \nresearchers need to theoretically justify the use of either polity2 or one of our alternative \nvariables or of multiple imputation. When researchers choose to employ multiple imputation, \nwe also recommend including, additionally or exclusively, our alternative variables plus the \nFreedom House variables in the imputation model.  \nOur analysis has wider implications as well, however. What we propose here is a method \nthat combines strategies from theory-based single imputation with the use of multiple \nimputation algorithms together with a call for robustness checks across estimates from the \nrange of values generated by different imputation methods. We believe that the combination \nof this method plus robustness checks offers an important step forward not only for dealing \nwith interregnum periods in the Polity data set, but for dealing with missings in general.  \n32 \nAppendix A: Examples of Interregnum and Interregnum-cum-Transition Periods  \nTable A1 shows the scores of polity, polity2, polity2pred, polity2min, polity2inter and \npolity2max for Afghanistan over the period 1989 to 1997. Afghanistan is remarkable because \nthe Polity IV coding rules for polity2 provide the country with a much higher level of \ndemocracy than either before or after. In contrast, the four alternative variables suggest a far \nlower level of Afghan democracy during this time period. \n \nTable A1: Imputed Polity scores for Afghanistan 1989-1998 \n \nyear 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 \npolity -8 -8 -8 -77 -77 -77 -77 -7 -7 -7 \npolity2 -8 -8 -8 0 0 0 0 -7 -7 -7 \npolity2pred -8 -8 -8 -6 -8 -8 -8 -7 -7 -7 \npolity2min -8 -8 -8 -8 -8 -8 -8 -7 -7 -7 \npolity2inter -8 -8 -8 -8 -8 -7 -7 -7 -7 -7 \npolity2max -8 -8 -8 -7 -7 -7 -7 -7 -7 -7 \n \nConversely, for Cyprus our alternative variables suggest a far higher level of democracy \nduring the interregnum period (table A2). \n \nTable A2: Imputed Polity scores for Cyprus 1960-1969 \n \nyear 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 \npolity 8 8 8 -77 -77 -77 -77 -77 7 7 \npolity2 8 8 8 0 0 0 0 0 7 7 \npolity2pred 8 8 8 .. .. .. .. .. 7 7 \npolity2min 8 8 8 7 7 7 7 7 7 7 \npolity2inter 8 8 8 8 8 8 7 7 7 7 \npolity2max 8 8 8 8 8 8 8 8 7 7 \n \nTable A3 presents the values for Chad over the period 1976 to 1985. Imputations based on \nout-of-sample predictions and our rule-based recodings lead to similar results: The openness \n33 \nof Chad’s political system has not changed much during the interregnum and affected \ntransition period.  \n \nTable A3: Imputed Polity scores for Chad 1976-1985 \n \nyear 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 \npolity -7 -7 -88 -77 -77 -77 -77 -77 -88 -7 \npolity2 -7 -7 -3 0 0 0 0 0 -4 -7 \npolity2pred -7 -7 -6 -6 -8 -8 -8 -8 -7 -7 \npolity2min -7 -7 -7 -7 -7 -7 -7 -7 -7 -7 \npolity2inter -7 -7 -7 -7 -7 -7 -7 -7 -7 -7 \npolity2max -7 -7 -7 -7 -7 -7 -7 -7 -7 -7 \n \nTable A4 provides an example how the various alternative variables can lead to somewhat \ndifferent democracy scores, here for Angola’s interregnum-cum-transition period in the \n1990s: \n \nTable A4: Imputed Polity scores for Angola 1989-1998 \n \nyear 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 \npolity -7 -7 -88 -77 -88 -88 -88 -88 -3 -3 \npolity2 -7 -7 -3 0 -1 -1 -2 -2 -3 -3 \npolity2pred -7 -7 -6 -6 -5 -5 -4 -4 -3 -3 \npolity2min -7 -7 -7 -7 -7 -7 -7 -7 -3 -3 \npolity2inter -7 -7 -6 -6 -5 -4 -4 -3 -3 -3 \npolity2max -7 -7 -3 -3 -3 -3 -3 -3 -3 -3 \n \n34 \nReferences \nAllison, Paul. D. 2000. Multiple Imputation for Missing Data. A Cautionary Tale. \nSociological Methods and Research 28, 301-309. \nAnonymous, 1998. Comoros. Africa Research Bulletin 35:11, 13317-13318. \nAzevedo, Mario Joaquim. 1998. Roots of Violence. A History of war in Chad. Routledge, \nOxford. \nBarro, Robert J., 1999. Determinants of Democracy. Journal of Political Economy 107:6, \nS158-S183 \nBrittain, Victoria, 1998. The Death of Dignity. Angola’s Civil War. Pluto Press, London.  \nBurkhart, Ross E. and Lewis-Beck, Michael S., 1994. Comparative Democracy. The \nEconomic Development Thesis. American Political Science Review 88:4, 903-910. \nCarmines, Edward G. and Richard A. Zeller, 1979. Reliability and Validity Assessment. \nLondon: Sage. \nCasper, Gretchen and Claudiu Tufis, 2003. Correlation versus Interchangeability. The Limited \nRobustness of Empirical Findings of Democracy using Highly Correlated Data. \nPolitical Analysis 11: 2, 196-203. \nDe Soysa, Indra and Eric Neumayer, 2007. Natural Resources and Civil War: Another Look \nwith New Data. Conflict Management and Peace Science 24:3, 201-218. \nEckstein, Harry, and Ted Robert Gurr, 1975. Patterns of Authority: A Structural Basis for \nPolitical Inquiry. New York: Wiley-Interscience. \nFearon, James D. and Laitin, David D. 2003. Ethnicity, Insurgency and Civil War. American \nPolitical Science Review 97:1, 75-90. \nGleditsch, Kristian S. 2002. Expanded Trade and GDP Data. Journal of Conflict Resolution \n46: 712-24. \n35 \nGleditsch, Kristian S. and Ward, Michael, 1997. Double Take. A Reexamination of \nDemocracy and Autocracy in Modern Politics. Journal of Conflict Resolution 41:3, \n361-383.   \nGleditsch, Kristian S. and Ward, Michael, 2006. Diffusion and the International Context of \nDemocratization. International Organization 60: 4, 911-933. \nGleditsch, Nils Petter, Wallensteen, Peter, Erikson, Mikael, Sollenberg, Margareta and Strand, \nHåvard, 2002. Armed Conflict 1946-2001. A New Dataset. Journal of Peace \nResearch 39: 5, 615-637.  \nGurr, Ted Robert, 1974. Persistence and Change in Political Systems, 1800-1971. American \nPolitical Science Review 68:4, 1482-1504. \nHonaker, James and Gary King. 2010. What to Do about Missing Values in Time Series \nCross-Section Data. American Journal of Political Science, forthcoming. \nJaggers, Keith and Gurr, Ted Robert, 1995. Tracking Democracy's Third Wave with the \nPolity III Data, Journal of Peace Research 32:4, 469-482. \nKing, Gary, Honaker, James, Joseph, Anne and Scheve, Kenneth. 2001. Analyzing \nIncomplete Political Science Data. An Alternative Algorithm for Multiple \nImputation. American Political Science Review 95:1, 49-69. \nKing, Gary, 1986. How no to lie with Statistics. Avoiding Common Mistakes in Quantitative \nPolitical Science. American Journal of Political Science 30, 666-687. \nKrause, Volker and Suzuki, Susumu. 2005. Causes of Civil War in Asia and Sub-Saharan \nAfrica: A Comparison. Social Science Quarterly 86:1, 160-177. \nLipset, Seymour Martin, 1959. Some Social Requisites of Democracy. Economic \nDevelopment and Political Legitimacy. American Political Science Review 53:1, 69-\n105. \n36 \nMarsden, Peter. 1998. The Taliban: War, Religion and the New Order in Afghanistan. Zed \nBooks, London.  \nMarshall, Monty G. and Keith Jaggers 2007. Polity IV Project: Dataset Users’ Manual. \nGeorge Mason University and Center for Systemic Peace. \nhttp:\/\/www.systemicpeace.org\/inscr\/p4manualv2006.pdf  \nMcLaughlin, Sara, Gates, Scott, Hegre, Håvard, Gissinger, Ranveig and Gleditsch, Nils \nPetter. 1998. Timing the Changes in Political Structures – A New Polity Database. \nJournal of Conflict Resolution 42:2, 231-242. \nMunck, Gerardo L. and Verkuilen, Jay 2002. Conceptualizing and Measuring Democracy. \nComparative Political Studies 35:1, 5-34. \nPrzeworski, Adam and Limongi, Fernando, 1997. Modernization: Theories and Facts. World \nPolitics 49:2, 155-183. \nReilly, Benjamin, 2004. State Functioning and State Failure in the South Pacific. Australian \nJournal of International Affairs 58:4, 479-493. \nRubin, Donald B. 1976. Inference and Missing Data. Biometrika 63, 581-592. \nRubin, Donald B. 1996. Multiple Imputation after 18+ Years. Journal of the American \nstatistical Association 91, 473-489. \nRubin, Barnett R., 2000. The Political Economy of War and Peace in Afghanistan. World \nDevelopment 28:10, 1789-1803. \nSarkees, M.R., 2000. The Correlates of War Data on War. An Update to 1997. Conflict \nManagement and Peace Science 18:1, 123-144. \nStrand, Håvard. 2007. Measures and Mismeasures of Democracy. Working Paper. University \nof Oslo: Department of Political Science. \n37 \nVanhanen, Tatu, 2000. A New Dataset for Measuring Democracy, 1810–1998. Journal of \nPeace Research 37:2, 251–265. \nWilliams, Kieran. 1997. The Prague Spring and its Aftermath: Czechoslovak Politics, 1968-\n1970, Cambridge University Press, Cambridge.  \nZack-Williams, Alfred B. 1999. Sierra Leone. The Political Economy of Civil War, 1991-\n1998. Third World Quarterly 20: 1, 143-162. \n38 \nTable 4. Replication of Fearon and Laitin (2003) and robustness tests. \n \n model 4.1 model 4.2 model 4.3 model 4.4 model 4.5 model 4.6 \n polity2 polity2min polity2pred standard  \nmult. imp. \ntheory-based \nmult. imp.  \nmult. imp. \ncomb. of 4.4 & 4.5 \nPrior war -0.916 -0.870 -0.983 -0.905 -0.906 -0.907 \n (0.312)*** (0.312)*** (0.384)** (0.313)*** (0.312)*** (0.312)*** \nPer capita income -0.318 -0.305 -0.334 -0.319 -0.318 -0.318 \n (0.071)*** (0.071)*** (0.097)*** (0.071)*** (0.071)*** (0.071)*** \nlog(population) 0.272 0.270 0.287 0.268 0.271 0.270 \n (0.074)*** (0.074)*** (0.093)*** (0.074)*** (0.074)*** (0.074)*** \nlog(% mountainous) 0.199 0.195 0.205 0.202 0.199 0.199 \n (0.085)** (0.085)** (0.102)** (0.085)** (0.085)** (0.085)** \nNoncontiguous state 0.426 0.457 0.533 0.450 0.428 0.428 \n (0.272) (0.273)* (0.422) (0.272) (0.272) (0.272) \nOil exporter 0.751 0.728 0.287 0.760 0.750 0.752 \n (0.278)*** (0.279)*** (0.365) (0.279)*** (0.278)*** (0.278)*** \nNew state 1.658 1.712 2.342 1.683 1.669 1.668 \n (0.342)*** (0.342)*** (0.518)*** (0.342)*** (0.342)*** (0.342)*** \nInstability 0.513 0.570 0.536 0.564 0.529 0.529 \n (0.242)** (0.240)** (0.321)* (0.241)** (0.242)** (0.242)** \nEthnic fract. 0.164 0.160 0.554 0.168 0.163 0.163 \n (0.368) (0.369) (0.513) (0.369) (0.369) (0.369) \nReligious fract. 0.326 0.301 -0.467 0.321 0.326 0.326 \n (0.506) (0.506) (0.664) (0.507) (0.506) (0.506) \nAnocracy 0.521 0.373 0.514 0.396 0.488 0.489 \n (0.237)** (0.236) (0.322) (0.245) (0.237)** (0.237)** \nDemocracy 0.127 -0.111 -0.407 0.096 0.111 0.118 \n (0.304) (0.310) (0.417) (0.304) (0.303) (0.304) \nConstant -7.019 -6.922 -6.658 -6.952 -6.996 -6.997 \n (0.751)*** (0.745)*** (0.953)*** (0.747)*** (0.749)*** (0.749) \nObservations 6327 6327 3691 6327 6327 6327 \nChi-sq\/F test  \n(H0: β(An.)=β(Dem.) \n1.73 \n(p<.1881) \n2.37 \n(p<.1240) \n4.73 \n(p<.0296) \n.97 \n(p<.3253) \n1.57 \n(p<.2098) \n1.52 \n(p<.2169) \nNotes: Standard errors in parentheses. * p < .10; ** p < .05; *** p < 0.01. \n39 \nTable 5. Replication of Krause and Suzuki (2005) and robustness tests (Asia sample). \n \n model 5.1 model 5.2 model 5.3 model 5.4 model 5.5 model 5.6 \n polity2 polity2min polity2 (det). standard  \nmult. imp. \ntheory-based \nmult. imp.  \nmult. imp. \ncomb. of 5.4 & 5.5 \nPer capita income -1.744 -1.643 -1.554 -1.529 -1.519 -1.491 \n (0.963)* (0.895)* (0.844)* (0.884)* (0.853)* (0.839)* \nlog(population) 0.152 0.099 0.088 0.119 0.129 0.126 \n (0.136) (0.135) (0.136) (0.148) (0.149) (0.151) \nlog(% mountainous) -0.492 -0.461 -0.418 -0.383 -0.372 -0.359 \n (0.435) (0.405) (0.383) (0.417) (0.411) (0.408) \nNoncontiguous state -1.946 -1.727 -1.612 -1.853 -1.881 -1.866 \n (1.612) (1.633) (1.608) (1.589) (1.572) (1.559) \nOil exporter 0.497 0.453 0.539 0.863 0.891 0.935 \n (1.036) (1.058) (1.107) (1.149) (1.069) (1.075) \nNew state 0.499 0.765 0.874 0.664 0.612 0.627 \n (1.190) (1.127) (1.084) (1.133) (1.144) (1.136) \nInstability 0.334 0.498 0.511 0.494 0.482 0.492 \n (0.510) (0.506) (0.520) (0.541) (0.515) (0.518) \nEthnic fractionalization 4.202 4.349 4.150 3.700 3.572 3.494 \n (2.136)** (2.148)** (2.050)** (2.139)* (2.172)* (2.168)* \nReligious fractionalization 2.932 2.495 2.240 2.464 2.497 2.434 \n (2.785) (2.529) (2.358) (2.673) (2.675) (2.646) \nMilitarization 0.585 0.560 0.545 0.566 0.567 0.563 \n (0.295)** (0.271)** (0.258)** (0.282)** (0.281)** (0.278)** \nTrade Openness -0.339 -0.298 -0.284 -0.326 -0.332 -0.331 \n (0.144)** (0.129)** (0.122)** (0.138)** (0.139)** (0.137)** \nRegime 0.678 0.452 0.373 0.516 0.567 0.552 \n (0.366)* (0.258)* (0.233) (0.377) (0.365) (0.364) \nSquared Regime -0.031 -0.021 -0.018 -0.022 -0.024 -0.024 \n (0.016)** (0.011)* (0.010)* (0.017) (0.016) (0.016) \nConstant 1.686 2.517 2.325 1.000 0.625 0.524 \n (5.178) (5.336) (5.253) (4.912) (4.566) (4.518) \nObservations 609 609 609 609 609 609 \nNotes: Standard errors in parentheses. * p < .10; ** p < .05; *** p < 0.01. \n"}