{"doi":"10.3366\/E0305149807000065","coreId":"65517","oai":"oai:dro.dur.ac.uk.OAI2:5608","identifiers":["oai:dro.dur.ac.uk.OAI2:5608","10.3366\/E0305149807000065"],"title":"The challenge of the meta-contextual : Henry Lawson’s 'Telling Mrs. Baker' (1901) and some animal questions for Australia. \\ud","authors":["Clark,  Timothy."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-06-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65517.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5608\/1\/5608.pdf","pdfHashValue":"6fa9d63183f9885c348049f12b9b8f7c1a08c3a4","publisher":"Edinburgh University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5608<\/identifier><datestamp>\n      2011-11-04T09:19:40Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The challenge of the meta-contextual : Henry Lawson’s 'Telling Mrs. Baker' (1901) and some animal questions for Australia. \\ud\n<\/dc:title><dc:creator>\n        Clark,  Timothy.<\/dc:creator><dc:publisher>\n        Edinburgh University Press<\/dc:publisher><dc:source>\n        Oxford Literary Review. , 2007, Vol.29(1), pp.17-36 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-06-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5608<\/dc:identifier><dc:identifier>\n        issn:0305-1498<\/dc:identifier><dc:identifier>\n        issn: 1757-1642 <\/dc:identifier><dc:identifier>\n        doi:10.3366\/E0305149807000065<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5608\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.3366\/E0305149807000065<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5608\/1\/5608.pdf<\/dc:identifier><dc:rights>\n        Copyright © 2007 Edinburgh University Press.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1757-1642","issn:0305-1498"," 1757-1642","0305-1498"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n01 June 2009\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nClark, Timothy. (2007) ’The challenge of the meta-contextual : Henry Lawsons ’Telling Mrs. Baker’ (1901)\nand some animal questions for Australia.’, Oxford Literary Review., 29 (1). pp. 17-36.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.3366\/E0305149807000065\nPublisher’s copyright statement:\nCopyright 2007 Edinburgh University Press.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n \n \n \nDurham Research Online \n \nDeposited in DRO: \n1 June 2009 \n \nPeer-review status of attached file: \nPeer-reviewed \n \nPublication status of attached file: \nPublished \n \nCitation for published item: \nClark, Timothy. (2007) 'The challenge of the meta-contextual : Henry Lawson’s 'Telling Mrs. \nBaker' (1901) and some animal questions for Australia.', Oxford Literary Review., 29 (1). pp. \n17-36. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.3366\/E0305149807000065 \n \nCopyright statement \nCopyright © 2007 Edinburgh University Press \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nThe Challenge of the Meta-Contextual: Henry\nLawson’s ‘Telling Mrs Baker’ (1901) and some\nAnimal Questions for Australia\nTimothy Clark\nMost literary and cultural criticism today is contextual. Thus a\ncontemporary reading of Charles Dickens’s David Copperfield (1850)\nwill place the novel within the cultural politics of the early Victorian\nperiod, its determinations of class and gender, the history of publishing,\nchanging make-ups of readership etc. Yet culture itself has a context\n– the biosphere, air, water, plant and animal life – and the more\nradical work in environmental criticism tends to be, so to speak, ‘meta-\ncontextual.’ That is, it opens on issues that may involve perspectives\nfor which given practices of mapping out the cultural politics of a text\nseem limited and enclosed, questions which may involve time-spans\nof centuries or millennia, that do not fit given political categories of\nleft and right and which may concern injustice to those not yet born.\nThe ethical challenge of non-human lives adds itself to this list. The\nterm meta-contextual also seems worth coining here to embrace one of\nthe most exciting but also inherently problematic and unstable features\nof environmental criticism: that it must in some way, implicitly or\notherwise, engage itself with an issue so huge as the overall stance\nhumanity should take in relation to the rest of the natural world.\nAn increasing attention to the ethical and socio-political questions\nposed by the human treatment of animals is part of what is\nnow perceived as a general environmental crisis. Derrida observed\nin For What Tomorrow (2004) that ‘A large-scale disorganization-\nreorganisation of the human earth is under way.’1 He might have\nomitted ‘human.’ In fact, awareness of other issues, such a carbon\nemissions, has been intensifying so fast that even a recently dead\nthinker who spent so much time flying across the world to conferences\nbegins to look changed. If even the more conservative forecasts of\nclimate change are accurate, it could be that, just as the name ‘Martin\n18 Oxford Literary Review\nHeidegger’ immediately and unjustly conjures the word ‘Nazi,’ Derrida\nwill sometimes need to be defended as the thinker of ‘incalculable\nresponsibility’ who was yet associated with more pollution than any\nother philosopher in history.2\nNevertheless, the meta-contextual questions posed by the\nenvironmental crisis itself entail, crudely speaking, an active\n‘deconstruction’ of many fundamental philosophical, juridical and\nethical concepts on which the West is based, and hence to a large\ndegree the globalised world. Much of this means, as any reader of Of\nGramamtology3 will know, not the collapse of old ways of thinking\nand practice in the wake of new ones, but a general and perplexing\nsense of the closure and finitude of inherited forms, akin at times to\nparalysis. While it seems to be clearer all the time that ‘It is as if Western\nsociety has deliberately set out to destroy the integrity of the ecosystem’\n(Robert J. Brulle),4 the conceptual, legal, economic, social and political\nbases of such destruction remain almost impossible to escape, budge or\nsometimes even perceive. Tell many people that you are working on an\narticle about animals and they will smile slightly, as if they wanted to\ngive you a pat on the head.\nCritical thought about the human\/animal borderline must be\nimmediately meta-contextual. However, this challenge is frequently\nunmanageable and seems often to be resisted, either consciously\nor unconsciously. For instance, if there were as straightforward an\nanalogy as some claim between human rights and putative animal\nrights then one might expect there to be numerous literary readings\nequivalent to common schools of interpretation elsewhere, viz. we\nwould have readings of classical texts highlighting in them elements\nof prejudice or of the systematic misrepresentation of animal life.\nA demystification of the civilised sphere would take the form of\ndemonstrating its basis in modes of food production requiring mass\nservitude, imprisonment and slaughter. There would be widespread\narguments that ‘the canon’ itself needs to be overhauled in view of\nits systematic endorsement of pastoral, hunting and religious practices\nimplicated in animal suffering. There would be a broad questioning of\nthe general association of animals with ‘mere’ children’s books, leading\nperhaps to new evaluations of books such as Henry Williamson’s Tarka\nthe Otter (1927) or Jack London’s The Call of the Wild (1903). Might\nnot even Norman Maclean’s A River Runs Through It (1976) find itself\nTimothy Clark 19\nre-categorised as an instance of ‘speciesism’ together with subgenres of\nwriting on hunting and fishing?\nHowever, apart from a few essays in scattered places, no literary\nmovement with such modes of reading exists.5 Even the Ecocriticism\nReader of 1996, a landmark for the emerging school of ‘ecocrticism,’\ncontained not one essay devoted to the issue of an animal or animals.\nWhy is engaging with animals so difficult?\nThe work of Cary Wolfe stands out here for putting to detailed\nwork an understanding of the animal\/human distinction that draws\non Derrida’s depth of questioning.6 Wolfe’s sophistication lies mainly\nin the engagement with the ‘speciesist’ assumptions at work in the\ndepth structure of even the most ‘progressive’ critical methodologies.\nHowever, if the issue becomes instead one of simply tracing the work of\nthe human\/animal divide in a primary text, the critical work involved\ncan seem less demanding. For instance, one can take a canonical text\nin which animal concerns seem at first to play no part at all, say\nDavid Copperfield once more, and then trace in it the fault lines of the\nanimal\/human distinction. In this case we might move from consid-\neration of the lap dog ‘Jip’ who serves as a kind of double to David’s\ndecoratively genteel first wife, Dora (dog and mistress even dying at the\nsame time), or his aunt Betsey’s phobia of donkeys (and men), and the\nubiquity of horses and animal imagery and metaphors. Once removed\nfrom its customary blind spot, the place of animals in the work of\nhuman self-imaging, representation and work becomes peculiarly\nand even disturbingly obvious. However, as David Wood observes,\n‘Once we have seen through our self-serving, anthropocentric thinking\nabout other animals, we are and should be left disarmed, ill-equipped\nto calculate our proper response.’7 For instance a literary critic can\nsay ‘What would War and Peace be without horses?’ – but then\nwhat?\n‘. . . keep travelling for grass.’\nThe issue of animals poses imponderable questions on the unstable\nborder between ‘the contextual,’ treating animals entirely as facets\nof human culture (e.g studying different attitudes to the horse in\ndifferent places and times) and ‘the meta-contextual,’ such as attempts\nto consider the animal ‘in its own right.’ To makes these issues more\nlegible, and to give a sense of their immense stakes, I would like to\n20 Oxford Literary Review\noffer an experimental reading of the Australian Henry Lawson’s famous\nshort story ‘TellingMrs Baker’ ?8 This was first published in Blackwood’s\nMagazine for October1901, during Lawson’s brief stay in England.\n1901 also happens to be the year of ‘federation,’ that is the year in\nwhich the separate British colonies came together to form the country\nstill called ‘The Commonwealth of Australia.’\n‘Telling Mrs Baker’ is the story of two drovers who return to lie to\none Mrs Baker about the supposedly brave and noble death by fever\nof her husband, Bob Baker, nicknamed ‘the Boss,’ droving cattle across\nthe Australian bush – he actually died from alcohol poisoning. Baker’s\ndeath is grotesque and sordid (at one point he strips naked in despair\nto try to hang himself in the scrub) and his posthumous effects expose\nhim as a sexual predator on the wives of friends. Nevertheless, his two\nmates, Andy M’Culloch and the narrator, believe that ‘it isn’t Bush\nreligion to desert a mate in a hole’ (p. 198). Having stuck with Baker\nin life, they now contrive to tell a massive and exonerating lie about\nhis death to Mrs Baker when they return to the small town of Solong,\ntowards Sydney. This confrontation of the sexes makes up most of the\nnarrative.\nMy reading experiment falls into two parts, the first approaching the\ntext with the tools of a relatively familiar kind of contextual reading,\nthe second trying to engage with how the issues of nonhuman ethics\nforce one to go beyond that.\n(A) An environmental hatred marks ‘Telling Mrs Baker’ and many\nof Lawson’s stories about ‘the Out Back Hell’ that helps Bob Baker\ndestroy himself. The Bush and the Outback seem to deride any given\nassociations of ‘nature.’ Lawson’s sketch-story ‘Hungerford’ mocks that\ngenre of travel journalism that depicts the scenery and amenities of a\ndestination with a view to enticing the reader to visit it. Lawson turns\nthe genre on its head to detail all the reasons not to visit Hungerford,\nNew South Wales.9 Lawson’s nightmare images help legitimate what\nwas almost universally felt to be the duty of colonial society to redeem\nthe land by making it fit for various forms of agriculture and settlement:\nSomebody told me that the country was very dry on the\nother side of Nevertire. It is. I wouldn’t like to sit down on\nit anywhere. The least horrible spot in the bush, in a dry\nTimothy Clark 21\nseason, is where the bush isn’t – where it has been cleared\naway and a green crop is trying to grow.10\nLawson shows little effort to grasp the specific ecology of these places,\nseeing mostly similarities between wild Australia and landscapes that\nhave been ruined by human waste or mistreatment. Australian nature\nis not ‘natural’ in any recognisable sense but a kind of waste dump: ‘We\ncrossed the Macquarrie – a narrow, muddy gutter with a dog swimming\nacross, and three goats interested’ ;11 ‘The country looks as though\na great ash-heap had been spread out there, and mulga scrub and\nfirewood planted – and neglected.’12 One story indulges the geological\nfiction that the very rock is rotting.13\nSuch a land seems good only for changing into something more\nrecognisably European, pastoral, pretty and profitable. In Lawson the\ndenigration of the Australian environment and exaggerations of its\n‘weirdness’ became part of an idealization of the shearers and settlers\nthat faced such realities, the new supposedly (masculine) Australian\ntypes, stoical, loyal, egalitarian (at least with fellow Europeans), taciturn\nand even sardonic, resourceful, tough. The form that such cultural\nnationalism took may be marked by the contingency that the 1890s\nwere both a time of drought and of economic depression.\nBob Baker is introduced at the opening of the story as a former\n‘squatter,’14 or landowner, in the business of keeping sheep and\nbreeding race horses. However, he fell into ruin by spending too much\ntime in Sydney in ‘swell hotels’ (p. 196), following up the horse racing\nside of his interests. ‘So after a pretty severe drought, when the sheep\ndied by the thousands on his runs, Bob Baker went under, and the\nbank took over his station and put a manager in charge’ (p. 196). He\nseems to take to excess drinking when he becomes a drover (p. 197),\nand maybe even ‘hadn’t been quite right in his head before he started\ndrinking – he had acted queer sometimes . . .maybe he’d got a touch of\nsunstroke or got brooding over his troubles’ (p. 198).\nBaker’s new job, joined by Andy M’Culloch and the narrator, does\nnot seem to be routine cattle droving. It is an unspecified long-distance\nenterprise that will need two years in all, travelling inland and north\nwest for over 1,500 miles towards ‘new country round by the Gulf of\nCarpentaria with a big mob of cattle’ (p. 196, emphasis added). This\nreads like the use of the cattle mob to open up the continent, either\n22 Oxford Literary Review\nto enlarge already existing runs or to try to establish new pastoral\nbusinesses in Northern Queensland. This would put Baker and his\nfriends within a recognised ‘pioneering’ tradition. Eric Rolls writes: ‘So\nmany Australian explorers went, or were sent, chasing rainbows: inland\nseas or good stock routes where there was only desert.’15\nGraham Huggan’s Australian Literature: Postcolonialism, Racism,\nTransnationalism (2007) offers a new overview of Lawson’s career.16\nHuggan tries to rescue Lawson from his dubious status as a (white)\nnationalist Australian icon by stressing modern readings that ‘focus on\nracial exclusionism, spurious appeals to solidarity, and a sexual division\nof labour that highlights the vanities and insufficiencies of men’ (p. 56).\nAll three points immediately suggest a reading of ‘Telling Mrs Baker.’\nLawson’s work is thus recuperated in a qualified way through being\nretrospectively gauged against modern notions of equity:\nWhile it would be optimistic, to say the least, to convert\nLawson into a surreptitious champion for Aborigines, stories\nlike ‘The Bush Undertaker’ suggest that he was certainly\naware, like most of his contemporaries, of the racialized\nanxieties underlying white-settler claims upon the land they\nselected for their own. (p. 58)\n‘Telling Mrs Baker,’ however, is more explicitly about the\n‘constructions’ of gender that the colonial situation sets up. The\ndomestic Mrs Baker, ‘with nothing particular about her in the way\nof brains’ (pp. 202-3), is lied to in ways that help her sustain a self-\nimage as the loving wife of a brave man who heroically succumbed to\nthe perils of the frontier. She also consents to her husband’s invented\n‘last wish’ (p. 201) that she return to Sydney. That city appears here as\nthe place of domestic security and illusion, of a willing ignorance about\nthe real hardships of the land on which it depends. An earlier passage\nin the story has the narrator mock his presumed urban readership –\n‘Sounds queer to you city people don’t it?’ (p. 199).\nLike the famous lie to the intended that ends Joseph Conrad’s\ncontemporary novella, Heart of Darkness (1899), the lie to Mrs Baker\ndoes more than cast her in a protected and patronised feminine role.\nHer being kept in that role also helps sustain the lie of the man’s\nheroism and self-sacrifice. Whereas Conrad’s Kurtz seems to succumb\nTimothy Clark 23\nto what is controversially depicted as the barbarism of indigenous\nAfricans, Baker’s antagonist was the Australian environment, its\ndroughts and emptiness, and his own lack of the strength of character\nto resist it, a strength, however that Lawson is quick to attribute to\nother men, such as the two mates.\nAny comparison with the end of Heart of Darkness is complicated\nby a kind of doubling. Bob Baker has a brother, Ned, and Mrs Baker\na sister, a Miss Standish from Sydney (no first names are given for the\nwomen). Both siblings are counterparts. Ned Baker is like his brother\nin being the victim of an environment that refuses to support for long\nhis particular mode of exploiting it. He is ‘fighting the drought, the\nrabbit-pest, and the banks, on a small [sheep] station back on the\n[New South Wales\/Queensland] border’ (p. 198), set in hopeless ‘God-\nforsaken scrubs’ (p. 199). But Ned Baker is also unlike his alcoholic\nbrother in being reliable, honourable and hard-working. He helps clear\nup the mess of his brother’s death, avenging himself on a publican who\nexploited Bob’s infatuation with a girl employed in his pub to lure\nmen to buy her drinks. Miss Standish is a counterpart to Mrs Baker.\nWhereas Mrs Baker seems happy to be stupid, Miss Standish is pictured\nas intelligent, a good looking young woman, dressed in a city style. She\nalso writes short stories for the Sydney Bulletin. Miss Standish soon sees\nthrough the lie being told her sister and has to be silenced by a carefully\naimed wink. Later she follows the men as they leave, thanks them and\nkisses them warmly on the mouth.\n‘Telling Mrs Baker’ pivots around a dichotomy between those who\nknow the truth but require others who need to be lied to and those who\nneed to be lied to, Mrs Baker, city people on the whole. Miss Standish\nseems set to write for the Sydney Bulletin along the already rather trite\nlines of ‘I like the Bushmen! They are grand men – they are noble’\n(p. 208), an odd thing to say given what she knows about her brother-\nin-law. It certainly seems a double-edged compliment to the Bulletin,\nthe journal with which Lawson was most associated, especially in a\nstory published in the year 1901.\nA loosely eco-feminist of reading of ‘Telling Mrs Baker’ might\nfocus on the way an environmentally destructive colonial situation\nboth perpetuates and depends on certain gender roles. Lawson could\nthen be said to demonstrate the contingency or constructed nature of\nthose roles, highlighting what might now be seen as the demeaning\n24 Oxford Literary Review\ncost of the whole enterprise. In dying in the bush Baker anticipates\nthe series of white male pioneer figures in Australian literature whose\ndeath somehow sanctifies and appropriates the land – except that\nhere, ambivalently, it is only the idealistic loyalty with which that myth\nis maintained as an known fiction that seems to justify it. At the same\ntime, by perpetuating their mutually supporting lies, both the two\nmates and Miss Standish can also be said to evade the environmental\nissues that the story must raise. If Miss Standish’s readership in the\nSydney Bulletin will feel inclined to admire the loyalty and endurance\nof the Bushmen, her kissing them at the end of Lawson’s text also seems\nan evasion and eclipse of what had after all been the tale of one man’s\nsordid defeat in farming practices that seem at odds with the actual\nlandscape and climate. Australian if not British readers of ‘Telling Mrs\nBaker’ in 1901 would have recognised in the reference to the Bulletin a\nleading organ of the Australian cultural nationalism of the 1890s, one\nthat helped set up a (masculinist) image of the ‘Australian’ as defined\nand distinguished by a relationship to the Bush, with many of the\nselective egalitarian values associated with Lawson himself.17\n(B) How far does this take us? So far this reading has been within\nfamiliar critical parameters. It has taken the human cultural sphere as its\nobject and studied it as a field of power relations that pose various kinds\nof identity in various ways, in this case in terms of gender stereotypes\nthat help legitimate the brutal colonization and settlement of Australia.\nSo far the environment itself, and any non-human animals, have been\nconsidered only as adjuncts of the human story, like the thousands of\nsheep that helped ruin Baker’s livelihood by dying of thirst. This has\nall been a matter of cultural political contexts, but not of the meta-\ncontextual as defined earlier.\nA first complication or refinement of this reading, then, might\nconcern some of the stakes of the notion of the human and human\nidentity implicit in the text, emulating Cary Wolfe’s attention to\na pervading speciesism. Wolfe follows Derrida in finding some\nadvocates of animal ‘rights’ problematic because such ‘rights’ already\nrest on a specific understanding of the human which is heavily\ncompromised and already deeply implicated in modes of exploitation.18\nIt remains a limitation even of many ecocritical essays concerned with\nenvironmental justice that they still rest on the assumptions of a liberal\njustice model that takes human agents as the sole concern, granting\nTimothy Clark 25\nvalue to the non-human only derivatively . Secondly, that human ‘right’\nis understood on the model of a utility- and power-maximizing rational\nindividual, and justice as a matter of the adjudication of competing\nareas of self-interest, and of the equitable allocation of limited natural\nresources or assets, such as animals. Derrida writes of the absurdity\nof applying such a concept to non-human creatures: ‘to confer or\nto recognize rights for “animals” is a surreptitious or implicit way of\nconfirming a certain interpretation of the human subject, which itself\nwill have been the very lever of the worst violence carried out against\nnonhuman living beings.’19 So an eco-feminist reading of ‘Telling Mrs\nBaker’ would want to consider how far its issues would be compromised\nby any argument that confined itself to protesting the way women were\nexcluded from full entry into such a model of personhood. Secondly,\nif environmental justice is only defined as ‘the right of all people to\nshare equally in the benefits bestowed by a healthy environment’20\nthen the ethical challenge of non-human animals, as putative victims\nof such people’s ‘rights,’ must also reassert the exciting but unstable\nmeta-contextual element of environmentalist thinking.\nA more meta-contextual reading of ‘Telling Mrs Baker’ might test\nthe implications of the fact that human beings have always existed as\npart of a community of animals. Human beings could not exist and\ncannot be understood without other species, whatever the tendency\nof modern societies to keep livestock hidden away in factory-like\nenclosures while people yet live as if red meat were on tap, like water\nfrom a reservoir. Modern Australian history is legibly not just a history\nof human beings. Many of its victims, and some of its winners, are\nnon-human. The European settlement was a matter of the partial but\noften extensively destructive supplanting of one biota by another, partly\nby human intent, as with wheat crops and cattle, but often without\nit, as with infestations of rabbits and cane toads. Not in any country,\nbut perhaps least of all Australia, should one continue to write history\nas if it were a matter of human agency alone. It would like trying to\nunderstand the cuckoo without making reference to other birds.\nNo indigenous animals appear in ‘Telling Mrs Baker.’ All the\nanimals named are introductions, sheep, rabbits, horses, cattle, dogs.\nNo aboriginal people appear either. The invisibility of indigenous\nlife is appropriate in its sinister way. The defeat of the Aborigines\nwas to a significant degree owing to the least visible members of\n26 Oxford Literary Review\nthe European biota, viruses and bacteria, including some ultimately\nderived from domesticated animals. Europeans arrived on the shore of\nAustralia, as they did North America, in ships stacked with livestock\nand after centuries of living with domestic animals and birds, sharing\nboth their diseases and immunities. In effect settlers and their animals\nformed a kind of social unit, one whose members were to a degree\nmutually intelligible through each other’s signals. Wherever the cattle\nran, even over wide areas, they brought with them the jurisdiction of\ntheir human owners. Deborah Bird Rose even suggests: ‘the conquest of\nAustralia did not begin in 1788. It began about 10,000 years ago when\nour ancestors domesticated cattle.’21 British settlers and transported\nconvicts arrived on the shore of a continent inhabited by hunter gathers\nwith little or no resistance even to chickenpox or other ‘minor’ ailments.\nThe stoicism and toughness of some of Lawson’s figures is undercut by\nthe way in which the European conquest of much of the world was to\na large degree an accident of European microlife.\nThis meta-contextual dimension is missing from such modern\nstudies as Huggan’s Australian Literature (2007) or the collection\nUnsettling Settler Societies: Articulations of Gender, Race, Ethnicity and\nClass (1995).22 In meeting this lacuna an indispensable resource\nis Alfred W. Crosby’s frightening book Ecological Imperialism: The\nBiological Expansion of Europe, 900-1900 (1986).23 Crosby studies the\nlarge, mainly acultural and meaninglessly biological forces behind the\nextraordinary fact that it was people of European descent who came\nto inhabit and dominate large areas of the earth, especially most of\nthe temperate zones. This suggests an over-view that places Lawson’s\nstory in a global context of colonial ecocide. Crosby also presents his\nreaders with the challenge that these ‘Neo-Europes’ are now responsible\nfor a large proportion of the world’s food production, in both grain\nand meat. ‘The regions that today export more foodstuffs of European\nprovenance – grains and meats – than any other lands on earth had no\nwheat, barley, rye, cattle, pigs, sheep, or goats whatsoever five hundred\nyears ago’ (p. 7).\nConsideration of animals makes it seem problematic to see the\nculture of 1901 Australia solely in terms of the post-Foucauldian notion\nof discourse used in Huggan’s Australian Literature, that is ‘the sum\nof “available ways of speaking [and] writing in which social power\noperates to produce certain objects and effects” (Susan Sheridan).’24\nTimothy Clark 27\nThis is an overly anthropocentric methodology that gives a curtailed\nview of something that was actually matter of numerous species and the\naccidents of their interaction. The catastrophe of the rabbit infestation\ndemonstrates just how far the role of people ‘was less a matter of\njudgement and choice than of being downstream of a bursting dam’\n(Crosby p. 192). Critics need to find ways of describing animals and\nnatural features as themselves agents, rather than as passive functions\nof some moulding social discourse, ‘constructed’ as they like to say – as\nif any human culture could ever really form an enormous construction\nsite in that self-contained way.\nA further reading of Lawson’s story might pivot upon the following\npassage, which it is perhaps easy to skim over in the exclusively human\ninterest of tracing the decline of the Boss and the reaction of his mates:\nWe had two other men with us, but had the devil’s own\nbother on account of the cattle. It was a mixed-up job all-\nround. You see it was all big runs round there, and we had\nto keep the bullocks moving along the route all the time, or\nelse get into trouble for trespass. The agent wasn’t going to\ngo to the expense of putting the cattle in a paddock until\nthe Boss sobered up; there was very little grass on the route\nor the travelling-stock reserves or camps, so we had to keep\ntravelling for grass. (p. 197)\nWhat Lawson does not write is that in passing across and obliterating\nnumerous boundaries of the traditional inhabitants, such high-pressure\npastoralism also drove out many native animals as it displaced or\ndestroyed Aboriginal societies. Ecological disaster became the chief\nagent of rapid colonization and conquest. Even the native grasses were\nlost. Eric Rolls writes of the first years of the British colony:\nThe only things not thriving in the Colony were Australian\ngrasses. Their roots had run in a spongy soil full of humus.\nThey were accustomed to fire, to drought, and flood, to\ndeficiency of nitrogen and phosphorus, to the gentle feeding\nof sharp-toothed kangaroos at the clumped butts, and the\npicking of their seeds of parrots and pigeons and rats. They\nhad never had their whole seed heads snatched in one\n28 Oxford Literary Review\nmouthful; they had never been trampled by cloven hooves;\ntheir surface roots had never had to run in hard ground.25\nThe very weeds were introductions, like dandelions, or like ‘plantain,\nthe Englishman’s foot.’26\nDerrida envisages a massive shift in the way human beings engage\nwith the non-human and the challenge of understanding differently the\n‘history of law and of the concept of right.’27 This must be especially\nintractable in the case of nation-states like Australia, founded for a large\npart on the basis of the eradication of indigenous biota for the benefit\nof the narrow, fragile eco-system of an originally European agriculture.\nWith early Twenty-First Century Australia now suffering under a long,\nunprecedented and sometimes catastrophic drought, with increasing\ncalls for modes of agriculture there less at odds with its natural\ncontext,28 Lawson becomes newly fascinating not as an Australian\nicon but as a writer of environmental conflict and degradation. His\ncharacters already live in what Ulrich Beck calls ‘the age of unintended\nconsequences.’29\nOne possible way in which the contemporary rereading of Lawson\nmight work is through the arguments of the bioregionalism movement.\nAssociated with Kirkpatrick Sale, Gary Snyder and Jim Dodge,30 this\nadvocates modes of life, work and thought geared sensitively and for the\nlong term to natural bio-regions, as opposed to modes of life forcibly\ndefined within the often arbitrary or violently imposed boundaries of\nthe modern nation state, with its associated and often over-centralized\nimposition of agricultural practices geared only to short term profit.\nWhereas older generations took for granted a basic fluency in the flora\nand fauna of their place – ‘what is taught by plants and weather’31 –\n‘[m]any contemporary Americans,’ Snyder writes, ‘don’t even know\nthat they don’t “know the plants”.’32 Seen in terms of the long-term\nchances for such a society to survive, such loss of local knowledge begins\nto look disastrous: ‘The United States, Canada, Mexico, are passing\npolitical entities; they have their legitimacies, to be sure, but they\nwill lose their mandate if they continue to abuse the land.’33 In effect\nbio-regional readings and practices, sensitive to issues concerning local\nfauna and flora, can form an intelligent subversion of the institutions\nand economics of the modern nation state. They also, I suggest,\nreturning to the Australian example, can induce revised readings of the\nTimothy Clark 29\nsocial, cultural and identity politics which such a nation state induces\nand sustains.\nA bioregional focus can also undo what has been called the\n‘methodological nationalism’34 of dominant ways of reading cultures\nand texts, i.e readings that take the exclusively human society defined\nby the boundaries of a nation state as its sole stage, and which\nwill study David Copperfield or ‘Telling Mrs Baker’ solely within the\nterms of the emerging and conflicting identities and human interests\nwith that national culture’s development and vicissitudes. In Lawson’s\ncase, implicit ways of being ‘Australian’ are given a double-edged\ncelebration in their very vulnerability, while dubious models of gender\nare posed within the framework of nation-building. Against this,\nSnyder’s ascription of agency to the non-human (to ‘what is taught\nby plants and weather’ (p. 41)) may serve to underline the narrowness\nof any critical method that reads ‘Telling Mrs Baker’ solely in terms of\ncategories of the social construction of identity. This short story could\nin fact be described as explicitly dramatising a lie that seeks to contain\nall the action it depicts to the stage of an culturally bounded human\nidentity politics.\nAs Australia becomes ‘arguably the first developed nation to feel the\nimpact of climate change at a visceral level,’35 its current ‘millennium\ndrought’ alters, in a long term perspective, the significance of Lawson’s\nwork from out of the ‘federation drought’ (1895-1902). As a text of\nlies and environmental degradation published in the year of Australia’s\nfederation, ‘Telling Mrs Baker’ already fulfils Beck’s sense that the\nenvironmental crisis will erode both the bases and legitimacy of the\nmodern nation state.\nThe crisis also patently disregards and effectively deconstructs the\ndistinction of animal and human. A farmer like Ned Baker, trying\nto survive on a farm devastated by lack of water and by rabbits his\nown society introduced, is a figure for whom Beck’s ‘the risk society’ is\nalready a valid term. Beck shows how the demands of ‘environmental\njustice’ metamorphose in such a society in drastic, unprecedented ways\nincompatible with the modern state’s administration of distributive\njustice. Modern environmental risks – with CO2 emissions, radiation,\nGM plants, particulates, desertification, etc. – all exceed the normal\noperation of established systems of insurance or of possible litigation\nfor damages, systems capable only of dealing with calculable and\n30 Oxford Literary Review\nquantifiable risks to a specific and limited number of people (it cannot\nfor instance cover the majority of the victims of the Chernobyl disaster,\nfor they are yet to be born). The current state of the world seems\nequivalent to that of elements of pastoral Australia Lawson struggled\nto see, an intensifying agricultural\/industrial accident, one whose exact\nconsequences cannot be gauged, for which insurance is meaningless\nand which touches all living things in some way or another. Beck writes:\nIn terms of social politics . . . the ecological crisis involves a\nsystematic violation of basic rights, a crisis of basic rights,\nwhose long-term effect in weakening society can scarcely\nbe underestimated. For dangers are being produced by\nindustry, externalised by economics, individualized by the\nlegal system, legitimised by the natural sciences and made\nto appear harmless by politics. That this is breaking down\nthe power and credibility of institutions only becomes clear\nwhen the system is put on the spot, as Greenpeace, for\nexample, has tried to do.36\nUltimately, the human population of Australia will as eligible for\n‘compensation’ for long term climate change as a dead sheep. A massive\nand fatal discrepancy opens up between the norms of law (‘human\nrights’), government and economics and the realities over which they\nrule, a world in which all people may increasingly come to share the\nvulnerability of non-human animals. Bob Baker may not be the first\nto drink himself to death in an arid land unable to sustain for long his\nkind of farming. ‘Sounds queer to you city people don’t it?’ (p. 199).\nA New International?\nDerrida advocated a ‘new international’ between the human and the\nliving more generally.37 Perhaps this is not hard to describe in the\nabstract at least. If ‘justice’ is said to be the undeconstructible horizon of\ndeconstruction, that in the ‘name of ’ which one thinks and works, then\nthe claim of the non-human to ethical attention obviously demands\na continuous reconsideration and revision of given law. Talking, as it\nhappened, in Australia, Derrida advocated in 1999 that that part of the\nidea of justice he calls ‘unconditional hospitality’ be extended beyond\nTimothy Clark 31\nthe human.38 What this actually means in practice, though, is far more\ndifficult to envisage.\nSome points can at least be made about aporias in current thinking\nand practice, focusing the dubious ways in which the putative science\nof ‘ecology’ functions in environmental writing and in culture more\ngenerally as a source of moral guidance.\nReferences to ‘ecology’ in the spheres of resource and environmental\nmanagement often use its assumed status as science to mask major\npolitical and social decisions: assumptions about ‘what we value’\nare both expressed and ‘obscured by the language of biological\nconservation’ (Matthew Oates).39 Such decisions come to the surface\nas soon as one starts to analyse efforts in modern Australia to\nrestore indigenous eco-systems and eradicate or at least control such\nintroductions as foxes or the feral cat. Such programmes usually take\n1788, the first date of European settlement, as kind of benchmark for\nrestoration. Adrian Franklin writes:\nthe orthodoxy in Australia holds that native animals are\nthose that were here at the time of the white settlement.\nHowever, this traps environmental action in the enigma\nof an eco-system they can never aspire to restore: the\nextensively burned pre-colonial landscape of Aboriginal\nAustralia, or indeed the dominance of acacias on the\ncontinent before they were displaced by eucalypts. By this\nlogic the dingo that came before the whites visited Australia\nis a native animal but the brumby [a local breed of horse\ngone feral] is not because it came just after.40\nEnvironmental culture often appropriates ‘ecology’ to rather tired\nromantic arguments along the lines of ‘human nature’ refinding\nits essence through a renewed contact with ‘nature,’ overcoming\nsupposedly alienating dualisms of mind and body, consciousness and\nobject etc. But, as Franklin’s point shows, what that ‘nature’ actually is\nis harder to gauge.\nReferences to ‘ecology’ also function lazily as a kind of eco-moralism.\nIn literary and cultural criticism this turns many readings into kinds\nof allegory of human transgression, as in Keith Tester’s statement: ‘So\nlong as we civilized men imagine ourselves to be apart from the land,\n32 Oxford Literary Review\nand from our fellow creatures, we shall attempt to exploit them for\nour private gain, and the attempt will kill us.’41 ‘Telling Mrs Baker’\nwould read in such a framework as an implicit green parable, one\nthat reasserted a norm of human re-integration into the natural world.\nReferences to the truths of ‘ecology’ may be often a hidden desire for a\nkind of providence.\nEcological restoration programmes are often a valuable response\nto the devastation wrought by settlement, as must be calls for\nmore suitable kinds of farming practice and water use coming from\ncampaigners such as Michael Archer and Bob Beale.42 However, they\ncan also indulge an unacknowledged and problematic kind of eco-\nnationalism or even eco-cleansing (indigenous = good, introduced\n= bad), a policy dubious in itself for its dogmatism and with\nuncomfortable overtones in a country often torn by debates about\nhuman immigration. Franklin shows that the people who might be\nimagined most to support such eco-cleansing, the Aborigines, are in\nfact most often against it.43 For instance, they value and exploit the\nintroduced cats and have in some cases made them part of their\nculture. While the monstrous damage done to Australian environments\nis incontestable, programmes for a restored ecology can also serve the\ncultural nationalism of a white majority anxious to ‘belong to’ or more\nlegitimately appropriate the continent, assuaging a legacy of guilt by\ncutting down elm trees and exterminating cats. Tim Low argues that\nAustralia’s now hybrid fauna and flora need sometimes to be accepted\nand celebrated for what they are.44\nIn sum, environmental politics cannot be decided for us by the\nscience of ecology. It must be more like politics elsewhere, the art of\nmaking the least bad decision in the face of incompatible, singular\nclaims. As the Australian example shows, even those who wish to\nreserve moral importance to the human species alone cannot coherently\ndo so without regard to the ethical claims of the non-human.\nNotes\n1 Jacques Derrida, Elisabeth Roudinesco, For What Tomorrow: A Dialogue (Stanford\nCA: Stanford University Press, 2004), 71.\n2 The few years since Derrida’s death have already altered the resonance of such\na passage as the following: ‘I have no right to abandon my responsibility under\nTimothy Clark 33\nthe pretext that this responsibility is modest, under the pretext that its effects are\nincalculable; one cannot calculate one’s responsibility, so its effects may well be\nnothing, almost nothing. In response to an emergency, I do what I can. I may\nwell be able to do a lot, I may well be able to do very little, even nothing –\nwhatever, I have no right to withdraw from doing something, under the pretext\nthat it will be done in vain. This is irresponsibility itself. Imagine a fire emergency\nand a fireman who under a pretext that he is unlikely to douse the fire with ten\nbuckets of water, may think of giving up. Does he? No, of course not.’ (‘Nietzsche\nand the Machine,’ Negotiations: Interventions and Interviews 1971-2001, ed., trans.\nElizabeth Roudinesco (Stanford CA: Stanford University Press, 2004), 215–56,\n255).\n3 Of Grammatology, trans. C.G.Spivak (Baltimore MD: Johns Hopkins University\nPress, 1974).\n4 Agency, Democracy, and Nature: The U.S. Environmental Movement from a Critical\nTheory Perspective (Cambridge, MA: MIT Press, 2000), 3.\n5 Rare examples would be Jean Hochman’s chapter ‘The Lambs in The Silence of the\nLambs,’ in Green Cultural Studies: Nature in Films, Novel, and Theory (Moscow,\nIdaho: University of Idaho Press, 1998); Chen Hong, ‘To Set the Wild Free:\nChanging Images of Animals in English Poetry of the Pre-Romantic and Romantic\nPeriods,’ ISLE 13.2 (Summer 2006), 129–49.\n6 See especially Animal Rites: American Culture, the Discourse of Species, and\nPosthumanist Theory (Chicago: University of Chicago Press, 2003).\n7 ‘Comment ne pas manger – Deconstruction and Humanism,’ in Animal Others: On\nEthics, Ontology, and Animal Life, ed. H. Peter Steeves (Albany: SUNY Press, 1999),\n15–35, 32.\n8 In The Penguin Henry Lawson Short Stories, ed. John Barnes (Ringwood, Victoria:\nPenguin Australia, 1986), 196–209. All page references will be to this edition. The\nstory also first appeared in the collection Joe Wilson and His Mates (Edinburgh and\nLondon: William Blackwood and Sons, 1901).\n9 ‘Hungerford,’ in The Penguin Henry Lawson , 45–8.\n10 ‘In A Dry Season,’ in The Penguin Henry Lawson 37–9, 38\n11 ‘In A Dry Season,’ 38.\n12 ‘Hungerford,’ p. 46.\n13 ‘The Geological Spieler’, Henry Lawson, Portable Australian Authors, ed. Brian\nKieran (St Lucia, Queensland: University of Queensland Press, 1976), 168–75.\n14 A ‘squatter’ here means specifically a large landholder of acres first wrongfully seized\nin the great outward grab of first colonization, an appropriation that was usually\nlegalised in retrospect (‘Where else [but Australia] are criminal records the only\n34 Oxford Literary Review\nrecord of land settlement?’ (Eric Rolls, A Million Wild Acres (Ringwood, Victoria:\nPenguin Australia, 1981), 72).\n15 A Million Wild Acres, 97.\n16 Australian Literature: Postcolonialism, Racism, Transnationalism (Oxford University\nPress, 2007), 55–8.\n17 See A.A. Phillips, Henry Lawson (New York: Twayne Publishers, 1970), 11–26.\n18 Animal Rites, 33–46.\n19 For What Tomorrow, 65.\n20 Joni Adamson, Mei Mei Evans, and Rachel Stein, Introduction to The\nEnvironmental Justice Reader eds. Adamson, Evans, and Stein (Tucson AZ:\nUniversity of Arizona Press, 2002), pp. 3–14, 4.\n21 Reports from a Wild Country: Ethics for Decolonisation (Sydney: University of NSW\nPress, 2004), 74.\n22 Unsettling Settler Societies: Articulations of Gender, Race, Ethnicity and Class, ed.\nDaiva Stasiulis and Nira Yuval-Davis (London: Sage, 1995).\n23 Ecological Imperialism: The Biological Expansion of Europe, 900-1900 (Cambridge:\nCambridge University Press, 1986).\n24 Australian Literature, 23.\n25 A Million Wild Acres, 28.\n26 Ecological Imperialism, 169.\n27 For What Tomorrow, 74.\n28 See Michael Archer and Bob Beale, Going Native: Living in the Australian\nEnvironment (Sydney: Hodder, 2004). More than a decade ago, Ian Anderson\nwrote,\nAgriculture is one of the mainstays of Australia’s economy. But ironically,\nthe country is not well suited to the European styles of farming that are\npractised. ‘That Australia’s agriculture has been as productive as it has is\na testament to Australians’ innovation, technical skill and determination\nover two centuries,’ say government scientists in a paper prepared for\na meeting of the Prime Minister’s Science Council last month. The\ncountry’s soils are thin – most are less than 10 centimetres deep –\nand contain little organic matter. The weather is not dependable either,\noften fluctuating between prolonged drought and severe flooding. Added\nto this, Australia’s native mammals have padded feet that do minimal\ndamage to soil. By comparison, the hooves of imported animals are far\nmore destructive. (p. 12)\n‘According to Jason Alexandra of the ACF, this list of woes is\nevidence that Australia is depleting its resources by trading agricultural\nTimothy Clark 35\ncommodities for manufactured imports. In effect, it sells topsoil for\ntechnologies that will be worn out or redundant in a few years. The\ncountry needs to get away from the ‘colonial mentality’ of exploiting\nresources and adopt agricultural practices suited to Australian conditions,\nhe says.’ (‘Australia’s Growing Disaster,’ New Scientist 29 July 1995. pp.\n12–3.)\n29 World Risk Society (London: Polity Press, 1999), 119.\n30 See Kirkpatrick Sale, Dwellers in the Land: The Bioregional Vision (San\nFrancisco: Sierra Club Books, 1985); Gary Snyder, The Place of the Wild: Essays\n(Washington DC: Shoemaker & Hoard, 1990); Jim Dodge, ‘Living By Life:\nSome Bioregional Theory and Practice,’ CoEvolution Quarterly (Winter 1991),\npp. 6–12.\n31 The Place of the Wild, p. 41.\n32 The Place of the Wild, p. 43\n33 The Place of the Wild, p. 44\n34 A.D. Smith as quoted in Ulrich Beck,What is Globalization, trans. Patrick Camiller\n(Oxford: Polity Press, 2000), p. 21.\n35 ‘. . .While a Country Bakes,’ New Scientist 22nd\/29th December 2007, 15.\n36 World Risk Society, 39.\n37 For What Tomorrow, 98.\n38 Derrida, Deconstruction Engaged: The Sydney Seminars, ed. Paul Patton and Terry\nSmith (Sydney: Power Publications, 2001), 111–2. Derrida’s earlier formulations\nof this ‘new international’ had been hazy on the topic of non-human animals: see\nNicholas Royle, The Uncanny (Manchester: Manchester University Press, 2003),\n245, 249.\n39 ‘The Dying of the Light: Values in Nature and the Environment,’ British Wildlife\n18.2 (December 2006), 88–93, 91.\nEcological arguments applied to animal management instantiate an anthro-\npocentric divide between the human as manager, exempt from the policies\nadministered, and the rest of the biosphere as managed. There is also a direct clash\nbetween the claims of animal ethics, attentive to issues of cruelty to individual\ncreatures, and an ecological concern with eco-systems as a whole and their\nbiodiversity. An ‘ecological’ appeal to ‘biodiversity’ works in effect as a crude\nkind of utilitarian calculus, unable to function as a universally applicable rule\nwithout individual injustice. The difficulty can be stressed simply by turning\nsuch ecological thinking on the human species itself: ‘A large scale cull is urgently\nneeded to save the environment. Humans are in no danger of extinction, and their\npopulation would remain healthy and sustainable.’\n36 Oxford Literary Review\nFor more on the split between mainstream environmentalist writing and\nthe literature of animal advocacy see Rebecca Raglon and Marian Sholtmejer,\n‘ ‘Animals are not believers in ecology’: Mapping Critical Differences between\nEnvironmental and Animal Advocacy Literatures,’ in ISLE 14.2 (2007),\npp. 121–40.\n40 Animal Nation: The True Story of Animals and Australia (Sydney: University of New\nSouth Wales Press, 2004), 147.\n41 Animals and Society (London: Routledge, 1991), 8.\n42 Going Native: Living in the Australian Environment.\n43 Animal Nation, 166–92.\n44 The New Nature (Ringwood Victoria: Penguin Australia, 2002).\nDOI: 10.3366\/E0305149807000065\n"}