{"doi":"10.1103\/PhysRevE.73.066223","coreId":"70848","oai":"oai:eprints.lancs.ac.uk:10106","identifiers":["oai:eprints.lancs.ac.uk:10106","10.1103\/PhysRevE.73.066223"],"title":"Dissipative area-preserving one-dimensional Fermi accelerator model.","authors":["Leonel, Edson D.","McClintock, Peter V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-06-27","abstract":"The influence of dissipation on the simplified Fermi-Ulam accelerator model (SFUM) is investigated. The model is described in terms of a two-dimensional nonlinear mapping obtained from differential equations. It is shown that a dissipative SFUM possesses regions of phase space characterized by the property of area preservation","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70848.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/10106\/1\/PRE2006DissipativeFermi.pdf","pdfHashValue":"ce4cb2b01df3245e7015e16d8f8cb285554d6d13","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:10106<\/identifier><datestamp>\n      2016-10-04T23:00:11Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Dissipative area-preserving one-dimensional Fermi accelerator model.<\/dc:title><dc:creator>\n        Leonel, Edson D.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        The influence of dissipation on the simplified Fermi-Ulam accelerator model (SFUM) is investigated. The model is described in terms of a two-dimensional nonlinear mapping obtained from differential equations. It is shown that a dissipative SFUM possesses regions of phase space characterized by the property of area preservation.<\/dc:description><dc:date>\n        2006-06-27<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevE.73.066223<\/dc:relation><dc:identifier>\n        Leonel, Edson D. and McClintock, Peter V. E. (2006) Dissipative area-preserving one-dimensional Fermi accelerator model. Physical Review E, 73 (6). 066223-066225. ISSN 1539-3755<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/10106\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1103\/PhysRevE.73.066223","http:\/\/eprints.lancs.ac.uk\/10106\/"],"year":2006,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"Dissipative area-preserving one-dimensional Fermi accelerator model\nEdson D. Leonel\nDepartamento de Estatística, Matemática Aplicada e Computação, Instituto de Geociências e Ciências Exatas, Universidade Estadual\nPaulista Av.24A, 1515, Bela Vista, CEP 13506-700, Rio Claro, São Paulo, Brazil\nP. V. E. McClintock\nDepartment of Physics, Lancaster University, Lancaster, LA1 4YB, United Kingdom\n\u0001Received 19 December 2005; revised manuscript received 8 May 2006; published 27 June 2006\u0002\nThe influence of dissipation on the simplified Fermi-Ulam accelerator model \u0001SFUM\u0002 is investigated. The\nmodel is described in terms of a two-dimensional nonlinear mapping obtained from differential equations. It is\nshown that a dissipative SFUM possesses regions of phase space characterized by the property of area\npreservation.\nDOI: 10.1103\/PhysRevE.73.066223 PACS number\u0001s\u0002: 05.45.Ac, 05.45.Pq, 47.52.\u0001j\nI. INTRODUCTION\nFollowing Enrico Fermi’s seminal paper \u00031\u0004, the one-\ndimensional Fermi accelerator model has been studied over\nmany years, using a range of different approaches. The\nmodel was originally introduced as a possible mechanism by\nwhich cosmic rays can acquire their enormous energies. It\ninvolves acceleration of charged particles through their inter-\naction with periodically varying magnetic fields. Fermi’s\nmodel was subsequently modified in order to take into ac-\ncount many other physical situations. One variant is the well-\nknown Fermi-Ulam accelerator model \u00032–4\u0004 \u0001FUM\u0002. It con-\nsists of a classical particle confined between two rigid walls,\none fixed and the other moving in time, in the absence of\nexternal fields. For periodic motion of the moving wall, the\nmain results can be summarized as: \u0001i\u0002 at low energy, the\nphase space presents a chaotic sea that \u0001ii\u0002 surrounds\nKolmogorov-Arnol’d-Moser \u0001KAM\u0002 islands, whereas at high\nenergy \u0001iii\u0002 there is a set of invariant spanning curves. Many\nobservable, e.g., Lyapunov exponents, average velocity,\nroughness, etc., may be studied and characterized in the cha-\notic sea at low energy. For example, scaling arguments \u00035\u0004\ncan be used to describe the behavior of both average velocity\nand the corresponding deviation around it—the roughness\n\u0001see also Ref. \u00036\u0004 for recent results in the simplified FUM\u0002. A\ndifferent version that considers the presence of external\nfields, sometimes known as the bouncer \u00037\u0004, consists of a\nclassical particle in the presence of a constant gravitational\nfield, bouncing elastically against a rigid but periodically\nmoving wall. Remarkably, for appropriate control parameters\nand initial conditions and in contradistinction to the FUM, it\nis possible to observe unlimited growth in the average veloc-\nity and energy of the particle. This apparent discrepancy was\nlater explained by Lichtenberg, Lieberman, and Cohen \u00038\u0004\nwho showed that, although the models are very similar, there\nare intrinsic differences leading to different asymptotic be-\nhavior. Recently, a hybrid version of these two models has\nbeen proposed \u00039\u0004. It consists of a classical particle confined\nto bounce elastically between two rigid walls, one fixed and\nthe other moving periodically; in addition, there is a constant\nexternal field. For certain ranges of control parameters and\nappropriate initial conditions, the system possesses proper-\nties that are individually present in the FUM and bouncer\nmodels, but which coexist together in the hybrid version of\nthe model.\nThere are also many other variants of the basic Fermi\nmodel considering, for example, the consequences of dissi-\npation and even quantum effects \u000310–14\u0004. Dissipation can be\nintroduced, e.g., via consideration of inelastic collisions\n\u000315–21\u0004, a chaotic attractor may be present, regions of lock-\ning in the phase space may be observed, crisis events may be\ncharacterized \u000322\u0004, and the effect of a drag force \u000323,24\u0004\nwhere transients and attracting fixed points are present can\nbe investigated. The importance of studying these systems is\nthat they allow direct comparison of theoretical results with\nexperimental data \u000325–27\u0004. In addition, the formalism and\nmethods used in the description of these models are directly\nextendable to billiards problems \u000328\u0004.\nIn this paper, we revisit the FUM in order to study the\ncase where the particle is immersed in a fluid and therefore\nsuffers the action of a frictional \u0001drag\u0002 force. We will con-\nsider the simplified version of the complete FUM \u0001the\nSFUM\u0002: we thus assume that both walls are fixed but that,\nafter the particle collides with one of them, it suffers a\nchange of momentum as if the wall were moving. Following\nits introduction by Lieberman and Lichtenberg \u00033\u0004, this sim-\nplification of moving boundaries in mappings has been\nwidely applied \u00034,5,16,18,20,21,29\u0004. We have ourselves used\na simplified version of the hybrid Fermi-Ulam-bouncer\nmodel \u00039\u0004 in order to obtain analytically the existence con-\ndition for invariant spanning curves in both the low and high\nenergy domains.\nThe organization of the paper is as follows. In Sec. II we\npresent the model and discuss all the details needed for the\nconstruction of the nonlinear mapping. Our numerical results\nare also presented and discussed in this section. Final re-\nmarks are made, and conclusions drawn, in Sec. III.\nII. THE MODEL AND NUMERICAL RESULTS\nThe model in question thus consists of a confined classi-\ncal particle of mass m bouncing between two rigid walls in\nthe presence of a drag force whose magnitude is assumed to\nbe proportional to the particle’s velocity, Fv=−\u0002\u0001v, where \u0002\u0001\nis the viscosity. It is assumed that gravity and other external\nPHYSICAL REVIEW E 73, 066223 \u00012006\u0002\n1539-3755\/2006\/73\u00016\u0002\/066223\u00015\u0002 ©2006 The American Physical Society066223-1\nfields are absent. One wall is fixed at x= l and the other one\nis located at the origin x=0. The collisions with both walls\nare assumed to be elastic but we assume that, after hitting the\nwall at x=0, the particle changes momentum as if the wall\nwere moving according to the equation xw=\u0003 cos\u0001\u0004t\u0002. The\ndynamics is described by using a two-dimensional nonlinear\nmapping T\u0001vn , tn\u0002= \u0001vn+1 , tn+1\u0002 for the velocity and corre-\nsponding time variables. Supposing that the initial conditions\nare v=vn, t= tn with the particle’s initial position at x=0, and\nafter solving Newton’s second law −\u0002\u0001v=mdv \/dt, we find\nthat the velocity of the particle is given by vp\u0001t\u0002=vne−\u0002t. Its\ncorresponding position is xp\u0001t\u0002=vn \/\u0002\u00031−exp\u0001−\u0002t\u0002\u0004. The\nvariable \u0002 is defined as \u0002=\u0002\u0001 \/m. Note that, in the equations\nfor vp\u0001t\u0002 and xp\u0001t\u0002, we have redefined the origin of time as\nt→ t− tn. In obtaining the map, it is convenient to work in\nterms of dimensionless variables and so we define Vn\n=vn \/ \u0001\u0004l\u0002, \u0005=\u0002 \/\u0004, \u0006=\u0003 \/ l and \u0007n=\u0004t. The mapping that de-\nscribes the dynamics of the model can then be written as\nT:\u0005Vn+1 = \u0006Vn − 2\u0005 − 2\u0006 sin\u0001\u0007n+1\u0002\u0006\u0007n+1 = \u0007n − 1\u0005 ln\u00071 − 2\u0005Vn\bmod 2\b \t . \u00011\u0002\nThe second term in the second equation of \u00011\u0002 denotes the\ndimensionless time that elapses between two collisions.\nLet us briefly discuss the modulus function used in Eq.\n\u00011\u0002. Noting that both walls are fixed, we can immediately see\nthat successive collisions that are allowed in the FUM cannot\noccur in the SFUM. In the complete model, depending on the\nvelocity and phase, it is possible for the particle, after suffer-\ning one collision with the moving wall, to suffer a second\n\u0001i.e., “successive”\u0002 collision before exiting the collision area,\nand it can also have a negative velocity following the first\ncollision. In the simplified model, after a collision with the\nwall located at x=0 nonpositive velocities are forbidden be-\ncause they are equivalent to the particle traveling beyond the\nwall. In order to avoid such problems, if after a collision the\nparticle has a negative velocity, we inject it back with the\nsame modulus of velocity. Such a procedure is effected per-\nfectly by use of the modulus function. Note that the velocity\nof the particle is reversed by the module function only if,\nafter the collision, the particle continues traveling in the\nnegative direction. The modulus function has no effect on the\nmotion of the particle if it moves in the positive direction\nafter the collision. We stress that this approximation is valid\nonly for small values of \u0006.\nThe phase \u0007n+1 is defined as a real number only when\nVn\t2\u0005. If however Vn\n2\u0005, we thus conclude that the par-\nticle does not have enough energy for a further collision and\ntherefore comes to rest. The Jacobian of the mapping \u00011\u0002 is\nwritten as\nJ =\n\n\u0001\u0007n+1\n\u0001\u0007n\n\u0001\u0007n+1\n\u0001Vn\n\u0001Vn+1\n\u0001\u0007n\n\u0001Vn+1\n\u0001Vn\n\u000b , \u00012\u0002\nwith coefficients given by\n\u0001\u0007n+1\n\u0001\u0007n\n= 1,\n\u0001\u0007n+1\n\u0001Vn\n= −\n2\nVn\n2\n− 2\u0005Vn\n,\n\u0001Vn+1\n\u0001\u0007n\n= sgn\u0003Vn − 2\u0005 − 2\u0006 sin\u0001\u0007n+1\u0002\u0004\n\u000b\u0007− 2\u0006 cos\u0001\u0007n+1\u0002\u0001\u0007n+1\u0001\u0007n \b ,\n\u0001Vn+1\n\u0001Vn\n= sgn\u0003Vn − 2\u0005 − 2\u0006 sin\u0001\u0007n+1\u0002\u0004\n\u000b\u00071 − 2\u0006 cos\u0001\u0007n+1\u0002\u0001\u0007n+1\u0001Vn \b ,\nwhere the function sgn\u0001u\u0002=1 if u\t0 and sgn\u0001u\u0002=−1 if u\n\f0.\nCareful investigation of the determinant of the Jacobian\nmatrix shows that the mapping \u00011\u0002 yields det J=sgn\u0003Vn−2\u0005\n−2\u0006 sin\u0001\u0007n+1\u0002\u0004. This result tells us that it is in principle pos-\nsible for there to be regions of phase space where area pres-\nervation is satisfied. We will show, however, that this result is\nnot applicable throughout the whole of phase space. We be-\ngin investigating the behavior in the high energy regime. The\nfirst equation of \u00011\u0002 may be rewritten as\nV1 = V0 − 2\u0006 sin\u0001\u00071\u0002 − 2\u0005 ,\nV2 = V0 − 2\u0006\u0003sin\u0001\u00071\u0002 + sin\u0001\u00072\u0002\u0004 − 4\u0005 ,\nV3 = V0 − 2\u0006\u0003sin\u0001\u00071\u0002 + sin\u0001\u00072\u0002 + sin\u0001\u00073\u0002\u0004 − 6\u0005 ,\nand then the general expression as\nVn = V0 − 2\u0006\f\ni=1\nn\nsin \u0007i − 2n\u0005 . \u00013\u0002\nThe analysis of Eq. \u00013\u0002 allows us to conclude that the veloc-\nity of the particle decreases linearly as the iteration number n\nincreases. However, even supposing that \u0007 were uniformly\ndistributed in the interval \u0007\u0001 \u00030,2\b\u0002 so that on average\n2\u0006\fi=1\nm sin \u0007i=0, we would still expect the velocity to oscil-\nlate according to the sin\u0001\u0007n\u0002 function \u0001an effect seen only for\na small interval of n\u0002 with increasing n as time evolves. This\nis indeed the case, as shown in Fig. 1\u0001a\u0002 which plots the\ncalculated velocity as a function of n for \u0006=1\u000b10−3, \u0005=1\n\u000b10−5, with the initial condition V0=1 and \u00070=0. Figure\n1\u0001a\u0002 shows that the linear decrease in velocity persists over a\nlarge range of n. The inset of Fig. 1\u0001a\u0002 shows in detail the\nbehavior of the velocity V as function of n when the particle\npasses near a KAM island. Figure 1\u0001b\u0002 shows what happens\nin the phase plane V\u000b\u0007. For visual clarity, we have only\nplotted every fourth point. Thus, for each pair of successive\npoints connected by the dotted line \u0001as a guide to the eye\u0002\nthere are another three that were not plotted. Note that the\ngap shown in the inset of Fig. 1\u0001a\u0002 has the same amplitude\n\rV as that in Fig. 1\u0001b\u0002. Proceeding with a linear fit in the\nregime of high V, as shown in Fig. 1\u0001a\u0002, we find that the\nangular coefficient is given by −1.9990\u00017\u0002\u000b10−5, as pre-\ndicted by Eq. \u00013\u0002.\nEDSON D. LEONEL AND P. V. E. MCCLINTOCK PHYSICAL REVIEW E 73, 066223 \u00012006\u0002\n066223-2\nLet us now discuss the behavior of the velocity in the\nregion of the KAM islands. The stable regions for the sim-\nplified version of our model are shown in Fig. 2. There is a\nset of KAM curves, each surrounding an elliptic fixed point\nthat is represented as a dot in Fig. 2. The parameters used in\nFig. 2 were \u0006=1\u000b10−3 and \u0005=1\u000b10−5. For this combina-\ntion of control parameters, the period-one elliptic fixed\npoints given by V=2\u0005 \/ \u00031−exp\u0001−2\b\u0005i\u0002\u0004 and \u0007=\b\n+arcsin\u0001\u0005 \/\u0006\u0002 are stable for i=1,2 ,3 , . . .\n10 and \u0005 \/\u0006\n1.\nMoreover, outside these KAM curves, the particle behaves\nquite differently. We have shown that, in the regime of high\nenergy, the velocity of the particle decreases linearly as the\niteration number increases. It passes around the stable KAM\nislands \u0003see Fig. 1\u0001b\u0002\u0004 and then wanders chaotically \u0001in a\nchaotic transient\u0002 in the low energy domain for a number of\niterations that depends on the strength of the drag coefficient.\nAlong the chaotic transient, the particle might momentarily\nacquire small velocity increases. Once Vn\n2\u0005, however, the\nparticle will have insufficient energy to reach the active wall\nfor its next kick, and it therefore comes to rest.\nWe now characterize this transient for the dissipative\nSFUM in the low energy domain. To do so, we will evaluate\nthe time evolution n for an ensemble of m different initial\nconditions in the regime of low energy. We will take as initial\nconditions different points uniformly distributed in the cha-\notic sea for the nondissipative case, and then study their\nasymptotic evolution in the dissipative version. However, as\nthe drag force can cause some modifications to the form of\nthe phase space, it is possible for some regions of the chaotic\nsea in the nondissipative case to yield periodic or quasiperi-\nodic behavior in the dissipative version. If we find we have\ntaken an initial condition leading to periodic or quasi-\nperiodic behavior in the dissipative model, it is disregarded\nand a different initial condition is then considered. In order\nto characterize the deviations around the average value, Fig.\n3\u0001a\u0002 shows the behavior of the average transient iteration\nnumber n¯x, i.e., the number of iterations needed to bring the\nparticle to rest, as a function of the number of initial condi-\ntions. Figure 3\u0001b\u0002 illustrates the behavior of the average tran-\nsient n¯x as a function of the strength of the drag coefficient.\nFIG. 1. \u0001Color online\u0002 \u0001a\u0002 The velocity V\u0001n\u0002 for \u0006=1\u000b10−3, \u0005\n=1\u000b10−5 for V0=1 and \u00070=0. The inset shows in more detail how\nV varies with n near to the KAM island of order i=1. \u0001b\u0002 Details of\na trajectory passing near to a KAM island, plotting V\u0001n\u0002 as a func-\ntion of the phase \u0007.\nFIG. 2. \u0001Color online\u0002 Stable regions in the velocity V vs phase\n\u0007 phase space for the dissipative SFUM. The parameters used were\n\u0006=1\u000b10−3 and \u0005=1\u000b10−5. The period-one stable fixed points are\nrepresented by the dots and classified by the label i \u0001i\n=1,2 ,3 . . .10\u0002, as shown.\nFIG. 3. \u0001Color online\u0002 \u0001a\u0002 Behavior of the iteration number n¯x as\na function of the ensemble of initial conditions for the low energy\nregion using \u0005=2\u000b10−7 in the simplified version of the dissipative\nmodel. \u0001b\u0002 The iteration number for the relaxation transient as a\nfunction of the parameter \u0005. The error bars represent the standard\ndeviation for the ensemble of initial conditions used.\nDISSIPATIVE AREA-PRESERVING ONE-DIMENSIONAL¼ PHYSICAL REVIEW E 73, 066223 \u00012006\u0002\n066223-3\nThe error bars represent the standard deviation of the tran-\nsient averaged over a set of m=107 different initial condi-\ntions \u0003horizontal axis of Fig. 3\u0001a\u0002\u0004. These results allow us to\ndescribe the transient as\nn¯x \u000e \u0005\n\u000f\n, \u00014\u0002\nwhere a power law fit gives us the exponent \u000f=−0.973\u00015\u0002\n\r−1. It is interesting to observe that Eq. \u00014\u0002 diverges in the\nlimit \u0005→0. We can still conclude that in this limit of \u0005 and\nas a consequence of the divergence of n¯x, the dynamics for\nsuch a region becomes chaotic. It is also interesting to em-\nphasize that all the invariant spanning curves are now stable\nin the limit \u0005→0; a result that, in a sense, establishes the\nlimits on the extent of the chaotic sea.\nWe now consider why the area-preserving property is not\napplicable over the whole phase space of the dissipative\nSFUM. We have shown that, for high energy, the velocity of\nthe particle decreases linearly as the iteration number\nevolves, necessarily bringing the particle to the region where\nthe chaotic transient arises. As already discussed, however,\nthe particle may assume very low velocities within this re-\ngime. The equations defining the map \u0003see Eq. \u00011\u0002\u0004 are re-\nstricted \u0001being defined for real numbers\u0002 to the range Vn\n\t2\u0005. If the particle acquires a velocity Vn\n2\u0005, the phase\n\u0007n+1 is not defined as a real number, corresponding to it no\nlonger having sufficient energy for another collision. As an\nimmediate consequence, the dynamics of the system is over.\nWe note that the condition Vn\n2\u0005 breaks down the property\nof area preservation, because the map is then undefined in\nthis limit of Vn. Within the stable KAM islands that surround\nthe elliptic fixed points \u0001see Fig. 2\u0002, the particle’s velocity\nnever falls to Vn\n2\u0005. Once within a KAM island, for which\nthe phase \u0007 is real for all the corresponding velocities, then\ndissipation is exactly balanced by the energy gained from the\nperiodic forcing, and area preservation applies.\nLet us now address this apparent paradox. The interested\nreader will be able to find a specific example and a more\ncomplete discussion in Ref. \u000330\u0004. First we emphasize that the\ndefinition of a dissipative system is not quite so clear as it\nseems at first sight. One might say that “dissipative” implies\nthat the phase space volume is not conserved under time\nevolution. Alternatively, one might say that dissipative de-\nnotes that friction is present. In our model, however, we\nhave, by construction, a friction force present but, counterin-\ntuitively, the determinant of the Jacobian matrix is unity.\nWhy does this result not contradict the statement that there\nare no attractors in the model studied? The answer is related\nto the Poincaré recurrence theorem. This theorem, which is\nalso a consequence of the Liouville’s theorem, states that for\na bounded phase space, almost all trajectories eventually re-\nturn arbitrarily close to where they started. It is interesting to\nnote that this result is true regardless of whether the trajec-\ntory under consideration is regular or chaotic. Our results for\nhigh energy show convincingly that the particle velocity de-\ncreases linearly as the iteration number increases. Eventually\nthe particle enters the corresponding region of the chaotic sea\n\u0001for the nondissipative case\u0002 and we observe that V→0.\nThus, it is easy to conclude that the time for the next colli-\nsion t→\u0010, so that the phase space is unbounded. We also\ncomment that in the present dissipative version there is no\nmechanism for accelerating the particle to high energy \u0001say\nhigher than Vc\u000e2\u000f\u0006 \/0.97. . ., see Ref. \u00034\u0004\u0002. Thus the\nPoincaré recurrence argument is not satisfied.\nFinally, we point out that the coexistence of conservative\nand dissipative behavior has also been observed in a laser\n\u000331\u0004, where it was attributed to the occurrence of a\nsymmetry-breaking bifurcation, leading to the appearance of\na structurally stable homoclinic cycle.\nIII. CONCLUSIONS\nAlthough one might have expected dissipation to destroy\nall the mixed phase space structure present in the nondissi-\npative Fermi-Ulam accelerator model, we have found that\nthis is not the case. Dissipation does indeed destroy the in-\nvariant spanning curves and chaotic sea characterizing the\nnondissipative model. Yet its KAM islands can survive the\nperturbation. Counterintuitively, therefore, regions of phase\nspace exist where the dissipative SFUM exhibits the property\nof area-preservation.\nACKNOWLEDGMENTS\nE.D.L. is grateful to CNPq and FAPESP, Brazilian agen-\ncies; P.V.E.McC. gratefully acknowledges support from the\nEngineering and Physical Sciences Research Council \u0001UK\u0002.\n\u00031\u0004 E. Fermi, Phys. Rev. 75, 1169 \u00011949\u0002.\n\u00032\u0004 A. J. Lichtenberg and M. A. Lieberman, Regular and Chaotic\nDynamics, Appl. Math. Sci. 38 \u0001Springer Verlag, New York,\n1992\u0002.\n\u00033\u0004 M. A. Lieberman and A. J. Lichtenberg, Phys. Rev. A 5, 1852\n\u00011972\u0002.\n\u00034\u0004 E. D. Leonel, J. K. L. da Silva, and S. O. Kamphorst, Physica\nA 331, 435 \u00012004\u0002.\n\u00035\u0004 E. D. Leonel, P. V. E. McClintock, and J. K. da Silva, Phys.\nRev. Lett. 93, 014101 \u00012004\u0002.\n\u00036\u0004 D. G. Ladeira and J. K. L. da Silva, Phys. Rev. E 73, 026201\n\u00012006\u0002.\n\u00037\u0004 L. D. Pustylnikov, Trudy Moskov. Mat. Obsc. 34, 1 \u00011977\u0002.\n\u00038\u0004 A. J. Lichtenberg, M. A. Lieberman, and R. H. Cohen, Physica\nD 1, 291 \u00011980\u0002.\n\u00039\u0004 E. D. Leonel and P. V. E. McClintock, J. Phys. A 38, 823\n\u00012005\u0002.\n\u000310\u0004 G. Karner, J. Stat. Phys. 77, 867 \u00011994\u0002.\n\u000311\u0004 S. T. Dembinski, A. J. Makowski, and P. Peplowski, Phys.\nRev. Lett. 70, 1093 \u00011993\u0002.\n\u000312\u0004 J. V. José and R. Cordery, Phys. Rev. Lett. 56, 290 \u00011986\u0002.\n\u000313\u0004 P. Seba, Phys. Rev. A 41, 2306 \u00011990\u0002.\nEDSON D. LEONEL AND P. V. E. MCCLINTOCK PHYSICAL REVIEW E 73, 066223 \u00012006\u0002\n066223-4\n\u000314\u0004 S. R. Jain, Phys. Rev. Lett. 70, 3553 \u00011993\u0002.\n\u000315\u0004 A. Mehta and J. M. Luck, Phys. Rev. Lett. 65, 393 \u00011990\u0002.\n\u000316\u0004 J. P. Holmes, J. Sound Vib. 84, 173 \u00011982\u0002.\n\u000317\u0004 J. M. Luck and A. Mehta, Phys. Rev. E 48, 3988 \u00011993\u0002.\n\u000318\u0004 K. Y. Tsang and M. A. Lieberman, Physica D 21, 401 \u00011986\u0002.\n\u000319\u0004 M. A. Lieberman and K. Y. Tsang, Phys. Rev. Lett. 55, 908\n\u00011985\u0002.\n\u000320\u0004 See Ref. \u00033\u0004, Chap. 8, Sec. 8.1a.\n\u000321\u0004 R. M. Everson, Physica D 19, 355 \u00011986\u0002.\n\u000322\u0004 E. D. Leonel and P. V. E. McClintock, J. Phys. A 38, L425\n\u00012005\u0002.\n\u000323\u0004 M. A. Naylor, P. Sánchez, and M. R. Swift, Phys. Rev. E 66,\n057201 \u00012002\u0002.\n\u000324\u0004 G. A. Luna-Acosta, Phys. Rev. A 42, 7155 \u00011990\u0002.\n\u000325\u0004 Z. J. Kowalik, M. Franaszek, and P. Pieranski, Phys. Rev. A\n37, 4016 \u00011988\u0002.\n\u000326\u0004 S. Warr, W. Cooke, R. C. Ball, and J. M. Huntley, Physica A\n231, 551 \u00011996\u0002.\n\u000327\u0004 S. Warr and J. M. Huntley, Phys. Rev. E 52, 5596 \u00011995\u0002.\n\u000328\u0004 M. Robnik and M. V. Berry, J. Phys. A 18, 1361 \u00011985\u0002.\n\u000329\u0004 K. Y. Tsang and K. L. Ngai, Phys. Rev. E 56, R17 \u00011997\u0002.\n\u000330\u0004 G. J. Sussman, J. Wisdom, and M. E. Mayer, Structure and\nInterpretation of Classical Mechanics \u0001MIT Press, Cambridge,\n2001\u0002.\n\u000331\u0004 A. Politi, G. L. Oppo, and R. Badii, Phys. Rev. A 33, 4055\n\u00011986\u0002.\nDISSIPATIVE AREA-PRESERVING ONE-DIMENSIONAL¼ PHYSICAL REVIEW E 73, 066223 \u00012006\u0002\n066223-5\n"}