{"doi":"10.1109\/TEC.2006.875783","coreId":"66363","oai":"oai:dro.dur.ac.uk.OAI2:1751","identifiers":["oai:dro.dur.ac.uk.OAI2:1751","10.1109\/TEC.2006.875783"],"title":"Control of a doubly fed induction generator in a wind turbine during grid fault ride-through.","authors":["Xiang,  D.","Ran,  L.","Tavner,  P. J.","Yang,  S."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-09","abstract":"This paper analyzes the ability of a doubly fed induction generator (DFIG) in a wind turbine to ride through a grid fault and the limitations to its performance. The fundamental difficulty for the DFIG in ride-through is the electromotive force (EMF) induced in the machine rotor during the fault, which depends on the dc and negative sequence components in the stator-flux linkage and the rotor speed. The investigation develops a control method to increase the probability of successful grid fault ride-through, given the current and voltage capabilities of the rotor-side converter. A time-domain computer simulation model is developed and laboratory experiments are conducted to verify the model and a control method is proposed. Case studies are then performed on a representatively sized system to define the feasibility regions of successful ride-through for different types of grid faults","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66363.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1751\/1\/1751.pdf","pdfHashValue":"cce894ccea610df11ab7442335d9fd40d1d9d181","publisher":"IEEE","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1751<\/identifier><datestamp>\n      2011-08-09T16:07:06Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Control of a doubly fed induction generator in a wind turbine during grid fault ride-through.<\/dc:title><dc:creator>\n        Xiang,  D.<\/dc:creator><dc:creator>\n        Ran,  L.<\/dc:creator><dc:creator>\n        Tavner,  P. J.<\/dc:creator><dc:creator>\n        Yang,  S.<\/dc:creator><dc:description>\n        This paper analyzes the ability of a doubly fed induction generator (DFIG) in a wind turbine to ride through a grid fault and the limitations to its performance. The fundamental difficulty for the DFIG in ride-through is the electromotive force (EMF) induced in the machine rotor during the fault, which depends on the dc and negative sequence components in the stator-flux linkage and the rotor speed. The investigation develops a control method to increase the probability of successful grid fault ride-through, given the current and voltage capabilities of the rotor-side converter. A time-domain computer simulation model is developed and laboratory experiments are conducted to verify the model and a control method is proposed. Case studies are then performed on a representatively sized system to define the feasibility regions of successful ride-through for different types of grid faults. <\/dc:description><dc:subject>\n        Current control<\/dc:subject><dc:subject>\n         Doubly fed induction generator (DFIG)<\/dc:subject><dc:subject>\n         Flux linkage<\/dc:subject><dc:subject>\n         Grid fault<\/dc:subject><dc:subject>\n         Power converter<\/dc:subject><dc:subject>\n         Safe operating area (SOA)<\/dc:subject><dc:subject>\n         Wind energy.<\/dc:subject><dc:publisher>\n        IEEE<\/dc:publisher><dc:source>\n        IEEE transactions on energy conversion, 2006, Vol.21(3), pp.652-662 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2006-09<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1751<\/dc:identifier><dc:identifier>\n        issn:0885-8969<\/dc:identifier><dc:identifier>\n        doi:10.1109\/TEC.2006.875783<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1751\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1109\/TEC.2006.875783<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1751\/1\/1751.pdf<\/dc:identifier><dc:rights>\n        ©2006 IEEE. Personal use of this material is permitted. However, permission to reprint\/republish this material for advertising or promotional purposes or for creating new collective works for resale or redistribution to servers or lists, or to reuse any copyrighted component of this work in other works must be obtained from the IEEE.\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0885-8969","issn:0885-8969"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Current control","Doubly fed induction generator (DFIG)","Flux linkage","Grid fault","Power converter","Safe operating area (SOA)","Wind energy."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n28 May 2008\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nXiang, D. and Ran, L. and Tavner, P. J. and Yang, S. (2006) ’Control of a doubly fed induction generator in a\nwind turbine during grid fault ride-through.’, IEEE transactions on energy conversion., 21 (3). pp. 652-662.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1109\/TEC.2006.875783\nPublisher’s copyright statement:\n2006 IEEE. Personal use of this material is permitted. However, permission to reprint\/republish this material for\nadvertising or promotional purposes or for creating new collective works for resale or redistribution to servers or lists,\nor to reuse any copyrighted component of this work in other works must be obtained from the IEEE.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 3042 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n \nDeposited in DRO: \n28 May 2008. \n \nVersion of attached file: \nPublished. \n \nPeer-review status of attached file: \nPeer-reviewed. \n \nCitation for published item: \nXiang, D. and Ran, L. and Tavner, P. J. and Yang, S. (2006) 'Control of a doubly fed \ninduction generator in a wind turbine during grid fault ride-through.' , IEEE transactions \non energy conversion., 21 (3), pp. 652-662. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1109\/TEC.2006.875783\n \n652 IEEE TRANSACTIONS ON ENERGY CONVERSION, VOL. 21, NO. 3, SEPTEMBER 2006\nControl of a Doubly Fed Induction Generator in a\nWind Turbine During Grid Fault Ride-Through\nDawei Xiang, Li Ran, Member, IEEE, Peter J. Tavner, and Shunchang Yang\nAbstract—This paper analyzes the ability of a doubly fed induc-\ntion generator (DFIG) in a wind turbine to ride through a grid fault\nand the limitations to its performance. The fundamental difficulty\nfor the DFIG in ride-through is the electromotive force (EMF) in-\nduced in the machine rotor during the fault, which depends on\nthe dc and negative sequence components in the stator-flux linkage\nand the rotor speed. The investigation develops a control method\nto increase the probability of successful grid fault ride-through,\ngiven the current and voltage capabilities of the rotor-side con-\nverter. A time-domain computer simulation model is developed\nand laboratory experiments are conducted to verify the model and\na control method is proposed. Case studies are then performed on\na representatively sized system to define the feasibility regions of\nsuccessful ride-through for different types of grid faults.\nIndex Terms—Current control, doubly fed induction generator\n(DFIG), flux linkage, grid fault, power converter, safe operating\narea (SOA), wind energy.\nI. INTRODUCTION\nTHE doubly fed induction generator (DFIG) is a commonconfiguration for large, variable-speed wind turbines that\nare connected to a grid [1]. On detecting a grid fault, the gen-\nerator unit is usually disconnected to protect the vulnerable\nrotor-side converter. In the recent years, this has been achieved\nby applying a crowbar short circuit to the rotor slip ring termi-\nnals. This was accepted when wind power represented only an\ninsignificant part of the generation in the system. As the pene-\ntration of wind power continues to increase, more wind turbines\nare required to remain connected during grid faults, i.e., to ride\nthrough the faults, and contribute to system stability after fault\nclearance [2]. For instance, the Grid Code of Scottish Power\nand Scottish Hydro-Electric [3] states that all wind turbines\nmust remain connected in the event of any short circuit in the\nhigh-voltage transmission network. Grid codes in other parts\nof the world may be more stringent, demanding ride-through\nof faults at the generator terminal. For the reasons that will be\ndiscussed later, grid fault ride-through control is difficult for the\nDFIG and is a major challenge for wind turbine manufacturers.\nResearchers are addressing the issue from several points of\nview. For instance, the study described in [4] suggests improving\nthe generator terminal voltage during a grid fault using shunt\nManuscript received July 15, 2005. The work of D. Xiang was supported by\na visiting scholarship from Chongqing University, Chongqing, China. Paper no.\nTEC-00246-2005.\nD. Xiang and S. Yang are with the Department of Electrical Engineering,\nChongqing University, Chongqing 400044, China. (e-mail: xdw_cqu@hotmail.\ncom; shunchangyang@yahoo.com).\nL. Ran and P. J. Tavner are with the School of Engineering, University\nof Durham, Durham DH1 3LE, U.K. (e-mail: li.ran@durham.ac.uk; Peter.\nTavner@durham.ac.uk).\nDigital Object Identifier 10.1109\/TEC.2006.875783\nreactive power compensation. Optimizing the parameters of the\ncurrent control loops in the rotor-side converter is proposed\nin [5]. The use of the crowbar is evaluated in [6]. The inherent\ndifficulty of ride-through control during a symmetrical grid fault\nis explained in [7].\nIt is usually thought that a fast semiconductor converter can\nlimit the current fed to a grid fault immediately, a merit that is\nfrequently attributed to HVDC systems [8], [9]. At first glance,\nit seems straightforward to apply the same principle to a DFIG,\nso that the rotor-side converter current could be constrained\nwhile the protection operates on impedance rather than over-\ncurrent relays. However, in a DFIG wind turbine arrangement,\nthe converter is on the rotor side of the generator. There are\nknown cases where a DFIG rotor converter operated this way\nexperienced over-voltages and failed to limit the fault current,\nleading to the destruction of the converter. This paper extends\nthe initial study presented in [7] and proposes a new control\napproach without additional hardware but based on the insight\ngained from analysis and modeling backed up by experiment.\nSection II of the paper reviews the generator model. The\nbehavior of the DFIG system during a grid fault is analyzed.\nIt is shown that the fault current depends on the internal state\nof the machine as well as the voltage applied on the rotor side.\nSection III derives the control algorithm in order to assist the\nsystem to ride through the grid fault, which takes into account the\nmachine’s internal state. Section IV verifies the proposed control\nmethod and validates the simulation model on a laboratory test\nrig. The validated model is used in Section V to evaluate the\nsystem performance with respect to the fault type and prefault\ncondition. The operating region for successful ride-through for a\ntypical 2-MW DFIG system is then defined for each fault type in\nterms of the severity of the fault and the prefault machine speed.\nII. DFIG DURING GRID FAULT\nFig. 1 is the block diagram of a DFIG wind turbine system.\nThe generator has a three-phase wound rotor supplied, via slip\nrings, from a four-quadrant, pulse width modulation (PWM)\nconverter with voltage of controllable amplitude and frequency.\nThe generator can operate at variable speed, while the stator\nremains at a constant grid frequency. The machine usually op-\nerates in the vector-control mode orientated to the stator-flux\nlinkage, which can be calculated as follows using the measured\nvoltage and current [10]:\nψsabc =\n∫\n(usabc −Rsisabc)dt (1)\nwhere ψsabc is the space vector of the flux linkages of the three-\nphase stator windings. usabc and isabc are the corresponding\n0885-8969\/$20.00 © 2006 IEEE\nXIANG et al.: CONTROL OF A DFIG IN A WIND TURBINE 653\nFig. 1. Configuration of the DFIG wind turbine system.\nvoltage and current space vectors. The positive current direc-\ntions are defined as feeding the generator. Rs is the stator resis-\ntance. Generally, “s” and “r” in subscript distinguish quantities\nor parameters on the stator or rotor side.\nThe stator- and rotor-flux linkages are related to the currents\nas\nψsabc = (Lls + Lm)isabc + Lmirabc (2)\nψrabc = Lmisabc + (Llr + Lm)irabc (3)\nwhere Lls and Llr are the leakage inductances, and Lm is\nthe magnetizing inductance. During normal operation, both the\nstator- and rotor-flux linkages rotate at synchronous speed with\nrespect to the stator.\nIn the rotor reference frame, the voltage equation of the rotor\nwindings is\nurabc = Rrirabc +\ndψrabc\ndt\n. (4)\nThe rotor-flux linkage can be expressed in terms of stator-flux\nlinkage and rotor current according to (2) and (3) [10], [11].\nψrabc =\nLm\nLs\nψsabc +\nLsLr − L2m\nLs\nirabc (5)\nwhere Ls = Lls + Lm and Lr = Llr + Lm. All the quantities\nare in per unit (p.u.).\nThe equivalent circuit of the DFIG machine viewed from the\nrotor side, corresponding to (4) and (5), is shown in Fig. 2. The\nrotor current is jointly decided by the injected rotor voltage and\nthe induced electromotive force (EMF) or the derivative of the\nstator-flux linkage with respect to time. In normal operation,\nthe space vector ψsabc rotates at slip speed sω0, with respect to\nthe rotor winding, where s is the slip and ω0 is the synchronous\nspeed. Therefore, ψsabc\/dt is jsω0ψsabc . This is predominantly\nbalanced by the rotor voltage of the same frequency and\ndetermines the voltage rating of the rotor-side converter, with\nsome margin. Now consider a three-phase fault on the grid\nside, which brings the stator terminal voltage down to zero. In\nsuch an extreme case, the space vector of the stator-flux linkage\nψsabc , will “freeze” and stop rotating with respect to the stator\nwinding, as implied by (1). As a result, ψsabc rotates at speed\nωr with respect to the rotor winding. The induced EMF, dψsabc ,\nwill then become jωrψsabc , where ωr is the rotor speed in p.u.\nFig. 2. Rotor-side equivalent circuit.\nFig. 3. Simulation results of a 2-MW DFIG during a grid fault.\na mismatch with the rotor supply voltage is introduced in terms\nof both amplitude and frequency. Current components at two\nfrequencies, sω0 and ωr = (1− s)ω0 are produced. Because\nthe leakage inductance and rotor winding resistance are usually\nsmall, the rotor current, which is the superposition of the two\ncomponents, is consequently large. With the effect of the stator\nresistance ψsabc will gradually decay, attenuating the transient\nfault current component at frequency ωr ; this is effectively the\ntransient behavior of the rotor.\nNote that the induced EMF viewed from the rotor can be\nrelatively large during the fault because the rotor speed may\nbe greater than the prefault slip speed. For instance, consider\nthat the DFIG is initially running at the maximum speed, which\nis typically 30% above the synchronous speed [1]. The pre-\nfault slip is s = −0.3 p.u, while ωr = (1− s)ω0 = 1.3ω0 Cor-\nrespondingly, the induced EMF increases by 333% in amplitude\nfor the fault scenario described earlier, while the frequency also\nchanges.\nThe analysis suggests that the difficulty of the rotor-side con-\nverter in constraining the current during a grid fault is associated\nwith the induced EMF depending on the stator-flux linkage and\nspeed. This is a major difference when compared with an in-\nverter connected directly to a passive grid network. Fig. 3 shows\nthe simulated fault current for a 2-MW DFIG system detailed\nin Appendix I. The machine initially operates with full load and\nis at 30% super synchronous speed. A three-phase grid fault\nbrings the generator terminal voltage down to 0.3 p.u. The con-\ntrol implemented in the simulation model is the vector-control\nalgorithm for terminal voltage regulation and the maximum ac-\ntive power tracking [12]. The rotor-side converter is represented\n654 IEEE TRANSACTIONS ON ENERGY CONVERSION, VOL. 21, NO. 3, SEPTEMBER 2006\nas controlled voltage sources. No additional action or control\nlimit is included to constrain the fault current. It is observed\nthat the rotor current increases from about 1.0 to 7.2 p.u. It is\nalso evident that the current consists of components at different\nfrequencies.\nThe analysis shows that a large rotor voltage would be re-\nquired for the converter current to be constrained.\nFor an asymmetrical grid fault, a voltage component of neg-\native phase sequence will appear at the generator terminal. This\nwill cause a negative sequence component in the stator-flux\nlinkage in addition to the dc component described earlier with\nrespect to the stator. The rotor winding rotates with respect to\nthe negative sequence flux component at speed ω0 + ωr . The\ncorresponding EMF induced depends on the terminal voltage\nand the prefault machine speed. The consequence can also be\nexplained using Fig. 2.\nIII. CONTROL FOR GRID FAULT RIDE-THROUGH\nThere are different interpretations to the requirements of grid\nfault ride-through. Ultimately, the DFIG is desired to act like\na synchronous machine capable of providing fault current for\nprotection relays and voltage support [6]. It is difficult to pro-\nvide the current without increasing the converter rating. This\nstudy views the challenge of ride-through as constraining the\nfault current in the presence of change of the induced EMF in\nthe machine. No additional hardware equipment, e.g., the crow-\nbar, is to be used. In addition, the transient associated with the\nclearance after the fault is also to be dealt with, as the generator\nreturns to the normal control.\nThe rotor-side converter usually employs the IGBT as the\nsemiconductor switching device. Its continuous current rating\nis determined by the steady-state load, while the over load ca-\npability could be exploited during transient. In theory, the max-\nimum current switched by the device can be the peak pulse\nrating, as long as the junction temperature reached in the IGBT\nis permissible and the V –I switching trajectory is within the\nsafe operating area (SOA) [13]. The pulse current rating of\nan IGBT is typically 100% higher than the continuous current\nrating. Therefore, the control objective of this study is to con-\nstrain the instantaneous rotor current below 2.0 p.u., while the\nconverter dc-link voltage is also maintained below the device’s\nvoltage rating. In practice, the PWM switching frequency could\nbe temporarily reduced to prevent excessive switching losses\ndue to increased device current and voltage during grid fault\nride-through control.\nA logical conclusion from the analysis in Section II is that\nduring fault the voltage applied from the rotor converter to the\nrotor winding should be used to weaken the effect of the dc\nand negative sequence components in the stator-flux linkage.\nAccording to either (4) or Fig. 2, the effect is actually expressed\nthrough the corresponding flux components linking the rotor\nside. The total stator-flux linkage is dictated by the stator volt-\nage. It is desirable to orient the rotor current such that it contains\ncomponents that oppose the rotor flux linkage dc and negative\nsequence components. This is shown in Fig. 4, where subscripts\n“1,” “2,” and “0” indicate the positive, negative, and zero (dc)\nFig. 4. Control of the rotor current.\nsequence components in the flux linkage or current space vec-\ntors, respectively. The converter voltage on the rotor side can\nbe used for such an objective and the rotor current is to be kept\nto an acceptable limit. Whether this is achievable depends on\nhow strongly the voltage can be applied, as compared to the\ninternal induced EMF. The whole scenario is then dependent on\nthe severity of the fault and the prefault condition of the DFIG\nsystem. This will be described later as the feasibility region for\nsuccessful ride-through. The control approach adopted in this\nstudy aims to enlarge the feasibility region. Equation (5) can be\napproximated as follows:\nψrabc =\nLm\nLs\nψsabc +\nLsLr − L2m\nLs\nirabc\n≈ ψsabc + (Lsl + Llr)irabc . (6)\nEquation (6) shows that the rotor current can be controlled\nto counter the undesired components in the stator-flux linkage.\nIt should also be noticed that if the DFIG machine is designed\nwith increased rotor or stator leakage inductance, it will increase\nthe effectiveness of rotor current control and hence the ability\nto ride through grid faults. This is similar to the fact that a syn-\nchronous machine with increased winding leakage inductance\nmay improve its transient behavior.\nFig. 5 shows the proposed controller including three parts:\n1) stator-flux linkage estimation and decomposition; 2) calcula-\ntion of rotor current reference; and 3) implementation of rotor\ncurrent control. Fig. 6 shows the algorithm to decompose the\nstator-flux linkage vector into positive, negative, and zero se-\nquence (dc) components. The stator voltage and current are used\nto calculate the total flux linkage as shown in (1). A second-order\nband-pass filter, whose gain and phase response are set as unity\nand zero degree, respectively, at the nominal stator frequency\n(50 Hz), is used to remove the dc component and the effect of\nswitching harmonics. The output is ac including the positive and\nnegative sequence components with respect to the stator wind-\ning. The dc component can therefore be calculated as follows:\nψ0 sabc = ψsabc − ψac sabc . (7)\nIt should be noted that in Fig. 6, the derivative operation has\nthe effect of phase shifting the positive and negative sequence\nflux linkage components by π\/2 and −π\/2 (rad), respectively.\nThe amplitude is not affected if all quantities are expressed in per\nXIANG et al.: CONTROL OF A DFIG IN A WIND TURBINE 655\nFig. 5. Control block diagram.\nFig. 6. Observation of components in stator-flux linkage.\nunit and the system operates at the base or nominal frequency on\nthe stator side. This is used to separate the positive and negative\nsequence components ψ1 sabc and ψ2 sabc\n1\n2\n[\nψac sabc − (−j)× dψsabc\ndt\n]\n=\n1\n2\n[\n(ψ1 sabc + ψ2 sabc)− (−j)\n× d\ndt\n(ψ0 sabc + ψ1 sabc + ψ2 sabc)\n]\n=\n1\n2\n[(ψ1 sabc + ψ2 sabc)\n− (−j)× (jψ1 sabc − jψ2 sabc)]\n= ψ2 sabc (8)\n1\n2\n[\nψac sabc + (−j)× dψsabc\ndt\n]\n=\n1\n2\n[\n(ψ1 sabc + ψ2 sabc) + (−j)\n× d\ndt\n(ψ0 sabc + ψ1 sabc + ψ2 sabc)\n]\nFig. 7. Observation of components in stator-flux linkage—Test of algorithm\nusing simulation.\n=\n1\n2\n[(ψ1 sabc + ψ2 sabc) + (−j)\n× (jψ1 sabc − jψ2 sabc)]\n= ψ1 sabc . (9)\nThe proposed algorithm was demonstrated using simulation.\nA single-phase-to-ground fault on the stator side is simulated for\nthe 2-MW DFIG system. Components in the stator-flux linkage,\ncalculated using the above algorithm, are compared with those\ndirectly measured in the machine model. The comparison is\nshown in Fig. 7. The angles of the flux-linkage components\nare referenced to the magnetic axis of stator phase “a.” Close\nagreement is observed with the estimation catching up the actual\nresponse in about a quarter of a 50 Hz cycle. This is because\nthe derivative information has been taken into account in the\nflux-linkage observation algorithm. Control action can thus take\nplace before the rotor current increases to an unacceptable level.\nFast flux-linkage observation and rotor current response are\nessential to the proposed control method.\nWhen the rotor current is used to cancel both the dc and the\nnegative sequence components in the stator-flux linkage, it is\nnecessary to coordinate the two aspects of the objective. The\nrotor current and voltage must always be within the SOA of\nthe switching device. A series of simulations were performed\nto determine the appropriate sharing of the converter current\n656 IEEE TRANSACTIONS ON ENERGY CONVERSION, VOL. 21, NO. 3, SEPTEMBER 2006\nFig. 8. Sharing of converter current capability.\ncapability. It was recommended to cancel 60% of the negative se-\nquence component in the stator-flux linkage. For a typical DFIG\nsystem, this would be possible for all faults that could occur in\nthe transmission network. The reminder of the current capability\nis used to deal with the dc component in the stator-flux linkage.\nBecause the current components are at different frequencies, the\nmaximum instantaneous current of the converter is the algebraic\nsummation of the peak values, which must be less than 2.0 p.u. in\nthis study. Fig. 8 shows the scheme of current capability sharing.\nThe reference rotor current is consequently generated. The per\nunit limit of the dc current component is dynamically calculated\ndepending on the negative sequence current compensation\nImax0 rabc = 2.0−\n0.6\nLls + Llr\n|ψ2 sabc | . (10)\nThe implementation of the rotor current control is through a\nproportionalalgorithm in a stationary d–q reference frame fixed\nto the stator, as shown in Fig. 5. Coordinate transformation is\nnecessary to determine the reference rotor phase voltages, taking\ninto account the rotor angle.\nIV. EXPERIMENTAL VERIFICATION\nFig. 9 shows the DFIG test rig set up to verify the proposed\ncontrol method and the model used for full-scale system sim-\nulation. A 30-kW wound rotor machine is driven by a vector-\ncontrolled induction motor. Details of the test DFIG machine\nare given in Appendix III. The rotor windings of the DFIG are\nfed from a PWM inverter that is controlled by an xPC TargetBox\nreal-time system. The stator and rotor currents, stator voltages\nand the rotor position of the DFIG machine are measured and\nthe control algorithm described in Section III is implemented in\nSimulink, which generates the code to be downloaded into the\nxPC TargetBox. The fault occurrence is detected from a sudden\nchange of the stator voltage, activating the fault ride-through\ncontrol.\nFig. 10 shows the control response of the DFIG system during\nnormal operation when subjected to sudden change of first real\nFig. 9. Test rig setup.\nFig. 10. Experimental results on a 30-kW DFIG control during normal oper-\nation.\nand then real and reactive power. The speed is fixed at 1950\nr\/min, corresponding to -0.3 p.u. slip for a four-pole machine.\nThe performance of fault ride-through control is verified with\nthe DFIG initially operating with no load. The stator windings\nare initially open circuited and then a three-phase short-circuit\nfault is applied to the stator via a contactor. The unloaded ma-\nchine is excited from the rotor side where the current determines\nthe stator-flux linkage level. This is slightly different from the\nalgorithm shown in (1) but a fault directly applied to the mains\nsupply can be avoided. At the moment when the fault is applied\nto the stator, the stator-flux linkage is spontaneously trapped in\nthe machine, giving rise to a dc component. The rotor windings\nthen cut the trapped flux at the prefault speed, 1950 r\/min in\nthis experiment. The control objective is to constrain the rotor\ncurrent in the presence of the induced EMF. The experiment\nsetup is thus adequate to verify the proposed control method.\nXIANG et al.: CONTROL OF A DFIG IN A WIND TURBINE 657\nFig. 11. Experimental results on a 30-kW DFIG with ride-through control.\nUpon detecting the fault, the rotor current is controlled to\noppose the dc component of the stator-flux linkage. The latter\nwill decay due to the winding resistance. It can be shown that,\nwithout control action, it decays exponentially with the stator\nshort-circuit time constant [14]\nτ ′s =\n[\n1− L\n2\nm\n(L′ls + Lm)(L\n′\nlr + Lm)\n]\nL′ls + Lm\nR′s\n(11)\nwhere L′ls and R′s include the contribution from the grid. The dc\ncomponent of the stator-flux linkage decays more rapidly under\ncontrol. In practice, the control gains should be enough for the\nflux to decay to nearly zero by the time when the fault is cleared.\nThe compensating current component should decay correspond-\ningly. In the experiment, the current decrease is represented in\nthe control algorithm using a simple linear approximation.\nFig. 11 shows a set of experimental results where the decrease\nof the reference rotor current takes place in 55 ms. The initial\ncompensation level is 2.0. p.u. in terms of the rotor current. The\nprefault rotor excitation level is set so that the stator voltage is\ninitially 0.7 p.u. Fig. 11(a) shows the three-phase PWM mod-\nulation indices, which are to be compared with the triangular\ncarrier between [-1, 1]. It is clear that overmodulation is required\nto increase the inverter output voltage while the dc link in this\nexperiment is kept constant. Fig. 11(b) shows the response of\nthe rotor current in the d–q reference frame where the d-axis\ncoincides with stator phase “a” and the q-axis leads the d-axis\nby 90◦. The small steady-state error is due to the proportional\ncontrol and cross coupling between the two axes [15], which is\nnot compensated in the study as the control is only for a short pe-\nriod of time. A small steady-state error is considered acceptable\nin this study. The three-phase rotor currents are also directly\nmeasured as shown in Fig. 11(c). While the envelope of the\nrotor current follows the desired profile, it is observed that the\nfrequency changes from the prefault slip frequency (-0.3 p.u.) to\na higher value (1.3 p.u.). Finally, Fig. 11(d) shows the measured\nresponse of the stator current. In this particular case, the stator\ncurrent contains only the dc component during the fault.\nFig. 12 shows the simulation results corresponding to the ex-\nperimental system, which indicates close agreement with the test\nalthough the fault occurs at a different phase angle on the wave-\nforms. The experiment therefore verifies the simulation model,\nwhich can then be confidently used in full-scale system studies.\nIn both the experimental and the simulation results, the\nconverter or rotor current is successfully constrained in 2.0 p.u.\nNote that the base voltage and current in Appendix III are\npurposely reduced as compared to the machine or converter\nrating to provide a safety margin. The rotor voltage also reaches\nthe maximum that could be provided by the converter with\n658 IEEE TRANSACTIONS ON ENERGY CONVERSION, VOL. 21, NO. 3, SEPTEMBER 2006\nFig. 12. Simulation results on a 30-kW DFIG with ride-through control.\novermodulation. Further experiments showed that for the same\ncontrol setup, the current cannot be constrained if the prefault\nstator voltage is increased. This indicates that the success\nfor the DFIG to ride through the fault depends on the dc\ncomponent of the flux linkage trapped in the machine. As the\nprefault voltage increases, more flux is trapped increasing the\ninduced EMF. The experimental results showing the effect of\nthe prefault condition are summarized in Fig. 13.\nV. SIMULATION STUDIES AND FEASIBILITY REGIONS\nThe verified model is used to simulate the ride-through con-\ntrol of the DFIG in different fault scenarios with a full-size\nmachine. Fig. 14 shows a hypothetic network configuration of\nthe 2-MW DFIG used in this study. The parameters of the step-\nup transformer and the double-circuit transmission network are\ngiven in Appendix II. From the generator point of view, the\nseverity of the fault depends on the fault type and its distance\nfrom the generator terminal. Given the fault type, an index is\ndefined to indicate the severity. The smaller is the Kf , the more\nsevere is the fault.\nKf =\nZ2\nZ2 + Z3\n. (12)\nFig. 13. Feasibility region (shaded) for ride-through control obtained from\nexperiments.\nA. Three-Phase Fault\nSimulation is performed with Kf = 0.25 and the results are\nshown in Fig. 15. The maximum slip is s = ±0.3 p.u. The\nXIANG et al.: CONTROL OF A DFIG IN A WIND TURBINE 659\nFig. 14. Configuration of a simulated 2-MW DFIG system.\nFig. 15. Simulation results on a 2-MW DFIG for a three-phase fault.\nrotor voltage, approximately sω0ψrabc , is about 0.3 in the per\nunit system chosen in this study assuming 1.0 p.u. rotor flux\nlinkage [16]. This means that the maximum rotor voltage will\nbe around 0.43 p.u. with overmodulation [13].\nThe three-phase fault occurs at t = 2 s and it is assumed\nthat the faulty transmission circuit is tripped after t = 2.1 s.\nThe DFIG wind turbine initially runs at the nominal speed\n(1950 r\/min) and the generator is almost fully loaded with a\nlagging power factor of 0.867. Fig. 15 shows that at the fault\noccurrence, the rotor current is constrained in 2.0 p.u. From\nt = 2.1 s, the reduced rotor current is forced to nearly zero,\nwaiting for the fault to be cleared. As the dc component in the\nflux linkage would have reduced at this stage, it should be pos-\nsible for the rotor converter to provide the voltage needed to\nnull the current. At t = 2.15 s, the fault is cleared and the stator\nvoltage recovers. The same concept of ride-through control is\napplied to the transient of fault clearance, which also introduces\nundesired components in the stator-flux linkage. From t = 2.15\ns to t = 2.25 s, the rotor current is again controlled to weaken\nthe dc component in the stator-flux linkage. It is controlled to\nzero after t = 2.25 s. At t = 2.4 s, the ride-through control is\nthen disabled while the normal vector control is enabled. The\nair-gap torque is again developed.\nSensitivity studies were performed to investigate the factors\nthat affect the ride-through control. The following changes\nin the prefault condition will make it more difficult to ride\nthrough the grid fault: 1) increase of machine speed and 2)\nincrease of the reactive power generated by the DFIG on the\nstator side.\nFig. 16. Simulation results on a 2-MW DFIG for a phase–phase–ground fault.\nThis is consistent with the analysis on the mechanism of ride-\nthrough control since both of them increase the fault-induced\nEMF in the machine.\nB. Phase–Phase–Ground Fault\nFig. 16 shows the simulation results with a phase–phase–\nground fault in the network. Again, Kf = 0.25. The prefault\ncondition is the same as that given earlier.\nAlthough the fault type is rare in practice, this case shows the\nfeatures in an asymmetrical fault.\nCompared with the previous case of symmetrical fault, the\nmain difference is that a negative sequence component now\nexists in the stator-flux linkage during the transient. Part of the\nrotor current is utilized to cancel the effect of this component.\nHowever, as the cancellation is not complete, this leads to a\nnew component induced in the rotor voltage, whose frequency\nis 2− s p.u. As a result of the induced voltage, the maximum\ninstantaneous value of the required rotor voltage may be higher\nthan that used for the control. With interactions between the\ndc, positive-, and negative-sequence components in the flux\nlinkages, the air-gap torque also has additional harmonic content\nnot present previously.\nIn practice, an area of concern with an asymmetrical fault\nis the stabilization of the converter dc-link voltage. This was\nchecked in simulation and it was found that the grid side con-\nverter could be controlled to avoid over current in the presence\nof unbalanced grid side voltage [17]. In general, with the pro-\nposed control of the rotor-side converter, the exchange of real\npower across the converter is also attenuated during the fault.\nThe dc-link voltage can be readily stabilized for the fault sce-\nnario simulated.\nC. Feasibility Region\nRide-through control is affected by many factors; the study\nidentified that the most important ones are the prefault speed\nand the severity of the fault. The feasibility region for the DFIG\nto successfully ride through a grid fault is therefore investigated\n660 IEEE TRANSACTIONS ON ENERGY CONVERSION, VOL. 21, NO. 3, SEPTEMBER 2006\nFig. 17. Feasibility regions of grid fault ride-through (shaded) obtained from simulation.\nFig. 18. Effect of machine leakage inductance on the feasibility region.\nfor each type of fault with respect to the prefault speed and\nKf , to define the boundary that separates the situations that\nthe DFIG can handle from those that it cannot and hence must\nbe disconnected. The criterion is based on whether the rotor\ncurrent can be constrained to 2.0 p.u. with a rotor voltage that is\ninstantaneously lower than 0.43 p.u. as argued in Section V-A.\nThe feasibility regions identified are shown in Fig. 17. The\nslip covers the whole normal speed range, which is ± 30%\nXIANG et al.: CONTROL OF A DFIG IN A WIND TURBINE 661\naround the synchronous speed. The power factor on the stator\nside of the machine is fixed at 0.867 lagging. The total DFIG\npower changes with the speed and is shared between the stator\nand rotor circuits according to the slip [1]. In Fig. 17, any point\nin the shaded area means that the DFIG can ride through the\ngrid fault in the corresponding condition. For any fault type, it\nis generally more difficult to ride through the fault of the same\nseverity when the generator operates at a higher speed. When the\ngenerator operates at a speed 30% above the synchronous speed,\ni.e., -0.3 slip, it can ride through a symmetrical three-phase as\nlong as the severity index is not less than 0.25 corresponding to\nthe terminal voltage of about 0.3 p.u.\nIt is clear from Fig. 17 that the DFIG can ride through all\nsingle-phase-to-ground faults in the transmission network. This\nconclusion is however only valid for the specific system under\nstudy and the ride-through criterion described earlier. If the sys-\ntem configuration changes or the current and voltage capabilities\nof the converter are set differently, the feasibility regions for all\nfault types need to be revised.\nAs pointed out in the theoretical analysis in Section III, the\nDFIG ride-through control favors increased leakage inductance\nof the machine. Fig. 18 shows the feasibility regions as affected\nby total stator and rotor leakage inductance Ll = Lls + Llr.\nOriginally, Lls = 0.1386 p.u., Llr = 0.1493 p.u., and the to-\ntal L10 = 0.2879 p.u. Lls and Llr are proportionally scaled to\nchange the total leakage inductance. It is confirmed that in-\ncreased leakage inductance indeed increases the feasibility re-\ngions. In practice, the stator and rotor leakage inductance can\nbe increased by the choice of the slot depth, slot wedge, and the\nend winding arrangement [18]. An overall optimized solution\nshould however be reached after also considering other effects,\nfor example, the reactive power losses in the machine during\nnormal operation.\nVI. CONCLUSION\nThis paper analyzes the challenge for a DFIG wind turbine to\nride through a grid fault. It has been shown that dc and negative\nsequence components are caused in the machine flux linkages,\nresulting in a large EMF induction in the rotor circuit. A new\nmethod is proposed to control the rotor-side converter so that\nthe rotor current contains components to oppose the undesired\ncomponents in the stator-flux linkage. Fast observation of the\nstator-flux linkage components is essential to the control, which\neffectively constrains the rotor current given the voltage ca-\npability of the converter. A test rig has been set up to verify\nthe analysis and a control method has been proposed. Simula-\ntions based on a validated model provide the feasibility regions,\nin terms of fault severity and prefault speed, of successful ride-\nthrough control for a 2-MW DFIG connected to the grid through\na double-circuit network. It is shown that the maximum turbine\nspeed sets the most demanding scenario for ride-through con-\ntrol for all fault types. Increased machine leakage inductance is\nuseful to the ride-through control method proposed.\nThe study clearly shows the ability for a DFIG wind turbine\ngenerator to ride through the grid fault and the limitations to\nthat control objective. The study can be extended to evaluate the\nwind farm design, or to identify the situations where additional\nmeans of control and protection must be provided.\nAPPENDIX I\n2-MW MACHINE EQUIVALENT CIRCUIT PARAMETERS\nRatings: Sn = 2.0 MW, fn = 50 Hz, Un = 690 V (line–line,\nrms), four pole\nWinding connection (stator\/rotor): Y –Y\nTurns ratio: Ns\/Nr = 0.45\nStator resistance: Rs = 0.00488 p.u.\nStator leakage inductance: Lls = 0.1386 p.u.\nRotor resistance: Rr = 0.00549 p.u.\nRotor leakage inductance: Llr = 0.1493 p.u.\nMagnetizing inductance: Lm = 3.9527 p.u.\nH = 3.5 s\nBase capacity: Sb = 2 MVA\nBase frequency: fb = 50 Hz\nBase stator voltage (phase, peak value): Vsb = 563.4 V\nBase rotor voltage (phase, peak value): Vrb = 1252 V\nProportional gain of current control: Kp = 1.6\nAPPENDIX II\n2-MW DFIG TRANSFORMER AND TRANSMISSION NETWORK\nPARAMETERS\nSn = 2.5 MW, fn = 50 Hz\nPrimary winding: 20 kV-∆\nSecondary winding: 690 V-Y0\nShort-circuit impedance: ZT = 0.0098 + j0.09241 p.u.\nTransmission line impedance: Z1 = Z2 + Z3 = 0.01 + j0.1\np.u.\nBase capacity: Sb = 2.5 MVA\nAPPENDIX III\nTEST RIG DFIG MACHINE PARAMETERS\nRatings: Sn = 30 kW, fn = 50 Hz, Un = 400 V (line-line, rms),\nfour pole\nWinding connection (stator\/rotor): Y –Y\nTurns ratio: Ns\/Nr = 400\/380\nStator resistance: Rs = 0.0404 p.u.\nStator leakage inductance: Lls = 0.0673 p.u.\nRotor resistance: Rr = 0.0315 p.u.\nRotor leakage inductance: Llr = 0.1152 p.u.\nMagnetizing inductance: Lm = 3.8997 p.u.\nBase capacity: Sb = 2.887 kVA\nBase frequency: fb = 50 Hz\nBase stator voltage (phase, peak value): Vsb = 81.65 V\nBase rotor voltage (phase, peak value): Vrb = 77.57 V\nProportional gain of current control: Kp = 1.6\ndc-link voltage: 48 V\nACKNOWLEDGMENT\nThe authors would like to acknowledge ALSTOM Power\nConversion and FKI-DeWind for providing the test rig\nequipment. They would also like to thank several colleagues\n662 IEEE TRANSACTIONS ON ENERGY CONVERSION, VOL. 21, NO. 3, SEPTEMBER 2006\nfor the help they provided during the study, particularly\nDr. J. Bumby and Dr. P. Taylor of Durham University, Durham,\nU.K.; Dr. S. Finney of Heriot-Watt University, Edinburgh,\nU.K.; and Dr. X. Yuan of GE-Shanghai, Shanghai, China.\nREFERENCES\n[1] S. Muller, M. Deicke, and R. W. De Doncker, “Doubly fed induction\ngenerator systems for wind turbine,” IEEE Ind. Appl. Mag., vol. 8, no. 3,\npp. 26–33, May–Jun. 2002.\n[2] P. Fairley, “Steady as she blows,” IEEE Spectr., vol. 40, no. 8, pp. 35–39,\nAug. 2003.\n[3] J. L. Dallachy and I. Tait, “Guidance note for the connection of wind\nfarms,” 2.2.2, SP Transmission and Distribution, Scottish Hydro-Electric,\n2002.\n[4] O. Anaya-Lara and N. Jenkins, “Fault current contribution of DFIG wind\nturbines,” presented at the IEE Conf. Reliability of Transmission and\nDistribution Networks, London, Feb. 2005.\n[5] A. Petersson, L. Harnefors, and T. Thiringer, “Evaluation of current control\nmethods for wind turbines using doubly-fed induction machines,” IEEE\nTrans. Power Electron., vol. 20, no. 1, pp. 227–235, Jan. 2005.\n[6] G. Pannell, D. Atkinson, R. Kemsley, L. Holdsworth, P. Taylor, and\nO. Moja, “DFIG control performance under fault conditions for offshore\nwind applications,” presented at the CIRED Conf., Turin, Italy, Jun. 2005.\n[7] D. Xiang, L. Ran, P. J. Tavner, and J. R. Bumby, “Control of a doubly\nfed induction generator to ride through a grid fault,” presented at the Int.\nConf. Electric Machines (ICEM), Cracow, Poland, Sep. 2004.\n[8] N. M. Kirby, L. Xu, M. Luckett, and W. Siepmann, “HVDC transmission\nfor large offshore wind farms,” Power Eng. J., vol. 16, no. 3, pp. 135–141,\nJun. 2002.\n[9] U. Axelsson, A. Holm, C. Liljegren, K. Eriksson, and L. Weimers, “Got-\nland HVDC light transmission—world’s first commercial small scale dc\ntransmission,” presented at the CIRED Conf., Nice, France, May 1999.\n[10] P. C. Krause, Analysis of Electrical Machinery. Piscataway, NJ: IEEE\nPress, 1995, pp. 164–178.\n[11] P. Vas, Vector Control of AC Machines. Oxford, U.K.: Oxford Univ.\nPress, 1990, pp. 39–40.\n[12] R. Pena, J. Clare, and G. Asher, “Doubly fed induction generator using\nback-to-back converters and its application to variable-speed wind-energy\ngeneration,” IEE Proc.-Elect. Power Appl., vol. 143, no. 3, pp. 231–241,\nMay 1996.\n[13] N. Mohan, T. M. Undeland, and W. Robbins, Power Electronics: Con-\nverters, Applications and Design. New York: Wiley, 2003, pp. 626–637,\n208–210.\n[14] D. W. Novotny and T. A. Lipo, Vector Control and Dynamics of AC Drives.\nOxford, U.K.: Oxford Univ. Press, 1996, p. 178.\n[15] L. Ran and Y. Liao, “Sampling-induced resonance in an encoderless vector\ncontrolled induction motor drive,” IEEE Trans. Ind. Electron., vol. 51,\nno. 3, pp. 551–557, Jun. 2004.\n[16] M. S. Vicatos and J. A. Tegopoulos, “Transient state analysis of a doubly-\nfed induction generator under three phase short circuit,” IEEE Trans.\nEnergy Convers., vol. 6, no. 1, pp. 62–68, Mar. 1991.\n[17] C. Hochgraf and R. H. Lasseter, “Statcom controls for operation with\nunbalanced voltages,” IEEE Trans. Power Del., vol. 13, no. 2, pp. 538–\n544, Apr. 1998.\n[18] B. Charmers and A. C. Williamson, A. C. Machines Electromagnetics and\nDesign. Chichester, U.K.: Wiley, 1991, pp. 52–55.\nDawei Xiang was born in Sichuan, China. He re-\nceived the B.Eng. and M.Sc. degrees in electrical\nmachinery and apparatus from the School of Elec-\ntrical Engineering, Chongqing University, China, in\n1999 and 2000, respectively.\nHe was an exchange student to the Univer-\nsity of Electro-Communications, Tokyo, Japan, from\nOctober 1999 to September 2000. In 2004, he was\na Visiting Scholar at Durham University, Durham,\nU.K. Currently, he is a Lecturer of electrical machin-\nery and apparatus at the School of Electrical Engi-\nneering, Chongqing University. His research interests include the control of\ndoubly fed electrical machines as used in renewable energy systems.\nLi Ran (M’98) received the Ph.D. degree from\nChongqing University, Chongqing, China, in 1989,\nin power systems engineering.\nCurrently, he is a Lecturer in electrical power and\ncontrol at the School of Engineering, University of\nDurham, Durham, U.K. He participated in the com-\nmissioning of the Gezhouba-Shanghai HVDC system\nin China, in 1989. His research interests include appli-\ncation and control of power electronic technologies\nin power systems and renewable energy systems such\nas wave and wind energy converters.\nDr. Ran received the Stanley Gray Award—Offshore Technology, from the\nInstitute of Marine Engineers, London, U.K., in 1999, for his study on intercon-\nnection of offshore oil rigs.\nPeter J. Tavner received the M.A. degree in\nengineering sciences from Cambridge University,\nCambridge, U.K., in 1969, and the Ph.D. degree\nfrom Southampton University, Southampton, U.K.,\nin 1978.\nCurrently, he is a Professor of new and renew-\nable energy at the School of Engineering, University\nof Durham, Durham, U.K. He has held a number of\nresearch and technical positions in the industry in-\ncluding those of the Technical Director of Laurence,\nScott & Electromotors Ltd., Norfolk, U.K. and Brush\nElectrical Machines Ltd., Loughborough, U.K. He was also the Group Tech-\nnical Director of FKI-DeWind Energy Technology, Loughborough, U.K. His\nresearch interests include electrical machines for the extraction of energy from\nrenewable sources and their connection to electricity systems, electromagnetic\nanalysis, the application of condition monitoring to electrical systems, and the\nuse of converters with electrical machines.\nDr. Tavner is a receipient of the Institution Premium Award of the Institution\nof Electrical Engineers, U.K.\nShunchang Yang was born in Shanghai, China. He\nreceived the Graduation degree from the Electri-\ncal Engineering Department, Chongqing University,\nChongqing, China, in 1960.\nIn 1960, he was an Assistant Lecturer at the Elec-\ntrical Engineering Department. From 1985 to 1986,\nhe was a Visiting Scholar at Tennessee University,\nKnoxville. Since 1988, he has been a Professor at\nChongqing University. In 1991, he was at the Kiev\nInstitute of Technology, Kiev, Ukraine and the All\nSoviet Union Institute of Electrical Engineering and\nSciences, Moscow, Russia, in an international project entitled “Asynchro-\nnized Synchronous Machines and their Applications in Power Systems.” His\nresearch interests include design and control of electrical machines of new\ntopologies.\n"}