{"doi":"10.1080\/0267257X.2010.500136","coreId":"15299","oai":"oai:dro.dur.ac.uk.OAI2:7851","identifiers":["oai:dro.dur.ac.uk.OAI2:7851","10.1080\/0267257X.2010.500136"],"title":"Behaviour and climate change : consumer perceptions of responsibility.","authors":["Wells,  V.K.","Ponting,  C.","Peattie,  K."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2011","abstract":"This paper explores the under-researched notion of consumer responsibility, a potentially significant influence on consumer behaviour that marketers and policymakers may be able to harness as they attempt to respond to environmental challenges such as climate change. The paper uses data derived from a commercially motivated survey (n = 1513) to explore domestic consumption behaviours most closely associated with the issue of disruptive climate change. A measure of 'General Environmental Responsiveness' (GER) is used to test: (1) the effects of consumers both taking responsibility for their actions and placing responsibility on others for the consequences of their consumption behaviour; and (2) whether sociodemographic variables can aid the targeting of consumers by the level and type of responsibility and pro-environmental behavioural intentions expressed. The study's findings demonstrate clear, if not strong, relationships between consumer conceptions of responsibilities for causing and tackling climate change and environment-related consumer behaviour. The study's implications both challenge accepted wisdom about environment-related consumer behaviour and suggest avenues for future research","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15299.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7851\/1\/7851.pdf","pdfHashValue":"6f97c8a3c0db5c83748de4f8248e0d0c9e04d5eb","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7851<\/identifier><datestamp>\n      2013-04-10T09:35:39Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Behaviour and climate change : consumer perceptions of responsibility.<\/dc:title><dc:creator>\n        Wells,  V.K.<\/dc:creator><dc:creator>\n        Ponting,  C. <\/dc:creator><dc:creator>\n        Peattie,  K.<\/dc:creator><dc:description>\n        This paper explores the under-researched notion of consumer responsibility, a potentially significant influence on consumer behaviour that marketers and policymakers may be able to harness as they attempt to respond to environmental challenges such as climate change. The paper uses data derived from a commercially motivated survey (n = 1513) to explore domestic consumption behaviours most closely associated with the issue of disruptive climate change. A measure of 'General Environmental Responsiveness' (GER) is used to test: (1) the effects of consumers both taking responsibility for their actions and placing responsibility on others for the consequences of their consumption behaviour; and (2) whether sociodemographic variables can aid the targeting of consumers by the level and type of responsibility and pro-environmental behavioural intentions expressed. The study's findings demonstrate clear, if not strong, relationships between consumer conceptions of responsibilities for causing and tackling climate change and environment-related consumer behaviour. The study's implications both challenge accepted wisdom about environment-related consumer behaviour and suggest avenues for future research.<\/dc:description><dc:subject>\n        Consumer responsibility<\/dc:subject><dc:subject>\n         Environmental responsiveness<\/dc:subject><dc:subject>\n         Climate change<\/dc:subject><dc:subject>\n         Sociodemographic variables.<\/dc:subject><dc:publisher>\n        Routledge<\/dc:publisher><dc:source>\n        Journal of marketing management, 2011, Vol.27(7-8), pp.808-833 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2011<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7851<\/dc:identifier><dc:identifier>\n        issn:0267-257X<\/dc:identifier><dc:identifier>\n        issn: 1472-1376<\/dc:identifier><dc:identifier>\n        doi:10.1080\/0267257X.2010.500136<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7851\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1080\/0267257X.2010.500136<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7851\/1\/7851.pdf<\/dc:identifier><dc:rights>\n        This is an electronic version of an article published in Wells, V.K. and Ponting, C. and Peattie, K. (2011) 'Behaviour and climate change : consumer perceptions of responsibility.', Journal of marketing management. . pp. 1472-1376.\\ud\nJournal of marketing management is available online at: http:\/\/www.informaworld.com\/smpp\/ with the open URL of your article.\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0267-257x","issn: 1472-1376","issn:0267-257X"," 1472-1376"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2011,"topics":["Consumer responsibility","Environmental responsiveness","Climate change","Sociodemographic variables."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n01 May 2012\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nWells, V.K. and Ponting, C. and Peattie, K. (2011) ’Behaviour and climate change : consumer perceptions of\nresponsibility.’, Journal of marketing management., 27 (7-8). pp. 808-833.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1080\/0267257X.2010.500136\nPublisher’s copyright statement:\nThis is an electronic version of an article published in Wells, V.K. and Ponting, C. and Peattie, K. (2011) ’Behaviour\nand climate change : consumer perceptions of responsibility.’, Journal of marketing management. . pp. 1472-1376.\nJournal of marketing management is available online at: http:\/\/www.informaworld.com\/smpp\/ with the open URL of\nyour article.\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \ni \n \nBehaviour and Climate Change: Consumer Perceptions of Responsibility \n \nVictoria.K.Wells* \nCardiff Business School, Cardiff University \n \nCerys A. Ponting \nESRC Research Centre for Business Relationships, Accountability, Sustainability and \nSociety (BRASS), Cardiff University \n \nKen Peattie \nESRC Research Centre for Business Relationships, Accountability, Sustainability and \nSociety (BRASS), Cardiff University \n \n \n \n \n \n \n \n \n* Corresponding author:  Dr Victoria.K.Wells (née James), Cardiff Business School, \nAberconway Building, Column Drive, Cardiff, CF10 3EU, UK, JamesVK@cardiff.ac.uk\n  \nii \n \nAbstract. \nThis paper explores the under-researched notion of consumer responsibility, a potentially \nsignificant influence on consumer behaviour that marketers and policy-makers may be \nable to harness as they attempt to respond to environmental challenges such as climate \nchange. The paper uses data derived from a commercially motivated survey (n = 1513) to \nexplore domestic consumption behaviours most closely associated with the issue of \ndisruptive climate change. A measure of „General Environmental Responsiveness‟ (GER) \nis used to test (1) the effects of both consumers taking responsibility for their actions and \nplacing responsibility on others for their consumption behaviour and (2) whether socio-\ndemographic variables can aid the targeting of consumers by the level and type of \nresponsibility and pro-environmental behavioural intentions expressed.  The study‟s \nfindings demonstrate clear, if not strong, relationships between consumer conceptions of \nresponsibilities for causing and tackling climate change and environment-related \nconsumer behaviour. The study‟s implications both challenge accepted wisdom about \nenvironment-related consumer behaviour and suggest avenues for future research. \n \nKeywords: Consumer Responsibility, Environmental Responsiveness, Climate Change, \nSocio-Demographic Variables \n \n  \niii \n \nAuthor Biographies. \n \nDr Victoria.K.Wells (née James) is a Lecturer in Marketing and Strategy at Cardiff \nBusiness School.  Her research interests lie in the application of behavioural psychology \nto consumer choice models and environmental behaviour and psychology.  She joined \nCardiff Business School in 2005 as a research associate, becoming a lecturer in 2006 and \nis currently the secretary of the Consumer Behaviour Analysis Research (CBAR) Group. \nShe holds a degree in Commerce from Birmingham Business School and a Postgraduate \nDiploma in Social Science Research Methods from Cardiff University.  Prior to joining \nCardiff Business School she worked in Marketing Communications as an Account \nExecutive. \n \nCerys Ponting is a Research Associate at BRASS and is a member of the Sustainable \nCommunities, Lifestyles and Consumption (SCLC) group and is also associated with \nwork of the Sustainable Production, Use of Resources and Technology (SPURT). She \nholds a degree in Business Administration from the School of Management at the \nUniversity of Bath and an MSc in Social Science Research Methods from Cardiff \nUniversity.  Prior to joining BRASS she previously worked with Business in the \nCommunity as a Business Development Executive & Account Manager.  \n \nProf Ken Peattie is the Director of BRASS (ESRC Research Centre for Business \nRelationships, Accountability, Sustainability and Society), and is also a Professor of \nMarketing and Strategy at Cardiff Business School, which he joined in 1986. He holds a \nBA in Management and Geography from the University of Leeds, and before becoming \nan academic, he worked in marketing and systems analysis for an American paper \nmultinational, and as a strategic planner within the UK electronics industry. \n \n \n \n  \n1 \n \nIntroduction: Motivating More Sustainable Consumption. \nScientific evidence is creating a consensus that economic growth has placed an \nunsustainable burden on the physical environment. Over-consumption, resource use and \nthe generation of pollution and waste are degrading environmental systems and the \n„ecosystem services‟ they provide and which people depend upon, directly and indirectly, \nfor their survival and wellbeing (WRI, 2005). In the case of the most pressing \nenvironmental challenge, preventing and\/or responding to disruptive climate change, it \nhas significant implications for the global economy. The evidence review by the eminent \neconomist Sir Nicholas Stern (2006) forecast that unless 1% of GDP is invested in \nresponding to the climate challenge (later increased to 2% to reflect continuing inaction), \nthen the negative consequences could shrink the global economy by 20% by 2035. The \nneed to move to a lower carbon economy is therefore a pressing strategic challenge \nwidely acknowledged by both policy makers and businesses.  \n \nMoving towards a lower carbon economy requires a range of possible levers to be \nemployed including technological innovation, regulation, investment, financial \nincentives, organisational change and education. Carbon emissions are also strongly \nlinked to the consumption of private households and the choices and behaviours of \nindividuals. Motivating consumers to adopt more sustainable consumption behaviours is \ntherefore an important policy goal and a source of potential commercial marketing \nopportunities. It has therefore become a focus for academic research, much of which was \ncomprehensively synthesized by Tim Jackson (2005) in his research monograph \n„Motivating Sustainable Consumption‟.  Jackson‟s synthesis, together with other studies \n  \n2 \n \n(e.g. Moisander, 2007), demonstrate that consumer behaviour is a complex and \nmultidimensional phenomenon, which is further complicated by the inclusion of \nsustainability concerns. They also highlight the range of factors thought to influence \nconsumers‟ sustainability-related behaviours including their demographics, values, \nattitudes, knowledge, goals, emotions and circumstances. Behaviour can also vary \naccording to the nature of the purchase, including its social significance and the \nsituational influences of the time and place of purchase.  \n \nThere is a myriad of potential influences on consumer behaviour in relation to \nsustainability which researchers have tried to identify and measure. Many of these, such \nas goals, attitudes, social identity, perceived self-efficacy and situational forces are \nincorporated within conventional integrative models of consumer behaviour (such as \nBagozzi‟s et al‟s 2002 “Comprehensive Model of Consumer Action”) and have also been \nwell-researched in conventional, as well as sustainable, consumption contexts. Other \npotential influences are more characteristic of models of behaviour developed specifically \nto explain environmentally and socially motivated behaviours. Grob‟s (1995) Model of \nEnvironmental Behavior for example found that environmental knowledge together with \npersonal values, perceived control and emotional response determined environmental \nbehaviour. Some influences are features of models developed by extending existing \nmodels of consumer behaviour, with the Theory of Planned Behavior (TPB) being a \nparticularly popular basis. For example, Oom Do Valle et al. (2005) extended the TPB \nwith elements from other models of altruistic behaviour, environmental behaviour and \nenvironmental concern to create a comprehensive model of recycling behaviour. This \n  \n3 \n \nincluded very behaviour-specific influencing factors such as knowledge about recycling, \nand perceived convenience of local recycling systems.   \n \nIt is unusual to find a potential behavioural influence which is relatively generic \n(ie. not specific to a particular environmental behaviour such as recycling), yet appears \nonly in those models of consumer behaviour developed to explain social or \nenvironmental consumption behaviour. One such factor, is a sense of „responsibility‟ and \nhow it is perceived and ascribed by consumers. This is a key feature of  Stern et al.‟s \n1999, Value Belief Norm Model, but has otherwise been generally neglected by \nresearchers interested in pro-environmental consumer behaviour. This paper seeks to \nfurther our understanding of how consumer perceptions about responsibilities may \ninfluence their behaviour in the context of climate change. It explores this issue with \nregard to those domestic consumption behaviours most closely associated with the issue \nof disruptive climate change. \n \n  \n4 \n \nProfiling Consumers for Sustainability \nSustainability orientated consumer research encompasses a variety of concepts of \nmore sustainable consumption using a range of labels for consumers and their behaviour \n(including green, greener, sustainable, pro-environmental, pro-social, environmentally \nconscious, altruistic, ecological, ethical or alternative, see Jackson, 2005). The key \nstreams of this research involve profiling consumers in relation to sustainability concerns \nto enable markets to be meaningfully segmented (Straughan and Roberts, 1999); profiling \ntypes of consumer to understand how they might be motivated to consume more \nsustainably (Jackson, 2005);  testing the acceptability of price premiums for more \nsustainable products (Laroche et al., 2001);  and exploring why there is frequently a \nsignificant gap between consumers‟ reported willingness to consume more sustainably, \nand actual behaviour (Vermeir and Verbeke, 2006).  \nOne contentious issue affecting early attempts at profiling consumers and \nsegmenting markets for sustainability were that they were often largely based on socio-\ndemographic variables (Straughan and Roberts, 1999). However as Schlegelmilch et al. \n(1996) note, this reflected the ease with which such variables could be applied and \nmeasured rather than any very strong theoretical or conceptual arguments. As the body of \nresearch expanded, the value of using socio-demographic variables became increasingly \ncontentious, particularly given the tendency for different studies to produce inconclusive \nand contradictory results for particular demographic variables (Kilbourne and Beckman, \n1986; Robinson and Smith, 2002). Diamantopoulos et al. (2003) provide a critical review \nof the literature linking socio-demographics to environmentally-orientated consumer \nattitudes and behaviours. They conclude that socio-demographics alone are of limited \n  \n5 \n \nvalue for profiling, but are more potentially useful when used in combination with other \ninfluences such as values, attitudes or knowledge. This study builds on this insight by \ntesting the value of socio-demographic variables when used with other socio-\npsychological variables, in this case, the under-researched notion of consumer \nresponsibility in relation to the environment and climate change.  \nResearch profiling consumers and segmenting them in terms of sustainable \nconsumer behaviour also has another acknowledged weakness, which is a tendency to \nfocus on individual behaviours (such as recycling or purchasing of a particular type of \nproduct) and on specific impacts such as energy usage (Spangenberg and Lorek, 2002). \nThis is problematic because the research literature indicates that while some types of \nsustainable behaviour are influenced by factors such as values, others are not. Even \namongst those behaviours influenced by values, particular values influence different \nbehaviours in different ways (Pepper et al. 2009; Barr, 2007; Corraliza and Berenguer, \n2000). \nAnother problem with the over-emphasis on individual behaviours and impacts is \nthat it is the cumulative impact of all a consumer‟s behaviour that is significant. This is \ndemonstrated by the „rebound effect‟ associated with behaviours such as energy saving. \nReducing domestic energy use apparently lessens a consumer‟s environmental impact, \nbut if the resulting financial savings are spent on energy intensive goods and services, \nthis may not be the case (Herring, 1999). This paper seeks to gain insight into overall \nconsumer lifestyles and their sustainability by considering a range of behaviours and by \nseeking to evaluate their net effect in relation to climate change. \n \n  \n6 \n \nEvolving Notions of Consumer Responsibility \nCorporate Social Responsibility (CSR) has received considerable attention \nacademically (recent examples include Peng 2009 and Jenkins 2009) and in the wider \nmedia. Other notions of business responsibility, and particularly an equivalent concept of \n„consumer social responsibility’, have received comparatively little attention (Brinkman \nand Peattie, 2008). This may be due to the dominance of the notion of consumer \nsovereignty, which assigns power as opposed to responsibility to consumers, as a key \nprinciple underpinning the marketing discipline.  \n \nWhen the existing marketing literature does consider the social responsibility of \nconsumers, it has mostly restricted itself to questions of the behaviour of the consumer \nrather than the company, and of consumer dishonesty rather than on more positive \nbehaviours (Brinkman and Peattie, 2008). However, there is an emerging normative \nconcept of the „citizen consumer‟ which Gabriel and Lang (1995: 175) define as „a \nresponsible consumer, a socially-aware consumer, a consumer who thinks ahead and \ntempers his or her desires by social awareness, a consumer whose actions must be \nmorally defensible and who must occasionally be prepared to sacrifice...‟. In marketing, \nsuch a concept of consumer responsibility is still under-developed, but looking across \nother disciplines of social science scholarship such as health, notions of personal \nresponsibility tend to be more prevalent (see for example, Attell-Thompson, 2005 and \nBricas 2008).  \n \n  \n7 \n \nAlthough such a sense of personal responsibility might be expressed by \nconsumers through self-sacrifice, potentially more significant would be a sense of \npersonal responsibility as an individual being extended to a sense of responsibility as a \nconsumer for the behaviour of the companies they patronise. Williams (2005) discusses \nthe role consumers could play, suggesting an increasing role for consumer social \nresponsibility to complement CSR. Reporting results from the „Which? Bite Back‟ \nsurvey, Williams suggests that, since 66% of consumers believe they can influence a \ncompany‟s environmental and ethical behaviour, they might therefore be prepared to \naccept some responsibility for how companies behave. He urges the development of a \nproactive notion of consumer social responsibility that encourages more socially and \nenvironmentally favourable behaviour by companies. The link between consumer power \nand responsibility is also raised by Peters (2005) reporting on the practices of the Dutch \nConsumer Association, which support the notion that consumers can affect, and therefore \nbear some responsibility for, the practices and policies of companies.  There have also \nbeen some empirical studies linking consumer behaviour as „voting behaviour‟ to \nperceptions of consumer responsibility (see for example Dickinson & Carsky, 2005).  \n \nEven where the consumer is potentially willing to adopt this type of responsibility \nand seek to influence companies, their ability to do so will depend upon the availability \nof relevant information (Williams, 2005; Barnett et al. 2005). This could include \ninformation relating to companies‟ practices and policies (Peters 2005) and to the \nconsequences of consumers‟ choices. However information alone will not guarantee that \nconsumers respond. Too much information can create a sense of „information overload‟ \n  \n8 \n \nwhich deters a response (Jacoby 1984, Hahn, Lawson and Lee 1992). Consumer response \nalso depends on their ability to understand the information, but as Shaw and Clarke \n(1999) note, individuals are often confused about environmental issues and are \ninconsistent in  making connections between an issue like climate change and aspects of \ntheir own lifestyles and consumption (Anable et al., 2006). Ability to act on relevant \ninformation will also depend on the consumer‟s sense of perceived behavioural control \n(Giles and Cairns 1995, Armitage and Conner 2001) and their wider sense of self-\nefficacy (Terry and O‟Leary 1995). \nIn relation to sustainability issues (including climate change) and responsibility, \nthe research emphasis has often been on who is responsible for particular problems, or \nwho should bear responsibility for addressing them. Rodrigues et al. (2005) and Lenzen \net al. (2007) use ecological economics to frame responsibility in terms of ascribing who \nis accountable for a) environmental pressure and b) the environmental impacts of \nproducers or consumers respectively. Similarly Munksgaard and Pedersen (2001) sought \nto ascribe responsibility for CO2 emissions from a policy perspective. From a marketing \nperspective, what is more significant is the consumer‟s sense of responsibility, and how \nthey perceive and ascribe responsibilities for the environmental consequences of \nproducts, production impacts, purchase behaviour, and consumption and disposal \nbehaviours. For companies and policy makers seeking to develop more sustainable \nsystems of consumption and production, the role that consumers‟ sense of responsibility \nplays in their willingness to engage in pro-environmental behaviour (PEB) is potentially \nvital and needs to be researched and understood. \n \n  \n9 \n \nAwareness of the potential importance of consumer responsibility appears to be \ngrowing. Kaiser and Schimoda (1999: 244) in discussing the psychology of PEBs stress \nthe need to develop personal responsibility stating that “If a person is aware of the \nconsequences of certain behaviour, the ascription of personal responsibility becomes \ncrucial.” This was reflected in the recent EU campaign „You Control Climate Change’1, \nin which consumers are urged to take responsibility by turning down the thermostats in \ntheir homes, switching off their appliances, recycling and walking.  Similarly the research \nwhich underpinned the UK Sustainable Development Commission‟s „I Will If You Will‟ \nreport (Sustainable Consumption Roundtable 2006) highlighted the importance of a sense \nof shared responsibility.   \n \nDespite the growing emphasis on consumer responsibility, it remains under-\nresearched (Carrigan and Attalla 2001), and is mostly discussed normatively and \ntheoretically (for example Caruana and Crane 2008). Relatively little empirical work has \nbuilt on these ideas, and that which does exist explores the idea with a relatively narrow \nfocus  (see for example Wray-Lake et al., 2010 which only explores adolescent \nbehaviour). There is an irony that “environmentally responsible” is one of the more \ncommonly used labels for more sustainable consumer behaviour, when consumer \nenvironmental responsibility remains a comparatively under-researched and poorly \nunderstood concept.  \n \n \n \n                                                 \n1\n http:\/\/ec.europa.eu\/environment\/climat\/campaign\/index.htm \n  \n10 \n \nUnderstanding Consumer Socio-Environmental Responsibility  \nThere are several problems with the existing literature when seeking to \nunderstand the motivations behind PEB, and the role played by consumers‟ sense of, and \nascription of, responsibility. Firstly, there is what Jackson (2005) describes as a „well-\ninformed confusion‟ in the academic literature resulting from the differing definitions and \nterminology used (often interchangeably), especially the wide range of titles applied to \nsustainability-orientated consumption behaviours (as noted above) and the varying terms \ndescribing different types of responsibility. For simplicity this article will use PEB to \ndescribe pro-environmental behaviours in the context of climate change, since most of \nthe major PEBs such as recycling, energy-saving, travel and purchase reduction are also \nspecifically pro-climate.   \n \nSecondly, much of the early work uses a very narrow conception of social \nresponsibility. Webster‟s (1975) early extensive exploration of the „socially conscious \nconsumer‟ used as the dependent variable a measure of social responsibility, based on a \nscale developed by Berkowitz and Lutterman (1968) and refined by Anderson and \nCunningham (1972). Even Webster concedes that this scale „defines social responsibility \nin a rather specific (and perhaps outdated) way‟ by basing it on the acceptance of norms, \ninvolvement in community affairs and identification with the protestant work ethic. It is \nperhaps unsurprising that he found no relationship between a sense of social \nresponsibility using that measure and socially conscious consumer behaviour.   \n \n  \n11 \n \nA third weakness in the literature is a tendency to consider „social responsibility‟ \nas a broad construct, and to assume that concepts like social responsibility, environmental \nresponsibility and altruism are interrelated and can be used interchangeably. Tucker et al. \n(1986) sought to break down the differences between general social responsibility (also \ncommenting on work by Berkowitz, this time Berkowtiz and Daniels, 1963) and specific \nindividual responsibility. They suggested that individual environmental responsibility \nwas a subset of social responsibility, and that the term individual social responsibility can \nbe used interchangeably with altruism or pro-social behaviour (although work on specific \nenvironmental altruism appears to be lacking in the literature).  As with other authors, \nTucker et al. attempt to understand the characteristics, whether psychological, attitudinal \nor socio-demographic of what they term „environmentally responsible consumer citizens‟ \nbut do not then go on to discuss how specifically this may affect their behaviour and \nconsumption choices.   \n \nThe literature on ethical consumption encompasses issues beyond the \nenvironment including oppressive regimes, human rights, factory farming and political \ndonations (Harrison, Newholm and Shaw 2005). Broad measures of social responsibility \nor ethical consumption may be unhelpful for understanding consumer behaviour in \nrelation to more specific environmental issues.  A political activist with strong views on \nhuman rights or political donations, and an environmental activist with strong views on \nfactory farming might have little interest in each other‟s agendas or priorities. In some \ncases these might even conflict. Ever since Kinnear et al. (1974) sought to identify the \n„ecologically concerned consumer‟ by simply extending Anderson and Cunningham‟s \n  \n12 \n \n(1972) „Social Responsibility Scale‟, the working assumption within marketing \nscholarship has been that the socially and environmentally concerned consumer will be \nmuch the same thing. However, this is a significant assumption, and a misanthropic \nanimal lover would be a simple confounding example. Similarly the research on how \nenvironmental concerns impact on consumer behaviour have overused broad measures of \nenvironmental concern (Follows & Jobber, 2000), whereas more specific environmental \nissues (such as animal cruelty or concerns about genetic modification) are more strongly \ncorrelated with actual behaviour (Fraj and Martinez, 2007).  \n \nA fourth weakness is the tendency for research to focus on consumer perceptions \nof their personal responsibility in relation to an issue, without attempting to understand \nthe perceived allocation of responsibility to others.  For example if consumers feel that \nothers such as governments or businesses are more responsible than themselves for \ncausing climate change, how would this affect their own behaviour and attitudes? Zaccaï \n(2006) observed that the attitude-behaviour gap often noted amongst consumers with \nstrong pro-environmental attitudes was linked to uncertainty about consumer \neffectiveness combined with an expectation that government should tackle sustainability \nissues through regulation. There is little research attempting to apply a broader, multi-\nstakeholder perspective to responsibility, although Rodrigues and Domingos (2008) did \nseek to apply mathematical modelling to determine how much responsibility should be \nplaced on the company (the producer), the consumer (households, capital purchasers etc)  \nand intermediaries in an attempt to monitor and resolve environmental problems. \nSimilarly Wray-Lake et al. (2010), examine the ascription of responsibility amongst \n  \n13 \n \nadolescents between individuals, consumers and government in environmental \nbehaviours including consumption. They found a declining sense of responsibility \namongst adolescents over time, and a tendency to ascribe responsibility to government or \nan abstract notion of „consumers‟ rather than to themselves. \n \nPerhaps because of these difficulties, research focussing on the links between \nconsumer responsibility and PEB, and which takes the ideas of consumer responsibility \nbeyond a normative and theoretical discussion, remains a rarity.  Kaiser and Schimoda \n(1999) did look specifically at the link between responsibility and what they term \necological behaviour.  They broke down the responsibility concept suggesting two \nspecific responsibility feelings, feeling morally (related to causality, freedom of choice \nand intentionality) or conventionally (related to desire for approval and fear of \natonement) responsible for the environment.  They found that moral responsibility is \nmore closely linked to PEB, especially in terms of causality (that is how much a person \nfeels they cause the problem).  Overall they suggest that 55% of a person‟s PEB can be \nexplained by what they term, a responsibility judgement.  \n \nWithin the „Motivational, Moral and Value Theories‟ school of research into pro-\nenvironmental behaviours (Vinning and Ebreo, 2002), responsibility as a concept features \nmainly within Norm Activation Theory (Schwartz, 1968 and 1977). This proposes that \npersonal norms which drive behaviour are the result of (1) awareness of consequences \nand (2) feelings of responsibility for carrying out the behaviour.  Since Schwartz‟s theory \nis unusual in seeking to explain specifically ethical consumption, it has been widely used \n  \n14 \n \nto understand and to predict PEBs such as  recycling (Hopper and Nielsen 1991; Vining \nand Ebreo 1990 & 1992), household energy saving (Black et al. 1985) or reduced private \ncar use (Bamberg and Schmidt, 2003). Schwartz‟s Norm Activation Theory has also been \ndeveloped further into Value Belief Norm (VBN) theory by integrating it with ecological \nvalue theory (Stern et al. 1999, Stern 2000, Hansla et al. 2008). The VBN model (Figure \n1) proposes that behaviour is shaped by consumer values, particularly in relation to their \nacceptance of the need for a „new environmental paradigm‟ (NEP), their awareness of the \nconsequences of behaviour and their sense of responsibility towards the environment \n(which Stern et al. 1999 articulated as the personal norm of „a sense of obligation to take \npro-environmental actions’ (p.90)).  \nFigure 1: VBN Model \n \nPromisingly, in use this model performed better than competing value-based \nmodels in explaining variances in consumer behaviour. However, the correlations were \nrelatively weak, explaining less than 35% of behavioural variance, and for private sphere \n(i.e. consumption) behaviours, the explained variance was less than 20% (Stern, 2000). \n  \n15 \n \nThe potential practical gap between such values and beliefs and actual behaviour was \nalso demonstrated by Bickman‟s (1972) study on littering. In a survey of 500 people‟s \nattitudes to littering, 94% of interviewees acknowledged a sense responsibility for dealing \nwith litter, but only 2% of those interviewed were observed to pick up a strategically \nplanted piece of litter as they left the study venue. \n \nOverall there is little consensus about the issue of environmental or climate \nchange responsibility and its effect on behaviour or behavioural intention. This paper \nseeks not to clarify all aspects of responsibility, but to look instead at two specific areas \n(1) the effect of both the consumer taking responsibility for their actions and the \nconsumer placing responsibility on others for their consumption behaviour and (2) \nwhether socio-demographic variables can aid the segmentation and targeting of \nconsumers based on their self-perceived level and type of responsibility, and their self-\nreported PEBs.  In short the issue addressed here is not specifically the concept of \nresponsibility, but whether responsibility matters in terms of behaviour.  Does the \nresponsibility orientation of a consumer, whether or not they feel responsible for (or think \nsomeone else is responsible for) climate change affect their behaviour?  This links \nspecifically into the causality idea of Kaiser and Schimoda (1999). Understanding this \nbetter will help policy makers and businesses to create more effective polices and \npractices that encourage and promote desirable behaviours, especially in terms of \nconsumption.    \nTo summarise, the main research questions were: \n  \n16 \n \n(1) What is the role of demographic variables in consumers‟ environmentally related \nbehaviours? \n(2) What is the role of demographic variables in consumers‟ responsibility \norientations (who the consumer feels is responsible for causing and tackling \nclimate change)? \n(3) What role do differing responsibility orientations and agreement with a range of \nattitudinal statements have in environmentally related behaviour? \n \n \nMethodology \nThis research is based upon a partnership project between the Centre for Business \nRelationships, Accountability, Sustainability and Society (BRASS) at Cardiff University \nand the Future Foundation consultancy, exploring issues of climate change, consumer \nbehaviour and the future of brands.  The research involved a range of qualitative and \nquantitative dimensions including questionnaires, interviews, household „deep dives‟, and \nDelphi research involving an expert panel.  The issue of responsibility was tackled in the \nqualitative stages (the results of which will not be considered here) which informed the \ndevelopment of the responsibility questions in the questionnaire. The research was \npredominantly funded through a consortium of commercial businesses and public sector \norganisations acting as sponsors.\n2\n  \n                                                 \n2\n The authors would like to acknowledge the support of the ESRC‟s Business Engagement Scheme which \nfunded BRASS‟s involvement in this research partnership and the secondment of a researcher. \n  \n17 \n \nThe quantitative questionnaire was hosted online utilizing a randomly selected \nnationally representative panel provided by Research Now\n3\n. In the questionnaire alone a \npanel of 1513 consumers were questioned regarding their behaviours, attitudes and \nbeliefs about their consumption behaviour and climate change. Panel members‟ profiles \nensured that their selection fulfilled sampling criteria, which in this case was for a geo- \nand socio-demographically representative sample which was obtained. Respondents \nreceived a small incentive from Research Now for the completion of questionnaires, and \nthus there was little attrition with the survey.  \n \nThis questionnaire was neither originally designed, nor data the collected, with \nthis specific analysis in mind, which imposes some limitations on the dataset and the \npossible analyses.  The data was also not specifically tailored to either academic research \nor primarily focused on the issue of responsibility. The measures involved would \nprobably have been designed differently had the research been intended for this specific \npurpose.  However, the data generated is rich and the sample is large, so an exploration of \nthe issues can certainly be commenced.  A conservative statistical approach was used for \nthese reasons, and the results should be interpreted as exploratory and tentative.  They do \nhowever suggest the need for deeper, more tailored and further future research into the \narea. \n \n                                                 \n3\n Research Now owns the largest online panel in the UK, comprising of 400,000 consumers. The Research \nNow UK panel is one of the most robust and deeply-profiled panels in the UK with extensively profiled \ninformation on a range of subjects e.g. respondent region, age, social class, household size and status, cars \nowned, mobile phones owned and networks used, bank and financial products used, TV packages in the \nhome, ailments suffered plus much more http:\/\/www.researchnow.co.uk\/Panel_UK.htm (accessed \n18\/11\/08) \n  \n18 \n \nThis paper concentrates on a number of sections of the research questionnaire, \nspecifically those questions relating to consumers‟ pro- or anti-environmental behaviours, \ntheir feelings about responsibilities for both causing and tackling climate change, along \nwith some general attitudinal statements.  The responsibility questions offered the answer \nchoices of : ‘me as an individual’, ‘other individuals’, ‘extracting industries’, \n‘manufacturing companies’, ‘service industries’, ‘central government’, ‘local \ngovernment’, ‘NGOs\/Not for profit organisations’, ‘local community groups’, \n‘developing countries’, ‘other’ and ‘don’t know’. Respondents could answer yes or no for \neach of these choices.  A range of attitude statements were also used (which are presented \nand discussed in the results section).  These were answered using 5-point likert scales \nfrom strongly disagree to strongly agree. \n \n The analyses required a measure of behaviour or behavioural intention to act as \ndependent variable and to assess the effects of, or correlations with, different aspects of \nresponsibility.  The questionnaire asked a range of questions regarding consumers‟ \nbehaviours from reduction, reuse and recycling behaviours to travel, shopping and energy \nconsumption behaviours.  The behaviour measure simply scored them on the number of \nreported PEBs minus any reported anti-environmental\/negative behaviours.  The \nmeasure, termed General Environmental Responsiveness (GER) had a possible minimum \nscore of -47 with a possible maximum score of 79 (a range of 126).  To summarise, those \nscoring at the lower end reported more negative behaviours, those at the upper end more \npositive behaviours. The actual maximum reported for any consumer was 56, the \nminimum was -27 (a range of 83).  There was a mean of 16.3602, median of 16 and mode \n  \n19 \n \nof 9 (although multiple modes did exist).  The standard deviation is 13.68, skewness -\n.028 and kurtosis -.107 showing a relatively normal distribution (GER score, D (1513) = \n0.02, p>.05 was normal).  The GER measure allowed exploration of a range of PEBs and \nnot just at a single behaviour such as recycling – which often dominates environmental \nbehaviour studies (Vinning and Ebreo 2002).  However in appreciation of this, and to \nallow comparison, four smaller GER scores were developed, each taking parts of the \nmain GER measure, to look at more specific groupings of behaviour.  The four GER \ngroups were Leisure, Purchasing, Household and Travel.  Unlike the main GER measure \nthe GER scores within the smaller groupings were not normally distributed. \n \nThe issue of social desirability of behaviours is important in all environmental \nresearch and it is generally accepted that self reported behaviour does not always \ncorrespond to actual behaviour (Vinning and Ebreo 2002).  It is hoped however that data \ncollection via an impersonal online mechanism, rather than face to face, should \nencourage participants to be honest and open about their behaviour.  Unfortunately due to \nthe secondary nature of the data it was impossible to check actual behaviour to verify the \nbehavioural reports.  It is also suggested that as pro-environmental issues are generally \nsocially approved, that respondents may overestimate their behaviours (Follows and \nJobber, 2000).  Vinning and Ebreo (2002) suggest the need for a „correction measure‟ to \novercome this but this could not be included here again due to the secondary nature of the \ndata.  In designing the GER measure the authors also tried to take into account other \nmethodological challenges in the research area summarised by Vinning and Ebreo \n(2002).  For example they suggest the need to consider how behaviour is assessed and \n  \n20 \n \nsuggest using frequency, duration and intensity as measures as well as whether the \nbehaviour is performed at all.  The data allowed both the actual performance and the level \nof that performance to be taken into account.  For example respondents received extra \npoints if they reported that they recycled „often’ rather than „a little‟.   \n \n A range of exploratory analyses were completed to investigate the data and \nspecifically the effects of responsibility.  Consumers were firstly categorised by their \nanswers to the responsibility questions and the correlations with their GER score.  In \nsome cases a linear regression analysis was also used.  The same analyses were then \ncompleted based on segmentations by age, education, sex, UK region and social class \nalthough not all analyses will be reported here. \n \n A large amount of demographic data was collected within the questionnaire.  Of \nthe 1513 consumers questioned 47.5 % were male, 52.5 % were female.  With regards \nage 32.3 % were between the ages of 16 and 34, 34.6 % were between the ages of 35 and \n54, 13.9 % were between the ages of 55 and 64 and 19.2% were over 65 years of age.   \n \nResults \nInitial demographic analyses exploring the first research question, the role of \ndemographic variables in environmentally responsible behaviours, showed that the \ngeneral GER increased with age from a mean of 14.63 in the age group 16-34 to 19.80 \nfor the 65+ age group (see Table One) and is largely supported across the other GER \ngroupings.  The level of GER also increased as educational level increased (from 15.41 \n  \n21 \n \nfor 5 grade C GCSEs or less to 18.32 for those with a professional qualification) and a \nsimilar pattern is somewhat evident in the other GER groupings. Females also have a \nhigher mean score than men (18.41 compared to 14.09) and this is supported across the \nGER sub groupings.  The female GER mode is also much larger than the male GER \nmode score (25 for women compared to 9 for men).  However GER scores do not show \nany clear pattern by social class or by region.    \n-INSERT TABLE ONE ABOUT HERE- \nIn attempting to answer this first research question it can be seen that there is \nsome demographic influence although this is not always significant or consistent across \ncategorisations.  Table Two contains GER scores for each responsibility orientation \nsegmented by responsibility orientation and by sex and age. \n-INSERT TABLE TWO ABOUT HERE- \n \nAlthough not always significantly different the general trend is that women have \nhigher GER scores than men (supporting the results in Table One).  In terms of age there \nis a strong tendency for higher average GER scores amongst older individuals (again \nsupporting the results in Table One).  Similar explorations were performed for education \nlevel and social class although no discernable pattern was found.  In answering research \nquestion two therefore, as with question one there is some correlation between \ndemographic variables and specific responsibility orientations although these are \nstrongest within age and sex categorisations.  Table Two also contains useful information \nin terms of research question three.  Where consumers ascribe responsibility for causing \nclimate change to someone (including themselves) or something in general their GER \nscores were higher.  In comparison GER scores were lower if the participant ascribed \n  \n22 \n \nresponsibility for tackling climate change to someone or something (including \nthemselves). By comparing the upper and lower sections of Table Two it can be seen, for \nexample, that if a consumer responded that they as an individual felt responsible for \ncausing climate change, they would also see it is their responsibility to tackle climate \nchange.  In fact many more consumers reported that they felt responsible for tackling \nclimate change than for causing it (834 compared to 331 individuals).  This type of \npattern is also prominent for Central Government, Local Government, NGOs\/not for \nprofit organisations and Local community groups where many more consumers reported \nthinking that it was these organisations‟ responsibility to tackle climate change, than \nthought of them as causing climate change.  For example 428 respondents ascribed \nresponsibility to Central Government for causing climate change while 1056 suggested \nthat Central Government had a responsibility to tackle it.  Moving briefly into another \narea of the questionnaire (trust) it can be seen that Pearson correlation between „trust of \nthe UK government‟ and stating that „it is central governments responsibility to tackle \nclimate change‟ (r = .143, p < .01) suggests that those who trust the government are more \nlikely to say it is the government‟s responsibility.  However only 35% of respondents \nsaid they trusted them, while 69% thought it was their responsibility to tackle climate \nchange.  \nTable Three contains Pearson correlation coefficients for GER and responsibility \norientation for both the overall GER score and for the four separate GER groupings. \n-INSERT TABLE THREE ABOUT HERE- \nThere are significant positive correlations between GER scores and responsibility \norientation for causing climate change with the only negative correlations for respondents \n  \n23 \n \nwho answered „other‟ or „don’t know‟. The opposite case is found for those consumers \nresponding to the question „Whose responsibility do you think it is to tackle climate \nchange?‟ with no statistically significant correlations between GER score and \nresponsibility for tackling climate change.  It can also be seen that the significance of \neach GER grouping differs in terms of responsibility orientation (both in terms of \nresponsible for causing and tackling climate change).  In terms of the Leisure GER the \nresults are quite weak and while overall there is a general increase in GER if you see \nyourself or other individuals as responsible, this does not continue into other \nresponsibility orientations such as perceiving organisations and governments as \nresponsible.  For the Purchasing GER the correlation is more statistically significant with \nthose who see individuals as responsible also displaying higher levels of PEB.  A similar \npattern was also displayed for the Household GER.   \n \nThe Travel GER shows mixed results with certain responsibility orientations (if \nthe consumer sees themselves, service industries or developing countries as responsible \nfor tackling climate change) they will also display a larger GER score.  In general a \nresponsibility orientation of whichever type tends to be correlated more strongly with \nhousehold or purchasing behaviours.   \nTable Four contains Pearson correlation coefficients for GER against a range of \n20 attitude statements contained in the questionnaire. \n-INSERT TABLE FOUR ABOUT HERE- \nOnly three attitude statements correlate significantly with general GER:  „Climate \nchange has occurred many times in human history and it’s part of the natural shifting of \n  \n24 \n \nthe climate‟, „It’s too late to do anything about climate change‟ and „Attempts to tackle \nclimate change should be coordinated at an international level to be successful‟.  \nHowever, the lack of correlation between attitudes and behaviour has been documented \nwidely so the lack of correlation here is perhaps unsurprising (Sutton, 1998; Foxall 2002; \nSheeran 2002).  In terms of the GER groupings, the attitude statements showed some \ninteresting results. „I am concerned about the effects of climate change‟ correlated \nstrongly with the GERs for Leisure, Purchasing Activities and Travel.  „Consumers can \nhelp reduce the impact of climate change if they can change what they buy on a regular \nbasis‟ perhaps unsurprising correlated more highly with the GER for Purchasing \nActivities and Household Activities, but also more surprisingly with the GER for Leisure. \n \nTables Five, Six, Seven, Eight and Nine contain results of simultaneous linear \nregression analyses for general GER and each of the GER groupings.  Only those \nstatements which were significant predictors within the models are included in the tables. \nThe significant predictors were also largely supported by subsequent stepwise regression \nanalyses.  Adjusted R Square values for each analysis were:  General GER 0.250, GER \nHousehold Activities 0.145, GER All Travel 0.101, GER Purchasing Activities 0.214 and \nGER Leisure 0.118. This suggests that GER predicts between 10 and 25% of the variance \nin consumers behaviour.  Although not directly comparable due to differing \nmethodologies and measures (the work used a sample of consumers specifically \ninterested in aspects of driving from two Swiss transportation associations) this is lower \nthan the 55% of person‟s ecological behaviour that Kaiser and Shimoda (1999) suggest \ncan be predicted by their measure of responsibility judgement.   \n  \n25 \n \n-INSERT TABLES FIVE, SIX, SEVEN, EIGHT AND NINE ABOUT HERE- \nMost notable across all the regression analyses is that the attitudinal statements form a \nlarger proportion of significant predictors.  Responsibility orientation (both in causing \nand tackling climate change) did however play a larger part taking into account those \npredictors that fell just short of the significance level required (and hence are not included \nin the tables).  In line with the above correlations the answer „don’t know‟ played a larger \npredictive part than might have been expected.   Within the household activities GER an \nincreased agreement with the statement „climate change is largely caused by human \nactivities‟ surprisingly predicted a small reduction in the dependant variable, GER.  \nCommon predictors (of both increases and decreases in GER) across all groupings \nincluded responsibility for causing and tackling climate change being apportioned to \nlocal\/central government and greater agreement with the statements „I am concerned \nabout the effects of climate change‟, „I don’t see why I should take action on climate \nchange if other people are not‟ and „I would switch my custom to companies that are \nworking to reduce climate change‟ (a greater predictor in general and purchasing activity \nGERs).   \nIt is obviously difficult given the above results and those further contained in the \ntables to provide a definitive answer to research question three.  While the correlation \nanalysis suggests a greater part played by responsibility orientations, especially those \nregarding individuals perceiving themselves and\/or other individuals as responsible, the \nregression analyses suggest a heavier weighting toward the attitudinal statements and \nsome considerably more than others.  While the nature of the data might explain some \n  \n26 \n \ninconsistencies there are still a number of interesting and useful aspects that have been \nhighlighted. \n \nDiscussion & Conclusions \nThis research demonstrates a clear relationship between a consumers‟ sense of \nenvironmental responsibility and their environmentally-related consumption behaviours. \nAlthough the influence of this sense of responsibility is often weak compared to other \nfactors, it is still significant, and this demonstrates the worth of approaches such as the \nVBN Model in helping to understand PEB. By contrast it shows that the more \nconventional and commonly-used models based on Theory of Planned Behavior and \nTheory of Reasoned Action (Ajzen and Fishbein, 1980; Ajzen 1991), which omit any \nnotion of consumer responsibility, are missing a significant factor.  \n \nThe nature of the relationship between a sense of responsibility and behaviour \nhowever remains intriguing. The assumption people might draw from the VBN Model is \nthat a sense of responsibility would drive environmental behaviours. However, there is \nalso evidence showing that involvement in a behaviour can also shape values (Tucker and \nSpeirs, 2003), this begs the question as to whether involvement in certain environmental \nbehaviours could lessen a consumers‟ sense of responsibility? As Downing and \nBallantyne (2007) note:  “Many consumers still seek to make changes at the margins of \ntheir lifestyles and do not perceive a need for a fundamental shift in behaviour. \nMoreover, their actions do not appear consistent, well planned or systematic – when \nasked unprompted what they are doing to confront climate change, most cannot identify \n  \n27 \n \nanything beyond recycling, begging the question whether this has become a token \nbehaviour that discharges responsibility in other areas…” \n \nThe study also showed that, despite the controversy about their uses, socio-\ndemographic variables can still be useful in understanding and predicting pro-\nenvironmental behaviours. The higher GER scores amongst females supported various \nstudies suggesting that females are more concerned than men about the environment in \nrelation to household behaviours (e.g. Teisl et al. 2008). GER also has a positive \nrelationship with Education, supporting findings of other studies (e.g. Teisl et al. 2008). \nThe NRS Social Grade categories did not prove conclusive for GER score, in accord with \nfindings by Consumer Focus (Yates, 2009) that consumers from across all social grades \nengage in some way with certain „green‟ behaviours. This rather contradicts the \nfrequently expressed view that environmental issues like climate change are „middle class \nissues’. GER also has a positive relationship with age, suggesting that either older people \nhave a broader knowledge of environmental responsibility, or that a sense of \nresponsibility is something that matures over time, or a declining sense of responsibility \namongst younger generations as observed in the USA by Wray-Lake et al. (2010).  \n \nConsumer environmental attitudes and knowledge are two of the most commonly \ncited influences on behaviour, and the results provided further support for that. \nConsumers‟ concern for the environment was generally seen to be a good predictor for a \nhigher GER score, whilst consumers responding „other‟ or „don’t know‟ to questions \nabout responsibility for causing or tackling climate change generally had lower levels of \n  \n28 \n \nGER. This suggests that there might be a genuine lack of information or education \namongst this cohort, and an inability to make the relevant connections between the issue \nof climate change and their own lifestyles and behaviours (something which has been \nshown to be important in motivating PEB, Pilgrim et al. 2007). \n  \nThe results of this study add to the growing weight of evidence that consumer \nbehaviour, and the factors that influence it, varies across different types of PEB. \nExploring the differing types of GER, consumers were less affected by feelings of \nresponsibility in their leisure and travel activities even though there was a correlation \nwith the attitude statement that „Consumers can help reduce the impact of climate change \nif they can change what they buy on a regular basis’. This resonates with Becken (2007) \nwho found that, when discussing individual responsibility for GHG emissions, tourists \nwere more likely to consider environmental factors in their every day life activities and \ndecision making as opposed to when undertaking a more „extraordinary‟ activity or \ndecision to travel: “The value of freedom to travel is firmly established in the minds of \nmany tourists and limiting travel is considered unacceptable by the (hyper) mobile \ntourists who participated in this research”. Similarly, McDonald  et al. (2006) identified \na consumer segment of „Exceptors‟ who sought to make sustainability orientated changes \nto their lifestyles, but who kept specific types of behaviour outside this decision \nframework (particularly foreign travel and car use).  \n \nThrough focus group research, Niva and Timonen (2008) uncovered that \nconsumers perceived their own opportunities to influence the product-oriented market as \n  \n29 \n \nsmall; rather they attributed the responsibility to product manufacturers. Realising an \nelement of control over „extraordinary‟ consumption habits, such as travel is therefore a \nkey challenge in incorporating such behaviours within consumer perceptions of their own \nsphere of influence and responsibility. It also raises interesting questions about whether \nconsumers feel responsible for a choice they make in a supermarket aisle or in their own \nkitchen, but would not feel in any way responsible for the fact that an aircraft they were \nsitting in was flying. This could be an interesting focus for further research. \n \n This exploratory study has the key advantages compared to many other studies of \nemploying a multi-dimensional approach to PEB and employing a relatively large sample \nsize (for example, Kaiser and Schimoda (1999) surveyed 445 people; and Van Kenhove \net al.‟s (2001) study had a sample of 286). Its use of the GER score also provides a novel \napproach to approximating the net environmental impacts of domestic consumption \nbehaviour which could be developed further. It generated some interesting if tentative \nfindings, which open up avenues for further research on the topic of responsibility (and in \nparticular in terms of consumer responsiveness to environmental issues when they hold \nothers more responsible than themselves) - an issue that until now has been largely \noverlooked in the literature.   \n \nThe findings however need to be considered in the light of the study‟s limitations, \nparticularly those linked to the roots of the data collection process in a business-focussed \nsurvey that was not designed for purely academic research. Furthermore, this survey \nshares a limitation that is widespread within green consumer research of relying on self-\n  \n30 \n \nreported behaviours or behavioural intentions rather than measuring actual behaviour \n(Follows and Jobber, 2000). In view of the frequently reported gap between attitudes and \nbehaviour (Vermeir and Verbeke, 2006, Zaccaï, 2006) it is important to attempt to \ndevelop direct or indirect measures that assess behaviour, to overcome the reporting of \nsocially desirable answers or tendencies to over-estimate PEB (Vinning and Ebreo, \n2002).  In relation to this study, an avenue for future research would be to seek to \nresearch the influence of perceived consumer responsibility in relation to climate change \ncauses and solutions on actual PEBs. \n \nA key implication of this research is that there is unquestionably a perception of a \nshared responsibility for dealing with climate change amongst consumers. This could \ncreate opportunities for companies, governments and NGOs to develop strategies and \npartnership which build on this and which could perhaps benefit from complementary \nrelationships about their varying responsibilities and resources for tackling climate \nchange. Halpern and Bates (2004) suggest that co-production and a sense of partnership \nbetween state, individuals and communities should succeed in increasing notions of \npersonal responsibility in areas such as climate change, amongst others. Consequently, \nsince the majority of survey respondents felt that Central Government should be \nresponsible for leading on a solution for climate change, despite low trust in them; this \ntherefore implies that there is an opportunity for government to further cooperate with \nNGOs and Businesses, along the lines of the „New Social Compact‟ outlined by \nBrugmann and Prahalad (2007) in increasing notions of personal consumer responsibility. \nEffectively communicating such developments to consumers in such a way that \n  \n31 \n \nencourages them to take responsibility for changing their behaviours will be an important \nfuture challenge for commercial and social marketers alike.  \n \n \n  \n32 \n \nReferences \n \nAjzen, I. (1991),  “The Theory of Planned Behavior”, Organizational Behavior and \nHuman Decision Processes, Vol. 50, pp. 179-211. \n \nAjzen, I. and Fishbein, M. (1980), Understanding Attitudes and Predicting Social \nBehaviour. Englewood Cliffs, NJ: Prentice-Hall Inc \n \nAnable, D. J., Lane, B. and Kelay, T. (2006),  A Review of Public Attitudes to Climate \nChange and Transport Behaviour. London: Department for Transport. \n \nAnderson, W. T. and Cunningham, W. H. (1972), “The Socially Conscious \nConsumer”, Journal of Marketing, Vol. 36, pp. 23-31. \n \nArmitage, C.J. and Conner, M. (2001), “Efficacy of the Theory of Planned \nBehaviour:  A Meta-analytic Review”. British Journal of Social Psychology, Vol 40, \npp. 471-499. \n \nAttell-Thompson, L.M. (2005), “Consumer Directed Health Care: Ethical Limits to \nChoice and Responsibility”, The Journal of Medicine and Philosophy, Vol 3, No 2, \npp. 207 -226. \n \nBagozzi, R., Gürnao-Canli, Z. and Priester, J. (2002). The Social Psychology of \nConsumer Behaviour. Buckingham: Open University Press. \n \nBamberg, S. and Schmidt, P. (2003). “Incentives, morality, or habit?: Predicting \nstudents‟ car use for university routes with the models of Ajzen, Schwartz, and \nTriandis.” Environment and Behavior, Vol. 35, No. 2, pp. 264-285. \n \nBarnett, C., Clarke, N., Cloke, P. and Malpass, A. (2005), “The Politics of Ethical \nConsumerism: Citizenship Between Individualisation and Participation”, Consumer \nPolicy Review, Vol. 15, No. 2, pp. 45–51. \n \nBarr, S. (2007), “Factors Influencing Environmental Attitudes and Behaviors: A U.K. \nCase Study of Household Waste Management”, Environment and Behavior. Vol. 39, \npp. 435-473. \n \nBecken, S. (2007), “Tourists' Perception of International Air Travel's Impact on the \nGlobal Climate and Potential Climate Change Policies”, Journal of Sustainable \nTourism, Vol. 15, No. 4, pp. 351-368. \n \nBerkowitz, L. and Daniels, L. R. (1963), “Responsibility and Dependency”, Journal \nof Abnormal and Social Psychology, Vol. 66, No. 5, pp. 429-436. \n \nBerkowitz, L. and Lutterman, K. G. (1968), “The Traditional Social Responsible \nPersonality”. Public Opinion Quarterly, Vol. 32 (Summer), pp. 169-185. \n  \n33 \n \n \nBickman, L. (1972), “Environmental Attitudes and Actions.” Journal of Social \nPsychology, Vol. 87, No. 2. pp. 323-324.  \n \nBlack, J.S., Stern, P.C. and Elworth, J.T. (1985), “Personal and Contextual Influences \non Household Energy Adaptations”, Journal of Applied Psychology, Vol. 70, No. 1, \npp. 3-21. \n   \nBricas, N. (2008), “Consumer Expectations and Responsibility\/Attentes et \nR Consommateurs”, OCL Oleagineux Corps Gras Lipides, Vol. 15, \nNo. 2, pp.142 -144. \nBrinkmann, J. and Peattie, K. (2008), “Consumer Ethics Research: Reframing the \nDebate about Consumption for Good”. Electronic Journal of Business Ethics and \nOrganisation Studies, Vol. 13, No. 1, pp. 22-31 \nBrugmann, J. and Prahalad, C. (2007), “Cocreating Business's New Social Compact”. \nHarvard Business Review, Vol. 85, No. 2, pp. 80-90. \n \nCarrigan, M. and Attalla, A. (2001), “The Myth of the Ethical Consumer- Do Ethics \nMatter in Purchase Behaviour?” Journal of Consumer Marketing, Vol. 18, No. 7, pp. \n560-578. \n \nCaruana, R. and Crane, A. (2008), “Constructing Consumer Responsibility:  \nExploring the Role of Corporate Communications”.  Organization Studies, Vol. 29, \nNo. 12, pp. 1495-1519. \n \nCorraliza, J.A. and Berenguer, J. (2000), “Environmental Values, Beliefs and \nActions: A Situational Approach”,  Environment and Behavior. Vol. 32, pp. 832-848. \n \nDiamantopoulos, A., Schlegelmilch, B.B., Sinkovics, R.R. and Bohlen, G.M. (2003), \n“Can Socio-Demographics Still Play a Role in Profiling Green Consumers? A \nReview of the Evidence and an Empirical Investigation”, Journal of Business \nResearch, Vol. 56, pp.465–480. \n \nDickinson, R., Carsky, M. (2005), \"The Consumer as Voter: An Economic \nPerspective on Ethical Consumer Behavior\", in Harrison, R., Newholm, T., Shaw, D. \n(Eds),The Ethical Consumer, Sage, London, pp.25-38. \n \nDowning, P. and Ballantyne, J. (2007), Tipping Point or Turning Point? Social \nMarketing & Climate Change, London: IPSOS MORI. \nFoxall, G. (2002). “Marketing's Attitude Problem - And How to Solve It”. Journal of \nCustomer Behavior, Vol. 1, pp. 19-48.  \n  \n34 \n \nFollows, S.B. and Jobber D. (2000),  “Environmentally Responsible Purchase \nBehaviour: A Test of a Consumer Model”, European Journal of Marketing. Vol.34, \npp. 723-46 \n \nFraj, E. and Martinez, E. (2007),  “Ecological Consumer Behaviour: An Empirical \nAnalysis”. International Journal of Consumer Studies, Vol. 31, pp. 26-33. \n \nGabriel, Y. and Lang, T., (1995). The unmanageable consumer: contemporary \nconsumption and its fragmentation, London: Sage \n \nGiles, M. and Cairns, E. (1995), “Blood Donation and Ajzen‟s Theory Of Planned \nBehaviour:  An Examination of Perceived Behavioural Control”. British Journal of \nSocial Psychology, Vol 34, No 2, pp. 173-188.  \n \nGrob, A. (1995), “A Structural Model of Environmental Attitudes and Behavior”. \nJournal of Environmental Psychology, Vol. 15, No. 3, pp. 209-220. \n \nHahn, M., Lawson, R. and Lee, T.G. (1992), “The Effects of Time Pressure and \nInformation Load on Decision Quality”,  Psychology & Marketing, Vol 9, No 5, pp. \n365-378. \n \nHalpern, D. and Bates, C. (2004), Personal Responsibility and Changing Behaviour: \nthe state of knowledge and its implications for public policy. London: Prime \nMinister‟s Strategy Unit \n \nHansla, A., Gamble, A., Juliusson, A. and Gärling, T. (2008), “The Relationships \nBetween Awareness of Consequences, Environmental Concern and Value \nOrientations”,  Journal of Environmental Psychology, Vol. 28, No 1, pp. 1-9. \n \nHarrison, R., Newholm, T. and Shaw, D. (2005), “Introduction”, in Harrison, R., \nNewholm, T., Shaw, D. (Eds), The Ethical Consumer, Sage, London, pp.25-38. \n \nHerring, H. (1999). “Does Energy Efficiency Save Energy? The Debate and its \nConsequences”, Applied Energy Vol. 63, pp. 209-226. \n \nHopper, J.R. and Neilsen, J.M. (1991). “Recycling as Altruistic Behavior: Normative \nAnd Behavioral Strategies To Expand Participation in a Community Recycling \nProgram.” Environment and Behavior, Vol. 23, No. 2, pp.195-220. \n \nJackson, T. (2005), Motivating sustainable consumption: a review of evidence on \nconsumer behaviour and behavioural change. Sustainable Development Research \nNetwork. \n \nJacoby, J. (1984), “Perspectives on Information Overload”, Journal of Consumer \nResearch. Vol. 10, pp. 432-435. \n \n  \n35 \n \nJenkins, H.  (2009), “A „Business Opportunity‟ Model of Corporate Social \nResponsibility for Small- and Medium-Sized Enterprises”. Business Ethics, Vol. 18, \nNo. 1, pp. 21-36. \n \nKaiser, F. G. and Schimoda, T. A. (1999), “Responsibility as a Predictor Of \nEcological Behaviour”.  Journal of Environmental Psychology, Vol. 19, pp. 243-253. \n \nKilbourne, W.E. Beckmann, S.C. (1998), “Review and Critical Assessment of \nResearch on Marketing and the Environment”, Journal of Marketing Management. \nVol. 14, pp. 513-532. \n \nKinnear, T.C. Taylor, J.R. and Ahmed, S.A. (1974), “Ecologically Concerned \nConsumers: Who Are They?”, Journal of Marketing, Vol. 38, No. , pp. 20-24. \n \nLaroche, M., Bergeron. J. and Barbaro-Forleo, G. (2001). “Targeting Consumers who \nare Willing to Pay More for Environmentally Friendly Products”,  Journal of  \nConsumer Marketing, Vol. 18, No. 6, pp. 503-20 \n \nLenzen, M. (2008), “Consumer and Producer Environmental Responsibility: A \nReply”. Ecological Economics, Vol. 66, pp. 547-550. \n \nMcDonald S, Oates C, Alevizou PJ, Young W, Hwang K. (2006), “Communication \nStrategies for Sustainable Technologies: Identifying Patterns in Consumer \nBehaviour”. In Integration and Communication: A Clear Route to Sustainability? \nProceedings of 13\nth\n Greening of Industry Network Conference. Cardiff.  \n \nMoisander, J. (2007), “Motivational Complexity of Green Consumerism”, \nInternational Journal of Consumer Studies, Vol. 31, No.4, pp. 404-409. \n \nMunksgaard, J., Pedersen, K.A. and Wier, M. (2000). “Impact of Household \nConsumption on CO2 Emissions”. Energy Economics. Vol. 22, pp.423-440.  \n \nNiva, M., Timonen, P., (2008). “The Role of Consumers in Product-Oriented \nEnvironmental Policy: Can the Consumer be the Driving Force for Environmental \nImprovements?” International Journal of Consumer Studies, Vol. 25, No. 4,  pp. \n331 – 338. \n \nOom Do Valle, P.,  Rebelo, E., Reis, E. and Menezes, J. (2005), “Combining \nBehavioural Theories to Predict Recycling Involvement”, Environment and Behavior, \nVol. 37, No. 3, pp. 364-396 \n \nPeng, M. (2009), “Current Debates in Global Strategy”. International Journal of \nManagement Reviews, Vol. 11, No. 1, pp. 51-68. \n \n  \n36 \n \nPepper, M., Jackson, T. and Uzzell, D. (2009). “An Examination of the Values That \nMotivate Socially Conscious and Frugal Consumer Behaviours”, International \nJournal of Consumer Studies. Vol. 33, pp.126-136. \n \nPeters, M. (2005),  “CSR is a Consumer Concern”. Consumer Policy Review, Vol. 15, \nNo. 2, pp. 36-37. \n \nRobinson, R. and Smith, C. (2002), “Psychosocial and Demographic Variables \nAssociated with Consumer Intention to Purchase Sustainably Produced Foods as \nDefined by the Midwest Food Alliance”, Journal of Nutrition and Education \nBehavior, Vol. 34, pp.316-325. \n \nRodrigues, J. and Domingos, T. (2008), “Consumer and Producer Environmental \nResponsibility:  Comparing Two Approaches”. Ecological Economics, Vol. 66, pp. \n533-546. \n \nSchlegelmilch, B., Bohlen, G. and Diamantopoulos, A. (1996),  ”The Link Between \nGreen Purchasing Decisions and Measures of Environmental Consciousness”, \nEuropean Journal of Marketing, Vol. 30, No. 5, pp 35-55. \n \nSchwartz, S. H. (1968), “Words, Deeds and the Perception of Consequences and \nResponsibility in Action Situations”. Journal of Personality and Social Psychology, \nVol. 10, pp. 232-242. \n \nSchwartz, S. H. (1977), “Normative Influences on Altruism”, In: Berkowitz, L. ed. \nAdvances in experimental social psychology. Vol. 10. New York: Academic Press, \npp. 221-279. \n \nShaw, D. and Clarke, I. (1999), “Belief Formation in Ethical Consumer Groups: An \nExploratory Study”, Marketing Intelligence & Planning, Vol. 17, No. 2, pp. 109-119. \n \nSheeran, P. (2002), “Intention-Behavior Relations:  A Conceptual and Empirical \nReview”,  European Review of Social Psychology, Vol. 12, pp. 1-36.  \n \nSpangenberg, J. and Lorek, S. (2002), “Environmentally Sustainable Household \nConsumption: From Aggregate Environmental Pressures to Priority Fields of Action”, \nEcological Economics, Vol. 43, pp.127-140. \n \nStern, P.C., Dietz, T., Abel, T, Guagnano, G.A. and Kalof, L. (1999), “A Value-\nBelief-Norm Theory of Support for Social Movements: The Case of Environmental \nConcern”. Human Ecology Review, 6, pp.    \n \nStern, P. C. (2000), “Toward a Coherent Theory of Environmentally Significant \nBehaviour”. Journal of Social Issues, Vol. 56, No. 3, pp. 407-424. \n \n  \n37 \n \nStern, N. (2006), The Economics of Climate Change:  The Stern Review. Cambridge: \nCambridge University Press, p. 692. \n \nStraughan, R.D. and Roberts, J.A. (1999). Environmental Segmentation Alternatives: \nA Look at Green Consumer Behaviour in the New Millennium”,  Journal of \nConsumer Marketing, Vol. 16, No. 6, pp. 558-75 \n \nSustainable Consumption Roundtable (2006). I Will If You Will: Towards Sustainable \nConsumption. London: Sustainable Development Commission and the National \nConsumer Council. \nSutton, S. (1998), “Predicting and Explaining Intentions and Behavior:  How Well are \nWe Doing?” Journal of Applied Social Psychology, Vol. 28, No. 15, pp. 1317-1338.  \nTeisl, M. F., Rubin, J. and Noblet, C.L.  (2008). “Non-Dirty Dancing? Interactions \nBetween Eco-Labels and Consumers”, Journal of Economic Psychology, Vol. 29, No. \n2, pp. 140-159. \n \nTerry, D.J. and O‟Leary, J.E. (1995), “The Theory of Planned Behaviour:  The \nEffects of Perceived Behavioural Control and Self-Efficacy. British Journal of Social \nPsychology, Vol 34, No 2, pp. 199-220. \n \nTucker, L. R., Dolich, I.J. and Wilson, D.T. (1981), “Profiling Environmentally \nResponsible Consumer-Citizens”. Journal of the Academy of Marketing Science, Vol. \n9, No. 4, pp. 454-478. \n \nTucker P,  and Speirs D. (2003), “Attitudes and Behavioral Change In Household \nWaste Management Behaviors”, Journal of  Environmental Planning and \nManangement, Vol. 46, pp. 289–307 \n \nVan Kenhove, P, Vermeir, I and Verniers, S. (2001), “An Empirical Investigation of \nthe Relationships between Ethical Beliefs, Ethical Ideology, Political Preference and \nNeed for Closure”, Journal of Business Ethics, Vol. 32, No. 4, pp. 347-361. \n \nVermeir, I. and Verbeke, W. (2006), “Sustainable Food Consumption: Exploring The \nConsumer Attitude-Behavioral Intention Gap”. Journal of Agricultural and \nEnvironmental Ethics, Vol. 19, No. 2,  pp. 169-194. \n \nVinning, J. and Ebreo, A. (2002), “Emerging Theoretical and Methodological \nPerspectives on Conservation Behavior”. In: Bechtel, R. and Churchman, A. eds. New \nHandbook of Environmental Psychology.  New York: Wiley, pp. 541-558. \n \nWebster, F. E. (1975), “Determining the Characteristics Of The Socially Conscious \nConsumer”. Journal of Consumer Research, Vol.  2, No. 3, pp. 188-196. \n \n  \n38 \n \nWilliams, A. (2005), “Consumer Social Responsibility?” Consumer Policy Review, \nVol. 15, No. 2, pp. 34-35. \n \nWorld Resource Institute (2005), Ecosystems and Human Well-being: Synthesis \nReport (Millennium Ecosystem Assessment), Island Press, Washington, DC. \n \nWray-Lake, L., Flanagan, C.A and Osgood, D.W. (2010), “Examining Trends in \nAdolescent Environmental Attitudes, Beliefs and Behaviors Across Three Decades, \nEnvironment and Behavior, Vol. 42, No. 1, pp. 61-85 \n \nYates, L. (2009), Green expectations: Consumers’ understanding of green claims in \nadvertising, Consumer Focus: London \n \nZaccaï, E. (2006), “Assessing the Role of Consumers in Sustainable Product \nPolicies”, Environment, Development and Sustainability, Vol. 10, No. 1, pp. 51-67 \n \n  \n39 \n \nTable One:  GER by socio demographic factors:  Age, Education, Sex and Social \nClass \n \n Mean Score \n GER Leisure \nGER \nPurchasing \nGER \nHousehold \nGER \nTravel \nGER \nAge \n16-34 14.63 -.10 1.14 13.43 -.37 \n35-54 15.53 -.38 1.07 15.25 -1.27 \n55-64 17.69 -.36 1.82 16.13 -.82 \n65+ 19.80 .37 1.53 17.31 .60 \nEducation \n5 grade C GCSEs (or equivalent) or \nless \n15.41 .00 .15 15.02 -.17 \nMore than 5 grade C GCSEs (or \nequivalent) \n15.20 -.20 .52 14.87 -.62 \nA levels\/ AS levels\/Scottish \nHighers\/NVQ levels 3 or 4 \n15.68 -.21 .92 14.92 -.62 \nUndergraduate degree or equivalent 16.89 -.40 1.84 15.36 -.78 \nPostgraduate degree or equivalent 18.09 -.13 3.19 15.19 -.81 \nProfessional qualification 18.32 .14 2.55 15.93 -.60 \nSex \nMale 14.09 -.30 -.06 14.76 -1.12 \nFemale 18.41 .00 2.51 15.56 -.05 \nSocial Class \nA 16.19 -.24 1.22 15.50 -.98 \nB 17.28 -.49 2.03 16.00 -1.32 \nC1 16.49 -.15 1.39 15.22 -.56 \nC2 14.73 -.50 .72 14.71 -1.16 \nD 14.32 -.07 -.30 14.54 -.35 \nE 17.81 .63 1.67 14.76 1.03 \nRegion \nScotland 13.38 -.75 .82 13.97 -1.42 \nYorkshire & Humberside 14.36 -.21 .50 14.75 -.89 \nNorth East 13.90 -.65 -.27 15.62 -1.44 \nNorth West 15.81 -.06 1.65 14.87 -.71 \n  \n40 \n \nEast Midlands 18.44 -.10 2.20 16.65 -.41 \nWest Midlands 15.92 -.15 1.42 15.17 -.67 \nEast of England 18.67 .05 2.19 16.59 -.11 \nSouth East 16.04 -.04 1.11 15.34 -.40 \nSouth West 14.69 .-.54 1.04 14.51 -.87 \nLondon 15.91 .49 .88 14.47 .56 \nWales 18.37 .08 3.11 15.68 -.43 \n \n  \n41 \n \nTable Two: responsibility orientation and overall GER score segmented by Sex and \nAge \n \n \nN\nu\nm\nb\ner\n o\nf \nre\nsp\no\nn\nd\nen\nts\n \nM\nea\nn\n G\nE\nR\n \nM\nA\nL\nE\n \nF\nE\nM\nA\nL\nE\n \nA\nG\nE\n G\nR\nO\nU\nP\n 1\n6\n-3\n4\n \nA\nG\nE\n G\nR\nO\nU\nP\n 3\n5\n-5\n4\n \nA\nG\nE\n G\nR\nO\nU\nP\n 5\n5\n-6\n4\n \nA\nG\nE\n G\nR\nO\nU\nP\n 6\n5\n+\n \nN\nu\nm\nb\ner\n o\nf \nre\nsp\no\nn\nd\nen\nts\n \nM\nea\nn\n G\nE\nR\n \nN\nu\nm\nb\ner\n o\nf \nre\nsp\no\nn\nd\nen\nts\n \nM\nea\nn\n G\nE\nR\n \nN\nu\nm\nb\ner\n o\nf \nre\nsp\no\nn\nd\nen\nts\n \nM\nea\nn\n G\nE\nR\n \nN\nu\nm\nb\ner\n o\nf \nre\nsp\no\nn\nd\nen\nts\n \nM\nea\nn\n G\nE\nR\n \nN\nu\nm\nb\ner\n o\nf \nre\nsp\no\nn\nd\nen\nts\n \nM\nea\nn\n G\nE\nR\n \nN\nu\nm\nb\ner\n o\nf \nre\nsp\no\nn\nd\nen\nts\n \nM\nea\nn\n G\nE\nR\n \nQ Who do you see as most responsible for causing climate change? \nMe as an \nindividual \n331 21.8 134 19.1 197 22.6 115 20 121 19.9 45 24.7 50 26.3 \nOther \nindividuals \n295 21.3 113 19.3 182 22.5 112 18.5 107 20.3 37 26.2 39 27.2 \nPrivate \nIndustry \n963 17.7 447 15.5 516 19.6 310 15.6 324 16.9 138 18.7 191 21.5 \nCentral\/Local \nGovernment \n454 18.2 212 15.7 242 20.4 145 16.4 166 17.31 63 18.8 80 22.7 \nNGOs\/Not for \nprofit \norganisations \n81 21.2 35 20.5 46 21.6 33 19.3 28 19.8 8 17.3 12 32.1 \nLocal \ncommunity \ngroups \n81 21.0 32 22.0 49 20.4 35 18.8 26 20.3 9 18.1 11 32.2 \nDeveloping \ncountries \n748 17.4 368 15.2 380 19.6 196 15.2 248 16.2 122 18.6 182 20.6 \nOther 133 13.2 84 10.9 49 17.1 33 12.3 42 12.8 26 12.7 32 14.9 \nDon‟t know 196 12.9 63 10.4 133 14.1 86 11.8 66 11.7 22 19.5 22 14 \nQ Whose responsibility do you think it is to tackle climate change? \nMe as an \nindividual \n834 16 368 17.7 466 21.3 269 16.9 301 19 118 21.5 146 25.1 \nOther 703 15.9 305 18.0 398 21.0 240 17.3 253 18.6 98 22.1 112 25.3 \n  \n42 \n \nindividuals \nPrivate \nIndustry \n916 18.4 410 16.2 506 20.2 228 16.3 320 17.2 132 19.8 176 23 \nCentral\/Local \nGovernment \n1080 17.4 506 15.3 574 19.2 330 15.6 374 16.2 155 18.7 221 21.3 \nNGOs\/Not for \nprofit \norganisations \n558 16.1 246 18.7 312 21.3 194 17.3 199 20.1 79 22.5 86 24.5 \nLocal \ncommunity \ngroups \n571 16 256 18.9 315 21 197 17.5 203 19.7 80 21.7 91 24.8 \nDeveloping \ncountries \n869 16.5 415 16.3 454 20.4 251 16.4 299 17.3 127 20.4 192 21.6 \nOther 175 15.8 86 13.4 89 18.0 51 15.8 60 14.3 36 15.8 28 18.6 \nDon‟t know 152 15.3 64 5.5 88 12.1 65 8.8 50 7.4 19 12.1 18 13.2 \n \n  \n43 \n \nTable Three:  Pearson Correlations of GER and Responsibility Orientation \n \n GER Leisure \nGER \nPurchasing \nGER \nHousehold \nGER \nTravel \nGER \nWho do you see as most responsible for causing climate change? \nMe as an individual .186(**) .102(**) .183(**) .131(**) .074(**) \nOther individuals .177(**) .104(**) .174(**) .119(**) .082(**) \nPrivate Industry .170(**) .101(**) .127(**) .157(**) .093(**) \nCentral\/Local government .109(**) .073(**) .117(**) .067(**) .036 \nNGOs\/Not for profit organisations \n(e.g. Friends of the Earth) \n.083(**) .058(*) .086(**) 0.046 0.043 \nLocal community groups. .081(**) 0.039 .092(**) 0.044 0.027 \nDeveloping countries e.g. China, \nIndia \n.077(**) 0.009 0.023 .142(**) 0.005 \nOther -.072(**) -.071(**) -.057(*) -0.041 -.076(**) \nDon't know -.098(**) -.053(*) -.080(**) -.109(**) -0.005 \nWhose responsibility do you think it is to tackle climate change? \nMe as an individual -0.027 .117(**) .250(**) .213(**) .104(**) \nOther individuals -0.033 .090(**) .202(**) .186(**) .094(**) \nPrivate Industry .226(**) .123(**) .187(**) .187(**) .122(**) \nCentral\/Local government .172(**) .072(**) .141(**) .156(**) .072(**) \nNGOs\/Not for profit organisations \n(e.g. Friends of the Earth) \n-0.015 .080(**) .183(**) .181(**) .073(**) \nLocal community groups. -0.021 .096(**) .178(**) .175(**) .094(**) \nDeveloping countries e.g. China, \nIndia \n0.01 .053(*) .117(**) .204(**) .055(*) \nOther -0.014 -0.048 -0.019 0.014 -0.043 \nDon't know -0.025 -.096(**) -.125(**) -.167(**) -.083(**) \n**  Correlation is significant at the 0.01 level (2-tailed). \n*  Correlation is significant at the 0.05 level (2-tailed). \n \n \n  \n44 \n \nTable Four:  Pearson Correlations of GER and Attitude Statements \n \n GER Leisure \nGER \nPurchasing \nGER \nHousehold \nGER \nTravel \nGER \nI am concerned about the effects of \nclimate change \n-0.022 .245(**) .320(**) .275(**) .237(**) \nThe media is exaggerating the \npotential effects of climate change \n0.034 -.187(**) -.161(**) -.088(**) -.175(**) \nClimate change is largely caused by \nhuman activities \n0.005 .189(**) .167(**) .129(**) .161(**) \nClimate change has occurred many \ntimes in human history and it's part of \nthe natural shifting of the climate \n.054(*) -.127(**) -.088(**) -0.029 -.096(**) \nThe economic growth of developing \ncountries represents the greatest threat \nto the world's climate (China India \netc). \n0.015 0.044 .083(**) .112(**) 0.023 \nIt is too late to do anything about \nclimate change \n.055(*) -.073(**) -.147(**) -.213(**) -.061(*) \nAttempts to tackle climate change \nshould be coordinated at an \ninternational level to be successful \n-.067(**) .071(**) .141(**) .144(**) .076(**) \nThe Government should enforce more \nstrict environmental policies in order \nto prevent climate change \n0.006 .172(**) .238(**) .173(**) .159(**) \nOff-setting carbon emissions is a good \nway of reducing the effects of climate \nchange \n-0.023 .185(**) .144(**) .114(** .196(**) \nConsumers can help reduce the impact \nof climate change if they can change \nwhat they buy on a regular basis \n-0.021 .215(**) .324(**) .231(**) .177(**) \nThere is no point in trying to reduce \nemissions at an individual level \n0.027 -.140(**) -.254(**) -.276(**) -.137(**) \nI want financial incentives to take \naction on climate change \n0.029 -0.046 -.053(*) -0.041 -.059(*) \nI don't see why I should take action on \nclimate change if other people are not \n0.021 -.176(**) -.260(**) -.265(**) -.167(**) \nBusinesses should take the issue of -0.039 .174(**) .252(**) .255(**) .171(**) \n  \n45 \n \nclimate change more seriously \nBusinesses should send documents \nsuch as statements and policy \ndocuments electronically wherever \npossible \n-0.048 .127(**) .214(**) .216(**) .126(**) \nI want more information from \nbusinesses on what they are doing to \naddress climate change \n0.009 .244(**) .287(**) .207(**) .232(**) \nI trust companies to do the right thing \nwhen it comes to climate change \n0.027 0.024 -0.022 -0.011 0.024 \nI would switch my custom to \ncompanies that are working to reduce \nclimate change \n-0.027 .281(**) .386(**) .233(**) .236(**) \nI would rather companies took the \nchoice out of my hands by not \nstocking products that are damaging to \nthe environment \n-0.012 .121(**) .183(**) .132(**) .135(**) \nI would like more independent \nassurance of the claims made by \ncompanies about how they are tackling \nclimate change \n-0.041 .194(**) .263(**) .217(**) .176(**) \n**  Correlation is significant at the 0.01 level (2-tailed). \n*  Correlation is significant at the 0.05 level (2-tailed).\n  \n46 \n \nTable Five:  Regression Analysis of GER (only significant independent variables are \nincluded) \n \n B SE B β \nWho do you see as responsible for causing climate \nchange?:  Local Government \n-2.48 1.20 -.07* \nWhose responsibility do you think it is to tackle \nclimate change?:  Central Government \n-2.37 1.03 -.08* \nWhose responsibility do you think it is to tackle \nclimate change?:  Don‟t know \n-3.04 1.44 -.07* \nI am concerned about the effects of climate change 1.81 0.42 .15** \nClimate Change is largely caused by human activities -0.93 0.36 -.08** \nAttempts to tackle climate change should be \ncoordinated at an international level to be successful \n-.084 0.39 -.06* \nConsumer can help reduce the impact of climate \nchange if they can change what they buy on a regular \nbasis \n1.47 0.42 .11** \nThere is no point in trying to reduce emissions at an \nindividual level \n-0.96 0.36 -.08** \nI want financial incentives to take action on climate \nchange \n-0.92 0.28 -.08** \nI don‟t see why I should take action on climate \nchange if other people are not \n-1.60 0.35 -.13** \nI want more information from businesses on what \nthey are doing to address climate change \n1.04 0.41 .09** \nI would switch my custom to companies that are \nworking to reduce climate change \n2.77 0.43 .21** \n**  Correlation is significant at the 0.01 level. \n*  Correlation is significant at the 0.05 level. \n \n \n  \n47 \n \nTable Six:  Regression Analysis of GER Household Activities (only significant \nindependent variables are included) \n \n B SE B β \nWho do you see as responsible for causing climate \nchange?:  Local Government \n-1.53 0.57 -.10** \nWho do you see as responsible for causing climate \nchange?:  Developing countries e.g. China, India \n0.86 0.39 .07* \nI am concerned about the effects of climate change 0.63 0.20 .12** \nThe media is exaggerating the potential effects of \nclimate change \n0.29 0.15 .06* \nClimate change is largely caused by human activities -0.38 0.17 -.07* \nIt is too late to do anything about climate change -0.31 0.16 -.06* \nAttempts to tackle climate change should be \ncoordinated at an international level to be successful \n-0.39 0.18 -.07* \nThere is no point in trying to reduce emissions at an \nindividual level \n-0.53 0.17 -.10** \nI would switch my custom to companies that are \nworking to reduce climate change \n0.44 0.20 .08* \n**  Correlation is significant at the 0.01 level. \n*  Correlation is significant at the 0.05 level. \n \n \n  \n48 \n \nTable Seven:  Regression Analysis of GER All Travel (only significant independent \nvariables are included) \n \n B SE B β \nWho do you see as responsible for causing climate \nchange?:  NGOs\/Not for Profit organisations (e.g. \nFriends of the Earth) \n1.31 0.65 .08* \nWho do you see as responsible for causing climate \nchange?:  Don‟t Know \n0.80 0.37 .08* \nWhose responsibility do you think it is to tackle \nclimate change?:  Central Government \n-0.77 0.30 -.10* \nWhose responsibility do you think it is to tackle \nclimate change?:  Don‟t Know \n-1.09 0.42 -.09** \nI am concerned about the effects of climate change 0.38 0.12 .12** \nThe media is exaggerating the potential effects of \nclimate change \n-.23 0.09 -.08* \nIt is too late to do anything about climate change 0.20 0.10 .06* \nOff-setting carbon emissions is a good way of \nreducing the effects of climate change \n0.30 0.10 .09** \nI want financial incentives to take action on climate \nchange \n-0.22 0.08 -.07** \nI don‟t see why I should take action on climate \nchange if other people are not \n-0.28 0.10 -.09** \nI want more information from businesses on what \nthey are doing to address climate change \n0.46 0.12 .14** \nI would switch my custom to companies that are \nworking to reduce climate change \n0.29 0.13 .08* \n**  Correlation is significant at the 0.01 level. \n*  Correlation is significant at the 0.05 level. \n \n \n  \n49 \n \nTable Eight:  Regression Analysis of GER Purchasing Activities (only significant \nindependent variables are included) \n \n B SE B β \nWhose responsibility do you think it is to tackle \nclimate change?:  Me as an individual \n1.43 0.73 0.9* \nWhose responsibility do you think it is to tackle \nclimate change?:  Central Government \n-1.47 0.63 -.08* \nI am concerned about the effects of climate change 0.81 0.26 .11** \nClimate change is largely caused by human activities -0.60 0.22 -.08** \nConsumer can help reduce the impact of climate \nchange if they can change what they buy on a regular \nbasis \n1.09 0.26 .14** \nI want financial incentives to take action on climate \nchange \n-0.50 0.17 -.07** \nI don‟t see why I should take action on climate \nchange if other people are not \n-0.69 0.212 -.10** \nI would switch my custom to companies that are \nworking to reduce climate change \n2.04 0.26 .26** \n**  Correlation is significant at the 0.01 level. \n*  Correlation is significant at the 0.05 level. \n \n \n  \n50 \n \nTable Nine:  Regression Analysis of GER Leisure (only significant independent \nvariables are included) \n \n B SE B β \nWho do you see as responsible for causing climate \nchange?:  NGOs\/Not for Profit organisations (e.g. \nFriends of the Earth) \n1.02 0.44 .09* \nWhose responsibility do you think it is to tackle \nclimate change?:  Central Government \n-0.59 0.20 -.11** \nI am concerned about the effects of climate change 0.21 0.08 .10** \nThe media is exaggerating the potential effects of \nclimate change \n-0.14 0.06 -.07* \nI don‟t see why I should take action on climate \nchange if other people are not \n-0.20 0.07 -.09** \nI would switch my custom to companies that are \nworking to reduce climate change \n0.35 0.08 .15** \n**  Correlation is significant at the 0.01 level. \n*  Correlation is significant at the 0.05 level. \n \n"}