{"doi":"10.1063\/1.1488599","coreId":"97028","oai":"oai:generic.eprints.org:614\/core69","identifiers":["oai:generic.eprints.org:614\/core69","10.1063\/1.1488599"],"title":"The flow and solidification of a thin fluid film on an arbitrary three-dimensional surface","authors":["Myers, T. G.","Charpin, J. P. F.","Chapman, S. J."],"enrichments":{"references":[{"id":845055,"title":"A numerical and asymptotic study of some third-order ordinary differential equations relevant to draining and coating flows.","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":839516,"title":"Aircraft anti-icing and de-icing techniques and modelling,","authors":[],"date":"1996","doi":"10.2514\/3.47027","raw":null,"cites":null},{"id":846014,"title":"Alternating directions methods for three space variables.","authors":[],"date":"1962","doi":null,"raw":null,"cites":null},{"id":841493,"title":"An extension to the Messinger model for aircraft icing”","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":847355,"title":"Be´zier presentation of airfoils.","authors":[],"date":"1987","doi":null,"raw":null,"cites":null},{"id":839089,"title":"Cansdale Aircraft icing,","authors":[],"date":"2000","doi":"10.1098\/rsta.2000.0689","raw":null,"cites":null},{"id":846499,"title":"Contact line stability and ’undercompressive shocks’ in driven thin film flow.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":841637,"title":"Development of a new model of ice accretion on aircraft,","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":842970,"title":"Eley Role of surface tension gradients in correcting coating defects in corners.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":842753,"title":"Eres Simulation of coating layer evolution and drop formation on horizontal cylinders.","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":847559,"title":"Experimental and computational simulation of in-flight icing phenomena.","authors":[],"date":"1998","doi":"10.1016\/S0376-0421(98)80001-8","raw":null,"cites":null},{"id":843745,"title":"H-C Chang Drop formation during coating of vertical fibres.","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":842178,"title":"Higgins Rayleigh-Taylor instability in thin viscous films.","authors":[],"date":"1989","doi":null,"raw":null,"cites":null},{"id":839318,"title":"Ice accretion modelling.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":838769,"title":"Ice accretions on high-voltage conductors and insulators and related phenomena”","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":837331,"title":"Ice and snow accretion on structures,","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":841099,"title":"Ice and water film growth from incoming supercooled droplets,”","authors":[],"date":"1999","doi":"10.1016\/S0017-9310(98)00237-3","raw":null,"cites":null},{"id":837108,"title":"Long-scale evolution of thin liquid films.","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":847127,"title":"Makkonen Improved numerical model for wind turbine icing.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":840115,"title":"Mathematical model of the spray deposition process, Metallurgica Transactions 20A,","authors":[],"date":"1989","doi":"10.1007\/BF02647495","raw":null,"cites":null},{"id":843276,"title":"Modeling of coating flows on curved surfaces.","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":838512,"title":"Models for the growth of rime, glaze icicles and wet snow on structures”","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":841732,"title":"Nonlinear adjustment of a thin annular film of viscous fluid surrounding athread of another within a circular cylindrical pipe.","authors":[],"date":"1983","doi":null,"raw":null,"cites":null},{"id":843516,"title":"Nonlinear theory of strongly undulating thin films flowing down vertical cylinders.","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":844252,"title":"Numerical methods for conservation laws,","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":844602,"title":"Numerical partial differential equations: conservation laws and elliptic equations.","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":844485,"title":"Numerical partial differential equations: finite difference methods.","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":841966,"title":"On the motion of bubbles in capillary tubes.","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":844000,"title":"On the motion of fluid-fluid interface along a solid surface.","authors":[],"date":"1974","doi":null,"raw":null,"cites":null},{"id":841156,"title":"Raabe “Modelling of ice accretion on a non-rotating cylinder”","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":846291,"title":"Shock transitions in Marangoni gravity-driven thin-film flow.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":839737,"title":"Solidification of spray formed billets,","authors":[],"date":"1997","doi":"10.1007\/bf00049244","raw":null,"cites":null},{"id":839019,"title":"Swedish crash prompts clear-ice guidelines,","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":840856,"title":"The effect of induced air-flow on the spin coating of viscous liquids,”","authors":[],"date":"1987","doi":"10.1063\/1.339465","raw":null,"cites":null},{"id":838282,"title":"The growth and decay of ice.","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":845505,"title":"The method of fractional steps.","authors":[],"date":"1971","doi":null,"raw":null,"cites":null},{"id":842499,"title":"The thin liquid lining of a weakly curved cylindrical tube.","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":836901,"title":"Thin films with high surface tension.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":837538,"title":"Thompson Slowly accreting ice due to supercooled water impacting on a cold surface. Submitted to Phys. Fluids,","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":845299,"title":"Three-dimensional direct numerical simulation of surface-tension-gradient effects on the leveling of an evaporating multicomponent fluid.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":840603,"title":"Troian “Stabilizing the advancing front of thermally driven climbing films,”","authors":[],"date":null,"doi":"10.1006\/jcis.1998.5499","raw":null,"cites":null},{"id":840369,"title":"Troian A theoretical study of instabilities at the advancing front of thermally driven coating flows,","authors":[],"date":null,"doi":"10.1006\/jcis.1997.5018","raw":null,"cites":null},{"id":838054,"title":"U¨ber die Theorie der Eisbildung, insbesondere u¨ber die Eisbildung im Polarmeere.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":837822,"title":"U¨ber einige Probleme der Theorie der Wa¨rmeleitung.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":846699,"title":"Undercompressive shocks in thin film flows.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":844842,"title":"Unsteady spreading of thin liquid films with small surface tension.","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":846863,"title":"Water flow on accreting ice surfaces. Phd Thesis,","authors":[],"date":null,"doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-07-02","abstract":"A model for the flow of a thin film, with and without solidification, on an arbitrary three-dimensional substrate is presented. The problem is reduced to two simultaneous partial differential equations for the film and solid layer thicknesses. The flow model (with the solidification rate set to zero) is the first such model to describe thin film flow on an arbitrary three-dimensional surface. Various limits are investigated to recover previous models for flow on flat, cylindrical and two-dimensional curved surfaces. With solidification a previous model for accretion on a flat substrate is retrieved. It is shown how the model may be reduced to standard forms, such as solidification on a flat surface, circular and non-circular cylinders, aerofoils and spheres. Numerical solutions are obtained by combining an ADI scheme with a shock capturing method. Results are presented for flow and accretion on a flat surface, aerofoil and sphere","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/97028.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/614\/1\/arbsurf.pdf","pdfHashValue":"042acfbe0b8f7a3ed29db69515d0aaa8da78fa7c","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:614<\/identifier><datestamp>\n      2015-05-29T18:25:27Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4447:4D3736<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/614\/<\/dc:relation><dc:title>\n        The flow and solidification of a thin fluid film on an arbitrary three-dimensional surface<\/dc:title><dc:creator>\n        Myers, T. G.<\/dc:creator><dc:creator>\n        Charpin, J. P. F.<\/dc:creator><dc:creator>\n        Chapman, S. J.<\/dc:creator><dc:subject>\n        Fluid mechanics<\/dc:subject><dc:description>\n        A model for the flow of a thin film, with and without solidification, on an arbitrary three-dimensional substrate is presented. The problem is reduced to two simultaneous partial differential equations for the film and solid layer thicknesses. The flow model (with the solidification rate set to zero) is the first such model to describe thin film flow on an arbitrary three-dimensional surface. Various limits are investigated to recover previous models for flow on flat, cylindrical and two-dimensional curved surfaces. With solidification a previous model for accretion on a flat substrate is retrieved. It is shown how the model may be reduced to standard forms, such as solidification on a flat surface, circular and non-circular cylinders, aerofoils and spheres. Numerical solutions are obtained by combining an ADI scheme with a shock capturing method. Results are presented for flow and accretion on a flat surface, aerofoil and sphere.<\/dc:description><dc:date>\n        2002-07-02<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/614\/1\/arbsurf.pdf<\/dc:identifier><dc:identifier>\n          Myers, T. G. and Charpin, J. P. F. and Chapman, S. J.  (2002) The flow and solidification of a thin fluid film on an arbitrary three-dimensional surface.  Physics of Fluids, 14  (8).   pp. 2788-2803.  ISSN 1070-6631     <\/dc:identifier><dc:relation>\n        http:\/\/link.aip.org\/link\/?phf\/14\/002788<\/dc:relation><dc:relation>\n        10.1063\/1.1488599<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/614\/","http:\/\/link.aip.org\/link\/?phf\/14\/002788","10.1063\/1.1488599"],"year":2002,"topics":["Fluid mechanics"],"subject":["Article","PeerReviewed"],"fullText":"The flow and solidification of a thin fluid film on an\narbitrary three-dimensional surface\nT.G. Myers1, J.P.F. Charpin 2, S.J. Chapman3\nMay 30, 2007\nAbstract\nA model for the flow of a thin film, with and without solidification, on an arbitrary three-\ndimensional substrate is presented. The problem is reduced to two simultaneous partial\ndifferential equations for the film and solid layer thicknesses. The flow model (with the\nsolidification rate set to zero) is the first such model to describe thin film flow on an arbitrary\nthree-dimensional surface. Various limits are investigated to recover previous models for flow\non flat, cylindrical and two-dimensional curved surfaces. With solidification a previous model\nfor accretion on a flat substrate is retrieved. It is shown how the model may be reduced to\nstandard forms, such as solidification on a flat surface, circular and non-circular cylinders,\naerofoils and spheres. Numerical solutions are obtained by combining an ADI scheme with\na shock capturing method. Results are presented for flow and accretion on a flat surface,\naerofoil and sphere.\n1Dept of Mathematics and Applied Mathematics, University of Cape Town, Rondebosch 7701, South\nAfrica\n2Applied Mathematics and Computing Group, Cranfield University, MK43 0AL, UK\n3OCIAM, University of Oxford, Oxford OX1 3LB, UK\n1\n1 Introduction\nThe flow of a thin fluid film with a single free surface has been the subject of intense\ninvestigation for a number of years, see [1, 2] for example. Recently a new level of complexity\nhas been added to the problem by coupling the flow to a solidification model. Poots [3] has\nstudied the steady flow of a water layer on an ice surface forming on a cylindrical power\ncable. Myers et al [4] study the unsteady flow of a solidifying fluid layer on a flat substrate,\nwith the primary motive of predicting ice accretion on aircraft. The purpose of the current\npaper is to generalise such models. In the following a model will be developed to predict\nthe flow and solidification of a thin fluid layer on an arbitrary three-dimensional surface. By\nsetting the solid thickness to zero a general thin film flow model is obtained. This is the first\ngeneral, three-dimensional curvilinear thin film flow model in the published literature.\nThe primary motivation for this work is the prediction of ice shapes on structures and\naircraft. Ice accretion has been modelled for many years, following the pioneering work of\nStefan [5, 6]. An informative account of structural icing may be found in Poots [3]. Lock\n[7] deals with numerous forms of icing, including structural and in-flight. Structural icing is\nof particular interest in the US and Canada following the ‘Great Ice Storm’ of 1998 which\ncaused billions of dollars of damage to power transmission and communication networks [8,\n9]. Ice accretion has been shown to be the prime cause of a number of in-flight incidents and\ncrashes and is therefore of ongoing concern to aircraft manufacturers throughout the world\n[10, 13]. The work described in Myers et al is currently being used in a commercial aircraft\nicing code, ICECREMO [11, 12] . An overview of aircraft icing may be found in [10, 11, 13].\nOther processes involving the solidification of a thin flowing liquid layer include coating and\nspray forming. Coating has a vast number of applications, a number of references may be\nfound in [1]. Spray forming, where an object is formed by the continual deposition of a fine\nspray, is studied in [14, 15].\nStructural and aircraft icing typically occurs when supercooled droplets from clouds,\nfreezing rain or drizzle impact on a cold surface. In very cold conditions the droplets freeze\nalmost instantaneously to form rime ice. In this situation the ice growth rate is proportional\n2\nto the amount of fluid impacting at each point, known as the ‘catch’ or ‘collection efficiency’.\nRime ice accretion is relatively well understood. In milder conditions a proportion of the\nimpacting fluid can remain liquid for some time. This leads to glaze ice accretion. Since\nglaze accretion involves a liquid layer flowing on top of the ice surface, glaze ice shapes are\nsignificantly more difficult to predict than rime ice and consequently poorly understood.\nIn the following section, §2, the accretion and flow model is derived. Since the flow is\nthe most complicated part of the model this is dealt with first in §2.2. The approximation\nemployed to derive the flow model is not the standard lubrication approximation which\nrequires both the square of the aspect ratio, ²2, and the reduced Reynolds number, ²2Re, to\nbe small. In the following terms of O(², ²2Re) will be neglected. This is not a significant\nrestriction to lubrication theory since for many practical applications ²2Re > ² and so the\nleading order result is not affected. On the other hand, the derivation and expressions for\nfluid flux and velocities are significantly simplified by this approach. Dry accretion is dealt\nwith in §2.3.1. Wet accretion, which must be coupled to the flow model, is dealt with in\n§2.3.2. In §3 the model is reduced to standard geometries: flat surface, cylinder and sphere.\nNumerical results are presented for each of these situations and also accretion on an aerofoil\nin §4.\n2 Governing equations for fluid flow and solidification\n2.1 Non-dimensionalisation\nThe following derivation is in non-dimensional form, all variables are defined in the Nomen-\nclature section. The non-dimensional variables are related to their dimensional counterparts\n(which are denoted by overbars) as follows:\ns1 = Ls1 s2 = Ls2 η = Hη = ²Lη\nu = Uu v = Uv w = ²Uw\np = Pp t = τt W = WW\nT = (T f − T s)T + T s ,\n3\nwhere H and L represent height and length-scales. Note, this means that the dimensional\nco-ordinates must have the dimension of length. Care should be taken when the natural\nparameterisation involves an angle, for example in cylindrical co-ordinates s1 = θ is an\nobvious choice, but the correct choice in the current theory is the arc-length, s1 = Rθ. The\naspect ratio ² = H\/L¿ 1. The time-scale\nτ =\nρfH\nρaW\n(1)\nis determined by the rate at which fluid enters the system. In situations where there is no\nfluid impacting at the free surface, ρaW = 0, the time-scale should be chosen according to\nthe driving forces for the flow. However, the following theory remains the same. The local\nvelocity of the droplets in the air is denoted W, this is scaled with a typical value W , the\nfluid velocity scale U = L\/τ .\n2.2 Fluid flow\nFigure 1 near here\nThe problem configuration is shown on Figure 1. Incoming fluid impacts on the substrate.\nAn accretion layer of thickness b forms, on top of this a thin fluid film of thickness h may be\npresent. The accretion temperature is denoted T , the fluid temperature χ. The substrate\nis defined by r = R(s1, s2), where (s1, s2) are orthogonal surface co-ordinates. Provided the\naccretion or fluid layer is thin, a point in the accretion or fluid layer may be defined by\nr = R(s1, s2) + ²ηn(s1, s2) , (2)\nwhere ² ¿ 1 is the aspect ratio, η is the co-ordinate orthogonal to the substrate and n is\nthe unit normal. To determine the derivatives in the governing equations the scaling factors\nh1, h2, h3 must first be determined. These are defined as\nh21 =\n∂r\n∂s1\n· ∂r\n∂s1\n= E(1− ²ηκ1)2 , (3)\nh22 =\n∂r\n∂s2\n· ∂r\n∂s2\n= G(1− ²ηκ2)2 , (4)\nh23 =\n∂r\n∂η\n· ∂r\n∂η\n= ²2 , (5)\n4\nwhere the first fundamental forms are\nE =\n∂R\n∂s1\n· ∂R\n∂s1\nF =\n∂R\n∂s1\n· ∂R\n∂s2\n= 0 G =\n∂R\n∂s2\n· ∂R\n∂s2\n,\nand F = 0 since (s1, s2) are orthogonal. The curvatures are defined as\nκ1 = −∂R\n∂s1\n· ∂n\n∂s1\n(\n∂R\n∂s1\n· ∂R\n∂s1\n)−1\n=\n∂2R\n∂s12\n· n\n(\n∂R\n∂s1\n· ∂R\n∂s1\n)−1\n=\nL\nE\n(6)\nκ2 = −∂R\n∂s2\n· ∂n\n∂s2\n(\n∂R\n∂s2\n· ∂R\n∂s2\n)−1\n=\n∂2R\n∂s22\n· n\n(\n∂R\n∂s2\n· ∂R\n∂s2\n)−1\n=\nN\nG\n. (7)\nThe second fundamental forms are\nL = n · ∂\n2R\n∂s12\nM = n · ∂\n2R\n∂s1s2\n= 0 N = n · ∂\n2R\n∂s22\n,\nwhere M = 0 since (s1, s2) are geodesic co-ordinates. In deriving (6), (7) and M = 0 the\nderivatives of\n∂R\n∂s1\n· n = 0 = ∂R\n∂s2\n· n\nwith respect to s1 and s2 have been used.\nWith the standard lubrication approximation, as well as neglecting terms of order ²κ,\nthe components of the Navier-Stokes equation may now be written as\n∂2u\n∂η2\n=\n1\nE1\/2\n∂p\n∂s1\n−Bg · e1 +O\n(\n², ²2Re\n)\n, (8)\n∂2v\n∂η2\n=\n1\nG1\/2\n∂p\n∂s2\n−Bg · e2 +O\n(\n², ²2Re\n)\n, (9)\n∂p\n∂η\n= ²Bg · n+O\n(\n², ²2Re\n)\n, (10)\nwhere the scale-factors hi have been used to determine the derivatives. The unit vectors in\nthe (s1, s2) directions are\ne1 =\n1\nE1\/2\n∂R\n∂s1\ne2 =\n1\nG1\/2\n∂R\n∂s2\n(11)\nand the normal n = e1 × e2. The Bond number B = ²2ρfgL2\/(µU), is the ratio between\ngravity and viscous forces. The term ²B is retained in the leading order balance (10) since\n5\nthe value of B is, as yet, undetermined. This gravity term will drive the flow only when\nall other forces are O(²), i.e. when the substrate is almost horizontal over a significant\nregion and surface forces are negligible. In this case the correct choice of velocity scale is\nU = ²3ρfgL\n2\/µ and gravity balances pressure gradient in equation (10). However, since this\ncase is a simple and limited extension of the present analysis (which has also been covered\npreviously [4]) the gravity term in equation (10) will be neglected from now on. For an\nincompressible fluid the continuity equation is\n∂\n∂s1\n(G1\/2u) +\n∂\n∂s2\n(E1\/2v) +\n∂\n∂η\n(E1\/2G1\/2w) = 0 . (12)\nEquations (8) – (10), (12) require solving subject to the following boundary conditions.\nOn the accreting surface, η = b, there is no slip\nu = v = 0 . (13)\nAt the free surface, η = b+ h, there is continuity of shear and normal stresses\nA1 =\n∂u\n∂η\n, A2 =\n∂v\n∂η\n, p− p0 = C ′σκ′, (14)\nwhere Ai = h0Ai\/(µU) denotes the non-dimensional shear stress. The shear could be due to a\nconstant air shear [4, 18], or surface tension gradient [16, 17, 28]. The normal stress condition,\n(14), involves the ambient pressure, p0, the mean curvature at the free surface, κ\n′, and an\ninverse capillary number, C ′ = ²2σ0\/µU which represents the ratio between surface tension\nand viscous forces. It is denoted C ′ to distinguish it from the standard inverse capillary\nnumber C = ²3σ0\/µU . With certain fluids the dimensional surface tension σ = σ0σ(s1, s2)\nmay vary with position, in which case the shear stress components, Ai, represent the surface\ntension gradient. When dealing with derivatives of pressure the derivatives of surface tension\nmust also be calculated, see [28] for example. When the surface tension is constant σ ≡ 1.\nThe mean curvature at r = R+ ²(b+ h)n is the sum of the principal curvatures in the s1, s2\ndirections, κ′ = κ′1 + κ\n′\n2. The principal curvatures are the eigenvalues of(\nL′M ′\nM ′ N ′\n)\n− λ\n(\nE ′ F ′\nF ′ G′\n)\n= 0 , (15)\n6\nwhere\nE ′ = E(1− ²(b+ h)κ1)2 +O(²2) , F ′ = O(²2) , G′ = G(1− ²(b+ h)κ2)2 +O(²2)\nL′ = L+ ²\n∂2\n∂s12\n(b+ h)− ²(b+ h)κ21E , M ′ = O(²) ,\nN ′ = N + ²\n∂2\n∂s22\n(b+ h)− ²(b+ h)κ22G .\nSince M ′ = O(²), F ′ = O(²2) the curvatures are simply\nκ′1 =\nL′\nE ′\n+O(²2) = κ1 + ²κ21(b+ h) +\n²\nE\n∂2\n∂s12\n(b+ h) +O(²2) (16)\nκ′2 =\nN ′\nG′\n+O(²2) = κ2 + ²κ22(b+ h) +\n²\nG\n∂2\n∂s22\n(b+ h) +O(²2) . (17)\nHence\np = p0 + C\n′σκ′ (18)\n= p0 − C ′σ\n(\nκ1 + κ2 + ²(b+ h)(κ\n2\n1 + κ\n2\n2) + ²\n[\n1\nE\n∂2\n∂s12\n(b+ h) +\n1\nG\n∂2\n∂s22\n(b+ h)\n])\n+O(²2) .\nWhen the flow is driven by pressure gradient it is clear from (18) that, whenever the substrate\ncurvature is non-constant and O(1) it is the substrate curvature, κ1 + κ2, that dominates\nthe surface tension terms and therefore drives the flow. In this case the final terms of\nO(²C ′) in equation (18) should be neglected. When the mean substrate curvature is small,\nκ1 + κ2 ∼ O(²), the terms involving the accretion and fluid heights become important and\nthe standard inverse capillary number C = ²C ′ is recovered. This occurs, for example, on an\nalmost flat substrate, see §3.1. Alternatively if the mean substrate curvature is approximately\nconstant, κ1+κ2 ∼ constant+O(²), such as occurs on an almost circular cylinder or spherical\nsubstrate (see §3.2, 3.4) then all of the surface tension terms in the pressure gradient are\nagain O(²C ′).\nAt the accretion-fluid and fluid-air interfaces there is continuity of mass flux:\nρ1n\n′ · (u1 − ub) = ρ2n′ · (u2 − ub) , (19)\nwhere ρk and uk are the density and velocity in each phase and ub is the velocity of the\nboundary between the two phases, n′ is the normal to the surface. The normal at the\n7\naccretion-fluid interface is\nn′ =\n(\n∂r\n∂s1\n× ∂r\n∂s2\n) ∣∣∣∣∣ ∂r∂s1 × ∂r∂s2\n∣∣∣∣∣\n−1\n(20)\nwhere\n∂r\n∂s1\n=\n∂R\n∂s1\n+ ²b\n∂n\n∂s1\n+ ²\n∂b\n∂s1\nn = (1− ²bκ1)∂R\n∂s1\n+ ²\n∂b\n∂s1\nn , (21)\nwith a similar expression for ∂r\/∂s2. Therefore\nn′ = n− ²\nE1\/2\n∂b\n∂s1\ne1 − ²\nG1\/2\n∂b\n∂s2\ne2 +O(²2) . (22)\nThe values for the velocities at the accretion-fluid interface, required in (19), are\nub =\n∂r\n∂t\n= ²\n∂b\n∂t\nn u1 = (0, 0, ²w) u2 = (0, 0, 0) , (23)\nwhere u1 is the fluid velocity (which is zero in the s1, s2 directions due to the no-slip condi-\ntion), u2 is the solid velocity and ρ1 = ρf , ρ2 = ρs. To leading order in ² the normal velocity\ncondition at η = b is\nw =\n(\n1− ρs\nρf\n)\n∂b\n∂t\n. (24)\nIf the fluid and solid densities are the same then w = 0 on η = b. Normal fluid motion only\noccurs if there is a density difference and the fluid must move to accommodate the new solid.\nAt the air-fluid interface the normal is\nn′ = n− ²\nE1\/2\n∂\n∂s1\n(b+ h)e1 − ²\nG1\/2\n∂\n∂s2\n(b+ h)e2 +O(²2) , (25)\nand the velocities are\nub =\n∂r\n∂t\n= ²\n∂\n∂t\n(b+ h)n u1 = ²\nρf\nρa\n(W · e1,W · e2,W · n) u2 = (u, v, ²w) , (26)\nwhere u1,u2 now represent the air (droplet) and fluid velocities respectively. The velocity\nof the incoming fluid is denoted W. As with gravity this will be expressed in an external\n(as opposed to surface) co-ordinate system. The density of the fluid in the air is denoted\nρa. The factor ²ρf\/ρa occurs due to the chosen time-scale. In dimensional form the velocity\n8\nu1 may be expressed as Uu1 = W (W · e1,W · e2,W · n), where U = L\/τ and according to\nequation (1), W = ρfH\/(ρaτ), hence W\/U = ²ρf\/ρa. The density of fluid in the air stream\nis, in practical situations, significantly less than the density of the fluid film, ρa ¿ ρf . In\nthe following ρa\/ρf will be neglected with respect to O(1) terms. To leading order in ² the\nnormal velocity condition at η = b+ h is therefore\nw =\n(\n∂b\n∂t\n+\n∂h\n∂t\n)\n+W · n+ 1\nE1\/2\nu\n∂\n∂s1\n(b+ h) +\n1\nG1\/2\nv\n∂\n∂s2\n(b+ h) . (27)\nThe pressure is determined by integrating (10) subject to (18)\np = p0 − C ′σ\n(\nκ1 + κ2 + ²(b+ h)(κ\n2\n1 + κ\n2\n2) + ²\n[\n1\nE\n∂2\n∂s12\n(b+ h) +\n1\nG\n∂2\n∂s22\n(b+ h)\n])\n. (28)\nThe O(²C ′) terms are retained in this expression so that flows over a constant curvature\nsurface may be modelled. Since it is pressure gradient, rather than pressure, which may\ndrive a flow, when κ1, κ2 are constant the driving force consists solely of the O(²C ′) terms.\nThe driving force is then O(C) where C = ²C ′ is the standard capillary number. The\nvelocities are determined by integrating (8), (9) subject to (13), (14)\nu =\n(\n1\nE1\/2\n∂p\n∂s1\n−Bg · e1\n)(\nη2 − b2\n2\n− (η − b)(b+ h)\n)\n+ A1(η − b) (29)\nv =\n(\n1\nG1\/2\n∂p\n∂s2\n−Bg · e2\n)(\nη2 − b2\n2\n− (η − b)(b+ h)\n)\n+ A2(η − b) . (30)\nAs discussed in the introduction terms of O(²) have been neglected in deriving this\nexpression. However, it is a simple matter to integrate the velocity equations whilst retaining\nO(²) terms. The velocity expressions then involve logarithms of η. In the limit ² → 0\nequations (29), (30) are retrieved. Weidner et al [27] have used the logarithmic form in a\nstudy of flow on a cylinder.\nIntegrating the continuity equation across the film gives\nw|b+h − w|b = −\n1\n(EG)1\/2\n∫ b+h\nb\n∂\n∂s1\n(uG1\/2) +\n∂\n∂s2\n(vE1\/2) dη\n= − 1\n(EG)1\/2\n(\n∂\n∂s1\n∫ b+h\nb\nuG1\/2 dη +\n∂\n∂s2\n∫ b+h\nb\nvE1\/2 dη\n)\n+\n1\nE1\/2\nu|b+h\n∂\n∂s1\n(b+ h) +\n1\nG1\/2\nv|b+h\n∂\n∂s2\n(b+ h) . (31)\n9\nSubstituting for w via (24), (27) and evaluating the integrals leads to\n∂h\n∂t\n+∇s ·Q = −ρs\nρf\n∂b\n∂t\n−W · n , (32)\nwhere ∇s represents the surface operator,\n∇s ·Q = 1\n(EG)1\/2\n(\nG1\/2\n∂\n∂s1\nQ1 + E\n1\/2 ∂\n∂s2\nQ2\n)\n(33)\nand\nQ1 =\n∫ b+h\nb\nu dη = −\n(\n1\nE1\/2\n∂p\n∂s1\n−Bg · e1\n)\nh3\n3\n+ A1\nh2\n2\n, (34)\nQ2 =\n∫ b+h\nb\nv dη = −\n(\n1\nG1\/2\n∂p\n∂s2\n−Bg · e2\n)\nh3\n3\n+ A2\nh2\n2\n. (35)\nEquation (32) is the governing equation for the fluid flow. It demonstrates that the film\nthickness varies due to fluid flux, solidification rate and the rate at which fluid enters the\nsystem. The flux terms (34), (35) show that the fluid is driven by pressure gradient, gravity\n(along the surface) and surface shear. Provided the substrate is not horizontal everywhere,\nthe pressure gradient depends on the ambient pressure (which may vary significantly around\nan aerofoil for example) and surface tension. Equation (32) involves two unknowns, the film\nheight h and the solid height b. A second equation to close the sytem will be derived in the\nfollowing section via an energy balance. In the absence of solidification, b ≡ 0, equation (32)\nalone (subject to appropriate boundary conditions) is sufficient to predict the evolution of\na thin fluid layer on an arbitrary three-dimensional surface. It is then a general form of the\nfourth-order, nonlinear degenerate parabolic partial differential equation typical of thin film,\nfree surface flows [1, 2].\n2.3 Solidification\nThe energy balance is derived subject to the following assumptions:\n1. The Peclet number, Pe¿ 1.\n2. The previous approximations hold, ², ²2Re¿ 1.\n10\nAssumption 1 means that the energy transfer across the layers is driven by conduction rather\nthan advection. Assumption 2 may be strengthened to the standard level for lubrication\napproximation with ²2 ¿ 1 without affecting the following analysis. It will also be assumed\nthat there is perfect thermal contact between the accretion and substrate and that the\nsubstrate temperature is constant. This means that the substrate has a high thermal mass\nand conductivity. A consequence of this restriction is that a proportion of the initial incoming\nfluid must solidify. Fluid flow may only occur once a solid layer exists to insulate the fluid\nlayer from the substrate. With the current non-dimensionalisation the appropriate boundary\ncondition is T = 0 at η = 0. Obviously it is a simple matter to adapt this to an imperfect\nthermal contact and a variable substrate temperature by choosing a cooling condition. For\none-dimensional ice accretion this is considered in Myers & Hammond [19].\nDue to this final assumption the accretion occurs in two stages. First, dry accretion\noccurs. In this case the accretion shape is completely determined by a mass balance. After\na certain amount of time fluid flows over the accretion. The problem is then governed by\ncombined mass and energy balances.\n2.3.1 Dry accretion\nInitially there is no fluid flow and all terms on the left hand side of the mass balance (32)\nare identically zero. The solid height is therefore given by\n∂b\n∂t\n= −ρf\nρs\nW · n . (36)\nIn general the air flow varies with space and time and the solution of (36) must be determined\nnumerically. However, if the air flow and droplet trajectories remain constant in time it may\nbe integrated immediately\nb = −ρf\nρs\nW · n t . (37)\nFluid will first appear when the accretion temperature reaches the freezing temperature.\nTo determine when this occurs the thermal problem must be analysed. The temperature is\nspecified by\nPe\n∂T\n∂t\n= ∇2T, (38)\n11\nwhere Pe = ²2ρscsL\n2\/(ksτ) is the Peclet number. In the current study the time-scale\nis determined by the rate at which fluid enters the system, τ = ρfH\/ρaW , and Pe =\nρsρaWHcs\/ksρf . In atmospheric icing calculations ρa ≈ 10−3 kg\/m3 is a typical liquid water\ncontent of the air, W ≈ [1, 100]m\/s is the velocity of the air flow (the lower limit applies\nto structural icing, the upper to aircraft icing), H ≈ 0.1mm for aircraft icing and 1mm for\nstructural icing, cs ≈ 2050 J\/kg K, ks ≈ 2.18 W\/m K. The Peclet number Pe ∈ [10−4, 10−2]\nis small and therefore may be neglected. The same approximation will hold for other physi-\ncally realistic situations however, care should be taken to ensure Pe¿ 1 before applying the\nfollowing approximations. Provided Pe ¿ 1 equation (38) reduces to a quasi-steady form\nat leading order:\n∂2T\n∂η2\n= 0 . (39)\nThis requires solving subject to the following conditions. At the free surface η = b a heat\nflux condition holds:\n∂T\n∂η\n∣∣∣∣∣\nη=b\n= E0D − E1DT . (40)\nThe energy terms E0D and E1D can incorporate quantities such as latent heat, kinetic energy,\nradiation, conduction and convection. If the air flow varies with time the energy terms will\nalso be time dependent. Details of these terms for structural and aircraft icing may be\nfound in [3, 4, 13, 21]. As discussed, at the solid substrate, η = 0, there is continuity of\ntemperature:\nT = 0 . (41)\nThe appropriate solution of (39) is\nT =\nE0D\n1 + E1Db\nη . (42)\nFluid first appears when the top of the layer, η = b, reaches the fusion temperature\nT = 1. The corresponding accretion thickness, bf , may be determined by solving (42) with\nT = 1 to give\nbf =\n1\nE0D − E1D . (43)\n12\nIf accretion occurs for a sufficiently short time, so that b is never greater than bf , then fluid\nwill not appear. It is also possible that the ambient conditions are such that fluid will never\nappear, i.e. if E0−E1 ≤ 0. In either case the accretion shape is determined by (36) or (37).\nThe temperature is given by (42) and the problem is completely solved.\n2.3.2 Wet accretion\nOnce the accretion surface has reached the fusion temperature fluid will appear on the\nsurface. The mass balance (32) involves two unknowns, the accretion and film heights, b and\nh. To close the system an energy balance is required.\nAt the accretion-fluid interface, η = b, the energy balance is\n[ρsEs(us − ub)− ρfEf (u− ub)] · n′ = τ(T f − T s)\nL2\n[∇(ksT )−∇(kfχ)] · n′ , (44)\nwhere E is the enthalpy of each phase and χ is the fluid temperature. The velocities are\nspecified by equation (23) and the normal on the accreting substrate by (22). The gradient\noperator is defined by ∇ = (1\/E1\/2 ∂\/∂s1, 1\/G1\/2 ∂\/∂s2, 1\/² ∂\/∂η). Equation (44) states\nthat the energy created during the phase change is conducted away from the interface either\nthrough the accretion or the fluid layer. Substituting for the velocities and expanding (44)\nleads to\nS\n∂b\n∂t\n=\n∂T\n∂η\n− kf\nks\n∂χ\n∂η\n+O\n(\n²2\n)\n. (45)\nThe Stefan number, S = (ρsLfH\n2)\/(τks(T f − T s)), is the ratio between the phase change\nenergy and the conductive energy. The latent heat of fusion is defined as the jump in enthalpy\nLf = Ef − Es.\nTo solve equation (45), expressions for the ice and water temperature gradients are re-\nquired. Again, provided Pe ¿ 1, the leading order heat equations simplify to quasi-steady\nforms:\n∂2T\n∂η2\n= 0\n∂2χ\n∂η2\n= 0 . (46)\nTwo boundary conditions are required for each of these equations. The first three use the\nfact that the temperature of the ice and the water at the interface is the fusion temperature\n13\nand the temperature at the bottom of the ice layer is zero:\nT |η=0 = 0, T |η=b = χ|η=b = 1. (47)\nA heat flux condition is applied at the top of the water layer:\n∂χ\n∂η\n∣∣∣∣∣\nη=b+h\n= E0F − E1F χ|b+h , (48)\nwhere the two coefficients, E0F and E1F , include kinetic energy, radiation, conduction, con-\nvection and evaporation. They may be time dependent if the air flow varies with time. The\nsolution of equations (46) is then straightforward. The temperature profiles are:\nT =\nη\nb\n(49)\nχ = 1 +\nE0F − E1F\n1 + E1Fh\n(η − b). (50)\nThe energy balance (45) can be expressed in its final form:\nS\n∂b\n∂t\n=\n1\nb\n− kf\nks\nE0F − E1F\n1 + E1Fh\n. (51)\nThe first term of the right hand side of equation (51) is proportional to 1\/b. The potential\nsingularity at b = 0 is prevented by the restriction that the temperature of the solid substrate\nis constant and below the solidification temperature. This means that accretion always occurs\ninitially and (51) only applies when b ≥ bf 6= 0. If a heat flux condition of the form (48)\nis applied at the substrate it is possible that bf = 0. However, in this situation the first\nterm on the right hand side of (51) becomes 1\/(a0 + b), where a0 > 0 is a constant and the\npotential singularity is eliminated. This situation is particularly relevant to ice accretion on\naircraft in mild conditions.\nThe wet accretion problem is now in its final form. The accretion and fluid flow are\ngoverned by the coupled mass and energy balances, equations (32) and (51). The energy\nbalance is relatively easy to deal with but the mass balance is highly nonlinear and difficult\nto solve. For this reason, the numerical solutions of §4 focus initially on the fluid flow. The\ncoupled accretion and fluid flow problem is then a simple extension of the fluid flow results.\n14\n3 Reduction of the governing equations to standard\nforms\nDuring the initial stages all of the incoming fluid solidifies and the height b is determined\nthrough the mass balance (36) or (37). The temperature is specified by equation (42). The\naccretion continues to be specified by (36) or (37) until the surface, η = b, reaches the phase\nchange temperature. The accretion thickness at this stage is specified by equation (43).\nSubsequently fluid will appear. The flow depends on the geometry and this will be discussed\nin the following sections. The energy balance for wet accretion, (51), holds in all geometries.\nFor simplicity the surface tension will be taken as constant in all the examples, so σ ≡ 1.\n3.1 Flat substrate\nWhen the substrate is flat the surface may be specified by setting s1 = x, s2 = y and\nR = (x, y, 0). The first and second fundamental forms are\nE =\n∂R\n∂x\n· ∂R\n∂x\n= 1 G =\n∂R\n∂y\n· ∂R\n∂y\n= 1\nL = n · ∂\n2R\n∂x2\n= 0 N = n · ∂\n2R\n∂y2\n= 0 .\nAccording to equation (11) the substrate and normal vectors are\ne1 = (1, 0, 0) e2 = (0, 1, 0) n = (0, 0, 1) .\nThe fluid pressure, specified by equation (28), is\np = p0 − C\n(\n∂2\n∂x2\n(b+ h) +\n∂2\n∂y2\n(b+ h)\n)\n. (52)\nThe flow is governed by equation (32) where the surface operator, equation (33), is\n∇s ·Q = ∂Q1\n∂x\n+\n∂Q2\n∂y\n. (53)\nThe fluxes are\nQ1 = −\n(\n∂p\n∂x\n−Bg · e1\n)\nh3\n3\n+ A1\nh2\n2\n(54)\nQ2 = −\n(\n∂p\n∂y\n−Bg · e2\n)\nh3\n3\n+ A2\nh2\n2\n. (55)\n15\nThe pressure is defined by equation (52) and g · e1 = cos θ, g · e2 = cosφ where θ and φ\nrepresent the inclination of the x and y axes to the horizontal.\nIn the absence of solidification b ≡ 0. If W = 0 the standard equation for the flow of a\nthin film on a flat surface is retrieved. It has been studied extensively, see [1, 2] for example.\nWith W 6= 0 the model describes the flow of an evaporating or condensing thin film, see [2,\n38] for example. With b and W non-zero the model reduces to that describing ice accretion\nand water flow on a flat surface [4]. A version of this model is currently being used in the\nICECREMO aircraft icing code [11,22].\n3.2 Circular cylinder substrate\nIn cylindrical polars the substrate may be parameterised with s1 = Rθ, s2 = z (note, as\ndiscussed in §2.1, s1 is a length). The substrate is then defined by R = (R cos θ, R sin θ, z),\nwhere R is the constant cylinder radius. For flow on the outside of a cylinder the outward\nnormal is n = (cos θ, sin θ, 0), flow on the inside requires n = −(cos θ, sin θ, 0). The first and\nsecond fundamental forms are therefore\nE = 1 G = 1 L = ± 1\nR\nN = 0 . (56)\nThe curvature terms are\nκ1 =\nL\nE\n= ± 1\nR\nκ2 =\nN\nG\n= 0 , (57)\nwhere κ1 > 0 denotes flow inside a cylinder, κ1 < 0 denotes flow on the outside. The pressure\nis\np = p0 − C ′\n[\n± 1\nR\n+ ²\nb+ h\nR2\n+ ²\n(\n1\nR2\n∂2\n∂θ2\n(b+ h) +\n∂2\n∂z2\n(b+ h)\n)]\n. (58)\nThe flow is governed by equation (32) with\n∇s ·Q = 1\nR\n∂Q1\n∂θ\n+\n∂Q2\n∂z\n. (59)\nThe fluxes Q1 and Q2 are\nQ1 = −\n(\n1\nR\n∂p\n∂θ\n−Bg · e1\n)\nh3\n3\n+ A1\nh2\n2\n(60)\nQ2 = −\n(\n∂p\n∂z\n−Bg · e2\n)\nh3\n3\n+ A2\nh2\n2\n, (61)\n16\nwhere the pressure is defined by equation (58) and\ne1 =\n1\nE1\/2\n∂R\n∂s1\n= (− sin θ, cos θ, 0) e2 = 1\nG1\/2\n∂R\n∂s2\n= (0, 0, 1) n = ±e1 × e2 . (62)\nSurface tension driven axisymmetric flow both inside and outside a cylinder has been\nconsidered in [2, 23 - 31]. Neglecting gravity, air shear, derivatives in the θ direction and\nsetting b = 0, W = 0 the governing equation reduces to\n∂h\n∂t\n+\n∂\n∂z\n[\nC\nh3\n3\n∂\n∂z\n(\nh\nR2\n+\n∂2h\n∂z2\n)]\n= 0 . (63)\nThis equation has been used to describe bubble motion in a capillary tube and the Rayleigh-\nTaylor instability in a thin film [23 – 25]. The ratio h\/R2 is termed the hoop stress. It behaves\nlike a negative gravity term, acting to pull the fluid away from the substrate and therefore\ndestabilises the flow. With gravity acting in the z-direction another term proportional to\n∂h3\/∂z is introduced into (63), this is discussed in [30, 31]. Weidner et al [27] investigate\nflow on a horizontal cylinder. However, initially they retain the full curvature terms in\norder to permit droplet formation on the underside of the cylinder. This leads to the flux\ncontaining logarithmic terms, as discussed in §2.2. Subsequently these authors expand the\nlog term with h\/R¿ 1 to obtain a similar flux expression to that given above. Jensen [26]\nconsiders flow in a circular cylinder with small curvature along the axis. This equation is\nmost easily retrieved by altering the above definition of the substrate to describe a torus\nR = R1(cos θ, sin θ, 0) +R2(cos θ cosφ, sin θ cosφ, sinφ) and setting R2 À R1.\nWith b and W non-zero the model describes solidification on the surface of a cylinder.\nThis is of particular interest to the power transmission industry for icing on cables or icicle\nformation [8, 20].\n3.3 Non-circular cylinder substrate\nA non-circular cylinder may be described by the substrateR = (f(s), g(s), z). The parameter\ns represents arc-length, so (\n∂f\n∂s\n)2\n+\n(\n∂g\n∂s\n)2\n= f 2s + g\n2\ns = 1 , (64)\n17\nwhere the subscript s denotes derivatives with respect to that variable. The normal is n =\n±(−gs, fs, 0), where the ± sign determines whether the normal points inwards or outwards.\nThe first and second fundamentals are\nE = 1 G = 1 L = ±(−gsfss + fsgss) = ±gss\nfs\nN = 0 .\nThe curvatures are therefore\nκ1 = ±gss\nfs\nκ2 = 0 .\nThe fluid pressure is\np = p0 − C ′\n[\nκ1 + ²\n(\nhκ21 +\n∂2h\n∂s2\n+\n∂2h\n∂z2\n)]\n. (65)\nThe flow is governed by equation (32) with\n∇s ·Q = ∂Q1\n∂s\n+\n∂Q2\n∂z\n(66)\nwhere\nQ1 = −\n(\n∂p\n∂s\n−Gg · e1\n)\nh3\n3\n+ A1\nh2\n2\nQ2 = −\n(\n∂p\n∂z\n−Gg · e2\n)\nh3\n3\n+ A2\nh2\n2\n.\nThe pressure is specified by equation (65) and the surface vectors are specified by (11).\nThe equations governing flow on a circular cylinder, derived in the previous section, may be\nretrieved by setting s = Rθ and f = cos(s\/R), g = sin(s\/R).\nSchwartz & Weidner [29] consider surface tension driven flow on an arbitrary two-\ndimensional surface. Neglecting air shear, gravity, derivatives in the z-direction and setting\nb = 0, W = 0 equation (32), in this case, reduces to\n∂h\n∂t\n+\n∂\n∂s\n[\nC ′\nh3\n3\n∂\n∂s\n(\nκ1 + ²\n(\nκ21h+\n∂2h\n∂s2\n))]\n= 0 , (67)\nwhere κ1 = gss\/fs. There are two main differences between (67) and the corresponding\nequation in [29]. Firstly, equation (67) is in non-dimensional form. This makes it clear that\n18\nwhen κ1 = O(1) and is non-constant it is the substrate shape alone that drives the flow to\nleading order. The problem in this case is governed by\n∂h\n∂t\n+\n∂\n∂s\n[\nC ′\nh3\n3\n∂κ1\n∂s\n]\n= 0 . (68)\nThe second difference is that the term κ21h is absent in [29]. This occurs as a result of their\nexpansion of the free surface curvature. Only two terms are taken in this expansion, κ1 and\nhss. A neglected term, κ\n2\n1h, occurs at the same order as hss and therefore should also be\nretained. This is particularly relevant when κ1 = ±1\/R is constant. In this case κ21h = h\/R2\nis the hoop stress term observed in equation (63). When the curvature is small, so that\nκ1 = ²κ\n′\n1 = O(²) the flow is governed by\n∂h\n∂t\n+\n∂\n∂s\n[\nC\nh3\n3\n∂\n∂s\n(\nκ′1 +\n∂2h\n∂s2\n)]\n= 0 . (69)\nThis is the equation derived in [29], which is therefore strictly valid for non-constant curva-\ntures of order ². Weidner et al [28] study an evaporating film with variable surface tension\nlying on an arbitrary two-dimensional surface. Their governing equation is obtained in the\nsame manner as (69) with the inclusion of the shear term A1h\n2\/2, the mass loss W · n and\nσ 6= 1.\n3.4 Spherical substrate\nIn this case the surface is parametrised by s1 = Rθ, s2 = Rφ where θ and φ represent\nthe usual polar and azimuthal angles and R is the radius of the sphere. The substrate is\nthen R = R(sin θ cosφ, sin θ sinφ, cos θ) and the normal n = ±R\/R. The first and second\nfundamental forms are\nE = 1 G = sin2 θ L = ∓ 1\nR\nN = ∓ 1\nR\nsin2 θ . (70)\nThe curvatures are therefore\nκ1 = ∓ 1\nR\n= κ2 . (71)\nThe fluid pressure is\np = p0 − C ′\n(\n∓ 2\nR\n+ ²\n[\n2\nR2\n(b+ h) +\n1\nR2\n∂2\n∂θ2\n(b+ h) +\n1\nR2 sin2 θ\n∂2\n∂φ2\n(b+ h)\n])\n. (72)\n19\nThe flow is governed by (32) with\n∇s ·Q = 1\nR\n∂Q1\n∂θ\n+\n1\nR sin θ\n∂Q2\n∂φ\n, (73)\nand\nQ1 = −\n(\n1\nR\n∂p\n∂θ\n−Bg · e1\n)\nh3\n3\n+ A1\nh2\n2\n(74)\nQ2 = −\n(\n1\nR sin θ\n∂p\n∂φ\n−Bg · e2\n)\nh3\n3\n+ A2\nh2\n2\n. (75)\n4 Numerical solution method\nThe general mathematical model for fluid flow and accretion is specified by equations (32)\nand (51). In the absence of accretion the flow model is typical for thin film free surface flows\nwhich are notoriously difficult to solve both analytically and numerically. If the fourth-\norder surface tension term is neglected then shocks are likely to develop, particularly in\nthe vicinity of a moving contact line. Another difficulty associated with the contact line is\nthe inability of the lubrication approximation to accurately predict fluid behaviour in this\nregion [32]. It is well-known that the no-slip velocity boundary condition at z = 0 leads to a\nmulti-valued velocity field in the vicinity of the contact line. This results in a non-integrable\nstress singularity. A number of methods to overcome this difficulty have been developed,\nsuch as the introduction of a precursor layer, replacing the no-slip condition by a Navier slip\ncondition or allowing rolling in an inner region and matching to the outer lubrication model\n[1]. In the following a precursor layer of thickness hp will be employed. Since the fluid flow\nis the most problematic aspect of the numerical solution this will be dealt with first in §4.1\nand 4.2. The coupling with the accretion model is a relatively simple extension and will be\ndealt with in §4.3.\n4.1 Fluid flow on a two-dimensional surface\nIn the absence of accretion, the equation governing the two-dimensional fluid flow is:\n∂h\n∂t\n+\n∂Q1\n∂s1\n= −W · n , (76)\n20\nwhere Q1 is specified by equation (34). This is discretised with constant space and time\nsteps ∆s1 and ∆t. The water height at the centre of the i − th cell of the grid at time\nt = k∆t is denoted hki . Provided the numerical domain is sufficiently large, equation (76)\nmay be solved with the boundary conditions that the first and second derivatives of the flux\nare zero (due to the presence of the precursor layer the flux is not necessarily zero at the\nboundaries).\nA typical finite difference scheme in conservative form for equation (76) is [33, 35]:\nhk+1i = h\nk\ni −W · n ∆t−\n∆t\n∆s\n(\nQ1i+1\/2 −Q1i−1\/2\n)\n, (77)\nwhere Q1i+1\/2 denotes the flux at the boundary of the i− th and (i+1)− th cells. It depends\non the water heights around the i−th cell, hi−3 to hi+3, calculated at time k∆t and (k+1)∆t.\nOver most of the domain, the dominant terms in the flux are the shear stress, A1h\n2\/2, and\nthe gravity term, Bg · e1h3\/3. If all other terms in the flux are neglected, equation (76) is\nlikely to develop a shock at the moving front. Preventing the eventual shock from developing\nis the surface tension term, which increases with the curvature. However, in many practical\nsituations there will exist a region of sufficiently high curvature at the front of the flow to\ncause numerical problems. To prevent this a shock capturing technique, as described in [4],\nwill be employed.\nSince equation (76) is nonlinear, calculating all terms implicitly in the flux is not possible.\nAn alternative method is presented in [36] where the derivatives of the film height are\nevaluated at time t = (k + 1\/2)∆t, using the Crank-Nicolson method, all other terms are\ncalculated explicitly, at time t = k∆t. To achieve this the flux is divided into two parts,\nQ1 = Q\nI +QII , where:\nQI =\nh3\n3\nC\nE1\/2\n(\nκ21\n∂h\n∂s1\n+\n1\nE\n∂3h\n∂s13\n)\n,\nQII =\nh3\n3\n(\nC ′\nE1\/2\n[\n∂κ1\n∂s1\n+ ²h\n∂κ21\n∂s1\n]\n− 1\nE1\/2\n∂p0\n∂s1\n+Bg · e1\n)\n+ A1\nh2\n2\n.\nThe first term is discretised using a Crank-Nicolson scheme, see [36]:\nQIi+1\/2 =\n(\nhki+1\/2\n)3\n3\nC\nE1\/2\n\n1\n2\n∂3h\n∂s3\n∣∣∣∣∣\nk+1\ni+1\/2\n+\n1\n2\n∂3h\n∂s3\n∣∣∣∣∣\nk\ni+1\/2\n\n21\n+κ21\n1\n2\n∂h\n∂s\n∣∣∣∣∣\nk+1\ni+1\/2\n+\n1\n2\n∂h\n∂s\n∣∣∣∣∣\nk\ni+1\/2\n . (78)\nThe second part, QII , contains the terms likely to produce shocks. Numerical experiments\ncarried out in [4, 44] indicate that the Roe & Sweby scheme with the ‘Superbee’ limiter\nprovides accurate solutions whilst permitting relatively large time-steps. This requires that\nthis part of the flux is split once again:\nQIIi+1\/2 =\n(\n1− ci+1\/2\n)\nQUPi+1\/2 + ci+1\/2Q\nLW\ni+1\/2 , (79)\nci+1\/2 = max (0,min (2r, 1) ,min (r, 2)) ,\nr =\n(∣∣∣ai+1\/2−a∣∣∣−∆t a2i+1\/2−a\/∆s1) (hi+1−a − hi−a)(∣∣∣ai+1\/2∣∣∣−∆t a2i+1\/2\/∆s1) (hi+1 − hi) ,\na = sign\n(\nai+1\/2\n)\n,\nwhere ai+1\/2 denotes the wave speed, Q\nUP and QLW represent the upwind and Lax-Wendroff\nschemes:\nai+1\/2 =\n\n(QIIi+1 −QIIi )\/(hi+1 − hi) if hi+1 − hi 6= 0 ,\n∂QII\/∂h\n∣∣∣\ni+i\/2\nif hi+1 − hi = 0 ,\nQUPi+1\/2 =\n1\n2\n(\nQIIi +Q\nII\ni+1\n)\n− 1\n2\nsign\n(\nai+1\/2\n) (\nQIIi+1 −QIIi\n)\n,\nQLWi+1\/2 =\n1\n2\n(\nQIIi +Q\nII\ni+1\n)\n− ∆t\n2∆s\na2i+1\/2\n(\nhi+1\/2 − hi−1\/2\n)\n,\nand QIIi denotes the second part of the flux calculated at the centre of the i − th cell with\na centred scheme at time k∆t. Equation (76) is now fully discretised and the film height(\nhk+1i\n)\ni=1..n\nmay be determined by solving equation (77) with the flux specified by equations\n(78) and (79). This leads to a system of n linear equations and the problem reduces to the\ninversion of a pentadiagonal matrix. For full details see [36, 44]\nIn Figure 2 a typical result is shown for flow on a horizontal surface. The rate at which\nfluid impacts on the surface is\nW · n = −0.5 exp(−3.16s21) . (80)\nThis form is chosen to match physically realistic examples, such as the one discussed in §4.5.\nThe flow is driven primarily by air shear. The height-scale is chosen as the equilibrium height\n22\non a horizontal surface, hence h = 1 over most of the domain. The velocity scale, U , is chosen\nto make A1 = 1. The various curves represent the film profile at t = 1, 3, 4, 4.5, 5, 7, 9, 11,\n15. Since the flux Q1 involves terms proportional to h\n3 and h2, when h¿ 1 the film profile\nis determined by the balance between the time derivative and the incoming fluid in equation\n(76). The early time profile is therefore approximately proportional to the Gaussian shape\nspecified by (80). The precursor film h = hp = 0.05, can clearly be seen on either side of the\nGausssian. As h increases the air shear term enters the dominant balance and the fluid is\ndriven to the right. A capillary ridge begins to develop after t = 2.5 and the height of this\nridge increases until around t = 10 after which the height remains constant. The shape of the\ncapillary ridge may be determined approximately using the method described in [4, 36, 37].\nAfter t = 5 the film profile behind the ridge is determined by the balance between air shear\nand the incoming fluid. In this case the bulk film shape may be determined analytically\nh =\n√\nh2p + 0.5\n√\npi\n3.16\n[\n1 + erf\n(√\n3.16s1\n)]\n. (81)\nMatching the bulk and ridge solutions then provides a profile against which the numerical\nsolution may be verified. However, since the results are too close to distinguish, only the\nnumerical solution is shown in Figure 2. Further details may be found in [4]. The numerical\nsolution has also been checked against the explicit solution method described in [4]. The\ncurves match almost exactly, however the current calculation took approximately thirty\nseconds (fifty times less than the explicit solution).\nFigure 2 near here\nWhen the surface is inclined, with gravity acting against the shear stress, the evolution of\nthe water layer is very different. Figure 3 shows the film profile for flow on a surface inclined\nat 20◦ to the horizontal, again with a shear stress A1 = 1 and Bg ·e1 = −0.857, at times t =\n1, 3, 4, 4.5, 5, 7, 9, 11, 15. The example has been chosen so that gravity almost balances the\nshear. At early times the fluid height reflects the incoming Gaussian profile. As the height\nincreases motion to the right occurs, due to the shear stress, and to the left, due to gravity.\nThe fluid on the right initially forms a capillary ridge which grows in height, until a critical\n23\nvalue around h = 1.2, when it ceases to grow and starts to spread out. The fluid continues\nto flow in this manner, with no discernible leading capillary ridge. This phenomenon has\nbeen observed in surface tension gradient driven flows [41]. At the left-hand edge of this flat\nregion the fluid dips. Moving further to the left the height increases to the gravity dominated\nregion which behaves in a more usual manner, with a capillary ridge forming at early times.\nThe ridge increases in height, to a certain value, and a flat bulk flow region begins to form\nbehind the ridge at later times.\nFigure 3 near here\n4.2 Fluid flow on a three-dimensional surface\nIn the absence of accretion, the equation governing the three-dimensional fluid flow is (32)\nwith b ≡ 0. In this case the solution space is divided into an m×n grid, whose cell sizes are\ndenoted ∆s1 and ∆s2. The film height in the centre of cell (i, j) at time t = k∆t is denoted\nhki,j.\nThe generalisation of the two-dimensional scheme to three dimensions is not straightfor-\nward. In three dimensions, solving for the film height requires the inversion of a broadly\nbanded matrix. An alternative method is to replace the implicit scheme by an Alternat-\ning Direction Implicit (ADI) scheme, or Peaceman-Rachford non-homogeneous scheme [34,\n39, 40]. The time step is then divided into two equal parts: when t ∈ [k, k + 1\/2]∆t the\nflux is evaluated implicitly in the s1 direction and explicitly in the s2 direction; during\nt ∈ [k + 1\/2, k + 1]∆t the flux is evaluated explicitly in the s1 direction and implicitly\nin the s2 direction. The pressure gradient involves two cross derivatives ∂\n3h\/(∂s21∂s2) and\n∂3h\/(∂s1∂s\n2\n2). These could be calculated implicitly but they would add non-pentadiagonal\nterms to the matrix. If the cross terms are evaluated explicitly then the film height may\nbe determined by inverting two pentadiagonal matrices, see [27, 38]. Again all the explicit\nterms are evaluated using the Roe and Sweby scheme with the Superbee limiter.\nFigure 4 near here\n24\nIn Figure 4 an example of flow on an inclined flat surface is shown. The slope is such that\ngˆ · e1 = gˆ · e2 = −0.4. The surface shear components act against gravity with A1 = A2 = 1.\nThe height is scaled with H = 0.1286mm (the equilibrium height for the equivalent two-\ndimensional problem), the length is scaled with L = 8.3cm. The incoming fluid is described\nby\nW · n = −0.5 exp\n(\n−3.16(s21 + s22)\n)\n. (82)\nThe space and time-steps employed in the calculation were ∆s1 = ∆s2 = 0.0015, ∆t = 0.0005\nand the figure shows the result at t = 15. Shear and gravity forces are mainly acting along\nthe diagonal joining the left and the right corners.\nThis example includes the different patterns likely to develop for this type of flow:\n• The left extremity of the curve is mainly driven by gravity, see the enlargement in 5\n(a). Two waves appear on the side of the flow due to the gravity driven spreading\nperpendicular to the main flow direction. These two waves join and form a single\ncapillary ridge which ends at a high peak. This shape strongly resembles the two\ndimensional curves described in the previous section.\n• The right extremity of the flow shows a very different pattern, as may be observed\nfrom the enlargement in Figure 5 (b). The front forms a semi-circular flat plateau,\nsurrounded by small side waves created by the balance between gravity driven spreading\nand surface tension. There is a distinct step, ∆h ≈ 0.2 from the bulk height to the\nplateau height.\n• Between the two fronts, the bulk region consists of an approximately flat section which\nthen slowly increases in height away from the right. At the left extremity the bulk\nregion levels off again before the peak is reached. The sides of this region display a\nsmall capillary ridge due to the sideways flow driven by gravitational spreading. The\ntwo, approximately constant heights on either side of the origin are determined by the\nbalance between gravity and shear stress. The two heights are different because near\nthe origin, where most fluid impacts, the film is sufficiently thick for gravity to dominate\n25\nand drive the most of the fluid to the left. Mathematically, the two different heights\nexplain the two different type of fronts. The left hand region has a slightly increasing\nheight and the flux QII is convex, so a Lax shock appears here. On the other side,\nthe water height is decreasing and QII is concave, consequently an undercompressive\nshock develops at the right hand front [42, 43].\nFigure 5 near here\n4.3 Coupled flow and accretion\nAs mentioned before, there is an initial period when only dry accretion occurs. In which\ncase the thickness is determined by equation (36). The discretised form is\nbk+1i,j = b\nk\ni,j −W · n∆t . (83)\nFluid appears when a point or area of the top surface reaches the fusion temperature. The\naccretion profile at this time is specified by equation (43). When fluid appears, equation\n(83) may still hold in certain regions where the fluid has not yet flowed. Over the rest of\nthe domain the accretion is governed by equation (51) which is coupled to the flow equation\n(32). In discrete form these are\nbk+1i,j = b\nk\ni,j +\n1\nS\n(\n1\nbki,j\n− kf\nks\nE0F − E1F\n1 + E1Fhki,j\n)\n∆t , (84)\nhk+1i,j = h\nk\ni,j −\n∆t\n∆s1\n(\nQ1i+1\/2,j −Q1i−1\/2,j\n)\n− ∆t\n∆s2\n(\nQ2i,j+1\/2 −Q2i,j−1\/2\n)\n− 1\nS\n(\n1\nbki,j\n− kf\nks\nE0F − E1F\n1 + E1Fhki,j\n)\n∆t−W · n∆t . (85)\nHowever, the extent of the wet domain is not known a priori. In order to determine which\nmodel, dry or wet accretion, is appropriate at a given point, the following method is used:\n• The fluid and accretion heights are calculated using equations (84) and (85). These\nrequire that bki,j 6= 0. For this reason, a precursor ice film bp is specified (typically this\nis taken the same as the fluid precursor, bp = 0.05).\n• If the new calculated film height is greater than the precursor film, hki,j > hp, the wet\naccretion model is taken as correct.\n26\n• If the new calculated fluid height is smaller than the precursor film, hki,j < hp, this\nmeans that the accretion is dry. The calculated value for the film height is replaced\nby the precursor film, hp, and the new ice height is calculated using equation (83).\nAs the model stands, mass is not conserved. The problem occurs at the interface between\nwet and dry accretion. At the dry side of the accretion, the flux takes a small constant value\ndue to the presence of the precursor film. At the wet side, the flux depends on the height\nfrom the neighbouring points and therefore the wet and dry flux values are not necessarily\nthe same on either side of the interface. To correct this deficiency, in dry regions, equation\n(83) is modified to:\nbk+1i,j = b\nk\ni,j −W · n∆t−\nρf\nρs\n(\nQ1i+1\/2,j −Q1i−1\/2,j\n∆s1\n+\nQ2i,j+1\/2 −Q2i,j−1\/2\n∆s2\n)\n∆t . (86)\nSince the flux is constant in the precursor film, the new term on the right hand side is only\nnon-zero at the dry\/wet interface. This method ensures continuity and physically sensible\nresults for the film height as well as mass conservation.\nThe numerical solution for flow on an accreting surface is therefore determined by first\ncalculating the accretion profile immediately before fluid appears, b = bf . Subsequently\nequations (84) and (85) hold over the wet region and equation (86) holds in the dry regions.\nFigure 6 shows (a) the accretion and (b) the fluid film on a flat plane at t = 60 with the\nsame conditions to that of §4.2. The energy terms are given by\nE0F = 0.235− 0.0966W · n ,\nE1F = 0.164− 0.095W · n .\nThese correspond to a physical situation where water droplets exist in a flow field at temper-\nature 272K, the substrate temperature is 271K, the heat transfer coefficient is 500W\/K\/m2,\nthe free stream velocity is V∞ = (100, 0, 0)m\/s and the incoming fluid is described by equa-\ntion (82). The temperatures are chosen close to fusion temperature so that a significant\nwater layer may develop. Taking the height and velocity scales of §4.1 gives the following\nnon-dimensional numbers for the problem\n² = 1.55× 10−3 , A1 = 1 , B = 2.52 , C ′ = 2.72× 10−3 , S = 0.824 .\n27\nFigure 6 near here\nThe accretion shown in Figure 6 (a) shows a central Gaussian region, corresponding to\nthe incoming fluid. If the fluid were to solidify immediately upon impact then the accretion\nwould have a Gaussian profile with a maximum height b = −ρf W · n|s1=s2=0 t\/ρs ≈ 33.3\n(where ρs = 900, ρf = 1000kg\/m\n3). For the present situation fluid flow has altered the\nGaussian. On the right the hump is caused by the solidification of the air shear driven flow,\non the left a thin hump occurs due to the gravity driven flow. The different amounts of\naccretion on either side of the centre reflect the magnitude of the driving force and ease\nwith which the fluid moves over a dry surface. Clearly surface shear is the dominant driving\nforce, even though the Bond number B > A the surface shear. This is due to the fact that\nA multiplies h2 whilst B multiplies h3 and the water height remains low for a significant\nlength of time.\nIt is clear from Figure 6 (b) that the flow with accretion is qualitatively different to that\nwithout (shown in Figure 4). A shock still forms on the left of the picture, on the right side\nof the figure the flow is driven to the right by shear stress, gravity also acts to drive the\nflow to the left and at the same time accretion removes fluid. This combination results in\nthe film height decreasing monotonically to the precursor layer and no shock or flat region\nappears on the right side.\n4.4 Flow and accretion on a sphere\nAccretion on a sphere is now studied for the case of a gravity driven film. The two coordinates\ns1 and s2 are defined as the lengths along the parallels and meridians respectively. However,\nfor clarity, the results will be shown using the two spherical coordinate angles φ and θ.\nGravity acts in the direction of increasing θ.\nThe simulation is carried out with the following parameters:\nB = 1 , C ′ = 6.42× 10−5 , S = 0.43 ,\nE0F = 0.00144− 0.0207W · n , E1F = 0.00307− 0.04439W · n , ² = 3.53× 10−4 ,\nA1 = 0 , A2 = 0 , W · n = −0.7 exp\n(\n−13.87s2\n)\n,\n28\nwhere s =\n√\ns21 + s\n2\n2 denotes the distance to the origin along the surface. These values\ncorrespond to far field and substrate temperatures T∞ = 272K and Ts = 271K, the far\nfield velocity is V∞ = (5, 0, 0)m·s−1 and the heat transfer coefficient is assumed constant, 5\nW\/m2\/K. The scales are H = 0.12mm, L = 33.98cm, τ = 2.40s. The height-scale is the\nappropriate choice for a gravity driven flow on a vertical surface.\nFigures 7 (a), (b) near here\nUnder these conditions water appears on the surface at t = 4.28. The ice accretion at\nt = 30 (corresponding to approximately 72s) is shown in Figure 7(a). If all of the incoming\nfluid had frozen then the ice shape would be proportional to the Gaussian with maximum\nheight b = 23.3. The flattening over the top region indicates that water has been present\nand moved away from the central region. The film height is shown in Figure 7(b). The\nliquid is clearly pushed to the right of the picture (increasing θ) by gravity. As with the flat\ninclined surface example, a shock develops at the moving front. However, the wave here is\nmuch smaller due to the lower water level. The simulation has been stopped at this time to\navoid the problem which would occur as fluid accumulates at the bottom of the sphere.\n4.5 Flow and accretion on an aerofoil\nA more practical application of the current theory will now be described, that of ice accretion\non an aerofoil. This is particularly relevant to ice growth on aircraft and wind turbines, see\n[8, 11, 45] for example.\nA good approximation to the top half of a NACA0012 aerofoil (with constant cross-\nsection) is R = (x(p), y(p), z) where\nx(p) =\n8∑\ni=0\nxip\ni(1− p)(8−i) (87)\ny(p) =\n8∑\ni=0\nyip\ni(1− p)(8−i) (88)\nand p ∈ [0, 1]. The points (xi, yi) are\n(0.0, 0.0), (0.0, 1.48448), (0.99988, 9.76164), (5.99984, 27.39464), (15.00003, 40.74980),\n(19.99984, 31.20544), (14.99988, 12.59776), (6.00000, 2.42248), (1.00000, 0.01050) ,\n29\nsee [46]. The bottom half of the aerofoil is obtained by symmetry. The surface therefore\nforms part of a non-circular cylinder, as discussed in §3.3 (however p does not represent\narc-length, so equation (64) does not hold). The arc-length co-ordinate s is, chosen so that\ns = 0 at the leading edge, s < 0 is the bottom half of the aerofoil and s > 0 the top half.\nThe model inputs were determined using FLUENT V [47] over a clean aerofoil. The\ntemperatures are the same as in the previous examples, i.e. T∞ = 272, Ts = 271K. The\ncollection efficiency may be defined as the ratio between the mass of impinging droplets to\nthe incoming mass that would hit the substrate if the trajectories were straight lines [48].\nThe collection efficiency must therefore be less than 1. For the current problem a series of\ndroplets of radius r = 50µm was introduced into the FLUENT flow solution and the air had\na liquid water content ρa = 0.001 kg\/m\n3. The droplet impact points were recorded to provide\nthe collection efficiency shown in Figure 6 (a). The droplets in the air flow are relatively\nsmall and tend to follow the air flow. The efficiency is therefore a maximum near the\nleading edge of the aerofoil where the air flow turns sharply and the droplets cannot follow.\nOn either side the efficiency decreases rapidly as less droplets impact and more follow the\nairflow. Beyond the limits |s| = 1 all the droplets flow around the wing. Ideally the collection\nefficiency should be a smooth curve. The oscillations in the figure indicate that a relatively\nsmall number of droplets have impacted in that region so leading to inaccuracies in the\ncalculation. The flow solution obtained by FLUENT provides the shear stress, pressure and\nheat transfer coefficient shown in Figures 6 (b), (c), (d). These are all shown in dimensional\nform. The shear stress is negative for s < 0, since the air flow is in the negative s direction\non the bottom surface. The magnitude of the shear stress is greatest just before and after\nthe leading edge, with a maximum value 15.5Pa. For s > 0 the stress is positive since the air\nflows in the positive s direction. The ambient pressure is 101300Pa. Near the leading edge\nthe pressure is greater than this value. For |s| > 0.3 the pressure is less than this value. The\nsymmetric form for the aerofoil shape, given by equation (88), means that both sides have\nequal suction and no lift would be generated. In reality an aerofoil requires asymmetry to\ngenerate lift in horizontal flight. The heat transfer coefficient is also highest at the leading\n30\nedge. The peak corresponds to a dimensional value of approximately 545 W\/m2K. Figures\n7 (a), (b) show the ice and water thicknesses on the aerofoil at times t = 500, 1000, 1500\n(corresponding to 3, 6, 9 minutes). Initially the ice shape is proportional to the collection\nefficiency, so there is a high peak in the centre and no ice beyond |s| = 1. Since the ambient\nconditions are mild, water appears at an early time, t = 7, and starts to produce ice away\nfrom this region. When t = 500 the ice extends to |s| ≈ 1.3, at t = 1500 the ice reaches\n|s| ≈ 2.2. The ice shape is relatively difficult to interpret due to the competing effects.\nHowever, it is likely that a peak occurs at the centre because the water impacting in this\nregion is removed very slowly. Near the stagnation point the shear stress is low and the only\ndriving force is gravity. The thin water film therefore moves very slowly and provides a large\nsource for new ice. Away from this region the air shear drives the fluid outwards to extend\nthe limits of the ice region.\nThe water film, shown in Figure 7 (b) has two peaks around |s| = 0.7. These are caused\nby the water (except in the immediate vicinity of s = 0) being driven away from the centre.\nAs the fluid moves to the thin ice region it starts to freeze and so the water height decreases\nrapidly near the accretion edge.\n5 Conclusion\nA model for the flow of a thin, accreting film has been developed. In the absence of solidi-\nfication, the model for fluid flow is the first fully three-dimensional thin film formulation on\nan arbitrary surface described in the literature. As such it can be applied to a wide variety\nof physically realistic thin film free surface flows. The various limiting cases of this model\nhave been shown to capture previous systems on flat and curved surfaces in both two and\nthree dimensions and also clarified the conditions under which these models are valid. When\nsolidification is included the model can be reduced to a previous one concerning ice accretion\non a flat surface.\nThere are a vast number of papers dealing with thin film free surface flows. These concern\nnot only the different applications and flow regimes but also the mathematical properties\n31\nof the governing equations. The addition of solidification to the problem adds a whole new\nlevel of complexity and interest to the problem. The numerical solutions show that the flow\ncharacteristics change considerably even when the accretion rate is small.\nThe model has a number of limitations. For example, the rate at which fluid enters\nthe system must be sufficiently slow for the temperature to equilibrate to an approximately\nlinear profile. The thermal mass of the substrate must be significantly larger than that of\nthe accretion. The fluid is Newtonian, most coatings are non-Newtonian. A number of these\nrestrictions are relatively simple to relax. For example, it is a simple matter to allow heat\ntransfer between the substrate and the accretion. This will permit the modelling of anti-\nicing systems and icing of cables, where the ice accretion may be significantly larger than\nthe cable. In the case of a non-solidifying flow there are a variety of other possible driving\nforces which have not been included in this work. However, removing the restrictions and\ninvestigating different driving forces will be the subject of future research.\nVerification of the model with accretion is difficult. The most easily available source\nof data comes from ice accretion studies. On aircraft the conditions are very severe and\ninaccuracies will come from the experimental observations, the flow solution obtained via\nFLUENT and the accretion model itself. With atmospheric icing the ambient conditions can\nchange throughout the course of an icing event and knowing the precise inputs for the model\nis problematic. However, it is hoped in the future to verify this model through controlled\nexperiments for ice accretion on cables. The model for accretion on a flat surface is already\nbeing used and tested in an aircraft icing code and results from this study will be published.\nAcknowledgement\nTM would like to thank the Oxford Centre for Industrial and Applied Mathematics (OCIAM)\nat the University of Oxford for providing the facilities where the majority of this work was\nwritten up and for appointing him as a Visiting Research Fellow.\n32\n6 Nomenclature\nAi Surface shear\nB Bond number\nb Ice thickness\nC Inverse capillary number\nC ′ Non-standard inverse capillary number C = ²C ′\nE,F,G First fundamental forms\nEiD Energy term in dry accretion\nEiF Energy term in wet accretion\ne1, e2 Unit substrate vectors\nH Height scale\nkf , ks Thermal conductivity of fluid and solid\nL,M,N Second fundamental forms\nL Length-scale\nLf Latent heat of fusion\nn Unit vector normal to substrate\nPe Peclet number\np Fluid pressure\nQ = (Q1, Q2) Fluid volume flux vector\nR Function defining the substrate\nr Function defining current point\nS Stefan number\nsi Surface co-ordinates\nT Temperature in solid\nTf Fusion temperature\nTs Substrate temperature\nT∞ Far field temperature\nu = (u, v, w) Fluid velocity vector\n33\nV∞ Velocity vector for far field air flow\nW Local velocity of fluid droplets\nW Maximum value of W\n² Small parameter, ² = H\/L\nκ1, κ2 Curvature in (s1, s2) directions\nη Co-ordinate perpendicular to substrate\nρ Density\nχ Temperature in fluid\nτ Time-scale\nReferences\n1. Myers T.G. Thin films with high surface tension. SIAM Review 40(3), pp441-462 1998.\n2. Oron A., Davis S.H. & Bankoff S.G. Long-scale evolution of thin liquid films. Rev.\nModern Phys. 69(3) pp931-980 1997.\n3. Poots G.I. Ice and snow accretion on structures, Research Studies Press, 1996.\n4. T.G. Myers, J.P.F. Charpin & C.P. Thompson Slowly accreting ice due to supercooled\nwater impacting on a cold surface. Submitted to Phys. Fluids, July 2000.\n5. Stefan J. U¨ber einige Probleme der Theorie der Wa¨rmeleitung. S.-B. Wien. Akad.\nMat. Natur. 98 pp473-484 1889.\n6. Stefan J. U¨ber die Theorie der Eisbildung, insbesondere u¨ber die Eisbildung im Po-\nlarmeere. S.-B. Wien. Akad. Mat. Natur. 98 pp965-983 1889.\n7. Lock G.S.H. The growth and decay of ice. Cambridge University Press (1990).\n8. L. Makkonen “Models for the growth of rime, glaze icicles and wet snow on structures”\nPhil. Trans. R. Soc. Lond. A 358 2913 (2000).\n34\n9. M. Farzaneh “Ice accretions on high-voltage conductors and insulators and related\nphenomena” Phil. Trans. R. Soc. Lond. A 358 2971 (2000).\n10. P. Sparaco Swedish crash prompts clear-ice guidelines, Aviation Week and Space Tech-\nnology, 10 pp49-50, 1994.\n11. R.W. Gent, N.P. Dart & J.T. Cansdale Aircraft icing, Phil. Trans. R. Soc. Lond. A\n358 2873 (2000).\n12. Ice accretion modelling. URL http:\/\/www.tra3.com\/icecremo\/.\n13. S.K. Thomas, R.P. Cassoni & C.D. MacArthur, Aircraft anti-icing and de-icing tech-\nniques and modelling, Journal of Aircraft 33(5) pp841-854, (1996).\n14. I.A. Frigaard, Solidification of spray formed billets, J. Engng Math. 31, 411 (1997).\n15. E. Gutierrez-Miravete, E.J. Lavernia, G.M. Trapaga, J. Szekely & N.J. Grant, Math-\nematical model of the spray deposition process, Metallurgica Transactions 20A, 71\n(1989).\n16. D.E. Kataoka & S.M. Troian A theoretical study of instabilities at the advancing front\nof thermally driven coating flows, J. Coll. Interf. Sci. 192(2), 350 (1997).\n17. D.E. Kataoka & S.M. Troian “Stabilizing the advancing front of thermally driven\nclimbing films,” J. Coll. Interf. Sci. 203(2), 335 (1998).\n18. S. Middleman “The effect of induced air-flow on the spin coating of viscous liquids,”\nJ. Appl. Phys. 62(6), 2530 (1987).\n19. T.G. Myers & D.W. Hammond “Ice and water film growth from incoming supercooled\ndroplets,” Int. J. Heat Mass Trans. 42, 2233 (1999).\n20. K. Arnold, G. Tetzlaff & A. Raabe “Modelling of ice accretion on a non-rotating\ncylinder” Meteorol. Zeitschrift 6(3), 120 (1997).\n35\n21. T.G. Myers “An extension to the Messinger model for aircraft icing” AIAA J. 39(2),\n211 (2001).\n22. P. Bartlett Development of a new model of ice accretion on aircraft, Proceedings of 9th\nInternational Workshop on Atmospheric Icing on Structures, Chester UK June (2000).\n23. P.S. Hammond Nonlinear adjustment of a thin annular film of viscous fluid surrounding\nathread of another within a circular cylindrical pipe. J. Fluid Mech. 137, 363-384\n(1983).\n24. L.W. Schwartz, H.M. Princen & A.D. Kiss On the motion of bubbles in capillary tubes.\nJ. Fluid Mech. 172, 259-275 (1995).\n25. S.G. Yiantsos & B.G. Higgins Rayleigh-Taylor instability in thin viscous films. Phys.\nFluids A(1) 1484-1501 (1989).\n26. O.E. Jensen The thin liquid lining of a weakly curved cylindrical tube. J. Fluid Mech.\n331, 373-403 (1997).\n27. D.E. Weidner, L.W. Schwartz & M.H. Eres Simulation of coating layer evolution and\ndrop formation on horizontal cylinders. J. Colloid & Interf. Sci. 187, 243-258 (1997).\n28. D.E. Weidner, L.W. Schwartz & R.R. Eley Role of surface tension gradients in cor-\nrecting coating defects in corners. J. Colloid & Interf. Sci. 179, 66-75 (1996).\n29. Schwartz L.W. & Weidner D.E. Modeling of coating flows on curved surfaces. J. Engng\nMath. 29 pp91-103 1995.\n30. A.L. Frenkel Nonlinear theory of strongly undulating thin films flowing down vertical\ncylinders. Europhys. Lett. 18, 583-588 (1992).\n31. S. Kalliadasis & H-C Chang Drop formation during coating of vertical fibres. J. Fluid\nMech. 261, 135-168 (1994).\n32. E.B. Dussan V. & S.H. Davis On the motion of fluid-fluid interface along a solid surface.\nJ. Fluid Mech. 65 71-95 (1974).\n36\n33. R.J. LeVeque. Numerical methods for conservation laws, Lectures in Mathematics,\nETH Zu¨rich, Birkha¨user (1990).\n34. J.W. Thomas. Numerical partial differential equations: finite difference methods.\nTexts in Applied Mathematics (22), Springer (1995).\n35. J.W. Thomas. Numerical partial differential equations: conservation laws and elliptic\nequations. Texts in Applied Mathematics (33), Springer (1995).\n36. J.A. Moriarty & L.W. Schwartz. Unsteady spreading of thin liquid films with small\nsurface tension. Physics of Fluids A3(5), 733-742 (1991).\n37. E.O. Tuck & L.W. Schwartz. A numerical and asymptotic study of some third-order\nordinary differential equations relevant to draining and coating flows. SIAM Rev. 32,\n453-469 (1990).\n38. M.H. Eres, D.E. Weidner & L.W. Schwartz. Three-dimensional direct numerical sim-\nulation of surface-tension-gradient effects on the leveling of an evaporating multicom-\nponent fluid. Langmuir 15(5), 1859-1871 (1999).\n39. N. N. Yanenko. The method of fractional steps. Springer (1971).\n40. J. Douglas Jr. Alternating directions methods for three space variables. Numerische\nMathematik 4, 41-63 (1962).\n41. A. Mu¨nch. Shock transitions in Marangoni gravity-driven thin-film flow. Nonlinearity\n13, 731-746 (2000).\n42. A.L. Bertozzi, A. Mu¨nch, X. Fanton & A.M. Cazabat. Contact line stability and\n’undercompressive shocks’ in driven thin film flow. Physical Review Letters 81 (23),\n5169-5172 (1998).\n43. A.L. Bertozzi, A. Mu¨nch & M. Shearer. Undercompressive shocks in thin film flows.\nPhysica D 134, 431-464 (1999).\n37\n44. J.P.F. Charpin. Water flow on accreting ice surfaces. Phd Thesis, Cranfield University,\nIn preparation.\n45. K.J. Finstad & L. Makkonen Improved numerical model for wind turbine icing. Proc.\n7th International Workshop on Atmospheric Icing of Structures, Quebec 1996.\n46. W. Boehm. Be´zier presentation of airfoils. Computer Aided Geometric Design 4(1),\n17-22 (1987).\n47. FLUENT 5 User’s Guide, FLUENT Incorporated, Centerra Resource Park, 10 Cavendish\nCourt, Lebanon NH03766,July 1998.\n48. R.J. Kind, M.G. Potapczuk, A. Feo, C. Golia & A.D. Shah. Experimental and com-\nputational simulation of in-flight icing phenomena. Progress in Aerospace Sciences 34,\n257-345 (1998).\n38\n\u0000\u0000\u0000\u0000\u0000\u0001\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\u0000\u0001\u0001\u0001\u0001\u0001\n\u0000\u0000\u0000\u0000\u0000\u0001\u0001\u0001\u0001\u0001\n\u0000\n\u0000\n\u0000\n\u0001\n\u0001\n\u0001\n\u0000\n\u0000\n\u0000\n\u0001\n\u0001\n\u0001\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\nIncoming\nfluid\nη\nη=\nη=b+h\nb\nx\nz\ns\n\u0000\u0000\n\u0000\n\u0000\u0000\n\u0000\u0000\n\u0000\u0000\n\u0000\u0000\n\u0000\u0000\n\u0000\u0000\n\u0000\u0000\n\u0000\u0000\n\u0000\u0000\n\u0000\u0000\n\u0000\u0000\n\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\n\u0001\u0001\n\u0001\n\u0001\u0001\n\u0001\u0001\n\u0001\u0001\n\u0001\u0001\n\u0001\u0001\n\u0001\u0001\n\u0001\u0001\n\u0001\u0001\n\u0001\u0001\n\u0001\u0001\n\u0001\u0001\n\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\ny\nsubstrate\ng\ns\n2\n1\nfluid film\naccretion\nW\nFigure 1: Configuration for solidification and fluid flow\n39\n00.2\n0.4\n0.6\n0.8\n1\n1.2\n1.4\n1.6\n-2 0 2 4 6 8\nw\na\nt\ne\nr\n \nh\ne\ni\ng\nh\nt\ns coordinate\nFigure 2: Two-dimensional fluid film driven by surface shear at times t =1, 3, 4, 4.5, 5, 7, 9,\n11, 15\n40\n00.5\n1\n1.5\n2\n2.5\n-2 -1 0 1 2 3 4\nw\na\nt\ne\nr\n \nh\ne\ni\ng\nh\nt\ns coordinate\nFigure 3: Two-dimensional fluid film driven by surface shear and gravity at times t =1, 3,\n4, 4.5, 5, 7, 9, 11, 15\n41\n-1\n0\n1\n2\n3\n-1\n0\n1\n2\n3\n0\n0.5\n1\n1.5\n2\n2.5\ns1 direction\ns2 direction\nfilm height\nFigure 4: Three-dimensional fluid film driven by surface shear and gravity on a flat surface\n42\n-1.5\n-1\n-0.5 -1.5\n-1\n-0.5\n0\n0.5\n1\n1.5\n2\n2.5\ns1 direction\ns2 direction\nfilm height\n1.5\n2\n2.5 1.5\n2\n2.5\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\ns1 direction s2 direction\nfilm height\nFigure 5: Close-up of moving fronts from Figure 4: (a) left hand front (b) right hand front\n43\n-1\n0\n1 -1\n0\n1\n0\n5\n10\n15\ns direction\nzeta direction\nIce height\n-1\n0\n1 -1\n0\n1\n0\n0.5\n1\n1.5\n2\ns direction\nzeta direction\nWater height\nFigure 6: (a) Accretion thickness on a flat substrate at t = 60 (b) corresponding film\nthickness\n44\n-50\n0\n50 -100\n-50\n0\n50\n100\n0\n5\n10\n15\ntheta\nphi\nIce height\n-50\n0\n50 -100\n-50\n0\n50\n100\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\ntheta\nphi\nWater height\nFigure 7: (a) Accretion thickness on a sphere at time t = 30 (b) corresponding film\nthickness\n45\n00.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n-2.5 -2 -1.5 -1 -0.5 0 0.5 1 1.5 2 2.5\nC a\nt c\nh\ns coordinate\n-20\n-15\n-10\n-5\n0\n5\n10\n15\n20\n-2.5 -2 -1.5 -1 -0.5 0 0.5 1 1.5 2 2.5\nS h\ne a\nr  s\nt r e\ns s\ns coordinate\n(a) (b)\n100500\n101000\n101500\n102000\n102500\n103000\n103500\n104000\n-2.5 -2 -1.5 -1 -0.5 0 0.5 1 1.5 2 2.5\nP r\ne s\ns u\nr e\ns coordinate\n150\n200\n250\n300\n350\n400\n450\n500\n550\n-2.5 -2 -1.5 -1 -0.5 0 0.5 1 1.5 2 2.5\nh t\nc\ns coordinate\n(c) (d)\nFigure 8: Flow around an aerofoil: (a) Collection efficiency (b) shear stress (c) pressure (d)\nheat transfer coefficient\n46\n050\n100\n150\n200\n250\n300\n-2.5 -2 -1.5 -1 -0.5 0 0.5 1 1.5 2 2.5\nI c\ne  \nh e\ni g\nh t\ns coordinate\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n-2.5 -2 -1.5 -1 -0.5 0 0.5 1 1.5 2 2.5\nW\na t\ne r\n h\ne i\ng h\nt\ns coordinate\nFigure 9: (a) Ice thickness on aerofoil at t = 500, 1000, 1500 (b) corresponding water\nthickness\n47\n"}