{"doi":"10.1038\/sj.jid.5700832","coreId":"97129","oai":"oai:generic.eprints.org:731\/core69","identifiers":["oai:generic.eprints.org:731\/core69","10.1038\/sj.jid.5700832"],"title":"BMB activity defines refractory and competent hair follicle populations during the propagation of regenerative waves","authors":["Plikus, M. V.","Baker, Ruth E.","Mayer, J.","Maini, P. K.","Chuong, C."],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2007","abstract":"n\/","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/97129.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/731\/1\/263.pdf","pdfHashValue":"c8ae98bd77d1e3055604aef70d53b9e040c771f4","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:731<\/identifier><datestamp>\n      2015-05-29T18:27:29Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4143:4D3932<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/731\/<\/dc:relation><dc:title>\n        BMB activity defines refractory and competent hair follicle populations during the propagation of regenerative waves<\/dc:title><dc:creator>\n        Plikus, M. V.<\/dc:creator><dc:creator>\n        Baker, Ruth E.<\/dc:creator><dc:creator>\n        Mayer, J.<\/dc:creator><dc:creator>\n        Maini, P. K.<\/dc:creator><dc:creator>\n        Chuong, C.<\/dc:creator><dc:subject>\n        Biology and other natural sciences<\/dc:subject><dc:description>\n        n\/a<\/dc:description><dc:date>\n        2007<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/731\/1\/263.pdf<\/dc:identifier><dc:identifier>\n          Plikus, M. V. and Baker, Ruth E. and Mayer, J. and Maini, P. K. and Chuong, C.  (2007) BMB activity defines refractory and competent hair follicle populations during the propagation of regenerative waves.  Journal of Investigative Dermatology, 127  (S1).   S107.      <\/dc:identifier><dc:relation>\n        10.1038\/sj.jid.5700832<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/731\/","10.1038\/sj.jid.5700832"],"year":2007,"topics":["Biology and other natural sciences"],"subject":["Article","PeerReviewed"],"fullText":"ABSTRACTS\n637\nAdult hair follicle stem cell compartment changes in androgenetic alopecia demonstrate\nmaintenance of progenitor stem cells with loss of descendant CD200high A6 integrinhigh\nexpressing cells\nLA Garza,1 M Lee,1 Y Liu,1,4 D Stanton,2 L Carrasco,2 J Tobias3 and G Cotsarelis1 1\nDepartment of Dermatology, University of Pennsylvania School of Medicine, Philadelphia,\nPA, 2 Department of Oral and Maxillofacial Surgery, University of Pennsylvania, Philadelphia,\nPA, 3 Bioinformatics Core, University of Pennsylvania, Philadelphia, PA and 4 Merck &\nCompany, Wales, PA\nThe status of adult stem cell compartments in tissue specific disease has not been thoroughly\naddressed. We tested the hypothesis that hair follicle stem cells might be depleted in andro-\ngenetic alopecia (AGA), which is characterized by drastic miniaturization of the hair follicle.\nTo compare hair follicle stem cell numbers between paired haired and bald scalp samples\nfrom the same individuals, we used flow cytometry to quantitate cell cycle, cell size, and\nexpression of CYTOKERATIN 15 (KRT15), FOLLISTATIN (FST), CD200 and alpha-6 integrin.\nWe found a gradient of stem cell characteristics, as defined by a high degree of KRT15 and\nFST expression, cellular quiescence and small cell size. This gradient is not grossly altered\nbetween haired and bald scalp, and stem cells are maintained in bald scalp. However, a spe-\ncific CD200 high alpha-6-integrin high population, which has characteristics of early stem\ncell progeny, is lost in bald scalp. Consistent with the loss of the immunosuppressive CD200\nprotein, array based expression profiling demonstrates significant increases in inflammation\nassociated genes in androgenetic alopecia. Previous reports of CD200 loss leading to alope-\ncia in mouse models suggest that AGA may be exacerbated or caused by CD200 downregu-\nlation in the human hair follicle stem cell compartment.\n639\nBMP activity defines refractory and competent hair follicle populations during the propa-\ngation of regenerative waves\nM Plikus,1 R Baker,2 J Mayer,1 R Maxson,1 P Maini2 and C Chuong1 1 Pathology, University\nof Southern California, Los Angeles, CA and 2 Oxford, Oxford, United Kingdom\nHair cycle can be regulated by molecular oscillation within the follicle (autonomously) or by\ndynamic changes in the inter-follicular environment (non-autonomously). While human hair\nfollicles largely cycle autonomously, cycling of mouse hair follicles is affected by the status\nof adjacent follicles. Thus hair cycle progression can advance like a transverse wave on the\nsurface of the skin. Observations of the dynamic hair cycle domains on the skin of wild type\nand Msx2-\/- mice show that each hair cycle domain is made of an initiation site, a propagat-\ning wave, and boundaries. Analyses of patterns of wave propagation and boundary formation\nled us to identify a novel stage in telogen. In the first stage of telogen, hair follicles are refrac-\ntory to the anagen spreading wave, thus forming a sharp domain boundary. Refractory telo-\ngen is characterized by multiple site expression of Bmp4\/Bmp2 intra-follicularly and inter-\nfollicularly. These Bmps sustain BMP reporter activity within follicles throughout refractory\nstage of telogen. Telogen follicles become competent to respond to anagen initiation signals\nafter Bmp 2\/4 loss. Hair plucking can induce anagen in competent follicles, but not refrac-\ntory ones. In KRT14-NOG mice there is drastic shortening of the refractory telogen, and fast\nanagen re-entry. Individual follicle cycles faster and the wave dynamics of follicle populations\nare altered. Transplantation of a piece of KRT14-NOG skin to normal skin microenvironment\nresults in restoration of Bmp signaling activity and refractory telogen. Our data identifies two\nnew stages of telogen, refractory and competent. They are defined by the ability of telogen\nfollicles to re-enter anagen, and based on the on-and-off switches of Bmp2\/4 expression within\nand surround the follicle. This study presents a novel population approach to the study of hair\ncycling, and gives a more systematic and integrative explanation to the hair follicle behaviors\nobserved in classical literatures.\n641\nReactive oxygen species (ROS)-mediated androgen-inducible TGF-β1 regulation in dermal\npapilla cells\nH Yoo, Y Kang, M Sung, S Kim, O Kwon, K Kim, H Eun and K Cho Department of\nDermatology, Seoul National University, College of Medicine, Laboratory of Cutaneous Aging\nand Hair Research, Clinical Research Institute, Seoul National University Hospital and\nInstitute of Dermatological Science, Seoul National University, Seoul, South Korea\nIntracellular signaling roles of reactive oxygen species (ROS) generated in response to andro-\ngen hormone in hair follicle dermal papilla cells are not well defined. To assess the correla-\ntion of ROS (hydrogen peroxide) known to increase in aging process to hair loss, the rat vib-\nrissae dermal papilla cell line (DP-6) overexpressed with AR was investigated to evaluate the\nrole of ROS on androgen-induced increase of TGF-β1 secretion. The AR stably-transfected DP-\n6 cells were incubated with synthetic androgen, R1881. Intracellular production of ROS\nmarkedly increased with R1881 treatment in DP-6 cells, which was measured by flow cytom-\netry and laser scanning confocal microscopy. Moreover, androgen-inducible TGF-β1 was sig-\nnificantly suppressed by several species of ROS scavenger or inhibitors. Luciferase reporter\nassays showed suppression of TGF-β1 promoter signaling by ROS scavengers. In conclusion,\nour study shows for the first time that androgen-induced TGF-β1 regulation would be medi-\nated by ROS and prevented by antioxidants or ROS inhibitors in hair follicle dermal papilla\ncells. We suggest that antioxidants could be one of the candidates to control androgen-medi-\nated pattern hair loss.\n640\nA role of CYLD in hair cycling mouse\nK Moriwaki,1 D Tsuruta,1 K Sugawara,1 H Kobayashi,1 R Massoumi2 and M Ishii1 1\nDermatology, Osaka City University Graduate School of Medicine, Osaka, Japan and 2\nMolecular Medicine, MaxPlanck-Institute for Biochemistry, Martinsried, Germany\nCYLD is a tumor suppressor gene mutated in familial cylindromatosis, an autosomal-dominant\ncondition that predisposes to multiple skin tumors. The gene product, CYLD, is a deubiquiti-\nnating enzyme recently implicated in modulation of the NF-κB pathway. Recent report by Mas-\nsoumi R. et al (2006) described that CYLD protein is prominently expressed in the inner root\nsheath of normal human scalp hair follicles. Thereupon we considered CYLD might have some\neffect in normal hair cycle thru NF-κB signaling. To investigate a role of CYLD during hair\ncycling, we adopted C57BL\/6 hair cycling model mouse, and characterized changes in their\nexpression by semiquantitative RT-PCR and western immunoblot and immunohistochemistry\nfor protein. We found that CYLD at mRNA level increased from anagen stage to catagen\nstage, as well as protein level in immunobolt. In immunohistochemistry, CYLD protein is\nexpressed in surrounding bulge areas. Moreover, we assessed whether CYLD regulate hair\ngrowth using in vitro hair culture. Recombinant CYLD inhibited hair growth. In conclusion,\nour results indicate that CYLD function on conversion from anagen stage to catagen stage.\n638\nKeratinocyte-specific expression of c-myb is dependent on growth and differentiation state\nJM Luna,1 ML Clarke,2 J Frampton2 and A Engelhard1 1 Department of Dermatology, College\nof Physicians and Surgeons, Columbia University, New York, NY and 2 Institute of Biomedical\nResearch, University of Birmingham Medical School, Edgbaston, United Kingdom\nMany genes with a role first defined in hematopoiesis have recently been shown to define\nstem cell niches and regulate essential cellular processes in the skin. In hematopoietic cells,\nc-myb expression is required for proliferation but prohibitive of differentiation. Viral trans-\nduction of truncated c-myb causes leukemia in chickens, and murine c-myb null mutation\nis lethal at e15, due to the failure of hematopoiesis. Here, we examined the expression pat-\ntern of the c-myb transcription factor in keratinocytes to determine if it might also regulate\ncell growth and differentiation in the skin. Upon release from serum starvation, absolute quan-\ntification of c-myb RNA levels demonstrated cell cycle-regulated expression in cultured human\nkeratinocytes. Temporal studies of c-myb RNA levels during calcium-induced differentiation\ndefined downregulation of c-myb expression as a late marker of keratinocyte differentiation.\nBoth results are consistent with the expression pattern of c-myb in hematopoietic cell lines.\nFurthermore, immunohistochemistry on normal murine skin revealed that c-myb protein is\npresent not only in the proliferating basal layer of the interfollicular epidermis, but also in\nthe suprabasal layer. In the hair follicle, c-myb is expressed in a hair cycle-dependent man-\nner. During late anagen, c-myb is expressed in the hair matrix and the outer root sheath and\nis absent from the inner root sheath, cortex and dermal papillae. This expression pattern\nextends into early catagen, but c-myb nuclear staining is not detected in telogen. The tem-\nporo-spatial expression pattern of c-myb suggests that it is a novel regulator of keratinocyte\nproliferation and differentiation in the epidermis and hair follicle. Conditional ablation in the\nepidermis is ongoing, and is expected to reveal in vivo functions as well as insights into down-\nstream transcriptional target genes.\n642\nGlobal microarray analysis of the follicular and glandular types of epidermal differentiation:\na role for BMP signaling in suppressing trans-differrentiation of the foot pad epidermis towards\nfolliculogenesis\nAA Sharov,1 TY Sharova,1 AN Mardaryev,1,2 AV Sargsyan1 and VA Botchkarev1 1\nDermatology, Boston University School of Medicine, Boston, MA and 2 Medical Biosciences,\nSchool of Life Sciences, University of Bradford, Bradford, United Kingdom\nDuring skin development, epithelium and mesenchyme interact with each other and give raise\nthe formation of epidermis and a variety of appendages (hairs, nails, glands). To characterize\nglobal gene expression profiles associated with distinct types of epidermal differentiation (fol-\nlicular versus glandular), epithelial buds of the hair follicles (HFs) and sweat glands (SWGs),\nas well as the matrix and epithelium of fully-developed HFs and SWGs were obtained from\nembryonic and adult mouse foot pads and ventral skin using laser capture microdissection.\nEpithelial buds of the HFs and SWGs showed expression of the bud-specific adhesion mole-\ncules, signaling\/transcription components, as well as appendage-specific markers such as\nHF-specific keratins (Krt1-c29, Krt2-6g) or SWG-specific ion channels (Clcn3, Bcng-3a). Fully\ndeveloped SWGs were characterized by strong downregulation of over 4000 genes com-\npared to the epidermis and by upregulation of SWG-specific genes involved in regulation of\nthe ion exchange\/water metabolism, while HFs showed less prominent differences in gene\nexpression versus the epidermis. In addition, SWG buds and fully developed SWGs showed\nstrongly reduced expression of Bmp7 and Smad1\/4 compared to the epidermis and HFs.\nInterestingly, K14-Noggin and Bmpr-Ib knockout mice showed ectopic formation of the HFs\nin foot pads accompanied by decreased expression of Engrailed 1, a potent repressor of the\ndorsal phenotype in ventral epidermis. These data suggest that HFs and SWGs are character-\nized by markedly different gene expression profiles, which may underlie fundamental differ-\nences in their functions, and that BMP signaling suppresses trans-differentiation of the foot pad\nepidermis towards folliculogenesis at least in part via stimulating the Engrailed 1 expression.\nwww.jidonline.org   S107\n"}