{"doi":"10.1111\/j.1475-4762.2006.00682.x","coreId":"65218","oai":"oai:dro.dur.ac.uk.OAI2:6479","identifiers":["oai:dro.dur.ac.uk.OAI2:6479","10.1111\/j.1475-4762.2006.00682.x"],"title":"Affect - an ethnocentric encounter? Exploring the 'universalist' imperative of emotional\/affectual geographies.","authors":["Tolia-Kelly, Divya P."],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2006-06-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65218.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6479\/1\/6479.pdf","pdfHashValue":"6453a185794d4caf13a9fd3abe1fa297df98ad68","publisher":"Blackwell","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6479<\/identifier><datestamp>\n      2015-09-10T13:27:09Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Affect - an ethnocentric encounter? Exploring the 'universalist' imperative of emotional\/affectual geographies.<\/dc:title><dc:creator>\n        Tolia-Kelly, Divya P.<\/dc:creator><dc:publisher>\n        Blackwell<\/dc:publisher><dc:source>\n        Area, 2006, Vol.38(2), pp.213-217 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2006-06-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6479<\/dc:identifier><dc:identifier>\n        issn:0004-0894<\/dc:identifier><dc:identifier>\n        issn: 1475-4762<\/dc:identifier><dc:identifier>\n        doi:10.1111\/j.1475-4762.2006.00682.x<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6479\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1111\/j.1475-4762.2006.00682.x<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6479\/1\/6479.pdf<\/dc:identifier><dc:rights>\n        The definitive version is available at www.blackwell-synergy.com<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1475-4762"," 1475-4762","issn:0004-0894","0004-0894"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n06 April 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nTolia-Kelly, Divya P. (2006) ’Affect - an ethnocentric encounter ? exploring the ’universalist’ imperative of\nemotional\/affectual geographies.’, Area., 38 (2). pp. 213-217.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1111\/j.1475-4762.2006.00682.x\nPublisher’s copyright statement:\nThe definitive version is available at www.blackwell-synergy.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nDurham Research Online \n \nDeposited in DRO: \n06 April 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nAccepted for publication version \n \nCitation for published item: \nTolia-Kelly, D. P. (2006) 'Affect - an ethnocentric encounter ? exploring the 'universalist' \nimperative of emotional\/affectual geographies.', Area., 38 (2). pp. 213-217. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1111\/j.1475-4762.2006.00682.x \n \nPublisher’s copyright statement: \nThe definitive version is available at www.blackwell-synergy.com \n \n \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \n 1 \nAffect - an ethnocentric encounter?: exploring the ‘universalist’ imperative of \nemotional\/ affectual geographies \n \n \n \nDivya Tolia-Kelly (Dr) \nLecturer in Social and Cultural Geography \nDepartment of Geography \nUniversity of Durham, \nRoom 412, West Building, \nScience Site, South Road, \nDurham, DH1 3LE. UK. \n \nTelephone: +44 (0) 191 334 1819 \nFax: +44 (0) 191 334 1801 \ne-mail: divya.tolia-kelly@durham.ac.uk \n 2 \nAffect - an ethnocentric encounter?: exploring the ‘universalist’ imperative of \nemotional\/ affectual geographies \n \nWithin international fora (e.g. AAG 2005\n1\n) and in publications, we are made aware that \naffect and emotion operate on different political landscapes. Although both „affectual‟ \nand „emotional geographies‟ attempt to attend to the intractable silence of emotions in \nsocial research and public life (Anderson and Smith, 2001), the field of „emotional‟ \ngeographies is the location of the recovery work that embraces embodied experience and \nthe political materialities that resonate from and that are formed through emotions. The \nvalue of an affectual approach over writing through emotion is often intangible and \nimmeasurable, yet these two fields are simultaneously conjoined and separate because of \ntheir subject matter, language, their political vision and genealogies. „Emotional \nGeographies‟ (Anderson and Smith 2001, Davidson and Bondi 2004) however, assert a \nspace for feminist politics, race and difference, and I would argue that this is because \nembedded in this intervention is a memory of social theories of difference, namely those \nthat are embodied in a feminist critique of modernity and its legacy. The difference \nbetween this plane of enquiry and the research on affect, is that affect reflects a \ndistillation of embodied experience to geometric modes and textures of feeling. Emotion \nis relegated to immediacy, immanence and the virtual in the everyday lived environment; \nintrinsically embedded in universalist thought rather than the geopolitical landscape that \nconstitutes our universal political life. I argue here that a sensitivity to „power \ngeometries‟ is vital to any individuals‟ capacity to affect and be affective. \n                                                 \n1\n Geographies of Affect session organized by John-David Dewsbury and Jennifer Lea (Bristol University) \nat the Annual, „Association of American Geographers Conference‟, April 2005, held in Denver, Colorado. \n 3 \n \nPolitically, writers such as McCormack (2003) identify the difficulties in an ethical \nproject against representation. McCormack is keen to embrace the need  to understand \nhow “apprehending the power of „interest‟ is always as much a question of visceral \nsensibility as it is a question of situating the habitual practices of the everyday in relation \nto wider discursive and \/ or political economies. The habitual economies of the everyday \nare not simply the matter upon which power works. They are power in themselves” \n(2003, 490). This is an imaginative and valuable project. However, one that would be \nenriched by a consideration of the multiplicities and complexities of affectual registers \nand flows. A new theorisation against a universalist sensibility, which is embedded in the \nhistorical practice of social theory that is enriching. Affective economies are defined and \ncirculate through and within historical notions of the political, social and cultural \ncapacities of various bodies as signified rather than those specifically encountered, felt, \nloved, loathed and sensed (Ahmed 2004a). This commentary is a call for recognising the \n(historicist) memory and vitality of an anti-universalism that multiplies the sites and \nencounters possible in this enlivening field of research that is „affectual\/ emotional‟ \ngeographies. This move does not need to be burdened by representational theories per se \nbut acknowledge that affective capacities of any body are signified unequally within \nsocial spaces of being and feeling; any engagement with affective economies and \ncapacities of being, thus require a sensitive touch. \n \nAny political orientation towards „intensities of feeling‟, should be sensitive to power \ngeometries and ultimately challenge “anaemic knowledges” (Anderson and Smith 2001, \n 4 \n9). Occlusions of matrices of power, result in an universalist and ethnocentric \ntheorisations. The dangers of universalism are mirrored in political rhetoric of neo-\nconservatism, post 9\/11. In this period we have endured metonymical slippages in \nprovocative pronouncements of what „others‟ and „terrorists‟ are. These slippages are \nwhere a universal figure of „non-patriot‟, „bomber‟ and „Muslim cleric‟ supports a \nclimate of fear and loathing of any number of bodies, that do not slip back into being  \nfigures of acceptable, loveable citizen (Ahmed, 2004a; Ahmed, 2004b). When this figure \nis universally identified, this body is disorientated and unmappable; „it becomes difficult \nto locate, situate, personify and identify” (Ahmed 2004a, quoting Weber, 135). This lack \nof specificity denies the fact of our myriad abilities to move, be feared, loved and hated \nwithin the social sphere into a world where universal types are operative and the legacy \nof cultural theory has been lost. To counter these universalist imperatives in the theories \nof affect it is important to consider the literary cornerstones of Thrift‟s own manifesto. \n \nAffect, Spinoza and the scale of the univers(al) \nThrifts‟ (2004) account enables us to explore and register relationships between material, \nlived environments and the emotional processes that shape space and materially \nconfigure the dynamics of encounter within and through them. It is significant that there \nare a singularity of registers of affect and emotion, that are declared in this extremely \nimportant call. Thrifts‟ productive intervention requires some stretching beyond its \nuniversalist approach. This criticism, although not new criticism (Nash, 2000), is one that \nis embedded in an understanding of the registers of emotion as singular, within a \n„transhuman‟ conception of the world that is an(ti)-historicist and essentially \n 5 \nethnocentric. This new „politics of affect‟ encourages us to proceed with  an orientation \nthrough which the world can be felt, known and understood and expressed, inevitably \nthrough text. This restriction to the textual is in itself problematic, and is contrary to the \nimperatives of a theoretical politics that is concerned with the registers of emotion and \nembodied practice.  \n \nOne problematic of this textual encounter is that the pivotal cornerstones of this theory \nare based on a westnocentric literary and sensory palette. Thrift acknowledges that his \npolitical call “risks ethnocentricism in an area which, more than most, has been aware of \ndifference” (2004, 59). This is not a wholly responsible caveat in a post-modern social \nworld of difference and as a result an exponentially expanding cultural theory. Issues of \npower and difference that reverberate through the materiality, through which affective \ncapacities are figured, shaped and expressed are occluded here. To put this simply, \naffective registers have to be understood in the context of multiple power geometries that \nshape our social space; different bodies have different affective capacities. Various \nbodies through their racialised, gendered and sexualised markedness, magnetise various \ncapacities for being affected; a slave and holocaust victim do not necessarily experience \npain, suffering, anomie, in the same way due to their social positioning and „enforced‟ \ncapacities of (im)mobility, experience and affecting the social space around them. As \nGilroy (2000) states, racial hierarchies continue to exist and thus influence the material \nways in which marked bodies shape modern social space, thus assuring the different \ncapacities, rhythms and resistances afforded them. A body that is not signified as a source \nof fear, through its markedness, cannot be free to affect and be affected similarly to one \n 6 \nthat is not. Collecivities of affect are engendered, shaped and empowered though visual \nand social registers. A contextual node of understanding „pain‟ „fear‟ „anger‟ and „loss‟ in \nrelation to these geometries of difference is essential to effect an embodied theorisation \nof affect and emotion. To explain further I will draw on Deluzes‟(1988) conceptualisation \nof affective capacity.  \n \nDeluze (1988) writing on Spinoza has been one of the cornerstones of current \ngeographical forging of theories of affect. In his (Spinoza‟s) concept of the individual in \na singular (transhuman) nature “What is involved is no longer the affirmation of a single \nsubstance, but rather a laying out of a common plane of immanence on which all bodies, \nall minds, and all individuals are situated.” (1988, 125) This modal plane allows a sense \nof being that is a geometric positioning, one defined by latitude and longitude. On this \nplane “There is no longer a form, but only relations of velocity between infinitesimal \nparticles of an unformed material. There is no longer a subject, but only individuating \naffective states of anonymous force. Here the plan is concerned only with motions and \nrests, with dynamic affective charges” (ibid; 128) This description bounds us to think on \nthe scale of the universe(al); forces and movements are upon matter and in this scale \nmaterials of organic, inorganic collective and individual are bound via one singular plane. \nOn the scale of the individual, the logic of this universalism is extended to deny the \nforces of differential positionings that are not simply physical capacities for movement, \nfeeling or being, instead a possibility of understanding variances of mass (physically and \npowerfully) amongst this scale of the individual human the only differentials are defined \nthrough an understanding of „body‟ as equalised through a geometric and physical \n 7 \nrelationship. For example a “body affects other bodies, or it is affected by other bodies; it \nis this capacity for affecting and being affected that also defines a body individually” \n(p?)A body can be figured s a collective group or indeed as a singular piece of music, in \nDeluze‟s interpretation, yet, the ways in which these collecivities are differently capable \nof affecting and being affected because of their access to social\/geopolitical power, \nidentifications through others‟ affective strategies for „hate‟ and or „love‟ is not engaged \nwith. In this politics of affect, what is needed is an attentiveness to the various sensory \nmodes of being, resulting from varied capacities to be affective. Gilroy, reflecting on the \npolitical project of bridging tensions between „essentialist identity‟ a project of „planetary \nhumanism‟ argues that “We (also) need to consider how a deliberate engagement with the \ntwentieth century‟s histories of suffering might furnish resources for the peaceful \naccommodation of otherness in relation to fundamental commonality” (Gilroy 2004, 3). \nAlthough Gilroy‟s project is humanist, his call for a historical sensitivity to affectual \nregimes of experience and rule can be applied beyond the human; the inorganic and \norganic do not require separate spheres of historical memory here. By acknowledging \npower geometries of our present as linked to our pasts, we can make complex the \nperameters and flows of affectual capacities and sensitivities which course through \neveryday life. \n \nIn recent writing in cultural geography the power of spatial politics are pivotal to the \nmaterialising of particular geographies that reduce material encounters to categories of \n„race‟, „gender‟ and „sexuality‟ (Saad and Carter, 2005). Also writing on „whiteness‟ \n(Bonnett 1996; 1997; 2000) has been central to thinking through assumed racial \n 8 \nuniversalisms that exist in visually dialogic media that shape our world (Dyer 1997). \nSarah Neal (2002) also argues for varied racisms as experienced by ethnic groups in the \nBritish countryside. Emotional\/ affectual geographies are therefore not experienced on \nsingular, tangible and measureable registers of emotion. It is thus critical to think plurally \nabout the capacities for affecting and being affected, and for this theorisation to engage \nwith the notion that various individual capacities are differently forged, restrained, \ntrained and embodied. One set of writings that have argued this has been that on race and \nracisms (Gilroy 1987;1993, Goldberg, 1993, Hall 1990; 1996; 1997, Hall and du Gay, \n1996, Solomos, 1993, Solomos and Back, 1995) which have ultimately been figured \nthrough various nodes of „hate‟ and „love‟. \nReferences \nAhmed S 2004a Affective Economies Social Text 22 114-39 \nAhmed S 2004b Collective Feelings: Or The Impressions Left By Others Theory Culture \nAnd Society 21 25-42 \nAnderson K and Smith S J 2001 Emotional Geographies Transactions Of The Institute \nOf British Geographers 26 7-10 \nBonnett A 1996 'White Studies': The Problems And Projects For A New Research \nAgenda Theory Culture And Society 13 145-55 \nBonnett A 1997 Geography 'Race' And Whiteness: Invisible Traditions And Current \nChallenges Area 29 193-199 \nBonnett A 2000 White Identities: Historical And International Perspectives New York \nPrentice Hall \nDavidson J and Bondi L 2004 Spatialising Affect; Affecting Space: An Introduction \nGender Place And Cultue 11 373-4 \nDeluze G 1988 Spinoza: Practical Philosophy San Francisco Ca City Lights Books \nDyer R 1997 White London Routeledge \nGilroy P 1987 'There Ain't No Black In The Union Jack' : The Cultural Politics Of Race \nAnd Nation London Routeledge \nGilroy P 1993 Small Acts : Thoughts On The Politics Of Black Cultures Serpents Tail \nGilroy P 2000 Against Race Imagining Political Culture Beyond the Colour Line \nCambridge Massachusettes, Harvard University Press \nGilroy P 2004 After Empire New York, Routeledge \nGoldberg D 1993 Racist Cultures Oxford Blackwell \nHall S 1990 Cultural Identity And Diaspora In Rutherford J Ed Identity : Community \nCulture Difference London Lawrence And Wishart \n 9 \nHall S 1996 New Ethnicities In Morely D and Chen K-H Eds Stuart Hall : Critical \nDialogues In Cultural Studies London Routeledge \nHall S ed 1997 Representation: Cultural Representations And Signifying Practices \nLondon Sage \nHall S and du Gay P, eds 1996 Questions Of Cultural Identity London Sage \nNash C 2000 Perfrmativity In Practice: Some Recent Work In Cultural Geography \nProgress In Human Geography 24 653-664 \nNeal S 2002 Rural Landscapes Representations And Racism: Examining Multicultural \nCitizenship And Policy-Making In The English Countryside Ethnic And Racial \nStudies 25 442-461 \nSaad T and Carter P 2005 The Entwined Spaces Of 'Race' Sex And Gender Gender \nPlace And Culture 12 49-51 \nSolomos J 1993 Race And Politics In Contemporary Britain London Macmillan \nSolomos J and Back L 1995 Race Politics And Social Change London Macmillan \n \n \n \n"}