{"doi":"10.1068\/a3699","coreId":"65663","oai":"oai:dro.dur.ac.uk.OAI2:5152","identifiers":["oai:dro.dur.ac.uk.OAI2:5152","10.1068\/a3699"],"title":"Malestream geography : gender patterns among UK geography faculty.","authors":["Crang,  M."],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2003-01-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65663.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5152\/1\/5152.pdf","pdfHashValue":"7e932d5660c23b6d094e04ddacfd266faa516463","publisher":"Pion","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5152<\/identifier><datestamp>\n      2011-10-03T15:56:00Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Malestream geography : gender patterns among UK geography faculty.<\/dc:title><dc:creator>\n        Crang,  M.<\/dc:creator><dc:publisher>\n        Pion<\/dc:publisher><dc:source>\n        Environment and planning A, 2003, Vol.35(10), pp.1711-1716 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2003-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5152<\/dc:identifier><dc:identifier>\n        issn:0308-518X<\/dc:identifier><dc:identifier>\n        issn: 1472-3409 <\/dc:identifier><dc:identifier>\n        doi:10.1068\/a3699<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5152\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1068\/a3699<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5152\/1\/5152.pdf<\/dc:identifier><dc:rights>\n        M. Crang, 2003. The definitive, peer-reviewed and edited version of this article is published in \\ud\nEnvironment and planning A, 35, 1, pp. 1711-1716, 2003, http:\/\/dx.doi.org\/10.1068\/a3699<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0308-518x"," 1472-3409","issn:0308-518X","issn: 1472-3409"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n07 October 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nCrang, M. (2003) ’Malestream geography : gender patterns among UK geography faculty.’, Environment and\nplanning A., 35 (10). pp. 1711-1716.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1068\/a3699\nPublisher’s copyright statement:\nM. Crang, 2003. The definitive, peer-reviewed and edited version of this article is published in Environment and\nplanning A, 35, 1, pp. 1711-1716, 2003, http:\/\/dx.doi.org\/10.1068\/a3699\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n07 October 2008\nVersion of attached file:\nAccepted\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nCrang, M. (2003) 'Malestream geography : gender patterns among UK geography faculty.', Environment and\nplanning A., 35 (10), pp.\u00001711-1716.\nFurther information on publishers website:\nhttp:\/\/dx.doi.org\/10.1068\/a3699\nPublishers copyright statement:\nM. Crang, 2003. The definitive, peer-reviewed and edited version of this article is published in \u0000\u0000Environment\nand planning A, 35, 1, pp. 1711-1716, 2003, http:\/\/dx.doi.org\/10.1068\/a3699\nMalestream Geography: Gender Patterns among  UK Geography Faculty \n \nThis commentary reports the data available on the relative numbers of academics by \ngender and grade in the UK. It grows out of an accumulation of factors and events. \nFirst, conversations with colleagues, second papers on the social composition and \ngendered structures of geography as a discipline, and, third, a flier circulated with US \nfigures at the 2002 AAG meeting, and finally and crucially, a lecture last year in a \ncourse on geography and gender. In that session I was doing a simple illustration of \ngendered occupational structures and their relevance to even the august institution that \nemploys me and thus even to the fairly privileged lives of my students. I pointed out \nthat in our department there were some ten full professors, of whom one was a \nwoman, that there was (at the time) one other promoted woman and six women \nlecturers out of forty-three or so faculty, and this I contrasted with the departmental \nsecretarial staff, entirely female, and the technical staff, ninety percent male, a \ngraduate school around one third women and their undergraduate cohort which was \nfifty-two percent women. I am sure many of us have done a similar little spiel. One \nbrave and curious soul asked how these percentages compared with national UK \nfigures. I was stumped, and curious myself as to the answer. So I set off to track down \nthe figures which form the main body of this commentary. I want to begin then by \nsetting out a few of the issues and contexts around the data, then briefly describe the \nfigures for the UK and draw out a few striking elements. I do not purport in this brief \npiece to offer much by way of explanation, but hope the numbers themselves may be \nsalutary. \n \nWomen’s Represenation in Geography Departments \n 1\n There is a long history of exclusion of women from the institutions of geography (see \nfor instance Bell and McEwan, 1996). Recent studies paint a mixed picture of gains \nfor women in geography over the last twenty years, but one where the higher in the \ndiscipline you look the less progress seems to have occurred. It seems analogous to \nthe situation described in the Greenfield report (2002) on women in science which \nargued there was less a glass ceiling and more a ‘leaky pipe’, with obstacles appearing \nfor women at several career transitions. Winkler (2000) highlights the drop off for \nwomen’s representation in US geography through the tenure system with women \nholding only 16.2% of tenure stream positions in 1997-8 (up from 7.8% in 1988-9; \npage 738). To follow this issue of promotion and career path, we can look across a \nrange of levels of seniority and influence in the discipline. Among undergraduate \ngeography students, throughout the 80s in Britain the gender balance held steady at \naround 45-50% female (Chapman  1995, page 64). However there was a significant \ndisparity in final degree results. From 1973 to 1992 there was a significant general \nimprovement in results with the modal class shifting from lower to upper second (the \nproportion of 2:1s rising from around 35% in 1973 to around 50% by 1993). The \ngender break down though shows 55% of women in 1992 getting an upper second to \n45% of men, while the percentages of women gaining firsts was consistently one to \ntwo percentage points below men but also a two to three point gap in third classes \nwhere men outnumber women. The implication has been drawn that female students \nmay be more risk averse in terms of producing answers that show ‘flair’ that tend to \ngain the highest grades – with male students more likely to make riskier arguments. \nThis is not to say students risk thirds in order to get firsts, but rather that male students \nmay be more self-confident, sometimes foolishly so, more willing to argue their own \n 2\ncase – which attracts the attention of the examiner to their gain or detriment (Hunt \n2003). This raises questions at what is valued in terms of top grades and what forms \nof assessment reward what characteristics that are beyond the scope of this \ncommentary.  \n \nMcKendrick (1996, page 321) suggests that through the eighties up to 1994 the \npercentage of women postgraduate students in geography rose from 18% to 38%. \nThere is though a notable divide emerging from the mid eighties where the percentage \nof female physical geography graduate students actually falls from 32% to 31% while \nthe proportion in human geography rises from 33% to 43.6% (McKendrick 1996, \npage 324). To offer an updated snapshot, the gender breakdown of applications for \nfunding for Economic and Social Research Council human geography research \nstudentships in 2002 was 68 male and 73 female applicants resulting 25 and 24 \nawards respectively. For the USA, Brinegar’s 1998 survey data suggests women \ncomprised some 35% of doctoral, 37% of masters and 40% of Bachelors students \n(Brinegar 2001, pages 313, 315). Moving up a rung the numbers are fairly volatile for \nUK research grade staff predominantly funded from sources such as grants. Over the \nsix years there is no clear trend but 27 to 37% of those researchers funded from core \nrecurring institutional funds were women, and 35 to 41% of those funded by other \nsources. As we shall see these figures are higher than for established faculty, and we \nmight note the higher proportion of women on the potentially more insecure funding \nsource. \n \nINSERT TABLE 1 ROUND HERE \n \n 3\nAs we move through faculty levels though the percentages of women drop, so that \naccording to UK official figures from the Higher Education Statistics Agency (table \n18a, Resources in Higher Education Institutes, annual reports 1996-2001) women \ncomprised only 17.9% of total core funded full time academics in 1994-95, a figure \nwhich has risen to only 20.9% by 2000-01 (table 1). The figures record full time \nacademics in posts funded by core recurring grants rather than, say, research contracts \nor in consultancy units. We should note then that the official figures do not record \npart-time full-time splits by discipline, gender and grade which badly limits their \ndepiction of the full pattern of gendered work patterns. As a comparison in the USA \nwomen on average comprised 16.2% of faculty across all types of departments but \nactually did better in more prestigious departments, forming some 17.2% in PhD \nawarding departments in 1997-8 (Winkler 2000, page 743). Winkler’s data are \ncomplemented by survey figures suggesting that women comprised 11% of tenured \nfaculty in 1998 but 28% of non-tenured (Brinegar 2001, page 313). These figures are \nsuggestive of a ‘leaky pipe’ analysis where we might expect a falling off each level of \nprogression, and sure enough if we compare UK data for lecturer grade, then senior \nlecturer (principal lecturer in ‘New Universities’) and readers, and then professors \n(figure 1) we find in 1994-5 just 6.5% of professors were women, and women formed \nonly 10.5% of other senior grades, and 23.6% of lecturers. In 2000-01 this had \nchanged so that 8.6% of professors, and 20% of senior grades but 26.2% of lecturers \nwere women. The progress of percentages is a little jumpy reflecting that say for \nchairs, we are actually talking about moving from only 8 female professors to the \ngiddy heights of 20. In the whole country.  \n \nFIGURE 1 AROUND HERE: \n 4\n One important element of this might be a cohort effect. Thus women becoming chairs \nnow probably reflect the gender patterns of postgraduates fifteen to twenty years \npreviously. An increasing number would thus be expected to reflect the rise in \nwomen’s participation as postgraduates through the eighties and indeed there are two \nand half times the number the women professors there were just six years ago. \nHowever, against this it needs to be said that in a changing career structure there are \nalso nearly twice as many male professors as there were six years ago. The relative \nrate of improvement is thus less spectacular. And the division in career terms remains \nvery stark if we put it another way, that in 1994-5 14% of all established male \ngeography academics were professors, as opposed to 4.4% of women, by 2000-01 that \nhad changed to 23.2% and 8.2% respectively. At the lower ends of the scale in 1994-5 \n79.4% of women were on the lecturer scale which had fallen to 65.3% by 2000-01, \nwhile for men the percentages fell from 56.1% to 48.6%. Comparatively in the US \n47.7% of women are at the rank of assistant professor compared to only 23.3% of \nmale faculty and only 8% of women were full professors (Winkler 2000, page 743-4). \nThe shifting proportions of each gender at each grade are illustrated in figure 2. I am \nconscious that proportional figures do not convey the discrepancies of absolute \nnumbers effectively, so figure 3 presents the same data in actual numbers. The \nabsolute differences in numbers are thus between say 215 male professors, 260 male \nsenior staff and 450 lectures and 20, 65 and 160 women at those respective grades in \n2000-01.  \n \nINSERT FIGURE 2 ROUND HERE \n \n 5\nConcluding discussion \n \nThe question that this begs is whether this change is good going or laggardly. One of \nthe perpetuating effects noted by Winkler (2000, page 743) has been that most women \nhave been isolated – for instance, the modal number of women faculty in Bachelors \ndegree awarding departments in the US in 1997-8 was 0, in MA awarding ones it was \n1 and in PhD awarding ones it was 2. Or as an anonymous flier at the Los Angeles \nAAG meeting in 2002 put it, not only are only 9% of all Full Professors women but \n15 of the 36 PhD granting programmes in the US have no women full professors, and \nin Canada the figure is 11 out of 21 (Anon 2002). In terms of appointment and \npromotion votes, and the more informal networks of influence, this does not favour \nwomen’s advancement (Hanson 2000). It is also clear that women’s biographies and \nconstraints around double career households in a profession that often can involve \nlong distance moves to gain promotion play an important role in the career profiles of \nwomen (Monk 2001).  \n \nThe data here cannot really speak to the processes at work and all we can do is make \nsome tentative observations as to the rate of change. The proportion of women overall \nhas risen by 3 points, which is 17% increase over six years, and represents a 36% rise \nin the number of women with established posts. While the percentages sound \nimpressive they do not represent much more than ‘natural’ cohort effects since in the \nsame period, there has been a 16% increase overall in the number of faculty, and \ngiven that around 13% of faculty were over 55 in 1994-5, and thus many will have \nretired (and that they would have been overwhelmingly men) there should be \nsomething around 30% new faculty in the system, and women’s representation almost \n 6\nhad to rise. In terms of absolute numbers, we could note that they indicate an increase \nof one hundred men in full time established positions in geography departments. If we \nallow for only people leaving the profession through retirement that would be 10% \nover six years1 that would indicate a guesstimate of 190 or so men entering the \nprofession. A similar calculation suggests that only 80 or so women did likewise. So it \nwould seem there is still a persistent recruitment imbalance. \n \nPerhaps the most interesting area is in the changing senior grades, where the number \nof men in that grade grew by 5%, while the number of women increased by 124% - \nthough once again we must remember that is only around 36 women being promoted. \nAt the most senior levels of professors while the rate of growth for women is faster \nthan overall growth, it still means that given retirements2 means 10 men were \nappointed for every woman deemed worthy of a chair during this period. This is from \na pool where, in 1994-5, there were eight times as many men who were senior \nlecturers and readers, a proportion that has now dropped to ‘only’ four times as many. \nPut another way it means that in 2000-01 18% of all British geography academics \nwere male professors (11.5% in 1994-95), while 1.7% were women professors (0.8% \nin 1994-95). At the other senior levels if we assume an average age distribution, and \nallowing for promotions to chairs (and assuming international transfers cancel out) \nthere have been around 150 men promoted to senior grades, which is to say one in \nthree of the male lecturers in 1994. Similar assumptions suggest that 51 women had to \nbe promoted to senior grades – again around one in three of female lecturers in 1994. \nThis grade then perhaps suggests the area of most rapid change, and it may be that we \nwill then see a rapid surge in women chairs as these senior grades establish \nthemselves. \n 7\n INSERT FIGURE 3 ROUND HERE \n \nHowever, it is perhaps first salutary to note that the situation is still so dire at the start \nof the twenty-first century. Looking at the upward trends of figure 1 should not \nobscure the fact that the overall percentage of women is still only just breaking the \ntwenty percent barrier and this is not a terrific achievement. Second, that the studies \nof women in science suggest it is the senior grades and promoted levels where issues \nsuch as taking career breaks or working part-time count most. How part-time work \naffects career progression is itself a tangled issue and it is perhaps indicative of the \nnormative assumptions about academic work that the official statistics count full time \nstaff. We might also note that women are underrepresented in winning research grants \nand the key factors identified were that women who had taken career breaks and\/or \nhad domestic responsibilities were less likely to apply, and that women tended to \noccupy junior grades which were less likely to be successful (Blake & la Valle 2001). \nAdd to this the fact that an industrial tribunal has pointed out that the RAE’s \nassumption of output in a given time period is pretty unforgiving of time out and thus \nborders on being discriminatory. Moreover, the figures I am reporting elide two senior \ngrades – reader, which is a ‘research led’ appointment, and senior lecturer, where \npromotion criteria include many of the institutional support and caring activities that \nare so often given to women faculty. How this might feed through to later promotion \nto Chairs, with almost wholly research criteria, is another large issue. Third, in many \nhousehold location moves women’s career prospects still tend to be sacrificed to a \nhigher earning male partners – something doubly likely given British academics’ \nsliding relative pay and women’s likelihood of being in more junior positions. Both \n 8\nthese latter factors would seem to suggest that more senior levels are likely to see \nslower progress than they otherwise might. At the moment the numbers suggest slow \nchange, but change nonetheless. \n \n \nReferences \nAnon. (2002) ‘Shocking Facts about the geographic discipline in North America. \nFlier, AAG Annual Meeting Los Angeles. \nBell, M. and C. McEwan (1996). \"The admission of women Fellows to the Royal \nGeographical Society, 1892-1914: the controversy and the outcome.\" The \nGeographical Journal 162(3): 295-312 \nBlake, M. and I. La Valle (2001). Who Applies for Research Funding? Key factors \nshaping funding application behaviour among women and men in British higher \neducation institutions. London, Wellcome Trust. \nBrinegar, S. (2001). \"Female Representation in the Discipline of Geography.\" Journal \nof Geography in Higher Education 25(3): 311-20 \nChapman, K. (1995). \"Geography Degrees and Gender: patterns and possible \nexplanations.\" Area 27(1): 62-73 \nHanson, S. (2000). \"Networking.\" Professional Geographer 52(4): 751-58 \nHigher Education Statistics Agency (1995) Resources of higher education institutions \n1994-5, Cheltenham \nHigher Education Statistics Agency (1996) Resources of higher education institutions \n1995-6, Cheltenham \nHigher Education Statistics Agency (1997) Resources of higher education institutions \n1996-7, Cheltenham \n 9\n 10\nHigher Education Statistics Agency (1998) Resources of higher education institutions \n1997-8, Cheltenham \nHigher Education Statistics Agency (1999) Resources of higher education institutions \n1998-9, Cheltenham \nHigher Education Statistics Agency (2000) Resources of higher education institutions \n1999-2000, Cheltenham \nHigher Education Statistics Agency (2001) Resources of higher education institutions \n2000-01, Cheltenham \nHunt, P. (2003) Gender specifics The Guardian, Tuesday February 11  \nMcKendrick, J. (1996). \"A discipline of Equal Opportunity? Gender and Participation \nin Postgraduate Geography.\" Area 28(3): 318-30 \nMonk, J. (2001). Many Roads: The Personal and Professional Lives of Women \nGeographers. Placing Autobiography in Geography. P. Moss. Syracuse, NY, \nSyracuse University Press: 167-87 \nWinkler, J. (2000). \"Faculty Reappointment, Tenure and Promotion: Barriers for \nWomen.\" Professional Geographer 52(4): 737-50 \n \nMike Crang, \nUniversity of Durham\n                                                 \n1 Since 13-15% of staff were over 55s a period of 6 years would see 8% reach compulsory retirement \nage, leaving aside the large number of early retirement schemes there have been. \n2 Since the overall number of men with chairs increased by 100 and if we assume that most existing \nchairs were over 45 the proportion of retirements could be around 30% in six years which is up to 40 \nposts to replace. \nTable 1 \n \nFull time UK  Geography Academics, funded by core HEFCE grant, by grade and \ngender \n           \n \n Number \nof Profs \n% of \nProfs \nNumber \nof SL\/R\n% of \nSL\/R \nNumber \nof \nLecturer\n% of \nLecturer \nTotal \nNumber\n% of \ntotal \nTotal \nnumber\n2000-01 \nMen 215 91.5 260 80 450 73.8 925 79.1 \n1170 \n Women 20 8.5 65 20 160 26.2 245 20.9  \nMen 116 93.5 247 89.5 464 76.4 827 82.1 \n1994-95 Women 8 6.5 29 10.5 143 23.6 180 17.9 \n1007 \n \nData from table 18a, Resources in Higher Education Institutes, Higher Education Statistics Agency, annual \nreports 1996-200 \n \n \n \n \n \n \n \n \n \n \n \n 11\n Figure 1: \nPercentage of each grade who are women\n0\n5\n10\n15\n20\n25\n30\n1994-\n95\n1995-\n96\n1996-\n97\n1997-\n98\n1998-\n99\n1999-\n2000\n2000-\n01\np\ne\nr\nc\ne\nn\nt\na\ng\ne\n% of Professors\nfemale\n% of Senior\nLecturers\/\nReaders female\n% of Lecturers\nfemale\n% of total female\n \n \n 12\nFigure 2 \nPercentage of each gender by grade\n0%\n20%\n40%\n60%\n80%\n100%\n1\n9\n9\n4\n-\n9\n5\n1\n9\n9\n5\n-\n9\n6\n1\n9\n9\n6\n-\n9\n7\n1\n9\n9\n7\n-\n9\n8\n1\n9\n9\n8\n-\n9\n9\n1\n9\n9\n9\n-\n2\n0\n0\n0\n2\n0\n0\n0\n-\n0\n1\n1\n9\n9\n4\n-\n9\n5\n1\n9\n9\n5\n-\n9\n6\n1\n9\n9\n6\n-\n9\n7\n1\n9\n9\n7\n-\n9\n8\n1\n9\n9\n8\n-\n9\n9\n1\n9\n9\n9\n-\n2\n0\n0\n0\n2\n0\n0\n0\n-\n0\n1\nMen Women\n% at Lecturer\n% at Senior Lecturer\/ Reader\n% at Professor\n \n 13\nNumbers of each grade by gender\n0\n100\n200\n300\n400\n500\n600\n700\n800\n900\n1000\n1\n9\n9\n4\n-\n9\n5\n1\n9\n9\n5\n-\n9\n6\n1\n9\n9\n6\n-\n9\n7\n1\n9\n9\n7\n-\n9\n8\n1\n9\n9\n8\n-\n9\n9\n1\n9\n9\n9\n-\n2\n0\n0\n0\n2\n0\n0\n0\n-\n0\n1\n1\n9\n9\n4\n-\n9\n5\n1\n9\n9\n5\n-\n9\n6\n1\n9\n9\n6\n-\n9\n7\n1\n9\n9\n7\n-\n9\n8\n1\n9\n9\n8\n-\n9\n9\n1\n9\n9\n9\n-\n2\n0\n0\n0\n2\n0\n0\n0\n-\n0\n1\nMen Women\nNumber at Lecturer\nNumber at Senior Lecturer\/\nReader\nNumber at Professor\n \n 14\nFigure 3 \n \n \n"}