{"doi":"10.1063\/1.2356115","coreId":"100730","oai":"oai:epubs.surrey.ac.uk:125","identifiers":["oai:epubs.surrey.ac.uk:125","10.1063\/1.2356115"],"title":"Water-soluble multiwall-carbon-nanotube-polythiophene composite for bilayer photovoltaics","authors":["Miller, AJ","Hatton, RA","Silva, SRP"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-09-18","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:125<\/identifier><datestamp>\n      2017-10-31T13:56:52Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/125\/<\/dc:relation><dc:title>\n        Water-soluble multiwall-carbon-nanotube-polythiophene composite for bilayer photovoltaics<\/dc:title><dc:creator>\n        Miller, AJ<\/dc:creator><dc:creator>\n        Hatton, RA<\/dc:creator><dc:creator>\n        Silva, SRP<\/dc:creator><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        2006-09-18<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/125\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Miller, AJ, Hatton, RA and Silva, SRP  (2006) Water-soluble multiwall-carbon-nanotube-polythiophene composite for bilayer photovoltaics   APPLIED PHYSICS LETTERS, 89 (12), ARTN 1.       <\/dc:identifier><dc:relation>\n        10.1063\/1.2356115<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/125\/","10.1063\/1.2356115"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"APPLIED PHYSICS LETTERS 89, 123115 \u00012006\u0002Water-soluble multiwall-carbon-nanotube-polythiophene composite\nfor bilayer photovoltaics\nAnthony J. Miller,a\u0001 Ross A. Hatton, and S. Ravi P. Silva\nNano-electronics Centre, Advanced Technology Institute, University of Surrey, Guildford,\nSurrey GU2 7XH, United Kingdom\n\u0001Received 5 June 2006; accepted 31 July 2006; published online 20 September 2006\u0002\nA water-soluble acid oxidized multiwall carbon nanotube \u0001o-MWCNTs\u0002-polythiophene composite\nfor bilayer photovoltaics is reported. Discrete heterojunction photovoltaic cells utilizing this\nnanocomposite material as the donor layer exhibit a \u000320% increase in fill factor and commensurate\nincrease in power conversion efficiency as compared to cells without o-MWCNTs. Crucially\no-MWCNTs are incorporated into the cell structure using an environmentally compatible solvent\nwithout complicating the process of device fabrication. © 2006 American Institute of Physics.\n\u0004DOI: 10.1063\/1.2356115\u0005In recent years a great deal of research effort has focused\non the development of organic and hybrid organic\/inorganic\nphotovoltaics.1 The principal motivation is to produce a low\ncost, renewable energy source which will help to solve the\nworld’s looming energy crisis. Progress towards achieving\nthe power conversion efficiencies required for commercial\nviability has been rapid.1 However, today’s most efficient\ndevices—which are invariably processed from solution—\nrequire the use of environmentally damaging solvents in the\nfabrication process.2,3\nIn this letter we report a nanocomposite comprising\na homogeneous blend of acid oxidized multiwall\ncarbon nanotubes \u0001o-MWCNTs\u0002 and the water-soluble\npolythiophene, sodium poly\u00042-\u00013-thienyl\u0002-ethoxy-4-\nbutylsulfonate\u0005 \u0001PTEBS\u0002. The utility of this material as the\ndonor layer in discrete heterojunction photovoltaic cells em-\nploying a C60 acceptor is also reported. In this context,\no-MWCNTs facilitate the extraction of positive charge carri-\ners, reducing cell series resistance and increasing cell fill\nfactor, resulting in a significant increase in power conversion\nefficiency as compared to cells without o-MWCNTs. Impor-\ntantly, water is used as the solvent to process the nanocom-\nposite which greatly increases the environmental compatibil-\nity of the fabrication process. Furthermore, o-MWCNTs are\nintegrated into the cell structure without complicating the\nprocess of cell fabrication.\nWater-soluble thiophene was purchased from American\nDye Source Inc.4 Multiwall carbon nanotubes \u0001\u000190% nano-\ntube purity\u0002 grown by chemical vapor deposition were ob-\ntained commercially \u0001Nanocyl\u0002 and used as received. Stable\ndispersions of o-MWCNTs in deionized water were prepared\nby ultrasonically dispersing carbon nanotubes in a 3:1 mix-\nture of concentrated sulfuric and nitric acids and refluxing at\n130 °C for 60 min before diluting with HPLC grade deion-\nized water. The resulting dispersion was centrifuged and the\nacid supernatant decanted off. The remaining solid was re-\npeatedly washed with HPLC grade water over a 50 nm poly-\ncarbonate filter until the washings were pH 6–7. To deter-\nmine the o-MWCNTs loading, a known volume of the stock\nsolution was completely dried and weighed. The typical di-\nameter and length of the o-MWCNTs after acid treatment\na\u0002Electronic mail: anthony.miller@surrey.ac.uk\n0003-6951\/2006\/89\u000212\u0001\/123115\/3\/$23.00 89, 12311\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject towere confirmed using transmission electron microscopy\n\u0001TEM\u0002 to be 10 nm and several microns, respectively.\nAll devices were fabricated on indium tin oxide \u0001ITO\u0002\ncoated glass \u0001Merck\u0002 with a nominal sheet resistance of\n20 \u0002 sq−1. ITO substrates were cleaned by sonicating in\ntoluene, an aqueous solution of Decon-90, acetone, and fi-\nnally refluxing acetone vapor. Substrates were microwave\noxygen plasma treated before film deposition. o-MWCNTs\nwere mixed in 1%, 3.5%, and 7.5% by weight \u0001wt. %\u0002 with\nPTEBS in 0.1M ammonia solution to aid solubility. The\nPTEBS concentration used was 7.5 mg ml−1 and was mixed\nwith the appropriate wt. % of o-MWCNTs. The solution was\nspin coated onto the ITO substrates at 700 rpm and then\nheated in air at 100 °C for 10 min to expel residual water\nand ammonia. C60 \u000199.9%\u0002 was deposited in a vacuum sys-\ntem to a thickness of 50 nm. Without breaking the vacuum a\n50 nm aluminum layer was evaporated through a shadow\nmask to form the top electrode. Film thickness was moni-\ntored using a quartz crystal microbalance and the photoactive\ndevice area was typically 7.5–10 mm2. Devices were tested\nusing an Oriel solar simulator under AM1.5D spectral illu-\nmination of 100 mW cm−2 \u00011 sun\u0002. The output power of the\nsimulator was measured using a calibrated thermopile. All\nmeasurements were made in air immediately after device\nfabrication. Atomic force microscope \u0001AFM\u0002 measurements\nwere made under ambient conditions.\nAchieving stable concentrated dispersions of MWCNTs\nin solution requires that they are chemically functionalized.5\no-MWCNTs readily form concentrated aqueous dispersions\nwith PTEBS which can be spin cast onto ITO glass to form\nthin films of uniform thickness \u0001as determined by atomic\nforce microscopy\u0002. Since o-MWCNTs are electrically con-\nducting, it is essential that they are confined within the donor\nlayer to avoid short circuiting the device. AFM studies of\nspin coated films of the nanocomposite confirm that the\no-MWCNTs do not significantly protrude from the film sur-\nface \u0004Fig. 1\u0001a\u0002\u0005. Furthermore, the roughness of PTEBS and\nPTEBS\/o-MWCNTs composite films is comparable for all\no-MWCNTs loadings investigated, evidence that\no-MWCNTs are uniformly distributed and of the compatibil-\nity between PTEBS and o-MWCNTs. Scanning electron mi-\ncroscopy \u0001SEM\u0002 images acquired using an electron beam en-\nergy sufficient to probe the entire film thickness \u0004Fig. 1\u0001b\u0002\u0005\n© 2006 American Institute of Physics5-1\n AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n123115-2 Miller, Hatton, and Silva Appl. Phys. Lett. 89, 123115 \u00022006\u0001confirm that the o-MWCNTs are uniformly distributed with\nthe PTEBS layer.\nThe absorption spectra of PTEBS, o-MWCNTs, and\nPTEBS\/o-MWCNTs composite between 200–1200 nm are\nshown in Fig. 2. The absorption spectra of PTEBS can be\nmodified by changing the pH of the solution.6 When the\npolymer is dissolved in water, absorption is confined to the\nregion below 600 nm having a maximum at 435 nm which\ncorresponds to the \u0003-\u0003* electronic transition. Upon reducing\nthe pH an additional peak appears at 773 nm and the solution\nchanges from orange to dark green. The o-MWCNTs absorb\nthroughout the measured energy range with a peak maximum\nat \u0003280 nm assigned to the \u0003-\u0003* optical transition from the\ndensity of states previously identified by Ago et al.7 The\ncomposite spectra are the superposition of the o-MWCNTs\nand PTEBS spectra, indicating the absence of significant\nground state electronic or charge transfer interactions be-\nFIG. 1. Representative AFM \u00013\u00043 \u0005m3\u0002 \u0001a\u0002 and SEM \u0001b\u0002 images of\nPTEBS\/o-MWCNTs \u00017.5 wt. % \u0002 composite films.\nFIG. 2. Absorption spectra between 200 and 1200 nm of PTEBS,\no-MWCNTs, and PTEBS\/o-MWCNTs in water.\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject totween the two materials under low white light intensities.\nThe absence of a new peak at 773 nm also indicates that the\nPTEBS is not, to any significant extent, doped by protons\nassociated with the acid functionality on o-MWCNTs.\nTable I summarizes values for open circuit voltage \u0001Voc\u0002,\nshort circuit current density \u0001Jsc\u0002, fill factor \u0001FF\u0002, and power\nconversion efficiency \u0001PCE\u0002 for cells with and without\no-MWCNTs dispersed within the PTEBS donor layer. Inclu-\nsion of o-MWCNTs within the device structure improves cell\nfill factor by \u000320% resulting in a commensurate increase in\nPCE. Notably the increase in cell FF remains constant over\nthe full range of o-MWCNTs loadings investigated herein.\nBoth Jsc and Voc are almost unchanged upon incorporation of\no-MWCNTs.\nThe large increase in FF upon incorporation of\no-MWCNTs results from a reduction in cell series resistance,\nwhich is evident as an increase in the gradient of the photo-\nresponse where it intersects the x axis \u0001Fig. 3\u0002. The cell series\nresistance is the sum of contributions from bulk transport\nwithin the organic layers, carrier extraction at the electrodes,\nand transport through the electrodes to the external circuit.\nSince the highest occupied molecular orbital \u0001HOMO\u0002 of\nPTEBS \u00015.0–5.3 eV\u0002 \u0001Ref. 8\u0002 and the Fermi level of\no-MWCNTs \u00015.0–5.1 eV, Ref. 7 and this work\u0002 are well\naligned, it is likely that the highly conductive o-MWCNTs\nfacilitate hole transport through the PTEBS layer to the ITO\nelectrode.\nAFM measurements of PTEBS and PTEBS\/o-MWCNTs\nfilms \u0004Fig. 1\u0001a\u0002\u0005 show that the roughness is not significantly\nchanged upon incorporation of o-MWCNTs into the PTEBS\nlayer for all of the loadings investigated. Consequently, the\nsmall increase in Jsc \u0001Table I\u0002 cannot be attributed to an\nTABLE I. Summary of device characteristics under 1 sun simulated solar\nillumination.\no-MWCNTs \u0001wt. %\u0002 Voc±0.03 Jsc \u0001mA cm−2\u0002 FF PCE\n0 0.65 1.40 0.51 0.46\n1 0.62 1.49 0.61 0.56\n3.5 0.60 1.49 0.59 0.52\n7.5 0.57 1.52 0.62 0.55\nFIG. 3. Typical current-voltage characteristics of cells with 7.5 wt. %\no-MWCNTs \u0001stars\u0002 and without o-MWCNTs \u0001squares\u0002 dispersed within the\nPTEBS layer. Inset: schematic energy level diagram of device structure\nincorporating o-MWCNTs.\n AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n123115-3 Miller, Hatton, and Silva Appl. Phys. Lett. 89, 123115 \u00022006\u0001increase in the PTEBS\/C60 interfacial area. MWCNTs are\nknown to quench photoluminescence in conjugated poly-\nmers, which would be expected to reduce Jsc. However, Jsc in\ncells incorporating o-MWCNTs is actually slightly increased.\nOne possible explanation is that o-MWCNTs do not reduce\nthe photocurrent by quenching excitons formed in the\nPTEBS prior to dissociation, since the HOMO of PTEBS\nand the Fermi level of o-MWCNTs are well aligned. Alter-\nnatively it may indicate that each o-MWCNTs is coated with\na PTEBS thickness greater than twice the singlet state exci-\nton diffusion length, which is typically less than 10 nm in\nsemiconducting polymers.9\nThere are two possible explanations for the very small\nreduction in Voc. It has recently been shown that Voc in bi-\nlayer organic solar cells is virtually independent of the work\nfunction of the hole-extracting electrode.10 In this case the\nwork functions of the microwave oxygen plasma treated ITO\nelectrode and o-MWCNTs were measured using ultraviolet\nphotoelectron spectroscopy \u0001UPS\u0002 to be \u00034.4 and \u00035.0 eV,\nrespectively. Such a small change in Voc would be consistent\nwith this idea. An alternative and more likely explanation is\nthat the o-MWCNTs are completely coated with PTEBS pre-\nventing direct contact with the underlying ITO electrode.\nHowever, since the Fermi level of o-MWCNTs and the\nHOMO of PTEBS are well aligned, o-MWCNTs facilitate\nconduction, rather than trapping, holes on their path to the\nITO electrode.\nFigure 3 shows the typical current-voltage characteristics\nunder 1 sun simulated solar illumination of cells with and\nwithout the maximum o-MWCNTs loading of 7.5 wt. %\nwithin the PTEBS layer, from which it is clear that the cell\nshunt resistance is virtually unchanged upon incorporation of\no-MWCNTs. This is further evidence that o-MWCNTs do\nnot contribute to leakage currents across the device. Figure 3\n\u0001inset\u0002 illustrates the proposed energy level diagram for a\nPTEBS:o-MWCNT\/C60 photovoltaic device based on UPS\nmeasurements of the microwave oxygen plasma treated ITO\nglass and o-MWCNTs work functions—4.4 and 5.0 eV,\nrespectively—and the previously reported HOMO and low-\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject toest unoccupied molecular orbital energies of PTEBS \u0001Ref. 8\u0002\nand C60.11\nIn addition to the excellent potential o-MWCNTs have to\nincrease the power conversion efficiency of organic solar\ncells, we anticipate that they may also enhance the mechani-\ncal strength of these devices, particularly for relatively high\no-MWCNTs loadings such as those used herein. This is an\nincreasingly relevant property with the growing tendency to-\nwards fully conformable devices on flexible substrates.\nIn summary we have fabricated discrete heterojunction\nsolar cells using an o-MWCNTs:PTEBS nanocomposite do-\nnor layer and C60 acceptor layer. Inclusion of o-MWCNTs\nwithin the PTEBS donor increases cell FF by \u000320% result-\ning in a commensurate increase in PCE. This improvement in\nperformance is attributed to a reduction in cell series resis-\ntance resulting from improved hole transport within the\nPTEBS layer. Crucially, this composite material is processed\nfrom an aqueous solution making it environmentally compat-\nible with low cost fabrication for large area devices.\nThe authors would like to acknowledge Nicholas P.\nBlanchard for the UPS measurements and Vlad Stolojan for\nthe TEM measurements. We would also like to thank the\nEPSRC for funding via a Portfolio Partnership award.\n1S. Shaheen, D. Ginley, and G. Jabbour, MRS Bull. 30, 10 \u00012005\u0002.\n2L. Gang, V. Shrotriya, J. Huang, Y. Yao, T. Moriarty, K. Emery, and Y.\nYang, Nat. Mater. 4, 864 \u00012005\u0002.\n3M. Wanli, Y. Cuiying, G. Xiong, L. Kwanghee, and A. Heeger, Adv.\nFunct. Mater. 15, 1617 \u00012005\u0002.\n4American Dye Source, http:\/\/www.adsdyes.com\/products\/pdf\/\npolythiophene\/ADS2000P.pdf\n5S. Sinnott, J. Nanosci. Nanotechnol. 2, 113 \u00012002\u0002.\n6F. Tran-Van, M. Carrier, and C. Chevrot, Synth. Met. 142, 251 \u00012004\u0002.\n7H. Ago, T. Kugler, F. Cacialli, W. Salaneck, M. Shaffer, A. Windle, and R.\nFriend, J. Phys. Chem. B 103, 8116 \u00011999\u0002.\n8Q. Qiao, L. Su, J. Beck, and J. McLeskey, J. Appl. Phys. 98, 1094906\n\u00012005\u0002.\n9P. Peumans, A. Yakimov, and S. Forrest, J. Appl. Phys. 93, 1 \u00012003\u0002.\n10S. Khodabakhsh, B. Sanderson, J. Nelson, and T. Jones, Adv. Funct.\nMater. 16, 95 \u00012006\u0002.\n11Organic Photovoltaics Concepts and Realization, edited by C. Brabec, V.\nDyakonov, J. Parisi, and N. S. Sariciftci \u0001Springer, Berlin, 2003\u0002,\np. 165.\n AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n"}