{"doi":null,"coreId":"10702","oai":"oai:www.e-space.mmu.ac.uk:2173\/95387","identifiers":["oai:www.e-space.mmu.ac.uk:2173\/95387",null],"title":"What is new in neuro-musculoskeletal interactions?","authors":["Rauch, Frank","Rittweger, Jörn"],"enrichments":{"references":[{"id":661300,"title":"Effect of folate and mecobalamin on hip fractures in patients with stroke: a randomized controlled trial. JAMA","authors":[],"date":"2005","doi":"10.1001\/jama.293.9.1082","raw":"Sato  Y,  Honda  Y,  Iwamoto  J,  Kanoko  T,  Satoh  K. Effect of folate and mecobalamin on hip fractures in patients  with  stroke:  a  randomized  controlled  trial. JAMA 2005; 293:1082-1088.","cites":null},{"id":17790307,"title":"Femoral neck structure in adult female athletes subjected to different loading modalities. J Bone Miner Res","authors":[],"date":"2005","doi":"10.1359\/jbmr.041119","raw":"Nikander  R,  Sievanen  H,  Heinonen  A,  Kannus  P. Femoral neck structure in adult female athletes subjected  to  different  loading  modalities.  J  Bone  Miner Res 2005; 20:520-528.","cites":null},{"id":17790314,"title":"Homocysteine as a predictive factor for hip fracture in older persons.","authors":[],"date":"2004","doi":"10.1056\/nejmoa032739","raw":"McLean  RR,  Jacques  PF,  Selhub  J,Tucker  KL, Samelson EJ, Broe KE, Hannan MT, Cupples LA, Kiel DP. Homocysteine as a predictive factor for hip fracture in older persons. N Engl J Med 2004; 350:2042-2049.","cites":null},{"id":661298,"title":"Homocysteine as a predictive factor for hip fracture in stroke patients.","authors":[],"date":"2005","doi":"10.1016\/j.bone.2005.01.011","raw":"Sato  Y,  Honda  Y,  Iwamoto  J,  Kanoko  T,  Satoh  K. Homocysteine as a predictive factor for hip fracture in stroke patients. Bone 2005; 36:721-726.","cites":null},{"id":17790309,"title":"Interventions for preventing and treating stress fractures and stress reactions of bone of the lower limbs in young adults. Cochrane Database Syst Rev","authors":[],"date":"2005","doi":"10.1002\/14651858.cd000450.pub2","raw":"Rome K, Handoll HH, Ashford R. Interventions for preventing and treating stress fractures and stress reactions  of  bone  of  the  lower  limbs  in  young  adults. Cochrane Database Syst Rev 2005; CD000450.","cites":null},{"id":661302,"title":"Is muscle power output a key factor in the age-related decline in physical performance? A comparison of muscle cross-section, chair-rising test and jumping power. Clin Physiol Funct Imaging","authors":[],"date":"2004","doi":"10.1111\/j.1475-097X.2004.00567.x","raw":"Runge  M,  Rittweger  J,  Russo  CR,  Schiessl  H, Felsenberg D. Is muscle power output a key factor in the age-related decline in physical performance? A comparison of muscle cross-section, chair-rising test and jumping power. Clin Physiol Funct Imaging 2004; 24:335-340.","cites":null},{"id":17790312,"title":"Leptin inhibits bone formation through a hypothalamic relay: a central control of bone mass. Cell","authors":[],"date":"2000","doi":"10.1016\/s0092-8674(00)81558-5","raw":"Ducy P, Amling M, Takeda S, Priemel M, Schilling AF, Beil FT, Shen J, Vinson C, Ruegaer JM, Karsenty G. Leptin inhibits bone formation through a hypothalamic relay:  a  central  control  of  bone  mass.  Cell  2000; 100:197-207.","cites":null},{"id":17790313,"title":"Leptin regulation of bone resorption by the sympathetic nervous system and CART. Nature 2005; 434:514-520. c And not an agro-economic or culinary one. d Senescence is the irreversible biological process associated with ageing.F. Rauch","authors":[],"date":null,"doi":"10.1038\/nature03398","raw":"Elefteriou F, Ahn JD, Takeda S, Starbuck M, Yang X, Liu X, Kondo H, Richards WG, Bannon TW, Noda M, Clement K, Vaisse C, Karsenty G. Leptin regulation of bone resorption by the sympathetic nervous system and CART. Nature 2005; 434:514-520. c And not an agro-economic or culinary one. d Senescence is the irreversible biological process associated with ageing.F. Rauch and J. Rittweger: What is new in neuro-musculoskeletal interactions?","cites":null},{"id":661299,"title":"Low plasma vitamin B12 is associated with lower BMD: the Framingham Osteoporosis Study. J Bone Miner Res","authors":[],"date":"2005","doi":"10.1359\/JBMR.041018","raw":"Tucker KL, Hannan MT, Qiao N, Jacques PF, Selhub J, Cupples LA, Kiel DP. Low plasma vitamin B12 is associated with lower BMD: the Framingham Osteoporosis Study. J Bone Miner Res 2005; 20:152-158.","cites":null},{"id":17790306,"title":"Low skeletal muscle mass is associated with poor structural parameters of bone and impaired balance","authors":[],"date":"2005","doi":"10.1359\/jbmr.041230","raw":"Szulc P, Beck TJ, Marchand F, Delmas PD. Low skeletal muscle mass is associated with poor structural parameters of bone and impaired balance in elderly men – the MINOS study. J Bone Miner Res 2005; 20:721-729.","cites":null},{"id":661306,"title":"Motor unit number estimates in the tibialis anterior muscle of young, old, and very old men. Muscle Nerve","authors":[],"date":"2005","doi":"10.1002\/mus.20276","raw":"McNeil CJ, Doherty TJ, Stashuk DW, Rice CL. Motor unit number estimates in the tibialis anterior muscle of young,  old,  and  very  old  men.  Muscle  Nerve  2005; 31:461-467.","cites":null},{"id":661305,"title":"Motor unit number estimation by decomposition-enhanced spike-triggered averaging: control data, test-retest reliability, and contractile level effects. Muscle Nerve","authors":[],"date":"2004","doi":"10.1002\/mus.20031","raw":"Boe SG, Stashuk DW, Doherty TJ. Motor unit number estimation by decomposition-enhanced spike-triggered averaging: control data, test-retest reliability, and contractile level effects. Muscle Nerve 2004; 29:693-699.","cites":null},{"id":17790311,"title":"Muscle strength is a determinant of bone mineral content in the hemiparetic upper extremity: implications for stroke rehabilitation. Bone","authors":[],"date":"2005","doi":"10.1016\/j.bone.2005.03.009","raw":"Pang MY, Eng JJ. Muscle strength is a determinant of bone mineral content in the hemiparetic upper extremity: implications for stroke rehabilitation. Bone 2005; 37:103-111.","cites":null},{"id":661304,"title":"Physiological changes in ageing muscles.","authors":[],"date":"1973","doi":"10.1136\/jnnp.36.2.174","raw":"Campbell  MJ,  McComas  AJ,  Petito  F.  Physiological changes  in  ageing  muscles.  J  Neurol  Neurosurg Psychiatry 1973; 36:174-182.","cites":null},{"id":17790305,"title":"Proximal femur bone geometry is appropriately adapted to lean mass in overweight children and adolescents. Bone","authors":[],"date":"2005","doi":"10.1016\/j.bone.2004.12.003","raw":"Petit  MA,  Beck  TJ,  Shults  J,  Zemel  BS,  Foster  BJ, Leonard MB. Proximal femur bone geometry is appropriately adapted to lean mass in overweight children and adolescents. Bone 2005; 36:568-576.","cites":null},{"id":17790308,"title":"Risk factors for clinical stress fractures in male military recruits: a prospective cohort study.","authors":[],"date":"2005","doi":"10.1016\/j.bone.2005.04.016","raw":"Valimaki VV, Alfthan H, Lehmuskallio E, Loyttyniemi E, Sahi T, Suominen H, Valimaki MJ. Risk factors for clinical  stress  fractures  in  male  military  recruits:  a prospective cohort study. Bone 2005; 37:267-273.","cites":null},{"id":661303,"title":"Sarcopenia is not due to lack of regenerative drive in senescent skeletal muscle. Aging Cell","authors":[],"date":"2005","doi":"10.1111\/j.1474-9728.2005.00145.x","raw":"Edstrom E, Ulfhake B. Sarcopenia is not due to lack of regenerative drive in senescent skeletal muscle. Aging Cell 2005; 4:65-77.","cites":null},{"id":17790310,"title":"Skeletal adaptations in hemiplegic patients.","authors":[],"date":"2004","doi":null,"raw":"Runge M, Rehfeld G, Schiessl H. Skeletal adaptations in  hemiplegic  patients.  J  Musculoskelet  Neuronal Interact 2004; 4:191-196.","cites":null},{"id":661301,"title":"Summary comments.","authors":[],"date":"1989","doi":null,"raw":"Rosenberg IH. Summary comments. Am J Clin Nutr 1989; 50:1231-1233.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-03-31T14:55:04Z","abstract":"Full-text of this article is available at http:\/\/www.ismni.org\/jmni\/pdf\/22\/32WHATISNEW.pdf","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/10702.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/2173\/95387","pdfHashValue":"dfacbee7f1da98fd428ec38ef8da36ac9e154436","publisher":"The International Society of Musculoskeletal and Neuronal Interactions","rawRecordXml":"<record><header><identifier>\noai:www.e-space.mmu.ac.uk:2173\/95387<\/identifier><datestamp>2010-03-31T14:55:04Z<\/datestamp><setSpec>hdl_2173_1571<\/setSpec><\/header><metadata><oai_dc:dc xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>What is new in neuro-musculoskeletal interactions?<\/dc:title><dc:creator>Rauch, Frank<\/dc:creator><dc:creator>Rittweger, Jörn<\/dc:creator><dc:description>Full-text of this article is available at http:\/\/www.ismni.org\/jmni\/pdf\/22\/32WHATISNEW.pdf<\/dc:description><dc:publisher>The International Society of Musculoskeletal and Neuronal Interactions<\/dc:publisher><dc:date>2010-03-31T14:55:04Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>The Journal of Musculoskeletal and Neuronal Interactions, 2005, vol. 5, no. 4, pp. 393-396<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/2173\/95387<\/dc:identifier><dc:language>en<\/dc:language><dc:relation>http:\/\/www.ismni.org\/jmni\/index.htm<\/dc:relation><dc:relation>http:\/\/www.ismni.org\/jmni\/pdf\/22\/32WHATISNEW.pdf<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/www.ismni.org\/jmni\/index.htm","http:\/\/www.ismni.org\/jmni\/pdf\/22\/32WHATISNEW.pdf"],"year":2010,"topics":[],"subject":["Article"],"fullText":""}