{"doi":"10.1016\/j.watres.2007.03.002","coreId":"140849","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1855","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1855","10.1016\/j.watres.2007.03.002"],"title":"Struvite crystallisation and recovery using a stainless steel structure as a\nseed material.","authors":["Le Corre, Kristell S.","Valsami-Jones, Eugenia","Hobbs, Phil","Jefferson, Bruce","Parsons, Simon A."],"enrichments":{"references":[{"id":37920946,"title":"An economic and environmental evaluation of the opportunities for substituting phosphorus recovered from wastewater treatment works in existing UK fertiliser markets.","authors":[],"date":"2000","doi":"10.1080\/09593332108618050","raw":"Gaterell, M.R., Gay, R., Wilson, R., Gochin, R.J. and Lester, J.N. (2000) An economic and environmental evaluation of the opportunities for substituting phosphorus recovered from wastewater treatment works in existing UK fertiliser markets. Environmental Technology 21, 1067-1084.","cites":null},{"id":37920933,"title":"Auto-nucleation and crystal growth of struvite in a demonstrative fluidized bed reactor (FBR).","authors":[],"date":"2005","doi":"10.1080\/09593332608618486","raw":"Battistoni, P., Boccadoro, R., Fatone, F. and Pavan, P. (2005) Auto-nucleation and crystal growth of struvite in a demonstrative fluidized bed reactor (FBR). Environmental Technology 26, 975-982.","cites":null},{"id":37920963,"title":"Controlled crystallisation for removing phosphorus from anaerobic digester sidestreams.","authors":[],"date":"2001","doi":"10.1016\/s0043-1354(00)00236-0","raw":"Von Münch, E. and Barr, K. (2001) Controlled crystallisation for removing phosphorus from anaerobic digester sidestreams. Water Research 35, 151-159.","cites":null},{"id":37920934,"title":"Crystalline phosphate precipitation from anaerobic animal waste treatment lagoon liquors.","authors":[],"date":"1975","doi":"10.13031\/2013.36584","raw":"Booram, C.V., Smith, R.J. and Hazen, T.E. (1975) Crystalline phosphate precipitation from anaerobic animal waste treatment lagoon liquors. Transactions of the American Society of Agricultural Engineers, 340-343.","cites":null},{"id":37920954,"title":"Development of a high efficiency phosphorus recovery method using a fluidised-bed crystallized phosphorus removal system.","authors":[],"date":"2003","doi":null,"raw":"Shimamura, K., Tanaka, T., Miura, Y. and Ishikawa, H. (2003) Development of a high efficiency phosphorus recovery method using a fluidised-bed crystallized phosphorus removal system. Water Science and Technology 48, 163-170.","cites":null},{"id":37920947,"title":"Effects of a magnetic field on the formation of CaCO3 particles.","authors":[],"date":"1993","doi":"10.1006\/jcis.1993.1085","raw":"Higashitani, K., Kage, A., Katamura, S., Imaj, K. and Hatade, S. (1993) Effects of a magnetic field on the formation of CaCO3 particles. Journal of Colloids and Interface Science 156, 90-95.","cites":null},{"id":37920948,"title":"Impact of calcium on struvite crystal size, shape and purity.","authors":[],"date":"2005","doi":"10.1016\/j.jcrysgro.2005.06.012","raw":"Le Corre, K.S., Valsami-Jones, E., Hobbs, P. and Parsons, S.A. (2005) Impact of calcium on struvite crystal size, shape and purity. Journal of Crystal Growth 283, 514–522.","cites":null},{"id":37920950,"title":"Impact of reactor operation on success of struvite precipitation from synthetic liquors. In: Understanding20 struvite crystallisation and recovery.","authors":[],"date":"2006","doi":"10.1080\/09593332808618885","raw":"Le Corre, K.S., Valsami-Jones, E., Hobbs, P. and Parsons, S.A. (2006b) Impact of reactor operation on success of struvite precipitation from synthetic liquors. In: Understanding20 struvite crystallisation and recovery. PhD Thesis, Centre for Water Science, Cranfield University, Cranfield, UK.","cites":null},{"id":37920949,"title":"Influence of seed material characteristics on rapid struvite recovery. In: Understanding Struvite Crystallisation and Recovery.","authors":[],"date":"2006","doi":"10.1016\/j.watres.2006.10.025","raw":"Le Corre, K.S., Valsami-Jones, E., Hobbs, P., Boyd, R.D., Jefferson, B. and Parsons S.A. (2006a) Influence of seed material characteristics on rapid struvite recovery. In: Understanding Struvite Crystallisation and Recovery. PhD Thesis, Centre for Water Science, Cranfield University, Cranfield, UK.","cites":null},{"id":37920962,"title":"Modelling21 multiple mineral precipitation in anaerobic digester liquor.","authors":[],"date":"2003","doi":"10.1016\/s0043-1354(03)00173-8","raw":"Van Rensbourg, P., Musvoto, E.V., Wentzel, M.C. and Ekama, G.A. (2003) Modelling21 multiple mineral precipitation in anaerobic digester liquor. Water Research 37, 3087-3097.","cites":null},{"id":37920931,"title":"P removal from anaerobic supernatants by struvite crystallisation: long term validation and18 process modelling.","authors":[],"date":"2002","doi":"10.1016\/s0043-1354(01)00401-8","raw":"Battistoni, P., De Angelis, A., Prisciandaro, M., Boccadoro, R. and Bolzonella, D. (2002) P removal from anaerobic supernatants by struvite crystallisation: long term validation and18 process modelling. Water Research 36, 1927-1938.","cites":null},{"id":37920935,"title":"Phosphate deposits in digestion systems.","authors":[],"date":"1972","doi":null,"raw":"Borgerding, J. (1972) Phosphate deposits in digestion systems. Journal of the Water Pollution Control Federation 44, 813-819.","cites":null},{"id":37920922,"title":"Pilot-scale study of phosphorus recovery through struvite crystallization-examining the process feasibility.","authors":[],"date":"2003","doi":"10.1139\/s03-040","raw":"Adnan, A., Mavinic, D.S. and Koch, F.A. (2003) Pilot-scale study of phosphorus recovery through struvite crystallization-examining the process feasibility. Journal of Environmental Engineering Sciences 2, 315-324.","cites":null},{"id":37920952,"title":"Postdigestion struvite precipitation using a fluidised bed reactor.","authors":[],"date":"2000","doi":"10.1061\/(asce)0733-9372(2000)126:4(361)","raw":"Ohlinger, K.N., Young, T.M. and Schroeder, E.D. (2000) Postdigestion struvite precipitation using a fluidised bed reactor. Journal of Environmental Engineering 126, 361-368.","cites":null},{"id":37920938,"title":"Recent advances in removing phosphorus from wastewater and its use as fertilizer","authors":[],"date":"2004","doi":"10.1016\/j.watres.2004.07.014","raw":"de-Bashan, L.E. and Bashan, Y. (2004) Recent advances in removing phosphorus from wastewater and its use as fertilizer (1997-2003), Water Research 38, 4222-4246.","cites":null},{"id":37920957,"title":"Recovery of phosphorus from swine wastewater through crystallization.","authors":[],"date":"2005","doi":"10.1016\/j.biortech.2004.12.017","raw":"Suzuki, K., Tanaka, Y., Kuroda, K., Hanajima, D. and Fukumoto, Y. (2005) Recovery of phosphorus from swine wastewater through crystallization. Bioresource Technology 96, 1544-1550.","cites":null},{"id":37920955,"title":"Removal of struvite to prevent problems associated with its accumulation in wastewater treatment works.","authors":[],"date":"2004","doi":"10.2175\/106143004x151491","raw":"Stratful, I., Scrimshaw, M.D. and Lester, J.N. (2004) Removal of struvite to prevent problems associated with its accumulation in wastewater treatment works. Water Environment Research 76, 437-4199.","cites":null},{"id":37920937,"title":"Spontaneous precipitation of struvite from aqueous solutions.","authors":[],"date":"2000","doi":"10.1016\/s0022-0248(00)00351-1","raw":"Bouropoulos, N.C. and Koutsoukos, P.G. (2000) Spontaneous precipitation of struvite from aqueous solutions. Journal of Crystal Growth 213, 381-388.","cites":null},{"id":37920929,"title":"Standard methods for the examination of water and wastewater, 20 th Edition.","authors":[],"date":"1998","doi":null,"raw":"APHA (1998). Standard methods for the examination of water and wastewater, 20 th Edition. American Public Health Association \/ American Water Works Association \/ Water Environment Federation, Washington DC, USA.","cites":null},{"id":37920951,"title":"Struvite deposits in pipes and aerators.","authors":[],"date":"1989","doi":"10.1016\/0269-7483(89)90067-0","raw":"Mohajit, X., Bhattarai, K.K., Taiganides, E.P. and Yap, B.C. (1989) Struvite deposits in pipes and aerators. Biological Wastes 30, 133-147.","cites":null},{"id":37920942,"title":"Struvite formation and the fouling propensity of different materials.","authors":[],"date":"2002","doi":"10.1016\/s0043-1354(02)00127-6","raw":"Doyle, J.D., Oldring, K., Churchley, J. and Parsons, S.A. (2002) Struvite formation and the fouling propensity of different materials. Water Research 36, 3971-3978.19 Doyle, J.D., Oldring, K., Churchley, J., Price, C. and Parsons, S.A. (2003) Chemical control of struvite precipitation. Journal of Environmental Engineering- ASCE 129, 419-426.","cites":null},{"id":37920940,"title":"Struvite formation, control and recovery.","authors":[],"date":"2002","doi":"10.1016\/s0043-1354(02)00126-4","raw":"Doyle, J.D. and Parsons, S.A. (2002) Struvite formation, control and recovery. Water Research 36, 3925-3940.","cites":null},{"id":37920944,"title":"Struvite scale formation and control.","authors":[],"date":"2004","doi":"10.1016\/s0043-1354(02)00126-4","raw":"Doyle, J.D. and Parsons, S.A. (2004) Struvite scale formation and control. Water Science and Technology 49, 177-182.","cites":null},{"id":37920930,"title":"The influence of magnetic fields on calcium carbonate precipitation.","authors":[],"date":"1998","doi":"10.1016\/s0043-1354(97)00277-7","raw":"Barett, R.A. and Parsons, S.A. (1998) The influence of magnetic fields on calcium carbonate precipitation. Water Research 32, 609-612.","cites":null},{"id":37920960,"title":"Three years experience of operating and selling recovered struvite from full-scale plant.","authors":[],"date":"2001","doi":"10.1080\/09593332208618196","raw":"Ueno, Y. and Fujii, M. (2001) Three years experience of operating and selling recovered struvite from full-scale plant. Environmental Technology 22, 1373-1381.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2007-06-01T00:00:00Z","abstract":"A metallic system acting as a seed substrate has been designed and developed in\norder to assess its efficiency in recovering phosphorus as struvite. The device,\nconsisting of two concentric stainless steel meshes, was immerged in the upper\nsection of a pilot crystallisation reactor fed with synthetic liquors\n(MgCl2·6H2O, NH4H2PO4,) for 2 h. Apart from soluble PO4-P removals which\nremained in the range 79–80% with or without application of the metallic system,\nit was found that under the specific operating conditions tested the meshes were\ncapable of accumulating struvite at a rate of 7.6 gm−2 h−1, hence reducing\nsignificantly the amount of fine particles remaining in solution from 302.2 to\n12 mg L−1 when compared to trials wit","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140849.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.watres.2007.03.002","pdfHashValue":"296384920bbd061afc8ac8e32d8bc142ef44c2dd","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1855<\/identifier><datestamp>2011-12-16T10:41:03Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Struvite crystallisation and recovery using a stainless steel structure as a\nseed material.<\/dc:title><dc:creator>Le Corre, Kristell S.<\/dc:creator><dc:creator>Valsami-Jones, Eugenia<\/dc:creator><dc:creator>Hobbs, Phil<\/dc:creator><dc:creator>Jefferson, Bruce<\/dc:creator><dc:creator>Parsons, Simon A.<\/dc:creator><dc:subject>Seeded crystallisation<\/dc:subject><dc:subject>Struvite<\/dc:subject><dc:subject>Metallic accumulation system<\/dc:subject><dc:subject>P removal and recovery<\/dc:subject><dc:description>A metallic system acting as a seed substrate has been designed and developed in\norder to assess its efficiency in recovering phosphorus as struvite. The device,\nconsisting of two concentric stainless steel meshes, was immerged in the upper\nsection of a pilot crystallisation reactor fed with synthetic liquors\n(MgCl2·6H2O, NH4H2PO4,) for 2 h. Apart from soluble PO4-P removals which\nremained in the range 79–80% with or without application of the metallic system,\nit was found that under the specific operating conditions tested the meshes were\ncapable of accumulating struvite at a rate of 7.6 gm−2 h−1, hence reducing\nsignificantly the amount of fine particles remaining in solution from 302.2 to\n12 mg L−1 when compared to trials with<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-10-25T23:01:33Z<\/dc:date><dc:date>2011-10-25T23:01:33Z<\/dc:date><dc:date>2007-06-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>K.S. Le Corre, E. Valsami-Jones, P. Hobbs, B. Jefferson and S.A. Parsons, Struvite crystallisation and recovery using a stainless steel structure as a seed material, Water Research, Volume 41, Issue 11, June 2007, Pages 2449-2456.<\/dc:identifier><dc:identifier>0043-1354<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.watres.2007.03.002<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/1855<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0043-1354","issn:0043-1354"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Seeded crystallisation","Struvite","Metallic accumulation system","P removal and recovery"],"subject":["Article"],"fullText":"1STRUVITE CRYSTALLISATION AND RECOVERY USING A STAINLESS STEEL\nSTRUCTURE AS A SEED MATERIAL\nWater Research, Volume 41, Issues 11, June 2007, Pages 2449-2456.\nK. S. Le Corre1, E. Valsami-Jones2, P. Hobbs3, B. Jefferson1, S.A. Parsons1*\n1Centre for Water Science, Cranfield University, Cranfield MK43 OAL, UK\n*Tel: +44 (0)1234 754841, Fax: +44 (0)1234 751671\nE-mail address: s.a.parsons@cranfield.ac.uk\n2 Department of Mineralogy, The Natural History Museum, Cromwell Road London, SW7\n5BD, U.K\n3Institute of Grassland and Environmental Research (IGER), North Wyke, Okehampton,\nDevon, EX20 2SB, UK\nAbstract\nA metallic system acting as a seed substrate has been designed and developed in order to assess its efficiency in\nrecovering phosphorus as struvite. The device, consisting of two concentric stainless steel meshes, was\nimmerged in the upper section of a pilot crystallisation reactor fed with synthetic liquors (MgCl2.6H2O,\nNH4H2PO4) for two hours. Apart from soluble PO4-P removals which remained in the range 79-80 % with or\nwithout application of the metallic system, it was found that under the specific operating conditions tested, the\nmeshes were capable of accumulating struvite at a rate of 7.6 g.m-2.h-1, hence reducing significantly the amount\nof fine particles remaining in solution from 302.2 mg.L-1 to 12 mg.L-1 when compared to trials without mesh.\nKeywords: Seeded crystallisation; struvite; metallic accumulation system; P removal and recovery\n1. Introduction\nBlockage of pipes, breakdowns of centrifuges, pumps, heat exchangers and other pieces of\nequipment in contact with anaerobically digested effluents are typical consequences of the\n2deposition in wastewater treatment plants of a white hard scale called struvite (Doyle and\nParsons, 2002; Van Rensburg et al., 2003). Primarily considered as a problem to eliminate or\ninhibit (Borgerding, 1972; Doyle et al., 2003), struvite (MgNH4PO4.6H2O) potential as a\nfertiliser has led wastewater companies to study its recovery (de-Bashan and Bashan, 2004).\nThe principles of struvite nucleation and growth as well as the efficiency of a variety of\ncrystallisation reactors have been widely investigated and are well documented in the\nliterature (Bouropoulos and Koutsoukos, 2000, Doyle and Parsons 2004; Le Corre et al.,\n2005; Von Münch and Barr, 2001; Stratful et al., 2004; Battistoni et al., 2005). However, the\napplication of struvite crystallisation processes at full scale remains limited, with for instance\nJapan being the only country where complete phosphorus removal and recovery from\nanaerobically digested sludge liquors as struvite has been implemented and the resulting\nproduct sold to fertiliser companies (Gaterell et al., 2000; Ueno and Fujii, 2001). The reason\nwhy struvite crystallisation is not more widely applied is a combination of the unknown\neconomic value of the process and the product, the need for pH control, and the formation of\ncrystal fines (Adnan et al., 2003).\nTo optimise the size of the recovered struvite crystals, researchers have often tested\ncrystallisation onto seed materials such as sand (Battistoni et al., 2002) or preformed struvite\ncrystals (Shimamura et al., 2003). The impact of seeding can be seen on the final particle size\ndistribution. To illustrate, Shimamura et al. (2003), who used struvite fines as a seed in their\ndemonstrative reactor, observed a growth of particles from 0.79 mm to 1.18 mm in 12 days.\nHowever, if the use of a seed material to grow struvite has proved to be efficient, the\noperation of such processes requires strong mixing energy to insure the bed of seeds is\ncontinuously fluidised. As a result, when compared to a non-seeded crystallisation reactor,\n3Battistoni et al. (2005) demonstrated that seeded crystallisation operative costs are increased\ndue to extra pumping and air mixing energy.\nAs a substitute to conventional particle seed materials, Suzuki et al. (2005) recently reported\nthe use of a metallic support to recover struvite from swine wastewater and showed the\nsystem could accumulate up to 1 kg of struvite after 30 days of submersion in their reactor.\nStudies on the scaling properties of struvite previously showed metallic materials to favour\nstruvite deposition (Doyle et al., 2002). Furthermore, a recent study on the ability of a range\nof materials, including sand, struvite and a stainless steel mesh, demonstrated adhesion forces\nbetween struvite and a metallic surface to be the strongest (Le Corre et al., 2006a). The\ndevelopment of a simple, robust and innovative metallic system that could be integrated to\nany crystallisation reactor would therefore improve struvite recovery and offer an alternative\nto existing seeded fluidised bed reactors. Such systems could reduce energy consumption\nwhen compare to typical fluidised bed reactors filled with sand or struvite. A device has been\ndesigned at Cranfield University, and this paper presents results on its performances in\nrecovering struvite formed from synthetic liquors.\n2. Material and methods\n2.1 Reactor design and operating conditions\nA pilot scale crystallisation reactor was designed and developed at Cranfield University to\nstudy struvite nucleation and growth (Le Corre et al., 2006b). It was tested here for seeded\ncrystallisation of struvite from synthetic liquors (Fig. 1). The process was composed of a 10 L\nreactor with two side sampling ports and a drain valve. A peristaltic pump injected\nsimultaneously solutions of ammonium dihydrogen orthophosphate (NH4H2PO4 0.2M \/ Fisher\n4Analytical Reagent Grade, UK) and magnesium chloride hexahydrate (MgCl2.6H2O 0.05M\/\nFisher analytical Reagent Grade, UK), prepared by dissolution of the corresponding solid\ncompounds in deionised water.\n[Mg] 1.64 mM 2.3m M\npH 9\nAir flow =3 L.min-1\nRecirculation= 1.35 L.min-1\nExternal\nMesh  \nInternal\nmesh  \nCombined\nsystem  \nFig. 1 - Process design and configurations tested.\nPrior to mixing in the reactor, each solution was adjusted to pH 9 with sodium hydroxide\n(NaOH 2 N\/ Fisher analytical reagent grade, UK) in stirred buckets. Both solutions were then\ntransferred to the reactor. A pH probe was introduced in the reaction zone to control and\nmaintain the pH constant during the crystallisation process. An upward air-flow and a liquid\nrecirculation were adjusted (3-4 L.min-1 for air, and 1.35 to 1.5 L.min-1 for liquid) to ensure\nthe mixing and growth of the particles formed so that they were always kept in suspension\nduring the experiment.\nExternal\nMesh\nD=17.5 m Air\nDrain\nRecirculation\nloop\nFeed\nOverflow\nInternal\nMesh\nD=12.4 cm\n5The experiments presented here were carried out at two different Mg concentrations 1.64 mM\nand 2.3 mM, ratios Mg:N:P 1:2:2 and constant pH, with and without the accumulation system.\nAll experiments were conducted at room temperature over 120 minutes and repeated three\ntimes to ensure reproducibility of the results. During experiments, samples could be\nwithdrawn for analysis from sampling ports situated on the side of the reactor at chosen\nheight: top and bottom of the column shape part of the reactor and middle of the enlarged\nsection.\n2.2 Stainless steel mesh system design and configuration\nA system composed of 2 concentric meshes was designed for use as a substrate to grow\nstruvite. Both meshes were made of woven wire stainless steel 1 mm hole, 0.35 mm wire\n(Grade AISI 316 nº 1.4404 - H&B Wire Fabrications Ltd, UK) and dimensioned to fit in the\nenlarged section of the reactor (Fig. 1). The external mesh was 55 x 14 cm and the internal\nmesh was 39 x 9 cm.\nThe meshes were independently removable to study the efficiency of the system under the\nvarious configurations summarised in Fig. 1.\n2.3 Sampling and analyses\nThe evolution of struvite crystallisation in the reactor was followed by absorbance\nmeasurements. Samples were taken every 2 minutes during 30 minutes of crystallisation, then\nevery 5 minutes until the 60th minute and finally every 15 minutes during the last 60 minutes.\nEach sample was analysed for absorbance (6505 UV\/Vis Spectrophotometer, Jenway, UK) at\n6the specific wavelength of 385 nm determined by generating the optical adsorption spectrum\nfor pure struvite crystals.\nAn analysis of variance (ANOVA) for this series of data was carried out at t=10min and\nt=60min to compare the impact of the four process configurations on struvite recovery.\nAt the end of each test 2 L of solution were withdrawn from the reactor and filtered through\n0.2 µm filters. Supernatants recovered were tested for soluble phosphate (PO4-P) and\nammonium (NH4-N) by photometric methods adapted from standard methods, APHA, 1998\n(Merck spectroquant cell tests, VWR International, Poole, UK) while the recovered struvite\nparticles were dried at room temperature and weighted to assess the remaining quantity of\nstruvite in suspension.\nThe submerged system was removed and left to dry at room temperature. Pictures of the\nmeshes were taken to give a visual support of struvite accumulation onto the system as\nillustrated in Fig. 4. The meshes were also weighted to determine the mass of struvite\naccumulated. Struvite crystals were then recovered by light brushing for characterisation by\nSEM-EDS (Scanning Electron Microscope XL 30 SFEG, Philips, The Netherlands) and XRD\n(Powder X-ray Diffractometer D5005, Siemens, Germany).\n3. Results\nIn order to evaluate any possible influence of the mesh system on soluble PO4-P and NH4-N\nremovals, experiments undertaken over the range of mesh configurations tested were\ncompared to experiments carried out under similar conditions of precipitation but without\nmesh (Fig. 2). Results showed that the different values of soluble PO4-P remaining in solution\nwere similar either with or without mesh system incorporated in the reactor. To illustrate, at\n7[Mg] = 1.64 mM, PO4-P removals were 80 %, 79 % and 79 % with the combined meshes, the\ninternal mesh and the external mesh respectively where at a similar concentration the soluble\nPO4-P removal without mesh was 79 %. At a higher magnesium dose (2.3 mM), the capacity\nof the reactor in removing phosphorus was also excellent, and was not affected by the\nimmersion of the mesh as soluble PO4-P removals were 81 % and 86 % without mesh and\nwith both meshes respectively.\n0\n20\n40\n60\n80\n100\nWithout\nmesh\nCombined\nsystem\nSingle\nexternal\nmesh\nSingle\ninternal\nmesh\nWithout\nmesh\nCombined\nsystem\n[Mg]=1.64mM [Mg]=2.3mM\nConfiguration\nA\nve\nra\ng\ne\nR\nem\no\nva\nl(\n%\n)\nPO4 (%) NH4 (%)\nFig. 2 - Average PO4-P and NH4-N percentage removals and standard deviations\nachieved under various reactor configurations.\nWith regards to levels of ammonium remaining in solution after 2 h of experiments, results\nshowed that for similar conditions of precipitation (1.64 mM or 2.3 mM) the application of\nthe metallic meshes in a combined configuration made no great difference when compared to\ncrystallisation tests without it. For instance, at a magnesium concentration of 1.64 mM, NH4-\nN removals were 56 % and 50 % either without the system or with the combined one, while at\na magnesium concentration of 2.3 mM NH4-N removals were similar without the system and\nwith the combined meshes with values of 56 %. A slight increase of levels of ammonium\nremaining in solution only occurred when the meshes were submerged in an individual\n8configuration as NH4-N removals were 43 % and 39 % with respectively the external mesh\nand the internal mesh.\nChanges in absorbance during the crystallisation can be used to follow nucleation and crystal\ngrowth processes (Barrett and Parsons, 1998). The absorbance of a precipitating solution\ntypically increases during nucleation due to crystal birth, while decreases as particles grow\ndue to their settlement (Higashitani et al., 1993). In the present study, the absorbance\nmeasurements were then undertaken to follow struvite crystallisation progress and determine\nthe impact of the meshes on recovery. Results were compared to crystallisation tests carried\nout under similar conditions without accumulation system (Fig. 3).\n0.000\n0.050\n0.100\n0.150\n0.200\n0.250\n0.300\n0 20 40 60 80 100 120\nTime (min)\nA\nve\nra\ng\ne\nab\nso\nrb\nan\nce\n(3\n85\nn\nm\n)\n1.64mM, without mesh 1.64mM, with combined mesh average\n1.64mM, with single external mesh average 1.64mM, with single internal mesh average\nFig. 3 - Average absorbance versus time for different configurations of the metallic mesh\nsystem.\nFor crystallisation tests at an initial Mg concentration of 1.64 mM without the mesh, the\nabsorbance profile showed that struvite nucleation occurred rapidly with absorbance\nincreasing from 0.030 ± 0.018 to 0.255 ± 0.028 in less than 15 min, and reaching a steady\nstate for the remaining experimental time with an absorbance value of 0.230 ±0.007 after 2 h.\n9With the mesh systems, absorbance measurements in the early stages of crystallisation (within\n20 min) followed a similar pattern indicating similar rates of nucleation, but after this period\nthe absorbance decreased over the remaining experimental time. To illustrate, with the\ninternal mesh, absorbance reached a maximum value of 0.204 ± 0.006 after 16 min, and then\ndecreased slowly down to 0.155 ± 0.007 after 2 h suggesting capture of some of the crystals\nonto the mesh. Visual observations of the mesh after 2 h reinforced this hypothesis as a white\ndeposit was visible on its surface. Using only the external mesh, the absorbance profile\nincreased to a maximum value of 0.176 ± 0.023 after 12 min. The absorbance decreased then\ncontinuously and reached a final value of 0.065 ± 0.012 after 2 h indicating significantly less\nstruvite crystals were suspended in solution.\nWhen struvite was crystallised in presence of the combined meshes, the absorbance profile\nwas similar to the one observed with the external mesh, but again even more struvite was\ncaptured as an absorbance peak at 0.150 ± 0.026 was observed after only 10 min, and then\nmeasurements dropped down to 0.021 ± 0.013 in less than 60 min to finally stabilise around\nonly 0.012 ± 0.005.\nThe statistical results of the analysis of variance (ANOVA Single Factor) on absorbance data\nobtained at t=10 min and t=60 min and an initial Mg concentration of 1.64mM confirmed the\nprevious observations in that the application of the metallic mesh system under various\nconfigurations (i.e. Combined meshes, Single Internal mesh or single external mesh) had a\nsignificant impact on the absorbance of the solution remaining in the reactor, hence struvite\nrecovery. At t=10min the four configurations differed from each others as the calculated F\nvalue (7.19) exceeded the tabulated Fcrit (p=0.05) value of 4.066, while after 60 min the\ndifference became highly significant as the calculated F was 259.34 compared to a Fcrit\n(p=0.05) of 4.066 and the probability that the calculated F value was obtained by chance\nalone was very small (2.63.10-8).\n10\nVisual observations of the mesh (Fig. 4) showed that in a combined configuration the system\naccumulated a great amount of struvite particles, explaining the dramatic decrease in\nabsorbance in the overall reactor. Interestingly, struvite adhered primarily on the external\nmesh of the system filling progressively holes situated in the bottom half of the mesh (Fig.\n4A), while accumulation of struvite particles on the internal mesh was lower as a light white\ndeposit was only visible on the wire surface of the mesh (Fig. 4B). As the internal mesh was\npositioned in the middle of the enlarged section right above the air diffuser, higher turbulence\nin this zone due to air may have then led to displacement of attached crystals.\nFig. 4 - Pictures of the external (A) and internal (B) meshes used combined after 2 h of\ncrystallisation at [Mg] =1.64 mM.\nThe amount of struvite particles remaining in solution after 2 h was also measured for the\ndifferent operating conditions (Fig. 5).\nAt a Mg concentration of 1.64 mM, the amount of particles in suspension after 2 hours fell\nfrom 302.2 ± 12.1 mg.L-1 with no mesh to 138.3 ± 14.6, 69.9 ± 17.1 and 12.2 ± 11.1 mg.L-1\nwith the single internal mesh, the single external mesh and the combined system respectively.\nThis corresponded to reductions of 96 %, 77 % and 54 % of suspended particles with\nrespectively the combined system, the single external mesh and the single internal mesh when\nStruvite\naccumulation\nlevel\nA B\n11\ncompared to tests without mesh. These values correlated well with the absorbance values of\n0.155 ± 0.007, 0.065 ± 0.012, and 0.021 ± 0.013 measured in solution after 2 h for\nrespectively the single internal mesh, the single external mesh and the combined system.\n0\n50\n100\n150\n200\n250\n300\n350\nWithout\nmesh\nCombined\nsystem\nSingle\nexternal\nmesh\nSingle\ninternal\nmesh\nWithout\nmesh\nCombined\nsystem\n1.64mM 2.3mM\nConfiguration\nS\nu\nsp\nen\nd\ned\nst\nru\nvi\nte\n(m\ng\n.L\n-1\n)\nFig. 5 - Average concentration of suspended struvite particles in solution after 2 h, and\nstandard devitations.\nThe efficiency of the system in removing suspended solids seemed to not only depend on the\nconfiguration tested but also on the magnesium stoichiometric dose. To illustrate, at high\nconcentrations (2.3 mM Mg) in a combined configuration, there was still 136.6 ± 12.4 mg.L-1\nof suspended struvite after 2 h of experiments corresponding to a 34 % of suspended solids\nremoval. As a comparison, at 1.64 mM in the same configuration, almost all of the suspended\nsolids was captured by the system (Fig. 5). However, at 2.3 mM the levels of suspended\nstruvite particles in the control test without mesh were already lower than in the same\nconditions at a concentration of 1.64 mM. A settlement of particles at high concentrations\nmay be at the origin of this difference and may explain lower removals of suspended struvite\ncrystals.\n12\nThe amount of struvite recovered from the mesh has been quantified for each specific\ncondition of precipitation previously tested and converted into rates of production per hour\n(Fig. 6).\n0\n200\n400\n600\n800\n1000\n1200\nCombined\nsystem\nSingle external\nmesh\nSingle internal\nmesh\nCombined\nsystem\n1.64mM 2.3mM\nConfiguration tested\nA\nve\nra\ng\ne\nre\nco\nve\nre\nd\nst\nru\nvi\nte\n(m\ng\n.h\n-1\n)\nFig. 6 - Effect of process running configurations on struvite recovery (Average results\nand standard deviations).\nWhen submerged in the reactor for 2 h, the metallic mesh could accumulate up to 1020 mg.h-1\nof struvite when the combined system was used at an Mg concentration of 1.64 mM, making\nthis configuration the optimum one in recovering struvite. Indeed, under the other\nconfigurations tested the average quantities of struvite accumulated at the same concentration\nwere reduced to 477 ± 123 mg.h-1 for the external mesh and 196 ± 65 mg.h-1 for the internal\nmesh. When linked to the actual surface of metal available for struvite to adhere on, the\naverage accumulation rate of struvite under the optimum conditions (i.e. dual mesh system \/\n[Mg] = 1.64 mM) was of 7.6 g.m-2.h-1. At [Mg] = 2.3 mM, the potential to form greater\nquantities of struvite is higher due to higher concentrations of compounds available to form\nstruvite. However, results revealed in that case that the mesh was not able to attach more\n13\nparticles as the accumulation rate was only 588 ± 220 mg.h-1 corresponding to an average rate\nof accumulation of 5.3 g.m-2.h-1.\nFinally, it was found that the position of the mesh in the reactor was influencing its capacity\nin recovering struvite. For instance, the internal mesh which was placed above the air diffuser\nwas not able to accumulate high amounts of struvite when compared to the external mesh.\nAfter drying of the meshes, the struvite was easily recoverable by gentle scraping. SEM-EDS\nanalyses of the dried samples revealed particles present on each mesh surfaces were actually\nan agglomeration of single orthorhombic crystals (Fig. 7). As expected, the XRD (not shown)\nand EDS analyses also confirmed that the recovered product was pure struvite with EDS\nspectra showing the presence of Mg, P and O indicating the metallic mesh characteristics had\nno influence on purity of the crystal formed (Fig. 7).\nFig. 7 - SEM image and EDS spectrum of the recovered struvite.\n4. Discussion\nIn their study on the adhesion properties of potential seed materials for struvite crystallisation\nLe Corre et al. (2006a), demonstrated that struvite should adhere to a metallic surface. They\nmeasured the strength of adhesion between struvite and a range of surfaces and demonstrated\n14\nthe adhesion forces between struvite and a metallic surface were higher than between struvite\nand the other surfaces investigated (i.e. sand, recycled concrete aggregates and preformed\nstruvite crystals). Those results were in accordance with previous works (Doyle et al., 2002)\nthat have studied the scaling properties of struvite in pipes and other pieces of equipment in\ncontact with wastewater effluents and demonstrated a strong affinity of metallic support for\nstruvite deposition (Mohajit et al., 1989). Booram et al. (1975) in one of the first studies of\nstruvite deposition in a wastewater treatment plant deduced that metallic interfaces acted\npreferentially as active growth site for struvite deposition. Later on, Doyle et al. (2002)\nconfirmed that stainless steel coupons placed for 8 h in centrate liquors allowed significant\nadhesion of struvite with scaling rates in the range 0.4 g.m-2.h-1 - 5.4 g.m-2.h-1 depending on\nthe operating conditions. According to these observations a well designed system composed\nof stainless steel and submerged in a struvite crystallisation reactor should be able to act as a\nseed material to grow struvite.\nThe metallic system consisting of two circular meshes tested in the present study confirmed\nour expectations in that it was able to accumulate large amounts of struvite at its surface (i.e.\nup to 7.6 g.m-2.h-1 using the combined system at a Mg concentration of 1.64 mM) in rather\nshort times (2h). However, absorbance and suspended solids measurements suggested that\nrather than growing struvite at its surface as supposed from previously cited studies on the\nadhesive properties of struvite, the mesh was trapping crystals that formed in the reactor.\nIn the literature, only one study has explored and made use of the adhesive properties of\nmetallic surfaces for intentional crystallisation of struvite. Suzuki et al. (2005) designed a\nrectangular stainless steel device for struvite crystallisation from swine wastewater. Their\nsystem which was immersed in the aeration column of a demonstrative reactor operating in a\ncontinuous mode recovered up to 1,037 g of struvite on its accumulation face after 30 days of\noperation. By comparison, considering the optimum struvite accumulation rate of 7.6 g.m-2.h-1\n15\ncalculated here to be constant, if the meshes had been submerged over 30 days in the pilot\nreactor running in a continuous mode, up to 602 g of struvite could have been theoretically\nrecovered from the mesh. This is more than 1.5-fold lower than what Suzuki et al. (2005)\nobserved but still promising when considering that this was achieved in synthetic liquors.\nFurthermore, rates of agglomeration on sand or struvite as seed material seem much lower\nthan the rate observed on metallic supports. For instance, Shimamura et al. (2003) who\nprecipitated struvite onto fine particles in real liquors, had rate of agglomeration (estimated\nfrom the increase in mean particle size they reported) of only 1.82 g.m-2.h-1 after 12 days.\nThe advantages of struvite crystallisation on a static support are numerous. Indeed, as stated\nby Stratful et al. (2004), one of the reason why wastewater companies have not adopted the\nstruvite crystallisation technique, especially FBRs, to remove and recover phosphorus is\nrelated to their complex design and the need of qualified operators to constantly control and\nmaximise their efficiency. Accumulation devices like the one used here could limit these\nproblems as they are relatively simple to design and require very low maintenance. Moreover,\nrecovery of struvite can simply be achieved by light scraping of the mesh. Suzuki et al. (2005)\nconcluded that the ease of use and robustness of similar recovery systems would be\nparticularly attractive for swine farmers. The utilisation of this type of processes would also\ndecrease the risk of operational failures or reduction of the process efficiency that can be\nobserved when crystallising struvite on granular materials. Ohlinger et al. (2000) have for\nexample underlined that when using granular material as seed for struvite crystallisation in an\nFBR, the mass of particles increased due to growth and could provoke bulking of the media.\nTo avoid this phenomenon, a part of the media needed to be refreshed periodically and this\nregeneration could affect the efficiency of the FBR in removing phosphorus. Shimamura et al.\n(2003) also indicated that with traditional FBRs, the growth of struvite crystals reduces their\nfluidisation, and limits the surface area available for its precipitation reducing then struvite\n16\nrecovery. Furthermore, in some cases the recovery of struvite on a regular basis can also\nrequire a temporary shutdown of the crystallisation process during the settlement of the\nproduct (Adnan et al., 2003), whereas the operation of the present reactor in a continuous\nmode would only require spare accumulation systems so that the fully loaded mesh could be\nreplaced by a fresh one without having to stop all feeding and\/or air pumps.\nBattistoni et al. (2005) explained that operational costs of their fluidised bed reactor were\nincreased because of the energy consumption linked to pumping equipments and costs of the\nraw seed material (i.e. sand). To illustrate, they indicated that struvite production using seed\nmaterials as sand would cost about 0.28 €.m-3 including pumping energy and regeneration of\nseeds whereas without seed material the costs of production could be reduced down to 0.19\n€.m-3. It can be then assumed that the utilisation of the metallic mesh system which requires\nlower feeding and air flow rates than the one necessary to fluidise a bed of growing granular\nseed materials would also save energy significantly.\n5. Conclusion\nIn the current work the performance of a stainless style mesh system acting as a seed substrate\nfor struvite crystallisation in synthetic liquors has been investigated. Various tests in different\nconfigurations demonstrated that the system combining two concentric meshes placed in the\nenlarged section of the pilot scale crystallisation reactor was able to accumulate struvite at a\nrate of 7.6 g.m-2.h-1 under optimum conditions of precipitation and to achieve excellent PO4-P\nremovals up to 81%. The mesh was particularly efficient when placed on the edge of the\nenlarged section of the reactor, as it was showed that mixing energy could be responsible of\ncrystals detachment from the mesh. Finally, rather than growing struvite directly on its\nsurface, the mesh system is thought to capture struvite crystal already formed in solution.\n17\nFurther investigations in real liquors are currently being undertaken at Cranfield University.\nHowever, the conclusions resulting from this work and the comparisons with other seeded\nprocesses showed that a struvite crystallisation reactor combined with the current metallic\nsystem could be a solution for maximising phosphorus recycling in wastewater treatment\nplants.\nAcknowledgement\nThe authors would like to thank Cherub and Severn Trent Water for their sponsorship of this\nwork.\nREFERENCES\nAdnan, A., Mavinic, D.S. and Koch, F.A. (2003) Pilot-scale study of phosphorus recovery\nthrough struvite crystallization-examining the process feasibility. Journal of Environmental\nEngineering Sciences 2, 315-324.\nAPHA (1998). Standard methods for the examination of water and wastewater, 20th Edition.\nAmerican Public Health Association \/ American Water Works Association \/ Water\nEnvironment Federation, Washington DC, USA.\nBarett, R.A. and Parsons, S.A. (1998) The influence of magnetic fields on calcium carbonate\nprecipitation. Water Research 32, 609-612.\nBattistoni, P., De Angelis, A., Prisciandaro, M., Boccadoro, R. and Bolzonella, D. (2002) P\nremoval from anaerobic supernatants by struvite crystallisation: long term validation and\n18\nprocess modelling. Water Research 36, 1927-1938.\nBattistoni, P., Boccadoro, R., Fatone, F. and Pavan, P. (2005) Auto-nucleation and crystal\ngrowth of struvite in a demonstrative fluidized bed reactor (FBR). Environmental Technology\n26, 975-982.\nBooram, C.V., Smith, R.J. and Hazen, T.E. (1975) Crystalline phosphate precipitation from\nanaerobic animal waste treatment lagoon liquors. Transactions of the American Society of\nAgricultural Engineers, 340-343.\nBorgerding, J. (1972) Phosphate deposits in digestion systems. Journal of the Water Pollution\nControl Federation 44, 813-819.\nBouropoulos, N.C. and Koutsoukos, P.G. (2000) Spontaneous precipitation of struvite from\naqueous solutions. Journal of Crystal Growth 213, 381-388.\nde-Bashan, L.E. and Bashan, Y. (2004) Recent advances in removing phosphorus from\nwastewater and its use as fertilizer (1997-2003), Water Research 38, 4222-4246.\nDoyle, J.D. and Parsons, S.A. (2002) Struvite formation, control and recovery. Water\nResearch 36, 3925-3940.\nDoyle, J.D., Oldring, K., Churchley, J. and Parsons, S.A. (2002) Struvite formation and the\nfouling propensity of different materials. Water Research 36, 3971-3978.\n19\nDoyle, J.D., Oldring, K., Churchley, J., Price, C. and Parsons, S.A. (2003) Chemical control\nof struvite precipitation. Journal of Environmental Engineering- ASCE 129, 419-426.\nDoyle, J.D. and Parsons, S.A. (2004) Struvite scale formation and control. Water Science and\nTechnology 49, 177-182.\nGaterell, M.R., Gay, R., Wilson, R., Gochin, R.J. and Lester, J.N. (2000) An economic and\nenvironmental evaluation of the opportunities for substituting phosphorus recovered from\nwastewater treatment works in existing UK fertiliser markets. Environmental Technology 21,\n1067-1084.\nHigashitani, K., Kage, A., Katamura, S., Imaj, K. and Hatade, S. (1993) Effects of a magnetic\nfield on the formation of CaCO3 particles. Journal of Colloids and Interface Science 156, 90-\n95.\nLe Corre, K.S., Valsami-Jones, E., Hobbs, P. and Parsons, S.A. (2005) Impact of calcium on\nstruvite crystal size, shape and purity. Journal of Crystal Growth 283, 514–522.\nLe Corre, K.S., Valsami-Jones, E., Hobbs, P., Boyd, R.D., Jefferson, B. and Parsons S.A.\n(2006a) Influence of seed material characteristics on rapid struvite recovery. In:\nUnderstanding Struvite Crystallisation and Recovery. PhD Thesis, Centre for Water Science,\nCranfield University, Cranfield, UK.\nLe Corre, K.S., Valsami-Jones, E., Hobbs, P. and Parsons, S.A. (2006b) Impact of reactor\noperation on success of struvite precipitation from synthetic liquors. In: Understanding\n20\nstruvite crystallisation and recovery. PhD Thesis, Centre for Water Science, Cranfield\nUniversity, Cranfield, UK.\nMohajit, X., Bhattarai, K.K., Taiganides, E.P. and Yap, B.C. (1989) Struvite deposits in pipes\nand aerators. Biological Wastes 30, 133-147.\nOhlinger, K.N., Young, T.M. and Schroeder, E.D. (2000) Postdigestion struvite precipitation\nusing a fluidised bed reactor. Journal of Environmental Engineering 126, 361-368.\nShimamura, K., Tanaka, T., Miura, Y. and Ishikawa, H. (2003) Development of a high\nefficiency phosphorus recovery method using a fluidised-bed crystallized phosphorus removal\nsystem. Water Science and Technology 48, 163-170.\nStratful, I., Scrimshaw, M.D. and Lester, J.N. (2004) Removal of struvite to prevent problems\nassociated with its accumulation in wastewater treatment works. Water Environment\nResearch 76, 437-4199.\nSuzuki, K., Tanaka, Y., Kuroda, K., Hanajima, D. and Fukumoto, Y. (2005) Recovery of\nphosphorus from swine wastewater through crystallization. Bioresource Technology 96,\n1544-1550.\nUeno, Y. and Fujii, M. (2001) Three years experience of operating and selling recovered\nstruvite from full-scale plant. Environmental Technology 22, 1373-1381.\nVan Rensbourg, P., Musvoto, E.V., Wentzel, M.C. and Ekama, G.A. (2003) Modelling\n21\nmultiple mineral precipitation in anaerobic digester liquor. Water Research 37, 3087-3097.\nVon Münch, E. and Barr, K. (2001) Controlled crystallisation for removing phosphorus from\nanaerobic digester sidestreams. Water Research 35, 151-159.\n"}