{"doi":"10.1109\/JSTQE.2003.819504","coreId":"101048","oai":"oai:epubs.surrey.ac.uk:452","identifiers":["oai:epubs.surrey.ac.uk:452","10.1109\/JSTQE.2003.819504"],"title":"The Role of Auger Recombination in InAs 1.3-\/mu m Quantum-Dot Lasers Investigated Using High Hydrostatic Pressure","authors":["Marko, I P","Andreev, A D","Adams, A R","Krebs, R","Reithmaier, J P","Forchel, A"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-09","abstract":"<p>InAs quantum-dot (QD) lasers were investigated in the temperature range 20-300 K and under hydrostatic pressure in the range of 0-12 kbar at room temperature. The results indicate that Auger recombination is very important in 1.3-mum QD lasers at room temperature and it is, therefore, the possible cause of the relatively low characteristic temperature observed, of T-0 = 41 K. In the 980-mn QD lasers where T-0 = 110-130 K, radiative recombination dominates. The laser emission photon energy E-las increases linearly with pressure p at 10.1 and 8.3 meV\/kbar for 980 nm and 1.3-mum QD lasers, respectively. For the 980-mn QD lasers the threshold current increases with pressure at a rate proportional to the square of the photon energy E-las(2). However, la the threshold current of the 1.3-mum QD laser decreases. by 26% over a 12-kbar pressure range. This demonstrates the presence of a nonradiative recombination contribution to the threshold current, which decreases with increasing pressure. The authors show that this nonradiative contribution is Auger recombination. The results are discussed in the framework of a theoretical model based on the electronic structure and radiative recombination calculations carried out using an 8 x 8 k(.)p Hamiltonian.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"IEEE","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:452<\/identifier><datestamp>\n      2017-10-31T13:58:16Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/452\/<\/dc:relation><dc:title>\n        The Role of Auger Recombination in InAs 1.3-\/mu m Quantum-Dot Lasers Investigated Using High Hydrostatic Pressure<\/dc:title><dc:creator>\n        Marko, I P<\/dc:creator><dc:creator>\n        Andreev, A D<\/dc:creator><dc:creator>\n        Adams, A R<\/dc:creator><dc:creator>\n        Krebs, R<\/dc:creator><dc:creator>\n        Reithmaier, J P<\/dc:creator><dc:creator>\n        Forchel, A<\/dc:creator><dc:description>\n        <p>InAs quantum-dot (QD) lasers were investigated in the temperature range 20-300 K and under hydrostatic pressure in the range of 0-12 kbar at room temperature. The results indicate that Auger recombination is very important in 1.3-mum QD lasers at room temperature and it is, therefore, the possible cause of the relatively low characteristic temperature observed, of T-0 = 41 K. In the 980-mn QD lasers where T-0 = 110-130 K, radiative recombination dominates. The laser emission photon energy E-las increases linearly with pressure p at 10.1 and 8.3 meV\/kbar for 980 nm and 1.3-mum QD lasers, respectively. For the 980-mn QD lasers the threshold current increases with pressure at a rate proportional to the square of the photon energy E-las(2). However, la the threshold current of the 1.3-mum QD laser decreases. by 26% over a 12-kbar pressure range. This demonstrates the presence of a nonradiative recombination contribution to the threshold current, which decreases with increasing pressure. The authors show that this nonradiative contribution is Auger recombination. The results are discussed in the framework of a theoretical model based on the electronic structure and radiative recombination calculations carried out using an 8 x 8 k(.)p Hamiltonian.<\/p><\/dc:description><dc:publisher>\n        IEEE<\/dc:publisher><dc:date>\n        2003-09<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/452\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Marko, I P, Andreev, A D, Adams, A R, Krebs, R, Reithmaier, J P and Forchel, A  (2003) The Role of Auger Recombination in InAs 1.3-\/mu m Quantum-Dot Lasers Investigated Using High Hydrostatic Pressure   IEEE Journal of Selected Topics in Quantum Electronics, 9 (5).       <\/dc:identifier><dc:relation>\n        10.1109\/JSTQE.2003.819504<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/452\/","10.1109\/JSTQE.2003.819504"],"year":2003,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"1300 IEEE JOURNAL OF SELECTED TOPICS IN QUANTUM ELECTRONICS, VOL. 9, NO. 5, SEPTEMBER\/OCTOBER 2003\nThe Role of Auger Recombination in InAs 1.3-\u0016m\nQuantum-Dot Lasers Investigated Using High\nHydrostatic Pressure\nI. P. Marko, A. D. Andreev, A. R. Adams, R. Krebs, J. P. Reithmaier, and A. Forchel\nAbstract—InAs quantum-dot (QD) lasers were investigated in\nthe temperature range 20–300 K and under hydrostatic pressure\nin the range of 0–12 kbar at room temperature. The results in-\ndicate that Auger recombination is very important in 1.3- m QD\nlasers at room temperature and it is, therefore, the possible cause\nof the relatively low characteristic temperature observed, of 0 =\n41 K. In the 980-nm QD lasers where 0 = 110–130 K, radia-\ntive recombination dominates. The laser emission photon energy\nlas increases linearly with pressure at 10.1 and 8.3 meV\/kbar\nfor 980 nm and 1.3- m QD lasers, respectively. For the 980-nm\nQD lasers the threshold current increases with pressure at a rate\nproportional to the square of the photon energy 2\nlas\n. However,\nthe threshold current of the 1.3- m QD laser decreases by 26%\nover a 12-kbar pressure range. This demonstrates the presence of a\nnonradiative recombination contribution to the threshold current,\nwhich decreases with increasing pressure. The authors show that\nthis nonradiative contribution is Auger recombination. The results\nare discussed in the framework of a theoretical model based on the\nelectronic structure and radiative recombination calculations car-\nried out using an 8 8 k p Hamiltonian.\nIndex Terms—Auger recombination, hydrostatic high pressure,\nInAs, quantum dot, recombination mechanisms, semiconductor\nlaser, threshold current.\nI. INTRODUCTION\nQUANTUM-DOT (QD) lasers are receiving a great dealof attention, largely due to the low threshold current\nand high temperature stability of quantum dots lasers pre-\ndicted theoretically almost 20 years ago [1], [2]. This is particu-\nlarly important for telecommunication systems in which devices\nare designed to operate at 1.3 m, where optical fibers have\nzero dispersion. The main driving reason for reduction of the\neffective dimensionality of the active regions of semiconductor\nlasers has been the control of the electron density of states that\nquantum confinement provides, allowing injected electrons and\nholes to be ever more restricted to those energies where they can\ntake part in the stimulated emission process. This results, for ex-\nample, in the prediction that if the electrons can be confined to a\nsingle discrete atomic like level in QD lasers, they will not suffer\nManuscript received February 27, 2003; revised August 4, 2003. This work\nwas supported in part by EPSRC.\nI. P. Marko is with the Advanced Technology Institute, University of Surrey,\nSurrey, GU2 7XH, U.K., on leave from the Institute of Physics, National\nAcademy of Sciences of Belarus, 220072 Minsk, Belarus.\nA. D. Andreev and A. R. Adams are with the Advanced Technology Institute,\nUniversity of Surrey, Surrey GU2 7XH, U.K. (e-mail: i.marko@surrey.ac.uk).\nR. Krebs, J. P. Reithmaier, and A. Forchel are with the Technische Physik,\nUniversität Würzburg, D-97074, Würzburg, Germany.\nDigital Object Identifier 10.1109\/JSTQE.2003.819504\nthermal broadening and the threshold current will be tempera-\nture insensitive [1], [2]. However, despite the growth of very\ngood self-assembled layers of quantum dots, the longer wave-\nlength lasers required for optical communication remain stub-\nbornly temperature sensitive [3]–[5]. Although nearly temper-\nature insensitive performance was indeed observed in 1.3- m\nQD lasers in the temperature range of 100–200 K [3], [5], at\nroom temperature the lasers studied in [3] exhibit an even worse\ntemperature performance than available quantum well devices.\nAt higher temperatures, the characteristic temperature of the\n1.3- m QD lasers decreases to 30–160 K [3]–[5]. Therefore,\nit is very important to understand the physical mechanisms re-\nsponsible for QD laser operation at higher ( 250 K) temper-\natures. A re-emission of carriers into the optical confinement\nlayers (OCL) activated at increasing temperature and their ra-\ndiative recombination in the OCL was proposed as the reason\nfor the high temperature sensitivity of QD lasers [6], [7]. Re-\ncently, it has been shown also that to decrease the temperature\nsensitivity of , the shape of the QDs should be engineered\nto maximize the energy separation between the ground electron\nand hole states and their respective excited states [8]. In addi-\ntion, the same group has shown that using p-type doping of the\nQD active region to avoid gain saturation can increase the char-\nacteristic temperature up to K [9].\nIn this paper, we show results, from studies of the hydrostatic\npressure dependence of the characteristics of 980 nm and 1.3-\nm QD lasers, that indicate that strong Auger recombination pro-\ncesses occur in the 1.3- m lasers where the total threshold cur-\nrent is very temperature dependent. Therefore, the existence\nof Auger recombination in 1.3- m QD devices may explain\ntheir strong temperature dependence, just as was observed in\nquantum well 1.3- m devices [10], [11]. This would be ex-\ntremely important for their further development since it implies\nthat even if perfectly uniform arrays of quantum dots can be pro-\nduced, QD lasers may remain temperature sensitive unless the\nAuger process can also be eliminated.\nII. EXPERIMENT\nA. Samples\nThe broad area lasers investigated were grown on\n(100)-Si:GaAs ( cm ) substrates using\nmolecular beam epitaxy. The active regions were embedded\nbetween Al Ga As cladding layers (1.6- m-thick n-type\nbottom cladding layer and 1.5- m p-type upper cladding\nlayer) and within an AlGaAs graded index waveguide. A\n1077-260X\/03$17.00 © 2003 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:24 from IEEE Xplore.  Restrictions apply.\nMARKO et al.: ROLE OF AUGER RECOMBINATION IN InAs 1.3- m QUANTUM-DOT LASERS 1301\nshort period AlGaAs–GaAs superlattice with varying average\nAl concentration from 0.30 to 0.15 formed the graded index\nwaveguide layer [12]. The thickness of the waveguide layers\nwas 200 nm in the 1.3- m QD lasers and 400 nm in the 980-nm\nQD lasers. The active region of the 980-nm QD lasers was\nformed by either one or two layers of InAs QDs separated by\na 30-nm GaAs spacer [12]. The active region of the 1.3- m\nQD lasers consisted of six stacked layers of InAs QDs within\n10-nm Ga In As quantum wells (QWs) separated by\n40-nm GaAs barriers [13]. The facets were as-cleaved and the\ncavity lengths were 1 mm for the 980-nm lasers and 2 mm for\nthe 1.3- m lasers. The width of the top stripe contact for the\nbroad area lasers was 50 or 100 m. The upper cladding layer\nin the 4- m-ridge 1.3- m QD lasers was etched away up to\n250 nm from the inner waveguide [13]. The position of the QD\nlayers inside the QWs was optimized in the ridge lasers. The\nQD layer in this case was grown on a 1-nm Ga In As\nlayer and covered with a 5-nm layer of the same material. Such\noptimization appeared to reduce the internal optical losses to\n2 cm [13]. The substrate in the ridge lasers was thinned to\nabout 150 m.\nB. Investigation of Temperature Behavior of Spontaneous\nEmission Spectra, Threshold Current , Radiative Current\n, and Radiative Efficiency\nTo measure spontaneous emission, a window was milled in\nthe substrate contact of the lasers. The windows were fabricated\nto a size of approximately 50 200 m using an Ar-ion-beam\nmilling technique. By this method, we collected pure sponta-\nneous unamplified light. Emissions from the window as well as\nfrom the laser facet were collected using 100- m-diameter core\nmultimoded silica-based optical fibers connected to an optical\nspectrum analyzer (OSA) or to an optical power meter. To\nprovide a constant collection efficiency of the emission during\nthe measurement cycle, which is essential for the measurements\nof the temperature dependencies of spontaneous emission, the\nlaser mounts were specifically designed and the optical fibers\nwere carefully clamped and glued to the holder [10], [14]. The\ntemperature was varied from 20 K up to room temperature\nwith an He-refrigerator. The lasers were investigated in pulsed\nregime to avoid internal heating. The pulse duration and\nrepetition rate were 500 ns and 10–20 kHz, respectively.\nDuring the measurements of the spontaneous emission\nspectra from the window using an OSA, the total emission from\nthe laser facet was measured using an optical power meter.\nThus, the spontaneous emission spectra and output power\nvalues at different currents and temperatures were monitored\nsimultaneously. These data were then used for the analysis of\ntemperature behavior of the lasing threshold, the radiative part\nof the total current , and the radiative efficiency , which\ncharacterizes the temperature dependence of a ratio between\nradiative and nonradiative recombination.\nFig. 1 shows the method for the determination of and at\ndifferent temperatures using measured dependencies of the inte-\ngrated spontaneous emission intensity versus current. The ra-\ndiative part of the threshold current is proportional to the radia-\ntive recombination rate and thus to the integrated spontaneous\nemission intensity at the lasing threshold. Therefore, the tem-\nFig. 1. Method of measurements of the radiative current I , which is\nproportional to the integrated spontaneous emission intensity L (see insert),\nat I and radiative efficiency \u0011 at different temperatures using measured\ndependencies of the integrated spontaneous emission intensity versus current.\nData are shown for the 1.3-\u0016m-broad area QD laser.\nperature behavior of was measured using the value of the\nintegrated spontaneous emission intensity , at threshold. The\nvariation of the radiative recombination efficiency was deter-\nmined from the integrated spontaneous emission intensity at a\nconstant subthreshold current. It characterizes the temperature\nbehavior of the radiative recombination rate at a constant rate of\ncarrier injection.\nTo estimate the influence of absorption in the GaAs substrate\non the shape of the measured spontaneous emission spectra,\nthe transmission and reflection spectra of a substrate wafer\nwere measured. In addition, spontaneous emission spectra\nfrom the window in the top (p-side) contact were measured\nin the 980-nm QD lasers. The absorption of the thick GaAs\nsubstrate wafer was 30%–31% at room temperature in a spec-\ntral range 1100–1400 nm. Measurement of the substrate wafer\ntransmittance at the wavelength m as a function\nof temperature at – K showed that this value is\nindependent of temperature.\nSpontaneous emission spectra of the 980-nm QD laser from\nthe window in the top p-side contact and from the bottom side\nshowed that the spectra from the substrate window is modulated\nby interference. The integrated intensity measured from the sub-\nstrate side was about 25% less than integrated intensity from the\np-side due to absorption of the short wavelength emission. This\ngives an approximate possible error of the measurements of the\ntemperature behavior of and , if the absorption changes\nwith temperature. The ratio of the emission spectrum from the\ntop window to the spectrum measured from the bottom side cor-\nresponded well to the absorption edge of GaAs. This allowed us\nto take into account the influence of the absorption in the sub-\nstrate on the shape of high-energy side of the spontaneous emis-\nsion spectra from 980-nm lasers.\nC. Measurements of and Lasing Photon Energy\nDependencies on Hydrostatic Pressure\nHigh pressure provides a powerful tool to study the recom-\nbination mechanisms responsible for laser performance, as was\ndemonstrated for quantum well lasers [10], [11]. Applying high\npressure allows the energy of the emitted photons to be\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:24 from IEEE Xplore.  Restrictions apply.\n1302 IEEE JOURNAL OF SELECTED TOPICS IN QUANTUM ELECTRONICS, VOL. 9, NO. 5, SEPTEMBER\/OCTOBER 2003\nFig. 2. Spontaneous emission spectra from the window (solid lines correspond\nto the measurements at injected current I = 155 mA which is below the lasing\nthreshold, dotted lines are the spectra at the threshold current) and lasing spectra\nin a temperature interval of T = 20–300K for the broad area 1.3-\u0016m QD laser.\nDashed line shows change of the spontaneous emission peak.\nvaried while keeping the basic properties of the band structure\nrelatively unchanged. Various recombination mechanisms de-\npend on in different ways. For example, the radiative re-\ncombination contribution to the laser threshold current usually\nincreases with pressure as in quantum-well lasers, while the\nAuger recombination coefficient decreases [10], [11]. In con-\njunction with other techniques, these variations allow one to de-\ntermine the relative importance of these recombination mecha-\nnisms.\nMeasurements of the hydrostatic pressure dependence of\nand the lasing photon energy were carried out at room\ntemperature using a piston and cylinder apparatus capable of\ngenerating 15 kbar [10], [11]. Essence-F was used as the pres-\nsure-transmitting medium. The pressure was measured using a\ncoil of manganin wire whose change in resistance with pres-\nsure is known. The lasers were aligned with an optical fiber\nsealed into the upper piston. The lasing wavelength was mea-\nsured using an optical spectrum analyzer.\nIII. EXPERIMENTAL RESULTS\nA. Temperature Behavior of 1.3- m and 980-nm QD Lasers\nFig. 2 shows spontaneous emission spectra from the window\nin the substrate contact and lasing spectra of the broad area\n1.3- m device at different temperatures. To show the temper-\nature variation of spontaneous emission, the spectra measured\nat a constant current of 155 mA, which is always below lasing\nthreshold, are plotted with solid lines. Spontaneous emission\nspectra at the threshold current at each temperature are shown\nwith dotted lines. In the whole temperature range from 20 K\nup to room temperature the lasing spectrum occurred on the\nlow energy side of the spontaneous emission spectrum, which\ndemonstrates that lasing was observed from the ground state.\nThe lasing spectra at low temperature K were very\nbroad because of inhomogeneous broadening of the gain spec-\ntrum due to quantum dot fluctuations. At low temperature lasing\nthreshold conditions were realized for a number of QDs with\ndifferent emission wavelength. Thus, the full width at half max-\nimum (FWHM) of the lasing spectra was about 25–40 meV at\nK. At temperatures higher than 200 K the lasing spectra\nbecame much narrower (FWHM of the lasing spectrum at\nK was about 2 meV), due to enhanced carrier transfer be-\ntween QDs and a transition toward an equilibrium carrier dis-\ntribution between the dots. This process leads to more efficient\npopulation of dots of lower energy and to a narrowing of the gain\nspectrum. This is a reason for the decreasing threshold current\nwith increasing temperature in these lasers, which will be dis-\ncussed below.\nTo explain the origin of the high-energy band of the spon-\ntaneous emission spectra at low temperature, we considered\ntheir variation both with temperature and injected current. We\nobserved several emission peaks in the spontaneous emission\nspectra of the different 1.3- m QD lasers. Their positions at\nK were about 1.06, 1.09, and 1.17 eV. We attribute the\ntwo low-energy emission peaks to transitions via ground state\nof two ensembles of the dots with different size. It was shown\nthat the energy separation between the ground state emission of\ndeveloped QDs and small QDs in InAs DWELL structures with\n2.0–2.5 ML of InAs can be as big as the difference between\nthe ground and first excited state [15]. Taking into account\nthat all these bands were observable at very low current at low\ntemperature, we think that the recombination via ground state\nof small QDs and transitions via excited state of developed QDs\nformed the high-energy band at low temperature. This band,\nwhich was observable at low temperature K, almost\nvanished in the temperature range from 120 to 220 K (see\nFig. 2). With increasing temperature the coupling between QDs\nimproves significantly and carriers recombine in the bigger\ndots with lower energy states. This leads to the narrowing of the\nspontaneous emission spectra and to a decrease of the emission\nbands from the smaller QDs. At the same time, emission from\nthe excited state increases with increasing temperature and\nbecomes very significant at threshold current. Nevertheless,\ntransitions from the smaller QDs also make some contribution\nto the spontaneous emission spectra, especially under high\ninjected current when lower energy states are filled. This\ncontribution from the smaller dots makes the high-energy\nband of the spontaneous emission at K appear more\ntemperature insensitive than the ground state.\nThe temperature dependence of the spontaneous emission\npeak energy is shown in Fig. 2 with a dashed line. The red shift\nof the peak with increasing temperature is faster at K\nthan the temperature bandgap shrinkage in InAs bulk material.\nA similar behavior of the luminescence peak has been dis-\ncussed elsewhere [16], [17]. The temperature enhanced carrier\ntransport in this case allows carriers to move and recombine\nin the QDs with deeper energy states leading to a decreasing\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:24 from IEEE Xplore.  Restrictions apply.\nMARKO et al.: ROLE OF AUGER RECOMBINATION IN InAs 1.3- m QUANTUM-DOT LASERS 1303\nFig. 3. Emission spectra from the window and from the laser facet at different\ncurrents at T = 300 K from the 1.3-\u0016m broad area device, demonstrating that\nthere are no emissions from the QWs and barriers.\nFWHM of the spontaneous emission spectrum from 80 meV at\nK to meV at K.\nInhomogeneous broadening of the spontaneous emission\nspectra in the 980-nm QD lasers was not so strong as for\nthe 1.3- m lasers. The FWHM of the spontaneous emission\nspectra at K at low current was 32 and 36 meV for the\nlasers with one and two QD layers, respectively. The FWHM\nof the lasing spectra at this temperature was about 10 meV\nfor the laser with one QD layer and about 15 meV for the\nlaser with two QD layers. The lasing spectra became narrower\n(we observed multimode spectra of about 2 meV width) with\nincreasing temperature as it was observed for the 1.3- m lasers.\nIt is also important to note that at room temperature no emis-\nsion from the QWs and barriers was observable either from the\nlaser facet or from the window in the broad area devices, as\nshown in Fig. 3. Only a very weak emission was observable in\nthe ridge waveguide laser at 1.27 eV, i.e., the expected region\nfor the In Ga As QW’s emission. This indicates that the\ncarriers (electrons and holes) are mainly localized in the dots\neven at room temperature.\nThreshold current densities , radiative currents , and\nradiative efficiencies , of both QD lasers with one (solid\nsymbols) and two (crossed symbols) layers of QDs, are given\nin Fig. 4(a). To compare the temperature behavior of the\nthreshold current and the radiative current, the radiative current\nwas normalized to the threshold current at low temperature\n( K) where nonradiative recombination was the\nsmallest. Characteristic temperatures , in the temperature\ninterval – K, were as high as K for\nthe laser with a single QD layer ( K nm) and\nK for the laser with two QD layers (\nnm). At the same time, the radiative part of the total current was\nrelatively independent of temperature even at – K,\ndemonstrating that the thermal sensitivity of the lasers is due to\na decreasing radiative efficiency.\nWe observed a very unusual temperature dependence of the\nthreshold current in the broad area 1.3- m QD lasers with\na bump in the temperature interval between 70 and 200 K,\nwhich is shown in Fig. 4(b). The radiative current , and\nthe radiative efficiency (both are measured in arbitrary units)\nFig. 4. Temperature dependencies of the threshold current density J ,\nradiative current I , and radiative efficiency \u0011, for (a) the 980-nm QD lasers\nwith single (SQDs—solid symbols) and double layers of QDs (DQDs—crossed\nsymbols) and (b) for the 1.3-\u0016m broad area QD laser.\nare shown as functions of temperature as well. Regions of\nincreasing threshold current, when the radiative current is al-\nmost constant, clearly correspond to the decreasing efficiency.\nThis means that the temperature dependence of the lasing\nthreshold is determined by a decrease of the efficiency over\nthese temperature intervals. The decrease of the threshold\ncurrent and radiative current at temperatures between 150 and\n200 K is associated with a decrease in the width of the lasing\nspectrum and mostly due to a temperature activated process,\nwhere carriers are able to transfer and recombine via deeper dot\nstates. A negative characteristic temperature in InAs quantum\ndots laser diodes has been observed earlier [18]–[20] and also\nattributed to thermally enhanced carrier transfer between dots.\nTo understand the recombination mechanisms and loss pro-\ncesses in the QD lasers we have investigated their threshold cur-\nrents and lasing wavelengths as a function of hydrostatic pres-\nsure.\nB. Performance of 1.3- m and 980-nm QD Lasers Studied\nUsing Hydrostatic Pressure\nBoth 980-nm and 1.3- m QD structures exhibited sim-\nilar linear shifts of the lasing photon energy with pressure\n. The gradients were meV\/kbar and\nmeV\/kbar for the 980-nm and 1.3- m QD\nlasers, respectively [21]. Fig. 5 shows the variation with applied\nhydrostatic pressure of the threshold current , for the 980-nm\nlaser with one layer of QDs [Fig. 5(a), solid squares] and for\nthe 1.3- m lasers [Fig. 5(b), broad area laser—solid squares\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:24 from IEEE Xplore.  Restrictions apply.\n1304 IEEE JOURNAL OF SELECTED TOPICS IN QUANTUM ELECTRONICS, VOL. 9, NO. 5, SEPTEMBER\/OCTOBER 2003\nFig. 5. Normalized threshold current I (p)=I (0) and normalized square\nof the lasing photon energy [E (p)=E (0)] versus pressure at room\ntemperature (a) for the 980-nm QD laser with one layer of QDs and (b) for the\n1.3-\u0016m broad area and ridge waveguide lasers. Dashed lines present fit of the\nexperimental points using (2) to estimate contribution of radiative and Auger\nrecombination processes.\nand ridge laser—crossed squares]. The normalized square of\nthe lasing photon energy as a function of\npressure is also given in Fig. 5 for each type of laser. For the\n980-nm QD lasers, increases with pressure proportionally\nto the square of the photon energy as expected from a simple\nanalytical model of a QD laser with only radiative recombi-\nnation (see Section IV). However, as shown in Fig. 5(b), the\nthreshold current of the 1.3- m broad area QD laser decreases\nby 26% over 12 kbar. This may be compared with the results\nfor 1.3- m GaInAsP quantum-well lasers where the threshold\ncurrent decreases by about 10% in the same pressure interval\ndue to a strong Auger recombination contribution of about 50%\nto the total threshold current [10].\nIV. DISCUSSION AND THEORY\nThe magnitude of the threshold current density, and its\nvariation with temperature in the range around room tempera-\nture is of particular practical importance and it is our main con-\ncern here. From Fig. 4, where we see that the radiative compo-\nnent of the threshold current is much less temperature sen-\nsitive than , it is clear that there must be at least one tempera-\nture-sensitive nonradiative loss process. This is also reflected in\nthe decreasing radiative efficiency , with increasing tempera-\nture, that mirrors the increase in . Furthermore, from Figs. 4\nand 5, it is clear that in the 1.3- m devices there is a compo-\nnent of the nonradiative loss processes that makes them even\nmore temperature sensitive and that this component decreases\nstrongly with increasing hydrostatic pressure. The mechanisms\nwe have considered are: 1) electron leakage via the AlGaAs\ncladding layers; 2) intervalence band absorption; 3) thermal ex-\ncitation from the dots and subsequent nonradiative recombina-\ntion, probably via defects; and 4) Auger recombination.\nAlthough leakage into the AlGaAs cladding layers, as in 1),\ncan be a major problem in short wavelength devices, it is un-\nlikely to be a problem in these longer wavelength devices where\nthe band-gap difference presents a very large energy barrier.\nAlso, such leakage would be larger in the 980-nm devices than\nin the 1.3- m lasers and it is a loss mechanism that increases\nwith increasing pressure [22].\nIntervalence band absorption (IVBA) at first appears a likely\ncandidate because it will be stronger in GaAs-based devices\nthan in InP based devices because of the larger spin-orbit split-\nting. Furthermore, it will be larger in the 1.3- m lasers than the\n980-nm lasers and will also decrease strongly with increasing\npressure. However, IVBA affects by reabsorbing the laser\nlight as it travels down the laser cavity and it will have a negli-\ngible effect on the light observed from the window in the elec-\ntrode on the n-type substrate. Therefore, although it should not\nbe completely ignored, IVBA cannot explain the large decrease\nin which is clearly the main cause for the increase in .\nThermal excitation from the dots with subsequent nonradia-\ntive recombination, as in 3), has been proposed as the major\ncause of the low observed on quantum dot lasers and quali-\ntatively it could explain the increase in and the decrease in\nobserved with increasing temperature. The question then arises\nwhether it can also explain the decrease in observed with\nincreasing pressure in the 1.3- m lasers?\nTo analyze the observed experimental results we have devel-\noped a theoretical model based on electronic structure calcula-\ntions of InAs QDs of pyramidal shape. For calculations of the\nelectron and hole energy spectra and wave functions we used a\nplane wave expansion method [23], [24]. The three-dimensional\n(3-D) distributions of the elastic strain and piezoelectric fields in\nthe structure with pyramidal QDs are taken into account using\nthe Green’s function method and Fourier transform technique\n[24], [25]. We assumed that the QD shape is a truncated squared\npyramid. The calculations are based on an 8 8 k p Hamil-\ntonian which incorporates 3-D strain, band mixing, and band\nanisotropy. The structure parameters and Hamiltonian used are\nthe same as in [26]. Our theoretical analysis includes several\nsteps: 1) calculations of the QD electronic structures and optical\nmatrix elements at various pressures; 2) calculation of laser gain\nand radiative recombination and analysis of their pressure de-\npendencies; and 3) estimation of the Auger recombination vari-\nation with pressure.\nAs a first step, we calculated the variation of the QD elec-\ntronic structure with applied hydrostatic pressure. This includes\ncalculations of the electron and hole energy levels and optical\ntransition matrix elements. Fig. 6 shows the calculated depen-\ndence on pressure of: 1) the electron and hole energy levels\nfor the ground state in the InAs QDs and for the two-dimen-\nsional (2-D) states in the 2-D system consisting of the InGaAs\nquantum-well and the InAs wetting layer and 2) the optical ma-\ntrix element for the electron-hole transition between QD ground\nstates. Several important conclusions follow from Fig. 6. Firstly,\nthe energy separation between the ground state in the QD and\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:24 from IEEE Xplore.  Restrictions apply.\nMARKO et al.: ROLE OF AUGER RECOMBINATION IN InAs 1.3- m QUANTUM-DOT LASERS 1305\nFig. 6. Calculated varition with pressure of (a) QD ground state energy\nstates and edges of the contiuum states for electrons and holes and (b)\nsquared module of the optical matrix element summed over degenerate spin\nstates, in units of P (where P is the interband momentum matrix element,\nP = (\u0016h=m )hsjp jxi).\nthe edge of continuum states in the 2-D system (i.e., the ef-\nfective barrier heights) for electrons and holes are nearly inde-\npendent of pressure. From Fig. 6, we also found that the lasing\nphoton energy increases with pressure linearly with\nmeV\/kbar, which is in very good agreement with our ex-\nperimental value of 8.3 meV\/kbar. Secondly, we found that the\nsquare of the optical matrix elements for the ground and sev-\neral excited transitions do not change significantly (the relative\nchange is less than 1%). This is not surprising since hydrostatic\npressure mainly changes only the bandgap, while the band off-\nsets and strain induced spatial variation of the band edges in\nthe structure remains nearly the same. Indeed, this is the reason\nwhy hydrostatic pressure is a very convenient and powerful tool\nto study the nature of carrier recombination in laser structures.\nTherefore, it can be concluded also that the effect of pressure\non the laser performance is mainly due to the variation of the\nbandgap, i.e., photon lasing energy. Certainly, from Fig. 6 we\nwould not expect sufficient increase with pressure in the binding\nenergy of carriers in the 1.3- m quantum dots to explain the ob-\nserved strong decrease in . However, thermal excitation from\nthe dots and subsequent nonradiative recombination may well\nexplain why is more temperature sensitive than in the\n980-nm dots and it is interesting to estimate the magnitude of\nthis effect. If we assume that only radiative recombination and\nthermal excitation are responsible for the threshold current in\nthe 980-nm dots and also that thermal excitation from the dots\nwill be negligible at temperatures below 100 K, then we can\nnormalize to in this temperature range (see Fig. 4) and\nso determine an absolute value for up to room tempera-\nture. This shows that at 300 K, the contributions to for the\nradiative and thermal-escape currents are 60% and 40%, respec-\ntively (we took into account here the error of due to absorp-\ntion of spontaneous emission in the substrate). The fact that\nincreases with pressure in the 980-nm devices even with 40%\nthermal leakage supports our theoretical model for the pressure\nvariation of the levels in the 1.3 m dots where the confining\nstructures are not very different. It is also important to note that\ndecreases much more quickly with increasing temperature in\nthe 1.3- m lasers than in the 980-nm devices, which is contrary\nto what one would expect if the confining energy were small and\nthermal loss large in the 1.3- m lasers. These arguments lead\nus finally to the conclusion that it is Auger recombination that\nis likely to be the mechanism that is responsible for the much\nlower in 1.3- m than 980-nm devices and we now consider\nits magnitude.\nAuger recombination 4) is a very complex process and de-\ntailed discussion must be left to a further publication. However,\nprevious work has shown that it is an important mechanism in\n1.3- m quantum well lasers and explains the dependence of\ntheir on temperature and pressure.\nBelow, we show that in QDs the radiative current and the\nAuger current depend in opposite ways on the photon lasing en-\nergy : the radiative current increases with , while the\nAuger current decreases with . Therefore, by analyzing the\ndependence of the laser threshold current on hydrostatic pres-\nsure, we can estimate the fractions of the radiative and Auger\ncurrents in the total threshold current. The same approach was\nshown to be very powerful for QW lasers [27].\nThe second step of our calculations was to calculate the gain\nand the threshold carrier density as a function of pressure. The\ngain was calculated using the following expression:\n(1)\nwhere is the refractive index of the QD material, is the elec-\ntron charge, is the velocity of light in vacuum, is the light\nfrequency, is the 2-D in-plane density of QDs, is the total\nwidth of the active region, is the optical matrix element for\nthe transition with energy between the electron level and\nhole level , over which the summation is taken, and are\nthe distribution functions, is the line-shape function, and the\nbrackets in (1) mean the averaging over the size distribution over\nQDs.\nLet us now analyze the pressure dependence of the gain. Since\nthe optical matrix element is nearly constant with pres-\nsure, then at a fixed carrier density , the peak gain depends\non pressure through the change in . From (1), it then fol-\nlows that the peak gain is inversely proportional to the energy\n, i.e., the gain decreases with pressure at fixed\ncarrier density . It should be noted that we consider here only\nthe case of room temperature and assume that the carriers in\nQDs are in equilibrium and, therefore, can be described by a\nFermi–Dirac distribution.\nTo calculate the threshold carrier density at a given pres-\nsure (i.e., given ) we must solve the threshold condition,\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:24 from IEEE Xplore.  Restrictions apply.\n1306 IEEE JOURNAL OF SELECTED TOPICS IN QUANTUM ELECTRONICS, VOL. 9, NO. 5, SEPTEMBER\/OCTOBER 2003\n, where are the total in-\nternal losses and are the mirror losses. In the general case,\nthe calculated dependence of on pressure is quite sensitive\nto the variation of the internal losses with , because the in-\nternal losses usually decrease with increasing (since they\nare mainly caused by the intervalence band absorption in var-\nious areas). In our analysis here, it is, however, not so important\nsince the total internal losses appear to be quite low at room\ntemperature [13]. Therefore, even if the internal losses vanish at\nhigh pressure, we still find increases as function of pressure\n(or ), because the peak gain is decreasing as . In\nsummary, we found that the threshold carrier density in-\ncreases with pressure.\nThe next step is the calculation of the radiative current\ndependence on pressure. The calculated radiative current\ndensity at zero pressure and 300 K for the 1.3- m devices is\n150 A\/cm , which accounts for only 24% of the total threshold\ncurrent measured. This indicates that an additional recombina-\ntion channel indeed exists in these devices.\nLet us now analyze the pressure dependence of the radiative\ncurrent at threshold, . This dependence is determined by\ntwo factors: 1) pressure dependence of the radiative recombina-\ntion coefficient (i.e., the radiative recombination rate at fixed\ncarrier density) and 2) pressure dependence of the threshold\ncarrier density . We note that in quantum wells it is com-\nmonly assumed that ; however, in QDs we have\n, where [28]. The radiative re-\ncombination coefficient is proportional to the lasing energy\n(see [29, (5b)]), , because the optical matrix is nearly\nindependent of pressure as discussed above. As we discussed\nabove, increases with pressure. Since ,\nwe, therefore, conclude that the radiative current increases\nwith pressure even faster than because the threshold carrier\ndensity increases with pressure as well. The calculated variation\nof depends on the QD shape, composition distribution,\nand other structure parameters, which are either unknown (for\nexample we do not know the spatial variation of the In composi-\ntion around the QD) or are known with quite big uncertainty (for\nexample it is difficult to measure or calculate the dependence\nof the internal losses with pressure). Nevertheless, we can def-\ninitely say that in the studied QD structure increases with\n(or pressure) as , where (because\nincreases with pressure). This conclusion is supported by the\nobserved variation for the 980-nm devices, where was\nobserved.\nWe will now consider why the rates of Auger processes de-\ncrease quickly with with increasing pressure. A detailed\ncalculation of the Auger rate in QDs is a subject of our future\nresearch, only qualitative analysis is presented here.\nThe Auger recombination coefficient (i.e., the Auger rate\nat fixed carrier density) is determined by the square module of\nthe Coulomb matrix element . In its turn,\nis proportional to the product of two overlap integrals\nand . The first overlap integral is\nbetween the electron and hole states localized in the QDs. The\nsecond overlap integral is between the carrier (electron or\nhole—depending on the type of the Auger process) localized in\nthe QD and a highly excited carrier in the continuum spectrum.\nThe electron states in the QD are mostly -type (conduction\nband related Bloch functions), while the hole states are mainly\np-type (valence band related Bloch functions). Therefore, the\noverlap integral is determined by the admixture of the p-type\nBloch components to the electron states in the QD or by the ad-\nmixture of the s-type Bloch components to the hole states in\nthe QD (the latter was found to be several times less effective).\nThe degree of this admixture decreases with pressure and it is\napproximately proportional to , where is the\nelectron level in QD measured from the unstrained conduction\nband edge of InAs. So, we can conclude that decreases with\nas . In fact, numerical calculations show that\ndecreases even faster. The overlap integral is between\nthe state in the QD and highly excited state in the continuum.\nThe wavefunction of the state localized in the QD varies rela-\ntively “smoothly” (with the characteristic size of such variation\nof order of the QD dimension), but the wave function of highly\nexcited states is a quickly oscillating function of the spatial coor-\ndinates. Therefore, the overlap between these two states is also\nsmall and it decreases with as or faster. Thus,\nwe find that the square of the Coulomb matrix element decreases\nwith as or faster. According to our numerical anal-\nysis the Auger coefficient decreases with as ,\nwhere is between 3 and 8; the value of depends on the QD\nshape, size, and composition.\nThe final step of our calculations is a rough estimation of the\nAuger current contribution to the total threshold current. For\nthis purpose, we assume that the laser threshold current con-\nsists of only radiative and Auger recombination terms,\n, where is proporational to , the Auger con-\ntribution varies as . We finally assume\nthat is the fraction that radiative recombina-\ntion contributes to at zero pressure. For the threshold current\nvariation with pressure we then find that [21]\n(2)\nwhere is the relative variation of the\nlasing photon energy with pressure, which is measured to be\naround 1.1 at 12 kbar. We then use (2) to fit the experimentally\nmeasured variation of with pressure, and the result is shown\nin Fig. 5. We found the fraction of the radiative current is 30%\nand 40% for the broad area and ridge 1.3- m devices, respec-\ntively [see Fig. 5(b)]. This simple model ignores thermal escape\ncurrent and gives the fraction of the radiative current of 100% for\nthe 980-nm device [see Fig. 5(a)]. These values were obtained\nassuming that and as in QW lasers [30]. It is\ninteresting to note that these estimations agree very well with\nthe value of the directly calculated radiative current of 24% of\nfor the 1.3- m broad area laser. If, as discussed above, we\nuse other values of between 1 and 3 and between 3 and 8,\nthen we always get that the fraction of the Auger contribution\nto the total threshold current is greater than 58%. Thus, from\nanalysis of the high-pressure measurements we believe that the\nAuger process dominates over radiative recombination at room\ntemperature in the 1.3 m devices studied. In contrast, in the\n980-nm lasers radiative recombination dominates and the Auger\ncurrent is negligible.\nV. CONCLUSION\nIn conclusion, we have shown that while the radiative current\nin both our 1.3- m and 980-nm wavelength quantum dot lasers\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:24 from IEEE Xplore.  Restrictions apply.\nMARKO et al.: ROLE OF AUGER RECOMBINATION IN InAs 1.3- m QUANTUM-DOT LASERS 1307\nis indeed relatively temperature insensitive, the total threshold\ncurrent includes significant temperature dependent nonradiative\nrecombination. Furthermore, in order to explain both the tem-\nperature and pressure dependences of the longer wavelength de-\nvices it is necessary to include Auger recombination just as in\nbulk and quantum well devices operating at 1.3 m. This im-\nplies that, even if perfectly uniform arrays of quantum dots can\nbe produced, QD lasers will remain temperature sensitive unless\nthe Auger processes can be eliminated.\nACKNOWLEDGMENT\nThe authors gratefully acknowledge Dr. S. Sweeney for\nhelpful discussions and EPSRC for financial support.\nREFERENCES\n[1] Y. Arakawa and H. Sakaki, “Multidimensional quantum well laser and\ntemperature dependence of its threshold current,” Appl. Phys. Lett., vol.\n40, no. 11, pp. 939–941, 1982.\n[2] M. Asada, Y. Miyamoto, and Y. Suematsu, “Gain and threshold of three\ndimensional quantum box laser,” IEEE J. Quantum Electron., vol. 22,\npp. 1915–1921, Sept. 1986.\n[3] K. Mukai, Y. Nakata, K. Otsubo, M. Sugawara, N. Yokoyama, and\nH. Ishikawa, “1.3 \u0016m CW lasing characteristics of self-assembled\nInGaAs-GaAs quantum dots,” IEEE J. Quantum Electron., vol. 36, pp.\n472–478, Apr. 2000.\n[4] V. M. Ustinov and A. E. Zhukov, “Topical review: GaAs-based\nlong-wavelength lasers,” Semicond. Sci. Technol., vol. 15, pp.\nR41–R54, 2000.\n[5] A. R. Kovsh, A. E. Zhukov, N. A. Maleev, S. S. Mikhrin, V. M. Ustinov,\nA. F. Tsatsul’nikov, M. V. Maksimov, B. V. Volovik, D. A. Bedarev, Yu.\nM. Shernyakov, E. Yu. Kondrat’eva, N. N. Ledentsov, P. S. Kop’ev, Zh.\nI. Alferov, and D. Bimberg, “Lasing at a wavelength close to 1.3 \u0016m in\nInAs quantum-dot structures,” Semicond., vol. 33, no. 8, pp. 929–932,\n1999.\n[6] L. V. Asryan and R. A. Suris, “Temperature dependence of the threshold\ncurrent density of a quantum dot laser,” IEEE J. Quantum Electron., vol.\n34, pp. 841–850, May 1998.\n[7] M. Grundmann, O. Stier, S. Bognar, C. Ribbat, F. Heinrichsdorff, and D.\nBimberg, “Optical properties of self-organized quantum dots: Modeling\nand experiments,” Phys. Stat. Sol. (a), vol. 178, pp. 255–262, 2000.\n[8] O. B. Shchekin, G. Park, D. L. Huffaker, and D. G. Deppe, “Discrete\nenergy level separation and the threshold temperature dependence of\nquantum dot lasers,” Appl. Phys. Lett., vol. 77, pp. 466–468, 2000.\n[9] O. B. Shchekin and D. G. Deppe, “Low-threshold high-T 1.3-\u0016m InAs\nquantum dot lasers due to p-type modulation doping of the active re-\ngion,” IEEE Photon. Technol. Lett., vol. 14, pp. 1231–1233, Sept. 2002.\n[10] T. Higashi, S. J. Sweeney, A. F. Phillips, A. R. Adams, E. P. O’Reilly, T.\nUchida, and T. Fujii, “Experimental analysis of temperature dependence\nin 1.3-m AlGaInAs-InP strained MQW lasers,” IEEE J. Select. Topics\nQuantum Electron., vol. 5, pp. 413–419, Mar. 1999.\n[11] S. J. Sweeney, T. Higashi, A. Andreev, A. R. Adams, T. Uchida, and T.\nFujii, “Superior temperature performance of 1.3 \u0016m AlGaInAs-based\nsemiconductor lasers investigated at high pressure and low temperature,”\nPhys. Stat. Sol. (b), vol. 223, no. 2, pp. 573–578, 2001.\n[12] F. Schäfer, B. Mayer, J. P. Reithmaier, and A. Forchel, “High-tempera-\nture properties of GaInAs\/AlGaAs lasers with improved carrier confine-\nment by short-period superlattice quantum well barriers,” Appl. Phys.\nLett., vol. 73, no. 20, pp. 2863–2865, 1998.\n[13] R. Krebs, F. Klopf, J. P. Reithmaier, and A. Forchel, “High performance\n1.3\u0016m quantum-dot lasers,” Jpn. J. Appl. Phys., vol. 41, pp. 1158–1161,\n2002.\n[14] A. F. Phillips, S. J. Sweeney, A. R. Adams, and P. J. A. Thijs, “The tem-\nperature dependence 1.3- and 1.5 \u0016m compressively strained InGaAs(P)\nMQW semiconductor lasers,” IEEE J. Select. Topics Quantum Electron.,\nvol. 5, pp. 401–412, Mar. 1999.\n[15] M. V. Maximov, A. F. Tsatsul’nikov, B. V. Volovik, D. A. Bedarev, Yu.\nM. Shernyakov, I. N. Kaiander, E. Yu. Kondrat’eva, A. E. Zhukov, A. R.\nKovsh, N. A. Maleev, S. S. Mikhrin, V. M. Ustinov, Yu. G. Musikhin,\nP. S. Kop’ev, Zh. I. Alferov, R. Heitz, N. N. Ledentsov, and D. Bim-\nberg, “Optical properties of quantum dots formed by activated spinodal\ndecomposition for GaAs-based lasers emitting at\u00181:3\u0016m,” Microelec-\ntronic Eng., vol. 51–52, pp. 61–72, 2000.\n[16] L. Brusaferri, S. Sanguinetti, E. Grilli, M. Guzzi, A. Bignazzi, F. Bo-\ngani, L. Carraresi, M. Colocci, A. Bosacchi, P. Frigeri, and S. Franchi,\n“Thermally activated carrier transfer and luminescence line shape in\nself-organized InAs quantum dots,” Appl. Phys. Lett., vol. 69, no. 22,\npp. 3354–3356, 1996.\n[17] S. Sanguinetti, M. Henini, M. G. Alessi, M. Capizzi, P. Frigeri, and\nS. Franchi, “Carrier thermal escape and retrapping in self-assembled\nquantum dots,” Phys. Rev. B, vol. 60, no. 11, pp. 8276–8283, 1999.\n[18] A. E. Zhukov, V. M. Ustinov, A. Yu. Egorov, A. R. Kovsh, A. F.\nTsatsulnikov, N. N. Ledentsov, S. V. Zaitsev, N. Yu. Gordeev, P. S.\nKop’ev, and Zh. I. Alferov, “Negative characteristic temperature of\nInGaAs quantum dot injection laser,” Jpn. J. Appl. Phys., pt. 1, vol. 36,\nno. 6B, pp. 4216–4218, 1997.\n[19] A. Patane, A. Polimeni, M. Henini, L. Eaves, P. C. Main, and G. Hill,\n“In Ga As quantum dot lasers grown on (100) and (311)B GaAs\nsubstrates,” Cryst. Growth, vol. 201–202, pp. 1139–1142, 1999.\n[20] M. Grundmann, O. Stier, S. Bognar, C. Ribbat, F. Heinrichsdorff, and D.\nBimberg, “Optical properties of self-organized quantum dots: Modeling\nand experiments,” Phys. Stat. Sol. (a), vol. 178, pp. 255–262, 2000.\n[21] I. P. Marko, A. D. Andreev, A. R. Adams, R. Krebs, J. P. Reithmaier,\nand A. Forchel, “High-pressure studies of the recombination processes,\nthreshold currents and lasing wavelength in InAs\/GaInAs quantum dot\nlasers,” Phys. Stat. Sol. (b), vol. 235, no. 2, pp. 407–411, 2003.\n[22] P. Blood, E. D. Fletcher, K. Woodbridge, K. C. Heasman, and A. R.\nAdams, “Influence of the barriers on the temperature dependence of\nthe threshold current in GaAs\/AlGaAs quantum well lasers,” IEEE J.\nQuantum Electron., vol. 25, p. 1459, 1989.\n[23] A. D. Andreev, “Modeling of gain for lasers based on CdSe planar\nQD-system in ZnMgSSe matrix,” in In-Plane Semiconductor Lasers:\nFrom Ultraviolet to Mid-Infrared, Proc. SPIE, H. K. Choi and P. S.\nZory, Eds., 1998, vol. 3284, pp. 151–161.\n[24] A. D. Andreev and E. P. O’Reilly, “Theory of the electronic structure\nof GaN\/AlN hexagonal quantum dots,” Phys. Rev. B, vol. 62, pp.\n15 851–15 870, 2000.\n[25] A. D. Andreev, J. R. Downes, D. A. Faux, and E. P. O’Reilly, “Strain\ndistributions in quantum dots of arbitrary shape,” J. Appl. Phys., vol. 84,\nno. 1, pp. 297–305, 1999.\n[26] O. Stier, M. Grundmann, and D. Bimberg, “Electronic and optical prop-\nerties of strained quantum dots modeled by 8-band kp theory,” Phys.\nRev. B, vol. 59, pp. 5688–5701, 1999.\n[27] S. J. Sweeney, T. Higashi, A. R. Adams, T. Uchida, and T. Fujii,\n“Improved temperature dependence of 1.3 \u0016m AlGaInAs-based MQW\nsemiconductor diode lasers revealed by hydrostatic pressure,” Electron.\nLett., vol. 34, no. 22, pp. 1231–1233, 1998.\n[28] A. Andreev, “Radiative recombination dependence on carrier density in\nQDs,” in A One Day Meeting “Growth, Characterization, and Physics of\nSemiconductor Quantum Dots”. Sheffield, U.K.: Univ. Sheffield, Jan.\n22, 2003.\n[29] L. V. Asryan and R. A. Suris, “Inhomogeneous line broadening and the\nthreshold current density of a semiconductor quantum dot laser,” Semi-\ncond. Sci. Technol., vol. 11, pp. 554–567, 1996.\n[30] G. G. Zegrya, A. D. Andreev, N. A. Gun’ko, and E. V. Frolushkina, “Cal-\nculation of QW-laser threshold currents in terms of new channels of\nnonradiative Auger recombination,” in Physics and Simulation of Op-\ntoelectronic Devices III, Proc. SPIE, M. Osinski and W. W. Chow, Eds.,\n1995, vol. 2399, pp. 307–316.\nI. P. Marko, photograph and biography not available at time of publication.\nA. D. Andreev, photograph and biography not available at time of publication.\nA. R. Adams, photograph and biography not available at time of publication.\nR. Krebs, photograph and biography not available at time of publication.\nJ. P. Reithmaier, photograph and biography not available at time of publication.\nA. Forchel, photograph and biography not available at time of publication.\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:24 from IEEE Xplore.  Restrictions apply.\n"}