{"doi":"10.1080\/10407790590963604","coreId":"137279","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/939","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/939","10.1080\/10407790590963604"],"title":"A Study of LES Stress and Flux Models Applied to a Buoyant Jet.","authors":["Worthy, Jude","Rubini, Philip A."],"enrichments":{"references":[{"id":38104374,"title":"A dynamic localization model for largeeddy simulation of turbulent flows,","authors":[],"date":"1995","doi":"10.1017\/s0022112095000711","raw":"Ghosal, S., Lund, T. S., Moin, P., and Akselvoll, K., A dynamic localization model for largeeddy simulation of turbulent flows, J. Fluid Mech., 286, p229, 1995.   25","cites":null},{"id":38104371,"title":"A dynamic mixed subgrid-scale model and its application to turbulent recirculating flows,","authors":[],"date":"1993","doi":"10.1063\/1.858675","raw":"Zang, Y., Street, R. L., and Koseff, J. R., A dynamic mixed subgrid-scale model and its application to turbulent recirculating flows, Phys. Fluids A, 5(12), p3186, 1993.","cites":null},{"id":38104366,"title":"A dynamic subgrid-scale eddy viscosity model,","authors":[],"date":"1991","doi":"10.1063\/1.858221","raw":"Germano, M., Piomelli, U., Moin, P., and Cabot, W. H., A dynamic subgrid-scale eddy viscosity model, Phys. Fluids A, 3(7), p1760, 1991.","cites":null},{"id":38104375,"title":"A New Dynamic One Equation Subgrid Model for Large Eddy Simulations,","authors":[],"date":null,"doi":"10.2514\/6.1995-356","raw":"Kim,W.-W., and Menon, S., A New Dynamic One Equation Subgrid Model for Large Eddy Simulations, 33 rd Aerospace Sciences Meeting, AIAA Paper No. 95-0379, Reno, NV, Jan 9-12,","cites":null},{"id":38104358,"title":"A proposed modification of the Germano subgrid-scale closure method,","authors":[],"date":"1992","doi":"10.1063\/1.858280","raw":"Lilly, D. K., A proposed modification of the Germano subgrid-scale closure method, Phys. Fluids A, 4(3), p633, 1992.","cites":null},{"id":38104373,"title":"A proposed statistical-dynamic closure method for the linear or nonlinear subgrid-scale stresses,","authors":[],"date":"1992","doi":"10.1063\/1.858261","raw":"Wong, V. C., A proposed statistical-dynamic closure method for the linear or nonlinear subgrid-scale stresses, Phys. Fluids A, 4(5), 1992.","cites":null},{"id":38104378,"title":"A Semi-Implicit Numerical Scheme for Reacting Flow.","authors":[],"date":"1998","doi":"10.1006\/jcph.1997.5856","raw":"Najm, H.N., Wyckoff, P.S., and Knio, O..M., A Semi-Implicit Numerical Scheme for Reacting Flow. I. Stiff Chemistry, J. Comp. Phys., 143(2), p381, 1998.","cites":null},{"id":38104362,"title":"Coherent Structure of the Convective Boundary Layer Derived from Large-Eddy Simulations,","authors":[],"date":"1989","doi":"10.1017\/s0022112089000753","raw":"Schmidt H., and Schumann, U., Coherent Structure of the Convective Boundary Layer Derived from Large-Eddy Simulations, J. Fl. Mech., 200, p511, 1989.","cites":null},{"id":38104364,"title":"Comparison of Modified k-ε Turbulence Models for Buoyant Plumes,","authors":[],"date":"2001","doi":"10.1080\/10407790150503486","raw":"Worthy, J., Sanderson, V., and Rubini, P. A., Comparison of Modified k-ε Turbulence Models for Buoyant Plumes, Num. Heat Transfer, Part B, 39, p151, 2001.","cites":null},{"id":38104347,"title":"Direct and large-eddy simulation of the transition of two- and three-dimensional plumes in a confined enclosure,","authors":[],"date":"2000","doi":"10.1016\/s0017-9310(99)00302-6","raw":"Bastiaans, R., J. M., Rindt, C. C. M., Nieuwstadtadt, F. T. M. and van Steenhoven, A. A., Direct and large-eddy simulation of the transition of two- and three-dimensional plumes in a confined enclosure, I. J. Heat Mass Trans., 43, p2375, 2000.","cites":null},{"id":38104354,"title":"Energy cascade in large-eddy simulations of turbulent flows,","authors":[],"date":"1974","doi":"10.1016\/s0065-2687(08)60464-1","raw":"Leonard, A., Energy cascade in large-eddy simulations of turbulent flows, Adv. Geophys., 18, p237, 1974.","cites":null},{"id":38104348,"title":"Experimental analysis of a confined transittional plume with respect to subgrid-scale modelling,","authors":[],"date":"1998","doi":"10.1016\/s0017-9310(98)00075-1","raw":"Bastiaans, R., J. M., Rindt, C. C. M. and van Steenhoven, A. A., Experimental analysis of a confined transittional plume with respect to subgrid-scale modelling, Int.. J. Heat & Mass Transfer, 41, p3989, 1998.","cites":null},{"id":38104376,"title":"Experiments on a round turbulent buoyant plume,","authors":[],"date":"1994","doi":"10.1017\/s0022112094002260","raw":"Shabbir, A. and George, W. K., Experiments on a round turbulent buoyant plume, J. Fluid. Mech., 275, p1, 1994.","cites":null},{"id":38104345,"title":"General circulation experiments with the primitive equations,","authors":[],"date":"1963","doi":"10.1175\/1520-0493(1963)091<0099:gcewtp>2.3.co;2","raw":"Smagorinsky, J., General circulation experiments with the primitive equations, Mon. Weather Rev., 91, p99, 1963.","cites":null},{"id":38104365,"title":"Improved subgrid scale models for large eddy simulations,","authors":[],"date":null,"doi":"10.2514\/6.1980-1357","raw":"Bardina, J., Ferziger, J. H., and Reynolds, W. C., Improved subgrid scale models for large eddy simulations, AIAA paper No. 80-1357.","cites":null},{"id":38104377,"title":"Incompressible Fluid Dynamics: Some Fundamental Formulation Issues,","authors":[],"date":"1991","doi":"10.1146\/annurev.fluid.23.1.413","raw":"Gresho, P. M., Incompressible Fluid Dynamics: Some Fundamental Formulation Issues, Ann. Rev. Fluid Mech., 23, p413, 1991.","cites":null},{"id":38104357,"title":"Large Eddy Simulation for Incompressible Flows: An Introduction,","authors":[],"date":"2000","doi":"10.1007\/978-3-662-04695-1_1","raw":"Sagaut, P., Large Eddy Simulation for Incompressible Flows: An Introduction, SpringerVerlag, Berlin, 2000.","cites":null},{"id":38104349,"title":"Large eddy simulation of a forced round turbulent buoyant plume in neutral surroundings, Annual Research Briefs, Centre for Turbulence Research, NASA Ames\/Stanford Univ.,","authors":[],"date":"1999","doi":null,"raw":"Basu, A. J. and Mansour, N. N., Large eddy simulation of a forced round turbulent buoyant plume in neutral surroundings, Annual Research Briefs, Centre for Turbulence Research, NASA Ames\/Stanford Univ., 1999.","cites":null},{"id":38104380,"title":"Large Eddy Simulation of Buoyant Plumes, PhD Thesis,","authors":[],"date":null,"doi":null,"raw":"Worthy, J., Large Eddy Simulation of Buoyant Plumes, PhD Thesis, Cranfield University,","cites":null},{"id":38104384,"title":"Large Eddy Simulation of the Flow in a Transpired Channel,","authors":[],"date":"1989","doi":"10.2514\/6.1989-375","raw":"Piomelli, U., Moin, P., and Ferziger, J., Large Eddy Simulation of the Flow in a Transpired Channel, AIAA Report 89-0375, 1989.","cites":null},{"id":38104368,"title":"Large Eddy Simulation: A Dynamic One-Equation Subgrid Model for ThreeDimensional Recirculating Flow,","authors":[],"date":null,"doi":"10.1007\/978-94-015-9285-7_6","raw":"Davidson, Lars, Large Eddy Simulation: A Dynamic One-Equation Subgrid Model for ThreeDimensional Recirculating Flow, 11 th Int. Symp. on Turb. Shear Flow, Vol. 3, p26.1, Grenoble,","cites":null},{"id":38104355,"title":"Large Eddy Simulation: Achievements and Challenges,","authors":[],"date":"1999","doi":"10.1016\/s0376-0421(98)00014-1","raw":"Piomelli, U., Large Eddy Simulation: Achievements and Challenges, Progress in Aerospace Sciences, 35, p335, 1999.","cites":null},{"id":38104370,"title":"Large eddy simulations of flow in a square duct,","authors":[],"date":"1992","doi":null,"raw":"Balaras, E., and Benocci, C., Large eddy simulations of flow in a square duct, Proc. Of the thirteenth symposium on turbulence, Univ. of Missouri Rolla, 1992.","cites":null},{"id":38104379,"title":"Large Eddy Simulations of Three-Dimensional Impinging Jets,","authors":[],"date":"1996","doi":"10.1080\/10618569608940766","raw":"Menon, S. and Rizk, M., Large Eddy Simulations of Three-Dimensional Impinging Jets, Int. J. Comp. Fl. Dyn., Vol. 7, p275, 1996.","cites":null},{"id":38104359,"title":"Large-eddy simulation of a turbulent forced plume,","authors":[],"date":"2001","doi":"10.1016\/s0997-7546(00)01117-1","raw":"Zhou, X., Luo, K. H., and Williams, J. J. R., Large-eddy simulation of a turbulent forced plume, Eur. J. Mech. B – Fluids, 20, p233, 2001.","cites":null},{"id":38104367,"title":"Large-eddy simulation of rotating channel flows using a localized dynamic model,","authors":[],"date":"1995","doi":"10.1063\/1.868607","raw":"Piomelli, U., and Liu, J., Large-eddy simulation of rotating channel flows using a localized dynamic model, Phys. Fluids, 7(4) , p839, 1995.","cites":null},{"id":38104361,"title":"New Trends in Large Eddy Simulation,","authors":[],"date":"1996","doi":"10.1146\/annurev.fl.28.010196.000401","raw":"Lesieur, M. and Metais, O., New Trends in Large Eddy Simulation, Ann. Rev. Fluid Mech., 28, p45, 1996.","cites":null},{"id":38104369,"title":"Numerical experiments with highly variable eddy viscosity models,","authors":[],"date":"1993","doi":null,"raw":"Lund, T. S., Ghosal, S., and Moin, P., Numerical experiments with highly variable eddy viscosity models, in Engineering Applications of Large Eddy Simulation, eds. Ragale, S. A., & Piomelli, U., FED Vol. 162, ASME, 1993.","cites":null},{"id":38104351,"title":"On the Filtering of Sound from the Navier-Stokes Equations, Sandia National Labs, Report SAND-82-8257,","authors":[],"date":"1982","doi":null,"raw":"Paulucci, S., On the Filtering of Sound from the Navier-Stokes Equations, Sandia National Labs, Report SAND-82-8257, 1982.   23","cites":null},{"id":38104372,"title":"On the formulation of the dynamic mixed subgridscale model,","authors":[],"date":"1994","doi":"10.1063\/1.868333","raw":"Vreman, B., Guerts, B., and Kuerten, H., On the formulation of the dynamic mixed subgridscale model, Phys. Fluids, 6(12), p4057, 1994.","cites":null},{"id":38104344,"title":"On the numerical simulation of buoyant convection,","authors":[],"date":"1962","doi":"10.1111\/j.2153-3490.1962.tb00128.x","raw":"Lilly, D. K., On the numerical simulation of buoyant convection, Tellus, XIV(2), p144, 1962.","cites":null},{"id":38104383,"title":"On why dynamic subgrid-scale models work,","authors":[],"date":"1995","doi":null,"raw":"Jimenez, J., On why dynamic subgrid-scale models work, Annual Research Briefs, Centre for Turbulence Research, NASA Ames\/Stanford Univ., 1995.","cites":null},{"id":38104382,"title":"Realizability conditions for the turbulent stress tensor in large-eddy simulation,","authors":[],"date":"1994","doi":"10.1017\/s0022112094003745","raw":"Vreman, B., Guerts, B., and Kuerten, H., Realizability conditions for the turbulent stress tensor in large-eddy simulation, J. Fluid Mech., 278, p351, 1994.","cites":null},{"id":38104381,"title":"Realizability of Reynolds-stress turbulence models,","authors":[],"date":null,"doi":"10.1063\/1.861942","raw":"Schumann, U., Realizability of Reynolds-stress turbulence models, Phys. Fluids, 20(5), p721,","cites":null},{"id":38104360,"title":"Spectral large eddy simulations of isotropic and stably-stratified turbulence,","authors":[],"date":"1992","doi":"10.1007\/978-3-642-83822-4_55","raw":"Metais, O. and Lesieur, M., Spectral large eddy simulations of isotropic and stably-stratified turbulence, J. Fluid Mech., 239, p157, 1992.","cites":null},{"id":38104356,"title":"Subgrid-scale model for finite-difference simulations in plane channels and annuli,","authors":[],"date":"1975","doi":"10.1016\/0021-9991(75)90093-5","raw":"Schumann, U., Subgrid-scale model for finite-difference simulations in plane channels and annuli, J. Comp. Phys., 18, p376, 1975.","cites":null},{"id":38104353,"title":"The Equations of Motion for Thermally Driven, Buoyant Flows,","authors":[],"date":"1978","doi":"10.6028\/jres.083.019","raw":"Rehm, R. G. and Baum, H. R., The Equations of Motion for Thermally Driven, Buoyant Flows, J. Res. Nat. Bur. Stand., 83, p297, 1978.","cites":null},{"id":38104350,"title":"Towards LES of jets and plumes,","authors":[],"date":"2000","doi":null,"raw":"Webb, A. T. and Mansour N. N., Towards LES of jets and plumes, Annual Research Briefs, Centre for Turbulence Research, NASA Ames\/Stanford Univ., 2000.","cites":null},{"id":38104363,"title":"Turbulence Modelling of Turbulent Buoyant Jets and Compartment Fires, PhD Thesis,","authors":[],"date":"2001","doi":null,"raw":"Sanderson, V. E., Turbulence Modelling of Turbulent Buoyant Jets and Compartment Fires, PhD Thesis, Cranfield University, 2001.","cites":null},{"id":38104346,"title":"Turbulence: the filtering approach,","authors":[],"date":"1992","doi":"10.1017\/s0022112092001733","raw":"Germano, M., Turbulence: the filtering approach, J. Fluid Mech., 238, p325, 1992.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-09-03","abstract":"Large eddy simulation (LES) stress and scalar flux subgrid scale models are evaluated in the context of buoyant jets. Eddy viscosity, eddy diffusivity (including formulations of the generalized gradient diffusion hypothesis), “structure” (Bardina and Leonard), mixed, and dynamic models are scrutinized. The performance of the models is examined in terms of the main flow variables and also with respect to the “internal” behavior of the models in terms of the relative contributions to the turbulent kinetic energy budget","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/137279.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/1826\/939","pdfHashValue":"491176f7215238eccb52d153fa830032e58a6028","publisher":"Taylor and Francis Ltd","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/939<\/identifier><datestamp>2008-08-11T13:24:47Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>A Study of LES Stress and Flux Models Applied to a Buoyant Jet.<\/dc:title><dc:creator>Worthy, Jude<\/dc:creator><dc:creator>Rubini, Philip A.<\/dc:creator><dc:description>Large eddy simulation (LES) stress and scalar flux subgrid scale models are evaluated in the context of buoyant jets. Eddy viscosity, eddy diffusivity (including formulations of the generalized gradient diffusion hypothesis), “structure” (Bardina and Leonard), mixed, and dynamic models are scrutinized. The performance of the models is examined in terms of the main flow variables and also with respect to the “internal” behavior of the models in terms of the relative contributions to the turbulent kinetic energy budget.<\/dc:description><dc:publisher>Taylor and Francis Ltd<\/dc:publisher><dc:date>2005-11-22T13:33:53Z<\/dc:date><dc:date>2005-11-22T13:33:53Z<\/dc:date><dc:date>2005-09-03<\/dc:date><dc:type>Postprint<\/dc:type><dc:format>1947 bytes<\/dc:format><dc:format>421993 bytes<\/dc:format><dc:format>text\/plain<\/dc:format><dc:format>application\/pdf<\/dc:format><dc:identifier>Jude Worthy and Philip Rubini, A Study of LES Stress and Flux Models Applied to a Buoyant Jet. Numerical Heat Transfer Part B: Fundamentals, Volume 48, Number 3, September 2005, pp. 235-256<\/dc:identifier><dc:identifier>1521-0626<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/939<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1080\/10407790590963604<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1521-0626","1521-0626"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":[],"subject":["Postprint"],"fullText":" 1\nA Study of LES Stress and Flux Models Applied to a Buoyant Jet. \n \nJude Worthy & Philip Rubini \n \nJude Worthy, Department of Aerospace Sciences, Cranfield University, UK, MK43 0AL. \nCurrently at Department of Mathematics, University of North Carolina at Chapel Hill, \nUSA, 27599-3250. \nPhilip Rubini, Department of Aerospace Sciences, Cranfield University, MK43 0AL. \n \nMailing address: \nJude Worthy \nDepartment of Mathematics \nPhilips Hall \nPH320  \nUniversity of North Carolina at Chapel Hill \nChapel Hill, NC, 27599 \n \nRunning Head: LES of Buoyant Jet \n \n \n \n \n 2\nAbstract \nLES stress and scalar flux subgrid scale models are evaluated in the context of buoyant jets. Eddy \nviscosity, eddy diffusivity (including formulations of the generalized gradient diffusion \nhypothesis), ‘structure’ (Bardina and Leonard), mixed and dynamic models are scrutinized. The \nperformance of the models is examined in terms of the main flow variables and also with respect \nto the ‘internal’ behavior of the models in terms of the relative contributions to the turbulent \nkinetic energy budget.  \n \nNomenclature \nB buoyancy term \nDF diffusion term \nDP  dissipation term \nENJ J flux component \ngLUFr \/2=  Froude number \nk turbulent\/ subgrid kinetic energy. \nP turbulent energy production term \nαυ \/Pr =   Prandtl number \njq  subgrid flux \nυ\/Re UL=  Reynolds number \nT temperature \nTIJ  IJ stress component \nu\/v\/w velocities  \nUU\/VV\/WW turbulent kinetic energy components   \nα  thermal conductivity \nβ  coefficient of thermal expansion \n 3\nijδ  Kronecker delta  \n∆  filter width, grid width \nε  temperature difference, dissipation term \nκ  frequency \nµ  viscosity \nΠ  reduced pressure term \nρ  density \nijτ  stress tensor \nυ  kinematic viscosity \nSubscripts \nkji XXX \/\/  components to be considered over three dimensions \naX  ambient value \n0X  initial \/ input value \ntX  turbulent value – turbulent Prandtl number or turbulent viscosity \nbX  Boussinesq term \nsgsX  subgrid scale term \nSuperscripts \nX  filtered variable with arbitrary filter \nX\nt\n filtered variable with arbitrary filter \nX  filtered variable with arbitrary filter \nX~  Favre-filtered variable with arbitrary filter \nX ′  fluctuating component of filtered variable \n 4\nAbbreviations and Acronyms \nCFD  Computational Fluid Dynamics \nDNS  Direct numerical simulation \nGGDH   Generalised gradient diffusion hypothesis \nLDM  Localised Dynamic Model \nLES  Large eddy simulation \nLMN  Low Mach number \nRANS  Reynolds-averaged Navier-Stokes \nSGDH   Standard gradient diffusion hypothesis \nSKE  Subgrid kinetic energy \nTKE  Turbulent kinetic energy \n \n1. Introduction \nLarge Eddy Simulation (LES) was first introduced by Lilly [1] and Smagorinsky [2]. The concept \nprovides a formalism which enables time accurate simulations of turbulent flows to be carried out \nfor a filtered velocity field, as opposed to a time averaged velocity field in the corresponding \nReynolds Averaged (RANS) approach, at less computational cost than a corresponding direct \nnumerical simulation (DNS) in which all the scales of motion are fully resolved. The initial \ngrowth and acceptance of LES as a viable computational approach was initially constrained by \navailable computing resources. However as computing power has steadily increased and become \nmore readily available, interest in the technique has grown, perhaps most significantly with the \ndevelopment of the dynamic procedure of Germano [3]. \n \nWhilst the concept of LES, and the use of a sub-grid scale turbulence model, has not changed, \nalternative sub-grid scale models continue to be proposed. In this state of ongoing development it \nis difficult to ensure that representative benchmark comparisons of models are carried out. There \n 5\nare only a limited number of publications which provide a comparative assessment of models, the \nworks of Bastiaans et al. [4, 5] are particularly notable, and this present paper has a similar \nobjective. Other buoyant jet LES simulations have been performed [6, 7], which focus on the \nsimulation of the buoyant jet particularly rather than the LES model as done here. No hypothesis \nwas followed, so the work may be considered to be a series of ‘numerical experiments’, as Lilly \n[1] described them, with conclusions and observations drawn from the results of the simulations. \n \nThe physical problem of a buoyant jet was selected as the basis to assess the models. Buoyant jets \nincorporate laminar flow, transition, and fully turbulent flow, and are representative of a wide \nrange of practical applications including building heating and ventilation, fire safety and the \ndispersion of pollutants in the atmosphere.  \nThe principle objective of this work was to assess the relative behavior of the LES sub-grid scale \nstress and scalar flux models and to provide a recommendation for which model to adopt for \nbuoyant jet simulations.  \n \n2. Filtered Governing Equations \nLES, similarly to RANS, is based upon a filtering of the governing equations to reduce the scales \nwhich are to be resolved. RANS may be considered as filtering out temporal variation, whereas \nLES filters out the spatial subgrid scales, i.e. those scales of motion which cannot be represented \ndue to the coarseness of the grid. Germano [3] gives a full introduction to filtering and the \nrelation between filter scales. \nFrom the instantaneous variable and the instantaneous filtered variable at a point in space we \ndefine the ‘fluctuating’ component, in a manner analogous to the RANS approach, although the \nfluctuations are in space: fff −=′ . The filtered governing equations are obtained by applying \nthe filter to each term in the governing equations of motion appropriate to the flow under \n 6\nconsideration. In this work these were the Low Mach Number equations as derived by Paulucci \n[8], and Rehm and Baum [9]. This form of the Navier-Stokes equations my be considered to lie \nbetween the full compressible Navier-Stokes equations and the (Boussinesq) incompressible \nNavier-Stokes equations. It is assumed that sound waves are propagated at infinite speed, \nallowing the pressure term to be solved with a fast elliptic solver, but the density and temperature \nvariations are not limited to the Boussinesq approximation. In order to accommodate fluctuations \nof density, the Favre-average, ρρ \/~ ff = , is employed in conjunction with the filter.   \nThe resultant form of the governing equations, comprising the continuity, the momentum, the \ntemperature equation, and the equation of state are given below. \n0\n~\n=∂\n∂+∂\n∂\ni\ni\nx\nu\nt\nρρ\n        (2.1) \nj\nij\ni\nj\ni\nij\njii\nx\ng\nFrx\nu\nxx\nuu\nt\nu\n∂\n∂−−+∂\n∂+∂\nΠ∂−=∂\n∂+∂\n∂ τρρρρ )1(1~\nRe\n1~~~\n2\n2\n     (2.2) \nj\nj\njj\nj x\nq\nx\nT\nx\nTu\nt\nT\n∂\n∂−∂\n∂=∂\n∂+∂\n∂\n2\n2 ~\nPrRe\n11~~\n~\nρ       (2.3) \n1~ =Tρ          (2.4) \nThe momentum subgrid terms, jijiij uuuu ~~−=τ , are called the stresses, and the temperature \nsubgrid terms, TuTuq jjj\n~~−=  are called the fluxes, and these must be modelled. The double bar \nas well as the tilda represents the Favre average. \n \nThe assumption was made that the density varies slowly through space and that therefore the \napproximation ff ~= was valid. The viscous term in the momentum equation and the state \nequation are then achievable in this form. \n \n 7\nThe subgrid decomposition [10] of the stress tensor into more elementary parts becomes, \njijiij uuuu −=τ          (2.5) \n     jiji uuuu −=        Leonard term      \n     jiji uuuu ′+′+        Cross term       \n     jiuu ′′+                   Reynolds term       \nThe Leonard terms represent the largest of the subgrid scales, followed by the Cross terms and \nfinally the Reynolds terms.  \n \n3. LES Models \n \nThe first LES models [1,2] were purely diffusive in nature, which is a sufficient quality to enable \na solution with an explicit numerical scheme. Piomelli [11] highlights the main objectives and \nchallenges of LES modelling. The first is this diffusive quality, which can largely be associated \nwith the Reynolds term. The second is to accurately capture the backscatter of the energy – that is \nthat the turbulent kinetic energy travels from small scales to large scales as well as from large to \nsmall. Thirdly for the model to be internally accurate; that is that the terms in the subgrid \ndecomposition are individually accurately represented. The final consideration is the \ncomputational cost to implement the models. Schumann [12] introduced full second moment \nmodelling (providing a transport equation for each of the stresses and fluxes) but this was not \npursued due to cost and the further modelling requirements. \n \nBoussinesq Hypothesis. The Boussinesq hypothesis is that the turbulent terms can be modelled \nas directly analogous to the molecular viscosity terms using a ‘turbulent viscosity’. This can be \nwritten (not necessarily equivalently) in a number of forms, the simplest of which is used here.  \n 8\nijtij Sυτ 2−=          (3.1) \n This is usually called the eddy viscosity model, and encompasses a variety of different models \ndetermined by the evaluation of the turbulent viscosity, tυ .  The standard gradient diffusion \nhypothesis (SGDH), also the eddy diffusivity model, is given by  \njt\nt\nj x\nTq ∂\n∂=\nPr\nυ\n         (3.2) \nDimensional reasoning shows 3\/43\/1~ ∆= ευ Ct  , where ε~  is the energy transfer through the \ncutoff in the energy spectrum (see Sagaut [13]), and ∆  is the filter width. \nThe turbulent Prandtl number is typically chosen to be a constant although dynamic procedures \ncan also be applied to it. This has received considerably less attention, and improved models here \nare desirable. \nSmagorinsky model The original LES model was the Smagorinsky model [2,1] where the \nturbulent viscosity is given by \nSCt\n2∆=υ  , 2\/1)2( ijij SSS =        (3.3) \nLilly [14] showed the model to be consistent with the Kolmogorov spectrum if the correct \nconstant, 0.03, is chosen, although a constant of 0.01 is typically used after numerical \nexperiments, for example [15]. \nBuoyancy-Modified Smagorinsky Model This was developed by Lilly [1]. Note the buoyancy \nterm does reintroduce a non-dimensional flow parameter into the model. The original derivation \nmakes an approximation only suitable for low Mach number flows. The model is given by \n2\/12 )\nPr\n12( ij\nit\nijijt x\nT\nFr\nSSC δυ ∂\n∂−∆=       (3.4) \n 9\nStructure Function model The structure function in physical space is an extension of the \nspectral eddy viscosity model, developed by Metais and Lesieur [16]. It takes the following form \n[17].  \n2\/1\n2 )),((063.0 ∆∆= xFtυ        (3.5)  \nin which >+−=<∆ 22 ),(),(),( trxutxuxF      (3.6) \nThe structure function 2F  is calculated as the average of the values made with the six immediately \nadjacent cells. In Eq. (3.6), the double side bars are the magnitude of the vector, and the pointed \nbrackets represent the average over all suitable vectors r  with magnitude∆ .  \nOne Equation Model The one equation model [12] uses a transport equation for the subgrid \nkinetic energy and uses the Boussinesq hypothesis also. \n2\/1)( sgst kC∆=υ         (3.7) \n069.0=C , and is a theoretically derived value [13]. However, values between 0.04 and 1 have \nbeen used [18]. The transport equation can be given by \nBDFDPP\nxx\nk\nx\nku\nt\nk\njjj\nj ++−+∂∂\n∂+=∂\n∂+∂\n∂ 2υ      (3.8) \nin which \nj\ni\nij x\nuP ∂\n∂−= τ  , ∆=\n2\/3\n1\n)(kCDP , ))(( 2\/12\njj x\nkk\nx\nCDF ∂\n∂∆∂\n∂= , and \njjj guuB )( ρρ −= . P  is the regular production term, DP  is the dissipation term, DF  is the \ndiffusion term, and B  is the production due to buoyancy.  \nThe constants are found to take the values 11 =C  and 1.02 =C . The buoyancy term is given by \nthe density flux and is modeled according to whichever method is preferred. It is usually modeled \nwith the standard gradient diffusion hypothesis. \nGeneralised Gradient Diffusion Hypothesis The generalized gradient diffusion hypothesis \n(GGDH) has been found in RANS modeling [19, 20] to give significant improvements. Daly and \n 10\nHarlow [21] were among the first to derive this model, although it was largely overlooked. The \nmodel is derived from balance considerations from the scalar flux equation (the equivalent of the \nTKE equation for the temperature fluctuations), assuming steady homogeneous turbulence, and \nassuming that higher order correlations are negligible, although the temperature (or scalar) flux is \nitself of the order of the neglected terms.  \nk\njktj x\nTkcq ∂\n∂= τε         (3.9) \nThis can be modeled with ∆=\n2\/3kε , using k  from the transport equation if used, or from \niik τ21= . Substitution results in the following. \nk\njktj x\nTkcq ∂\n∂∆−= − τ5.0         (3.10) \nor \nk\njkiitj x\nTcq ∂\n∂∆−= − ττ 5.021 )(        (3.11) \nEquation 3.17 is labeled GGDH_1, and Equation 3.18 is GGDH_2. \nBardina Model The Bardina model [22] was the first of the scale similarity models. The basic \nprinciple behind such models is that the structure of the smallest resolved scales, given by the \nfiltered subgrid component, is similar to the structure of the largest unresolved scales, given by \nthe subgrid component. This implies correctly that the Leonard term is dominant in the stress \ndecomposition giving \niijiij uuuu −=τ         (3.12) \nLeonard Model Leonard [10] introduced the Taylor expansion models of which there are two \nmain formulations. The form that Leonard gives takes the linear expansion of the components iu  \nand ju , whereas Kwak [23] takes the expansion around jiuu . We use Leonard’s form for both \nthe stress and the flux. \n 11\n)(\n24\n2\n2\n∆+∂\n∂\n∂\n∂∆+= O\nx\nu\nx\nuuuuu\nk\nj\nk\ni\njiji   Leonard [10]    (3.13) \n)(\n24\n3\n2\n22\n∆+∂\n∂∆+= O\nx\nuu\nuuuu\nk\nji\njiji  Kwak et al. [23]   (3.14) \n)(\n24\n2\n2\n∆+∂\n∂\n∂\n∂∆+= O\nx\nT\nx\nuTuTu\nkk\ni\nii       (3.15) \nMixed Models There are two natural types of mixed model., )(21 BAij +=τ , type 1, and \nRCLij ++=τ , type 2. Bardina et al. [22] were the first to propose a mixed model. They \nproposed a type 1 model using the Smagorinsky combined with the Bardina. This is appropriate \nsince both are models for the whole stress, and it combines the dissipation of the Smagorinsky \nwith the structural accuracy of the Bardina. \n)2(2\n1\njijiijsgsij uuuuS −+−= υτ       (3.16) \nType 2 models mix separate models of the different components of the Leonard decomposition. \nThe Cross terms can be modeled as identical to the Leonard term. An example would be the one-\nequation model with the Leonard model, with or without explicitly modeling the Cross terms.  \nDynamic models Dynamic models allow the empirical constants of the previous models to be \nevaluated locally in space and time, and overcome some problems of the static (non-dynamic) \nmodels. Germano et al. [24] introduced the first dynamic model, the dynamic Smagorinsky, based \non an algebraic identity, which Germano [3] generalises for use with any other appropriate model. \nConsidering double filtered terms the following holds. \njijijijijiji uuuuuuuuuuuu −+−=−      (3.17) \nThis can be rewritten \nijijij LT += τ          (3.18) \nwhere jijiij uuuuT −= , jijiij uuuu −=τ  and jijiij uuuuL −= .  \n 12\nThis relates exactly the subgrid stress of the double filtered field to the filtered (with the second \nfilter) subgrid stress of the single filtered field via a quantity calculable from the filtered \nvariables.  \nPutting an arbitrary SGS model into the stress tensors, which takes a form such that \n)( iij uCf=τ , and )( iij uCfT =  we find \nijii LuCfuCf += )()(         (3.19) \nWe have two basic evaluation types. \nijii LufCuCf += )()(    Type 1 evaluation.   (3.20) \niji\nn\ni\nn LufCufC +=+ )()(1   Type 2 evaluation.   (3.21) \nn  in the type 2 evaluation is the time step. A problem is that the constant is typically taken out \nthe filter term, to form the type 1 evaluation. Since it is only locally a constant, this is not strictly \nallowed. Lilly [14] proposes that if the flow has at least one homogeneous axis, the constant can \nbe evaluated consistently by filtering only in the homogeneous axes. Piomelli and Liu [25] and \nDavidson [26] use the type 2 evaluation which is marginally more accurate than type 1. \nWhichever evaluation is used the constant is over-prescribed with six equations describing it. \nLilly [14] proposed a least squares approach to determine the final constant which has become the \nprevailing method. \nDynamic Smagorinsky Model Substituting the Smagorinsky model into the dynamic procedure \npreviously described we have \njijiijijij uuuuTL −=−= τ         (3.22) \nwith ijij SSC\n22 ∆−=τ  and ijij SSCT\n2\n2 ∆−=  . Let )22( 22 ijijij SSSSM ∆+∆−= , then \n)\/(21 klklijij MMMLC =        (3.23) \n 13\nLund et al. [27] investigate the numerical stability of negative viscosities, and find that the \nconstant must be clipped, ensuring a non-negative value, in order to produce a stable result. The \ninstability caused by near zero denominators in laminar flow can also be a problem. Balaras and \nBenocci [28], simulating a square duct flow, found that the constant has to be bounded above in \nsome cases. \nDynamic Mixed Models The dynamic mixed model appeared soon after the Germano identity. \nZang et al. [29] use the original mixed model of Bardina et al. [30], combining the Bardina model \nwith the Smagorinsky model as the base model for the dynamic procedure.  \n),(2 2 jiijijij uuBSSC +∆−=τt       (3.24) \n),(2 2 jiijijij uuBSSCT\nttttt +∆−=       (3.25) \nwhere jijijiij uuuuuuB −=),(       (3.26) \nor jijijiij uuuuuuB −=),(         (3.27) \nEquation 3.25 gives the formulation with an unspecified second filter, and Vreman et al. [30] give \nthe form in equation 3.27. The distinction is that in equation 3.26, the  top filter (the single \narrowhead is different from the double arrowhead filters) does not depend on the filters used \n‘below’ whether a single filter, or a double filter as is the case for the test filter. The second \nformulation, equation 3.27, uses whichever filter or filters are used for the variable, so for the test \nfilter this would incorporate a total of four filter layers. \nLet ija SSG\n2∆= , ijb SSG\nttt\n2∆= , ),( jiija uuBH = , and , then \n)\/()( babaij GGHHLC −−+=       (3.28) \nThe constant still needs to be clipped, although backscatter can now occur through the addition of \nthe Bardina model in a stable manner. \n 14\nLocalized Dynamic Model This model is the dynamic version of the one-equation model. A \nnumber of authors have developed it independently with different considerations [31, 32, 33, 34]. \nThe first part applies the Germano identity to the subgrid model. Using the dynamic procedure \nwith ijij SkC\n2\/1∆=τ , ijij SKCT 2\/1∆ˆ= , and using type 1 evaluation for C, let \nijijij SkSKM\n2\/12\/1 ∆−∆=        (3.29) \nThen \nklkl\nijij\nMM\nML\nC =         (3.30) \nK  can be evaluated from a second transport equation, or from the relation iiLkK += . The \ndynamic evaluation of the transport terms are given in appendix 1. \n \n4. Simulation Details and Numerical Method \nA buoyant jet similar to the experiment of Shabbir and George [34] and the simulation of Zhou et \nal. [15]. The simulations were obtained on a uniform grid of 63x127x63 cells over a solution \ndomain of 7x14.11x7 (non-dimensionalised by the jet inlet diameter), with 9 cells across the jet \ninlet. Taking the ambient temperature to be 300K , this yields 1300Re = , 54.1=Fr , and \n893.0=ε , where the inflow temperature is given by ε+1 . 7.0Pr = . \nOpen boundary conditions were employed at the sides and top of the computational domain, and \nspecial care had to be taken to ensure stability of the resulting simulations. Gresho [35] noted the \ncritical issue of maintaining continuity at the boundaries. This can be achieved directly through \nlocal evaluation of the normal (to the boundary) component of the velocity when the \nperpendicular components are zero gradient or constant, for example, as adopted in this work. \nFurthermore, the pressure term must be evaluated in a consistent manner on the normal velocity \nboundary. If a Neumann boundary condition is adopted then the pressure must be defined as a \nDirichlet boundary condition, otherwise the boundary is underspecified. The converse is required \n 15\nfor accuracy but not for stability.  On the side boundaries of the computational domain it was \nassumed that the flow could only enter the domain, and at the top of the domain the flow was \nassumed to only exit. When these conditions were not met then the local velocity was clipped to \nzero and the appropriate pressure boundary applied. \nThe fractional step method of Najm et al. [36] was employed. Since the density difference is less \nthan unity, only the first step is required whilst maintaining second order accuracy in time. The \nconvective terms were discretised such that a true laminar (or instantaneous) simulation could be \nrun, i.e. one without a subgrid model. A third order upwind scheme was implemented for the \nmomentum convection terms, and a second order TVD scheme ‘superbee’ was implemented for \nthe temperature convection terms. \n \nFollowing Zhou et al. [15], the inlet velocity boundary condition forced instabilities imposed to \nensure a sufficiently rapid transition. These were twofold. Firstly, random fluctuations of random \nduration with a maximum value of 0.35 and maximum duration of 200 time steps for each \nvelocity component. Secondly, the structured instability of Menon and Rizk [37], given by Eq. \n(4.1), was employed. \n∑ = +=′ 2 1 )\/2sin()( n nftrAVv θπ       (4.1) \nA  is the fraction of the inlet velocity, 0.2, )(rV is the inlet velocity as a function of radius, f is \nthe frequency constant, 0.3, t  is the time, and θ  is the angle from the centre of the source.  \nThe simulations were run for 50,000 time-steps of 0.012s, with appropriate average values being \nobtained over the last 35,000 time-steps. \n \n5. Results \nIt is often stated that for engineering applications the choice of LES model will not affect the \noverall result. This is shown not to be the case, although the models do have more or less effect.  \n 16\nCode validation is carried out on laminar buoyant jets and turbulent non-buoyant jets in [38].  \nThe grid used is too coarse to accurately handle the rapid transition to full turbulence. A coarse \ngrid simulation [38] indicates the sensitivity of the near-field to the grid resolution, and also that \nthe resolution is sufficient for the fully developed turbulent region. Fixed mesh refinement and \nadaptive mesh refinement techniques are presently being coded which will help overcome this \ndeficiency. The coarseness of the grid is essential for the LES models to be useful however, since \nthe more refined the grid is, the less energy is in the subgrid scales, and hence the less important \nare the LES models.  \nThe focus of this work is on the relative behaviour of the models and their mechanics rather than \ntheir comparison with the experimental data, for which the simulations carried out do not provide \nappropriate data, since the region of self-similarity, although observable, does not cover a great \nenough region to extract useful spread-rate information. \n \nFigure 1 and figure 2 show the turbulent kinetic energy spectrum (TKE) and temperature \nfluctuation spectrum (TFS) respectively. The usual -5\/3 gradient is achieved for the TKE, and \nalso for the TFS, but the required -3 gradient at smaller scales [12] is not found, due to the \nrelative coarseness of the grid. \nThe models being reviewed are considered in subgroups. The eddy stress models are considered \nfirst. These are all qualitatively the same, although with clearly differing results. The centerline \nvalues for mean velocity and temperature provide the largest scale comparisons and the graph of \nthe vertical velocity component (figure 3) shows the difference in magnitude very clearly. The \nsimilarity between the models is indicated with the vertical normal stresses, 22τ  in figure 4, along \nthe centerline. The structure function model is the most dissipative, as indicated by the slower \ntransition (which starts at approximately 4 diameters from the inflow boundary), and the faster \ndecay, followed by the one equation model, and finally the Smagorinsky and buoyancy-modified-\n 17\nSmagorinsky models. The decay for a simulation without a sub-grid model is also plotted, and is \nobservably less than for any of the other models. \nNotably the Smagorinsky and buoyancy-modified Smagorinsky models give almost identical \nresults contrary to the findings of [4], who find the buoyancy-modified version less accurate than \nthe standard Smagorinksy model. The formulation used here is slightly different, however, in that \nthe turbulent viscosity is evaluated from the square root of the absolute value given in Eq. (3.4), \nand not fixed to zero when the root is imaginary. \nThe eddy models here are qualitatively almost similar (apart from the one equation model near \nthe inlet, where the method has not given the model sufficient time and distance to evaluate the \nturbulent kinetic energy properly). The adjustment of the model constants could make the models \nalmost identical, due to the similarity. \nThese models all break the realizability conditions [39, 40], which are necessary when the top-hat \nfilter is used. This is clear, since the formulation considers the gradient in the normal stresses also \nwhich can be either positive or negative (to satisfy the realizability conditions these stresses must \nalways be positive).  This is also demonstrated in figure 4. \nThe flux eddy models (the SGDH with a turbulent Prandtl number of 0.4, and the GGDH models \nwith a constant of 5, an order of magnitude higher than that used for the RANS model analogue) \nshow the flux to be the dominant term in the effect on the overall decay. The GGDH models are \nmuch faster to go through transition (due to their extra complexity, the dissipation is evaluated \nconsidering gradients in all three axes, and hence does not recognize the edge of the laminar jet as \nturbulence so strongly). The centerline decays are shown in figure 5. The qualitative behavior of \nthe GGDH models is a distinct improvement on the SGDH model, but the different formulations \nhave different magnitudes of flux values. The constants for these models need to be better \nevaluated (as does the constant for the SGDH model still), but these are promising. \nMore important however, is the simulation without a flux model, only using the stress model, also \nplotted in figure 5. This used the one equation model for the stresses. The decay rate was brought \n 18\nalmost to the point of no model being used at all, even though in conjunction with the SGDH \nmodel, this was the second most dissipative model. This shows the importance of the interaction \nbetween the models (since the flux eddy models are dependent on the turbulent viscosity as \ncalculated by the stress model), and the importance of consideration of the flow to be simulated.  \nThe Bardina and Leonard models are termed the structure models (the structure function model is \nan eddy model) both for the stresses and fluxes. It was impossible to test the structure models \nindependently with the same conditions; they were found to be unstable, but when mixed with an \neddy stress or eddy flux model, they were stable. The resultant simulations deviated very little \nfrom the centerlines of the non-subgrid model simulation due to a cancellation of the effects of \nthe structure and eddy components, confirmed in the dynamic model results. These two models, \nqualitatively the same as each other, are distinctly different from the eddy models. This is \nappropriate though, since generally speaking, the eddy models are most suitable to model the \nReynolds terms, and possibly the Cross terms, whereas the structure models are most \nrepresentative of the Leonard terms and possibly the Cross terms. In this light, the lack of stability \nmakes sense for the structure models used by themselves, since there is no term to dissipate the \nenergy building up in the small scales. Both adhere to the realizability conditions (although the \nLeonard model would not if the Kwak (equation  3.14) variant was used, since it does not square \nthe terms), ensuring their lack of similarity with the eddy model.  \nThe structure models stresses are significantly larger than the eddy model stresses, figure 6, and \nhave different dominant terms. For the eddy models the radial\/axial stresses, 12τ , 23τ , and their \nsymmetric equivalents, are dominant, whereas the axial stresses are dominant for the structure \nmodels. This is obviously particular to the buoyant jet situation, but highlights the significant \ndifferences between the two types of model. Also the radial normal stresses are larger than the \ncross stresses for the structure models. Worthy [38] goes into more detail on this. \n \n 19\nThe dynamic Smagorinsky and LDM models give centerline values the same as a simulation \nwithout a subgrid model. The ‘internal’ properties of the models are considered, although the \nresults are somewhat skewed due to the amount of dissipation provided by the upwind and TVD \nconvective schemes. All of the dynamic models have the very important quality of having zero \nturbulent viscosities in the laminar regions and are weaker than their static counterparts in the \ntransitional region, shown in figure 7. Figure 8 shows the 22τ  centerlines, from which the \ninversion of the relative magnitudes can be seen. Although the turbulent viscosity of the dynamic \nmodels is lower on average, the stress is larger. This possibly indicates a correlation of the \nclipping to the direction of the gradient of the velocity. \nThe average value of the Smagorinsky constant is plotted along the centerline in figure 9, and can \nbe seen to take a value of approximately 0.008, only slightly below the usual value of 0.01, and \nthe numerical scheme gives a good explanation of this. The model constants for LDM simulations \nare found much below the recommended value of 0.07, estimating 0.02 in the fully turbulent \nregion. This value is found regardless of the strength of the subgrid kinetic energy used in the \nmodel constants’ evaluation. Figure 10 shows the different SKE centerlines depending on \nwhether dynamic procedures were used in the SKE transport equation. Jiminez [41] suggests that \nthe dynamic procedure adjusts itself to dissipate the necessary amount of energy. The implication \nhere is that the model constant is not dependent on where in the inertial range the filter is, which \nis a positive result. The differences in the LDM SKE levels is clearly attributable to the dynamic \nprocedures applied in the transport equation. The dissipation term is modeled well, with an \naverage constant between 2.5 and 3 in the turbulent region, higher than the recommended value \nof 1. The diffusion term, not modeled at all by Davidson [26] since it was considered an \ninsignificant term, was modeled poorly, with the constant varying to a maximum of above 100, \nand an average two orders of magnitude different from the recommended 0.1. Nevertheless the \n 20\nvariation of the diffusive term did correspond well to the flow (i.e. low in the laminar regions \nhigher in the turbulent regions, and maximum in the region of forced instability at the inflow). \nThe dynamic SGDH model takes negligible values for the fluxes. There were two immediate \npossible reasons, that the TVD scheme has already dissipated enough thermal energy, or that the \nthermal turbulent fluctuations were not in synchronization with the turbulent kinetic energy \nfluctuations. Simulations using a third order upwind scheme instead of the second order TVD \nscheme gave similar results, and so the first possibility was dismissed. The latter remains a \npossibility, and dynamic flux models in which the turbulent viscosity does not depend on the \ndynamic stress model constant could overcome this. The same problem is encountered with the \ndynamic GGDH models. \nTable 1 shows the percentage of non-clipped constants at a couple of points along the centerline. \nIt shows that the level of clipping for the dynamic SGDH model is not low enough to explain the \nshortfall of the model constant. The Smagorinsky model achieves a healthy 68% calculated. The \npercentages from the dynamic mixed model simulations are also given. The expectation was that \nwith the structure model handling the backscatter and the large subgrid-scale transfer the \nSmagorinsky component constant would be clipped less. This is not the case – the behaviour of \nthe Smagorinsky model appears to be largely unaffected, although the constant does double in \nvalue, canceling out the effect of halving in the type 1 formulation of the mixed model. \nFigure 11 shows the velocity decays of the mixed models. The accelerated transition can clearly \nbe seen, further showing the opposite effect of the eddy and structure components. The dynamic \nprocedure still maintains the eddy component at near zero through the transitional period, while \nthe structure component already is a significant term. This suggests the dynamic mixed models \nare the most accurate of the models considered here for the stresses, although the computational \ncost has not been mentioned and is considerably more in both operation count and memory \nrequirements.  \n \n 21\n6. Conclusion \nThis work has investigated both the relative effect on the outcome of the averaged results and also \nthe mechanics of the different models on a buoyant jet. \nThe main conclusion is that in a buoyant transitional flow the choice of LES model can have a \nsignificant impact. In the stress models the eddy models and the ‘structural’ models – that is the \nLeonard and Bardina models – have opposite effects on the transition point, with the ‘structural’ \nmodels aiding transition while the eddy models delay it. For the flux models the GGDH models \ngreater complexity does indeed appear to give it an advantage over the SGDH model, although \nthe model constant needs to be better established (although this is still true of the SGDH model). \nThe difference in the static eddy models is significant, although since they are qualitatively \nsimilar, an adjustment in the model constant should make them equivalent. \nA number of observations about the dynamic models are made. It has been long known that \ndynamic modeling with an eddy model is unstable if backscatter is allowed to be larger than the \nmolecular viscosity [27]. Here the percentage of clipping in the turbulent regime is similar but \nless than that found by Piomelli et al. [42] in non-buoyant channel flow. The hope that the \ndynamic mixed modelling would reduce the amount of clipping was not rewarded, indicating that \nthe eddy model is, in effect, acting on the larger subgrid scales as well as the smaller, which is \nonly a desirable feature when the ‘structural’ model is not included to represent these terms. \nThe dynamic modeling of the flux terms was very poor, with negligible values being attained, and \nfurther investigation into this is required. Mixed modeling did not improve the situation (in terms \nof the eddy component). \nThe dynamic one equation model or ‘localized dynamic model’ has significant internal \ndifferences dependent on the modeling method for the subgrid kinetic energy transport terms, but \nin these simulations do not show significant differences in the outcome of the simulations. The \nconstant of dissipation was found to be underestimated, with the dynamic procedure estimating it \nto be approximately three times the usually prescribed value (although note this value is based on \n 22\naveraging which includes the zeros of clipped values). The dissipation terms were modeled highly \nerratically and a static model for these terms is suggested. \nThe final recommendation for choice of LES model would be a dynamic mixed model for the \nstresses and the static GGDH model for the fluxes, although for a rapid simulation the stability \nconsiderations of upwind or TVD schemes (without subgrid model) may outweigh the \nrequirement of better accuracy. \n \nReferences \n1. Lilly, D. K., On the numerical simulation of buoyant convection, Tellus, XIV(2), p144, 1962. \n2. Smagorinsky, J., General circulation experiments with the primitive equations, Mon. Weather \nRev., 91, p99, 1963. \n3. Germano, M., Turbulence: the filtering approach, J. Fluid Mech., 238, p325, 1992. \n4. Bastiaans, R., J. M., Rindt, C. C. M., Nieuwstadtadt, F. T. M. and van Steenhoven, A. A., \nDirect and large-eddy simulation of the transition of two- and three-dimensional plumes in a \nconfined enclosure, I. J. Heat Mass Trans., 43, p2375, 2000. \n5. Bastiaans, R., J. M., Rindt, C. C. M. and van Steenhoven, A. A., Experimental analysis of a \nconfined transittional plume with respect to subgrid-scale modelling, Int.. J. Heat & Mass \nTransfer, 41, p3989, 1998. \n6. Basu, A. J. and Mansour, N. N., Large eddy simulation of a forced round turbulent buoyant \nplume in neutral surroundings, Annual Research Briefs, Centre for Turbulence Research, NASA \nAmes\/Stanford Univ., 1999. \n7. Webb, A. T. and Mansour N. N., Towards LES of jets and plumes, Annual Research Briefs, \nCentre for Turbulence Research, NASA Ames\/Stanford Univ., 2000. \n8. Paulucci, S., On the Filtering of Sound from the Navier-Stokes Equations, Sandia National \nLabs, Report SAND-82-8257, 1982. \n 23\n9. Rehm, R. G. and Baum, H. R., The Equations of Motion for Thermally Driven, Buoyant \nFlows, J. Res. Nat. Bur. Stand., 83, p297, 1978. \n10. Leonard, A., Energy cascade in large-eddy simulations of turbulent flows, Adv. Geophys., 18, \np237, 1974. \n11. Piomelli, U., Large Eddy Simulation: Achievements and Challenges, Progress in Aerospace \nSciences, 35, p335, 1999. \n12. Schumann, U., Subgrid-scale model for finite-difference simulations in plane channels and \nannuli, J. Comp. Phys., 18, p376, 1975. \n13. Sagaut, P., Large Eddy Simulation for Incompressible Flows: An Introduction, Springer-\nVerlag, Berlin, 2000. \n14. Lilly, D. K., A proposed modification of the Germano subgrid-scale closure method, Phys. \nFluids A, 4(3), p633, 1992. \n15. Zhou, X., Luo, K. H., and Williams, J. J. R., Large-eddy simulation of a turbulent forced \nplume, Eur. J. Mech. B – Fluids, 20, p233, 2001. \n16. Metais, O. and Lesieur, M., Spectral large eddy simulations of isotropic and stably-stratified \nturbulence, J. Fluid Mech., 239, p157, 1992. \n17. Lesieur, M. and Metais, O., New Trends in Large Eddy Simulation, Ann. Rev. Fluid Mech., \n28, p45, 1996. \n18. Schmidt H., and Schumann, U., Coherent Structure of the Convective Boundary Layer \nDerived from Large-Eddy Simulations, J. Fl. Mech., 200, p511, 1989. \n19. Sanderson, V. E., Turbulence Modelling of Turbulent Buoyant Jets and Compartment Fires, \nPhD Thesis, Cranfield University, 2001. \n20. Worthy, J., Sanderson, V., and Rubini, P. A., Comparison of Modified k-ε Turbulence \nModels for Buoyant Plumes, Num. Heat Transfer, Part B, 39, p151, 2001. \n21. Daly, B. J., and Harlow, F. H., Transport Equations in Turbulence, Phys. Fluids, 13(11), \np2634, 1970. \n 24\n22. Bardina, J., Ferziger, J. H., and Reynolds, W. C., Improved subgrid scale models for large \neddy simulations, AIAA paper No. 80-1357. \n23. Kwak, D., Reynolds, W. C., and Ferziger, J. H., Numerical Simulation of Turbulent Flow, \nThermosciences Division. Dept. Mech. Eng., Stanford University, Report No. TF-5, 1975. \n24. Germano, M., Piomelli, U., Moin, P., and Cabot, W. H., A dynamic subgrid-scale eddy \nviscosity model, Phys. Fluids A, 3(7), p1760, 1991. \n25. Piomelli, U., and Liu, J., Large-eddy simulation of rotating channel flows using a localized \ndynamic model, Phys. Fluids, 7(4) , p839, 1995. \n26. Davidson, Lars, Large Eddy Simulation: A Dynamic One-Equation Subgrid Model for Three-\nDimensional Recirculating Flow, 11th Int. Symp. on Turb. Shear Flow, Vol. 3, p26.1, Grenoble, \n1997. \n27. Lund, T. S., Ghosal, S., and Moin, P., Numerical experiments with highly variable eddy \nviscosity models, in Engineering Applications of Large Eddy Simulation, eds. Ragale, S. A., & \nPiomelli, U., FED Vol. 162, ASME, 1993. \n28. Balaras, E., and Benocci, C., Large eddy simulations of flow in a square duct, Proc. Of the \nthirteenth symposium on turbulence, Univ. of Missouri Rolla, 1992. \n29. Zang, Y., Street, R. L., and Koseff, J. R., A dynamic mixed subgrid-scale model and its \napplication to turbulent recirculating flows, Phys. Fluids A, 5(12), p3186, 1993. \n30. Vreman, B., Guerts, B., and Kuerten, H., On the formulation of the dynamic mixed subgrid-\nscale model, Phys. Fluids, 6(12), p4057, 1994. \n31. Wong, V. C., A proposed statistical-dynamic closure method for the linear or nonlinear \nsubgrid-scale stresses, Phys. Fluids A, 4(5), 1992. \n32. Ghosal, S., Lund, T. S., Moin, P., and Akselvoll, K., A dynamic localization model for large-\neddy simulation of turbulent flows, J. Fluid Mech., 286, p229, 1995. \n 25\n33. Kim,W.-W., and Menon, S., A New Dynamic One Equation Subgrid Model for Large Eddy \nSimulations, 33rd Aerospace Sciences Meeting, AIAA Paper No. 95-0379, Reno, NV, Jan 9-12, \n1995. \n34. Shabbir, A. and George, W. K., Experiments on a round turbulent buoyant plume, J. Fluid. \nMech., 275, p1, 1994. \n35. Gresho, P. M., Incompressible Fluid Dynamics: Some Fundamental Formulation Issues, Ann. \nRev. Fluid Mech., 23, p413, 1991. \n36. Najm, H.N., Wyckoff, P.S., and Knio, O..M., A Semi-Implicit Numerical Scheme for \nReacting Flow. I. Stiff Chemistry, J. Comp. Phys., 143(2), p381, 1998. \n37. Menon, S. and Rizk, M., Large Eddy Simulations of Three-Dimensional Impinging Jets, Int. \nJ. Comp. Fl. Dyn., Vol. 7, p275, 1996. \n38. Worthy, J., Large Eddy Simulation of Buoyant Plumes, PhD Thesis, Cranfield University, \n2003. \n39. Schumann, U., Realizability of Reynolds-stress turbulence models, Phys. Fluids, 20(5), p721, \n1977. \n40. Vreman, B., Guerts, B., and Kuerten, H., Realizability conditions for the turbulent stress \ntensor in large-eddy simulation, J. Fluid Mech., 278, p351, 1994. \n41. Jimenez, J., On why dynamic subgrid-scale models work, Annual Research Briefs, Centre for \nTurbulence Research, NASA Ames\/Stanford Univ., 1995. \n42. Piomelli, U., Moin, P., and Ferziger, J., Large Eddy Simulation of the Flow in a Transpired \nChannel, AIAA Report 89-0375, 1989.  \n \n \nAppendix A \nWe follow Ghosal et al. [32] for the dynamic evaluation of the SKE transport equation terms. \nSimilarly to the usual dynamic procedure, use of a test filtered subgrid kinetic energy transport \nequation is considered. \n 26\nk\njj\nk Bx\nkk\nx\nCkCPkTRANS +∂\n∂∆∂\n∂+∆−= )()(\n2\/1\n2\n2\/3\n1     A.1 \nK\njj\nK Bx\nKK\nx\nCKCPKTRANS +∂\n∂∆∂\n∂+∆−= )()(\n2\/1\n2\n2\/3\n1    A.2 \nThe two constants can now be dynamically calculated (if the buoyant production term has an \nunknown constant this can be evaluated dynamically before this procedure is used, although this \nis not done here-the static SGDH model is used). \n2C  is attained with the following. Let \n)2\/()2\/( iijiijj uukpuuukpuZ ++−++≡      A.3 \nNote that the two terms on the rhs of Eq. (A.3) are the exact terms that are being modeled (before \nthe differential operator is applied). \n12\/12\/1\n2\n1\n2 ))((\n−+\n∂\n∂∆∂\n∂∆+=\njj\nn\nj\nn\nx\nKK\nx\nkkCZC      A.4 \n1C  can now be calculated by substituting Eq. (A.4) into Eq. (A.1), filtering and equating it with \nEq. (A.2).  \n)\/()(\n2\/32\/3\n1\n1\n1\n1 ∆∆\n+++∂\n∂+∂\n∂++= ++ KkCBB\nx\nF\nx\nf\nPPC nKk\nj\nj\nj\nj\nKk\nn   A.5 \nDavidson’s [26] formulation lets 02 =C , assuming it is a negligible term. This also simplifies \nthe evaluation of 1C . \nThe subgrid energies must not be allowed to become negative, which is achieved with clipping. \n \n 27\n                Percentage of Used Dynamic Constants \nd2f  d1m d2m\ny\/D C C_SGDH C C C_SGDH\n7.11 66% 50% 63% 61% 36%\n10.66 68% 57% 72% 68% 30%\n \nTable 1. Percentage of dynamically evaluated constants not clipped. \n \n \n \n \n 28\n \nFigure Captions \n \nFigure 1. Turbulent kinetic energy spectra plot for structure function model simulation, s1f, at \ny\/D=10.66. \nFigure 2. Temperature fluctuations spectra, TT(k), for structure function model simulation, s1f, \nusing SGDH for the fluxes, at y\/D=10.66. \nFigure 3. Velocity centrelines for d1n, no subgrid model, s1t, Smagorinsky model, s2t, buoyancy-\nmodified Smagorinsky model, s1f, structure function model, o1e, one equation model. \nFigure 4. T22 centrelines for s1t, Smagorinsky model, s2t, buoyancy-modified Smagorinsky \nmodel, s1f, structure function model, o1e, one equation model. \nFigure 5. Vertical velocity centrelines for d1n, no subgrid model, o1e, one equation model with \nSGDH flux, o2e, one equation stress model, no flux model, f1c, one equation model with first \nformulation of the GGDH model, GGDH_1, f2c, one equation model with second formulation of \nthe GGDH model, GGDH_2. \nFigure 6. Vertical normal stress, T22, centrelines for s1t, Smagorinsky model and SGDH flux, \nm1x, mixed Smagorinsky\/Bardina stress model, mixed SGDH Bardina flux model, m2x, mixed \nSmagorinsky\/Leonard stress model, no flux model. \nFigure 7. Turbulent viscosity centrelines for s1t, static Smagorinsky stress and static SGDH flux \nmodels, d1f, dynamic Smagorinsky stress, static SGDH flux models, d2f, the dynamic \nSmagorinsky stress and dynamic SGDH flux models. \nFigure 8. T22 centrelines for s1t, static Smagorinsky stress and static SGDH flux models, d1f, \ndynamic Smagorinsky stress, static SGDH flux models, d2f, the dynamic Smagorinsky stress and \ndynamic SGDH flux models. \nFigure 9. Smagorinsky constant centrelines for d1f, dynamic Smagorinsky stress, static SGDH \nflux models, d2f, the dynamic Smagorinsky stress and dynamic SGDH flux models. \n 29\nFigure 10. Subgrid kinetic energy centrelines for l1d, LDM with dynamic SKE constants stress, \nstatic SGDH flux models, l2d LDM with static SKE constants stress, static SGDH flux models. \nFigure 11. Velocity centrelines for d1n, no subgrid models, d1f, dynamic Smagorinsky \nstress and static SGDH flux models, d1m, dynamic Smagorinsky\/ Bardina stress and \nstatic SGDH flux models, d2m, dynamic Smagorinsky\/ Bardina stress and dynamic \nSGDH\/ Bardina flux models. \n \n 30\ns1f - TKE Time Spectra y\/D=10.66\n0.01\n0.1\n1\n10\n100\n0.01 0.1 1 10 100\nfrequency, k\nT\nK\nE\n \nUU, WW \nTKE \nVV \n-5\/3\n 31\ns1f - Temperature Fluctuation Time Spectra y\/D=10.66\n0.001\n0.01\n0.1\n1\n10\n0.01 0.1 1 10 100\nfrequency, k\nT\nT\n(\nk\n)\n \n. \nTT \n-3\n-5\/3\n 32\nVelocity Centrelines\n0\n0.5\n1\n1.5\n2\n2.5\n0 2 4 6 8 10 12 14 16\ny\/D\nV\n \n \nd1n \ns1t,s2t\no1e\ns1f \n 33\nT22 Centrelines\n-0.0006\n-0.0004\n-0.0002\n0\n0.0002\n0.0004\n0.0006\n0.0008\n0.001\n0 2 4 6 8 10 12 14 16\ny\/D\nT\n2\n2\n \n \no1e\ns1f\ns1t,s2t\n 34\nVelocity Centrelines\n0\n0.5\n1\n1.5\n2\n2.5\n0 2 4 6 8 10 12 14 16\ny\/D\nV\n \n \nd1n\nf1c,f2c\no1e\no2e\n 35\nT22 centrelines\n-0.005\n0\n0.005\n0.01\n0.015\n0.02\n0.025\n0 2 4 6 8 10 12 14 16\ny\/D\nT\n2\n2\n \n \ns1t\nm2x\nm1x\n 36\nTurbulent Viscosity Centreline\n0\n0.0001\n0.0002\n0.0003\n0.0004\n0.0005\n0.0006\n0.0007\n0 2 4 6 8 10 12 14 16\ny\/D\nV\nt\n \n \ns1t\nd2f d1f\n 37\nT22 Centrelines\n-0.0004\n-0.0002\n0\n0.0002\n0.0004\n0.0006\n0.0008\n0.001\n0.0012\n0 2 4 6 8 10 12 14 16\ny\/D\nT\n2\n2\n \n \ns1t\nd1f\nd2f\n 38\nSmagorinsky Constant Centrelines\n0\n0.005\n0.01\n0.015\n0.02\n0.025\n0.03\n0 2 4 6 8 10 12 14 16\ny\/D\nC\n \nS\nm\na\ng\no\nr\ni\nn\ns\nk\ny\n \n \nd2f\nd1f\n 39\nSubgrid Kinetic Energy Centreline\n0\n0.001\n0.002\n0.003\n0.004\n0.005\n0.006\n0 2 4 6 8 10 12 14 16\ny\/D\nS\nK\nE\n \n \nl2d\nl1d\n 40\nVelocity Centelines\n0\n0.5\n1\n1.5\n2\n2.5\n0 2 4 6 8 10 12 14 16\ny\/D\nV\n \n \nd1n \nd1f\nd1m, d2m\nd1f\n"}