{"doi":"10.1088\/0957-4484","coreId":"101785","oai":"oai:epubs.surrey.ac.uk:1216","identifiers":["oai:epubs.surrey.ac.uk:1216","10.1088\/0957-4484"],"title":"Formation of low-temperature self-organized nanoscale nickel metal islands","authors":["Carey, JD","Ong, LL","Silva, SRP"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-11-01","abstract":"<p>The growth and evolution of nanometre-sized Ni metal islands deposited under low-temperature non-ultra high vacuum conditions as a function of metal layer thickness, growth temperature and time is reported. The temperature of formation of the islands has been intentionally kept low for possible applications in flat panel display technology and also to act as a catalyst for carbon nanotube growth. It is shown that the size and distribution of the islands depends critically on the annealing temperature and the initial thickness of the metal layer. The mechanism of formation of the islands is described in terms of an Ostwald ripening mechanism of mass transport of either weakly bound individual Ni atoms or smaller clusters into larger more dispersed clusters. <\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"IOP PUBLISHING LTD","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1216<\/identifier><datestamp>\n      2017-10-31T14:01:05Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1216\/<\/dc:relation><dc:title>\n        Formation of low-temperature self-organized nanoscale nickel metal islands<\/dc:title><dc:creator>\n        Carey, JD<\/dc:creator><dc:creator>\n        Ong, LL<\/dc:creator><dc:creator>\n        Silva, SRP<\/dc:creator><dc:description>\n        <p>The growth and evolution of nanometre-sized Ni metal islands deposited under low-temperature non-ultra high vacuum conditions as a function of metal layer thickness, growth temperature and time is reported. The temperature of formation of the islands has been intentionally kept low for possible applications in flat panel display technology and also to act as a catalyst for carbon nanotube growth. It is shown that the size and distribution of the islands depends critically on the annealing temperature and the initial thickness of the metal layer. The mechanism of formation of the islands is described in terms of an Ostwald ripening mechanism of mass transport of either weakly bound individual Ni atoms or smaller clusters into larger more dispersed clusters. <\/p><\/dc:description><dc:publisher>\n        IOP PUBLISHING LTD<\/dc:publisher><dc:date>\n        2003-11-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1216\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Carey, JD, Ong, LL and Silva, SRP  (2003) Formation of low-temperature self-organized nanoscale nickel metal islands   NANOTECHNOLOGY, 14 (11), PII S0.  pp. 1223-1227.      <\/dc:identifier><dc:relation>\n        10.1088\/0957-4484\/14\/11\/011<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1216\/","10.1088\/0957-4484\/14\/11\/011"],"year":2003,"topics":[],"subject":["Article","NonPeerReviewed"],"fullText":"Formation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \n \nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands \n \nJ. D. Careya), L. L. Ong and S. R. P. Silva \nAdvanced Technology Institute, School of Electronics and Physical Sciences, \nUniversity of Surrey, Guildford, GU2 7XH, United Kingdom. \n \n \nAbstract \nThe growth and evolution of nanometer sized Ni metal islands deposited under low temperature \nnon-UHV conditions as a function of metal layer thickness, growth temperature and time is \nreported.  The temperature of formation of the islands has been intentionally kept low for possible \napplications in flat panel display technology and also to act as a catalyst for carbon nanotube \ngrowth.  It is shown that the size and distribution of the islands depends critically on the anneal \ntemperature and initial metal layer thickness. The mechanism of formation of the islands is \ndescribed in terms of an Ostwald ripening mechanism of mass transport of either weakly bound \nindividual Ni atoms or smaller clusters into larger more dispersed clusters.   \n  \n \n \n \n \n \n \na) Electronic mail: David.Carey@surrey.ac.uk \n 1\nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \n1. Introduction  \nThe study of the self-assembly of nanometer sized metal and semiconductor islands has become \nparticularly important in recent times as an attractive method for producing intrinsic nanoscale \ndevices without the need for expensive lithography. Intrinsic limits imposed by the wavelength \nused in conventional deep UV lithography make this technique unsuitable for nanoscale device \nfabrication.  This leaves predominantly electron beam direct write-based fabrication techniques to \ndefine nanometer scale structures. E-beam techniques are expensive, time-consuming and \ngenerally have a lower throughput of devices.  It also requires the need for the substrates to be \nconducting which adds a further constraint to possible material systems that can be employed. By \ncontrast, self-assembly on semiconductor surfaces is now well established allowing the production \nof regular arrays of structures such as quantum wells, wires and dots. [ 1 ] Oxide based \nnanostructures grown using self-organisation have also been reported from a range of metals such \nas Pd, Ir, Fe and Co. [2]  Nanometer sized barrier controlled devices which exhibit quantum \nconductance in metal-insulating-metal tunnel diodes have been fabricated through the use of \ncurrent conditioning of metal oxides. [3]  In addition, there has been considerable interest in using \nmetals on oxides for applications in heterogeneous catalysis where the size distribution, shape and \nwetting properties of the metal overlayer are important. Most of the research in this area has \nlargely proceeded in terms of monolayer and sub-monolayer deposition under UHV conditions \nwith particular emphasis on the electronic surface chemistry involved. [ 4 ]  Metal-on-oxide \ndeposition is now emerging in the field of large area electronic applications that do not require  \nUHV conditions where it is important to know what is the most likely topology of the surface that \nis produced as well as the ability to produce such surfaces over large areas and ideally at low \ntemperatures. Temperature considerations are important since it is well known that heating \ndeactivates many metal-on-oxide catalysts with surface reduction often occurring after annealing \nunder UHV conditions above 725 K having been reported. [4]   \n 2\nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \nOne of the key aspects for technological applications is the need to be able to design the \nsize and distribution of the nanoscale features that will be present. For example, it is advantageous \nto attempt to produce the same regular arrays of nanometer sized transition metal (TM) islands \nwhich can then act as catalyst template sites for the growth of carbon nanotubes (CNTs) [5], which \nthemselves have already been demonstrated as efficient electron sources in flat panel displays \n(FPD). [6] However, to date most CNT growth has proceeded by making use of metal catalysts \nannealed at high temperatures or in the form of powders making cleaning and adhesion to \nsubstrates problematic. Bower and co-workers [7] showed that thin films of sputtered cobalt could \nbe used to produce metal islands to act as catalyst particles for CNT growth.  In that study, the Co \nsubstrates were heated to 825oC for CNT growth. High temperature (725oC) treatment was also \napplied to the magnetron sputtered Ni films by Chhowalla and co-workers. [8] In both these \nstudies high temperatures were needed to facilitate the growth of the CNTs, however, a recent \nstudy has shown that carbon nanofibers, with a mean diameter of 45 nm, can be grown at room \ntemperature over large areas using 4-7 µm (grain size) Ni catalysts particles. [9]  Growth was also \nreported up to 250oC and in this temperature range nm sized Ni acted as a catalyst in the ‘tip \ngrowth’ process. In this process the balance between C surface diffusion around the Ni particle and \nbulk diffusion through the particle is an important consideration. [10] Growth in both cases was by \nthe lifting-off of nm sized Ni catalyst from the Ni particle in a rf plasma enhanced chemical vapour \ndeposition (PECVD) system. Low temperature growth of carbon nanotubes has also been recently \nreported using a dc PECVD system. [11]  Nickel films of 6 nm thickness deposited using \nmagnetron sputtering on a SiO2 substrate were patterned using a transmission electron microscope \ngrid as a shadow mask and also by using electron beam lithography.  The former method produced \nlarge feature sizes (~10 µm) whereas 100 nm features were produced using the latter patterning \ntechnique. The two recent observations of growth at such low (macroscopic) temperatures points \nto the need for methodologies for the lower temperature formation of nm sized Ni islands and an \n 3\nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \nexamination of their formation process without need for complicated lithography or the problems \nassociated with residual catalyst particles. The size of the resultant catalyst sites of determines the \ngrowth properties of the CNTs themselves. An important consideration for a suitable catalyzed \nsubstrate is the ability to scale up the catalyst templates to macroscopic dimensions to a desired \nsize for large area applications, such as field emission displays (FEDs). With a FED application in \nmind, optimizing the growth of Ni island substrates is important for temperatures below 500oC \nsince it is above these temperatures that the glass used in conventional large area displays begins to \nsoften. The growth of these islands is not confined to acting as catalyst sites for growth of CNTs \nalone with the natural protrusions themselves acting as a substrate on which a cathode material \nmay be deposited. The cathode material, such as amorphous carbon thin films, will take the shape \nof the substrate and the size and shape of the islands can act as sources of geometric field \nenhancement allowing electron emission at low applied electric fields. [12]  In this paper the \ngrowth of nanoscale Ni islands as a function of temperature and film thickness is reported under \nnon-UHV conditions. We show that it is possible by changing the metal layer thickness, \ntemperature and growth time to alter the diameter and separation between the islands.  \n \n2. Experimental details \nSubstrates of n-Si were initially cleaned using a standard 3 stage ultrasonic solvent clean (acetone, \nmethanol and isoproponal) and deionised water. A thin layer of Ti was evaporated on the \nsubstrates by heating Ti metal wire of known length in a suitable crucible in a vacuum of 5 x 10-6 \nmbar. The films were then subsequently annealed in air to form TiO2 by annealing for 30 minutes. \nRutherford backscattering spectroscopy was used to confirm the composition of the film. The \noxide thickness is measured by having previously masked off part of the substrate and monitored \nusing atomic force microscopy (AFM). The AFM images of the surface were taken using an \nambient Digital Instrument Nanoscope IIIa operating in tapping mode.  Typical scan sizes were 4 \nµm x 4 µm using a Digital Instrument J scanner.  Ni films (whose thickness was determined by \n 4\nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \nAFM) were then evaporated using high purity Ni wire of known length and subsequently annealed \nunder flowing N2 at temperatures from 300oC up to 500oC for times of 10, 30 and 60 minutes.  It \nshould be noted that the Ti and Ni evaporation times are not the same and the evaporation are \nperformed for sufficient time to ensure that all the wire is used. The surface morphology of the \nfilms is monitored using the AFM.  Statistical analysis of the resulting metal islands was \nperformed using the associated AFM software. Care was taken to ensure that only clusters were \nincluded in the AFM analysis using the methods available in the software.    \n \n3. Results and discussion \nHigh resolution AFM measurements of the unannealed Ni films with a thickness of 8 nm (not \npresented here) show that the surface of the film to be extremely flat.  In general, there are three \nways in which metal films can grow on an oxide layer, the mechanism of which depends critically \non the affinity of the metal to react with oxygen [12]. Metals which possess high heats of \nformation of the oxide react strongly with the substrate and produce flat ‘wetting layers’.  Further \ndeposition of the metal results in 2D layer-by-layer growth (Frank-van der Merwe growth) (Fig. \n1(a)) up until a critical thickness beyond which it is favourable for the accumulated elastic strain in \nthe metal film to be relaxed to form dislocations. However, the strain energy can be lowered at a \nlower film thickness through the formation of discrete 3D islands via the so-called Stranski-\nKrastanow (S-K) growth mode (Fig. 1(b)).  Weaker metal-substrate interactions are observed for \nthe less reactive metals such as the noble metals.  In this case wetting of the substrate does not take \nplace and agglomeration of the metal into 3D islands immediately takes place, Fig. 1(c). This is \nknown as the Volmer-Weber growth mode. [13]  The first row transition metals bridge the gap \nbetween the strongly and weakly interacting metals with the metals to the left of iron being \nconsidered as ‘more reactive’ metals. The heats of formation of the oxide, –∆H, are for Ti 501 kJ \nper mol of O atoms (~5.2 eV) whereas that of Ni is 241 kJ per mol (~2.49 eV). [12] Since the \nvalue of –∆H for Ni is about half that of Ti the growth of Ni on a TiO2 will result in little \n 5\nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \ninteraction with the substrate. This weak interaction of the Ni with the oxide has a number of \nimportant consequences. The low value of –∆H is important in determining if there will be a thin \nelectron reduced surface layer.  It is know that the thickness of a reduced TiOx layer at the \nmetal\/TiO2 interface decreases as the magnitude of the heat of formation decreases. Diebold and \ncolleagues noted that ~4 monolayers (ML) of reduced Ti are found at the Hf\/TiO2 interface where  \n–∆H per metal-oxygen bond is 5.8 eV. This decreased to ~1 ML in the Cr\/TiO2 system (–∆H = 3.5 \neV) and 0.4 ML for Fe\/TiO2 (-∆H = 2.8 eV). No reduced layer was observed in the Cu\/TiO2 \nsystem for which –∆H is 1.7 eV. [14]  Since the value of –∆H for Ni is 2.49 eV, intermediate \nbetween Cu and Fe it is not expected that a significant reduced TiOx layer will be formed.  In this \nway the study of Ni based layers is therefore interesting in its own right since it is at the interface \nbetween the strongly and weakly reacting metals. Furthermore the properties of as-deposited metal \nover layers are typically far from equilibrium and cannot be completely understood solely from \nthermodynamic factors. For example, the surface free energy oxides is lower than that of metals \nwhich would mean that all layers should form islands. Kinetic factors which effect mass transport \nand surface diffusion of material are therefore an important consideration.  \nIn Fig. 2 the evolution of the surface morphology of a series of Ni films with an initial \nmetal thickness of 8 nm annealed for 30 mins as function of annealing temperature from 300oC to \n500oC (table 1, samples 1-3) is shown.  The morphology of the Ni film annealed at 300oC shows \n(Fig 2.(a)) evidence for the formation of small closely islands and an average diameter of 80 nm.  \nAnnealing at 400oC the film morphology changes with the formation of larger islands, with a mean \ndiameter of 114 nm coupled with a larger inter-island spacing.  Finally, after annealing at 500oC \nlarge diameter islands (average diameter of 306 nm and a standard deviation of 97 nm)  can be \nseen in Fig. 2(c),  The resultant islands are also more isolated from each other.  The results shown \nin Fig. 2 demonstrate that annealing at successively higher temperatures results in the formation of \nisolated large diameter islands at the expense of smaller close packed islands.  Taking the room \n 6\nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \ntemperature lattice constant of Ni to be 0.352 nm and that of the tetragonal TiO2 surface to be \n0.649 nm in the a direction and 0.296 nm in the c [001] direction [14] shows that the room \ntemperature strains are εa  = –45% and εc = +19%, respectively.   This means that the deposition of \nNi on TiO2 results in a high degree of compressive strain in the c direction and tensile stain in the a \ndirection.  This stain energy is not substantially reduced since the coefficients of linear expansion \n[15] for Ni (13.4 x 10-6 K-1) and TiO2 (7.14 x 10-6 K-1 in the a direction and 9.19 x 10-6 K-1 in the c \ndirection) are similar. The effect of annealing at high temperatures is to allow mass transport of \neither individual Ni atoms or small clusters across the surface in which larger clusters could be \nformed out of smaller clusters in a process analogous to Ostwald ripening. Evidence for Ostwald \nripening effects was also observed for Cu overlayers on TiO2 where it was also noted the \nactivation energy for diffusion of atoms will be of the order of 5-20% of the binding energy of an \natom to its surface. Since both Ni and Cu have low interactions with the TiO2 surface, as explained \npreviously,  low barriers for diffusion would be predicted. [16] In the study of Cu on TiO2 in \nreference 15, using X-ray photoemission spectroscopy, a value for the activation energy for the \ndiffusion of only 0.13 eV was measured.  The increase in the standard deviation of the cluster \ndiameter, table 1, as a function of annealing temperature is also consistent with a surface diffusing \nmechanism, since the size of an island will depend on the ability of Ni to be locally gathered from \none site to a growing cluster.  Further confirmation of a surface diffusion hypothesis leading to \nlarger islands can be found from the examination of the island density presented in table 1.  On \nthermal annealing the density of islands decreases from 32.6 µm-2 at 300oC (sample 1) by over an \norder of magnitude after annealing at 500oC (sample 3).  \n It is known that the initial thickness of the metal film can play an important role in \ndetermining surface morphology at a given temperature. [2,7]  We have examined the influence of \nusing a thinner (less than 8 nm) initial Ni thickness to investigate this effect. Figure 3 shows the \nsurface morphology of two films (samples 4 and 5) annealed at 400oC for 30 mins having an initial \n 7\nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \nNi thickness of (a) 3 nm and (b) 5 nm, respectively. From Fig. 3(a) it is apparent that there is some \nevidence of island growth for an initial Ni thickness of 3 nm with a mean diameter of 67 nm.  At 5 \nnm metal thickness larger islands (mean diameter 89 nm) are formed but this process is \naccompanied by an increase in the standard deviation of the island diameters.  \n Finally, we have also investigated the effects of different annealing times.  The samples \npreviously discussed were all annealed for 30 minutes at their respective temperatures and Ni layer \nthickness. For films with a Ni thickness of 5 nm we found that even after 10 minutes (sample 6), \nevidence of island formation present (Fig. 4 (a)).  Island coverage was improved after a 30 minute \nanneal as reported previously reported in Fig. 3(b) for sample 5. In the case of a 60 minute anneal \n(sample 7) much more uniform island coverage can be seen consistent with the mass transport \nOstwald ripening mechanism discussed previously.    \nFrom these results we conclude that the two most important aspects in producing Ni islands \nare the annealing temperature and initial Ni layer thickness.  Annealing at higher temperatures \nproduces larger diameter islands though further apart from one another. The weak interaction \nbetween the Ni and the oxide layer results in a low activation energy barrier to Ni migration which \nresults in larger islands forming from smaller islands or weakly bound individual Ni atoms.  As the \nNi cluster get larger they become more dispersed which may be an important in the growth of \nvertically aligned CNTs in which the presence of nearby tips can increase onset fields due to \npartial field screening. [17] A similar effect would also occur if the islands are templates for large \narea field emission arrays.  \n \n4. Conclusion \nIn conclusion, we have shown that it is possible to produce nanometer sized Ni islands by choosing \nthe correct initial Ni thickness, annealing temperature and annealing time. It is found that the two \nmost crucial factors are the annealing temperature and initial Ni thickness. For closely spaced \nisland formation an optimum annealing temperature of 400oC was observed once the Ni thickness \n 8\nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \nwas 5 nm or above.  For annealing at 500oC coalescence of surface atoms though diffusion results \nin larger well spaced islands.  The mechanism for island growth and possible applications to large \narea field emission arrays and catalysts sites for low temperature CNT have been discussed.   \n \nAcknowledgements \nJDC would like to acknowledge the EPSRC for the award of an Advanced Research Fellowship \nthrough grant GR\/R76288. The authors would also like to thank Dr W.T. Young for performing \nthe Rutherford Backscattering Spectroscopy measurements.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 9\nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \n \nReferences \n1   S. Facsko, T. Dekorsy, C. Koerdt, C. Trappe, H. Kurz, A. Vogt, and H.L. Hartnagel, Science \n285, 1551 (1999). \n2   S. Aggarwal, S. B. Ogale, C. S. Ganpule, S. R. Shinde, V. A. Novikov, A. P. Monga, M. R. \nBurr,  R. Ramesh, V. Ballarotto, and E. D. Williams, Appl. Phys. Lett. 78, 1442 (2001).  \n3   T. Schmidt, R. Martel, R.L. Sandstrom and P. Avouris, Appl. Phys. Lett. 73, 2173 (1998).  \n4    R.E. Tanner, I. Goldfarb, M.R. Castell and G.A.D. Briggs, Surface Science 486, 167 (2001).  \n5   M. Endo, K. Takeuchi, K. Kobori, K. Takahashi, H. Kroto, A. Sarkar,  Carbon  33, 873 (1995). \n6   W. B. Choi, D. S. Chung, J. H. Kang, H. Y. Kim, Y. W. Jin, I. T. Han, Y. H. Lee, J. E. Jung, N. \nS. Lee, G. S. Park, and J. M. Kim, Appl. Phys. Lett. 75, 3129 (1999). \n7   C. Bower, O. Zhou, W. Zhu, D.J. Werder, and S. Jin, Appl. Phys. Lett. 77, 2767 (2000).  \n8   M. Chhowalla, K. B. K. Teo, C. Ducati, N. L. Rupesinghe, G. A. J. Amaratunga, A. C. Ferrari, \nD. Roy, J. Robertson, and W. I. Milne, J. Appl. Phys. 90, 5308 (2001). \n9   B.O. Boskovic, V. Stolojan, R. Khan, S. Haq and S.R.P. Silva, Nature Materials 1, 165 (2002).  \n10   O. A. Louchev, Y. Sato and H. Kanda, Appl. Phys. Lett. 80, 2752 (2002).  \n11  S. Hofmann, C. Ducati, and J. Robertson  and B. Kleinsorge,  Appl. Phys. Lett. 83, 135 (2003). \n \n12   J. D. Carey, R. D. Forrest and S. R. P. Silva, Appl. Phys. Lett. 78, 2339 (2001). \n13  See, for example, The Surface Science of Metal Oxides, V. E. Henrich and P. A. Cox, \nCambridge University Press, Cambridge, 1994, Chapter 5. \n14   U. Diebold, J.-M. Pan and T.E. Madey, Surface Science 331-333, 845 (1995).  \n15   G. W. C. Kaye and T. H. Laby in Tables of physical and chemical constants, Longman, \nLondon, UK, 15th edition, 1993. \n16  U. Diebold, J.-M. Pan and T.E. Madey, Phys. Rev. B. 47, 3868 (1993).  \n17   L. Nilsson, O. Groening, C. Emmernegger, O. Kuettel, E. Schaller, L. Sclapbach, H. Kind, J-\nM. Bonard and K. Kern, Appl. Phys. Lett. 76, 2071 (2000). \n 10\nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \n \n \nTable 1: Sample growth conditions and AFM characteristics \n \n \nSample Initial Ni \nthickness \n(nm) \nAnneal \nTemperature \n(oC) \nAnneal \nTime \n(mins) \nMean \ndiameter \n(nm) \nStandard \nDeviation \n(nm) \nIsland \ndensity \n(µm-2) \nAFM \nimage \n1 8 300 30 80 51 32.6 Fig. 2a \n2 8 400 30 114 67 15.6 Fig. 2b \n3 8 500 30 306 97 2.3 Fig. 2c \n4 3 400 30 67 40 27.2 Fig. 3a \n5 5 400 30 89 72 22.4 Fig. 3b \n6 5 400 10 71 57 36.6 Fig. 4a \n7 5 400 60 85 61 25.8 Fig. 4b \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 11\nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \n \nFigure captions \n \nFigure 1.  Schematic representation of the different metal – oxide growth modes showing initially \nwetting behaviour and subsequent metal deposition for (a) 2D Frank-van der Merwe layer-by-layer \ngrowth (b) Stranski-Krastanow growth mode with 3D island formation above a 2D layer beyond a \ncritical layer thickness and (c) 2D Volmer-Weber growth mode with no wetting layer deposited.   \n \nFigure 2.  AFM images of 8 nm thickness of Ni evaporated films isochronally annealed for 30 \nmins at (a) 300oC, (b) 400oC and (c) 500oC.  Note the change in vertical scale between images.  \n \n \nFigure 3.  AFM images of (a) 3 nm and (b) 5 nm Ni evaporated films isothermally annealed at \n400oC for 30 mins. Note the change in vertical scale between images.  \n \nFigure 4.  AFM images of a 5 nm Ni evaporated film annealed at 400oC for (a) 10 minutes and (b) \n60 minutes.  The AFM image of the film annealed for 30 minutes has been presented in Fig. 3(b) \nand the same scale bar is used between the images.     \n \n \n \n \n \n \n \n \n 12\nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \n \n \n \nLayer-by-layer\nFrank-van der Merwe\ngrowth\nStranski-\nKrastanow growth\nVolmer-Weber\ngrowth \nContinued \ndeposition\nInitial deposition\n \n \n \n \n \n \n \n \nFigure 1 \n 13\nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \n \n0\n1\n3\n4  µm\n2\n0.0 nm\n10.0 nm\n20.0 nm\n0\n1\n3\n4  µm\n2\n0.0 nm\n100.0 nm\n200.0 nm\n0.0 nm\n30.0 nm\n60.0 nm\n0\n1\n3\n4  µm\n2\n(a)\n(b)\n(c)\n \nFigure 2 \n 14\nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \n \n \n0\n1\n3\n4  µm\n2 0.0 nm\n40.0 nm\n80.0 nm\n0\n1\n3\n4  µm\n2\n140.0 nm\n70.0 nm\n0.0 nm\n(a)\n(b)\n \n \n \n \n \nFigure 3 \n 15\nFormation of Low Temperature Self-Organized Nanoscale Nickel Metal Islands    \n \n0\n1\n3\n4  µm\n2\n0\n1\n3\n2\n140.0 nm\n70.0 nm\n0.0 nm\n140.0 nm\n70.0 nm\n0.0 nm\n(a)\n(b)\n4  µm\n \n \nFigure 4 \n 16\n"}