{"doi":"10.1016\/j.geoforum.2005.12.002","coreId":"71733","oai":"oai:eprints.lancs.ac.uk:436","identifiers":["oai:eprints.lancs.ac.uk:436","10.1016\/j.geoforum.2005.12.002"],"title":"Geographies of Environmental Justice.","authors":["Walker, Gordon P","Bulkeley, Harriet"],"enrichments":{"references":[{"id":16460539,"title":"Adaptation to climate change in the developing world,","authors":[],"date":"2003","doi":"10.1191\/1464993403ps060oa","raw":"Adger, N., Huq, S., ,Brown, K., Conway, D. and Hulme, M. (2003) Adaptation to climate change in the developing world, Progress in Development Studies, 3 (3): 179-195 Agyeman, J., Bullard, R. D. and Evans, B. (2003) Just Sustainabilities: development in an unequal world, Earthscan, London Agyeman, J. & Evans, B. (2004) Just sustainability: the emerging discourse of environmental justice in Britain?, The Geographical Journal, 170(2), pp. 155–164.","cites":null},{"id":16460586,"title":"Addressing Environmental Inequalities: Flood Risk, Environment Agency,","authors":[],"date":"2006","doi":null,"raw":"Walker, G., Burningham, K., Fielding, J. and Smith, G. (2006) Addressing Environmental Inequalities: Flood Risk, Environment Agency, Bristol.","cites":null},{"id":16460591,"title":"Commission on Environment and Development","authors":[],"date":"1987","doi":"10.1016\/0959-3780(90)90012-x","raw":"WCED (World Commission on Environment and Development) (1987) Our Common Future, Oxford University Press, Oxford.","cites":null},{"id":16460580,"title":"Environmental Justice: rights and mean to a healthy environment for all, Special Briefing Paper 7, ESRC Global Environmental Change Programme Swyngedouw,","authors":[],"date":"2001","doi":null,"raw":"Stephens, C., Bullock, S. and Scott, A. (2001) Environmental Justice: rights and mean to a healthy environment for all,  Special Briefing Paper 7, ESRC Global Environmental Change Programme Swyngedouw, E. and Heynen, N. (2003) Urban political ecology, justice and the politics of scale, Antipode 35 (5), 898-918 Walker, G. P., Mitchell, G., Fairburn, J. and Smith, G. (2005a) Industrial pollution and social deprivation: evidence and complexity in evaluating and responding to environmental inequality, Local Environment, 10(4), pp 361-377 Walker, G. P., Fay, H. and Mitchell, G. (2005b) Environmental Justice Impact Assessment: an evaluation of requirements and tools for distributional analysis, a report for Friends of the Earth England and Wales, FoE, London.","cites":null},{"id":16460574,"title":"Moral progress in human geography: transcending the place of good fortune,","authors":[],"date":"2000","doi":"10.1191\/030913200671792325","raw":"Smith, D. (2000) Moral progress in human geography: transcending the place of good fortune, Progress in Human Geography, 24 (1): 1-18.","cites":null},{"id":16460561,"title":"Race, class and the global politics of environmental inequality,","authors":[],"date":"2005","doi":"10.1162\/1526380054794835","raw":"Newell, P. (2005) Race, class and the global politics of environmental inequality, Global Environmental Politics, 5 (3): 70-94 Pelling, M. (2005) The Vulnerability of Cities: natural disasters and social resilience, Earthscan, London.","cites":null},{"id":16460569,"title":"Reconceiving environmental justice: global movements and political theories,","authors":[],"date":"2004","doi":"10.1080\/0964401042000229025","raw":"Scholsberg, D. (2004) Reconceiving environmental justice: global movements and political theories, Environmental Politics, 13 (3): 517-540.","cites":null},{"id":16460553,"title":"Securing the Future: Delivering the UK Sustainable Development Strategy, London: The Stationary Office","authors":[],"date":"2005","doi":null,"raw":"DEFRA (2005) Securing the Future: Delivering the UK Sustainable Development Strategy, London: The Stationary Office Dobson, A. (1998) Justice and the environment: conceptions of environmental sustainability and dimensions of social justice, Oxford University Press, Oxford Dunion, K. and Scandrett, E. (2003) The campaign for environmental justice in Scotland as a response to poverty in a northern nation, in J Agyeman , R Bullard and B Evans (eds) Just Sustainabilities: development in an unequal world, Earthscan, London Debbané, A. and Keil, R. (2004) Multiple disconnections: environmental justice and urban water in Canada and South Africa, Space and Polity , 8 (2): 209-225.","cites":null},{"id":16460557,"title":"The Scalar Production of Injustice within the Urban Forest, Antipode,","authors":[],"date":"2003","doi":"10.1111\/j.1467-8330.2003.00367.x","raw":"Heynen N. C. (2003) The Scalar Production of Injustice within the Urban Forest, Antipode, 35 (5) 980-998 Ikeme, J. (2003) Equity, environmental justice and sustainability: incomplete approaches to climate change politics, Global Environmental Change 13: 195-206 Low, N. and Gleeson, B. (1998) Justice, society and nature: an exploration of political ecology, Routledge. London Lucas, K., Walker, G., Eames, M., Fay, H., and Poustie, M. (2004) Environment and Social Justice: Rapid Research and Evidence Review, Sustainable Development Research Network, Policy Studies Institute, London.","cites":null},{"id":16460545,"title":"Wasting women: the environmental justice of including women in municipal waste management,","authors":[],"date":"2005","doi":"10.1080\/13549830500160974","raw":"Buckingham-Hatfield, S., Reeves, D. and Batchelor, A. (2005) Wasting women: the environmental justice of including women in municipal waste management, Local Environment, 10(4), pp 427-444 Chalmers, H. and Colvin, J. (2005) Addressing Environmental Inequalities in UK Policy: an action research perspective, Local Environment, 10(4), pp. 333-360.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-03-10","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71733.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/436\/2\/Microsoft_Word_%2D_geoforum_EJ_editorial6final.pdf","pdfHashValue":"3a9727ef3763f4a29016aac35be9c9f43b44f262","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:436<\/identifier><datestamp>\n      2018-01-24T03:12:15Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D47:4731<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Geographies of Environmental Justice.<\/dc:title><dc:creator>\n        Walker, Gordon P<\/dc:creator><dc:creator>\n        Bulkeley, Harriet<\/dc:creator><dc:subject>\n        G Geography (General)<\/dc:subject><dc:date>\n        2006-03-10<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/436\/2\/Microsoft_Word_%2D_geoforum_EJ_editorial6final.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.geoforum.2005.12.002<\/dc:relation><dc:identifier>\n        Walker, Gordon P and Bulkeley, Harriet (2006) Geographies of Environmental Justice. Geoforum, 37 (5). pp. 655-659.<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/436\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/j.geoforum.2005.12.002","http:\/\/eprints.lancs.ac.uk\/436\/"],"year":2006,"topics":["G Geography (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Geographies of Environmental Justice  \n \nThe concept of environmental justice, from its earliest emergence in the civil rights \npolitics of the United States, has always been intensely geographical. The legal and \npolitical contestation of proposals to site polluting and toxic facilities in \npredominantly poor and black communities, which formed the central political \nmobilisation of the US environmental justice movement, focused on questions of \ndistribution, inequality and injustice which resonate with long standing traditions of \ngeographical enquiry and analysis. The body of US based literature on environmental \njustice contains substantial contributions by geographers, including multiple empirical \nstudies of patterns of location of industrial and waste sites, historical research on \nprocesses of co-evolution of urban and industrial development, and analysis of \nenvironmental justice activism in general and in particular settings.  Not surprisingly \nmuch of this work has been framed by the particularities of environmental justice in \nthe US. Whilst there are significant exceptions, attention has predominantly been \ngiven to the socio-spatial distribution of pollution and ‘toxicity’ within US national \nborders, to the politics of race and civil rights, and to policy responses to accusations \nof environmental racism in facility siting.  \n \nHowever, the terminology of environmental justice has now travelled beyond the US \nand the sites of grassroots activism within which it originated. Whilst retaining its \npotency in relation to grassroots and everyday struggles against injustice at multiple \npolitical sites (Dunion and Scandrett 2003; Schlosberg 2004), this ‘fast conceptual \ntransfer’ (Debbane and Keil 2004: 209) has taken place mainly within political and \nacademic elites. Principles of environmental justice have as a consequence begun to \nfeature within policy rhetoric and the work of mainstream institutions operating in \nvaried places and at different scales of governance. For example, in the UK \nenvironmental justice (or, frequently ‘environmental inequality’ or ‘environment and \nsocial justice’, the terminological significance of which may serve do particular \npolitical work in terms of what is included in the politics of justice and the \nenvironment) has been included in the strategic priorities of the main environmental \nregulatory agency, the Environment Agency (Chalmers and Colvin 2005), and \nfeatures repeatedly within the new national strategy for sustainable development, \nSecuring the Future (DEFRA 2005). In South Africa, principles of environmental \njustice have been bought into the mainstream through their inclusion in the \nConstitution (Patel, this volume), and within the negotiations and documentation of \nmultilateral environmental agreements, principles of equity and justice frequently \nsurface (Okereke, this volume).  \n \nIn breaking away from its origins and initial framing in the US, the concept of \nenvironmental justice is evolving to become broader in scope and more encompassing \nin the sites, forms and processes of injustice it is concerned with. In becoming more \nglobalised, the environmental justice agenda is extending into questions of \ndistribution both between and across nation-states (Stephens et al 2001; Newell 2005), \nand into very different political, cultural and economic environments (Ageyman et al, \n2003).  Justice ‘to whom’ is being cast in more inclusive terms to include, for \nexample, differences of gender, age and the rights of future generations (Buckingham-\nHatfield et al 2005; Dobson 1998). Notions of the environment have similarly \nbroadened to include access to environmental goods and resources such as water, \nenergy and greenspace (Lucas et al 2004, Heynen 2003) and the threat of ‘natural’ as \nwell as technologically produced risks, interfacing here with ‘vulnerability’ literatures \n(Walker et al 2006; Adger et al. 2003; Pelling 2005) \n \nWhilst opening up new pathways for activism, academic analysis, and institutional \nintervention, a dynamic and expansive environmental justice agenda also raises many \nchallenges. This special issue of Geoforum considers such challenges and their \nimplications by explicitly focusing on arenas within which environmental justice has \nto date been relatively unexplored. First presented at a session on environmental \njustice organised by the Planning and Environment Research Group of the Royal \nGeographical Society\/Institute of British Geographers at the International \nGeographical Congress, held in Glasgow in August 2004\n1\n, the papers demonstrate the \nresurgence of critical concern with issues of environmental justice, and broader issues \nof (in)justice and (in)equality, within the geographical imagination. In exploring the \nvaried geographies of environmental justice, the papers take on board the need to \nexamine the evolution and application of the concept outside of the narrow confines \nof the US, and beyond western liberal notions of environment and justice. To this end, \n                                                \n1\n Other papers from the conference session concerned specifically with the UK context have been \npublished in Local Environment: the International Journal for Justice and Sustainability, 10 (4).  \neach of the papers is seeking a critical engagement with the use of an environmental \njustice framework. They do so in different post-colonial political and cultural contexts \n- India, Ireland, South Africa, Australia, Singapore - and at different scales of \narticulation extending from the particular local case, through to institutions of \ninternational environmental governance.  \n \nIn setting the scene for these discussions, in the remainder of this editorial we \nconsider three particular challenges for the development of (geographical) research on \nenvironmental justice: first, how questions of terminology, meaning and definition \nmay be addressed; second, the connections between environmental justice and \nsustainability; and finally, how notions of environmental justice must confront issues \nof multiplicity and diversity.   \n \nEnvironmental justice and inequality \n \nDespite the long history of theoretical discussion over the term justice and all that it \nimplies, the notion of environmental justice, in part reflecting its roots in a social \nmovement, has been subject to less intensive interrogation and definitional precision. \nThe way in which the notion of environmental justice has been deployed has been \nmore as an instinctive gut reaction than as a closely argued concept. There are, of \ncourse, some extensive and rigorous treatments (e.g. Dobson 1998;  Low and Gleeson \n1998), but in the main the impulse has been to call for environmental justice as a \nresponse to perceived injustice, as judged through observations of unreasonable \ninequality in outcome and lack of ‘fair treatment’ for, in particular, people and social \ngroups that are already marginalised and disadvantaged.  \n \nGiven that there are some shared, common sense understandings of environmental \ninjustice\/justice, further conceptual deliberation and clarification may not be all that \nuseful. On the other hand, as the concept breaks free from its initial moorings and is at \nonce translated into other political sites of intervention and taken up within \nmainstream political institutions, exploring critically its varied meanings and keeping \nhold of a (radical) sense of justice may be important.  \n \nSeveral of the papers in this issue take some time to consider the meaning of justice in \nan environmental context, demonstrating the complexities and diversity of \nperspectives that can be adopted and recruited for strategic purposes.  It we take the \nidea of environmental justice as equality the “familiar and crucial practical question \n… equality of what is raised. Should it be opportunities (after liberal convention), \nprimary goods (after Rawls), resources (after Dworkin), capabilities (after Sen) or \nwelfare outcomes?” (Smith 2000: 6). In the main, much of the attention initially given \nto environmental justice adopted a consequential focus on (in)equality of outcomes, \nthat is of the distribution of environmental risks (Schlosberg 2004). There are, \nhowever, concerns about a language of justice based on the premise of distributional \nequality. First, in relation to environmental risks, this logically could be addressed by \nthe even sharing of environmental burdens rather than by addressing any of the route \ncauses of environmental problems (Dobson, 1998). Second, given that much of the \nenvironment, when broadly defined, is inherently and sometimes uniquely distributed \ninto particular places and cannot sensibly be experienced equally or uniformly, it can \nbecome positively perverse to be seeking its ‘even’ distribution (whatever that might \nmean). In this sense, an unequal distribution of environmental goods or bads by itself \nmay not necessarily be unjust  (Walker et al 2005a) – it is rather the ‘fairness’ of the \nprocesses through which the distribution has occurred and the possibilities which \nindividuals and communities have to avoid or ameliorate risk, or to access \nenvironmental resources, which are important.  In part for these reasons, both within \nmovements for environmental justice and in academic discourse, alternative notions \nof justice have been deployed, in terms of both ‘recognition’ (Schlosberg 2004) and \nparticipation in the processes through which decisions about exposure to risks and \naccess to resources take place.  \n \nThere is much to be debated here, but, we would argue, no necessity to pursue an \nagenda of absolute definitional precision and commonality of perspective.  Whilst \nIkeme (2003; 195) appeals for conceptual clarity and a ‘unifying framework’, the \nethical and ideological character of justice theory can only serve to maintain plurality \nand alternative perspectives are likely to be more or less appropriate to different \npractical and analytical contexts (there are further tensions here between universal \nnotions of justice\/rights and justice worked out on the ground in particular places; see \nbelow).  Furthermore, the term ‘equity’, rather unhelpfully, too easily slips in its use \nbetween the descriptive sense of inequality, and the normative sense of justice, \nproviding a further complication for the search for clarity in language and meaning.  \n \nThe papers in this volume ably demonstrate the need to conceive environmental \njustice as a ‘broad church’ within which different notions of justice are encompassed.  \nWilliams and Mawdsly and Davies emphasise process dimensions, considering the \nways in which groups are able to articulate and practise environmental justice \nactivism and take forward agendas, which in turn raise questions of distribution, \naccess and recognition. Hobson, argues that a performative approach can provide an \nalternative way of viewing environmental justice and its role in everyday political \nstruggles. Patel and Okereke both focus on institutions and the ways in which the \negalitarian notions of justice in sustainable development are worked out in practice \nand constrained in turn by technocratic approaches and a neoliberal emphasis on \nmarket efficiency. Hillman suggests that alongside any treatment of the distributional \nand procedural aspects of environmental justice, due consideration must also be given \nto ecological justice – in the form of relationships between the social and natural \nworlds (Low and Gleeson 1998) – and to the ways in which the ‘environment’ is \ndefined in particular social and historical contexts. Not only are multiple dimensions \nof environment and justice invoked across the papers, but their persistent \nentanglement suggests that outside the realms of abstract conceptual debate, \nseparating out the multiple dimensions of justice and environment may both be futile \nand of only limited value.  \n \nEnvironmental justice and sustainability \n \nIn making a journey from its initial conceptualisation, environmental justice has more \ndirectly entered the intellectual and policy territory of sustainable development raising \nquestions of interrelationship and relative utility (Ageyman and Evans 2004). Given \nthat sustainable development provides the meta-narrative for environmental concerns \nit is necessary to ask if the environmental justice vocabulary and analytical lens adds \nanything useful to what is already in place. Is this just a new unhelpful, branding \nwhich begins to take apart the integrative discourse and values of sustainable \ndevelopment? Two key issues are illuminating here. First, whether concepts of justice \nand equity are reconcilable between the two sets of discourses.\n2\n  Second, how notions \nof environmental justice seek to engage with the traditional model of sustainable \ndevelopment as a means through which to engage economic, social and environmental \nconcerns simultaneously.  \n \nIf we look back to the Brundtland Report (WCED 1987) as the primary source of \nconceptualisation of sustainable development, notions of equity and justice are \nfundamental.  The focus on meeting the needs of current and future generations both \ncentres on current inequalities in the meeting of basic needs and establishes the \npursuit of intra and intergenerational equity as key dimensions of future progress \ntowards sustainability. If the ability to live in an environment which meets reasonable \nstandards of quality and tolerable levels of environmental risk is included as a basic \nneed, and one which the Brundtland Report argues is intrinsically necessary for \nmeeting other social needs, then addressing these environmental needs and pursuing \nenvironmental justice is manifestly encompassed within, if not central to, the broader \nframing of sustainable development.   \n \nIn practice, however, from the very earliest stages of implementation, translation and \nre-presentation of the notion of sustainable development, there have been criticisms \nthat equity and justice issues have been downplayed. Nowhere is this perhaps more \napparent than in the continuing tensions over responsibilities and equitable \napproaches to addressing international environmental problems, such as climate \nchange (Okereke, this volume). ‘Weak’ forms of sustainability have been criticised as \ncasting environmental protection in economic terms, whilst ‘strong’ forms of \nsustainability have been seen to neglect the impacts that moves to sustain critical \nenvironmental capital might have on social equity.  In this way, the environmental \nand social dimensions of sustainability have tended to be separately pursued, \nneglecting their interactions and attendant equity and justice implications (Patel, this \nvolume).  When set alongside the failure of environmental movements to engage with \nhow environmental quality is being experienced by marginalised communities at a \n‘doorstep’ level; the possibility that the new participatory and deliberative agenda of \nenvironmental decision-making may be serving to exclude some ‘public’ voices \n                                                \n2\n Within the sustainable development discourse the term equity is typically used rather than justice but, \nas noted above, without a clear definitional distinction \nwhilst privileging others; and the failure of policy appraisal and impact assessment \ntools to consider how environmental change may be socially distributed (Walker et al \n2005b), it is hard to argue that all of the many concerns that there might be about how \nthe environment is regressively socially distributed, the fairness of decision-making \nprocedures and the negative social consequences of environmental policy, have been \nadequately given voice, researched and addressed within the 20-year discourse of \nsustainable development.   \n \nNonetheless, it would be a mistake to view environmental justice as simply plugging \nthis gap. While the discourses and mobilisations of environmental justice provide the \npolitical space to consider the ‘socio-environmental’ aspects of sustainability, \nincluding, for example, issues of fuel poverty, graffiti and vandalism in the UK \n(Lucas et al 2004), or the differentials of water use and water culture in South Africa \n(Debbane and Keil 2004: 222), the agenda is both more far-reaching and more \nfundamental. Rather than being only concerned with the surface manifestations of \nenvironmental injustice, as a political programme environmental justice is concerned \nwith the underlying causes and dynamics of inequities at different scales. Thus, in the \ncontext of the urban, for example, ‘there is no such thing as an unsustainable city in \ngeneral. Rather, there are a series of urban and environmental processes that \nnegatively effect some social groups while benefiting others’ (Swyngedouw and \nHeynen 2003:901). In seeking to understand the causes and consequences of \nenvironmental inequities, and the ways in which they can be addressed, we \nnecessarily confront the relations between the economy, society and the state (Newell \n2005). Rather than providing a further prop to existing notions of sustainable \ndevelopment, in these ways, environmental justice may bring enable new critical \nengagements with the relations between economy, environment and society, and \nilluminate the radical potential of sustainability. As Debbane and Keil (2004:222) \nargue ‘we must remind ourselves of the perhaps most important single aspect of the \nglobal, multiscale environmental justice movement in its various incarnations: its \nfunction to provide a safeguard against the depoliticisation of environmental politics.’  \n \nIn this light, we would argue that the addition of environmental justice as ‘a \nvocabulary of political opportunity’ (Agyeman and Evans, 2004), and a new framing \nfor research and policy attention in which equity is brought to the foreground, is both \nwelcome and necessary. However, it is critical to ensure that as notions of \nenvironmental justice enter into mainstream discourses, the elasticity of the concept \ndoes not mean that it is reduced to the (relatively) comfortable assessment of how \nlocal, visible manifestations of social justice problems can be ‘cleaned up’ and how \nenvironmental law can be more strictly enforced (both of which have been evident in \ngovernmental interpretations in the UK). Rather, in refocusing attention on equity and \ninequity within sustainable development, environmental justice has the potential to \nprovide a productive intellectual and policy space for multidimensional and multi-\nscalar exploration of its many meanings, manifestations and implications.  \n \nEnvironmental justice, multiplicity and diversity \n \nRecognition of the plurality of the meanings and principles of environmental justice \nposes a further challenge to those who seek to identify a set of universal principles of \njustice and sustainability. For some, ‘notions of justice and notions of movements \nlinked to justice struggles are highly diverse and can not be measured or expressed in \nuniversal terms’ (Debbane and Keil 2004: 209). For others, the acceptance of different \nconcepts of justice leads to the kind of relativism which makes any notion of justice in \nthe first instance meaningless (Low and Gleeson 1998). Schlosberg (2004) suggests \nthat an alternative is possible. In recognising the importance of context in shaping \nstruggles for environmental justice, it is argued that by confronting the underlying \nlogics of inequity through multiple sites, a unified, if not uniform, environmental \njustice movement can be forged (Schlosberg 2004: 534). The papers in this volume, \nby taking seriously the difference that different contexts make in shaping discourses \nand practices of environmental inequities, provide insights into the tensions between \nuniversal and particular notions of environmental justice, while Willams and \nMawdsley (this volume) explicitly consider the validity of Scholsberg’s arguments for \nengaging with environmental justice in a post-colonial context.  \n \nAt the same time, engaging with environmental  justice poses significant material \nchallenges for those seeking equity in access to resources and in protection from \nharm. Where the ‘environment of justice’ – be it access to clean air, to water, \nproductive land and so on – is subject to change, assessing what constitutes just \naccess and just protection carries additional conceptual and practical challenges \n(Hillman, this volume). Given that arguments for environmental justice extend across \nspatial and temporal scales, and the complexities of the environmental systems within \nwhich justice is sought, uncertainties about future environmental goods and bads \nprovide another critical issue with which concepts and policies of environmental \njustice have to engage (Hillman, this volume, Okereke, this volume). \n \nThere are also local contingencies in the conditions under which environmental \njustice arguments are and can be evoked within strategies of resistance and activism. \nDavies (this volume) contrasts the lack of environmental justice discourse in the case \nof protests against the siting of an incinerator in Ireland, with the political \nopportunities this could provide in the future through the deployment of scaling-up \nopportunities, linking with other social justice movements and exploiting the rights \nnow enshrined within the Aarhus convention. In the context of the distinctive \ncapitalist state of Singapore, Hobson (this volume) argues that environmental justice \nis implicit and performative in the enactment of environmental care and in micro-\nstruggles over the meanings and uses of space, despite the absence of liberal \ndemocratic institutions and formal opportunities for political activism. In India \nWilliams and Mawdsley (this volume) emphasise various ways in which the \npostcolonial experience shapes and constrains opportunities for pursuing a western \nmodel of environmental justice. They argue that the western model becomes \nparticularly problematic in its faith in a deliberative democracy that will be inclusive \nand afford recognition to all and in the expectation that state action to manage the \nenvironment will be both effective and applied in non-discriminatory ways.  They \nmore generally conclude from their analysis that “regardless of the theoretical lens \nthrough which concepts of injustice are viewed … a close examination of differences \nin the context in which struggles for environmental justice are located is required”  \n \nThis conclusion pervades each of the papers in this volume and provides an important \nintervention in the sometimes too easy movement of ideas, approaches and concepts \nbetween places and contexts. It is also a timely reminder of the need to consider \ngeography in all of its dimensions in the deployment of an environmental justice \ndiscourse and frame of analysis.  \n \nReferences \n Adger, N., Huq, S., ,Brown, K., Conway, D. and Hulme, M. (2003) Adaptation to \nclimate change in the developing world, Progress in Development Studies, 3 (3): 179-\n195 \n \nAgyeman, J., Bullard, R. D. and Evans, B. (2003) Just Sustainabilities: development \nin an unequal world, Earthscan, London \n \nAgyeman, J. & Evans, B. (2004) Just sustainability: the emerging discourse of \nenvironmental justice in Britain?, The Geographical Journal, 170(2), pp. 155–164. \n \nBuckingham-Hatfield, S., Reeves, D. and Batchelor, A. (2005) Wasting women: the \nenvironmental justice of including women in municipal waste management, Local \nEnvironment, 10(4), pp 427-444 \n \nChalmers, H. and Colvin, J. (2005) Addressing Environmental Inequalities in UK \nPolicy: an action research perspective, Local Environment, 10(4), pp. 333-360. \n \nDEFRA (2005) Securing the Future: Delivering the UK Sustainable Development \nStrategy, London: The Stationary Office \n \nDobson, A. (1998) Justice and the environment: conceptions of environmental \nsustainability and dimensions of social justice, Oxford University Press, Oxford \n \nDunion, K. and Scandrett, E. (2003) The campaign for environmental justice in \nScotland as a response to poverty in a northern nation, in J Agyeman , R Bullard and \nB Evans (eds) Just Sustainabilities: development in an unequal world, Earthscan, \nLondon \n \nDebbané, A. and Keil, R. (2004) Multiple disconnections: environmental justice and \nurban water in Canada and South Africa, Space and Polity , 8 (2): 209-225.  \n \nHeynen N. C. (2003) The Scalar Production of Injustice within the Urban Forest, \nAntipode, 35 (5) 980-998 \n Ikeme, J. (2003) Equity, environmental justice and sustainability: incomplete \napproaches to climate change politics, Global Environmental Change 13: 195-206 \n \nLow, N. and Gleeson, B. (1998) Justice, society and nature: an exploration of \npolitical ecology, Routledge. London \n \nLucas, K., Walker, G., Eames, M., Fay, H., and Poustie, M. (2004) Environment and \nSocial Justice: Rapid Research and Evidence Review, Sustainable Development \nResearch Network, Policy Studies Institute, London. \n \nNewell, P. (2005) Race, class and the global politics of environmental inequality, \nGlobal Environmental Politics, 5 (3): 70-94 \n \nPelling, M. (2005) The Vulnerability of Cities: natural disasters and social resilience, \nEarthscan, London.  \n \nScholsberg, D. (2004) Reconceiving environmental justice: global movements and \npolitical theories, Environmental Politics, 13 (3): 517-540.  \n \nSmith, D. (2000) Moral progress in human geography: transcending the place of good \nfortune, Progress in Human Geography, 24 (1): 1-18.  \n \nStephens, C., Bullock, S. and Scott, A. (2001) Environmental Justice: rights and \nmean to a healthy environment for all,  Special Briefing Paper 7, ESRC Global \nEnvironmental Change Programme \n \nSwyngedouw, E. and Heynen, N. (2003) Urban political ecology, justice and the \npolitics of scale, Antipode 35 (5), 898-918 \n \nWalker, G. P., Mitchell, G., Fairburn, J. and Smith, G. (2005a) Industrial pollution \nand social deprivation: evidence and complexity in evaluating and responding to \nenvironmental inequality, Local Environment, 10(4), pp 361-377  \n \nWalker, G. P., Fay, H. and Mitchell, G. (2005b) Environmental Justice Impact \nAssessment: an evaluation of requirements and tools for distributional analysis, a \nreport for Friends of the Earth England and Wales, FoE, London.  \n \nWalker, G., Burningham, K., Fielding, J. and Smith, G. (2006) Addressing \nEnvironmental Inequalities: Flood Risk, Environment Agency, Bristol. \n \nWCED (World Commission on Environment and Development) (1987) Our Common \nFuture, Oxford University Press, Oxford. \n \n"}