{"doi":"10.1068\/a3781","coreId":"92671","oai":"oai:eprints.lse.ac.uk:548","identifiers":["oai:eprints.lse.ac.uk:548","10.1068\/a3781"],"title":"The contradictions and intersections of class and gender in a global city : placing working women's lives on the research agenda","authors":["McDowell, Linda","Perrons, Diane","Fagan, Colette","Ray, Kath","Ward, Kevin"],"enrichments":{"references":[{"id":942741,"title":"Objects of innovation: post-occupational reflexivity and retraditionalisation of gender'', in Transformations: Thinking Through Feminisms Eds","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":17328143,"title":"of innovation: post-occupational reflexivity and retraditionalisation of gender'', in Transformations:ThinkingThrough Feminisms Eds","authors":[],"date":"2000","doi":null,"raw":"Adkins L, 2000,``Objects of innovation: post-occupational reflexivity and retraditionalisation of gender'', in Transformations:ThinkingThrough Feminisms Eds S Ahmed, J Kilby, C Lury, M McNeil, B Skeggs (Routledge, London) pp 259^272 Alcock P, Beatty C, Fothergill S, Macmillan R,Yeandle S, 2003 WorktoWelfare: How Men Become Detached from the Labour Market (Cambridge University Press, Cambridge) 458 L McDowell, D Perrons, C Fagan, and coworkersAldridge S, 2001,``Social mobility: a discussion paper'', Performance and Innovation Unit, Cabinet Office, http:\/\/www.cabinet-office.gov.uk Anderson B, 2000 Doing the DirtyWork (Verso, London) Atkinson A, 2003,``Top incomes in the United Kingdom over the twentieth century'', STICERD 25th Anniversary Lecture, London Schoolof Economics,20 January; availablefrom the author at Suntory and Toyota International Centres for Economics and Related Disciplines, London School of Economics, London Atkinson J, 1985,``Flexibility, uncertainty and manpower management'', report 89, Institute of Manpower Studies, Brighton, Sussex Beck U, 2000 The Brave NewWorld of Work (Polity, Cambridge) Beck U, Giddens A, Lash S,1994 Reflexive Modernization: Politics,Tradition and Aesthetics in the Modern Social Order (Polity, Cambridge) Bradley H, Erikson M, Stephenson C,Williams S, 2000 Myths at Work (Polity, Cambridge) Bruegel I, Perrons D, 1998,``Deregulation and women's employment: the diverse experiences of women in Britain'' Feminist Economics 1 102 ^ 135 Buck N, Gordon I, Hall P, Harloe M, Kleinmann M, 2002 Working Capital: Life and Labour in Contemporary London (Routledge, London) Butler T, with Robson G, 2003 London Calling:The Middle Classes and the Remaking of Inner London (Berg, Oxford) Cabinet Office 1999 The Gender Deficit Cabinet Office, 70 Whitehall, London SW1A 2AS Carling A, Duncan S, Edwards R (Eds) 2002 Analysing Families: Morality and Rationality in Policy and Practice (Routledge, London) Castells M, 2000,``Materials for an exploratory theory of the network society'' British Journal of Sociology 51 5^24 Castree N, Coe N,Ward K, Samers M, 2004 Spaces of Work: Global Capitalism and Geographies of Labour (Sage, London) Chodorow N, 1978 The Reproduction of Motherhood: Psychoanalysis and the Sociology of Gender (University of California Press, Berkeley, CA) Crompton R, Gallie D, Purcell K (Eds) 1998 Changing Forms of Employment (Routledge, London) DaycareTrust, 2001,``Who will care? Recruiting the next generation of the childcare workforce'', policy paper 4, DaycareTrust, 21 St George's Road, London SE1 6ES Dex S, Joshi H, McRae S, 1996,``A widening gulf among Britain's mothers'' Oxford Review of Economic Policy 12 65 ^75 DoeringerP,PioreM,1971InternalLabourMarketsandManpowerAnalysis(DCHeath,Lexington, MA) Doogan K, 2001,``Insecurity and long term employment'' Work, Employment and Society 15 387^400 Egerton M, Savage M, 2000,``Age stratification and class formation: a longitudinal study on the socialmobilityofyoung men andwomen,1971^1991''Work,EmploymentandSociety14 23^49 Ehrenreich B, 2001Nickel and Dimed: On (Not) Getting By in America (Metropolitan Books, New York) Elliott L, Atkinson D, 1998 The Age of Insecurity (Verso, London) EOC, 2001Pay and Income, Men and Women in Britain Equal Opportunities Commission, Arndale House, Arndale Centre, Manchester M4 3EQ EOC, 2004 It'sTime to Get Even Equal Opportunities Commission, Arndale House, Arndale Centre, Manchester M4 3EQ, http:\/\/www.eoc.org.uk\/cseng\/policyandcampaigns\/ timetogeteven.asp# Our campaign Esping-Andersen G (Ed.), 1993 Changing Classes: Stratification and Mobility in Post-industrial Societies (Sage, London) Fagan C,2001,``Time, moneyandthegenderorder: workorientations andworkingtime preferences in Britain'' Gender,Work and Organisation 8 239^266 FaggioG,NickellS,2003,``Theriseininactivityamongadultmen'',inTheLabourMarketunderNew Labour Eds R Dickens, P Gregg, J Wadsworth (Palgrave Macmillan, Basingstoke, Hants) pp 40^52 Finch J, Mason J, 1993 Negotiating Family Responsibilities (Routledge, London) Future Foundation, 2003 Talking Equality Equal Opportunities Commission, Arndale House, Arndale Centre, Manchester M4 3EQ GLA,2002LondonDivided:IncomeInequalityandPovertyintheCapitalGreaterLondonAuthority, City Hall,The Queen's Walk, London SE1 2AA Placing working women's lives on the research agenda 459Glover J, Arber S, 1995,``Polarisation in mothers'employment'' Gender,Work and Organisation 4 165 ^ 179 Goos M, Manning A, 2003,``McJobs and MacJobs: the growing polarisation of jobs in the UK'', in The Labour Market under New Labour Eds R Dickens, P Gregg, J Wadsworth (Palgrave Macmillan, Basingstoke, Hants) pp 70^85 Gregson N, Lowe M,1994 Servicingthe Middle Classes: Class, Genderand Waged Domestic Labour in Contemporary Britain (Routledge, London) Hakim C, 2000 Work ^ Lifestyle Choices in the 21st Century: PreferenceTheory (Oxford University Press, Oxford) Halsey A H, Heath A F, Ridge J M, 1980 Origins and Destinations: Family Class and Education in Modern Britain (Oxford University Press, Oxford) Hamnett C, 1994,``Socio-economic change in London: professionalisation not polarisation'' Built Environment 20 192 ^ 203 Hamnett C, 2001,``Social segregation and social polarisation'', in Handbook of Urban Studies Ed. R Paddison (Sage, London) pp 162^176 Hamnett C, 2003a Unequal City: London in the Global Arena (Routledge, London) Hamnett C, 2003b,``Incomes grow more unequal as the South still takes the lion's share'' The Independent 28 August, page 26 Hamnett C,Williams P, 1980,``Social change in London: a study of gentrification'' The London Journal 6 51 ^ 66 Harkness S, 2003,``The household division of labour: changes in families'allocation of paid and unpaid work,1992^2002'', inThe Labour Market under New Labour Eds R Dickens, P Gregg, J Wadsworth (Palgrave Macmillan, Basingstoke, Hants) pp 150^169 Harvey D, 1989 The Condition of Postmodernity (Blackwell, Oxford) Hochschild A, 1997 TheTime Bind:WhenWork Becomes Home and Home BecomesWork (Metropolitan Books, New York) Jarvis H, 2004,``City time: managing the infrastructure of everyday life'', paper presented at the ``ESRC Work Life and Time in the New Economy Seminar Series'', February, London School of Economics, available from the author at Department of Geography, University of Newcastle upon Tyne, http:\/\/www.lse.ac.uk\/worklife\/Jarvispaper.pdf Land H, 2002,``Spheres of care in the UK: separate and unequal'' Critical Social Policy 2213 ^ 32 Leadbeater C, 1999 Living onThin Air (Viking, London) Lewis S, 1997,```Family friendly'employment policies: a route to changing organizatinal culture or playing about at the margins?'' Gender,Work and Organization 4 13 ^ 23 Lyons M,1999,``Professionalisation, feminisation, and sociospatial polarisation in London, 1971^1991'' Environment and Planning A 31 49 3^506 McDowell L,1991,``Life without father and Ford: the new gender order of post-Fordism'' Transactions of the Institute of British Geographers, New Series 16 400^419 McDowell L, 2001,``Father and Ford revisited: gender, class and employment change in the new millennium'' Transactions of the Institute of British Geographers, New Series 24 448^464 McDowell L, 2003 Redundant Masculinities? Employment Change and WhiteWorking ClassYouth (Blackwell, Oxford) McDowell L, 2004,``Work, workfare, work\/life balance and an ethic of care'' Progress in Human Geography 281^1 9 Machin S, 2003,``Wage inequality since 1975'', in The Labour Market under New Labour Eds R Dickens, P Gregg, J Wadsworth (Palgrave Macmillan, Basingstoke, Hants) pp 191 ^213 McRae S, 2003,``Constraints and choices in mothers'employment careers: a consideration of Hakim's preference theory'' British Journal of Sociology 54 317 ^ 338 McRobbie A, 2002,``From Holloway to Hollywood: happiness at work in the new cultural economy'', in Cultural Economy Eds P Du Gay, M Pryke (Sage, London) pp 97^114 Mason J, 1996,``Gender, care and sensibility in family and kin relationships'', in Sex, Sensibility and the Gendered Body Eds J Holland, L Adkins (Macmillan, Basingstoke, Hants) pp 15^36 National Statistics, 2004 Focus on Gender http:\/\/www.statistics.gov.uk\/focuson\/gender\/default.asp Nyberg A, 2003,``Economic crisis and the sustainability of the dual earner\/dual carer model'', paper given at an ESRC seminar on Worklife Balance at the London School of Economics, http:\/\/www.lse.ac.uk\/worklife ONS, 2004 Social Trends 34 Office for National Statistics (The Stationery Office, London) Peck J, 1996 WorkPlace:The Social Regulation of Labour Markets (Guilford Press, New York) Perrons D, 2000,``Flexible working and equal opportunities in the United Kingdom: a case study from retail'' Environment and Planning A 32 1 7 1 9^1 7 34 460 L McDowell, D Perrons, C Fagan, and coworkersPerrons D, 2004 Globalization and Social Change: Peopleand Places in a Divided World (Routledge, London) Phillips A,1987 Divided Loyalties: Dilemmas of Sex and Class (Virago, London) Piore M, Sabel C, 1984 The Second Industrial Divide: Possibilities for Prosperity (Basic Books, New York) Rake K, Davies H, Joshi H,1999 Women's Incomes over the Lifetime Women's Unit, Cabinet Office, 70 Whitehall, London SW1A 2AS Rubery J, Smith M, Fagan C (Eds), 1999 Women's Employment in Europe:Trends and Prospects (Routledge, London) Sassen S,1991The Global City: NewYork, London,Tokyo (Princeton University Press, Princeton, NJ) Sassen S, 2001The Global City: NewYork, London,Tokyo 2nd edition (Princeton University Press, Princeton, NJ) Sayer A,Walker R, 1992 The New Social Economy: Reworking the Division of Labour (Blackwell, Oxford) Sennett R, 1998 The Corrosion of Character:The Personal Characteristics of Work in the New Capitalism (W W Norton, New York) Smithers R, 2003,``Soaring childcare costs are `highest in Europe''' The Guardian 30 January, page 14 Storper M,Walker R,1989 The Capitalist Imperative (Basil Blackwell, Oxford) Toynbee P, 2003 Hard Work: Life in Low Pay Britain (Bloomsbury, London) Vincent C, Ball S, Kemp S, 2004,``The social geography of childcare: making up a middle-class child'' British Journal of the Sociology of Education 25 230^244 Westergaard J, 1984,``The once and future class'', in The Future of the Left Ed. J Curran (Polity, Cambridge) pp 28^40 Wills J, 2001,``Mapping low pay in East London'', report for Telco's Living Wage Campaign, available from the author at Queen Mary College, University of London, London Placing working women's lives on the research agenda 461ß 2005 a Pion publication printed in Great BritainISSN 0301-0066 (print) Conditions of use.This article may be downloaded from the Perception website for personal research by members of subscribing organisations. Authors are entitled to distribute their own article (in printed form or by e-mail) to up to 50 people. This PDF may not be placed on any website (or other online distribution system) without permission of the publisher. www.perceptionweb.com ISSN 1468-4233 (electronic) N:\/psfiles\/banners\/ web-cr.3d","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2005-03","abstract":"In this paper we examine the relationships between class and gender in the context of current debates about economic change in Greater London. It is a common contention of the global city thesis that new patterns of inequality and class polarisation are apparent as the expansion of high-status employment brings in its wake rising employment in low-status, poorly paid 'servicing' occupations. Whereas urban theorists tend to ignore gender divisions, feminist scholars have argued that new class and income inequalities are opening up between women as growing numbers of highly credentialised women enter full-time, permanent employment and others are restricted to casualised, low-paid work. However, it is also argued that working women's interests coincide because of their continued responsibility for domestic obligations and still-evident gender discrimination in the labour market. In this paper we counterpose these debates, assessing the consequences for income inequality, for patterns of childcare and for work-life balance policies of rising rates of labour-market participation among women in Greater London. We conclude by outlining a new research agenda","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/92671.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/548\/1\/E%26PA_37%283%29.pdf","pdfHashValue":"947347bda981394d13624b768b9328dc9f1a676c","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:548<\/identifier><datestamp>\n      2011-05-18T09:55:29Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4759<\/setSpec><setSpec>\n      74797065733D434F4C4C53:4C53455F435F454F<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/548\/<\/dc:relation><dc:title>\n        The contradictions and intersections of class and gender in a global city : placing working women's lives on the research agenda<\/dc:title><dc:creator>\n        McDowell, Linda<\/dc:creator><dc:creator>\n        Perrons, Diane<\/dc:creator><dc:creator>\n        Fagan, Colette<\/dc:creator><dc:creator>\n        Ray, Kath<\/dc:creator><dc:creator>\n        Ward, Kevin<\/dc:creator><dc:subject>\n        HT Communities. Classes. Races<\/dc:subject><dc:subject>\n        HQ The family. Marriage. Woman<\/dc:subject><dc:subject>\n        HC Economic History and Conditions<\/dc:subject><dc:description>\n        In this paper we examine the relationships between class and gender in the context of current debates about economic change in Greater London. It is a common contention of the global city thesis that new patterns of inequality and class polarisation are apparent as the expansion of high-status employment brings in its wake rising employment in low-status, poorly paid 'servicing' occupations. Whereas urban theorists tend to ignore gender divisions, feminist scholars have argued that new class and income inequalities are opening up between women as growing numbers of highly credentialised women enter full-time, permanent employment and others are restricted to casualised, low-paid work. However, it is also argued that working women's interests coincide because of their continued responsibility for domestic obligations and still-evident gender discrimination in the labour market. In this paper we counterpose these debates, assessing the consequences for income inequality, for patterns of childcare and for work-life balance policies of rising rates of labour-market participation among women in Greater London. We conclude by outlining a new research agenda.<\/dc:description><dc:date>\n        2005-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/548\/1\/E%26PA_37%283%29.pdf<\/dc:identifier><dc:identifier>\n          McDowell, Linda and Perrons, Diane and Fagan, Colette and Ray, Kath and Ward, Kevin  (2005) The contradictions and intersections of class and gender in a global city : placing working women's lives on the research agenda.  Environment and Planning A, 37 (3).  pp. 441-461.  ISSN 0308-518X     <\/dc:identifier><dc:relation>\n        http:\/\/www.envplan.com\/<\/dc:relation><dc:relation>\n        10.1068\/a3781<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/548\/","http:\/\/www.envplan.com\/","10.1068\/a3781"],"year":2005,"topics":["HT Communities. Classes. Races","HQ The family. Marriage. Woman","HC Economic History and Conditions"],"subject":["Article","PeerReviewed"],"fullText":""}