{"doi":"10.1016\/j.bmcl.2010.04.079","coreId":"19124","oai":"oai:eprints.bham.ac.uk:409","identifiers":["oai:eprints.bham.ac.uk:409","10.1016\/j.bmcl.2010.04.079"],"title":"Synthesis and biological activity of α-l-fucosyl ceramides, analogues of the potent agonist, α-d-galactosyl ceramide KRN7000","authors":["Veerapen, Natacha","Reddington, Faye","Bricard, Gabriel","Porcelli, Steven A.","Besra, Gurdyal S."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"Several L-fucoglycolipids are associated with diseases such as cancer, cystic fibrosis and rheumatoid arthritis. Activation of iNKT cells is known to lead to the production of cytokines that can help alleviate or exacerbate these conditions. a-Galactosyl ceramide (a-GalCer) is a known agonist of iNKT cells and it is believed that its fucosyl counterpart might have similar immunogenic properties. We herein report the synthesis of a-L-fucosyl ceramide derivatives and describe their biological evaluation. The key challenge in the synthesis of the target molecules involved the stereoselective synthesis of the a-glycosidic linkage. Of the methods examined, the per-TMS-protected glycosyl iodide donor was completely aselective,and could be scaled up to provide gram quantities of the azide precursor 11, from which a range of N-acylated a-L-fucosyl ceramides were readily obtained and evaluated for ex vivo expansion of human iNKT cells","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.bham.ac.uk:409<\/identifier><datestamp>\n      2011-10-12T11:06:55Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5150<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Synthesis and biological activity of α-l-fucosyl ceramides, analogues of the potent agonist, α-d-galactosyl ceramide KRN7000<\/dc:title><dc:creator>\n        Veerapen, Natacha<\/dc:creator><dc:creator>\n        Reddington, Faye<\/dc:creator><dc:creator>\n        Bricard, Gabriel<\/dc:creator><dc:creator>\n        Porcelli, Steven A.<\/dc:creator><dc:creator>\n        Besra, Gurdyal S.<\/dc:creator><dc:subject>\n        QP Physiology<\/dc:subject><dc:description>\n        Several L-fucoglycolipids are associated with diseases such as cancer, cystic fibrosis and rheumatoid arthritis. Activation of iNKT cells is known to lead to the production of cytokines that can help alleviate or exacerbate these conditions. a-Galactosyl ceramide (a-GalCer) is a known agonist of iNKT cells and it is believed that its fucosyl counterpart might have similar immunogenic properties. We herein report the synthesis of a-L-fucosyl ceramide derivatives and describe their biological evaluation. The key challenge in the synthesis of the target molecules involved the stereoselective synthesis of the a-glycosidic linkage. Of the methods examined, the per-TMS-protected glycosyl iodide donor was completely aselective,and could be scaled up to provide gram quantities of the azide precursor 11, from which a range of N-acylated a-L-fucosyl ceramides were readily obtained and evaluated for ex vivo expansion of human iNKT cells.<\/dc:description><dc:date>\n        2010<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.bham.ac.uk\/409\/1\/besra_bioMedChemlett_2010.pdf<\/dc:identifier><dc:relation>\n        public<\/dc:relation><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/409\/1.hassmallThumbnailVersion\/besra_bioMedChemlett_2010.pdf<\/dc:relation><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.bmcl.2010.04.079<\/dc:relation><dc:identifier>\n        Veerapen, Natacha and Reddington, Faye and Bricard, Gabriel and Porcelli, Steven A. and Besra, Gurdyal S. (2010) Synthesis and biological activity of α-l-fucosyl ceramides, analogues of the potent agonist, α-d-galactosyl ceramide KRN7000. Bioorganic & Medicinal Chemistry Letters, 20 (11). p. 3223. ISSN 0960894X<\/dc:identifier><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/409\/<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["public","http:\/\/eprints.bham.ac.uk\/409\/1.hassmallThumbnailVersion\/besra_bioMedChemlett_2010.pdf","http:\/\/dx.doi.org\/10.1016\/j.bmcl.2010.04.079","http:\/\/eprints.bham.ac.uk\/409\/"],"year":2010,"topics":["QP Physiology"],"subject":["Article","PeerReviewed"],"fullText":"Bioorganic & Medicinal Chemistry Letters 20 (2010) 3223–3226Contents lists available at ScienceDirect\nBioorganic & Medicinal Chemistry Letters\njournal homepage: www.elsevier .com\/ locate\/bmclSynthesis and biological activity of a-L-fucosyl ceramides, analogues\nof the potent agonist, a-D-galactosyl ceramide KRN7000\nNatacha Veerapen a, Faye Reddington a, Gabriel Bricard b, Steven A. Porcelli b,c, Gurdyal S. Besra a,*\na School of Biosciences, University of Birmingham, Edgbaston, Birmingham B15 2TT, UK\nbDepartment of Microbiology and Immunology, Albert Einstein College of Medicine, Bronx, NY 10461, USA\ncDepartment of Medicine, Albert Einstein College of Medicine, Bronx, NY 10461, USA\na r t i c l e i n f o a b s t r a c tArticle history:\nReceived 6 April 2010\nRevised 15 April 2010\nAccepted 16 April 2010\nAvailable online 22 April 2010\nKeywords:\nCD1d\niNKT\nAntigen\nCeramide\nLipid0960-894X\/$ - see front matter \u0002 2010 Elsevier Ltd. A\ndoi:10.1016\/j.bmcl.2010.04.079\n* Corresponding author. Tel.: +44 (0)121 4158125.\nE-mail address: g.besra@bham.ac.uk (G.S. Besra).Several L-fucoglycolipids are associated with diseases such as cancer, cystic ﬁbrosis and rheumatoid\narthritis. Activation of iNKT cells is known to lead to the production of cytokines that can help alleviate\nor exacerbate these conditions. a-Galactosyl ceramide (a-GalCer) is a known agonist of iNKT cells and\nit is believed that its fucosyl counterpart might have similar immunogenic properties. We herein report\nthe synthesis of a-L-fucosyl ceramide derivatives and describe their biological evaluation. The key chal-\nlenge in the synthesis of the target molecules involved the stereoselective synthesis of the a-glycosidic\nlinkage. Of the methods examined, the per-TMS-protected glycosyl iodide donor was completely a-\nselective, and could be scaled up to provide gram quantities of the azide precursor 11, from which a\nrange of N-acylated a-L-fucosyl ceramides were readily obtained and evaluated for ex vivo expansion\nof human iNKT cells.\n\u0002 2010 Elsevier Ltd. All rights reserved.Both D- and L-fucose (6-deoxy galactose) are widely found in\nnature.1 Of interest, L-fucose is predominantly found in the a-\nconﬁguration in the lipopolysaccharides (LPS) of Gram-negative\nbacteria and animal glycosphingolipids.1,2 With the exception\nof the monohexylceramide, a-L-fucosylceramide 1, initially iso-\nlated from metastatic human adenocarcinoma,3 most fucosphin-\ngolipids are usually ceramide oligosaccharides.2,4 Many of these\nfucolipids are antigenic5–7 and play a role in tumour cell biol-\nogy.8–10 Conversely, the synthetic glycolipid, a-galactosyl cera-\nmide (a-GalCer)11 (2), is a strong agonist of iNKT cells when\nbound to CD1d, triggering the release of diverse cytokines,\nincluding both Th1 and Th2 cytokines.12–14 It is believed that\nthe release of Th1 cytokines may contribute to antitumour and\nantimicrobial functions while that of Th2 cytokines may help\nalleviate autoimmune diseases15–17 such as multiple sclerosis18\nand arthritis.19ll rights reserved.O\nHO\nHO\nHO\nOH\nC14H29\nO\nNH\nOH\nOH\nC25H51O\n1\nCHO CH\nNH\nC15H31O\nC\nH\nOH\nC\nH\nCH2 CH3\n12\nO\nHO\nHO\nHO\nC14H29\nO\nNH\nOH\nOH\nC25H51O\n2 3\nO\nOH\nOH\nOH\na-GalCer and its derivatives have proved to be and remain\ninvaluable tools in understanding the functioning of CD1d and\niNKT cells in a wide range of immune responses. Crystal structures\nof the bound a-GalCer–CD1d complex20–22 showed that the hydro-\nxyl group at C-6 in the sugar head is not crucial for binding to the\nT-cell receptor (TCR) as opposed to C-2, C-3 and C-4. Hence, the a-\nD-fucosylceramide 323 was shown to be a potent inducer of IFN-c\n3224 N. Veerapen et al. \/ Bioorg. Med. Chem. Lett. 20 (2010) 3223–3226in mice in vivo, while a slightly different derivative, synthesised by\nMotoki et al.24 showed strong lymphocytic proliferation stimula-\ntory effects in vitro in mice.\nWhile there are a few examples describing the synthesis of a-L-\nfucosylceramide 4b25 and other derivatives in the literature,26,27\ntheir biological activities are yet to be fully explored. As part of var-\nious ongoing studies, and because of the aforementioned reasons,\nwe have synthesised compounds 4a–4d for biological evaluation\nand comparative studies.\n4c n = 22, R = OH\n4d n = 24, R = OH\n4e n = 24, R = H\nC14H29O\nNH\nR\nOH\n(CH2)nCH3O\nO\nOH\nOH\nOH\nC14H29O\nNH\nOH\nOH\n(CH2)8O\nO\nOH\nOH\nOH\nC4H9\n4a\nC14H29O\nNH\nOH\nOH\nO\nO\nOH\nOH\nOH\nC14H29\nOH\n4b\n25SPh\nO HO C14H29\nN3 OBz\n+Fan et al. reported the synthesis of compound 4d, while\nOkamoto et al.27 reported that of compound 4e. Both groups ob-\ntained their target compounds as an a, b mixture (3:1 ratio) from\ndifferent glycosyl donors and acceptors (Scheme 1). On the other\nhand, in the original reported synthesis of the fucosylceramide 1,\nonly the a-anomer was isolated when another ceramide acceptor\nwas used under different reaction conditions.\nWe recently reported the synthesis28 of a-GalCer and other\nderivatives where we used N-iodosuccinimide (NIS) and triﬂic acid\n(TfOH) as a promoter, and benzoate protecting groups on the\nsphingosine base. Along with the nature of the protecting groups\non both the glycosyl acceptor and donor, the choice of promoter,\nas well as temperature and reaction times can affect the stereose-\nlectivity of the glycosylation reaction. In this study, we proposed to\ninvestigate whether our glycosyl acceptor 7 and reaction condi-\ntions could offer a better a-selectivity in the case of L-fucose.SPh\nO\nOBn\nOBn\nOBn\nOH\nO\nOBn\nOBn\nOBn\nHO C14H29\nN3\nOBn\nOBn\nC14H29O\nN3\nOBn\nOBn\nO\nOBn\nOBn\nOBn\nHO\nN3\nOBn\nC13H27\nO\nN3\nOBn\nO\nOBn\nOBn\nOBn\nC13H27\nα:β = 3:1\nα:β = 3:15\n6\na\nb\nScheme 1. (a) Me2S, 2-Cl-pyridine, Tf2O, CH2Cl2; (b) dimethyl(methylthio)sulfo-\nnium triﬂate (DMTST), CH2Cl2, 0 \u0003C-rt.The phytosphingosine acceptor 729 was synthesised from\n(2S,3S,4R)-2-azido-1,3,4-octadecanetriol30 as described before. Gi-\nven the previous success of a thiogalactoside in a similar glycosyl-\nation reaction with compound 728 we chose to use the thiofucosyl\ndonor 6, rather than compound 5. The thioglycoside 6was thus ob-\ntained from commercially available L-fucose after standard proce-\ndures, as previously reported.31\nWith both the acceptor and donor in hand, we then proceeded\nto the critical glycosylation reaction. Interestingly, NIS\/TfOH acti-\nvation of 1 g of the thioglycoside 6 (Scheme 2) in anhydrous CH2Cl2\nat \u000278 \u0003C afforded the glycosylated compound 8, almost exclu-\nsively as the a-anomer (a:b ratio = 9:1), in 68% yield after 2 h.\nOur results show a deﬁnite improvement in selectivity from the\npreviously reported syntheses. Because the formation of the a-\nanomer is favoured by the anomeric effect, we rationalise that\nthe latter is a governing factor under our reaction conditions. Both\nthe lower temperature and the different reactivity of the acceptor 7\ncould potentially inﬂuence the stereoselectivity of the glycosyla-\ntion reaction. These factors will have to be more thoroughly inves-\ntigated in a later study. Subsequent Zemplen’s deprotection of the\nbenzoate protecting groups produced the azide intermediate in\nquantitative yields. Tandem hydrogenation of the azido group\nand hydrogenolysis of the benzyl ethers in methanol then pro-\nduced the amine 9 as a white solid, which exhibited spectroscopic\ndata consistent with the literature.25\nIn an attempt to improve the stereoselectivity and circumvent\nthe sometimes problematic removal of the benzyl ethers by\nhydrogenolysis, we embarked on a different glycosylation route.\nRecently, the use of glycosyl iodide donors has been revived by\nGervay-Hague’s group.32,33 They have demonstrated that glycosyl-\nation reactions employing glycosyl iodides and promoted by tetra-\nbutyl ammonium iodide (TBAI) are generally quite stereoselective\nand fast. It has been hypothesized that TBAI catalyses the isomer-\nization of the a-glycosyl iodide to the b-anomer,34 thereby leading\nto the formation of an a-glycoside. They have successfully adapted\nthis strategy to the synthesis of a-GalCer35 and other a-fucosylgly-\ncosides.36 Furthermore, the replacement of the benzyl ethers with\ntrimethylsilylethers (TMS) made Gervay-Hague’s synthetic strat-\negy even more attractive. TMS protected sugars are easy to gener-\nate and their deprotection requires very mild acidic conditions,\ncompatible with the glycosidic linkage.OBn\nOBn\nOBn\nOBz\n7\nC14H29O\nN3\nOBz\nOBz\nO\nOBn\nOBn\nOBn\nC14H29O\nNH2\nOH\nOH\nO\nOH\nOH\nOH\n6\n8\n9\na\nb, c\nScheme 2. (a) NIS\/TfOH, CH2Cl2, \u000278 \u0003C to \u000220 \u0003C, 68%; (b) NaOMe\/MeOH, 92%; (c)\nH2, Pd, 76%.\nN. Veerapen et al. \/ Bioorg. Med. Chem. Lett. 20 (2010) 3223–3226 3225The per-O-trimethylsilyl-a-L-fucosylpyranosyl iodide 10 was\ngenerated by the reaction of the per-O-tetramethylsilyl-a-L-fucose\nwith one equivalent of iodotrimethylsilane35 and then added to the\nphytosphingosine acceptor 7 which was premixed with diisopro-\npylethylamine (DIPEA) and TBAI (Scheme 3). After 2 days at room\ntemperature, the solvent was evaporated and the TMS protecting\ngroups were removed by treatment with an acidic resin in MeOH.\nCompound 11 was obtained as the a-anomer exclusively in an\noverall yield of 62%. The formation of the desired a-linkage was\nconﬁrmed by the H-1 and C-1 signals in 1H and 13C NMR. Methan-\nolysis, followed by hydrogenation of the azide then afforded com-\npound 9.\nFinally, N-acylation with the fully saturated fatty acids, tetraco-\nsanoic acid (C24:0) and hexacosanoic acid (C26:0), was achieved\nvia reaction of the corresponding acid chloride with the free amine\n9 in a 1:1 mixture of THF and saturated sodium acetate solution\n(Scheme 3). Target compounds 4c and 4d were obtained as white\nsolids after concentration of the organic phase and puriﬁcation of\nthe residue by ﬂash chromatography. The spectroscopic data of\nthe ﬁnal compounds were consistent with the literature.25 While\ncompound 4a was obtained by heating amine 9 with the\nN-hydroxysuccinimide activated ester of C20:2 fatty acid in a mix-\nture of pyridine: water (9:1) at 50 \u0003C overnight, compound 4b was\nobtained via dicyclohexylcarbodiimide (DCC) activated coupling\nusing procedures described previously.37,38\nTo assess the biological activity of the a-L-fucosylceramides and\ncompare these to a-GalCer (KRN7000, 2), we assessed the ability of\neach compound to induce the expansion of iNKT cells in samples of\nhuman peripheral blood mononuclear cells (PBMC) during an\neight-day in vitro culture.39 The results showed that both the per-\ncentages and absolute numbers of iNKT cells in cultures were in-\ncreased by stimulation with a-L-fucosylceramides with C26:0I\nO\nOTMS\nOTMS\nOTMS 7\nC14H29O\nN3\nOBz\nOBz\nO\nOH\nHO\nHO\n+\n9\n11\na, b\nc,d\n10\n4c n = 22, R = OH\n4d n = 24, R = OH\nC14H29O\nNH\nOH\nOH\n(CH2)nCH3O\nO\nOH\nOH\nOH\ne\nScheme 3. (a) TBAI, DIPEA, CH2Cl2, rt; (b) Dowex 50WX8-200, MeOH, rt, 62% over\ntwo steps; (c) NaOMe\/MeOH, quantitative; (d) H2, Pd, MeOH, 80%; (e) C25H51COCl or\nC23H47COC1, THF, NaOAc, 78–80%.(4d) > C18:0 (OH) (4b) > C24:0 (4c). The a-L-fucosylceramide con-\ntaining a C26:0 fatty acid (4d) was the most active of the fucosyl\nseries, and stimulated iNKT cell expansions in some donors that\napproached those seen with the prototype iNKT cell agonist\nKRN7000 (2). In contrast, the a-L-fucosylceramide containing the\nC20:2 fatty acid (4a) was found to lack detectable iNKT cell stimu-\nlating activity in any of the donors tested (Fig. 1B). Representative\nproﬁles obtained by ﬂow cytometry of cultures from one normal\nblood donor are shown in Figure 1A. This analysis was carried\nout with PBMC from four separate donors (Fig. 1B). Although, dif-\nferences were observed for the levels of iNKT cell expansion be-\ntween different donors, all donors responded signiﬁcantly to two\nof the a-L-fucosylceramide analogues (4b and 4d).\nIn summary, in the current study we have developed an\nefﬁcient method for the synthesis of a series of biologically active\na-L-fucosylceramides.40 The second method, employing the per-\nO-trimethylsilyl-a-L-fucosylpyranosyl iodide 10, proved to be\nsuperior with a better a-selectivity and reasonably good yield in\nthe glycosylation reaction. Given the marked difference in the ste-\nreochemistry of the a-fucosyl head group of these glycolipids com-\npared to a-galactosyl group of strong iNKT cell activators like\nKRN7000, it is surprising that the compounds in the current series\nshow such substantial activity. This would seem to further rein-\nforce the notion that the TCR of iNKT cells, in spite of its relative\nlimited variability, is nevertheless able to interact efﬁciently with\na broad range of structurally diverse ligands. It is noteworthy thatFigure 1. Ex vivo expansion of human iNKT cells by a-L-fucosylceramides. PBMC from\nfour different donors were stimulated with the indicated glycolipids at a concen-\ntration of 250 nM in the presence of low levels of exogenous IL-2 and IL-7. At day 8,\ncultures were harvested and analysed by ﬂow cytometry using monoclonal\nantibodies speciﬁc for CD3 and for the invariant TCRa chain expressed by iNKT\ncells (6B11). (A) Dot plots showing relative levels of CD3+ 6B11+ iNKT cells are\nshown for one representative donor. Numbers in upper right quadrant indicate\npercentages of total lymphocytes that are iNKT cells. (B) Absolute numbers of iNKT\ncells in the cultures were determined by ﬂow cytometry using ﬂuorescent counting\nbeads, and the values of iNKT cell fold expansion were determined by dividing by\nthe input number of iNKT cells.\n3226 N. Veerapen et al. \/ Bioorg. Med. Chem. Lett. 20 (2010) 3223–3226the C20:2 N-acyl variant of a-fucosylceramide (4a) showed no\ndetectable iNKT cell stimulating activity, given that the a-galacto-\nsyl version of this compound is an extremely potent iNKT cell ago-\nnist.41 This suggests that modiﬁcation of the carbohydrate moiety\ncan signiﬁcantly alter the inﬂuence of the lipid moiety of the ligand\non CD1d presentation and iNKT cell responses. Although the mech-\nanism for this remains unclear, it is an important consideration for\nsynthetic strategies that seek to combine biologically active alter-\nations of the carbohydrate and lipid moieties of iNKT cell ligands.\nAcknowledgements\nG.S.B. acknowledges support in the form of a Personal Research\nChair from Mr. James Badrick, Royal Society Wolfson Research\nMerit Award, as a former Lister Institute-Jenner Research Fellow,\nthe Medical Council and The Wellcome Trust (084923\/B\/08\/7).\nS.A.P. and G.B. were supported by NIH\/NIAID grant AI45889. Core\nresources that facilitated ﬂow cytometry were supported by the\nEinstein Center for AIDS Research(AI 051519) and the Einstein Can-\ncer Center (CA 13330). The NMR spectrometers used in this re-\nsearch were funded in part through Birmingham Science City\nwith support from Advantage West Midlands (AWM) and part-\nfunded by the European Regional Development Fund (ERDF).\nReferences and notes\n1. Flowers, M. Adv. Carbohydr. Chem. Biochem. 1981, 39, 279.\n2. Vanhooren, P. T.; Vandamme, E. J. J. Chem. Technol. Biotechnol. 1999, 74, 479.\n3. Watanabe, K.; Matsubara, T.; Hakomori, S.-I. J. Biol. Chem. 1976, 251, 2385.\n4. Hakomori, S. Adv. Cancer Res. 1978, 52, 257.\n5. Kannagi, R.; Fukushi, Y.; Tachikawa, T.; Noda, A.; Shin, S.; Shigeta, K.; Hiraiwa,\nN.; Fukuda, Y.; Inamoto, T.; Hakomori, S.-I.; Imura, H. Cancer Res. 1986, 46,\n2619.\n6. Magnani, J. L.; Steplewski, Z.; Koprowski, H.; Ginsburg, V. Cancer Res. 1983, 43,\n5489.\n7. Singhal, A. K.; Orntoft, T. F.; Nudelman, E.; Nance, S.; Schibig, L.; Stroud, M. R.;\nClausen, H.; Hakomori, S. Cancer Res. 1990, 50, 1375.\n8. Hakomori, S.; Nudelman, E.; Levery, S. B.; Kannagi, R. J. Biol. Chem. 1984, 259,\n4672.\n9. Hattori, H.; Uemura, K.; Taketomi, T. Biochim. Biophys. Acta 1981, 666, 361.\n10. Hattori, H.; Uemura, K.; Ogata, H.; Katsuyama, T.; Taketomi, T.; Kanfer, J. N.\nCancer Res. 1987, 47, 1968.\n11. Kawano, T.; Cui, J.; Koezuka, Y.; Toura, I.; Kaneko, Y.; Motoki, K.; Ueno, H.;\nNakagawa, R.; Sato, H.; Kondo, E.; Koseki, H.; Taniguchi, M. Science 1997, 278,\n1626.\n12. Crowe, N.; Uldrich, A. P.; Kyparissoudis, K.; Hammond, K. J. L.; Hayakawa, Y.;\nSidobre, S.; Keating, R.; Kronenberg, M.; Smyth, M. J.; Godfrey, D. I. J. Immunol.\n2003, 171, 4020.\n13. Burdin, N.; Brossay, L.; Kronenberg, M. Eur. J. Immunol. 1999, 29, 2014.\n14. Carnaud, C.; Lee, D.; Donnars, O.; Park, S. H.; Beavis, A.; Koezuka, Y.; Bendelac,\nA. J. Immunol. 1999, 163, 4647.\n15. Taniguchi, M.; Harada, M.; Kojo, S.; Nakayama, T.; Wakao, H. Annu. Rev.\nImmnunol. 2003, 21, 483.\n16. Godfrey, D. I.; MacDonald, H. R.; Kronenberg, M.; Smyth, M. J.; Van, K. L. Nat.\nRev. Immunol. 2004, 4, 231.\n17. Gonzalez-Aseguinolaza, G.; Van Kaer, L.; Bergmann, C. C.; Wilson, J. M.;\nSchmieg, J.; Kronenberg, M.; Nakayama, T.; Taniguchi, M.; Koezuka, Y.; Tsuji, M.\nJ. Exp. Med. 2002, 195, 617.\n18. Miyamoto, K.; Miyake, S.; Yamamura, T. Nature 2001, 413, 513.\n19. Chiba, A.; Oki, S.; Miyamoto, K.; Hashimoto, H.; Yamamura, T.; Miyake, S.\nArthritis Rheum. 2004, 50, 305.\n20. Zajonc, D. M.; Cantu, C.; Mattner, J.; Zhou, D.; Savage, P. B.; Bendelac, A.;\nWilson, I. A.; Teyton, L. Nat. Immunol. 2005, 6, 810.\n21. Koch, M.; Stronge, V. S.; Shepherd, D.; Gadola, S. D.; Mathew, B.; Ritter, G.;\nFersht, A. R.; Besra, G. S.; Schmidt, R. R.; Jones, E. Y.; Cerundolo, V. Nat. Immunol.\n2005, 6, 819.22. Borg, N. A.; Wun, K. S.; Kjer-Nielsen, L.; Wilce, M. C. J.; Pellicci, D. G.; Koh, R.;\nBesra, G. S.; Bharadwaj, M.; Godfrey, D. I.; McCluskey, J.; Rossjohn, J. Nature\n2007, 448, 44.\n23. Tashiro, T.; Nakagawa, R.; Inoue, S.; Shiozaki, M.; Watarai, H.; Taniguchi, M.;\nMori, K. Tetrahedron Lett. 2008, 49, 6827.\n24. Motoki, K.; Morita, M.; Kobayashi, E.; Uchida, T.; Akimoto, K.; Fukushima, H.;\nKoezuka, Y. Biol. Pharm. Bull. 1995, 18, 1487.\n25. Fan, G. T.; Pan, Y.-S.; Lu, K.-C.; Cheng, Y.-P.; Lin, W.-C.; Lin, S.; Lin, C.-H.; Wong,\nC.-H.; Fang, J.-M.; Lin, C.-C. Tetrahedron 2005, 61, 1855.\n26. Yoshino, T.; Watanabe, K.; Hakomori, S.-I. Biochemistry 1982, 21, 928.\n27. Okamoto, N.; Kanie, O.; Huang, Y.-Y.; Fujii, R.; Watanabe, H.; Shimamura, M.\nChem. Biol. 2005, 12, 677.\n28. Veerapen, N.; Brigl, M.; Garg, S.; Cerundulo, V.; Cox, L. R.; Brenner, M. B.; Besra,\nG. S. Bioorg, Med. Chem. Lett. 2009, 19, 4288.\n29. Akimoto, K.; Natori, T.; Morita, M. Tetrahedron Lett. 1993, 34, 5593.\n30. Van den Berg, R. J. B. H. N.; Boltje, T. J.; Verhagen, C. P.; Litjens, R. E. J. N.; Van\nder Marel, G. A.; Overkleeft, H. S. J. Org. Chem. 2006, 71, 836.\n31. Komba, S.; Ishida, H.; Kiso, M.; Hasegawa, A. Bioorg. Med. Chem. 1996, 4, 1833.\n32. Gervay-Hague, J.; Ngyuen, T.; Hadd, M. Carbohydr. Res. 1997, 300, 119.\n33. Meloncelli, P. J.; Martin, A. D.; Lowary, T. L. Carbohydr. Res. 2009, 344, 1110.\n34. Lam, S. N.; Gervay-Hague, J. Carbohydr. Res. 2002, 337, 1953.\n35. Du, W.; Kulkarni, S. S.; Gervay-Hague, J. Chem. Commun. 2007, 23, 2336.\n36. Bhat, A. S.; Gervay-Hague, J. Org. Lett. 2001, 13, 2081.\n37. Goff, R. D.; Gao, Y.; Mattner, J.; Zhou, D.; Yin, N.; Cantu, C.; Teyton, L.; Bendelac,\nA.; Savage, P. B. J. Am. Chem. Soc. 2004, 126, 13602.\n38. Xia, C.; Zhang, W.; Zhang, Y.; Woodward, R. L.; Wang, J.; Wang, P. G.\nTetrahedron 2009, 65, 6390.\n39. Peripheral blood mononuclear cells (PBMC) were obtained by Ficoll-hypaque\ncentrifugation of leucocyte concentrates obtained from healthy volunteer\nblood donors. For ex vivo expansion of human iNKT cells, 4 million PBMC were\ncultured in wells of 24-well tissue culture plates in RPMI-1640 medium with\n10% foetal calf serum and recombinant IL-2 (60 IU\/mL) and IL-7 (5 ng\/mL)\n(Peprotech). Glycolipids were solubilised in 100% DMSO and added directly to\nculture media to achieve a ﬁnal concentration of 250 nM. Control wells\nreceived an amount of DMSO vehicle identical to that added with the\nglycolipids (0.00125%). Cultures were incubated for 8 days at 37 \u0003C in a 5%\nCO2 humidiﬁed incubator. Cultures were harvested and the cells stained with\nﬂuorochrome labelled monoclonal antibodies speciﬁc for CD3 and the iNKT cell\nTCR (6B11, BD Biosciences). Samples were also stained with propidium iodide\nto exclude dead cells, and a known number of Caltag ﬂuorescent counting\nbeads (Invitrogen) were added to the samples to allow quantitation of absolute\ncell numbers. The total number of iNKT cells (CD3+, 6B11+, PI negative\nlymphocytes) was calculated by normalising according to counting beads and\nthe fold expansion values were calculated based on the initial number of iNKT\ncells. Data were collected on a FACSCalibur ﬂow cytometer using CellQuest\nsoftware (BD Biosciences).\n40. Selected data for new compounds. Compound 8: 1H NMR (CDCl3): d 7.92–8.04\n(10H, m, Ar-H), 7.10–7.64 (15H, m, Ar-H), 5.42–5.50 (2H, m, H-3Cer, H-4Cer),\n5.02 (1H, d, J1,2 = 3.6 Hz, H-1), 4.72–4.84 (6H, m, 3 \u0003 CH2Ph), 3.98 (1H, dd,\nJ2,3 = 11.5 Hz, H-2), 3.75–3.90 (3H, m, H-4, H-3, H-1aCer), 3.55 (1H, m, H-5), 3.68\n(1H, dd, J1a,1b = 10.4, J1b,2 = 8.6 Hz, H-1bCer), 1.88 (2H, m, H-5aCer, H-5bCer), 1.27\n(3H, d, J5,6 = 6.4 Hz, H-6), 1.24 (24H, m, CH2), 0.89 (3H, t, CH3); 13C NMR\n(75 MHz, CDCl3): d 99.5 (C-1); HRMS calcd for C59H73N3O9 [M+Na]+: 990.5245,\nfound 990.5248. Compound 9: 1H NMR (CD3OD): d 4.73 (1H, d, J1,2 = 3.7 Hz,\nH-1), 3.91–3.96 (2H, m, H-3, H-4), 3.68–3.72 (1H, dd, J1a,1b = 9.9, J1b,2 = 3.9 Hz,\nH-1aCer), 3.61–3.68 (2H, m, H-4, H-3Cer, H-4Cer), 3.52–3.55 (1H, dd, J2,3 = 6.0 Hz,\nH-2), 3.43–3.49 (1H, m, H-5), 3.39–3.42 (1H, dd, J1b,2 = 8.6 Hz, H-1bCer), 3.35\n(1H, m, H-2Cer), 1.89 (2H, m, H-5aCer, H-5bCer), 1.28 (3H, d, J5,6 = 6.4 Hz, H-6),\n1.24 (24H, m, CH2), 0.89 (3H, t, CH3); 13C NMR (75 MHz, CD3OD): d 102.5 (C-1);\nHRMS calcd for C24H49NO7 [M+Na]+: 486.3403, found 486.3309. Compound 11:\n1H NMR (CDCl3): d 7.36–7.86 (10H, m, Ar-H), 5.60 (1H, dd, J3,4 = 4.8,\nJ3,2 = 6.8 Hz, H-3Cer), 5.51 (1H, ddd, J4,5a = 4.2, J4,5b = 8.5 Hz, H-4Cer), 4.82 (1H,\nd, J1,2 = 2.8 Hz, H-1), 3.88–4.00 (3H, m, H-2, H-4, H-5), 3.62–3.80 (3H, m, H-3,\nH-2Cer, H-1aCer), 3.71 (1H, dd, J1a,1b = 10.4, J1b,2 = 6.5 Hz, H-1bCer), 1.76–1.91 (2H,\nm, H-5aCer, H-5bCer), 1.10–1.43 (24 H, m, CH2), 1.07 (3H, d, J5,6 = 6.6 Hz, H-6),\n0.85 (3H, t, CH3); 13C NMR (75 MHz, CDCl3): d 100.9 (C-1); HRMS calcd for\nC38H55N3O10 [M+Na]+: 720.3836, found 720.3811. Compound 4a: HRMS calcd\nfor C44H83NO8 [M+Na]+: 776.6013, found 776.6011. Compound 4b: HRMS calcd\nfor C42H83NO9 [M+Na]+: 768.5962, found 768.5941. Compound 4c: HRMS calcd\nfor C48H95NO8 [M+Na]+: 836.6956, found 836.6953. Compound 4d: HRMS calcd\nfor C50H99NO8 [M+Na]+: 864.7268, found 864.7240.\n41. Yu, K. O.; Im, J. S.; Molano, A.; Dutronc, Y.; Illarionov, P. A.; Forestier, C.;\nFujiwara, N.; Arias, I.; Miyake, S.; Yamamura, T.; Chang, Y. T.; Besra, G. S.;\nPorcelli, S. A. Proc. Natl. Acad. Sci. U.S.A. 2005, 102, 3383.\n"}