{"doi":"10.1016\/j.scitotenv.2008.07.022","coreId":"141144","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3335","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3335","10.1016\/j.scitotenv.2008.07.022"],"title":"Better environmental decision making - Recent progress and future trends.","authors":["Pollard, Simon J. T.","Davies, Gareth J.","Coley, F. J. S.","Lemon, Mark"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-08-01T00:00:00Z","abstract":"Recent trends in risk-based decision making are reviewed in relation to novel\ndevelopments in comparative risk analysis, strategic risk analysis, weight of\nevidence frameworks, and participative decision making. Delivery of these\ninnovations must take account of organisational capabilities in risk management\nand the institutional culture that implements decision on risk. We stress the\nimportance of managing risk knowledge within organisations, and emphasise the\nuse of core criteria for effective risk-based decisions by reference to decision\nprocess, implementation and the security of strategic added value","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/141144.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.scitotenv.2008.07.022","pdfHashValue":"e6b6049aa29f288fcf1ca0c7b067eb7b6e674e6a","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3335<\/identifier><datestamp>2014-02-12T15:49:05Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Better environmental decision making - Recent progress and future trends.<\/dc:title><dc:creator>Pollard, Simon J. T.<\/dc:creator><dc:creator>Davies, Gareth J.<\/dc:creator><dc:creator>Coley, F. J. S.<\/dc:creator><dc:creator>Lemon, Mark<\/dc:creator><dc:subject>Decision<\/dc:subject><dc:subject>Analysis<\/dc:subject><dc:subject>Environmental<\/dc:subject><dc:subject>Risk<\/dc:subject><dc:subject>Policy<\/dc:subject><dc:subject>Management<\/dc:subject><dc:description>Recent trends in risk-based decision making are reviewed in relation to novel\ndevelopments in comparative risk analysis, strategic risk analysis, weight of\nevidence frameworks, and participative decision making. Delivery of these\ninnovations must take account of organisational capabilities in risk management\nand the institutional culture that implements decision on risk. We stress the\nimportance of managing risk knowledge within organisations, and emphasise the\nuse of core criteria for effective risk-based decisions by reference to decision\nprocess, implementation and the security of strategic added value.<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2012-01-10T23:03:03Z<\/dc:date><dc:date>2012-01-10T23:03:03Z<\/dc:date><dc:date>2008-08-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>S.J.T. Pollard, G.J. Davies, F. Coley, M. Lemon, Better environmental decision\nmaking -- Recent progress and future trends, Science of The Total Environment,\nVolume 400, Issues 1-3, 1 August 2008, Pages 20-31<\/dc:identifier><dc:identifier>0048-9697<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.scitotenv.2008.07.022<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/3335<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0048-9697","0048-9697"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":["Decision","Analysis","Environmental","Risk","Policy","Management"],"subject":["Article"],"fullText":"1Science of The Total Environment, Volume 400, Issues 1-3, 1 August 2008, Pages 20-311\n2\nBetter environmental decision-making – recent progress and future trends3\nS.J.T Pollard1*, G.J. Davies1, F. Coley1 and M. Lemon24\nCranfield University, Centre for Resource Management and Efficiency, Sustainable5\nSchool of Applied Sciences, Bedfordshire, MK43 0AL, UK6\nDe Montfort University, Institute of Energy and Sustainable Development, Queens7\nBuilding, The Gateway, Leicester, LE1 9BH, UK8\nAbstract9\nRecent trends in risk-based decision-making are reviewed in relation to novel10\ndevelopments in comparative risk analysis, strategic risk analysis, weight of evidence11\nframeworks, and participative decision-making. Delivery of these innovations must12\ntake account of organisational capabilities in risk management and the institutional13\nculture that implements decision on risk. We stress the importance of managing risk14\nknowledge within organisations, and emphasise the use of core criteria for effective15\nrisk-based decisions by reference to decision process, implementation and the security16\nof strategic added value.17\n18\nKeywords: decision, analysis, environmental, risk, policy, management19\n20\n1. Introduction21\nEnvironment ministries and their regulatory agencies make decisions today that22\naffect our long term future. Increasingly, the remit of these bodies is articulated in23\nterms of an improved quality of life for current and future generations, and improved24\n*corresponding author e-mail address: s.pollard@cranfield.ac.uk (S.J.T. Pollard);\ntel: +44 (0)1234 754101; fax: +44 (0)1234 751671\n2societal resilience against environmental threats (for example, Defra, 2003; US25\nEnvironmental Protection Agency, 2006; Environment Canada, 2007). Risk26\nmanagement plays a central role in securing environmental safety and, within a27\nmodern culture of risk governance, a government’s responsibilities for managing risks28\nare shared with its stakeholders, its regulated communities, its partner departments in29\ngovernment and with citizens. Modern environmental policies need to be evidence-30\nbased and risk-informed, so that prioritised, high quality and implementable decisions31\ncan be made with the confidence of stakeholders. For policy makers, risk32\nmanagement is transdisciplinary, applied and practical. To be effective, risk33\nmanagement must be supported by peer-reviewed science that underpins an evidence34\nbase for a specific course of risk management action. When assembled in concert, the35\noverall weight of evidence from individual threads of evidence then supports36\ndecisions on how risks are best managed; for example, on the selection and operation37\nof radioactive waste management facilities, on the design of flood risk management38\nstrategies, or on the environmental safety of engineered nanomaterials released during39\nmanufacture.40\nIn this paper, we are concerned with recent developments and future trends in41\nenvironmental decision-making, particularly within the policy\/regulatory landscape.42\nThe field of environmental decision-making has been moving apace since the 1990s,43\nand the sustainable development agenda has had a marked impact on environmental44\ndecision tools; in that it has correctly forced the incorporation of economic and social45\nissues, alongside environmental impacts that have historically had greater attention.46\nSome of the important features of the debate discussed in this review are: (i) recent47\nattempts among practitioners to grapple with risk comparisons where impact end48\npoints (benefits or detriments) differ markedly; (ii) the growing influence of strategic49\n3risk assessment for informing high-level policy priorities; (iii) the interaction between50\nrisk analysis and the evidence that supports risk assessments; and (iv) the51\ndevelopment of participatory decision-making. In drawing together the literatures on52\nthese aspects, our review starts with a recent overview of risk-based decision-making,53\nrecording recent developments and setting the scene for the analysis that follows.54\n55\n2. Risks and values56\nAt their core, most environmental decisions are about balancing risk and reward;57\nloss versus gain. For risk-informed decisions, we seek to understand the significance58\nof a risk, decide whether it requires management and what that might cost, and then59\nimplement the decision effectively, so reducing the risk to an acceptable residual60\nlevel; recognising that zero risk is not achievable. Though perhaps outmoded and61\nadmittedly reductionist in approach, practitioners still find it helpful to begin by62\nconsidering risks as a combination of the consequences of an event occurring63\nmultiplied by the likelihood of those consequences. A managed risk that is reduced is64\none where either the probability of the event, or its consequences, or both, have been65\nreduced (Figure 1) from what they were originally.66\n67\nFigure 1. Risks and values68\n69\nTo manage risk well, we need to make judgements about the significance of initial70\nlevels of risk, about acceptable levels of residual risk (our risk appetite, post71\nmanagement), about the various strategies for risk reduction (P2C2 to P1C1; Figure 1),72\nabout the cost of risk reduction in light of the benefits that a managed risk brings, and73\ncritically, on our ability to implement risk management effectively and efficiently74\n4(Figure 1). Whilst Figure 1 provides analytical rationality, most debates about risk75\nboil down to discussions on individual and societal values (what is it we wish to76\nprotect, and why this particular subject of protection should have priority over other77\ndeserving subjects). Several valuable contributions exist (see, for example Wynne78\n(1997); Stirling (1997); Löfstedt and Frewer (1998); Fischer, 2000; Kasperson and79\nKasperson, 2005). Defensible decisions on managing risk should generate confidence80\namong stakeholder communities. Whilst zero risks are unattainable, most81\nstakeholders seek confidence in the environmental safety of human activities, and so82\ntheir perceptions of the likelihood of securing safety and their trust in its ‘guarantors’,83\nis never far from the centre of debate. Increasingly, stakeholders are unconvinced by84\nthe risk management intentions of governments without an accompanying discussion85\nof the motivations for risk management. They require an explanation of who will bear86\nthe cost and what the benefits will be to those who bear the risk, as well as87\ndemonstrable evidence on the long-term effectiveness of risk management actions and88\nresponsibilities for monitoring this. In times of economic trade-offs, there is a89\ncontinual need to express the points at which risks are regarded as intolerable and risk90\nreduction viewed as mandatory, without regard to cost.91\nAn important technical development has been the need to consider risks to the92\ntotal environment (air, water, soil, biota) within regulatory assessments, with the93\nattending need to integrate risks from the source of a hazard through to a range of94\nreceptors (subjects at risk of detriment). We have progressed, over the last 30 years,95\nfrom single-point deterministic risk analyses to sophisticated probabilistic expressions96\nof risk for multiple ecological impacts, basing our environmental guidelines (for97\ndrinking water, air quality and land remediation, for example) on quantitative human98\nhealth risk assessments. Alongside, contributions from the social sciences have99\n5highlighted the psychology of risk-taking, the centrality of good risk communication100\nand have challenged our hitherto technocratic approach, calling for the101\ndemocratisation of environmental decision-making (Figure 2).102\n103\nFigure 2 Proposed decision framework for ‘democratic science’ (redrawn from104\nCharnley, 2000)105\n106\nThe modern risk management frameworks (Stern and Fineberg, 1996; US Presidential107\nCommission, 1997; Charnley, 2000; Petts et al., 2003) that have emerged re-108\nemphasise the critical role of evidence and institutional knowledge, a theme to which109\nwe return later. Implementing these frameworks, however, has proved challenging110\n(Fischer, 2000). Whilst we approach 2010 having understood the limitations of111\nquantitative analysis, the complexity of environmental decisions (Figure 3) and the112\nessentiality of involving others in decisions that affect them, we do so with an ever113\npressing need to set and implement priorities that will secure our long term future,114\nfrequently having to make these decisions on incomplete and\/or contradictory115\nevidence. Do we have the risk management tools, capabilities and institutional116\ncapacities to meet this need?117\n118\nFigure 3. Categorising incertitude within environmental decision-making119\n(redrawn from Stirling, 2001)120\n121\n3. Making better environmental decisions122\nA common a practical requirement for policy makers and regulators is to express123\nand compare the value of environmental harm that might arise from a multitude of124\n6sources to a range of receptors. Comparisons have to be scientifically defensible,125\npractical and offer demonstrable outcomes for a better environment (Environment126\nAgency, 2000). However, the expression of environmental harm is by its nature127\ncontroversial because it requires an explicit statement of values: (i) the value one128\nplaces on environmental components at risk; (ii) the detriment in value that a risk,129\nonce realised, brings; and (iii) the relative value one assigns between receptors at risk130\n(Pollard et al., 2004).131\n132\n3.1 Comparing and ranking risks133\nThe issue of comparing different risks with disparate characteristics is not new.134\nThe difficulty is not so much the comparison of the relative likelihoods of occurrence,135\nbut the (adverse) impacts that may ensue; for example, how to compare ecosystem136\nstress with the potential human health effects that might ensue from prolonged137\nenvironmental exposure. The situation is difficult for environmental hazards because138\ntheir consequences are felt both in a spatial and a temporal context, and multiple139\neffects are expressed when hazards are realised – frequently to many receptors at any140\none time. The situation is complicated further by the latency of certain impacts and141\nthe irreversibility of others.142\nLike many tools in environmental policy and regulation, comparative risk143\nassessment has had its advocates and critics over the years following its emergence in144\nthe USA in the late 1980s. Most practitioners accept a compromise from theory in145\norder to reap the benefits of application, although decision analysts continue to offer146\nimproved metrics and elegant approaches (Long and Fischoff, 2000) to the147\ncombination of risks that allow a more justifiable and transparent presentation of risk148\npriorities. New developments in comparative risk analysis tend to be controversial149\n7because they force an explicit statement of values and infer (rather than evidence)150\nvarying degrees of understanding about the system under study. Comparative risk151\nassessment tools can suffer from (i) an over-simplification of the problem through the152\nuse of user-selected surrogates for harm; (ii) over-sophisticated analysis through the153\nuse of complex metrics at levels of analytical precision that exceed the level of154\ninformation available about the risk being assessed; (iii) a poor expression of155\nprobability (perhaps because quantification is seen as too difficult, i.e. tools become156\nsolely impact-focussed and thus lose their analytical power); (iv) a lack of empirical157\nrigour to the comparison of risks; and (v) poor user-friendliness and a tendency to158\nbecome bogged down in detail during application.159\nThis said, these tools have seen wide application across the policy and regulatory160\narenas, and are being used internationally to target regulatory and other institutional161\nresources towards key risks requiring management. There is a long-standing debate162\nas to whether they prove useful as a communication tool and their application is163\nusefully summarised for chemical exposures in the public health context by Williams164\n(2004). Similarly, risk-ranking matrices have been employed that adopt simple165\nprobability consequence scores. Frodsham and Cardew (2000) used such an approach166\nfor evaluating new technologies for water treatment. In their work, risk scores for a167\nnumber of technologies were informed by a failure mode and thus allow analysis of168\nthe treatment technology combined with expert judgement on the likely impacts of169\nfailure. Similar comparative analyses have been used widely in a range of forms, for170\nexample, in:171\n technology assessment for:172\n energy supply technologies (Ramanathan, 2001);173\n8 the reliability of bridges (combined with reliability assessment) (Stewart,174\n2001; Stewart et al., 2001);175\n environmental remediation technologies (Bonano et al., 2000).176\n managing chemicals and pathogens in the environment, e.g.177\n by ranking pollution inventories (Gamo et. al., 2003; Lerche et al., 2004);178\n by ranking pesticide products (Finzio et al., 2001; Lee et al., 2002; Low et179\nal., 2004);180\n assessing the relative risk from exposures to volatile organic compounds in181\ndrinking water (Williams et al., 2002), and to consumers from seafood182\n(Sumner and Ross, 2002) and chicken products (Brown, 2002);183\n for ranking the risk of pharmaceuticals in surface waters (Sanderson et al.,184\n2004) and exposures from landfills (Vrijheld et al., 2002)185\n for prioritising contaminated site remediation (Grumbly, 1997).186\n comparing ecosystem impacts (only) in catchment-level impact assessments187\n(Serveiss et al., 2004).188\n Developing the basis for environmental health policy priorities (Wong et al.,189\n2003).190\n in policy development:191\n informing the health impact assessment of transport policies in Australia192\n(Dora, 2003; Kjellstrom et al., 2003);193\n as input to bans on asbestos (Camus, 2001);194\n for informing pollution reduction strategies (Pennington and Bare, 2001;195\nLerche et al., 2002);196\n for informing regional catchment management plans (Tran et al., 2002).197\n198\n9Informed by the comparative risk analysis carried out by the US Environmental199\nProtection Agency in 1987 (USEPA, 1987) and application to a myriad of policy200\nproblems, consensus is developing on the relative merits and challenges of applying201\nthese techniques. Andrews et al. (2004a,b) note the use of spurious precision in risk202\nrankings – so-called ‘analytical over-reaching’; calls for normative approaches that203\nare rarely applied in practice; and an unease among practitioners regarding the204\npresentation of uncertainty in strategic level analysis with a tendency, having205\nacknowledged uncertainty is inherent, to then ignore it in practice.206\nPerhaps the most comprehensive attempt to tackle the issue of metrics and207\nuncertainty under authentic conditions was undertaken by the New Jersey208\ncomparative risk project (NJDEP, 2003). This study identified 88 individual209\nenvironmental stressors in 11 broad hazard categories. In their summary, Andrews et210\nal. (2004b) concluded that, despite considerable analysis and interrogation of data by211\nmultiple expert panels, the analytical ‘constructed aggregation’ methodology adopted212\nthrew little new light on the multiplicity of these risks. The project steering213\ncommittee resorted to a risk sorting approach whereby the 88 threats were assessed214\nusing a range of risk prioritisation techniques, e.g. environmental threats with high215\nhuman health, ecological and socio-economic impacts were ranked higher than those216\nwith lower impacts. The results of the individual techniques used were compared and217\nthose threats of consistent high priority across a range of techniques identified as high218\npriority overall. Four clusters of threat were deemed of greatest importance; those219\nassociated with land use change, indoor pollution, outdoor pollution and invasive220\nspecies. Andrews et al. (2004a) assert that a ranked list of priorities has only limited221\nvalue when the science is not in place to support such a list and that, for future222\nexercises, emphasis should be on gathering evidence in support of the prioritisation.223\n10\nRecent developments in cumulative effects assessment (CEA) as required under224\nthe EU environmental impact assessment (EIA) directives (85\/337\/EEC and225\n97\/11\/EC) and strategic environmental assessment (SEA) directive (2001\/42\/EC) are226\nrequiring practitioners to manage the aggregation of environmental effects past,227\npresent and in the reasonably foreseeable future. At the strategic level (Therivel,228\n2004), a plan or programme of activity (e.g. a large multistage development) may be229\nlinked to infinite cumulative effects. The aggregation of impacts is usually focussed230\nat the receptor level (James and Stewart, 2004) because the capacity of the receptor to231\naccommodate the additional stress associated with a plan, project or programme of232\ndevelopment, is a principal concern in a CEA. Critical factors, from a receptor233\nstandpoint, are the sensitivity and vulnerability of receptors to withstand the234\nadditional stress caused by the activity. Taken together, these represent the235\nvulnerability of a receptor. Much of the guidance on the aggregated (cumulative)236\neffects of past, present and future stresses, however, is light on the metrics of237\naggregation. The reflections of long-standing observers of comparative risk analysis238\nare noteworthy, e.g. Fischoff, 1995; Morgan et al., 1996; van Asselt, 1999;239\nMorgenstern et al., 2000; DeKay et al., 2001; Andrews et al., 2004b Linkov et al.,240\n2005:241\n Risk rankings are necessarily imperfect. At the strategic level, uncertainties242\nare huge and stakeholder involvement in metrics and process offer no243\nguarantee of the removal of this ambiguity.244\n Few current exercises afford the time required to understand the process of245\nranking risks, let alone the data on which risks should be ranked. Morgan et246\nal. (1996) suggested an approach involving five meetings and taking 9–11247\ndays to complete. This contrasts with the 0.5–1 day workshops typically248\n11\nused to rank a plethora of strategic risks. The clustering of issues as249\nperformed in the New Jersey Comparative Risk Project (NJDEP, 2003) may250\noffer real merits in terms of time spent on these exercises.251\n There is a danger, as with all risk analyses, that prioritisation becomes the252\nend in itself rather than what is done to manage the risk.253\n Notwithstanding the myriad of metrics and project-specific approaches,254\nthere appears to be a developing consensus of the value of the following255\napproach to ranking risks (Figure 5).256\n257\nFigure 4. Steps in a risk ranking model (after Florig et al., 2001)258\n259\n There appears to be a move towards adopting multicriteria analysis (MCA)260\nin preference to comparative risk analysis – perhaps in recognition of the261\nanalytical complexities and the ready availability of methods for MCA262\n(Linkov et al., 2005). These authors reject the concept of a risk optimised263\noption or set of priorities in favour of an adaptive management style, where264\nthe dynamics of knowledge and data on risks are acknowledged and265\nmanagement strategies adapted accordingly.266\n267\n3.2 Involving others268\nThe modern analytic–deliberative approach to risk management (Stern and Fineberg,269\n1996; US Presidential\/Congressional Commission, 1997a,b; RCEP, 1998; Charnley,270\n2000) suggests that wider stakeholder participation should be considered during the271\ninitial framing of the issue or problem; during the identification of data and272\ninformation needs; as risk assessors discuss how uncertainty will be managed in the273\n12\nassessment; during the risk assessment itself; and during evaluation of risk estimates.274\nThere remains a need to establish at which of these stages, and in what ways,275\nparticipation can be most meaningfully incorporated. The challenge is to develop276\ninformed processes that enable decisions involving science to be debated widely in a277\nsocial context (Sexton et al., 1999; Fischer, 2000). Even at the international level278\nexperience is limited, though there are increasing attempts to apply participative279\nprocesses to policy, plan and project-level decisions involving risk, with many280\nprojects now incorporating participative approaches to the framing of risk problems.281\nThese processes can be effective in reaching decisions, but a more inclusive and282\ndeliberative process does not automatically secure consensus. Indeed, involving283\npublics may result in more diversity in opinion rather than consensus.284\nCriteria for effective participatory decision processes have been developed where285\nrisk is an important issue within the decision (Homan et al., 2001). These reflect286\nbroader criteria for effective public participation incorporating the key principles of (i)287\nclarity of objectives; (ii) representativeness; (iii) inclusivity; (iv) openness; (v)288\ndeliberation; (vi) social learning; and (vii) decision responsiveness. For289\nenvironmental regulators, these are complex issues with far reaching consequences for290\npolicy, resources and practical issues, which require careful consideration. With291\nparticipation an accepted feature of better environmental decision-making (Fischer,292\n1995; Perhac, 1998; Apostolakis and Picket, 1998) the quality of participatory293\ndecisions and tools for incorporating stakeholder views has been subject to scrutiny.294\nBeierle (2002) presents an account of 239 published case studies of stakeholder295\ninvolvement in decision-making, ranking the quality of the decisions by whether:296\n decisions were more cost-effective than likely alternatives;297\n13\n decisions increased joint gains among parties compared with the likely298\nalternatives;299\n participants contributed innovative ideas, useful analysis or new information;300\nand whether301\n participants had access to scientific information and expertise.302\nIn this analysis, the more intensive forms of stakeholder involvement (processes303\ninvolving negotiations and mediations) produced higher quality decisions, suggesting304\nthat more effort and time are required to engage stakeholders in strategic risk issues305\nthan is currently provided. The companion papers by Florig et al. (2001) and Morgan306\net al. (2001) discuss the value of deliberation itself within a group. Using a307\ndeliberative quantitative method for ranking 22 high school health and safety risks,308\nfirst by individuals and then following a group discussion, these authors demonstrate309\nthe value of group discussion to fostering consensus. They make the point that where310\nrisk rankings are to be used by regulatory agencies they must be both normatively311\njustifiable and empirically validated if the rankings are to have credibility. The312\nauthors set out criteria for good ranking methods. For Florig et al. (2001), a good313\nranking method should:314\n make use of available theory and empirical knowledge in behavioural social315\nscience, decision theory and risk analysis;316\n encourage those ranking risks to systematically consider all relevant317\ninformation;318\n assist individual participants in expressing (or constructing) internally319\nconsistent rankings;320\n ensure that participants understand the procedures and feel satisfied with both321\nthe process and products of a ranking exercise; and322\n14\n describe the level of agreement and the sources of disagreement among323\nparticipants.324\nEnglish (2000) argues that a shift towards emphasising the ‘long term common good’325\nin a spirit of ‘collaborative learning’ is required for those strategic risk issues326\ncommonly addressed by policy-makers, regulators and their advisers. However, it is327\nalso argued that the possibility of adequate representation for each stakeholder type328\nand of securing an equal balance of types within the decision-making process329\ndiminishes substantially at this level. This is a long-term project that lacks330\nmethodological guidance. Meanwhile, policy-makers and regulators face the practical331\nchallenge of how to defensively and robustly take account of a multitude of332\nstakeholder views on risk issues of strategic importance – many of which are viewed333\nby interest groups as contentious single issues in their own right. In response, the334\ngathering, structuring and presentation of evidence in support of risk-based decisions335\nhas gathered new momentum.336\n337\n3.4 Direction, strength and weight of evidence338\nPolicy decisions are required to be risk- and evidence-based, not least because339\nstakeholders expect to see, and be able to critique the supporting science upon which340\ndecisions are based. Decision-makers need to assemble lines of evidence for341\ncomplex, multi-attribute decisions (e.g. the long term performance of radioactive342\nwaste repositories, the viability of carbon capture and storage technology, the343\nenvironmental safety of nanomaterials), make judgements on the direction (supportive344\nof a hypothesis or not) of individuals lines of evidence, and then on the overall weight345\nof evidence as a whole. This process in itself requires methodology and structure.346\nThere is an established literature on weight of evidence (WOE) approaches developed347\n15\nin the fields of medical evidence, forensic science and radioactive waste management,348\nwith some applications to environmental risk (Mayo and Hollander, 1991; US Nuclear349\nWaste Technical Review Board, 2001; Smith et al., 2002; Hrudey and Leiss, 2003;350\nWeed, 2005; Krimsky, 2005). Among some users, presenting complementary and\/or351\ndiscordant lines of reasoning has been enhanced by the use of influence diagrams,352\nevidential support logic (Benbow et al., 2006) and belief nets, that act as visual353\nmechanisms to support the presentation of interwoven evidence. Valuable examples354\nexist. For example, Gray et al. (2004) provide an authoritative example of a WOE355\nevaluation for the reproductive toxicity of bisphenol A, and Popp et al. (2006) offer a356\nsimilar appraisal for the cancer dose-response characteristics of 2,3,78-TCDD.357\nBurton et al. (2002) set out a WOE framework for assessing ecological detriment.358\nEnvironmental decisions make use of data, concepts and assumptions for359\nwhich a range of evidence of varying quality exists. In these cases, the assessor may360\nneed to choose between competing theories (e.g. in low dose extrapolation), a range361\nof individual baseline studies (e.g. arsenic in drinking water) or a palette of future362\nenvironmental scenarios (e.g. climate change). Such analyses involve evaluating both363\ncomplementary and potentially conflicting lines of reasoning, the direction and364\nindividual strength of which must be assessed in support of a specific line of argument365\n(see Bowden, 2004). Assembling such evidence within a framework of precaution,366\nhas long been a requirement of the safety cases prepared for large process plant and367\nradioactive waste disposal, but equally has application to emerging threats where368\nthere exists a paucity of supporting science, such as the management of exposures369\nfrom engineering nanomaterials (Linkov et al., 2007; Rocks et al., in press). Generic370\nquestions on evidence and lines of reasoning pertinent to the risk assessment must be371\nanswered (US Nuclear Waste Technical Review Board, 2001):372\n16\n How does a policy advisor weigh\/prioritise quantitative evidence alongside373\nqualitative lines of reasoning that support other types of argument?374\n How does this weighting change with time and the introduction of new375\nevidence?376\n Which arguments are most and least convincing to publics, in which formats,377\nand why?378\n How do policy implementers (e.g. regulators, operators) manage the379\nintegration of evidence?380\n In what depth should policy advisors and or regulators develop an independent381\nview of the evidence that support a specific policy outcome?382\nCriteria for evaluating the strength of evidence are published. For example,383\nBradford Hill’s criteria (Hill, 1965) attempt to separate causal from non-causal384\nassociations between agents and disease (Hofler, 2005) by reference to:385\n1. strength of association (a strong association is likely to have a causal386\ncomponent);387\n2. consistency (reproducibility);388\n3. specificity;389\n4. temporality (effect succeeds action or factor);390\n5. biological gradient (dose response);391\n6. plausibility (biological explanations);392\n7. coherence (agrees with current knowledge);393\n8. randomised experiments (good study design); and394\n9. analogy (effect has already been shown).395\nKlimisch et al. (1997) present a systematic evaluation of the quality of toxicological396\ndata, adopting a ranking system:397\n17\n1 = reliable without restrictions. Where the data was generated according to398\ninternationally accepted (or validated) testing guidelines and preferably secured399\nunder good laboratory practice (GLP) or where the test parameters are closely400\nrelated to a guideline method;401\n2 = reliable with restrictions. Where the data was secured mostly according to GLP402\nand where the test parameters do not totally comply with the testing guideline, but403\nare considered sufficient to accept the data;404\n3 = not reliable. Where there were interferences between the measuring system and405\nthe test substance, or in which the test systems were used which are not relevant in406\nrelation to the exposure, or were generated using an unacceptable method;407\n4 = not assignable. The experimental details provided were not sufficient and were408\nonly listed in short abstracts or secondary literature.409\nThese evaluation criteria have been applied to many chemical risk assessment410\nmethods and have proved to be an acceptable method of determining the quality of the411\ndata supporting chemical risk estimation and characterisation.412\nBowden (2004) presents a valuable suite of quality indicators for scientific413\nevidence (Table 1), stressing the criticality of well-managed knowledge and414\ndescribing the sufficiency (relative significance), dependency (commonality between415\ncontributing lines of evidence) and necessity of evidence.416\n417\nTable 1 Quality indicators for scientific evidence (after Bowden, 2004)418\n419\nIn seeking to explicitly account for uncertainty, the evidence support logic420\nproposed allows for evidence that supports a hypothesis; that which does not support a421\nhypothesis and importantly, for a residual amount of uncommitted belief (Figure 6;422\n18\nBowden, 2004; Benbow et al., 2006). Individual lines of evidence, simplified and423\nillustrated in part for carbon capture and storage in Figure 6, may then be structured424\nand evaluated in concert.425\nPossessing the institutional capacity to perform these evaluations of evidence is426\nrare in practice. Further, evidence alone is insufficient for sound decision-making –427\nthere is an organisational cultural component that becomes increasingly important as428\nthe ‘shelf-life’ of organisational knowledge on how risks are best managed shortens.429\nThe practical and preventative management of environmental risk can only be secured430\nby wise organizations that manage their science and evidence base, and that431\nunderstand the institutional factors that influence the success of risk management432\nmeasures (Pollard et al., 2007; MacGillivray and Pollard, 2008).433\n434\nFigure 5. Basis for, and application of, evidence based (3-value) logic to carbon435\nstorage and capture decisions (partial tree for illustration; after Benbow et al.,436\n2006)437\n438\n4. Institutional issues439\nThe delivery of risk management, be it in the design and build of new flood440\ndefences, in the operation of new technology for managing wastes as resources, or in441\nthe authorisation of new chemicals or novel materials, ultimately relies on442\ninstitutional capabilities to assess, manage and communicate risk. People, the443\ninstitutions in which they work, organisational structures and the management of444\nknowledge all impact on the efficiency and effectiveness of risk management. Good445\nenvironmental decisions are those that can be readily implemented and ‘best-in-class’446\norganisations are better at managing risks and opportunities wisely, learning from447\n19\nfailure, and they exhibit resilience (robustness to shock) and agility (adaptive and448\nforward-looking) within a changing business climate (Pollard et al., 2007). They449\nrecognise that a maturity of capability is not secured solely through having risk450\nframeworks, risk assessment tools, audit trails, risk champions and risk registers in451\nplace. Government departments are no different, in that they strive to develop452\npolicies that can have most effect, alongside other strategic objectives. The453\nmanagement of risk knowledge becomes central (Figure 6).454\n455\nFigure 6. Managing risk knowledge is central to effective risk management.456\n457\nFor an organisation to make effective risk-based decisions it must be able to458\noperate effective risk management processes, including the articulation of clear459\nobjectives and problem definition; it must be able to evaluate the implementation of460\nrisk management; and it must be able to secure, among other benefits, the strategic461\nadded value that comes with mature risk management - all this, within an462\norganisational context in which decisions are made by people with access to data,463\ninformation, knowledge and evidence.464\nMany authors view the organisation as a complex social system composed of a465\nvariety of organisational facets (Beer, 1998; Senior, 2002). Subsequently, when466\nattempting to implement change at an organisational level there are many perspectives467\nto consider. ‘Organisational culture’ is a term frequently used to describe the core468\npersonal, communal and organisational views, values and norms of an organisation469\n(Denison, 1984; Cameron and Quinn, 1999). It is suggested that a strong470\norganisational culture has the ability to influence behaviours including organisational471\n20\nperformance, staff commitment, motivation and efficiency, and job satisfaction to472\nname a few (Denison, 1984; de Gilder, 2003; Fischer, 2005).473\nThe literature suggests that developing relationships with external organisations474\nand the maintenance of a strong social network is a key component to sustained475\ngrowth and the ability to respond to opportunities, challenges, risks and limitations476\npresented by the external environment (Mullins, 2002). This is particularly crucial477\nwithin environmental management where organisations are required to constantly478\nkeep up to date with rapidly developing requirements and legislation. Maintaining a479\nwell-built internal social network, supporting both formal (e.g. role based) and480\ninformal (e.g. casual, opportunistic interaction), is also central to the implementation481\nof a risk based culture. Internal ties can have a substantial impact upon the482\ncommitment, motivation and performance of staff (Smith, 2007) and are possibly the483\nmost effective tool for the capture, assimilation and sharing of knowledge within an484\norganisation (Claver-Cortes et al., 2007). For this reason authors suggest that human485\nrelations should be valued above any technological tools or mechanisms for effective486\nknowledge management (Pyoria, 2007).487\nValuable knowledge is often tacitly tied to individuals within an organisation488\n(Marouf, 2007); subsequently it has been suggested that organisations must adopt489\norganisational structures that allow them to create and transfer as much knowledge as490\npossible. Typically it has been suggested that adopting a flatter structure encourages491\nthe effective integration of knowledge (Claver-Cortes et al., 2007). Effective492\ncommunication, leadership style and the development of trust also have a substantial493\ninfluence over how knowledge is managed within an organisational context.494\nEffective communication is crucial within the context of a risk based culture as issues495\nrelating to risk are frequently misunderstood. By extension, communication has a496\n21\nstrong influence over processes of organisational change. A transparent network497\n(Moenaert et al., 2000), face to face interaction (Pyoria, 2005) and a shared context of498\nunderstanding are all thought to aid improved decision making and enhanced499\ncommunication skills between members of a team or organisation.500\nResearch into management and leadership within organisations has varied results501\n(Andersen, 2006). The traits required of apparently successful leaders are vast502\n(Senior, 2002) and the effects of individual behaviour and personalities of leaders503\nupon organisational success are unclear. However, leaders do have influence over504\nindividual and organisational behaviours (Sadri and Lees, 2001) and this should be505\nacknowledged within the implementation of effective risk management. The utility506\nsectors (energy, water, waste) are currently expressing substantial interest in the507\nmechanics of implementing risk management within their organisations because of508\nthe issues of security of supply, the perceived vulnerability and aging of national509\ninfrastructures and a re-emergence of the public health imperative, within drinking510\nwater supply for example. An executive lead on risk management is seen as crucial511\nwithin these sectors and essential to setting the tone of the organisation.512\nTrust has also been highlighted as a component that has a strong influence over513\nthe other factors presented within this process (Burke et al., 2007); enabling514\ncooperation (Tyler, 2003), creating high morale and efficiency (Pyoria, 2007), and515\nmaintaining a competitive advantage (Young, 2006).516\n517\n5. Conclusions - core criteria for better environmental decisions518\nHaving reviewed the organisational aspects of decision-making and summarised519\nthe development of risk-based regulation, it would seem appropriate to pose the520\nquestion: ‘what makes for a high quality, risk-informed decision?’ A substantive521\n22\nliterature exists on decision analysis. Good decisions deliver the aims and objectives522\nthey set out to achieve. Better decisions adopt a participative approach and deliver523\ncosted options. The definition of the problem (what are we trying to achieve and524\nwhy?) and identification of decision attributes are universal requirements. For risk-525\nbased decisions, these translate into a need to articulate the ‘risk of what to whom?’526\nand a level of tolerable residual risk (post management) – the risk appetite. Risk527\nassessments should identify those features of the problem that contribute most to the528\nrisk and so, properly applied, an effective risk management process should deliver529\ncosted options and provide direction on the targeting of resources towards a530\nprioritised set of risk management actions.531\nDecisions that are not implemented well are of little value. The project,532\nprogramme and appraisal literature places a firm emphasis on the importance of533\nimplementation and post-implementation evaluation. All too often, risk analyses are534\nundertaken, risk management actions designed and their effectiveness left unchecked.535\nThus implementation and evaluation are critical to ensuring the desired outcomes are536\nsecure.537\nFinally, effective decisions secure benefits and thus value. ‘Value trees’ are one538\nmeans of presenting the benefits of a decision alongside the costs and thus allowing a539\nqualitative weighted average of the benefits assigned to a decision. However540\ncaptured, it is important that the collation of benefits from a decision is complete and541\nsuitably aggregated. Organisations frequently miss the strategic added value to the542\norganisation itself that comes with risk-based decision-making, yet this is increasingly543\ncritical to securing executive buy-in to decisions. Organisations manage risks544\npreventatively because they understand that prevention is better than cure, that threats545\nto business interruption must be managed, and increasingly, because intangible546\n23\nconsequences, such as reputational damage, can sometimes overwhelm monetisable547\nlosses. Most organisations manage risk in a climate of constrained resources548\nhowever, and need to make risk-informed decisions because they have to target their549\ntop risks and apply resources to the features of a risk that makes the most contribution550\nto reducing business exposure. Environmental policy makers and regulators are no551\ndifferent, in that they need to focus regulatory effort where they can have most effect,552\nalongside other objectives. In adopting this approach, organisations seek the strategic553\nadded value of these decisions over and above the loss avoided through preventative554\nrisk management (Figure 1). In evaluating the quality of risk-based decisions, the555\nauthors seek to fulfil these basic criteria:556\n557\nCriterion 1: an effective decision-making process has been adopted, complete with558\nunambiguous problem definition;559\nCriterion 2: the decision has been subject to implementation and evaluation to560\nensure the intended outcomes have been secured; and561\nCriterion 3: that strategic added value has been secured as a result.562\n563\nIn setting out these base criteria, we emphasise the need to be very clear about the564\nstarting and finishing points for risk reduction – one must understand what the565\nresidual risk will be, post management – and the need to accrue both the monetisable566\nand non-monetisable costs and benefits, in order that the true value of the decision can567\nbe evaluated. Further, an emphasis on the strategic added value of risk management568\nis representative of the observation that best-in-class organisations turn a high569\ncapability in risk management to their strategic advantage. Their risk management570\ncapability becomes a strategic asset; their stakeholders have greater confidence in the571\n24\ndecisions the organisation makes; and the organisation correspondingly finds it easier572\nto secure investment and support for their future business strategy. This should not be573\nunderestimated for government organisations, which are increasingly under the behest574\nof spending reviews and efficiency savings in times of expanding regulatory remits575\nand reduced public finance.576\nGood environmental decision-making is more than being risk-informed and577\nevidenced-based. It embodies the expectations of participative involvement, of578\ntechnical competency in decision analysis and of organisational maturity that ensure579\nthat decisions ‘stick’ and that residual risk is monitored. Risk analysis has contributed580\nmuch to the field, allowing us to focus on the critical parts of the problem and so581\nprioritise actions. We expect the issues raised in this review to develop further – with582\nmore in-depth exploration of risk comparisons, bespoke weight of evidence583\nframeworks for individual risks and the benchmarking of organisational risk584\nmanagement capabilities. The language of risk remains a problem for most audiences585\nand despite a wide literature, risk managers, researchers and policy specialists586\ncontinue to become unseated in media and public settings when explaining risk587\nmanagement actions. Publics understand ‘safety’ as a concept and imbue the term588\nwith notions of confidence and responsibility. In contrast, risk is often negatively589\nassociated with official attempts to ‘soften the blow’ from something hazardous and590\nlikely to cause harm. In some settings, risk assessments themselves have become591\nhighly contentious. We view this as a critical ongoing issue on which to provide592\nadvice to Governments, as they seek to better explain their actions to citizens and their593\nstakeholders.594\n595\n25\nAcknowledgements596\nThe authors wish to acknowledge support from the Environment Agency (EA) of597\nEngland and Wales and of Phil Irving, Jens Evans, Jimi Irwin, Roger Yearsley,598\nRichard Owen, Colin Foan and Mark White. The themes raised in this review have599\nbeen progressed in EA projects RIS-05-01 (comparative risk assessment) and600\nSC070055 (effectiveness of risk-based decisions). GJD is funded on and Engineering601\nand Physical Sciences Council grant (EP\/EO17975\/1). The views expressed herein602\nare the authors’ alone.603\n604\nReferences605\nAnderson JA. Leadership, personality and effectiveness. J Socio Econ 2006;35:1078-606\n91.607\nAndrews CJ, Apul DS, Linkov I. Comparative risk assessment: Past experience,608\ncurrent trends, and future directions. In I. Linkov & A. Ramadan (Eds.),609\nComparative Risk Assessment. Amsterdam: Kluwer 2004.610\nAndrews CJ, Hassenzahl DM, Johnson BB. Accommodating uncertainty in611\ncomparative risk. Risk Anal 2004b;24(5):1323–35.612\nApostolakis GE, Pickett SE. Deliberation: integrating analytical results into613\nenvironmental decisions involving multiple stakeholders. Risk Anal614\n1998;18(5):621–34.615\nBeer M. Organizational Behaviour and Development. Harvard Business School616\nWorking Paper Series 1998;98. Available at617\nhttp:\/\/www.hbs.edu\/research\/facpubs\/workingpapers\/papers2\/9798\/98-115.pdf.618\nAccessed on August 11, 2007.619\nBenbow S., Metcalfe R. and Egan M., Handling uncertainty in safety assessments for620\n26\nlong term geological storage of CO2, in Proc. 8th International Conference on621\nGreenhouse Gas Control Technologies, 19-22 June 2006, Trondheim, Norway,622\n2006; 6pp.623\nBeierle TB. The quality of stakeholder-based decisions. Risk Anal 2002;22(4):739-49.624\nBonano EJ, Apostolakis GE, Salter PF, Ghassemi A, Jennings S. Application of risk625\nassessment and decision analysis to the evaluation, ranking and selection of626\nenvironmental remediation alternatives. J Hazard Mater 2000;71:35–57.627\nBowden R. Building confidence in geological models. In: Curtis A and Wood R628\n(eds.) Geological prior information: informing science and engineering.629\nGeological Sociaety, London, Special Publications, 2004; 239: 157-173.630\nBrown MH. Quantitative microbiological risk assessment: principles applied to631\ndetermining the comparative risk of salmonellosis from chicken products. Int632\nBiodeter Biodegr 2002;50:155–160.633\nBurton Jr GA, Batley GE, Chapman PM, Forbes VE, Smith EP, Reynoldson T,634\nSchlekat CE, Den Besten PJ, Bailer AJ, Green AS, Dwyer RL. A weight-of-635\nevidence framework for assessing sediment (or other) contamination: Improving636\ncertainty in the decision-making process. Hum Ecol Risk Assess 2002;8(7):1675-637\n96.638\nBurke C, Sims D, Lazzara E, Salas E. Trust in leadership: a multi-level review and639\nintegration. Leadersh Q 2007;18:606-32.640\nCameron KS, Quinn RE. Diagnosing and Changing Organisational Culture: Based on641\nthe Competing Values Framework. Addison-Wesley, New York; 1999. p. 72-104.642\nCamus M. A ban on asbestos must be based on a comparative risk assessment. Can643\nMed Assoc J 2001;164(4):491–4.644\n27\nCharnley G. Enhancing the role of science in stakeholder-based risk management645\ndecision-making [online]. Knoxville, Tennessee, USA: RiskWorld, 2000.646\nAvailable at: http:\/\/www.riskworld.com\/Nreports\/2000\/Charnley\/NR00GC00.htm.647\nAccessed on August 11, 2005.648\nClaver-Cortes E, Zaragoza-Saez P, Pertusa-Ortega E. Organizational structure649\nfeatures supporting knowledge management processes. J Know Manage650\n2007;11(4):45-57.651\nDefra. Department for Environment, Food and Rural Affairs. Our strategic plan652\n2003-2006. Defra, London, 44pp.653\nde Gilder D. Commitment, trust and work behaviour: The case of contingent workers.654\nPers Rev 2003;32(5):588-672.655\nDeKay ML, Florig HK, Fischbeck PS, Morgan MG, Morgan KM, Fischhoff B, Jenni656\nKE. The use of public risk ranking in regulatory development. In Improving657\nRegulation: Cases in Environment, Health, and Safety. ed. P S Fischbeck and R S658\nFarrow. Washington, DC: Resources for the Future 1984:208–230.659\nDenison DR. Bringing corporate culture to the bottom line. Organ Dyn 1984;13(2):4-660\n22.661\nDora C. What can health impact assessment add to comparative risk assessment in662\ndecision-making? B World Health Organ 2003;81(6):460.663\nEnglish MR. Stakeholders in environmental risk decisions. RISK: Health, Safety and664\nEnvironment. Book Reviews 2000;11(3):243–56.665\nEA. Environment Agency. A strategic approach to the consideration of environmental666\nharm. National Centre for Risk Analysis and Options Appraisal (NCRAOA)667\nBristol: Environment Agency Report, 36; 2000a.668\n28\nEA. Environment Agency. Environment 2000 and beyond. Bristol: Environment669\nAgency; 2000b. p. 76–77.670\nEnvironment Canada. Sustainable development strategy 2007-2009, Environment671\nCanada, Ontario, 2007: 35pp.672\nFinizio A, Calliera M, Vighi M. Rating systems for pesticide risk classification on673\ndifferent ecosystems. Ecotoxicol Environ Saf 2001;49:262–74.674\nFischer F. Revisiting organizational politics: the postempiricist challenge. Policy and675\nSociety 2005:1-23.676\nFischer G. Social Creativity: turning barriers into opportunities for collaborative677\ndesign. Proceedings of the Participatory Design Conference (PDC’04). University678\nof Toronto, Canada; 2005:152-161.679\nFischer F. Hazardous waste policy, community movements and the politics of Nimby:680\nparticipatory risk assessment in the USA and Canada. In Fischer F, Black M,681\neditors. Greening Environmental Policy: The Politics of a Sustainable Future. St.682\nMartin Press, New York; 1995. p. 165–182.683\nFischer F. Citizens, experts, and the environment – the politics of local knowledge.684\nDuke University Press, Durham, 2000.685\nFischhoff B. Ranking risks. RISK: Health, Safety and Environment 1995;6:191–202.686\nFlorig HK, Morgan MG, Morgan KM, Jenni KE, Fischhoff B, Fischbeck PS, DeKay687\nML. A deliberate method for ranking risks (I): overview and test bed688\ndevelopment. Risk Anal 2001;21(5):913–921.689\nFrodsham DA, Cardew PT. Using comparative risk assessment in the evaluation and690\ndevelopment of new technologies. Bristol Business School Teaching and Research691\nReview 2000;(2). Available at http:\/\/www.uwe.ac.uk\/bbs\/trr\/Issue2\/Is2-4_4.htm.692\nAccessed on August 11 2005.693\n29\nGamo M, Oka T, Nakanishi J. Ranking the risks of 12 major environmental pollutants694\nthat occur in Japan. Chemosphere 2003;53:277–84.695\nGray GM, Cohen JT, Cunha G, Hughes C, McConnell EE, Rhomberg L, Sipes IG,696\nMattison D. Weight of the evidence evaluation of low-dosereproductive and697\ndevelopmental effects of bisphenol A. Hum Ecol Risk Assess 2004;10(5):875-698\n921.699\nGrumbly TP. Comparative risk analysis in the department of energy. In Risk in the700\nRepublic: Comparative Risk Analysis and Public Policy. Proceedings of Second701\nAnnual Cummings Colloquium on Environmental Law. Duke Environmental Law702\nand Policy Forum 1997;8(1):23–32.703\nHill, AB. The environment and disease: association or causation? Proc. Roy Soc Med,704\nLondon, 1965; 58:295-300705\nHofler, M. The Bradford Hill considerations on causality: a counterfactual706\nperspective. Emerg Themes Epidemiol, 2005; 2:11-20707\nHoman J, Petts J, Pollard SJT, Twigger-Ross C. Participatory risk assessment for708\nenvironmental decision-making. In Proceedings VALDOR 2001: 2nd VALDOR709\nSymposium Addressing Transparency in Risk Assessment and Decision-Making710\n(Stockholm, 10–14 June 2001), edited by Andersson K. 2001:398–406.711\nHrudey SE, Leiss W. Risk management and precaution: Insights on the cautious use712\nof evidence. Environ Health Persp 2003;111(13):1577-81.713\nJames E, Stewart G. Cumulative effects assessments and SEA. Environmentalist714\n2004;23:25–7.715\nKasperson, JX and Kasperson, RE (eds.). The social contours of risk, Volume II,716\nEarthscan, London, 2005; 326pp.717\nKjellstrom T, Kerkhoff LV, Bammer G, McMicheal T. Comparative assessment of718\n30\ntransport risks – how it can contribute to health impact assessment of transport719\npolicies. B World Health Organ 2003;81(6):451–7.720\nKlimisch, HJ, Andreae M, Tillmann, U. A systematic approach for evaluating the721\nquality of experimental toxicological and ecotoxicological data. Reg Toxicol722\nPharmacol 1997; 25:1-5723\nKrimsky, S. The weight of scientific evidence in policy and law. Am. J. Public724\nHealth 2005; 95(S1): S129-S136.725\nLee S, McLaughlin R, Harnly M, Gunier R, Kreutzer R. Community exposures to726\nairborne agricultural pesticides in California: ranking of inhalation risks. Environ727\nHealth Persp 2002;110(12):1175–84.728\nLerche D, Brüggemann R, Sørensen P, Carlsen L, Nielson OJ. A comparison of729\npartial order technique with three methods of multi-criteria analysis for ranking of730\nchemical substances. J Chem Info Comp Sci 2002;42:1086–98.731\nLerche D, Matsuzaki SY, Sørensen PB, Carlsen L, Neilson OJ. Ranking of chemical732\nsubstances based on the Japanese pollutant release and transfer register using733\npartial order theory and random linear extensions. Chemosphere 2004;55:1005–734\n25.735\nLinkov I, Satterstrom K, Kiker G, Ferguson E, Bridges T. Multi-criteria decision736\nanalysis and adaptive management: a review and framework for application to737\nSuperfund sites. In Macey GP, Cannon J, editors. Reclaiming the Land:738\nRethinking Superfund Institutions, Methods and Practices. Springer, New York,739\n2004.740\nLinkov, I., Satterstrom, K, Steevens, J, Ferguson, E, Pleus, RC. Multicriteria decision741\nanalysis and nanotechnology, J. Nanoparticle Res. 2007; 9:543-554.742\nLöfstedt R and Frewer L (eds.) The Earthscan reader in risk and modern society,743\n31\nEarthscan, London, 1998; 278pp.744\nLong J, Fischhoff B. Setting risk priorities: a formal model. Risk Anal745\n2000;20(3):339–51.746\nLow F, Lin H, Gerrard JA, Cressey PJ, Shaw IC. Ranking the risk of pesticide dietary747\nintake. Pest Manag Sci 2004;60:842–48.748\nMacGillivray, BH and Pollard, SJT What can water utilities do to improve risk749\nmanagement within their business functions? An improved tool and application of750\nprocess benchmarking, Environ. Intl. 2008; in press751\nMayo D, Hollander R. Acceptable Evidence: Science and Values in Risk752\nManagement. Oxford University Press, New York, 1991.753\nMoenaert RK, Caeldries F, Lievens A, Wauters E. Communication flows in754\ninternational product innovation teams. J Prod Innovat Manag 2000;17(5):360-77.755\nMorgan MG, Fischhoff B, Lave L, Fischbeck P. A proposal for ranking risk within756\nfederal agencies. In: Davies JC, editor. Comparing Environmental Risks: Tools for757\nSetting Government Priorities. Washington, DC: Resources for the Future; 1996.758\np. 111–147759\nMarouf L. Social networks and knowledge sharing in organizations: a case study. J760\nKnowl Manage 2007;11(6):110-25.761\nMorgan KM, DeKay ML, Fischbeck PS, Morgan MG, Fischhoff B, Florig HK. A762\ndeliberate method for ranking risks (II): evaluation of validity and agreement763\namong risk managers. Risk Anal 2001;21(5):923–37.764\nMorgenstern RD, Shih JS, Sessions SL. Comparative risk assessment: an international765\ncomparison of methodologies and results. J Hazard Mater 2000;78:19-39.766\nMullins LJ. Management and organisational behaviour, 6th ed. London: Financial767\nTimes Prentice Hall 2002.768\n32\nNew Jersey Department of Environmental Protection (NJDEP). Final report of the769\nNew Jersey Comparative Risk Project. Trenton, NJ: NJDEP 2003. Available at770\nhttp:\/\/www.state.nj.us\/dep\/dsr\/njcrp\/ Accessed on August 12, 2005771\nPennington DW, Bare JC. Comparison of chemical screening and ranking approaches:772\nThe waste minimization prioritization tool versus toxic equivalency potentials.773\nRisk Anal 2001;21(5):897–912.774\nPerhac RM. Comparative risk assessment: where does the public fit in? Sci Technol775\nHum Val 1998;23:221–41.776\nPetts J, Homan J and Pollard S. Participatory risk assessment – involving lay777\naudiences in decisions on risk: literature review and stakeholder interviews. R&D778\nReport E2-043\/TR01. Bristol: Environment Agency, Bristol; 2003.779\nPollard, SJT, Kemp RV, Crawford, M, Duarte-Davidson, R, Irwin, JG and Yearsley780\nR. Characterising environmental harm: Developments in an approach to strategic781\nrisk assessment and risk management, Risk Anal 2004; 24(6): 1551-1560782\nPollard, S, Hrudey, SE, Hamilton, P, MacGillivray, B, Strutt, J, Sharp, J Bradshaw, R,783\nLeiss, W and Godfree, A Risk analysis strategies for credible and defensible784\nutility decisions, Awwa Research Foundation Research Report 91168, Awwa785\nResearch Foundation, American Water Works Association and IWA Publishing,786\nDenver, CO; 2007, Ref 1P-3.25C-91168-02\/07-NH, 88pp.787\nPopp JA, Crouch E, McConnell EE. A weight-of-evidence analysis of the cancer788\ndose-response characteristics of 2,3,7,8-tetrachlorodibenzodioxin (TCDD).789\nToxicol Sci 2006;89(2):361-9.790\nPyoria P. Informal organizational culture: the foundation of knowledge workers'791\nperformance. J Knowl Manage 2007;11(3):16-30.792\nRamanathan R. Comparative risk assessment of energy supply technologies: a data793\n33\nenvelopment analysis approach. Energy 2001;26:197–203.794\nRocks, SA, Pollard SJ, Dorey, RA, Harrison PTC, Levy LS, Handy, RD, Garrod, JF795\nand Owen, R. Risk assessment of manufactured nanomaterials. In: J. Lead, E.796\nSmith (eds) Environmental and human health effects of nanoparticles, Blackwell797\nScience, in press798\nRoyal Commission on Environmental Pollution (RCEP). Setting environmental799\nstandards. London: HMSO 1998:21st report.800\nSadri G, Lees B. Developing corporate culture as a competitive advantage. J Manage801\nDev 2001;20(10):853-9.802\nSanderson H, Johnson DJ, Reitsma T, Brain RA, Wilson CJ, Solomon KR. Ranking803\nand prioritization of environmental risks of pharmaceuticals in surface waters.804\nRegul Toxicol Pharm 2004;39:158–83.805\nSenior B. Organisational Change. London: Prentice Hall; 2002.806\nServeiss VB, Bowen JL, Dow D, Valiela I. Using ecological risk assessment to807\nidentify the major anthropogenic stressor in the Waquoit Bay watershed, Cape808\nCod, Massachusetts. Environ Manage 2004;33(5):730–40.809\nSexton K, Marcus AA, Easter KW, Burkhardt TD (eds.) Better Environmental810\nDecisions – Strategies for Governments, Businesses and Communities.811\nWashington, DC: Island Press; 1999.812\nSmith AD. Collaborative commerce through Web-Based Information Integration813\ntechnologies. Int J Innov Learn 2007;4(2):127-44.814\nSmith, EP, Lipkovich, I, Ye, K. Weight of evidence (WOE): quantitative estimation815\nof probability of impact. Virginia Tech Department of Statistics Report,816\nBlacksburg, VA, 2002; 33pp.817\nStewart MG. Reliability-based assessment of ageing bridges using risk ranking life818\n34\ncycle cost decision analyses. Reliab Eng Syst Safe 2001;74:263–73.819\nStewart MG, Rosowsky DV, Val DV. Reliability-based bridge assessment using risk-820\nranking decision analysis. Struct Saf 2001;23:397–405.821\nStern PC, Fineberg HV (eds.) Understanding Risk – Informing Decisions in a822\nDemocratic Society. Washington, DC: National Academic Press; 1996.823\nStirling, A. Multi-criteria mapping. Mitigating the problems of environmental824\nvaluation. In: Foster, J. (ed.) Valuing nature. Economics, ethics and environment.825\nRoutledge, London, 1997; 186-210826\nStirling A. (ed.) On science and precaution in the management of technological risk.827\nEuropean Commission Joint Research Centre publication 19056\/EN\/2. Ispra,828\nItaly: Joint Research Centre, 2001829\nSumner J, Ross T. A semi-quantitative seafood safety risk assessment. Int J Food830\nMicrobiol 2002;77:55–9.831\nTherivel R. Strategic environmental assessment in action. London: Earthscan 2004.832\nTran LT, Knight CG, O’Neill RV, Smith ER, Riitters KH, Wickham J. Environmental833\nassessment: fuzzy decision analysis for integrated environmental vulnerability834\nassessment of the mid-Atlantic region. Environ Manage 2002;29(6):845–59.835\nTyler TR. Trust within organisations. Pers Rev 2003;32(5):556-68.836\nUS Environmental Protection Agency. Unfinished business: a comparative assessment837\nof environmental problems. NTIS # PB-88-127048. Washington, DC: US838\nEnvironmental Protection Agency 1987.839\nUS Environmental Protection Agency. 2006-2011 EPA Strategic plan. USEPA,840\nWashington DC; 2006; 180pp.841\nUS Presidential\/Congressional Commission on Risk Assessment and Risk842\nManagement. Framework for Environmental Health Risk Management.843\n35\nWashington, DC: Commission on Risk Assessment and Risk Management.844\n1997a(I). Available at http:\/\/www.riskworld.com\/riskcommission\/Default.html.845\nAccessed on August 11, 2005.846\nUS Nuclear Waste Technical Review Board. Developing multiple lines of evidence.847\nMeeting report, April 13, 2001; 214pp.848\nUS Presidential\/Congressional Commission on Risk Assessment and Risk849\nManagement. Risk Assessment and Risk Management in Regulatory Decision-850\nMaking. Washington, DC: Commission on Risk Assessment and Risk851\nManagement. 1997b(II). Available at852\nhttp:\/\/www.riskworld.com\/riskcommission\/Default.html. Accessed on August 11,853\n2005.854\nvan Asselt MBA. Improving decision-making under uncertainty: an integrated855\napproach to strategic risk analysis. In Facing the New Millennium. Proceedings of856\nthe 9th Annual Conference on Risk Analysis (Rotterdam, 10–13 October 1999),857\nedited by L H J Goosens. Delft, Netherlands: Delft University Press 1999.858\nVrijheid M, Dolk H, Armstrong B, Boschi G, Busby A, Jorgensen T, Pointer P.859\nHazard potential ranking of hazardous waste landfill sites and risk of congenital860\nanomalies. Occup Environ Med 2002;59:768–76.861\nWeed DL. Weight of evidence: A review of concept and methods. Risk Anal862\n2005;25(6):1545-57.863\nWilliams PRD. Health risk communication using comparative risk analyses. J Expo864\nAnal Env Epid 2004;14:498–515.865\nWilliams P, Benton L, Warmerdam J, Sheehan P. Comparative risk analysis of six866\nvolatile organic compounds in California drinking water. Environ Sci Technol867\n2002;36:4721–8.868\n36\nWong EY, Ponce RA, Farrow S, Bartell SM, Lee RC, Faustman EM. Comparative869\nrisk and policy analysis in environmental health. Risk Anal 2003;23(6):1337–49.870\nWynne, B. Methodology and institutions. Value as seen from the risk field. In:871\nFoster, J. (ed.) Valuing nature. Economics, ethics and environment. Routledge,872\nLondon, 1997; 135-152.873\nYoung L. Trust: looking forward and back. J Bus Ind Mark 2006;21(7):439-45.874\n37\n875\nFigure 1 Risks and values876\n877\n878\n879\n880\n881\n882\n38\n883\nFigure 2 Proposed decision framework for ‘democratic science’ (redrawn from884\nCharnley, 2000)885\nCharacterise stakeholder concerns\nand clarify goals of risk management\nFrame questions addressing\nstakeholder concerns\nIdentify factual information needed to\nanswer questions\nLegal\ninformation\nScientific\ninformation\nEconomic\ninformation\nOther (e.g.\nmanagement,\ntechnology, social)\nReframe\nproblem and\ngoals as\nnecessary\nClarify which\nquestions\nscience can\nanswer and\nwhich it can not\nAgree on who\nwill obtain the\ninformation\nneeded\nObtain the information needed\nand use it to undertake the risk\nassessment, if appropriate\nInterpret and communicate the\nresults of the risk assessment\nCombine all the\ninformation,\nidentify\nuncertainties and\ninformation gaps\nMake decision\n39\n886\nFigure 3. Categorising incertitude within environmental decision-making887\n(redrawn from Stirling, 2001)888\n889\n890\n891\nFigure 4. Steps in a risk ranking model (after Florig et al., 2001)892\n893\nStep A\nDefine and\ncategorise the\nrisks to be ranked\nStep B\nIdentify the\nattributes that\nshould be\nconsidered\nStep C\nDescribe the risks\nin terms of their\nattributes\nStep D\nPerform the\nrisk rankings\nStep E\nDescribe the issues\nidentified and resulting\nrisk rankings\nINCERTITUDE\nKnowledge\nabout\nlikelihoods\n(probabilities)\nKnowledge about outcomes (consequences)\nContinuum of\nconsequences\nSet of discrete\nconsequences\nConsequences\npoorly defined\nRISK\nFrequentist\ndistribution\nfunctions\nDiscrete\nfrequentist\nprobabilities\nBayesian\ndistribution\nfunctions\nDiscrete\nBayesian\nprobabilities\nAMBIGUITY\nfuzzy logic,\nsensitivity\nanalysis\nIGNORANCE\nprecaution\nUNCERTAINTY\nscenario analysis\nfirm basis for\nprobabilities\nshaky basis for\nprobabilities\nno basis for\nprobabilities\n40\n894\n895\nFigure 5. Basis for, and application of, evidence based (3-value) logic to carbon896\nstorage and capture decisions (partial tree for illustration; after Benbow et al.,897\n2006)898\n899\n900\n901\n902\nClassical 2-value logic Lack of knowledge not differentiated\nEvidence-based 3-\nvalue logic Reveals uncertainty and potential for improvement\n0.4 0.6\nProbability of\nsuccess\nProbability of\nfailure\nBelief in\nsuccess\nbased on\nsupporting\nevidence\nBelief in\nfailure\nbased on\nrefuting\nevidence\nUncertainty –\nuncommitted\nbelief\n0.25 0.30 0.45\nSignificant leakage of CO2 will not occur from the reservoir0.65\n0.10\n0.25\nExternal factors would not cause leakage0.43 0.37 0.20\nGeological features would not cause leakage0.45 0.35 0.20\n41\n903\nFigure 6. Managing risk knowledge is central to effective risk management.904\n905\n906\n907\n908\nTable 1 Quality indicators for scientific evidence (after Bowden, 2004)909\nIndicators of evidence quality\nTheoretical\nbasis\nScientific method Auditability Calibration Validation Objectivity\nVery high\n(1)\nWell\nestablished\ntheory\nBest available practice;\nlarge sample; direct\nmeasure\nWell\ndocumented\ntrace to\ndata\nAn exact fit to\ndata\nIndependent\nmeasurement\nof same\nvariable\nNo\ndiscernable\nbias\nHigh Accepted\ntheory; high\ndegree of\nconsensus\nAccepted reliable\nmethod; small sample;\ndirect measure\nPoor\ndocumented\nbut\ntraceable to\ndata\nGood fit to\ndata\nIndependent\nmeasurement\nof high\ncorrelation\nvariable\nWeak bias\nModerate Accepted\ntheory; low\nconsensus\nAccepted method;\nderived or surrogate\ndata; analogue; limited\nreliability\nTraceable\nto data with\ndifficulty\nModerately\nwell\ncorrelated\nwith data\nValidation\nmeasure not\ntruly\nindependent\nModerate\nbias\nLow Preliminary\ntheory\nPreliminary method of\nunknown reliability\nWeak and\nobscure link\nto data\nWeak\ncorrelation to\ndata\nWeak indirect\nvalidation\nStrong bias\nQ\nu\nal\nit\ny\nra\nn\nk\nVery low\n(0)\nCrude\nspeculation\nNo discernable rigour No link back\nto data\nNo apparent\ncorrelation\nwith data\nNo validation\npresented\nObvious\nbias\n910\nData Evidence\nobservation,\nreflection,\nand analysis\nInformation\nKnowledge\nOrganisational learning\nsimulations\/ analyses\nexperiments\ntests & observations\nmonitoring operations\nbenchmarking\n‘Lessons\nlearnt’\nknowledge\nbase\nDecision-\nmaking\nJustification for\ndecisions\n"}