{"doi":"10.1093\/aesthj","coreId":"67595","oai":"oai:eprints.lancs.ac.uk:35615","identifiers":["oai:eprints.lancs.ac.uk:35615","10.1093\/aesthj"],"title":"An introduction to the philosophy of art","authors":["Todd, Cain"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-04","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:35615<\/identifier><datestamp>\n      2017-12-14T00:02:55Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D42:4231<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        An introduction to the philosophy of art<\/dc:title><dc:creator>\n        Todd, Cain<\/dc:creator><dc:subject>\n        B Philosophy (General)<\/dc:subject><dc:date>\n        2005-04<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1093\/aesthj\/ayi021<\/dc:relation><dc:identifier>\n        Todd, Cain (2005) An introduction to the philosophy of art. British Journal of Aesthetics, 45 (2). pp. 192-193. ISSN 0007-0904<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/35615\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1093\/aesthj\/ayi021","http:\/\/eprints.lancs.ac.uk\/35615\/"],"year":2005,"topics":["B Philosophy (General)"],"subject":["Journal Article","NonPeerReviewed"],"fullText":"BOOK REVIEWS\n© British Society of Asthetics 2005 192\nAn Introduction to the Philosophy of Art. By richard \neldridge. Cambridge U.P. 2003. pp. 285. £15.95.\nThe greatest difﬁ culty facing anyone brave enough \nto take on the challenge of writing an introduction \nto any philosophical area is to strike an appropriate \nbalance between breadth of coverage, depth of \ntreatment, and clarity of exposition. Given the vast \narray of issues and problems sheltering beneath the \numbrella of aesthetics, achieving the correct balance \nbetween these elements is no easy feat. Richard \nEldridge’s An Introduction to the Philosophy of Art \noffers a sophisticated, rich, and detailed treatment \nof the nature and value of art. It possesses such \nan ambitious scope and depth, however, that it \nwill surely defeat the attempt of anyone new to \nphilosophical aesthetics to grasp the central issues \nand problems in any straightforward manner\nBeginning with an outline of what a philosophical \ntheory of art should do, and why it is important, \nEldridge immediately begins to demarcate the \ncentral place of art as a social practice within human \nculture generally, and its relations to fundamental \nhuman needs, desires, interests, and values. The \nexemplar here is clearly John Dewey, and this \nextremely broad treatment of art is the hallmark \nof the book, marking a welcome departure from, \nbut without neglecting, the relatively narrower \nconcerns of most Anglo-American aestheticians.\nTo a large extent the difference is captured in \nEldridge’s overriding aim to balance the ‘identiﬁ cation \nof distinct works of art against the critical elucidation \nof the function and signiﬁ cance of art’ (p. 17). It \nbecomes clear that his primary concern is with \nthe latter, and the great originality of this book \nlies in its treatment of the central theories of \nart—representation, formalism, and expression—\nnot as theories of deﬁ nition but of elucidation. \nFrom these, Eldridge draws out various criteria \nfor understanding art, leading to this formulation: \n‘works of art present a subject matter as a focus for \nthought and emotional attitude, distinctively fused \nto the imaginative exploration of material’ (p. 59). \nThis is offered not as an essentialist deﬁ nition of \nart, but, following Wittgenstein, as ‘a speciﬁ cation \nof criteria . . . for calling something art’. Of course, \nas its stands, the formula appears far too vague to \nfunction as a criterion for actually identifying art, \nbut such a criticism does not really do justice to \nthe rich and complex discussions of each of the \nelements making up the formula (the criteria), of \nwhich the book chieﬂ y consists.\nMoving on to originality and imagination in \nchapter 5—territory rarely explored in any depth \nby standard texts in the philosophy of art, let alone \nintroductions—Eldridge takes on board the ideas \nof Adorno and the critiques of postmodernist and \nfeminist thinkers. He argues eloquently for the \nimportance and value of originality, and hence of art, \nto the recognition of freedom and meaningfulness \nin life generally. A great deal of the book’s novelty \nand force lies in its erudite and skilful discussion \nof both standard Anglo-American theories and \nthose more broadly ‘Continental’ in nature. This is \nillustrated nicely in chapter 6’s discussion of various \nstrategies for understanding art, in which the \nbroadly postmodernist stances of Derrida and Fish \nare illuminatingly and sympathetically discussed and \ncriticized.\nUnfortunately, however, Eldridge’s discussion \nof the standard Anglo-American theories of \ndeﬁ ning art offered by Dickie and Danto, Levinson \nand Carroll, is less successful. The expositions of \nthese philosophers’ views are extremely brief and \nreﬂ ect almost none of the subtlety inherent in \ntheir positions. Eldridge’s primary criticism of \nthese theories is that they wrongly separate the \ntask of identifying art from that of evaluating it. \nIn contrast, Eldridge’s entire argument, developed \nprogressively throughout the book, seems geared \nto show that the criteria for identifying art depend \nBritish Journal of Aesthetics, Vol. 45, No. 2, April 2005\n at O\npen University on July 12, 2011\nbjaesthetics.oxfordjournals.org\nD\now\nnloaded from\n \n BOOK REVIEWS 193\nupon the distinctive value(s) that art provides. Yet \nthe relatively superﬁ cial treatment of Dickie and \nothers does little to help demonstrate the supposed \ngeneral invalidity of distinguishing (descriptive) \nclassiﬁ cation from evaluation.\nStronger support for Eldridge’s overall view can \nbe found in his insightful analyses of sentimentality, \ninauthenticity, kitsch, and other phenomena by \nwhich he shows that art must clarify emotions and \nattitudes rather than just indulge or simply express \nthem, and by means of which his position avoids the \nfamiliar danger of rendering all art, qua ‘valuable’, \nnecessarily good art.\nEldridge moves on in chapter 8 to discuss art and \nemotion, dealing with the well-known paradoxes \nof ﬁ ction and tragedy, and the theories designed to \nresolve and explain them. The discussion is rather \nhasty—as an introduction the reader might feel that \nthey had emerged into the middle of a complicated \ndebate without much prior warning or explication. \nThis is also the case with the discussion of art and \nmorality in the following chapter, where the great \nvariety of subtly distinct, but not clearly delineated, \npositions are located in the midst of a debate \nbetween Eldridge himself and Carroll, which is far \nfrom lucidly explained or structured.\nThe book nonetheless concludes with a thought-\nprovoking account of the various relations between art \nand society, cleverly combining an articulate account \nof many important developments in contemporary \nart with a wide-ranging discussion of the theories of \nLukacs, Marcuse, Adorno, Schiller, Levi-Strauss, and \nAlthusser about the ills of modernity and art’s role \ntherein.\nThe strength of the book lies squarely in situating \nart and the philosophy of art in the wider context \nof human cultural and social concerns and values. \nIn the process it provides an extraordinarily rich \nsense of the nature and value of art that draws on \nboth Anglo-American philosophy and the insights \nof cultural theory and Continental thought. This \nbreadth of treatment, combined with the depth of \ninsight Eldridge brings to bear on the subject is to \nbe strongly applauded. It is refreshing to read a book \nthat takes the value of art to be the most fundamental \nissue, in contrast to the often stale obsession with \nrelatively hollow deﬁ nitional theories. Yet at the \nsame time, parts of Eldridge’s discussion are either \ntoo detailed to serve as easy entry points into \nphilosophical discussion, or too summary—since \nsubsumed by his own concern to develop and \ndefend a coherent position in the course of the \nbook—to be overly useful as an introduction.\ncain todd\nUniversity of Lancaster\ndoi: 10.1093\/aesthj\/ayi021\n at O\npen University on July 12, 2011\nbjaesthetics.oxfordjournals.org\nD\now\nnloaded from\n \n"}