{"doi":"10.1109\/IGARSS.1998.691634","coreId":"102421","oai":"oai:epubs.surrey.ac.uk:1880","identifiers":["oai:epubs.surrey.ac.uk:1880","10.1109\/IGARSS.1998.691634"],"title":"Improving SAR image classification in tropical region through fusion with SPOT data","authors":["Ho, Anthony Tung Shuen","Seumahu, Eliza Steve","Tam, Siu-Chung","Chin, Teck Wei","Lim, Hock Seng"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1998-07-06","abstract":"<p>This paper investigates various SAR digital filtering techniques to remove speckles for image classification using fused SAR and SPOT XS image. The fused image classification is then compared with the classified SPOT XS image. The result has shown that the use of the Enhanced Frost digital filtering technique for SAR image and the fusion with SPOT XS gives a very similar classification with comparison to the SPOT XS image classification.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1880<\/identifier><datestamp>\n      2017-10-31T14:03:31Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:436F6D707574696E67<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1880\/<\/dc:relation><dc:title>\n        Improving SAR image classification in tropical region through fusion with SPOT data<\/dc:title><dc:creator>\n        Ho, Anthony Tung Shuen<\/dc:creator><dc:creator>\n        Seumahu, Eliza Steve<\/dc:creator><dc:creator>\n        Tam, Siu-Chung<\/dc:creator><dc:creator>\n        Chin, Teck Wei<\/dc:creator><dc:creator>\n        Lim, Hock Seng<\/dc:creator><dc:description>\n        <p>This paper investigates various SAR digital filtering techniques to remove speckles for image classification using fused SAR and SPOT XS image. The fused image classification is then compared with the classified SPOT XS image. The result has shown that the use of the Enhanced Frost digital filtering technique for SAR image and the fusion with SPOT XS gives a very similar classification with comparison to the SPOT XS image classification.<\/p><\/dc:description><dc:date>\n        1998-07-06<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1880\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Ho, Anthony Tung Shuen, Seumahu, Eliza Steve, Tam, Siu-Chung, Chin, Teck Wei and Lim, Hock Seng  (1998) Improving SAR image classification in tropical region through fusion with SPOT data  In: IGARSS '98. Sensing and Managing the Environment. 1998 IEEE International Geoscience and Remote Sensing. Symposium Proceedings. (Cat. No.98CH36174).     <\/dc:identifier><dc:relation>\n        10.1109\/IGARSS.1998.691634<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1880\/","10.1109\/IGARSS.1998.691634"],"year":1998,"topics":[],"subject":["Conference or Workshop Item","PeerReviewed"],"fullText":"Improving SAR Image classification In Tropical Region \nThrough Fusion With SPOT Data \nAnthony Tung Shuen Ho, Eliza Steve Seumahu, Siu Chung Tam, Teck Wei Chin, Hock Seng Lim \nNanyang Technological University, School Of Electrical and Electronic Engineering \nNanyang Avenue, Singapore 639798 \nTel:(65) 799-6373 Fax:(65) 7920415 Email: etsho@ntu.edu.sg \nAbstract - This paper investigates various SAR digital \nfiltering techniques to remove speckles for image \nclassification using fused SAR and SPOT XS image. The \nfused image classification is then compared with the \nclassified SPOT XS image. The result has shown that the use \nof Enhanced Frost digital filtering technique for SAR image \nand the fusion with SPOT XS gives a very similar \nclassification with comparison to the SPOT XS image \nclassification. \nINTRODUCTION \nIn the tropical region, there is a limited supply of passive \nsatellite optically sensed images for classification . With the \nuse of SAR, images can be obtained at anytime of the day. \nHence, SAR images are readily available. Furthermore, SAR \ncan penetrate through clouds as well as haze due to its longer \nwavelength, therefore, the present of clouds or haze in the \ntropical region would not affect the classification through the \nuse of SAR. Hence, the use of clouds detection technique to \nremove clouds in optical satellite images [ l ]  may not be \nnecessary for classification. \nOne inherent problem of SAR precision images is that they \ncontain speckles which result in classification inaccuracy. \nOne way to reduce the speckles is to use digital filters. \nAccording to Serban [2], Gamma MAP filter could be used to \nperform on the SAR image before fusion with two different \nbands of LANDSAT TM image. From the paper [Z], the \nunsupervised classification performed on the fused image was \nvery satisfactory with more classes of the different types of \nsoil contents shown in the classification. In order to gain a \nbetter knowledge of the effect of filtering in classification, \nthis paper will provide an investigation to ascertain the best \ntype of SAR filter which could be used for fused image \nclassification \nWe have selected the six best known and common digital \nspeckle filters [3] for our investigation. These are the Lee \nfilter [4], Kuan filter [5], Enhanced Lee filter [6], Gamma \nMAP filter [7], Frost filter [SI and Enhanced Frost filter [6]. \nIn addition, SPOT XS image classification would be used as a \nbenchmark for comparison on the effectiveness of this fusion \nand filtering technique. \nDATA AND SYSTEM \nERS-1 SAR image and SPOT XS image of the eastern part of \nSingapore were used for the investigation. The pixel size of \nthe two images is 704 by 896. This area contains many roads \nand dense buildings with certain areas still under \ndevelopment at the time of capturing these images. \nThe system used was a Pentium 133MHz PC. ER Mapper \nsoftware, which works under Windows 95 environment, was \nused for the manipulations of the images and the coding of \nvarious digital speckle filters. \nDIGITAL SPECKLE FILTERS \nMany adaptive filters have a common goal of smoothing the \nimages while preserving sharp features and edges in the \nimages. However, the appropriate filtering window size \ncannot be determined automatically and has to be obtained \nexperimentally. The main reason is due to the fact that if the \nwindow size is too small, the filtering will not be effective \nand if the window size is too large, certain details of the \nimage will be lost after the filtering process. Hence, the filter \nwindow size used in this paper is a 5x5 window size which is \na reasonably size for filtering purpose. In this pttper, the \ndigital SAR filters used for evaluations are the Lee filter, \nenhanced Lee filter, Frost filter, enhanced Frost filter, Gamma \nMAP filter and Kuan filter. \nSince the digital SAR filters are based on the intensity \nmultiplicative noise model, we have to make sure that all the \npixels in the SAR images are in the form of intensity by \nsquaring the pixels of the S A R  . amplitude images before \nimplementing the filtering processes. After filtering, these \npixels have to be converted back to amplitudes before \nproceeding with fusion with other images. \n0-7803-4403-0\/98\/$10.00 0 1998 IEEE 1596 \nGROUND CONTROL POINTS \nDue to the motion of the scanners, sensor characteristics and \nmany other factors, the images taken would not be properly \nmapped to one another. As such, ground control points (GCP) \nhave to be chosen so that these points would serve as \nreferences for different images to map onto. \nIn all, ten GCPs were set for all the images and SPOT XS \nimage which has a spatial resolution of 20 m was used as the \nmain reference for other images. The selection of GCPs on \nthe SAR images was a tedious task due to the speckles on the \nimages, hence most GCPs were chosen at distinct cross \njunctions of airport runway and the sharp bends of broad \nroads. Subsequently, polynomial rectification method was \nused to mapped the images to one another. \nDATA FUSION \nLand Roads \nFeature I% \nSPOT XS image consists of 3 bands. However, in this paper, \nonly band 1 and band 3 were used for image fusion. The SAR \nimage occupied the green layer of RGB layers, band 1 of \nSPOT XS image occupied the red layer of RGB layers and \nband 3 of SPOT XS image occupied the blue layer. \nSubsequently, ISOCLASS unsupervised classification was \nperformed on the fused image, and the classes produced were \nbroken down to five main classes - Water Region, Grassland, \nBare Soil, Buildings and Roads. \nBuildings Bar Water GrassIan \n1% e Region d l %  \nIn order to make comparisons between the ISOCLASS \nunsupervised classification of the SPOT XS image and this \nfused image, the percentage coverage of each class was being \ncalculated as shown in table 1. \n(R 1+B I)\/ \n46 \nKuan \nWith reference to table 1, the difference (L - C) in the class \npercentage between SPOT XS image classification and this \nfused image classification was calculated to determine the \naccuracy of the fusion image with comparison to the SPOT \nXS image classification. \n(R)12.82 I (B)19.74 12.59 I 7.66 I 47.19 \nRESULTS AND DISCUSSIONS \nFilter \nLC \n(R+B) - \nAs it was observed from the classifications of all the images, \nthe. roads and the buildings are not classified distinctly. The \nmain reason is due to the proximity of the roads and the \nbuildings. Hence, for these two classes, the difference in \npercentage, when compare with SPOT XS image \nclassification as shown in table 1, can be quite significant. \nHence, it was proposed that the two classes be merged \ntogether to form a single class as shown in Fig. 1 and Fig.2. \nI I I \n-8.35 I 12.64 -2.93 I 4.61 I -5.97 \n4.29 \nAfter the combination of these two classes, the class \npercentage difference ((R+B) - (R’+B’)), with reference to \ntable 1, was derived. Table 2 shows the percentage sum of the \ndifference in all classes between the fused image \nclassification and the SPOT XS image classification for the \ndifferent types of filters used in SAR image. \nFrom table 2, it is noticed that using Enhanced Frost filter, the \nclassification for the fusion of SPOT XS image and SAR \nimage has a minimum percentage sum of the absolute \ndifference of all classes of 8.14% as compare to the other \nfilters. In other words, the classification that uses Enhanced \nFrost filtering method produces very similar classification to \nSPOT XS image classification. \nBy observing the different types of SAR filtered images with \ncomparison to the original SAR images, it could be noticed \nthat Enhanced Frost filter gives an image that preserves the \nhigh intensity pixels as well as the edges of the features. \nFurthermore, with comparison to other filtering techniques, \nEnhanced Frost filter has a moderately good smoothing effect \nfor the speckles, hence, the fusion classification using this \nfiltering technique is very satisfactory. \n-1 I I E I I \n5 P e  Of \nFilters \nFilter \n51.19 \n-3.38 -1.97 \n(R+B) - \n7 1 -0.93 7.53 1 -6.9 5.89 -5.59 1 \n(R+B) - \n(R 1+B1)\/ \nLeeFilter (R)18.30 (B)13.17 10.76 16.99 40.78 \n1 I I I I \nLC I -2.87 I 6.07 I -4.76 I 13.94 I -12.38 \n(R+B)- I 3.2 I \n(R 1 +B I)\/ \n53.16 \nk Using \nSPOT XS \n1597 \nTable 2: Percentage Sum of Absolute Difference Of All \nGammaFilter \nClasses \nSum Of Absolute Difference Of All Classes \/ % \n12.2 \nEnhanced Frost Filter \nI Frost Filter I 17.98 I \n8.14 \nI Enhanced Lee Filter I 24.98 I \nLee Filter 34.28 \nCONCLUSIONS \nKuan Filter \nThe knowledge of the best type of SAR filter is very \nimportant in the SAR-SPOT XS image fusion classification. \nEnhanced Frost filter of window size of 5 x 5  is found to be \nmost suitable for image fusion as it has a percentage sum of \nabsolute difference of all classes of 8.14 % which is the \nlowest among the six digital filters. \n17.8 \nFor future research, with the use of Enhanced Frost filter, it \nwill be possible to increase the features in a classification of a \nterrain, which has different dielectric constant soil contents, \nby combining the spectral advantage of high spatial resolution \noptical SPOT XS image and the penetrative capability of \nSAR. \nREFERENCES \n[l] Ho, A T S, 1997, \"Detecting Clouds and Cloud Shadows \nin Multispectral Satellite Images for Tropical Areas\", IEE \nSixth Intemational Conference on Image Processing and Its \nApplications, IPA97, Vol. 2, July, pp 848-851. \n[2] Serban, F, Braescu, C, Zoran, M, Pop, A, and Petrica, A, \n1995, \"An investigation of the potential of merging SAR-ERS \ndata with optical data with applications over the continental \nplatform of the Black Sea and the Danube Delta\", \nProceedings of the 15TH EARSeL Symposium, September, pp \n29 1-299. \n[3] Shi, Z H, and Fung, K B, 1994, \"A comparison of digital \nspeckle filters\", Proceedings of IGARSSP4, August, pp 2129- \n2133. \n[4]Lee, J S, 1980, \"Digital image enhancement and noise \nfiltering by use of local statistics\", IEEE Trans. Pattern \nAnalysis and Machine Intelligence, Vol. 2, No 2, March, pp \n165- 168. \n[SIKuan, D T, Sawchuk, A A, Strand, T C, and Chavel, P, \n1985, \"Adaptive noise smoothing filter for images with \nsignal-dependent noise\", IEEE Trans. Pattern Analysis and \nMachine Intelligence, Vol. 7, No 2,  March, pp 165-177. \n[6]Lopes, A, Touzi, R, and Nezry, E, 1990, \"Adaptive \nspeckle filters and scene heterogeneity\", IEEE Trans. \nASSP.,Vol. 28, No 6, November, pp 992-1000. \n[7] Lopes, A, Nezry, E, Touzi, R, and Laur, H, 1990, \n\"Maximum a posteriori filtering and first order texture models \nin SAR images\", Proceedings of IGARSSPO, May, pp 2409- \n2412. \n[SI Frost, V S, Stiles, J A, Shanmugan, K S, and Holtzman, \nJC, 1982, \"A model for radar images and its application to \nadaptive digital filtering of multiplicative noise\", IEEE Trans. \nPattern Analysis and Machine Intelligence, Vol. 4, No 2, \nMarch, pp 157-166. \nU\"%ld*\"ga - Water Rwmn \nFig. 1 : SAR-SPOT XS Classification \nFig. 2 : SPOT XS Classification \n1598 \n"}