{"doi":"10.2147\/IJN.S","coreId":"102944","oai":"oai:epubs.surrey.ac.uk:2580","identifiers":["oai:epubs.surrey.ac.uk:2580","10.2147\/IJN.S"],"title":"Applications of Dielectrophoretic\/Electrohydrodynamic “Zipper” Electrodes for Detection of Biological Nanoparticles","authors":["Hubner, Yvonne","Hoettges, Kai F","McDonnell, Martin B","Carter, Michael J","Hughes, Michael P"],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2007-09","abstract":"A major problem for surface-based detection techniques such as surface plasmon resonance and quartz crystal microbalances is that at low concentrations, diffusion is an insuffi cient driving force to bring colloidal submicron-scale particles to the detection surface. In order to overcome this, it has previously been demonstrated that a combination of dielectrophoresis and AC-electro-hydrodynamic fl ow can be used to focus cell-sized particles from suspension onto a large metal surface, in order to improve the detection capabilities of such systems. In this paper we describe how the combination of these two phenomena, using the so-called “zipper”\\ud\nelectrode array, can be used to concentrate a wide range of nanoparticles of biological interest, such as infl uenza virus, dissolved albumin, and DNA molecules as well as latex beads of various sizes. We also demonstrate that the speed at which particles are transported towards the centre\\ud\nof the electrode pads by dielectrophoresis and electro-hydrodynamic fl ow is not related to the particle size for colloidal particles","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Dove Medical Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2580<\/identifier><datestamp>\n      2017-10-31T14:05:57Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:62696F736369656E6365735F6D65646963696E65:62696F5F6D6F6C6563<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2580\/<\/dc:relation><dc:title>\n        Applications of Dielectrophoretic\/Electrohydrodynamic “Zipper” Electrodes for Detection of Biological Nanoparticles<\/dc:title><dc:creator>\n        Hubner, Yvonne<\/dc:creator><dc:creator>\n        Hoettges, Kai F<\/dc:creator><dc:creator>\n        McDonnell, Martin B<\/dc:creator><dc:creator>\n        Carter, Michael J<\/dc:creator><dc:creator>\n        Hughes, Michael P<\/dc:creator><dc:description>\n        A major problem for surface-based detection techniques such as surface plasmon resonance and quartz crystal microbalances is that at low concentrations, diffusion is an insuffi cient driving force to bring colloidal submicron-scale particles to the detection surface. In order to overcome this, it has previously been demonstrated that a combination of dielectrophoresis and AC-electro-hydrodynamic fl ow can be used to focus cell-sized particles from suspension onto a large metal surface, in order to improve the detection capabilities of such systems. In this paper we describe how the combination of these two phenomena, using the so-called “zipper”\\ud\nelectrode array, can be used to concentrate a wide range of nanoparticles of biological interest, such as infl uenza virus, dissolved albumin, and DNA molecules as well as latex beads of various sizes. We also demonstrate that the speed at which particles are transported towards the centre\\ud\nof the electrode pads by dielectrophoresis and electro-hydrodynamic fl ow is not related to the particle size for colloidal particles.<\/dc:description><dc:publisher>\n        Dove Medical Press<\/dc:publisher><dc:date>\n        2007-09<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2580\/1\/applications_dielectrophoretic_HUBNER_07.pdf<\/dc:identifier><dc:identifier>\n          Hubner, Yvonne, Hoettges, Kai F, McDonnell, Martin B, Carter, Michael J and Hughes, Michael P  (2007) Applications of Dielectrophoretic\/Electrohydrodynamic “Zipper” Electrodes for Detection of Biological Nanoparticles   International Journal of Nanomedicine, 2 (3).  pp. 427-431.      <\/dc:identifier><dc:relation>\n        http:\/\/www.dovepress.com\/international-journal-of-nanomedicine-i82-j5<\/dc:relation><dc:relation>\n        10.2147\/IJN.S<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2580\/","http:\/\/www.dovepress.com\/international-journal-of-nanomedicine-i82-j5","10.2147\/IJN.S"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"© 2007 Dove Medical Press Limited.  All rights reserved\nInternational Journal of Nanomedicine 2007:2(3) 427–431 427\nO R I G I N A L  R E S E A R C H\nApplications of dielectrophoretic\/electro- \nhydrodynamic “zipper” electrodes for detection \nof biological nanoparticles\nYvonne Hübner1\nKai F Hoettges1\nMartin B McDonnell2\nMichael J Carter3\nMichael P Hughes1\n1Centre for Biomedical Engineering, \nSchool of Engineering, University of \nSurrey, Guildford, Surrey UK; 2DSTL, \nPorton Down, Salisbury, Wiltshire, UK; \n3School of Biomedical and Molecular \nSciences, University of Surrey, \nGuildford, Surrey, UK\nCorrespondence: Michael P Hughes\nCentre for Biomedical Engineering, \nSchool of Engineering, University of \nSurrey, Guildford, Surrey GU2 7XH, UK\nTel +44 1483 686775\nEmail m.hughes@surrey.ac.uk\nAbstract: A major problem for surface-based detection techniques such as surface plasmon \nresonance and quartz crystal microbalances is that at low concentrations, diffusion is an insuf-\nﬁ cient driving force to bring colloidal submicron-scale particles to the detection surface. In order \nto overcome this, it has previously been demonstrated that a combination of dielectrophoresis \nand AC-electro-hydrodynamic ﬂ ow can be used to focus cell-sized particles from suspension \nonto a large metal surface, in order to improve the detection capabilities of such systems. In this \npaper we describe how the combination of these two phenomena, using the so-called “zipper” \nelectrode array, can be used to concentrate a wide range of nanoparticles of biological interest, \nsuch as inﬂ uenza virus, dissolved albumin, and DNA molecules as well as latex beads of various \nsizes. We also demonstrate that the speed at which particles are transported towards the centre \nof the electrode pads by dielectrophoresis and electro-hydrodynamic ﬂ ow is not related to the \nparticle size for colloidal particles.\nKeywords: electro-hydrodynamic ﬂ ow, dielectrophoresis, inﬂ uenza, DNA\nIntroduction\nDetection technologies such as evanescent light scattering or surface plasmon resonance \nuse surface interactions to detect the presence of particles on a metal surface (Perkins \nand Squirrell 2000). In order to be an effective method of pathogen detection, such a \nsystem is required to capture pathogens covering a wide range of sizes, from nanometers \nto micrometers in diameter, on the detection surface. However, the detection of bacteria \nor viruses is often hampered because such particles are small enough for Brownian \nmotion to prevent them collecting onto the sensor surface; that is, they are colloidal.\nIn order to enhance the effectiveness of these detection systems, AC-electroki-\nnetic forces have been employed to pull particles from suspension and concentrate \nthe particles on a sensor surface (Hoettges et al 2003a, 2003b; Wong et al 2004). The \nmethod outlined in these papers exploits two phenomena that can be observed in cells \nsuspended in a liquid medium and exposed to a low-frequency (approximately less \nthan 1 kHz), non-uniform electric ﬁ eld. The ﬁ rst, dielectrophoresis, is the motion of \nsuspended particles caused by polarization effects induced by an inhomogeneous elec-\ntric ﬁ eld (Pohl 1978). Depending on the properties of the particle and the surrounding \nmedium the particle can be attracted to (positive dielectrophoresis) or repelled from \n(negative dielectrophoresis) the electrodes (Pohl 1978). In addition to dielectrophoresis, \nelectro-hydrodynamic (EHD) ﬂ ow of the suspending liquid due to electroosmosis is \nalso observed above adjacent electrode surfaces. As a result of the combination of these \nphenomena, a vortex of liquid is formed over the electrode edge that pushes particles \nonto the electrode surface (Gonzáles et al 2000; Green et al 2002).\nInternational Journal of Nanomedicine 2007:2(3)428\nHübner et al\nCareful selection of the electrode geometry allows these \nphenomena to be exploited for the collection of particles at \na speciﬁ c point. One such geometry is the so-called “zip-\nper” electrode, consisting of interlocking circular electrode \npads such as those shown in Figure 1 (Hoettges et al 2003a, \n2003b). The advantage of such an electrode design is that \nthe vortices formed around the edges of the electrodes act to \npush particles orthogonally to the electrode edge and hence \nfocus particles in one spot in the middle of the electrode \nsurface, rather than in a band as observed with interdigitated \nelectrodes. Zipper electrodes have previously been used for \nfocusing yeast cells, bacterial spores, latex beads (Hoettges \net al 2003) and DNA (Wang et al 2004). In this paper we \ndemonstrate that these effects can be used to concentrate a \nrange of particle sizes from micron-scale particles to those \nwith effective diameter 4 nm, including bioparticles such as \nviruses and proteins. We demonstrate that the particle collec-\ntion of zipper electrodes is independent of the particle size, \nand can therefore be used to concentrate virtually any particle \nwith a size between macromolecules and large cells.\nMaterial and methods\nParticle preparation\nInﬂ uenza virus particles, A-WS strain, were cultured in \nallantoic cavity of a fertile 12 day old hen’s egg (Tetra Poul-\ntry, Dunsfold). The virus was clariﬁ ed and snap frozen. To \nperform experiments, virions were defrosted and ﬂ uorescent-\nly labeled with NBD-dihexadeclamine (Molecular Probes, \nOregon). The dye was dissolved in DMF at a concentration \nof 2 mg mL–1. To this solution the virus was added at a 1:100 \ndilution. Particles were incubated for 20 min at room tem-\nperature, pelleted at 14,000 rpm for 50 min and resuspended \nin 1 mL mannitol solution (280 mM). These cells were then \nused to perform dielectrophoretic experiments. The ﬂ uores-\ncently labeled protein Albumin, conjugated to ﬂ ourescein iso-\nthiocyanate (Sigma-Aldrich, UK) was dissolved in 280 mM \nmannitol solution at a concentration of 2.1 mg mL–1. Lambda \nDNA was ﬂ uorescently labeled using YOYO-1 iodide dye \n(Molecular Probes, Oregon). DNA and dye were mixed at \na ratio of 9:1 and the sample was incubated at 8 °C over-\nnight. The ﬂ uorescently labeled latex beads (FluoSpheres® \ncarboxylate-modiﬁ ed microspheres from Molecular Probes, \nUK) of a range of sizes between 0.02 µm and 0.5 µm diameter \nwere suspended in distilled water.\nExperimental setup\nZipper-shaped electrodes were manufactured by photoli-\nthography and wet etching on 100 nm thick gold coated \nmicroscope slides with a 10 nm titanium seed layer. The \nelectrodes had a diameter of 300 µm and were separated \nby an interelectrode gap of 100 µm. Between 10 µL and 40 \nµL of the solution was pipetted onto the electrode array and \nFigure 1 Schematic of the zipper electrode geometry used; interlocking circles cause particles to be pushed into the centre of the electrode “pads”.\nInternational Journal of Nanomedicine 2007:2(3) 429\nZipper electrodes for detection of nanoparticles\ncovered with a cover slip. A sinusoidal signal of magnitude \nof 10 V\npk-pk \nand frequencies in the range 500 Hz to 10 kHz \nwere applied to the electrodes using a Thurlby-Thandar \nsignal generator (TG120, 20 MHz Function Generator). \nExperiments were observed using a Nikon Eclipse 400 \nﬂ uorescent microscope and images using a Photonic Sci-\nence chilled CCD camera were taken every 0.1 s for each \nexperiment. The distance of the particles from the electrode \nedge was measured for each time frame. For experiments \nwith latex beads, a 10 V\npk-pk\n sinusoidal signal was applied to \nthe electrode array with four different frequencies ranging \nfrom 500 Hz to 1400 Hz.\nResults and discussion\nWhen the signal was applied to the electrodes, ﬂ uid vorti-\nces were observed to form adjacent to the electrode edges. \nParticles moved ﬁ rst from this vortex onto the electrode edge, \nand then towards the electrode centre where they collected as \nshown in Figures 2a (latex beads) and 2b (virions). All latex \nbeads, virions and albumin at 10V collected rapidly in the \ncentre of the electrode structures within 2 s. At low voltages, \nalbumin molecules were pushed into the middle of the elec-\ntrode pad across the electrode gap similar to the behaviour \nshown by latex beads in Figure 2a. When the voltage was \nincreased, the dissolved albumin molecules were initially \npushed into the middle of the electrodes as before. However, \nafter about 10 s, some molecules had also collected at the \nelectrode edges by conventional dielectrophoresis began to \nprecipitate from the electrode edges in lumps approximately \n1 µm in diameter. These agglomerates were then pushed into \nthe centre of the electrode and collected in the same manner \nas other particles. DNA strands were observed to collect close \nFigure 2 Images of particles trapped using the zipper electrode. a) Latex beads are pushed into the middle of the electrode pad, as are infl uenza virions; b). Albumin \nmolecules c) collect both at the centre of the pad and at the electrode edge, with single molecules being pushed towards the electrode middle; d) DNA only collects close \nto the electrode edge.\nInternational Journal of Nanomedicine 2007:2(3)430\nHübner et al\nto the electrode edge rather than at the centre of the electrode \npad, forming regions of higher particle concentration as \nshown in Figure 2d. This may be due to surface charges on \nDNA molecules, or to a stronger dielectrophoresis inﬂ uence \nbeing exerted on the molecules due to their length producing \nan exceptionally strong dipole. \nSuch collection is driven by a combination of dielectropho-\nresis and hydrodynamic ﬂ ow (Green and Morgan 1998; Green \net al 2000). While positive dielectrophoresis causes particles \nto move towards the region of highest ﬁ eld inhomogeneity, \nwhich forces particles to collect on the electrode edges, par-\nticles in these experiments collected on the electrode surface \ndue to the electrode design and experimental conditions. \nHowever, the balance between the two phenomena has not \nyet been studied; in order to investigate this, we examined the \neffect of particle size on collection activity. Dielectrophoresis \ndepends on the volume of particles and the force becomes \nweaker with decrease in particle size, whilst ﬂ uid ﬂ ow should \nshow much less size dependency beyond the effects of viscous \ndrag; the balance of forces should thus be observable in the \nsize dependency of induced particle motion.\nIn order to assess the relationship between the force on \nthe particle and its size, measurements were taken of the \ndistance between the particle and the electrode edge at a \nrange of frequencies (0.5 kHz, 0.8 kHz, 1.1 kHz, 1.4 kHz). \nExperiments were repeated three times. It was found that \nthere was a strong frequency dependency in the distance \nmoved, in line with the results of Green et al (1998), but \nthat there was no statistically signiﬁ cant relationship with \nparticle size. Although the distances moved by the different \nparticle types were different for different frequencies, the \ntrend was common across all frequencies. Figure 3 shows \nthe values for average measurements at 0.8 kHz as a repre-\nsentative sample; error bars have been omitted for the sake \nof clarity, but error margins were typically less than 10%. \nNo results were taken for DNA as the molecules collected \nat the electrode edge.\nAt a frequency of 500 Hz all latex particles, regardless \ntheir size, were pushed to 71–102 µm from the electrode \nedge after a period of 1s, while at frequency of 800 Hz \nparticles moved only 59–63 µm after 1s. Further increase \nof the frequency to 1100 Hz and 1400 Hz did not change \nthis signiﬁ cantly. Small variations between the collection \nrates were probably down to Brownian scatter. Since the \nhomogeneous latex beads are of different sizes (varying \nover more than one order of magnitude) but identical in their \nFigure 3 A graph showing the distance covered from the electrode edge after 1 second of applied electric fi eld at 800 Hz, by different particle types of different sizes.\nKey: LB = latex bead, fi gure quoted is diameter in µm; albumin molecules and infl uenza virions are approximately 0.04 µm and 0.1 µm diameter, respectively.\nInternational Journal of Nanomedicine 2007:2(3) 431\nZipper electrodes for detection of nanoparticles\ncomposition, it can be seen that the collection behavior was \nindependent of size, which indicates a strong inﬂ uence of the \nelectro-hydrodynamic ﬂ ow on the collection behavior. When \ncomparing the results of the latex beads with bioparticles \nafter 1 s it can be seen that albumin with a distance of 59 µm \ncorrelated well with the results of the latex beads. They move \nmore slowly in for the ﬁ rst 0.7 s, but increase velocity after \nthe ﬁ rst 0.7 s until they reach as far as latex beads. However, \nInﬂ uenza virions moved more slowly and only traveled 44 \nµm in the same time period. We speculate that this may imply \nthat the dielectrophoretic force is pulling against the electro-\nhydrodynamic ﬂ ow and thereby slowing the collection of \nlarger particles; whereas all the other particles exhibited a \ngenerally exponential velocity curve, the virions exhibit a \nslightly s-curve shaped proﬁ le with velocity being suppressed \nnear the electrode edge before accelerating at about 0.3 s. \nThis would be expected if dielectrophoresis were retarding \nthe motion of particles, as the dielectrophoretic force is far \nmore strongly distance-dependent and would only have \nsigniﬁ cant effect within a short distance of the electrode \nedge. This may indicate a stronger positive dielectrophoretic \nforce on the virus than the other particles, possibly due to its \nrelatively large size and greater surface charge.\nIn addition to this observation, the frequency depen-\ndence of the collection of particles highlights the inﬂ uence \nof dielectrophoresis. The fact that the collection on top of \nthe electrode pads is slower at higher frequencies where the \ninﬂ uence of dielectrophoresis may be stronger, shows that \ndielectrophoresis worked to counteract the motion due to \nelectro-hydrodynamic ﬂ ow. Alternatively, as colloidal par-\nticles exhibit positive dielectrophoresis at low frequencies \ndue to surface charge effects (Hughes 2002) whereas the \nlarger particles may experience negative dielectrophoresis \nat low frequencies; it is possible that this combination of \nforces may put the particles into a different ﬂ ow layer and \ncorrespondingly different velocity.\nConclusion\nIn recent years attempts have been made to combine dielec-\ntrophoresis and AC-electro-hydrodynamic ﬂ ow to focus \nparticles on a metal surface in order to improve detection \nsystems such as surface plasmon resonance and quartz crystal \nmicrobalances. In this paper we have demonstrated that it is \npossible to use “zipper”-conﬁ guration electrodes for focusing \nand concentrating DNA and for the ﬁ rst time virus particles \nand proteins on a 300 µm-diameter metal surface. We have \nalso demonstrated that the velocity at which particles are \npushed towards the centre of the electrode pads by dielec-\ntrophoresis and electro-hydrodynamic ﬂ ow is not generally \nrelated to the particle size for colloidal particles.\nAcknowledgments\nThis work was funded by the UK Ministry of Defence.\nReferences\nGreen NG, Morgan H. 1998. J Phys D: Appl Phys, 31:L25–L30.\nGreen NG, Ramos A, González A, et al. 2000. Phys Rev E, 61:4011–18.\nGreen NG, Ramos A, González A, et al. 2002. Phys Rev E, 66:026305.\nGonzáles A, Ramos A, Green NG, et al. 2000. Phys Rev E, 61:4019–28.\nHoettges KF, Hughes MP, Cotton A, et al. 2003a. IEEE Eng Med Biol \nMag, 2268–74.\nHoettges KF, McDonnell MB, Hughes MP. 2003b. J Phys D: Appl Phys, \n36:L101–L104.\nHughes MP. 2002. Nanoelectromechanics in Engineering and Biology. \nBoca Raton: CRC Press.\nPerkins ES, Squirrell DJ. 2000. Biosens Bioelectron, 14:853–9.\nPohl HA. 1978. Dielectrophoresis Cambridge, UK: Cambridge.\nWong PK, Chen C-Y, Wang T-H, et al. 2004. Anal Chem, 76:6908–14.\n\n"}