{"doi":"10.1007\/3-540-45814-X_18","coreId":"19236","oai":"oai:eprints.bham.ac.uk:255","identifiers":["oai:eprints.bham.ac.uk:255","10.1007\/3-540-45814-X_18"],"title":"Metamagnetic Quantum Criticality in Sr3Ru2O7","authors":["Schofield, Andrew J (Professor)","Millis, A. J.","Grigera, S. A.","Lonzarich, G. G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002","abstract":"We consider the metamagnetic transition in the bilayer ruthenate, ${\\rm Sr_3Ru_2O_7}$, and use this to motivate a renormalization group treatment of a zero-temperature quantum-critical end-point. We summarize the results of mean field theory and give a pedagogical derivation of the renormalization-group equations. These are then solved to yield numerical results for the susceptibility, the specific heat and the resistivity exponent which can be compared with measured data on ${\\rm Sr_3Ru_2O_7}$ to provide a powerful test for the standard framework of metallic quantum criticality. The observed approach to the critical point is well-described by our theory explaining a number of unusual features of experimental data. The puzzling behaviour very near to the critical point itself, though, is not accounted for by this, or any other theory with a Fermi surface","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.bham.ac.uk:255<\/identifier><datestamp>\n      2011-10-12T11:03:41Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Metamagnetic Quantum Criticality in Sr3Ru2O7<\/dc:title><dc:creator>\n        Schofield, Andrew J (Professor)<\/dc:creator><dc:creator>\n        Millis, A. J.<\/dc:creator><dc:creator>\n        Grigera, S. A.<\/dc:creator><dc:creator>\n        Lonzarich, G. G.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        We consider the metamagnetic transition in the bilayer ruthenate, ${\\rm Sr_3Ru_2O_7}$, and use this to motivate a renormalization group treatment of a zero-temperature quantum-critical end-point. We summarize the results of mean field theory and give a pedagogical derivation of the renormalization-group equations. These are then solved to yield numerical results for the susceptibility, the specific heat and the resistivity exponent which can be compared with measured data on ${\\rm Sr_3Ru_2O_7}$ to provide a powerful test for the standard framework of metallic quantum criticality. The observed approach to the critical point is well-described by our theory explaining a number of unusual features of experimental data. The puzzling behaviour very near to the critical point itself, though, is not accounted for by this, or any other theory with a Fermi surface.<\/dc:description><dc:date>\n        2002<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.bham.ac.uk\/255\/1\/salerno.pdf<\/dc:identifier><dc:relation>\n        public<\/dc:relation><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/255\/1.hassmallThumbnailVersion\/salerno.pdf<\/dc:relation><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/3-540-45814-X_18<\/dc:relation><dc:identifier>\n        Schofield, Andrew J (Professor) and Millis, A. J. and Grigera, S. A. and Lonzarich, G. G. (2002) Metamagnetic Quantum Criticality in Sr3Ru2O7. Lecture Notes in Physics, 603. pp. 271-289. ISSN 1616-6361<\/dc:identifier><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/255\/<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["public","http:\/\/eprints.bham.ac.uk\/255\/1.hassmallThumbnailVersion\/salerno.pdf","http:\/\/dx.doi.org\/10.1007\/3-540-45814-X_18","http:\/\/eprints.bham.ac.uk\/255\/"],"year":2002,"topics":["QC Physics"],"subject":["Article","PeerReviewed"],"fullText":"Metamagnetic Quantum Criticality in Sr3Ru2O7\nA. J. Schofield1, A. J. Millis2, S. A. Grigera3, and G. G. Lonzarich4\n1 School of Physics and Astronomy, University of Birmingham, Edgbaston,\nBirmingham, B15 2AD, United Kingdom.\n2 Department of Physics, Columbia University, 538 W 120th St, New York,\nNY 10027 USA.\n3 School of Physics and Astronomy, University of St. Andrews, North Haugh, St\nAndrews, Fife, KY16 9SS, United Kingdom.\n4 Cavendish Laboratory, Madingley Road, Cambridge, CB3 0HE, United Kingdom.\nAbstract. We consider the metamagnetic transition in the bilayer ruthenate, Sr3Ru2O7,\nand use this to motivate a renormalization group treatment of a zero-temperature\nquantum-critical end-point. We summarize the results of mean field theory and give a\npedagogical derivation of the renormalization-group equations. These are then solved\nto yield numerical results for the susceptibility, the specific heat and the resistivity ex-\nponent which can be compared with measured data on Sr3Ru2O7 to provide a powerful\ntest for the standard framework of metallic quantum criticality. The observed approach\nto the critical point is well-described by our theory explaining a number of unusual\nfeatures of experimental data. The puzzling behaviour very near to the critical point\nitself, though, is not accounted for by this, or any other theory with a Fermi surface.\n1 Introduction\nThe presently interesting ruthenium-oxide metals provide a useful test-bed for\nbasic theoretical ideas in the strongly correlated electron problem. The single-\nlayer ruthenate Sr2RuO4, being isostructural and isoelectronic with the parent\ncompound of a cuprate superconductor, La2CuO4, was original studied as an\nexample of a conventional quasi-2D Fermi-liquid metal [20] against which to\ncompare the more exotic cuprates. The discovery [21] of what now appears to\nbe triplet superconductivity [28] shows that this compound is fascinating in its\nown right as well as providing a new perspective on cuprate physics. In this\npaper we discuss the bilayer version of this compound, Sr3Ru2O7, and argue\nthat the metamagnetism in this material [27,14] provides an important test for\nthe conventional framework [17,23] of quantum-critical points in metals.\nA metamagnetic transition is empirically defined as a rapid increase in mag-\nnetization at a particular value of applied magnetic field. Because there is no\nbroken symmetry involved, one expects a first-order transition from a low-\nmagnetization to a high-magnetization state as an applied magnetic field, H ,\nis swept through a (temperature-dependent) critical value, Hmm(T ). Near a first\norder transition, kinetics may be complicated but thermodynamic fluctuation\ncorrections to observables should not be divergent or particularly large. How-\never in general, the curve of first-order transitions, Hmm(T ), terminates in a\nsecond-order critical point (H ∗, T ∗) which is characterized by divergent fluctua-\ntions [see Fig. 1(a)]. Furthermore, by appropriately tuning material parameters\n2 A. J. Schofield et al.\nFig. 1. (a) Schematic phase diagram in the H,T plane showing a line of first-order\nmetamagnetic transitions terminating in a critical end-point. (b) This critical end-point\ncan by suppressed to lower temperatures using a suitable tuning parameter (such as\npressure). At a critical pressure, p0, we have pushed the end-point to T = 0 giving the\nquantum critical end-point discussed in this paper.\n(by applying pressure for example) it should be possible to reduce T ∗ to zero\ntemperature, yielding a quantum-critical end-point. This situation is illustrated\nin Fig. 1 (b) which shows a possible variation of the temperature of the critical\nend-point with pressure. At a critical end-point there are important fluctua-\ntion effects and near a quantum critical end-point the quantal nature of these\nfluctuations also needs to be taken into account.\nThe bilayer ruthenate is not unique in showing metamagnetism. A num-\nber of ‘strongly correlated metals’, including UPt3 [34], CeRu2Si2 [15,2,12],\nCeRh2Si2 [16] and other heavy fermion compounds [1], as well as d-electron\nsystems such as MnSi [35] exhibit metamagnetic transitions with properties sug-\ngestive of proximity to a quantum critical point. What makes Sr3Ru2O7 [27]\nstand out is that at ambient pressure and moderate applied field it seems that\nthis material is tuned almost exactly to such a quantum-critical end-point [14].\nBy a direct comparison of our theory with experiments we show that this sys-\ntem is indeed close to a quantum-critical end-point. In addition, we are able to\nexplain a number of heretofore puzzling features observed in this system: the fi-\nnite temperature peak in the weak-field susceptibility [18] and the paramagnetic\nground state in a metal that should, according to band-structure calculations,\nbe ferromagnetic [32].\nQuantum critical transitions in itinerant electron systems have themselves\nalso attracted widespread interest. Generally they are reached by tuning the\nordering temperature of a second order phase transition to absolute zero using a\ncontrol parameter, such as pressure [19] or chemical composition [36]. The critical\nfluctuations of the slow mode associated with the ordering often influences a wide\nregion of the temperature\/tuning parameter phase diagram. The effect of these\nfluctuations is the appearance of non-Fermi liquid temperature dependences in\nquantities such as the resistivity, specific heat and the Pauli susceptibility [23].\nIndeed it has been suggested that the proximity to a quantum critical point may\nbe the root cause of much of the non-Fermi liquid seen in nature even when\nthere is no obvious symmetry breaking phase transition in the phase diagram.\nMetamagnetic Quantum Criticality in Sr3Ru2O7 3\nOne possibility is that the order is present but hidden [9]. Alternatively, the\nquantum critical point is argued to be close to the physical system in the sense\nthat one could tune to it but only through the application of some unphysical\ntuning parameter (such as negative pressure), though the physical system is\naffected by the “almost critical” modes of this transition [13]. In this paper we\ninvestigate a third possibility: a quantum critical end-point.\nAn appealing feature of quantum criticality from a theoretical perspective\nis that an established and tractable theory has been developed [17,23]. How-\never a number of the experimental realizations of quantum-critical systems show\ndeviations from the predicted behaviour [31] which have caused some to ques-\ntion its validity [11]. Factors omitted in the original theory include other, non-\ncritical, slow modes [4], the possible influence of disorder [29] and the Kondo\neffect [11]. We shall show that these factors should not be present at a metam-\nagnetic quantum-critical end-point and so the theory we present will provide a\nclean test of the standard [17,23] framework when compared with experiments.\nThere have been a number of mean-field treatments of metamagnetism in\nmetals recently [22,30] and some discussion was given in the context of a treat-\nment of weak ferromagnets via the ‘SCR’ method [37,38]. Our work gives, we\nbelieve, the first analysis of the critical phenomena at a metamagnetic point. In\nthis paper we give a pedagogical account of our renormalization group theory of\nmetamagnetic quantum criticality—specializing here to the case of a two dimen-\nsional system as is appropriate for the layered ruthenates. A brief account of our\nresults for Sr3Ru2O7 and the more general case is shortly to be published [24].\n2 Deriving the action\nThe starting point for the treatment is the standard functional integral ap-\nproach [26] to the interacting-electron problem where we have assumed that the\nimportant interaction is a spin-density interaction. This is then decoupled by\nintroducing a Hubbard-Stratonovich field\nZ =\n∫\nD(ψ¯, ψ)e−\n∫\nh¯β\n0\ndτ\n∑\nq [ψ¯q (τ)(∂τ+\u000fq−µ)ψq (τ)−J(q)Sq (τ)·S−q (τ)], (1)\n=\n∫\nD(ψ¯, ψ,φ) exp\n[\n−\n∫ h¯βdτ\n0\n∑\nq,α\n1\n4J(q)λ2\nφq,αφ−q,α\n+\n∫\ndDrψ¯α(r, τ) {δα,β (∂τ + \u000f(−ih¯∇)− µ) + iλφ(r) · σαβ}ψβ(r, τ)\n]\n.(2)\nThe key assumption lying behind the standard approach developed by Hertz [17]\nand refined by Millis [23] is that the electronic degrees of freedom may be inte-\ngrated out leaving a model of an over-damped bosonic modes which may then be\nanalysed by renormalization-group methods. It is this procedure that we follow\n4 A. J. Schofield et al.\nhere. Doing the integration over the fermion Grassmann fields, ψ, yields\nZ = Z0\n∫\nDφe\n[\n−\n∫\nh¯βdτ\n0\n∑\nq,α\n1\n4J(q)λ2\nφq,αφ−q,α+\n∫\nd2x ln det{∂τ+\u000f(−ih¯∇)−µ+iλφ·σ}\n]\n.\n(3)\nThis “ln det” term is then expanded in powers of the field to give the effective\naction. The leading order term contains the important dynamics\nSG[φ] =\n1\n2\n∑\nωn,q\n[\n1\n4J(q)λ2\n+\nλ2\n2\nΠ(q, ω)\n]\nφ−ωn,−q · φωn,q . (4)\nHere Π(q, ωn) is the Lindhard function, which comes from the fermion bubble\nobtained by expanding the determinant. Redefining the fields (using λ) to make\nthem dimensionless and expanding the Lindhard function we obtain the Gaussian\naction\nSG[φ] =\n1\n2\n∑\nωn,q\nE\n[\nr + ξ2q2 +\n|ωn|\nvq\n]\nφ−ωn,−q · φωn,q . (5)\nHere ξ ∼ 1\/kF , v ∼ vF , E is an electronic energy scale and r = 1− J(0)\/E is a\nmeasure of the deviation of the system from the Stoner instability [33]: when the\nreduction in interaction energy from mean-field ordering more than compensates\nfor the consequential increase in kinetic energy. We have used a conventional gra-\ndient expansion for the static part of the action and assumed that the coefficients\nare simple numbers and that the parameters vary weakly with temperature (as\nT 2, as usual in Fermi-liquid theory). For an O(3) ferromagnetic quantum critical\npoint this may not be the case [5,10], but in the presence of a symmetry breaking\nfield, the T 2 and gradient expansions are believed [4] to apply.\nThe frequency dependence above is a consequence of the conservation-laws\nof the order parameter, φ. Since φ is essentially the difference in position of the\n“spin-up” and “spin-down” Fermi surfaces, then fluctuations at nonzero q corre-\nspond to locally increasing the number of “spin-up” electrons and decreasing the\nnumber of “spin-down” electrons. If “spin” is conserved such a fluctuation can\nrelax only via propagation or diffusion of electrons within each spin manifold.\nThis must vanish as q → 0. Quotes are placed about “spin up” and “spin down”\nbecause in many metamagnetic materials spin-orbit coupling is large and spin\nis not a good quantum number. However, for most purposes one may adopt a\n‘pseudo-spin’ notation [6] labelling the two Kramers-degenerate states in zero-\nfield. The Kramer’s degeneracy is broken by an applied field, leading to two Fermi\nsurfaces and the theory carries through as in the non-spin-orbit case: since in\na clean spin-orbit-coupled system, pseudo-spin is conserved (at least for fields\naligned along a crystal symmetry axis). There is one exception to this—disorder\nscattering in the presence of strong spin-orbit coupling can allow pseudo-spin\nrelaxation even as q → 0. Then the vq term would be replaced by a momentum\nindependent constant leading to a dynamical exponent of z = 2 (see later).\nFurther expansion in the fields φ adds interaction terms to the action giving\nthe final form of the action\nS[φ] = SG +\n∫\nd2xdτ\n1\n4\nuabφ\n2\naφ\n2\nb +\n1\n6\nvabcφ\n2\naφ\n2\nbφ\n2\nc − gµBH · φ(x, τ) + · · · . (6)\nMetamagnetic Quantum Criticality in Sr3Ru2O7 5\nIn writing the action above we have in mind the case of Sr3Ru2O7 so are\nspecializing to the case of two dimensions. The subscripts on the fields are com-\nponents of the vectors and are summed over. Experimentally it is known that\nat zero temperature the weak-field susceptibility is isotropic which implies no\ndirectional dependence of r or g. It becomes anisotropic at finite magnetic field\nand\/or temperature where, as we will see, higher order terms in the expansion\nbecome important—hence in general u and v are anisotropic tensors. Obtaining\nthe anisotropy theoretically requires inclusion of spin-orbit effects not explicitly\nwritten in Eq. 3 above. We choose units such that the field φ is measured rela-\ntive to the saturation magnetization: 2µB\/Ru. (The important electrons are in\nd shells with four in t2g which leaves two holes and the g factor should be close\nto 2.)\nFig. 2. Mean field treatment of the magnetization from Eq. 7. The phase diagram\ndepends on rv\/u2 and the equilibrium magnetization is found when the tangent to the\nfree energy curves equals the magnetic field (here measured in units of gµB). This is\nillustrated in (a) to (c). The general phase diagram is shown in (d) where the lines\nrepresent the metamagnetic transition for 9\/20 < rv\/u2 < 3\/16. For rv\/u2 > 9\/20 we\nhave crossover behaviour and no transition. For rv\/u2 < 3\/16 the system is unstable\nto a first order ferromagnetism even in the absence of an applied field. The critical\nend-point of the metamagnetism occurs at rv\/u2 = 9\/20 where the magnetization has\ninfinite slope at the critical field as show in (e).\n6 A. J. Schofield et al.\n3 Mean-\feld theory\nTo develop an understanding of this model we consider it first in mean-field the-\nory ignoring the effect of fluctuations, both quantal and spatial, by suppressing\nthe τ , ω and x, q dependence and treating the action as a free energy:\nF [φ] =\n1\n2\nrφ2 +\n1\n4\nuφ4 +\n1\n6\nvφ6 + gµBHφ . (7)\nWe have suppressed the vector nature of the field φ for simplicity here. To\nobtain a metamagnetic transition we require that r > 0 so that the ground\nstate is paramagnetic, but that the fourth order term u is negative (v > 0\ncontrols the expansion). The equilibrium magnetization, φ¯, is then found by\nminimizing the action. The solutions are when the tangent to the free energy,\n∂F\/∂φ, is equal to gµBH . Such solutions are shown graphically in Fig. 2(a)–(c).\nThe form of the phase diagram is shown in Fig.2 where it can be seen that the\nratio rv\/u2 determines the transitions. For 9\/20 < rv\/u2 < 3\/16 we have a\nfirst order metamagnetic transition signalled by a jump in the magnetization at\nfinite magnetic field [see Fig. 2(e)]. The critical end-point of the metamagnetic\ntransitions occurs when F [φ] first develops an inflection point: at rv\/u2 = 9\/20.\nThe magnetization then has infinite slope at a critical field, H ∗. At the critical\nend-point and for fields in the c-direction (restoring the tensorial nature of the\nterms)\nm∗c =\n√\n−3ucc\n10vccc\n, geffµBH\n∗\nc =\n√\n−3ucc\n10vccc\n6u2cc\n25vccc\n. (8)\nComparison with experimental data on Sr3Ru2O7 allows us to fix parameters\nfor the theory. Fig. 1 of Ref. [27] shows that at low T and low applied field the\nsusceptibility is about 0.025µB\/T implying r ≈ 160µB − T ≈ 100K. This small\nvalue of r implies a very large enhancement of the susceptibility, χ ≈ 1\/r, over\nthe band value—the material is near a paramagnetic-ferromagnetic transition.\nFor fields directed along the c axis the observed metamagnetic transition occurs\nat a magnetization of about 0.25− 0.3µB\/Ru implying ucc = 3000− 4300K and\nvccc = 40, 000− 80, 000K with the larger values corresponding to the smaller m.\nThe consistency of these estimates may be verified by substitution into Eq. 8; use\nof geff = 2 yields an estimate of 5− 6T for the metamagnetic field, in the range\nfound experimentally. The scale E is of order 6000K-8000K. The dimensionless\ncritical field gµBH\n∗\/u ∼ 0.001. If we are concerned with the behaviour in the\nvicinity of the critical end-point then we should look at small deviations with\nrespect to this already small value. At present rather less information about\nthe spin fluctuation frequencies is available [8]. Therefore when comparing the\nresults of our renormalization group analysis with experiment, we will normalize\nour results results to the temperature T0 at which the differential susceptibility\nat the critical field is equal to the zero-field zero temperature susceptibility, i.e\n∂m\n∂h (δ = 0, T = T0) = χ(H = 0, T = 0) = χ0.\nMetamagnetic Quantum Criticality in Sr3Ru2O7 7\n4 Tree-Level Scaling\nHaving considered the model at mean field, we now proceed to treat the full\nquantum action of Eq. 6 via the renormalization group. The method we are\nusing is that of Ref. [23] and for completeness we outline the steps involved.\nThe first step is to perform “tree-level scaling” of the parameters in the action,\nwhich follows from a dimensional analysis. This only involves power-counting so\nwe write the action to emphasize this\nS = H ·φ+\n∫ Λ\nd2kdω\n[\nr + ξ2k2 +\n|ωn|\nvk\n]\nφ2+u\n∫ Λ\n(d2kdω)3φ4+v\n∫ Λ\n(d2kdω)5φ6+· · · .\n(9)\nNow the idea is to let the momentum bandwidth be rescaled: Λ(λ) = Λe−λ.\nThen all the coupling constants and fields will be rescaled to preserve the same\nphysics and so become functions of λ. Writing b = eλ we have Λ → Λ\/b. To\nrestore the momentum cutoff we must have k˜ = bk. Now this forces the gradient\nterm (proportional to k2) to have an extra factor of 1\/b2 so to maintain the\nsame form of the Gaussian part of the action we need to be able to pull out a\nb−2 factor from every term. This dictates the scaling of r and ω. So, r = r˜\/b2\nand hence we have\nr(λ) = re2λ ⇔\n∂r\n∂λ\n= 2r . (10)\nAlso ω\/k → ω˜\/(b2k˜) so this means that ω = ω˜\/b3 → [ω] = 3. This is the dynam-\nical exponent and is often denoted z. We then absorb all of the b factors into a\nrescaling of the field φ. There are two sources, the Jacobians from the change of\nvariables which will generate b−5, and the 1\/b2 factor from the coefficient of the\nGaussian term. Thus we have an overall factor of b−7. To absorb this, the field\nφ must scale as φ˜ = b−7\/2φ. This, in turn, dictates the scaling of the magnetic\nfield: h˜ = b+7\/2h. It also then fixes the form of the u and v part of the action.\nIn the φ4 term we have 3 powers of phase space integrals and 4 powers of the\nfield giving b−1 which must be absorbed by a renormalization of u : u˜ = b−1u.\nIn the φ6 term we have 5 powers of phase space integrals and 6 powers of the\nfield giving b−4 which must be absorbed by a renormalization of v : v˜ = b−4v.\nThus writing, λ = ln b, we have the following scaling equations at tree level:\n∂r\n∂λ\n= 2r , (11)\n∂h\n∂λ\n=\n7\n2\nh , (12)\n∂u\n∂λ\n= −u , (13)\n∂v\n∂λ\n= −4v . (14)\nThe remaining scaling equation is for the temperature. This is not so obvious\nperhaps from the above analysis. However, if we consider any physical quantity\n8 A. J. Schofield et al.\ncalculated in the theory then the scaling of temperature becomes apparent. We\nwill use the free energy computed from the Gaussian part of the action. The\nfree energy is found from the partition function, βF = − lnZ. Now working to\nGaussian order only we find\nZ = Z0\n∫\nDφ exp [−SG(φ)]\n= Z0\n∏\nn,k\n1\nr + ξ2k2 + |ωn|\/Γk\n, (15)\nSo F = F0 +\nV\nβ\n∫\nd2k\n(2pi)2\n∑\nn\nln\n[\nr + ξ2k2 + |ωn|\/Γk\n]\n. (16)\nwhere Γk = vk is the Landau damping rate.\nHandling Matsubara sums involving |ωn| will recur in this paper so we give\nsome of the details here of how these are treated. The Matsubara sum is over\nωn = 2pin\/β and is formally divergent. We can regularize it by considering∮\ndz\n2piinB(z)f(z), where f(z) is the function we wish to sum over Matsubara\nfrequencies (here the logarithm) and nB is the Bose distribution. The contour of\nintegration is taken as a large radius circle centred on the origin. This contour\nintegral is divergent just as the sum is, however its divergence is temperature\nindependent as the contour is taken to infinity and so can be subtracted. Thus\nwe essentially do the Matsubara sum using the usual contour integral technique\nas if it did converge and the contour integral was zero.\nNow nB(z) has poles of residue 1\/β at the Matsubara frequencies so the sum\nover its residues will give the required Matsubara sum. The analytic structure\nof the logarithm requires knowing, in term, the analytic structure of |ωn|. This\ncomes from its origin in the Lindhard function where we find that\nz\npiΓ\nln\n(\nz + Γ\nz − Γ\n)\n→\n|ω|\nΓ\nfor z → iω . (17)\nThus f(z) has a branch cut along the real axis between −Γ and Γ . Finally the\nMatsubara sum plus the integral around the branch-cut must combine to give the\nvalue of the large radius contour integral (which we take to be zero as detailed\nabove). This allows us to evaluate the sum. (There is a pole on the branch-cut\nbut this will be taken care of by the principle part of the line integral.) So we\nhave, for each mode k (and using η = r + ξ2k2),\nF =\n1\nβ\n∑\nn\nln (η + |ωn|\/Γ ) , (18)\n= −\n∫ Γ\n−Γ\ndω\n2pii\nnB(ω) ln(η − iω\/Γ ) +\n∫ Γ\n−Γ\ndω\n2pii\nnB(ω) ln(η + iω\/Γ ) , (19)\n= −\n∫ Γ\n−Γ\ndω\n2pi\nnB(ω)2 tan\n−1\n(\nω\nηΓ\n)\n. (20)\nMetamagnetic Quantum Criticality in Sr3Ru2O7 9\nThis can be viewed as the definition of the free energy of an overdamped simple\nharmonic oscillator—so confirming our regularization procedure. Now note that\nwe can write the Bose factor in terms of an odd and an even function\nnB(ω) =\n1\n2\n(\ncoth\n[\nω\n2kBT\n]\n− 1\n)\n. (21)\nSince the other term in the free energy is odd then we only need the odd part\nof Bose factor and we can halve the integration range, thereby giving for each\nmode\nF = −\n∫ Γ\n0\ndω\npi\ncoth\n(\nω\n2kBT\n)\ntan−1\n(\nω\nηΓ\n)\n. (22)\nThus our full expression for the free energy (per unit volume) is\nF = −\n∫ Λ d2k\n(2pi)2\n∫ Γk\n0\ndω\npi\ncoth\n(\nω\n2kBT\n)\ntan−1\n(\nω\/Γk\nr + ξ2k2\n)\n. (23)\nNow we imagine reducing the momentum cutoff as before: Λ → Λ\/b where\nb ∼ 1 + \u000f, and then perform the rescaling to restore, this time, the form of the\nequation for the free energy to the original one (Eq. 23). Just as before, we must\nhave k˜ = kb. Then in order for the argument of tan−1 to be preserved, we must\nhave r˜ = b2r and ω˜ = b3ω. This now forces the scaling of T from the argument\nof the coth such that T˜ = b3T . So we have the RG equation for T\n∂T\n∂λ\n= 3T . (24)\nThe rescaling of ω implies that to restore the form of the equation for the free\nenergy, we need to change the frequency cutoff to Γk˜. So as well as removing high\nmomentum modes the rescaling means that we are losing some high frequency\nmodes at all momenta. The effect of rescaling on the cutoffs is illustrated in\nFig. 3, where the shaded region shows the modes that are being removed.\n5 One-Loop Corrections\nWe now consider the one-loop corrections to the scaling equations to lowest\norder. The modes above the cutoff (as shaded in Fig. 3) are denoted > while the\nremaining modes are superscripted as <. We perturbatively include the effects\nof the modes above the cutoff by renormalizing terms in the effective action of\nthe remaining < sector:\nZ =\n∫\nD[φ<]D[φ>]e−SG[φ\n<]−SG[φ\n>]−SI[φ\n<,φ>] , (25)\n=\n∫\nD[φ<]D[φ>]e−SG[φ\n<]−SG[φ\n>]\n(\n1− SI[φ\n<, φ>] + · · ·\n)\n, (26)\n=\n∫\nD[φ<]e−SG[φ\n<]\n(\n1− 〈SI[φ\n<, φ>]〉>[φ\n<] + · · ·\n)\n, (27)\n=\n∫\nD[φ<]e−SG[φ\n<]−〈SI[φ\n<,φ>]〉>[φ\n<]+··· . (28)\n10 A. J. Schofield et al.\nFig. 3. When rescaling the k cutoff from Λ to Λ˜ = Λ\/b preserving the form at a\nGaussian level requires that the frequency cutoff is also rescaled: Γk becomes Γ˜k =\nΓk\/b\n2. The rescaling is independent of dynamical exponent z. The modes which are\nlost by this process are shaded.\nThus we obtain, perturbatively, a low energy effective action where the average\nis taken by integrating out the regions above the cut-off.\nFig. 4. The 1 loop contribution to the RG equations which renormalize r and u. The\nloop is summed over the high momentum and frequency modes > illustrated in Fig. 3\nAt lowest order in u we would have a correction coming from one loop which\nrenormalizes r as shown in Fig. 4. It produces an identical term to that renormal-\nizing u from v except for a combinatorial factor for an n component field which\ncomes from the number of ways of closing the loop. Doing the combinatorics\ngives 2n+ 4 for the u-loop and 3n+ 12 for the v-loop.\nNow in evaluating the diagrams of Fig. 4 we must integrate over the elimi-\nnated modes within the Gaussian approximation. (Strictly this is the Gaussian\nMetamagnetic Quantum Criticality in Sr3Ru2O7 11\napproximation for fluctuations of the field about the equilibrium value as dis-\ncussed later [Eq. 51] so we should replace the zero-field inverse-susceptibility, r,\nby the differential value at the field where scaling is being done, δ. Ultimately\nthough the modes we are integrating over are at the cut-off scale so we will be\nable to set this mass to zero and the distinction is not important.) The diagram\nas a whole (integrating over all modes) would in general have the following form:\nfall =\n∫ Λ\n0\nd2k\n(2pi)2\n1\nβ\n∑\nn\n1\nr + ξ2k2 + |ωn|\/Γk\n. (29)\nWe do the frequency sum in exactly the same way as we calculated the free\nenergy giving\nfall =\n∫ Λ\n0\nd2k\n(2pi)2\n∫ Γk\n0\ndω\npi\ncoth\n(\nω\n2kBT\n)\nω\/Γk\n(r + ξ2k2)2 + (ω\/Γk)2\n, (30)\n= A\n∫ Λ\n0\nkdk\n∫ Γk\n0\ndω coth\n(\nω\n2kBT\n)\nω\/Γk\n(r + ξ2k2)2 + (ω\/Γk)2\n. (31)\nwhere A = 12pi2 . However, for the RG equations we only need this function\nsummed over the missing modes. This can be done in two parts: the momenta\nbetween Λ\/b and Λ and the frequencies between Γk\/b\n2 and Γk.\nConsidering the high k modes first. The integral over k then becomes trivial\nsince the limits are coalescing. Thus we can replace k by Λ and multiply by the\nwidth of the integration region, Λ−Λ\/b. Using the fact that for small deviations\nof b from 1, we may write 1− b−a ∼ a ln b we can write\nfk = AΛ\n2(1− b−1)\n∫ ΓΛ\n0\ndω coth\n(\nω\n2kBT\n)\nω\/ΓΛ\n(r + ξ2Λ2)2 + (ω\/ΓΛ)2\n, (32)\n= AΛ2 ln b\n∫ vΛ\n0\ndω coth\n(\nω\n2kBT\n)\nω\/vΛ\n(r + ξ2Λ2)2 + (ω\/vΛ)2\n. (33)\nNow putting x = w\/vΛ we may rewrite the integral as\nfk = A ln b vΛ\n3\n∫ 1\n0\ndx coth\n[\nvΛx\n2kBT\n]\nx\n(r + ξ2Λ2)2 + x2\n. (34)\nNow we do the same for the high ω modes. For each k I have a trivial ω\nintegral to do with the limits coalescing: Γk\/b\n2 < ω < Γk. Thus we have\nfω = A\n∫ Λ\n0\nk dkΓk(1− b\n−2) coth\n(\nΓk\n2kBT\n)\n1\n(r + ξ2k2)2 + (1)2\n, (35)\n= 2A ln b\n∫ Λ\n0\ndk k2v coth\n[\nvk\n2kBT\n]\n1\n(r + ξ2k2)2 + 1\n. (36)\nNow putting y = k\/Λ we may rewrite this terms as\nfω = 2A ln b vΛ\n3\n∫ 1\n0\ndy coth\n[\nvΛy\n2kBT\n]\ny2\n(r + ξ2Λ2y2)2 + 1\n. (37)\n12 A. J. Schofield et al.\nNow we can identify the energy scales in the problem. One recurring scale is\nvFΛ = ΓΛ = ωsf , (38)\nwhich is the damping rate of spin-fluctuations at the cut-off.\nFinally, as noted above, we can set r = 0 since the >-sector modes are far\nfrom the criticality, so defining the following function (where t = kBT\/ωsf and\nsetting ξΛ = 1)\nf(t) = A\n∫ 1\n0\ndu coth\n( u\n2t\n)[ u\nu2 + 1\n+ 2\nu2\nu4 + 1\n]\n. (39)\nThus at 1-loop the RG equations become modified (λ = ln b) so that\ndr\ndλ\n= 2r +\nn+ 2\n2\nu(λ) f(t) , (40)\ndu\ndλ\n= −u+\nn+ 4\n2\nv(λ) f(t) . (41)\n6 Integrating the RG equations\nTo use these scaling equations (Eqs. 12, 14, 24, 40 and 41), together with the\ndefinition Eq. 39, we need to solve them. However, the RG equations are simply\na set of coupled linear differential equations which may be integrated directly.\nSolving the equations for v, T and h is trivial\nv(λ) = v0e\n−4λ , t(λ) = t0e\n3λ , h(λ) = h0e\n7λ\/2 . (42)\nWe can therefore substitute these results into the equation for u:\ndu\ndλ\n− u(λ) =\nn+ 4\n2\nv0e\n−4λf(t0e\n3λ) , (43)\nto be solved subject to the initial condition that u(0) = u0. This again is straight-\nforward\nu(λ) = e−λ\n[\nu0 +\nn+ 4\n2\nv0\n∫ λ\n0\ne−3xf(t0e\n3x)dx\n]\n. (44)\nNow again we can substitute this into the equation for r. Solving this yields\nr(λ)=e2λ\n[\nr0 +\nn+ 2\n2\n∫ λ\n0\ndye−2yf(t0e\n3y)u(y)\n]\n,\n=e2λ\n{\nr0 +\nn+ 2\n2\n∫ λ\n0\ndy e−3yf(t0e\n3y)\n[\nu0 +\nn+ 4\n2\nv0\n∫ y\n0\ndx e−3xf(t0e\n3x)\n]}\n.\n(45)\nNow we can rewrite the solution of the RG equations into parts which ex-\nplicitly are temperature dependent, and the remaining T = 0 values which are\nMetamagnetic Quantum Criticality in Sr3Ru2O7 13\nrenormalized from their initial values by quantal fluctuations. Consider the defi-\nnition of the function f(t) in Eq. 39. We may identify coth(y\/2t) = 1+2nB(y\/t)\nwhere, for t = 0, the Bose factor is zero for all positive y. Thus we may write\nf(t) = f0 + g(t) , (46)\nwhere\nf0 = A\n∫ 1\n0\ndu\n[\nu\nu2 + 1\n+ 2\nu2\nu4 + 1\n]\n∼ 0.0422 . (47)\ng(t) = A\n∫ 1\n0\ndunB\n(u\nt\n) [ u\nu2 + 1\n+ 2\nu2\nu4 + 1\n]\n. (48)\nThe dependence of r and u on f0 reflects how quantal fluctuations renormalize\nthe bare parameters at T = 0 and this can be an appreciable effect (determined\nby the size of u and v). The sign of these effects is such that they move the\nsystem away from the magnetically ordered phase. This provides an explana-\ntion for the band-structure predictions that Sr3Ru207 should be a ferromagnetic\nat zero magnetic field [32]: the quantal effects are pushing the metal into the\nparamagnetic phase.\nIt is more transparent to write the solution to the scaling equations explicitly\nin terms of the T = 0 renormalized parameters\nr(λ) = e2λ\n[\nreff +\nn+ 2\n2\n∫ λ\n0\ndye−3y\n{\nueffg(t0e\n3y) +\nn+ 4\n2\nv0\n∫ y\n0\ne−3xg(t0e\n3x)dx\n}]\n.\n(49)\nFinally, it is also more convenient for the numerical evaluation to use t as the\nrunning variable rather than λ. This then amounts to a change of variables in\nthe equation for r: t = t0e\n3w. Thus dw = dt\/(3t). Doing this change of variables\nin each of the integrals we will have\nr(λ) = e2λ\n[\nreff +\nn+ 2\n2\n∫ t0e3λ\nt0\ndt\n3t\n(\nt0\nt\n){\nueff(3\n−1 ln t\/t0)g(t)\n+\nn+ 4\n2\nv0\n∫ t\nt0\n(\nt0\nt′\n)\ng(t′)\ndt′\n3t′\n}]\n. (50)\nThis is the expression we will use for subsequent numerical evaluation.\n7 Numerical Procedure\nThe process by which we turn the solution of the scaling equations into physical\nquantities is described as follows (though performed numerically). For a fixed\nset of initial parameters reff , ueff , v0 and t0, integrate the RG equations until\nr = 1. This effectively sets the H = 0 and T = 0 susceptibility to 1 (which is\n14 A. J. Schofield et al.\nthe normalization for our results). We then use the rescaled parameters at the\nvalue of λ which gives r = 1.\nTo analyse the experimental consequences of proximity to metamagnetism\nwe consider Gaussian fluctuations about the equilibrium magnetization as deter-\nmined from the action now with the renormalized parameters. We expand the\nfield about its equilibrium point: ϕ = (|φ| − φ¯)\/φ0 normalized to the saturation\nmagnetization (φ0). At the metamagnetic point itself we find φ¯\n2 = −3u\/10v. We\nmeasure the field relative to the critical field h = (H −H ∗)\/H∗. The resulting\naction at quadratic order looks exactly the same as the Gaussian action for the\ntotal magnetization Eq. 5 since its form is determined by symmetry\nSmeta =\n∫\nd2q\n∑\nn\n[\nδ + ξ2q2 +\n|ωn|\nvq\n]\nϕq,ωnϕ−q,−ωn . (51)\nHowever here r has been replaced by δ, the “mass” of the fluctuations, which\nmeasures the distance from the quantum critical end-point. Experimentally it is\nthe inverse of the differential susceptibility: δ = r+3uφ¯2+5vφ¯4. The differential\nsusceptibility, δ−1, diverges at the critical end-point. At the metamagnetic criti-\ncal end-point (rv\/u2 = 9\/20) but not quite at the critical magnetic field (h 6= 0)\nthen we find, from an expansion of Eq. 7, that\nδ =\n3r(2φ¯2r−1h)2\/3\nφ¯2\n. (52)\nAnalysis of this action alone can be used to determine the qualitative behaviour\nnear the metamagnetic point. The results are reminiscent of a ferromagnetic\nquantum critical point except that the “mass” is also related to the field h. Re-\nsults are summarized in Ref. [24]. Note that the detailed temperature dependence\nof quantities requires integration of the RG equations.\nWe compute three key quantities: the differential susceptibility, the resistivity\nexponent and γ = C\/T . The differential susceptibility (δ−1) is obtained directly\nfrom the second derivative of the free energy about the equilibrium value (with\nthe rescaled parameters). The linear term in the heat capacity is determined\nfrom the second-temperature derivative of the free energy of Eq. 23 but evaluated\nusing the parameters of the Gaussian model of Eq. 51. The resistivity is more\ninvolved since we now need to reconsider the electrons which were integrated out.\nWe essentially “undo” the Hubbard Stratonovich of Eq. 2 only now using the\nGaussian action for φ (Eq. 51 determined using the renormalized parameters).\nThe resistivity then comes from considering the lowest order term in the self-\nenergy that comes from interactions of the electrons with the mode ϕ. This\nself-energy must be corrected for the forward scattering physics: the dominant\nscattering is at long wavelength and so is ineffective at degrading a current.\nAt lowest order the electron self-energy is\nΣ(p, iΩn′) = J\n2\n∫\nd2q\n(2pi)2\n1\nβ\n∑\nn\nG(p− q, iΩn′ − iωn)D(q, iωn) , (53)\nMetamagnetic Quantum Criticality in Sr3Ru2O7 15\nwhere G is the non-interacting electron Green’s function and D(q, iωn) = (δ +\nξ2q2+ |ωn|\/Γq)\n−1 is the Gaussian propagator of the spin fluctuations. Doing this\nsummation and integral is straightforward particularly since we are interested\nin the quasiparticle scattering rate at the Fermi surface. For this we need the\nimaginary part of the self-energy calculated on shell\n1\nτpF\n= −2ImΣ(pF , iΩn′ → \u000fpF + i0\n+) , (54)\nand corrected for the 1 − cos θ ∼ (q\/kF )\n2 forward scattering factor (θ is the\nscattering angle). After some algebra we find\n1\nτ2DpF\n∼\n∫ ∞\n0\nqdq\npi2\n(\nq\nkF\n)2 ∫ 0\n−vF\ndω′\nvF q\n1\nsinh(ω′β)\n2ω′\/Γq\n(δ + ξ2q2)2 + (ω′\/Γq)2\n. (55)\n8 Results\nWe have started with an isotropic n = 3 vector theory for the magnetization\nvariable (just as would be the case for a ferromagnetic quantum critical point).\nRefs. [5,3,10] have argued that the spatial gradient structure in this case is\ndramatically affected by interaction corrections. However in the presence of a\nmagnetic field, the ‘mass’ (coefficient of the quadratic part of the fluctuations)\nbecomes anisotropic, with the component corresponding to fluctuations along\nthe field becoming reff = r+3uφ\n2\n+5vφ\n4\n. A Heisenberg-XY or Heisenberg-Ising\ncrossover occurs when then larger of reff or r passes through unity and scaling\nstops when the smaller of the two becomes of order unity. Thus in the vicin-\nity of the metamagnetic transition we are only dealing with a one-component,\nIsing, field as described in Eq. 51 which does not suffer from the deviations\nmentioned above. Moreover the bilayer ruthenate material is stoichiometric so\ndisorder should not be so important and, being a d metal system, Kondo physics\nis not relevant. So it seems that none of the possible mechanisms for discrepan-\ncies from the conventional theory should apply to the metamagnetic quantum\nend-point in Sr3Ru2O7. Indeed comparison of the theory developed here with\nexperiment provides an excellent test of the theoretical framework.\nWe now present the results of a numerical solution of the scaling equations.\nFig. 5 shows the h dependence of the differential susceptibility for several val-\nues of T , obtained in the two dimensional case using parameters reasonable for\nSr3Ru2O7. The inset shows the temperature dependence of the differential sus-\nceptibility for different h. Note the non-monotonic temperature dependence for\nfields different from h = 0 if the control parameter is tuned to criticality. Thus\nour theory shows that the similar peak seen in the experiments [18] is not an\nindication of some hidden magnetic order but rather is a natural signature of\nproximity to a metamagnetic quantum critical end-point.\nFig. 6 shows the specific heat coefficient γ = C\/T ; in this quantity the\ncrossover is much less sharp, in part because a 2d nearly critical Fermi liquid\nhas a specific heat coefficient γ ∼ A+ BT with both A and B divergent as the\n16 A. J. Schofield et al.\n0.1 0.2 0.3 0.4 0.5\n2\n4\n6\n8\n10\n12\nD\nif\nfe\nre\nn\nti\nal\nS\nu\nsc\nep\nti\nb\nil\nit\ny\n0.1 0.2 0.3 0.4 0.5\n2\n4\n6\n8\n10\n12\n14\nD\nif\nfe\nre\nn\nti\nal\nS\nu\nsc\nep\nti\nb\nil\nit\ny\nFig. 5. Differential susceptibility, χ−1\n0\n(∂m\/∂h), as a function of applied field H at\ntemperatures T\/T0 = 0.05, 0.1, 0.2, for a two dimensional metamagnetic critical point.\nInset: Dependence of χ−1\n0\n(∂m\/∂h) on temperature T at h = .01, .02, .04, .08. (Normal-\nizations discussed in text.)\ncritical point is approached. This is an example of the corrections to scaling from\nthe one-loop corrections of the irrelevant operators. The inset shows the resis-\ntivity exponent α = −∂ ln ρ\/∂ lnT plotted against temperature for h = 0 and\nh = 0.1. The high-T resistivity exponent at a ferromagnetic critical point would\nnaively expected to be 4\/3. However the 1-loop corrections modify this value as\nshown in the inset. The crossover to the expected low-T T 2 behaviour is very\nsharp. The coefficient of this T 2 resistivity diverges h−2\/3 as the critical point is\napproached since it is determined δ (see Eq. 52). This power-law divergence is\nseen in Sr3Ru2O7 as the critical field is approached.\nThere are, however, two features of the experimental resistivity that this\ntheory cannot explain. The first is that the residual (elastic) part of the resistivity\nshows a sharp maximum at the critical field. This is presumably a consequence\nof the interplay between static disorder and the critical fluctuations—which is\nbeyond the scope of this treatment [7]. The second is that at the critical point\nitself a new temperature dependent resistivity is seen: ρ ∼ ρ0 +AT\n∼3 [14]. This\ntemperature dependence is not found in this theory. Indeed it is hard to see\nhow such behaviour could arise in any theory involving a Fermi surface: any\nresidual electron-electron scattering at the Fermi surface should at least give a\nT 2 resistivity which would dominate.\nMetamagnetic Quantum Criticality in Sr3Ru2O7 17\n0.1 0.2\n40\n60\n80\n0.2 0.4 0.6 0.8 1.\n1.2\n1.4\n1.6\n1.8\n2.\nR\nes\nis\nti\nv\nit\ny\nE\nx\np\no\nn\nen\nt\nFig. 6. Dependence of specific heat coefficient C\/T on temperature T for h =\n0.01, .0.1, 0.2, 0.4 calculated for a two dimensional metamagnetic critical point. Inset:\nDependence of resistivity exponent ∂ ln ρ\/∂ lnT on T for h\/H∗ = 0 (lower curve) and\n0.1 (upper curve). (T0 defined in text.)\nThe unusual resistivity at the critical point itself is very mysterious. It could\nperhaps be a consequence of a first order metamagnetic transition occurring at\nthe lowest temperatures. The process whereby the higher magnetization phase\nnucleates in the lower magnetization one and the result of this on the resistivity\nis a possible avenue to be explored. A more speculative idea is that a novel metal-\nlic state has been found. Most metals at quantum critical points are unstable\nto other ordered phases. Either the transition goes first order (as is the case for\nMnSi) or superconductivity is induced. At the metamagnetic critical end-point\nneither of these states are possible: the magnetic field is too strong for super-\nconductivity and we have deliberately tuned away the first order transition.\nWithout the usual “escape routes” perhaps we are forcing the metamagnetic\nquantum critical metal to do something entirely different and new.\n9 Conclusions\nIn conclusion, we have presented a theory of metamagnetic quantum criticality\nas it applies to the bilayer ruthenate Sr3Ru2O7. We have obtained numerical\nsolutions to the RG equations and used them to compute the differential suscep-\ntibility, the specific heat and the resistivity. Our theory accounts for the unusual\n18 A. J. Schofield et al.\ntemperature dependence of χ(T,H = 0), the paramagnetic ground state and the\nmain features of behaviour seen in Sr3Ru2O7 as the metamagnetic critical point\nis approached. This lends weight to the assumptions underlying much of the re-\ncent work on quantum phase transitions and indeed on non-Fermi liquids. How-\never, the puzzling behaviour of Sr3Ru2O7 at the critical point itself [14] remains\noutside this framework. Subsequent papers [25] will present the most general\ncase, and in particular apply the theory in three dimensional materials such as\nMnSi. We have shown already that the assumptions implicit in the conventional\napproach, which underlie much recent work on quantum phase transitions in\nmetals and indeed on non-Fermi-liquid physics, are apparently consistent with\nmuch of the observed behaviour of Sr3Ru2O7.\nAcknowledgements: AJS acknowledges the support of the Royal Society and\nLeverhulme Trust. AJM was supported by NSF-DMR-0081075 and the EPSRC\nand thanks the Cavendish Laboratory, the Theoretical Physics group at the Uni-\nversity of Birmingham and the Aspen Center for Physics for hospitality while\nparts of this work were undertaken. We thank A. P. Mackenzie for advice, encour-\nagement and comments on the manuscript and D. J. Singh for helpful comments.\nReferences\n1. See, e.g. articles in Proceedings of the 6th International Conference on Research\nin High Magnetic Fields, published in Physica: B94-5, 2001 or in the SCES98\nproceedings, Physica: B259-261, 1999.\n2. H. Aoki, S. Uji, A. K. Albessard, and Y. Onuki. Transition of f electron nature\nfrom itinerant to localized: Metamagnetic transition in CeRu2Si2 studied via the\nde haas–van alphen effect. Phys. Rev. Lett., 71(13):2110–2113, 1993.\n3. D. Belitz, T. R. Kirkpatrick, A. J. Millis, and Thomas Vojta. Nonanalytic magneti-\nzation dependence of the magnon effective mass in itinerant quantum ferromagnets.\nPhys. Rev. B, 58(21):14155–14158, 1998.\n4. D. Belitz, T. R. Kirkpatrick, and Thomas Vojta. Which quantum phase transitions\nare described by local order parameter field theories? cond-mat\/0109547.\n5. D. Belitz, T. R. Kirkpatrick, and Thomas Vojta. Nonanalytic behavior of the spin\nsusceptibility in clean fermi systems. Phys. Rev. B, 55(15):9452–9462, 1997.\n6. E. I. Blount. Symmetry properties of triplet superconductors. Phys. Rev. B,\n32(5):2935–2944, 1985.\n7. G. Busiello, L. De Cesare, and I. Rabuffo. Quenched-impurity influence on quantum\ncritical behavior. Phys. Rev. B, 29(7):4189–4191, 1984.\n8. L. Capogna, E. M. Forgan, S. M. Hayden, A. Wildes, J. A. Duffy, A. P. Mackenzie,\nR. S. Perry, S. Ikeda, Y. Maeno, and S. P. Brown. Observation of two-dimensional\nspin fluctuations in the bilayer ruthenate Sr3Ru2O7 by inelastic neutron scattering.\ncond-mat\/0201556.\n9. S. Chakravarty, R. B. Laughlin, D. K. Morr, and C. Nayak. Hidden order in the\ncuprates. Phys. Rev. B, 63:094503, 2001.\n10. Gennady Y. Chitov and Andrew J. Millis. Leading temperature corrections to\nfermi liquid theory in two dimensions. Phys. Rev. Lett., 86(23):5337–5340, 2001.\n11. P. Coleman, C. Pepin, Q. Si, and R. Ramazashvili. How do fermi liquids get heavy\nand die? J. Phys.: Condens. Matter, 13:R723–R738, 2001.\nMetamagnetic Quantum Criticality in Sr3Ru2O7 19\n12. J. Flouquet, S. Kambe, L. P. Regnault, P. Haen, J. P. Brison, F. Lapierre, and\nP. Lajey. The heavy fermion compound CeRu2Si2 - magnetic instability, lattice\nquasicollapse and metamagnetism. Physica, B215(1):77–87, 1995.\n13. P. Gegenwart, F. Kromer, M. Lang, G. Sparn, C. Geibel, and F. Steglich. Non-\nfermi-liquid effects at ambient pressure in a stoichiometric heavy-fermion com-\npound with very low disorder: CeNi2Ge2. Phys. Rev. Lett., 82(6):1293–1296, 1999.\n14. S. A. Grigera, R. S. Perry, A. J. Schofield, M. Chiao, S. R. Julian, G. G. Lonzarich,\nS. I. Ikeda, Y. Maeno, A. J. Millis, and A. P. Mackenzie. Magnetic field-tuned\nquantum criticality in the metallic ruthenate Sr3Ru2O7. Science, 294(5541):329–\n332, 2001.\n15. P. Haen, J. Flouquet, F. Lapierre, P. Lejay, and G. Remenyi. Metamagnetic-like\ntransition in CeRu2Si2. J. Low Temp. Phys., 67(5-6):391–419, 1987.\n16. T. Hamamoto, K. Kindo, T. C. Kobayashi, Y. Uwatoko, S. Araki, R. Settai, and\nY. Onuki. Metamagnetic transition of CeRh2Si2 under high fields and high pres-\nsures at various temperatures. Physica B, 281-282:64–65, 2000.\n17. John A. Hertz. Quantum critical phenomena. Phys. Rev. B, 14(3):1165–1184,\n1976.\n18. Shin-Ichi Ikeda, Yoshiteru Maeno, Masashi Kosaka, and Yoshiya Uwatoko. The\nground state in Sr3Ru2O7 revisited; fermi liquid close to a ferromagnetic instability.\nPhys. Rev. B, 62(10):R6089–R6092, 2000.\n19. S R Julian, C Pfleiderer, F M Grosche, N D Mathur, G J McMullan, A J Diver,\nI R Walker, and G G Lonzarich. The normal states of magnetic d and f transition\nmetals. J. Phys.:condens. matt., 8(48):9675–9688, 1996.\n20. A. P. Mackenzie, S. R. Julian, A. J. Diver, G. J. McMullan, M. P. Ray, G. G.\nLonzarich, Y. Maeno, S. Nishizaki, and T. Fujita. Quantum oscillations in the\nlayered perovskite superconductor Sr2RuO4. Phys. Rev. Lett., 76(20):3786–3789,\n1996.\n21. Y. Maeno, H. Hashimoto, K. Yoshida, S. Nishizaki, T. Fujita, J. G. Bednorz, and\nF. Lichtenberg. Superconductivity in a layered perovskite without copper. Nature,\n372(6506):532–534, 1994.\n22. D. Meyer and W. Nolting. Strong-coupling scenario of a metamagnetic transition.\nPhys. Rev. B, 64:052404, 2001.\n23. A. J. Millis. Effect of a nonzero temperature on quantum critical points in itinerant\nfermion systems. Phys. Rev. B, 48(10):7183–7195, 1993.\n24. A. J. Millis, A. J. Schofield, G. G. Lonzarich, and S. A. Grigera. Metamagnetic\nquantum criticality in metals. cond-mat\/0109440. To appear in Phys. Rev. Lett.,\n2002.\n25. A. J. Millis, A. J. Schofield, G. G. Lonzarich, and S. A. Grigera. Theory of meta-\nmagnetic quantum criticality in metals. To be published.\n26. John W. Negele and Henri Orland. Quantum many-particle systems. Addison-\nWesley Publishing Company, Inc., 1987.\n27. R. S. Perry, L. M. Galvin, S. A. Grigera, L. Capogna, A. J. Schofield, A. P. Macken-\nzie, M. Chiao, S. R. Julian, S. I. Ikeda, S. Nakatsuji, Y. Maeno, and C. Pfleiderer.\nMetamagnetism and critical fluctuations in high quality single crystals of the bi-\nlayer ruthenate Sr3Ru2O7. Phys. Rev. Lett., 86(12):2661–2664, 2001.\n28. T. M. Rice. Superconductivity: An analogue of superfluid 3He. Nature, 396:627–\n629, 1998.\n29. A. Rosch. Interplay of disorder and spin fluctuations in the resistivity near a\nquantum critical point. Phys. Rev. Lett., 82(21):4280–4283, 1999.\n30. Hiroyuki Satoh and Fusayoshi J. Ohkawa. Theory of the metamagnetic crossover\nin CeRu2Si2. Phys. Rev. B, 63:184401, 2001.\n20 A. J. Schofield et al.\n31. A. Schro¨der, G. Aeppli, R. Coldea, M. Adams, O. Stockert, H. v. Lo¨hneysen,\nE. Bucher, R. Ramazashvili, and P. Coleman. Onset of antiferromagnetism in\nheavy-fermion metals. Nature, 407(6802):351–355, 2000.\n32. D. J. Singh and I. I. Mazin. Electronic structure and fermiology of Sr3Ru2O7.\nPhys. Rev. B, 63:165101, 2001.\n33. Edmund C. Stoner. Ferromagnetism. Rep. Prog. Phys., 11:43–112, 1947.\n34. M. B. Suvasini, G. Y. Guo, W. M. Temmerman, and G. A. Gehring. Metamagnetic\ntransition and magnetic properties of UPt3. Phys. Rev. Lett., 71(18):2983–2986,\n1993.\n35. C Thessieu, C Pfleiderer, A N Stepanov, and J Flouquet. Field dependence of the\nmagnetic quantum phase transition in MnSi. J. Phys.:condens. matt., 9(31):6677–\n6687, 1997.\n36. Hilbert von Lo¨hneysen. Non-fermi-liquid behaviour in the heavy-fermion system\nCeCu6−xAux. J. Phys.:condens. matt., 8(48):9689–9706, 1996.\n37. H. Yamada. Metamagnetic transition and susceptibility maximum in an itinerant-\nelectron system. Phys. Rev. B, 47(17):11211–11219, 1993.\n38. H. Yamada and K. Terao. Itinerant-electron metamagnetism of MnSi at high\npressure. Phys. Rev. B, 59(14):9342–9347, 1999.\n"}