{"doi":"10.1016\/j.jhydrol.2005.02.018","coreId":"138265","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1928","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1928","10.1016\/j.jhydrol.2005.02.018"],"title":"Development and application of a soil classification-based conceptual catchment-\nscale hydrological model","authors":["Marechal, David","Holman, Ian P."],"enrichments":{"references":[{"id":38073829,"title":"A catchment-scale model for pesticides in surface water.","authors":[],"date":"1996","doi":null,"raw":"Hollis, J.M., Brown, C.D., 1996. A catchment-scale model for pesticides in surface water. In Del Re, A.A.M., Capri, E., Evans, S.P., Trevisan, M.(eds). The environmental fate of Xenobiotics. Proceeding of the X Symposium Pesticide Chemistry, Piacenze, Italy.","cites":null},{"id":38073828,"title":"A method of computing urban runoff.","authors":[],"date":"1944","doi":null,"raw":"Hicks, W.I., 1944. A method of computing urban runoff. Trans. ASAE. 109, 1217-1253.","cites":null},{"id":38073834,"title":"A parsimonious approach to stochastic multisite modelling and disaggregation of daily rainfall.","authors":[],"date":"2003","doi":"10.1016\/s0022-1694(02)00356-6","raw":"Kottegoda, N.T., Natale, L., Raiteri, E., 2003. A parsimonious approach to stochastic multisite modelling and disaggregation of daily rainfall. J. Hydrol. 274, 47-61.","cites":null},{"id":38073852,"title":"A River network based hydrological model for predicting natural and influenced flow statistics at ungauged sites: Micro LOW FLOWS.","authors":[],"date":"2000","doi":"10.1016\/s0048-9697(00)00391-0","raw":"Young, A.R., Gustard, A., Bullock, A., Sekulin, A.E., Croker, K.M., 2000. A River network based hydrological model for predicting natural and influenced flow statistics at ungauged sites: Micro LOW FLOWS. The Science of the Total Environment, 251\/252, 293-304.","cites":null},{"id":38073833,"title":"A simple empirical model for root water uptake.","authors":[],"date":"1989","doi":"10.1016\/0022-1694(89)90050-4","raw":"Jarvis, N.J., 1989. A simple empirical model for root water uptake. J. Hydrol. 107, 57-72.","cites":null},{"id":38073838,"title":"A soil hydrology-based catchment water resources model.","authors":[],"date":"2002","doi":null,"raw":"Maréchal, D., Homan I. P., 2002. A soil hydrology-based catchment water resources model. Proceedings International Conference on Integrated Assessment and Decision Support (iEMSs2002). Lugano, Italy, June 24-27; Volume 1, 452-457.","cites":null},{"id":38073788,"title":"An introduction to the European Hydrological System - Système Hydrologique Européen, &quot;SHE&quot;, 1: history and philosophy of a physically-based distributed modelling system.","authors":[],"date":"1986","doi":"10.1016\/0022-1694(86)90114-9","raw":"Abbott, M.B., Bathurst J.C., Cunge J.A., O'Connell P.E., Rasmussen J., 1986. An introduction to the European Hydrological System - Système Hydrologique Européen, &quot;SHE&quot;, 1: history and philosophy of a physically-based distributed modelling system. J. Hydrol. 87, 45-59.","cites":null},{"id":38073837,"title":"Application of the conceptual rainfall-runoff model CRASH in the Spanish mountainous catchment of the Aragón river. Unpubl. MSc thesis,","authors":[],"date":"2004","doi":null,"raw":"Llanos Rodríguez, J., 2004. Application of the conceptual rainfall-runoff model CRASH in the Spanish mountainous catchment of the Aragón river. Unpubl. MSc thesis, Cranfield University, UK.","cites":null},{"id":38073826,"title":"Blueprint for a physically-based, digitally simulated, hydrologic response model.","authors":[],"date":"1969","doi":"10.1016\/0022-1694(69)90020-1","raw":"Freeze, R.A., Harlan R.L. 1969. Blueprint for a physically-based, digitally simulated, hydrologic response model. J. Hydrol. 9, 237-258.22 Griensven, A.V., Bauwens, W., 2001. Integral water quality modelling of catchments. Water Science and Technology, 43(7), 321-328.","cites":null},{"id":38073815,"title":"Calculation of sorptivity from constant-rate rainfall measurement.","authors":[],"date":"1983","doi":"10.2136\/sssaj1983.03615995004700040003x","raw":"Chong, S.K., 1983. Calculation of sorptivity from constant-rate rainfall measurement. Soil Sci. Soc. Am. J. 47, 627-630.","cites":null},{"id":38073808,"title":"Changing ideas in hydrology - the case of physically-based models.","authors":[],"date":"1989","doi":"10.1016\/0022-1694(89)90101-7","raw":"Beven, K., 1989. Changing ideas in hydrology - the case of physically-based models. J. Hydrol. 105, 157-172.","cites":null},{"id":38073817,"title":"Commission of the European Community,","authors":[],"date":"1985","doi":"10.1177\/095892879200200207","raw":"Commission of the European Community, 1985: Soil Map of the European Communities 1:1,000,000. CEC-DGVI, Luxembourg, 124pp., 7 maps.","cites":null},{"id":38073806,"title":"Continental scale simulation of the hydrologic balance.","authors":[],"date":"1999","doi":"10.1111\/j.1752-1688.1999.tb04192.x","raw":"Arnold, J.G., Srinivasan, R., Muttiah, R.S., Allen, P.M., 1999. Continental scale simulation of the hydrologic balance. J. Amer. Water Res. Assoc., 35(5), 1037-1051 Beldring, S., Engeland, K., Roald, L.A., Sælthun, N.R., Voksø, A., 2003. Estimation of parameters in a distributed precipitation-runoff model for Norway. Hydrol. and Earth Syst. Sci. 7(3): 304-316.","cites":null},{"id":38073800,"title":"Crop evapotranspiration: guidelines for computing crop water requirements. FAO Irrigation and Drainage Paper 56. Food and Agriculture Organization of the United Nations.","authors":[],"date":"1998","doi":null,"raw":"Allen, R.G., Pereira L.S., Raes D., Smith M., 1998. Crop evapotranspiration: guidelines for computing crop water requirements. FAO Irrigation and Drainage Paper 56. Food and Agriculture Organization of the United Nations. Rome.","cites":null},{"id":38073811,"title":"Depth development of roots with time: An empirical description.","authors":[],"date":"1986","doi":"10.13031\/2013.30125","raw":"Borg H., Grimes, D.W., 1986. Depth development of roots with time: An empirical description. Trans. ASAE.; 29, 194-197.","cites":null},{"id":38073836,"title":"Efficient subspace probabilistic parameter optimization for catchment models.","authors":[],"date":"1997","doi":"10.1029\/96wr02671","raw":"Kuczera, G., 1997. Efficient subspace probabilistic parameter optimization for catchment models. Wat.","cites":null},{"id":38073810,"title":"Equifinality, data assimilation, and uncertainty estimation in mechanistic modelling of complex environmental systems using the GLUE methodology.","authors":[],"date":"2001","doi":"10.1016\/s0022-1694(01)00421-8","raw":"Beven K, Freer J., 2001. Equifinality, data assimilation, and uncertainty estimation in mechanistic modelling of complex environmental systems using the GLUE methodology. J. Hydrol. 249 (1-4): 11-2921 Boorman, D.B., Hollis J.M., Lilly A., 1995. Hydrology of soil types: a hydrologically-based classification of the soils of the United Kingdom. Institute of Hydrology report no. 126.","cites":null},{"id":38073843,"title":"Flood estimation handbook, 1: Overview. Institute of Hydrology,","authors":[],"date":"1999","doi":null,"raw":"Reed D., 1999, Flood estimation handbook, 1: Overview. Institute of Hydrology, Wallingford, Oxford.","cites":null},{"id":38073841,"title":"Flood studies report,","authors":[],"date":"1975","doi":null,"raw":"Natural Environment Research Council. 1975. Flood studies report, NERC, London, 5 vols..","cites":null},{"id":38073853,"title":"Fuzzy multi-objective function for rainfall-runoff model calibration.","authors":[],"date":"2000","doi":"10.1016\/s0022-1694(00)00317-6","raw":"Yu, P.S., Yang T.C., 2000. Fuzzy multi-objective function for rainfall-runoff model calibration. J. Hydrol. 238, 1-14.","cites":null},{"id":38073832,"title":"How much complexity is warranted in a rainfall-runoff model.","authors":[],"date":"1993","doi":"10.1029\/93wr00877","raw":"Jakeman, A. Hornberger G., 1993. How much complexity is warranted in a rainfall-runoff model. Wat.","cites":null},{"id":38073835,"title":"Integrated modelling of hydrological processes and nutrient dynamics at the river basin scale.","authors":[],"date":"2000","doi":"10.1007\/978-94-017-2163-9_15","raw":"Krysanova, V., Becker, A., 2000. Integrated modelling of hydrological processes and nutrient dynamics at the river basin scale. Hydrobiologia, 410, 131-138.","cites":null},{"id":38073824,"title":"Investigating the relationship between a soils classification and the spatial parameters of a conceptual catchment-scale hydrological model.","authors":[],"date":"2001","doi":"10.1016\/s0022-1694(01)00462-0","raw":"Dunn, S.M., Lilly A., 2001. Investigating the relationship between a soils classification and the spatial parameters of a conceptual catchment-scale hydrological model. J. Hydrol.; 252, 157-173.","cites":null},{"id":38073827,"title":"Low flow estimation in the United Kingdom.","authors":[],"date":"1992","doi":"10.1002\/esp.3290190707","raw":"Gustard, A., Bullock, A., Dixon, J.M., 1992. Low flow estimation in the United Kingdom. Institute of Hydrology report No. 108, Wallingford, UK.","cites":null},{"id":38073850,"title":"Monthly water balance of ungauged catchments obtained by geographical regionalization.","authors":[],"date":"1995","doi":"10.1016\/0022-1694(95)02681-e","raw":"Vandewiele, G.L., Elias, A., 1995. Monthly water balance of ungauged catchments obtained by geographical regionalization. J. Hydrol. 170, 277-291.","cites":null},{"id":38073848,"title":"National engineering handbook. Section 4- Hydrology.","authors":[],"date":"1985","doi":null,"raw":"Soil Conservation Service, 1985. National engineering handbook. Section 4- Hydrology. Washington, DC.","cites":null},{"id":38073846,"title":"On the dialog between experimentalist and modeler in catchment hydrology: Use of soft data for multicriteria model calibration.","authors":[],"date":"2002","doi":"10.1029\/2001wr000978","raw":"Seibert, J., McDonnell, J.J., 2002. On the dialog between experimentalist and modeler in catchment hydrology: Use of soft data for multicriteria model calibration. Water Resources Research. 38(11): 1241.","cites":null},{"id":38073840,"title":"On the need for catchment classification.","authors":[],"date":"2004","doi":"10.1016\/j.jhydrol.2004.09.003","raw":"McDonnel, J.J., Woods, R., 2004. On the need for catchment classification. J. Hydrol. 299, 2-3.","cites":null},{"id":38073822,"title":"On the subject of flood propagation method (Muskingum method).","authors":[],"date":"1969","doi":"10.1680\/iicep.1981.1817","raw":"Cunge, J.A., 1969. On the subject of flood propagation method (Muskingum method). J. of Hydraul. Res., IAHR. 7(2), 205-230.","cites":null},{"id":38073845,"title":"Regionalisation of parameters of a conceptual rainfall-runoff model.","authors":[],"date":"1999","doi":"10.1016\/s0168-1923(99)00105-7","raw":"Seibert, J., 1999. Regionalisation of parameters of a conceptual rainfall-runoff model. Agric. For. Meteorol. 98-99, 279-293.","cites":null},{"id":38073844,"title":"Relationships between dynamic response characteristics and physical descriptors of catchments in England and","authors":[],"date":"1998","doi":"10.1016\/s0022-1694(98)00163-2","raw":"Sefton, C.E.M., Howarth S.M., 1998. Relationships between dynamic response characteristics and physical descriptors of catchments in England and Wales. J. Hydrol. 211, 1-16.","cites":null},{"id":38073813,"title":"Scale effect on runoff from experimental plots to catchments in agricultural areas in Normandy.","authors":[],"date":"2004","doi":"10.1016\/j.jhydrol.2004.02.017","raw":"Cerdan, O., Le Bissonnais, Y., Govers, G., Lecomte, V., van Oost, K., Couturier, A., King, C., Dubreuil, N., 2004. Scale effect on runoff from experimental plots to catchments in agricultural areas in Normandy. J. Hydrol. 299, 4-14.","cites":null},{"id":38073847,"title":"Shaping an exciting future for the hydrological sciences.","authors":[],"date":"2003","doi":"10.1623\/hysj.48.6.857.51421","raw":"Sivapalan, M., Takeuchi, K., Franks, S.W., Gupta, V.K., Karambiri, H., Lakshmi, V., Liang, X.,24 McDonnell, J.J., Mendiondo, E.M., O'Connell, P.E., Oki, T., Pomeroy, J.W., Schertzer, D., Uhlenbrook, S., Zehe, E., 2003. IAHS decade on Predictions in Ungauged Basins (PUB), 2003-2012: Shaping an exciting future for the hydrological sciences. Hydrological Sciences Journal-Journal des Sciences Hydrologiques. 48 (6): 857-880.","cites":null},{"id":38073820,"title":"Spatial and temporal variability of soil surface roughness and the application in hydrological and soil erosion modelling.","authors":[],"date":"1996","doi":"10.1002\/(sici)1099-1085(199608)10:8<1035::aid-hyp409>3.0.co;2-#","raw":"Cremers, N.H.D.T., van Dijk P.M., de Roo A.P.J., Verzandvoort M.A., 1996. Spatial and temporal variability of soil surface roughness and the application in hydrological and soil erosion modelling.","cites":null},{"id":38073819,"title":"Stochastic point process modelling of rainfall. I Regionalisation and disaggregation.","authors":[],"date":"1996","doi":"10.1016\/s0022-1694(96)80005-9","raw":"Cowperwait, P.S.P., O’Connell P.E., Metcalfe, A.V., Mawdsley, J.A., 1996. Stochastic point process modelling of rainfall. I Regionalisation and disaggregation. J. Hydrol. 175, 47-65.","cites":null},{"id":38073825,"title":"SWBCM: a soil water balance capacity model for environmental applications in the UK.","authors":[],"date":"1999","doi":"10.1016\/s0304-3800(99)00068-x","raw":"Evans, S.P., Mayr T.R., Hollis J.M., Brown C.D., 1999. SWBCM: a soil water balance capacity model for environmental applications in the UK. Ecol. Model. 121, 17-49.","cites":null},{"id":38073849,"title":"The ARNO rainfall-runoff model.","authors":[],"date":"1996","doi":"10.1016\/s0022-1694(96)80016-3","raw":"Todini, E., 1996. The ARNO rainfall-runoff model. J. Hydrol. 175, 339-382.","cites":null},{"id":38073839,"title":"The estimation of flood response times from the digital catchment data.","authors":[],"date":"2000","doi":"10.1111\/j.1747-6593.2000.tb00270.x","raw":"Marshall, D.C.W., 2000. The estimation of flood response times from the digital catchment data. J. C. Instn. Wat. & Envir. Mangt.. 14(5), 335-340.","cites":null},{"id":38073831,"title":"The FSR rainfall-runoff model parameter estimation equations updated. Flood studies supplementary report no.","authors":[],"date":"1985","doi":null,"raw":"Institute of Hydrology, 1985. The FSR rainfall-runoff model parameter estimation equations updated. Flood studies supplementary report no. 16. Inst. of Hydrol., Wallingford..","cites":null},{"id":38073842,"title":"The theory of infiltration: 1. the infiltration equation and its solution.","authors":[],"date":"1957","doi":"10.1097\/00010694-195705000-00002","raw":"Philip, J.R., 1957. The theory of infiltration: 1. the infiltration equation and its solution. Soil Sci. 83, 345-357.","cites":null},{"id":38073854,"title":"Tillage and rainfall effects on random roughness: a review.","authors":[],"date":"1987","doi":"10.1016\/0167-1987(87)90047-x","raw":"Zobeck, T. M., Onstad C. A., 1987. Tillage and rainfall effects on random roughness: a review. Soil & Til. Res. 9, 1-20.25","cites":null},{"id":38073830,"title":"Upscaling, Predictive Models and Catchment Water Quality: the CAMSCALE project.","authors":[],"date":"2001","doi":null,"raw":"Holman, I.P., Hollis, J.M. (eds.), 2001. Upscaling, Predictive Models and Catchment Water Quality: the CAMSCALE project. Final Report of EU Fourth Framework Project No. ENV4-CT97-0439 Holman, I.P., Hollis, J.M., Bramley, M.E., Thompson, T.R.E., 2003. The contribution of soil structural degradation to catchment flooding: a preliminary investigation of the 2000 floods in England and Wales. Hydrology and Earth System Sciences, 7(5), 754-765.","cites":null},{"id":38073851,"title":"Water balance modelling of the River Meca at Huelva, Spain. Unpubl. MSc thesis,","authors":[],"date":"2004","doi":null,"raw":"Verdú Vázquez, J., 2004. Water balance modelling of the River Meca at Huelva, Spain. Unpubl. MSc thesis, Cranfield University, UK.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2005-10-01T00:00:00Z","abstract":"A conceptual, continuous, daily, semi distributed catchment-scale rainfall-\nrunoff model that has the potential to be ultimately used in ungauged catchments\nis described. The Catchment Resources and Soil Hydrology (CRASH) model is\ndeveloped from the basis that the transformation of rainfall into simulated\nriver discharge can be parameterised using pre-existing national datasets of\nsoil, land use and weather; and that the spatial variability in soil properties\nand land use are important to the hydrological response of a catchment and\nshould be incorporated into the catchment representation. Both infiltration-\nexcess and saturation-excess runoff mechanisms are simulated, with water\nmovement through each soil layer simulated using a capacitance approach limited\naccording to layer physical properties. The hydrological linkage between the\nresponse unit and catchment is parameterised using the existing national\nHydrology of Soil Types (HOST) classification. The HOST classification groups\nall UK soil types into one of 29 hydrological classes for which nationally\ncalibrated values of Base Flow Index and Standard Percentage Runoff are\nprovided. CRASH has been calibrated and validated for three catchments in\nEngland with contrasting soil characteristics and meteorological conditions. The\nmodel was successful at simulating time series and flow duration curves in all\ncatchments during the calibration and validation periods. The next development\nstage will be to test CRASH for a large number of catchments covering a wider\nrange of soils, land uses and meteorological conditions, in order to derive a\nset of regionalised model parameters based upon the HOST classification. The\nsuccessful cross-scale linkage between water movement through the response unit\nand the catchment-scale hydrological response using the HOST classification,\nwhich incorporates the scale effects between plot and catchment, suggests that\nsuch national soil hydrological classifications may provide a sound and\nconsistent framework for hydrological modelling in both gauged and ungauged\ncatchments which should be extended to other regions","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138265.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.jhydrol.2005.02.018","pdfHashValue":"74d1d3603059df6a08ed3a07b2ef45a6f1d900e7","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1928<\/identifier><datestamp>2014-02-14T11:03:42Z<\/datestamp><setSpec>hdl_1826_8<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Development and application of a soil classification-based conceptual catchment-\nscale hydrological model<\/dc:title><dc:creator>Marechal, David<\/dc:creator><dc:creator>Holman, Ian P.<\/dc:creator><dc:subject>Rainfall-runoff model<\/dc:subject><dc:subject>Conceptual model<\/dc:subject><dc:subject>Classification<\/dc:subject><dc:subject>Ungauged catchment<\/dc:subject><dc:subject>Semi-distributed model<\/dc:subject><dc:subject>Soil hydrology<\/dc:subject><dc:description>A conceptual, continuous, daily, semi distributed catchment-scale rainfall-\nrunoff model that has the potential to be ultimately used in ungauged catchments\nis described. The Catchment Resources and Soil Hydrology (CRASH) model is\ndeveloped from the basis that the transformation of rainfall into simulated\nriver discharge can be parameterised using pre-existing national datasets of\nsoil, land use and weather; and that the spatial variability in soil properties\nand land use are important to the hydrological response of a catchment and\nshould be incorporated into the catchment representation. Both infiltration-\nexcess and saturation-excess runoff mechanisms are simulated, with water\nmovement through each soil layer simulated using a capacitance approach limited\naccording to layer physical properties. The hydrological linkage between the\nresponse unit and catchment is parameterised using the existing national\nHydrology of Soil Types (HOST) classification. The HOST classification groups\nall UK soil types into one of 29 hydrological classes for which nationally\ncalibrated values of Base Flow Index and Standard Percentage Runoff are\nprovided. CRASH has been calibrated and validated for three catchments in\nEngland with contrasting soil characteristics and meteorological conditions. The\nmodel was successful at simulating time series and flow duration curves in all\ncatchments during the calibration and validation periods. The next development\nstage will be to test CRASH for a large number of catchments covering a wider\nrange of soils, land uses and meteorological conditions, in order to derive a\nset of regionalised model parameters based upon the HOST classification. The\nsuccessful cross-scale linkage between water movement through the response unit\nand the catchment-scale hydrological response using the HOST classification,\nwhich incorporates the scale effects between plot and catchment, suggests that\nsuch national soil hydrological classifications may provide a sound and\nconsistent framework for hydrological modelling in both gauged and ungauged\ncatchments which should be extended to other regions.<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2012-05-31T23:07:46Z<\/dc:date><dc:date>2012-05-31T23:07:46Z<\/dc:date><dc:date>2005-10-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>D. Marechal and I.P. Holman, Development and application of a soil\nclassification-based conceptual catchment-scale hydrological model, Journal of\nHydrology, Vol 312, Iss 1-4, 10 Oct 2005, Pages 277-293<\/dc:identifier><dc:identifier>0022-1694<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.jhydrol.2005.02.018<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/1928<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0022-1694","issn:0022-1694"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":["Rainfall-runoff model","Conceptual model","Classification","Ungauged catchment","Semi-distributed model","Soil hydrology"],"subject":["Article"],"fullText":"1Journal of Hydrology, 2005, v312, 277–293. doi:10.1016\/j.jhydrol.2005.02.018\nDevelopment and application of a soil classification-based\nconceptual catchment-scale hydrological model\nD. Maréchal1 and I.P. Holman\nInstitute of Water and Environment, Cranfield University, Silsoe, Bedford, MK45 4DT, UK\n Corresponding author, Tel.: +44-1525-863252 Fax: +44-1525-863344 E-mail address :\ni.holman@cranfield.ac.uk\n1 Now at EQECAT, 16 Rue Drouot 75009 Paris, France\nAbstract\nA conceptual, continuous, daily, semi distributed catchment-scale rainfall-runoff model that has the\npotential to be ultimately used in ungauged catchments is described. The Catchment Resources and\nSoil Hydrology (CRASH) model is developed from the basis that the transformation of rainfall into\nsimulated river discharge can be parameterised using pre-existing national datasets of soil, land use and\nweather; and that the spatial variability in soil properties and landuse are important to the hydrological\nresponse of a catchment and should be incorporated into the catchment representation. Both\ninfiltration-excess and saturation-excess runoff mechanisms are simulated, with water movement\nthrough each soil layer simulated using a capacitance approach limited according to layer physical\nproperties. The hydrological linkage between the response unit and catchment is parameterised using\nthe existing national Hydrology of Soil Types (HOST) classification. The HOST classification groups\nall UK soil types into one of 29 hydrological classes for which nationally calibrated values of Base\nFlow Index and Standard Percentage Runoff are provided. CRASH has been calibrated and validated\nfor three catchments in England with contrasting soil characteristics and meteorological conditions.\nThe model was successful at simulating time series and flow duration curves in all catchments during\nthe calibration and validation periods. The next development stage will be to test CRASH for a large\n2number of catchments covering a wider range of soils, land uses and meteorological conditions, in\norder to derive a set of regionalised model parameters based upon the HOST classification. The\nsuccessful cross-scale linkage between water movement through the response unit and the catchment-\nscale hydrological response using the HOST classification, which incorporates the scale effects\nbetween plot and catchment, suggests that such national soil hydrological classifications may provide a\nsound and consistent framework for hydrological modelling in both gauged and ungauged catchments\nwhich should be extended to other regions.\nKeywords\nRainfall-runoff model, conceptual model, classification, ungauged catchment, semi-distributed model,\nsoil hydrology\n31. Introduction\nRainfall–runoff models can be used to investigate various hydrological issues relevant to\nenvironmental managers and decision–makers. Their use can, however, be restricted by the availability\nand quality of input and parameterisation data. One approach to tackle the challenge of modelling river\nflows in ungauged catchments appeared with the blue-print for a physically-based, distributed\ncatchment model by Freeze and Harlan (1969). The Système Hydrologique Européen (SHE) system\nwas developed following such a blue-print (Abbott et al. 1986) and was presented in opposition to\nlumped parameter models that “depend essentially on the availability of sufficiently long\nmeteorological and hydrological records for their calibration“ (Abbott et al.1986). However the use of\nphysically-based, distributed models has since been questioned because of the actual significance of the\nparameters and the great amount of physical characteristics they require (Beven 1989).\nIt is generally agreed that the level of complexity of physically-based models is excessive for many\npractical problems. Jakeman and Hornberger (1993) stated that a simpler structure based on a slow-\nflow component and a quick-flow component is sufficient for many purposes. Such conceptual models\nuse simplified representations of the component processes which they do not try to fully represent with\nphysically-based equations, but are generally optimised using observed streamflow data.\nHowever, because they incorporate many fewer parameters, approaches have been developed to apply\nconceptual models in ungauged catchments. The most widely used method relates the model\nparameters to physical descriptors of the catchments (e.g. Sefton and Howarth, 1998; Seibert, 1999).\nThe procedure of calibration has two stages. Firstly the parameters values are determined for a number\nof gauged catchments. Then a relationship between the model parameters and physical descriptors of\nthose gauged catchments is derived. This relationship can use simple (e.g. multivariate regression,\nSefton and Horwarth, 1998) or more sophisticated techniques (such as kriging or clustering,\nVandewiele and Elias, 1995) to find similarities among the catchments.\nAn alternative approach to regionalisation is to assume that areas of a catchment with the same\nphysical characteristics have similar hydrological response. Each homogeneous unit is calibrated to\nbuild a library of parameters for all units that can then be used in ungauged catchments. This type of\napproach is suited to semi-distributed models that use the principle of hydrological response units or to\n4fully distributed models. Dunn and Lilly (2001) managed to determine parameters of the distributed\nDIY model according to a soil hydrological classification for two catchments in Scotland but failed to\nadequately calibrate the fast response. Beldring et al. (2003) calibrated a distributed version of the\nHBV model in 141 catchments in Norway and estimated the model parameter values for 5 land use\nclasses. They successfully used this library of parameter values in 43 independent catchments.\nUnlike many other studies where the objective has been to relate the parameters of existing models to\ncatchment descriptors, the objective of this study is to tackle the problem in reverse. A conceptual,\ncontinuous, daily, catchment-scale rainfall-runoff model has been developed to solely utilise nationally\navailable data with the ultimate purpose of being applied in ungauged catchments throughout the\nUnited Kingdom using the latter homogenous unit regionalisation approach. This paper presents the\ndevelopment and validation of the Catchment Resources and Soil Hydrology (CRASH) model, which\nhas been based on two underpinning principals:\n Firstly, that the transformation of rainfall into simulated river discharge can be parameterised\nusing pre-existing nationally available datasets of soil, land use and weather; and\n Secondly, that the spatial variability in soil properties and landuse is important to the\nhydrological response of a catchment and should be incorporated into the catchment\nrepresentation.\n2. Model description\nThe Hydrology of Soil Type (HOST) system (Boorman et al., 1995) has been used to classify the soils\nof each catchment according to their hydrological behaviour. HOST is a conceptual representation of\nthe hydrological processes in the soil zone. All soil types (soil series) in the United Kingdom have been\ngrouped into one of the 29 hydrological response models (or HOST classes) based on soil attributes\nand the dominant pathways of water movement through the soil and substrate. Allocation to a HOST\nclass is by a hierarchical classification:\n1. Soils are first allocated to one of three physical settings:\n5 soils which overlie a permeable substrate, in which a ground water table usually exists at\na depth greater than 2 m;\n soils which overlie a permeable substrate, but there is a shallow water table generally\nwithin 2 m, either in the soil or substrate;\n there is no significant groundwater or aquifer but usually a (shallow) impermeable\nsubstrate impedes vertical movement of water.\n2. Each physical setting is subdivided into response models (of which there are 11 in total),\nwhich describe flow mechanisms, and which identify groups of soils that are expected to\nrespond in the same way to rainfall.\n3. Finally, there are sub-divisions of some response models according to the rate of response and\nthe water storage within the soil profile.\nThe classification uses data on soil hydrogeology (parent material), depth to aquifer or ground water,\npresence of a peaty topsoil, depth to slowly permeable layer, depth to gleyed (or seasonally\nwaterlogged) layer, and integrated air capacity (equivalent to drainable porosity). Multiple regressions\nwere performed for many catchment throughout the United Kingdom, between the proportion of each\nhydrological response model in each catchment and the catchment’s Base Flow Index (BFI) and\nStandard Percentage Runoff (SPR) based on river gauging data, to produce calibrated values of Base\nFlow Index (BFI) and Standard Percentage Runoff (SPR) for each HOST class. BFI is the long-term\naverage proportion of flow that comes from stored sources and SPR is the percentage runoff derived\nfrom event data, adjusted to standard rainfall and catchment moisture conditions (Boorman et al.,\n1995).\nThe catchment in CRASH is composed of four types of objects: the response units (or primary object,\nwhere the model is applied), and the sub-catchments, rivers and reservoirs which are routing objects\n(Figure 1). The response units are defined within each sub-catchments as cells with homogeneous\nhydrological behaviour (Figure 1b) based upon a unique combination of soil type and land use. Similar\nresponse units in a sub-catchment are grouped together for computational efficiency.\n6The model requires several types of input data: the spatial distribution of soil and land use data for the\ndefinition and parameterization of the response units; daily evapotranspiration and hourly precipitation\ndata; catchment physical properties or descriptors for the parameterisation of the unit hydrograph at the\nsub-catchment scale; and river and reservoir characteristics for the flow routing.\n4.1. Response unit\nResults from response units of similar soil hydrological behaviour (or HOST class) are grouped\ntogether so that the unknown parameters are calibrated for each HOST class. The following operations\nare applied to the response unit:\n4.1.1. Soil water balance model\nA soil water balance using existing soil series data (horizon thickness, water contents at a range of\nsuctions, saturated hydraulic conductivity) computes the movement of water through each soil horizon\nto the groundwater store, and allows temporary perched water tables within the soil profile.\nThe variation in mass balance of layer i is expressed as:\n \ni\niii1i\ni z*Area\nTIFAETDD\n\n   (1)\nwhere i is the volumetric water content (m3\/m3), D the drainage (m3\/s), AET the actual crop\nevapotranspiration from layer i (m3\/s), IF the interflow (m3\/s), T the time step (1 day = 86400s),\nArea the area of the HRU (m2) and iz the thickness of layer i (m).\nFor the top and bottom horizons, Equation 1 becomes respectively:\n \ni\n111\n1 z*Area\nTIFAETDI\n\n  (1.1)\n \nn\nnnn\nn zArea\nTIFAETD\n\n \n*\nRe1 (1.2)\nwhere I is the infiltration (m3\/s), Re the recharge to the groundwater store (m3\/s) and n the index of the\nbottom layer.\n7Drainage and recharge\nDrainage occurs only from horizons where the water content is above field capacity (defined at 5 kPa,\nEvans et al., 1999). In that case, the water movement from the layer i to layer i+1 is derived using:\n)z*Area*\nT\n,z*Area*\nT\n,Area*K,Area*K(MinD i\n1i\nSat\n1i\ni\nFC\niisat\n1i\nsat\nii \n\n\n\n \n\n\n(2)\nwhere Ksat is the saturated hydraulic conductivity (m\/s), sat and FC are the volumetric water\ncontent at saturation and at field capacity (m3\/m3), respectively.\nIn a similar way, recharge to the groundwater store (3) occurs if the water content of the bottom\nhorizon is above field capacity:\n)z*Area*\nT\n,Area*LBK,Area*K(MinRe i\nFC\nnnSat\nn \n  (3)\nLBK is the lower boundary hydraulic conductivity (m\/s). It parameterises the parent material and values\nwere proposed for each HOST class by Evans et al. (1999).\n4.1.2. River flow\nThe simulated river flow is composed of the contributions of interflow from the soil water store, base\nflow from the groundwater store and surface runoff (infiltration excess and saturation excess) from\neach response unit.\nInterflow and base flow\nThe interflow (IF in m3\/s) and base flow (BF in m3\/s) are proportional to the water contents within each\nhorizon and the groundwater store, respectively:\n\ni\niIFIF (4)\nwhere:\n8  0.0;IFK*z*Area*MaxIF iFCiii   (4.1)\n2*GWSCBFKBF  (5)\nwhere IFK and BFK are the interflow and base flow coefficients in s-1 and m-3s-1, respectively. GWSC\nis the groundwater store content (m3). IFK represents the lateral hydraulic conductivity of the soil.\nIFK is calibrated due to the difference of scale between the catchment scale application of this\nparameter in CRASH and the plot scale lateral hydraulic conductivities measurements available for\neach soil type. The parameter BFK is also derived by calibration.\nThe groundwater store content is initialised in accordance with Hollis and Brown (1996):\n1000\n***1.0 41700\nArea\nSAARBFIGWSC  (6)\nwhere SAAR4170 is the standard average annual rainfall for the period 1941-70 (mm) and BFI the\ndimensionless base flow index.\nThe groundwater store content fluctuates according to the variations in recharge Re and discharge (base\nflow- BF in m3\/s):\n BFRe*TGWSCGWSC 1tt    (7)\nSurface runoff\nSurface runoff Ru (m3\/s) from each soil type can be either saturation excess flow (if the upper horizon\nis saturated) or Hortonian flow, if the rainfall intensity exceeds the saturated hydraulic conductivity of\nthe upper horizon. The different cases are summarised below:\nCase 1 saturation-excess overland flow sat11   :\n1DI  (8)\nIArea*RRu  (9)\nCase2 sat11   :\nCase2.1: SatK1R \n9Area*RI  (10)\n0Ru  (11)\nCase2.2: Hortonian overland flow SatK1R \nIArea*RRu  (12)\nwhere R is the hourly rainfall in m\/s.\nFor the calculation of Hortonian flow in Case 2.2, infiltration is computed with the Philip’s equation\n(Philip, 1957), which requires a finer, hourly, resolution of temporal rain data to determine the time\nperiod when the rainfall intensity is greater than the saturated hydraulic conductivity of the topsoil.\nHourly data can be provided from existing datasets or disaggregated from daily data (e.g. Cowperwait\net al., 1996; Kottegoda et al., 2003). Using Philip (1957), the infiltration after ponding Iap (m\n3\/s) for the\none directional Richard’s equation for a homogeneous medium can be expressed as:\n\nj\n2\nj\napjap T*AreaI  (13)\nwhere Tap is the time after ponding (s) and j an index starting from 1.  j are coefficients where  1 is\nthe sorptivity S and  2 - noted A in the rest of the text – is related to the saturated hydraulic\nconductivity of the soil.\nIf equation (13) is limited to its first two terms (Chong, 1983), the total infiltration after time T (s)\nbecomes:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nR\nA\nR\nA4\nS\nT\nR\nA\nR\nA4\nS\nTSTTAT*R*AreaT*I\n2\n2\np2\n2\npp\n(14)\nwith time to ponding Tp (s) (Kutilek, 1980):\n2\n2\n2\n12\n2\n1\n\n\n\n\n \n\n\nR\nA\nR\nR\nA\nSTp (15)\n10\nand the sorptivity\nIniSatBS 11   (16)\nwith ini the initial volumetric water content (m3\/m3).\nThe calculation of the parameter B in the equation (16) is achieved in conjunction with the HOST\nclassification. In HOST, the response runoff RRu (m3\/s), defined as the volume of fast flow during a\nperiod of 5*LAG (where LAG is the time delay [d] between the centroid of rainfall and the centroid of\nflow peaks), for a soil at field capacity is expressed as a function of the standard percentage runoff,\nSPR (%) (Boorman et al., 1995):\nArea*R*SPRRRu  (17)\nIn CRASH, RRu is the sum of the surface runoff and the interflow. But in the case of a soil profile\ninitially at field capacity, the interflow during a 5*LAG period is exclusively a function of the\ninfiltration and of IFK. Similarly, the surface runoff depends only on the infiltration and on the\nprecipitation. Consequently, the only unknown in equation (17) when replacing the response runoff\nRRu by the interflow and the surface runoff is the infiltration I. It is therefore possible to relate the two\nparameters A and B from equations (14), (15) and (16) and to conserve only one for calibration\n(parameter A). In total the model requires 3 parameters (A, IFK and BFK) to be calibrated for each\nHOST class to represent the runoff, interflow and base flow responses, respectively.\nSurface Depression\nThe early stages of runoff generation will not necessarily lead to increased river flow due to surface\nstorage within depressions in the landscape. The amount of water captured depends mainly on the land\nuse and slope, although it can also be influenced by tillage, vegetation and soil type in agricultural land.\nSeveral modelling studies have presented values of the depression storage for different conditions,\nwhich can be as large as 20 mm, but in most cases are much lower. For example, Hicks (1944)\nsuggested values of 5.1, 3.8 and 2.5 mm for sand, loam and clays soils in urban areas. Zobeck and\nOnstad (1987) reported values of random roughness for agricultural lands after harrowing and rotary\ntillage below 20 mm, which gives a depression storage of less than 3 mm on a zero slope. Cremers et\n11\nal. (1996) listed random roughness for various crops and tillage directions which were, with the\nexception of potatoes and fallow with tillage perpendicular to the slope, below 18 mm. However,\ndespite the above studies there is insufficient nationally-available data (especially land management\ndata) to parameterise depression storage for the full range of soil-crop\/landuse combinations so, as a\nnecessary simplification, the depression storage in CRASH has been set to 4.0 mm. The water filling\nup the depression storage is extracted from the surface runoff component, exclusively, and is available\nfor infiltration in the next time step.\n4.1.3. Actual Evapotranspiration\nActual evapotranspiration is computed according to Allen et al (1998) as the potential\nevapotranspiration PET (m\/s) corrected by a crop coefficient and a water stress coefficient.\nArea*C*C*PETAET sc (18)\nCc is a crop coefficient to relate the transpiration from a crop to that of a reference crop (grass), and\nvaries with crop type and time within the cropping year. Cs is a water stress coefficient which allows\nfor the reduced ability of the crop to extract water at high and low soil moisture contents (Figure 3).\nThe water uptake by roots is calculated following the model of Jarvis (1989) where the soil water\nextracted from each soil horizon SWE (m3\/s) is expressed as:\n\n ii\ni\ni\nP\nz\nAET\nSWE\n\n (19)\nPi and αi are the proportion of root length density within a layer and a reduction factor due to water\nshortage, respectively. They are functions of the mid-point depth of the layer below the soil surface for\nPi and of the water content within the layer for αi.  is the average value of αi.\nFinally, the development of the root zone depth RD (m) is simulated following the empirical equation\nof Borg and Grimes (1986):\n12\n\n\n\n\n\n \n\n\n\n  47.1*03.3sin*5.05.0*max\nDRG\nTFP\nRDRD (20)\nwhere RDmax is the maximum root zone depth (m), TFP the time from planting (d) and DRG the\nduration of root growth (d).\n4.2. Routing Objects\n4.2.1 Sub-catchment\nThere are various methods to transfer the surface runoff and interflow towards the catchment or sub-\ncatchments outlet. The unit hydrograph method has been selected, although the choice of method does\nnot have a major impact on the shape of the hydrograph (Todini, 1996). Several studies have reported\nequations to derive catchment parameters specific to the UK (e.g. NERC, 1975; Institute of Hydrology,\n1985; Marshall, 2000), of which Institute of Hydrology (1985) has been selected for its simplicity. The\nunit hydrograph time-to-peak Ttp is estimated as:\n2.223.054.0\n4170\n33.0 )1(***1085*283)0(   FSRURBANMSLSAARSTtp (21)\nwhere S1085 the 10-85% channel slope (m\/km), MSL the main stream length (km) and URBANFSR the\nurbanisation index.\n4.2.2. River routing\nThe Muskingum-Cunge (Cunge, 1969) technique is used to route the upstream hydrograph through the\nmain channel. This non-linear method requires a representative channel cross section, the main channel\nlength, the Manning roughness coefficient and the channel bed slope.\n4.2.3. Reservoir routing\nThe level pool routing technique developed by Chow et al. (1988) can be activated to account for\nreservoirs in the catchment. The continuity equation in the reservoir is expressed as:\n)L(RArea\n)L(Q)T(In\ndT\ndL  (22)\n13\nwhere L is the reservoir level (m), In is the inflow (m3\/d), Q the reservoir outflow (m3\/s) and RArea the\nreservoir area (m2).\nA third order Runge-Kutta scheme is performed to solve Equation (22) (Chow et al. (1988). The area-\nlevel relationship RArea(L) depends on the topography of the shore. This relationship is assumed to be\nlinear as it only fails in exceptional cases (Reed, 1999).\n5. Case studies\nThree study catchments were selected which represent the three physical settings within the HOST\nclassification. The spatial distribution of soil map units and constituent soil series were taken from the\nnational soil map of England and Wales (Ragg et al., 1984). Figure 4 shows the dominant HOST class\nin each soil map unit, although all soil types (and HOST classes) within each soil map unit are\nsimulated. The distribution of land use classes (aggregate of crops\/land uses) was taken from the\nCentre for Ecology and Hydrology’s Land Cover Map of Great Britain 1990, with official 1988\nagricultural statistics used to define the proportion of each crop in the arable land areas. It was assumed\nthat a crop\/land use was spread uniformly among the soil types within an area composed of a soil unit\nand a land use class.\n5.1. Amesbury catchment\nThe Amesbury catchment, in the south of England, covers an area of 320 km2 with an elevation\nbetween 54 to 303 m above sea level (asl). Average annual precipitation is 735 mm and the annual\naverage river flow at the catchment outlet is 300 mm. The main land use is grassland, with arable crops\nfound in the northern part of the catchment. About two thirds of the catchment is covered by soils of\nHOST class 1, which overlie a permeable substrate (in this case chalk) in which groundwater usually\nexists at a depth of more than 2 m. HOST class 16, in which there is no significant underlying aquifer\nand surface runoff is likely, covers much of the remaining catchment.\n14\n5.2. Gwills catchment\nThe Gwills catchment, in the south west of England, is the smallest (42 km2) and wettest (average\nannual rainfall and river flow of 970 mm and 540 mm, respectively) of the three study catchments.\nElevation ranges from 10 to 217 m asl. Grassland is the main land use with subsidiary areas of arable.\nThe catchment is dominated by soils of HOST class 17, which has similar properties to those presented\nabove for class 16. HOST class 9 belong to the final physical setting, having an aquifer and shallow\nwater table within the first 2 m of the profile\n5.3. Avon catchment\nThe Avon catchment contains a reservoir which receives inflows from an area of 12 km2 of the 100\nkm2 of the entire catchment. Elevation ranges from 30 to 225 m asl. The catchment is mainly arable,\nwith grassland found where the topography is less favourable to agriculture. The annual average\nrainfall and river flow are 650 mm and 180 mm, respectively. Nearly 90 % of the area is characterised\nby soils developed in impermeable clays or mudstones, dominated by HOST classes 23 and 25.\n6. Calibration\nCRASH has been calibrated for the three study areas using Monte Carlo modelling. Monte Carlo\nsampling has been used to generate 5000 parameter sets for which the distributions of the parameters\nwere assumed to be uniform in their range of variation. The best parameter set was selected as the one\ngiving the best fit between observed and simulated flows according to a multi-objective function.\nYu and Yang (2000) demonstrated the advantages of a multi-objective function for the calibration of a\nhydrological model and suggested a fuzzy multi-objective function (FMOF) which accounts for all the\nparts of the hydrograph:\n ii\ni\nMPEmin1FMOF  (23)\n15\nwhere MPEi is the mean absolute percentage error for the ith flow stage (equation 24) and μi(MPEi) is\nthe membership function of the MPE (Figure 5) The flow duration curve is divided into a number of\nstages, at 0, 5, 10, 20, 30, 40, 50, 60, 70, 80, 90 and 100th percentiles.\n%100*\nObs\nSimObs\nN\n1\nMPE\nj j\njj\ni\ni   (24)\nThe calibration periods for the catchments were 1980-1984 (Amesbury) and 1979-1984 (Gwills and\nAvon). Table 1 gives the results for the FMOF and the Nash-Sutcliffe (R2) efficiency index. The\nFMOF gives an indication on the goodness of fit for the stage of the flow duration curve where the\nsimulation is the most different from observations. The optimal value is 0.0 which means that there is\nno difference between the two duration curves and a FMOF of 1.0 means that the mean absolute\npercentage error is 100% in all parts of the flow duration curve. On the other hand, R2 is based on the\ntime series and accounts for the entire hydrograph. It indicates the overall goodness of fit of the\nsimulation. Sefton and Howarth (1998) proposed that R2 be adopted as the criteria to reject the\ncalibration of a model, and suggested a minimum value of 0.5 as the threshold for acceptance. CRASH\nfulfils this requirement and can be considered as sufficiently calibrated.\nThe time series and flow duration curves for the three simulations are compared to observations in\nFigures 6 and 7. The calibrated parameter values for the main HOST classes, which cover 80% or\nmore of each catchment, are given in Table 2. For the two physical settings with permeable substrates\n(aquifers) in which the base flow contribution is high, the base flow parameter are lower for those\nHOST classes with deep (> 2 m) groundwater (classes 1, 2 and 6) compared to shallow (<2 m)\ngroundwater (classes 8 and 9). For the former physical setting, the lowest base flow parameter (and\ntherefore the slowest recession) is for HOST class 1 which is consistent with the low seasonal\nvariability in base flow in chalk catchments in the UK. For the final physical setting in which there is a\nshallow impermeable substrate (classes 16, 17, 23 and 25), there is an increase in the surface runoff\nparameter with increasing soil waterlogging.\n7. Validation\n16\nWhether a theory can or can not be validated has been extensively discussed, but it is now generally\nagreed that a theory, and thus a model, can only be invalidated. The criteria chosen to be able to reject\nthe model and its calibration in one or more of the catchments is the same as that used during the\ncalibration exercise (Nash-Sutcliffe efficiency index R2<0.5), which CRASH exceeds in all catchments\n(Table 3) ..\nHaving rejected the invalidation test, it is possible to further evaluate the matches between simulated\nand observed flows through numerical (Table 3) and graphical (Figures 8 and 9) comparisons. Table 3\nsummarises the results for FMOF, Nash-Sutcliffe efficiency index (R2) and percent bias (PBIAS). The\nPBIAS is a measure of the bias of the model (equation 25), with a tendency to overestimate indicated\nby a positive value and a tendency to underestimate by a negative value.\n \n%100*\n \n\nj\nj\nj\njj\nObs\nObsSim\nPBIAS (25)\nCRASH tends to overestimate the river flows for the Amesbury catchment during the validation period\n(PBIAS = 16.3 %). The overestimation is mainly located in the low flows and explains the change of\nFMOF from 0.32 in the calibration period to 0.52 in the validation period. However, the overall\nbehaviour of the model is very acceptable and has even slightly improved (R2 has increased from 0.83\nto 0.86) because, although the relative difference between observations and simulation has increased in\nthe low flows, the absolute difference on the whole hydrograph has decreased.\nAlthough CRASH has a tendency to slightly overestimate the river flow in the Gwills catchment, flows\nare underestimated between the 60th and 95th percentiles in the flow duration curve which are mainly\nassociated with recession flows. This suggests that recharge to the ground water store is slightly\nunderestimated. The decrease in the efficiency index (from 0.64 during calibration to 0.54 during\nvalidation) is not solely the consequence of the underestimation of the recession flows, but also of the\ntiming of the high flows, although the flow duration curves from the observations and the simulation\nmatch well.\nThere is good agreement between the two flow duration curves in the Avon catchment, with the FMOF\nshowing that there is no stage where the simulated flow duration curve is significantly different from\n17\nthe observed one, the PBIAS is small and the R2 has remained at around 0.55. The main soils of the\nAvon catchment are slowly permeable, seasonally wet soils from which runoff occurs frequently.\nDifferences in the estimation of the high flow events have an effect on the value of R2 as CRASH tends\nto underestimate these high flows in this catchment.\n8. Discussion and conclusion\nThe conceptual, continuous, daily, catchment-scale rainfall-runoff CRASH model has been developed\nto solely utilise nationally available datasets, with the ultimate purpose of being applied in ungauged\ncatchments throughout the United Kingdom. CRASH was tested in three diverse catchments, which\nwere chosen to contain soils from the three main physical settings of soil hydrology within the HOST\nsoil hydrological classification. CRASH was successful in simulating both daily time series and flow\nduration curves in each catchment, although it appears to have a slight tendency to overestimate river\ndischarge.\nUnlike many daily timestep, conceptual models (e.g. SWAT – Arnold et al., 1999; DIY- Dunn and\nLilly, 2001), CRASH is able to separate the processes of infiltration-excess runoff generation from\nsaturation-excess runoff by solution of the Philips infiltration equation using hourly rainfall data.\nAlthough infiltration-excess is not the dominant mechanism of runoff generation in the UK and much\nof north-western Europe, it can be important on bare soils and where inappropriate timing of land\nmanagement operations, such as ploughing or harvesting, causes compaction and structural damage,\nleading to a reduction in soil water storage and infiltration capacity, and an increase in runoff (Holman\net al. 2003). By combining an explicit separation and physically-based simulation of saturation and\ninfiltration-excess runoff with full representation of spatial variability in landuses and soils, a complete\ndescription of each soil’s profile (including the hydraulic conductivity and soil water release\ncharacteristics of each soil layer) and a surface depression storage term, CRASH provides the basis for\nsignificant improvement in the process representation of land management-induced changes in\nhydrological response within semi-distributed conceptual models.\nThe capacitance approach used by CRASH for redistribution of soil water within the soil profile has\nbeen integrated with soil survey data at horizon, soil taxonomic and spatial soil map units levels,\n18\nmorphological characteristics describing soil hydrological states (e.g. gleying) and soil physical\nproperties to simulate the vertical and lateral pathways of water movement through the soil. The\nsuccessful cross-scale linkage between the water movement through the soil profile and the catchment-\nscale hydrological response has been achieved using an existing national hydrologically-relevant\ndataset: the Hydrology of Soil Types (HOST) classification. The HOST classification is capable of\npredicting river flow levels of ungauged catchments throughout the United Kingdom (r2 = 0.79,\nstandard error of estimate of 0.089 in the case of Base Flow Index) by linking catchment-scale\nhydrological indices (Base Flow Index and Standard Percentage Runoff) with national soil map data,.\nThe scale effects between plot and catchments, which can be explained by the configuration of\nhydrological response units and their connection to the flow network system (Cerdan et al., 2004), are\nimplicit within the calibration of the hydrological response of the soil landscape-based HOST classes.\nThe robust relationships between HOST classes and SPR and BFI have enabled the use of HOST in\nflood estimation (e.g. Reed, 1999) and low flow estimation (Gustard et al., 1992; Young et al., 2000)\napproaches to predict individual events and flow duration curves, but CRASH represents the first\napplication to successfully parameterise all parts of the time series hydrograph. The next\ndevelopmental stage with CRASH will be to regionalise the parameter sets in order to assess whether it\nis possible to obtain a single set for each HOST class. Kuczera (1997) suggested that the\nregionalisation of the calibration brings more constraints and that these constraints can actually\nimprove the efficiency of the parameterisation. Early results (Maréchal and Holman, 2002) show\npromise for a HOST-based regionalization approach, which is supported by Dunn and Lilly (2001)\nThe information held in data used for the calibration of hydrological models e.g. river flow data is\ngenerally insufficient to determine a unique set of model parameters (Beven and Freer, 2001). Other\nsources and types of information can help to reduce the uncertainty on model parameters. Siebert and\nMcDonnell (2002) made the distinction between quantitative data that they called hard data, and\nqualitative or soft data. Hard data are measurements of the states of water bodies, and can be\nrepresented in models as internal state variables. Soft data represent the qualitative knowledge of the\nhydrological processes in the catchment. The use of soft data has not yet had as clear a success as hard\ndata, but Seibert and McDonnell (2002) claim that their incorporation into the calibration procedure is\na valuable tool to better link the modelling exercise to our knowledge of the “real” world and which,\nthrough the extra knowledge introduced into the model, provides extra confidence into its behaviour.\n19\nThe ability to incorporate such soft data within regionalization studies has been limited by the difficulty\nof producing concise, easily understood explanations of different basin behaviours (McDonnell and\nWoods, 2004). The hydrological cycle and principle of mass conservation as unifying concepts within\nhydrological sciences do not provide sufficient information on the partitioning of water among\npathways, which might be aided by an agreed catchment classification scheme which describes, at is\nmost fundamental level, fluxes, storages and response times (McDonnell and Woods, 2004). A soil\nhydrological classification, similar to HOST or the USDA Curve Number (SCS 1985), might form one\ncomponent of such a classification scheme. The Curve Number approach relates soil hydrological\ngroup, soil condition, landuse, land management practices and antecedent soil moisture condition to\ncatchment-scale runoff. Although similarly empirical, having been derived from a number of\ncatchment studies in the US, the Curve Number approach has successfully informed hydrological\nsimulations across the United States (e.g. Arnold et al. 1999) and, with calibration, in other countries\n(e.g. Germany- Krysanova and Becker, 2000; Belgium- Griensven and Bauwens, 2001). Although the\nHOST classification has been developed and calibrated in the UK, Holman and Hollis (2000) describe\na methodology for deriving HOST classes across Europe based upon the same diagnostic properties,\nfrom the Soil Map of Europe (Commission of the European Community, 1985). This have been\nsuccessfully applied and calibrated in Spain (Verdú Vázquez, 2004; Llanos Rodríguez 2004) and\nSweden (Holman and Hollis, 2000).\nOne of the five directions of work within the International Association of Hydrological Sciences\n(IAHS) Predictions in Ungauged Basins (PUB) decadal initiative (Sivapalan et al., 2003) is to “advance\nthe technological capability around the world to make predictions in ungauged basins, firmly based on\nlocal knowledge of the climatic and landscape controls on hydrological processes”. HOST and the\nCurve Number are useful in catchment modelling for grouping soils by similar hydrological behaviour,\nproviding initial quantitative values of hydrological response, and for constraining free parameter\nvalues during catchment-specific calibration (e.g. Dunn and Lilly, 2001). Such classifications of soil\nhydrological behaviour provide a sound and consistent framework for hydrological modelling in both\ngauged and ungauged catchments which should be extended to other regions to support the PUB\ninitiative.\n20\nAcknowledgements\nThis work was funded by the European Commission Framework V Programme as part of the MULINO\nproject (EVK1-2000-22089). We gratefully acknowledge the Environment Agency for the flow data,\nthe British Atmospheric Data Centre for providing access to the UK Meteorological Office Land\nSurface Observation Stations Data and to the UK Meteorological Office for the use of their data, the\nCentre for Ecology and Hydrology for the land cover map and the National Soil Resources Institute for\nthe soil information. The advice of colleagues, especially John Hollis, Keith Weatherhead and Sue\nWhite, are gratefully acknowledged.\nReferences\nAbbott, M.B., Bathurst J.C., Cunge J.A., O'Connell P.E., Rasmussen J., 1986. An introduction to the\nEuropean Hydrological System - Système Hydrologique Européen, \"SHE\", 1: history and philosophy\nof a physically-based distributed modelling system. J. Hydrol. 87, 45-59.\nAllen, R.G., Pereira L.S., Raes D., Smith M., 1998. Crop evapotranspiration: guidelines for computing\ncrop water requirements. FAO Irrigation and Drainage Paper 56. Food and Agriculture Organization of\nthe United Nations. Rome.\nArnold, J.G., Srinivasan, R., Muttiah, R.S., Allen, P.M., 1999. Continental scale simulation of the\nhydrologic balance. J. Amer. Water Res. Assoc., 35(5), 1037-1051\nBeldring, S., Engeland, K., Roald, L.A., Sælthun, N.R., Voksø, A., 2003. Estimation of parameters in a\ndistributed precipitation-runoff model for Norway. Hydrol. and Earth Syst. Sci. 7(3): 304-316.\nBeven, K., 1989. Changing ideas in hydrology - the case of physically-based models. J. Hydrol. 105,\n157-172.\nBeven K, Freer J., 2001. Equifinality, data assimilation, and uncertainty estimation in mechanistic\nmodelling of complex environmental systems using the GLUE methodology. J. Hydrol. 249 (1-4): 11-\n29\n21\nBoorman, D.B., Hollis J.M., Lilly A., 1995. Hydrology of soil types: a hydrologically-based\nclassification of the soils of the United Kingdom. Institute of Hydrology report no. 126.\nBorg H., Grimes, D.W., 1986. Depth development of roots with time: An empirical description. Trans.\nASAE.; 29, 194-197.\nCerdan, O., Le Bissonnais, Y., Govers, G., Lecomte, V., van Oost, K., Couturier, A., King, C.,\nDubreuil, N., 2004. Scale effect on runoff from experimental plots to catchments in agricultural areas\nin Normandy. J. Hydrol. 299, 4-14.\nChong, S.K., 1983. Calculation of sorptivity from constant-rate rainfall measurement. Soil Sci. Soc.\nAm. J. 47, 627-630.\nChow, V.T., Maidment D.R., Mays L. W., 1988. Applied hydrology, McGraw-Hill.\nCommission of the European Community, 1985: Soil Map of the European Communities 1:1,000,000.\nCEC-DGVI, Luxembourg, 124pp., 7 maps.\nCowperwait, P.S.P., O’Connell P.E., Metcalfe, A.V., Mawdsley, J.A., 1996. Stochastic point process\nmodelling of rainfall. I Regionalisation and disaggregation. J. Hydrol. 175, 47-65.\nCremers, N.H.D.T., van Dijk P.M., de Roo A.P.J., Verzandvoort M.A., 1996. Spatial and temporal\nvariability of soil surface roughness and the application in hydrological and soil erosion modelling.\nHydrol. Proc. 10, 1035-1047.\nCunge, J.A., 1969. On the subject of flood propagation method (Muskingum method). J. of Hydraul.\nRes., IAHR. 7(2), 205-230.\nDunn, S.M., Lilly A., 2001. Investigating the relationship between a soils classification and the spatial\nparameters of a conceptual catchment-scale hydrological model. J. Hydrol.; 252, 157-173.\nEvans, S.P., Mayr T.R., Hollis J.M., Brown C.D., 1999. SWBCM: a soil water balance capacity model\nfor environmental applications in the UK. Ecol. Model. 121, 17-49.\nFreeze, R.A., Harlan R.L. 1969. Blueprint for a physically-based, digitally simulated, hydrologic\nresponse model. J. Hydrol. 9, 237-258.\n22\nGriensven, A.V., Bauwens, W., 2001. Integral water quality modelling of catchments. Water Science\nand Technology, 43(7), 321-328.\nGustard, A., Bullock, A., Dixon, J.M., 1992. Low flow estimation in the United Kingdom. Institute of\nHydrology report No. 108, Wallingford, UK.\nHicks, W.I., 1944. A method of computing urban runoff. Trans. ASAE. 109, 1217-1253.\nHollis, J.M., Brown, C.D., 1996. A catchment-scale model for pesticides in surface water. In Del Re,\nA.A.M., Capri, E., Evans, S.P., Trevisan, M.(eds). The environmental fate of Xenobiotics. Proceeding\nof the X Symposium Pesticide Chemistry, Piacenze, Italy.\nHolman, I.P., Hollis, J.M. (eds.), 2001. Upscaling, Predictive Models and Catchment Water Quality:\nthe CAMSCALE project. Final Report of EU Fourth Framework Project No. ENV4-CT97-0439\nHolman, I.P., Hollis, J.M., Bramley, M.E., Thompson, T.R.E., 2003. The contribution of soil structural\ndegradation to catchment flooding: a preliminary investigation of the 2000 floods in England and\nWales. Hydrology and Earth System Sciences, 7(5), 754-765.\nInstitute of Hydrology, 1985. The FSR rainfall-runoff model parameter estimation equations updated.\nFlood studies supplementary report no. 16. Inst. of Hydrol., Wallingford..\nJakeman, A. Hornberger G., 1993. How much complexity is warranted in a rainfall-runoff model. Wat.\nRes. Res. 29, 2637-2649.\nJarvis, N.J., 1989. A simple empirical model for root water uptake. J. Hydrol. 107, 57-72.\nKottegoda, N.T., Natale, L., Raiteri, E., 2003. A parsimonious approach to stochastic multisite\nmodelling and disaggregation of daily rainfall. J. Hydrol. 274, 47-61.\nKrysanova, V., Becker, A., 2000. Integrated modelling of hydrological processes and nutrient\ndynamics at the river basin scale. Hydrobiologia, 410, 131-138.\nKuczera, G., 1997. Efficient subspace probabilistic parameter optimization for catchment models. Wat.\nRes. Res. 33(1), 177-185.\n23\nKutilek, M., 1980. Constant-rainfall infiltration. J. Hydrol. 45, 289-303.\nLlanos Rodríguez, J., 2004. Application of the conceptual rainfall-runoff model CRASH in the\nSpanish mountainous catchment of the Aragón river. Unpubl. MSc thesis, Cranfield University, UK.\nMaréchal, D., Homan I. P., 2002. A soil hydrology-based catchment water resources model.\nProceedings International Conference on Integrated Assessment and Decision Support (iEMSs2002).\nLugano, Italy, June 24-27; Volume 1, 452-457.\nMarshall, D.C.W., 2000. The estimation of flood response times from the digital catchment data. J. C.\nInstn. Wat. & Envir. Mangt.. 14(5), 335-340.\nMcDonnel, J.J., Woods, R., 2004. On the need for catchment classification. J. Hydrol. 299, 2-3.\nNatural Environment Research Council. 1975. Flood studies report, NERC, London, 5 vols..\nPhilip, J.R., 1957. The theory of infiltration: 1. the infiltration equation and its solution. Soil Sci. 83,\n345-357.\nRagg, J.M., Beard, G.R., George, H., Heaven, F.W., Hollis, J.M., Jones, R.J.A., Palmer, R.C., Reeve,\nM.J., Robson, J.D., Whitfield, W.A.D., 1984. Soils and their use in Midland and western England. Soil\nSurvey of England and Wales Bulletin No. 12: Harpenden.\nReed D., 1999, Flood estimation handbook, 1: Overview. Institute of Hydrology, Wallingford, Oxford.\nSefton, C.E.M., Howarth S.M., 1998. Relationships between dynamic response characteristics and\nphysical descriptors of catchments in England and Wales. J. Hydrol. 211, 1-16.\nSeibert, J., 1999. Regionalisation of parameters of a conceptual rainfall-runoff model. Agric. For.\nMeteorol. 98-99, 279-293.\nSeibert, J., McDonnell, J.J., 2002. On the dialog between experimentalist and modeler in catchment\nhydrology: Use of soft data for multicriteria model calibration. Water Resources Research. 38(11):\n1241.\nSivapalan, M., Takeuchi, K., Franks, S.W., Gupta, V.K., Karambiri, H., Lakshmi, V., Liang, X.,\n24\nMcDonnell, J.J., Mendiondo, E.M., O'Connell, P.E., Oki, T., Pomeroy, J.W., Schertzer, D.,\nUhlenbrook, S., Zehe, E., 2003. IAHS decade on Predictions in Ungauged Basins (PUB), 2003-2012:\nShaping an exciting future for the hydrological sciences. Hydrological Sciences Journal-Journal des\nSciences Hydrologiques. 48 (6): 857-880.\nSoil Conservation Service, 1985. National engineering handbook. Section 4- Hydrology. Washington,\nDC.\nTodini, E., 1996. The ARNO rainfall-runoff model. J. Hydrol. 175, 339-382.\nVandewiele, G.L., Elias, A., 1995. Monthly water balance of ungauged catchments obtained by\ngeographical regionalization. J. Hydrol. 170, 277-291.\nVerdú Vázquez, J., 2004. Water balance modelling of the River Meca at Huelva, Spain. Unpubl. MSc\nthesis, Cranfield University, UK.\nYoung, A.R., Gustard, A., Bullock, A., Sekulin, A.E., Croker, K.M., 2000. A River network based\nhydrological model for predicting natural and influenced flow statistics at ungauged sites: Micro LOW\nFLOWS. The Science of the Total Environment, 251\/252, 293-304.\nYu, P.S., Yang T.C., 2000. Fuzzy multi-objective function for rainfall-runoff model calibration. J.\nHydrol. 238, 1-14.\nZobeck, T. M., Onstad C. A., 1987. Tillage and rainfall effects on random roughness: a review. Soil &\nTil. Res. 9, 1-20.\n25\nTable 1: Statistical results – calibration period\nAmesbury Gwills Avon\nFMOF 0.32 0.35 0.22\nR2 0.83 0.64 0.54\n26\nTable 2: Calibrated parameters for the main HOST classes\nHOST class Catchment Surface runoff\nparameter\nInterflow\nparameter\nBase flow\nparameter\n1 Amesbury 0.46 0.07 5.6E-5\n2 Avon 0.19 0.12 6.7E-5\n6 Gwills 0.24 0.19 6.7E-5\n8 Gwills 0.19 0.15 1.8E-4\n9 Gwill 0.02 0.24 1.2E-4\n16 Amesbury 0.16 0.06 3.7E-5\n17 Gwills 0.18 0.06 3E-4\n23 Avon 0.37 0.03 1.4E-3\n25 Avon 0.41 0.55 1.2E-5\n27\nTable 3: Statistical results – validation period\nAmesbury Gwills Avon\nFMOF 0.51 0.43 0.24\nR2 0.86 0.54 0.55\nPBIAS (%) 16.3 6.5 8.8\n28\nFigure 1: Structure of the CRASH model composed of a) Response unit, b) Subcatchment, c)\nCatchment, and d) the conceptual representation of the catchment\nFigure 2: Example variation in the water stress coefficient (Cs) according to soil water content\nFigure 3: Location of the study catchments\nFigure 4: HOST classes within the (top) Amesbury, (middle) Gwills and (bottom) Avon catchments\nFigure 5: Membership function of the mean percentage error (MPE) used in the fuzzy multi-objective\nfunction (FMOF)\nFigure 6: Observed and simulated daily streamflow for the (top) Amesbury, (middle) Gwills and\n(bottom) Avon catchments during the calibration periods\nFigure 7: Observed and simulated flow duration curves for the (top) Amesbury, (middle) Gwills and\n(bottom) Avon catchments during the calibration periods\nFigure 8: Observed and simulated daily streamflow for the (top) Amesbury, (middle) Gwills and\n(bottom) Avon catchments during the validation periods\nFigure 9: Observed and simulated flow duration curves for (top) Amesbury, (middle) Gwills and\n(bottom) Avon catchments during the validation periods\n29\nFigure 1\n30\nFigure 2\n31\nFigure 3\n32\n5 0 5 10 Kilometers\n2 0 2 4 Kilometers\n2 0 2 4 Kilometers\nN\nHOST class\n1\n2\n3\n5\n8\n9\n10\n15\n16\n17\n18\n21\n23\n24\n25\nFigure 4\n33\nFigure 5\n34\n0\n1\n2\n3\n4\nF\neb\n-7\n9\nA\nug\n-7\n9\nF\neb\n-8\n0\nA\nug\n-8\n0\nF\neb\n-8\n1\nA\nug\n-8\n1\nJa\nn-\n82\nJu\nl-8\n2\nJa\nn-\n83\nJu\nl-8\n3\nJa\nn-\n84\nJu\nl-8\n4\nJa\nn-\n85\nR\niv\ner\ndi\nsc\nha\nrg\ne\n(m\nm\n\/d\n) Observations\nSimulation\n0\n5\n10\n15\n20\n25\nN\nov\n-7\n8\nM\nay\n-7\n9\nN\nov\n-7\n9\nA\npr\n-8\n0\nO\nct\n-8\n0\nA\npr\n-8\n1\nO\nct\n-8\n1\nA\npr\n-8\n2\nO\nct\n-8\n2\nA\npr\n-8\n3\nO\nct\n-8\n3\nA\npr\n-8\n4\nO\nct\n-8\n4\nR\niv\ner\ndi\nsc\nha\nrg\ne\n(m\nm\n\/d\n)\nObservations\nSimulation\n0\n2\n4\n6\n8\n10\n12\n14\nN\nov\n-7\n8\nM\nay\n-7\n9\nN\nov\n-7\n9\nA\npr\n-8\n0\nO\nct\n-8\n0\nA\npr\n-8\n1\nO\nct\n-8\n1\nA\npr\n-8\n2\nO\nct\n-8\n2\nA\npr\n-8\n3\nO\nct\n-8\n3\nA\npr\n-8\n4\nO\nct\n-8\n4\nR\niv\ner\ndi\nsc\nha\nrg\ne\n(m\nm\n\/d\n) Observations\nSimulation\nFigure 6\n35\n0.1\n1\n10\n0 20 40 60 80 100\nPercentage Time\nR\niv\ner\ndi\nsc\nha\nrg\ne\n(m\nm\n\/d\n)\nObservations\nSimulation\n0.01\n0.1\n1\n10\n100\n0 20 40 60 80 100\nPercentage Time\nR\niv\ner\ndi\nsc\nha\nrg\ne\n(m\nm\n\/d\n)\nObservations\nSimulation\n0.01\n0.1\n1\n10\n100\n0 20 40 60 80 100\nPercentage Time\nR\niv\ner\ndi\nsc\nha\nrg\ne\n(m\nm\n\/d\n)\nObservations\nSimulation\nFigure 7\n36\n0\n1\n2\n3\n4\n5\n6\nS\nep\n-8\n4\nM\nar\n-8\n5\nS\nep\n-8\n5\nM\nar\n-8\n6\nS\nep\n-8\n6\nM\nar\n-8\n7\nS\nep\n-8\n7\nM\nar\n-8\n8\nS\nep\n-8\n8\nM\nar\n-8\n9\nA\nug\n-8\n9\nF\neb\n-9\n0\nA\nug\n-9\n0\nF\neb\n-9\n1\nR\niv\ner\ndi\nsc\nha\nrg\ne\n(m\nm\n\/d\n)\nObservations\nSimulation\n0\n2\n4\n6\n8\n10\n12\n14\n16\n18\nN\nov\n-8\n4\nM\nay\n-8\n5\nN\nov\n-8\n5\nM\nay\n-8\n6\nN\nov\n-8\n6\nM\nay\n-8\n7\nO\nct\n-8\n7\nA\npr\n-8\n8\nO\nct\n-8\n8\nA\npr\n-8\n9\nO\nct\n-8\n9\nR\niv\ner\ndi\nsc\nha\nrg\ne\n(m\nm\n\/d\n)\nObservations\nSimulation\n0\n2\n4\n6\n8\n10\n12\nN\nov\n-8\n4\nM\nay\n-8\n5\nN\nov\n-8\n5\nM\nay\n-8\n6\nN\nov\n-8\n6\nM\nay\n-8\n7\nO\nct\n-8\n7\nA\npr\n-8\n8\nO\nct\n-8\n8\nA\npr\n-8\n9\nO\nct\n-8\n9\nR\niv\ner\ndi\nsc\nha\nrg\ne\n(m\nm\n\/d\n)\nObservations\nSimulation\nFigure 8\n37\n0.1\n1\n10\n0 20 40 60 80 100\nPercentage Time\nR\niv\ner\ndi\nsc\nha\nrg\ne\n(m\nm\n\/d\n)\nObservations\nSimulation\n0.01\n0.1\n1\n10\n100\n0 20 40 60 80 100\nPercentage Time\nR\niv\ner\ndi\nsc\nha\nrg\ne\n(m\nm\n\/d\n)\nObservations\nSimulation\n0.01\n0.1\n1\n10\n0 20 40 60 80 100\nPercentage Time\nR\niv\ner\ndi\nsc\nha\nrg\ne\n(m\nm\n\/d\n)\nObservations\nSimulation\nFigure 9\n"}