{"doi":"10.1016\/j.tca.2006.11.002","coreId":"138162","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1486","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1486","10.1016\/j.tca.2006.11.002"],"title":"Polymer\/montmorillonite nanocomposites with improved thermal properties: Part I.\nFactors influencing thermal stability and mechanisms of thermal stability\nimprovement.","authors":["Leszczynska, Agneska","Njuguna, James A. K.","Pielichowski, Krzysztof","Banerjee, J. R."],"enrichments":{"references":[{"id":38105942,"title":"285. Captions for Table and Figures","authors":[],"date":"2005","doi":null,"raw":"S.-H. Kim, S.-H. Park, S.-C. Kim, Polym. Bull. 53 (2005) 285. Captions for Table and Figures","cites":null},{"id":38105924,"title":"Chemistry of Clay-Organic Reactions,","authors":[],"date":"1974","doi":"10.1097\/00010694-197608000-00010","raw":"B.K.G. Theng, Chemistry of Clay-Organic Reactions, Wiley, New York 1974.","cites":null},{"id":38105930,"title":"Chimica Oggi - Chem. Today March\/April","authors":[],"date":"1997","doi":null,"raw":"P.A. Ciullo, Chimica Oggi - Chem. Today March\/April (1997).","cites":null},{"id":38105926,"title":"Clay-Containing Polymeric Nanocomposites,","authors":[],"date":"2004","doi":"10.1201\/9781420009804-c13","raw":"L.A. Utracki, Clay-Containing Polymeric Nanocomposites, Rapra, Shawbury 2004.","cites":null},{"id":38105940,"title":"Giannelis, in:","authors":[],"date":"1998","doi":"10.1533\/9781845698584.3.203","raw":"J. Gilman, T. Kashiwagi, J. Brown, S. Lomakin, E. Giannelis, in: Proceedings of 43rd International SAMPE Symposium, Anaheim, USA, May 31 - June 4 1998.","cites":null},{"id":38105932,"title":"in:","authors":[],"date":"2001","doi":"10.1002\/masy.200550311","raw":"J. Trilica, A. Kalendova, Z. Malac, J. Simonik, in: Proceedings of SPE ANTEC, Dallas, USA, May 6-10 2001.","cites":null},{"id":38105934,"title":"Molten Salts: From Fundamentals to Applications","authors":[],"date":"2002","doi":"10.1007\/978-94-010-0458-9_13","raw":"R.T. Carlin, J. Fuller, Molten Salts: From Fundamentals to Applications in NATO Science Series, M. Gaune-Escard (Ed.), Kluwer, Dordrecht 2002.","cites":null},{"id":38105936,"title":"Polymer-Clay Nanocomposites,","authors":[],"date":"2001","doi":null,"raw":"J.C. Matayabas Jr, S.R. Turner, in: T.J. Pinnavaia, G.W. Beall, (Eds.), Polymer-Clay Nanocomposites, Wiley New York 2001.","cites":null},{"id":38105928,"title":"The Differential Thermal Investigation of Clays, Mineralogical Society London","authors":[],"date":"1957","doi":null,"raw":"R. Greene-Kelly, in: R.C. Mackenzie, (Ed.), The Differential Thermal Investigation of Clays, Mineralogical Society London 1957.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-02-01T00:00:00Z","abstract":"The results of recent research indicate that the introduction of layered\nsilicate – montmorillonite – into polymer matrix results in increase of thermal\nstability of a number of polymer nanocomposites. Due to characteristic structure\nof layers in polymer matrix and nanoscopic dimensions of filler particles,\nseveral effects have been observed that can explain the changes in thermal\nproperties. The level of surface activity may be directly influenced by the\nmechanical interfacial adhesion or thermal stability of organic compound used to\nmodify montmorillonite. Thus, increasing the thermal stability of\nmontmorillonite and resultant nanocomposites is one of the key points in the\nsuccessful technical application of polymer–clay nanocomposites on the\nindustrial scale. Basing on most recent research, this work presents a detailed\nexamination of factors influencing thermal stability, including the role of\nchemical constitution of organic modifier, composition and structure of\nnanocomposites, and mechanisms of improvement of thermal stability in polymer\/\nmontmorillonite nanocomp","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138162.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.tca.2006.11.002","pdfHashValue":"84423cf009dfa3c49ecf85de4896a6d64147722d","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1486<\/identifier><datestamp>2014-02-18T14:32:32Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Polymer\/montmorillonite nanocomposites with improved thermal properties: Part I.\nFactors influencing thermal stability and mechanisms of thermal stability\nimprovement.<\/dc:title><dc:creator>Leszczynska, Agneska<\/dc:creator><dc:creator>Njuguna, James A. K.<\/dc:creator><dc:creator>Pielichowski, Krzysztof<\/dc:creator><dc:creator>Banerjee, J. R.<\/dc:creator><dc:subject>Polymer nanocomposites<\/dc:subject><dc:subject>Montmorillonite<\/dc:subject><dc:subject>Thermal stability<\/dc:subject><dc:subject>Degradation<\/dc:subject><dc:description>The results of recent research indicate that the introduction of layered\nsilicate – montmorillonite – into polymer matrix results in increase of thermal\nstability of a number of polymer nanocomposites. Due to characteristic structure\nof layers in polymer matrix and nanoscopic dimensions of filler particles,\nseveral effects have been observed that can explain the changes in thermal\nproperties. The level of surface activity may be directly influenced by the\nmechanical interfacial adhesion or thermal stability of organic compound used to\nmodify montmorillonite. Thus, increasing the thermal stability of\nmontmorillonite and resultant nanocomposites is one of the key points in the\nsuccessful technical application of polymer–clay nanocomposites on the\nindustrial scale. Basing on most recent research, this work presents a detailed\nexamination of factors influencing thermal stability, including the role of\nchemical constitution of organic modifier, composition and structure of\nnanocomposites, and mechanisms of improvement of thermal stability in polymer\/\nmontmorillonite nanocompo<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2012-05-23T23:02:28Z<\/dc:date><dc:date>2012-05-23T23:02:28Z<\/dc:date><dc:date>2007-02-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>A. Leszczynska, J. Njuguna, K. Pielichowski and J.R. Banerjee, Polymer\/\nmontmorillonite nanocomposites with improved thermal properties: Part I. Factors\ninfluencing thermal stability and mechanisms of thermal stability improvement,\nThermochimica Acta, Volume 453, Issue 2, 1 February 2007, Pages 75-96.<\/dc:identifier><dc:identifier>0040-6031<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.tca.2006.11.002<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/1486<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0040-6031","0040-6031"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Polymer nanocomposites","Montmorillonite","Thermal stability","Degradation"],"subject":["Article"],"fullText":" 1\nPolymer\/montmorillonite nanocomposites with improved thermal \nproperties.  \nPart I: Factors influencing thermal stability and mechanisms of thermal \nstability improvement \n \nA. Leszczyńskaa, J. Njugunab, K. Pielichowskia,*, J. R. Banerjeec \naDepartment of Chemistry and Technology of Polymers, Cracow University of Technology, \nul. Warszawska 24, 31-155 Kraków, Poland. \nbSchool of Industrial and Manufacturing Science, Cranfield University, \nCranfield, Bedfordshire, MK43 0AL, UK. \ncSchool of Engineering and Mathematical Sciences, City University,   \nNorthampton Square, London, EC1V 0HB, UK. \n \n \nAbstract \n \nThe results of recent research indicate that the introduction of layered silicate – \nmontmorillonite - into polymer matrix results in increase of thermal stability of a number of \npolymer nanocomposites. Due to characteristic structure of layers in polymer matrix and \nnanoscopic dimensions of filler particles, several effects have been observed that can explain \nthe changes in thermal properties. The level of surface activity may be directly influenced by \nthe mechanical interfacial adhesion or thermal stability of organic compound used to modify \nmontmorillonite. Thus, increasing the thermal stability of montmorillonite and resultant \nnanocomposites is one of the key points in the successful technical application of \npolymer\/clay nanocomposites on the industrial scale. Basing on most recent research, this \nwork presents a detailed examination of factors influencing thermal stability, including the \nrole of chemical constitution of organic modifier, composition and structure of \nnanocomposites, and mechanisms of improvement of thermal stability in \npolymer\/montmorillonite nanocomposites.  \n \n                                                 \n* Corresponding author: Tel.+ 48 12 6282727, Fax: +48 12 6282038, e-mail: kpielich@usk.pk.edu.pl (K. \nPielichowski). \n 2\nKeywords: Polymer nanocomposites, montmorillonite, thermal stability, degradation. \n 3\n \n1. Introduction \n \nAlthough the organo-clay complexes have been recognized for a long time [1,2] the \ninterest in studying these layered silicate materials as nanoscale-reinforcing agents for \npolymeric materials has only been developed recently. The introduction of as low as 1–5 wt. \n% of montmorillonite (MMT) into polymer matrix is well-known to result in significant \nimprovement in mechanical strength due to nanometric dimensions and high aspect ratio. The \nnanoscopic phase distribution as well as synergism between polymer and the layered silicate \nresult in additional properties, such as flame retardation, enhanced barrier properties and \nablation resistance, which are not observed in either component [3-6]. The layered silicates \nused for this purpose are mica, fluoromica, hectorite, fluorohectorite, saponite, etc., but of the \ngreatest commercial interest is montmorillonite (MMT) that belongs to the structural family \nknown as the 2:1 phyllosilicates. Their crystal structure consists of layers made up of two \nsilica tetrahedral sheets fused to an edge-shared octahedral sheet of either aluminium or \nmagnesium hydroxide. Stacking of the layers leads to a regular van der Waals gap between \nthe layers (the interlayer or gallery). Isomorphic substitution within the layers generates \ncharge deficiency (i.e. Fe2+ or Mg2+ replacing Al3+ in MMT and Li+ replacing Mg2+ in \nhectorite). The deficit charges are compensated by cations (usually Na+ or K+) absorbed \nbetween the three-layer clay mineral sandwiches. These are held relatively loosely and give \nrise to the significant cation-exchange properties. \nPolymer-layered silicate nanocomposites are currently prepared in four ways - in situ \npolymerisation, intercalation from a polymer solution, direct intercalation by molten polymer \nand sol–gel technology [7]. Direct polymer melt intercalation is the most attractive because of \nits low cost, high productivity and compatibility with current polymer processing techniques. \nPolymer\/clay nanocomposites preparation involves high temperatures irrespective of the \nfabrication route. If the processing temperature is higher than the thermal stability of the \norganic component used for montmorillonite modification, decomposition will take place, \nleading to variations between the filler and polymer. Thus, determination of the onset \ntemperature of degradation, resultant products of degradation and the stability of the polymer \nin the presence of layered silicates as well as understanding the relationship between the \nmolecular structure and the thermal stability (decomposition temperature, rate, and the \ndegradation products) of the organic modification of the layered silicate is critical [8,9]. In \nparticular, thermal stability was considered as an important factor playing role in the \n 4\nnanocomposite structure and morphology formation [10]. Studies have shown that different \nmethods of synthesis and types of organophilic MMT influence the morphology and thermal \nstability of polymer\/clay nanocomposites. For instance, studies on polyamide 11\/clay \nnanocomposites have reported that the enhanced thermal stability is only achieved at quite \nlow loading level, thus making the obtained nanocomposites cheaper, lighter and easier to \nprocess than the conventional microcomposites; the improvement in thermal stability is much \nmore significant for the exfoliated nanocomposites than that for the intercalated ones [11].  \n \n2. Parameters influencing the thermal stability of polymer\/MMT nanocomposites \n \n2.1. The role of organic modifier on thermal stability of polymer\/MMT \nnanocomposites \n \nFor the majority of polymers, owing to their hydrophobic character, the clay must be \nmodified with a surfactant in order to make the gallery space sufficiently hydrophobic to \npermit it to interact with the polymer.  \n \nAmmonium compounds \nThe surfactant is usually described as an ‘onium’ salt, but in fact ammonium salts are \nmost commonly used. The commonly used organo-modification agents are long carbon-chain \nalkyl ammonium salts. The quaternary ammonium ion is nominally chosen to compatibilize \nthe layered silicate with a given polymer resin. However, the molecular structure, such as \nalkyl chain length, number of alkyl chains and unsaturations, is also the determining factor of \nthe thermal stability of the polymer\/MMT nanocomposites [12]. Although these modification \nagents have been gaining significant success in the preparation of polymer\/MMT \nnanocomposites, their common shortcoming is the poor thermal stability. The thermal \nstability of the organoclay component is of major importance, as many polymer composites \nare either melt-blended or intercalated at high temperatures to yield distribution of filler in the \nnanoscale. All the nanocomposite components may be subjected to high temperatures during \npreparation process, further processing and service time. If the processing temperature is \nhigher than the thermal stability of the organoclay, then decomposition occurs, and the \ninterface between the filler and the matrix polymer is effectively altered. There has been done \na substantial work on studying the degradation process of organoclays and nanocomposites as \nwell as significant successes were noted in  the elaborating of thermally stable organic \n 5\nmodifiers for compatibilizing the clay and polymer matrix, but still some questions remain \nunanswered. \nThe degradation process of intercalated montmorillonite reveals significant \ndifferences. For instance, pure montmorillonite do not exhibit any significant mass loss due to \ndecomposition processes in a temperature up to 300ºC. Early investigations by Greene-Kelly \n[13] considered the MMT differential thermal curve in two parts: the free water and interlayer \nwater region in the temperature range 100-300ºC and the structural water (bonded hydroxyl \ngroups that undergo dehydroxylation) region in the temperature range 500-1000ºC. Studies by \nXie et al. [12,14] reported the thermal stability of MMT modified by long carbon-chain alkyl \nquaternary ammonium ions and found that the onset decomposition temperature of the \nresultant organically modified layered silicates (OLS) was approximately 180ºC. \nInterestingly, investigations by Zheng and Wilkie [15] reported that methyl tallow bis-2-\nhydroxyethyl ammonium modified clay and dimethyl dihydrogenated tallow alkyl ammonium \nmodified clay showed very good thermal stability, with 10% degradation (10% mass loss) \noccurring around 390ºC.  Investigations by Xie et al. [14] reported that the thermal \ndecomposition of organic substances between silicate layers was mainly in the range 200–\n500ºC. A follow-up work showed that the Na +-MMT exhibited no weight loss in this range of \ntemperature; in contrast, the organic MMTs (modified with dimethyldioctadecyl ammonium \nor trimethyloctadecyl ammonium) exhibited significant weight loss [16]. The MMT modified \nwith dimethyldioctadecyl ammonium exhibited larger weight loss in the range of 200–350ºC \nthan MMT modified by trimethyloctadecyl ammonium. This indicated that the former \ncontained more organic matter than the latter, which accounted for the larger interlayer \ndistance of MMT modified with dimethyldioctadecyl ammonium. \nHwu and co-workers [17] found OLS to decompose in two step process as shown in \nFig.1.  \n \nFig.1 \n \nThe first step of degradation proceeding with a maximum rate at about 200°C gave mainly \nlong carbon chains with chloro or amine groups whereas the evolved gases during the second \nstage of degradation were composed mainly of both short and long carbon alkene chains \nwithout the chloro groups, as detected by GC\/TOF-MS method. It was stressed that the gases \nevolved during OLS degradation at 200 and 220°C were the same as that of pure \nstearyltrimethyl ammonium chloride. However, the species detected at 300 and 400°C were \n 6\ndifferent from that of pure organic compound. In nanocomposite material that seemed to have \na mixed intercalated\/exfoliated structure authors indicated two possible areas, the outside \nspaces of the silicate layers and the interlayer spaces, where decomposition of organic \ntreatment could take place at different temperatures (Fig. 1). They explained that the first \nbond breakage in the organic compound might occur outside the clay sheets, between N and C \nbonds, at around 200°C. Because there was less hindrance in the clay sheets, the formed \ncompounds could evolve quickly without further degradation. The intercalated organic \ncompounds decomposed at higher temperatures, and the decomposition reactions were more \ncomplete than that of outside organic compounds. Because of the hindrance in the clay sheets \nand the force between them, they evolved slowly and further decomposition occurred mainly \nbetween C and C bonds. From GC\/TOF-MS results, comparing the trapped evolved gases at \ndifferent temperatures for OLS, it was indicated that below 160°C the small amount of water, \nsolvent (C3H8O), 1-chlorohexadecane and N,N-dimethyl-1-tridecanamine were evaporated. \nThe detected water at 110°C was ascribed to the absorbed water. At higher temperatures, the \nwater probably came from the reaction of the hydroxyl group in the clay sheets and organic \ncompounds. Finally, no water or solvent was observed, but there were still similar species \nsuch as 1-chloro-hexadecane and N,N-dimethyl-1-tridecanamine determined even at \ndecomposition temperature. This showed that the clay modified with stearyltrimethyl \nammonium chloride was not stable even at lower temperatures. \nElsewhere, the OLS were demonstrated to have a different behaviour than Na+-MMT. \nFor instance, the free water (~1 wt. %) disappeared by 40ºC [12]. There was no interlayer \nwater in the OLS as the quaternary ammonium salt had been exchanged for the hydrated \nsodium cation. The free and interlayer water (total ~ 4 wt. %) started evolving about 90ºC for \npristine Na+-MMT, but were not completely gone until about 300ºC. In the temperature range \n500-800ºC, the hydroxyl groups, which covalently incorporated in the crystal lattice, were \ndehydrated. It has been proposed that the organic modifiers start decomposing at temperature \naround 200ºC, and the small molecular weight organics are released first while the high \nmolecular weight organic species are still trapped by OLS matrix [13,18,19]. With the \nincrease of temperature, the high molecular organic compunds not only decomposed, but were \nalso released from OLS.  This phenomenon was also observed by Xie et al. [12] using \ndifferential thermal analysis (DTA) and MS, and led to proposition that the organic \ncompounds with a small molecular weight may be released first and those with a relatively \nhigh molecular weight may still exist between the interlayers until the temperature is high \nenough to lead to their further decomposition. X-ray measurements found out that by over \n 7\n300ºC the (001) spacing decreased from about 15 Å for Ca-saturated or 11-12.5 Å for Na \nsaturated samples to 9.5 Å and that no further decrease occurred at higher temperature \n[18,19]. It was concluded, therefore, that in this temperature range the bulk of the water is lost \nfrom the interlayer space.  \nThe thermal degradation of ammonium salts generally proceeds either by a Hofmann \nelimination to give a product different from the amine, or an SN2 nucleophilic substitution \nreaction to produce the amine. During thermal degradation proceeding according to the \nHofmann degradation mechanism the ammonium cation loses an olefin and an amine and \nleaves an acid proton on the surface of the MMT [14]. This acid site on the surface of MMT \nprobably has a catalytic effect during the initial stages of decomposition of organic material \nwithin the OLS.  \nThe studies on the effect of alkyl chain length and saturation on the thermal stability of \nthe OLS found the decomposition product was a mixture of alkanes and alkenes [12]. \nAdditionally, NH3 was proposed possible but was difficult for the study to confirm since the \ncharacteristic MS peak of NH3 was overlapping with that of water. However, the IR spectra \nshowed emission of NH3 product because of the presence of following reversible reactions: \nRH2O+M RNH3H3O+M R2NH2\nM R3NH + H3O M R2NH2 + RH2O\nRH2O+M NH4H3O+M RNH3\n \nSince the only difference among the samples prepared was that the organically modified \nMMT contained quaternary ammonium cations with three methyl substituents and one long \nalkyl substituent (coco, tallow, dodecyl and octadecyl) was the fourth substituent, their \nthermal behaviours could be determined by the susceptibility of long alkyl chain to undergo \ndegradation reactions. The onset decomposition temperature (Tonset) was considered an index \nfor the thermal stability of OLS. Based on the Tonset, it was concluded that different \nammonium compounds had no or very little effect on their thermal decomposition in the \npresence of clay [12]. The DTG curves for the nanocomposites in Xie et al. work were \nconsidered in four parts: the free water region in the temperature below 200°C; the region \nwhere organic substances evolve in the temperature range 200-500°C; the structural water \nregion in the temperature range 500-800°C; and a temperature region between 800 and \n1000°C, where organic carbon reacts in some yet unknown way.  It was observed that one of \nthe most distinguishing differences between sodium MMT (Na+-MMT) and the organically \n 8\nmodified MMT (OMMT) was in the temperature range of 800-1000°C. Na+-MMT is very \nstable when the temperature is higher than 800°C, however, according to the experimental \nresults, the OMMT continued to lose weight with large amounts of CO2 being released at \ntemperature over 800°C. The explanation given was that the onium ion decomposition \nproducts, including alkanes and alkenes, were partially absorbed on the surface of the \naluminosilicate. Subsequently, the absorbed organic structures were catalysed by the \naluminosilicate to CO2 and\/or the high temperature reaction of the carbon in the organic \nmoiety with the oxygen in the crystal structure of the MMT took place. \nOsman et al. have investigated the structure of alkylammonium molecules with different \nnumber and chain length of alkyl substituents self-assembled on MMT platelets. Depending \non the cross-sectional area, the available area\/cation, and the alkyl chain length, the molecules \nadopted a two-dimensional order or a disordered state at ambient temperatures. At a certain \nlength and number of chains, the molecules adopted an ordered state due to increasing chain \ninteractions and packing density. In the ordered state, the alkyl chains preferentially arrange in  \ntrans conformation. With increasing temperature, conformational transformation of the chains \ntakes place, leading to a dynamically disordered phase (liquid-like). Although the \ntranslational freedom of the chains is restricted by the electrostatic binding of the headgroups \nto the substrate, the conformational transformation leads to chains with random conformation \nand destroys the two-dimensional order [20]. \nFurther analysis of the ultra thin alkylammonium film covering the mineral surface \nrevealed a correlation between the extent of cation exchange, arrangement of alkylammonium \nmolecules and thermal stability of organically modified silicates. Authors have found that in \nthe final stage of the exchange, some alkylammonium molecules are intercalated between the \nionically bonded ones in a tail-to-tail arrangement leading to a local bilayer. This local bilayer \nas well as the non-reacted ammonium salt molecules decompose at lower temperatures than \nthe self-assembled monolayer (SAM) and decrease the thermal stability of the OLS. The \nthermal stability of the organic monolayer depended on its chemical structure and purity as \nwell as on the nature of the substrate. In general, dialkylammonium SAM were more stable \nthan the monoalkyl derivatives. Neither the decomposition onset temperature nor the \ntemperature of maximum mass loss rate was useful as an index for the stability of \nalkylammonium SAMs. The time needed for an isothermal mass-loss equal to 5% of that \noccurring across the first decomposition step was used as an index to compare the stability of \ndifferent monolayers [21]. \n 9\nOther group has synthesized thermally stable, rigid-rod aromatic amine modifiers (Fig. \n2) and applied them to prepare polyimide\/MMT nanocomposites by in situ polymerization \nand melt intercalation method as well as poly(vinyl chloride) nanocomposites by the melt \nintercalation method [22].  \n \nFig. 2 \n \nHowever, in the case of PVC nanocomposites the onset thermal decomposition temperature \nwas only slightly increased - from 293°C for PVC to 302°C when the MMT content was \nbelow 1 wt. % [23]. When the MMT content increased continuously, the thermal stability of \nthe nanocomposites decreased slowly, and, when the MMT content was 5 wt. %, the onset \ndecomposition temperature was the same as for pure PVC. Thermal stability results on PP–\nMA and PP–g–MA nanocomposites of OMLS where ammonium cation containing methyl, \ntallow and two hydroxyethyl groups (MT2EtOH) was used as a organic modifier confirmed \nthe negative influence of the hydroxyethyl reactivity, which tended to increase the \nconcentration of radicals, favouring chain scission reactions and creation of weak bonds [24].   \nAlthough the ammonium compounds are effective in increasing the gallery spacing of \nMMT and make the composition of polymer and inorganic filler more compatible, other \nchemical compounds, such as phosphonium, pyridinium and imidazolium were considered as \norganic intercalant for MMT due to their higher thermal stability in comparison to ammonium \ncompounds [25]. Further, Utracki considered the use of branched alkyl chains instead of \nlinear or aromatic substituents to enhance the thermal resistance of ammonium compounds \n[26].  \nLiang et al. [27] reported study on the organo-modification of MMT using thermally \nstable aromatic amines that contained phenyl structure and imide moiety and, unlike aliphatic \namines, had very rigid chemical structure. The MMT-N-(4-(4’-aminophenoxy))phenyl \nphthalimide and MMT-N-4-(4’-aminophenyl)phenyl phthalimide clearly showed higher \ndecomposition temperature compared to MMT-hexadecylamine because of the higher thermal \nstability of N-(4-(4’-aminophenoxy))phenyl phthalimide and N-(4-(4’-aminophenyl))phenyl \nphthalimide. The former showed slightly lower thermal stability because of the relatively poor \nthermal stability of ether linkage.  \nIn another development, diprotonated forms of polyoxypropylene diamines of the type \na,ω-(NH3CHCH3CH2(OCH2CHCH3)xNH3)2+ with x = 2.6, 5.6, and 33.1, have been \nintercalated into MMT and fluorohectorite clays and subsequently evaluated for the formation \n 10\nof glassy epoxy\/clay nanocomposites [28]. The intercalated onium ions functioned \nconcomitantly as a clay surface modifier, intragallery polymerization catalyst and curing \nagent. Depending on the chain length of the diamine, different orientations of the propylene \noxide oligochains were adopted in the clay galleries, resulting in basal spacings from ~14 Å \n(lateral monolayer, x = 2.6) to ~45 Å (folded structure, x = 33.1). In comparison to clay-\nmonoamine intercalates, the use of diamine intercalates greatly reduced the plasticizing effect \nof the alkyl chains on the polymer matrix, resulting in higher glass transition temperature and \nimproved mechanical properties, while at the same time reducing the cost and time needed for \nnanocomposite fabrication. \n \nImidazolium compounds \nTo circumvent the detrimental effect of the lower thermal stability of alkyl \nammonium-treated MMT, several works have been dealing with preparation of alkyl-\nimidazolium molten salts-treated MMT clays via ion exchange of the Na+-MMT with \nimidazolium salts and compared them to the conventional quaternary alkyl ammonium MMT \n[29,30].  \nPrior to discussion concerning the thermal stability of imidazolium-intercalated MMT, \none should focus on the thermal decomposition process of imidazolium salts and the role of \ntheir chemical structure. \n Ngo et al. [31] and Begg et al. [32] found out that imidazole is resistant to ring fission \nduring thermal rearrangements of 1-alkyl- and 1-aryl-imidazoles at temperatures above \n600°C, thus indicating that the imidazolium cation was more thermally stable than the alkyl \nammonium cation. Notably, earlier research indicated that the facility with which various \ngroups are cleaved from quaternary salts involves SN1 or SN2 mechanisms [33,34]. The \npyrolysis of the imidazolium quaternary salt proceeds most likely via SN2 process (Fig. 3).   \n \nFig. 3 \n \nAwad et al. [29] studied also the infuence of the anion type on thermal stability of the \nimidazolium salts. The hexafluorophosphate, tetrafluoroborate and \nbis(trifluoromethylsulfonyl)imide salts showed more than 100°C increase in the onset \ndecomposition temperature compared to the halide salts. The thermal stability increased in the \norder: PF6 > N(SO2CF3)2 > BF4 > Cl, Br. Additionally, the imidazolium thermal stability was \naffected by the type of isomeric structure of the alkyl side group. This was evidenced by the \n 11\nobservation that both 1-butyl-2,3-dimethyl-imidazolium tetrafluoroborate and \nhexafluorophosphate salts had higher onset decomposition temperature than 1,2-dimethyl-3-\nisobutyl-imidazolium tetrafluoroborate and hexafluorophosphate salts, respectively. The \ndegradation reaction presumably proceeds via SN1 reaction since the cleavage of the tertiary \ncarbon atom is likely to occur - Fig. 4.  \n \nFig. 4 \n \nFurther, methyl substitution in the 2-position (i.e. between the two N atoms) has been \nreported to enhance the thermal stability [35]. This is evident from the increase in the onset \ndecomposition temperature of both 1-butyl-2,3-dimethyl-imidazolium chloride and 1,2-\ndimethyl-3-hexadecyl-imidazolium chloride compared to 1-butyl-3-methyl-imidazolium \nchloride and 1-hexadecyl-3-methyl-imidazolium chloride, respectively; this effect may be due \nto the high acidic character of the C2 proton. \nThe experimental results concerning the thermal stability of immidazolium \nintercalated MMT  showed a great increase as compared to ammonium-modified MMT. \nMoreover, higher thermal stability was observed for dimethyl hexadecyl-imidazolium-\nintercalated MMT than the dimethyl hexadecyl - imidazolium chloride and bromide salts, \nwhich was explained as due to the removal of the halide effect. However, it was observed that \nthere was no significant improvement in the thermal stability of the intercalated \ntetrafluoroborate and hexafluorophosphate compounds comparing to molten salts due to the \nweak nucleophilicity of BF4- and PF6- anions. The results also indicated that the thermo-\noxidative stability of imidazolium-treated MMT decreased as the chain length of the alkyl \ngroup attached to the nitrogen atom increased. FTIR analysis of the decomposition products \nshowed among decomposition products water, carbon dioxide and hydrocarbons [29].  \n \nPhosphonium compounds \nThe enhancement of thermal stability of phosphonium modified clay mean that it \ncould be useful for polymers which must be processed at temperatures above that at which the \nammonium clays undergo degradation. Bearing in mind that the onset temperature of the \ndegradation of a phosphonium modified clay is about 50ºC higher than that of ammonium \nclay [36], this difference could be important in the melt blending of some polymers.  \nIn the preparation of poly(trimethylene terephthalate) (PTT) nanocomposites, elevated \ntemperatures greater than or equal to 265°C are required for successful in situ intercalation \n 12\nand bulk processing. The thermal stability of PTT nanocomposite fibers obtained by in situ \nintercalation polymerization of dimethyl terephthalate (DMT) and 1,3-propanediol (PDO) was \nimproved by using a thermally stable organoclay – Na+-MMT modified with \ndodecyltriphenylphosphonium in a way presented in Fig. 5 [37].  \n \nFig. 5 \n \nThe initial thermal degradation temperature (Ti), measured as a temperature at 2% weight \nloss, was higher for all nanocomposites in comparison with pure polymer. However, no clear \ndependence of Ti as a function of clay loading was observed and the Ti of all PTT hybrids was \nin the range of 370–371ºC, regardless of the clay loading. In accordance with the increase in \nclay loading (0–4%), the weight of the final residue at 600 ºC was found to increase by 1-\n13%, which is a promising effect for flame retardation due to formation of protective surface \nlayer.  \nWhen comparing flammability tests and thermogravimetric analysis it is necessary to be \naware of the differences in experimental conditions in both tests. TG measurements are often \ndone in inert gas atmosphere (instead of air), heat fluxes, heating rates and temperature range \nare quite different in thermogravimetry as compared to flammability tests – one should \ntherefore be careful when comparing flammability and TG data.    \n \nStibonium compounds \nAs it was previously mentioned, the degradation of the typical ammonium clay \nproceeds in two steps. In the first step, which occurs in the range of 200–400ºC, the long \nchain is lost as an olefin and a hydrogen replaces the alkyl group. In the second step, which \ncommences at about 400ºC, the amine is lost and a proton is now the counterion for the clay. \nHowever, studies have shown that in case of stibonium-modified clay only a single step \nbridges both temperature regions. The hexadecyl group was reportedly 35% of the total mass \nof the stibonium cation and only 13% of the mass was lost at 400ºC so complete degradation \nof this cation did not occur, unlike the case of ammonium clays where the degradation was \ncomplete. Even at 600ºC for the stibonium cation the mass loss was only 20% and the mass \nfraction attributable to the cation was greater than in ammonium clay [36,38].   \n \nOther modifications \n 13\n In report by Liu et al. [39], interesting results were achieved when MMT was modified \nwith octaaminopropyl polyhedral oligomeric silsesquioxane (OapPOSS) exhibiting very high \nthermal stability, and using such an organoclay as filler for epoxy resin. Since one molecule \nof OapPOSS has eight ammonium groups it was proved that only a half of them was ionically \nbonded to MMT surface, and the rest was allowed to react with diglycidyl ether of bisphenol \nA (DGEBA) in an emulsion resulting in a DGEBA-modified clay, which was then blended \nwith epoxy and 4,4’-diaminodiphenylmethane (DDM). The obtained hybrid material \nexhibited exfoliated structure with the layers effectively bonded to polymer matrix - Fig. 6. \n \nFig. 6 \n \nAlthough no significant changes were shown in the initial step of thermal degradation, the \nenhanced char yield was seen in the high temperature region. This effect was observed to be \nincreasingly significant with increasing the concentration of POSS cages. The authors pointed \nout that the weight retention could be ascribed to POSS-MMT constituent, which was \nhomogenously dispersed in epoxy matrix at the nanoscale. The higher char yields implied that \nthere were fewer volatiles being released from the nanocomposites during heating.  \nSu et al. [40] have recently proposed new oligomeric styrene surfactants based on \ndifferent ammonium, imidazolium and phosphonium salts for montmorillonite modification.  \nOrganically-treated clays containing N,N,N-trimethylpolystyrylammonium (CTMA), N,N-\ndimethyl-N-benzylpolystyrylammonium (CDMBA), N,N-dimethyl-N-\nhexadecylpolystyrylammonium (CDMH), 1,2-dimethyl-3-polystyrylimidazolium (CDMID), \nand triphenylpolystyrylphosphonium (CTPP) chlorides showed substantially superior thermal \nstability in comparison to the commonly used quaternary ammonium salts, the degradation of \nwhich begins at about 200°C. The authors pointed that depending on the method of analysis \ndifferent thermal behaviour of samples was observed. The order of organically modified clays \nfrom the most to the least thermally stable, based upon the 10% mass loss in TGA, was CTTP \n> CDMID > CDMH > CTMA > CDMBA. When DTA was used, the accessed degradation \norder was CTPP > CDMID > CTMA > CDMH = CDMBA. Since the boiling points of the \ndegradation products were higher than the temperature at which they were released, the \nchange in heat was thought as a more reliable indicator of chemical change than mass loss. \nThe use of thermogravimetry coupled with FTIR enabled to identify the main volatile \nproducts evolved during thermal decomposition of oligomeric styrene surfactants and  \norganomodified clays, as well as nanocomposites of these organosilicates dispersed in \n 14\npolystyrene matrix. When ammonium salt with aliphatic substituents was investigated, \naliphatic C-H absorptions were observed at the first stage of organoclay degradation. It was \nascribed to 1-hexadecene that was the product of Hofmann elimination. At higher \ntemperatures some carbonyl vibrations were seen as a result of oxidation reactions. Further \ntemperature growth revealed aromatic C-H vibrations, attributable to the thermal degradation \nof the styrene oligomer. In the degradation of the triphenylphosphine-substituted material \nchloride anion played an active role since the initial decomposition product determined was \nhydrogen chloride.  \nThe authors indicated that the pathways of degradation are dependent on the presence \nof a substituent that has a β-hydrogen [40] - in that case Hofmann elimination may occur. On \nthe other hand, in the absence of this β-hydrogen, an SN2 reaction may occur, producing the \namine and the styrene-vinylbenzyl chloride copolymer. The FTIR spectra of the gases \nevolved during the degradation of organoclays showed no significant differences from spectra \nof gases coming from the surfactants except from the absence of HCl in the \ntriphenylphosphine-substituted silicates spectra. In the case of modified clays different \npathway by which these materials degrade was suggested. Two possible processes were \ndescribed for the reaction that, according to authors, does not occur by Hofmann elimination, \nbut rather by the displacement of the amine. Because the loss of amine that would leave an \nunstable benzylic carbocation as the counterion for the clay seemed to be unlikely, an \nalternative was proposed that surface hydroxyl groups on the clay can act as a nucleophile to \ndisplace the amine. This would give an oligomeric benzylic alcohol within the clay layers and \nthe loss of hydroxyl group from the clay would mean that a cation is not required in the \ngallery space. Overall, SN2 and a β-elimination mechanisms were considered to explain the \nformation of products during the decomposition of the ammonium and imidazolium salts, but \nfor triphenylphosphine, an α-proton abstraction mechanism was suggested. \nThe following work of Su and Wilkie [41] reported investigations on thermal stability \nand degradation of nanocomposites obtained by melt blending of a wide variety of polymers \nwith previously obtained thermally stable clays. The ammonium salts that used oligomeric \nstyrene (COPS) or an oligomeric methacrylate (MAPS) unit, with a molecular weight of about \n5000, offered high thermal stability – mass loss of less than 7% was noted at 350°C. Both of \nthese new counterions contained two methyl groups, one hexadecyl group and oligomeric \ngroup responsible for enhanced thermal stability of the clay and, ultimately, of the \nnanocomposites. In order to enable the attachment of these units to the nitrogen, these \n 15\noligomers also contained about 5% of vinylbenzyl chloride. Thermogravimetric tests of clays \nmodified with styrene oligomeric chains supported by FTIR analysis of volatile products of \ndegradation evolved at different temperatures allowed to conclude that the presence of clay \npromotes the production of styrene oligomers, rather than monomer. Further, the comparison \nof FTIR spectra of the COPS nanocomposite with the pure polystyrene revealed that first \nappearance of aromatic C–H in the degradation of PS was at higher temperature (about \n380°C) than that observed in COPS clay. The lower stability of the clay was considered to \ncome from thermal instability of the nitrogen–carbon bond, leading to the more facile loss of \nstyrene units. In turn, it was found that degradation of MAPS clay commenced at 250°C with \nthe evolution of monomeric methyl methacrylate, as seen by the C–H stretching and the \ncarbonyl band. An aromatic C–H peak appearing near 275°C was attributable to the loss of \nthe vinylbenzyl chloride units that are attached to the clay. The authors pointed that earlier \nappearance of this band in comparison with pristine polymer in temperature region where the \nHofmann elimination was likely to occur, may indicate C-N bonds as the sites where the \ndegradation was initiated. Interestingly, even at 500°C, one could still see the carbonyl band, \nindicating that the clay was still undergoing degradation, while there was no longer any gas \nevolution found for virgin PMMA at this temperature. It was also noted that the degradation \noccurred in a step-wise fashion, even at ramp rate of 10 or 20 K per minute, contrary to the \nwork of Kashiwagi on thermal stability of PMMA [42], where the rate of heating must have \nbeen as low as 2 K per minute to see the individual steps. Thus, clay must have served in \nsome way as a template to control the pathway of the degradation.  \nThe thermal behaviour of COPS and MAPS nanocomposites showed slightly different \nbehaviour depending on the type of polymeric matrix nanocomposites. In the case of the \nstyrene-containing materials, the presence of clay promotes the production of oligomer, rather \nthan monomer. It was suggested that this change in evolved products may offer an \nexplanation for why some polymers give large reduction in peak heat release rates while \nothers give much smaller reductions. The PS nanocomposites with the MAPS clay degraded \nat lower temperatures than did virgin PS - that was connected with mostly immiscible \nstructure of those materials. Lower initial temperature of degradation was also indicated for \nthe polystyrene nanocomposites with COPS clay. Unlike for only COPS clay, the first peak \nthat was seen in TG-FTIR infrared spectra of the COPS–PS nanocomposite was aromatic C–\nH and not the aliphatic. The amount of clay, and hence the amount of hexadecyl units, were \nthought to be too small to be seen. In a case of high impact polystyrene (HIPS) \nnanocomposites the first appearance of the C–H stretching frequency for both compositions \n 16\nwas about 400ºC. The onset temperature of degradation was lower for the MAPS system, \nhowever, after 50% mass loss the TG curve for MAPS–HIPS crossed that of virgin HIPS \nshowing higher thermal stability (Fig. 7).  \n \nFig. 7 \n \nThe authors observed no influence of the degree of nano-dispersion, low in the MAPS \ncomposition and high in the COPS composition, on the degradation pathway. The TG curves \nof ABS and both COPS–ABS and MAPS–ABS systems showed slightly enhanced thermal \nstability. \nRecently, different types of oligomeric surfactants, such as ammonium salt of methyl \nmethacrylate oligomer or ammonium salt of oligomeric copolymer from lauryl acrylate and \nvinylbenzyl chloride, have been synthesized – Tab. 1.  \n \nTab. 1 \n \n Some of the new surfactants were characterised by significantly increased thermal \nstability (in comparison with commonly applied  low molecular weight ammonium \ncompounds) and were applied to obtain polymeric nanocomposites with enhanced thermal \nstability. The major advantage of this approach is the ability to design the surfactant not only \nwith high thermal stability but also with improved compatibility with a given polymer matrix. \n \n \n2.2. Relations between conditions (methods) of nanocomposites preparation, \nmorphology and thermal stability \n \nThe relation between the degree of clay dispersion in polymer matrix and the thermal \nstability of nanocomposite material was discussed in many studies, e.g. [43,44]. The higher \ndegree of exfoliation was achieved, the stronger enhancement of thermal resistance could be \nexpected. The degree of exfoliation was found to depend on concentration of MMT and was \nfollowed by changes in thermal stability - the maximum of thermal stability enhancement was \nobserved for nanocomposites with lower filler content (1–2 wt. %) at which homogeneous \nexfoliation and random dispersion of nanoparticles was maintained. \n 17\nDelozier et al. [45] observed that during the preparation of polyimide (PI)\/clay \nnanocomposites, the decomposition of the organic modifier led to the collapse of the clay \nparticles into larger agglomerates.  It was suggested that this might affect the morphological \nstructure, properties and service life of nanocomposites, again meaning that the thermal \nstability of organic modifier posed significant effect on the preparation, performance and \napplication of nanocomposites. Zheng and Wilkie [15] suggested that the enhanced thermal \nstability of styrene-containing (co)polymers in the presence of poly(ε-caprolactone) (PCL) \nindicated degradation inhibition. There was very little temperature difference between 10 and \n50% degradation, which showed the steepness of the degradation curve. The temperatures of \nboth 10 and 50% of degradation were enhanced for the nanocomposites relative to the virgin \npolymers. There was apparently a greater enhancement for the clays prepared by melt \nblending of the polymer than for that prepared by in situ polymerisation. This was likely due \nto the higher molecular weight for the processed polymer as compared to the in situ \npolymerised material. \nIn Shah and Paul’s work [46], WAXD patterns revealed shifts in the peak position for \nthe PA 6 nanocomposites and masterbatches relative to that of the pristine organoclay. These \nshifts apparently reflected the net result of two counteracting phenomena occurring \nconcurrently during melt processing - intercalation of the clay galleries by the matrix polymer \nand degradation of the organic component of the organoclay.  TG studies showed that the \norganic component of organoclays began to breakdown at temperatures as low as 180ºC. \nMore degradation occurred in the masterbatch owing to heat dissipation due to combined \neffects of higher filler levels and higher melt viscosity of the virgin high molecular weight PA \n6. This explained the shift of the peak corresponding to a reduction of the interlayer spacing \nby 2–5 Å, as compared to the pure organoclay. In the case of low molecular weight PA 6-\nbased nanocomposites with low filler concentration, the amount of degradation was believed \nto be considerably less and the intercalation of polymer into the clay galleries prevailed since \nthe peak shifts, corresponding to an increase in the d-spacing of the organoclay, stacked by 1–\n3 Å.   \nThe fundamental role of organic modifier is to decrease the cohesion forces of clay \nstacks and change the hydrophilic surface of clay layers into organophilic one to allow the \npolymer macromolecules to intercalate into MMT galleries and form stable homogeneous \nstructure. When unmodified sodium montmorillonite is introduced into non-polar polymer \nmatrix a microcomposite is obtained with large filler particles and no intercalation or \nexfoliation of polymer is usually observed. Such a structure is sometimes called ‘immiscible’. \n 18\nA growing number of reports confirm that high levels of intercalation or\/and exfoliation is \nrequired to achieve significant improvement of nanocomposite material properties. When clay \nlayers are only partly intercalated\/exfoliated and non-homogeneously dispersed, the \nperformance of polymeric material could be similar to other composites with comparable load \nof anisotropic particles of microscopic dimensions. \nKumar et al. observed very little improvement in thermal stability of melt blended \nPMMA\/Na+MMT composites due to limited intercalation of silicate layers [47]. \nSimultaneously, the nanocomposites of PMMA obtained in the same conditions with four \ndifferent organoclays showed significant improvement in ability to withstand degradation in \ncomparison to pure polymer and its microcomposites with Na+MMT. The stabilization effect \nbecame larger with the extent of intercalation. In addition to the structure playing a crucial \nrole in stabilization of polymer nanocomposites, the thermal stability of organoclay was also \nnamed as a cause of slightly lowered Tonset of nanocomposite. The organic modifier of \nammonium type contained a single tallow and two ethanol groups. Due to the presence of \nhydroxyl groups it was highly polar organoclay with a  large level of favorable miscibility \nwith the polymer. However, the organoclays containing a single tallow modifier with a \nethylhexyl group (which showed an onset of degradation at 358°C) and a ditallow modifier \n(which showed an degradation onset of 363°C) yield the best thermal characteristic of the \nnanocomposites compared to the organoclay containing a single tallow modifier with two \nethanol groups.  \n Similar observations were made for poly(ε-caprolacton) (PCL)\/clay nanocomposites \nobtained by in situ polymerization [48]. The lowest thermal stability was observed for \nPCL\/Na+MMT systems, while thermal stability of organoclay\/PCL nanocomposites was \nconsiderably higher. The degree of improvement depended on the extent of clay exfoliation \nand that in turn was connected with the ability of ammonium compound used to modify MMT \nto improve interphase properties. The chemical structures of alkylammonium compounds \nused in this study are presented in Fig. 8. The ability of compound (b) to form covalent bonds \nwith propagating polymer chains facilitated exfoliation. \n \nFig. 8 \n \n The degree of intercalation\/exfoliation and distribution of silicate layers was found to \nchange with nanofiller load. Exfoliation was more likely to occur at lower clay content (about \n1wt. %) and intercalated structure was basically observed for nanocomposites with higher \n 19\nclay content. The increasing number of dispersed MMT layers per volume unit of polymer \nmatrix causes that clay particles arrange in more regular structure.  \nThe work by Guo and co-workers [49] on thermal properties of epoxy\/MMT hybrid \nmaterials also emphasised that the dispersion of MMT is crucial for the thermal stability of \nnanocomposites and, as it was confirmed in previous studies [50,51] that the dispersion was \ninfluenced by the nanofiller content, the thermal stability changes were observed with \nincreasing clay loading. When the OMMT loading was lower than 8 phr, the samples \nexhibited higher thermal stability than those with higher OMMT loading. Furthermore, it was \nfound that the function of activation energy of degradation of the epoxy nanocomposites \nversus MMT loading shoved a maximum at 6 phr MMT (Fig. 9).  \n \nFig. 9 \n \nThe changes of the activation energy might be due to the structure evolution as the OMMT \nloading increases. The researchers attributed the observed phenomena to the fact that when \nthe OMMT loading was relatively low (below 8 phr), exfoliated layers are the dominant \nstructures developed in nanocomposite. The increasing OMMT content was followed by \ngrowing number of delaminated layers strengthening the retardant effects to heat and oxygen \nin the epoxy matrix. When the OMMT loading increased further, the nanocomposites \ndeveloped an exfoliated\/intercalated structure. In effect, the number of exfoliated silicate \nplatelets, which are thought to be more effective in blocking heat and oxygen than tactoids, \ndecreased with the OMMT loading. As a consequence, the activation energy tends to decrease \nwhen the OMMT loading was higher than 8 phr. Since the tactoids still showed the retardant \neffects to heat and oxygen, the activation energy of the sample with exfoliated\/intercalated \nstructure was still higher than that of the neat epoxy resin. \nStudies on nanocomposite materials based on plasticized poly(L-lactide) and organo-\nmodified MMT reported an increase in thermal stability with the clay content [51].  \nMaximum thermal stability was obtained for a loading of 5 wt. % in clay, however, further \nincreases in the filler content lead to a decrease in thermal stability. A very similar thermal \nbehaviour has been reported for EVA-based nanocomposites [50], for which optimal thermal \nstabilization was obtained at around 3 wt. % filler content. Such behaviour was explained by \nthe relative extent of exfoliation\/delamination in function of the amount of organoclay. \nIndeed, at low filler content, exfoliation dominates, but the amount of exfoliated silicate \nlayers is not sufficient to promote any significant improvement of the thermal stability. It was \n 20\nclaimed that increasing the filler content lead to relatively more exfoliated individual \nparticles, and increased the thermal stability of the nanocomposites. However, at filling \ncontent above ca. 5 wt. %, complete exfoliation of such high aspect ratio silicate layers got \nmore and more hindered because of geometrical constraints within the limited space \nremaining available in the copolymer matrix - and no more increase in thermal stability was \ndetected. \n For a series of polyethylene-based nanocomposites obtained by Zhai and co-workers \nonly the system with 1 wt. % of organoclay (PE1) had good thermal stability comparing with \nthe pristine polymer [52]. For nanocomposites with 3 and 5 wt. % of organoclay thermal \nproperties have not been much changed in comparison to PE. Good dispersion of organoclay \nin polymer matrix in  PE1 might contribute to this enhancement – its exfoliated structure was \ncomposed mainly of monolayers while MMT formed stacks at higher loadings. \nIn polyurethane-based nanocomposites the maximum thermal stability enhancement \nwas observed for composition with 1wt. % of dispersed organoclay which was characterized \nby exfoliated structure [53]. It was also observed that when the extent of exfoliation grew (the \ninterfacial area between silicates and polyurethane increased), the glass transition temperature \n(Tg) of the hard-segment phase of polyurethane nanocomposites increased, indicating that \nnano-sized silicates hindered the movement of molecules in the hard-segment phase. Further, \nWang et al. showed that the elastomeric polyurethanes containing 3% of OMMT exhibited \nthe best thermal stability because of uniform dispersion of the organic silicate layers [54]. \nSimilar behaviour of polypropylene nanocomposites was explained as a result of more \nintimate contact of polymer and clay surface and therefore stronger impact of the clay on \npolymer degradation process [55] [56]. \nOn the other hand, early studies by Burnside and Giannelis have indicated that the \nintercalated polyimide-clay nanocomposites are more thermally stable than the delaminated \nnanocomposites [57]. This observation was surprising since both samples contained the same \nmass fraction of clay (10%) and the clay in the delaminated nanocomposite had more \nhomogeneous distribution. \nStretz et al.  observed that  the PC\/MMT nanocomposites extruded by low and high \nshear extruders showed differences in structure [58]. The higher degree of exfoliation led to \nhigher surface contact between PC and clay, which apparently also led to color development \nand molecular weight degradation. The results of flame testing indicated that processing \nleading to more exfoliation of MMT caused two competing effects: reduction of the peak heat \nrelease rate because of exfoliated platelets, versus degradation processes which increased the \n 21\nheat release rate. The dominate effect in PC nanocomposites with low MMT content and\/or \nlow shear samples was reduction of the initial peak heat release rate (PHRR) while the \ndominate effect experienced with high MMT content or high shear samples was an increased \nPHRR. It was indicated that the effect of intercalation versus exfoliation on thermal stability \nof the composite should be related to reactivity of clay surface or degradation products of the \nsurfactant and polymer matrix. More discussion on the influence of OMMT on the thermal \ndegradation routes of different polymers will be presented in section 3, dealing with  \nmechanisms of thermal stability improvement. \nThe methods and conditions of nanocomposite preparation as well as processing are \namong the most important factors determining the degree of MMT layers \nintercalation\/exfoliation and spatial arrangement that can further influence the thermal \nbehaviour of composite material. The particular blending process which is used to prepare \nnanocomposites, as well as the time of annealing after the nanocomposite has been formed, \ncan have a significant influence on the structure, and hence the properties of the \nnanocomposite.  \nWhen preparing polymer\/clay nanocomposites using either in situ polymerization or \nmelt intercalation, a certain temperature is needed in the processing. The decomposition \ntemperature of OLS is a key-processing factor since processing of the nanocomposites as well \nas the initial melt blending of the OLS and polymer is near the thermal limits of the organic \nmodifiers. In addition to common detrimental aspects of degradation, the resulting products \nmay play a major and yet to be determined role in the formation of the exfoliated \nnanostructure.  \nRecently, Fornes et al. [59] investigations have confirmed that the addition of MMT tends to \nincrease the matrix melt viscosity and, thus, the torque; however, degradation of the organic \ncomponent of the organoclay leads to matrix molecular weight degradation, which lowers the \nBrabender torque. The study concluded that for a given organoclay, the level of polymer \nmolecular weight reduction was greatest for nanocomposites based on high molecular weight \nPA 6 materials owing to the greater exposure of the surfactant to the PA 6 caused by \nincreased levels of organoclay exfoliation. Similar matrix degradation has been reported for \nnanocomposites based on poly(ethylene terephthalate) (PET) [60] and polycarbonate (PC) \n[61] prepared by melt processing. One work observed that at 2% MMT loading, the viscosity \neffects of matrix degradation apparently exceeded the intrinsic increase caused by addition of \nMMT, thus, shifting the curve lower [46]. At higher loadings (6.5%), the viscosity \nenhancement gained by the addition of MMT, evidently exceeded the reduction resulting \n 22\nfrom polymer degradation in low Mw PA 6. On the other hand, at the same high loadings in \nhigh Mw PA 6, the two effects seemed to offset each other resulting in little change in the \ntorque values. Elsewhere, the 30 to 40% reduction of PA 6 molecular weight was confirmed \nby GPC and 13C NMR analysis after injection moulding of the PA 6 nanocomposites (in situ \npolymerized, 5 wt. % content of MMT modified by 12-aminolauric acid) [62]. \nStudies have established that the presence of acetic acid as a product of thermal \ndegradation in processed EVA nanocomposites was confirmed by the appearance of \ncharacteristic IR shoulder around 1708 cm-1, which is a typical carbonyl absorption band of \nacids [63]. It was stated that the presence of acetic acid in galleries of organoclay dispersed in \nthe polymer matrix arose from the deacylation of EVA that occured during nanocomposite \ncompounding. Moreover, the absorption at this frequency registered for nanocomposites did \nnot correspond with IR spectra of processed pristine polymer indicating a catalytic role of \nOMMT. The study also attempted to connect the changes in thermal stability of the hybrid \nmaterial with its structure features modified by processing operations, such as drawing of hot \nmelt extruded through the capillary die. The domain size of the dispersed clay phase and the \nformed voids were observed to decrease slightly with increasing drawing ratio (DR) - when \nDR = 3 the 4 wt.% hybrid fibre contained fine clay phases 50–60 nm in diameter, while for \nDR = 9 the domain sizes were slightly smaller (40–50 nm) in diameter.  \nMore visible influence of the processing on structure properties was shown to occur \nwhen PET was used as a matrix [64]. There were evidences that higher stretching of the fibre \nduring the extrusion lead to better dispersion of the clay and a more delaminated structure. \nThe observed changes in structure due to processing operations might be reflected in thermal \nstability since the influence of MMT on initial temperature of degradation and char formation \nwas more significant in demonstrating better dispersion in PET nanocomposites.  In different \nwork, concentration-dependent synergic effects were observed in the thermal and structural \nproperties of poly(vinylidene fluoride-co-trifluoroethylene) (P(VDF-TrFE) nanocomposites \nobtained by solution blending [65,66]. For compositions of 18 and 25% OLS, the observed \nresidue at 1000°C was greater than the expected value, however in the 10% OLS composition \nthe residue at 1000°C was less than anticipated. The same was true for the nanocomposite \nfilms of P(VDF-TrFE) with higher OMS contents that exhibited substantial increase in weight \nremaining, both at 500 ºC and at 1000ºC, compared to that predicted from the behaviour of \nthe neat copolymer and OLS.  \nElsewhere, studies on PP-based nanocomposites by Tidjani et al. [67] indicated that \ntheir intercalated form showed a noticeable enhancement of the thermal stability, compared to \n 23\npure PP and polypropylene-graft-maleic anhydride copolymer (PP-g-MA).  However, no \nsignificant difference was found between melt blended nanocomposites and those prepared \nvia solution blending process. Also, the amount of non-volatile residue did not change upon \nirradiation for the nanocomposites though it did for PP, however the amount of non-volatile \nresidue was greater for the melt-blended nanocomposites than for the solution blended ones. \nDuring the photo-oxidation of PP [68], crosslinking reactions were more important than chain \nscissions at the beginning of UV exposure, but the reverse was also true at later times in the \nirradiation, leading to suggestion that the crosslinking reactions that occurred upon UV \nirradiation were responsible for the variation in char formation. As it was expected, the onset \ntemperature of the degradation decreased, since it depends on the strength of the bonds of \nmolecules, which might decrease because the photo-oxidation created thermally weak bonds, \ne.g. in hydroperoxides and peroxides, that could initiate the thermal degradation. Since the \nformation of the nanocomposites appeared to have no effect on the photo-stability, the \ndecrease of the onset temperature with UV irradiation time was to be expected. Finally, the \nenhancement of the thermal stability of the nanocomposites was not significantly dependent \nupon the particular type of organic modification that was used. \nA different work observed that the PP–g–MA– MT2EtOH blends produced in air \nperformed poorly compared to those prepared in N2 conditions - ammonium cation of the clay \nof organophilic montmorillonites (MT2EtOH) contained a methyl group (M), tallow (T), and \ntwo hydroxyethyl (EtOH) [69]. This led to suggestions that at the processing temperature, \nhydroxyethyl oxidation, which involves a hydrogen abstraction, occurred. Aldehyde and \ncarboxylic acid might have been formed or the radical produced (EtO•) could abstract a \nhydrogen from the polymer chain leading to a macroradical. Afterwards, the macroradical \nformed combined with O2 to give a peroxy radical, then hydroperoxides by H-abstraction in \nthe presence of air ( Fig. 10).  \n \nFig. 10 \n \nIt is worth noting that the FTIR spectra of PP–g–MA– MT2EtOH produced in air did not \ndisplay any increase of the bands at 3400 cm-1, which corresponds to the hydroperoxides \nformation that was thought to be due to the low clay content. However, this proposed model \nor a similar one for the oxidative processes during preparation is highly probable. A \ncomparison, which was done for aliphatic PA\/clay composites [70], revealed that no influence \n 24\non the thermal stability was expected for immiscible tactoid blends and a larger influence for \nintercalated nanocomposites than for exfoliated ones. \nIn other work  it was found that the use of MMT that was exchanged with surfactant, whose \nconcentration was significantly higher than the total cation exchange capacity value (CEC), \nintensified the surfactant decomposition during processing [71]. As a result, the dispersion of \nMMT in polyethylene terephthalate glycol (PETG) was changed from intercalated (for \nnanocomposites with MMT treated with 95 meq⋅(100g)-1 (MMT-95)) to immiscible for MMT \nwith 125 meq⋅(100g)-1 (MMT-125). As a result of the loss of organic modifier during \nprocessing, platelet-to-platelet  interactions occurred which result in close packing and a \nhighly oriented structure. Despite the partially immiscible structure, the nanocomposites \ncontaining MMT-125 exhibited higher ultimate tensile strength and modulus due to high \norientation of MMT platelets and forced orientation of polymer chains  trapped between the \noriented OLS. \n For nanocomposites obtained through in situ polymerization and melt blending,  \nsignificant differences could be observed in terms of initial temperature of  degradation, \nalthough these nanocomposites were comparable in terms of clay concentration and structure \n[15,72]. The nanocomposites obtained through melt blending start to decompose at higher \ntemperatures than in situ polymerized materials that are characterised by low molecular \nweight.   \n \n2.3. The role of interfacial interactions, barrier and catalytic effects of \nmontmorillonite in polymer degradation processes \n \nThe role of interactions between macromolecules and the surface of clay layers was pointed in \nmany studies as one of the most important factors influencing the thermal stability of \npolymer\/montmorillonite nanocomposites. Ke et al. claimed that the nanoscale particles will \nshow a stronger interaction with the matrices of PET, when the external temperature \napproaches the degradation temperature of polymeric matrix, which explained the results of \nenhanced degradation temperature [73]. According to Chow et al. [74], Ide and Hasegawa \n[75], Sathe et al. [76] and Coran et al. [77] when MAH-g-PP is added to PA 6\/PP blends, the \nanhydride group of MAH reacts with the terminal amino group of PA 6 during melt mixing, \nresulting in the formation of PA 6-g-PP copolymer. Similarly, it was believed that hydrogen \nbonding could form between the amide group of the PA 6-g-PP copolymer and the \noctadecylamine group of the organoclay intercalant. It was noted that this amide–amine \n 25\nreaction could happen when the organoclay was exfoliated in the PA 6\/PP matrix; \nsubsequently, the octadecylamine (intercalant) was capable to form a chemical linkage with \nPA 6-g-PP copolymer. Thus, interfacial interaction gave rise to the synergic effect to \nproperties for the MAH-g-PP compatibilized PA 6\/PP nanocomposites.  Pozsgay et al. [78] \nproved that N-cetylpyridinium chloride was stable at the temperature of processing and \nconsiderable weight loss was not detected below 250°C. A major conclusion of the work was \nthat exfoliation was dependent on surface coverage of the filler with organic modifiers and \noccurred only above a critical gallery distance, which corresponded to the thickness of two \naliphatic chains. Although exfoliation of the silicate was governed by its organophilization \nand gallery structure, composite properties were dominated by interfacial interaction. In \nanother experiment, the strong interactions between MMT and sulfonated PET ionomers were \nresponsible for better dispersion of silicate and improved thermal resistance of the ionomer \nnanocomposites in comparison to nanocomposites of PET without functional groups [79].  \nIn another study, the improvement of thermal stability of the epoxy\/clay \nnanocomposites was attributed to the presence of the clay nanolayers, which acted as barriers \nto minimize the permeability of volatile degradation products out from the material [80]. As a \nresult, it was concluded that thermal properties of nanocomposites were superior to pure \nepoxy resins due to a barrier property of layered silicate and an improvement of interfacial \nadhesion by acid–base interaction. In addition, Park et al. [81] had earlier on reported that the \ncharacter of epoxy resin is an electron-donor, while the organoclay acted as an electron \nacceptor. Therefore, it was thought that the thermal stability of the nanocomposites was \ninfluenced by specific interactions between dispersed clay and epoxy resins. \nMa et al. [82] prepared exfoliated\/intercalated nanocomposites based on two steps, i.e. \npreparation of treated MMT solution and solution blending with polydimethylsiloxane \n(PDMS). Although elemental analysis showed no residue PDMS, NMR proved that residue \nPDMS still existed in the solution. The residue PDMS was believed to graft onto the MMT \nlayer surface via condensation of hydroxyl groups of PDMS and those that existed on MMT \nsurface. Lower relaxation time of end-capped CH3 groups of alkyl ammonium grafted onto \nlayer surface via ion exchanging in the solution showed that the layer spacing was increased \nsignificantly or even exfoliated. The TG analysis showed an increase in decomposition \ntemperature of 70°C that was observed for PDMS\/MMT nanocomposite while SBR\/MMT \nnanocomposite showed only 15°C of decomposition temperature increased with the same \namount of MMT. The nanocomposites displayed delayed decomposition temperature \n 26\ncompared to the pristine polymers, which was attributed to hindered diffusion of the volatile \ndecomposition products.  \nThe research work by Su et al. [40,41,83] showed that the type of clay and its \nchemical composition may have an influence on the thermal stability of nanocomposites. The \nobservation was made that MMT was more effective in improving the thermal stability than \nhectorite and fluorohectorite. Moreover, at the lower amounts of clay, MMT seemed to have a \nsynergic effect on thermal stability with tetrasodium pyrophosphate (TSPP). In turn, at low \nhectorite loadings, the thermal stability of the nanocomposites was lower than for PMMA and \nthe addition of TSSP showed no effect on thermal stability in this system. The presence of \nunmodified fluorohectorite clay in PMMA decreased the onset temperature of thermal \ndegradation. In that case all the DTG curves were the same, regardless of clay loadings and \nthe presence of TSPP. It was also suggested that the improvement of the thermal stability in \nPMMA nanocomposites and the different behaviours of different types of smectites might be \nassociated with reactivity of different metals with polymeric radicals (‘radical trapping \nmodel’) and the different thermal stability of the resulting intermediate products. Clays were \nable to act as free radical scavengers and traps by reacting with the propagating or initiating \nradicals [84]. The results indicated that both iron and aluminium contributed to the \nimprovement of thermal stability of PMMA nanocomposites, but iron was more effective. \nAlthough it was assumed that the improvement of polymeric nanocomposites’ thermal \nstability partially results from the barrier properties, a dependence of thermal stability on clay \nsurface dimensions was not observed in this study.  \nIn contrast to unmodified MMT Na+-based composites, TG profiles recorded for \nplasticized poly(L-lactide) (PLA) filled with unmodified Na+-MMT have reportedly shown \nthat increasing the filler content triggers a substantial continuous decrease in thermal stability \n[51]. As the unmodified MMT level varied from 1 to 10 wt.%, the maximum of TG derivative \ncurves was shifted from 370°C down to 325°C, which denoted the formation of shorter PLA \nchains as the clay content increased. To explain this behaviour, researchers remarked that the \nNa+ cations present in the interlayer spaces are highly hydrated cations. At high temperature, \nsome water release could be responsible for the PLA chain degradation by hydrolysis. \nAccording to the experimental results, at higher Na+-MMT content, chain cleavage by ester \nhydrolysis reaction was more pronounced, leading to the formation of much shorter PLA \nchains, known to degrade at lower temperature.  \nIn other work, PMMA\/Fe-MMT nanocomposites were compared with PMMA\/Na-\nMMT nanocomposites and the onset temperature of the degradation was clearly lower for the \n 27\nformer than for the latter -  it was connected with the catalytic effect of metal present in clay \n[85]. Bonding of PMMA with the formed char prevents the Fe-MMT nanocomposites from \ndecomposing in higher temperature range and it is manifested by higher midpoint \ntemperatures of degradation than for nanocomposites containing Na-MMT. \nAlso, during the modification of PVC, some metal cations present between MMT \nlayers catalysed dehydrochlorination of PVC chains [16]. Therefore, the decomposition of \nalkylammonium salts and subsequent dehydrochlorination of PVC resin during processing \nmight have been the cause for the degradation of PVC\/organic MMT systems. When \ncomparing PVC\/Na +-MMT with PVC\/organic MMT nanocomposites, it was found that the \nformer was more stable than the latter during melt processing. Even at 10 wt. % content of \nNa +-MMT, the former system still kept good processing stability. In contrast, above 5 wt. % \nof organic MMT content, the latter nanocomposites degraded severely and even became black \nin color. Therefore, a conclusion was drawn as that the existence and decomposition of \nalkylammonium salts play an induced role on the degradation of PVC. With the content of \nMMT increasing, due to clay aggregation and partial discoloration of PVC, the haze of the \ncomposites increased and the optical clarity decreased correspondingly. Therefore, it was  \nproposed that MMT contents should be kept below 5 wt. % in order to realize good optical \nclarity, processing stability and mechanical properties.  \nBoth Trilica et al. [86] and Wang et al. [87] studied the effect of dioctylphtalate \n(DOP) on the structure and thermal stability of the PVC\/organic MMT nanocomposites, and \nall agreed that organic MMT played an important role in inducing the degradation of PVC. \nTrilica et al. [86] took DOP as co-intercalant for organic MMT and PVC because they found \nalkylammonium salts between the interlayers of organic MMT, which can catalyze PVC \ndegradation. Although DOP prevented the degradation of PVC, the MMT only acted as a \nplasticizer carrier and lack of specific interaction between nanofiller particles and organic \nmodifier caused significant enhancement on mechanical and thermal properties. \nQin et al. [88] showed that the catalytic decomposition effect of MMT and the barrier \neffect of the silicate layers is much more evident in isothermal oxidation experiments. At \n360°C in air atmosphere, the volatilisation rate of either the nanocomposite or the \nmicrocomposite was faster than that of pure PA 66 at the beginning; thereafter, the weight \nloss was slowed down in both composites compared to the pure PA 66, but with a large effect \nin the nanocomposite. It indicated that the nanocomposite had higher thermal stability than \nthe microcomposite. This showed that the exfoliation of the silicate layers in polymer matrix \nmade the barrier effect more remarkable thus decreasing the heat release rate (HRR) of PA 66 \n 28\nmatrix. The influence of the nanocomposite was more effective than that of the \nmicrocomposite due to the barrier effect of the exfoliated nano-structure in the \nnanocomposite. It was observed that the nanocomposite and the microcomposite had a shorter \nignition time than pure PA 66 and the initial HRR was higher for the first 100 s in the \ncombustion. This was similar to the isothermal TG profiles in air, showing that the addition of \nMMT can accelerate the ignition of PA 66 matrix, probably due to the catalytic \ndecomposition effect of MMT to polymer matrix. \nMost recently, Tang et al. [55] studies on PP\/clay nanocomposites found out that the \nnanocomposites showed both a decrease in 5% temperature loss and improved char \nformation. It was suggested that the probable reason was that in nanocomposites the intimate \ncontact between the polymer molecules and the atoms of the inorganic crystalline layers was \nmore extensive than that in a microcomposite, and at the same time, there was a catalytic role \nplayed by the layered silicates deriving from the Hofmann reaction of hexadecyltrimethyl \nammonium bromide, which accelerated the charring process at the beginning of the \ndegradation as proposed earlier on by Zanetti et al. [89]. Further studies by TEM showed the \nsilicates were well dispersed (exfoliated) in the polymer matrix. The Tmax and char residue of \nnanocomposites tended to increase compared with those of microcomposite and polymer \nmatrix. Remarkable effects found on the nanocomposites were associated to an ablative \nreassembling of the silicate layers which may occur on the surface of the nanocomposites \ncreating a physical protective barrier. \n \n3. The mechanisms of thermal stability improvement by nanodispersed \nmontmorillonite layers \n \nThe mechanism of the improvement of thermal stability in polymer nanocomposites is not \nfully understood yet. It is usually well accepted that the improved thermal stability for \npolymer\/clay nanocomposites is mainly due to the formation of char which hinders the out-\ndiffusion of the volatile decomposition products, as a direct result of the decrease in \npermeability, usually observed in exfoliated nanocomposites [36,70,90-92]. Despite this, the \nexact degradation mechanism is currently not clear - such a behaviour is probably associated \nwith the morphological changes in relative proportion of exfoliated and intercalated species \nwith the clay loading. At low clay loading (ca. 1 wt. %), exfoliation dominates but the amount \nof exfoliated nanoclay is not enough to enhance the thermal stability through char formation \n[90].  When increasing the clay concentration (2–4 wt. %), much more exfoliated clay is \n 29\nformed, char forms more easily and effectively and consequently promotes the thermal \nstability of the nanocomposites. At even higher clay loading level (up to 10 wt.%), the \nintercalated structure is the dominant population and, even if char is formed in high quantity, \nthe morphology of the nanocomposite probably does not allow for maintaining a good \nthermal stability. However, it is known that the chemical nature of the polymers, the type of \nclays and their modification route play an important role in their degradation behaviour. \nTherefore, care should be taken when attempting to generalize conclusions drawn from a PA \n11-based system to nanocomposites formed from another polymer system [93]. \nComparing the results obtained over the thermal degradation, it was evident that the \neffect of exfoliated silicate layers was more pronounced during thermal oxidation than \nthermal degradation. Therefore, the mass loss decomposition started almost at the same \ntemperature for PP–g–MA\/octadecyl trimethyl amine-modifed MMT (PP-g-MA-OD3MA) \nand PP–g–MA, but, later on, a clear shift up to 250°C was displayed - such behaviour is \ntypical for a barrier effect due to the remaining silicate layers. Consequently, it was concluded \nthat they acted as diffusion barriers for the oxygen. Thus, the kinetics of decomposition was \ndelayed with similar starting temperatures of decomposition. Therefore, for the \nnanocomposite beside the thermo-oxidative degradation, thermal decomposition seemed to be \nprobable due to the presence of silicate layers that hinder the diffusion of oxygen. Then, \nchange in the chemical reaction was assumed as a significant difference in the decomposition \nof the real nanocomposite in comparison to PP–g–MA and the microcomposites, respectively. \nThese results and interpretation are in good correspondence with the results found for the \nthermal and thermal oxidative decomposition of poly(vinyl acetate)-layered silicate \nnanocomposites [94]. Comparing the derivative curves, it was observed that PP–g–MA–\nOD3MA decomposed via a single step degradation process. Similar to the thermal behaviour, \nthe thermo-oxidative decomposition did not show an enhanced char formation due to the \npresence of clay in the polymer matrix. Therefore, not only a significant heat shielding effect \nbut also a gradual decomposition of polymer chains in close contact with clay layers were \nimprobable. Even further, studies have shown that the lower flammability of polymer\/clay \nnanocomposites is not due to retention of a large fraction of fuel, but due to the formation of \ncarbonaceous char in the condensed phase [70,95-98]. The nanodispersed lamellae of clay in \npolymer matrix result qualitatively in a spatially more uniform and thicker char during \ndecomposition. \n The accelerated char formation due to presence of dispersed montmorillonite layers \nwas again indicated as a mechanism of thermal stability improvement in the Agag and \n 30\nTakeichi [99] development on stearyl ammonium modified MMT-based nanocomposites. The \nstudies to monitor the thermal properties of the MMT nanolayers dispersed in the \npolybenzoxazine matrix revealed that only very small amount of clay was effective to \nimprove the weight residues for nanocomposites.  The char yield at 800°C increased by ca. \n20% with 5% MMT content in the nanocomposite. The thermal stability of the \nnanocomposites was improved by the presence of dispersed MMT nanolayers in comparison \nwith the pristine polybenzoxazine. This enhancement in the thermal properties was also \nascribed to the presence of the MMT nanolayers, which acted as barriers to minimize the \npermeability of volatile degradation products out from the material. In addition, isothermal \nTGA was performed to give more evidence about the improvement of the thermal stability of \npolybenzoxazine in the presence of MMT. The nanocomposites showed a delayed \ndecomposition compared with the pristine polybenzoxazine due to the homogeneous \ndistribution of the silicate sheets into the polymer matrix and consequently improved the \nthermal properties of the nanocomposites as explained before. The improved char formation \nwas again reported by Becker et al. [100] since the nanocomposites showed slightly reduced \nthermal stability, as indicated by a slight decrease in onset of degradation, whilst the final \nchar concentration increased for greater organoclay concentrations.  \nInteresting observations concerning char formation were made in Kashiwagi and co-\nworkers work [101]. They have noticed differences in a sequence of events during non-\nflaming gasification of pure polyamide and PA\/MMT nanocomposites containing 2 and 5 wt. \n% of nanofiller at a heat flux of 50 kW\/m2. With increasing amount of montmorillonite the \nintensity of protective floccules formation on the sample surface also increased. The analysis \nof the protective floccules, collected at various sample mass losses, showed that up to 80% by \nmass of the floccules consisting of clay particles. The remaining 20% consisted of thermally \nstable organic components with possible graphitic structure. Furthermore, clay  particles were \nstacked and the d-spacing of the clay platelets was in the range of 1.3–1.4 nm. Two possible \nmechanisms were possible that led to the accumulation of the initially well-dispersed clay \nparticles on the burning\/gasifying sample surface. One was migration of the polymer resin \nfrom the surface by pyrolysis with de-wetted clay particles left behind and further an \naggregation of MMT layers to form stacks after the degradation of the organic treatment on \nthe clay surface had made them more hydrophilic and less compatible with the resin. Another \nmechanism is the transportation of clay particles pushed by numerous rising bubbles of \ndegradation products and the associated convection flow in the melt from the interior of the \nsample toward the sample surface. Simultaneously, bubbles pushed the accumulated clay \n 31\nparticles outward from the area where they were burst. This led to formation of the island-like \nstructure of the sample surface instead of forming a continuous net-like structure of a clay \nfilled protective layer. Therefore, both PA 6\/clay nanocomposites did not produce sufficient \namounts of protective floccules to cover the entire sample surface and vigorous bubbling was \nobserved over the sample surface which was not covered by the protective floccules. \nOn the other hand, Tidjani et al. [69] investigations on PP–g–MA layered silicate \nnanocomposite suggested that the presence of the clay exerted only a minor effect on the \nthermal degradation. This result corresponded well to the residues found, which hardly \nshowed any additional residue forming due to an enhanced char forming of the polymer \nmatrix in the presence of clay. In fact, this effect was well below 5% additional char \nformation. Consequently, the residue might not have been able to insulate the underlying \npolymer from the heat effectively, thus, a heat shielding effect was of minor importance in the \ninvestigated systems as well as a contribution of alternative polymer decomposition due to \ninteractions with the clay layer that was typical for confined intercalated structures. It was \nconcluded that the clay layers worked as diffusion barriers in the exfoliated systems of PP–g–\nMA layered silicate nanocomposite and slightly delayed the decomposition process. \nFurthermore, the mobility of early decomposition products seemed to be hindered, whereas \nfor increasing conversion no influence on the decomposition was proven.  \nVaia et al. [102] experimental work observed that relatively tough, inorganic char \nformed during ablation of the poly(ε-caprolactam) nanocomposites. This refractory char \nresulted in an order-of-magnitude decrease in the mass loss rate relative to the neat polymer, \neven for as little as 2 wt. % exfoliated layered silicate. This enhanced ablative performance \nwas not related to an alteration of decomposition kinetics but instead was associated with the \npresence of the silicate layers. The work reported that the presence of the exfoliated silicate \nonly minutely altered nonisothermal decomposition kinetics in poly(ε-caprolactam), which \nwas dominated by chain scission through the alkyl amide bond via a free radical mechanism. \nThis contrasted other nanocomposites, which exhibited improved nonisothermal \ndecomposition. Thus, the role of the dispersed silicate in thermal decomposition of a polymer \ndepended critically on the specific mechanisms associated with the polymer degradation \nreaction. The improvement in ablative performance of these nanocomposites relative to the \nneat polymer or traditional filled systems with a comparable inorganic fraction was associated \nwith the char-forming characteristics of the nanocomposites. The spatially uniform \ndistribution of aluminosilicate layers on the nanoscale resulted in the formation of a uniform \ninorganic char layer at a relatively low fraction of inorganic component. This nanoscopic \n 32\nmorphology was comparable to the length scale of the decomposition and char-forming \nreactions determined by the temperature profile and the diffusivities of the reactants and \nproducts. Thus, the reported work suggested that a uniform supply of inorganic precursor to \nthe char was available during decomposition. In contrast, the localization of inorganic species \non the micron-scale associated with traditional filled systems required a higher loading for the \nformation of a uniform inorganic char at the surface [102]. At loading fractions comparable to \nthe nanocomposites, large regions void of inorganic precursor were present resulting in \nlocally, nonuniform erosion rates leading to rough surfaces more susceptible to mechanical \ndegradation. The type of organic modification on the silicate surface and specific interactions \nbetween the polymer and the silicate surface such as end-tethering of a fraction of the polymer \nchains through ionic interactions to the layer surface only minutely altered the ablative or \nchar-forming behaviour of the nanocomposites. Layer concentration, size and degree of \ndispersion were the dominant factors. The report suggested that the enhancement in ablative \nperformance should be a general observation for exfoliated polymer layered silicate \nnanocomposites and may also be observed for other nanocomposite systems, such as \ndispersed nanoparticulate, e.g., TiO2, SiO2 – polymer blends. The formation of the protective \nlayer, the char-forming reactions and ablative reassembly of clay during thermal degradation \nand combustion has also been observed even for polymers that are not showing char forming \ntendencies, such as PE and PP. Generally, char formation during polymer degradation is a \ncomplex process; it occurs in several steps, which include conjugated double bond formation, \ncyclisation, aromatization, fusion of aromatic rings, turbostratic char formation and, finally,  \ngraphitisation [63]. \nThe complex oxidation chain reactions of organic molecules were schematically \nexpressed by Benson and Nogia [103]. According to proposed mechanism at temperature \nbelow 200°C the oxidation of PE and EVA involves free-radical chain reactions and the main \nproducts are hydroperoxides and oxygenated species (routes A1 and A2 of Fig. 11).  \n \nFig. 11 \n \nAt this temperature, the abstraction of H from R• to give HO2• and olefin (routes B1 and B2) is \nat least 200 times slower than the addition of O2 to R• to give RO2•. Above 250°C, the very \nslow step B becomes rate determining since mechanism A becomes reversible. As a result,  \nabove 300°C the initial rate of oxidation of the polymer begins to decrease. Above 480°C,  \nwhere the rate of oxidation picks up again, the H2O2 can provide a secondary radical source \n 33\nsimilarly as ROOH. In normal condition process A prevails and the thermo-oxidation causes \nchain scission with subsequent volatilization of the polymer. Zanetti [104] noticed that the \nmechanism B seemed to prevail in the polymer nanocomposites where an enhanced \naromatization and a reduced rate of oxidation were observed. Oxidative dehydrogenation \n(route B) leads to conjugated double bond sequences that transform the polymer in a \nconjugated polyene, similar to those formed by thermal deacylation of poly(vinyl acetate) or \ndehydrochlorination of poly(vinyl chloride) that occurs on heating, yielding aromatized \nthermally stable charred structures through inter- and intra-molecular Diels-Alder reactions \n[29]. The thermal behaviour of polymeric nanomaterials in oxidative environment is \ninfluenced by the hindered penetration of oxygen through silicate layers that protect the bulk \nof the polymer matrix. \nHence, Gilman et al. [70,92] reported that the layered silicates appeared to enhance the \nperformance of the char layer, which acted as an insulator and mass transport barrier and \ntherefore reduced the mass loss rate and improved flammability and thermal stability. Yano et \nal. [105] experimental and theoretical work reported that in PI\/clay nanocomposites, the \npermeability coefficient of volatile gases, such as water vapour and He, was remarkably \ndecreased. The observed ‘labyrinth effect’ is also thought to play important role in thermal \nstability improving of polymer\/MMT nanocomposites since composite material having poor \ndispersity of MMT usually exhibit no thermal improvement or the effect is poor in \ncomparison to well exfoliated or intercalated nanocomposites. For example, Lee et al. [93] \ninvestigated the thermal stability of aliphatic PI\/clay nanocomposites and found that an \nimmiscible PI\/clay mixture (i.e. conventional mixture), which contains the same amount of \nsilicate as the intercalated nanocomposites, showed no enhancement in the thermal stability. \nThe structural features of microcomposite where no barrier effect was observed in contrast to \nintercalated nanocomposite material played a crucial role in polymer stabilization.  Burnside \nand Giannelis [57] also reported similar results for polydimethylsiloxane (PDMS)\/clay \nnanocomposites. They found that the PDMS\/clay nanocomposites showed the decomposition \ntemperature higher than the pure PDMS elastomer due to the hindered diffusion of volatile \ndegradation species from the nanocomposites, confirming Yano et al. [105] findings.  \nStudies on the thermal decomposition behaviour of pristine polypropylene (PP) and \ncompatibilizers modified PP\/clay nanocomposites found out that the onset degradation \ntemperatures of the nanocomposites vary from 205°C for maleic anhydrite (MA) modified PP \n(with MA content of 4 wt. % modified composite) to 375°C for PP\/clay nanocomposites \n[106]. The improvement in thermal stability for PP nanocomposites was associated to the \n 34\ninteractions between organic and inorganic phases. It was also concluded that individual \nlayers of exfoliated clay platelets acted as insulator, and the formation of tortuous path \nbetween layers also inhibited the passage of volatile degradation products, hence enhancing \nthe thermal stability of clay-containing  composites. Zhu et al. [107] study on PP\/clay \nnanocomposites found out that the structural iron in the dispersed clay also acted as a trap for \nradicals and hence improved thermal stability.  \nThe changes in activation energy of pure LLDPE and LLDPE\/MMT nanocomposites \nobtained from isoconversional kinetic analysis revealed  some clues on the mechanism of \nthermal stability improvement [108]. The activation energy of the LLDPE nanocomposite  \ngradually increased from 60 to 150 kJ\/mol during the first degradation stage (α<0.6), which \nindicated that the process kinetic is limited by peroxide radical decomposition. At the \nfollowing stage (α>0.6), the activation energy rapidly increased to around 220 kJ\/mol, which \nwas similar to the activation energy obtained by degradation of PE under inert gas, as reported \nin the literature [109]. These observations indicated that the rate-limiting step in the thermo-\noxidative degradation of LLDPE nanocomposites have changed from peroxide radical \ndecomposition to random scission decomposition. By the comparison between thermal \nbehaviour of layered double hydroxides (LDH) and MMT nanocomposites it was found that \nthe MMT nanocomposites had lower effective activation energy at the early stages of thermal \ndegradation because the presence of MMT layers could catalyze the dehydrogenation of \nLLDPE molecule. After that, ceramic-carbonaceous layers formed on the surface of the \nmaterial might act as an efficient mass transport barrier. It was concluded that the nano-\ndispersed inorganic layers cause an anaerobic condition in the samples, as indicated by the \nchange of rate-limiting step in the thermo-oxidative degradation from peroxide radical \ndecomposition to random scission decomposition. These results were consistent with the \nbarrier model mechanism, which suggests that the inorganic layers play a barrier effect on the \ndiffusion of oxygen from gas phase into the nanocomposite’s inferior.  \nThe investigation report by Chang et al. [110] on PET nanocomposites remarked other \nphenomenon playing role in improving the thermal stability of hybrid material apart form the \nmass transport barrier mechanism to the volatile products generated during decomposition. \nOn the basis of the fact that clays have good thermal stability the authors concluded that the \nintroduction of inorganic components into organic polymers could improve their thermal \nstabilities due to the heat insulation effect of the clay layers. For SAN\/MMT system, which \ndid not form an enhanced amount of char, the insulative effect of MMT nanoparticles was \n 35\nalso evidenced by the reduction of backside temperature of a sample in cone calorimetry \nmeasurements [111].  \n In another development, Lee et al. [112] noted that, when polyaniline (PANI) content \nwas above 12.5 wt. %, in PANI\/Na+-MMT conducting nanocomposites, the excess amount of \nPANI chains reside mainly outside the silicate layers of Na+-MMT (free PANI chains) and \nthat the PANI chains intercalated between the silicate layers and the free PANI chains \ncoexisted in the PANI\/Na+-MMT nanocomposites. Thus, it was proposed that the thermal \ndecomposition of the nanocomposites occurred in both confined and free states at the same \ntime. However, the contributions from the free PANI chains were more significant for thermal \ndecomposition because these chains in the PANI\/Na+-MMT nanocomposites are more \nexposed to the heating when compared with the PANI chains intercalated between the silicate \nlayers. It was concluded from the relative shift of temperature at the maximum of the DTG \ncurve that, even in the higher PANI content range, where a large portion of free PANI chains \nexisted, the shielding effect of the silicate layer during the thermal degradation of PANI \nbecame sufficiently dominant, even with 20 wt. % of Na+-MMT content, and then increases \ngradually at Na+-MMT contents above it. In another work, careful comparison of thermal \nbehaviour of PANI\/Na+-MMT nanocomposite (with intercalated structure) with that of the   \nmixture, suggested that the intercalated nanocomposite system was more thermally stable than \nthe simple mixture of unmodified clay and PANI and the pure PANI [113].  It was \nemphasized that the silicate layer with a high aspect ratio effectively acted as a barrier for \nthermal decomposition of PANI chains in PANI\/Na+-MMT nanocomposite compared with a \nphysical mixture. As a result, it was evident that the intercalated nanostructure in \npolymer\/layered silicate nanocomposites was crucial to enhance the thermal stability.  \nBlumstein [114] showed that in poly(methyl methacrylate) (PMMA)\/layered silicates \n(clay) nanocomposites, the PMMA placed between the interlayer spacings of MMT was \nresistant to the thermal degradation under the condition that would otherwise completely \ndegrade pure PMMA. Here this enhanced thermal stability of the PMMA nanocomposite was \nattributed to the restricted thermal motion of the PMMA in the gallery of clay (i.e. improved \nbarrier property).  \nA series of works performed by Vyazovkin et al. has been dedicated to the study of \nthe thermal degradation process of PS-based nanocomposites as well as changes in \nnanostructure influencing the stability enhancement. It was demonstrated that montmorillonite \nlayers enhance the thermal stability of polymers via suppression of the molecular mobility. \nThe investigated PS-based system was obtained via surface-initiated polymerization where \n 36\nmontmorillonite intercalated by monocationic azobisisobutyronitrile-analogue molecule was \nused as an radical initiator and growing polymer chains were grafted onto MMT surface \nthrough initiator molecule. The kinetic analysis of thermal degradation of PS-based \nnanocomposites showed that the whole process demonstrated a markedly larger effective \nactivation energy as compared to that of pure PS. The variation of activation energy Eα versus \ndegree of conversion indicated a change in limiting step of the process. Moreover, on the \nbasis of DSC measurements it has been found that the heat of degradation process in nitrogen \nfor PS-clay nanocomposites with 0.5 wt. % clay content was -670 J⋅g-1 as opposed to -990 J⋅g-\n1 for PS [115]. The change in the total heat suggested a possible alternation of the degradation \nmechanism that may be related to changing a branching ratio of the individual channels as \nwell as to the formation of new degradation products. It should be stressed that barrier and \nradical trapping models successfully explain why the degradation of polymer-clay systems is \nslower, but they do not offer straightforward ways of explaining the changes in the thermal \neffect as well as of predicting changes in the degradation mechanism. Vyazovkin et al. \ndeveloped a new model that linked the increased thermal stability of PS-clay grafted \nnanocomposites to the changes in polymer nanostructure and chain mobility.  Using the DSC \nand DMA methods to measure the relaxation kinetics it was found that the glass transition in \nPS-nannocomposites had a significantly larger activation energy than that in PS. The obtained \nrelaxation data indicated the long chain molecular motion in the PS-clay nanocomposite \nencountered a markedly larger energy barrier than pristine PS. That is at the same temperature \nthe nanocomposite should have lower molecular mobility than the virgin polymer. In other \nwords, translational motion in the polymer-clay system required a larger degree of \ncooperativity. The extra cooperativity in polymer-clay grafted nanocomposites was \nintroduced by the clay sheets that anchor several polymer chains, making their individual \nmotions mutually dependent. Further, on the basis of the heat capacity data, the volume of \ncooperatively rearranging regions for nanocomposites was found to be 1.8 times larger than \nthat for virgin PS [116]. Because the molecular mobility is the major factor that contributes to \nthe transport of reactive species within the polymer, the nanocomposites are likely to have \nlower reactivity and, therefore, greater chemical and thermal stability than virgin polymer. \nRegardless of the increased activation energy of glass transition, measured in lower \ntemperature experiments, the increase in viscosity appears to be commonly observed for \nvarious polymer-clay nanocomposites and has an impact on the kinetics of chemical reactions \nthat occur in viscous media [117].  \n 37\nThe very recent results concerning the thermal stability of a number of polymers have \nput forward the idea that the clay qualitatively affects the polymer degradation [118-122]. The \ndifferent efficiency of MMT in improving the thermal stability of polymers was considered in \nterms of the complexicity of degradation pathways or in terms of radical stability. When there \nis more than one degradation pathway, as it is in the case of PS, where both monomer and \noligomer are produced, the presence of the clay can promote one degradation pathway at the \nexpense of another. If the pathway which is promoted leads to higher molecular weight \nmaterial, then the polymer is degraded more slowly than it would be in the absence of the \nclay. However, if there is only a single degradation pathway (or more theoretically probable \nways but leading to production of the same products, as for instance in the case PMMA) the \nclay cannot promote an evolution of different degradation products. Referring to the radical \nstability, if the stability of radical species produced during thermal decomposition of polymer \nis high – they exhibit longer lifetimes – the probability that they will undergo secondary \nintermolecular reactions, especially radical recombination reactions, is also high -  the role of \nthe clay is then to prevent mass transport from the bulk and to permit radical recombination \nreactions, exerting thus a stabilization effect in the polymer\/layered silicate nanocomposite.  \n \n4. Conclusions \n \nThe results of recent research indicate that the introduction of layered silicates into polymer \nmatrix causes an increase in thermal stability. Due to characteristic structure of layers in \npolymer matrix, their shape and dimensions close to molecular level several effects have been \nobserved that can explain the changes in thermal properties. Experimental results have shown \nthat layers of MMT are impermeable for gases meaning that both intercalated and exfoliated \nstructure get created in a labyrinth for gas penetrating the polymer bulk. Thus, the effect of \n‘labyrinth’ limits the oxygen diffusion inside the nanocomposite sample. Similarly in the \nsamples exposed to high temperature the MMT layers restrain the diffusion of gasses evolved \nduring degradation. Moreover, MMT layers are thought to reduce heat conduction. In the \npresence of MMT layers strongly interacting with polymer matrix the motions of polymer \nchains are limited. This effect brings additional stabilization in the case of polymer\/MMT \nnanocomposites.  Nanocomposites exhibit more intensive char formation on the surface of \nsample exposed to heat. It protects the bulk of sample from heat and decreases the rate of \nmass loss during thermal decomposition of polymeric nanocomposite material. More \nintensive formation of a char in comparison with pristine polymers can be indicative of \n 38\nimproved flame resistance. The char formed in a case of nanocomposites performs higher \nmechanical resistance and therefore nanocomposites are considered as a potential ablative. \nThe phenomena mentioned above are thought to retard the thermal decomposition processes \nthrough reducing the rate of mass loss - unfortunately, few works have been dedicated on the \nstudy of gases evolved from nanocomposites during thermal and thermo-oxidative \ndegradation. \nThe heat barrier effect could also provide superheated conditions inside the polymer melt \nleading to extensive random scission of polymer chain and evolution of numerous chemical \nspecies which, trapped between clay layers, have more opportunity to undergo secondary \nreactions.  As a result, some degradation pathways could be promoted leading to enhanced \ncharring. It is also suggested that the effect of more effective char production during thermal \ndecomposition of polymer\/clay nanocomposites may be derived from a chemical interaction \nbetween the polymer matrix and the clay layer surface during thermal degradation. Some \nauthors indicated that catalytic effect of nanodispersed clay is effective in promoting char-\nforming reactions. Nanodispersed MMT layers were also found to interact with polymer \nchains in a way that forces the arrangement of macrochains and restricts the thermal motions \nof polymer domains. Generally, the thermal stability of polymeric nanocomposites containing  \nMMT is related to the organoclay content and the dispersion. The synthesis methods influence \nthe thermal stability of polymer\/MMT nanocomposites as long as they are governing the \ndispersion degree of clay layers. Currently, extensive research is devoted to the synthesis of \nnovel thermally-stable modifiers (including oligomeric compounds) that can ensure good \ncompatibility and improve the nanocomposite thermal stability due to low migration \ncharacteristics.  \n  \n \n 39\n5. References \n \n[1]  S.B. Hendricks, J. Phys. Chem. 45 (1941) 65. \n[2]  B.K.G. Theng, Chemistry of Clay-Organic Reactions, Wiley, New York 1974. \n[3]  L.A. Utracki, Clay-Containing Polymeric Nanocomposites, Rapra, Shawbury 2004. \n[4]  J. Njuguna, K. Pielichowski, Adv. Eng. Mater. 5 (2003) 769. \n[5]  J. Njuguna, K. Pielichowski, Adv. Eng. Mater. 6 (2004) 193. \n[6]  J. Njuguna, K. Pielichowski, Adv. Eng. Mater. 6 (2004) 204. \n[7]  S. Sinha Ray, M. Okamoto, Prog. Polym. Sci. 28 (2003) 1539. \n[8]  J.K. Pandey, K.R. Reddy, Polym. Degrad. Stab. 88 (2005) 234. \n[9]  K. Pielichowski, L. Stoch, J. Therm. Anal. 45 (1995) 1239. \n[10]  K. Pielichowski, A. Leszczynska, Polimery 51 (2006) 60. \n[11]  T. Liu, K.P. Lim, W.C. Tjiu, K.P. Pramoda, Z.-K. Chen, Polymer 44 (2003) 3529. \n[12]  W. Xie, Z. Gao, K. Liu, W.-P. Pan, R. Vaia, D. Hunter, A. Singh, Thermochim. Acta \n339 (2001) 367. \n[13]  R. Greene-Kelly, in: R.C. Mackenzie, (Ed.), The Differential Thermal Investigation of \nClays, Mineralogical Society London 1957. \n[14]  W. Xie, Z.M. Gao, W.P. Pan, D. Hunter, A. Singh, R.A. Vaia, Chem. Mater. 13 (2001) \n2979. \n[15]  X. Zheng, C.A. Wilkie, Polym. Degrad. Stab. 82 (2003) 441. \n[16]  C. Wan, X. Qiao, Y. Zhang, Y. Zhang, Polym. Test. 22 (2003) 453. \n[17]  J.M. Hwu, G.J. Jiang, Z.M. Gao, W. Xie, W.P. Pan, J. Appl. Polym. Sci. 83 (2002) \n1702. \n[18]  P.A. Ciullo, Chimica Oggi - Chem. Today March\/April (1997). \n[19]  R. Greene-Kelly, Mineral. Mag. 30 (1955) 604. \n[20]  M.A. Osman, M. Ploetze, P. Skrabal, J. Phys. Chem. B 108 (2004) 2580. \n[21]  M.A. Osman, M. Ploetze, U.W. Suter, J. Mater. Chem. 13 (2003) 2359. \n[22]  Z.M. Liang, J. Yin, H.J. Xu, Polymer 44 (2003) 1391. \n[23]  Z.-M. Liang, C.-Y. Wan, Y. Zhang, P. Wei, J. Yin, J. Appl. Polym. Sci. 92 (2004) 567. \n[24]  J.H. Adams, J. Polym. Sci. Part A-I 8 (1970) 1077. \n[25]  K. Stoeffler, P.G. Lafleur, J. Denault, in: Proceedings of 3rd International Symposium \non Polymer Nanocomposites Sci. and Technol., Quebec, Canada, Sept. 28-30 2005. \n[26]  L.A. Utracki, in: Proceedings of 3rd International Symposium on Polymer \nNanocomposites Sci. and Technol., Quebec, Canada, Sept. 28-30 2005. \n[27]  Z.-M. Liang, J. Yin, H.J. Xu, Polymer 44 (2003) 1391. \n[28]  C.S. Triantafillidis, P.C. LeBaron, T.J. Pinnavaia, J. Solid State Chem. 167 (2002) 354. \n[29]  W.H. Awad, J.W. Gilman, M. Nydena, R.H. Harris Jr., T.E. Sutto, J. Callahan, P.C. \nTrulove, H.C. DeLongc, D.M. Fox, Thermochim. Acta 409 (2004) 3. \n[30]  J.W. Gilman, W.H. Awad, R.D. Davis, J. Shields, R.H. Harris Jr, C. Davis, A.B. \nMorgan, T.E. Sutto, J. Callahan, P.C. Trulove, H.C. Delong, Chem. Mater. 14 (2002) 3776. \n[31]  H. Ngo, K. Le Compte, L. Hargens, A.B. Mc Ewen, Thermochim. Acta 97 (2000) 357. \n[32]  C.G. Begg, M.R. Grimmett, P.D. Wethey, Aust. J. Chem. 26 (1973) 2435. \n[33]  B.K.M. Chan, N.-H. Chang, M.R. Grimmett, Aust. J. Chem 30 (1977) 2005. \n[34]  A.N. Kost, I.I. Grandberg, Adv. Heterocycl. Chem. 6 (1966) 417. \n[35]  R.T. Carlin, J. Fuller, Molten Salts: From Fundamentals to Applications \nin NATO Science Series, M. Gaune-Escard (Ed.), Kluwer, Dordrecht 2002. \n[36]  J. Zhu, A.B. Morgan, F.J. Lamelas, C.A. Wilkie, Chem. Mater. 13 (2001) 3774. \n[37]  J.-H. Chang, S.J. Kim, S. Im, Polymer 45 (2004) 5171. \n 40\n[38]  W. Xie, Z. Gao, W.-P. Pan, R. Vaia, D. Hunter, A. Singh, Polym. Mater. Sci. Eng. 83 \n(2000) 284. \n[39]  H. Liu, W. Zhang, S. Zheng, Polymer 46 (2005) 157. \n[40]  S. Su, D.D. Jiang, C.A. Wilkie, Polym. Degrad. Stab. 84 (2004) 269. \n[41]  S. Su, C.A. Wilkie, Polym. Degrad. Stab. 83 (2004) 347. \n[42]  T. Kashiwagi, A. Inaba, J.E. Brown, K. Hatada, T. Kitayama, E. Masuda, \nMacromolecules 19 (1986) 2160. \n[43]  S.K. Srivastava, M. Pramanik, H. Acharya, J. Polym. Sci.: Part B: Polym. Phys. 44 \n(2006) 471. \n[44]  A. Riva, M. Zanetti, M. Braglia, G. Camino, L. Falquic, Polym. Degrad. Stab. 77 (2002) \n299. \n[45]  D.M. Delozier, R.A. Orwoll, J.F. Cahoon, N.J. Johnston, J.G. Smith Jr., J.W. Connell, \nPolymer 43 (2002) 813. \n[46]  R.K. Shah, D.R. Paul, Polymer 45 (2004) 2991. \n[47]  S. Kumar, J.P. Jog, U. Natarajan, J. Appl. Polym. Sci. 89 (2003) 1186. \n[48]  B. Lepoittevin, N. Pantoustier, M. Devalckenaere, M. Alexandre, D. Kubies, C. Calberg, \nR. Jérôme, P. Dubois, Macromolecules 35 (2002) 8385  \n[49]  B. Guo, D. Jia, C. Cai, Eur. Polym. J. 40 (2004) 1743. \n[50]  S.T. Lim, Y.H. Hyun, H.J. Choi, M.S. John, Chem. Mater. 14 (2002) 1839. \n[51]  M.-A. Paul, M. Alexandre, P. Degee, C. Henrist, A. Rulmont, P. Dubois, Polymer 44 \n(2003) 443. \n[52]  H. Zhai, W. Xu, H. Guo, Z. Zhou, S. Shen, Q. Song, Eur. Polym. J. 40 (2004) 2539. \n[53]  Y.I. Tien, K.H. Wei, J. Appl. Polym. Sci. 86 (2002) 1741. \n[54]  J. Wang, Y. Chen, J. Wang, J. Appl. Polym. Sci. 99 (2006) 3578. \n[55]  Y. Tang, Y. Hu, L. Song, R. Zong, Z. Gui, Z. Chen, W. Fan, Polym. Degrad. Stab. 82 \n(2003) 127. \n[56]  H. Qin, S. Zhang, C. Zhao, M. Feng, M. Yang, Z. Shu, S. Yang, Polym. Degr. Stab. 85 \n(2004) 807. \n[57]  S.D. Burnside, E.P. Giannelis, Chem. Mater. 7 (1995) 1597. \n[58]  H.A. Stretz, J.H. Koo, V.M. Dimas, Y. Zhang, Polym. Prepr. 42 (2001) 50. \n[59]  T.D. Fornes, P.J. Yoon, D.R. Paul, Polymer 44 (2003) 7545. \n[60]  J.C. Matayabas Jr, S.R. Turner, in: T.J. Pinnavaia, G.W. Beall, (Eds.), Polymer-Clay \nNanocomposites, Wiley New York 2001. \n[61]  P.J. Yoon, D.L. Hunter, D.R. Paul, Polymer 44 (2003) 5341. \n[62]  R.D. Davis, J.W. Gilman, D.L. Vanderhart, Polym. Degrad. Stab. 79 (2003) 111. \n[63]  S. Levchik, C. Wilkie, in: A. Grand, C. Wilkie, (Eds.), Fire Retardancy, Marcel Dekker \nNew York 2000. \n[64]  J.-H. Chang, S.J. Kim, Polym. Bull. 52 (2004) 289. \n[65]  P. Cebe, J. Runt, Polymer 45 (2004) 1923. \n[66]  F. Gong, M. Feng, C. Zhao, S. Zhang, M. Yang, Polym. Degrad. Stab. 84 (2004) 289. \n[67]  A. Tidjani, C.A. Wilkie, Polym. Degrad. Stab. 74 (2001) 33. \n[68]  A. Tidjani, J. Appl. Polym. Sci. 64 (1997) 2497. \n[69]  A. Tidjani, O. Wald, M.-M. Pohl, M.P. Hentschel, B. Schartel, Polym. Degrad. Stab. 82 \n(2003) 133. \n[70]  J.W. Gilman, Appl. Clay Sci. 15 (1999) 31. \n[71]  A. Ranade, N. D’souza, C. Thellen, J.A. Ratto, Polym. Int. 54 (2005) 875. \n[72]  G. Chigwada, D. Wang, C.A. Wilkie, Polym. Degrad. Stab. 91 (2006) 848. \n[73]  Y. Ke, C. Long, Z. Qi, J. Appl. Polym. Sci. 71 (1999) 1139. \n[74]  W.S. Chow, Z.A. Mohd Ishak, J. Karger-Kocsis, A.A. Apostolov, U.S. Ishiaku, Polymer \n44 (2003) 7427. \n 41\n[75]  F. Ide, A. Hasegawa, J. Appl. Polym. Sci. 18 (1974) 963. \n[76]  S.N. Sathe, S. Devi, G.S. Srinivasa Rao, K.V. Rao, J. Appl. Polym. Sci. 61 (1996) 97. \n[77]  A.Y. Coran, R. Patel, H.D. Williame, Rubber Chem. Technol. 58 (1985) 1014. \n[78]  A. Pozsgay, T. Fráter, L. Százdi, P. Müller, I. Sajó, B. Pukánszky, Eur. Polym. J. 40 \n(2004) 27. \n[79]  Y. Li, J. Ma, Y. Wang, B. Liang, J. Appl. Polym. Sci. 98 (2005) 1150. \n[80]  S.-J. Park, D.-I. Seo, J.-R. Lee, J. Coll. Interf. Sci. 251 (2002) 160. \n[81]  S.J. Park, J.B. Donnet, J. Coll. Interf. Sci. 206 (1998) 29  \n[82]  J. Ma, J. Xu, J.-H. Ren, Z.-Z. Yu, Y.-W. Mai, Polymer 44 (2003) 4619. \n[83]  S. Su, C.A. Wilkie, J. Polym. Sci., Part A: Polym. Chem. 41 (2003) 1124. \n[84]  D.H. Solomon, J.D. Swift, J. Appl. Polym. Sci. 11 (1967) 2567. \n[85]  Q. Kong, Y. Hu, L. Yang, W. Fan, Z. Chen, Polym. Compos. 27 (2006) 49. \n[86]  J. Trilica, A. Kalendova, Z. Malac, J. Simonik, in: Proceedings of SPE ANTEC, Dallas, \nUSA, May 6-10 2001. \n[87]  D.Y. Wang, D. Parlow, Q. Yao, C.A. Wilkie, J. Vinyl Additive Technol. 7 (2001) 203. \n[88]  H. Qin, Q. Su, S. Zhang, B. Zhao, M. Yang, Polymer 44 (2003) 7533. \n[89]  M. Zanetti, T. Kashiwagi, L. Falqui, U. Camino, Chem. Mater. 14 (2002) 881. \n[90]  M. Alexandre, P. Dubois, Mater. Sci. Eng. 28 (2000) 1. \n[91]  R. Kotsilkova, V. Petkova, Y. Pelovski, J. Therm. Anal. Calorim. 64 (2001) 591. \n[92]  J. Gilman, T. Kashiwagi, J. Brown, S. Lomakin, E. Giannelis, in: Proceedings of 43rd \nInternational SAMPE Symposium, Anaheim, USA, May 31 - June 4 1998. \n[93]  J. Lee, T. Takekoshi, E.P. Giannelis, Mater. Res. Soc. Symp. Proc. 457 (1997) 513. \n[94]  M. Zanetti, G. Camino, R. Thomann, R. Mülhaupt, Polymer 42 (2001) 4501. \n[95]  Y. Hu, L. Song, in: Proceedings of International Fire Safety Conference (Fire Retardant \nChemicals Association), San Francisco, USA, March 11-14 2001. \n[96]  S. Bourbigot, M. Le Bras, F. Dąbrowski, J.W. Gilman, T. Kashiwagi, Fire Mater. 24 \n(2000) 201 \n \n[97]  J. Zhu, C.A. Wilkie, Polym. Int. 49 (2000) 1158. \n[98]  J.W. Gilman, C.L. Jackson, A.B. Morgan, Chem. Mater. 12 (2000) 1866. \n[99]  T. Agag, T. Takeichi, Polymer 41 (2000) 7083. \n[100]  O. Becker, R.J. Varley, G.P. Simon, Eur. Polym. J. 40 (2004) 187. \n[101]  T. Kashiwagi, R.H. Harris Jr, X. Zhang, R.M. Briber, B.H. Cipriano, S.R. Raghavan, \nW.H. Awad, J.R. Shields, Polymer 45 (2004) 881. \n[102]  R.A. Vaia, G. Price, P.N. Ruth, H.T. Nguyen, J. Lichtenhan, Appl. Clay Sci. 15 (1999 ) \n67. \n[103]  S.W. Benson, P.S. Nogia, Acc. Chem. Res. 12 (1979) 33. \n[104]  M. Zanetti, P. Bracco, L. Costa, Polym. Degrad. Stab. 85 (2004) 657. \n[105]  K. Yano, A. Usuki, T. Kurauchi, O. Kamigaito, J. Polym. Sci., Part A: Polym. Chem. \n31 (1993) 2493. \n[106]  Y. Wang, F.-B. Chen, Y.-C. Li, K.-C. Wu, Compos. Part B: Eng. 35 (2004) 111. \n[107]  J. Zhu, F.M. Uhl, A.B. Morgan, C.A. Wilkie, Chem. Mater. 13 (2001) 4649. \n[108]  L. Qiu, W. Chen, B. Qu, Polymer 47 (2006) 922. \n[109]  J.D. Peterson, S. Vyazovkin, C.A. Wight, Macromol. Chem. Phys. 775 (2001) 202. \n[110]  J.-H. Chang, S.J. Kim, Y.L. Joo, S. Im, Polymer 45 (2004) 919. \n[111]  H.A. Stretz, M.W. Wootan, P.E. Cassidy, J.H. Koo, Polym. Adv. Technol. 16 (2005) \n239. \n[112]  D. Lee, S.H. Lee, K. Char, J. Kim, Macromol. Rapid Commun. 21 (2000) 1136. \n[113]  D. Lee, K. Char, Polym. Degrad. Stab. 75 (2002) 555. \n[114]  A. Blumstein, J. Polym. Sci., Part AI 3 (1965) 2665. \n 42\n[115]  K. Chen, M.A. Susner, S. Vyazovkin, Macromol. Rapid Commun. 26 (2005) 690. \n[116]  S. Vyazovkin, I. Dranca, J. Phys. Chem. B 108 (2004) 11981. \n[117]  S. Vyazovkin, I. Dranca, X. Fan, R. Advincula, J. Phys. Chem. B 108 (2004) 11672. \n[118]  B.N. Jang, M. Costache, C.A. Wilkie, Polymer 46 (2005) 10678. \n[119]  B.N. Jang, C.A. Wilkie, Polymer 46 (2005) 3264. \n[120]  B.N. Jang, C.A. Wilkie, Polymer 46 (2005) 2933. \n[121]  B.N. Jang, C.A. Wilkie, Polymer 46 (2005) 9702. \n[122]  M.C. Costache, D. Wang, M.J. Heidecker, E. Manias, C.A. Wilkie, Polym. Adv. \nTechnol. in press (2006). \n[123]  C.H. Davis, L.J. Mathias, J.W. Gilman, D.A. Schiraldi, J.R. Shields, P. Trulove, T.E. \nSutto, H.C. Delong, J. Polym. Sci., Part B: Polym. Phys. 40 (2002) 2661. \n[124]  A. He, H. Hu, Y. Huang, J.-Y. Dong, C.C. Han, Macromol. Rapid Commun. 25 (2004) \n2008. \n[125]  G. Chigwada, D. Wang, D.D. Jiang, C.A. Wilkie, Polym. Degrad. Stab. 91 (2006) 755. \n[126]  S. Su, D.D. Jiang, C.A. Wilkie, Polym. Degrad. Stab. 83 (2004) 333. \n[127]  J. Zhang, D.D. Jiang, C.A. Wilkie, Thermochim. Acta 430 (2005) 107. \n[128]  X. Zheng, D.D. Jiang, D. Wang, C.A. Wilkie, Polym. Degrad. Stab. 91 (2006) 289. \n[129]  J. Zhang, D.D. Jiang, C.A. Wilkie, Polym. Degrad. Stab. 91 (2006) 298. \n[130]  G. Chigwada, D.D. Jiang, C.A. Wilkie, Thermochim. Acta 436 (2005) 113. \n[131]  S.-H. Kim, S.-H. Park, S.-C. Kim, Polym. Bull. 53 (2005) 285. \n \n 43\n \nCaptions for Table and Figures \nTable 1 Organic compounds used for MMT modification with their thermal stability \nparameters. \nFig. 1  Decomposition mechanism of OLS (adopted from [17]). \nFig. 2  Chemical structure of rigid rod amines used for MMT modification [22]. \nFig. 3  Degradation of the imidazolium quaternary salt according to SN2 mechanism [29]. \nFig. 4  Degradation of the imidazolium quaternary salt according to SN1 mechanism [29]. \nFig. 5  Synthesis of an organically-modified montmorillonite (C12PPh-MMT) from Na+-\nmontmorillonite (Na+-MMT) and dodecyltriphenylphosphonium chloride (C12PPh-\nCl2) [37]. \nFig. 6  Formation of epoxy-MMT nanocomposites mediated by ammonium OapPOSS \n(DGEBA - diglycidyl ether of bisphenol A, monomer;  DDM - 4,4’-\ndiaminodiphenylmethane, curing agent) [39]. \nFig. 7.  TG curves of HIPS and its COPS and MAPS nanocomposites [41]. \nFig. 8 Structures of alkylammonium compounds used for MMT organofilization: a –dimethyl-\n5-ethylhexadecyl hydrogenated tallow ammonium, b – methyl dihydroxyethyl \nhydrogenated tallow ammonium [48]. \nFig. 9  Effect of OMMT loading on activation energy of epoxy nanocomposite calculated by  \nHorowitz–Metzger method [49]. \nFig. 10 Reactions of MT2EtOH involved during blending in air atmosphere [69]. \nFig. 11 Thermal degradation mechanism of PE and EVA in air [104]. \n \n \n 44\n \nOrganoclay code Type of organomodifier Tonset [°C] \nTmax \n[°C] \nChar  \n[%] Ref. \nDMDODA-MMT Dimethyldioctadecylammonium chloride - 304N \n285A \n- [123]\nOMMT Dimethyldioctadecylammonium bromide 280 x 308 - [30] \nAMMT Alkylammonium salt 281 y 273 70.3 [124]\nOMMT 1,2-dimethyl-3-hexadecylimidazolium \nN\nN\nCH3\nCH3\nR\nR = hexadecylCl\n \n343 x 406 - [30] \nIMMT Monoalkylimidazolium salt 410 y 422 78.3 [124]\nBPNC16 clay Phenylacetophenone dimethylhexadecyl ammonium salt \nN\nO\n13\nBr  \n349 y - 71 [125]  \nCOPS clay Ammonium salt of oligomeric copolymer of styrene and \nvinylbenzyl chloride \nCH2\nNCH3\nC16H33\nCH3 Cl\n \n367 427 z 27 [126]  \nMAPS clay Ammonium salt of oligomeric copolymer of methyl \nmethacrylate and vinylbenzyl chloride \n281 y 380 z 35 [126]\nLauryl clay Ammonium salt of oligomeric copolymer from lauryl \nacrylate and vinylbenzyl chloride \n384 y 438 z 25 [127]\nPMMA 12 clay Salt of methyl methacrylate oligomer \nCH2 C\nCH3\nCH2 C\nCH3\nCOOCH3C\nO O\nCH2 CH2 N CH3\nCH2CH3\nCH3\nx y\n15Br\n \n279 y 371 z 14 [128]\nTriclay II Ammonium salt of the terpolymer from vinylbenzyl \nchloride, styrene and lauryl acrylate \n350 y 418 z 37.5 [129]\n5AC clay Carbazole-based salt \nN N\n3 13\n \n325 y - 72 [130]\nClay dispersed TEO Trimellitate ester oligomer prepared by esterification of \n1,2,4-benzenetricarboxylic anhydride (trimellitic \nanhydride) with ethylene glycol \nO\nO\nO\nO\nO\nO\nO O\nO\nO\nO\nO\nOH\nOH\nO\nO\nOH\nOH\nOH\nOH\nO\nO\nO\nO\n263a 457b - [131]\na- Tmax of 1st stage of mass loss; b -Tmax of 2nd stage of mass loss; A – measurement in air atmosphere; N – measurement \nin nitrogen atmosphere, x – at degree of conversion 0.05; y - at degree of conversion 0.1;  z – at degree of conversion 0.5 \nTable 1 \n 45\n \n \n \n     \nNCH3\nCH3\nCH3 Cl NCH3\nCH3\nCH3 N\nNN\nNCH3\nCH3\nCH3\n \n \n \n \n        \nC10H20     C16H32     C17H34     C18H35Cl  \n           N C15H31N C13H27  \n \n \n     \nC9H18 C10H20 C11H22 C18H36C12H24  \n  N C15H31   H2NC18H37  \n \n \n- - - - -\n- - - - -\n300°C \n500°C \noutside organic \ncompounds \nintercalated organic \ncompounds \n \n \n \n \nFig. 1 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 46\n \n \n \n \n \n \n \nC\nC\nN NH2\nO\nO\nC\nC\nN\nO\nO\nO NH2\n \n \n \nFig. 2  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 47\n \n \n \n \n \n \n \nN\nN\nR3\nR2\nR1\n+\nX\nX\nHeat\n-RX\nN\nN R2\nR1\n+\nN R2\nN\nR3\n+ X R1 + X R3\n \n \nFig. 3  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 48\n \n \n \n \n \n \n \n+\nN\nN\nC\nCH3\nCH3\nCH3CH3\nCH3\n+ X Heat CH3 C\nCH3\nCH3\nX\n+\nN\nN CH3\nCH3\n \n \n \nFig. 4  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 49\n \n \n \n \n \nP + BrCH2(CH2)10 CH3\nKI\nBr\nP\nCH2(CH2)10CH3\n+ HCl\n-HBr\nP\nCH2(CH2)10CH3\nCl\nCl\nP\nCH2(CH2)10CH3\n+ Na+-MMT\nMMT\nP\nCH2(CH2)10CH3\n-NaCl\n \n \nFig. 5  \n \n \n \n \n \n \n \n \n \n \n \n \n 50\n \n \n \n \n \n \nFig. 6  \n \n \n \n \n \n 51\n \n \n \n \n \n \n \n \n \n \nFig. 7.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 52\n \nCH3\nN\nCH3\n(CH2)4CH(CH2CH3)CH3\nR\nCH3\nN\nCH2CH2OH\nR\nCH2CH2OH\n(a)\n(b)\n \n \nFig. 8 \n 53\n \n \n \n \n \n \nFig. 9  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 54\n \nFig. 10  \n \nAldehyde \n∆      X•\nMT2EtO•\nMT2EtOH\nH\nC CH2CH2 \nCH3\nMT2EtOH  + \nCH3\nC CH2CH2\n• 2\ncross-linking  \nO2 \nC CH2 CH2 \nCH3\nOO•\nPH\nC CH2CH2\nCH3\nOOH\n+ P• \nC CH2CH2\nCH3\nO•\n+ OH• \nMethyl- and chain-ketones Alcohols Esters unsaturation\nCarboxylic acids, \nesters, … \nChain scission \n(volatiles) \n 55\n \n \n \n \n \n \n \nFig. 11  \n \n \n"}