{"doi":"10.1016\/j.jecp.2008.03.009","coreId":"67992","oai":"oai:eprints.lancs.ac.uk:34106","identifiers":["oai:eprints.lancs.ac.uk:34106","10.1016\/j.jecp.2008.03.009"],"title":"The endurance of children's working memory : a recall time analysis.","authors":["Towse, John N.","Hitch, Graham J.","Hamilton, Z.","Pirrie, Sarah"],"enrichments":{"references":[{"id":16629393,"title":"A temporal–contextual retrieval account of complex span: An analysis of errors.","authors":[],"date":"2006","doi":null,"raw":"Unsworth, N., & Engle, R. W. (2006b). A temporal–contextual retrieval account of complex span: An analysis of errors. Journal of Memory and Language, 54(3), 346-362.","cites":null},{"id":16629351,"title":"Children's working memory processes: A response-timing analysis.","authors":[],"date":"2003","doi":null,"raw":"Cowan, N., Towse, J. N., Hamilton, Z., Saults, J. S., Elliott, E. M., Lacey, J. F., et al. (2003). Children's working memory processes: A response-timing analysis. Journal of Experimental Psychology: General, 132(1), 113-132.","cites":null},{"id":16629373,"title":"Developmental and computational approaches to variation in working memory. In","authors":[],"date":"2007","doi":null,"raw":"Munakata, Y., O'Reilly, R., & Morton, J. B. (2007). Developmental and computational approaches to variation in working memory. In A. R. A. Conway, C. Jarrold, M. J. Kane, A. Miyake & J. N. Towse (Eds.), Variation in working memory (pp. 162-193). New York: Oxford University Press.","cites":null},{"id":16629362,"title":"Developmental applications of working memory.","authors":[],"date":"1988","doi":null,"raw":"Halliday, M. S., & Hitch, G. J. (1988). Developmental applications of working memory. In G. Claxton (Ed.), New directions in cognition (pp. 193-222). London: Routledge and Keegan Paul.","cites":null},{"id":16629357,"title":"Individual differences in working memory and reading.","authors":[],"date":"1980","doi":null,"raw":"Daneman, M., & Carpenter, P. A. (1980). Individual differences in working memory and reading. Journal of Verbal Learning and Verbal Behavior, 19, 450-466.","cites":null},{"id":16629376,"title":"On the nature of forgetting and the processing-storage relationship in reading span performance.","authors":[],"date":"2004","doi":null,"raw":"Saito, S., & Miyake, A. (2004). On the nature of forgetting and the processing-storage relationship in reading span performance. Journal of Memory and Language, 50, 425-443.","cites":null},{"id":16629334,"title":"Operational efficiency and the growth of short term memory span.","authors":[],"date":"1982","doi":null,"raw":"Case, R., Kurland, M., & Goldberg, J. (1982). Operational efficiency and the growth of short term memory span. Journal of Experimental Child Psychology, 33, 386-404.","cites":null},{"id":16629360,"title":"Pauses and durations exhibit a serial position effect.","authors":[],"date":"2005","doi":null,"raw":"Haberlandt, K., Lawrence, H., Krohn, T., Bowe, K., & Thomas, J. G. (2005). Pauses and durations exhibit a serial position effect. Psychonomic Bulletin & Review, 12(1), 152-158.","cites":null},{"id":16629387,"title":"Simple and complex memory spans and their relation to fluid abilities: Evidence from list-length effects.","authors":[],"date":"2006","doi":null,"raw":"Unsworth, N., & Engle, R. W. (2006a). Simple and complex memory spans and their relation to fluid abilities: Evidence from list-length effects. Journal of Memory and Language, 54, 68-80.","cites":null},{"id":16629342,"title":"The differential maturation of two processing rates related to digit span.","authors":[],"date":"1999","doi":null,"raw":"Cowan, N. (1999). The differential maturation of two processing rates related to digit span. Journal of Experimental Child Psychology, 72, 193-209.","cites":null},{"id":16629370,"title":"The similarities and differences between STM and WM tasks across development. Unpublished doctoral dissertation,","authors":[],"date":"2005","doi":null,"raw":"Hutton, U. M. Z. (2005). The similarities and differences between STM and WM tasks across development. Unpublished doctoral dissertation, Royal Holloway University of London.","cites":null},{"id":16629367,"title":"Think before you speak: Pauses, memory search and trace redintegration processes in verbal memory span.","authors":[],"date":"1999","doi":null,"raw":"Hulme, C., Newton, P., Cowan, N., Stuart, G., & Brown, G. (1999). Think before you speak: Pauses, memory search and trace redintegration processes in verbal memory span. Journal of Experimental Psychology: Learning, Memory and Cognition, 25(2), 1-18.","cites":null},{"id":16629354,"title":"Two separate verbal processing rates contributing to short-term memory span.","authors":[],"date":"1998","doi":null,"raw":"Cowan, N., Wood, N. L., Wood, P. K., Keller, T. A., Nugent, L. D., & Keller, C. V. (1998). Two separate verbal processing rates contributing to short-term memory span. Journal of Experimental Psychology: General, 127(2), 141-160.","cites":null},{"id":16629339,"title":"Variation in Working Memory.","authors":[],"date":"2007","doi":null,"raw":"Conway, A. R., Jarrold, C., Kane, M., Miyake, A., & Towse, J. N. (Eds.). (2007). Variation in Working Memory. New York: Oxford University Press.","cites":null},{"id":16629348,"title":"Verbal memory span in children: Speech timing cues to the mechanisms underlying age and word length effects.","authors":[],"date":"1994","doi":null,"raw":"Cowan, N., Keller, T. A., Hulme, C., Roodenrys, S., McDougall, S., & Rack, J. (1994). Verbal memory span in children: Speech timing cues to the mechanisms underlying age and word length effects. Journal of Memory and Language, 33, 234-250.","cites":null},{"id":16629378,"title":"Working memory and its relevance for cognitive development. In","authors":[],"date":"2005","doi":null,"raw":"Towse, J. N., & Cowan, N. (2005). Working memory and its relevance for cognitive development. In W. Schneider, R. Schumann-Hengsteler & B. Sodian (Eds.), Young Children’s Cognitive Development: Interrelationships among Executive Functioning, Working Memory, Verbal Ability, and Theory of Mind (pp. 9-37). Mahwah, NJ: Lawrence Erlbaum Associates. Towse, J. N., Cowan, N., Hitch, G. J., & Horton, N. (in press). The recall of information from working memory: insights from behavioural and chronometric perspectives. Experimental Psychology. Towse, J. N., Cowan, N., Horton, N., & Whytock, S. (in press). Task experience and children's working memory performance: A perspective from recall timing. Developmental Psychology.","cites":null},{"id":16629383,"title":"Working memory as the interface between processing and retention: A developmental perspective.","authors":[],"date":"2007","doi":null,"raw":"Towse, J. N., Hitch, G. J., & Horton, N. (2007). Working memory as the interface between processing and retention: A developmental perspective. Advances in Child Development and Behavior, 35, 219-251.","cites":null},{"id":16629364,"title":"Working memory in children.","authors":[],"date":"1983","doi":null,"raw":"Hitch, G. J., & Halliday, M. S. (1983). Working memory in children. Philosophical Transactions of the Royal Society of London, 302(B), 325-340.","cites":null},{"id":16629381,"title":"Working memory period: the endurance of mental representations.","authors":[],"date":"2005","doi":null,"raw":"Towse, J. N., Hitch, G. J., Hamilton, Z., Peacock, K., & Hutton, U. M. Z. (2005). Working memory period: the endurance of mental representations. Quarterly Journal of Experimental Psychology, 58A(3), 547-571.","cites":null},{"id":16629331,"title":"Working Memory.","authors":[],"date":"1986","doi":null,"raw":"Baddeley, A. D. (1986). Working Memory. Oxford: Clarendon Press. Baddeley, A. D., & Hitch, G. J. (2000). Development of working memory: Should the Pascual-Leone and the Baddeley and Hitch models be merged? Journal of Experimental Child Psychology, 77(2), 128-137.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-10","abstract":"We analyse the timing of recall as a source of information about children’s performance in complex working memory tasks. A group of 8-year- old children performed a traditional operation span task in which sequence length increased across trials and an operation period task in which processing requirements were extended across trials of constant sequence length. Interword pauses were larger than is commonly found in immediate serial recall tasks, yet shorter than for reading span. These pauses increased with the demands of recall, decreased across the output sequence and were to some extent predictive of scholastic ability. Overall, timing data illustrate that recall in working memory tasks involve subtle processes of item access rather than simple read-out of information from an immediate store","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/67992.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/34106\/1\/TowseWMperiodrecall.pdf","pdfHashValue":"50809925f97f7320d59e2172e4777a8dc0cc59fb","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:34106<\/identifier><datestamp>\n      2018-01-24T03:02:42Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D42:4246<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The endurance of children's working memory : a recall time analysis.<\/dc:title><dc:creator>\n        Towse, John N.<\/dc:creator><dc:creator>\n        Hitch, Graham J.<\/dc:creator><dc:creator>\n        Hamilton, Z.<\/dc:creator><dc:creator>\n        Pirrie, Sarah<\/dc:creator><dc:subject>\n        BF Psychology<\/dc:subject><dc:description>\n        We analyse the timing of recall as a source of information about children’s performance in complex working memory tasks. A group of 8-year- old children performed a traditional operation span task in which sequence length increased across trials and an operation period task in which processing requirements were extended across trials of constant sequence length. Interword pauses were larger than is commonly found in immediate serial recall tasks, yet shorter than for reading span. These pauses increased with the demands of recall, decreased across the output sequence and were to some extent predictive of scholastic ability. Overall, timing data illustrate that recall in working memory tasks involve subtle processes of item access rather than simple read-out of information from an immediate store.<\/dc:description><dc:date>\n        2008-10<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/34106\/1\/TowseWMperiodrecall.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.jecp.2008.03.009<\/dc:relation><dc:identifier>\n        Towse, John N. and Hitch, Graham J. and Hamilton, Z. and Pirrie, Sarah (2008) The endurance of children's working memory : a recall time analysis. Journal of Experimental Child Psychology, 101 (2). pp. 156-163. ISSN 0022-0965<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/34106\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/j.jecp.2008.03.009","http:\/\/eprints.lancs.ac.uk\/34106\/"],"year":2008,"topics":["BF Psychology"],"subject":["Journal Article","PeerReviewed"],"fullText":"  \n1 \nThe endurance of children’s working memory: a recall time analysis \n \nTowse, John N (Department of Psychology, Lancaster University) \nHitch, Graham J (Department of Psychology, University of York) \nHamilton, Z. (Department of Psychology, Royal Holloway University of London) \nPirrie, Sarah (Department of Psychology, Lancaster University) \n \nTo appear in: Journal of Experimental Child Psychology. Please consult the \njournal for a final authoritative version of the manuscript. \n \nAcknowledgements. We are grateful to the Lancaster University small grant scheme \nfor provided the funds that made possible the extraction of data, to the ESRC (grant \nR000222789 and RES000230859), and the children of Emmer Green school. The \npaper was prepared in part while the first author was a research visitor at the \nUniversity of Colorado at Boulder. \n \nAddress for Correspondence \nJohn N Towse \nDepartment of Psychology \nFylde College \nLancaster University \nBailrigg, Lancaster LA1 4YF, \nUnited Kingdom \nEmail: j.towse@lancs.ac.uk, Tel: +44-1524-593705 \n  \n2 \nAbstract \n \nWe analyse the timing of recall as a source of information about \nchildren’s performance in complex working memory tasks. A group of 8-year-\nold children performed a traditional operation span task in which sequence \nlength increased across trials and an operation period task in which \nprocessing requirements were extended across trials of constant sequence \nlength. Interword pauses were larger than is commonly found in immediate \nserial recall tasks, yet shorter than for reading span. These pauses increased \nwith the demands of recall, decreased across the output sequence and were \nto some extent predictive of scholastic ability. Overall, timing data illustrate \nthat recall in working memory tasks involve subtle processes of item access \nrather than simple read-out of information from an immediate store. \n \n \n  \n3 \nThe endurance of working memory: a recall time analysis \n \nWorking memory refers to the limited capacity systems and processes \nresponsible for both acting upon and retaining transient representations \n(Baddeley, 1986; Baddeley & Hitch, 2000). The concept has been used for a \nparticular architectural model of largely domain-specific memory devices \n(Halliday & Hitch, 1988; Hitch & Halliday, 1983) and for a more general \nframework describing active maintenance phenomena occurring alongside \nother cognitive activities (Conway, Jarrold, Kane, Miyake & Towse, 2007). We \nfocus here on the general concept of working memory rather than any specific \nmodel. \nIt might appear self-evident that working memory capacity should be \nassessed with respect to how much information can be successfully retained \nwhilst carrying out cognitive operations (Daneman & Carpenter, 1980). \nWorking memory capacity is typically tested by varying sequence length (of \nwords, numbers, visual objects etc., all embedded within processing \nepisodes). This yields working memory span, the number of items \nremembered when also completing some mental operations. Measurement of \nchildren’s working memory spans confirms that capacity is sharply limited, but \nincreases with age.  Moreover, individual differences in span are reliably \npredictive of reading and mathematics attainment, as well as general ability or \nfluid intelligence. This focus on the size of working memory has become very \nmuch the dominant approach in the field, and has been demonstrably \nsuccessful in offering insights into experimental and differential issues \n(Conway et al., 2007). \nThe present research explores an alternative and potentially \ncomplementary measure of working memory. The working memory period \nparadigm has been developed as an operational measure of the endurance or \npersistence of temporary representations in a complex memory setting \n(Towse, Hitch, Hamilton, Peacock & Hutton, 2005). Unlike span, participants \nalways have a constant number of items to remember. Trials vary instead in \nthe duration of the processing requirements that accompany each \nmemorandum. Working memory period is assessed by progressively \nincreasing the processing requirements so as to determine the persistence of \nmemory items retained in the face of ongoing cognitive activity.  Thus, \nworking memory period involves variations in the extent of processing \nwhereas working memory span involves variations in sequence length. Towse \net al. (2005) established that working memory period, like span, is broadly \npredictive of children’s reading and number skills, and that these two \nmeasures have unique as well as shared features (see Towse, Hitch & \nHorton, 2007). \nWe argue that working memory period is especially suited for analyzing \ncertain system characteristics. Whilst it is possible to explore serial position \neffects productively with working memory span (Unsworth & Engle, 2006a; \nHutton, 2005), the composition of, and differential between, primacy, recency \nand middle or intermediate portions of the list necessarily changes with the \nnumber of items. Analysis within the working memory period paradigm is \nmore straightforward and has greater statistical power with a constant \nsequence length.  In the present study we capitalize on this characteristic to \ninvestigate recall timing. \n  \n4 \nA body of research on recall timing has already contributed to our \nunderstanding of short-term memory (Cowan 1999; Cowan et al., 2003; \nHaberlandt, Lawrence, Krohn, Bowe & Thomas, 2005; Hulme, Newton, \nCowan, Stuart & Brown, 1999). Findings highlight the idea that memory tasks \ninvolve not only item maintenance, but also the construction and assembly of \nincomplete representations and their sequencing (Towse, Cowan, Hitch & \nHorton, in press). For example, pauses between successive items during \nrecall typically increase with sequence length suggesting list-wise search \nprocesses. Also, pauses are shorter among children who go on to recall \ncorrectly longer sequences, implying that recall accuracy is influenced by \nsearch efficiency.  Such regularities constrain theoretical accounts of working \nmemory (Towse & Cowan, 2005).  \nThe current research investigates the timing of recall for an operation \nperiod task, alongside operation span data. In each case, children solve sets \nof arithmetic problems and remember each answer for subsequent serial \nrecall. We use this dataset to address four main issues.  \nFirst, recall timing phenomena have not to our knowledge been \nexplored in working memory tasks with arithmetic processing requirements. \nCowan et al. (2003) concentrated on recall timing for reading span and \nlistening span tasks. Indeed, Cowan et al. (2003) proposed that children used \nmemory of the sentence context to help scaffold the recall process (for further \nevidence, see Towse et al., in press). This accounts for why interword pauses \nwere much shorter for counting span, which involves memory for the count \ntotals of visual arrays (Case, Kurland & Goldberg. 1982) since the similarity of \nprocessing would fail to yield many cues for the reconstruction of memoranda. \nThus, we predicted that operation span and operation period will contain \nbriefer interword pauses than reading span since, unlike sentences, arithmetic \nproblems are not especially meaningful or distinct from each other \nSecond, we compare and contrast period and span performance. \nInsofar as both procedures are designed as working memory measures, we \npredicted that where configurations match most, their profile will overlap. \nMoreover, with information available about children’s scholastic attainment, \nwe explore individual differences in operation period recall timing. In this way, \nanalyses facilitate an understanding of the points of continuity or otherwise \nbetween paradigms. We focus on 8-year-olds since they are commonly \nrecruited into studies of working memory development and wider cognitive \nskills (e.g. Hitch et al., 2001). \nThird, we sought to determine the impact of retention difficulty on the \nchronometry of recall. Analysis from short-term memory recall shows that \ninterword pauses typically increase with more output items (e.g. Cowan et al., \n1998). This could be because memory search acts on all potential \nmemoranda or because each additional item is less securely remembered, or \nboth. Since sequence length and task demand are inherently conflated, it is \nhard to address this question satisfactorily. Working memory period combines \na constant sequence length with varying task demand.  Therefore we can \ndetermine whether processing demand on its own affects the (relative or \nabsolute) accessibility of memory items, as evidenced by interword pauses. \nWe predicted that recall would become more protracted as children \napproached their endurance limits for retention.  \n  \n5 \nFourth, we investigated whether the length of interword pauses \nchanged across across output position. Some immediate serial recall \nparadigms display serial position effects in recall timing (Haberlandt et al., \n2005, but see Cowan, 1992). If participants can restrict memory search to not-\nyet-recalled items only, then interword pauses will become shorter at later \npositions.  \n \nMethod \n \nParticipants \nForty-seven children producing audio recordings of correctly recalled \nperiod sequences, formed a subsample of those described previously in \nTowse et.al., 2005.  Operation span recordings were available for forty-one of \nthese children. Mean age was 8 years 8 months (ranging 7;8 to 9;6). All \nchildren attended school in South East England.   \n \nProcedure \nTowse et al. (2005) describe test administration details in full. All \nchildren undertook number skills (in a group setting) and word reading \n(individually) assessments from the British Abilities Scale (BAS II: Elliott, \nSmith, & McCulloch, 1997). Operation period and operation span tasks were \nadministered in counterbalanced order with an interval of approximately one \nweek.  Children always received instructions and practice on the arithmetic \nsums before either task commenced. Emphasis was placed primarily on \ncomputational accuracy with recall accuracy being secondary. No explicit \nmention was made about the timing of recall. \nEach operation period trial comprised a sequence of four arithmetic \nproblems presented visually on an Apple Powerbook 5300c computer.  Each \nverbally-produced answer formed a memorandum. Immediately following \ncompletion of the fourth problem, a visual and auditory signal cued serial \nrecall. Once the experimenter had entered the child’s sequence, the computer \nprovided feedback on recall accuracy. Speech was initially recorded onto \nanalogue audiotape with an external stereo microphone and later converted \ninto digital files. \nThe initial set of three trials involved relatively short arithmetic \nproblems (e.g. “5+0”, “9-0”); subsequent sets of three trials involved more \ntime-consuming operations (e.g.  “4+1” at the second level,  “7-1-1” at the \nthird level). Task progression required successful recall of at least one of \nthree lists at a particular level. Although there were six task levels available, \nwe focus here just on recall performance at the first three levels.   \nOperation span trials involved a sequence of equivalent ‘processing \nplus associated memory item’ episodes. However, whilst the content of \narithmetic problems was comparable the sequence length varied across \nsuccessive sets of three trials. Initial trial sets comprised two-item sequences, \nand increased by a single item (provided at least one of the three lists was \nrecalled correctly) up to a maximum of seven. \n \nResults \n \nExtraction of recall times \n  \n6 \nSince the focus of analysis here lies in the chronometry of recall, we do \nnot dwell on recall accuracy, especially since this is detailed in Towse et al. \n(2005).  On each operation period trial, recall comprised eight sections; the \npreparatory interval (the gap between the audio-visual recall cue and the start \nof output); the four spoken words (the durations of the digits being recalled) \nand the three inter-word pauses. Operation span trials comprised a varying \nnumber of sections, according to the sequence length, but included at least \nfour measurements; the preparatory interval, two spoken words and an \ninterword pause. \nRecall durations were estimated for correctly recalled sequences only.  \nA single observer partitioned each response into contiguous phases, guided \nby the auditory signal and its visual waveform.  Subsequently, a more \nexperienced observer checked and where appropriate adjusted every interval. \nBoth coders worked from a set of recall protocols, having been trained on a \nset of example timings1. \nOccasionally, timing data were excluded because of disruption such as \nwhen a child changed their mind about the sequence order and started over. \nAll the remaining timing intervals were translated into z-scores and screened \nfor outliers (values were Winsorized, to the equivalent of z= 3.29, affecting 27 \nof 2206 period measurements and 13 of 1320 operation span \nmeasurements).  \nRecall timing in operation period and span \nWe are not aware of published data on recall timing from operation \nperiod or operation span. This makes it important to establish whether task \nperformance is comparable (given the conceptual overlap between them) and \ncompare data with other relevant memory tasks. Table 1 describes the \nchronometry of recall for operation span involving four-item sequences and \nthe second level of the period task - where the arithmetical processing \noperations were most similar. Table 1 also includes two other datasets where \nchildren recalled four-item sequences; from reading span among 9- and 11-\nyear-olds (Towse, Cowan, Horton & Whytock, in press), and digit span \n(Cowan et al., 2003) where children’s mean age was 8 years 9 months. \nThe data permit several conclusions. First, operation period and \noperation span show highly similar patterns of recall timing. Second, as might \nbe expected all four tasks converge with respect to the recall duration of \nwords. Third, interword pauses in operation period and operation span last \nlonger than in digit span whilst being much shorter than in reading span, with \nmeans well outside the standard errors for these other tasks. Finally, it is \napparent that the preparatory intervals in reading span are substantially \ndifferent (with respect to central tendency and spread) from those in the other \nthree tasks, which were all similar.   \nWe next address two specific questions about the chronometry of recall \nin the operation period task. Does recall timing change across the difficulty \n                                                           \n1 An overview of procedures for spoken response timing can be found at the \nURL: http:\/\/www.psych.lancs.ac.uk\/research\/TowseWM\/. A blind sample of \ntimings from an independent coder correlated with the present values, \nr(68)=.88. \n \n  \n7 \nlevels of the period task, and does recall timing change systematically across \nthe output sequence? \nFigure 1 displays the mean level of recall performance at the first, \nsecond, and third levels of the period task, where most data reside. It should \nbe borne in mind that we plot mean performance based on all the available \ndata. As a result fewer children contributed to scores at the third level relative \nthe first. This affects the size of the standard error bars, and comparisons \nbetween levels, in that more advanced task levels involve an especially able \nsubset of children. \nRepeated-measures analysis confirmed an increase in the length of the \ninterword pause across the three test levels, F(2,58)=3.27, p=.045, !p\n2=.101. \nSilent intervals between the recall of each item increased when the \nprocessing task took longer to complete. This supports the suggestion that on \nthese more demanding trials, items were less clearly represented in working \nmemory or were less accessible in some way.   \nThe second question concerns the timing of recall across output \nposition. Do children recall items from the end of the list more efficiently than \nthose at the beginning? The answer is yes. The length of the interword \npauses became shorter as the output sequence progressed. This was reliable \nfor the first and second test level [F(2,88)=13.0, p<.001, !p\n2=.228, and \nF(2,92)=19.8, p<.001, !p\n2=.302 respectively]. The trend at the third level \napproached significance, F(2,58)=2.91, p=.080, !p\n2=.091. Word duration also \nbecame shorter across the output sequence for each test level \n[F(3,129)=16.0, p<.001, !p\n2=.275, F(3,138)=7.05, p=.001, !p\n2=.133, and \nF(3,87)=7.62, p<.001, !p\n2=.208 for the first to third level respectively]. \nContrasting with analyses of words and pauses, the preparatory \ninterval durations did not change across period level, F(2,58)=2.15, p=.140 \n!p\n2=.069. This is consistent with other immediate memory studies where \npreparatory intervals do not vary consistently with list length (Cowan et al., \n1998; Cowan et al., 2003; Towse, Cowan, Horton et al., in press). \nIndividual differences in performance \nFinally, we consider individual differences in recall timing. Timing \nvariables in operation period are internally consistent. We obtained reliable \ncorrelations between total recall durations for the first and second levels, \nr(43)=.814, p<.001,  the second and third levels, r(28)=.585, p=.001 as well as \nthe first and third, r(28)=.612, p<.001, a pattern obtained with specific recall \ncomponents too [e.g., for interword pauses, r(43)=.782, p<.001, r(28)=.604, \np=.001, & r(28)=.510, p=.004  respectively].  \nThe total duration of sequence recall (n=30 for children with data \ncombined across levels) did not correlate significantly with the period score \n(the number of correct sequences), r(28)=-.259, p=.166, or ability as indexed \nby BAS, r(28)=-.198, p=.294. Nonetheless, across trial sets there was \nevidence of change in what recall timing variables measured. The interword \npauses at just the first level were negatively associated with ability, r(28)=-\n.369, p=.045 such that pauses were shorter among children of higher ability. \nThe strength of this association declined when pause measurements came \nfrom the second level, r(28)=-.267, p=.154, and declined again using pauses \nfrom the third, r(28)=-.015, p=.936. In other words, recall pauses reliably \npredicted cognitive ability, but only for the initial trials.  \n  \n8 \nThe group data indicates longer recall pauses at the more demanding \ntask levels. Individual differences support this pattern; the time taken by an \nindividual to answer the arithmetic problems across all task levels was \ncorrelated with their average interword pause in recall, r(28)=.443, p=.014. \nThere was no corresponding relationship with word duration at recall, \nr(28)=.09, p=.639, so this is unlikely to be simply a global speed of processing \neffect; instead it suggests that period level affects item accessibility. \nDiscussion \n \nThe working memory period paradigm combines a fixed number of \nmemoranda with systematic changes to the processing requirements that \naccompany them. Thus, in the operation period task, the participant calculates \nthe answers to a constant number of multi-term arithmetic problems and \nremembers these answers for later recall. The arithmetic problems become \nprogressively longer across sets of trials.  The logic behind the task is that as \nthe duration of the processing activity increases, so there is an increased \nopportunity for the working memory representations to become degraded to \nthe point when recall is no longer successful (a logic that holds regardless of \nthe causal mechanism for the loss of item accessibility). Of course, these \nchanges in trial length are the result of manipulating what processing \nparticipants do, and the content of processing may contribute to the observed \nphenomena as well as its duration (see comments in Saito & Miyake, 2004; \nTowse et al., 2005). \nThe current analysis of the chronometry of recall helps to demonstrate \nthat the fragility of memory increases as the processing component of the \nperiod task becomes more challenging. Children take significantly longer to \nproduce the correct memory answers on more demanding period trials, \nconsistent with the idea that the memoranda have become less accessible \n(individual-difference analysis also supports this finding) - this diminution in \nitem accessibility could be conceived either in absolute or relative terms (ie \nloss of item integrity per se or changes in discriminability relative to others \nitems). Moreover, other things being equal, one might expect recall to quicker \nas the task progresses, due to the benefits of practice (Towse, Cowan, Horton \net al., in press). Thus the present findings probably underestimate the effect of \nincreasing task demand.  \nSuch evidence for changes in the (absolute or relative) accessibility of \nrecall items supports the argument that working memory recall involves the \nrevival of less-than-complete representations (Towse et al, in press). A related \nargument has been expressed by Unsworth and Engle (2006b). They propose \nthat adults recall items either directly from (highly active) primary memory or \nindirectly from (cue dependent) secondary memory with the latter taken to \ninvolve memory search processes. Table 1 suggests that cued search in \noperation span and period is, on the one hand slower than digit span recall \nsuggesting these tasks involve a greater contribution from secondary \nmemory, whilst on the other hand search is much quicker than for reading \nspan - which notably involves unique processing and memoranda events. \nIn short-term memory paradigms, interword pauses typically increase \nwith the number of items to report (Cowan et al., 1994). Competition from \nextra response words offers one explanation for this effect. The present data \nsuggest the operation of an additional factor; when the task is more difficult \n  \n9 \nand each item less securely remembered, an item’s search and production \nprocess becomes slower. \nMore specific analysis of recall within the trial sequence shows \nreduction in the interword pauses and word duration as one progresses \nthrough recall (cf., Cowan, 1992). Adult interword pauses can also exhibit \nposition effects (Haberlandt et al., 2005). Several factors may operate here. \nFirst, we suggest that children can at least partially restrict recall processes to \nact on those items not yet produced (i.e., implement a search and drop \nstrategy, or sampling without replacement). Second, keeping sequence length \nconstant in the period task may encourage such non-exhaustive search \nstrategies. Third, later sequence items may be accessed to a greater extent \nthrough (quicker) primary memory processes (Unsworth & Engle, 2006a). \nAlongside pause effects, differences in word production suggest articulation is \nnot modular, but also incorporates concurrent recall processes (Haberlandt et \nal., 2005). \nIndividual differences confirm that recall timing measures are reliable \nalthough the overall duration of recall does not predict separate ability \nmeasures.  However, recall pauses from initial period trials did predict ability \nand recall accuracy. This replicates reading span data from Towse, Cowan, \nHorton et al. (in press) who demonstrated that task experience, independent \nof absolute difficulty can produce rapid changes in what working memory \nvariables truly measure. They too found initial task performance was most \nhighly predictive of ability and also noted changes in the properties of \ninterword pauses with sequence length. Notwithstanding this specific \ncorrespondence, we recognize that the current sample size is modest for \nconsidering individual differences, and thus correlational outcomes should be \ntreated with a certain caution. \nIn conclusion, while the working memory span paradigm is highly \ninfluential and we expect it to remain an influential vehicle for investigating \ncomplex memory, the present research shows that working memory period \ncan be an informative and tractable procedure too. Span tasks focus on \ncorrect or failed recall and consequently one might conceive of the fate of \nencoded items as either remembered or forgotten. Whilst such a broad \ndichotomy is valuable at a general level, the present research indicates that \nmemory representations can actually involve more subtle, graded forms (for a \nbroader perspective, see Munakata, O’Reilly & Morton, 2007). There can be \nquantitative differences in the accessibility of remembered items, shown here \nwith respect to processing duration and recall sequence position, and initial \nrecall pauses correlate with ability measures. In sum, the chronometry of \nrecall yields evidence about working memory processes that may be vital for a \nfuller understanding of this important system. \n \nReferences \n \nBaddeley, A. D. (1986). Working Memory. Oxford: Clarendon Press. \nBaddeley, A. D., & Hitch, G. J. (2000). Development of working memory: Should the \nPascual-Leone and the Baddeley and Hitch models be merged? Journal of \nExperimental Child Psychology, 77(2), 128-137. \nCase, R., Kurland, M., & Goldberg, J. (1982). Operational efficiency and the growth of short \nterm memory span. Journal of Experimental Child Psychology, 33, 386-404. \nConway, A. R., Jarrold, C., Kane, M., Miyake, A., & Towse, J. N. (Eds.). (2007). Variation in \n  \n10 \nWorking Memory. New York: Oxford University Press. \nCowan, N. (1999). The differential maturation of two processing rates related to digit span. \nJournal of Experimental Child Psychology, 72, 193-209. \nCowan, N., Keller, T. A., Hulme, C., Roodenrys, S., McDougall, S., & Rack, J. (1994). Verbal \nmemory span in children: Speech timing cues to the mechanisms underlying age and \nword length effects. Journal of Memory and Language, 33, 234-250. \nCowan, N., Towse, J. N., Hamilton, Z., Saults, J. S., Elliott, E. M., Lacey, J. F., et al. (2003). \nChildren's working memory processes: A response-timing analysis. Journal of \nExperimental Psychology: General, 132(1), 113-132. \nCowan, N., Wood, N. L., Wood, P. K., Keller, T. A., Nugent, L. D., & Keller, C. V. (1998). \nTwo separate verbal processing rates contributing to short-term memory span. \nJournal of Experimental Psychology: General, 127(2), 141-160. \nDaneman, M., & Carpenter, P. A. (1980). Individual differences in working memory and \nreading. Journal of Verbal Learning and Verbal Behavior, 19, 450-466. \nElliot, C. D., Smith, P., & McCulloch, K. (1997). British Abilities Scale Second Edition (BAS \nII) Technical manual. Windsor, Berkshire: NFER-Nelson. \nHaberlandt, K., Lawrence, H., Krohn, T., Bowe, K., & Thomas, J. G. (2005). Pauses and \ndurations exhibit a serial position effect. Psychonomic Bulletin & Review, 12(1), 152-\n158. \nHalliday, M. S., & Hitch, G. J. (1988). Developmental applications of working memory. In G. \nClaxton (Ed.), New directions in cognition (pp. 193-222). London: Routledge and \nKeegan Paul. \nHitch, G. J., & Halliday, M. S. (1983). Working memory in children. Philosophical \nTransactions of the Royal Society of London, 302(B), 325-340. \nHulme, C., Newton, P., Cowan, N., Stuart, G., & Brown, G. (1999). Think before you speak: \nPauses, memory search and trace redintegration processes in verbal memory span. \nJournal of Experimental Psychology: Learning, Memory and Cognition, 25(2), 1-18. \nHutton, U. M. Z. (2005). The similarities and differences between STM and WM tasks across \ndevelopment. Unpublished doctoral dissertation, Royal Holloway University of \nLondon. \nMunakata, Y., O'Reilly, R., & Morton, J. B. (2007). Developmental and computational \napproaches to variation in working memory. In A. R. A. Conway, C. Jarrold, M. J. \nKane, A. Miyake & J. N. Towse (Eds.), Variation in working memory (pp. 162-193). \nNew York: Oxford University Press. \nSaito, S., & Miyake, A. (2004). On the nature of forgetting and the processing-storage \nrelationship in reading span performance. Journal of Memory and Language, 50, \n425-443. \nTowse, J. N., & Cowan, N. (2005). Working memory and its relevance for cognitive \ndevelopment. In W. Schneider, R. Schumann-Hengsteler & B. Sodian (Eds.), Young \nChildren’s Cognitive Development: Interrelationships among Executive Functioning, \nWorking Memory, Verbal Ability, and Theory of Mind (pp. 9-37). Mahwah, NJ: \nLawrence Erlbaum Associates. \nTowse, J. N., Cowan, N., Hitch, G. J., & Horton, N. (in press). The recall of information from \nworking memory: insights from behavioural and chronometric perspectives. \nExperimental Psychology. \nTowse, J. N., Cowan, N., Horton, N., & Whytock, S. (in press). Task experience and \nchildren's working memory performance: A perspective from recall timing. \nDevelopmental Psychology. \nTowse, J. N., Hitch, G. J., Hamilton, Z., Peacock, K., & Hutton, U. M. Z. (2005). Working \nmemory period: the endurance of mental representations. Quarterly Journal of \nExperimental Psychology, 58A(3), 547-571. \nTowse, J. N., Hitch, G. J., & Horton, N. (2007). Working memory as the interface between \nprocessing and retention: A developmental perspective. Advances in Child \nDevelopment and Behavior, 35, 219-251. \nUnsworth, N., & Engle, R. W. (2006a). Simple and complex memory spans and their relation \n  \n11 \nto fluid abilities: Evidence from list-length effects. Journal of Memory and Language, \n54, 68-80. \nUnsworth, N., & Engle, R. W. (2006b). A temporal–contextual retrieval account of complex \nspan: An analysis of errors. Journal of Memory and Language, 54(3), 346-362. \n  \n12 \nTable 1. The chronometric profile of correct recall for operation period (second task level) and four-item operation span trials \n(standard errors in parentheses). To facilitate comparison with other tasks, we have calculated and included comparable recall \ntimes for equivalent reading span and digit span trials. PI = preparatory interval; Wd1 = first word recalled; Pse1 = first interword \npause; Wd2 = second word recalled; Pse2 = second interword pause; Wd3 = third word recalled; Pse3 = third interword pause; \nWd4 = fourth word recalled. Digit span data derived from Cowan et al. (2003). Reading span data derived from Towse et al. (in \npress). \n \n__________________________________________________________________________________________________________________________________ \nRecall segment \nPI  Wd1  Pse1  Wd2  Pse2  Wd3  Pse3  Wd4 \n________________________________________________________________________________________________________________ \nOperation period .647 (.040) .482 (.018) .665 (.057) .430 (.017) .592 (.069) .438 (.017) .411 (.042) .416 (.015) \nOperation Span .679 (.056) .474 (.022) .568 (.052) .501 (.074) .595 (.069) .411 (.018) .423 (.048) .392 (.018) \n \nReading Span 1.935 (.443) .591 (.037) 1.302 (.453) .598 (.034) 1.067 (.184) .593 (.041) .655 (.137) .464 (.026) \nDigit span .665 (.045) .419 (.016) .172 (.034) .395 (.017) .211 (.044) .364 (.014) .130 (.027) .501 (.014) \n_________________________________________________________________________________________________________________________________\n  \n13 \nFigure 1. Recall timing as a function of the period test level. Data are broken \ndown for each recall segment, showing mean duration and standard error \nbars. PI = preparatory interval; Wd1 = first word recalled; Pse1 = first \ninterword pause; Wd2 = second word recalled; Pse2 = second interword \npause; Wd3 = third word recalled; Pse3 = third interword pause; Wd4 = fourth \nword recalled.  \nPI Wd1 Pse1 Wd2 Pse2 Wd3 Pse3 Wd4\n0.0\nFirst period level\nSecond period level\nThird period level\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1.0\nResponse segment\nR\ne\nc\na\nll \nd\nu\nra\nti\no\nn\n (\ns\ne\nc\no\nn\nd\ns\n)\n \n"}