{"doi":"10.1080\/17449057.2011.570985","coreId":"195920","oai":"oai:lra.le.ac.uk:2381\/8052","identifiers":["oai:lra.le.ac.uk:2381\/8052","10.1080\/17449057.2011.570985"],"title":"Migration, Ethnonationalist Destinations and Social Divisions: Non-Jewish Immigrants in Israel","authors":["Bartram, David"],"enrichments":{"references":[{"id":44732471,"title":"A rejoinder to the 'ethnic democracy' debate,","authors":[],"date":"1999","doi":"10.2979\/isr.1999.4.1.44","raw":"Gavison, R. (1999) A rejoinder to the 'ethnic democracy' debate, Israel Studies, 4(1), pp. 44-72.","cites":null},{"id":44732428,"title":"Asian migrant and contract workers in the Middle East, in: R. Cohen (ed), The Cambridge survey of world migration,","authors":[],"date":"1995","doi":null,"raw":"Abella, M. (1995) Asian migrant and contract workers in the Middle East, in: R. Cohen (ed), The Cambridge survey of world migration, pp. 418-423 (Cambridge: Cambridge University Press).","cites":null},{"id":44732563,"title":"Being Israeli: the dynamics of multiple citizenship (Cambridge:","authors":[],"date":"2002","doi":"10.1017\/cbo9781139164641","raw":"Shafir, G. and Peled, Y. (2002) Being Israeli: the dynamics of multiple citizenship (Cambridge: Cambridge University Press).","cites":null},{"id":44732463,"title":"Between Neo-Liberalism and Ethno-Nationalism: The Policy and Law of Deporting Migrant Workers,","authors":[],"date":"2006","doi":null,"raw":"Dahan, Y. and Gill, A. (2006) Between Neo-Liberalism and Ethno-Nationalism: The Policy and Law of Deporting Migrant Workers, Mishpat u'Mimshal, 10(1), pp. 347-385 (in Hebrew).","cites":null},{"id":44732533,"title":"Birds of passage: migrant labor and industrial societies (Cambridge:","authors":[],"date":"1979","doi":"10.1017\/cbo9780511572210","raw":"Piore, M.J. (1979) Birds of passage: migrant labor and industrial societies (Cambridge: Cambridge University Press).","cites":null},{"id":44732585,"title":"Birthing &quot;invisible&quot; children: State power, NGO activism, and reproductive health among illegal migrant workers in Tel Aviv, Israel,","authors":[],"date":"2005","doi":"10.1215\/15525864-2005-2003","raw":"Willen, S.S. (2005) Birthing &quot;invisible&quot; children: State power, NGO activism, and reproductive health among illegal migrant workers in Tel Aviv, Israel, Journal of Middle East Women's Studies, 1(2), pp. 55-88.","cites":null},{"id":44732502,"title":"Christian Aliens in The Jewish State: Undocumented Migrants from Latin America Striving for Practical National Belonging in Israel (PhD Thesis:","authors":[],"date":"2006","doi":null,"raw":"Kalir, B. (2006) Christian Aliens in The Jewish State: Undocumented Migrants from Latin America Striving for Practical National Belonging in Israel (PhD Thesis: University of Amsterdam).","cites":null},{"id":44732490,"title":"Cities and citizenship (Durham:","authors":[],"date":"1999","doi":"10.1215\/9780822396321","raw":"Holston, J. (1999) Cities and citizenship (Durham: Duke University Press).","cites":null},{"id":44732561,"title":"Citizenship and membership in the Israeli polity, in: D.B. Klusmeyer and T.A. Aleinikoff (eds), From migrants to citizens: membership in a changing world,","authors":[],"date":"2000","doi":null,"raw":"Shachar, A. (2000) Citizenship and membership in the Israeli polity, in: D.B. Klusmeyer and T.A. Aleinikoff (eds), From migrants to citizens: membership in a changing world, pp. 386-433 (Washington, D.C.: Carnegie Endowment for International Peace).","cites":null},{"id":44732528,"title":"Citizenship Betrayed: Israel’s Emerging Immigration and Citizenship Regime, Theoretical Inquiries in Law, 8(2),","authors":[],"date":"2007","doi":"10.2202\/1565-3404.1162","raw":"Peled, Y. (2007) Citizenship Betrayed: Israel’s Emerging Immigration and Citizenship Regime, Theoretical Inquiries in Law, 8(2), Article 10.","cites":null},{"id":44732473,"title":"Civic Equality Does Not Mean","authors":[],"date":"2008","doi":null,"raw":"Gavison, R. (2008) Civic Equality Does Not Mean Freedom of Immigration, HaAretz, 14 July.","cites":null},{"id":44732515,"title":"Clash of Identities: Explorations","authors":[],"date":"2008","doi":"10.1177\/02685809100250021104","raw":"Kimmerling, B. (2008) Clash of Identities: Explorations in Israeli and Palestinian Societies (New York: Columbia University Press).","cites":null},{"id":44732537,"title":"Consuming the Holy Spirit in the holy land: evangelical churches, labor migrants, and the Jewish state, in:","authors":[],"date":"2004","doi":"10.5040\/9781474214650.ch-009","raw":"Raijman, R. and Kemp, A. (2004) Consuming the Holy Spirit in the holy land: evangelical churches, labor migrants, and the Jewish state, in: Y.S. Carmeli and K. Applbaum (eds), Consumption and market society in Israel, pp. 163-184 (Oxford: Berg).","cites":null},{"id":44732511,"title":"Contesting the limits of political participation:","authors":[],"date":"2000","doi":"10.1080\/014198700329141","raw":"Kemp, A., Raijman, R., Resnik, J. and Schammah Gesser, S. (2000) Contesting the limits of political participation: Latinos and Black African migrant workers in Israel, Ethnic and Racial Studies, 23(1), pp. 94-119.","cites":null},{"id":44732547,"title":"Contextualizing recognition, absence of recognition, and misrecognition: the case of migrant workers' children in daycares in Israel,","authors":[],"date":"2009","doi":"10.1080\/00220270802647753","raw":"Resnik, J. (2009) Contextualizing recognition, absence of recognition, and misrecognition: the case of migrant workers' children in daycares in Israel, Journal of Curriculum Studies, 41(5), pp. 625-649.","cites":null},{"id":44732591,"title":"Continuity and Change in Israeli Society: The Test of the Melting Pot,","authors":[],"date":"2005","doi":"10.2979\/isr.2005.10.2.91","raw":"Ya'ar, E. (2005) Continuity and Change in Israeli Society: The Test of the Melting Pot, Israel Studies, 10(2), pp. 91-128.","cites":null},{"id":44732571,"title":"Convergence in Foreigners' Rights and Citizenship Laws? A Look at","authors":[],"date":"2008","doi":"10.1111\/j.1747-7379.2008.00137.x","raw":"Surak, K. (2008) Convergence in Foreigners' Rights and Citizenship Laws? A Look at Japan, International Migration Review, 42(3), pp. 550-575.","cites":null},{"id":44732467,"title":"Cultural identity and minority status in Japan, in:","authors":[],"date":"2006","doi":null,"raw":"De Vos, G. and Wagatsuma, H. (2006) Cultural identity and minority status in Japan, in: G. De Vos, L. Romanucci-Ross, and T. Tsuda (eds), Ethnic Identity: Problems and Prospects for the Twentyfirst Century, pp. 119-156 (Lanham: Altamira Press).","cites":null},{"id":44732457,"title":"Cultural pluralism and the Israeli nation-building ideology,","authors":[],"date":"1995","doi":"10.1017\/s0020743800062504","raw":"Cohen-Almagor, R. (1995) Cultural pluralism and the Israeli nation-building ideology, International Journal of Middle Eastern Studies, 27(4), pp. 461-484.","cites":null},{"id":44732545,"title":"Demographic trends in Israel (Jerusalem: Merkaz Metzilah).","authors":[],"date":"2009","doi":null,"raw":"Rebhun, U. and Malach, G. (2009) Demographic trends in Israel (Jerusalem: Merkaz Metzilah).","cites":null},{"id":44732593,"title":"Despite the ultra-Orthodox,","authors":[],"date":"2009","doi":null,"raw":"Yakobson, A. (2009) Despite the ultra-Orthodox, HaAretz, 8 July.","cites":null},{"id":44732504,"title":"Ethiopian Jews in Israel: a part of the people or apart from the people?, in: U. Rebhun and C. Waxman (eds), Jews in Israel: contemporary social and cultural patterns,","authors":[],"date":"2004","doi":null,"raw":"Kaplan, S. and Salamon, H. (2004) Ethiopian Jews in Israel: a part of the people or apart from the people?, in: U. Rebhun and C. Waxman (eds), Jews in Israel: contemporary social and cultural patterns, pp. 118-148 (Hanover: Brandeis University Press\/University Press of New England).","cites":null},{"id":44732487,"title":"Ethnic and immigrant residential concentration, and crime rates,","authors":[],"date":"2009","doi":"10.1016\/j.jcrimjus.2009.07.002","raw":"Herzog, S. (2009) Ethnic and immigrant residential concentration, and crime rates, Journal of Criminal Justice, 37(5), pp. 427-434.","cites":null},{"id":44732447,"title":"Ethnic Convergence Processes under Conditions of Persisting SocioeconomicDecreasing Cultural Differences: The Case of Israeli Society,","authors":[],"date":"1994","doi":"10.2307\/2546732","raw":"Benski, T. (1994) Ethnic Convergence Processes under Conditions of Persisting SocioeconomicDecreasing Cultural Differences: The Case of Israeli Society, International Migration Review, 28(2), pp. 256-280.","cites":null},{"id":44732465,"title":"Ethnic pluralism: conflict and accommodation, in:","authors":[],"date":"2006","doi":"10.2307\/2803250","raw":"De Vos, G. (2006) Ethnic pluralism: conflict and accommodation, in: L. Romanucci-Ross, G.A. De Vos, and T. Tsuda (eds), Ethnic identity: problems and prospects for the twenty-first century, pp. 1-36 (Lanham: AltaMira Press).","cites":null},{"id":44732503,"title":"Finding Jesus in the Holy Land and Taking Him to China: Chinese Temporary Migrant Workers in Israel Converting to Evangelical Christianity,","authors":[],"date":"2009","doi":"10.1093\/socrel\/srp027","raw":"Kalir, B. (2009) Finding Jesus in the Holy Land and Taking Him to China: Chinese Temporary Migrant Workers in Israel Converting to Evangelical Christianity, Sociology of Religion, 70(2), pp. 130-156.","cites":null},{"id":44732575,"title":"For our soul: Ethiopian Jews in Israel (Detroit: Wayne State","authors":[],"date":"1993","doi":"10.1017\/s0364009400007339","raw":"Wagaw, T.G. (1993) For our soul: Ethiopian Jews in Israel (Detroit: Wayne State University Press).","cites":null},{"id":44732492,"title":"Foreign workers' kids: 1,500 to stay, 800 to go, HaAretz,","authors":[],"date":"2007","doi":null,"raw":"Ilan, S. and Azouly, Y. (2007) Foreign workers' kids: 1,500 to stay, 800 to go, HaAretz, 20 June.","cites":null},{"id":44732459,"title":"From overt rejection to enthusiastic embracement: changing state discourses on","authors":[],"date":"2007","doi":"10.1007\/s10708-007-9075-y","raw":"Cohen, N. (2007) From overt rejection to enthusiastic embracement: changing state discourses on Israeli emigration, GeoJournal, 68(2-3), pp. 267-728.","cites":null},{"id":44732549,"title":"Guests come to stay: the effects of European labor migration on sending and receiving countries (Boulder:","authors":[],"date":"1985","doi":"10.2307\/1960939","raw":"Rogers, R. (1985) Guests come to stay: the effects of European labor migration on sending and receiving countries (Boulder: Westview Press).","cites":null},{"id":44732482,"title":"How Do You Prove You’re a Jew?,","authors":[],"date":"2008","doi":null,"raw":"Gorenberg, G. (2008) How Do You Prove You’re a Jew?, New York Times, 2 March.","cites":null},{"id":44732497,"title":"How immigration is changing citizenship: a comparative view,","authors":[],"date":"1999","doi":"10.1080\/014198799329323","raw":"Joppke, C. (1999) How immigration is changing citizenship: a comparative view, Ethnic and Racial Studies, 22(4), pp. 629-652.","cites":null},{"id":44732583,"title":"Ignoring Arab women, ministry okays 3,000 new foreign workers, HaAretz,","authors":[],"date":"2009","doi":null,"raw":"Weiler-Polak, D. (2009b) Ignoring Arab women, ministry okays 3,000 new foreign workers, HaAretz, 22 October.","cites":null},{"id":44732434,"title":"Imagined Communities: Reflections on the Origin and Spread of Nationalism","authors":[],"date":"1983","doi":"10.2307\/1858850","raw":"Anderson, B. (1983) Imagined Communities: Reflections on the Origin and Spread of Nationalism (London: Verso).","cites":null},{"id":44732535,"title":"Immigrant America: a portrait (Berkeley:","authors":[],"date":"1996","doi":"10.1086\/jar.64.2.20371252","raw":"Portes, A. and Rumbaut, R. (1996) Immigrant America: a portrait (Berkeley: University of California Press).","cites":null},{"id":44732485,"title":"Immigrants in Turmoil: Mass Immigration to Israel and its Repercussions in the 1950s and After (Syracuse:","authors":[],"date":"2003","doi":"10.1353\/jqr.2007.0049","raw":"Hacohen, D. (2003) Immigrants in Turmoil: Mass Immigration to Israel and its Repercussions in the 1950s and After (Syracuse: Syracuse University Press).","cites":null},{"id":44732430,"title":"Immigration and ethnic formation in a deeply divided society: the case of the 1990s immigrants from the Former Soviet Union in Israel","authors":[],"date":"2004","doi":"10.1353\/sho.2005.0174","raw":"Al-Haj, M. (2004) Immigration and ethnic formation in a deeply divided society: the case of the 1990s immigrants from the Former Soviet Union in Israel (Boston: Brill).","cites":null},{"id":44732501,"title":"Informal agencies of socialization and the integration of immigrant youth into society: an example from Israel,","authors":[],"date":"1986","doi":"10.2307\/2545682","raw":"Kahane, R. (1986) Informal agencies of socialization and the integration of immigrant youth into society: an example from Israel, International Migration Review, 20(1), pp. 21-39.","cites":null},{"id":44732500,"title":"Integrating Immigrants in Liberal Nation-States: Policies and Practices, in: C. Joppke and E. Morawska (eds), Toward assimilation and citizenship: immigrants in liberal nation-states,","authors":[],"date":"2003","doi":"10.1057\/9780230554795_1","raw":"Joppke, C. and Morawska, E. (2003) Integrating Immigrants in Liberal Nation-States: Policies and Practices, in: C. Joppke and E. Morawska (eds), Toward assimilation and citizenship: immigrants in liberal nation-states, pp. 1-36 (Basingstoke: Palgrave Macmillan).","cites":null},{"id":44732484,"title":"Inter-Religious Marriages in Israel: Gendered Implications for Conversion,","authors":[],"date":"2009","doi":"10.2979\/isr.2009.14.2.178","raw":"Hacker, D. (2009) Inter-Religious Marriages in Israel: Gendered Implications for Conversion, Children, and Citizenship, Israel Studies, 14(2), pp. 178-197.","cites":null},{"id":44732438,"title":"International labor migration: foreign workers and public policy","authors":[],"date":"2005","doi":"10.1057\/9780230508170_3","raw":"Bartram, D. (2005) International labor migration: foreign workers and public policy (New York: Palgrave Macmillan).","cites":null},{"id":44732541,"title":"International migration, domestic work, and care work: undocumented Latina migrants in Israel,","authors":[],"date":"2003","doi":"10.1177\/0891243203255762","raw":"Raijman, R., Schammah-Gesser, S. and Kemp, A. (2003) International migration, domestic work, and care work: undocumented Latina migrants in Israel, Gender & Society, 17(5), pp. 727-749.","cites":null},{"id":44732446,"title":"Is Israel One? Religion, Nationalism, and Multiculturalism Confounded","authors":[],"date":"2005","doi":"10.2979\/isr.2007.12.3.175","raw":"Ben-Rafael, E. and Peres, Y. (2005) Is Israel One? Religion, Nationalism, and Multiculturalism Confounded (Leiden: Brill).","cites":null},{"id":44732520,"title":"Israel as a non-Arab state: the political implications of mass immigration of nonJews,","authors":[],"date":"1999","doi":null,"raw":"Lustick, I. (1999) Israel as a non-Arab state: the political implications of mass immigration of nonJews, Middle East Journal, 53(3), pp. 101-117.","cites":null},{"id":44732573,"title":"Israel: the Oriental majority (London:","authors":[],"date":"1989","doi":null,"raw":"Swirsky, S. (1989) Israel: the Oriental majority (London: Zed Books).","cites":null},{"id":44732555,"title":"Jewish kinship at a crossroads: lessons for homelands and diasporas,","authors":[],"date":"2002","doi":"10.2307\/798184","raw":"Schain, Y. (2002) Jewish kinship at a crossroads: lessons for homelands and diasporas, Political Science Quarterly, 117(2), pp. 279-309.","cites":null},{"id":44732453,"title":"Jewish schools to admit pupils on religion, not race, after high court ruling,","authors":[],"date":"2009","doi":null,"raw":"Butt, R. (2009) Jewish schools to admit pupils on religion, not race, after high court ruling, The Guardian, 31 July.","cites":null},{"id":44732449,"title":"L'émergence d'une Tel Aviv cosmopolite ou les effets d'un fin mélange entre reconfigurations sociopolitiques internes et externes, Cahiers de la","authors":[],"date":"2003","doi":null,"raw":"Berthomière, W. (2003) L'émergence d'une Tel Aviv cosmopolite ou les effets d'un fin mélange entre reconfigurations sociopolitiques internes et externes, Cahiers de la Méditerranée, 67.","cites":null},{"id":44732539,"title":"Labor migration, managing the ethno-national conflict, and client politics in Israel, in:","authors":[],"date":"2007","doi":null,"raw":"Raijman, R. and Kemp, A. (2007) Labor migration, managing the ethno-national conflict, and client politics in Israel, in: S.S. Willen (ed), Transnational Migration to Israel in Global Comparative Context, pp. 31-50 (Plymouth: Lexington Books).","cites":null},{"id":44732562,"title":"Land, labor, and the origins of the Israeli-Palestinian conflict, 1882-1914 (Cambridge:","authors":[],"date":"1989","doi":"10.1017\/s0147547900010425","raw":"Shafir, G. (1989) Land, labor, and the origins of the Israeli-Palestinian conflict, 1882-1914 (Cambridge: Cambridge University Press).","cites":null},{"id":44732522,"title":"Leadership et pouvoir dans les communautés d’origine immigrée","authors":[],"date":"1992","doi":null,"raw":"Martiniello, M. (1992) Leadership et pouvoir dans les communautés d’origine immigrée (Paris: L'Harmattan).","cites":null},{"id":44732595,"title":"Learning from the Judaization of Israel\/Palestine, in:","authors":[],"date":"2004","doi":null,"raw":"Yiftachel, O. and Ghanem, A. (2004) Learning from the Judaization of Israel\/Palestine, in: E.P. Kaufmann (ed), Rethinking ethnicity: majority groups and dominant minorities, pp. 179-197 (London: Routledge).","cites":null},{"id":44732565,"title":"Let the convert beware,","authors":[],"date":"2009","doi":null,"raw":"Sheleg, Y. (2009) Let the convert beware, HaAretz, 4 April.","cites":null},{"id":44732432,"title":"Local migrant policies in a guestworker regime: the case of Tel Aviv,","authors":[],"date":"2007","doi":null,"raw":"Alexander, M. (2007) Local migrant policies in a guestworker regime: the case of Tel Aviv, in: S.S. Willen (ed), Transnational Migration to Israel in Global Comparative Context, pp. 73-86 (Plymouth: Lexington Books).","cites":null},{"id":44732436,"title":"Managing global migration: a strategy for immigration policy in Israel (Jerusalem: Merkaz Metzilah,","authors":[],"date":"2009","doi":null,"raw":"Avineri, S., Orgad, L. and Rubinstein, A. (2009) Managing global migration: a strategy for immigration policy in Israel (Jerusalem: Merkaz Metzilah, in Hebrew).","cites":null},{"id":44732508,"title":"Managing Migration, Reprioritizing National Citizenship: Undocumented Migrant Workers’ Children and Policy Reforms","authors":[],"date":"2007","doi":"10.2202\/1565-3404.1164","raw":"Kemp, A. (2007) Managing Migration, Reprioritizing National Citizenship: Undocumented Migrant Workers’ Children and Policy Reforms in Israel, Theoretical Inquiries in Law, 8(2), Article 12.","cites":null},{"id":44732461,"title":"Migration Patterns to and from Israel,","authors":[],"date":"2009","doi":"10.1007\/s12397-009-9012-0","raw":"Cohen, Y. (2009) Migration Patterns to and from Israel, Contemporary Jewry, 29(2), pp. 115-125.","cites":null},{"id":44732551,"title":"Migration regimes and social rights: migrant workers in the Israeli welfare state, in:","authors":[],"date":"2002","doi":"10.1525\/sp.2000.47.1.03x0279s","raw":"Rosenhek, Z. (2002) Migration regimes and social rights: migrant workers in the Israeli welfare state, in: D. Levy and Y. Weiss (eds), Challenging ethnic citizenship: German and Israeli perspectives on immigration, pp. 137-153 (Oxford: Berghahn).","cites":null},{"id":44732566,"title":"Migration to Israel: the mythology of 'uniqueness',","authors":[],"date":"1998","doi":"10.1111\/1468-2435.00031","raw":"Shuval, J. (1998) Migration to Israel: the mythology of 'uniqueness', International Migration, 36(1), pp. 3-24.","cites":null},{"id":44732569,"title":"Minority status in an ethnic democracy: The status of the Arab minority in Israel,","authors":[],"date":"1990","doi":"10.1080\/01419870.1990.9993679","raw":"Smooha, S. (1990) Minority status in an ethnic democracy: The status of the Arab minority in Israel, Ethnic and Racial Studies, 13(3), pp. 389-413.","cites":null},{"id":44732444,"title":"Mizrahi and Russian Challenges to Israel's Dominant Culture: Divergences and Convergences,","authors":[],"date":"2007","doi":"10.2979\/isr.2007.12.3.68","raw":"Ben-Rafael, E. (2007) Mizrahi and Russian Challenges to Israel's Dominant Culture: Divergences and Convergences, Israel Studies, 12(3), pp. 68-91.","cites":null},{"id":44732440,"title":"Multicultural society and everyday cultural racism: second generation of Ethiopian Jews in Israel's 'crisis of modernization',","authors":[],"date":"2008","doi":"10.1080\/01419870701568866","raw":"Ben-Eliezer, U. (2008) Multicultural society and everyday cultural racism: second generation of Ethiopian Jews in Israel's 'crisis of modernization', Ethnic and Racial Studies, 31(5), pp. 935-961.","cites":null},{"id":44732494,"title":"Nationalizing States and the Constitution of ‘Hollow Citizenship’: Israel and its Palestinian","authors":[],"date":"2007","doi":"10.1080\/17449050701448647","raw":"Jamal, A. (2007) Nationalizing States and the Constitution of ‘Hollow Citizenship’: Israel and its Palestinian Citizens, Ethnopolitics, 6(4), pp. 471-493.","cites":null},{"id":44732581,"title":"Netanyahu defers expulsion of children of migrant workers,","authors":[],"date":"2009","doi":null,"raw":"Weiler-Polak, D. (2009a) Netanyahu defers expulsion of children of migrant workers, HaAretz, 31 July.","cites":null},{"id":44732564,"title":"Not Halakhically Jewish: the Dilemma of Non-Jewish Immigrants in Israel (Jerusalem: Israeli Democracy Institute, Working Paper 51, in Hebrew).","authors":[],"date":"2004","doi":null,"raw":"Sheleg, Y. (2004) Not Halakhically Jewish: the Dilemma of Non-Jewish Immigrants in Israel (Jerusalem: Israeli Democracy Institute, Working Paper 51, in Hebrew).","cites":null},{"id":44732559,"title":"One People, One Blood: Ethiopian-Israelis and the Return to Judaism (Rutgers:","authors":[],"date":"2009","doi":"10.1111\/j.1548-1409.2012.01136.x","raw":"Seeman, D. (2009) One People, One Blood: Ethiopian-Israelis and the Return to Judaism (Rutgers: Rutgers University Press).","cites":null},{"id":44732553,"title":"Palestinian citizens in an ethnic Jewish state: identities in conflict (New Haven:","authors":[],"date":"1997","doi":"10.1177\/030639689904000418","raw":"Rouhana, N. (1997) Palestinian citizens in an ethnic Jewish state: identities in conflict (New Haven: Yale University Press).","cites":null},{"id":44732543,"title":"Perceived threat and exclusionary attitudes towards foreign workers in Israel,","authors":[],"date":"2004","doi":"10.1080\/0141987042000246345","raw":"Raijman, R. and Semyonov, M. (2004) Perceived threat and exclusionary attitudes towards foreign workers in Israel, Ethnic and Racial Studies, 27(5), pp. 780-799.","cites":null},{"id":44732506,"title":"Petah Tikva schools ordered to take in Ethiopian students,","authors":[],"date":"2009","doi":null,"raw":"Kashti, O., Ettinger, Y. and Weiler-Polak, D. (2009) Petah Tikva schools ordered to take in Ethiopian students, HaAretz, 2 September.","cites":null},{"id":44732589,"title":"Police! Open Up! Migrant Workers in Israel (Tel Aviv: Am Oved,","authors":[],"date":"2006","doi":null,"raw":"Wurgaft, N. (2006) Police! Open Up! Migrant Workers in Israel (Tel Aviv: Am Oved, in Hebrew).","cites":null},{"id":44732531,"title":"Present absentees': the functioning of manpower organizations in dealing with foreign workers in Israel, and their connections with government institutions, in: R. Natanson and L. Achdut (eds), The new laborers: workers from foreign countries in Israel,","authors":[],"date":"1999","doi":null,"raw":"Pilovsky, L. (1999) 'Present absentees': the functioning of manpower organizations in dealing with foreign workers in Israel, and their connections with government institutions, in: R. Natanson and L. Achdut (eds), The new laborers: workers from foreign countries in Israel, pp. 41-89 (Tel Aviv: HaKibbutz HaMeuchad, in Hebrew).","cites":null},{"id":44732475,"title":"Questioning 'Ethnic Democracy': A response to Sammy Smooha,","authors":[],"date":"1998","doi":"10.2979\/isr.1998.3.2.253","raw":"Ghanem, A., Rouhana, N. and Yiftachel, O. (1998) Questioning 'Ethnic Democracy': A response to Sammy Smooha, Israel Studies, 3(2), pp. 253-267.","cites":null},{"id":44732579,"title":"Religion, Blood and the Equality of Rights The Case of Ethiopian Jews","authors":[],"date":"1996","doi":"10.1163\/15718119620907256","raw":"Weil, S. (1996) Religion, Blood and the Equality of Rights The Case of Ethiopian Jews in Israel, International Journal on Minority and Group Rights, 4(3-4), pp. 397-412.","cites":null},{"id":44732499,"title":"Selecting by origin: ethnic migration in the liberal state (Cambridge:","authors":[],"date":"2005","doi":"10.1086\/600323","raw":"Joppke, C. (2005) Selecting by origin: ethnic migration in the liberal state (Cambridge: Harvard University Press).","cites":null},{"id":44732526,"title":"Shas – the challenge of Israeliness (Tel Aviv: Yediot Ahronot,","authors":[],"date":"2001","doi":null,"raw":"Peled, Y. (ed) (2001) Shas – the challenge of Israeliness (Tel Aviv: Yediot Ahronot, in Hebrew).","cites":null},{"id":44732577,"title":"Spheres of justice: a defense of pluralism and equality","authors":[],"date":"1983","doi":"10.1080\/05775132.1983.11470886","raw":"Walzer, M. (1983) Spheres of justice: a defense of pluralism and equality (New York: Basic Books).","cites":null},{"id":44732516,"title":"Sticking together: the Israeli experiment in pluralism (Washington DC:","authors":[],"date":"2002","doi":null,"raw":"Kop, Y. and Litan, R.E. (2002) Sticking together: the Israeli experiment in pluralism (Washington DC: Brookings Institution).","cites":null},{"id":44732518,"title":"Strangers in a strange land: international migration in Israel, Global Migration Perspectives (Global Commission on International Migration).","authors":[],"date":"2005","doi":null,"raw":"Kruger, M. (2005) Strangers in a strange land: international migration in Israel, Global Migration Perspectives (Global Commission on International Migration).","cites":null},{"id":44732510,"title":"Tel Aviv is not foreign to you: urban incorporation policy on labor migrants in Israel,","authors":[],"date":"2004","doi":"10.1111\/j.1747-7379.2004.tb00187.x","raw":"Kemp, A. and Raijman, R. (2004) 'Tel Aviv is not foreign to you: urban incorporation policy on labor migrants in Israel, International Migration Review, 38(1), pp. 26-51.","cites":null},{"id":44732451,"title":"Temporary and illegal labor migration: the Israeli experience,","authors":[],"date":"1997","doi":"10.1111\/1468-2435.00024","raw":"Borowski, A. and Yanai, U. (1997) Temporary and illegal labor migration: the Israeli experience, International Migration, 35(4), pp. 495-509.","cites":null},{"id":44732455,"title":"The age of migration (London:","authors":[],"date":"2009","doi":"10.1007\/978-1-349-26846-7","raw":"Castles, S. and Miller, M.J. (2009) The age of migration (London: Macmillan Press).","cites":null},{"id":44732557,"title":"The demographic development of Palestine, 1850-1882,","authors":[],"date":"1985","doi":"10.1017\/s0020743800029445","raw":"Schölch, A. (1985) The demographic development of Palestine, 1850-1882, International Journal of Middle East Studies, 17(4), pp. 485-505.","cites":null},{"id":44732442,"title":"The Emergence of Ethnicity: Cultural Groups and Social Conflict in Israel (Westport:","authors":[],"date":"1982","doi":"10.1017\/s0026318400012451","raw":"Ben-Rafael, E. (1982) The Emergence of Ethnicity: Cultural Groups and Social Conflict in Israel (Westport: Greenwood Press).","cites":null},{"id":44732513,"title":"The invention and decline of Israeliness: state, society, and the military (Berkeley:","authors":[],"date":"2001","doi":"10.2307\/3089203","raw":"Kimmerling, B. (2001) The invention and decline of Israeliness: state, society, and the military (Berkeley: University of California Press).","cites":null},{"id":44732524,"title":"The Right to Family Life and Civil","authors":[],"date":"2004","doi":null,"raw":"Merin, Y. (2004) The Right to Family Life and Civil Marriage under International Law and Its Implementation in the State of Israel, bepress Legal Series, #275.","cites":null},{"id":44732567,"title":"The sociology of migration in Israel: a critical view, in: E. Leshem and J. Shuval (eds), Immigration to Israel: sociological perspectives,","authors":[],"date":"1998","doi":null,"raw":"Shuval, J. and Leshem, E. (1998) The sociology of migration in Israel: a critical view, in: E. Leshem and J. Shuval (eds), Immigration to Israel: sociological perspectives, pp. 3-50 (London: Transaction Publishers).","cites":null},{"id":44732587,"title":"Transnational Migration to Israel in Global Comparative Context (Plymouth:","authors":[],"date":"2007","doi":"10.1017\/s2151348100000537","raw":"Willen, S.S. (2007) Transnational Migration to Israel in Global Comparative Context (Plymouth: Lexington Books).","cites":null},{"id":44732597,"title":"Wanted but not welcome: alien labor in Western development, in: W. Alonso (ed), Population in an interacting world,","authors":[],"date":"1987","doi":null,"raw":"Zolberg, A. (1987) Wanted but not welcome: alien labor in Western development, in: W. Alonso (ed), Population in an interacting world, pp. 36-73 (Cambridge, MA: Harvard University Press).","cites":null},{"id":44732469,"title":"Whose city is it? On urban planning and local knowledge in globalizing Tel Aviv-Jaffa, Planning Theory and Practice,","authors":[],"date":"2005","doi":"10.1080\/14649350500137051","raw":"Fenster, T. and Yacobi, H. (2005) Whose city is it? On urban planning and local knowledge in globalizing Tel Aviv-Jaffa, Planning Theory and Practice, 6(2), pp. 191-211.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-05-17","abstract":"Immigrants in ethno-nationalist destinations encounter difficulties of integration particularly to the extent that they lack shared ethnicity with natives. But an analysis of non-Jewish immigrants in Israel shows that lacking shared ethnicity is by no means an insurmountable obstacle to integration, even in strongly ethno-nationalist destinations. Non-Jewish immigrants – even those who entered as migrant workers – have achieved a certain degree of membership in Israeli society. Moreover, their presence has exacerbated certain divisions among Jewish Israelis. Even in ethno-nationalist destinations, then, the immigration of non-co-ethnics does not result only\/inevitably in divisions between immigrants and natives: it can also divide natives, while some immigrants and natives find a measure of common ground.Pre-prin","downloadUrl":"http:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/17449057.2011.570985#.UlVq5xAraQI","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/8052\/1\/Ethnopolitics%20LRA.pdf","pdfHashValue":"f81ee2bc62d48f98bdcc04f4178f5785270c6551","publisher":"Taylor & Francis (Routledge)","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/8052<\/identifier><datestamp>\n                2014-03-21T12:20:16Z<\/datestamp><setSpec>\n                com_2381_43<\/setSpec><setSpec>\n                com_2381_9551<\/setSpec><setSpec>\n                col_2381_427<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nMigration, Ethnonationalist Destinations and Social Divisions: Non-Jewish Immigrants in Israel<\/dc:title><dc:creator>\nBartram, David<\/dc:creator><dc:description>\nImmigrants in ethno-nationalist destinations encounter difficulties of integration particularly to the extent that they lack shared ethnicity with natives. But an analysis of non-Jewish immigrants in Israel shows that lacking shared ethnicity is by no means an insurmountable obstacle to integration, even in strongly ethno-nationalist destinations. Non-Jewish immigrants – even those who entered as migrant workers – have achieved a certain degree of membership in Israeli society. Moreover, their presence has exacerbated certain divisions among Jewish Israelis. Even in ethno-nationalist destinations, then, the immigration of non-co-ethnics does not result only\/inevitably in divisions between immigrants and natives: it can also divide natives, while some immigrants and natives find a measure of common ground.<\/dc:description><dc:description>\nPre-print<\/dc:description><dc:date>\n2010-06-16T12:48:00Z<\/dc:date><dc:date>\n2010-06-16T12:48:00Z<\/dc:date><dc:date>\n2011-05-17<\/dc:date><dc:type>\nJournal Article<\/dc:type><dc:identifier>\nEthnopolitics, 2011, 10 (2), pp. 235-252<\/dc:identifier><dc:identifier>\n1744-9057<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/8052<\/dc:identifier><dc:identifier>\nhttp:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/17449057.2011.570985#.UlVq5xAraQI<\/dc:identifier><dc:identifier>\n10.1080\/17449057.2011.570985<\/dc:identifier><dc:identifier>\n1744-9065<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nCopyright © 2011 The Editor of Ethnopolitics. Deposited with reference to the publisher’s archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:publisher>\nTaylor & Francis (Routledge)<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1744-9065","issn:1744-9057","1744-9065","1744-9057"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2011,"topics":[],"subject":["Journal Article"],"fullText":" \n \n \n \n \nMigration, Ethno-nationalist Destinations,  \nand Social Divisions:  \nNon-Jewish Immigrants in Israel \n \n \nFor Ethnopolitics 9:3, 2010 \n \n \n \nDavid Bartram \n \nDepartment of Sociology \nUniversity of Leicester \nUniversity Road \nLeicester LE1 7RH \nEngland \n \nt: +44 116 252 2724 \nf: +44 116 252 5259 \nd.bartram@le.ac.uk \n \n \n Migration, Ethno-nationalist Destinations, \nand Social Divisions: \nNon-Jewish Immigrants in Israel \n \nAbstract: \nImmigrants in ethno-nationalist destinations encounter difficulties of integration particularly \nto the extent that they lack shared ethnicity with natives.  But an analysis of non-Jewish \nimmigrants in Israel shows that lacking shared ethnicity is by no means an insurmountable \nobstacle to integration, even in strongly ethno-nationalist destinations.  Non-Jewish \nimmigrants – even those who entered as migrant workers – have achieved a certain degree \nof membership in Israeli society.  Moreover, their presence has exacerbated certain \ndivisions among Jewish Israelis.  Even in ethno-nationalist destinations, then, the \nimmigration of non-co-ethnics does not result only\/inevitably in divisions between \nimmigrants and natives: it can also divide natives, while some immigrants and natives find a \nmeasure of common ground. \nMigration to ethno-nationalist states presents opportunities for simplistic thinking about \npossibilities for integration for both co-ethnics and non-co-ethnics.  This paper explores \nideas about migration to Israel, in particular, and argues for a more thoroughgoing rejection \nof the terms of home-grown Israeli discourse as a path towards better understanding of that \nmigration.  The critique offered here is focused on the notion that non-Jewish immigrants \nhave very limited possibilities for integration in Israeli society.1\n The discourse underlying Israel’s migration regime is of course highly consequential: \nthose who enter under the Law of Return have extensive rights and social acceptance, and \nthose who come as migrant workers encounter a set of practices and attitudes that have the \nexpected exclusionary effects.  But the difference between the two groups is often \noverstated, and a core argument of this paper is that both groups must be analyzed in terms \ncommon to the analysis of migration everywhere.   \n  When immigrants are not \nJewish and not otherwise eligible under the Law of Return, it sometimes appears difficult for \nobservers to include them in the category of immigrants at all; the large numbers of Thais, \nRomanians, Filipinas, etc. who have migrated to Israel in the last two decades are, in both \nofficial discourse and some social science analysis, merely ‘foreign workers’ or ‘labour \nmigrants’ and as such not ‘immigrants’ with any real possibility of being or becoming \nIsraelis.   \n The terms relevant here relate to possibilities and prospects for integration, \nparticularly when immigrants lack shared ethnicity with natives.  The strong ethno-national \ncharacter of Israel does make it difficult for non-Jewish immigrants to become integrated \ninto Israeli society.  But immigrants everywhere can encounter obstacles to integration – \nincluding natives’ beliefs that they simply ‘don’t belong’ (even countries like the US and \nCanada are only partial exceptions in this regard) – and yet sometimes accomplish a degree \nof integration even in difficult contexts.  A difference between ethno-national contexts and \nliberal or multicultural contexts is indeed a difference. But it is not an absolute difference, \nand even in ethno-national contexts immigrants – including those who lack shared ethnicity \n                                                     \n1 There is a corollary proposition: Jewish immigrants, with immediate full\/formal citizenship, achieve \nintegration with little or no difficulty. The inadequacy of this idea is well understood among those \nwho study migration to Israel (and equivalent ‘return’ migrations elsewhere): even co-ethnics often \nencounter exclusion and stratification (e.g. Ben-Rafael 1982). \n 2 \n– are often able to achieve a significant degree of social membership.  Migration, especially \nof non-co-ethnics to ethno-nationalist destinations, is easily imagined as highly divisive, \nparticularly in ethnic terms.  But even in ethno-national contexts such migration is not only \ndivisive: immigrants in such societies encounter ‘contexts of reception’ (Portes and Rumbaut \n1996) that contain elements facilitating their partial inclusion (as well as elements resulting \nin partial exclusion). \n Another core argument in this paper, then, is that, as against mainstream Zionist \ndiscourse and the practices of the Israeli state drawing on that discourse, some non-Jewish \nimmigrants entering as ‘foreign workers’ are in the process of becoming Israeli.  One \nimportant factor facilitating this process is the more or less simultaneous immigration of \nnon-Jews from the former Soviet Union, who were eligible under the Law of Return by \nvirtue of having close Jewish relatives.  State policies and social attitudes facilitating \nintegration of non-Jewish ‘Russians’ enhance possibilities for integration of other non-Jews \nas well.  Both groups also continue to experience varying degrees of exclusion.  But the \nIsraeli government has not stopped the inflows of people in either group, nor has it \nsucceeded in its declared aim of minimizing the migrant worker population (e.g. via forced \ndeportation), and even the migrant workers are developing new forms of identity that \npartially overlap with the identities of natives – which also leads natives to redefine their \nown identities in particular ways.   \nThe result is a transformation of the social divisions of Israeli society that includes \nprocesses of finding commonality across ethnic lines, not just exacerbation of divisions.  To \nthe extent that immigration of non-Jews has been divisive, that process has included \naggravation of divisions among Jews, not merely division between Jews and non-Jews.  In \nboth respects, the consequences of non-Jewish immigration to Israel (commonality across \nethnic lines, divisions among natives) are contrary to what one might anticipate in relation \nto non-co-ethnic migration to ethno-nationalist states.   \n The paper proceeds in the next section with a brief overview of Jewish immigration \nto Israel in the first several decades of its existence as an independent country.  It then turns \nto the experiences of Russian and Ethiopian immigrants, with particular attention to the \nsignificant components of non-Jews in those inflows (also giving consideration to doubts \n 3 \nabout Jewishness for both groups as a whole).  The appearance of non-Jews in immigration \nunder the Law of Return is a significant development, raising difficult questions about \npersonal status and inter-ethnic relations.  These issues are even more salient and \nproblematic in relation to Israel’s relatively new population of guestworkers, discussed in \nthe subsequent section.  Israeli political elites have generally embraced the notion that \nIsrael will succeed in avoiding the long-term settlement of guestworkers (as against \nexperience in several European countries), but some ‘guestworkers’ are already showing \nsigns of such settlement.  The penultimate section considers the experiences of the different \ngroups in light of common-sense expectations about non-co-ethnic immigration.2\n‘Traditional’ Immigration to Israel \n \nImmigration to Israel is sometimes considered to be different from the kind of immigration \nthat most other countries experience.  Jews who reside elsewhere live in the ‘Diaspora’; the \nHebrew term – ‘galut’, meaning exile – carries even stronger connotations of not being \nwhere one belongs.  A number of ideas embedded in language used regularly by many Jews \n– in Hebrew but also in other languages – reinforce the notion that living outside Israel is for \nJews an anomaly, to be corrected by return to the homeland.  Jews are strangers \neverywhere else – and the core premise of traditional Zionism is that this is exactly the \nproblem that the creation of a Jewish state was designed to resolve.  The ‘uniqueness’ of \nIsrael in this regard is often overstated (Shuval 1998) – but it is worth exploring briefly, so \nthat we can appreciate how recent migration waves are different in some central ways.   \n As Joppke argues (2005), the practice of selecting immigrants by ethnicity is on the \ndecline in liberal states (though there are variations in the strength of that trend).  \nHistorically, it was taken for granted, a matter of common sense, that ‘sovereignty’ entitled \na nation-state to reproduce and ‘shape’ its population through immigration policies that \nused both numerical restrictions and explicit ethnic preferences.  The very idea of a nation-\nstate seemed to demand attention to such matters, and even leaving aside the obvious \n                                                     \n2 This paper does not deal with the place of non-Jewish immigrants in relation to Israel’s Arab \npopulation.  The term ‘non-Jewish immigration’ could be taken to include the movement of \nPalestinians from the West Bank and Gaza to Israel via marriage to Israeli citizens, which in the post-\nOslo period amounted to an estimated 30,000 persons (Rebhun and Malach 2009).  I am not aware \nof any scholarly research on this migration stream.  For more general analysis of Arab\/Palestinian \nethnicity in Israel, see e.g. Jamal 2007 and Rouhana 1997. \n 4 \ninstances of cultural imperialism embodied in policies such as ‘White Australia’, it was not \nunusual to find claims that it was legitimate to give preference to potential immigrants who \nare ‘like us’ in ostensibly important ways.3\nBut Israel is a clear exception: a central aspect of its identity as a (or the) Jewish state \nis the notion that it belongs to Jews everywhere, that they are already part of the Israeli-\nJewish ‘nation’.\n  In contrast, immigration policies in many liberal \nstates today strive for a greater degree of ‘universality’ and ‘neutrality’, giving weight to \n‘achieved’ over ‘ascribed’ characteristics – e.g. economically desirable skills, in keeping with \na neo-liberal market-oriented set of assumptions.   \n4  The best illustration of the point is the Law of Return, the primary piece of \nlegislation that authorizes and structures immigration to Israel.  A key feature is that the \nLaw of Return gives no consideration whatsoever to economic characteristics of the \n(prospective) immigrant or other factors such as age or educational level (Cohen 2009).5\n Some key Hebrew words and Jewish concepts reinforce the point.  For many years \nthe Hebrew word for migration (‘hagirah’) was not used, especially to describe immigrants \nentering under the Law of Return (Shuval 1998).  Instead the preferred term is ‘aliyah’, \nliterally meaning ascent.  That word has deep religious connotations, entirely positive\/ \nvalorised ones.  In synagogue services that include readings from the Torah, a member of \n  \nThe only factor that matters is Jewishness: if one is Jewish (or has close Jewish family), one \nbelongs in Israel and can enter freely, gaining citizenship immediately upon entry.  The \nnotion that one can ‘return’ is hardly unique: many citizens of one country residing in \nanother can return to the former at any point.  But the Law of Return extends this principle \nacross generations, indeed across many centuries, so that it applies to people – non-citizens \n– whose distant ancestors might once have lived in the territory today called Israel.   \n                                                     \n3 Walzer 1983 offers a relatively recent defence of this idea.   \n4 This point is central to those who argue that Israel is therefore not really a liberal democracy but \ninstead an ‘ethnic democracy’ (Smooha 1990) or an ‘ethnocracy’ (e.g. Ghanem et al. 1998; cf. \nGavison 1999 for a rebuttal). \n5 In the early 1950s some Israeli elites wanted limitations on the entry of people in categories \nconsidered undesirable, even if Jewish – but restrictions of this type were not implemented \n(Hacohen 2003).  On the other hand, such concerns did apparently contribute to a studied passivity \nin relation to Ethiopian Jews, who were not actively encouraged to move to Israel until the 1980s \n(Kaplan and Salamon 2004). \n 5 \nthe congregation can be invited for – and honoured by – an ‘aliyah’: one ascends to the \nraised platform on which the Torah reading takes place and recites blessings before and \nafter the reading itself.  The word also applied to the pilgrimages required of Jews while the \nTemple was still standing: passages from the Torah instructed that during certain festivals \n(Sukkot, Passover and Shavuot), one would ‘ascend’ to Jerusalem for the Temple service.   \n To describe Jewish migration to Israel as aliyah, then, is to approve of it at a \nfundamental level – as indeed most Israeli Jews do.  Likewise the word used for emigration – \n‘yerida’, meaning descent – for many years had a negative connotation in equal measure \n(Shuval and Leshem 1998).  The late prime minister Yitzhak Rabin once described emigrants \nin terms that were translated variously into English as ‘the lowliest of parasites’ and ‘gutless \nscum’.  In more recent years there is less inclination to use such denigrating language – but \none of the reasons for the change has to do with the desire to convince emigrants to come \nback to Israel,6\n These elements combine to produce the claim that Jewish migration to Israel is \nhardly migration at all, in the normal sense of the term.  The defining characteristic of \nimmigrants in most contexts is that they are foreign, and their presence is thus an anomaly \nthat demands resolution (e.g. through departure, or perhaps naturalization).   International \nmigration is not simply geographical relocation (Castles and Miller 2009); instead, its most \nsalient feature is that it involves, at least potentially, a change of national membership, \nentailing a number of transformations at the individual level that would be associated with \nchange in nationality.  But insofar as Israel is the ‘Jewish state’, Jews everywhere are already \nimagined to be part of the Israeli ‘nation’.  Following Anderson (1983), this act of ‘imagining’ \nis powerful: the word confirms their membership rather than denoting its emptiness.  As \nagainst the experience of many other societies, migration to Israel is thus not itself an \nanomaly but the resolution of an anomaly – the ‘ingathering of the exiles’, to use the \nreligious term.  It hardly makes sense then to describe them as foreign – and entirely \n a goal that many Israelis understand might be better accomplished if one \navoids insulting them (Cohen 2007).   \n                                                     \n6 The size of this population depends on definitions and is perhaps half a million, mostly in the ‘Jews \nand others’ category (but including also roughly 100,000 Arab Israelis) (Cohen 2009).  At roughly 8% \nof the Israeli Jewish population in Israel (Avineri et al. 2009), emigration on this scale is considered a \nserious loss and a failure of Zionism.   \n 6 \nsensible to grant them citizenship immediately upon arrival, with no waiting period or \nconditionality.  Other countries have had laws similar to the Law of Return – Germany is an \nimportant example – and other countries also give priority to co-ethnics in deciding whom \nto admit.  But the Israeli case is the most extreme, to the point that it is sometimes taken to \nbe difficult to analyze in the terms used for other cases. \n This, at any rate, is how things appear from a mainstream Zionist perspective.  And a \nkey implication is that immigration in Israel is not a cause of social division but rather of \nsocial (re)unification, a making whole rather than a making of divisions.  Again, the main \ndistinctive characteristic of immigrants in general is their non-belonging to the nation: in a \nword, they are different, in ways that are held to really matter.  But Jewish immigrants to \nIsrael are held not to be different in the ways that really matter and are therefore not really \nimmigrants in the normal sense. \n However: other ways have in practice mattered greatly, even if some Zionist \ndiscourse about Jewish immigrants has sometimes created a tendency to exaggerate the \nimportance of co-ethnicity and downplay other dimensions of difference and other \nprocesses apart from ‘return’ and inclusion.  Jewish immigration to Israel is distinctive in \nways that are worth giving proper attention, but Jewish immigration to Israel is not \nsomehow ‘aliyah’ instead of immigration (Shuval 1998).   \nAs an instance of migration, then, Jewish immigration has simultaneously created (or \ndeepened) a number of significant social divisions and effected a partial reunification of the \n‘Jewish people’ as intended.  Outside of Israel, being Jewish is in part a matter of ethnicity \n(also of religion, with a complex articulation between the two),7\n                                                     \n7 The ethnic dimension of Jewishness is captured, quite controversially, in a recent decision by a \nBritish court of appeal holding that an Orthodox Jewish school had practised racial\/ethnic \ndiscrimination in failing to accept a boy on the grounds that his mother is not Jewish according to \nOrthodox definitions, thus neither is he – despite the fact that he attends synagogue regularly and \nobserves Jewish law\/practices to a high level (Butt 2009).   \n typically understood as a \nsingle ethnicity.  In Israel, however, Jewishness is subject to ethnic divisions.  Traditionally, \nthe core division was between Ashkenazi and Mizrachi Jews.  Its salience had much to do \nwith the articulation between ethnicity and other forms of stratification, particularly \neconomic and political, i.e., the fact that in general Ashkenazi Jews held higher economic \n 7 \nand political positions (e.g. Swirsky 1989, Kahane 1986).  Mizrachi disadvantage was \nreinforced by their Arab cultural background, in a context that delegitimized Arab culture \n(Yiftachel and Ghanem 2004) and (partly as a consequence) sought to ‘absorb’ them in \nclassic ‘melting-pot’ fashion (Cohen-Almagor 1995), an attempt resisted by many of them \n(Ben-Rafael 2007).   \n One must not overstate the extent of division between Mizrachi and Ashkenazi Jews \nin Israel in the days of mass Mizrachi immigration (1940s and 1950s).8\n Nor is the mere fact of being an immigrant sufficient to discern strong differentiation \nbetween Mizrachi Jews and Ashkenazi Jews in this period.  Most Ashkenazim were also \nimmigrants, or the sons and daughters of immigrants.  Being an immigrant in 1950s Israel \nwas common, even a core element of Israeli identity; very few Israeli Jews had no migration \nhistory in living memory.  The onset of Zionist immigration is generally dated to the 1880s, \nat which point the Jewish population of Palestine was roughly 30,000 (Schölch 1985).  When \nIsrael became an independent country in 1948, the Jewish population was 700,000 – and \nmost of these people were, necessarily, immigrants.   \n  Despite experiencing \nmistreatment, prejudice, exclusion, etc., the fact that Mizrachi Jews were after all Jews \ncontributed to a sense of national belonging.  Many Ashkenazim did in fact often treat \nMizrachim as inferior – but virtually no one (among Ashkenazi Jews) took the view that they \ndid not genuinely belong in Israel.  The point is partly formal: they entered the country as \nfull citizens.  But this dimension of membership was not merely formal: Mizrachi \nimmigrants, despite being foreign-born, were not ‘foreign’ in terms of nationality.  The \nPalestinian citizens of Israel, despite being native-born, were arguably more foreign than the \nMizrachim in the schema of Israeli national identity and citizenship (Shachar 2000).   \n We thus encounter instances of Jewish immigration that add complexity to the \nnotion that in ethno-national contexts social divisions result primarily from immigration of \nnon-co-ethnics.  In accordance with Zionist ideology, Jewish migration to Israel during this \nearlier period can reasonably be described as a reunification in the Jewish homeland, \nwherein Jews were welcomed without the high degree of antipathy and rejection that often \n                                                     \n8 Mizrachi immigration did not begin only in the 1940s: there were earlier (smaller) waves of \nimmigration of Jews from Yemen, for example (Shafir 1989). \n 8 \ncharacterizes the experience of immigrants elsewhere.  But despite the fact of co-ethnicity \nand their eligibility for automatic citizenship, some immigrants (particularly the Mizrachim) \nexperienced a certain degree of antipathy and rejection.  As is widely understood, the \nresulting social divisions were very significant and persist into the present,9\nRussian and Ethiopian Immigrants \n though there \nhave also been trends of convergence (Ya’ar 2005, Benski 1994).   \nIf even Jewish immigrants to Israel experience a certain degree of exclusion, it is not hard to \nimagine that non-Jewish immigrants (or Jewish immigrants whose Jewishness is considered \nby some to be in doubt) would encounter greater difficulties.  That expectation is borne out \nin the experience of Russian10\nAn earlier wave of Russian migration to Israel, in the 1970s, had characteristics \nsimilar to those of other Jewish immigration influxes, and Russians in this wave largely \nassimilated into the Ashkenazi segment of the Israeli Jewish population.  But the more \nrecent Russian immigration has had a very different character, for three reasons.  One is \nsheer size: since 1989, Russian immigration has added more than one million people to \nIsrael’s population, and they now constitute more than 13% of the total – a very large\/rapid \nmigration inflow by any historical standard.  Secondly, the state did not impose strong \nexpectations of ‘absorption’ (assimilation) on the Russians (as had been done with the \n immigrants who entered Israel beginning in 1989 and \nEthiopians arriving mainly in 1985-86 and 1991.  Most immigrants in both groups are Jewish, \nbut a significant number particularly of the Russians are not, i.e., they are not recognized as \nJewish by Israel’s rabbinic authorities.  But even the non-Jewish immigrants have achieved a \nsignificant degree of integration in Israel, despite a traditional Zionist understanding of \n‘aliyah’ that contemplates only Jewish immigration.  Non-Jews have encountered certain \ndifficulties in Israel, but their experience belies the notion that non-co-ethnic immigrants in \nethno-national contexts will find only restricted prospects for integration.   \n                                                     \n9 Witness the stunning success of a political party – Shas – capitalizing on resentment concerning \nMizrachi disadvantage (Peled 2001). \n10 Some so-called ‘Russians’ come from other countries in the former Soviet Union (e.g. Ukraine, \nGeorgia), and some writers use ‘FSU’ to describe the entire group.  However, ‘Russians’ is commonly \nused in Israel, and it makes sense at least insofar as even those from other countries typically speak \nRussian.   \n 9 \nMizrahim): it was considered acceptable for them to retain core elements of the cultural \nbaggage they brought with them (Ben-Rafael 2007).  The other central fact is the significant \ncomponent of non-Jews in this group, roughly 300,000 who are not Jewish according to the \nstrict Orthodox (matrilineal) definition.  The Law of Return, as amended in 1970, extends \nrights of immigration and citizenship to anyone with a Jewish grandparent or spouse, even if \nthe migrant is not Jewish by Orthodox religious standards (see e.g. Shachar 2000).11\nThese three factors have placed certain limits on the extent to which Russian \nimmigrants have become Israeli, i.e., in regard to their own sense of identity and the way \ntheir identity is perceived by veteran Israelis.  Being ‘Russian’ has become a new Israeli \nethnicity, one that doesn’t dissolve into the traditional Ashkenazi\/Mizrachi divide even for \nthose who are Jewish by religious law and might otherwise be considered Ashkenazi (Al-Haj \n2004).  Many Russians give higher priority to their Russian and Jewish elements of identity \n(over Israeli), and (halakhic) Jews and non-Jews are not terribly different in this regard (Ben-\nRefael and Peres 2005).  Russians in Israel have built a substantial infrastructure that \nsustains elements of Russian identity and culture: newspapers, grocery stores (some of \nwhich openly sell pork), cultural institutions, etc.  Many Russians consider it important to \ntransmit their Russian identity to their children, particularly via maintenance of Russian \nlanguage.  There is also a relatively high degree of residential segregation and a separate \npolitical party (Herzog 2009).   \n  As \nnoted above, the Law of Return was intended to facilitate Jewish immigration, on the basis \nthat Jewishness endowed the immigrants with a high degree of national belonging – but in \nrecent years it has also enabled the immigration of large numbers people who are not \nJewish in consequential ways (i.e., recognized as such by religious authorities).   \nThose who lack recognition as Jewish encounter additional obstacles to integration.  \nOne particular problem relates to marriage.  Jewish religious authorities exercise formal \ncontrol over matters of personal status (marriage, divorce, burial, etc.; Muslim religious \nauthorities control such matters for the Muslim population – see Merin 2004), and there is \nno provision for civil marriage.  Those who are not recognized as Jewish (but are also not \n                                                     \n11 The Reform Jewish practice of recognizing patrilineal descent, common in the USA, is not well \nestablished in Israel, except for purposes of the Law of Return.   \n 10 \nmembers of other religions) therefore find it impossible to get married at all in Israel.  An \nalternative is to get married abroad and then register the marriage with the Interior \nMinistry, and some people travel to Cyprus for that purpose.  But doing so is not \ninexpensive, and many couples choose simply to cohabit (with a certain degree of legal \nrecognition upon registration).  The problem is self-perpetuating, as the offspring of non-\nJewish mothers will themselves be barred from getting married in Israel.   \nIssues relating to marriage also affect Jewish Russian immigrants.  The fact that so \nmany Russians are not recognized as Jewish leads some Israelis to adopt rejectionist \nattitudes towards all Russians.  In the minds of ultra-Orthodox Jews, being Russian is itself \nnow grounds for suspicion regarding Jewish bona fides – so that Russians are in general not \nconsidered suitable marriage partners.  One mechanism enabling ultra-Orthodox people to \nact on this preference is lists compiled by rabbinic authorities who determine (to their \nsatisfaction) whether someone is or is not Jewish.  The various lists of eligible marriage \npartners are necessarily incomplete, and a marriage can proceed if one can satisfy the \nrabbis (via production of documents or testimony of witnesses) that one is indeed Jewish – \nthough succeeding in this process can be extremely difficult.12\nBut even the fact of non-Jewishness is not an insurmountable obstacle to a \nsignificant degree of integration into Israeli society for Russian immigrants.  It is important \nnot to overstate the difference between Jewish and non-Jewish Russians in this regard.  \nMany of those who count unequivocally as Jewish do not have a well-developed sense of \nJewish religious identity and knowledge, particularly as religious education and practice \nwere discouraged by the Soviet authorities (Ben-Refael and Peres 2005).  On the other side, \nmany of those who are not Jewish by Orthodox rules nonetheless consider themselves Jews \n  But the aim in producing lists \nis to eliminate uncertainty, to obviate the need for determination: after all, if a couple have \ndecided to get married and only then set out to establish their eligibility, from their point of \nview it is too late.  If a very religious person has any reason to doubt the Jewishness of a \npotential partner, checking a list before getting involved can prevent heartache and shame.  \nBecause of widespread doubts about the Jewishness of Russians, there is a much greater \nlikelihood that they will not be included on the lists.   \n                                                     \n12 As evident in a long story in the New York Times Magazine (Gorenberg 2008).   \n 11 \n– in part because of their Jewish family connections (again, the basis of their eligibility under \nthe Law of Return).  There is also the fact that they were treated as Jewish by authorities in \nthe Soviet Union (which, along with similar Nazi practice in Germany, helps explain the logic \nof extending the right of return to those with Jewish family connections).   \n The identification of non-Jewish Russians with the larger Israeli Jewish population is \nreinforced in some significant institutional ways.  Once in Israel, they are ‘converted’ into \nIsraeli Jews not in a religious sense but sociologically, i.e., socialized particularly by the \neducational system and the army (Cohen 2009).13\n Similar points can be made about immigrants to Israel from Ethiopia, who arrived \nmainly in two ‘waves’, in 1985-86 and 1991 and now number roughly 100,000, including the \nsecond generation (Ben-Eliezer 2008).  Ethiopians in Israel have encountered a significant \ndegree of rejection by some other Israelis and in certain respects are poorly integrated, as \nevident in high rates of poverty and unemployment, residential segregation, etc. (Offer \n2004, Kaplan and Salamon 2004).  A significant obstacle to integration is doubts about their \n  Additionally, official Israeli data, e.g. \npublished by the Central Bureau of Statistics, use population categories that appear at first \nto work in strange ways: in particular, the major division is between ‘Jews and others’ and \nArabs.  One might expect to find instead a major division between ‘Jews’ and ‘others’.  One \nexplanation for this counterintuitive practice is to be found partly in the politics of Israeli \ndemography, where the Arab\/Palestinian part of the population is considered by many to \nconstitute a threat to Israel’s identity as a ‘Jewish state’.  To counter that threat, official data \ninclude ‘others’ such as non-Jewish Russians in the ‘Jewish’ category, thus diminishing the \nweight of the Arab category; Lustick observes on this basis that Israel is less a ‘Jewish state’ \nthan a ‘non-Arab’ state (1999).  While Jewish religious authorities adopt a highly \nexclusionary stance towards non-Jewish Russians, the Israeli state is keen to ‘absorb’ them \ninto Israeli Jewish nationality and thus offers them all the rights and support granted to any \nimmigrant eligible under the Law of Return.    \n                                                     \n13 The issue of religious conversion to Judaism among Russians is quite complex.  In brief, \npossibilities for religious conversion are extremely limited, and many of the conversions for Russians \nthat did take place were revoked in 2008 (Hacker 2009).  The rabbinic establishment sets extremely \nstringent demands, and in any event most Russians are secular by outlook and practice and are not \ninterested in adopting Orthodox (or ultra-Orthodox) ways.  Various government initiatives to \nincrease rates of conversion for immigrants have all ended in failure (Sheleg 2004, 2009).   \n 12 \nJewishness.  The Sephardi Chief Rabbi in the 1970s (Ovadia Yosef) had determined that the \n‘Beta Israel’ were Jewish – thus making them eligible under the Law of Return.  But by the \ntime they arrived the attitude among religious authorities had changed, and they were \nrequired to undergo a symbolic process of conversion (via immersion in a mikveh, a small \npool of water) (Wagaw 1993) – which however has not been sufficient to alleviate doubts in \nthe minds of many, especially among the ultra-Orthodox.  In other respects attitudes among \nsome Israelis amount to ‘cultural racism’, e.g. when schools refuse to accept Ethiopian \nchildren on the pretence that the children are not prepared for the type of study provided \nthere (Kashti et al. 2009).  Some Ethiopian youths have responded by developing an \noppositional identity akin to American hip-hop, intended to signal rejection of what they \nperceive as dominant Israeliness (Ben-Eliezer 2008).  Finally, as with the Russians a certain \nportion of the Ethiopian Israeli population – the so-called Falashmura (or Feres Mura) – \nhave a tenuous relationship with Judaism, for having practiced Christianity in Ethiopia after \ntheir (apparently) Jewish ancestors converted, perhaps under duress (Seeman 2009).   \n But Ethiopian immigrants, even the Falashmura, are after all immigrants under the \nLaw of Return and have been the object of government policy designed to incorporate (or \n‘absorb’, from klitah) them through provisions such as subsidized housing and affirmative \naction in employment.  Even if these policies have often failed in terms of stated objectives, \nthey function on a symbolic level as a sign of Ethiopians’ belonging on par with other \nimmigrants, and as with other immigrants there is a consensus among Jewish Israelis \n(including political elites) that the Ethiopians belong in Israel (Kaplan and Salamon 2004).  \nInstances of racism typically result in immediate and widespread public condemnation and \npolicy reversals.  Rates of army service – as noted, an important integration mechanism – \namong Ethiopian men exceed the Israeli Jewish average.  Political incorporation was evident \nin a 1996 demonstration in front of the prime minister’s office to protest a policy of \ndiscarding donated blood on grounds that Ethiopians in general had disproportionately high \nHIV infection rates.  The demonstration resulted in public apologies from the president and \nprime minister and contributed to the election of an Ethiopian Knesset (parliament) \nmember (though it did not lead to a change in policy on donated blood) (Weil 1996).   \nThe fact that Russian and Ethiopian immigrants have Israeli citizenship (granted \nimmediately on entry) is also very important in grounding and signifying their high degree of \n 13 \nmembership in and identification with Israeli society.  Having formal citizenship by no means \nguarantees a high degree of social membership, particularly in a context where citizenship \nitself is strongly ethno-national (as demonstrated in obvious ways by the situation of Arabs \nin Israel) (Shafir and Peled 2002).  But Israeli citizenship is (at least for Jews) quite different \nfrom the ‘thin’ citizenship that characterizes the USA (on the latter, Heller 1997 and Joppke \n1999), and admission into Israeli citizenship under the Law of Return is consequential. \nThe increasing component of non-Jews in migration inflows under the Law of Return \nis a significant development.  These immigrants face some difficult problems, and from the \nperspective of strictly religious Jews their presence is a problem.  But it must be \nremembered that many of these immigrants are non-Jewish in only a strict religious sense; \nas noted above, non-Jewish Russians undergo a ‘sociological conversion’ that leads to a \ncertain degree of identification with and acceptance by many secular Israeli Jews.  While \nthat process is significant in its own right, it is also potentially relevant to the prospects for \nIsrael’s relatively new population of migrant workers. \nMigrant workers \nAlthough small numbers of non-Jews went to Israel as migrant workers in the 1970s and \n1980s, large-scale ‘guestworker’ migration14\n                                                     \n14 It would be misleading to offer a precise indication of the size of this population; a reasonable \nestimate is roughly 200,000 (Rebhun and Malach 2009).  The Israeli government has very limited \ncapacity for producing accurate data on the migrant workers (e.g. Avineri et al. 2009).  \n began in 1993, with strong similarities to the \nexperience of the European countries that used guestworkers several decades earlier.  With \nextremely limited prospects for formal citizenship, migrant workers’ presence in Israel might \nseem to carry few if any implications for Israeli identity or ‘ethnoscape’.  But that common-\nsense conclusion, though no doubt held by a large proportion of Israelis who believe that \n‘foreign workers’ are simply and irredeemably foreign, overlooks some of the key lessons \navailable in the history of immigrants and ‘guestworkers’ in other countries (e.g. Rogers \n1985).  Some migrant workers in Israel have put down deep roots and have begun to think \nof themselves as Israelis.  While some government policies and popular attitudes make that \nperspective seem implausible, there are also important instances of policies and attitudes \nthat ground and reinforce the development of this new identity.   \n 14 \n Israel’s experience of rapid ‘guestworker’ immigration can be explained with \nreference to several factors.  The proximate cause was the closure of Israel’s borders to \nPalestinians from the West Bank and Gaza, following several deadly suicide bombs in March \n1993.  Until that point, Palestinians had supplied cheap labour in the agricultural and \nconstructions sectors, and although the intifadah had periodically disrupted the flow of this \nlabour since 1987, the violence in Israel proper in 1993 led to an extended closure and thus \nto the severe interruption of production in those sectors.  Employers might have responded \nto these events by embarking on a program of labour-saving investment (particularly as the \nuse of rudimentary construction methods was\/is widespread), but it was easier and more \nprofitable for them to import replacement workers.  The relative weakness of the Israeli \nstate – its susceptibility to clientelist policy-making dynamics – meant that pressure on the \ngovernment to this end succeeded rather quickly (Bartram 2005).  There was also a \nsignificant geo-political dimension to these decisions: prime minister Yitzhak Rabin was keen \nto demonstrate to the Palestinians that their labour was replaceable and thus their standard \nof living vulnerable, in the event that the violence continued (Raijman and Kemp 2007). \n The rapid growth of the migrant worker population was not solely a result of \ngovernment policy in an active sense.  A great many migrant workers in Israel are \nundocumented.  In part the presence of undocumented workers is attributable to the \nactivities of traffickers and ‘manpower’ companies, who can make enormous profits by \ncharging the workers ‘agency fees’ (Kruger 2005).  Another factor is Israel’s attractiveness as \na tourist\/pilgrimage destination: the Israeli government finds it difficult to distinguish \nreliably between bona-fide tourists and those who use tourism as a means of entry for \npurposes of finding work (Willen 2007).   \n Israel thus faces an issue that has become a recurring theme in wealthy countries: \nthe ‘place’ of immigrants who are ‘wanted but not welcome’ (Zolberg 1987).  For a large \nproportion of the population, the answer is easy: they have no place.  Large proportions of \nIsraelis (Arabs as well as Jews) hold negative\/xenophobic attitudes towards migrant workers \nand oppose granting them rights (Raijman and Semyonov 2004).  One might also conclude \nthat the position of the government is that migrant workers do not belong in Israel, \nparticularly in light of a sustained deportation campaign begun in 2002 employing harsh \ntactics by any standard (Willen 2007, Wurgaft 2006).  A long-term place for non-Jewish \n 15 \nimmigrant is entirely inconsistent with traditional Zionist ideology, and it is unsurprising – \neven if slightly jarring, in light of Israel’s extensive immigration history – to hear government \nofficials state that ‘Israel is not an immigration country’ (senior minister in Labour and Social \nAffairs, quoted in Rosenhek 1999).   \n But the history of ‘guestworkers’ in Europe suggests that reality might not respect \nideology, not even in Israel.  That history is captured in Philip Martin’s ‘iron law of labor \nimmigration: there is nothing more permanent than temporary workers’ (1994: 86).  The \nreceiving society and the workers (some of them at least) tend to become addicted to one \nanother, and while authoritarian governments are sometimes able to ensure that the \n‘guests’ go home (Abella 1995), democratic countries are markedly less successful.   \n The Israeli government has issued numerous pronouncements to the effect that it \nintends to deport migrant workers and reduce their numbers.  But certain key elements of \nthe society do not share these goals.  Employers in construction and agriculture have not \naltered their preference for cheap foreign labour – certainly not in the sense that they have \nmade the investments that would help ‘upgrade’ those sectors and make the work (and pay) \nmore attractive to Israeli citizens.  A large number of individual citizens as well continue to \nwant to employ migrant workers: another key market segment is the use of migrant \nworkers (typically Filipinas and Latinas) for care of elderly relatives (Raijman et al. 2003).  \nMany of the workers themselves want to stay permanently (Ben-Refael and Peres 2005).  \nUnder the most propitious circumstances governments often find it difficult to implement \nmigration policies with complete or even nearly complete effectiveness, and the \ncircumstances surrounding migrant workers in Israel are decidedly not propitious.   \n Above all, the government’s own actions simply do not support the notion that it has \n‘decided’ to get rid of the migrant workers.  Quotas for employment permits in the key \nsectors are regularly renewed, leading to accusations that the government operates a \n‘revolving door’ policy (offering new permits despite deporting people), with ‘manpower’ \ncompanies as the main beneficiaries (Kruger 2005).15\n                                                     \n15 A HaAretz headline in October 2009 read: “Ignoring Arab women, ministry okays 3,000 new \nforeign workers” (Weiler-Polak 2009b).   \n  It has failed to regulate the manpower \ncompanies and other employers in ways that implement existing laws, never mind passing \n 16 \nlaws that would constrain their activities effectively (Dahan and Gill 2006, Pilovsky 1999).  \nOne of the earliest scholarly publications on migrant workers in Israel described the policy \nmaking practice as ‘overwhelmingly reactive – inadequately considered, ill-conceived, \nambivalent in relation to their ultimate purpose and, in the course of implementation, \nvulnerable to ‘privatization’’ (Borowski and Yanay 1997, 495), and there is precious little \nevidence of any significant change.   \n The question of migrant workers’ place in Israeli society in the future is therefore the \nwrong question.  Migrant workers are present in Israel now and have been present in the \naggregate for more than sixteen years, and questions relating to their place in Israeli society \ncannot be put off on the (dubious) grounds that at some point in the future they will be \ngone.  It is more pertinent and revealing to describe the place of migrant workers in Israeli \nsociety in the present.  A common perception is that workers encounter a high degree of \nexclusion and rejection.  While that perception is largely accurate, it is not the entire story: \ndespite lacking a secure legal status – in part because their lack of Jewishness means that \nmost Israelis consider them to be entirely unsuitable for membership in Israeli society – \nmigrant workers in Israel have achieved a limited degree of integration.  \n The orientation\/attitudes and actions of some migrant workers in Israel have much \nin common with those of migrant workers in numerous other destinations around the world \n(for a general discussion see Piore 1979).  Despite an early intention to accumulate savings \nand return home, some immigrants (particularly those from Latin America) have decided \nthat life in Israel is good, even in the absence of secure legal status.  After satisfying debts \nassociated with migration and securing a degree of improvement in employment, some \nimmigrants begin to establish a more permanent and comfortable existence in Israel: \nacquiring better housing and consumer goods, deepening ties with native Israelis (as well as \nother immigrants), etc.  The most significant step is family (re-)formation – arranging for \ntheir children to come to Israel, or forming new families in Israel – which makes return \n‘home’ much less likely (Kalir 2006).  \n A number of government actions and policies have the effect of ‘grounding’ and \nreinforcing migrant workers’ membership in Israeli society – particularly in an expanded \nview of government beyond the national level to include municipal policies, especially those \n 17 \nof Tel Aviv (cf. Rosenhek 2002).  The most significant of these is the Tel Aviv municipality’s \nsponsorship of an ‘Aid & Information Centre for the Foreign Community’, to mediate \nbetween various government agencies and migrant workers (even the undocumented) \nregarding policies that affect their welfare.  Though its declared aims explicitly exclude the \nnotion of challenging the (ostensible) national policy of reducing\/eliminating the migrant \nworker population, its activities have the impact of carving out spaces of membership and \nbelonging (Alexander 2007).  One key mechanism for this dynamic involves the recruitment \nof representatives from the migrant worker community, to give them a voice regarding \nperspectives on their needs especially in relation to health care, welfare, and children’s \neducation (Kemp and Raijman 2004).  Among the unintended consequences is the creation \nof a community infrastructure that can be used for mobilization regarding other issues.  \nAlready the municipality provides a number of welfare services even to undocumented \nworkers and their children – and so this ‘illegal’ population has achieved a degree of \n‘citizenship’ (particularly at the level of the city – note the affinity between these words, cf. \nHolston 1999) in the normal Marshallian sense.  Even at the national level: the ‘Israeli \nGovernment Portal’ (www.gov.il) contains a ‘Guide for Migrant Workers’ with information \non rights and where to find assistance of various types.  \n Policy relating to pregnancy\/childbirth and children is particularly consequential in \nboth the short and long term.  As noted above, demography is a highly politicized topic in \nIsrael, and it is not hard to find statements by politicians that demonstrate awareness of the \nlong-term consequences associated with the birth and education of ‘foreign’ children on \nIsraeli soil.  In 2000 Interior Minister Eli Yishai (from the religious Shas party) told the \nKnesset: ‘They have to be deported before they become pregnant’ (quoted in Kemp 2007, \n679).  And an official statement from the Ministry of the Interior from the late 1990s read in \npart: ‘When the foreign children study Israel’s heritage in our schools, we make them feel \nthat they are part of us.  It would be better if those children would not go to school and \nwould watch TV all day instead’ (quoted in Rosenhek 2002).  And yet Israeli schools do \naccept the children of migrant workers, regardless of parents’ legal status (particularly in Tel \nAviv), and some even adopt a policy of multiculturalism in dealing with ‘foreign’ children \n(Resnik 2009).  A similar contradiction between declared national policy and \nimplementation at the local level is found in the provision of government-sponsored \n 18 \nreproductive services for pregnant women regardless of legal status – despite the ostensible \nthreat to ‘demographic security’ posed by foreign children (Willen 2005).   \n The next logical step is citizenship for children born to migrant workers – and indeed \nthis step has been taken, albeit a small one.   There is no jus solis tradition of citizenship in \nIsrael, and possibilities for non-Jews to gain Israeli citizenship have always been very \nnarrow, limited in most circumstances to marriage.16\nThe conclusion to be drawn from these developments is that a variety of non-Jews \n(who are also not Palestinian) from a very diverse range of backgrounds (Ecuadorian, \nNigerian, Filipino, etc.) are, in limited and specific ways, becoming Israelis.  The limits are of \ncourse significant.  Kemp et al. (2000) apply the term ‘margizens’ (from Martiniello 1992) to \ndenote their position on the margins of Israeli society; they are not even ‘denizens’.  But the \n  But a government decision in 2005 \ncreated provisions for naturalization for a small number of children under restricted \nconditions (including minimum age, competence in Hebrew, and enrolment in school) \n(Kemp 2007).  After their children become citizens, the parents themselves are granted \npermanent residence.  The government declared that this was to be a one-time offer, \napplying only to people already living in the country, and the numbers of applications \napproved was very low, approximately 1500 as of mid-2007 (Ilan and Azouly 2007).  But the \ninitial requirements were loosened (the minimum age lowered from ten to six, and the \nrequirement that the parents had to have entered the country legally – e.g. not as fake \ntourists – was abandoned), and the notion that it will only happen once is not very plausible.  \nThe justification offered by proponents was familiar: these children think of themselves as \nIsraeli, do not know any other country, and are not fluent in any other language (apart from \nHebrew).  These conditions are unlikely to change.   \n                                                     \n16 A policy change in 1995 rendered non-Jewish spouses of Jewish Israeli citizens ineligible under the \nLaw of Return and imposed a waiting time and other requirements for naturalization (Hacker 2009).  \nAdditionally, as of 2003 a controversial law has made it very difficult for Palestinian residents of the \nWest Bank and Gaza to gain Israeli citizenship or residence permits via marriage to an Israeli citizen – \nsuch citizens being in virtually all cases Arab (Peled 2007).  This ostensibly ‘temporary’ law, upheld by \nthe High Court of Justice in 2006 partly on ‘security’ grounds, is a blatant instance of indirect ethnic \ndiscrimination against Arab citizens of Israel and has helped revive the ‘ethnocracy’ debate.   The \ndemographic intent of the law – reduction of Arab population growth – is blindingly obvious, as \nacknowledged (and supported) by the former director of the Association for Civil Rights in Israel, \nRuth Gavison, in an op-ed in HaAretz in July 2008. \n 19 \nterm ‘margizen’ describes not just exclusion but also a degree and form of social \nmembership.  The notion that they are not members – not at all – is manifestly false.  Most \nmigrant workers in Israel are unlikely ever to become Israeli in the sense of holding an Israeli \npassport.  But the voluminous literature on Marshallian citizenship demonstrates that the \npassport one holds is typically only part of what we want to know about one’s citizenship.   \nNon-Jewish Immigrants and Ethnic Divisions \nIt would be easy to imagine that there is a straightforward dichotomy between Jewish and \nnon-Jewish immigrants to Israel, leading to a straightforward conclusion that non-Jewish \nimmigrants (at least those lacking Jewish connections) are an anomaly and have virtually no \nprospects for gaining any substantial degree of membership in Israeli society.  This view \nplaces too much emphasis on Jewishness in relation to migration to Israel.17\n Given that the immigration in question has happened quite recently, any analysis in \nthese terms is necessarily provisional: the situation is fluid, with a lack of clear boundaries \nand tendencies.  But even that sense of vagueness is significant in relation to common ways \nof perceiving identity and ethnicity in Israel.  From a mainstream Zionist perspective, \nJewishness is the dominant element of identity, and Jewish unity is among its highest values \n(including the unity that comes from reunification of Jews via aliyah).  Migration to Israel in \nrecent years has further undermined the fit between ideology and reality in this regard: \nsome Jewish Israelis feel and express solidarity with non-Jewish immigrants (even the \nmigrant workers) as well as antipathy towards other Jews (i.e., to a greater extent than in \n  Being Jewish \nmatters, but it is not the only issue that matters for immigrants in Israel.  Immigrants draw \non a variety of resources to achieve a degree of membership in the destination.  At early \nstages, non-Jewish immigrants in an ethno-national destination such as Israel will find it \nvirtually impossible to use shared ethnicity as a resource in this way.  But to the extent that \nsuch immigrants are successful in using other resources to achieve social membership, we \nthen find a subsequent set of processes resulting in the development of a certain degree of \nshared ethnicity (in addition to persisting ethnic divisions).   \n                                                     \n17 It also imagines that it is possible to know, definitively, whether some is or is not Jewish. As is \nevident above, there are different ways of categorizing, emerging from different notions of what it \nmeans to be Jewish.   \n 20 \nthe past).  In other words, immigration has altered patterns of ethnic division in some \nsurprising ways.   \nOne arena for inter-ethnic alliances (and intra-ethnic dissension) involves the \nmovement for civil marriage provisions, which would end the monopoly of religious \nauthorities over matters of personal status.  This control has long been a source of deep \nresentment by secular Jews in Israel, particularly in relation to marriage (the ceremony must \nbe conducted by an Orthodox rabbi, irrespective of whether the individuals are members of \nor attend services at a synagogue).  In mobilizing to create an option for civil marriage, many \nsecular veteran Israelis are making common cause with Russian immigrants (Jewish and \nnon-Jewish alike) against the ultra-Orthodox.  The practice of travelling to Cyprus did not \nbegin with Russian non-Jewish immigrants – secular Israelis from a variety of backgrounds \nhave been getting married this way for many years.  For those who are Jewish by Orthodox \nrules, doing so was a matter of personal preference – while for non-Jewish Russians there is \nno alternative if one is not satisfied with cohabitation and wants to get married.  As Israeli \njournalist Alexander Yakobson (2009) points out, ‘anger at the religious establishment is an \nimportant cultural marker of Israeli Jewish society.  This is also a kind of integration’.  The \nreligious establishment understands the basis of its power very well and has so far \nprevented passage of the various bills presented in the Knesset.  This movement – a key \nbattlefield in Israel’s Kulturkampf (Shain 2002) – has not succeeded yet and might ultimately \nfail (in the sense that people stop working for it).   \nBut changes in law are only part of the story.  As a result of non-Jewish immigration, \nthere have been significant changes in what people do, and ‘practice’ is arguably more \nimportant than law for understanding ethnic divisions.  The marriage issue is central in this \nregard, given the generally high (though also variable) degree of endogamy in ethnic groups \n(e.g. De Vos 2006).  The unity of Jews as an ethnic group in Israel, while never complete, has \ndeclined in recent years in part through changes in marriage practices particularly in the \nultra-Orthodox population.  As described above, individuals in this subgroup of Jews are \nnow presumptively unwilling to marry individuals in other sub-groups, particularly the \nRussians and Ethiopians, because of doubts about their Jewishness.  While those concerns \narise in relation to a specific dimension of religious law, that dimension has a strong ethnic \ncharacter, insofar as it refers primarily to descent: one is Jewish by Orthodox \n 21 \nunderstandings of halakha (religious law) if one’s mother is Jewish (or via conversion).  In \naddition, the rate of marriage has been declining, with some (halakhic) Jews and non-Jews \nalike preferring simply to cohabit rather than submit to the demands of the rabbinate.  In \nthis central dimension of personal life, then, immigrants have helped exacerbate certain \ndivisions (religious vs. secular) while diminishing others (immigrant vs. native).  If the \nmovement for civil marriage is eventually successful, it will amount to a dramatic change in \nthe basis of Israeli identity.  Even without a legislative change, however, there have been \nsignificant and complex changes in Israeli identity resulting from the Russian and Ethiopian \nimmigration waves. \n In other words, the social division apparent in ultra-Orthodox lists of eligible \nmarriage partners is not limited to suspicion and rejection towards Russians by the ultra-\nOrthodox: antipathy and rejection go in the other direction as well.  Many secular Israeli \nJews were strongly supportive of Russian immigration and are deeply disturbed by the \nattitudes and actions of the ultra-Orthodox, particularly the rabbinical establishment.  \nDissension between religious and secular Jews predates the Russian immigration wave – but \nthat immigration has been a significant factor aggravating the tensions.  From the point of \nview of secular Jews, it is deeply unjust for the State of Israel to accept immigrants as \n‘Jewish enough’ for the Law of Return – and for compulsory service in the army, in particular \n– but then fail to address their problems of personal status relating to central matters such \nas marriage.  ‘Veteran’ secular Jews often feel that they have more in common with \nRussians (regardless of Jewishness in a halakhic sense) than with people in the ultra-\nOrthodox population in this regard.  One can also find resentment and distance between \nRussians and other secular Jews.  But what bears emphasis here is that division between \nimmigrants and natives is not the only consequence of the Russian immigration wave: that \nimmigration wave has also exacerbated a central division between native Jewish Israelis, \nwhile immigrants and certain natives have succeeded in finding significant areas of common \nground.   \n A similar dynamic can be discerned in the relations among the ultra-Orthodox, \nEthiopian immigrants, and secular veteran Israelis.  Having been cut off from the \ndevelopment of rabbinic Judaism in Europe and the Middle East, Ethiopians practiced a very \ndifferent form of Judaism.  Rabbinic authorities in Israel were unwilling to accept the \n 22 \nlegitimacy of such ‘deviations’ and (in addition to insisting on symbolic conversion) were \nparticularly keen to enrol Ethiopian children in state religious schools so that they would \nlearn the ‘right’ version.  Many secular Israelis saw the demands and actions of the \nrabbinate as harassment (Kaplan and Salamon 2004).  Perhaps to an even greater extent \nthan with Russian immigrants, secular native Israelis and Ethiopian Jewish immigrants have \nfound significant common ground. \n The ‘place’ of non-Jewish migrant workers in Israel is much more tenuous.  But as \nindicated above, there are also areas of commonality between migrant workers and the \nJewish Israeli population.  This is certainly the case in the perspective of some of the migrant \nworkers themselves.  Many migrant workers are Christians,18\n It is not clear that this attempt to develop a Christian equivalent of an Israeli Jewish \nidentity is perceived as convincing by significant numbers of Israeli Jews.  It is certainly not \ntaken seriously by the Interior Ministry (e.g. for purposes of granting legal status).  But \nseems entirely plausible that migrant workers’ attempts to ‘fit in’ via adoption of elements \nof Israeli Jewish culture (in addition to the basic accomplishment of learning Hebrew) would \nenhance prospects for developing ties with Israelis.  Many Tel Aviv residents (i.e., Israeli \ncitizens) embrace cosmopolitan and multicultural attitudes and reject what they perceive as \nthe tribalism of traditional Zionism.  People of this type are not troubled by the presence of \nnon-Jews: ‘”I do not have any problem with the foreign workers…  On Saturday you see \n and Israel’s image as the ‘Holy \nLand’ is one reason many of these workers have chosen to find work in Israel as against \nsome other destination.  While living in Israel, some Christian workers have adopted an \nidentity of ‘Christian Zionists’, believing (in common with some fundamentalist Christians in \nthe USA) that God has indeed given Israel to the Jews.  This ‘identification’ with a traditional \nJewish Zionist perspective is then enhanced by a set of innovative religious practices: \nwearing kippot (skullcaps) and talitot (prayer shawls) during church services (Raijman and \nKemp 2004).  Extending this practice even further, some immigrants from Latin America \nhave created and joined ‘Messianic Jewish’ congregations, and some have also expressed a \ndesire to convert to Judaism (though the state and the rabbinate have effectively made this \nimpossible for people in the ‘foreign workers’ category) (Kalir 2006).   \n                                                     \n18 The Chinese are an exception, though some have converted to Christianity in Israel (Kalir 2009).  \n 23 \ncolours, it’s fun to see.  I feel as if I live in a city like New York”’ (quoted in Fenster and \nYacobi 2005, p. 206). Cosmopolitanism among Israelis arises more from increasing appetites \nfor foreign travel and media, but in recent years it is also an effect of immigration, \nparticularly of non-Jews (Berthomière 2003).   \n A variety of laws have been passed and policy proposals offered to reverse this \ntrend.   A recent proposal for reform of Israeli immigration laws considers non-Jewish \nimmigration a disaster, both for Israelis and the immigrants themselves (Avineri et al. 2009).  \nLaws and policies of this sort might produce their intended outcomes, at least to a degree.  \nBut one must be careful not to read reality from laws and policies.  On the contrary: to a \ncertain extent the laws and policies demonstrate the new reality, the magnitude of the \n‘problem’ one wants to solve.  One example is the ‘Hadera\/Gadera’ rule, which stipulated \nthat migrant workers were required to live north of Hadera (roughly 25 miles north of Tel \nAviv) or south of Gadera (ten miles to the south of Tel Aviv) (Weiler-Polak 2009a).  As an \neffort to reduce the concentration of migrant workers residing in Tel Aviv, the rule was an \nutter failure, and its repeal shortly after adoption in summer 2009 merely confirmed the \nreality abhorred by those in the Interior Ministry who concocted it and the powerlessness of \ngovernment to do much about it.  \n Many observers, Israeli and non-Israeli alike, appear to hold strongly to the \nassumption that being Jewish (or, at a minimum, having close Jewish family ties) is the sine \nqua non for successful integration in Israel as an immigrant.  Existing laws and social \nattitudes do create a difficult context for non-Jewish immigrants.  But immigrants encounter \ndifficult contexts in a great many destinations around the world; Israel is hardly unique in \nthis regard, not even in having a high degree of ethnic closure to outsiders.  Even in the \ndifficult context of Israel, non-Jewish immigrants are succeeding, to a certain limited degree, \nin establishing new homes and new identities, in part through development of ties and \naffinities with native Israelis.  Even immigration of the migrant workers has not resulted in a \nset of social divisions that draw uncrossable lines between them and the rest of the Israeli \npopulation.   \n 24 \nConclusion \nThe overwhelming majority of the Israeli Jewish population has a migration history in the \n20th century.  For those eligible to enter under the Law of Return, immigration has had some \nof the unifying effects envisioned by traditional Zionism (though even Jewish immigrants \nencountered a measure of the exclusion experienced by immigrants everywhere).  \nMigration to Israel in the last two decades, however, has had a very significant non-Jewish \ncomponent.  But even immigration of non-Jews has not been only divisive in its effects.  \nThere is a tendency in popular thinking (if not in scholarly work) to believe that immigrants \nare almost inevitably a divisive force, in part because of widespread anti-immigrant \nsentiment but also because immigrants are almost inevitably different from natives in some \nobvious ways.  But this paper has argued that, even in Israel where divisions are already \nextensive and a ‘new’ population might be expected only to exacerbate them, there are \nother effects to consider as well.   \nEthnic relations in Israel have become extraordinarily complex in recent years \n(especially considering the relatively small size of the population).  To summarize the \nchanges described above in relation to recent immigration: ‘Russian’ is a new Israeli \nethnicity, and while many Russians are Jewish, some are not, and yet even the non-Jews in \nthe Russian group are fully Israeli.  A similar pattern describes the smaller group of \nEthiopians, whose acceptance as Jews is sometimes compromised by racist attitudes among \nsome other Israelis.  The migrant workers (by definition, non-Jewish) are barely accepted as \n‘immigrants’, let alone potential full members (citizens) of Israeli society – and yet their \nposition as ‘margizens’ constitutes a certain degree of membership in addition to exclusion, \nand a small number have been granted a path towards permanent status (even citizenship, \nin the case of some children).  And among natives the presence of the non-Jewish \nimmigrants has exacerbated divisions between certain groups of Jews – mainly, the secular \nand the ultra-Orthodox – particularly as people in each group deeply resent the attitudes \nand behaviour of some in the other group towards the non-Jews (or, in the case of the ultra-\nOrthodox, even towards other Jews).   \nAs Kimmerling (2001) asserts, there is not a unified notion of ‘Israeliness’, even \namong Israeli Jews; Ben-Rafael speaks of a ‘multiplication of divergences’ (2007, p. 68).  \n 25 \nIsraeli ethnicity was never as simple as some might assume, with a straightforward division \nbetween Jews and Arabs denoting a set of (internally) undifferentiated identities and social \nprocesses.  Instead, there were always internal divisions in both groups (e.g. Kop and Litan \n2002), and those divisions involved a significant degree of stratification and oppression.  The \nprocess of creating the Israeli nation-state produced profound changes in the (pre-state) \nidentity of both groups, and that process was strongly marked by interaction between the \ntwo main groups (Jewish and Arab) as well (Kimmerling 2008).  There have also long been \nsignificant structural and affective ties between Jewish and Arab Israelis and certain groups \nof foreigners (Diaspora Jewry and other Arabs, respectively).  But until the early 1990s, the \nethnic landscape of Israel was characterized by a high degree of exclusivity in relation to \nthose two main categories: Israelis were either Arab or Jewish, with little relevance for other \nethnic categories.  The immigration of non-co-ethnics (i.e., mainly non-Jews) has profoundly \ntransformed that landscape – not merely through the presence of the immigrants \nthemselves but through their effect on the identity and interactions of natives.   \nIsrael is by no means the only highly ethno-nationalist destination country that \nstruggles with the immigration of non-co-ethnics.  Migration to Japan, consisting of Nikkeijin \nand prototypical ‘guestworkers’ (see e.g. Surak 2008), evinces some key similarities to Israel.  \nBut there are some important differences as well, particularly insofar as it is considered \nextremely difficult for foreigners to become Japanese (Lee et al. 2006, Tsuda and \nWagatsuma 2006).  The Japanese case helps reveal the relative accessibility of Israel to non-\nco-ethnic immigrants.  One reason for that relative openness is that the Jewish core of \nIsraeli identity contains an important disjuncture between its religious and social\/ethnic \nelements.  If non-Jewish Russians can become Jewish (not just Israeli) in an ethnic sense via \na ‘sociological conversion’ while lacking recognized religious status, then it becomes difficult \nto see what would prevent a similar process for other non-Jewish immigrants.  Most Israelis \ndo not want to see migrant workers integrated into Israeli society in this way – and while \nthis fact is consequential, comparisons to other cases of immigration (including the \ncontrasting case of Japan) suggest that it will be insufficient to prevent at least some \nmigrant workers from becoming Israeli to a significant degree.   \n \n 26 \nReferences \n \nAbella, M. (1995) Asian migrant and contract workers in the Middle East, in: R. Cohen (ed), The \nCambridge survey of world migration, pp. 418-423 (Cambridge: Cambridge University Press). \nAl-Haj, M. (2004) Immigration and ethnic formation in a deeply divided society: the case of the 1990s \nimmigrants from the Former Soviet Union in Israel (Boston: Brill). \nAlexander, M. (2007) Local migrant policies in a guestworker regime: the case of Tel Aviv, in: S.S. \nWillen (ed), Transnational Migration to Israel in Global Comparative Context, pp. 73-86 \n(Plymouth: Lexington Books). \nAnderson, B. (1983) Imagined Communities: Reflections on the Origin and Spread of Nationalism \n(London: Verso). \nAvineri, S., Orgad, L. and Rubinstein, A. (2009) Managing global migration: a strategy for \nimmigration policy in Israel  (Jerusalem: Merkaz Metzilah, in Hebrew). \nBartram, D. (2005) International labor migration: foreign workers and public policy (New York: \nPalgrave Macmillan). \nBen-Eliezer, U. (2008) Multicultural society and everyday cultural racism: second generation of \nEthiopian Jews in Israel's 'crisis of modernization', Ethnic and Racial Studies, 31(5), pp. 935-\n961. \nBen-Rafael, E. (1982) The Emergence of Ethnicity: Cultural Groups and Social Conflict in Israel \n(Westport: Greenwood Press). \nBen-Rafael, E. (2007) Mizrahi and Russian Challenges to Israel's Dominant Culture: Divergences and \nConvergences, Israel Studies, 12(3), pp. 68-91. \nBen-Rafael, E. and Peres, Y. (2005) Is Israel One? Religion, Nationalism, and Multiculturalism \nConfounded (Leiden: Brill). \nBenski, T. (1994) Ethnic Convergence Processes under Conditions of Persisting Socioeconomic- \nDecreasing Cultural Differences: The Case of Israeli Society, International Migration Review, \n28(2), pp. 256-280. \nBerthomière, W. (2003) L'émergence d'une Tel Aviv cosmopolite ou les effets d'un fin mélange entre \nreconfigurations sociopolitiques internes et externes, Cahiers de la Méditerranée, 67. \nBorowski, A. and Yanai, U. (1997) Temporary and illegal labor migration: the Israeli experience, \nInternational Migration, 35(4), pp. 495-509. \nButt, R. (2009) Jewish schools to admit pupils on religion, not race, after high court ruling, The \nGuardian, 31 July. \nCastles, S. and Miller, M.J. (2009) The age of migration (London: Macmillan Press). \nCohen-Almagor, R. (1995) Cultural pluralism and the Israeli nation-building ideology, International \nJournal of Middle Eastern Studies, 27(4), pp. 461-484. \nCohen, N. (2007) From overt rejection to enthusiastic embracement: changing state discourses on \nIsraeli emigration, GeoJournal, 68(2-3), pp. 267-728. \nCohen, Y. (2009) Migration Patterns to and from Israel, Contemporary Jewry, 29(2), pp. 115-125. \nDahan, Y. and Gill, A. (2006) Between Neo-Liberalism and Ethno-Nationalism: The Policy and Law of \nDeporting Migrant Workers, Mishpat u'Mimshal, 10(1), pp. 347-385 (in Hebrew). \n 27 \nDe Vos, G. (2006) Ethnic pluralism: conflict and accommodation, in: L. Romanucci-Ross, G.A. De Vos, \nand T. Tsuda (eds), Ethnic identity: problems and prospects for the twenty-first century, pp. \n1-36 (Lanham: AltaMira Press). \nDe Vos, G. and Wagatsuma, H. (2006) Cultural identity and minority status in Japan, in: G. De Vos, L. \nRomanucci-Ross, and T. Tsuda (eds), Ethnic Identity: Problems and Prospects for the Twenty-\nfirst Century, pp. 119-156 (Lanham: Altamira Press). \nFenster, T. and Yacobi, H. (2005) Whose city is it?  On urban planning and local knowledge in \nglobalizing Tel Aviv-Jaffa, Planning Theory and Practice, 6(2), pp. 191-211. \nGavison, R. (1999) A rejoinder to the 'ethnic democracy' debate, Israel Studies, 4(1), pp. 44-72. \nGavison, R. (2008) Civic Equality Does Not Mean Freedom of Immigration, HaAretz, 14 July. \nGhanem, A., Rouhana, N. and Yiftachel, O. (1998) Questioning 'Ethnic Democracy': A response to \nSammy Smooha, Israel Studies, 3(2), pp. 253-267. \nGorenberg, G. (2008) How Do You Prove You’re a Jew?, New York Times, 2 March. \nHacker, D. (2009) Inter-Religious Marriages in Israel: Gendered Implications for Conversion, Children, \nand Citizenship, Israel Studies, 14(2), pp. 178-197. \nHacohen, D. (2003) Immigrants in Turmoil: Mass Immigration to Israel and its Repercussions in the \n1950s and After (Syracuse: Syracuse University Press). \nHeller, T. (1997) Modernity, Membership, and Multiculturalism, Stanford Humanities Review, 5(2). \nHerzog, S. (2009) Ethnic and immigrant residential concentration, and crime rates, Journal of \nCriminal Justice, 37(5), pp. 427-434. \nHolston, J. (1999) Cities and citizenship (Durham: Duke University Press). \nIlan, S. and Azouly, Y. (2007) Foreign workers' kids: 1,500 to stay, 800 to go, HaAretz, 20 June. \nJamal, A. (2007) Nationalizing States and the Constitution of ‘Hollow Citizenship’: Israel and its \nPalestinian Citizens, Ethnopolitics, 6(4), pp. 471-493. \nJoppke, C. (1999) How immigration is changing citizenship: a comparative view, Ethnic and Racial \nStudies, 22(4), pp. 629-652. \nJoppke, C. (2005) Selecting by origin: ethnic migration in the liberal state (Cambridge: Harvard \nUniversity Press). \nJoppke, C. and Morawska, E. (2003) Integrating Immigrants in Liberal Nation-States: Policies and \nPractices, in: C. Joppke and E. Morawska (eds), Toward assimilation and citizenship: \nimmigrants in liberal nation-states, pp. 1-36 (Basingstoke: Palgrave Macmillan). \nKahane, R. (1986) Informal agencies of socialization and the integration of immigrant youth into \nsociety: an example from Israel, International Migration Review, 20(1), pp. 21-39. \nKalir, B. (2006) Christian Aliens in The Jewish State: Undocumented Migrants from Latin America \nStriving for Practical National Belonging in Israel (PhD Thesis: University of Amsterdam). \nKalir, B. (2009) Finding Jesus in the Holy Land and Taking Him to China: Chinese Temporary Migrant \nWorkers in Israel Converting to Evangelical Christianity, Sociology of Religion, 70(2), pp. 130-\n156. \nKaplan, S. and Salamon, H. (2004) Ethiopian Jews in Israel: a part of the people or apart from the \npeople?, in: U. Rebhun and C. Waxman (eds), Jews in Israel: contemporary social and cultural \npatterns, pp. 118-148 (Hanover: Brandeis University Press\/University Press of New England). \n 28 \nKashti, O., Ettinger, Y. and Weiler-Polak, D. (2009) Petah Tikva schools ordered to take in Ethiopian \nstudents, HaAretz, 2 September. \nKemp, A. (2007) Managing Migration, Reprioritizing National Citizenship: Undocumented Migrant \nWorkers’ Children and Policy Reforms in Israel, Theoretical Inquiries in Law, 8(2), Article 12. \nKemp, A. and Raijman, R. (2004) 'Tel Aviv is not foreign to you: urban incorporation policy on labor \nmigrants in Israel, International Migration Review, 38(1), pp. 26-51. \nKemp, A., Raijman, R., Resnik, J. and Schammah Gesser, S. (2000) Contesting the limits of political \nparticipation: Latinos and Black African migrant workers in Israel, Ethnic and Racial Studies, \n23(1), pp. 94-119. \nKimmerling, B. (2001) The invention and decline of Israeliness: state, society, and the military \n(Berkeley: University of California Press). \nKimmerling, B. (2008) Clash of Identities: Explorations in Israeli and Palestinian Societies (New York: \nColumbia University Press). \nKop, Y. and Litan, R.E. (2002) Sticking together: the Israeli experiment in pluralism (Washington DC: \nBrookings Institution). \nKruger, M. (2005) Strangers in a strange land: international migration in Israel, Global Migration \nPerspectives (Global Commission on International Migration). \nLee, S.i., Murphy-Shigematsu, S. and Befu, H. (2006) Japan's Diversity Dilemmas: Ethnicity, \nCitizenship, and Education (Bloomington: iUniverse). \nLustick, I. (1999) Israel as a non-Arab state: the political implications of mass immigration of non-\nJews, Middle East Journal, 53(3), pp. 101-117. \nMartiniello, M. (1992) Leadership et pouvoir dans les communautés d’origine immigrée (Paris: \nL'Harmattan). \nMerin, Y. (2004) The Right to Family Life and Civil Marriage under International Law and Its \nImplementation in the State of Israel, bepress Legal Series, #275. \nPeled, Y. (ed) (2001) Shas – the challenge of Israeliness (Tel Aviv: Yediot Ahronot, in Hebrew). \nPeled, Y. (2007) Citizenship Betrayed: Israel’s Emerging Immigration and Citizenship Regime, \nTheoretical Inquiries in Law, 8(2), Article 10. \nPilovsky, L. (1999) 'Present absentees': the functioning of manpower organizations in dealing with \nforeign workers in Israel, and their connections with government institutions, in: R. \nNatanson and L. Achdut (eds), The new laborers: workers from foreign countries in Israel, pp. \n41-89 (Tel Aviv: HaKibbutz HaMeuchad, in Hebrew). \nPiore, M.J. (1979) Birds of passage: migrant labor and industrial societies (Cambridge: Cambridge \nUniversity Press). \nPortes, A. and Rumbaut, R. (1996) Immigrant America: a portrait (Berkeley: University of California \nPress). \nRaijman, R. and Kemp, A. (2004) Consuming the Holy Spirit in the holy land: evangelical churches, \nlabor migrants, and the Jewish state, in: Y.S. Carmeli and K. Applbaum (eds), Consumption \nand market society in Israel, pp. 163-184 (Oxford: Berg). \nRaijman, R. and Kemp, A. (2007) Labor migration, managing the ethno-national conflict, and client \npolitics in Israel, in: S.S. Willen (ed), Transnational Migration to Israel in Global Comparative \nContext, pp. 31-50 (Plymouth: Lexington Books). \n 29 \nRaijman, R., Schammah-Gesser, S. and Kemp, A. (2003) International migration, domestic work, and \ncare work: undocumented Latina migrants in Israel, Gender & Society, 17(5), pp. 727-749. \nRaijman, R. and Semyonov, M. (2004) Perceived threat and exclusionary attitudes towards foreign \nworkers in Israel, Ethnic and Racial Studies, 27(5), pp. 780-799. \nRebhun, U. and Malach, G. (2009) Demographic trends in Israel (Jerusalem: Merkaz Metzilah). \nResnik, J. (2009) Contextualizing recognition, absence of recognition, and misrecognition: the case of \nmigrant workers' children in daycares in Israel, Journal of Curriculum Studies, 41(5), pp. 625-\n649. \nRogers, R. (1985) Guests come to stay: the effects of European labor migration on sending and \nreceiving countries (Boulder: Westview Press). \nRosenhek, Z. (2002) Migration regimes and social rights: migrant workers in the Israeli welfare state, \nin: D. Levy and Y. Weiss (eds), Challenging ethnic citizenship: German and Israeli perspectives \non immigration, pp. 137-153 (Oxford: Berghahn). \nRouhana, N. (1997) Palestinian citizens in an ethnic Jewish state: identities in conflict (New Haven: \nYale University Press). \nSchain, Y. (2002) Jewish kinship at a crossroads: lessons for homelands and diasporas, Political \nScience Quarterly, 117(2), pp. 279-309. \nSchölch, A. (1985) The demographic development of Palestine, 1850-1882, International Journal of \nMiddle East Studies, 17(4), pp. 485-505. \nSeeman, D. (2009) One People, One Blood: Ethiopian-Israelis and the Return to Judaism (Rutgers: \nRutgers University Press). \nShachar, A. (2000) Citizenship and membership in the Israeli polity, in: D.B. Klusmeyer and T.A. \nAleinikoff (eds), From migrants to citizens: membership in a changing world, pp. 386-433 \n(Washington, D.C.: Carnegie Endowment for International Peace). \nShafir, G. (1989) Land, labor, and the origins of the Israeli-Palestinian conflict, 1882-1914 \n(Cambridge: Cambridge University Press). \nShafir, G. and Peled, Y. (2002) Being Israeli: the dynamics of multiple citizenship (Cambridge: \nCambridge University Press). \nSheleg, Y. (2004) Not Halakhically Jewish: the Dilemma of Non-Jewish Immigrants in Israel \n(Jerusalem: Israeli Democracy Institute, Working Paper 51, in Hebrew). \nSheleg, Y. (2009) Let the convert beware, HaAretz, 4 April. \nShuval, J. (1998) Migration to Israel: the mythology of 'uniqueness', International Migration, 36(1), \npp. 3-24. \nShuval, J. and Leshem, E. (1998) The sociology of migration in Israel: a critical view, in: E. Leshem and \nJ. Shuval (eds), Immigration to Israel: sociological perspectives, pp. 3-50 (London: \nTransaction Publishers). \nSmooha, S. (1990) Minority status in an ethnic democracy: The status of the Arab minority in Israel, \nEthnic and Racial Studies, 13(3), pp. 389-413. \nSurak, K. (2008) Convergence in Foreigners' Rights and Citizenship Laws? A Look at Japan, \nInternational Migration Review, 42(3), pp. 550-575. \nSwirsky, S. (1989) Israel: the Oriental majority (London: Zed Books). \n 30 \nWagaw, T.G. (1993) For our soul: Ethiopian Jews in Israel (Detroit: Wayne State University Press). \nWalzer, M. (1983) Spheres of justice: a defense of pluralism and equality (New York: Basic Books). \nWeil, S. (1996) Religion, Blood and the Equality of Rights The Case of Ethiopian Jews in Israel, \nInternational Journal on Minority and Group Rights, 4(3-4), pp. 397-412. \nWeiler-Polak, D. (2009a) Netanyahu defers expulsion of children of migrant workers, HaAretz, 31 \nJuly. \nWeiler-Polak, D. (2009b) Ignoring Arab women, ministry okays 3,000 new foreign workers, HaAretz, \n22 October. \nWillen, S.S. (2005) Birthing \"invisible\" children: State power, NGO activism, and reproductive health \namong illegal migrant workers in Tel Aviv, Israel, Journal of Middle East Women's Studies, \n1(2), pp. 55-88. \nWillen, S.S. (2007) Transnational Migration to Israel in Global Comparative Context (Plymouth: \nLexington Books). \nWurgaft, N. (2006) Police! Open Up! Migrant Workers in Israel (Tel Aviv: Am Oved, in Hebrew). \nYa'ar, E. (2005) Continuity and Change in Israeli Society: The Test of the Melting Pot, Israel Studies, \n10(2), pp. 91-128. \nYakobson, A. (2009) Despite the ultra-Orthodox, HaAretz, 8 July. \nYiftachel, O. and Ghanem, A. (2004) Learning from the Judaization of Israel\/Palestine, in: E.P. \nKaufmann (ed), Rethinking ethnicity: majority groups and dominant minorities, pp. 179-197 \n(London: Routledge). \nZolberg, A. (1987) Wanted but not welcome: alien labor in Western development, in: W. Alonso (ed), \nPopulation in an interacting world, pp. 36-73 (Cambridge, MA: Harvard University Press). \n"}