{"doi":"10.1007\/s12528-010-9036-1","coreId":"196868","oai":"oai:lra.le.ac.uk:2381\/9073","identifiers":["oai:lra.le.ac.uk:2381\/9073","10.1007\/s12528-010-9036-1"],"title":"Curriculum, intellectual property rights and open educational resources in British universities—and beyond","authors":["Hawkridge, David","Armellini, Alejandro","Nikoi, Samuel","Rowlett, Tania","Witthaus, Gabi"],"enrichments":{"references":[{"id":43674370,"title":"Build it and they will come? Inhibiting factors for re-use of open content in developing countries’,","authors":[],"date":"2009","doi":null,"raw":"Hatakka, M. (2009) ‘Build it and they will come? Inhibiting factors for re-use of open content in developing countries’, Electronic Journal on Information Systems in Developing Countries (http:\/\/www.ejisdc.org), 37(5), 1-16.","cites":null},{"id":43674368,"title":"Business, Innovation and Skills","authors":[],"date":"2009","doi":"10.1057\/9780230233553","raw":"Department of Business, Innovation and Skills (2009) Higher Ambitions: The future of universities in a knowledge economy. http:\/\/www.bis.gov.uk\/assets\/biscore\/corporate\/docs\/h\/09-1447-higher-ambitions.pdf.","cites":null},{"id":43674375,"title":"Case studies mapping the flows of content, value and rights across the public sector.","authors":[],"date":"2009","doi":null,"raw":"Tsiavos, P. (2009). Case studies mapping the flows of content, value and rights across the public sector. http:\/\/www.jisc.ac.uk\/media\/documents\/publications\/scaiprcasestudiesv2.pdf.","cites":null},{"id":43674369,"title":"Dollars, Distance, and Online Education: The new economics of college teaching and learning.","authors":[],"date":"2000","doi":null,"raw":"Finkelstein, M.J., Frances C., Jewett, F.I., & Scholz, B.W. (2000). Dollars, Distance, and Online Education: The new economics of college teaching and learning. Phoenix, AZ: Oryx Press.","cites":null},{"id":43674372,"title":"From Pillar to Post: exploring the issues involved in repurposing distance learning materials for use as Open Educational Resources.","authors":[],"date":"2006","doi":null,"raw":"Lane, A. (2006). From Pillar to Post: exploring the issues involved in repurposing distance learning materials for use as Open Educational Resources.","cites":null},{"id":43674371,"title":"http:\/\/www.jisc.ac.uk\/media\/documents\/funding\/project_management\/open_content_l icences_jiscguidancenov2008.doc.","authors":[],"date":"2008","doi":null,"raw":"Intellectual Property Rights 27 Korn, N., Oppenheim, C., Duncan, C. (2008). Open content licences: JISC guidance November 2008. http:\/\/www.jisc.ac.uk\/media\/documents\/funding\/project_management\/open_content_l icences_jiscguidancenov2008.doc. Accessed 24 May 2010.","cites":null},{"id":43674374,"title":"OECD","authors":[],"date":"2010","doi":null,"raw":"http:\/\/www.bb.ustc.edu.cn\/ocw\/NR\/rdonlyres\/1118F4F3-AA41-4CB4-B71FF6E058AD22AA\/0\/MIT_OCW_Approach_10_5_04.pdf. Accessed 28 May 2010 OECD (2007) Giving Knowledge for Free: The emergence of open educational resources. Education and Skills, 2007 (3), 1-153. http:\/\/puck.sourceoecd.org\/vl=5684928\/cl=18\/nw=1\/rpsv\/~6670\/v2007n3\/s1\/p1l.","cites":null},{"id":43674367,"title":"OERs: the promise and the pitfalls. Connections: Learning for Development,","authors":[],"date":"2009","doi":null,"raw":"Commonwealth of Learning (2009) OERs: the promise and the pitfalls. Connections: Learning for Development, 14(3), 8-9.","cites":null},{"id":43674373,"title":"OpenLearn: Research report 2006-2008. The Open University,","authors":[],"date":null,"doi":null,"raw":"OpenLearn: Research report 2006-2008. The Open University, Milton Keynes.","cites":null},{"id":43674366,"title":"Permission granted: open licensing for educational resources’ Open Learning:","authors":[],"date":"2009","doi":"10.1080\/02680510802627886","raw":"Bissell, A.N. (2009) ‘Permission granted: open licensing for educational resources’ Open Learning: The Journal of Open and Distance Learning, 24(1), 97-106.","cites":null},{"id":43674365,"title":"What status for “open”? An examination of the licensing policies of open educational organizations and projects, Report from CC Learn to The William and Flora Hewlett Foundation.","authors":[],"date":"2008","doi":null,"raw":"Intellectual Property Rights 26 Bissell, A., Park, J., Brooks, A. (2008) What status for “open”? An examination of the licensing policies of open educational organizations and projects, Report from CC Learn to The William and Flora Hewlett Foundation.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-11-03","abstract":"Is the curriculum in British universities being influenced by decisions about ownership of intellectual property rights (IPR) in ‘open educational resources’ (OERs) that are available online under Creative Commons licenses, free of charge?\\ud\nThis paper provides the context for, describes and analyses three significant examples in British higher education where OERs are being created for use by academics and learners on campus or at a distance. OpenLearn and iTunes U, two of the British examples, are drawn from the Open University of the United Kingdom, which teaches over 200,000 undergraduate and graduate students almost entirely at a distance. The third example, OTTER, is at the University of Leicester, a campus university in England with about 7,000 distance learners. Both universities depend on government funding, student fees, research and entrepreneurial income. All three examples are funded indirectly by the British government, though OpenLearn has received substantial US foundation support as well. In presenting these examples, the questions arise of whether the projects are supply- or demand-driven, and of whether they are altruistic or not. Debate over intellectual property rights has influenced creation of the OERs and vice versa, but from these three examples it seems doubtful whether, as yet, OERs and IPR have significantly influenced British universities’ curriculum. The paper ends with discussion of how OERs created in British universities are influencing teaching and learning in other countries, as globalisation advances","downloadUrl":"http:\/\/www.springerlink.com\/content\/8532436538121715\/,","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/9073\/1\/Hawkridge%20Manuscript_EditDGH.pdf","pdfHashValue":"ae4bf4d629331550712bbc52fd4fe4976f3ff9e6","publisher":"Springer Science+Business Media","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/9073<\/identifier><datestamp>\n                2015-12-10T12:21:52Z<\/datestamp><setSpec>\n                com_2381_327<\/setSpec><setSpec>\n                com_2381_9548<\/setSpec><setSpec>\n                col_2381_4253<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nCurriculum, intellectual property rights and open educational resources in British universities—and beyond<\/dc:title><dc:creator>\nHawkridge, David<\/dc:creator><dc:creator>\nArmellini, Alejandro<\/dc:creator><dc:creator>\nNikoi, Samuel<\/dc:creator><dc:creator>\nRowlett, Tania<\/dc:creator><dc:creator>\nWitthaus, Gabi<\/dc:creator><dc:subject>\nBritish universities<\/dc:subject><dc:subject>\nCurriculum<\/dc:subject><dc:subject>\nIntellectual property rights<\/dc:subject><dc:subject>\nOpen educational resources<\/dc:subject><dc:subject>\nOpen University<\/dc:subject><dc:subject>\nUniversity of Leicester<\/dc:subject><dc:subject>\nBeyond Distance Research Alliance<\/dc:subject><dc:description>\nIs the curriculum in British universities being influenced by decisions about ownership of intellectual property rights (IPR) in ‘open educational resources’ (OERs) that are available online under Creative Commons licenses, free of charge?\\ud\nThis paper provides the context for, describes and analyses three significant examples in British higher education where OERs are being created for use by academics and learners on campus or at a distance. OpenLearn and iTunes U, two of the British examples, are drawn from the Open University of the United Kingdom, which teaches over 200,000 undergraduate and graduate students almost entirely at a distance. The third example, OTTER, is at the University of Leicester, a campus university in England with about 7,000 distance learners. Both universities depend on government funding, student fees, research and entrepreneurial income. All three examples are funded indirectly by the British government, though OpenLearn has received substantial US foundation support as well. In presenting these examples, the questions arise of whether the projects are supply- or demand-driven, and of whether they are altruistic or not. Debate over intellectual property rights has influenced creation of the OERs and vice versa, but from these three examples it seems doubtful whether, as yet, OERs and IPR have significantly influenced British universities’ curriculum. The paper ends with discussion of how OERs created in British universities are influencing teaching and learning in other countries, as globalisation advances.<\/dc:description><dc:date>\n2011-02-15T13:06:12Z<\/dc:date><dc:date>\n2011-02-15T13:06:12Z<\/dc:date><dc:date>\n2010-11-03<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nJournal of Computing in Higher Education, 2010, 22 (3), pp. 162-176<\/dc:identifier><dc:identifier>\n1042-1726<\/dc:identifier><dc:identifier>\nhttp:\/\/link.springer.com\/article\/10.1007%2Fs12528-010-9036-1<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/9073<\/dc:identifier><dc:identifier>\n10.1007\/s12528-010-9036-1<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nThis is the author’s final draft of the paper published as Journal of Computing in Higher Education, 2010, 22 (3), pp. 162-176.  The final published version is available at http:\/\/www.springerlink.com\/content\/8532436538121715\/, Doi: 10.1007\/s12528-010-9036-1.<\/dc:rights><dc:publisher>\nSpringer Science+Business Media<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["1042-1726","issn:1042-1726"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["British universities","Curriculum","Intellectual property rights","Open educational resources","Open University","University of Leicester","Beyond Distance Research Alliance"],"subject":["Article"],"fullText":"Intellectual Property Rights  1 \n \n 1 \nTitle page \n \nDavid Hawkridge, Alejandro Armellini, Samuel Nikoi, Tania Rowlett and Gabi Witthaus \n \n \n \n \nCurriculum, intellectual property rights and open educational resources in British universities -- \nand beyond \n \n \nDavid Hawkridge, Emeritus Professor at The Open University, Milton Keynes, MK7 6AA, UK was \nfounding Director of its Institute of Educational Technology; he is a Visiting Professor at the Beyond \nDistance Research Alliance of the University of Leicester, 103-105 Princess Road East, Leicester, LE1 \n7LG, UK. Email: d.g.hawkridge@open.ac.uk, phone and fax +44 1525237217. \n \nWithin the Beyond Distance Research Alliance, Alejandro Armellini is a Senior Learning Designer; \nSamuel Nikoi and Gabi Witthaus are Research Associates in e-Learning. Tania Rowlett is a Copyright \nAdministrator in the University of Leicester Library. \n \n \n \n \n \n \n \n \n \n \n \nIntellectual Property Rights  2 \n \n 2 \nAbstract \n \nIs the curriculum in British universities being influenced by decisions about \nownership of intellectual property rights (IPR) in ‘open educational resources’ \n(OERs) that are available online under Creative Commons licenses, free of charge? \n \nThis paper provides the context for, describes and analyses three significant examples \nin British higher education where OERs are being created for use by academics and \nlearners on campus or at a distance. OpenLearn and iTunes U, two of the British \nexamples, are drawn from the Open University of the United Kingdom, which teaches \nover 200,000 undergraduate and graduate students almost entirely at a distance. The \nthird example, OTTER, is at the University of Leicester, a campus university in \nEngland with about 7,000 distance learners. Both universities depend on government \nfunding, student fees, research and entrepreneurial income. All three examples are \nfunded indirectly by the British government, though OpenLearn has received \nsubstantial US foundation support as well. \n \nIn presenting these examples, the questions arise of whether the projects are supply- \nor demand-driven, and of whether they are altruistic or not. Debate over intellectual \nproperty rights has influenced creation of the OERs and vice versa, but from these \nthree examples it seems doubtful whether, as yet, OERs and IPR have significantly \ninfluenced British universities’ curriculum. The paper ends with discussion of how \nOERs created in British universities are influencing teaching and learning in other \ncountries, as globalisation advances. \n \nIntellectual Property Rights  3 \n \n 3 \n \nKeywords: British universities, curriculum, intellectual property rights, open \neducational resources, \nOpen University, University of Leicester, Beyond Distance Research Alliance \n \n \n \n \n \nIntroduction \nIs the curriculum (what is taught and how) in British universities being influenced by \ndecisions about ownership of intellectual property rights (IPR) and the creation of \n‘open educational resources’ (OERs) released online under Creative Commons \nlicensess, free of charge to all? \n \nEven 20 years ago, certainly 40 years ago, the curriculum in British universities was \ntied to creation of knowledge products by academics (faculty) – and, if they wished, \nthey sold the IPR. The curriculum was to a large extent determined by professors’ \ndecisions regarding the materials their students should use. There was no national \ncurriculum and no national examination. Indeed, that is still so in many countries. \n \nTo match the current curriculum or even to create it, Professor X would write a \nstandard textbook or laboratory manual in his or her field, for publication by a well-\nknown academic publisher, and would receive royalties for many years. He or she \nmight update the text every few years, regarding that task as an academic duty to be \nIntellectual Property Rights  4 \n \n 4 \ncarried out in the university’s time.  \n \nUniversities are now setting out to create OERs. The ownership of IPR in the teaching \nand learning materials that go to make up OERs is complex, but most British \nacademics (faculty members) previously held the IPR, as creators of teaching \nmaterial: they were entitled to a financial return if the materials were published and \nsold. Matters in some universities have been brought to a head. Many now require \ntheir academics to agree that the IPR in material they create will belong to the \nuniversity.  \n \nIs there evidence that creating OERs changes the curriculum, with content and \ndelivery being variously determined by academics, administrators or commercial \nentrepreneurs? \n \nAn American example: MIT \nAt the Massachusetts Institute of Technology (MIT), for example, curriculum has \nbecome related to decisions about ownership of intellectual property rights. MIT \nacademics have allowed their employer to ‘give away’ much of their teaching \nmaterial: since 1999 it has been turned into OpenCourseWare (OCW).  \n \nThe challenges in the OCW project were not in overcoming faculty resistance, \nhowever, but in determining ownership, obtaining permission to publish intellectual \nproperty embedded in the materials and converting them to an online format. \nCopyright in the OCW material remains with MIT, members of its faculty, or even in \nsome cases its students. Today, under the heading ‘Unlocking knowledge, \nIntellectual Property Rights  5 \n \n 5 \nempowering minds’, MIT claims to have 1900 courses, almost its whole curriculum, \navailable worldwide as OCW (http:\/\/ocw.mit.edu\/).  \n \nMIT does not charge for its OCW, which is free, not sold. The online material for \neach course may include the syllabus, lecture notes, problem and answer sets, \nlaboratory notes, readings and reading lists, videoed lectures and other items. There \nare provisos for those who wish to use the material: nobody can get a degree or \ncertificate from MIT by using it, nor obtain access to MIT’s staff. Those benefits can \nonly be obtained via registration as a student and payment of MIT’s very substantial \nfees. \n \nMIT offers translations of selected OCW courses into several languages. Its reach is \nglobal. MIT academics benefit from the favorable publicity that has followed the \ncreation of the OCW.  \n \nRice University’s Connexions (http:\/\/cnx.rice.edu\/) is another example, among a \nhundred or more in the United States, according to OECD (2007). In 2010 it offers \nover 16,000 online modules, created by its academics. \n \nOpen CourseWare (OCW) and Open Educational Resources (OERs) \nIn 2002, at a UNESCO Forum on the Impact of Open Courseware for Higher \nEducation in Developing Countries, funded by The William and Flora Hewlett \nFoundation, the term ‘open educational resources’ (OERs) was defined as \n‘technology-enabled, open provision of educational resources for consultation, use \nand adaption [sic] by a community of users for non-commercial purposes’ \nIntellectual Property Rights  6 \n \n 6 \n(http:\/\/learn.creativecommons.org\/wp-content\/uploads\/2008\/03\/forumreportwcet.pdf). \nProjects to develop OERs subsequently went ahead in many industrialized countries, \nthough not specifically to supply them to developing countries. According to OECD \n(2007), open courseware from more than 3,000 open access courses was available \nfrom over 300 universities worldwide. Universities of the China Open Resources for \nEducation (CORE) consortium offer materials from over 750 courses, and resources \nfrom hundreds more are available from universities of the Japanese OCW Consortium \n(http:\/\/www.jocw.jp\/). In France, resources from around 100 teaching units are \navailable from universities in the ParisTech OCW project \n(http:\/\/graduateschool.paristech.org\/). Notably, in 2009 President Barack Obama \nannounced a proposed $50 million fund for a 10-year program supporting the \ndevelopment of OCW or OERs for US community colleges, within the American \nGraduation Initiative. \n \nOERs, curriculum and intellectual property \nThe long-term significance of OERs was perceived some 10 years ago, but at that \ntime there could be little more than speculation about their impact on the curriculum \nor intellectual property rights. Finkelstein et al. (2000) warned that: \n \n“There will be serious issues regarding the ownership of intellectual property; \nthe resolution of these issues has the potential to fundamentally alter the \nrelationship between faculty and their institutions. Thus, for example, to the \nextent that institutions become owners of intellectual property, some faculty will \nrelinquish their claims to disciplinary expertise and probably lose the primary \nIntellectual Property Rights  7 \n \n 7 \nfoundation for advancing their claims to a role in institutional governance. To \nthe extent that faculty themselves becomes the owners of intellectual property, \nthey will take on the characteristics of entrepreneurial product developers rather \nthan service providers. This may mean the loosening of institutional ties and the \nemergence of a transinstitutional class of academic entrepreneurs.” (Finkelstein \net al. 2000, p. 317) \n \nTheir comments were addressed to a US audience. It seems that their warning has \nbeen ignored, to judge by the proliferation of OCW and OERs in the US (Atkins, \nBrown and Hammond 2007). \n \nBritish government policy re Open Educational Resources \nIn British universities, the broader term open educational resources (OERs) has been \nadopted rather than open courseware or open content, although a recent British \ngovernment report (Department of Business, Innovation and Skills 2009) on UK \nhigher education emphasised e-learning without referring to OERs. The drive to \ngenerate OERs has come through central government-funded agencies such as the \nHigher Education Funding Council for England (HEFCE), the Higher Education \nAcademy (HEA) and the Joint Information Systems Committee (JISC). The latter’s \nofficial mission is to provide leadership in the innovative use of information and \ncommunications technology to support education and research. JISC’s objectives in \ninvesting in OERs are to promote the sharing and re-use of learning resources, and to \nstrengthen the reputation of UK higher education through high quality learning \nresources becoming available worldwide. Recruitment of overseas students is \nexpected to rise as a consequence of OERs coming on stream. \nIntellectual Property Rights  8 \n \n 8 \n \nA joint JISC\/HEA one-year pilot program was designed to support institutions, \nconsortia and individuals in releasing OER for use and repurposing worldwide. It \nfocussed on development of OER policies and processes as an integral part of the \nlearning material creation workflow. The pilot helped JISC and the HEA to \nunderstand how best to support this development and was followed by a longer \nprogram to promote embedding of these policies and processes across institutions. \nOER production challenges current models of academic knowledge production, as \nwell as the institution’s role in supporting student learning.  \n \nThese programs led JISC to issue guidelines regarding licensess suitable for OERs \n(Korn et al. 2008). Korn and her colleagues critically reviewed types of license \navailable at that time, and their broad advice was to use an existing type. The \nCASPER project (http:\/\/jisc-casper.org\/) provided guidance on clearing background \nintellectual property rights, letter templates and licenses. The Web2rights project \n(http:\/\/www.web2rights.org.uk\/) created an interactive toolkit for use where Web 2.0 \nresources are involved. In parallel with its projects, JISC offers legal guidance on \nintellectual property rights (http:\/\/www.jisclegal.ac.uk\/ipr\/IntellectualProperty.htm), \nand JISC’s website (http:\/\/www.jisc.ac.uk\/whatwedo\/projects\/ipr.aspx) contains \nvaluable advice for novices as well as experts. \n \nExamples of OER use in British universities \nThis paper provides the context for, describes and examines three significant \nexamples in British higher education where ‘open educational resources’, available \nfree of charge online to anyone under Creative Commons licenses, have been and are \nIntellectual Property Rights  9 \n \n 9 \nbeing created for use by academics and learners on campus or at a distance, in the UK \nand beyond. In each case, has curriculum been influenced by creating OERs? What \nare the relationships between this policy, OERs and intellectual property rights? \n \nExample 1: OpenLearn \nThe Open University of the United Kingdom was established in 1969 to provide \ndistance learners with a route to degrees and other qualifications similar to those in \nother British universities. Unusually, it has an open admissions policy, therefore \nlearners wishing to move from informal learning to graduation are able to do so \nrelatively easily: their motivation and ability determine their progress, which the \nuniversity’s systems support. The university comes to the learner, any time, \nanywhere, rather than requiring the learner to come to it. To date the OU has served \nmore than two million students including more than 100,000 overseas. \n \nOpenLearn (http:\/\/www.open.ac.uk\/openlearn) started as an experiment. In 2006, the \nOU had a very large ‘reservoir’ of high quality multi-media digitised learning \nmaterials produced by its academic-led course teams for use by its registered \nundergraduate and postgraduate students. The materials included digitised print, audio \nand video recordings, television and radio broadcast recordings, CDs and DVDs. The \nOU had pioneered the use of computers and communications technology by its \nstudents and most of their courses required them to use the university web site and \nvirtual learning environment.  \n \nThe OU was in a particularly favorable position to make use of this huge resource. \nNotably, its staff members, including all academics, agree on appointment to the \nIntellectual Property Rights  10 \n \n 10 \nuniversity that the OU will own the rights to any learning material they produce \nduring their work for the OU. Moreover, from the start of course production in 1969 \nthe university has gone to considerable trouble to identify, observe and where \nnecessary pay for the rights of third parties whose material is used in its courses. \n \nIn October 2006 the OU entered into collaboration with The William and Flora \nHewlett Foundation to offer, via the web, free university-level content as OERs \n(OpenLearn, The Open University 2007). The Foundation’s financial support enabled \nthe university to act faster and on a larger scale, with greater impact, than would \notherwise have been possible. The OU agreed to publish selections from its materials \nin its web-based environment under the Creative Commons licenses, thus switching \nfrom a model of protecting content to one of promoting the possibilities of its re-use. \nOpenLearn offers learners, wherever they are and whether or not they are registered \nstudents ‘a hybrid of a repository, structured assets, a community, course-based tools \nand personal learning tools’ (McAndrew et al. 2009). However, as at MIT, learners \ncannot obtain tutorial support or academic credit for their work unless they register as \nstudents and pay tuition fees to the OU. \n \nSince OpenLearn’s launch in 2007, its web site has had well over 10 million visits (8 \nmillion unique visitors). Started with 900 hours of learning material, the project’s \nOERs rose to 5,400 hours by the end of the pilot and is still growing. The available \nstudy units are drawn from more than 40% of the OU’s courses. OpenLearn is an \nonline media hub, community-focused with interactive content. \n \nIntellectual Property Rights  11 \n \n 11 \nIn 2010, a new Support Centre for Open Resources in Education (SCORE) began \nsharing the OU’s OER expertise with other universities. The OU is leading \ncollaborations aimed at creating new resources and services, and at lowering course \ndevelopment costs. With Carnegie Mellon University (again funded by The William \nand Flora Hewlett Foundation), it is studying open learning networks \n(http:\/\/olnet.org\/) and is working alongside JISC’s OER program. It is also using its \nlinks with other members of the Open CourseWare Consortium, such as MIT.  \n \nIt is hard to say whether the OU’s curriculum has been directly influenced by \nOpenLearn. Indirectly, it has, because OU course teams setting out to prepare new \nmaterial are now well aware of OpenLearn and may consider whether their material \nwill ‘transform’ well into OERs. The primary audience for the courses remains the \nOU’s registered fee-paying students, however, whereas OERs are expected to reach \nthose learners seeking informal education. \n \nExample 2: The Open University and iTunes U \nCambridge, Harvard, MIT, Oxford, Princeton, Stanford, Yale and UCLA are well-\nknown universities among more than 175 organisations that now provide educational \ncontent, mostly audio-recorded lectures, for Apple’s iTunes U, launched in May 2007. \nBy early 2010 universities in Australia, Canada, France, the Netherlands and New \nZealand had joined, and there had been more than 100 million downloads. \n \nIn 2008 the OU launched its own site (http:\/\/www.open.ac.uk\/itunes). The \nuniversity’s course teams had already created a vast amount of high quality audio and \nvideo content over the years, across a wide range of academic disciplines, for the \nIntellectual Property Rights  12 \n \n 12 \nOU’s multi-media courses aimed at its 200,000 distance learners. From this content \nthousands of clips have been selected for creating iTunes U ‘albums’. This re-working \nprocess continues and new content is also being created that can serve double duty in \ncourses and on iTunes U. Students and others, worldwide, can download free of \ncharge any album, with a choice from 120 OU courses. New material is uploaded \ncontinually. \n \nIn 2009, the OU marked the 200th anniversary of Charles Darwin’s birth and 150 \nyears since the publication of his book The Origin of Species by adding to iTunes U \nthe Darwin Now set of albums. Among these is Charles Darwin – the Man in which \nRuth Padel, a direct descendant offers insights into Darwin as son, husband and \nfather. Similar iTunes U albums appeared recently about the Large Hadron Collider \nbeneath the Franco-Swiss border, the Internet at 40 and Handel’s 250th Anniversary. \n \nEarly in 2010, the OU started commissioning audio and video material solely for \niTunes U. For example, registered undergraduates in the course Understanding \nGlobal Heritage can privately download the albums each week onto their MP3 or \nMP4 players (or iPhones) via the OU’s Virtual Learning Environment, as an \nalternative to using the DVD in the course package. For them, the OU makes studying \nas flexible as possible. \n \nEach and every clip is processed very carefully to conform to the OU’s legal \nobligations. Once the content has been selected, copyright must be cleared. Although \nthe OU owns the copyright in material generated by its own staff, academic and \ntechnical, the rights of other contributors must be respected as well. In some cases, \nIntellectual Property Rights  13 \n \n 13 \nrights for the original material were cleared only for use by OU students, or without \nglobal coverage. For many albums, the OU seeks and if necessary pays for permission \nto use digitised text, audio, music, graphics and video material belonging to third \nparties. \n \nUsers of iTunes U albums from the OU are licensed to listen and\/or watch them under \na Creative Commons license, but cannot exploit them commercially. If they wish to \nderive a new work from the recording they can do so, but must distribute the new \nalbum under a similar license. \n \nFor up-to-date details of the OU’s impact via iTunes U, see \nhttp:\/\/projects.kmi.open.ac.uk\/itunesu\/impact\/. Measured in downloads, iTunes U has \nbeen phenomenally successful for the OU, with users downloading over 700,000 \nalbums each month in 2010. About 20 per cent are for learning languages. As at MIT, \nthe full course materials, tutorial support and examinations are only available to \nregistered fee-paying students. \n \nDiscussions continue at the OU about whether the huge number of downloads should \nbe free to its general worldwide public, as at present, or monetised in some way. As \nfor OpenLearn, the OU and its academics continue to benefit through the enormous \nfavorable publicity generated by the albums: most are downloaded by people new to \nthe OU. Indeed, nearly half are in North America, and nearly 90 per cent are outside \nthe United Kingdom. About one in six of them go on from iTunes U to the OU web \nsite. Many OU staff think that by offering the albums for free the OU is fulfilling part \nof its mission to educate. Many see iTunes U as a golden brand-building opportunity. \nIntellectual Property Rights  14 \n \n 14 \nBut some say the university is ‘selling the family silver’, meaning that its intellectual \ncapital is being squandered by meeting such an enormous demand without charging \nfor the products. \n \nHas the OU’s curriculum been directly influenced by iTunes U at the OU? Probably \nnot, so far. Almost all the albums to date are a spin-off from existing material, \nalthough making new specially-commissioned ones is already starting to happen. \n \nExample 3: OTTER \nUnited States readers of this journal may well see the Open University as a peculiarly \nBritish institution the like of which does not exist in their country. They are more \naccustomed to campus universities, both private and state funded, with students \nstudying at a distance. The University of Leicester is a state-funded campus university \nin the UK with about 7,000 distance learners in addition to its 16,000 campus \nstudents.  \n \nThe OTTER (Open, Transferable and Technology-enabled Educational Resources) \nproject (http:\/\/www.le.ac.uk\/otter & http:\/\/www.le.ac.uk\/oer), at the University of \nLeicester (UoL), ran from May 2009 to April 2010. Funded by JISC and the HEA, it \nwas one of several ‘institutional strand’ projects in the UK OER program, which was \naimed at making a significant amount of educational material freely available on the \nweb under open licenses. The OTTER team included a dedicated copyright \nadministrator (seconded from the Library), an OER evaluator, two learning \ntechnologists and a coordinator. Materials for OERs were gathered from 12 \ndepartments within the institution as diverse as Genetics, Politics and International \nIntellectual Property Rights  15 \n \n 15 \nRelations, and Student Support and Development Services, and one international \npartner, the South African Institute for Distance Education. All materials were \nauthored by UoL staff members or associates, and all were released under Creative \nCommons licenses in both the university’s own repository and JorumOpen \n(http:\/\/open.jorum.ac.uk), JISC’s national repository.  \n \nAs the funders required, all the OERs were created out of existing teaching material, \nrather than being developed from scratch, on the assumption that materials that were \nalready in use had been through some form of reality checking and quality \nenhancement. The OTTER process, inspired by an approach used at the Open \nUniversity (Lane 2006), included an extra stage to enhance further the quality of the \nfinal OERs. The OER evaluator assessed whether changes were needed in the \nlearning design, whether each OER could be enhanced by additional media, perhaps \nby adding a podcast to print-based materials. When appropriate, this part of the \nprocess also involved organising the materials into sections with subheadings, \ncorrecting typographical errors in the text, and removing sections that made no sense \nin the absence of the rest of the course materials. \n \nThe various ‘transformation’ activities carried out were as follows: \n• Decoupling: removing or amending aspects of the content that were only \navailable to students inside the VLE.  \n• Scaffolding: making changes, where necessary, to ensure that learning goals, \nlearning activities and learning outcomes were properly aligned.  \nIntellectual Property Rights  16 \n \n 16 \n• Meshing: adding or replacing images, audio files or tables to make the content \nmore engaging. Meshing also involved checking that embedded links were \nactive. \n• Sequencing: making changes to the relative position or order of the content for \neasy navigation. Sequencing was also designed to support user transition from \none topic to another. \n• Editing: removing or explaining inappropriate words, jargon, and acronyms. \nEditing also involved checking that all the references provided were correct. \n \nAltogether, OTTER released over 400 credits’ worth of OERs (where credits are \nconsidered to be equivalent to 7.5 notional learning hours). A large amount of \nsupporting documentation was also produced, including a workflow framework for \ncreating and evaluating OERs, Put-Up and Take-Down Guidelines, a draft OER \npolicy for the university, a list of FAQs for academics who were considering offering \ntheir teaching materials as OERs, a research report reflecting the views of academics, \nsenior management and students on OERs, and a range of dissemination materials \nfrom conference and seminar presentations. Release of OERs is continuing post-\nOTTER, on a slimmed-down scale, through the use of existing channels such as the \nLibrary. UoL’s recent signing of a contract with iTunes U has led to plans for \ndeveloping brand new high quality multimedia materials as OERs, and the release of \nresources for this work. \n \nOTTER, intellectual property and copyright \nIntellectual Property Rights  17 \n \n 17 \nOTTER used a centralised model of copyright clearance whereby the project team \nwere responsible for ensuring that any material released was cleared in terms of the \nauthors’ intellectual property and the inclusion of any third party material. This \napproach appeared the most compatible to a one year project because, as MIT (2004) \nnoted, “IP clearance is a time-consuming process and ....it is one of the biggest \nbarriers to faculty participation”. There was also an underlying ethos in OTTER to \ncreate a mature copyright and intellectual property management policy, aimed at \nensuring the sustainability of the resources and the adoption of an OER institutional \npolicy. To facilitate this, OTTER set aside for the clearance of rights £20,000 (about \n$30,000), judged to be a sufficient sum to engage large organisations and publishers \nin negotiations to allow the incorporation and release of their content under a Creative \nCommons license.  \n \nUoL retains the intellectual property to teaching material created by academic staff \nduring their employment. This helped greatly in OTTER as a formal contract dealing \nwith the assignation of rights from specific individuals was not required. OTTER did, \nhowever, create a ‘Partner Agreement’ asking contributing authors to confirm that \nthey understood and agreed with what the project would be aiming to achieve with \ntheir materials. OTTER staff felt this was important because, as Stacey (2007) points \nout “IP and copyright are emotional issues that tend to get people riled up”. In a few \ncases, however, gaining this agreement was not as straightforward as expected. One \nexternal tutor had published materials in a book, thereby assigning the rights to \nreproduce the work to a publisher, whereas another author of teaching material was \nfound to be deceased, but appeared to have used substantial parts of the text in \npublished articles.  In the first case, OTTER was unable to proceed with using these \nIntellectual Property Rights  18 \n \n 18 \nmaterials, but was more successful in the second, by negotiating a compromise with \nthe publisher of the articles. \n \nMuch of the teaching matter contained clearly defined third party copyright material, \nand this is where OTTER planned to use the money set aside in the project budget, \nbecause, as Bissell (2009, p99) notes, “copyright exceptions and limitations cannot be \nrelied upon for opening up educational materials”. OTTER staff expected that whilst \nsome rights owners would allow the inclusion of their material subject to correct \nacknowledgement, others would be more inclined to request a financial incentive \nbefore agreeing to do so. As Bissell (2009, p97) explains, “it can be challenging for \ncopyright holders to balance the desire for increased access, translation and \ncustomisation against the desire to prevent abuses and to control their work”. OTTER \nhoped to achieve this balance by offering to pay a fee. \n \nOTTER also expected that the response rate to requests for clearance of third party \nmaterials would range from the very quick (1-2 days), to the slow: the larger \npublishers tend to have an average turnaround time for ‘normal’ educational (closed \naccess use) requests of between 6-8 weeks. Indeed, this is what happened, but about \nhalfway through the project staff noted a distinct polarisation in responses, those that \nwere quick tended to be positive, whereas those who were slow exhibited a distinct \nlack of understanding of the nature of the request and the purpose of the project, and \nultimately said no. It became clear that large publishers and organisations would \nsimply not consider allowing the re-use and potential re-purposing of even limited \namounts of their materials, for any fee.   \n \nIntellectual Property Rights  19 \n \n 19 \nThe outcome of the rights clearance process was that whilst some organisations were \nextremely aware of and happy to have their materials released under a Creative \nCommons license, this was in no way universal. As Bissell et al. (2008) stated in their \nCC Learn report to The William and Flora Hewlett Foundation ‘copyright-related \nbarriers to open education are a serious problem’. Indeed, during much of the \ndialogue with large organisations, they were keen to tie OTTER into license \nagreements which were not compatible with the open Creative Commons license the \nproject was using as they were non-transferable and limited licenses, which meant \nthat whilst OTTER could re-use the material, no-one else could without their \npermission.  \n \nOTTER’s findings are contrary to those from OpenLearn, whose staff (OpenLearn, \nThe Open University 2007) have stated that “thanks to the support of rights holders \nand the efforts of our clearance team, we have successfully cleared over 99% of all \nthird party content offered and kept within our budget”. This may be due in large part \nto the high profile the Open University has in the UK, and most UK HE institutions \nprobably would not have the same degree of success.  \n \nOTTER’s experience led to a recommendation to similar projects to allocate little or \nno money to pay publishers for re-use of their materials, as they are likely to either \ngrant permission for free, or simply say no, but, as Tsiavos (2009) points out, \n“securing permissions from IPR owners, in particular, has costs that are difficult to \nestimate in advance, as it is not always clear who the rights-owners are and how long \nthe negotiation process will last”.  \n \nIntellectual Property Rights  20 \n \n 20 \nSupply- or demand-driven? \nAre these and other OER projects supply- or demand-driven? Universities that create \nOERs despite lack of evidence in advance that learners will use and benefit from them \nare supply-driven. Those that create them to meet known demand are demand-driven. \nClassifying universities in this way is not quite so simple, however, because they can \nalso be divided into those creating OERs for altruistic reasons, perhaps in aid of \ninformal adult education, and those creating them for non-altruistic reasons such as \nfor indirect financial profit through recruiting more fee-paying students.  \nFig. 1 shows the two dimensions or axes. Positioning any single project in this figure \nproves quite difficult, however: for example, the teaching units available from \nuniversities in the ParisTech OCW Project may be meeting known demand or not, but \nthe web site states clearly that the project has altruistic goals while at the same time \noffering assistance to students studying for degrees. If there is a non-altruistic motive, \nperhaps it lies in hoping to attract more fee-paying students through enhancing the \nuniversities’ status. Were MIT’s motives similar? And Rice University’s? \nOpenLearn is similar to OTTER but demand for (downloading of) its OERs has been \nconsiderable, so is it more demand-driven? TESSA, the altruistic OER program for \nteacher education in Africa (see below), leans towards being demand-driven as the \ngovernments of the countries involved have all asked for the OERs to be available to \ntheir students, including serving teachers, for upgrading their education. \n \n[Take in Fig. 1 about here.] \nFig. 1 Two dimensions or axes of OERs, showing where TESSA and OTTER might \nbe placed \nIntellectual Property Rights  21 \n \n 21 \nOERs’ influence on curriculum \nIs curriculum influenced by the creation of OERs and how is it related to academics’ \nintellectual property rights (IPR)? Fig. 2 shows important aspects of their \nrelationships. Academics, in protecting their IPR, may restrict the curriculum; they \nmay also limit those OERs that may become part of the curriculum in their university \nand beyond. Individual authors may have the power to include their books and articles \nin the curriculum, or to exclude them. \n \n[Take in Fig. 2 about here.] \n \nFig. 2 Relationships between curriculum, OERs and IPR \n \nYet creating OERs is a process that can weaken or challenge the authors by asking \nthem to sign a Creative Commons license that allows learners and other universities to \nuse the OER materials for nothing. It is also true that creating OERs can potentially \ninform and enhance the curriculum in other universities, perhaps even in the \noriginating one through reflection on the transformed materials. Certainly that is an \nintention behind the general OER movement, but there is little evidence yet that it is \nhappening. OER creation can challenge IPR, too, as debates rage about ownership. \n \nThe JISC model for OER release is undoubtedly supply-driven but towards the non-\naltruistic end: the government’s rationale includes the international marketing of UK \nhigher education. In British universities that offer ‘taster’ materials, not whole \ncourses, the focus is on showcasing the institution. How good the OERs look has \nIntellectual Property Rights  22 \n \n 22 \nbecome important, perhaps without as much attention being paid to how they support \nlearning. The sharing of knowledge and resources can seem limited and superficial. \n \nThe impact of OERs on learning in the UK  – and beyond \nAttempts to measure the impact of OERs have run into obstacles. Of course, the best \ncriterion of their value would be the added learning of those who use them, but \nrelevant achievement data from most learners who have used OERs have not been \navailable or even collected to date. Because OERs are ‘open’, the users do not have to \nregister, pay or report their re-use or adaptation of the materials. They are hard to \ntrack down. Soon, however, OERs will be used by students in universities other than \nthose in which they were created, and their impact may be measured. \n \nIn an age of globalisation, cross-border data flows are a commonplace, yet criticisms \nof educational exports such as OERs still focus on cultural imperialism and \n‘information imperialism’ (Commonwealth of Learning 2009). It is true that OERs are \nusually developed from material originally intended for a very specific audience, a \nbody of students belonging to the originating institution. Thus US universities make \nlittle or no allowance in their OERs for potential users in, say, Latin America or \nAfrican countries. Asian universities make none for potential users in Australian \nuniversities, and so on. Yet globalisation continues and OERs are being offered \nglobally. Surprisingly, OER users in programs like OpenLearn and TESSA complain \nabout limited access to the internet rather than Eurocentrism in the materials.  \n \nIn OpenLearn, there is a deliberate attempt to adapt the original materials to make \nIntellectual Property Rights  23 \n \n 23 \nthem more suitable for web-based learning. This re-designing for open content is in \nline with the OU’s intention to promote re-use of its materials both in the UK and \nabroad. As OERs, they contain fewer words than the originals, more graphics and \ngreater interactivity, and are more grounded in a resource-based pedagogy. \n \nIf there is adaptation of OERs to suit learners in other cultures, it is often through \ntranslation into other languages: for example, the TESSA (Teacher Education in Sub-\nSaharan Africa) consortium, including nine African countries, is creating multilingual \nOERs to be used by half a million teachers, of whom 300,000 were expected to be \ninvolved during 2010. The OER authors are mainly Anglophone and Francophone \nacademics in Africa, and the materials have been published under Creative Commons \nlicenses, with due attention paid to third party rights. To quote the web site, \nwww.tessafrica.net: \n \n“TESSA has produced a large bank of materials directly aimed at enhancing and \nimproving access to, and the quality of, local school based education and \ntraining for teachers. These materials (including audio and other media) are \nmodular in format. They focus on classroom practice in the key areas of \nliteracy, numeracy, science, social studies and the arts and life skills. All the \nmaterials are available through this web site in a variety of different formats and \nlanguages.”  \n \nOERAfrica (http:\/\/www.oerafrica.org\/), another project funded by The William and \nFlora Hewlett Foundation and based at the South African Institute for Distance \nEducation, is trying to find or produce OERs to meet specific needs or demands in \nIntellectual Property Rights  24 \n \n 24 \nAfrican countries. Is it demand-driven? \n \nSo far, little research has been undertaken into take-up of OERs by developing \ncountries, but Hatakka’s (2009) small-scale study throws a little light on factors that \nmay inhibit their re-use. He used interviews, questionnaires and observations in three \nuniversities in Bangladesh and one in Sri Lanka to record the views of academics and \ncontent developers, as well as those of users of UNESCO’s Open Training Platform \n(http:\/\/opentraining.unesco-ci.org), a repository created for developing countries. He \nidentified in the literature six main inhibiting factors: language, relevance, access to \nsuitable resources, technical and infrastructure problems, quality of content and IPR. \nHis respondents told him that rules and restrictions in their education systems, often at \na national level, were even more important than these six. For example, some said \ntheirs was a textbook-dependent culture. They did say, however, that language was an \ninhibiting factor. Under relevance, they listed the OERs’ level of difficulty, fit to the \ncourse being taught, granularity and match to their students’ context. Under access, \nthey said they had difficulty in finding suitable OERs but also complained about \nbeing given too much choice! They raised technical issues ranging from access to a \ncomputer and the internet to connectivity problems and unreliable infrastructure. They \nfound it hard to assess the quality of OERs, they expressed some concern about IPR \nand saw OERs as possibly inhibiting their own development as teachers.  \n \nUniversity teachers’ reluctance to use OERs because they were ‘not invented here’ is \nnot confined to developing countries. In industrialised countries it seems likely that \nthe same six factors identified by Hatakka (2009) inhibit re-use and adaptation of \nOERs, though perhaps not to the same degree as in developing countries. Statistics \nIntellectual Property Rights  25 \n \n 25 \nfrom OpenLearn and the OU’s iTunes U indicate that most downloads are by \nindividuals and institutions in North America, Europe and English-speaking countries \nelsewhere, though very substantial numbers are in Asia too. \n \nConclusion \nThe enormous take-up of the OU’s iTunes U materials as well as its OpenLearn OERs \nbrings home to British academics that change is actually happening. ‘Academic \nentrepreneurs’ of a kind have been created, without doubt, whether for teaching \nstudents on campus or those at a distance, but Finkelstein et al. (2000) were mistaken \nin expecting that individuals would become sole owners of the intellectual property in \nOERs. While they and their institutions retain some rights, it is the institutions that are \ngiving away online much of the academics’ work. So far, there are no signs that these \nchanges are changing British universities’ curricula, however, and any fears that \nOERs may lead to a national online curriculum are unfounded. \n \nAcknowledgement \nThe authors thank Emma Davies for assistance in preparing the figures. \n \nReferences \nAtkins, D.E., Brown, J. Seely, Hammond, A.L. (2007). A Review of the Open \nEducational Resources (OER) Movement: Achievements, Challenges, and New \nOpportunities. Report to The William and Flora Hewlett Foundation. \nhttp:\/\/learn.creativecommons.org\/wp-\ncontent\/uploads\/2008\/03\/areviewoftheopeneducationalresourcesoermovement_bloglin\nk.pdf. Accessed 26 May 2010. \nIntellectual Property Rights  26 \n \n 26 \n \nBissell, A., Park, J., Brooks, A. (2008) What status for “open”? An examination of the \nlicensing policies of open educational organizations and projects, Report from CC \nLearn to The William and Flora Hewlett Foundation. \nhttp:\/\/creativecommons.org\/weblog\/entry\/11700. Accessed 28 May 2010. \n \nBissell, A.N. (2009) ‘Permission granted: open licensing for educational resources’ \nOpen Learning: The Journal of Open and Distance Learning, 24(1), 97-106.  \n \nCommonwealth of Learning (2009) OERs: the promise and the pitfalls. Connections: \nLearning for Development, 14(3), 8-9. \n \nDepartment of Business, Innovation and Skills (2009) Higher Ambitions: The future \nof universities in a knowledge economy. \nhttp:\/\/www.bis.gov.uk\/assets\/biscore\/corporate\/docs\/h\/09-1447-higher-ambitions.pdf. \nAccessed 22 May 2010. \n \nFinkelstein, M.J., Frances C., Jewett, F.I., & Scholz, B.W. (2000). Dollars, Distance, \nand Online Education: The new economics of college teaching and learning. Phoenix, \nAZ: Oryx Press. \n \nHatakka, M. (2009) ‘Build it and they will come? Inhibiting factors for re-use of open \ncontent in developing countries’, Electronic Journal on Information Systems in \nDeveloping Countries (http:\/\/www.ejisdc.org), 37(5), 1-16. \n \nIntellectual Property Rights  27 \n \n 27 \nKorn, N., Oppenheim, C., Duncan, C. (2008). Open content licences: JISC guidance \nNovember 2008. \nhttp:\/\/www.jisc.ac.uk\/media\/documents\/funding\/project_management\/open_content_l\nicences_jiscguidancenov2008.doc. Accessed 24 May 2010. \n \nLane, A. (2006). From Pillar to Post: exploring the issues involved in repurposing \ndistance learning materials for use as Open Educational Resources. \nhttp:\/\/kn.open.ac.uk\/public\/document.cfm?docid=9724. Accessed 22 October 2009. \n \nMcAndrew, P., dos Santos, A.I., Lane, A., Godwin, S., Okada, A., Wilson, T., \nConnolly, T., Ferreira, G., Buckingham Shum, S., Bretts, J., Webb, R. (2009). \nOpenLearn: Research report 2006-2008. The Open University, Milton Keynes. \n \nMIT (2004). OpenCourseWare Story. \nhttp:\/\/www.bb.ustc.edu.cn\/ocw\/NR\/rdonlyres\/1118F4F3-AA41-4CB4-B71F-\nF6E058AD22AA\/0\/MIT_OCW_Approach_10_5_04.pdf. Accessed 28 May 2010 \n \nOECD (2007) Giving Knowledge for Free: The emergence of open educational \nresources. Education and Skills, 2007 (3), 1-153.  \nhttp:\/\/puck.sourceoecd.org\/vl=5684928\/cl=18\/nw=1\/rpsv\/~6670\/v2007n3\/s1\/p1l. \nAccessed 28 May 2010. \n \nOpenLearn, The Open University (2007). http:\/\/oerwiki.iiep-\nunesco.org\/index.php?title=OER_stories:OpenLearn%2C_The_Open_University. \nAccessed 28 May 2010. \nIntellectual Property Rights  28 \n \n 28 \n \nStacey, P. (2007). BC Campus. http:\/\/oerwiki.iiep-\nunesco.org\/index.php?title=OER_stories:_BCcampus. Accessed 28 May 2010. \n \nTsiavos, P. (2009). Case studies mapping the flows of content, value and rights across \nthe public sector. \nhttp:\/\/www.jisc.ac.uk\/media\/documents\/publications\/scaiprcasestudiesv2.pdf.  \nAccessed 24 Mar 2010. \n \n \n"}