{"doi":"10.1002\/hyp.7951","coreId":"53215","oai":"oai:nora.nerc.ac.uk:13501","identifiers":["oai:nora.nerc.ac.uk:13501","10.1002\/hyp.7951"],"title":"Simulation of the spatio-temporal extent of groundwater flooding using statistical methods of hydrograph classification and lumped parameter models","authors":["Upton, K.A.","Jackson, C.R."],"enrichments":{"references":[{"id":818835,"title":"A digital terrain model for hydrology.","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":814142,"title":"A lumped parameter model of a chalk aquifer-stream system in Hampshire,","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":807716,"title":"A manifesto for the equifinality thesis.","authors":[],"date":"2003","doi":"10.1016\/j.jhydrol.2005.07.007","raw":null,"cites":null},{"id":813665,"title":"A model for flow in the chalk unsaturated zone incorporating progressive weathering.","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":822348,"title":"A Shuffled Complex Evolution Metropolis algorithm for optimization and uncertainty assessment of hydrologic model parameters.","authors":[],"date":"2003","doi":"10.1029\/2002WR001642","raw":null,"cites":null},{"id":810976,"title":"An assessment of the additional flood losses associated with groundwater flooding: a report to Hampshire County Council and","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":815520,"title":"Analysis of water level response to rainfall and implications for recharge pathways in the Chalk aquifer, SE England.","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":814566,"title":"Application of the coupled model to the Somme river basin.","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":823219,"title":"Characterising the vertical variations in hydraulic conductivity within the Chalk aquifer.","authors":[],"date":"2006","doi":"10.1016\/j.jhydrol.2006.04.036","raw":null,"cites":null},{"id":812295,"title":"Climate Change Scenarios for Pacific Northwest Water Planning Studies: Motivation, Methodologies and a User’s Guide to Applications.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":808196,"title":"Controls on the discharge of Chalk streams of the Berkshire Downs,","authors":[],"date":"2002","doi":"10.1016\/S0048-9697(01)00954-8","raw":null,"cites":null},{"id":810556,"title":"Dynamics of river-aquifer interactions along a chalk stream: the River Lambourn, UK. Hydrological Processes","authors":[],"date":"2005","doi":"10.1002\/hyp.5665","raw":null,"cites":null},{"id":816020,"title":"Dynamics of water movement on Chalkland.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":821866,"title":"Effective and efficient algorithm for multiobjective optimization of hydrologic models.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":809601,"title":"Effective and efficient global optimization for conceptual rainfall-runoff models.","authors":[],"date":"1992","doi":"10.1029\/91WR02985","raw":null,"cites":null},{"id":812718,"title":"Evaluation of bias-correction methods for ensemble streamflow volume forecasts.","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":820568,"title":"Groundwater flooding in the Thames region, winter 2000\/01, Environment Agency.","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":819647,"title":"Groundwater-induced flooding in macroporedominated hydrological system in the context of climate changes.","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":813199,"title":"Hydrological processes in the Chalk unsaturated zone - Insights from an intensive field monitoring programme.","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":820995,"title":"Improved treatment of uncertainty in hydrologic modeling: Combining the strengths of global optimization and data assimilation.","authors":[],"date":"2005","doi":"10.1029\/2004WR003059","raw":null,"cites":null},{"id":816896,"title":"Karst flash flooding in a Mediterranean karst, the example of Fontaine de Nimes. Engineering Geology 99(3-4):","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":820103,"title":"Mechanisms of water storage and flow in the unsaturated zone of the Chalk aquifer.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":814980,"title":"Monte Carlo assessment of parameter uncertainty in conceptual catchment models: the Metropolis algorithm.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":819230,"title":"Natural evaporation from open water, bare soil and grass.","authors":[],"date":"1948","doi":null,"raw":null,"cites":null},{"id":807268,"title":"Rainfall-Runoff Modelling: The Primer.","authors":[],"date":"2001","doi":"10.1002\/ldr.630","raw":null,"cites":null},{"id":822807,"title":"Recharge of the upper chalk aquifer at a site in hampshire, england .1. Water-balance and unsaturated flow.","authors":[],"date":"1984","doi":"10.1016\/0022-1694(84)90166-5","raw":null,"cites":null},{"id":808712,"title":"Recharge Response Functions.","authors":[],"date":"1997","doi":"10.5194\/hess-1-47-1997","raw":null,"cites":null},{"id":811812,"title":"Spatial analyses of groundwater levels using universal kriging.","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":818367,"title":"Statistical analysis of hydrographs and water-table fluctuation to estimate groundwater recharge.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":809205,"title":"Statistics and Data Analysis in Geology.","authors":[],"date":"1986","doi":null,"raw":null,"cites":null},{"id":811397,"title":"The estimation of soil moisture deficits.","authors":[],"date":"1967","doi":null,"raw":null,"cites":null},{"id":806733,"title":"The physical properties of major aquifers in England and Wales. British Geological Survey","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":817881,"title":"The significance of flow in the matrix of the Chalk unsaturated zone.","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":810103,"title":"The spatial distribution of groundwater flooding in a chalk catchment in southern England.","authors":[],"date":"2004","doi":"10.1002\/hyp.1340","raw":null,"cites":null},{"id":817376,"title":"The UK floods of 2000-2001: A hydrometeorological appraisal. Meeting of the Central Southern Branch of the Chartered-Institute-of-Water-andEnvironmental-Management,","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":823638,"title":"The use of principal component analysis for interpreting ground water hydrographs.","authors":[],"date":"2000","doi":"10.1111\/j.1745-6584.2000.tb00335.x","raw":null,"cites":null},{"id":816474,"title":"User’s manual for the distributed recharge model ZOODRM. British Geological Survey Internal Report.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011","abstract":"This article presents the development of a relatively low cost and rapidly applicable methodology to simulate the spatio-temporal occurrence of groundwater flooding in chalk catchments. In winter 2000\/2001 extreme rainfall resulted in anomalously high groundwater levels and groundwater flooding in many chalk catchments of northern Europe and the southern United Kingdom. Groundwater flooding was extensive and prolonged, occurring in areas where it had not been recently observed and, in places, lasting for 6 months. In many of these catchments, the prediction of groundwater flooding is hindered by the lack of an appropriate tool, such as a distributed groundwater model, or the inability of models to simulate extremes adequately. A set of groundwater hydrographs is simulated using a simple lumped parameter groundwater model. The number of models required is minimized through the classification and grouping of groundwater level time-series using principal component analysis and cluster analysis. One representative hydrograph is modelled then transposed to other observed hydrographs in the same group by the process of quantile mapping. Time-variant groundwater level surfaces, generated using the discrete set of modelled hydrographs and river elevation data, are overlain on a digital terrain model to predict the spatial extent of groundwater flooding. The methodology is applied to the Pang and Lambourn catchments in southern England for which monthly groundwater level time-series exist for 52 observation boreholes covering the period 1975–2004. The results are validated against observed groundwater flood extent data obtained from aerial surveys and field mapping. The method is shown to simulate the spatial and temporal occurrence of flooding during the 2000\/2001 flood event accurately","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/53215.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/13501\/1\/Upton_Jackson.pdf","pdfHashValue":"cb086c53186f2dc8c192aa43ae3caf05cf95ebb1","publisher":"Wiley","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:13501<\/identifier><datestamp>\n      2013-01-07T13:59:09Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533137<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/13501\/<\/dc:relation><dc:title>\n        Simulation of the spatio-temporal extent of groundwater flooding using statistical methods of hydrograph classification and lumped parameter models<\/dc:title><dc:creator>\n        Upton, K.A.<\/dc:creator><dc:creator>\n        Jackson, C.R.<\/dc:creator><dc:subject>\n        Hydrology<\/dc:subject><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        This article presents the development of a relatively low cost and rapidly applicable methodology to simulate the spatio-temporal occurrence of groundwater flooding in chalk catchments. In winter 2000\/2001 extreme rainfall resulted in anomalously high groundwater levels and groundwater flooding in many chalk catchments of northern Europe and the southern United Kingdom. Groundwater flooding was extensive and prolonged, occurring in areas where it had not been recently observed and, in places, lasting for 6 months. In many of these catchments, the prediction of groundwater flooding is hindered by the lack of an appropriate tool, such as a distributed groundwater model, or the inability of models to simulate extremes adequately. A set of groundwater hydrographs is simulated using a simple lumped parameter groundwater model. The number of models required is minimized through the classification and grouping of groundwater level time-series using principal component analysis and cluster analysis. One representative hydrograph is modelled then transposed to other observed hydrographs in the same group by the process of quantile mapping. Time-variant groundwater level surfaces, generated using the discrete set of modelled hydrographs and river elevation data, are overlain on a digital terrain model to predict the spatial extent of groundwater flooding. The methodology is applied to the Pang and Lambourn catchments in southern England for which monthly groundwater level time-series exist for 52 observation boreholes covering the period 1975–2004. The results are validated against observed groundwater flood extent data obtained from aerial surveys and field mapping. The method is shown to simulate the spatial and temporal occurrence of flooding during the 2000\/2001 flood event accurately.<\/dc:description><dc:publisher>\n        Wiley<\/dc:publisher><dc:date>\n        2011<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/13501\/1\/Upton_Jackson_2011%20-%20NORA%20Version.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Upton, K.A.; Jackson, C.R..  2011  Simulation of the spatio-temporal extent of groundwater flooding using statistical methods of hydrograph classification and lumped parameter models.   Hydrological Processes, 25 (12). 1949-1963.  https:\/\/doi.org\/10.1002\/hyp.7951 <https:\/\/doi.org\/10.1002\/hyp.7951>     \n <\/dc:identifier><dc:relation>\n        http:\/\/onlinelibrary.wiley.com\/journal\/10.1002\/(ISSN)1099-1085<\/dc:relation><dc:relation>\n        10.1002\/hyp.7951<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/13501\/","http:\/\/onlinelibrary.wiley.com\/journal\/10.1002\/(ISSN)1099-1085","10.1002\/hyp.7951"],"year":2011,"topics":["Hydrology","Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Full title: Simulation of the spatio-temporal extent of groundwater flooding using \nstatistical methods of hydrograph classification and lumped parameter models \n \nShort title: Simulation of groundwater flooding using lumped parameter models \n \nUpton, K.A. and Jackson, C.R. \nBritish Geological Survey, Kingsley Dunham Centre, Keyworth, Nottingham, NG12 5GG, UK \nCorresponding author: C.R. Jackson \nEmail: crja@bgs.ac.uk \nTelephone: 44 115 936 3196 \nFax: 44 115 936 3200 \n \nAbstract \nThis paper presents the development of a relatively low cost and rapidly applicable \nmethodology to simulate the spatio-temporal occurrence of groundwater flooding in chalk \ncatchments. In winter 2000\/01 extreme rainfall resulted in anomalously high groundwater \nlevels and groundwater flooding in many chalk catchments of northern Europe and the \nsouthern United Kingdom. Groundwater flooding was extensive and prolonged, occurring in \nareas where it had not been recently observed and, in places, lasting for six months. In many \nof these catchments the prediction of groundwater flooding is hindered by the lack of an \nappropriate tool, such as a distributed groundwater model, or the inability of models to \nsimulate extremes adequately. A set of groundwater hydrographs is simulated using a simple \nlumped parameter groundwater model. The number of models required is minimised through \nthe classification and grouping of groundwater level time-series using principal component \nanalysis and cluster analysis. One representative hydrograph is modelled then transposed to \nother observed hydrographs in the same group by the process of quantile mapping. Time-\nvariant groundwater level surfaces, generated using the discrete set of modelled hydrographs \nand river elevation data, are overlain on a digital terrain model to predict the spatial extent of \ngroundwater flooding. The methodology is applied to the Pang and Lambourn catchments in \nsouthern England for which monthly groundwater level time-series exist for 52 observation \nboreholes covering the period 1975 to 2004. The results are validated against observed \ngroundwater flood extent data obtained from aerial surveys and field mapping. The method is \nshown to simulate the spatial and temporal occurrence of flooding during the 2000\/01 flood \nevent accurately.  \n \nKeywords \nGroundwater flooding, Chalk, Hydrograph classification, Lumped parameter model \n2 \n \n(1) Introduction \nGroundwater flooding was widespread across much of northern Europe (Korkmaz et al., \n2009; Pinault et al., 2005) and the southern United Kingdom (Adams et al., 2008; Finch et al., \n2004; Robinson et al., 2001) during and after the exceptionally wet winter of 2000\/01. This \nparticular flood event resulted from a combination of high antecedent groundwater levels due \nto higher than average rainfall during the three subsequent winters from 1997-1999 and \nextreme meteorological conditions, whereby monitored rainfall between September and \nDecember 2000 was more than 180% of the long term average value across much of \nSouthern England (Marsh & Dale, 2006). Flooding was prolonged, in some catchments \nlasting for up to six months, and resulted in financial losses in excess of £1 million in the UK \nalone (Green at al., 2006). It is possible that the risk of groundwater flooding will be \nexacerbated by anthropogenic climate change which, according to current climate models, is \nvery likely to cause an increase in the frequency of heavy precipitation events over most \nareas of the globe during the 21st century (Bates et al., 2008). Chalk catchments are \nparticularly affected by groundwater flooding due to their characteristic dual permeability \nand low storativity which allows significant and rapid increases in the level of the water table \nfollowing prolonged and\/or extreme rainfall. The development of a modelling tool for \ngroundwater flood prediction is therefore required in order to: predict the likely impacts of \nclimate change; quantify the risk in areas most vulnerable to groundwater flooding; and \nfacilitate more accurate flood forecasting.  \n \nFlood frequency analysis has previously been used to estimate the T-year hydraulic head, \nwhich characterises the groundwater surge for a given return period, T, in a Mediterranean \ncarbonate aquifer, allowing the magnitude of triggering rainfall events to be determined \n(Najib et al., 2008). However, groundwater flooding is generally strongly dependent on \nantecedent conditions and continuous simulation is therefore necessary to predict the \ntemporal occurrence of flooding accurately. Furthermore, due to the complex processes \ninvolved in the generation of groundwater floods on the Chalk, an accurate flood prediction \ntool would also require determination of the spatial extent of flooding. A modelling \napproach, whereby system processes are represented by transfer functions that define \nrelationships between the input and output data, has previously been undertaken to simulate \ngroundwater flooding in a karstic aquifer in southern France (Marechal et al., 2008). This \napproach was unable to produce an accurate simulation of the water table surface to simulate \n3 \n \nthe amount of overflow but was able to simulate the occurrence of overflow during high \nrainfall events allowing determination of a rainfall threshold for flooding. Regional \nnumerical groundwater models are able to predict the spatial and temporal distribution of \nstorage in an aquifer and have potential application in flood risk assessment. Korkmaz et al. \n(2009) applied a coupled surface–unsaturated–groundwater model (MODCOU) to simulate \nthe 2000\/01 floods in the Somme River Basin obtaining a satisfactory representation of \ngroundwater behaviour, its effect on surface flow and the magnitude and spatial extent of \ngroundwater emergence at the surface during the flood of 2000\/01. However, distributed \ngroundwater models are expensive to develop and often difficult to calibrate to groundwater \nlevels in chalk aquifers because of their spatial heterogeneity. At present, no cost effective \nand rapidly applicable tool exists for the accurate simulation of the spatial and temporal \nextent of groundwater flooding in chalk catchments.  \n \nThis paper presents a relatively simple and widely applicable tool for the simulation of the \nspatio-temporal occurrence of groundwater flooding in chalk aquifers. The methodology \ninvolves the generation of time-variant groundwater level surfaces from a series of point \nmodels and river elevation data which can be overlain on a digital terrain model, highlighting \nareas of groundwater emergence. The number of models required is minimised through the \nclassification and grouping of groundwater level time-series using principal component \nanalysis (PCA) and cluster analysis. PCA is a form of factor analysis that is commonly used \nto reveal variations and patterns in datasets allowing variables with the highest correlation to \nbe grouped together. In the field of hydrological science, PCA has previously been used to: \n(1) define patterns in groundwater hydrographs in order to understand the areal distribution \nof different recharge characteristics and to determine if fewer wells can be measured for \nlong-term groundwater monitoring without significant loss of information (Winter et al., \n2000); (2) classify diurnal stream hydrographs to characterize seasonal and downstream \nchanges in diurnal outflow in glacier basins (Hannah et al., 2000); and (3) identify the spatial \ndistribution of homogenous recharge zones from groundwater hydrographs displaying similar \nfluctuation patterns (Moon et al., 2004). In this study, PCA is used to combine groundwater \nhydrographs into a small number of groups displaying similar fluctuation patterns, for which \none representative hydrograph can be modelled. Each of the representative master \nhydrographs is simulated using a simple lumped parameter model. Modelled hydrographs are \nthen transposed to other locations using quantile mapping, allowing spatial interpolation of \n4 \n \ngroundwater levels at any given point in time. The methodology is presented with reference \nto the Pang and Lambourn catchments in southern England, which experienced widespread \nflooding during the winters of 2000\/01 (Finch et al., 2004) and 2002\/03. Monthly \ngroundwater level time-series are available for 52 observation boreholes across the \ncatchments for which four representative models are developed. The models are calibrated \nover the period 1989-2002, incorporating the extreme flood event of 2000\/01, and are \nvalidated over the period 1975-1989 and against the winter 2002\/03 groundwater flood event.  \n \n(2) Study Area \nThe Pang and Lambourn catchments are situated in the Berkshire Downs on the north \nwestern margin of the London Basin, UK (Figure 1). These catchments are typical of many \nchalk catchments in the UK and northern Europe and have been the subject of numerous \nhydrogeological studies. As a result, the extent of flooding during the winter of 2000\/01 is \nwell documented providing observational data against which this methodology can be \nevaluated. The catchments are predominantly rural, covering an area of approximately \n400 km2. Average annual rainfall is 730 mm (1975-2005) on the interfluves of the Lambourn \ncatchment, decreasing to an average of 678 mm in the lower Pang catchment. The Pang and \nLambourn rivers are tributaries of the Thames and Kennet, respectively. Groundwater– \nsurface water interactions have been studied extensively in both catchments (Griffiths et al., \n2006; Grapes et al., 2005). River–aquifer interactions are highly complex and dependent on \ngroundwater level, the thickness, extent and composition of superficial deposits, the presence \nof springs and dry valleys, and the development of water management structures such as \nweirs. Flow accretion is continuous along the River Lambourn with base flow indices \nranging from 0.84 in the lower reaches to 0.97 in the upper reaches (Griffiths et al., 2006). \nAccretion is more variable along the length of the River Pang. There is a marked difference \nin the perennial and ephemeral heads of the two rivers, highlighting the importance of \nseasonal groundwater discharge to the rivers (Bradford, 2002). Springs also form important \ndischarge points for the Chalk and are concentrated along the base of the Chalk escarpment \nin the north, along the valleys of the main rivers and their tributaries, and along the \nPalaeogene–Chalk contact in the south-east of the area. \n \nThe geology of the area is dominated by Cretaceous Chalk which dips gently towards the \nsouth-east forming a scarp slope along the northern margin of the catchments. The Chalk is \n5 \n \nunderlain by the Albian age Upper Greensand sandstone and is overlain by Palaeogene clay, \nsand and gravel deposits of the Thames and Lambeth Groups, which are locally confining in \nthe south (Figure 1). Flow within the saturated zone of the Chalk occurs predominantly in the \nupper 50 m of the profile through primary and secondary fractures (Allen et al., 1997). \nLateral and vertical variations in transmissivity and storativity exist due to variation in the \nfracture density, which is controlled by depth and location within the catchment (Allen et al., \n1997; Williams et al., 2006). Hydraulic conductivity is generally highest in the zone of water \ntable fluctuation and in the major valleys and dry valleys where fractures have been \ndeveloped by dissolution, and is lowest at depth and on the interfluves (Allen et al., 1997). \nThe Chalk stratigraphy also exerts a control on aquifer properties. For example the basal Zig \nZag and West Melbury Chalk members are relatively clayey and have a lower hydraulic \nconductivity. Data from 117 pumping tests carried out at 74 boreholes in the Kennet Valley \ngive transmissivity values ranging from 0.5 to 8000 m2d-1. The data has a geometric mean \nequal to 620 m2d-1 and a median value of 830 m2d-1; 25% of the data are less than 380 m2d-1 \nand 75% are less than 1500 m2d-1 (Allen et al., 1997). Regional groundwater flow is \ncontrolled by the base levels set by the River Thames and River Kennet and is predominantly \nto the south-east. The Pang and Lambourn rivers and numerous springs act as local, \nseasonally variable controls on groundwater flow. \n \nThe primary mechanism for flow in the unsaturated zone of the Chalk has been the subject of \nmany studies since the 1980s (for example see Wellings, 1984; Price et al., 2000; Mahmood-\nul-Hassan and Gregory, 2002; Mathias et al., 2005; Ireson et al., 2006; Ireson et al., 2009). It \nis generally accepted that fluxes within the unsaturated zone are transmitted through the \nmatrix until they exceed the saturated hydraulic conductivity of the matrix, at which point \nfracture flow becomes dominant (Ireson et al., 2006). Previous studies have shown, however, \nthat the generation of fracture flow is rare and for the majority of the time fluxes are \ntransmitted by the matrix (Mathias et al., 2005). Depending on the water content of the \nunsaturated zone, transfer of recharge through the matrix may occur by flow through the pore \nspace or by the piston displacement mechanism (Lee et al., 2006). Transfer by piston \ndisplacement allows for a rapid response of the water table without the generation of fracture \nflow and the response time will decrease further if fracture flow is initiated. This, along with \nthe low storage capacity of the unsaturated zone, can result in significant and rapid increases \nin the level of the water table following prolonged and extreme rainfall. Groundwater \n6 \n \nflooding in response to extreme rainfall can occur by two mechanisms (Finch et al., 2004): \n(1) emergence onto a floodplain from saturated alluvial deposits; (2) emergence at the \nsurface in the upper reaches of streams or rivers from permeable strata. Unconfined chalk \naquifers are particularly susceptible to groundwater flooding by the second mechanism \nwhereby the water table reaches the land surface in topographically higher regions of a \ncatchment resulting in ephemeral stream flow or the activation of springs. \n \nDuring the floods of 2000\/01, peak monthly rainfall occurred in October 2000 in the Pang \nand Lambourn catchments. Groundwater levels initially peaked between December 2000 and \nJanuary 2001 but remained high through to March 2001, and river flows peaked between \nDecember 2000 and February 2001 but remained higher than average throughout much of \n2001 due to increased baseflow. Groundwater flooding occurred due to rising water tables \nwithin the upper, normally dry valleys. The areas worst affected in the Lambourn catchment \ninclude Upper Lambourn village and the dry valley at Great Shefford, and in the Pang \ncatchment include West and East Ilsley and Hampstead Norreys (Figure 1). There was \nextensive flooding of land, roads and properties, some of which were continuously pumped \nout until May 2001 (Robinson et al., 2001).  \n \n(3) Hydrograph Classification  \n 3.1 Statistical Methods \nGroundwater level time-series represent an integration of recharge, storage and flow \nprocesses within a catchment. Differences between chalk hydrographs can be quantified in an \nobjective, efficient and repeatable way using statistical methods of hydrograph classification. \nHydrograph classification and grouping has been undertaken according to the method \noutlined by Hannah et al. (2000) using a combination of principal component analysis (PCA) \nand cluster analysis (CA). A brief explanation of PCA and CA are given here; a detailed \nexplanation can be found in Davis (1986). PCA is a form of factor analysis that decomposes \na correlation or covariance matrix to express large multivariate datasets in a reduced number \nof variable dimensions, termed principal components. It is commonly used in exploratory \ndata analysis to reveal variations and patterns in datasets allowing variables with the highest \ncorrelation to be grouped together. In this study three components are required to retain \n>95% of the variance of the original dataset. Hierarchical cluster analysis (using Pearson’s \ncorrelation coefficient and the complete linkage method) is then carried out on the \n7 \n \ncomponent loadings, which are effectively a measure of the similarity between each original \nvariable and each principal component. A cluster validity index (based on the root mean \nsquare standard deviation) is calculated for each cluster at each step of the process, giving a \nmeasure of the homogeneity of the clusters that have been formed. This allows groundwater \nhydrographs to be combined into an optimum number of groups displaying similar \nfluctuation patterns for which one representative hydrograph can be modelled.  \n \nGroundwater hydrographs from 52 observation boreholes within the Pang and Lambourn \ncatchments have been analysed. The frequency of observations is not consistent in time or \nspace therefore groundwater levels are initially interpolated onto the first day of every \nmonth. Interpolation is only allowed when the time period between successive observations \nis less than 60 days. Where this is not the case the hydrograph is considered to be incomplete. \nApproximately two thirds of the hydrographs have varying lengths of missing data, \ncommonly between 1983 and 1989 and from 1997 onwards. In order to maximise the number \nof data points available, three time periods are identified during which the greatest number of \nboreholes have complete observational records: 1975-1983 and 1989-1997 (each with 40 \ncomplete records), and 1991-2004 (27 complete records). Groundwater levels are normalised \nand a principal component analysis is performed for each of the three time periods. The \ncovariance matrix of the normalised dataset is initially calculated and the eigenvectors and \nvalues of this matrix are found. These are then used to calculate the component scores and \nloadings. Separate cluster analyses are then carried out on the component loadings from each \nof the three principal component analyses and the results are combined. PCA and CA is \ncarried out using the R software environment. The 52 observation boreholes are distributed at \nan average density of approximately 1 per 8 km2, however there is a greater concentration \nacross the western part of the Pang catchment and in the lower Lambourn catchment.  \n \n \n 3.2 Classification Results \nInitial cluster analysis of the component loadings identifies two statistical anomalies (the \ntime-series for the Longacre and Winterbourne boreholes) which consistently form stray \nstrands on the dendrogram plot. These are removed from the analysis and considered as \nsingle entities. The cluster analysis results based on the component loadings of the 1975-\n1983 PCA time period are presented in a dendrogram and validity index plot (Figure 2). The \n8 \n \nresults from all three analyses, indicate that four is the optimum number of groups as this \ngives the smallest number of clusters without significantly increasing the intra cluster root \nmean square standard deviation (RMSSTD).  \n \nFigure 3 shows the standardised hydrographs in groups 1 and 4 identified by PCA and CA. \nHydrographs within group 1 display relatively constant minima with high amplitude \nfluctuations. Group 4 hydrographs display greater inter annual variability and small \namplitude fluctuations. Groups 2 and 3 represent a continuum from group 1 to group 4. \nVariations in the groundwater fluctuation patterns will be determined by a range of factors \nthat are difficult to characterise, for example local recharge patterns, the thickness of the \nunsaturated zone, the structure of the Chalk and local hydrogeological controls such as rivers. \nHowever, a broad spatial distribution of the groups can be seen in Figure 4. There is a \nconcentration of group 1 boreholes in the Upper Lambourn and group 4 boreholes in the \nUpper Pang. Groups 2 and 3 are distributed across the interfluves with a greater \nconcentration of group 2 in the Lambourn catchment and group 3 in the Pang catchment. The \nanomalous boreholes are situated in major dry valleys. One borehole for which a complete \ntime-series is available is randomly selected from each hydrograph group (Baydon Hole, \ngroup 1; Inholmes, group 2; Gibbet Cottages, group 3; Woodend, group 4). Groundwater \nhydrographs from each borehole listed above, along with the two anomalous boreholes, are \nsimulated individually using a simple lumped parameter model.  \n \n(4) Groundwater Hydrograph Simulation & Transposition \n 4.1 Model Structure \nThe model used in this study is a coupled recharge-aquifer model based on the models \npresented by Calver (1997) and Keating (1982). Recharge from the base of the soil zone has \nbeen derived from a previous modelling study (Jackson et al., 2005), which applies the \ndistributed recharge model, ZOODRM (Mansour & Hughes, 2004), to the regional aquifer \nsystem of the Marlborough and Berkshire Downs and South-West Chilterns. This model \ntakes into account daily rainfall derived from Thiessen polygons of 57 rain gauges and \ngridded long-term average rainfall, monthly potential evaporation, and monthly run-off to \ndetermine the amount of excess rainfall. It then applies the Penman–Grindley Soil Moisture \nDeficit method (Penman, 1948; Grindley, 1967), using gridded land-use distribution and \nassociated crop root constants and wilting points, to calculate the evapo-transpiration and \n9 \n \nrecharge. Recharge is also influenced by surface water run-off (surface water as percentage \nof rainfall) and run-on (recharge to the adjacent node as a percentage of run-off). The model \noutputs a distributed, monthly-averaged recharge, which has been extracted at the borehole \nlocations, providing a monthly time-series. \n \nA commonly applied transfer function as used by Calver (1997) is the basis for the transfer \nof recharge from the base of the soil zone through the unsaturated zone to the water table. \nRecharge from the base of the soil in each month is applied to the water table over a number \nof subsequent months. The number of months, n, over which recharge is distributed is a \nmodel parameter. The distribution of recharge over the n months is specified using a two-\nparameter Weibull probability density function, which can represent exponentially \nincreasing, exponentially decreasing and positively and negatively skewed distributions. \nThese distributions are smooth and have been used because they are considered to be more \nphysically justifiable than randomly selected monthly weights. \n \nThe aquifer is represented by a block that is assumed to be unconfined and is drained by a \nstream with a perennial (Qp) and ephemeral (Qw) flow component (Figure 5). A third \ndischarge component (Qa) is added at the base of the system to represent groundwater \ndischarge below the level of the perennial stream. For this model, groundwater head may fall \nbeneath the level of the perennial stream (hp) but will always be above the base level of \ngroundwater discharge (ha). Hydraulic conductivity and storativity are distributed with depth \nso the section of the aquifer discharging to the ephemeral stream is characterised by high \nhydraulic conductivity (Kw) and storativity (Sw), representing the more permeable zone \nwithin the range of water table fluctuation. These parameters decrease with depth so the \nperennial stream is fed by a zone of lower hydraulic conductivity and storativity (Kp and Sp). \nHydraulic conductivity and storativity decrease linearly from the base of the ephemeral \nstream level (hw) to a defined level above that of the perennial stream level (hb). \n \nThe lumped parameter model is based on the mass balance equation: \n \nt\/hyxSQQQyxR apw δδ⋅∆∆=−−−∆∆    [1] \n \n10 \n \nwhere R is recharge [LT-1], ∆x and ∆y are the length and width of the aquifer [L], Qw and Qp \nare the groundwater discharge to the ephemeral (w) and perennial (p) stream components \n[L3T-1], Qa is groundwater outflow [L3T-1], S is the storage coefficient [-], δh is the change in \ngroundwater head [L] over time, δt [T] and h is the groundwater head [L]. The discharge \nterms, Q, are calculated using equations of the form: \n \nh\nx5.0\nyT\nQ ∆\n∆\n∆\n=       [2] \n \nwhere ∆h [L] is the difference between the groundwater head and the elevation of the outlet \nbelow or the difference in elevation between two outlets, depending on the current \ngroundwater head, and T is the appropriately calculated transmissivity [L2T-1]. \n \n 4.2 Model Application \nThe lumped parameter model utilises a Monte Carlo simulation to identify model parameter \nsets that give the best fit to the observed data. Due to the equifinality thesis (Beven, 2003) no \nattempt is made to search for an optimum parameter set using, for example, automatic global \noptimization techniques (see for example Duan et al., 1992; Kuczera and Parent, 1998; Vrugt \net al., 2003a and b, 2005). The recharge–groundwater model has an eleven-dimensional \nparameter space (parameters are listed in Table 1). It has been suggested that in order to \ncomprehensively sample the entire parameter space, each parameter should equate to an \norder of magnitude increase in the number of model runs (Beven, 2001). A Monte Carlo run \nof 1000 simulations of the 14 year calibration period using a monthly time step requires a \ncomputational time of approximately 3 minutes; undertaking 1011 simulations is therefore not \nfeasible. Instead, a two-stage Monte Carlo approach is adopted. The initial stage gives an \nindication of the parameter values that are able to produce a good fit to the observed data, \nallowing preferential sampling of parameters in the final stage. Six groundwater \nhydrographs, including one representative hydrograph from each of the four groups and the \ntwo statistically anomalous hydrographs, are simulated. For the first stage (referred to as the \ninitial Monte Carlo run) a set of 100,000 model simulations is undertaken for each \nhydrograph. Broad parameter ranges are defined a priori for each input parameter (Table 1). \nThe ranges for the eight aquifer parameters are defined based on hydrogeological knowledge \nof the Chalk (Allen et al., 1997) and values are sampled randomly from a uniform \n11 \n \ndistribution of the predefined ranges. The three recharge model parameters include: (1) the \nmaximum number of months, n, over which recharge can be distributed; (2) the shape \nparameter, k, of the Weibull distribution; (3) the scale parameter, λ, of the Weibull \ndistribution. The Weibull distribution parameters, k and λ, are randomly selected to generate \ndifferent forms of the distribution, which are considered to be more physically justifiable \nthan the generally irregular distributions derived by randomly selecting the monthly recharge \nweightings. The maximum number of months, n, is informed by calculating the cross \ncorrelation function between each groundwater level and recharge time-series. The cross \ncorrelation is a measure of the similarity of the two time-series as a function of a time lag \napplied to one of them. The number of months over which recharge is distributed in the \nMonte Carlo run varies between 1 and n and is again randomly selected from a uniform \ndistribution.  \n \nThe model outputs from the initial Monte Carlo run are evaluated against the observed \ngroundwater time-series using two objective functions: the root mean square error (RMSE) \ncalculated on the extremes of the hydrograph (i.e. above or below the mean +\/- one standard \ndeviation) and the Nash Sutcliffe criterion. This gives an indication of the model fit to both \nthe full range and extremes of the observed hydrograph. Scatter diagrams of parameter values \nversus the objective functions of each model simulation indicate the parameters that are \nidentifiable, i.e. tend towards a global optimum (Beven, 2001). For those parameters that are \nshown to be identifiable, the feasible parameter space is reduced such that the new parameter \nrange brackets the best model from the initial Monte Carlo run. Where multiple optima exist \nwithin the parameter space, the a priori range is maintained. A final Monte Carlo run of \n100,000 simulations is made using the reduced parameter space to produce a final set of \ncalibrated models. This two stage approach allows preferential sampling of the parameter \nspace that is initially shown to produce a good fit to the observed data, removing the need to \nundertake 1011 model simulations for each hydrograph.  \n \nIn order to ensure accurate simulation of the hydrograph extremes and to avoid complexities \nof transposing models outside the calibration range (discussed in section 7), models are \ncalibrated over the period 1989-2002, incorporating the most extreme flood event of 2000\/01. \nModels are validated over the period 1975-1989 and against the winter 2002\/03 groundwater \nflood. The single best model from the final simulation is run over the validation period, and \n12 \n \nthen transposed to the other hydrographs within the same group by the process of quantile \nmapping.  \n \nIt is beyond the scope of this paper to undertake model prediction (i.e. simulations outside the \nobserved time period) therefore no formal assessment of model predictive uncertainty is \nmade. However, in order to make a preliminary assessment of model uncertainty, and to \naddress the issue of multiple parameter sets producing a good fit to the observed data, the \nbest 50,000 calibrated models, based on the RMSE of the hydrograph extremes, are run over \nthe validation period for one of the modelled hydrographs (e.g. Baydon Hole in group 1) and \nevaluated against the observed data. In order to assess model uncertainty when simulated \nhydrographs are transposed to other observed hydrographs, the set of validated models is then \ntransposed to the other boreholes in the group, by the method of quantile mapping, and \nevaluated against the observed data using the objective functions as above.  \n \n 4.3 Model Transposition  \nThe quantile mapping technique is often used to correct a model output based on the \nempirical cumulative distribution functions (ECDF) of the observed and simulated datasets \n(Hashino et al., 2007). Each value within the simulated dataset is associated with a particular \npercentile in the simulated distribution. This percentile is mapped onto the ECDF of the \nobserved dataset and the associated observed value becomes the bias corrected value in the \nsimulated dataset.  \nHere quantile mapping is used to translate the four representative simulated hydrographs to \nmultiple locations around the catchments. Comparison of the ECDF of two time-series \nrequires that the data be for equivalent time periods therefore the missing sections of \nhydrographs are initially reconstructed from the representative hydrograph in each group. \nThis is achieved by rescaling using the mean and standard deviation and is based on the \nassumption that the hydrographs in each group have identical standardised forms over the \nentire observational record (1975-2004). The root mean square error (RMSE) is calculated \nfor each reconstructed hydrograph within the time period for which observed data are \navailable, providing an estimation of the error of the reconstructed missing section. The \nminimum error (RMSE) for the reconstructed hydrographs in groups one to four is 0.42 m, \n13 \n \n0.17 m, 0.62 m and 0.51 m, respectively; the maximum RMSE for each group is 2.01 m, \n2.39 m, 2.34 m and 1.32 m.  \nThe percentile of each value in the simulated groundwater time-series, over the entire \ncalibration (1989-2002) and validation (1975-1989, 2002-2004) period, is determined from \nthe ECDF of the simulated time-series over the calibration period only. This percentile is \nmapped onto the ECDF of an observed groundwater time-series (of the calibration period \nonly) from another location and the associated value becomes the groundwater level in the \nconstructed hydrograph for that location. The use of the quantile mapping technique \ntransposes simulated hydrographs such that the probability distribution of the bias corrected \nvalues closely resembles that of the observed data. There should not, however, be a \nsignificant change in the signal of the simulated dataset, i.e. a simulated peak will always \nmap onto a high observed value, and therefore the use of the hydrograph groupings for \ntransposition should improve the fit of the bias corrected values to the observed data. \n \n(5) Results of Hydrograph Simulation \n 5.1 Model Results \nThe parameter ranges defined for the initial and final Monte Carlo runs are shown in Table 1. \nThe results from the initial Monte Carlo run for each modelled hydrograph show that, in \ngeneral, permeability and storativity controlling groundwater head at greater depths in the \nprofile (Kp and Sp) tend towards a global optimum and permeability and storativity of the \nupper profile (Kw and Sw) display multiple optima over the entire range of permissible values. \nThis is highlighted in Figure 6, which shows scatter plots of each aquifer parameter versus \nthe RMSE calculated on the hydrograph extremes for the initial Monte Carlo run of Baydon \nHole (representative hydrograph of Group 1). In general, the results from the initial Monte \nCarlo run for each simulated hydrograph indicate that the best model results are obtained \nfrom a skewed normal distribution of recharge. However, different weightings of recharge \nover a varying number of months are able to produce equally good model results therefore \nthe recharge parameters are sampled from the a priori ranges in the final Monte Carlo run. \nThe recharge distributions for the 200 best models from the final Monte Carlo run of Baydon \nHole are shown in Figure 7. In these models monthly recharge is distributed over three to five \nmonths, with the highest proportion of recharge applied to months two and three. The non-\nidentifiability of certain parameters and the ability of multiple values to produce an equally \n14 \n \ngood fit to the observed data highlight the complex interaction between model parameters. \nThe sensitivity of the model to the higher permeability, Kw, and storativity, Sw, is related to \nthe discharge levels (ha, hp and hw). The feasible range of hw lies close to the maximum \ngroundwater level therefore accounts for a smaller proportion of the total hydrograph range. \nFew model parameter sets therefore result in the mass balance being controlled by discharge, \nQw. For each simulated hydrograph, the goodness of fit is improved in the final Monte Carlo \nrun by reducing the parameter space for those parameters that are shown to be identifiable. \nThis is highlighted in Figure 6, which shows the results from both the initial and final runs for \nBaydon Hole. \n \nThe simulated hydrographs of Baydon Hole (group 1) and Woodend (group 4), which \nrepresent the most diverse hydrograph groups, are shown in Figure 8 over the entire \ncalibration and validation period. The RMSE (calculated on the hydrograph extremes) and \nNash Sutcliffe criterion for the calibration and validation time period of the 6 modelled \nhydrographs are shown in Table 2. Within the calibration period, the Nash Sutcliffe criterion \nis above 0.8 for the simulated hydrographs of Groups 1 to 4 indicating a good fit to the \nobserved data. The hydrograph extremes are also simulated well within the calibration period, \nwith an average RMSE (extremes) of 3m. The Nash Sutcliffe criterion is lower (0.61 and \n0.71) for the anomalous hydrographs however they show a good fit to the hydrograph \nextremes. There is a slight decrease in model performance over the validation period, \nhowever, the Nash Sutcliffe criterions remain above 0.8 (with the exception of Woodend and \nthe anomalous hydrographs) and the RMSE of the extremes remains below 3 m (with the \nexception of Gibbet Cottages).  \n \nThe flood peaks of the 2000\/01 and 2002\/03 flood events are simulated well by all modelled \nhydrographs. The modelled hydrograph of Baydon Hole (group 1) accurately simulates the \ndouble peaks of the 2000\/01 flood event (January and March), both of which are \nunderestimated by less than 1 m. The January 2001 peak is underestimated by 4 m on the \nsimulated hydrograph of Inholmes (group 2) however the March peak is simulated to within \n2 m. The main flood peak on the observed hydrograph of Gibbet Cottages (group 3) occurs in \nMarch and is simulated to within 1.5 m. The modelled hydrograph of Woodend (group 4) \nunderestimates the magnitude of the observed flood peak by only 0.8 m, however simulates \nthe peak in March not January. The observed peaks on the anomalous hydrographs are both \n15 \n \nsimulated to within 0.5 m. The 2003 flood peak, which is within the validation period, occurs \nin February. The modelled hydrographs of Gibbet Cottages and Woodend overestimate the \nflood peak by less than 1 m and 2.5 m, respectively, but simulate the peak in March. The \nmodelled hydrograph of Baydon Hole also overestimates the flood peak by less than 1 m but \nsimulates the peak in January. The timing of this peak is simulated accurately by the \nInholmes and Longacre models to within 0.25 m of the observed value. \n \nThe spread of the simulated time-series of the 50,000 best models for Baydon Hole, over the \ncalibration and validation time period, is shown in Figure 8a. The difference in validated \nresults for the models is relatively small suggesting that the uncertainty of the validated \nmodel results attributable to input parameter uncertainty is low. It does not, however, follow \nthat predictive uncertainty would also be low, particularly if prediction involved simulation \noutside the calibration and validation range. The simulated values do not completely bracket \nthe observations because uncertainty related to recharge error, model structural error and \nobservational error is not taken into account. \n \n 5.2 Quantile Mapping Results  \nSystematic bias is removed from a simulated hydrograph by the process of quantile mapping, \nhowever, it will retain its signal when transposed. The fit of the transposed hydrograph is \ntherefore influenced by the shape of the original simulated time-series and the similarity of \neach observed hydrograph to the original modelled hydrograph. Table 2 shows the RMSE \n(calculated on the hydrograph extremes) and Nash Sutcliffe criterion for several transposed \nhydrographs in each group, highlighting an increase and decrease in error depending on the \nobserved dataset. Where sections of the observed hydrograph have been reconstructed, the \nerror is calculated on the period of time for which observed data are available (i.e. not on the \nreconstructed sections). The hydrograph for Blowing Stone Cottage, which required no \nreconstruction, transposed from Baydon Hole is given as an example (Figure 9). The peak of \n1990 is comparatively high on the original modelled Baydon Hole hydrograph (Figure 8) and \nhas therefore mapped to a high value on the observed Blowing Stone Cottage distribution. \nThe peak of 1990 at Blowing Stone Cottage was less significant resulting in an \noverestimation by the simulated hydrograph. Translation of the modelled hydrograph signal \nwill not always result in a decrease in model performance. Poor simulation of the observed \nmaxima of Baydon Hole between 1977 and 1979 is translated to Blowing Stone Cottage. \n16 \n \nHowever, the observed hydrograph of Blowing Stone Cottage has a slightly different signal \nto Baydon Hole and the error is therefore lower on the transposed hydrograph.  \n \nIn order to assess the impact of the quantile mapping method on model uncertainty the best \n50,000 models based on the RMSE of the hydrograph extremes and the 1st and 100th best \nmodels based on the Nash Sutcliffe criterion for Baydon Hole are transposed to the other \nobserved hydrographs within group 1. The results are evaluated by calculation of the \nobjective functions as above (Table 3). The transposition process results in the removal of \nsystematic bias from each validated model and reduces some of the model uncertainty so \nthere is less difference between the 1st and 50 000th models after they have been transposed. \nThis can be seen by the differences in the errors shown in Table 3 and by comparison of \nFigures 8 and 9. \n \n(6) Water Table Construction \nTransposition of each model to other observed hydrographs within the same group provides a \nsuite of modelled hydrographs for 52 boreholes across the Pang and Lambourn catchments \nover the time period 1975-2004. Spatial interpolation of modelled groundwater levels and \nriver elevations allows a water table surface to be constructed for different points in time. \nThe River Pang, Lambourn, Thames and Kennet act as important discharge points for \ngroundwater thereby exerting a control on the water table surface. The River Thames and \nKennet are comparably large perennial rivers and remain relatively constant in time within \nthe study area, however, the lengths of the River Pang and River Lambourn are highly \ndependent on groundwater level and therefore fluctuate seasonally. The river extents are \ntaken as the perennial river sections plus the ephemeral sections that are known to be flowing \nduring average but not extreme winters (Figure 10a). Using GIS, points are inserted at \nregular intervals along each river and the elevations are extracted from a 50 m digital terrain \nmodel (Morris and Flavin, 1990) and incorporated into the water table surfaces. \n \nWater table surfaces are produced for the first day of every month from November 2000 to \nApril 2001. Those for December 2000 and January–March 2001 are shown in Figure 10. The \nUniversal Kriging method is employed using a rational quadratic empirical semivariogram \nmodel as this provides the best linear unbiased estimation for spatial interpolation. This has \nbeen shown to be one of the most appropriate interpolation methods for contouring \n17 \n \ngroundwater level data, which is generally a non-stationary variable (Gundogdu & Guney, \n2007). The water table surfaces are compared to the ground surface, represented by the 50 m \ndigital terrain model, allowing areas of groundwater emergence to be determined (Figure 10). \nThe spatial extent of flooding is validated against observed flood extent data for the 2000\/01 \nevent (Figure 10a). The flood extent in the Lambourn catchment is determined from field \nmapping (Robinson et al., 2001). This provides a good indication of the longtitudinal \nsections of the valleys that were inundated during winter 2000\/01 but contains no \ninformation on the extent of flooding across the valleys. The exact timing of this mapping is \nalso unknown. The flood extent in the Pang catchment is derived from an aerial photographic \nsurvey which was carried out in mid January 2001, giving a more accurate representation of \nthe temporal and spatial distribution of flooding. In order to quantify the similarity between \nthe observed and simulated extent of flooding the length of flooded sections in both \ncatchments is measured (Table 4). For the Lambourn catchment, the length of the observed \nand simulated flooded sections are measured along the main valley upstream of Upper \nLambourn village, the valley on the western side of the main valley at Upper Lambourn, the \nvalley on the eastern side of the main valley at Lambourn village, the Great Shefford valley, \nand the Winterbourne valley. In the Upper Pang catchment measurements are made of the \nlength of flooded sections in the western and eastern valleys north of Compton.  \n \nThe November water table surface does not generate groundwater emergence upstream of the \nephemeral river sections known to be flowing during average winters. In December 2000 the \nobserved groundwater levels in the upper Lambourn are above the average winter \ngroundwater maxima and the modelled water table surface indicates a small amount of \nemergence in the upper Lambourn catchment (Figure 10a). This is consistent with \nobservations by farmers located on the Chalk scarp slope in the northern part of the \nLambourn catchment, who reported flooding as early as November 2000. In the upper \nLambourn valley, extensive flooding can be seen from the modelling from January through \nto March 2001 (Figure 10b-d), which is consistent with the timing of a double peak on the \nobserved hydrographs of nearby boreholes (e.g. Baydon Hole). Comparison with the mapped \nflood extent (Figure 10a) shows there is generally good agreement at the top of the \nLambourn however there is an overestimation of the extent of flooding in the western dry \nvalley and an underestimation in the main valley and eastern dry valley (Table 4). The \nmodelled hydrographs for boreholes in the Upper Lambourn valley accurately simulate the \n18 \n \nmagnitude of groundwater peaks during the 2000\/01 flood event therefore discrepancies may \nbe due to insufficient control on the groundwater surface as a result of lower data density in \nthis area. Observed flooding in the main valley of the upper Lambourn catchment is also \nknown to be related to localised spring discharge. This may result from lateral flow of \ngroundwater in perched horizons, which is not simulated by the model and therefore not \nincorporated into the water table surface.  \n \nGroundwater is initially observed at the surface in the Great Shefford dry valley in January \n2001 (Figure 10b). The timing of this initial emergence is consistent with the observed \nhydrograph of Northfield Farm, which lies approximately 1.5 km upstream of Great Shefford \nvillage. This hydrograph reaches a maximum value in January 2001 and remains at this level \nuntil April 2001. The modelled flood extent expands up the valley in February (Figure 10c) \nand reaches a maximum in March (Figure 10d), when it closely resembles the mapped flood \nextent (Table 4). Due to a lack of data the timing of flooding further up the valley is \nunknown. The modelled flood extent also progressively expands up the Winterbourne valley, \nclosely simulating the mapped flood extent in the upper valley in March and April (Figure \n10d and Table 4). This timing is consistent with the observed hydrographs of Chapel Farm \nand Chapel Wood which display maxima in late February.  \n \nThe modelled water table surfaces reproduce the beginning of groundwater emergence in the \nUpper Pang in January, with an increase in February and March (Figure 10). The aerial \nsurvey was flown on the 12th January therefore the observed flood extent would be expected \nto lie between the simulated extent for 01\/01\/01 and 01\/02\/01. This is the case for the flooded \nlength in the western dry valley north of Compton, however there is an underestimation of \nthe flooded length of the eastern dry valley (Table 4).  \n \n(7) Discussion \nAs has been observed in past events, flooding caused by groundwater emergence at the land \nsurface has the potential to cause significant damage and prolonged disruption. There is a \ncurrent need for a simple and widely applicable tool to assess the risk in vulnerable areas, \nenable better flood forecasting and allow an assessment of the potential impacts of climate \nchange. The methodology developed here provides a rapidly applicable tool for simulating a \nwater table surface without the need to develop a costly distributed numerical model for this \n19 \n \npurpose. This surface can be constructed for any point in time and used to identify potential \nareas of groundwater emergence. As was demonstrated during the winters of 2000\/01 and \n2002\/03 chalk catchments are particularly susceptible to groundwater flooding and there are \npotential applications for this tool across significant portions of the UK and Europe where \ngroundwater flooding is a risk. \n \nAt present the methodology has only been tested in the two catchments described in this \npaper. Further validation is therefore required to assess its wider applicability. Additional \nwork is required to determine the dependence of the results on the density of the observation \nborehole network as this is likely to affect the accuracy of the interpolated groundwater \nsurface. While this is not addressed in the paper, observed records could be removed from \nthe process in order to test the sensitivity of the results to data density and the applicability of \nthe methodology to less intensively monitored catchments. Other factors such as topography \nand catchment hydrogeology are likely to impact the results therefore more work is also \nrequired to test the ability of the methodology to reproduce groundwater flood extents in \ndifferent hydrogeological settings. There is little groundwater abstraction in the Pang and \nLambourn catchments but abstraction could be incorporated into the lumped parameter \nmodel for application of the methodology to exploited aquifers. In this study model \nsimulations are undertaken using a monthly time-step and it is therefore possible that \ngroundwater extremes at the sub-monthly time-scale may be missed. This is a limitation \nimposed by the majority of available observational data.  \n \nApplication of the methodology for the prediction of groundwater flooding under future \nclimate simulations could be used to assess potential future flood risk. There are two \nlimitations of the methodology presented here which would need to be addressed in such a \nstudy. Firstly, the use of quantile mapping to transpose predicted groundwater hydrographs \nrequires comparison of simulated future groundwater levels with simulated historic \ngroundwater levels, posing a problem where the former lie outside the range of the latter. \nSecondly, the use of Monte Carlo sampling raises questions about model predictive \nuncertainty which would require further exploration for predictive purposes. Several methods \nhave been suggested for applying quantile mapping where future simulated values lie outside \nthe range of historic simulated values. Hamlet et al. (2002) suggest that where future values \nare within ±3.5 standard deviations of historic values, a fitted log normal distribution can be \n20 \n \nused to extend the distribution of the historic dataset. Where future values lie outside ±3.5 \nstandard deviations of historic values a simple rescaling based on the fraction of the long \nterm mean can be used to translate between future and historic datasets. Model uncertainty \nrelated to the variation in the input parameters has not been quantified in this paper, however \nit is shown to be relatively small over the calibration and validation period and reduces when \nquantile mapping is applied. However, this cannot be inferred for model prediction, therefore \nthe multicriteria or GLUE methodologies could be used to quantify predictive uncertainty for \nfuture application of the method in order that all potential groundwater scenarios are \naddressed when assessing the future flood risk. \n \n(8) Conclusions \nGroundwater hydrographs in chalk catchments are notoriously difficult to model because of \nthe particular hydraulic properties of the material and the spatial heterogeneity of the aquifer. \nThe classification of groundwater hydrographs using principal component analysis and \ncluster analysis provides a quantification of the spatial and temporal variations in \ngroundwater behaviour, allowing representative hydrographs to be modelled. The method of \nquantile mapping has been shown to effectively transpose simulated hydrographs to other \nobserved hydrographs providing a relatively fast method for producing a suite of point \nmodels. The spatial interpolation of point models, which are based on a simplified \nrepresentation of the Chalk, allows a time-variant water table surface to be created. \nComparison with the ground surface enables areas of groundwater emergence to be \ndetermined for different points in time. The methodology has been shown to accurately \nrepresent the spatio-temporal occurrence of groundwater flooding in the Pang and Lambourn \ncatchments during the 2000\/01 flood event. It therefore has potential application as a flood \nrisk assessment tool, particularly under future climate scenarios, and would also be \napplicable to studies of drought conditions. \n \n \nAcknowledgements \nThe work was undertaken as part of a Natural Environmental Research Council funded \nproject (NE\/E002307\/1) under the Flood Risk from Extreme Events (FREE) Programme. \nThis paper is published with the permission of the Executive Director of the British \nGeological Survey (Natural Environmental Research Council). \n21 \n \nReferences \nAdams B, Bloomfield J, Gallagher A, Jackson C, Rutter H and Williams A. 2008. FLOOD1 \nFinal Report. British Geological Survey Internal Report IR\/06\/033. \nAllen DJ, Brewerton LJ, Coleby LM, Gibbs BR, Lewis MA, MacDonald AM, Wagstaff SJ, \nWilliams AT. 1997. The physical properties of major aquifers in England and Wales. British \nGeological Survey Technical Report WD\/97\/34. Nottingham, UK: 312. \nBates BC, Kundzewicz ZW, Wu S and Palutikof J (Eds). 2008. Climate Change and Water. \nTechnical Paper of the International Panel on Climate Change, IPCC Secretariat. Geneva: \n210. \nBeven K. 2001. Rainfall-Runoff Modelling: The Primer. John Wiley & Sons Ltd., England. \nBeven K. 2003. A manifesto for the equifinality thesis. Journal of Hydrology 320(1-2): 18-\n36. \nBradford RB. 2002. Controls on the discharge of Chalk streams of the Berkshire Downs, UK. \nScience of the Total Environment 282: 65-80. \nCalver A. 1997. Recharge Response Functions. Hydrology and Earth System Sciences 1: 47-\n53. \nDavis JC. 1986. Statistics and Data Analysis in Geology. John Wiley & Sons, Inc., USA. \nDuan QY, Sorooshian S and Gupta V. 1992. Effective and efficient global optimization for \nconceptual rainfall-runoff models. Water Resources Research 28(4): 1015-1031. \nFinch J, Bradford WRB and Hudson JA. 2004. The spatial distribution of groundwater \nflooding in a chalk catchment in southern England. Hydrological Processes 18(5): 959-971. \nGrapes T, Bradley RC and Petts GE. 2005. Dynamics of river-aquifer interactions along a \nchalk stream: the River Lambourn, UK. Hydrological Processes 19(10): 2035-2053. \nGreen C, Wilson T, Masterson T and Boothby N. 2006. An assessment of the additional flood \nlosses associated with groundwater flooding: a report to Hampshire County Council and \nWinchester City Council. Flood Hazard Research Centre, Middlesex University.  \nGriffiths J, Binley A, Crook N, Nutter J, Young A and Fletcher S. 2006. Streamflow \ngeneration in the Pang and Lambourn catchments, Berkshire, UK. Journal of Hydrology \n330(1-2): 71-83. \nGrindley J. 1967. The estimation of soil moisture deficits. Met. Mag. London 96 (1137): 97-\n108. \n22 \n \nGundogdu KS and Guney I. 2007. Spatial analyses of groundwater levels using universal \nkriging. Journal of Earth System Science 116(1): 49-55. \nHamlet. A.F., Snover, A. and Lettenmaier, D.P. 2002. Climate Change Scenarios for Pacific \nNorthwest Water Planning Studies: Motivation, Methodologies and a User’s Guide to \nApplications. URL< \nhttp:\/\/www.ce.washington.edu\/~hamleaf\/climate_change_streamflows\/technical_documentati\non.pdf> [Accessed 26\/07\/09] \nHannah DM, Smith BPG, Gurnell AM and McGregor GR. 2000. An approach to hydrograph \nclassification. Hydrological Processes 14(2): 317-338. \nHashino T, Bradley AA, Schwartz SS. 2007. Evaluation of bias-correction methods for \nensemble streamflow volume forecasts. Hydrology and Earth System Sciences 11(2): 939-\n950. \nIreson AM, Wheater HS, Butler AP, Mathias SA, Finch J and Cooper JD. 2006. Hydrological \nprocesses in the Chalk unsaturated zone - Insights from an intensive field monitoring \nprogramme. Journal of Hydrology 330(1-2): 29-43. \nIreson AM, Mathias SA, Wheater HS, Butler AP and Finch J. 2009. A model for flow in the \nchalk unsaturated zone incorporating progressive weathering. Journal of Hydrology 365: \n244-260 \nJackson CR, Hughes AG and Mansour MM. 2005. Numerical modelling of groundwater flow \nto Gatehampton. British Geological Survey Commissioned Report CR\/06\/205C. \nKeating T. 1982. A lumped parameter model of a chalk aquifer-stream system in Hampshire, \nUnited-Kingdom. Ground Water 20(4): 430-436. \nKorkmaz S, Ledoux E and Onder H. 2009. Application of the coupled model to the Somme \nriver basin. Journal of Hydrology 366(1-4): 21-34. \nKuczera G and Parent E. 1998. Monte Carlo assessment of parameter uncertainty in \nconceptual catchment models: the Metropolis algorithm. Journal of Hydrology 211(1-4): 69-\n85. \nLee LJE, Lawrence DSL and Price M. 2006. Analysis of water level response to rainfall and \nimplications for recharge pathways in the Chalk aquifer, SE England. Journal of Hydrology \n330(3-4): 604-620. \nMahmood-ul-Hassan A and Gregory PJ. 2002. Dynamics of water movement on Chalkland. \nJournal of Hydrology 257(1-4): 27-41. \nMansour MM and Hughes AG. 2004. User’s manual for the distributed recharge model \nZOODRM. British Geological Survey Internal Report. IR\/04\/150. \n23 \n \nMarechal JC, Ladouche B and Dorfliger N. 2008. Karst flash flooding in a Mediterranean \nkarst, the example of Fontaine de Nimes. Engineering Geology 99(3-4): 138-146.  \nMarsh TJ and Dale M. 2002. The UK floods of 2000-2001: A hydrometeorological appraisal. \nMeeting of the Central Southern Branch of the Chartered-Institute-of-Water-and-\nEnvironmental-Management, Wallingford, England. \nMathias SA, Butler AP, McIntyre N and Wheater HS. 2005. The significance of flow in the \nmatrix of the Chalk unsaturated zone. Journal of Hydrology 310(1-4): 62-77. \nMoon SK, Woo NC and Lee KS. 2004. Statistical analysis of hydrographs and water-table \nfluctuation to estimate groundwater recharge. Journal of Hydrology 292(1-4): 198-209. \nMorris DG and Flavin RW. 1990. A digital terrain model for hydrology. Proc 4th \nInternational Symposium on Spatial Data Handling. Vol. 1, Jul 23-27, Zurich: 250-262 \nNajib K, Jourde H and Pistre S. 2008. A methodology for extreme groundwater surge \npredetermination in carbonate aquifers: Groundwater flood frequency analysis. Journal of \nHydrology 352(1-2): 1-15. \nPenman HL. 1948. Natural evaporation from open water, bare soil and grass. Proc. R. Soc. \nLondon, Ser. A. 194, 120-146. \nPinault JL, Amraoui N and Golaz C. 2005. Groundwater-induced flooding in macropore-\ndominated hydrological system in the context of climate changes. Water Resources Research \n41(5). \nPrice M, Low RG and McCann C. 2000. Mechanisms of water storage and flow in the \nunsaturated zone of the Chalk aquifer. Journal of Hydrology 233(1-4): 54-71. \nRobinson V, Solomon J and Morris S. 2001. Groundwater flooding in the Thames region, \nwinter 2000\/01, Environment Agency. \nVrugt JA, Diks CGH, Gupta HV, Bouten W and Verstraten JM. 2005. Improved treatment of \nuncertainty in hydrologic modeling: Combining the strengths of global optimization and data \nassimilation. Water Resources Research 41(1): 17. \nVrugt JA, Gupta HV, Bastidas LA, Bouten W and Sorooshian S. 2003. Effective and efficient \nalgorithm for multiobjective optimization of hydrologic models. Water Resources Research \n39(8): 19. \nVrugt JA, Gupta HV, Bouten W and Sorooshian S. 2003. A Shuffled Complex Evolution \nMetropolis algorithm for optimization and uncertainty assessment of hydrologic model \nparameters. Water Resources Research 39(8): 18. \n24 \n \nWellings SR. 1984. Recharge of the upper chalk aquifer at a site in hampshire, england .1. \nWater-balance and unsaturated flow. Journal of Hydrology 69(1-4): 259-273. \nWilliams A, Bloomfield J, Griffiths K and Butler A. 2006. Characterising the vertical \nvariations in hydraulic conductivity within the Chalk aquifer. Journal of Hydrology 330(1-2): \n53-62. \nWinter TC, Mallory SE, Allen TR and Rosenberry DO. 2000. The use of principal \ncomponent analysis for interpreting ground water hydrographs. Ground Water 38(2): 234-\n246. \n \n25 \n \nTable 1: Parameters and ranges used in the initial and final Monte Carlo run for each model \n(all groundwater level (Gwl) and elevation (h) values in m aOD; all K values in md-1). \n \nFinal Range Model \nParameter \nInitial \nRange Baydon \nHole \nInholmes Gibbet \nCottages \nWoodend Longacre Winterbourne \nGwl \nRange \n \n \n130-155 102-120 102-132 74-95 124-135 86-94 \nha As Gwl \nRange \n130-135 102-104 102-104 74-75 124-125 86-87 \nhp As Gwl \nRange \n135-140 106-108 110-112 82-84 127-128 86-89 \nhb As Gwl \nRange \n140-154 112-119 122-126 87-91 128-133 87-94 \nhw As Gwl \nRange \n150-155 113-119 126-132 88-95 128-135 92-94 \nKp \n \n0.1-200 40-70 88-96 22-28 20-27 139-155 135-170 \nKw \n \n0.1-200 1-200 1-200 1-200 1-200 1-200 390-500 \nSp \n \n0.001-0.09 0.007-0.02 0.01-0.03 0.009-0.02 0.012-0.03 0.02-0.05 0.04-0.09 \nSw \n \n0.001-0.09 0.001-0.09 0.001-0.09 0.001-0.09 0.001-0.09 0.001-0.09 0.001-0.09 \nn 5 5 6 5 6 5 \nk 1-7 1-7 1-7 1-7 1-7 1-7 \nλ \nSame as \nfinal range 0.1-n 0.1-n 0.1-n 0.1-n 0.1-n 0.1-n \n \nTable 2: Results of the best calibrated model (C) determined by the RMSE calculated on the \nhydrograph extremes for each simulated hydrograph; results when this model is run over the \nvalidation period (V); best and worst example of model transposition from each group when \nthe model of the validation period is transposed to observed hydrographs by the process of \nquantile mapping. Blowing Stone Cottage is also shown in Group 1 as this is given as an \nexample in Figure 9.  \n \n Hydrograph RMSE of hydrograph \nExtremes \nNash Sutcliffe Criterion \nBaydon Hole (C) 1.83 0.83 \nBaydon Hole (V) 2.07 0.82 \nMarsh Benham 0.60 0.74 \nGroup 1 \nKingston Hill Barn 2.79 0.77 \n \nBlowing Stone Cottage 1.59 0.78 \nInholmes (C) 1.06 0.88 \nInholmes (V) 1.25 0.82 \nNorthfield Farm 0.89 0.74 \nGroup 2 \nThe Barracks 2.27 0.74 \nGibbet Cottages (C) 2.98 0.86 \nGibbet Cottages (V) 3.26 0.81 \nBrightwalton Common 1.36 0.72 \nGroup 3 \nMalthouse 2.50 0.78 \nWoodend (C) 1.72 0.81 \nWoodend (V) 2.03 0.60 \nSpringfield Road 1.05 0.34 \nGroup 4 \nLower Chance Farm 2.83 0.67 \nWinterbourne (C) 0.35 0.61 \nWinterbourne (V) 0.78 0.53 \nLongacre (C) 0.66 0.71 \nAnomalies \nLongacre (V) 2.12 0.32 \n \nTable 3: Model results when a suite of calibrated models for Baydon Hole are validated and \ntransposed to other observed hydrographs within group 1 (best and worst results are shown).  \n \nCalibrated Model Baydon Hole \nCalibrated \nBaydon Hole \nValidated \nMarsh Benham \nTransposed \nKingston Hill Barn   \nTransposed \n RMSE NS RMSE NS RMSE NS RMSE NS \n1st (RMSExt) 1.83 0.83 2.07 0.82 0.60 0.74 2.79 0.77 \n100th (RMSExt) 1.93 0.79 2.20 0.79 0.54 0.79 2.82 0.77 \n1000th (RMSExt) 1.94 0.84 2.17 0.82 0.58 0.75 2.80 0.76 \n10 000th (RMSExt) 2.18 0.77 2.32 0.78 0.59 0.75 2.82 0.76 \n50 000th (RSMExt) 2.35 0.85 2.58 0.83 0.69 0.68 2.83 0.75 \n1st (Nash Sutcliffe) 2.02 0.86 2.26 0.85 0.67 0.70 2.71 0.77 \n100th (Nash Sutcliffe) 2.25 0.86 2.50 0.83 0.67 0.69 2.71 0.77 \nError Range 0.52 0.09 0.51 0.07 0.15 0.11 0.12 0.02 \n \nTable 4: Length of the flood extent in the Upper Pang and Lambourn catchments from the \nobserved data and modelled water table surfaces for December 2000 and January – March \n2001.  \n \n \nLambourn Flooded Length (m) \n \nObserved 01\/01\/01 01\/02\/01 01\/03\/01 01\/04\/01 \nWinterbourne \nValley 11041 7986 7986 11570 11442 \nGreat Shefford \nDry Valley 4744 3849 4585 5135 4444 \nLambourn Dry \nValley 2777 1057 0 1057 0 \nUpper Lambourn \nMain Valley 2939 1968 1968 1968 1258 \nUpper Lambourn \nDry Valley 668 2630 1891 2630 1009 \nPang Flooded Length (m) \n \nObserved 01\/01\/01 01\/02\/01 01\/03\/01 01\/04\/01 \nNorth of Compton \n(East) 5278 0 3512 3595 3595 \nNorth of Compton \n(West) 5924 0 6246 6276 6355 \n \n"}