{"doi":"10.1177\/0047287508321199","coreId":"101663","oai":"oai:epubs.surrey.ac.uk:1092","identifiers":["oai:epubs.surrey.ac.uk:1092","10.1177\/0047287508321199"],"title":"An Assessment of Combining Tourism Demand Forecasts over Different Time Horizons","authors":["Shen, S","Li, G","Song, H"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-11","abstract":"<p>This study investigates the performance of combination forecasts in comparison to individual forecasts. The empirical study focuses on the UK outbound leisure tourism demand for the USA. The combination forecasts are based on the competing forecasts generated from seven individual forecasting techniques. The three combination methods examined in this study are: the simple average combination method, the variance-covariance combination method and the discounted mean square forecast error method. The empirical results suggest that combination forecasts overall play an important role in the improvement of forecasting accuracy in that they are superior to the best of the individual forecasts over different forecasting horizons. The variance-covariance combination method turns out to be the best among the three combination methods. Another finding of this study is that the encompassing test does not contribute significantly to the improved accuracy of combination forecasts. This study provides robust evidence of the efficiency of combination forecasts.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1092<\/identifier><datestamp>\n      2017-10-31T14:00:37Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:746F757269736D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1092\/<\/dc:relation><dc:title>\n        An Assessment of Combining Tourism Demand Forecasts over Different Time Horizons<\/dc:title><dc:creator>\n        Shen, S<\/dc:creator><dc:creator>\n        Li, G<\/dc:creator><dc:creator>\n        Song, H<\/dc:creator><dc:description>\n        <p>This study investigates the performance of combination forecasts in comparison to individual forecasts. The empirical study focuses on the UK outbound leisure tourism demand for the USA. The combination forecasts are based on the competing forecasts generated from seven individual forecasting techniques. The three combination methods examined in this study are: the simple average combination method, the variance-covariance combination method and the discounted mean square forecast error method. The empirical results suggest that combination forecasts overall play an important role in the improvement of forecasting accuracy in that they are superior to the best of the individual forecasts over different forecasting horizons. The variance-covariance combination method turns out to be the best among the three combination methods. Another finding of this study is that the encompassing test does not contribute significantly to the improved accuracy of combination forecasts. This study provides robust evidence of the efficiency of combination forecasts.<\/p><\/dc:description><dc:date>\n        2008-11<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1092\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Shen, S, Li, G and Song, H  (2008) An Assessment of Combining Tourism Demand Forecasts over Different Time Horizons   Journal of Travel Research, 47 (2).  pp. 197-207.      <\/dc:identifier><dc:relation>\n        10.1177\/0047287508321199<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1092\/","10.1177\/0047287508321199"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":" 1 \nAn Assessment of Combining Tourism Demand Forecasts over \nDifferent Time Horizons \n \nSHUJIE SHEN \nInstitute for Transport Studies \nUniversity of Leeds \nLeeds LS2 9JT \nUnited Kingdom \n \nGANG LI \nSchool of Management \nUniversity of Surrey \nGuildford GU2 7XH \nUnited Kingdom \n \nHAIYAN SONG1 \nSchool of Hotel and Tourism \nManagement \nThe Hong Kong Polytechnic \nUniversity \nHong Kong \n \nABSTRACT \n \nThis study investigates the performance of combination forecasts in comparison to individual \nforecasts. The empirical study focuses on the UK outbound leisure tourism demand for the \nUSA. The combination forecasts are based on the competing forecasts generated from seven \nindividual forecasting techniques. The three combination methods examined in this study are: \nthe simple average combination method, the variance-covariance combination method and \nthe discounted mean square forecast error method. The empirical results suggest that \ncombination forecasts overall play an important role in the improvement of forecasting \naccuracy in that they are superior to the best of the individual forecasts over different \nforecasting horizons. The variance-covariance combination method turns out to be the best \namong the three combination methods. Another finding of this study is that the encompassing \ntest does not contribute significantly to the improved accuracy of combination forecasts. This \nstudy provides robust evidence of the efficiency of combination forecasts.  \nKeywords: combination forecast; tourism demand, econometric model, forecast performance, \nencompassing test \n \n \nTourism demand forecasting plays an important role in tourism planning and \nmanagement, due to the perishable nature of tourism products and the economic contribution \nof tourism activities to a destination’s economy. The need for more accurate forecasts of \ntourism demand is driven by the desire to reduce risk and uncertainty (Yu and Schwartz \n2006). Much effort has been made in research on tourism demand forecasting accuracy over \nthe past few decades. However, no single forecasting method has been found to outperform \nothers in all situations (Li, Song, and Witt 2005). A new direction in tourism forecasting \nresearch has been to combine the forecasts produced by individual models, using various \ncombination techniques. The favorable results in the general forecasting literature have \ninspired us to explore the usefulness of forecast combination in the tourism context.  If \nforecasting accuracy could be improved through forecast combination, this would certainly \nbe welcomed by the decision makers in both the public and private sectors related to tourism.  \n                                                 \n1\n Authors’ Note: The second author would like to acknowledge the financial support of Hong Kong \nUGC-GRF Grant B-Q04H.  \nShujie Shen, PhD, is a research fellow in the Institute for Transport Studies, University of Leeds, \nUK. Gang Li, PhD, is a lecturer in economics in the Faculty of Management and Law, University of \nSurrey, UK. Haiyan Song, PhD, is chair professor and associate director of the School of Hotel and \nTourism Management, The Hong Kong Polytechnic University, Hong Kong.  The second author \nwould like to acknowledge the financial support of the Hong Kong UGC-CERG grant: B-Q04H.   \n \n 2 \n \nThere has seen a boom in research on forecast combination in various economics and \nbusiness fields since the seminal work of Bates and Granger’s (1969). However, the \napplications of forecast combination methodologies in the tourism context are still rare, with \nvery few exceptions including Chu (1998), Fritz, Brandon, and Xander (1984), Oh and \nMorzuch (2005) and Wong, Song, Witt, and Wu (2007).  \n \nChu (1998) and Fritz, Brandon, and Xander (1984) both applied the variance-\ncovariance combination method, but Chu (1998) only included two time series models in the \ncombination. Fritz, Brandon, and Xander (1984) focused on one time series model and one \ntraditional econometric model. These two studies show empirical evidence in favor of \nforecast combination. Oh and Morzuch (2005) adopted the simple average combination \nmethod to combine the forecasts obtained from several competing time series models. They \nconcluded that a combined forecast never performed less accurately than the poorest \nperforming individual forecasts. Although Wong, Song, Witt, and Wu (2007) combined the \nforecasts generated from three modern econometric models along with one time series model \nbased on three combination methods, the latest forecasting techniques, such as the time-\nvarying parameter (TVP) model, have not been included in their study. Moreover, Wong, \nSong, Witt, and Wu (2007) examined the combination efficiency of one-step-ahead \nforecasting only, and longer forecasting horizons have not been considered.  Their empirical \nresults show that the combined forecasts do not always outperform the best individual \nforecasts but are almost certain to outperform the worst individual forecasts. \n \nThis study aims to extend the previous studies on tourism forecast combination. \nSeven single forecasting techniques, including five econometric models and two time series \nmodels, are employed to generate individual forecasts. The three combination methods used \nin the study include: the simple average combination method, the variance-covariance \ncombination method and the discounted MSFE method. One- to four-quarter-ahead and \neight-quarter-ahead individual forecasts are generated and the efficiency of forecast \ncombination at multiple-step-ahead forecasting horizons is examined. Encompassing tests are \nalso carried out in this study to examine whether they can contribute to the enhanced \nperformance of forecast combination. \n \nThe empirical study of this paper is based on a dataset related to the demand for \nleisure tourism to the USA by UK residents. The UK is one of the five largest tourism \ngenerating countries in the world. During the period 1980-2006, the average annual growth \nrate of UK outbound tourism demand was above 5% and the total UK outbound tourist flows \nalmost tripled between 1980 and 2006. The substantial increase in international tourism \ndemand in the UK is mainly due to the significant improvement in the residents’ living \nstandards together with the rapid development in communication, transportation and global \neconomic integration. As the only non-European country among the top ten destinations for \nUK tourists, the USA remains the number one long-haul destination for UK tourists. \nMeanwhile, according to the US Office of Travel and Tourism Industries, the UK remains the \nthird largest source market for the US inbound tourism and tourist arrivals from the UK \naccount for over 8% of the total market share, with 60% of the visits from the leisure travel \nmarket. Therefore, accurate forecasts of the UK outbound tourism demand for the USA plays \nan important role in the planning and management of the tourism businesses, such as airlines, \nin both countries.  \n \n \n 3 \nFORECAST COMBINATION METHODS \n \nSimple Average Combination Method \n \nA simple procedure for combining the forecasts is to take an arithmetic average of the \nforecasts. This procedure serves as a useful benchmark and has been shown to perform better \nthan some complicated methods (see, for example, Makridakis and Winkler 1983). The \nsimple average combination method calculates the composite forecasts without taking the \nhistorical performance of the individual forecasts into account, as the combination weight is \nassigned equally to each of the individual forecasts. The simple average combination method \ncan be expressed as: \n∑\n=\n=\nn\ni\nitct nff\n1\n\/  (1) \nwhere fct denotes the combined forecast; fit is the ith forecast in time period t; and n is the \nnumber of forecasts to be combined. \n \nThe simple average combination method (known as the ‘folk theorem’ in the forecast \ncombination literature) assigns equal weight to each of the individual forecasts instead of \nusing the optimal weights to minimize the variance of the combination forecasts. This method \noften works better in practice (for example, Granger 1989; Stock and Watson 1999; Fildes \nand Ord 2002). The reason why this is the case is that the estimation of the optimal \ncombination weights can be very difficult in practice. Although forecast combinations with \nan equal weighting scheme may be biased, they could reduce the forecast error variance by \nnot relying on estimated combination weights that depend on the second moments of forecast \nerrors (Elliott and Timmermann 2004). According to Palm and Zellner (1992), the advantages \nof simple average forecast combination are as follows. First, the weights are known and do \nnot have to be estimated—which is an important advantage if there is little evidence on the \nperformance of individual forecasts or if the parameters of the model generating the forecasts \nare time varying; Secondly, in many situations a simple average of forecasts achieves \nsubstantial reductions in variance and bias through averaging out individual bias; and Thirdly, \nit is often superior to the optimal weighting scheme when the effect of sampling errors and \nmodel uncertainty on the estimates of the weights is taken into account.  \n \nClemen (1989) drew a similar conclusion that the simple average combination method \nhas the virtues of impartiality, robustness and a good ‘track-record’ in economic and business \nforecasting. For this reason, it has been the common choice in many forecast combination \nstudies. However, the shortcomings of the simple average method include the ignorance of \npotentially useful information about the precision of the forecasts and assumption that \nforecasts are exchangeable because each forecast receives the same weight (Clemen and \nWinkler 1986).  \n \nVariance-Covariance Method  \n \nThe variance-covariance method was proposed by Bates and Granger (1969). \nNormally the linear weights of individual forecasts are calculated to minimize the error \nvariance of the combination forecasts (assuming un-biasedness for each individual forecast). \nThe principle of the variance-covariance combination method is illustrated using the case \nwhere two forecasting models are involved. Suppose the combined forecasts from the two \nunbiased forecasting models are given as: \n 4 \n2\n,\n1\n,,\nˆ)1(ˆˆ tkttktc tkt ywywy +++ −+=  (2) \nwhere c tkty ,ˆ +  is the k-period-ahead forecast combined from the k-period-ahead forecasts of \n1\n,\nˆ tkty +  and \n2\n,\nˆ tkty + , and w and (1-w) are the weights assigned to 1 ,ˆ tkty +  and 2 ,ˆ tkty + , respectively. \nSince the weights sum to unity, the combined forecast will also be unbiased.  \n \nThe error of the combined forecast is:  \n2\n,\n1\n,,\n)1( tkttktc tkt ewwee +++ −+=   (3) \nand the variance of the error term is: \n12\n2\n22\n22\n11\n22 )1(2)1( σσσσ wwwwc −+−+=  (4) \nwhere 211σ  and 222σ  are the unconditional forecast error variances and 12σ  is the covariance. \nThe weight that minimizes the combined forecast variance is \n)2\/()(* 1221122212222 σσσσσ −+−=w  (5) \nIt can be easily seen that the forecast error variance from the optimal combination is \nlower than the individual variance of 211σ  or 222σ . Therefore, combining the forecasts is \nbeneficial. This example of a two-model forecast combination can be easily extended to \nforecast the combination of multiple-forecasting models.  \nIn practice, 222\n2\n11 ,σσ and 12σ are unknown, but these parameters can be estimated from \nthe data. Suppose that a set of T consecutive forecasts from model 1 is available, together \nwith the corresponding forecasts from model 2, the forecast errors ( ), 21 tt ee , where t=1, \n2,…,T, can be determined. A possible estimator of the combination weight could be: \n∑ ∑ ∑\n∑ ∑\n= = =\n= =\n−+\n−\n= T\nt\nT\nt\nT\nt tttt\nT\nt\nT\nt ttt\ni\neeee\neee\nw\n1 1 1 21\n2\n2\n2\n1\n1 1 21\n2\n1\n2\n (6) \nIn fact, the combination methods that have been used in most of the practical studies \nare much simpler than Formula (6). For example, Bates and Granger (1969) suggested that \nthe weights attached to individual forecasts might be taken as inversely proportional to the \nmean squared forecast error in the recent past. Thus, instead of using Formula (6) to combine \nthe forecasts, Bates and Granger (1969) used Formula (7), which entirely neglects the sample \ncovariance term in Formula (6).  \n∑ ∑\n∑\n= =\n=\n+\n= T\nt\nT\nt tt\nT\nt t\ni\nee\ne\nw\n1 1\n2\n2\n2\n1\n1\n2\n1\n (7) \nFormula (7) could be easily extended to include more than two individual forecasts \nand the weights can be calculated, according to Fritz, Brandon, and Xander (1984), by: \n∑ ∑\n∑\n= =\n−\n=\n−\n=\nm\nj\nT\nt\njt\nT\nt\nit\ni\ne\ne\nw\n1 1\n12\n1\n12\n][\n][\n (8) \n \n 5 \nDiscounted Mean Square Forecast Error (MSFE) Method \n \nThe discounted MSFE method was proposed by Bates and Granger (1969) for a two-\nindividual forecast case and subsequently generalized by Newbold and Granger (1974) for n-\nindividual-forecast combination. The method uses the full sample but weighs recent \nobservations more heavily (Winkler and Makridakis 1983; Diebold and Pauly 1987). The \ncombination of n-individual forecasts for period t is given as: \n∑\n=\n=\nn\ni\nitict fwf\n1\n (9) \nwhere fit is the forecast for period t from forecasting method i, wi is the weight assigned to \nindividual forecast i and n is the number of individual forecasts. Specifically, the weight of \nthe discounted MSFE of the combined forecasts is defined as: \n∑\n=\n−−=\nn\nj\njtititw\n1\n11 \/ φφ  (10) \nwhere 2\n1\n1\n1 )( is\nt\ns\ns\nst\nit fy −=∑\n−\n=\n−−αφ , α  is a selected discounting factor with 10 ≤<α  and ys is the \nactual value for period s. A smaller value of α  implies that more weight is given to the more \nrecent observations. In practice, a few values of α  close to 1 (such as 0.85, 0.90 and 0.95) \nare pre-selected to calculate the weights and the one that produces the most accurate \ncombination forecasts would be selected (see Stock and Watson 2004). When 1=α  (no \ndiscounting) the discounted MSFE method corresponds to Bates and Granger’s (1969) \nvariance-covariance method. The difference between the two methods is that Equation (7) \nignores the covariance information among the forecasting errors. Clemen and Winkler (1986) \ngave a justification for this: when the correlations among the forecast errors are high, the \ncombination weights are likely to be more sensitive to changes in the correlations. To avoid \nthe instability caused by interdependence between the combination weights and correlations \nin the forecasting errors, the covariance matrix should be ignored in Equation (10).  \n \n \nENCOMPASSING TESTS \n \nAn important procedure in forecast combination exercises is to carry out the \nencompassing tests. Forecast encompassing tests stem from forecast combination literature \n(see, inter alia, Bates and Granger 1969; Clemen 1989; Granger 1989). Encompassing tests \nseek to evaluate whether the competing forecasts may be fruitfully combined to produce a \nforecast that is superior to the individual forecasts (Fang 2003). According to Harvey and \nNewbold (2000), if the encompassing tests show that one forecast does not encompass its \ncompetitors, this would imply that the forecasts can be improved by linearly combining these \nforecasts with all the competing forecasts. Another purpose of this study is therefore to \nexamine the effect of the encompassing tests on forecasting performance of the combined \nforecasts.  \n \nHarvey and Newbold (2000) proposed a multi-forecast encompassing test, based on \nthe modified Diebold-Mariano approach, recommended by Harvey, Leybourne, and Newbold \n(1998).  \n \nRegression-Based Multi-forecast Encompassing Test \n 6 \n \nThe case of multi-forecast combination is discussed in Harvey and Newbold (2000). \nLet ),,( 1 ktt ff K be k competing forecasts of the actual value ty , assuming that the forecasts \nare made one step ahead with non-autocorrelated errors, the test of the null-hypothesis that \none forecast 1f  encompasses its competitors starts with: \nktktttkct fffff 132211121 )1( −− ++++−−−−= λλλλλλ LL      10 ≤≤ iλ  (11) \nwhich can be rewritten as: \ntkttkttttt eeeeeee ελλλ +−++−+−= − )()()( 113122111 L         10 ≤≤ iλ  (12) \nwhere ittit fye −= and tε is the error of the combined forecast. The null-hypothesis that \nForecast 1 encompasses Forecast 2,…,k is: 0: 1210 ==== −kH λλλ L  against the alternative \nthat 1211 ,,,: −kH λλλ L  are not jointly equal to zero. Since the null-hypothesis \n0121 ==== −Kλλλ L  is multi-dimensional, the F statistic should be used. This regression-\nbased multi-forecast encompassing test can be applied to multi-step-ahead forecasts, but it is \nsubject to the problem of lacking robustness when the forecasting errors are not normally \ndistributed (Harvey and Newbold 2000).  \n \nModified Diebold-Mariano-Type Multiple Encompassing Test  \n \nThe modified Diebold-Mariano-Type test was proposed by Harvey, Leybourne, and \nNewbold (1997 and 1998) based on the test of Diebold and Mariano (1995). According to \nHarvey, Leybourne, and Newbold (1998), Regression (12) can be rewritten in the following \ngeneral form: \nttt Xy εβ +=\n'\n          \nεβ += Xy\n (13) \nwhere tt ey 1= , ][ 121 ′= −kλλλβ K  and ])())([( 13121 ′−−−= kttttttt eeeeeeX L . \nThe null-hypothesis for multi-forecast encompassing in terms of Regression (13) is \n0:0 =βH , or  \n        \n[ ] 0)()(: 10 =′ − tttt yXEXXEH\n  (14) \nEquation (14) is true if and only if \n0)(:0 =∆ tEH ; [ ]′=∆ − tkttt ddd ,121 L ; )( ,111 tittit eeed +−=  (15) \nThe problem is now reduced to testing for the zero-mean of a vector of random \nvariables, so the multivariate analogue of the Diebold-Marino statistic, denoted as MS*,  \ntakes the form of Hotelling’s (1931) generalized T2-statistic (see, for example, Anderson 1958) \ndVdknnkMS 111* ˆ)1()1()1( −−− ′+−−−=  (16) \nwhere [ ]′= −121 kdddd L  , ∑−= iti dnd 1 and Vˆ is the sample covariance matrix. The \nconstruction of Vˆ  assumes (h-1)-dependency and a corresponding rectangular kernel; as with \nthe modified regression-based tests. The finite sample modification due to Harvey, \nLeybourne, and Newbold (1997) applied directly to the sample variance (diagonal) terms of \n 7 \nVˆ , and it is also straightforward to show that the same correction factor is appropriate when \nestimating the covariance terms. Vˆ  has (i, j)th element: \n[ ]\n\n\n\n −−+−−+−−×\n−+−+=\n∑ ∑ ∑ ∑ ∑\n=\n−\n= +=\n−\n= +=\n−−\n−−−\nn\nt\nh\nm\nn\nmt\nh\nm\nn\nmt\njjtimtijmtjiitjjtiit\nij\ndddddddddddd\nhhnhnnv\n1\n1\n1 1\n1\n1 1\n,,\n111\n))(())(())((\n)1(21ˆ\n (17) \nIn application the critical values of 1,1 +−− knkF  are used for statistic MS*.  \n \nThe modified Diebold-Mariano-type test is also subject to some under-sizing in the \nsmallest samples but is robust and provides a broadly reliable alternative to regression-based \ntests (Harvey, Leybourne, and Newbold 1998). The power of this test is weaker than the F-\ntest when the sample size is small, but the robustness of this test will increase significantly \nwhen the sample size increases.  \n \n \nTHE DATA AND MODELS \n \nThe empirical study focuses on the demand for outbound leisure tourism to the USA by \nthe UK residents. The tourism demand function can be written in the following general form: \n),,,( dummiesRSUBRRCPYfTOU tttt =   (18) \nwhere tTOU  is the UK outbound leisure tourism demand measured by quarterly tourist \narrivals to the USA; Yt is tourist income measured by real gross domestic product (GDP) of \nthe UK in constant prices (1995=100); RRCPt represents the relative tourism price of the \nUSA, which is calculated by dividing the price (measured by the consumer price index) in the \nUSA ( USACPI ) by that of the UK ( UKCPI ), adjusted by the appropriate exchange rate ( UKEX ): \n \nUKUK\nUSA\nEXCPI\nCPI\nRRCP\n\/\n=  (19) \n \nRSUBt represents the relative substitute price of the USA, measured by a weighted \nprice index of the main alternative destinations relative to the tourism price of the UK, with \nshares of tourist arrivals in these potential substitute destinations being the weights. Three \ncountries are chosen as substitutes to the USA. They are Canada (CA), Australia (AU) and \nNew Zealand (NZ). The choice of these destinations is motivated by their relative \nsignificance for UK outbound tourism and the broad similarity of the tourism-related \nattributes among them (Divisekera 2003).  The substitute price is defined as: \nNZAUCA\nNZNZAUAUCACA\nTOUTOUTOU\nTOURRCPTOURRCPTOURRCP\nRSUB\n++\n⋅+⋅+⋅\n=  (20) \nIn this study, all of the above variables are transformed to logarithms, in line with \nmost of the previous tourism demand studies. \n \nThree dummy variables are included in the models to capture the effects of one-off \nevents on the UK outbound tourism demand. Among them, DUM86 represents the severe \n 8 \ndecline in world oil prices in 1986 (DUM86=1 in 1986Q2 and 1986Q3, 0 otherwise). The \ndrastic decline in world oil prices was due to a disagreement between countries about how \nreductions in output should be allocated within OPEC, which soon led to a collapse of \nOPEC’s pricing structure. (Trehan 1986). The decline in world oil prices should have had a \npositive impact on the UK outbound tourism demand. DUM90 captures the effect of the \ninvasion of Kuwait by Iraq in 1990 (DUM90=1 in 1990Q3 and 1990Q4, 0 otherwise). \nDUM91 is used to detect the effects of the Gulf War in 1991 (DUM91=1 in 1991Q1, 1991Q2 \nand 1991Q3, 0 otherwise). These two events may have had negative effects on the UK \noutbound tourism demand. Seasonal dummies are also included in some of the models to \ncapture seasonality. They are defined as Di,t (i=2,3,…,s), Di,t =1 if time t corresponds to \nseason s and Di,t =0 otherwise (s=4 here as quarterly time series are used in the study). \n.  \nThe data covers the period 1984Q1—2004Q4. The series on GDP, exchange rates and \nCPI are obtained from the International Financial Statistics Yearbook published by the \nInternational Monetary Fund (IMF). The tourist arrivals are obtained from the Office for \nNational Statistics in the UK.  \n \n Individual Forecasting Models \n \nIn this study, five econometric models are used to generate individual ex post \nforecasts, and they are the reduced autoregressive distributed lag model (RE-ADLM), \nWickens-Breusch (1988) error correction model (WB-ECM), Johansen (1988) Maximum \nLikelihood error correction model (JML-ECM), vector autoregressive model (VAR) and the \nTVP model.  \n \nRE-ADLM. Following the ‘general-to-specific’ modeling approach, estimation of an \nADLM starts with a general specification which incorporates as many variables as possible \nsupported by appropriate economic theory. The general model is estimated first and the least \nsignificant variable is removed from the equation. This process is repeated until all of the \nvariables left in the equation are statistically significant.  \n \nECMs. The ECM models were first developed by Engle and Granger (1987). ECM \nmodels are more appropriate usually when it is necessary to examine both the long-run \nequilibrium relationship and the short-run dynamics of tourism demand. Two estimation \nmethods have been used in this study: the WB-ECM and the JML-ECM. The difference \nbetween the two methods is that there might be more than one cointegration relationship \nidentified in the JML-ECM. Detailed discussions of this method and its applications in the \ntourism context can be found in Kulendran and Witt (2001) and Lim and McAleer (2001). \n \nVAR Model. Most of the traditional tourism demand models assume that the \nexplanatory variables in a regression model are exogenous, while the VAR model is a system \nof equations in which all variables are treated as endogenous. It is used when the distinction \nbetween endogenous and exogenous variables is not clear or when the forecasters or \npractitioners are interested in the effects of policy ‘shocks’ on forecasting (Song and Witt \n2000).  \n \nTVP Model. Unlike traditional tourism demand analysis, which assumes the \ncoefficients of variables to be constant over the sample period, the TVP model relaxes this \nrestrictive assumption and can trace the behavioral changes of tourists over time. For instance, \nin a log-linear functional form, the TVP model can be used to analyze the evolution of \n 9 \ntourism demand elasticities over time. The TVP model is normally specified in a state space \n(SS) form and estimated using the Kalman filter algorithm (Kalman 1960).  \n \nThe specifications of these models follow those by Song, Witt, and Jensen (2003). \nDue to space constraints and because the single forecasting methods are not the focus of this \nstudy, the model specifications are omitted. \n \nTime-Series Models. Two univariate time series models are included as benchmarks \nfor comparison: the seasonal naïve model and seasonal ARIMA (SARIMA) model (see Witt \nand Witt 1992 and Pankratz 1983 for model specifications). \n \nSeasonality \nAs quarterly data are used in the study, it is likely that the time series exhibit seasonality. The \nHEGY test developed by Hylleberg, Engle, Granger, and Yoo (1990) is used to test for \nseasonal and non-seasonal unit roots in the series. Two types of seasonality are relevant and \nthey are the stochastic seasonality and deterministic seasonality. If the seasonal pattern of a \ndata series evolves over time, so that “winter becomes summer,” the seasonality is stochastic. \nFor stochastic seasonality, seasonal differencing is required. This applies to the WB-ECM \nand JML-ECM in this study. If seasonality is viewed as deterministic, i.e., the seasonal \npattern is consistent over time, seasonal dummies should be used in estimating the models. \nADLM, TVP and VAR specifications incorporate only the deterministic seasonality, in line \nwith many previous studies. Different treatments of seasonality among various models also \nallow for the examination of their effects on forecasting accuracy. \n \n \nEMPIRICAL RESULTS \n \nBefore the performance of various combination methods is evaluated, the \nperformance of the individual forecasting approaches is examined first. \n \nPerformance of Individual Forecasting Methods \n \nThe results of the HEGY tests show that the UK outbound tourist arrivals series and \nthe relative substitute price series exhibit trend and seasonality1. Correspondingly, seasonal \ndifferences have been used in the WB-ECM and JML-ECM approaches before they are \nestimated.  \n \nThe demand models are estimated based on the data from 1984Q1 to 1996Q4 and the \nex post forecasts are generated for the period 1997Q1—2004Q42 . Recursive forecasting \ntechniques are used to generate forecasts, i.e., the models are estimated over the period \n1984Q1—1996Q4 first, and the estimated models are used to forecast the tourist arrivals over \nthe period 1997Q1—2004Q4. Subsequently the models are re-estimated using the data from \n1984Q1 to 1997Q1 and forecasts are generated for the period 1997Q2—2004Q4. Such a \nprocedure is repeated, each time with one more observation added to the estimation period, \nuntil all observations are exhausted. As a result, 32 one-quarter-ahead forecasts, 31 two-\nquarter-ahead forecasts, 30 three-quarter-ahead forecasts, 29 four-quarter-ahead forecasts and \n25 eight-quarter-ahead forecasts are generated. As benchmarks, the seasonal naïve (no \nchange) model and seasonal ARIMA (SARIMA) model are included in the comparison of \nforecasting performance. With regard to the SARIMA model, a collection of SARIMA \nmodels with different orders of p, q, P, Q are estimated first, and one model is selected using \n 10 \nsuch information criteria as the Akaike Information Criterion (AIC) and Schwarz criterion \n(SC). The orders of p, q, P and Q are chosen from 0 to 2, according to Pankratz (1991), who \nstated that in practice, all the orders (p, d, q, P, D, Q) tend to be small, often no more than 1 \nor 2 (for SARIMA models). \n \nTo be consistent with the previous tourism forecasting studies, the forecasting \naccuracy comparison is carried out based on the most frequently used error measure: the \nMean Absolute Percentage Error (MAPE) (for detailed justification see Witt and Witt 1992). \nThe forecasting performances of the alternative models are ranked according to MAPE and \nthe results are shown in Table 1. \n \nTable 1 Forecasting Accuracy over Different Forecasting Horizons \n Measure NAÏVE SARIMA RE-ADLM WB-ECM \nJML-\nECM TVP VAR \n1 -quarter-ahead MAPE 2.045(5) 1.875(3) 2.008(4) 1.661(1) 1.697(2) 2.324(6) 2.389(7) \n2 -quarter-ahead MAPE 2.051(4) 1.753(3) 2.302(5) 1.624(2) 1.540(1) 2.922(6) 3.232(7) \n3 -quarter-ahead MAPE 2.058(4) 1.786(2) 2.245(5) 1.822(3) 1.729(1) 2.490(6) 3.341(7) \n4 -quarter-ahead MAPE 2.113(3) 1.744(2) 2.164(5) 2.134(4) 1.562(1) 2.257(6) 3.736(7) \n8 -quarter-ahead MAPE 3.040(4) 1.673(1) 3.705(5) 2.810(3) 1.745(2) 3.980(6) 6.996(7) \nOverall MAPE 2.261(4) 1.766(2) 2.485(5) 2.010(3) 1.655(1) 2.795(6) 3.939(7) \nNote:  SARIMA = seasonal autoregressive integrated moving average model; RE-ADLM = reduced autoregressive \ndistributed lag model; WB-ECM =Wickens-Breusch error correction model; JML-ECM = Johansen maximum likelihood \nerror correction model; TVP = time-varying parameter model; VAR = vector autoregressive model; MAPE = mean absolute \npercentage error. Figures in parentheses indicate the ranks of individual forecasting methods.Figures in parentheses \nindicate the ranks of individual forecasting methods. \n \nThe results show that for short-term forecasts (i.e., one and two quarters ahead) the \nWB-ECM and JML-ECM generate the most accurate forecasts, followed by the two time \nseries models. With respect to medium-term forecasts (i.e., three and four quarters ahead), the \nJML-ECM is ranked top while the SARIMA performs the second best. As far as the long-run \nforecasts (i.e., eight quarters ahead) are concerned, the SARIMA model outperforms all of its \ncounterparts, closely followed by the JML-ECM and the WB-ECM. The RE-ADLM, TVP \nand VAR models generate the least accurate forecasts across all horizons, with the VAR \nmodel being ranked bottom.  \n \nThe aggregated error measures are calculated across all the forecasting horizons. \nOverall, the JML-ECM outperforms all the others followed by the SARIMA model. The WB-\nECM and the naïve model share third and fourth places. The VAR model exhibits the poorest \nperformance when forecasting UK outbound tourism demand for the USA. \n \nThe superior performance of the JML-ECM and the seasonal time series models is \nlikely to be associated with how the seasonality is dealt with. The specifications of the JML-\nECM and the WB-ECM are based on the results of the seasonal unit root test. The seasonal \nnaïve model and the SARIMA model assume that there are seasonal unit roots at seasonal \nfrequencies and this assumption is consistent with the results of the seasonal HEGY test \nwhich indicates that the UK outbound tourism series exhibits stochastic seasonality. However, \nthe other three models use seasonal dummies to account for deterministic seasonality. \nAccording to Abeysinghe (1994), the use of seasonal dummies in removing the seasonality in \nthe data is likely to produce spurious regressions. Moreover, such a simplification is \nincapable of reflecting the dynamic nature of the seasonality inherent in the actual demand \nfor tourism. This may explain the relatively poor forecasting performance of the RE-ADLM, \n 11 \nVAR and TVP models. The conclusion that can be drawn from the analysis is that different \nassumptions about the effects of seasonality on forecasting performance of alternative models \nand the pre-testing seasonal unit roots can improve forecast accuracy. This conclusion is \nconsistent with that drawn by Allyne (2006).  \n \n Performance of Combination Forecasts \n \nForecast combinations are carried out based on the individual forecasts generated \nfrom the seven single forecasting approaches, i.e., 32 one-quarter-ahead forecasts, 31 two-\nquarter-ahead forecasts, 30 three-quarter-ahead forecasts, 29 four-quarter-ahead forecasts and \n25 eight-quarter-ahead forecasts. The individual out-of-sample forecasts at each horizon are \ndivided into two sub-samples, with the first 20 observations used for the calculation of \ncombination weights and the remainder for the post-sample evaluation of the combined \nforecasts. For example, for the 32 one-quarter-ahead forecasts, the weights using the data \npoints from 1997Q1 to 2001Q4 (equivalently, forecast 1 through forecast 20) are obtained \nfirst. Then one more data point up to 2002Q1 is added, and another weight is calculated from \n1997Q1 to 2002Q1. This update is carried out recursively until the last weight is calculated \nfrom 1997Q1 through to 2004Q3. In line with past studies such as Stock and Watson (2004), \nthe discounted MSFE combination forecasts are computed using three values of the \ndiscounting factor α : 0.95, 0.9 and 0.85. \n \nComparison between Combination Forecasts and Individual Forecasts. The \nperformance of combination forecasts compared to that of the individual forecasts is the main \nfocus of this study. All possible combinations among the seven individual models are \nconsidered. For a given number n of methods being combined there are ( )7n  combinations, \nwhich is 21 for n=2 and 5; 35 for n=3 and 4; 7 for n=6, and 1 for n=7. So the total number of \nall possible combinations of the seven methods is 120. Thus, for each combination method \napplied, 120 combinations are carried out for each forecasting horizon.  \n \nIn the forecasting performance evaluation, the percentage of superior combination \nforecasts is calculated, i.e., the proportion of the combination forecasts which are more \naccurate than the best component individual forecasts (based on the MAPE) to all of the 120 \ncombinations. The performance of combination forecasts in comparison to that of the \nindividual forecasts is evaluated across different forecasting horizons. Table 2 presents the \npercentages of superior combination forecasts across all forecasting horizons. \n \nTable 2 Percentage of Superior Combination Forecasts over the Best Individual \nForecasts \n Measure SA VACO Dis0.85 Dis0.9 Dis0.95 \n1 -quarter-ahead MAPE 65.00%(3) 64.17%(4) 66.67%(1) 65.83%(2) 65.83%(2) \n2 -quarter-ahead MAPE 12.50%(4) 24.17%(1) 11.67%(5) 14.17%(3) 17.50%(2) \n3 -quarter-ahead MAPE 63.33%(3) 82.50%(1) 80.00%(2) 82.50%(1) 82.50%(1) \n4 -quarter-ahead MAPE 96.67%(4) 99.17%(1) 97.50%(3) 98.33%(2) 99.17%(1) \n8 -quarter-ahead MAPE 76.67%(4) 96.67%(3) 99.17%(1) 98.33%(2) 96.67%(3) \nOverall MAPE 62.83%(5) 73.33%(1) 71.00%(4) 71.83%(3) 72.33%(2) \nNote: Figures in parentheses indicate the ranks of combination methods in terms of their performance. Dis0.85, Dis0.9 and \nDis0.95 denotes Discounted MSFE method (α =0.85, 0.9, 0.95, respectively) \n \n 12 \nThe results in Table 2 show that most of the combined forecasts outperform the \ncomponent individual forecasts; i.e., the combined forecast is more accurate than the best \ncomponent individual forecasts. For one-quarter-ahead forecasts, the combination methods \noutperform the best of the individual forecasts in more than 60% of cases. For three-quarter-\nahead forecasts, the variance-covariance combination method and the discounted MSFE \nmethod generate more accurate forecasts than the most accurate individual forecasts in over \n80% of cases. For longer forecasting horizons, the combination forecasts are superior to the \nbest individual forecasts in almost all cases as far as all combination methods are concerned. \nIt indicates that the vast majority of the 120 combination forecasts generated by the three \ncombination methods are more accurate than the best individual forecasts. It should be noted \nthat the superior performance of combination forecasts does not necessarily come from the \ncombination of the best individual forecasts. For example, in the case of the simple average \ncombination with one-quarter-ahead forecasts, 86% of the superior combination forecasts are \nfrom the combination of at least one of the worst three individual models. The formulas of \nthe combination methods above indicate that there is no direct relationship between the \naccuracy of individual forecasts and that of the combined forecasts. This finding is in line \nwith the previous studies such as Timmermann (2006). \n \nOverall, the variance-covariance method and discounted MFSE method outperform \nthe best single model forecasts in over 70% of cases. The simple average method does not \nperform as well as the other two methods, but still generates more accurate forecasts than the \nbest individual forecasts in over 60% of cases.  \n \nThe above analysis shows that the superiority of the combination forecasts is \nrelatively robust across different forecasting horizons except for two-quarter-ahead forecasts. \nThe possible reason for this could be that the information included in each forecast tends to \noverlap (Wong, Song, Witt, and Wu 2007). The consistency of combination forecasting \nperformance should be explored in future research using different datasets.   \n \nComparison between Alternative Combination Methods. The comparison between the \nthree combination methods is based on the percentage of superior combination forecasts as \ndefined above. For one-quarter-ahead forecasts, the discounted MSFE method performs the \nbest. There is only a marginal difference between the performances of the simple average \nmethod and variance-covariance method. The variance-covariance method outperforms its \ncounterparts for two- to four-quarter-ahead forecasts. With respect to eight-quarter-ahead \nforecasts, the discounted MSFE method is ranked the best. The simple average method \nexhibits the poorest performance in most of the cases.  In general, the variance-covariance \nmethod outperforms its counterparts, and the simple average method exhibits the poorest \nperformance.   \n \nThe results in this study show that more sophisticated combination methods, such as \nthe discounted MSFE method and variance-covariance method, which take the historical \nperformance of the individual forecasts into account, perform better than the simple average \ncombination method. This finding is consistent with Holden and Peel (1986) and Bischoff \n(1989), but conflicts with the findings of several other studies (for example, Stock and \nWatson 2004; Palm and Zellner 1992). As far as the discounted MSFE method is concerned, \nthere is no clear-cut answer to how the value of the discounting factor affects the \nperformance of the combination method. \n \n 13 \nComparison of Combination Forecasts with and without Encompassing Test. The \nregression-based F-test and the modified Diebold-Mariano-type test, MS*, are considered in \nthe study. Because the F-test is not robust when the forecast errors exhibit autocorrelations, \nwhich would be expected for the multi-step-ahead forecasts, it is only applied to one-quarter-\nahead forecasts. The MS* test is robust to conditional heteroscedasticity in the regression \nerrors and also allows for forecast error autocorrelation in relatively large samples. The MS* \ntest is applied to one- to four-quarter-ahead and eight-quarter-ahead forecasts to examine \nwhether its power is relatively low in small samples.  \n \nThe two encompassing tests are conducted for every possible combination from the \nseven individual forecast series across different horizons. For a given set of forecasts at each \nforecasting horizon, one forecast must be chosen as the numeraire in the tests; with the \ninterpretation being that this forecast encompasses the others. The encompassing tests are \ncarried out  with each forecast used as the numeraire in turn, in order to allow for all possible \nresults without pre-selection. It is found that the MS* test results are severely mis-sized by \nover accepting the null-hypothesis, especially for medium to long-run forecasts due to the \nsmall sample size of this study. Therefore the examination of the effect of encompassing tests \non the performance of combination forecasts is based on the results from the regression-based \nF-test only, hence restricted to the one-quarter-ahead forecasting horizon3.  \n \nBased on the results of the regression-based F-test, one-quarter-ahead individual \nforecasts at each forecasting horizon are combined. For n competing individual forecasts, if \nthe encompassing test results show that none of them encompasses its competitors, it suggests \nthat the n individual forecasts should be combined and the forecast accuracy can be improved \nby combination.  For example, fsa, fre and ftv are used to represent one-quarter-ahead \nindividual forecasts generated from the forecasting models: SARIMA model, RE-ADLM and \nTVP model. The encompassing test is carried out to test the null-hypothesis that fsa \nencompasses fre and ftv; fre encompasses fsa and ftv; and ftv encompasses fre and fsa. The test \nstatistics are 4.81, 5.41 and 10.27 with associated probability values of 0.0155, 0.0099 and \n0.0004, respectively. The test results show that the hypotheses that the forecasts encompass \ntheir respective rivals are rejected at conventional significance levels. It implies that a \ncombination of the three individual forecasts would lead to an improvement in forecast \nperformance. \n \nTable 3 reports the results of the comparison between the performances of \ncombination forecasts with and without encompassing pre-tests. For consistency with the \nabove analysis, the evaluation is based on the measure of the percentage of superior \ncombination forecasts. It can be seen that the performance of the combination methods based \non the results of the encompassing test has been improved—but only marginally (around 1%). \nThe results suggest that the encompassing test does not contribute significantly to the \nimproved accuracy of combination forecasts, and it is not necessary to conduct an \nencompassing test before individual forecasts are combined.  \n \n 14 \nTable 3 Percentages of Superior Combination Forecasts with and without \nEncompassing Test: One-Step-Ahead Forecasts \nCombination method Superior combination forecasts \nSA (without test) 65.00% \nSA (with test) 65.25% \nimprovement  0.39% \nVACO (without test) 64.17% \nVACO (with test) 64.41% \nimprovement  0.37% \nDiscounted0.95 (without test) 65.83% \nDiscounted0.95 (with test) 66.10% \nimprovement  0.41% \nDiscounted0.9 (without test) 65.83% \nDiscounted0.9 (with test) 66.10% \nimprovement 0.41% \nDiscounted0.85 (without test) 66.67% \nDiscounted0.85 (with test) 66.95% \nimprovement  0.42% \n \n \nCONCLUSION \n \nThis study investigated the accuracy of combination forecasts against individual \nforecasts. The individual forecasting models include the following econometric models: the \nRE-ADLM, two ECM approaches (WB-ECM and JML-ECM), unrestricted VAR model and \nthe TVP model. These models represent the latest methodological developments in the \nliterature of econometric forecasting related to tourism and have shown their advantages over \nthe alternative forecasting models in previous studies. Three combination methods were \nemployed and the performance comparison between alternative combination methods was \ncarried out. The encompassing tests were applied and their effects on forecasting \nperformance of combination methods were examined.  \n \nThe empirical analysis in this study leads to the following conclusions: \n• This study has provided more robust evidence on the superiority of combination \nforecasts to individual forecasts over different forecasting horizons.  \n• The variance-covariance combination method turns out to be the best among the three \ncombination methods investigated. \n• More sophisticated combination forecasts, such as the discounted MSFE method and \nvariance-covariance method, which take the historical performance of the individual \nforecasts into consideration, perform better than the simple average combination \nforecasts.  \n• The encompassing test does not contribute significantly to the improved accuracy of \ncombination forecasts.  \n 15 \n \nThe empirical results provide further evidence on the efficiency of combination \nforecasts suggesting that combination forecasts are preferred to single model forecasts in \ntourism forecasting practices. Further research on the performance of combination forecasts \nin other situations such as different origin-destination pairs, and different data frequencies \nwould be useful. Moreover, to further enhance the conclusion of this study, other advanced \ncombination methods should also be used to evaluate the accuracy improvement of tourism \nforecast combinations.  \n \n \nREFERENCES \nAbeysinghe, T. (1994). “Deterministic Seasonal Models and Spurious Regressions.” Journal \nof Econometrics, 61: 259-72.  \nAlleyne, D. (2006). “Can Seasonal Unit Root Testing Improve the Forecasting Accuracy of \nTourist Arrivals?” Tourism Economics, 12: 45-64.  \nAnderson, T.W. (1958). An Introduction to Multivariate Statistical Analysis. New York: Wiley.  \nBates, J.M., and C.W.J. Granger (1969). “The combination of forecasts.” Operational \nResearch Quarterly, 20: 451-68.  \nBischoff, C.W. (1989). “The Combination of Macroeconomic Forecasts.” Journal of \nForecasting, 8: 293-314. \nChu, F.L. (1998). “Forecasting Tourism: A Combined Approach.” Tourism Management, 19: \n515-20. \nClemen, R.T. (1989). “Combination Forecasts: A Review and Annotated Bibliography.” \nInternational Journal of Forecasting, 5: 559-83.  \nClemen, R.T., and R.L. Winkler (1986). “Combining Economic Forecasts.” Journal of \nBusiness and Economic Statistics, 4: 39-46.  \nDiebold F.X., and R.S. Mariano (1995). “Comparing Predictive Accuracy.” Journal of \nBusiness and Economic Statistics, 13: 253-63.  \nDiebold, F.X., and P. Pauly (1987). “Structural Change and the Combination of Forecasts.” \nJournal of Forecasting, 6: 21-40.  \nDivisekera, S. (2003). “A Model of Demand for International Tourism.” Annals of Tourism \nResearch, 30: 31-49.  \nElliott, G., and A. Timmermann (2004). “Optimal Forecast Combinations under General Loss \nFunctions and Forecast Error Distributions.” Journal of Econometrics, 122: 47-79.  \nEngle, R.F., and C.W.J. Granger (1987). “Cointegration and Error Correction: Representation, \nEstimation and Testing.” Econometrica, 55: 251-76. \nFang, Y. (2003). “Forecasting Combination and Encompassing Tests.” International Journal \nof Forecasting, 19: 87-94.  \nFildes, R., and K. Ord (2002). “Forecasting Competitions—Their Role in Improving \nForecasting Practice and Research.” In A Companion to Economic Forecasting, edited \nby M. Clements and D. Hendry. Oxford: Blackwell. Pp 322-53. \nFritz, R.G., C. Brandon, and J. Xander (1984). “Combining Time-Series and Econometric \nForecast of Tourism Activity.” Annals of Tourism Research, 11: 219-29.  \n 16 \nGranger, C.W.J. (1989). “Combining Forecasts—Twenty Years Later.” Journal of Forecasting, \n8: 167-73.  \nHarvey, D.I., and P. Newbold (2000). “Tests for Multiple Forecast Encompassing.” Journal of \nApplied Econometrics, 15: 471-82.  \nHarvey, D.I., S.J. Leybourne, and P. Newbold (1997). “Testing the Equality of Prediction \nMean Squared Errors.” International Journal of Forecasting, 13: 281-91. \n—— (1998). “Tests for Forecast Encompassing.” Journal of Business and Economic \nStatistics, 16: 254-59.  \nHolden, K., and D.A. Peel (1986). “An Empirical Investigation of Combinations of Economic \nForecasts.” Journal of Forecasting, 5: 229-42.  \nHotelling, H. (1931). “The Economics of Exhaustible Resources.” The Journal of Political \nEconomy, 39(2): 137-75. \nHylleberg, S., R.F. Engle, C.W.J. Granger, and B.S. Yoo (1990). “Seasonal Integration and \nCointegration.” Journal of Econometrics, 44: 215-38.  \nJohansen, S. (1988). “A Statistical Analysis of Cointegration Vectors.” Journal of Economic \nDynamics and Control, 12: 231-54. \nKalman, R.E. (1960). “A New Approach to Linear Filtering and Prediction Problems, \nTransitions ASME.” Journal of Basic Engineering, 82: 35-45. \nKling, J.L., and D.A. Bessler (1985). “A Comparison of Multivariate Forecasting Procedures \nfor Economic Time Series.” International Journal of Forecasting, 1: 5-24. \nKulendran, N., and S.F. Witt (2001). “Cointegration versus Least Squares Regression.” \nAnnals of Tourism Research, 28: 291-311.  \nLi, G., H. Song, and S.F. Witt (2005). “Recent Developments in Econometric Modelling and \nForecasting.” Journal of Travel Research, 44: 82-99.  \nLim, C., and M. McAleer (2001). “Cointegration Analysis of Quarterly Tourism Demand by \nHong Kong and Singapore for Australia.” Applied Economics, 33: 1599-619. \nMakridakis, S., and R.L. Winkler (1983). “Averages of Forecasts: Some Empirical Results.” \nManagement Science, 29: 987-96.  \nNewbold, P., and C.W.J. Granger (1974). “Experience with Forecasting Univariate Time \nSeries and the Combination of Forecasts.” Journal of the Royal Statistical Society, Series \nA, 137: 131-46. \nOh, C., and B.J. Morzuch (2005). “Evaluating Time-Series Models to Forecast the Demand \nfor Tourism in Singapore.” Journal of Travel Research, 43: 404-13.  \nPalm, F., and A. Zellner (1992). “To Combine or Not to Combine? Issues of Combining \nForecasts.” Journal of Forecasting, 11: 687-701.  \nPankratz, A. (1983). Forecasting with Univariate Box-Jenkins Models. New York: Wiley.  \nPankratz, A. (1991). Forecasting with Dynamic Regression Models. New York: Wiley \nSong, H., and S.F. Witt (2000). Tourism Demand Modelling and Forecasting: Modern \nEconometric Approaches. Oxford, UK: Pergamon.  \nSong, H., S.F. Witt, and T.C. Jensen (2003). “Tourism Forecasting: Accuracy of Alternative \nEconometric Models.” International Journal of Forecasting, 19: 123-41.  \n 17 \nStock, J.H., and M.W. Watson (1999). “Forecasting Inflation.” Journal of Monetary \nEconomics, 44: 293-375.  \n—— (2004). “Combination Forecasts of Output growth in A Seven-Country Data Set.” \nJournal of Forecasting, 23: 405-30.  \nTimmermann, A. (2006). “Forecast Combinations.” In Handbook of Economic Forecasting, \nedited by G. Elliot, C.W.J. Granger, and A. Timmermann. Amsterdam: Elsevier. Pp 135-\n96. \nTrehan, B. (1986). “Oil Prices, Exchange Rates and the U.S. Economy: An Empirical \nInvestigation.” Economic Review, Federal Reserve Bank of San Francisco, 4: 25-43. \nWickens, M.R., and T.S. Breusch (1988). “Dynamic Specification, the Long-Run and the \nEstimation of Transformed Regression Model.” Economic Journal, 98(Conference): \n189-205. \nWinkler, R.L., and S. Makridakis (1983). “The Combination of Forecasts.” Journal of the \nRoyal Statistical Society, Series A, 146: 150-57. \nWitt, S.F., and C.A. Witt (1992). Modelling and Forecasting Demand in Tourism. London: \nAcademic Press. \nWong, K.K.F., H. Song, S.F. Witt, and D.C. Wu (2007). “Tourism Forecasting: To Combine \nor Not to Combine?” Tourism Management, 28:1068-78.  \nYu, G., and Z. Schwartz (2006). “Forecasting Short Time-Series Tourism Demand with \nArtificial Intelligence Models.” Journal of Travel Research, 45: 194-203.  \n \n \nNOTES \n                                                 \n1\n The results of he HEGY test are omitted here due to space constraints, but are available \nfrom the authors upon request. \n2\n The model estimation results are omitted here due to space constraints but are available \nfrom the authors upon request. \n3\n The results of both encompassing tests are not reported here but available from the author \nupon request.  \n \n"}