{"doi":"10.1007\/s00410-008-0356-3","coreId":"61051","oai":"oai:nora.nerc.ac.uk:6989","identifiers":["oai:nora.nerc.ac.uk:6989","10.1007\/s00410-008-0356-3"],"title":"Microlite transfer by disaggregation of mafic inclusions following magma mixing at Soufriere Hills Volcano, Montserrat","authors":["Humphreys, Madeleine C.S.","Christopher, Thomas","Hards, Vicky"],"enrichments":{"references":[],"documentType":{"type":0.6666666667}},"contributors":[],"datePublished":"2009","abstract":"The Soufrière Hills volcano on Montserrat has for the past 12 years been erupting andesite with basaltic to basaltic–andesite inclusions. The andesite contains a wide variety of phenocryst textures and strongly zoned microlites. Analysis of minor elements in both phenocrysts and microlites allows us to put detailed constraints on their origins. Compositions of clinopyroxene, from overgrowth rims on quartz and orthopyroxene and coarse-grained breakdown rims on hornblende, are identical to those from the mafic inclusions, indicating that these rims form during interaction with mafic magma. In contrast, resorbed quartz and reversely zoned orthopyroxenes form during heating. Microlites of plagioclase and orthopyroxene are chemically distinct from the phenocrysts, being enriched in Fe and Mg, and Al and Ca respectively. However, microlites of plagioclase, orthopyroxene and clinopyroxene are indistinguishable from the compositions of these phases in the mafic inclusions. We infer that the inclusions disaggregated under conditions of high shear stress during ascent in the conduit, transferring mafic material into the andesite groundmass. The mafic component of the system is therefore greater than previously thought. The presence of mafic-derived microlites in the andesite groundmass also means that care must be taken when using this as a starting material for phase equilibrium experiments. \\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/61051.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/6989\/1\/Microlite_Transfer%5B1%5D.pdf","pdfHashValue":"49f5174a2536c932b11a51ebf1215628f1000123","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:6989<\/identifier><datestamp>\n      2012-11-22T11:59:37Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/6989\/<\/dc:relation><dc:title>\n        Microlite transfer by disaggregation of mafic inclusions following magma mixing at Soufriere Hills Volcano, Montserrat<\/dc:title><dc:creator>\n        Humphreys, Madeleine C.S.<\/dc:creator><dc:creator>\n        Christopher, Thomas<\/dc:creator><dc:creator>\n        Hards, Vicky<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        The Soufrière Hills volcano on Montserrat has for the past 12 years been erupting andesite with basaltic to basaltic–andesite inclusions. The andesite contains a wide variety of phenocryst textures and strongly zoned microlites. Analysis of minor elements in both phenocrysts and microlites allows us to put detailed constraints on their origins. Compositions of clinopyroxene, from overgrowth rims on quartz and orthopyroxene and coarse-grained breakdown rims on hornblende, are identical to those from the mafic inclusions, indicating that these rims form during interaction with mafic magma. In contrast, resorbed quartz and reversely zoned orthopyroxenes form during heating. Microlites of plagioclase and orthopyroxene are chemically distinct from the phenocrysts, being enriched in Fe and Mg, and Al and Ca respectively. However, microlites of plagioclase, orthopyroxene and clinopyroxene are indistinguishable from the compositions of these phases in the mafic inclusions. We infer that the inclusions disaggregated under conditions of high shear stress during ascent in the conduit, transferring mafic material into the andesite groundmass. The mafic component of the system is therefore greater than previously thought. The presence of mafic-derived microlites in the andesite groundmass also means that care must be taken when using this as a starting material for phase equilibrium experiments. \\ud\n<\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2009<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/6989\/1\/Microlite_Transfer%5B1%5D.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Humphreys, Madeleine C.S.; Christopher, Thomas; Hards, Vicky.  2009  Microlite transfer by disaggregation of mafic inclusions following magma mixing at Soufriere Hills Volcano, Montserrat.   Contributions to Mineralogy and Petrology, 157 (5). 609-624.  https:\/\/doi.org\/10.1007\/s00410-008-0356-3 <https:\/\/doi.org\/10.1007\/s00410-008-0356-3>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.springerlink.com\/content\/100406\/<\/dc:relation><dc:relation>\n        10.1007\/s00410-008-0356-3<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/6989\/","http:\/\/www.springerlink.com\/content\/100406\/","10.1007\/s00410-008-0356-3"],"year":2009,"topics":["Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":""}