{"doi":"10.1016\/j.ecolecon.2006.12.010","coreId":"96335","oai":"oai:eprints.lse.ac.uk:29716","identifiers":["oai:eprints.lse.ac.uk:29716","10.1016\/j.ecolecon.2006.12.010"],"title":"Trading away damage: quantifying environmental leakage through consumption-based, life-cycle analysis","authors":["Ghertner, D. Asher","Fripp, Matthias"],"enrichments":{"references":[{"id":17284943,"title":"A consumption-based theory of environmental Kuznets curve.","authors":[],"date":"2001","doi":"10.1016\/s0921-8009(00)00269-x","raw":"Gawande, K., R. P. Berrens, and A. K. Bohara. 2001. A consumption-based theory of environmental Kuznets curve. Ecological Economics 37:101-112.","cites":null},{"id":17284941,"title":"Allocating the responsibility of CO2 over-emissions from the perspectives of benefit principle and ecological deficit.","authors":[],"date":"2003","doi":"10.1016\/s0921-8009(03)00104-6","raw":"Ferng, J.-J. 2003. Allocating the responsibility of CO2 over-emissions from the perspectives of benefit principle and ecological deficit. Ecological Economics 46:121-141.","cites":null},{"id":17284904,"title":"Annual Industry Accounts: Gross-Domestic-Product-(GDP)-by-Industry Data. Bureau of Economic Analysis,","authors":[],"date":"2006","doi":null,"raw":"BEA, U. S. 2006a. Annual Industry Accounts: Gross-Domestic-Product-(GDP)-by-Industry Data. Bureau of Economic Analysis, Washington, DC.","cites":null},{"id":17284906,"title":"Annual Industry Accounts: Input-Output Accounts Data. Bureau of Economic Analysis,","authors":[],"date":"2006","doi":null,"raw":"BEA, U. S. 2006b. Annual Industry Accounts: Input-Output Accounts Data. Bureau of Economic Analysis, Washington, DC.","cites":null},{"id":17284900,"title":"Assessing the energy intensities of imports.","authors":[],"date":"1998","doi":"10.1016\/s0140-9883(97)00016-9","raw":"Battjes, J. J., K. J. Noorman, and W. Beiesiot. 1998. Assessing the energy intensities of imports. Energy Economics 20:67-83.","cites":null},{"id":17284942,"title":"Beyond IPAT and Kuznets Curves: Globalization as a Vital Factor in Analyzing the Environmental Impact of Socio-Economic Metabolism. Population and Environment","authors":[],"date":"2001","doi":null,"raw":"Fischer-Kowalski, M., and C. Amann. 2001. Beyond IPAT and Kuznets Curves: Globalization as a Vital Factor in Analyzing the Environmental Impact of Socio-Economic Metabolism. Population and Environment 23:7-47.","cites":null},{"id":17284916,"title":"Broad based Life Cycle Assessment.","authors":[],"date":"1993","doi":"10.1021\/es00040a001","raw":"Curran, M. A. 1993. Broad based Life Cycle Assessment. Environmental Science and Technology 27:430-436.","cites":null},{"id":17284968,"title":"Change in CO2 emission and its transmission between Korea and Japan using international input-output analysis.","authors":[],"date":"2006","doi":"10.1016\/j.ecolecon.2005.09.005","raw":"Rhee, H.-C., and H.-S. Chung. 2006. Change in CO2 emission and its transmission between Korea and Japan using international input-output analysis. Ecological Economics 58:788-800.","cites":null},{"id":17284964,"title":"CO2 accounts for open economies: producer or consumer responsibility.","authors":[],"date":"2001","doi":"10.1016\/s0301-4215(00)00120-8","raw":"Munksgaard, J., and K. A. Pedersen. 2001. CO2 accounts for open economies: producer or consumer responsibility. Energy Policy 29:327-334.","cites":null},{"id":17284955,"title":"CO2 emissions in Japan: influences of imports and exports.","authors":[],"date":"1998","doi":"10.1016\/s0306-2619(98)00011-7","raw":"Kondo, Y., Y. Moriguchi, and H. Shimizu. 1998. CO2 emissions in Japan: influences of imports and exports. Applied Energy 59:163-174.","cites":null},{"id":17284966,"title":"Comparing high and low residential density: Life-cycle analysis of energy use and greenhouse gas emissions.","authors":[],"date":"2006","doi":"10.1061\/(asce)0733-9488(2006)132:1(10)","raw":"Norman, J., H. L. MacLean, and C. A. Kennedy. 2006. Comparing high and low residential density: Life-cycle analysis of energy use and greenhouse gas emissions. Journal of Urban Planning and Development 132:10-21.","cites":null},{"id":17284951,"title":"Comparison of environmental implications of asphalt and steel-reinforced concrete pavements.","authors":[],"date":"1998","doi":"10.3141\/1626-13","raw":"Horvath, A., and C. Hendrickson. 1998. Comparison of environmental implications of asphalt and steel-reinforced concrete pavements. Transportation Research Record 4:105-113.","cites":null},{"id":17284988,"title":"Control of SO2 emissions from power plants: A case of induced technological innovation in the U.S. Technological Forecasting and Social Change 72:697-718.","authors":[],"date":"2005","doi":"10.1016\/j.techfore.2004.11.001","raw":"Taylor, M. R., E. S. Rubin, and D. A. Hounshell. 2005. Control of SO2 emissions from power plants: A case of induced technological innovation in the U.S. Technological Forecasting and Social Change 72:697-718.","cites":null},{"id":17284961,"title":"Corruption, pollution and the environmental Kuznets curve.","authors":[],"date":"2000","doi":"10.1006\/jeem.1999.1107","raw":"Lopez, R., and S. Mitra. 2000. Corruption, pollution and the environmental Kuznets curve. Journal of Environmental Economics and Management 40:137-150.","cites":null},{"id":17284953,"title":"Dirty industries': patterns of change in industrial countries.","authors":[],"date":"1997","doi":"10.1007\/bf02441762","raw":"Janicke, M., M. Binder, and H. Monch. 1997. 'Dirty industries': patterns of change in industrial countries. Environmental and Resource Economics 9:467-491.","cites":null},{"id":17284984,"title":"Economic development and environmental quality: an econometric analysis.","authors":[],"date":"1994","doi":null,"raw":"Shafik, N. 1994. Economic development and environmental quality: an econometric analysis. Oxford Economic Papers 46:757-773.","cites":null},{"id":17284956,"title":"Economic Growth and Income Inequality.","authors":[],"date":"1955","doi":"10.2307\/1905589","raw":"Kuznets, S. 1955. Economic Growth and Income Inequality. American Economic Review 45:1-28.","cites":null},{"id":17284908,"title":"Economic growth and the environment: whose growth? Whose environment? World Development","authors":[],"date":"1992","doi":"10.1016\/0305-750x(92)90038-w","raw":"Beckermann, W. 1992. Economic growth and the environment: whose growth? Whose environment? World Development 20:481-496.","cites":null},{"id":17284896,"title":"Economic growth, carrying capacity and the environment.","authors":[],"date":"1995","doi":"10.1126\/science.268.5210.520","raw":"Arrow, K., B. Bolin, R. Costanza, and e. al. 1995. Economic growth, carrying capacity and the environment. Science 268:520-521.","cites":null},{"id":17284987,"title":"Economic growth, trade and energy: implications for the environmental Kuznets curve.","authors":[],"date":"1998","doi":"10.1016\/s0921-8009(97)00180-8","raw":"Suri, V., and D. Chapman. 1998. Economic growth, trade and energy: implications for the environmental Kuznets curve. Ecological Economics 25:195-208.","cites":null},{"id":17284948,"title":"Economic Input-Output Models for Environmental Life-Cycle Assessment.","authors":[],"date":"1998","doi":"10.1021\/es983471i","raw":"Hendrickson, C., A. Horvath, S. Joshi, and L. Lave. 1998. Economic Input-Output Models for Environmental Life-Cycle Assessment. Environmental Science and Technology 32:184A-191A.","cites":null},{"id":17284940,"title":"Economic resilience and economic policy.","authors":[],"date":"1995","doi":"10.1016\/0921-8009(95)00061-5","raw":"Farber, S. 1995. Economic resilience and economic policy. Ecological Economics 15:105-107.","cites":null},{"id":17284954,"title":"Economics, ecology and environmental quality.","authors":[],"date":"1996","doi":"10.2307\/2269549","raw":"Karr, J. R., and T. Thomas. 1996. Economics, ecology and environmental quality. Ecological Applications 6:31-32.","cites":null},{"id":17284965,"title":"Embodied pollution in trade: estimating the 'environmental load displacement' of industrialized countries.","authors":[],"date":"2002","doi":"10.2139\/ssrn.278809","raw":"Muradian, R., M. O'Connor, and J. Martinez-Alier. 2002. Embodied pollution in trade: estimating the 'environmental load displacement' of industrialized countries. Ecological Economics 41.","cites":null},{"id":17284962,"title":"Energy and carbon embodied in the international trade of Brazil: an input-output approach.","authors":[],"date":"2001","doi":"10.1016\/s0921-8009(01)00230-0","raw":"Machado, G., R. Schaeffer, and E. Worrell. 2001. Energy and carbon embodied in the international trade of Brazil: an input-output approach. Ecological Economics 39:409-424.","cites":null},{"id":17284939,"title":"Environmental assessment of freight transportation in the US.","authors":[],"date":"2006","doi":"10.1021\/es070989q","raw":"Facanha, C., and A. Horvath. 2006. Environmental assessment of freight transportation in the US. International Journal of Life Cycle Assessment 11:229-239.","cites":null},{"id":17284945,"title":"Environmental impacts of a North American free trade agreement. Woodrow","authors":[],"date":"1992","doi":"10.3386\/w3914","raw":"Grossman, G. M., and A. B. Krueger. 1992. Environmental impacts of a North American free trade agreement. Woodrow Wilson School, Princeton, N.J. Grossman, G. M., and A. B. Krueger. 1995. Economic growth and the environment. Quarterly Journal of Economics May:353-357.","cites":null},{"id":17284989,"title":"Environmental impacts of products: A detailed review of studies.","authors":[],"date":"2006","doi":"10.1162\/jiec.2006.10.3.159","raw":"Tukker, A., and B. Jansen. 2006. Environmental impacts of products: A detailed review of studies. Journal of Industrial Ecology 10:159-182.","cites":null},{"id":17284969,"title":"Environmental Kuznets curves--real progress or passing the buck? A case for consumption-based approaches.","authors":[],"date":"1998","doi":"10.1016\/s0921-8009(97)00179-1","raw":"Rothman, D. S. 1998. Environmental Kuznets curves--real progress or passing the buck? A case for consumption-based approaches. Ecological Economics 25:177-194.","cites":null},{"id":17284949,"title":"Environmental Life Cycle Assessment of Goods and Services: An Input-Output Approach.","authors":[],"date":"2006","doi":"10.4324\/9781936331383","raw":"Hendrickson, C. T., L. B. Lave, and H. S. Matthews. 2006. Environmental Life Cycle Assessment of Goods and Services: An Input-Output Approach. RFF Press, Washington, DC.","cites":null},{"id":17284972,"title":"Environmental quality and development: is there a Kuznets curve for air pollution emissions?","authors":[],"date":"1994","doi":"10.1006\/jeem.1994.1031","raw":"Seldon, T. M., and D. Song. 1994. Environmental quality and development: is there a Kuznets curve for air pollution emissions? Journal of Environmental Economics and Management 27:147-162.","cites":null},{"id":17284946,"title":"From Make-Use to Symmetric I-O Tables: An Assessment of Alternative Technology Assumptions","authors":[],"date":"2002","doi":null,"raw":"Guo, J., A. M. Lawson, and M. A. Planting. 2002. From Make-Use to Symmetric I-O Tables: An Assessment of Alternative Technology Assumptions in 14th International Conference on Input-Output Techniques, Montreal, Canada.","cites":null},{"id":17284963,"title":"Global warming agreements, international trade and energy\/carbon embodiments: an input-output approach to the Italian case.","authors":[],"date":"2006","doi":"10.1016\/j.enpol.2004.06.004","raw":"Mongelli, I., G. Tassielli, and B. Notarnicola. 2006. Global warming agreements, international trade and energy\/carbon embodiments: an input-output approach to the Italian case. Energy Policy 34:88-100.","cites":null},{"id":17284902,"title":"Input-Output Accounts of the U.S.","authors":[],"date":"1997","doi":null,"raw":"BEA, U. S. 1997. Input-Output Accounts of the U.S. Economy. Type Report Number, Institutionhttp:\/\/www.bea.gov\/bea\/dn2\/i-o_benchmark.htm.","cites":null},{"id":17284960,"title":"Input-Output Economics.","authors":[],"date":"1986","doi":"10.2307\/1909151","raw":"Leontief, W. 1986. Input-Output Economics. Oxford University Press, New York.","cites":null},{"id":17284957,"title":"Integrated policy-making for growing human aspirations.","authors":[],"date":"1995","doi":"10.1016\/0921-8009(95)00063-1","raw":"Lash, J. 1995. Integrated policy-making for growing human aspirations. Ecological Economics 15:113-114.","cites":null},{"id":17284938,"title":"International Energy Outlook","authors":[],"date":"2006","doi":"10.1787\/weo-2006-en","raw":"EIA. 2006. International Energy Outlook 2004. E. I. A. US Department of Energy. http:\/\/www.eia.doe.gov\/emeu\/international\/energyconsumption.html.","cites":null},{"id":17284952,"title":"Lead in the Americas: A Call to Action. National Academies Press,","authors":[],"date":"1996","doi":null,"raw":"IOM. 1996. Lead in the Americas: A Call to Action. National Academies Press, Washington, D.C. Jacobsen, H. K. 2000. Energy demand, structural change and trade: A decomposition analysis of the Danish manufacturing industry. Economic Systems Research 12:319-343.","cites":null},{"id":17284970,"title":"Learning curves for environmental technology and their importance for climate policy analysis.","authors":[],"date":"2004","doi":"10.1016\/j.energy.2004.03.092","raw":"Rubin, E. S., M. R. Taylore, S. Yeh, and D. A. Hounshell. 2004. Learning curves for environmental technology and their importance for climate policy analysis. Energy 29:1551-1559.","cites":null},{"id":17284950,"title":"Life cycle approaches to sustainable consumption: A critical review.","authors":[],"date":"2005","doi":"10.1021\/es0497375","raw":"Hertwich. 2005. Life cycle approaches to sustainable consumption: A critical review. Environmental Science and Technology 39:4673-4684.","cites":null},{"id":17284918,"title":"Managing Earth's Life Support Systems.","authors":[],"date":"1996","doi":"10.2307\/2269542","raw":"Daily, G. C., P. R. Ehrlich, and M. Alberti. 1996. Managing Earth's Life Support Systems. Ecological Applications 6.","cites":null},{"id":17284898,"title":"Measuring the value of global resource consumption: direct and indirect flows of assets in international trade.","authors":[],"date":"1996","doi":null,"raw":"Atkinson, G., and K. Hamilton. 1996. Measuring the value of global resource consumption: direct and indirect flows of assets in international trade. Centre for Social and Economic Research on the Global Environment, London.","cites":null},{"id":17284986,"title":"Modeling study of air pollution due to the manufacture of export goods in China's Pearl River Delta.","authors":[],"date":"2006","doi":"10.1021\/es051275n","raw":"Streets, D. G., C. Yu, M. H. Bergin, and G. R. Carmichael. 2006. Modeling study of air pollution due to the manufacture of export goods in China's Pearl River Delta. Environmental Science and Technology 40:2099-2107.","cites":null},{"id":17284993,"title":"Our Ecological Footprint: Reducing Human Impact on the Earth. New Society Publishers,","authors":[],"date":"1996","doi":null,"raw":"Wackernagel, M., and W. E. Rees. 1996. Our Ecological Footprint: Reducing Human Impact on the Earth. New Society Publishers, Gabriola Island, BC.","cites":null},{"id":17284990,"title":"Phasing Lead out of Gasoline: An Examination of Policy Approaches in Different Countries.","authors":[],"date":"1999","doi":null,"raw":"UNEP. 1999. Phasing Lead out of Gasoline: An Examination of Policy Approaches in Different Countries. U. N. E. Program.  http:\/\/www.uneptie.org\/energy\/act\/tp\/ldgas\/index.htm.","cites":null},{"id":17284958,"title":"Primary energy and greenhouse gases embodied in Australian final consumption: an input-output analysis.","authors":[],"date":"1998","doi":"10.1016\/s0301-4215(98)00012-3","raw":"Lenzen, M. 1998. Primary energy and greenhouse gases embodied in Australian final consumption: an input-output analysis. Energy Policy 26:495-506.","cites":null},{"id":17284947,"title":"Reexamining the empirical evidence for an environmental Kuznets curve.","authors":[],"date":"2002","doi":"10.3386\/w7711","raw":"Harbaugh, W. T., A. Levinson, and D. M. Wilson. 2002. Reexamining the empirical evidence for an environmental Kuznets curve. The Review of Economics and Statistics 84:541-551.","cites":null},{"id":17284944,"title":"Streamlined Life-Cycle Assessment. Prentice Hall, Upper Saddle River,","authors":[],"date":"1998","doi":null,"raw":"Graedel, T. E. 1998. Streamlined Life-Cycle Assessment. Prentice Hall, Upper Saddle River, NJ.","cites":null},{"id":17284975,"title":"The EKC hypothesis does not hold for direct material flows: Environmental Kuznets Curve hypothesis tests for direct material flows in five industrial countries. Population and Environment","authors":[],"date":"2001","doi":null,"raw":"Seppälä, T., T. Haukioji, and J. Kaivo-oja. 2001. The EKC hypothesis does not hold for direct material flows: Environmental Kuznets Curve hypothesis tests for direct material flows in five industrial countries. Population and Environment 23:217-238.","cites":null},{"id":17284983,"title":"The embodiment of carbon associated with Brazilian imports and exports. Energy Conserv.","authors":[],"date":"1996","doi":"10.1016\/0196-8904(95)00283-9","raw":"Shaeffer, R., and A. L. de Sa. 1996. The embodiment of carbon associated with Brazilian imports and exports. Energy Conserv. Mgmt 32:955-960.","cites":null},{"id":17284994,"title":"The embodiment of carbon in imports of manufactured products: Implications for international agreements on greenhouse gas emissions.","authors":[],"date":"1994","doi":"10.1016\/0301-4215(94)90158-9","raw":"Wyckoff, A. W., and J. M. Roop. 1994. The embodiment of carbon in imports of manufactured products: Implications for international agreements on greenhouse gas emissions. Energy Policy 22:187-194.","cites":null},{"id":17284971,"title":"The environment, carrying capacity and economic growth.","authors":[],"date":"1996","doi":"10.2307\/2269541","raw":"Schindler, D. W. 1996. The environment, carrying capacity and economic growth. Ecological Applications 6.","cites":null},{"id":17284985,"title":"The environmental Kuznets curve: a methodological artifact? Population and Environment","authors":[],"date":"2001","doi":null,"raw":"Spangenberg, J. H. 2001. The environmental Kuznets curve: a methodological artifact? Population and Environment 23:175-191.","cites":null},{"id":17284914,"title":"The environmental Kuznets curve: an empirical analysis.","authors":[],"date":"1997","doi":"10.1017\/s1355770x97000211","raw":"Cole, M. A., A. J. Rayner, and J. M. Bates. 1997. The environmental Kuznets curve: an empirical analysis. Environment and Development Economics 2:401-416.","cites":null},{"id":17284894,"title":"The pollution terms of trade.","authors":[],"date":"1996","doi":"10.1080\/09535319600000027","raw":"Antweiler, W. 1996. The pollution terms of trade. Economic Systems Research 8:361-365. Antweiler, W., B. R. Copeland, and M. S. Taylor. 2001. Is free trade good for the environment? American Economic Review 91:877-908.","cites":null},{"id":17284910,"title":"Trade, the pollution haven hypothesis and the environmental Kuznets curve: examining the linkages.","authors":[],"date":"2004","doi":"10.1016\/j.ecolecon.2003.09.007","raw":"Cole, M. A. 2004a. Trade, the pollution haven hypothesis and the environmental Kuznets curve: examining the linkages. Ecological Economics 48:71-81.","cites":null},{"id":17284992,"title":"Trading Up: Consumer and Environmental Regulation in a Global Economy.","authors":[],"date":"1995","doi":"10.2307\/20047393","raw":"Vogel, D. 1995. Trading Up: Consumer and Environmental Regulation in a Global Economy. Harvard University Press, Cambridge, MA.","cites":null},{"id":17284991,"title":"UNEP\/SETAC Life-cycle Initiative.","authors":[],"date":"2004","doi":"10.1065\/lca2007.10.363","raw":"UNEP. 2004. UNEP\/SETAC Life-cycle Initiative. U. N. E. Programme.","cites":null},{"id":17284912,"title":"US environmental load displacement: examining consumption, regulations and the role of NAFTA.","authors":[],"date":"2004","doi":"10.1016\/j.ecolecon.2003.10.016","raw":"Cole, M. A. 2004b. US environmental load displacement: examining consumption, regulations and the role of NAFTA. Ecological Economics 48:439-450.","cites":null},{"id":17284967,"title":"Waste Trading among Rich Nations: Building a New Theory of Environmental Regulation.","authors":[],"date":"2000","doi":"10.1162\/glep.2002.2.1.122","raw":"O'Neill, K. 2000. Waste Trading among Rich Nations: Building a New Theory of Environmental Regulation. MIT Press, Cambridge.","cites":null},{"id":17284921,"title":"What environmental pressures are a region's industries responsible for? A method of analysis with descriptive indices and input-output models.","authors":[],"date":"1999","doi":"10.1016\/s0921-8009(98)00092-5","raw":"Eder, P., and M. Narodoslawsky. 1999. What environmental pressures are a region's industries responsible for? A method of analysis with descriptive indices and input-output models. Ecological Economics 29:359-374.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-08-01","abstract":"This research quantifies the extent to which the US has shifted the environmental impact associated with the goods it consumes to other countries through trade. To achieve this, we use a life-cycle, consumption-based approach to measure the environmental impacts embodied in US trade activities for global warming potential (GWP), energy, toxics, and the criteria air pollutants. We use these values to determine the amount of environmental impact “leaked” from current, production-based approaches to analyzing national environmental trends for the years 1998–2004. We find that in 2004, with reasonable assumptions about the environmental intensity of imports and exports, this leakage exceeds 10% for all studied impacts, exceeds 20% for GWP, energy, and most criteria air pollutants, and exceeds 80% for lead emissions and toxics. By including the environmental impacts embodied in trade activities into national environmental accounts, we provide consumption-based, US per capita, environmental impacts, which we use to evaluate the relationship between income and environmental impact. We find evidence for rising per capita environmental impacts over time in the US, contra the Environmental Kuznets Curve. The paper concludes with a discussion of the implications for international environmental policy of increasing embodied emissions in trade","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96335.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/29716\/1\/Trading_away_damage_%28LSERO%29.pdf","pdfHashValue":"961b0fb3c886cbf735715f5608efee6cee1d68e2","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:29716<\/identifier><datestamp>\n      2010-10-31T15:38:43Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4759<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/29716\/<\/dc:relation><dc:title>\n        Trading away damage: quantifying environmental leakage through consumption-based, life-cycle analysis<\/dc:title><dc:creator>\n        Ghertner, D. Asher<\/dc:creator><dc:creator>\n        Fripp, Matthias<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:description>\n        This research quantifies the extent to which the US has shifted the environmental impact associated with the goods it consumes to other countries through trade. To achieve this, we use a life-cycle, consumption-based approach to measure the environmental impacts embodied in US trade activities for global warming potential (GWP), energy, toxics, and the criteria air pollutants. We use these values to determine the amount of environmental impact “leaked” from current, production-based approaches to analyzing national environmental trends for the years 1998–2004. We find that in 2004, with reasonable assumptions about the environmental intensity of imports and exports, this leakage exceeds 10% for all studied impacts, exceeds 20% for GWP, energy, and most criteria air pollutants, and exceeds 80% for lead emissions and toxics. By including the environmental impacts embodied in trade activities into national environmental accounts, we provide consumption-based, US per capita, environmental impacts, which we use to evaluate the relationship between income and environmental impact. We find evidence for rising per capita environmental impacts over time in the US, contra the Environmental Kuznets Curve. The paper concludes with a discussion of the implications for international environmental policy of increasing embodied emissions in trade.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2007-08-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/29716\/1\/Trading_away_damage_%28LSERO%29.pdf<\/dc:identifier><dc:identifier>\n          Ghertner, D. Asher and Fripp, Matthias  (2007) Trading away damage: quantifying environmental leakage through consumption-based, life-cycle analysis.  Ecological Economics, 63 (2-3).  pp. 563-577.  ISSN 0921-8009     <\/dc:identifier><dc:relation>\n        http:\/\/www.elsevier.com\/wps\/find\/journaldescription.cws_home\/503305\/description#description<\/dc:relation><dc:relation>\n        10.1016\/j.ecolecon.2006.12.010<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/29716\/","http:\/\/www.elsevier.com\/wps\/find\/journaldescription.cws_home\/503305\/description#description","10.1016\/j.ecolecon.2006.12.010"],"year":2007,"topics":["GE Environmental Sciences"],"subject":["Article","PeerReviewed"],"fullText":"  \nD. Asher Ghertner & Matthias Fripp \nTrading away damage: quantifying \nenvironmental leakage through \nconsumption-based, life-cycle analysis \n \nArticle (Accepted version) \n(Refereed) \nOriginal citation: \nGhertner, D. Asher and Fripp, Matthias (2007) Trading away damage: quantifying environmental \nleakage through consumption-based, life-cycle analysis. Ecological economics, 63 (2-3). pp. \n563-577.  \n \nDOI: 10.1016\/j.ecolecon.2006.12.010\n \n© 2007 Elsevier\n \nThis version available at: http:\/\/eprints.lse.ac.uk\/29716\/\n \nAvailable in LSE Research Online: October 2010 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n 1\nTrading Away Damage: Quantifying Environmental Leakage through Consumption-based, Life-\ncycle Analysis \n \nAbstract \nThis research quantifies the extent to which the US has shifted the environmental impact \nassociated with the goods it consumes to other countries through trade. To achieve this, we use a \nlife-cycle, consumption-based approach to measure the environmental impacts embodied in US \ntrade activities for global warming potential (GWP), energy, toxics, and the criteria air pollutants. \nWe use these values to determine the amount of environmental impact “leaked” from current, \nproduction-based approaches to analyzing national environmental trends for the years 1998-2004. \nWe find that with reasonable assumptions about the environmental intensity of imports and \nexports, this leakage exceeds 10% for all studied impacts, exceeds 25% for GWP, energy, and \nmost criteria air pollutants, and exceeds 80% for lead emissions and toxics. By including the \nenvironmental impacts embodied in trade activities into national environmental accounts, we \nprovide consumption-based, US per capita, environmental impacts, which we use to evaluate the \nrelationship between income and environmental impact. We find evidence for rising per capita \nenvironmental impacts with rising income in the US, contra the Environmental Kuznets Curve. \nThe paper concludes with a discussion of the implications for international environmental policy \nof increasing embodied emissions in trade.  \n \nKeywords: input-output analysis, life cycle assessment, environmental leakage, environmental \nterms of trade, industrial outsourcing, climate policy \n \nI. Introduction \nThe relationship between environmental quality and trade has become a topic of \nwidespread interest since the early 1990s. The ability of wealthy countries to export \nenvironmental damage via direct trade in pollution (e.g. hazardous waste) is one well-understood \n \n 2\nprocess of environmental deintensification. Research has focused less on the environmental \nimpacts embodied in traded goods or on how environmental damage is externalized through the \noutsourcing of environmentally intensive production processes. Because wealthy countries are \nincreasingly importing goods with embodied environmental impact instead of producing them \ndomestically (Streets et al. 2006), they are able to unlink production and consumption. This has \nbeen little studied in environmental trends analysis to date, but has important implications for the \nsuccess of future international environmental treaties and conventions. This research quantifies \nthe extent to which the US has shifted the environmental impact associated with the goods it \nconsumes to other countries through trade. \nThe starting point for this study is the recognition of a shortcoming in the ways in which \nthe economy and the environment are measured in national environmental trends analysis. \nCurrent approaches are typically based on a comparison between national environmental \naccounts and gross domestic product (GDP). This method has been called a “production-based \napproach” because it uses national environmental accounts to quantify the environmental impact \nof production activities without differentiating between goods produced for domestic versus \ninternational consumption. These accounts are then compared to GDP to calculate environmental \nintensity, which is reported as gross environmental impact of a given type per unit of generated \nGDP.  But national environmental accounts show an incomplete picture of the emissions that can \nbe attributed to the US economy. A significant quantity of goods are produced outside of US \nborders, and then imported to satisfy US demand, or produced in the US and sent abroad to \nsatisfy the demand of our trading partners. However, current environmental indicators do not \naccount for environmental impacts embodied in traded goods. This paper sets out to consider the \n \n 3\nlimitations of such a production-based approach to environmental indicators for the analysis of \nUS environmental trends.  \nTo measure the full environmental impacts associated with US expenditure requires a \nconsumption-based approach with particular attention to international trade (Rothman 1998). \nThis research adopts such an approach using economic input-output life cycle assessment (EIO-\nLCA) for four categories of environmental impact: global warming potential, energy use, toxic \nrelease, and the criteria air pollutants (carbon monoxide, particulate matter < 10μm, sulphur \ndioxide, nitrogen oxides, lead, and volatile organic compounds). While recent studies have \nattempted to advance consumption-based approaches to environmental indicators, they are either \nbased on a small subset of economic sectors (Wyckoff and Roop 1994, Janicke et al. 1997, Cole \n2004a), lack comprehensive data for the economy under study (Rothman 1998), or examine only \none environmental impact (Suri and Chapman 1998, Antweiler et al. 2001, Ferng 2003). The few \nstudies that have analyzed trade and environment relations at an aggregate level for the entire US \neconomy have not used a life-cycle approach (Antweiler 1996, Atkinson and Hamilton 1996, \nMuradian et al. 2002, Cole 2004b), which the present study provides.  \nThe coupling of EIO-LCA with US trade data provides a novel approach to analyzing the \naggregate US balance of environmental impacts embodied in traded goods and services. While \nmost studies of the relationship between trade and environmental impact, especially those \nexamining the Environmental Kuznets Curve (EKC) hypothesis, are modeled econometric \nstudies based on cross-country, time-series data (see Grossman and Krueger 1992, Seldon and \nSong 1994, Shafik 1994, Cole et al. 1997, Spangenberg 2001), this study takes a different \napproach. EIO-LCA advances current understandings of trade and the environment not by \nexploring new relationships between regulation and the environment or by including new \n \n 4\ndependent variables, but rather by providing a more comprehensive approach to using existing \ndata for the study of environmental trends. \nThe goal of this work is twofold. First, it quantifies the difference between environmental \nimpacts under a consumption-based and a production-based approach to national environmental \naccounting for the US economy from 1998 to 2004. This difference is the quantity of \nenvironmental impact not accounted for in production-based approaches and represents the net \nenvironmental impact embodied in traded goods and services, which has been described as the \nbalance of embodied emissions in trade (BEET) (Muradian et al. 2002). In other words, BEET is \nthe environmental impact that has “leaked” from current production-based methods of assessing \nenvironmental impact. This study quantifies the leakage from US environmental accounts for the \nfour abovementioned environmental impacts. Second, this research compares national \nenvironmental intensities under production- versus consumption-based approaches to \nenvironmental accounting. It leverages these numbers into an evaluation of the empirical \nveracity of the EKC for the US economy.  \nThis paper is organized as follows. Section II discusses the relationship between trade \nand the environment, largely through a review of EKC studies, and how an EIO-LCA, \nconsumption-based approach provides a useful way to evaluate this relationship. Section III \ndescribes this study’s basic methodology. In section IV, we describe the calculation of BEET \nalong with the paper’s primary results. These include the US BEET, leakage percentages, and \naggregate, consumption-based US environmental intensities for each environmental impact. \nSection V disaggregates three different effects that contribute to leakage from the production-\nbased national environmental accounts. Section VI uses the results from a parametric analysis to \nconsider variations in aggregate US environmental intensity given differences in the relative \n \n 5\nintensity of imports and exports. Section VII concludes by exploring the implications of the \nresults from Sections IV and VI for environmental policy and regulation. \n \nII. Trade, Environment and EKCs \n \nIn the early 1990s several authors hypothesized an Environmental Kuznets Curve1 (EKC) \nto describe the relationship between environmental quality and economic growth (see Grossman \nand Krueger, 1992 and Shafik, 1994). The EKC is an inverted “U-shaped” curve displaying a \nhistorical relationship, usually based on empirical studies of urban emission levels in the US or \nEurope (see Seldon and Song 1994, Grossman and Krueger 1995, Harbaugh et al. 2002), \nwhereby emissions increase with national income before reaching a turning point at which \nemissions decrease as economic growth continues. The Y-axis in longitudinal EKC studies was \noriginally in units of concentration or per capita emissions, and the X-axis in GDP or time units.  \nThe EKC has always been controversial, resulting in quantitative analysis in the North2 \nto determine its validity across different environmental indicators (Grossman and Krueger 1995, \nCole et al. 1997). It is generally found that the EKC accurately represents historical trends for \nthese countries for certain indicators (urban air pollutants, sanitation, access to clean water) and \nnot others (municipal waste, carbon dioxide emissions, direct material flows) (Shafik 1994, \nSeppälä et al. 2001).3 The EKC is putatively explained by economic theory, which states that the \nratio of marginal utility of a unit of environmental quality to the marginal utility of a unit of \nincome is low in early stages of development, but increases as countries become wealthier \n                                                 \n1 The EKC is named after the better-known Kuznets Curve, which describes a similar relationship between income \ninequality and economic growth (Kuznets 1955). \n2 “North” and “South” refer to industrialized and industrializing countries, respectively. \n3 Harbaugh et al. (2002) find, however, that the EKC does not hold for urban air pollutants upon “merely cleaning \nup the data, or including newly available observations.” \n \n 6\n(Hettige et al. 1997). A policy implication commonly extracted from this observation is that \ngrowth will lead to an improved environment and growth, thus, should be promoted in the \ninterest of the environment (Beckermann 1992).  \nNumerous studies have been conducted since 1995 debunking the EKC (see Arrow et al. \n1995, Farber 1995, Grossman and Krueger 1995, Lash 1995, Daily et al. 1996, Karr and Thomas \n1996, Schindler 1996). Despite most criticisms, “the current debate is less on the validity of [the \nEKC] than on its interpretation” (Sprangenberg, 2001: 176). Thus, the general “inverted-U” \nrelationship remains at least a frame of reference for time-series, if not cross-sectional, data \nagainst which the paths of environment and development relations for many countries are \ncompared (see Lopez and Mitra 2000). \nMost studies of the EKC share the limitation described in this paper’s introduction: they \nlook only at production within a country’s borders and ignore international production to satisfy \ndomestic demand. This means that the EKC is often explained in terms of improved production \nefficiency (see Grossman, 1995, Panayotou, 1993) without discerning the relative contribution to \ndecreased pollution levels due to technological change versus the outsourcing of environmental \nimpact via trade (Rothman, 1998).  \nEvidence increasingly suggests that, indeed, structural changes in the sectoral \ncomposition of domestic production and trade (without concomitant changes toward less \nenvironmentally intensive consumption) are driving reductions in production-based \nenvironmental intensities in industrialized countries (Suri and Chapman 1998, Fischer-Kowalski \nand Amann 2001, Cole 2004b, Rhee and Chung 2006). This is explained by two different \ndimensions of what is typically referred to as industrial outsourcing: an increasing percentage of \nintermediate inputs being imported rather than domestically produced (Jacobsen 2000), which \n \n 7\nreduces the material and energy demand of domestic production, and the shifting of the \nproduction of environmentally intensive consumer goods outside of US borders (Suri and \nChapman 1998). Production-based analyses of environmental trends treat industrial outsourcing \nin the North as a net reduction in environmental impact from national accounts. The flip side of \nindustrial outsourcing is the increase in the environmental burden in the South for goods \nproduced to meet Northern demand.4 This increase in environmental impact has been called \ndisplaced environmental load, or leakage.  \nThis work sets out to quantify the US economy’s displaced environmental load, measured \nby BEET, and to continue the evaluation of the EKC as an observable environmental \nphenomenon. Rather than testing the applicability of the “inverted U-shape” to the South, we \nreturn to the question of the validity of such a curve in representing US environmental trends. \nThe EKC predicts a gradual departure from environmental concerns in wealthy countries. As \ncountries get wealthier, the curve asymptotes to low pollution levels, suggesting that those \ncountries are permanently clean. This study explores what can be called “late curve analytics.” \nThat is, how new patterns in trade and industrial outsourcing in the North, which is presented at \nthe tail end of the EKC for most pollutants, may result in environmental impacts that look \ndifferent than the EKC suggests. In particular, there might be an upward sloping tail at the \nbottom of the downward sloping segment of the EKC that has not yet been sufficiently examined \nor theorized. We thus hypothesize that the environmental intensities of wealthy countries could \nincrease with wealth and\/or time, contra the EKC. This study pursues such a project by \nimproving on previous macro studies of environmental trends in three ways, described in turn in \nthe next three sub-sections. \n                                                 \n4 For example, Streets et al. (2006), using a regional atmospheric air transport model, show that 5-30% of ambient \nair pollutant concentrations in the Pearl River Delta of China are caused by the production of goods for export.  \n \n 8\n \n2.1 Consumption-based approach \nThe distinction between production- and consumption-based approaches does not lie in \nthe location of environmental impact within a product’s life-cycle (production phase versus use \nphase or end-of-life), but rather in the question of to whom the environmental damage is \nattributed. The “consumption-based” approach is a framework for attributing the environmental \nimpacts of production activities on the basis of who consumes the product. This limited \ndefinition of “consumption-based” is used because environmental impacts associated with \nconsumption activities—the use and post-use stages of a product’s life-cycle—are already \nattributed to the country in which consumption takes place in current environmental accounts.5 \nThe macro, consumption-based approach used here accounts for the environmental impacts \nembodied in the production of goods for consumption. It focuses on the distribution of \nenvironmental impacts across countries based on the location of the consumer and assumes that \nconsumers bear the full responsibility for the impacts of producing the goods they consume.  \nTo quantify the total environmental impacts of US consumptive activities, we must \nmeasure the international allocation of environmental impacts. By including pollution that is \nattributable to products used to satiate US consumer demand into environmental accounting, we \nmore accurately represent US environmental impacts on a global scale (Muradian et al. 2002). \nExisting consumption-based approaches to environmental trends analysis that make use of \nenvironmental intensity use GDP as the metric for the economy, even though it is a production-\nbased measure (see Rothman 1998). This approach uses GDP as a proxy for purchasing power or \n                                                 \n5 For recent uses of LCA to examine the micro dimensions of consumption, see the reviews by Hertwich (2005) and \nTukker and Jansen (2006). \n \n 9\nconsumptive expenditure, a simplification which we also follow. According to this convention, \npurchasing power determines the environmental impact of a country’s economy.6  \n \n2.2 Including trade \nMost studies of environment and trade have a thin conception of the relationship between \nthe two. They either (a) focus solely on how open trade changes environmental regulations or \nproduction processes in a country, without emphasis on trade in environmental impact (Vogel \n1995, Antweiler et al. 2001), or (b) consider trade in environmental impact only to the extent that \nactual resources or pollutants are themselves traded (e.g. hazardous materials) (O'Neill 2000). \nFew studies account for environmental impact embodied in trade, which is the present study’s \nsecond improvement over the production-based approach.  \nMost EKC studies, in particular, do not adequately address the issue of trade (Rothman \n1998). These studies use an international normative framework; that is, the EKC is used to make \nstatements about the course that international economic development should take. However, the \nexplanatory framework for environmental impact has system boundaries confined to the national \nscale. Thus, the policy recommendation stemming from the EKC is to promote growth, often \nthrough open trade. However, the framework provided for explaining the condition of the \nenvironment fails to consider the possibility that domestic environmental impact is associated \nwith international trade.  \nIn order to maintain credibility in analyses of contemporary environmental trends in the \ncontext of economies with high levels of trade, these normative and explanatory frameworks \nmust be reconciled. Doing so requires explicit accounting of the environmental impacts \n                                                 \n6 Using the same denominator (GDP) when calculating both consumption- and production-based environmental \nintensities also allows for a more direct comparison of these intensities. In particular, the scale effect (extra pollution \nabroad due to the US trade deficit) is only apparent when both intensities use the same denominator. \n \n 10\nembodied in international trade, because only then can environmental analysis account for the \ngeographical delinking of production and consumption activities. However, not all consumption-\nbased approaches explicitly include international economic flows (see Gawande et al. 2001). The \npresent study does so by quantifying the pollution embodied in goods imported to the US. This \nallows us to evaluate the extent of leakage from national environmental accounts.  \n \n2.3 EIO-LCA \nEnvironmental impacts embodied in trade have been included in a select few analyses of \nUS environmental trends (see Antweiler 1996, Atkinson and Hamilton 1996, Muradian et al. \n2002, Cole 2004b). These studies use the composition of trade to determine the distribution of \npollution and resource use between countries. However, the depth of impacts included in these \nstudies only includes those that arise from the final stage of production of the good or service, \nnot the good or service’s full production life-cycle, which includes the environmental impacts of \nall intermediate inputs as well as the inputs into those intermediate inputs.  \nQuantifying the full impact of a good or service requires rigorous empirical data \ncollection. Such data do not exist on the scale of the global economy. To address this data \ndeficiency, many have turned to aggregate measures of environmental impact, including the \n“ecological footprint” (Wackernagel and Rees 1996), material flows analysis (Seppälä et al. \n2001), and environmental space (Spangenberg 2001). Alternatively, input-output analysis has \nbeen implemented to examine energy and pollution embodied in international trade (see Wyckoff \nand Roop 1994, Battjes et al. 1998, Kondo et al. 1998, Lenzen 1998, Jacobsen 2000, Machado et \nal. 2001, Munksgaard and Pedersen 2001, Ferng 2003, Mongelli et al. 2006). Such analyses \nmake important contributions to the study of embodied environmental impact. But, while some \n \n 11\nof these studies do account for the life-cycle impact of production activities, they focus only on \ncarbon dioxide emissions and energy use and\/or are aggregated to a small set of economic \nsectors. This approach, furthermore, has yet to be applied to EKC analysis and has been applied \nonly to a limited extent in examining the US economy. We build on these studies, with particular \nattention to the EKC hypothesis and the US economy. We do so through LCA of sixty-five \naggregated sectors of the US economy. \nLCA has increasingly been recognized as the most robust method for accounting for the \nresource flows associated with products and services (Graedel 1998, UNEP 2004). Process-based \nLCA has been the most widely used method of LCA to date. Traditionally based on analyzing \nthe environmental impacts of a particular process or production stage (e.g. a manufacturing unit), \nthis approach draws arbitrary system boundaries that often extend only to direct suppliers and not \nthe full supply chain inputs (Curran 1993). This leads to direct input analysis, a simplification of \nthe full life-cycle of production (Hendrickson et al. 1998).  \nAn Economic Input-Output LCA (EIO-LCA) model has recently been developed that \nuses a system boundary that includes the entire US economy, thus avoiding the simplified \ntreatment of the supply chain required in process-based LCA (Hendrickson et al. 1998, \nHendrickson et al. 2006). This model uses an input-output model of the entire economy to \nidentify all economic activity required directly or indirectly to produce a set of commodities. \nThen, a table of environmental intensities for each type of production activity is used to calculate \nthe complete life-cycle impact of the final commodities. This model can be distilled down to a \nlist of life-cycle environmental intensities for each commodity produced by the economy, for \neach of the environmental impacts examined in this study. Our general approach in the present \nstudy is to apply these sectoral environmental intensities, which are described more fully in the \n \n 12\nnext section, to sector-wise data on US imports and exports. This yields the total life-cycle \nenvironmental impact embodied in US imports and exports, as well as the balance of embodied \nemissions in trade (BEET). We repeat this calculation for seven different years (1998-2004) and \nexamine how BEET changes with time. This procedure and the results for BEET are shown in \nSection IV, but first, in Section III we describe the details of the EIO-LCA model and how we \nuse it to assess macroeconomic emission trends. \n \nIII. Method \nIn EIO-LCA, the supply chain is modeled using a general equilibrium economic input-\noutput (EIO) model (Leontief 1986). Industries or commodities making up the economy are \ndivided into a number of separate sectors. Then a “direct requirements” matrix is built for the \nwhole economy, showing the inputs that any sector of the economy requires from all other \nsectors to produce a unit of output. The EIO modeling approach operates on the assumption that \nincreasing the output from any sector requires a proportional increase in each input received by \nthat sector from all other sectors. Following this assumption, the direct requirements matrix is \ntransformed algebraically into a “total requirements” matrix, which shows the total amount of \nboth direct and indirect inputs that are required from all sectors of the economy to produce a \ndollar of final output from a given sector  (Hendrickson et al. 1998, Guo et al. 2002). This matrix \ncan then be used to estimate the gross output induced in every sector of the economy to supply \nany set of final outputs. The EIO-LCA model then uses a table of environmental intensities for \neach industrial sector to calculate the total environmental impact associated with the specified set \nof final outputs.  \n \n 13\nWe have adapted the EIO-LCA method described by Hendrickson et al. (1998, 2006) to \nanalyze the life-cycle environmental impacts of U.S. trade over a multi-year period. Our model’s \nbasic equation for each type of environmental impact in each year, due to the production of a \ngiven set of final outputs, is given by: \ne = iRDTf (1) \nHere, e shows the total environmental impact created when the economy meets the final \ndemands f. T is the total requirements matrix; D is a diagonal matrix of price deflators; R shows \nthe environmental impact per dollar of gross output from each industrial sector; and i is a \nsummation vector. These terms are described in more detail in the following paragraphs. \nIn this model, the vector f has elements for each commodity produced by the economy. \nPrevious EIO-LCA research (e.g. Horvath and Hendrickson 1998, Facanha and Horvath 2006, \nNorman et al. 2006) has filled this vector based on the commodities needed to complete a single \nproject or create a single product. For our research, we fill the f vector with macroeconomic data, \nsuch as the total output of each commodity that makes up GDP, or the total value of each \ncommodity imported to the US in a given year.  \nThe U.S. Bureau of Economic Analysis (BEA) publishes 491-sector total requirements \nmatrices (T) for the U.S. economy every 5 years (BEA 1997), and 65-sector matrices every year \n(BEA 2006b). In order to perform multi-year analysis, we use the BEA’s annual 65-sector \nindustry-by-commodity total requirements matrices for 1998–2004.7 This allows us to account \nfor changes in the scale and composition of the US economy over time, but comes at the cost of \nreduced sectoral resolution.  \n                                                 \n7 The BEA defines this matrix as T = W(I-BW)-1, where W is an industry-by-commodity matrix showing the \nproportions of each commodity produced by each industry, and B is a commodity-by-industry matrix showing the \ndirect inputs of each commodity required to produce a dollar of output from each industry (BEA 2006b). \n \n 14\nThe diagonal matrix D holds price deflators to convert gross output from current-year \ndollars to the equivalent gross output in 1997 dollars. It contains one element for each industry, \nand there are separate D matricesfor each year. For each year y, the deflator for industry k is \ndefined as Dk ≡ pk,1997 \/ pk,y, where pk,y is the gross output price index published by the BEA for \nindustry k in year y (BEA 2006a). \nR is a diagonal matrix showing the environmental impact per dollar of gross output from \neach industrial sector. There are separate matrices for each type of environmental impact in the \nmodel. The R matrices in our model are based on equivalent matrices used in an on-line version \nof the EIO-LCA model hosted by the Green Design Institute (GDI) at Carnegie Mellon \nUniversity (Hendrickson et al. 2006). The GDI matrices are prepared at the 491-sector detailed \nlevel of resolution from vectors of total environmental impact at the same resolution. We created \n65-sector summary versions of R by summing environmental impacts across all the detailed \nsectors included within each summary sector, and then dividing by gross output at the summary \nlevel.  \nBecause environmental impact vectors are only available from GDI for 1997, we use the \n1997 coefficients for all study years. Thus, our results do not account for technological change \nthat might have occurred within industries between 1998 and 2004. While this is a lacuna, it is \nreasonable to assume that intra-sectoral environmental technology is constant relative to changes \nin the scale and composition effects for the short duration of study considered here.8\nWhen each R matrix is multiplied by the gross output (DTf) for any year, it yields a \nvector showing the total environmental impact generated in each industry in the course of \n                                                 \n8 It is generally assumed in the economic literature that the adoption of new environmental technologies is slow \nwithout environmental policy or regulation to induce technological change, or without significant reductions in cost \n(Jaffe et al. 2002, Taylor et al. 2005). There has been little positive inducement for the adoption of pollution \nabatement and energy efficient technologies in the U.S. between 1998 and 2004; and environmental technologies \nhave low learning rates, which implies their price has not significantly fallen (Rubin et al. 2004). \n \n 15\nproducing the final outputs f. For our purposes, it is more useful to know the total environmental \nimpact across all sectors. This total is found by use of a summation vector i (filled with 1’s). \nThen e is a single-element matrix showing the desired value, which we subsequently treat as a \nscalar value. \nTo simplify further discussion of this model, we introduce a row vector r ≡ iRDTr, with \none element for each final demand sector. Then Equation 1 becomes simply \ne = rf. (2) \nThe vector r encapsulates the key relationships of the EIO-LCA model: it shows the total, \neconomy-wide environmental impact induced directly and indirectly per unit of final demand for \neach commodity. The elements of these vectors can be thought of as the life-cycle environmental \nintensity for each type of commodity produced by the economy. The dot product of this vector \nand final demand (f) gives total environmental impact e. There are different r vectors for each \nyear and each category of environmental impact. \nReturning now to the discussion from the previous section on studying national \nenvironmental trends, recall that the production-based approach calculates the total \nenvironmental impact that falls inside US borders across years (the national environmental \naccounts), without accounting for environmental impact embodied in trade. In order to calculate \nthe production-based national environmental accounts using Equation 2, we populate the final \noutput vector (f) with the values of all the goods and services produced in the economy in a \ngiven year, broken down by commodity sector. In this case, the vector product of i and f equals \ntotal US GDP. We define this special case when final output equals the value of all commodities \nthat make up GDP as p so that we may conveniently refer to GDP in equation form later in the \npaper. We then calculate the production-based national environmental accounts (eprod) for each \n \n 16\nenvironmental impact, for each year using equation 2. Values for the production-based national \nenvironmental accounts are shown for 1998-2004 in Table 1.  \n \nIV. Calculating the Balance of Embodied Emissions in Trade \n \nThis section describes our method for calculating the balance of embodied emissions in \ntrade (BEET) for the US economy from 1998 to 2004 and presents the results of this calculation \nunder the assumption that commodities have the same environmental intensity whether they are \nproduced in the US or elsewhere.  \nIn Section III, we used the EIO-LCA model to calculate the production-based national \nenvironmental accounts (Table 1). These values serve as the baseline from which the shift to a \nconsumption-based approach will be compared. BEET represents the net leakage from this \nbaseline, or the amount of emissions attributable to US consumption that is not accounted for in \nproduction-based national environmental accounts. Combining BEET with this baseline provides \na consumption-based measure of total US environmental impact that includes impacts embodied \nin international trade. This is a step that has not been explicitly done before in a life-cycle sense \nfor the US.9  \nMuradian et al. (2002) define BEET as the embodied emissions in imports minus those in \nexports. Using Equation 2, the vector for final output (f) is expressed in terms of imports and \nexports, and we obtain \netrade = rmm – rxx. (3) \n                                                 \n9 For similar approaches applied for greenhouse gas emissions for Brazil, Italy and Japan and South Korea, \nrespectively, see Shaeffer and de Sa (1996), Mongelli et al. (2006), and Rhee and Cung (2006). \n \n 17\nHere, rx and rm are the life-cycle environmental intensities of all exported and imported \ncommodities, respectively, x and m are vectors showing U.S. exports and imports of each \ncommodity,10 and etrade gives the value of BEET. Because exports share the same production \nprocesses as the rest of U.S. goods and services, the environmental intensity of exports (rx) is \nequal to the environmental intensity of domestic production (r). A starting assumption for \nincluding imports into equation 3 is that of equal sectoral environmental intensity across \ncountries. This holds that the production of a unit of a given good leads to the same amount of \nenvironmental impact regardless of where that good is produced in the world. This assumption is \ncommonly made in international input-output analysis. Section VI modifies this assumption to \nconsider the implications for BEET of changing the relationship between import and export \nenvironmental intensities. For now, under the assumption of sectoral constancy, the \nenvironmental intensity of imports (rm) equals the environmental intensity of domestic \nproduction (r) and Equation 3 simplifies to \netrade = r[m –x]. (4) \nBecause BEET focuses on emissions and not energy or resource use, we expand BEET to \ninclude both emissions and energy use embodied in trade. To derive BEET for each of the \nenvironmental impacts under study (GWP, energy, TRI, carbon monoxide, particulate matter < \n10μm, sulphur dioxide, nitrogen oxides, lead), the trade deficit (m – x) for each economic sector \nwas multiplied by its corresponding EIO-LCA generated environmental intensity (r) for all \nenvironmental impacts for 1998-2004. Table 2 shows the net BEET for the US economy.  \n                                                 \n10 The values of x and m are taken from the columns labeled “Exports of goods and services” and “Imports of goods \nand services” in the BEA’s annual summary-level supplementary use tables (BEA 2006b). Values of m are \nconverted from negative to positive values for this paper. \n \n 18\nEnvironmental impacts for which the BEET is a net positive indicate cases where more \nenvironmental impact is associated with US imports than exports and are thus impacts that have \na positive environmental leakage. This corresponds to what we will call “exported environmental \nimpact” or “displaced environmental load” because US consumption creates more pollution than \nis released within the US alone. In this case, the production-based approach fails to account for \nthe pollution generated outside of US borders to fulfill the final US demand. Similarly, \nenvironmental impacts for which there is a negative BEET indicate cases where more \nenvironmental impact is associated with US exports than imports, which means that US \nconsumption causes less environmental impact than the quantity that falls within the US. The \ndata in Table 2 show that the US was a net exporter of all of the environmental impacts under \nstudy throughout the years of 1998-2004.11\n Upon inspecting the contribution of each of the 65 sectors under study to total BEET, we \nfound that BEET for all environmental impacts was highly concentrated in a handful of sectors. \nThe combined BEET of three sectors— primary metals; motor vehicles, bodies, trailers and \nparts; and oil and gas extraction—makes up more than 50% of the total US BEET for all study \nyears and environmental impacts. If we add the next three sectors that contribute most to \nBEET—apparel, leather and allied products; chemical products; and computer and electronic \nproducts—to the first three, their combined BEET equals more than 85% of total US BEET. The \nrank of these sectors vary across year and environmental impact, but taken together they are the \nlargest contributors to BEET. These sectors do not necessarily produce the most direct \nenvironmental impact; rather, the full supply-chain impacts for final goods from these sectors are \n                                                 \n11 It should be noted that TRI is an aggregate measure of all toxic releases and does not account for differences in \ntoxicity between substances. Therefore, the mix of toxic releases between 1998 and 2004 could be quite different \neven though the TRI value used in EIO-LCA makes no distinction.  \n \n \n 19\nthe greatest. \nAnother way to express BEET is in terms of percent leakage. Leakage is defined here as \nthe percentage increase in environmental impact (or environmental intensity) upon the inclusion \nof BEET: \nleakage = etrade\neprod\n. (5) \nTable 4 shows the results for leakage from production-based approaches to national \nenvironmental accounts. These data suggest that leakage was positive and increasing for all of \nthe environmental impacts considered here from 1998 to 2004, with the exception of CO, which \nshowed negligible increase.  \nLeakage has important implications for the accuracy of national environmental accounts. \nAll environmental indicators are simplified representations of real environmental impact. They \nthus inherently contain some percentage of leakage, or environmental impact that is either \novercounted or, more often, undercounted. Leakage can be based on definitional ambiguity, the \nuse of threshold values under which environmental reporting is not required (as in the TRI), \nfailure to account for all possible sources of environmental impact, or other factors. Although \nleakage is inevitable, not all forms of leakage are acceptable. Different environmental indicators \nhave different goals and priorities that require different levels of accuracy. For instance, for \nnational greenhouse gas (GHG) inventories, a single percentage of leakage could make a large \ndifference for climate policy, since ongoing policy discussions focus on emission reductions in \nthe range of 10% of the national total. For measures like the TRI, for which industries are only \nrequired to report if they use more than 10,000 lbs of any single listed chemical, 1% additional \nleakage relative to existing accounts may be less significant.  \n \n 20\nThe values presented in Table 4 show that percent leakage increases considerably over \ntime for most of the impacts, with GWP doubling from 4% in 1998 to 8% in 2004, TRI tripling \nfrom 5% to 15%, lead rising from 19% to 29%, and PM10 more than doubling from 3% to 7%.  \n \nV. Resolving leakage into individual effects \n \nThis section defines different contributing effects to environmental leakage and uses \nequations expressed in terms of these effects to explain the behavior of environmental leakage. \nOne way to examine the relationship between trade and leakage is through a measure of the scale \neffect of trade, which quantifies the extent to which trade increases consumption relative to \nproduction. Table 5 shows the trade deficit as a percentage of GDP from 1998 to 2004, one \nmeasure of the scale effect. It shows that the scale of trade has been increasing steadily since \n1998, with a slight dip in 2001. The increased leakage between 1998 and 2004 shown in Table 4 \nsuggests that as the trade deficit increases relative to GDP, leakage from a production-based \napproach to environmental indicators will also increase. This makes sense given that the trade \ndeficit represents the value of traded goods accounted for by a consumption-based approach to \nenvironmental impact but left out of production-based approaches.  \nBased on the scale effect alone, it is clear that production-based approaches to \nenvironmental trends have historically had relatively low leakage because production and \nconsumption were closely coupled (low absolute balance of trade). However, as trade deficits \nrise as a percentage of GDP, we would expect leakage to also rise. Indeed, the first quarter of the \n21st century is widely projected to see a steady rise in the US trade imbalance. A major caveat to \nprojecting the relationship between trade and leakage into the future is that the trade numbers in \n \n 21\nTable 5 do not account in any way for the composition of traded goods. This is demonstrated in \nTable 4 by the variation in the leakage trends for each environmental impact. For example, \nleakage of CO does not rise over the study years, despite an intensifying scale effect. Similarly, \nthe fact that the percent leakage for TRI is much greater than the trade deficit as a percentage of \nGDP suggests the importance of examining the composition of international trade.  \nTo determine how the composition of US trade affects leakage, we now examine the \nrelationship between the environmental intensities of sectors from which we are net exporters \nversus net importers. The relationship between these intensities is shown by the international \nterms of trade on environmental impact, or the environmental terms of trade (Antweiler 1996), \nwhich is calculated by dividing the average environmental intensity of exports by the average \nenvironmental intensity for imports: \nτ = rx\nrm\n,          (6) \nwhere rx and rm are the average environmental intensities for all exported and imported products, \nrespectively. The average environmental intensity of exports is calculated as:  \nrx = exx =\nrxx\nix\n. (7) \nHere, ex is the total environmental impact associated with exported commodities, and x is the \ntotal economic value of exports from the U.S. We calculate ex from the vector of exported \ncommodities x using the standard EIO-LCA approach in Equation 2, and the scalar x is the \nsimple sum of the exported commodities in the vector x. A similar formulation was used for the \naverage environmental intensity of imports (rm). These calculations were repeated for each type \nof environmental impact, for each year of analysis. \n \n 22\nTable 6 shows the environmental terms of trade for the impacts evaluated in this study, \nunder the assumption of sectoral constancy.  \nValues for environmental terms of trade greater than one indicate that more \nenvironmental impact is embodied per dollar of revenue from exports than is embodied per \ndollar of expenditure on imports. More simply put, environmental terms of trade greater than one \nshow that US exports are more environmentally intensive (for the given impact) than imports. \nTable 6 shows that for all environmental impacts under study, with the exception of VOC and \nCO, the environmental terms of trade were less than one throughout 1998-2004.12 This confirms \nthe general assumption that the US imports more environmentally intensive goods than it exports. \nHowever, the fact that the terms of trade on VOC and CO are greater than one; and that the terms \nof trade for all environmental impacts, save TRI, increase from 1998-2004; suggest that this \ntrend may be reversing, rather than intensifying.  \nBeyond reflecting on broader macroeconomic trends in the environmental intensity of \ntrade, the environmental terms of trade (τ) can be used to explicitly compare the relative \ncontribution of the composition and scale effects to leakage (shown in Table 4). Using the \ndefinition of the environmental terms of trade in Equations 6 and 7, BEET (Equation 4) can be \nexpressed as \netrade = em − ex\n= rmm − rx x\n= rx 1τ m − x\n⎛ \n⎝ ⎜ \n⎞ \n⎠ ⎟ \n. (8) \nWe can then express leakage (Equation 5) as \n                                                 \n12 It is also interesting to note that environmental terms of trade are lowest for lead and SO2, which are the most \nstrictly regulated impacts studied here. \n \n 23\nleakage = etrade\neprod\n=\nrx\n1\nτ m − x\n⎛ \n⎝ ⎜ \n⎞ \n⎠ ⎟ \nrprod p\n=\n′ τ 1τ m − x\n⎛ \n⎝ ⎜ \n⎞ \n⎠ ⎟ \np\n, (9) \nwhere p indicates GDP, and we have introduced the variable ′ τ ≡ rx rprod , which compares the \naverage environmental intensity of US exports to the average intensity of all commodities \nproduced in the U.S.13 We call this term the relative environmental intensity of exports, which \nhas a unique value for each environmental impact and year.  \nBy inspection of Equation 9, it is apparent that low values of τ (environmental terms of \ntrade) would tend to lead to larger values for environmental leakage. For example, TRI has small \nvalues for the environmental terms of trade (τ) (see Table 6) and high leakage values (see Table 4) \ncompared to other environmental impacts. Equation 9 similarly suggests that for large τ values, \nleakage should be small or negative. However, this effect can be offset by a large trade \nimbalance. For example, VOC has high τ values (approximately 1.2–1.3) in all years, but leakage \nremains positive. This is because the ratio of imports to exports (m\/x, Table 5) remains even \nhigher than the environmental terms of trade during this period, so that the term in parentheses in \nEquation 9 always remains positive (m\/x > τ, so m\/τ – x = (x\/τ)(m\/x – τ) > 0). If the \nenvironmental terms of trade (τ) is near one, then leakage is proportional to the scale effect (m–\nx)\/p; if τ is less than one, then the composition effect enhances the scale effect and increases \nleakage above the τ = 1 case; and if τ is greater than one, then leakage is reduced from this level. \nAlthough the environmental terms of trade were greater than one and\/or rising for many \n                                                 \n13 Although we assume that each exported commodity has the same environmental intensity as other U.S. production \nof the same commodity (i.e., rx = r), this does not imply that the average intensity of all exported goods (rx) is equal \nto the average environmental intensity of all U.S. production (rprod), because exports have a different composition \nthan US production in general. \n \n 24\nenvironmental impacts in 1998-2004, the US trade deficit was so large in this period that the \nscale effect dominated over the environmental terms of trade, which suggests that leakage is \ndriven by the scale effect.  \nWe now turn our attention to the relative environmental intensity of exports (τ'), which \nshows the average environmental intensity of exports relative to the average intensity of the US \neconomy. If τ' and the environmental terms of trade (τ) were both one for any environmental \nimpact, then leakage would be governed directly by the scale effect, and leakage would be equal \nto the ratio of the trade deficit to US GDP (the fifth column of Table 5, also shown as (m–x)\/p in \nEquation 9). We find however that leakage is greater than this ratio in all cases, even above the \namount that can be explained by variations in the environmental terms of trade (τ). For example, \nPM10 has τ values close to one during the study years. However, PM10 has leakage values (2.6%-\n6.5%) for the study years that are nearly double the percent trade deficit (1.4%-4.5%). This effect \narises because the commodities exported by the U.S. are more intensive for all environmental \nimpacts, in all years, than US production in general. That is to say, the relative environmental \nintensity of exports (τ'), the values for which are shown in Table 7, is always greater than one.  \nBecause goods produced for export and for domestic consumption have the same \nenvironmental intensity at a sectoral level, the difference between the intensity of exports (rx) \nand the intensity of domestic production (rprod) is explained entirely by the composition of \nexported versus domestically consumed commodities. Table 8 allocates total US production and \ntotal exports in 2000 between nine coarse sectors. These data show that exports are \ndisproportionately composed of commodities produced in the manufacturing sector, which has \nenvironmental intensities much higher than the overall economy. This affirms the idea that \ntraded commodities, which are typically material goods, are more environmentally intensive than \n \n 25\ndomestically consumed commodities, which are composed of a higher percentage of services. \nThis suggests that environmental leakage will remain persistently higher than the trade deficit or \nenvironmental terms of trade (τ) alone would suggest. \n \nVI. Parametric Analysis of Import Intensities \n \nThe analysis up to this point has operated under the assumption that environmental \nintensity is the same for sectors within the US as for those same sectors outside of the US. This, \nhowever, is likely a poor assumption. The data requirements to precisely define the average \nenvironmental intensity for imports from all economic sectors are far too great given the limited \navailability of environmental intensities for most countries from which the US imports. A precise \nconsumption-based approach would require the environmental intensity and trade data for all \nsectors of all countries with which the US trades. This would require a massive disaggregation of \nforeign economic sectors including input-output tables and industry-based environmental \naccounts, which are unavailable.14  \nWhile sectoral constancy is likely not an accurate assumption for actual emission \noutcomes, it could be argued that the US should only be responsible for the amount of \nenvironmental impact that would have occurred had imported goods been produced at US \nenvironmental intensities. Such an argument would attribute to foreign producers environmental \nimpact embodied in imported goods above that which would have arisen had those goods been \nproduced at US environmental intensities. This framework for responsibility is represented by \nthe assumption of sectoral constancy.  \n                                                 \n14 Lenzen et al. (2004) recently advanced an intermediate approach of substituting reasonable CO2 intensities for the \nmost intensive commodities and trading countries that simplifies these data needs. \n \n 26\nThe question of how to define the relationship between import and export environmental \nintensities demonstrates the possibility for differences in how environmental responsibility is \ndefined vis-à-vis environmental impact. For instance, the current production-based approach \noperates under an implicit assumption of territorial responsibility, which attributes responsibility \nonly for direct emissions within political boundaries (Eder and Narodoslawsky 1999, Ferng \n2003). A range of different frameworks for responsibility have recently been suggested (see Eder \nand Narodoslawsky 1999, Munksgaard and Pedersen 2001, Ferng 2003). Selecting a framework \nfor environmental responsibility is an inherently political process. While LCA does not explicitly \ndefine a framework for environmental responsibility, it is defined as the analysis of the full \nenvironmental impacts associated with a product’s supply chain and, thus, is inherently a \nconsumption-based measure of environmental impact. To address the full environmental impact \nof products consumed in the US, regardless of how that impact is allocated in terms of \nresponsibility, requires considering the implications of variation in the relationship between \nenvironmental intensities for imports and exports (departing from the assumption of sectoral \nconstancy). This research leaves aside the question of how these impacts are or could be \ntranslated into environmental responsibility.   \nGiven the data limitations of a complete consumption-based approach, the next best step \nis to use parametric analysis to crudely assume that the environmental intensities for all \nimporting sectors are related to US domestic environmental intensities for the same sector by a \nmultiplicative factor. That is, for a given unit of output, imports are assumed to produce a \nquantity of environmental impact related to US impact by a linear multiplier (s). The multiplier s \ncan be related to the environmental terms of trade (τ) by \n \n 27\nτ = rx\nsrm\n. (10) \nHere, rm is the average life-cycle intensity of imported goods under the assumption of sectoral \nconstancy, and srm is the average life-cycle intensity given the sectoral multiplier s. The \nrelationship shown in Equation 10 allows us to consider the implications for leakage given \ndifferent possible international environmental intensities. To perform this analysis, export \nintensities (rx) were held constant, while import intensities (rm) were uniformly multiplied by s \nvalues ranging from 0.5 to 5.0. The reason for holding export intensities constant is that all goods \nproduced domestically, regardless of their location of consumption, have the same environmental \nintensities. Leakage results for 1998-2004 based on this analysis are shown in Figure 1. The data \nfor leakage presented in Figure 1 show that when imports are two or more times as \nenvironmentally intensive as the same commodities produced in the US (s > 2), leakage \nsurpasses 10% and shows considerable increases from 1998 to 2004 for all environmental \nimpacts. In the case of TRI and lead, leakage reaches as high as 49% and 85% by 2004, \nrespectively.  \nThis analysis was performed given data limitations on actual import intensities. However, \nexisting literature on environmental intensities for economic production in different parts of the \nworld provides rough approximations on what reasonable s values might be. The US Energy \nInformation Administration reports annual greenhouse gas and energy intensities for most \ncountries in the world (EIA 2006). Multiplying each national intensity by the value of goods \nimported from that country to the US for the given year, summing across all countries, and \ndividing by the value of total US imports provides an approximation of what reasonable s values \nmight be for global warming potential (GWP) and energy. From this calculation we find that the \n \n 28\naverage intensity of imports was 1.6 times that of US production in 1998 and 2.0 times as \nintensive in 2004 for GWP. Imports were similarly 1.5 times and 1.9 times as energy intensive as \nUS production for the same years.  \nData on international environmental intensities for impacts other than energy and GWP \nare not widely available. Nevertheless, some country specific studies to determine approximate \nemission intensities have been conducted. Table 9 shows s values derived from Dessus et al. \n(1994) for three types of toxic release (land, water, air) and the criteria air pollutants, except lead, \nfor five countries: China, Mexico, Japan, Brazil and Indonesia. Dessus et al. used World Bank \nIndustrial Pollution Projection System (IPPS) data combined with input-output tables to evaluate \nrelative pollution intensities across these five countries and the USA. China, Japan and Mexico \nhave been the second, third, and fourth largest exporters to the US for all of the study years, \nwhereas Brazil has ranked between fourteenth and seventeenth and Indonesia between fifteenth \nand twenty-sixth for the same years (US ITC). In 2004, imports from China, Mexico, Japan, \nBrazil and Indonesia constituted 13.4, 10.6, 8.6, 1.5 and 0.7 percent of total US imports, \nrespectively.  \nWhile the IPSS data shown in Table 9 is not based on actual emissions measurements, it \ndoes suggest what reasonable s values might be for TRI and the criteria air pollutants. Here, even \nJapan, an OECD country, has environmental intensities well over twice those for the US for \nmany environmental impacts. If we extrapolate the environmental intensities for the five \ncountries shown in Table 9 (representing a range of geographic regions and economic structures) \nover the rough distribution of countries from which the US imports, it becomes clear that s \nvalues from 2 to 4 represent the likely range of the actual ratio between US import and export \nenvironmental intensities. In the case of TRI in particular, s values of 3 may be considered a \n \n 29\nconservative estimate. This provides a guideline for viewing the data presented in Figure 1 and \ndemonstrates that under reasonable assumptions for s, leakage values by 2004 equal or exceed \n10% for VOCs (s =1.5), 25% for GWP, energy, PM10, SO2 (s =2), 40% for CO (s = 3), and 80% \nfor lead (s = 2) and TRI (s = 3).15 Table 10 shows possible values for the sectoral multiplier (s) \nand the resulting leakage values for each environmental impact under study. \n \nVII. Environmental Kuznets Curve Revisited \nIn this section we situate the data from the previous sections in the context of the \nEnvironmental Kuznets Curve hypothesis. We do so by comparing trends in US per-capita \nenvironmental impacts over the period of 1998-2004 under production- and consumption-based \nenvironmental approaches. We begin by calculating the annual, per-capita magnitude of each \ntype of environmental impact as  \ncy = eprod ,y + etrade,ypopy\n= r(p + m − sx)\npop\n⎛ \n⎝ ⎜ \n⎞ \n⎠ ⎟ y\n, (11) \nwhere cy is the per-capita impact of a given type in year y, popy is the US population in that year, \nand other terms are as described above. We performed this calculation for a production-based  \n“no trade” case (m and x set to 0) and for a consumption-based approach, with sectoral \nmultipliers (s) ranging from 0.5 to 5.0. For easier comparison among these cases, we then \ncalculated the percentage change over time in the per-capita environmental accounts as \n                                                 \n15 While no data were found to approximate s values for lead, a conservative estimate would give lead the same s \nvalue as the other criteria air pollutants. However, it is likely that lead emissions in non-OECD countries are even \nmore intensive than other air pollutants relative to the US due, among other reasons, to the slow elimination of lead \nfrom gasoline, paints, and solders in much of the world (IOM 1996). For example, 20% of gasoline sales in 1999 \nwere still leaded (UNEP 1999). \n \n 30\n′ c y = cyc1998\n−1⎛ ⎝ ⎜ \n⎞ \n⎠ ⎟ ×100%. (12) \nThese trends are shown in Figure 2 for TRI emissions, energy use, CO emissions and \nlead emissions. Table 11 shows the year-by-year trends for every environmental impact in our \nstudy, using the sectoral multipliers from Table 10. Figure 2 and Table 10 show a normalized \nversion of the same relationship (per capita emissions versus time) often used to evaluate the \nEnvironmental Kuznets Curve (EKC), and can be viewed as a short segment of a longer \nenvironmental trend.  \nUnder the “no trade” scenario, per-capita environmental impacts decline, hold \napproximately steady, or slightly rise over time. However, upon switching to a consumption-\nbased approach, which internalizes environmental impacts embodied in traded goods, and with \nreasonable assumptions for the sectoral multiplier (s), the overall trend looks quite different: per \ncapita environmental impact rises for all environmental impacts over this 6-year period. As a \nresult, impacts that appear to decline with wealth\/time under a production-based approach \ninstead hold steady or rise under a consumption-based approach (e.g. TRI), and impacts that \nappear to hold steady under a production-based approach instead increase under a consumption-\nbased approach (e.g. energy).  \nA more detailed analysis of the consumption data and economic linkages used in our \nmodel shows that the general upward trend in per-capita environmental impacts over the study \nperiod is driven by an even stronger upward trend in per-capita consumption of goods and \nservices. However, this trend is partly masked by steadily increasing efficiency in the economy’s \n \n 31\nuse of outputs from polluting industries.16 In 2003-04, growth in consumption outpaced this \ndeintensification, leading to the sharp rise in per-capita environmental impacts for these years \nshown in Fig. 2.17\nOur research findings, as represented in Table 11 and Figure 2, suggest the possibility \nthat the US has reached an inflection point at which increased wealth leads not to reduced, but \nrather to increased environmental impact. The implications for such a finding are that if \nincreased trade leads to increases in per capita environmental impact, the inverted “U” will gain \nan upward sloping “tail.” That is, we might see a turning point for wealthy countries with large \ntrade deficits or trade volumes at which environmental impact per unit of GDP begins to rise \nbased on the impact embodied in net imported goods. Such a late curve inflection point is indeed \nto be expected based on the consumption-based approach proposed here. This upturn in \nenvironmental impact with time\/wealth is contrary to what the EKC predicts and may suggest \nthat the typical EKC story—that once a country is on the downward sloping part of the inverted \n“U,” its environmental impacts necessarily decline with time and\/or wealth—may conceal part of \nthe process of economic transformation in wealthy countries.  \nPrevious econometric studies have revealed the contribution of sectoral change in the US \neconomy, rather than technological change, to the “downward” sloping part of the EKC (Suri \nand Chapman 1998, Cole 2004a). These studies show that some percentage of the decrease in US \nenvironmental impact has occurred by displacing environmental load onto other countries \nthrough trade, which we have quantified as leakage. Our results confirm these earlier studies’ \n                                                 \n16 The deintensification trend can be explained entirely by reductions in the gross output used from the following \nindustries per dollar of GDP, or consumption: Oil and gas extraction; Mining, except oil and gas; Utilities; \nPetroleum and coal products; Chemical products; Primary metals; Water transportation; Truck transportation; and \nWaste management and remediation services. \n17 The analysis to determine which industries had declining emissions intensities was conducted by applying 2002 \nconsumption values to the total-requirements matrices, T, for each study year. \n \n 32\nfindings, but for the first time provide life-cycle estimates—rather than modeled econometric \nestimates—of environmental leakage due to outsourcing.  \nOur analysis from Section VI, which shows the different effects that drive leakage, has \nimportant implications for considering how US consumption-based environmental impacts will \nchange in the future. Our results show that as the trade deficit continues to expand relative to \nGDP (the scale effect), BEET and percent leakage will likewise increase, as demonstrated \nbetween 1998 and 2004. In addition, as long as the environmental intensity of our imports is \ngreater than our exports, BEET will continue to increase as the total volume of trade increases, \neven in the absence of a trade deficit. Therefore, we should expect the predominant production-\nbased approach used in environmental trends analysis today to become increasingly inaccurate as \nthe volume of US imports increases. \nWhile, on first suggestion, a late curve inflection point whereat per capita environmental \nimpacts increase with time\/wealth sounds like an extreme critique of the EKC, it actually aligns \nwith the earliest econometric representation of the curve. Grossman and Krueger (1991) studied \nthe relationship between ambient sulphur dioxide concentrations and GDP per capita. They \nfound that above a certain per capita income level, concentrations are estimated to increase with \nincome, suggesting the possibility of an “N-shaped relationship”. Their study explicitly contains \nvariables that account for structural composition of the US economy. While most EKC studies \nabandon or are puzzled by this late curve upturn of the estimated relationship between growth \nand environmental impact, the consumption-based approach described here predicts it.  \n \nVI. Conclusions \n  \n \n 33\nThis research has put forth a life-cycle, consumption-based approach to the measurement \nof aggregate, US environmental impact, with particular attention to the role of trade. The EIO-\nLCA model was combined with trade data for 1998-2004 to generate a US balance of emissions \nembodied in trade (BEET) for Global Warming Potential (GWP), energy, TRI, and lead, CO, \nVOC, NOx, SO2, and PM10 emissions. Calculated via a consumption-based approach, the \nBEET represents net leakage from the predominant method of environmental trends analysis \nused today, described as the production-based approach in this paper. Section V of this paper \ncompared three different effects that drive leakage: the trade deficit (scale effect), the \nenvironmental terms of trade (τ), and the relative environmental intensity of exports(τ’). This \nsection showed that the scale effect explains the overall leakage trend and that τ’ enhanced \nleakage throughout the study years, even for environmental impacts with τ values favorable to \nlow leakage. \nThis work also quantified the percent leakage of environmental impact from the \nproduction-based approach under different scenarios that varied the environmental intensity of \nour trading partners. Finally, for the same scenarios, we derived consumption-based per-capita \nenvironmental impacts.  \nTo highlight some of this study’s key findings, we found that given likely ratios of the \nenvironmental intensity of US and international economies (described in this paper as s), the US \neconomy had large and growing BEET between 1998-2004 for all environmental impacts. The \npercent leakage peaked for all impacts in 2004, reaching 10% for VOCs; surpassing 25% for \nGWP, energy, PM10, and CO; and surpassing 80% for TRI and lead.  \nOverall, the key conclusions of this research are as follows. Firstly, studies of \nenvironmental trends that consider the EKC generally treat the inverted “U” shaped hypothesis \n \n 34\nas a starting point. Once countries demonstrate decreasing environmental impact with increasing \nincome, the EKC is taken to be confirmed. The EKC precludes analysis of environmental \npathways of wealthy countries that have presumably already environmentally de-intensified. The \nresearch presented here suggests the possibility of a “late curve analytics”—a turning point at \nwhich environmental impact increases with wealth as environmental impacts are shifted overseas. \nWhat may appear to be environmental deintensification in one country could actually mask a net \nincrease in emissions, if production is shifted to trading partners with greater environmental \nintensity. This signals the need to reopen the question of the relationship between growth and \nenvironmental impact for wealthy countries, which is already a hotly contested topic for the \nSouth. \nSecondly, leakage from production-based approaches to environmental trends analysis \nhas important implications for international environmental policy. As the BEET increases, so too \ndoes the gap between environmental impact and current definitions of environmental \nresponsibility. This suggests that the criteria on which national environmental responsibility are \nbased may need to be reevaluated. Otherwise, ambiguities in the relationship between \nenvironmental impact and environmental responsibility will make consensus on future \ninternational environmental treaties difficult to achieve. Two international environmental \nconventions are illustrative.  \nThe UN Framework Convention on Climate Change (UN FCCC) bases its estimates of \nclimate change scenarios on national GHG inventories derived from the production-based \napproach. The Kyoto Protocol calls for a 5-8% reduction in 1990 GHG emissions for Annex 1 \ncountries, mostly in the North. Leakage from national inventories, therefore, has crucial \nimplications for how environmental policy is formulated and for how countries are evaluated vis-\n \n 35\nà-vis climate change mitigation commitment paths. Leakage for GWP of more than 10% might \nsignificantly alter perceptions of a country’s path to climate change mitigation.  \nUnder the assumption of sectoral constancy, leakage for GWP reached 8% by 2004. \nAssuming an import intensity twice that of domestic GWP intensity, the consumption-based \napproach put forth here finds that US leakage reached 26% the same year. In the context of \nclimate change policy, this has at least two important implications. First, given the ability of the \nNorth (Annex 1) to outsource carbon intensive production activities to the South (non-Annex 1), \nproduction-based approaches are inherently biased in favor of countries that have already \n“developed.” Second, because climate change is a problem of the global commons, the free rider \neffect and the perceived economic risks of early agreement to binding GHG commitments means \nthat uncertainty about the system of accounting or perceived loopholes in the rules of accounting \nmay dissuade countries from committing to GHG targets. Signatory countries to the UN FCCC \nhave expressed deep concerns over “hot air” in emission reduction credits for the former Soviet \nUnion. Similar debates could emerge were leakages from the current production-based approach \nrecognized to be greater than 10% of Annex 1 GHG inventories, which the present research \nsuggests is, indeed, the case.  \nIn 1995, the Basel Convention on the transboundary movement in hazardous waste added \na Ban Amendment, which prohibits the export of hazardous materials (of which TRI is a main \ncomponent) from OECD and EU countries to all other Parties to the Convention (the South). The \nBasel Convention was widely seen as a crucial step to eliminating the dumping of hazardous \nwastes on poor countries, or what has popularly been dubbed “toxic trading.” It does not, \nhowever, address hazardous materials embodied in traded goods. Thus, the outsourcing of a \nchemicals plant, for example, is entirely legal, whereas the export of the hazardous wastes \n \n 36\nproduced from that chemical plant prior to outsourcing is not. A key point to note is that OECD \ncountries (not including the US) in the 1990s exported approximately 2% of their total generated \nhazardous waste (O'Neill 2000). While the Convention certainly reduced what had previously \nbeen a higher percentage of traded waste, the current extent to which wastes are regulated by \nBasel is quite low. Table 4 and Figure 1 show that leakage for TRI is well above 2% for all years \nof study under the assumption of sectoral constancy, and ranges from 33 to 49% for 1998-2004 \nwhen import intensities are assumed to be twice those for the US, which is a very conservative \nestimate.  \nThe specific reason for the Basel Convention’s ban on the export of hazardous waste \nfrom the North to the South is because of the poorer disposal options and generally higher risk of \nharm to human health and environmental quality resulting from materials disposal in the South. \nThere is little reason to believe that the same hazardous materials arising from production \nprocesses in the South are disposed of any more safely than when they are directly imported \nfrom the North. The data above on leakage of TRI suggests that the hazardous materials \nassociated with the production of goods for foreign consumption is increasingly “leaked” from \ncurrent analyses of environmental trends. This research suggests that to truly achieve the goals of \nthe Basel Convention and to understand where wastes are being generated and disposed of and \nfor whom, a consumption-based approach to environmental accounting is necessary. \n \nAcknowledgements \nAmol Phadke provided useful conceptual insights into the relationship between \nconsumption and environmental impact that have strengthened this paper. The authors would \nalso like to thank the Green Design Institute at Carnegie Mellon University for providing data, an \n \n 37\nanonymous reviewer for critical comments, Arpad Horvath, Richard Norgaard and Kamal \nKapadia for insightful feedback on earlier versions of this paper, and Alex Farrell for data \nsuggestions. All remaining errors and omissions remain the sole responsibility of the authors.  \n \n \nReferences \nAntweiler, W. 1996. The pollution terms of trade. Economic Systems Research 8:361-365. \nAntweiler, W., B. R. Copeland, and M. S. Taylor. 2001. Is free trade good for the environment? \nAmerican Economic Review 91:877-908. \nArrow, K., B. Bolin, R. Costanza, and e. al. 1995. Economic growth, carrying capacity and the \nenvironment. Science 268:520-521. \nAtkinson, G., and K. Hamilton. 1996. Measuring the value of global resource consumption: \ndirect and indirect flows of assets in international trade. Centre for Social and Economic \nResearch on the Global Environment, London. \nBattjes, J. J., K. J. Noorman, and W. Beiesiot. 1998. Assessing the energy intensities of imports. \nEnergy Economics 20:67-83. \nBEA, U. S. 1997. Input-Output Accounts of the U.S. Economy. Type Report Number, \nInstitutionhttp:\/\/www.bea.gov\/bea\/dn2\/i-o_benchmark.htm. \nBEA, U. S. 2006a. Annual Industry Accounts: Gross-Domestic-Product-(GDP)-by-Industry Data. \nBureau of Economic Analysis, Washington, DC. \nBEA, U. S. 2006b. Annual Industry Accounts: Input-Output Accounts Data. Bureau of \nEconomic Analysis, Washington, DC. \nBeckermann, W. 1992. Economic growth and the environment: whose growth? Whose \nenvironment? World Development 20:481-496. \nCole, M. A. 2004a. Trade, the pollution haven hypothesis and the environmental Kuznets curve: \nexamining the linkages. Ecological Economics 48:71-81. \nCole, M. A. 2004b. US environmental load displacement: examining consumption, regulations \nand the role of NAFTA. Ecological Economics 48:439-450. \nCole, M. A., A. J. Rayner, and J. M. Bates. 1997. The environmental Kuznets curve: an \nempirical analysis. Environment and Development Economics 2:401-416. \nCurran, M. A. 1993. Broad based Life Cycle Assessment. Environmental Science and \nTechnology 27:430-436. \nDaily, G. C., P. R. Ehrlich, and M. Alberti. 1996. Managing Earth's Life Support Systems. \nEcological Applications 6. \nEder, P., and M. Narodoslawsky. 1999. What environmental pressures are a region's industries \nresponsible for? A method of analysis with descriptive indices and input-output models. \nEcological Economics 29:359-374. \nEIA. 2006. International Energy Outlook 2004. E. I. A. US Department of Energy.  \nhttp:\/\/www.eia.doe.gov\/emeu\/international\/energyconsumption.html. \n \n 38\nFacanha, C., and A. Horvath. 2006. Environmental assessment of freight transportation in the US. \nInternational Journal of Life Cycle Assessment 11:229-239. \nFarber, S. 1995. Economic resilience and economic policy. Ecological Economics 15:105-107. \nFerng, J.-J. 2003. Allocating the responsibility of CO2 over-emissions from the perspectives of \nbenefit principle and ecological deficit. Ecological Economics 46:121-141. \nFischer-Kowalski, M., and C. Amann. 2001. Beyond IPAT and Kuznets Curves: Globalization as \na Vital Factor in Analyzing the Environmental Impact of Socio-Economic Metabolism. \nPopulation and Environment 23:7-47. \nGawande, K., R. P. Berrens, and A. K. Bohara. 2001. A consumption-based theory of \nenvironmental Kuznets curve. Ecological Economics 37:101-112. \nGraedel, T. E. 1998. Streamlined Life-Cycle Assessment. Prentice Hall, Upper Saddle River, NJ. \nGrossman, G. M., and A. B. Krueger. 1992. Environmental impacts of a North American free \ntrade agreement. Woodrow Wilson School, Princeton, N.J. \nGrossman, G. M., and A. B. Krueger. 1995. Economic growth and the environment. Quarterly \nJournal of Economics May:353-357. \nGuo, J., A. M. Lawson, and M. A. Planting. 2002. From Make-Use to Symmetric I-O Tables: An \nAssessment of Alternative Technology Assumptions in 14th International Conference on \nInput-Output Techniques, Montreal, Canada. \nHarbaugh, W. T., A. Levinson, and D. M. Wilson. 2002. Reexamining the empirical evidence for \nan environmental Kuznets curve. The Review of Economics and Statistics 84:541-551. \nHendrickson, C., A. Horvath, S. Joshi, and L. Lave. 1998. Economic Input-Output Models for \nEnvironmental Life-Cycle Assessment. Environmental Science and Technology \n32:184A-191A. \nHendrickson, C. T., L. B. Lave, and H. S. Matthews. 2006. Environmental Life Cycle \nAssessment of Goods and Services: An Input-Output Approach. RFF Press, Washington, \nDC. \nHertwich. 2005. Life cycle approaches to sustainable consumption: A critical review. \nEnvironmental Science and Technology 39:4673-4684. \nHettige, H., M. Mani, and D. Wheeler, editors. 1997. Industrial pollution in economic \ndevelopment: Kuznets revisited. World Bank. Development Research Group, \nWashington. \nHorvath, A., and C. Hendrickson. 1998. Comparison of environmental implications of asphalt \nand steel-reinforced concrete pavements. Transportation Research Record 4:105-113. \nIOM. 1996. Lead in the Americas: A Call to Action. National Academies Press, Washington, \nD.C. \nJacobsen, H. K. 2000. Energy demand, structural change and trade: A decomposition analysis of \nthe Danish manufacturing industry. Economic Systems Research 12:319-343. \nJaffe, A. B., R. G. Newell, and R. N. Stavins. 2002. Environmental Policy and Technological \nChange. Environmental and Resource Economics 22:41-69. \nJanicke, M., M. Binder, and H. Monch. 1997. 'Dirty industries': patterns of change in industrial \ncountries. Environmental and Resource Economics 9:467-491. \nKarr, J. R., and T. Thomas. 1996. Economics, ecology and environmental quality. Ecological \nApplications 6:31-32. \nKondo, Y., Y. Moriguchi, and H. Shimizu. 1998. CO2 emissions in Japan: influences of imports \nand exports. Applied Energy 59:163-174. \n \n 39\nKuznets, S. 1955. Economic Growth and Income Inequality. American Economic Review 45:1-\n28. \nLash, J. 1995. Integrated policy-making for growing human aspirations. Ecological Economics \n15:113-114. \nLenzen, M. 1998. Primary energy and greenhouse gases embodied in Australian final \nconsumption: an input-output analysis. Energy Policy 26:495-506. \nLeontief, W. 1986. Input-Output Economics. Oxford University Press, New York. \nLopez, R., and S. Mitra. 2000. Corruption, pollution and the environmental Kuznets curve. \nJournal of Environmental Economics and Management 40:137-150. \nMachado, G., R. Schaeffer, and E. Worrell. 2001. Energy and carbon embodied in the \ninternational trade of Brazil: an input-output approach. Ecological Economics 39:409-424. \nMongelli, I., G. Tassielli, and B. Notarnicola. 2006. Global warming agreements, international \ntrade and energy\/carbon embodiments: an input-output approach to the Italian case. \nEnergy Policy 34:88-100. \nMunksgaard, J., and K. A. Pedersen. 2001. CO2 accounts for open economies: producer or \nconsumer responsibility. Energy Policy 29:327-334. \nMuradian, R., M. O'Connor, and J. Martinez-Alier. 2002. Embodied pollution in trade: \nestimating the 'environmental load displacement' of industrialized countries. Ecological \nEconomics 41. \nNorman, J., H. L. MacLean, and C. A. Kennedy. 2006. Comparing high and low residential \ndensity: Life-cycle analysis of energy use and greenhouse gas emissions. Journal of \nUrban Planning and Development 132:10-21. \nO'Neill, K. 2000. Waste Trading among Rich Nations: Building a New Theory of Environmental \nRegulation. MIT Press, Cambridge. \nRhee, H.-C., and H.-S. Chung. 2006. Change in CO2 emission and its transmission between \nKorea and Japan using international input-output analysis. Ecological Economics 58:788-\n800. \nRothman, D. S. 1998. Environmental Kuznets curves--real progress or passing the buck? A case \nfor consumption-based approaches. Ecological Economics 25:177-194. \nRubin, E. S., M. R. Taylore, S. Yeh, and D. A. Hounshell. 2004. Learning curves for \nenvironmental technology and their importance for climate policy analysis. Energy \n29:1551-1559. \nSchindler, D. W. 1996. The environment, carrying capacity and economic growth. Ecological \nApplications 6. \nSeldon, T. M., and D. Song. 1994. Environmental quality and development: is there a Kuznets \ncurve for air pollution emissions? Journal of Environmental Economics and Management \n27:147-162. \nSeppälä, T., T. Haukioji, and J. Kaivo-oja. 2001. The EKC hypothesis does not hold for direct \nmaterial flows: Environmental Kuznets Curve hypothesis tests for direct material flows in \nfive industrial countries. Population and Environment 23:217-238. \nShaeffer, R., and A. L. de Sa. 1996. The embodiment of carbon associated with Brazilian imports \nand exports. Energy Conserv. Mgmt 32:955-960. \nShafik, N. 1994. Economic development and environmental quality: an econometric analysis. \nOxford Economic Papers 46:757-773. \nSpangenberg, J. H. 2001. The environmental Kuznets curve: a methodological artifact? \nPopulation and Environment 23:175-191. \n \n 40\nStreets, D. G., C. Yu, M. H. Bergin, and G. R. Carmichael. 2006. Modeling study of air pollution \ndue to the manufacture of export goods in China's Pearl River Delta. Environmental \nScience and Technology 40:2099-2107. \nSuri, V., and D. Chapman. 1998. Economic growth, trade and energy: implications for the \nenvironmental Kuznets curve. Ecological Economics 25:195-208. \nTaylor, M. R., E. S. Rubin, and D. A. Hounshell. 2005. Control of SO2 emissions from power \nplants: A case of induced technological innovation in the U.S. Technological Forecasting \nand Social Change 72:697-718. \nTukker, A., and B. Jansen. 2006. Environmental impacts of products: A detailed review of \nstudies. Journal of Industrial Ecology 10:159-182. \nUNEP. 1999. Phasing Lead out of Gasoline: An Examination of Policy Approaches in Different \nCountries. U. N. E. Program.  http:\/\/www.uneptie.org\/energy\/act\/tp\/ldgas\/index.htm. \nUNEP. 2004. UNEP\/SETAC Life-cycle Initiative. U. N. E. Programme.  \nVogel, D. 1995. Trading Up: Consumer and Environmental Regulation in a Global Economy. \nHarvard University Press, Cambridge, MA. \nWackernagel, M., and W. E. Rees. 1996. Our Ecological Footprint: Reducing Human Impact on \nthe Earth. New Society Publishers, Gabriola Island, BC. \nWyckoff, A. W., and J. M. Roop. 1994. The embodiment of carbon in imports of manufactured \nproducts: Implications for international agreements on greenhouse gas emissions. Energy \nPolicy 22:187-194. \n \n \n \n 41\nTables \n \nTable 1\nU.S. production-based national environmental accounts\nYear Environmental impact\nYear\nGWP*\n(TgCO2e)\nEnergy\n(PJ)\nTRI\n(Gg)\nSO2\n(Gg)\nNOx\n(Gg)\nVOC\n(Gg)\nPM10\n(Gg)\nLead\n(Mg)\nCO\n(Gg)\n1998 5,410 64,086 7,110 15,230 16,890 7,182 2,770 3,152 42,614\n1999 5,484 64,911 7,127 15,100 17,240 7,460 2,833 3,206 44,609\n2000 5,661 66,962 7,118 15,666 17,754 7,628 2,875 3,179 45,729\n2001 5,531 65,042 6,908 15,122 17,399 7,406 2,813 2,958 44,140\n2002 5,690 67,032 6,943 15,787 17,783 7,424 2,832 3,035 44,372\n2003 5,680 66,660 6,846 15,486 17,851 7,421 2,850 3,012 44,137\n2004 5,835 68,759 7,075 15,708 18,454 7,744 2,917 3,172 46,520\n* global warming potential, in units of teragrams (million metric tons) of CO2 equivalent  \n \n \nTable 2\nU.S. Balance of Emissions Embodied in Trade\nYear Environmental impact\nGWP\n(TgCO2e)\nEnergy\n(PJ)\nTRI\n(Gg)\nSO2\n(Gg)\nNOx\n(Gg)\nVOC\n(Gg)\nPM10\n(Gg)\nLead\n(Mg)\nCO\n(Gg)\n1998 233 2,306 370 818 390 33 73 611 1,610\n1999 320 3,059 720 990 370 29 129 701 729\n2000 383 3,889 821 1,209 519 94 146 814 987\n2001 369 3,892 772 1,144 511 133 142 760 1,020\n2002 397 4,079 825 1,187 619 216 157 739 1,422\n2003 400 4,216 839 1,173 606 222 156 691 1,388\n2004 466 4,930 1,072 1,384 719 262 191 923 1,906  \n \n \nTable 3\nU.S. consumption-based national environmental accounts (per capita)\nYear Environmental impact\nGWP\n(MgCO2e)\nEnergy\n(GJ)\nTRI\n(kg)\nSO2\n(kg)\nNOx\n(kg)\nVOC\n(kg)\nPM10\n(kg)\nLead\n(g)\nCO\n(kg)\n1998 20.4 240.5 27.1 58.1 62.6 26.1 10.3 13.6 160.2\n1999 20.8 243.4 28.1 57.6 63.1 26.8 10.6 14.0 162.3\n2000 21.4 251.1 28.1 59.8 64.8 27.4 10.7 14.2 165.5\n2001 20.7 241.8 26.9 57.1 62.8 26.4 10.4 13.0 158.4\n2002 21.1 246.9 27.0 58.9 63.9 26.5 10.4 13.1 159.0\n2003 20.9 243.7 26.4 57.3 63.5 26.3 10.3 12.7 156.5\n2004 21.5 250.9 27.7 58.2 65.3 27.3 10.6 13.9 164.9  \n \n \n \n 42\nTable 4\nPercent leakage from production-based national environmental accounts\nYear Environmental impact\nGWP Energy TRI SO2 NOx VOC PM10 Lead CO\n1998 4.3% 3.6% 5.2% 5.4% 2.3% 0.5% 2.6% 19.4% 3.8%\n1999 5.8% 4.7% 10.1% 6.6% 2.1% 0.4% 4.6% 21.9% 1.6%\n2000 6.8% 5.8% 11.5% 7.7% 2.9% 1.2% 5.1% 25.6% 2.2%\n2001 6.7% 6.0% 11.2% 7.6% 2.9% 1.8% 5.1% 25.7% 2.3%\n2002 7.0% 6.1% 11.9% 7.5% 3.5% 2.9% 5.6% 24.4% 3.2%\n2003 7.0% 6.3% 12.3% 7.6% 3.4% 3.0% 5.5% 22.9% 3.1%\n2004 8.0% 7.2% 15.2% 8.8% 3.9% 3.4% 6.5% 29.1% 4.1%  \n \n \nTable 5\nU.S. trade balance (1997 $)\nYear\nGDP \n($B)\nImports \n($B)\nExports \n($B)\nTrade \nDeficit \n(% GDP)\nImports\/\nExports\n1998 8,712 902 780 1.4% 1.16\n1999 9,134 998 791 2.3% 1.26\n2000 9,490 1,155 847 3.2% 1.36\n2001 9,521 1,064 778 3.0% 1.37\n2002 9,704 1,068 744 3.3% 1.44\n2003 9,986 1,136 758 3.8% 1.50\n2004 10,447 1,289 824 4.5% 1.57  \n \n \nTable 6\nU.S. environmental terms of trade ( x\/rm)\nYear GWP Energy TRI SO2 NOx VOC PM10 Lead CO\n1998 0.83 0.89 0.94 0.73 0.93 1.12 0.96 0.69 0.89\n1999 0.81 0.91 0.83 0.72 1.04 1.23 0.92 0.69 1.14\n2000 0.83 0.92 0.86 0.73 1.05 1.27 0.96 0.71 1.19\n2001 0.82 0.90 0.85 0.72 1.04 1.23 0.95 0.71 1.18\n2002 0.82 0.92 0.84 0.72 1.03 1.20 0.95 0.74 1.17\n2003 0.86 0.94 0.87 0.74 1.08 1.25 1.00 0.78 1.22\n2004 0.87 0.97 0.87 0.75 1.10 1.29 1.00 0.75 1.22  \n \n \n \n \n \n \n 43\nTable 7\nU.S. relative environmental intensity of exports ( x\/rprod)\nYear GWP Energy TRI SO2 NOx VOC PM10 Lead CO\n1998 1.25 1.37 2.48 1.04 1.05 1.68 1.47 3.15 1.39\n1999 1.21 1.38 2.21 1.02 1.14 1.80 1.39 3.05 1.69\n2000 1.19 1.36 2.21 0.99 1.12 1.81 1.38 3.14 1.70\n2001 1.23 1.42 2.25 1.03 1.16 1.89 1.42 3.40 1.80\n2002 1.22 1.41 2.19 0.97 1.15 1.93 1.43 3.34 1.82\n2003 1.24 1.42 2.23 0.98 1.15 1.95 1.46 3.29 1.81\n2004 1.27 1.46 2.40 1.02 1.18 1.97 1.46 3.37 1.81\n \n 44\n \n \nTable 8\nShare of 2000 U.S. GDP and exports from each major sector (%)\nSector GDP Exports Imports\nAgriculture, forestry, fishing, hunting 0% 2% 2%\nMining, utilities and construction 9% 1% 9%\nManufacturing 15% 65% 87%\nTrade and transportation 15% 15% 0%\nInformation, finance, real estate, professional services 24% 17% 2%\nEducation, health care and social services 12% 0% 0%\nArts, entertainment, accommodation and food services 5% 0% 0%\nOther services 4% 0% 0%\nGovernment 15% 0% 0%  \n \n \n \nTable 9\nEnvironmental intensity for select country\/US environmental intensity*\nEnvironmental Country\nImpact Indonesia China Brazil Japan Mexico\nToxic (Air) 2.0 2.3 4.3 2.5 3.3\nToxic (Water) 3.0 4.3 3.8 1.5 1.3\nToxic (Land) 3.0 3.0 5.3 3.0 5.0\nSO2 3.5 2.0 5.0 2.3 1.0\nNO2 3.5 2.0 5.0 2.3 1.0\nCO 0.8 3.5 5.0 2.3 2.5\nVOC 1.0 1.2 4.8 1.8 2.2\nPM 3.3 2.8 4.8 2.3 1.0\n* \"Air\", \"water\" and \"land\" designate the medium into which toxics are \nemitted; data reproduced from Dessus et al. (1994)\nTable 10\nLeakage under varying intensity assumptions for imports [leakage% (s)]\nYear GWP Energy TRI SO2 NOx VOC PM10 Lead CO\n1998 13% (1.6) 12% (1.5) 60% (3) 20% (2) 14% (2) 8% (1.5) 18% (2) 67% (2) 36% (3)\n1999 15% (1.6) 14% (1.5) 69% (3) 22% (2) 14% (2) 8% (1.5) 21% (2) 70% (2) 34% (3)\n2000 17% (1.6) 16% (1.6) 74% (3) 24% (2) 16% (2)10% (1.5) 22% (2) 79% (2) 37% (3)\n2001 17% (1.6) 17% (1.6) 70% (3) 24% (2) 15% (2)10% (1.5) 22% (2) 79% (2) 36% (3)\n2002 18% (1.7) 17% (1.6) 69% (3) 23% (2) 16% (2)12% (1.5) 22% (2) 74% (2) 37% (3)\n2003 21% (1.8) 20% (1.8) 71% (3) 23% (2) 16% (2)12% (1.5) 22% (2) 71% (2) 37% (3)\n2004 26% (2.0) 24% (1.9) 83% (3) 26% (2) 17% (2)13% (1.5) 25% (2) 85% (2) 41% (3)  \n \nTable 11\nChange in per-capita environmental impact relative to 1998 (%)\nYear no trd trade no trd trade no trd trade no trd trade no trd trade no trd trade no trd trade no trd trade no trd trade\n1998 +0.0 +0.0 +0.0 +0.0 +0.0 +0.0 +0.0 +0.0 +0.0 +0.0 +0.0 +0.0 +0.0 +0.0 +0.0 +0.0 +0.0 +0.0\n1999 +0.2 +2.1 +0.1 +1.8 Š0.9 +4.4 Š2.0 Š0.5 +0.9 +1.0 +2.7 +2.9 +1.1 +3.5 +0.6 +2.4 +3.5 +2.0\n2000 +2.4 +6.0 +2.2 +5.9 Š2.0 +6.5 +0.6 +4.2 +2.9 +4.4 +3.9 +5.6 +1.6 +5.0 Š1.3 +5.9 +5.0 +5.5\n2001 Š1.0 +2.5 Š1.7 +2.4 Š5.9 +0.1 Š3.8 Š1.0 Š0.2 +0.9 Š0.1 +1.9 Š1.7 +1.1 Š9.1 Š2.6 +0.3 +0.4\n2002 +0.9 +5.3 +0.3 +4.5 Š6.4 Š1.0 Š0.6 +1.4 +0.9 +2.5 Š0.9 +2.4 Š2.0 +1.0 Š7.7 Š3.7 Š0.2 +0.8\n2003 Š0.3 +6.8 Š1.3 +5.5 Š8.6 Š2.5 Š3.5 Š1.4 +0.3 +1.7 Š1.9 +1.4 Š2.3 +0.6 Š9.3 Š7.2 Š1.7 Š1.2\n2004 +1.4 +13.4 +0.9 +11.8 Š6.4 +7.2 Š3.0 +1.5 +2.7 +5.5 +1.4 +5.7 Š1.0 +4.2 Š5.4 +4.7 +2.6 +6.1\nGWP Energy TRI SO2 NOx VOC PM10 Lead CO\n  \n \n"}