{"doi":"10.1007\/s00038-010-0220-x","coreId":"15248","oai":"oai:dro.dur.ac.uk.OAI2:8032","identifiers":["oai:dro.dur.ac.uk.OAI2:8032","10.1007\/s00038-010-0220-x"],"title":"Hard times or good times ? inequalities in the health effects of economic change.","authors":["Riva, M.","Bambra, C.","Easton, S.","Curtis, S."],"enrichments":{"references":[{"id":707444,"title":"Are recessions good for your health?&quot;","authors":[],"date":"2000","doi":"10.1162\/003355300554872","raw":null,"cites":null},{"id":707285,"title":"Business cycles and mortality: results from Swedish microdata.&quot;","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":718898,"title":"Commission, Department for work and pensions,","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":707286,"title":"Deaths rise in good economic times: Evidence from the OECD.&quot;","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":707288,"title":"Do economic cycles have a permanent effect on population health? Revisiting the Brenner hypothesis.&quot;","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":707446,"title":"Does drinking really decrease in bad times?&quot;","authors":[],"date":"2002","doi":"10.1016\/S0167-6296(02)00033-4","raw":null,"cites":null},{"id":707287,"title":"Economic recession and health inequalities in Japan: analysis with a national sample, 1986-2001.&quot;","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":707289,"title":"Excess mortality of unemployed men and women during a period of rapidly increasing unemployment.&quot;","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":707447,"title":"Gender differences in the associations between health and neighbourhood environment.&quot;","authors":[],"date":"2005","doi":"10.1016\/j.socscimed.2004.08.028","raw":null,"cites":null},{"id":707445,"title":"In healthy economy can break your heart.&quot;","authors":[],"date":"2007","doi":"10.1007\/BF03208384","raw":null,"cites":null},{"id":707450,"title":"Increasing mortality during the expansions of the US economy, 1900-1996.&quot;","authors":[],"date":"2005","doi":"10.1093\/ije\/dyi141","raw":null,"cites":null},{"id":718035,"title":"Local labor market fluctuations and health: Is there a connection and for whom?&quot;","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":718036,"title":"Measuring neighbourhood social and material context: generation and interpretation of ecological data from routine and non-routine sources.&quot;","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":707284,"title":"Measuring the neighbourhood using UK benefits data: a multilevel analysis of mental health status.&quot;","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":718034,"title":"Neighborhood socioeconomic status and all-cause mortality.&quot;","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":707448,"title":"Neighbourhoods and self rated health: a comparison of public sector employees in London and Helsinki.&quot;","authors":[],"date":"2004","doi":"10.1136\/jech.2003.015941","raw":null,"cites":null},{"id":707283,"title":"Places, people and mental health: A multilevel analysis of economic inactivity.&quot;","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":707291,"title":"Recessions lower (some) mortality rates: evidence from Germany.&quot;","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":707452,"title":"The association between unemployment and mortality:causation or selection? Adult mortality in developed countries: from description to explanation.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":707292,"title":"The impact of the recession on the labour market.","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":707449,"title":"The public health effect of economic crises and alternative policy responses in Europe: an empirical analysis.&quot;","authors":[],"date":"2009","doi":"10.1016\/S0140-6736(09)61124-7","raw":null,"cites":null},{"id":707451,"title":"The reversal of the relation between economic growth and health progress: Sweden in the 19th and 20th centuries.&quot;","authors":[],"date":"2008","doi":"10.1016\/j.jhealeco.2007.09.006","raw":null,"cites":null},{"id":718897,"title":"Who is hurt by procyclical mortality?&quot;","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":707290,"title":"Why Are Recessions Good for Your Health?&quot;","authors":[],"date":"2009","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-02-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15248.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/8032\/1\/8032.pdf","pdfHashValue":"39e00f6091b42f95cd338475e7329e3fd1b7992d","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:8032<\/identifier><datestamp>\n      2011-03-04T16:39:06Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Hard times or good times ? inequalities in the health effects of economic change.<\/dc:title><dc:creator>\n        Riva, M.<\/dc:creator><dc:creator>\n        Bambra, C.<\/dc:creator><dc:creator>\n        Easton, S.<\/dc:creator><dc:creator>\n        Curtis, S.<\/dc:creator><dc:publisher>\n        Springer<\/dc:publisher><dc:source>\n        International journal of public health, 2011, Vol.56(1), pp.3-5 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2011-02-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:8032<\/dc:identifier><dc:identifier>\n        issn:1661-8556<\/dc:identifier><dc:identifier>\n        issn: 1661-8564<\/dc:identifier><dc:identifier>\n        doi:10.1007\/s00038-010-0220-x<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/8032\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1007\/s00038-010-0220-x<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/8032\/1\/8032.pdf<\/dc:identifier><dc:rights>\n        The original publication is available at www.springerlink.com\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["1661-8556"," 1661-8564","issn:1661-8556","issn: 1661-8564"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2011,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n04 March 2011\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nRiva, M. and Bambra, C. and Easton, S. and Curtis, S. (2011) ’Hard times or good times ? inequalities in the\nhealth effects of economic change.’, International journal of public health, 56 (1). pp. 3-5.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1007\/s00038-010-0220-x\nPublisher’s copyright statement:\nThe original publication is available at www.springerlink.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nHard times or Good times? Inequalities in the health effects of economic recession  \nEditorial for the International Journal of Public Health \n \nSince the banking crisis in 2007, there has been a deepening economic recession with global \nreductions in economic growth and rising unemployment. This has led to renewed discussions about \nthe effects of the economic cycle on population health both in the popular media and in academia (a \npartial revival of the Brenner-Ruhm debate). However, whilst the media coverage tends to speculate \non the negative health effects of recession, there appears to be an emerging consensus in the \nacademic literature that the relationship between macroeconomic fluctuations and health is generally \npro-cyclical. In other words, that, for example, mortality increases when the economy is growing and \nreduces during periods of economic recession (Ruhm 2000; Laporte 2004; Neumayer 2004; Tapia \nGranados 2005; Gerdtham and Ruhm 2006; Tapia Granados and Ionides 2008): that economic \nrecessions are good for health. Many mechanisms have been put forward to explain this, including an \nincrease in work demands and working hours during periods of growth, more traffic accidents, a \nhigher consumption of alcohol (Ruhm and Black 2002) and tobacco (Ruhm 2000),as well as \nreductions in physical activity levels (Ruhm 2000), leisure time and social interactions. However, in \nthis editorial, we unpick this academic “consensus” on the basis that not only do the health effects of \nthe macroeconomic cycle vary in respect to how key factors are measured (i.e. the lag effect, \ncompeting measures of the economic cycle, variation by health outcome), but that they also depend \non who you are and where you live. The debate to date has been largely dominated by a few US \nstudies using aggregate population data, which has been analysed at large geographical levels, with \nlittle consideration of demographic, socio-economic and spatial inequalities in the health effects of \neconomic recessions.  \n \n \nDemographic and socio-economic inequalities in susceptibility and health effects  \nProbing beneath the surface shows that the relationship between the macroeconomic cycle and \nhealth is not evenly distributed across the population. Some studies report that men are more affected \nthan women by changes in the economic cycle. So for example, a Swedish study found that during \nrecessions, mortality increased for men but not for women (Gerdtham and Johannesson 2005). In \ncontrast, a USA study found that a higher state unemployment rate is associated with procyclical \nmortality among working age men and older men and women, but not with any increased mortality in \nworking age women (Edwards 2008). Health inequalities by sex could be explained by differences \nbetween men and women in the type and industry of work, with men more likely to work in the private \nsector and in parts of the economy conventionally more vulnerable to economic downturns (such as \nfinance and business services, manufacturing, construction, (Office for National Statistics 2009)).  \n \nThe impact of economic fluctuations also varies by age groups, with greater risk of mortality observed \namong younger Americans (Ruhm 2000; Tapia Granados 2005); these studies did not test whether \nestimates are statistically significant different between age groups (and that historically, younger \npeople have had low employment rates compared to prime-age workers). In addition, negative \nimpacts of economic contractions appear to extend beyond those of working age to affect the health \nof older adults (Ruhm 2007) but also the health of children (Tapia Granados 2005; Miller, Page et al. \n2009) suggesting that the negative effects of economic change are not only attributable to people‟s \nemployment experiences but that they stretch over the life course.   \n \nFurther health inequalities in the impact of the recession have been observed among different \nsocioeconomic groups. For example, in the US, Edwards (Edwards 2008) observed that increasing \nstate unemployment levels were associated with increased mortality risk among people with low \neducation and with lower risks among those with a higher education whereas others have reported \nmore weight related issues and mental health problems among African-Americans but not among \nWhites or Hispanics (Charles and DeCicca 2008). Socio-economic inequalities have also been \nobserved in Japan where, following the economic crisis of the 1990‟s, overall population health status \nimproved but non-manual  workers were more likely to report poor health, especially in men (Kondo, \nSubramanian et al. 2008).  \n \n \n \nTHE SCALE AND GEOGRAPHIC AREA OF ANALYSIS \n \nMost of the studies examining the impact of economic expansion\/recession (often measured using \nchange in employment\/unemployment rates) have used aggregated data on both health and \neconomic indicators. These ecological associations are most often measured at a broad geographical \nscale, e.g. at the national (Tapia Granados 2005; Gerdtham and Ruhm 2006) or state\/regional levels \n(Ruhm 2000) levels, although some have examined the impact of local labour market fluctuations on \nhealth at the metropolitan area level (Charles and DeCicca 2008). Observing that, at the ecological \nlevel, increasing employment rates is associated with increasing mortality cannot be inferred to \noperate in similar fashion at the individual level. That would be committing an ecological fallacy. In \nfact these ecological studies tell us nothing about individuals‟ experiences of economic recession \ngrowth\/recession, e.g. job loses, job insecurity, and how these experiences influence health. They are \ninconsistent with findings from „individual-level‟ epidemiological studies on the relation between work \nand health where longstanding evidence demonstrate that for people, being unemployed or \nexperiencing job insecurity is associated with poor physical and mental health (Martikainen and \nValkonen 1996; Valkonen and Martikainen 1996).  \n \nIn addition, little is know about differential spatial impacts whereby some local areas may bear the \nbrunt of economic crisis more than others. In deprived urban areas, although lower employment rates \nmight always prevail, decline of employment rates might be more rapid than in more affluent areas \n(Equality and Human Rights Commission, Department for work and pensions et al. 2009), therefore \nincreasing spatial inequalities. An increasing body of research demonstrates that the socioeconomic \nconditions of small local areas influence a range of health outcomes, independently of individuals‟ \nown socioeconomic circumstances (Stafford, Martikainen et al. 2004; Cummins, Macintyre et al. 2005; \nStafford, Cummins et al. 2005)(Fone, Dunstan et al. 2007; Fone, Lloyd et al. 2007; Riva, Bambra et \nal. In Press) (Bosma, van de Mheen et al. 2001).  \n \n \nNATIONAL SOCIAL POLICIES AND SAFETY NETS \nYet social policies and safety nets in a country are likely to alleviate the negative health impacts of a \nchanging economy. Examining the relationship between macroeconomic conditions and deaths in \ncountries of the Organisation for Economic Co-operation and Development (OECD), Grundtham and \nRhum (2006) observed that all-cause and cause-specific mortality increase when labour markets \nstrengthen, but that the procyclical fluctuation in mortality is much stronger in countries with lower \npublic social expenditures (Gerdtham and Ruhm 2006). Stuckler and colleagues  observed similar \nfindings across the 26 countries of the European Union (Stuckler, Basu et al. 2009).  \n \nConcluding comments \n \nReferences \n \nBosma, H., H. D. van de Mheen, et al. (2001). \"Neighborhood socioeconomic status and all-cause \nmortality.\" American Journal of Epidemiology 153(4): 363-371. \nCharles, K. K. and P. DeCicca (2008). \"Local labor market fluctuations and health: Is there a \nconnection and for whom?\" Journal of Health Economics 27(6): 1532-1550. \nCummins, S., S. Macintyre, et al. (2005). \"Measuring neighbourhood social and material context: \ngeneration and interpretation of ecological data from routine and non-routine sources.\" \nHealth & Place 11(3): 249-260. \nEdwards, R. (2008). \"Who is hurt by procyclical mortality?\" Social Science & Medicine 67(12): 2051-\n2058. \nEquality and Human Rights Commission, Department for work and pensions, et al. (2009). \nMonitoring the impact of the recession on various demographic groups. England. \nFone, D., F. Dunstan, et al. (2007). \"Places, people and mental health: A multilevel analysis of \neconomic inactivity.\" Social Science & Medicine 64(3): 633-645. \nFone, D., K. Lloyd, et al. (2007). \"Measuring the neighbourhood using UK benefits data: a multilevel \nanalysis of mental health status.\" Bmc Public Health 7. \nGerdtham, U. G. and M. Johannesson (2005). \"Business cycles and mortality: results from Swedish \nmicrodata.\" Social Science & Medicine 60(1): 205-218. \nGerdtham, U. G. and C. J. Ruhm (2006). \"Deaths rise in good economic times: Evidence from the \nOECD.\" Economics & Human Biology 4(3): 298-316. \nKondo, N., S. V. Subramanian, et al. (2008). \"Economic recession and health inequalities in Japan: \nanalysis with a national sample, 1986-2001.\" Journal of Epidemiology and Community Health \n62(10): 869-875. \nLaporte, A. (2004). \"Do economic cycles have a permanent effect on population health? Revisiting \nthe Brenner hypothesis.\" Health Economics 13(8): 767-779. \nMartikainen, P. T. and T. Valkonen (1996). \"Excess mortality of unemployed men and women during \na period of rapidly increasing unemployment.\" Lancet 348(9032): 909-912. \nMiller, D. L., M. E. Page, et al. (2009). \"Why Are Recessions Good for Your Health?\" American \nEconomic Review 99(2): 122-127. \nNeumayer, E. (2004). \"Recessions lower (some) mortality rates: evidence from Germany.\" Social \nScience & Medicine 58(6): 1037-1047. \nOffice for National Statistics (2009). The impact of the recession on the labour market. England. \nRiva, M., C. Bambra, et al. (In Press). \"Collective resources or local social inequalities? Examining the \nsocial determinants of mental health in rural areas.\" European Journal of Public Health. \nRuhm, C. J. (2000). \"Are recessions good for your health?\" Quarterly Journal of Economics 115(2): \n617-650. \nRuhm, C. J. (2007). \"In healthy economy can break your heart.\" Demography 44(4): 829-848. \nRuhm, C. J. and W. E. Black (2002). \"Does drinking really decrease in bad times?\" Journal of Health \nEconomics 21(4): 659-678. \nStafford, M., S. Cummins, et al. (2005). \"Gender differences in the associations between health and \nneighbourhood environment.\" Social Science & Medicine 60(8): 1681-1692. \nStafford, M., P. Martikainen, et al. (2004). \"Neighbourhoods and self rated health: a comparison of \npublic sector employees in London and Helsinki.\" Journal of Epidemiology and Community \nHealth 58(9): 772-778. \nStuckler, D., S. Basu, et al. (2009). \"The public health effect of economic crises and alternative policy \nresponses in Europe: an empirical analysis.\" Lancet 374(9686): 315-323. \nTapia Granados, J. A. (2005). \"Increasing mortality during the expansions of the US economy, 1900-\n1996.\" Int J Epidemiol 34(6): 1194-202. \nTapia Granados, J. A. and E. L. Ionides (2008). \"The reversal of the relation between economic \ngrowth and health progress: Sweden in the 19th and 20th centuries.\" J Health Econ 27(3): \n544-63. \nValkonen, T. and P. Martikainen (1996). The association between unemployment and \nmortality:causation or selection? Adult mortality in developed countries: from description to \nexplanation. A. Lopez, G. Casell and T. Valkonen. Oxford, UK Clarendon Press: 1859-1861. \n \n \n"}