{"doi":"10.1016\/j.ijfoodmicro.2009.01.037","coreId":"138868","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3556","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3556","10.1016\/j.ijfoodmicro.2009.01.037"],"title":"Behavior of Escherichia coli O157:H7, Listeria monocytogenes, and Salmonella Typhimurium in teewurst, a raw spreadable sausage","authors":["Dourou, Dimitra","Porto-Fett, Anna C. S.","Shoyer, Brad","Call, Jeffrey E.","Nychas, George-John E.","Illg, Ernst K.","Luchansky, John B."],"enrichments":{"references":[{"id":38092112,"title":"A large outbreak of haemolytic uremic syndrome caused by an unusual sorbitol-fermenting strain of Escherichia coli 0157:H-.","authors":[],"date":"1999","doi":"10.1086\/314715","raw":"Ammon, A., Petersen, L.R., Karch, H., 1999. A large outbreak of haemolytic uremic syndrome  caused  by  an  unusual  sorbitol-fermenting  strain  of  Escherichia  coli 0157:H-. Journal of Infectious Diseases 179, 1274-1277.","cites":null},{"id":38092113,"title":"A study of the role of different nitrite concentrations on human pathogenic bacteria in fresh spreadable ham and onion sausage.","authors":[],"date":"2005","doi":"10.1016\/j.foodcont.2004.06.006","raw":"Birzele,  B.,  Djordjević,  S.,  Krämer,  J.,  2005.  A  study  of  the  role  of  different  nitrite concentrations  on  human  pathogenic  bacteria  in  fresh  spreadable  ham  and  onion sausage. Food Control 16, 695-699.","cites":null},{"id":38092119,"title":"Available at: http:\/\/www.fao.org\/docrep\/010\/y5394e\/y5394e00.htm.","authors":[],"date":"2007","doi":null,"raw":"Available  at:  http:\/\/www.fao.org\/docrep\/010\/y5394e\/y5394e00.htm.  Accessed  20 March 2007.","cites":null},{"id":38092123,"title":"Bacteriocinogenic lactic acid bacteria for the biopreservation of meat and meat products.","authors":[],"date":"1998","doi":"10.1016\/s0309-1740(98)00080-1","raw":"Hugas, M., 1998. Bacteriocinogenic lactic acid bacteria for the biopreservation of meat and meat products. Meat Science 49, S139-S150.","cites":null},{"id":38092131,"title":"Behaviour of pathogenic Escherichia coli in short fermented spreadable raw sausage. The influence of the internal physical and chemical parameters.","authors":[],"date":"2006","doi":null,"raw":"Rödel,  W.,  Scheuer,  R.,  2006.  Behaviour  of  pathogenic  Escherichia  coli  in  short fermented  spreadable  raw  sausage.  The  influence  of  the  internal  physical  and chemical parameters. Fleischwirtschaft 86, 119-122.","cites":null},{"id":38092118,"title":"Characterisation of naturally fermented sausages produced in the North East of Italy.","authors":[],"date":"2005","doi":"10.1016\/j.meatsci.2004.08.007","raw":"Comi, G., Urso, R., Iacumin, L.,  Rantsiou, K.,  Cattaneo, P.,  Cantoni, C., Cocolin, L., 2005. Characterisation of naturally fermented sausages produced in the North East of Italy. Meat Science 69, 381-392.  ACCEPTED MANUSCRIPT ACCEPTED MANUSCRIPT Food  and  Agriculture  Organization  of  the  United  Nations\/World  Health  Organization (FAO\/WHO). 2004. Risk assessment of Listeria monocytogenes in ready-to-eat foods –  Technical  Report.  Microbiological  Risk  Assessment  Series  5.  Rome,  Italy.","cites":null},{"id":38092121,"title":"Cluster of listeriosis cases in France. Euro Surveillance 6(27):pii=1931. Available at: http:\/\/ www.eurosurveilance.org\/ViewArticle.","authors":[],"date":"2002","doi":null,"raw":"Goulet, V., Martin, P., Jacquet, C., 2002. Cluster of listeriosis cases in France. Euro Surveillance  6(27):pii=1931.  Available  at:  http:\/\/ www.eurosurveilance.org\/ViewArticle. aspx?Articleld=1931. Accessed 3 June 2007.","cites":null},{"id":38092148,"title":"Consumer phase risk assessment for Listeria monocytogenes in deli meats.","authors":[],"date":"2006","doi":"10.1111\/j.1539-6924.2006.00717.x","raw":"Yang, H., Mokhtari, A., Morales, L.A., Cates, S.C., Cowen, P., 2006. Consumer phase risk assessment for Listeria monocytogenes in deli meats. Risk Analysis 26, 89-103. ACCEPTED MANUSCRIPT ACCEPTED MANUSCRIPT","cites":null},{"id":38092114,"title":"Consumption, knowledge, and handling of raw meat: a representative cross-sectional survey in Germany,","authors":[],"date":"2005","doi":null,"raw":"Bremer,  V.,  Bocter,  N.,  Rehmet,  S.,  Klein,  G.,  Breuer,  T.,    Ammon,  A.,  2005. Consumption, knowledge, and handling of raw meat: a representative cross-sectional survey in Germany, March 2001. Journal of Food Protection 68, 785-789.","cites":null},{"id":38092133,"title":"Detection and prevalence of verotoxin-producing Escherichia coli (VTEC) in raw sausages.","authors":[],"date":"1999","doi":"10.1007\/bf03042117","raw":"Timm, M., Klie, H., Richter, H., Gallien, P., Perlberg, K.W., Lehman, S., Protz, D., 1999. Detection and prevalence of verotoxin-producing Escherichia coli (VTEC) in raw sausages. Berliner und Münchener Tierärztliche Wochenschrrift 112, 385-389.","cites":null},{"id":38092122,"title":"Effect of packaging and storage temperature on the survival of Listeria monocytogenes inoculated postprocessing on sliced salami.","authors":[],"date":"2007","doi":null,"raw":"Gounadaki,  A.S.,  Skandamis,  P.N.,  Drosinos,  E.H.,  Nychas,  G.-J.E.,  2007.  Effect  of packaging  and  storage  temperature  on  the  survival  of  Listeria  monocytogenes inoculated  postprocessing  on  sliced  salami.  Journal  of  Food  Protection  70,  2313-2320.","cites":null},{"id":38092117,"title":"Fermented meats - a world perspective. In: Campbell-Platt,","authors":[],"date":"1995","doi":"10.1007\/978-1-4615-2163-1_2","raw":"Campbell-Platt, G., 1995. Fermented meats - a world perspective. In: Campbell-Platt, G., Cook, P.E. (Eds.), Fermented meats. Blackie Academic and Professional, London, pp. 39-52.","cites":null},{"id":38092134,"title":"Focus on: sausages. Available at: http:\/\/www.fsis.usda.gov\/FactSheets\/Sausage_and_Food_Safety\/index.asp.","authors":[],"date":"1993","doi":null,"raw":"United  States  Department  of  Agriculture\/Food  Safety  and  Inspection  Service (USDA\/FSIS).  1993.  Focus  on:  sausages.  Available  at: http:\/\/www.fsis.usda.gov\/FactSheets\/Sausage_and_Food_Safety\/index.asp.  Accessed 18 August 2005.  ACCEPTED MANUSCRIPT ACCEPTED MANUSCRIPT United  States  Department  of  Agriculture\/Food  Safety  and  Inspection  Service (USDA\/FSIS). 1994. Mandatory safe handling statements on labelling of raw and partially  cooked  meat  and  poultry  products.  Directive  7235.1.  Available  at: http:\/\/www.fsis.usda.gov\/OPPDE\/rdad\/FSISDirectives\/7235.1.pdf. Accessed 10 May 2006.","cites":null},{"id":38092135,"title":"of Agriculture\/Food Safety and Inspection Service (USDA\/FSIS).","authors":[],"date":"2005","doi":null,"raw":"United  States  Department  of  Agriculture\/Food  Safety  and  Inspection  Service (USDA\/FSIS).    2005.  Food  standards  and  labeling  policy  book.  Available  at: http:\/\/www.fsis.gov\/OPPDE\/larc\/policies\/Labeling_Policy_Book_082005.pdf.","cites":null},{"id":38092132,"title":"Pathogens: risks and control.","authors":[],"date":"2007","doi":"10.1002\/9780470376430.ch42","raw":"Skandamis, P.N., Nychas, G.-J.E., 2007. Pathogens: risks and control. In: F. Toldrá (ed.), Handbook of Fermented Meat and Poultry. Blackwell Publishing, London, pp. 427-454.","cites":null},{"id":38092115,"title":"Processed meat products. In:","authors":[],"date":"2000","doi":"10.1201\/9781420042177.ch11","raw":"Brown, M.H., 2000. Processed meat products. In: Lund, B.M., Baird-Parker, T.C., Gould G.W. (Eds.), The microbiological safety and quality of food, vol. 1. Aspen Publishers, Inc., Gaithersburg, pp. 389-419.","cites":null},{"id":38092128,"title":"Production and consumption of fermented meat products. In: Toldrá,","authors":[],"date":"2007","doi":"10.1002\/9781118522653.ch2","raw":"Ockerman,  H.W.,  Basu,  L.,  2007.  Production  and  consumption  of  fermented  meat products. In: Toldrá, F. (Ed.), Handbook of fermented meat and poultry. Blackwell Publishing, Ames, pp. 9-15.","cites":null},{"id":38092126,"title":"Risk profiles of pork and poultry meat and risk ratings of various pathogen\/product combinations.","authors":[],"date":"2008","doi":"10.1016\/j.ijfoodmicro.2008.05.014","raw":"Mataragas, M., Skandamis, P.N., Drosinos, E.H., 2008. Risk profiles of pork and poultry meat  and  risk  ratings  of  various  pathogen\/product  combinations.    International Journal of Food Microbiology 126, 1-12 McNeal, J.E., 1990. Meat and meat products. In: Herlich, K. (Ed.), Official methods of analysis, 15 th ed. Association of Official Analytical Chemists, Arlington, pp. 931-938.","cites":null},{"id":38092129,"title":"Shiga toxin-producing Escherichia coli (STEC) in meat processing companies: an overview of five studies from 1997 to 2002. Abstract P9,","authors":[],"date":"2004","doi":null,"raw":"Pichner,  R.,  Steinrück,  H.,  Gareis,  M.,  2004.  Shiga  toxin-producing  Escherichia  coli (STEC) in meat processing companies: an overview of five studies from 1997 to 2002. Abstract P9, p. 151. In: Maunsell, B., Sheridan, J., Bolton, D.J. (Eds.), Food pathogen  epidemiology:  microbes,  maladies  and  methods—proceedings  of  an international  EU-RAIN  conference  hosted  by  the  Istituto  Zooprofilattico Sperimentale delle Venezie, Padua, Italy, December 2nd–3rd 2004. Dublin, Ireland: Teagasc - The National Food Centre - European Union Risk Analysis Information Network.  ACCEPTED MANUSCRIPT ACCEPTED MANUSCRIPT Porto-Fett,  A.C.S.,  Call,  J.E.,  Luchansky,  J.B.,  2008a.  Validation  of  a  commercial process for inactivation of Escherichia coli O157:H7, Salmonella Typhimurium, and Listeria monocytogenes on the surface of whole muscle beef jerky. Journal of Food Protection 71, 918-926.","cites":null},{"id":38092146,"title":"Shiga toxin-producing Escherichia coli infection in Germany - different risk factors for different ages.","authors":[],"date":"2006","doi":"10.1093\/aje\/kwk023","raw":"Werber, D., Behnke, S.C., Fruth, A., Merle, R., Menzler, S., Glaser, S., Kreienbrock, L., Prager, R.,  Tschäpe, H., Roggentin, P., Bockemühl, J., Ammon, A., 2006. Shiga toxin-producing  Escherichia  coli  infection  in  Germany  -  different  risk  factors  for different ages. American Journal Epidemiology 165, 425-434.","cites":null},{"id":38092124,"title":"Strategy of assessment of fresh and spreadable raw sausage.","authors":[],"date":"2005","doi":null,"raw":"Islam, R., Jöckel, J., 2005. Strategy of assessment of fresh and spreadable raw sausage. Fleischwirtschaft 6, 103-105.","cites":null},{"id":38092120,"title":"Survival of Listeria monocytogenes during the production of uncooked German, American and Italianstyle fermented sausages.","authors":[],"date":"1993","doi":"10.1006\/fmic.1993.1013","raw":"Farber,  J.M.,  Daley,  E.,  Holley,  R.,  Usborne,  W.R.  1993.  Survival  of  Listeria monocytogenes during the production of uncooked German, American and Italianstyle fermented sausages. Food Microbiology 10, 123-132.","cites":null},{"id":38092125,"title":"The behaviour of Listeria monocytogenes in sucuks produced with different lactic starter cultures.","authors":[],"date":"2004","doi":null,"raw":"Kaya,  M.,  Gökalp,  H.Y.,  2004.  The  behaviour  of  Listeria  monocytogenes  in  sucuks produced  with  different  lactic  starter  cultures.  Turkish  Journal  of  Veterinary  and Animal Sciences 28, 1113-1120. ACCEPTED MANUSCRIPT ACCEPTED MANUSCRIPT Lücke, F.K., 2000. Utilization of microbes to process and preserve meat. Meat Science 56, 105-116.","cites":null},{"id":38092116,"title":"Validation of a manufacturing process for fermented, semidry Turkish soudjouk to control Escherichia coli O157:H7.","authors":[],"date":"2001","doi":null,"raw":"Calicioglu,  M.,  Faith,  N.G.,  Buege,  D.R.,  Luchansky,  J.B.,  2001.  Validation  of  a manufacturing  process  for  fermented,  semidry  Turkish  soudjouk  to  control Escherichia coli O157:H7. Journal of Food Protection 64, 1156–1161.","cites":null},{"id":38092127,"title":"Validation of a traditional Italian-style salami manufacturing process for control of Salmonella and L. monocytogenes.","authors":[],"date":"2006","doi":null,"raw":"Nightingale, K.K., Thippareddi, H., Marsden, R.K., Nutsch, A.L., 2006. Validation of a traditional Italian-style salami manufacturing process for control of Salmonella and L. monocytogenes. Journal of Food Protection 69, 794-800.","cites":null},{"id":38092130,"title":"Viability of multi-strain mixtures of Listeria monocytogenes, Salmonella typhimurium, or Escherichia coli O157:H7 inoculated into the batter or onto the surface of a soudjouk-style fermented semi-dry sausage.","authors":[],"date":"2008","doi":"10.1016\/j.fm.2008.04.012","raw":"Porto-Fett, A.C.S., Hwang, C.-A., Call, J.E., Juneja, V.K., Ingham, S.C., Ingham, B.H., Luchansky, J.B., 2008b. Viability of multi-strain mixtures of Listeria monocytogenes, Salmonella typhimurium, or Escherichia coli O157:H7 inoculated into the batter or onto the surface of a soudjouk-style fermented semi-dry sausage. Food Microbiology 25, 793-801.","cites":null}],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2009-04-15","abstract":"The fate of Listeria monocytogenes, Salmonella Typhimurium, or Escherichia coli O157:H7 were separately monitored both in and on teewurst, a traditional raw and spreadable sausage of Germanic origin. Multi-strain cocktails of each pathogen (ca. 5.0 log CFU\/g) were used to separately inoculate teewurst that was subsequently stored at 1.5, 4, 10, and 21 °C. When inoculated into commercially-prepared batter just prior to stuffing, in general, the higher the storage temperature, the greater the lethality. Depending on the storage temperature, pathogen levels in the batter decreased by 2.3 to 3.4, ca. 3.8, and 2.2 to 3.6 log CFU\/g for E. coli O157:H7, S. Typhimurium, and L. monocytogenes, respectively, during storage for 30 days. When inoculated onto both the top and bottom faces of sliced commercially-prepared finished product, the results for all four temperatures showed a decrease of 0.9 to 1.4, 1.4 to 1.8, and 2.2 to 3.0 log CFU\/g for E. coli O157:H7, S. Typhimurium, and L. monocytogenes, respectively, over the course of 21 days. With the possible exceptions for salt and carbohydrate levels, chemical analyses of teewurst purchased from five commercial manufacturers revealed only subtle differences in proximate composition for this product type. Our data establish that teewurst does not provide a favourable environment for the survival of E. coli O157:H7, S. Typhimurium, or L. monocytogenes inoculated either into or onto the product","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138868.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.ijfoodmicro.2009.01.037","pdfHashValue":"92284015910d8520543ec9e53b11db8e770a6b15","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3556<\/identifier><datestamp>2009-08-07T10:11:51Z<\/datestamp><setSpec>hdl_1826_2005<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Behavior of Escherichia coli O157:H7, Listeria monocytogenes, and Salmonella Typhimurium in teewurst, a raw spreadable sausage<\/dc:title><dc:creator>Dourou, Dimitra<\/dc:creator><dc:creator>Porto-Fett, Anna C. S.<\/dc:creator><dc:creator>Shoyer, Brad<\/dc:creator><dc:creator>Call, Jeffrey E.<\/dc:creator><dc:creator>Nychas, George-John E.<\/dc:creator><dc:creator>Illg, Ernst K.<\/dc:creator><dc:creator>Luchansky, John B.<\/dc:creator><dc:subject>Escherichia coli O157:H7<\/dc:subject><dc:subject>Listeria monocytogenes<\/dc:subject><dc:subject>Salmonella Typhimurium<\/dc:subject><dc:subject>Food safety<\/dc:subject><dc:subject>Teewurst<\/dc:subject><dc:subject>Meats<\/dc:subject><dc:description>The fate of Listeria monocytogenes, Salmonella Typhimurium, or Escherichia coli O157:H7 were separately monitored both in and on teewurst, a traditional raw and spreadable sausage of Germanic origin. Multi-strain cocktails of each pathogen (ca. 5.0 log CFU\/g) were used to separately inoculate teewurst that was subsequently stored at 1.5, 4, 10, and 21 °C. When inoculated into commercially-prepared batter just prior to stuffing, in general, the higher the storage temperature, the greater the lethality. Depending on the storage temperature, pathogen levels in the batter decreased by 2.3 to 3.4, ca. 3.8, and 2.2 to 3.6 log CFU\/g for E. coli O157:H7, S. Typhimurium, and L. monocytogenes, respectively, during storage for 30 days. When inoculated onto both the top and bottom faces of sliced commercially-prepared finished product, the results for all four temperatures showed a decrease of 0.9 to 1.4, 1.4 to 1.8, and 2.2 to 3.0 log CFU\/g for E. coli O157:H7, S. Typhimurium, and L. monocytogenes, respectively, over the course of 21 days. With the possible exceptions for salt and carbohydrate levels, chemical analyses of teewurst purchased from five commercial manufacturers revealed only subtle differences in proximate composition for this product type. Our data establish that teewurst does not provide a favourable environment for the survival of E. coli O157:H7, S. Typhimurium, or L. monocytogenes inoculated either into or onto the product.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2009-08-07T10:11:51Z<\/dc:date><dc:date>2009-08-07T10:11:51Z<\/dc:date><dc:date>2009-04-15<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Dimitra Dourou, Anna C.S. Porto-Fett, Brad Shoyer, Jeffrey E. Call, George-John E. Nychas, Ernst K. Illg, John B. Luchansky, Behavior of Escherichia coli O157:H7, Listeria monocytogenes, and Salmonella Typhimurium in teewurst, a raw spreadable sausage, International Journal of Food Microbiology, Volume 130, Issue 3, 15 April 2009, Pages 245-250<\/dc:identifier><dc:identifier>0168-1605<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.ijfoodmicro.2009.01.037<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/3556<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0168-1605","0168-1605"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["Escherichia coli O157:H7","Listeria monocytogenes","Salmonella Typhimurium","Food safety","Teewurst","Meats"],"subject":["Article"],"fullText":"\u0000\u0002\u0002\u0003\u0004\u0005\u0003\u0006 \u0007\b\t\n\u000b\u0002\f\r\u0004\u0005\nBehavior of Escherichia coli O157:H7, Listeria monocytogenes, and\nSalmonella Typhimurium in teewurst, a raw spreadable sausage\nDimitra Dourou, Anna C.S. Porto-Fett, Brad Shoyer, Jeffrey E. Call,\nGeorge-John E. Nychas, Ernst K. Illg, John B. Luchansky\nPII: S0168-1605(09)00077-4\nDOI: doi: 10.1016\/j.ijfoodmicro.2009.01.037\nReference: FOOD 4675\nTo appear in: International Journal of Food Microbiology\nReceived date: 9 December 2008\nRevised date: 28 January 2009\nAccepted date: 30 January 2009\nPlease cite this article as: Dourou, Dimitra, Porto-Fett, Anna C.S., Shoyer, Brad,\nCall, Jeffrey E., Nychas, George-John E., Illg, Ernst K., Luchansky, John B., Behav-\nior of Escherichia coli O157:H7, Listeria monocytogenes, and Salmonella Typhimurium in\nteewurst, a raw spreadable sausage, International Journal of Food Microbiology (2009), doi:\n10.1016\/j.ijfoodmicro.2009.01.037\nThis is a PDF file of an unedited manuscript that has been accepted for publication.\nAs a service to our customers we are providing this early version of the manuscript.\nThe manuscript will undergo copyediting, typesetting, and review of the resulting proof\nbefore it is published in its final form. Please note that during the production process\nerrors may be discovered which could affect the content, and all legal disclaimers that\napply to the journal pertain.\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 1 \nBehavior of Escherichia coli O157:H7, Listeria 1 \nmonocytogenes, and Salmonella Typhimurium in teewurst, a 2 \nraw spreadable sausage 3 \nDimitra Dourou a,c, Anna C. S. Porto-Fett b, Brad Shoyer b, Jeffrey E. Call b, 4 \nGeorge-John E. Nychas a, Ernst K. Illg d, and John B. Luchansky b,* 5 \na Department of Food Science and Technology, Laboratory of Microbiology and Biotechnology 6 \nof Foods, Agricultural University of Athens, GR-11855, Greece 7 \nb\n U. S. Department of Agriculture, Agricultural Research Service, Eastern Regional Research 8 \nCenter, Microbial Food Safety Research Unit, 600 East Mermaid Lane, Wyndmoor, PA, 19038 9 \nc\n Cranfield Health, Laboratory of Applied Microbiology, Cranfield University, 10 \nBedfordshire MK43 0AL, UK 11 \nd\n Ernst A. Illg Meats, Inc., Chalfont, PA. 12 \nRunning title: Fate of pathogens in and on teewurst. 13 \nKeywords: Escherichia coli O157:H7, Listeria monocytogenes, Salmonella Typhimurium, 14 \npathogen, food safety, teewurst, meats. 15 \n* Corresponding author: U. S. Department of Agriculture, Agricultural Research Service, 16 \nEastern Regional Research Center, Microbial Food Safety Research Unit, 600 East Mermaid 17 \nLane, Wyndmoor, PA, 19038. Tel: 215-233-6676; Fax: 215-233-6581.  18 \nE-mail: John.Luchansky@ars.usda.gov 19 \n† Mention of trade names or commercial products in this publication is solely for the purpose of 20 \nproviding specific information and does not imply recommendation or endorsement by the U.S. 21 \nDepartment of Agriculture. 22 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 2 \nAbstract 23 \nThe fate of Listeria monocytogenes, Salmonella Typhimurium, or Escherichia coli 24 \nO157:H7 were separately monitored both in and on teewurst, a traditional raw and spreadable 25 \nsausage of Germanic origin. Multi-strain cocktails of each pathogen (ca. 5.0 log CFU\/g) were 26 \nused to separately inoculate teewurst that was subsequently stored at 1.5, 4, 10, and 21°C. When 27 \ninoculated into commercially-prepared batter just prior to stuffing, in general, the higher the 28 \nstorage temperature, the greater the lethality. Depending on the storage temperature, pathogen 29 \nlevels in the batter decreased by 2.3 to 3.4, ca. 3.8, and 2.2 to 3.6 log CFU\/g for E. coli O157:H7, 30 \nS. Typhimurium, and L. monocytogenes, respectively, during storage for 30 days. When 31 \ninoculated onto both the top and bottom faces of sliced commercially-prepared finished product, 32 \nthe results for all four temperatures showed a decrease of 0.9 to 1.4, 1.4 to 1.8, and 2.2 to 3.0 log\n \n33 \nCFU\/g for E. coli O157:H7, S. Typhimurium, and L. monocytogenes, respectively, over the 34 \ncourse of 21 days. With the possible exceptions for salt and carbohydrate levels, chemical 35 \nanalyses of teewurst purchased from five commercial manufacturers revealed only subtle 36 \ndifferences in proximate composition for this product type. Our data establish that teewurst does 37 \nnot provide a favourable environment for the survival of E. coli O157:H7, S. Typhimurium, or L. 38 \nmonocytogenes inoculated either into or onto the product. 39 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 3 \n1. Introduction 40 \nTeewurst is a traditional sausage of Germanic origin, typically made from pork and 41 \nbeef, that is characterized by a soft spreadable texture. It is usually manufactured by 42 \nsmall producers and sold under refrigeration as a raw spreadable meat (USDA, 1993, 43 \nUSDA, 2005). At present, there is a general lack of criteria for both the manufacture and 44 \nthe compositional descriptions for fresh and raw spreadable sausages, including teewurst 45 \n(Islam and Jockel, 2005). Teewurst is grouped with other meat products such as 46 \nmettwurst that display a relatively low acid content (e.g., pH 5.3-5.5) and high moisture 47 \ncontent (e.g., aw ≥0.95) (Brown, 2000). Processing and preparation of this product does 48 \nnot typically include any heat treatment or antimicrobial interventions other than the 49 \nsalts, spices, nitrites, and perhaps phenolics contributed by liquid smoke, that are added 50 \ndirectly to the batter (Brown, 2000). The teewurst manufactured in the USA is the same 51 \nas the teewurst produced in Germany, unless it is cooked, as is practiced by some 52 \nmanufacturers. As USA regulations stipulate, true product names and a “safe handling 53 \nstatement” must be accurately affixed to the label to provide consumers with the ability to 54 \nchoose between “teewurst uncooked, cured meat spread” or “cooked teewurst”, with the 55 \nformer being “raw”. 56 \nThe association of teewurst with foodborne illnesses in recent years is well 57 \ndocumented (Ammon et al., 1999, Werber et al., 2006). In Germany, consumption of raw 58 \nspreadable sausages, including teewurst, was identified as a risk factor for sporadic 59 \nillnesses associated with Shiga toxin producing E. coli (STEC) in persons aged 10 years 60 \nor older (Werber et al., 2006). Similarly, a large outbreak (28 cases, 3 deaths) of 61 \nhaemolytic uremic syndrome (HUS) caused by a sorbitol-fermenting strain of E. coli 62 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 4 \nO157:H- was associated with consumption of teewurst, a raw pork product, and 63 \nmortadella, a cooked pork product (Ammon et al., 1999). Although teewurst is intended 64 \nto be cooked by the consumer, its production includes ingredients such as nitrites that 65 \ncause the raw sausage to appear as a ready-to-eat (RTE) product; therefore, teewurst is 66 \nnotoriously eaten without proper cooking, either by preference or by perception. In a 67 \nsurvey conducted in Germany in 2001 related to knowledge and handling of raw meat, 68 \nand in particular teewurst, ca. 50% of the 510 participants reported eating teewurst and, 69 \nsomewhat surprisingly, only ca. 36% of them recognised it as a raw meat product 70 \n(Bremer et al., 2005). Thus, this study was conducted to evaluate the behaviour of E. coli 71 \nO157:H7, S. Typhimurium, and L. monocytogenes inoculated either into the batter or 72 \nonto the surface of sliced teewurst that was subsequently stored under aerobic conditions 73 \nat refrigeration and abuse temperatures. Proximate composition analyses of commercial 74 \nteewurst produced by five relatively small processors were also conducted to address the 75 \npotential variety and range of chemical traits, since a standard of identity does not 76 \ncurrently exist for this product. 77 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n5 \n2. Materials and methods 78 \n2.1. Bacterial strains 79 \nThe multi-strain cocktails of L. monocytogenes (MFS2, MFS102, MFS104, MFS105, and 80 \nMFS110), E. coli O157:H7 (EC505B, C7927, and SLH21788), and S. Typhimurium (H3278, 81 \nG7601, H3402, H2662, H3380, and G8430) used in this study were confirmed, cultured, 82 \ncombined, and\/or maintained as described previously (Porto-Fett et al., 2008a). 83 \n2.2. Formulation and manufacture of teewurst 84 \nThe formulation of teewurst batter, as purchased from a local manufacturer (Ernst A. Illg 85 \nMeats, Inc.; Chalfont, PA), consisted of certified pork trimmings (60 lbs; fat-lean ratio 70%-86 \n30%), boneless beef plates (40 lbs; fat-lean ratio 70%-30%), and 3.83 lbs of the following non-87 \nmeat ingredients: seasoning spices (First Spice Mixing Co., Long Island City, NY), sodium 88 \nnitrite curing salt, liquid smoke flavoring, paprika, cardamom, and sugar. The manufacturing 89 \nprocess for this brand of teewurst is shown in Figure 1. Chubs and slices of this brand of 90 \nfinished teewurst are shown in Figure 2. 91 \n2.3. Inoculation of teewurst batter 92 \n To simulate contamination at the processing plant, three batches (one batch per trial) of 93 \nfreshly-processed teewurst batter were separately inoculated with ca. 5.2 log CFU\/g of each 94 \nmulti-strain pathogen cocktail. After inoculation, the batter was mixed at ambient temperature 95 \n(22° ± 1°C) using a commercial countertop mixer (Univex SRM12; Salem, NH) for ca. 2 min to 96 \nensure for relatively even distribution of the inoculum. The batter was stuffed using a 97 \ncommercial (manual) stuffer (D-73779; Dick, Deizisau, Germany) into commercial 4.5 cm 98 \ndiameter artificial “fibrous” casings (F Plus; Walsroder GMBH, Germany) in portions of ca. 99 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n6 \n100 g. The resulting chubs were stored at 1.5, 4, 10, or 21°C for up to 30 days. In each of the 100 \nthree trials two chubs were sampled at each sampling interval (N = 3 trials; n = 2 101 \nreplicates\/chubs per sampling interval per trial). It should be noted that the terms “batter” and 102 \n“chub” herein refer to teewurst inoculated prior to stuffing. 103 \n2.4. Inoculation of the surface of teewurst slices 104 \nTo simulate post-process contamination in the home or in a food service establishment, 105 \nthree batches (one batch per trial) of freshly-processed teewurst were obtained from our 106 \ncollaborating manufacturer as above. Teewurst was transferred aseptically from the original 107 \npackages onto sterile styrofoam trays (1012S; Genpak, Glens Falls, NY) and sliced (ca. 20 g 108 \neach slice, ca. 5 cm diameter) with the aid of an ethanol-sterilized knife. Individual slices were 109 \nplaced onto styrofoam trays (Genpak) and separately inoculated on the top surface of each slice 110 \nwith 50 µl of each multi-strain pathogen cocktail.  Cells were then distributed with the aid of a 111 \nsterile plastic cell spreader (Midsci; St. Louis, MO). The trays containing the inoculated 112 \nteewurst were placed into a biological safety cabinet and held for ca. 15 min at ambient 113 \ntemperature (22 ± 1°C) to allow for the inocula to better attach to the meat slices. Next, the 114 \nslices were inverted and the process was repeated on the opposite side. The final concentration 115 \nof each pathogen was ca. 4.5 log\n \nCFU\/g. Inoculated slices (one slice per bag) were then placed 116 \ninto sterile polyethylene bags (Ziploc Brand Snack Bags; S.C. Johnson Products, Inc., Racine 117 \nWI). The bags were stored at 1.5, 4, 10, or 21°C for up to 21 days. In each of the three trials two 118 \nbags\/slices were sampled at each sampling interval (N = 3 trials; n = 2 replicates\/slices per 119 \nsampling interval per trial). 120 \n2.5. Microbiological analyses 121 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n7 \n Initial and final populations of total plate count (TPC) and total lactic acid bacteria (LAB) 122 \nwere enumerated on slices and in chubs as follows. A total of three slices (ca. 20 g each) or 123 \nthree chubs (ca. 5 g each), from each of the three trials\/batches tested, were separately 124 \ntransferred into plastic two-chamber filter stomacher bags (Fisherbrand; Fisher Scientific, 125 \nPittsburgh, PA) containing 15 or 45 ml of 0.1% sterile peptone water (Difco, Becton, Dickinson 126 \nand Co., Sparks, MD), respectively, and stomached for ca. 2 min (Stomacher 400; Seward, 127 \nCincinnati, OH). The TPC were enumerated by spread-plating 100 µl of the resulting slurry, 128 \nwith or without prior dilution in sterile peptone water, onto Brain Heart Infusion agar plates 129 \n(BHI; Difco,) and aerobic incubation at 30°C for 72 h. For enumeration of LAB, appropriate 130 \ndilutions of the slurry were spread-plated (100 µl) onto deMan Rogosa Sharpe agar (MRS; 131 \nDifco) and incubated anaerobically at 37°C for 72 h (10.1% carbon dioxide, 4.38% hydrogen 132 \nand the balance in nitrogen; Bactron IV Anaerobic\/Environmental Chamber; Sheldon 133 \nManufacturing Inc., Cornelius, OR).   134 \nFor enumeration of E. coli O157:H7, S. Typhimurium, and L. monocytogenes from 135 \nteewurst, the inoculated slices and chubs were sampled at periodic intervals and treated as 136 \nabove and appropriate dilutions of the resulting slurry were surface-plated (100 µl) onto 137 \nModified Oxford agar for enumeration of L. monocytogenes (MOX; Difco), MacConkey 138 \nsorbitol agar for enumeration of E. coli O157:H7 (SMAC; Difco), and xylose lysine tergitol-4 139 \nagar for enumeration of S. Typhimurium (XLT4; Difco). Typical colonies of each pathogen 140 \nwere counted after aerobic incubation of plates at 37°C for 48 h (MOX) or 24 h (SMAC and 141 \nXLT4). When pathogen numbers in batter decreased to ≤1.0 log CFU\/g by direct plating, their 142 \npresence or absence were determined by enrichment as described (Porto-Fett et al., 2008a). 143 \n2.6. Physicochemical analyses 144 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n8 \nAt both the beginning and at the end of storage, control (non-inoculated) teewurst samples 145 \n[N = 3 trials; n = 3 slices (ca. 20 g each) or n = 3 chubs (ca. 5 g each) per trial] were analyzed 146 \nfor pH and aw by using a model 6000P pH\/temperature electrode and a model 5500 pH meter 147 \n(Daigger, Vernon Hills, IL) and a water activity meter (Decagon Aqualab Model series 3; 148 \nDecagon Devices, Pullman, WA), respectively, according to the manufacturer’s instructions. 149 \nFor the market basket component of this study, two chubs from each brand were analyzed to 150 \ndetermine the proximate composition of the teewurst purchased from five commercial 151 \nprocessors as determined by a commercial laboratory using methods approved and described by 152 \nthe Association of Official Analytical Chemists (McNeal, 1990).  153 \n2.7. Statistical analyses 154 \nMicrobial counts were transformed to logarithms before means and standard deviations 155 \nwere computed, and counts were reported in terms of log CFU\/g. When bacterial counts in 156 \nteewurst batter decreased to below the threshold of detection (≤1.0 log CFU\/g), a value of 1 was 157 \nused for positive samples after enrichment for determination of the arithmetic mean. Statistical 158 \nanalyses were performed using the SPSS 12.0 software program for windows (SPSS Inc., 159 \nChicago, IL). For each contamination scenario and pathogen an analysis of variance (ANOVA) 160 \nwas performed to evaluate the effect of storage time and temperature on pathogen viability. 161 \nDifferences in the proximate composition of teewurst manufactured by different processors 162 \nwere also evaluated using ANOVA. Least squares means separation was performed using the 163 \nTukey procedure at a significance level of p < 0.05. 164 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n9 \n3. Results 165 \n3.1. Microbiological analyses of teewurst 166 \nDirect plating of samples of control (non-inoculated) teewurst slices or control 167 \nbatter\/chubs taken from each of the three trials\/batches tested revealed the absence (≤0.2 168 \nand ≤1.0 log CFU\/g for teewurst slices and batter\/chubs, respectively) of E. coli 169 \nO157:H7, S. Typhimurium, and L. monocytogenes (data not shown). These samples also 170 \ntested negative for each of these same three pathogens following enrichment. The 171 \naverage initial TPC and LAB levels were 7.2 ± 0.7 and 5.7 ± 0.9  log CFU\/g, 172 \nrespectively, for teewurst batter, whereas for teewurst slices the average initial TPC and 173 \nLAB levels were 6.5 ± 0.7 and 5.5 ± 0.9 log\n \nCFU\/g, respectively (Table 1). Average 174 \ninitial values of pH were 5.87 ± 0.25 and 6.18 ± 0.19 for teewurst batter and teewurst 175 \nslices, respectively, while thereafter the pH decreased somewhat to about pH 4.39 and 176 \n4.78, respectively, at the end of storage for both batter and slices. Average inital aw values 177 \nwere about 0.960 (SD ≤0.005) for both slices and batter, and aw changed relatively little 178 \nover the storage period. For both slices and batter, numbers of TPC and LAB were very 179 \nsimilar at the end of the respective storage period (Table 1). 180 \n3.2. Viability of E. coli O157:H7, S. Typhimurium, and L. monocytogenes inoculated into 181 \nteewurst batter or onto the surface of teewurst slices 182 \nRegardless of the storage temperature, numbers of all three pathogens inoculated 183 \ninto the batter decreased after 30 days of storage (Table 2). With the exception of storage 184 \nat 21°C which generated the greatest overall lethality, the observed reductions were not 185 \nappreciably different for the other temperatures tested. More specifically, when chubs 186 \ninoculated with E. coli O157:H7 prior to stuffing were subsequently stored at 1.5, 4, and 187 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n10 \n10°C pathogen numbers decreased by 2.3, 3.2, and 3.0 log CFU\/g, respectively, after 30 188 \ndays of storage. When chubs inoculated with L. monocytogenes prior to stuffing were 189 \nstored at 1.5, 4, and 10°C, pathogen numbers decreased by 2.2, 2.6, and 2.6 log CFU\/g, 190 \nrespectively, after 30 days of storage. E. coli O157:H7 and L. monocytogenes levels 191 \ndecreased to below the level of detection by both direct plating (≤1.0 log CFU\/g) and 192 \nenrichment after 25 and 18 days of storage at 21°C, respectively. S. Typhimurium levels 193 \ndecreased below detectable levels by direct plating within 15, 18, and 11 days at 1.5, 4, 194 \nand 10˚C, respectively. The absence of S. Typhimurium was confirmed by the inability to 195 \nrecover cells of this pathogen even by enrichment after 30 days at 1.5 and 4°C, after 21 196 \ndays at 10°C, and after 11 days at 21°C. In general, S. Typhimurium was inactivated at a 197 \ngreater rate and to a greater extent (absent by enrichment within 11 days at 21°C) than E. 198 \ncoli O157:H7 or L. monocytogenes when inoculated into batter (Table 2).  199 \nRegarding survival on teewurst slices, pathogen numbers remained relatively 200 \nunchanged after four days of storage for all temperatures tested (Table 3). Storage at 1.5, 201 \n4, 10, and 21°C for up to 21 days resulted in reductions of E. coli O157:H7 and S. 202 \nTyphimurium from ca. 4.8 log CFU\/g to 3.7, 3.7, 3.9, and 3.4 log CFU\/g and from ca. 4.3 203 \nlog CFU\/g to 2.5, 2.8, 2.9, and 2.7 log CFU\/g, respectively. When slices were inoculated 204 \nwith L. monocytogenes and stored at 1.5, 4, 10, and 21°C for up to 21 days, pathogen 205 \nnumbers decreased from ca. 4.5 log CFU\/g to 1.8, 2.3, 1.8, and 1.5 log CFU\/g, 206 \nrespectively. In general, L. monocytogenes was inactivated at a greater rate and to a 207 \ngreater extent than S. Typhimurium and E. coli O157:H7 at all temperatures tested. 208 \nMoreover, the decrease in levels of E. coli O157:H7, S. Typhimurium, or L. 209 \nmonocytogenes when inoculated onto slices of teewurst was not appreciably affected by 210 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n11 \nthe storage temperature (Table 3), that being, similar reductions in pathogen levels were 211 \nobserved at all temperatures tested for a given pathogen. 212 \n3.2. Proximate composition analyses 213 \nWith possible exceptions of the carbohydrate levels that were not statistically (p 214 \n≥0.05) different among the five brands and the salt level for brand A that was 215 \nsignificantly (p ≤0.05) lower compared to the others four brands, chemical analyses 216 \nrevealed only subtle differences (p ≤0.05) for a given chemical trait among the five 217 \ncommercial brands tested. These findings establish that teewurst displays a range of 218 \ncompositional compounds and characteristics (Table 4). 219 \n3.3. Market basket survey 220 \nAs a final component of this study, we conducted a market basket survey of 221 \ncommercially available teewurst. With reference to USDA\/FSIS directive 7235.1 (USDA, 222 \n1994) for raw or partially cooked meat and poultry products, the labels from four of the 223 \nfive brands tested herein declared teewurst as an uncooked product and\/or provided safe 224 \nhandling instructions, that being “Keep refrigerated” and\/or “Cook thoroughly” (Table 5). 225 \nA lack of uniformity in the listed ingredients and additives used by these five processors 226 \nwas also observed and subsequently confirmed by proximate composition analyses 227 \n(Tables 4 and 5). Proximate composition analyses also revealed that teewurst in general 228 \nhas relatively low nitrite and salt levels and a relatively high moisture and high fat 229 \ncontent, characteristics that typically do not provide a sufficient barrier to microbial 230 \npersistence in such products.  231 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n12 \n4. Discussion 232 \nTeewurst is a very popular traditional\/ethnic sausage, typically consumed raw, that 233 \nremains in demand, albeit in the face of generally declining sales (Ernst K. Illg, personal 234 \ncommunication). It is produced by a limited number of small plants that are located 235 \nprimarily in the northeast and upper midwest regions of the USA. From a public health 236 \nperspective spreadable sausages such as teewurst are considered to be higher-risk 237 \nproducts, presumably because consumers are not aware of the safe-handling requirements 238 \nfor teewurst as a product that may contain raw meat (Bremer et al., 2005) and\/or due to 239 \ntheir preference to consume it “as is”. In recent years, consumption of teewurst has 240 \ncaused human illnesses due to its contamination with E. coli O157:H7 and L. 241 \nmonocytogenes and, therefore, such products may potentially be a vehicle for harborage 242 \nand\/or transmission of foodborne pathogens (Brown, 2000; FAO, 2004; Goulet et al., 243 \n2002; Pichner et al., 2004; Timm et al., 1999). If opened\/sampled, teewurst has a 244 \nrefrigerated shelflife of ca. 1 (Campbell-Platt, 1995; Ockerman and Basu, 2007) to 5 245 \ndays (Brown, 2000), whereas if left unopened the shelf life could extend for up to 7 to 21 246 \ndays at 4°C (Ernst K. Illg, personal communication). In the present study, however, 247 \nvisible mold-like spoilage was evident on teewurst slices within 21 days of refrigerated 248 \nstorage (1.5 and 4°C) or within 5 days of storage at abuse temperatures (10 and 21°C). 249 \nRegardless, pathogen levels decreased during storage; however, in the event of post-250 \nprocess contamination with relatively high levels of these pathogens, as seen for other 251 \nmeat products, teewurst could possibly expose some consumers to a heath risk 252 \n(Gounadaki et al., 2007; Matargas et al., 20008; Yang et al., 2006). 253 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n13 \nLevels of E. coli O157:H7, S. Typhimurium, and L. monocytogenes decreased 254 \nappreciably in teewurst chubs during storage for 30 days (Table 2). Greater reductions in 255 \npathogens numbers were observed at 10 and 21°C as compared to 1.5 and 4°C. However, 256 \nat the end of storage, with the exception of S. Typhimurium for which the most 257 \nsignificant lethality was observed, surviving numbers of each pathogen were of similar 258 \nlevels. Moreover, in agreement with related studies conducted on salami and soudjouk 259 \n(Nightingale et al., 2006; Porto-Fett et al., 2008b), S. Typhimurium inoculated into 260 \nteewurst batter\/chubs was less viable than L. monocytogenes and E. coli O157:H7. 261 \nLethality may be attributed to the presence of native LAB in addition to antimicrobial 262 \ningredients such as nitrites, since according to Rödel et al. (Rodel and Scheuer, 2006) 263 \ninhibition of E. coli in short fermented raw spreadable sausages was enhanced due to the 264 \nacidification of the product by LAB and ensuing reduction of aw, whereas the presence of 265 \nsodium nitrite had only a weak effect. Similar findings were reported by Birzele et al. 266 \n(Birzele et al., 2005), who found that nitrite at levels of 0.5 or 0.9% incorporated into 267 \nfresh spreadable ham and onion sausage inhibited growth of Salmonella Enteritidis, E. 268 \ncoli, and Staphylococcus aureus, as well as partially inhibited L. monocytogenes. The 269 \nproliferation and metabolic activity of LAB are known to inhibit undesirable bacteria, 270 \nmainly through the production of lactic acid and the subsequent pH reduction of foods, 271 \nbut also by the production of CO2, hydrogen peroxide, ethanol, diacetyl, and\/or 272 \nbacteriocins (Hugas, 1998). The batch-to-batch levels and diversity of LAB naturally 273 \npresent in raw meat and associated microbial interactions (i.e. chemical changes in 274 \nproduct) could possibly explain the observed variability in lethality for each pathogen 275 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n14 \namong trials and between chubs and slices (Comi et al., 2005; Kaya et al., 2004; 276 \nSkandamis et al., 2007). 277 \nThe findings of the present study suggest that inclusion of a defined lactic starter 278 \nculture(s) and perhaps a limited\/controlled fermentation during manufacture would 279 \nimprove the reproducibility from batch-to-batch and enhance both the quality and safety 280 \nof the finished product (Calicioglu et al., 2001; Lucke, 2000). As previously reported, 281 \nfermentation of a German-style uncooked sausage (24°C\/24 h) followed by smoking 282 \n(22°C\/20 h) resulted in a 2.0- to 3.0-log reduction of L. monocytogenes (Farber et al., 283 \n1993). In fact, fermentation of some spreadable raw sausages in Germany constitutes a 284 \ncritical element of the manufacturing process so as to insure that the final product is 285 \ncharacterised by an appropriate flavour, colour, texture, and acidification level (≤pH 5.6; 286 \nD-lactic acid ≥ 0.2 g\/100 g; Islam and Jockel, 2005). In the case of teewurst, however, 287 \nthe addition of a starter culture and the ensuing production of organic acid(s) and other 288 \ncompounds could possibly have an untoward effect on product taste, that being too sour, 289 \nand on product texture, that being too firm and, as such, less spreadable (Ernst K. Illg, 290 \npersonal communication, 2008). Thus, it may be prudent to consider adding food grade 291 \nchemicals as an ingredient to further enhance the wholesomeness of teewurst. In fact, in 292 \nprefatory studies we observed an immediate decrease of ca. 1.6 log CFU\/g of L. 293 \nmonocytogenes in the presence of 5.5 ppm of nisin added directly to the teewurst batter; 294 \nhowever, no further decrease in pathogen levels was observed during storage at 4 or 10°C 295 \nover 10 days of storage (data not shown). Regardless, the need for a more precise 296 \nstandard of identity was evident from the differences among brands in the various 297 \nphysicochemical traits measured, as well as from differences in the information included 298 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n15 \non product labels (Table 4 and 5).  In the absence of any readily accessible and\/or 299 \npublished information, the data in Tables 4 and 5 may serve as a starting point for 300 \nassisting in the development of a list of ingredients and range of attendant concentrations 301 \nfor defining a standard of identity for teewurst. 302 \nTo our knowledge, there is limited scientific literature on the fate of E. coli 303 \nO157:H7, S. Typhimurium, and L. monocytogenes either “on” or “in” teewurst. This 304 \nstudy provides valuable information to small and very small plants producing teewurst 305 \nand to regulatory authorities overseeing its production for assessing product safety from 306 \nthese foodborne pathogens. The need to establish both a standard of identity and 307 \nguidelines for its manufacture are critical given that teewurst is typically a raw rather than 308 \nRTE   product, as well as given that despite labeling instructions to the contrary, this 309 \nproduct is commonly\/openly ingested as raw without cooking. The data herein also 310 \nhighlight the need to educate both producers and consumers as to the appropriate manner 311 \nto produce\/handle and store teewurst so as not to introduce pathogens at any point from 312 \nproduction through to consumption. 313 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n16 \nAcknowedgments 314 \nThe authors thank the following individuals for contributing their time, talents, 315 \nresources, and\/or opinions to this work: Rosemary Martinjuk, Peggy Williamson, Nelly 316 \nOsario, Renata Jacob, Ellen Sanders, and John Philips, all of the U.S. Department of 317 \nAgriculture, Agricultural Research Service at the Eastern Regional Research Center in 318 \nWyndmoor, PA. We also extend our sincere appreciation to our friends at Ernst A. Illg 319 \nMeats Inc. (Chalfont, PA) for their enthusiasm and forward thinking, as well as for their 320 \nexpert advice in the preparation and testing of teewurst. 321 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n17 \nReferences \nAmmon, A., Petersen, L.R., Karch, H., 1999. A large outbreak of haemolytic uremic \nsyndrome caused by an unusual sorbitol-fermenting strain of Escherichia coli \n0157:H-. Journal of Infectious Diseases 179, 1274-1277. \nBirzele, B., Djordjević, S., Krämer, J., 2005. A study of the role of different nitrite \nconcentrations on human pathogenic bacteria in fresh spreadable ham and onion \nsausage. Food Control 16, 695-699. \nBremer, V., Bocter, N., Rehmet, S., Klein, G., Breuer, T.,  Ammon, A., 2005. \nConsumption, knowledge, and handling of raw meat: a representative cross-sectional \nsurvey in Germany, March 2001. Journal of Food Protection 68, 785-789. \nBrown, M.H., 2000. Processed meat products. In: Lund, B.M., Baird-Parker, T.C., Gould \nG.W. (Eds.), The microbiological safety and quality of food, vol. 1. Aspen Publishers, \nInc., Gaithersburg, pp. 389-419. \nCalicioglu, M., Faith, N.G., Buege, D.R., Luchansky, J.B., 2001. Validation of a \nmanufacturing process for fermented, semidry Turkish soudjouk to control \nEscherichia coli O157:H7. Journal of Food Protection 64, 1156–1161. \nCampbell-Platt, G., 1995. Fermented meats - a world perspective. In: Campbell-Platt, G., \nCook, P.E. (Eds.), Fermented meats. Blackie Academic and Professional, London, pp. \n39-52. \nComi, G., Urso, R., Iacumin, L.,  Rantsiou, K.,  Cattaneo, P.,  Cantoni, C., Cocolin, L., \n2005. Characterisation of naturally fermented sausages produced in the North East of \nItaly. Meat Science 69, 381-392.  \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n18 \nFood and Agriculture Organization of the United Nations\/World Health Organization \n(FAO\/WHO). 2004. Risk assessment of Listeria monocytogenes in ready-to-eat foods \n– Technical Report. Microbiological Risk Assessment Series 5. Rome, Italy. \nAvailable at: http:\/\/www.fao.org\/docrep\/010\/y5394e\/y5394e00.htm. Accessed 20 \nMarch 2007.  \nFarber, J.M., Daley, E., Holley, R., Usborne, W.R. 1993. Survival of Listeria \nmonocytogenes during the production of uncooked German, American and Italian-\nstyle fermented sausages. Food Microbiology 10, 123-132. \nGoulet, V., Martin, P., Jacquet, C., 2002. Cluster of listeriosis cases in France. Euro \nSurveillance 6(27):pii=1931. Available at: http:\/\/ \nwww.eurosurveilance.org\/ViewArticle. aspx?Articleld=1931. Accessed 3 June 2007. \nGounadaki, A.S., Skandamis, P.N., Drosinos, E.H., Nychas, G.-J.E., 2007. Effect of \npackaging and storage temperature on the survival of Listeria monocytogenes \ninoculated postprocessing on sliced salami. Journal of Food Protection 70, 2313-\n2320. \nHugas, M., 1998. Bacteriocinogenic lactic acid bacteria for the biopreservation of meat \nand meat products. Meat Science 49, S139-S150. \nIslam, R., Jöckel, J., 2005. Strategy of assessment of fresh and spreadable raw sausage. \nFleischwirtschaft 6, 103-105. \nKaya, M., Gökalp, H.Y., 2004. The behaviour of Listeria monocytogenes in sucuks \nproduced with different lactic starter cultures. Turkish Journal of Veterinary and \nAnimal Sciences 28, 1113-1120. \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n19 \nLücke, F.K., 2000. Utilization of microbes to process and preserve meat. Meat Science \n56, 105-116.  \nMataragas, M., Skandamis, P.N., Drosinos, E.H., 2008. Risk profiles of pork and poultry \nmeat and risk ratings of various pathogen\/product combinations.  International \nJournal of Food Microbiology 126, 1-12 \nMcNeal, J.E., 1990. Meat and meat products. In: Herlich, K. (Ed.), Official methods of \nanalysis, 15th ed. Association of Official Analytical Chemists, Arlington, pp. 931-938. \nNightingale, K.K., Thippareddi, H., Marsden, R.K., Nutsch, A.L., 2006. Validation of a \ntraditional Italian-style salami manufacturing process for control of Salmonella and L. \nmonocytogenes. Journal of Food Protection 69, 794-800. \nOckerman, H.W., Basu, L., 2007. Production and consumption of fermented meat \nproducts. In: Toldrá, F. (Ed.), Handbook of fermented meat and poultry. Blackwell \nPublishing, Ames, pp. 9-15. \nPichner, R., Steinrück, H., Gareis, M., 2004. Shiga toxin-producing Escherichia coli \n(STEC) in meat processing companies: an overview of five studies from 1997 to \n2002. Abstract P9, p. 151. In: Maunsell, B., Sheridan, J., Bolton, D.J. (Eds.), Food \npathogen epidemiology: microbes, maladies and methods—proceedings of an \ninternational EU-RAIN conference hosted by the Istituto Zooprofilattico \nSperimentale delle Venezie, Padua, Italy, December 2nd–3rd 2004. Dublin, Ireland: \nTeagasc - The National Food Centre - European Union Risk Analysis Information \nNetwork.  \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n20 \nPorto-Fett, A.C.S., Call, J.E., Luchansky, J.B., 2008a. Validation of a commercial \nprocess for inactivation of Escherichia coli O157:H7, Salmonella Typhimurium, and \nListeria monocytogenes on the surface of whole muscle beef jerky. Journal of Food \nProtection 71, 918-926. \nPorto-Fett, A.C.S., Hwang, C.-A., Call, J.E., Juneja, V.K., Ingham, S.C., Ingham, B.H., \nLuchansky, J.B., 2008b. Viability of multi-strain mixtures of Listeria monocytogenes, \nSalmonella typhimurium, or Escherichia coli O157:H7 inoculated into the batter or \nonto the surface of a soudjouk-style fermented semi-dry sausage. Food Microbiology \n25, 793-801. \nRödel, W., Scheuer, R., 2006. Behaviour of pathogenic Escherichia coli in short \nfermented spreadable raw sausage. The influence of the internal physical and \nchemical parameters. Fleischwirtschaft 86, 119-122. \nSkandamis, P.N., Nychas, G.-J.E., 2007. Pathogens: risks and control. In: F. Toldrá (ed.), \nHandbook of Fermented Meat and Poultry. Blackwell Publishing, London, pp. 427-\n454. \nTimm, M., Klie, H., Richter, H., Gallien, P., Perlberg, K.W., Lehman, S., Protz, D., 1999. \nDetection and prevalence of verotoxin-producing Escherichia coli (VTEC) in raw \nsausages. Berliner und Münchener Tierärztliche Wochenschrrift 112, 385-389. \nUnited States Department of Agriculture\/Food Safety and Inspection Service \n(USDA\/FSIS). 1993. Focus on: sausages. Available at: \nhttp:\/\/www.fsis.usda.gov\/FactSheets\/Sausage_and_Food_Safety\/index.asp. Accessed \n18 August 2005.  \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n21 \nUnited States Department of Agriculture\/Food Safety and Inspection Service \n(USDA\/FSIS). 1994. Mandatory safe handling statements on labelling of raw and \npartially cooked meat and poultry products. Directive 7235.1. Available at: \nhttp:\/\/www.fsis.usda.gov\/OPPDE\/rdad\/FSISDirectives\/7235.1.pdf. Accessed 10 May \n2006. \nUnited States Department of Agriculture\/Food Safety and Inspection Service \n(USDA\/FSIS).  2005. Food standards and labeling policy book. Available at: \nhttp:\/\/www.fsis.gov\/OPPDE\/larc\/policies\/Labeling_Policy_Book_082005.pdf. \nAccessed 20 May 2006. \nWerber, D., Behnke, S.C., Fruth, A., Merle, R., Menzler, S., Glaser, S., Kreienbrock, L., \nPrager, R.,  Tschäpe, H., Roggentin, P., Bockemühl, J., Ammon, A., 2006. Shiga \ntoxin-producing Escherichia coli infection in Germany - different risk factors for \ndifferent ages. American Journal Epidemiology 165, 425-434. \nYang, H., Mokhtari, A., Morales, L.A., Cates, S.C., Cowen, P., 2006. Consumer phase \nrisk assessment for Listeria monocytogenes in deli meats. Risk Analysis 26, 89-103. \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n22 \nFigure legends. \n \nFigure 1. Flow diagram describing the teewurst manufacturing process used in this study.  \nFigure 2. Teewurst, a raw spreadable sausage. \n \n \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n23 \n \n \nFigure 1.  \nGrind (3\/32 inch plate) whole muscle beef (-3.9°C; 3 min) \n\u0001 \n Grind (3\/32 inch plate) Certified pork (-3.9°C; 3 min) \n\u0001 \nAdd non-meat ingredients\/seasonings \n\u0001 \nChop to fine consistency (particle size < 0.25 mm) and hold (≤-1°C; 5 min) \n\u0001 \nVacuum stuff into artificial fibrous casings (0.5 lbs, 52 mm) \n\u0001 \nRinse with potable water (11.7°C) \n\u0001 \nRefrigerate (2.2°C; 3 to 5 h) \n\u0001 \nStore\/Distribute \n \n \n \n \n \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n24 \n \nFigure 2.  \n \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n25 \nTable 1. Evaluation of native biota, pH, and aw of non-inoculated teewurst before and after storage. \nProduct Type Storage time (days) Temperature (oC) TPC LAB pH aw \nTeewurst chubs 0  7.2 ± 0.7a 5.7 ± 0.9 6.18 ± 0.19 0.957 ± 0.004 \n 30 1.5 6.5 ± 1.0 7.0 ± 1.5 4.85 ± 0.19 0.955 ± 0.002 \n  4 6.3 ± 0.7 6.6 ± 1.2 4.58 ± 0.15 0.953 ± 0.002 \n  10 6.6 ± 0.6 6.8 ± 0.5 4.45 ± 0.15 0.953 ± 0.003 \n  21 6.7 ± 0.3 6.6 ± 0.5 4.39 ± 0.10 0.945 ± 0.003 \nTeewurst slices 0 \n 6.5 ± 0.7 5.5 ± 0.9 5.87 ±  0.25 0.960 ± 0.005 \n 21 1.5 7.0 ± 1.1 6.4 ± 1.2 4.66 ± 0.48 0.958 ± 0.004 \n  4 7.6 ± 0.7 7.2 ± 0.7 5.13 ± 0.81 0.958 ± 0.003 \n  10 8.3 ± 0.3 8.0 ± 0.2 5.51 ± 0.40 0.956 ± 0.003 \n  21 8.1 ± 0.1 8.0 ± 0.1 4.78 ± 0.76 0.952 ± 0.002 \naValues are mean log CFU\/g ± standard deviation (N = 3, n = 3). \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n26 \nTable 2. Counts (mean log CFU\/g ± standard deviation; n = 6 chubs for each sampling interval) of E. coli O157:H7, S. Typhimurium, 1 \nand L. monocytogenes inoculated into teewurst battera. 2 \nStorage time (days) Microrganism\/ \nTemperature (oC) \n0 3 8 11 15 18 21 25 30 \nE. coli O157:H7          \n1.5 5.3 ± 0.0aA 4.9 ± 0.3abAB 4.9 ± 0.1abA 4.8 ± 0.1abA 4.3 ± 0.6bcA 3.6 ± 0.6cdA 3.5 ± 0.4dA 3.4 ± 0.5dA 3.0 ± 0.6dA \n4 5.3 ± 0.0aA 5.1 ± 0.1aAB 5.0 ± 0.1aA 4.7 ± 0.3aA 4.0 ± 0.3bA 3.7 ± 0.5bcA 3.6 ± 0.3bcA 3.3 ± 0.4cAB 2.1 ± 0.7dA \n10 5.3 ± 0.0aA 5.2 ± 0.1aA 4.6 ± 0.4aA 4.5 ± 0.7aA 2.9 ± 0.7bB 2.7 ± 0.4bAB 2.3 ± 1.1bAB 2.5 ± 0.8bB 2.3 ± 1.1bA \n21 5.3 ± 0.0aA 4.8 ± 0.3abB 3.5 ± 0.4bcB 2.4 ± 1.1cdB 1.7 ± 0.6dC 2.3 ± 1.4cdB 1.9 ± 0.9cdB NDb ND \nS. Typhimurium           \n1.5 4.9 ± 0.1aA 4.2 ± 0.5aA 3.2 ± 1.6abA  2.0 ± 1.5bcA ≤1.0 ± 0.0cA ≤1.0 ± 0.0cA ≤1.0 ± 0.0cA ≤1.0 ± 0.0cA ND \n4 4.9 ± 0.1aA 4.3 ± 0.3aA 3.1 ± 0.7bA  2.5 ± 1.2bA  1.2 ± 0.3cA ≤1.0 ± 0.0cA ≤1.0 ± 0.0cA ≤1.0 ± 0.0cA ND \n10 4.9 ± 0.1aA 3.8 ± 1.0bAB 1.6 ± 0.5cB ≤1.0 ± 0.0cA ≤1.0 ± 0.0cA ≤1.0 ± 0.0cA ND ND ND \n21 4.9 ± 0.1aA 2.6 ± 1.6bB 1.1 ± 0.2cB ND ND ND ND ND ND \nL. monocytogenes          \n1.5 5.4 ± 0.2aA 5.3 ± 0.1aA 4.5 ± 0.9abA 4.2 ± 0.9abcA 4.1 ± 0.8bcA 3.5 ± 1.0bcA 3.8 ± 0.3bcA 3.6 ± 0.6bcA 3.2 ± 0.5cA \n4 5.4 ± 0.2aA 5.2 ± 0.1abA 4.4 ± 0.7bcA 4.6 ± 0.1bA 3.7 ± 0.2cdAB 3.5 ± 0.3dA 3.1 ± 0.8dA 2.9 ± 0.2dA 2.8 ± 0.6dA \n10 5.4 ± 0.2aA 5.3 ± 0.1aA 3.9 ± 0.4bAB 3.5 ± 0.6bcAB 3.1 ± 0.3cdB 3.4 ± 0.3bcdA 3.1 ± 0.4cdA 3.2 ± 0.4bcdA 2.8 ± 0.6dA \n21 5.4 ± 0.2aA 3.9 ± 0.9bB 2.6 ± 1.0cB 2.2 ± 1.4cB 1.8 ± 0.6cC ND ND ND ND \naMeans with different lowercase letters within a row are significantly different (p < 0.05). Means with different uppercase letters within a column for each 3 \norganism are significantly different (p < 0.05). 4 \nbND; not detected by either direct plating or by enrichment.5 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n27 \nTable 3. Counts (mean log CFU\/g ± standard deviation; n = 6 slices for each sampling interval) of E. coli O157:H7, S. Typhimurium \nand L. monocytogenes inoculated onto teewurst slicesa. \naMeans with different lowercase letters within a row are significantly different (p < 0.05). Means with different uppercase letters within a column for each \norganism are significantly different (p < 0.05).\nStorage time (days) Organism\/ \nTemperature (oC) 0 1 2 4 6 8 11 13 18 21 \nE. coli O157:H7           \n1.5 4.8 ± 0.2aA 4.4 ± 0.2abA 4.5 ± 0.2abA 4.5 ± 0.1abA 4.4 ± 0.1abA 4.1 ± 0.3abcA 4.4 ± 0.1abcA 3.9 ± 0.7bcAB 3.7 ± 0.4cA 3.7 ± 0.5cA \n4 4.8 ± 0.2aA 4.4 ± 0.3abA 4.5 ± 0.1abA 4.5 ± 0.1abA 4.1 ± 0.2bcdA 4.1 ± 0.2bcdA 4.2 ± 0.3bcA 4.1 ± 0.5bcdA 3.7 ± 0.1cdA 3.7 ± 0.3dA \n10 4.8 ± 0.2aA 4.5 ± 0.3abA 4.5 ± 0.2abA 4.4 ± 0.2abA 4.1 ± 0.1abA 4.0 ± 0.3bA 4.2 ± 0.3abA 3.8 ± 0.0bAB 4.5 ± 0.8abA 3.9 ± 0.2bA \n21 4.8 ± 0.2aA 4.6 ± 0.1abA 4.6 ± 0.3abA 4.2 ± 0.1abcB 4.1 ± 0.2abcA 3.8 ± 0.5bcdA 3.7 ± 0.4bcdA 3.0 ± 0.2dB 3.4 ± 1.1cdA 3.4 ± 0.5cdA \nS. Typhimurium           \n1.5 4.3 ± 0.2aA 4.1 ± 0.2abAB 3.7 ± 0.2abcA 3.7 ± 0.2abcA 3.4 ± 0.4bcA 3.2 ± 0.2cA 3.1 ± 0.4cdA 3.1 ± 0.2cA 2.5 ± 0.4dA 2.5 ± 0.5dA \n4 4.3 ± 0.2aA 4.1 ± 0.2abAB 4.0 ± 0.2abA 3.6 ± 0.2abcA 3.5 ± 0.2bcdA 3.2 ± 0.1cdeA 2.7 ± 0.3eA 2.5 ± 0.2eAB 2.9 ± 0.5deA 2.8 ± 0.8deA \n10 4.3 ± 0.2aA 3.9 ± 0.1abcB 4.0 ± 0.1abA 3.5 ± 0.3abcA 2.9 ± 0.1cB 2.9 ± 0.5cA 3.1 ± 0.4bcA 3.2 ± 0.1bcA 3.1 ± 0.3bcA 2.9 ± 0.6cA \n21 4.3 ± 0.2aA 4.2 ± 0.2aA 4.0 ± 0.3abA 3.5 ± 0.1abA 3.5 ± 0.5abA 3.2 ± 0.5abcA 2.6 ± 1.0bcA 2.0 ± 0.6cB 3.0 ± 1.4abcA 2.7 ± 0.8bcA \nL. monocytogenes           \n1.5 4.5 ± 0.1aA 4.3 ± 0.5aA 4.6 ± 0.2aA 4.3 ± 0.3aA 4.3 ± 0.2aA 4.0 ± 0.8abA 3.1 ± 1.3abcA 2.5 ± 1. 6bcA 1.9 ± 1.1cA 1.8 ± 0.8cA \n4 4.5 ± 0.1aA 4.3 ± 0.5abA 4.6 ± 0.1aA 3.8 ± 0.8abcA 3.9 ± 0.9abcAB 3.5 ± 1.4abcA 2.7 ± 1.1bcA 2.6 ± 1.3bcA 2.2 ± 1.2cA 2.3 ± 0.9cA \n10 4.5 ± 0.1aA 4.4 ± 0.5aA 4.6 ± 0.5aA 3.4 ± 1.2abA 3.1 ± 1.2abAB 3.0 ± 1.3abA 3.7 ± 0.9abA 2.2 ± 1.3abA 2.4 ± 1.9abA 1.8 ± 1.7bA \n21 4.5 ± 0.1abA 4.3 ± 0.6abcA 4.8 ± 0.5aA 4.0 ± 0.3abcA 2.3 ± 1.4cdB 2.8 ± 1.0bcdA 3.0 ± 1.7abcdA 2.4 ± 0.1cdA 1.8 ± 1.0dA 1.5 ± 1.1dA \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n28 \nTable 4. Proximate composition analyses of five brands of commercial teewursta. 1 \n \nTeewurst Ab Teewurst B Teewurst C Teewurst D Teewurst E \n \nPhenolics(g\/100g) 0.07 ± 0.00ab;c 0.07 ± 0.01ab 0.09 ± 0.00bc 0.05 ± 0.00a 0.11 ± 0.01c  \nSalt (g\/100g) 1.26 ± 0.16a 2.10 ± 0.22b 2.12 ± 0.10b 2.16 ± 0.00b 2.34 ± 0.00b  \nNitrite (mcg\/g) <1.00a 4.03 ± 0.07b 1.19 ± 0.26a 1.61 ± 0.24a <0.10c  \nMoisture (g\/100g) 44.35 ± 0.21ab 40.65 ± 0.07a 52.60 ± 0.99c 51.90 ± 0.14c 50.10 ± 3.11bc  \nProtein (g\/100g) 12.35 ± 0.64a 12.95 ± 0.21ab 15.60 ± 0.71bc 15.00 ± 0.28abc 16.20 ± 1.13c  \nFat (g\/100g)  39.00 ± 0.42a 41.60 ± 1.84a 26.15 ± 0.21b 25.85 ± 0.21b 28.80 ± 0.57b  \nAcidityd (%)  0.35 ± 0.06a 0.40 ± 0.13a 0.67 ± 0.11ab 0.94 ± 0.04b 0.65 ± 0.06ab  \nCHOe (g\/100g) 1.77 ± 0.11a 1.27 ± 1.65a 2.75 ± 0.15a 4.17 ± 0.75a 1.70 ± 2.40a  \nAsh (g\/100g) 2.54 ± 0.11a 3.57 ± 0.00b 2.91 ± 0.22ac 3.08 ± 0.11bc 3.38 ± 0.10bc  \npH 6.11 ± 0.01a NTf NT 5.69 ± 0.04b 6.09 ± 0.03a  \naw 0.956 ± 0.004\na\n NT NT 0.973 ± 0.001b 0.967 ± 0.001b \n \naProximate analyses were performed on two samples from each processor (mean values ± standard deviation). 2 \nbTeewurst A (Ernst A. Illg Meats Inc.) product was utilized in all challenge experiments conducted in this study. \nc\n Means with different letter within a row are significantly different (p < 0.05). 3 \ndAcidity titratable as acetic acid. 4 \neCHO; carbohydrates. 5 \nfNT; not tested.  6 \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n \n \n \n29 \nTable 5. Labeling information from 5 brands of commercial teewursta. 7 \n \na According to the labeling information declared from processor. 8 \nb Teewurst A (Ernst A. Illg Meats Inc.) product was utilized in all challenge experiments conducted in this study. 9 \n 10 \nIngredients\/Other information Teewurst Ab Teewurst B Teewurst C Teewurst D Teewurst E \nPork x x x x x \nBeef x x x   \nSalt x x x x x \nCarbohydrates x  x  x \nSpices x x  x x \nPaprika x x x x x \nOleoresin of paprika    x  \nRum  x  x  \nSmoke flavor\/natural smoke x   x x \nFlavoring   x  x \nSodium nitrite x x x x x \nSodium erythorbate   x x x \nSodium acetate   x   \n“Uncooked product” x x x  x \n“Cook thoroughly” x    x \n“Keep refrigerated” x  x x x \n"}