{"doi":"10.1109\/EPE.2007.4417321","coreId":"54594","oai":"oai:eprints.lincoln.ac.uk:2509","identifiers":["oai:eprints.lincoln.ac.uk:2509","10.1109\/EPE.2007.4417321"],"title":"Design of an LCC current-output resonant converter for use as a constant current source","authors":["Gilbert, A .J.","Bingham, Chris","Stone, D. A.","Foster, M. P."],"enrichments":{"references":[{"id":994017,"title":"A comparison of Half-Bridge Resonant Converter Topologies,”","authors":[],"date":"1988","doi":"10.1109\/63.4347","raw":"R. L. Steigerwald, “A comparison of Half-Bridge Resonant Converter Topologies,” IEEE Trans. Power Electronics, vol.3, no.2, pp.174-182, April 1988.","cites":null},{"id":994996,"title":"An Averaged Large-Signal Modelling Method for Resonant Converters”,","authors":[],"date":"1997","doi":"10.1109\/iecon.1997.671775","raw":"M. Castilla, L.G. de Vicuna, M. Lopez,  V. Barcons,  “An Averaged Large-Signal Modelling Method for Resonant Converters”, 23rd International Conference on Industrial Electronics, Control and Instrumentation, 1997. IECON 97, vol.2, 9-14 Nov 1997, pp. 444-452.","cites":null},{"id":994207,"title":"Dariusz Czarkowski, Resonant Power Converters,","authors":[],"date":"1995","doi":"10.1109\/mper.1995.410268","raw":"Marian K. Kazimierczuk, Dariusz Czarkowski, Resonant Power Converters, John Wiley sons, inc 1995, ISBN 0-471-04706-6 , Chapter 8 & 17.","cites":null},{"id":995207,"title":"Dynamic analysis of frequency-controlled electronic ballasts,”","authors":[],"date":"2002","doi":"10.1109\/ias.2002.1044172","raw":"Y. Yin, R. Zane. R. Erickson, J. Glaser, “Dynamic analysis of frequency-controlled electronic ballasts,” Industry Applications Conference, 2002. 37th IAS Annual Meeting,  vol. 1, 13-18 Oct. 2002 pp.685-69.","cites":null},{"id":995591,"title":"Envelope Simulation by SPICE-Compatible Models of Electric Circuits Driven by Modulated Signals,”","authors":[],"date":"2000","doi":"10.1109\/41.824147","raw":"S. Ben-Yaakov, S. Glozman, R. Rabinovici, “Envelope Simulation by SPICE-Compatible Models of Electric Circuits Driven by Modulated Signals,” IEEE Trans. Industrial Electronics, vol.47, no.1, pp.222-225, February 2000.","cites":null},{"id":994703,"title":"High performance control of the series-parallel resonant converter”,","authors":[],"date":"1997","doi":"10.1049\/ip-epa:19970943","raw":"A. J. Forsyth, Y. K. E. Ho, “High performance control of the series-parallel resonant converter”, IEE Proceedings Electric Power Applications, vol. 144, no. 2, March 1997, pp.131-139","cites":null},{"id":995407,"title":"Phasor Transformation and its Application to the DC\/AC","authors":[],"date":"1990","doi":"10.1109\/63.53157","raw":"Chun. T. Rim, Gyu. H. Cho, “Phasor Transformation and its Application to the DC\/AC Analyses of Frequency Phase-Controlled Series Resonant Converters (SRC),” IEEE  Trans. Power Electronics, vol.5, no.2, pp.201-211, April 1990.","cites":null},{"id":995814,"title":"Rapid design of LCC current-output resonant converters with reduced electrical stresses”,","authors":[],"date":"2005","doi":"10.1049\/el:20057700","raw":"A. J. Gilbert, D. A. Stone, C. M. Bingham, “Rapid design of LCC current-output resonant converters with reduced electrical stresses”, 2005 European Conference on Power Electronics and Applications 11-14 Sept. 2005","cites":null},{"id":994437,"title":"Sliding-mode control of quantum series-parallel resonant converters via input-output linearization”,","authors":[],"date":"2005","doi":"10.1109\/tie.2005.844256","raw":"M. Castilla, L. Garcia de Vicuna, J. M.. Guerrero, J. Matas, J. Miret, “Sliding-mode control of quantum series-parallel resonant converters via input-output linearization”, IEEE Trans. Industrial Electronics, vol.52,  no. 2,  April 2005, pp.566-575","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"A methodology for the design of LCC resonant current-source converters, is presented. Unlike previous techniques, the resulting converter provides near constant steady-state output current over an extended load range when excited at the resonant frequency, through use of a self-oscillating controlle","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/54594.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/2509\/1\/gilbert_4.pdf","pdfHashValue":"3b202b1448722a923e4c50acea8ce7f842bbb14f","publisher":"Institute of Electronic and Electrical Engineering","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:2509<\/identifier><datestamp>\n      2014-08-28T09:24:54Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48363030<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/2509\/<\/dc:relation><dc:title>\n        Design of an LCC current-output resonant converter for use as a constant current source<\/dc:title><dc:creator>\n        Gilbert, A .J.<\/dc:creator><dc:creator>\n        Bingham, Chris<\/dc:creator><dc:creator>\n        Stone, D. A.<\/dc:creator><dc:creator>\n        Foster, M. P.<\/dc:creator><dc:subject>\n        H600 Electronic and Electrical Engineering<\/dc:subject><dc:description>\n        A methodology for the design of LCC resonant current-source converters, is presented. Unlike previous techniques, the resulting converter provides near constant steady-state output current over an extended load range when excited at the resonant frequency, through use of a self-oscillating controller<\/dc:description><dc:publisher>\n        Institute of Electronic and Electrical Engineering<\/dc:publisher><dc:date>\n        2007<\/dc:date><dc:type>\n        Conference or Workshop contribution<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/2509\/1\/gilbert_4.pdf<\/dc:identifier><dc:identifier>\n          Gilbert, A .J. and Bingham, Chris and Stone, D. A. and Foster, M. P.  (2007) Design of an LCC current-output resonant converter for use as a constant current source.  In: Power Electronics and Applications, 2007 European Conference on, 2-5 September 2007, Aalborg, Denmark.  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/EPE.2007.4417321<\/dc:relation><dc:relation>\n        10.1109\/EPE.2007.4417321<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/2509\/","http:\/\/dx.doi.org\/10.1109\/EPE.2007.4417321","10.1109\/EPE.2007.4417321"],"year":2007,"topics":["H600 Electronic and Electrical Engineering"],"subject":["Conference or Workshop contribution","PeerReviewed"],"fullText":"Power-factor control of the LCC current-output  \nresonant converter \nA. J. Gilbert, C. M. Bingham*, D. A. Stone, M. P. Foster \nSHEFFIELD UNIVERSITY \nDepartment of Electronic & Electrical Engineering \nMappin Street, Sheffield, S1 3JD, U.K. \nTel.: +44\/ (0)114 222 5355 \n*E-Mail: c.m.bingham@sheffield.ac.uk  \nURL: http:\/\/www.sheffield.ac.uk\/eee \n \nKeywords \nResonant converter, Converter control, ZVS converters, DC power supply, High frequency power \nconverter \nAbstract \nAn improved control strategy for LCC current-output resonant converters is proposed. Small\/large-\nsignal converter models and the steady-state dynamics of the converter are used for controlling power-\nfactor. The proposed method provides a convenient, linear control mechanism for the design of \nregulators, which has a similar influence to varying the DC-link supply voltage in terms of output-\nvoltage\/current control, which, whilst being desirable, is normally not a realistic proposition for \ncommercial supplies. \nIntroduction \nIt is well established that resonant converters are advantageous in-terms of size and efficiency [1,2]. \nCurrently one of the main drawbacks for the use of resonant converters, however, is the lack of \nliterature on robust control of such systems. Here, a novel control strategy is therefore considered, that \napproximately linearises the behaviour of the converter such that traditional control techniques can be \napplied. The technique is applied to the LCC current-output resonant converter as shown in Figure \n1(a). Although other control strategies [3,4] aim to linearise the converter behaviour, none linearise the \nbehaviour as fully as presented here. Hardware implementation is via integration of VLs using a very \nlow pass filter (RC network) to give precise zero-crossings of ILs, and a real-time FPGA based delay \nnetwork that controls the MOSFET switching times such that based on the previous cycle, the phase \nangle between ILs and Vs is specified by the controllers desired cos(θ), figure 1(b). \n \n \nVi \/2 N :1Ls Cs\nCp Cf RL \nILs Itp Vs \nVLs VCs\nVCp\nVo \nIs \nVi \/2 \nLf\nVf \n \n(a) \n \n(b) \nFig. 1: (a)LCC Current-Output resonant converter (b) FPGA based Power-factor controller \nEquivalence of power-factor and supply voltage control  \nDuring normal operation, the resonant tank is excited above the resonant frequency by an applied \nsquare-wave switching voltage, Vs, that results in an approximately sinusoidal series inductor current \n,ILs, see Fig. 2(a). The fundamental component of the square-wave is also shown in Fig.2, and can be \nsub-divided into two sinusoidal components, one in phase with the resonant current, ILs, and one in \nquadrature, Fig.2(b).  \n0 1 2 3 4 5 6 7 8 9 10\n-15\n-10\n-5\n0\n5\n10\n15\nTime, uS\nVo\nlta\nge\n(V\n) &\n C\nur\nre\nn\nt(A\n)\nVs (V)\nVsfund (V)\nILs (A)\n600 \n10*(4\/Pi) \n(a) \n0 1 2 3 4 5 6 7 8 9 10\n-15\n-10\n-5\n0\n5\n10\n15\nTime, uS\nVo\nlta\nge\n, \nV\nVsin phase (V)\nVsquadrature (V)\n10*(4\/Pi)*sin(600) \n10*(4\/Pi)*cos(600) \n(b) \nFig. 2:  (a) Switching voltage and resonant tank current \n (b) phase components of switching voltage wrt. resonant tank current. \n \nThe following identity will be used to derive the magnitude of the switching voltage component in \nphase with the series inductor current. \nThe switching voltage can be approximated by its fundamental component as follows: \nThe series inductor current can be approximated by a sinusoid as follows: \nUsing the identity in (1) the fundamental component is equated to a sinusoid in-phase with the series \ninductor current and another in quadrature: \nTo maintain the real power flow into the converter, assuming a square-wave switching voltage in \nphase with the series inductor current, the ‘equivalent’ square-wave would take the form: \n)sin()cos()cos()sin()sin( BABABA +=+ (1)\n)sin(2))sgn(sin(\n2\ntVtVV sdcsdcs ωπ\nω ≈=  (2)\n)sin(ˆ θω −= tII sLsLs  (3)\n)cos()sin(2)sin()cos(2)sin(2 θωθ\nπ\nθωθ\nπ\nω\nπ\n−+−= tVtVtV sdcsdcsdc  (4)\nVarying the instantaneous power-factor (PF) is therefore equivalent to varying the instantaneous \nsupply-voltage, from a fundamental mode approximation (FMA) perspective, i.e the current waveform \nis assumed sinusoidal. When deriving a small-signal model of the converter, this allows the converter \nto be considered as switching at the resonant frequency whilst varying the power factor—the power-\nfactor is included in the model as a supply-voltage scaling factor. Note that, from this perspective, the \npower-factor bias will not change the small-signal model.  \n \nBy way of example, Fig.3 compares the experimentally measured small-signal frequency response \nwith that predicted by the proposed analysis. Experimentally the power factor is perturbed for the \nfollowing converter: Vdc=18, Ls=13.6µH, Cs=220nF, Cp=130nF, N=1, Lf=24µH, Cf=220µF, around \nPFbias=0.75 through use of a self-oscillating power-factor controller.  \n \nWhen RL=10Ω, the converter gain at resonance is 0.674 hence with the specified input voltage, \nVout=12.1V. This implies a steady-state gain of +21.7dB at 0Hz between power-factor and output-\nvoltage.  \n \n100 101 102 103 104 105\n-60\n-50\n-40\n-30\n-20\n-10\n0\n10\n20\nFrequency, Hz\nG\na\nin\n, \ndB\nAnalysis\nExperimental\n \n100 101 102 103 104 105\n-250\n-200\n-150\n-100\n-50\n0\nFrequency, Hz\nPh\nas\ne\n, D\neg\nre\ne\ns\nAnalysis\nExperimental\n \nFig 3: Small-signal frequency response comparison between proposed analysis and experimental \nresults for 10Ω load. Note that above a 2kHz perturbation in power factor, the phase response \nmeasurements become inaccurate as a result of the signal-level becoming comparable in amplitude \nwith noise and output-voltage ripple. \n \nA high degree of correlation is present, thereby confirming that the proposed analysis is indeed valid. \n \nPhasor-transform converter model at the resonant frequency \nTo enable a small-signal model of the power-factor controlled converter to be derived, a large-signal \nphasor-transformed model is first generated for the converter operating at the resonant frequency. \n \nTraditionally, the d-q-0 axis transformation is used for the modelling and analysis of 3-phase machines \nand power systems. However, there also exists a similar phasor-transform technique for single-phase \nsystems based on the assumption that the signals are sinusoidal in nature but vary in amplitude, \nfrequency and phase [5,6]. These features are characteristic of resonant converters operating near \nresonance with sufficiently high quality factor—as commonly encountered.  The presented analysis is \nbased on the LCC current-output converter, Figure 1.   \n \nA sinusoidal voltage or current can be approximated by a sinusoid whose frequency and amplitude \nvary with time [5]: \n))sgn(sin(\n2\n))sgn(sin()cos(\n2 s\nθωθωθ −=−= tPFVtVV dcsdcs  where )cos(θ=PF  (5)\nwhere )(tx is the complex envelope of )(tx  and sω is the switching frequency. Initially, consider the \ndifferential equation governing the behaviour of an ideal inductor: \nSubstituting (6) into (7) for current and voltage gives: \nand simplifying gives [7]: \nIn a similar manner, capacitors and resistors are described by: \n \nMore generally, therefore, a signal envelope )(tx can be expanded into its constituent real and \nimaginary components, donated by ‘r’ and ‘i’ subscripts, respectively. \nFor the inductor, substituting (11) into (9) and separating the real and imaginary components gives: \nand for the capacitor and resistor, \n \nFor use in network simulators such as SPICE, for instance, the complex components can be eliminated \nthrough use of two coupled equivalent circuits, one describing the real domain and the other the \nimaginary domain [8]. \n \nThe rectifier in Fig. 1 is not readily modelled using the phasor-transform, and requires the resonant \ntank and output filter to be modelled separately, and then combined. This is justified since the output \nfilter bandwidth is much lower than that of the resonant tank, and, as a result of the rectifier action, the \nfilter effectively reacts only to the envelope of the resonant tank waveforms. From basic Fundamental \nMode Approximation (FMA), the resonant tank is modelled as in Fig.4—see [2].  \nLs Cs\nCp\nILs \n2Vi \nVLs VCs\nVCp\nπ  \nItp θtp \n \nFig 4: FMA model of LCC Resonant tank \n\n\n\n\n\n\n\n\nℜ=\n∫\nt\ns dttj\netxtx 0\n)(\n)()(\nω\n \n(6) \ndt\ntid\nLtv\n)(\n)( =  (7) \n\n\n\n\n\n\n\n\nℜ=\n\n\n\n\n\n\n\nℜ\n∫∫\nt\ns\nt\ns dttjdttj\neti\ndt\ndLetv 00\n)()(\n)()(\nωω\n \n(8) \n)()()()( titjL\ndt\ntidLtv sω+=  \n(9) \n)()(\n)(\n)( tvtjC\ndt\ntvdCti sω+=  (10a) \n)()( tiRtv =  (10b) \n)()()( tjxtxtx ir += (11) \n)()()()( titL\ndt\ntidLtv isrr ω−=  (12a) \n)()(\n)(\n)( titL\ndt\ntidLtv rsii ω+=  (12b) \n)()()()( tvtC\ndt\ntvdCti isrr ω−=  \n(13a) \n)()()()( tvtC\ndt\ntvdCti rsii ω+=  (13b) \n)()( tiRtv rr =  (14a) \n)()( tiRtv ii =  (14b) \n \nAfter phasor-transforming the components in Fig. 4, the coupled networks shown in Fig. 5 are \nobtained. \nLs Cs\nCp\nILsr \n2Vi \nVLsr VCsr VCpr\nπ \nItpr \n    -Lsωs(t)ILsi(t)\n+   -\n   Csωs(t)VCsi(t) \n   Cpωs(t)VCpi(t) \n \n(a) \nLs Cs\nCp\nILsi \nVLsi VCsi VCpi\n     Lsωs(t)ILsr(t) \n+   -\n   Csωs(t)VCsr(t) \n   Cpωs(t)VCpr(t) Itpi \n \n(b) \nFig. 5 : Phasor transformed LCC resonant tank model  (a) real circuit (b) imaginary circuit \nA state space representation of Fig. 5 is obtained for both the real and imaginary circuits, which are \nthen combined to give:  \nThe waveform envelopes are extracted using the output equation: \nFinally, the output filter is described in state-variable form by: \nThe voltages of the phasor-transformed tank model and output filter are coupled by noting that the \naverage voltage presented to the output filter, via the rectifier, is given by (18) since VCp is assumed \nsinusoidal. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n−\n−\n+\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n−\n−\n−−\n−\n−−\n=\n\n\n\n\n\n\n\n\n\n\n\n\n•\ni\nr\ni\ni\ni\nr\nr\nr\ni\ni\ni\nr\nr\nr\ntp\ntp\ni\np\np\ns\nCp\nCs\nLs\nCp\nCs\nLs\np\ns\ns\ns\nss\ns\ns\np\ns\ns\ns\nss\nCp\nCs\nLs\nCp\nCs\nLs\nI\nI\nV\nC\nC\nL\nV\nV\nI\nV\nV\nI\nC\nC\nLL\nC\nC\nLL\nV\nV\nI\nV\nV\nI\n100\n000\n000\n010\n000\n002\n00100\n00100\n11000\n00001\n00001\n00110\nπ\nω\nω\nω\nω\nω\nω\n \n(15) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n=\n\n\n\n∧\ni\ni\ni\nr\nr\nr\nCp\nCs\nLs\nCp\nCs\nLs\nCs\nCr\nLs\nV\nV\nI\nV\nV\nI\nj\nj\nj\nV\nV\nI\n00100\n00010\n00001  \n(16) \n[ ]ff\no\nLf\nfLf\nf\no\nLf VLV\nI\nCRC\nL\nV\nI\n\n\n\n\n\n\n\n\n+\n\n\n\n\n\n\n\n\n\n\n−\n−\n=\n\n\n0\n1\n11\n10\n\u0005\n\u0005  \n(17) \nπN\nV\nV Cpf\nˆ2\n=  \n(18) \nCoupling of the currents is achieved by replacing the current source in Fig. 4 by a time varying \nresistor, Fig. 6, with the imaginary and real components of Itp given by: \n \nLs Cs\nCp\nILs \n2Vi \nVLs VCs\nVCp\nπ  \nItp \nRfilt\n \nFig. 6: Modelling output filter by a time varying load \n \nSince the transformer primary current is a squarewave, and the fundamental is used in the phasor-\ntransformed model, the peak of the squarewave current is scaled by 4\/π.  \nThe time-varying load resistance is now calculated from:  \n \nFrom (19),(20) and (21) the transformer primary phasor currents are found algebraically: \nThe model is therefore described by (15) (16) (17) (18) (22) \n \nSmall-signal analysis \n \nFrom the derived phasor-transformed model, a small-signal model can be generated.  \nEquation (15) is modified as follows so that power factor becomes the input: \nThe equations that describe the phasor-transformed model (16) (17) (18) (22) (23) are linearised about \nthe resonant frequency. Equation (18) can be re-expressed as follows: \nfilt\nCp\ntp R\nV\nI r\nr\n=  (19a) \nfilt\nCp\ntp R\nV\nI i\ni\n=  (19b) \nπN\nI\nIII Lftptptp ir\n4ˆ 22\n=+=  \n(20) \ntp\nCp\nfilt I\nV\nR ˆ\nˆ\n=  \n(21) \nCp\nCpLf\ntp V\nV\nN\nI\nI r\nr ˆ\n4\nπ\n=  \n(22a) \nCp\nCpLf\ntp V\nV\nN\nI\nI i\ni ˆ\n4\nπ\n=\n (22b) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n−\n−\n+\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n−\n−\n−−\n−\n−−\n=\n\n\n\n\n\n\n\n\n\n\n\n\n•\ni\nr\ni\ni\ni\nr\nr\nr\ni\ni\ni\nr\nr\nr\ntp\ntp\np\np\ns\ni\nCp\nCs\nLs\nCp\nCs\nLs\np\ns\ns\ns\nss\ns\ns\np\ns\ns\ns\nss\nCp\nCs\nLs\nCp\nCs\nLs\nI\nI\nPF\nC\nC\nL\nV\nV\nV\nI\nV\nV\nI\nC\nC\nLL\nC\nC\nLL\nV\nV\nI\nV\nV\nI\n100\n000\n000\n010\n000\n00\n2\n00100\n00100\n11000\n00001\n00001\n00110\nπ\nω\nω\nω\nω\nω\nω\n \n(23) \nπN\nVV\nV ir CpCpf\n222 +\n=  \n(24) \nAssuming that variable X(t) can be split into its steady-state and small-signal component as follow: \nwhere oX and x∆ are the steady-state and small-signal component ,respectively, equation (24) can be \nwritten as: \nNow, linearising (26) about the steady-state components gives: \nAt resonance, the series inductor current is always sufficient to source the load. Hence, (22) can be \nwritten as: \nEquation 28 can be similarly linearised about the steady-state components giving: \nTo form the small-signal model, the steady-state components \n0rCp\nV , \n0iCp\nV and \n0Lf\nI  must first be \ncalculated. From (24), the steady-state output filter inductor current is found to be: \nThe transformer primary current components from (22) and (30) are then given by: \nThe steady-state conditions are obtained by equating the time derivatives in (23) to zero. Equation (31) \nis used to replace the Itp components, as follow: \nxXX o ∆+=   (25) \n( ) ( )\nπN\nvVvV\nV iirr CpoCpCpoCpf\n222 ∆++∆+\n=  \n(26) \n( )\niirr\nir\nCpoCpCpoCp\noCpoCp\nf vVvV\nVVN\nv ∆+∆\n+\n=∆\n22\n2\nπ\n (27) \n( ) ( )\n( ) ( )22\n00\n0\n4\niirr\nrr\nr\nCpCpCpCp\nCpCpLfoLf\ntp\nvVvV\nvV\nN\nII\nI\n∆++∆+\n∆+∆+\n=\nπ\n (28a) \n( ) ( )\n( ) ( )22\n00\n00\n4\niirr\nii\ni\nCpCpCpCp\nCpCpLfLf\ntp\nvVvV\nvV\nN\nII\nI\n∆++∆+\n∆+∆+\n=\nπ\n (28b) \n( )( ) ( )( ) 222\/3222\/322\n2\n00\n0\n00\n00\n00\n00\n444\nir\nr\nir\nirio\nir\nri\nr\nCpCp\nLfCp\nCpCp\nCpCpCpLf\nCpCp\nCpCpLf\ntp\nVVN\niV\nVVN\nvVVI\nVVN\nvVI\ni\n+\n∆\n+\n+\n∆\n−\n+\n∆\n=∆\nπππ\n \n(29a) \n( )( ) ( )( ) 222\/3222\/322\n2\n00\n0\n00\n00\n00\n00\n444\nir\ni\nir\nrrio\nir\nir\ni\nCpCp\nLfCp\nCpCp\nCpCpCpLf\nCpCp\nCpCpLf\ntp\nVVN\niV\nVVN\nvVVI\nVVN\nvVI\ni\n+\n∆\n+\n+\n∆\n−\n+\n∆\n=∆\nπππ\n(29b) \nL\nCpCp\nLf RN\nVV\nI ir\nπ\n22\n00\n0\n2 +\n=  \n(30) \nL\nCp\nCpCp\nCpLf\ntp RN\nV\nVV\nV\nN\nI\nI r\nir\nr\nr 2222\n84\nππ\n=\n+\n=\n (31a) \nL\nCp\nCpCp\nCpLf\ntp RN\nV\nVV\nV\nN\nI\nI i\nir\ni\ni 2222\n84\nππ\n=\n+\n=\n (31b) \nPF\nL\nVIV\nL\nV\nL\nI\ns\ni\nLssCp\ns\nCs\ns\nLs irrr π\nω\n2110\n0000\n++−−==\u0005  (32a) \n000\n10\nirr CssLs\ns\nCs VIC\nV ω+==\u0005  (32b) \n\n\n\n\n−+==\nL\nCp\np\nCpsLs\np\nCp RN\nV\nC\nVI\nC\nV r\nirr 22\n0\n000\n8110\nπ\nω\u0005  (32c) \n0000\n110\nriii LssCp\ns\nCs\ns\nLs IVL\nV\nL\nI ω−−−==\u0005  (32d) \n000\n10\nrii CssLs\ns\nCs VIC\nV ω−==\u0005  (32e) \nAs demonstrated earlier, the steady-state power factor does not affect the small-signal analysis hence \nwe shall assume PF=1 (resonance), to simplify the analysis. At resonance 0\n0\n=\niLs\nI since all the series-\ninductor current is real. From (32e) this also implies that 0\n0\n=\nrCs\nV . Equation (32a) now allows the \ncalculation of  \n0rCp\nV  \nTo further simplify the analysis equations derived in [9] concerning the design of LCC current-output \nresonant converters, based on FMA, can be utilised. It is shown that, at resonance the output voltage of \nthe converter can be expressed as follows: \nwhere Gtr is the voltage gain of the resonant tank and N is transformer turns ratio when expressed as \nN:1. From this perspective the steady-state output-filter current can be expressed as follow: \nEquating the current in (35) and (30), eliminating \n0rCp\nV via use of (33), assuming resonant operation \n(PF=1), and solving for \n0iCp\nV  gives: \nNote that two solutions exist for \n0iCp\nV the other having the opposite magnitude. The solution presented \nin (36) is selected such that the phase of VCp w.r.t ILs is negative i.e 0)\/arctan( 00 <ri CpCp VV . \nIn [9] it is also shown that for a given converter specification, the resonant tank components can be \nchosen as follows: \nwhere A=Cp\/Cs, and ωr is the resonant frequency.  These equations will be used to simply the \nremaining analysis. Substituting (33) and (36), into (32c), and eliminating Cp in (32c) via (37a) gives: \nEliminating Cs in (32b) via (37b), substituting in (38) and solving for \n0iCs\nV then gives: \nSince all the steady-state conditions are known (at PF=1) the small-signal equations expressed in (27), \n(29) can be evaluated: \n \n\n\n\n\n−−==\nL\nCp\np\nCpsLs\np\nCp RN\nV\nC\nVI\nC\nV i\nrii 22\n0\n000\n8110\nπ\nω\u0005  \n(32f) \nπ\ni\nCp\nVV\nr\n2\n0\n=\n (33) \nN\nGVV trio =  \n(34) \nL\ntri\nLf NR\nGVI =\n0\n \n(35) \nπ\nπ\n2\n1642\n0\n−\n−=\ntri\nCp\nGV\nV\ni\n \n(36) \nrL\ntr\np RN\nG\nC\nωπ\nπ\n22\n42 162 −\n=\n (37a) \nrL\ntr\ns RNA\nG\nC\nωπ\nπ\n22\n42 162 −\n=\n \n(37b) \n( )( )\n162\n161\n4222\n422\n−\n−+\n=\nπωπ\nπ\ntrtrr\ntrL\ns\nGG\nGARNL  \n(37c) \nL\ntri\nLs RN\nGVI\nr 2\n2\n0\nπ\n=  \n(38) \n162 42\n32\n0\n−\n−=\nπ\nπ\ntr\ntri\nCs\nG\nGAVV\ni\n (39) \n\n\n ∆−−∆=∆\nir CptrCp\ntr\nf vGvGN\nv 1642 423 ππ\n (40) \n \nThe state-space small-signal model is now formed from (15), (17), (40),(37a) and (41): \n( )\n( )\n( )\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n−\n−\n+−\n−\n−−−\n+\n−−\n=\nLff\nf\npr\nsr\nssr\nrp\nrs\nrss\nRCC\nLKK\nKKCK\nC\nLL\nKKKC\nC\nLL\nA\n\/1\/1000000\n\/100000\n00\/100\n0000\/100\n00\/1\/1000\n0000\/1\n000000\/1\n0000\/1\/10\n7673\n676663\n373633\nω\nω\nω\nω\nω\nω\n \n \n(42) \n \n( )[ ]0000000\/2 sdc LVB π=  \n[ ]10000000=C  \n[ ]ToLfCpCsLsCpCsLs VIVVIVVIx iiirrr ∆∆∆∆∆∆∆∆=  \n \nxCy\nuBxAx\n.\n..\n=\n+=\u0005\n           where        \nPFu\nVy o\n∆=\n∆=  \n \nand, \n42\n42\n33\n164\nπ\nπω\ntr\ntrr\nG\nG\nK\n−\n−= 4236\n16\nπ\nω\ntr\nr\nG\nK −=  \n16\n8\n42\n37\n−\n−=\nππ\nω\ntrtr\nrL\nGG\nNRK  \n4263\n16\nπ\nω\ntr\nr\nG\nK −=  \n16\n64\n4242\n66\n−\n−=\nππ\nω\ntrtr\nr\nGG\nK\nπ\nω\ntr\nrL\nG\nNR\nK\n2\n67 =\n \nNGL\nK\ntrf\n373\n8\nπ\n=\n \nNGL\nG\nK\ntrf\ntr\n3\n42\n76\n162\nπ\nπ −−\n=\n \n \n \n \nTo utilise the model, (42), the converter tank gain and resonant frequency must first be evaluated. \nThese are obtained by solving (37) for A, Gtr and ωr.  For instance, to calculate Gtr, equate the ωr term \nin both (37a) and (37c), and solve for Gtr , where A=Cp\/Cs.  \n \nA comparison of the small-signal frequency response prediction between the provided analysis and the \nprototype system, are given in Fig.3, from which very good agreement is seen to exist. Whilst the \nstate-space description is 8th order, the system is dominantly 3rd order.  Moreover, since the small-\nsignal response is found to be constant across the full power-factor range, the small-signal response \nalso provides a good approximation to the large-signal behaviour. \n \nFrom Fig. 7(a) it can be seen that the 3rd order numerically reduced small-signal model provides an \naccurate large-signal model. Both the simulated and experimental output voltage closely follows a \nscaled version of the power factor thus further demonstrating the controller’s linear behaviour. From \nFig. 7(b) the steady-state linear control behaviour is made evident. As power factor is increased the \noutput voltage across the various loads raises linearly. \n \nLf\ntr\nCp\nLtr\ntr\nCp\ntrL\ntp iNG\nv\nRNG\nG\nv\nGRN\ni\nirr\n∆+∆\n−\n+∆\n\n\n\n−=∆ 3262\n42\n4222\n1616321618\nππ\nπ\nππ\n \n(41a) \nLf\ntr\ntr\nCp\nLtr\nCp\nLtr\ntr\ntp iNG\nG\nv\nRNG\nv\nRNG\nG\ni\nirr\n∆\n−\n−∆+∆\n−\n=∆ 3\n42\n262262\n42 1641281632\nπ\nπ\nππ\nπ  \n(41b) \n0 2 4 6 8 10 12 14 16\n0\n2\n4\n6\n8\n10\n12\n14\nTime, mS\nO\nu\ntp\nu\nt v\no\nlta\nge\n, \nV\nScaled PF\nThird-order Model\nExperimental\n(a) \n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n5\n10\n15\n20\n25\nPower factor\nO\nu\ntp\nu\nt v\no\nlta\nge\n, V\n20 Ohm load \n10 Ohm load \n(b) \nFig.7 (a) Comparison between experimental and small-signal model response for RL=10Ω during a \nperturbed step change in power factor from PF=0.8 to 0.3. Note that a 3rd order reduced model is \nutilised for the small-signal response. The power factor is scaled by 12.1V since when the power-\nfactor is unity the theoretical ideal output-voltage of the converter is 12.1V  (b) steady-state output \nvoltage as power factor is varied for 10,12,14,16,18,20 Ω loads. Note that 256 linearly spaced power \nfactor points are used for each load. \nConclusion \nA control strategy is provided for the LCC current-output resonant converter that is ultimately, more \nwidely applicable to other resonant converter topologies. The methodology is advantageous in that it \nfirstly linearises the steady-state input-to-output conversion ratio and, secondly, the large-signal \nconverter dynamics become predominantly 3rd order. At present, no control methodologies can boast \nsuch simple linear behaviour. Through the well-defined behaviour of the power-factor controlled \nconverter, the design of an additional controller to obtain closed-loop output-voltage\/current control is \ngreatly simplified, allowing robust and\/or well documented adaptive control methods to be applied. \nThis therefore addresses one of the main drawbacks for the use of resonant converters viz. the lack of \nliterature on robust control of such systems. \n \nReferences \n[1] R. L. Steigerwald, “A comparison of Half-Bridge Resonant Converter Topologies,” IEEE Trans. Power \nElectronics, vol.3, no.2, pp.174-182, April 1988. \n[2] Marian K. Kazimierczuk, Dariusz Czarkowski, Resonant Power Converters, John Wiley sons, inc 1995, \nISBN 0-471-04706-6 , Chapter 8 & 17. \n[3] M. Castilla, L. Garcia de Vicuna, J. M.. Guerrero, J. Matas, J. Miret, “Sliding-mode control of quantum \nseries-parallel resonant converters via input-output linearization”, IEEE Trans. Industrial Electronics, vol.52,  no. \n2,  April 2005, pp.566-575 \n[4] A. J. Forsyth, Y. K. E. Ho, “High performance control of the series-parallel resonant converter”, IEE \nProceedings Electric Power Applications, vol. 144, no. 2, March 1997, pp.131-139 \n[5] M. Castilla, L.G. de Vicuna, M. Lopez,  V. Barcons,  “An Averaged Large-Signal Modelling Method for \nResonant Converters”, 23rd International Conference on Industrial Electronics, Control and Instrumentation, \n1997. IECON 97, vol.2, 9-14 Nov 1997, pp. 444-452. \n[6] Y. Yin, R. Zane. R. Erickson, J. Glaser, “Dynamic analysis of frequency-controlled electronic ballasts,” \nIndustry Applications Conference, 2002. 37th IAS Annual Meeting,  vol. 1, 13-18 Oct. 2002 pp.685-69. \n[7] Chun. T. Rim, Gyu. H. Cho, “Phasor Transformation and its Application to the DC\/AC Analyses of \nFrequency Phase-Controlled Series Resonant Converters (SRC),” IEEE  Trans. Power Electronics, vol.5, no.2, \npp.201-211, April 1990. \n[8] S. Ben-Yaakov, S. Glozman, R. Rabinovici, “Envelope Simulation by SPICE-Compatible Models of Electric \nCircuits Driven by Modulated Signals,” IEEE Trans. Industrial Electronics, vol.47, no.1, pp.222-225, February \n2000. \n[9] A. J. Gilbert, D. A. Stone, C. M. Bingham, “Rapid design of LCC current-output resonant converters with \nreduced electrical stresses”, 2005 European Conference on Power Electronics and Applications 11-14 Sept. 2005 \n"}