{"doi":"10.1136\/jech.2009.087452","coreId":"65147","oai":"oai:dro.dur.ac.uk.OAI2:6754","identifiers":["oai:dro.dur.ac.uk.OAI2:6754","10.1136\/jech.2009.087452"],"title":"Evidence from the 2001 English Census on the contribution of employment status to the social gradient in self-rated health.","authors":["Popham, F.","Bambra, C."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-03-01","abstract":"Background \\ud\nUnemployment and economic inactivity are associated with poor health. There are social gradients in unemployment and economic inactivity, so it was hypothesised that they may contribute to the social gradient in self-rated health. \\ud\n\\ud\nMethods \\ud\nData on employment status, socio-economic position (SEP) and self-rated heath were obtained for people of working age (25–59) who had ever worked from a 3% sample of the 2001 English census. The age-adjusted prevalence differences in poor general health for four separate measures of SEP were compared with the prevalence differences obtained after additional adjustment for employment status. \\ud\n\\ud\nResults \\ud\nPrevalence differences for poor health were reduced by 50% or over when adjusting for employment status (for men ranging from 57% to 81%, for women 50% to 74%). \\ud\n\\ud\nDiscussion \\ud\nThe social gradient in employment status contributes greatly to the social gradient in self-reported health. Understanding why this is the case could be important for tackling social inequalities in health","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65147.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6754\/1\/6754.pdf","pdfHashValue":"aac3af0d40d45001eacb81088f26d0ae947f6831","publisher":"BMJ Publishing Group","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6754<\/identifier><datestamp>\n      2010-10-04T09:35:32Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Evidence from the 2001 English Census on the contribution of employment status to the social gradient in self-rated health. <\/dc:title><dc:creator>\n        Popham, F. <\/dc:creator><dc:creator>\n        Bambra, C. <\/dc:creator><dc:description>\n        Background \\ud\nUnemployment and economic inactivity are associated with poor health. There are social gradients in unemployment and economic inactivity, so it was hypothesised that they may contribute to the social gradient in self-rated health. \\ud\n\\ud\nMethods \\ud\nData on employment status, socio-economic position (SEP) and self-rated heath were obtained for people of working age (25–59) who had ever worked from a 3% sample of the 2001 English census. The age-adjusted prevalence differences in poor general health for four separate measures of SEP were compared with the prevalence differences obtained after additional adjustment for employment status. \\ud\n\\ud\nResults \\ud\nPrevalence differences for poor health were reduced by 50% or over when adjusting for employment status (for men ranging from 57% to 81%, for women 50% to 74%). \\ud\n\\ud\nDiscussion \\ud\nThe social gradient in employment status contributes greatly to the social gradient in self-reported health. Understanding why this is the case could be important for tackling social inequalities in health. <\/dc:description><dc:publisher>\n        BMJ Publishing Group<\/dc:publisher><dc:source>\n        Journal of epidemiology and community health, 2010, Vol.64(3), pp.277-280 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2010-03-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6754<\/dc:identifier><dc:identifier>\n        issn:0143-005X<\/dc:identifier><dc:identifier>\n        issn: 1470-2738<\/dc:identifier><dc:identifier>\n        doi:10.1136\/jech.2009.087452 <\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6754\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1136\/jech.2009.087452 <\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6754\/1\/6754.pdf<\/dc:identifier><dc:rights>\n        This article has been accepted for publication in Journal of Epidemiology and Community Health (JECH). The definitive copyedited, typeset version \\ud\nPopham, F. and Bambra, C. (2010) 'Evidence from the 2001 English Census on the contribution of employment status to the social gradient in self-rated health.', Journal of epidemiology and community health., 64 (3). pp. 277-280 is available online at : http:\/\/jech.bmj.com\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1470-2738","issn:0143-005X","0143-005x"," 1470-2738"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n01 June 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nPopham, F. and Bambra, C. (2010) ’Evidence from the 2001 English Census on the contribution of\nemployment status to the social gradient in self-rated health.’, Journal of epidemiology and community\nhealth., 64 (3). pp. 277-280.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1136\/jech.2009.087452\nPublisher’s copyright statement:\nThis article has been accepted for publication in Journal of Epidemiology and Community Health (JECH). The\ndefinitive copyedited, typeset version Popham, F. and Bambra, C. (2010) ’Evidence from the 2001 English Census on\nthe contribution of employment status to the social gradient in self-rated health.’, Journal of epidemiology and\ncommunity health., 64 (3). pp. 277-280 is available online at : http:\/\/jech.bmj.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n 1 \nEvidence from the 2001 English Census on the contribution of employment status to the \nsocial gradient in self rated health. \n \nPopham, F.\n1\n and Bambra, C.\n2\n \n \n \n1\nSchool of Geography and Geosciences, University of St Andrews, UK. \n2\nDepartment of Geography, Durham University, UK. \n \nAddress for correspondence: Dr Clare Bambra, Department of Geography, Wolfson Research \nInstitute, Queen's Campus, Durham University, Stockton on Tees, TS17 6BH. Tel: 0191 \n3340417, Fax: 0191 3340361, clare.bambra@durham.ac.uk \n \n \n \nArticle word count = 1015 words  \n \nFigures and tables = 1 \n \n \nThe Corresponding Author has the right to grant on behalf of all authors and does grant on behalf \nof all authors, an exclusive licence (or non-exclusive for government employees) on a worldwide \nbasis to the BMJ Publishing Group Ltd and its Licensees to permit this article (if accepted) to be \npublished in Journal of Epidemiology and Community Health and any other BMJPGL products to \nexploit all subsidiary rights, as set out in our licence (http:\/\/jech.bmj.com\/ifora\/licence.pdf). \n 2 \nABSTRACT \nBackground: Unemployment and economic inactivity are associated with poor health. There are \nsocial gradients in unemployment and economic inactivity so it was hypothesised that they may \ncontribute to the social gradient in self rated health. \nMethods: Data on employment status, socio-economic position (SEP), and self-rated heath were \nobtained for people of working age (25-59) who had ever worked from a 3% sample of the 2001 \nEnglish census. The age adjusted prevalence differences in not good general health for four \nseparate measures of SEP were compared to the prevalence differences obtained after additional \nadjustment for employment status.   \nResults: Prevalence differences for not good health were reduced by 50% or over when \nadjusting for employment status (for men ranging from 57% to 81%, for women 50% to 74%). \nDiscussion: The social gradient in employment status contributes greatly to the social gradient in \nself-reported health. Understanding why this is the case could be important for tackling social \ninequalities in health.  \n \n158 words   \n \nKeywords: employment, social gradient, health inequalities, work, self reported health.  \n 3 \nBACKGROUND \nHealth varies by employment status, with unemployment and economic inactivity being \nassociated with an increased likelihood of morbidity and mortality.\n1-8\n The social gradients in the \nrisk of unemployment and economic inactivity may contribute to the social gradient in health. So, \nusing census data, this study asks “to what extent does adjusting for employment status reduce \nthe social gradient in self reported health amongst men and women in England”?  \n \n \nMETHODS \nA 3% sample of the 2001 English census was used (the Individual Sample of Anonymised \nRecords).\n9\n The analysis sample was people of working age (25 to 59) excluding full time \nstudents, those living in communal residences (e.g hospitals) and the 1.3% of men and 3.9% of \nwomen who had never worked. We excluded the never worked as there is some evidence, \nparticularly for men, that this group includes many people unable to work due to pre-existing \nhealth conditions.\n10\n The final sample sizes were 349,699 women and 349,181 men. Data on self-\nreported health, employment status, socio-economic position (SEP) and age were extracted. The \ncensus form is available online (http:\/\/www.statistics.gov.uk\/census2001\/pdfs\/H1.pdf). Self rated \ngeneral health was assessed in the census, for the first time in 2001, by the following question \n“Over the last twelve months would you say your health has on the whole been … Good? Fairly \ngood? Not good?”. The coding of employment status and four census measures of SEP are given \nin Table 1. Income was not measured in the census.  \n \nAll analysis was conducted using Stata version 10.\n11\n As men and women have different overall \nrates and patterns of employment it was decided a priori to analyse each gender separately. \n \nAs the data is cross-sectional we focused on the prevalence of not good health by SEP. We \nstudied the prevalence difference in not good health to ascertain the contribution of employment \nstatus to the absolute rate of not good health for each SEP group. We fitted generalised linear \n 4 \nmodels with a binomial distribution and an identity link to obtain the prevalence difference. In all \nanalysis the “highest” SEP group is the reference. To judge the extent of inequalities by each \nseparate measure of SEP (Models A in Table 1) and by employment status (Model C) we fitted \nage only adjusted models. To assess the impact of controlling for employment status on the \nseparate age adjusted SEP models we then additionally adjusted for employment status (Models \nB) and calculated the % reduction in prevalence difference in each category using the formula \n(prevalence difference in age adjusted model – prevalence difference in age and employment \nadjusted model)\/ (prevalence difference in age adjusted model). To assess the overall health \ngradient for the SEP measures (education and housing tenure) with more than two groups we \nalso calculated the slope index of inequality. It can be regarded as a measure of the health \ngradient from the highest to lowest group.\n12\n For employment status (Model C) we additionally \ncontrolled for all measures of SEP (Model D) to assess their attenuating impact.  \n \nRESULTS \nThe majority of men and women were in employment although women’s rate of employment was \nlower (Table 1). For those out of work, economic inactivity was more common than \nunemployment. Overall 7.6% of men and 8% of women reported not good general health. As \nexpected in age only adjusted analysis (Models A) rates of not good health increased with lower \nSEP. In Models B, which additionally controlled for employment status, socio-economic \ndifferences were attenuated by 50% or over (for men ranging from 57% to 81%, for women 50% \nto 74%).  \n \nAs an example, 5.6% of men living in owner occupied housing had not good general health \ncompared to 19.1% of men in social rented housing, an age adjusted difference of 13% points. \nAfter further adjustment for employment status this difference reduced to 2.5% points, a reduction \nof 81%. The slope index of inequality for housing tenure, as an overall measure of SEP, was \nreduced by 81% after controlling for employment status. \n \n 5 \nRates of not good health were higher amongst non-employed groups (Table 1, Model C). \nAdjusting for all measures of SEP (Table 1, Model D) attenuated the differences somewhat for \nthose looking after the family or the home and the unemployed but made little impact for other \ngroups.  \n \n \nDISCUSSION \nOur results suggest that for both men and women employment status attenuates significantly \nSEP differences in not good health. These results suggest that the social gradient in employment \nstatus could be an important contributor to the social gradient in self rated general health. Arber \nusing survey data also reported an important role for non employment in the association between \nsocial class and self rated health.\n13\n Our work extends this to a wider range of socio-economic \nvariables and a more recent, larger and highly representative dataset as well providing a \nquantification of the impact.  \n \nWhy employment status may play such an important role in the relationship between SEP and \nself rated health cannot be ascertained in this cross-sectional study. We can only suggest some \nreasons. The relationship may run from poor health to non-employment to low SEP. In other \nwords health selection may be important. It is notable that the highest rate of not good health was \nin those describing their economic inactivity as being due to permanent sickness and disability. \nHowever, education as a SEP measure may be more robust to health selection as it is mainly \nachieved earlier in adult life.\n14\n  \n \nIf employment status affects, directly or indirectly, self rated health, it is therefore more likely to be \nthrough either poverty or differences in income (employment may better reflect income \ndifferences than our other measures of SEP) or differences in health behaviours (although the \nevidence is more equivocal on this) or through psychosocial mechanisms such as stress.\n5\n Finally, \n 6 \nemployment status may capture very well socio-economic differences across the lifecourse better \nthan any single measure of SEP at one single point of time.\n6\n \n \nIn conclusion our results suggest that it will be important for tackling health inequalities to \nunderstand why the social gradient in employment status seems to contribute so much to the \nsocial gradient in health. \n \n  \n \n 7 \nACKNOWLEDGEMENTS \nThe 2001 SARs are provided through the Cathy Marsh Centre for Census and Survey Research \n(University of Manchester), with the support of the ESRC and JISC. All tables containing Census \ndata, and the results of analysis, are reproduced with the permission of the Controller of Her \nMajesty's Stationery Office and the Queen's Printer for Scotland. \n \nContribution \nCB had the original idea that both authors subsequently developed. FP conducted the analysis \nand drafted the paper. Both authors contributed to subsequent revisions. \n \nFunding  \nThere was no funder of this research. \nPolicy Implications \n \n Lack of employment explained the majority of socio-economic inequalities in self rated \nhealth. Further work is needed to understand why this is the case but interventions which \nfind and help people retain work may be important for reducing health inequalities. \n \n 8 \nWhat is known on this subject \nPrevious studies have shown that unemployment and economic inactivity are associated with \nworse morbidity and mortality and that unemployment and economic inactivity are socially \ngraded. \n \nUnemployment and economic inactivity are therefore considered to be potentially very \nimportant social determinants of health which contribute greatly to the social gradient in health \nand to socio-economic health inequalities. \n \nHowever, existing studies have tended to focus specifically on the health of the unemployed \nor inactive, not on the contribution of employment status to the social gradient in health.  \n \n \n \nWhat this study adds \nUsing data on self reported health from the 2001 English Census, this study is the first to \nquantify the effects of employment status on the social gradient and socio-economic \ninequalities in health. \n \nIn keeping with existing research, the study found that regardless of socio-economic position, \npeople experiencing unemployment or economic inactivity have worse self rated than those in \nemployment.   \n \nIn addition, the results demonstrate that employment status contributes greatly to the social \ngradient in self-reported health, with unemployment and economic inactivity contributing up to \n81% of the excess in self reported not good health amongst the lowest socio-economic \ngroups.  \n \n  \n \n 9 \nREFERENCES \n1. Bartley M. Unemployment and ill health: understanding the relationship. Journal of \nEpidemiology and Community Health 1994;48:333-7. \n2. Martikainen P, Valkonen T. Excess mortality of unemployed men and women during a period \nof rapidly increasing unemployment. Lancet 1996;348(9032):909-912. \n3. Martikainen P., Valkonen T. The effects of differential unemployment rate increases of \noccupation groups on changes in mortality. American Journal of Public Health \n1998;88:1859-1861. \n4. Rodriguez E. Keeping the unemployed healthy: the effect of means-tested and entitlement \nbenefits in Britain, Germany and the United States. American Journal of Public Health \n2001;91:1403-1411. \n5. Bartley M, Ferrie J, Montgomery SM. Health and labour market disadvantage: unemployment, \nnon-employment, and job insecurity. . In: Marmot M, Wilkinson RG, editors. Social \ndeterminants of health. Oxford: Oxford University Press, 2006:78-96. \n6. Korpi T. Accumulating disadvantage: longitudinal analyses of unemployment and physical \nhealth in representative samples of the Swedish population. Eur Sociological Rev \n2001;17:255-74. \n7. Morris JK, Cook DG, Shaper AG. Loss of employment and mortality. BMJ 1994;308:1135-9. \n8. Bartley M, Plewis I. Accumulated labour market disadvantage and limiting long-term illness: \ndata from the 1971-1991 ONS longitudinal study. Int J Epidemiol 2002;31:336-41. \n9. Cathy Marsh Centre for Census and Survey R. Samples of anonymised records: user guide to \nthe SARs. Manchester: Cathie Marsh Centre for Census and Survey Research, 2007. \n10. Cooper H, Arber S. Gender, health and occupational classifications in working and later life  \nIn: Rose D, Pevalin DJ, editors. A Researcher’s Guide to the National Statistics Socio-\nEconomic Classification. London.: Sage, 2003. \n11. StataCorp. Stata statistical software: release 10. College Station, Texas: StataCorp LP, 2007. \n12. Mackenbach JP, Kunst AE. Measuring the magnitude of socio-economic inequalities in \nhealth: An overview of available measures illustrated with two examples from Europe. \nSocial science & medicine 1997;44(6):757-771. \n13. Arber S. Social class, non-employment, and chronic illness: continuing the inequalities in \nhealth debate. British Medical Journal 1987;294:1069–1073. \n14. Krieger N, Williams DR, Moss NE. Measuring social class in US public health research: \nConcepts, methodologies, and guidelines. Annual Review of Public Health 1997;18 341-\n378. \n \n \n \n \n \n \n 10 \nTable 1 Differences in prevalence of not good health general health for English men and women aged 25 to 59 in 2001. \n % of population % not good \nhealth \nModels A (age \nadjusted only) \nModels B (age  \nand  \nemployment \nstatus \nadjusted) \n% reduction  \nModels B \nfrom A \nModel C (age \nadjusted only) \nModel D (age  \nand  \nall SEP \nmeasures \nadjusted) \n% reduction  \nModels D \nfrom C \nMen N = 349,181        \nTenure         \nOwner occupied 76.1 5.6 0 0 -    \nPrivate rent 11.0 8.4 3.3 (3.0 to 3.5) 0.8 (0.6 to 0.9) 76    \nSocial rent 12.9 19.1 13.0 (12.6 to 13.4) 2.5 (2.3 to 2.8) 81    \nSlope index of inequality   17.3 (16.8 to 17.7) 3.3 (3.0 to 3.7) 81    \n         \nEducation*         \nLevel 4\/5 24.2 3.8 0 0 -    \nLevel 3 6.7 5.2 1.4 (1.1 to 1.7) 0.6 (0.4 to 0.8) 57    \nLevel 2 17.7 5.4 1.7 (1.5 to 1.9) 0.6 (0.5 to 0.8) 65    \nLevel 1 20.1 5.7 2.1 (1.9 to 2.3) 0.6 (0.5 to 0.8) 71    \nOther qualifications 9.6 9.9 4.3 (4.0 to 4.7) 1.5 (1.3 to 1.8) 65    \nNo qualifications 21.7 15.2 9.6 (9.3 to 9.9) 2.1 (1.9 to 2.2) 78    \nSlope index of inequality   9.3 (9.0 to 9.6) 2.3 (2.1 to 2.5) 75    \n         \nCar         \nCar access 87.6 6.2 0 0 -    \nNo car access 12.4 17.8 11.1 (10.8 to 11.5) 2.3 (2.1 to 2.6) 79    \n         \nHousing conditions         \nNot overcrowded or lacking amenities 86.2 7.0 0 0 -    \nOvercrowded & lacking amenities 13.8 11.3 4.2 (3.9 to 4.5) 1.3 (1.1 to 1.5) 69    \n         \n         \nEmployment status         \nEmployed 85.7 3.1   - 0 0  \nUnemployed and seeking work 4.3 9.1    5.9 (5.5 to 6.4) 4.6 (4.2 to 5.1) 22 \nRetired 1.5 14.8    10.2 (9.2 to 11.2) 10.0 (9.0 to \n10.9) \n2 \nLooking after home \/ family 1.1 11.6    8.2 (7.1 to 9.2) 6.7 (5.7 to 7.7) 18 \nPermanently sick or disabled 5.1 71.0    67.1 (66.4 to 67.8) 65.5 (64.9 to \n66.2) \n2 \nOther inactive 2.4 24.5    21.2 (20.3 to 22.1) 19.9 (19.0 to \n20.8) \n6 \n         \nWomen N = 349,699        \nTenure         \nOwner occupied 75.7 6.3 0  0     \nPrivate rent 9.7 8.4 3.0 (2.7 to 3.3) 1.0 (0.8 to 1.2) 67    \nSocial rent 14.5 16.6 10.0 (9.7 to 10.4) 3.5 (3.3 to 3.8) 65    \nSlope index of inequality   14.5 (14.1 to 15.0) 5.0 (4.6 to 5.3) 66    \n         \nEducation*         \nLevel 4\/5  23.6 4.8 0  0     \nLevel 3 6.8 5.5 1.0 (0.7 to 1.3) 0.5 (0.3 to 0.8) 50    \nLevel 2 21.2 6.3 1.6 (1.4 to 1.8) 0.8 (0.6 to 0.9) 50    \nLevel 1  20.8 6.5 1.9 (1.7 to 2.1) 0.5 (0.3 to 0.7) 74    \nOther qualifications 5.1 10.1 3.7 (3.2 to 4.1) 1.3 (1.0 to 1.7) 65    \n 11 \nNo qualifications 22.6 14.7 8.1 (7.8 to 8.4) 2.1 (1.9 to 2.3) 74    \nSlope index of inequality   7.9 (7.6 to 8.2) 2.1 (1.9 to 2.4) 73    \n         \nCar         \nCar access 86.2 6.8 0  0     \nNo car access 13.8 15.7 8.4 (8.1 to 8.7) 2.8 (2.5 to 3.0) 67    \n         \nHousing conditions         \nNot overcrowded or not lacking \namenities \n87.8 7.6 0  0     \nOvercrowded or lacking amenities 12.2 11.1 3.6 (3.3 to 3.9) 1.7 (1.5 to 1.9) 53    \n         \nEmployment status         \nEmployed 73.2 3.6 0     0  \nUnemployed and seeking work 2.6 8.2 4.6 (4.0 to 5.1)    3.3 (2.8 to 3.9) 28 \nRetired 1.7 11.7 6.8 (6.0 to 7.7)    6.6 (5.7 to 7.4) 3 \nLooking after home \/ family 14.5 6.8 3.1 (2.9 to 3.3)    2.0 (1.8 to 2.2) 35 \nPermanently sick 4.8 70.1 65.7 (65.0 to 66.4)    64.1 (63.4 to \n64.8) \n3 \nOther inactive 3.1 18.8 14.8 (14.0 to 15.5)    13.2 (12.5 to \n14.0) \n11 \n*Education levels are based on highest qualification achieved and are as follows: No qualifications, other qualifications (not covered in the following categories), level 1 (minimal end of compulsory \nschooling qualifications (age 16)), level 2 (end of compulsory schooling qualifications or minimal end of post compulsory schooling qualifications (age18) or vocational equivalent), level 3 (post compulsory \nschooling qualifications or vocational equivalent qualifications), level 4\/5 (higher education degree or vocational equivalent or professional qualification (e.g. doctor, teacher, nurse)). \n \n \n"}