{"doi":"10.1109\/EDMO.2003.1259964","coreId":"101793","oai":"oai:epubs.surrey.ac.uk:1225","identifiers":["oai:epubs.surrey.ac.uk:1225","10.1109\/EDMO.2003.1259964"],"title":"Implant Isolation of Both n-Type InP and InGaAs by Iron Irradiation: Effect of Post-Implant Annealing Temperature","authors":["Too, P","Ahmed, S","Jakiela, R","Barcz, A","Kozanecki, A","Sealy, B J","Gwilliam, R"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-01-01","abstract":"<p>1 MeV Fe+ was implanted into n-type InP and InGaAs layers at different substrate temperatures, -196degreesC, room temperature (RT), 100degreesC and 200degreesC to obtain high-resistivity regions. The sheet resistivity of the InP and InGaAs epilayers; grown on semi-insulating (SI) InP substrates was measured as a function of substrate temperature and post-implantation annealing temperature (100 - 800degreesC). For InP, a maximum sheet resistivity of similar to1x10(7) Omega\/rectangle was achieved for samples implanted at -196degreesC, RT and 100degreesC after annealing at 400degreesC. For InGaAs samples, a maximum sheet resistivity of 1x10(7) and 2.3x10(6) Omega\/rectangle is obtained for -196degreesC and RT implants respectively after annealing at 650degreesC for 60s. In both InP and InGaAs, the isolated regions exhibit good stability to heat treatment up to 500degreesC for all cases irrespective of the irradiation temperature. The iron depth profile obtained by secondary ion mass spectrometry (SIMS) shows that iron does not diffuse up to an annealing temperature of 550degreesC in both InP and InGaAs for all implantation temperatures. These results are novel since high sheet resistivity (similar to5x10(6) Omega\/rectangle) is obtained in both InP and InGaAs samples implanted at -196degrees and RT, and annealed at 400degreesC. These data demonstrate the potential usefulness of iron implantation for isolation of InP\/InGaAs based devices.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1225<\/identifier><datestamp>\n      2017-10-31T14:01:08Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:696F6E5F6265616D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1225\/<\/dc:relation><dc:title>\n        Implant Isolation of Both n-Type InP and InGaAs by Iron Irradiation: Effect of Post-Implant Annealing Temperature<\/dc:title><dc:creator>\n        Too, P<\/dc:creator><dc:creator>\n        Ahmed, S<\/dc:creator><dc:creator>\n        Jakiela, R<\/dc:creator><dc:creator>\n        Barcz, A<\/dc:creator><dc:creator>\n        Kozanecki, A<\/dc:creator><dc:creator>\n        Sealy, B J<\/dc:creator><dc:creator>\n        Gwilliam, R<\/dc:creator><dc:description>\n        <p>1 MeV Fe+ was implanted into n-type InP and InGaAs layers at different substrate temperatures, -196degreesC, room temperature (RT), 100degreesC and 200degreesC to obtain high-resistivity regions. The sheet resistivity of the InP and InGaAs epilayers; grown on semi-insulating (SI) InP substrates was measured as a function of substrate temperature and post-implantation annealing temperature (100 - 800degreesC). For InP, a maximum sheet resistivity of similar to1x10(7) Omega\/rectangle was achieved for samples implanted at -196degreesC, RT and 100degreesC after annealing at 400degreesC. For InGaAs samples, a maximum sheet resistivity of 1x10(7) and 2.3x10(6) Omega\/rectangle is obtained for -196degreesC and RT implants respectively after annealing at 650degreesC for 60s. In both InP and InGaAs, the isolated regions exhibit good stability to heat treatment up to 500degreesC for all cases irrespective of the irradiation temperature. The iron depth profile obtained by secondary ion mass spectrometry (SIMS) shows that iron does not diffuse up to an annealing temperature of 550degreesC in both InP and InGaAs for all implantation temperatures. These results are novel since high sheet resistivity (similar to5x10(6) Omega\/rectangle) is obtained in both InP and InGaAs samples implanted at -196degrees and RT, and annealed at 400degreesC. These data demonstrate the potential usefulness of iron implantation for isolation of InP\/InGaAs based devices.<\/p><\/dc:description><dc:date>\n        2003-01-01<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1225\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Too, P, Ahmed, S, Jakiela, R, Barcz, A, Kozanecki, A, Sealy, B J and Gwilliam, R  (2003) Implant Isolation of Both n-Type InP and InGaAs by Iron Irradiation: Effect of Post-Implant Annealing Temperature  In: The 11th IEEE International Symposium on Electron Devices for Microwave and Optoelectronic Applications, 2003. EDMO 2003..     <\/dc:identifier><dc:relation>\n        10.1109\/EDMO.2003.1259964<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1225\/","10.1109\/EDMO.2003.1259964"],"year":2003,"topics":[],"subject":["Conference or Workshop Item","NonPeerReviewed"],"fullText":"Implant isolation of both n-type InP and InGaAs by iron irradiation: \nEffect of post-implant annealing temperature \nP. Too\"*, S .  Ahmed', R. Jakiela', A. Barcz', A. Kozanecki*, B. J. Sealy' and R. \nGwilliam' \n'Advanced Technology Institute, School of Electronics and Physical Sciences, University of \nSurrey, Guildford, GU2 7XH, UK. \n'Institute of Physics, Polish Academy of Sciences, AI. Lotnikow 32\/46,02-668, Warsaw, \nPoland. \nAbstract \n1 MeV Fe' was implanted into n-type InP and InGaAs layers at different substrate \ntemperatures, -196'C, room temperature (RT), 100°C and 2OO0C to obtain high- \nresistivity regions. The sheet resistivity of the InP and InGaAs epilayers grown on semi- \ninsulating (SI) InP substrates was measured as a function of substrate temperature and \npost-implantation annealing temperature (100 - SOO'C). For InP, a maximum sheet \nresistivity of -lx107 W O  was achieved for samples implanted at -196OC, RT and 100°C \nafter annealing at 400'C. For InGaAs samples, a maximum sheet resistivity of M O 7  and \n2 . 3 ~ 1 0 ~  WO is obtained for -196'C and RT implants respectively after annealing at \n650'C for 60s. In both InP and InGaAs, the isolated regions exhibit good stability to \nheat treatment up to 5OO'C for all cases irrespective of the irradiation temperature. The \niron depth profile obtained by secondary ion mass spectrometry (SIMS) shows that iron \ndoes not diffuse up to an annealing temperature of 550'C in both InP and InGaAs for all \nimplantation temperatures. These results are novel since high sheet resistivity (-5x106 \nN O )  is obtained in both InP and InGaAs samples implanted at -196' and RT, and \nannealed at 400'C. These data demonstrate the potential usefulness of iron implantation \nfor isolation of InPDnGaAs based devices. \nIntroduction \nIn hulk InP and InGaAs materials, highly resistive behaviour is usually obtained by \ndoping the crystal with Fe during the growth. Fe atoms occupy In sites and act as deep \nacceptor centres for free electrons [l]. In epitaxial materials, the achievement of SI \nbehaviour in selected areas is of crucial importance for lateral device isolation in \nintegrated circuits and for the realisation of laser devices with current blocking regions \nbeside the active region [2]. Thus ion implantation is an obvious candidate to selectively \nobtain SI regions in InP and InGaAs. With the increasing use of InGaAs and InP layers \nin heterojunction devices, there is a critical need to understand the behaviour of these \nmaterials upon ion bombardment for isolation purposes. The resistive behaviour can be \ndue to the damage related levels introduced with the implant and\/or to chemical \ncompensation due to the implanted species (typically Fe or other transition metals) [3]. \nIn nt InP and especially n+ InGaAs, very low sheet resistivity (-IO4 WO) was reported \nby several authors after implantation of light ion species such as proton, helium, boron \nand nitrogen [4,5,6]. Isolation was mainly caused by a damage-induced compensation \nmechanism. In an effolt to obtain higher sheet resistivities in n-type materials, we have \n*Fax : +44 1483689404, E-mail: p.too@surrey.ac.uk \n0-7803-7904-7\/03\/$17.00 02003 IEEE. 18 \nAuthorized licensed use limited to: University of Surrey. Downloaded on March 23,2010 at 06:44:09 EDT from IEEE Xplore.  Restrictions apply. \ninvestigated the implantation of Fe, an impurity which is known to result in high- \nresistivity InP when used as a dopant during the growth of bulk crystals [7]. Many \nauthors in the past reported on anomalous behaviour of iron during annealing [8,9,10]. It \nseems to diffuse rapidly within the implanted layer gettering at the surface and at the \ndamaged regions. These authors claim that high resistivity behaviour cannot be achieved \nby Fe implantation on initially n' doped layers. \nThe formation of good and thermally stable electrical isolation in Si-doped InP and \nInGaAs layers using 1 MeV iron at different substrate temperatures is studied in this \nwork. \nExperimental Procedure \nSemi-insulating Fe-doped InP wafers of (100) orientation were used as substrates for the \ngrowth of both n-type InGaAs and InP epilayen, with the (100) axis 2' off normal \norientation, using a Solid Source Molecular Beam Epitaxy (SSMBE) reactor. The n-type \nepilayers were doped with silicon with a concentration and thickness of 1 ~ 1 0 ' ~  cm\" and \nlpm respectively. The wafers were cleaved to obtain several samples of approximately 1 \ncmz for the prepamtion of the resistors. All samples were cleaned in organic solvents and \nthe clover-leaf pattem was printed on them using optical lithography. The area of InP \nand InGaAs samples not covered with photoresist was etched to a depth of \napproximately 3pm using standard etching solutions. The photoresist was then removed \nin acetone leaving the cloverleaf Hall pattern on the samples. \nThe samples  were divided into four different groups with implant isolation at \ntemperatures of -196OC, RT, 100°C;and 200°C using a 2MV High Voltage Engineering \nEuropa (HVEE) implanter. For -196'C, 100nC and 2OO0C implants, ;the.samples were \nmounted on a special temperature control stage. The centre of the Hall pattem for all the \nsamples was irradiated with Fe' using a dose and ener y of ~ x I O ' ~  cm-2 and lMeV \nrespectively, with a beam current density < 0.33 pVcm , The post-implant annealing \nwas performed in ' the range 100°C - 800°C ( W C )  for a time of 60s in a nitrogen \natmosphere, following a ramp up time of 60s to temperature. Ohmic contacts to the \nsamples were fabricated by applying indium and sintering at approximately 2OO0C for \n2min. The sheet resistivity, was measured using a Bio-Rad HL.5500 Hall effect system \nemploying Van der Pauw geometry at 300K under a magnetic field strength of 0.32 T. \nAll measurements were done at RT for samples implanted at 77K, 100nC and 2OO0C. \nThe Fe depth profiles of the implant isolated samples were obtained by SIMS using a \nCAMECA IMS6f instrument. It was used to follow the diffusion behaviour of iron at \ndifferent annealing temperatures. A 12.5keVO; primary beam was used to monitor \nFe in both InP ,and InGaAs, analysing the 50pn diameter central part of a 150pn \nxl50pmcrater. \nResults and Discussion \nThe projected range of .lMeV iron in InP and InGaAs is about 0.6pm and 0.4pm \nrespectively. The energy of lMeV for the iron beam is chosen to place most of the iron \natoms well inside the doped layer. In this way, the chemical compensation will be more \neffective for the electrical isolation of the InP and InGaAs epilayers. The effect of post- \nimplant annealing' temperature on n-type InP samples for the four different substrate \ntemperatures is shown in figure 1. The initial sheet resistivity of the n-type InP layer for \nall the samples is -15 WD. After iron implantation, an as-implanted sheet resistivity of \n-5x106 WO is obtained for substrate temperatures of -196'C, RT, and 100°C and that of \n4 \n56 + . \n19 \nAuthorized licensed use limited to: University of Surrey. Downloaded on March 23,2010 at 06:44:09 EDT from IEEE Xplore.  Restrictions apply. \n200'C is 7x10' N O .  Thus there is an increase in the sheet resistivity-by almost five \norders of magnitude. After annealing the samples at 400'C for 60s, a maximum sheet \nresistivity of -lx107 N O  is reported for -196'C, RT and lOO'C substrate temperatures \nand that for 2OO0C implantation temperature is -2x106 WO. The sheet resistivity \ndecreases above 400'C but it increases again at 650'C to 2.1x106, 1 . 2 ~ 1 0 ~  and 2.6~10' \nnlo for -1960C, RT and 100°C implants respectively. This effect is not observed for \nsamples implanted at 200'C. The high sheet resistivity (lo6-- 107'WU) is maintained \nuntil an annealing temperature of 500'C for all four substrate temperatures. This wide \nthermally stable annealing window is extremely important from the technological point \nof view. \nWe believe that the isolation for iron implantation into InP is a combination of both \ndamage and chemical compensation. The deep acceptor level of Fe on an indium site is \nresponsible for the chemical compensation as observed in grown semi-insulating InP [l]. \nThis Fe deep level acceptor is annealed out at 600'C as reported by Kadonn et al [ 111. \nHence the decrease in the sheet resistivity observed at 600'C is believed to be the \nannealing of this defect level. The increase in sheet resistivity again at 650'C is believed \nto be due to a phosphorus vacanc iron (V, - Fe) complex defect which is formed above \nan annealing temperature of 600 C. Kadonn et al [ l  11 reported similar complex defects \nin InP for annealing temperatures between 600'C and 700'C. One possible explanation \nfor not observing this effect for 200'C implants is due to annealing of most of the V, \ndefects so that the complex defect responsible for the high sheet resistivity is less likely \nto be formed. The lower sheet resistivity obtained for 200'C implants as compared to - \n196'C, RT and 100°C implants is most probably due to a lower defect concentration as a. \nresult of enhanced dynamic annealing. Many of the defects created at such an elevated \ntemperature are annealed out or do not form during the implantation. We reported that \nfor a high dose ( 5 ~ 1 0 ' ~  cm-*), lower damage is obtained for higher substrate \ntemperatures [12]. Above 7OO0C, there is a gradual decrease in sheet resistivity for all \nthe substrate temperatures due to recovery of the carriers as the defects are annealed out \nand the iron diffuses out of the doped region (see SIMS data below). \nSimilar experiments to those just described were also canied out on n' InGaAs epilayers \nwhich had an initial sheet resistivity -32 QD. Figure 2 shows the change in the sheet \nresistivity as a function of post-implant annealing temperature which is similar in form \nto the results for InP (kgure 1). A maximum sheet resistivity of 1x10' and 2 . 3 ~ 1 0 ~  N O  \nis obtained for -196OC and RT implants respectively after annealing at 650'C for 60s. In \nthe case of l0O'C and 200'C implants, the maximum isolation is only -lxlO' W O  after \nannealin at 550'C. Similar to InP isolation results, the increase in the sheet resistivity \nfor -196 C and RT implanted samples at 650'C is most probably due to the formation of \ncom lex defects related to Fe atoms. As shown in figure 2, the sheet resistivity for - \n196 C implants is only two times higher than that of RT implants for samples annealed \nin the range of lOO'C - 5OO'C. Since all samples implanted at -196OC are measured at \nRT, a certain amount of annealing of defects may take place when the sample is brought \nup to room temperature, which may affect the isolation behaviour of the samples. We \ninfer that many of the defects formed at -196OC are annealed out as the samples are \nwarmed up to room temperature. A lower electrical isolation is obtained for hot implants \ncompared to -196'C and RT implants. This is most probably due to less damage \nproduction during hot implants due to enhanced dynamic annealing. Beyond the post- \nimplant annealing temperature where maximum isolation is obtained for all substrate \ntemperatures, the sheet resistivity decreases gradually towards its original value. This \nJ- \nl? \n2 .  \n20 \nAuthorized licensed use limited to: University of Surrey. Downloaded on March 23,2010 at 06:44:09 EDT from IEEE Xplore.  Restrictions apply. \nsuggests-that most of the defects are annealed out and that out-diffusion of Fe at \ntemperatures between 700 - 8OO0C occurs as shown by SIMS measurements (see \nbelow). \nFigures 3-6 show the SIMS Fe depth profiles of -196OC and 200'C implants for InP and \nInGaAs samples which have been annealed in the range of 100°C to 80OoC. The \ndetection limit for iron in both InP and InGaAs is 2-3x10\" cm\". The silicon signal is \nalso monitored during the SIMS measurements, showing the expected flat doping profile \nwithout any particular feature that 'could be related to those observed for the Fe signal \n(figure 3). An abrupt interface between the silicon doped layer and the substrate is \nobserved for all samples. The Fe degth,profile of the -196OC implants fits the TRIM \nprofile quite well,, but for the 200 C implants, broadening of the SIMS profile is \nobserved at the tail. One possible explanation of this broadening is the increased \nmobility of the iron during elevated temperature implants as a result of radiation \nenhanced diffusion: Also during 2OO0C implantation, the dynamic interaction of defects \nwith the injected iron could be another reason behind the tail broadening. The Fe profile \nfor InP and InGaAs samples annealed up to 65OoC and 550'C respectively, is similar to \nthe as-implanted profile for all substrate temperatures. In the case of InP, at an annealing \ntemperatures as high as 8OO0C, only a limited amount of Fe atoms diffuse from the \ndeeper side of the Fe peak towards the doped layer-substrate interface for '-196'C \nimplants (figure 3 ) .  No strong iron diffusion or accumulation peaks are observed at this \nimplantation temperature. For InP samples implanted at 2OO0C, the iron profile broadens \nduring annealing at 7OO0C and SOO'C. The, tail of the broadened profile extends up to \n1~ inside the substrate (figure 4). For InGaAs samples, above an annealing \ntemperature of 65OoC, iron atoms redistribute towards the surface and the interface \nbetween the InGaAs epilayer and the InP substrate (figure 5 and 6). These iesults are \nconsistent with the decrease in the sheet resistivity observed from figure 2. \nWe believe that the, immobility of iron in InP at such a high annealing temperature is due \nto the Si retarding effect on Fe diffusion. The Fe diffusion mechanism in InP.is not \ncompletely understood, although it is believed that Fe d i f h e s  with an interstitial - \nsubstitutional mechanism [13]. This diffusion mechanism involves the migration of iron \natoms from an interstitial position to a neighbouring substitutional one. Hence the \npresence of Si atoms on substitutional sites will reduce the vacant sites available for \ndiffusion of Fe. Van Gurp et al [14] have observed a similar retarding effect for zinc \ndiffusion in silicon doped InP. They reported a decrease in the diffusion of zinc with an \nincrease in the silicon doping concentration. \nConclusion \nA technologically relevant study of an isolation scheme using iron into n-type InP and \nInGaAs at various substrate temperatures has been made. The substrate temperature \nduring implantation is found to play an important role for maximum electrical. isolation \nand improved thermal stability of the isolation after post-implant annealing. Fe' \nimplantation at -196'C in both n-type InP and InGaAs is reported to provide hi h sheet \nresistivity without 'any diffusion of Fe' until an annealing temperature of 650 C. The \nimmobility of iron is a great advantage since the effect of Fe on the device performance \nwill be insignificant. These results are novel from the device engineering point of view \nand may have some useful applications for InPAnGaAs device isolation. \n% \n21 \nAuthorized licensed use limited to: University of Surrey. Downloaded on March 23,2010 at 06:44:09 EDT from IEEE Xplore.  Restrictions apply. \nAcknowledgements \nThe authors gratefully acknowledge financial support from the UK Engineering and \nPhysical Sciences Research Council (EPSRC). We would also like to thank the staffat \nthe Sheffield 111-V facility for the growth of the epilayers. \nReferences: \nU1 S. Fung, R. J. Nicholas, and R. A. Stradling, A study of the deep acceptor levels \nof iron in InP,.I Phys. C(1979) 12,5145. \nM. V. Rao, High-energy(MeV) ion implantation and its device applications in \nGaAs and InP, IEEE Trans. Elec. Dev. (1979) 40, 1053. \nS .  J. Pearton, Ion implantation for isolation of 111-V semiconductors, Mater. \nSci. Rep. (1990) 4,313. \nJ .  P. Donnelly, and C. E. Hunvitz, Proton bombardment in InP, Sol. Stat. Elec. \n(1977) 20,727. \nB. Tell, K. F. Brown-Goebeler, T. J. Bridges, and E. G. Burkhardt, Resistance \nand' mobility changes in InCaAs. produced by light ion bombardment, .I \nAppl. Phys. (1986) 60,665. \nP. Too, S .  Ahmed, R. Gwilliam, and B. J. Sealy, Implant isolation of InP and \nInCaAs by proton irradiation a t  variable doses and substrate temperatures, \nIEEEIntl. Symp. on Elec. Dev. Micro. Opto. Appl. (EDMO, Vienna) (2001) 125. \n0. Mizuno, and H. Watanabe, Semi-insulating properties of Fe-doped InP, \nElec. Lett. (1975) 11, 118. \nJ. Vellanki, R. K. Nadella, M. V. Rao, 0. W. Holland, D. S .  Simons, and P. H. \nChi, MeV energy Fe and CO implants to obtain buried high-resistance layers \nand to compensate donor implant tails in InP, .I Appl. Pbys. (1993) 73, 1126. \nS. I. Pearton, C. R. Abemathy, M. B. Panish, R. A. H a \" ,  and L. M. Lunardi, \nImplant induced high-resistivity regions in InP and InCaAs, J. Appl. Pbys. \n(1989) 66,656. \nS. A. Schwartz, B. Schwartz, T. T. Sheng, S .  Singh, and B. Tell, Annealing \nbehaviour of ion-implanted Fe in InP,J. Appl. Pbys. (1985) 58, 1698. \nA. Kadoun, G. Mmakchi, A. Kalboussi, D. Barbier, and G. Guillot, Study of \ndeep level defect behaviour in rapid thermal annealed Fe-doped semi- \ninsulating InP,Mar. Sci. andEng. B (1995) 33, 188. \nP. Too, S .  Abmed, C. Jeynes, B. J. Sealy, and R. Gwilliam, Electrical isolation \nof n-type InP using MeV iron imp1,antation at different doses and substrate \ntemperatures, Elec. Lett. (2002) 38, 1225. \nB. Tuck, Mechanisms of atomic diffusion in the 111-V semiconductors, .I \nPbys. D: Appl. Pbys. (1985) 18,557. \nG. J .  Van Gurp, P. R. Boudewijn, M. N. C. Kempeners, and D. L. A. Tjaden, \nZinc diffusion in n-type indium phosphide,J. Appl. Phys. (1987) 61, 1846. \n22 \nAuthorized licensed use limited to: University of Surrey. Downloaded on March 23,2010 at 06:44:09 EDT from IEEE Xplore.  Restrictions apply. \n-.--I%? \n10' \n10' 3 \na \n5 105 \ni? \n$ io' 1 \n8 10' c \n10' \ne \n+. \nI \nhIUlll&reS* 1 ........ ........ ......... ........ ........ ......... \n10 \" ' r ' r \" ' r ' r \" ' l  \n0 1W 2M) 3W 400 5W 6W 700 800 900 I\" 0 100 200 300 400 500 600 700 800 900 \nAnnealing temperature (C) Annealing temperature (c) \nFigure 1: Evolution of sheet resistivity with Figure 2: Evolution of sheet resistivity with \ndifferent post-implant annealing temperature for different post-implant annealing temperature for \nlMeV iron implanted n-type InP layers iron implanted n-type InGaAs layers irradiated \nirradiated with 5 ~ 1 0 ' ~  c d a i  -196OC, RT, 100°C with 5 ~ 1 0 ' ~  cm-' at lMeV at -196OC. RT. 100°C \nand 2OOOC. and 200°C \n10\" \n00 05 10 15 20 25 \nDepth (w) \nFigure 3: SlMS Fe profiles for InP samples \nimplanted at -196OC usmg a dose of 5 ~ 1 0 ' ~  cm-'\nfor different annealmg temperatures Si and TRIM \nFe profile is also plotted on the same graph \n1 om E -.-2000c ---550'C I \n15 20 25 \n1O\"t \" \" \" \" \" ' \n0 0  0 5  10 \nDsph (rm) \nFigure 5: SIMS Fe profiles for InGaAs samples \nimplanted at -196OC using a dose of 5 ~ 1 0 ' ~  cm'*\nfor different annealing temperatures TRIM Fe \nprofile is also plotted on the same graph \n23 \n-.-mt \n-.-mt \n-.-7Wb \n- 4 - S W t  \n10'0 \nTRIM  1 oq9 \n10\" \nI O \"  \n10\" \n00 05 10 15 20 2 5  \nDepth (!4 \nFigure 4: SIMS Fe profiles for InP sam les \ndifferent annealing temperatures TRIM Fe profile \nis also plotted on the same graph. \nimplanted at 2OO0C using a dose of 5 ~ 1 0 ' ~  cm-B for \n[ \" \" \" \" \" I  -.--as4mdanfed \n10\" \n0.0 0.5 1.0 1.5 2.0 2.5 \nDsph (I\" \nFigure 6: SIMS Fe profiles for InGaAs samples \nimplanted at 2OO0C using a dose of 5 ~ 1 0 ' ~  cm-'\nfor different annealing temperatures. TRIM Fe \nprofile is also plotted on the same graph. \nAuthorized licensed use limited to: University of Surrey. Downloaded on March 23,2010 at 06:44:09 EDT from IEEE Xplore.  Restrictions apply. \n"}