{"doi":"10.1007\/s10708-008-9148-6","coreId":"70913","oai":"oai:eprints.lancs.ac.uk:9555","identifiers":["oai:eprints.lancs.ac.uk:9555","10.1007\/s10708-008-9148-6"],"title":"Airline data for global city network research: reviewing and refining existing approaches.","authors":["Derudder, Ben","Witlox, Frank","Faulconbridge, James","Beaverstock, Jonathan"],"enrichments":{"references":[{"id":16375538,"title":"Beyond world cities. Central America in a global space of flows.","authors":[],"date":"2002","doi":"10.1111\/1475-4762.00066","raw":"Economic Geography, 78, 425-440 Brown, E., Catalano, G. & Taylor, P.J. (2002). Beyond world cities. Central America in a global space of flows. Area, 34, 139-148 Castells, M. (1996). The Rise of the Network Society. The information Age: Economy, Society and Culture, Volume 1. (Oxford: Blackwell) Castells, M. (2001). The Rise of the Network Society. The information Age: Economy, Society and Culture, Volume 1 (2 nd Edition). (Oxford: Blackwell) Cattan, N. (1995). Attractivity and internationalisation of major European cities: the example of air traffic. Urban Studies, 32, 303–312 Cattan N. (2004). Le monde au prisme des réseaux aériens. Flux, 58, 32-43 Derudder, B. (2006). On conceptual confusion in empirical analyses of a transnational urban network. Urban Studies, 43, 2027-2046 Derudder, B., Taylor, P.J., Witlox, F. & Catalano, G. (2003). Hierarchical tendencies and regional patterns in the world city network: A global urban analysis of 234 cities. Regional Studies, 37, 875-886 Derudder, B. & Taylor, P.J. (2005). The cliquishness of world cities. Global Networks, 5, 71-91 Derudder, B., & Witlox, F. (2005). An Appraisal of the Use of Airline Data in Assessing the World City Network: a Research Note on Data. Urban Studies, 42, 2371-2388   16 Derudder, B., Devriendt, L. & Witlox, F. (2007). Flying where you don’t want to go: an empirical analysis of hubs in the global airline network. Tijdschrift voor Economische en Sociale Geografie, 98, 307-324 Dicken, P. (2007). Global Shift: Mapping and Changing the Contours of the World Economy (5 th Edition). (New York: Guilford) Ducruet, C. & Lee, S.W. (2006). Frontline soldiers of globalisation: port-city evolution and regional competition. Geojournal, 67, 107-122 Dupuy, G. (2004). Internet: une approche géographique à l'échelle mondiale. Flux, 58, 5-19 Faulconbridge, J.R., Beaverstock, J.V., Derudder, B. & Witlox, F. (2008) Corporate ecologies of international business travel: examples from professional service firms. Manuscript under review, available from authors.","cites":null},{"id":16375565,"title":"Exploratory analysis of the world city network.","authors":[],"date":"2002","doi":"10.4324\/9780203634059","raw":"Urban Studies, 39, 2367-2376 Taylor, P.J., Catalano, G. & Walker, D.R.F. (2002b). Exploratory analysis of the world city network. Urban Studies, 39, 2377-2394 Taylor, P.J., Derudder, B., Saey, P. & Witlox, F. (Eds.) (2007). Cities in Globalization: Practices, Policies, Theories. (London: Routledge) Townsend, A.M. (2001a). Network cities and the global structure of the Internet. American Behavioral Scientist, 44, 1697-1716 Townsend, A.M. (2001b). The Internet and the rise of the new network cities (1969-1999).","cites":null},{"id":16375545,"title":"Global logics in the Caribbean city system: the case of Miami. (In P.L. Knox & P.J. Taylor (Eds.), World Cities in a World-System (pp. 156-170). Cambridge:","authors":[],"date":"1995","doi":"10.1017\/cbo9780511522192.010","raw":"International Journal of Urban and Regional Research, 6, 309–344 Grosfoguel, R. (1995). Global logics in the Caribbean city system: the case of Miami. (In P.L. Knox & P.J. Taylor (Eds.), World Cities in a World-System (pp. 156-170). Cambridge: Cambridge University Press.) Keeling, D.J. (1995). Transport and the world city paradigm. (In P.L. Knox & P.J. Taylor (Eds.), World Cities in a World-System (pp. 115-131). Cambridge: Cambridge University Press.) Keeling, D.J. (2007). Transportation geography: new directions on well-worn trails. Progress in Human Geography, 31, 217–225 Knox, P.L. (1998). Globalization and world city formation. (In S.G.E. Gravesteijn (Ed.), Timing Global Cities (pp.21-31). Utrecht: Netherlands Geographical Studies.) Kunzmann, K.R. (1998). World city regions in Europe: structural change and future challenges. (In F.C. Lo & Y.M. Yeung (Eds.), Globalization and the World of Large Cities (pp.37-75).","cites":null},{"id":16375535,"title":"Globalization and world cities: some measurement methodologies.","authors":[],"date":"2003","doi":"10.1016\/s0143-6228(99)00016-8","raw":"Globalization and world cities: some measurement methodologies. Applied Geography, 20, 43-63 Black, W.R. (2003). Transportation: A Geographical Analysis. (New York: Guilford Press) Bowen, J. (2002). Network change, deregulation, and access in the global airline industry.","cites":null},{"id":16375554,"title":"Globalization to a Latin beat: the Miami growth machine. Annals of the American Academy of Political and Social Sciences,","authors":[],"date":"1997","doi":"10.1177\/0002716297551001012","raw":"Transportation Research Part E: Logistics and Transportation Review, 43, 269-282 Nijman, J. (1997). Globalization to a Latin beat: the Miami growth machine. Annals of the American Academy of Political and Social Sciences, 551, 163-176 O'Connor, K. (2003). Global air travel: toward concentration or dispersal? Journal of Transport Geography, 11, 83-92 Rimmer, P.J. (1998). Transport and telecommunications among world cities. (In F.C. Lo & Y.M. Yeung (Eds.), Globalization and the World of Large Cities (pp. 433-470). Tokyo: United Nations University Press.) Robinson, J. (2002). Global and world cities: a view from off the map. International Journal of Urban and Regional Research, 26, 531-554 Robinson, J. (2005). Urban geography: world cities, or a world of cities. Progress in Human Geography, 29, 757-765 Rodrigue, J.P., Comtois, C. & Slack, B. (2006). The Geography of Transport Systems. (New York: Routledge) Rozenblat, C. & Pumain, D. (2007). Firm linkages, innovation and the evolution of urban systems. (In P.J. Taylor, B. Derudder, P. Saey & F. Witlox (Eds.), Cities in Globalization: Practices, Policies, Theories (pp. 130-156). London: Routledge.) Rutherford, J., Gillespie, A. & Richardson, R. (2004). The territoriality of pan-European telecommunications backbone networks. Journal of Urban Technology, 11 (3), 1-34 Sassen, S. (1991). The Global City: New York, London, Tokyo. (Princeton: Princeton University Press) Sassen, S. (2001). The Global City: New York, London, Tokyo (2 nd Edition). (Princeton: Princeton University Press) Sheller, M. & Urry, J. (2006). The new mobilities paradigm. Environment and Planning A, 38, 207–226 Short, J.R., Kim, Y., Kuss, M. & Wells, H. (1996). The dirty little secret of world city research.","cites":null},{"id":16375568,"title":"Hierarchies, regions and legacies: European cities and global commercial passenger air travel.","authors":[],"date":"2005","doi":"10.1080\/14782800500212459","raw":"Environment and Planning B, 28, 39-58 Zook, M. & Brunn, S. (2005). Hierarchies, regions and legacies: European cities and global commercial passenger air travel. Journal of Contemporary European Studies, 13, 203-220","cites":null},{"id":16375532,"title":"Power and position in the world city system.","authors":[],"date":"2004","doi":"10.1086\/378930","raw":"Alderson, A.S. & Beckfield, J. (2004). Power and position in the world city system. American Journal of Sociology, 109, 811-851 Alderson, A.S. & Beckfield, J. (2007). Globalization and the world city system. Preliminary results from a longitudinal data set. (In P. J. Taylor, B. Derudder, P. Saey & F. Witlox (Eds.), Cities in Globalization: Practices, Policies, Theories (pp. 21-36). London: Routledge.) Amiel, M., Melançon, G. & Rozenblat, C. (2005). Réseaux multi-niveaux: l'exemple des échanges aériens mondiaux de passagers. M@ppemonde, 79. Retrieved on 12\/02\/2007 from http:\/\/mappemonde.mgm.fr\/num7\/articles\/art05302.html Beaverstock, J.V., Smith, R.G. & Taylor, P.J. (2000a). World city network: a new metageography? Annals of the Association of American Geographers, 90, 123-134 Beaverstock, J.V., Smith, R.G., Taylor, P.J., Walker, D.R.F. & Lorimer, H. (2000b).","cites":null},{"id":16375550,"title":"The economic geography of the Internet’s infrastructure.","authors":[],"date":"2002","doi":"10.2307\/4140796","raw":"Tokyo: United Nations University Press.). Malecki, E. (2002). The economic geography of the Internet’s infrastructure. Economic Geography, 78, 399-424 Marcuse, P. & Van Kempen, R. (Eds.) (2000). Globalizing Cities: a New Spatial Order? (Oxford: Blackwell) Matsumoto, H. (2004). International urban systems and air passenger and cargo flows: some calculations. Journal of Air Transport Management, 10, 241–249 Matsumoto, H. (2007). International air network structures and air traffic density of world cities.","cites":null},{"id":16375542,"title":"The world city hypothesis.","authors":[],"date":"1986","doi":"10.1111\/j.1467-7660.1986.tb00231.x","raw":"Friedmann, J. (1986). The world city hypothesis. Development and Change, 17, 69–83 Friedmann, J. & Wolff, G. (1982). World city formation: an agenda for research and action.","cites":null},{"id":16375558,"title":"World cities in Asia: cliques, centrality and connectedness.","authors":[],"date":"2000","doi":"10.1080\/00420980020002805","raw":"International Journal of Regional and Urban Research, 20, 697–717 Shin, K.H. & Timberlake, M. (2000). World cities in Asia: cliques, centrality and connectedness.","cites":null},{"id":16375562,"title":"World city networks and hierarchies 1979–1999: An empirical analysis of global air travel links.","authors":[],"date":"2001","doi":"10.1177\/00027640121958104","raw":"Urban Studies, 37, 2257–2285 Smith, D.A. & Timberlake, M. (2001). World city networks and hierarchies 1979–1999: An empirical analysis of global air travel links. American Behavioral Scientist, 44, 1656–1677 Smith, D.A & Timberlake, M. (2002). Hierarchies of dominance among world cities: a network approach. (In S. Sassen (Ed.), Global Networks, Linked Cities (pp. 117-141). London: Routledge.) Taylor, P.J. (2001). Specification of the world city network. Geographical Analysis, 33, 181-194 Taylor, P.J. (2004a). World City Network: A Global Urban Analysis. (London: Routledge) Taylor, P.J. (2004b). New political geographies: Global civil society and global governance through world city networks. Political Geography, 24, 703-730 Taylor, P.J., Catalano, G. & Walker, D.R.F. (2002a). Measurement of the world city network.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-01","abstract":"Information on air passenger flows is potentially a prime data source for assessing spatial patterns in the global city network, but previous analyses have been hampered by inadequate and\/or partial data. The ensuing analytical deficiencies have reduced the overall value of these analyses, and this paper examines how some of these deficiencies may be rectified. First, we review the rationale for using airline data to analyse the global city network. Second, we assess the data problems encountered in previous research. Third, we elaborate on the construction of datasets that may circumvent some of these problems. The proposed refinements include the omission of the hub function of major airports and ways to extract relevant business flows from the data","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70913.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/9555\/1\/Derudder_et_al._paper.pdf","pdfHashValue":"e7ad8d7e704d3ba3f2ad3559efdeb22d72bea79a","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:9555<\/identifier><datestamp>\n      2018-01-24T03:22:32Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D47:4731<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Airline data for global city network research: reviewing and refining existing approaches.<\/dc:title><dc:creator>\n        Derudder, Ben<\/dc:creator><dc:creator>\n        Witlox, Frank<\/dc:creator><dc:creator>\n        Faulconbridge, James<\/dc:creator><dc:creator>\n        Beaverstock, Jonathan<\/dc:creator><dc:subject>\n        G Geography (General)<\/dc:subject><dc:description>\n        Information on air passenger flows is potentially a prime data source for assessing spatial patterns in the global city network, but previous analyses have been hampered by inadequate and\/or partial data. The ensuing analytical deficiencies have reduced the overall value of these analyses, and this paper examines how some of these deficiencies may be rectified. First, we review the rationale for using airline data to analyse the global city network. Second, we assess the data problems encountered in previous research. Third, we elaborate on the construction of datasets that may circumvent some of these problems. The proposed refinements include the omission of the hub function of major airports and ways to extract relevant business flows from the data.<\/dc:description><dc:date>\n        2008-01<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/9555\/1\/Derudder_et_al._paper.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s10708-008-9148-6<\/dc:relation><dc:identifier>\n        Derudder, Ben and Witlox, Frank and Faulconbridge, James and Beaverstock, Jonathan (2008) Airline data for global city network research: reviewing and refining existing approaches. GeoJournal, 71 (1). pp. 5-18. ISSN 1572-9893<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/9555\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1007\/s10708-008-9148-6","http:\/\/eprints.lancs.ac.uk\/9555\/"],"year":2008,"topics":["G Geography (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Airline data for global city network research: reviewing and refining existing approaches \n \nBen Derudder*, Frank Witlox*, James Faulconbridge**, Jon Beaverstock*** \n \n*  \nGeography Department \nGhent University \nE-mail: ben.derudder@ugent.be, frank.witlox@ugent.be \n \n** \nGeography Department \nLancaster University \nE-mail: j.faulconbridge@lancaster.ac.uk \n \n*** \nGeography Department \nNottingham University \nE-mail:  jonathan.beaverstock@nottingham.ac.uk \n \n \nAbstract \n \nInformation on air passenger flows is potentially a prime data source for assessing spatial \npatterns in the global city network, but previous analyses have been hampered by inadequate \nand\/or partial data. The ensuing analytical deficiencies have reduced the overall value of these \nanalyses, and this paper examines how some of these deficiencies may be rectified. First, we \nreview the rationale for using airline data to analyse the global city network. Second, we assess \nthe data problems encountered in previous research. Third, we elaborate on the construction of \ndatasets that may circumvent some of these problems. The proposed refinements include the \nomission of the hub function of major airports and ways to extract relevant business flows from \nthe data. \n \nKeywords: global city network, transnational mobility, business travel, airline data \n \n \nI. Introduction \n \nIt has become commonplace to underline that recent developments in (the geographies of) \ntransport and communication infrastructures have had a profound impact on the spatial \norganization of an increasingly globalized society (e.g. Black, 2003; Rodrigue et al., 2006; \nDicken, 2007). One of the most commonly cited evolutions in this context is the alleged demise \nof the relevance of ‘territoriality’ in favour of ‘networks’, an evolution which leading sociologist \nManuel Castells (1996, 2001) famously described as a transition from an international economy \norganized around ‘spaces of places’ to a global economy organized around ‘spaces of flows’. \nAlthough there is a great deal of debate on the actual significance and implications of this shift, \nthere can be little doubt that the spectacular growth of border-crossing mobility – for the largest \npart through air transport – is increasingly producing new spatial patterns of economic and social \nlife. This had led some researchers to suggest that radical new ways of structuring our thinking \nabout spatial patterns are required. Sheller and Urry (2006), for instance, attempt to capture these \ntrends by devising a ‘new mobilities paradigm’, which is concerned with the patterning, timing, \nand causation of the face-to-face copresence so greatly facilitated by the contemporary surge in \nmobility. Another major strand of research focuses on potential spatial frameworks for capturing \nthese trends, whereby a so-called ‘global city network’ (GCN) appears to be a likely candidate to \nreplace the inter-state system for organizing our knowledge about the world (Taylor, 2004). \nGlobal cities are hereby essentially defined as key points in the organization of the global \neconomy, and increasingly derive their functional importance from their mutual interactions \nrather than with their proper hinterlands\n1\n. In this paper, we will focus on one particular aspect of \nthe interrelation between transnational mobility and this networked geography, i.e. the relevance \nof data on air passenger flows for revealing the material spatiality of this GCN.  \n \nThe paper consists of three main parts. The first section presents a general introduction to the \nGCN literature, with a specific focus on the position of airline-based studies within this research \ndomain. The relevance of air transport for GCN research may seem deceitfully obvious: air \ntransport is all about connections between cities, while airline data are comparatively easy to \nobtain. Our intention here, however, is to provide a somewhat deeper understanding of the \nrelevance of airline data by situating this information source within the GCN literature at large. \nThe second section shows how previous airline-based studies have quasi-systematically been \nhampered by inadequate and\/or partial data. The third section, then, presents some possible \nalternatives to the problem of inadequate data. It is not our intention to provide yet another \nempirical analysis of global city-formation based on ‘better’ data, but rather to provide a \nconceptual overview of how airline-based analyses of GCNs may collectively be improved in \nfuture research. To this end, we discuss some alternative data sources and propose some data \nmanipulations that, taken together, may advance our understanding of the empirical association \nbetween air transport and GCNs. In a short conclusion, we briefly discuss the main implications \nof this paper and outline some avenues for further research.   \n \n                                                \n1\n Some researchers explicitly differentiate between the terms ‘global city’ and ‘world city’ (e.g. Sassen, 2001), and \nin some cases such distinction is indeed no less than crucial (see Derudder, 2006). However, in the context of the \npresent paper, these conceptual details are of lesser importance, and we will therefore consistently use the generic \nterm ‘global city’ to address the literature at large. \nII. The position of air transport-based studies within global city network research \n \nII.1 GCN research: basic assumptions and main critiques \n \nThe contemporary GCN literature can be traced back to two interrelated papers by Friedmann \nand Wolff (1982) and Friedmann (1986). Both texts framed the rise of a global urban system in \nthe context of a major geographical transformation of the capitalist world economy. This \nrestructuring, most commonly referred to as the ‘new international division of labour’, was \nbasically premised on the internationalization of production and the ensuing complexity in the \norganizational structures of multinational enterprises (MNEs). This increased economic-\ngeographical complexity, Friedmann (1986) argued, requires a limited number of control points \nin order to function, and global cities were deemed to be such points. The publication of Saskia \nSassen’s (1991) The Global City in 1991 marked a shift of attention to global inter-city flows \nresulting from the critical servicing of worldwide production rather than to its formal command \nthrough corporate headquarters of MNEs. Sassen’s approach focuses upon the attraction of \nadvanced producer service firms (providing professional, financial and creative services for \nbusinesses) to major cities with their knowledge-rich environments and specialist markets. In the \n1980s and 1990s many such service firms followed their global clients to become important \nMNEs in their own right. These advanced producer service firms thereupon created worldwide \noffice networks covering major cities in most or all world regions, and it is exactly the myriad of \ninterconnections between service complexes that gives, according to Sassen (1991, 2001), way to \nGCN formation.  \n \nA number of fundamental assumptions of GCN research have been criticized from different \nquarters. A main conceptual limitation of this literature has been the concentration on a relatively \nfew large metropolitan centres to concomitant neglect of all other cities. The most trenchant \ncritique along these lines is by Robinson (2002, p. 536), who complains that “millions of people \nand hundreds of cities are dropped off the map of much research in urban studies.” This \nexclusion is from two ‘maps’: (i) the geographical map of world cities wherein most cities in the \n‘South’ are missing; and (ii) the conceptual map of global cities which focuses on a narrow range \nof global economic processes so that myriad other connections between cities are missing. \nHowever, all cities experience contemporary global processes, and globalization can therefore \nnot be construed as affecting just a few privileged cities. Subsequently Robinson (2005, p. 760) \nhas conceded that the GCN literature now covers “a much wider range of cities around the \nglobe” thus lessening the exclusion from the map. This attempt to broaden our understanding of \nthe global city network has seen the postulation of such ideas as ‘globalizing cities’ (Marcuse \nand van Kempen, 2000) or ‘cities in globalization’ (Taylor et al., 2007).  \n \nEmpirical GCN research, in turn, the topic on which the present paper focuses, has long \nremained underdeveloped because of the lack of appropriate data, a problem which Short et al. \n(1996) referred to as ‘the dirty little secret of world cities research’. This empirical poverty can, \nfor instance, clearly be read from Castells’ (1996, p. 469) book, which is part of a trilogy that is \nabove all an attempt to reformulate social studies for a global age in which “networks constitute \nthe new social morphology of our societies.” However, when it comes down to providing a basic \ncartography of this global network society, Castells’ argument falls short of the conceptual shift \nhe advances: the only actual evidence he comes up with in the chapter on the ‘space of flows’ \nconsists of some limited inter-city information gathered from Federal Express. One can therefore \nonly conclude, as Taylor (2004, p. 35) has recently done, that “the evidence [Castells] marshalls \nis mightily unimpressive.” This gap between theoretical sophistication and evidential poverty is \nhowever not a lacuna specific to Castells’ book: it has been a structural feature of research on \nthe GCN, because data for assessing such urban networks are in general insufficient or even \ntotally absent.  \n \nII.2. Solutions to the empirical problem \n \nThe basic reason for this problem of evidence is that standard data sources are ill-suited for GCN \nanalyses (Taylor, 1997, 2004). To get an evidential handle on big issues, researchers normally \nrely on the statistics that are available, that is to say, already collected. But such collection is \ncarried out usually by a state agency for the particular needs of government policy rather than for \nsocial science research. The result is that such data that are available have an attributional bias \n(measurements of administrative areas rather than between administrative areas) and are limited \nto national territories. Where official statistics extend beyond a state’s boundaries they will still \nuse countries as the basic units (e.g. trade data). Thus there is no official agency collecting data \non, say, the myriad flows between London and New York. The major result has been that “few \nof the available data reveal anything about the flows and interdependencies” that are at the heart \nof this body of literature (Knox, 1998, p. 26), which leads Alderson and Beckfield (2004, p. 814) \nto note that in the past relatively few of the empirical GCN studies “utilized the sorts of \nrelational data necessary for firmly establishing such rankings empirically.”  \n \nThese data problems have put researchers to work in recent years, and we have therefore \nwitnessed a proliferation of empirical studies that explicitly seek to rectify this situation.  \nResearchers have hereby relied on a wide variety of data, albeit that some information sources \nhave come to dominate the empirical research as a whole (Derudder, 2006), i.e. (i) information \non corporate organization (e.g. data on ownership links between firms across space) and (ii) \ninformation on infrastructure networks (e.g. data on the volume of air passenger flows across \nspace). The success of both approaches can, of course, be traced back to their commonsensical \nappeal: the corporate organization approach acknowledges that well-connected cities derive their \nstatus in large part from the presence of key offices of important firms, while the infrastructure \napproach recognizes that well-connected cities are typified by the presence of vast enabling \ninfrastructures. Put simply: the most important cities harbour the most important airports, while \nthe extensive fiber backbone networks that support the Internet have equally been deployed \nwithin and between major cities, hence creating a vast planetary infrastructure network on which \nthe global economy has come to depend almost as much as physical transport networks \n(Rutherford et al., 2004).  \n \nTable 1 summarizes the approaches developed in the empirical GCN literature through an \noverview of some key studies in this research domain. The table acknowledges that the basic \nbifurcation between corporate organization and infrastructure needs to be deepened on the basis \nof the exact types of firms and infrastructures, and equally shows that all this is in practice \nsomewhat more complicated because of the presence of a limited number of studies that (i) make \nuse of other types of data (e.g. Taylor’s (2004b) analysis of non-governmental organizations) \nand\/or (ii) combine indicators from both approaches (e.g. Beaverstock et al., 2000b). In the next \nsection, we focus on empirical GCN studies that utilize data on international air transport flows \nto map GCNs. \n \nTable 1 about here \n \n \n \n 5 \nIII. Data issues in airline-based GCN studies \n \n• Preamble \n \nThe starting point of airline-based GCN studies is the rather commonsensical observation \nthat interactions between global cities are in large part facilitated and defined by \ntransnational air transport flows. Following Keeling’s (1995) initial contribution, there \nhave been a large number of empirical researches that draw upon airline data to devise a \nmapping of the GCN (e.g. Cattan, 1995, 2004; Short et al., 1996; Kunzmann, 1998; \nRimmer 1998; Shin and Timberlake, 2000; Smith and Timberlake, 2001, 2002; \nMatsumoto, 2004, 2007; Zook and Brunn, 2005). In principle, the most important \nadvantage of this approach over researches carried out in the corporate organization \napproach is that airline statistics feature tangible inter-city relations. However, in \nhindsight, and in spite of the remarkable success of this type of research, it can be noted \nthat most authors have simply asserted the relevance of publicly available airline data, \nalthough these are – in our view – downplayed by a number of structural problems (for \nearlier, but partial assessments, see Taylor, 1999; Beaverstock et al., 2000). In this \nsection, we will provide a systematic overview of these data problems, which will in turn \nbe used in the next section to show how this baleful situation may be rectified.  \n \n• The first problem: the lack of origin\/destination data \n \nIn spite of profound differences between the most commonly employed air transport \nstatistics – i.e. those provided by the Official Airline Guide (OAG), the International Air \nTransport Association (IATA) and the International Civil Aviation Organization (ICAO) \n–, these data sources are collectively hampered by at least three problems. A first major \nproblem is the lack of origin\/destination information. Standard airline statistics feature the \nindividual legs of trips rather than the trip as a whole. Thus, in the case of a stopover, a \nsignificant number of ‘real’ inter-city links are replaced by two or more links that reflect \ncorporate strategy rather than GCN relations. Furthermore, the lack of origin\/destination \ninformation makes geographically detailed assessments of the GCN difficult, as direct \nconnections become less likely as one goes down the urban hierarchy. And finally, the \nemergence of hub-and-spoke strategies in the airline sector have led to the rise of a set of \nurban areas that serve as interconnection points between different regions (Bowen, 2002; \nDerudder et al., 2007). As a consequence, there is a continuous shift towards a more \npolycentric organisation of airline passenger networks away from the traditional \norientation on major cities. This implies that a number of secondary cities is rapidly \ngaining prominence in this new polycentric structure because of their role as transfer \npoints rather than as origins and\/or destinations in their own right, and the way in which \nairline statistics are commonly recorded tends to give disproportionate weight to such \ncities in GCN analyses.  \n \nAn example of this first data problem can be observed in Keeling (1995), in which the \nmapping of the GCN is derived from an analysis of the dominant linkages in the global \nairline network. This map was created from a matrix of scheduled air services between \n266 cities based on OAG data. However, this implies that only non-stop and scheduled \ndirect flights between two cities were taken into account. As a consequence, the measures \nused by Keeling are not necessarily a reflection of actual inter-city relations. That is, such \nan analysis is likely to overstate the relational importance of cities that function as airline \nhubs, such as Amsterdam (KLM) and Frankfurt (Lufthansa), at the expense of cities such \n 6 \nas Brussels and Berlin. Furthermore, direct links between, say, Brussels and Rio de \nJaneiro cannot be measured, as passengers are likely to go through São Paulo to make this \ntrip.  \n \n• The second problem: state-centrism in data  \n \nThe second obstacle to translating air transport statistics into GCN analyses arises \nbecause some of these data sources have incorporated a subtle form of state-centrism. \nDespite their global aspirations, most analyses are based on databases that contain \ninformation on international flows. This bias towards inter-state rather than trans-state \nflows tends to undervalue relations between cities that are situated in large and\/or densely \npopulated countries. Rimmer (1998, p. 460), for instance, has based his GCN analysis on \ndata on ‘international passengers’. This results in a downgrading of US world cities in \nparticular because important connections such as Los Angeles–New York and Chicago–\nNew York are not incorporated in this approach. As a consequence, Chicago only appears \non one of Rimmer’s maps as a ‘fourth-level’ link to Toronto, while Dublin appears on all \nmaps because of its ‘first-level’ link with London. Of course, nobody would argue that \nDublin is more important than Chicago as a global city; it only appears to be this way \nwhen one relies on international rather than transnational data. Another example can be \nfound in Smith and Timberlake (2002, p. 123), who report a lack of information on the \nvolume of air passenger traffic between Hong Kong and London. This admittedly \nimportant inter-city link did not feature in pre-1997 databases of the ICAO because \nflights between London and Hong Kong were considered to be ‘national’. While the \nclassification of the London–Hong Kong route and the downgrading of US cities are \nextreme examples, they clearly reveal how data on international passenger flows may \nhamper a GCN analysis\n2\n.  \n \n• The third problem: general flow patterns \n \nThe third obstacle to the straightforward use of standard air transport statistics arises from \nthe fact that such data source feature general flow patterns. Since airline statistics are \nunable to differentiate between specific flows within air passenger transport (i.e. the \npurpose of a passenger’s travels), it is doubtful that air transport flows that are relevant in \nthe context of the GCN can straightforwardly be deduced from such general data. A key \nexample is the inclusion of major tourist destinations in previous analyses. For instance, \nin his mapping of the European urban system based on air passenger flows, Kunzmann \n(1998, p. 49) lists 14 airports that are secondary to the big three (London, Paris, and \nFrankfurt), including Munich, Milan, Madrid, and Palma de Mallorca. However, the high \nranking of the latter merely reflects its role as one of the most popular holiday \ndestinations in Europe; nobody would argue that it is a major global city (however \nconceived). While it is likely that most researchers would agree that destinations such as \nPalma de Mallorca should be omitted from the analysis, such data manipulation becomes \nincreasingly difficult when non-global city processes intersect with global city-formation \n                                                \n2\n Smith and Timberlake (2002) were able to overcome the London–Hong Kong problem by estimating the \nimportance of this link. The relegation of US cities was dealt with by the use of an additional data source \nthat contained information on major routes in the US (namely, data provided by the Air Transport \nAssociation in Washington DC). While circumventing the most obvious gaps in the initial database has \nproduced one of the most refined databases used to date, in general, this problem continues to affect the \nmajor Canadian, Chinese, and Brazilian cities (among others).  \n \n 7 \n(however conceived). The rising importance of Miami in airline networks, for instance, \ncan in part be traced back to its rise as control centre vis-à-vis the Carribean (Grosfoguel, \n1995; Nijman, 1996; Brown et al., 2002). However, it is obvious that in the main it has \nbeen Miami’s function as a retirement centre and major holiday destination that has \nfuelled its increasing connectivity in worldwide air transport connections. Since none of \nthe commonly employed airline statistics are able to distinguish between tourist and \nbusiness flows, there have been no clear procedures for estimating the amount of GCN-\nrelated traffic in overall air travel. \n \nHaving said this, it should be stressed that the ‘problem’ of the inclusion of tourism flows \nis not as straightforward as suggested here. For instance, it is clear that cities such as New \nYork, London, Los Angeles, and Tokyo have become major tourist attractions in their \nown right. However, in his initial formulation of ‘The World City Hypothesis’, John \nFriedmann (1986, p. 74) maintained that the major driving forces behind world city \nformation were found in a limited number of rapidly expanding sectors. Although \nFriedmann identified world cities as major tourist destinations, it seems that tourism is \nmerely an ancillary function, since “[m]ajor importance attaches to corporate \nheadquarters, international finance, global transport and communications; and high level \nbusiness services, such as advertising, accounting, insurance, and legal servcices. An \nancillary function of world cities is ideological penetration and control. New York and \nLos Angeles, London and Paris, and to a lesser degree Tokyo are centres for the \nproduction and dissemination of information, news, entertainment and other cultural \nartefacts.” In other words: it is clear that major world cities are major tourist destinations, \nbut this is a secondary function at best in conceptual terms.  \n \n 8\nIV. Towards some solutions  \n \nIn the previous section, we have argued that the key advantage of air transport-based studies (i.e. \ntheir focus on tangible inter-city flows) is downplayed because standard air transport statistics \nare collectively plagued by three deficiencies, i.e. (i) the lack of origin-destination data, (ii) the \nstate-centric nature of the most important airline statistics, and (iii) the intersection with non-\nGCN processes. In this section, we show how future research may overcome these problems by \nmaking use of alternative datasets, combined with some specific manipulations of these data. We \nwill show how the first two problems can be tackled by using a so-called Marketing Information \nData Transfer (MIDT) database, while the third problem can be addressed – at least for Europe – \nby drawing on a dataset of the Association of European Airlines (AEA) which distinguishes \nbetween different travel classes. \n \nIV.1 MIDT data \n \nOur first alternative data source comprises a unique data set (for social science research) that \nprovides information on individual passenger flows in 2001. This MIDT database is described in \ndetail in Derudder and Witlox (2005) and Derudder et al. (2007), and reference should be made \nto these publications for further details. Here we produce a summary so that our line of reasoning \ncan be followed. The MIDT database contains information on bookings made through so-called \nGlobal Distribution Systems (GDS) such as Galileo, Sabre, Worldspan, Topas, Infini, Abaccus \nand Amadeus (Shepherd Business Intelligence, 2005). GDS are electronic platforms used by \ntravel agencies to manage airline bookings (i.e. the selling of seats on flights offered by different \nairlines), hotel reservations, and car rentals. Using a GDS-based database therefore implies that \nbookings made directly with an airline are often excluded from the system and therefore the data. \nHowever, in 1999, just two years prior to our data, 80% of all reservations continued to be made \nthrough GDS (Miller, 1999). Thus, although our information source may give a slightly biased \npicture of airline connections, there is no reason to assume that the overall pattern of reservations \nmade by direct bookings differs fundamentally from that for reservations made through a GDS. \n \nUsing this MIDT database instead of standard data sources has two advantages in the context of \nGCN research. First, as the MIDT-database contains real origin\/destination information, the \noverrating of the connectivity of airline hubs and first-tier global cities is minimized, which \nallows assessing flows between cities in the lower rungs of the GCN in more detail. Second, the \nMIDT-based database does not distinguish between national and international flows, and can \ntherefore be used to construct a truly transnational inter-city matrix. The New York–Chicago link \nis appropriately treated in the same way as the New York–Toronto link, which further reduces \nthe underestimation of second-tier cities in large and\/or densely populated countries. \n \nThrough our cooperation with an airline, we were able to obtain a MIDT database that covers the \nperiod January-August 2001, and contains information on more than 500 million passenger \nmovements. This database was used to construct an inter-city matrix detailing the total volume of \npassenger flows between cities. To achieve this, we first relabelled the airport codes as city \ncodes. This was necessary to compute meaningful inter-city measures, because a number of \ncities have more than one major airport\n3\n. The particular airport used by a passenger is not \nimportant in this context because, for the measurement of the London-New York relation, it is \n                                                \n3\n It is, however, very difficult to devise a precise criterion for grouping different airports into a single ‘city’. \nNewark’s airport for instance, clearly serves as a major gateway for New York City, but things are not always clear-\ncut. In our research, we focused on the morphological characteristics of metropolitan areas and the way in which \nairports market themselves.   \n 9\nirrelevant whether one flies from Heathrow to JFK or from Gatwick to Newark. Having summed \nthe directional information into a single measurement detailing the total volume of passengers, \nwe created an inter-city matrix that focuses on the most important cities in the global economy. \nOur selection of cities is based on the global city list compiled by the Globalization and World \nCities (GaWC) group and network. GaWC’s selection of cities was somewhat arbitrary in that it \nwas loosely based upon previous GaWC experience in researching global office networks of \nproducer service firms. Capital cities of all but the smallest states were included plus many other \nimportant cities in larger states. A total of 315 cities were selected, the full list is available at \nhttp:\/\/www.lboro.ac.uk\/gawc\/datasets\/da11_2.html. In our data, 9 of the initial 315 cities were \nexcluded because they had no airport (e.g. Bonn and Kawasaki) or because the airport was not \nserviced in the period under consideration because of political instability (e.g. Kabul). This \nreconfiguration produced a 306 × 306 matrix that quantifies the passenger flows between \nimportant cities in the global economy. Table 2 and Figure 1 present an overview of the most \nimportant cities and their connections. Table 2 features the 20 most important inter-city relations \nin the dataset. Figure 1 depicts the connections between the 30 most important cities in terms of \ntotal passenger flows. The size of the nodes varies with the total number of incoming or outgoing \npassengers; the size of the edges varies with the number of passengers flying between two cities. \nFor reasons of clarity, only the most important links are shown.  \n \nTable 2 about here \nFigure 1 about here \nWith the problems discussed in the previous section used as a checklist, the MIDT-based matrix \nmay be able to overcome two of the obstacles. To illustrate this, Table 3 presents a comparison \nof the 20 most connected cities in the airline network as identified in Smith and Timberlake \n(2001, 2002) and in the MIDT-database. It is important to stress that this comparison is only \nmade for illustrative purposes: the list of ‘most important cities’ in Smith and Timberlake (2001, \n2002) is constructed on the basis of a fully fledged centrality analysis, while the MIDT-list \nmerely reflects a ranking based on the total number of passengers boarding on\/off. Furthermore, \nthe data in Smith and Timberlake (2001, 2002) refer to passenger flows in the year 1997, while \nthe MIDT data feature statistics for the year 2001. As a consequence, the reader should bear in \nmind that we merely contrast both lists to point to some data-induced differences. First, because \nthe MIDT-database contains origin\/destination information, the overrating of the connectivity of \nairline hubs and first-tier world cities is minimized, which allows assessing the relational patterns \nin the lower rungs of the WCN in more detail (e.g. the downsizing of the importance of hub \ncities such as Amsterdam and Frankfurt in Table 3). Second, the MIDT-based database does not \ndistinguish between national and international flows, and can therefore be thought of as a \ntransnational dataset. The New York–Chicago link is appropriately treated in the same way as \nthe New York–Toronto link, which further reduces the underestimation of second-tier cities in \nlarge and\/or significant nation-states (e.g. there are 9 US cities in the top-20 for the MIDT-data, \nwhile only 5 US cities feature in Smith and Timberlake (2001, 2002), mainly at the expense of \nSoutheast Asian cities).  \nTable 3 about here \n \nIV.2 AEA data \n \nThe main problem with the MIDT dataset is that it remains largely impossible to discern GCN-\nrelated flows from other flows. The importance of the New York–Miami route and particularly \nthe New York–Las Vegas route in an overview of the most important North American inter-city \n 10\nlinks, for instance, suggests the importance of non-GCN links in the data (Table 4). Flows related \nto obvious holiday destinations such as Palma de Mallorca and Cancun can easily be deleted \nfrom the database, but this manipulation only works for airports that are obviously not related to \nglobal cities\n4\n.  \n \nTable 4 about here \n \nTo counter this problem, one may draw upon data such as that provided by the Association of \nEuropean Airlines (AEA) to unveil the basic spatiality of the GCN (albeit in this particular case \nonly within Europe). The AEA is a non-profit-making organisation that brings together 31 major \nEuropean airlines. The organisation represents its member airlines in dialogue with all the \nrelevant European and international organisations in the aviation value chain, thus ensuring the \nsustainable growth of the European airline industry in a global context. The AEA gathers travel \ndata among its member airlines, and brings this information together in a database that allows \nassessing the geography of airline networks serviced by major European airlines on a monthly \nbasis. For each connection, the database features information on carrier, origin and destination \n(airport, city, country and region), and the total volume of passengers, freight and mail. The AEA \ndatabase seems very suitable for research on GCNs because the information on passenger \nvolumes distinguishes between economy class and business class bookings. As a consequence, \nthe data allow for an exclusive focus on the geography of business class travel (which will very \nlikely be a better measure of GCN connectivity) and an assessment of the way in which this \ngeography differs from that produced by ‘ordinary’ air passenger flows\n5\n.  \n \nThrough the cooperation of one the member airlines of the AEA, we obtained this dataset for the \nperiod January 2002 – December 2005. The database includes flights within Europe as well as \nflights between Europe and other regions. For our purposes, only flights where both origin and \ndestination are European cities were retained. Furthermore, since our interest is primarily in \nflows between cities, we converted the airport-to-airport-by-carrier database into a squared city-\nto-city database by aggregating, for each booking class, the number of passengers for all the \nairports of a given city, and for all the carriers of a given city-pair. The end result, then, is a non-\ndirectional connectivity matrix for each type of booking class\n6\n.  \n \nThe most important problem with this and other similar datasets is the disparities in business \nclass bookings because of different strategies pursued by ‘national carriers’. This bias relates to \nthe fact that most airports are (still) dominated by one or two carriers, which may or may not \nhave a specific approach towards business class travel. Some carriers, for instance, have recently \nchosen to remove business class from some of their short\/medium haul routes (e.g. KLM and \nBrussels Airlines). On these routes, the seats are the same for all passengers, only the flexibility \nof the ticket and the food and beverage service differs. On the other side of the spectrum, some \ncarriers have a relatively important business class component because they serve specific \n                                                \n4\n Another, more generic problem is that airline data cannot avoid undervaluing a second-tier city that is close to a \nmajor world city. For example, a passenger travelling from Rotterdam to New York is likely to depart from \nAmsterdam because of (i) the short distance between Rotterdam and Amsterdam (less than 50 miles) and (ii) the \nimportance of Amsterdam’s Schiphol airport.  \n \n5\n The AEA dataset equally includes information on first class passengers. However, the absolute volume of these \nflows is very small for intra-European flights, and furthermore restricted to a selected number of carriers. We have \ntherefore chosen to add these flows to the business class category. \n \n6\n Once again, a further data manipulation involved the removal of obvious holiday centres such as Palma de \nMallorca from the data through the application of GaWC’s global city list. \n 11\nmarkets (e.g. carriers flying to London City Airport) and\/or because of historic reasons. The \nlatter is the case for travel to\/from Scandinavian cities. SAS, the dominant regional carrier in \nScandinavia, was the first European airline to introduce business class, and this is still reflected \nin a high proportion of business class seats on their flights. The net effect of this bias is that \nbusiness class bookings for, say, Copenhagen and Stockholm will be somewhat overvalued when \ncompared to, say, Brussels and Amsterdam, while the connectivity of cities that are located near \nother important business centres will be somewhat undervalued because business travellers can \nchoose between different means of travelling.  \n \nOne further aspect of this dataset requires explicit interrogation, i.e. the crucial issue whether \nbusiness class bookings actually capture the spatiality of business travel (and therefore GCN \nflows). After all, business travellers do not necessarily travel in business class, while (ostensibly \nrich) tourists may well travel in business class because of enhanced comfort. Thus the \nimportance of, say, New York’s GCN flows may well be overestimated because of rich leisure \ntravellers, while business flows to some short-haul destinations may well be underestimated \nbecause business travellers may opt not to travel in business class because of the short travel \ntime. The crucial question, therefore, is whether measures of business class travel provide us \nwith satisfactory proxies for assessments of business-related travel? At one level distortions are \nclearly present, but the crucial question here is whether the ensuing biases are so strong that they \ntotally undermine an analysis of business travel on the basis of business class bookings.  \n \nTo address this issue, we discuss two basic features of the AEA-dataset for the year 2005, which \njointly suggest that data on business class travel does indeed allow an actual assessment of \nbusiness travel. First, there seems to be a straightforward difference in seasonal intensity for both \ntypes of booking classes. Figure 2 gives an overview of the monthly fluctuations in air travel in \n2005 for the entire AEA-database for both booking classes. The monthly variations in \nconnectivity are gauged through z-scores so that inter-booking class comparisons are possible in \nspite of different passenger volumes\n7\n. The seasonality of air travel is obviously different for \neconomy and business class bookings. The economy class curve increases from January to \nJuly\/August, and then decreases again towards the end of the year. The business class curve, in \ncontrast, reaches its lowest levels in major holiday periods (July\/August and December\/January). \nThe major point here is that the contrasting curves in Figure 2 suggest that, in general, air travel \nin business class captures business travel.  \n \nFigure 2 about here \n \nSecond, the relative proportion of business class travel is higher for clear-cut ‘business cities’ \nsuch as Geneva and Düsseldorf. Table 5 contains two rankings of European cities according to \ntheir connectivity in the European airline network. The first ranking focuses on the absolute \nimportance of business class travel, the second ranking focuses on the relative proportion of \nbusiness class travel within a city’s overall passenger volume. When taking on board that (i) the \nproportion of business class travellers to\/from Scandinavian cities is higher because of the \nhistorical legacy of SAS’s corporate strategies, and that (ii) the proportion of business class \n                                                \n7 In statistics, the z-score or standard score is a dimensionless quantity derived by subtracting the population mean \nfrom an individual raw score and then dividing the difference by the population standard deviation. The resulting z-\nscore indicates how many standard deviations an observation is above or below the mean. It allows comparison of \nobservations from different normal distributions, in this case between economy class and business class flows.  \n \n 12\ntravel to\/from cities such as London, Paris, Frankfurt and Amsterdam is somewhat relegated \nbecause of their function as gateways for rerouting international air travel (Derudder et al., \n2007), it becomes clear that business centres do in effect have a higher proportion of business \nclass travel. Once again, this seems to validate our claim that business class travel does indeed \nmeasure business travel.  \n \nTable 5 about here \n \nTo conclude this section, we extend the basic rankings in table 5 by focusing on one further \naspect of the geography of business travel. First, rather than restricting the discussion to the \nabsolute and relative dimensions of business travel on a city-by-city basis, we can assess the \nactual spatiality of business flows between cities. To this end, Figure 3 depicts the most \nimportant business travel links in 2005 between the 25 most important European cities in terms \nof total volume of business passengers. Once again, the size of the nodes varies with the total \nnumber of incoming or outgoing passengers, while the size of the edges varies with the number \nof business passengers flying between two cities. For reasons of clarity, only the most important \nlinks are shown (> 50,000 passengers). In addition to a cohesive business network centred on \nStockholm, Oslo and Copenhagen, it is clear that business travel to\/from Frankfurt, London, \nParis and Amsterdam is dominant. These cities are highly interrelated, while most business travel \nfrom\/to other major cities is also primarily orientated towards these cities (e.g., each city has \nwell-connected business class flows to London. Table 6, in turn, looks at the spatiality of the \nrelative importance of business travel to\/from the most important business centres in 2005 \n(London, Paris, Frankfurt and Amsterdam). The table summarizes the results of a least squares \nregression on the logarithms of the volume of economy and business class passengers to\/from \neach of these cities\n8\n, and lists all cities with a standardized residual with an absolute value larger \nthan 1: large negative residuals indicate that a city has less business class travellers than expected \non the basis of the number of economy class passengers, positive residuals point to relatively \nstrong business class connections to London, Paris, Frankfurt, and Amsterdam. Overall, the table \nreveals that cities with large positive residuals are primarily business centres (e.g. Frankfurt and \nZurich), while cities with negative residuals are cities that also have an important tourism \ncomponent to them (e.g. Rome and Barcelona)\n9\n.  \n \nTable 1 about here \nFigure 3 about here \n \n \n \n                                                \n8\n The logarithms were used to tackle the heteroscedasticity in the data. \n  \n9 Obviously, the latter cities are also business centres in that they are also highly connected in business class flows \n(see Figure 3), but the point here is that their business class component is coupled with major tourism flows, which \nreinforces our suggestion that data on business class travel can actually be used to assess the geography of business \ntravel. \n \n 13\nV. Conclusion \n \nThe gist of our argument has been that although statistics of international air transport flows are \npotentially a prime data source in empirical studies of GCNs, previous such studies have not \nbeen able to live up to their potential. This is because the conventional airline statistics provided \nby IATA, OAG, ICAO,… result in less-than-perfect inter-city matrices for further analysis. We \nidentified three systematic data problems in this context, and used this as a starting point for \nexploring alternative datasets. We discussed two such alternatives (MIDT and AEA), which \njointly open up possibilities for future research along these lines. However, this paper merely \nengaged in a straightforward overview of some of the major patterns in the data. In the short run, \nthis leaves us with three major avenues for further research.  \n \nFirst, there is the question of how both data sources may inform one another. One obvious \nproblem is that both datasets offer partial solutions (the MIDT data featuring general flow data, \nand the AEA data featuring the individual legs of a trip): it is only through their collective \napplication that we can take full advantage of their potential. Leaving aside the obvious problem \nthat the AEA dataset only contains information on European carriers (similar ‘regional’ datasets \nwill be necessary for a global analysis), this will take the form of a normalization of MIDT data \nbased on the proportion of business travel for particular cities\/connections in the AEA data. \nSecond, there is the actual analysis of the data. One possibility is to analyse the data along the \nlines suggested by Shin and Timberlake (2001). This involves a two-step analysis, i.e. (i) an \noverarching analysis of the overall connectivity of key cities and (ii) a detailed geographical \ndissection of this connectivity through the application of standard network analytical tools, such \nas clique and block analyses. Third, and this is perhaps the most important point, there is the \nobvious need for conceptually grounding this kind of empirical research. For one thing, our \nairline data review has shown that such information requires a great deal of assumptions to be \nused in the interpretation of the geography and functionality of business travel flows. \nConsequently, whilst data providing a general overview of the major patterns and trends in \nbusiness travel is undoubtedly helpful, it is clear that a more nuanced and sophisticated \nunderstanding emerging from more qualitative approaches to the study of inter-city business \ntravel is necessary (Faulconbridge et al., 2008). \n 14\nVI. Acknowledgements \n \nWe would like to thank two anonymous reviewers for their helpful and constructive comments \non an earlier version of this paper. \n \n 15\nVII. References \n \nAlderson, A.S. & Beckfield, J. (2004). Power and position in the world city system. American \nJournal of Sociology, 109, 811-851 \n \nAlderson, A.S. & Beckfield, J. (2007). Globalization and the world city system. Preliminary \nresults from a longitudinal data set. (In P. J. Taylor, B. Derudder, P. Saey & F. Witlox (Eds.), \nCities in Globalization: Practices, Policies, Theories (pp. 21-36). London: Routledge.) \n \nAmiel, M., Melançon, G. & Rozenblat, C. (2005). Réseaux multi-niveaux: l'exemple des \néchanges aériens mondiaux de passagers. M@ppemonde, 79. Retrieved on 12\/02\/2007 from \nhttp:\/\/mappemonde.mgm.fr\/num7\/articles\/art05302.html \n \nBeaverstock, J.V., Smith, R.G. & Taylor, P.J. (2000a). World city network: a new \nmetageography? Annals of the Association of American Geographers, 90, 123-134 \n \nBeaverstock, J.V., Smith, R.G., Taylor, P.J., Walker, D.R.F. & Lorimer, H. (2000b). \nGlobalization and world cities: some measurement methodologies. Applied Geography, 20, 43-\n63 \n \nBlack, W.R. (2003). Transportation: A Geographical Analysis. (New York: Guilford Press) \n \nBowen, J. (2002). Network change, deregulation, and access in the global airline industry. \nEconomic Geography, 78, 425-440 \n \nBrown, E., Catalano, G. & Taylor, P.J. (2002). Beyond world cities. Central America in a global \nspace of flows. Area, 34, 139-148 \n \nCastells, M. (1996). The Rise of the Network Society. The information Age: Economy, Society \nand Culture, Volume 1. (Oxford: Blackwell) \n \nCastells, M. (2001). The Rise of the Network Society. The information Age: Economy, Society \nand Culture, Volume 1 (2\nnd\n Edition). (Oxford: Blackwell) \n \nCattan, N. (1995). Attractivity and internationalisation of major European cities: the example of \nair traffic. Urban Studies, 32, 303–312 \n \nCattan N. (2004). Le monde au prisme des réseaux aériens. Flux, 58, 32-43 \n \nDerudder, B. (2006). On conceptual confusion in empirical analyses of a transnational urban \nnetwork. Urban Studies, 43, 2027-2046 \n \nDerudder, B., Taylor, P.J., Witlox, F. & Catalano, G. (2003). Hierarchical tendencies and \nregional patterns in the world city network: A global urban analysis of 234 cities. Regional \nStudies, 37, 875-886 \n \nDerudder, B. & Taylor, P.J. (2005). The cliquishness of world cities. Global Networks, 5, 71-91 \n \nDerudder, B., & Witlox, F. (2005). An Appraisal of the Use of Airline Data in Assessing the \nWorld City Network: a Research Note on Data. Urban Studies, 42, 2371-2388 \n 16\nDerudder, B., Devriendt, L. & Witlox, F. (2007). Flying where you don’t want to go: an \nempirical analysis of hubs in the global airline network. Tijdschrift voor Economische en \nSociale Geografie, 98, 307-324 \n \nDicken, P. (2007). Global Shift: Mapping and Changing the Contours of the World Economy (5\nth\n \nEdition). (New York: Guilford)  \n \nDucruet, C. & Lee, S.W. (2006). Frontline soldiers of globalisation: port-city evolution and \nregional competition. Geojournal, 67, 107-122 \n \nDupuy, G. (2004). Internet: une approche géographique à l'échelle mondiale. Flux, 58, 5-19 \n \nFaulconbridge, J.R., Beaverstock, J.V., Derudder, B. & Witlox, F. (2008) Corporate ecologies of \ninternational business travel: examples from professional service firms. Manuscript under \nreview, available from authors. \n \nFriedmann, J. (1986). The world city hypothesis. Development and Change, 17, 69–83 \n \nFriedmann, J. & Wolff, G. (1982). World city formation: an agenda for research and action. \nInternational Journal of Urban and Regional Research, 6, 309–344 \n  \nGrosfoguel, R. (1995). Global logics in the Caribbean city system: the case of Miami. (In P.L. \nKnox & P.J. Taylor (Eds.), World Cities in a World-System (pp. 156-170). Cambridge: \nCambridge University Press.) \n \nKeeling, D.J. (1995). Transport and the world city paradigm. (In P.L. Knox & P.J. Taylor (Eds.), \nWorld Cities in a World-System (pp. 115-131). Cambridge: Cambridge University Press.) \n \nKeeling, D.J. (2007). Transportation geography: new directions on well-worn trails. Progress in \nHuman Geography, 31, 217–225 \n \nKnox, P.L. (1998). Globalization and world city formation. (In S.G.E. Gravesteijn (Ed.), Timing \nGlobal Cities (pp.21-31). Utrecht: Netherlands Geographical Studies.) \n \nKunzmann, K.R. (1998). World city regions in Europe: structural change and future challenges. \n(In F.C. Lo & Y.M. Yeung (Eds.), Globalization and the World of Large Cities (pp.37-75). \nTokyo: United Nations University Press.). \n \nMalecki, E. (2002). The economic geography of the Internet’s infrastructure. Economic \nGeography, 78, 399-424 \n \nMarcuse, P. & Van Kempen, R. (Eds.) (2000). Globalizing Cities: a New Spatial Order? \n(Oxford: Blackwell) \n \nMatsumoto, H. (2004). International urban systems and air passenger and cargo flows: some \ncalculations. Journal of Air Transport Management, 10, 241–249 \n \nMatsumoto, H. (2007). International air network structures and air traffic density of world cities. \nTransportation Research Part E: Logistics and Transportation Review, 43, 269-282 \n \n 17\nNijman, J. (1997). Globalization to a Latin beat: the Miami growth machine. Annals of the \nAmerican Academy of Political and Social Sciences, 551, 163-176 \n \nO'Connor, K. (2003). Global air travel: toward concentration or dispersal? Journal of Transport \nGeography, 11, 83-92 \n \nRimmer, P.J. (1998). Transport and telecommunications among world cities. (In F.C. Lo & Y.M. \nYeung (Eds.), Globalization and the World of Large Cities (pp. 433-470). Tokyo: United \nNations University Press.)  \n \nRobinson, J. (2002). Global and world cities: a view from off the map. International Journal of \nUrban and Regional Research, 26, 531-554 \n \nRobinson, J. (2005). Urban geography: world cities, or a world of cities. Progress in Human \nGeography, 29, 757-765 \n \nRodrigue, J.P., Comtois, C. & Slack, B. (2006). The Geography of Transport Systems. (New \nYork: Routledge) \n \nRozenblat, C. & Pumain, D. (2007). Firm linkages, innovation and the evolution of urban \nsystems. (In P.J. Taylor, B. Derudder, P. Saey & F. Witlox (Eds.), Cities in Globalization: \nPractices, Policies, Theories (pp. 130-156). London: Routledge.) \n \nRutherford, J., Gillespie, A. & Richardson, R. (2004). The territoriality of pan-European \ntelecommunications backbone networks. Journal of Urban Technology, 11 (3), 1-34 \n \nSassen, S. (1991). The Global City: New York, London, Tokyo. (Princeton: Princeton University \nPress) \n \nSassen, S. (2001). The Global City: New York, London, Tokyo (2\nnd\n Edition). (Princeton: \nPrinceton University Press) \n \nSheller, M. & Urry, J. (2006). The new mobilities paradigm. Environment and Planning A, 38, \n207–226 \n \nShort, J.R., Kim, Y., Kuss, M. & Wells, H. (1996). The dirty little secret of world city research. \nInternational Journal of Regional and Urban Research, 20, 697–717 \n \nShin, K.H. & Timberlake, M. (2000). World cities in Asia: cliques, centrality and connectedness. \nUrban Studies, 37, 2257–2285 \n \nSmith, D.A. & Timberlake, M. (2001). World city networks and hierarchies 1979–1999: An \nempirical analysis of global air travel links. American Behavioral Scientist, 44, 1656–1677 \n \nSmith, D.A & Timberlake, M. (2002). Hierarchies of dominance among world cities: a network \napproach. (In S. Sassen (Ed.), Global Networks, Linked Cities (pp. 117-141). London: \nRoutledge.)  \n \nTaylor, P.J. (2001). Specification of the world city network. Geographical Analysis, 33, 181-194 \n \n 18\nTaylor, P.J. (2004a). World City Network: A Global Urban Analysis. (London: Routledge) \n \nTaylor, P.J. (2004b). New political geographies: Global civil society and global governance \nthrough world city networks. Political Geography, 24, 703-730 \nTaylor, P.J., Catalano, G. & Walker, D.R.F. (2002a). Measurement of the world city network. \nUrban Studies, 39, 2367-2376 \n \nTaylor, P.J., Catalano, G. & Walker, D.R.F. (2002b). Exploratory analysis of the world city \nnetwork. Urban Studies, 39, 2377-2394 \n \nTaylor, P.J., Derudder, B., Saey, P. & Witlox, F. (Eds.) (2007). Cities in Globalization: \nPractices, Policies, Theories. (London: Routledge) \n \nTownsend, A.M. (2001a). Network cities and the global structure of the Internet. American \nBehavioral Scientist, 44, 1697-1716 \n \nTownsend, A.M. (2001b). The Internet and the rise of the new network cities (1969-1999). \nEnvironment and Planning B, 28, 39-58 \n         \nZook, M. & Brunn, S. (2005). Hierarchies, regions and legacies: European cities and global \ncommercial passenger air travel. Journal of Contemporary European Studies, 13, 203-220 \n \n"}