{"doi":"10.1109\/TSP.2005.849209","coreId":"53496","oai":"oai:eprints.lincoln.ac.uk:3070","identifiers":["oai:eprints.lincoln.ac.uk:3070","10.1109\/TSP.2005.849209"],"title":"Optimal design of nonuniform FIR transmultiplexer using semi-infinite programming","authors":["Ho, C. Y.-F.","Ling, Wing-Kuen","Liu, Yan-Qun","Tam, P. K. S.","Teo, Kok-Lay"],"enrichments":{"references":[{"id":809260,"title":"A dual approach to continuous-time envelope-constrained filter design via orthonormal filters,”","authors":[],"date":"1999","doi":"10.1109\/81.788806","raw":"C. H. Tseng, K. L. Teo, Z. Zang and A. Cantoni, “A dual approach to continuous-time envelope-constrained filter design via orthonormal filters,” IEEE Transactions on Circuits and SystemsI: Fundamental Theory and Applications, vol. 46, no. 9, pp. 1042-1054, 1999.","cites":null},{"id":809479,"title":"A unified approach for the design of 2-D digital filters via semidefinite programming,”","authors":[],"date":"2002","doi":"10.1109\/TCSI.2002.1010036","raw":"W.  S.  Lu, “A  unified  approach for  the  design of 2-D digital filters via semidefinite programming,” IEEE Transactions on Circuits and SystemsI: Fundamental Theory and Applications, vol. 49, no. 6, pp. 814-826, 2002. > Paper ID: T-SP-02047-2004.R2<","cites":null},{"id":808755,"title":"Design of multichannel nonuniform transmultiplexers using general building blocks,”","authors":[],"date":"2001","doi":"10.1109\/78.890348","raw":"T. Liu, and T. Chen, “Design of multichannel nonuniform transmultiplexers using general building blocks,” IEEE Transactions on Signal Processing, vol. 49, no. 1, pp. 91-99, 2001.","cites":null},{"id":809025,"title":"Global optimization in quadratic semi-infinite programming,”","authors":[],"date":"2001","doi":"10.1007\/s10898-004-8278-8","raw":"Y. Liu, K.L. Teo and S. Ito, “Global optimization in quadratic semi-infinite programming,” Computing, vol. 15, pp. 119-132, 2001.","cites":null},{"id":808973,"title":"Non-uniform multirate filter banks: theory and design,”","authors":[],"date":"1989","doi":"10.1109\/iscas.1989.100368","raw":"P. Q. Hoang, and P. P. Vaidyanathan, “Non-uniform multirate filter banks: theory and design,” IEEE International Symposium on Circuits and Systems, ISCAS, vol. 1, pp. 371-374, 1989.","cites":null},{"id":808698,"title":"Some results in the theory of crosstalk-free transmultiplexers,”","authors":[],"date":"1991","doi":"10.1109\/78.91174","raw":"R. D. Koilpillai, T. Q. Nguyen, and P. P. Vaidyanathan, “Some results in the theory of crosstalk-free transmultiplexers,” IEEE Transactions on Signal Processing, vol. 39, no. 10, pp. 2174-2183, 1991.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005","abstract":"This paper considers an optimum nonuniform FIR transmultiplexer design problem subject to specifications in the frequency domain. Our objective is to minimize the sum of the ripple energy for all the individual filters, subject to the specifications on amplitude and aliasing distortions, and to the passband and stopband specifications for the individual filters. This optimum nonuniform transmultiplexer design problem can be formulated as a quadratic semi-infinite programming problem. The dual parametrization algorithm is extended to this nonuniform transmultiplexer design problem. If the lengths of the filters are sufficiently long and the set of decimation integers is compatible, then a solution exists. Since the problem is formulated as a convex problem, if a solution exists, then the solution obtained is unique and the local solution is a global minimum","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/53496.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/3070\/1\/letter_optim_transmultiplexer.pdf","pdfHashValue":"616a392341d9fcd2e4bd0504c41ac7aa1ac00d4c","publisher":"IEEE","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:3070<\/identifier><datestamp>\n      2013-03-13T08:43:27Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48363130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/3070\/<\/dc:relation><dc:title>\n        Optimal design of nonuniform FIR transmultiplexer using semi-infinite programming<\/dc:title><dc:creator>\n        Ho, C. Y.-F.<\/dc:creator><dc:creator>\n        Ling, Wing-Kuen<\/dc:creator><dc:creator>\n        Liu, Yan-Qun<\/dc:creator><dc:creator>\n        Tam, P. K. S.<\/dc:creator><dc:creator>\n        Teo, Kok-Lay<\/dc:creator><dc:subject>\n        H610 Electronic Engineering<\/dc:subject><dc:description>\n        This paper considers an optimum nonuniform FIR transmultiplexer design problem subject to specifications in the frequency domain. Our objective is to minimize the sum of the ripple energy for all the individual filters, subject to the specifications on amplitude and aliasing distortions, and to the passband and stopband specifications for the individual filters. This optimum nonuniform transmultiplexer design problem can be formulated as a quadratic semi-infinite programming problem. The dual parametrization algorithm is extended to this nonuniform transmultiplexer design problem. If the lengths of the filters are sufficiently long and the set of decimation integers is compatible, then a solution exists. Since the problem is formulated as a convex problem, if a solution exists, then the solution obtained is unique and the local solution is a global minimum.<\/dc:description><dc:publisher>\n        IEEE<\/dc:publisher><dc:date>\n        2005<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/3070\/1\/letter_optim_transmultiplexer.pdf<\/dc:identifier><dc:identifier>\n          Ho, C. Y.-F. and Ling, Wing-Kuen and Liu, Yan-Qun and Tam, P. K. S. and Teo, Kok-Lay  (2005) Optimal design of nonuniform FIR transmultiplexer using semi-infinite programming.  IEEE Transactions on Signal Processing, 53  (7).   pp. 2598-2603.  ISSN 1053-587x  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/TSP.2005.849209<\/dc:relation><dc:relation>\n        10.1109\/TSP.2005.849209<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/3070\/","http:\/\/dx.doi.org\/10.1109\/TSP.2005.849209","10.1109\/TSP.2005.849209"],"year":2005,"topics":["H610 Electronic Engineering"],"subject":["Article","PeerReviewed"],"fullText":"> Paper ID: T-SP-02047-2004.R2< \n \n1 \n \nAbstract— This paper considers an optimum nonuniform FIR \ntransmultiplexer design problem subject to specifications in the \nfrequency domain. Our objective is to minimize the sum of the \nripple energy for all the individual filters, subject to the \nspecifications on amplitude and aliasing distortions, and to the \npassband and stopband specifications for the individual filters. \nThis optimum nonuniform transmultiplexer design problem can \nbe formulated as a quadratic semi-infinite programming \nproblem. The dual parametrization algorithm is extended to this \nnonuniform transmultiplexer design problem. If the lengths of the \nfilters are sufficiently long and the set of decimation integers is \ncompatible, then a solution exists. Since the problem is formulated \nas a convex problem, if a solution exists, then the solution obtained \nis unique and the local solution is a global minimum. \n \nIndex Terms— Nonuniform transmultiplexer, semi-infinite \nprogramming, dual parameterization. \nI. INTRODUCTION \nRANSMULTIPLEXERS are important in multimedia signal \nprocessing and communication systems because several \ndata signals can be transmitted through a single channel by \nusing time division multiplexing or frequency division \nmultiplexing techniques [1]. The design of uniform \ntransmultiplexers can be found in [1]. Since the design of \nuniform transmultiplexers can be based on the design of \nuniform filter banks, the existing theory for the design of \nuniform filter banks are adequate and there are many design \n \nManuscript received February 6, 2004; revised May 3, 2004. This work was \nsubstantially supported by a research grant (project number G-YD26) from the \nHong Kong Polytechnic University, the Centre for Multimedia Signal Processing, \nThe Hong Kong Polytechnic University, the CRGC grant (project number PolyU \n5101\\01E) from the Research Grants Council of Hong Kong, as well as a research \ngrant from Australian Research Council. The associate editor coordinating the \nreview of this manuscript and approving it for publication was Dr. Henrique \nMalvar. \nCharlotte Yuk-Fan Ho is with the Department of Electronic Engineering, \nQueen Mary, University of London, Bingo Wing-Kuen Ling is with the \nDepartment of Electronic Engineering, King’s College London, Yan-Qun Liu is \nwith the Department of Mathematics and Statistics, Royal Melbourne Institute of \nTechnology, Peter Kong-Shun Tam is with the Department of Electronic and \nInformation Engineering, and Kok-Lay Teo is with the Department of Applied \nMathematics and Centre for Multimedia Signal Processing, Department of \nElectronic and Information Engineering. (e-mail: wing-kuen.ling@kcl.ac.uk). \nPublisher Item Identifier  \nmethods available for uniform filter banks. So there is no \ndifficulty on the design of uniform transmultiplexers and the \nexisting design methods work very well in many applications. \nSuppose we want to have different bandwidths allocated for \ndifferent applications and these signals are multiplexed \ntogether and transmitted in a single channel. For example, a \nbroader bandwidth is required for the transmission of videos, \nwhile a narrower bandwidth is enough for transmitting texts. \nFor another example, it may be necessary to allocate more \nresources to the more critical transmission applications, such \nas those for the military and medical purposes, and fewer \nresources to the less critical applications, such as those for the \nentertainment. For a further example, resources of the \nbandwidth may be allocated according to the rates that the \nconsumers can afford. All of these circumstances can be solved \nby applying a nonuniform transmultiplexer. Similarly, the \ndesign of nonuniform transmultiplexers can be based on the \ndesign of nonuniform filter banks [2]. However, when the set of \ndecimation integers is incompatible, there will be only one \nnonzero element in at least one row of the aliasing matrix of the \ncorresponding filter bank system. This structural dependency \nand the incompatibility cannot be eliminated by using a set of \nlinear timeinvariant (LTI) filters and a set of simple samplers \n[3]. Hence, nonuniform transmultiplexers suffer from \namplitude, phase, aliasing and crosstalk distortions, and \nperfect reconstruction cannot be achieved [3]. \nSome researchers formulate the nonuniform \ntransmultiplexer design problem as an unconstrained \noptimization problem so that the transmultiplexer is as close as \npossible to an exact perfect reconstruction system [2]. Although \nthe unconstrained optimization problem can be solved easily, \nconstraints are often necessary to be imposed for real practical \nsituations. For example, as noise is often presented in the \ntransmultiplexer, filters with good frequency selectivity are \nrequired and the passband and stopband specifications for the \nindividual filters are commonly imposed. Besides formulating \nthe perfect reconstruction error as a cost function, another \ncommon way is to formulate it as constraints. This is because \nthe cost function may not be convex if the perfect \nreconstruction error is formulated as cost. Moreover, amplitude \nand aliasing distortions may be particularly serious at certain \nOptimal Design of Nonuniform FIR \nTransmultiplexer Using Semi-infinite \nProgramming \nCharlotte Yuk-Fan Ho, Member, IEEE, Bingo Wing-Kuen Ling, Yan-Qun Liu, Peter Kwong-Shun Tam, \nMember, IEEE, Kok-Lay Teo, Senior Member, IEEE \nT \n> Paper ID: T-SP-02047-2004.R2< \n \n2 \nfrequency bands, instead of evenly distributed over the whole \nfrequency spectrum. Hence, by formulating the perfect \nreconstruction distortion as constraints, excessive amplitude \nand aliasing distortions at certain frequency bands can be \navoided. \nSince all the specifications are expressed as continuous \nconstraints in the frequency domain, this optimization problem \nis actually a semi-infinite programming problem. To tackle a \nsemi-infinite programming problem, one way is to \napproximate it as a finite dimensional problem through a \ndiscretization of the index set of the continuous constraints [6]. \nMany existing optimization-based design techniques for filters \nas well as filter banks deal with discretized constraints because \nthe difference between the exact upper bound of a discretized \nconstraint function and that of the corresponding continuous \nconstraint function vanishes as the number of grid points \nincreases. Moreover, since the discretized version of the \nproblem is a standard convex quadratic programming problem, \nthere exists some reliable optimization solvers for solving such \nquadratic programming problems and those existing solvers \nallow the use of several thousand grid points. Typically, when \nthe number of grid points is in the range of 1000-2000, the \nsolution obtained for designing a single filter has practically no \ndifference to the globally optimized solution for the \ncorresponding continuous optimization problem. However, for \na filter bank design problem, since we need to design more than \none filter, the number of grid points involved is more than that \nfor a single filter design problem. The number of grid points for \namplitude and aliasing distortions are also usually more than that \nfor the specifications on the passband and stopband of the filters \nbecause the polynomial orders of the polynomials for the \namplitude and aliasing distortions are much higher than that for \nthe specifications on the passband and stopband of the filters. As \na result, the number of grid points required in the problem is \nusually in the order of magnitude of 10000. In this situation, the \nimplementation cost using the discretization method is very \nhigh and the time required for solving the quadratic \nprogramming problem is very long. Furthermore, since the exact \nminimum number of grid points employed and their exact grid \npositions are not known, and the minimum number of grid \npoints usually corresponds to nonuniform grid positions, which \nthere are no analytical results discussed on this issue. Hence, \nmore than the minimum number of grid points is usually \nemployed. As a result, some of the computation effort is wasted \nand this method is not efficient in this sense. \nIn order to avoid the above difficulties, we propose to solve \nthe problem via the dual parameterization approach, which was \ndeveloped recently in [4] and [5]. This algorithm is proved to \nbe very efficient and effective. In this paper, we apply this \ntechnique to solve an optimum nonuniform transmultiplexer \ndesign problem so that the sum of the ripple energy for all the \nindividual filters are minimized, subject to the specifications on \nthe amplitude and aliasing distortions and to the passband and \nstopband specifications for the individual filters. \nThis paper is organized as follows. In Section II, we give the \nnotations and definitions that appear throughout this paper. In \nSection III, we formulate the nonuniform transmultiplexer \ndesign problem as a quadratic semi-infinite programming \nproblem. In Section IV, a design example is presented. Finally, \nwe summarize and conclude our works in Section V. \nII. NOTATION AND DEFINITIONS \nLet  nxi  and  ny i , for 1,,1,0  Ni  , be, respectively, \nthe input and output signals of the nonuniform \ntransmultiplexer shown in Figure 1. Let \nin  and in , for \n1,,1,0  Ni  , denote, respectively, the downsamplers and \nupsamplers, and let  zH i  and  zFi , for 1,,1,0  Ni  , \nbe, respectively, the filters in the receiver and transmitter. The \nnonuniform transmultiplexer is said to achieve perfect \nreconstruction if  ny i  is a delayed gained version of  nxi , for \n1,,1,0  Ni  , that is,  ic  and Zmi   such that \n   iiii mnxcny  , for 1,,1,0  Ni  , where   and Z  \ndenotes, respectively, the set of real numbers and integers. \nIII. PROBLEM FORMULATION \nTo avoid phase distortions, either symmetric or \nantisymmetric even-tap filters are designed, and the filters in \nthe receiver are expressed as: \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n1\n0\n1, 2\n1cos2)(\ni\ni\nii\nN\nk\nikNi\nDj\ni kaeH \n , \nfor 1,,1,0  Ni  , where iD , i  and iN2 , are respectively, \nthe group delay, phase shift and order of the filter  iH . \n0i  and 2\n\n i  correspond, respectively, to the symmetric \nand antisymmtric cases. Define   ,B , and let the \npassband and stopbands of  iH  be, respectively, denoted by \np\niB  and \ns\niB , for 1,,1,0  Ni  . The coefficients kia ,  \nare to be designed. Let \n TNNNNN aaaaaa N 0,11,10,11,10,01,0 ,,,,,,,,, 110   x , \nwhere the superscript T  denotes the transpose. Define \n  )()(   i\nDj\ni\niie ηξ  , \nwhere \nT\ni\ni\niii\nN\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n\n\n  \n2\n12cos,,\n2\n3cos,\n2\n1cos2)( η , \nfor 1,,1,0  Ni  . Then we have: \nxξH )()(   , \nwhere \n    TNHH  10 ,,)(  H  \nand \n    TNTdiag )(,,)()( 10   ξξξ  . \nAssume the desired frequency responses are: \n> Paper ID: T-SP-02047-2004.R2< \n \n3 \n  id\nii\nj\ndd eAH\n\n )()( , for 1,,1,0  Ni  , \nwhere )(\nid\nA  and  \nid\n are real functions representing the \ndesired amplitude and phase responses. The cost reflecting the \nsum of the ripple energy for all individual filters in the \npassband and stopband of the filters can be expressed as: \n    \n\n\n\n1\n0\n2)(\nN\ni BB\ni\ns\ni\np\ni\ndJ\n\nx , \nwhere \n    dAxηκ )( , \nin which \n    TN  10 ,,)(  κ , \n    TNTdiag )(,,)()( 10   ηηη  , \nand \n    Tdd NAA  10 ,,)(  dA . \nIt can be shown easily that there exist a positive definite matrix \nQ , a vector b  and a constant p  such that \n  pJ TT  xbxQxx\n2\n1 . \nNext, we consider the constraints to be imposed. Let the \nbounds on the passband and stopband ripples of  iH  be, \nrespectively, \nip\n  and \nis\n , for 1,,1,0  Ni  . Then the \nconstraints on the passband and stopband ripples can be \nexpressed as: \nipi\n )( , for piB  and for 1,,1,0  Ni  , \nand \nisi\n )( , for siB  and for 1,,1,0  Ni  . \nIt can be shown easily that the constraints can be expressed as \nfollows: \n)()(  ff cxA  , for \npB0 , \nfor appropriate )(fA  and )(fc . \nIn order to capture the specifications on the amplitude and \naliasing distortions in the design, we swap the transmitter and \nreceiver and obtain a nonuniform filter bank system. If the \ncorresponding nonuniform filter bank system achieves perfect \nreconstruction with the delay of the whole system equal to an \ninteger multiple of N , then the corresponding \ntransmultiplexer achieves perfect reconstruction. Hence, in this \npaper, we formulate the perfect reconstruction problem of the \nnonuniform transmultiplexer as that of the corresponding \nnonuniform filter bank. For the above situation, the \ncorresponding nonuniform transmultiplexer can achieve \nperfect reconstruction. Although the perfect reconstruction \ncondition of a general nonuniform transmultiplexer is not the \nsame as that of the corresponding nonuniform filter bank, and \nactually, we over-constrain the transmultiplexer design \nproblem, this problem formulation can simplify the problem. \nLet \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n1\n0\n1, 2\n1cos2)(\ni\ni\nii\nN\nk\nikNi\nDj\ni kbeF \n , \nfor 1,,1,0  Ni  , where iD  , i   and iN 2 , are \nrespectively, the group delay, phase shift and order of the filter \n)(iF  with the coefficients kib , . Define \n TNNNNN bbbbbb N 0,11,10,11,10,01,0 ,,,,,,,,, 110   y , \nthen \nyξF )()(   , \nwhere \n    TNFF  10 ,,)(  F  \nand \n    TNTdiag )(,,)()( 10   ξξξ  , \nin which \n  )()(   i\nDj\ni\niie ηξ    \nand \nT\ni\ni\niii\nN\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n \n\n\n\n\n  \n2\n12cos,,\n2\n3cos,\n2\n1cos2)( η , \nfor 1,,1,0  Ni  . Let M  be the least common multiple of \nthe decimation integers. Define \ni\ni n\nMk   and \n\n\n\n\n\n\n 0,,0),2(1)(, \ni\ni\ni\nji n\njH\nn\n\nv , \nfor 1,,1,0  Ni  , and for 1,,1,0  inj  . There are \n1ik  zeros in the vector  ji ,v . Let \n Tniii i )(,),()( 1,0,   vvυ  , \nfor 1,,1,0  Ni  . Then, the aliasing matrix of the \ncorresponding nonuniform filter bank system is: \n       110 ,,,)(  NυυυV  . \nLet the input of the corresponding nonuniform filter bank \nsystem be  X  and define \n      \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\nM\nM\nX\nM\nXXl\n12\n,,\n2\n,\n\n\n\n X , \nthen \n  )()()(  FVX lY  , \nwhere )(Y  is the output of the corresponding nonuniform \nfilter bank system and \n TNFFF )(,),(),()( 110   F . \nDefine \n Tmjec 0,,0,)(  µ , \nwhere c  and m  are, respectively, the gain and the delay of the \ncorresponding nonuniform filter bank system. Let \n)()()()(  µFVE  , \nwhere   denotes the absolute values of the elements in the \nvector )()()(  µFV  . Define  iE  be the  \nthi 1  \nelement of the vector )(E . Then, the amplitude distortion of \nthe corresponding nonuniform filter bank system is reflected by \n 0E  and the aliasing distortion is reflected by  iE  for \n1,,2,1  Mi  . \nLet the bounds on the amplitude and aliasing distortions be, \nrespectively, \na  and A . Then the constraints on the \n> Paper ID: T-SP-02047-2004.R2< \n \n4 \namplitude and aliasing distortions of the corresponding \nnonuniform filter bank system can be expressed as: \n  amjT ecE    xQy )(00 , for  B , \nand \n  AiTiE   xQy )( , for  B  and for \n1,,2,1  Mi  , \nwhere \n )(,),()( 10  iNii diag  QQQ  , for 1,,1,0  Mi  , \nin which \n\n\n\n\n\n\n\n\n\n\n \notherwise\n)2()(1)(\n0\nξξQ Zk\ni\nM\ni\nn j\nT\njj\nj\ni\nj\n\n . \nSince )(iQ  and \nmjec   are complex functions, the \nconstraints taking the absolute value of complex functions are \nquadratic with respect to x . One common way to tackle this \nkind of problem is via discretization. If the discretization \napproach is applied, then the constraints become convex \nquadratic constraints which will lead to a quadratic \nprogramming problem with convex quadratic constraints. \nProblems of this type belong to the class of convex \nprogramming problems and admit a unique global solution if a \nsolution exists. There are some available public domain convex \nprogramming solvers for solving this type of quadratic \nprogramming problems. However, as mentioned in the \nintroduction section, the number of grid points is very large and \nthe computation complexity is also very high, so we \napproximate the quadratic constraints as linear constraints as \ndescribed below. \nConsider the following constraints: \n  RamjT ec    xQy )(Re 0 , for  B , \n  IamjT ec    xQy )(Im 0 , for  B , \n  RAiT  xQy )(Re , for  B  and for 1,,2,1  Mi  , \nand \n  IAiT  xQy )(Im , for  B  and for 1,,2,1  Mi  , \nwhere Re  and Im  denote, respectively, the real and \nimaginary parts of the functions inside the brackets; Ra  and \nI\na  denote, respectively, the constraints on the real and \nimaginary parts of the amplitude distortion of the \ncorresponding nonuniform filter bank system; RA  and \nI\nA  \ndenote, respectively, the constraints on the real and imaginary \nparts of the aliasing distortion of the corresponding nonuniform \nfilter bank system. \nNote that each absolute value constraint is not equivalent to its \ncorresponding real\/imaginary value constraints. The reason for \nthis is that the mapping between these two constraints is not \ninvertible. However, the problem is much simplified and the \napproximation is valid if a  and A  are small enough. \nIf the set of filters in the transmitter is selected a prior, then \ny  is known. The constraints can be expressed as: \n)()(  rr cxA  , for pB0 , \nwhere \n    TTMrTrr )(,,)()( 10   AAA   \nand \n    TTMrTrr )(,,)()( 10   ccc  , \nin which for 1,,1,0  Mi  , \n        TTiTiTiTiir )(,)(,)(,)()(  IqIqRqRqA  , \n )(Re)(  iTi QyRq  , \n )(Im)(  iTi QyIq  , \n TIaIaRaRar mcmcmcmc )sin(),sin(),cos(),cos()(0  c , \nand \n TIAIARARAir  ,,,)( c , for 1,,2,1  Mi  . \nDefine \n\n\n\n\n\n\n\n)(\n)(\n)(\n\n\n\nr\nf\nA\nA\nA , for pB0 , \nand \n\n\n\n\n\n\n\n)(\n)(\n)(\n\n\n\nr\nf\nc\nc\nc , for pB0 . \nConsequently, the nonuniform transmultiplexer design \nproblem can be formulated as the following semi-infinite \nprogramming problem: \nx\nmin    pJ TT  xbxQxx\n2\n1 , \nsubject to 0cxAxg  )()(),(  , for pB0 , \nwhere )(A  and )(c  are continuously differentiable with \nrespect to pB0 . \nIf the lengths of the filters are sufficiently long, by applying the \ndual parameterization technique [4], then a solution will exist. \nSince the problem is formulated as a convex problem, the \nsolution is unique and any local solution is a global solution. \nOnce we obtain the set of filter coefficients in the receiver, we \nuse the same method to compute the filters coefficients in the \ntransmitter, and iterate the above procedures. Since the feasible \nset of each iteration is convex, this iteration process is actually a \nprojection on a convex set. Hence, the convergence of the \niteration process is guaranteed if a solution exists for each \niteration. Eventually, a set of transmitter and receiver filters \ncoefficients that globally minimizes the cost function and \nsatisfies the continuous constraints is obtained. \nIV. DESIGN EXAMPLE \nConsider a 3–channel nonuniform transmultiplexer with the \nset of decimation integers  4,4,2 . Let the transition \nbandwidths of the lowpass, bandpass and highpass filters be, \nrespectively, 3.0 , 25.0  and 15.0 . The real and imaginary \nparts of both the amplitude and aliasing distortions are \nbounded by 3105  . The specifications on the passband of the \nlowpass, bandpass and highpass filters are, respectively, \n0036.0 , 0059.0  and 0033.0 , and that of the stopband are, \nrespectively, 0081.0 , 0036.0  and 0081.0 . The filter length \nof the lowpass, bandpass and highpass filters are selected as, \nrespectively, 3100  NN , 9411  NN  and \n> Paper ID: T-SP-02047-2004.R2< \n \n5 \n9422  NN . The parameters for the corresponding \nnonuniform filter bank are chosen as 189m  and 1c , \nwhile the desired amplitude responses of the filters are defined \nas  \n\n\n\n\n\n s\ni\np\ni\nd B\nB\nA\ni \n\n\n0\n1  for 2,1,0i . \nBased on the above specifications and the parameters \nchosen, the nonuniform transmultiplexer design problem can \nbe readily formulated as a semi-infinite programming problem \ndiscussed in Section III. It can then be solved via the dual \nparameterization method. For the details of the theory and the \nalgorithm of solving semi-infinite programming problem via \nthe dual parameterization method, the readers can refer to [4] \nand [5]. \nBy applying the dual parameterization method, a solution is \nobtained for a given set of transmitter coefficients. After three \niterations between the filters designed for the transmitter and \nthe receiver, the filter coefficients in both the transmitter and \nreceiver converge. The magnitude response of the receiver \nfilters and the transmitter filters are plotted as solid lines in, \nrespectively, Figure 2 and Figure 3. The amplitude and aliasing \ndistortions are shown in Figure 4. For implementing the \nexisting method, we employ 15674  grid points for the \ndiscretization method via the convex quadratic programming \nsolver in MATLAB. The magnitude response of the receiver \nfilters and the transmitter filters are plotted as dotted line in, \nrespectively, Figure 2 and Figure 3. The corresponding \namplitude and aliasing distortions are shown in Figure 4. We \ncompared the results and found that the continuous constraints \nbetween some discretization points are not satisfied. Our \nalgorithm overwhelmingly produces better results on \nsuppressing the amplitude and aliasing distortions. According to \nthe computer simulation, our algorithm can obtain about 250dB \nimprovement for the real part and imaginary part of both the \namplitude and aliasing distortions. The amplitude distortion \nand the aliasing distortion are dramatically reduced from the \norder of 10-3 to 10-15 and 10-3 to 10-18, respectively. \nTo further demonstrate the effectiveness of our proposed \nalgorithm, three random signals with zero mean and unit \nvariance are taken as the input signals for the nonuniform \ntransmultiplexer. The mean square errors of these three \nchannels are 29103063.1  , 29107917.2   and \n30108908.8   respectively. They are negligible for most \nengineering applications and the nonuniform transmultiplexer \ncan be regarded as a perfect reconstruction system. \nV. CONCLUSION \nThe main contribution of this paper is to formulate a \nnonuniform FIR transmultiplexer design problem as a \nsemi-infinite programming problem. The method is based on \nthe dual parameterization method. One of the advantages of \nthis method is that it is guaranteed to achieve the global \nminimum while satisfying the passband and stopband \nspecifications as well as the amplitude and aliasing \nrequirements if the solution exists. It also avoids the problems \noccurred in the existing semi-definite programming approaches \n[6]. \nACKNOWLEDGEMENT \nThe work obtained in this paper was supported by a research \ngrant (project number G-YD26) from the Hong Kong \nPolytechnic University, the Centre for Multimedia Signal \nProcessing, The Hong Kong Polytechnic University, the CRGC \ngrant (project number PolyU 5101\\01E) from the Research \nGrants Council of Hong Kong, as well as a research grant from \nAustralian Research Council. \nREFERENCES \n[1] R. D. Koilpillai, T. Q. Nguyen, and P. P. Vaidyanathan, “Some results in the \ntheory of crosstalk-free transmultiplexers,” IEEE Transactions on Signal \nProcessing, vol. 39, no. 10, pp. 2174-2183, 1991. \n[2] T. Liu, and T. Chen, “Design of multichannel nonuniform transmultiplexers \nusing general building blocks,” IEEE Transactions on Signal Processing, vol. \n49, no. 1, pp. 91-99, 2001. \n[3] P. Q. Hoang, and P. P. Vaidyanathan, “Non-uniform multirate filter banks: \ntheory and design,” IEEE International Symposium on Circuits and Systems, \nISCAS, vol. 1, pp. 371-374, 1989. \n[4] Y. Liu, K.L. Teo and S. Ito, “Global optimization in quadratic semi-infinite \nprogramming,” Computing, vol. 15, pp. 119-132, 2001. \n[5] C. H. Tseng, K. L. Teo, Z. Zang and A. Cantoni, “A dual approach to \ncontinuous-time envelope-constrained filter design via orthonormal filters,” \nIEEE Transactions on Circuits and SystemsI: Fundamental Theory and \nApplications, vol. 46, no. 9, pp. 1042-1054, 1999. \n[6] W. S. Lu, “A unified approach for the design of 2-D digital filters via \nsemidefinite programming,” IEEE Transactions on Circuits and SystemsI: \nFundamental Theory and Applications, vol. 49, no. 6, pp. 814-826, 2002. \n> Paper ID: T-SP-02047-2004.R2< \n \n6 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 2: Filter responses of filters in the receiver. \n \nFigure 3: Filter responses of filters in the transmitter. \n \nFigure 4: Amplitude and aliasing distortions. \nFigure 1: A nonuniform transmultiplexer. \n zH 0\n \n zH1\n \n zH N 1\n \n zF0  \n zF1  \n zFN 1  \n0n  \n1n  \n\n  \n nx0  \n nx1  \n nxN 1  \n ny0\n ny1  \n nyN 1  1 Nn  \n0n  \n1n  \n1 Nn  \n\n \n\n \n\n \n\n \n\n \n"}