{"doi":"10.1016\/j.jspi.2006.05.017","coreId":"96427","oai":"oai:eprints.lse.ac.uk:31423","identifiers":["oai:eprints.lse.ac.uk:31423","10.1016\/j.jspi.2006.05.017"],"title":"Likelihood-based inference for a class of multivariate diffusions with unobserved paths","authors":["Kalogeropoulos, Konstantinos"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-10-01","abstract":"This paper presents a Markov chain Monte Carlo algorithm for a\\ud\nclass of multivariate diffusion models with unobserved paths. This\\ud\nclass is of high practical interest as it includes most diffusion\\ud\ndriven stochastic volatility models. The algorithm is based on a\\ud\ndata augmentation scheme where the paths are treated as missing\\ud\ndata. However, unless these paths are transformed so that the\\ud\ndominating measure is independent of any parameters, the algorithm\\ud\nbecomes reducible. The methodology developed in Roberts and\\ud\nStramer (2001 Biometrika 88(3):603-621) circumvents the problem\\ud\nfor scalar diffusions. We extend this framework to the class of\\ud\nmodels of this paper by introducing an appropriate\\ud\nreparametrisation of the likelihood that can be used to construct\\ud\nan irreducible data augmentation scheme. Practical implementation\\ud\nissues are considered and the methodology is applied to simulated\\ud\ndata from the Heston model","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96427.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/31423\/1\/Likelihood_based_inference_for_a_class_of_multivariate_diffusions_with_unobserved_paths_%28LSERO%29.pdf","pdfHashValue":"e4484a02c94881d0c1cdbb5e8a3f3dffe3eeebda","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:31423<\/identifier><datestamp>\n      2011-01-13T12:54:23Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5354<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/31423\/<\/dc:relation><dc:title>\n        Likelihood-based inference for a class of multivariate diffusions with unobserved paths<\/dc:title><dc:creator>\n        Kalogeropoulos, Konstantinos<\/dc:creator><dc:subject>\n        HA Statistics<\/dc:subject><dc:subject>\n        QA Mathematics<\/dc:subject><dc:description>\n        This paper presents a Markov chain Monte Carlo algorithm for a\\ud\nclass of multivariate diffusion models with unobserved paths. This\\ud\nclass is of high practical interest as it includes most diffusion\\ud\ndriven stochastic volatility models. The algorithm is based on a\\ud\ndata augmentation scheme where the paths are treated as missing\\ud\ndata. However, unless these paths are transformed so that the\\ud\ndominating measure is independent of any parameters, the algorithm\\ud\nbecomes reducible. The methodology developed in Roberts and\\ud\nStramer (2001 Biometrika 88(3):603-621) circumvents the problem\\ud\nfor scalar diffusions. We extend this framework to the class of\\ud\nmodels of this paper by introducing an appropriate\\ud\nreparametrisation of the likelihood that can be used to construct\\ud\nan irreducible data augmentation scheme. Practical implementation\\ud\nissues are considered and the methodology is applied to simulated\\ud\ndata from the Heston model.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2007-10-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/31423\/1\/Likelihood_based_inference_for_a_class_of_multivariate_diffusions_with_unobserved_paths_%28LSERO%29.pdf<\/dc:identifier><dc:identifier>\n          Kalogeropoulos, Konstantinos  (2007) Likelihood-based inference for a class of multivariate diffusions with unobserved paths.  Journal of Statistical Planning and Inference, 137 (10).  pp. 3092-3102.  ISSN 0378-3758     <\/dc:identifier><dc:relation>\n        http:\/\/www.elsevier.com\/wps\/find\/journaldescription.cws_home\/505561\/description#description<\/dc:relation><dc:relation>\n        10.1016\/j.jspi.2006.05.017<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/31423\/","http:\/\/www.elsevier.com\/wps\/find\/journaldescription.cws_home\/505561\/description#description","10.1016\/j.jspi.2006.05.017"],"year":2007,"topics":["HA Statistics","QA Mathematics"],"subject":["Article","PeerReviewed"],"fullText":"  \nKonstantinos Kalogeropoulos \nLikelihood-based inference for a class of \nmultivariate diffusions with unobserved \npaths \n \nArticle (Accepted version) \n(Refereed) \nOriginal citation: \nKalogeropoulos, Konstantinos (2007) Likelihood-based inference for a class of multivariate \ndiffusions with unobserved paths. Journal of statistical planning and inference, 137 (10). pp. \n3092-3102.  \n \nDOI: 10.1016\/j.jspi.2006.05.017\n \n© 2007 Elsevier\n \nThis version available at: http:\/\/eprints.lse.ac.uk\/31423\/\n \nAvailable in LSE Research Online: January 2011 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \nLikelihood-based Inference for a Class of Multivariate\nDiffusions with Unobserved Paths\nKonstantinos Kalogeropoulos\nMay 18, 2007\nAbstract\nThis paper presents a Markov chain Monte Carlo algorithm for a class of multivari-\nate diffusion models with unobserved paths. This class is of high practical interest as\nit includes most diffusion driven stochastic volatility models. The algorithm is based\non a data augmentation scheme where the paths are treated as missing data. However,\nunless these paths are transformed so that the dominating measure is independent of any\nparameters, the algorithm becomes reducible. The methodology developed in Roberts\nand Stramer (2001 Biometrika 88(3):603-621) circumvents the problem for scalar diffu-\nsions. We extend this framework to the class of models of this paper by introducing an\nappropriate reparametrisation of the likelihood that can be used to construct an irre-\nducible data augmentation scheme. Practical implementation issues are considered and\nthe methodology is applied to simulated data from the Heston model.\nKeywords: Data augmentation; Markov chain Monte Carlo; Stochastic volatility; Hes-\nton model.\n1 Introduction\nDiffusion processes constitute a natural and useful tool for modelling phenomena evolving\ncontinuously in time. They find applications in many different fields including finance, biol-\nogy, physics, engineering etc. A diffusion process Vt is defined through a stochastic differential\nequation (SDE):\ndVt = µ(Vt, θ)dt+ σ(Vt, θ)dBt, V0 = v0, 0 ≤ t ≤ T, Vt ∈ ℜ\nd (1)\nwhere Bt is a standard Brownian motion. The drift µ and volatility σ of the diffusion should\nsatisfy some regularity conditions (locally Lipschitz with a growth bound) to ensure that\n1\nthe SDE will have a weakly unique solution; see chapter 4 of Kloeden and Platen (1995).\nThroughout this paper we assume that their functional form is known and we focus on the\nproblem of parametric inference.\nIn practice we can only observe a discrete skeleton of the diffusion V . Depending on what\nkind of data we observe, we can further classify the diffusion models into two categories. The\nfirst category includes models where we have observations on every coordinate of the vector\nV . In the second category, the process is divided into two components, say X and α, and\nwe only observe points of X. In this paper we focus on a subclass of the second category,\nhenceforth denoted by C, considering multivariate diffusions with unobserved paths that\nsatisfy the following SDE ( 0 ≤ t ≤ T ):\n dXt\ndαt\n\n =\n\n µx(αt, θ)\nµα(αt, θ)\n\n dt+\n\n σx(αt, θ) 0\n0 σα(αt, θ)\n\n\n\n dBt\ndWt\n\n , (2)\nwhere B and W denote standard Brownian motions that can potentially be correlated.\nThe class C includes many interesting diffusions. For instance it contains most diffusion\ndriven stochastic volatility models which are particularly useful in financial applications;\nsee for instance Ghysels et al. (1996) and Shephard (2005). Famous examples of stochastic\nvolatility models in C are the models introduced in Heston (1993), Stein and Stein (1991)\nand Hull and White (1987)∗. Section 4 provides an example based on the model of Heston\n(1993).\nA crucial difference between the models of these two categories is the availability of the\nMarkov property. Suppose that we observe V (or X accordingly) at times {tk, 0 ≤ tk ≤\nT, k = 0, 1, . . . , n} and let Y = {Yk = Vtk}. In the first category we can write the likelihood\nusing the transition density of the diffusion (conditional on the initial point Y0):\npθ(Y ) =\nn∏\nk=1\npθ(Yk|Yk−1). (3)\nHowever, this is not always true for the models of the second category and consequently for\nthe diffusions in C. In both cases the likelihood is not generally available in closed form and\nthe problem of inference is quite complicated. As a result of this, the literature contains\nvarious methodologies that may or not be based on the likelihood; see Sørensen (2004) for\nan extensive review. Likelihood based approaches are either analytical (Aı¨t-Sahalia (2002),\nAı¨t-Sahalia (2005)), or they use simulations (Pedersen (1995), Durham and Gallant (2002)).\n∗It is easier to see this if we use S = exp(X) instead of X\n2\nThey usually approximate the likelihood in a way so that the discretisation error can be-\ncome arbitrarily small, although the methodology developed in Beskos et al. (2006) succeeds\nexact inference in the sense that it allows only for Monte Carlo error. Unfortunately, all\nof the above rely on the Markov property and therefore become hard to generalize to the\nnon-Markovian case.\nA natural way to proceed is via data augmentation, a methodology introduced by Tan-\nner and Wong (1987). The idea is based on the fact that the likelihood can always be well\napproximated given the entire path of V or a sufficiently fine partition of it. Therefore, the\nunobserved paths of V are treated as missing data and a finite number of points, large enough\nto make the approximation error arbitrarily small, is imputed. Elerian et al. (2001), Eraker\n(2001) and Jones (2003) use Markov chain Monte Carlo (MCMC) approaches and approxi-\nmate the posterior through the Euler-Maruyama approximation of the transition density (3).\nAs noted in Roberts and Stramer (2001) however, there exists a strong dependence between\nthe imputed sample paths and the volatility coefficients. In fact the algorithm becomes re-\nducible as the number of imputed points increases.\nRoberts and Stramer (2001) tackle the problem for scalar diffusions by a reparametri-\nsation on the paths of V and Kalogeropoulos et al. (2007a) offer an extension for some\nmultivariate diffusions. As explained in section 2.1 however, this framework does not cover\nthe models in C. This paper focuses on this class and we introduce a novel reparametrisation\nof the likelihood that may serve as the basis for data augmentation schemes. Alternative\napproaches to this problem can be found in Chib et al. (2005) and Golightly and Wilkinson\n(2005).\nThe paper is organized as follows. Next section elaborates on the need for a reparametri-\nsation and provides a likelihood that may serve as the basis for inference purposes. Section 3\npresents the details of a data augmentation scheme that can handle models in C. In section 4,\nthe methodology is applied to simulated data. We highlight the necessity of the reparametri-\nsation in a simple stochastic volatility model and we perform a simulation study based on\nthe model of Heston (1993) to illustrate the proposed methodology. Finally we conclude in\nsection 5 with some relevant discussion.\n3\n2 Reparametrisation\n2.1 The need for a reparametrisation\nWithout loss of generality we will consider a slightly simpler version of (1), i.e. a scalar\ndiffusion with constant volatility:\ndVt = µ(Vt, θ)dt+ σdBt, V0 = y0, 0 ≤ t ≤ T (4)\nIn practice we have observations of V at a finite set of times and we want to draw\ninferences for θ and σ based on them. Under the hypothetical scenario that the entire path\nV is observed, we can identify σ through the quadratic variation process:\nTσ2 =\n∫ T\n0\n(dVt)\n2 a.s. (5)\nWe can then see the likelihood for θ as the Radon-Nikodym derivative of the law of V\nwith respect to that of a Brownian motion with volatility σ2. This is provided by Girsanov’s\nformula (see for instance chapter 8 of Oksendal (2000)), yet in most cases a closed form solu-\ntion is not available. Given observations on a sufficiently fine scale we can use approximations\nbut such data are not available by definition for diffusions with unobserved paths.\nAn alternative option is to apply a data augmentation scheme and make inferences for\nθ, σ and the unobserved diffusion paths. Nevertheless, as the number of imputed points\nincreases, the posterior density of σ2 conditional on V is just a point mass, so that (5) is\nsatisfied (Roberts and Stramer, 2001). Hence, any data augmentation scheme based on the\ndiffusion V will result in a reducible MCMC algorithm; the sample paths of V will force σ to\nremain at its current value and never converge. Another way to see the problem is to note that\nthe measures {Wσ, σ ∈ R} are mutually singular and therefore so are {Pσ, σ ∈ R}. Section\n4.1 demonstrates this problem using simulated data from a simple stochastic volatility model.\nNote that imputation of arbitrarily many points is vital for limiting the approximation error.\nThe problem may be resolved if we apply a transformation on V , so that the algorithm\nbased on the transformed diffusion is no longer reducible. In the spirit of Papaspiliopoulos\net al. (2003), this can be seen as a non-centering reparametrisation. Next subsection contains\nthe relevant details and introduces a suitable reparametrisation for the diffusions in class C.\n2.2 A suitable likelihood parametrisation\nRoberts and Stramer (2001) proposed a reparametrisation of the likelihood for general scalar\n4\ndiffusions that breaks down the dependence between the sample paths and the volatility\ncoefficients. They note that the likelihood is initially written with respect to a dominating\nmeasure that depends on parameters and they introduce a two-step transformation under\nwhich the dominating measure is parameter-free. The first step of this transformation,\ndenoted by h(Vt, θ), is given by the solution to the following differential equation:\n∂h(Vt, θ)\n∂Vt\n= {σ(Vt, θ)}\n−1 (6)\nAs noted in Kalogeropoulos et al. (2007a), in more than one dimensions the above extends\nto the following system of partial differential equations (PDEs):\n∇h(Vt, θ) σ(Vt, θ) [∇h(Vt, θ) σ(Vt, θ)}]\n′ = Id,\nwhere Id denotes the identity matrix of dimension d and A\n′ is the transpose of a matrix\nA. It is not guaranteed that the above system of PDEs will have a solution. In fact, as\nproved in Aı¨t-Sahalia (2005), the system is inconsistent for stochastic volatility models and\ntherefore such a transformation does not exist for diffusions in C. Hence we take a slightly\ndifferent route.\nConsider a diffusion in C and denote the observations of the process X at times tk, k =\n1 . . . , n by Y , Y = {Xtk , 0 ≤ tk ≤ T} = {Yk, k = 1, . . . , n}. For simplicity we assume that\nthe diffusion in (2) is two-dimensional (we discuss about extensions to higher dimensions in\nthe next subsection):\ndXt = µx(αt, θ)dt+ ρσx(αt, θ)dWt +\n√\n1− ρ2σx(αt, θ)dBt\ndαt = µα(αt, θ)dt+ σα(αt, θ)dWt\nwhere B and W are independent Brownian motions. The parameter ρ is the correlation\nbetween the instantaneous increments of X and α and reflects what is termed as leverage\neffect in the stochastic volatility literature. Let Pθ(X,α) denote the law of (X,α)\n′. Clearly\nwe can write:\nPθ(X,α) = Pθ(α) Pθ(X|α),\nwhere Pθ(α) and Pθ(X|α) denote the laws of α and X given α respectively. Note that\ngiven the path of the unobserved process and its parameters, α and W become deterministic\n5\nfunctions of time. Looking again at the SDE of X we note that Pθ(X|α) depends only on\nthe observations Y the density of which is\npθ(Y |α) =\nn∏\nk=1\npθ (Yk |Yk−1, {αt : tk−1 ≤ t ≤ tk}) .\nwhere\npθ (Yk |Yk−1, {αt : tk−1 ≤ t ≤ tk}) ∼ N\n(\nµk, (1− ρ\n2)\n∫ tk\ntk−1\nσx(αs, θ)\n2ds\n)\nwith\nµk = Yk−1 +\n∫ tk\ntk−1\nµx(αs, θ)ds+ ρ\n∫ tk\ntk−1\nσx(αs, θ)dWs.\nDenote by Qθ(α) the distribution of the driftless version of α. Combining all of the above,\nwe can attempt to write down the likelihood as\ndPθ\ndQθ\n(X,α) = pθ(Y |α)\ndPθ(α)\ndQθ(α)\n(7)\nThe dominating measure Qθ(α) in the parametrisation of (7) corresponds to a diffusion\nwith volatility σα(αt, θ) and therefore clearly depends on θ. For this reason we are going to\nintroduce a transformation βt = h(αt, θ) that originates from a differential equation, similar\nto (6):\n∂h(αt, θ)\n∂αt\n= {σα(αt, θ)}\n−1\nApplying Ito’s lemma we note that the transformed process βt has unit volatility and\ndrift:\nµβ(β, θ) =\nµα\n[\nh−1(β, θ), θ\n]\nσα [h−1(β, θ), θ]\n−\n1\n2\n∂σα\n[\nh−1(β, θ), θ\n]\n∂h−1(β, θ)\n.\nGiven the initial point of β (β0 = h(α0, θ)), Girsanov’s formula now provides the Radon-\nNikodym derivative between the law of β and that of a Brownian motion starting at β0. This\nis still problematic however, as this law depends on parameters (β0 is a function of θ). For\nthis reason we introduce a second transformation:\nγt = βt − β0, βt = η(γt)\nThe process γt will have unit volatility and drift µγ(γ, θ) = µβ(η(γ), θ). Now we can\nuse Girsanov’s formula for the Radon-Nikodym derivative between the law of γ, denoted by\nPθ(γ), and that of a standard Brownian motion starting at 0 (W):\n6\ndPθ(γ)\ndW\n= G(γ, θ) = exp\n(∫ T\n0\nµγ(γs, θ)dγs −\n1\n2\n∫ T\n0\nµ2γ(γs, θ)ds\n)\n.\nWe are finally in a position to write down the likelihood with respect to a parameter-free\ndominating measure:\ndPθ\ndQθ\n(X, γ) = pθ(Y |γ)\ndPθ(γ)\ndW\n= pθ(Y |γ) pi(α0) G(γ, θ) (8)\nwhere pθ(Y |γ) = pθ(Y |α) = pθ\n{\nY |η ◦ h−1(γ, θ)\n}\nand pi(α0) has to be specified as part of the\nmodel. If available, the stationary distribution of α is a natural choice. Using this likelihood\nwe can construct an irreducible data augmentation scheme that can be used for inference\npurposes. Given a sufficiently fine partition of the path of γ, the Ito and path integrals in\nthe likelihood may be calculated numerically. The relevant discretisation error may become\narbitrarily small as we impute more points. More details on this scheme and its practical\nimplementation are provided in the next section.\n2.3 Multifactor and Multivariate Stochastic Volatility Models\nIn the previous subsection for illustration processes we made the assumption that both\nprocesses X and α are one-dimensional. This assumption is not necessary; we can still\nuse such a parametrisation of the likelihood in models where either or both Xt and α are\nvector processes. Famous examples of such models are that of multivariate and multifactor\nstochastic volatility used for example in Duffie and Kan (1996) and Chernov et al. (2003).\nWe should keep in mind however, that this likelihood parametrisation requires the existence\nof a transformation of α, h(α, θ), to a diffusion with identity volatility matrix. Therefore it\nis only applicable to models with such σα(α, θ), so that the system of PDEs:\n∇h(αt, θ) σα(αt, θ) [∇h(αt, θ) σα(αt, θ)]\n′ = Id\nhas a solution. The methodology contains most cases of practical interest in multifactor and\nmultivariate stochastic volatility. For example it contains models with a constant volatility\nmatrix for α or with conditionally independent volatilities (α = (α1, . . . αd)\n′, σα(α, θ) ≡\ndiag {f(αi, θ)}, i = 1, . . . , d). Extensions to more general models are possible by diagonaliz-\ning σα(.)\n7\n3 Data augmentation scheme\nThis section presents a MCMC algorithm that can be used to sample from the posterior\ndensities of the parameter vector θ and the unobserved paths of γ. The model is formulated\nin continuous time but in practice we impute the values of γ at a finite set of times. Denote\nby m the number of imputed points between any two observations. We have to choose a large\nenough m so that the error due to the discretisation of γt is sufficiently small. Roberts and\nStramer (2001) use the stability of the likelihood estimate as a diagnostic for the fine-ness of\nthe discretisation. The idea is that if the likelihood estimates for two different numbers of\nm are approximately the same, the discretisations are likely to be sufficiently fine.\nUpdating θ is relatively straightforward as we can get the relevant conditional posterior\ndensities using the likelihood defined in (8). The parameter vector can be divided into two\ncomponents θ = (θ1, θ2), depending on the part of likelihood they appear. θ1 contains the\nparameter involved in the µx and σx as well as ρ and α0. θ2 contains the parameters in µα(.)\nand σα(.). Let pi(θi), i = 1, 2 denote the corresponding priors. The conditional posterior\ndensities pi(θi|Y ) will then be:\npi(θ1|Y ) ∝ pθ(Y |γ)pi(θ1)\npi(θ2|Y ) ∝ pθ(Y |γ)G(γ, θ)pi(θ3)\nFor some models it may be possible to identify the conditional posterior densities above and\napply Gibbs steps. Otherwise ordinary random walk Metropolis updates may be used.\nIn the remainder of this section we will focus on the updates of the diffusion paths of\nγ, a clearly more complicated task. We proceed using an independence sampler, proposing\nfor instance from Brownian motion. Updating the entire path could lead to extremely low\nacceptance rates as the discrepancy between the proposed and current path is substantial.\nA way to circumvent this problem is to split the process into blocks and update each one\nin turn using diffusion bridges (i.e. diffusions conditioned to finish at a particular point).\nBy doing so, we increase the acceptance rate of the moves since the discrepancy between\nthe proposed and current moves is significantly lower. For more details see Elerian (1999).\nOn the other hand, Elerian also notes that smaller blocks result in slower convergence and\ntherefore some tuning is required to get the optimal results.\nWhile it is rather clear that the path of γ should be divided into blocks, it is not straight-\nforward how this should be done. Suppose that we observe Y at times tk, as in section 2.2,\n8\nand that we split the path of γ into n blocks {bk = γs, tk−1 ≤ s ≤ tk, k = 1, 2, . . . , n}.\nBut under this formulation the endpoints of the blocks are not updated at all leading to a\nreducible MCMC chain; an alternative blocking scheme is needed. The blocking strategy\nadopted in this paper, uses block updating of overlapping segments. This scheme has been\nalso used in Roberts and Stramer (2004) in a slightly different context. Under this procedure,\nwe update γs for ti ≤ s ≤ ti+c for i = 0, 1, . . . , n − c, where c is an integer smaller than n.\nIt is our experience that high values of c improve the mixing of the algorithm as long as\nthe acceptance rate of the blocks is not too small. We use an independence sampler with a\nBrownian bridge as the proposal distribution. The MCMC algorithm becomes:\n1. Set i = 0.\n2. Propose a Brownian bridge starting at γ(ti) and finishing at γ(ti+c). Denote it by γ\n∗\ns ,\nti ≤ s ≤ ti+c.\n3. Accept γ∗s with probability:\nmin\n(\n1,\nG(γ∗s , θ)piθ(Xs|γ\n∗\ns )\nG(γs, θ)piθ(Xs|γs)\n)\n4. Set i = i + 1 (until i ≤ n − c). Note that for i = n − c the proposal should be just\nBrownian motion rather than a Brownian bridge.\nAn alternative blocking strategy uses random sized blocks. More specifically at each\niteration the path is randomly split into blocks and the paths between the endpoints are\nupdated, whereas the endpoints remain unchanged until the next iteration. See Elerian’s\nthesis for more details. This scheme was adopted in Chib et al. (2005) and found to perform\nwell.\n4 Simulations\nThe simulations performed in this section aim to demonstrate two aspects of the problem.\nFirst, we highlight the necessity of the reparametrisation introduced in section 2. This is\ndone in section 4.1 by exposing the problem in the case of a very simple stochastic volatility\nmodel. In section 4.2 we present the proposed methodology using simulated data from the\nHeston model.\n9\n4.1 Data augmentation without reparametrisation\nWe simulated data from the following stochastic volatility model of C:\n dXt\ndαt\n\n =\n\n exp(αt\/2)dBt\nσdWt\n\n , X0 = α0 = 0, σ > 0, 0 ≤ t ≤ 100.\nwhere B and W are independent Brownian motions. Note that in this case µx ≡ µα ≡ 0.\nTherefore, unless we apply a reparametrisation, Girsanov’s formula is not useful. Alterna-\ntively we may use the Euler-Maruyama approximation; see chapter 9 of Kloeden and Platen\n(1995). Suppose that we observe X at times {tk = k, k = 0, 1, . . . , n}, n = 100 and that\nwe impute the corresponding values for α. Furthermore we impute m values of α between\nevery pair of successive times with observations. For simplicity we assume that the imputed\npoints are equidistant and denote the time interval between them by δ = (m + 1)−1. Let\nVt = (Xt, αt)\n′ and Σ = diag{exp(αt), σ\n2}. Under the Euler-Maruyama approximation and\ngiven V0 we get:\npi(Y, σ2, Vt) =\nn(m+1)+1∏\nt=1\npi(Vt|Vt−1, σ\n2), pi(Vt|Vt−1, σ\n2) ∼ N (Vt−1, δΣt−1) ,\nIf we assign pi(σ2) ∝ σ−2 as the prior for σ2 and assume that α0 is known, we get that its\nconditional posterior density is an Inverse-Gamma distribution with parameters:\na =\nn(m+ 1)\n2\n, b =\n(m+ 1)\n∑n(m+1)+1\nt=1 (αt − αt−1)\n2\n2\nWe ran a MCMC chain for 100,000 iterations for different numbers of imputed points (m =\n1, 10, 40, 100), updating the paths as described in section 3 and using the Gibbs step for\nthe updates σ2. We used the overlapping blocks scheme for the updates of the paths. The\nlength of the block was chosen as c = 5 to improve autocorrelation for the posterior draws\nof σ2 and the acceptance rate of the blocks was approximately 78%. Figure 1b shows the\nautocorrellation of the posterior draws of σ2 for each value of m. Clearly, the autocorrelation\nincreases dramatically leading to an increasingly slower chain. An alternative way to see this\nis to note that the variance of the conditional posterior for σ2 goes to 0 as we increase m.\nThe problem can be resolved if we apply this paper’s proposed reparametrisation. Fol-\nlowing the route of section 2.2, we set βt = αt\/σ and γt = βt − β0 = βt and we get\ndXt = exp(σβt\/2)dBt,\n10\nwhere β is a standard Brownian motion independent of B. Note that the part with Girsanov’s\nformula drops out of the likelihood which now simplifies to:\npi(Y, σ2, βt) = pi(β0)\nn∏\nk=1\npi(Yk|Yk−1, σ\n2, βt),\nwhere\npi(Yk|Yk−1, σ\n2, βt) ∼ N\n{\nYk−1,\n∫ tk\ntk−1\nexp(σβs)ds\n}\n.\nFigure 1a contains the corresponding autocorrelation plots of the posterior draws of σ2\ntaken from the reparametrised data augmentation scheme. Unlike the previous case (figure\n1b) there is clearly no increase in the autocorrelation.\n[Figure 1 about here.]\n4.2 Reparametrised scheme applied to the Heston model\nIn this section we illustrate the proposed methodology to simulated data from the model of\nHeston (1993). We also demonstrate the immunity of the algorithm developed in sections 2\nand 3 to the increase of the number of imputed points m. If we take the log of the observed\nprocess the Heston model can be written as:\ndXt = µxdt+\n{\n(1− ρ2)αt\n}1\/2\ndBt + ρ αt\n1\/2dWt\ndαt = κ(µ− αt)dt+ σαt\n1\/2dWt\nwhere Bt and Wt are independent Brownian motions and Corr(dXt, dαt) = ρdt as before.\nIn accordance to section 2.2 we apply the following 2-step transformation:\n1. βt = h(αt) = 2αt\n1\/2\/σ, βt > 0\n2. γt = βt − 2α0\n1\/2\/σ, βt = η(γt)\nThen using Ito’s lemma we get (g := η ◦ h−1):\ndXt = µxdt+\n{\n(1− ρ2)g(γt)\n}1\/2\ndBt + ρ g(γt)\n1\/2dWt\ndγt =\n{\n2κµ− 0.5σ2\nσ2η(γt)\n− 0.5κη(γt)\n}\ndt+ dWt\n11\nWe can now proceed by writing down the likelihood as in section 2.2 and implementing\na data augmentation scheme as in section 3. Using Brownian bridges as proposals for the\npaths of γ is not the best choice given the constraint βt > 0. Alternatively we may choose to\nupdate the paths of α instead, since they are linked with a deterministic function with the\npaths of γ given σ. We may propose from the diffusion Z that satisfies the SDE:\ndZt =\nσ2\n4\ndt+ σZt\n1\/2dBt\nTo simulate bridges from Z we can first simulate a Brownian bridge BBt with volatility√\nσ\/2 and then set Z = 12σBBt\n2. The parameter values used in the simulation are similar\nto those obtained from the analysis of the closing prices of Standard and Poor’ 500 index in\nChib et al. (2005) and Aı¨t-Sahalia and Kimmel (2005).\nWe simulated 1008 data points (excluding the initial point) from the Heston model corre-\nsponding to 1008 working days or 4 years of data. In accordance with the relevant literature,\nwe set the initial values to X0 = log(100) and α0 = µ = 0.9. As in the previous sec-\ntion, we ran a MCMC chain for 80,000 iterations for different numbers of imputed points\n(m = 20, 40, 80). We chose the value of c = 8 to achieve lower autocorrelation on the param-\neter posterior draws. The acceptance rate for the blocks was approximately 32%. Figure 2\nshows the autocorrelation plot for the posterior draws of σ for different values of m. There\nis no evidence of any increase whatsoever, even for m = 80. In figure 3, we see the posterior\ndensities of the log-likelihood and σ, again for different values of m. All the densities are\nsimilar, providing strong evidence that the discretisation is sufficiently fine. Finally table 1\nprovides the posterior means and standard deviations of the parameters. We see that these\nestimates are in good agreement with the values we simulated the data from.\n[Table 1 about here.]\n[Figure 2 about here.]\n[Figure 3 about here.]\n5 Discussion\nThe methodology developed in this paper allows for likelihood-based inference in a class of\nmultivariate diffusions with unobserved paths. This class includes diffusion driven stochastic\nvolatility models where the problem of inference is particularly difficult due to the lack of\n12\nthe Markov property. This is accomplished via a MCMC algorithm that is relatively simple\nand fast to implement as illustrated in sections 3 and 4. Under the proposed framework it\nis quite straightforward to limit the discretisation error by simply increasing the number of\nimputed points. The reparametrised scheme of this paper achieves that leaving both the\nautocorrelation of the posterior draws and the irreducibility of the chain, intact.\nAlternative data augmentation schemes for the diffusions in C can be found in Chib et al.\n(2005) and Golightly and Wilkinson (2005). Apart from the different blocking strategy, the\nmethodology in Chib et al. (2005) is based on a reparametrisation under which the paths\nof the unobserved process are transformed to W rather than γ. This scheme also contains\nLaplace approximation proposals for the updates of the parameters of α. The work in\nGolightly and Wilkinson (2005) uses bayesian sequential techniques and joint updates of the\ndiffusion paths and the parameters in the volatility functions.\nAs in most data augmentation schemes for diffusions, an independence sampler was used\nfor the block updates of the paths. A disadvantage of this method is that the acceptance rate\nof the sampler will be small for larger blocks and consequently the algorithm will deteriorate.\nThe use of smaller blocks is an option, but it may slow down the mixing of the chain. A more\nsophisticated choice for the proposal of the sampler, for instance a linear diffusion bridges,\nmay improve the performance of the MCMC chain.\nThe class of diffusions considered in this paper does not include cases, where the drift\nand the volatility of the observed process depend on the process itself; for instance stochastic\nvolatility models for interest rates with mean reverting drift. The reason for this is that the\ndistribution of the observed process given the unobserved is no longer available in closed\nform. The data augmentation scheme of Kalogeropoulos et al. (2007b) handle such models\nusing time change transformations of the observed process. An alternative option is provided\nby Golightly and Wilkinson (2005).\n6 Acknowledgments\nThis work was supported by the project Irakleitos - Fellowships for Research of the Athens\nUniversity of Economics and Business (which is co-financed by the European Union) and\nby the EPSRC grant GR\/S61577\/01. The author would particularly like to thank Gareth\nRoberts, Petros Dellaportas, Antonio Pievatolo and the referees for their very helpful and\nconstructive comments.\n13\nReferences\nAı¨t-Sahalia, Y. (2002). Maximum likelihood estimation of discretely sampled diffusions: a\nclosed form approximation approach. Econometrica, 70:223–262.\nAı¨t-Sahalia, Y. (2005). Closed form likelihood expansions for multivariate diffusions. In\npreparation.\nAı¨t-Sahalia, Y. and Kimmel, R. (2005). Maximum likelihood estimation for stochastic volatil-\nity models. To appear in the Journal of Financial Economics.\nBeskos, A., Papaspiliopoulos, O., Roberts, G., and Fearnhead, P. (2006). Exact and compu-\ntationally efficient likelihood-based estimation for discretely observed diffusion processes\n(with discussion). Journal of the Royal Statistical Society: Series B (Statistical Methodol-\nogy), 68(3):333–382.\nChernov, M., Gallant, A., Ghysels, E., and Tauchen, G. (2003). Alternative models for stock\nprice dynamics. Journal of Econometrics, 116:225–258.\nChib, S., Pitt, M. K., and Shephard, N. (2005). Likelihood based inference for diffusion\nmodels. Submitted.\nDuffie, D. and Kan, R. (1996). A yield factor model of interest rates. Mathematical Finance,\n6:379–406.\nDurham, G. B. and Gallant, A. R. (2002). Numerical techniques for maximum likelihood\nestimation of continuous-time diffusion processes. J. Bus. Econom. Statist., 20(3):297–316.\nWith comments and a reply by the authors.\nElerian, O. (1999). Simulation estimation of continuous-time models with applications to\nfinance. D.Phil thesis, Nuffield College, Oxford.\nElerian, O. S., Chib, S., and Shephard, N. (2001). Likelihood inference for discretely observed\nnon-linear diffusions. Econometrica, 69:959–993.\nEraker, B. (2001). Markov chain Monte Carlo analysis of diffusion models with application\nto finance. J. Bus. Econom. Statist., 19(2):177–191.\nGhysels, E., Harvey, A., and Renault, E. (1996). Stochastic volatily, in. Handbook of Statistics\n14, Statistical Methods in Finance. G.S. Maddala and C.R. Rao (eds), North Holland,\nAmsterdam.\n14\nGolightly, A. and Wilkinson (2005). Bayesian sequential inference for nonlinear multivariate\ndiffusions. Submitted.\nHeston, S. (1993). A closed-form solution for options with stochastic volatility. with appli-\ncations to bonds and currency options. 6:327–343.\nHull, J. C. and White, A. D. (1987). The pricing of options on assets with stochastic\nvolatilities. Journal of Finance, 42(2):281–300.\nJones, C. S. (2003). Nonlinear mean reversion in the short-term interest rate. The review of\nfinancial studies, 16:793–843.\nKalogeropoulos, K., Dellaportas, P., and Roberts, G. (2007a). Bayesian inference for correl-\nlated diffusions observed discretly in time. In submision.\nKalogeropoulos, K., Roberts, G., and Dellaportas, P. (2007b). A unified inference framework\nfor diffusion driven stochastic volatility models. In submission.\nKloeden, P. and Platen, E. (1995). Numerical Solutions of Stochastic Differential Equations.\nNew York: Springer.\nOksendal, B. (2000). Stochastic differential equations. Springer, 5th edition.\nPapaspiliopoulos, O., Roberts, G., and Skoˆld (2003). Non-centered parametrisations for\nhierarchical models and data augmentation. in J. M. Bernardo, M. J. Bayarri, J. O.\nBerger, A. P. Dawid, D. Heckerman, A. F. M. Smith & M. West, eds ’Bayesian Statistics\n7’, Oxford University Press, pp. 307-326.\nPedersen, A. R. (1995). A new approach to maximum likelihood estimation for stochastic\ndifferential equations based on discrete observations. Scand. J. Statist., 22(1):55–71.\nRoberts, G. and Stramer, O. (2001). On inference for partial observed nonlinear diffusion\nmodels using the metropolis-hastings algorithm. Biometrika, 88(3):603–621.\nRoberts, G. and Stramer, O. (2004). On bayesian analysis of non-linear continuous time\nautoregressive models. Submitted.\nShephard, N. (2005). Stochastic Volatility: Selected Readings. Oxford University Press.\nSørensen, H. (2004). Parametric inference for diffusion processes observed at discrete points\nin time: a survey. International Statistical Review, 72(3):337–354.\n15\nStein, E. M. and Stein, J. C. (1991). Stock proce distributions with stochastic volatility: an\nanalytic approach. Review of Financial Studies, 4(4):727–752.\nTanner, M. A. and Wong, W. H. (1987). The calculation of posterior distributions by data\naugmentation. Journal of the American Statistical Association, 82(398):528–540.\n16\nList of Figures\n1 Autocorrelation plots of posterior draws of σ2 for different values of imputed\npoints between observations (m) for the simple stochastic volatility model.\nThe draws in (a) correspond to the reparametrised scheme scheme and in (b)\nto the scheme without transformation. . . . . . . . . . . . . . . . . . . . . . . 18\n2 Autocorrelation plots of posterior draws of σ for different values of imputed\npoints between observations (m) for the Heston model. . . . . . . . . . . . . . 19\n3 Posterior densities of (a) log-likelihood and (b) σ for different values of imputed\npoints between observations (m) for the Heston model. . . . . . . . . . . . . . 20\n17\nLag\nAu\nto\nco\nrre\nlat\nion\n0 50 100 150 200\n0.\n0\n0.\n2\n0.\n4\n0.\n6\n0.\n8\n1.\n0\n(a)\nm=1\nm=10\nm=40\nm=100\nLag\nAu\nto\nco\nrre\nlat\nion\n0 50 100 150 200\n0.\n0\n0.\n2\n0.\n4\n0.\n6\n0.\n8\n1.\n0\n(b)\nm=1\nm=10\nm=40\nm=100\nFigure 1: Autocorrelation plots of posterior draws of σ2 for different values of imputed points\nbetween observations (m) for the simple stochastic volatility model. The draws in (a) corre-\nspond to the reparametrised scheme scheme and in (b) to the scheme without transformation.\n18\nLag\nAu\nto\nco\nrre\nlat\nion\n0 100 200 300 400 500\n0.\n0\n0.\n2\n0.\n4\n0.\n6\n0.\n8\n1.\n0\nm=20\nm=40\nm=80\nFigure 2: Autocorrelation plots of posterior draws of σ for different values of imputed points\nbetween observations (m) for the Heston model.\n19\nlog−likelihood\n−400 −300 −200 −100 0\n0.\n0\n0.\n00\n2\n0.\n00\n4\n0.\n00\n6\n(b)\nm=20\nm=40\nm=80\nsigma\n0.1 0.2 0.3 0.4 0.5\n0\n2\n4\n6\n8\n10\n(a)\nm=20\nm=40\nm=80\nFigure 3: Posterior densities of (a) log-likelihood and (b) σ for different values of imputed\npoints between observations (m) for the Heston model.\n20\nList of Tables\n1 Posterior means and standard deviations of the parameters versus their true\nvalues. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 22\n21\nParameter κ µ σ ρ µx\nTrue value 0.1 0.9 0.2 -0.5 0\nPosterior mean 0.0915 0.8712 0.2126 -0.479 0.0187\nPosterior SD 0.0296 0.0863 0.0436 0.1134 0.0278\nTable 1: Posterior means and standard deviations of the parameters versus their true values.\n22\n"}