{"doi":"10.1080\/0968776010090206","coreId":"14243","oai":"oai:generic.eprints.org:352\/core5","identifiers":["oai:generic.eprints.org:352\/core5","10.1080\/0968776010090206"],"title":"Integrating groupware technology into the learning environment","authors":["Shaikh, Abdul","Macaulay, Linda"],"enrichments":{"references":[{"id":1880858,"title":"61Abdul Naeem Shaikh and Undo Macaulay Integrating groupware technology into the learning environment Ventana-corporation","authors":[],"date":"2000","doi":"10.3402\/rlt.v9i2.12029","raw":"61Abdul Naeem Shaikh and Undo Macaulay Integrating groupware technology into the learning environment Ventana-corporation (October, 2000), GroupSystems.com, http:\/\/www.ventana.com.","cites":null},{"id":452129,"title":"A partnership approach in undergraduate business education',","authors":[],"date":"1998","doi":"10.1145\/279179.279201","raw":"Skok, W. and Wardley, R. (1998), 'A partnership approach in undergraduate business education', Proceedings of the 1998 Conference on Computer Personnel Research, ACM Press, 136-44.","cites":null},{"id":452128,"title":"Creating the human\/technology partnership',","authors":[],"date":"1994","doi":null,"raw":"Roberts, M. (1994), 'Creating the human\/technology partnership', in J. S. J. Bate and N. Travell (eds.), Groupware, Alfred Waller Limited, 111-32.","cites":null},{"id":452131,"title":"CU-SeeMe Networks,","authors":[],"date":"2000","doi":null,"raw":"White-Pine (October, 2000), CU-SeeMe Networks, http:\/\/www.cuseeme.com.","cites":null},{"id":198473,"title":"Evaluation: turning technology from toy to tool: report of the working group on evaluation',","authors":[],"date":"1996","doi":"10.1145\/237466.237648","raw":"Almstrum, V. L., Dale, N., Berglund A., Granger, M., Little, J. C., Miller, D. M., Petre, M., Schragger, P. and Springsteel, F. (1996), 'Evaluation: turning technology from toy to tool: report of the working group on evaluation', ITiCSE '96, Proceedings of the Conference on Integrating Technology into Computer Science Education, ACM Press, 201-17.","cites":null},{"id":198475,"title":"Groupware - the changing environment',","authors":[],"date":"1997","doi":null,"raw":"Coleman, D. (1997), 'Groupware - the changing environment', in D. Coleman (ed.), Groupware: Collaborative Strategies for Corporate LANs and Intranets, Prentice Hall, 1-38.","cites":null},{"id":452127,"title":"Groupware and software engineering: criteria for success',","authors":[],"date":"1998","doi":"10.1007\/978-1-4471-0625-8_17","raw":"Macaulay, L., Shaikh, A. N. and Young, R. (1998), 'Groupware and software engineering: criteria for success', in R. Hazemi, S. Hailes and S. Wilbur (eds.), The Digital University: Reinventing the Academy, London: Springer-Verlag, 245-65.","cites":null},{"id":198474,"title":"Integrating CSCW in a cooperative learning environment to teach information systems',","authors":[],"date":"1996","doi":null,"raw":"Cao, N. V., Laribi, A., Léonard, M., Parchet, O. and Zellweger, C. (1996), 'Integrating CSCW in a cooperative learning environment to teach information systems', Proceedings of the Conference on Integrating Technology into Computer Science Education, ACM Press, 125-29.","cites":null},{"id":452130,"title":"Shaikh and Undo Macaulay Integrating groupware technology into the learning environment Ventana-corporation","authors":[],"date":"2000","doi":"10.3402\/rlt.v9i2.12029","raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2001","abstract":"This paper presents the hard lessons learned from the introduction of groupware technology within a final‐year software engineering module. The module began in 1997 and is now in its fourth year. The paper provides a detailed account of our successes and failures in each year, and describes what the authors now feel is a successful model for integrating groupware into the learning environment. The paper is important because it provides a longitudinal study of the use of groupware within a learning environment and an insight into the key success factors associated with the use of groupware. Success factors relate not only to the technology but also to social factors such as group facilitation and social protocols, to factors associated with monitoring and assessment, and to factors related to the skills development associated with being a member of a global team","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14243.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/352\/1\/ALT_J_Vol9_No2_2001_Integrating%20groupware%20technolo.pdf","pdfHashValue":"e43e64d74b75cceb189e95ea05e42ea688cceb54","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:352<\/identifier><datestamp>\n      2011-04-04T09:13:46Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/352\/<\/dc:relation><dc:title>\n        Integrating groupware technology into the learning environment<\/dc:title><dc:creator>\n        Shaikh, Abdul<\/dc:creator><dc:creator>\n        Macaulay, Linda<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        This paper presents the hard lessons learned from the introduction of groupware technology within a final‐year software engineering module. The module began in 1997 and is now in its fourth year. The paper provides a detailed account of our successes and failures in each year, and describes what the authors now feel is a successful model for integrating groupware into the learning environment. The paper is important because it provides a longitudinal study of the use of groupware within a learning environment and an insight into the key success factors associated with the use of groupware. Success factors relate not only to the technology but also to social factors such as group facilitation and social protocols, to factors associated with monitoring and assessment, and to factors related to the skills development associated with being a member of a global team.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2001<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/352\/1\/ALT_J_Vol9_No2_2001_Integrating%20groupware%20technolo.pdf<\/dc:identifier><dc:identifier>\n          Shaikh, Abdul and Macaulay, Linda  (2001) Integrating groupware technology into the learning environment.  Association for Learning Technology Journal, 9 (2).  pp. 47-63.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776010090206<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/352\/","10.1080\/0968776010090206"],"year":2001,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Integrating groupware technology into the\nlearning environment\nAbdul Naeem Shaikh and Linda Macaulay\nDepartment of Computation, UMIST, Sackville Street, Manchester, M60 IQD\nemail: ans2@co.umist.ac.uk\nThis paper presents the hard lessons learned from the introduction of groupware\ntechnology within a final-year software engineering module. The module began in 1997\nand is now in its fourth year. The paper provides a detailed account of our successes and\nfailures in each year, and describes what the authors now feel is a successful model for\nintegrating groupware into the learning environment. The paper is important because it\nprovides a longitudinal study of the use of groupware within a learning environment and\nan insight into the key success factors associated with the use of groupware. Success\nfactors relate not only to the technology but also to social factors such as group\nfacilitation and social protocols, to factors associated with monitoring and assessment,\nand to factors related to the skills development associated with being a member of a\nglobal team.\nIntroduction\nThe challenge of teaching computer-supported co-operative working (CSCW) and\ngroupware concepts to software engineering students using a 'theory and practice'\napproach was taken by Macaulay, at the Department of Computation, UMIST, United\nKingdom. The first author had assisted from the very beginning and, thus, shared the\nvaluable insights and lessons that came in the introduction of groupware and its\nsubsequent use within the learning environment. Although this challenge was met with a\ndegree of success from the very first year (Macaulay, Shaikh and Young, 1998), attempts\nwere made to learn further lessons each year (in terms of what worked and what did not)\nand to incorporate them into the following year.\nThe 'CSCW and Software Engineering' module, hereafter called 'CSCW module, was\nstructured into four main parts followed by a revision and consolidation session. The four\nparts reflected the groupware's four classifications of time and place (Macaulay et al.,\n47\nAbdul Naeem Shaikh and Linda Macauiay Integrating groupware technology into the learning environment\n1998); that is, synchronous-local (meeting using shared drawing tools), synchronous-\nremote (using video-conferencing), asynchronous-local (using co-ordination tools such as\nLotus Notes), and asynchronous-remote (using email, bulletin board, and Web\ntechnologies). The practical work consisted of a series of software engineering tasks\ncarried out using groupware tools. Each part consisted of lectures, seminars, practical\nwork, assessment and feedback.\nThe aims of the module were:\n1. to expose students to the practical usage of groupware technologies, representative of\nthose which support each of the four situations;\n2. to educate students about the technological, organizational and social issues associated\nwith the application of groupware;\n3. to encourage students to consider the role of CSCW (groupware) within software\nengineering.\nThe objectives were that, at the end of the module, the student should be able:\n1. to compare and contrast groupware technologies;\n2. to select appropriate groupware technologies, depending on the social and\norganizational context;\n3. to evaluate their experiences of using groupware technologies;\n4. to explain the issues associated with groupware use, in terms of setting and adopting\nwork protocols;\n5. to acquire the skills that are required for effective group collaboration and\ncommunication;\n6. to assess the relevance of groupware support to software engineering activities.\nCase studies\nThis section describes an in-depth investigation of the use of groupware with the final-year\nsoftware engineering students for specific software engineering activities. It covers three\ncase studies of the module from 1997 to 1999.\nThe first sub-section describes the methodology adopted by the authors for the\ninvestigation. The second briefly presents the objectives of the different groupware\ntools being used during the module. The next three sub-sections cover the ca.ses them-\nselves, each describing the context, the evaluation instruments used and the evaluation\nresults.\nMethodology\nAccording to Almstrum (1996):\nThe introduction of new technologies increases the importance of evaluation in order to\nuntangle the snarl of factors and influences that impinge on how technology is used in\n48\nALT-} Volume 9 Number 2\ncontext. . . our understanding is so rudimentary that even flawed data are more useful\nthan no data at all, especially if the flaws are recognized. Sometimes just the process of\nevaluation is revealing, whatever the outcome. An unsatisfactory answer can still lead us\nto a better question.\nTo carry through this spirit of Almstrum, the authors adopted an action-research\napproach to understand the issues surrounding the introduction of groupware and its\napplication within a learning environment. Action research is an effective learning process\nthat compares theory and practice. It involves the participation of the investigator in the\ninvestigation itself and relates experiences to prior knowledge (Cao, Laribi, Leonard,\nParchet and Zellweger, 1996; Skok and Wardley, 1998). The first author's active\nparticipation in the case studies included setting and managing the groupware\ninfrastructure, providing the training, and facilitating the students with their use of\ngroupware tools to carry out the assigned software engineering activities.\nFor each case study, both quantitative and qualitative data were collected to enable a rich\nunderstanding of the introduction and application of groupware. Quantitative data\nsources included the system log of groupware tools, questionnaires to assess the work\ngroup characteristics and to measure the awareness of the functionality provided by the\ngroupware tools. Qualitative data sources included ongoing observations of the authors\nduring each session and the study as a whole, the verbal feedback of a number of students\nafter each session, threaded discussions with the students, and the students' final\nassessment reports of groupware experiences and its potential in software engineering.\nGroupware tools used: objectives and use\nBSCW\nBSCW (Basic Support for Co-operative Work) (GMD-FIT, 2000) was used to\nsupport information-sharing and to provide a platform for collaboration between the\nstudents and the authors, and between the students themselves. The BSCW was used as\nfollows:\n• A repository for module documents. For the lecture notes and schedule, for advertising\njobs from employers who were recruiting in CSCW, for details of the research papers\nthat the students were expected to read and for class tests.\n• A platform for threaded discussion. Students were asked to read a research paper prior\nto a class and to consider four or five questions set by the lecturer. Then in the class, the\nstudents were divided into small groups and each group was given one of the questions\nto answer. One member of the group made a short presentation on the result of\nthe group discussion. After the class a second member of the group then 'posted' the\nanswer to the question on the shared workspace. So on BSCW the lecturer had set the\nquestion, a student then gave an answer, then other students and the lecturer responded\nto the answer and so on, thus an online threaded discussion took place. In this way the\ndiscussion on particular topics continued throughout the week and indeed throughout\nthe module.\n• A means of communication through email. The shared workspace was set up\nspecifically for the students and authors on this module. Entry was by password and a\n49\nAbdu! Naeem Shaikh and Linda Macaday Integrating groupware technology into the learning environment\ndirectory of valid email addresses and passwords was maintained. This restricted access\nby anyone outside the module but also made it easier for contact within the module.\nLotus Notes\nThe availability of a limited number of Lotus Notes (IBM, 2000) licences restricted each\nstudent of the module (student numbers varied from 8 to 42 in the three modules) full\naccess to the Lotus Notes system. Therefore, in the first two years, a single session of three\nhours was arranged in which students carried out threaded discussions to brainstorm and\nprioritize the distributed group project issues. However, in the third year of the module, to\ndemonstrate the potential of Lotus Notes as a platform for collaborative system\ndevelopment, the students were given a demonstration of a research prototype being\ndeveloped by a research student using the Lotus Notes platform.\nVideo-conferencing\nThe limitations of video-conferencing facilities, such as multimedia PCs with video\ncamera, also restricted the availability and extended exposure of video-conferencing to the\nstudents. However, a number of short-duration video-conferencing sessions were arranged\nfor the students. In the third year of the module, a special demonstration session of\ndesktop and powerful studio-based video-conferencing was organized at the specially built\nvideo-conferencing facility of Manchester Computing Centre. The objective was to enable\nstudents to compare the experiences with those described in the literature.\nGroupSystems\nThe GroupSystems (Ventana-corporation, 2000) tool was used in the second and third\nyears of the module. The objective was to enable students to gain a first-hand experience of\nworking in electronically facilitated meetings. The task for the students was to help the\nacademic staff to address and select seven issues most critical to the success of the\ndistributed projects.\nEach GroupSystems session started with a brief introduction of the aims of the task and\nthe agenda of the meeting. This was followed by the brainstorming stage in which the\nstudents typed in ideas, read them and then discussed them. Later, different categories were\ncreated and the ideas were classified accordingly. This was followed by the voting stage in\nwhich each student prioritized the list of major issues, that is, categories, according to\nhis\/her opinion. At the end of the session, the final meeting minutes were created, printed\nand shown to the students for quick discussions. A copy of the meeting report was then\nemailed and uploaded on BSCW for further discussions.\nCase Study I: CSCW '97 module\nThe first case study is concerned with the use of a shared Web-based workspace (Macaulay\net ah, 1998), namely BSCW, and the practical demonstration of other groupware tools\n(such as Lotus Notes) in the module. The shared workspace was used as a repository for\nmodule documents, a platform for threaded discussions and a means of communication\nthrough email.\nThe exposure to video-conferencing and Lotus Notes was limited to short practical\nsessions, between one and two hours. A video-conferencing session was arranged using\nCU-SeeMe (White-Pine, 2000) with audio, video, chat and whiteboard. The collaborative\n50\nALT-J Volume 9 Number 2\ntask was created for groups of three students, which involved brainstorming and evaluating\nideas. The brainstorming and evaluation task consisted of each student having a different\npart of a task case study to read on the current manual accounting system of a small\nbookshop. The first stage was to share this information with the other group members and\nrepresent the system by a simple diagram. The second stage was to brainstorm a list of\npossible features of an automated system for the bookshop. The third stage was to\nprioritize this list into three releases, with the most important features going in the first\nrelease.\nThe exposure to Lotus Notes was also limited to a single session of three hours in which a\nthreaded discussion session was carried out. Students were first provided with a short\ntraining session in accessing the Lotus Notes discussion database through a Web browser,\nand then asked to brainstorm and discuss the assigned task. The task was to help the\nacademic staff to address and select seven issues most critical to the success of the\ndistributed projects.\nEvaluation techniques\nNo emphasis was given to the evaluation of the use of Lotus Notes and video-conferencing\nbecause of the limited exposure. However, students were asked to comment on the\npotential of these tools in software engineering in their final assessment reports. The\nBSCW was used throughout the module, and we wanted answers to three questions to\nevaluate its use:\nA) Was a shared workspace the right groupware tool to use for this group?\nB) Did the students know how to use it?\nC) To what extent did they actually use it?\nA) To answer the question:' Was a shared workspace the right tool?\\ the authors used some\nof the work of Roberts (1994). He has developed a technique for assessing the\ncharacteristics of a group and the properties of the information being processed. The\ntechnique takes the form of a questionnaire (see Appendix 1). His work had been extended\nby Bate and Travell (1994) to allow a thorough evaluation of the work group and processes\nin order to choose the appropriate groupware technology. They have recommended ideal\ncharacteristics, based on their experiences, for different groupware technologies, such as\nmessaging and information-sharing. The actual characteristics of the group are compared\nwith the ideal characteristics for using a particular type of groupware.\nThe questionnaire is in four parts. The first part considers the attributes of the group itself,\ngenerally assessing the 'groupness' in terms of cohesiveness, sharing, location, adaptability\nand intelligence. The second part assesses the type of activity being carried out by the\ngroup in terms of autonomy, variability, interaction and thought. The third part is\nconcerned with the properties of the information being processed in terms of quantity,\ntype, confidentiality, sources and flow. The fourth and final part asks questions related to\nthe acceptance and take-up of the technology and is classed as 'business issues'.\nB) To answer the question: 'Did the students know how to use the shared workspace,\nBSCW?\\ we devised a BSCW feature checklist (see Appendix 2). For each feature available\non BSCW we asked whether the students were aware of the feature, how many times they\nused it, and whether they found it easy to use.\n51\nAbdul Noeem Shaikh and Linda Macaulay Integrating groupware technology into the learning environment\nC) To answer the question: 'To what extent did the students actually use BSCW?\\ we used\nthe log of BSCW usage. Each time a user read a message, replied to a message, created a\ndocument, cut or deleted from a document, logged in or off, an entry was made in a\ntransactions log. This was accessed at various points on the module and analysed.\nEvaluation results\nA) The fifteen students were asked to complete the questionnaire, and as recommended by\nRoberts (1994), the average score for each question was plotted onto a 'spider diagram', as\nshown in Figure 1. The continuous lines are the actual results from the CSCW module\nwhereas the dotted lines are the ideal results. The top spider diagram shows the 'groupness'\nof the group and the group activities (the first two parts of the questionnaire). The CSCW\nstudent group appeared to lack cohesiveness and interaction with each other when\ncompared with the ideal for using a shared workspace. The bottom spider diagram shows\nthe properties of the information being shared and the business issues. Here there is a good\nmatch between the ideal and the actual, particularly in terms of the shape of the diagram.\nThe values on the right-hand side of the diagram are lower than the ideal but still follow\nthe same overall shape.\nThe spider diagrams (Figure 1) suggest that the use of shared workspace was on the whole\nan appropriate choice for the CSCW module. However, the lack of cohesiveness within the\ngroup and the low level of interaction between the students may point to some problems.\nThere are also some indications that the quantity of information the students had to share\nwas insufficient.\nB) The feature checklist was completed by the students towards the end of the module. The\nresults indicated that the majority of the students were aware of only 41 per cent of the\nfeatures offered by BSCW. However, they reported that those features they did use were\neasy to use.\nC) The BSCW log analysis, undertaken part way through the module, indicated that only\nabout half of the students used BSCW regularly. However, when students were shown the\nanalysis by the lecturer, the number of accesses increased considerably.\nCase Study 2: CSCW '98 module\nThe second case study is concerned with the second year of the CSCW module. The main\nphilosophy and the groupware infrastructure remained the same as in the previous module.\nHowever, a new groupware tool, GroupSystems, was introduced and a task was designed so\nthat students could gain an experience of electronic meetings. The number of students who\nfinally opted for this module was 42, which showed its popularity. Students were divided\ninto four roughly equal groups. Four tutors were assigned, one to assist each group. The\ntechnical support remained the responsibility of the first author with the added\nresponsibilities of managing the technical support, facilitating his group, and at the same\ntime helping the other tutors to understand the context (based on the author's previous\nyear's experience).\nEvaluation techniques\nThe structure of the module and the use of groupware tools remained the same, and so did\nthe evaluations. The exposure to video-conferencing and Lotus Notes again remained\n52\nALT-J Volume 9 Number 2\nNote:\nDotted Lines = Information Sharing Ch\nContinuous Lines = CSCW'97 Group C\nCote\n5\nInteraction\nAutonomy\nCommitment\nEvolution\nVariability\n\\\n\/\nBought\nKnowledge\n\\\nCriticality \"*\n4.\n.• '\n 3\n-^7\naracteristics\nharacteristics\nvcncss\n*if i i\/vx\nSourc\n5\"\ny\/ 3-\n\\ 2\"\nes -*-\nLocation\n•\n\\\nFlow\nAdaptabilit)\nA\nType\n>\n•\n• \\ ,\n* y\nTime\nSharing\n^ _ ^ \\ Confidentiality\n7 Quantity\nFigure I: CSCW'97 Group characteristics'Spider Diagram'\n53\nAbdul Naeem Shaikh and Linda Macaulay Integrating groupware technology into the learning environment\nlimited and identical to the previous module, except that a single session of one hour for\neach group on GroupSystems was arranged, in which the same task of Lotus Notes was\nrepeated.\nEvaluation results\nSince there were four groups, each group was separately evaluated by using the spider\ndiagram, BSCW feature check list and the BSCW log analysis. The results of the four\nspider diagrams were almost the same as that of the previous module. Each group\ndisplayed the weaknesses in cohesiveness, interaction, information-sharing, criticality of\nthe task and the quantity of information as compared to the ideal sharing. However, the\nfour spider diagrams follow the same overall shape that indicates BSCW as an appropriate\nchoice for the module.\nThe results of the BSCW feature checklist indicated that the majority of students were\naware of only 38 per cent of the features offered by BSCW. This small drop in the\npercentage, as compared to the previous module, may be because of the training provided\nat the start of the module. Some of the students, who attended at the start and received the\ntraining, left the module while new students opted in later. Also, it remained impossible to\norganize another BSCW training session in the middle of the module. Again, students\nreported that those features they did use were easy to use.\nThe BSCW log analysis results presented a similar pattern, of an increase in the use of\nBSCW after the summary was shown in the class which then decreased again. About half\nof the students used BSCW regularly and explored its other features. Since BSCW does not\nprovide a tool for log analysis, it was difficult and time-consuming for other tutors to\nsummarize the students' transactions on the BSCW.\nCase Study 3: CSCW '99 module\nThe final case study is concerned with the third consecutive year of running the CSCW\nmodule. The main philosophy and groupware infrastructure remained similar to the\nprevious years. The surprising feature of this case study was the steep drop in the number\nof students who finally opted for the module, that is, around 40+ students attended in the\nfirst week but later only .8 opted for this module.\nThe main reason for this change was not that the module had lost its popularity, but there\nwas stiff competition from another module that started in the same term by the same\nlecturer, named 'Electronic Commerce: Theory and Practice'. Most students had to choose\njust one, so they decided in favour of the other module.\nThis term we were expecting a high number of students and as such had made the necessary\npreparations, for example, starting with the same four experienced tutors and deciding to\ndelay the training of BSCW till the third week. Also, the BSCW server was installed in the\ndepartment, which helped to address the previous years' problems of slow access and\nnavigation, and which might be one of the reasons for students' low interactions.\nA few major changes in the introduction of groupware technologies this year included the\nfollowing:\n54\nALT-] Volume 9 Number 2\n• A dropping of the practical exercises of video-conferencing and Lotus Notes because of\nthe limitations, as mentioned earlier. Also, instead of these tools having a positive\nimpact, students were getting a poor impression of these tools as very unreliable.\n• The replacement of the short video-conferencing practical sessions with a visit to a\nspecially built video-conferencing laboratory at the Manchester Computing Centre.\n• An extended training and a practical session of GroupSystems.\n• A demonstration of the research prototype developed using the Lotus Notes platform\nby a Ph.D. student.\nBSCW, as usual, remained the main groupware tool of the module. All students were put\nin one group, assisted by one tutor.\nEvaluation techniques\nThe first and the third evaluation questions (A and C) and the instruments used to answer\nthem remained the same. However, instead of using 'BSCW feature check list' to evaluate\nthe use of BSCW, a discussion thread was initiated on BSCW. The aim was to enable\nstudents to record and discuss their immediate experiences (positive or negative) with\nBSCW.\nEvaluation results\nThe spider diagram questionnaire was used at two stages: at the mid-term (after week 6)\nwhen the students had received the BSCW training and had started using it, and at the end\nof the module (Week 10). Figure 2 shows the results of the two stages drawn on a spider\ndiagram, along with the ideal characteristics, to examine the improvements achieved\nbetween mid and end-term (if any).\nThe spider diagram shows that at the mid-term students lacked cohesiveness and\ninformation sharing. However, the interaction with each other was satisfactory, other\nfactors remaining close to the ideal. The bottom spider diagram, which shows the\nproperties of the information being shared and the business issues, again has a weak match\nbetween the ideal and the actual, particularly in terms of the shape of the diagram. The\nvalues on the right-hand side of the diagram are much lower than the ideal. In particular\nthe amount of information, and time that students could make available alongside their\nother commitments, comes very low down.\nThe end-of-term results (thick lines) show marked improvements in different group\ncharacteristics, especially cohesiveness, information-sharing, and amount of information.\nThese results show that the students were able to improve their group characteristics in the\nsecond half of the module. However, the importance (criticality) of the task on BSCW is low\nin both questionnaires, which remains an issue that needs to be addressed. Some students\ncommented that there had been too much workload from other modules' assignments.\nAs in the previous year, the BSCW log analysis was undertaken part-way through the\nmodule. The log analysis showed similar results, with about half of the students using\nBSCW regularly and exploring its other functions. When the log summary was presented\nin the class, the immediate outcome was a sharp increase in students' access to BSCW in\nterms of reading and posting a few articles or replying to the questions, but this slowed\ndown over time until the next log summary.\n55\nAbdul Naeem Shaikh and Unda Macauloy Integrating groupware technology into the learning environment\nNote:\nDotted Lines = Information Sharing Characteristics\nThin Lines = Mid-term & Thick Lines = End-term Group Characteristics\nCohcsiventss\n5T\nVariability\n4.4-. Adaptability\nInteraction\nAutonomy\nCommitment\nEvolution\nCriticality\nTime\nFlow\nSharinj\nIntelligence\nConfidentiality\n7 Qtantily\nfigure 2: CSCW99 mid- and end-term group characteristics\n56\nALT-] Volume 9 Number 2\nDiscussion\nThe exposure of students to video-conferencing and Lotus Notes in the modules remained\nvery limited, because of the unavailability of specialized equipment for video-conferencing\nand a limited number of Lotus Notes licences. Students found difficulty while using audio\nand video, in part due to their high expectations but also because of not using the\nequipment properly, and associated technical problems (for example with audio the\nclipping of words\/sentences or total loss of audio, and with video inconsistent, slow refresh\nwhich resulted in fragmented pictures). The whiteboard was easy to use, and thus was used\nextensively for the task.\nThe change in the video-conferencing session in the third year, by a visit to a video-\nconferencing studio, was welcomed by the students. They reported positively about the\nexperiences gained while observing state-of-the-art demonstrations of remote\nconferencing. Similarly, in the third year, instead of carrying out thread discussions, the\ndemonstration of a research prototype developed using Lotus Notes platform was reported\nas having been useful. The experience of attending electronic-facilitated meetings was\ndescribed as very exciting and instructional. The positive features reported included more\nparticipants and less time required, no dominance, anonymous input, support for the\nthinking process, access to external information, and automated record-keeping. Some\nproblems that students observed included reading an idea or writing while brainstorming,\ntyping mistakes, slight dominance on the basis of typing speed, and the seat configuration\n(the meeting was arranged in a computer laboratory where the seats were located line by\nline, rather than round the table).\nBSCW was used for the entire length of each module, and was found an appropriate tool to\nuse. In the first two years, the BSCW server at GMD Germany was used, which created\nuncomfortably long times for access and navigation within the workspace (sometimes even\nfailures). This problem was addressed in the third year when the BSCW server was installed at\nthe local departmental laboratory. However, it created some unexpected problems later, for\nexample, when the BSCW server crashed near the end of the term and could not get\nimmediate attention from support staff because of other high priority engagements. It\nappeared that some work was needed to make the group more cohesive and communicative\nwith each other prior to its use. Students found the features they tried easy to use, but it\nappears that they would have benefited from a period of more formal training. (Students were\ngiven a quick demonstration of the main features and then left to learn the rest themselves).\nThe analysis of the usage log is helpful for the lecturer in seeing who is participating in\ndiscussions outside formal class time. Once students know that their work is being\nmonitored in this way they tend to increase their amount of usage. However, an increase in\nquantity does not necessarily represent an increase in quality and may be misleading for\nthe lecturer. Also, monitoring alone could not buy in the students' commitment, especially\nas they remained very busy with other modules' assignments.\nAlthough the assessment procedures were modified from 100 per cent examination-based\nto an assessment that included reward for each group's performance, these changes proved\nto be insufficient to overcome significantly the earlier described weaknesses, such as lack of\ncohesiveness and information-sharing, and criticality of the task. Some reward for these\npractical exercises, along with a group's performance, may change the results.\n57\nAbdul Naeem Shaikh and Undo Macauloy Integrating groupware technology into the learning environment\nThe issues experienced in the three case studies are presented in the table below,\ncategorized under the headings of technological, organizational and social issues.\nCategories Issues\nTechnological issues I. Low-cost hardware and software (e.g. PCs, QJ-SeeMe)\n2. Lack of availability of groupware resources (e.g. Lotus Notes and GroupSystems\nlicences)\n3. Lack of availability of appropriate work environment (e.g. round- table meeting\nroom facility for EMS, specially built and arranged studio for video-conferencing)\n4. Lack of robust and high-bandwidth network infrastructure\n5. Unreliability of tools (e.g. audio and video)\n6. Over-expectation with the groupware tools\n7. Different interfaces for each groupware tool (e.g. BSCW and VC)\nOrganizational issues 8. Lack of assessment of practical work (e.g. use of BSCW)\n9. Lack of required commitment and priority given by the support staff while\naddressing the technical problems, which consequently affected the students' general\nimpression of the groupware tools (e.g.'GroupSystems is unreliable!')\n10. Little time for technical and social training\n11. No facilitation training for the tutors\n12. Students were expected to spend some of their personal time in learning the\ngroupware tools\n13.The schedule of running the module in the last term of the degree\nSocial issues 14. A new way of working, with which the students were not familiar\n15. Uneven distribution of work (e.g. some students participated more and\/or\ncontributed better-quality work)\n16. Mistrust of the reliability of the technology (early failures and availability of\nalternative tools)\n17. Higher priorities given by students to other modules' assignments\n18. Asynchronous, which requires work during free convenient time, but most\nstudents could not find the time.\n19.Varying commitments of different members\nTable I: Summary of the issues related to groupware's introduction and application\nLessons learned\nThe aim of these case studies was to gain insights into the introduction of groupware and\nits subsequent application. These insights and understandings are important, since they are\nbased on the authors' personal experiences of facing real problems and then addressing\nthem within existing constraints. The summary below highlights the main lessons drawn\nfrom these case studies and the supporting evidence from the evaluation results (Table 1).\nTechnology\n• There must be equal availability of all the reliable groupware tools among group\nmembers [Issues: 1,2, 5].\n• There should be a robust and high-bandwidth technical infrastructure beneath the\ngroupware and the appropriate environment [Issues: 3,4,16].\n—\nALJ-J Volume 9 Number 2\n• Groupware is an 'off-the-shelf technology and therefore must be configured to meet\nthe needs of the group [Issues: 6, 12].\n• Students, lecturers and (importantly) support staff need training (technical and social)\nin the effective use of groupware technology [Issues: 6,9-11,12,14,18].\nCulture\n• There should be a cohesive reward system based on the group's performance and their\nlevel of practical participation [Issues: 8,15,17,19].\n• There should be a collaborative culture that would make the group members more\ncohesive and motivated [Issues: 15,19].\n• The t echnical support staff and tutors need to accept a different relationship with students,\nworking together to support students and participating in the learning [Issues: 9,16].\nEconomics\n• There must be an investment in the technical and physical infrastructure, e.g. robust\nnetwork, state-of-the-art multimedia PCs, special purpose work set-up, and availability\nof licences. The worst system will limit the entire group's performance [Issues: 1-4].\n• Financial support from the department needs to be justified, maybe through the\ndemonstration of success achieved in the module or by demonstrating improvements in\nstudents' skills.\nPolitics\n• Support for the use of the new technologies is needed at the highest level within a\nuniversity department [Issues: 9,13].\n• Students need to be motivated to use the technology, for example, by making its use\npart of the assessed work [Issues: 8,15,17,19].\nGroupware facilitator\n• A groupware facilitator is needed who can set up the groupware environment, organize\nand manage its use through effective training and ongoing support [Issues: 7, 9,14].\n• To provide explicit and regular feedback to students [Issues: 14,16].\nGroupware success framework\nBased on the lessons drawn from the above case studies along with the literature review, a\nframework was constructed as shown in Figure 3. It is called the 'Groupware Success\nFramework' because it provides a holistic picture of different success elements and their\nrelationships, in order to achieve success with groupware.\nThe groupware success framework has three main layers; the groupware foundation, the\nfacilitation process, and the groupware success. Below is a brief description of each layer.\nGroupware foundation layer\nThe groupware foundation layer embodies the four success elements (or factors) for\ngroupware as suggested by Coleman (1997). These elements can be used to address the\ntechnological, organizational and social issues related to the introduction and application\nof groupware. However, inclusion of these elements will not result in success by\n59\nAbdul Naeem Shaikh and Linda Macaufay Integrating groupware technology into the learning environment\new Roles, SkillsN\nand Culture\nFacilitation Process\n'Groupware\nPolicy\nTraining\/\nSupport\nGroupware Foundation\n''Technology Culture Economics Politics\nFigure 3: Groupware success framework\nthemselves; they need a process to manage them to create a collaborative environment.\nHence the need for the next layer, the facilitation process.\nFacilitation process layer\nThis layer is called the 'facilitation process', because it manages the foundation elements\nand creates the collaborative environment under the supervision of the groupware\nfacilitator. The groupware facilitator is needed because of his\/her ability to address and\nnegotiate technological, organizational and social issues simultaneously. Below is a brief\ndescription of each facilitation process element.\n• Groupware policy. The groupware policy embodies a reward structure based on group\nincentives and measurements, and a collaborative work environment based on the trust\nand willingness of the group to share.\n• Training and support. There should be task-specific technical training in the groupware\nsystem and social support in terms of helping to devise work protocols.\n• Learning. Since groupware brings a new way of working, it is important for the group\nmembers to know the potential benefits (and risks) of these tools to their daily tasks.\nEach group is different and so are the work contexts, so groups need to learn what\nworks for them and to keep modifying their work protocols accordingly.\nGroupware success layer\nThis final layer is dependent on the successful implementation of the two lower layers. It\nrepresents the successful introduction and application of groupware, in terms of new roles\n60\nALT-] Volume 9 Number 2\nfor managers and users, new skills required for efficient use, and the required collaborative\nculture of trust and sharing.\nConclusion\nThis paper has presented the lessons learned from the introduction and application of\nproupware technology within a final-year software engineering module. The paper has\ndescribed the detailed accounts of our successes and failures over three years. Finally, it\nhas described what the authors now feel is a successful model for the integration of\ngroupware into the learning environment.\nAs described in the previous three case studies of the CSCW module, each year the\nmajority of the students agreed that this module had been enjoyable and instructional, but\nthere was a lack of effective collaboration. Therefore, in the fourth year of the CSCW\nmodule, a number of changes were made in the design of the course to accommodate more\ngroup work and a significant part of the assessment marks (25 per cent) were allocated for\nindividual performances in the practical sessions and online discussions along with the\ngroup performance. The fourth year of the module is currently being evaluated and the\nsuccess, or otherwise, of the framework will be the subject of future publications.\nReferences\nAlmstrum, V. L., Dale, N., Berglund A., Granger, M., Little, J. C., Miller, D. M., Petre, M.,\nSchragger, P. and Springsteel, F. (1996), 'Evaluation: turning technology from toy to tool:\nreport of the working group on evaluation', ITiCSE '96, Proceedings of the Conference on\nIntegrating Technology into Computer Science Education, ACM Press, 201-17.\nBate, J. S. J. and Travell, N. (1994), Groupware, Alfred Waller Limited.\nCao, N. V., Laribi, A., Léonard, M., Parchet, O. and Zellweger, C. (1996), 'Integrating\nCSCW in a cooperative learning environment to teach information systems', Proceedings\nof the Conference on Integrating Technology into Computer Science Education, ACM Press,\n125-29.\nColeman, D. (1997), 'Groupware - the changing environment', in D. Coleman (ed.),\nGroupware: Collaborative Strategies for Corporate LANs and Intranets, Prentice Hall, 1-38.\nGMD-FIT (October, 2000), BSCW Home Page, German National Research Center for\nInformation Technology, http:\/\/bscw.gmd.de.\nIBM (October, 2000), Lotus Development Corporation, http:\/\/www.lotus.com.\nMacaulay, L., Shaikh, A. N. and Young, R. (1998), 'Groupware and software engineering:\ncriteria for success', in R. Hazemi, S. Hailes and S. Wilbur (eds.), The Digital University:\nReinventing the Academy, London: Springer-Verlag, 245-65.\nRoberts, M. (1994), 'Creating the human\/technology partnership', in J. S. J. Bate and\nN. Travell (eds.), Groupware, Alfred Waller Limited, 111-32.\nSkok, W. and Wardley, R. (1998), 'A partnership approach in undergraduate business\neducation', Proceedings of the 1998 Conference on Computer Personnel Research, ACM\nPress, 136-44.\n61\nAbdul Naeem Shaikh and Undo Macaulay Integrating groupware technology into the learning environment\nVentana-corporation (October, 2000), GroupSystems.com, http:\/\/www.ventana.com.\nWhite-Pine (October, 2000), CU-SeeMe Networks, http:\/\/www.cuseeme.com.\nAppendix I: Questionnaire 'To assess work group characteristics'\n(Roberts, 1994)\nAttributes of the work group:\nWas the team operating as a cohesive unit? (Cohesiveness)\nActing as individuals [ (1) (2) (3) (4) (5) ] Cohesive Unit\nHow adaptable were the team members to change? (Adaptability)\nDid not welcome change [ (1) (2) (3) (4) (5) ] Welcome change\nHow intelligent or IT literate were members of the team? (Intelligence)\nNo IT awareness [ (1) (2) (3) (4) (5) ] IT awareness\nTo what extent did the team members share their information? (Sharing)\nNo information sharing [ (1) (2) (3) (4) (5) ] Total information sharing\nWere the team members located locally or dispersed across diverse locations? (Location)\nLocated in the same office [ (1) (2) (3) (4) (5) ] Spread over diverse locations\nAnalysis of work group activities:\nDid the process carried out by the work group require much thought? (Thought)\nEasy, repetitive tasks [ (1) (2) (3) (4) (5) ] Complex tasks\nHow much autonomy did the team members have? (Autonomy)\nConformed to prescriptive rules [ (1) (2) (3) (4) (5) ] Adapt working environment\nTo what extent were the team members required to interact with their colleagues?\n(Interaction)\nCan work in isolation [ (1) (2) (3) (4) (5) ] Must interact to complete task\nDid work group activities vary from day to day or were they stable? (Variability)\nSame daily activities [ (1) (2) (3) (4) (5) ] Unpredictable daily tasks\nProperties of the information being processed:\nDid the information arrive from a number of sources? (Sources)\nSole source [ (1) (2) (3) (4) (5) ] Wide range of sources\nWas the information of a variety of types? (Types)\nSame type [ (1) (2) (3) (4) (5) ] Complex range of data types\nWas the information being handled of a private or confidential nature? (Confidentiality)\nPublic information [ (1) (2) (3) (4) (5) ] Strictly confidential information\nWere vast quantities of information processed by the work group? (Quantity)\nSmall amount [ (1) (2) (3) (4) (5) ] Large amount\nWas the information held for long periods of time? (Time)\nHeld for hours [ (1) (2) (3) (4) (5) ] Held for months\/ years\nIs there a recognized path for the flow of information amongst the work group? (Flow)\nRigid information flows [ (1) (2) (3) (4) (5) ] Information takes varying paths\n62\nALT-J Volume 9 Number 2\nBusiness issues:\nWas the process being carried out critical to business success? (Criticality)\nInternal, non-critical process [ (1) (2) (3) (4) (5) ] Critical to business success\nDid the activities of the work group evolve? (Evolution)\nStatic processes [ (1) (2) (3) (4) (5) ] Continually evolving area\nWas management committed to the introduction\/development of work group computing?\n(Commitment)\nReluctant to change [ (1) (2) (3) (4) (5) ] Strongly committed to change\nHow knowledgeable was the work force to the benefits of BSCW? (Knowledge)\nNo knowledge of concepts [ (1) (2) (3) (4) (5) ] Fully understand the benefits\nAppendix 2: BSCW feature\nFEATURE\nACCESS\nADD\nARTICLE\nADD\nDOC\nADD\nFOLDER\nWere you aware\nof this feature?\nYes No\nchecklist\nDid you use it?\nYes No\nHow many times\nhave you used it?\nLess\nthan 5\nSto\n10\nMore\nthan 10\nDid you find\nit easy to use?\nYes No\nAppendix 3: A sample of BSCW log anal\/sis (CSCW 97)\nNjme Log\ndate\n16\/03\/97\nJo»in 13\/04\/97\n17\/06\/97\nTotal\n16\/03\/97\nWong 13\/04\/97\n17\/06\/97\nTool\nPapers\n6\n10\n20\n3\n6\n5\nReac1\nComments Week-\nwise Plan\n3\n7\n3\n4\n10\n2 .\n2\n1\n58\n2\n1\n36\nJobs\n1\n2\n3\n2\n1\nReply\nPapers Comments\n1\n3\n3\n1\n2\n2\n2\n4\n15\n1\n1\n1\n6\nCreated\nPapersComments\n1\n3\n2\n1\n2\n1\n2\n2\nII\n1\n5\nCut\nPapers Comments\n1\n1\n2 1\n5\n1\n1\n1\nDelete\nPapers Comments\n1\n2 1\n4\n1\n63\n"}