{"doi":"10.1007\/s00170-007-0968-1","coreId":"140449","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1970","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1970","10.1007\/s00170-007-0968-1"],"title":"Patterned crack-free PZT thick films for micro-electromechanical system\napplications","authors":["Dauchy, Florent","Dorey, Robert A."],"enrichments":{"references":[{"id":37938567,"title":"{1 0 0}-Textured, piezoelectric Pb(Zrx, Ti1-x)O3 thin films for MEMS: integration, deposition and properties, Sensors and Actuators,","authors":[],"date":"2003","doi":"10.1016\/s0924-4247(03)00090-6","raw":"Ledermann N., Muralt P., Baborowski J., Gentil S., Mukati K., Cantoni M., Seifert A., Setter N., (2003) ,{1 0 0}-Textured, piezoelectric Pb(Zrx, Ti1-x)O3 thin films for MEMS: integration, deposition and properties, Sensors and Actuators, A 105: 162–170","cites":null},{"id":37938568,"title":"Characteristics of resist films produce by spinning,","authors":[],"date":"1978","doi":"10.1063\/1.325357","raw":"Meyerhofer D., (1978), Characteristics of resist films produce by spinning, J. Appl. Phys., 49 (7): 3993-3997","cites":null},{"id":37938572,"title":"Effect of porosity on the ferroelectric properties of sol-gel prepared lead titanate thin films, Thin Solid Films,488:","authors":[],"date":"2005","doi":"10.1016\/j.tsf.2005.04.034","raw":"Zhang Q., Corkovic S., Shaw C.P., Huang Z., Whatmore R.W., (2005), Effect of porosity on the ferroelectric properties of sol-gel prepared lead titanate thin films, Thin Solid Films,488: 258-264","cites":null},{"id":37938570,"title":"Effect of sintering aid and repeat sol infiltration on the dielectric and piezoelectric properties of a composite thick film,","authors":[],"date":"2002","doi":"10.1016\/s0955-2219(02)00062-6","raw":"Dorey R.A., Stringfellow S.B., Whatmore R.W., (2002), Effect of sintering aid and repeat sol infiltration on the dielectric and piezoelectric properties of a composite thick film, J. Euro. Ceram. soc, 22: 2921-2926","cites":null},{"id":37938565,"title":"Fabrication of multilayer 2D ultrasonic transducer microarrays bygreen machining,","authors":[],"date":"2004","doi":null,"raw":"Liliehorn T. and Johanson S., (2004), Fabrication of multilayer 2D ultrasonic transducer microarrays bygreen machining, J. of Micromaching and Microengineering, 14: 702-709","cites":null},{"id":37938569,"title":"Ferroelectric thin and thick films for Microsystems,","authors":[],"date":"2003","doi":"10.1016\/s1369-8001(02)00085-9","raw":"Whatmore R.W., Zhang Q., Huang Z., Dorey R.A., (2003), Ferroelectric thin and thick films for Microsystems, Materials Science in Semiconductor Processing, 5: 65-76","cites":null},{"id":37938571,"title":"Lead germanium oxide sinterassisted PZT composite thick films,J.","authors":[],"date":"2003","doi":"10.1016\/s0955-2219(02)00417-x","raw":"Duval F.F.F.C., Dorey R.A., Zhang Q., Whatmore R.W., (2003), Lead germanium oxide sinterassisted PZT composite thick films,J. Euro. Ceram. Soc, 23: 1935–1941","cites":null},{"id":37938566,"title":"Processing and Characterization of Piezoelectric Thick Films Screen-Printed on Silicon and Glass-Ceramic Substrates,","authors":[],"date":"2003","doi":"10.1080\/10584580390230606","raw":"Simon Seveyrat L., Gonnard P., (2003), Processing and Characterization of Piezoelectric Thick Films Screen-Printed on Silicon and Glass-Ceramic Substrates, Integrated Ferroelectrics, 50: 1-18","cites":null},{"id":37938564,"title":"Tape Casting of piezoceramic\/polymer composites,","authors":[],"date":"1999","doi":null,"raw":"Scharzer S.and Roosen A., (1999), Tape Casting of piezoceramic\/polymer composites, J. Euro. Ceram soc., 19: 1007-1010","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-05-01T00:00:00Z","abstract":"The fabrication and structuring of multilayer-thick film piezoelectric (PZT-lead\nzirconate titanate) structures, using composite sol-gel techniques and wet\netching is described. The composite sol-gel technique involves producing a PZT\npowder\/sol composite slurry which when spun down, yields films a few micrometres\nthick. Repeated layering and infiltration has been used to produce PZT films\nbetween 10 and 40 μm thick. Due to the low firing temperature (<720°C), it has\nalso been possible to produce PZT films with embedded thin (ca. 100 nm thick)\nmetal electrodes. The PZT thick films have also been structured using a wet\netching technique. Examples of features and cavities with lateral dimensions in\nthe order of tens of micrometres are presented. The ability to fabricate and\nstructure thick functional films with embedded metal electrode structures offers\nthe possibility to create novel micro-device structures suitable for use in\nmicro-electromechanical systems (MEM","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140449.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1007\/s00170-007-0968-1","pdfHashValue":"ee69046c78df648a4815b25721e7fc826be496ec","publisher":"Springer Science   Business Media","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1970<\/identifier><datestamp>2014-09-04T10:25:36Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Patterned crack-free PZT thick films for micro-electromechanical system\napplications<\/dc:title><dc:creator>Dauchy, Florent<\/dc:creator><dc:creator>Dorey, Robert A.<\/dc:creator><dc:subject>PZT<\/dc:subject><dc:subject>MEMS<\/dc:subject><dc:subject>Patterning<\/dc:subject><dc:description>The fabrication and structuring of multilayer-thick film piezoelectric (PZT-lead\nzirconate titanate) structures, using composite sol-gel techniques and wet\netching is described. The composite sol-gel technique involves producing a PZT\npowder\/sol composite slurry which when spun down, yields films a few micrometres\nthick. Repeated layering and infiltration has been used to produce PZT films\nbetween 10 and 40 μm thick. Due to the low firing temperature (<720°C), it has\nalso been possible to produce PZT films with embedded thin (ca. 100 nm thick)\nmetal electrodes. The PZT thick films have also been structured using a wet\netching technique. Examples of features and cavities with lateral dimensions in\nthe order of tens of micrometres are presented. The ability to fabricate and\nstructure thick functional films with embedded metal electrode structures offers\nthe possibility to create novel micro-device structures suitable for use in\nmicro-electromechanical systems (MEMS<\/dc:description><dc:publisher>Springer Science   Business Media<\/dc:publisher><dc:date>2011-09-08T09:28:01Z<\/dc:date><dc:date>2011-09-08T09:28:01Z<\/dc:date><dc:date>2007-05-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>F. Dauchy, R. A. Dorey, Patterned crack-free PZT thick films for micro-electromechanical system applications, International Journal of Advanced Manufacturing Technology, 2007, Vol.33 No 1-2, pg 86-94<\/dc:identifier><dc:identifier>0268-3768<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1007\/s00170-007-0968-1<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/1970<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0268-3768","0268-3768"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["PZT","MEMS","Patterning"],"subject":["Article"],"fullText":"F. Dauchy, R.A. Dorey, Patterned crack-free PZT thick films for micro-electromechanical\nsystem applications, Int J Adv Manuf Technol, 2007, 33, 1, 86-94\nPatterned crack free PZT thick films for micro electromechanical system applications\nF. Dauchy, R.A.Dorey\nMicrosystems and Nanotechnology Centre, School of Industrial and Manufacturing Science, Cranfield\nUniversity, Cranfield,\nBedfordshire. MK43 OAL, UK\nAbstract\nThe fabrication and structuring of multilayer thick film piezoelectric (PZT – lead zirconate titanate)\nstructures, using composite sol gel techniques and wet etching, will be described.\nThe composite sol gel technique involves producing a PZT powder\/sol composite slurry, which when\nspun down yields films a few micrometers thick. Repeated layering, and infiltration, has been used to\nproduce PZT films between 10 and 40µm thick. Due to the low firing temperature (<720ºC) it has also\nbeen possible to produce PZT films with embedded thin (ca 100nm thick) metal electrodes.\nThe PZT thick films have also been structured using a wet etching technique. Examples of features and\ncavities with lateral dimensions in the order of 10’s of micrometers are presented.\nThe ability to fabricate and structure thick functional films, with embedded metal electrode structures,\noffers the possibility to create novel micro-device structures suitable for use in micro electromechanical\nsystems (MEMS)\nKeywords: sol gel, thick film, MEMS, multilayer\n1. Introduction\nFerroelectric thick films can be developed for inclusion in MEMS technology for the fabrication of\ntransducers working in thickness mode. These devices can be made from polycrystalline ceramics. This\ninvolves two fabrication steps: preparation of the green ceramic and sintering. A PZT powder\/fluid\n(water, oil or alcohol) slurry allows one to deposit films with thickness ranging from micrometers to\nmillimetres via several methods, such as, tape casting (up to millimetres)1,2, and screen printing (up to\nhundreds of microns).3,4 Unfortunately the powder route must have a high temperature sintering stage,\ntypically above 1200°C, and also presents many technical difficulties to achieve the fabrication of\nuniform films tens of micrometers thick.\nFor piezoelectric applications wet chemical methods (sol-gel) have been used because of the very low\nsintering temperature, 600°C, which allows films to be integrated onto substrates such as silicon. A\nsecond advantage is the grain uniformity in terms of size distribution and composition that this technique\ngives, which is a key factor needed to achieve reproducibility of piezoelectric characteristics. However, a\npure sol-gel technique only gives films with a maximum thickness of ca.3 m.5\nThe main challenge is to fabricate PZT thick films with a thickness ranging from 10 to 40 m and to keep\nthe advantage of the low sintering temperature of the sol-gel method.\nA mix between the two techniques presented allows these conditions to be met. A composite PZT\nPowder\/Sol slurry used in our work can be spun to achieve different thicknesses ranging from 2 m up\nto 35 m with a sintering process at 720°C. This is a good trade off between a powder route, and a pure\nsol gel procedure. The thickness of 35 m for single or multi layer structures are state of the art and are\nsuitable for several new industrial applications such as transducers for high frequency imaging using the\nthickness mode of excitation.\nThe spin coating technique was chosen for deposition, because it offers a greater flexibility in thickness,\neven if this range of thickness for spun PZT films have not previously been made.6\nThis paper summarises the process required to go from the sol gel through to the final shaped\nstructures.\n2. PZT sol-gel and composite slurry\n2.1. PZT sol-gel7\nThe general formula of the sol used was: Pb1.1 [Nb0.02Sb0.02Mn0.02(Ti0.48Zr0.52)0.94]O3.\nFigure 1 shows the fabrication steps of the sol. The 2-methoxy-ethanol and the lead-acetate solution\nwere mixed together and the resulting solution was refluxed under N2 to drive the hydrolysis\npolymerisation. At this stage the solution was cloudy. The synthesis was completed by a long final\ndistillation to remove the by-products. A first plateau is observed at 90°C which corresponds to the\nF. Dauchy, R.A. Dorey, Patterned crack-free PZT thick films for micro-electromechanical\nsystem applications, Int J Adv Manuf Technol, 2007, 33, 1, 86-94\nboiling point of propanol used as a solvent to stabilize the zirconium propoxide. A second plateau is\nobserved at 102-104°C to remove, physically, the water. The sol becomes yellow and clear. The\namount of solution removed, during the final distillation, is replaced by the same amount of 2-methoxy-\nethanol to reach a concentration of 1.1M. The sol is filtered and stabilized by the addition of ethyl-\nglycol.8\nFig. 1. Flow Chart showing the fabrication steps used to produce the PZT sol\n2.2.Composite slurry\nA sol-gel method combined with PZT powder will be useful for thick film deposition. During the sintering\nprocess atomic diffusion in the PZT powder grain occurs to minimise the surface energy which promotes\ncrystal bonding at the interface between two adjacent particles. The added sol will increase the driving\nforce of the system due to the presence of nanoscale particles and so lower the required sintering\ntemperature. In addition the sol will also act like a glue binding the larger particles together and to the\nsubstrate.\nWith a pure sol gel route the substrate, generally a Si\/SiO2\/Pt wafer, will be the “seed” inducing the\ncrystallisation. In the case of the composite sol gel route, each microsize PZT grain will act as a site for\ncrystallization.\nThe composition of the composite slurry is summarised in table 1. All of the components were mixed\ntogether under nitrogen in a 125ml flask. The slurry was then ball-mixed for 24 hours to produce a stable\nsuspension. The slurry obtained has a density of 2.2 g.ml-1.\nTo enhance densification of the film a small amount of sintering aid Cu2O-PbO was added. This\nsintering forms a low temperature liquid phase during the sintering process, and accelerates the atomic\ndiffusion at the grain surface9, further increased the density of the ceramic. The composite slurry is\nsintered at 720°C, following patterning.10\nTable 1\nComposition of the composite slurry\nPZT Powder (PZ 26, Ferroperm, DK) 45 g\nDispersant KR 55 (Ken React Lica 38, IPA isooctylalcohol) 0.9g\nPZT Sol 30ml\nSintering aid Cu2O\/PbO 0.3105g\/1.926g\nZirconia ball milling media 200g\nLead Acetate trihydrate (52.5g) +\nAcetic Acid 99.8 wt% (30ml)\nDistil to remove water from system\n(20 ml off)\nTitanium isopropoxide 99.99 wt% (17.685g)+\nZirconium propoxide 76 wt% (27.328g)+\n2-Methoxyethanol 99.8 wt% (50ml)+\nDopants:\nNiobium (V) Ethoxide 98 wt% (0.629g)+\nAntimony (III) Ethoxide (0.508g) + Manganese\n(III) acetate 98 wt% (0.342g)\nUnder nitrogen atmosphere\nReflux for 3 hours\nVacuum distil\nAdd Ethyl-glycol 99.8 wt% (5g)\n+ Vacuum filtration (0.3 µm)\nMix\nReflux for 3 hours\nUnder nitrogen atmosphere\nReflux for 3 hours T=104 °C\nLead Acetate solution 2-Methoxy-Ethanol solution\nF. Dauchy, R.A. Dorey, Patterned crack-free PZT thick films for micro-electromechanical\nsystem applications, Int J Adv Manuf Technol, 2007, 33, 1, 86-94\n3. PZT Deposition\nDuring the sintering process some Pb, from the PZT layer, diffuses into the silicon wafer substrate, to\nform lead silicate which is liquid at the sintering temperature. (Fig 2)\nFig 2. Holes produced at the Si\/PZT interface due to diffusion of the Pb into the Si substrate during\nsintering.\nTo prevent this undesirable reaction a ZrO2 diffusion barrier (table 2) was first spun on the silicon\nsubstrate.\nTable 2\nComposition of the ZrO2 diffusion barrier sol\nZrO2 diffusion barrier Qty\nZirconium propoxide (75 wt % in propanol) 4.344 g\nAcetic acid (at 99.8 wt %) 3 mL\nEthanol anhydrite 47 mL\nThese components were mixed under nitrogen and stirred for 1 hour. The sol was spun at 3000 rpm for\n30 seconds, and dried at 350°C. This stage was repeated three times. The film was then sintered at\n800°C for 10 min. The final thickness is 60 nm.\nSputtered Pt bottom electrodes were then shaped with a lift off process. The photoresist S1818 was\nspun at 4000 rpm, dried for 90 seconds at 115°C, and partially exposed under UV light for 10 seconds,\nand then developed in MF319 developer.\nAn adhesion layer of PZT sol was spun before spinning the composite slurry in order to avoid any\ndelamination. This step was done for all films thicker than 21 m.\nPZT was deposited by fully coating the substrates with the composite suspension and then spinning at\n2000 rpm for 30s. The deposited film was then dried at 200°C for 60s and pyrolysed at 450°C for 30s to\nremove all the organic components..\n4. Infiltration steps\nThe composite slurry process, even when using the sintered aid, still results in a low density film after\nsintering. This was overcome by repeated sol infiltration to increase the green density prior to sintering.\nAn infiltration step consists of spinning a layer of a sol, diluted in 2 methoxy-ethanol (2ME) solution, on\nthe green ceramic (1:1 sol: 2 ME). The added sol will directly crystallise in the pore and fill them. This\nincrease in density is shown in figure 3 and confirmed by an increase in of the relative permittivity with\nthe number sol infiltrations. (Fig. 4)\nEach infiltration step was followed by drying and pyrolysis treatments, at 200°C and 450°C respectively\nbefore the next infiltration step. The next composite layer was then deposited and the process was\nrepeated until the desired thickness was obtained.\na) 2 sol infiltrations b) 3 sol infiltrations\nF. Dauchy, R.A. Dorey, Patterned crack-free PZT thick films for micro-electromechanical\nsystem applications, Int J Adv Manuf Technol, 2007, 33, 1, 86-94\nFig. 3. SEM images of the surface of a PZT film showing how increased sol infiltration results in a\nreduction of porosity.\nThe sample notation use throughout this article is x [yC + zS], where:\n“y” represents a number of composite layers spun,\n“z” represents the number of infiltrations per “yC” composite layer,\nand “x” represents the number of times the unit [yC + zS] is realised to achieve the required thickness.\nFig 4: Variation in relative permittivity and dielectric loss of 4[C+xS] as a function of sol infiltration\n5. Unpatterned crack free thick film\n5.1 Thick film [C+4S]\nThe substrate, Si\/SiO2\/ZrO2\/PZT sol, enabled 16 composite layers to be spun to achieve has thickness\nof 35 m. This thickness achieved is state of the art for a spin coated PZT ceramic, and not previously\nhas been reported. The figures 5 to 7, represent the evolution of the surface with the thickness. The\nsurface finish of films composed of 12 or more composite layers shows some cracking. The width of\nthese cracks can be reduced to 10’s of nanometers by covered the surface with a pure sol (Fig.7b). This\nstep allows this ceramic to be used for MEMS applications as a continuous top electrode, as thin as\n100nm, can be sputtered on the surface.\nFig 5. SEM micrograph of 10m PZT thick film composed of 4[C+4S], cross section (a), surface (b).\nSi AirPZT\na b\n300.00\n400.00\n500.00\n600.00\n700.00\n0 1 2 3 4\nnumber of sol infiltration steps per composite layer\nR\nel\nat\niv\ne\npe\nrm\nitt\niv\nity\n0.01\n0.02\n0.03\n0.04\nD\nie\nle\nct\nric\nlo\nss\n--\n-o\n--\n-\nF. Dauchy, R.A. Dorey, Patterned crack-free PZT thick films for micro-electromechanical\nsystem applications, Int J Adv Manuf Technol, 2007, 33, 1, 86-94\nFig 6. a) SEM micrograph of a 25 m PZT thick film composed of PZT 12[C+4S]. The cross section\nhighlights the boundary between composite layers caused by the infiltration stage, b) Light microscope\nimage of surface of this thick film showing increase in scale of cracking.\nFig 7. SEM micrograph of 35m PZT thick film composed of 16[C+4S] a) cross section, b) surface, c)\nsurface of the same film coated with 1 layer of pure PZT sol showing reduction in crack width.\nThe cross section (Fig 6a) reveals that some of the 4 infiltration steps do not completely infiltrate the\ncomposite layer. Some of the infiltration sol remains on the surface of each composite layer, which\nmarks the observable separation between the two (Fig 6). This effect is also observable during the wet\netching process: Fig 14 shows a stepped pyramidal shape due to the presence of this interlayer sol.\nThe work presented by [Zhang, et .al, 2005] on pure sol, demonstrates that the interfacial sol layer is far\ndenser than the composite ceramic. These density differences may induce a considerable amount of\ntensile stress due to the differential shrinkage during the drying stage, which may lead the composite\nfilm to crack and delaminate.\nExperimentally, the cracks appeared during the drying stage at 200°C, and especially when the\ninfiltration sol did not totally infiltrate the PZT, indicating that the drying \/ shrinkage of the pure sol plays\na significant role in this process.\nPZTAir Si\na\nExample of infiltration sol\nremaining at the interface\nbetween two composites\nlayers\n40µm b\na\nSiPZTAir\nb\nc\nF. Dauchy, R.A. Dorey, Patterned crack-free PZT thick films for micro-electromechanical\nsystem applications, Int J Adv Manuf Technol, 2007, 33, 1, 86-94\nA trade off between dielectric properties and a better surface finish can be made. To do so, some\ninfiltration stage causing the interfacial PZT layer can be eliminated along with the accompanying stress.\nIt will lead to a crack free thick PZT film.\n5.2 Thick film [2C+4S]\nThe process [2C+4S] corresponds to two infiltration steps per composite layer. The infiltration sol\nremaining between two composite layers, observable in Fig 7, is not observable with the new process\n(Fig 8). The cracking situation is improved significantly even for a thick layer of 28µm, where the surface\nfinish remains better than for a 10µm thick film for the first process [C+4S]. Such a reduction in cracking\nwould arise either due to a reduction in stress or an increase in material strength. However, as strength\nis expected to decrease with increasing porosity, it s reasonable to assume that the cracking is\neliminated in these (more porous) films due to a reduction in stress. (Fig 8 and 9)\na) 5[2C+4S] 22m b) 7[2C+4S] 28m\nFig 8. SEM micrograph of surface finish of the process x[2C+4S] for 2 different thicknesses of film\nshowing a marked reproduction in cracking in comparison to x[C+4S] films. a) with 100nm of Pt\nsputtered the surface, b) virgin PZT surface\nFig 9. SEM micrograph of cross sections of x[2C+4S] film, showing the film to be more porous than the\n[C+4S] process shown on fig 6.\nIt is expected that these ceramics contain higher porosity than the x[C+4S] ceramics, as they have\nbeen infiltrated to a lesser degree. As a consequence the relative permittivity is reduced from 700 to\n7[2C+4S] 28 m\nSi\n6 [2C+4S] + 4infiltratrions (22m)\nSi PZT Air\nPZT Air\nF. Dauchy, R.A. Dorey, Patterned crack-free PZT thick films for micro-electromechanical\nsystem applications, Int J Adv Manuf Technol, 2007, 33, 1, 86-94\n630-600. However, this process represents a real breakthrough regarding the thickness (28m) of such\nthick films, as well as for the surface finish achievable. As an example of the quality of surface finish\nachievable with this process, Fig. 8 a) represents a 22m crack free thick PZT film with a 100nm\nelectrode sputtered on its surface, showing that a continuous electrode can be deposited.\n6. Multilayer PZT thick film\nThe composite sol gel process offers the potential for great adaptability for thick fabrication, particularly\nof shaping the final device. An example of the adaptability is the PZT thick film multilayer structure, with\nembedded electrode, as shown in Fig 10.\ntop Pt electrode\nBottom Pt electrode\nPZT\nmiddle Pt electrode\n35m\nFig 10. Schematic and SEM image of a multilayer PZT thick film 14[C+4S] with embedded electrode\nafter the 7th composite layers.\nThis device is composed of 2 layers each made up of 7 spun composite layers infiltrated four times. The\ntop, bottom and middle Ti (9nm) \/Pt (100nm) electrode were deposited by sputtering.\nThe multilayer process shows a great adaptability in being able to deposit multiple thin (100nm thick)\nmetallic embedded electrodes in a PZT Structure.\n7. Patterning\n7.1. Wet etching solution\nThe solution used to etch the green ceramic was a HF\/ HCL solution with the following composition [HF\n(0.5 vol%), HCl (4.5 vol%), H2O (95 vol%)]. To be efficient the solution was held at 60°C during the\nprocedure.\n7.2. Patterning PZT thick films via wet etching\n7.2.1 Wet etching process of x[C+4S] PZT thick films\nConsidering the isotropy of the PZT thick film, a wet etching technique should etch, at the same rate in\nall the directions, which explains the etching slope, called undercuts, shown in Fig 11 and 12. The\nimmersion time in the etch solution was dependent on the thickness of the PZT. (Table 3)\nTable 3\nPZT etch rate for different thicknesses of PZT film etched (HF (0.5 vol%), H2O (95 vol%), HCl (4.5 vol%)\nTime to etch through thickness thickness etch rate\n7min 21 m 3 m\/min\n12min 30 m 2.5 m\/min\n15min 35 m 2.3 m\/min\nThere was an intermediate product produced during the process. When the PZT was etched a white\nlayer was left on the surface. An XRD study on wet etching done by Zheng 11 indicated that it was\nPbClF. In order to remove this residue, the sample was cleaned using water in an ultrasonic bath for 15\nminutes at the end of the etching process.\nTable 3 reveals that thicker films with more residue show reduced etching rates indicates that the PbClF\nresidue acts as a barrier which slows the etching process.\nThe edge resolution, as well as the etching slope, observed in all of the present pictures, seems to be\ndependent of the thickness and uniformity of the spun photoresist and the immersion time in the HF\nF. Dauchy, R.A. Dorey, Patterned crack-free PZT thick films for micro-electromechanical\nsystem applications, Int J Adv Manuf Technol, 2007, 33, 1, 86-94\nsolution. The spinning process of the photoresist was conducted in one stage for the sample shown in\nFig 11 and two stages for that shown Fig 12. For the 21m thick sample, the resist was spun at\n4000rpm for 1 min, while for the 30m thick sample, the resist was spun first at 600 rpm for 1min and\nthen at 4000rpm for 1min. The undercut seems to be reduced in the second case, Figure 11 shows an\netching slope of 0.7, and Figure 12 shows a slope of 1. The thicker the resist is the longer the\nphotoresist takes to be removed by the HF solution, and the sharper the etching slope. achieved\nFig. 11. SEM micrograph of a 21 m PZT thick film, patterned with features at the base of 10 m.\nFig. 12. SEM micrograph of a 30 m PZT thick film, patterned with features of 50 m at the surface and\n10 m at the base.\nFig 11 and 12 represent the typical gap between two devices achievable by this wet etching technique.\nA kerf of ~60 m between surfaces is shown in Figure 12 for a 30 m PZT thick film. This result is the\nfinest result achievable with a wet etching technique considering the thickness and the isotropy of the\nfilm. The gap of 10m between features at the silicon face is also of a technical interest (Figure 11).\nA hole with 150m side at the surface of a 35 m thick film shows the capability that the wet etching\ntechnique can achieve considering that: (Figure 13)\n- The photoresist patterning mask is designed with a hole with 110m long sides\n- A minimum of 35 m undercuts with an isotropic wet etching technique\nF. Dauchy, R.A. Dorey, Patterned crack-free PZT thick films for micro-electromechanical\nsystem applications, Int J Adv Manuf Technol, 2007, 33, 1, 86-94\nFig 13. SEM micrograph of a 150 m hole PZT in a 35 m thick PZT film produced using mask with a\n110m aperture. Defect near the bottom left of the hole is due to delamination of the photoresist and\nsubsequent over etch.\nFig 14. SEM micrograph of a 21 m PZT thick film, patterned to produce a 10 m wide feature\n7.2.2. Wet etching of PZT thick film [2C+4S]\nThe same wet etching process was tested on [2C+4S] thick films to determine how the absence of the\nsol interlays affects the etch process. (Table 4)\nF. Dauchy, R.A. Dorey, Patterned crack-free PZT thick films for micro-electromechanical\nsystem applications, Int J Adv Manuf Technol, 2007, 33, 1, 86-94\nTable 4 HF etching rate of the PZT thick film lead by the [2C+4S] process\nTime thickness etch rate\n5[2C+2S] 5.30min 22 m 4.2 m\/min\n6[2C+2S] +4Inf 6.15min 22 m 3.6 m\/min\n7[2C+2S] 6.50min 26 m 4 m\/min\nThe data comparison presented in table 3 and 4 demonstrates a faster etching rate for the second\nprocess than for the first. This result is consistent with the porosity assumption made in section 5 where\nthe porosity increases when the film is less infiltrated. With more porous film the HF solution can have a\nlarger reaction surface with the PZT.\nHowever, the “stepped pyramidal” etching shape observable in the first process (Fig 14, 12[C+4S]) is no\nlonger observed with the second process (Fig 15, 6[2C+4S]) as the interlayer sol is no longer present\n(see section 5.2). The higher density of the extra sol layer observed on figure 14 temporarily slows the\nthrough thickness etching rate (acting like a very thin protection layer against the etching solution)\nresulting in the stepped structure.\nFor a similar thickness, the etching slope is steeper for the first process than for the second one Fig. 15.\nBoth the porosity and the interfacial sol layer are responsible of this difference. Unfortunately as these\ntwo variables change together it is impossible to tell which has a major effect through this experiment.\nFig 15. Comparison between the etching definition of the two process, [2C+4S] and [C+4S]. The\nsamples are both 21m thick\nThis great adaptability of the spin coated thick composite PZT layer allows a wide range of shapes to be\nrealised, some examples given are state of the art and can find application in various areas. The cross,\nshown in Fig 14, reveals the possibility of patterning a 10 m wide bar of 21m PZT thick film, which is a\nsignificant achievement over previous techniques. Both the surface finish and dielectric properties are\ntuneable for any thickness up to 40µm.\nThese processes could find many applications in MEMS fabrication for devices such as cantilevers,\nswitches and high frequency transducers.\n8. Conclusion\nPZT films up to 35 m thick were fabricated, using a composite sol gel route combining a PZT powder\nand a PZT sol gel. The maximumtemperature for the process was 720°C.\nA demonstration of single and multilayer structures was given to show the flexibility of this technology. A\ncrack free surface finish of a 28m thick film reveals the adaptability of the spin coating technique to\nfabricate thick films.\nThe wet etching technology revealed the possibility of a great adaptability to pattern and shape\ninnovative devices such as bars 10 m wide of 21m PZT thick film. The results open the way to a wide\nrange of new industrial application requiring small features and\/or multilayer PZT thick film with\nembedded electrodes.\nAcknowledgements\nDr. S. A. Rocks, R. V. Wright, EC MUSTWIN project (NMP2-CT-2003-505630), Royal Academy of\nEngineering \/ EPSRC\n6[2C+4S] +4 infiltrations 12[C+4S]\n38µm 12µm\n13µm\n50µm\n17µm\n16.5µm\nF. Dauchy, R.A. Dorey, Patterned crack-free PZT thick films for micro-electromechanical\nsystem applications, Int J Adv Manuf Technol, 2007, 33, 1, 86-94\nReferences\n[1] Scharzer S.and Roosen A., (1999), Tape Casting of piezoceramic\/polymer composites, J. Euro.\nCeram soc., 19: 1007-1010\n[2] Liliehorn T. and Johanson S., (2004), Fabrication of multilayer 2D ultrasonic transducer microarrays\nbygreen machining, J. of Micromaching and Microengineering, 14: 702-709\n[3] Simon Seveyrat L., Gonnard P., (2003), Processing and Characterization of Piezoelectric Thick Films\nScreen-Printed on Silicon and Glass-Ceramic Substrates, Integrated Ferroelectrics, 50: 1-18\n[4] Cannell D. and Trigg P., (1990), Advanced Ceramic Processing and Technology, chap 4 Processing\nof electronic ceramics, pp 95\n[5] Ledermann N., Muralt P., Baborowski J., Gentil S., Mukati K., Cantoni M., Seifert A., Setter N.,\n(2003) ,{1 0 0}-Textured, piezoelectric Pb(Zrx, Ti1-x)O3 thin films for MEMS: integration, deposition and\nproperties, Sensors and Actuators, A 105: 162–170\n[6] Meyerhofer D., (1978), Characteristics of resist films produce by spinning, J. Appl. Phys., 49 (7):\n3993-3997\n[7] Livage J. and Sanchez C., 1992, Sol-gel chemistry, Journal of Non-Crystalline Solids, 8: 145\n[8] Whatmore R.W., Zhang Q., Huang Z., Dorey R.A., (2003), Ferroelectric thin and thick films for\nMicrosystems, Materials Science in Semiconductor Processing, 5: 65-76\n[9] Dorey R.A., Stringfellow S.B., Whatmore R.W., (2002), Effect of sintering aid and repeat sol\ninfiltration on the dielectric and piezoelectric properties of a composite thick film, J. Euro. Ceram. soc,\n22: 2921-2926\n[10] Duval F.F.F.C., Dorey R.A., Zhang Q., Whatmore R.W., (2003), Lead germanium oxide sinter-\nassisted PZT composite thick films, J. Euro. Ceram. Soc, 23: 1935–1941\n[11] Zheng K., Lu J., Chu J., (2003), Study on wet-etching of PZT thin film, Microprocesses and\nNanotechnology Conference International 2003. Digest of Papers, 29-31: 248-249\n[12] Zhang Q., Corkovic S., Shaw C.P., Huang Z., Whatmore R.W., (2005), Effect of porosity on the\nferroelectric properties of sol-gel prepared lead titanate thin films, Thin Solid Films, 488: 258-264\n"}