{"doi":"10.1177\/1049732308322588","coreId":"103014","oai":"oai:epubs.surrey.ac.uk:2682","identifiers":["oai:epubs.surrey.ac.uk:2682","10.1177\/1049732308322588"],"title":"Team meetings in specialist palliative care: Asking questions as a strategy within interprofessional interaction","authors":["Arber, A"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-10-01","abstract":"In this article, I explore what happens when specialist palliative care staff meet together to discuss patients under their care.  Many studies (e.g., Atkinson) have discussed how health care practitioners in various settings use rhetorical strategies when presenting cases in situations such as ward rounds and team meetings. Strategies for arguing and persuading are central to medical practice in the interprofessional context.  The context of specialist palliative care is an interesting place for research, as there is a history of patient-centred holistic approaches to care, within a multidisciplinary context, that is interdisciplinary in its focus, structure, and practice (e.g. Saunders).  This article examines the rhetorical accomplishment of teamwork in specialist palliative care settings","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"SAGE PUBLICATIONS INC","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2682<\/identifier><datestamp>\n      2017-10-31T14:06:12Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:6469764865616C7468536F6369616C43617265<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2682\/<\/dc:relation><dc:title>\n        Team meetings in specialist palliative care: Asking questions as a strategy within interprofessional interaction<\/dc:title><dc:creator>\n        Arber, A<\/dc:creator><dc:description>\n        In this article, I explore what happens when specialist palliative care staff meet together to discuss patients under their care.  Many studies (e.g., Atkinson) have discussed how health care practitioners in various settings use rhetorical strategies when presenting cases in situations such as ward rounds and team meetings. Strategies for arguing and persuading are central to medical practice in the interprofessional context.  The context of specialist palliative care is an interesting place for research, as there is a history of patient-centred holistic approaches to care, within a multidisciplinary context, that is interdisciplinary in its focus, structure, and practice (e.g. Saunders).  This article examines the rhetorical accomplishment of teamwork in specialist palliative care settings.<\/dc:description><dc:publisher>\n        SAGE PUBLICATIONS INC<\/dc:publisher><dc:date>\n        2008-10-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2682\/2\/Finalteamwork12jan08.pdf<\/dc:identifier><dc:identifier>\n          Arber, A  (2008) Team meetings in specialist palliative care: Asking questions as a strategy within interprofessional interaction   QUALITATIVE HEALTH RESEARCH, 18 (10).  pp. 1323-1335.      <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1177\/1049732308322588<\/dc:relation><dc:relation>\n        10.1177\/1049732308322588<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2682\/","http:\/\/dx.doi.org\/10.1177\/1049732308322588","10.1177\/1049732308322588"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Team Meetings in Specialist Palliative Care: Asking Questions\n as a Strategy Within  Interprofessional Interaction\nAnne Arber R.N., M. Sc., Ph.D\nUniversity of Surrey, Guildford, UK\nIn this article, I explore what happens when specialist palliative care staff meet together to discuss\npatients  under  their  care.   Many  studies  (e.g.,  Atkinson)   have   discussed   how   health   care\npractitioners in various settings use rhetorical strategies when presenting cases  in  situations  such\nas ward rounds and team meetings. Strategies for arguing and  persuading  are  central  to  medical\npractice in the interprofessional context.  The context of specialist palliative care is  an  interesting\nplace for research, as there is a history  of  patient-centred  holistic  approaches  to  care,  within  a\nmultidisciplinary  context,  that  is  interdisciplinary  in  its  focus,  structure,   and   practice   (e.g.\nSaunders).   This  article  examines  the  rhetorical  accomplishment  of   teamwork   in   specialist\npalliative care settings.\nKeywords: discourse analysis; ethnography; institutional; organizations; palliative care\nLiterature Review\nThe philosophy of specialist palliative care prioritises person-centred care, and is  concerned  with\ntotal  care  and  teamwork  in  a  non  hierarchical  setting   (Clark,   1999;Hibbert   et   al.,   2003).\nTherefore, the hospice and palliative  care  movement  proposes  a  collaborative  and  team-based\nmodel  of   work   (Clark   &   Seymour,   1999).    Team   meetings   are   a   way   of   structuring\ninterprofessional relationships (Hugman, 1991).  In the context of specialist  palliative  care,  team\nwork enables a focus on medical concerns such as managing  complex  symptoms  as  well  as  the\nwider issues of comfort and total care made possible  by  the  interprofessional  approach  to  team\nmeetings,  involving  practitioners  from  a  variety  of  disciplines  (Gracia,  2002).    The  patient-\ncentred nature of hospice and specialist palliative care practice is reported in a number of   studies,\nin particular, the attention to  physical  symptoms  as  well  as  psychosocial  care  (Hibbert  et  al.,\n2003).  Cicely Saunders, the founder of the modern hospice movement in  the  UK,  proposed  that\npatient’s “total pain” could be addressed by having a division of labour represented in the  context\nof  team  work  that  addressed  the   many  components  of  pain,   including   physical,   spiritual,\nemotional and social aspects (Clark, 1999). Thus, the discipline  of  specialist  palliative  care  and\nhospice care has a philosophy of practice that integrates the psychological,  physical  and  spiritual\naspects of patient care and is committed to the “total care” approach and  the  importance  of  team\nwork (Clark & Seymour,1999).  Therefore the team is an  important  decision  making  unit  when\nproviding patient centred care that is the founding  principle  of  specialist  hospice  and  palliative\ncare practice.\nAccording to Dingwall, (1980),  “team”  is  a  device  for  concerting  action.  It  is  a  way  of  co-\nordinating a set of individual activities - in other words, it suggests a division of labour  related  to\nwork. Dingwall concludes that teamwork is a  way  of  resolving  issues  related  to  inclusion  and\nexclusion and can address problems of occupational boundary maintenance. Team  members  may\nhave quite different organizational or disciplinary agendas but have to align  those  agendas  along\nshared tracks.  Therefore, teamwork has an important place in achieving the alignment of  agendas\nand shared outcomes (Boden, 1994). The alignment of different agendas proceeds through talk-in-\naction in the team meetings, and this is a complex process involving disciplinary knowledge but it\nis also a social process. Interaction in team meetings  has  a  strategic  objective  and  according  to\nArminen, (2005), the strategic intent of interaction can be covert, is  difficult  to  observe  and  can\nonly  be  inferred.   However  White,  (2002),  using  an  ethnographic  approach  to   study   social\nrelations and case formulations in a child health  service,  was  able  to  unpack  how  practitioners\nused complex rhetorical formulations  in multidisciplinary team meetings  and  concludes  that  by\nstudying how cases are formulated not only tells us about professional know-how  but  also  about\nhow judgements are made in a social context. A number of authors discuss how little attention has\nbeen given to the social organisation of everyday work and to the  discourse  between  health  care\npractitioners (Atkinson 1994; Opie 1997).\nMany  studies  discuss  the  complexities  associated  with  team   work   such   as   “turf   battles,”\n“jockeying for position” (Leathard, 1994), managing threats to professional status (Cohen,  2003),\nbuilding reputation (Arber, 2007), representations of the patient (Crepeau, 2000), and  judgements\nmade about credibility (Smith 1978). However, in an interview study  with  staff  caring  for  older\npeople a common language suggesting  collegiality  was  identified  by  Sheehan,  Robertson,  and\nOrmond (2007) in this data extract:\n1. Doctor “We are not getting far with rehabilitation And\n2. Physiotherapist (referring to working with an occupational therapist) “We\n3. plan the session together; we were going to look at standing together so that\n4. the OT could attend to [patient’s] clothing.”\n Quoted in Sheehan et al.,  (2007,p.22)\nIn this talk the doctor refers to the team action related to  a  patient’s  rehabilitation  and  evaluates\nthe lack of progress so far using the  team  device  “we”  (line  1).   In  the  next  turn  (line  3)  the\nphysiotherapist refers to him\/herself and the occupational therapist as “we”.  Sheehan et al. (2007)\nidentifies how this team worked together in a collaborative manner through their use of  language,\nparticularly the use of  “we”.   The  use  of  “we”  in  discourse  is  a  marker  of  in-group  identity\naccording to Brown & Levinson, (1978).  Furthermore, Drew  &  Heritage  (1992)  say  that  “we”\ncan be heard as  a  collective  identity  and  Watson  (1987)  agrees  that  it  is  a  team  device  and\nidentifies  oneself  as  a  member  of  a  unit  or  organisation.   According  to   Opie,   (2000),   the\ndevelopment of shared linguistic practice is a  marker  of  an  interprofessional  team.   I  therefore\nsuggest that the analysis of team talk is a key resource when studying interprofessionality.\n Team meetings are a primary site for the distribution and eliciting of information  about  patients.\nInformation is checked and verified  as  well  as  simply  elicited  before  decisions  are  made  and\nactions are taken.  For example, Mills (2003), explores how individuals negotiate  with  what  they\nassume are community-of-practice norms in the performance of a particular task.  These groups of\npeople engaged in a task have a shared repertoire of negotiable resources  accumulated  over  time\n(Wenger, 1998). However, communities of practice are in a constant  process  of  change  and  the\ninterest in this article is in how  teams  construct  their  work  through  talk  and  how  this  enables\noutcomes relevant to  interprofessional  work.  Furthermore,  there  is  now  a  focus  on  the  “new\nworkplace”  as  a  social  institution   where   resources   are   produced,   professional   knowledge\nconstituted,  problems  solved  and  decisions  made  incrementally  and  achieved   interactionally\n(Boden, 1994; Sarangi & Roberts 1999). In the new workplace, practices such as interprofessional\ninteraction and negotiation are centre stage, and this represents a shift from doing work  to  talking\nabout it and  negotiating  it  with  others  (Iedema  &  Scheeres,  2003).   According  to  Iedema  &\nScheeres (2003), working within teams  encourages  reflection  and  reflexivity.   This  is  because\nteam work enables two things to happen: it enables teams to talk about how work is done  as  well\nas how identity is relevant  to  that  work.   The  politics  of  the  workplace  then  become  centred\naround challenging boundaries as well as defending them, and constructing what is and should  be\nhappening (Iedema & Scheeres, 2003).  Power is latent  in  all  conversation,  according  to  Wang\n(2006), and dialogue and rhetorical strategies enable participants to use their power by bringing in\na element of control. Thus, in an analysis of  team  talk  it  is  possible  to  have   insight  into  how\nrelations of power are constituted and  shaped  through  communicative  practices  and  how  these\npractices are changing (Wenger, 1998).\nHow team meetings are organised through verbal and linguistic features is important for a number\nof reasons.  First, in meetings, discourse identities are made relevant by how  one  organises  one’s\nspeech  such  as  asking  questions,  telling  stories,  and  so  forth  (Atkinson,1994).  Second,   the\ndiscourse of health care practitioners in team meetings has functional and social  significance  and\nenables an understanding of interprofessional  interaction  and  decision  making  at  one  point  in\ntime.  Third, an approach using  discourse  analysis  enables  a  detailed  grasp  of  interaction  and\nrhetorical  performance  and  sheds  light  on  how  collegiality  is  constructed,   and   professional\nboundaries managed.\nI have two aims for this article:\nto explore the strategic use of questions when negotiating decisions within the team meetings, and\nto discuss the implications for managing tensions through politeness strategies that  use  questions\nto manage professional and disciplinary boundaries.\nThe study\nThe aim of the research is to understand firstly,   how  palliative  care  teams’  talk  together  about\npatients and secondly  the rhetorical features  of  talk  and  what  this  means  for  interprofessional\ninteraction, collegiality and decision making.\nDesign\nThe focus of the research is on the everyday accomplishment of  team meetings within the context\n  of  specialist  palliative  care.  Therefore  this  study  is  located  broadly  as  an   ethnography   of\ninstitutional discourse (Miller, 1994).  According to Miller (1994),  ethnographies  of  institutional\ndiscourse focus on the ways in which everyday life is organised through language.  To  be  able  to\nfocus  on  the  language  used  in  team  meetings,  naturally  occurring  data  were  collected  from\npalliative care team meetings that were regular occurrences at each of the research sites. Although\nfield  data  were  also  collected  this  is  discussed  elsewhere  (Arber,  2006).   The   approach   to\ncollecting  naturally  occurring  data   from   team   meetings   enables   the   researcher   to   forgo\nassumptions about  what  is  happening  so  it  is  possible  to  focus  on  what  team  members  are\naccomplishing in and through their talk (Gubrium & Holstein, 1997).  This approach  draws  on  a\nmicro approach to the rhetorical organization of talk and enables some  of  the  tools  of  discourse\nanalysis to be applied to the data (Potter, 2004).\nThe research was reviewed by a research ethics committee, and consent for the study was granted.\n The issue of consent was reviewed on each visit to the research settings and  permission  to  audio\nrecord team meetings was requested at  each  of  the  meetings.   If  any  part  of  the  meeting  was\nthought inappropriate for audio recording by staff,  the  audio  recorder  was  switched  off  by  the\nresearcher. This happened on one occasion only, for a period of about 4 minutes  when  a  delicate\nfamily situation was discussed.\nParticipants\nA purposive sample of team meetings in a hospice setting, a hospital  palliative  care  team  setting\nand two different community team settings were chosen.  In all 8 meetings  were  audio  recorded;\ntwo meetings from each setting.  There were  a  variable  number  of  people  present  at  the  team\nmeetings.  The hospice team had the most members,  which  consisted  of  a  consultant,  registrar,\nhospice nurses, and social worker.  The hospital  palliative  care  team  meeting  consisted  of  two\nhospital palliative care nurses (HPCNs), a consultant and a  chaplain.   The  community  palliative\ncare team consisted of four community palliative care nurses (CPCNs), and a consultant,  and  this\nmeeting was attended by the HPCN at one site and inpatient hospice staff at the  other  community\nsite.  At all the meetings, it was the specialist nurses who presented  patients  within  the  meeting.\nTherefore, specialist nurses had a front-stage position within these meetings, and they  followed  a\npredefined method.  Each patient was presented to the meeting by  the  specialist  nurse  who  was\nassigned to the patient’s care, and the symptoms of the patient were discussed and any outstanding\nproblems and issues. Generally these meetings lasted between one to one and a half  hours.  I  was\npresent at all of the meetings and used an audio recorder to record the meetings. Staff  quickly  got\nused to my presence and seemed comfortable with  the  audio  recording.    I  transcribed  the  data\nverbatim.\nAnalysis\nI have drawn on an ethnographic approach which informed my  data  collection  and  analysis  and\nthen applied some of the conventions of discourse analysis to break the data  down  further  (Drew\n& Heritage, 1992; Hutchby & Wooffitt, 1998; Sacks, 1992; ten Have, 1999).  Therefore, my study\nis located in the ethnographic tradition, but by applying some of the tools of  discourse  analysis  I\nam locating my study as an ethnography of institutional discourse, as according to  Miller  (1994),\nethonographies of institutional discourse focus on the ways in  which  everyday  life  is  organised\nthrough language.\nI carried out a line-by-line analysis of the transcribed data, and by using the constant  comparative\nmethod and deviant-case analysis I was able to test out provisional hypotheses  (Silverman,  2001;\nStrauss & Corbin, 1998). For example, I noticed early on in my analysis that specialist community\nand  HPCNs  asked  many  more  questions  than  any  other  practioners  in  the  setting   of   team\nmeetings.  For example, hospice  nurses  did  not  use  this  linguistic  strategy,  and  it  was  rarely\nobserved being used by chaplains and social workers. Although medical staff asked questions they\nwere  far  fewer  in  number  than  those  used  by  the  specialist  nurses  in  the  hospital  and   the\ncommunity.   By applying the tool of discourse analysis, I was able to carry out a microanalysis of\ntalk and gain further insights into the functional significance of talk, in  particular  the  use  of  the\nquestioning as a strategic device to achieve certain goals or actions.  The  use  of  techniques  from\ndiscourse   analysis   enabled   me   to   identify   how   interprofessional   work   is   possible   and\naccomplished rhetorically in the settings studied.\nFindings\nStrategic use of questions\nThe overarching theme identified  in  the  data  is  the  strategic  use  of  questions  to  manage  the\nboundary between one discipline and another. Questions can be used  to  do  a  number  of  things,\nsuch as setting the agenda of what is to be talked about,  asserting  propositions,  making  requests\nand  imposing  conditions  that  are  designed  to  prefer   particular   responses   (Heritage,   2002;\nSchiffrin, 1987).  In this sense questions can be strategic as they reference a preferred outcome but\nmight also be designed to be diplomatic and polite.\nIn data extract (a),  the HPCN, when speaking to the district nurse (DN) checks  the  status  of  the\npatient’s pain:\n(a)  I just wanted to check with you was she still getting a fair bit of pain? (HPCN1 )\nThe HPCN’s  question is hedged by use of “just”  and  “fair  bit”.   Hedging  refers  to  the  use  of\nwords or phrases whose job it is to make thinks fuzzier  (Lakoff,  1972).   According  to  Atkinson\n(1995), hedges are used when there is a degree  of  uncertainty  related  to  propositions  or  truths.\nThus, hedges are used to mark areas of uncertainty as well as  areas  of  potential  agreement.  The\nHPCN continues to ask further questions related to putting  the  patient  on  analgesic  medication,\nMorphine Sulphate Tablets (MSTs):\n(b) Well I just wondered Andrea whether it would be worth trying her on MST 10 milligrams  bd?\n(HPCN1)\nIn data extract (b), the DN Andrea is addressed  in  a  friendly  and  polite  manner  by  the  HPCN\nusing the DN’s first name, and the question is hedged: “I just  wondered”.   Atkinson  (1999)  says\nthat the use of hedges is part of the rhetoric of case  presentation  and  it  encodes  the  division  of\nlabour.   The  use  of  the  questioning  strategy  enables  attention  to  politeness  and   diplomacy,\ndemonstrating  a  cautious  tactic  when  one  is  speaking  to  members  of  other  disciplines   and\nprofessions about assessing and managing pain.\n When speaking to the palliative care consultant in  data  extract  (c)  the  HPCN   asks  a  question\nabout the patient’s pain:\n(c) I’m just checking on pain whether or not he is still complaining of? (HPCN 1)\nThe HPCN hedges her question to the consultant  when she  says  “I’m  just  checking”.  She  also\nuses the performative “I” in all her questions (Watson, 1987). The use of “I” is significant because\nit marks the role that is played  in an organisational context (Fasulo &  Zucchermaglio,  2002).   In\nrelation to the questions used by the HPCN, it establishes her professional  identity  related  to  the\npatient’s  experience  of  pain  and  the  pharmacological  management   of   pain.   However,   this\nspecialist identity is negotiated in a manner that  allows  the  person  who  is  being  spoken  to,  to\nagree or disagree with her proposals through the use of  questions.   Thus,  this  technique  enables\nthe questioner to save face should her proposal be unacceptable. By directing the conversation,  by\nuse of questions, it  enables  a  degree  of  control  and  power  for  the  person  in  the  questioning\nposition and this is discussed next.  Questions are therefore linked with power as  they  potentially\nenable the questioner to impose his or her will on the person addressed.   However,  questions  can\nalso be face-threatening because they limit the addressee by putting  pressure  on  for  a  particular\noutcome (Tsui, 1994).\nAnother use of questions is in relation to introducing and maintaining an agenda within team  talk,\nwhich is discussed next in a meeting of the hospital palliative care team:\nControlling the agenda of talk\nIn the data extract (d) the HPCN uses questions to  control  the  agenda  of  talk  to  focus  on  pain\nwhen directing talk to the  consultant  in  palliative  medicine  (CPM).  However  the  identities  of\nnurse and doctor are also significant in relation to  who  has  authority  to  name  the  type  of  pain\nexperienced by the patient:\n|1   |HPCN 1  |What about pain?                                           |\n|2   |CPM 1   |It doesn’t seem too bad pain.  He has only a little        |\n|3   |        |bit of pain.  I suspect he’ll get that anyway until he’s   |\n|4   |        |stabilised a bit.                                          |\n|5   |HPCN 1  |Mm now just going back to the pain a minute.  He had       |\n|6   |        |some mm sort of neuropathic symptoms did he, originally?   |\n|7   |CPM 1   |No, not particularly.                                      |\n|8   |HPCN 2  |He said he had these sort of pricking,                     |\n|9   |HPCN 1  |Yeah.                                                      |\n|10  |HPCN 2  |down his sides.                                            |\n|11  |CPM 1   |Yes.                                                       |\n|12  |HPCN 2  |He was taking dihydrocodeine at night.                     |\n|13  |HPCN 1  |The other thing I wondered was, if he is incontinent of    |\n|    |        |faeces is that                                             |\n|14  |        |really because he can’t control it or is it that he is     |\n|    |        |constipated?                                               |\n|15  |CPM 1   |It is possibly a combination of both actually.  He is in   |\n|    |        |fact waggling                                              |\n|16  |        |his feet around about quite a bit more than he did so that |\n|    |        |Philip                                                     |\n|17  |        |reckons he is getting quite a bit of recovery.             |\n|18  |HPCN 1  |Right.  Well that is good isn’t it?                        |\n|19  |CPM 1   |Yeah.  Whether he’ll get full spincter control back I don’t|\n|    |        |know.                                                      |\n|20  |        |He’s got a catheter in hasn’t he?                          |\n|21  |HPCN 2  |Yes                                                        |\n|22  |HPCN 1  |I’m just wondering if they are looking at his bowels       |\n|    |        |sufficiently,                                              |\n|23  |        |because I mean if he is constantly being faecally          |\n|    |        |incontinent that is                                        |\n|24  |        |just awful in a way…Perhaps we ought to check when we are  |\n|    |        |up                                                         |\n|25  |        |whether you know, they are looking at that.                |\nData extract (d) Hospital Palliative Care Team Meeting\nThe question-and-answer format evident in this sequence of talk is  a  recurrent  feature  of  CPCN\nand HPCN talk in this study. Questions move forward  the  multiple  agendas  of  the  organisation\nand questioning approaches may serve a number of  interactional activities, for  example,  requests\nfor explanation, clarification and  for  actions  to  be  taken  (Boden,  1994).  Question-and-answer\nsequences are termed “adjacency pairs”, which are coupled activities in which the first part creates\nan expectation of the second  part  (Silverman,  1997).   The  completed  answer  also  enables  the\nquestioner to again take the floor (Sacks, Schegloff & Jefferson, 1974).  The HPCN asks  an  open\nquestion “What about pain?” The CPM  responds by saying, “He has only a little bit of pain” (line\n2-3). In this reply, the consultant seems to be ameliorating the pain by making it small through use\nof “little”. HPCN 1 proposes that the pain may be  linked  with  “sort  of  neuropathic  symptoms”\n(line 6).  This demonstrates that the HPCN has knowledge of the possible  causes  of  this  type  of\npain. However, the consultant does  not  confirm  this  link  (line  7)  although  he  too  hedges  his\ndisagreement with “No, not particularly”. The HPCN   uses  the  term  “pricking”  to  describe  the\npain (Line 8).  The consultant agrees with this description, and he says “yes”  at  line  11.  Perhaps\nthe nurse’s attempt to classify the pain as ‘neuropathic’ comes too close to the doctor’s role in  the\ndiagnosis of the cause of pain. In this context, the naming of the pain as ‘neuropathic’ remains  the\ndoctor’s area of jurisdiction.  Thus,  the  questioning  technique  used  by  the  HPCN  enables  the\ndoctor to keep his footing as a diagnostician who can  diagnose  neuropathic  pain.  Therefore,  the\nboundaries between specialist nursing and medicine related to  classifying  a  pain  as  neuropathic\nare evident in the talk. However the questioning technique enables the  consultant  to  classify  the\npain and the HPCN to steer the conversation to the issue of pain. Matters of etiquette and  tact  are\npart of collegial interactions where respect for professional knowledge and maintaining a front are\nconsidered important to collegial interaction (Goffman, 1959; Specht, 1985).  Thus,  the  specialist\nnurse is careful not to tread on the  consultant’s  area  of  expertise  related  to  classifying  pain  as\nneuropathic.   The  questioning  strategy   and   use   of   hedges   marks   her   cautiousness   when\napproaching the biomedical boundary related to classifying pain.\nAccording to Specht, (1985), socio political interaction can enter into collegial interactions at  any\ntime and these interactions are often about who makes the decision.  In the interaction above,  it  is\nthe consultant who does not confirm the presence of neuropathic  pain  and  it  is  the  HPCN  who\nthen steers the conversation and changes the topic of conversation to discuss the  patient’s  bowels\nand she identifies the collegial we: “Perhaps we ought to check when we are up”  at  line  24.  The\nHPCN uses a series of questions to discuss the patient’s pain  and  then  to  move  on  to  a  second\ntopic related to the symptom of incontinence and constipation.  The  HPCN is more  successful  in\ndeciding how they should move forward in relation to the constipation than she is to  deciding  the\ncause of the  pain.   Therefore,  the  decision  is  to  check  whether  the  staff  are  considering  the\npatient’s bowel problem, and they are going to check that when  they  next  visit  the  patient.  She\nmanages the agenda of the meeting by  introducing  topics  for  discussion.   She  is  successful  in\nmaking a decision for the team to check on the ward  staff  in  relation  to  managing  the  patient’s\nbowels. Questions enable the HPCN to manage the boundary between herself and  the  consultant.\nIt enables her to propose suggestions about the cause of pain in  a  cautious  manner.   It  identifies\nhow bowel care is a nursing rather  than  a  medical  concern,  and  classifying  pain  is  a  medical\nmatter. However it also  identifies  the  team  concern  with  these  issues  through  the  use  of  the\ncollegial “we”.\nOpinion- and advice-seeking questions\nThe following  sequence  of  talk  takes  place  in  one  of  the  daily  meetings  of  the  community\npalliative care team. The CPCN negotiates with the  palliative  care  consultant  to  have  a  patient\nreferred for a specialist ophthalmic opinion:\n|1   |CPCN 1  |I mean is it worth me trying to get an                    |\n|2   |        |appointment at B hospital? I mean do you think Mr S or    |\n|3   |        |somebody would be able to see anything on ahm             |\n|4   |CPM 2   |Well they could certainly, one has seen, I’ve seen        |\n|5   |        |bilateral choroidal metastases.                           |\n|6   |CPCN 1  |Can they pick it up with their special                    |\n|7   |        |equipment up there.  Do you think they will?              |\n|8   |CPM 2   |They will see.  They will see they will look in the eye   |\n|9   |CPCN 1  |Because that will give us some clout with Dr              |\n|10  |        |J                                                         |\n|11  |CPM 2   |If there is some chorodial metastases he will see         |\n|12  |        |them straight away.                                       |\n|13  |CPCN 1  |Can I ring up B hospital or do I have to wait for Dr      |\n|14  |        |K to do a referral?  because that’s going to delay things |\n|15  |        |quite considerably unfortunately.                         |\n|16  |CPM 2   |If Dr K agrees.                                           |\n|17  |CPCN 1  |Well I give him a ring but yeah                           |\n|18  |CPM 2   |If  he agrees then you go ahead.                          |\n|19  |CPCN 1  |I just ring up and his referral can come when             |\n|20  |        |he’s ready to write it.  You know what he’s a bit.  He    |\n|    |        |takes a                                                   |\n|21  |        |little bit of time. I think this lady needs to be ahm     |\n|22  |CPM 2   |Before her sight goes completely.                         |\n|23  |CPCN 1  |Yeah.  It’s probably more prudent to do that              |\n|24  |        |then to getting her up here to see yourself cause even if |\n|    |        |you                                                       |\n|25  |        |think agree and think there’s cerebral they’re still not  |\n|    |        |going to                                                  |\n|26  |        |do anything at the Royal on that are they?  They need to  |\n|27  |        |have some more proof.                                     |\n|28  |CPM 2   |They want some science.                                   |\nData Extract (e),  Community palliative care meeting\nCPCN 1 initiates  the  chain  of  questions  that  positions  the  consultant  as  the  recipient  of  the\nquestions (lines 2, 7, 14). This turn-taking procedure of question and answer operates to manage  a\nkey task in interprofessional relations, namely, the identities of doctor and nurse.  By interrogating\nthe consultant’s medical know-how, the HPCN treats him as a medical  oracle.  This  achieves  his\nexpertise in relation to medicine and enables her to enter into medical discourse while maintaining\nthe consultant’s footing as a medical  expert.  This  system  enables  them  to  do  interprofessional\nwork in a manner that  is  mutually  constructed.  She  negotiates  with  the  consultant  to  get  the\npatient seen by an ophthalmic consultant at B Hospital (lines 1-8).\nThe CPCN wishes to make an opthalmic appointment at the specialist hospital for this patient  and\nshe introduces this topic in a manner that is cautious and polite.  CPCN 1 asks a question, “I mean\nis it worth me trying to get an appointment at B hospital?” (line 2). Cautiousness is evident  in  the\nuse of the checking device “I mean.”  In  the  consultant’s  reply,  at  line  4,  he  orientates  to  the\nsecond  part  of  CPCN’s  question  related  to  the  specialist  medical  skill  of   seeing   ‘bilateral\nchoroidal metastases’.   I suggest that this reply marks the referral procedure introduced by  CPCN\nat line 2 as a delicate issue across the nurse-doctor boundary  as  the  CPM  avoids  answering  the\nfirst part of the question. Thus, both nurse and doctor orientate to  the  issue  introduced  by  being\ncautious.  The doctor avoids and delays answering the first part of the question.\nThe CPCN asks the consultant about what the specialist, whom she  names,  as  Mr  S.,  would  be\nable to see (line 2-3).  She then opens up the choice of doctor by  using  a  hedge,  “or  somebody”\n(line 3).  This achieves the consultant’s authority to make a decision about whom to refer to.   The\nCPCN continues her chain of questions, “Can  they  pick  it  up  with  their  special  equipment  up\nthere.  Do you think they will?” (line 6-7).  The consultant confirms that “They  will  see”  and  he\nuses these words twice to confirm his belief in the ability of these specialists and  their  equipment\nto “see” (line 8).  This according to the CPCN will give “some clout with  Dr.  J”  (the  oncologist;\nlines 9-10).  The problem  in  the  patient’s  eye  can  only  be  seen  by  the  specialist  consultant:\n“choroidal metastases he will see them straight away” (line 11-12). At this point the CPCN  seems\nto have achieved the decision for the referral. Clearly, the CPCN wants to have the patient seen by\nan ophthalmic consultant, and her questions are a masking tactic to enable the  consultant  to  keep\nhis footing as a medical expert and to enable him  to  work  with  her  to  accomplish  the  referral,\nwithout telling him what to do directly. The CPCN  is  masking  a  command  related  to  how  the\nreferral will be made.\nAccording to Goody (1978),  masking questions work in two  ways.   In  one  way  they  mask  the\nquestioner’s ability to  control  the  recipient,  and   in  another  they  work  to  make  the  recipient\nresponsible for the consequences of the reply and thus make them a partner.  Therefore, the CPCN\nis proceeding cautiously by using hedges to mark areas of  uncertainty  and  potential  alignments;\nshe is also using questions in a way that is masking a command related to  the  referral  procedure.\nThis  masking  is  a  way  of  avoiding  upsetting  interprofessional.   The  CPCN   is  masking  her\nintention to get the referral, by  gaining  the  consultant’s  co-operation  by  the  use  of  questions.\nThese strategies are designed to manage the tensions  inherent  in  interprofessional  relations  and\nrole responsibilities.  They are  a  way  of  managing  and  blurring  professional  boundaries.  The\ndecision to make the referral to the specialist hospital doctor is achieved by line  12.  The  division\nof labour in making the decision is that the CPCN makes the proposal for a referral and  the  CPM\nagrees that the specialist  consultant  will  see:  “chorodial  metastases  he  will  see  them  straight\naway” (line 12).\nAt line 13, the topic that now is the focus of talk is how  and  who  will  make  the  referral  to  the\nspecialist hospital doctor and the nurse seeks permission to carry out the referral herself,  which  is\ndiscussed next.\nPermission seeking:  pushing at the boundary\nThe mechanism by which the referral is going to be carried out is again the  topic  of  conversation\nintroduced by the CPCN at line 13.  The CPCN asks what is  called  a  self-  referencing  question:\n“Can I ring up” (line 13).  A self-referencing  question  depicts  the  person’s  own  intentions  and\nmotivation.  Questions encompassing “Can I” and “I mean” are the most  indirect  and  deferential\nof the self-referencing frames (Clayman & Heritage, 2002).  The CPCN  believes  having  to  wait\nfor the GP to do the referral is going to “delay things” (line  14-15).  However,  the  consultant,  in\nhis next turn, changes footing out of the role of answerer. He maintains  the  GP-CPCN  boundary\nby asserting that the CPCN must ask the GP to do the referral.  At this point, the CPCN  gives  the\nfloor back to the consultant, and in his next turn he reiterates, “If  he  agrees  then  you  go  ahead”\n(line 18). Perhaps one of the reasons behind the insistence on the GP’s agreement is that  deferring\nto the GP for the referral is part of  professional  etiquette.    It  is  the  usual  manner  of  getting  a\nhospital  referral  for  a  patient  in  the  community,  presumably.  Specht  (1985),  discusses  how\nprofessional interaction can be collegial with attention to matters of etiquette,  good  manners  and\ntact  but  at  any  time  sociopolitical  interactions  can  also  take  place  and  enter   into   collegial\ninteractions.  The sociopolitical interactions are usually around matters  related  to  allocation  and\ncontrol of organisational resources and decisions (Specht, 1985).  Thus, I suggest  the  problem  of\nthe referral is a political matter, as it goes beyond the boundary  between  medicine  and  specialist\nnursing in this context. Thus,  the  CPCN  has  hit  an  organisational  boundary  between  the  two\nprofessions.  The consultant is  acting as a ‘gatekeeper’ and monitoring  professional   boundaries.\nThus, there is a tension between the power exerted  by  the  masking  strategy  of  using  questions\navailable to the CPCN and the organisational and professional power available to the CPM.\nThe problem that the CPCN is concerned with is the delay in getting the referral  from  a  GP  who\nshe considers is going “to delay things quite considerably” in her opinion (lines 14-15).  Thus, her\nobjective is to  get  a  speedy  referral  to  a  specialist  hospital  doctor.   However,  she  has  hit  a\nstumbling block or the boundary that is non-negotiable.  In her next turn she says, “I  just  ring  up\nand his referral can come when he’s ready to write it.  You know what he’s a bit.  He takes a  little\nbit of time.  I think this lady needs to be ahm” (line 19-21). The CPCN makes a repair and  hedge,\n“you know he’s a bit, he takes a bit of time”. It has been observed  that  self-repair  is  a  means  of\nrepairing “interactional errors”, in other words repairing mistakes  in  the  attempt  to  address  and\nspeak appropriately to people in particular circumstances (Jefferson, 1974).  In this statement,  the\nCPCN revises her earlier utterance to one that is more acceptable  and   she  is  being  cautious  by\nusing hedges “he’s a bit, he takes a bit  of  time”  in  contrast  to  her  earlier  statement  at  line  14\n“that’s going to delay things quite considerably”.  The CPCN  therefore exhibits  a  preference  for\nagreement and this enables the smoothing out of the interactional troubles.\nReaching agreement\nThe CPCN and CPM collaborate to contain and smooth over their disagreement between lines 21-\n23, when they identify the need for the patient to be seen quickly.  In fact, the CPM completes  the\nturn for the CPCN by referring to the concern about “Before her sight goes completely” (line  22).\nCompletion of each other’s turns may signify a degree of equality in a relationship (Coates, 1998).\n Thus, the collegial aspect of this talk is evident at this  point.   This  talk  establishes  the  CPCN’s\nreputation as someone who is prudent and careful and who knows the type of “proof”  required  to\nenable a decision about what to do (lines 23-27). The CPCN is eager to pursue the referral quickly\nand  is  unconcerned  about  professional  sensitivities  and  etiquette  with  the  GP.  She  is   more\nconcerned with her own competence and credibility as  an  effective  professional  who  can  get  a\nquick referral.  However, her approach does  not  challenge  the  palliative  care  consultant  but  is\npolite and cautious. She is constructing collegiality through her  attention  to  strategic  politeness.\nHer rhetorical performance consists of agreement with the  consultant  “Well  I  give  him  a  ring”\n(line  17)  and  “I  just  ring  up”  (line  19).   Therefore,  she  avoids  challenging  the  consultant’s\nauthority.  I suggest this is because the discipline of palliative care is one  that  respects  teamwork\nand collegialtiy within the palliative care discipline. For example,  a  team  performance  could  be\ndisrupted  through  an  inappropriate  performance,  and  there  is  a  reliance  on  the  conduct  and\nbehaviour of others to bring of team work (Goffman, 1959).  Even  where  there  are  practitioners\nwith  different  statuses  within  an  organisation  there  is  still  the  recognition   of   their   mutual\ndependence and this is a source of cohesion.\nQuestions and their responses specifically mark the  disciplinary  boundaries  between  the  CPCN\nand CPM.  Only if the GP agrees can she go ahead  with  the  referral  (line  18).  The  CPCN  and\nCPM reach agreement at line 21 and 22 where they both agree that  the  patient  needs  to  be  seen\nquickly “Before her sight goes completely” (line 22).  The CPCN replies “Yeah” at  line  23.   The\nCPCN and CPM reference  their  shared  belief  in  proof  (line  27)  and  science  (line  28).   This\nidentifies the biomedical base of their respective professions.  This is where  they  are  in  absolute\nagreement. I suggest  that  the  issue  of  the  referral  references  the  tension  that  exists  between\nspecialist  palliative  care  nurses  and  non-specialist  doctors  such  as  GPs,  which  is   discussed\nelsewhere  (Arber, 2007).   At this moment, the referral procedure remains a medical  matter  from\none medical practitioner to another, and in this context the CPM has a gate-keeping role. The gate-\nkeeping role is discussed in more detail next.\nGatekeeping\nIn data extract (f), the CPCN is negotiating with the consultant to have  a  patient  admitted  to  the\nhospice.  This patient has problems with non-malignant pain:\n|1  |CPCN 2  |So this woman is asking a) not to come to day care or if  |\n|   |        |she comes                                                 |\n|2  |        |to come every other week for only an hour or something    |\n|   |        |like this.                                                |\n|3  |        |We are just going around in circles.  What do you want us |\n|   |        |to do?  Do                                                |\n|4  |        |you want us to call her in?                               |\n|5  |CPM 1   |Has mm S seen her at home the tissue viability sister?    |\n|6  |CPCN 2  |Not to my knowledge                                       |\n|7  |CPM 1   |No  mm we can certainly bring her in.                     |\nData extract (f),   Community Palliative Care Team Meeting\nThis patient is not named she is referred to as “this woman” (Line 1).  She meets the category of  a\ntroubled patient; one whose symptoms are difficult to control and who rejects suggestions such  as\ncoming to day care (Li & Arber, 2006).  The nurse is  clearly  finding  no  answers  to  the  patient\ndifficulties:  “we are just going around in circles” (Line 3). This patient  could  be  a  threat  to  the\nreputation of specialist palliative care as her symptoms are difficult to control  in  the  community.\nThe CPCN asks an open question followed by a closed question (line 3). “What do you want us to\ndo? Do you want us to call her in?”  The consultant’s authority to make decisions about  admitting\nthe patient to the hospice is clearly referenced here. He is therefore the gatekeeper  for  admissions\nto the hospice.  Eagle & de Vries (2005) in a study of hospice admission meetings found that there\nwas a gate-keeping process that guarded against inappropriate  admissions  to  the  hospice.   They\nfound that consultant staff guarded the doors to hospice admission and community  palliative  care\nnurses argued the case for admission.  This is the situation in data extract  (f).   By  using  “we”  in\nline 7,  the decision is identified as a collegial one  by the consultant.  The use of  “we”  constructs\nthe team approach (Watson, 1987), and  it  enables  a  shared  decision  to  be  made  to  admit  the\npatient to the hospice. Silverman, (1987) agrees with this, as he says the voices of “we” get  things\ndone because they enable decisions to be made.    The  use  of  the  collegial  “we”  is  part  of  the\nprocess of social  alignment  that  enables  doctors,  nurses,  and  others  to  work  together  and  to\nachieve optimum management of complex symptoms and access to scarce resources.\nThe cautious and delicate nature of  the  interprofessional  space  in  the  context  of  the  specialist\npalliative care team meetings is addressed by HPCNs, CPCNs and CPM  using  questions,  hedges\nand the team device  of  “we”  to  enable  the  minimisation  of  interpersonal  disagreement  while\nmaximising agreement.   Also,  CPCNs  use  deferential  strategies  such  as  the  outright  seeking\npermission for referrals and admission to the hospice e.g. “what do you want us to do?”, “Can  I?”\nThis identifies the boundary between medicine and specialist nursing that is  being  negotiated  by\nusing a cautious and protective device of questions. It also establishes the gate-keeping role of  the\nconsultant.  Consultants and  specialist  nurses  reference  a  collegial  context  by  using  the  team\ndevice “we” and by demonstrating equality in their relationships by expressions of agreement over\nthe need for speed in making referrals  and getting access to in-patient hospice beds.\nDiscussion\nThe strategic use of questions, identified in this article, enables specialist palliative care  nurses  to\ninfluence and manage interprofessional interactions in a manner that is diplomatic and polite.  The\nstrategic nature of questions is part of the etiquette of team  meetings  in  this  context.   Questions\noperate as  a  social  device  to  manage  the  boundary  between  one  professional  discipline  and\nanother.   They  enable  and  facilitate  interprofessional  interaction,  and  operate   by   smoothing\ninteractions by recognition and respect for consultant expertise  in  their  role  as  gatekeepers  and\ndiagnosticians. Therefore, issues of authority and power are relevant in relation to  how  questions\narise and the actions they  produce.  The  questioning  strategy   positions  consultant  staff  as  the\nboundary maintainer and gatekeeper and the specialist nurses as the boundary tester and  manager.\nTogether, specialist nurses and consultant staff are strategically managing the boundaries  of  their\nprofessional disciplines through the use of interactional devices such as questions  to  manage  the\ntensions inherent in interprofessional work. The linguistic strategies used in interprofessional  talk\nare identified in Table 1.\nSpecialist nurses use  questions  in  a  strategic  and  polite  manner  to  achieve  their  professional\nagenda,  to   present   their   professional   identity   and   to   manage   the   tensions   involved   in\ninterprofessional working.  Boundaries, according to Svensson (1996), are a social construction in\nnurses’, doctors’ and other members’ talk. Therefore, how boundaries are orientated to in  the  talk\ngive insight into the use and availability of power.  The power position in interaction is  associated\nwith an ability to initiate the trajectory for action and to set its agenda.   The  questioning  strategy\nused by the CPCNs  enable  topics  to  be  raised  and  agendas  to  be  initiated  that  contribute  to\ndecisions about specialist palliative care practice.  According to Griffiths & Hughes (1994),   team\nmembers when formulating grounds for decisions within the  language  of  one  specialism  carries\nthe risk of marginalizing the contributions of others.  They refer to “natural  rhetorics”  as  part  of\nthe ongoing ritual reaffirmation of team identity and legitimacy of  team  practice.  One  aspect  of\nthe  natural  rhetoric  of  palliative  care  team  meetings  is  the  strategic  use  of   questions.   The\nquestioning strategy enables the specialist nurses to initiate the action  trajectory  for  the  eventual\ndecision and are influential precisely because of the naturalness of the questioning  strategy.   It  is\nsocial device; it is used to test out the boundary between medicine and nursing, it alignes others; it\nis goal directed. Most important, it enables specialist palliative care nurses to  both  influence  and\ndirect decisions on matters of a  medical  nature.   In  the  context  in  which  they  occur  they  are\npresented in a polite and face-saving manner.  Therefore, the questioning strategy is both palatable\nand non- dominating in delivery and enable the medical and nursing boundary to be negotiated  in\na manner that is acceptable to senior medical professionals.\nThe use of questions has been identified as  having  a  gendered  dimension,  with  women  asking\nmore questions  to develop rapport during social interaction  than  men  (Fishman,  1978;  Tannen,\n1989).  However, the person asking the questions has a lot of control  of  the  conversation  and  to\nsome  extent  controls  what  the  next  speaker  is  able  to  say.   The   key   relevant   variable   in\norganisational  interaction,  according  to  Mills,   (2003),    is   occupational   status   not   gender.\nFurthermore, managing different perspectives and disparities  is  a  key  dimension  of  interaction.\nThe skilled nature of the  negotiations  around  the  professional  boundaries  involving  questions,\nopinion and advice seeking, permission seeking and collegial agreement are ways  through  which\nperspectives, disparities, and  tensions  are  anticipated,  managed  and  mitigated  (Boden,  1994).\nQuestions in the context in which they occur are a social  device  that  enables   the  boundaries  of\nspecialist nursing and medicine to be negotiated collegially, respectfully and courteously.\nQuestions can be hedged and therefore operate as protective devices.  Hedges  such  as  “I  think”,\n“little bit”, “just,” protect specialist nurses by being guarded and cautious.  Maintaining  face  is  a\ncondition of interaction according to Goffman, (1959), and face- saving  practices  are  sometimes\ncalled tact, diplomacy and social skill.  To be able to employ face-saving techniques, one needs  to\nexercise perceptiveness, according to  Goffman,  (1959).  Thus,  saving  one’s  own  face  but  also\nsaving the face of others is both defensive and protective.  The questioning strategy is designed  to\nbe respectful to consultant expertise and to manage the biomedical boundary.   The  team  meeting\noccurs in a setting that  orientates  to  face  by  being  respectful,  polite  and  extending  to   senior\nmedical staff their ceremonial due (Strong, 1979).  In this study, there is also evidence  of  the  use\nof deferential rhetorical strategies related  to  opinion-seeking  and  permission-seeking  strategies;\nfor example, when making requests for referrals to specialist hospitals and when seeking access to\nin-patient hospice resources. It  could  be  argued  that  nurses  have  developed  a  skilled  way  of\nmasking their subordination to doctors’ decisions by  using  questions  related  to  opinion-seeking\nand permission seeking. However, this  hypothesis  can  be  challenged  because  of  the  way  that\nspecialist  nurses  use  covert  or  masked  questions  to  test  the  limits   of   gatekeeping   and   to\nrhetorically push for particular patient outcomes in a strategic manner.\nThe use of questions in interaction has been noted in legal and  broadcasting  contexts  and  in  the\nworkplace  generally  (Clayman,  1992;  Greatbach,  1992;  Greatbatch  &  Dingwall,  1999).   For\nexample  Greatbach (1992), in the context of news interviews, explores  the  relationship  between\nthe turn-taking provisions and the  legal  requirement  that  broadcast  journalists  should  maintain\nimpartiality in their coverage of news  and  current  affairs.   According  to  Greatbach  turn-taking\nprocedures pre-establish the local roles of broadcast journalists as report elicitors, which maintains\ntheir  neutralistic  stance  as  soliciting  information  and   opinion.    He   says   that   interviewees\ncollaborate by avoiding challenging or commenting on the character of the interviewers’ questions\nand therefore collaborate to  maintain  the  neutralistic  stance  taken  by  the  interviewer.  Thus,  I\nsuggest that the questioning technique  adopted  by  the  specialist  nurses  enables  them  to  avoid\ngiving an opinion directly,  and  this  may  avoid  the  tensions  associated  with  being  direct  and\nconfrontational to a member of one’s team who is a senior  medical  practitioner.   This  technique\ntherefore is a tool to manage interprofessional relations directed by  specialist  nurses  and  aligned\nwith by consultant medical staff. However, unlike the interviewees in the context of  broadcasting,\nconsultant  medical  staff  have  a  gatekeeping  role  in  managing  access  to  resources   and   the\nboundary between one group and another.  I therefore suggest that the alignment  through  the  use\nof adjacency pairs is only possible up to  a  point.   When  decisions  about  medical  referrals  and\naccess to hospice beds are discussed the consultant’s role of gatekeeper is evident.\nQuestions are a social device but they also have a strategic importance as the person who asks  the\nquestion has the right to talk again afterwards,  and  as  long  as  one  is  in  the  position  of  doing\nquestions one is in part in control of the conversation (Sacks, 1992). Cameron, (2000), agrees with\nthis; she says that the person asking the questions in formal settings has a dominant role and  gives\nthat person a considerable amount of power to direct interaction.  This is interesting, as the role  of\nthe questioning strategy suggests that it has emerged as a social device to deal with  differences  in\nstatus and power within interprofessional settings such as team meetings.  Therefore, this  strategy\nworks to balance power differentials and enables specialist nurses to work with the consultant in a\nmanner that is mutually acceptable.\nOne of the limitations of my research is the small number of teams that have been researched.  For\nexample Perakyla (2004:296) asks whether “everything that is said in case studies on  institutional\ninteraction apply exclusively to the particular site that was observed, or do the results  have  wider\nrelevance?”   Studies  such  as  this  on  a  limited  number  of  team  meetings  may  have   limited\nreliability.  However, Perakyla suggests that the question of generalisability could  be  approached\nfrom the point of view of possibilities.  Therefore in  this  study  there  is  the  possibility  that  the\nstrategic use  of  questions  is  a  technique  that  is  used  to  manage  the  boundary  between  one\nprofession and another in other settings.  This technique may be used both interprofessionally  and\nintraprofessionally and may be  used  by  staff  working  collegially  and  across  professional  and\ndisciplinary boundaries.  The strategic use of questions may be specific to specialist nurses in their\nrole as boundary testers and expanders as they develop their  role  and  place  in  multidisciplinary\nteams.\nConclusion\nThe questioning strategy is a way to save face, do politeness and not to rock  the  interprofessional\nboat.   This  is  skilled  communication  in  a   sense   that   enables   interprofessional   interaction,\ncontributes to decisions and preserves the etiquette  and  politeness  evident  in  much  of  medical\npractice (Strong, 1979).  The use of questions enables interprofessional dialogue in the  context  of\nthis study and enables the CPCNs and the HPCNs to retain a degree of  control  of  the  agenda  of\nthe meeting. Although Wang, (2006),  argues  that  power  is  relevant  in  all  interaction  whether\ninformal or formal she suggests that power is covert in informal settings and overt  in  institutional\nsettings.  I think this contention  needs  further  research  as  this  can  be  disputed  in  this  article.\nThere are reasons why a person with less status vis-a-vis others uses questions in a masked way to\nguide interaction, introduce  topics,  and  negotiate  decisions  during  meetings.   The  questioning\nstrategy enables the boundary between one profession and another to be negotiated  in  a  mutually\nacceptable manner through questions that mask and control, elicit advice, seek  permission,  direct\naction and get access to specific resources such as hospice beds.  What drives this approach is  the\nconcern for establishing not only  a  specialist  identity,  but  effective  referrals  that  maintain  the\nreputation of the speciality of palliative care.\nIt may be possible for the team to reflect on how they conduct  their  meetings,  and  transcripts  of\nteam meetings may be a starting point in developing insight into how the team  works  together  to\nmake  decisions  from  a  social  and  interactional  perspective.   This  would   complement   other\napproaches  to  rational  decision  making  and  highlight   the   interactional   accomplishment   of\ninterprofessional work. This work is important  to  the  development  and  education  of  specialist\npractitioners  as  their  effectiveness  in  the  team  setting  may  be  dependent  on  not  only   their\nprofessional knowledge and competence  but  how  this  is  negotiated  in  team  meetings.   In  the\nfuture, further studies of teamwork in a  variety  of  contexts  would  expand  on  the  interactional\nperspective developed in this article, with the elucidation of further markers  of  interaction  in  the\ninterprofessional context of team meetings. This  would  develop  interactional  competencies  that\nare interprofessional and may guide practice and education in relation to team work in  the  future.\nFinally it would  be  useful  to  develop  further  research  related  to  the   interactional  aspects  of\nteamwork and decision making, and how team work is achieved. This could  include  comparisons\nacross cultures and disciplines, as well  as  different  medical  contexts,  to  test  out  the  emerging\nlinguistic markers of interprofessional work.\nReferences\nArber, A.  (2007). Pain talk in hospice and palliative care team meetings.  International Journal\nof Nursing Studies, 44, 16-926.\nArber, A. (2006). Reflexivity. A challenge for the researcher as practitioner?  Journal of Research\nin Nursing, 11, 147-157.\nArminen, I. (2005). Institutional interaction. Aldershot: Ashgate.\nAtkinson, P.  (1994). Rhetoric as skill in a medical setting. In M. Bloor & P. Taraborrelli,  (Ed.),\nQualitative Studies in Health and Medicine (pp.110-130). Aldershot: Avebury.\nAtkinson, P.  (1995). Medical talk and medical work.  London: Sage.\nAtkinson, P.  (1999). Medical discourse, evidentiality and the construction of professional\nresponsibility.   In  S. Sarangi & C.Roberts (Eds.), Talk, work and institutional order (pp. 75-107).\nBerlin: Mouton de Gruyter.\nBoden, D. (1994). The business of talk. Cambridge: Polity Press.\nBrown, P., & Levinson, S. (1978). Universals in language usage: politeness phenomena.  In E.\nGoody (Ed.), Questions and politeness.  Strategies in social interaction. Cambridge: Cambridge\nUniversity Press.\nCameron, D. (2000). Good to talk.  Living and working in a communication culture.  London:\nSage.\nClark, D. (1999). ’Total pain’, disciplinary power and the body in the work of Cicely Saunders,\n1958-1967.  Social Science and Medicine, 49, 727-736.\nClark, D., & Seymour, J. (1999).  Reflections on palliative care. Buckingham: Open University\nPress.\nClayman, S.E. (1992). Footing in the achievement of neutrality: the case of news- interview\ndiscourse. In P. Drew & J. Heritage (Eds.),  Talk at work (pp.163-211). Cambridge: Cambridge\nUniversity Press.\nClayman, S.E., & Heritage, J. (2002). Questioning presidents: Journalistic deference and\nadversarialness in the press conferences of U.S. presidents Eisenhower and Regan.  Journal of\nCommunication, 52, 749-775.\nCoates, J. (1998). Language and gender: A reader.  Oxford: Blackwell.\nCohen, Z.A. (2003). The single assessment process: An opportunity of collaboration or a threat to\nthe profession of occupational therapy? British Journal of Occupational Therapy, 65, 446-452.\nCrepeau, E.B. (2000). Reconstructing Gloria: A narrative analysis of team meetings.  Qualitative\nHealth Research, 10, 766-787.\nDingwall, R. (1980).  Problems of teamwork in primary care. In S. Lonsdale, A. Webb  & T.L.\nBriggs, Teamwork in the personal social services and healthcare, (pp.111-137). London: Croom\nHelm.\nDrew, P., & Heritage, J. (Eds.), (1992). Talk at work.  Cambridge: Cambridge University Press.\nEagle, L.M., & de Vries, K. (2005) Exploration of the decision-making process for inpatient\nhospice admissions.  Journal of Advanced Nursing, 52, 584-591.\nFasulo, A., & Zucchermaglio, C. (2002). My selves and I: Identity markers in work meeting talk.\nJournal of Pragmatics, 34, 1119-1144.\nFishman, P.M. (1978). Interaction: the work women do.  Social Problems, 25, 397-406.\nGoffman, E. (1959).  The presentation of self in everyday life.  London: Penguin.\nGoody, E.N. (1978). Towards a theory of questions. In  E.N.Goody (Ed.),  Questions and\npoliteness (pp. 17-43).  Cambridge: Cambridge University Press.\nGracia, D. ( 2002). Palliative care and the historical background.  In H. ten Have & D. Clark\n(Eds.), The Ethics of Palliative Care European Perspectives, (pp. 18-33). Buckingham: Open\nUniversity Press.\nGreatbach, D. (1992). On the management of disagreement between news interviewers.  In P.\nDrew & J. Heritage, Talk at work, (pp. 268-301).  Cambridge: Cambridge University Press.\nGreatbach, D., & Dingwall, R. (1999). Professional neutralism in family mediation. In Sarangi, S.\nand Roberts, C. (eds) Talk, work and institutional order (pp.271-292). New York: Mouton de\nGruyter.\nGriffiths, L., & Hughes, D. (1993) Typification in a neuro-rehabilitation centre: Scheff revisited?\nThe Sociological Review, 41, 415-445.\nGriffiths, L., & Hughes, D. (1994). “Innocent Parties” and “Dishearening” Experiences: Natural\nrhetorics in neuro-rehabilitation admissions conferences.  Qualitative Health Research, 4, 385-410.\nGubrium, J., & Holstein, J. (1997).  The New Language of Qualitative Method.  Buckingham:\nOpen University Press.\nHeritage, J. (2002). The limits of questioning; negative interrogatives and hostile question content.\nJournal of Pragmatics, 34, 1427-1446.\nHibbert, D., Hanratty, B., May, C., Mair, F., Litva, A., & Capewell, S. (2003). Negotiating\npalliative care expertise in the medical world.  Social Science and Medicine, 57, 277-288.\nHugman, R. (1991).  Power in the caring professions. London: Macmillan.\nHutchby, I. & Wooffitt, R. (1998).  Conversation Analysis Cambridge. Cambridge: Polity Press.\nIedema, R., & Scheeres, H. (2003). From doing work to talking work: Renegotiating knowledge,\ndoing and identity.  Applied Linguistics, 24, 316-337.\nJefferson, G. (1974).  Error Correction as an Interactional Resource.  Language in Society, 2, 181-\n99.\nLakoff, G. (1972).  Hedges: A study in meaning criteria and the logic of fuzzy concepts.  In\nP.Peranteau, J. Levi & G. Phares (Eds.), Papers from the Eighth Regional Meeting (pp.183-228).\nUSA: Chicago Linguistic Society.\nLeathard, A. (1994). Going interprofessional.  Working together for health and social care.\nLondon: Routledge.\nLi, S., & Arber, A. (2006). The construction of troubled and credible patients: A study          of\nemotion talk in palliative care settings. Qualitative Health Research, 16, 27-46.\nMiller, G. (1997). Building bridges. In D. Silverman (Ed.),  Qualitative research. theory, method\nand practice (pp. 24-44). London: Sage.\nMiller, G. (1994). Toward ethnographies of institutional discourse: Proposal and suggestions.\nJournal of Contemporary Ethnography, 23, 280-306.\nMills, S. (2003). Gender and politeness. Cambridge: Cambridge University Press.\nOpie, A. (1997).  Thinking teams thinking clients: issues of discourse and representation in the\nwork of health care teams.  Sociology of Health and Illness, 19, 259-280.\nOpie, A. (2000).  Thinking teams\/ thinking clients. New York: Columbia University Press.\nPerakyla, A. (2004). Reliability and validity in research based on naturally occurring social\ninteraction.  In D. Silverman (Ed.),  Qualitative Research (2nd ed., pp.283-304). London: Sage.\nPotter,  J. (2004). Discourse analysis as a way of analysing naturally occurring talk. In D.\nSilverman (Ed.). Qualitative Research (2nd ed., pp. 200-221). London: Sage.\nSacks, H. (1992). Lectures on conversation.  Oxford: Blackwell.\nSacks, H., Schegloff, E. & Jefferson, G. (1974). A simplest systematics for the organization of turn\ntaking for conversation.  Language, 50, 696-735.\nSarangi, S., & Roberts, C. (1999). Talk, work and institutional order.  New York: Mouton de\nGruyter.\nSaunders, C. (1990).  Hospice and palliative care.  An interdisciplinary approach.  London: Edward\nArnold.\nSchiffrin, D. (1987).  Discourse markers. Cambridge: Cambridge University Press.\nSheehan, D., Robertson, L., & Ormond, T.  (2007).  Comparison of language used and patterns of\ncommunication in interprofessional and multidisciplinary teams. Journal of Interprofessional Care,\n21, 17-30.\nSilverman, D. (1987). Communication and medical practice social relations in the clinic.  London:\nSage.\nSilverman, D. (1997). Discourse of counselling: HIV counselling as social interaction London:\nSage.\nSilverman, D. ( 2001).  Interpreting qualitative data. Methods for analysing talk, text and\ninteraction. (2nd Edition). London: Sage.\nSmith, D. (1978).  K is mentally ill: the anatomy of a factual account.  Sociology, 12, 23-53.\nSpecht, H. (1985).  Managing professional interpersonal interactions.  Social Work, 30, 225-230.\nStrauss, A., &  Corbin, J. (1998). Basics of qualitative research. (2nd Edition). London: Sage.\nStrong, P. (1979). The ceremonial order of the clinic. London: Routledge & Kegan Paul.\nSvensson, R. (1996). The interplay between doctors and nurses - a negotiated order perspective.\nSociology of Health and Illness, 18, 379-398.\nTannen, D. (1989). Talking voices.  Cambridge: Cambridge University Press.\nten Have, P. (1999). Doing Conversation Analysis.  London: Sage.\nTsui  A (1994). English conversation.  Oxford: Oxford University Press.\nWang, J. (2006). Questions and the exercise of power.  Discourse and Society, 17, 529-548.\nWatson, D.R. (1987). Interdisciplinary considerations in the analysis of pro-terms. In G. Button &\nJ. Lee (Eds.),  Talk and social organisation (pp. 261-289). Philadelphia: Multilingual Matters.\nWenger, E. (1998). Communities of practice. Cambridge: Cambridge University Press.\nWhite, S. (2002).  Accomplishing ’the case’ in paediatrics and child health: medicine and morality\nin inter-professional talk.  Sociology of Health and Illness, 24, 409-435.\nTable  1 A Summary of Categories, Verbal  Strategies and Outcomes in Interprofessional\nTalk\n|Theme          |Categories           |Strategy         |Outcome            |\n|Strategic use  |Doing                |Adjacency pairs  |Identity management|\n|of questions   |interprofessional    |Aligning,        |                   |\n|               |talk                 |masking,         |Face saving        |\n|               |                     |                 |Protective         |\n|               |Professional         |hedging          |                   |\n|               |Etiquette            |                 |                   |\n|               |Permission seeking   |Can I,  do you,  |Authority          |\n|               |                     |do I             |Decision           |\n|               |Opinion\/advice       |What about, is it|Information        |\n|               |seeking              |worth, do you    |Boundary testing   |\n|               |                     |think            |Strategic          |\n|               |                     |                 |politeness         |\n|               |Tension and managing | Isn’t he, who   |Boundary management|\n|               |agreement            |is, no, if, but, |                   |\n|               |                     |he’s a bit, well,|Gatekeeping        |\n|               |                     |if               |Decision           |\n|               |                     |                 |Power              |\n|               |Doing teamwork       |I and  we,  yeah,|Interprofessionalit|\n|               |                     |us               |y                  |\n|               |                     |                 |Team identity      |\n|               |                     |I think, just,   |Collegial decision |\n|               |                     |you know         |Professional       |\n|               |                     |                 |Identity           |\n"}