{"doi":"10.1103\/PhysRevLett.103.083201","coreId":"65361","oai":"oai:dro.dur.ac.uk.OAI2:6099","identifiers":["oai:dro.dur.ac.uk.OAI2:6099","10.1103\/PhysRevLett.103.083201"],"title":"Conical intersections in laboratory coordinates with ultracold molecules.","authors":["Wallis,  A. O. G.","Gardiner,  S. A.","Hutson,  J. M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-08-01","abstract":"For two states of opposite parity that cross as a function of an external magnetic field, the addition of an electric field will break the symmetry and induce an avoided crossing. A suitable arrangement of fields may be used to create a conical intersection as a function of external spatial coordinates. We consider the effect of the resulting geometric phase for ultracold polar molecules. For a Bose-Einstein condensate in the mean-field approximation, the geometric phase effect induces stable states of persistent superfluid flow that are characterized by half-integer quantized angular momentum","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65361.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6099\/1\/6099.pdf","pdfHashValue":"708a274436d5b30a58bc35be96bd944145f32c44","publisher":"American Physical Society","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6099<\/identifier><datestamp>\n      2010-10-19T09:56:44Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Conical intersections in laboratory coordinates with ultracold molecules.<\/dc:title><dc:creator>\n        Wallis,  A. O. G.<\/dc:creator><dc:creator>\n        Gardiner,  S. A.<\/dc:creator><dc:creator>\n        Hutson,  J. M.<\/dc:creator><dc:description>\n        For two states of opposite parity that cross as a function of an external magnetic field, the addition of an electric field will break the symmetry and induce an avoided crossing. A suitable arrangement of fields may be used to create a conical intersection as a function of external spatial coordinates. We consider the effect of the resulting geometric phase for ultracold polar molecules. For a Bose-Einstein condensate in the mean-field approximation, the geometric phase effect induces stable states of persistent superfluid flow that are characterized by half-integer quantized angular momentum.<\/dc:description><dc:publisher>\n        American Physical Society<\/dc:publisher><dc:source>\n        Physical review letters, 2009, Vol.103(8), pp.083201 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2009-08-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6099<\/dc:identifier><dc:identifier>\n        issn:0031-9007<\/dc:identifier><dc:identifier>\n        issn: 1079-7114<\/dc:identifier><dc:identifier>\n        doi:10.1103\/PhysRevLett.103.083201<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6099\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevLett.103.083201<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6099\/1\/6099.pdf<\/dc:identifier><dc:rights>\n        © 2009 by The American Physical Society. All rights reserved.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0031-9007"," 1079-7114","issn:0031-9007","issn: 1079-7114"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n01 July 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nWallis, A. O. G. and Gardiner, S. A. and Hutson, J. M. (2009) ’Conical intersections in laboratory coordinates\nwith ultracold molecules.’, Physical review letters., 103 (8). 083201.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1103\/PhysRevLett.103.083201\nPublisher’s copyright statement:\n2009 by The American Physical Society. All rights reserved.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nConical Intersections in Laboratory Coordinates with Ultracold Molecules\nAlisdair O.G. Wallis,1 S. A. Gardiner,2 and Jeremy M. Hutson1\n1Department of Chemistry, Durham University, South Road, Durham, DH1 3LE, United Kingdom\n2Department of Physics, Durham University, South Road, Durham, DH1 3LE, United Kingdom\n(Received 11 May 2009; published 17 August 2009)\nFor two states of opposite parity that cross as a function of an external magnetic field, the addition of an\nelectric field will break the symmetry and induce an avoided crossing. A suitable arrangement of fields\nmay be used to create a conical intersection as a function of external spatial coordinates. We consider the\neffect of the resulting geometric phase for ultracold polar molecules. For a Bose-Einstein condensate in\nthe mean-field approximation, the geometric phase effect induces stable states of persistent superfluid flow\nthat are characterized by half-integer quantized angular momentum.\nDOI: 10.1103\/PhysRevLett.103.083201 PACS numbers: 34.50.\u0001s, 03.65.Nk, 34.10.+x, 82.20.Xr\nIt is well known that the potential energy surfaces for\nmolecular electronic states of the same symmetry can cross\nat a point in two dimensions or on a surface of dimension\nn\u0001 1 in n dimensions. These crossings are known as\nconical intersections because the two surfaces locally\nform a double cone. Conical intersections have a wealth\nof interesting consequences for molecular structure and\ndynamics. For example, they are responsible for the\nJahn-Teller effect [1] and play an important role in non-\nadiabatic processes [2]. One of the most interesting con-\nsequences of conical intersections is the geometric phase\n(Berry phase) effect [3]: when the nuclei follow a path that\nencircles a conical intersection once and returns to the\noriginal configuration (pseudorotation), the electronic\nwave function changes sign. Since the total wave function\nmust be a single-valued function of coordinates, this re-\nquires that the wave function for nuclear motion must also\nchange sign. This has important dynamical consequences:\nit produces half-odd-integer quantization for free pseudo-\nrotation [4] and may have significant effects on collision\ncross sections [5].\nThe purpose of this Letter is to explore conical inter-\nsections of a different type. It is now possible to produce\natomic and molecular Bose-Einstein condensates (BECs)\nand to subject them to applied magnetic and electric fields.\nThe atomic and molecular states split and shift as a func-\ntion of the magnetic field (Zeeman effect) and electric field\n(Stark effect). In the absence of an electric field, parity is\nconserved, so it is possible to tune the magnetic field so that\ntwo levels of different parity are exactly degenerate with\none another. However, if a simultaneous electric field is\napplied, the two levels of opposite parity are mixed and the\ndegeneracy is resolved [6]. Conical intersections can thus\noccur at points where the electric field is zero. It is possible\nto envisage an arrangement of fields that creates conical\nintersections between two atomic or molecular levels as a\nfunction of external spatial coordinates rather than internal\ncoordinates.\nAll the results that apply to conical intersections be-\ntween molecular potential energy surfaces will continue to\napply in this new situation. The internal (electronic, vibra-\ntional, or spin) wave function of the atom or molecule will\nchange sign along a path that encircles the intersection\nonce, so the spatial wave function of the condensate must\nalso change sign.\nQuantized vortices are a characteristic sign of superfluid\nflow [7], and since their first observation in the context of\nBose-Einstein condensed dilute atomic gases [8] they have\nbeen key to some spectacular experimental results [9,10].\nRecent experiments placing a BEC within a toroidal trap-\nping geometry [11–13] have enabled the observation of\npersistent flow around a toroidal trap [11]. The possibility\nof forming half-integer quantized vortices within a spinor\natomic BEC configuration has been investigated theoreti-\ncally [14–17], as have a variety of differing consequences\nof geometric phase effects in atomic BEC systems [18–21].\nIn this work we combine these different threads to show\nhow, with an appropriate configuration of magnetic and\nelectric fields, a BEC of heteronuclear diatomic molecules\nwill assume a toroidal geometry, such that the geometric\nphase causes the system to manifest macroscopically oc-\ncupied states of half-integer quantized persistent flow.\nEffects of this type can in principle be observed in any\nsystem where two states of opposite parity can be tuned\ninto degeneracy with a magnetic field and can be coupled\nwith an electric field. However, for atomic systems states\nof different parity are usually far apart at zero field. More\naccessible examples are provided by gases of hetero-\nnuclear alkali-metal dimers such as RbCs and KRb, which\nare the targets of current experiments. In the present work\nwe illustrate the effect for a gas of KRb molecules in a\nsingle vibrational level of the lowest triplet state, 3\u0001þ.\nThe energy levels of a 3\u0001þ molecule in an applied field\nare conveniently expanded in a fully decoupled basis set of\nfunctions jNMNijSMSi, where N and S are quantum num-\nbers for molecular rotation and electron spin and MN and\nPRL 103, 083201 (2009) P HY S I CA L R EV I EW LE T T E R S\nweek ending\n21 AUGUST 2009\n0031-9007=09=103(8)=083201(4) 083201-1 \u0001 2009 The American Physical Society\nMS are the corresponding space-fixed projections onto the\nmagnetic field axis. Nuclear spin is neglected here for\nsimplicity. A simple form of the Hamiltonian that contains\nall the essential ingredients is\nH ¼ BN^2 þ 2\n3\n\u0001ðS^2 \u0001 3S^2ZÞ þ ge\u0002BBZMS \u0001\u0001 \u0002E; (1)\nwhere B is the molecular rotational constant, \u0001 is the spin-\nspin coupling constant, SZ is the projection of S onto the\nmolecular axis, BZ is the magnetic field orientated along\nthe space-fixed Z axis, and E and \u0001 are the vectors\nrepresenting the electric field and molecular electric dipole\nmoment. KRb has not been characterized in detail spec-\ntroscopically, but ultracold KRb has recently been formed\nin the lowest rovibrational levels of both singlet and triplet\nstates [22]. Electronic structure calculations give an equi-\nlibrium distance re ¼ 5:901 \u0002A for the triplet state [23].\nThis allows B and \u0001 for the lowest vibrational level\nto be estimated as B ¼ 0:018 13 cm\u00011 and \u0001 ¼\n\u00010:006 32 cm\u00011. The dipole moment function has been\ncalculated by Kotochigova, Tiesinga, and Julienne [24] and\nhas a value around 0.051 D near re.\nFigure 1 shows the lowest rotational levels of KRb\n(a3\u0001þ) as a function of magnetic field in the presence\nand absence of a moderate electric field (5 kV=cm). At\nzero field, the N ¼ 0 level has a single sublevel with total\nangular momentum J ¼ 1, while the N ¼ 1 level is split\ninto 3 sublevels with J ¼ 0, 1, and 2. When a magnetic\nfield is applied, each sublevel is split into 2J þ 1 compo-\nnents labeled by MJ. At zero electric field, the MJ ¼ þ1\nlevel originating from N ¼ 0, J ¼ 1 and theMJ ¼ 0 level\noriginating from N ¼ 1, J ¼ 1 have different parity and\ncross near BZ ¼ 187 G.\nWhen a nonzero electric field is introduced, parity is no\nlonger conserved. However, if the electric and magnetic\nfields are parallel, MJ is conserved and MJ ¼ 0 and þ1\nstates cross. We have therefore chosen the electric field to\nbe perpendicular to the magnetic field to induce an avoided\ncrossing between the MJ ¼ 0 and þ1 states as shown in\nFig. 1.\nWe may envisage an experiment in which a BEC is\nsubjected to a magnetic field BZ, orientated along the\nspace-fixed Z axis, which varies along the X axis with field\ngradient dBZ=dX. An inhomogeneous electric field E is\noriented along the X axis with a magnitude which varies\nwith Y as dE=dY, vanishing on a plane at Y ¼ 0. This\ncreates a seam of conical intersections along the line 0; 0; Z\nwhere X ¼ 0 is the position at which the magnetic field\nbrings the two states into degeneracy. Adding an external\ncylindrically symmetric optical trapping potential in the\nXY plane of the electromagnetic field gradients,\nVoptð\u0003;\u0004; ZÞ ¼ 12Mð!2\u0003\u00032 þ!2ZZ2Þ, where \u00032¼X2þY2,\ncreates a toroidally shaped potential around the conical\nintersection, with a radial minimum at \u00030. The left-hand\nside of Fig. 2 shows the resulting potential for a magnetic\nfield gradient of 5 G=cm, an electric field gradient of\n6:8 kV=cm2, and an optical trapping potential with a\nheight of 7 \u0002K at \u0003 ¼ 30 \u0002m [25] centered at the conical\nintersection. This potential has significant anisotropy\n(about 10 nK), which is manifested as an asymmetry along\na cut with Y ¼ 0 as shown schematically in the lower\npanel.\nThe anisotropy of the toroidal trapping potential Vtrapð\u0004Þ\ncan be controlled by offsetting the optical trapping poten-\ntial from the point of intersection. Assuming that the\nZeeman effect is linear over the range of the intersection,\nwith respective gradients a and b, the asymmetry along\nY ¼ 0will be zero when the optical trap is centered at x0 ¼\nðaþ bÞ=ð2M!\u0003Þ. The trapping potential still has slightly\ndifferent depths along the X and Y axes, but this can be\nminimized by adjusting the electric field gradient. The\nright-hand side of Fig. 2 shows the resulting optimized\ntrapping potential, with x0 ¼ 0:0715 \u0002m and dE=dY ¼\n6:723 kV=cm2. This potential has an angular anisotropy on\nthe order of 0.01 nK.\nFIG. 1 (color online). Energy levels of KRb as a function of\nmagnetic field B. The upper panel shows an overview, with each\nzero-field level [labeled by ðN; JÞ] splitting into 2J þ 1 compo-\nnents as a function of magnetic field. The lower panel shows how\ntwo levels of different parity cross (MJ ¼ 0 and þ1) in the\nabsence of an electric field (solid lines) but avoid one another in\nthe presence of a 5 kV=cm electric field (dashed lines).\nPRL 103, 083201 (2009) P HY S I CA L R EV I EW LE T T E R S\nweek ending\n21 AUGUST 2009\n083201-2\nFor a molecule of massM moving in a toroidal potential\nsuch as those in Fig. 2, the single-particle Schro¨dinger\nequation is approximately separable, with solutions\n\u0003ð\u0003;\u0004; ZÞ ¼ c ð\u0003Þ\u0004ð\u0004Þ’ðZÞ. In the absence of anisot-\nropy, the geometric-phase-induced antiperiodic boundary\ncondition \u0004ð\u0004Þ ¼ \u0001\u0004ð\u0004þ 2\u0005Þ gives \u0004ð\u0004Þ ¼\nð2\u0005Þ\u00011=2 expðim\u0004Þ, where m takes half-integer values\n\u0003 12 , \u0003 32 , \u0003 52 , etc. If the boundary conditions were peri-\nodic over 2\u0005, m would take integer values 0, \u00031, \u00032, etc.\nFor periodic boundary conditions the ground state has zero\nangular momentum m ¼ 0, but for antiperiodic boundary\nconditions it has a nonzero angular momentum m ¼ \u0003 12 .\nThe single-particle energy spectrum is\nE¼\n\u0001\n\u0006Zþ12\n\u0002\n@!Zþ\n\u0001\n\u0006\u0003þ12\n\u0002\n@!\u0003þbrot\n\u0001\nm2\u00011\n4\n\u0002\n; (2)\nwhere the third term represents the rotational energy of the\nparticle with a rotational constant brot ¼ @2=2M\u000320.\nIn order for geometric phase effects to be observed, the\nangular anisotropy of the toroidal trapping potential\nVtrapð\u0004Þ must be small enough to allow the wave function\nto fully encircle the intersection. For the potentials shown\nin Fig. 2, 12 @!\u0003 \u0004 4 nK and brot \u0004 0:5 nK. For the poten-\ntial on the left-hand side, the anisotropy is large compared\nto brot, so that the single-particle wave function will be\nlocalized on one side of the trap. However, for the potential\non the right-hand side, the anisotropy is small compared\nto brot and the single-particle wave function will fully\nencircle the conical intersection and exhibit half-integer\nquantization.\nA BEC of a dilute gas may be modeled by the Gross-\nPitaevskii equation (GPE). The time-independent GPE is\n½H^0 þ uð\u0004Þj\u0003ð\u0003;\u0004; ZÞj2\u0005\u0003ð\u0003;\u0004; ZÞ ¼ \u0002\u0003ð\u0003;\u0004; ZÞ;\n(3)\nwhere \u0002 is the chemical potential and the mean-field wave\nfunction \u0003 is normalized to unity,\nR\n\u0003\u0006\u0003d\u0007 ¼ 1. The ef-\nfective interaction strength uð\u0004Þ is 4\u0005@2Nað\u0004Þ=M, where\nN is the number of particles in the condensate. The internal\nmolecular wave function at angle \u0004 may be written in\nterms of the individual molecular states c 1 and c 2 as\nc ð\u0004Þ ¼ c 1 cosð\u0004=2Þ þ c 2 sinð\u0004=2Þ; (4)\nso the effective angle-dependent scattering length að\u0004Þ is\nað\u0004Þ ¼ 1\n8\nð3a11 þ 3a22 þ 2a12Þ þ 12 ða11 \u0001 a22Þ\n\u0007 cos\u0004þ 1\n8\nða11 þ a22 \u0001 2a12Þ cos2\u0004; (5)\nwhere aij is the scattering length for interaction between\nmolecules in states i and j. This is isotropic in the case\na11 ¼ a22 ¼ a12.\nAveraging over the radial and vertical wave functions\ngives an effective 1D GPE in \u0004,\n\u0003\n\u0001brot @\n2\n@\u00042\nþ ~uð\u0004Þj\u0004ð\u0004Þj2\n\u0004\n\u0004ð\u0004Þ ¼ ~\u0002\u0004ð\u0004Þ; (6)\nwhere\n~uð\u0004Þ ¼ 4\u0005@\n2Nað\u0004Þ\nM\nZZ\njc ð\u0003Þj4j’ðZÞj4\u0003d\u0003dZ (7)\nand \u0002 ¼ ~\u0002þ ð\u0006Z þ 12Þ@!Z þ ð\u0006\u0003 þ 12Þ@!\u0003 \u0001 brot=4. For\na flat ring, this has analytical solutions \u0004ð\u0004Þ ¼\nð2\u0005Þ\u00011=2 expðim\u0004Þ, with ~\u0002 ¼ brotm2 þ ~u=ð2\u0005Þ. Apply-\ning antiperiodic boundary conditions, we obtain the same\nsolutions as for the single-particle case, namely, states of\nhalf-integer quantized angular momentum.\nIn the presence of a small anisotropy, there are two\nclasses of solution satisfying antiperiodic boundary\nconditions: flowing solutions, \u0004\u0003mð\u0004Þ \u0004 ð2\u0005Þ\u00011=2\u0007\nexpð\u0003im\u0004Þ, and static solutions, such as \u00040mð\u0004Þ \u0004\n\u0005\u00011=2 cosðm\u0004Þ for small interactions, both with half-\ninteger m. For a trap with a residual anisotropy Vtrapð\u0004Þ ¼\n\u0001V1 cos\u0004\u0001 V2 cos2\u0004 and an angle-dependent interaction\nstrength ~uð\u0004Þ ¼ u0 þ u1 cos\u0004þ u2 cos2\u0004, we obtain ap-\n−8 −6 −4 −2 0 2 4 6 8−8\n−6\n−4\n−2\n0\n2\n4\n6\n8\nX (µ m)\nY \n(µ \nm\n)\n−\n14\n2.\n5\n−\n13\n2.\n5\n−8 −6 −4 −2 0 2 4 6 8−8\n−6\n−4\n−2\n0\n2\n4\n6\n8\nX (µ m)\nY \n(µ \nm\n)\n−\n13\n6.\n9\n−\n13\n6.\n9\nX\nEn\ner\ngy\na X\nb X\nX\nEn\ner\ngy\na X\nb X\nFIG. 2 (color online). Toroidal potentials formed around coni-\ncal intersections. Left-hand panels: Potential formed when the\noptical trapping potential (7 nK at 30 \u0002m) is centered at the\npoint of intersection (\u0003 ¼ 0), with field gradients 5 G=cm X^ and\n6:8 kV=cm2 Y^. Right-hand panels: Potential formed when the\ntrapping potential is offset along X^ by x0 ¼ 0:0715 \u0002m, with\nfield gradients 5 G=cm X^ and 6:723 kV=cm2 Y^. The electric\nfield gradient is chosen to minimize the anisotropy in each case.\nThe well depths are given in nK relative to the point of inter-\nsection. The lower panels show schematic cuts through the\npotential at Y ¼ 0: KRb eigenstates (red dashed lines), optical\ntrapping potential (blue dot-dashed lines), and the resultant\ntoroidal potential (black solid lines).\nPRL 103, 083201 (2009) P HY S I CA L R EV I EW LE T T E R S\nweek ending\n21 AUGUST 2009\n083201-3\nproximate chemical potentials corresponding to these two\nAnsa¨tze of ~\u0002\u00031=2 \u0004 brot=4þ u0=ð2\u0005Þ and ~\u000201=2 \u0004 brot=4\u0001\nV1=2þ 3u0=ð4\u0005Þ \u0001 u1=ð2\u0005Þ \u0001 u2=ð8\u0005Þ. In this approxi-\nmation, a flowing state with m ¼ \u00031=2 is the ground state\nif 2u1 þ u2=2þ 2\u0005V1 < u0. For any given að\u0004Þ and con-\ndensate number, we can apply an offset of the optical\npotential sufficient to compensate for the anisotropy of\nthe interaction term and stabilize the flowing state.\nThe permitted velocities of the persistent flow can as-\nsume only half-integer values compared to the quantized\nunits of circulation possible in a more conventional single-\nspecies atomic BEC in a comparable toroidal geometry\n[11]. The persistent flow should be observable by releasing\nthe trapped particles and employing a time-of-flight tech-\nnique [11].\nA BEC such as described here is stable only if að\u0004Þ\nremains positive all around the ring. From Eq. (5), this\nrequires that a11 and a22 are both positive and that 2a12 >\n\u0001ða11 þ a22Þ. In addition, a condensate of polar molecules\ncan undergo dipolar collapse [26] if the dipole length ad\nexceeds the scattering length for the short-range interac-\ntions, where ad ¼ jd2jM=ð12\u0005\b0@2Þ and d is the effective\ndipole moment of the molecule in the field. Since the\nmolecular wave function is given by Eq. (4) and there is\na direct dipole moment matrix element h1j\u0002j2i between\nthe near-degenerate states c 1 and c 2, d ¼ h1j\u0002j2i sin\u0004.\nFor the two states of KRb considered here, h1j\u0002j2i \b\n10\u000132 Cm, which gives amaxd \b 5\u0007 10\u000112 m. This is sub-\nstantially smaller than typical scattering lengths so dipolar\ncollapse is unlikely.\nThe present Letter has described a novel form of conical\nintersection that can occur as a function of three-\ndimensional laboratory coordinates, instead of internal\nmolecular coordinates. Using such conical intersections,\nit may be possible to create novel superfluid states with\nstable persistent flow characterized by half-integer, rather\nthan integer quantized angular momentum. Although we\nhave considered the effect for polar molecules, a similar\neffect might be produced for well-separated levels, perhaps\neven in atoms, using a laser field to bring the levels into\nnear-degeneracy and an inhomogeneous magnetic field to\nprovide a crossing. Conical intersections would appear at\npoints of zero laser amplitude, for example, at the nodes in\nan optical lattice.\nThe effect proposed here can in principle be observed in\nany system where two states of any different symmetry\n(not just parity) can be tuned into degeneracy with one\nexternal influence, and then split apart again with another\ninfluence that breaks the symmetry.\nThe authors are grateful to EPSRC and for funding\nthe collaborative project QuDipMol under the ESF\nEUROCORES program EuroQUAM.\n[1] H. C. Longuet-Higgins, U. Opik, M.H. L. Pryce, and R.A.\nSack, Proc. R. Soc. A 244, 1 (1958).\n[2] Conical Intersections: Electronic Structure, Dynamics\nand Spectroscopy, edited by W. Domcke, D. R. Yarkony,\nand H. Ko¨ppel (World Scientific, Singapore, 2004).\n[3] M.V. Berry, Proc. R. Soc. A 392, 45 (1984).\n[4] H. von Busch, V. Dev, H.-A. Eckel, S. Kasahara, J. Wang,\nW. Demtro¨der, P. Sebald, and W. Meyer, Phys. Rev. Lett.\n81, 4584 (1998).\n[5] J. C. Juanes-Marcos and S. C. Althorpe, J. Chem. Phys.\n122, 204324 (2005).\n[6] B. Friedrich and D. Herschbach, Phys. Chem. Chem.\nPhys. 2, 419 (2000).\n[7] J. Annett, Superconductivity, Superfluids, and\nCondensates (Oxford University Press, Oxford, 2004).\n[8] M. R. Matthews, B. P. Anderson, P. C. Haljan, D. S.\nHall, C. E. Wieman, and E.A. Cornell, Phys. Rev. Lett.\n83, 2498 (1999).\n[9] C. Raman, J. R. Abo-Shaeer, J.M. Vogels, K. Xu, and\nW. Ketterle, Phys. Rev. Lett. 87, 210402 (2001).\n[10] A. E. Leanhardt, A. Go¨rlitz, A. P. Chikkatur, D. Kielpinski,\nY. Shin, D. E. Pritchard, and W. Ketterle, Phys. Rev. Lett.\n89, 190403 (2002).\n[11] C. Ryu, M. F. Andersen, P. Clade, V. Natarajan, K.\nHelmerson, and W.D. Phillips, Phys. Rev. Lett. 99,\n260401 (2007).\n[12] A. S. Arnold, C. S. Garvie, and E. Riis, Phys. Rev. A 73,\n041606(R) (2006).\n[13] K. Henderson, C. Ryu, C. MacCormick, and M.G.\nBoshier, New J. Phys. 11, 043030 (2009).\n[14] F. Zhou, Phys. Rev. Lett. 87, 080401 (2001).\n[15] J. Ruostekoski and J. R. Anglin, Phys. Rev. Lett. 91,\n190402 (2003).\n[16] H. Chiba and H. Saito, Phys. Rev. A 78, 043602\n(2008).\n[17] S. Hoshi and H. Saito, Phys. Rev. A 78, 053618\n(2008).\n[18] I. Fuentes-Guridi, J. Pachos, S. Bose, V. Vedral, and\nS. Choi, Phys. Rev. A 66, 022102 (2002).\n[19] Z.-D. Chen, J.-Q. Liang, S.-Q. Shen, and W.-F. Xie, Phys.\nRev. A 69, 023611 (2004).\n[20] C. Zhang, A.M. Dudarev, and Q. Niu, Phys. Rev. Lett. 97,\n040401 (2006).\n[21] V.M. Kaurov and A. B. Kuklov, Phys. Rev. A 73, 013627\n(2006).\n[22] K.-K. Ni, S. Ospelkaus, M.H. G. de Miranda, A. Pe’er,\nB. Neyenhuis, J. J. Zirbel, S. Kotochigova, P. S. Julienne,\nD. S. Jin, and J. Ye, Science 322, 231 (2008).\n[23] S. Rousseau, A. R. Allouche, and M. Aubert-Fre´con,\nJ. Mol. Spectrosc. 203, 235 (2000).\n[24] S. Kotochigova, E. Tiesinga, and P. S. Julienne, Eur. Phys.\nJ. D 31, 189 (2004).\n[25] T. Takekoshi, B.M. Patterson, and R. J. Knize, Phys. Rev.\nLett. 81, 5105 (1998).\n[26] T. Koch, T. Lahaye, J. Metz, B. Fro¨hlich, A. Griesmaier,\nand T. Pfau, Nature Phys. 4, 218 (2008).\nPRL 103, 083201 (2009) P HY S I CA L R EV I EW LE T T E R S\nweek ending\n21 AUGUST 2009\n083201-4\n"}