{"doi":"10.1093\/sp","coreId":"103130","oai":"oai:epubs.surrey.ac.uk:2857","identifiers":["oai:epubs.surrey.ac.uk:2857","10.1093\/sp"],"title":"Policy, Preferences and Patriarchy: The Division of Domestic Labor in East Germany, West Germany and the United States","authors":["Cooke, LP"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-03","abstract":"Individual agency observed in the gendered division of labor is shaped by structural factors, but only recently has evidence emerged that the effect of women’s resources varies systematically in its sociopolitical context. Here we use the 1994 International Social Survey Program to assess whether the relative effect of a proxy for women’s and men’s preferences—hallmark of individual choice—varies as well across three countries with divergent historical policy approaches regarding the private sphere. East German socialist policies required and supported women’s employment; West German policy promulgated a male breadwinner model, and U.S. policy primarily remains silent on the private sphere. The division of domestic tasks and relative strength of individual preferences on shifting it vary by region. In the former East Germany the division of domestic labor is more egalitarian and the effect of preferences is small but equal for the genders. In West Germany the division is more traditional and preference effects are greater, but gender differences in these are insignificant. The U.S. division of domestic task falls between the two German regions, and the gender difference in preference effects is the greatest, with U.S. men’s preferences predicting significantly more variance than do U.S. women’s. Consequently, allowing the market to dominate does not yield equal strength of preferences in the individual-level models used to predict the division of domestic tasks. This supports the dual-system feminist claims that capitalism can exacerbate nonmarket patriarchal hierarchies","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Oxford University Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2857<\/identifier><datestamp>\n      2017-10-31T14:06:48Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:736F63696F6C6F6779<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2857\/<\/dc:relation><dc:title>\n        Policy, Preferences and Patriarchy: The Division of Domestic Labor in East Germany, West Germany and the United States<\/dc:title><dc:creator>\n        Cooke, LP<\/dc:creator><dc:description>\n        Individual agency observed in the gendered division of labor is shaped by structural factors, but only recently has evidence emerged that the effect of women’s resources varies systematically in its sociopolitical context. Here we use the 1994 International Social Survey Program to assess whether the relative effect of a proxy for women’s and men’s preferences—hallmark of individual choice—varies as well across three countries with divergent historical policy approaches regarding the private sphere. East German socialist policies required and supported women’s employment; West German policy promulgated a male breadwinner model, and U.S. policy primarily remains silent on the private sphere. The division of domestic tasks and relative strength of individual preferences on shifting it vary by region. In the former East Germany the division of domestic labor is more egalitarian and the effect of preferences is small but equal for the genders. In West Germany the division is more traditional and preference effects are greater, but gender differences in these are insignificant. The U.S. division of domestic task falls between the two German regions, and the gender difference in preference effects is the greatest, with U.S. men’s preferences predicting significantly more variance than do U.S. women’s. Consequently, allowing the market to dominate does not yield equal strength of preferences in the individual-level models used to predict the division of domestic tasks. This supports the dual-system feminist claims that capitalism can exacerbate nonmarket patriarchal hierarchies.<\/dc:description><dc:publisher>\n        Oxford University Press<\/dc:publisher><dc:date>\n        2006-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        attached<\/dc:rights><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2857\/2\/PolPrefPatriarch3_2006.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2857\/4\/licence.txt<\/dc:identifier><dc:identifier>\n          Cooke, LP  (2006) Policy, Preferences and Patriarchy: The Division of Domestic Labor in East Germany, West Germany and the United States   Social Politics, 13 (1).  pp. 117-143.      <\/dc:identifier><dc:relation>\n        10.1093\/sp\/jxj005<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2857\/","10.1093\/sp\/jxj005"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Pages 1 of 27 doi:10.1093\/sp\/jxj005\n© The Author 2006. Published by Oxford University Press. All rights reserved. For permissions, \nplease e-mail: journals.permissions@oxfordjournals.org.\nLYNN PRINCE COOKE\nPolicy, Preferences, and \nPatriarchy: The Division of \nDomestic Labor in East \nGermany, West Germany, \nand the United States\nAbstract\nIndividual agency observed in the gendered division of labor is\nshaped by structural factors, but only recently has evidence\nemerged that the effect of women’s resources varies systematically\nin its sociopolitical context. Here we use the 1994 International\nSocial Survey Program to assess whether the relative effect of a\nproxy for women’s and men’s preferences—hallmark of individual\nchoice—varies as well across three countries with divergent histori-\ncal policy approaches regarding the private sphere. East German\nsocialist policies required and supported women’s employment;\nWest German policy promulgated a male breadwinner model, and\nU.S. policy primarily remains silent on the private sphere. The divi-\nsion of domestic tasks and relative strength of individual prefer-\nences on shifting it vary by region. In the former East Germany the\ndivision of domestic labor is more egalitarian and the effect of pref-\nerences is small but equal for the genders. In West Germany\nthe division is more traditional and preference effects are greater,\nbut gender differences in these are insignificant. The U.S. division\nof domestic task falls between the two German regions, and the\ngender difference in preference effects is the greatest, with U.S.\nmen’s preferences predicting significantly more variance than do\n2 of 27 ◆ Cooke\nU.S. women’s. Consequently, allowing the market to dominate\ndoes not yield equal strength of preferences in the individual-level\nmodels used to predict the division of domestic tasks. This supports\nthe dual-system feminist claims that capitalism can exacerbate non-\nmarket patriarchal hierarchies.\nIntroduction\nCentral to shaping gender relations within a society is the extent\nto which the labor market and the state reinforce the traditional gen-\ndered division of labor, where the man is the primary breadwinner\nwhile the woman specializes in the domestic sphere. Neoclassical\neconomists (Becker 1981; Mincer and Polachek 1974) and some\nsociologists (Durkheim 1984 [1893]; Hakim 2000, 2003; Parsons\n1942) contend that the gendered division of labor is an optimal allo-\ncation of family time, based on women’s lower labor market returns\nand preferences for domestic tasks.\nAs to the market causes, the gender wage gap across countries\nremains real and persistent even after controlling for differences in\neducation and experience (Blau, Ferber, and Winkler 2002; Blau and\nKahn 1996; Gornick 1999). Despite women’s lower returns, their\nlabor force participation has steadily increased across industrialized\ncountries, along with their relative economic equality in the house-\nhold (Blau, Ferber, and Winkler 2002; Sorensen and McLanahan 1986).\nAcross countries, the increase in men’s share of unpaid domestic work\nand child care, however, has not been commensurate (Blossfeld and\nDrobnic 2001; Gershuny 2000).\nHakim (2000) claims that the gendered division of labor remains\nbecause modern society now provides women with more choices due\nto five historical changes: (1) the contraceptive revolution; (2) the\nequal opportunities revolution ensuring women have access to all\npositions, occupations, and careers; (3) expansion of white-collar\noccupations that are more attractive to women; (4) growth of the\nsecondary job market providing part-time employment; and (5) the\nincreasing importance of preferences in shaping lifestyle choices\n(Hakim 2003, 7). She argues that these changes have led to an\nincreasing heterogeneity among women as to their preferences for\nmarket versus domestic work.\nBecause of this heterogeneity among women, women as a group\ndo not support a single set of policies that affect the division of labor\nso that we do not observe any substantial change in its gendered\nnature (Hakim 2000). The two smallest groups, which she claims\ncomprise about 20 percent each of a given population, consist of\nwomen who are the most traditional and most nontraditional.\nPolicy, Preferences, and Patriarchy ◆ 3 of 27\nWomen with traditional preferences support any policies reinforcing\nthe male breadwinner model so that they might devote themselves to\nthe domestic sphere, whereas women with the most nontraditional\npreferences support any policies reinforcing their greater competi-\ntiveness in the labor market. Hakim argues that the majority of\nwomen lies between the two, at times supporting male breadwinner\npolicies and at times supporting dual-earner policies, depending on\ntheir current needs across the life course. Given their historical full-\ntime employment, men are more homogeneous in their preferences\nfor full-time paid employment and policy support thereof (Hakim\n2000).\nThere is a fundamental flaw in the logic of Hakim’s argument. She\nignores the extent to which the first four crucial changes are truly\naccessible to women and, in turn, constrain the fifth regarding their\nchoice of lifestyle. Taking a structuralist rather than the individual\nagency approach Hakim uses, many argue that nonmarket hierar-\nchies reinforce the gendered division of paid labor and are therefore\nthe cause, not the outcome, of its existence. Early theorizing on this\nissue came from dual-systems feminists who claim that patriarchy\nexists, reflecting a hierarchical relation where women are subordi-\nnate to men in a gender-ordered division of labor in addition to the\nwage-ordered system (Eisenstein 1981; Hartmann 1979, 1981b;\nWalby 1990). Hartmann (1981b, 18) argues, “Capitalist develop-\nment creates places for a hierarchy of workers, but . . . [g]ender and\nracial hierarchies determine who fills the empty places,” thereby\nstructuring the observed occupational gender segregation and wage\ndifferentials (Hartmann 1979). It is advantageous for men to main-\ntain this division, as they get greater control over economic resources\nand more time in leisure pursuits (Blau, Ferber, and Winkler 2002;\nGershuny 2000).\nUnlike the division of labor, however, it is difficult to find mea-\nsures of patriarchy. But as it reflects the nonmarket presence of male\ndominance, the extent of its possible existence might be assessed by\nthe extent to which nonmarket variables account for the division of\ndomestic labor. To wit, while Becker (1981) and Hakim (2000,\n2003) imply it is women’s preferences for domestic tasks that result\nin their continued responsibility for them, it is possible that the\nhousehold division of labor reflects men’s preferences opposed to\nunpaid domestic work and that men’s preferences dominate in a\npatriarchal society.\nOne way to ascertain whether it is individual preferences or an\ninstitutional and possibly patriarchal structure that is reflected in\ngender relations is to assess whether, controlling for relative\neconomic resources, men’s preferences are more important than\n4 of 27 ◆ Cooke\nwomen’s in predicting the household time allocated to unpaid\ndomestic tasks. If women’s preferences are significant predictors of\nthe reported division of domestic labor, this would support Hakim’s\ncontention that the gendered division of domestic labor reflects\nwomen’s choice, although it does not eliminate the likelihood that\nthe range of choices is socially constructed. If men’s preferences pre-\ndict more of the division of domestic labor than women’s, this sug-\ngests there might be some element of patriarchal dominance beyond\nthat derived from material relations.\nMost U.S. studies find that men’s gender ideology is more strongly\nassociated with the division of domestic tasks than is women’s, but in\neither case, attitudes account for very little variation in the division\nof labor (Shelton and John 1996). Fuwa (2004), using the United\nNations’s Gender Empowerment Measure,1 finds that the effect of\nwomen’s gender ideology is stronger or weaker for women in more\nversus less egalitarian countries, respectively. Yet to date no one has\nassessed whether policy alters the relative strength of women’s versus\nmen’s ideology in predicting the division of housework.\nHere, data from the 1994 International Social Survey Program are\nused to compare to what extent women’s and men’s relative eco-\nnomic resources and gender ideology—used as a proxy for prefer-\nences—predict the division of unpaid labor in three regions providing\ncontrasts in terms of policy impact on the private sphere: East and\nWest Germany and the United States. The specific policy contrasts\nwill be outlined in the next section, along with their hypothesized\neffects on the division of labor. The models and data are presented in\nthe third section, with results presented in the fourth. The final sec-\ntion concludes.\nThe State and the Gendered Division of Labor\nThe family exists in a policy context, with policies varying by the\nextent to which there are gendered inequalities in employment and\nthe value of paid work, as well as the nature and value of entitle-\nments (O’Connor 1993; Orloff 1993). States vary in the degree to\nwhich they reinforce a woman’s responsibility for unpaid care work\nin the home and her economic dependence on a male breadwinner\n(Lewis 1992) or mitigate her economic dependence, most frequently\nby enabling her to become integrated into the labor force (Hobson\n1990).\nThe former East and West Germany enable us to compare the\neffect of radically different policies on people who share a common\ncultural past. At the end of World War II, five Länder separated to\nform East Germany, while the remaining formed West Germany.\nPolicy, Preferences, and Patriarchy ◆ 5 of 27\nWest Germany founded a new political system based on “natural\nlaw” (Naturrecht), stemming from a “pre-political” patriarchal\norder “ordained by God” (Moeller 1993). Social provisions favoring\nmale breadwinners with nonworking wives were promulgated during\nthe 1950s and 1960s under Konrad Adenauer (Gerhard 1992; Ostner\n1992; Zimmerman 1993). Various tax provisions were introduced,\nsuch as income splitting, that proved particularly beneficial to high-\nincome, single-earner families. Mothers were deemed the only satis-\nfactory educators of their children (von Oertzen 1999), so in the\n1960s public schools were set up with varying daily schedules and\nwere closed over the lunch hour (Gornick, Meyers, and Ross 1997;\nOstner 1993).\nFewer West German women than men graduated from the highest\nsecondary school tracks; fewer still went on to university (Geschka\n1989). The German educational system is highly stratified, with most\nstudents going on to some type of vocational education in lieu of uni-\nversity, yet there are clear gender differences in the type of occupa-\ntional training selected (Geschka 1989). A 1966 federal report\nhighlighted gender disparities in educational attainment and con-\ncluded that West German women’s lack of educational pursuits were\nproving detrimental not to their employment prospects but to the\neducation of their children (von Oertzen 1999).\nIn contrast, East Germany adopted a Stalinist constitution in 1949\nthat enforced women’s obligation to work (Budde 1999; Moeller\n1993; Trappe 2000). According to socialist doctrine, women’s oppres-\nsion is a function of capitalist social relations (Marx 1967). Therefore,\nthe removal of women’s economic dependence presumably eliminates\ngender subjugation. To support maternal employment, East Germany\npassed the 1950 Mother and Child Care and Women’s Rights Acts,\nestablishing a network of public child care centers, kindergartens, and\nfacilities for free school meals, maternity leave, and days off to care for\nsick children (Ostner 1993; Zimmerman 1993). The state also man-\ndated developing the skill credentials of women through education and\nvocational training (Budde 1999; Korn et al. 1984). A larger propor-\ntion of East German women attended professional colleges and univer-\nsity than in West Germany, although East German women still\noverwhelmingly selected just sixteen, traditionally female vocational\ntracks out of the hundreds available to them (Nickel 1992).\nThe East German pronatalist policies assumed women’s responsi-\nbility for the domestic sphere, however, so maternity leaves, missed\ndays caring for sick children, and the like were extra costs of female\nemployees, with gender employment and earnings differences persist-\ning (Einhorn 1993; Ferree 1992; Nickel 1992). The 1965 Family\nLaw Code (Familiengesetzbuch) emphasized the equality of spouses\n6 of 27 ◆ Cooke\nand demanded a new male consciousness in child care and child-rearing,\nbut no policies were implemented to support the rhetoric (Budde\n1999; Zimmerman 1993).\nThe United States has similarities and differences with both German\nregions. The West German and U.S. welfare regimes are based on the\nprinciple of subsidiarity, where the family and nonstate institutions\nare primarily responsible for individual welfare (Esping-Andersen\n1990; Ostner 1992). But West German policy explicitly relies on\nwomen’s unpaid care work, whereas U.S. policy is essentially silent\non the private sphere (Leibfried and Ostner 1991). As a liberal wel-\nfare regime, the United States encourages market participation but\nalso relies on the market to supply any support for maternal employ-\nment (Gauthier 1996; Gornick, Meyers, and Ross 1997). Within the\nUnited States, religious beliefs are important as in West Germany,\nbut a legal separation of church and state has limited religion’s direct\npolicy effects to primarily those concerning women’s access to abor-\ntion, although this particular issue is so contested that it has become\na regular platform for U.S. presidential candidates.\nSince World War II, U.S. policy has primarily reflected the liberal\ntradition and addressed women’s ability to compete in the labor mar-\nket.2 U.S. women activists disagreed, however, as to whether policy\nshould acknowledge gender difference, as in West Germany, or pro-\nmote gender employment equality, as in East Germany (Costain\n1992; Stetson 1995). A cornerstone piece of legislation addressed gen-\nder equality: employment, training, and education discrimination on\nthe basis of gender became illegal under Title VII of the Civil Rights\nAct of 1964. During the 1970s, laws expanded enforcement of this\nlegislation, promoting equal educational opportunities and job train-\ning. During the same period, policies acknowledging gender differ-\nence were also passed, including provisions for unpaid maternity\nleave rights, tax deductions for child care expenses for working par-\nents, and women’s right to control their reproduction (Costain 1992).\nThe influence of policy on the division of paid labor is evident in\nthe relative 1990 married female labor force participation levels\nacross the three regions. At the time of German reunification in\n1990, over 90 percent of married women in the former East Germany\nwere employed, almost 70 percent full-time, as compared with just\n44 percent of married women in the west, only half of whom were\nemployed full-time (Ostner 1993). The net wages of East German\nwomen working full-time were 76 percent of men’s (Nickel 1992), as\ncompared with 65 percent for West German women working full-\ntime (Frevert 1989; Gornick 1999). The United States passed some\nequal employment policies, as did East Germany (although in neither\nregion was gender equality in employment achieved), but as in\nPolicy, Preferences, and Patriarchy ◆ 7 of 27\nWest Germany, the United States provided few social provisions to\nsupport maternal employment. By 1990, U.S. married women’s\nemployment was at 58 percent, 60 percent of whom were employed\nfull-time,3 and the U.S. women’s relative wage was 72 percent of\nmen’s (Blau, Ferber, and Winkler 2002), figures roughly midway\nbetween those for East and West German women.\nBecause these policy differences affect women’s labor force partic-\nipation levels and their relative economic resources, we would expect\nthe aggregate division of domestic labor to be most egalitarian in\nEast Germany, most traditional in West Germany, and somewhere in\nbetween in the United States. Any variation not accounted for by\nrelative economic resources is a function of, taking the agentic line,\nindividual preferences and\/or, taking the structuralist line, patriar-\nchal constraints. If these preferences are not socially constructed,\nthen their relative importance should be similar across the genders\nand sociopolitical contexts.\nIf, however, a patriarchal structure results from capitalist relations\nas suggested by Marx, both East German men and women should\nhold the most nontraditional gender ideology, and neither should\npredict a greater variance in the division of domestic tasks. At the\nother extreme of capitalist development lies the United States, where\none would expect relative economic resources to be significantly\nmore important. At the same time, Eisenstein (1981) and Hartmann\n(1979, 1981b) claim that capitalism exacerbates patriarchy, so\nwithin this context, U.S. men’s preferences should prove more signif-\nicant than women’s. In contrast, West German policy explicitly rein-\nforced the male breadwinner model and women’s responsibility for\nthe domestic sphere, so ideology should be important when predict-\ning the division of domestic labor. But given that separate roles were\nexplicitly reinforced by the West German sociopolitical context, it is\nunclear whether men’s preferences will prove more important than\nwomen’s.\nMethods and Data\nThe International Social Survey Program (ISSP) is a continuing\nannual program of cross-national research collaboration that utilizes\npreexisting social science projects and coordinates research goals in\ntwenty-six countries.4 The 1994 module is the second on Family and\nChanging Gender Roles; the first was conducted in 1988. While both\nmodules contain questions regarding gender roles and employment,\nonly the 1994 module asks respondents about who does the domestic\ntasks. In addition, only the 1994 module contains East German\nrespondents. There has been a more recent fielding of the survey in\n8 of 27 ◆ Cooke\n2002, but this would include East German couples who have lived a\nsignificant length of time under both German policy contexts. There-\nfore, the 1994 ISSP data are used to assess whether gender ideology,\nas a proxy for preferences, predicts the division of household labor\nbeyond that predicted by relative economic resources.\nThe terms “gender ideology” and “preferences” are being used\ninterchangeably. Hakim (1991) has argued that the types of attitudi-\nnal data used to derive measures of gender ideology are poor mea-\nsures of preferences, in that people do not necessarily accept\ngeneralizations as applying to their own particular cases. Yet she\nacknowledges that there are at least weak associations between such\nattitudinal data and observed behavior. Further, others have found\nthat gender ideology scales constructed from attitude questions iden-\ntical to those within the data used here are significant predictors of\nthe U.S. division of domestic labor (see Shelton and John 1996 for a\nreview), so it seems plausible that they will prove significant predic-\ntors in other societies. In addition, while there might be some ques-\ntion of validity when using such data to derive a measure of\npreferences, the interest here is not in an absolute measure of prefer-\nences but rather the relative importance of men’s versus women’s.5\nThe ISSP interviews a single household respondent, sometimes the\nfemale and sometimes the male, so models will be run separately for\nthe genders. As the division of labor is negotiated with a partner in\nthe household, only married respondents less than sixty-five years of\nage will be selected. The age restriction is applied because persons\nover sixty-five are more likely to be retired, at the end of a lifetime of\nemployment during which household patterns may have been estab-\nlished based on the historical division of labor rather than on current\ntime allocations.\nOnly married persons are selected because while the ISSP asks for\ncouples who are “married or living as married,” the national survey\ncenters confirmed that only married persons were included in this\ncategory. The rate of cohabitation has historically been much higher\nin the former East Germany as compared with either West Germany\nor the United States (Einhorn 1993; Ostner 1993), but in the last two\ncountries it is most often a prelude to marriage, not a stable family\nstate (Blossfeld 1995). Consequently, whether or not the couple\ncohabited with each other prior to the marriage is included as a con-\ntrol variable in the model.\nA scale score of responsibility for domestic tasks in East and West\nGerman and U.S. married households will be regressed on individual\nmeasures of gender ideology and relative resource and other control\nvariables with listwise deletion of missing data. Various imputations\nindicate the substantive results appear to be robust, so the more\nPolicy, Preferences, and Patriarchy ◆ 9 of 27\nconservative approach of listwise deletion is selected so as not to\nreduce variance and inflate significance levels. Greenstein (1996) found\na significant interaction effect between wives’ and husbands’ ideology\nand the division of household labor; types within a household cannot\nbe ascertained with the ISSP data because only one adult is inter-\nviewed regarding their own attitudes. Instead, particular attention\nwill be paid to the extent to which the independent female and male\ncross-sectional samples drawn for the ISSP appear complementary.\nDependent Variable\nThe scale measuring couples’ relative responsibility for domestic\ntasks is derived from questions on who is normally responsible for\n(1) caring for the sick, (2) doing laundry, (3) doing the grocery\nshopping, (4) deciding what to have for dinner, and (5) doing small\nrepairs (reverse coded). In a traditional division of domestic labor,\nthe women would always do the first four tasks and the man would\nalways do small repairs.6 Factor analysis (results not shown) reveals\nhigh loadings on a single factor for all but the fifth item, despite its\nreverse coding. Consequently, the domestic responsibility scale is\ncreated by summing responses across the four dominantly female\ntasks and dividing by four, resulting in a scale ranging from one, a\ntraditional division of the unpaid labor where the woman is always\nresponsible for the tasks, to five, a nontraditional division where\nthe man is always responsible. Cronbach’s (1951) alpha on the scale\nis 0.65 for West Germany, 0.55 for East Germany, and 0.70 for the\nUnited States, indicating fairly high internal consistency.\nMean responses on the scale by gender and region are shown in\nfigure 1. The difference in women’s and men’s reports is significant\nin West Germany and the United States but not East Germany.\nWhere there is a significant difference, men report a more nontradi-\ntional sharing of the tasks than do the women, a result found in other\nstudies using U.S. couple reports within a household (see Press and\nTownsley 1998). As anticipated, among women, East German women\nreport the most nontraditional sharing of domestic responsibility,\nwhereas West German women report the most traditional. U.S. men,\nhowever, unexpectedly report the most nontraditional sharing of\ndomestic tasks of all the groups. The difference in gendered percep-\ntions of who is responsible is also the greatest in the United States.\nWhether relative resources and gender attitudes explain these differ-\nences will be tested within the model.\nIndependent Variables\nGender Ideology Scale. Evidence indicates that where individuals\nhold a more traditional gender ideology, the division of domestic\n10 of 27 ◆ Cooke\ntasks is more traditional, and where individuals hold less traditional\ngender ideology, the domestic division is also less traditional (Blair\nand Lichter 1991; Presser 1994; Sanchez 1994). Fourteen questions\nin the ISSP assess the degree to which respondents support the tradi-\ntional division of labor (see table 1). Six questions are recoded so\nthat for all questions, a lower score indicates a more traditional gen-\nder ideology, while a higher score reflects a less traditional one. The\nfourteen measures are factor analyzed, with the factor loadings and\nCronbach’s alpha presented in table 2. Consistent across the coun-\ntries are three general factors: Domestic, WorkingMom, and Eco-\nnomic.7 The Domestic factor consists of those variables emphasizing\nwomen’s responsibility in the domestic sphere and the traditional\ndivision of labor: women want a home and child, housework satisfies\nas much as a paid job, and the husband should earn the money while\nthe wife looks after the home. For West Germany, also loading high\non this factor is that a reversal of traditional gender roles is not good.\nCronbach’s alpha indicates that the first three variables are internally\nconsistent across the countries (Carmines and Zeller 1979).\nThe second factor, WorkingMom, consists of those four questions\nassessing attitudes on how well women can balance paid employ-\nment with family. The internal consistency on this scale approaches\nFigure 1. Responsibility for Domestic Tasks Scale Reports by Gender East, West\nGermany and the United States.Married persons less than 65 years of age 1 = Wife\nalways responsible, 5 = Husband always responsible.\nPolicy, Preferences, and Patriarchy ◆ 11 of 27\n0.70 across the countries. The internal consistency on the third factor-\nbased scale, Economic, which assesses the extent to which women\nshould contribute economically to the family and whether work pro-\nvides women with independence, is lower at approximately 0.50 across\nthe countries.8\nTo improve measure reliability, a single scale is created using the\nthree consistent measures for Domestic and the four measures for\nWorkingMom. The scale is formed by summing responses on the\nseven variables and dividing by the number of variables so that each\nscale ranges from one, most traditional, to five, most nontraditional.\nThese seven variables yield an alpha of 0.76 for West Germany, 0.77\nfor East Germany, and 0.77 for the United States, indicating very\nhigh internal consistency (Carmines and Zeller 1979).\nControl Variables\nControl variables include relative resources, log of total household\nincome, age, children, whether the couple cohabited prior to the\nTable 1. Gender attitude questions on the 1994 International Social Survey\nProgram\nNote: (R) indicates reverse coding so that a higher score reflects more nontraditional\nattitudes.\n1. A working mother can establish just as warm and secure a relationship with \nher children as a mother who does not work. (R)\n2. A preschool child is likely to suffer if his or her mother works.\n3. All in all, family life suffers when the woman has a full-time job.\n4. A job is all right, but what most women really want is a home and children.\n5. Being a housewife is just as fulfilling as working for pay.\n6. Most women have to work these days to support their families. (R)\n7. Both the man and woman should contribute to the household income. (R)\n8. A man’s job is to earn money; a woman’s job is to look after the home and \nfamily.\n9. It is not good if the man stays at home and cares for the family and the \nwoman goes out to work.\n10. Women should stay at home full-time when there is a child under school age \n(three-point scale: home full-time, work part-time, work full-time).\n11. One parent can bring up a child as well as two parents together. (R)\n12. People who never have children lead empty lives.\n13. A pregnant woman should be able to obtain a legal abortion for any reason \nwhatsoever, if she chooses not to have the baby. (R)\n14. Work is best for women’s independence. (R)\nT\nab\nle\n 2\n.\nG\nen\nde\nr \nat\nti\ntu\nde\n f\nac\nto\nr \nsc\nor\nes\n f\nor\n W\nes\nt \nG\ner\nm\nan\ny,\n E\nas\nt \nG\ner\nm\nan\ny,\n a\nnd\n t\nhe\n U\nni\nte\nd \nSt\nat\nes\nN\not\nes\n:\nPr\nin\nci\npa\nl \nC\nom\npo\nne\nnt\n A\nna\nly\nsi\ns \nus\ned\n f\nor\n e\nxt\nra\nct\nio\nn;\n r\not\nat\ned\n w\nit\nh \nQ\nua\nrt\nim\nax\n w\nit\nh \nK\nai\nse\nr \nN\nor\nm\nal\niz\nat\nio\nn.\n B\nol\ndf\nac\ne \nco\nef\nfi\nci\nen\nts\n a\nre\n t\nho\nse\nco\nrr\nes\npo\nnd\nin\ng \nto\n t\nhe\n f\nac\nto\nr \nin\ndi\nca\nte\nd \nin\n t\nhe\n c\nol\num\nn \nhe\nad\nin\ng.D\nom\nes\nti\nc\nW\nor\nki\nng\nM\nom\nE\nco\nno\nm\nic\nU\nni\nqu\ne\nW\nes\nt\nE\nas\nt\nU\n.S\n.\nW\nes\nt\nE\nas\nt\nU\n.S\n.\nW\nes\nt\nE\nas\nt\nU\n.S\n.\nW\nes\nt\nE\nas\nt\nU\n.S\n.\nW\nom\nen\n w\nan\nt \nho\nm\ne \nan\nd \nch\nild\nre\nn\n.7\n9\n.7\n4\n.5\n4\n.0\n7\n.2\n1\n.4\n8\n.0\n2\n–.\n03\n–.\n11\nn\/\na\n.1\n0\n.3\n2\nH\nou\nse\nw\nif\ner\ny \nsa\nti\nsf\nie\ns \nas\n m\nuc\nh \nas\n p\nai\nd \nw\nor\nk\n.7\n0\n.7\n7\n.6\n8\n–.\n01\n.1\n6\n.2\n2\n.1\n3\n.0\n8\n.3\n3\nn\/\na\n.0\n0\n.0\n3\nH\nou\nse\nho\nld\n is\n w\nif\ne’\ns \njo\nb\n.7\n9\n.7\n1\n.3\n7\n.1\n6\n.2\n6\n.5\n9\n.1\n2\n.2\n0\n.0\n2\nn\/\na\n.1\n4\n.4\n4\nN\not\n g\noo\nd \nif\n w\nom\nen\n w\nor\nk;\n m\nen\n a\nt \nho\nm\ne\n.6\n5\n.0\n9\n.2\n1\n.1\n4\n.0\n1\n.4\n1\n–.\n02\n.0\n4\n–.\n14\nn\/\na\n.7\n7\n.4\n8\nW\nor\nki\nng\n m\not\nhe\nr \nha\ns \nO\nK\n r\nel\nat\nio\nns\nhi\np \nw\nit\nh \nki\nds\n.1\n0\n.0\n1\n–.\n26\n.6\n1\n.5\n4\n.7\n1\n.2\n4\n.3\n1\n.1\n7\nn\/\na\n.0\n7\n.0\n2\nPr\nes\nch\noo\nle\nr \nsu\nff\ner\ns \nif\n m\not\nhe\nr \nw\nor\nks\n.3\n8\n.2\n2\n.0\n3\n.6\n8\n.8\n0\n.8\n0\n–.\n16\n–.\n08\n.0\n2\nn\/\na\n.0\n6\n.0\n3\nFa\nm\nily\n s\nuf\nfe\nrs\n if\n m\not\nhe\nr \nw\nor\nks\n.4\n5\n.2\n7\n.0\n6\n.6\n3\n.7\n4\n.8\n2\n–.\n08\n–.\n02\n.0\n0\nn\/\na\n.0\n8\n.0\n9\nW\nom\nen\n w\nit\nh \npr\nes\nch\noo\nle\nr \nsh\nou\nld\n b\ne \nho\nm\ne\n.2\n4\n.1\n6\n.1\n5\n.6\n0\n.6\n1\n.6\n3\n.0\n8\n.1\n0\n.2\n3\nn\/\na\n–.\n14\n–.\n05\nW\nom\nen\n w\nor\nk \nto\n s\nup\npo\nrt\n f\nam\nily\n–.\n17\n–.\n12\n–.\n06\n.0\n2\n–.\n07\n.1\n3\n.6\n8\n.7\n1\n.5\n9\nn\/\na\n–.\n01\n.1\n0\nB\not\nh \nsh\nou\nld\n c\non\ntr\nib\nut\ne \nto\n in\nco\nm\ne\n.0\n6\n.0\n2\n–.\n01\n.3\n3\n.2\n7\n.3\n9\n.6\n6\n.6\n4\n.6\n3\nn\/\na\n–.\n09\n–.\n07\nW\nor\nk \nis\n g\noo\nd \nfo\nr \nw\nom\nen\n’s\n in\nde\npe\nnd\nen\nce\n.1\n5\n.1\n9\n.1\n5\n.1\n0\n.0\n1\n–.\n01\n.6\n2\n.6\n5\n.7\n4\nn\/\na\n.0\n2\n–.\n05\nO\nne\n p\nar\nen\nt \nis\n a\ns \ngo\nod\n a\ns \ntw\no\n–.\n06\n–.\n34\n–.\n48\n.5\n1\n.4\n2\n.4\n4\n.2\n7\n.2\n4\n.2\n6\nn\/\na\n.4\n1\n.2\n1\nN\no \nch\nild\n m\nea\nns\n a\nn \nem\npt\ny \nlif\ne\n.4\n0\n.1\n4\n–.\n08\n.1\n3\n.0\n3\n.1\n8\n–.\n03\n–.\n26\n–.\n13\nn\/\na\n.5\n8\n.6\n9\nL\neg\nal\n a\nbo\nrt\nio\nn \nO\nK\n f\nor\n a\nny\n r\nea\nso\nn\n.2\n8\n.2\n6\n.0\n3\n.0\n3\n.1\n9\n.0\n4\n.4\n4\n.4\n0\n.3\n3\nn\/\na\n–.\n09\n.6\n8\nC\nro\nnb\nac\nh’\ns \nal\nph\na:\n.7\n6\n.6\n0\n.6\n9\n.6\n6\n.6\n9\n.7\n7\n.5\n0\n.5\n0\n.5\n3\nn\/\na\n.2\n1\n.2\n6\nW\nit\nho\nut\n “\nN\not\n g\noo\nd \nif\n w\nom\nen\n w\nor\nk \n. .\n .”\n.7\n4\n.7\n3\n.6\n5\nPolicy, Preferences, and Patriarchy ◆ 13 of 27\nmarriage, whether either partner is previously divorced, and religious\nservice attendance. The first relative resource measure is an indicator\nvariable for when wives are not employed. This is to differentiate\neffects between households with the traditional gendered division of\npaid labor and households with varying divisions of paid labor. The\nISSP asks respondents about their own and their spouse’s labor force\nstatus in terms of several possible categories. Persons reporting they\nare a homemaker, in education, unemployed, or out of the labor\nforce are coded as not employed. Controlling for effects of the other\nvariables, women who are not employed are expected to have greater\nresponsibility for domestic tasks, as depicted by a negative coefficient\non this variable.\nMost studies have found that the smaller the gap between\nhusbands’ and wives’ earnings, the more equal the division of house-\nhold labor (Blair and Lichter 1991; Kamo 1991, 1994; Presser 1994;\nShelton and John 1996). Earnings are measured here with a variable\nof the respondent’s earnings as a percentage of total household\nincome. A wage variable would have been preferred, but the ISSP\ndata do not include hours of work for either German region with\nwhich to calculate hourly wages. On the other hand, the relative\nearnings measure does provide a proxy of relative family economic\npower. Women’s greater relative earnings are expected to predict a\nmore egalitarian division of responsibility for domestic tasks (a\npositive coefficient in the wives’ models), whereas men’s greater\nrelative earnings are expected to predict a more traditional division\nof domestic responsibility (a negative coefficient in the husbands’\nmodels).\nEducational attainment is often used as a measure of relative\nresources. Some U.S. evidence indicates that men’s education level is\npositively associated with their domestic participation (Brines 1993;\nPresser 1994; South and Spitze 1994), while other studies find no\nassociation (Kamo 1991; McAllister 1990) or that the effect disap-\npears once gender ideology is included (Kamo 1994). Women’s\ngreater educational attainment is associated with less time in domes-\ntic tasks (Blair and Lichter 1991; Brines 1993; South and Spitze\n1994) and is normally interpreted as an education effect on ideology.\nWomen’s education could also, however, reflect an indirect effect of\neconomic resources (controlled for in the model with the log of\nhousehold income variable) and the use of purchased domestic ser-\nvices. In the model here, ideology is controlled for, and too few ISSP\nrespondents report relying on a third person for domestic tasks.\nEducation will be measured with a single indicator variable for when\nthe respondent has postsecondary education, against a referent of\nsecondary schooling or less.9\n14 of 27 ◆ Cooke\nChildren have been found to increase women’s absolute and rela-\ntive share of domestic tasks (Brines 1993; McAllister 1990; Presser\n1994; Shelton and John 1996; South and Spitze 1994). This same\neffect is expected here, indicated if the child measure predicts a more\ntraditional division of domestic responsibility (negative coefficient),\nwith the effect possibly greater in West Germany where wives have\nbeen specifically charged with this responsibility. The presence of\nchildren is measured with an indicator variable when there are addi-\ntional persons in the household, against a referent of a two-person\nhousehold.10\nWomen’s employment and domestic activity patterns have histori-\ncally varied across the life course as they adapt to having children,\nwith labor force participation rates higher early in adulthood, falling\nduring childbearing years, and rising again once children reach\nschool age. Consequently, age is modeled with three indicator vari-\nables: one where the respondent is less than thirty, one when s\/he is\nthirty to thirty-nine, and one for when s\/he is fifty to sixty-five. The\nreferent is age forty to forty-nine, the prime labor force participation\nyears for both men and women.\nAn indicator variable is also included for when the couple cohab-\nited, against a referent of having not cohabited with the present\nspouse prior to marriage. Batalova and Cohen (2002) found that\ncouples who cohabited prior to marriage have more egalitarian divi-\nsions of domestic tasks than couples marrying directly.\nTwo variables control for prior marriages, one indicating if the\nwife and one indicating if the husband was previously divorced,\nagainst a referent of not being previously divorced. While some evi-\ndence for the United States indicates that divorced men perform the\ngreatest amount of domestic tasks relative to other men (South and\nSpitze 1994), Gupta (1999) finds that U.S. men’s domestic share\nalways declines when he is living with a woman.\nReligious conceptions of family reinforce the traditional division\nof labor, but the role of religion varies in the three policy contexts.\nEast German socialism discouraged religious attendance; West\nGerman policy incorporated religious conceptions of family; and\nthere is a formal separation of church and state in the United States.\nTwo indicator variables are used to capture the strength of religious\nconviction in each of the regions: one for persons attending religious\nservices monthly or several times a year and one for persons attend-\ning more frequently, against a referent of persons never attending.\nMore frequent religious service attendance is expected to predict a\nmore traditional division of domestic responsibility. It is not specu-\nlated, however, how the different policy environments might alter\nthese effects.\nPolicy, Preferences, and Patriarchy ◆ 15 of 27\nResults\nDescriptive statistics are reported in table 3. Comparing women’s\nand men’s responses suggests that the reporting is consistent in terms\nof household characteristics and relative earnings, regardless of the\ngender of the respondent. As would be expected in a male breadwin-\nner state, West German wife-respondents report that almost half of\nthem are out of the labor force, as compared with less than one-third\nof East German or U.S. wives. Among husband-respondents, the per-\ncentage whose wives are reportedly out of the labor force is slightly\nhigher across the regions than reported by wife-respondents: 59 percent\nin West Germany, 38 percent in East Germany, and 32 percent in the\nUnited States.\nAlso as would be expected, a higher percentage of East German\ncouples report cohabiting before marriage than in the other two\nregions, and U.S. couples are more likely to be in second marriages,\nwith about one-fifth reporting either the wife or husband was previ-\nously divorced. About half of the U.S. respondents report attending\nreligious services weekly or more frequently, whereas in the former\nWest Germany, the majority attend religious services monthly or sev-\neral times during the year. In the East German region, the majority of\nrespondents report they do not attend religious services.\nRegression results predicting the division of domestic responsibil-\nity are presented in table 4. Two models are run for each gender\nwithin each country. The first model contains the relative resource\nand control variables. The second model adds the gender ideology\nscale score to ascertain whether this, as a proxy for preferences, sig-\nnificantly improves upon the relative resources model. The change in\nthe F statistic is significant for all groups except East German men\nand U.S. women, although it is only marginally significant for East\nGerman women. This supports that preferences, controlling for rela-\ntive economic resources, are important predictors of the division of\ndomestic labor, although the relative significance varies in its cultural\ncontext.\nOnly among U.S. men does having a wife out of the labor force\npredict that he will do significantly less of the domestic tasks, once\ncontrolling for the effects of the other variables. More consistent is\nthe effect of a respondent’s proportional earnings, except among East\nGerman women. For the other genders and regions, the more a man\nearns, the more traditional the division of domestic tasks, and the\nmore the woman earns, the less traditional the division of domestic\ntasks. The size of this effect is roughly similar, with each percentage\npoint increase in income shifting the division of labor 0.003 (East\nGermany) to 0.006 (United States) on the five-point scale. So\nT\nab\nle\n 3\n.\nD\nes\ncr\nip\nti\nve\n s\nta\nti\nst\nic\ns \nof\n E\nas\nt \nG\ner\nm\nan\n, W\nes\nt \nG\ner\nm\nan\n, a\nnd\n U\n.S\n. m\nar\nri\ned\n p\ner\nso\nns\n le\nss\n t\nha\nn \nsi\nxt\ny-\nfi\nve\n y\nea\nrs\n o\nf \nag\ne\nN\not\ne:\n D\nom\nes\nti\nc \nsc\nal\ne \nsc\nor\ne \nra\nng\nes\n f\nro\nm\n 1\n, w\nhe\nre\n t\nhe\n w\nif\ne \nis\n a\nlw\nay\ns \nre\nsp\non\nsi\nbl\ne,\n t\no \n5,\n w\nhe\nre\n t\nhe\n h\nus\nba\nnd\n is\n a\nlw\nay\ns \nre\nsp\non\nsi\nbl\ne.\n T\nhe\n a\ntt\nit\nud\ne \nsc\nal\ne\nsc\nor\ne \nra\nng\nes\n f\nro\nm\n 1\n, m\nos\nt \ntr\nad\nit\nio\nna\nl g\nen\nde\nr \nat\nti\ntu\nde\ns,\n t\no \n5,\n m\nos\nt \nno\nnt\nra\ndi\nti\non\nal\n.\nE\nas\nt \nG\ner\nm\nan\ny\nW\nes\nt \nG\ner\nm\nan\ny\nU\nni\nte\nd \nSt\nat\nes\nW\niv\nes\nH\nus\nba\nnd\ns\nW\niv\nes\nH\nus\nba\nnd\ns\nW\niv\nes\nH\nus\nba\nnd\ns\nM\nea\nns\nD\nom\nes\nti\nc \nsc\nal\ne \nsc\nor\ne\n2.\n21\n2.\n27\n1.\n97\n2.\n08\n2.\n16\n2.\n39\nSD\n0.\n51\n0.\n43\n0.\n57\n0.\n55\n0.\n62\n0.\n53\nR\nes\npo\nnd\nen\nt \n%\n e\nar\nni\nng\ns\n39\n.3\n7\n58\n.2\n8\n17\n.6\n7\n78\n.4\n4\n29\n.7\n4\n74\n.7\n7\nSD\n18\n.0\n2\n20\n.2\n8\n21\n.5\n1\n22\n.0\n1\n28\n.0\n1\n25\n.9\n8\nL\nog\n h\nou\nse\nho\nld\n in\nco\nm\ne\n1.\n42\n1.\n44\n1.\n61\n1.\n65\n3.\n79\n3.\n86\nSD\n0.\n28\n0.\n29\n0.\n34\n0.\n36\n0.\n59\n0.\n47\nA\ntt\nit\nud\ne \nsc\nal\ne \nsc\nor\ne\n3.\n61\n3.\n59\n2.\n86\n2.\n65\n3.\n04\n2.\n89\nSD\n0.\n69\n0.\n67\n0.\n76\n0.\n72\n0.\n73\n0.\n69\nPe\nrc\nen\nta\nge\ns\nW\nif\ne \nno\nt \nem\npl\noy\ned\n27\n38\n49\n59\n30\n32\nR\nes\npo\nnd\nen\nt \nw\nit\nh \nco\nlle\nge\n12\n24\n10\n18\n34\n45\nC\nhi\nld\nre\nn\n66\n67\n65\n67\n62\n66\nL\nes\ns \nth\nan\n a\nge\n 3\n0\n14\n8\n14\n9\n14\n11\nA\nge\n 3\n0 \nto\n 3\n9\n20\n27\n30\n27\n36\n32\nA\nge\n 5\n0 \nto\n 6\n4\n38\n37\n30\n38\n26\n21\nC\noh\nab\nit\ned\n45\n54\n41\n40\n32\n34\nW\nif\ne \ndi\nvo\nrc\ned\n12\n10\n6\n6\n20\n19\nH\nus\nba\nnd\n d\niv\nor\nce\nd\n15\n12\n8\n7\n22\n23\nA\ntt\nen\nd \nse\nrv\nic\nes\n m\non\nth\nly\n30\n23\n59\n59\n37\n37\nA\ntt\nen\nd \nse\nrv\nic\nes\n w\nee\nkl\ny\n8\n5\n24\n22\n49\n44\nN\n24\n4\n24\n7\n39\n8\n43\n8\n19\n1\n24\n9\nT\nab\nle\n 4\n.\nC\noe\nff\nic\nie\nnt\ns \nin\n o\nrd\nin\nar\ny \nle\nas\nt \nsq\nua\nre\ns \n(O\nL\nS)\n r\neg\nre\nss\nio\nn \nm\nod\nel\ns \npr\ned\nic\nti\nng\n w\nif\ne \n(–\n) \nve\nrs\nus\n h\nus\nba\nnd\n (\n+)\n r\nes\npo\nns\nib\nili\nty\n f\nor\n d\nom\nes\nti\nc \nta\nsk\ns\nE\nas\nt \nG\ner\nm\nan\ny\nW\nes\nt \nG\ner\nm\nan\ny\nU\nni\nte\nd \nSt\nat\nes\nW\niv\nes\nH\nus\nba\nnd\ns\nW\niv\nes\nH\nus\nba\nnd\ns\nW\niv\nes\nH\nus\nba\nnd\ns\nM\nod\nel\n 1\nM\nod\nel\n 2\nM\nod\nel\n 1\nM\nod\nel\n 2\nM\nod\nel\n 1\nM\nod\nel\n 2\nM\nod\nel\n 1\nM\nod\nel\n 2\nM\nod\nel\n 1\nM\nod\nel\n 2\nM\nod\nel\n 1\nM\nod\nel\n 2\nW\nif\ne \nno\nt \nem\npl\noy\ned\n−\n0.\n06\n3\n−\n0.\n07\n9\n−\n0.\n04\n1\n−\n0.\n03\n8\n−\n0.\n04\n5\n−\n0.\n00\n3\n−\n0.\n08\n4\n−\n0.\n02\n9\n−\n0.\n16\n0\n−\n0.\n17\n4\n−\n0.\n19\n4*\n−\n0.\n13\n7\nR\nes\npo\nnd\nen\nt’\ns \n%\n e\nar\nni\nng\ns\n0.\n00\n0\n−\n0.\n00\n1\n−\n0.\n00\n4*\n*\n−\n0.\n00\n3*\n0.\n00\n5*\n0.\n00\n4∧\n−\n0.\n00\n4*\n*\n−\n0.\n00\n4*\n*\n0.\n00\n6*\n*\n0.\n00\n6*\n**\n−\n0.\n00\n5*\n*\n−\n0.\n00\n4*\n*\nR\nes\npo\nnd\nen\nt \nw\nit\nh \nco\nlle\nge\n−\n0.\n03\n3\n−\n0.\n03\n5\n0.\n18\n2*\n*\n0.\n17\n1*\n0.\n12\n0\n0.\n09\n2\n0.\n13\n6∧\n0.\n09\n1\n0.\n14\n0\n0.\n14\n8∧\n0.\n17\n1*\n0.\n16\n5*\nL\nog\n o\nf \nho\nus\neh\nol\nd \nin\nco\nm\ne\n0.\n09\n3\n0.\n07\n2\n−\n0.\n13\n3\n−\n0.\n14\n0\n−\n0.\n14\n6\n−\n0.\n16\n3∧\n−\n0.\n17\n6*\n−\n0.\n20\n6*\n*\n0.\n08\n7\n0.\n09\n7\n−\n0.\n14\n4∧\n−\n0.\n15\n9*\nC\nhi\nld\nre\nn \nin\n \nho\nus\neh\nol\nd\n0.\n00\n1\n−\n0.\n00\n3\n−\n0.\n00\n3\n−\n0.\n01\n0\n−\n0.\n18\n7*\n*\n−\n0.\n20\n1*\n*\n−\n0.\n18\n6*\n*\n−\n0.\n18\n0*\n*\n−\n0.\n12\n4\n−\n0.\n11\n7\n−\n0.\n13\n4∧\n−\n0.\n12\n7∧\nR\nes\npo\nnd\nen\nt \nle\nss\n t\nha\nn \n30\n−\n0.\n03\n1\n−\n0.\n04\n1\n0.\n08\n6\n0.\n08\n7\n0.\n17\n4∧\n0.\n16\n3∧\n0.\n22\n7*\n0.\n19\n0∧\n0.\n39\n8*\n**\n0.\n41\n8*\n**\n0.\n33\n6*\n*\n0.\n27\n4*\nA\nge\n 3\n0 \nto\n 3\n9\n0.\n02\n7\n0.\n02\n5\n0.\n08\n8\n0.\n08\n5\n0.\n22\n3*\n*\n0.\n19\n0*\n*\n0.\n01\n8\n−\n0.\n03\n4\n0.\n19\n2∧\n0.\n21\n4*\n0.\n07\n5\n0.\n07\n6\nA\nge\n 5\n0 \nto\n 6\n4\n−\n0.\n08\n0\n−\n0.\n06\n2\n−\n0.\n11\n9\n−\n0.\n11\n2\n−\n0.\n14\n1∧\n−\n0.\n13\n9∧\n−\n0.\n18\n1*\n*\n−\n0.\n15\n0*\n−\n0.\n00\n7\n0.\n00\n0\n−\n0.\n00\n2\n0.\n00\n3\nC\nou\npl\ne \nco\nha\nbi\nte\nd\n0.\n04\n5\n0.\n05\n2\n0.\n00\n8\n0.\n00\n9\n0.\n03\n9\n0.\n01\n4\n0.\n21\n6*\n**\n0.\n20\n3*\n**\n−\n0.\n12\n8\n−\n0.\n13\n4\n0.\n13\n1\n0.\n10\n8\nW\nif\ne \npr\nev\nio\nus\nly\n \ndi\nvo\nrc\ned\n0.\n03\n9\n0.\n04\n3\n0.\n10\n4\n0.\n10\n9\n0.\n36\n5*\n*\n0.\n37\n0*\n*\n−\n0.\n04\n9\n−\n0.\n05\n4\n−\n0.\n01\n1\n−\n0.\n01\n9\n−\n0.\n06\n0\n−\n0.\n03\n7\nco\nnt\nin\nue\nd\nN\not\ne:\nD\nep\nen\nde\nnt\n v\nar\nia\nbl\ne \nis\n a\n s\nca\nle\n s\nco\nre\n o\nf \nw\nho\n is\n r\nes\npo\nns\nib\nle\n f\nor\n s\nev\ner\nal\n d\nom\nes\nti\nc \nta\nsk\ns,\n r\nan\ngi\nng\n f\nro\nm\n 1\n, w\nhe\nre\n t\nhe\n w\nif\ne \nis\n a\nlw\nay\ns \nre\nsp\non\nsi\nbl\ne,\n t\no \n5,\n w\nhe\nre\n t\nhe\n h\nus\nba\nnd\nis\n a\nlw\nay\ns \nre\nsp\non\nsi\nbl\ne.\nÙ p\n <\n .1\n0;\n *\np \n< \n.0\n5;\n *\n*p\n <\n .0\n1;\n *\n**\np \n< \n.0\n01\n.\nT\nab\nle\n 4\n.\nco\nnt\nin\nue\nd\nE\nas\nt \nG\ner\nm\nan\ny\nW\nes\nt \nG\ner\nm\nan\ny\nU\nni\nte\nd \nSt\nat\nes\nW\niv\nes\nH\nus\nba\nnd\ns\nW\niv\nes\nH\nus\nba\nnd\ns\nW\niv\nes\nH\nus\nba\nnd\ns\nM\nod\nel\n 1\nM\nod\nel\n 2\nM\nod\nel\n 1\nM\nod\nel\n 2\nM\nod\nel\n 1\nM\nod\nel\n 2\nM\nod\nel\n 1\nM\nod\nel\n 2\nM\nod\nel\n 1\nM\nod\nel\n 2\nM\nod\nel\n 1\nM\nod\nel\n 2\nH\nus\nba\nnd\n \npr\nev\nio\nus\nly\n \ndi\nvo\nrc\ned\n0.\n17\n0\n0.\n13\n4\n−\n0.\n11\n4\n−\n0.\n10\n5\n−\n0.\n20\n8∧\n−\n0.\n20\n0∧\n0.\n11\n4\n0.\n13\n4\n−\n0.\n02\n1\n−\n0.\n01\n6\n−\n0.\n02\n8\n−\n0.\n02\n6\nA\ntt\nen\nds\n \nse\nrv\nic\nes\n \nm\non\nth\nly\n−\n0.\n06\n5\n−\n0.\n05\n4\n0.\n01\n8\n0.\n02\n3\n0.\n08\n0\n0.\n08\n4\n−\n0.\n08\n2\n−\n0.\n06\n9\n−\n0.\n38\n5*\n*\n−\n0.\n39\n4*\n**\n0.\n03\n8\n0.\n05\n2\nA\ntt\nen\nds\n \nse\nrv\nic\nes\n \nw\nee\nkl\ny\n−\n0.\n05\n9\n−\n0.\n00\n7\n−\n0.\n30\n4*\n−\n0.\n26\n9*\n−\n0.\n05\n8\n−\n0.\n03\n3\n−\n0.\n17\n3*\n−\n0.\n12\n8∧\n−\n0.\n36\n7*\n*\n−\n0.\n39\n2*\n*\n−\n0.\n03\n6\n−\n0.\n01\n2\nA\ntt\nit\nud\ne \nsc\nal\ne \nsc\nor\ne\n0.\n09\n2∧\n0.\n05\n4\n0.\n13\n0*\n**\n0.\n20\n4*\n**\n−\n0.\n06\n0\n0.\n15\n4*\n*\nC\non\nst\nan\nt\n2.\n09\n5*\n**\n1.\n81\n7*\n**\n2.\n67\n5*\n**\n2.\n47\n6*\n**\n2.\n17\n1*\n**\n1.\n83\n5*\n**\n2.\n87\n8*\n**\n2.\n35\n7*\n**\n1.\n99\n**\n*\n2.\n12\n4*\n**\n3.\n28\n1*\n**\n2.\n84\n6*\n**\nN\n24\n4\n24\n4\n24\n7\n24\n7\n39\n8\n39\n8\n43\n8\n43\n8\n24\n9\n24\n9\n19\n1\n19\n1\nA\ndj\nus\nte\nd \nR\n2\n−\n0.\n01\n−\n0.\n00\n0.\n06\n0.\n06\n0.\n14\n0.\n16\n0.\n16\n0.\n22\n0.\n19\n0.\n19\n0.\n20\n0.\n24\nF \nch\nan\nge\n0.\n81\n3.\n12\n∧\n2.\n17\n**\n1.\n71\n5.\n90\n**\n*\n11\n.2\n8*\n**\n7.\n49\n**\n*\n33\n.1\n4*\n**\n5.\n46\n**\n*\n1.\n11\n4.\n73\n**\n*\n8.\n60\n**\nPolicy, Preferences, and Patriarchy ◆ 19 of 27\nalthough earnings prove statistically significant, their substantive\neffects are quite modest, shifting the division of domestic responsibil-\nities less than one scale point where the respondent is the sole bread-\nwinner. In the case of female respondents, these results suggest that\nwhen she is the primary breadwinner of the couple, the division of\ndomestic responsibilities is at best equal. These results are consistent\nwith other findings that couples “do” gender in domestic tasks to\nreinforce masculine and feminine identities when the traditional eco-\nnomic roles are reversed (Fenstermaker Berk 1985; Brines 1994;\nHochschild 1989; West and Zimmerman 1987).\nControlling for relative earnings, West German women and men\nand U.S. men report that households with greater income have a\nmore traditional division of domestic tasks. The magnitude of the\nincome effect is approximately equal to—and in the opposite direc-\ntion of—education effects. As found in other empirical studies, men\nwith college education report a more egalitarian division of domestic\nresponsibility. A similar effect is found for U.S. women respondents\nafter controlling for gender ideology, although this effect is just mar-\nginally significant. For East German and U.S. men, the significant\neducation effect persists after controlling for gender ideology,\nwhereas it attenuates for West German men.\nThe presence of children in the household predicts a more tradi-\ntional division of domestic tasks for both West German genders and\nfor U.S. men, although in the latter case, the effect is marginally sta-\ntistically significant. Age effects are also apparent in West Germany\nand the United States. Controlling for the presence of children,\nyounger U.S. and German persons report a more nontraditional divi-\nsion of domestic tasks than the referent group of persons in their for-\nties. For both West German genders only, being the oldest age group,\nhaving grown up during the height of the pater familias rhetoric of\nthe Adenauer years, predicts a more traditional division.\nCohabitation and previous divorce effects are only significant\namong West Germans. West German men who cohabited prior to\nmarriage report a significantly more nontraditional division of\ndomestic tasks, but West German women do not appear to concur.\nWhen a West German woman has been previously divorced, how-\never, she reports a more nontraditional division of domestic tasks,\nwhereas when a West German woman reports her husband has been\ndivorced, the division is more traditional. West German men report\nno similar divorce effects for either themselves or their wives.\nAttendance at religious services has significant effects in all three\nregions but not across the genders. Both East and West German men\nattending religious services weekly or more frequently are predicted\nto have a more traditional division of domestic tasks, but attendance\n20 of 27 ◆ Cooke\nis insignificant for these regions’ wife-respondents. In contrast, U.S.\nwomen attending religious services at any frequency are predicted to\nhave a more traditional division of domestic tasks, but U.S. husband-\nrespondents attending services report no similar effect. All of these\nreligion effects are controlling for attitudes, so some of the influence\nof religion on reinforcing normative male and female roles appears to\nbe direct.\nAs noted at the beginning of this section, inclusion of the prefer-\nence measure significantly improves the model except among U.S.\nwomen. The smallest difference between women’s and men’s coeffi-\ncients on the preference measure is found in East Germany.11 These\nresults suggest that socialist policies can reduce at least some of the\ngendered differences in the allocation of time to domestic labor,\nalthough the aggregate data suggests that East German women still\nretain primary responsibility. At the other end of the capitalist con-\ntinuum, preferences are insignificant in predicting the division of\ndomestic labor among U.S. women but are highly significant among\nU.S. men. The difference between the two U.S. genders is also the\nonly preference coefficient difference that reaches statistical signifi-\ncance. Finally, preferences explain a significant amount of the varia-\ntion in the division of domestic labor in West Germany for both men\nand women, but the difference between the genders is not statistically\nsignificant.\nSummary and Conclusions\nInternational Social Survey Program data have been used to com-\npare the effects of measures of individual agency—relative resources\nand a proxy for preferences—on the gendered division of domestic\nlabor across, and whether women’s or men’s preferences dominate\nwithin, differing sociopolitical contexts. The country cases of East\nand West Germany and the United States were selected as varying the\ndegree of policy reliance on women’s unpaid work in the private\nsphere.\nResults reveal that while relative resources alter the division of\ndomestic labor across the three regions, women are still apt to\nspend more time in domestic tasks than men. Preferences prove sig-\nnificant for all but East German men and U.S. women, but the size\nof these effects is modest. That preferences do not fully account for\nthe remaining variance in the division of domestic labor once con-\ntrolling for relative resources could support Hakim’s contention\nthat attitudes are at best weak measures of preferences. Alterna-\ntively, these results could reflect that the gendered division of\ndomestic labor is structurally determined and cannot be explained\nPolicy, Preferences, and Patriarchy ◆ 21 of 27\naway by individual factors. Differentiating between these two pos-\nsible explanations requires that preference, not just attitude, measures\nare incorporated in future cross-national social survey programs.\nAs would have been predicted by Marx, the division of domestic\nlabor is slightly more egalitarian among East German couples, and\nEast German women’s preferences are as important as men’s in pre-\ndicting movements from this average. But the socialist structure by\nno means eliminated gender differences in the home. In contrast, the\ndifference between U.S. women’s and men’s preference coefficients is\nthe only regional gender difference to reach statistical significance,\nwith U.S. men’s preferences being more important determinants of\nthe division of domestic labor than women’s. This suggests some\nsupport for the dual-feminist claim that a purely capitalist structure\nmay exacerbate patriarchy.\nIn West Germany preferences explain a significant amount of the\nvariation in the division of domestic labor for both men and women,\nbut the difference between the genders is not statistically significant.\nThus, an explicitly patriarchal structure does not necessarily increase\nthe relative gender strength of preferences in determining the division\nof domestic labor. This is not to say that the patriarchy reinforced in\nWest German policy is less effective at institutionalizing it, but its\neffects are not reflected in gender preference differences. West German\nwomen’s reinforced domestic responsibility is evident in significant\neffects found for having children.\nOne benefit of explicit policy, however, is that it can explicitly be\nchallenged and changed. Evidence of this may be manifesting in the\nstrong secular effects toward more egalitarian domestic labor divi-\nsions found for the younger West German persons as compared with\nthose oldest respondents growing up during the height of the male\nbreadwinner policy rhetoric. Whether explicitly nonpatriarchal pol-\nicy in a capitalist society would have the desired effect in shifting the\ndivision of domestic labor, or merely have patriarchal effects sub-\nsumed within individual preferences, is unknown.\nClearly, however, the market alone does not ensure egalitarian\ngender relations and may in fact exacerbate the nonmarket hierar-\nchies. Further comparative research is needed to disentangle these\ninterwoven effects and where in our models they manifest.\nNOTES\nLynn Prince Cooke is a postdoctoral research fellow in the School of\nSocial and Behavioural Science at University of Queensland. She recently\ncompleted her doctorate at Oxford University and researches the effect of\npolicy on gender equity and equity effects on family outcomes. Her work\n22 of 27 ◆ Cooke\nhas appeared in European Sociological Review and Journal of Marriage and\nFamily, and her article on “doing” gender in context is forthcoming in\nAmerican Journal of Sociology. She is currently working on a book compar-\ning policy effects on gender power and family outcomes in seven countries.\n1. The Gender Empowerment Measure consists of the percentage of par-\nliamentary seats held by women, the percentage of women in administrative\nor managerial, as well as professional or technical positions, and women’s\nshare of earnings income.\n2. Feminist or reformer concerns for women as mothers also played a\nkey role in U.S. policy, particularly at the end of the nineteenth and begin-\nning of the twentieth centuries. Orloff (1996) provides a review of the schol-\narship documenting this era. The discourse changed, however, with attempts\nto eliminate marriage bars implemented during the Great Depression (Hobson\n1993).\n3. Calculated from the 1995 Statistical Abstract of the United States,\ntables 637 and 677.\n4. More information on the ISSP, including codebooks, is available at\nhttp:\/\/www.issp.org (accessed 26 January 2006).\n5. Comparing the relative importance of the measures to the genders\nwithin each region also reduces the concern regarding response bias due to\nsocial desirability that might vary across contexts.\n6. One response category was “tasks done by third person,” although it\nwas unclear if this was hired assistance or other family members. Further, few\nrespondents answered in this way and whether third persons were used for\neach of the tasks varied, so this category was recoded as missing. For the most\npart, third persons were most likely to be used to conduct the small repairs.\n7. Braun, Scott, and Alwin (1994) also derived three similar core factors\nfor East and West Germans using the 1988 ISSP, so these factors appear to\nbe stable across time. Using different data, the 1991 German General Social\nSurvey, they found only two factors, but the questions were phrased and\nscaled differently than ISSP questions (Braun, Scott, and Alwin 1994).\n8. While the Domestic, WorkingMom, and Economic factors are com-\nmon to all three countries and explain about half the variance in responses\nto the fourteen questions, both East German and U.S. responses each yield a\nmarginally significant, but not the same, fourth factor, displayed in the final\ncolumns of table 2. For East Germany, the fourth factor consists of the ques-\ntions regarding gender role reversal and whether having no children means\nan empty life, although the internal consistency is very low. For the United\nStates, questions on legal abortion and whether having no children means an\nempty life form a factor. While these fourth factors illustrate the unique cul-\ntural aspects of gender attitudes in East Germany and the United States, they\nare not comparable across the countries and have low internal consistency\nand are excluded from the analyses.\n9. Very few persons in the German regions report not completing sec-\nondary schooling, so a referent of less than secondary schooling could not be\nused against which to compare effects of secondary schooling. The percentage\nof U.S. persons without secondary schooling is more substantial, at around\n10 percent.\nPolicy, Preferences, and Patriarchy ◆ 23 of 27\n10. This is the best proxy for children available with the ISSP data across\nthe countries. Another variable asked for life course status in terms of how\nmany adults and children lived in the household, but missing data on this\nvariable were more extensive than on the variable used.\n11. The relative size of effects is calculated as the difference in the\nunstandardized coefficients divided by the standard error of this difference\n(the square root of the sum of the squared standard errors of each coeffi-\ncient). This difference can be statistically significant even if any individual\ncoefficient has not been shown to be statistically different from zero in pre-\ndicting the dependent variable.\nREFERENCES\nBatalova, Jeanne A., and Philip N. Cohen. 2002. “Premarital Cohabitation\nand Housework: Couples in Cross-National Perspective.” Journal of\nMarriage and Family 64: 743–55.\nBecker, Gary S. 1981. A Treatise on the Family. Cambridge, Mass.: Harvard\nUniversity Press.\nBlair, Sampson L., and Daniel T. Lichter. 1991. “Measuring the Division of\nHousehold Labor: Gender Segregation of Housework among American\nCouples.” Journal of Family Issues 12: 91–113.\nBlau, Francine D., Marianne A. Ferber, and Anne E. Winkler. 2002. The\nEconomics of Women, Men, and Work. 4th ed. Englewood Cliffs, N.J.:\nPrentice-Hall.\nBlau, Francine D., and Lawrence M. Kahn. 1996. “Wage Structure and Gen-\nder Earnings Differentials: An International Comparison.” Economica 63\n(suppl.): S29–S62.\nBlossfeld, Hans-Peter. 1995. “Changes in the Process of Family Formation\nand Women’s Growing Economic Independence: A Comparison of Nine\nCountries.” In The New Role of Women: Family Formation in Modern\nSocieties, ed. Hans-Peter Blossfeld, 3–32. Boulder, Colo.: Westview Press.\nBlossfeld, Hans-Peter, and Sonja Drobnic. 2001. A Cross-National Compara-\ntive Approach to Couples’ Careers. Oxford, U.K.: Oxford University Press.\nBraun, Michael, Jacqueline Scott, and Duane F. Alwin. 1994. “Economic\nNecessity of Self-Actualization? Attitudes Toward Women’s Labour-\nForce Participation in East and West Germany.” European Sociological\nReview 10 (1): 29–47.\nBrines, Julie. 1993. “The Exchange Value of Housework.” Rationality and\nSociety 5: 302–40.\n———. 1994. “Economic Dependency, Gender, and the Division of Labor\nat Home.” American Journal of Sociology 100: 652–88.\nBudde, Gunilla-Friederike. 1999. “Women’s Policies in the GDR in the\n1960s\/70s: Between State Control and Societal Reaction.” In State Policy\nand Gender System in the Two German States and Sweden, 1945–1989,\ned. Rolf Torstendahl, 199–217. Lund, Sweden: Bloms i Lund Tryckeri AB.\nCarmines, Edward G., and Richard A. Zeller. 1979. Reliability and Validity\nAssessment. Beverly Hills, Calif.: Sage.\n24 of 27 ◆ Cooke\nCostain, Anne N. 1992. Inviting Women’s Rebellion: A Political Process\nInterpretation of the Women’s Movement. Baltimore, Md.: Johns Hopkins\nUniversity Press.\nCronbach, Lee J. 1951. “Coefficient Alpha and the Internal Structure of\nTests.” Psychometrica 16: 297–334.\nDurkheim, Emile. 1984 [1893]. The Division of Labor in Society. New York:\nFree Press.\nEinhorn, Barbara 1993. Cinderella Goes to Market: Citizenship, Gender,\nand Women’s Movements in East Central Europe. London: Verso.\nEisenstein, Zillah R. 1981. The Radical Future of Liberal Feminism. New York:\nLongman.\nEsping-Andersen, Gosta. 1990. The Three Worlds of Welfare Capitalism.\nPrinceton, N.J.: Princeton University Press.\nFenstermaker Berk, Sarah. 1985. The Gender Factory: The Apportionment\nof Work in American Households. New York: Plenum Press.\nFerree, Myra Marx. 1992. “Institutionalizing Gender Equality: Feminist Pol-\nitics and Equality Offices.” German Politics and Society 24–25 (Winter\n1991–92): 53–65.\nFrevert, Ute. 1989. Women in German History: From Bourgeois Emancipa-\ntion to Sexual Liberation. Oxford, U.K.: Berg.\nFuwa, Makiko. 2004. “Macro-Level Gender Inequality and the Division of\nHousehold Labor in 22 Countries.” American Sociological Review 69:\n751–67.\nGauthier, Anne Hélène. 1996. The State and the Family: A Comparative\nAnalysis of Family Policies in Industrialized Countries. Oxford, U.K.:\nClarendon Press.\nGerhard, Ute. 1992. “German Women and the Social Costs of Unification.”\nGerman Politics and Society 24–25 (Winter 1991–92): 16–33.\nGershuny, Jonathan. 2000. Changing Times: Work and Leisure in Postin-\ndustrial Society. Oxford, U.K.: Oxford University Press.\nGeschka, Otti. 1989. “Participation and Disadvantage: Women in the Edu-\ncational System.” In The Federal Republic of Germany, ed. Eva Kolinksy,\n189–98. Oxford, U.K.: Berg.\nGornick, Janet C. 1999. “Gender Equality in the Labour Market: Women’s\nEmployment and Earnings.” In Gender and Welfare State Regimes, ed.\nDiane Sainsbury, 210–42. Oxford, U.K.: Oxford University Press.\nGornick, Janet C., Marcia K. Meyers, and Katherin E. Ross. 1997. “Support-\ning the Employment of Mothers: Policy Variation across Fourteen Welfare\nStates.” Journal of European Social Policy 7: 45–70.\nGreenstein, Theodore N. 1996. “Husbands’ Participation in Domestic\nLabor: Interactive Effects on Wives’ and Husbands’ Gender Ideologies.”\nJournal of Marriage and Family 58: 585–95.\nGupta, Sanjiv. 1999. “The Effects of Transitions in Marital Status on Men’s\nPerformance of Housework.” Journal of Marriage and Family 61 (3):\n700–711.\nHakim, Catherine. 1991. “Grateful Slaves and Self-Made Women: Fact and\nFantasy in Women’s Work Orientations.” European Sociological Review\n7: 101–21.\nPolicy, Preferences, and Patriarchy ◆ 25 of 27\n———. 2000. Work-Lifestyle Choices in the 21st Century: Preference Theory.\nOxford, U.K.: Oxford University Press.\n———. 2003. Models of the Family in Modern Societies: Ideals and Realities.\nLondon: Ashgate.\nHartmann, Heidi. 1979. “Capitalism, Patriarchy, and Job Segregation by\nSex.” In Capitalist Patriarchy, ed. Z. R. Eisenstein, 206–247. New York:\nMonthly Review Press.\n———. 1981a. “The Family as the Locus of Gender, Class, and Political\nStruggle: The Example of Housework.” Signs 6: 366–94.\n———. 1981b. “The Unhappy Marriage of Marxism and Feminism:\nTowards a More Progressive Union.” In Women and Revolution: A Dis-\ncussion of the Unhappy Marriage of Marxism and Feminism, ed. Lydia\nSargent, 1–41. London: Pluto Press.\nHobson, Barbara. 1990. “No Exit, No Voice: Women’s Economic Depen-\ndence and the Welfare State.” Acta Sociologica 33: 235–50.\n———. 1993. “Feminist Strategies and Gendered Discourses in Welfare\nStates: Married Women’s Right to Work in the United States and\nSweden.” In Mothers of a New World: Maternalist Politics and the\nOrigins of Welfare States, ed. Seth Koven and Sonya Michel, 396–429.\nNew York: Routledge.\nHochschild, Arlie, with Anne Machung. 1989. The Second Shift: Working\nParents and the Revolution at Home. London: Piatkus.\nKamo, Yoshinori. 1991. “A Nonlinear Effect of the Number of Children\non the Division of Household Labor.” Sociological Perspective 34:\n205–18.\n———. 1994. “Division of Household Work in the United States and\nJapan.” Journal of Family Issues 15: 348–78.\nKorn, Klaus, Günter Feierabend, G. Hersing, and H.-D. Reuschel. 1984.\nEducation, Employment, and Development in the German Democratic\nRepublic. Paris: UNESCO International Institute for Educational Planning.\nLeibfried, Stephan, and Ilona Ostner. 1991. “The Particularism of West\nGerman Welfare Capitalism: The Case of Women’s Social Security.” In\nThe Sociology of Social Security, ed. Michael Adler, Colin Bell, Jochen\nClasen, and Adrian Sinfield, 164–86. Edinburgh, U.K.: Edinburgh\nUniversity Press.\nLewis, Jane. 1992. “Gender and the Development of Welfare Regimes.”\nJournal of European Social Policy 3: 159–73.\nMarx, Karl. 1967. The Manifesto of the Communist Party. Middlesex, Eng.:\nPenguin.\nMcAllister, Ian. 1990. “Gender and the Division of Labor: Employment\nand Earnings Variation in Australia.” Work and Occupations 17:\n79–99.\nMincer, Jacob, and Solomon Polachek. 1974. “Family Investments in\nHuman Capital: Earnings of Women.” Journal of Political Economy 82\n(Part II): S76–S108.\nMoeller, Robert G. 1993. Protecting Motherhood: Women and the Family in\nthe Politics of Postwar West Germany. Berkeley: University of California\nPress.\n26 of 27 ◆ Cooke\nNickel, Hildegard Maria. 1992. “Women in the German Democratic\nRepublic and in the New Federal States: Looking Backwards and\nForwards.” German Politics and Society 24–25 (Winter 1991–92):\n34–52.\nO’Connor, Julia. 1993. “Gender, Class, and Citizenship in the Comparative\nAnalysis of Welfare State Regimes: Theoretical and Methodological\nIssues.” British Journal of Sociology 44: 501–18.\nOrloff, Ann Shola. 1993. “Gender and the Social Rights of Citizenship: The\nComparative Analysis of Gender Relations and Welfare States.” American\nSociological Review 58: 303–28.\n———. 1996. “Gender in the Welfare State.” Annual Review of Sociology\n22: 51–78.\nOstner, Ilona. 1992. “Ideas, Institutions, Traditions: The Experience of\nWest German Women, 1945–1990.” German Politics and Society 24–25\n(Winter 1991–92): 87–99.\n———. 1993. “Slow Motion: Women, Work, and the Family in Germany.”\nIn Women and Social Policies in Europe: Work, Family and the State, ed.\nJane Lewis, 92–115. Aldershot, U.K.: Edward Elgar.\nParsons, Talcott. 1942. “Age and Sex in the Social Structure of the United\nStates.” American Sociological Review 7: 604–16.\nPress, Julie E., and Eleanor Townsley. 1998. “Wives’ and Husbands’ House-\nwork Reporting: Gender, Class, and Social Desirability.” Gender and\nSociety 12 (2): 188–218.\nPresser, Harriett B. 1994. “Employment Schedules among Dual-Earner\nSpouses and the Division of Household Labor by Gender.” American\nSociological Review 59: 348–64.\nSanchez, Laura A. 1994. “Gender, Labor Allocations, and the Psychology of\nEntitlement in the Home.” Social Forces 73: 533–53.\nShelton, Beth A., and Daphne John. 1996. “The Division of Household\nLabor.” Annual Review of Sociology 22: 299–322.\nSorensen, Annemette, and Sara McLanahan. 1986. “Women’s Married\nEconomic Dependency, 1940–1980.” American Journal of Sociology 93:\n659–87.\nSouth, Scott J., and Glenna Spitze. 1994. “Housework in Marital and Non-\nmarital Households.” American Sociological Review 59: 327–47.\nStetson, Dorothy McBride. 1995. “The Oldest Women’s Policy Agency: The\nWomen’s Bureau of the United States.” In Comparative State Feminism,\ned. Dorothy McBride Stetson and Amy Mazur, 254–71. Thousand Oaks,\nCalif.: Sage.\nTrappe, Heike. 2000. “Work and Family in Women’s Lives in the German\nDemocratic Republic.” In Work and Family: Research Informing Policy,\ned. Toby L. Parcel and Daniel B. Cornfield, 5–29. Thousand Oaks, Calif.:\nSage.\nvon Oertzen, Christine. 1999. “Women, Work, and the State: Lobbying for\nPart-Time Work and ‘Practical Equality’ in the West German Civil\nService, 1958–1969.” In State Policy and Gender System in the Two\nGerman States and Sweden, 1945–1989, ed. Rolf Torstendahl, 79–104.\nLund, Sweden: Bloms i Lund Tryckeri AB.\nPolicy, Preferences, and Patriarchy ◆ 27 of 27\nWalby, Sylvia. 1990. Theorizing Patriarchy. London: Blackwell.\nWest, Candace, and Don H. Zimmerman. 1987. “Doing Gender.” Gender\nand Society 1 (2): 125–51.\nZimmerman, Klaus. 1993. “Labour Responses to Taxes and Benefits in\nGermany.” In Welfare and Work Incentives: A Northern European\nPerspective, ed. A. B. Atkinson and Gunnar Viby Mogensen, 192–240.\nOxford, U.K.: Clarendon Press.\n"}