{"doi":"10.1080\/0968776000080206","coreId":"6489","oai":"oai:generic.eprints.org:331\/core5","identifiers":["oai:generic.eprints.org:331\/core5","10.1080\/0968776000080206"],"title":"Online self‐assessment materials: Do these make a difference to student learning?","authors":["Peat, Mary"],"enrichments":{"references":[{"id":192353,"title":"A study in self-assessment: tutor and students' perceptions of performance criteria'.","authors":[],"date":"1997","doi":"10.1080\/0260293970220401","raw":"Orsmond, P., Merry, S. and Reiling, K. (1997), 'A study in self-assessment: tutor and students' perceptions of performance criteria'. Assessment and Evaluation in Higher Education, 22 (4), 357-69.","cites":null},{"id":192348,"title":"An experiment in student self-assessment',","authors":[],"date":"1989","doi":"10.1111\/j.1467-8535.1989.tb00023.x","raw":"Edwards, R. (1989), 'An experiment in student self-assessment', British Journal of Educational Technology, 20 (1) 5-10.","cites":null},{"id":192346,"title":"Analysis of peer-, self- and staffassessment in group project work',","authors":[],"date":"1995","doi":"10.1080\/0969594950020204","raw":"56ALT-J Volume 8 Number 2 Butcher, A. C., Stefani, L. A. J. and Tariq, V. N. (1995), 'Analysis of peer-, self- and staffassessment in group project work', Assessment in Education, 20 (2), 165-85.","cites":null},{"id":192352,"title":"First-year on Campus: Diversity in the Initial Experiences of Australian Undergraduates, Centre for the Study of Higher Education,","authors":[],"date":"1995","doi":null,"raw":"McInnis, C., James, R. and McNaught, C. (1995), First-year on Campus: Diversity in the Initial Experiences of Australian Undergraduates, Centre for the Study of Higher Education, University of Melbourne.","cites":null},{"id":192347,"title":"Grade level differences in students' study activities as a function of course characteristics',","authors":[],"date":"1987","doi":"10.1016\/s0361-476x(87)80003-6","raw":"Christopoulos, J. P., Rohwer, W. D. and Thomas, J. W. (1987), 'Grade level differences in students' study activities as a function of course characteristics', Contemporary Educational Psychology, 12, 303-23.","cites":null},{"id":441235,"title":"Learning styles and courseware design',","authors":[],"date":"1997","doi":"10.3402\/rlt.v5i2.10561","raw":"Valley, K. (1997), 'Learning styles and courseware design', ALTJ, 5 (2), 42-51.","cites":null},{"id":192355,"title":"Learning to Teach","authors":[],"date":"1992","doi":"10.4324\/9780203413937","raw":"Ramsden, P. (1992), Learning to Teach in Higher Education, London: Routledge Press.","cites":null},{"id":441234,"title":"Peer, self and tutor assessment: relative reliabilities',","authors":[],"date":"1994","doi":"10.1080\/03075079412331382153","raw":"Stefani, L. A. J. (1994), 'Peer, self and tutor assessment: relative reliabilities', Studies in Higher Education, 19 (1), 69-75.","cites":null},{"id":192351,"title":"Refining assessment for resource based learning',","authors":[],"date":"1999","doi":"10.1080\/0260293990240308","raw":"Macdonald, J., Mason, R. and Heap, N. (1999), 'Refining assessment for resource based learning', Assessment and Evaluation in Higher Education, 24 (3), 345-54.","cites":null},{"id":192349,"title":"Self-assessment as a generic skill for enterprising students: the learning process',","authors":[],"date":"1993","doi":"10.1080\/0260293930180307","raw":"Fazey, D. M. A. (1993), 'Self-assessment as a generic skill for enterprising students: the learning process', Assessment and Evaluation in Higher Education, 18 (3), 235-50.","cites":null},{"id":192354,"title":"The development of self-assessment modules: use of tailor-made templates',","authors":[],"date":"1997","doi":null,"raw":"Peat, M., Franklin, S. and Mackay-Wood, R. (1997), 'The development of self-assessment modules: use of tailor-made templates', Virtual CUBE'97, http:\/\/www.liv.ac.uk\/ctibiol\/vCUBE97\/html\/rob_mackay-wood.html.","cites":null},{"id":441236,"title":"The mass implementation and evaluation of computerbased assessments',","authors":[],"date":"1998","doi":"10.1080\/0260293980230203","raw":"Zakrzewski, S. and Bull, J. (1998), 'The mass implementation and evaluation of computerbased assessments', Assessment and Evaluation in Higher Education, 23 (2), 141-52.","cites":null},{"id":192350,"title":"The progress of open learning',","authors":[],"date":"1993","doi":"10.1108\/00400919310041107","raw":"Lewis, R. (1993), 'The progress of open learning', Education and Training, 35 (4), 3-8.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2000","abstract":"During the last decade the teaching of students in first‐year biology has changed from a teacher‐centred focus to a student‐centred focus. The change was designed to encourage students to take responsibility for their learning, develop team and communication skills and put in practice those skills required for lifelong learning. Students are introduced to small learning communities (in large classes) that give the students a sense of belonging and a peer support group. Activities have been devised and implemented to support student‐centred learning, which in more recent years has included using computers. All these activities are integrated into the course design so that the students are offered an array of learning opportunities relevant to the course(s) learning outcomes. An important requirement for the development of student‐centred learning is suitable and timely feedback that gives students guidance about their learning outcomes. Giving feedback to very large classes is an expensive commodity and one that is vulnerable in the current climate of reducing resources and increasing student numbers. First‐year biology students receive online feedback from a weekly quiz (with both formative and summative components), from a mid‐semester mock exam (formative only) and from a series of self‐assessment modules (formative only). This paper will examine the use of such online self‐assessment in a large first‐year biology class, discuss current evaluations of the materials and propose further research into how students use these integrated learning opportunities","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/6489.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/331\/1\/ALT_J_Vol8_No2_2000_Online_self_assessment_materia.pdf","pdfHashValue":"5eff4a83e5b2852650bfa8697cb4836f92affd9b","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:331<\/identifier><datestamp>\n      2011-04-04T09:15:19Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/331\/<\/dc:relation><dc:title>\n        Online self‐assessment materials: Do these make a difference to student learning?<\/dc:title><dc:creator>\n        Peat, Mary<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        During the last decade the teaching of students in first‐year biology has changed from a teacher‐centred focus to a student‐centred focus. The change was designed to encourage students to take responsibility for their learning, develop team and communication skills and put in practice those skills required for lifelong learning. Students are introduced to small learning communities (in large classes) that give the students a sense of belonging and a peer support group. Activities have been devised and implemented to support student‐centred learning, which in more recent years has included using computers. All these activities are integrated into the course design so that the students are offered an array of learning opportunities relevant to the course(s) learning outcomes. An important requirement for the development of student‐centred learning is suitable and timely feedback that gives students guidance about their learning outcomes. Giving feedback to very large classes is an expensive commodity and one that is vulnerable in the current climate of reducing resources and increasing student numbers. First‐year biology students receive online feedback from a weekly quiz (with both formative and summative components), from a mid‐semester mock exam (formative only) and from a series of self‐assessment modules (formative only). This paper will examine the use of such online self‐assessment in a large first‐year biology class, discuss current evaluations of the materials and propose further research into how students use these integrated learning opportunities.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2000<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/331\/1\/ALT_J_Vol8_No2_2000_Online_self_assessment_materia.pdf<\/dc:identifier><dc:identifier>\n          Peat, Mary  (2000) Online self‐assessment materials: Do these make a difference to student learning?  Association for Learning Technology Journal, 8 (2).  pp. 51-57.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776000080206<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/331\/","10.1080\/0968776000080206"],"year":2000,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Online self-assessment materials: do these make\na difference to student learning?\nMary Peat\nSchool of Biological Sciences, The University of Sydney\nemail: maryp@bio.usyd.edu.au\nDuring the last decade the teaching of students in first-year biology has changed from a\nteacher-centred focus to a student-centred focus. The change was designed to encourage\nstudents to take responsibility for their learning, develop team and communication skills\nand put in practice those skills required for lifelong learning. Students are introduced to\nsmall learning communities (in large classes) that give the students a sense of belonging\nand a peer support group. Activities have been devised and implemented to support\nstudent-centred learning, which in more recent years has included using computers. All\nthese activities are integrated into the course design so that the students are offered an\narray of learning opportunities relevant to the course(s) learning outcomes. An\nimportant requirement for the development of student-centred learning is suitable and\ntimely feedback that gives students guidance about their learning outcomes. Giving\nfeedback to very large classes is an expensive commodity and one that is vulnerable in the\ncurrent climate of reducing resources and increasing student numbers. First-year biology\nstudents receive online feedback from a weekly quiz (with both formative and summative\ncomponents), from a mid-semester mock exam (formative only) and from a series of\nself-assessment modules (formative only). This paper will examine the use of such online\nself-assessment in a large first-year biology class, discuss current evaluations of the\nmaterials and propose further research into how students use these integrated learning\nopportunities.\nIntroduction\nIn our changing world where university students are demanding a greater say in their\ntertiary education, and in particular are demanding a greater flexibility in the way they\nreceive their instruction, it is imperative that we investigate and experiment with course\ndelivery strategies that fulfil these expectations. Online delivery of learning materials is not\n51\nMary Peat Online self-assessment materials: do these make a difference to student learning?\nnew, nor is it the panacea for all problems, but it does offer certain advantages for both\nteachers and students. The flexibility of using the Web may suit certain teaching activities,\nbut more importantly may suit the learning styles and commitments of the students. In the\ncurrent economic climate students may have to juggle university activities with\nemployment, potentially missing some of the structured teaching and learning sessions. In\naddition they may not have time to use campus-based course materials or seek face-to-face\nassistance from staff. An Australian benchmark survey of the first-year experience\n(Mclnnis, James and McNaught, 1995), found the pressures of part-time work made it\nextremely difficult for some students to fulfil course expectations. A 1998 survey of first-\nyear science students at the University of Sydney revealed that 54 per cent of full-time\nstudents are undertaking some form of employment, with 31 per cent working ten hours or\nmore per week during semester, and 14 per cent working over fifteen hours per week (Peat\nand Franklin, 1998). A small shift away from courses comprising all face-to-face activities\nto courses with a mix of face-to-face and online activities has the potential to help those\nvery students who may otherwise give up when the pressure of time and other commit-\nments seems too difficult to cope with.\nCourses with a flexible structure that offer choice to the learner provide for the develop-\nment of self-directed learning. This will enhance lifelong learning as students develop a\nstudent-centred approach to their studies, adopt deep learning strategies and develop\ncontextual appreciation of content (Candy, Crebert and O'Leary, 1994). It has been argued\nthat changes that would allow a more flexible approach include improved access to\nlearning resources, provision of flexible student support systems (which should include\ncounselling services, bridging, catch-up, remedial and study skills courses) and the\ndevelopment of learning resources and experiences that cater for different learning styles\n(Lewis, 1993). Computer learning resources delivered on the Web can fit these descriptors\nbut, to be effective, courseware must offer an opportunity for learners to address a topic\nthrough a range of activities, appropriate for all learning styles (Valley, 1997).\nFeedback on performance is a valuable tool in the learning process, especially feedback of\na formative nature that provides suitable opportunities for students to gain a personal\ninsight into their understanding of the course content (e.g. Zakrzewski and Bull, 1998;\nMacdonald, Mason and Heap, 1999). In the past early formative feedback was considered\na normal component of science-based courses (as in the use of weekly quizzes, paper-based\nlaboratory reports, solutions to questions, etc.) and much of it was followed up with face-\nto-face encounters between teachers and students. Now with increasing student numbers\nand decreasing staff resources, we need to come up with ways that help students help\nthemselves and the whole issue of giving suitable and early feedback to first-year students\nneeds to be revisited, it would seem, in most institutions. One way to help solve some of\nthese problems is the judicious use of self-assessment on the Web which for many teachers\nis a viable option that can provide valuable information for students about their progress\n(Butcher, Stefani and Tariq, 1995; Edwards, 1989; Stefani, 1994). The paper will discuss\nself-assessment materials available on the Web to a large first-year class, and in particular\nwill concentrate on a set of self-assessment modules designed, using Bloom's taxonomy, to\ntest different cognitive levels of learning.\n52\nVolume 8 Number 2\nThe Sydney problem\nIn Australia, first-year science courses have high student numbers, as these are also the\ncourses that service the other sciences (e.g. medical, veterinary, agricultural, engineering\netc). This large group of students (1,500 in biology at the University of Sydney) is also very\nheterogeneous, characterized by varied academic backgrounds (with a large range in the\nincoming entry grades, and some without biology qualifications), with varying interest in\nbiology, and with a range of incoming generic skills (writing, computer, team work, etc.).\nIn addition, many of the students arrive with an expectation of being spoon-fed, having\nbeen conditioned to using a surface approach to learning in high school. An additional\nproblem, with an ever-increasing number of students, is a disinclination by staff to be\ninvolved in first-year teaching. For many staff, working with first years is now seen to be a\nless valuable activity than supporting the learning environments of higher-year students\n(which yield honours and postgraduate candidates), as previously recognized (Christo-\npoulos, Rohwer and Thomas, 1987). In first-year biology, the Web is used to create a better\nlearning environment for students that is more independent of teacher interaction, that is\nsustainable in the current economic climate and that encourages the development of\nlifelong learning strategies.\nThe Sydney biology solution\nFor over ten years now, within the first-year biology courses, there has been a move to\nchange the philosophy from teaching students to facilitating student learning, especially\nwithin the laboratory experience. Early changes involved organizational and structural\nissues, such as the way the laboratory classes were designed or reviewing which activities\nbest suited a student-centred learning approach. Small learning communities in large\nclasses were created that offered group activities such as card and board games (based on\nfamiliar games strategies, e.g. Happy Families, Snakes and Ladders), group concept\nmapping tasks, group field work, group poster presentations and other tasks designed to\nfacilitate learning. The introduction of computers in 1994 as a permanent feature in the\nlaboratory, and the development of computer-assisted learning modules (CAL) to target\nspecific learning difficulties, led to a focus on the use of computers in the learning process.\nIn particular the use of revision and self-assessment materials was targeted. Anecdotal\nevidence from face-to-face contact with students had indicated that many of them (and we\nsuspect those at the lower end of our intake) were finding it difficult to understand the\nconcepts within our discipline and the linkages between concepts that are required for\nthem to perform satisfactorily in examinations. Our approach to this was to develop a set\nof self-assessment modules that allows students to test themselves.\nThe aim of a self-assessment module (SAM) is to draw together related parts of the course\nto help students make connections between topics in biology and to promote a deeper\nlearning strategy, whilst providing an enjoyable feedback and reinforcement session. These\nare additional, optional materials designed to let students identify their level of under-\nstanding. Whilst the courses are thematic, for example, the first semester course covers the\nrequirements of life, basic ecology, role of microbes, cells and energy (metabolism), cells\nand chromosomes (mutations, evolution), the SAMs are organized around plants, animals\nand microbes (with genetics yet to come online). Thus in using a SAM, students are taken\ndown a lateral pathway and so encouraged to see the relationship between the materials.\nS3\nMary Peat Online self-assessment materials: do these make a difference to student learning?\nThe development of SAMs in a non-course specific way allows for their constant reuse\neven when the course themes change.\nEach SAM tests the students on four levels of increasing difficulty, using Bloom's\ntaxonomy of educational objectives (Bloom, 1956) as the guide to develop the levels. Thus\nthe content of the questions can be reused (from level to level) but with an increasing\ncognitive requirement and appropriate question types have been developed for each level of\ndifficulty. Table 1 illustrates the question levels. Level 1 tests content and knowledge with the\nuse of multiple-choice questions and drag and drop scenarios, but with the answer always\non the screen. Level 2 tests application of content using some multiple choice, but mostly\nwith a format that expects text input from the students. Level 3 tests analysis and uses\nquestion formats as for Level 2, but with the addition of two-part questions and formats\nrequiring the building up of diagrams, flowcharts, etc. Level 4 tests synthesis of\ninformation and the most used format is free-flow prose where the student is expected to\nsynthesize information in response to a question. This format is not computer-marked but\nmarked by the students from sample answers, and with the option of self-scoring their own\nperformance.\nSAM Cognitive Question types Number of\nlevel level questions\nLevel I Content and Use multiple choice questions and drag and drop scenarios 7-8\nknowledge - the answer is always on the screen\nLevel 2 Application Use some multiple choice and drag and drop, but mostly use 4-5\nformat that expects text input from the student - answer not\nalways on the screen\nLevel 3 Analysis As for Level 2 but with question formats expecting students to 3-4\nbuild diagrams, flowcharts etc.\nLevel 4 Synthesis of Expect student to be able to synthesize information in response I - 2\ninformation to a question. May involve writing prose - use of example\nanswers here for student to score her\/himself on a 0-5 scale bar\nTable I: Question levels in self-assessment modules.\nSAMs are used by students individually or in groups (allowing for peer discussion, co-\noperative learning and team work). There is an entry point for each SAM which is designed\nto act as a barrier to progression if the student is unable to complete it successfully. It was\nenvisaged that students unable to pass the entry point would revise further before\nattempting the SAM again. The entry point consists of a set of five true\/false questions\n(selected from a small question bank), with questions of a Level 2-3 cognition require-\nment, allowing students with 80 per cent correct to proceed and denying further access to\nthose students unable to achieve this level of performance. Once past the barrier students\ncan choose to do any level in any order and the program allows the students to know\nwhere they have been and how they are performing. At any time they can ask for a\nprogress report. The design of templates for the questions at different levels, discussed\n54\nALT-J Volume 8 Number 2\nelsewhere (Peat, Franklin and Mackay-Wood, 1997), allows for the easy production of new\nSAMs.\nEvaluations\nFeedback on the use of the SAMs has been on a voluntary basis and all SAMs have an\noptional log-out feedback form, which is automatically generated after completion of the\nmodule, asking about the best aspects of the module, the worst aspects of the module and\nhow we might improve the module for the students. Whilst this log-out form clearly\nirritates some students (who are not interested in giving us feedback), analysis of the 1998\nand 1999 responses has given us some useful information which will help make\nimprovements. With respect to the best aspects, the student comments are of a generic\nnature and not about the content. The students like the immediate feedback, the clarity of\nmaterial, the variety of question types, the interactivity of the questions, the ease of use\nand the availability (any time, any place, any pace). In addition they indicate that such a\npackage is motivational (not intended in the design), fun to use and good for revision.\nMotivated me to work, showed me my weaknesses and what I have to revise.\nCan use these modules when I want. . . easy to use and understand.\nClarity and immediate marking.\nChoice of level of difficulty.\nThe responses to the 'worst aspects' highlight two areas - technical problems (mostly to do\nwith hardware problems, e.g. insufficient RAM, and not in our control), and details about\ncontent and in particular criticism about the restrictions imposed by an entry requirement\n(80 per cent pass for entry):\nIt took a long time for questions to download.\nSome diagrams did not exist.\nThe 'entry' questions - 1 could answer the questions once I managed to get through these.\nMany students do not see the entry test to have any value and these students are using the\nmodule for revision and not self-assessment and so want to go through the entire module\neven if they are not going to perform very well. The entry test may, therefore, be\ninappropriate. Some students indicated that they repeat the entry-level test until successful\nrather than doing any revision and that an 'inability' to pass the entry test does not mean\nthey cannot answer the questions in the main test. This is to be expected from the design\nwith four levels of increasing cognitive requirement and the entry test on a Level 2-3\ndegree of difficulty. The hardware problem will be addressed with additional information\nonline for the students about the technical requirements of the SAMs. The entry\nrequirement will be removed, especially as it appears students are using the SAMs as a\nrevision aid as well as a performance indicator.\nDiscussion\nIt has been shown (Entwistle, Hounsell, Macaulay, Situnayake and Tait, 1989) that an\nimportant contributing cause of failure of first-year students is an absence of feedback on\nprogress and this is also cited as a reason to discontinue (Mclnnis et al, 1995). In larger\nclasses it is often difficult to provide individual feedback to students and it is recognized\n55\nMary Peat Online self-assessment materials: do these make a difference to student learning?\n(Ramsden, 1982) that it is not always necessary for academic staff to give feedback if\nanother option is available and self-assessment is a suitable option. The self-assessment\nmaterials in this study offer students a variety of opportunities to test their understanding\nand to identify their cognitive working level without the need to seek face-to-face\nassistance from the teaching staff. The students in the present study found the materials\nchallenging, helpful and beneficial. This is supported by other studies on the use of self-\nassessment materials. For example, in a similar study with first-year physiology students 98\nper cent of students thought that the self-assessment had made them think more and 71\nper cent felt they had learned more (Orsmond, Merry and Reiling, 1997).\nThe design of the SAMs does not utilize the full range of Bloom's taxonomy (Bloom,\n1956). Of Bloom's six categories, evaluation - the ability to evaluate the worth of material,\ntheories, methods, information, etc. for a given purpose - was not included in the design of\nthe SAMs as it was considered too difficult to portray using the computer and was best\nassessed by other means. A criticism of the SAMs is that we have not given the students\nsufficient support in using them. Fazey (1993) argues that students may need more\ninstruction in the use of self-assessment materials and should be provided with guidance\nand given opportunities to practise these skills. A future development, therefore, will be to\ninclude a set of performance outcomes for students to identify with, based on some real\ndata. For example a high performance at Level 1 and 2, with poor performance at Level 3\nand 4 might indicate good rote learning skills but poor application and analysis.\nConclusion\nIn the first year, biology students are encouraged to develop collaborative learning\nstrategies in their face-to-face encounters (by setting up small learning communities in\nlarge classes). They are offered guided learning scenarios as opposed to discovery learning,\nwith a more flexible delivery for some of their materials, so that they can choose when they\nwant to be engaged in these activities. Student responses to surveys show that the\ntechnology is being used in a way that is helping them to learn, in a way that suits their\nlifestyle and which we hope will enhance opportunities for participation in higher\neducation. If we can present this within a learning style framework then we may be able to\npersuade the students to change their learning behaviours to include deep and meaningful\nlearning. The mix of online materials available result in valuable and realistic learning\nopportunities for 1,500 students and these are empowering them to take responsibility for\ntheir learning and to develop the lifelong learning skills required of our graduates.\nUniversity teaching and student learning are moving through transition processes, driven\nby many factors including changing student requirements and economic forces. In the next\nfew years we all need to adjust our mix of online and face-to-face teaching experiences and\ndevelop measures to evaluate the appropriateness of them. The next few years will show us\nthe ways in which students will want to learn and we need to be flexible in accommodating\ntheir preferred learning strategies.\nReferences\nBloom, B. S. (1956), Taxonomy of Educational Objectives: Handbook 1, Cognitive Domain,\nNew York: Longman.\n56\nALT-J Volume 8 Number 2\nButcher, A. C., Stefani, L. A. J. and Tariq, V. N. (1995), 'Analysis of peer-, self- and staff-\nassessment in group project work', Assessment in Education, 20 (2), 165-85.\nCandy, P. C., Crebert, G. and O'Leary, J. (1994), Developing Lifelong Learners through\nUndergraduate Education, National Board of Employment, Education and Training\n(NBEET), Australian Government Publishing Service.\nChristopoulos, J. P., Rohwer, W. D. and Thomas, J. W. (1987), 'Grade level differences in\nstudents' study activities as a function of course characteristics', Contemporary\nEducational Psychology, 12, 303-23.\nEdwards, R. (1989), 'An experiment in student self-assessment', British Journal of\nEducational Technology, 20 (1) 5-10.\nEntwistle, N. J., Hounsell, C. J., Macaulay, C., Situnayake, G. and Tait, H. (1989), The\nPerformance of Electrical Engineers in Scottish Education, Report to the Scottish\nEducation Department, Centre for Research on Learning and Instruction, Department of\nEducation, University of Edinburgh.\nFazey, D. M. A. (1993), 'Self-assessment as a generic skill for enterprising students: the\nlearning process', Assessment and Evaluation in Higher Education, 18 (3), 235-50.\nLewis, R. (1993), 'The progress of open learning', Education and Training, 35 (4), 3-8.\nMacdonald, J., Mason, R. and Heap, N. (1999), 'Refining assessment for resource based\nlearning', Assessment and Evaluation in Higher Education, 24 (3), 345-54.\nMcInnis, C., James, R. and McNaught, C. (1995), First-year on Campus: Diversity in the\nInitial Experiences of Australian Undergraduates, Centre for the Study of Higher\nEducation, University of Melbourne.\nOrsmond, P., Merry, S. and Reiling, K. (1997), 'A study in self-assessment: tutor and\nstudents' perceptions of performance criteria'. Assessment and Evaluation in Higher\nEducation, 22 (4), 357-69.\nPeat, M. and Franklin, S. (October, 1999), 1998 Survey of Casual Hours of Work of First-\nyear Students, http:\/\/fybio.bio.usyd.edu.au\/SOBSFYB\/ANNREPORT.htm.\nPeat, M., Franklin, S. and Mackay-Wood, R. (1997), 'The development of self-assessment\nmodules: use of tailor-made templates', Virtual CUBE'97,\nhttp:\/\/www.liv.ac.uk\/ctibiol\/vCUBE97\/html\/rob_mackay-wood.html.\nRamsden, P. (1992), Learning to Teach in Higher Education, London: Routledge Press.\nStefani, L. A. J. (1994), 'Peer, self and tutor assessment: relative reliabilities', Studies in\nHigher Education, 19 (1), 69-75.\nValley, K. (1997), 'Learning styles and courseware design', ALTJ, 5 (2), 42-51.\nZakrzewski, S. and Bull, J. (1998), 'The mass implementation and evaluation of computer-\nbased assessments', Assessment and Evaluation in Higher Education, 23 (2), 141-52.\n57\n"}