{"doi":"10.1007\/s11214-006-9132-8","coreId":"71112","oai":"oai:eprints.lancs.ac.uk:6692","identifiers":["oai:eprints.lancs.ac.uk:6692","10.1007\/s11214-006-9132-8"],"title":"Review of ionospheric effects of solar wind magnetosphere coupling in the context of the expanding contracting polar cap boundary model","authors":["Lester, M.","Milan, S. E.","Provan, G.","Wild, J. A."],"enrichments":{"references":[{"id":16380920,"title":"A far ultraviolet imager for the international solar-terrestrial physics mission, Space Sci.","authors":[],"date":"2001","doi":"10.1007\/bf00751335","raw":"Cole, C. Keffer, G. Parks, B. Tsurutani and J. Spann, A far ultraviolet imager for the international solar-terrestrial physics mission, Space Sci. Rev., 71, 329-383, Wild, J.A., S.W.H. Cowley, J.A. Davies, H. Khan, M. Lester, S.E. Milan, G. Provan, T.K. Yeoman, A. Balogh, M.W. Dunlop, K.-H. Fornacon and E. Georgescu, First simultaneous observations of flux transfer events at the high-latitude magnetopause by the Cluster spacecraft and pulsed radar signatures in the 15 conjugate ionosphere by the CUTLASS and EISCAT radars, Ann. Geophysicae, 19, 1491-1508, 2001.","cites":null},{"id":16380895,"title":"A statistical study of dayside pulsed ionospheric flows as seen by the CUTLASS Finland HF radar,","authors":[],"date":"2000","doi":"10.1007\/s00585-000-0445-8","raw":"13 McWilliams, K.A., T.K. Yeoman and G. Provan, A statistical study of dayside pulsed ionospheric flows as seen by the CUTLASS Finland HF radar, Ann. Geophysicae, 18, 445-453, 2000 Mende, S.B., H. Heetderks, H.U. Frey et al., Far ultraviolet imaging for the IMAGE spacecraft, Space Sci. Rev., 91, 243 – 287, 2000 Mende, S.B., C.W. Carlson, H.U. Frey, L.M. Peticolas and N. Østgaard, FAST and IMAGE-FUV observations of a substorm onset, J. Geophys. Res.,  108, A9, 1344, 10.1029\/2002JA009787, 2003. Milan, S.E., M. Lester, S.W.H. Cowley, and M. Brittnacher, Convection and auroral response to a southward turning of the IMF: Polar UVI, CUTLASS and IMAGE signatures of transient magnetic flux reconnection at the magnetopause, J.","cites":null},{"id":16380903,"title":"A survey of magnetopause FTEs and associated flow bursts in the polar ionosphere,","authors":[],"date":"2000","doi":"10.1007\/s00585-000-0416-0","raw":"Haerendel, W. Baumjohann, B. Nikutowski, J. Buchner, U. Auster, K.-H. Fornacon and E. Georgescu, A survey of magnetopause FTEs and associated flow bursts in the polar ionosphere, Ann. Geophysicae, 18, 416-435, 2000 Neudegg, S.W.H. Cowley, K.A. McWilliams, M. Lester, T.K. Yeoman, J. Sigwarth, G. Haerendel, W. Baumjohann, U. Auster, K.-H. Fornacon, and E. Georgescu, The UV aurora and ionospheric flows during flux transfer events, Ann. Geophysicae, 19, 179-188, 2001 14 Pinnock, M., A.S. Rodger, J.R. Dudeney, K.B. Baker, P.T. Newell, R.A. Greenwald and M.E. Greenspan, Observations of an enhanced convection channel in the cusp ionosphere, J. Geophys. Res., 98, 3767-3776, 1993 Provan, G., T.K. Yeoman and S.E. Milan, CUTLASS Finland radar observations of the ionospheric signatures of flux transfer events and the resulting plasma flows, Ann. Geophysicae, 16, 1411-1422, 1998 Provan, G., M. Lester, S.B. Mende and S.E. Milan, Statistical study of high-latitude plasma flow during magnetospheric substorms, Ann. Geophysicae,  22, 3607-3624, 2004.","cites":null},{"id":16380923,"title":"Coordinated interhemispheric SuperDARN radar observations of the ionospheric response to flux transfer events observed by the Cluster spacecraft at the high-latitude magnetopause,","authors":[],"date":"2003","doi":"10.5194\/angeo-21-1807-2003","raw":"Wild, J.A., S.E. Milan, S.W.H. Cowley, M.W. Dunlop, C.J. Owen, J.M. Bosqued, M.G.G.T. Taylor, J.A. Davies, M. Lester, N. Sato, A.S. Yukimatu, A.N. Fazakerley, A. Balogh and H. Reme, Coordinated interhemispheric SuperDARN radar observations of the ionospheric response to flux transfer events observed by the Cluster spacecraft at the high-latitude magnetopause, Ann. Geophysicae, 21, 1807-1826, 2003.","cites":null},{"id":16380885,"title":"DARN\/SuperDARN: A global view of the dynamics of high latitude convection, Space Sci.","authors":[],"date":"1995","doi":"10.1007\/bf00751350","raw":"Koehler, E. Nielsen, R. Pellinen, A.D.M. Walker, N. Sato and H. Yamagishi, DARN\/SuperDARN: A global view of the dynamics of high latitude convection, Space Sci. Rev., 71, 761-796, 1995 Grocott, A., S.W.H. Cowley, J.B. Sigwarth, J.F. Watermann and T.K. Yeoman, Excitation of twin-vortex flow in the nightside high-latitude ionosphere during an isolated substorm, Ann. Geophysicae, 20, 1577-1601, 2002.","cites":null},{"id":16380889,"title":"Empirical high-latitude electric field models,","authors":[],"date":"1987","doi":"10.1029\/ja092ia05p04467","raw":"Heppner, J.P. and N.C. Maynard, Empirical high-latitude electric field models, J. Geophys. Res., 92, 4467-4489, 1987.","cites":null},{"id":16380884,"title":"Flux transfer events at the magnetopause and in the ionosphere,","authors":[],"date":"1963","doi":null,"raw":"Lebeau, pp 526-535, Gordon and Breach, Newark, N. J., 1963 Elphic, R.C., M. Lockwood, S.W.H. Cowley, and P.E. Sandholt, Flux transfer events at the magnetopause and in the ionosphere, Geophys. Res. Lett., 17, 2241-2244, Frank, L.A., J.B. Sigwarth, J.D. Craven, J.P. Cravens, J.S. Dolan, M.R. Dvorsky, P.K. Hardebeek, J.D. Harvey and D.W. Muller, The Visible Imaging System (VIS) for the Polar spacecraft, Space Sci. Rev., 71, 297 – 311, 1995 Freeman, M.P. and D.J. Southwood, The effect of magnetospheric erosion on midlatitude and high-latitude ionospheric flows, Planet. Space Sci., 36, 509 – 522, Greenwald, R.A., K.B. Baker, J.R. Dudeney, M. Pinnock, T.B. Jones, E.C. Thomas, J.-P. Villain, J.-C. Cerisier, C. Senior, C. Hanuise, R.D. Hunsucker, G. Sofko, J.","cites":null},{"id":16380883,"title":"HF radar observations of the dayside magnetic merging rate: A Geospace Environment Modeling boundary layer campaign study,","authors":[],"date":"1997","doi":"10.1029\/97ja00288","raw":"Baker, K.B., A.S. Rodger and G. Lu, HF radar observations of the dayside magnetic merging rate: A Geospace Environment Modeling boundary layer campaign study, J. Geophys. Res., 102, 9603 – 9617, 1997 Borälv, E., H.J. Opgenoorth, K. Kauristie, M. Lester, J.-M. Bosqued, J.P. Dewhurst, A. Fazakerley, C.J. Owen, J.A. Slavin, M. Dunlop and M. Carter, Correlation between ground-based observations of substorm signatures and magnetotail dynamics, Annales Geophysicae, 23, 997 - 1011, 2005 Chisham, G., M.P. Freeman, I.J. Coleman, M. Pinnock, M.R. Hairston, M. Lester and G.J. Sofko, Measuring the dayside reconnection rate during an interval of due northward interplanetary magnetic field, Ann. Geophysicae, 22, 4243 - 4258, Cowley, S.W.H., Excitation of flow in the Earth’s Magnetosphere-Ionosphere system: Observations by Incoherent-Scatter Radar, in Polar Cap Boundary Phenomena, edited by J. Moen et al., pp 127 – 140, Kluwer Academic Publishers, Netherlands, 1998 Cowley, S.W.H. and M. Lockwood, Excitation and decay of solar wind driven flows in the magnetosphere-ionosphere system, Ann. Geophysicae.,  10, 103 –115, Cowley, S.W.H., J.P. Morelli and M. Lockwood, Dependence of convective flows and particle precipitation in the high latitude dayside ionosphere on the X- and Y- components of the interplanetary magnetic field, J. Geophys. Res., 96, 5557– 5564, 1991 Davies, J.A., T.K. Yeoman, I.J. Rae, S.E. Milan, M. Lester, M. Lockwood and K.A. McWilliams, Ground-based observations of the auroral zone and polar cap ionospheric responses to dayside transient reconnection, Ann. Geophysicae, 20, 781 – 794, 2002 Dungey, J.W., Interplanetary field and the auroral zones, Phys. Res., Lett., 47-48, 12 Dungey, J. W., The structure of the exosphere, or adventures in velocity space, in Geophysics: The Earths Environment, edited by C. DeWitt, J. Hiebolt and A.","cites":null},{"id":16380893,"title":"Identifying the open-closed field line boundary, Polar cap Boundary Phenomena,","authors":[],"date":"1998","doi":"10.1007\/978-94-011-5214-3_7","raw":"Lockwood, M., Identifying the open-closed field line boundary, Polar cap Boundary Phenomena, p 73 – 90, J. Moen, A. Egeland and M. Lockwood (eds), Kluwer Academic Publishing, Netherlands, 1998.","cites":null},{"id":16380905,"title":"Introduction to Ionospheric","authors":[],"date":"1969","doi":"10.1016\/s0074-6142(09)60019-x","raw":"Rishbeth, H. and O. Garriott, Introduction to Ionospheric Physics, Academic Press, London, 1969.","cites":null},{"id":16380907,"title":"Large-scale imaging of high-latitude convection with Super Dual Auroral radar Network HF radar observations,","authors":[],"date":"1998","doi":"10.1029\/98ja01288","raw":"Ruohoniemi, J.M. and K.B. Baker, Large-scale imaging of high-latitude convection with Super Dual Auroral radar Network HF radar observations, J. Geophys. Res., 103, 20797-20811, 1998 Russell, C.T., The configuration of the magnetosphere, in Critical Problems of Magnetospheric Physics, Ed. E.R. Dyer, Inter Union Committee on STP, national Academy of Sciences, Washington DC, 1 – 16, 1972 Russell, C.T. and R.C. Elphic, Initial ISEE magnetometer results: magnetopause observations, Space Sci. Rev., 22, 681-715, 1978 Russell, C.T. and R.C. Elphic, ISEE observations of flux transfer events at the dayside magnetopause, Geophys. Res. Lett., 6, 33-36, 1979 Schunk, R.W. and A.F. Nagy, Ionosphere – Physics, Plasma Physics and Chemistry, CUP, Cambridge, 2000.","cites":null},{"id":16380886,"title":"Multi-instrument observations of the ionospheric counterpart of a bursty bulk flow in the near-Earth plasmasheet,","authors":[],"date":"2004","doi":"10.5194\/angeo-22-1061-2004","raw":"Grocott, A., T.K. Yeoman, R. Nakamura, S.W.H. Cowley, H.U. Frey, H. Reme and B. Klecker, Multi-instrument observations of the ionospheric counterpart of a bursty bulk flow in the near-Earth plasmasheet, Ann. Geophysicae, 22, 1061 – 1075, 2004.","cites":null},{"id":16380909,"title":"Polar cap inflation and deflation,","authors":[],"date":"1985","doi":"10.1029\/ja090ia01p00543","raw":"Siscoe, G. and T.S Huang, Polar cap inflation and deflation, J. Geophys. Res., 90, 543-547, 1985 Torr, M.R., D.G. Torr, M. Zukic, R.B. Johnson, J. Ajello, P. Banks, K. Clark, K.","cites":null},{"id":16380899,"title":"Space and ground-based investigations of solar wind-magnetosphere-ionosphere coupling,","authors":[],"date":"2006","doi":"10.1016\/j.asr.2005.08.009","raw":"Milan, S.E., J.A. Wild, A. Grocott and N.C. Draper, Space and ground-based investigations of solar wind-magnetosphere-ionosphere coupling, Adv. Space Res., 38, 1671 - 1677, 2006.","cites":null},{"id":16380901,"title":"Substorms and their solar wind causes, this volume,","authors":[],"date":"2006","doi":"10.1007\/978-0-387-69532-7_7","raw":"Nakamura, R., Substorms and their solar wind causes, this volume, 2006. Neudegg, D.A., T.K. Yeoman, S.W.H. Cowley, G. Provan, G. Haerendel, W. Baumjohann, U. Auster, K.-H. Fornacon, E. Georgescu and C.J. Owen, A flux transfer event observed at the magnetopause by the Equator-S spacecraft and in the ionosphere by the CUTLASS HF radar, Ann. Geophysicae, 17, 707-711, Neudegg, D.A., S.W.H. Cowley, S.E. Milan, T.K. yeoman, M. Lester, G.Provan, G.","cites":null},{"id":16380891,"title":"The auroral and ionospheric flow signatures of dual lobe reconnection, Ann. Geophys.,","authors":[],"date":"2006","doi":"10.5194\/angeo-24-3115-2006","raw":"Imber, S.M., S.E. Milan, B. Hubert, The auroral and ionospheric flow signatures of dual lobe reconnection, Ann. Geophys., In Press, 2006.","cites":null},{"id":16380887,"title":"The frontside boundary layer of the magnetopause and the problem of reconnection,","authors":[],"date":"1978","doi":"10.1029\/ja083ia07p03195","raw":"Haerendel, G., G. Paschmann, N. Sckopke, H. Rossenbauer and P.C. Hedgecock, The frontside boundary layer of the magnetopause and the problem of reconnection, J. Geophys. Res., 83, 3195-3216, 1978.","cites":null},{"id":16380897,"title":"Variations in the polar cap area during two substorm cycles,","authors":[],"date":"2000","doi":"10.5194\/angeo-21-1121-2003","raw":"Geophys. Res., 105, 15741-15756, 2000 Milan, S.E., M. Lester, S.W.H. Cowley, K. Oksavik, M. Brittnacher, R.A. Greenwald, G. Sofko and J.-P. Villain, Variations in the polar cap area during two substorm cycles, Ann. Geophysicae, 21, 1121-1140, 2003.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-06","abstract":"This paper reviews the coupling between the solar wind, magnetosphere and ionosphere. The coupling between the solar wind and Earth’s magnetosphere is controlled by the orientation of the Interplanetary Magnetic Field (IMF). When the IMF has a southward component, the coupling is strongest and the ionospheric convection pattern that is generated is a simple twin cell pattern with anti-sunward flow across the polar cap and return, sunward flow at lower latitudes. When the IMF is northward, the ionospheric convection pattern is more complex, involving flow driven by reconnection between the IMF and the tail lobe field, which is sunward in the polar cap near noon. Typically four cells are found when the IMF is northward, and the convection pattern is also more contracted under these conditions. The presence of a strong Y (dawn-dusk) component to the IMF leads to asymmetries in the flow pattern. Reconnection, however, is typically transient in nature both at the dayside magnetopause and in the geomagnetic tail. The transient events at the dayside are referred to as flux transfer events (FTEs), while the substorm process illustrates the transient nature of reconnection in the tail. The transient nature of reconnection lead to the proposal of an alternative model for flow stimulation which is termed the expanding\/contracting polar cap boundary model. In this model, the addition to, or removal from, the polar cap of magnetic flux stimulates flow as the polar cap boundary seeks to return to an equilibrium position. The resulting average patterns of flow are therefore a summation of the addition of open flux to the polar cap at the dayside and the removal of flux from the polar cap in the nightside. This paper reviews progress over the last decade in our understanding of ionospheric convection that is driven by transient reconnection such as FTEs as well as by reconnection in the tail during substorms in the context of a simple model of the variation of open magnetic flux. In this model, the polar cap expands when the reconnection rate is higher at the dayside magnetopause than in the tail and contracts when the opposite is the case. By measuring the size of the polar cap, the dynamics of the open flux in the tail can be followed on a large scale","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71112.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/6692\/1\/Mark_Lester_Sol_Dyn_paper_rev_Nov_06.pdf","pdfHashValue":"dc30120fa609174377f7ebc90f2242beb4a70b87","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:6692<\/identifier><datestamp>\n      2018-01-24T03:15:48Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Review of ionospheric effects of solar wind magnetosphere coupling in the context of the expanding contracting polar cap boundary model<\/dc:title><dc:creator>\n        Lester, M.<\/dc:creator><dc:creator>\n        Milan, S. E.<\/dc:creator><dc:creator>\n        Provan, G.<\/dc:creator><dc:creator>\n        Wild, J. A.<\/dc:creator><dc:description>\n        This paper reviews the coupling between the solar wind, magnetosphere and ionosphere. The coupling between the solar wind and Earth’s magnetosphere is controlled by the orientation of the Interplanetary Magnetic Field (IMF). When the IMF has a southward component, the coupling is strongest and the ionospheric convection pattern that is generated is a simple twin cell pattern with anti-sunward flow across the polar cap and return, sunward flow at lower latitudes. When the IMF is northward, the ionospheric convection pattern is more complex, involving flow driven by reconnection between the IMF and the tail lobe field, which is sunward in the polar cap near noon. Typically four cells are found when the IMF is northward, and the convection pattern is also more contracted under these conditions. The presence of a strong Y (dawn-dusk) component to the IMF leads to asymmetries in the flow pattern. Reconnection, however, is typically transient in nature both at the dayside magnetopause and in the geomagnetic tail. The transient events at the dayside are referred to as flux transfer events (FTEs), while the substorm process illustrates the transient nature of reconnection in the tail. The transient nature of reconnection lead to the proposal of an alternative model for flow stimulation which is termed the expanding\/contracting polar cap boundary model. In this model, the addition to, or removal from, the polar cap of magnetic flux stimulates flow as the polar cap boundary seeks to return to an equilibrium position. The resulting average patterns of flow are therefore a summation of the addition of open flux to the polar cap at the dayside and the removal of flux from the polar cap in the nightside. This paper reviews progress over the last decade in our understanding of ionospheric convection that is driven by transient reconnection such as FTEs as well as by reconnection in the tail during substorms in the context of a simple model of the variation of open magnetic flux. In this model, the polar cap expands when the reconnection rate is higher at the dayside magnetopause than in the tail and contracts when the opposite is the case. By measuring the size of the polar cap, the dynamics of the open flux in the tail can be followed on a large scale.<\/dc:description><dc:date>\n        2006-06<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/6692\/1\/Mark_Lester_Sol_Dyn_paper_rev_Nov_06.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s11214-006-9132-8<\/dc:relation><dc:identifier>\n        Lester, M. and Milan, S. E. and Provan, G. and Wild, J. A. (2006) Review of ionospheric effects of solar wind magnetosphere coupling in the context of the expanding contracting polar cap boundary model. Space Science Reviews, 124 (1-4). pp. 117-130. ISSN 0038-6308<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/6692\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1007\/s11214-006-9132-8","http:\/\/eprints.lancs.ac.uk\/6692\/"],"year":2006,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"Review of ionospheric effects of solar wind magnetosphere \ncoupling in the context of the expanding contracting polar \ncap boundary model. \n  \n \nM. Lester1, S.E. Milan1, G. Provan1 and J.A. Wild2\n1 Department of Physics and Astronomy, University of Leicester, \nLeicester, LE1 7RH, U.K. \n2 Department of Communication Systems, Lancaster University, \nLancaster, LA1 4WA, U.K. \n \n \nFor inclusion in ISSI Book on \nSolar Dynamics and its effects on the Heliosphere and Earth \n \nSeptember 19 2005 \nRevised November 20 2006\n1 \n \nAbstract \nThis paper reviews the coupling between the solar wind, magnetosphere and \nionosphere.  The coupling between the solar wind and Earth’s magnetosphere is \ncontrolled by the orientation of the Interplanetary Magnetic Field (IMF).  When the \nIMF has a southward component, the coupling is strongest and the ionospheric \nconvection pattern that is generated is a simple twin cell pattern with anti-sunward \nflow across the polar cap and return, sunward flow at lower latitudes.  When the IMF \nis northward, the ionospheric convection pattern is more complex, involving flow \ndriven by reconnection between the IMF and the tail lobe field, which is sunward in \nthe polar cap near noon.  Typically four cells are found when the IMF is northward, \nand the convection pattern is also more contracted under these conditions.  The \npresence of a strong Y (dawn-dusk) component to the IMF leads to asymmetries in \nthe flow pattern.  Reconnection, however, is typically transient in nature both at the \ndayside magnetopause and in the geomagnetic tail.  The transient events at the \ndayside are referred to as flux transfer events (FTEs), while the substorm process \nillustrates the transient nature of reconnection in the tail.  The transient nature of \nreconnection lead to the proposal of an alternative model for flow stimulation which \nis termed the expanding\/contracting polar cap boundary model.  In this model, the \naddition to, or removal from, the polar cap of magnetic flux stimulates flow as the \npolar cap boundary seeks to return to an equilibrium position.  The resulting average \npatterns of flow are therefore a summation of the addition of open flux to the polar \ncap at the dayside and the removal of flux from the polar cap in the nightside.  This \npaper reviews progress over the last decade in our understanding of ionospheric \nconvection that is driven by transient reconnection such as FTEs as well as by \nreconnection in the tail during substorms in the context of a simple model of the \nvariation of open magnetic flux.  In this model, the polar cap expands when the \nreconnection rate is higher at the dayside magnetopause than in the tail and contracts \nwhen the opposite is the case.  By measuring the size of the polar cap, the dynamics \nof the open flux in the tail can be followed on a large scale. \n2 \n1. Introduction \n \nIn this paper we discuss the impact of solar wind magnetosphere coupling on the \nionosphere during so called normal solar wind conditions.  The ionosphere represents \nthe lower boundary of the magnetosphere, but perhaps more importantly it represents \none of the main sinks of energy which is transmitted from the solar wind to the \nmagnetosphere.  Since the ionosphere is only weakly ionised and is coupled strongly \nto the neutral atmosphere, it also plays a role in coupling that energy through to the \natmosphere.  There is not sufficient space to discuss the detail of the ionosphere and \nthis can be found in text books such as Rishbeth and Garriott (1969), Schunk and \nNagy (2000).  The main physical process which mediates the coupling between the \nsolar wind and magnetosphere is reconnection between the interplanetary magnetic \nfield (IMF) and the geomagnetic field as originally proposed by Dungey (1961).  \nThus, in this paper we concentrate on the flow excitation in the ionosphere by \nreconnection at the dayside and in the tail. \n \n2. Ionospheric convection \n \nThe coupling between the solar wind and magnetosphere is dominated mainly by \nmagnetic reconnection at the dayside magnetopause between the IMF and the \ngeomagnetic field, and was first described for southward IMF by Dungey (1961) and \nfor northward IMF by Dungey (1963).  The scenario for southward IMF is illustrated \nin Figure 1 in which a cross section in the noon-midnight plane of the magnetosphere \nis presented.  Reconnection occurs at the sub-solar point of the magnetopause, \nresulting in newly opened magnetic field lines which are connected to the IMF at one \nend and the geomagnetic field at the other.  Newly reconnected magnetic flux tubes \nare transported to the nightside due to the motion of the solar wind and then \nreconnection of the tail field lines causes closed magnetic field lines to return \nearthward.  This process is often referred to as the Dungey cycle. \n \nUnder northward IMF conditions the situation is more complex and involves \nreconnection at locations which are at much higher latitudes well away from the sub-\nsolar point.  Typically it is thought that this occurs at points in the tail lobes where the \ngeomagnetic field would be anti-parallel to the draped northward IMF.  The \n3 \nconvection process that is driven under such conditions is clearly more complex.  For \nexample, reconnection can occur between an individual IMF field line and one lobe \nonly, or when the IMF clock angle is low reconnection can occur simultaneously with \nboth lobes (e.g. Imber et al., 2006). \n \nThe magnetospheric convection driven by the Dungey cycle also results in \nionospheric convection.  When the Z component of the IMF is negative, and there is \nno Y component, ionospheric convection is a simple two cell convection pattern with \nantisunward flow across the polar cap and sunward flow in at lower latitudes.  The \naddition of a Y component adds an asymmetry to the flows (e.g. Cowley et al., 1991; \nsee Cowley, 1998 for a review) such that one cell becomes more dominant than the \nother.  Under purely northward IMF conditions, two lobe cells are present with \nsunward convection in the centre of the polar cap.  The addition of a Y component to \nthe Z component causes further asymmetry in the flow, and if the Y component is \nlarger than the Z component then a distorted two cell pattern with strong azimuthal \nflow in the dayside region is often observed. \n \nAverage patterns of ionospheric convection were produced primarily by averaging \ndata sets from ground based radars or from low earth orbiting satellites (e.g. Heppner \nand Maynard, 1987).  However, the interpretation of Flux Transfer Events (Haerendal \net al., 1978; Russell and Elphic, 1978, 1979) as transient and patchy reconnection and \nsubsequent observations by other authors of this transient process has lead to an \nalternative consideration of how ionospheric convection is excited.  This is referred to \nas the expanding\/contracting polar cap model and follows an initial discussion by \nRussell (1982), theoretical work by Siscoe and Huang (1985) and Freeman and \nSouthwood (1988), before being finally formalised by Cowley and Lockwood (1992).  \nIn this model as flux is added to the polar cap, a twin cell convection pattern is \nstimulated in the dayside ionosphere, as illustrated by Figure 2a, where the flow is \nstimulated by the motion of the boundary as the polar cap seeks to return to \nequilibrium after the addition of the newly created flux.  In Figure 2a, the polar cap \nboundary, i.e. the boundary between open and closed magnetic field lines, is indicated \nby the solid circle, with the portion of the boundary at which reconnection occurs \nindicated by the dashed line.  The motion of the boundary is indicated by the open \narrows.  If flux is removed from the polar cap by reconnection in the geomagnetic tail, \n4 \nthen a similar twin cell convection pattern is stimulated in the nightside ionosphere \n(Figure 2b).  A standard two cell convection pattern consists of the summation of the \ntwo processes.  Cowley and Lockwood (1992) proposed that the flow would be \nstimulated in order to move the newly reconnected flux at the dayside magnetopause \ninto the polar cap, thereby moving the polar cap boundary equatorward.  Likewise, a \nregion of newly closed flux on the nightside would result in the same pattern but the \npolar cap would contract.  The timescale for this process in the absence of other \nprocesses would be of order 15 – 20 minutes (Cowley and Lockwood, 1992).  Thus \nthe difference between reconnection rates at the dayside and in the nightside would \ndetermine whether the polar cap was expanding or contracting. \n \nThe study of ionospheric flows in the last decade has been improved with the \nexpansion of the Super Dual Auroral Radar Network (SuperDARN) which consists of \nnetworks of radars in both northern and southern hemispheres (Greenwald et al., \n1995).  Doppler velocity measurements made by these radars can be combined to \nprovide maps of the large scale convection pattern at intervals of 2 minutes in general, \nand, at times, 1 minute (Ruohoniemi and Baker, 1998).  In the remainder of this paper \nwe discuss some results that have been attained with the SD radars over the last 10 \nyears which address flow excitation by the model proposed by Siscoe and Huang \n(1985) and Cowley and Lockwood (1992). \n  \n3. FTE flow signatures \n \nThere have been many reports of flux transfer events, with the first model described \nby Russell and Elphic (1978, 1979) based on typical signatures of the magnetic field \nin a boundary normal co-ordinate system, where the N component is normal to the \nlocal magnetopause boundary while the L and M components are in the plane of the \nmagnetopause.  Figure 3 presents sketches of the typical signatures of an FTE which \nare the bipolar signature in the BN component and an increase in the total field, Btot.  \nThe variation in the other two components depends on the relative motion of the FTE \nand the spacecraft, although in Figure 3, the M component is shown as increasing.   \nThe first unambiguous observation of the ionospheric flow stimulated by FTEs was \nthat by Elphic et al. (1990).  Thereafter, a number of observations were made by HF \nradars of signatures which were assumed to be the response to transient reconnection \n5 \n(e.g. Pinnock et al., 1993; Provan et al., 1998; Milan et al., 2000; McWilliams et al., \n2000).  The first simultaneous observations of a FTE at the magnetopause and flow \nenhancement in the ionosphere measured by a SuperDARN radar were made by \nNeudegg et al. (1999).  In this study a clear magnetospheric FTE was observed by \nEquator-S and this was accompanied by a near simultaneous enhancement of the \nionospheric flow by the CUTLASS Hankasalmi radar.  Furthermore, it was \nsubsequently shown that this FTE excited strong UV aurora equatorward of the \nfootprint of the newly reconnected field lines (Neudegg et al., 2001).  This event also \ndemonstrated that the signatures in HF radar data termed pulsed ionospheric flows \n(Provan et al., 1998; McWilliams et al., 2000), which had been discussed as likely \nsignatures of FTEs, were indeed ionospheric signatures of transient reconnection. \n \nA subsequent statistical study (Neudegg et al., 2000) demonstrated that if the \nrepetition rate of FTEs was greater than 5 minutes, then the tendency was to identify a \nclear one-to-one response between FTE and ionospheric flow response.  If on the \nother hand the repetition rate was faster, then the flows tended less to the pulsed \nbehaviour and more to flow behaviour associated with continuous excitation. \n \nMore recent observations of FTEs and ground signatures have been made utilising the \nCluster spacecraft (Wild et al., 2001; 2003).  In the first of these a series of FTEs were \nobserved as the Cluster spacecraft moved through the outer post noon magnetosphere \nto the magnetosheath in a 2 hour interval.  The FTEs were seen as enhancements in \nthe total magnetic field, a bipolar variation in the component of the field normal to the \nmagnetopause and also as small bursts of mixed magnetosphere and magnetosheath \nplasma.  Figure 4 presents the radar observations made during the interval in which \nCluster observed the FTEs.  In this figure the radar backscatter power and Doppler \nvelocity are presented for each of beams 1, 2 and 3.  The dashed vertical lines \nrepresent the times at which FTEs were observed by Cluster, in addition to an \nobservation of a boundary layer (BL) and three magnetopause crossings (MP).  \nAlthough the estimated spacecraft footprint was some 2h in local time to the east of \nthe data presented in Figure 4, there were clear pulsations in both Doppler velocity \nand backscatter power which moved polewards.  These are classic pulsed ionospheric \nflows (PIFs) and poleward moving radar auroral forms (PMRAFs), the latter being \nidentified by arrows in the panels presenting backscatter power.  The time variation in \n6 \nthe velocity is less clear and so Figure 5 presents the Doppler velocity in beam 3 (top \npanel) together with, as a time series, the average Doppler velocity between 75 and 76 \no magnetic latitude in the middle panel (blue line).  It is clear that with each of the first \n4 FTEs there is an enhancement in the Doppler velocity.  It should be noted that \nwhere there are such enhancements at these lower latitudes, they precede a PMRAF at \nhigher latitudes.  Wild et al. (2001) concluded that the PIF\/PMRAF originated at the \nlower latitudes (close to the footprint of Cluster) and then propagated poleward to \nhigher latitudes where they resemble the more classic signatures.  This further \nsuggests that the PMRAFs are fossils of ionospheric structuring which takes place at \nlower latitudes at the footprint of the reconnection site, or merging gap, as also \nsuggested by Davies et al. (2002). \n \nThe flows at this lower latitude region were consistent with westward flow.  Since the \nsatellite observations were in the post noon sector and the IMF was directed \ndawnward and southward, Wild et al. (2001) proposed that this region of westward \nflow corresponded to the newly opened flux tubes.  The extent of this westward flow \nregion is difficult to judge from the northern hemisphere alone.  Figure 5 (lower \npanel) illustrates that there were also pulsed flows in the southern hemisphere in a \nrange nearly magnetically conjugate to the northern hemisphere flows presented in \nthis figure.  Furthermore, by averaging the Doppler velocity over the same latitude \nregion as the northern hemisphere observations (Figure 5, middle panel, red curve) we \nsee that in association with the first 4 FTEs the flows in the southern hemisphere are \nalso enhanced in near synchronisation with the northern hemisphere observations.  \nFurthermore, a map potential analysis (Ruohoniemi and Baker, 1998) also \ndemonstrates that the flows in the southern hemisphere occur in the dawn LT sector \nand are clearly eastward directed (see Wild et al., 2003).   \n \nThis latter observation is important to help assess the location and potential extent of \nthe reconnection site for these events.  The two general scenarios are presented in \nFigure 6 (based on Wild et al., 2003).  The two top panels represent the scenario \nwhere the reconnection region is localised in the post noon sector and to the east of \nthe radar field of view.  The lower two panels represent a case where the reconnection \nsite extends across the noon local time sector.  The flow response is summarised by \nthe arrow and while the northern hemisphere radar data alone would not be able to \n7 \ndetermine which of the two scenarios is the most likely, the addition of the southern \nhemisphere data demonstrates that the latter case of an extended region across noon is \nthe most likely case.   \n \n4. Flow excitation during magnetospheric substorms \n \nThe expanding\/contracting polar cap model of flow excitation indicates that \nreconnection in the geomagnetic tail should stimulate flow in much the same way that \nreconnection at the dayside magnetopause does.  There seem to be two distinct \ncategories of reconnection in the tail, azimuthally localised features, termed bursty \nbulk flows (BBFs) which have a variety of signatures in the ionosphere (e.g. Grocott \net al., 2004, Boralv et al., 2005) and the larger scale reconnection which occurs at \nsome stage during the expansion phase of a magnetospheric substorm.  A general \ndiscussion of substorms is dealt with elsewhere in more detail (Nakamura, 2005), but \nhere we consider the flow excitation associated with substorms.  In one such study, \nGrocott et al. (2002) used the SuperDARN data to demonstrate the excitation of a \ntwin vortex flow on the nightside associated with a modest substorm which occurred \nduring a period of weak northward IMF but with a strong By component.  The flows \nwere found to occur in the region of the substorm auroral bulge as observed by Polar \nVIS.  Furthermore, the transpolar voltage increased from 40 kV in the pre expansion \nphase onset interval to 80 kV after onset, before decaying to about 35 kV some 10 \nminutes into the recovery phase. \n \nThis result was confirmed by a statistical study of flows measured by SuperDARN \nusing the IMAGE FUV auroral imager (Mende et al., 2000) to identify the location of \nthe auroral break-up for 67 substorms (Provan et al., 2004).  In this study, the \nionospheric flows were ordered by the magnetic latitude and magnetic local time of \nthe auroral break-up to remove any spatial averaging caused by differences in the \nbreak-up region.  The flows were averaged at 2 minute intervals from 30 minutes \nbefore onset to 30 minutes after onset.  There is a clear development of a two cell \nconvection pattern during the growth phase.  Following expansion phase onset the \nflows in the nightside region near the auroral break-up region become very weak, and \nthe flow appears to be diverted around this region.  The estimated cross polar cap \npotential appears to peak some 10 minutes after the onset although the variability in \n8 \nthis parameter is quite large.  The enhancement in the cross polar cap potential from \njust before onset is of order 30 kV, in agreement with Grocott et al. (2002).  This \nwork demonstrated for the first time on a statistical basis that the dayside and \nnightside reconnection both drive flows independently of each other. \n \n5.  Large scale response of the polar ionosphere \n \nThe last decade has seen an improvement in the ability to image the global auroral \nand polar regions from space with good (seconds to minutes) time resolution.  The \nVIS (Frank et al., 1995), and UVI (Torr et al., 1995) imagers on board Polar and the \nFUV imager on IMAGE (Mende et al., 2000) have all contributed to the observations \nof the dynamics of the auroral oval and polar cap for intervals of 10 – 12 hours at a \ntime.   \n \nBy comparing observations of the UV aurora with other observations such as the \nspectral width parameter measured by the SuperDARN radars and low earth orbiting \nparticle measurements, Milan et al. (2003) have demonstrated that the size of the \npolar cap, i.e. the region of open flux, can be estimated from global auroral images.  \nSince the variation in the amount of magnetic flux can be used to calculate the \ntranspolar voltage, this is an alternative global method of investigating the expanding \ncontracting polar cap model.  Figure 7 illustrates how the polar cap area varies during \na period when there were a number of changes in the polar cap area as well as 2 \nmagnetospheric substorms.  The polar cap area is plotted in the top panel while the \nlower panel presents the IMF Bz component for this interval.  The grey shading of the \npolar cap area line represents the uncertainty assuming that the estimate of the polar \ncap boundary is incorrect by ±1 degree of latitude at all magnetic local times. \n \nThere are several points to make about this figure.  Firstly, it is clear that during the \nintervals of southward IMF, the polar cap area does increase.  This is most easily seen \nfollowing 0900 UT and after 1400 UT.  In the first case the voltage associated with \nthe expansion of the polar cap area is +52 kV and in the second it is +111 kV, with \nthe higher value being associated with the more negative Bz.  The two substorms (SB1 \nand SB2) result in decreases in area of the polar cap.  This is particularly clear in the \nfirst case when the polar cap area decreases by a factor of 3 following the expansion \n9 \nphase onset, resulting in a voltage of -119 kV.  The second substorm occurs during a \nperiod of negative Bz and so the decrease is not as marked as reconnection at the \ndayside still continues.  Furthermore, psuedobreakups or small auroral break ups also \nresult in the decline of the polar cap area in the first case (AB1) and a slowing of the \nincrease in the second case (AB2).   \n \nIn addition, during the second interval of southward IMF, Milan et al. (2003) were \nable to calculate the reconnection voltage in the frame of the polar cap boundary by \nusing the flows measured by the SuperDARN radars across the boundary.  This \ntechnique is described in detail by Baker et al. (1997) and has subsequently been used \nin a number of studies (e.g. Chisham et al., 2004).  Using this technique Milan et al \n(2003) calculated the integrated reconnection electric field between 05 and 19 MLT to \nbe 104 kV during the second substorm growth phase, in good agreement with the \nvalue measured from the change in the polar cap area.  There was also evidence \nduring this interval for pulsed reconnection at the dayside magnetopause.  The good \nagreement between the two different estimates of the reconnection voltage during this \ninterval is strong evidence in support of the convection excitation discussed by Siscoe \nand Huang (1985) and Cowley and Lockwood (1992).  Finally, when the IMF was \nnorthward and reconnection in the tail had stopped, the polar cap area remained \nconstant.  This indicates that, during this interval at least, there was no closure of open \nflux by lobe reconnection in both hemispheres simultaneously.  Observation of \nseveral intervals allowed Milan et al. (2006) to estimate the rate and duration of flux \nclosure during magnetospheric substorms.  These authors found that during a typical \nsubstorm ~0.25 GWb of open magnetic flux in the tail was closed. \n \n6. Outstanding questions \n \nDespite the success of the expanding-contracting polar cap model in predicting many \nof the signatures of ionospheric flow associated with reconnection at the dayside and \nin the tail, there remain a number of outstanding questions.  In terms of the coupling \nbetween the solar wind, magnetosphere and ionosphere, we still have a poor \nunderstanding of what happens during northward IMF conditions.  Suggestions have \nbeen made about the nature of flow excitation but there remain unresolved questions \nconcerning the location of reconnection, whether it occurs in one hemisphere only or \n10 \nboth hemispheres simultaneously (e.g. Imber et al., 2006), and the consequences for \nthe ionosphere.  There also remain a number of questions about the flow generated \nduring substorms.  For example, what are the flows and how much flux is typically \nreconnected during a psuedobreakup, how quickly after expansion phase onset does \nflow become excited, how long into the recovery phase does flow continue to be \nexcited?  Furthermore, there remain questions about the flow excitation in both \nhemispheres.  Also the high latitude SuperDARN radars have been less successful at \nmeasuring the ionospheric flow during very disturbed conditions (e.g. magnetic \nstorms), due mainly to ionospheric effects on the propagation of the HF signal.  \nLower latitude radars are now being planned and deployed to investigate the \nionospheric flow during storms. \n \nThis paper has concentrated on flow excitation and the dynamics of the polar cap and \nto a lesser extent the auroral oval.  Of course there are other questions that are \nimportant in understanding the response of the ionosphere to the solar wind-\nmagnetosphere coupling that have not been addressed due to space constraints.  These \ninclude the different spatial and temporal scales of auroral activity, the coupling \nbetween the ionosphere and thermosphere and how energy can be transported into the \nlower atmosphere. \n \n7. Summary \n \nThe paper presents an overview of the coupling between the solar wind and \nmagnetosphere and the consequences in the ionosphere.  It concentrates on \nreconnection as the main mechanism for coupling and the flow that is then excited in \nthe ionosphere as a marker of magnetospheric convection.  The flow excitation model \nof Cowley and Lockwood is shown to be supported by a wide range of observations, \nincluding dayside reconnection, ionospheric flow stimulation during magnetospheric \nsubstorms, and the variation in the polar cap area.   \n \nAcknowledgements \n \nThe authors are grateful to the PIs of all the instruments and missions from which data \nare used in this study.  ML acknowledges funding from the International Space \n11 \nScience Institute.  ML, SEM and GP acknowledge funding from PPARC via grant \nPPA\/G\/O\/2003\/00013 \n \nReferences \n \nBaker, K.B., A.S. Rodger and G. Lu, HF radar observations of the dayside magnetic \nmerging rate: A Geospace Environment Modeling boundary layer campaign \nstudy, J. Geophys. Res., 102, 9603 – 9617, 1997 \nBorälv, E., H.J. Opgenoorth, K. Kauristie, M. Lester, J.-M. Bosqued, J.P. Dewhurst, \nA. Fazakerley, C.J. Owen, J.A. Slavin, M. Dunlop and M. Carter, Correlation \nbetween ground-based observations of substorm signatures and magnetotail \ndynamics, Annales Geophysicae, 23, 997 - 1011, 2005 \nChisham, G., M.P. Freeman, I.J. Coleman, M. Pinnock, M.R. Hairston, M. Lester and \nG.J. Sofko, Measuring the dayside reconnection rate during an interval of due \nnorthward interplanetary magnetic field, Ann. Geophysicae, 22, 4243 - 4258, \n2004 \nCowley, S.W.H., Excitation of flow in the Earth’s Magnetosphere-Ionosphere system: \nObservations by Incoherent-Scatter Radar, in Polar Cap Boundary Phenomena, \nedited by J. Moen et al., pp 127 – 140, Kluwer Academic Publishers, \nNetherlands, 1998 \nCowley, S.W.H. and M. Lockwood, Excitation and decay of solar wind driven flows \nin the magnetosphere-ionosphere system, Ann. Geophysicae., 10, 103 –115, \n1992 \nCowley, S.W.H., J.P. Morelli and M. Lockwood, Dependence of convective flows \nand particle precipitation in the high latitude dayside ionosphere on the X- and \nY- components of the interplanetary magnetic field, J. Geophys. Res., 96, 5557–\n5564, 1991 \nDavies, J.A., T.K. Yeoman, I.J. Rae, S.E. Milan, M. Lester, M. Lockwood and K.A. \nMcWilliams, Ground-based observations of the auroral zone and polar cap \nionospheric responses to dayside transient reconnection, Ann. Geophysicae, 20, \n781 – 794, 2002 \nDungey, J.W., Interplanetary field and the auroral zones, Phys. Res., Lett., 47-48,  \n1961 \n12 \nDungey, J. W., The structure of the exosphere, or adventures in velocity space, in \nGeophysics: The Earths Environment, edited by C. DeWitt, J. Hiebolt and A. \nLebeau, pp 526-535, Gordon and Breach, Newark, N. J., 1963 \nElphic, R.C., M. Lockwood, S.W.H. Cowley, and P.E. Sandholt, Flux transfer events \nat the magnetopause and in the ionosphere, Geophys. Res. Lett., 17, 2241-2244, \n1990 \nFrank, L.A., J.B. Sigwarth, J.D. Craven, J.P. Cravens, J.S. Dolan, M.R. Dvorsky, P.K. \nHardebeek, J.D. Harvey and D.W. Muller, The Visible Imaging System (VIS) \nfor the Polar spacecraft, Space Sci. Rev., 71, 297 – 311, 1995 \nFreeman, M.P. and D.J. Southwood, The effect of magnetospheric erosion on mid-\nlatitude and high-latitude ionospheric flows, Planet. Space Sci., 36, 509 – 522, \n1988 \nGreenwald, R.A., K.B. Baker, J.R. Dudeney, M. Pinnock, T.B. Jones, E.C. Thomas, \nJ.-P. Villain, J.-C. Cerisier, C. Senior, C. Hanuise, R.D. Hunsucker, G. Sofko, J. \nKoehler, E. Nielsen, R. Pellinen, A.D.M. Walker, N. Sato and H. Yamagishi, \nDARN\/SuperDARN: A global view of the dynamics of high latitude convection, \nSpace Sci. Rev., 71, 761-796, 1995 \nGrocott, A., S.W.H. Cowley, J.B. Sigwarth, J.F. Watermann and T.K. Yeoman, \nExcitation of twin-vortex flow in the nightside high-latitude ionosphere during \nan isolated substorm, Ann. Geophysicae, 20, 1577-1601, 2002. \nGrocott, A., T.K. Yeoman, R. Nakamura, S.W.H. Cowley, H.U. Frey, H. Reme and B. \nKlecker, Multi-instrument observations of the ionospheric counterpart of a \nbursty bulk flow in the near-Earth plasmasheet, Ann. Geophysicae, 22, 1061 – \n1075, 2004. \nHaerendel, G., G. Paschmann, N. Sckopke, H. Rossenbauer and P.C. Hedgecock, The \nfrontside boundary layer of the magnetopause and the problem of reconnection, \nJ. Geophys. Res., 83, 3195-3216, 1978. \nHeppner, J.P. and N.C. Maynard, Empirical high-latitude electric field models, J. \nGeophys. Res., 92, 4467-4489, 1987. \nImber, S.M., S.E. Milan, B. Hubert, The auroral and ionospheric flow signatures of \ndual lobe reconnection, Ann. Geophys., In Press, 2006. \nLockwood, M., Identifying the open-closed field line boundary, Polar cap Boundary \nPhenomena, p 73 – 90, J. Moen, A. Egeland and M. Lockwood (eds), Kluwer \nAcademic Publishing, Netherlands, 1998. \n13 \nMcWilliams, K.A., T.K. Yeoman and G. Provan, A statistical study of dayside pulsed \nionospheric flows as seen by the CUTLASS Finland HF radar, Ann. \nGeophysicae, 18, 445-453, 2000 \nMende, S.B., H. Heetderks, H.U. Frey et al., Far ultraviolet imaging for the IMAGE \nspacecraft, Space Sci. Rev., 91, 243 – 287, 2000 \nMende, S.B., C.W. Carlson, H.U. Frey, L.M. Peticolas and N. Østgaard, FAST and \nIMAGE-FUV observations of a substorm onset, J. Geophys. Res., 108, A9, \n1344, 10.1029\/2002JA009787, 2003. \nMilan, S.E., M. Lester, S.W.H. Cowley, and M. Brittnacher, Convection and auroral \nresponse to a southward turning of the IMF: Polar UVI, CUTLASS and IMAGE \nsignatures of transient magnetic flux reconnection at the magnetopause, J. \nGeophys. Res., 105, 15741-15756, 2000 \nMilan, S.E., M. Lester, S.W.H. Cowley, K. Oksavik, M. Brittnacher, R.A. Greenwald, \nG. Sofko and J.-P. Villain, Variations in the polar cap area during two substorm \ncycles, Ann. Geophysicae, 21, 1121-1140, 2003. \nMilan, S.E., J.A. Wild, A. Grocott and N.C. Draper, Space and ground-based \ninvestigations of solar wind-magnetosphere-ionosphere coupling, Adv. Space \nRes., 38, 1671 - 1677, 2006. \nNakamura, R., Substorms and their solar wind causes, this volume, 2006. \nNeudegg, D.A., T.K. Yeoman, S.W.H. Cowley, G. Provan, G. Haerendel, W. \nBaumjohann, U. Auster, K.-H. Fornacon, E. Georgescu and C.J. Owen, A flux \ntransfer event observed at the magnetopause by the Equator-S spacecraft and in \nthe ionosphere by the CUTLASS HF radar, Ann. Geophysicae, 17, 707-711, \n1999 \nNeudegg, D.A., S.W.H. Cowley, S.E. Milan, T.K. yeoman, M. Lester, G.Provan, G. \nHaerendel, W. Baumjohann, B. Nikutowski, J. Buchner, U. Auster, K.-H. \nFornacon and E. Georgescu, A survey of magnetopause FTEs and associated \nflow bursts in the polar ionosphere, Ann. Geophysicae, 18, 416-435, 2000 \nNeudegg, S.W.H. Cowley, K.A. McWilliams, M. Lester, T.K. Yeoman, J. Sigwarth, \nG. Haerendel, W. Baumjohann, U. Auster, K.-H. Fornacon, and E. Georgescu, \nThe UV aurora and ionospheric flows during flux transfer events, Ann. \nGeophysicae, 19, 179-188, 2001 \n14 \nPinnock, M., A.S. Rodger, J.R. Dudeney, K.B. Baker, P.T. Newell, R.A. Greenwald \nand M.E. Greenspan, Observations of an enhanced convection channel in the \ncusp ionosphere, J. Geophys. Res., 98, 3767-3776, 1993 \nProvan, G., T.K. Yeoman and S.E. Milan, CUTLASS Finland radar observations of \nthe ionospheric signatures of flux transfer events and the resulting plasma flows, \nAnn. Geophysicae, 16, 1411-1422, 1998 \nProvan, G., M. Lester, S.B. Mende and S.E. Milan, Statistical study of high-latitude \nplasma flow during magnetospheric substorms, Ann. Geophysicae, 22, 3607-\n3624, 2004. \nRishbeth, H. and O. Garriott, Introduction to Ionospheric Physics, Academic Press, \nLondon, 1969. \nRuohoniemi, J.M. and K.B. Baker, Large-scale imaging of high-latitude convection \nwith Super Dual Auroral radar Network HF radar observations, J. Geophys. \nRes., 103, 20797-20811, 1998 \nRussell, C.T., The configuration of the magnetosphere, in Critical Problems of \nMagnetospheric Physics, Ed. E.R. Dyer, Inter Union Committee on STP, \nnational Academy of Sciences, Washington DC, 1 – 16, 1972 \nRussell, C.T. and R.C. Elphic, Initial ISEE magnetometer results: magnetopause \nobservations, Space Sci. Rev., 22, 681-715, 1978 \nRussell, C.T. and R.C. Elphic, ISEE observations of flux transfer events at the dayside \nmagnetopause, Geophys. Res. Lett., 6, 33-36, 1979 \nSchunk, R.W. and A.F. Nagy, Ionosphere – Physics, Plasma Physics and Chemistry, \nCUP, Cambridge, 2000. \nSiscoe, G. and T.S Huang, Polar cap inflation and deflation, J. Geophys. Res., 90, \n543-547, 1985 \nTorr, M.R., D.G. Torr, M. Zukic, R.B. Johnson, J. Ajello, P. Banks, K. Clark, K. \nCole, C. Keffer, G. Parks, B. Tsurutani and J. Spann, A far ultraviolet imager for \nthe international solar-terrestrial physics mission, Space Sci. Rev., 71, 329-383, \n1995 \nWild, J.A., S.W.H. Cowley, J.A. Davies, H. Khan, M. Lester, S.E. Milan, G. Provan, \nT.K. Yeoman, A. Balogh, M.W. Dunlop, K.-H. Fornacon and E. Georgescu, \nFirst simultaneous observations of flux transfer events at the high-latitude \nmagnetopause by the Cluster spacecraft and pulsed radar signatures in the \n15 \nconjugate ionosphere by the CUTLASS and EISCAT radars, Ann. Geophysicae, \n19, 1491-1508, 2001. \nWild, J.A., S.E. Milan, S.W.H. Cowley, M.W. Dunlop, C.J. Owen, J.M. Bosqued, \nM.G.G.T. Taylor, J.A. Davies, M. Lester, N. Sato, A.S. Yukimatu, A.N. \nFazakerley, A. Balogh and H. Reme, Coordinated interhemispheric SuperDARN \nradar observations of the ionospheric response to flux transfer events observed \nby the Cluster spacecraft at the high-latitude magnetopause, Ann. Geophysicae, \n21, 1807-1826, 2003. \n16 \n \n \nFigure 1.  Schematic representation of reconnection at the dayside magnetosphere and \nin the tail which drives magnetospheric dynamics (after Dungey, 1961). \n \n \n17 \n \n \n \nFigure 2.  Sketch of the basic form of the time dependent flow excited by \nreconnection at the dayside magnetopause and in the geomagnetic tail (based on \nCowley and Lockwood, 1992) \n \n18 \n \n \n \n \n \nFigure 3.  Sketch of the typical signatures of a FTE seen by a space borne \nmagnetometer in boundary normal co-ordinates where the N component is normal to \nthe local magnetopause boundary while the L and M components are in the plane of \nthe local magnetopause boundary. \n \n \n19 \n \n \nFigure 4.  Radar backscatter power and Doppler velocity as a function of magnetic \nlatitude and UT from 3 beams of the CUTLASS Finland radar (after Wild et al., \n2001).  FTEs and excursions into a boundary layer (BL) and across the magnetopause \n(MP) are identified by vertical dashed lines. \n \n20 \n \n \nFigure 5.  Doppler velocity from Beam 2 of CUTLASS Finland (panel a) and Syowa \n(panel c).  Panel b shows the averaged velocity between the horizontal dashed lines in \npanels a and c (after Wild et al., 2003). \n \n \n21 \n \n \nFigure 6.  Schematic representations of the possible locations of the newly \nreconnected magnetic flux at the polar cap boundary and the flows that would be \ngenerated for the events shown in Figures 3 and 4.   In panels a and b the newly \nreconnected flux is limited to the post noon sector, while in panels c and d the newly \nreconnected flux extends across noon. \n \n22 \n \n \nFigure 7.  The variation of the polar cap area for the time interval 09 – 16 UT and the \nIMF Bz component during the same time interval (after Milan et al., 2003). \n \n \n23 \n"}