{"doi":"10.1080\/13621025.2010.490036","coreId":"218345","oai":"oai:eprints.lse.ac.uk:33476","identifiers":["oai:eprints.lse.ac.uk:33476","10.1080\/13621025.2010.490036"],"title":"The politics of other citizens","authors":["White, Jonathan"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-08","abstract":"In all kinds of political action, citizens are confronted with the performances of other citizens. An important guide to political behaviour is therefore likely to be the assumptions people make concerning how others can be expected to behave. This article explores common sense ideas about other citizens as potential political participants, drawing on a series of group interviews conducted with taxi-drivers in Britain, Germany and the Czech Republic. I argue the expectations voiced of other citizens tend to be pessimistic in nature, casting them as ill-informed, apathetic, passive and unduly self-interested, notwithstanding the appearance of a more optimistic view which holds they can be expected to follow the lead of those who 'take a stand'. These empirical observations lead to a discussion of the theoretical issues they raise, notably where to locate the origins of such views, and how to appraise their implications for democracy","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/218345.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/33476\/1\/White_The%20Politics%20of%20Other%20Citizens%20resubmitted.pdf","pdfHashValue":"3c33b03eae274acc3fb436ef4cae1860bbbebb29","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:33476<\/identifier><datestamp>\n      2016-02-11T15:48:00Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4555<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/33476\/<\/dc:relation><dc:title>\n        The politics of other citizens<\/dc:title><dc:creator>\n        White, Jonathan<\/dc:creator><dc:subject>\n        JC Political theory<\/dc:subject><dc:subject>\n        JN Political institutions (Europe)<\/dc:subject><dc:description>\n        In all kinds of political action, citizens are confronted with the performances of other citizens. An important guide to political behaviour is therefore likely to be the assumptions people make concerning how others can be expected to behave. This article explores common sense ideas about other citizens as potential political participants, drawing on a series of group interviews conducted with taxi-drivers in Britain, Germany and the Czech Republic. I argue the expectations voiced of other citizens tend to be pessimistic in nature, casting them as ill-informed, apathetic, passive and unduly self-interested, notwithstanding the appearance of a more optimistic view which holds they can be expected to follow the lead of those who 'take a stand'. These empirical observations lead to a discussion of the theoretical issues they raise, notably where to locate the origins of such views, and how to appraise their implications for democracy.<\/dc:description><dc:publisher>\n        Routledge<\/dc:publisher><dc:date>\n        2010-08<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/33476\/1\/White_The%20Politics%20of%20Other%20Citizens%20resubmitted.pdf<\/dc:identifier><dc:identifier>\n          White, Jonathan  (2010) The politics of other citizens.  Citizenship Studies, 14 (4).  pp. 411-427.  ISSN 1362-1025     <\/dc:identifier><dc:relation>\n        http:\/\/www.tandf.co.uk\/journals\/ccst<\/dc:relation><dc:relation>\n        10.1080\/13621025.2010.490036<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/33476\/","http:\/\/www.tandf.co.uk\/journals\/ccst","10.1080\/13621025.2010.490036"],"year":2010,"topics":["JC Political theory","JN Political institutions (Europe)"],"subject":["Article","PeerReviewed"],"fullText":"  \nJonathan White  \nThe politics of other citizens \n \nArticle (Accepted version) \n(Refereed) \n \n \n Original citation: White, Jonathan (2010) The politics of other citizens. Citizenship Studies, 14 (4). \npp. 411-427. ISSN 1362-1025  \n \nDOI: 10.1080\/13621025.2010.490036 \n \n  \n© 2010 Routledge \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/33476\/ \nAvailable in LSE Research Online: February 2016 \n \nLSE has developed LSE Research Online so that users may access research output of the School. \nCopyright © and Moral Rights for the papers on this site are retained by the individual authors and\/or \nother copyright owners. Users may download and\/or print one copy of any article(s) in LSE Research \nOnline to facilitate their private study or for non-commercial research. You may not engage in further \ndistribution of the material or use it for any profit-making activities or any commercial gain. You may \nfreely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE Research Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be differences \nbetween this version and the published version.  You are advised to consult the publisher’s version if \nyou wish to cite from it. \n \n \n \n 1 \nThe Politics of Other Citizens \nWhite, Jonathan (2010), ‘The politics of other citizens’, Citizenship Studies, 14 (4). 411-\n427. ISSN 1362-1025 \n \nIn all kinds of political action, citizens are confronted with the performances of other citizens.  An \nimportant guide to political behaviour is therefore likely to be the assumptions people make concerning \nhow others can be expected to behave.  This paper explores common-sense ideas about other citizens as \npotential political participants, drawing on a series of group interviews conducted with taxi-drivers in \nBritain, Germany and the Czech Republic.  I argue the expectations voiced of other citizens tend to be \npessimistic in nature, casting them as ignorant, apathetic, passive and\/or selfish, notwithstanding the \nappearance of a more optimistic view which holds they can be expected to follow the lead of those who \n‘take a stand’.  These empirical observations lead to a discussion of the theoretical issues they raise, \nnotably where to locate the origins of such views, and how to appraise their implications for democracy. \n \nAll forms of political participation depend ultimately for their outcome on the actions of other \nmembers of the political community.\n1\n  From the formation of social movements to the \norganisation of boycotts, collective action is rewarding to the extent that other citizens can be \nencouraged to participate.  Likewise voting choices vary in their impact according to the choices \nof others or their decisions to abstain.  Citizenship, one may say, is marked by the fact of \ninterdependence.  More importantly, this is anything but a revelatory insight.  It is something that \nmost citizens themselves are likely to acknowledge, following even the most basic form of \npolitical socialisation.  The implication is that there are therefore good reasons to explore the \nassumptions commonly made of other citizens, since what these ‘others’ can be expected to do is \nlikely to be an influence both on individual acts of engagement and the health of democratic \npolitics more generally.   \nThe potential significance of such views has been noted by a number of scholars.  In \npolitical psychology and communications, W. Phillips Davison developed the notion of the \n‘third-person effect’ to describe common expectations regarding the susceptibility of others to \nthe negative influence of the mass media (Davison 1983).  His suggestion was that people \ngenerally overestimate the susceptibility of others to media persuasion while underestimating \ntheir own, a phenomenon liable to boost the popularity of censorship and other encroachments \non free speech.  In the eyes of each, ‘I’ am immune to such influence, ‘you’ need to be careful, \nand ‘they’ need to be protected from exposure.  Popular expectations of others have also been \n 2 \ncentral to the literature on trust, where the problem tends to be formulated in rationalist terms as \none of resource allocation: individuals face the challenge of determining how much trust to place \nin strangers under conditions where knowledge of their likely behaviour is limited and where \nexcessive or insufficient trust can prove costly (Gambetta 1988) (Stolle and Hooghe 2004) \n(Hardin 2006) (Offe 1999).  Political capital, understood as the conditions necessary to a \nfunctioning democracy, is seen as dependent on underlying forms of social capital to do with the \nincentives and opportunities to trust, interact and display community feeling (Putnam 2000). \nThis article’s focus is slightly different.  It casts the net more widely than questions of \nperceived media influence and their implications for free speech, and in this sense departs from \nthe communications literature.  While undeniably of special importance, such concerns reflect \nthe priorities of one political tradition in particular, namely liberal individualism, and a more \ncomplete treatment requires one to keep in mind the concerns of other traditions such as \ndeliberative or adversarial republicanism.  Then, in contrast to much of the trust literature, the \nemphasis here is not so much on general dispositions towards others in society but specifically \non expectations of others as political participants, who do or do not seek to take action on \nsubstantive matters of common concern.  The focus is directly on the health of citizenship and \npolitical community, in other words, not society, community or social integration in a general \nsense.\n2\n  \nPerhaps the most similar approach is found in the work of John Hibbing and Elizabeth \nTheiss-Morse, who as part of their elaboration of the concept of stealth democracy explore \nAmerican public perceptions about the political capabilities and inclinations of US citizens \n(Hibbing and Theiss-Morse 2002, pp.112ff.).  They find high levels of scepticism regarding the \npolitical engagement of others, and the empirical observations we shall trace below indicate \nmany of their findings for the US population can plausibly be extended to populations in Europe.  \nThat fellow citizens can be presumed to be politically unaware, apathetic, passive and unduly \nself-interested are views that arise in a series of group interviews conducted by the author with \n 3 \ntaxi-drivers in Britain, Germany and the Czech Republic, explored in some depth in what \nfollows. \nYet in addition to drawing attention to a distinctive aspect of our empirical material, in \nwhich the possibility of galvanising other citizens is raised, we shall explore ways to think \ndifferently about the theoretical implications of the findings.  Hibbing and Theiss-Morse use \ntheir results to support the wider claim that political theorists need to respect the public’s desire \nto remain largely aloof from daily politics.  In contrast, here it will be noted not only that \nparticipants to the research themselves tend to express a certain dissatisfaction with the negative \nqualities they identify in others, but that there are good reasons why contemporary observers of \ndemocracy should be concerned about the kinds of assumption expressed.  The second part of the \npaper is therefore devoted to thinking theoretically about the nature and significance of the \npatterns detected, notably their origins and their likely political consequences. \n \n \nStudying Discursive Practices \n \nTo explore expectations of ‘the politics of other citizens’ requires one first to delimit the research \nfield.  In particular, how should one understand the notion of ‘other citizens’?  There is a sense, \nafter all, in which any social category and its related associations can be seen as evoking ideas \nabout other citizens insofar as the category includes as its intended referents other members of \nthe political community.  So, for example, social categories such as ‘businessmen’, ‘Muslims’, \n‘Christians’, ‘police-officers’, ‘single mothers’, ‘the unemployed’, and ‘philanthropists’ might all \nbe treated as particular kinds in the generic category of fellow citizen, and thus examined for \ntheir accompanying patterns of usage or category knowledge.   \nIt may be possible however to mark out for investigation a smaller, distinctive set of \nexpectations linked more closely to the idea of citizenship.  These are those expectations \nassociated with the word ‘citizen’ itself, and with related words such as ‘voters’, ‘followers’, \n 4 \n‘others’, ‘people’, ‘people in this country \/ of our nationality’, ‘the general public’, ‘society’, \n‘everyone’, and others of the kind we shall encounter below as they are invoked by speakers \nwhen discussing the political inclinations of others.  In one sense these are social categories like \nany other, and it would be mistaken to treat them as overarching ones that incorporate the \nmultitude of social roles according to some principle of generality.  To express views about \n‘everyone’ is not the same as to express views about people of all social descriptions.  Yet from \nthe perspective of the politically interested observer these categories do have a special \nsignificance, in that they are amongst those likely to be most salient for many forms of political \nparticipation.  If practices and concepts tend to cluster with one another (Swidler 2001), one can \nassume these are amongst the categories likely to cluster around practices such as the electoral \nprocess and various types of collective action.  During election campaigns and on election day, \n‘the voter’ is likely to be a prominent idea, while in the preparation and enactment of a strike, \nboycott, or act of civil disobedience, ‘the general public’ will probably be a relevant \nconsideration.  These are categories of special significance in the practices and discourse of \ncitizenship, and the expectations which attach to them are likely to be significant both for \nconcrete political actions and for the more general self-understanding of the political community. \nExpectations and assumptions can be treated as routinised discursive practices – the \npatterned ways of speaking recurrent in everyday talk.  While sometimes they may express \nconsciously formed views, perhaps more often they express the taken-for-granted ideas that \nprecede deliberation and reflection (Schatzki et al. 2001).  As such, they are best studied not by \nquestionnaires aiming to elicit fully-formed ‘beliefs’, but through the close analysis of naturally-\noccurring or loosely structured texts.  Lightly moderated group interviews provide a useful \nmeans to study everyday discursive practices of this kind.  They allow considerable scope for \nparticipants to set the terms of discussion, and involve participants interacting with each other as \nwell as the researcher (Morgan 1997).  The audience for each intervention is not just a scholarly \none but a peer-group one, implying that speakers cannot afford to attune themselves only to the \nexpected reactions of the former.   \n 5 \nWhat follows draws on material generated in ten group interviews with taxi-drivers \nconducted in Britain, Germany and the Czech Republic between October 2004 and August 2005.  \nThe study was designed to explore various aspects of common-sense understandings of politics \nand political problems, with participants invited to speak freely about the topics of importance to \nthem with limited interference from the researcher (Author 2009a) (Author 2009b).\n3\n  \nConsequently, the kinds of discursive practice that will be highlighted, to do with other citizens \nas potential political actors, were made spontaneously rather than in response to a concerted \neffort to draw discussion towards them.  This element of spontaneity can be seen as one of the \napproach’s virtues, though admittedly it involves a trade-off: the data are therefore \nunstandardised and unevenly dispersed through the material, making formal cross-national \ncomparisons difficult.  The logic of analysis is thus an exploratory one: to probe a number of \nsettings for patterns of theoretical relevance, as a prelude to thinking about their implications, \nrather than to isolate particular discursive features as distinctive of a certain national or social \nposition. \nThis logic informed the selection of taxi-drivers as subjects for interview, the \nsupposition being that their conversation forms a particularly fertile site for studying forms of \ndiscursive practice likely to extend more widely in society.  Taxi-drivers are exposed to a wide \nrange of social stimuli – newspapers, the radio, and the experiences of others as narrated to them \non the job – placing them at the intersection of a large number of discursive formations.  The \ncities for interview were chosen on grounds of geographical spread and diversity in the \nconsolidation of democratic structures: three in Britain (Reading, Swansea and Norwich); three \nin the Czech Republic (Plzeň, Liberec and Ostrava), and four in Germany, including one from \nthe former East (Erfurt) and three from the former West (Lübeck, Kassel and Würzburg).  \nGroups of three to four drivers (thirty-seven participants in total) were recruited using financial \nincentives and assembled in cafés and pubs for discussions of up to two hours.\n4\n  An effort was \nmade to recruit those already in conversation, facilitating richness and depth of discussion.   \n 6 \nAs indicated, the study does not seek to examine hypotheses concerning the relationship between \ndiscursive practice and exogenous identities to do with class, sex, or ethnic background.  \nConsistent with this is the simplicity of the sampling criteria used: a diversity of ages was sought \nfor each group, with the youngest driver in his 20s or 30s and the oldest in his 50s or 60s, and \nwhere ethnic minorities were evident on the taxi-rank (as at Reading), it was made certain that \nthe sample reflected this diversity.  Female drivers were rare in the ten cities studied, and did not \nfeature in the sample.  Their absence clearly reduces the extent to which the sample is \nrepresentative of ‘society’ as defined by socio-demographic make-up, but less so the extent to \nwhich it can be used to uncover discursive patterns of theoretical interest. \n \n \nSome Observations from Discussions with Taxi-Drivers \n \nOf the ten interviews conducted, not all featured the expression of views towards others qua \ncitizens.  In many cases discussion focused mainly on ‘us’, as victims of problems such as bad \nworking conditions, low income, or inadequate provision of law and order, accompanied by the \nevocation of specific others using categories such as ‘the rich’, ‘criminals’, ‘the unemployed’, or \nparticular ethnic groups (Author 2009a).  The evocation of other citizens in the guise of potential \npolitical actors was rarer – in the Swansea and Plzeň groups, there was little material one could \nread in this way.  It may be that non-reference itself should be seen as a kind of routinised \npractice, albeit one of omission, expressing scepticism towards other citizens by treating them as \nunworthy of mention.  To evoke the political potential of others, or to criticise them for failing to \nrealise that potential, already requires the assumption of their relevance.  It is likely that a basic \ndiscursive repertoire of citizenship, affirmative of the political importance of other citizens, \nneeds to be available to participants before conversation can take this turn, and that this \nrepertoire is unevenly spread.  Nonetheless, references across the groups as a whole were \nsufficiently numerous as to allow a series of key points to be made. \n 7 \n \nThe ignorance of other citizens \nAs the first of a series of pessimistic assumptions regarding what can be expected from others, a \nprominent idea is that other citizens are ignorant or naïve in political matters, with opinions ill-\nconsidered or lightly held, and are therefore easily misled.  In the Liberec discussion, Tomáš and \nZdeněk agree that ‘people’ in the Czech Republic tend to vote without thinking: ‘Maybe the \nODS [centre-right party] is doing well in the polls,’ says Tomáš, ‘but that’s not because people \nbelieve it’ll be better under them [Z: it’s not true ...]  It’s not true, they just don’t think about it at \nall.  [Z:  They just refuse to give their vote to the government … they vote for the stronger \nparty.]’  The participants themselves invoke the Left-Right spectrum with considerable \nconfidence when talking about parties, but express doubt concerning the capacity of others to \nthink likewise: ‘here in the Czech Republic,’ says Tomáš, ‘the left-wing perspective still \nprevails, people would rather have security than say “I’ll do everything for myself ... don’t look \nafter me.”’  But when the right-of-centre ODS party does well, it reflects not a considered shift in \npolitical views but the mindlessness with which people vote.  ‘People go and vote for the Right \nwithout knowing what the Right intends to do, simply because they think that those in \ngovernment are doing badly.  And then they discover that the new ones do badly and after four \nyears they jump back to the first ones.  It’s ignorance.  [Z: yeah]  In schools they don’t teach a \nsingle word about politics.  Children don’t know what a political party is or where they stand.’   \n \nThe apathy of other citizens \nThe lack of political engagement ‘most people’ display is a theme in the discussion at Erfurt.  \nWhen Matthias suggests there should have been a referendum on the introduction of the euro \nbecause ‘then it definitely would not have been brought in,’ the other participants are dubious.  \n‘Probably only 20% would have gone along to the referendum,’ says Axel.  Harald suggests the \nproblem is that ‘there’s simply no understanding of democracy there …  Most people have \nalways been led and most people want to be led in some direction.  They let themselves be led.  \n 8 \nThat’s the point, Man is a herd animal.  Put the right one in front of them and they’ll traipse \nalong behind.  Whether it’s to an election or to a demonstration or to a referendum.  A few go \nalong and the others just sit there, for whatever reason.’  Matthias maintains the prospect of the \neuro was sufficiently disliked to cause a large turnout, but his voice is in the minority; Axel \nreminds that ‘at the last election it was also assumed that lots of people would turn out to vote \nbecause everyone was saying that it can’t be right that the SPD stays in power.  And even so one \nended up with a participation rate of a small percentage.’  ‘People are simply cynical,’ adds \nHarald.  ‘They have too many problems …  They haven’t got eyes and ears for anything else.  \nAnd that’s why they can be pushed around this way and that.’   \nA similar set of assumptions is expressed elsewhere in the same discussion: \n \nHarald:  You know, [democracy] it’s a pseudo-issue.  For a certain period of time the people are \nshepherded along with a stick, they’re led along with promises, and unfortunately they’re taken in by it \nbecause they don’t have their own opinion. \n \nUli:  And 40% of them don’t realise it.  The only resource in a democracy is to go and vote. \n \nHarald:  And they don’t do that.  In Germany democracy is just a pseudo-democracy, because you’ve got no \nchance of affecting things afterwards.  [Axel:  Wait, you do have the chance …]  But it’s not given to you \n… \n \nAxel:  It is given to you.  It’s given to you.  But you have to start at the bottom.  I can’t simply go to the top \nand yank Schröder out and say ‘Oi, Gerhard, listen up.’  It doesn’t work like that.  No, but I can start \nwith the municipality.  I vote in the municipal elections … [Uli: yeah] and at the municipal level \nyou’ve got the opportunity, you can go there and you can raise a complaint with the administrative \noffice [Verwaltungsamt] or whatever.  It’s just people aren’t aware.  And that’s why no-one bothers \nabout it now. \n \n 9 \nNotable here again is the contrast between the engagement and awareness participants claim for \nthemselves and that which they ascribe to others.  Both Uli and Axel underline the possibilities \nwhich voting holds, and generally avoid a tone of cynicism about democracy as an ideal.  Yet \nthere is scepticism about the willingness of other citizens to fulfil their role, and an emphasis on \nthe ignorance of democracy which ‘people’ generally display.   \nIt seems natural then that they should emphasise the need to educate people so that they \nbecome more aware and more sophisticated in their opinions.  ‘Everyone has the chance – in \nsimple human terms – everyone can develop for themselves their own opinion,’ says Axel.  ‘And \nthey should do it, and it should be promoted in school.’  Uli laments that ‘at the mass level it’s \nnot being done.’  Axel reiterates the point elsewhere, and refers to the influence of the media in a \nway redolent of Davison’s ideas on the third-person effect:  ‘this “great” [ironic] newspaper we \nhave here in Germany, the Bild Zeitung, that gathers up the opinion of the mob [Pöbel].  And the \nmob, I must quite honestly say, as soon as they read the newspaper they don’t form any further \nopinion for themselves.  Even if the name of the newspaper is “Bild” – “Bild Dir Deine Menung” \n[“Form your own opinion”]5.  They don’t form themselves an opinion.’  Harald, in a separate \ndeployment of the herd motif, worries about the danger of people becoming convinced of the \nwrong ideas: ‘the danger, whether back then with Adolf [Hitler] when there were ten million \nunemployed, or today when there are five million unemployed, Man is a herd-animal.  If you put \nthe right one in front of them they’ll trot along behind.’  For Axel, a suitable goal then is to \n‘strive to educate children to some degree so that they can form their own opinion – not a Bild \nopinion, but their own opinion.  And I don’t mean necessarily the opinion that I have – it doesn’t \nalways have to be the right opinion!  But to have one’s own opinion …’  Note how this emphasis \non education implies both a dissatisfaction with the way things stand, and the sense that they \ncould feasibly be improved. \n \nThe passivity and pessimism of other citizens \n 10 \nAlongside the assumption of other people’s political unawareness or superficiality, one finds the \nexpectation they may be too cautious or inert when it comes to taking action in response to \ncommon problems, and too pessimistic about the likelihood of success.  At Reading, for \nexample, there is some discussion of people’s passivity before rising petrol prices, with a \ncomparison with France used to underline the point.  ‘We’ are concluded in the criticism: ‘it’s \nweird,’ says Malik, ‘how most things, we just take it lying down over here.  [Derek:  Every time, \nyeah…]  Like, the French, they won’t.  They’ll have a revolution, get the guillotines out … [D:  \nStop the boats, stop everything, yeah …]  But no matter what happens over here, you know, goes \nup another 5p, 10p, pound, ‘oh yeah, ok …’  Bit like sheep here in that sense aren’t we, plod \nalong …  [D:  Yeah, you moan, but you don’t do anything about it …]’  In a similar vein, Ulrich \nin Würzburg suggests that ‘people here in Germany, they have the wrong way of looking at \nthings. ...  They always see things immediately as “Oh God, nothing will come of it.”  ... [Ralf: \nyeah]  Here the glass is always half empty.  With Americans for example it’s half full.  Not that I \nfind America great or anything, but we drive around enough Americans here and they just have a \nbit of a different feel for life ... [Oskar: ... the mentality ...].’  At Norwich, there is talk of the \nharmful effects of supermarkets on consumers and small shops, with Malcolm noting: ‘And we \nare the mugs who take it.  We should go in there, we should go into Asda or Morrisons or \nwhatever and we should turn round and say “Get that foreign crap out of our house.”’  Les, \nhowever, expresses doubts: not everyone can be relied upon to take action, and ‘until everybody \ndecides to do it, it’ll never happen.  They [the supermarkets] have got the upper hand all the time \nand they’ll do what they want to do.’ \n \nThe selfishness of other citizens \nA related assumption holds that other citizens lack public-spiritedness.  They are taken to be \nmotivated mainly by immediate self-interest, with little willingness to ‘get involved’ or \ncontribute to the collective good.  Such a perspective takes a number of forms, from the \nassumption that other citizens vote according to narrow self-interest rather than wider \n 11 \nconsiderations, to the assumption they prevent the successful implementation of government \npolicies (taxation regimes, recycling programmes, etc.).  In the discussion at Kassel, the \nwillingness of fellow citizens to litter the local environment is treated as emblematic: Dieter \ncomplains: ‘when you confront people [for social misdemeanours] they don’t want to talk about \nit.  Like I said, colleagues in the taxi trade, if you go up to them because they’ve thrown their \ncigarette butt on the pavement they curse you!’  ‘They push the matter away,’ agrees Peter, ‘and \nthey say “that doesn’t affect me!” [D: yeah].’  There is a need, suggests Hans, ‘to make people \naware that it does affect them.’  Elsewhere in the same discussion, Sebastian suggests today the \nfocus is always on ‘me’.  ‘Forty, fifty years ago, after the war, you always said ‘we’ and you \nhelped each other.  Now it’s “I”.’  At Norwich, as elsewhere, there is considerable discussion of \npeople’s unwillingness to put pressure on their fellow citizens to follow ‘the rules’, whether \nthese be the rules of good social behaviour or those established in law.  Les recalls how he once \nintervened when seeing ‘two lads with their eyes on a young lady there, and if I hadn’t said \nsomething to one of the lads I don’t know where she would have been,’ but he is sceptical about \nthe willingness of others to display similar public-spiritedness: ‘Trouble is that there’s so many \npeople now that go around with their heads in the bloody clouds and they don’t look really \naround them.  …  They don’t look.  …  They’re more happy to go along with what’s happening \nrather than put themselves out to change it.’ \n \nThe possibility of galvanising other citizens? \nThe patterns noted so far largely echo those recorded by Hibbing and Theiss-Morse for the \ncontemporary US population.  In their focus-group research, the presumption of apathy and \nselfishness is widespread, as is the presumption that other citizens do not hold real views.  As \none of their participants says, ‘you’ve got so many people that are just blind sheep that follow \neverything that the media throws at them,’ (Hibbing and Theiss-Morse 2002, p.116).  Perhaps \nthere is a difference in tone though: amongst the groups studied for this article, there tends to be \na sense of dissatisfaction expressed in accompaniment to these observations, as one sees in the \n 12 \ncalls for education.  The characteristics ascribed to other citizens are regarded critically, as a \ndeparture from the standards which democracy requires.  In the passages analysed by Hibbing \nand Theiss-Morse, this critical tone is less prominent, whether this be due to an empirical \ndifference or to the authors’ criteria of selection and evaluation. \nFurthermore, analysis of these European interviews would be incomplete if one omitted \nreference to the appearance of a more positive perspective unmentioned in the US study.  To his \nprevious comment about people with their heads in the clouds, Les in Norwich adds that if \nsomeone were to start a neighbourhood-watch scheme, ‘to build on this issue, you’d probably \nfind they would follow.’  This marks a potentially important counter-theme: while other citizens \nmay be deficient in levels of political awareness, easily misled, too passive, and unwilling to act \nfor the common interest, if someone were to take the initiative, whether it be ‘people like us’ or \nan individual of unusual insight, then others might be willing to follow.  Next to the pessimistic \nassumptions noted, this stands out as more optimistic, though its implications are potentially \nproblematic.  An indication is provided in an extended passage from the Norwich discussion: \n \nLes:  I tell you what would be nice: if the working-class stood up, everybody, and said ‘look, enough is \nenough …’  [Author:  How would you go about doing that?]  All you’d need is somebody who’s a real \nleader.  To spell it out.  Like you’ve now done with us four.  If you could do that with four million … \n \nBill:  Proper working-class, good public speaker, someone probably … example would probably be Sir Bob \nGeldof.  I mean, he’s a nob, a Sir, but he is a working-class lad, and he’d probably believe in the same \nvalues.  [Malcolm:  If you ever called him Sir Bob he’d knock your teeth out …]  You need someone to \nstand up for us.  Somebody we could actually all vote for, instead of saying ‘he’s the best of a bad \nbunch.’  […]  The trouble you’ve got at the moment, the working class, that is a big vote but you’ve got a \nlot now who feel they’ve got no choice, they’re moving towards the BNP [British National Party].  \nYou’ve got the ones, the more left-wing, voting for the Socialist Workers’ Party.  And they’re a waste of \nvotes, moves neither way.  You’ve got to get them back in the mainstream, but if they don’t like what \nthey’re voting for, you know … \n \n 13 \nLes:  What’s that coloured bloke’s name, he who stood up for all the black people who lived in America … \n[Bill:  Martin Luther King?]  Martin Luther King.  If you had somebody like him, talking sense, you \ncould probably bring …  I mean, it wouldn’t take a lot for the working … cos I think working people \nhave had enough, to be honest, really.  Why should we … [Bill:  Yeah.]  Because all our money goes in \nthe pot, and it’s all shared out with people that are taking it.   \n \nMalcolm:  […]  Too many leaders with not enough bottle, too many leaders with not enough charisma, not \nenough belief, because belief breeds belief.  If we voted at this table today and said ‘right, that’s it, the \nCouncil don’t take the piss out of us anymore, the police don’t take the piss out of us anymore, the \npunters [customers] don’t take the piss out of us anymore,’ and we really believed it and we went back \nand said to Joe Bloggs on the rank ‘this is how it’s going to be from now on,’ what do you think?  \nEventually it would spread.  It’s the same with our country.  This is a great country, I love my country, \nmy heart bleeds red, white and blue, and that’s as simple as that.  And if everybody stood up and said \n‘right’ ...  But it’s only the working-class people.  The rich people, the financial institutions, they turn \nround and say ‘how much money can I make from these poor people?’   \n \nLes:  That’s what I’m saying.  The rich can’t be arsed with it, the middle lot - which is ourselves – have got \nno chance, and you’ve got the people down the bottom who are taking all the money anyway, like his \nnext-door neighbour, them people are taking it all.  And you’re left with nothing.  We’re left bloody \nbleeding in the gutter.  That’s basically what it is.  It’s terrible really, but where do you go?   \n \nMalcolm:  You have to have enough people with enough belief in what they believe in to be able to spread \nthat word with enough conviction.  Like …  Now he [points to Bill] would make a good leader.  I would \nfollow him, cos I know he would follow it through.  If he said to me ‘do you want to get your own back \non the police for not clearing out taxi-ranks on a Saturday night?  We’re going to drive around and \naround and around the city, really slowly … Nobody can get to the cinemas, they’re going to complain \nbecause they’re not getting the revenue, well fuck ’em.  Fuck the lot of them.  We deserve to have what \nwe’ve paid for.  Not because they can’t be bothered to give what we’ve paid for.’  If he said he would do \nthat, I’d follow him.  And I’d risk getting arrested for it. \n \n 14 \nGary:  You’d only get half … you’d only get half the drivers wanting to do it.  The rest of them … one of \nthe people would probably get nicked [arrested] and the rest would carry on working, you’ve got to get \neveryone … \n \nBill:  That is the trouble.  That is basically … same as the country – unity.  You’ve always got someone \nwho’ll profit.  Like you said, they’ll always be someone looking ‘ah, I can make a profit …’ \n \nThis is a very rich passage, particularly in its evocation of class-based forms of subjecthood, and \nnot all such elements will be examined here.  Notable for our purposes are the kinds of \nassumption expressed about other citizens.  It will have been noted that many of the sceptical \nmotifs traced above are to be found here too: an attempt at ‘direct action’, for example, would be \ncompromised by the unwillingness of others to take risks for a collective cause, indeed their \ndesire to take advantage of the situation.  At the same time, however, one sees the idea that if a \n‘real leader’ with sufficient charisma (perhaps one of ‘us’) were to take the initiative then others \nwould probably follow, as they have on historical occasions.  Luther King and the pop-singer \nturned activist Bob Geldof are mentioned favourably, and a few sentences before this extract Bill \nhighlights Lech Wałęsa as a ‘brilliant man’ for leading the ship-builders of Poland against the \nCommunist regime.  If the leader is a ‘good’ one, both in terms of personal effectiveness and the \ncause represented, one can expect others to get behind him.  It is an affirmation of the possibility \nof galvanising people for the pursuit of shared ends.   \n Notice though the emphasis which is placed on key individuals.  Perhaps the danger \nimplicit is that the call for a strong and effective leader is driven at least in part exactly by the \nscepticism concerning the inclinations of other citizens.  Their political failings or hesitations \nneed to be overcome by the force of a charismatic individual, someone who can ‘spell it out’.  \nSuch a perspective may be seen to carry an authoritarian tendency.  It also seems conducive to \nwhat one might call a ‘populism against “the people”’ – an act of positioning not just against \nthose opponents deemed generative of hardship, but in the name of ‘people with belief’ against \n 15 \nthose peers considered to be undermining the collective effort.  We shall return to some of the \nimplications below. \n \nContradiction? \nOne sees elements of inconsistency in the passage above regarding what can be expected of \nothers.  Within the interventions of Bill alone, other citizens are treated both as potential \nfollowers of a collective cause, and as self-interested individuals who resist organisation and who \ncan be expected to break off from such a project so as to pursue their own profit.  The two \npositions are not incompatible – naturally ‘other citizens’ may be of both such types – but the \nemphasis is clearly different in the two cases.  Likewise there is a certain incongruence in the \nErfurt discussion (though not quite a paradox) in the assumptions noted above whereby other \ncitizens are considered essentially inert yet liable to gather like sheep behind a disreputable \ncause.  This suggests one should think not in terms of a settled body of beliefs about other \ncitizens but a complex array of discursive patterns which do not necessarily amount to a coherent \nwhole.\n6\n  Negative or sceptical assumptions outweigh the positive in these discussions, but there \nis more than one logic in play. \nDrawing on existing empirical research (Gamson 1992), it may be possible to propose \nan underlying pattern here – albeit not one which necessarily restores logical unity.  Variations in \nthe kinds of assumption which prevail may depend on the degree of specificity with which the \nsituation at hand is articulated.  Where the discussion is at a quite general level, without a clearly \ndefined issue at stake and with other citizens appearing in the rather abstract and colourless guise \nof ‘people’ or ‘voters’, one might expect the scepticism to be stronger: there is no clear course of \naction to be taken, and the demands of engagement may appear higher.  Where there is a specific \nissue at stake (a new tax, for example), and where ‘we’ and ‘they’ are given sharper definition, \none might expect the more positive assumptions to come through.  The goals may appear more \nmodest and more achievable, and a stronger sense of an adversarial relationship may engender a \ngreater sense of their being ‘people like us’ with whom solidarity is possible (Gamson 1992, \n 16 \np.7).  In the extended passage above, it does seem possible to identify a stronger faith in other \ncitizens insofar as they are cast as the ‘working class’, with clearly demarcated opponents, than \nwhere they are cast in vaguer terms as ‘someone’ or ‘the rest of them’. \nAn interpretation of this kind locates the sources of ‘inconsistency’ not so much in the \nindividual mind but in the contrasting associations of different discursive formations.  When \nspeakers draw on the language of citizenship, they express a level of scepticism not necessarily \nreplicated when drawing on alternative repertoires.  While individuals may have some freedom \nto select between these – the metaphor of a ‘toolkit’ is attractive (Swidler 2001b) – they are \nnevertheless limited by the conventional usages of those they choose, and those which other \nspeakers press upon them. \nThe locations for these interviews spanned three different countries, as well as Europe’s \nformer political division between East and West.  Noticeable in the material collected is how \nrather similar discursive practices can be found dispersed across these various sites – across old \ndemocracies and new, and prosperous cities and poor.  At least on the evidence available, there \nare few grounds for localising the patterns.  That said, some of the particular associations these \nmotifs carry must surely vary across these differing contexts.  The relative novelty of democratic \nstructures in the post-communist cities (Erfurt and those in the Czech Republic) means that when \nspeakers decry the political ignorance and apathy of other citizens they may be read as \nsimultaneously suggesting those citizens have failed to adapt to changed circumstances, and \nperhaps are ‘not ready’ for democracy.  There may be the implication they retain Communist \nsympathies, or are in some way morally tarnished by the previous regime.  Criticisms may also \ncarry the sense of recent disillusionment in the wake of higher expectations, in a manner one \ncould less easily associate with participants in Britain and western Germany.  Likewise, in the \nGerman locations one must assume that references to people gathering behind a strong leader \nhave distinctive connotations of the Third Reich experience (a point supported by certain \nreferences to Hitler).  Enthusiasm for leadership of the kind expressed in the Norwich discussion \nis surely less easily produced by German speakers without conjuring such echoes of the \n 17 \ncountry’s past.  These nuances and others caution against neglecting the variety of meanings that \nmay accompany these motifs, notwithstanding the similarity of form. \n \n \nInterpreting Interpretations: a Discussion \n \nWhile these exploratory observations leave much scope for further study, when matched against \nthe existing work in this area one has the basis for some discussion of implications.  In what \nfollows, these are framed in terms of two questions: the social-science question, which asks how \nto explain the ostensible prevalence of negative assumptions about other citizens, and the \npolitical-theory question, which asks what the political significance may be. \n \nThe social-science question: four candidate explanations \nIn thinking about how to explain these discursive patterns, perhaps the default position would be \nto treat them as truth-claims and regard them as accounted for by empirical reality.  On this \nreading, the notion that other citizens are largely politically unaware, unengaged, and all too \nwilling to focus on their narrow self-interests, is prevalent because ultimately it is broadly \ncorrect: this is how people generally are, and the interviewees are accurate in their assessments.  \nLet us call this the realist interpretation.  Such a view may seem especially inviting given that \narguably it accords with the common sense amongst political scientists.  Those who understand \ndemocracy following a Schumpeterian model are likely to be sceptical of the political \ncompetence of most citizens, echoing the assumptions traceable in the discourse of taxi-drivers.  \nEven observers who accept the possibility that things could be different under different \nconditions may consider these assumptions appropriate to democracy as it currently exists.  \nHibbing and Theiss-Morse do not claim citizens lack fundamental ability, but do treat apathy \nregarding most policy-issues and a general distaste for politics as brute facts of the contemporary \nUS population (Hibbing and Theiss-Morse 2002, pp.8-9). \n 18 \nThe grounds for adopting this perspective are by no means clear though.  Even if one \naccepts the reality of a contemporary trend towards decreasing participation (Mair 2006), it is \nunclear whether it indicates widespread apathy amongst citizens: high levels of concern on \nsubstantive issues may be matched by fatalism regarding what can be achieved through \nparticipation.\n7\n  The very evidence of these interviews, in which taxi-drivers in multiple locations \ntalk expansively on a range of political topics, suggests some level of basic engagement.  \nFurthermore, the contradictory element noted above suggests one cannot simply account for \nthese discursive practices by treating them as correct descriptions of reality: even if some had a \nbasis in truth, they could not all.  There is a danger, in other words, that the scholar falls victim to \nsomething analogous to Davison’s third-person effect, positioning him\/herself as ‘I’ the keen \nobserver, speaking to ‘you’ the sensible reader, about the limitations of ‘they’ the other citizens, \nin a way the empirical evidence fails to justify. \nNeedless to say, one need not conclude such assumptions are false.  A statement so \ndefinitive would also be problematic.  If one rejects the idea that negative assumptions appear \nsimply because they are accurate descriptions of reality, there are various alternative perspectives \none might adopt while remaining open on the question of truth status.  Three can be mentioned, \nin ascending order of appeal.  The first would be an a-historical one which locates their origins in \nhuman nature.  The denigration of the political competence of other citizens might be treated as a \nstrategy for self-enhancement or group bonding, whereby individual speakers derive satisfaction \nand a basis for in-group identification by positioning themselves and those like them as more \nsophisticated and engaged than others.  ‘We’ are made to seem more public-spirited than the rest, \nand are positioned as realistic, since not too much is expected from others.  Insofar as ‘we’ are \nsometimes included within the scope of criticism, one might suspect a strategy of self-\njustification: ‘our’ inaction is normalised by projecting passivity onto ‘them’, suggesting others \nare no better and that there is little ‘we’ could achieve alone.  Interpretations such as these can be \ncalled (social-) psychological.  They do not focus on whether everyday assumptions about other \ncitizens are true or false, but do take them to have an underlying basis, namely in the speakers’ \n 19 \npsychological make-up.  While there may be an important insight here, the danger – as with all \npsychological approaches – is that one overlooks the significance of the social context in its \nhistorical specificity as an influence on individual behaviour.  One may give a universality to \nsomething grounded in a certain constellation of conditions. \nAn alternative perspective would be to link these patterns of discourse to the life \nexperiences of the speakers who articulate them, in this case taxi-drivers.  One might speculate \nthat taxi-driving, which involves serving ‘other citizens’ in return for money, and which can \nplace its proponents in a position of vulnerability, invites cynicism and scepticism towards \nothers, and encourages in-group identification at the expense of strangers.  Such a reading is \nlocal in focus, in that it sees these discursive practices as specific to the kinds of people who \narticulate them, and as performing a certain function in the circumstances of their encounter.  \nOne might term it a situational interpretation.  Its appeal lies in the refusal to treat these \ndiscursive practices as objectively or psychologically pre-determined, and in its sensitivity to the \nexperiences of the individual.  Perhaps the concern however will be that it results in putting too \nmuch emphasis on certain socio-demographic characteristics, and on the separation of those \nbearing them from the rest of society.  Moreover, such a move neglects the noted resonance with \nthe findings of other studies which did not draw specifically on taxi-drivers or those of the same \neconomic and national background.   \nA final standpoint would regard the discursive practices traced as a contingent way of \nseeing the political world, dominant due to a particular set of wider features of contemporary \nlife.  One might argue for example that media amplification of short-term trends in voting \nbehaviour and social interaction leads to notions such as ‘citizen apathy’ or the ‘me-society’ \ngaining a footing in everyday discourse, whether or not those same trends continue over time.  \nMedia actors of a certain political persuasion might want to encourage such ideas and cement \ntheir commonsense plausibility insofar as they point to a political configuration they find \nfavourable, while political parties in turn, convinced of the influence of the media and wishing to \nconform to the reality thereby produced, may start to peddle the same ideas (Meyer and \n 20 \nHinchman 2002).  A historical interpretation along these lines would thus invite one to remain \nopen not just on the question of whether such discursive practices have a basis in truth, but also \non whether they are permanent or contingent features of mass politics.  Rather than objectively \nor psychologically determined, they may be seen as a field contested by the strategic actions of \npowerful agents (Rothstein 2005), and bearing the traces of political conflicts.  This historical \nview seems a reasonable one to adopt, since it avoids a determinist perspective and makes space \nfor a critical stance.  If one rejects the idea that the prevalence of these practices is inevitable \nunder current conditions, one can then ask critically what their implications may be, and whether \nthere are reasons why one might want to see them challenged.   \n \nThe political-theory question: three evaluations of significance \nThis second question then focuses not so much on how to explain these views, but how to \nevaluate the significance of their being voiced.  To a large extent, this is a question of how \ndiscursive practice relates to other forms of practice whose value one appraises against the \nbackdrop of a preferred model of politics.  What, for example, may the willingness to express \nsuch assumptions imply for voting behaviour or the (non-)formation of collective movements?  \nWill such forms of political participation be adversely affected?  While strong causal \nconnections between talk and action are rarely possible, it seems plausible to suppose an \nenabling significance: that is, that routinised ways of making sense of the world make certain \nkinds of behaviour more likely than others.  Examining how various political-theoretical \ntraditions might assess the empirical phenomena noted above, it should be possible to highlight \nthese implications. \nOne way to divide contemporary theories of democracy is into three broad families, \naggregative, deliberative, and agonistic approaches, with their principal differences as follows \n(Mouffe 2000): \n \n \n 21 \n Preference Aggregation Deliberative Dem. Agonism \n \nInterpretation of \npopular \nsovereignty \/ \ncollective self-rule \n \n \nAbility to hold rulers \naccountable in periodic \nelections \n \nAchievement of a rational \nconsensus on the common \ngood \n \nPursuit of collective ends \nin a process of agonistic \nstruggle \n \nKey political \nactivity of lay \ncitizens \n \n \nVoting in competitive \nelections \n \nContributing to the \ndeliberative process, so as to \nreach decisions all can \nreasonably accept \n \nMovement formation and \n\/ or participation  \n \nWhat holds the \npolitical \ncommunity \ntogether \n \n \nInterests, and maybe \nsome form of \noverarching ‘identity’ \n \nValues (universal or \nparticular), some form of \n‘love of justice’ \n \nCommon action in \npursuit of political goals \n \nThese three perspectives imply somewhat different evaluations of the assumptions \nsketched above.  Perhaps the perspective likely to be least disturbed by them is the first, the \npreference-aggregative approach.  This perspective overlaps significantly with the realist one \nmentioned above, relegating the political role of the average citizen mainly to participation in \nelections.  So long as citizens have a basic degree of confidence in their representatives’ ability \nto promote their interests, and the willingness occasionally to cast judgement, their regard for \nother citizens is not greatly important.  Discursive practices of the kind noted are likely to be \ntreated as further reminder of the implausibility of alternative models which envisage a greater \ndegree of individual participation or forms of collective action.  A normative evaluation of this \nkind seems implicit in the way Hibbing and Theiss-Morse interpret their findings: while they see \na need to foster the appreciation that citizens may reasonably disagree on matters of political \nrelevance, they see little need to convince citizens of the engagement of others, nor raise overall \nlevels of engagement and participation.  On the contrary, people’s aversion to giving ‘power to \nthe people’ represents a wish that should be respected (Hibbing and Theiss-Morse 2002, p.4). \nSome interpreters might go further and argue that negative assumptions about the \npolitics of other citizens are a good thing: conceivably they could encourage voting in greater \nnumbers, since to rational, interest-maximising individuals (the existence of whom many such \nmodels assume), the appeal of voting should increase in line with their scepticism about other \n 22 \npeople’s level of engagement.  Insofar as they assume other citizens to be reluctant voters, the \nweight of their own vote is all the higher, while insofar as they consider other citizens \nsusceptible to bad ideas, the need for ‘right-thinking’ citizens to minimise the electoral \nconsequences is higher too.  Even from this perspective however, one would not be entirely \nsanguine: as suggested above, there is the troubling possibility this might invite longing for the \nstrong leader who can overcome the deficiencies of other citizens and ‘get the job done’ despite \nthem.  Encouraged to an authoritarian tendency, there is the danger citizens might break out of \nthe rather limited role this type of political theory reserves for them.   \nFor those advocating a deliberative model of politics (Habermas 1996), the problematic \naspect of such discursive practices is likely to be unequivocal.  The exercise of public reason \nrequires that political debate be entered into on a fair and equal basis, and while deliberative \ndemocrats have been accused of an elitist tendency (Sanders 1997), many nonetheless retain an \nemphasis on popular participation as a means to achieve optimal deliberation.  However, if \nnegative assumptions about the political capacities of other citizens are prevalent, the fear would \nbe this leads to calls for their exclusion from the deliberative process.  Its fair and equal basis \nwould break down.  Alternatively, the quality of debate might suffer not through the exclusion of \nvoices but through the adaptation of interventions to suit what is expected of others.  Opinions \nmight come to be silenced not because individual citizens wish to suppress them, but because \nthey consider them the kinds of opinion others will disapprove of or be unwilling to support.  \nOne might see spirals of silence (Noelle-Neumann 1984), or ‘spirals of noise’ whereby ideas \ngain ground because of their supposed attraction to others, phenomena of particular concern for \nthose interested in the rationality of political debate.   \nThose taking an agonistic perspective on democracy are also likely to be troubled \nshould such assumptions be widespread (Mouffe 2000).  The very essence of political life in this \nperspective consists in collective action on matters of common concern; it is ultimately this, \nrather than some notion of interlocking interests, identity, or love of justice, which is seen to hold \nthe political unit together, and only by mobilising citizens can progressive causes be advanced.  \n 23 \nIf the presence of negative assumptions about the political capacities of other citizens makes the \ninitiation of collective action more difficult, this can only have a corrosive impact on the health \nof the political community.  Scepticism towards other citizens is likely to be regarded as more \ndamaging even than disaffection with elite representatives, since it may prevent criticism of the \nstatus quo being accompanied by the call for actors outside professional politics to remake the \npolitical scene.\n8\n  The challenge would then be to awaken a greater sense of the feasibility of \ncollective agency in the face of scepticism about the willingness of others to take action.   \n \n \nConclusion \n \nThese reflections underscore how a pattern of scepticism concerning the politics of other citizens \nis problematic, albeit to a varied degree, from the perspective of each of several models of \ncitizenship.  The remedies one might foresee clearly vary between these perspectives, but a \ncommon basis for concern appears evident.  By describing other citizens as they do, speakers set \nthe parameters of their own citizenship practices, and risk acquiring some of the very \ndispositions they project onto others.  They risk becoming ‘other citizens’ themselves, as it were.  \nYet while the language of citizenship is spoken in pessimistic tones, equally it seems too quick to \nsuppose a preference for ‘stealth democracy’, for any appearance of the notion that other \nmembers of the community could be galvanised by an initiative suggests a more active \nconception of citizenship remains possible also.  Whether this possibility is taken up to serve \nends consistent with liberal democracy, or is used to mobilise for authoritarian causes, remains \nopen.   \nA question that might be considered further concerns how different patterns of \nassumption come to the fore in different discursive contexts, and what the significance may be of \nthe specificity with which political problems, situations and actors are defined.  For one \npossibility is that the negativity is strongest where fellow citizens appear in their most abstract \n 24 \nguise, ‘others’ linked to the subject through no more than common membership in the political \ncommunity.  If this is so, it may be that richer conceptions of citizenship will need to be sought \nin the instances where others are cast encumbered with shared concerns and substantive goals.  \nSome grounds for the idea were noted in this study.  More clearly delineated forms of \nsubjecthood, coupled with the articulation of common challenges, perhaps provide some of the \nresources that can be deployed by those seeking to breathe life back into the politics of other \ncitizens. \n \n                                                 \n1\n [ACKNOWLEDGEMENTS] \n2\n The focus may also be distinguished from the study of trust in political leaders and confidence in political \ninstitutions, matters extensively studied in the literature on political cynicism and distrust: e.g. (Dalton 2004). \n3\n The interviews were loosely structured, with approximately the first twenty minutes of each discussion devoted to \nan exercise based on thematic index cards.  This was followed by an open discussion led principally by the \nparticipants themselves and focused on the political issues they considered to be most urgent.  The material below is \ndrawn from these open sections of the discussions.  For further details, see (Author 2009a) and (Author 2009b), \nwhere some of the main findings of the project are discussed, notably to do with patterns of problem definition, \ncomparison, and perceptions of political agency. \n4\n In Britain and Germany the rates were €60-70 per head; in the Czech Republic c. €40.  These rates were above \nwaiting-time, and intended to represent a good return on two hours’ work for most drivers; however, they were not \nso high that a driver might not, in principle, have made the same amount in the same time from fare-paying \ncustomers.  Each discussion was facilitated by the author in the local language and recorded using audio \nmicrophone. \n5\n This is a slogan which the newspaper has used in advertising campaigns. \n6\n The arguments for emphasising discursive rather than mental phenomena laid out in (Potter and Wetherell 1987) are of \nparticular relevance here. \n7\n Importantly, Hibbing and Theiss-Morse make a twofold distinction between ‘process preferences’ and ‘policy \npreferences’, and stress the importance of the former at the expense of the latter.  It may be necessary, however, to \ndistinguish within the second category between people’s depth of concern about what particular policies are adopted \n(on which indifference may be expressed) and their depth of concern about the substantive problem itself which \nneeds to be addressed (on which stronger views may be voiced). \n8\n Arguably democracy requires that those disaffected with ‘the system’ still retain the hope that actors can emerge \nfrom civil society able to change it.  The significance of such views seems to be underplayed by scholars of political \ncynicism and disaffection who focus purely on attitudes towards elite actors: cf. (Dalton 2004), who looks at ‘public \nconfidence and trust in, and support for, politicians, political parties, and political institutions’ (p.191). \n \n \n \n \nReferences \nAuthor (2009a, forthcoming), ‘Thematisation and Collective Positioning in Everyday Political Talk’, British Journal \nof Political Science. \nAuthor (2009b, forthcoming), ‘Europe in the Political Imagination’, Journal of Common Market Studies. \nDalton, Russell J. (2004), Democratic Challenges, Democratic Choices: the Erosion of Political Support in \nAdvanced Industrial Democracies (Oxford: OUP). \nDavison, W. Phillips (1983), 'The Third-Person Effect in Communication', Public Opinion Quarterly, 47 (1). \nGambetta, Diego (1988) (ed.), Trust: Making and Braking Cooperative Relations (Oxford: Blackwell). \nGamson, William (1992), Talking Politics (Cambridge: CUP).  \n 25 \n                                                                                                                                                          \nHabermas, Jürgen (1996), Between Facts and Norms: Contributions to a Discourse Theory of Law and Democracy \n(Cambridge Mass.: MIT Press). \nHardin, Russell (2006), Trust (Cambridge: Polity). \nHibbing, John R. and Theiss-Morse, Elizabeth (2002), Stealth Democracy: Americans’ Beliefs about how \nGovernment Should Work (Cambridge: CUP). \nMair, Peter (2006), 'Ruling the Void? The Hollowing of Western Democracy', New Left Review, 42 (Nov\/Dec). \nMeyer, Thomas and Hinchman, Lew (2002), Media Democracy: How the Media Colonise Politics (Cambridge: \nCUP). \nMorgan, David L. (1997), Focus Groups as Qualitative Research (Qualitative Research Methods Series 16; London: \nSage). \nMouffe, Chantal (2000), Deliberative Democracy or Agonistic Pluralism (Vienna: Institut für Höhere Studien). \nNoelle-Neumann, Elizabeth (1984), The Spiral of Silence: Public Opinion - Our Social Skin (Chicago: UCP). \nOffe, Claus (1999), 'How can we Trust our Fellow Citizens?' in Mark E. Warren (ed.), Democracy and Trust \n(Cambridge: CUP).  \nPotter, Jonathan and Wetherell, Margaret (1987), Discourse and Social Psychology: Beyond Attitudes and \nBehaviour (London: Sage). \nPutnam, Robert (2000) Bowling Alone: The Collapse and Revival of American Community (New York: Simon and \nSchuster).  \nRothstein, Bo (2005), Social Traps and the Problem of Trust (Cambridge; CUP). \nSanders, Lynn (1999), 'Democratic Politics and Survey Research', Philosophy of the Social Sciences, 29 (2). \n——— (1997), 'Against Deliberation', Political Theory, 25 (3). \nSchatzki, Theodore R., Knorr Cetina, Karin, and Von Savigny, Eike (2001), The Practice Turn in Contemporary \nTheory (London: Routledge). \nStolle, D. and Hooghe, M. (2004) 'Review Article: Inaccurate, Exceptional, One-Sided or Irrelevant? The Debate \nabout the Alleged Decline of Social Capital and Civic Engagement in Western Societies', British Journal of \nPolitical Science, 35. \nSwidler, Ann (2001), 'What Anchors Cultural Practices', in Theodore R. Schatzki, Karin Knorr Cetina, and Eike von \nSavigny (eds.), The Practice Turn in Contemporary Theory (London: Routledge). \n——— (2001b), Talk of Love. How Culture Matters (Chicago: U. of Chicago Press).  \n"}