{"doi":"10.1016\/j.jairtraman.2006.10.006","coreId":"140402","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5765","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5765","10.1016\/j.jairtraman.2006.10.006"],"title":"Airframe manufacturers: Which has the better view of the future?","authors":["Mason, Keith J."],"enrichments":{"references":[{"id":37936985,"title":"A Study on the Future of Air Transport in the European Union”,","authors":[],"date":"2005","doi":null,"raw":"EU, (2005), “A Study on the Future of Air Transport in the European Union”, DG TREN, by Department of Air Transport, Cranfield University, June.","cites":null},{"id":37936989,"title":"Competitive Strategy: Techniques for Analyzing Industries and Competitors”,","authors":[],"date":"1980","doi":null,"raw":"Porter, M. E. (1980), “Competitive Strategy: Techniques for Analyzing Industries and Competitors”, Free Press, New York.","cites":null},{"id":37936986,"title":"Demand for leisure air travel and limits to growth”,","authors":[],"date":"2000","doi":"10.1016\/s0969-6997(99)00031-9","raw":"Graham, A., (2000), “Demand for leisure air travel and limits to growth”, Journal of Air Transport Management, Vol. 6., pp.109-118.","cites":null},{"id":37936987,"title":"Have the major forces driving leisure airline traffic changed?”,","authors":[],"date":"2006","doi":"10.1016\/j.jairtraman.2005.09.002","raw":"Graham, A., (2006), “Have the major forces driving leisure airline traffic changed?”, Journal of Air Transport Management, Vo. 12., pp. 14-20.","cites":null},{"id":37936988,"title":"Marketing Management: Analysis, Planning, Implementation, and Control”, 6 th edit.,","authors":[],"date":"1988","doi":null,"raw":"Kotler, P., (1988), “Marketing Management: Analysis, Planning, Implementation, and Control”, 6 th edit., Prentice Hall, New Jersey, Mason,  K.  J.,  (2005),  “Observations  of  fundamental  changes  in  the  demand  for aviation services”, Journal of Air Transport Management, Vol. 11, pp. 19-25.","cites":null},{"id":37936990,"title":"Misunderstandings about Airline Growth”,","authors":[],"date":"2006","doi":"10.1016\/j.jairtraman.2006.10.009","raw":"Swan,  W.,  (2006),  “Misunderstandings  about  Airline  Growth”,  Proceedings  of Hamburg Forecasting Conference, 2006 Tarry, C., (2006), “Behind the order book”, Airline Business, February.","cites":null},{"id":37936981,"title":"Private jet business is growing fast, Air and Business Travel News, th Sept2006 Airbus,","authors":[],"date":"2006","doi":null,"raw":"ABTN, (2006), Private jet business is growing fast, Air and Business Travel News, th Sept2006 Airbus, (2004), “Global Market Forecast”, Airbus Industrie Alamdari, F., (1997), “ Market share models”, paper to IATA Air Transport Outlook Conference, Lisbon 7 September ATI,  (2006),  “Airbus  out  performs  Boeing  with  orders  for  1,055  aircraft”,  Air Transport Intelligence, www.rati.com, 17\/1\/06 BA (2001), “Fact Book, 2001”, British Airways.   11 BBC, (2005), “Market challenges facing Airbus’ giant”, news.bbc.co.uk, BBC News, 25\/4\/05 Boeing, (2005), “Current Market Outlook”, Boeing Commercial Airplanes.","cites":null},{"id":37936983,"title":"White Paper on the adoption and barriers to adoption of Self Booking Tools”, Business Travel Research Centre, www.businesstravelresearch.com,","authors":[],"date":"2006","doi":null,"raw":"BTRC (2006), “White Paper on the adoption and barriers to adoption of Self Booking Tools”,  Business  Travel  Research  Centre,    www.businesstravelresearch.com, Cranfield University, forthcoming.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-01-31T00:00:00Z","abstract":"For the development of Airbus' A380 and Boeing's B787 it seems that these\nmanufacturers have differing views of future airline networks. This paper\nassesses from published sources the likely preferences of leisure and business\npassengers for different airline network approaches and also assesses airline\nstrategies through the economic cycle. The manufacturers seem to have\nsubstitutable aircraft types. Both leisure and business travellers are\nincreasingly price elastic and growth in both markets means both aircraft type\nwill be successful aircraft meeting differing needs. However, airline market-\nshare strategies are likely to undermine the success of hub by-pass or hub-to-\nhub focus strategies throughout the cycle. (C) 2006 Elsevier Ltd. All rights\nreserved","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140402.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.jairtraman.2006.10.006","pdfHashValue":"a90d5158d58ff3a659ff196e289247248b507309","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5765<\/identifier><datestamp>2011-08-11T13:30:06Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Airframe manufacturers: Which has the better view of the future?<\/dc:title><dc:creator>Mason, Keith J.<\/dc:creator><dc:subject>airframe manufacturers Boeing Airbus hub and spoke hub by-pass<\/dc:subject><dc:description>For the development of Airbus' A380 and Boeing's B787 it seems that these\nmanufacturers have differing views of future airline networks. This paper\nassesses from published sources the likely preferences of leisure and business\npassengers for different airline network approaches and also assesses airline\nstrategies through the economic cycle. The manufacturers seem to have\nsubstitutable aircraft types. Both leisure and business travellers are\nincreasingly price elastic and growth in both markets means both aircraft type\nwill be successful aircraft meeting differing needs. However, airline market-\nshare strategies are likely to undermine the success of hub by-pass or hub-to-\nhub focus strategies throughout the cycle. (C) 2006 Elsevier Ltd. All rights\nreserved.<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-08-10T23:03:23Z<\/dc:date><dc:date>2011-08-10T23:03:23Z<\/dc:date><dc:date>2007-01-31T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Keith J. Mason, Airframe manufacturers: Which has the better view of the future?, Journal of Air Transport Management, Volume 13, Issue 1, January 2007, Pages 9-15.<\/dc:identifier><dc:identifier>0969-6997<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.jairtraman.2006.10.006<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5765<\/dc:identifier><dc:language>en_UK<\/dc:language><dc:rights>NOTICE: this is the author’s version of a work that was accepted for publication in Journal of Air Transport Management. Changes resulting from the publishing process, such as peer review, editing, corrections, structural formatting, and other quality control mechanisms may not be reflected in this document. Changes may have been made to this work since it was submitted for publication. A definitive version was subsequently published in Journal of Air Transport Management, VOL 13, ISSUE 1, (2007) DOI:doi:10.1016\/j.jairtraman.2006.10.006<\/dc:rights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0969-6997","issn:0969-6997"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["airframe manufacturers Boeing Airbus hub and spoke hub by-pass"],"subject":["Article"],"fullText":" 1 \nAirframe manufacturers: Which has the better view of the future? – A note on \nairline customers and airline strategy.  \n \nK. J. Mason \n \nAbstract \n \nThe development of Airbus’ A380 and Boeing’s B787 seems to these manufacturers \nhave differing views of future airline networks.  This assesses from published sources \nthe likely preferences of leisure and business passengers for different airline network \napproaches and also assesses airline strategies through the economic cycle.   The \nmanufacturers seem to have substitutable aircraft types.  Both leisure and business \ntravellers are increasingly price elastic and growth in both markets means both \naircraft type will be successful aircraft meeting differing needs.  However, airline \nmarket share strategies are likely to undermine the success of hub by-pass or hub-to-\nhub focus strategies throughout the cycle.   \n \n \n \nKeywords: Airline strategy and fleet planning, economic cycle, Leisure travellers, \nbusiness travellers.  \n \nIntroduction \n \n2005 was the first year when over 2,000 new aircraft were ordered by airlines, clearly \noptimistic of a future where growth and new opportunities would enable them to \nprofitably employ such large volumes of new planes. The previous order peak in was \nin 2000 when nearly 1,600 aircraft were ordered.  This was quickly followed by an \neconomic downturn greatly exacerbated by the 9\/11 terrorist attacks, excess capacity, \nand four years of significant losses across the airline industry.  The magnitude of the \n2005 order book represents both demand suppressed during the downturn and a return \nin confidence in the industry.   \n \nDuring the poor years of the early 2000s the two main aircraft manufacturers (Boeing \nand Airbus) have positioned themselves to serve rather different visions of the future \nas somewhat simplistically described in the press (e.g. BBC, 2005): the new 550 seat \nAirbus A380 demonstrates Airbus’ view of a future where congested hub airport \ncapacity may be overcome by carrying passengers between these congested \ncontinental hubs in large capacity aircraft.  Boeing’s vision of the air transport \nindustry in the future is evidenced by the development of a much smaller capacity \n210-290\n1\n long-range aircraft - the B787.  In this vision congested hubs are by-passed \nby travellers flying direct (or with fewer stops\/connections) from their point of origin \nto their final destination.   \n \nFaced with these differing views of the future a panel session at the 9\nth\n Hamburg \nAviation Conference sort to discuss the following questions: \n \n Are Airbus and Boeing pursuing complementary or substitute strategies? \n                                                 \n1\n The B787-3 is a larger capacity (up to 330 seats) shorter-range variant.  \n 2 \n Does choice of aircraft matter less or more when markets are growing? \n Given how and which markets are growing, which combination of aircraft will \nbe winners or fair better than others? \n \n \nBoeing and Airbus’ strategies – complementary or substitutes? \n \nAs one would expect when multi-billion dollar decisions have been adopted by the \nworld’s two largest airframe manufacturers, arguments can be made for logic of both \nstrategies.   \n \nIf the growth rates in air travel over the past 20 years extend into the future, the main \ncontinental hub airports, many of which are already congested, are unlikely to be able \nto sustain the level of growth without some way of increasing passenger throughput \nper aircraft movement.  Both Boeing and Airbus have similar forecasts of the future \nmarket.  Boeing forecast annual passenger growth of 4.8% and Airbus at 5.3% per \nannum from 2005 till 2024 with the worldwide fleet more than doubling with about \n17,000 (Boeing, 2005, Airbus 2004).  The A380, by increasing capacity on wide-body \naircraft by some 20% over the 747, enables operating airlines to increase passenger \nnumbers in city-pair markets where airport congestion or slot restrictions have \ncurtailed growth while enjoying a reduction in seat costs.  The future success of \nnetwork carriers’ strategy of consolidating passenger flows through principal hub \nairports will require such operators to increase the flow from one continental main \nhub to another and thus the A380 seems well suited to meeting the needs of such \noperators.  Indeed its competitor Boeing’s success over the past 30 years has been \nbased, in no small part, on its sales of the B747.  Until the development of the A380, \nwithout a competitor in the 400+ seat market, Boeing has been able to dominate the \nmarket for large inter-hub aircraft.  While its research suggests that aircraft operating \nat hub airports have, in fact, been getting smaller by seat count (Swan, 2005) and its \nprincipal developmental efforts have been focused on the hub-bypassing B787, \nBoeing announced in November 2005 that it would once-again stretch its B747\n2\n so as \nnot to cede totally the very large aircraft market to Airbus.   \n \nWhile Airbus has been developing the mass passenger transit A380, Boeing \nannounced the development of a near-supersonic cruiser that was aimed at capturing \nmoney-rich, time-poor business passengers.  However in the post 9\/11 environment \nthe manufacturer did not find sufficient takers for this concept and replaced it with the \nB787; an aircraft aimed at reducing operating and seat costs by using new \ntechnologies, materials and engines.  The manufacturer set the capacity for the new \naircraft based on the success British Airways and others had found by switching from \nB747s into the lower capacity aircraft 777.  BA discovered on their North Atlantic \nroutes that when they switched gauge to the 777, traffic that it had previously carried \non a marginal revenue basis (but was essentially not profitable) could not now be \naccommodated and thus, although the airline carried fewer passengers that its \nprofitability improved (BA, 2001).  Rather than competing head-on with Airbus on a \nnew super-jumbo, Boeing’s view was that by placing this low seat-cost aircraft on \n                                                 \n2\n The B747-8 “Intercontinental” will carry up to 500 passengers and by using some of \nthe new technologies developed for the 787, Boeing is promising lower seat costs \nthan the A380.  To date, only the freighter version has secured orders. \n 3 \nthinner routes that by-passed at least one continental hub an operator could capture \nhigher yielding passengers seeking a more direct routing.  Airbus, seeing the quick \nuptake of the B787 (see later), has also sought to cover this area of the market and \nannounced in 2005 the development of the A350, an evolution of the A330, placing it \nin direct competition with the B787\n3\n.  \n \nThe development of the A350 and the B747-8 “Intercontinental” demonstrates that \nneither manufacturer is prepared to unilaterally cede any part of the widebody market \nto its competitor.  Whichever view of the airline market place of the future is more \nlikely, be it dominated by network carriers that funnel large consignments of their \ntraffic through major hubs with very large aircraft, or one in which carriers focus on \nthinner but higher yielding routes using smaller sized widebodies, or some \ncombination of these strategies, both manufacturers are positioning themselves to able \nto cater for the needs of the successful airlines under both scenarios.  It would seem \ntherefore that essentially both manufacturers are pursuing substitute strategies.  It is, \ntherefore, necessary to assess the airlines’ strategies. \n \n \nThe 2005 aircraft order book \n \nWhen committing an airline to the cost of new aircraft with a useful life of some 25 \nyears it would seem logical that the responsible airline executives would make their \ndecisions considering both market growth and recession.   \n \nDuring 2005 Airbus and Boeing took the following orders:- \n \nTable 1: 2005 Airframe orders, Airbus and Boeing \nAirbus Boeing \n918 x A320 family 569 x B737 \n166 x A330\/340\/350 15 x B767 \n154 x B777 \n235 x B787 \n 43 x B747 \n20 x A380  \nSource: ATI, 2006 \n \nWhile much of journalistic discussion has focused on new aircraft types, 70% of the \norders in 2005 were for narrow-body aircraft as the low cost carrier phenomenon \nspread throughout Europe and spread further a field.  Some analysts have suggested \nthe size of the 2005 order book is in no small part due to carriers attempting to secure \ndelivery slots and for the 150-seat size aircraft the orders may represent a large part of \nthe total requirement of the market for the next few years (Tarry, 2006). \n  \nBoeing’s launch of the B787 has been its most successful and the aircraft seems \ncertain to have a significant impact on the structure of airline fleets for many years to \ncome. This is also likely to be the case for the operators that select the A380 and the \ncarriers that compete with them.  To date Airbus has secured 159 orders (September \n                                                 \n3\n Although in June 2006 it was subsequently announced that the A350 would have a \nwider body and larger seating capacity than originally announced. \n 4 \n2006) for the A380. The manufacturer only sees a total market for this size of aircraft \nas only 1,648 until 2023 (Airbus, 2004).  The orders that have been received for the \nA380 have come from two principal regions.  The Middle East and Asia.  Emirates \nhas made the single largest order taking 43 of 49 so far ordered by middle eastern \ncarriers. This airline’s strategy is to make Dubai a one-stop transit point connecting \nmany of the largest markets in the world.  The airport has no congestion issues and \nthe airline sees the aircraft as the best way of achieving very low cost seat costs in \nvery large city-pair markets where it is likely to be mainly a combination 3\nrd\n\/4\nth\n \nfreedom carrier requiring it to offer discounted seats to capture traffic.  The majority \nof the rest of the orders have come from carriers that have their principal long haul \noperations between Europe to Australasia (e.g. Singapore, Qantas, Malaysian) and \nwill look to capture more traffic by increasing capacity by adopting this new aircraft. \n \nTo consider the second question regarding aircraft choice through the cycle the \ndemand side of the industry will first be considered, looking at leisure and business \ntravellers separately.  This will be followed by considering airline strategies through \nthe cycle. \n \n \n \nLeisure travellers in the economic cycle \n \nThroughout the economic cycle leisure travellers will tend to be more price elastic \nthan business travellers.   \n \nDuring good economic times people will tend to earn more money and therefore will \nalso have higher disposable incomes.  Recently the world economy has enjoyed a \nperiod of sustained low interest rates and generally good economic growth.  These \nlow interests rates mean that people tend to have higher disposable incomes as interest \npayments on borrowings, particularly mortgages, are low.  Not only do low interest \nrates increase people’s disposable income, they also reduce the incentive to save \nmoney and therefore recent years have seen a number of large countries, particularly \nin North America and Europe develop into high consumption economies. For the \nairline industry people’s increased propensity to spend combined with the \ndevelopment of low cost airlines has meant a rapid growth in leisure travel. Travellers \nhave increased the number of leisure trips they make each year as they have embraced \nthe low cost carriers.  For example in the UK short haul leisure travel rose at nearly \n15% per annum between 1998 and 2003 shifting the proportion of leisure trips from \n50% to 68% of all trips during the five year period (Mason, 2005).  This growing \nleisure market has led fledgling and recently established airlines to make significant \norders for B737s and A320s.  Recent years have also seen a growing monied middle \nclasses in high growth markets such as China, India and Russia and this has led to \nhigh growth from modest levels in leisure travel.   \n \nWhile the leisure market has seen sustained growth due to good economic conditions, \nand the development of low fare airlines in many markets, leisure travel by air is also \na substitute for many other ways people can spend their disposable income.  In short \nhaul markets surface modes, particularly the car and high-speed rail compete with air \nfor passengers.  Low cost carriers have captured market share away from these modes \nin recent years due to very low fares, however, should relative prices go up due to \n 5 \nreduced competition, or perhaps new environmental taxes air could lose traffic back \nto these other modes.  Leisure time is limited the amount of free time people have to \ntake holidays cannot be increased thus placing a barrier on the growth of leisure \ntravel.   As low cost carriers in Europe have grown there is evidence that shows \nleisure travellers are taking more frequent, shorter-duration holidays (Graham, 2006). \nHowever, the increase in multiple holidays is limited by the number of annual days \nholiday people can take.  Leisure travel also competes with other ways of spending \ndisposable income.  In recent years home computers, iPods, hi-fi systems and high \ndefinition flat screen televisions have all grown in popularity and vie for leisure \ntravellers’ disposable consumption (Graham, 2000).   \n \nDuring periods of economic downturn lower disposable income, lower consumer \nconfidence, higher job insecurity, and higher precautionary savings are likely to \ndampen the demand for leisure travel.  \n \nFor airlines, economic downturns means lower yields and lower demand.  For the low \ncost carrier segment in Europe, following a period of intense development and start-\nups any economic downturn will increase the rate of consolidation as weaker carriers \nfail or are acquired.  This may also lead to cancellations of aircraft orders and a lower \nuptake of options.  Ryanair and easyJet both benefited from poor post-9\/11 economic \nconditions to drive very good deals for large aircraft orders with Boeing and Airbus \nrespectively. It is likely that if these two players survive in the medium term, which is \nexpected, that they will await another period of harsh economic conditions before \nthey place any new orders.   \n \nIn longer haul markets leisure travellers will seek the best prices thereby pushing \ndown yields for all airlines operating in the market.   The three main airline alliances; \nStar, oneworld, and SkyTeam all compete strongly in markets where intermediate \nstops are necessary.  For example a customer travelling from New York to Singapore \ncan use the Star Alliance transiting over Frankfurt, oneworld transiting over Heathrow \nor SkyTeam transiting over Paris.  With similar elapsed journey times and similar on \nboard products the airline alliances will compete on price for this customer pushing \nthe airlines toward discounting.  The presence of 6\nth\n freedom and 3\nrd\n and 4\nth\n freedom \ncombination operators that are also found in many markets further depress fares in a \nbid to win consumers.  In such depressed market, airlines will have to encourage \ncustomers to spend their more limited disposable income on leisure travel rather than \nsave their money, or switch to cheaper surface modes of transport (especially the car).  \nThis will mean that the principal airlines operation in each market will have to fight \nhard to achieve a profitable operation. \n \n \nBusiness travellers in the economic cycle \n \nChanges in world Revenue Tonnes Kilometres (RTKs) tend to move in a reasonably \ndirect relationship to changes in global Gross Domestic Product (GDP).  As business \npeople and entrepreneurs seek new opportunities and make new deals with partners \nand clients in remote locations they travel to have meetings, sign contracts and \nimplement business plans.  As new economic activity is created airlines benefit from \ngreater levels of business travel.  Conversely, as economies move toward recession, \nbusiness confidence is reduced, fewer economic opportunities are available, and thus \n 6 \nbusiness people and entrepreneurs travel less, and their companies seek to reduce the \ncosts associated with conducting business and employ alternative methods of \ncommunication.   \n \nDuring good economic conditions it is expected that business travellers would tend to \nbe price inelastic and demand increased service on the ground and in the air, however \nduring the recent sound economic conditions the market has not behaved in this \nfashion.  During the post 9\/11 economic downturn there was an increased degree of \nprice elasticity that became apparent in the market.  The growth of greater \ncompetition in the form of alliance groupings for long haul and low cost carriers in \nshort haul markets seems to have introduced a profound change in the elasticity of the \nmarket.  There seems to be a diminishing proportion of business class and first class \npassengers (Mason, 2005), and the business travel market seems to be separating into \ntwo groups. For the majority of business travellers travel in first or business class \ncabins has become rare.  In the post-9\/11 days the least price sensitive most time \nsensitive passengers started making greater use of executive jet services where they \ncould avoid long security delays and fly more directly. Following recent terrorist \nthreats in the UK on US bound aircraft, the US National Business Aviation \nAssociation has seen rapid rise in demand from its current $2.6bn level. The \nassociation forecasts a doubling of private jets to a fleet of more 5,000 by 2011 \n(ABTN, 2006).  However, this group of price insensitive travellers seems to be \nreasonably small.  A Delphi study conducted for the European Union suggested that \nnetwork carriers would only lose a small (if financially significant) number of \npassengers to the executive jet market (EU, 2005).  For short haul travel only the \nproportion of business travellers that use business class has fallen to 15% from about \n60% in the late 1990s. For long haul travel the proportion has fallen to around 40% \n(BA SOURCE).   In short haul markets business travellers have become more price \nsensitive as low cost carriers have become commonplace.  This is partially due to the \ncompanies that employ business travellers which for many years have defined when a \ntraveller can use business class or first class services but have become have made \nthese definitions more strict and more effective in controlling travellers and enforcing \ntravel policy.  For the proportion of travellers that are allowed to use business class, \nlower cost alternatives direct services seem to becoming attractive.  EOS and MAXjet \nboth offer business-only services from an secondary London airport (Stansted) to \nNew York and seem to have established themselves successfully in this highly \ncompetitive market.  Lufthansa’s PrivatAir business-only service also to New York \nhas also successfully operated for two years. The development and growth of direct \nbusiness-only services that bypass hubs are likely to have a detrimental impact on the \neconomics of hub-to-hub business class services. These direct services are likely to \ndraw passengers away from the mainline operators and also provide downward \npressure on business class prices for the network operators.  As the A380 enters \nservice some operators have indicated a upgraded services for business-class and first-\nclass passengers, it would seem unlikely that these services be sufficient to retain \nbusiness travellers if lower fare, direct business-only service alternatives are \navailable. \n \nWhile airlines struggle to retain the proportion of the business travel market that still \nuse business class, they also must address the larger part of the business travel market.  \nThe part of the market that have become serial down-graders; those business \ntravellers that primarily travel in either premium economy, or economy class cabins, \n 7 \nor frequently use low cost airline services.   While this group of price conscious \nbusiness travellers tended to be those that worked for small and medium enterprises, \nmore people that work for large companies have moved into this segment of the \nmarket as companies get better at enforcing travel policies aimed at reducing travel \nexpenditure.  Indeed a survey of more than 350 travel managers found that 23% of \ncompanies mandated that travellers travel at the “lowest available cost” and for a \nfurther 52% of companies it this was “stated company preference”4 (BTRC, 2006).   \n \nIn a bid to arrest some of the revenue decline with business travellers downgrading \nwhile presenting themselves as offering “value for money” products, some network \ncarriers are beginning to unbundle their product elements.  Airlines such as Air \nCanada and British Airways have started offering travellers the ability to mix and \nmatch the class of service and level of ticket flexibility they purchase on out-bound \nand in-bound sectors.  On out-bound sectors business travellers are less likely to need \nto change their flight arrangements if client\/sales meeting are fixed, but travellers may \nneed to travel in business class comfort to ensure they are well rested before meeting \nclients\/customers.  On in-bound sectors these same travellers may need a flexible \nticket as meetings may overrun, however the company they work for are less \nconcerned their employees arriving well rested.  Therefore the airlines have begun to \noffer travellers the ability to combine a non-flexible, business class out-bound ticket \nwith a flexible, economy class in-bound ticket.  This unbundling trend begun as low \ncost carriers introduced the concept of passengers only paying for those services that \nthey wish to use and is now likely to be more widely adopted by network carriers. \n \nIn larger companies the past few years has seen greater management control in the \nbusiness travel purchase decision.  The more widespread use of self booking tools that \nincorporate all the companies travel policy that forces policy compliance will mean \nthis trend will continue.  This is likely to lead companies to make travel purchase \ndecisions on a return on investment (ROI) basis.  This may well lead to increased \nsubstitution of less essential travel by other forms of communication, and real time \nappraisal of the likely value that a particular trip will bring to the company.  As \nCorporate Social Responsibility increases in importance to companies many might \nbegin to make purchase decisions that incorporate the environmental costs of the trip. \n \n \nAirline strategies through the economic cycle. \n \nTo examine the aircraft choice for airlines the adopted strategies need to be assessed.  \nWhile standard management tools are rarely particularly useful in the aviation \nbusiness, application of Porter’s generic strategies of diversification and cost \nleadership (Porter, 1980) can both be seen in the industry.  By focusing on meeting \nthe needs of higher yield passengers and developing brand messages that create a \nbelief of a premium service some carriers can be viewed as having adopted the first \nstrategy (e.g. Singapore, Virgin, British Airways, etc.).  In recent years low cost \ncarriers have attempted to follow a cost leadership strategy (e.g. Ryanair, AirAsia). \nFor network carriers that adopt strategies that give sustainable seat cost advantage \nover their competitors, cost leadership is also a key strategy.  \n \n                                                 \n4\n These percentages are provisional as the survey is, as yet, not complete. \n 8 \n \n \nThe development of new aircraft by Boeing and Airbus that seem to serve different \nairline route and network strategies has led to an examination of which strategy is best \nsuited to the airline business cycle.  An airline operating an A380 would seem to be \nfollowing a multi-stop\/hub-to-hub\/consolidation\/lowest seat cost strategy.  An airline \nthat purchases the B787 may be adopting a non- or one-stop\/hub by-pass \ndiversification strategy aimed at capturing higher yielding passengers.    It is the \nairline strategy not the aircraft manufacturers’ strategies that should be assessed as the \nmanufacturers strategies are substitutes and interchangeable – each offer a \ncomparable aircraft in all sizes and ranges.  \n \nPerhaps the most detrimental strategy adopted by the airline managements \nirrespective of their underlying generic strategy and geographic location is one of \nmarket leadership in each city-pair market served. The strategy of pursuing market \nshare is based on the S-Curve model as shown below.  The S-Curve strategy argues \nthat below a certain frequency (or seat capacity\n5\n) share that the airline will capture \nless market share than the frequency\/capacity share it supplies – thereby \n“underperforming” its supply (Alamdari, 1997). The shape of the S-Curve will \ndepend on the market, the number of players operating in the market, the nature of the \ncity-pair market route and the number of alternatives routings. \n \n \nFigure 1: The Frequency\/Market Share S-Curve  \nNB: Both the X- and Y-axes are of the same scale. \n10% 20% 30%\n10%\n20%\n30%\n40%\n50%\nFrequency share %\nM\na\nrk\ne\nt \nS\nh\na\nre\n \n \n                                                 \n5\n Frequency share is the more logical metric to use for the analysis although it can be \ncalculated using either frequency or seat-capacity share. \n 9 \nThe strategy implied from the S-Curve model is that an airline will naturally seek to \ngain market share.  Above a certain share of the frequency (circa 15%) the steep \ngradient of the curve implies that the airline will capture a larger proportion of the \nmarket share than its contributed share of supply. By so doing, it can be argued that \nthe more prominent in a market an operator is the more likely it is to win more \npassengers.  If a carrier can dominate the frequency in the market then it will also take \nthe lion’s share of the passengers.  It is also more likely to attract higher-yielding \nbusiness passengers who are attracted to higher-frequency services so that should the \nneed arrive they can more easily alter their travel arrangements.  Once in a position of \ndominance the airline is a position to dictate prices, push out competitors and deter \nentrants by having the best listings in the key distribution channels in the market and \nby having the most attractive FFP programme offering as it has the best network on \nwhich passengers can earn and burn FFP points.    \n \nHowever there are some flaws in the concept.  Firstly, for longer haul city-pair \nmarkets, the multiple routings available to consumers (e.g. in the London-Sydney \nmarket passengers can connect over Dubai with Emirates, over Bangkok or Singapore \nwith Star Alliance, over Hong Kong with Cathay and British Airways, etc.) means \nthat market share cannot be easily protected in any one routing.  Secondly, there is an \nimplicit assumption that all passengers along the Y-axis are of the same value to the \nairline.  This is clearly not be the case as it includes passengers from the highest \npaying first class passenger to the customer carrying the most highly discounted \nticket.  Thirdly, the argument that higher frequency will lead to higher yields may not \nhold true as low cost airline pricing strategies become adopted by traditional airlines.   \nEasyJet has introduced flexible ticketing on a “pay-as-you-go” basis and as previously \nnoted, Air Canada and British Airways and other network carriers have begun \nunbundling ticket flexibility from their inclusive prices.  It is likely, as this practice \nbecomes more widely adopted, that passengers will continue to favour airlines that \noffer higher frequencies but this will not necessarily lead to a significant premiums \nfor those airlines.   \n \nIn the growth phase of the economic cycle airlines tend to adopt a market share \nstrategy following the Boston Consulting Group Portfolio strategy that argues in fast \ngrowing markets a company should invest heavily to ensure that once the market \nmatures the company enjoys a large market share and can subsequently take \nsignificant abnormal profits without any significant competition.   However as growth \nslows or as markets enter a downturn airlines generally do not face the market \nconditions as suggested by the BCG matrix.  Under the BCG Matrix theory a \ncompany that dominates market share in a slow growing mature market should adopt \na strategy of drawing as much profit from this market (Kotler, 1988).  In the airline \nindustry the frequent presence of alternative routing 6\nth\n freedom services on long haul \nmarkets and low cost carrier competition in short haul markets means that such a \nstrategy is hard to execute.  Faced with a low growing market, the dominant market \nshare leader will not be able to draw out significant profits.   In a downturn, as all \nairlines begin to suffer, the ones with the larger market shares defend their position in \nthe hope that carriers with less market share will not be able to survive the downturn \nand eventually withdraw from the city-pair market.    In these conditions the airline \nwith the more direct routing and the smaller carrier will most likely capture higher \nyielding passengers.  The carrier with the larger aircraft size may lose passengers \n 10 \nunless they drop fares, and even if it does it may have too much capacity for a \ncontracted demand and make losses. \n \n \nDiscussion \n \nThis note set out to address three questions.  In response to the first, it has been \nconcluded that Airbus and Boeing have substitute strategies with both manufacturers \nattempting to provide products across the seat capacity and range spectrum.  In \nrespect of the second question; does choice of aircraft matter less or more when \nmarkets are growing?  The paper has attempted to examine consumer behaviour and \nairline strategies throughout the cycle and concluded that leisure travellers are \ngenerally price elastic throughout the cycle, but more so in the downturn, and that \nalthough the presence of low cost carriers boosts demand, there is a limit to the \nnumber of holidays they can take during the year.  Business passengers are \nincreasingly price sensitive and value driven throughout the cycle as corporate \ninvolvement and self-booking tools become more prevalent in the market.  As both \nsegments of the market are increasingly price elastic, it would seem that the lowest \ncost\/lower fare airline will be best situated throughout the cycle. In good economic \nconditions and in very dense and congested markets the A380 will provide the \nadditional capacity to increase revenues for operating airlines. However, in the \ndownturn, airlines with excessive capacity may well lose money even with very low \nseat costs as they struggle to fill their capacity. With a market of increasing elasticity, \nseat costs are clearly very important and the A380 will enjoy a seat cost advantage \nover the B787 but use of the latter is likely to attract the higher yielding element of \nthe available traffic. It has been argued that throughout the cycle airlines tend to \npursue market share strategies, sometimes at the cost of profitability. This rather leads \nonto the final question; given how and which markets are growing, which \ncombination of aircraft will be winners or fair better than others?  This question more \nthan the others is impossible to answer in a general or theoretic manner.  The answer \nwill depend on the geographic location of the airline, the routes served, the regulatory \nenvironment and the competition faced.  Both the A380 and the B787 will have roles \nto play in the future aviation market and it is hoped that a more liberal regulatory \nframework of the future will better encourage airlines to adopt strategies that employ \nthem profitability to create a wealth generating industry. \n \nReferences \n \nABTN, (2006), Private jet business is growing fast, Air and Business Travel News, \n18\nth\n Sept2006 \n \nAirbus, (2004), “Global Market Forecast”, Airbus Industrie \n \nAlamdari, F., (1997), “ Market share models”, paper to IATA Air Transport Outlook \nConference, Lisbon 7 September  \n \nATI, (2006), “Airbus out performs Boeing with orders for 1,055 aircraft”, Air \nTransport Intelligence, www.rati.com, 17\/1\/06 \n \nBA (2001), “Fact Book, 2001”, British Airways. \n 11 \n \nBBC, (2005), “Market challenges facing Airbus’ giant”, news.bbc.co.uk, BBC News, \n25\/4\/05 \n \nBoeing, (2005), “Current Market Outlook”, Boeing Commercial Airplanes. \n \nBTRC (2006), “White Paper on the adoption and barriers to adoption of Self Booking \nTools”, Business Travel Research Centre,  www.businesstravelresearch.com, \nCranfield University, forthcoming.  \n \nEU, (2005), “A Study on the Future of Air Transport in the European Union”, DG \nTREN, by Department of Air Transport, Cranfield University, June. \n \nGraham, A., (2000), “Demand for leisure air travel and limits to growth”, Journal of \nAir Transport Management, Vol. 6., pp.109-118. \n \nGraham, A., (2006), “Have the major forces driving leisure airline traffic changed?”, \nJournal of Air Transport Management, Vo. 12., pp. 14-20. \n \nKotler, P., (1988), “Marketing Management: Analysis, Planning, Implementation, and \nControl”, 6th edit., Prentice Hall, New Jersey, \n \nMason, K. J., (2005), “Observations of fundamental changes in the demand for \naviation services”, Journal of Air Transport Management, Vol. 11, pp. 19-25. \n \nPorter, M. E. (1980), “Competitive Strategy: Techniques for Analyzing Industries and \nCompetitors”, Free Press, New York. \n \nSwan, W., (2006), “Misunderstandings about Airline Growth”, Proceedings of \nHamburg Forecasting Conference, 2006  \n \nTarry, C., (2006), “Behind the order book”, Airline Business, February. \n \n"}