{"doi":"10.1017\/S0022112010004787","coreId":"113844","oai":"oai:epubs.surrey.ac.uk:2899","identifiers":["oai:epubs.surrey.ac.uk:2899","10.1017\/S0022112010004787"],"title":"Stability analysis and break-up length calculations for steady planar liquid jets","authors":["Turner, MR","Healey, JJ","Sazhin, SS","Piazzesi, R"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-04-01","abstract":"This study uses spatio-temporal stability analysis to investigate the convective and absolute instability properties of a steady unconfined planar liquid jet. The approach uses a piecewise linear velocity profile with a finite-thickness shear layer at the edge of the jet. This study investigates how properties such as the thickness of the shear layer and the value of the fluid velocity at the interface within the shear layer affect the stability properties of the jet. It is found that the presence of a finite-thickness shear layer can lead to an absolute instability for a range of density ratios, not seen when a simpler plug flow velocity profile is considered. It is also found that the inclusion of surface tension has a stabilizing effect on the convective instability but a destabilizing effect on the absolute instability. The stability results are used to obtain estimates for the breakup length of a planar liquid jet as the jet velocity varies. It is found that reducing the shear layer thickness within the jet causes the breakup length to decrease, while increasing the fluid velocity at the fluid interface within the shear layer causes the breakup length to increase. Combining these two effects into a profile, which evolves realistically with velocity, gives results in which the breakup length increases for small velocities and decreases for larger velocities. This behaviour agrees qualitatively with existing experiments on the breakup length of axisymmetric jets","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2899<\/identifier><datestamp>\n      2017-10-31T14:07:01Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6D617468737075626C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2899\/<\/dc:relation><dc:title>\n        Stability analysis and break-up length calculations for steady planar liquid jets<\/dc:title><dc:creator>\n        Turner, MR<\/dc:creator><dc:creator>\n        Healey, JJ<\/dc:creator><dc:creator>\n        Sazhin, SS<\/dc:creator><dc:creator>\n        Piazzesi, R<\/dc:creator><dc:description>\n        This study uses spatio-temporal stability analysis to investigate the convective and absolute instability properties of a steady unconfined planar liquid jet. The approach uses a piecewise linear velocity profile with a finite-thickness shear layer at the edge of the jet. This study investigates how properties such as the thickness of the shear layer and the value of the fluid velocity at the interface within the shear layer affect the stability properties of the jet. It is found that the presence of a finite-thickness shear layer can lead to an absolute instability for a range of density ratios, not seen when a simpler plug flow velocity profile is considered. It is also found that the inclusion of surface tension has a stabilizing effect on the convective instability but a destabilizing effect on the absolute instability. The stability results are used to obtain estimates for the breakup length of a planar liquid jet as the jet velocity varies. It is found that reducing the shear layer thickness within the jet causes the breakup length to decrease, while increasing the fluid velocity at the fluid interface within the shear layer causes the breakup length to increase. Combining these two effects into a profile, which evolves realistically with velocity, gives results in which the breakup length increases for small velocities and decreases for larger velocities. This behaviour agrees qualitatively with existing experiments on the breakup length of axisymmetric jets.<\/dc:description><dc:date>\n        2011-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        attached<\/dc:rights><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2899\/5\/downstream2_steady_4.1.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2899\/7\/licence.txt<\/dc:identifier><dc:identifier>\n          Turner, MR, Healey, JJ, Sazhin, SS and Piazzesi, R  (2011) Stability analysis and break-up length calculations for steady planar liquid jets   J. Fluid Mech, 668.  pp. 384-411.      <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0022112010004787<\/dc:relation><dc:relation>\n        10.1017\/S0022112010004787<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2899\/","http:\/\/dx.doi.org\/10.1017\/S0022112010004787","10.1017\/S0022112010004787"],"year":2011,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Under consideration for publication in J. Fluid Mech. 1\nStability analysis and break–up length\ncalculations for steady planar liquid jets.\nBy M. R. TURNER1†, J. J. HEALEY2, S. S. SAZHIN1\nAND R. P IAZZES I1\n1 Sir Harry Ricardo Laboratories, School of Computing, Engineering and Mathematics,\nUniversity of Brighton, Lewes Road, Brighton BN2 4GJ UK\n2 Department of Mathematics, Keele University, Keele, Staffs ST5 5BG UK\n(Received 7 May 2011)\nThis study uses spatio–temporal stability analysis to investigate the convective and\nabsolute instability properties of a steady unconfined planar liquid jet. The approach\nuses a piecewise linear velocity profile with a finite thickness shear layer at the edge of\nthe jet. This study investigates how properties such as the thickness of the shear layer and\nthe value of the fluid velocity at the interface within the shear layer affects the stability\nproperties of the jet. It is found that the presence of a finite thickness shear layer can\nlead to an absolute instability for a range of density ratios, not seen when a simpler plug\nflow velocity profile is considered. It is also found that the inclusion of surface tension has\na stabilizing effect on the convective instability but a destabilizing effect on the absolute\ninstability.\nThe stability results are used to obtain estimates for the break–up length of a planar\nliquid jet as the jet velocity varies. It is found that reducing the shear layer thickness\nwithin the jet causes the break–up length to decrease, while increasing the fluid velocity\nat the fluid interface within the shear layer causes the break–up length to increase.\nCombining these two effects into a profile, which evolves realistically with velocity, gives\nresults in which the break–up length increases for small velocities and decreases for larger\nvelocities. This behaviour agrees qualitatively with existing experiments on the break–up\nlength of axisymmetric jets.\n1. Introduction\nThe injection of Diesel fuel into an engine cylinder is an important process in the overall\nrunning and efficiency of a Diesel engine (Hiroyasu et al. 1982; Stone 1992; Heywood 1998;\nCrua 2002). The liquid fuel is injected through an injector (which can have multiple holes)\nand the resulting jet breaks up into small droplets. These droplets heat up, evaporate and\nthe mixture of fuel vapour and air burns up in the autoignition and combustion processes.\nDuring the injection process a useful quantity to predict, or measure, is the break–up\nlength of the jet. This is the length over which the jet remains intact before it begins to\nbreak up into ligaments and droplets. Modelling this injection process is an important\nintegral part of the CFD Diesel engine models (Sazhin et al. 2003, 2008). During the\ninjection process these jets undergo acceleration, but, like most current injection models,\nwe neglect this process and in this paper we give a more complete analysis of the steady jet\nproblem by studying parameter ranges that cover those seen in Diesel injection models,\nas well as extending the research to look at parameters that cover a wider range of jets\n† Corresponding author: M.R.Turner@brighton.ac.uk\n2 M. R. Turner, J. J. Healey, S. S. Sazhin and R. Piazzesi\nwhich will be of interest to problems outside of Diesel injection problems. Furthermore,\nwhen the jet acceleration is relatively weak, the jet may be treated using a quasi–steady\napproximation which can give some qualitative insight into how acceleration may affect\nbreak–up. Thus this analysis is expected to help with future studies of the unsteady jet\nproblem. While the jets in Diesel engines are close to axisymmetric jets, in this paper\nwe consider only planar jets as these allow us to greatly simplify the analysis and lead\nto analytical results. The stability and break–up properties of both axisymmetric and\nplanar jets has been studied both experimentally and theoretically in the past, and for a\ngood overview of these studies the reader is directed to the introduction of So¨derberg &\nAlfredsson (1998).\nA planar jet consists of two parallel shear layers where the vorticity at each layer is\nequal and opposite. The stability properties of such jets are found by performing a linear\nstability analysis about a basic velocity profile U(y) where y is a coordinate normal to\nthe jet axis. By looking for a traveling wave solution of the linearized Navier–Stokes\nequations of the form vˆ(x, y, t) = v(y) exp[i(αx − ωt)], in the absence of viscosity, we\narrive at the Rayleigh equation\n(αU − ω)\n(\nd2v\ndy2\n− α2v\n)\n− αd\n2U\ndy2\nv = 0, (1.1)\nwhere v(y) is the velocity component normal to the jet axis (in y–direction), t is time,\nα is the streamwise wavenumber and ω is the angular frequency; see Drazin & Reid\n(1981). Here we neglect the effect of viscosity as typical Reynolds numbers for Diesel\njets are O(104) or larger, which is larger than, 103, a value above which viscosity can\nbe neglected in channel flows (Rees & Juniper 2010). Using a piecewise linear profile\nfor U(y) allows an analytic form of the dispersion relation D(α, ω) = 0 to be derived,\non which a temporal stability analysis can be performed. The dispersion relation can be\nsolved for complex ω, for a given real α. For the case of planar and axisymmetric jets,\nthe range of real wavenumbers which exhibit growth is governed by the width of the\nshear layer and the magnitude of the surface tension (Lord Rayleigh 1894; Batchelor &\nGill 1962; Funada et al. 2004; Marmottant & Villermaux 2004). However, a temporal\nstability analysis does not show certain aspects of the jet stability, such as whether or\nnot it is absolutely or convectively unstable, which has important implications for where\nit breaks up. The answer to this question requires a different mathematical approach.\nThis approach uses spatio–temporal stability analysis (Heurre & Monkewitz 1990) in\nwhich both α and ω are allowed to become complex and growth rates are obtained\nin various frames of reference moving in the axial direction along the jet. The growth\nrate is calculated using the method of steepest descent (Hinch 1991) by searching for\nspecial saddle points in the complex α−plane through which the inverse Fourier transform\ncontour can be deformed (see §2.1). The saddle point on the contour with the largest\ngrowth rate gives the disturbance growth rate in the limit t→∞. For a liquid jet there is\none saddle point in the α−plane whose position is determined by the thickness of the shear\nlayers and the value of the surface tension (known as the ‘s1’ saddle in Juniper (2007) and\n‘shear layer mode’ in Lesshafft & Huerre (2007)), and this saddle is located close to the\nreal α−axis. Also in the α−plane is a set of saddle points close to the imaginary α−axis\nwhich are due to the interaction between the two shear layers (known as ‘s2’ saddles\nin Juniper (2007) and ‘jet column modes’ in Lesshafft & Huerre (2007)). In the present\nstudy we examine how the growth rate at these saddles and their positions are affected\nwhen the interface between the two fluids is placed within the shear layer. We find that\nthis leads to important qualitative differences compared to previous studies where the\ndensity interface was assumed to lie on only one side of the shear layer (Marmottant\nStability analysis and break–up length calculations for steady planar liquid jets. 3\n& Villermaux 2004; Juniper 2007). Our assumption to neglect viscosity in this study is\nvalid because Yu & Monkewitz (1990) showed that the transition to absolute instability\nis caused by the interaction between the two shear layers and is not a viscous effect. Lin\net al. (1990) and Li & Tankin (1991) investigated the effect of viscosity on planar liquid\njets and found that the solution contained two convectively unstable modes, identical to\nthose of Hagerty & Shea (1955), whose growth rates are affected by the presence of the\nviscosity, and an unstable mode with zero frequency. Typically viscosity has a damping\neffect on the instabilities, but in particular parameter regimes viscosity enhances one of\nthe convective modes (Li & Tankin 1991).\nThe parameters we wish to investigate in this study are q = ρ2\/ρ1, the density ratio\nof the outer fluid to that of the liquid jet, W = We−1, the inverse Weber number\n(defined below), δ1 and δ2 the thicknesses of the shear layers on either side of the fluid\ninterface and the ratio of the fluid velocity at the interface to the maximum jet velocity,\nβ. It is known that the density ratio has a large effect on the behaviour of absolute\ninstabilities, in particular that low density jets (q > 1) are almost always absolutely\nunstable (Sreenivasan et al. 1989; Yu & Monkewitz 1990; Juniper 2006). In this work we\nare concerned with jets which have q < 1, but we find that absolute instabilities can occur\nat these density ratios for particular velocity profiles. Values of q < 1\/10 can typically be\nfound in Diesel jet injection experiments as the pressure of the gas inside the cylinder is\nvaried, while values of q > 1\/10 provide a wider range of interest to the reader. Rees &\nJuniper (2009) showed that the effect of small and moderate surface tension values is to\nincrease the magnitude of any absolute instability that arises due to the varicose modes\nof low density jets, while larger surface tension values are ultimately a stabilizing feature\nof the flow. This is one of the main differences between planar jets and axisymmetric jets,\nwhere surface tension has a more destabilizing effect. The effect of the shear layers in\nboth fluids, and the magnitude of the fluid velocity at the fluid interface, on the absolute\ninstability properties of jets with q < 1 has not been explored to date and will form\npart of this investigation. The case of low density jets (q > 1) with a fluid interface in\nthe shear layer has been examined using smooth velocity and density profiles (Raynal\net al. 1996; Srinivasan et al. 2010). These studies show that low density jets experience a\ntransition from absolute to convective instability if the shear layer thickness is sufficiently\nlarge compared to the jet diameter.\nThe stability results are then used to estimate break–up lengths of steady jets, which\nare compared with experiments such as those of Hiroyasu et al. (1982). The experiments\nshow that break–up lengths increase with injection velocity for small injection velocities\nand then reduce for larger velocities before eventually leveling off (see figure 13 of Hi-\nroyasu et al. (1982) which is reproduced as figure 1 here). In the comprehensive review\npaper by Eggers & Villermaux (2008) the reducing break–up length for larger velocities\nis explained by the thinning shear velocity at the edge of the jet, but no explanation\nis given for the rise in break–up length for small velocities. In this paper we show that\nthe increasing break–up length for small velocities could be due to the value of the fluid\nvelocity at the fluid interface within the shear layer increasing with velocity. The experi-\nments of Hiroyasu et al. (1982) are not performed using Diesel jets, but this experiment\nhas non–dimensional parameters which coincide with those we expect in Diesel injection\nsystems.\nThe present paper is laid out as follows. In §2 we formulate the problem and derive the\nanalytic dispersion relation which determines the stability characteristics of the jet. Then\nfollows a brief discussion of the spatio–temporal stability method used to analyze the jet\nstability, including in §2.2 a discussion of the s1 and s2 saddle points in the complex\nα−plane and how they move around as the problem parameters vary. In §3 we calculate\n4 M. R. Turner, J. J. Healey, S. S. Sazhin and R. Piazzesi\nFigure 1. Plot of the break–up length xb (mm) as a function of the injection velocity, vi (ms\n−1),\nfor an experiment where water is injected into pressurized Nitrogen (Hiroyasu et al. 1982). The\nresults are for four different Nitrogen pressures, which correspond to q ≈ 1\/1000, 1\/100, 1\/30\nand 1\/20. These are numbered 1–4 respectively. The radius of the nozzle used in this experiment\nwas 0.15mm.\nthe growth rates for particular parameter regimes and investigate the appearance or\notherwise of absolute instabilities. In §4 we use the convective instability analysis to\nexamine the break–up length of a steady liquid jet, and compare the results to those in\nfigure 1. Our concluding remarks and discussion can be found in §5\n2. Formulation of the mathematical model\nWe consider a two–dimensional steady planar jet orientated along the x∗−axis in\nthe (x∗, y∗) plane with dimensional reference velocity U∗0 at y\n∗ = 0, emerging from a\nnozzle of thickness 2L∗ at x∗ = 0. Using this reference length and velocity we can define\ndimensionless variables such as its velocity U =velocity of the jet\/U∗0 and its thickness\n2L (where L =thickness of the jet\/2L∗). The jet fluid has density ρ1 and lies between\nan outer fluid of density ρ2. For the stability analysis in §3 we consider a jet profile\nwith max(U) ≡ V = 1, however when we consider break–up lengths for these jets in §4,\nwe will allow V to vary. Thus we leave V explicitly in the equations in this section for\ncompleteness.\nWe assume that the jet does not spread significantly as we move along the x−axis in\nthe region we wish to consider, and we neglect any streamwise variation of the jet in this\narticle. Therefore we can consider the basic velocity profile u = U(y)i as a function of\nthe normal coordinate y only, where i is the unit vector in the streamwise direction. This\nassumption is valid close to the nozzle, where the jet spreads slowly in space. Typically\nthis velocity profile will be smooth with shear layers in each fluid at the edge of the\njet, such as in the CFD simulations in figure 2. The velocity profiles in figure 2(a) are\ncalculated for an axisymmetric Diesel jet injecting in static air, normalised by their\naxial velocity along the centre of the jet, and non–dimensionalised by the radius of the\nnozzle (L∗ = 0.0675 mm). These profiles are generated using the CFD package ANSYS R©\nFLUENT R©, where the boundary condition for the mass flow rate of fluid in the nozzle\nis given by measurements taken from an in house experiment (see figure 2(b)) (Karimi\n2007). The plotted profiles are taken at t∗ = 3 × 10−4 s where the jet has reached a\nsteady state.\nThe velocity profiles in figure 2 are calculated using the Eulerian multiphase model. In\nthis model a momentum equation for each fluid phase is solved for, giving the respective\nvelocity field. Since there exist large velocity differences between the two phases, this\napproach allows us to overcome the limitations of the shared velocity and temperature\nformulation of the Volume of fluid model (VOF), which can affect the fluid velocities\ncomputed across the interface. We consider the two fluids to be immiscible and the\nGeo–Reconstruction sharpening scheme (Youngs 1982; Ferziger & Peric 2004) is used\nto construct the free surface. The computational domain is a closed cylinder 80 mm in\nlength and 25 mm in the radial direction which was chosen to approximate the cylinder\nof an engine in the experimental facilities at the University of Brighton. The nozzle is\napproximated by a cylindrical channel of 1.08 mm×0.135 mm (axial × radial directions)\nand is located at the centre of the main cylinder edge. The computational domain is\ncovered by a structured mesh of approximately 82000 nodes which is refined inside the\nnozzle and in a 0.5 mm× 0.3 mm region immediately outside the nozzle. A coarser and\nStability analysis and break–up length calculations for steady planar liquid jets. 5\n(a) (b)\nFigure 2. Plot of (a) the normalised velocity profiles, taken at 0.1 mm from the nozzle exit,\nfor the CFD simulation with q ≈ 1\/45 for an axisymmetric jet with dimensional maximum\nvelocity of 1- 44 ms−1, 2- 81 ms−1, 3- 182 ms−1 and 4- 340 ms−1. The fluid interface is denoted\nby the vertical dotted line. Panel (b) gives the experimental mass flow rate used to generate\nresult 4 of panel (a). Note that the mass flow rate has been modified to enter a steady state\nfor t∗ > 2.5 × 10−4 s. In this simulation ρfuel = 850 kgm−3, the pressure inside the cylinder is\n2 Mpa and the initial temperatures of the fuel and air are 355 K.\nunstructured mesh is used outside this region and a time step of ∆t∗ = 5×10−8 s is used.\nA standard κ− \u000f turbulent model for both fluids is used. Initially the air in the chamber\nis considered at rest with a temperature of 355 K and a pressure of 2 MPa. The fuel\nis injected into the cylinder through the nozzle at the constant temperature of 355 K,\nassuming an adiabatic condition on the walls and applying a mass flow rate boundary\ncondition, given by figure 2(b), at the nozzle inlet surface. This produces a non–uniform\nvelocity profile as the fuel enters the main cylinder. A check of the dependency of the\nresults on the numerical grid was also carried out and the results were found to agree\nwithin a few percent, hence the simulations are consistent.\nThe mass flow rate in figure 2(b) has been modified so that it levels off once the initial\nacceleration of the jet has been completed at around t∗ = 2.5 × 10−4 s. Beyond this\ntime the jet reaches a steady state, although from t∗ = 2.5× 10−4 s onwards, the change\nin the profiles is very small. The other profiles are generated by considering fractional\nmultiples of this mass flow rate to generate the lower velocity jets. These profiles are\ngenerated assuming that the jet is axisymmetric, but we expect qualitatively similar\nresults for a planar jet, so we use these results to motivate the velocity profiles used in\nthis study. In fact the experimental results of So¨derberg & Alfredsson (1998) show planar\njet velocity profiles which have a similar appearance to those shown here, however they\ncannot determine the structure of the velocity profile in the outer fluid as we can in our\nCFD simulations. The profiles in figure 2(a) are taken at 0.1 mm from the nozzle exit and\nthe nozzle is assumed to be full of fluid for all times to best model the flow in a Diesel\ninjector where the nozzle fills with fluid as the injector needle is lifted. In this study we\napproximate the CFD profiles in figure 2 by a piecewise linear velocity profile, which is\nshown in figure 3. Although this profile is a simplification of the true profile, it captures\nimportant qualitative aspects of the jet, and greatly simplifies the problem when it comes\nto studying properties such as absolute instabilities. This piecewise linear profile exhibits\nthe same qualitative behaviour as a realistic smooth profile, as the exact shape of the shear\nlayer only has a small effect on the stability characteristics of the flow (Esch 1957), and\nHealey (2009) found a co–flow absolute instability for certain confined piecewise linear\nshear layers and the same qualitative behaviour, with modest quantitative variation, in\nsmooth profiles. The piecewise linear profile also allows for an analytical expression for\nthe dispersion relation, as well as implicitly capturing typical features of a viscous jet\nprofile, although we do not explicitly consider the effects of viscosity in this model. Other\nstudies have considered the stability of planar jets using velocity profiles which are more\nrealistic, i.e. have shear layers either side of the fluid interface, than the simple plug\nflow approximation (Hashimoto & Suzuki 1991; So¨derberg & Alfredsson 1998; So¨derberg\n2003), but the current paper is the first to examine the stability properties of such a\nrealistic profile using the spatio–temporal stability analysis approach.\nThe piecewise linear velocity profile in figure 3 is symmetric about y = 0, hence we\n6 M. R. Turner, J. J. Healey, S. S. Sazhin and R. Piazzesi\nFigure 3. Plot of the piecewise velocity profile U(y), where the thickness of the liquid jet is 2L.\nThe density of the liquid layer is ρ1 and has a shear layer width of δ1 while the air density is ρ2\nand has a shear layer thickness δ2. The parameter β ∈ [0, 1] defines the jet velocity at the fluid\ninterface, normalized by V .\nneed only to consider half the jet, of which the top half has the form\nU(y) =\n\n0 y > L+ δ2,\n−βVδ2 (y − L− δ2) L+ δ2 > y > L,\nV − (1−β)Vδ1 (y − L+ δ1) L > y > L− δ1,\nV L− δ1 > y > 0.\n(2.1)\nThe parameter β defines the jet velocity at the fluid interface normalized by the velocity\nV . It can be seen in figure 2 that β increases with increasing V by considering the velocity\nat the fluid interface. In figure 3 we number the layers of the profile 1 − 4 from the top\nlayer in fluid 2 to the centre layer in fluid 1. The value of L in this study will be set to\nL = 1, i.e the thickness of the jet is the same as that of the nozzle, although a true value\nof L will be slightly smaller than unity due to a thinning of the jet as it leaves the nozzle\n(Domann & Hardalupas 2004). This effect is expected to be relatively small in the region\nof interest, so we neglect it here.\nThe stability of profile (2.1) to linear disturbances, in the absence of viscosity, is found\nby linearizing the two–dimensional Euler equations. We introduce velocity and pressure\nfluctuations of the form\n(uˆ, vˆ, pˆ)(x, y, t) = (U(y), 0, 0) + \u000f(u(y), v(y), p(y))ei(αx−ωt) + complex conjugate, (2.2)\ninto the Euler equations where \u000f \u001c 1 and u, v, p = O(1), and time has been non-\ndimensionaised by L∗\/U∗0 . By neglecting nonlinear terms and eliminating the pressure p\nand the streamwise velocity perturbation u we arrive at the Rayleigh equation (1.1) in\neach of the fluid layers (Drazin & Reid 1981). Here α is the wavenumber in the streamwise\ndirection and ω is the angular frequency of the disturbance, such that ω\/α = c is the\nwave phase speed in the x direction. For high speed jets, it is likely that the fluid within\nthe jet is close to or could even be turbulent, possibly due to the cavitation in the nozzle\n(Arcoumanis et al. 2001). However in this study we assume that any eddies in the jet are\nsmall, and so our assumption that the jet appears as a single velocity profile and can be\napproximated as (2.1) still holds.\nThe modal solutions to the Rayleigh equation can be either sinuous (even functions for\nv; v(y = 0) = 1, dv\/dy(0) = 0) or varicose (odd functions for v; v(0) = 0, dv\/dy(0) = 1)\nmodes, and as any perturbation can be made up of a linear combination of these modes\nwe have a complete stability representation by considering these modes only. Therefore\nfor the piecewise linear basic profile (2.1), the form of the eigenmodes can be solved\nfor exactly in each layer. Also by using the symmetry conditions at y = 0 and the two\nmatching conditions\n∆\n[\nvj\nαUj − ω\n]\n= 0, ∆\n[\nρj(αUj − ω)v′j − ρjαU ′jvj\n]\n= χ,\nacross each velocity layer to eliminate the arbitrary constants of the problem, we can\nderive the dispersion relation\nD(α, ω) = cˆ4ω\n4 + cˆ3ω\n3 + cˆ2ω\n2 + cˆ1ω + cˆ0 = 0, (2.3)\nwhere cˆ4 to cˆ0 are functions of (α, δ1, δ2, β, V, L, q = ρ2\/ρ1,W ) given in Appendix A.\nHere the notation is ∆[ ] = [ ]y0+\u000fy0−\u000f at the discontinuity y = y0 and \u000f → 0. When the\nStability analysis and break–up length calculations for steady planar liquid jets. 7\nsecond interface condition is applied between two layers of the same fluid χ = 0, and\nχ = Wα4ρ1 at the interface between the two fluids at y = L(= 1). The non–dimensional\nconstant W = We−1 = σ\/(ρ1U∗20 L\n∗), where σ is the dimensional surface tension, is the\ninverse of the Weber number. In the present study this parameter remains constant, but\nthe surface tension effects appear as W\/V 2 in the above dispersion relation, so as V\nincreases the effect of surface tension reduces. Consequently we could fix V = 1 and let\nW vary, but in §4 we calculate the break–up length of the jet as a function of V .\nFor the case of no surface tension, W = 0, the dispersion relation reduces to\nc3ω\n3 + c2ω\n2 + c1ω + c0 = 0,\nby division of the factor ( 12αV − ω). The expressions for c3 to c0 can also be found in\nAppendix A. For more information of the derivation of the dispersion relation, see either\nDrazin & Reid (1981); Schmid & Henningson (2001); Healey (2007) or Juniper (2007).\n2.1. Spatio–temporal stability analysis\nIn this study we are interested in how disturbances generated at the nozzle propagate\nalong the jet. Thus it appears that a simple temporal instability analysis for each real\nwavenumber α would suffice for finding unstable waves. However this analysis doesn’t\nallow for distinguishing an absolute instability from a convective one, i.e. distinguishing\na disturbance which grows at the same spatial position at which it was forced (the nozzle\nin this case) from one which only grows as it propagates downstream. In a steady parallel\njet, an absolute instability is significant because the jet will eventually break up at the\nnozzle as long as enough time is allowed to pass. In this paper we examine the fluid\nresponse to the forcing in frames of reference moving at various speeds downstream (or\npossibly upstream) of the source of disturbances as in the problems considered by Healey\n(2006) and Juniper (2006).\nThe calculation of this response in one spatial dimension can be found in works such as\nHuerre (2000) and Healey (2006) and is outlined below. We assume that a time dependent\nforcing is turned on at t = 0 at the nozzle of the jet (x = 0), and that this can be written\nas the boundary condition vˆ(x, 0, t) = δ(x)fˆ(t), where fˆ = 0 for t < 0 (Juniper 2007).\nThe solution for vˆ(x, y, t) can be written as the double inverse Fourier transform\nvˆ(x, y, t) =\n1\n4pi2\n∫\nFα\n∫\nLω\nf(ω)\nD(α, ω)\nv(y;α, ω)ei(αx−ωt) dα dω, (2.4)\nwhere D(α, ω) is the dispersion relation (2.3). The integration contour Fα runs from −∞\nto ∞ along the real axis in the complex α−plane, while the contour Lω runs from −∞\nto ∞ above all singularities in the complex ω−plane to ensure vˆ = 0 for t < 0.\nIt is possible to distinguish between convective and absolute instabilities without nu-\nmerically evaluating the above double integral (Briggs 1964), by considering an impulsive\nforcing fˆ(t) = δ(t). The residue theorem can then be used to evaluate the ω integration\nin (2.4) as\nvˆ(x, y, t) = − i\n2pi\n∑\nm\n∫\nFα\nv(y;α, ω)\nDω(α, ωm(α))\nei(αx−ωmt) dα, (2.5)\nwhere ωm is the m\nth root of the dispersion relation. Equation (2.5) can now be evaluated\nby the method of steepest descent (Hinch 1991), where in the large time limit with\nx\/t = O(1) the dominant contribution to the integral comes from the particular saddle\npoints of the function\ngm = ωm − αx\nt\n, where\n∂ωm\n∂α\n=\nx\nt\n. (2.6)\n8 M. R. Turner, J. J. Healey, S. S. Sazhin and R. Piazzesi\n(a) (b)\nFigure 4. Plot of the contours of gi in the complex α−plane for the sinuous mode with\n(δ1, δ2, q, β, V,W ) = (0.5, 0.5, 1\/500, 1\/2, 1, 0) and (a) x\/t = 0.6 and (b) x\/t = 0.9. The branch\ncut near the real axis is marked by the dashed line while the path of integration is shown by\nthe solid white line. The saddles are labeled s1 and s2 as in Juniper (2007).\nIn this study we consider the growth of the perturbation vˆ along all possible real\ncharacteristics ∂ω\/∂α = x\/t, and calculate the growth rate\ngi = Im(g) = ωi − x\nt\nαi,\nwhere the subscript i denotes the imaginary part and we have dropped the m subscript\nfor clarity, knowing we must consider all Riemann surfaces. The saddle points of the\ndispersion relation are found by simultaneously solving equations D¯(g, α) = D¯α(g, α) =\n0, numerically using Newton iterations, where D¯(g, α) is given by (2.3) with ω replaced\nby (2.6).\n2.2. Distinction between saddle points\nIn this section we show how the integral in (2.5) is evaluated, consider the two types of\nsaddle points which contribute to the integral, and show how the saddles move around\nthe α−plane as we consider the growth along various x\/t characteristics.\nThe integration path in (2.5) originally lies along the real axis in the complex α−plane.\nHowever the method of steepest descent makes the evaluation of this contour easier by\ndeforming the integration path to pass through particular saddle points in the α−plane.\nThis deformation of the integration contour can only be carried out as long as no poles\nor branch cuts of g(α) (which correspond to those of ω(α)) are crossed. We visualize\nthe integration by plotting contours of gi in the complex α−plane and then choose an\nintegration path which solely lies within the valleys of the saddle point (Healey 2006,\n2007). A sensible choice for the inversion contour is a path which follows contours of\nconstant Re(g) = gr (orthogonal to the contours of gi) which is only allowed to change\nvalues of gr at points in the α−plane where gi is strongly negative. This is done so as to\nonly add a negligible contribution to the integral if we were to evaluate it numerically. If\nmore than one saddle point with gi > 0 lies on the integration path then both have to be\nconsidered for the growth rate of the disturbance. However the long time response can\nsolely be inferred from the values of the saddle with the largest value of gi, henceforth\nknown as the dominant saddle point.\nAn example of what the contours of gi look like in the complex α−plane for the sinuous\nmode with (δ1, δ2, q, β, V,W ) = (0.5, 0.5, 1\/500, 1\/2, 1, 0) and x\/t = 0.6 and x\/t = 0.9\ncan be seen in figures 4(a) and (b) respectively. These parameters are chosen to give\na typical velocity profile with non–zero shear layers in each fluid. The density ratio\nq = 1\/500 is considered because it corresponds to cold liquid Diesel liquid fuel being\ninjected into compressed air at about five atmospheres pressure, which is similar to\nthe smallest density ratio in the experiments in figure 1. In this paper we adopt the\nnotation of Juniper (2006, 2007) for the labelling of the saddle points. We denote the\nsaddle whose position is controlled by the thickness of the shear layer and surface tension\n(Rees & Juniper 2009) as s1. This saddle corresponds to waves with moderate and short\nwavelengths so the eigenfunctions are confined to a region close to the shear layer, so\nshear layer effects and surface tension are important for determining its position. The\nother saddles which are controlled by the interaction of the two shear layers (Juniper\n2007) are denoted as s2 saddles. Unlike s1 saddles, these s2 saddles correspond to waves\nwith long wavelengths which have wide eigenfunctions that feel the effect of both shear\nStability analysis and break–up length calculations for steady planar liquid jets. 9\nFigure 5. Plot of the growth rate gi as a function of x\/t for 1– the sinuous mode with\n(δ1, δ2, q,W ) = (0.5, 0.5, 1\/500, 0), 2– the varicose mode with (0.5, 0.5, 1\/500, 0), 3– the sinu-\nous mode with (0.25, 0.25, 1\/500, 0) and 4– the varicose mode with (0.25, 0.25, 1\/500, 0).\nlayers. As well as the branch cut close to the real axis (denoted by the dashed line)\nthere are also branch cuts close to the imaginary α−axis, which we have not shown for\nclarity. These branch cuts lie so close to the imaginary α–axis, such as the one which\nlies approximately between the origin and αi = −3, that they don’t affect our choice\nof inversion contour in this study. The position of all the branch points in the α−plane\ncan be found by simultaneously solving equations D¯(g, α) = D¯ω(g, α) = 0, using Newton\niterations. For both cases in figure 4 we note that the only saddle which lies on the\ncontour of integration is the s1 saddle. For x\/t = 0.6 in figure 4(a) we see that the s1\nsaddle lies below the real α−axis, so the inversion contour comes between the two branch\npoints at the origin, down the right hand side of the branch cut close to the imaginary\naxis and then passes over the s1 saddle. The contour then passes around the branch\ncut close to the real α−axis and off to infinity above the branch cut, but this is not\nshown here. As x\/t → 0.5 from above, the s1 saddle remains the only saddle point on\nthe integration contour and it moves to large αr while the magnitude of gi tends to zero.\nAs x\/t increases from 0.6 the s1 saddle moves around the branch cut on the real α axis\nand onto a Riemann sheet with αi > 0, which can be seen for x\/t = 0.9 in figure 4(b).\nIn this case the dominant s1 saddle is very close to an s2 saddle in the upper complex\nplane, but an investigation of the valleys of the respective saddle points shows that for\nthis parameter set the inversion contour cannot pass over both saddle points. Therefore\nas x\/t → 1 the s1 saddle remains dominant and again moves to large αr, with gi → 0,\nbut this time above the branch cut near the real axis.\nAs the density ratio q is increased, the s1 saddle moves closer to the imaginary α−axis,\nbut in this paper we find that the s2 saddles do not contribute to the stability of the\njet. However if the jet were confined between two solid surfaces then a further set of s2\nsaddles would be introduced to the α−plane and then as the position of the walls are\nvaried, these s2 saddles could become traversed by the integration contour and hence\naffect the stability properties of the jet as found in Juniper (2007). This, however, is not\nconsidered in the present paper.\nWe note that an absolute instability will occur in the jet if there exists a saddle point on\nthe inversion contour with gi > 0 for x\/t = 0. These absolute instabilities are significant\nfor steady jets, because eventually the flow will break down at the nozzle as long as\nwe allow enough time to pass. Thus determining their existence for particular parameter\nvalues is very important and in the next section we calculate parameter sets with absolute\ninstabilities that have not been documented before.\n3. Stability calculations for a steady jet\nIn this section we present a systematic study of the convective and absolute stability\nproperties of the velocity profile (2.1) for a wide range of parameter values, such as the\nshear layer thickness, surface tension and the value of the jet velocity at the fluid interface.\nIn §4 we use the relevant results which relate to our profiles in figure 2(a) to make a\nconnection with jet break–up lengths. Throughout this section we set V = L = 1 without\naffecting the qualitative nature of the results, and unless otherwise stated β = 1\/2.\nIn figure 5 we plot growth rates gi as a function of the characteristic x\/t for both\nsinuous (results 1 and 3) and varicose (results 2 and 4) modes. For both parameter sets\nthe varicose mode has a smaller maximum growth rate value, gmaxi , where g\nmax\ni is the\n10 M. R. Turner, J. J. Healey, S. S. Sazhin and R. Piazzesi\n(a) (b)\nFigure 6. Plot of (a) the growth rate gi for sinuous modes as a function of x\/t for\n(0.5, 0.5, 1\/500, 0), (0.5, 0.5, 1\/10, 0) and (0.5, 0.5, 1, 0) numbered 1 − 3 respectively. Panel\n(b) shows the sinuous mode growth rates for (0.5, 0.5, 1\/500, 0), (0.5, 0.1, 1\/500, 0) and\n(0.5, 0.9, 1\/500, 0) numbered 1− 3 respectively.\nmaximum value of gi, although as the shear layers thin out the growth rates for both\nthe sinuous and varicose modes tend to the same values, as is shown by results 3 and 4\nwhich are indistinguishable from one another. This is because as the shear layer thins,\nthe wavelengths shorten so the eigenfunctions decay faster with distance from the shear\nlayer, and so whether you use v(0) = 0 or v′(0) = 0 makes very little difference. In this\nlimit the results should approach those of an isolated mixing layer, as studied in Healey\n(2009), but with a modification due to the fluid interface being placed in the middle\nof the shear layer. In fact, the varicose modes correspond to the case of a mixing layer\nconfined by a single plate studied in Healey (2009). As the sinuous modes have larger\nmaximum growth rate, these modes will become unstable first and so will be significant\nto convective instabilities if we are interested in the initial break up of the jet. However\nthe varicose modes also need to be considered in case they produce a shorter break–up\nlength. The varicose modes are most significant for the absolute instabilities in the jet,\nand it should be noted that the varicose mode with x\/t . 0.64 and δ1 = δ2 = 0.5 has\na growth rate larger than the sinuous modes as well as a maximum growth rate value\noccurring at a lower value of x\/t.\nIn figure 5 we also observe that as the thickness of the shear layer decreases the value\nof gmaxi increases. In fact g\nmax\ni scales like δ\n−1\n1 in this problem, and this can be seen as\ngmaxi ≈ 0.25 for δ1 = δ2 = 0.5 while gmaxi ≈ 0.5 for δ1 = δ2 = 0.25. The values of gi for\nthe δ1 = 0.25 result cannot be calculated for x\/t ≈ 0.5 and 1.0 because close to these\nvalues the saddle point in the α−plane has moved to a large value of αr, as discussed\nin §2.2. Thus the value of this saddle becomes difficult to calculate numerically because\nof numerical inaccuracies that occur in calculating the roots of the dispersion relation.\nThis problem arises for thin shear layers and small values of q and could be overcome\nby evaluating the integral in (2.4) numerically and calculating the growth rate from this.\nHowever, it can be noted by studying the α−plane that in these limits, no s2 saddles\nbecome traversed by the integration contour, therefore it can be deduced that gi → 0 as\nx\/t→ 0.5 and 1.0 as for the δ1 = 0.5 case so no difficult numerical integrals need actually\nbe evaluated. It is found in §4 that these parts of the growth rate are not required for\ncalculating the break–up length for this value of q, so the calculation of these tails is\nirrelevant.\nIn figure 6(a) we plot gi as a function of x\/t for sinuous modes with the different\ndensity ratios (0.5, 0.5, 1\/500, 0), (0.5, 0.5, 1\/10, 0) and (0.5, 0.5, 1, 0) numbered 1 to 3\nrespectively. The most striking difference between the results displayed in panel (a) is\nthat for q = 1 (result 3) there is growth over a much larger range of x\/t characteristics.\nThis is significant because now there is the chance that there could be growth along\nthe x\/t = 0 characteristic for particular parameter values, i.e. there could now exist an\nabsolute instability. In this case there is a very weak absolute instability for q = 1. As\nq is increased from 1\/500 to 1 the maximum value of the growth rate, gmaxi , initially\nincreases up to q ≈ 1\/5 before decreasing as q → 1. This can be seen in figure 7(a) for\nδ1 = δ2 = 0.5. Figure 7(b) shows that the corresponding x\/t value increases slightly\nup to q ≈ 1\/4 before also reducing as q → 1. This shows that as the density difference\nbetween the two fluids becomes closer to unity, break up will occur at a later time for\nthe same velocity profile because of the smaller growth rate, but also the disturbance\nStability analysis and break–up length calculations for steady planar liquid jets. 11\n(a) (b)\nFigure 7. Plot of (a) the maximum growth rate gmaxi as a function of q for the case\nδ1 = δ2 = 0.5 and W = 0, while panel (b) plots the value of x\/t at the maximum value.\n(a) (b)\nFigure 8. Plot of gi as a function of x\/t for sinuous modes of the velocity profile (3.1) with\nq = 1\/500 and (a) a = 1 with β = 0.6, 0.5, 0.25 and 0.1 numbered 1 − 4 respectively and (b)\n(a, β) = (1.25, 0.5), (0.75, 0.5), (1.25, 0.25) and (0.75, 0.25) numbered 1− 4 respectively.\n(a) (b)\nFigure 9. Plot of gi as a function of x\/t for (a) (0.5, 0.5, 1, 0) for 1- sinuous mode and 2- varicose\nmode and for sinuous modes with (b) 1- (0.5, 0.5, 1, 0), 2- (0.25, 0.25, 1, 0), 3- (0.5, 0.3, 1, 0) and\n4- (0.5, 0.7, 1, 0).\nwill move slower along the jet. Weaker growth rates tend to delay break up, but slower\naxial propagation velocities tend to move break up towards the nozzle.\nFigure 6(b) on the other hand shows the effect on the growth rate of varying the\nthickness of the outer shear layer, δ2, when q = 1\/500. The results show that thinning\nthe shear layer in the less dense fluid increases the maximum growth rate by a small\namount, and thickening the shear layer reduces the maximum growth rate by an even\nsmaller amount. This small difference as δ2 is varied demonstrates that a thickening of the\nouter shear layer alone cannot be responsible for the increased break–up length observed\nin axisymmetric Diesel jets (see the discussion in Sazhin et al. (2008)). As q increases\nthe effect of the outer shear layer increases, but doesn’t really become significant until\nq & 1\/10.\nIn figure 6(a) we find that for q ≤ 1 the smallest value of x\/t for which growth is\nobserved is x\/t = 1\/2 = β. Therefore we can generate results with gi > 0 for x\/t < 1\/2\nby considering a fixed shear layer thickness and by varying the magnitude of the jet\nvelocity at the fluid interface within the shear layer. This is achieved by varying the\nparameter β and allowing the parameters δ1 and δ2 to vary as\nδ1 = a(1− β), δ2 = aβ, (3.1)\nwhere a determines the thickness of the shear layer. Figure 8(a) shows that reducing β\nfrom 0.6 (result 1) to 0.5 (result 2) with a = 1 increases the range of x\/t characteristics\nalong which there is growth. In fact the smallest value of x\/t for which there is growth\nis exactly β, which is verified by each of the four cases shown. We also note that the\nmaximum value of gi varies only slightly as β is varied, but the x\/t value at the maximum\nmoves to smaller values as β decreases. This increase in the range of x\/t values with β is\nalso seen for the varicose mode (not shown), which means that there is the possibility for\nan absolute instability, primarily in the varicose mode, as β is reduced. This is examined\nfurther in figure 12. We should also note that for β = 0.25 and 0.1, characteristics with\nx\/t > 1 now have a positive growth rate. The implication of such solutions is discussed\nbelow. Figure 8(b) shows that different values of a give the same effect as β is varied,\nexcept that the overall growth rate is reduced as a is increased and vice versa as a is\nreduced.\nWhen we consider two fluids of equal density (q = 1) we find that varying parameters\nsuch as δ2 have a greater effect on the growth rate than they did for small values of\nq (= 1\/500). Figure 9(a) plots both the sinuous mode (result 1) and varicose mode\n(result 2) for the case (0.5, 0.5, 1, 0), and these results compare to results 1 and 2 for\nthe q = 1\/500 case in figure 5. For the q = 1 results we see that there is a much larger\ndifference between the maximum values of the growth rates of the two modes, with the\n12 M. R. Turner, J. J. Healey, S. S. Sazhin and R. Piazzesi\n(a) (b)\nFigure 10. Plot of the sinuous mode growth rate gi as a function of x\/t for (δ1, δ2, q,W ) =\n(a) 1– (0.5, 0.5, 1\/500, 0), 2– (0.5, 0.5, 1\/500, 0.001) and 3– (0.5, 0.5, 1\/500, 0.01) and (b) 1–\n(0.5, 0.5, 1, 0), 2– (0.5, 0.5, 1, 0.01) and 3– (0.5, 0.5, 1, 0.02).\n(a) (b)\nFigure 11. Plot of gi for varicose modes at the s1 saddle on the inversion contour when x\/t = 0.\nIn panel (a) δ1 = δ2 and 1– (q,W ) = (1, 0), 2– (1, 0.01), 3– (1\/2, 0) and 4– (1\/2, 0.01). In panel\n(b) we fix δ1 = 0.3 and examine the value of gi at the s1 saddle as a function of δ2 for 1– (1, 0)\nand 2– (1, 0.01). When this value is greater than 0 there is an absolute instability in the jet.\nsinuous mode growing more than twice as fast as the varicose mode at its maximum\nvalue. We also observe that the range of x\/t characteristics where the varicose mode\nis larger than the sinuous mode is greatly reduced for q = 1 and is concentrated to a\nsmall region near x\/t = 0. In fact for this parameter set the varicose mode gives an\nabsolute instability (i.e. gi > 0 at x\/t = 0). The sinuous mode on the other hand has\ngrowth along characteristics which can propagate at a group velocity greater than the\nspeed of the jet (x\/t > 1), although the value of gi on these characteristics is much less\nthan the maximum value of gi. These characteristic values would not be significant for\na steady jet, as the jet is assumed to fill the whole domain x ∈ [0,∞). However for an\naccelerating jet emanating from the nozzle, the growth along these characteristics could\nprove important, because these wave packets would propagate along the jet, hit the front\nof the jet and then reflect back setting up interference with other downstream traveling\nwave packets which could induce break up.\nSo far we have focused on jets with zero surface tension, however surface tension can\nhave a major effect on both the convective and absolute instability properties of the jet.\nIn figure 10(a) we consider the growth rate gi for sinuous modes as a function of x\/t for\nthe cases (0.5, 0.5, 1\/500, 0), (0.5, 0.5, 1\/500, 0.001) and (0.5, 0.5, 1\/500, 0.01) numbered\n1–3 respectively. Here we see that increasing the effect of surface tension decreases the\nmaximum value of the growth rate, i.e. it has a stabilizing effect on the convective insta-\nbility. This is because the surface tension forces act to suppress the instability waves on\nthe surface of the fluid thus reducing the ability of the free surface to break up. It is also\ninteresting to note that for this small value of q, the value of x\/t where the maximum\nvalue of gi occurs increases as W is increased. In figure 10(b) we consider the effect of\nsurface tension in the case q = 1, i.e. when the two fluids have equal densities, again\nfor the case δ1 = δ2 = 0.5. Here we find that because q is larger than in panel (a) we\nrequire larger values of W to see a significant change to the growth rate gi, thus we\nexamine W = 0, 0.01 and 0.02 which are numbered 1–3 respectively. As for q = 1\/500\nin panel (a), the maximum value of gi reduces as W is increased, but for q = 1 the x\/t\ncharacteristic of the maximum growth rate moves to a smaller value. We also note that\nalthough surface tension has a stabilizing effect on the convective instability, it has a\ndestabilizing effect on the absolute instability as result 3 in figure 10(b) shows a weak\nabsolute instability while results 1 and 2 have no absolute instability. The destabilizing\neffect of surface tension for absolute instabilities has been studied by Lin & Lian (1989)\nand we look at its effect on our jet profiles in figures 11 and 12.\nThe major part of this study up to now has focused on the sinuous modes of the jet,\nbut these modes are more stable than the varicose modes when it comes to absolute\ninstabilities (Juniper 2006). Therefore, for the remainder of this section we focus our\nattention on varicose modes and investigate the conditions when they produce absolute\ninstabilities in the jet. These are very important in the steady jets, as they tell us when\nthere will be disturbance growth at the nozzle which eventually leads to disintegration\nStability analysis and break–up length calculations for steady planar liquid jets. 13\n(a) (b)\nFigure 12. Plot of the value of gi for the varicose mode at the s1 saddle on the inversion\ncontour when x\/t = 0. For panel (a) the velocity profile is fixed by the parameters (3.1) with\na = 8\/5, q = 1\/2 and 1– W = 0 and 2– W = 0.01, while for panel (b) δ1 = δ2 = 0.8 and 1–\n(q,W ) = (1\/2, 0), 2– (1\/2, 0.01) and 3– (1\/10, 0). The value of gi is plotted as a function of β,\nand an absolute instability develops when gi is greater than 0.\nof the whole jet and a spray is formed. We expect an absolute instability to disintegrate\nthe jet in this fashion because we expect similar behaviour between this flow and the\nwake flow of Chomaz et al. (1987), i.e. the jet is most unstable near the nozzle so an\nabsolute instability at the nozzle would generate an unstable global instability in the jet.\nAlso, any vortex rings which occur, such as in the experiments of Monkewitz & Sohn\n(1988), would be highly unstable to secondary instabilities at the high Reynolds numbers\nconsidered in this study, so break–up of the jet at the nozzle would be expected.\nIn figure 11 we plot the value of gi at the s1 saddle on the inversion contour for various\nparameter values, and where this quantity is greater than zero we have an absolute\ninstability in the flow. For result 1, which has δ1 = δ2, W = 0 and q = 1, we find that\nwe have an absolute instability for 0.175 < δ1 < 0.571. This result extends the work\nof Juniper (2007) who suggests that a shear layer in the jet is not hugely significant\nto its absolute stability properties, therefore he only considered the δ1 = 0 case which\ngives no absolute instability for the parameter range considered here. However figure\n11(a) clearly shows that increasing the thickness of the shear layer will produce absolute\ninstability, and when the shear layer becomes too wide the absolute instability stabilizes\nagain. Result 2 shows that increasing the surface tension (W = 0.01) increases the range\nof values of δ1 for which there is an absolute instability to 0.146 < δ1 < 0.743. It also\nincreases the magnitude of the absolute instability as discussed in Lin & Lian (1989) and\nearlier in this section. Results 3 and 4 show the same absolute instability phenomena\nexcept with q = 1\/2. In this case the absolute instability occurs for a larger δ1 value,\nand even extends to δ1 = 1 where the profile becomes an triangular jet. Note that this\nresult is the opposite of that observed by Srinivasan et al. (2010) who found that for low\ndensity jets (q > 1) the absolute instability occurs as δ1 → 0 and becomes convectively\nunstable as δ1 increases.\nIn figure 11(b) we fix δ1 = 0.3 with q = 1 and investigate how varying the outer shear\nlayer δ2 affects the absolute instability. From figure 11(a) we know that δ2 = 0.3 for this\nparameter set leads to an absolute instability, but figure 11(b) shows that reducing the\nthickness of the outer shear layer increases the absolute instability down to δ2 = 0.160\nand then the absolute instability reduces as δ2 → 0 still giving an absolute instability at\nδ2 = 0. Increasing δ2 from 0.3 just reduces the absolute instability and at δ2 = 0.408 the\nabsolute instability stabilizes. Result 2 shows the destabilizing effect of W = 0.01. For\nthe results in figure 11 we found that reducing q much below 1\/2 removed the absolute\ninstability, so for dense jets the flow is only convectively unstable.\nIn figure 12(a) we examine the absolute instability properties of the fixed shear layer\nprofile (3.1) with a = 8\/5 where we vary the velocity at the fluid interface, effectively\nvarying the position of the fluid interface relative to a fixed shear layer, for the density\nratio q = 1\/2. We plot the value of gi at the s1 saddle, which lies on the inversion contour,\nas a function of β. This profile was chosen because from figure 11(a) we know that this\nprofile, with β = 1\/2, has an absolute instability with W = 0. We see that increasing\nβ enhances the absolute instability up to β = 0.658, while reducing β only stabilizes\nthe absolute instability and when β = 0.440 the absolute instability has vanished and\nthe flow is only convectively unstable. Here, setting W = 0.01 (result 2) does increase\n14 M. R. Turner, J. J. Healey, S. S. Sazhin and R. Piazzesi\nFigure 13. Plot of the normalized data from table 1 with the profile 1 approximations.\nthe range of β for which there is an absolute instability, but only slightly, and it also\nshifts the position of the maximum absolute instability to a smaller value of β. Figure\n12(b) shows that absolute instabilities in jets with q < 1 tend to only occur for values\nof β . 0.7 when δ1 = δ2 = 0.8. Therefore for the CFD profiles from figure 2(a) that we\nconsider in §4, we may not encounter an absolute instability. However this study is still\nsignificant to other jets where β might be less than 0.7 due to the physical properties of\nthe fluids being considered.\nWe have now extended the study of the stability properties of a steady planar jet and\nidentified some new phenomena associated with the inclusion of the shear layer at the\njet edge. In the next section we use these results to help to explain the experimental jet\nbreak up results seen in figure 1.\n4. Break–up length calculations\nIn this section we use the stability results from §3 to estimate break–up lengths of\nliquid jets. Experiments, such as those by Hiroyasu et al. (1982), show that a liquid jet\ninjected from a nozzle has a break–up length which increases for small injection velocities,\nreaches a maximum value, and then levels off for large velocities, see figure 13 from their\nstudy or figure 1 of this study. The jets in these experiments were axisymmetric water jets\ninjected into pressurized nitrogen, where the injection process was long enough to justify\nour assumption that the jets are essentially steady, and so our steady theory can be used\nto explain the results. The proposed model in this paper includes several undetermined\nparameters intended to model physical effects beyond the scope of the present study, such\nas the role of nonlinearity in break up. In principle, improved quantitative agreement\ncould be sought through empirically adjusting the parameters to fit the data better, but\nthis is not the approach we have taken nor is that the goal of this research, our intention is\nto obtain a qualitative understanding of the important physical processes. This limitation\nof our goal is partly related to the fact that Hiroyasu et al. (1982) considered axisymmetric\njets while our model was developed for planar jets.\nWe examine how the parameters used in §3 affect the jet break–up length by studying\nfour different profiles. Before discussing the profiles we first need to relate the parameters\nδ1, δ2 and β to the maximal velocity V of the jet. By considering the CFD results in\nfigure 2 we can estimate these parameters.By considering these parameters in figure 13\nwe can see that δ1 has the approximate form\nδ1 = δ∞ + δ′V −1\/2, (4.1)\nto leading order, where δ′ + δ∞ is the non–dimensional thickness of the shear layer of\nthe jet when V = 1 and δ∞ is the thickness of the shear layer in the limit V →∞. This\nresult also agrees with the experimental results of Marmottant & Villermaux (2004)\nwho plot the velocity profiles of an air jet injected into static air and again find that\nthe shear layer in the jet is proportional to V −1\/2. The variation of β with V is much\nsmaller than for δ1, however it still increases with increasing V , and this variation has\nan effect on the break–up length calculations. We fix the parameter δ2 with respect to\nV , as this is approximately true for the CFD calculations. Note here that as V is varied\nthe parameters that depend upon V are also varied, such as the surface tension effects,\nwhich appear as W\/V 2 in the dispersion relation (2.3).\nStability analysis and break–up length calculations for steady planar liquid jets. 15\nMax velocity β δ1 δ2\n(ms−1)\n44 0.48 0.85 0.27\n81 0.49 0.77 0.26\n182 0.56 0.60 0.24\n340 0.63 0.44 0.23\nTable 1. The approximate values of δ1, δ2 and β for the CFD simulations shown in figure 2(a).\n(a) (b) (c) (d)\nFigure 14. Plot of velocity profiles 1–4 in panels (a)–(d) at V = 1, 5 and 10. The dotted line\nindicates the fluid interface.\nThe four profiles we examine in this section are the following\nProfile 1 : δ1 = 0.2 + 0.75V\n−1\/2, δ2 = 0.26, β = 0.75− 0.35V −1\/2,\nProfile 2 : δ1 = δ2 = 0.2 + 0.75V\n−1\/2, β = 0.5,\nProfile 3 : δ1 = 0.2 + 0.75V\n−1\/2, δ2 = 0.26, β = 0.5,\nProfile 4 : δ1 = 0.8(1− β), δ2 = 0.8β, β = 0.75− 0.35V −1\/2,\nProfile 1 gives a profile the parameters δ1, δ2 and β which fit the table 1 data. The values\nin table 1 are estimated at the dotted fluid interface in figure 2 and then profile 1 is\ngenerated by fitting curves through the data, as shown in figure 13. Note that we have\nnon–dimensionalised the data in table 1 by the velocity of the slowest jet. A different\nnon–dimensionalisation would have lead to different functions δ1, δ2 and β. Profiles 2–4\npull out particular characteristics from profile 1, so that their individual effects on the\nbreak–up length can be investigated. Profile 2 fixes the value of β, and allows both δ1\nand δ2 to thin with V , highlighting the effect of reducing δ1 in the small q limit where the\neffect of δ2 is small (see figure 6(b)). Profile 3 is like profile 2, but now we fix δ2 = 0.26 so\nthat comparisons with profile 2 will show how variations in δ2 affect the break–up length\nfor q close to unity, where this effect is significant. Also this profile shows the effect of\nfixing β when compared to profile 1. Profile 4 allows us to investigate the effect of allowing\nβ to increase on the break–up length by fixing the shear layer profile and increasing β\nwith V . One point to note is that profiles 1–4 have been chosen to approximately coincide\nin the V → ∞ limit, and plots of each profile at V = 1, 5 and 10 can be seen in figure\n14.\nThe actual break–up length calculation is not a stability problem, it is a transition\nproblem, where we wish to calculate the position at which the initial disturbance from\nthe nozzle has reached some threshold amplitude where the disturbance can no longer be\nassumed to be a linear perturbation to the basic jet velocity and nonlinear effects occur.\nWe are concerned with calculating the disturbance amplitude relative to a range of basic\nflow velocities, so we expect that the quantity |vˆ|max\/|V | will be relevant in estimating\nthe position when nonlinearity starts to dominate, and we assume further that this will\nbe a pre–cursor to rapid jet break–up. The subscript max above means maximising over\nthe y direction. This ratio was studied by Shen (1961) who used it in unsteady flows\nto determine whether or not the flow was instantaneously stable or unstable. Therefore\nwe calculate when the ratio |vˆ|max\/|V | reaches some critical value and we say that at\n16 M. R. Turner, J. J. Healey, S. S. Sazhin and R. Piazzesi\nFigure 15. Schematic diagram of the x− t plane showing the definition of the break–up\nlength xb, the corresponding break–up time tb and the initial break–up time tˆb.\n(a) (b)\nFigure 16. Plot of (a) 1– xb(V ) for (q,W ) = (1\/500, 0), 2– xb(V ) for (1\/10, 0) and 3– xb(V )\nfor (1\/2, 0) all for profile 1. Panel (b) replots results 1 and 2 of panel (a), and the primes denote\nthe corresponding results with W = 0.01.\nthis point break up has occurred. It is equally possible to consider the ratio of the\nstreamwise disturbance velocity and the basic velocity |uˆ|max\/|V | or the ratio of the\ndisturbance kinetic energy to the base flow kinetic energy, but this would just correspond\nto choosing a different critical threshold value. The threshold amplitude is unknown; we\nhave chosen |vˆb|max\/|V | = 40v˜0 in this paper where |vˆb|max is the disturbance amplitude\nthat triggers jet break up and v˜0 = |v0|max\/|V | is the initial disturbance amplitude\nratio. Thus we assume the initial amplitude of the eigenfunction grows linearly with\n|V |. It may turn out that this is not the case, and in general |v0|max = f(|V |) for some\nfunction f , however there is no experimental evidence to determine this function, and\nso fixing |v0|max\/|V | reduces the number of parameters we have to consider, as well as\nbeing a sensible assumption, as the initial disturbance amplitude is likely to increase\nwith jet velocity. A 40 fold amplification of the eigenmode may not be the correct value\nfor break–up, but changing this value will only have a quantitative effect on the results\npresented in this section, and the overall trend of the results will be the same. Typically\nthe amplification factor is a function of q, but we fix it in this study as we are only\nseeking qualitative agreement with experiments.\nUnder these assumptions, the ratio of the initial disturbance amplitude, |v0|max, to the\namplitude of the jet at break–up along the characteristic x\/t = C = constant is found\nfrom the method of steepest descent to be the solution of\n|vˆb|max\n|V | =\n|v0|max\n|V |[tb(C)|∂2g\/∂α2|x\/t=C ]1\/2\nexp (gi(C)tb(C)) , (4.2)\nwhere tb(C) is the time of break–up along the particular characteristic C and v0(y) is\nthe corresponding initial disturbance eigenfunction at the saddle point corresponding to\nx\/t = C, whose magnitude can be adjusted. Then for a steady jet the break–up length\nalong the characteristic x\/t = C is given by the following formula:\nxs,vb (C) =\n∂ω\n∂α\n∣∣∣∣\nx\/t=C\nts,vb (C) = Ct\ns,v\nb (C), (4.3)\nwhere ∂ω\/∂α evaluated at the dominant saddle point on x\/t = C is equal to C. The\nsuperscript s or v signifies whether this is the break–up length is for the sinuous or\nvaricose mode. The actual break–up length xb is then taken to be the min(x\ns\nb, x\nv\nb ) over\nevery characteristic x\/t = C with gi(C) > 0. A schematic diagram of the x − t plane\ndefining xb and tb is given in figure 15.\nIn figure 16(a) we see that xb(V ) for q = 1\/500 (result 1) shows an increase in value\nfor small V before decreasing as V continues to increase. In these results the break–up\nlength is dominated by the sinuous modes of the jet. As q is increased to q = 1\/10 (result\n2) we see a similar structure as for q = 1\/500, except now the overall break–up length is\nreduced. When these results are compared to the experimental results in figure 1 (or figure\n13 of Hiroyasu et al. (1982)), we see qualitative agreement. The results in Hiroyasu et al.\n(1982) were plotted for various gas pressures Pa into which the fluid is injected. Increasing\nPa corresponds to increasing q, and the results in figure 13 of Hiroyasu et al. (1982)\nStability analysis and break–up length calculations for steady planar liquid jets. 17\n(a) (b)\nFigure 17. Plot of (a) 1– xb(V ) for profile 2 and 2– xb(V ) for profile 4 for (q,W ) = (1\/500, 0).\nPanel (b) shows 1– xb(V ) for profile 2, 2– xb(V ) for profile 4 and 3– xb(V ) for profile 3 for\n(1\/2, 0).\n(a) (b)\nFigure 18. Plot of (a) the value of x\/t along which break up occurs for the sinuous mode of\nprofile 2 for 1– (1\/500, 0) and 3– (1\/2, 0). Results 2 and 4 give the corresponding characteristics\nfor the maximum value of the growth rate. Panel (b) plots the x− t plane for the sinuous mode\nof result 1 figure 16(a) at V = 1. The curve gives the contour along which |vˆ|\/|V | = |vˆb|\/|V |,\nwhile the solid straight lines give the edges of the wavepacket. The dotted lines give the values\nof xb and the initial time of break up tˆb..\ncorrespond to q = 1\/1000, 1\/100, 1\/30 and 1\/25 from top to bottom respectively. In\nfigure 16(a), the q = 1\/2 result shows a slightly different behaviour, with xb(V ) reducing\nand leveling off as V increases. The main reason for this is because the parameters δ1, δ2\nand β are actually functions of q as well as V , so a jet with q = 1\/2 may have a different\nprofile than that given by profile 1. However we have ignored this extra complication in\nthis study for simplicity.\nFigure 16(b) replots the q = 1\/500 and q = 1\/10 results of figure 16(a) and includes the\ncorresponding results with W = 0.01 denoted by primes. For both results the inclusion\nof surface tension stabilizes the flow and causes the break–up length to increase, also the\nincrease in xb for small V is removed. Note that as V is increased the effect of surface\ntension decreases and the W 6= 0 results tend to the W = 0 results rapidly, due to surface\ntension occurring as W\/V 2 in the dispersion relation (2.3). The surface tension from the\nexperiments of Hiroyasu et al. (1982) is O(10−4), so the surface tensions we consider here\nare larger than the experiments.\nIn figure 17 we plot xb(V ) for profiles 2–4 with (a) (q,W ) = (1\/500, 0) and (b) (1\/2, 0).\nIn panel (a) the results for profile 3 are not plotted as they cannot be distinguished from\nthe profile 2 results for this value of q. This confirms the unimportance of the value of δ2\nat this particular density ratio. For curve 1 in figure 17(a), we already know that thinning\nthe shear layer δ1 causes the maximum growth rate to increase (see figure 5) which itself\ncauses the break–up length to reduce as a function of V . For this value of q, the value\nof x\/t along which break–up occurs is within 5% of the characteristic along which gi is\nmaximum, see figure 18(a). However, increasing the fluid velocity at the fluid interface\n(profile 4, curve 2) in figure 17(a) causes the break–up length to increase slightly at small\nvalues of V before remaining approximately constant over the rest of the range. This is\ndue to the maximum growth rate reducing as β increases (see figure 8). In figure 17(b)\nfor q = 1\/2 we see similar results for profile 2 (curve 1) and profile 4 (curve 2), but now\nbreak up occurs along characteristics further away from the characteristic along which gi\nis maximum with approximately 8% difference in characteristic values (see figure 18(a)).\nTherefore we cannot just examine how the maximum growth rate varies with V to give\nan indication of how xb will vary. These differences can also be seen in the x − t plot\nof figure 18(b) for the q = 1\/500 result from figure 16(a). Here we plot the contour at\nthe edges of the wavepacket and the contour where |vˆ|\/|V | = |vˆb|\/|V | to show where\nbreak–up occurs. We can see the clear difference between the break–up lengths given by\nxb and the position where break up first occurs. In figure 17(b) we plot xb for profile\n3, and see that unlike for q = 1\/500 the results are qualitatively different than those of\nprofile 2. Here there is an increase in xb initially before leveling off for larger velocities,\ntherefore at this density ratio the shear layer in the lighter fluid is significant.\nIn this section we have shown qualitative agreement between our theoretical predictions\n18 M. R. Turner, J. J. Healey, S. S. Sazhin and R. Piazzesi\nand the experimental results of Hiroyasu et al. (1982), including a possible explanation\nof the turning point behaviour in xb(V ) that can arise at some parameter combinations.\nWe have demonstrated that the turning point can occur even when W = 0, so this\nbehaviour is not a surface tension effect. However the current results need to be extended\nto axisymmetric jets to fully confirm this.\n5. Conclusions and discussion\nIn this paper we have used a spatio–temporal stability analysis to examine the linear\nstability of a steady two–dimensional planar liquid jet which has a shear layer in both\nthe inner and outer fluid. Using a piecewise linear velocity profile we showed that for two\nfluids with a density ratio q = 1\/500 (which corresponds approximately to cold Diesel\nfuel injecting into compressed air at 5 atmospheres) the important characteristic of the\nvelocity profile was the size of the shear layer in the denser fluid, as this had the largest\neffect on the growth rate of disturbances. The width of the shear layer in the less dense\nfluid on the other hand made no significant contribution at this value of q. However as\nthe density ratio of the two fluids was increased the width of the second shear layer\ncontributed more significantly to the stability properties of the jet, and consequently\nthe break–up length properties. Surface tension was found to stabilize the convective\nstability properties of the jet by reducing the maximum growth rate value for a given\nvelocity profile.\nWe investigated the effect of thickening the liquid shear layer on the absolute instability\nof the jet, and found that the finite shear layer produces an absolute instability in jets with\nsmaller values of the density parameter than was found in the work of Juniper (2006) who\nconsidered only infinitely thin shear layers. Juniper (2006) found that absolute instability\noccurs for q & 1.25, while we have shown that an absolute instability occurs for at least\nq > 0.5. Therefore, the structure of the shear layer is important in these type of problems.\nThe work in the present paper also found that increasing the fluid velocity at the fluid\ninterface within the shear layer of the jet can destabilize the absolute instability but\nultimately the flow is convectively unstable for the values of β observed in our CFD\ncalculations (where β is the ratio of the fluid velocity at the interface to the maximum\nvelocity). In the case of absolute instabilities, surface tension was found to act as a\ndestabilizing effect in agreement with the work of Lin & Lian (1989).\nUsing the spatio–temporal analysis we have been able to demonstrate that the break–\nup length of a jet reduces as the shear layer in the jet thins, while the break–up length\nincreases as the magnitude of the fluid velocity at the fluid interface increases. By com-\nbining these two effects into a profile which describes more accurately what occurs in\na real jet, we have been able to produce qualitative agreement with the experiments of\nHiroyasu et al. (1982).\nWe note that in the axisymmetric jet case, surface tension has a destabilizing role at\nsmall jet velocities because it can trigger the pinch off of drops of radius comparable\nto the radius of the jet, so this may also act to reduce break–up lengths at small jet\nvelocities, but this may not be an important mechanism at parameters relevant to fuel\ninjection. When extending this work to axisymmetric jets we also have to be aware that\nthe wave with zero azimuthal wavenumber behaves like the varicose mode of the planar\njet case and is destabilized by surface tension, so some differences in the the results may\nbe observed (Juniper 2008). This however is beyond the scope of the present paper.\nThe authors would like to thank Cyril Crua for supplying the experimental data for the\nCFD simulations. This work is supported by the EPSRC under grants EP\/F069855\/1,\nStability analysis and break–up length calculations for steady planar liquid jets. 19\nEP\/G000034\/1 and EP\/F058276\/1. We would also like to thank the anonymous referees\nwhose comments led to an improved version of this paper.\nAppendix A. The dispersion relation\nThe dispersion relation in §2 has the form\ncˆ4ω\n4 + cˆ3ω\n3 + cˆ2ω\n2 + cˆ1ω + cˆ0 = 0\nwhere\ncˆ4 = −c3,\ncˆ3 = βαV c3 − c2,\ncˆ2 = βαV c2 − c1 − T3(T 21 − 1)(1 + T2)(T3 − 1)Wα4,\ncˆ1 = βαV c1 − c0 −\n[\nβV\nδ2\nT3(T2 − T3)(T 21 − 1)\n+ (1 + T2)(T3 − 1)\n(\n(1− β)V T 21\nδ1\n− T3\n(\nαV (T 21 − 1) +\n(1− β)V T1\nδ1\n))]\nWα4,\ncˆ0 = βαV c0 − βV\nδ2\n(T2 − T3)\n[\n(1− β)V T 21\nδ1\n− T3\n(\nαV (T 21 − 1) +\n(1− β)V T1\nδ1\n)]\nWα4,\nwith\nc3 = −(T 21 − 1)(1 + T2)(T3 − 1)(qT3 + 1),\nc2 = (1 + T2)(qT3 + 1)(T3 − 1)\n(\n(1 + β)αV (T 21 − 1) +\n(1− β)V T1\nδ1\n)\n+\nβV\nδ2\n(T 21 − 1)\n(\nT3(1− q)− T2(1− qT 23 )\n)\n+\n(1− β)V T 21\nδ1\n(1 + T2)(T3 + q)(1− T3)\n+ V\n(\n(1− β)\nδ1\n− βq\nδ2\n)\n(T 21 − 1)(1 + T2)T3(T3 − 1),\nc1 = βαV\n[\n(1 + T2)(qT3 + 1)(1− T3)\n(\nαV (T 21 − 1) +\n(1− β)V T1\nδ1\n)\n+\nβV\nδ2\n(T 21 − 1)(T2(1− qT 23 )− T3(1− q)) +\n(1− β)V T 21\nδ1\n(1 + T2)(T3 − 1)(T3 + q)\n]\n+\nβV\nδ2\n(\nαV (T 21 − 1) +\n(1− β)V T1\nδ1\n)\n(T2(1− qT 23 )− T3(1− q))\n+\nβ(1− β)V 2T 21\nδ1δ2\n(T 23 − q − T2T3(1− q))\n+ V\n(\n(1− β)\nδ1\n− βq\nδ2\n)[\n(1 + T2)T3(1− T3)\n(\nαV (T 21 − 1) +\n(1− β)V T1\nδ1\n)\n+\nβV T3\nδ2\n(T 21 − 1)(T2 − T3) +\n(1− β)V T 21\nδ1\n(1 + T2)(T3 − 1)\n]\n,\nc0 = βαV\n[\nβV\nδ2\n(\nαV (T 21 − 1) +\n(1− β)V T1\nδ1\n)\n(T3(1− q)− T2(1− qT 23 ))\n+\nβ(1− β)V 2T 21\nδ1δ2\n(T2T3(1− q)− T 23 + q)\n]\n+\nβV 2\nδ2\n(\n(1− β)\nδ1\n− βq\nδ2\n)\n(T3 − T2)\n(\nT3\n(\nαV (T 21 − 1) +\n(1− β)V T1\nδ1\n)\n− (1− β)V T\n2\n1\nδ1\n)\n,\n20 M. R. Turner, J. J. Healey, S. S. Sazhin and R. Piazzesi\nfor varicose modes and\ncˆ4 = −c3,\ncˆ3 = βαV c3 − c2,\ncˆ2 = βαV c2 − c1 − (T 21 − 1)(1 + T2)(T3 − 1)Wα4,\ncˆ1 = βαV c1 − c0 +\n[\nβV\nδ2\n(T2 − T3)(T 21 − 1)\n− (1 + T2)(T3 − 1)\n(\nαV (T 21 − 1)−\n(1− β)V\nδ1\n(T1 − T3)\n)]\nWα4,\ncˆ0 = βαV c0 +\nβV\nδ2\n(T3 − T2)\n[\nαV (T 21 − 1)−\n(1− β)V\nδ1\n(T1 − T3)\n]\nWα4,\nwith\nc3 = (T\n2\n1 − 1)(1 + T2)(T3 − 1)(T3 + q),\nc2 = (1 + T2)(T3 + q)(1− T3)\n(\n(1 + β)αV (T 21 − 1)−\n(1− β)V T1\nδ1\n)\n+\nβV\nδ2\n(T 21 − 1)\n(\nT2T3(1− q)− T 23 + q\n)\n+\n(1− β)V\nδ1\n(1 + T2)(qT3 + 1)(1− T3)\n+ V\n(\n(1− β)\nδ1\n− βq\nδ2\n)\n(T 21 − 1)(1 + T2)(1− T3),\nc1 = βαV\n[\n(1 + T2)(T3 + q)(T3 − 1)\n(\nαV (T 21 − 1)−\n(1− β)V T1\nδ1\n)\n+\nβV\nδ2\n(T 21 − 1)(T 23 − q − T2T3(1− q)) +\n(1− β)V\nδ1\n(1 + T2)(T3 − 1)(qT3 + 1)\n]\n+\nβV\nδ2\n(\nαV (T 21 − 1)−\n(1− β)V T1\nδ1\n)\n(T 23 − q − T2T3(1− q))\n+\nβ(1− β)V 2\nδ1δ2\n(T3(1− q) + T2(qT 23 − 1))\n+ V\n(\n(1− β)\nδ1\n− βq\nδ2\n)[\n(1 + T2)(T3 − 1)\n(\nαV (T 21 − 1)−\n(1− β)V T1\nδ1\n)\n+\nβV\nδ2\n(T 21 − 1)(T3 − T2) +\n(1− β)V T3\nδ1\n(1 + T2)(T3 − 1)\n]\n,\nc0 = βαV\n[\nβV\nδ2\n(\nαV (T 21 − 1)−\n(1− β)V T1\nδ1\n)\n(T2T3(1− q)− T 23 + q)\n+\nβ(1− β)V 2\nδ1δ2\n(T2(1− qT 23 )− T3(1− q))\n]\n+\nβV 2\nδ2\n(\n(1− β)\nδ1\n− βq\nδ2\n)\n(T2 − T3)\n(\nαV (T 21 − 1)−\n(1− β)V\nδ1\n(T1 − T3)\n)\n,\nfor sinuous modes, where T1 = tanh(α(L − δ1)), T2 = tanh(α(L + δ2)), T3 = tanh(αL)\nand q = ρ2\/ρ1.\nREFERENCES\nArcoumanis, C., Gavaises, M., Flora, H. & Roth, H. 2001 Visualisation of cavitation in\ndiesel engine injectors. Mec. Ind. 2, 375–381.\nStability analysis and break–up length calculations for steady planar liquid jets. 21\nBatchelor, G. K. & Gill, A. E. 1962 Analysis of the stability of axisymmetric jets. J. Fluid\nMech. 14, 529–551.\nBriggs, R. J. 1964 Electron–Stream Interaction with Plasmas. MIT Press.\nChomaz, J. M., Huerre, P. & Redekopp, L. G. 1987 Models of hydrodynamic resonances\nin separated shear flows. In:Proc. 6th Symp. on Turbulent Shear Flows. Toulouse, France\n(ed. M. Hoffmeister). Springer pp. 321–326.\nCrua, C. 2002 Combustion processes in a diesel engine. PhD Thesis, University of Brighton,\nBrighton, United Kingdom .\nDomann, R. & Hardalupas, Y. 2004 Breakup model for accelerating liquid jets. Proceedings\nof 42nd AIAA Aerospace Science Meeting and Exhibition, Reno, Nevada, Paper AIAA–\n2004–1155 .\nDrazin, P. G. & Reid, W. H. 1981 Hydrodynamic Stability . Cambridge University Press.\nEggers, J. & Villermaux, E. 2008 Physics of liquid jets. Rep. Prog. Phys. 71, 036601–1–79.\nEsch, R. E. 1957 The instability of a shear layer between two parallel streams. J. Fluid Mech\n3, 289–303.\nFerziger, J. H. & Peric, F. M. 2004 Computational Methods for Fluid Dynamics, Third ed..\nSpringer (Berlin).\nFunada, T., Joseph, D. D. & Yamashita, S. 2004 Stability of a liquid jet into incompressible\ngases and liquids. Int. J. Multiphase Flow 30, 1279–1310.\nHagerty, W. W. & Shea, J. F. 1955 A study of the stability of plane fluid sheets. J. Appl.\nMech. 22, 509–514.\nHashimoto, H. & Suzuki, T. 1991 Experimental and theoretical study of fine interfacial waves\non thin liquid sheet. JSME Int. J. Series II 34 (3), 277–283.\nHealey, J. J. 2006 A new convective instability of the rotating-disk boundary layer with growth\nnormal to the disk. J. Fluid Mech. 560, 279–310.\nHealey, J. J. 2007 Enhancing the absolute instability of a boundary layer by adding a far-away\nplate. J. Fluid Mech. 579, 29–61.\nHealey, J. J. 2009 Destabilizing effects of confinement on homogeneous mixing layers. J. Fluid\nMech. 623, 241–271.\nHeurre, P. & Monkewitz, P. A. 1990 Local and global instabilities in spatially developing\nflows. A. Rev. Fluid Mech. 22, 473–537.\nHeywood, J. B. 1998 Internal combustion engine fundamentals. McGraw–Hill (Singapore).\nHinch, E. J. 1991 Perturbation Methods. Cambridge University Press.\nHiroyasu, H., Shimizu, M. & Arai, M. 1982 The break–up of high speed jet in a high pressure\ngaseous atmosphere. Proc. 2nd Int. Conf. on Liquid Atomization and Spray Systems pp.\n69–74.\nHuerre, P. 2000 Open shear flow instabilities. In Perspectives in Fluid Dynamics: A Collective\nIntroduction to Current Research (ed. G. K. Batchelor, H. K. Moffat and M. G. Worster)..\nCambridge University Press.\nJuniper, M. P. 2006 The effect of confinement on the stability of two-dimensional shear flows.\nJ. Fluid Mech. 565, 171–195.\nJuniper, M. P. 2007 The full impulse response of two-dimensional jet\/wake flows and implica-\ntions for confinement. J. Fluid Mech. 590, 163–185.\nJuniper, M. P. 2008 The effect of confinement on the stability of non-swirling round jet\/wake\nflows. J. Fluid Mech. 605, 227–252.\nKarimi, K. 2007 Characterisation of multiple–injection diesel sprays at elevated pressures and\ntemperatures. PhD Thesis, University of Brighton, Brighton, United Kingdom .\nLesshafft, L. & Huerre, P. 2007 Linear impulse response in hot round jets. Phys. Fluids 19,\n024102.\nLi, X. & Tankin, R. R. 1991 On the temporal stability of a two–dimensional viscous liquid\nsheet. J. Fluid Mech 226, 425–443.\nLin, S. P. & Lian, Z. W. 1989 Absolute instability of a liquid jet in a gas. Phys. Fluids 1 (3),\n490–493.\nLin, S. P., Lian, Z. W. & Creighton, B. J. 1990 Absolute and convective instability of a\nliquid sheet. J. Fluid Mech 220, 673–689.\nLord Rayleigh 1894 The theory of sound, 2nd edn. Macmillian (London).\n22 M. R. Turner, J. J. Healey, S. S. Sazhin and R. Piazzesi\nMarmottant, P. & Villermaux, E. 2004 On spray formation. J. Fluid Mech. 498, 73–111.\nMonkewitz, P. A. & Sohn, K. D. 1988 Absolute instability in hot jets. AIAA Journal 26,\n911–916.\nRaynal, L., Harion, J.-L., Favre-Marinet, M. & Binder, G. 1996 The oscillatory insta-\nbility of plane variable–density jets. Phys. Fluids 8, 993–1006.\nRees, S. J. & Juniper, M. P. 2009 The effect of surface tension on the stability of unconfined\nand confined planar jets and wakes. J. Fluid Mech. 633, 71–97.\nRees, S. J. & Juniper, M. P. 2010 The effect of confinement on the stability of viscous planar\njets and wakes. J. Fluid Mech. 656, 309–336.\nSazhin, S. S., Crua, C., Kennaird, D. A. & Heikal, M. R. 2003 The initial stage of fuel\nspray penetration. Fuel 82 (8), 875–885.\nSazhin, S. S., Martynov, S. B., Kristyadi, T., Crua, C. & Heikal, M. R. 2008 Diesel\nfuel spray penetration, heating, evaporation and ignition: modelling vs. experimentation.\nInt. J. Engineering Systems Modelling and Simulation 1 (1), 1–19.\nSchmid, P. J. & Henningson, D. S. 2001 Stability and transition in shear flows. Springer\n(New York).\nShen, S. F. 1961 Some considerations on the laminar stability of time-dependent basic flows.\nJ. Aerospace Sci. 28, 397–404, 417.\nSo¨derberg, L. D. 2003 Absolute and convective instability of a relaxational plane liquid jet.\nJ. Fluid Mech. 493, 89–119.\nSo¨derberg, L. D. & Alfredsson, P. H. 1998 Experimental and theoretical stability investi-\ngations of plane liquid jets. Eur. J. Mech B\/Fluids 17, 689–737.\nSreenivasan, K. R., Raghu, S. & Kyle, D. 1989 Absolute instability in variable density\nround jets. Exp. Fluids 7, 309–317.\nSrinivasan, V., Hallberg, M. P. & Strykowski, P. J. 2010 Viscous linear stability of\naxisymmetric low–density jets: Parameters influencing absolute instability. Phys. Fluids\n22, 024103.\nStone, R. 1992 Introduction to internal combustion engines. MacMillan (New York).\nYoungs, D. L. 1982 Time–dependent multi–material flow with large fluid distortion. In Numer-\nical methods for fluid dynamics (ed. K. W. Morton and M. J. Baines). Academic Press.\nYu, M. H. & Monkewitz, P. A. 1990 The effect of non–uniform density on the absolute\ninstability of planar inertial jets and wakes. Phys. Fluids A 2 (7), 1175–1181.\n"}