{"doi":"10.1504\/IJESB.2010.032402","coreId":"15483","oai":"oai:dro.dur.ac.uk.OAI2:7149","identifiers":["oai:dro.dur.ac.uk.OAI2:7149","10.1504\/IJESB.2010.032402"],"title":"Brand(ing) kinmen : a tourism perspective.\\ud","authors":["Zhang, J. J."],"enrichments":{"references":[],"documentType":{"type":0.5555555556}},"contributors":[],"datePublished":"2010-01-01","abstract":"The recent proliferation of academic works on 'place branding' has led to a burgeoning interest in 'island branding'. This paper posits that islands are geographical features that possess unique characteristics and experience distinctive circumstances and, thus, deserve to be analysed on their own terms. In particular, it explores the intricacies in the branding of Kinmen Island, Taiwan, as a battlefield tourism destination. This case study confronts the typical island lure – of sun, sand and sea – and creates an opportunity for some distinct positioning in the global tourism market. The discussion shows the importance for tourism planners to recognise the unique character of the island to localise development projects in terms of its geographical particularity and landscape identity. Furthermore, it is argued that the branding of Kinmen is not merely a top-down process; the Kinmen brand is a result of both top-down 'imagineering' efforts by the state and the bottom-up branding practices of local entrepreneurs, Kinmen's people and tourists. It is believed that tourists' identification of an island has to be substantiated by locals' self-recognition with the island's identity to sustain any branding effort.\\ud\n\\ud\n \\ud\n\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15483.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7149\/1\/7149.pdf","pdfHashValue":"d84924a11080569250d7a1fdf8fc678df6a466dc","publisher":"Inderscience","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7149<\/identifier><datestamp>\n      2010-08-02T11:06:38Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Brand(ing) kinmen : a tourism perspective.\\ud\n<\/dc:title><dc:creator>\n        Zhang, J. J. <\/dc:creator><dc:description>\n        The recent proliferation of academic works on 'place branding' has led to a burgeoning interest in 'island branding'. This paper posits that islands are geographical features that possess unique characteristics and experience distinctive circumstances and, thus, deserve to be analysed on their own terms. In particular, it explores the intricacies in the branding of Kinmen Island, Taiwan, as a battlefield tourism destination. This case study confronts the typical island lure – of sun, sand and sea – and creates an opportunity for some distinct positioning in the global tourism market. The discussion shows the importance for tourism planners to recognise the unique character of the island to localise development projects in terms of its geographical particularity and landscape identity. Furthermore, it is argued that the branding of Kinmen is not merely a top-down process; the Kinmen brand is a result of both top-down 'imagineering' efforts by the state and the bottom-up branding practices of local entrepreneurs, Kinmen's people and tourists. It is believed that tourists' identification of an island has to be substantiated by locals' self-recognition with the island's identity to sustain any branding effort.\\ud\n\\ud\n \\ud\n\\ud\n<\/dc:description><dc:subject>\n        Island brands<\/dc:subject><dc:subject>\n         Branding<\/dc:subject><dc:subject>\n         Islands<\/dc:subject><dc:subject>\n         Battlefield tourism<\/dc:subject><dc:subject>\n         Local entrepreneurs<\/dc:subject><dc:subject>\n         Entrepreneurship<\/dc:subject><dc:subject>\n         Tourism planning<\/dc:subject><dc:subject>\n         Landscape identity<\/dc:subject><dc:subject>\n         Place experience<\/dc:subject><dc:subject>\n         Post-Cold War Taiwan<\/dc:subject><dc:subject>\n         Kinmen Island.<\/dc:subject><dc:publisher>\n        Inderscience<\/dc:publisher><dc:source>\n        International journal of entrepreneurship and small business, 2010, Vol.9(4), pp.407-433 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2010-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7149<\/dc:identifier><dc:identifier>\n        issn:1476-1297<\/dc:identifier><dc:identifier>\n        issn: 1741-8054  <\/dc:identifier><dc:identifier>\n        doi:10.1504\/IJESB.2010.032402 <\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7149\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1504\/IJESB.2010.032402 <\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7149\/1\/7149.pdf<\/dc:identifier><dc:rights>\n        Copyright © 2010 Inderscience Enterprises Limited.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1476-1297","issn: 1741-8054","1476-1297"," 1741-8054"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Island brands","Branding","Islands","Battlefield tourism","Local entrepreneurs","Entrepreneurship","Tourism planning","Landscape identity","Place experience","Post-Cold War Taiwan","Kinmen Island."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n02 August 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nZhang, J. J. (2010) ’Brand(ing) kinmen : a tourism perspective.’, International journal of entrepreneurship\nand small business., 9 (4). pp. 407-433.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1504\/IJESB.2010.032402\nPublisher’s copyright statement:\nCopyright 2010 Inderscience Enterprises Limited.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nBrand(ing) Kinmen: A Tourism Perspective1 \nJ.J. Zhang \n \nAbstract \nThe recent proliferation of academic works on ‘place branding’ has led to a burgeoning \ninterest in ‘island branding’. This paper posits that islands are geographical features that \npossess unique characteristics and experience distinctive circumstances, and thus deserve \nto be analysed on their own terms. In particular, it explores the intricacies in the branding \nof Kinmen Island, Taiwan, as a battlefield tourism destination. This case study confronts \nthe typical island lure – of sun, sand and sea – and creates an opportunity for some \ndistinct positioning in the global tourism market. Discussion shows the importance for \ntourism planners to recognise the unique character of the island in order to localise \ndevelopment projects in terms of its geographical particularity and landscape identity. \nFurthermore, it is argued that the branding of Kinmen is not merely a top-down process; \nthe Kinmen brand is a result of both top-down ‘imagineering’ efforts by the state and \nbottom-up branding practices by the local entrepreneurs, Kinmen people and tourists. In \nall, it is believed that tourists’ identification of an island has to be substantiated by locals’ \nself-recognition with the island’s identity so as to sustain any branding effort.  \n \nKeywords: island branding; battlefield tourism; local entrepreneur; tourism planning; \nlandscape identity; place experience; post-Cold War Taiwan; Kinmen (Quemoy). \n \n \n \n \nBiographical notes: J. J. Zhang is a PhD research postgraduate at the Department of \nGeography, Durham University. His research interests include tourism geographies and \ncultural geographies of Asia. \n \n \n \n \n \n                                                 \n1\n Zhang, J. J. (2010) 'Brand(ing) Kinmen: a tourism perspective', International Journal of Entrepreneurship \nand Small Business., 9 (4), pp. 407-433. \n 2 \n \n1.  Introduction: Island Brands and Island Branding \n \nThe unbranded state has a difficult time attracting economic and political \nattention. Image and reputation are becoming essential parts of the state’s \nstrategic equity.  \n(Van Ham, 2004: 17; emphasis in original)  \n \nWhile Van Ham might be referring to a particular geographical unit in this instance, he is \nreflecting the wider phenomenon of ‘place branding’. There has been a growing interest \nof late in both the public sector and academic arena with place branding. Branding of \nplaces is seen by country and city governments as a marketing tool to attract investors \nand tourists (Allen, 2007). In this era of globalisation and technological advancement, \ncountries and increasingly, cities, seek to differentiate themselves as they compete \namongst each other to be financial centres and choice locations for foot-loose industries. \nMoreover, as the World Tourism Organisation acknowledges, tourists, with increased \nmobility, are treating tourism destinations as fashion accessories (Morgan et al., 2002) \nthat reflect their self-identities. In a semiotic society, signs and images give meaning to \nconsumption (Baudrillard, 1968), and brands are able to create and transmit them \nefficiently (Freire, 2005). A brand thus goes beyond its original function “to distinguish \nand identify”; it assumes “fetishistic qualities of image and power” as advertisers craft \n“associations, attributes and characterizations designed to induce a psychological \nresponse…” (Donald and Gammack, 2007: 46). It is no wonder that ‘destination \nbranding’ (Morgan et al., 2002) has landed itself such a high priority in the eyes of \ntourism planners.  \n \n It is not the intention of this paper to provide a comprehensive literature review of \nacademic research on place branding. Moreover, Dinnie (2004) and Gould and Skinner \n(2007) have been excellent in capturing the changing approaches and emerging trends in \nthe literature. Nevertheless, it is not difficult to realise that the place branding lexicon \ntypically evolves around the likes of ‘nation branding’ (Anholt, 2004; Gudjonsson, 2005, \n‘city branding’ (Kavaratzis and Ashworth, 2006; Donald and Gammack, 2007), ‘place \nbranding’ (Papadopoulos, 2004; Anholt, 2005), ‘geo-branding’ (Freire, 2005) and \n‘destination branding’ (Morgan et al., 2002). There seems to be a dearth of research that \n 3 \nfocuses on ‘island branding’ per se. Although one may argue that ‘islands’ can be \nsubsumed under ‘place’ or ‘destination’, they are in fact geographical features that \npossess unique characteristics and experience distinctive circumstances (Baldacchino, \n2005). Furthermore, I argue that the word ‘island’ is a brand in its own rights. Mention \n“island tourism”, and images of sun, sand and sea will emerge in one’s mind. Hence, \nislands might be facing the threat of being homogenised in an age of globalisation as \ntourism planners attempt to transform islands into identically manicured beach-resort \nlandscapes for tourists (Zhang, 2007). The challenge then, is for planners to recognise the \nunique character of each island in order to localise development projects in terms of its \ngeographical particularity and landscape identity. As such, islands deserve to be analysed \non their own terms (Baldacchino, 2007) and this is where island branding comes into \nplay. This paper discusses the nuances of island brands and island branding in the context \nof the former military island of Kinmen, Taiwan. Due to the complexity of island \nbranding and its relationship to different audiences, I focus specifically on the tourism \naspect of Kinmen Island.      \n \n2.  Setting the Stage: Kinmen in Context \n \n2.1  Kinmen as a battlefield  \n \nBefore explicating the objectives of this paper, let me foreground the historical events \nthat form the basis of Kinmen’s battlefield identity. Covering an area of 150km2 and a \npopulation of 72,000, Kinmen2 is located 350km southwest of Taipei, Taiwan, but a mere \n10km from the city of Xiamen in the People’s Republic of China (PRC) (Figure 1). The \nisland became a military stronghold of the Kuomintang’s (KMT) Nationalist Army after \nits forces retreated from the mainland during the Civil War with the Chinese Communist \nParty’s (CCP) People’s Liberation Army (PLA) in 1949. Kinmen, together with Matsu \nand a number of other off-shore islands were intended to be “stepping stones”  \n \n \n \n                                                 \n2\n Kinmen is an archipelago consisting of 12 islands. This paper focuses on the 2 main islands, namely ‘Big \nKinmen’ and ‘Little Kinmen’. Unless otherwise stated, ‘Kinmen’ refers to both islands (see Figure 1).  \n 4 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \nfor Chiang Kai-shek’s forces to reclaim the mainland. Initial attempts by the communists \nto capture Kinmen were thwarted by KMT’s victory in the Guningtou Battle on Kinmen \nin late 1949. The onset of the global Cold War and the American doctrine of containment \nfurther acted as a deterrence to the communist’s plans for invasion. However, the First \nand Second Straits Crisis in 1954 and 1958 respectively, saw the PRC engaging Kinmen \nin fierce artillery battles. Intervention by the United States (US) denied the prospect of a \ntake-over. Therefore, the status of Kinmen had and still has symbolic meaning for \nTaiwan in the wider geopolitical context. The involvement of the US in the prevention of \na CCP take-over testifies to the importance of the island’s strategic position as a bastion \nagainst communist threat. Indeed as Chen Chao-Jin, Director General of the County \nGovernment Research and Development Department, stressed, “Without Kinmen, there \nwill be no Taiwan.” (Personal interview, 23 May 2006).   \n \nAs a result of these events, Kinmen became a highly militarised area. Fortresses, \npillboxes and underground tunnels can be found on the island and as much as one-third of \nTaipei\nKinmen\nXiamen\n \n \nFigure 1 Map of Kinmen, Taiwan \n \n(Source: http:\/\/tour.kinmen.gov.tw) \n \n 5 \nTaiwan’s total army was stationed on the island, outnumbering the local population of \n60,000 (Szonyi, 2005).3 Apart from the conscripted soldiers, a militia system had also \nbeen set up whereby civilian villages were transformed into ‘combat villages’ (Chi, \n2004). In 1956, the KMT government introduced the “Experimental Scheme of War Area \nAdministration on Kinmen and Matsu”, which subjected the islands to absolute military \ncontrol (Jinmen xianzhi, 1992, cited in Chi, 2004). In Kinmen, the troops were the main \nconsumer base that sustained the local economy until 1992 when tourism became \nincreasingly important.  \n \n \n2.2  From battlefield to tourist destination  \n \nWith the abolition of martial law in 1992, the gradual de-militarisation and opening up of \nKinmen took shape. This resulted in its evolution from a military outpost to a tourist \ndestination. With the partial withdrawal of troops from the island,4 the economic void left \nbehind by the garrison had to be filled up. Tourism emerged as the lifeline of Kinmen. \nThe military landscape, defence installations and infrastructure were readily utilised for \ntourism development. In addition, according to Yang and Hsing (2001: 78), Kinmen’s \n“culture industries5… have [also] become the potential cultural consumption resources \nthat… [help] long-term … reconstruction and regeneration since the abolition of martial \nlaw”. \n \n Although the majority of tourists are Taiwanese, the establishment of the “mini \nthree links”6 in January 2001 meant that PRC tourists are also allowed to visit Kinmen.7 \nAccording to the Ministry of Transport and Communications, “the transit of people and \ncommodities from Kinmen to China has grown substantially over the past two years since \nthe ‘mini three links’ were established” (The Taiwan Economic News, 7 February 2003). \nThe tourism planners recognise the great potential of the Chinese market and have even \n                                                 \n3\n Although the garrison size was never disclosed, it is estimated at 100,000.   \n4\n It is estimated that the garrison size will be reduced to 5000. \n5\n Apart from war heritage, Kinmen also boasts well preserved traditional houses of South-Min architecture. \nNature tourism has also been promoted recently, especially the 300 bird species found on the island.   \n6\n The three links refer to economic and social links for direct trade, postal and shipping between Kinmen \nand Matsu of Taiwan, and Xiamen and Fuzhou of PRC (The Economist, 6 January 2001).  \n7\n Previously, Kinmen was primarily visited by domestic Taiwanese tourists.   \n 6 \nmade amendments to sensitive captions in the various war museums so as not to offend \nthe PRC tourists. Such efforts to tone down the otherwise hostile attitude towards the \ncommunist regime in China will be discussed in a later section. \n \n In short, tourism is seen as an important activity since the de-militarisation of \nKinmen. Concerted efforts have been and are still being taken to increase tourism arrivals \nand receipts. Therefore it is timely to examine the role of place branding in promoting the \nisland as a battlefield tourism destination.   \n \n \n3.  Objectives, Argument and Method \n \nThe objectives of this study are three-fold. Firstly, I seek to discuss the current efforts by \ntourism planners in establishing a battlefield tourism brand for Kinmen. This is done by \nanalysing how they go about representing the island’s military past both in tourism \npromotion and in (re)-creating the battlefield tourism sites. Secondly, I investigate how \nlocal entrepreneurs’ business innovations and tourists’ behaviour contribute to the \nsustainability of the Kinmen Brand. Lastly, I show that top-down branding efforts by the \ngovernment and bottom-up initiatives by local entrepreneurs, together with tourists’ \nbehaviour are interrelated in a dialectical manner. In other words, the branding of \nKinmen is not merely a top-down process; the Kinmen Brand is a result of both top-down \n‘imagineering’ efforts by the state and bottom-up initiatives by the locals and tourists. \nMoreover, the brand of an island constitutes its identity, and when used for tourism \npromotion, is supposed to conjure up a certain geographical image amongst the tourists. \nThe tourists’ identification of an island has to be substantiated by locals’ self-recognition \nwith the island’s identity so as to sustain any branding effort. It is only with the \nrecognition and participation by the locals that an island’s brand can be sustainable.  \n \n Research data for this paper is garnered from fieldwork conducted in Kinmen \nfrom May to July 2006 and again in December 2006. Respondents were divided into four \ngroups, namely the tourism officials, local entrepreneurs, Kinmen people and tourists. \nSemi-structured in-depth interviews were conducted. A total of ten representatives from \nboth the Kinmen County Government and Kinmen National Park (KMNP), the two main \n 7 \nplanners of Kinmen’s battlefield tourism landscape, were interviewed. Insights were also \nbased on interviews with eight local entrepreneurs, whose business ventures were in one \nway or another related to Kinmen’s battlefield tourism.8 Informal interviews proved to be \nuseful when interacting with local residents. Apart from the practicality of this method, \nthe informal setting made it possible for me to “understand how individual people \nexperience and make sense of their own lives” (Valentine, 2005: 111). Perceptions of the \nKinmen brand could also be gathered during friendly conversations with tourists. For a \nresearch that requires the analysis of brand experience, participant observation proved to \nbe useful. This was mainly conducted at the various war museums, battlefield sites and \nsouvenir shops where the Kinmen brand was created, promoted and experienced.  \n \n \n \n4.  Concepts and Conceptual Framework \n \nIn this exploratory paper, I attempt to conceptualise top-down branding efforts by the \ntourism planners and bottom up branding contributions by the local entrepreneurs, \nKinmen people and tourists in a dialectical manner. Figure 2 presents the conceptual \nframework of this paper. The arrows serve to represent the interaction amongst the \nvarious stakeholders in the creation of the Kinmen battlefield tourism brand. Thus, the \nIsland (Kinmen) Brand is conceptualised not as an end product by itself, but a dynamic \nand fluid imagination being constantly shaped and negotiated by state mandated branding \neffort as well as by locals and tourists.  \n \n \n \n \n \n \n \n \n                                                 \n8\n For example operators of tour agencies and local entrepreneurs producing tourist souvenirs and products.    \n 8 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nThe incorporation of emotion adds another dimension to the discussion as it \naffects the branding process. The study of emotions and feelings in geography is not \nnew.9 However, ‘emotional geography’ is of recent origin. In an influential editorial by \nAnderson and Smith (2001) in the Transactions of the Institute of British Geographers \nentitled “Emotional Geographies”, the authors highlight the importance of emotions in \nmaintaining geography’s critical edge. Similarly, Davidson et al. (2005) edited a \ncollection of essays with the same theme. Observing an ‘emotional turn’ in geography \n                                                 \n9\n Early developments stem from the humanistic and behavioural schools. Tuan (1974) talks about \n‘topophilia’ – the “affective bond between people and place or setting” (p. 4). Attempt to ‘map’ the feelings \nabout the urban environment (Spencer & Dixon, 1983) is also noticed. \nKinmen \nBrand \nT\no\np\n-d\no\nw\nn\n \nb\nra\nn\nd\nin\ng\n \nin\nitia\ntiv\ne\ns\n B\no\ntt\no\nm\n-u\np\n \nb\nr\na\nn\nd\nin\ng\n \np\nr\na\nc\nti\nc\ne\ns\n \n \nTOURISM PLANNERS \n \n \nLOCAL \nENTRPRENEURS; \nKINMEN PEOPLE; \nTOURISTS \n \nFigure 2 Tourist Destination Branding Model \n 9 \nand adopting a ‘spatially engaged approach’ to the study of emotions, the authors \narticulate that:  \n \nA genuine emotional geography cannot just deal in feelings… It must try \nto express something that is ineffable in such objectifying languages, \nnamely a sense of emotional involvement with people and places, rather \nthan emotional detachment from them… An emotional geography, then, \nattempts to understand emotion – experientially and conceptually – in \nterms of its socio-spatial mediation and articulation rather than as entirely \ninteriorised subjective mental states.                \n                                                                      (Davidson et al., 2005:2-3) \n \nIn his paper on “The place of emotions within place”, Urry (2005) makes explicit the \nconnection between the ‘tourist gaze’ and ‘emotional experience of place’. He posits that \n“[e]motions are intimately tied into place…” and “[t]he practice of landscape entails an \nintangible resource”, realised through the “visual consumption of place especially by \nthose ‘touring’” (Urry, 2005: 77). For this paper, I pursue the spatiality of emotions in the \nbranding of Kinmen as a battlefield tourism destination.  \n \nAllen’s (2003) arrangement of the ‘brand experience’ of a place into ‘pre-place \nexperience’, ‘place-experience’, and ‘post-place experience’ (incorporated into the \nTourist Destination Branding Model – Figure 2) provides a temporal-spatial perspective \nfor a more nuanced understanding of the branding process. He espouses that a tourist will \nbe exposed to the brand experience before, during and after the tour. Therefore, branding \ndoes not stay at the promotion level but takes place throughout the entire tour experience. \nAs such, branding efforts by both the tourism planners and the local entrepreneurs are \ndiscussed based on the three phases, with the former being more active and prominent in \nthe first two, and the latter contributing more significantly to the third.  \n \nI will now turn to the branding strategies adopted by the government to transform \nKinmen into a battlefield tourism destination, before shedding light on the contributions \nby local entrepreneurs, Kinmen people and tourists.  \n \n \n 10 \n5.  From Commemoration to Commercialisation \n \nAfter the lifting of martial law in 1992, the ‘Battlefield Military Administration’ was \nreplaced by a civilian county government. Kinmen was opened to tourism in the same \nyear; attracting the first Taiwanese tour groups to the island. A total of 247,264 tourists \nvisited Kinmen in 1993, and this increased two-fold to 531,683 in 1997 (Kinmen \nStatistics, 2006). Tourist arrivals consist mainly of domestic tourists from mainland \nTaiwan (78.5%), with the rest primarily represented by PRC tourists (21.3%) since the \nestablishment of the ‘three mini links’. Several reasons explain why people were attracted \nto Kinmen. As the battlefront of conflicts between PRC and Taiwan, Kinmen was \ninaccessible until 1992. The curious wanted to “see it for themselves” what Kinmen was \nreally like. Retired soldiers who had once served on the island also returned to reminisce \nthe past, usually with the company of family members. After the establishment of the \n‘three mini links’, ferry services between Xiamen and Kinmen became available, and \ntourists from the PRC were keen to explore the “mysterious military bastion” that the \nPLA surprisingly failed to capture. The battlefield landscape that represented a bastion of \nmilitary might and symbol of war, was transformed almost overnight into a battlefield \nlandscape of appeal for tourist consumption.  \n  \n In 1995, KMNP, a subsidiary of the Taiwanese central government’s Ministry of \nInterior, was established and joined ranks with the county government’s tourism bureau \nas official planners of Kinmen’s tourism landscape. Both agencies are referred here as \n‘tourism planners’ as they have been actively involved in the transformation of Kinmen \nfrom a military stronghold to a tourist destination10 Military infrastructure and facilities \nthat were left behind by the shrinking garrison11 were rapidly re-appropriated to become \ntourist attractions. War museums are no longer just a place to commemorate the “heroics” \nof the KMT army, but became tourist attractions and sights of curiosity.  \n                                              \n \n                                                 \n10\n It is beyond the scope of this paper to discuss the possible conflicts between the county government and \nthe central government subsidiary.  \n11\n In line with the de-militarisation of Kinmen, the number of soldiers based on the island has been \nreducing from the initial 100,000 to the target of 5000. \n 11 \n6.  Branding Kinmen: Government’s Initiatives \n \nAccording to Allen (2007: 64), government or quasi-governmental tourism agencies, as \nimportant players within the stakeholder tourism framework, “typically occupy a \nleadership role in constructing the marketing\/ brand framework”. However, this is \napparent for Kinmen only in recent years. I would argue that branding efforts in terms of \nmarketing Kinmen island as a battlefield tourism destination is a phenomenon of late. As \nGao Shu-Zhen, Director of a local tour agency concurs:   \n \nThere is little need to market or brand the place during the early 90s when \nKinmen was opened for tourism. Tourists form Taiwan mainland arrived \nin flocks purely out of curiosity to see for themselves the military bastion \nthat they have long heard of but never been to. \n(Personal interview, 20 June 2006) \n \nNevertheless, a change in the central government’s development strategies for \noff-shore islands leads to renewed interest in the battlefield identity of Kinmen. \nPreviously, a certain amount of development fund was appropriated by the central \ngovernment to an off-shore island according to its population. There was no monitoring \nof fund usage. This led to irresponsible and excessive spending in the construction sector. \nIn 2005, the central government shifted the administration of the off-shore Development \nFund from the Construction Bureau to the Council for Economic Development (Liu, \n2007). An Off-shore Islands Development Fund Office was subsequently set up to study \nthe unique characteristics and identity of each off-shore island, so as to determine its \ndirection of development. For Kinmen, the battlefield image was recognised as the most \nimportant character and this explains the current efforts by tourism planners to develop \nKinmen’s battlefield tourism brand. The ‘pre-place’ branding strategies and ‘place brand \nexperience’ (Allen, 2003) are discussed in the following sections.  \n \n6.1  Pre-place branding strategies  \n \nMcLaren (1998: 27) describes the media as “dream weavers and spin doctors”.  After all, \ntourism is really about discovering or even creating a destination and then packaging and \nmarketing it. Conversely, Dann (1996) argues cogently that tourism can in fact be \n 12 \nconsidered a language. Here, I propose that images of tourist destinations found in the \nmedia constitute an imperative component to the language of tourism. Magnetic and \npowerful images can be compelling enough to fire the imagination and awake the desires \nof people (Cohen, 1982). Such is the utility of pre-place branding. Imaging results in \nlandscapes being promoted and commodified as “touristscapes”. In the case of Kinmen, \nimages of its battlefield landscape appear in brochures (Plate 6.1), travel magazines, \nnewspapers, television commercials, the Internet (Plate 6.2) and even in books and films \n(Plate 6.3). Although appearing in diverse sources, these images only have one objective \n- to communicate to people, and in doing so, entice them to make the journey. Hence, \npotential tourists already possess a pre-place brand experience of battlefield Kinmen even \nbefore they set foot on the island. As Kotler et al. (2001) state, the unique positioning of \nHong Kong as a tourism destination, South Korea as an automotive stronghold and \nTokyo as a financial hub has been well publicised and entrenched through portrayals in \nprint and popular media. This testifies that a product, however unique, requires \ncommunication for strong brand equity to accumulate. \n \nI posit that because imaging is such a forceful art of persuasion, the commonality \nin portrayals of “battlefield” in the popular media serves to shape and construct people’s \nimaginings of Kinmen.  In other words, people are socialized into accepting and \nperpetuating the images of the ‘tourist gaze’ (Urry, 1990). As Urry (1990: 10) highlights, \ntourists are akin to semioticians, “reading the landscape for signifiers of certain pre-\nestablished notions or signs derived from various discourses of travel and tourism”.  \nClearly then, when in contact with such popular media, tourists learn how, where and \nwhat to gaze as the pre-place brand unfolds.  These, I contend, are structured and \nmaintained by the images. Indeed, landscape realities are reinforced by branding. \n \n \n \n \n \n \n \n 13 \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \n \nPlate 6.1 Tourist brochure advertising Kinmen’s battlefield attractions \n(Source: http:\/\/tour.kinmen.gov.tw) \n \n \nPlate 6.2 Website on the latest battlefield attraction – The Kinmen Civil Defence Tunnel \n(Source: http:\/\/tour.kinmen.gov.tw) \n 14 \n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n6.2  The place brand experience \n \nThe branding of Kinmen does not stop at the promotion phase; the Kinmen brand is being \ncontinually created and experienced during the tour itself. As Kotler (2004: 12) argues, \n“Places are more difficult to brand than products. Every place has a history and heritage \nthat will affect its image.” Indeed, Kinmen is no tabula rasa. Like it or not, the \nquintessential identity of the island, lies not in the sun, sand and sea, or even the \naccidental preservation of its ecosystem made possible by minimal anthropogenic \ndisturbance during the martial law period; it is the battlefield heritage that breathes life \ninto the island’s tourism landscape. Therefore, as tourism planners are “confronted by \nincreasing product parity, substitutability, and competition” (Morgan et al., 2002, cited in \nAllen, 2007: 61), branding an island destination in terms of its geographical particularity \nand landscape identity becomes even more pertinent. Moreover, place brands “should \ninclude sensations and psychological traits that enrich the place’s meaning and augment \nthe tourist’s experience” (Freire, 2005: 356). The following sections elucidate such \nexperiential aspects. \n \n \nPlate 6.3 A cinematic representation of the 1958 Artillery Battle (left) and Battlefield \nKinmen in a historical text (right) \n(Source: http:\/\/shopping.pchome.com.tw) \n \n 15 \n6.2.1  Placing memories: Reinforcing the Kinmen Brand in situ  \n \nOne of the strategies adopted by the tourism planners in creating ‘place brand experience’ \n(Allen, 2003) on Kinmen Island is to bring tourists to the actual battle sites. Such \n‘authenticity’ not only appeals to the tourists but also allow the planners to take \nadvantage of the sites’ emotional geographies and “multiple levels of sedimented history” \n(Yeoh and Kong, 1996: 55, cited in Muzaini, 2004: 52). In particular, emotions could be \neffectively invoked when memories of the war years are triggered by the display of war \nrelics or narration of historical events in situ. Visitors “not only think about but also ‘see’ \nthe past” (ibid). Visits to such sites then reinforce the battlefield brand as the relationship \nbetween the place and its “customers” is deepened (Allen, 2007). I shall use the example \nof Guningtou Battle Museum and various war relics to explicate.  \n \nThe Guningtou Battle Museum (Plate 6.4) was built in 1984 to commemorate the \nheroics of the KMT army during the battle of Guningtou in October 1949. The \ncommunists from Mainland China had attempted to capture the island, but to no avail \nafter 56 hours of deterrence by Chiang Kai-shek’s forces. The museum was built at \nGuningtou where the battle was fought, and being “the first major KMT victory in many \nmonths of the long civil war, Guningtou became a symbol of the survival of the Republic \nof China (ROC) on Taiwan” (Szonyi, 2005: 88).  \n \n \n \n \n \n \n \n \n \n \n \n \n \nPlate 6.4 Façade of Guningtou Battle Museum \n 16 \n \n The presence of pillboxes, anti-parachuting fortresses and tankers surrounding the \nmuseum serves to cement the past for the present and add to the military ambience. Inside \nthe museum, tourists are greeted with a wall map that depicts the details of the Guningtou \nBattle, such as routes taken by the armed forces and the number of casualties suffered. \nThey are then directed by the tour guide to view a series of 13 murals (Plate 6.5). These \nlandscape paintings narrate the various events that took place before, during and after the \nbattle; concentrating on KMT’s preparation for war, PLA’s invasion, the fierce fighting \nthat took place, and the eventual surrender of the communist soldiers at Guningtou. \nCollectively, the artists apply their “artistic and historical imaginations to the creation of \na glorious past” (Osborne, 1992: 250). According to one of my informants, the venue and \ntime stated in the paintings “create a kind of reality…as though you are in the battle \nyourself” (Taiwanese tourist; personal communication, 23 May 2006).  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFurthermore, a rectangular red carpet is laid in front of one of the paintings showing \nChiang Kai-shek surveying the Kinmen coastline (Plate 6.6). The tour guide would \nenthusiastically highlight that the red carpet area was the “exact spot where the late \npresident stood in the painting”. Undoubtedly, existential authenticity interacts with the \n \nPlate 6.5 One of the 13 murals on display \n 17 \n \nlocale to create an emotional experience, be it nationalistic or that of empathy, for the \nvisitors. This in turn reinforces Kinmen’s battlefield tourism brand.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n The Guningtou Battle museum tour ends with a coach ride to the ‘Ancient \nBungalow’ (depicted in the mural), the site where “heavy street fighting” took place. The \ndilapidated building bears the ‘scars’ of the battle, with bullet holes and destroyed \nsections of the wall still visible. A plaque stands in front of this war relic, narrating the \nfierce cross firing that took place there (Plate 6.7). As one of the tourists acknowledged, \n“This is what we saw just now in the mural. I can really feel what it was like back then… \ncan imagine that it was a fierce battle” (Taiwanese tourist; personal communication, 23 \nMay 2006). This exemplifies the notion that “[e]motions are intimately tied into place” \n(Urry, 2005: 77), and a well of opportunity to utilise and manage emotional geographies \nin the island branding process. Concomitantly, the murals help to reinforce the emotional \ninteraction between tourists and the war relics.    \n \n \n \n \n \nPlate 6.6 Red carpet demarcating the exact spot where Chiang Kai-shek stood \n 18 \n \n \n \n \n \n \n \n \n \n \n  \n In recent years, the battlefield brand of Kinmen has taken on a more diplomatic \napproach. Captions accompanying the paintings have been altered to “provide a more \nobjective version of the history and to show an increased sensitivity towards the PRC \ntourists” (Huang Tzu-Chuan - Chief of Interpretation and Education Section, KMNP, \npersonal interview, 23 May 2006). The reference of the PLA as ‘communist bandits’        \n(共匪), for example, has been changed to the more neutral term of “communist soldiers” \n(共军). Such a move attests to the idea of ‘landscape as a palimpsest’, where meanings \ncan be (re)inscribed (Duncan and Duncan, 1989) depending on the politics of \nconsumption. It is therefore evident that place branding does possess a ‘public \ndiplomacy’ façade (Anholt, 2006).  \n \n6.2.2  Branding through simulation and simulacra   \n \nRe-creating war memories through simulation is another method adopted in producing \nthe place brand experience. For example, different forms of simulation are designed for \nvisitors at the Aug.23 Artillery Battle Museum (823 Museum)12 (Plate 6.8). It is a ‘non \nplace-specific’ memorial, built to remember the dead and provide detailed historical \nrecords of the artillery battle, which caused the residents to live in agony for 44 days \nunder heavy bombardment. A total of 474,910 shells fell on the island, creating \ndevastating destruction and loss of lives.       \n                                                 \n12\n Known as “823 Museum” because the artillery battle took place on 23 August 1958. \n \n \nPlate 6.7 Fierce fighting at the 'Ancient Bungalow’ and as it stands today \n 19 \n \n \n \n \n \n \n \n \n \n  \n \n Visitors are greeted with a series of historical photos and descriptions narrating \nthe battle. Also, small television screens show black-and-white footages of media \nreporting on the 1958 battle. These capture the visitors’ attention and serve to substantiate \nthe photos by ‘enlivening’ history. As Muzaini (2004) has shown, photos and other \ngraphics can serve as a form of simulation, “provid[ing] ‘visual markers’ (Osborne, 1998) \nto help visitors imagine the past” (p.56). In fact, in this case, visitors can go beyond \nimagining and literally see the past; allowing them to relate to the event easily. The \nsubtitles in the footages serve as ‘text’ for the tourism planners to effectively get their \nbrand message across.   \n \nMoving beyond the visual, the museum also attempts to re-create the lived \nexperience of the Kinmen locals – in the form of “Life in the underground [bomb] \nshelters”. A replica of a granite-carved bomb shelter is put on display, allowing visitors to \nenter and experience it. The photo showing a Kinmen resident seeking refuge testifies its \nauthenticity. A typical remark during my participant observation was that of senior \nmembers of Taiwanese tour groups reminding their children about the “difficult life back \nthen” and “not to take the peace for granted”. Therefore, verisimilitudes in the museum \nnot only serve as representations of the past in a physical sense, but also “non-verbal \n‘documents’ in the landscape [that] can be powerful visual signs, conveying messages \nforcefully…” (Baker, 1992: 5). As seen from this example, Kinmen’s battlefield brand is \n \nPlate 6.8 Façade of 823 Museum \n \n 20 \nnot restricted to the tourism context; its identity is also engaged and rationalised by the \nadult tourists at the moral level to educate the young.  \n \nOf all the exhibits, the ‘Battlefield Virtual Reality” show is most popular. Instead \nof ‘bringing’ the past to the present, it ‘brings’ visitors back to the past in a room that \nprovides a 3-minute “battlefield experience”. Visitors are presented with footages (on a \nscreen in front of them) of everyday peaceful life in Kinmen till the first artillery shell \nlanded. This is accompanied by sound and motion effects; simulating the tremors of the \nground, with explosions and cries filling the room. Such ‘bombardment experience’ \ntranscends the visual-centric displays earlier. It not only simulates history, but also \nstimulates the senses of the visitors, engaging them in a sensuous moment, entangling \nthem with miseries of the past, exploiting emotional geographies to the fullest! One of the \ntourists commented, “That was so real. I can really feel what it was like back then.” \n(Taiwanese tourist; personal communication, 24 May 2006). Huang Tzu-Chuan \nexplained:  \n \nWe want our visitors to have a more encompassing experience. Not only \ncan they see the exhibits, they can also feel them. This way, it is easier for \nthem to empathise with the historical event. The school kids enjoyed it \n[the ‘virtual reality’] the most. We also want to educate them not to take \npeace for granted.13    \n(Personal interview, 23 May 2006) \n \nThe Rushan Old Barrack at the KMNP’s headquarters is a vivid example that \nexplores the branding process through simulacra (i.e. exhibits that are not authentic but \nnevertheless having a strong resemblance to historical artefacts) . The military-themed \npark exhibits the various weapons used by the KMT army. A mixture of authentic and \nmodel weapons manned by wax soldiers with expressions of anxiety, form the \nbackground to the staged battle (Plate 6.9). Green-coloured sand bags, camouflaged walls \nand a command centre mimicking the “actual situation during war times” create the \nsetting of a barrack. At regular intervals, audio effects of bombing and air raid sirens \nwould be played to add to the ambience.  \n                                                 \n13\n Disneyland uses similar tactics to bring an idealised past or dangerous present to consumers in a safe way.  \n 21 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \nVisitors, both locals and tourists can be seen “participating” in the pseudo battle \nby posing playfully with the wax figures or helping the gunners “load” their guns. Such \ncaricature of battle scenes marks a different approach in the production of Kinmen’s \nplace brand experience as discussed hitherto. In fact, the boundaries between the \nauthentic and inauthentic are blurred in the production of the tourism landscape. When \ninterviewed, Su Cheng-Chi, Chief of KMNP’s Planning and Management Department, \nreplied:  \n \nThis is an interesting way to let the people interact with the exhibits. In \nfact, if this is successful, we have plans to develop the whole island into a \ntheme park, concentrating on providing tourists with battlefield \nexperience. We can let the tourists put on our army uniform, eat army \nfood, and re-enact the battle. We can even integrate with paint ball games, \nsomething that is popular amongst the youngsters nowadays. We can also \nprovide photo-taking services and if they are interested, they can purchase \nthe uniform, as a souvenir.  \n(Personal interview, 2 June 2006)         \n \n \n \nPlate 6.9 Wax figures “manning” various weapons at the Rushan Old Barrack \n 22 \nApparently, the production of battlefield tourism landscape through re-creating the war \nmemories is increasingly being commercialised; through various simulacra focusing on \nthe touristic experience rather than authenticity of display. Indeed, the “image takes over \nthe original” (Eco, 1986, cited in Freire, 2005: 355) for such fabricated events (Boorstin, \n1992). When asked for his view on the possible ‘de-sacralisation’ of the former \nbattlefield through such staged authenticity (MacCannell, 1976), General (retired) Liao, \nwho has served on Kinmen before, begged to differ: \n \nWe have to change with the times. Although I strongly feel that we should \nmaintain vigilant and that the young generation should still possess a war \nmentality, there is nothing to stop the state from achieving this through the \n‘fun’ way. National education can be taught using the ‘fun’ method. \nMaybe it is more effective. \n(Personal interview, 4 July 2006) \n \nTherefore, the branding of Kinmen’s battlefield landscape not only possesses underlying \ngeopolitical agenda, but also considers consumers’ preferences. Indeed, the symbolic \nsignificance of the Kinmen Brand takes precedence over the authenticity of historical \nreproduction in modern day consumption. Furthermore, as Kotler et al. (2001: 318) \nhighlight, “glossy photographs of sunsets, beaches, buildings and events need to have \nsome relationship to what tourists actually experience; otherwise places run the risk of \nlosing tourist goodwill and generating bad word of mouth”. The excellent attractions \nportray the battlefield image strongly. This not only provides Kinmen with its unique \nselling point but also facilitates strong and convincing branding. \n \n \n \n \n \n \n \n \n \n 23 \n7.  Of Kaoliang, Bullets and Knives: Local Entrepreneurs, Kinmen People and    \nTourists as Branding Agents \n   \nBranding of Kinmen by the tourism planners alone has its limitations. Although it may be \nsuccessful amongst the tourists, the locals themselves need to identify with the brand of \nthe island as a battlefield tourism destination. I argue that tourists’ identification of an \nisland should be substantiated by locals’ self-recognition with the island’s identity so as \nto sustain any tourism branding effort. It is only with the recognition and participation by \nthe locals that tourism can be sustainable. In this case, the locals should be given more \nautonomy in shaping their battlefield tourism landscape. This serves to inculcate a more \nintimate sense of place and self-recognition amongst the Kinmen people. The following \nsection provides a glimpse of how local entrepreneurs, Kinmen locals and tourists are \nalso branding agents of Battlefield Kinmen.      \n      \n As Allen (2007: 64) argues, “While government agencies often lead brand \ninitiatives, the stakeholder domains within which they operate are arguably more difficult \nto manage than those faced by corporate brand managers.” In the case of Kinmen, other \nthan the official planners, local entrepreneurs also play a major role in shaping the \nbattlefield tourism brand by investing their own sentiments through the commodification \nof war symbolism. People go beyond the functional features when purchasing a product \nand “acquire certain symbolic features that are incorporated in the brand” (Aaker, 1996, \ncited in Freire, 2005: 347). I refer to the Kinmen te-chan (特产- specially produced \nconsumer items) and how these products are marketed and consumed in accordance to \nthe battlefield image of Kinmen. The “three treasures” of Kinmen, namely Kinmen \nKaoliang (sorghum) Liquor (金门高粱酒), Kinmen Peanut Candy (金门贡唐) and the \nKinmen Steel Knife (金门钢刀) will be drawn upon to elaborate.  \n \n \n \n \n \n \n 24 \n7.1  The Kinmen kaoliang liquor   \n \nThe consumption culture of kaoliang liquor started in North China. When the KMT \nforces retreated from PRC to Kinmen, the military brought with them the consumption \nhabit and introduced growing of sorghum to the residents.14 The liquor has since become \nthe most important export commodity and is inextricably linked to the island’s battlefield \nidentity. With the rise of tourism, local entrepreneurs have since come up with \n‘commemorative liquor’ featuring the major battles for tourist consumption. The bottles \ncome in the shape of tankers, helmets, army boots and artillery shells, marrying the \nconsumption of kaoliang liquor with war commemoration (Plate 7.1).  \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n                                                 \n14\n This is an over simplification of the history of Kaoliang liquor. For a detailed description, see Szonyi \n(forthcoming).  \n \n \n \n \nPlate 7.1 Commemorative Kaoliang liquor in various shapes \n \n 25 \n The association of kaoliang liquor with the battlefield identity of Kinmen sets off \na co-branding relationship. The kaoliang liquor is no longer just any liquor made from \nsorghum; it is “Kinmen Kaoliang Liquor”. Such a brand name “add[s] value to the basic \nproduct (brand equity)… and this [battlefield image] provides differentiation that goes \nbeyond price competition” (Aaker, 1991, cited in Donald and Gammack, 2007: 46). \nConcomitantly, the kaoliang liquor, high in its alcohol content and believed to be only \nconsumed by the strong and courageous, is also a brand in itself, which underscores the \ncharacter of Kinmen as a military stronghold. The significance of ‘Kinmen’ and \n‘Kaoliang’ as co-brands is evident from a Taiwanese tourist’s response:  \n \nI bought this bombshell-bottled Kinmen Kaoliang Liquor as a souvenir for \nmy brother. For one, Kinmen is famous for its high quality kaoliang liquor. \nMoreover, the battlefield aspect of this island is represented by the \nbombshell bottle. People will know straight away that I have visited \nKinmen. So, I am hitting two birds with one stone. I don’t mind paying \nmore for the design.  \n(Personal communication, 2 June 2006) \n \nAs can be seen from this example, the symbolic consumption of the kaoliang liquor gives \nthe local entrepreneurs an edge over other producers. Indeed, brand equity is effective in \nreducing the price sensitivity of a product. \n \n During my stay in Kinmen, it was not difficult to notice rows of such \ncommemorative kaoliang liquor on display in the living rooms of locals’ residences. One \nof the locals enthused when asked about the display:  \n \nThese kaoliang liquor bottles encapsulate Kinmen’s battlefield history. \nMoreover, they are quite nice and unique…Something to show to friends \nand relatives when they visit us from Taiwan. So, this has become \nsomething like a hobby for me…collecting these bottles.  \n(Personal interview, 22 June 2006)   \n \nThe branding of Kinmen has indeed crossed the domain of tourism planners into that of \nthe local people. In fact, Donald and Gammack (2007) have highlighted the importance \nof “every citizen [being] an ambassador” and believing in the brand, as the key difference \n 26 \nbetween product and place branding (p. 61). For a successful and sustainable branding \neffort, the Kinmen locals must believe in the battlefield identity themselves. If this \ncriterion is fulfilled, the people can be utilised as “the most powerful communication tool \nin the [island] branding toolbox (Gudjonsson, 2005: 288). As such, by collecting and \ndisplaying the commemorative kaoliang liquor, the Kinmen locals can be seen as “brand \nstewards” (Allen, 2007) in promoting and sustaining the battlefield brand.  \n \n \n7.2  The Kinmen Peanut Candy \n \nThe peanut candy is one of the Kinmen delicacies popular amongst tourists. The local \nentrepreneurs are quick to jump onto the bandwagon of battlefield tourism development \nto come up with war-related themes for the peanut candy. However, they are not passive \nfollowers, but make use of tourism to express their own interpretation of the battlefield \nlandscape. For instance, Mr Chen, General Manager of Min-Jih Gong Tang, invented the \n“Bullet Cracker” series (Plate 7.2). These crackers take the shape of bullets and are \nspecially packed in containers that resemble ammunition boxes. On explaining his \nrationale for creating these products, he enthused: \n \nI wanted these peanut candies to represent peace between Taiwan and \nPRC. These bullet-shaped peanut crackers symbolise those bullets that \nwere left behind after the war. We don’t want anymore conflict, so the \nbest way to deal with these excess bullets, is to eat them! The tourists love \nthem. Moreover, people here are also finding this to be the perfect gift for \nrelatives and friends who come over…usually for them to bring back to \nTaiwan. I am in the midst of designing more of such candy. Peanut candy \nin the forms of tankers, machine guns and grenades will be next.   \n \n(Personal interview, 1 June 2006) \n \n Entrepreneurial innovations such as the Bullet Crackers, when bought by the \ntourists and locals as souvenirs, contribute to the post-place brand experience (Allen, \n2003) of Kinmen. In this case, they help to perpetuate the Kinmen battlefield brand by \npurchasing these souvenirs and giving them as gifts to relatives and friends overseas. For \nexample, when asked the reason for purchasing the bullet crackers, one PRC tourist \nreplied:  \n 27 \nI bought it for fun, not really for the taste. It is interesting and I like the \npeace agenda behind its creation. This serves as a very good souvenir for \nmy friends back home. Who would have thought that you can actually eat \na bullet!      \n(Personal communication, 1 June 2006) \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nObviously, the bullet crackers were bought for their symbolic meaning rather than its \ntaste. Although ‘piggy-backing’ on the government’s branding initiative, the local \nentrepreneurs are actively expressing their agency in the branding process by creating \ntheir own narration behind the products, which acts as a medium for relaying their own \ninterpretation of Kinmen’s battlefield landscape.  \n \n \nPlate 7.2 “Bullet” Cracker \n(Source: Min Jih promotional booklet) \n 28 \n Such a marriage between a cultural product and the battlefield brand provides \nopportunities for the local community to “develop and create cultural signs and markers \nthat will be needed to attract visitors” (MacCannell, 1999, cited in Freire, 2005: 360). \nThis is especially crucial for product differentiation, considering the fact that the \nneighbouring island of Xiamen has started to produce its own peanut candy targeted at \ntourists. Xiamen is the port of call for many Kinmenese tourists and the place of origin of \nPRC tourists visiting Kinmen, since the establishment of the ‘mini-three links’. During \nmy recent fieldtrip to Xiamen Island, I noticed that there are many (特产) shops selling \ncultural food products along the major thoroughfares at the Zhongshan tourist district \n(Plate 7.3). The peanut candy is obviously a cultural product not confined to the Kinmen \nterritories, considering that both Kinmen and Xiamen belong to the Southern Fujian \nregion at least in cultural terms. Kinmen Peanut Candy is exported and sold alongside \nXiamen Peanut Candy in these shops. In order to profit from a more successful product \ndifferentiation, the battlefield brand as perceptible in innovations like the “bullet \ncrackers” ought to be utilised. It is by bringing the Kinmen battlefield brand to the world \nthat tourists from around the world would be attracted to the island.        \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPlate 7.3 Zhongshan tourist district (left) and shop selling Kinmen Peanut \nCandy alongside other cultural food products from Xiamen Island \n \n 29 \n7.3  The Kinmen Steel Knife  \n \nThe Kinmen Steel Knife 15  is even more closely related to the war (Plate 7.4). \nManufactured using the artillery shells that fell on the island during the bombardment by \nthe communist forces during the Cold War years, it has gained popularity all over the \nworld, and is often featured in media reports and documentaries. Major television \nnetworks like CNN from the United States, NHK from Japan and TVBS from Taiwan, \nand international magazines like TIME, all have had special reports on the “Chin Ho Li \nSteel Knife Story”.  According to Mr Wu, Director of Chin Ho Li,16  \n \nThe kitchen knife is used in every household…both in PRC and Taiwan. I \nwant to remind people of the great sufferings caused by the battle. At the \nsame time, this common household item would also remind the users of \nthe kinship and culture that both sides share. We are ultimately one family.   \n   \n  (Personal interview, 29 May 2006)   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n                                                 \n15\n Although famous for its kitchen knives, souvenir knives of varying sizes are also available.  \n16\n “Chin Ho Li” is the name Mr Wu’s Kinmen Steel Knife factory. \n \n \nPlate 7.4 The Kinmen steel knife made from artillery shells \n(Source: Chin Ho Li Steel Knife promotional brochure) \n \n 30 \nIn this example of the Kinmen Steel Knife, the battlefield brand is skilfully \nembedded in its creation. It might not be articulating the Kinmen brand as explicitly as \nthe two consumables discussed above. However, coupled with its functionality and \ndurability, the knife can be an effective “brand agent” in the long run. With continuing \ninnovations in design and product development, the Kinmen Steel Knife is gradually \ntransforming itself into an umbrella brand that hosts a series of souvenir knives that will \ncertainly meet the preferences of different tourists.  \n \nThe Chin Ho Li example illustrates how Kinmen’s battlefield brand can also be \nshaped through the production of consumer items by a local entrepreneur. The knife \nreminds the tourist of the existing conflict between PRC and Taiwan and conveys the \nmessage for peaceful reconciliation. Such product innovations serve as a medium for the \nlocal entrepreneurs to express their sentiments about the war and how they would like the \nwar to be represented to the tourists.  \n \n The “three treasures” of Kinmen illustrate the production and consumption of \nKinmen’s battlefield brand in a symbolic sense. They show how tourist consumption of \nsuch te-chan can interact with locals’ interpretation of Kinmen’s battlefield past, and \nwhen bought home, contribute to the perpetuation of the battlefield brand beyond \nKinmen’s geographical limits. Therefore, the battlefield tourism brand is constitutive of \nand at the same time constituted by the locally produced goods. It is evident that local \nentrepreneurs, Kinmen people and tourists do contribute in one way or another to the \npost-place brand experience of Kinmen. Being a small, developing destination with \nlimited resources, such Kinmen souvenirs serve as “creative and cost-efficient” (Florek \nand Conejo, 2007) branding avenues. According to Morgan (2004: 19), tourism remains a \n“highly involving experience, extensively planned, excitedly anticipated and fondly \nremembered. Souvenirs and mementos evoke and materialise those experiences…” \nIndeed, the Kinmen brand travels to places out of Kinmen when products created by the \nlocal entrepreneurs are bought as souvenirs by either the locals themselves or by tourists. \nSuch behaviour starts off another cycle of ‘pre-place experience’ and helps in the \nattraction of more tourists to Kinmen. The post-place brand experience is thus an \n 31 \nimportant aspect in the branding process as it contributes significantly to the perpetuation \nand sustainability of the Kinmen brand.   \n \n The effectiveness of the te-chan in perpetuating the battlefield image has been \nrecognised by the tourism planners as they are increasingly being featured in promotional \nmaterials about Kinmen. This shows how ‘bottom-up’ branding practices may influence \n‘top-down’ decisions, thus breaking away from a dichotomous understanding of planners \nand locals of the battlefield landscape. The Kinmen Brand then should be conceptualised \nas “a negotiated reality, a social construction by a purposeful set of actors” (Ley, 1981, \ncited in Ringer, 1998: 5). Socially, island branding in and through tourism provides a \nplatform for constructing a common identity and a sense of belonging amongst the \nislanders. Indeed, the manufacturing and sales of locally produced products can become a \n“source of pride that may be more deep-rooted than the ephemeral satisfaction of \nattracting inward investment” (Dinnie, 2004: 109). In economic terms, the many places \nfrom which the tourists originate and where the Kinmen Brand is promoted, experienced \nand perpetuated, become viable economic hinterlands of Kinmen Island  \n \n8.  Conclusion: An eye on the future \n \nAlthough tourism is just a component part of island branding, it is integral to the support \nand promotion of the island brand. This paper has attempted to highlight the intricacies of \nthe island branding process by explicating contributions by the various tourism \nstakeholders in a dialectical manner. Through the different phases of brand experience, \nnamely pre-place, place and post-place (Allen, 2003), I have shown that the Kinmen \nbrand is a negotiated reality; it is a dynamic organism that feeds on both top- down \nbranding initiatives by the tourism planners and bottom-up practices by local \nentrepreneurs, Kinmen people and tourists. Considering the political nature of place \nbranding in terms of the vested interests in portraying particular images, I have also \nproposed the importance of locals’ recognition with the island’s identity so as to sustain \nthe branding efforts. Meanwhile, the various case studies discussed espouse the \npertinence of geographical particularity and landscape identity in the branding of \nKinmen, so as to avoid the ‘homogenising effect’ of a singular ‘imagineering’ and\/or \n 32 \ngeographical imagination of ‘island tourism’. Tourists of today do not merely travel to \nescape from their daily routine; they also yearn for new experiences (Iso-Ahola, 1982). \n“These new experiences emerge only if local places maintain their characteristics, culture \nand individuality” (Gnoth et al., 2000, cited in Freire, 2005: 357). Therefore, if an island \ndestination is not considered as different, it will lose its appeal.  \n \nIn terms of marketing, Kotler et al. (2001) argue that with budget constraints, the \nclear definition of target segments will allow focused branding efforts in relevant media \nchannels. As elaborated above, Kinmen is mainly visited by domestic tourists. The \nexcellent products make it easier to create a place image and eventually, a strong brand \nwithin this specific segment. More effort should be spent on publicising in appropriate \ncommunication channels to reach out to this segment. Market research will be required to \nshed light on the target audiences, media usage and place image. This will complement \nthe existing product to create a strong destination brand. Conversely, the emerging \nmarket of PRC tourists will require increased sensitivity to a different audience \n(Henderson, 2007). This includes catering to their needs and more importantly, sensitivity \nto the branding message. While the brand for the domestic market can emphasize \npatriotism and nationhood arising from the war, such messages need to be toned down for \nthe PRC market.  \n \n To close, I would like to speculate on the future of the Kinmen brand and the \nbranding process. To do this, we have to ask ourselves: Will the historical \ncontextualisation of the island still be pivotal to the brand, or will it be downplayed? The \nanswer to this question lies in Taiwan’s political climate vis-à-vis PRC’s attitude towards \nits perceived unclaimed territory of Taiwan. There are at least three scenarios that could \nbe discussed:  \n \n• Taiwan under the pro-independence Democratic Progressive Party (DPP) \n• Taiwan under the pro-status quo and economic-driven Kuomintang (KMT) \n• Taiwan after re-unification with PRC.  \n \n 33 \n First, considering the attempt by the ruling DPP to ‘de-Sinicise’ Taiwan early last \nyear17 (The Straits Times, 30 January 2007; 9 February 2007), it would be a matter of \ntime that the military island of Kinmen would experience the political ripples. If this were \nto happen, the historical context of the island will be downplayed in an attempt to severe \nhistorical ties with PRC altogether. However, the fact that Kinmen remained untouched \nthroughout the de-Sinicisation campaign hints on DPP’s preference to portray the \nmilitary island as a symbolic representation of the formal separation of Taiwan from PRC \nand the establishment of an independent political entity. In this case, the battlefield brand \nwill remain relevant for the promotion of Kinmen’s tourism.  \n \n In the second scenario, the KMT will most likely strengthen Kinmen’s economic \nties with the Chinese Mainland. The mini-three links that is currently restricted to the \nFujian province on the PRC side might be expanded to cover more provinces. A large in-\nflux of PRC tourists is expected and the diplomatic façade of the battlefield brand as \ndiscussed earlier is likely to be more prevalent. In such a situation, the Kinmen brand will \nbe particularly important in attracting tourists and inward investments.  \n \n Finally, in the event of re-unification, the battlefield image of Kinmen will still be \nmaintained by the Chinese authorities. Other than the possibility of utilising Kinmen as a \nlaunch pad for stronger socio-cultural, economic and political ties with Taiwan, the island \ncould be developed into a national education site to remind its people of the separation \nhistory and the tedious effort by the Chinese authorities in reclaiming its final unclaimed \nterritory. With a war museum and military theme park already operating on the islet of \nDa Deng off Xiamen Island, there is little reason why Kinmen will not be incorporated \ninto the larger plan for a ‘national education tourism corridor’.    \n \n In my opinion, the second scenario has the highest possibility of being \nmaterialised. In almost every possible scenario, the battlefield brand of Kinmen remains \ncentral for the island’s development and continual survival. Therefore, it is indeed \nadvantageous in both the near future and long run that tourism planners and local \n                                                 \n17Examples include the editing of high school history textbooks to downplay historical ties with PRC, \nreplacing “China” with “Taiwan” on the stamps, and a proposal to keep away statues of Chiang Kai-shek.   \n 34 \nentrepreneurs continue to invest on the battlefield brand of Kinmen. Contemporary \nefforts by tourism planners and local entrepreneurs to portray a less contested history \nbetween Taiwan and PRC, and a desire for peaceful settlement of their conflicts are \nwelcomed. It is hoped that Kinmen, as a battlefield tourism destination, can function as a \nplatform for people from both sides of the straits to understand better their past, and more \nimportantly, that they are inextricably related to one another; socially and economically, \nif not politically. The island is thus envisioned to be a bridge for a much desired peaceful \nsettlement of the ongoing political instability on both sides of the Taiwan Strait.  \n \n \n \n \n \nAcknowledgements  \n \nThis paper appeared in its earlier form as a presentation at the Inaugural Meeting of the \nIGU Commission on Islands: ‘Island Geographies’ International Conference, Taipei \n(Taiwan) in October 2007. The author appreciates the helpful comments by and \ndiscussions with participants at the conference. Kind assistance and guidance rendered by \nAssociate Professors V. Savage, Peggy Teo and T.C. Chang, as well as the anonymous \nreviewers who provided valuable comments on an earlier draft of the paper are also \ngratefully acknowledged. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 35 \nReferences  \n \n \nAllen, G. (2003) Branding Beauty: Super, Natural British Columbia: A Case Study \nAnalysis of Place Branding, unpubl. dissertation, University of Westminster. \n \nAllen, G. (2007) ‘Place branding: New tools for economic development’, Design \nManagement Review, 18(2), pp. 60-68. \n \nAnderson, K. and Smith, S.J. (2001) ‘Editorial: emotional geographies’, Transactions of \nthe Institute of British Geographers, 26(1), pp. 7-10.  \n \nAnholt, S. (2004) ‘Editors foreword to the first issue’, Place Branding, 1(1), pp. 4-11.  \n \nAnholt, S. (2005) ‘Some important distinctions in place branding’, Place Branding, 1(2), \npp. 116-121.  \n \nAnholt, S. (2006) ‘Public diplomacy and place branding: Where’s the link?’, Place \nBranding, 2(4), pp. 271-275.  \n \nBaker, A.R.H. (1992) ‘Introduction: on ideology and landscape’, in A.R.H. Baker and G. \nBiger (eds.), Ideology and Landscape in Historical Perspective: Essays on the \nmeanings of some places in the past, Cambridge; New York, NY, USA: \nCambridge University Press, pp. 1-14.  \n \nBaldacchino, G. (2005) ‘Successful small-scale manufacturing from small islands: \nComparing firms benefiting from locally available raw material input’, Journal of \nSmall Business and Entrepreneurship, 18(1), pp. 21-38.  \n \nBaldacchino, G. (2007) ‘The study of islands on their own terms: Origins, challenges and \nimplications’, paper presented at the Inaugural Meeting of the IGU Commission \non Islands: ‘Island Geographies’ International Conference, Taipei (Taiwan), \nOctober 2007.   \n \nBaudrillard, J. (1968) ‘The system of objects’, in M. Poster (ed.), Jean Baudrillard: \nSelected Writings, Cambridge, UK: Polity Press.  \n \nBoorstin, D. (1992) The Image: A Guide to Pseudo-events in America, New York, NY: \nFirst Vintage Books.  \n \nBunker Museum of Contemporary Art (2004), http:\/\/bmoca.kinmen.gov.tw\/eng\/ \n[accessed 11 January 2007].  \n \nChi, C.H. (2004) ‘Militarization on Quemoy and the making of Nationalist hegemony, \n1949-1992’, in Q.G. Wang (ed.), Jin men li shi, wen hua yu sheng tai guo ji xue \nshu yan tao hui lun wen ji, Taibei: Caituan faren shihezheng minsuwenhua \njijinghui, pp. 523-544.  \n 36 \nCohen, E. (1982) Pacific Islands from Utopian Myth to Consumer Product: The \nDisenchantment of Paradise, Aix-en-Provence: Universite de droit, d'economie et \ndes sciences, Centre des hautes etudes touristiques. \nDann, G. (1996) The Language of Tourism, UK: CAB International.  \nDavidson, J., Bondi, L. and Smith, M. (eds.) (2005) Emotional Geographies, Aldershot, \nEngland; Burlington, VT: Ashgate.  \n \nDinnie, K. (2004) ‘Place branding: Overview of an emerging literature’, Place Branding, \n1(1), pp. 106-110.  \n \nDonald, S.H. and Gammack, J.G. (2007) Tourism and the Branded City: Film and \nIdentity on the Pacific Rim, Aldershot, Hants, England; Burlington, VT: Ashgate.  \n \nDuncan, J. and Duncan, N. (1989) ‘(Re)reading the landscape’, Environment and \nPlanning D: Society and Space, 6, pp. 117-126. \n \nFlorek, M., & Conejo, F. (2007) ‘Export flagships in branding small developing countries: \nThe cases of Costa Rica and Moldova’, Place Branding and Public Diplomacy, \n3(1), pp. 53–72. \n \nFreire, J.R. (2005) ‘Geo-branding, are we talking nonsense? A theoretical reflection on \nbrands applied to places’, Place Branding, 1(4), pp. 347-362. \n \nGarcía, B. (2004) ‘Urban regeneration, arts programming and major events: Glasgow \n1990, Sydney 2000 and Barcelona 2004’, International Journal of Cultural \nPolicy, 10(1), pp. 103-118.  \n \nGould, M. and Skinner, H. (2007) ‘Branding on ambiguity? Place branding without a \nnational branding identity: Marketing Northern Ireland as a post-conflict society \nin the USA’, Place Branding and Public Diplomacy, 3(1), pp. 100-113.  \n \nGudjonsson, H. (2005) ‘Nation branding’, Place Branding, 1(3), pp. 283-298. \n \nHenderson, J. C. (2007) ‘Uniquely Singapore? A case study in destination branding’, \nJournal of Vacation Marketing, 13(3), pp. 261. \n \nIso-Ahola, S. (1982) ‘Toward a social psychological theory of tourism motivation: A \nrejoinder’, Annals of Tourism Research, 9(2), pp. 256-262.  \n \nKavaratzis, M. and Ashworth, G.J. (2006) ‘City branding: An effective assertion of \nidentity or a transitory marketing trick?’, Place Branding, 2(3), pp. 183-194. \n \nKinmen Daily, 18 December 2006. \n \nKinmen Daily, 24 December 2006.   \n 37 \nKinmen Statistics Department (2006) jinmenxian tongji yuebao, Kinmen, April 2006.  \n \nKotler, P., Hamlin, M.A., Rein, I. and Haider, D.H. (2001) Marketing Asian places : \nAttracting Investment, Industry and Tourism to Cities, States and Nations, \nSingapore: Wiley. \n \nKotler, P. and Gertner, D. (2002) ‘Country as a brand, product, and beyond: A place \nmarketing and brand management perspective’, Journal of Brand Management, \n9(4\/5), pp. 249-261. \n \nKotler, P. (2004) ‘Where is place branding heading?’, Place Branding, 1(1), pp. 12-35.  \n \nLiu, J.K.C. (2007) ‘Localizing development strategies: Issues in addressing \nenvironmental and cultural differences on small islands’, paper presented at the \nInaugural Meeting of the IGU Commission on Islands: ‘Island Geographies’ \nInternational Conference, Taipei (Taiwan), October 2007.   \n \nMacCannell, D. (1976) The Tourist: A New Theory of the Leisure Class, New York: \nSchocken Books.  \n \nMcGuigan, J. (2005) ‘Neo-liberalism, culture and policy’, International Journal of \nCultural Policy, 11(3), pp.229-241. \n \nMcLaren, D. (1998) Rethinking Tourism and Travel, Connecticut: Kumarian Press.  \n \nMooney, G. (2004) ‘Cultural policy as urban transformation? Critical reflections on \nGlasgow, European City of Culture 1990’, Local Economy, 19(4), pp. 327-340.  \n \nMorgan, N., Pritchard, A. and Pride, R. (eds.) (2002) Destination Branding: Creating the \nUnique Destination Proposition, Boston: Butterworth-Heinemann. \n \nMorgan, N. (2004) ‘Where is place branding heading?’, Place Branding, 1(1), pp. 12-35.  \n \nMuzaini, H.B. (2004) Localizing Memoryscapes, Building a Nation: Commemorating the \nSecond World War in Singapore, unpubl. M.A. thesis, National University of \nSingapore.  \n \nOsborne, B.S. (1992) ‘Interpreting a nations’ identity: artists as creators of national \nconsciousness’, in A.R.H. Baker and G. Biger (eds.), Ideology and Landscape in \nHistorical Perspective: Essays on the meanings of some places in the past, \nCambridge; New York, NY, USA: Cambridge University Press, pp. 230-254. \n \nOsborne, B. (1998) ‘Constructing landscapes of power: the George Etienne Cartier \nmonument, Montreal’, Journal of Historical Geography, Vol. 24, No. 4, pp.431-\n458.  \n \n 38 \nPapadopoulos, N. (2004) ‘Place branding: Evolution, meaning and implications’, Place \nBranding, 1(1), pp. 36-49. \n \nRinger, G. (ed.) (1998) Destinations: Cultural Landscapes of Tourism, New York: \nRoutledge.   \nSpencer, C.P. and Dixon, J. (1983) ‘Mapping the development of feelings about the city: \na longitudinal study of new residents’ affective maps’, Transactions of the \nInstitute of British Geographers, 8, pp. 373-383.  \n \nSzonyi, M.A. (2005) ‘The Virgin and the Chinese State: The cult of Wang Yulan and the \npolitics of local identity on Jinmen (Quemoy)’, Journal of Ritual Studies, 19(1), \npp. 87-98.  \n \nSzonyi, M.A. (forthcoming) Island on the Frontlines: Quemoy in the Cold War, Stanford, \nCalif: Stanford University Press.   \n \nThe Economist, 6 January 2001.  \n \nThe Straits Times, 30 January 2007. \n \nThe Straits Times, 9 February 2007.  \n \nThe Taiwan Economic News, 7 February 2003. \n \nTuan, Y.F. (1974) ‘Space and place: Humanistic perspective’, Progress in Geography, 6, \npp. 211-225.  \n \nTuan, Y.F. (1977) Space and Place: The Perspective of Experience, Minneapolis: \nUniversity of Minnesota Press.  \nUrry, J. (1990) The tourist gaze: leisure and travel in contemporary societies, London: \nSage Publications. \nUrry, J. (2005) ‘The place of emotions within place’, in J. Davidson, L. Bondi and M. \nSmith (eds.), Emotional Geographies, Aldershot, England; Burlington, VT: \nAshgate, pp. 77-83.  \n \nValentine, G. (2005) ‘Tell me about…: using interviews as a research methodology’, in \nR. Flowerdew and D. Martin (eds.), Methods in Human Geography: A guide for \nstudents doing a research project, Harlow, England; New York: Prentice Hall.  \n \nVan Ham, P. (2004) ‘Where is place branding heading?’, Place Branding, 1(1),            \npp. 12-35.  \n \nVine, R. (2005) ‘Taiwan’s new Bunker Museum’, \nhttp:\/\/www.findarticles.com\/p\/articles\/mi_m1248\/is_6_93\/ai_n13804259 \n[accessed 11 January 2007].  \n 39 \nYang, M.C. and Hsing, W.C. (2001) ‘Kinmen: governing the culture industry city in the \nchanging global context’, Cities, 18(2), pp. 77-85.  \n \nYeoh, B.S.A. (2005) ‘The global cultural city? Spatial Imagineering and politics in the \n(multi)cultural marketplaces of South-east Asia’, Urban Studies, 42(5\/6), pp. 945-\n958.  \n \nZhang, J.J. (2007) ‘Beyond the sun, sand and sea: Prospect of battlefield tourism \ndevelopment in Kinmen, Taiwan’, paper presented at the Inaugural Meeting of the \nIGU Commission on Islands: ‘Island Geographies’ International Conference, \nTaipei (Taiwan), October 2007.   \n"}