{"doi":"10.1080\/09687760802657577","coreId":"5421","oai":"oai:generic.eprints.org:853\/core5","identifiers":["oai:generic.eprints.org:853\/core5","10.1080\/09687760802657577"],"title":"Virtual learning environments – help or hindrance for the ‘disengaged’ student?","authors":["Maltby, Alice","Mackie, Sarah"],"enrichments":{"references":[{"id":1878528,"title":"Academic involvement at university.","authors":[],"date":"1993","doi":"10.1007\/bf01384745","raw":"Willis, D. 1993 Academic involvement at university. Higher Education 25, no. 2: 133–50.","cites":null},{"id":1878524,"title":"An outward design support system to increase self-efficacy in online teaching and learning.","authors":[],"date":"2003","doi":"10.1108\/10650740310455568","raw":"Steinbronn, P.E., and E.M. Merideth. 2003. An outward design support system to increase self-efficacy in online teaching and learning.  Campus-Wide Information Systems  20, no. 1: 17–24.","cites":null},{"id":1041599,"title":"Approaches to learning, evaluations of teaching, and preferences for contrasting academic environments.","authors":[],"date":"1990","doi":"10.1007\/bf00137106","raw":"Entwistle, N. J., and H. Tait. 1990. Approaches to learning, evaluations of teaching, and preferences for contrasting academic environments. Higher Education 19: 169–94.","cites":null},{"id":1041608,"title":"Comparing dropouts and persistence in e-learning courses.","authors":[],"date":"2007","doi":"10.1016\/j.compedu.2004.12.004","raw":"Levy, H. 2007. Comparing dropouts and persistence in e-learning courses. Computers and Education 48, no. 2: 185–204.","cites":null},{"id":1041600,"title":"Discipline and punish: The birth of a prison.","authors":[],"date":"1979","doi":"10.1215\/9780822390169-018","raw":"Foucault, M. 1979.  Discipline and punish: The birth of a prison.  Harmondsworth, UK: Penguin.","cites":null},{"id":1878526,"title":"Effective learning and the virtual learning environment. Keynote presented at the 2000 European Universities Information Systems Congress, April 13–14, in","authors":[],"date":"2000","doi":null,"raw":"Stiles, M. 2000. Effective learning and the virtual learning environment. Keynote presented at the 2000 European Universities Information Systems Congress, April 13–14, in Poznan, Poland.","cites":null},{"id":1041604,"title":"Engagement theory: A framework for technologybased teaching and learning.","authors":[],"date":"1999","doi":null,"raw":"Kearsley, G., and B. Shneiderman. 1999. Engagement theory: A framework for technologybased teaching and learning. Educational Technology 38, no. 5: 20–3.","cites":null},{"id":190266,"title":"Enhancing self-directed learning educational technology: When students resist the change.","authors":[],"date":"1999","doi":"10.1080\/1355800990360202","raw":"Akerlind, G., and A. Trevitt. 1999. Enhancing self-directed learning educational technology: When students resist the change. Innovations in Education and Training International 36, no. 2: 96–104.","cites":null},{"id":190272,"title":"General and domain-specific influence of prior knowledge on setting of goals and content use in museum websites.","authors":[],"date":"2006","doi":"10.1016\/j.compedu.2004.10.010","raw":"Corredor, J. 2006. General and domain-specific influence of prior knowledge on setting of goals and content use in museum websites. Computers and Education 47, no. 2: 207–21.","cites":null},{"id":1041602,"title":"House of Commons Committee of Public Accounts.","authors":[],"date":"2007","doi":null,"raw":"House of Commons Committee of Public Accounts. 2007. Staying the course: The retention of students on higher education courses. United Kingdom Partliament. http:\/\/ www.publications.parliament.uk\/pa\/cm200708\/cmselect\/cmpubacc\/322\/322.pdf Jackson, L., F. Biocca, A. Eye, H. Fitzgerald, G. Barbatsis, Y Zhao, and D. Ware. 2000. HomeNetToo: Motivational, affective and cognitive factors and Internet use: A model to explain the racial digital divide and the Internet paradox. In Proceedings of WebNet World Conference on the WWW and Internet, 736–7. Chesapeake, VA: AACE.","cites":null},{"id":1041605,"title":"How are doing? Tracking the quality of the undergraduate experience from the 1960s to the present.","authors":[],"date":"1999","doi":null,"raw":"Kuh, G. 1999. How are doing? Tracking the quality of the undergraduate experience from the 1960s to the present. Review of Higher Education 22, no. 2: 90–120.","cites":null},{"id":435004,"title":"Insomniacs or Hollywood extras? The reality of the Blackboard learning environment.","authors":[],"date":"2003","doi":null,"raw":"Maltby, A., and S. Mackie. 2003. Insomniacs or Hollywood extras? The reality of the Blackboard learning environment. Paper presented at Academy of Marketing Conference, July 9–11, in Birmingham, UK.","cites":null},{"id":435002,"title":"Jumping the hurdles – undergraduate student withdrawal behaviour.","authors":[],"date":"2001","doi":"10.1080\/14703290110056371","raw":"Mackie, S. 2001. Jumping the hurdles – undergraduate student withdrawal behaviour. Innovations in Education and Teaching International 38, no. 3: 265–76.","cites":null},{"id":190273,"title":"Metaphors and models in Internet based teaching.","authors":[],"date":"2001","doi":"10.1016\/s0360-1315(01)00049-5","raw":"Cronje, J.C. 2001. Metaphors and models in Internet based teaching. Computers and Education 37, nos 3–4: 241–86.","cites":null},{"id":1041603,"title":"MLE information pack: Briefing paper 1. Joint Information Systems Committee.","authors":[],"date":"2007","doi":null,"raw":"JISC. 2007. MLE information pack: Briefing paper 1. Joint Information Systems Committee. http:\/\/www.jisc.ac.uk\/whatwedo\/programmes\/buildmlehefe\/lifelonglearning\/mlebriefingpack.aspx.","cites":null},{"id":435010,"title":"Next generation learning: Knowledge café. Association for Learning Technology. http:\/\/www.alt.ac.uk\/docs\/gilly_salmon_20060907.ppt Selwyn,","authors":[],"date":"2006","doi":null,"raw":"Salmon, G. 2006. Next generation learning: Knowledge café. Association for Learning Technology. http:\/\/www.alt.ac.uk\/docs\/gilly_salmon_20060907.ppt Selwyn, N. 2000. Researching computers and education – glimpses of the wider picture. Computers and Education 34, no. 2: 93–101.","cites":null},{"id":190269,"title":"Panopticon; or the inspection-house.","authors":[],"date":"1962","doi":null,"raw":"Bentham, J. 1962. Panopticon; or the inspection-house. New York: Russell and Russell.","cites":null},{"id":1041607,"title":"Profiling students’ adaptation styles in Web-based learning.","authors":[],"date":"2001","doi":"10.1016\/s0360-1315(00)00046-4","raw":null,"cites":null},{"id":435005,"title":"Review of e-learning for education and training. Paper presented at the Networked Learning Conference,","authors":[],"date":"2002","doi":null,"raw":"Mason, R. 2002. Review of e-learning for education and training. Paper presented at the Networked Learning Conference, March 26–28, in Sheffield, UK.","cites":null},{"id":1041606,"title":"Screen or monitor? Surveillance and disciplinary power in online learning environments.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":1878510,"title":"Screen or monitor? Surveillance and disciplinary power in online learning environments. In Improving student learning using learning technology,","authors":[],"date":"2002","doi":null,"raw":"Land, R., and S. Bayne. 2002. Screen or monitor? Surveillance and disciplinary power in online learning environments. In Improving student learning using learning technology, ed. Chris Rust, 125–38. Oxford, UK: Oxford Centre for Staff and Learning Development.62  A. Maltby and S. Mackie Lee, M.G. 2001. Profiling students’ adaptation styles in Web-based learning. Computers and Education 36, no. 2: 121–32.","cites":null},{"id":435006,"title":"Signs of disengagement: The changing undergraduate experience in Australian universities.","authors":[],"date":"2001","doi":null,"raw":"McInnis, C. 2001. Signs of disengagement: The changing undergraduate experience in Australian universities. Parkville, Vic.: Faculty of Education, University of Melbourne.","cites":null},{"id":190268,"title":"Social foundations of thought and action: A social cognitive theory. Englewood Cliffs,","authors":[],"date":"1986","doi":null,"raw":"Bandura, A. 1986.  Social foundations of thought and action: A social cognitive theory. Englewood Cliffs, NJ: Prentice-Hall.","cites":null},{"id":190275,"title":"Styles of learning and approaches to studying in higher education.","authors":[],"date":"2001","doi":"10.1108\/03684920110391823","raw":"Entwistle, N. 2001. Styles of learning and approaches to studying in higher education. Kybernetes 30, nos 5–6: 593–602.","cites":null},{"id":435003,"title":"Supporting student group work using the Blackboard virtual learning environment.","authors":[],"date":"2002","doi":null,"raw":"Mackie, S., and M. Beeby. 2002. Supporting student group work using the Blackboard virtual learning environment. Paper presented at 1st Annual Teaching and Learning Conference, September 24–25, in Bristol, UK.","cites":null},{"id":1878522,"title":"Teaching at a distance: Techniques for tutors. In Teaching at a distance: Techniques for tutors,","authors":[],"date":"1990","doi":"10.1177\/026565909000600102","raw":"Simpson, O. 1990. Teaching at a distance: Techniques for tutors. In Teaching at a distance: Techniques for tutors, ed. S. Haag, 43–57. Ontario, Canada: University of Waterloo.","cites":null},{"id":190270,"title":"Teaching for quality learning and university.","authors":[],"date":"1999","doi":"10.1111\/j.1467-8535.2012.01317_3.x","raw":"Biggs, J. 1999. Teaching for quality learning and university. Buckingham, UK: SRHE and Open University Press.","cites":null},{"id":190274,"title":"The impact of institutional surveillance technologies on student behaviour.","authors":[],"date":"2006","doi":null,"raw":"Dawson, S. 2006. The impact of institutional surveillance technologies on student behaviour. Surveillance and Society 4, nos 1–2: 69–84.","cites":null},{"id":190271,"title":"The impact of IT on marketing: An evaluation.","authors":[],"date":"1999","doi":"10.1108\/00251749910302854","raw":"Brady, M., M. Saren, and N. Tzokas. 1999. The impact of IT on marketing: An evaluation. Management Decision 37, no. 10: 758–66.","cites":null},{"id":435007,"title":"The role of technology in servicing students with changing priorities.","authors":[],"date":"2001","doi":null,"raw":"Morgan, C.K. 2001. The role of technology in servicing students with changing priorities.","cites":null},{"id":435008,"title":"Tracking student behaviour, persistence, and achievement in online courses.","authors":[],"date":"2005","doi":"10.1016\/j.iheduc.2005.06.009","raw":"Univesity of Southern Queensland. http:\/\/www.usq.edu.au\/electpub\/e-jist\/docs\/Vol6_No1\/ role_of_technology_in_servicing_.htm Morris, L.V., C. Finnegan, and S. Wu. 2005. Tracking student behaviour, persistence, and achievement in online courses. Internet and Higher Education 8, no. 3: 221–31.","cites":null},{"id":1878523,"title":"Undergraduate marketing education in the 21st Century: Views from three institutions.","authors":[],"date":"1999","doi":null,"raw":"Smart, D.T., C. Tomkovick, E. Jones, and A. Menon. 1999. Undergraduate marketing education in the 21st Century: Views from three institutions. Marketing Education Review 9, no. 1: 1–9.","cites":null},{"id":435011,"title":"Victims tired of researchers getting away with murder.","authors":[],"date":"1993","doi":null,"raw":"Schlossberg, H. and G. Cebrzyninski. 1993. Victims tired of researchers getting away with murder. Marketing News 27: 16–18.","cites":null},{"id":190267,"title":"Virtual teamwork in very large undergraduate classes.","authors":[],"date":"2006","doi":"10.1016\/j.compedu.2004.09.004","raw":"Alexander, P.M. 2006. Virtual teamwork in very large undergraduate classes. Computers and Education 47, no. 2: 127–47.","cites":null},{"id":435009,"title":"Warp speed or snail’s pace? Pathways into the future of E-learning land.","authors":[],"date":"2002","doi":null,"raw":"Salmon, G. 2002. Warp speed or snail’s pace? Pathways into the future of E-learning land. Keynote presented at the Second National Virtual Learning Conference, June 24, in Bristol, UK.","cites":null},{"id":1041601,"title":"We think we can, we think we can, we think we can: The impact of thinking patterns and self-efficacy on work team sustainability. Team Performance Management:","authors":[],"date":"2003","doi":"10.1108\/13527590310468042","raw":"Houghton, J.D., C.P. Neck, and C.C. Manz. 2003. We think we can, we think we can, we think we can: The impact of thinking patterns and self-efficacy on work team sustainability. Team Performance Management: An International Journal 9, nos 1–2: 31–41.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-03","abstract":"The introduction of virtual learning environments (VLEs) has been regarded by some as a panacea for many of the problems in today’s mass numbers modular higher education system. This paper demonstrates that VLEs can help or hinder student engagement and performance, and that they should be adapted to the different types of learner. A project is described that aimed to investigate whether the introduction of a VLE can assist ‘disengaged’ students, drawing on click count tracking data and student performance. The project took place in the context of two very large undergraduate modules (850 and 567 students) in a Business School of a new university in the UK. In an adaptation of a model of learner engagement in Web-enhanced environments, four distinct learner types have emerged: model, traditionalist, geek and disengaged. There was evidence that use of the VLE exacerbated, rather than moderated, the differences between these learner types","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/5421.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/853\/1\/ALT_J_Vol17_No1_2009_Virtual_learning_environments.pdf","pdfHashValue":"e24f316adc74d96289dbe01f3012c23da3f95dcf","publisher":"Taylor and Francis Ltd","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:853<\/identifier><datestamp>\n      2011-04-04T08:55:56Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5431<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/853\/<\/dc:relation><dc:title>\n        Virtual learning environments – help or hindrance for the ‘disengaged’ student?<\/dc:title><dc:creator>\n        Maltby, Alice<\/dc:creator><dc:creator>\n        Mackie, Sarah<\/dc:creator><dc:subject>\n        T Technology (General)<\/dc:subject><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC Special aspects of education<\/dc:subject><dc:description>\n        The introduction of virtual learning environments (VLEs) has been regarded by some as a panacea for many of the problems in today’s mass numbers modular higher education system. This paper demonstrates that VLEs can help or hinder student engagement and performance, and that they should be adapted to the different types of learner. A project is described that aimed to investigate whether the introduction of a VLE can assist ‘disengaged’ students, drawing on click count tracking data and student performance. The project took place in the context of two very large undergraduate modules (850 and 567 students) in a Business School of a new university in the UK. In an adaptation of a model of learner engagement in Web-enhanced environments, four distinct learner types have emerged: model, traditionalist, geek and disengaged. There was evidence that use of the VLE exacerbated, rather than moderated, the differences between these learner types.<\/dc:description><dc:publisher>\n        Taylor and Francis Ltd<\/dc:publisher><dc:date>\n        2009-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/853\/1\/ALT_J_Vol17_No1_2009_Virtual_learning_environments.pdf<\/dc:identifier><dc:identifier>\n          Maltby, Alice and Mackie, Sarah  (2009) Virtual learning environments – help or hindrance for the ‘disengaged’ student?  Association for Learning Technology Journal, 17 (1).  pp. 49-62.  ISSN 0968-7769 (print)\/1741-1629 (online)     <\/dc:identifier><dc:relation>\n        10.1080\/09687760802657577<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/853\/","10.1080\/09687760802657577"],"year":2009,"topics":["T Technology (General)","LB Theory and practice of education","LC Special aspects of education"],"subject":["Article","PeerReviewed"],"fullText":"ALT-J, Research in Learning Technology\nVol. 17, No. 1, March 2009, 49–62\nISSN 0968-7769 print\/ISSN 1741-1629 online\n© 2009 Association for Learning Technology\nDOI: 10.1080\/09687760802657577\nhttp:\/\/www.informaworld.com\nVirtual learning environments – help or hindrance for the \n‘disengaged’ student?\nAlice Maltby* and Sarah Mackie\nBristol Business School, University of the West of England, Bristol, UK\nTaylor and FrancisCALT_A_365927.sgm(Received 22 July 2008; final version received 10 September 2008)\n10.1080\/09687760802657577ALT-J Research in Learning Technology0968 7769 (print)\/1741-1629 (online)Original Article2 09Taylor & Fr n is7 000Ma ch 2009Mrs Alic M ltbyl ce.Maltby@uwe.ac.uk\nThe introduction of virtual learning environments (VLEs) has been regarded by\nsome as a panacea for many of the problems in today’s mass numbers modular\nhigher education system. This paper demonstrates that VLEs can help or hinder\nstudent engagement and performance, and that they should be adapted to the\ndifferent types of learner. A project is described that aimed to investigate whether\nthe introduction of a VLE can assist ‘disengaged’ students, drawing on click count\ntracking data and student performance. The project took place in the context of\ntwo very large undergraduate modules (850 and 567 students) in a Business\nSchool of a new university in the UK. In an adaptation of a model of learner\nengagement in Web-enhanced environments, four distinct learner types have\nemerged: model, traditionalist, geek and disengaged. There was evidence that use\nof the VLE exacerbated, rather than moderated, the differences between these\nlearner types.\nKeywords: virtual learning environments; e-learning; self-efficacy\nIntroduction\nThe business world is not a global village but a global technological jungle, where\nsurvival depends on the ability to use IT in new and innovative ways. (Brady, Saren, and\nTzokas 1999, 764)\nIn a mass numbers modular higher education system, students may learn rapidly that\ntheir attendance is not closely monitored nor their absence penalised. Such students\nrisk becoming ‘disengaged’, failing to participate in academic life. This is a common\ncharacteristic among the 22% of students in England who fail to complete their higher\neducation course at their original institution (House of Commons Committee of Public\nAccounts 2007).\nThe introduction of a virtual learning environment (VLE) changes the relationship\nthat a student has with their course of study. The Joint Information Systems Commit-\ntee (JISC) (2007) defines a VLE as a set of components in which learners and tutors\nparticipate in ‘online’ interactions of various kinds, including online learning. VLE\nactivity data, sometimes called click count tracking, despite its imperfections,\nprovides an easily available, yet rudimentary, measure of student ‘learning’ activity.\nAlthough such systems may support flexible study, there is a concern that they may\n*Corresponding author. Email: Alice.Maltby@uwe.ac.uk\n50  A. Maltby and S. Mackie\nalso foster a belief among those students already distanced by the system that learning\ncan be delayed to some vague future date and diminishes further the perceived need\nto attend face-to-face sessions.\nThis project seeks to establish what relationships, if any, exist between undergrad-\nuates’ use of a VLE and academic achievement on two very large modules (Level 1\nOrganisation Studies, 850 students; and Level 2 Marketing, 567 students). The broader\npurpose of this is to see whether such measures can be used to identify disengaged\nstudents (Lee 2001) so that early interventions can be made that will build a stronger\nsense of self-efficacy (Bandura 1986) in an at-risk group.\nThe influences and effects of e-learning\nEffective use of new technology requires an evaluation of current pedagogy and a move\ntowards interactive and collaborative teaching and learning activities (Mason 2002;\nSalmon 2006; Stiles 2000). Failure to do so, according to Stiles (2000), could result\nin VLEs compounding the mistakes of the past, leaving the learner with a passive, unen-\ngaging experience leading to surface learning. Entwistle (2001) explains that a deep\napproach describes active engagement with the content, leading to extensive elabora-\ntion of the learning material, which contrasts with the surface approach of using routine\nmemorisation to reproduce those aspects of the subject matter expected to be assessed. \nVLEs are NOT neutral. Like any technology they embed underlying values about\nteaching and learning, promote certain affordances and reduce other choices. (Salmon\n2002, 8)\nThe concept of affordance, according to Salmon (2002, 2) means the properties of a\nsystem which allow certain actions to be performed and which encourage specific\ntypes of behaviour.\nThe affordance of publishing inherent within the commercial VLE used encourages\nstaff to use it to provide easy access to lecture slides and other teaching materials.\nHowever, Steinbronn and Merideth (2003) comment that copying and pasting lecturer\nnotes into a Web page may reproduce the material, but not the interactive communi-\ncation and engagement that can be promoted in a live lecture, with non-verbal expres-\nsion and body language. Furthermore, over-dependence on content-driven models\nresults in the same ‘boring’ material that was provided in lectures becoming boring\nWeb pages (Cronje 2001).\nWhile many academics focus on learning in relation to the use of VLEs, Selwyn\n(2000) argues that researchers need to be aware of the social, cultural, political and\neconomic aspects of educational computing; the soft as well as the hard concerns.\nAlexander (2006) develops this point, arguing that today’s diverse student body\nmeans that it is important to take cultural factors in account. The implication of this is\nthat opportunities should be created to ensure that individuals and minorities are\nallowed to develop mental models within their own context. This has been described\nas the ‘salad’ model of diversity, where the richness of the mixture is seen as valuable,\ninstead of the ‘melting pot’ where uniformity is encouraged (Alexander 2006).\nIt is also important to consider the motivational, affective and cognitive factors\n(Jackson et al. 2000) that might explain why some students are more willing to use\nVLEs than others. According to Mackie and Beeby (2002), unwillingness may be due\nto anxiety or a sense that change is imposed and may detrimentally affect learning.\nALT-J, Research in Learning Technology   51\nResistance may also be about risk adversity and an unwillingness to jettison old\n(successful) learning habits in order to try something new (Akerlind and Trevitt 1999).\nThese concerns highlight the importance of understanding students’ conceptions of\nthemselves in relation to study.\nThe importance of self-efficacy in learners\nAn important element of students’ self-conception, particular in relation to their clas-\nsification as being ‘at-risk’, is the concept of self-efficacy (Bandura 1986). This is seen\nas a factor in student willingness to engage with a course of study and a determinant\nof whether there is a positive relationship with achievement. Self-efficacy refers to\npeople’s judgments of their capabilities to organise and execute the courses of action\nrequired to attain designated types of performances. In other words, it is the belief that\none can do a task and can transfer the learning of that task to similar tasks. Of partic-\nular importance to our project is Willis’ (1993) reference to the point made by\nEntwistle and Tait (1990) that it is students’ perception of their environment rather\nthan its objective reality that impacts on learning. Steinbronn and Merideth (2003) add\nthat self-efficacy supplies motivation to persist and, since motivation enhances\nproblem solving, it influences later success. When applying the concept to online\nteaching and learning they emphasise the need to design online support that should\npositively impact the psychological and physical environment of teaching and learn-\ning in an electronic area and influence the retention rate of students.\nAn individual’s perceived self-efficacy, according to Houghton, Neck, and Manz\n(2003), will affect whether they are successful in performing a task. They state that\nindividuals who believe in their ability to complete a given task exert more effort and\npersist longer, thereby sustaining performance levels until success is achieved.\nMackie’s (2001) study supported this view: \nCommitted students have positive, realistic expectations of university and a long germ\ngoal, they are highly motivated and determined to stay despite any difficulties. (Mackie\n2001, 270)\nHowever, the poorly committed student experiences a lack of control over events and\nfeels helpless.\nFurthermore, feelings of self-efficacy relate to student engagement of the two\ntypes as distinguished by Willis (1993): \n● institutional engagement, the integration of the student into campus life; and\n● academic engagement, connected to factors directly linked with learning.\nThis concept of engagement has become a current buzzword in today’s educational\nenvironment. Kearsley and Shneiderman (1999) propose engagement theory as a\nmodel of technology-based teaching and learning. The idea underlying engagement\ntheory is that students must be meaningfully engaged in learning activities through\ninteraction with others and worthwhile tasks. Their theory posits three primary means\nto accomplish engagement: (1) an emphasis on collaborative efforts involving\ncommunication, planning, management and social skills; (2) project-based assign-\nments which make learning a creative, purposeful activity; (3) non-academic focus\ne.g. when the project has an outside customer in the community. It is proposed that\n52  A. Maltby and S. Mackie\nsuch a model of engagement pre-supposes self-efficacy, hence the focus here on this\nconcept as a means of supporting engagement.\nBuilding self-efficacy\nEarly interventions and feedback build students’ notions of self-efficacy. Simpson\n(1990) described the impact of an early intervention (a phone call prior to submission\nof the first piece of assessed work) on building the confidence of at risk students in an\nonline environment. Levy’s (2007) study into dropout rates found that students who\nwithdrew reported significantly lower satisfaction with e-learning than students who\nsuccessfully completed the same course. These findings have played a major role in\nthe development of the intervention processes in our own project.\nThe VLE offers opportunities for early and frequent formative feedback through\nonline assessment opportunities, and it has been argued that feedback has an impact\non the process of engagement as learning theory recognises the important function of\nfeedback. Biggs’ (1999) concept of constructive alignment is also relevant, with\ndesired behaviour being shaped by formative feedback.\nWhile we have been discussing students as a homogenous entity, a study involv-\ning mass modularisation of courses must recognise the changing and diverse student\npopulation. Many authors highlight the changing attitudes and circumstances of\nstudents and how this impacts on their motivation and academic performance (e.g.\nMcInnis 2001; Kuh 1999). A study by Smart et al. (1999) discovered that in compar-\nison to undergraduates surveyed 10 years before, undergraduates of the day were\nmore bored in class, more often over-slept and missed classes or appointments and\nwere less likely to study or do homework for six or more hours a week. We need,\ntherefore, to take into account that today’s students may be different to those who\nattended university before the advent of e-learning.\nOf particular interest was the finding by Smart et al. (1999) that, when examining\n‘at risk’ students (those in poor academic standing), marketing majors were slightly\nmore likely to experience academic troubles than general students at-large. They\noffered one potential explanation for this unfavourable comparison, marketing\nstudents typically work more hours per week for money than the other students, which\nwould leave less time to study. This situation is likely to be more widespread now,\nwith the introduction of fees for study in the UK.\nWith e-learning enabling students to spend more time off campus, Morgan (2001)\nargues that students need the motivation of feeling that they are a valued member of\na learning community. He refers to the experiences of institutions that have employed\nliberal open learning practices, concluding that transferring unrestricted power to\nstudents may not be in their best interests: \nThe reality of providing unfettered freedom for the student has resulted in unacceptably\nlow completion rates. (Morgan 2001, 2)\nSalmon (2006, 8) supplies an explanation for this finding by proposing that learners\ncannot affect their own learning until they have fundamental skills and maturity.\nAs well as differentiation between students in terms of their paid work commit-\nments, other factors may also shape their experiences. Lee (2001) developed a model\nthat proposes distinctions between types of learners. The model learner scores highly\non both academic achievement and satisfaction and is a frequent user of Web-based\nALT-J, Research in Learning Technology   53\nlearning resources, while the maladaptive (here, ‘disengaged’) student scores low on\nboth counts and is a low user of technology. This project was interested in establishing\nwhether it can confirm any correlations between learner type, the use of technology\nand academic performance. The suspicion is that the students disengaged with the\nVLE (‘maladaptors’) (Lee 2001) constitute the ‘at risk’ group.\nCase context\n‘New’ universities are polytechnics, central institutions or colleges of higher educa-\ntion granted university status by the Further and Higher Education Act 1992. Student\nnumbers on modules are much greater in many of these institutions compared with\nmore traditional universities. Many practice a cross-faculty modular scheme so\nstudents interact with a great many students but may not form the more traditional\nsupport network of key peers.\nSince September 2003, the two modules considered here have used the VLE in a\nnew university. The core of learning remains face-to-face, but pre- and post-session\nlearning activities increasingly take place online – preparatory work, readings, links\nto a wide range of resources, advice, formative assessment and revision. It is valued\nby staff as a ‘one-to-many’ electronic notice board and filing cabinet; an easy-to-update\nmechanism for course content distribution; and as a portal to a wide range of internal\nand external resources that blurs the boundaries of the module.\nMethodology\nA key part of the literature which informed the research design of the present study\nwas the importance of early interventions and feedback in building students’ notions\nof self-efficacy. Of particular relevance was Simpson’s (1990) description of the\nimpact of early interventions in building the confidence of at risk students in an online\nenvironment.\nThe objectives were to investigate the following questions: \n● What does the tracking data reveal about the online learning behaviours of\nstudents?\n● Is there any relationship between level of use, as measured by tracking data, and\nstudent performance?\n● Is the relationship the same for all forms of assessment and at all times of the\nacademic year?\nIt should be stated at the outset that, for ethical reasons, it was impossible to have a\ncontrol group for comparison that would not be exposed to the modules’ VLE. Track-\ning statistics indicating the amount of student access to the system were recorded at\nseveral points throughout the year and the non-users and low users were contacted\npersonally by module leaders. At the beginning of the academic year, straightforward\ninduction tasks linked to the use of the VLE were incorporated on the website to\nemphasise the importance of early and frequent use.\nThe key monitoring and intervention points during the investigation were: \n(1) Induction tasks linked to use of the VLE to emphasise the importance of early\nuse.\n54  A. Maltby and S. Mackie\n(2) Monitoring point one at end of October. Tracking statistics taken of number of\ntimes students accessed the VLE. A first email was sent to all non-users and\nlow users to remove any technical or personal barriers to use and to promote\nbeliefs of self-efficacy.\n(3) Monitoring point two (a) March. Tracking data were recorded. An email plus\nquestionnaire were sent to low and non users.\n(4) Monitoring point two (b) April. Letter plus questionnaire were sent 22 April\nto those who had not replied to the email.\n(5) Overall summaries of course usage were calculated for – October, term 1, term\n2, and overall usage.\n(6) End of year Field board reports were analysed – marks for the coursework\ncomponent, examination component and overall module were noted, plus the\npass\/fail outcome.\nIs VLE tracking ethical?\nAll research activities need to take ethical issues into account but the use of VLE\ntracking data in this project highlights particularly complex issues. The surveillance\ntools within VLEs enable lecturers and management to generate records for each\nuser indicating their level of accesses to the module, which particular areas they\naccess and the time of day or, more surprisingly, time of night at which they\naccess resources (Maltby and Mackie 2003). Land and Bayne (2002) stated that\nthese tools are far more than the electronic equivalent of the attendance sheet since\nthey provide intimate details of every student’s working hours and patterns of\nstudy.\nCyber-surveillance theory, building on the panopticon metaphor highlights the\nneed to understand how the virtual environment works. (The panopticon was a prison\ndesign created by Jeremy Bentham in 1785, where prisoners were able to observed at\nall times without seeing the observers (Bentham 1962; Foucault 1979)). \nOur chances of developing effective pedagogies for online learning will be greatly\nenhanced if we are prepared to recognise and work with the new modes of identity\nformation and new articulation of power\/knowledge that cyberspace technologies\nrepresent. (Land and Bayne 2002, 137)\nFurther research needs to be conducted on how students feel about these ethical issues\nof surveillance. Results may confirm Schlossberg and Cebrzyninski’s (1993) observa-\ntion that most people believed that they had already lost the right to control their\npersonal information because new technologies and large databases facilitate the\nincreasingly effective use of information about consumers and citizens. However, a\nrecent study by Dawson (2006) revealed that surveyed students indicated that their\nonline behaviour was influenced by the degree to which they perceived it to be\nsurveyed by both the institution and teaching staff, suggesting that it remains an issue\nfor students.\nIn our study, all the students on the two modules appeared in the tracking data.\nThey were advised that their online behaviour would be monitored and that they were\nunable to opt out of the process. Where individual students were contacted by the\nmodule leaders their anonymity was protected in the research findings (and this was\nmade clear to them).\nALT-J, Research in Learning Technology   55\nFindings\nFirstly, the relationship between tracking and performance data is presented for the two\nmodules. This is followed by the findings suggesting the importance of early monitoring.\nThirdly, we discuss the group of students who prefer traditional face to face teaching.\nAn overview of student use\nFirstly, we were interested in knowing whether there were any particular patterns in\nstudent use or examples of optimum usage.\nThe range of student use is highly variable, throughout the year (September to\nMay). For Organisation Studies level 1 students the average number of clicks per\nstudent was 189, but the range is from 0 to 1432. However, for Marketing level 2\nstudents, the average per student is higher, 222, and the range is wider from 0 to 2429.\nThe relationship between tracking and performance data\nThis is a key part of the project as it indicates whether there is any relationship\nbetween assessment performance and the use of the VLE.\nFor Organisation Studies Level 1 there was a steady increase in assessment perfor-\nmance in relation to the amount of times students accessed the VLE. Figure 1 shows\nTotal tracking into five groups\n385 to 1432 clicks\n223 to 384 clicks\n87 to 222 clicks\n33 to 86 clicks\n0 to 32 clicks\nM\nea\nn \nof\n o\nve\nra\nll \nm\nod\nul\ne \nm\nar\nk\n60\n50\n40\n30\nFigure 1. Correlation between online behaviour and assessment performance (MOB students).\n56  A. Maltby and S. Mackie\nthat those who only registered 0–32 clicks failed the module (average 34%) and those\nin the high use group (385–1432 clicks) averaged 55%.\nFigure 1. Correlation between online behaviour and assessment performance (MOB students).However, the results for Marketing Year 2 students were not as straightforward.\nThere seemed to be an optimum level of use i.e. between 277 and 437 clicks when\nstudents achieved a mean of 52%. Figure 2 shows that those students registering more\nthan 440 clicks dropped slightly to 50%.\nFigure 2. Correlation between online behaviour and assessment performance (Marketing).\nCan tracking data predict performance and identifying ‘at risk’ students?\nThe literature suggested the value of identifying ‘at risk’ students early on in the\nacademic year.\nFigure 3. The value of early tracking data for MOB students.The results demonstrate that the online behaviour patterns of potentially ‘at risk’\nstudents are formed surprisingly early in their university life. The Organisation\nStudies Level 1 findings reveal that by the end of October, 10% of students were not\nenrolled as users of the VLE and 20% of students had not yet used the VLE. These\nstudents performed less well (at 39% or 40% overall module mark) than students with\nhigher use patterns at that stage (56% overall module mark). Despite interventions in\nOctober to the Organisation Studies students, non-users\/low performers failed to\nchange their early online learning intentions. The Marketing Year 2 results did not\nshow such clear differences.\nWe must also take into account the responses to a questionnaire sent to non- and\nlow users which revealed a group (‘the traditionalists’) who were still engaged as they\nrespond to emails\/letters and were not ‘lost’ to the system, yet these students found\nTracking total five gps\n440+277-437114-27630-1130-29\nM\nea\nn \nof\n o\nve\nra\nll \nm\nod\nul\ne\n54\n52\n50\n48\n46\n44\n42\n40\nFigure 2. Correlation between online behaviour and assessment performance (Marketing).\nALT-J, Research in Learning Technology   57\nthe written resources (e.g. textbook) more helpful and expressed a preference for\ntraditional face-to-face teaching over online learning.\nDiscussion\nThis section will mirror the three strands discussed above, namely, the current think-\ning on e-learning, including whether e-learning can benefit students, the concept of\nself-efficacy and the ethical issues in the use of VLE tracking to monitor student\nbehaviour.\nCan e-learning benefit students?\nThere are many possible reasons for the different levels of use between the groups,\nwhich would have to be researched further. One confounding variable is the fact that\nsome students accessed the VLE using their password on their friend’s behalf to\ndownload lecture slides etc. Since for ethical reasons, it is impossible to have a control\ngroup, for comparison purposes, who have no access to the e-learning environment,\nwe have no way of knowing whether use of the VLE improves students’ performance\noverall.\nAnother possible issue relates to the finding by Smart et al. (1999) that marketing\nstudents typically work more hours per week for money than other students, which\nwould leave them with less time for study. We could suggest that since students in\nthis position are away from the university more, they need to use the VLE to make\nOctober tracking in five groups\n143 to 743 clicks66 to 1422 to 65 clickszero usenot on system\nM\nea\nn \nof\n o\nve\nra\nll \nm\nod\nul\ne \nm\nar\nk\n60\n50\n40\n30\nFigure 3. The value of early tracking data for MOB students.\n58  A. Maltby and S. Mackie\nup for what they are missing through poor attendance. However, the opposite may be\nthe reality, possibly because according to Morgan (2001), transferring unrestricted\npower to students may not be in their best interests. Similarly, Salmon (2006)\nsuggests that learners cannot affect their own learning until they have fundamental\nskills and maturity.\nThere is no doubt that the analysis of the project’s findings could have been much\nricher if the researchers had been able to interview the ‘non-participating’ students but\nsince they did not respond to any form of communication, or attend classes, they were\nimpossible to reach. Mackie and Beeby (2002) suggest that unwillingness to use VLEs\nmay be caused by anxiety. Similarly, Akerlind and Trevitt (1999) refer to risk\nadversity as being a potential factor. Solely using tracking statistics cannot illuminate\nthese issues.\nRelationship between tracking and performance data\nThese results were not straightforward and showed further discrepancies between the\ntwo modules. While the Organisation Studies results showed a positive correlation\nbetween the amount of VLE access and assessment performance, the Marketing\nresults were more complicated. The optimum level of access was between 277 and\n437 clicks. Increased access showed a detrimental effect on assessment performance.\nAn interesting explanation is proposed by Mason (2002, 7), who suggests: \nThe flexibility of the medium easily leads learners to allow other priorities to come\nbefore logging on to the course or group work. The much vaunted interactivity easily\nleads to overload. The ability to jump from one resource to the next on the Web (i.e.\nhypertext) can be over-used so that relatedness becomes an end in itself, and meaning\nis lost.\nMany other factors identified in the literature review could enrich the findings with\nfurther research. These include the social, cultural, political and economic aspects of\neducational computing (Selwyn 2000; Alexander 2006); the motivational, affective\nand cognitive factors (Jackson et al. 2000); and students’ prior knowledge (Corredor\n2006).\nThe importance of self-efficacy in learners\nThe rationale for this research was to use the VLE as an aid for identifying students\nwho can be deemed ‘at risk’. It had been assumed that early intervention would be\nimportant for some students in their first year. However, in contrast to this assumption,\nit was found that patterns of online learning appear to be fixed early on in students’\nuniversity careers. Despite the email interventions in October to the Organisation\nStudies students, non users\/low performers failed to change their early online learning\nintentions.\nWe have already defined self-efficacy as a factor in student willingness to engage\nwith a course of study and in having a positive relationship with student achievement.\nOur results highlight the need to investigate further those students whose behaviour in\nthe first October defines their university career. In particular, we need to study those\nfactors highlighted by Selwyn (2000), Alexander (2006), Jackson et al. (2000) and\nCorredor (2006).\nALT-J, Research in Learning Technology   59\nThe benefits and risks of online surveillance\nWe have reported that the results demonstrate the importance of monitoring early\nonline behaviour to be able to identify possible ‘at-risk’ students, which supports the\nfindings of Simpson (1990). Similarly, Morris, Finnegan and Wu (2005) demonstrated\nthe relationship between online user-behaviour and academic performance. The\nemployment of online surveillance thus enables the identification of students who may\nrequire additional scaffolding.\nThis complicates the ethical situation, since surveillance may be in the students’\nbest interests – it could be considered unethical for a tutor not to attend to students’\nbehaviour in this way. However, we must question the reasons and usage of online\nsurveillance. An ongoing discussion in the academic community centres on how we\ncan encourage independent learners who engage in deep learning (e.g. Entwistle 2001).\nFurther research needs to be conducted into whether by monitoring and intervening\nwe may be unintentionally encouraging surface learning and more student dependence.\nLee’s model of learner engagement in Web-enhanced environments\nWe have used this model to validate our own research findings. Lee’s (2001) model\nsuggests the emergence of four distinct learner types, shown in Figure 4, each with a\ndifferent combination of levels of use and academic performance:\nFigure 4. Adaptation of Lee’s (2001) model of learner engagement in Web-enhanced environments.\nModel students\nHigh use and high performance. Students’ expectations of the VLE are in line with\ntutor intentions (i.e. the VLE as Web-enhanced learning). These students understand\nwhat is expected of them and therefore learn appropriately as they make best use of\nall of the resources and learning opportunities available to them.\nTraditionalists\nLow use and high performance. These students favour face-to-face and print-based\nlearning. They are clear about this preference and learn appropriately from it. This\ngroup also objects to correspondence that implies a link between their lack of use of\nthe VLE and poor motivation and performance. As the core of the learning is still face-\nto-face for both modules they are not significantly disadvantaged by their low use of\nthe VLE as they are part of the learning community. This group would, however, be\ndisadvantaged by any move along the blended learning continuum towards a distance\nlearning model.\nGeeks\nHigh use and low performance. There is a mismatch between student and tutor inten-\ntions for the VLE. Geeks may interpret the VLE as a distance learning course or simply\nbe motivated by the technology rather than the course content or learning activities.\nThe disengaged\nLow performance and low use of the VLE. Mañana learners (and tomorrow never\ncomes). For reasons not understood at present, by the end of October this group has\n60  A. Maltby and S. Mackie\nstarted on a downward spiral of non attendance. They start off badly and never recover\nand increasingly operate at the periphery of the organisation. They learn inappropriately\nand fail at assessment points as they do not access the information available to them\nabout how to succeed.\nWhile some of our findings concur with Lee’s groupings, further investigation\nneeds to take place into the comparison of online behaviour statistics, face-to-face\nattendance patterns and assessment performance.\nConclusions\nThis paper aimed to investigate whether VLEs help or hinder student engagement\nand performance. It compared and analysed click count tracking data with student\nassessment grades on large Level 1 and Level 2 modules. The ultimate aim was to\nassess whether VLE tracking could identify the ‘disengaged’ student allowing the\nopportunity for staff interventions to help rectify the situation.\nTracking data revealed that students varied greatly in the amount that they access\nthe VLE. At best, as witnessed by ‘model’ learners, the VLE promotes a positive\nlearning climate and thereby student engagement as students benefit from flexibility\nand access to a wider range of resources and ‘Martini’ (anytime, any place, anywhere)\n‘just in time’ learning.\nAt worst, as witnessed by ‘disengaged’ learners, the VLE promotes a negative\nlearning climate and thereby student disengagement in that when used inappropriately\nit may encourage ‘Mañana’ learning, a sense that learning does not have to be\ncaptured in the moment and can be put off to some vague future date.\nAt this stage the learner typology is only tentative and requires further testing\nand development, most specifically with regards to the most problematic non-user\/\npoor performer disengaged group. We have already highlighted the problem of\nTraditionalists \nhigh\nPerform\nance \nlow\nModel\nGeeksDisengaged \nTracking data \nhigh\nLow\/low student characteristics:\nPerformance goal orientation \nSurface learning \nLow locus of control\nExtrinsically motivated \nLow perceived competence \nHigh\/ high student \ncharacteristics:\nLearning goal \norientation\nDeep learning \nIntrinsically \nmotivated\nHigh locus of \ncontrol\nSelf-efficacy \nFigure 4. Adaptation of Lee’s (2001) model of learner engagement in Web-enhanced\nenvironments.\nALT-J, Research in Learning Technology   61\ncommunicating with this group and the necessity of investigating whether anxiety\nand risk-adversity to using VLEs is relevant to their lack of engagement.\nThe literature review has revealed many other factors which were not included in\nthe research design but which could warrant future investigation. These include the\nsocial, cultural, political and economic aspects of educational computing (Selwyn\n2000; Alexander 2006), the motivational, affective and cognitive factors (Jackson\net al. 2000) and students’ prior knowledge (Corredor 2006) and whether or not online\nsurveillance nurtures surface and dependent learners (Dawson 2006; Land and Bayne\n2002).\nReferences\nAkerlind, G., and A. Trevitt. 1999. Enhancing self-directed learning educational technology:\nWhen students resist the change. Innovations in Education and Training International 36,\nno. 2: 96–104.\nAlexander, P.M. 2006. Virtual teamwork in very large undergraduate classes. Computers and\nEducation 47, no. 2: 127–47.\nBandura, A. 1986. Social foundations of thought and action: A social cognitive theory.\nEnglewood Cliffs, NJ: Prentice-Hall.\nBentham, J. 1962. Panopticon; or the inspection-house. New York: Russell and Russell.\nBiggs, J. 1999. Teaching for quality learning and university. Buckingham, UK: SRHE and\nOpen University Press.\nBrady, M., M. Saren, and N. Tzokas. 1999. The impact of IT on marketing: An evaluation.\nManagement Decision 37, no. 10: 758–66.\nCorredor, J. 2006. General and domain-specific influence of prior knowledge on setting of\ngoals and content use in museum websites. Computers and Education 47, no. 2: 207–21.\nCronje, J.C. 2001. Metaphors and models in Internet based teaching. Computers and Educa-\ntion 37, nos 3–4: 241–86.\nDawson, S. 2006. The impact of institutional surveillance technologies on student behaviour.\nSurveillance and Society 4, nos 1–2: 69–84.\nEntwistle, N. 2001. Styles of learning and approaches to studying in higher education. Kybernetes\n30, nos 5–6: 593–602.\nEntwistle, N. J., and H. Tait. 1990. Approaches to learning, evaluations of teaching, and\npreferences for contrasting academic environments. Higher Education 19: 169–94.\nFoucault, M. 1979. Discipline and punish: The birth of a prison. Harmondsworth, UK:\nPenguin.\nHoughton, J.D., C.P. Neck, and C.C. Manz. 2003. We think we can, we think we can, we think\nwe can: The impact of thinking patterns and self-efficacy on work team sustainability.\nTeam Performance Management: An International Journal 9, nos 1–2: 31–41.\nHouse of Commons Committee of Public Accounts. 2007. Staying the course: The retention\nof students on higher education courses. United Kingdom Partliament. http:\/\/\nwww.publications.parliament.uk\/pa\/cm200708\/cmselect\/cmpubacc\/322\/322.pdf\nJackson, L., F. Biocca, A. Eye, H. Fitzgerald, G. Barbatsis, Y Zhao, and D. Ware. 2000.\nHomeNetToo: Motivational, affective and cognitive factors and Internet use: A model to\nexplain the racial digital divide and the Internet paradox. In Proceedings of WebNet World\nConference on the WWW and Internet, 736–7. Chesapeake, VA: AACE.\nJISC. 2007. MLE information pack: Briefing paper 1. Joint Information Systems Committee.\nhttp:\/\/www.jisc.ac.uk\/whatwedo\/programmes\/buildmlehefe\/lifelonglearning\/mlebriefing-\npack.aspx.\nKearsley, G., and B. Shneiderman. 1999. Engagement theory: A framework for technology-\nbased teaching and learning. Educational Technology 38, no. 5: 20–3.\nKuh, G. 1999. How are doing? Tracking the quality of the undergraduate experience from the\n1960s to the present. Review of Higher Education 22, no. 2: 90–120.\nLand, R., and S. Bayne. 2002. Screen or monitor? Surveillance and disciplinary power in\nonline learning environments. In Improving student learning using learning technology,\ned. Chris Rust, 125–38. Oxford, UK: Oxford Centre for Staff and Learning Development.\n62  A. Maltby and S. Mackie\nLee, M.G. 2001. Profiling students’ adaptation styles in Web-based learning. Computers and\nEducation 36, no. 2: 121–32.\nLevy, H. 2007. Comparing dropouts and persistence in e-learning courses. Computers and\nEducation 48, no. 2: 185–204.\nMackie, S. 2001. Jumping the hurdles – undergraduate student withdrawal behaviour.\nInnovations in Education and Teaching International 38, no. 3: 265–76.\nMackie, S., and M. Beeby. 2002. Supporting student group work using the Blackboard virtual\nlearning environment. Paper presented at 1st Annual Teaching and Learning Conference,\nSeptember 24–25, in Bristol, UK.\nMaltby, A., and S. Mackie. 2003. Insomniacs or Hollywood extras? The reality of the\nBlackboard learning environment. Paper presented at Academy of Marketing Conference,\nJuly 9–11, in Birmingham, UK.\nMason, R. 2002. Review of e-learning for education and training. Paper presented at the\nNetworked Learning Conference, March 26–28, in Sheffield, UK.\nMcInnis, C. 2001. Signs of disengagement: The changing undergraduate experience in\nAustralian universities. Parkville, Vic.: Faculty of Education, University of Melbourne.\nMorgan, C.K. 2001. The role of technology in servicing students with changing priorities.\nUnivesity of Southern Queensland. http:\/\/www.usq.edu.au\/electpub\/e-jist\/docs\/Vol6_No1\/\nrole_of_technology_in_servicing_.htm\nMorris, L.V., C. Finnegan, and S. Wu. 2005. Tracking student behaviour, persistence, and\nachievement in online courses. Internet and Higher Education 8, no. 3: 221–31.\nSalmon, G. 2002. Warp speed or snail’s pace? Pathways into the future of E-learning land.\nKeynote presented at the Second National Virtual Learning Conference, June 24, in\nBristol, UK.\nSalmon, G. 2006. Next generation learning: Knowledge café. Association for Learning Tech-\nnology. http:\/\/www.alt.ac.uk\/docs\/gilly_salmon_20060907.ppt\nSelwyn, N. 2000. Researching computers and education – glimpses of the wider picture.\nComputers and Education 34, no. 2: 93–101.\nSchlossberg, H. and G. Cebrzyninski. 1993. Victims tired of researchers getting away with\nmurder. Marketing News 27: 16–18.\nSimpson, O. 1990. Teaching at a distance: Techniques for tutors. In Teaching at a distance:\nTechniques for tutors, ed. S. Haag, 43–57. Ontario, Canada: University of Waterloo.\nSmart, D.T., C. Tomkovick, E. Jones, and A. Menon. 1999. Undergraduate marketing educa-\ntion in the 21st Century: Views from three institutions. Marketing Education Review 9,\nno. 1: 1–9.\nSteinbronn, P.E., and E.M. Merideth. 2003. An outward design support system to increase\nself-efficacy in online teaching and learning. Campus-Wide Information Systems 20,\nno. 1: 17–24.\nStiles, M. 2000. Effective learning and the virtual learning environment. Keynote presented at\nthe 2000 European Universities Information Systems Congress, April 13–14, in Poznan,\nPoland.\nWillis, D. 1993 Academic involvement at university. Higher Education 25, no. 2: 133–50.\n"}