{"doi":"10.1109\/ICIIS.2006.365645","coreId":"71016","oai":"oai:eprints.lancs.ac.uk:8135","identifiers":["oai:eprints.lancs.ac.uk:8135","10.1109\/ICIIS.2006.365645"],"title":"Nanodevices : from novelty toys to functional devices - an integration perspective.","authors":["Pamunuwa, Dinesh","Weerasekera, Roshan"],"enrichments":{"references":[{"id":16371597,"title":"A study on the implementation of2-D mesh-based networks-on-chip in the manometer regime,&quot;","authors":[],"date":"2004","doi":null,"raw":"D. Pamunuwa et. al., &quot;A study on the implementation of2-D mesh-based networks-on-chip in the manometer regime,&quot; Integration, vol. 38, pp. 3-17, 2004. 1-4244-0322-7\/06\/$20.00 C2006IEEE 108 Authorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 09:25 from IEEE Xplore.  Restrictions apply.","cites":null},{"id":16371576,"title":"Charge tunneling rates in ultrasmalljunctions,&quot; Single Charge Tunneling,","authors":[],"date":"1992","doi":"10.1007\/978-1-4757-2166-9_2","raw":"G-L. Ingold, &quot;Charge tunneling rates in ultrasmalljunctions,&quot; Single Charge Tunneling, NATO ASI Series B, vol. 294, (Plenum Press, NY), pp. 21-107, 1992.","cites":null},{"id":16371587,"title":"CMOL FPGA: a reconfigurable architecture for hybrid digital circuits with two-terminal nanodevices,&quot;","authors":[],"date":"2005","doi":"10.1088\/0957-4484\/16\/6\/045","raw":"D. B. Strukov and K. K. Likharev, &quot;CMOL FPGA: a reconfigurable architecture for hybrid digital circuits with two-terminal nanodevices,&quot; Nanotechnology, vol. 16, pp. 888-900, 2005.","cites":null},{"id":16371564,"title":"CMOS design near the limit ofscaling&quot;,","authors":[],"date":"2002","doi":null,"raw":"Y. Taur, &quot;CMOS design near the limit ofscaling&quot;, IBM J Res. & Dev. vol. 46 no. 2\/3 March\/May 2002.","cites":null},{"id":16371559,"title":"Cramming more components onto integrated circuits,&quot;","authors":[],"date":"1965","doi":"10.1109\/jproc.1998.658762","raw":"G. E. Moore, &quot;Cramming more components onto integrated circuits,&quot; Electronics, vol. 38, pp. 114-117, 1965.","cites":null},{"id":16371581,"title":"Diameter-controlled synthesis ofsinglecrystal silicon nanowires,&quot;","authors":[],"date":"2001","doi":null,"raw":"Y. Cui et. al., &quot;Diameter-controlled synthesis ofsinglecrystal silicon nanowires,&quot; AppliedPhysics Letters, vol. 78, no. 15, pp. 2214-16, 2001.","cites":null},{"id":16371579,"title":"Electron Transport in Molecular Wire Junctions,&quot;","authors":[],"date":"2003","doi":"10.1126\/science.1081572","raw":"A. Nitzan and M. A. Ratner, &quot;Electron Transport in Molecular Wire Junctions,&quot; Science, vol. 300, pp. 1384-1389, May 2003.","cites":null},{"id":16371570,"title":"Electronics below 10nm,&quot; Nano and Giga Challenges in Microelectronics","authors":[],"date":"2003","doi":"10.1016\/b978-044451494-3\/50002-0","raw":"K. K. Likharev, &quot;Electronics below 10nm,&quot; Nano and Giga Challenges in Microelectronics (Amsterdam: Elsevier), pp. 27-68, 2003.","cites":null},{"id":16371585,"title":"Fabrication of5 nm linewidth and 14 nm pitch features by nanoimprint lithography,&quot;","authors":[],"date":"2004","doi":"10.1063\/1.1766071","raw":"M. D. Austin et. al., &quot;Fabrication of5 nm linewidth and 14 nm pitch features by nanoimprint lithography,&quot; AppliedPhysics Letters, vol. 84, no. 26, pp. 5299-5301, Jun. 2004.","cites":null},{"id":16371591,"title":"Fault-tolerant techniques for nanocomputers,&quot;","authors":[],"date":"2002","doi":"10.1088\/0957-4484\/13\/3\/323","raw":"K. Nikolic, A. Sadek, and M. Forshaw, &quot;Fault-tolerant techniques for nanocomputers,&quot; Nanotechnology, vol. 13, pp. 357-362, 2002.","cites":null},{"id":16371560,"title":"International technology roadmap for semiconductors (ITRS).","authors":[],"date":null,"doi":"10.1007\/978-3-642-23096-7_7","raw":"International technology roadmap for semiconductors (ITRS). [Online]. Available: http:\/\/www.itrs.net\/Links\/ 20051TRS\/Home2005.htm.","cites":null},{"id":16371595,"title":"Maximising throughput over parallel wire structures in the deep submicrometer regime,&quot;","authors":[],"date":"2003","doi":"10.1109\/tvlsi.2003.810800","raw":"D. Pamunuwa, L-R. Zheng, and H. Tenhunen, &quot;Maximising throughput over parallel wire structures in the deep submicrometer regime,&quot; IEEE Transactions on VLSI, vol. 11, no. 2, pp. 224-243, Apr. 2003.","cites":null},{"id":16371589,"title":"Nanowire-based sublithographic programmable logic arrays,&quot; in","authors":[],"date":"2004","doi":"10.1145\/968280.968299","raw":"A. DeHon and M. J. Wilson, &quot;Nanowire-based sublithographic programmable logic arrays,&quot; in Proc. ISFPGA, Feb. 2004, pp. 123-132.","cites":null},{"id":16371567,"title":"Overview ofNanoelectronic Devices,&quot;","authors":[],"date":"1997","doi":null,"raw":"Goldhaber-Gordon et al., &quot;Overview ofNanoelectronic Devices,&quot; Proc IEEE, vol. 85, pp. 521-540, 1997.","cites":null},{"id":16371593,"title":"Probabilistic logics andthe synthesis of reliable organisms from unreliable components,&quot; Automata Studies,","authors":[],"date":"1955","doi":null,"raw":"J. vonNeumann, &quot;Probabilistic logics andthe synthesis of reliable organisms from unreliable components,&quot; Automata Studies, eds. C. E. Shannon and J. McCarthy, Princeton NJ, pp. 43-98, 1955.","cites":null},{"id":16371573,"title":"Single-electron devices and their applications,&quot;","authors":[],"date":"1999","doi":"10.1109\/5.752518","raw":"K. K. Likharev, &quot;Single-electron devices and their applications,&quot; Proc. IEEE, vol. 87, pp. 606-632, Apr. 1999.","cites":null},{"id":16371583,"title":"Single-walled carbon nanotube electronics,&quot;","authors":[],"date":"2002","doi":"10.1109\/tnano.2002.1005429","raw":"P. L. McEuen, M. Fuhrer, and H. Park, &quot;Single-walled carbon nanotube electronics,&quot; IEEE Transactions on Nanotechnology, vol. 1, no. 1, pp. 75-85, Mar. 2002.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-08","abstract":"This paper looks at the prospects of continuing Moore's law into the deca nanometer regime using novel technology that has been recently proposed in the literature. It reviews some key advances in nanoelectronics, and provides an integration perspective for the ultimate goal of terascale integration. Issues from physical level circuits to system level architectures are discussed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71016.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/8135\/1\/conf16_ICIIS_2006.pdf","pdfHashValue":"bd95d8daaaeaf5096c34ef694e261bf51390c6d7","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:8135<\/identifier><datestamp>\n      2018-01-24T01:59:29Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5441<\/setSpec><setSpec>\n      74797065733D626F6F6B5F73656374696F6E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Nanodevices : from novelty toys to functional devices - an integration perspective.<\/dc:title><dc:creator>\n        Pamunuwa, Dinesh<\/dc:creator><dc:creator>\n        Weerasekera, Roshan<\/dc:creator><dc:subject>\n        TA Engineering (General). Civil engineering (General)<\/dc:subject><dc:description>\n        This paper looks at the prospects of continuing Moore's law into the deca nanometer regime using novel technology that has been recently proposed in the literature. It reviews some key advances in nanoelectronics, and provides an integration perspective for the ultimate goal of terascale integration. Issues from physical level circuits to system level architectures are discussed.<\/dc:description><dc:date>\n        2006-08<\/dc:date><dc:type>\n        Contribution in Book\/Report\/Proceedings<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/8135\/1\/conf16_ICIIS_2006.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/ICIIS.2006.365645<\/dc:relation><dc:identifier>\n        Pamunuwa, Dinesh and Weerasekera, Roshan (2006) Nanodevices : from novelty toys to functional devices - an integration perspective. In: Proceedings of the IEEE international conference on industrial and information systems. , 103 -108. ISBN 1-4244-0322-7<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/8135\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1109\/ICIIS.2006.365645","http:\/\/eprints.lancs.ac.uk\/8135\/"],"year":2006,"topics":["TA Engineering (General). Civil engineering (General)"],"subject":["Contribution in Book\/Report\/Proceedings","NonPeerReviewed"],"fullText":"First International Conference on Industrial and Information Systems, ICIIS 2006, 8 - 11 August 2006, Sri Lanka\nNanodevices: from novelty toys to functional devices an\nintegration perspective\nDinesh Pamunuwa' and Roshan Weerasekera2\n'Lancaster University\nCentre for Microsystems Engineering\nLancaster LA14YYW, UK\ndinesh@lancaster. ac. uk\nABSTRACT\nThis paper looks at the prospects of continuing\nMoore law into the deca nanometer regime using\nnovel technology that has been recently proposed in\nthe literature. It reviews some key advances in nanoe-\nlectronics, and provides an integration perspective\nfor the ultimate goal of terascale integration. Issues\nfrom physical level circuits to system level architec-\ntures are discussed\n1. INTRODUCTION\nUnderlying the astonishing advances in information tech-\nnology over the past 4 decades has been the ability of process\nengineers to continuously scale down the minimum feature\nsize that can be printed on a semiconductor wafer through\nlithography. Hence the size of the Metal Oxide Semiconduc-\ntor Field Effect Transistor (MOSFET), the workhorse of con-\ntemporary microelectronic circuits, has shrunk by several\norders of magnitude during this period. The benefits of scal-\ning can be analysed by examining the operation at the heart\nof all digital computation: the binary switching transfer\nimplemented by the MOSFET.\nMOSFET scaling gives us two obvious benefits; firstly,\nsmaller unit sizes means that a greater number of units can be\nfitted in a given area. This increases the computational\ncapacity (number of binary switching transfers that can be\naccomplished) for the same area from one technology gener-\nation to another, and is often presented as a saving in cost per\ntransistor. Secondly, scaling reduces the physical length of\nthe channel, which in turn leads to a faster switching speed,\nas to a first-order, the drift velocity of the electrons (and\nholes) within the channel of the MOSFET is proportional to\nthe applied field.\nThese obvious benefits apart, scaling of the MOSFET\nsizes is accompanied by voltage scaling, as reductions in\noxide thicknesses means that a constant electrical field (elec-\ntrical stress) in V\/cm can be maintained with a reduced volt-\nage. This gives us a third, equally important benefit in that\nthe energy of a binary switching transfer is proportional to\nthe square of the voltage. Hence, for example, halving the\nsupply voltage results in a 4-fold reduction in the energy.\nThe potential benefits of scaling were recognised in an oft-\ncited paper by Gordon Moore [1], who worked with William\n2Royal Institute ofTechnology (KTH)\nIMITILECS\nElectrum 229, SE-164 40 Kista, Sweden\nroshan@imit.kth.se\nShockley in the first ever high-tech start-up company of Sili-\ncon Valley, and went on to co-found Fairchild Semiconductor\nand Intel. He predicted that the number of transistors that\ncould be integrated onto a single die (unpackaged chip)\nwould double every year. He made this prediction from two\ndata points, but it has proved to be remarkably accurate, as\nevidenced by the plot in Figure 1 of millions of transistors in\nlead microprocessors over the years. This seeming \"some-\nthing for nothing\" violation of the free-lunch principle can be\nsummed up in the incredulity with which Carver Mead,\nanother pioneering figure in modern microelectronics\nregarded his own calculations in the fragment reproduced\nfrom [2] below:\n\"..I had been thinking about Gordon Moore s question, and\ndecided to make it the subject ofmy talk. As Ipreparedfor this\nevent, I began to have serious doubts about my sanity. My cal-\nculations were telling me that, contrary to all the current lore\nin the field, we could scale down the technology such that eve-\nrything got better: the circuits got more complex, they ran\nfaster, and they took less power -- WOW! That s a violation of\nMurphy s law that won't quit!..\nOne specific question that Mead considered was the\nimpact quantum tunnelling would have upon scaling, and his\ncalculations revealed no significant effects for feature sizes\nthat would enable integration of IO' 108 devices\/cm2. Many\nresearchers considered the length of 1gm a significant bar-\nrier. That milestone has long gone, and Intel have a stable 65\nFigure 1. Growth of Transistors in Intel Microprocessors\n1-4244-q322- 7\/06\/$20. 00 C2006 IEEE\nP6\nPe3ntiu mX proc\n286\n085\na- a aa>s> aoreyIne Croation\n103\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 09:25 from IEEE Xplore.  Restrictions apply. \nFirst International Conference on Industrial and Information Systems, ICIIS 2006, 8 - 11 August 2006, Sri Lanka\nnm technology for microprocessors and a 45nm technology\nfor SRAM. The end of the roadmap [3] for scaling of the\nconventional MOSFET is however in sight, due to a variety\nof reasons ranging from technological to fundamental.\nWhen the dimensions of a MOSFET are scaled down,\nthe area of the gate oxide is reduced. Since the gate oxide\nacts primarily as a capacitor, the thickness has to be\nreduced to compensate for the reduction in area. This\nmeans the voltage level must also be reduced to avoid\nmaterial breakdown. Since the electron thermal voltage, kT\/\nq (where k is Boltzmann's constant, T the temperature in\nkelvins and q the charge of an electron in coulombs) is a\nconstant at room temperature, the ratio between the operat-\ning voltage and the thermal voltage inevitably shrinks. This\nleads to higher source-to-drain leakage currents stemming\nfrom the thermal diffusion of electrons. At the same time,\nwhen the gate oxide has been scaled to a thickness of only a\nfew atomic layers, quantum-mechanical tunnelling gives\nrise to a sharp increase in gate leakage currents [4]. The\neffects of these fundamental factors on CMOS scaling\nmanifest themselves in increased leakage current and\nreduced performance (drive current). Additionally, there\nare numerous technological hurdles to solve in scaling\nbeyond the 24nm node [3].\nTo continue reaping the benefits of scaling, we need to\ngradually evolve to true quantum nano devices that work\non quantum principles rather than continue to battle against\nthese effects in the conventional MOSFET structure. The\nrest of this paper will outline some promising devices that\nhold out the potential of being a mainstream technology in\nthe long term to rival Complementary Metal Oxide Semi-\nconductor (CMOS) technologies, and identify key chal-\nlenges from an integration perspective.\n2. PHYSICS OF QUANTUM NANODE-\nVICES\nThis section is a simplified explanation of the physics\nunderlying the operation of some important quantum nano\ndevices. Quantum nanodevices can be categorised into\nsolid-state and molecular devices. Although lithographi-\ncally fabricated solid-state nanodevices are unlikely to be\nthe solution to extending the roadmap as discussed in sec-\ntion 3, it is insightful to understand the physical operation\nof key solid-state nanoelectronic devices; the operation of\nrelevant molecular devices can be understood qualitatively\nusing similar arguments.\nAs explained in [5], the essential structural feature that\nall solid-state nanoelectronic devices have in common is a\nsmall \"island\" composed of semiconductor or metal in\nwhich electrons may be confined. The extent of confine-\nment of electrons in the island (i.e. whether having 0, 1, 2\nor 3 classical degrees of freedom) defines the categories of\nquantum dots (QDs), resonant tunnel devices (RTDs) and\nsingle-electron transistors SETs. The composition, shape,\nand size of the island gives the different devices their dis-\ntinct properties. Controlling these factors permits the\ndesigner of the device to employ quantum effects in differ-\nent ways to control the passage of electrons on to and off of\nthe island.\nTwo essential quantum mechanical effects are exhibited\nby electrons confined to nanometer-scale islands between\nclosely spaced potential energy barriers. First, each elec-\ntron's energy is restricted to one of a finite number of one-\nelectron energy levels (quantum states with discrete, \"quan-\ntised\" energies). The smaller the distance between the bar-\nriers (i.e., the smaller the island), the more widely spaced in\nenergy are the levels for the electrons in the potential well\nbetween the barriers. Second, if the potential barriers are\nthin enough (approximately 5-10 nm or less, depending on\nthe height of the barriers), electrons occupying energy lev-\nels lower than the height of the barrier have a finite proba-\nbility of \"tunnelling\" through the barrier to get on or off the\nisland. Tunnelling is a consequence of the wave-nature of\nparticles (in this case the electron). The wavefunction\ndecays exponentially into the barrier, but if the barrier is\nthin enough, there is a non-zero probability of the electron\nending up on the other side of the barrier.\nThere are two energies associated with an electron tun-\nnelling onto the island as shown in Figure 2.a. The symbol\nAe represents the spacing between two energy levels in a\npotential well and is the excitation energy, being the energy\nrequired to excite an electron to make the jump to the next\nlevel. There is also an energy U, the charging energy, asso-\nciated with the electrostatic force which repels an electron\ntrying to enter a space already occupied by N electrons.\nThus the difference in energy between the lowest quantum\nstate for N electrons and that for N+1 electrons for an\nisland is Ae + U. When a bias voltage is applied across the\nisland, it induces mobile electrons in the conduction band\nof the source region to attempt to move through the poten-\ntial well in the island region to get to the region of lower\npotential in the drain region. The only way for electrons to\npass through the device is to tunnel on to and off the island\nthrough the two high potential barriers that define the\nisland and separate it from the source and the drain. But\ntunnelling can occur and charge can flow toward the drain\nonly if there is an unoccupied quantum energy level in the\nwell at an energy that matches one of the occupied energy\nlevels in the source band. RTDs (and other categories of\nnanoelectronic devices) work by means of tuning the\nenergy of the quantum states in the potential well on the\nisland relative to the energy of the bands in the source and\ndrain.\nAn example of this is diagrammed in Figure 2.a. Increas-\ning the applied voltage bias across the device of (a) pro-\ngressively lowers the energy of all the states in the well\nrelative to the energies ofthe electrons in the source. This is\nshown in (b) and (c). When the bias potential is sufficient to\nlower the energy of an unoccupied one-electron quantum\nstate inside the well to be within the range of energies for\nthe source conduction band, the quantum well is said to be\n\"in resonance\" or \"on,'\" and current can flow onto the\nisland and out to the drain. This is shown schematically in\n(c). Otherwise, current through the device is blocked the\ndevice is \"out of resonance\" or switched \"off,\" as in (b).\nThis use of a variable applied bias to switch a tunnelling\ncurrent on and off characterizes the operation of a two ter-\nminal RTD. Similar adjustment of the energy levels in the\n1-4244-0322- 7\/06\/$20. 00 C2006 IEEE 104\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 09:25 from IEEE Xplore.  Restrictions apply. \nFirst International Conference on Industrial and Information Systems, ICIIS 2006, 8 - 11 August 2006, Sri Lanka\nEnergy\nUnoccupied\nLevels\n0\nI=I\nFermi evel\nBand Edge\nI\" excited energy state for\nN+1 ens in potential well\nLowest energy state for\nA£F- \/ N+1 ens in potential well\nI Iet£\nu 8 Lowest energy state for\nN ens in potential well\nDistance\nIslanir Drainr\nWide bandgap Narrow bandgap\nsemiconductor\nsemiconductor\nFig. 2.a: Quantised energy states for a potential well\nDistance\nEnergy\n(c) t\nDistance\nFig. 2.a: Tuning Energy States for Controlled Tunnelling\nFigure 2. Operation of Different Solid-State Quantum Nanodevices (source: [5])\npotential well relative to those in the source also can be\nachieved by varying the voltage on a third (gate) terminal,\nrather than the voltage on the source. Such a three-terminal\nconfiguration results in an RTT, where a small gate voltage\ncan control a large current across the device. Thus, an RTT\ncan perform as both switch and amplifier, just like a con-\nventional MOSFET.\nQDs are constructed with islands that are short in all\nthree dimensions, confining the electrons with zero classi-\ncal degrees of freedom i.e. electronic states are quantised\nin all three dimensions. The dot-like island may be made of\neither metal or semiconductor. Making an island short in all\nthree dimensions leads to widely spaced quantum energy\nlevels for an electron on the island. The charging energy is\nalso large, because there is no way for a pair of electrons to\nget far from each other. This results in a different IV curve\nthan an RTD.\nAn SET is always a three-terminal device, with gate,\nsource, and drain, unlike QDs and RTDs, which may be\ntwo-terminal devices without gates. Also, an SET's island\nhas no very short dimension and no very long one either.\nThe island is usually made of metal and emphasizes U over\nAE, a defining characteristic of the energetic profile of the\nSET.\nAn SET switches the source-to-drain current on and off\nin response to small changes in the charge on the gate\namounting to a single electron or less. In order to control\nthe number of electrons on the island, a metal gate elec-\ntrode is placed nearby. A sufficient increase in the voltage\nof the gate electrode induces an additional electron to tun-\nnel onto the island from the source. The extra electron soon\ntunnels off onto the drain. This double-tunnelling process\nrepeats millions of times a second, creating a measurable\ncurrent through the island. As the gate voltage is increased,\nthe number of electrons on the island stabilises at one more\nthan previously, resulting in a drop in current. Further\nincreases result in the same behaviour, so that multiple on-\nstates can be identified at different gate voltages. For a\nmore detailed explanation of the phenomena described\nbriefly here, the interested reader can refer [5]-[8].\n3. PERSPECTIVES FOR FUTURE\nINTEGRATION\nThe main premise of moving to a fundamentally differ-\nent technology than CMOS is greater integration with\nacceptable reliability. One of the key challenges lies in the\nfabrication of the material islands, the requisite sizes of\nwhich can be quantified by a simple analysis. The change\nin energy for a tunnelling event is quantised as explained\nearlier, and can be described by\n2EC e\/12C (1)\nwhere C is the total island capacitance. This is identical to\nthe charging energy associated with a capacitor. For this\nenergy to be significant, it has to be much greater than the\nthermal energy (where kB is Boltzmann's constant and T is\ne2\/2C>>kBT (2)\nthe temperature in kelvin) as otherwise thermal fluctuations\nwill mask it.\nEquation (2) establishes a straightforward relation\nbetween the capacitance and hence the geometry of the\nisland, and the operating temperature. As an example, for\nan island size on the order of 1gm, a junction area of\napproximately 100nm x 100nm with an oxide layer thick-\nness of Inm, the capacitance is on the order of 1fF. This\ncorresponds to a temperature of about 1K. However for\nreliable operation in a digital environment, the charging\nenergy should be larger than the thermal energy by a factor\nof around 100. At room temperature, the corresponding\nisland size is approximately Inm. One of the major chal-\nlenges for the use of single electronic devices in integrated\n1-4244-0322- 7\/06\/$20. 00 C2006 IEEE\nA\n105\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 09:25 from IEEE Xplore.  Restrictions apply. \nFirst International Conference on Industrial and Information Systems, ICIIS 2006, 8 - 11 August 2006, Sri Lanka\ncircuits (ICs) is the reproducible fabrication of circuits with\nsuch small features.\n3.1 Fabrication of Single Electronic Devices\nThe current state of the art in lithography allows feature\nsizes of around 20nm to be printed on a Si wafer, and there\nare techniques such as electron-beam lithography which\npromise smaller dimensions, but these are presently uneco-\nnomical [3]. Most innovative bottom-up techniques which\nhave resulted in measurable single-electron behaviour suf-\nfer from the disadvantage of unpredictable device parame-\nters, which precludes their use in ICs. Another possible\ntechnique is the use of scanning probes to manipulate mate-\nrial on a nano scale'. A major limitation of this method in\nIC fabrication is speed, since parallel fabrication of mil-\nlions of devices is infeasible. To overcome the reproduci-\nbility problem and get the true benefit of single electronic\nphenomena, it appears that the most promising approach is\nto use nature's building block of Inm dimension, the mole-\ncule.\nExperimental observation of electron transport through\nmolecules has been reported in the literature, the mecha-\nnism of which can be explained qualitatively as follows. A\nmolecule has discrete electron orbitals, and if the molecule\nis long enough, the attachment of electrodes will not signif-\nicantly affect these orbitals. Analogous to solid-state\ndevices, there will be an energy gap between the highest\noccupied molecular orbital (HOMO) and the lowest unoc-\ncupied molecular orbital (LUMO). If the Fermi level of the\nelectrodes falls between these levels, no current will flow\nin the absence of an applied voltage. An applied voltage\nwill cause the HOMO or LUMO levels to be aligned with\nthe Fermi level of each electrode in turn, and electrons will\nflow in two hops, passing from one electrode to the mole-\ncule, and from the molecule to the other electrode [9]. The\nphysical analysis is very similar to that already described in\nSection 2, although some of the exact mechanisms of inter-\naction are not completely resolved.\nAlthough many molecular electronic devices have been\ndemonstrated by physicists and chemists in laboratories,\nthey mostly suffer from the same disadvantage of not being\nreproducible with any uniformity, accuracy or predictabil-\nity in great numbers. One solution has been suggested by\nsome promising recent developments in nanowire fabrica-\ntion. The basic idea is to produce arrays of nanowires, and\nconnect them with programmable nanodevices. Two key\nissues are, how to connect the nanowires to the nanode-\nvices, and how to address the array.\nThe addressing problem can be solved by changing the\nproperty of the nanowire, such as its doping, along its axis,\nthus allowing some peripheral control circuitry comprising\n1. One of the best known applications of scanning probe\ntechniques is in memory, such as the Millipede initiative\nby IBM, which uses heated Atomic Force Microscope\n(AFM) tips to make tiny indentations in a polymer. the\nabsence or presence of an indentation represents Is and\nOs.\ndevices with a larger footprint to access it. The nanowires\nthemselves can either be synthesized as free-standing wires\nsuch as in [10] or [11], and aligned into an array using flow\ntechniques, or created as an ordered array using techniques\nsuch as nanoimprinting [12]. Two orthogonal nanowire\narrays can be combined so that molecular nanodevices\nform the vertical connection [13], [14]. Since the devices\ncan be programmed to be 'on' (short circuit) or 'off' (open\ncircuit) this provides a programmable fabric, in this case an\nOR plane.\nThe combination of the nanodevices with the nanowires\ncan be achieved by depositing a self-assembled monolayer\n(SAM) on one array, and then depositing the second array\non it. A SAM is essentially a technique where a solution\ncontaining the required molecules is deposited and the\nexcess is washed off. The molecules bond to the surface\nand hence remain.\n3.2 Defect Tolerant Architectures\nA second non-trivial problem in the use of single elec-\ntronic devices is the problem of background charge. If any\ncharged impurity is located at some distance from the\nisland and this distance is comparable to the size of the\nisland, a polarisation will result. This will affect all charac-\nteristics of the device, and essentially render that device\nunusable. Since there will always be an inescapable mini-\nmum impurity level in any fabrication process, this essen-\ntially means that some portion of the devices on a chip will\nbe unusable, or in other words the yield will be lower than\nin a stable CMOS technology. The solution to this problem\nis more likely to be found in the architecture of the system\nthan in technological improvements. There could also be\ntransient variations due to leakage or external pertubations\nsuch as noise. Hence along with some percentage of the\ndevices never working at all, a likelihood exists that some\nof the devices will work some of the time. This is poten-\ntially a bigger problem leading to intermittent system fail-\nures. Most fault-tolerant techniques for nanocomputing\nfeature some sort of redundancy [15]. The basic idea is that\na function is implemented many times, and the output is\nresolved through a majority gate. So for example, if the\nredundancy is a factor of three, and each block should out-\nput logic '1', but due to an error only two function cor-\nrectly, the output is proportional to 2\/3 rather than 1. By\nrelaxing the threshold appropriately, the correct output can\nstill be obtained. Many variations on this theme exist,\nincluding a multiplexing scheme which allows functional\ncircuits to be built out of building blocks with a failure rate\nof around 1%, but requires redundancy factors on the order\nof 103104. Generally there is a clear trade-offbetween area\nand reliability in all these approaches. The question of\nwhether the levels of redundancy required in a specific\nmolecular device technologies would allow favourable\ncomparisons with CMOS in terms of integration density,\npower consumption and system bandwidth is unresolved.\nAlso, there needs to be a clearly defined interface to\nCMOS from the nanoscale building blocks in a physical\nsense and in a methodological sense. Most bottom-up fabri-\n1-4244-0322- 7\/06\/$20. 00 C2006 IEEE 106\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 09:25 from IEEE Xplore.  Restrictions apply. \nFirst International Conference on Industrial and Information Systems, ICIIS 2006, 8 - 11 August 2006, Sri Lanka\nTile (resource+switch)\nk .Sk\n.............................................................. ...........\n.................................................................. .................................................................................................... ... ...................................... .....\n.................................................................\n............................................................. .... ............\n......................................................................................................................................................\n................................................................L Xm >-S 1_ I- _0 SW,,128 F\nvwi. -\nTop left is afolded torus network-on-chip topologyfrom [18] which represents a way ofmanaging on-chip interconnect woes; each tile represents\na resource and switch, where the resource implements custom logic, while the switch communicates with the on-chip network, andprovides the\nnetwork interface; a tile is expanded into a switch and resource on the top right; the resource is implemented as a nano PLA from [141, but it can\nbe any nanoscale implementation in general; the OR plane is expanded in the middle left picture, again as specified in [14].\nFigure 3. A possible architecture for terascale integration\ncation techniques are feasible only for 2-terminal devices,\nmost of which are non-restoring. CMOS provides a simple\nregenerative technique for interblock communication.\nMore generally, CMOS will provide the means of interfac-\ning to other technologies and the rest of the world, and the\narchitecture should reflect this.\nFrom a methodology point of view, the past 30 years has\nseen the development of a well defined set of abstract mod-\nels and integrated hierarchical design tool framework for\nCMOS, which has been essential to complex multi million\ndevice IC design. Novel technologies which provide very\nsmall building blocks need to be encompassed to a tradi-\ntional CMOS design flow, to take advantage of this well-\nestablished framework.\nAnother crucial point in the architectural design stems\nfrom the properties of wires. On-chip wires are commonly\nmade of Al or Cu, and contrary to devices, become slower\nthe more they are scaled. The reason is, they become highly\nresistive and stop behaving like equipotential regions.\nRather, signal propagation is governed by the diffusion\nequation, and associated with a wire is a time constant\ntiv R1WC1 (3)\nBoth Rw and Cw are essentially proportional to wire length,\nand hence cw is a quadratic function of wire length. This is\none of the fundamental bottlenecks in on-chip communica-\ntion [17], and emphasises the need for locality in system\narchitecture. To mitigate this problem, scaling of wires is\n1-4244-0322- 7\/06\/$20. 00 C2006 IEEE\n-p.\nRestaration Caelummi\n107\nIld'\n..4\n4 AAzzzz.41I\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 09:25 from IEEE Xplore.  Restrictions apply. \nFirst International Conference on Industrial and Information Systems, ICIIS 2006, 8 - 11 August 2006, Sri Lanka\ncarried out in a hierarchical manner, so that local wires are\nscaled aggressively, whereas global, chip-level intercon-\nnects are scaled much less.\nConsidering all these diverse requirements, one possible\nsolution is outlined in Figure 3. As argued in [18], dealing\nwith on-chip interconnection woes is made easier if there is\nregularity at the global level. Global communication within\nthe chip is achieved by means of an on-chip network,\nwhose parameters can be closely controlled. Each tile com-\nprises a resource where custom logic or memory is imple-\nmented, and a switch, which provides the interface from the\nresource to the network. The resource can be implemented\nin any feasible technology, and the figure shows the archi-\ntecture proposed in [14], called nano PLA. It must be\nemphasised that such a system level view is hypothetical,\nand considerable technical challenges remain. However it\nmarries the best of both worlds, CMOS and nanotechnol-\nogy, to utilise known strengths and mitigate the effects of\nknown weaknesses.\n4. CONCLUDING REMARKS\nSome very exciting advances in state of the art technol-\nogy has given the electronics design community the prom-\nise of integrating a trillion nanoscale devices on a single\nchip. The reliable building block that is the MOSFET suf-\nfers from short-channel degradations which are manifesta-\ntions of quantum mechanical phenomena at channel lengths\naround 25nm. Therefore it makes sense to explore alternate\ndevices which operate on these very principles, rather than\nin spite of them. From an analysis of the fundamental phys-\nics, and taking into account realistic technological capabili-\nties, one of the best perspectives for reliable assembly of\nnano devices on a large scale uses nanowires, with the\ndevices forming a vertical connection between two arrays.\nSeveral research groups have demonstrated potential\napproaches based on this concept.\nAn important caveat in building a terascale system is the\npresence of a CMOS interface, at difference hierarchical\nlevels within the system itself, and also as a connection to\nthe outside world. This paper has briefly investigated a pos-\nsible architecture that satisfies this requirement, using\nknown methods and also hypothesizing solutions based on\nadvances reported in the literature.\n5. ;REFERENCES\n[1] G. E. Moore, \"Cramming more components onto inte-\ngrated circuits,\" Electronics, vol. 38, pp. 114-117,\n1965.\n[2] T. Hey and P. Walters, The new Quantum Universe,\nCUP, 2nd ed., p. 187, 2003.\n[3] International technology roadmap for semiconductors\n(ITRS). [Online]. Available: http:\/\/www.itrs.net\/Links\/\n20051TRS\/Home2005.htm.\n[4] Y. Taur, \"CMOS design near the limit of scaling\", IBM\nJ Res. & Dev. vol. 46 no. 2\/3 March\/May 2002.\n[5] Goldhaber-Gordon et al., \"Overview of Nanoelectronic\nDevices,\" Proc IEEE, vol. 85, pp. 521-540, 1997.\n[6] K. K. Likharev, \"Electronics below 10nm,\" Nano and\nGiga Challenges in Microelectronics (Amsterdam:\nElsevier), pp. 27-68, 2003.\n[7] K. K. Likharev, \"Single-electron devices and their\napplications,\" Proc. IEEE, vol. 87, pp. 606-632, Apr.\n1999.\n[8] G-L. Ingold, \"Charge tunneling rates in ultrasmall junc-\ntions,\" Single Charge Tunneling, NATO ASI Series B,\nvol. 294, (Plenum Press, NY), pp. 2 1-107, 1992.\n[9] A. Nitzan and M. A. Ratner, \"Electron Transport in\nMolecular Wire Junctions,\" Science, vol. 300, pp.\n1384-1389, May 2003.\n[10]Y. Cui et. al., \"Diameter-controlled synthesis of single-\ncrystal silicon nanowires,\" Applied Physics Letters, vol.\n78, no. 15, pp. 2214-16, 2001.\n[1 I]P. L. McEuen, M. Fuhrer, and H. Park, \"Single-walled\ncarbon nanotube electronics,\" IEEE Transactions on\nNanotechnology, vol. 1, no. 1, pp. 75-85, Mar. 2002.\n[12]M. D. Austin et. al., \"Fabrication of 5 nm linewidth and\n14 nm pitch features by nanoimprint lithography,\"\nApplied Physics Letters, vol. 84, no. 26, pp. 5299-5301,\nJun. 2004.\n[13]D. B. Strukov and K. K. Likharev, \"CMOL FPGA: a\nreconfigurable architecture for hybrid digital circuits\nwith two-terminal nanodevices,\" Nanotechnology, vol.\n16, pp. 888-900, 2005.\n[14]A. DeHon and M. J. Wilson, \"Nanowire-based sub-\nlithographic programmable logic arrays,\" in Proc. ISF-\nPGA, Feb. 2004, pp. 123-132.\n[15]K. Nikolic, A. Sadek, and M. Forshaw, \"Fault-tolerant\ntechniques for nanocomputers,\" Nanotechnology, vol.\n13, pp. 357-362, 2002.\n[16]J. von Neumann, \"Probabilistic logics and the synthesis\nof reliable organisms from unreliable components,\"\nAutomata Studies, eds. C. E. Shannon and J. McCarthy,\nPrinceton NJ, pp. 43-98, 1955.\n[17]D. Pamunuwa, L-R. Zheng, and H. Tenhunen, \"Max-\nimising throughput over parallel wire structures in the\ndeep submicrometer regime,\" IEEE Transactions on\nVLSI, vol. 11, no. 2, pp. 224-243, Apr. 2003.\n[18]D. Pamunuwa et. al., \"A study on the implementation\nof 2-D mesh-based networks-on-chip in the manometer\nregime,\" Integration, vol. 38, pp. 3-17, 2004.\n1-4244-0322- 7\/06\/$20. 00 C2006 IEEE 108\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 09:25 from IEEE Xplore.  Restrictions apply. \n"}