{"doi":"10.1128\/JB.184.8.2100-2107.2002","coreId":"193526","oai":"oai:lra.le.ac.uk:2381\/2053","identifiers":["oai:lra.le.ac.uk:2381\/2053","10.1128\/JB.184.8.2100-2107.2002"],"title":"Characterization of the Campylobacter jejuni heptosyltransferase II gene, waaF, provides genetic evidence that extracellular polysaccharide is lipid a core independent.","authors":["Oldfield, Neil J.","Moran, A. P.","Millar, Lorna A.","Prendergast, M. M.","Ketley, Julian M."],"enrichments":{"references":[{"id":44673925,"title":"A PCR-based strategy for the rapid construction of defined bacterial deletion mutants.","authors":[],"date":"1994","doi":null,"raw":"Wren, B. W., J. Henderson, and J. M. Ketley. 1994. A PCR-based strategy for the rapid construction of defined bacterial deletion mutants. BioTechniques 16:994–996.","cites":null},{"id":44673920,"title":"A sensitive silver stain for detecting lipopolysaccharides in polyacrylamide gels.","authors":[],"date":"1982","doi":"10.1016\/0003-2697(82)90673-x","raw":"Tsai, C.-M., and C. E. Frasch. 1982. A sensitive silver stain for detecting lipopolysaccharides in polyacrylamide gels. Anal. Biochem. 119:115–119.","cites":null},{"id":44673926,"title":"Animal models of Campylobacter infection,","authors":[],"date":"2000","doi":"10.1128\/9781555815554.ch21","raw":"Young, V. B., D. B. Schauer, and J. G. Fox. 2000. Animal models of Campylobacter infection, p. 287–301. In I. Nachamkin and M. J. Blaser (ed.), Campylobacter, 2nd ed. ASM, Washington, DC. VOL. 184, 2002 CAMPYLOBACTER JEJUNI waaF GENE 2107","cites":null},{"id":44673915,"title":"Antibody crossreactivities between gangliosides and lipopolysaccharides of Campylobacter jejuni serotypes associated with Guillain-Barré syndrome.","authors":[],"date":"1995","doi":"10.1177\/096805199600200602","raw":"Schwerer, B., A. Neisser, R. J. Polt, H. Bernheimer, and A. P. Moran. 1995. Antibody crossreactivities between gangliosides and lipopolysaccharides of Campylobacter jejuni serotypes associated with Guillain-Barré syndrome. J. Endotoxin Res. 2:395–403.","cites":null},{"id":44673911,"title":"Bacterial endotoxin: molecular relationships of structure to activity and function.","authors":[],"date":"1994","doi":"10.1007\/978-3-642-80186-0_3","raw":"Rietschel, E. T., T. Kirikae, F. U. Schade, U. Mamat, G. Schmidt, H. Loppnow, A. J. Ulmer, U. Zähringer, U. Seydel, F. Di Padova, M. Schreier, and H. Brade. 1994. Bacterial endotoxin: molecular relationships of structure to activity and function. FASEB J. 8:217–225.","cites":null},{"id":44673884,"title":"Biosynthesis of ganglioside mimics in Campylobacter jejuni OH4384.","authors":[],"date":"2000","doi":"10.1074\/jbc.275.6.3896","raw":"Gilbert, M., J. R. Brisson, M. F. Karwaski, J. Michniewicz, A. M. Cunningham, Y. Wu, N. M. Young, and W. W. Wakarchuk. 2000. Biosynthesis of ganglioside mimics in Campylobacter jejuni OH4384. J. Biol. Chem. 275: 3896–3906.","cites":null},{"id":44673881,"title":"Biosynthesis of inner core lipopolysaccharide in enteric bacteria identification and characterization of a conserved phosphoheptose isomerase.","authors":[],"date":"1996","doi":"10.1074\/jbc.271.7.3608","raw":"Brooke, J. S., and M. A. Valvano. 1996. Biosynthesis of inner core lipopolysaccharide in enteric bacteria identification and characterization of a conserved phosphoheptose isomerase. J. Biol. Chem. 271:3608–3614.","cites":null},{"id":44673901,"title":"Campylobacter jejuni infection and the association with Guillain-Barré syndrome,","authors":[],"date":"2000","doi":"10.1212\/01.wnl.0000261006.48553.bd","raw":"Nachamkin, I., B. M. Allos, and T. W. Ho. 2000. Campylobacter jejuni infection and the association with Guillain-Barré syndrome, p. 155–175. In I. Nachamkin and M. J. Blaser (ed.), Campylobacter, 2nd ed. American Society for Microbiology, Washington, DC.","cites":null},{"id":44673878,"title":"Characterization of a WaaF (RfaF) homolog expressed by Haemophilus ducreyi.","authors":[],"date":"1999","doi":null,"raw":"Bauer, B. A., S. R. Lumbley, and E. J. Hansen. 1999. Characterization of a WaaF (RfaF) homolog expressed by Haemophilus ducreyi. Infect. Immun. 67:899–907.","cites":null},{"id":44673900,"title":"Chemical characterization of Campylobacter jejuni lipopolysaccharides containing N-acetylneuraminic acid and 2,3-diamino-2,3-dideoxy-D-glucose.","authors":[],"date":"1991","doi":"10.1111\/j.1432-1033.1991.tb16036.x","raw":"Moran, A. P., E. T. Rietschel, T. U. Kosunen, and U. Zahringer. 1991. Chemical characterization of Campylobacter jejuni lipopolysaccharides containing N-acetylneuraminic acid and 2,3-diamino-2,3-dideoxy-D-glucose. J. Bacteriol. 173:618–626.","cites":null},{"id":44673887,"title":"Chemical structure of a polysaccharide from Campylobacter jejuni 176.83 (serotype O:41) containing only furanose sugars.","authors":[],"date":"1999","doi":"10.1016\/s0008-6215(99)00129-9","raw":"Hanniffy, O. M., A. S. Shashkov, A. P. Moran, M. M. Prendergast, S. N. Senchenkova, Y. A. Knirel, and A. V. Savage. 1999. Chemical structure of a polysaccharide from Campylobacter jejuni 176.83 (serotype O:41) containing only furanose sugars. Carbohydr. Res. 319:124–132.","cites":null},{"id":44673876,"title":"Chemical structure of the core region of Campylobacter jejuni serotype O:2 lipopolysaccharide.","authors":[],"date":"1993","doi":"10.1111\/j.1432-1033.1993.tb17850.x","raw":"Aspinall, G. O., A. G. McDonald, T. S. Raju, H. Pang, L. A. Kurjanczyk, J. L. Penner, and A. P. Moran. 1993. Chemical structure of the core region of Campylobacter jejuni serotype O:2 lipopolysaccharide. Eur. J. Biochem. 213: 1029–1037.","cites":null},{"id":44673874,"title":"Chemical structures of the core region of Campylobacter jejuni O:3 lipopolysaccharide and an associated polysaccharide.","authors":[],"date":"1995","doi":"10.1111\/j.1432-1033.1995.tb20734.x","raw":"Aspinall, G. O., C. M. Lynch, H. Pang, R. T. Shaver, and A. P. Moran. 1995. Chemical structures of the core region of Campylobacter jejuni O:3 lipopolysaccharide and an associated polysaccharide. Eur. J. Biochem. 231:570–578.","cites":null},{"id":44673877,"title":"Chemical structures of the core regions of Campylobacter jejuni serotypes O:1, O:4, O:23, and O:36 lipopolysaccharides.","authors":[],"date":"1993","doi":"10.1111\/j.1432-1033.1993.tb17849.x","raw":"Aspinall, G. O., A. G. McDonald, T. S. Raju, H. Pang, A. P. Moran, and J. L. Penner. 1993. Chemical structures of the core regions of Campylobacter jejuni serotypes O:1, O:4, O:23, and O:36 lipopolysaccharides. Eur. J. Biochem. 213:1017–1027.","cites":null},{"id":44673923,"title":"Chloramphenicol resistance in Campylobacter coli: nucleotide sequence, expression, and cloning vector construction. Gene 94:23–28.","authors":[],"date":"1990","doi":"10.1016\/0378-1119(90)90463-2","raw":"Wang, Y., and D. E. Taylor. 1990. Chloramphenicol resistance in Campylobacter coli: nucleotide sequence, expression, and cloning vector construction. Gene 94:23–28.","cites":null},{"id":44673889,"title":"Cloning and molecular analysis of the Isi1 (rfaF) gene of Neisseria meningitidis which encodes a heptosyl-2-transferase involved in LPS biosynthesis: evaluation of surface exposed carbohydrates in LPS mediated toxicity for human endothelial cells.","authors":[],"date":"1995","doi":"10.1006\/mpat.1995.0074","raw":"Jennings, M. P., M. Bisercic, K. L. Dunn, M. Virji, A. Martin, K. E. Wilks, J. C. Richards, and E. R. Moxon. 1995. Cloning and molecular analysis of the Isi1 (rfaF) gene of Neisseria meningitidis which encodes a heptosyl-2-transferase involved in LPS biosynthesis: evaluation of surface exposed carbohydrates in LPS mediated toxicity for human endothelial cells. Microb. Pathog. 19:391–407.","cites":null},{"id":44673924,"title":"Cloning, mutation and distribution of a putative lipopolysaccharide biosynthesis locus in Campylobacter jejuni.","authors":[],"date":"1999","doi":"10.1099\/13500872-145-2-379","raw":"Wood, A. C., N. J. Oldfield, C. A. O’Dwyer, and J. M. Ketley. 1999. Cloning, mutation and distribution of a putative lipopolysaccharide biosynthesis locus in Campylobacter jejuni. Microbiology 145:379–388.","cites":null},{"id":44673895,"title":"Deciphering Campylobacter jejuni cell surface interactions from the genome sequence.","authors":[],"date":"2001","doi":"10.1016\/s1369-5274(00)00161-2","raw":"Linton, D., A. V. Karlyshev, and B. W. Wren. 2001. Deciphering Campylobacter jejuni cell surface interactions from the genome sequence. Curr. Opin. Microbiol. 4:35–40.","cites":null},{"id":44673880,"title":"Deletion of the heptosyltransferase genes rfaC and rfaF in Escherichia coli K-12 results in an Re-type lipopolysaccharide with a high degree of 2-aminoethanol phosphate substitution.","authors":[],"date":"1997","doi":"10.1111\/j.1432-1033.1997.00716.x","raw":"Brabetz, W., S. Muller-Loennies, O. Holst, and H. Brade. 1997. Deletion of the heptosyltransferase genes rfaC and rfaF in Escherichia coli K-12 results in an Re-type lipopolysaccharide with a high degree of 2-aminoethanol phosphate substitution. Eur. J. Biochem 247:716–724.","cites":null},{"id":44673914,"title":"do not enter epithelial host cells.","authors":[],"date":"1995","doi":"10.1111\/j.1365-2958.1995.tb02241.x","raw":"Schwan, E. T., B. D. Robertson, H. Brade, and J. P. van Putten. 1995. Gonococcal rfaF mutants express Rd2 chemotype LPS and do not enter epithelial host cells. Mol. Microbiol. 15:267–275.","cites":null},{"id":44673918,"title":"Evidence for a system of general protein glycosylation in Campylobacter jejuni.","authors":[],"date":"1999","doi":"10.1046\/j.1365-2958.1999.01415.x","raw":"Szymanski, C. M., R. J. Yao, C. P. Ewing, T. J. Trust, and P. Guerry. 1999. Evidence for a system of general protein glycosylation in Campylobacter jejuni. Mol. Microbiol. 32:1022–1030.","cites":null},{"id":44673891,"title":"Expression of Campylobacter hyoilei lipo-oligosaccharide (LOS) antigens in Escherichia coli.","authors":[],"date":"1997","doi":"10.1099\/00221287-143-11-3481","raw":"Korolik, V., B. N. Fry, M. R. Alderton, B. A. M. van der Zeijst, and P. J. Coloe. 1997. Expression of Campylobacter hyoilei lipo-oligosaccharide (LOS) antigens in Escherichia coli. Microbiology 143:3481–3489.","cites":null},{"id":44673890,"title":"Genetic and biochemical evidence of a Campylobacter jejuni capsular Gene 222:177–185.","authors":[],"date":null,"doi":null,"raw":"Genetic and biochemical evidence of a Campylobacter jejuni capsular Gene 222:177–185.","cites":null},{"id":44673921,"title":"Genetic manipulation of enteric Campylobacter species,","authors":[],"date":"1998","doi":"10.1016\/s0580-9517(08)70301-5","raw":"van Vliet, A., A. Wood, J. Henderson, K. Wooldridge, and J. Ketley. 1998. Genetic manipulation of enteric Campylobacter species, p. 407–419. In P. Williams, J. Ketley, and G. Salmond (ed.), Techniques for bacterial pathogenesis. Academic Press, London, United Kingdom.","cites":null},{"id":44673913,"title":"Genetics of lipopolysaccharide biosynthesis in enteric bacteria.","authors":[],"date":"1993","doi":null,"raw":"Schnaitman, C. A., and J. D. Klena. 1993. Genetics of lipopolysaccharide biosynthesis in enteric bacteria. Microbiol. Rev. 57:655–682.","cites":null},{"id":44673896,"title":"Identification and characterization of two Campylobacter jejuni adhesins for cellular and mucous substrates.","authors":[],"date":"1986","doi":null,"raw":"McSweegan, E., and R. I. Walker. 1986. Identification and characterization of two Campylobacter jejuni adhesins for cellular and mucous substrates. Infect. Immun. 53:141–148.","cites":null},{"id":44673873,"title":"Identification and cloning of waaF (rfaF) from Bordetella pertussis and use to generate mutants of Bordetella spp. with deep rough lipopolysaccharide.","authors":[],"date":"1998","doi":null,"raw":"Allen, A. G., T. Isobe, and D. J. Maskell. 1998. Identification and cloning of waaF (rfaF) from Bordetella pertussis and use to generate mutants of Bordetella spp. with deep rough lipopolysaccharide. J. Bacteriol. 180:35–40.","cites":null},{"id":44673902,"title":"Identification of the ADP-L-glycero-D-manno-heptose6-epimerase (rfaD) and heptosyltransferase II (rfaF) biosynthesis genes from nontypeable Haemophilus influenzae","authors":[],"date":"1997","doi":null,"raw":"Nichols, W. A., B. W. Gibson, W. Melaugh, N. G. Lee, M. Sunshine, and 2106 OLDFIELD ET AL. J. BACTERIOL. M. A. Apicella. 1997. Identification of the ADP-L-glycero-D-manno-heptose6-epimerase (rfaD) and heptosyltransferase II (rfaF) biosynthesis genes from nontypeable Haemophilus influenzae 2019. Infect. Immun. 65:1377–1386.","cites":null},{"id":44673907,"title":"Lipopolysaccharides in the development of the Guillain-Barré syndrome and Miller Fisher syndrome forms of acute inflammatory peripheral neuropathies.","authors":[],"date":"2001","doi":"10.1177\/09680519000060050501","raw":"Prendergast, M. M., and A. P. Moran. 2001. Lipopolysaccharides in the development of the Guillain-Barré syndrome and Miller Fisher syndrome forms of acute inflammatory peripheral neuropathies. J. Endotoxin Res. 6:341–359.","cites":null},{"id":44673875,"title":"Lipopolysaccharides of Campylobacter jejuni serotype O:19— structure of core oligosaccharide regions from the serostrain and two bacterial isolates from patients with the Guillain-Barre syndrome.","authors":[],"date":"1994","doi":"10.1021\/bi00167a032","raw":"Aspinall, G. O., A. G. McDonald, H. Pang, L. A. Kurjanczyk, and J. L. Penner. 1994. Lipopolysaccharides of Campylobacter jejuni serotype O:19— structure of core oligosaccharide regions from the serostrain and two bacterial isolates from patients with the Guillain-Barre syndrome. Biochemistry 33:241–249.","cites":null},{"id":44673917,"title":"Molecular analysis of the rfaD gene, for heptose synthesis, and the rfaF gene, for heptose transfer, in lipopolysaccharide synthesis in Salmonella typhimurium.","authors":[],"date":null,"doi":null,"raw":"Molecular analysis of the rfaD gene, for heptose synthesis, and the rfaF gene, for heptose transfer, in lipopolysaccharide synthesis in Salmonella typhimurium. J. Bacteriol. 176:2379–2385.","cites":null},{"id":44673912,"title":"Molecular cloning: a laboratory manual, 2nd ed.","authors":[],"date":"1989","doi":"10.1016\/0167-7799(91)90068-s","raw":"Sambrook, J., E. F. Fritsch, and T. Maniatis. 1989. Molecular cloning: a laboratory manual, 2nd ed. Cold Spring Harbor Laboratory Press, Cold Spring Harbor, N.Y.","cites":null},{"id":44673910,"title":"Molecular structure of bacterial endotoxin in relation to bioactivity,","authors":[],"date":"1990","doi":"10.1007\/978-1-4684-8995-8_23","raw":"Rietschel, E. T., L. Brade, O. Holst, V. A. Kulschin, B. Lindner, A. P. Moran, U. F. Schade, U. Zähringer, and H. Brade. 1990. Molecular structure of bacterial endotoxin in relation to bioactivity, p. 15–32. In A. Nowotny, J. J. Spitzer, and E. J. Ziegler (ed.), Cellular and molecular aspects of endotoxin reactions, vol. I. Elsevier Science Publishers, Amsterdam, The Netherlands.","cites":null},{"id":44673893,"title":"Multiple N-acetyl neuraminic acid synthetase (neuB) genes in Campylobacter jejuni: identification and characterization of the gene involved in sialylation of lipo-oligosaccharide.","authors":[],"date":"2000","doi":"10.1046\/j.1365-2958.2000.01780.x","raw":"Linton, D., A. V. Karlyshev, P. G. Hitchen, H. R. Morris, A. Dell, N. A. Gregson, and B. W. Wren. 2000. Multiple N-acetyl neuraminic acid synthetase (neuB) genes in Campylobacter jejuni: identification and characterization of the gene involved in sialylation of lipo-oligosaccharide. Mol. Microbiol. 35:1120–1134.","cites":null},{"id":44673922,"title":"Pathogenesis of enteric Campylobacter infection.","authors":[],"date":"2001","doi":"10.1046\/j.1365-2672.2001.01353.x","raw":"van Vliet, A. H. M., and J. M. Ketley. 2001. Pathogenesis of enteric Campylobacter infection. J. Appl. Microbiol. 90:45S–56S.","cites":null},{"id":44673892,"title":"Phase variation of a beta-1,3-galactosyltransferase involved in generation of the ganglioside GM1-like lipo-oligosaccharide of Campylobacter jejuni.","authors":[],"date":"2000","doi":"10.1046\/j.1365-2958.2000.02020.x","raw":"Linton, D., M. Gilbert, P. G. Hitchen, A. Dell, H. R. Morris, W. W. Wakarchuk, N. A. Gregson, and B. W. Wren. 2000. Phase variation of a beta-1,3-galactosyltransferase involved in generation of the ganglioside GM1-like lipo-oligosaccharide of Campylobacter jejuni. Mol. Microbiol. 37:501–514.","cites":null},{"id":44673906,"title":"Rapid extraction of bacterial chrmosomal DNA with guanidinium thiocyanate.","authors":[],"date":"1989","doi":"10.1111\/j.1472-765x.1989.tb00262.x","raw":"Pitcher, D. G., N. A. Saunders, and R. J. Owen. 1989. Rapid extraction of bacterial chrmosomal DNA with guanidinium thiocyanate. Lett. Appl. Microbiol. 8:151–156.","cites":null},{"id":44673916,"title":"Reagent for differentiation of 1,4- and 1,6-linked glucosaccharides.","authors":[],"date":"1956","doi":"10.1126\/science.123.3196.543","raw":"Schwimmer, S., and A. Bevenue. 1956. Reagent for differentiation of 1,4- and 1,6-linked glucosaccharides. Science 123:543–544.","cites":null},{"id":44673898,"title":"Serotyping of Campylobacter jejuni based on heat-stable antigens: relevance, molecular basis and implications in pathogenesis.","authors":[],"date":"1999","doi":"10.1046\/j.1365-2672.1999.00713.x","raw":"Moran, A. P., and J. L. Penner. 1999. Serotyping of Campylobacter jejuni based on heat-stable antigens: relevance, molecular basis and implications in pathogenesis. J. Appl. Microbiol. 86:361–377.","cites":null},{"id":44673885,"title":"Sialylation of lipooligosaccharide cores affects immunogenicity and serum resistance of Campylobacter jejuni.","authors":[],"date":null,"doi":"10.1128\/iai.68.12.6656-6662.2000","raw":"Sialylation of lipooligosaccharide cores affects immunogenicity and serum resistance of Campylobacter jejuni. Infect. Immun. 68:6656–6662.","cites":null},{"id":44673909,"title":"Structural and antigenic properties of lipopolysaccharides from serotype reference strains of Campylobacter jejuni.","authors":[],"date":"1987","doi":null,"raw":"Preston, M. A., and J. L. Penner. 1987. Structural and antigenic properties of lipopolysaccharides from serotype reference strains of Campylobacter jejuni. Infect. Immun. 55:1806–1812.","cites":null},{"id":44673886,"title":"Studies on transformation of E. coli with plasmids.","authors":[],"date":"1983","doi":"10.1016\/s0022-2836(83)80284-8","raw":"Hanahan, D. 1983. Studies on transformation of E. coli with plasmids. J. Mol. Biol. 166:557–579.","cites":null},{"id":44673882,"title":"The galE gene of Campylobacter jejuni is involved in lipopolysaccharide synthesis and virulence.","authors":[],"date":null,"doi":"10.1128\/iai.68.5.2594-2601.2000","raw":"The galE gene of Campylobacter jejuni is involved in lipopolysaccharide synthesis and virulence. Infect. Immun. 68:2594–2601.","cites":null},{"id":44673904,"title":"The genome sequence of the food-borne pathogen Campylobacter jejuni reveals hypervariable sequences.","authors":[],"date":"2000","doi":"10.1038\/35001088","raw":"Parkhill, J., B. W. Wren, K. Mungall, J. M. Ketley, C. Churcher, D. Basham, T. Chillingworth, R. M. Davies, T. Feltwell, S. Holroyd, K. Jagels, A. V. Karlyshev, S. Moule, M. J. Pallen, C. W. Penn, M. A. Quail, M.-A. Rajandream, K. M. Rutherford, A. H. M. van Vliet, S. Whitehead, and B. G. Barrell. 2000. The genome sequence of the food-borne pathogen Campylobacter jejuni reveals hypervariable sequences. Nature 403:665–668.","cites":null},{"id":44673883,"title":"The lipopolysaccharide biosynthesis locus of Campylobacter jejuni 81116.","authors":[],"date":"1998","doi":"10.1099\/00221287-144-8-2049","raw":"Fry, B. N., V. Korolik, J. A. ten Brinke, M. T. T. Pennings, R. Zalm, B. J. J. Teunis, P. J. Coloe, and B. A. M. van der Zeijst. 1998. The lipopolysaccharide biosynthesis locus of Campylobacter jejuni 81116. Microbiology 144: 2049–2061.","cites":null},{"id":44673888,"title":"Use of the complete genome sequence information of Haemophilus influenzae strain Rd to investigate lipopolysaccharide biosynthesis.","authors":[],"date":"1996","doi":"10.1046\/j.1365-2958.1996.01545.x","raw":"Hood, D., M. Deadman, T. Allen, H. Masoud, A. Martin, J. Brisson, R. Fleischmann, J. Venter, J. Richards, and E. Moxon. 1996. Use of the complete genome sequence information of Haemophilus influenzae strain Rd to investigate lipopolysaccharide biosynthesis. Mol. Microbiol. 22:951–965.","cites":null},{"id":44673903,"title":"Water-borne outbreak of Campylobacter gastroenteritis. Lancet i:287–290.","authors":[],"date":"1983","doi":"10.1016\/s0140-6736(83)91698-7","raw":"Palmer, S. R., P. R. Gully, J. M. White, A. D. Pearson, W. G. Suckling, D. M. Jones, J. C. L. Rawes, and J. L. Penner. 1983. Water-borne outbreak of Campylobacter gastroenteritis. Lancet i:287–290.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-04","abstract":"Campylobacter jejuni produces both lipooligosaccharide (LOS) and a higher-molecular-weight polysaccharide that is believed to form a capsule. The role of these surface polysaccharides in C. jejuni-mediated enteric disease is unclear; however, epitopes associated with the LOS are linked to the development of neurological complications. In Escherichia coli and Salmonella enterica serovar Typhimurium the waaF gene encodes a heptosyltransferase, which catalyzes the transfer of the second l-glycero-d-manno-heptose residue to the core oligosaccharide moiety of lipopolysaccharide (LPS), and mutation of waaF results in a truncated core oligosaccharide. In this report we confirm experimentally that C. jejuni gene Cj1148 encodes the heptosyltransferase II enzyme, WaaF. The Campylobacter waaF gene complements an S. enterica serovar Typhimurium waaF mutation and restores the ability to produce full-sized lipopolysaccharide. To examine the role of WaaF in C. jejuni, waaF mutants were constructed in strains NCTC 11168 and NCTC 11828. Loss of heptosyltransferase activity resulted in the production of a truncated core oligosaccharide, failure to bind specific ligands, and loss of serum reactive GM1, asialo-GM1, and GM2 ganglioside epitopes. The mutation of waaF did not affect the higher-molecular-weight polysaccharide supporting the production of a LOS-independent capsular polysaccharide by C. jejuni. The exact structural basis for the truncation of the core oligosaccharide was verified by comparative chemical analysis. The NCTC 11168 core oligosaccharide differs from that known for HS:2 strain CCUG 10936 in possessing an extra terminal disaccharide of galactose-β(1,3) N-acetylgalactosamine. In comparison, the waaF mutant possessed a truncated molecule consistent with that observed with waaF mutants in other bacterial species.Peer-reviewedPublisher Versio","downloadUrl":"http:\/\/jb.asm.org\/content\/184\/8\/2100","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/2053\/1\/10.1128_JB.184.8.2100-2107.2002.pdf","pdfHashValue":"266eeec55eaab1581166edcbf4acbca2beadc23e","publisher":"American Society for Microbiology","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/2053<\/identifier><datestamp>\n                2013-12-05T02:01:12Z<\/datestamp><setSpec>\n                com_2381_93<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_95<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nCharacterization of the Campylobacter jejuni heptosyltransferase II gene, waaF, provides genetic evidence that extracellular polysaccharide is lipid a core independent.<\/dc:title><dc:creator>\nOldfield, Neil J.<\/dc:creator><dc:creator>\nMoran, A. P.<\/dc:creator><dc:creator>\nMillar, Lorna A.<\/dc:creator><dc:creator>\nPrendergast, M. M.<\/dc:creator><dc:creator>\nKetley, Julian M.<\/dc:creator><dc:description>\nCampylobacter jejuni produces both lipooligosaccharide (LOS) and a higher-molecular-weight polysaccharide that is believed to form a capsule. The role of these surface polysaccharides in C. jejuni-mediated enteric disease is unclear; however, epitopes associated with the LOS are linked to the development of neurological complications. In Escherichia coli and Salmonella enterica serovar Typhimurium the waaF gene encodes a heptosyltransferase, which catalyzes the transfer of the second l-glycero-d-manno-heptose residue to the core oligosaccharide moiety of lipopolysaccharide (LPS), and mutation of waaF results in a truncated core oligosaccharide. In this report we confirm experimentally that C. jejuni gene Cj1148 encodes the heptosyltransferase II enzyme, WaaF. The Campylobacter waaF gene complements an S. enterica serovar Typhimurium waaF mutation and restores the ability to produce full-sized lipopolysaccharide. To examine the role of WaaF in C. jejuni, waaF mutants were constructed in strains NCTC 11168 and NCTC 11828. Loss of heptosyltransferase activity resulted in the production of a truncated core oligosaccharide, failure to bind specific ligands, and loss of serum reactive GM1, asialo-GM1, and GM2 ganglioside epitopes. The mutation of waaF did not affect the higher-molecular-weight polysaccharide supporting the production of a LOS-independent capsular polysaccharide by C. jejuni. The exact structural basis for the truncation of the core oligosaccharide was verified by comparative chemical analysis. The NCTC 11168 core oligosaccharide differs from that known for HS:2 strain CCUG 10936 in possessing an extra terminal disaccharide of galactose-β(1,3) N-acetylgalactosamine. In comparison, the waaF mutant possessed a truncated molecule consistent with that observed with waaF mutants in other bacterial species.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPublisher Version<\/dc:description><dc:date>\n2009-12-08T16:12:04Z<\/dc:date><dc:date>\n2009-12-08T16:12:04Z<\/dc:date><dc:date>\n2002-04<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nJournal of Bacteriology, 2002, 184 (8), pp.2100-2107<\/dc:identifier><dc:identifier>\n0021-9193<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/2053<\/dc:identifier><dc:identifier>\nhttp:\/\/jb.asm.org\/content\/184\/8\/2100<\/dc:identifier><dc:identifier>\n10.1128\/JB.184.8.2100-2107.2002<\/dc:identifier><dc:identifier>\n1098-5530<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:rights>\nCopyright © 2002, American Society for Microbiology. Deposited with reference to the publisher’s archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:publisher>\nAmerican Society for Microbiology<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1098-5530","0021-9193","issn:0021-9193","1098-5530"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007"],"year":2002,"topics":[],"subject":["Article"],"fullText":"  \n10.1128\/JB.184.8.2100-2107.2002. \n2002, 184(8):2100. DOI:J. Bacteriol. \nM. Prendergast and Julian M. Ketley\nNeil J. Oldfield , Anthony P. Moran, Lorna A. Millar, Martina\n \nIndependent\nExtracellular Polysaccharide Is Lipid A Core\nProvides Genetic Evidence that \n,waaF Heptosyltransferase II Gene, jejuni\nCampylobacterCharacterization of the \nhttp:\/\/jb.asm.org\/content\/184\/8\/2100\nUpdated information and services can be found at: \nThese include:\nREFERENCES\nhttp:\/\/jb.asm.org\/content\/184\/8\/2100#ref-list-1at: \nThis article cites 49 articles, 22 of which can be accessed free\nCONTENT ALERTS\n more»articles cite this article), \nReceive: RSS Feeds, eTOCs, free email alerts (when new\nhttp:\/\/journals.asm.org\/site\/misc\/reprints.xhtmlInformation about commercial reprint orders: \nhttp:\/\/journals.asm.org\/site\/subscriptions\/To subscribe to to another ASM Journal go to: \n o\nn\n August 19, 2013 by University of Leicester\nhttp:\/\/jb.asm.org\/\nD\now\nnloaded from\n \nJOURNAL OF BACTERIOLOGY, Apr. 2002, p. 2100–2107 Vol. 184, No. 8\n0021-9193\/02\/$04.00\u00010 DOI: 10.1128\/JB.184.8.2100–2107.2002\nCopyright © 2002, American Society for Microbiology. All Rights Reserved.\nCharacterization of the Campylobacter jejuni Heptosyltransferase II\nGene, waaF, Provides Genetic Evidence that Extracellular\nPolysaccharide Is Lipid A Core Independent\nNeil J. Oldfield,1† Anthony P. Moran,2 Lorna A. Millar,1 Martina M. Prendergast,2\nand Julian M. Ketley1*\nDepartment of Genetics, University of Leicester, Leicester, United Kingdom,1 and Department of Microbiology,\nUniversity College, Galway, Ireland2\nReceived 3 August 2001\/Accepted 10 December 2001\nCampylobacter jejuni produces both lipooligosaccharide (LOS) and a higher-molecular-weight polysaccharide\nthat is believed to form a capsule. The role of these surface polysaccharides in C. jejuni-mediated enteric\ndisease is unclear; however, epitopes associated with the LOS are linked to the development of neurological\ncomplications. In Escherichia coli and Salmonella enterica serovar Typhimurium the waaF gene encodes a\nheptosyltransferase, which catalyzes the transfer of the second L-glycero-D-manno-heptose residue to the core\noligosaccharide moiety of lipopolysaccharide (LPS), and mutation of waaF results in a truncated core oligo-\nsaccharide. In this report we confirm experimentally that C. jejuni gene Cj1148 encodes the heptosyltransferase\nII enzyme, WaaF. The Campylobacter waaF gene complements an S. enterica serovar Typhimurium waaF\nmutation and restores the ability to produce full-sized lipopolysaccharide. To examine the role of WaaF in C.\njejuni, waaF mutants were constructed in strains NCTC 11168 and NCTC 11828. Loss of heptosyltransferase\nactivity resulted in the production of a truncated core oligosaccharide, failure to bind specific ligands, and loss\nof serum reactive GM1, asialo-GM1, and GM2 ganglioside epitopes. The mutation of waaF did not affect the\nhigher-molecular-weight polysaccharide supporting the production of a LOS-independent capsular polysac-\ncharide by C. jejuni. The exact structural basis for the truncation of the core oligosaccharide was verified by\ncomparative chemical analysis. The NCTC 11168 core oligosaccharide differs from that known for HS:2 strain\nCCUG 10936 in possessing an extra terminal disaccharide of galactose-\u0001(1,3) N-acetylgalactosamine. In\ncomparison, the waaF mutant possessed a truncated molecule consistent with that observed with waaF mutants\nin other bacterial species.\nThe human pathogen Campylobacter jejuni is the principal\ncause of bacterial enteric disease in many industrialized coun-\ntries. C. jejuni enteritis is normally a self-limiting and uncom-\nplicated illness, with symptoms that range from mild diarrhea\nto severe inflammatory enteritis (21). In a small proportion of\ncases the serious neurological complication Guillain-Barré syn-\ndrome (GBS) or the related Miller-Fisher syndrome (MFS)\ncan develop (32, 37). The consumption of contaminated food\nor water is the usual route for bacterial acquisition. Due to a\nhigh and increasing frequency of infection, C. jejuni is of major\nhealth and economic importance (50). In contrast to those of\nmany other enteric pathogens, the biology of C. jejuni and the\npathophysiology of Campylobacter-mediated disease remain\npoorly understood (50).\nLipopolysaccharide (LPS) and lipooligosaccharide (LOS)\nconstituents of the outer membrane are important virulence\nfactors in many bacterial infections, conferring, for example,\nserum resistance, antibiotic resistance, and endotoxicity to the\npathogen (39). LPS is composed of three regions, lipid A, a\ncore oligosaccharide, and an O-chain consisting of repeating\noligosaccharide units; LOS lacks the O-chain (40). Until re-\ncently, C. jejuni was believed to produce either LPS or LOS.\nHowever, repeating oligosaccharide units once considered to\nbe an LPS-associated O-chain are now believed to be capsular\n(18, 50), and there is also a considerable level of surface pro-\ntein glycosylation (47). Thus, although there is a greater ca-\npacity for polysaccharide biosynthesis than previously sup-\nposed, C. jejuni may only express LOS and not LPS. C. jejuni\nheat-stable antigens, considered to include a capsule and LOS,\nform the basis of the Penner serotyping system (18, 29, 38).\nCertain serotypes, and hence LOS structures, have been linked\nto the development of C. jejuni-associated GBS or MFS (37).\nIn addition, cell surface polysaccharides may play a role in cell\nadhesion, as purified C. jejuni “LPS” was shown to adhere to\ntissue culture cells and intestinal mucus (28), and it has been\nsuggested that sialylation of C. jejuni LOS affects immunoge-\nnicity and serum resistance (13).\nThe genetic basis of LOS biosynthesis in Campylobacter was\nfirst addressed in a study describing regions of the genome of\nCampylobacter coli (Campylobacter hyoilei), which contained\nopen reading frames (ORFs) with similarity to known genes\ninvolved in LPS biosynthesis (24). This study was extended to\nidentify a similar region in C. jejuni NCTC 11828 (also known\nas 81116), which was able to complement LPS biosynthesis in\nan Escherichia coli mutant background (11). The region was\nfound to contain 13 ORFs, designated galE and wlaB to wlaM,\nwhich had similarity to genes involved in LPS biosynthesis.\n* Corresponding author. Mailing address: Department of Genetics,\nUniversity of Leicester, University Rd., Leicester LE1 7RH, United\nKingdom. Phone: (44) 116 252 3434. Fax: (44) 116 252 3378. E-mail:\nket@le.ac.uk.\n† Present address: Molecular Bacteriology and Immunology Group,\nDivision of Microbiology, Queens Medical Centre, University of Not-\ntingham, Nottingham NG7 2UH, United Kingdom.\n2100\n o\nn\n August 19, 2013 by University of Leicester\nhttp:\/\/jb.asm.org\/\nD\now\nnloaded from\n \nMutation of some of these genes in strain NCTC 11168 re-\nsulted in a phenotype of altered LOS reactivity, with serotyping\nantisera directly supporting a role for this region in LOS bio-\nsynthesis (52). Interestingly, an additional role for genes in the\nwla region in C. jejuni strain 81–176 was demonstrated (47). In\ncontrast to what was found previously (52), mutation of several\nwla (alternatively named pgl [47]) genes in 81-176 had no\ndiscernible effect on LOS and capsule biosynthesis but affected\nthe glycosylation of several C. jejuni proteins including flagellin\n(47).\nAnalysis of the complete genome sequence of C. jejuni NCTC\n11168 led to the identification of a large cluster of LOS-related\nORFs (35), which includes the previously described wla genes.\nThis cluster contains several additional ORFs with similarity to\ngenes involved in inner core biosynthesis including galE (Cj1131),\ngmhA (Cj1149), gmhD (Cj1151), gmhE (Cj1150), waaC (Cj1133),\nand waaF (Cj1148). The putative roles of both the galE and waaC\ngenes of C. jejuni have now been verified by functional studies (10,\n23), but the roles of other inner core biosynthesis genes still\nrequire experimental confirmation.\nIn E. coli and Salmonella enterica serovar Typhimurium the\nwaaF gene encodes a heptosyltransferase, which catalyzes the\ntransfer of the second L-glycero-D-manno-heptose (LD-Hep)\nresidue to the core oligosaccharide moiety of LPS (8, 46).\nMutation of waaF prevents the incorporation of the heptose\nresidue and subsequently blocks the addition of other sugar\nmoieties. Thus, a greatly altered LPS molecule, consisting of a\ntruncated core oligosaccharide and no attached O-chain poly-\nsaccharide, is produced (42). Such so-called deep rough Sal-\nmonella mutants have increased sensitivity to antibiotics, de-\ntergents, and bile salts (9). In particular, they are highly\nsusceptible to hydrophobic antibiotics such as novobiocin.\nFunctional complementation restores the ability of the mutant\nto synthesize a complete core oligosaccharide with attached\nO-chain and consequently also restores antibiotic resistance.\nComplementation of antibiotic resistance has been used as an\napproach to isolate several waaF genes from various bacterial\nspecies including Pseudomonas aeruginosa (22), Bordetella per-\ntussis (1), Haemophilus influenzae (33), and Haemophilus du-\ncreyi (7).\nHere we report experimental confirmation that Cj1148 en-\ncodes the heptosyltransferase II enzyme, WaaF, by functional\ncomplementation and characterization of the mutant pheno-\ntype. Furthermore, analysis of LOS extracts from the waaF\nmutant showed directly that the previously postulated O-chain\npolysaccharide observed in electrophoretic gels and immuno-\nblots is not covalently attached to the core oligosaccharide and\nis an independent extracellular polysaccharide.\nMATERIALS AND METHODS\nBacterial strains, growth conditions, and reagents. All bacterial strains used in\nthis study are described in Table 1. C. jejuni strains NCTC 11168 and NCTC\n11828 used in this study are from Penner serotypes HS:2 and HS:6, respectively.\nBoth strains were cultured on Campylobacter serum-free agar (Oxoid) or in\nMueller-Hinton broth at 37°C in microaerophilic conditions (85% N2, 10% CO2,\n5% O2). S. enterica serovar Typhimurium SL3770 (wild-type) and SL3789\n(waaF511) and E. coli strain DH5\u0002 were cultured on Luria broth or agar (41).\nAntibiotic selection with chloramphenicol (20 \u0003g ml\u00041), ampicillin (100 \u0003g\nml\u00041), and novobiocin (5 \u0003g ml\u00041) was used as appropriate. All antibiotics and\nchemical reagents were obtained from Sigma Chemical Co.\nMolecular genetics methods. The Expand High Fidelity PCR system (Boehr-\ninger Mannheim) was used for DNA amplification with the primers described in\nTable 1. C. jejuni-specific primers were designed by using the NCTC 11168\ngenome sequence (available at http:\/\/www.sanger.ac.uk\/Projects\/C_jejuni\/) or se-\nquence data obtained from studies on NCTC 11828 (N. J. Oldfield and J. M.\nKetley, unpublished results). DNA modification was carried out by standard\nmethods (41) with DNA isolated and purified by Qiagen purification kit tech-\nnology. DNA was sequenced with the BigDye terminator cycle sequencing kit\n(ABI, Applied Biosystems) on an ABI 377 DNA sequencer. Restriction and\nmodifying enzymes were obtained from Gibco-BRL. Molecular genetics meth-\nods utilized with C. jejuni are based on those described previously (49).\nCloning and mutation of the putative waaF gene from C. jejuni. Chromosomal\nDNA was extracted from C. jejuni by a guanidinium thiocyanate-based method\n(36). A 2-kb fragment containing the waaF gene and approximately 500 bp of\nflanking sequence from the neighboring ORFs Cj1147 and Cj1149 was amplified\nwith primers GMHAF3 and WLASAR3 (NCTC 11168) or WLAXAF3 and\nWLASAR3 (NCTC 11828) (Table 1), cloned into pUC19, and confirmed by\nPCR and restriction analysis.\nA deletion in the waaF gene was constructed by inverse PCR (53) using\nprimers WAAFF2 and WAAFR4 for pNOL17 and primers WAAFF2 and\nNOL8F1 for pNOL8 (Table 1). A chloramphenicol acetyltransferase cassette\n(cat) (51) was inserted (49) into the unique restriction site generated during the\nPCR. The resulting plasmids (Table 1) containing the cat resistance cassette in\nthe forward and reverse orientations were electroporated into C. jejuni (52), and\nrecombinants were selected on medium containing chloramphenicol.\nLPS and LOS extracts and SDS-PAGE. Late-exponential-phase cells (1 ml at\nan optical density at 600 nm of 0.6) were harvested by centrifugation (3,020 \u0005 g,\n20 min) and resuspended in 200 \u0003l of sodium dodecyl sulfate-polyacrylamide gel\nelectrophoresis (SDS-PAGE) loading buffer (100 mM Tris-Cl [pH 8.0], 2%\n\u0006-mercaptoethanol, 4% SDS, 0.2% bromophenol blue, 0.2% xylene cyanol, 20%\nglycerol). After the cells were boiled for 10 min, proteinase K was added to a final\nconcentration of 0.5 mg ml\u00041 and the sample was incubated at 65°C for 2 h. LPS\npreparations were boiled for 10 min before being loaded onto an SDS-PAGE gel\n(52) (4% [vol\/vol]) stacking gel and 15% [vol\/vol] separating gel) and electro-\nphoresed at 15 mA per gel for 16 h. Gels were silver stained (48), or the\nseparated LPS and LOS extracts were transferred to nitrocellulose (41). Penner\nserotyping antisera (HS:2 and HS:6) were used at a dilution of 1\/5,000 and\ndetected with the Bio-Rad Immun-Star Western blotting kit.\nTLC. Biomass of C. jejuni NCTC 11168 and mutant strain 11168NOL22, which\nhad been grown as described above, was subjected to hot phenol-water extrac-\ntion, and the crude LPS and LOS from the water phase of extracts were purified\nby enzymatic treatments with RNase A, DNase II, and proteinase K and by\nultracentrifugation, according to the protocol of Moran et al. (31). The LOSs (1\n\u0003g) from C. jejuni NCTC 11168 and C. jejuni 11168NOL22 were analyzed by\nthin-layer chromatography (TLC) on precoated silica gel 60 glass plates (Merck,\nDarmstadt, Germany). A solvent system consisting of n-propanol–water–25%\nNH4OH (60:30:10 [vol\/vol\/vol]) was used as a developer, and bands were visu-\nalized by spraying plates with resorcinol-HCl reagent (45).\nTLC with immunostaining was performed by the procedure of Schwerer et al.\n(44). Briefly, developed TLC plates were dried for 30 min in a vacuum dessic-\ncator, fixed in 0.2% polyisobutylmethacrylate (Aldrich) in n-hexane (Merck) for\n1.5 min, and dried as before. Nonspecific binding was reduced by submerging the\nplates for 1 h in a solution of phosphate-buffered saline (PBS) containing 0.3%\ngelatin (gelatin-PBS). Subsequently, lanes were overlaid with rabbit antiserum to\ngangliosides (Matreya Inc.) and diluted 1:100 in gelatin-PBS. Plates were incu-\nbated at 4°C overnight, washed three times with cold PBS, overlaid with perox-\nidase-conjugated anti-rabbit immunoglobulin G (Sigma) diluted 1:500 in gelatin-\nPBS, and incubated at room temperature for 1 h with gentle rocking. The plates\nwere washed with cold PBS, and the immunoreactants were visualized by use of\na horseradish-peroxidase development system (Bio-Rad). Binding studies with\ncholera toxin (CT)-peroxidase conjugate (Sigma), peanut agglutinin (PNA)-\nperoxidase conjugate (Kem-En-Tec, Copenhagen, Denmark), and tetanus toxin\nC (TTC; Calbiochem) were performed under the same conditions as described\nfor immunostaining, but only one overlay step with peroxidase-conjugated CT (1\n\u0003g\/ml), PNA (20 \u0003g\/ml), or TTC (1 \u0003g\/ml) was necessary.\nChemical characterization of LOS. Core oligosaccharide was liberated from\nLOS by mild acid hydrolysis with 1% acetic acid at 100°C for 1 h and isolated by\ngel permeation chromatography, and the oligosaccharides (400 to 500 \u0003g) were\nmethylated (5). Subsequently, the fast atom bombardment-mass spectrometry\n(FAB-MS) spectra of the permethylated sample in methanol (1 to 2 \u0003l) were\nrecorded with an instrument equipped with an Ion Tech saddle field gun under\nthe conditions described previously (5). Interpretations of positive-ion mass\nspectra of permethylated derivatives were as used in earlier studies (4–6).\nVOL. 184, 2002 CAMPYLOBACTER JEJUNI waaF GENE 2101\n o\nn\n August 19, 2013 by University of Leicester\nhttp:\/\/jb.asm.org\/\nD\now\nnloaded from\n \nNucleotide sequence accession numbers. The complete sequence of the C.\njejuni NCTC 11168 genome can be obtained from the Sanger Centre (http:\n\/\/www.sanger.ac.uk\/Projects\/C_jejuni\/) or from EMBL with identification no.\nCJ11168 (accession no. AL11168). The DNA sequence of the NCTC 11828\ninsert from pNOL8 described here has been deposited in the GenBank database\nunder accession no. AF343914.\nRESULTS\nCloning of the waaF gene. The genome sequence of C. jejuni\nNCTC 11168 (35) contains an ORF (Cj1148) with similarity to\nseveral waaF genes (data not shown). A 2-kb fragment con-\ntaining the waaF gene was amplified with primers that an-\nnealed to the flanking genes, Cj1147 and Cj1149, and cloned\ninto pUC19 (data not shown) to form pNOL17 (Table 1). The\ncorresponding waaF gene of C. jejuni NCTC 11828 on a 2.1-kb\nfragment was cloned by PCR, but with one different flanking\nprimer due to the presence of a novel gene immediately down-\nstream of waaF in the strain NCTC 11828 wla locus (N. J.\nOldfield et al., unpublished data). The resulting plasmid con-\ntaining the strain NCTC 11828 waaF gene was named pNOL8\n(Table 1).\nComplementation of S. enterica serovar Typhimurium\nSL3789 with C. jejuni NCTC 11168 waaF. The mutant S. en-\nterica serovar Typhimurium SL3789 (waaF511) was trans-\nformed with plasmid pNOL17, and transformants were se-\nlected with ampicillin and novobiocin. The deep rough S.\nenterica serovar Typhimurium SL3789 is normally unable to\ngrow in the presence of novobiocin due to the truncated LPS\nproduced by the waaF511 mutation (1). The presence of\npNOL17 in novobiocin-resistant transformants was confirmed,\nindicating that the putative C. jejuni waaF gene was able to\ncomplement the waaF511 mutation in S. enterica serovar Ty-\nphimurium SL3789. In contrast, plasmids pNOL22 and\npNOL23 (Table 1; see below), which contain mutated C. jejuni\nwaaF genes, were unable to complement the waaF511 muta-\ntion in SL3789.\nGrowth of S. enterica serovar Typhimurium SL3789(pNOL17)\non novobiocin implies functional complementation of the waaF\nmutation due to the production of smooth LPS, which confers\nresistance to the antibiotic. The production of a complete LPS\nmolecule with an O-chain polysaccharide was confirmed by anal-\nysis of the LPS from the complemented Salmonella strain (Fig. 1).\nIn contrast to what is found for S. enterica serovar Typhimurium\nSL3789, which shows only the presence of a truncated core mol-\necule, the production of attached O-chain is restored in strain\nSL3789(pNOL17), further supporting the identification of Cj1148\nas the C. jejuni waaF gene. Moreover, the truncated core mole-\nTABLE 1. Bacterial strains, plasmids, and primers used\nStrain, plasmid, or\nprimer Relevant genotype, phenotype, characteristics, or nucleotide sequence (5\u0007–3\u0007) Reference or source\nStrains\nC. jejuni\nNCTC 11168 Parental National Collection of\nType Cultures\nNCTC 11828 Parental; also known as 81116; produces high-molecular-weight\npolysaccharide\n34\n11168NOL22\/23 NCTC 11168 waaF::cat This study\n11828NOL11\/12 NCTC 11828 waaF::cat This study\nS. enterica serovar\nTyphimurium\nSL3770 Parental T. Isobea\nSL3789 waaF511 T. Isobe\nE. coli DH5\u0002 F\u0004 \b80d lacZ\tM15 14\nPlasmids\npUC19 Cloning vector, Apr Stratagene\npAV35 C. coli Cmr in pBluescript 49\npNOL8 2.1-kb fragment containing waaF from NCTC 11828 in pUC19 This study\npNOL11 Cmr cassette of pAV35 cloned (forward orientation) into unique BamHI site\ngenerated in pNOL8 by inverse PCR\nThis study\npNOL12 Cmr cassette of pAV35 cloned (reverse orientation) into unique BamHI site\ngenerated in pNOL8 by inverse PCR\nThis study\npNOL17 2.0-kb fragment containing waaF from NCTC 11168 in pUC19 This study\npNOL22 Cmr cassette of pAV35 cloned (forward orientation) into unique BamHI site\ngenerated in pNOL17 by inverse PCR\nThis study\npNOL23 Cmr cassette of pAV35 cloned (reverse orientation) into unique BamHI site\ngenerated in pNOL17 by inverse PCR\nThis study\nPrimers\nGMHAF3 CGGGGTACCCAAATCGCTAAAGTAGGTGAGC This study\nWLASAR3 AAACTGCAGCACTTAGCCCAAACCGACCAGC This study\nWLAXAF3 CGGGGTACCGAGCTAAAAGCATAAACAAC This study\nWAAFF2 CGCGGATCCCGCCTAACCAGGTGGGAAGATG This study\nWAAFR4 CGCGGATCCGCCTGCTGAAAAAGTGATAGAACAGGC This study\nNOL8F1 CGCGGATCCGCATGAAAGATCTAAAGCCTG This study\na Department of Clinical Veterinary Medicine, University of Cambridge, Cambridge, United Kingdom.\n2102 OLDFIELD ET AL. J. BACTERIOL.\n o\nn\n August 19, 2013 by University of Leicester\nhttp:\/\/jb.asm.org\/\nD\now\nnloaded from\n \ncule seen in S. enterica serovar Typhimurium SL3789 is not ob-\nserved in strain SL3789(pNOL17), indicating that complementa-\ntion is complete. In contrast, the waaF gene of B. pertussis was\nshown to confer only partial functional complementation in strain\nSL3789, as the truncated core molecule was still observed in LPS\npreparations (1).\nConstruction and characterization of C. jejuni NCTC 11168\nwaaF mutants. To confirm that Cj1148 encoded a heptosyl-\ntransferase II in C. jejuni, the gene was mutated and the effect\non LOS biosynthesis was determined. Inverse PCR was used to\nconstruct a deletion in pNOL17 that resulted in the removal of\napproximately 870 bp of waaF coding sequence, and an 850-bp\nchloramphenicol resistance cassette from pAV35 (49, 51) was\ninserted in both orientations at the site of the deletion, forming\nplasmids pNOL22 (cat forward orientation) and pNOL23\n(cat reverse orientation) (Table 1). Constructs pNOL22 and\npNOL23 were each transformed into C. jejuni NCTC 11168,\nand putative recombinants were assessed by PCR and South-\nern blotting to verify that allelic replacement with the mutant\nwaaF allele had occurred (data not shown). The C. jejuni waaF\nmutant strains were named 11168NOL22 and 11168NOL23\n(Table 1). The LOS produced by these mutants was character-\nized by SDS-PAGE followed by silver staining or Western\nblotting (immunoblotting) using Penner 2 antisera (Fig. 2).\nSilver staining revealed that the core molecules produced by\nthe waaF mutant strains were notably truncated compared to\nthat produced by C. jejuni NCTC 11168. Immunoblotting the\nwaaF mutants confirmed truncation of the LOS molecules to\nsuch an extent as to render them no longer detectable with\nPenner serum, and thus the predicted absence of the outer\ncore can be deduced to have removed the majority of HS:2\nserum-reactive epitopes in the C. jejuni waaF mutants. Consis-\ntent with these findings, in TLC with immunostaining, LOS\nfrom C. jejuni 11168NOL22 did not react with antisera against\nGM1, asialo-GM1, or GM2 gangliosides whereas LOS of the C.\njejuni NCTC 11168 serostrain reacted with all three antisera.\nSimilarly, although C. jejuni NCTC 11168 LOS bound PNA,\nCT, and TTC ligands, LOS of 11168NOL22 did not. Hence,\ncompared to the parental strain, the waaF mutant has lost the\nouter core, which contains ganglioside-like epitopes, due to the\ntruncation of the core oligosaccharide.\nChemical analysis of core oligosaccharide produced by wild-\ntype and waaF mutant strains of C. jejuni NCTC 11168. Loss of\nWaaF, a heptosyltransferase, is predicted to result in a trun-\ncation of the core oligosaccharide after the first LD-Hep res-\nidue that is added by WaaC. To verify the exact structural basis\nfor the truncation seen in the NCTC 11168 waaF mutant,\ncomparative chemical analysis of the mutant and parental\nstrains was undertaken. Core oligosaccharides were liberated\nfrom LOSs of C. jejuni NCTC 11168 and strain 11168NOL22,\nmethylated, and subsequently analyzed by FAB-MS. As shown\nin Fig. 3A, the permethylated core oligosaccharide of strain\nNCTC 11168 possessed a pseudomolecular ion (m\/z \n 2,801\n[M\u0001H]\u0001). Consistent with the observed reactivity with anti-\nFIG. 1. Complementation of the S. enterica serovar Typhimurium\nwaaF511 mutation using the C. jejuni NCTC 11168 waaF gene. S.\nenterica serovar Typhimurium LPS was isolated from the wild type,\nwaaF mutant, and waaF mutant complemented with C. jejuni waaF,\nseparated electrophoretically on an SDS-PAGE gel, and silver stained.\nLane 1, wild-type S. enterica serovar Typhimurium SL3770; lane 2,\nmutant S. enterica serovar Typhimurium SL3789 (waaF511); lane 3, S.\nenterica serovar Typhimurium SL3789 complemented by the C. jejuni\nNCTC 11168 waaF gene.\nFIG. 2. Mutation of the waaF gene in C. jejuni NCTC 11168 affects\nthe size and antigenicity of core oligosaccharide. SDS-PAGE gels of\nLOS extracts of wild-type C. jejuni NCTC 11168 and waaF mutants\nwere silver stained (A) or immunoblotted with HS:2 antisera (B). The\ntruncated LOS is not detectable by Western blotting using HS:2 anti-\nsera. Lane 1, waaF mutant 11168NOL22 (cat forward orientation);\nlane 2, waaF mutant 11168NOL23 (cat reverse orientation); lane 3,\nNCTC 11168.\nVOL. 184, 2002 CAMPYLOBACTER JEJUNI waaF GENE 2103\n o\nn\n August 19, 2013 by University of Leicester\nhttp:\/\/jb.asm.org\/\nD\now\nnloaded from\n \nganglioside antibodies and various ligands in TLC, the sugar\nsequence of the outer tetrasaccharide is identical to that in the\nGM1 ganglioside. Moreover, a complete structural analysis of\nthe core oligosaccharide of NCTC 11168 has confirmed this\nand has shown that the core oligosaccharide differs to that of\nthe previously published core of CCUG 10936 (also HS:2) in\npossessing an extra disaccharide of Gal-\u0006(1,3)GalNAc (A. P.\nMoran et al., unpublished results). In contrast, the permethy-\nlated oligosaccharide of strain 11168NOL22 (Fig. 3B) pos-\nsessed a pseudomolecular ion (m\/z \n 926 [M\u0001H]\u0001) and\ndaughter ions indicative of a truncated molecule composed of\nglucose, heptose, 3-deoxy-D-manno-2-octulosonic acid (Kdo),\nand phosphorylethanolamine. Therefore, the phenotypic anal-\nysis of LOS produced by the C. jejuni waaF mutant supports\nthe presence of a truncated core oligosaccharide, a phenotype\nentirely consistent with those of waaF mutants in other species.\nConstruction and characterization of C. jejuni NCTC 11828\nwaaF mutants. Until recently the high-molecular-weight poly-\nsaccharides produced by some strains of C. jejuni were pro-\nposed to be O-chain polysaccharides attached to core oligo-\nsaccharides (38). However, the presence of genes possibly\ninvolved in capsular biosynthesis in the C. jejuni genome (35) was\nreported, and the mutation of several of these kps genes leads to\nloss of high-molecular-weight polysaccharide biosynthesis (18).\nThus, C. jejuni produces an extracellular polysaccharide encoded\nby the locus containing the kps genes, but it remained to be shown\nthat this polysaccharide is not attached to the core oligosaccha-\nride, and thus is not an O-chain polysaccharide.\nC. jejuni NCTC 11828 (HS:6) produces a high-molecular-\nweight polysaccharide that can be visualized by immunoblot-\nting on a nitrocellulose membrane (52). The putative waaF\ngene from NCTC 11828 cloned into plasmid pNOL8 (see\nabove) shows 94% identity at the DNA level to the NCTC\n11168 waaF gene (data not shown). A deletion mutation in the\nC. jejuni NCTC 11828 waaF gene of pNOL8 was obtained by\ninverse PCR, and the approximately 820 bp of deleted se-\nquence was replaced with a cat resistance cassette to form\nplasmids pNOL11 (cat in the forward orientation) and\npNOL12 (cat in the reverse orientation). These two constructs\nwere transformed into C. jejuni NCTC 11828, the resultant\nrecombinant strains were selected on chloramphenicol, and\nthe expected allelic replacement in each strain was verified by\nPCR and Southern blotting (data not shown).\nExtracts of the NCTC 11828 waaF mutants (11828NOL11\nand 11828NOL12) were analyzed electrophoretically (Fig. 4).\nSilver staining and Western blotting with HS:6 antisera showed\nthat, as with 11168NOL22 and 11828NOL23, the core mole-\ncules produced by 11828NOL11 and 11828NOL12 were signif-\nicantly truncated. However, significantly, the mobility and in-\ntensity of the high-molecular-weight polysaccharides in both\n11828NOL11 and 11828NOL12 were unaffected by mutation\nof waaF. As would be predicted for an LOS-independent poly-\nsaccharide, the high-molecular-weight polysaccharide does not\nappear to be covalently attached to the lipid A core oligosac-\ncharide molecule.\nDISCUSSION\nBefore the completion of the C. jejuni genome sequencing\nproject (35) little was known about the genetic basis of cell\nsurface-associated oligosaccharide production. Functional\nanalysis of genes present in two of the three chromosomal\nregions containing polysaccharide biosynthesis genes (13, 18,\n25, 26, 52) has revealed that C. jejuni may produce LOS and\nextracellular capsule-related polysaccharide(s) rather than\nrough and smooth LPS. However, the exact structure of the\nLOS molecule of C. jejuni NCTC 11168 was not known, and\nalthough genes that are involved in the biosynthesis of a pu-\ntative capsule were identified (18), there was no genetic evi-\ndence to support the suggestion from previous structural stud-\nies (2, 15) of the occurrence of an extracellular polysaccharide\nnot covalently linked to the core oligosaccharide.\nThe core oligosaccharide structures of several C. jejuni se-\nrotypes have been determined, and all contain two LD-Hep\nresidues attached to Kdo, forming a conserved trisaccharide\nof LD-Hep-\u0002(1,3)-LD-Hep-\u0002(1,5)-Kdo (30, 37). These core\nstructures include that of an HS:2 strain (CCUG 10936) (5).\nMoreover, the FAB-MS data presented in this study are con-\nsistent with the occurrence of such an inner core in C. jejuni\nNCTC 11168. Furthermore, recent detailed chemical analysis\nof the latter core oligosaccharide has confirmed the occurrence\nof this same inner core (A. P. Moran et al., unpublished re-\nsults).\nAnalysis of the complete genome sequence of C. jejuni\nNCTC 11168 identified Cj1148 as a candidate for the waaF\nFIG. 3. Analysis of positive-ion FAB-MS of permethylated core\noligosaccharide from LOS of wild-type C. jejuni NCTC 11168 (A) and\nwaaF mutant 11168NOL22 (B). Numbers refer to m\/z values for ions.\nAbbreviations: GalNAc, N-acetyl-D-galactosamine; Gal, D-galactose;\nGlc, D-glucose; Hep, heptose; PEtn, phosphorylethanolamine. \u0001, der-\nivatization results in partial degradation of the Kdo with loss of 46\nmass units.\n2104 OLDFIELD ET AL. J. BACTERIOL.\n o\nn\n August 19, 2013 by University of Leicester\nhttp:\/\/jb.asm.org\/\nD\now\nnloaded from\n \ngene. Complementation of an S. enterica serovar Typhimurium\nwaaF mutant showed that Cj1148 can restore the production of\na complete core oligosaccharide and, thus, attachment of the\nO-chain. Mutation of Cj1148 in C. jejuni NCTC 11168 resulted\nin the production of a truncated LOS molecule. This mutant\nphenotype is consistent with that reported for waaF mutants of\nother gram-negative bacteria including E. coli (8), B. pertussis\n(1), H. influenzae (16, 33), H. ducreyi (7), Neisseria gonorrhoeae\n(43), and Neisseria meningitidis (17). WaaF is a heptosyltrans-\nferase which catalyzes the transfer of the second LD-Hep res-\nidue to the core oligosaccharide moiety (8, 46), the first hep-\ntose being added to Kdo by the heptosyltransferase I enzyme,\nWaaC. Mutation of waaC has been reported not to be possible\nin C. jejuni (23; M. Konkel, personal communication). Our C.\njejuni waaF mutant is viable, and the loss of WaaF activity\nresulted in the truncation of the core oligosaccharide of the\nLOS as determined by SDS-PAGE. Also, this was reflected by\nthe lack of reactivity of this LOS with all the ganglioside and\nligand reagents tested, due to the loss of ganglioside mimicry in\nthe outer core oligosaccharide. Furthermore, comparison with\nthe core oligosaccharide of the parental strain, NCTC 11168,\nby FAB-MS analyses confirmed that truncation was due to the\nlack of incorporation of the second heptose residue.\nSome strains of C. jejuni produce low-molecular-weight gly-\ncolipids similar to the LOS molecules produced by Haemophi-\nlus and Neisseria spp. (29); however, the additional presence in\nsome strains of ladder-like high-molecular-weight molecules\nwas at first thought to suggest that such strains also produced\nhigh-molecular-weight O-chain-bearing LPS (38). The struc-\ntural similarity of some of the polysaccharide repeat units to\nthose found in other gram-negative O-chains supported the\nassumption that the ladder-like polysaccharide was the\nO-chain and, thus, was linked to the core oligosaccharide (29).\nAlthough there were limited structural data to support the\ncovalent attachment of an O-chain polysaccharide to a lipid A\ncore molecule (3), there were data from structural studies to\nsuggest the production of other types of extracellular polysac-\ncharide molecules (2, 15). Furthermore, Karlyshev et al. (18)\nidentified genes involved in the production of the high-molec-\nular-weight polysaccharide molecules. Given the deduced\namino acid sequence similarity to enzymes associated with\ncapsular biosynthesis, the latter investigators proposed the pro-\nduction of a polysaccharide capsule in C. jejuni; capsular ma-\nterial in NCTC 11828 has been demonstrated by electro-\nphoretic analysis (20) and has been demonstrated in another\nstrain by electron microscopy (19). We established that Cj1148\nencodes WaaF, a heptosyltransferase II enzyme, and that a\nwaaF mutant contains a substantially truncated core oligosac-\ncharide. Given that it has not proved possible to produce a\nwaaC mutant, the waaF mutant is the deepest rough strain of\nC. jejuni available. The waaF mutation has enabled us to\nclearly establish that, as expected for LPS-independent mate-\nrial, the high-molecular-weight molecules are not attached in\nsignificant amounts to the lipid A core oligosaccharide. More-\nover, preliminary chemical studies have isolated and identified\nextracellular polysaccharide molecules produced by strain\nNCTC 11828 (81116) in which core sugars such as heptose and\nKdo are not detectable (A. P. Moran and A. V. Savage, un-\npublished results). Thus, by complementary study of the core\noligosaccharide structure, our data extend the study of Karly-\nshev et al. (18) and also support the deductions of previous\nstructural studies (2, 15) that C. jejuni strains produce LOS and\nelaborate a non-LPS-related polysaccharide.\nThe confirmation of the function of WaaF adds it to a list of\nonly a few enzymes involved in the biosynthesis of the C. jejuni\nLOS molecule whose functions have been verified experimen-\ntally. These include heptosyltransferase I (waaC) (23), UDP-\ngalactose-4-epimerase (galE) (10), galactosyltransferases\n(wlaN and cgtB) (12, 25), sialyltransferases (cstI and cstII) (12),\nan N-acetylgalactosaminyltransferase (cgtA) (12), and\nN-acetylneuraminic acid (NeuNAc) synthetase (neuB1) (26).\nOnly waaC, wlaN, galE, and neuB1 are found in NCTC 11168,\nand there is a fusion of cgtA and a CMP-NeuNAc synthetase\ngene (designated neuA1 in NCTC 11168 [35]) (13, 26). Most of\nthe genes involved in LOS biosynthesis in C. jejuni are associ-\nated with the formation of the LOS-associated GM1-like\nepitope found in some strains. The heptosyltransferases WaaC\nand WaaF attach the first two heptoses to the Kdo of the\ngrowing inner core lipid A molecule. GalE is required for the\nproduction of the galactose residues found in the outer core\nmolecule and \u0006(1,3)-galactosyltransferases WlaN and CgtB\nhave been shown to be required for the attachment of the\ngalactose residue in the outer core that forms part of the\nFIG. 4. Mutation of the waaF gene in C. jejuni NCTC 11828 affects\nthe size and antigenicity of the core oligosaccharide but not of the\nhigh-molecular-weight polysaccharide. SDS-PAGE gels of polysaccha-\nride extracts from parental C. jejuni NCTC 11828 and waaF mutants\nwere stained with silver (A) and immunoblotted (B) by using HS:6\nantisera. Lane 1, waaF mutant 11828NOL11 (cat forward orientation);\nlane 2, waaF mutant 11828NOL12 (cat reverse orientation); lane 3,\nparental C. jejuni NCTC 11828.\nVOL. 184, 2002 CAMPYLOBACTER JEJUNI waaF GENE 2105\n o\nn\n August 19, 2013 by University of Leicester\nhttp:\/\/jb.asm.org\/\nD\now\nnloaded from\n \nGM1-like epitope. This GM1-like epitope also contains Neu-\nNAc, the biosynthesis of which has been shown to involve\nNeuB1 (the product of one of three NeuNAc synthetase genes\nin the C. jejuni NCTC 11168 genome [35]) and which is at-\ntached by a sialyltransferase, for example, \u0002(2,3)-sialyltrans-\nferase (CstI) or \u0002(2,3)- and \u0002(2,8)-sialyltransferase (CstII).\nThe attachment of the terminal N-acetylgalactosamine of the\nGM1 epitope requires CgtA or NeuA1. Having the C. jejuni\nNCTC 11168 genome sequence combined with the exact struc-\nture of the LOS of the strain will facilitate the confirmation of\nproposed models of LOS biosynthesis (10, 27) and will prove\nuseful in the determination of the functions of new LOS bio-\nsynthesis genes found in other strains (for example, see refer-\nence 12).\nMoreover, the waaF mutation described in this study should\nprove a useful tool for the evaluation of the contribution of C.\njejuni LOS structures to pathogenesis. The waaF mutant\nstrains could be used in both in vivo and in vitro studies to\nstudy the effects of core truncation on processes such as colo-\nnization, adherence, invasion, and the ability to stimulate the\nhost inflammatory response. However, such studies are ham-\npered by the lack of a suitable animal model to closely mimic\nthe clinical manifestations of Campylobacter enteritis (54).\nAlso, the waaF mutant can be used to investigate the contri-\nbution of the LOS core oligosaccharide to the development of\nGBS. However, again, no suitable animal model is currently\navailable to determine the ability of such mutant strains to\ninduce GBS (37).\nACKNOWLEDGMENTS\nThis study was supported by studentships to N.O. and L.M. by the\nBiotechnology and Biological Sciences Research Council and by a\ngrant to A.M. from the Irish Health Research Board.\nThe S. enterica serovar Typhimurium strains were a kind gift from T.\nIsobe (Department of Clinical Veterinary Medicine, University of\nCambridge, United Kingdom).\nREFERENCES\n1. Allen, A. G., T. Isobe, and D. J. Maskell. 1998. Identification and cloning of\nwaaF (rfaF) from Bordetella pertussis and use to generate mutants of Borde-\ntella spp. with deep rough lipopolysaccharide. J. Bacteriol. 180:35–40.\n2. Aspinall, G. O., C. M. Lynch, H. Pang, R. T. Shaver, and A. P. Moran. 1995.\nChemical structures of the core region of Campylobacter jejuni O:3 lipopoly-\nsaccharide and an associated polysaccharide. Eur. J. Biochem. 231:570–578.\n3. Aspinall, G. O., A. G. McDonald, and H. Pang. 1992. Structures of the O\nchains from lipopolysaccharides of Campylobacter jejuni serotypes O:23 and\nO:36. Carbohydr. Res. 231:13–30.\n4. Aspinall, G. O., A. G. McDonald, H. Pang, L. A. Kurjanczyk, and J. L.\nPenner. 1994. Lipopolysaccharides of Campylobacter jejuni serotype O:19—\nstructure of core oligosaccharide regions from the serostrain and two bac-\nterial isolates from patients with the Guillain-Barre syndrome. Biochemistry\n33:241–249.\n5. Aspinall, G. O., A. G. McDonald, T. S. Raju, H. Pang, L. A. Kurjanczyk, J. L.\nPenner, and A. P. Moran. 1993. Chemical structure of the core region of\nCampylobacter jejuni serotype O:2 lipopolysaccharide. Eur. J. Biochem. 213:\n1029–1037.\n6. Aspinall, G. O., A. G. McDonald, T. S. Raju, H. Pang, A. P. Moran, and J. L.\nPenner. 1993. Chemical structures of the core regions of Campylobacter\njejuni serotypes O:1, O:4, O:23, and O:36 lipopolysaccharides. Eur. J. Bio-\nchem. 213:1017–1027.\n7. Bauer, B. A., S. R. Lumbley, and E. J. Hansen. 1999. Characterization of a\nWaaF (RfaF) homolog expressed by Haemophilus ducreyi. Infect. Immun.\n67:899–907.\n8. Brabetz, W., S. Muller-Loennies, O. Holst, and H. Brade. 1997. Deletion of\nthe heptosyltransferase genes rfaC and rfaF in Escherichia coli K-12 results in\nan Re-type lipopolysaccharide with a high degree of 2-aminoethanol phos-\nphate substitution. Eur. J. Biochem 247:716–724.\n9. Brooke, J. S., and M. A. Valvano. 1996. Biosynthesis of inner core lipopoly-\nsaccharide in enteric bacteria identification and characterization of a con-\nserved phosphoheptose isomerase. J. Biol. Chem. 271:3608–3614.\n10. Fry, B. N., S. Feng, Y.-Y. Chen, D. G. Newell, P. J. Coloe, and V. Korolik.\n2000. The galE gene of Campylobacter jejuni is involved in lipopolysaccharide\nsynthesis and virulence. Infect. Immun. 68:2594–2601.\n11. Fry, B. N., V. Korolik, J. A. ten Brinke, M. T. T. Pennings, R. Zalm, B. J. J.\nTeunis, P. J. Coloe, and B. A. M. van der Zeijst. 1998. The lipopolysaccha-\nride biosynthesis locus of Campylobacter jejuni 81116. Microbiology 144:\n2049–2061.\n12. Gilbert, M., J. R. Brisson, M. F. Karwaski, J. Michniewicz, A. M. Cunning-\nham, Y. Wu, N. M. Young, and W. W. Wakarchuk. 2000. Biosynthesis of\nganglioside mimics in Campylobacter jejuni OH4384. J. Biol. Chem. 275:\n3896–3906.\n13. Guerry, P., C. P. Ewing, T. E. Hickey, M. M. Prendergast, and A. P. Moran.\n2000. Sialylation of lipooligosaccharide cores affects immunogenicity and\nserum resistance of Campylobacter jejuni. Infect. Immun. 68:6656–6662.\n14. Hanahan, D. 1983. Studies on transformation of E. coli with plasmids. J. Mol.\nBiol. 166:557–579.\n15. Hanniffy, O. M., A. S. Shashkov, A. P. Moran, M. M. Prendergast, S. N.\nSenchenkova, Y. A. Knirel, and A. V. Savage. 1999. Chemical structure of a\npolysaccharide from Campylobacter jejuni 176.83 (serotype O:41) containing\nonly furanose sugars. Carbohydr. Res. 319:124–132.\n16. Hood, D., M. Deadman, T. Allen, H. Masoud, A. Martin, J. Brisson, R.\nFleischmann, J. Venter, J. Richards, and E. Moxon. 1996. Use of the com-\nplete genome sequence information of Haemophilus influenzae strain Rd to\ninvestigate lipopolysaccharide biosynthesis. Mol. Microbiol. 22:951–965.\n17. Jennings, M. P., M. Bisercic, K. L. Dunn, M. Virji, A. Martin, K. E. Wilks,\nJ. C. Richards, and E. R. Moxon. 1995. Cloning and molecular analysis of the\nIsi1 (rfaF) gene of Neisseria meningitidis which encodes a heptosyl-2-trans-\nferase involved in LPS biosynthesis: evaluation of surface exposed carbohy-\ndrates in LPS mediated toxicity for human endothelial cells. Microb. Pathog.\n19:391–407.\n18. Karlyshev, A. V., D. Linton, N. A. Gregson, A. J. Lastovica, and B. W. Wren.\n2000. Genetic and biochemical evidence of a Campylobacter jejuni capsular\npolysaccharide that accounts for Penner serotype specificity. Mol. Microbiol.\n35:529–541.\n19. Karlyshev, A. V., M. V. McCrossan, and B. W. Wren. 2001. Demonstration\nof polysaccharide capsule in Campylobacter using electron microscopy. In-\nfect. Immun. 69:5921–5924.\n20. Karlyshev, A. V., and B. W. Wren. 2001. Detection and initial characteriza-\ntion of novel capsular polysaccharide among diverse Campylobacter jejuni\nstrains using Alcian blue dye. J. Clin. Microbiol. 39:279–284.\n21. Ketley, J. M. 1997. Pathogenesis of enteric infection by Campylobacter.\nMicrobiology 143:5–21.\n22. Kievit, T. R., and J. S. Lam. 1997. Isolation and characterization of two\ngenes, waaC (rfaC) and waaF (rfaF), involved in Pseudomonas aeruginosa\nserotype 5 inner core biosynthesis. J. Bacteriol. 179:3451–3457.\n23. Klena, J. D., S. A. Gray, and M. E. Konkel. 1998. Cloning, sequencing, and\ncharacterization of the lipopolysaccharide biosynthetic enzyme heptosyl-\ntransferase I gene (waaC) from Campylobacter jejuni and Campylobacter coli.\nGene 222:177–185.\n24. Korolik, V., B. N. Fry, M. R. Alderton, B. A. M. van der Zeijst, and P. J.\nColoe. 1997. Expression of Campylobacter hyoilei lipo-oligosaccharide (LOS)\nantigens in Escherichia coli. Microbiology 143:3481–3489.\n25. Linton, D., M. Gilbert, P. G. Hitchen, A. Dell, H. R. Morris, W. W. Wakar-\nchuk, N. A. Gregson, and B. W. Wren. 2000. Phase variation of a beta-1,3-\ngalactosyltransferase involved in generation of the ganglioside GM1-like\nlipo-oligosaccharide of Campylobacter jejuni. Mol. Microbiol. 37:501–514.\n26. Linton, D., A. V. Karlyshev, P. G. Hitchen, H. R. Morris, A. Dell, N. A.\nGregson, and B. W. Wren. 2000. Multiple N-acetyl neuraminic acid syn-\nthetase (neuB) genes in Campylobacter jejuni: identification and character-\nization of the gene involved in sialylation of lipo-oligosaccharide. Mol. Mi-\ncrobiol. 35:1120–1134.\n27. Linton, D., A. V. Karlyshev, and B. W. Wren. 2001. Deciphering Campy-\nlobacter jejuni cell surface interactions from the genome sequence. Curr.\nOpin. Microbiol. 4:35–40.\n28. McSweegan, E., and R. I. Walker. 1986. Identification and characterization\nof two Campylobacter jejuni adhesins for cellular and mucous substrates.\nInfect. Immun. 53:141–148.\n29. Moran, A. P., and J. L. Penner. 1999. Serotyping of Campylobacter jejuni\nbased on heat-stable antigens: relevance, molecular basis and implications in\npathogenesis. J. Appl. Microbiol. 86:361–377.\n30. Moran, A. P., J. L. Penner, and G. O. Aspinall. 2000. Campylobacter lipo-\npolysaccharides, p. 241–257. In I. Nachamkin and M. J. Blaser (ed.), Campy-\nlobacter, 2nd ed. American Society for Microbiology, Washington, DC.\n31. Moran, A. P., E. T. Rietschel, T. U. Kosunen, and U. Zahringer. 1991.\nChemical characterization of Campylobacter jejuni lipopolysaccharides con-\ntaining N-acetylneuraminic acid and 2,3-diamino-2,3-dideoxy-D-glucose. J.\nBacteriol. 173:618–626.\n32. Nachamkin, I., B. M. Allos, and T. W. Ho. 2000. Campylobacter jejuni infec-\ntion and the association with Guillain-Barré syndrome, p. 155–175. In I.\nNachamkin and M. J. Blaser (ed.), Campylobacter, 2nd ed. American Society\nfor Microbiology, Washington, DC.\n33. Nichols, W. A., B. W. Gibson, W. Melaugh, N. G. Lee, M. Sunshine, and\n2106 OLDFIELD ET AL. J. BACTERIOL.\n o\nn\n August 19, 2013 by University of Leicester\nhttp:\/\/jb.asm.org\/\nD\now\nnloaded from\n \nM. A. Apicella. 1997. Identification of the ADP-L-glycero-D-manno-heptose-\n6-epimerase (rfaD) and heptosyltransferase II (rfaF) biosynthesis genes from\nnontypeable Haemophilus influenzae 2019. Infect. Immun. 65:1377–1386.\n34. Palmer, S. R., P. R. Gully, J. M. White, A. D. Pearson, W. G. Suckling, D. M.\nJones, J. C. L. Rawes, and J. L. Penner. 1983. Water-borne outbreak of\nCampylobacter gastroenteritis. Lancet i:287–290.\n35. Parkhill, J., B. W. Wren, K. Mungall, J. M. Ketley, C. Churcher, D. Basham,\nT. Chillingworth, R. M. Davies, T. Feltwell, S. Holroyd, K. Jagels, A. V.\nKarlyshev, S. Moule, M. J. Pallen, C. W. Penn, M. A. Quail, M.-A. Rajan-\ndream, K. M. Rutherford, A. H. M. van Vliet, S. Whitehead, and B. G.\nBarrell. 2000. The genome sequence of the food-borne pathogen Campy-\nlobacter jejuni reveals hypervariable sequences. Nature 403:665–668.\n36. Pitcher, D. G., N. A. Saunders, and R. J. Owen. 1989. Rapid extraction of\nbacterial chrmosomal DNA with guanidinium thiocyanate. Lett. Appl. Mi-\ncrobiol. 8:151–156.\n37. Prendergast, M. M., and A. P. Moran. 2001. Lipopolysaccharides in the\ndevelopment of the Guillain-Barré syndrome and Miller Fisher syndrome\nforms of acute inflammatory peripheral neuropathies. J. Endotoxin Res.\n6:341–359.\n38. Preston, M. A., and J. L. Penner. 1987. Structural and antigenic properties of\nlipopolysaccharides from serotype reference strains of Campylobacter jejuni.\nInfect. Immun. 55:1806–1812.\n39. Rietschel, E. T., L. Brade, O. Holst, V. A. Kulschin, B. Lindner, A. P. Moran,\nU. F. Schade, U. Zähringer, and H. Brade. 1990. Molecular structure of\nbacterial endotoxin in relation to bioactivity, p. 15–32. In A. Nowotny, J. J.\nSpitzer, and E. J. Ziegler (ed.), Cellular and molecular aspects of endotoxin\nreactions, vol. I. Elsevier Science Publishers, Amsterdam, The Netherlands.\n40. Rietschel, E. T., T. Kirikae, F. U. Schade, U. Mamat, G. Schmidt, H.\nLoppnow, A. J. Ulmer, U. Zähringer, U. Seydel, F. Di Padova, M. Schreier,\nand H. Brade. 1994. Bacterial endotoxin: molecular relationships of struc-\nture to activity and function. FASEB J. 8:217–225.\n41. Sambrook, J., E. F. Fritsch, and T. Maniatis. 1989. Molecular cloning: a\nlaboratory manual, 2nd ed. Cold Spring Harbor Laboratory Press, Cold\nSpring Harbor, N.Y.\n42. Schnaitman, C. A., and J. D. Klena. 1993. Genetics of lipopolysaccharide\nbiosynthesis in enteric bacteria. Microbiol. Rev. 57:655–682.\n43. Schwan, E. T., B. D. Robertson, H. Brade, and J. P. van Putten. 1995.\nGonococcal rfaF mutants express Rd2 chemotype LPS and do not enter\nepithelial host cells. Mol. Microbiol. 15:267–275.\n44. Schwerer, B., A. Neisser, R. J. Polt, H. Bernheimer, and A. P. Moran. 1995.\nAntibody crossreactivities between gangliosides and lipopolysaccharides of\nCampylobacter jejuni serotypes associated with Guillain-Barré syndrome. J.\nEndotoxin Res. 2:395–403.\n45. Schwimmer, S., and A. Bevenue. 1956. Reagent for differentiation of 1,4- and\n1,6-linked glucosaccharides. Science 123:543–544.\n46. Sirisena, D. M., P. R. Maclachlan, S. L. Liu, A. Hessel, and K. E. Sanderson.\n1994. Molecular analysis of the rfaD gene, for heptose synthesis, and the rfaF\ngene, for heptose transfer, in lipopolysaccharide synthesis in Salmonella\ntyphimurium. J. Bacteriol. 176:2379–2385.\n47. Szymanski, C. M., R. J. Yao, C. P. Ewing, T. J. Trust, and P. Guerry. 1999.\nEvidence for a system of general protein glycosylation in Campylobacter\njejuni. Mol. Microbiol. 32:1022–1030.\n48. Tsai, C.-M., and C. E. Frasch. 1982. A sensitive silver stain for detecting\nlipopolysaccharides in polyacrylamide gels. Anal. Biochem. 119:115–119.\n49. van Vliet, A., A. Wood, J. Henderson, K. Wooldridge, and J. Ketley. 1998.\nGenetic manipulation of enteric Campylobacter species, p. 407–419. In P.\nWilliams, J. Ketley, and G. Salmond (ed.), Techniques for bacterial patho-\ngenesis. Academic Press, London, United Kingdom.\n50. van Vliet, A. H. M., and J. M. Ketley. 2001. Pathogenesis of enteric Campy-\nlobacter infection. J. Appl. Microbiol. 90:45S–56S.\n51. Wang, Y., and D. E. Taylor. 1990. Chloramphenicol resistance in Campy-\nlobacter coli: nucleotide sequence, expression, and cloning vector construc-\ntion. Gene 94:23–28.\n52. Wood, A. C., N. J. Oldfield, C. A. O’Dwyer, and J. M. Ketley. 1999. Cloning,\nmutation and distribution of a putative lipopolysaccharide biosynthesis locus\nin Campylobacter jejuni. Microbiology 145:379–388.\n53. Wren, B. W., J. Henderson, and J. M. Ketley. 1994. A PCR-based strategy for\nthe rapid construction of defined bacterial deletion mutants. BioTechniques\n16:994–996.\n54. Young, V. B., D. B. Schauer, and J. G. Fox. 2000. Animal models of Campy-\nlobacter infection, p. 287–301. In I. Nachamkin and M. J. Blaser (ed.),\nCampylobacter, 2nd ed. ASM, Washington, DC.\nVOL. 184, 2002 CAMPYLOBACTER JEJUNI waaF GENE 2107\n o\nn\n August 19, 2013 by University of Leicester\nhttp:\/\/jb.asm.org\/\nD\now\nnloaded from\n \n"}