{"doi":"10.1355\/AE19-3A","coreId":"135858","oai":"oai:bradscholars.brad.ac.uk:10454\/3854","identifiers":["oai:bradscholars.brad.ac.uk:10454\/3854","10.1355\/AE19-3A"],"title":"Foreign Direct Investment and Poverty Reduction in the ASEAN Region.","authors":["Jalilian, Hossein","Weiss, John A."],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2002","abstract":"NoThis paper represents part of an ongoing study on the topic of foreign direct investment (FDI) and poverty reduction in the ASEAN region. The overall study covers both macro- and microeconomic aspects of this issue, and this paper addresses the macro dimension. Considerable work has been done on the relation between economic growth and poverty reduction, and by now a conventional wisdom is emerging which can be stated simply that while growth is critically important for poverty reduction, the pattern and nature of the growth process in economies also matters. Following this reasoning this study explores the link between FDI and poverty reduction. The broad hypothesis to be tested is that FDI through its growth effect or other means is poverty reducing. While a great deal has been written on a variety of aspects relating to poverty, the precise FDI-poverty link has rarely been addressed directly, and we seek to remedy this gap in the literature. The paper is in four sections. The first discusses briefly the broad dimensions of poverty in the ASEAN region and recent trends in terms of FDI. Having set out these empirical dimensions, the remaining sections consider data analysis and results. The second section sets out the econometric approach and the results from the relevant literature, the third discusses data and some preliminary results. The fourth gives the main results, and finally we draw some conclusions. \\ud\n\\ud\nI. Poverty and FDI in ASEAN \\ud\n\\ud\nNaturally within ASEAN as a region the poverty picture is very varied, as one would expect given the diversity of income levels among the member states. Table 1 summarises the position in terms of income levels and past income growth rates. The inequality in the group can be seen readily with two high-income countries, Singapore and Brunei; three lower-middle income countries, Malaysia, the Philippines, and Thailand; and the remaining members--Indonesia, Cambodia, Lao, Myanmar, Vietnam--all low income","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/3854<\/identifier><datestamp>\n                2014-05-19T15:30:10Z<\/datestamp><setSpec>\n                com_10454_225<\/setSpec><setSpec>\n                col_10454_6343<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nForeign Direct Investment and Poverty Reduction in the ASEAN Region.<\/dc:title><dc:creator>\nJalilian, Hossein<\/dc:creator><dc:creator>\nWeiss, John A.<\/dc:creator><dc:subject>\nASEAN Region<\/dc:subject><dc:subject>\nPoverty reduction<\/dc:subject><dc:subject>\nPoverty<\/dc:subject><dc:subject>\nForeign Direct Investment<\/dc:subject><dc:subject>\nFDI<\/dc:subject><dc:description>\nNo<\/dc:description><dc:description>\nThis paper represents part of an ongoing study on the topic of foreign direct investment (FDI) and poverty reduction in the ASEAN region. The overall study covers both macro- and microeconomic aspects of this issue, and this paper addresses the macro dimension. Considerable work has been done on the relation between economic growth and poverty reduction, and by now a conventional wisdom is emerging which can be stated simply that while growth is critically important for poverty reduction, the pattern and nature of the growth process in economies also matters. Following this reasoning this study explores the link between FDI and poverty reduction. The broad hypothesis to be tested is that FDI through its growth effect or other means is poverty reducing. While a great deal has been written on a variety of aspects relating to poverty, the precise FDI-poverty link has rarely been addressed directly, and we seek to remedy this gap in the literature. The paper is in four sections. The first discusses briefly the broad dimensions of poverty in the ASEAN region and recent trends in terms of FDI. Having set out these empirical dimensions, the remaining sections consider data analysis and results. The second section sets out the econometric approach and the results from the relevant literature, the third discusses data and some preliminary results. The fourth gives the main results, and finally we draw some conclusions. \\ud\n\\ud\nI. Poverty and FDI in ASEAN \\ud\n\\ud\nNaturally within ASEAN as a region the poverty picture is very varied, as one would expect given the diversity of income levels among the member states. Table 1 summarises the position in terms of income levels and past income growth rates. The inequality in the group can be seen readily with two high-income countries, Singapore and Brunei; three lower-middle income countries, Malaysia, the Philippines, and Thailand; and the remaining members--Indonesia, Cambodia, Lao, Myanmar, Vietnam--all low income.<\/dc:description><dc:date>\n2009-11-09T09:11:54Z<\/dc:date><dc:date>\n2009-11-09T09:11:54Z<\/dc:date><dc:date>\n2002<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\nnot applicable paper<\/dc:type><dc:identifier>\nJalilian, H. and Weiss, J. (2002). Foreign Direct Investment and Poverty Reduction in the ASEAN Region.\\ud\n ASEAN Economic Bulletin. Vol. 19, No. 3. Dec.<\/dc:identifier><dc:identifier>\n900088820<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/3854<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/dx.doi.org\/10.1355\/AE19-3A<\/dc:relation>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1355\/AE19-3A"],"year":2002,"topics":["ASEAN Region","Poverty reduction","Poverty","Foreign Direct Investment","FDI"],"subject":["Article","not applicable paper"],"fullText":null}