{"doi":"10.1016\/j.seppur.2009.01.016","coreId":"138741","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3391","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3391","10.1016\/j.seppur.2009.01.016"],"title":"Synthesis and characterization of size-selective nanoporous polymeric adsorbents for blood purification.","authors":["Malik, D. J.","Webb, C.","Holdich, R. G.","Ramsden, Jeremy J.","Warwick, G. L.","Roche, I.","Williams, D. J.","Trochimczuk, A. W.","Dale, J. A.","Hoenich, N. A."],"enrichments":{"references":[{"id":38063619,"title":"A new analysis method for the determination of the pore size distribution of porous carbons from nitrogen adsorption measurements.","authors":[],"date":null,"doi":"10.1016\/0008-6223(89)90035-3","raw":"Seaton, N.A., Walton, J.P.R.B., and Quirke, N. A new analysis method for the determination of the pore size distribution of porous carbons from nitrogen adsorption measurements. Carbon, 1989;27(6):853-861","cites":null},{"id":38063621,"title":"Adsorption kinetics of proteins.","authors":[],"date":"2002","doi":null,"raw":"Ramsden, J.J. Adsorption kinetics of proteins. In: A. Hubbard, editor. Encyclopaedia of Surface and Colloid Science, New York: Dekker, 2002, p. 240-261.","cites":null},{"id":38063622,"title":"Analysis of hen egg white lysozyme adsorption on Si(Ti)O2-aqueous solution interfaces at low ionic strength: a biphasic reaction related to solution self-association. Colloids Surfaces B.","authors":[],"date":"2000","doi":"10.1016\/s0927-7765(99)00085-5","raw":"Ball, V. and Ramsden, J.J. Analysis of hen egg white lysozyme adsorption on Si(Ti)O2-aqueous solution interfaces at low ionic strength: a biphasic reaction related to solution self-association. Colloids Surfaces B. 2000;17:81-94.","cites":null},{"id":38063616,"title":"Apparent pore size distributions of chromatography media.","authors":[],"date":"1996","doi":"10.1016\/0021-9673(96)00130-6","raw":"L. Hagel, M. Östberg, T. Andersson. Apparent pore size distributions of chromatography media. Journal of Chromatography A 743 (1996) 33-42.","cites":null},{"id":38063584,"title":"Arresting dialysis related amyloidosis: A prospective multicentre controlled trial of direct hemoperfusion with a beta(2)-microglobulin adsorption column,","authors":[],"date":"2004","doi":"10.1111\/j.1525-1594.2004.47260.x","raw":"F. Geyjo, Y. Kawaguchi, S. Hara, R. Nakazawa, N. Azuma, H. Ogawa, Y. Koda, M. Suzuki, H. Kaneda, H. Kishimoto, M. Oda, K. Ei, R. Miyazaki, H. Maruyama, M. Arakawa, M. Hara.  Arresting dialysis related amyloidosis: A prospective multicentre controlled trial of direct hemoperfusion with a beta(2)-microglobulin adsorption column, Aritifical Organs 28 (2004) 371-380.","cites":null},{"id":38063624,"title":"Batch measurement of adsorption rate in an agitated tank – pore diffusion kinetics with irreversible isotherm.","authors":[],"date":"1974","doi":null,"raw":"Suzuki, M. and Kawazoe, K. Batch measurement of adsorption rate in an agitated tank – pore diffusion kinetics with irreversible isotherm. Journal of Chemical Engineering of Japan. 1974; 7:346-350.","cites":null},{"id":38063585,"title":"Beta(2)-microglobulin-selective direct hemoperfusion column for the treatment of dialysis-related amyloidosis,","authors":[],"date":"2005","doi":"10.1016\/j.bbapap.2005.08.007","raw":"H. Kutsuki. Beta(2)-microglobulin-selective direct hemoperfusion column for the treatment of dialysis-related amyloidosis, Biochemica et Biophysica Acta-proteins and Proteomics 1753 (2005) 141-145.","cites":null},{"id":38063587,"title":"Blood purification for critical illness: Cytokines adsorption therapy,","authors":[],"date":"2006","doi":"10.1111\/j.1744-9987.2006.00342.x","raw":"K. Tsuchida, R. Yoshimura, T. Nakatani, Y. Takemoto. Blood purification for critical illness: Cytokines adsorption therapy, Therapeutic Apheresis and Dialysis 10 (2006) 25-31.Page 19 of 36 Accepted Manuscript","cites":null},{"id":38063612,"title":"Characteristics of superdex preparatory grade media for gel filtration chromatography of proteins and peptides,","authors":[],"date":"1996","doi":"10.1016\/0032-9592(95)00044-5","raw":"U. Hellburg, J. Ivarsson, B. Johansson. Characteristics of superdex preparatory grade media for gel filtration chromatography of proteins and peptides, Process Biochemistry 31 (1996) 163-172.","cites":null},{"id":38063595,"title":"Control of porous morphology in suspension polymerized poly(divinylbenzene) resins using oligomeric porogens,","authors":[],"date":"2004","doi":"10.1021\/ma0491053","raw":"F. S. Macintyre, D. C. Sherrington. Control of porous morphology in suspension polymerized poly(divinylbenzene) resins using oligomeric porogens, Macromolecules 37 (2004) 7628-7636.","cites":null},{"id":38063606,"title":"Cross-linked porous polymer resins with reverse micellar imprints: Factors affecting the porosity of the polymers,","authors":[],"date":"1999","doi":"10.1021\/ma980599b","raw":"X. X. Zhu, K. Banana, H. Y. Liu, M. Krause, M. Yang. Cross-linked porous polymer resins with reverse micellar imprints: Factors affecting the porosity of the polymers, Macromolecules 32 (1999) 277-281.","cites":null},{"id":38063613,"title":"Determination of polyvinyl alcohol using gel filtration liquid chromatography,","authors":[],"date":"2004","doi":null,"raw":"S. A. Jones, M. Brown, G. P. Martin. Determination of polyvinyl alcohol using gel filtration liquid chromatography, Chromatographia 59 (2004) 43-46.","cites":null},{"id":38063617,"title":"Determination of pore size distributions of porous chromatographic adsorbents by inverse size-exclusion chromatography,","authors":[],"date":"2004","doi":"10.1016\/j.chroma.2004.02.054","raw":"Y. Yao, A. M. Lenhoff. Determination of pore size distributions of porous chromatographic adsorbents by inverse size-exclusion chromatography, Journal of Chromatography A 1037 (2004) 273-282.","cites":null},{"id":38063577,"title":"Dialysis-related amyloidosis: late finding or hidden epidemic? Seminars in dialysis 19","authors":[],"date":"2006","doi":"10.1111\/j.1525-139x.2006.00134.x","raw":"L. M. Dember, B. L. Jaber. Dialysis-related amyloidosis: late finding or hidden epidemic? Seminars in dialysis 19 (2006) 105-109.","cites":null},{"id":38063620,"title":"Dynamics of protein adsorption at the solid\/liquid interface. Recent Res.","authors":[],"date":null,"doi":null,"raw":"Ramsden, J.J. Dynamics of protein adsorption at the solid\/liquid interface. Recent Res. Devel. Phys. Chem. 1997;1:133-142.","cites":null},{"id":38063593,"title":"Effect of inert components on the porous structure of 2-hydroxyethyl methacrylate-ethylene dimethylacrylate copolymers,","authors":[],"date":"1996","doi":"10.1016\/0032-3861(96)00259-5","raw":"D. Horák, F. Lednický, M. Bleha. Effect of inert components on the porous structure of 2-hydroxyethyl methacrylate-ethylene dimethylacrylate copolymers, Polymer 37 (1996) 4243-4249.","cites":null},{"id":38063599,"title":"Effect of polymeric porogens on the properties of poly(styrene-co-divinylbenzene),","authors":[],"date":"1997","doi":"10.1016\/s0014-3057(97)00090-6","raw":"I. C. Poinescu, V. Cotan. Effect of polymeric porogens on the properties of poly(styrene-co-divinylbenzene), European Polymer Journal 33 (1997) 1515-1521.","cites":null},{"id":38063574,"title":"ESRD patients in 2004: global overview of patient numbers, treatment and modalities and associated trends,","authors":[],"date":"2005","doi":"10.1093\/ndt\/gfi159","raw":"A. Grassman, S. Gioberge, S. Moeller, G. Brown. ESRD patients in 2004: global overview of patient numbers, treatment and modalities and associated trends, Nephrology Dialysis Transplantation 20 (2005) 2587-2593.","cites":null},{"id":38063581,"title":"Extracorporeal strategies for the removal of middle molecules,","authors":[],"date":"2006","doi":"10.1111\/j.1525-139x.2006.00135.x","raw":"J. F. Winchester, P. F. Audia. Extracorporeal strategies for the removal of middle molecules, Seminars in Dialysis 19 (2006) 110-114.","cites":null},{"id":38063594,"title":"Functional polymers prepared from p-styrenesulfonyl chloride as the functional monomer,","authors":[],"date":"1995","doi":"10.1021\/ie00047a007","raw":"K. Jeřábek, L. Hanková. Functional polymers prepared from p-styrenesulfonyl chloride as the functional monomer, Industrial Engineering Chemical Research 34 (1995) 2598-2604.","cites":null},{"id":38063591,"title":"Hypercross-linked polystyrene and its potential for liquid chromatography: A mini review,","authors":[],"date":"2002","doi":"10.1016\/s0021-9673(01)01583-7","raw":"V. Davankov, M. Tsyurupa, M. Ilyin, L. Pavlova. Hypercross-linked polystyrene and its potential for liquid chromatography: A mini review, Journal of Chromatography A 965 (2002) 65-73.","cites":null},{"id":38063603,"title":"Hypercrosslinked polymers: Basic principles of preparing the new class of polymeric materials,","authors":[],"date":"2002","doi":"10.1016\/s1381-5148(02)00173-6","raw":"M. P. Tsyurupa, V. A. Davankov. Hypercrosslinked polymers: Basic principles of preparing the new class of polymeric materials, Reactive and Functional Polymers 53 (2002) 193-203.","cites":null},{"id":38063590,"title":"Immobilization of proteins to lipid bilayers,","authors":[],"date":"1996","doi":"10.1016\/0956-5663(96)86789-3","raw":"J.J. Ramsden, G.I. Bachmanova, A.I. Archakov. Immobilization of proteins to lipid bilayers, Biosensors Bioelectronics 11 (1996) 523-528.","cites":null},{"id":38063608,"title":"Introduction to size exclusion chromatography, in: Handbook of size exclusion chromatography and related","authors":[],"date":"2004","doi":"10.1201\/9780203913321.ch1","raw":"E. G. Malawer, L. Senak. Introduction to size exclusion chromatography, in: Handbook of size exclusion chromatography and related techniques, C. Wu (Ed.). Second edition, Marcel Dekker, New York, 2004 pp. 1-24.","cites":null},{"id":38063623,"title":"Kinetics of human and bovine serum albumin adsorption at silica-titania surfaces.","authors":[],"date":"1997","doi":"10.1006\/jcis.1996.4528","raw":"Kurrat, R., Prenosil, J.E. and Ramsden, J.J. Kinetics of human and bovine serum albumin adsorption at silica-titania surfaces. J. Colloid Interface Science. 1997;185:1-8.","cites":null},{"id":38063597,"title":"Macroporous copolymer networks,","authors":[],"date":"2000","doi":"10.1016\/s0079-6700(00)00015-0","raw":"O. Okay. Macroporous copolymer networks, Progress in Polymer Science 25 (2000) 711-779.","cites":null},{"id":38063625,"title":"Modelling and simulation of the kidney.","authors":[],"date":"2005","doi":null,"raw":"Thomas, S.R. Modelling and simulation of the kidney. Journal of Biological Physics and Chemistry. 2005; 5:70-83.Page 22 of 36 Accepted Manuscript Larger proteins e.g. HSA cannot penetrate within the bead MMW solutes easily diffuse inside the porous bead Tortuous capillaries are accessible to MMW proteins External particle surface has a very low protein affinity coating Larger proteins e.g. HSA cannot penetrate within the bead MMW solutes easily diffuse inside the porous bead Tortuous capillaries are accessible to MMW proteins External particle surface has a very low protein affinity coating","cites":null},{"id":38063589,"title":"On adsorption-induced denaturation of folded proteins.","authors":[],"date":"2001","doi":"10.4024\/12fe01l.01.02","raw":"A. Fernandez and J. J. Ramsden. On adsorption-induced denaturation of folded proteins. J. Biol. Phys. Chem. 1 (2001) 81-84.","cites":null},{"id":38063592,"title":"One-pot synthesis of branched poly(styrene-divinylbenzene) suspension polymerized resins,","authors":[],"date":"2002","doi":"10.1021\/ma0209794","raw":"S. Durie, K. Jerabek, C. Mason, D. C. Sherrington. One-pot synthesis of branched poly(styrene-divinylbenzene) suspension polymerized resins, Macromolecules 35 (2002) 9665-9672.","cites":null},{"id":38063615,"title":"Particle porosimitry by inverse gel permeation chromatography,","authors":[],"date":"1977","doi":"10.1021\/ac50016a032","raw":"D. H. Freeman, I. C. Poinescu. Particle porosimitry by inverse gel permeation chromatography, Analytical Chemistry 49 (1977) 1183-1188.Page 21 of 36 Accepted Manuscript","cites":null},{"id":38063596,"title":"Phase separation in free-radical crosslinking copolymerisation: formation of heterogeneous polymer networks,","authors":[],"date":"1999","doi":"10.1016\/s0032-3861(98)00640-5","raw":"O. Okay. Phase separation in free-radical crosslinking copolymerisation: formation of heterogeneous polymer networks, Polymer 40 (1999) 4117-4129.","cites":null},{"id":38063605,"title":"Pore size control in crosslinked polymer resins by reverse micellar imprinting,","authors":[],"date":"1997","doi":"10.1021\/ma961580g","raw":"X. X. Zhu, K. Banana, R. Yen. Pore size control in crosslinked polymer resins by reverse micellar imprinting, Macromolecules 30 (1997) 3031-3035.","cites":null},{"id":38063614,"title":"Pore size distributions of cation-exchange adsorbents determined by inverse size-exclusion chromatography,","authors":[],"date":"2000","doi":"10.1016\/s0021-9673(00)00420-9","raw":"P. DePhillips, A. M. Lenhoff. Pore size distributions of cation-exchange adsorbents determined by inverse size-exclusion chromatography, Journal of Chromatography A 883 (2000) 39-54.","cites":null},{"id":38063618,"title":"Pore size distributions, in:","authors":[],"date":"1988","doi":"10.1016\/s0301-4770(08)60709-5","raw":"L. Hagel. Pore size distributions, in: Journal of Chromatography Library – Volume 40, Aqueous Size-Exclusion Chromatograhy, P.L. Dubin (Ed.). Elsevier, Netherlands, 1988,. pp. 119-155.","cites":null},{"id":38063600,"title":"Porogen and crosslinking effects on the surface area, pore volume distribution and morphology of macroporous polymers obtained by bulk polymerisation,","authors":[],"date":"2001","doi":"10.1021\/ma0004817","raw":"B. P. Santora, M. R. Gagné, K. G. Moloy, N. S. Radu. Porogen and crosslinking effects on the surface area, pore volume distribution and morphology of macroporous polymers obtained by bulk polymerisation, Macromolecules 34 (2001) 658-661.","cites":null},{"id":38063604,"title":"Porous structure of hypercrosslinked polystyrene: State-of-the-art mini-review,","authors":[],"date":"2006","doi":"10.1016\/j.reactfunctpolym.2005.11.004","raw":"M. P. Tsyurupa, V. A. Davankov. Porous structure of hypercrosslinked polystyrene: State-of-the-art mini-review, Reactive and Functional Polymers 66 (2006) 768-779.","cites":null},{"id":38063610,"title":"Preparation and pore-size control of hydrophilic monodispersed polymer microspheres for size-exclusive separation of biomolecules by the SPG membrane emulsification technique,","authors":[],"date":"2004","doi":"10.1007\/s00396-003-1014-y","raw":"H. Yoshizawa, M. Maruta, S. Ikeda, Y. Hatate, Y. Kitamura. Preparation and pore-size control of hydrophilic monodispersed polymer microspheres for size-exclusive separation of biomolecules by the SPG membrane emulsification technique, Colloid Polymer Science 282 (2004) 965-971.","cites":null},{"id":38063578,"title":"Removal of middle molecules with sorbents,","authors":[],"date":"2002","doi":"10.1081\/bio-120016355","raw":"J. F. Winchester, J. Salsberg, E. Yoshua. Removal of middle molecules with sorbents, Artificial Cells Blood Substitutes and Immobilisation Technology 30 (2002) 547-554.","cites":null},{"id":38063609,"title":"Semirigid polymer gels for size exclusion chromatography, in: Handbook of size exclusion chromatography and related","authors":[],"date":"2004","doi":"10.1201\/9780203913321.ch2","raw":"E. Meehan. Semirigid polymer gels for size exclusion chromatography, in: Handbook of size exclusion chromatography and related techniques, C. Wu (Ed.). Second edition, Marcel Dekker, New York, 2004 p. 25-44.","cites":null},{"id":38063588,"title":"Single chain antibody fragment-based adsorbent for the extracorporeal removal of beta(2)-microglobulin,","authors":[],"date":"2004","doi":"10.1111\/j.1523-1755.2004.00377.x","raw":"E. A. Grovender, B. Kellogg, J. Singh, D. Blom, H. Ploegh, K. D. Wittrup, R. S. Langer, G. A. Ameer. Single chain antibody fragment-based adsorbent for the extracorporeal removal of beta(2)-microglobulin, Kidney International 65 (2004) 310-322.","cites":null},{"id":38063607,"title":"Size exclusion chromatography and related separation techniques.","authors":[],"date":"1998","doi":"10.1002\/chin.199834345","raw":"H. G. Barth, B. E. Boyes, C. Jackson. Size exclusion chromatography and related separation techniques. Analytical Chemistry 70 (1998) 251-278.","cites":null},{"id":38063582,"title":"Sorbents in acute renal failure and the systemic inflammatory response syndrome,","authors":[],"date":"2003","doi":"10.1159\/000067860","raw":"J. F. Winchester, J. Kellum, C. Ronco, J. A. Brady, P. J. Quartararo, J. A.  Salsberg, N. W. Levin. Sorbents in acute renal failure and the systemic inflammatory response syndrome, Blood Purification 21 (2003) 79-84.","cites":null},{"id":38063601,"title":"Structure and morphology of polymer supports,","authors":[],"date":"1998","doi":"10.1039\/a803757d","raw":"D. C. Sherrington. Preparation, Structure and morphology of polymer supports, Chemical Communications 21 (1998) 2275-2286.Page 20 of 36 Accepted Manuscript","cites":null},{"id":38063598,"title":"Styrene-divinylbenzene copolymers: influence of the diluent on network porosity,","authors":[],"date":"1984","doi":"10.1002\/app.1984.070290103","raw":"I. C. Poinescu, C. Beldie, V. Cotan. Styrene-divinylbenzene copolymers: influence of the diluent on network porosity, Journal of Applied Polymer Science 29 (1984) 23-34.","cites":null},{"id":38063602,"title":"Temperature a simple and efficient tool for the control of pore size distribution in macroporous polymers,","authors":[],"date":"1995","doi":"10.1021\/ma00126a044","raw":"F. Svec, M. J. Fréchet. Temperature a simple and efficient tool for the control of pore size distribution in macroporous polymers, Macromolecules 28 (1995) 7580-7582.","cites":null},{"id":38063576,"title":"The future of hemodialysis membranes,","authors":[],"date":"2006","doi":"10.1038\/sj.ki.5000204","raw":"H. D. Humes, W. H. Fissell, K. Tiranathanagul. The future of hemodialysis membranes, Kidney International 69 (2006) 1115-1119.","cites":null},{"id":38063583,"title":"Three controversial issues in extracorporeal toxin removal,","authors":[],"date":"2006","doi":"10.1111\/j.1525-139x.2006.00187_1.x","raw":"D. A. Feinfeld, J. W. Rosenberg, J. F. Winchester. Three controversial issues in extracorporeal toxin removal, Seminars in Dialysis 19 (2006) 358-362.","cites":null},{"id":38063579,"title":"What is uremia? Retention versus oxidation,","authors":[],"date":"2006","doi":"10.1159\/000089434","raw":"R. Vanholder, E. Schepers, N. Meert, N. Lameire. What is uremia? Retention versus oxidation, Blood Purification 24 (2006) 33-38.","cites":null}],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2009-05-07","abstract":"Crosslinked polystyrene co-divinylbenzene adsorbent microspheres with median diameters between 40 and 300 μm, with an enhanced proportion of mesopores in the range 4–10 nm, have been synthesized using a membrane emulsification technique. The aim was to develop an adsorbent for the selective removal of middle molecular weight uraemic toxins (size range 0.5–20 kDa), e.g. β2-microglobulin (11.8 kDa), whilst size-excluding larger blood proteins, e.g. serum albumin (MW 69 kDa). Using inverse size exclusion chromatography, the role of size exclusion has been demonstrated using hen egg lysozyme (a surrogate for β2-microglobulin) and human serum albumin as model proteins for batch adsorption studies. The adsorbent sample possessing a nanoporous structure with pores predominantly smaller than 10 nm successfully size-excludes serum albumin whilst displaying significant adsorption capacity for the middle molecular weight lysozyme (14.3 kDa)","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138741.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.seppur.2009.01.016","pdfHashValue":"e0f56805eda07c8e1bd0269d06f0a25bf3bf8da1","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3391<\/identifier><datestamp>2009-06-06T14:14:10Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Synthesis and characterization of size-selective nanoporous polymeric adsorbents for blood purification.<\/dc:title><dc:creator>Malik, D. J.<\/dc:creator><dc:creator>Webb, C.<\/dc:creator><dc:creator>Holdich, R. G.<\/dc:creator><dc:creator>Ramsden, Jeremy J.<\/dc:creator><dc:creator>Warwick, G. L.<\/dc:creator><dc:creator>Roche, I.<\/dc:creator><dc:creator>Williams, D. J.<\/dc:creator><dc:creator>Trochimczuk, A. W.<\/dc:creator><dc:creator>Dale, J. A.<\/dc:creator><dc:creator>Hoenich, N. A.<\/dc:creator><dc:subject>Middle molecular weight toxins<\/dc:subject><dc:subject>Haemoadsorption<\/dc:subject><dc:subject>Inverse size exclusion chromatography<\/dc:subject><dc:subject>Haemodialysis<\/dc:subject><dc:subject>Microspheres<\/dc:subject><dc:subject>Membrane emulsification<\/dc:subject><dc:description>Crosslinked polystyrene co-divinylbenzene adsorbent microspheres with median diameters between 40 and 300 μm, with an enhanced proportion of mesopores in the range 4–10 nm, have been synthesized using a membrane emulsification technique. The aim was to develop an adsorbent for the selective removal of middle molecular weight uraemic toxins (size range 0.5–20 kDa), e.g. β2-microglobulin (11.8 kDa), whilst size-excluding larger blood proteins, e.g. serum albumin (MW 69 kDa). Using inverse size exclusion chromatography, the role of size exclusion has been demonstrated using hen egg lysozyme (a surrogate for β2-microglobulin) and human serum albumin as model proteins for batch adsorption studies. The adsorbent sample possessing a nanoporous structure with pores predominantly smaller than 10 nm successfully size-excludes serum albumin whilst displaying significant adsorption capacity for the middle molecular weight lysozyme (14.3 kDa).<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2009-05-11T13:38:32Z<\/dc:date><dc:date>2009-05-11T13:38:32Z<\/dc:date><dc:date>2009-05-07<\/dc:date><dc:type>Postprint<\/dc:type><dc:identifier>D.J. Malik, C. Webb, R.G. Holdich, J.J. Ramsden, G.L. Warwick, I. Roche, D.J. Williams, A.W. Trochimczuk, J.A. Dale, N.A. Hoenich, Synthesis and characterization of size-selective nanoporous polymeric adsorbents for blood purification, Separation and Purification Technology, Volume 66, Issue 3, 7 May 2009, Pages 578-585<\/dc:identifier><dc:identifier>1383-5866<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.seppur.2009.01.016<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/3391<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1383-5866","1383-5866"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["Middle molecular weight toxins","Haemoadsorption","Inverse size exclusion chromatography","Haemodialysis","Microspheres","Membrane emulsification"],"subject":["Postprint"],"fullText":"Accepted Manuscript\nTitle: Synthesis and characterisation of size-selective\nnanoporous polymeric adsorbents for blood purification\nAuthors: D.J. Malik, C. Webb, R.G. Holdich, J.J. Ramsden,\nG.L. Warwick, I. Roche, D.J. Williams, A.W. Trochimczuk,\nJ.A. Dale, N.A. Hoenich\nPII: S1383-5866(09)00031-8\nDOI: doi:10.1016\/j.seppur.2009.01.016\nReference: SEPPUR 9463\nTo appear in: Separation and Purification Technology\nReceived date: 14-5-2008\nRevised date: 15-1-2009\nAccepted date: 26-1-2009\nPlease cite this article as: D.J. Malik, C. Webb, R.G. Holdich, J.J. Ramsden,\nG.L. Warwick, I. Roche, D.J. Williams, A.W. Trochimczuk, J.A. Dale, N.A.\nHoenich, Synthesis and characterisation of size-selective nanoporous polymeric\nadsorbents for blood purification, Separation and Purification Technology (2008),\ndoi:10.1016\/j.seppur.2009.01.016\nThis is a PDF file of an unedited manuscript that has been accepted for publication.\nAs a service to our customers we are providing this early version of the manuscript.\nThe manuscript will undergo copyediting, typesetting, and review of the resulting proof\nbefore it is published in its final form. Please note that during the production process\nerrors may be discovered which could affect the content, and all legal disclaimers that\napply to the journal pertain.\nPage 1 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n1\nSynthesis and characterisation of size-selective nanoporous polymeric adsorbents \nfor blood purification\nMalik DJa*, Webb Ca, Holdich RGa, Ramsden JJb, Warwick GLc, Roche Ia, Williams \nDJd,Trochimczuk AWe, Dale JAf and Hoenich NAg.\na Chemical Engineering Department, Loughborough University, Loughborough, \nLeicestershire, LE11 3TU, United Kingdom.\nb Department of Materials, Cranfield University, Bedfordshire, MK43 0AL, United Kingdom.\nc John Walls Renal Unit, Leicester General Hospital, University Hospitals of Leicester NHS \nTrust, Gwendolen Road, Leicester LE5 4PW, United Kingdom.\nd Wolfson School of Mechanical and Manufacturing Engineering, Loughborough University, \nLoughborough, LE11 3TU, United Kingdom\ne Faculty of Chemistry, Wrocław University of Technology, Wybrzeze Wyspiańskiego 27, \n50-370 Wrocław, Poland.\nf Global Research Centre, Purolite International Limited, Unit D, Llantrisant Business Park,  \nLlantrisant Wales, CF72 8LF, United Kingdom.\ng Department of Nephrology, University of Newcastle-upon-Tyne, The Medical School, \nNE2 4HH, United Kingdom.\nAbstract\nCrosslinked polystyrene codivinylbenzene adsorbent microspheres with median diameters \nbetween 40 and 300 micrometres, with an enhanced proportion of mesopores in the range \n4-10 nm, have  been synthesised using a membrane emulsification technique. The aim \nwas to develop an adsorbent for the selective removal of middle molecular weight uraemic \ntoxins (size range 0.5 – 20 kDa), e.g. 2-microglobulin (11.8 kDa), whilst size-excluding \nlarger blood proteins e.g. serum albumin (MW 69 kDa). Using inverse size exclusion \nchromatography, the role of size exclusion has been demonstrated using hen egg \n                                               \n* To whom correspondence should be addressed. Tel. +44 1509 222507; Fax: +44 1509 223923; email: \nd.j.malik@lboro.ac.uk,\nPage 2 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n2\nlysozyme (a surrogate for 2-microglobulin) and human serum albumin as model proteins \nfor batch adsorption studies. The adsorbent sample possessing a nanoporous structure \nwith pores predominantly smaller than 10 nm successfully size-excludes serum albumin \nwhilst displaying significant adsorption capacity for the middle molecular weight lysozyme \n(14.3 kDa).\nKeywords: Middle molecular weight toxins; haemoadsorption; inverse size exclusion \nchromatography; haemodialysis; microspheres; membrane emulsification\n1. Introduction\nWorldwide, around 1.8 million people are undergoing treatment for end-stage renal \ndisease (ESRD) [1], of which around 1.4 million (~77%) are on dialysis treatment (89% of \nwhich are on haemodialysis and 11% on peritoneal dialysis) and the rest (23%) are living \nwith a functioning renal transplant. Haemodialysis membranes are permeable to low \nmolecular weight solutes, however, the removal of potent middle molecular weight uraemic \ntoxins by this method is quite incomplete [2].  While the identity of many of these toxins \nremains unknown, elevated blood concentrations of certain middle molecular weight \nproteins (MMW ~ 10 kDa – 20 kDa) such as 2-microglobulin (2M, MW 11.8 kDa) have \nbeen associated with amyloid deposition [3] and inflammatory cytokines (e.g. IL-1, MW \n~18 kDa) have been associated with an elevated level of immune system activity [4].  \nThese are important target molecules for extracorporeal removal.  In established renal \nfailure, many other molecules in the MMW range accumulate [5].\nAn alternative to haemodialysis is to bring the blood extracorporeally in contact with a \nbiocompatible adsorbent.  There is increasing interest in the development of adsorption-\nbased systems for the non selective removal of toxins from blood for the treatment of \nuraemia [6], sepsis [7] and drug overdose [8].  A commercially available polymeric \nPage 3 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n3\nadsorbent (Lixelle, Kaneka, Japan) designed for the removal of 2M is being used in Japan \nfor the purification of haemodialysis patients’ blood. The adsorbent beads are porous \ncellulose, modified with hexadecyl groups that adsorb 2M by nonspecific hydrophobic \ninteractions.  Patients treated with the Lixelle column have been shown to have \nsignificantly lower levels of 2M (60–70% reduction compared with initial levels after a 4–5 \nh treatment session) and concomitantly improved symptoms, including a better ability to \nundertake daily activities, reduced joint stiffness and pain, as well as a reduction of the \nappearance of bone cysts [9]. The Lixelle adsorbent capacity is reported to be around 1 \nmg 2M per cm3 of adsorbent [10]. During a 4–5 h haemoperfusion treatment session, a \n350 cm3 column removed 210 mg of 2M [10] (the typical serum concentration of 2M in \nrenal patients is around 35 mg l-1).  The Lixelle column has also been shown to \nnonspecifically remove middle molecular weight plasma cytokines (IL-1, IL-6, IL-8 and \nTNF-) in humans with sepsis [11].  At the present time, this treatment is only undertaken \nin Japan and its (high) cost may exceed the value of the clinical benefits.  Other \nresearchers have investigated the use of immobilized antibody-functionalized adsorbents \nfor the selective removal of 2-M [12]. Reported adsorption capacity (0.4 mg 2M cm-3\nadsorbent) was comparable with the Lixelle adsorption data, but this approach is even \nmore expensive.\nThere is therefore a strong motivation to develop new, less costly polymeric adsorbents \npossessing suitable physicochemical attributes that may prove clinically beneficial.  We \nwondered whether such attributes might be achieved relatively simply by tailoring the \nmesoporous structure (4–10 nm range) using conventional suspension polymerization \nsynthesis techniques.  Ideally the external bead surface should have low affinity for all \nproteins;for example, by employing an ultrahydrophilic external surface coating for the \nadsorbent bead (see Figure 1); and may require surface modification to reduce adverse \nPage 4 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n4\ninteractions with blood that may lead to platelet activation, etc., -- proteins adsorbing on \nhydrophobic surfaces are likely to be permanently denatured [13] and recognised as \nforeign by the immune system.  The walls of the internal pores should have high affinity for \nall proteins (e.g., but could through nonspecific hydrophobic interactions). Suitable \npolymeric adsorbents must furthermore fulfil a number of clinical requirements: inter alia, \nduring haemodialysis, the amount of heparinized blood in the extracorporeal circuit (whose \nvolume is typically 250–300 cm3) and the time a portion of blood spends in the \nextracorporeal circuit is necessarily limited (typical blood flow rate during haemodialysis is \n250–400 cm3 min-1) to prevent blood coagulation and minimize platelet activation. In terms \nof an efficient blood purification column, these requirements translate into the following \ndesign criteria: (i) small column size, implying a high adsorption capacity per unit volume; \n(ii) fast adsorption kinetics, (implying a small bead size with a short diffusion path length); \n(iii) low pressure drop across the column, (implying a short bed length) and preferably \nmonosized beads to avoid low bed porosity.\nPhysiologically essential blood proteins such as serum albumin (HSA, MW 69 kDa) are \npresent at a very high concentration (HSA 40 g l-1 compared with 2M ~ 35 mg l-1), and \nideally they should not be removed during haemoperfusion.  Moreover, if adsorption  were \nnonspecific, the high concentration (3 orders of magnitude higher than 2M!) of HSA would \nflood the adsorbent surface with HSA and lead to very inefficient removal of the uraemic \ntoxins (14).  Bearing in mind that ideally the adsorbent should remove a range of middle \nmolecular weight molecules (i.e., smaller than albumin and other abundant blood proteins \nsuch as immunoglobulin and fibronectin), selectivity for the toxins in the presence of \ncompeting solutes may conveniently be achieved by size exclusion (Figure 1); the \nhydrodynamic diameter of HSA is ~7 nm and of MMW toxins such as 2M ~4 nm. Note \nPage 5 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n5\nthat size exclusion is routinely employed for the analytical determination of polymer \nmolecular weights (size exclusion chromatography, SEC).\nControl of pore structure in crosslinked polymeric resins has been investigated widely in \nthe literature [15-30], with the conclusion that controlling the maximum pore size in an \nadsorbent bead requires judicious selection of the diluents used as porogens; and the \ncrosslinking degree and to a lesser extent polymerization temperature and initiator (type \nand concentration) influence the pore structure within the polymer adsorbent bead.\nSince the adsorption process requires the toxin to diffuse within the adsorbent bead \n(where most of the surface for adsorption is present), the kinetics of the process will be \nlimited by intrabead mass transfer and hence depend on the size of the adsorbent beads. \nThere are two conflicting factors at play here, (i) whilst a small bead size will result in faster \ntoxin removal kinetics (desirable), the price to be paid will be (ii) a high external surface \narea per unit volume of packed-bed, which may result in adverse blood-surface \ninteractions and certainly a higher pressure drop across the adsorbent packed-bed.  This \nis undesirable since shear damage to blood (leading to haemolysis) is clinically dangerous.\nThe aim of the work presented here was to develop an adsorbent material that would \nsuccessfully size-exclude serum albumin while allowing middle molecular weight proteins \naccess to the internal surface of the adsorbent. We have focused on copolymers of \nstyrene divinylbenzene, PSDVB, because they are known to be good hydrophobic \nadsorbents.\n2. Experimental Materials and Methods\nPage 6 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n6\n2.1. Adsorbent Preparation\nDuring the suspension polymerization process, a mixture of styrene and divinylbenzene \n(oil phase) was dispersed in an aqueous solution (the continuous phase) using a novel \nmembrane emulsification process (described below). The reaction was initiated using \nbenzoyl peroxide as the initiator (1% of the monomer concentration by weight). Porogens \nstudied included toluene and mixtures of toluene with precipitating media such as \nundecane and naphthalene.  The exact compositions of the monomer phase can be seen \nin Table 1.  The monomer to porogen ratio was kept at 1:1 by weight.  The nomenclature \nused to label the adsorbents is explained by the following example: PSDVB3:5TolNap5:2 \n(from Table 1) was prepared by mixing equal amounts (w\/w) of a mixture containing \nstyrene and DVB (ratio 3:5) with a porogen mixture of toluene and naphthalene (ratio 5:2).\nThe emulsion droplets were stirred throughout the reaction period and stabilized using \npoly(vinyl alcohol) (PVA) to keep the droplets from coalescing during the “sticky” phase. \nOnce the polymerization reaction was complete, the polymer beads were separated from \nthe continuous phase by filtration.\n2.2. Membrane emulsification\nA conventional stirred tank system for generating an O\/W (oil in water) emulsion results in \na heterogeneous population of droplet sizes due to the nonuniformity of the shear field.  \nHence a membrane emulsification process was investigated (Figure 2).  By using a \ncontrolled pore size membrane (supplied by Micropore Technologies (UK) Ltd) a much \nnarrower size distribution than via the conventional method can be produced.  For the \nproduction of beads with a mean size of 40 µm, a circular 10 µm pore membrane was \nused. The monomer mixture was injected through the membrane into the aqueous solution \nusing a syringe pump at an injection rate of 0.4 cm3 min-1. The droplets were sheared off \nPage 7 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n7\nthe membrane surface using a paddle stirrer.  The continuous phase used to stabilize the \noil droplets was a solution of 3% w\/w PVA (Mowiol™ 40-88) and 3.3% w\/w NaCl. The \ndroplet size was controlled by shear at the membrane surface (influenced by the viscosity \nof the continuous phase and by the stirrer speed) and membrane pore size.\nThe droplets formed in the dispersion cell were then transferred to a reaction vessel \ncontaining an aqueous solution of 4.5% PVA and 3.3% NaCl. The polymerization reaction \nwas carried out at 80 °C for 24 h. Adsorbent beads were subsequently separated using a \nBuchner funnel and Whatman GF\/B glass fibre filters, washed with hot distilled water to \nremove the PVA and NaCl and rinsed with acetone to remove any residual water, and \nsoxhlet extracted for 8 h with toluene to remove any unreacted monomers. Finally, the \nadsorbent beads were dried under vacuum at ambient temperature overnight. Bead sizes \nwere evaluated using a Coulter LS130 instrument. The amount of material produced per \nbatch was typically ~50 cm3 of beads compared with ~100 cm3 from a conventional stirred \ntank system.\n2.3. Inverse Size Exclusion Chromatography\nSize exclusion chromatography [31-33] is conventionally used to size-separate solutes, e.g. \nproteins [34, 35] that . It is routinely used for the determination of the molecular weight \ndistribution of polymer samples [36]. Inverse size exclusion chromatography (ISEC) may \nbe used to investigate the pore structure of a swollen polymer adsorbent [37-41]. The \ntechnique employs a number of probe molecules (normally polymers of narrow molecular \nweight distribution) that do not interact with the surface of the adsorbent material. The \nretention time of each probe within a packed column of the adsorbent material reflects the \ndegree to which the probe is prevented from accessing the pore volume of the adsorbent \nPage 8 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n8\nbeads (and consequently the adsorbent bed). This can be expressed as the exclusion \ncoefficient, Kd, which is defined as:\nKd = \nVR - V0\nVT - V0\n(1)\nwhere VR is the solute elution volume, V0 is the interparticle void volume and VT is the total \nmobile phase volume. A probe molecule too large to enter the adsorbent beads allows the \ncharacterization of the interparticle void volume (V0), and by using a molecule small \nenough to enter all the pores, total accessible mobile phase volume (VT) is quantified. \nThus for each calibration probe of intermediate size, the corresponding Kd may be \ndetermined. The retention volumes and retention times are related by the flow rate of the \nmobile phase, i.e.\nKd = \ntR - t0\ntT - t0\n(2)\nwhere tR is the solute retention time, t0 is the retention time of the excluded probe and tT is \nthe retention time of the probe that can access the whole pore volume. Thus, values for Kd\nrange from 0 (completely excluded probe) to 1 (probe that can access the whole pore \nstructure), and 1 – Kd  gives the fraction of the pore volume inaccessible to a particular \nprobe molecule.\nFor analysis of the PSDVB the mobile phase was tetrahydrofuran (THF), and the probe \nmolecules were various low polydispersity calibration polystyrenes and toluene (the \nsmallest). Table 2 shows the relationship between polymer probe molecular weight and \nthe solute viscosity radius Rη (in cm) is given by the relation:\nPage 9 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n9\n  3\n1\nA\nη N10\nMη3\nR \n\n\n  (3)\nwhere NA is Avogadro’s number, M is the solute molecular weight and [] is the intrinsic \nviscosity (cm3 g-1) [37]. Rη accounts for both the solute mass and shape (which are also \nreflected in the intrinsic viscosity) and thus is used as a universal calibration parameter for \nSEC.\nAdsorbents with modal bead sizes of 30–40 µm were swollen in THF for 24 h before being \nslurry-packed under pressure (250 bar) into stainless steel columns 4.6 mm in diameter \nand 25 cm long. After packing, THF was passed through the columns overnight at a flow \nrate of 0.1 cm3 min-1 to ensure the bed was settled and any impurities removed. The \nconditions for the analysis were: column temperature 35 C, THF flow rate 0.5 cm3 min-1\n(Kontron Instruments HPLC pump 420), and 100 µl of 1.5 g l-1 polystyrene standard \nsolution were injected.  Detection of the standards was with a Perkin Elmer u.v.\/vis. \nLambda 2 spectrometer fitted with a flow cell operating at a wavelength of 254 nm.  \nRetention times for each standard were compiled and values for Kd calculated according to \neqn (2).\n2.4. Porosity\/Pore Size Distributions\nThe pore size distributions of the various adsorbents produced were analysed in the dry \nstate using nitrogen adsorption (77 K) on a Micromeritics ASAP 2000 instrument. \nAdditionally, data for Amberlite XAD4 (Rohm & Haas), a commercially available and widely \nstudied styrene co-divinylbenzene mesoporous adsorbent, is also reported as an example \nof a widely used adsorbent. All of the adsorbents were dried overnight from toluene under \nPage 10 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n10\nvacuum at ambient temperature. The nitrogen isotherm was fitted with the BET model to \nevaluate the surface area, and total pore volume was also recorded.  Incremental and \ncumulative pore size distributions were evaluated from the nitrogen adsorption isotherm \ndata using mean-field density functional theory (DFT) [42].\n2.5. Albumin and lysozyme uptake\nThe prohibitively high cost of 2-M for the physicochemical characterization experiments \nled us to seek a low-cost protein of similar size to 2-M, and readily available in a pure \nstate. Lysozyme (hen egg white, MW 14.4 kDa, size ~ 4 nm) was used as a surrogate for \n2-M (MW 11.8 kDa, size ~ 4 nm). The purpose of the single solute in vitro adsorption \nstudies was to demonstrate the accessibility of the adsorbent internal surface to solutes of \nsize ~ 4 nm and concomitant rejection of the significantly larger HSA (and a fortiori the \neven larger immunoglobulins).\nCharacterising adsorbents in terms of adsorption capacity and adsorption kinetics is \npossible experimentally using a batch stirred tank reactor.  The time to equilibrate\/saturate \nthe adsorbent with protein diffusing from the bulk solution to the interior of the adsorbent \nparticle depends on the particle size of the adsorbent beads and the effective diffusivity of \nthe protein in the interior of the adsorbent.  A small number of experiments under carefully \ncontrolled conditions was undertaken.\nThe dynamic batch adsorption experiments were conducted in a thermostated (37 C) 0.5 l \nstirred tank reactor fitted with an overhead agitator and baffles. Influence of stirrer agitation \nrate on the kinetics of the adsorption process was investigated and the stirrer agitation \nspeed was selected such that external mixing effects no longer influenced the kinetics of \nthe adsorption process (Biot number Bi  = kfRp\/De > 100, where kf is the external film mass \nPage 11 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n11\ntransfer coefficient, Rp the bead radius and De the solute effective diffusivity in the \nadsorbent pores). 0.5 l of pH-buffered (containing HEPES at a concentration of 10 mM, \nNaCl 100 mM, pH 7.2) protein solution (containing either lysozyme at an initial \nconcentration of 100 mg l-1 or human serum albumin at an initial concentration of 200 mg l-\n1) was brought into contact with a known amount of preswollen adsorbent, XAD4 or \nPSDVB3:5TolNap5:2. Solution samples were taken at regular intervals until no change in \nsolution protein concentration was recorded. The solution protein concentration was\nmeasured using reverse phase HPLC (Agilent 1100 series) equipped with a diode array \ndetector (detection wavelength  = 230 and 290 nm for albumin and lysozyme, \nrespectively) and a C18 analytical column (Supelco, UK). The mobile phases were A: \nultrapure water with 0.5% trifluoroacetic acid (TFA) and B: acetonitrile with 0.1% TFA.  A \nlinear gradient was used starting at (98% A : 2% B) and ending at (20% A: 80% B) over 60 \nminutes followed by a step change back to (98% A : 2% B) for 10 minutes to equilibrate \nthe column for the next sample. The combined mobile phase flow rate was set at 1 cm3\nmin-1, the column temperature was set at 40 C and the sample injection volume used was \n100 l. The reported adsorption capacity values (q*, mg g-1) correspond to saturation \nprotein uptake values whereas the fractional uptake F(t) = q(t)\/q* represents the \nnormalised uptake at a given time point (t).\n3. Results and Discussion\n3.1. Bead Size Control\nFigure 3 shows representative bead size distributions for two of the materials generated \nusing the membrane emulsification technique.  The data illustrate the effect of shear at the \nmembrane surface on the droplet size distribution. Median diameters within the range of \n30 to 300 m could be controllably produced. Table 3 summarizes the bead size \nPage 12 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n12\ninformation for the three adsorbents studied using the inverse size exclusion \nchromatography (ISEC) technique.\nAdsorbents used in fixed-bed haemoperfusion systems tend to have bead sizes larger \nthan 300 m. The ISEC work required the bead size to be an order of magnitude smaller \n(to aid resolution of the different probe retention peaks). Thus, the effect of the smaller \nbead size on the resulting pore size distribution was evaluated. Nitrogen \nadsorption\/desorption data was obtained for two PSDVB3:5TolUn1:0 samples with median \nbead sizes of 37 and 120 µm respectively. It is evident from Figure 4 that the pore \nstructure is essentially invariant for polymerization within oil droplets of different sizes over \nthis range. Thus, we can infer that ISEC measurements on material of smaller average \nsize may be used to provide insight into the pore structure of larger beads prepared under \nsimilar suspension polymerization conditions.\n3.2. Control of pore structure\nThe three monomer and porogen combinations investigated in the present study focus on \nthe use of toluene, a good solvent for polystyrene, to generate small pores, thereby \nreducing the maximum pore size. Figure 5 shows the normalized incremental pore volume \ndistributions for the materials studied. Table 4 provides a summary of the BET surface \narea, total pore volume and discretized surface area and pore volumes for pores in the \nranges 2–10 nm and 10–50 nm.\nComparing the pore structure of the adsorbent sample prepared using undecane \n(PSDVB1:1TolUn9:1) with XAD4 shows that while having different overall surface areas \nand pore volumes (Table 4), the two samples have similar pore size distributions (Figure \n5), especially in the region above 10 nm.  PSDVB3:5TolUn1:0 and PSDVB3:5TolNap5:2 \nPage 13 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n13\nboth have similar cut-offs at ~20 nm; however, PSDVB3:5TolNap5:2 has a smaller fraction \nof its pores in the region above 10 nm, which was the desired synthesis objective for \npromoting serum albumin exclusion.\nAnalysis of the adsorbent materials in the swollen state was done using ISEC themain \ndrawback of which is the requirement that the mobile phase be THF (to minimize \nnonspecific interactions between polystyrene probes and the adsorbent), a good solvent \nfor polystyrene. This may result in polymer segment swelling with the undesirable effect of \nchanging the internal pore structure compared with that of the polymer when suspended in \nwater or in contact with blood. There is however evidence that low-temperature vacuum \ndrying of a crosslinked polymeric adsorbent (medium to high crosslinking density) from a \nsolvent (either a poor or a good one) followed by nitrogen porosimetry may allow the \nporous structure in that solvent to be retained and hence recorded [21]. Thus, if the \nmaximum pore size (pore cut-off) of the methanol-dried adsorbent (methanol is a poor \nsolvent for polystyrene) is the same as that for a toluene-dried sample, then it is \nreasonable to assume that the results from the ISEC technique may be used to predict the \nmolecular weight cut-off for the adsorbent samples in THF. The adsorbents prepared in \nthis study have a high crosslinking degree and would be expected to have a stable pore \nstructure in any case. Figure 6 shows the cumulative pore volume distributions of \nPSDVB3:5TolNap5:2 when dried from toluene, acetone and methanol respectively. Figure \n6 clearly shows that there are differences in the pore volumes for this material when \nswollen in different solvents.  The normalized data would highlight any differences in the \ndistribution of pores due to swelling in different solvents.  As the normalized distributions \noverlay on one another, this suggests that while the total pore volume changes, the \ndistribution of the pores (greater than ~1 nm) and the pore cut-off remains unchanged. \nHence we may use ISEC with confidence.\nPage 14 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n14\n3.3. ISEC\nEight polystyrene standards in THF were used to probe the three adsorbents under \ninvestigation. XAD4 was not evaluated using ISEC as commercial material is not available \nin the appropriate bead size range (less than 50m); PSDVB1:1TolUn9:1 with its \ncomparative pore structure was used as a surrogate for XAD4. 8 probe standards and \ntoluene (see Table 2) were individually injected into the column packed with the adsorbent \nmaterial and a composite chromatogram overlaying all the peaks for each sample was \ngenerated (see Figure 7). From these chromatograms, the exclusion coefficients Kd were \ncalculated (eqns (1) and (2)). Kd represents the fraction of the pore volume which the \nprobe is able to access and this has been plotted in Figure 8 for the PSDVB1:1TolUn9:1 \nand PSDVB3:5TolNap5:2 polymer samples.\nSerum albumin has a nominal size of ~7 nm (hydrodynamic radius ~ 3.5 nm). Reference to \ndata in Table 2 shows that this falls between polystyrene probe standards PS 10 kDa, Rη\n2.8 nm and PS 20 kDa, Rη 4.7 nm. The chromatogram for PSDVB1:1TolUn9:1 (Figure 7A) \nclearly shows that the 20 kDa polystyrene probe (peak 7) is able to enter some part of the \nadsorbent pore structure. The chromatogram for PSDVB3:5TolNap5:2 shows the peak for \nthe 20 kDa polystyrene standard bunched up with the peak for the 1 MDa polystyrene \nstandard, implying rejection of the probe from the adsorbent. Resolution of probes below \n10 kDa is possible with the adsorbent material packed in this column. Figure 8 shows the \nfraction of the pore volume accessible to albumin-sized probes. Thus, on the basis of the \nISEC data, the adsorbent material PSDVB3:5TolNap5:2 possesses a well defined \nmesopore structure (< 10 nm) capable of size-excluding serum albumin whilst allowing \nmiddle molecular weight solutes access to the internal surface of the adsorbent.\nPage 15 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n15\n3.4. Albumin and lysozyme uptake\nAnalysis of protein equilibrium uptake data\nThe protein adsorption data obtained for XAD4 and PSDVB3:5TolNap5:2 are presented in \nTable 5. The saturation capacity values (q*) for lysozyme (LYZ) were 59 mg g-1 for \nPSDVB3:5TolNap5:2 and 330 mg g-1 for XAD4. The saturation capacity values (q*) for \nhuman serum albumin (HSA) were 2.2 mg g-1 for PSDVB3:5TolNap5:2 and 95 mg g-1 for \nXAD4. The adsorption capacity values were found to be concentration-independent \n(irreversible adsorption). This is fairly common for single protein adsorption studies, where \nsurface coverage has been found in many cases to equate to quasi-monolayer adsorption \n[43, 44]. The protein saturation capacity values were found to correlate with the surface \narea accessible to lysozyme (22 m2 g-1) and albumin (0.9 m2 g-1) for PSDVB3:5TolNap5:2 \n(nitrogen porosimetry data) determined on the basis of size exclusion from pores smaller \nthan 6 nm for lysozyme and 14 nm from albumin. This corresponds to surface coverage \nof 2.7 mg m-2 for lysozyme and 2.4 mg m-2 for albumin. Analysis of protein saturation data \nfor XAD4 using a similar basis as for PSDVB3:5TolNap5:2 yields the surface areas \naccessible to lysozyme (120 m2 g-1) and albumin (40 m2 g-1). This corresponds to  = 2.8 \nmg m-2 for lysozyme and 2.4 mg m-2 for albumin. These values are comparable to jammed, \nrandomly adsorbed monolayer coverages reported previously [45, 46].\nBatch adsorption dynamics\nIn addition to evaluation of the protein saturation uptake, time series data were modelled \nusing the irreversible adsorption model proposed by Suzuki and Kawazoe [47] to extract \nsolute intraparticle diffusivities (De). The adsorbent samples used were sieved to obtain\ntight particle size fractions. Experiments were performed using a single dissolved protein in \n0.1M Hepes buffer solution.  A summary of the values of the experimental variables used \nfor the batch adsorption experiments are provided in Table 6.  The stirrer speed was set to \nPage 16 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n16\n726 rpm as this was found to minimise external film mass transfer resistance to solute \ndiffusion permitting evaluation of the intraparticle diffusional resistance to mass transfer.\nThe 1st order differential equation derived by Suzuki et. al. [47] relating the change in \nsolute concentration in the tank to uptake by the adsorbent was solved using Matlab \nsoftware (version 7). The best fit value of the effective solute diffusivity De was found by \nminimising the sum of the squares of the errors (difference between the model prediction \nand the experimental data). The best fit intraparticle diffusivity values De evaluated for LYZ \nand HSA adsorption by PSDVB3:5TolNap5:2 and XAD 4 are presented in Table 6. \nExperimental kinetic data plotted as fractional uptake F(t) curves are presented in Figure 9; \nthe model predictions are shown as solid curves.\nThe fitted intraparticle diffusivity values De obtained for the lysozyme adsorption data \nsuggested that the uptake kinetics for PSDVB3:5TolNap5:2 (De = 4 x 10\n-13 m2 s-1) are in \norder of magnitude slower in comparison with XAD4 (De = 4 x 10\n-12 m2 s-1). The data in \nFigure 9 shows slower lysozyme uptak  by XAD4 due to the larger particles size for XAD4 \n(dp = 576 m) compared with PSDVB3:5TolNap5:2 (dp = 28 m).  The slower adsorption \nkinetics may be attributed to the tighter mesopore structure within PSDVB3:5TolNap5:2, \nmanifested in a reduction in the magnitude of the effective diffusivity of the solute within \nthe adsorbent particle.\nHSA (De = 5 x 10\n-11 m2 s-1) adsorption kinetics for XAD4 was found to be faster in \ncomparison with lysozyme (De = 4 x 10\n-12 m2 s-1) removal. HSA is able to access only a \nfraction of the adsorbent pore structure, which appears to provide little hindrance to the \ndiffusion of the solute.  The effective diffusivity is similar in magnitude to the free solution \ndiffusivity for HSA (6.1 x 10-11 m2 s-1). PSDVB3:5TolNap5:2 adsorption capacity for HSA \nPage 17 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n17\nwas small suggesting predominantly adsorption on the external bead surface. The fitted \nintraparticle diffusivity was similar in magnitude to the free solution diffusivity for HSA (6.1 \nx 10-11 m2 s-1).\n4. Conclusions\nControlling the internal pore structure of poly(styrene-divinylbenzene) adsorbents (pore \nsize less than 10 nm) is a route to enabling the removal of middle molecular weight \nproteins whilst excluding larger molecules like serum albumin. A styrene-containing \nadsorbent (PSDVB3:5TolNap5:2) has been engineered using a membrane emulsification \ntechnique and it has been demonstrated that microspheres with median bead diameters in \nthe range of 30 to 300 m can be prepared by the process. The microspheres have been \nshown to size-exclude serum albumin whilst allowing removal of smaller proteins \n(lysozyme, a surrogate for middle molecular weight uraemic toxins). The use of ISEC to \nprobe the pore structure of synthesized adsorbents has proved useful in demonstrating the \ninfluence of pore structure control on the size rejection behaviour. The adsorption data \nprovides evidence of the albumin size exclusion phenomena and is currently being \ninvestigated in more detail. Preliminary dynamic adsorption studies suggest hindered \ntransport of middle molecules due to the narrow pore size distribution needed to size-\nexclude human serum albumin.\nThe kidney is of course an amazingly complex organ [48], and a size-selective adsorbent \ncan of course only provide a very partial replacement of its function, but in the case of \nrenal failure the clinical options are limited, and an improvement in the current poor \nremoval of uraemic toxins by haemodialysis would be of great value for public health.  The \nwork reported here is a step in this direction.\nPage 18 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n18\nAcknowledgements\nThe authors would like to acknowledge the support of the Engineering and Physical \nSciences Research Council (grant nos. EP\/C517660\/1 and EP\/D033837\/1).\nReferences\n[1] A. Grassman, S. Gioberge, S. Moeller, G. Brown. ESRD patients in 2004: global \noverview of patient numbers, treatment and modalities and associated trends, Nephrology \nDialysis Transplantation 20 (2005) 2587-2593.\n[2] H. D. Humes, W. H. Fissell, K. Tiranathanagul. The future of hemodialysis membranes, \nKidney International 69 (2006) 1115-1119.\n[3] L. M. Dember, B. L. Jaber. Dialysis-related amyloidosis: late finding or hidden epidemic? \nSeminars in dialysis 19 (2006) 105-109.\n[4] J. F. Winchester, J. Salsberg, E. Yoshua. Removal of middle molecules with sorbents, \nArtificial Cells Blood Substitutes and Immobilisation Technology 30 (2002) 547-554.\n[5] R. Vanholder, E. Schepers, N. Meert, N. Lameire. What is uremia? Retention versus \noxidation, Blood Purification 24 (2006) 33-38.\n[6] J. F. Winchester, P. F. Audia. Extracorporeal strategies for the removal of middle \nmolecules, Seminars in Dialysis 19 (2006) 110-114.\n[7] J. F. Winchester, J. Kellum, C. Ronco, J. A. Brady, P. J. Quartararo, J. A.  Salsberg, N. \nW. Levin. Sorbents in acute renal failure and the systemic inflammatory response \nsyndrome, Blood Purification 21 (2003) 79-84.\n[8] D. A. Feinfeld, J. W. Rosenberg, J. F. Winchester. Three controversial issues in \nextracorporeal toxin removal, Seminars in Dialysis 19 (2006) 358-362.\n[9] F. Geyjo, Y. Kawaguchi, S. Hara, R. Nakazawa, N. Azuma, H. Ogawa, Y. Koda, M. \nSuzuki, H. Kaneda, H. Kishimoto, M. Oda, K. Ei, R. Miyazaki, H. Maruyama, M. Arakawa, \nM. Hara.  Arresting dialysis related amyloidosis: A prospective multicentre controlled trial \nof direct hemoperfusion with a beta(2)-microglobulin adsorption column, Aritifical Organs \n28 (2004) 371-380.\n[10] H. Kutsuki. Beta(2)-microglobulin-selective direct hemoperfusion column for the \ntreatment of dialysis-related amyloidosis, Biochemica et Biophysica Acta-proteins and \nProteomics 1753 (2005) 141-145.\n[11] K. Tsuchida, R. Yoshimura, T. Nakatani, Y. Takemoto. Blood purification for critical \nillness: Cytokines adsorption therapy, Therapeutic Apheresis and Dialysis 10 (2006) 25-31.\nPage 19 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n19\n[12] E. A. Grovender, B. Kellogg, J. Singh, D. Blom, H. Ploegh, K. D. Wittrup, R. S. Langer, \nG. A. Ameer. Single chain antibody fragment-based adsorbent for the extracorporeal \nremoval of beta(2)-microglobulin, Kidney International 65 (2004) 310-322.\n[13] A. Fernandez and J. J. Ramsden. On adsorption-induced denaturation of folded \nproteins. J. Biol. Phys. Chem. 1 (2001) 81-84.\n[14] J.J. Ramsden, G.I. Bachmanova, A.I. Archakov. Immobilization of proteins to lipid \nbilayers, Biosensors Bioelectronics 11 (1996) 523-528.\n[15] V. Davankov, M. Tsyurupa, M. Ilyin, L. Pavlova. Hypercross-linked polystyrene and its \npotential for liquid chromatography: A mini review, Journal of Chromatography A 965 \n(2002) 65-73.\n[16] S. Durie, K. Jerabek, C. Mason, D. C. Sherrington. One-pot synthesis of branched \npoly(styrene-divinylbenzene) suspension polymerized resins, Macromolecules 35 (2002)\n9665-9672.\n[17] D. Horák, F. Lednický, M. Bleha. Effect of inert components on the porous structure of \n2-hydroxyethyl methacrylate-ethylene dimethylacrylate copolymers, Polymer 37 (1996) \n4243-4249.\n[18] K. Jeřábek, L. Hanková. Functional polymers prepared from p-styrenesulfonyl chloride \nas the functional monomer, Industrial Engineering Chemical Research 34 (1995) 2598-\n2604.\n[19] F. S. Macintyre, D. C. Sherrington. Control of porous morphology in suspension \npolymerized poly(divinylbenzene) resins using oligomeric porogens, Macromolecules 37 \n(2004) 7628-7636.\n[20] O. Okay. Phase separation in free-radical crosslinking copolymerisation: formation of \nheterogeneous polymer networks, Polymer 40 (1999) 4117-4129.\n[21] O. Okay. Macroporous copolymer networks, Progress in Polymer Science 25 (2000) \n711-779.\n[22] I. C. Poinescu, C. Beldie, V. Cotan. Styrene-divinylbenzene copolymers: influence of \nthe diluent on network porosity, Journal of Applied Polymer Science 29 (1984) 23-34.\n[23] I. C. Poinescu, V. Cotan. Effect of polymeric porogens on the properties of \npoly(styrene-co-divinylbenzene), European Polymer Journal 33 (1997) 1515-1521.\n[24] B. P. Santora, M. R. Gagné, K. G. Moloy, N. S. Radu. Porogen and crosslinking \neffects on the surface area, pore volume distribution and morphology of macroporous \npolymers obtained by bulk polymerisation, Macromolecules 34 (2001) 658-661.\n[25] D. C. Sherrington. Preparation, Structure and morphology of polymer supports,\nChemical Communications 21 (1998) 2275-2286.\nPage 20 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n20\n[26] F. Svec, M. J. Fréchet. Temperature a simple and efficient tool for the control of pore \nsize distribution in macroporous polymers, Macromolecules 28 (1995) 7580-7582.\n[27] M. P. Tsyurupa, V. A. Davankov. Hypercrosslinked polymers: Basic principles of \npreparing the new class of polymeric materials, Reactive and Functional Polymers 53 \n(2002) 193-203.\n[28] M. P. Tsyurupa, V. A. Davankov. Porous structure of hypercrosslinked polystyrene: \nState-of-the-art mini-review, Reactive and Functional Polymers 66 (2006) 768-779.\n[29] X. X. Zhu, K. Banana, R. Yen. Pore size control in crosslinked polymer resins by \nreverse micellar imprinting, Macromolecules 30 (1997) 3031-3035.\n[30] X. X. Zhu, K. Banana, H. Y. Liu, M. Krause, M. Yang. Cross-linked porous polymer \nresins with reverse micellar imprints: Factors affecting the porosity of the polymers,\nMacromolecules 32 (1999) 277-281.\n[31] H. G. Barth, B. E. Boyes, C. Jackson. Size exclusion chromatography and related \nseparation techniques. Analytical Chemistry 70 (1998) 251-278.\n[32] E. G. Malawer, L. Senak. Introduction to size exclusion chromatography, in: Handbook \nof size exclusion chromatography and related techniques, C. Wu (Ed.). Second edition, \nMarcel Dekker, New York, 2004 pp. 1-24.\n[33] E. Meehan. Semirigid polymer gels for size exclusion chromatography, in: Handbook \nof size exclusion chromatography and related techniques, C. Wu (Ed.). Second edition, \nMarcel Dekker, New York, 2004 p. 25-44.\n[34] H. Yoshizawa, M. Maruta, S. Ikeda, Y. Hatate, Y. Kitamura. Preparation and pore-size \ncontrol of hydrophilic monodispersed polymer microspheres for size-exclusive separation \nof biomolecules by the SPG membrane emulsification technique, Colloid Polymer Science \n282 (2004) 965-971.\n[35] U. Hellburg, J. Ivarsson, B. Johansson. Characteristics of superdex preparatory grade \nmedia for gel filtration chromatography of proteins and peptides, Process Biochemistry 31 \n(1996) 163-172.\n[36] S. A. Jones, M. Brown, G. P. Martin. Determination of polyvinyl alcohol using gel \nfiltration liquid chromatography, Chromatographia 59 (2004) 43-46.\n[37] P. DePhillips, A. M. Lenhoff. Pore size distributions of cation-exchange adsorbents \ndetermined by inverse size-exclusion chromatography, Journal of Chromatography A 883 \n(2000) 39-54.\n[38] D. H. Freeman, I. C. Poinescu. Particle porosimitry by inverse gel permeation \nchromatography, Analytical Chemistry 49 (1977) 1183-1188.\nPage 21 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n21\n[39] L. Hagel, M. Östberg, T. Andersson. Apparent pore size distributions of \nchromatography media. Journal of Chromatography A 743 (1996) 33-42.\n[40] Y. Yao, A. M. Lenhoff. Determination of pore size distributions of porous \nchromatographic adsorbents by inverse size-exclusion chromatography, Journal of \nChromatography A 1037 (2004) 273-282.\n[41] L. Hagel. Pore size distributions, in: Journal of Chromatography Library – Volume 40, \nAqueous Size-Exclusion Chromatograhy, P.L. Dubin (Ed.). Elsevier, Netherlands, 1988,. \npp. 119-155.\n[42] Seaton, N.A., Walton, J.P.R.B., and Quirke, N. A new analysis method for the \ndetermination of the pore size distribution of porous carbons from nitrogen adsorption \nmeasurements. Carbon, 1989;27(6):853-861\n[43] Ramsden, J.J. Dynamics of protein adsorption at the solid\/liquid interface. Recent Res. \nDevel. Phys. Chem. 1997;1:133-142.\n[44] Ramsden, J.J. Adsorption kinetics of proteins. In: A. Hubbard, editor. Encyclopaedia \nof Surface and Colloid Science, New York: Dekker, 2002, p. 240-261.\n[45] Ball, V. and Ramsden, J.J. Analysis of hen egg white lysozyme adsorption on \nSi(Ti)O2-aqueous solution interfaces at low ionic strength: a biphasic reaction related to \nsolution self-association. Colloids Surfaces B. 2000;17:81-94.\n[46] Kurrat, R., Prenosil, J.E. and Ramsden, J.J. Kinetics of human and bovine serum \nalbumin adsorption at silica-titania surfaces. J. Colloid Interface Science. 1997;185:1-8.\n[47] Suzuki, M. and Kawazoe, K. Batch measurement of adsorption rate in an agitated \ntank – pore diffusion kinetics with irreversible isotherm. Journal of Chemical Engineering of \nJapan. 1974; 7:346-350.\n[48] Thomas, S.R. Modelling and simulation of the kidney. Journal of Biological Physics \nand Chemistry. 2005; 5:70-83.\nPage 22 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\nLarger proteins e.g. \nHSA cannot \npenetrate within the \nbead\nMMW solutes\neasily diffuse \ninside the \nporous bead\nTortuous \ncapillaries are \naccessible to \nMMW proteins\nExternal \nparticle \nsurface has a \nvery low \nprotein affinity \ncoating\nFigure 1. Schematic diagram of a size selective adsorbent bead, with a nanoporous structure suitable for \nsize exclusion of HSA whilst permitting smaller proteins e.g. lysozyme, to diffuse within.\nFigure (1)\nPage 23 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n                                     \nFigure 2. Schematic diagram of emulsion generation in a dispersion cell (left) and micrographs of a circular pore \nmembrane (lower right, courtesy of Micropore Technologies) and a polymer droplet emulsion (size range 130–170 m)\ngenerated using the dispersion cell (upper right).\nEmulsion \nDroplets\nMembrane\nDiscontinuous Phase\nAgitator\nFigure (2)\nPage 24 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n0\n2\n4\n6\n8\n10\n12\n14\n16\n18\n1 10 100 1000\nParticle Diameter\/μm\nV\no\nlu\nm\ne\n C\no\nn\ntr\nib\nu\nti\no\nn\n (\n%\n)\n4.5% PVA, shear rate 1620 \/ s-1\n0.5% PVA, shear rate 1049 \/ s-1\nFigure 3. Particle size distributions for polystyrene co-divinylbenzene resins prepared using a 10m circular pore \nmembrane (Micropore Technologies) but with different PVA concentrations and shear rates.  Coefficients of variation \n(CV) were typically around  20%, compared with 40% for materials prepared using a conventional stirred tank system.\nFigure (3)\nPage 25 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n0\n0.005\n0.01\n0.015\n0.02\n1 10 100\nPore Width \/ nm\nIn\ncr\nem\nen\nta\nl \nP\no\nre\n V\no\nlu\nm\ne \n\/ \ncm\n³ \ng\n-1\n37 µm\n120 µm\nFigure 4. Incremental pore volume distribution for PSDVB3:5TolUn1:0 (prepared as beads of median diameters of 37 \nand 120 m).\nFigure (4)\nPage 26 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n0\n0.01\n0.02\n0.03\n0.04\n0.05\n0.06\n1 10 100\nPore Width \/ nm\nN\no\nrm\n. \nIn\nc\nre\nm\ne\nn\nta\nl \nP\no\nre\n V\no\nlu\nm\ne PSDVB3:5TolNap5:2 PSDVB3:5TolUn1:0\nPSDVB1:1TolUn9:1 XAD4\nFigure 5. Normalised incremental pore volume distributions resulting from the use of different porogens.\nFigure (5)\nPage 27 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\nFigure 6. Cumulative and normalized (to the total cumulative volume) cumulative pore volume distributions for \nPSDVB3:5TolNap5:2 dried from different solvents.\n0\n0.05\n0.1\n0.15\n0.2\n0.25\n0.3\n0.35\n0.4\n0.45\n1 10 100\nPore Width (nm)\nC\nu\nm\nu\nla\nti\nv\ne \nP\no\nre\n V\no\nlu\nm\ne \n\/ c\nm\n³ \ng\n-1\n0.00\n0.25\n0.50\n0.75\n1.00\n1.25\n1.50\n1.75\n2.00\nN\no\nrm\n. \nC\nu\nm\nu\nla\nti\nve\n P\no\nre\n V\no\nlu\nm\ne\nToluene\nAcetone\nMethanol\nToluene (Normalised)\nAcetone (Normalised)\nMethanol (Normalised)\nFigure (6)\nPage 28 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\nFigure 7. ISEC chromatograms for (A) PSDVB1:1TolUn9:1 and (B) PSDVB3:5TolNap5:2 polymer samples.\n-100\n350\n800\n1 1.5 2 2.5 3 3.5\n-100\n350\n800\n1 1.5 2 2.5 3 3.5\nElution Volume \/ ml \nA\nB\n1\n1\n2\n3\n45\n6\n7\n8\n9\n45\n6\n7\n8\n9\n1 – Toluene 5 – PS 5 kDa\n2 – PS 500 Da 6 – PS 10 kDa\n3 – PS 1 kDa 7 – PS 20 kDa \n4 - PS 2 kDa 8 – PS 70 kDa\n9 – PS 1000 kDa23\nFigure (7)\nPage 29 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\nFigure 8. Percentage of pore volume accessible to probes determined from ISEC, comparison of PSDVB1:1TolUn9:1 \nand PSDVB3:5TolNap5:2 polymer samples (lines connecting the points are merely to guide the eye).\nFigure (8)\nPage 30 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\n10 100 1000 10000\nTime \/ min\nF\nra\nc\nti\no\nn\na\nl \nu\np\nta\nk\ne\n o\nf \np\nro\nte\nin\nFigure 9. Fractional uptake (q(t)\/q*) versus adsorption time, comparison of PSDVB3:5TolNap5:2 polymer sample (open \ntriangles – LYZ data; solid triangles – HSA data) and XAD4 polymer sample (open diamonds – LYZ data; solid diamonds\n– HSA data). Solid lines are the irreversible isotherm model predictions for the data.\nFigure(9)\nPage 31 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n22\nTable 1. Monomer phase compositions for polymer samples, all ratios w\/w.\nPorogens\nSample i.d.\nRatio of \nStyrene \nto DVB\nNominal \nCrosslinking \n%\n1 2\nRatio of \nPorogens \n(1:2)\nPSDVB3:5TolNap5:2 3:5 50 Toluene Naphthalene 5:2\nPSDVB3:5TolUn1:0 3:5 50 Toluene - 1:0\nPSDVB1:1TolUn9:1 1:1 40 Toluene Undecane 9:1\nPage 32 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n23\nTable 2. Polystyrene probe weight average molecular weight (MP), polydispersity index \n(PDI) and viscosity radius (Rη).\nProbe MP \/ kDa PDI Rη \/ nm\na\nToluene 0.092 1 -\nPS 0.5 kDa 0.374 1.22 0.4\nPS 1 kDa 0.89 1.12 0.7\nPS 2 kDa 1.92 1.06 1.1\nPS 5 kDa 4.87 1.05 1.8\nPS 10 kDa 9.95 1.03 2.8\nPS 20 kDa 24.3 1.02 4.7\nPS 70 kDa 76 1.03 9.1\nPS 1000 kDa 1044 1.14 42.6\na - Calculated values [41].\nPage 33 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n24\nTable 3. Average bead sizes of the adsorbents used in ISEC.\nParticle Diameter \/ mSample i.d.\nMean Median Mode\nPSDVB3:5TolNap5:2 29 28 30\nPSDVB1:1TolUn9:1 29 30 36\nPSDVB1:1TolUn1:0 34 37 39\nPage 34 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n25\nTable 4. Surface area and pore volume measurements for polymer adsorbents.\nBET DFT\nSurface Area \/ \nm2 g-1\nPore Volume \/ \ncm3 g-1Sample i.d. Surface \nArea \/ \nm2 g-1\nPore \nVolume \/ \ncm3 g-1 2 - 10 \nnm\n10 - 50 \nnm\n2 - 10 \nnm\n10 - 50 \nnm\nPSDVB3:5TolNap5:2 412 0.34 88 4 0.18 0.03\nPSDVB3:5TolUn1:0 478 0.41 101 9 0.21 0.05\nPSDVB1:1TolUn9:1 356 0.47 76 26 0.18 0.19\nAmberlite XAD4 830 1.1 222 51 0.5 0.36\nPage 35 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n26\nTable 5. Lysozyme (LYZ) and Albumin (HSA) total adsorption capacity q* and  values for \nadsorbent materials.\nSample i.d. LYZ HSA\nq* \/ \nmg g-1\na \/ \nmg m-2\nArea \naccessible \/ \nm2 g-1\nq* \/ \nmg g-1\nb \/ \nmg m-2\nArea \naccessible \n\/ m2 g-1\nPSDVB3:5TolNap5:2 59  7 2.7 22 2.2  1 2.4 0.9\nXAD4 330  60 2.8 120 95  5 2.4 40\na approximate footprint of lysozyme, 9 nm2; b approximate footprint of albumin, 49 nm2\nPage 36 of 36\nAc\nce\npte\nd M\nan\nus\ncri\npt\n27\nTable 6. Summary of experimental variables used for measuring LYZ and HSA batch \nadsorption dynamics\nTN_5:2 TN_5:2 XAD4 XAD4\nSolute LYZ HSA LYZ HSA\nParticle size, d3,2 x 10\n6 (m) 28 197 576 163\nMass of sorbent, (g) 2.5 22 5 0.5\nCo, (mg\/l) 402 204 5361 200\nCf, (mg\/l) 107 106 2058 105\nSaturation uptake, q* (g\/g) 0.059 0.0022 0.330 0.095\nStirrer speed, rpm (min-1) 726 726 726 726\nPorosity,  (-) 0.29 0.29 0.55 0.55\nSolid density,  (kg\/m3) 1040 1040 1120 1120\nIntraparticle Diffusivity, De x 10\n12\n(m2\/s)\n0.4 40 4 50\n Diffusivity in solution (1x10-10, m2\/s);  Diffusivity in solution (6.1x10-11, m2\/s)\n"}