{"doi":"10.1137\/S003613990038116X","coreId":"97021","oai":"oai:generic.eprints.org:607\/core69","identifiers":["oai:generic.eprints.org:607\/core69","10.1137\/S003613990038116X"],"title":"Exponential asymptotics and capillary waves","authors":["Chapman, S. J.","Vanden-Broeck, J."],"enrichments":{"references":[{"id":835977,"title":"A note on the free surface induced by a submerged source at infinite Froude number,","authors":[],"date":"1988","doi":"10.1017\/S0334270000006123","raw":null,"cites":null},{"id":834804,"title":"An exact solution for progressive capillary waves of arbitrary amplitude,","authors":[],"date":"1957","doi":null,"raw":null,"cites":null},{"id":835009,"title":"Analytic theory of the Saffman-Taylor fingers,","authors":[],"date":"1988","doi":null,"raw":null,"cites":null},{"id":835253,"title":"Asymptotic Expansions: Their Derivation and Interpretation,","authors":[],"date":"1973","doi":null,"raw":null,"cites":null},{"id":836461,"title":"Asymptotics beyond all orders in a model of crystal growth,","authors":[],"date":"1991","doi":"10.1016\/0167-2789(87)90156-4","raw":null,"cites":null},{"id":835724,"title":"Computation of transcendental effects in growth problems: Linear solvability conditions and nonlinear methods, in Asymptotics Beyond All Orders,","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":836228,"title":"Exact large amplitude capillary waves on sheets of fluid,","authors":[],"date":"1976","doi":"10.1017\/S0022112076002085","raw":null,"cites":null},{"id":834261,"title":"Exponential asymptotics and Stokes lines in nonlinear ordinary differential equations,","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":834509,"title":"On Borel summation and Stokes phenomena for rank-1 nonlinear systems of ordinary differential equations,","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":833320,"title":"On short-scale oscillatory tails of long-wave disturbances,","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":833817,"title":"On the existence of homoclinic and heteroclinic orbits for differential equations with a small parameter,","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":834040,"title":"On the roˆle of Stokes lines in the selection of Saffman-Taylor fingers with small surface tension,","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":836970,"title":"Ploughing flows,","authors":[],"date":"1998","doi":"10.1017\/S0956792598003519","raw":null,"cites":null},{"id":836746,"title":"Stokes phenomenon and matched asymptotic expansions,","authors":[],"date":"1995","doi":"10.1137\/S0036139994261769","raw":null,"cites":null},{"id":837216,"title":"Structural stability of the Korteweg-de Vries solitons under a singular perturbation,","authors":[],"date":"1988","doi":"10.1016\/0167-2789(88)90018-8","raw":null,"cites":null},{"id":833572,"title":"Uniform asymptotic smoothing of Stokes’s discontinuities,","authors":[],"date":"1989","doi":null,"raw":null,"cites":null},{"id":835522,"title":"Weakly nonlocal solitary waves in a singularly perturbed Korteweg–de Vries equation,","authors":[],"date":"1995","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-07-03","abstract":"Recently developed techniques in exponential asymptotics beyond all orders are employed on the problem of potential flows with a free surface and small surface tension, in the absence of gravity. Exponentially small capillary waves are found to be generated on the free surface where the equipotentials from singularities in the flow (for example, stagnation points and corners) meet it. The amplitude of these waves is determined, and the implications are considered for many quite general flows. The asymptotic results are compared to numerical simulations of the full problem for flow over a polygonal plough and for flow round a right-angled corner, and they show remarkably good agreement, even for quite large values of the surface tension parameter","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/97021.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/607\/1\/acroread.pdf","pdfHashValue":"eb1a125e7412f3c76790acefd835291e6d1c5348","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:607<\/identifier><datestamp>\n      2015-05-29T18:25:20Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4F5A:4D3335<\/setSpec><setSpec>\n      7375626A656374733D4447:4D3736<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/607\/<\/dc:relation><dc:title>\n        Exponential asymptotics and capillary waves<\/dc:title><dc:creator>\n        Chapman, S. J.<\/dc:creator><dc:creator>\n        Vanden-Broeck, J.<\/dc:creator><dc:subject>\n        Partial differential equations<\/dc:subject><dc:subject>\n        Fluid mechanics<\/dc:subject><dc:description>\n        Recently developed techniques in exponential asymptotics beyond all orders are employed on the problem of potential flows with a free surface and small surface tension, in the absence of gravity. Exponentially small capillary waves are found to be generated on the free surface where the equipotentials from singularities in the flow (for example, stagnation points and corners) meet it. The amplitude of these waves is determined, and the implications are considered for many quite general flows. The asymptotic results are compared to numerical simulations of the full problem for flow over a polygonal plough and for flow round a right-angled corner, and they show remarkably good agreement, even for quite large values of the surface tension parameter.<\/dc:description><dc:date>\n        2002-07-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/607\/1\/acroread.pdf<\/dc:identifier><dc:identifier>\n          Chapman, S. J. and Vanden-Broeck, J.  (2002) Exponential asymptotics and capillary waves.  SIAM Journal on Applied Mathematics, 62  (6).   pp. 1872-1898.  ISSN 1095-712X     <\/dc:identifier><dc:relation>\n        http:\/\/www.siam.org\/journals\/siap\/62-6\/38116.html<\/dc:relation><dc:relation>\n        10.1137\/S003613990038116X<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/607\/","http:\/\/www.siam.org\/journals\/siap\/62-6\/38116.html","10.1137\/S003613990038116X"],"year":2002,"topics":["Partial differential equations","Fluid mechanics"],"subject":["Article","PeerReviewed"],"fullText":"EXPONENTIAL ASYMPTOTICS AND CAPILLARY WAVES∗\nS. J. CHAPMAN† AND J.-M. VANDEN-BROECK‡\nSIAM J. APPL. MATH. c© 2002 Society for Industrial and Applied Mathematics\nVol. 62, No. 6, pp. 1872–1898\nAbstract. Recently developed techniques in exponential asymptotics beyond all orders are\nemployed on the problem of potential flows with a free surface and small surface tension, in the\nabsence of gravity. Exponentially small capillary waves are found to be generated on the free surface\nwhere the equipotentials from singularities in the flow (for example, stagnation points and corners)\nmeet it. The amplitude of these waves is determined, and the implications are considered for many\nquite general flows. The asymptotic results are compared to numerical simulations of the full problem\nfor flow over a polygonal plough and for flow round a right-angled corner, and they show remarkably\ngood agreement, even for quite large values of the surface tension parameter.\nKey words. exponentially small, Stokes lines, optimal truncation, divergent expansions, singu-\nlar perturbation, surface tension\nAMS subject classifications. 76B07, 76B45, 41A60, 35B25\nPII. S003613990038116X\n1. Introduction. We consider the problem of potential flows with a free surface,\nin the absence of gravity, but with small surface tension. Examples of such flows\n(which we will consider in section 6) include ploughing flows, flow over a submerged\nbody, flow around a corner, gliding or planing flows, and impinging jets. However, for\nmuch of the paper the precise geometry of the flow is unimportant and may be left\nunspecified.\nWe will be concerned with the limit in which the surface tension parameter tends\nto zero. In this limit the problem is a singular perturbation problem, and therefore we\nwould expect the formal asymptotic series developed in powers of the surface tension\nparameter to be divergent. This divergence is associated with the presence of an\nexponentially small correction to the algebraic expansion, which appears “beyond all\norders” [9].\nKruskal and Segur [14] observed that in nonlinear ordinary differential equations\nthe divergence is associated with a singularity in the analytic continuation of the\nleading-order solution, near which the formal asymptotic series breaks down. They\nformulate an inner problem in the vicinity of the singularity and find that its solution\ncontains a decaying exponential in the far field, in addition to the terms which match\nwith the algebraic series. This exponential is matched to a solution of the linearized\nequation away from the singularity to obtain the exponentially small, beyond all\norders correction. Kruskal and Segur solve the inner problem numerically (observing\nthe exponential along a ray on which the algebraic terms vanished), but other authors\nhave since observed that the far field of the inner solution can be Borel-summed to\nobtain the exponential to be matched to the outer solution (see, for example, [8, 11]).\nA similar method is formulated in [5, 4], where the algebraic asymptotic expan-\nsion (away from the singularity) is optimally truncated (that is, truncated at its least\nterm), which results in an exponentially small error between the truncated series and\n∗Received by the editors November 10, 2000; accepted for publication (in revised form) January\n24, 2002; published electronically July 3, 2002.\nhttp:\/\/www.siam.org\/journals\/siap\/62-6\/38116.html\n†Mathematical Institute, Center for Industrial and Applied Mathematics, Oxford University, 24-\n29 St. Giles’, Oxford OX1 3LB, United Kingdom (chapman@maths.ox.ac.uk).\n‡School of Mathematics, University of East Anglia, Norwich, England NR4 7TJ, United Kingdom\n(J.Vanden-broeck@uea.ac.uk).\n1872\nEXPONENTIAL ASYMPTOTICS AND CAPILLARY WAVES 1873\nthe exact solution. This allows the exponentially small corrections to be observed\nswitching on across Stokes lines by smoothing the Stokes discontinuity, and is a gen-\neralization of the smoothing of Stokes discontinuities in linear ordinary differential\nequations discovered by Berry [2]. We also note that a general framework for deter-\nmining exponentially small terms in rank-1 ordinary differential equations has been\nrecently given by Costin [6].\nThe exponentially small correction terms which appear in the present problem\ncorrespond to capillary waves on the free surface of exponentially small amplitude.\nWe will find that we are able to determine quite simply the region of the free surface\nthey occupy, as well as their magnitude, even for very general flow geometries. We\nnote that exponentially small gravity-capillary waves have been studied in the context\nof the Korteweg–de Vries equation in [1, 3, 10, 17].\nThe rest of the paper is organized as follows. In section 2 we formulate the problem\nmathematically. In section 3 and section 4 we apply the procedure developed in [5].\nIn section 3 we naively expand the solution as a formal power series in the surface\ntension parameter and find the form of the late terms in this series. This enables us, in\nsection 4, to truncate the algebraic series optimally and to observe the subdominant\nexponentials being switched on across Stokes lines. In section 5 we compare the results\nof section 4 with a direct numerical simulation of the full problem for two particular\nflows, namely, flow over a polygonal plough and flow round a right-angled corner. We\nwill find that there is remarkable agreement between the asymptotic and numerical\nresults, even for quite large values of the surface tension parameter. The flow past\na polygonal plough was considered before by Tuck and Vanden-Broeck [16] in the\nabsence of surface tension but with the effect of gravity included.\nIn section 6 we consider the implications of the results of section 4 for many other\nexamples of potential flows with a free surface. Finally, in section 7, we present out\nconclusions.\n2. Formulation of the problem. In the fluid region, we have steady, incom-\npressible, irrotational, inviscid flow, so that the fluid velocity u = (u, v) = ∇φ, where\nthe velocity potential φ satisfies\n∇2φ = 0.\nOn all boundaries we have the kinematic condition\n∂φ\n∂n\n= 0,(2.1)\nwhile on the free boundary we also have the dynamic condition, which from Bernoulli’s\nequation is\n1\n2\n|∇φ|2 − 1\n2\n= −\bκ,(2.2)\nwhere the skin speed of the unperturbed free boundary has been normalized to unity,\n\b is the surface tension parameter, and κ is the curvature, positive if the center\nof curvature lies in the fluid region. As usual we define the complex potential by\nw = φ + iψ, where ψ is the streamfunction (with ψ chosen to be zero on the free\nboundary), and we let z = x+ iy. Since w is then an analytic function of z the map\nz → w is a conformal transformation of the flow region to a region of the potential\nplane. A second transformation w → ζ is often used to map this region to the upper\nhalf ζ-plane.\n1874 S. J. CHAPMAN AND J.-M. VANDEN-BROECK\nIt is convenient to work in terms of the complex velocity dw\/dz = u− iv, which\nmay be written as qe−iθ, where θ is the angle the streamlines make with the x-axis.\nThe analyticity of qe−iθ in the upper half ζ-plane implies\nlog q = − 1\nπ\n−\n∫ ∞\n−∞\nθ(ξ′) dξ′\nξ′ − ξ ,(2.3)\nwhere ζ = ξ + iη, while (2.1) implies that on the free boundary θ is the angle the\ntangent makes with the x-axis (i.e., the free boundary is a streamline). Then (2.2) is\nq2 − 1 = −2\bdθ\nds\n(2.4)\non the free boundary, where s is arclength, increasing in the flow direction, and we\nhave assumed that the fluid region lies to the left of the free boundary as s increases.\nNote that this implies that in the flow region ψ > 0, i.e., that the upper half ζ-plane\ncorresponds to a region in the upper half w-plane. Noting that\ndθ\nds\n=\ndθ\ndφ\n∂φ\n∂s\n= q\ndθ\ndφ\nin the potential plane (with q positive on the free boundary), this is\nq2 − 1 = −2\bq dθ\ndφ\n.(2.5)\nWe will see in the next section that Stokes lines originate at singularities in the analytic\ncontinuation of θ and q satisfying (2.3) and (2.5), that is, on the analytic continuation\nof the free boundary. Thus we will consider (2.3) and (2.5) for complex ξ and φ and\ncomplex q and θ. Since we are dealing with analytic complex variables z, ζ, and\nw anyway, this can lead to some confusion, but this also means that the analytic\ncontinuation is much simpler than in problems with other field equations. Since φ is\nalready the real part of the analytic variable w, ξ the real part of the analytic variable\nζ, the complexified φ can be identified with w and the complexified ξ can be identified\nwith ζ. The difference between the complexified free boundary and the flow region is\nthat on the complexified free boundary q and θ are not real, even though qe−iθ is still\nequal to dw\/dz.\nAnalytically continuing (2.3) into the upper half ξ-plane gives\nlog q − iθ = − 1\nπ\n∫ ∞\n−∞\nθ(ζ ′) dζ ′\nζ ′ − ζ ,(2.6)\nwhere we have replaced ξ by ζ to emphasize that it is now complex. Similarly, we will\nwrite (2.5) for complex φ by replacing φ by w so that\nq2 − 1 = −2\bq dθ\ndw\n.(2.7)\nNote that the right-hand side of (2.6) may alternatively be written\n− 1\nπ\n∫ ∞\n−∞\nθ(ζ ′) dζ ′\nζ ′ − ζ = −\ni\nπ\n∫ ∞\n−∞\nlog q(ζ ′) dζ ′\nζ ′ − ζ =\n1\n2πi\n∫ ∞\n−∞\nlog q(ζ ′)− iθ(ζ ′)\nζ ′ − ζ dζ\n′,\nEXPONENTIAL ASYMPTOTICS AND CAPILLARY WAVES 1875\nsince ∫ ∞\n−∞\nlog q(ζ ′) + iθ(ζ ′)\nζ ′ − ζ dζ\n′ = 0\nbecause\nlog q(ζ ′)− iθ(ζ ′)\nζ ′ − ζ¯\nis analytic in the upper half plane. However, we will use the form (2.6) for the\nremainder of the paper.\nFinally we note that in some of our examples the fluid lies on the right of the free\nboundary for increasing s. In this case (2.7) becomes\nq2 − 1 = 2\bq dθ\ndw\n(2.8)\nand ψ < 0 in the flow; i.e., the upper half ζ-plane corresponds to a region in the\nlower half w-plane. This corresponds simply to letting w → −w, so that the results\nwe obtain are easily translated to this case.\n3. Asymptotic expansion for small surface tension. We will solve (2.6),\n(2.7) asymptotically as \b→ 0. The first step in applying the procedure developed in\n[5] is to determine the algebraic expansion in powers of \b, and in particular the form\nof the late terms in this expansion, so that we can truncate it optimally.\n3.1. Late terms in the regular asymptotic expansion. The first step is to\nnaively expand in powers of \b as\nθ =\n∞∑\nn=0\n\bnθn, q =\n∞∑\nn=0\n\bnqn.(3.1)\nThen\nq0 = 1,(3.2)\n0 = − 1\nπ\n−\n∫ ∞\n−∞\nθ0(ξ\n′) dξ′\nξ′ − ξ ,(3.3)\nq1 = −dθ0\ndw\n,(3.4)\nq1\nq0\n− iθ1 = − 1\nπ\n∫ ∞\n−∞\nθ1(ζ\n′) dζ ′\nζ ′ − ζ ,(3.5)\nq0q2 +\nq21\n2\n= −q0 dθ1\ndw\n− q1 dθ0\ndw\n,(3.6)\nq0qn + q1qn−1 + · · · = −q0 dθn−1\ndw\n− q1 dθn−2\ndw\n− · · · − qn−1 dθ0\ndw\n, n ≥ 3.(3.7)\nqn\nq0\n− qn−1q1\nq20\n+ · · · − iθn = − 1\nπ\n∫ ∞\n−∞\nθn(ζ\n′) dζ ′\nζ ′ − ζ , n ≥ 2.(3.8)\nNote that the solution of (3.3) is not just θ0 = 0. In mapping the fluid region to the\nupper half plane the free surface will be mapped to a section of the real axis but not\n1876 S. J. CHAPMAN AND J.-M. VANDEN-BROECK\nto the whole real axis. Fixed boundaries will also be mapped to the real axis, and\non these boundaries θ0 is known and has logarithmic singularities. (The existence\nof logarithmic singularities allows the existence of a nonzero solution to (3.3) while\nnot invalidating (2.3).) Thus when the geometry is specified (3.3) will state that an\nintegral of θ0 over part of the real line is equal to a known right-hand side. See, for\nexample, (5.6).\nIn order to truncate the series (3.1) optimally we need to know the behavior of\nthe late terms in the expansion; i.e., we need to solve (3.7) and (3.8) as n→∞. The\nomitted terms in (3.7), (3.8) can readily be calculated (they arise from expanding the\nlog in (2.6) and the products in (2.7)), but we will see that they are all of lower order\nin n for large n.\nNow, in the leading-order problem θ0 may have singularities as a function of w\n(through the conformal map ζ). However, all higher-order problems are linear and\ncan therefore introduce no new singularities in θ. Thus the singular points of θn(w)\nmust be the same as those of θ0(w) for all n. The singular perturbation in (2.7) means\nthat to determine each successive term in the expansion we differentiate the previous\nterm. Thus, if θn has a singularity of the form 1\/(w − w0)n, then θn+1 will have a\nsingularity of the form n\/(w − w0)n+1. Thus as n → ∞ we expect the asymptotic\nexpansions (3.1) to exhibit factorial\/power divergence, so that we make the ansatz\nθn ∼ ΘΓ(n+ γ)\nχn+γ\n, qn ∼ QΓ(n+ γ)\nχn+γ\nas n→∞,(3.9)\nwhere χ, γ, Θ, and Q are functions of w but are independent of n. We will find\nthat the terms on the left-hand side of (3.8) exponentially dominate those on the\nright-hand side as n→∞, so that\nqn ∼ iθn + qn−1q1 + · · · as n→∞.(3.10)\nThen at leading order in (3.7) using (3.10) and the ansatz (3.9) we have\ndχ\ndw\n= i,\nso that\nχ = iw + constant.\nSince the singularities of θn are the same as those of θ0 we know that χ must vanish\nat one of these singularities. In general the late terms will be a sum of terms such\nas (3.9), one centered on each singularity of θ0. On the free boundary (i.e., for real\nw) this sum is dominated by those singularities closest to the real axis (i.e., with the\nsmallest value of ψ). Denote by w0 the closest singularity to the real axis in the upper\nhalf w-plane (since we are in the upper half ζ-plane). Then\nχ = i(w − w0).(3.11)\nAt order logn\/n in (3.7) we find dγ\/dw = 0, so that γ is in fact a constant. At order\n1\/n we find\niΘq1 + iΘq1 = −dΘ\ndw\n+ q1Θχ\n′ − iΘdθ0\ndw\n,\nEXPONENTIAL ASYMPTOTICS AND CAPILLARY WAVES 1877\ni.e.,\ndΘ\ndw\n= −iΘ\n(\nq1 +\ndθ0\ndw\n)\n= 0,\nby (3.4). Hence Θ = constant = Λ, say.\nIn summary we have\nθn ∼ ΛΓ(n+ γ)\n(i(w − w0))n+γ , qn ∼\niΛΓ(n+ γ)\n(i(w − w0))n+γ as n→∞.(3.12)\nTo determine γ we need to examine the order of the singularity in θ0 as w → w0,\nwhich we will do in section 3.2. To determine Λ we must match with an inner region\nin the vicinity of w0, which we will do in section 3.3.\n3.2. Inner limit of θ0. To determine γ we need to examine the order of the\nsingularity in θ0 as w → w0. This will depend on the type of singularity in the flow\nfield. Typical singularities include stagnation points, sources, sinks, and flow around\nthe corner of an obstacle.\nFor stagnation points and flow around corners, locally in the vicinity of the sin-\ngularity we have w − w0 = const.× (z − z0)k for some k \n= 1. For a stagnation point\ngenerically k = 2, while for flow around a corner k = π\/β, where β is the interior\n(i.e., in the fluid) angle of the corner. Then, for the corresponding singularity on the\nanalytic continuation of the free boundary\ndw\ndz\n= q0e\n−iθ0 = e−iθ0 = const.× (z − z0)k−1 = const.× (w − w0)(k−1)\/k,\nremembering that q0 = 1 on the free boundary. Hence\nθ0 ∼ i (k − 1)\nk\nlog(w − w0),(3.13)\nas w → w0. For (3.13) to be compatible with (3.12) we must have γ = 0, giving\nθn ∼ ΛΓ(n)\n(i(w − w0))n , qn ∼\niΛΓ(n)\n(i(w − w0))n as n→∞.(3.14)\nFor sources and sinks w − w0 = const.× log(z − z0). In that case\ndw\ndz\n= q0e\n−iθ0 = e−iθ0 = const.× (z − z0)−1 = const.× e−(w−w0).\nHence\nθ0 ∼ −i(w − w0)(3.15)\nas w → w0, and in this case there is no singularity in θ0 and no associated Stokes\nlines.\n3.3. Inner expansion in the vicinity of the complex singularity. Now in\nthe vicinity of the singularity in the complex plane log q− iθ is equal to the (regular)\nexpansion of the right-hand side of (2.6), which is evaluated on the real axis, and\ntherefore involves the outer expansion of q and θ away from the singularity. But we\nknow that inserting the expansions for q and θ into the right-hand side simply gives\n1878 S. J. CHAPMAN AND J.-M. VANDEN-BROECK\nthe outer expansion of log q − iθ. The right-hand side of this equation in the inner\nregion is therefore simply the inner limit of log q − iθ. Hence, since q0 = 1 and\nθ0 ∼ iα log(w − w0) + constant + · · ·\nin the vicinity of w0, where α = (k − 1)\/k, we have\nlog q − iθ ∼ α log(w − w0) + constant + · · · ,(3.16)\n−2\bq dθ\ndw\n= q2 − 1.(3.17)\nWe define the inner variable η by w = w0 − \biη. Then, differentiating (3.16) gives, at\nleading order in the inner region\nq′\nq\n− iθ′ = α\nη\n,\nwhere ′ represents d\/dη. Substituting into (3.17) gives\nq′ +\n1\n2\n(q2 − 1)− αq\nη\n= 0.(3.18)\nTo determine Λ we need to match the inner limit of (3.14) with the outer limit of\n(3.18). To this end we expand q as η →∞ as\nq =\n∞∑\nn=0\nAn\nηn\n,(3.19)\ngiving\n−(n− 1)An−1 − αAn−1 + 1\n2\nn∑\nm=0\nAmAn−m = 0,\nwith A0 = 1. Then\nAn = (n− 1)An−1 + αAn−1 − 1\n2\nn−1∑\nm=1\nAn−mAm, n ≥ 1.\nWriting the outer expansion (3.14) in terms of the inner variable η gives\n\bnqn ∼ iΛΓ(n)\nηn\nas n→∞.(3.20)\nMatching (3.19) and (3.20) gives\nΛ = −i lim\nn→∞\nAn\nΓ(n)\n.\n3.4. Exact solution of the inner problem. In fact, since (3.18) is a Riccati\nequation we can solve it exactly and determine Λ analytically. We set\nf = exp\n(\n1\n2\n∫\nq dη\n)\n, q =\n2f ′\nf\nEXPONENTIAL ASYMPTOTICS AND CAPILLARY WAVES 1879\nto give\nf ′′ − αf\n′\nη\n− f\n4\n= 0.(3.21)\nSince we require q → 1 as η → +∞, the solution is\nf = ηνIν(η\/2),(3.22)\nwhere Iν is the modified Bessel function, and ν = 1\/2 + α\/2. Hence\nq =\nIν−1(η\/2)\nIν(η\/2)\n.(3.23)\nNow,\nIν(z) ∼ e\nz\n√\n2πz\n∞∑\nm=0\n(−1)mΓ(m+ ν + 1\/2)\n(2z)mΓ(m+ 1)Γ(ν −m+ 1\/2) =\nez√\n2πz\n∞∑\nm=0\nam(ν)Γ(m)\n(2z)m\n,\nsay. Then the late terms in q satisfy\nAn ∼ (a∞(ν − 1)− a∞(ν)) Γ(n) as n→∞,\nwhere a∞ = limm→∞ am. Using the reflection formula\nΓ(−m+ ν + 1\/2) = − πcosec(π(m− ν − 1\/2))\n(m− ν − 1\/2)Γ(m− ν − 1\/2)\nand Stirling’s formula we find that\na∞(ν) =\ncosπν\nπ\n,\nso that\nAn ∼ −2 cosπν\nπ\nΓ(n) =\n2 sin(πα\/2)\nπ\nΓ(n).\nHence\nΛ = −2i sin(πα\/2)\nπ\n.(3.24)\nThis completes the determination of the late terms in the asymptotic expansion of q\nand θ. The next step is to optimally truncate the expansion and examine the switching\non of exponentially small terms across Stokes lines.\n4. Stokes line smoothing. We keep the analysis here brief since it is similar\nto that in [5]. We begin by truncating the expansion after N terms, so that\nθ =\nN−1∑\nn=0\n\bnθn +RN , q =\nN−1∑\nn=0\n\bnqn + SN .\nThen the argument leading to (3.10) implies SN ∼ iRN , which in (2.7) gives\niRN + \b\ndRN\ndw\n+ · · · ∼ i\bNθN + · · ·(4.1)\n1880 S. J. CHAPMAN AND J.-M. VANDEN-BROECK\nas N →∞ and \b→ 0. The homogeneous version of this equation has a solution\nRN ∼ e−iw\/\f,(4.2)\ncorresponding to capillary waves on the free surface. Following Dingle [9] we expect\nthere to be Stokes lines whenever successive terms in the expansion of θ have the same\nphase, i.e., when χ is real and positive, so that w − w0 is negative imaginary. Hence\nthere will be Stokes lines down parallel to the imaginary axis from the singularities\nin the upper half w-plane. We will show that a multiple of (4.2) is switched on across\nthese Stokes lines. We define the Stokes multiplier A by setting\nRN = Ae\n−iw\/\f,\ngiving\n\be−iw\/\f\ndA\ndw\n∼ i\bNθN ∼ i\b\nNΛΓ(N)\n(i(w − w0))N .(4.3)\nNow the right-hand side of (4.3) is minimal for N ∼ |w − w0|\/\b. Hence we let\nN = |w − w0|\/\b+ ρ, where ρ is bounded as \b → 0. Then, since N is a function of\n|w − w0| only, following [5, 15] we write w − w0 = −ireiϑ and write\nd\ndw\n=\ne−iϑ\nr\nd\ndϑ\n.\nThen, as \b→ 0,\n\be−re\niϑ\/\f e\n−iϑ\nr\ndA\ndϑ\n∼ i\b\nNΛ\n√\n2πe−NNN−1\/2\nrNeiNϑ\n=\ni\b(r\/\f+ρ)Λ\n√\n2πe−(r\/\f+ρ)(r\/\b+ ρ)(r\/\f+ρ−1\/2)\nr(r\/\f+ρ)eiϑ(r\/\f+ρ)\n∼ i\n√\n2πΛ\b1\/2e−r\/\f\nr1\/2eiϑ(r\/\f+ρ)\n.\nHence\ndA\ndϑ\n∼ i\n√\n2πΛr1\/2eiϑe−r\/\fere\niϑ\/\f\n\b1\/2eiϑ(r\/\f+ρ)\n.\nNow, the right-hand side is exponentially small except near the Stokes line ϑ = 0.\nThus there is a rapid variation in A at this point, corresponding to the switching on\nof our subdominant exponential. To examine this transition we introduce the local\nscaling ϑ = δϑ¯, giving\ndA\ndϑ¯\n∼ iδ\n√\n2πΛr1\/2e−rδ\n2ϑ¯2\/(2\f)\n\b1\/2\n.\nWe see that the correct scaling is δ = \b1\/2, giving\ndA\ndϑ¯\n∼ i\n√\n2πΛr1\/2e−rϑ¯\n2\/2.\nHence\nA = a+ i\n√\n2πΛ\n∫ ϑ¯√r\n−∞\ne−t\n2\/2 dt,\nEXPONENTIAL ASYMPTOTICS AND CAPILLARY WAVES 1881\nand we have the usual error function smoothing of the Stokes discontinuity [2]. Match-\ning with the outer solution away from the Stokes line we find there is a jump in A\ngiven by\nA(ϑ = 0−)−A(ϑ = 0+) = 2πiΛ.(4.4)\nIn summary, there are Stokes lines down parallel to the imaginary axis from\nsingularities in the upper half w-plane across which\n2πiΛexp\n(\n− i(w − w0)\n\b\n)\n(4.5)\nis switched on. Throughout we have been working in the upper half ζ-plane, corre-\nsponding to the upper half w-plane. If we were to instead analytically continue into\nthe lower half ζ-plane, we would find that there are Stokes lines up parallel to the\nimaginary axis from singularities in the lower half w-plane. Since the singularities off\nthe real axis appear in complex conjugate pairs, and since we know that the solu-\ntion on the real axis must be real, we find that where the Stokes lines meet the free\nboundary (4.5) plus its complex conjugate must be turned on.\nCombining this with our expression (3.24) for Λ we find that if w0 = φ0 + iψ0,\nthen the capillary waves turned on across the Stokes line are given by\nRN ∼ 8 sin\n(πα\n2\n)\ne−ψ0\/\f cos\n(\n(φ− φ0)\n\b\n)\n.\nThis expression gives the oscillations in θ, the angle the tangent to the free surface\nmakes with the x-axis. If we are interested instead in the height of the waves, then\nwe need to integrate with respect to φ to give\n8\b sin\n(πα\n2\n)\ne−ψ0\/\f sin\n(\n(φ− φ0)\n\b\n)\n.\nThus the amplitude of the capillary waves generated is\n8\b sin(πα\/2)e−ψ0\/\f.(4.6)\nBefore we go on to consider some specific examples of flows, we make some general\ncomments about the results so far and formula (4.6). First, we note that the strength\nof the exponential factor in the amplitude is determined by the difference in the value\nof the streamfunction on the free boundary and at the singularity (since we have set\nψ = 0 on the free boundary), which is the flux of fluid between the two streamlines.\nThe nearer the submerged singularities are to the free boundary the stronger the\ncapillary waves will be. If there are two singularities with different values of ψ, the\nwaves generated by the closer one will exponentially dominate those generated by the\nfarther one.\nSecond, we note that the Stokes lines, given by i(w − w0) real and positive,\ncorrespond to constant real part of w−w0; i.e., the Stokes line meets the free boundary\nat the point where the equipotential from the singularity in the flow meets the free\nboundary.\nThus we are able to say a lot about the capillary waves on the free surface even\nwhen we know very little about the unperturbed flow. In the next section we consider\na specific flow and compare our asymptotic results to a direct numerical simulation\nof the full problem. Then, in section 6, we consider some more general examples of\npotential flows.\n1882 S. J. CHAPMAN AND J.-M. VANDEN-BROECK\nB\nC\nA A′\nB′\nD′\nD\nE\nE ′\n(a)\nC\nA\nD′D E E\n′\nB B′\nA′\n(b)\nC AB D′ DB′\nξ\nA′\nb\nη\na1\n(c)\nFig. 1. (a) A schematic diagram of a polygonal ploughing flow. (b) The complex potential\nplane. The stagnation point C is a square-root branch point for z(w). There are also singularities\nin θ0 at the corners A and B. There are Stokes lines (dashed) meeting the free boundary originating\nat A and C. (c) The ζ-plane.\n5. A polygonal ploughing flow. We consider in detail the case of the plough-\ning flow shown in Figure 1; in particular, we will compare the asymptotic results with\na direct numerical simulation of the full problem. The asymptotic and numerical\nresults are presented in sections 5.1 and 5.2, respectively.\n5.1. Asymptotic results. For the flow shown in Figure 1(a), the fluid region\ncorresponds to a region in the lower half w-plane, shown in Figure 1(b). Let us\nnormalize lengths so that the height of the fluid above the plough at s = +∞ is π.\nEXPONENTIAL ASYMPTOTICS AND CAPILLARY WAVES 1883\nThen the map from the w-plane into the upper half ζ-plane is given by\nw = −ζ − log ζ.(5.1)\nThe free boundary is mapped to 0 < ζ <∞, the stagnation point to ζ = −1, and the\ncorners of the step to ζ = −a and ζ = −b, respectively, with 0 < a < 1 < b. As we\nmentioned in section 2, the analyticity of log q − iθ in the upper half ζ-plane implies\nthat for ζ real\nlog q = − 1\nπ\n−\n∫ ∞\n−∞\nθ(ζ ′) dζ ′\nζ ′ − ζ .(5.2)\nNow, since the position of the fixed boundary is known, we have\nθ =\n\n\n0 −∞ < ζ < −b,\n−π2 −b < ζ < −1,\nπ\n2 −1 < ζ < −a,\n0 −a < ζ < 0.\nThen, since\ndw\ndζ\n=\n1 + ζ\nζ\n,\nour system is\nq2 − 1 = −2\bq ζ\n1 + ζ\ndθ\ndζ\n,(5.3)\nlog q =\n1\n2\nlog\n(\n(1 + ζ)2\n(a+ ζ)(b+ ζ)\n)\n− 1\nπ\n−\n∫ ∞\n0\nθ(ζ ′) dζ ′\nζ ′ − ζ .(5.4)\nOne relationship between the two free parameters a and b is determined by the con-\ndition that the free boundary is asymptotically flat far upstream. The remaining\nfree parameter is determined by the height of the plough. We will take a as the free\nparameter giving ploughs of different heights and determine b from the condition of\na flat upstream free surface.\nThen the leading-order solution satisfies\nq0 = 1,(5.5)\n0 =\n1\n2\nlog\n(\n(1 + ζ)2\n(a+ ζ)(b0 + ζ)\n)\n− 1\nπ\n−\n∫ ∞\n0\nθ0(ζ\n′) dζ ′\nζ ′ − ζ ,(5.6)\nwith solution\nθ0 = −2 tan−1(ζ)1\/2 + tan−1(ζ\/a)1\/2 + tan−1(ζ\/b0)1\/2.(5.7)\nTo ensure that the free boundary is asymptotically flat far upstream, we require\na1\/2 + b\n1\/2\n0 = 2,(5.8)\nso that θ0 = O(ζ\n−3\/2) as ζ →∞. The solution (5.7), (5.8) was previously derived in\n[16].\n1884 S. J. CHAPMAN AND J.-M. VANDEN-BROECK\nThe relevant singularities in θ0 from the point of view of capillary waves are the\nstagnation point ζ = −1 and the corner ζ = −a; it is clear from Figure 1 that the\nequipotential from the corner ζ = −b0 does not meet the free boundary. For the\nstagnation point w0 = 1+ iπ, k = 2, α = 1\/2, while for the corner w0 = a− log a+ iπ,\nk = 2\/3, α = −1\/2. Since our analysis gives only the jump in the amplitude of\ncapillary waves on the free surface, to compare with numerical results we impose\nthat there are no capillary waves far upstream and examine the behavior of the free\nsurface far downstream. Then the capillary waves present as s→∞ are given by the\nsuperposition of those generated at each Stokes line, namely,\nθ ∼ −4\n√\n2e−π\/\f cos\n(\n(1− φ)\n\b\n)\n+ 4\n√\n2e−π\/\f cos\n(\n(a− log a− φ)\n\b\n)\n= 4\n√\n2e−π\/\fRe\n((\nei(a−log a)\/\f − ei\/\f\n)\ne−iφ\/\f\n)\n,\nwhich corresponds to\ny ∼ y0 − 4\n√\n2\be−π\/\fIm\n((\nei(a−log a)\/\f − ei\/\f\n)\ne−iφ\/\f\n)\n.\nHence the amplitude of the wave train at infinity is\n4\n√\n2\be−π\/\f\n∣∣∣ei(a−log a)\/\f − ei\/\f\n∣∣∣ .(5.9)\nAs a → 0 the factor |ei(a−log a)\/\f − ei\/\f| vanishes infinitely often, as the waves from\nthe two singularities move in and out of phase. When the two wave trains are out of\nphase, the waves that are turned on at the first Stokes line are effectively turned off\nat the second, and there is a finite section of the free boundary on which capillary\nwaves are present. This cancellation can occur because the amplitude of the waves\ngenerated by the stagnation point and the corner are exactly equal at leading order,\nsince ∣∣∣sin(παcorner\n2\n)∣∣∣ =\n∣∣∣sin(παstagnation\n2\n)∣∣∣ .\nAlthough such a situation would seem to be very special, we will see in section 6 that\nthere are many examples of potential flows where two singularities generate waves of\nexactly the same amplitude, and we have the possibility of a finite section of the free\nboundary containing capillary waves.\nThe limit a→ 0 is a singular one since the stagnation point disappears to infinity\nbut the capillary waves it generates are still felt, and the difference in φ at the stagna-\ntion point and the corner determines the phase difference of the two trains of waves.\nThe case a = 0 corresponds to flow around a corner, shown in Figure 2. In this case\nthere is no stagnation point and only one set of waves present, with amplitude\n4\n√\n2\be−π\/\f.(5.10)\nIn the next section we describe our numerical scheme and compare these asymptotic\nresults to a direct numerical simulation of the full problem.\n5.2. Numerical results. Following Tuck and Vanden-Broeck [16], we introduce\nthe equally spaced mesh points in φ,\nφI = X− +\n(\nI − 1\nN − 1\n)\n(X+ −X−), I = 1, . . . , N,(5.11)\nEXPONENTIAL ASYMPTOTICS AND CAPILLARY WAVES 1885\nA\nD\nE ′\nA′\nD′\nA′′\n(a)\nA\nD′D E\n′\nA′A′′\n(b)\nFig. 2. (a) A schematic diagram of flow around a corner. (b) The complex potential plane.\nThe only singularity in θ0 is at the corner A. There is one Stokes line (dashed) meeting the free\nboundary, originating at A.\nand the corresponding unknowns,\nθI = θ[ζ(φI)], I = 1, . . . , N.(5.12)\nFor a given value of φ, ζ(φ) is defined by setting ψ = 0 in (5.1) and solving the\nresulting transcendental equation by Newton’s method.\nWriting τ = log q, we evaluate the values τMI of τ [ζ(φ)] at the midpoints\nφMI =\nφI + φI+1\n2\n, I = 1, . . . , N − 1,(5.13)\nby applying the trapezoidal rule to the integral in (5.4) with a summation over the\npoints φI . The symmetry of the quadrature and of the distribution of mesh points\nenabled us to evaluate the Cauchy principal value as if it were an ordinary integral.\nWe evaluate the values of θ[ζ(φ)] at the midpoints φMI by interpolation formulas\nWe now satisfy (2.5) at the midpoints φMI , I = 1, . . . , N − 1. For given values of \b\nand a, this yields N − 1 nonlinear algebraic equations for the N + 1 unknowns θI\nand b. Two more equations are obtained by imposing θ1 = θ2 = θ3. This forces\nthe free surface to be flat far upstream. This system of N + 1 equations with N + 1\nunknowns is solved by Newton’s method. For \b small, the exact solution for \b = 0 is\nchosen as an initial guess. For larger values of \b a continuation method is used; i.e., a\n1886 S. J. CHAPMAN AND J.-M. VANDEN-BROECK\nconverged solution is used as an initial guess to compute a solution for a larger value\nof \b. Most calculations were performed with N = 1500, X− = −81, and X+ = 54. We\nrepeated some of the calculations with larger values of N , X+, and |X−| and checked\nthat all the results presented are independent of the values of these parameters within\ngraphical accuracy.\nA typical free surface profile is shown in Figure 3. As \b increases, the amplitude of\nthe waves increase and the profiles approach the limiting configuration with a trapped\nbubble at the trough predicted by the exact solutions of Crapper [7] and Kinnersley\n[13].\nIn Figure 4 we show a comparison of the asymptotic and numerical values of the\nlog of the amplitude of the waves at infinity as \b varies for a = 0.26644. In Figure\n5 we show a comparison of the asymptotic and numerical values of the amplitude of\nthe waves at infinity as a varies for \b = 0.4. We see that the asymptotic solution is\nremarkably accurate, even at relatively large values of \b.\nWe found that larger and larger values of N were needed to compute accurate\nsolutions as a was decreased below 0.15, and we are unable to extend the numerical\nresults to the predicted first cancellation between the two asymptotic wave trains.\nHowever, the numerical results do confirm the maximum in the amplitude of the\nwaves predicted by the asymptotic solution.\nFor the limiting case a = 0 corresponding to flow around a corner we derived a\nseparate numerical scheme. The flow configurations in the physical plane and in the\ncomplex potential plane are illustrated in Figure 2. We map the complex potential of\nFigure 2(b) into the lower half of the α+ iβ plane by the transformation\nα+ iβ = e−(φ+iψ).(5.14)\nThe free surface is mapped on the negative α-axis and the corner on the positive\nα-axis.\nWe denote by τ∞ − iθ∞ the free streamline solution corresponding to \b = 0 (i.e.,\nno surface tension). Next we apply the Cauchy integral formula to the function\nτ − τ∞ − i(θ − θ∞)(5.15)\nwith a contour consisting of the α-axis and a semicircle of arbitrary large radius in\nthe lower α+ iβ-plane. This yields\nτ(α) =\n1\nπ\n∫ 0\n−∞\nθ(α¯)− θ∞(α¯)\nα¯− α dα¯.(5.16)\nIn (5.16), we used the properties θ−θ∞ = 0 on the positive α-axis and τ∞ = 0 on the\nfree surface α > 0. The integral in (5.16) is a Cauchy principal value. The numerical\nprocedure then follows the one described at the beginning of this section with (5.4)\nreplaced by (5.16) and ζ(φ) by α(φ) = −e−φ.\nA typical free surface profile is shown in Figure 6. In Figure 7 we show a compar-\nison of the asymptotic and numerical values of the log of the amplitude of the waves\nat infinity as \b varies for a = 0.\n6. Other examples. In this section we consider the implications of our analysis\nfor some general potential flows.\nEXPONENTIAL ASYMPTOTICS AND CAPILLARY WAVES 1887\n0 20 40 60 80 100 120\n−3\n−2\n−1\n0\n1\n(a)\n20 40 60 80 100 120\n0.1\n0.2\n0.3\n0.4\n0.5\n(b)\nFig. 3. (a) The flow region for \t = 0.5, a = 0.5 showing the free surface and the position of the\nplough. (b) A close-up of the free surface showing the wave train generated by the plough.\n1888 S. J. CHAPMAN AND J.-M. VANDEN-BROECK\n0.5 0.75 1.25 1.5 1.75 2 2.25\n1\/\u0003\n−6\n−5\n−4\n−3\n−2\n−1\nlog(amplitude)\nFig. 4. The logarithm of the amplitude of the capillary wave train at infinity as a function of\n1\/\t for a = 0.26644. The solid curve is the asymptotic value (5.9). The points are the results of the\nnumerical simulation.\n0.2 0.4 0.6 0.8 1\na\n0.00025\n0.0005\n0.00075\n0.001\n0.00125\n0.0015\n0.00175\namplitude\nFig. 5. The amplitude of the capillary wave train at infinity as a function of a, the parameter\nin the problem which determines the height of the plough relative to the height of water above it, for\n\t = 0.4. The solid curve is the asymptotic value (5.9). The points are the results of the numerical\nsimulation. The asymptotic result predicts that the amplitude should vanish (to leading order) for\na discrete set of values of a accumulating at zero. The numerical simulation becomes very difficult\nfor small values of a, although we have been able to see the local maximum in the amplitude. The\nnumerical calculation at a = 0 is much easier; since in this case there is only one wave train the\namplitude is half the value of the maximum.\nEXPONENTIAL ASYMPTOTICS AND CAPILLARY WAVES 1889\n0 10 20 30 40\n0\n10\n20\n30\n40\nFig. 6. The free surface for flow around a corner with \t = 2.1.\n2.2 2.4 2.6 2.8 3 3.2 3.4\n1\/\u0003\n−10\n−8\n−7\n−6\nlog(amplitude)\nFig. 7. The logarithm of the amplitude of the capillary wave train at infinity as a function of\n1\/\t for the flow round a corner (a = 0). The solid curve is the asymptotic value (5.10). The points\nare the results of the numerical simulation.\n6.1. Ploughing flows. A general ploughing flow is illustrated in Figure 8. The\nrelevant singularities in θ0 will be the stagnation point on the plough and any corners\nit may have. Since these all lie on the same streamline they have the same value\nof ψ0 and hence the same exponential factor in the amplitude of the capillary waves\ngenerated. To determine where on the free surface the waves begin we simply follow\n1890 S. J. CHAPMAN AND J.-M. VANDEN-BROECK\nD′\nD C\nB′\nA′\nE\n(a)\nA′\nB′\nD′D E\nC\n(b)\nFig. 8. (a) A schematic diagram of a general ploughing flow. (b) The complex potential plane.\nThe stagnation point C is a square-root branch point of z(w). There is only one Stokes line (dashed)\nmeeting the free boundary, which originates at C.\nthe equipotential from each singularity until it meets the free surface. Note that there\nare two such equipotentials from the stagnation point, but only one meets the free\nsurface.\nIf the plough is polygonal, these will be the only singularities in the flow field. For\ngeneral ploughs, though, when we analytically continue the solution into the plough we\nwill encounter further singularities, which will also generate capillary waves. However,\nthese will all have a value of ψ greater than that on the boundary of the plough, and\nwill therefore generate waves which are exponentially subdominant to those generated\nby singularities on the plough itself.\nThe wave train proceeding to infinity will be the superposition of those generated\nat each singularity. If the plough is analytic, the only relevant singularity is the\nstagnation point, and the amplitude of waves at infinity will be\n4\n√\n2\be−ψ0\/\f.\n6.2. Flow over a rough boundary. For flow over a general smooth surface\nwe need to analytically continue outside the flow domain until we meet the first\nsingularity. Generically there will be one such singularity and it will generate a train\nof capillary waves. (Occasionally we meet more than one singularity with the same\nvalue of ψ; for example, any streamline in Figure 1 may be taken as the boundary\nEXPONENTIAL ASYMPTOTICS AND CAPILLARY WAVES 1891\nD′\nD\nB′\nB\nAA′\nE\nE ′\n(a)\nD D′\nB′A′\nB\nE E ′\nA\n(b)\nFig. 9. (a) A schematic diagram of flow over a step. (b) The complex potential plane. There\nare two Stokes lines (dashed) meeting the free boundary, originating at the corners A and B.\nof a flow, the analytic continuation of which will lead to the corner and stagnation\npoint singularities.) If the surface is not smooth, then we know that the nearest\nsingularities are those on the surface. For example, for flow over the step shown\nin Figure 9 there are two relevant singularities, corresponding to the two corners.\nSince k = 2\/3, α = −1\/2 for one corner, and k = 2, α = 1\/2 for the other, the\nwaves generated by both singularities have the same amplitude and there is again,\ntherefore, the possibility that they are exactly out of phase and cancel out. Thus\nthere is a discrete set of step heights (accumulating at infinity) for which there is a\nbounded region of capillary waves on the free surface.\n6.3. Flow past a submerged object. For flow past a smooth object (as shown\nin Figure 10, for example) there will in general be two singularities on the surface of\nthe object corresponding to the leading and trailing stagnation points. These both\nhave k = 2\/3, α = −1\/2 so that there is the possibility that the wave trains again\ncancel, which they will do for a discrete set of values of \b.\nIf the object also has corners, then we have to take into account the waves gen-\nerated by these singularities, also.\nIf there is circulation about the object, then the two stagnation points may merge\nand eventually detach, as shown in Figure 11. Then there is only one singularity, but\nthere are two equipotential lines from it which meet the free surface, so that there\nwill still be two wave trains. Whether these are out of phase or not depends on the\n“depth” of the stagnation point, so that in this case there is a discrete set of values\nfor the circulation for which there are bounded waves on the free surface.\n1892 S. J. CHAPMAN AND J.-M. VANDEN-BROECK\nD D\n′\nC C ′\nE E\n′\n(a)\nD′D\nC C ′\nE ′E\n(b)\nFig. 10. (a) A schematic diagram of flow around a submerged obstacle. (b) The complex\npotential plane. The stagnation points C and C′ are square-root branch points of z(w). There are\ntwo Stokes lines (dashed) meeting the free boundary, originating from these stagnation points.\nD D′\nE ′E\nC\nFig. 11. A schematic diagram of flow around a submerged obstacle with large circulation. The\nstagnation points have merged into one which has left the boundary of the obstacle. There are still\ntwo Stokes lines (dashed) meeting the free boundary, both originating from this one stagnation point.\n6.4. Impinging jets. Figure 12 shows equal and opposite impinging jets (or\nequivalently a jet impinging normally on a plane wall). The only singularity is the\nstagnation point, and the equipotentials from it meet each of the free boundaries once,\nso that each of the incoming jets will have a train of capillary waves on each side.\nThis easily generalizes to unequal and\/or obliquely impinging jets.\n6.5. Source beneath a free surface. In [12] the problem of a source lying\nbeneath a free surface and above a flat horizontal bottom is considered, as shown\nin Figure 13. The free surface has a discontinuous gradient, near which an inner\nEXPONENTIAL ASYMPTOTICS AND CAPILLARY WAVES 1893\nE\nC\nD\nD′\n(a)\nC\nD′ D\nE\n(b)\nFig. 12. (a) A schematic diagram of impinging equal and opposite jets. (b) The complex\npotential plane. The stagnation point C is a square-root branch point of z(w). There is one Stokes\nline (dashed) from this point meeting each of the free boundaries.\nproblem would need to be solved when a small amount of surface tension is introduced.\nHowever, there is also a stagnation point on the lower surface, which can produce\nadditional capillary waves on the free surface.\nIf the source is sufficiently close to the free surface, then the equipotential from the\nstagnation point meets the free boundary (in two places, one either side of the cusp),\nand exponentially small capillary waves will be generated at these points. However, if\nthe source is close to the lower boundary, then the equipotential from the stagnation\npoint meets the streamline DC on the section D′C, so that capillary waves are not\ngenerated on the free boundary in this case.\n6.6. Gliding and planing. A typical gliding or planing flow is shown in Figure\n14. In this case the relevant singularities are the stagnation point C and the ends\nof the plate A and B. No equipotential from any of these meets the free boundaries\nA′A and B′B (although there is an inner problem in the vicinity of A and B which\n1894 S. J. CHAPMAN AND J.-M. VANDEN-BROECK\nA\nD′\nC\nA′\nD\nE\n(a)\nA′\nC D\nC\nA\nED′\n(b)\nFig. 13. (a) A schematic diagram of a source above a flat horizontal boundary and beneath a\nfree surface. Only the left half of the physical plane is shown. (b) The complex potential plane. The\nsource C lies at infinity, while the stagnation point A′ is a square-root branch point of z(w). There\nis one Stokes line (dashed) from this point meeting the free boundary.\nmay generate waves on these free boundaries). However, equipotentials from A and\nC meet the free boundary D′D at E′ and E, respectively. Hence there will be two\nsets of capillary waves on this free surface, one generated at E′ and one generated at\nE.\nHowever, the flow separation point A is a type of flow singularity that we have\nnot yet considered. The behavior in the vicinity of A is more tricky than that near a\nstagnation point or corner, but it is still not difficult to show that\nθ0 ∼ const. + const.(w − w0)1\/2(6.1)\nas w → w0. This means that for these singularities γ = −1\/2 rather than zero. The\nanalysis in section 4 is modified in an obvious way (see [5] for the details), and the\nresult is that\n2πiΛ\b1\/2 exp\n(\n− i(w − w0)\n\b\n)\n(6.2)\nis switched on across Stokes lines in the upper half plane. Thus the capillary waves\ngenerated are smaller in amplitude by a factor of \b1\/2 than those generated at the\nstagnation point.\nThe inner problem in the vicinity of w0 on the free boundary to determine Λ is\nEXPONENTIAL ASYMPTOTICS AND CAPILLARY WAVES 1895\nD′\nA′\nB\nC\nB′\nD\nE\nA\nE ′\n(a)\nE E ′ D\n′D\nA′\nB\nC\nA\nB′\n(b)\nFig. 14. (a) A schematic diagram of a gliding flow. (b) The complex potential plane. The\nstagnation point C is a square-root branch point of w. There are Stokes lines (dashed) meeting the\nfree boundary, originating at A and C.\nalso modified. The corresponding analysis is given in the appendix, and the result is\nΛ =\nβe−5iπ\/4\n2\n√\nπ\n,\nwhere\nθ0 ∼ const. + β(w − w0)1\/2 + · · ·\nas w → w0.\n7. Conclusion. We have employed recently developed techniques in asymptotics\nbeyond all orders to examine the problem of exponentially small capillary waves on\npotential flows with small surface tension in the absence of gravity. Much of the\ntheory can be worked out analytically, and the results are pleasingly simple.\nWe find that waves will be generated whenever the equipotential from a singu-\nlarity in the flow (such as a corner or stagnation point) meets the free surface. Our\nanalysis gives the jump in the amplitude of the waves as this equipotential is crossed;\nto determine on which section of the free boundary they are present, the standard\n1896 S. J. CHAPMAN AND J.-M. VANDEN-BROECK\nradiation condition needs to be used. The jump in amplitude of the waves is found\nto be of the form\nC\bne−ψ0\/\f,(7.1)\nwhere ψ0 is the modulus of the difference between the streamfunction on the free\nsurface and at the singularity (i.e., the flux of fluid between these streamlines, since\nthe unperturbed skin speed is normalized to unity), and \b is the surface tension\nparameter. The algebraic factor \bn depends in a simple way on the type of singularity;\ncorners and stagnation points have n = 1, while separation points have n = 3\/2.\nFinally, the constant C can also be calculated simply; for corners and stagnation\npoints C = 8 sin(πα\/2), where dw\/dz ∝ (w−w0)α locally. Typically, for a stagnation\npoint α = 1\/2, while for flow around a corner α = 1 − β\/π, where β is the interior\n(i.e., in the fluid) angle of the corner.\nFor flows which have singularities in the physical domain (flows with stagnation\npoints or flows around polygonal objects) the relevant singularities are easy to de-\ntermine. Flows with no singularities in the physical domain must be analytically\ncontinued to find the nearest singularity outside the flow domain.\nAn intriguing possibility, which seems to be realized in many of the flows we\nhave examined, is that there are two Stokes lines meeting the free boundary with a\nbounded region containing capillary waves between them—the waves turned on at the\nfirst Stokes line are effectively turned off at the second.\nWe have compared our asymptotic results with a direct numerical simulation for\na simple ploughing flow and for flow around a right-angled corner. In both cases the\nresults are surprisingly accurate, even at values of \b as high as 1.5.\nFinally, we have a word of warning when determining the position of singularities,\nespecially when this involves analytically continuing outside the flow region. Because\nof the exponential dependence of the waves on the value of the complex potential at\nthe singularity, an order-\b perturbation to the position of the singularity produces and\norder-one perturbation to the waves. If this perturbation is in ψ, the amplitude of the\nwave is perturbed by an order one amount, while if it is in φ, the phase of the waves\nis perturbed by an order one amount. This is the reason we chose a as our control\nparameter in the example of section 5; if we had used b to control the height of the\nplough it would have been much harder to compare to the numerical solution, since\nwe would need to know a to order \b. However, having said this, for many problems\n(such as those we have considered) the positions of the singularities are determined\nexactly (or at least the value of ψ at the singularity is), since they lie at corners or\nstagnation points on a submerged object.\nAppendix A. Inner expansion in the vicinity of the complex singularity\ngenerated by flow separation.\nAs in section 3.3, in the vicinity of the singularity in the complex plane the right-\nhand side of (2.6) in the inner region is simply the inner limit of log q − iθ. Hence,\nsince q0 = 1 on the free boundary, and\nθ0 ∼ const. + β(w − w0)1\/2 + · · · ,\nsay, in the vicinity of w0, we have\nlog q − iθ ∼ −iβ(w − w0)1\/2 + const. + · · · ,(A.1)\n−2\bq dθ\ndw\n= q2 − 1.(A.2)\nEXPONENTIAL ASYMPTOTICS AND CAPILLARY WAVES 1897\nWe define the inner variable η as before by w = w0 − \biη. Then, differentiating (A.1)\ngives\nq′\nq\n− iθ′ = βe\n−3iπ\/4\b1\/2\n2η1\/2\n,\nwhere ′ represents d\/dη. Substituting into (A.2) gives\nq′ +\n1\n2\n(q2 − 1)− βe\n−3iπ\/4\b1\/2q\n2η1\/2\n= 0.(A.3)\nNow the correct scaling for q is\nq = 1 +\nβ\b1\/2e−3iπ\/4q¯\n2\n,(A.4)\ngiving to leading order\nq¯′ + q¯ − 1\nη1\/2\n= 0.(A.5)\nThus the relevant inner problem for q is in fact linear, unlike in section 3.3 where it\nwas nonlinear. This is because the singularity generated by flow separation is not in\nthe leading-order term in z(w) as w → w0 but in a higher-order term.\nTo determine Λ we again need to match the inner limit of (3.12) with the outer\nlimit of (A.5). To this end we expand q¯ as η →∞ giving\nq¯ = 2e−η\n∫ η1\/2\new\n2\ndw =\n∞∑\nn=0\n(2n)!\n22nn!ηn+1\/2\n.(A.6)\nWriting the outer expansion (3.14) in terms of the inner variable η gives\n\bnqn ∼ iΛ\b\n1\/2Γ(n− 1\/2)\nηn−1\/2\nas n→∞.(A.7)\nMatching (A.6) and (A.7) gives\nΛ =\nβe−5iπ\/4\n2\nlim\nn→∞\n(2n)!\n22nn!Γ(n+ 1\/2)\n=\nβe−5iπ\/4\n2\n√\nπ\n.\nREFERENCES\n[1] T.R. Akylas and T.-S. Yang, On short-scale oscillatory tails of long-wave disturbances, Stud.\nAppl. Math., 94 (1995), pp. 1–20.\n[2] M.V. Berry, Uniform asymptotic smoothing of Stokes’s discontinuities, Proc. Roy. Soc. Lon-\ndon Ser. A, 422 (1989), pp. 7–21.\n[3] J.G. Byatt-Smith, On the existence of homoclinic and heteroclinic orbits for differential equa-\ntions with a small parameter, European J. Appl. Math., 2 (1991), pp. 133–158.\n[4] S.J. Chapman, On the roˆle of Stokes lines in the selection of Saffman-Taylor fingers with small\nsurface tension, European J. Appl. Math., 10 (1999), pp. 513–534.\n[5] S.J. Chapman, J.R. King, and K.L. Adams, Exponential asymptotics and Stokes lines in non-\nlinear ordinary differential equations, Proc. Roy. Soc. London Ser. A, 454 (1998), pp. 2733–\n2755.\n[6] O. Costin, On Borel summation and Stokes phenomena for rank-1 nonlinear systems of or-\ndinary differential equations, Duke Math. J., 93 (1998), pp. 289–344.\n1898 S. J. CHAPMAN AND J.-M. VANDEN-BROECK\n[7] G.D. Crapper, An exact solution for progressive capillary waves of arbitrary amplitude, J.\nFluid Mech., 2 (1957), pp. 532–540.\n[8] R. Combescot, V. Hakim, T. Dombre, Y. Pomeau, and A. Pumir, Analytic theory of the\nSaffman-Taylor fingers, Phys. Rev. A, 37 (1988), pp. 1270–1283.\n[9] R.B. Dingle, Asymptotic Expansions: Their Derivation and Interpretation, Academic Press,\nLondon, 1973.\n[10] R. Grimshaw and N. Joshi, Weakly nonlocal solitary waves in a singularly perturbed\nKorteweg–de Vries equation, SIAM J. Appl. Math., 55 (1995), pp. 124–135.\n[11] V. Hakim, Computation of transcendental effects in growth problems: Linear solvability con-\nditions and nonlinear methods, in Asymptotics Beyond All Orders, NATO Adv. Sci. Inst.\nSer. B Phys. 284, H. Segur, S. Tanveer, and H. Levine, eds., Plenum, New York, 1991,\npp. 15–28.\n[12] A.C. King and M.I.G. Bloor, A note on the free surface induced by a submerged source at\ninfinite Froude number, J. Austral. Math. Soc. Ser. B, 30 (1988), pp. 147–156.\n[13] W. Kinnersley, Exact large amplitude capillary waves on sheets of fluid, J. Fluid Mech., 77\n(1976), pp. 229–241.\n[14] M.D. Kruskal and H. Segur, Asymptotics beyond all orders in a model of crystal growth,\nStud. Appl. Math., 85 (1991), pp. 129–181.\n[15] A.B. Olde Daalhuis, S.J. Chapman, J.R. King, J.R. Ockendon, and R.H. Tew, Stokes phe-\nnomenon and matched asymptotic expansions, SIAM J. Appl. Math., 55 (1995), pp. 1469–\n1483.\n[16] E.O. Tuck and J.-M. Vanden-Broeck, Ploughing flows, European J. Appl. Math., 9 (1998),\npp. 463–483.\n[17] Y. Pomeau, A. Ramani, and B. Grammaticos, Structural stability of the Korteweg-de Vries\nsolitons under a singular perturbation, Phys. D, 31 (1988), pp. 127–134.\n"}