{"doi":"10.1103\/PhysRevB.69.212503","coreId":"100939","oai":"oai:epubs.surrey.ac.uk:340","identifiers":["oai:epubs.surrey.ac.uk:340","10.1103\/PhysRevB.69.212503"],"title":"Analysis on the Stability of Josephson Vortices at Tricrystal Boundaries: A 3 phi(0)\/2-Flux Case","authors":["Susanto, H","van Gils, S A","Doelman, A","Derks, G"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-01-01","abstract":"<p>We consider Josephson vortices at tricrystal boundaries. We discuss the specific case of a tricrystal boundary with a pi junction as one of the three arms. It is recently shown that the static system admits an (n+1\/2)phi(0) flux, n=0,1,2 [ Phys. Rev. B 61, 9122 (2000) ]. Here we present an analysis to calculate the linear stability of the admitted states. In particular, we calculate the stability of a 3phi(0)\/2 flux. This state is of interest, since energetically this state is preferable for some combinations of Josephson lengths, but we show that in general it is linearly unstable. Finally, we propose a system that can have a stable (n+1\/2)phi(0) state.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:340<\/identifier><datestamp>\n      2017-10-31T13:57:52Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6D617468737075626C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/340\/<\/dc:relation><dc:title>\n        Analysis on the Stability of Josephson Vortices at Tricrystal Boundaries: A 3 phi(0)\/2-Flux Case<\/dc:title><dc:creator>\n        Susanto, H<\/dc:creator><dc:creator>\n        van Gils, S A<\/dc:creator><dc:creator>\n        Doelman, A<\/dc:creator><dc:creator>\n        Derks, G<\/dc:creator><dc:description>\n        <p>We consider Josephson vortices at tricrystal boundaries. We discuss the specific case of a tricrystal boundary with a pi junction as one of the three arms. It is recently shown that the static system admits an (n+1\/2)phi(0) flux, n=0,1,2 [ Phys. Rev. B 61, 9122 (2000) ]. Here we present an analysis to calculate the linear stability of the admitted states. In particular, we calculate the stability of a 3phi(0)\/2 flux. This state is of interest, since energetically this state is preferable for some combinations of Josephson lengths, but we show that in general it is linearly unstable. Finally, we propose a system that can have a stable (n+1\/2)phi(0) state.<\/p><\/dc:description><dc:date>\n        2004-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/340\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Susanto, H, van Gils, S A, Doelman, A and Derks, G  (2004) Analysis on the Stability of Josephson Vortices at Tricrystal Boundaries: A 3 phi(0)\/2-Flux Case   Physical Review B, 69 (21).       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevB.69.212503<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/340\/","10.1103\/PhysRevB.69.212503"],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Analysis on the stability of Josephson vortices at tricrystal boundaries: A 3f0 \/2-flux case\nH. Susanto* and S. A. van Gils\nDepartment of Applied Mathematics, University of Twente, P.O. Box 217, 7500 AE Enschede, The Netherlands\nA. Doelman\nKorteweg-de Vries Institute, Faculty of Sciences, University of Amsterdam, Plantage Muidergracht 24, 1018 TV Amsterdam,\nThe Netherlands\nG. Derks\nDepartment of Mathematics and Statistics, University of Surrey, Guilford, Surrey GU2 7XH, United Kingdom\n(Received 19 December 2003; revised manuscript received 8 April 2004; published 10 June 2004)\nWe consider Josephson vortices at tricrystal boundaries. We discuss the specific case of a tricrystal boundary\nwith a p junction as one of the three arms. It is recently shown that the static system admits an sn+1\/2df0 flux,\nn=0,1 ,2 [Phys. Rev. B 61, 9122 (2000)]. Here we present an analysis to calculate the linear stability of the\nadmitted states. In particular, we calculate the stability of a 3f0 \/2 flux. This state is of interest, since ener-\ngetically this state is preferable for some combinations of Josephson lengths, but we show that in general it is\nlinearly unstable. Finally, we propose a system that can have a stable sn+1\/2df0 state.\nDOI: 10.1103\/PhysRevB.69.212503 PACS number(s): 74.72.2h, 74.50.1r\nHalf-integer flux quantization is a tool to probe the sym-\nmetry of unconventional superconductors.1–3 Half-flux\nquanta will be naturally created at the intersection of three\ngrain boundaries if one of the boundaries has a phase shift of\np.4 In a recent paper, Kogan, Clem, and Kirtley4 consider\ntheoretically Josephson vortices at tricrystal boundaries.\nWhen one of the three Josephson junctions is a p junction, a\nhalf-integer flux is spontenously generated and attached to\nthe joint. For experimental reports on the observation of Jo-\nsephson vortices in grain boundaries with a p junction we\nrefer to Refs. 1–3. Kogan, Clem, and Kirtley4 also consider a\ngeneral case where the Josephson lengths of the junctions\nlJ’s are not the same. Besides the f0 \/2 state, they also notice\nthe existence of multiple half-flux states—i.e., sn\n+1\/2df0 , n=1,2.\nThe system of three Josephson junctions meeting at one\nend point has been considered first by Nakajima, Onodera,\nand Ogawa.5 The derivation of this system coupled via the\nboundary conditions using an electrical analog is given by\nNakajima and Onodera.6 The dynamic behavior of integer\nfluxes in this system with three junctions of the same type\nand with the same Josephson length has been discussed in\nRefs. 7 and 8.\nKnowing the eigenvalues of a state is of importance, also\nfor experimentalists, since one can then predict whether a\nparticular state can be observed in experiments or not. In this\npaper we will calculate analytically the linear stability of\nstatic (multiple) semifluxons sitting at or near the meeting\npoint of a tricrystal junction with one p junction. We will\nconsider the general case where the Josephson lengths are\nnot the same. As an example we will calculate the stability of\na 3f0 \/2 state. We use this state as a particular example since\nenergetically this state is preferable for some combinations\nof Josephson lengths, compared to f0 \/2 at the branch point\nplus f0 at infinity.4 Nonetheless, calculation of the energy of\nthis state does not establish the stability of it. In this report,\nwe will show that this state is in general unstable.\nThe time-dependent governing equation of the phase dif-\nference along the junctions is described by the perturbed\nsine-Gordon equation\nli\n2fxx\ni\n− ftt\ni\n= ui sin fi + aft\ni\n, s1d\nwith i=1,2 ,3 , x.0, t.0, and a is a positive damping co-\nefficient. The damping coefficient is not necessarily the same\nfor all the junctions. The subscript J of the Josephson length\nis omitted for brevity. The index i numbers the junction. The\nconstant ui represents the type of ith junction. Without loss of\ngenerality, we consider the case u1=−u2=−u3=−1. This\nmodels a tricrystal boundary with one p junction. The over-\nall coupling boundary conditions at the intersection are4–6\nf1 + f2 + f3 = 0,\nfx\n1\n= fx\n2\n= fx\n3\n, s2d\nall evaluated at x=0.\nThe total Hamiltonian energy of Eq. (1) is given by4\nH = o\ni\nE\n0\n‘ 1\n2\nslifx\ni d2 + uis1 − cos fiddx . s3d\nA time-independent solution of Eq. (1) representing a 3f0 \/2\nflux is given by4\nf0\n1\n= 4 tan−1sesx−x1d\/l1d − p ,\nf0\n2\n= 4 tan−1sesx−x2d\/l2d ,\nf0\n3\n= 4 tan−1sesx−x3d\/l3d − 2p , s4d\nwhere the xi are determined by Eq. (2). For simplicity we\nscale l1 to 1 such that in the calculation we need to consider\nonly l2 and l3. We will discuss the linear stability of the\nstate given by Eq. (4), but the method can be applied to other\nPHYSICAL REVIEW B 69, 212503 (2004)\n0163-1829\/2004\/69(21)\/212503(4)\/$22.50 ©2004 The American Physical Society69 212503-1\nsoliton solutions admitted by Eqs. (1) and (2). Combining\nEqs. (4) and (2) gives4\n2g2g3h3 − s1 + g2\n2 + g3\n2dh2 + 1 = 0,\ngi = li\/l1, h = sinf2 tan−1se−x1\/l1dg ,\ne−xi\/li =\n1 ± ˛1 − gi2h2\ngih\n, i = 2,3. s5d\nThe first case we consider is that li=1 for all i. Conse-\nquently we have x1=x2=x3=0.4 In this case the system has\nS3 symmetry.9 We linearize about the solution f0i . We write\nfisx , td=f0\ni +uisx , td and substitute the spectral ansatz ui\n=evtvisxd. Retaining the terms linear in ui gives the eigen-\nvalue problem\nvxx\ni\n− sv2 + av + ui cos f0\ni dvi = 0, s6d\nwith boundary conditions at x=0 given by\nv1 + v2 + v3 = 0, vx\n1\n= vx\n2\n= vx\n3\n. s7d\nThe spectrum v consists of the essential spectrum and the\npoint spectrum (isolated eigenvalues). The essential spec-\ntrum is given by those v for which there exist a solution to\nvxx\ni\n− fv2 + av + s lim\nx→‘\nui cos f0\ni dgvi = 0,\ni.e.,\nvxx\ni\n− sv2 + av + 1dvi = 0 s8d\nof the form vi=eikx, with k real.\nIt follows that\nv =\n− a ± ˛a2 − 4s1 + k2d\n2\n. s9d\nIt is easy to see that Resvd,0. The right-hand side of Eq. (9)\nis plotted in Fig. 1, with k as parameter.\nThe above stability analysis shows that solution (4) can be\nstable. We cannot conclude whether the solution is linearly\nstable or not before analyzing the point spectrum.\nTo complete the analysis, our next task is to find the point\nspectrum v. The point spectrum consists of those values of v\nfor which there exist solutions vi to Eq. (6) with boundary\nconditions (7) that converge to 0 at ‘.\nThe eigenfunction vi that corresponds to the eigenvalue is\nof the form10,11\nvisxd = ciemsx−xid\/liStanhx − xi\nli\n− mD, m2 = v2 + av + 1,\ns10d\nwhere Resmd,0 and ci needs to be determined from Eq. (7).\nHence, we obtain\nmsc1 + c2 + c3d = 0,\nc1s1 − m2d = c2s1 − m2d = c3s1 − m2d .\nThe fact that vi cannot be zero for all i implies that m=0 or\nm= ±1. From the condition that Resmd,0, we obtain m\n=−1 or v=0,−a with the corresponding eigenfunctions\ngiven by\nfv1,v2,v3g = f1,0,− 1ge−xstanh x + 1d = f1,0,− 1gsech x ,\nfv1,v2,v3g = f1,− 1,0ge−xstanh x + 1d = f1,− 1,0gsech x .\nThis result shows that there are quadruple eigenvalues at\nzero when the damping term is absent. A double-zero eigen-\nvalue bifurcates to the left half-plane when a is nonzero. The\nvalue m=0 gives bounded but not decaying eigenfunctions\nfrom which we obtain the edge of the essential spectrum\n[k=0 in Eq. (9)]. A sketch of the locations and the bifurca-\ntion of the point spectra is presented in Fig. 1.\nHence, we conclude that the solution given in Eq. (4) is\nlinearly stable.\nNext we will consider the general case of the 3f0 \/2 state\nfor any given combinations of Josepshon lengths. It is clear\nthat xi [see Eqs. (5)] can be either positive or negative, but\nnot all combinations of xi’s satisfy the governing equation. In\nFig. 2, we show the sign-set diagram showing combinations\nof signs of xi that are needed for a solution to satisfy the\ngoverning equations.12 A solution with two +’s has a higher\nHamiltonian energy [see Eq. (3)] than a solution with one +\nfor given values of li.4\nTo search for an asymptotically stable 3f0 \/2 state, it is\nsuggested to look at tricrystals with the Josephson length of\nthe p arm being larger than those of the 0 arms.4\nWe have obtained an expression for the eigenvalues of the\n3f0 \/2 state. Combining Eqs. (7) with (10) yields a polyno-\nFIG. 1. A sketch of the point spectra (crosses) and the essential\nspectrum Eq. (9) (thick lines) for two cases of a: (a) 0,a,2 and\n(b) a.2. When aø2, there is a part of the boundary lines that is at\nthe negative real line from point s−a \/2−˛a2 \/4−1,0d to point\ns−a \/2+˛a2 \/4−1,0d. There is no spectrum with positive real part\nimplying the linear stability of solution (4).\nBRIEF REPORTS PHYSICAL REVIEW B 69, 212503 (2004)\n212503-2\nmial of order 5 in m, with coefficients that depend on l2 \/l1\nand l3 \/l1. Asymptotic analysis shows that one root is less\nthan −1 if ul2 \/l1u!1 and ul3 \/l1u!1. In Fig. 3 we show\nnumerically that this result extends to general values of\nl2 \/l1 and l3 \/l1. Remembering that m2=v2+av+1, the two\nplots inform us that when the Josephson lengths differ, a pair\nof eigenvalues at the real line bifurcates from the quadruple\nzero. This implies instability if there is a Josephson length\ndifferent from the others. Further numerical analysis shows\nthat in this case the other zero eigenvalues move along the\nimaginary axis (with negative real part when aÞ0). Solu-\ntions with one + have another pair of eigenvalues at the\nimaginary axis bifurcating from the edges of the continuous\nspectrum.\nThe calculation we have done shows that there is no\nstable 3f0 \/2 state in tricrystal junctions with one p arm,\nexcept at some unphysical combinations of the Josephson\nlengths. We have used numerical simulations of Eq. (1) to\nconfirm the result of our linear stability analysis. In the\nscheme we take ft\nisx ,0d=0 and fisx ,0d=f0i as the initial\nconditions. Indeed we observed the same result for the sta-\nbility or instability. In Fig. 4 we present the evolution of two\n3f0 \/2 states for a given value of li’s.\nWith the above analysis, it can be easily shown that the\nf0 \/2 state is stable and the 5f0 \/2 state is unconditionally\nunstable.\nFIG. 2. The sign-set diagram for (sgnsx1d , sgnsx2d , sgnsx3d). This\ndiagram corresponds to Fig. 4 of Ref. 4\nFIG. 3. (Color online) The contourplot of the smallest m as a\nfunction of l2 \/l1 and l3 \/l1 for the 3f0 \/2 solution with (upper)\none + and (lower) two +’s in the (sgnsx1d , sgnsx2d , sgnsx3d). A\n3f0 \/2 state is marginally stable if m=−1 which is attained only at\nunphysical combinations.\nFIG. 4. The evolution of a 3f0 \/2 state (4) with a=0.05 and\nl2=l3=0.5; i.e., the Josephson length of the p junction is larger\nthan the Josephson lengths of the ordinary junctions. As an initial\nstate, we choose the solution with one positive xi. The release of an\ninteger fluxon moving away from the branch point shows the insta-\nbility of the state.\nBRIEF REPORTS PHYSICAL REVIEW B 69, 212503 (2004)\n212503-3\nOne can also show, using the same analysis, that the\n3f0 \/2 state will be unconditionally stable in the tetracrystals\nwith one p arm.3 One can also calculate that the 5f0 \/2 state\nwill be marginally stable in pentacrystals with one p arm.\nWe conjecture that a stable s1\/2+ndf0 state exists in 2sn\n+1d or more junctions connected to a joint with one of the\narms is a p junction. All the stable states require the maxi-\nmum field to be at the joint (see Fig. 1 in Ref. 4).\nTo summarize, we have described an analysis to study the\n(in)stability of a state in a tricrystal junction. We have con-\nsidered a special case—i.e., 3f0 \/2 flux—and shown that the\nstate is linearly unstable. According to the theory presented\nin Ref. 4 and combining the result with the stability analysis\nwe present here gives a clear explanation why a 3f0 \/2 state\nis never observed in experiments, especially in film\ngeometry.4 The stability analysis can be applied to discuss\nthe stability of solutions of other Josephson junction systems.\nWe also have written systems that can presumably have a\nstable s1\/2+ndf0 state.\nH.S. thanks T. P. P. Visser for many illuminating discus-\nsions, B. J. Geurts for explanations of numerical schemes,\nand J. R. Kirtley for fruitful discussions on experiments and\nmanipulations of half-fluxons in tricrystal junctions. He\nthanks also V. G. Kogan for his comment to the draft. This\nwork is supported by the Royal Netherlands Academy of\nArts and Sciences (KNAW) and partially by the PiShift Pro-\ngram.\n*Electronic address: h.susanto@math.utwente.nl\n1 J. R. Kirtley, C. C. Tsuei, M. Rupp, J. Z. Sun, L. S. Yu-Jahnes, A.\nGupta, M. B. Ketchen, K. A. Moler, and M. Bhushan, Phys.\nRev. Lett. 76, 1336 (1996).\n2 C. C. Tsuei and J. R. Kirtley, Phys. Rev. Lett. 85, 182 (2000).\n3 C. C. Tsuei and J. R. Kirtley, Rev. Mod. Phys. 72, 969 (2000).\n4 V. G. Kogan, J. R. Clem, and J. R. Kirtley, Phys. Rev. B 61, 9122\n(2000).\n5 K. Nakajima, Y. Onodera, and Y. Ogawa, J. Appl. Phys. 47, 1620\n(1976).\n6 K. Nakajima and Y. Onodera, J. Appl. Phys. 49, 2958 (1978).\n7 A. Grunnet-Jepsen, F. N. Fahrendorf, S. A. Hattel, N. Grønbech-\nJensen, and M. R. Samuelsen, Phys. Lett. A 175, 116 (1993).\n8 S. A. Hattel, A. Grunnet-Jepsen, and M. R. Samuelsen, Phys.\nLett. A 221, 115 (1996).\n9 M. Golubitsky, I. Stewart, and D. G. Schaeffer, Singularities and\nGroups in Bifurcation Theory (Springer, New York, 1988), Vol.\nII; I. Stewart, T. Elmhirst, and J. Cohen, in Bifurcation, Symme-\ntry and Patterns, edited by J. Buescu et al. (Birkhäuser Verlag,\nBoston, 2003).\n10 E. Mann, J. Phys. A 30, 1227 (1997).\n11 G. Derks, A. Doelman, S. A. van Gils, and T. P. P. Visser, Physica\nD 180, 40 (2003).\n12 There is an error in Fig. 4 of Ref. 4.\nBRIEF REPORTS PHYSICAL REVIEW B 69, 212503 (2004)\n212503-4\n"}