{"doi":"10.1007\/s10533-005-3832-0","coreId":"69161","oai":"oai:eprints.lancs.ac.uk:28096","identifiers":["oai:eprints.lancs.ac.uk:28096","10.1007\/s10533-005-3832-0"],"title":"Chemical and isotopic switching within the subglacial environment of a high Arctic glacier.","authors":["Wynn, Peter M.","Hodson, Andrew","Heaton, Tim H. E."],"enrichments":{"references":[{"id":949016,"title":"A new method for collection of nitrate from freshwater and the analysis of nitrogen and oxygen isotope ratios.","authors":[],"date":"2000","doi":"10.1016\/S0022-1694(99)00205-X","raw":"J. (2000) A new method for collection of nitrate from freshwater and the analysis of nitrogen and oxygen isotope ratios. Journal of Hydrology, 228, 22-36 Skidmore, M., Foght, J.M. and Sharp, M. (2000) Microbial Life Beneath a High Arctic Glacier. Applied and Environmental Microbiology, 66 (8) 3214-3220 Taylor, B.E., Wheeler, M.C and Nordstrom, D.K (1984) Isotope composition of Sulphate in acid mine drainage as a measure of bacterial oxidation. Nature 308, 538-541 Tranter,  M.  and  Raiswell,  R.  (1991)  The  composition  of  the  englacial  and  subglacial component in bulk melt waters draining the Gornergletscher, Switzerland. Journal of Glaciology, 37 (125), 59-66 Tranter, M., Brown, G., Raiswell, R., Sharp, M. and Gurnell, A. (1993) A conceptual model of solute acquisition by Alpine glacial meltwaters. Journal of Glaciology, 39 (133), 573-581 Tranter, M., Brown, G.H., Hodson, A., Gurnell, A.M. and Sharp, M.J. (1994) Variations in the nitrate concentration of glacial runoff in Alpine and sub-polar environments. IAHS Publication, 223, 299-311 Tranter, M., Sharp, M.J., Brown, G.H., Willis, I.C., Hubbard, B.P., Nielson, M.K., Wsmart, C.C., Gordon, S., Tulley, M. and Lamb, H.R. (1997) Variability in the chemical composition of in situ subglacial meltwaters. Hydrological Processes, 11, 59-77 Tranter, M.., Sharp, M.J., Lamb, H.R., Brown, G.H., Hubbard, B.P. and Willis, I.C (2002a) Geochemical weathering at the bed of Haut Glacier d’Arolla, Switzerland – a new model. Hydrological processes, 16, 959–993 Tranter,  M.,  Huybrechts,  P.,  Munhoven,  G.,  Sharp,  M.J.,  Brown,  G.H.,  Jones,  I.W., Hodson, A,J., Hodgkins, R and Wadham, J.L (2002b) Direct effect of ice sheets on Terrestrial bicarbonate, sulphate and base cation fluxes during the last glacial cycle: minimal impact on atmospheric CO2 concentrations. Chemical Geology, 190, 33-44 Van Everdingen, R.O. and Krouse H.R. (1985) Isotope composition of sulphates generated by bacterial and abiological oxidation. Nature, 315, 395-396 Wadham, J.L., Tranter, M. and Dowdeswell, J.A. (2000) Hydrochemistry of melt waters draining a polythermal-based, high Arctic glacier, south Svalbard: II. Winter and early Spring. Hydrological processes, 14, 1767-1786 Wadham, J.L., Bottrell, S., Tranter, M. and Raiswell, R. (2004) Stable isotope evidence for microbial sulphate reduction at the bed of a polythermal high Arctic glacier. Earth and Planetary Science Letters, 219, 341-355 Wassenaar,  L.I.  (1995)  Evaluation  of  the  origin  and  fate  of  nitrate  in  the  Abbotsford Aquifer using the isotopes of 15N and 18O in NO3 - Applied Geochemistry, 10, 391-405 Weertman, J (1972) General theory of water flow at the base of a glacier or ice sheet.","cites":null},{"id":948790,"title":"Changes in geometry and subglacial drainage of Midre Lovenbreen, Svalbard, determined from digital elevation models. Earth Surface Processes and Landforms, 28, 273-298 Rohm and Haas","authors":[],"date":"2003","doi":"10.1002\/esp.485","raw":"(2003) Changes in geometry and subglacial drainage of Midre Lovenbreen, Svalbard, determined from digital elevation models. Earth Surface Processes and Landforms, 28, 273-298 Rohm and Haas (2001) Product data sheet: Amberlite XAD7HP industrial grade polymeric adsorbent Rothlisberger,  H  (1972)  Water  pressure  in  intra-  and  sub-glacial  channels.  Journal  of glaciology, 11, 177–203 Samuelsson,  M-O.  (1985)  Dissimilatory  nitrate  reduction  to  nitrite,  nitrous  oxide  and ammonium by Pseudomonas putrefaciens. Applied and Environmental Microbiology, 50 (4), 812-815 Schurmann, A., Schroth, M.H., Saurer, M., Bernasconi, S.M. and Zeyer, J. (2003) Nitrateconsuming processes in a petroleum-contaminated aquifer quantified using push-pull tests  combined  with  15N  isotope  and  acetylene-inhibition  methods.  Journal  of contaminant hydrology, 1919, 1-19 Sharp, M., Tranter, M., Brown, G.H. and Skidmore, M. (1995) Rates of chemical denudation and CO2 drawdown in a glacier-covered Alpine catchment. Geology, 23, 61-64 Sharp,  M.,  Parkes,  J.,  Cragg,  B.,  Fairchild,  I.J.,  Lamb,  H.  and  Tranter,  M.  (1999) Widespread  bacterial  populations  at  glacier  beds  and  their  relationship  to  rock weathering and carbon cycling. Geology, 27 (2), 107-110 Shaw, E.M. (1994) Hydrology in practice, Chapman and Hall, London Sickman, J.O., Laydecker, A. and Melack, J.M. (2001) Nitrogen mass balances and abiotic controls on N retention and yield in high-elevation catchments of the Sierra Nevada, California, United States. Water Resources Research, 37 (5), 1445-1461 Silva, S. R., Kendall, C., Wilkison, D. H., Ziegler, A. C., Chang, C. C. Y. and Avanzino, R.","cites":null},{"id":948042,"title":"Denitrification, dissimilatory reduction of nitrate to ammonium, and nitrification in a bioturbated estuarine sediment as measured with 15N and microsensor techniques.","authors":[],"date":"1992","doi":null,"raw":"Binnerup,  S.J.,  Jensen,  K.,  Revsbech,  N.P.,  Jensen,  M.H.  and  Sørensen,  J.  (1992) Denitrification, dissimilatory reduction of nitrate to ammonium, and nitrification in a bioturbated  estuarine  sediment as  measured  with 15N and  microsensor  techniques.","cites":null},{"id":16675576,"title":"Low 15N\/ 14N ratios for nitrate in snow in the High Arctic (79°N). Atmospheric Environment,","authors":[],"date":"2004","doi":null,"raw":"Blackwell Scientific Publications, Oxford, Edinburgh, London, Melbourne Heaton, T.H.E., Wynn, P.M. and Tye, A. (2004) Low 15N\/ 14N ratios for nitrate in snow in the High Arctic (79°N). Atmospheric Environment, 38, 5611-5621 Hjelle, A. (1993). Geology of Svalbard. Norsk Polarinstitutt, Oslo Hodson A.J. and Fergusson, R.I. (1999) Fluvial suspended sediment transport from cold and warm based glaciers in Svalbard. Earth Surface Processes and Landforms, 24, 957-974 Hodson, A., Tranter, M. and Vatne, G. (2000) Contemporary rates of chemical denudation and atmospheric CO2 sequestration in glacier basins: An Arctic perspective. Earth Surface Processes and Landforms, 25, 1447–1471 Hodson, A.J., Mumford, P.N., Kohler, J. and Wynn, P.M. (2004) The High Arctic glacial ecosystem: new insights from nutrient budgets. Biogeochemistry, In Press Holloway, J. M., Dahlgren, R. A., Hansen, B. and Casey, W. H. (1998) Contribution of bedrock nitrogen to high nitrate concentrations in stream water. Nature, 395, 785-788 Hooke, R. Le. B., Laumann, T and Kohler, J (1990) Subglacial water pressures and the shape of subglacial conduits. Journal of Glaciology, 36 (122), 67-71 Horibe, Y., Shigehara, K. and Takakuwa, Y. (1973) Isotope separation factor in carbon dioxide-water system and isotopic composition of atmospheric oxygen. Journal of Geophysical Research, 78, 2625-2629 Hwang, H.-H., Liu, C.-L.J., Hackley, K.C (1999) Method improvement for oxygen isotope analysis in nitrates. Geological Society of America Abstracts with programs, NorthCentral Section, 31, p. A-23 No. 5, April 22-23, Champaign, Il Jones  Chromatography  (2001)  Catalogue  of  sample  preparation  products  and  services, International sorbent technology Kendall, C. (1998) Tracing nitrogen sources and cycling in catchments In: Kendall, C. and McDonnell, J.J. (eds.) Isotope tracers in catchment hydrology, Wiley Korom,  S.F.  (1992)  Natural  denitrification  in  the  saturated  zone:  A  review.  Water Resources Research, 28 (6), 1657-1668 Lamb, H.R., Tranter, M., Brown, G.H, Hubbard, B.P., Sharp, M.J., Smart, C.C., Willis, I.C. and Nielsen, M.K. (1995) The composition of subglacial meltwaters sampled from boreholes  at  the  Haut  Glacier  D’Arolla,  Switzerland.  International  Association  of Hydrological Sciences Publication, 228, 395-403 Lehmann, M.F., Reichert, P., Bernasconi, S.M., Barbieri, A and McKenzie, J.A (2003) Modelling  nitrogen  and  oxygen  isotope  fractionation  during  denitrification  in  a lacustrine redox-transition zone. Geochimica Cosmochimica Acta, 67 (14) 2529-2542 Lliboutry,  L.  (1968)  General  theory  of  subglacial  cavitation  and  sliding  of  temperate glaciers. Journal of Glaciology, 7, 21-58 Lloyd, R.M. (1967) Oxygen-18 composition of oceanic sulphate. Science, 156, 1228-1231 Lloyd, R.M (1968) Oxygen isotope behaviour in the sulphate-water system. Journal of Geophysical Research, 73, 6099-6209 McQuaker, N.R., Kluckner, P.D and Sandberg, D.K (1983) Chemical analysis of acidic precipitation: pH and acidity determinations. Environmental Science and Technology, 17, 431-439 Mingram,  B.  and  Brauer,  K.  (2001)  Ammonium  concentration  and  nitrogen  isotope composition in meta-sedimentary rocks from different tectonmetamorphic units of the European Variscan Belt. Geochimica et Cosmochimica Acta, 65 (2), 273-287 Nienow, P.W., Sharp, M.J and Willis, I.C (1998) Seasonal changes in the morphology of the subglacial drainage system, Haut Glacier D’Arolla, Switzerland. Earth Surface processes and Landforms, 23, 825–843 Nye, J.F (1973) Water at the bed of a glacier Symposium on the hydrology of glaciers, IASH publication, Cambridge, 95, 189-194 Panno, S.V., Hackley, K.C., Hwang, H.H. and Kelly, W.R. (2001) Determination of the sources  of  nitrate  contamination  in  karst  springs  using  isotopic  and  chemical indicators. Chemical Geology, 179, 113-128 Parkes,  J.,  Kivimaki,  A.L.,  Bottrell,  S.H,  Raiswell,  R.,  Skidmore,  M  Tranter,  M.  and Wadham,  J.L.  Microbial  utilisation  of  bedrock  components  during  chemical weathering in subglacial environments. Conference draft, Earth system processes – Global meeting (June 24 th-28 th, 2001) Rippin, D., Willis, I., Arnold, N., Hodson, A.J., Moore, J., Kohler, J. and Björnsson, H.","cites":null},{"id":948557,"title":"Low 15N\/14N ratios for nitrate in snow in the High Arctic (79°N). Atmospheric Environment,","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":949300,"title":"The provenance and fate of nitrogen in arctioc glacial meltwaters: an isotopic approach. Unpublished Ph.D thesis.","authors":[],"date":"2004","doi":null,"raw":"Reviews of Geophysics and Space Physics, 10, 287-333 Wynn,  P  (2004) The provenance and fate of  nitrogen in  arctioc glacial  meltwaters: an isotopic approach. Unpublished Ph.D thesis. University of Sheffield Wynn, P., Hodson A. J., Heaton, T.H.E and Chenery, S (Submitted) Microbial nitrate and the release of geologic-N within the subglacial environment of a high Arctic glacier. Earth and Planetary Science Letters","cites":null},{"id":948301,"title":"The thermal regime of sub-polar glaciers mapped by multifrequency radio-echo sounding.","authors":[],"date":"1996","doi":null,"raw":"Bio-rad laboratories, LIT203 Rev B BIO-RAD (2000b) Instruction manual: AG1, AG MP-1 and AG2 strong anion exchange resin. Bio-rad laboratories, LIT212 Rev C Björnsson,  H.,  Gjessing,  Y.,  Hamran,  S-E.,  Hagen,  J.O.,  Liestøl,  O.,  Pálsson,  F.  and Erlingsson, B. (1996) The thermal regime of sub-polar glaciers mapped by multifrequency radio-echo sounding. Journal of Glaciology, 42 (140), 23-32 Böttcher,  J.,  Strebel,  O.,  Voerkelius,  S.  and  Schimdt,  H-L.  (1990)  Using  isotope fractionation  of  nitrate-nitrogen  and  nitrate-oxygen  for  evaluation  of  microbial denitrification in a sandy aquifer. Journal of Hydrology, 114, 413-424 Bottrell, S.H. and Tranter, M. (2002) Sulphide oxidation under partly anoxic conditions at the bed of Haut Glacier D’Arolla, Switzerland. Hydrological Processes, 16 (5), 959-993 Boulton,  G.S  and  Hindmarsh,  R.C.A  (1987)  Sediment  deformation  beneath  glaciers: rheology and glaciological consequences. Journal of Geophysical Research, 92 (B9), 9059-9082 Chang, C.C.Y., Langston, J., Riggs, M., Campbell, D.H., Silva, S.R and Kendall, C. (1999) A method for  nitrate collection for  δ 15N  and δ 18O analysis from waters  with low nitrate concentrations. Canadian Journal of Fisheries and Aquatic Science, 56, 1856– Clark, I. D. and Fritz, P. (1997) Environmental isotopes in hydrogeology, Lewis Collins,  D.N.  (1978)  Hydrology  of  an  Alpine  glacier  as  indicated  by  the  chemical composition  of  meltwater.  Zeitschrift  für  Gletscherkunde  und  Glazialgeologie,  13, 219-238 Collins, D.N. (1979) Hydrochemistry of melt waters draining from an Alpine glacier. Arctic and Alpine Research, 11 (3), 307-324 Einsiedl, F., Maloszewski, P. and Stichler, W. (2004) Estimation of denitrification potential in a karst spring using the isotopes of 15N and 18O of NO3 -. Biogeochemistry (in press) FOSS-Tecator (2000) Application note: Determination of ammonium in water by Fiastar 5000 (AN5241) Golterman,  H.L.,  Clymo,  R.S.  and  Ohnstad,  M.A.M.  (1978)  Methods  for  physical  and chemical  analysis  of  fresh  waters,  Second  edition,  IBP  Handbook,  number  8.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006","abstract":"Natural environmental isotopes of nitrate, sulphate and inorganic carbon are discussed in conjunction with major ion chemistry of subglacial runoff from a High Arctic glacier, Midre Lovénbreen, Svalbard. The chemical composition of meltwaters is observed to switch in accordance with subglacial hydrological evolution and redox status. Changing rapidly from reducing to oxidizing conditions, subglacial waters also depict that 15N\/14N values show microbial denitrification is an active component of nutrient cycling beneath the glacier. 18O\/16O ratios of sulphate are used to elucidate mechanisms of biological and abiological sulphide oxidation. Concentrations of bicarbonate appear to be governed largely by the degree of rock:water contact encountered in the subglacial system, rather than the switch in redox status, although the potential for microbiological activity to influence ambient bicarbonate concentrations is recognised. Glaciers are therefore highlighted as cryospheric ecosystems supporting microbial life which directly impacts upon the release of solute through biogeochemically mediated processes","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69161.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/28096\/1\/Microsoft_Word_%2D_Chemical_and_Isotopic_switching_within_the_subglacial_environment_of_a_high_arctic_glacier_e%2Dprint.pdf","pdfHashValue":"2760ea508734cbabef7366867577b3352a2a7132","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:28096<\/identifier><datestamp>\n      2018-01-24T02:52:23Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D47:4745<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Chemical and isotopic switching within the subglacial environment of a high Arctic glacier.<\/dc:title><dc:creator>\n        Wynn, Peter M.<\/dc:creator><dc:creator>\n        Hodson, Andrew<\/dc:creator><dc:creator>\n        Heaton, Tim H. E.<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:description>\n        Natural environmental isotopes of nitrate, sulphate and inorganic carbon are discussed in conjunction with major ion chemistry of subglacial runoff from a High Arctic glacier, Midre Lovénbreen, Svalbard. The chemical composition of meltwaters is observed to switch in accordance with subglacial hydrological evolution and redox status. Changing rapidly from reducing to oxidizing conditions, subglacial waters also depict that 15N\/14N values show microbial denitrification is an active component of nutrient cycling beneath the glacier. 18O\/16O ratios of sulphate are used to elucidate mechanisms of biological and abiological sulphide oxidation. Concentrations of bicarbonate appear to be governed largely by the degree of rock:water contact encountered in the subglacial system, rather than the switch in redox status, although the potential for microbiological activity to influence ambient bicarbonate concentrations is recognised. Glaciers are therefore highlighted as cryospheric ecosystems supporting microbial life which directly impacts upon the release of solute through biogeochemically mediated processes.<\/dc:description><dc:date>\n        2006<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/28096\/1\/Microsoft_Word_%2D_Chemical_and_Isotopic_switching_within_the_subglacial_environment_of_a_high_arctic_glacier_e%2Dprint.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s10533-005-3832-0<\/dc:relation><dc:identifier>\n        Wynn, Peter M. and Hodson, Andrew and Heaton, Tim H. E. (2006) Chemical and isotopic switching within the subglacial environment of a high Arctic glacier. Biogeochemistry, 78 (2). pp. 173-193. ISSN 1573-515X<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/28096\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1007\/s10533-005-3832-0","http:\/\/eprints.lancs.ac.uk\/28096\/"],"year":2006,"topics":["GE Environmental Sciences"],"subject":["Journal Article","PeerReviewed"],"fullText":"Chemical and isotopic switching within the subglacial \nenvironment of a high Arctic glacier \nGeneral Research paper \n \nPeter Wynn\na,\n*, Andrew Hodson\na\n, Tim H.E. Heaton\nb\n \n \na\n Department of Geography, University of Sheffield, Winter St., Sheffield S10 2TN, UK \nb NERC Isotope Geosciences Laboratory, British Geological Survey, Keyworth, Nottingham \nNG12 5GG, UK \n \n* Corresponding author. Tel. +44(0)114 222 7900. E-mail address: p.wynn@sheffield.ac.uk \n \n \n \n \n \n \nKeywords: Isotopes; Microbial; Redox status; Subglacial \n \n \n \n \n \n \n \n \n \n \n \nAbstract \nNatural environmental isotopes of nitrate, sulphate and inorganic carbon are discussed \nin conjunction with major ion chemistry of subglacial runoff from a High Arctic \nglacier, Midre Lovénbreen, Svalbard. The chemical composition of meltwaters is \nobserved to switch in accordance with subglacial hydrological evolution and redox \nstatus. Changing rapidly from reducing to oxidizing conditions, subglacial waters also \ndepict that \n15\nN\/\n14\nN values show microbial denitrification is an active component of \nnutrient cycling beneath the glacier. \n18\nO\/\n16\nO ratios of sulphate are used to elucidate \nmechanisms of biological and abiological sulphide oxidation. Concentrations of \nbicarbonate appear to be governed largely by the degree of rock:water contact \nencountered in the subglacial system, rather than the switch in redox status, although \nthe potential for microbiological activity to influence ambient bicarbonate \nconcentrations is recognised. Glaciers are therefore highlighted as cryospheric \necosystems supporting microbial life which directly impacts upon the release of solute \nthrough biogeochemically mediated processes. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nIntroduction \nTraditional models of meltwater solute acquisition within subglacial environments \nassume a two component mixing model wherein solute is acquired through purely \ninorganic chemical reactions prior to meltwater evacuation from the glacier bed \n(Collins 1978; Collins 1979; Tranter and Raiswell, 1991; Tranter et al., 1993). The \ntwo components of subglacial bulk meltwater are termed quick flow and delayed \nflow, identifying the residence times distinctive to each water type (Tranter et al., \n1993). Whilst each component is ultimately derived from summer precipitation, \nsupraglacial snow and ice melt, quick flow represents meltwater in rapid transit \nthrough the glacial system, most likely through well defined conduits (Rothlisberger, \n1972; Nye 1973; Hooke et al., 1990), and delayed flow pertains to the slow passage of \nwater at the ice-bedrock interface near the sole of the glacier. Depending upon the \nstate of the glacier bed (hard rock or soft sediment), this latter component is thought \nto be subject to either attenuated flow through tortuous linked cavity networks \n(Lliboutry, 1968), films of basal melt (Weertman, 1972), or water saturated till \n(Boulton and Hindmarsh, 1987). The relative importance of each system has been \nfound to vary on a spatial and temporal basis, such that quick flow drainage typically \ndevelops at the expense of the delayed flow component as the snow line retreats \nupglacier during the ablation season (Nienow et al., 1998). Acquisition of solute by \neach water type was thought to be determined solely through the degree of rock-water \ncontact encountered in each environment and by the presence of atmospheric oxygen \nand carbon dioxide gases in solution (Tranter et al., 1993). Thus, quick flow waters \nare often assumed to have low solute loads. In contrast, delayed flow waters have \nrelatively concentrated solute loads, limited according to the availability of dissolved \ngases. However, there is now a growing body of evidence to suggest the acquisition of \nsolutes within the subglacial environment is not governed solely by inorganic \nprocesses, but rather through the microbial mediation of weathering reactions (Sharp \net al., 1999; Skidmore et al., 2000; Parkes, 2001). This has produced something of a \nparadigm shift in the understanding of glacial hydrochemistry, decoupling the \nacquisition of solute from the necessity of having dissolved atmospheric oxygen and \ncarbon dioxide in solution. Alternative oxidising agents are utilised through microbial \ncatalysis, enabling the continued acquisition of solute even after dissolved \natmospheric gases have been depleted. This has been employed to explain \nanonymously high concentrations of sulphate and bicarbonate present in the \nsubglacial environment of some glaciers when assuming dissolved atmospheric \noxygen and carbon dioxide were the sole agents of oxidation and carbonation \nreactions respectively (Bottrell and Tranter, 2002; Tranter et al., 2002, Wadham et al., \n2004). Whilst quick flow meltwaters are likely to pass through the glacial system with \nsuch rapidity as to obviate the necessity for alternative oxidizing agents, it is \nconceivable for meltwaters of delayed flow composition to deplete the store of \ndissolved atmospheric gases within solution, thereby relying on the microbial \nreduction of alternative materials for the continued acquisition of solutes. If this is the \ncase, a switch in the mechanism of solute acquisition from a predominantly microbial \nmechanism operating under sub-oxic, reducing conditions to an inorganic regime \nutilising dissolved atmospheric gases would be expected to accompany the evolution \nof the hydrological system from a delayed to quick flow configuration. However, such \na switch has yet to be documented in the literature. This paper therefore uses major \nion chemistry and environmental isotopic analysis of δ\n15\nN-NO3, δ\n18\nO-SO4 and δ\n13\nC-DIC \nto identify this chemical switch during evolution of the subglacial drainage system at \na High Arctic polythermal glacier, Midre Lovénbreen. \nMethodology \nField site \nMidre Lovénbreen is a high Arctic polythermal glacier situated on the \nBrøggerhalvøya peninsula in North West Spitsbergen (78.53ºN and 12.04ºE). It \ncomprises cold ice at the surface, snout and margins, and a temperate basal layer in \nthe central upper part of the glacier (Björnsson et al., 1996). Meltwater accesses the \nbed of the glacier via moulins in the accumulation area, later emerging as a \npressurised subglacial upwelling at the terminus (Hodson and Ferguson, 1999). The \nlocation of the drainage upwelling varies each season, potentially governed by rapid \nfrontal retreat of the glacier reconfiguring the internal drainage system on an annual \nbasis (Rippin et al., 2003). Samples of subglacial water were obtained during both \nsummer 2002 and 2003. During 2002, these were collected directly from the \npressurised subglacial upwelling prior to any mixing with supraglacial melt water. \nHowever, during summer 2003, the upwelling emerged in two spatially separate \nlocations. Initially emerging as a small anoxic spring on the eastern side of the \ncatchment, this upwelling eventually ceased to flow and was duly replaced by a much \nlarger outburst on the glacier surface in a location logistically difficult to access. \nSubglacial meltwater samples collected during summer 2003 are therefore presented \nas two discrete data sets rather than a continuous time series; the first representing \nmeltwater of delayed flow and the latter sampled a few meters downstream of the \nlarger upwelling emerging later in the season and representing meltwater of quick \nflow origin (Figure 1). The geology beneath the glacier consists of basement rocks \nbelonging to the Lower, Middle and Upper Proterozoic and are predominantly \ncomposed of phyllites and beds of quartzite. More strongly metamorphosed rocks to \nthe south of the phyllites include mica schists and beds of marble beneath the \naccumulation area of the glacier (Hjelle, 1993). Organic carbon contents of the \nbedrock typically average 0.07% (n = 8, range = 0.03 to 0.3%) whilst total sulphur \nrepresents a much more dominant component averaging 1650ppm (n = 6, range = 50 \nto 5020ppm) (Wynn, 2004).  \n \nField Sampling \nPre-melt supraglacial snowpack samples were collected in April 2002 and June 2003 \nfollowing methods of Sickman et al. (2001) and Hodson et al. (2004), in order to \nestablish the chemical composition of the snowpack serving as an input to the \nsubglacial drainage system. Meltwater samples emerging from the subglacial outlets \nduring summer 2002 and 2003 were collected for major ion analysis and filtered \nimmediately in the field using a handheld Nalgene vacuum unit and 0.45µm cellulose \nnitrate filters to prevent further reaction with suspended sediment. All samples were \nstored airtight in pre-rinsed 60ml polyethylene Nalgene bottles and refrigerated \nawaiting further analysis. \n \nDissolved Oxygen (D.O.) concentrations were determined in the field using the \nWinkler titration method based on test kit reagents supplied by Merck. Sample pH \nwas determined using a Hannah HI 1297D pH\/ORP\/temperature electrode following \nthe method adapted from McQuaker et al. (1983). \n \nDischarge and electrical conductivity were monitored continuously during summer \n2002 at a proglacial river monitoring site located approximately 1km downstream of \nthe subglacial upwelling (Figure 1). Conductivity was logged using a Campbell 247 \ncombined conductivity\/temperature probe, and water stage measured using a \nCampbell scientific PDCR 1830 pressure transducer. A stage-discharge relationship \nwas calculated using cross channel profiles of water depth and velocity using the mid-\npoint method (Shaw, 1994). \n \nSamples for isotopic analysis were collected in polyethylene jerry cans and bags for \nsubglacial meltwater and pre-melt snow samples respectively (pre-rinsed using \nsample melt water), and transported back to the laboratory for processing. Snow \nsamples for isotopic analysis were collected from the same location as the samples \ntaken for chemical composition (Figure 1) and followed the field sampling \nmethodology of Heaton et al., (2004). The snow was melted by immersing the plastic \nbags in warm water, and the liquid sample mixed in 120l polyethylene drums (Heaton \net al., 2004). Nitrate concentrations of all isotopic samples were determined as nitrite \nby spectrophotometry following cadmium reduction in the field laboratory to \ndetermine the quantity of water required to obtain 1mg NO3-N. To prevent further \nchemical reaction and change in melt water sample composition, each sample was \npressure filtered through a high capacity 0.45µm filter capsule. Filtration was \nundertaken within twelve hours of collection and samples were then transferred into \ncollapsible jerry cans. \n \nMelt water samples of 1 litre in volume were collected in the field for δ\n13\nC-DIC \ndetermination and transported immediately back to the laboratory. Samples were \npressure filtered through 0.45µm filters and added to 15ml of alkaline barium chloride \nsolution. Barium carbonate precipitates were refrigerated, separated by filtration, oven \ndried at approximately 50°C and stored airtight in glass vials awaiting further \nanalysis.  \n Major ion analysis \nAnions of chloride, sulphate, and nitrate were determined upon return to the UK using \na Dionex DX 100 ion chromatograph. Based on repeat analysis of reference standard \nmaterials, precision was quoted as 0.72, 3.35, and 1.19% RSD (relative standard \ndeviation) for nitrate, chloride and sulphate respectively. Total alkalinity \n(predominantly present as bicarbonate) was determined by titration with 1mmol acid \n(HCl) to an end point pH of 4.5 using BDH mixed indicator (Golterman et al., 1978). \nPrecision calculated from repeat analysis of samples was quoted as 5% RSD. Calcium \nand magnesium were analysed by Atomic Absorption Spectroscopy. Precision \nestimates from repeat analysis of reference standard materials of comparable \nconcentrations to the samples under analysis were calculated as 0.27 and 2.46% RSD \nfor calcium and magnesium respectively.  Soluble ammonium was analysed using a \nFOSS-Tecator FIAstar 5000 flow injection analyser (FOSS-Tecator, 2000). Precision \nwas calculated as 1.75% RSD from reference standards of comparable concentration \nto the samples being analysed. \n \nSample concentration for isotope analysis \nMeltwaters collected for isotopic analysis were gravity-fed through cation and anion \nexchange resins; AG2-X8 and AG50W-X8 respectively (BIO-RAD, 2000a; BIO-\nRAD, 2000b) following the methodology of Chang et al. (1999). To contend with the \nhigh salt and low nitrate content typical of the subglacial meltwaters being sampled, \ncation and anion resin volumes of up to 20ml were used and deliberately loaded to \nless than full exchange capacity to prevent fractionation of nitrate isotopes (Silva et \nal., 2000; Heaton et al., 2004). \n Nitrate and sulphate were eluted from the anion exchange resins using 1M \nhydrobromic acid (Hwang et al., 1999). To alleviate potential contamination of \nisotopic measurements of inorganic nitrate with organic nitrogen and oxygen, acidic \nhydrobromic eluents obtained from the anion resins were gravity-fed through columns \ncontaining Env\n+\n resin (Jones Chromatography, 2001) enabling the removal of \ndissolved organic matter (DOM) (Heaton et al., 2004). During summer 2003, this step \nwas undertaken in the field using a combination of amberlite XAD7-HP (Rohm and \nHaas, 2001) and Env\n+\n resin (Jones Chromatography, 2001) placed upstream and in \nseries with the anion and cation exchange resins, thereby acting as precursor resins for \nthe removal of DOM. Precipitation of sulphate from the acidic anion exchange resin \neluant as barium sulphate was undertaken using a 1M barium chloride solution. \nSamples were refrigerated for 48 hours encouraging the growth and maturation of the \nbarium sulphate crystals and subsequently centrifuged to aid separation from the \nremaining nitrate solution. The remaining eluant was processed to pure silver nitrate \n(AgNO3) following methods of Chang et al. (1999) and Silva et al. (2000). Product \nsilver nitrate was re-dissolved in 100µl of de-ionised water and frozen for storage. \n \nMass spectrometric analysis \n15\nN\/\n14\nN and \n18\nO\/\n16\nO ratios of product barium sulphate and silver nitrate were \ndetermined by combustion in an elemental analyser linked to a Thermo Finnigan \nDelta + XL continuous flow mass spectrometer. Reductive pyrolysis of samples \nwithin silver capsules yielded CO for determination of \n18\nO\/\n16\nO ratios versus VSMOW \n(international standard = NBS-127), and oxidative combustion of samples within tin \ncapsules yielded N2 for analysis of \n15\nN\/\n14\nN ratios (international standard = IAEA-N1). \nWithin-run standard replication (1S.D) was <0.5‰ and <0.4‰ for δ\n15\nN-NO3 and δ\n18\nO-\nSO4 respectively. δ\n18\nO values of nitrate are not presented in this paper as only partial \nremoval of  dissolved organic matter from the product silver nitrate rendered the \nmajority of samples too contaminated to detect a switch in subglacial isotopic \nsignature commensurate with the change in hydrological regime. δ\n18\nO analysis of \nH2O was undertaken using the CO2 equilibration procedure. Values were calculated \nversus VSMOW using within-run laboratory standards. Replicate analysis of within-\nrun standards indicated a precision of 0.05‰ (1 S.D). δ\n13\nC of DIC (Dissolved \nInorganic Carbon) present in crushed rock samples and as barium carbonate was \nliberated as CO2 and \n13\nC\/\n12\nC ratios determined on a VG Optima mass spectrometer \nversus VPDB (international standard =  NBS-19).  Replicate analysis of within-run \nstandards indicated a precision of 0.03‰ (1S.D). \n \n \nMethod testing of resin ion exchange and column elution procedures has been \nundertaken by Heaton et al. (2004). Recovery of an artificial solution mimicking the \nchemistry of snow at Ny-Ǻlesund was found to be quantitative in terms of both yield \nand isotopic value for each chemical species studied (Heaton et al., 2004). Field \nsample replication (1 S.D) for δ\n15\nN-NO3 and δ\n18\nO-SO4 was 1.83‰ and 0.19‰ \nrespectively. \n \nResults \nDischarge and suspended sediment concentrations (turbidity) recorded downstream of \nthe subglacial upwelling during summer 2002 are plotted and displayed in Figure 2. \nThe rapid increase in discharge shortly after the emergence of the pressurised \nsubglacial upwelling reflects the release of water from storage that accompanies the \nrapid establishment of a quick flow component at the glacier bed. This clearly \nobservable change in the river hydrology is coincident with striking changes in its \nhydrochemistry that are outlined below. \n \nConcentrations of D.O. and electrical conductivity (EC) emanating from the \npressurised subglacial upwelling are presented in Table 1 and Figure 3. Meltwater at \nthe onset of subglacial drainage is depleted in dissolved atmospheric oxygen and \nappears sub-oxic in nature, whereas later meltwater fractions appear fully oxygenated. \nAs an indication of total solute concentration, the electrical conductivity of the \nsubglacial meltwater decreases rapidly in accordance with the switch from low to high \nD.O. \n  \nConcentrations of nitrogen species emanating from the subglacial environment are \ngiven in Table 1. Nitrate concentrations are low prior to the change in D.O and EC \ndescribed above, whereas ammonium concentrations show the opposite trend, being \nleast concentrated when the meltwater output from the system is fully oxygenated. \nδ\n15\nN-NO3 signatures presented in Table 2 show a similar change as the \n15\nN\/\n14\nN ratios \nin initial fractions of subglacial runoff appear enriched in \n15\nN in comparison to the \nlater fractions of subglacial meltwater. These trends are illustrated in Figures 4a and \n4b for summer 2002 and 2003 respectively. \n \nConcentrations of sulphate and bicarbonate emanating from the subglacial upwellings \nat Midre Lovénbreen are summarised in Table 1. At the onset of the subglacial \ndrainage, when D.O. concentrations were low, sulphate and bicarbonate \nconcentrations were greatest, exceeding 1000µeq\/l. Log partial pressures of CO2 are \ngreatest during the initial subglacial flow configuration and decrease thereafter (Table \n1).  \n \nMeasured δ\n18\nO-SO4 values summarised in Table 2 also appear to have switched in \naccordance with the marked changes in sulphate concentrations and the degree of \noxygenation evident in the subglacial outflow waters (Figures 5a and 5b). δ\n13\nC-DIC \nvalues further enable the mechanisms of solute acquisition within the anoxic phase of \nthe subglacial drainage to be established. \n  \nDiscussion \nFrom these above descriptions, it appears that concomitant changes in the chemical \nand isotopic composition of subglacial runoff occur, which are associated with the \ndevelopment of the subglacial drainage system. Below, we contend that this reflects \nthe development of a quick flow, oxygenated configuration at the expense of a \ndelayed flow drainage system that is anoxic and closed to the atmosphere. This \nhypothesis forms the basis of the following discussion wherein the role of \nmicrobiological activity in influencing the chemical composition of subglacial \nmeltwaters under sub-oxic conditions is given particular attention. \n \nSubglacial denitrification and reduction to ammonium \nInterpreted collectively, conditions of high EC, low D.O. and low nitrate \nconcentrations (Table 1) indicate an environment of active chemical weathering, \npotentially operating under reducing conditions closed to the atmosphere.  As nitrate \nis readily used as an oxidising agent in the absence of D.O., this may imply nitrate is \nbeing lost from the system through denitrification (Equations 1 and 2). \n \n14NO3\n-\n + 5FeS2 + 4H\n+\n → 7N2 + 10SO4\n2-\n + 5Fe\n2+\n + 2H2O    (1) \n \n4NO3 + 5C + 2H2O → 2N2 + 4HCO3 + CO2      (2) \n \nThe periodic disappearance of nitrate in subglacial meltwater has also been noted at \nHaut Glacier D’Arolla, Switzerland by Tranter et al. (1994) and at Midre Lovénbreen \nby Hodson et al. (2004). However, concentrations of ammonium show a negative \ncovariance with nitrate. If denitrification is indeed the cause of low nitrate \nconcentrations in the initial fractions of subglacial runoff, it is likely this could be \nproceeding by dissimilatory reduction of nitrate to ammonium (e.g. Samuelsson, \n1985; Binnerup et al., 1992; Korom, 1992) (Equation 3), or may represent the release \nof ammonium from bedrock under anoxic conditions (e.g. Holloway et al., 1998; \nMingram and Brauer, 2001). \n \n2H\n+\n + NO3\n-\n + 2CH2O → NH4\n+\n + 2CO2 + H2O     (3) \n \nBased upon the kinetic isotope fractionation associated with denitrification, isotope \nenrichment factors for the bacterially mediated production of N2 (εN2 – NO3 ≈ δ15N2 – \nδ\n15\nNNO3) give values of -40 to -5‰ (Kendall, 1998), encouraging a concentration of \n15\nN in the remaining pool of reactant nitrate. \n15\nN\/\n14\nN ratios in initial fractions of \nsubglacial runoff appear enriched in \n15\nN when compared to the isotopic values of \nsupraglacial source water (compare Tables 2 and 3) and later oxic fractions of \nsubglacial runoff (Figures 4a and 4b). This likely reflects kinetic isotope fractionation \nassociated with microbial denitrification under sub-oxic conditions (e.g. Böttcher et \nal., 1990; Wassenaar, 1995; Clark and Fritz, 1997; Panno et al., 2001; Schurmann et \nal., 2003; Lehmann, et al., 2003.; Einsiedl et al., 2004). Rapid displacement of this \nsub-oxic water during summer 2002 limits the displayed time series of delayed flow \nmeltwater to just one sample (Figure 4a), although during summer 2003 early season \ndischarge of delayed flow meltwater was much lower, thereby enabling a time series \nto be established. Isotope ratios of \n15\nN\/\n14\nN during summer 2003 demonstrate an \nincrease in the quantity of each species produced under sub-oxic conditions with time \nuntil all the delayed flow meltwater had been purged from beneath the glacier (Figure \n4b). It is possible this represents a gradual purging of water from more strongly \nanoxic pockets of sediment at the glacier bed which are increasingly distal to the early \nseason subglacial drainage structure. \n \nFrom Tables 2 and 3, it should also be noted that in both 2002 and 2003 the \nconcentrations and δ\n15\nN values of nitrate in the oxic quickflow waters (averaging ≈ 4 \nµeq\/l and -4‰, respectively) are higher than those of the pre-melt snowpack (2-3 \nµeq\/l and -10‰ respectively). This implies the addition of nitrate by some process \noperating during or after melting of the snowpack. Possible processes include \nmicrobial oxidation of snowpack ammonium; or addition of nitrate from a subglacial \nsource, for example rock-derived nitrogen (Wynn et al., submitted). \n \nRedox evolution and sulphide oxidation \nTraditional models of inorganic geochemistry ascribe the majority of subglacial solute \nacquisition to processes of sulphide oxidation and carbonate dissolution, often \nexpressed through Equation 4; \n \n4FeS2(s) + 16CaCO3(s) + 15O2(aq) + 14H2O(l) \u0001 16Ca\n2+\n(aq) + 16HCO3\n-\n(aq) + 8SO4\n2-\n(aq) + 4Fe(OH)3(s) (4) \n \nAs depicted by Table 1 and noted by several authors (Lamb et al., 1995; Tranter et al., \n2002), sulphate concentrations in the subglacial environment of many glaciers may \nreadily approach 1000µeq\/l. Such concentrations can only be achieved through \nEquation 4 assuming the input supraglacial meltwaters are >200% saturated with \nD.O., or through the presence of an additional oxidizing agent (Tranter et al., 2002; \nBottrell and Tranter, 2002). The use of Fe III as an oxidizing agent in the microbially \nmediated production of high concentrations of sulphate has been hypothesised by \nTranter et al. (2002) and tested by Bottrell and Tranter (2002) based on the oxygen \nisotopic composition of sulphate generated through either biological or abiological \noxidation (Taylor et al., 1984; Van Everdingen and Krouse, 1985). \n  \nBased upon traditional models of sulphate acquisition, sulphide oxidation according \nto Equation 5 utilises just 1 of 4 oxygen atoms from water, the remaining oxygen \nincorporated into the sulphate molecule being sourced from O2. \n \n4FeS2(s) + 15O2(aq) + 14H2O(l) \u0001 16H\n+\n(aq) + 4Fe(OH)3(s) + 8SO4\n2-\n(aq)   (5) \n \nHowever, under anoxic conditions at the bed of the glacier, the microbially mediated \nproduction of sulphate from iron sulphide can be expressed through Equation 6, \nwhereby the stoichiometry is such that all of the oxygen incorporated into the sulphate \nmolecule is obtained from the surrounding water. \n \nFeS2 + 14Fe\n3+\n + 8H2O → 2SO4\n2-\n + 15Fe\n2+\n + 16H\n+\n     (6) \n \nThese two oxygen sources have different δ\n18\nO values: δ\n18\nO-atmO2 ≈ +23.7‰ (Horibe et \nal., 1973) and δ\n18\nO-H2O ≈ -12.3‰ (average of measured values given in Table 2). The \nresultant sulphate molecules should therefore be isotopically distinct, providing a \nmechanism through which the relative significance of each reaction can be assessed. \nAs the concern of this paper is based upon the changing oxygen isotopic signatures of \nsulphate obtained from bedrock weathering in the subglacial environment, isotopic \nsignatures have been corrected for the influence of aerosol and marine sulphate \nsourced from the glacier snowpack, according to Equation 7 (after Bottrell and \nTranter, 2002). \n \nδ\n18\nO-SO4 corr = δ\n18\nO-SO4 bulk - (δ\n18\nO-SO4 snow × fSO4 snow) \/ fSO4 weathering   (7) \n \nWhereby δ\n18\nO-SO4 bulk and δ\n18\nO-SO4 snow, depict the measured isotopic values of bulk \nsubglacial and snowpack sulphate-oxygen. fSO4 snow and fSO4 crustal represent the molar \nfraction of sulphate obtained from snowmelt and bedrock weathering respectively, \ncalculated after Sharp et al., (1995) (Equations 8 and 9); \n \nfSO4 snow = (SO4\/Cl)\n \nsnow × Clsubglacial       (8) \n \nfSO4 crustal = 1 - fSO4 snow         (9) \n  \n(SO4\/Cl)snow represents the ratio of sulphate to chloride in the unmelted spring \nsnowpack and Clsubglacial is the concentration of chloride present within the subglacial \nmelt waters. Corrected values are presented in Tables 1 and 2 and Figures 5a and 5b. \n \nDue to rapid isotopic equilibration between intermediate sulphur species of lower \noxidation state (SO2 and SO3\n-\n) and water, much of the intermediate δ\n18\nO-SO2 isotopic \nsignature is effectively lost. Subsequent rates of isotopic exchange between sulphate \nand water however, are extremely slow (Lloyd, 1967) rendering up to three of the four \noxygen atoms in all sulphate molecules to be sourced from H2O, irrespective of the \nsulphide oxidation pathway. This problem of isotopic equilibration was overcome by \nassuming that only the fourth oxygen atom incorporated into the sulphate reflected its \norigin from O2 or H2O. Sulphate containing less than 25% of atmospheric O2 was \ntherefore assumed to have been at least partly produced under conditions of anoxia by \nEquation 5 (Bottrell and Tranter, 2002). Assuming an isotopic enrichment of -8.7‰ \nduring the incorporation of oxygen from atmospheric O2 into sulphate molecules \n(Lloyd, 1968), a threshold value of δ\n18\nO can be calculated according to the \nmethodology of Bottrell and Tranter (2002) and Equation 10. \n     \nδ\n18\nOthreshold = [(23.7 – 8.7) x 0.25] + (0.75 x δ\n18\nOH2O)   (10) \n    \nSubglacial δ\n18\nOH2O signatures ranged between -12.46‰ to -12.74‰ for summer 2002 \nand -11.63‰ to -12.74‰ for summer 2003, yielding δ\n18\nOthreshold values of -5.6‰ to    \n-5.8‰ and -5.0‰ to -5.5‰ for summer 2002 and 2003 respectively. Corrected δ\n18\nO-\nSO4 values are displayed in Table 2 and plotted in Figures 5a and 5b in comparison to \nthe theoretically calculated threshold value. The sulphate δ\n18\nO value of the delayed \nflow meltwater lies below the calculated threshold, indicating sulphate to have been \nformed under at least partly anoxic conditions, probably by the reduction of iron III. \nSuch sub-oxic conditions likely formed during the winter when the subglacial system \nwas closed to the atmosphere. Again, isotope ratios of \n34\nS\/\n32\nS during summer 2003 \ndemonstrate an increase in the quantity of each species produced under sub-oxic \nconditions with time (Figure 5b) and probably represents a gradual purging of water \nfrom more strongly anoxic pockets of sediment at the glacier bed which are \nincreasingly distal to the early season subglacial drainage structure. \nA rapid increase in δ\n18\nO-SO4 values compared to the calculated oxic\/anoxic threshold \noccurs in accordance with the rapid switch between delayed to quick flow subglacial \nconfiguration and the increase in D.O. concentrations towards saturation. This \nsuggests the subglacial drainage network to have switched to an open system, \nestablishing a connection with the supraglacial environment. Fluxes of quick flow \noxygenated meltwater from the glacier surface enable the displacement of sub-oxic \ndelayed flow water and the re-establishment of oxic conditions at the glacier bed for \nthe remainder of the melt season (cf Bottrell and Tranter, 2002). \n \nSources of bicarbonate in the subglacial drainage system \nUnder open system conditions, DIC present in glacial meltwater is partly a product of \nthe aqueous dissolution of atmospheric CO2 (Equation 11); \n \nCO2(aq) + H2O(l) ↔ H\n+\n(aq) + HCO3\n-\n(aq)       (11) \n \ncarbonate hydrolysis (Equation 12); \n 2CaCO3(s) + H2O(l) ↔ 2Ca\n2+\n + HCO3\n-\n(aq) + CO3\n2-\n + OH\n- \n(aq)   (12) \n \ncarbonation reactions involving both silicates and carbonates (Equations 13 and 14 \nrespectively); \n \nCaAl2SiO8(s) + 2CO2(aq) + 2H2O(l) ↔ Ca\n2+\n(aq) + 2HCO3\n-\n(aq) + H2Al2SiO8(s)               (13) \n \nCaCO3(s) + CO2(aq) + H2O(l) ↔ Ca\n2+\n(aq) + 2HCO3\n-\n(aq)              (14) \n \nand\/or acid dissolution of carbonate and dolomitic bedrock (Equations 15 and 16 \nrespectively); \n \nH\n+\n(aq) + CaCO3(s) ↔ Ca\n2+\n(aq) + HCO3\n-\n(aq)               (15) \n \n2H\n+\n(aq) + CaMg(CO3)2 (s) ↔ Ca\n2+\n(aq) + Mg\n2+\n + 2HCO3\n-\n(aq)             (16) \n \nAs the subglacial drainage is suggested to operate as a closed system during winter \nand early summer, concentrations of DIC should appear limited by the supply of CO2 \nand partial pressures of CO2 in the meltwater would be expected to be much lower \nthan those measured in the atmosphere at 10\n-3.5 \natmospheres. However, DIC \nconcentrations under closed system conditions appear high, apparently unchecked by \nthis limited supply of atmospheric CO2 (Table 1). Potential sources for this closed \nsystem DIC include; carbonate hydrolysis; acid dissolution, the H\n+\n being generated by \nsulphide oxidation through Equations 4 and 5; or microbial respiration of organic \nmatter (Hodson et al., 2000; Tranter et al., 1997; Tranter et al., 2002a; Tranter et al., \n2002b; Wadham et al., 2000), (e.g. Equations 17 and 18). \n \n4Fe(OH)3(s) + CH2O +8H\n+\n \u0001 Fe\n2+\n + CO2(g) + 11H2O   (17) \n \nSO4\n2-\n + 2CH2O → H2S + 2HCO3\n-      \n(18) \n \nTo provenance the subglacial DIC concentrations between inorganic and organic \nsources, Equation 19 is used to calculate the amount of DIC released through \ninorganic hydrolysis and acid dissolution of the carbonate bedrock;  \n \nDIC (hydrolysis and acid dissolution) = Ca\n2+\ncrustal\n \n+ Mg\n2+\ncrustal               (19) \n \nWhereby Ca\n2+\ncrustal\n \nand Mg\n2+\ncrustal\n \nrepresent molar concentrations of crustal cations \nreleased during calcite and dolomite hydrolysis \/ dissolution, calculated after Sharp et \nal., (1995). \n \nWhereas traditional provenance calculations assume all bicarbonate from acid \ndissolution to be sourced in a 2:1 molar ratio with sulphate released from sulphide \noxidation (Equation 4), the oxidation of sulphide by iron III under closed system \nconditions holds the potential to generate greater quantities of bicarbonate from the \ndissolution of carbonate bedrock (Tranter et al., 2002). Consequently, use of the \ntraditional bicarbonate provenance calculation under prevailing sub-oxic conditions is \nprecluded. \n \nTable 4 compares measured DIC concentrations emanating from the closed phase of \nthe subglacial drainage with theoretical concentrations of DIC produced via inorganic \nhydrolysis and acid dissolution and calculated according to Equation 19. The \nsimilarity between the calculated and measured values suggests the production of DIC \nthrough organic microbial respiration during the closed phase of the subglacial \ndrainage has very little influence upon the magnitude of DIC released into the \nsurrounding meltwaters. Further evidence towards the limited contribution of \nmicrobial respiration to the total DIC flux is seen through δ\n13\nC-DIC values emanating \nfrom the closed phase of the subglacial drainage during 2003. Under closed system \nconditions, meltwater equilibrates first with the finite source of atmospheric CO2 \nentrained into the subglacial system and then dissolves an equivalent amount of DIC \nfrom the surrounding carbonate bedrock (Equation 13). In effect, half of the DIC is \nderived from dissolved atmospheric CO2 (δ\n13\nC-CO2 ≈ -8‰) and half is sourced from \nthe surrounding bedrock (δ\n13\nC-subglacial till = -2‰; average δ\n13\nC-bedrock ≈ -1‰, n = 8 ). \nAssuming there is no isotopic enrichment between the finite source of atmospheric \nCO2 and product DIC (εDIC-CO2 = 0‰); no enrichment during the dissolution of \ncarbonate bedrock to DIC (εDIC-CaCO3 = 0‰); and assuming CO2 dissolution to be the \nonly source of DIC, the δ\n13\nC-DIC of the subglacial meltwaters should have an isotopic \nvalue of approximately -4.5 to -5‰. Addition of DIC from organic microbial \nrespiration (δ\n13\nC-CO2 ≈ -23‰) should produce values of δ\n13\nC-DIC isotopically lower \nthan -5‰ (after Wadham et al., 2004). However, values presented in Table 4 are all \nhigher than the -5‰ value. This suggests the majority of DIC in the closed phase of \nthe subglacial system is obtained from an isotopically heavier source. This source is \nthought to be the surrounding carbonate bedrock whereby hydrolysis (Equation 12) \nand protons generated through sulphide oxidation (Equations 5 and 6) are capable of \nreleasing DIC. Slightly higher P(CO2) values associated with anoxic conditions \n(Table 1) may indicate a small release of CO2 into the meltwater from microbial \nrespiration, although the isotopic signatures suggest this source may be overwhelmed \nby the release of DIC from the surrounding bedrock. Consequently, the rapid decrease \nin DIC concentration associated with the switch in hydrological regime appears to be \nmainly associated with a decrease in the proportion of rock-water contact time and \nproton generation through sulphide oxidation (Equations 5 and 6), rather than the \nchange in redox status of the subglacial environment. \n \nConclusions \nMajor ion chemistry and environmental isotopic signatures have been obtained from a \nHigh Arctic subglacial upwelling allowing us to track the chemical evolution of the \nsubglacial drainage system.  Analyses of nitrogen, sulphur and carbon species present \nin the bulk subglacial meltwater have demonstrated the occurrence of a chemical \nswitch as the drainage system matures. This chemical switch appears to be \ncommensurate with the change in hydrological regime from a system dominated by \ndelayed flow to one evacuating snow meltwaters of predominantly quick flow origin. \nBased upon traditional models of subglacial hydrochemistry, the acquisition of solutes \nwas believed to be governed through inorganic weathering reactions, dependent upon \nthe extent of rock-water contact and the availability of dissolved oxygen and carbon \ndioxide gases. However, data presented here concurs with the most recent literature, \nsuggesting microbial catalysis and the utilisation of alternative oxidizing agents, must \nnow be considered as a potentially important mechanism in governing the solute \ncomposition of subglacial discharge, in particular that of delayed flow origin. \n15\nN\/\n14\nN \nratios of nitrate potentially demonstrate reducing conditions in early fractions of \nsubglacial runoff and the utilisation of nitrate as an oxidising agent through \ndenitrification. A chemical switch to conditions enabling evacuation of elevated \nnitrate concentrations appears to track the redox development of the subglacial \ndrainage system when connection to the supraglacial environment and an increased \ndischarge enables re-oxygenation of the system. \n18\nO\/\n16\nO isotopes of sulphate \ndemonstrate an identical switch in redox status. Conversely, the majority of DIC \nemanating from beneath the glacier appears to be a direct result of varying degrees of \nrock-water interaction. P(CO2) values elevated slightly above atmospheric \nconcentrations may indicate a source of CO2 in addition to that entrained into the \nsubglacial environment from the atmosphere. This is potentially sourced from \nmicrobial respiration of organic matter, although beneath this particular glacier, such \nan oxidation pathway appears to be of minimal significance to the solute output. In \nthe absence of detailed microbiological data, isotopic and major ion analyses have \nthereby indicated the presence of microbial assemblages surviving beneath High \nArctic glaciers, governing the solute composition of subglacial runoff and potentially \ninfluencing the mechanisms of solute release into neighbouring freshwater and marine \necosystems. \n \nAcknowledgements \nThis work was supported by Natural Environment Research Council studentship \nfunding to P. Wynn; CASE industrial partnership funding in association with the \nBritish Geological Survey; and Royal Society 20\nth\n IGC funding to A. Hodson. \n \n \n \nReferences \nBinnerup, S.J., Jensen, K., Revsbech, N.P., Jensen, M.H. and Sørensen, J. (1992) \nDenitrification, dissimilatory reduction of nitrate to ammonium, and nitrification in a \nbioturbated estuarine sediment as measured with \n15\nN and microsensor techniques. \nApplied and Environmental Microbiology, 58 (1), 303-313 \n \nBIO-RAD (2000a) Instruction manual: AG 50W and AG MP-50 cation exchange resins. \nBio-rad laboratories, LIT203 Rev B \n \nBIO-RAD (2000b) Instruction manual: AG1, AG MP-1 and AG2 strong anion exchange \nresin. Bio-rad laboratories, LIT212 Rev C \n \nBjörnsson, H., Gjessing, Y., Hamran, S-E., Hagen, J.O., Liestøl, O., Pálsson, F. and \nErlingsson, B. (1996) The thermal regime of sub-polar glaciers mapped by multi-\nfrequency radio-echo sounding. Journal of Glaciology, 42 (140), 23-32 \n \nBöttcher, J., Strebel, O., Voerkelius, S. and Schimdt, H-L. (1990) Using isotope \nfractionation of nitrate-nitrogen and nitrate-oxygen for evaluation of microbial \ndenitrification in a sandy aquifer. Journal of Hydrology, 114, 413-424 \n \nBottrell, S.H. and Tranter, M. (2002) Sulphide oxidation under partly anoxic conditions at \nthe bed of Haut Glacier D’Arolla, Switzerland. Hydrological Processes, 16 (5), 959-\n993 \n \nBoulton, G.S and Hindmarsh, R.C.A (1987) Sediment deformation beneath glaciers: \nrheology and glaciological consequences. Journal of Geophysical Research, 92 (B9), \n9059-9082 \n \nChang, C.C.Y., Langston, J., Riggs, M., Campbell, D.H., Silva, S.R and Kendall, C. (1999) \nA method for nitrate collection for δ\n15\nN and δ\n18\nO analysis from waters with low \nnitrate concentrations. Canadian Journal of Fisheries and Aquatic Science, 56, 1856–\n1864 \n \nClark, I. D. and Fritz, P. (1997) Environmental isotopes in hydrogeology, Lewis \n \nCollins, D.N. (1978) Hydrology of an Alpine glacier as indicated by the chemical \ncomposition of meltwater. Zeitschrift für Gletscherkunde und Glazialgeologie, 13, \n219-238 \n \nCollins, D.N. (1979) Hydrochemistry of melt waters draining from an Alpine glacier. Arctic \nand Alpine Research, 11 (3), 307-324 \n \nEinsiedl, F., Maloszewski, P. and Stichler, W. (2004) Estimation of denitrification potential \nin a karst spring using the isotopes of \n15\nN and \n18\nO of NO3\n-\n. Biogeochemistry (in press) \n \nFOSS-Tecator (2000) Application note: Determination of ammonium in water by Fiastar \n5000 (AN5241) \n \nGolterman, H.L., Clymo, R.S. and Ohnstad, M.A.M. (1978) Methods for physical and \nchemical analysis of fresh waters, Second edition, IBP Handbook, number 8. \nBlackwell Scientific Publications, Oxford, Edinburgh, London, Melbourne \n \nHeaton, T.H.E., Wynn, P.M. and Tye, A. (2004) Low \n15\nN\/\n14\nN ratios for nitrate in snow in \nthe High Arctic (79°N). Atmospheric Environment, 38, 5611-5621 \n \nHjelle, A. (1993). Geology of Svalbard. Norsk Polarinstitutt, Oslo \n \nHodson A.J. and Fergusson, R.I. (1999) Fluvial suspended sediment transport from cold \nand warm based glaciers in Svalbard. Earth Surface Processes and Landforms, 24, \n957-974 \n \nHodson, A., Tranter, M. and Vatne, G. (2000) Contemporary rates of chemical denudation \nand atmospheric CO2 sequestration in glacier basins: An Arctic perspective. Earth \nSurface Processes and Landforms, 25, 1447–1471 \n \nHodson, A.J., Mumford, P.N., Kohler, J. and Wynn, P.M. (2004) The High Arctic glacial \necosystem: new insights from nutrient budgets. Biogeochemistry, In Press \n \nHolloway, J. M., Dahlgren, R. A., Hansen, B. and Casey, W. H. (1998) Contribution of \nbedrock nitrogen to high nitrate concentrations in stream water. Nature, 395, 785-788 \n \nHooke, R. Le. B., Laumann, T and Kohler, J (1990) Subglacial water pressures and the \nshape of subglacial conduits. Journal of Glaciology, 36 (122), 67-71 \n Horibe, Y., Shigehara, K. and Takakuwa, Y. (1973) Isotope separation factor in carbon \ndioxide-water system and isotopic composition of atmospheric oxygen. Journal of \nGeophysical Research, 78, 2625-2629 \n \nHwang, H.-H., Liu, C.-L.J., Hackley, K.C (1999) Method improvement for oxygen isotope \nanalysis in nitrates. Geological Society of America Abstracts with programs, North-\nCentral Section, 31, p. A-23 No. 5, April 22-23, Champaign, Il \n \nJones Chromatography (2001) Catalogue of sample preparation products and services, \nInternational sorbent technology \n \nKendall, C. (1998) Tracing nitrogen sources and cycling in catchments In: Kendall, C. and \nMcDonnell, J.J. (eds.) Isotope tracers in catchment hydrology, Wiley \n \nKorom, S.F. (1992) Natural denitrification in the saturated zone: A review. Water \nResources Research, 28 (6), 1657-1668 \n \nLamb, H.R., Tranter, M., Brown, G.H, Hubbard, B.P., Sharp, M.J., Smart, C.C., Willis, I.C. \nand Nielsen, M.K. (1995) The composition of subglacial meltwaters sampled from \nboreholes at the Haut Glacier D’Arolla, Switzerland. International Association of \nHydrological Sciences Publication, 228, 395-403 \n \nLehmann, M.F., Reichert, P., Bernasconi, S.M., Barbieri, A and McKenzie, J.A (2003) \nModelling nitrogen and oxygen isotope fractionation during denitrification in a \nlacustrine redox-transition zone. Geochimica Cosmochimica Acta, 67 (14) 2529-2542 \n \nLliboutry, L. (1968) General theory of subglacial cavitation and sliding of temperate \nglaciers. Journal of Glaciology, 7, 21-58 \n \nLloyd, R.M. (1967) Oxygen-18 composition of oceanic sulphate. Science, 156, 1228-1231 \n \nLloyd, R.M (1968) Oxygen isotope behaviour in the sulphate-water system. Journal of \nGeophysical Research, 73, 6099-6209 \n \nMcQuaker, N.R., Kluckner, P.D and Sandberg, D.K (1983) Chemical analysis of acidic \nprecipitation: pH and acidity determinations. Environmental Science and Technology, \n17, 431-439 \n \nMingram, B. and Brauer, K. (2001) Ammonium concentration and nitrogen isotope \ncomposition in meta-sedimentary rocks from different tectonmetamorphic units of the \nEuropean Variscan Belt. Geochimica et Cosmochimica Acta, 65 (2), 273-287 \n \nNienow, P.W., Sharp, M.J and Willis, I.C (1998) Seasonal changes in the morphology of \nthe subglacial drainage system, Haut Glacier D’Arolla, Switzerland. Earth Surface \nprocesses and Landforms, 23, 825–843 \n \nNye, J.F (1973) Water at the bed of a glacier Symposium on the hydrology of glaciers, \nIASH publication, Cambridge, 95, 189-194 \n \nPanno, S.V., Hackley, K.C., Hwang, H.H. and Kelly, W.R. (2001) Determination of the \nsources of nitrate contamination in karst springs using isotopic and chemical \nindicators. Chemical Geology, 179, 113-128 \n \nParkes, J., Kivimaki, A.L., Bottrell, S.H, Raiswell, R., Skidmore, M Tranter, M. and \nWadham, J.L. Microbial utilisation of bedrock components during chemical \nweathering in subglacial environments. Conference draft, Earth system processes – \nGlobal meeting (June 24\nth\n-28\nth\n, 2001) \n \nRippin, D., Willis, I., Arnold, N., Hodson, A.J., Moore, J., Kohler, J. and Björnsson, H. \n(2003) Changes in geometry and subglacial drainage of Midre Lovenbreen, Svalbard, \ndetermined from digital elevation models. Earth Surface Processes and Landforms, \n28, 273-298 \n \nRohm and Haas (2001) Product data sheet: Amberlite XAD7HP industrial grade polymeric \nadsorbent \n \nRothlisberger, H (1972) Water pressure in intra- and sub-glacial channels. Journal of \nglaciology, 11, 177–203 \n \nSamuelsson, M-O. (1985) Dissimilatory nitrate reduction to nitrite, nitrous oxide and \nammonium by Pseudomonas putrefaciens. Applied and Environmental Microbiology, \n50 (4), 812-815 \n \nSchurmann, A., Schroth, M.H., Saurer, M., Bernasconi, S.M. and Zeyer, J. (2003) Nitrate-\nconsuming processes in a petroleum-contaminated aquifer quantified using push-pull \ntests combined with 15N isotope and acetylene-inhibition methods. Journal of \ncontaminant hydrology, 1919, 1-19 \n \nSharp, M., Tranter, M., Brown, G.H. and Skidmore, M. (1995) Rates of chemical \ndenudation and CO2 drawdown in a glacier-covered Alpine catchment. Geology, 23, \n61-64 \n \nSharp, M., Parkes, J., Cragg, B., Fairchild, I.J., Lamb, H. and Tranter, M. (1999) \nWidespread bacterial populations at glacier beds and their relationship to rock \nweathering and carbon cycling. Geology, 27 (2), 107-110 \n \nShaw, E.M. (1994) Hydrology in practice, Chapman and Hall, London \n \nSickman, J.O., Laydecker, A. and Melack, J.M. (2001) Nitrogen mass balances and abiotic \ncontrols on N retention and yield in high-elevation catchments of the Sierra Nevada, \nCalifornia, United States. Water Resources Research, 37 (5), 1445-1461 \n \nSilva, S. R., Kendall, C., Wilkison, D. H., Ziegler, A. C., Chang, C. C. Y. and Avanzino, R. \nJ. (2000) A new method for collection of nitrate from freshwater and the analysis of \nnitrogen and oxygen isotope ratios. Journal of Hydrology, 228, 22-36 \n \nSkidmore, M., Foght, J.M. and Sharp, M. (2000) Microbial Life Beneath a High Arctic \nGlacier. Applied and Environmental Microbiology, 66 (8) 3214-3220 \n \nTaylor, B.E., Wheeler, M.C and Nordstrom, D.K (1984) Isotope composition of Sulphate in \nacid mine drainage as a measure of bacterial oxidation. Nature 308, 538-541 \n \nTranter, M. and Raiswell, R. (1991) The composition of the englacial and subglacial \ncomponent in bulk melt waters draining the Gornergletscher, Switzerland. Journal of \nGlaciology, 37 (125), 59-66 \n \nTranter, M., Brown, G., Raiswell, R., Sharp, M. and Gurnell, A. (1993) A conceptual model \nof solute acquisition by Alpine glacial meltwaters. Journal of Glaciology, 39 (133), \n573-581 \n \nTranter, M., Brown, G.H., Hodson, A., Gurnell, A.M. and Sharp, M.J. (1994) Variations in \nthe nitrate concentration of glacial runoff in Alpine and sub-polar environments. IAHS \nPublication, 223, 299-311 \n \nTranter, M., Sharp, M.J., Brown, G.H., Willis, I.C., Hubbard, B.P., Nielson, M.K., Wsmart, \nC.C., Gordon, S., Tulley, M. and Lamb, H.R. (1997) Variability in the chemical \ncomposition of in situ subglacial meltwaters. Hydrological Processes, 11, 59-77 \n Tranter, M.., Sharp, M.J., Lamb, H.R., Brown, G.H., Hubbard, B.P. and Willis, I.C (2002a) \nGeochemical weathering at the bed of Haut Glacier d’Arolla, Switzerland – a new \nmodel. Hydrological processes, 16, 959–993 \n \nTranter, M., Huybrechts, P., Munhoven, G., Sharp, M.J., Brown, G.H., Jones, I.W., \nHodson, A,J., Hodgkins, R and Wadham, J.L (2002b) Direct effect of ice sheets on \nTerrestrial bicarbonate, sulphate and base cation fluxes during the last glacial cycle: \nminimal impact on atmospheric CO2 concentrations. Chemical Geology, 190, 33-44 \n \nVan Everdingen, R.O. and Krouse H.R. (1985) Isotope composition of sulphates generated \nby bacterial and abiological oxidation. Nature, 315, 395-396 \n \nWadham, J.L., Tranter, M. and Dowdeswell, J.A. (2000) Hydrochemistry of melt waters \ndraining a polythermal-based, high Arctic glacier, south Svalbard: II. Winter and early \nSpring. Hydrological processes, 14, 1767-1786 \n \nWadham, J.L., Bottrell, S., Tranter, M. and Raiswell, R. (2004) Stable isotope evidence for \nmicrobial sulphate reduction at the bed of a polythermal high Arctic glacier. Earth \nand Planetary Science Letters, 219, 341-355 \n \nWassenaar, L.I. (1995) Evaluation of the origin and fate of nitrate in the Abbotsford \nAquifer using the isotopes of \n15\nN and \n18\nO in NO3\n-\n Applied Geochemistry, 10, 391-405 \n \nWeertman, J (1972) General theory of water flow at the base of a glacier or ice sheet. \nReviews of Geophysics and Space Physics, 10, 287-333 \n \nWynn, P (2004) The provenance and fate of nitrogen in arctioc glacial meltwaters: an \nisotopic approach. Unpublished Ph.D thesis. University of Sheffield \n \nWynn, P., Hodson A. J., Heaton, T.H.E and Chenery, S (Submitted) Microbial nitrate and \nthe release of geologic-N within the subglacial environment of a high Arctic glacier. \nEarth and Planetary Science Letters \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigures \nFigure 1: Location map and sampling sites of Midre Lovénbreen, Svalbard \n \n \nFigure 2: Discharge (m\n3\n\/day) and turbidity (raw mV output to logger) time series of \nsubglacial melt water discharging from the summer 2002 subglacial upwelling and \neast proglacial drainage \n \n  \n \n \n \n \n \n \n \n \n \n \n \nFigure 3: Dissolved oxygen (D.O.) (mg\/l) and conductivity (µS\/cm) time series of \nsubglacial melt water emanating from the 2002 subglacial upwelling \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 4a: δ\n15\nN-NO3 values of summer 2002 subglacial melt water \n \nFigure 4b: δ\n15\nN-NO3 values of summer 2003 subglacial melt water \n \n \n \n \nFigure 5a: δ\n18\nO-SO4 emanating from the summer 2002 subglacial drainage in \ncomparison to the calculated anoxic threshold (values are corrected for the influence \nof snowpack sulphate according to Equations 7-9) \n \nFigure 5b: δ\n18\nO-SO4 emanating from the summer 2003 subglacial drainage in \ncomparison to the calculated anoxic threshold (values are corrected for the influence \nof snowpack sulphate according to Equations 7-9) \n \nTables \n \nTable 1: Major ion chemical characteristics of subglacial delayed and quick flow meltwater components \n \nSubglacial melt water Redox state \nDissolved \nOxygen (mg\/l) \nEC (µs cm\n-1\n) NO3 (µM\/l) NH4\n+\n (µM\/l) SO4 (µM\/l) HCO3\n-\n (µM\/l) P (CO2) \nDelayed flow 2002 sub-oxic <6.0 201  (10.6) 1.12  (0.5) 0.52  (0.3) 652.7  (19.0) 1224.4  (84.6) -3.46  (0.1) \nQuick flow 2002 oxic 12.4  (1.5) 79  (15.4) 4.27  (0.6) 0.14  (0.1) 150.5  (28.4) 580.5  (93.1) -3.65  (0.2) \nDelayed flow 2003 sub-oxic 2.4  (0.4) 157  (8.6) 2.96  (1.0) 0.17  (0.1) 367.7  (35.0) 1133.4  (39.6) -3.46  (0.1) \nQuick flow 2003 oxic 14.6 60  (8.7) 3.86  (0.6) 0.10  (0.2) 98.0  (19.7) 478.4  (70.1) -3.65  (0.2) \n \nValues are means for n = 2 to14 (whereby n represents the number of field samples) with 1SD given in parentheses \n \n \nTable 2: Isotopic characteristics of subglacial delayed and quick flow meltwater components \n \nSubglacial melt water n = Redox state δ\n15\nN-NO3* δ\n18\nO-SO4* δ\n13\nC-DIC* δ\n18\nO-H2O* \nDelayed flow 2002 1 sub-oxic +2.3 -9.2 ----- -12.46 \nQuick flow 2002 4 oxic -4.5  (1.3) -5.7  (0.5) ----- -12.69  (0.1) \nDelayed flow 2003 4 sub-oxic +4.0  (5.5) -6.6  (0.7) -3.7  (0.1) -12.27  (0.1) \nQuick flow 2003 4 oxic -4.1  (1.1) -4.8  (0.4) ----- -11.70  (0.2) \n \n∗ δXsample, in ‰ = [(Rsample\/(Rstandard) –1] x 1000 \nwhere: for X = \n15\nN, R = \n15\nN\/\n14\nN, standard = atmospheric N2; for X = \n18\nO, R = \n18\nO\/\n16\nO, standard = VSMOW; for X = \n13\nC, R = \n13\nC\/\n12\nC, standard = \nVPDB  \nn represents the number of field samples. 1SD is given in parentheses. \nTable 3: Major ion and isotopic characteristics of pre-melt snowpack \n \nPre-melt snowpack n = Cl (µM\/l) NO3 (µM\/l) NH4\n+\n (µM\/l) SO4 (µM\/l) δ\n15\nN-NO3* δ\n18\nO-SO4* δ\n18\nO-H2O* \nSnowpack 2002 2 102.9  (5.5) 1.6  (0.1) 1.3  (0.1) 12.4  (0.3) -9.9 (0.02) +9.3  (0.3) -12.41  (1.0) \nSnowpack 2003 1 114.8 3.1 5.1 10.4 -9.8 +8.6 -11.94 \n \n∗ δXsample, in ‰ = [(Rsample\/(Rstandard) –1] x 1000 \nwhere: for X = \n15\nN, R = \n15\nN\/\n14\nN, standard = atmospheric N2; for X = \n18\nO, R = \n18\nO\/\n16\nO, standard = VSMOW \nn represents the number of field samples. 1SD given in parentheses. \n \n \n \nTable 4: Concentrations of bicarbonate, calcium and magnesium in the delayed flow meltwaters of the subglacial drainage  \n \nSubglacial meltwater n = Ca crustal (µM\/l)* Mg crustal (µM\/l)* DIC acid dissolution (µM\/l) \n†\n DIC Total (µM\/l) \n††\n \nDelayed flow 2002 2 875.8  (37.9) 251.5  (12.3) 1127.3  (50.1) 1224.4  (84.6) \nDelayed flow 2003 8 637.3  (35.7) 256.8  (13.7) 893.9  (49.2) 1133.4  (39.6) \n \n* X crustal in µM\/l = 1-(X\/Cl)\n \nsnow × Clsubglacial (calculated after Sharp et al., 1995), \nwhere: (X\/Cl)snow represents the ratio of ions to chloride in the unmelted spring snowpack and Clsubglacial is the concentration of chloride present \nwithin the subglacial melt waters. \n†\n DIC acid dissolution in µM\/l calculated according to Equation 18 \n††\n DIC total in µM\/l represents the total amount of DIC measured in the subglacial meltwaters. \nn represents the number of field samples. 1SD given in parentheses. \n"}