{"doi":"10.1016\/S0550-3213(02)00360-7","coreId":"66111","oai":"oai:dro.dur.ac.uk.OAI2:3111","identifiers":["oai:dro.dur.ac.uk.OAI2:3111","10.1016\/S0550-3213(02)00360-7"],"title":"Noncommutative D-brane and open string in pp-wave background with B-field.","authors":["Chu,  C. S.","Ho,  P. M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-08-05","abstract":"The open string ending on a D-brane with a constant B-field in a pp-wave Ramond–Ramond background is exactly solvable. The theory is controlled by three dimensionful parameters: α′, the mass parameter (RR background times the lightcone momentum) and the B-field. We quantize the open string theory and determine the full noncommutative structure. In particular, we find a fully noncommutative phase space whose noncommutativity depends on all these parameters. The lightcone Hamiltonian is obtained, and as a consequence of the nontrivial commutation relations of the theory, new features of the spectrum are noted. Various scaling limits of the string results are considered. Physical implications are discussed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66111.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3111\/1\/3111.pdf","pdfHashValue":"a98b2abbffbc72a4f607aa0bf3473a9604240e57","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:3111<\/identifier><datestamp>\n      2016-09-29T09:43:23Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Noncommutative D-brane and open string in pp-wave background with B-field.<\/dc:title><dc:creator>\n        Chu,  C. S.<\/dc:creator><dc:creator>\n        Ho,  P. M.<\/dc:creator><dc:description>\n        The open string ending on a D-brane with a constant B-field in a pp-wave Ramond–Ramond background is exactly solvable. The theory is controlled by three dimensionful parameters: α′, the mass parameter (RR background times the lightcone momentum) and the B-field. We quantize the open string theory and determine the full noncommutative structure. In particular, we find a fully noncommutative phase space whose noncommutativity depends on all these parameters. The lightcone Hamiltonian is obtained, and as a consequence of the nontrivial commutation relations of the theory, new features of the spectrum are noted. Various scaling limits of the string results are considered. Physical implications are discussed. <\/dc:description><dc:subject>\n        Non-commutative geometry<\/dc:subject><dc:subject>\n         Open string<\/dc:subject><dc:subject>\n         D-brane<\/dc:subject><dc:subject>\n         pp-wave.<\/dc:subject><dc:publisher>\n        Elsevier<\/dc:publisher><dc:source>\n        Nuclear physics B, 2002, Vol.636(1-2), pp.141-158 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2002-08-05<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3111<\/dc:identifier><dc:identifier>\n        issn:0550-3213<\/dc:identifier><dc:identifier>\n        doi:10.1016\/S0550-3213(02)00360-7<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3111\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1016\/S0550-3213(02)00360-7<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3111\/1\/3111.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0550-3213","issn:0550-3213"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2002,"topics":["Non-commutative geometry","Open string","D-brane","pp-wave."],"subject":["Article","PeerReviewed"],"fullText":" \n \n \nDurham Research Online \n \nDeposited in DRO: \n27 April 2009 \n \nVersion of attached file: \nAccepted for publication \n \nPeer-review status of attached file: \nPeer-reviewed \n \nCitation for published item: \nChu, C. S. and Ho, P. M. (2002) 'Noncommutative D-brane and open string in pp-wave \nbackground with B-field.', Nuclear physics B., 636 (1-2). pp. 141-158. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1016\/S0550-3213(02)00360-7 \n \n \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nar\nX\niv\n:h\nep\n-th\n\/0\n20\n31\n86\nv3\n  2\n9 \nM\nay\n 2\n00\n2\nPreprint typeset in JHEP style. - HYPER VERSION hep-th\/0203186\nNoncommutative D-brane and Open String\nin pp-wave Background with B-field\nChong-Sun Chua, Pei-Ming Hob\naCentre for Particle Theory, Department of Mathematical Sciences, University\nof Durham, Durham, DH1 3LE, UK\nb Department of Physics, National Taiwan University, Taipei 106, Taiwan,\nR.O.C.\nE-mail: chong-sun.chu@durham.ac.uk, pmho@phys.ntu.edu.tw\nAbstract: The open string ending on a D-brane with a constant B-field in a\npp-wave Ramond-Ramond background is exactly solvable. The theory is controlled\nby three dimensionful parameters: α′, the mass parameter (RR background times\nthe lightcone momentum) and the B-field. We quantize the open string theory and\ndetermine the full noncommutative structure. In particular, we find a fully noncom-\nmutative phase space whose noncommutativity depends on all these parameters. The\nlightcone Hamiltionian is obtained, and as a consequence of the nontrivial commuta-\ntion relations of the theory, new features of the spectrum are noted. Various scaling\nlimits of the string results are considered. Physical implications are discussed.\nKeywords: Non-Commutative Geometry, Open String, D-brane, pp-wave.\nContents\n1. Introduction 1\n2. BPS D-brane with B-field in pp-wave 3\n3. Noncommutative D-brane with B-field in pp-wave 6\n3.1 Open String Mode Expansion 6\n3.2 Open String Quantization in pp-wave with B-field 9\n3.3 Constrained Quantization 13\n4. Scaling Limits 14\n4.1 Small B-Field Limit 15\n4.2 Large B-Field Limit: Deformed Phase Space 15\n5. Discussions 16\n1. Introduction\nRecently a new maximal supersymmetric IIB supergravity background, the so called\npp-wave RR background, was discovered [1]. The pp-wave background consists of a\nplane wave metric, supported by a homogeneous RR 5-form flux\nds2 = −f2xixi(dx+)2 + 2dx+dx− + dxidxi, i = 1, . . . , 8, (1.1)\nF5 = fdx\n+ ∧ (dx1 ∧ dx2 ∧ dx3 ∧ dx4 + dx5 ∧ dx6 ∧ dx7 ∧ dx8). (1.2)\nA constant Euclidean metric gij can be introduced easily. We will do so in section 3.\nThis background has 32 supersymmetries and is related to the AdS5×S5 background\n[1, 2, 3] by a Penrose limit [4]. Moreover it is remarkable that string theory in this\nbackground is exactly solvable [5]. The understanding of the properties of string\ntheory in this background is very valuable and is of great interest. The Green-\nSchwarz formulation of closed string in pp-wave background has been performed by\nMetsaev [5] (see also [6, 7]). Boundary states for the lightcone GS strings in pp-\nwave background has been constructed [8]. The covariant NSR formulation remains\nillusive however.\nIt is natural to ask whether there is a meaning of the “Penrose limit” for the\ncelebrated AdS\/CFT correspondence [9]. Based on the spectrum of the lightcone\n1\nHamiltonian, Berenstein, Maldacena and Nastase [10] had put forward a remarkable\nproposal that string theory on this pp-wave background is dual to the large N limit\nof a certain subsector of the 4-dimensional supersymmetric N = 4 SU(N) gauge\ntheory. Various aspects as well as generalizations had been considered in [11]–[21].\nD-branes are basic objects in the nonperturbative formulation of string theory.\nOne of the developments in the last few years of string theory is the realization\nthat a constant B-field on a D-brane leads to noncommutative geometry on the D-\nbrane worldvolume [22, 23, 24, 25]. In this setting, the B-field and the string length\nsquare α′ are both dimensionful. Therefore, it is conceivable that a double scaling\nlimit may be taken so that certain dimensionful parameter remains in the low energy\nlimit α′ → 0. This is precisely what Seiberg and Witten did [25] and remarkably they\nobtained as the low energy limit a noncommutative field theory with the dimensionful\nnoncommutativity parameters θµν . It is an interesting question whether there are\nother string backgrounds for which new kind of noncommutative geometries arise.\nNow string in pp-wave is exactly solvable (at least in the GS formulation), and\nthere is a mass parameter m (see (3.2) below) in addition to α′. If we also turn on a\nB-field, then we have three dimensionful parameters at our disposal. It is therefore\nvery natural to consider a D-brane with a constant B-field sitting in the pp-wave\nbackground and check whether any new kind of quantum geometry arises, and to\nconsider the possible scaling limits in the low energy. This is the main motivation of\nour work.\nWe recall that from the point of view of [24, 26], noncommutative geometry on\nthe D-brane worldvolume is a direct consequence of the open string mixed boundary\ncondition that occurs due to the nonzero B-field. This gives rise to a noncommuta-\ntivity of the string zero mode xi0 among themselves, but leaves the momentum zero\nmode pi0 commuting among themselves. As it turns out, we will find that by turning\non a mass parameter m, pi0 also becomes noncommuting. Thus the phase space of\nthe zero modes x0, p0 becomes fully noncommuting, see (3.27)–(3.29). Moreover we\nfind that the noncommutativity depends on the lightcone momentum p+. This is one\nof the main results of this paper. Its physical meaning is intriguing and further un-\nderstanding of it will be important. An immediate consequence of the commutation\nrelations we obtain is that the spectrum of the lightcone Hamiltonian is modified in\na nontrivial manner by the B-field (see (3.40)). These are possible since p+ is central\nin the pp-wave supersymmetry algebra.\nThe paper is organized as follows. In section 2, we first present a D-brane config-\nuration that preserves half of the 32 supersymmetries. We show that it is allowed to\nput a constant B-field on its worldvolume. Section 3 is devoted to the quantization\nof the open string ending on this D-brane. In section 3.1, we construct the complete\nmode expansion of an open string ending on a D-brane with B-field in the pp-wave\nbackground. The zero mode part has a nontrivial dependence on the worldsheet σ-\ncoordinate (see (3.15)) and is more complicated than the case without B-field. Also\n2\nwe find that the zero mode frequency is affected by a constant background B-field,\nbut not for the higher oscillation modes. In section 3.2, we review the procedure\nfor determining the commutation relations of the theory. The starting point is the\nsymplectic form (3.22). We explain why it is consistent and use it to derive the basic\ncommutation relations (3.27)–(3.30) for the string modes. As a result of these com-\nmutation relations, the boundary commutators of the string coordinates and string\ncanonical momentum are modified, and only at the boundary, as in (3.45)–(3.47).\nThe spectrum of the lightcone Hamiltonian is obtained. As a consequence of these\ncommutation relations, we find that the spectrum of the nonzero modes depend on\nthe mode number n in a more complicated manner; we also noted an interesting\nsplitting in the zero mode spectrum, see (3.40). In section 3.3, we carry out the con-\nstrained quantization of Dirac and obtain the same result. In section 4, we discuss\nvarious scaling limits and discuss their physical meanings. We conclude the paper\nwith further discussions.\n2. BPS D-brane with B-field in pp-wave\nConsider a flat D-brane in the pp-wave background, with a constant B-field turned\non in its worldvolume. This is a BPS configuration preserving half of the 32 pp-wave\nsupersymmetries. This can be easily seen from the limiting procedure considered in\n[2, 3] that relate brane probe solution in AdS × S to brane probe solution in the\nPenrose-limited pp-wave or Minkowskian background. In this section, we will use\nthe κ-symmetric formulation of Dp-brane (see for example [27, 28, 29]) to show this\nexplicitly. It will also allow us to see how the D-brane is stuck at the origin from the\npoint of view of the Born-Infeld theory, see (2.21).\nGiven a D-brane probe, the surviving supersymmetries satisfies the condition\n(1− Γ)ξ = 0 (2.1)\nwhere Γ is a projector that depends on the details of the brane configuration. The\nexplicit form of Γ was obtained, for example, in [30], where it was shown that the\nBorn-Infeld field strength amounts to a relative rotation of the left and right moving\nfields. In order to be self contained, we recall that Γ is given by\nΓ = e−a\/2Γ′(0)e\na\/2, (2.2)\nwhere a is a matrix given below and\nΓ′(0) =\n{\n(Γ11)\np−2\n2 Γ(0) IIA,\n(σ3)\np−3\n2 iσ2 ⊗ Γ(0) IIB,\n(2.3)\nand\nΓ(0) =\n1\n(p+ 1)!\n√− detGǫ\ni1···ip+1∂i1X\nM1 · · ·∂ip+1XMp+1Γ′M1···Mp+1. (2.4)\n3\nAs usual, the matrix Γ′M1···Mp+1 is the antisymmetrized product of the Γ\n′\nMk\nwith the\nΓ′M being the 10 dimensional Γ-matrices in the coordinate basis defined by\nΓ′M := EM\nAΓA, (2.5)\nwhere the ΓA are flat space Γ-matrices. The metric Gij is the induced worldvolume\nmetric\nGij = ∂iX\nM∂jX\nNgMN . (2.6)\nTo define the matrix a appearing in (2.2) we need to introduce the modified 2-form\nfield strength F which is related to the Born-Infeld field strength F = dA by\nF = F − B, (2.7)\nwhere B is the pullback of the target space NS-NS 2-form potential to the worldvol-\nume. The matrix a depends only on the worldvolume Born-Infeld field strength and\nis given by\na =\n{−1\n2\nYjkγ\njkΓ11 IIA,\n1\n2\nYjkσ3 ⊗ γjk IIB, (2.8)\nthe γjk being worldvolume γ matrices,\nγi = ∂iX\nMΓ′M (2.9)\nand Y is a function of F . The relation in the frame basis of the worldvolume (hatted\nindices) is\nYjˆkˆ := tan\n−1Fjˆkˆ. (2.10)\nSpecifically, let us consider a Dp-brane spanning the directions (+,−, i2, · · · , ip),\nwhere X± = (X0 ± X9)\/√2 and (i2, · · · , ip) ∈ (1, · · · , 8). Denote the worldvolume\ncoordinates of the D-brane by (τ, ξk), k = 1, · · · , p. In the lightcone gauge,\nX+(τ, ξ) = p+τ. (2.11)\nWe also take the physical gauge\nX−(τ, ξ) = ξ1, X ik(τ, ξ) = ξk, k = 2, · · · , p. (2.12)\nThe transverse directions Xa(τ, ξ), then describe the embedding of the D-brane.\nWe will consider a constant B-field with nonvanishing components Bij, i, j ∈\n(1, · · · , 8). The pull-back B-field is the same as the target space components, and\ntherefore we will not distinguish them anymore. As for the pullback metric, we have\nGµν = G\n(0)\nµν + ∂µX\na∂νX\na, (2.13)\n4\nwhere G(0)µν is the metric\nG(0) =\n\n\n−u2 p+\np+ 0\n1l(p−1)×(p−1)\n\n , u2 := p+2 f2( p∑\ni=2\nξi 2 +Xa 2). (2.14)\nNow, it is easy to see that for a flat D-brane described by\nXa(τ, ξ) = const, (2.15)\nwe have\nΓ(0) = Γ+−i2···ip. (2.16)\nThis is independent of B and m and the D-brane preserves half supersymmetries.\nUsing the form of the killing spinor given in [1] and the fact that the brane is stuck\nat the origin (see (2.21) below), it is easy to check that Γ′(0) preserve half of the\nsupersymmetry for p = 3, 5, 7. This agrees with the open string analysis of [31] 1.\nBranes at angle [32] can be discussed similarly.\nFinally we check that the brane configuration satisfies the equations of motion.\nIn our case, since we are using the physical gauge, the equations of motion are derived\nfrom the gauge fixed form of the Dirac-Born-Infeld action, including the WZ-term,\nI =\n∫\ndp+1ξ\n√\n−det(G+ F) +\n∫\nC := IDBI + IWZ , (2.17)\nwhere Gµν is the induced worldvolume metric (2.13) in the physical gauge and C is\nthe pullback to the worldvolume of the RR 4-form potential. The inclusion of the\nWZ term is crucial in checking that the equation of motion is satisfied for brane\nconfigurations with nontrivial embeddings [33]. However for the trivial embedding\n(2.15), the WZ term does not play any role. The equation of motion reads\n∆−1∂µ (∆{(G+ F)−1 + (G−F)−1}µν∂νXa)−m2Xa = 0, (2.18)\n∂µ (∆{(G+ F)−1 − (G− F)−1}µν) = 0, (2.19)\nwhere\n∆ :=\n√\n− det(G+ F). (2.20)\nThe only constant solution of equation (2.18) is\nXa = 0. (2.21)\nThe absence of flat directions is because they are lifted by the potential well created\nby the mass term. Equation (2.21) implies that\nu2 = p+2 f2\np∑\ni=2\nξi 2. (2.22)\n1We thank Atish Dabholkar, Jaume Gomis and Shahrokh Parvizi for useful email exchanges.\n5\nNote that it is independent of neither τ nor ξ1. It is then easy to check that\nFij = const (2.23)\nis a solution to (2.19). Hence our claim is justified. In the following, we will turn to\nthe open string description for these D-branes. For simplicity, we will take the gauge\nF = B where A = 0.\n3. Noncommutative D-brane with B-field in pp-wave\nThe main objective of this paper is to work out the effects of B-field on the quan-\ntization of the open string theory ending on a D-brane in the pp-wave background.\nWe will carry out this analysis in the GS formulation.\n3.1 Open String Mode Expansion\nRecall that for a flat D-brane in Minkowskian spacetime, the open string GS action\nwas obtained from lightcone gauge fixing the covariant action [34], in which the\nlatter can be obtained by substituting in the superfield background that solves the\nIIB supergravity constraints. With a constant Bµν field turned on, it induces new\nnonzero components in the superfields Bµα and Bαβ . However these terms all cancel\nthemselves out in the action and the only effect is the addition of the usual bosonic\nB-field coupling to the target space [35]. A coupling to the fermionic spacetime\nvariables would arise only if B were not closed. It was also shown that one can\nuse the usual (ie. the one for B = 0) lightcone gauge fixing condition so long as\nB0µ = B9µ = 0 [35]. This is exactly the setting we considered in section 2.\nThe κ-symmetric formulation of closed string in pp-wave background was anal-\nysed in [5]. In the lightcone gauge, the theory is exactly solvable and consists of\neight massive bosons and fermions. Turing on the B-field, and carrying out a similar\nanalysis as in [5, 35], one finds that the open string has the bosonic action in the\nlightcone gauge,\nS =\n1\n4πα′\n∫\nd2σ[gij(η\nαβ∂αX\ni∂βX\nj +m2X iXj) + ǫαβ∂αX\ni∂βX\njBij ], (3.1)\nwhere i, j = 1, · · ·p, and B is turned on only in the directions 2, · · · , p. Following [7],\nwe have introduced the parameter\nm := α′p+f, (3.2)\nand we have taken the length of the σ-interval to be π; therefore strings with different\nlightcone momentum have differentm. We ignored the transverse coordinates in (3.1)\nsince the quantization of them is standard. The fermionic sector will not affect the\nresult and can be considered separately. We have introduced the Euclidean metric\n6\ngij for the sake of the scaling limits to be considered in the next section. Note that\nin our normalization, B,m are dimensionless. The equation of motion is\n(−∂2τ + ∂2σ −m2)X i = 0, (3.3)\nand the boundary condition is\n∂σX\ni + ∂τX\njBj\ni = 0 (3.4)\nat σ = 0, π. Indices i, j are raised and lowered by gij. The lightcone Hamiltonian is\n[5, 6]\nH =\n1\n4πα′p+\n∫ pi\n0\ndσ\n(\n(∂τX)\n2 + (∂σX)\n2 +m2X2\n)\n, (3.5)\nWe are interested in the effects of the constraint (3.4) to the quantization of the\ntheory. The situation is exactly the same as in [24]. The boundary condition (3.4)\nimplies that\n2πα′[P k(τ, 0), P j(τ, σ′)]Bk\ni = −∂σ[Xk(τ, σ), P j(τ, σ′)]σ=0 Mki, (3.6)\n2πα′[P k(τ, 0), Xj(τ, σ′)]Bk\ni = −∂σ[Xk(τ, σ), Xj(τ, σ′)]σ=0 Mki, (3.7)\nwhere P k is the conjugate momentum\n2πα′P k(τ, σ) = ∂τX\nk + ∂σX\njBj\nk, (3.8)\nand\nMk\ni = δk\ni − BkjBj i. (3.9)\nThese simple relations show that the standard canonical commutation relations for\nB = 0 [5] are no longer valid when B 6= 0.\nWithout loss of generality, we will assume the metric is already in the diagonal\nform\ngij = λδij. (3.10)\nIn addition we will consider the case in which the B-field takes the form\nBij =\n(\n0 B\n−B 0\n)\n, (3.11)\nand focus on X2, X3. We remark that the action (3.1) is SO(2) invariant, and so the\nangular momentum is conserved. The mode expansion takes the form\nX i = X i(0) +X\ni\n(1), (3.12)\n7\nwhere 2\nX i(0) = (x\ni\n0 cosω0τ + 2α\n′pi0\nsinω0τ\nω0\n) coshω0Bσ\n+(−2α′pj0 cosω0τ + xj0ω0 sinω0τ)Bj i\nsinhω0Bσ\nω0B\n, (3.15)\nis the “zero mode” part, and\nXk(1) =\n√\n2α′\n∑\nn 6=0\ne−iωnτ (i\nαkn\nωn\ncosnσ − α\nj\nn\nn\nBj\nk sin nσ), (3.16)\nis the nonzero mode part. The constant B\nB := B\/λ, (3.17)\nis the eigenvalue of the matrix Bi\nj ; and the frequencies are defined by\nω0 :=\nm√\n1 +B\n2\n> 0, and ωn := sign(n)\n√\nn2 +m2, n 6= 0. (3.18)\nA couple of remarks about the “zero modes” are in order. 1. By “zero modes”\nhere, we simply refer to the modes with the lowest frequency. We stress that the\nzero modes are very different in structure compared to the oscillation modes. One\nimportant difference between the zero mode part and the oscillation part is that the\nzero mode part X i(0) actually satisfies (3.3) and (3.4) for all 0 ≤ σ ≤ π. This is\nthe same as in the flat case (m = 0) [24]. 2. Note that the zero mode structure\nis more complicated than the B = 0 case, where X i(0) was simply independent of σ\n[5]. 3. In our expansion (3.15), the coefficients x0 and p0 are identified conveniently\nsuch that they have the correct dimensions. It is a simple choice and it is possible\nto rescale them by dimensionless factors. 4. Finally, we note that naively one may\nhave expected that, since turning on a constant B-field has no effect on the equation\nof motion (propagation), the zero mode will have the frequency m as in the B = 0\ncase [5]. However, it is easy to check that when B 6= 0, this frequency does not give\nrise to any solution that can satisfy both the equation of motion and the boundary\n2It is straightforward to extend the two dimensional case to the generic case. Assuming that\nBµν is invertible, we can always decompose it as U\nT bU by an orthogonal transformation U , where\nb is a matrix of diagonal blocks of the form (3.11). Then the zero mode solution is\nX i(0) = x\nj\n+\n(\nUT exp(+(ab−1τ − aσ))U)\nj\ni\n+ xj\n−\n(\nUT exp(−(ab−1τ − aσ))U)\nj\ni\n, (3.13)\nwhere the matrix a is a diagonal matrix defined by\na2 =\nm2\n1− b−2 . (3.14)\nNote that a is well defined by this relation because b−2 is diagonal with negative entries,\n8\ncondition. The modification of the zero mode frequency by the external B-field\nthrough the boundary condition is an interesting effect. We recall that in the flat\ncase for a neutral string, turning on a B-field does not change the mode frequency. In\nthe case of a charged string [36], all the frequencies are modified by the background\nfield. Our case here is intermediate, turning on a B-field only modify the zero mode\nfrequency. This is another difference between the zero modes and the oscillation\nmodes.\nThe canonical momentum also splits into a sum\nP k = P k(0) + P\nk\n(1) (3.19)\nof the the zero mode part\n2πα′P k(0) = (−xj0ω0 sinω0τ + 2α′pj0 cosω0τ)Mjk coshω0Bσ\n+(2α′pj0 sinω0τ + x\nj\n0ω0 cosω0τ)(Bg\n−1M)j\nk sinhω0Bσ\nB\n, (3.20)\nand the nonzero mode part\n2πα′P k(1) =\n√\n2α′\n∑\nn 6=0\ne−iωnτ (αjnMj\nk cos nσ + i\nm2\nnωn\nαjnBj\nk sinnσ). (3.21)\nNote that (3.15), (3.16), (3.21) and (3.20) reduce smoothly to the usual flat space\nexpressions in the limit m→ 0.\n3.2 Open String Quantization in pp-wave with B-field\nTo quantize the theory we will follow the procedure adopted in [24, 26], where in-\nterpretations in terms of noncommutative geometry were emphasised. This method\nis equivalent to the canonical quantization performed in [36]. That paper also gave\nthe first instance demonstrating how noncommutativity of the zero modes can arise\nin the presence of a background field. Its physical implications had been studied in\n[36, 37].\nFirst we need the symplectic form\nΩ =\n∫ pi\n0\ndσgijdP\nidXj . (3.22)\nThat this is the correct symplectic form of the theory can be justified from an analysis\nof the constraint structure of the theory. Without going into the details, one can\nalready see this since the constraint (3.4) is imposed only at the boundary. It is clear\nthat the constrained quantization method will give a Dirac bracket which is modified\nand is possibly different from the original Poisson bracket only at the boundary. (We\nwill present the constrained quantization in the next subsection.) This is a measure\nzero set and so the symplectic form takes the standard form (3.22).\n9\nOf course this doesn’t mean that the commutation relations of the theory are\nunmodified. This is felt through the modified form of the mode expansion (3.15),\n(3.16), (3.20)and (3.21). By substituting in the mode expansions (3.12) and (3.19)\nand evaluate the σ integral, the symplectic form (3.22) of the theory can be thought\nof as the symplectic form defined for the string modes. This procedure is consistent\nsince, using (3.3) and (3.4), it is easy to check that (3.22) is independent of τ [38]. As\na result, one can take the resulting expression as the symplectic form for the string\nmodes. The commutation relation of the string modes can be then obtained from\n(3.22) by inverting the symplectic matrix.\nExplicitly we obtain the following symplectic form for the string modes\n2πα′Ω = 2α′c˜ Mijdp\ni\n0dx\nj\n0 −\nω0c\n2B\n(Mg−1B)ijdx\ni\n0dx\nj\n0 − (2α′)2\nc\n2ω0B\n(Mg−1B)ijdp\ni\n0dp\nj\n0\n+i2πα′\n∞∑\nn=1\nMnij\nωn\ndαindα\nj\n−n, (3.23)\nwhere the “metric” Mnij is defined by\nMnij := gij −\nω2n\nn2\n(Bg−1B)ij. (3.24)\nNote that Mnij = Mij only when m = 0. The constants c, c˜ are defined by\nc = (cosh(2πω0B)− 1)\/(2ω0B) ≈ π2ω0B + · · · , (3.25)\nc˜ = sinh(2πω0B)\/(2ω0B) ≈ π + · · · . (3.26)\nThe ≈ above gives the leading order expansion in the small m limit. Following [25].\nwe have been careful in keeping the metric dependence to facilitate the discussion of\nscaling limits. This will be done in the next section.\nInverting the symplectic matrix, we obtain the following commutation relations\nfor the zero modes and for the oscillation modes\n[xi0, p\nj\n0] = i(M\n−1)ij\nπω0B\ntanh πω0B\n, (3.27)\n[xi0, x\nj\n0] = i2πα\n′(g−1BM−1)ij, (3.28)\n[pi0, p\nj\n0] = i\nπω20\n2α′\n(g−1BM−1)ij, (3.29)\n[αin, α\nj\ns] = ωnM\nij\nn δn+s, (3.30)\nwhere\nM ijn = (\n1\ng + ωn\nn\nB\ng\n1\ng − ωn\nn\nB\n)ij (3.31)\nis the inverse of Mnij for each fixed n. It represents a metric that is mode-dependent.\nThis is in contrast with the flat case, where it was found that [24] the oscillator’s\n10\ncommutation relations are determined by the same open string metric M ij as the\nzero modes. Here we find that each level of the oscillators see a different metric. A\nconsequency of this is the more complicated n-dependence in the spectrum of the\nHamiltonian (3.40). It may be interesting to investigate to what extent one can think\nof M ijn as a mode-dependent open-string metric. Note that in the form (3.10) of the\nmetric,\nM ijn = g\nij(1 +\nω2n\nn2\nB\n2\n)−1 (3.32)\nis diagonal and is a monotonic increasing function of n which is bounded above by\nM ij . Note also that by turning on the mass parameter m, pi0 also become noncom-\nmuting themselves; and the phase space of x0, p0 becomes fully noncommuting. The\nnoncommutative parameters depends on the background of the pp-wave, and on the\nlightcone momentum p+.\nIn the above, we have considered a single string with a single p+. If one wants\nto perform calculations with many string states, then it will be useful to introduce\na basis of oscillators whose commutation relations are independent of p+. For the\nnonzero modes, we can introduce the following basis of oscillators\nain :=\n√√√√1 + ω2nn2B2\nωn\/λ\nαi−n, a¯\ni\nn :=\n√√√√1 + ω2nn2B2\nωn\/λ\nαin, n > 0. (3.33)\nThey obey the relations\n[a¯in, a\nj\ns] = δ\nijδns , [a\ni\nn, a\nj\ns] = 0. (3.34)\nNote the B-dependence in the rescaling. For the zero mode, one may define\nai0 :=\nw\n2\n(xi0 − i\n2α′pi0\nω0\n), a¯i0 := (a\ni\n0)\n†\n, with w :=\n√√√√λm2\nα′ω0\ntanhπBω0\nπBω0\n, (3.35)\nin terms of which the commutation relations (3.27)–(3.29) take the simple form of a\ndeformed oscillator algebra\n[a¯i0, a\nj\n0] = δ\nij + iǫij · tanh πBω0 , [ai0, aj0] = 0, (3.36)\nwhich is SO(2) invariant. Or one may introduce\na± :=\na10 ± ia20√\n2(1∓ tanhπB¯ω0)\n, a¯± := (a±)\n†, (3.37)\nwhich obey the U(1) invariant commutation relations\n[a¯A, aB] = δAB, [aA, aB] = 0, A,B = +,−. (3.38)\n11\nIn terms of them, the zero mode part of the string coordinates can be written\nas, for example,\nX i(0) =\neiω0τ\nw\n(ai0 coshω0Bσ − iaj0Bji\nsinhωBσ\nB\n) + h.c. . (3.39)\nThe lightcone Hamiltonian (3.5) takes the diagonal form\nH =\nω0 cosh\n2 πBω0\np+\n(\n(1− tanhπBω0)a+a¯+ + (1 + tanhπBω0)a−a¯− + 1\n)\n+\n1\np+\n∞∑\nn=1\n1 +B\n2\n1 + ω\n2\nn\nn2\nB\n2 ωna\ni\nna¯\ni\nn , (3.40)\nwhere we have written the Hamiltonian in a normal ordered form, and have dropped\nthe infinite additive constant arising from the nonzero modes. This will be cancelled\nwith the fermionic oscillators [7]. The factor 1 in (3.40) came from the normal\nordering of the zero mode oscillator a± and remember that we are considering two\nstring coordinates X2,3.\nThe Fock vacuum of the theory is defined by\na¯±|0〉 = 0, a¯in|0〉 = 0, n > 0. (3.41)\nIt is SO(2) invariant. In choosing the definition of the vacuum, we have been guided\nby the requirement of SO(2) invariance of the theory. Turning on a B-field in the 2–3\ndirections preserve this symmetry. Note that the spectrum for the nonzero modes\ndepend on n in a more complicated way due to B 6= 0. Note also that the degeneracy\nof the states a±|0〉 is lifted when B 6= 0. We expect that this splitting of the string\nspectrum to have interesting physical consequences.\nFinally we derive the intrinsic commutation relations of the theory in terms of\nX i and P i. Using the relations above, one can easily obtain\n[X i(τ, σ), Xj(τ, σ′)] = i2πα′Bijf(σ + σ′), (3.42)\nwhere the function f(σ) is defined on σ ∈ [0, 2π] as\nf(σ) :=\n1\nc\n[c cosh(ω0Bσ)− c˜ sinh(ω0Bσ)]− 2\nπ\n∞∑\nn=1\n1\nn\n(1 +\nω20B\n2\nn2\n)−1 sinnσ. (3.43)\nIt is easy to show that\nf(σ) = (1 +B\n2\n)−1 ×\n\n\n+1, σ = 0,\n−1, σ = 2π,\n0, 0 < σ < 2π.\n(3.44)\n12\nThus the commutation relation of X is\n[X i(τ, σ), Xj(τ, σ′)] = i2πα′(g−1BM−1)ij ×\n\n\n1, σ = σ′ = 0,\n−1, σ = σ′ = π,\n0, otherwise.\n(3.45)\nand is modified only at the endpoints of the open string. The commutator for P\nthemselves can be similarly computed and we obtain\n[P i(τ, σ), P j(τ, σ′)] = i\nm2\n2πα′\n(1 +B\n2\n)Bijf(σ + σ′).\nThus both commutators are given in terms of the same function f . As a result, we\nfind\n[P i(τ, σ), P j(τ, σ′)] = i\nm2\n2πα′\nBij ×\n\n\n+1 , σ = σ′ = 0,\n−1 , σ = σ′ = π,\n0, otherwise.\n(3.46)\nIt is intriguing that the commutation relations for the endpoint momentum are non-\ntrivial. Note also it dependent on the parameter m = α′p+f in a nontrivial way. This\nis a new feature of the pp-wave background: the noncommutative space felt by a\nstring depends on its light-cone momentum. Finally we obtain\n[X i(τ, σ), P j(τ, σ′)] = i\ngij\nπ\n(1 +\n∑\nn 6=0\ncosnσ cosnσ′). (3.47)\nNote that (3.45) and (3.47) take exactly the same form as in the flat case [24] and\nis unmodified by m. Also note that, unlike the relations for the zero modes, the\nrelations (3.45)–(3.47) are intrinsic and is independent of how the zero modes are\nidentified, nor how the vacuum is chosen.\n3.3 Constrained Quantization\nIn this subsection, we present the construction of the Dirac bracket following the\nprocedure in [26]. To start with, the standard Poisson bracket is [5]\n(X i(σ), Pj(σ\n′)) = δijδ(σ, σ\n′), (Pi(σ), Pj(σ\n′)) = 0, (X i(σ), Xj(σ′)) = 0. (3.48)\nAs first noted in [24], the boundary condition can be treated as a constraint on the\nphase space\nΦi(0) = Φi(π) = 0, (3.49)\nwhere we have introduced\nΦi(σ) := 2πα′P jBj\ni + ∂σX\njMj\ni. (3.50)\nUsing the lightcone Hamiltonian (3.5) one determines the complete set of second\nclass constraints\n∂2nσ Φ\ni(σ) = 0, ∂2nσ Ψ\ni(σ) = 0, n = 0, 1, · · · , (3.51)\n13\nwhere\nΨi(σ) := ∂σP\ni − m\n2\n2πα′\nXjBj\ni. (3.52)\nWe will denote them by φ(αkn), α = 1, 2; k = 2, · · · , p; n = 0, 1, · · ·,\nφ(1kn) = ∂2nσ Φ\nk, φ(2kn) = ∂2nσ Ψ\nk. (3.53)\nThese constraints are consistent with the explicit mode expansion of the fields X i\nand P i given above.\nThe Poisson matrix C(αkn)(βlm) of the constraints can be computed easily. The\nbasic ones are the C(αk0)(βl0) ’s :\n(Φk(σ),Φl(σ′)) = 2πα′(BM)kl[∂σδ(σ, σ\n′) + ∂σ′δ(σ\n′, σ)], (3.54)\n(Φk(σ),Ψl(σ′)) = Mkl∂σ∂σ′δ(σ, σ\n′) +m2(B2)klδ(σ, σ′), (3.55)\n(Ψk(σ),Ψl(σ′)) =\nm2\n2πα′\nBkl[∂σδ(σ, σ\n′) + ∂σ′δ(σ\n′, σ)] (3.56)\nand in general\nC(αkn)(βlm)(σ, σ′) = (φ(αkn)(σ), φ(βlm)(σ′)) = ∂2nσ ∂\n2m\nσ′ C\n(αk0)(βl0)(σ, σ′). (3.57)\nThe Dirac bracket is given by\n(A(σ), B(σ′))∗ = (A(σ), B(σ′))\n− ∑\nσ′′σ′′′\n(A(σ), φ(αkn)(σ\n′′\n))C(αkn)(βlm)(σ\n′′\n, σ\n′′′\n)(φ(βlm)(σ\n′′′\n), B(σ′)),\n(3.58)\nwhere the sum σ′′, σ′′′ is over the endpoints 0, π. As in [26], the Dirac bracket\ncan be computed similarly without knowing the explicit form of the inverse matrix\nC(αkn)(βlm). Only its defining properties are needed. We find the results (3.45)–(3.47).\nIn particular we note that the σ, σ′ dependent part of the right hand side of (3.54)\nand (3.56) are identical and this accounts for the fact that the commutators (3.45)\nand (3.46) are both given by the same function f(σ + σ′).\n4. Scaling Limits\nIn this section, we will consider scaling limits of α′, B,m such that the commuta-\ntion relations (3.27)–(3.29) remain nontrivial. In these limits the noncommutative\nalgebra should play a role in the D-brane physics. We remark that one can equiva-\nlently perform the limits on (3.38) for the variables ai0’s. Here we choose to consider\nthe variables xi0, p\ni\n0 since we would like to explore and develop possible geometrical\ninterpretations.\n14\n4.1 Small B-Field Limit\nThe DBI action is exact to all orders in α′ [39] for the U(1) gauge field F . Here\nwe prefer to think of it as a consequence of supersymmetry (see, for example [27,\n28, 29]). For small B-field, it should be possible to check that the DBI action on\npp-wave background is equivalent to the DBI action on the noncommutative space\nwithout B-field for slowly varying fields, in a similar way as it was checked for the flat\nbackground [25]. This match may provide some hint for the appropriate description\nof the noncommutative space. A particularly interesting limit is to go to the infinite\nmomentum frame and take a small B-field simultaneously:\nB ∼ ǫ2, m ∼ 1\/ǫ, gij, α′ fixed. (4.1)\nThe commutation relations (3.27)–(3.29) become\n[xi0, p\nj\n0] = ig\nij, (4.2)\n[xi0, x\nj\n0] = i2πα\n′Bij , (4.3)\n[pi0, p\nj\n0] = i\nπm2\n2α′\nBij . (4.4)\nIn this limit the coordinates noncommutativity can be treated perturbatively, but\nthe description of the momentum noncommutativity has to be exact. This limit\nis interesting since the p+ dependence has essentially disappeared because one can\ntreat all the strings to have the same lightcone momentum in the leading order\napproximation. It would be interesting to study the corresponding large N matrix\nmodel.\n4.2 Large B-Field Limit: Deformed Phase Space\nWhen m = 0, all the excited modes can be ignored in the limit α′ → 0. And we only\nneed to consider the zero modes for the low energy effective theory. Moreover, if we\nalso take the large B-field limit [25] of Seiberg and Witten :\nα′ ∼ ǫ1\/2, gij ∼ ǫ, B ∼ ǫ−1\/2, (4.5)\nthen a noncommutative theory is obtained with M (3.9) and the noncommutativity\nparameter\nθij := 2πα′(g−1BM−1)ij =\n2πbij\nb2\n(4.6)\nfixed and finite in the limit. To facilitate the comparison, our Bij is related to the\ndimensionful bij of Seiberg-Witten [25] by Bij = α\n′bij . Hence B = α\n′b\/λ ∼ ǫ−1\/2 as\nb is fixed.\nHowever, for m 6= 0, the zero mode frequency ω0 is of the same order of mag-\nnitude as the oscillator modes, and the ratio ω0\/ω1 is finite in the limit α\n′ → 0.\n15\nTherefore generally we cannot ignore the higher frequency modes unless we take\nanother suitable limit at the same time. It is easy to see that for fixed m, the\nSeiberg-Witten limit (4.5) does the job. It sends ω0 ∼ ǫ1\/2 while keeping ωn 6=0 fixed.\nThe zero modes commutation relations take the form\n[xi0, p\nj\n0] = i h\nij, (4.7)\n[xi0, x\nj\n0] = i θ\nij , (4.8)\n[pi0, p\nj\n0] = i κ\nij. (4.9)\nwhere θij is given by (4.6) and\nhij :=\nλ\nα′2b2\nπm\ntanh πm\nδij, κij :=\nλ2m2\n4α′4b2\nθij (4.10)\nare fixed and finite in the limit. Note that θ has dimension (length)2 and κ has\ndimension (length)−2. Note also that the reason that κ ∝ θ is because here we are\ndealing with 2-dimensions only. This will not be the case if we consider a higher rank\nB-field.\nThe commutation relations (4.7)–(4.9) are intriguing. They represent a phase\nspace with a fully noncommutative structure. If m is zero, we go back to the usual\ncase of a theory defined on a noncommutative manifold. For m 6= 0, a deformed\nphase space emerges with the noncommutativity parameters θij and κij . Moreover\nthese parameters depends on the pp-wave background and the string momentum. It\nwill be very interesting to understand the implications of this.\nAs a simpler question, one can momentarily forget about the string embedding\nand consider simply the physics of the noncommutative phase space by itself. Since\nthe phase space is fully noncommutative in terms of these variables x0, p0, the usual\nformulation of quantum field theory using a momentum representation will have to\nbe examined. We will call a phase space which satisfies the relations (4.7)–(4.9) (not\nnecessarily with κ ∝ θ) a deformed phase space. It will be very interesting to try to\nconstruct a field theory which represents the structure of this deformed phase space.\n5. Discussions\nIn this paper, we presented the quantization of the open string ending on a D-brane\nin pp-wave background with a constant B-field. We found that, due to the combined\neffects of the B-field and the mass parameter, the noncommutative structure of the\ntheory takes on a new form. Compared with the case of a noncommutative D-brane\nin a flat background, the novelty of the noncommutative algebra we obtained in\nthis paper is the noncommutativity of the linear momentum: (3.46) at the level of\nthe string coordinates, and (3.29) at the level of the zero modes. And moreover\nthe boundary commutation relations depend on the lightcone momentum p+ of the\n16\nstring. In fact, the momentum is also noncommutative for charged open strings, and\nsimilarly, for open strings with their endpoints ending on different D-branes with\ndifferent background fields F . Since no state can be a simultaneous eigenstate for all\ncomponents of the momentum, it is unclear whether one can use the usual Fourier\nanalysis to define the ∗-product as before. (See [40] for a proposal for the case of\nopen strings ending on D-branes with different backgrounds.) Furthermore, in all of\nthese cases, the linear momentum is not a conserved quantity. Rather, the angular\nmomentum is conserved. It would be very interesting if this leads to a new class of\nnoncommutative field theories and to investigate their properties.\nAs in the neutral case, the novelty of the noncommutativity resides in the zero\nmodes sector. In the neutral string case, the effect of noncommutativity of the\nzero modes in the operator formalism was noticed in [35]. This led directly to the\nconstruction of the general multiloop amplitudes for a noncommutative open string\nusing the Reggeon formalism [41]. In the charged string case, the noncommutativity\nof the zero modes played an important role in the determination of the charged\nstring spectrum [36] and the partition function [37]. Moreover the charged string\npropagator has been constructed [42] which utilized essentially the noncommutativity\nof the zero modes. Aspects in the understanding of the charged string interaction\nwere recently made in [43]. In our present case, we have determined some immediate\nphysical effects of the commutation relations we obtained in this paper. In terms\nof the oscillator algebra, (3.34), (3.36) or (3.38), it implies a splitting in the zero\nmode spectrum. It also implies a more complicated mode number dependence of\nthe nonzero mode spectrum. Written in terms of the phase space variables, the zero\nmodes noncommutativity takes the form (3.27)–(3.29) generically depending on the\nlightcone momentum of the string and is thus, in some sense, probe dependent. This\nis an interesting phenomena. A probe dependent phase space may sound strange.\nHowever if geometry can be probe dependent (see for example [44] for an introduction\nto various aspects of quantum geometry), it may not be unnatural to expect an\nextension to that of a probe dependent phase space. This is a fundamental problem.\nWe have not understood its significance. However it is an intriguing possibility.\nAlthough our results were derived in a background without gravity, it is conceivable\nthat quantum gravity at the Planck scale may also involve a similar problem, and\ntherefore lessons that can be drawn from this construction should be helpful.\nNaively, the commutation relations of the deformed phase space lead to the phase\nspace uncertainty relations\n∆xi∆pj ∼ |hij |, ∆xi∆xj ∼ |θij |, ∆pi∆pj ∼ |κij|. (5.1)\nAlong the lines of [45], this might be used to generalize the spacetime uncertainty\nrelations of Yoneya (see [46] for a review and further references). It would be interest-\ning to see how string dualities may put constraints (e.g. string coupling dependence\n[45]) on the forms of these phase space uncertainty relations. We remark that (5.1)\n17\ndoes not fall into the classification of quantum spacetime of [47]. It would be inter-\nesting to investigate what kinds of assumptions on the quantum phase space could\nlead to the above uncertainty relations.\nDue to the p+-dependence in some of our commutation relations, it is not clear\nwhether one can apply the Mandelstam lightcone formalism. It is important to\nunderstand this issue.\nAssuming we can overcome the problem discussed above and have gained suffi-\ncient control over string scattering in the GS formulation, it will also be very inter-\nesting to understand the results obtained in this paper, particularly the momentum\nnoncommutativity, in the approach of Schomerus [48]. This will be useful for the\nunderstanding of the properties of the D-brane low energy theory.\nAcknowledgments\nCSC thanks Simon Ross for helpful discussions and Rodolfo Russo for useful com-\nments. The work of CSC was supported in part by the Nuffield Foundation, Grant\nNumber NUF-NAL\/00445\/G. The work of PMH is supported in part by the National\nScience Council, the Center for Theoretical Physics at National Taiwan University,\nthe National Center for Theoretical Sciences, and the CosPA project of the Ministry\nof Education, Taiwan, R.O.C.\nReferences\n[1] M. Blau, J. Figueroa-O’Farrill, C. Hull and G. Papadopoulos, “A new maximally\nsupersymmetric background of IIB superstring theory,” JHEP 0201 (2002) 047, hep-\nth\/0110242.\n[2] M. Blau, J. Figueroa-O’Farrill, C. Hull and G. Papadopoulos, “Penrose limits and\nmaximal supersymmetry,” hep-th\/0201081.\n[3] M. Blau, J. Figueroa-O’Farrill and G. Papadopoulos, “Penrose limits, supergravity\nand brane dynamics,” hep-th\/0202111.\n[4] R. Penrose, “Any Spacetime has a plane wave limit”, in Differential Geometry and\nRelativity, Riedel, Dordrecht, 1976.\n[5] R. R. Metsaev, “Type IIB Green-Schwarz superstring in plane wave Ramond-Ramond\nbackground,” Nucl. Phys. B 625 (2002) 70, hep-th\/0112044.\n[6] R. R. Metsaev and A. A. Tseytlin, “Exactly solvable model of superstring in plane\nwave Ramond-Ramond background,” hep-th\/0202109.\n[7] J. G. Russo and A. A. Tseytlin, “On solvable models of type IIB superstring in NS-NS\nand R-R plane wave backgrounds,” hep-th\/0202179.\n[8] M. Billo’ and I. Pesando, “Boundary states for GS superstrings in an Hpp wave back-\nground,” hep-th\/0203028.\n[9] J. Maldacena, “The Large N Limit of Superconformal Field Theories and Supergrav-\nity”, Adv. Theor. Math. Phys. 2 (1998) 231, hep-th\/9711200.\n18\n[10] D. Berenstein, J. Maldacena and H. Nastase, “Strings in flat space and pp waves from\nN = 4 super Yang Mills,” hep-th\/0202021.\n[11] N. Itzhaki, I. R. Klebanov and S. Mukhi, “PP wave limit and enhanced supersymmetry\nin gauge theories,” hep-th\/0202153.\n[12] J. Gomis and H. Ooguri, “Penrose limit of N = 1 gauge theories,” hep-th\/0202157.\n[13] L. A. Zayas and J. Sonnenschein, “On Penrose limits and gauge theories,” hep-\nth\/0202186.\n[14] M. Alishahiha and M. M. Sheikh-Jabbari, “The PP-wave limits of orbifolded\nAdS(5)xS**5,” hep-th\/0203018.\n[15] N. Kim, A. Pankiewicz, S. J. Rey and S. Theisen, “Superstring on PP-Wave Orbifold\nfrom Large-N Quiver Gauge Theory,” hep-th\/0203080.\n[16] M. Cvetic, H. Lu and C. N. Pope, “Penrose limits, pp-waves and deformed M2-branes,”\nhep-th\/0203082.\n[17] T. Takayanagi and S. Terashima, “Strings on orbifolded pp-waves,” hep-th\/0203093.\n[18] U. Gursoy, C. Nunez and M. Schvellinger, “RG flows from Spin(7), CY 4-fold and HK\nmanifolds to AdS, Penrose limits and pp waves,” hep-th\/0203124.\n[19] E. Floratos and A. Kehagias, “Penrose Limits of Orbifolds and Orientifolds,” hep-\nth\/0203134.\n[20] R. Gueven, ”Randall-Sundrum Zero Mode as a Penrose Limit”, hep-th\/0203153.\n[21] S.R. Das, C. Gomez, S-J Rey, ”Penrose limit, Spontaneous Symmetry Breaking and\nHolography in PP-Wave Background”, hep-th\/0203164.\n[22] A. Connes, M. R. Douglas and A. Schwarz, “Noncommutative geometry and matrix\ntheory: Compactification on tori,” JHEP 9802 (1998) 003, hep-th\/9711162.\n[23] M. R. Douglas and C. M. Hull, “D-branes and the noncommutative torus,” JHEP\n9802 (1998) 008, hep-th\/9711165.\n[24] C. S. Chu and P. M. Ho, “Noncommutative open string and D-brane,” Nucl. Phys. B\n550 (1999) 151, hep-th\/9812219;\n[25] N. Seiberg and E. Witten, “String theory and noncommutative geometry,” JHEP\n9909 (1999) 032, hep-th\/9908142.\n[26] C. S. Chu and P. M. Ho, “Constrained quantization of open string in background B\nfield and noncommutative D-brane,” Nucl. Phys. B 568 (2000) 447, hep-th\/9906192.\n[27] M. Aganagic, C. Popescu and J. H. Schwarz, “D-brane actions with local kappa sym-\nmetry,” Phys. Lett. B 393 (1997) 311, hep-th\/9610249; “Gauge-invariant and gauge-\nfixed D-brane actions,” Nucl. Phys. B 495 (1997) 99, hep-th\/9612080.\n[28] M. Cederwall, A. von Gussich, B. E. Nilsson, P. Sundell and A. Westerberg, “The\nDirichlet super-p-branes in ten-dimensional type IIA and IIB supergravity,” Nucl.\nPhys. B 490 (1997) 179, hep-th\/9611159.\n[29] E. Bergshoeff and P. K. Townsend, “Super D-branes,” Nucl. Phys. B 490 (1997) 145,\nhep-th\/9611173.\n19\n[30] E. Bergshoeff, R. Kallosh, T. Ortin, G. Papadopoulos, “Kappa-Symmetry, Supersym-\nmetry and Intersecting Branes,” Nucl.Phys. B502 (1997) 149, hep-th\/9705040.\n[31] A. Dabholkar and S. Parvizi, “Dp branes in pp-wave background,” arXiv:hep-\nth\/0203231.\n[32] M. Berkooz, M. R. Douglas and R. G. Leigh, “Branes intersecting at angles,” Nucl.\nPhys. B 480 (1996) 265, hep-th\/9606139.\n[33] A. Bilal and C. S. Chu, “D3 brane(s) in AdS(5) x S(5) and N = 4,2,1 SYM,” Nucl.\nPhys. B 547 (1999) 179, hep-th\/9810195.\n[34] M.B. Green, M. Gutperle, “Light-Cone Supersymmetry and D-branes,” Nucl.Phys.\nB476 (1996) 484, hep-th\/9604091.\n[35] C. S. Chu and F. Zamora, “Manifest supersymmetry in non-commutative geometry,”\nJHEP 0002 (2000) 022, hep-th\/9912153.\n[36] A. Abouelsaood, C. G. Callan, C. R. Nappi and S. A. Yost, “Open Strings In Back-\nground Gauge Fields,” Nucl. Phys. B 280, 599 (1987).\n[37] C. Bachas and M. Porrati, “Pair creation of open strings in an electric field,” Phys.\nLett. B 296 (1992) 77, hep-th\/9209032.\n[38] C. S. Chu, ”Noncommutative open string: Neutral and charged,” hep-th\/0001144.\n[39] E. S. Fradkin and A. A. Tseytlin, “Nonlinear Electrodynamics From Quantized\nStrings,” Phys. Lett. B 163 (1985) 123.\n[40] K. Dasgupta and Z. Yin, “Non-Abelian geometry,” hep-th\/0011034.\n[41] C. S. Chu, R. Russo and S. Sciuto, “Multiloop string amplitudes with B-field and\nnoncommutative QFT,” Nucl. Phys. B 585 (2000) 193, hep-th\/0004183.\n[42] L. Dolan and C. R. Nappi, “A scaling limit with many noncommutativity parameters,”\nPhys. Lett. B 504 (2001) 329, hep-th\/0009225.\n[43] C. S. Chu, R. Russo and S. Sciuto, “Remarks on the calculations of charged open\nstring amplitudes: The 1-loop tadpole,” hep-th\/0201118.\n[44] B. R. Greene, “Lectures on quantum geometry,” Nucl. Phys. Proc. Suppl. 41 (1995)92.\n[45] C. S. Chu, P. M. Ho and Y. C. Kao, “Worldvolume uncertainty relations for D-branes,”\nPhys. Rev. D 60 (1999) 126003, hep-th\/9904133.\n[46] T. Yoneya, “String theory and space-time uncertainty principle,” Prog. Theor. Phys.\n103 (2000) 1081, hep-th\/0004074.\n[47] S. Doplicher, K. Fredenhagen and J. E. Roberts, “The Quantum structure of space-\ntime at the Planck scale and quantum fields,” Commun. Math. Phys. 172 (1995)187.\n[48] V. Schomerus, “D-branes and deformation quantization,” JHEP 9906 (1999) 030,\nhep-th\/9903205.\n20\n"}