{"doi":"10.1520\/JAI12547","coreId":"140492","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1707","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1707","10.1520\/JAI12547"],"title":"An Integrated Approach to the Determination and Consequences of Residual Stress\non the Fatigue Performance of Welded Aircraft Structures.","authors":["Edwards, L.","Fitzpatrick, M. E.","Irving, Phil E.","Sinclair, I.","Zhang, X.","Yapp, David"],"enrichments":{"references":[{"id":37941314,"title":"8 ISO\/TTA 3:200I, “Polycrystalline Materials—Determination of Residual Stresses by","authors":[],"date":"2002","doi":null,"raw":"8 ISO\/TTA 3:200I, “Polycrystalline Materials—Determination of Residual Stresses by Neutron Diffraction.” 9 Stelmukh, V., Edwards, L., Santisteban, J. R., Ganguly, S., and Fitzpatrick, M. E., “Weld Stress Mapping Using Neutron and Synchrotron X-Ray Diffraction,” Mater. Sci. Forum 404–407, 599–604 2002.","cites":null},{"id":37941315,"title":"A Fully Reﬁned Diffractometer Designed Speciﬁcally for the Measurement of","authors":[],"date":"2004","doi":"10.1080\/00323910490970573","raw":"10 Daymond, M. R. and Edwards, L., “A Fully Reﬁned Diffractometer Designed Speciﬁcally for the Measurement of Stress,” Neutron News 15, 24–29 2004.","cites":null},{"id":37941323,"title":"Damage Tolerance and Fail Safety of Welded Aircraft Wing Panels,”","authors":[],"date":"2005","doi":"10.2514\/1.10275","raw":"20 Zhang, X. and Li, Y., “Damage Tolerance and Fail Safety of Welded Aircraft Wing Panels,” AIAA J. 437, 1613–1623 2005. EDWARDS ET AL. ON RESIDUAL STRESS 17","cites":null},{"id":37941309,"title":"Fatigue Crack\/Residual Stress Field Interactions and Their Implications for Damage-Tolerant Design,”","authors":[],"date":"1998","doi":"10.1361\/105994998770347918","raw":"2 Fitzpatrick, M. E. and Edwards, L., “Fatigue Crack\/Residual Stress Field Interactions and Their Implications for Damage-Tolerant Design,” J. Mater. Eng. Perform. 72, 190–198 1998.","cites":null},{"id":37941316,"title":"Full Stress Tensor Determination in a Textured Aerospace Aluminium Alloy Plate Using Synchrotron X-Ray Diffraction,” Textures Microstruct.","authors":[],"date":"2003","doi":"10.1080\/07303300310001628607","raw":"11 Stelmukh, V., Edwards, L., and Ganguly, S., “Full Stress Tensor Determination in a Textured Aerospace Aluminium Alloy Plate Using Synchrotron X-Ray Diffraction,” Textures Microstruct. 353–4, 175–183 2003.","cites":null},{"id":37941313,"title":"International Space Station-Welding Will Be Out of This world,”","authors":[],"date":"1996","doi":null,"raw":"6 Woodward, H., “International Space Station-Welding Will Be Out of This world,” Weld. J. (Miami, FL, U. S.) 753,3 4 –40 1996.","cites":null},{"id":37941321,"title":"Investigation of Small Fatigue Cracks.","authors":[],"date":"1994","doi":"10.1016\/0956-7151(94)90160-0","raw":"18 Edwards, L. and Zhang, Y. H., “Investigation of Small Fatigue Cracks. II. A Plasticity Based Model of Small Fatigue Crack Growth,” Acta Metall. Mater. 424, 1423–1431 1994.","cites":null},{"id":37941320,"title":"Micromechanical Aspects of Fatigue in a","authors":[],"date":"2005","doi":"10.1016\/j.msea.2005.02.051","raw":"17 Lefebvre, F., Ganguly, S., and Sinclair, I., “Micromechanical Aspects of Fatigue in a MIG Welded Aluminium Airframe Alloy,” Mater. Sci. Eng., A 397, 338–354 2005.","cites":null},{"id":37941310,"title":"New Trends in Welding in the Aeronautic Industry,”","authors":[],"date":"2000","doi":null,"raw":"3 Mendez, P. F., “New Trends in Welding in the Aeronautic Industry,” Proceedings of the Conference “New Trends for the Manufacturing in the Aeronautic Industry,” Publ. Hegan\/Inasmet, San Sebastian, Spain, 2000.","cites":null},{"id":37941317,"title":"Optimizing Neutron Strain Scanning by the Use","authors":[],"date":"2002","doi":null,"raw":"13 Stelmukh, V. and Edwards, L., “Optimizing Neutron Strain Scanning by the Use of Electron Backscatter Diffraction,” Microscopy and Analysis 91, 2002, pp. 15–18.","cites":null},{"id":37941311,"title":"Parameter Development for the Mig Weldings of High Strength Aerospace Aluminium Alloys,”","authors":[],"date":"2002","doi":null,"raw":"4 Angus, W. Thomas, “Parameter Development for the Mig Weldings of High Strength Aerospace Aluminium Alloys,” Ph.D thesis, School of Industrial and Manufacturing Science Cranﬁeld University, 2002. 5 Nunes, A. C., Bayless, E. O., Jones, C. S., Munafo, P. M., Biddle, A. P., Wilson, W. A., Nuﬂez, A.","cites":null},{"id":37941308,"title":"Recent Developments in Aluminium Alloys for Aerospace Applications,”","authors":[],"date":"2000","doi":"10.1016\/s0921-5093(99)00674-7","raw":"1 Heinz, A., Haszler, A., Keidel, C., Moldenaur, S., Benedictus, R., and Miller, W. S., “Recent Developments in Aluminium Alloys for Aerospace Applications,” Mater. Sci. Eng., A 2802, 102–107 2000.","cites":null},{"id":37941322,"title":"Short Crack Behaviour in a Low Carbon Steel under Fatigue Loading,” Proc Fatigue","authors":[],"date":"2002","doi":null,"raw":"16 JOURNAL OF ASTM INTERNATIONAL19 Hünecke, J. and Schöne, D., “Short Crack Behaviour in a Low Carbon Steel under Fatigue Loading,” Proc Fatigue 2002, edited by A. F. Blom, ISBN 19015372853, 2002, pp. 2021–2028.","cites":null},{"id":37941319,"title":"Use of Neutron and Synchrotron X-ray Diffraction for Non-destructive Evaluation of Weld Residual Stresses in Aluminium Alloys,”","authors":[],"date":"2004","doi":"10.1080\/10238160410001734720","raw":"14 Ganguly, S., Fitzpatrick, M. E., and Edwards, L., “Use of Neutron and Synchrotron X-ray Diffraction for Non-destructive Evaluation of Weld Residual Stresses in Aluminium Alloys,” J. Neutron Res. 11, 219–225 2004.","cites":null},{"id":37941312,"title":"Variable Polarity Plasma Arc Welding on the Space Shuttle External Tank,” Weld.","authors":[],"date":"1984","doi":null,"raw":"C., and Bayless, E. O., “Variable Polarity Plasma Arc Welding on the Space Shuttle External Tank,” Weld. J. (Miami, FL, U. S.) 639,2 7 –35 1984.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-02-01T00:00:00Z","abstract":"Although residual stress in welded structures and components has long been known\nto have an effect on their fatigue performance, access to reliable, spatially\naccurate residual stress field data has been limited. Recent advances in neutron\nand synchrotron X-ray diffraction allow a far more detailed picture of weld\nresidual stress fields to be obtained that permits the development and use of\npredictive models that can be used for accurate design against fatigue in\naircraft structures. This paper describes a fully integrated study of the three-\ndimensional residual stress distribution accompanying state-of-the-art fusion\nwelds in 2024-T4 aluminum alloy, and how it is affected by subsequent machining\nand service loading. A particular feature of this work has been the development\nof techniques allowing the nondestructive evaluation of the residual stress\nfield in the full range of specimens used to provide the design data required\nfor welded aircraft structures and the integration of this information into all\naspects of damage tolerant design","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140492.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1520\/JAI12547","pdfHashValue":"07fab16fcd70cf4b58635e5c4507388a289044db","publisher":null,"rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1707<\/identifier><datestamp>2011-09-20T12:06:30Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>An Integrated Approach to the Determination and Consequences of Residual Stress\non the Fatigue Performance of Welded Aircraft Structures.<\/dc:title><dc:creator>Edwards, L.<\/dc:creator><dc:creator>Fitzpatrick, M. E.<\/dc:creator><dc:creator>Irving, Phil E.<\/dc:creator><dc:creator>Sinclair, I.<\/dc:creator><dc:creator>Zhang, X.<\/dc:creator><dc:creator>Yapp, David<\/dc:creator><dc:subject>residual stresses<\/dc:subject><dc:subject>fatigue<\/dc:subject><dc:subject>damage tolerance<\/dc:subject><dc:subject>structural integrity<\/dc:subject><dc:subject>welded aircraft structures<\/dc:subject><dc:description>Although residual stress in welded structures and components has long been known\nto have an effect on their fatigue performance, access to reliable, spatially\naccurate residual stress field data has been limited. Recent advances in neutron\nand synchrotron X-ray diffraction allow a far more detailed picture of weld\nresidual stress fields to be obtained that permits the development and use of\npredictive models that can be used for accurate design against fatigue in\naircraft structures. This paper describes a fully integrated study of the three-\ndimensional residual stress distribution accompanying state-of-the-art fusion\nwelds in 2024-T4 aluminum alloy, and how it is affected by subsequent machining\nand service loading. A particular feature of this work has been the development\nof techniques allowing the nondestructive evaluation of the residual stress\nfield in the full range of specimens used to provide the design data required\nfor welded aircraft structures and the integration of this information into all\naspects of damage tolerant design.<\/dc:description><dc:date>2011-09-08T10:04:25Z<\/dc:date><dc:date>2011-09-08T10:04:25Z<\/dc:date><dc:date>2006-02-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>L. Edwards, M. E. Fitzpatrick, P. E. Irving, I. Sinclair, X. Zhang, and D. Yapp, An Integrated Approach to the Determination and Consequences of Residual Stress on the Fatigue Performance of Welded Aircraft Structures. Journal of ASTM International, February 2006, Vol. 3, No. 2 Paper ID JAI12547<\/dc:identifier><dc:identifier>1546-962X<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1520\/JAI12547<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/1707<\/dc:identifier><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1546-962X","1546-962x"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["residual stresses","fatigue","damage tolerance","structural integrity","welded aircraft structures"],"subject":["Article"],"fullText":"L. Edwards,1 M. E. Fitzpatrick,2 P. E. Irving,3 I. Sinclair,4 X. Zhang,5 and D. Yapp6\nAn Integrated Approach to the Determination and\nConsequences of Residual Stress on the Fatigue\nPerformance of Welded Aircraft Structures\nABSTRACT: Although residual stress in welded structures and components has long been known to have\nan effect on their fatigue performance, access to reliable, spatially accurate residual stress field data has\nbeen limited. Recent advances in neutron and synchrotron X-ray diffraction allow a far more detailed\npicture of weld residual stress fields to be obtained that permits the development and use of predictive\nmodels that can be used for accurate design against fatigue in aircraft structures. This paper describes a\nfully integrated study of the three-dimensional residual stress distribution accompanying state-of-the-art\nfusion welds in 2024-T4 aluminum alloy, and how it is affected by subsequent machining and service\nloading. A particular feature of this work has been the development of techniques allowing the nondestruc-\ntive evaluation of the residual stress field in the full range of specimens used to provide the design data\nrequired for welded aircraft structures and the integration of this information into all aspects of damage\ntolerant design.\nKEYWORDS: residual stresses, fatigue, damage tolerance, structural integrity, welded aircraft\nstructures\nIntroduction\nResearch into cost saving of aircraft metallic members and components is a continuous process in the\naerospace industries. Weight saving through design modification of aircraft is being undertaken to support\ncost reduction programs and to face the challenge of 21st century mass air transportation \u00011\u0002. Welding\ninstead of mechanical fastening has been identified as one of the major tools for cost reduction, in terms\nof weight reduction and by production cost saving through substitution of assemblies and built-up struc-\ntures by formation of an integral structure. However, unlike mechanical fastening, welding leads to\n• An integral structure with a single load path construction.\n• Creation of microstructure near the fusion and heat affected zone \u0003HAZ\u0004 with changed grain\nstructure and strength.\n• Formation of potential sources of initiating defects not present in the wrought alloy.\n• Creation of local and global residual stress fields.\nAll these factors, in particular the creation of a variable residual stress field across the weld, would\nhave a profound influence on the fatigue life of the welded metallic members and components. The civil\naircraft design specification demands damage tolerance characteristics in safety critical parts. Therefore,\nbefore implementation of such process change it is necessary to establish the fatigue crack growth behav-\nior under the influence of the variable distribution of residual stress that exists following welding. The\nrelationship between the fatigue crack growth in the welded microstructure and the distribution of the\nresidual stress field is the most essential input for the damage-tolerant, fail-safe design of the safety critical\ncomponents \u00012\u0002.\nManuscript received January 7, 2005; accepted for publication August 24, 2005.\n1 Professor of Structural Integrity, Dept of Materials Engineering, Open University, Milton Keynes, UK, MK7 6AA.\n2 Senior Lecturer, Dept of Materials Engineering, Open University, Milton Keynes, UK, MK7 6AA.\n3 Professor of Damage Tolerance, School of Industrial and Manufacturing Sciences, Cranfield University, Cranfield, Bedfordshire\nMK43 0AL.\n4 Reader, School of Engineering, Southampton University, Southampton, UK, SO17 1BJ.\n5 Senior Lecturer, School of Engineering, Cranfield University, Cranfield, Bedfordshire, UK, MK43 0AL.\n6 Senior Lecturer, School of Industrial and Manufacturing Sciences, Cranfield University, Cranfield, Bedfordshire, UK, MK43\n0AL.\nJournal of ASTM International, February 2006, Vol. 3, No. 2\nPaper ID JAI12547\nAvailable online at www.astm.org\nCopyright © 2006 by ASTM International, 100 Barr Harbor Drive, PO Box C700, West Conshohocken, PA 19428-2959.\nThis paper describes the work of an integrated program, WELDES \u0003weld processing design and\ndurability of welded aircraft assemblies\u0004, on the determination and consequences of residual stress on the\nfatigue performance of welded aircraft structures. The breadth of partners and their main functions are\nshown in Fig. 1.\nThe factors controlling fatigue initiation and crack growth in welds are relatively well understood, and\nthe importance of residual stress, HAZ hardness, and microstructure is well known. However, access to\nreliable, spatially accurate residual stress field data has previously been limited. The development of\ndedicated neutron and synchrotron X-ray diffraction techniques for the measurement of residual stress has\nopened up the possibility of acquiring high quality, accurate data which can be used reliably in predictive\nstructural integrity models. However, acquisition of high quality, reliable residual stress data is of optimum\nuse only if it is used to influence both process design and subsequent damage-tolerance data collection and\nuse. This latter point is particularly important, as when one is dealing with residual stress fields, similitude\nno longer automatically exists between laboratory fracture-mechanics specimens and fabricated compo-\nnents and structures.\nThus, in the present program a fully integrated study has been undertaken of the full residual stress\ndistribution associated with state-of-the-art fusion welds in 2024-T4 and 7150-T651 aluminium alloys, and\nhow they are affected by subsequent machining and service loading. A particular feature of this work has\nbeen the development of techniques allowing the nondestructive evaluation of the residual stress field in\nthe full range of specimens used to provide the design data required for welded aircraft structures. This has\nincluded small bend specimens used to study initiation and short fatigue crack growth, middle tension\nM\u0003T\u0004 and compact tension CT specimens used to study long fatigue crack growth, and large integral\nwelded double stringer\/skin mockups used to investigate the likely failure mode of welded wing-skin\nassemblies.\nThe resulting residual stress data have been combined with relevant microstructural data in the fatigue\nmodeling process. Initiation behavior has been studied using replica techniques to monitor the initiation\nand growth of cracks from interdendritic pores in the weld HAZ. Initiation of small fatigue cracks occurred\nvirtually from the first cycle at defects in the microstructure and thus models for the growth and linkage of\nthe microcracks, including the role of residual stress, were developed and fatigue initiation behavior\n\u0003defined as the life to a crack of 1 mm\u0004 has been accurately calculated from knowledge of intrinsic crack\ngrowth rates and HAZ characteristics. Factors controlling macroscopic fatigue growth rates have been\ninvestigated using constant \u0001K tests. The changes in growth rate as the cracks cross the weld have been\ndetermined and related to the changes in the residual stress field, hardness, and microstructure within the\nHAZ. Large-scale skin-stringer mockups have been manufactured and fatigue tested and the implications\nof the results of the program have been assessed. Both 2024-T4 \u0003lower wing skin\u0004 and 7150-T651 \u0003upper\nwing skin\u0004 candidate welds have been studied but only the 2024-T4 work will be described here.\nFIG. 1—WELDES project partners and structure.\n2 JOURNAL OF ASTM INTERNATIONAL\nWeld Processes Studied\nThe processes studied in this work were metal inert gas \u0003MIG\u0004 welding and variable polarity plasma arc\n\u0003VPPA\u0004 welding. Although MIG welding has been in extensive use for various defence and space research\napplication for many years, because of flexibility and low cost, its application has been restricted in the\ncivil aviation industry, as the high strength heat treated 2XXX and 7XXX aluminium alloys used were\nregarded as unweldable via this process \u00013\u0002.\n2024-T4 alloy is a widely known Al–Cu–Mg alloy used extensively in aircraft fuselages and lower\nwing skin-stringer panels. This is a high-strength, age-hardened alloy and is characterized by its superior\ndamage tolerant characteristics \u00012\u0002. The alloy has been typically regarded as unweldable because of its\ncompositional range whereby it is prone to hot cracking. Recent advances in welding technology and the\nuse of 2319 filler wire, however, have made it possible to weld 2024-T4 to aviation standard \u00014\u0002.\nThe dominant cause of generation of residual stress in a weld is the unequal expansion and contraction\nof the weld metal and the surrounding heat affected zone. The fusion welding process causes intense local\nheating in the weld metal region and the heat is conducted into the surrounding metal. At this high\ntemperature the metal yields under compression due to the cooler surrounding material. During cooling,\nuneven contraction between the yielded and nonyielded region gives rise to tensile residual stress along the\nwelding direction.\nVPPA welding is a more recently developed process. It has been used for a number of critical\napplications like the space shuttle external fuel tank \u00015\u0002, and also in structural welding of the international\nspace station by the United States of America’s National Aeronautics and Space Administration \u0003NASA\u0004\nwhere the weld joint has to withstand the harshest external atmospheric condition \u00016\u0002. The process is much\nfavored because of its capability to weld relatively thick sections in a single pass, and also for the\nrelatively low distortion of the welded parts that allows for high dimensional accuracy after further\nmachining.\nThe application of either of these processes in safety critical components in civil aviation, however,\nrequires complete understanding of fatigue crack growth characteristics under the changed microstructure\nand residual stress field. This would form an important design input for safety critical structures to exhibit\ndamage-tolerant, fail-safe characteristics \u00012\u0002.\nAny subsequent machining of the welded component is likely to change the residual stresses within it.\nAs the fracture mechanics specimens that are used to measure material fatigue crack propagation charac-\nteristics are, by necessity, smaller than the welded structures they are intended to represent, they also\ncontain significantly different residual stress profiles. Thus, the nondestructive evaluation of the residual\nstress fields in the full range of specimens used to provide the design data required for welded aircraft\nstructures is essential if fully representative damage tolerance data is to be obtained.\nWeld Processes Development\nThe MIG process forms an arc between a filler wire and parent plate. VPPA uses a nonconsumable\ntungsten electrode, and can be used with filler wire or without \u0003autogenous welding\u0004. These processes were\nused to make butt welds in flat coupons, and to weld skin-stringer panels in 2024-T4.\nThe welded coupons were then used for detailed evaluation of microstructure, tensile, and small-scale\nfatigue properties, and residual stress evaluation. Large skin-stringer panels were subsequently designed,\nfabricated, and manufactured, and their residual stress profiles were non-destructively evaluated before\nfull-scale fatigue testing. The material used was 2024-T4 Al-4.4%Cu-1.5%Mg T351 supplied as 12.7 mm\nthick plate. The MIG filler metal was 5039 Al-2.8%Zn-3.8%Mg. In general, fusion welding of aluminium\nalloys is regarded as difficult since they are susceptible to porosity because of the evolution of hydrogen\nduring welding, and also to solidification cracking because of the wide solidification range in some alloys.\nThe MIG welds were produced in the flat position \u0003plate horizontal\u0004 using a two-pass procedure \u0003Fig. 2\u0004.\nThe VPPA welds were produced by welding vertically up \u0003plate vertical\u0004 in a single pass.\nThe VPPA process produces a “keyhole”—the plasma pressure generates a cavity completely through\nthe plate to be welded, and the molten weld metal flows round the keyhole to form the weld. The welded\ncoupons were 240 mm by 500 mm by 12.7 mm. For both MIG and VPPA, good quality welds were\nproduced, with an absence of gross defects, either large pores, or large solidification cracks. However, the\nMIG welds did contain a high density of small \u000150–200 \u0002m\u0002 gas pores, and small \u000120–50 \u0002m\u0002 interden-\nEDWARDS ET AL. ON RESIDUAL STRESS 3\ndritic defects. In contrast, the VPPA welds were essentially defect-free. There were some interdendritic\ndefects in the weld metal on micro-examination, but these were less than 20 \u0002m in length, smaller, in fact,\nthan the intermetallics in the parent material.\nThis is a remarkable outcome for arc welding of aluminium. It is thought that the presence of the\nkeyhole and the flow of weld metal round the keyhole are responsible for this result. The MIG welding\ncould be performed at relatively low heat input, 0.93 kJ\/mm, whereas for the VPPA welding the heat input\nwas higher at 4 kJ\/mm. This results in a slower thermal cycle for VPPA compared to MIG, and this\nproduces a wider and softer heat affected zone \u0003HAZ\u0004 in the VPPA welds compared to the MIG welds.\nSkin-stringer panels were manufactured using the VPPA process only. There were a number of differ-\nences in the weld when compared to the flat plate coupons. In particular, as the effective heat sink is quite\nasymmetric, owing to the proximity of the weld center line to the doubler, the HAZ width differed on\neither side of the weld. The final 1.2 m long as-welded and machined skin stringer panel is shown in Fig.\n3. The weld is located approximately at one third of the height of the stringer. A detailed description of the\ngeometry is given later in this paper.\nResidual Stress Measurement\nResidual stresses are difficult to account for in structural integrity calculations for several reasons: they are\nintroduced and evolve throughout a range of production stages; they affect fatigue crack initiation and\ngrowth rates; they may evolve as a consequence of in-service loading; and perhaps most importantly,\nresidual stresses have been traditionally difficult to determine reliably and accurately. These problems\nbecome acute when dealing with stress fields arising from welding. Residual stresses are critically depen-\ndent upon welding parameters, heat input, number of weld passes, and the properties of the material\u0003s\u0004\nbeing welded. Accurate determination of residual stresses is not simple. Methods such as hole drilling are\ndestructive and reliable methods for the determination of residual stresses deep within structures and\ncomponents have only recently become available.\nThus, a robust methodology was developed for determining nondestructively the residual stress field in\nthese aluminium alloy welds for aerospace applications using state of the art techniques. The method\ncombines rapid data acquisition from synchrotron X-ray diffraction, coupled with the high penetration of\nFIG. 2—Schematic showing cross section of plate preparation for MIG Welding.\nFIG. 3—As-fabricated and machined skin stringer panel.\n4 JOURNAL OF ASTM INTERNATIONAL\nneutron diffraction to build up a profile of the residual stress. The measurement methods employed for a\ngiven task depended on the size and scale of both the specimens and the residual stresses present as\nsummarized in Table 1.\nAs may be seen from Table 1 the main techniques used were:\nNeutron Diffraction\nNeutron diffraction is now a well-established method for the measurement of elastic strain in crystalline\nmaterials \u00017\u0002. It has been applied to a wide range of materials and problems, and a draft International\nStandards Association \u0003ISO\u0004 standard for its use is now in circulation \u00018\u0002. Neutrons have high penetration\ninto most materials, and hence it is possible to make measurements up to several tens of cm inside\nstructural components so it has the advantage that large specimens can be studied \u0003Fig. 4\u0004.\nSynchrotron X-ray Diffraction\nSynchrotron X-ray diffraction is a relatively new technique for strain measurement \u00017\u0002. Using high-\nintensity X-ray beams it is possible to obtain highly detailed strain maps inside components in as little as\nan hour, much faster than is possible with neutron diffraction. The method has a drawback in that for most\nsamples one strain component cannot be measured in depth, because a grazing incidence of the beam is\nneeded that gives an overly large path length for sensible measurement. As a result, we have developed a\nmethod that combines the high speed and resolution of the synchrotron X-ray method with the ability of\nneutrons to give all strain components \u00019\u0002.\nThus, the precise technique used depended on the size of the specimen. In the small three-point bend\nspecimens of dimensions 80 by 80 by 7 mm3, used to study fatigue crack initiation and crack growth up\nto 1 mm, the near-surface residual stresses were determined using laboratory and synchrotron X-ray\ndiffraction alone. Conversely, the large skin-stringer panels were measured only using neutron diffraction.\nTABLE 1—Samples and residual stress measurement technique used.\nSample Dimensions \u0001mm\u0002 Source\nAs -welded 240\u0003280\u000312 Neutron and synchrotron\nMachined to 7 mm 240\u0003280\u00037 Neutron and synchrotron\nShort crack coupons 100\u000390\u00037 Synchrotron\nMT coupons 380\u000380\u00037 Neutron\nSkin stringer panels 1240\u0003350\u000380 Neutron\nFIG. 4—Installing a large wing rib sample on the ENGIN-X neutron stress diffractometer [10].\nEDWARDS ET AL. ON RESIDUAL STRESS 5\nThe residual stress profiles in the remaining intermediate size specimens were measured using a novel\ncombination of neutron and synchrotron X-ray diffraction in both the as-welded and machined-to-\nthickness conditions.\nWeld Coupon Stresses\nThe as-welded coupons were 0.5 m long, 12 mm thick, and 186 mm wide. Typically a section 280 mm\nlong was cut from this original coupon and the longitudinal, transverse, and normal strains were measured\nat its center point on a plane perpendicular to the weld. The geometry of the weld and the specific strain\ndirections measured are as schematically shown in Fig. 5\u0003a\u0004. On the reasonable assumption that these three\ndirections are principal strain directions, all three stresses were then calculated using Hooke’s Law. For\nbrevity, only the longitudinal stresses are presented here. After this measurement the specimen was then\nmachined down to 7 mm thickness and the stresses were remeasured. Figure 5\u0003b\u0004 illustrates the longitu-\ndinal stress re-distribution that was found on the center line of a 2024-T4 MIG welded specimen as a result\nof this mechanical processing. As can be seen from Fig. 5\u0003b\u0004, the peak stresses are not changed after\nmachining but the width of the central area containing the tensile residual stresses is slightly reduced. Note\nthat the residual stress directions are related to both the weld direction and plate geometry and these\ndefinitions apply to all measurements given in this paper. The error on each of the stress measurements\nshown in Fig. 5 is of the order of ±10 MPa. Unless otherwise plotted on the graph this value may be taken\nto be the error of all stress measurements reported here.\nTypical Residual Stress Results\nComplete cross-sectional mapping of the full stress tensor was carried out for many of the welds and\nfracture mechanics specimens involved in this study; details of both the methods used and the results\nFIG. 5—(a) Schematic showing the measurement geometry in the weld coupons and strain measurement\ndirections and (b) longitudinal residual stresses in a 2024-T4 welded coupon before and after machining\nthe thickness from 12 to 7 mm.\n6 JOURNAL OF ASTM INTERNATIONAL\nobtained are published elsewhere \u00019,11–16\u0002. Here, for brevity, line measurements of longitudinal stress\nwill be reported. For the small fatigue crack specimen, which is loaded in bending, near-surface measure-\nments will be presented. For all the other specimens, the longitudinal residual stresses across the middle of\nthe specimen perpendicular to the weld will be presented as described in schematic diagrams which\naccompany each measurement described in this paper.\nSmall Fatigue Crack Specimens\nThe three-point bend small fatigue crack growth specimens had dimensions 80 mm by 80 mm by 7 mm\n\u0001Fig. 6\u0003a\u0004\u0002. The near-surface residual stresses in both the as-prepared specimens and after the application\nof the first tensile stress cycle \u0001300 MPa\u0002, were determined \u000117\u0002. As can be seen from the 2024-T4 VPPA\nresults shown in Fig. 6\u0003b\u0004, \u0003where the stresses are measured using an effective gage volume covering a\ndepth of 500 mm centerd at a depth of 650 mm below the tensile surface\u0004 stress redistribution does occur\non first loading as relatively high stresses \u0003in this case 300 MPa\u0004 are often used in short fatigue crack\ngrowth testing.\nLong Fatigue Crack Specimen Stresses\nLong fatigue crack growth propagation rates across the weld were monitored in two specimen types. Most\nof the testing was performed on 300 by 80 by 7 mm middle tension \u0001M\u0003T\u0004\u0002 panels. Some comparison\ntesting was also carried out on 7 mm thick compact-tension \u0003CT\u0004 specimens with W=70 mm. The prepa-\nration of the 80 mm wide M\u0003T\u0004 samples from the 186 mm wide, 7 mm thick weld coupons further\nFIG. 6—(a) Schematic figure showing test, weld, and measurement geometry of three point bend small\nfatigue crack growth specimen. (b) Near-surface longitudinal residual stresses in the 2024-T4 VPPA\nsample before and after the application of the first load cycle.\nEDWARDS ET AL. ON RESIDUAL STRESS 7\nrelieved the longitudinal residual stress as can be seen from Fig. 7 which shows the stress evolution in the\nproduction of a 2024-T4 M\u0003T\u0004 specimen. It can be seen that while reducing the thickness of the original\nwelded plates from 12 to 7 mm had little effect on the peak longitudinal stresses, reduction of the trans-\nverse width of the plates resulted in a drop in peak longitudinal stress of nearly 150 MPa. The production\nof the CT specimens caused an even larger redistribution, caused principally by the introduction of the\nnotch. Figure 8 plots the longitudinal stress in a 2024-T4 MIG CT specimen. It can be seen by comparison\nof this figure with Fig. 7 that there are significant changes in both the size and shape. The introduction of\nthe notch in the CT specimen has caused the residual stresses to be no longer symmetric with respect to the\nweld. There is a substantial reduction in the peak tensile longitudinal stress from 225 to 130 MPa and the\ncrack tip now sees a compressive longitudinal stress of −50 MPa.\nSkin-Stringer Fatigue Specimen Stresses\nThe skin-stringer fatigue specimen, which was designed in this study using the data obtained from the\nas-welded coupon stresses, is very large \u00031240 by 170 by 77 mm\u0004 and thus can only be measured using the\nlatest state-of-the-art neutron diffractometers such as the ENGIN-X diffractometer at ISIS pictured in Fig.\n4 \u000110\u0002. The design of this specimen is discussed later in this paper but a schematic figure of the specimen\ncross section showing the position of the welds is shown in Fig. 9\u0003a\u0004. The longitudinal residual stress\nmeasured along the web and doubler of the 2024-T4 VPPA skin-stringer fatigue specimen \u0001see schematic\nFig. 9\u0003b\u0004 for the positions of the two measurement lines\u0002 are shown in Fig. 9\u0003c\u0004. It can be seen that the\nlongitudinal stress in the web is asymmetric with respect to the weld and the peak stress \u0001150 MPa\u0002 occurs\nFIG. 7—(a) Schematic of M(T) specimen showing weld and measurement geometry. (b) Longitudinal\nstresses in 2024-T4 MIG M(T) long fatigue crack growth specimens.\n8 JOURNAL OF ASTM INTERNATIONAL\naway from the skin toward the top of the stiffener. On the other side of the stiffener weld, near to the skin,\nthe peak longitudinal stress is lower \u0001100 MPa\u0002, a value consistent with that found across the doubler. The\nlower stresses found on the skin side of the weld are probably the result of lower temperatures being\nachieved there during welding due to the whole skin acting as a heat sink.\nShort Fatigue Crack Initiation and Growth\nThe initiation and growth of short fatigue cracks was studied in three-point bend loading \u0003using the 80 by\n80 by 7 mm3 sample and loading geometry described in Fig. 6\u0003a\u0004, at constant cyclic load amplitudes and\na R ratio \u0003minimum stress\/maximum stress\u0004 of 0.1. Samples were loaded in the longitudinal orientation\n\u0003i.e., parallel to the weld line\u0004, consistent with the final skin-stringer demonstrator structure. Scanning\nelectron microscopy \u0003SEM\u0004, transmission electron microscopy \u0003TEM\u0004, optical microscopy, hardness map-\nping, and differential scanning calorimetry were also used to elucidate the local microstructural conditions\nof the regions in and around the welds \u0003particularly identifying the competition between ageing, over-\nageing, resolutionizing, and reprecipitation occurring across the HAZ\u0004.\nIt was found that several fatigue crack initiation processes may occur within the welds and associated\nHAZs, each with its own implications for performance\/lifing. Fatigue life of the MIG welds was seen to be\ncontrolled by fusion zone behavior, determined by the combined effects of interdendritic defect size, crack\ncoalescence, and residual stresses. Quantitative analysis showed that while interdendritic defects in the\nMIG weld were distinctly smaller than the gas bubbles \u0003up to \u000350 \u0002m for the interdendritic defects, as\nopposed to \u0003200 \u0002m for the bubbles\u0004, the interdendritic defects were more prominent initiation sites\n\u0003consistent with their angular morphology and damaging colocation of intermetallic particles at the sharp\nFIG. 8—(a) schematic of specimen showing weld and measurement geometry of 2024-T4 MIG W\n=70 mm CT specimen (b) measured longitudinal residual stress along the crack line.\nEDWARDS ET AL. ON RESIDUAL STRESS 9\ncorners formed by neighboring dendrite arms\u0004, see Fig. 10. In the VPPA welds, the fusion zone presented\na much finer, lower density of crack initiating defects, and although crack initiation was indeed seen in the\nfusion zone, failure was controlled by cracks forming at the peak residual stress location of the HAZ. Such\ncracks were associated with the intrinsic defect population of the parent material \u0003intermetallic particle\nclusters\u0004.\nWithin MIG weld samples it was noted that failure of the weld was dominated by multiple crack\nformation and coalescence, with no single dominant crack appearing until cracks coalesced right across the\nfusion zone \u0003a distance of the order of 10 mm\u0004 and started to propagate into the weld heat affected zone\n\u0003HAZ\u0004, see Fig. 11. In contrast, little influence of crack-crack interactions was seen in failure of the VPPA\nwelds.\nFIG. 9—(a) Cross section of skin stringer design, (b) measurement lines, (c) longitudinal residual stresses\nin the web and doubler of the 2024-T4 VPPA skin stringer fatigue specimen.\nFIG. 10—Typical crack initiation seen at small\/acicular interdentric defects of MIG weld fusion zone.\n10 JOURNAL OF ASTM INTERNATIONAL\nIn the context of fatigue life to 1 mm total crack length, a micromechanical model has been developed\nfor the MIG fusion zone and VPPA HAZ. The model considers the probability of initiation and the\ndensity\/distribution of pores \u0003or intermetallic particles\u0004 within a given microstructure. A Monte Carlo\napproach was used to simulate microstructural influence on crack initiation and crack densities. A micro-\nstructural model of short crack growth rates was then used \u000118\u0002, considering the local influences of grain\nsize and flow strength on failure. The incidence of crack interactions is considered via a simple geometri-\ncal method \u000119\u0002. The crack growth rate part of the modeling approach was calibrated via “subsized”\ncoupon testing, where small bend bars \u00033 by 1.5 mm in cross-section, 25 mm long, see Fig. 12\u0004 were taken\nfrom specific regions of the welds: at this scale, the samples represented essentially homogeneous material\nthat could be considered residual-stress-free as they were significantly smaller than the wavelength of the\nmeasured stress distribution. The influence of residual stress on weld failure was then considered purely in\nterms of crack closure via a simple closure model \u0003going from a closure-free initial growth to steady-state\nlong crack behavior\u0004. Predictions with and without residual stress \u0003RS\u0004 effects were made by including the\nlongitudinal residual stress measured at the crack initiation site after the first load cycle. Initiation actually\noccurred where the longitudinal residual stress was highest in Fig. 7; so the value taken was 100 MPa.\nOverall it was found that the initiation\/short crack fatigue behavior of both the VPPA and MIG welds\ncould be reasonably well predicted, and Fig. 13 shows the prediction for VPPA welded 2024-T4.\nLong Fatigue Crack Growth\nMeasurements of fatigue crack growth rates at constant load amplitude were performed on samples with\nthree size scales: CT samples with a W dimension of 70 mm, M\u0003T\u0004 panels 380 mm long and 80 mm gage\nlength width with the weld on the center line, and a 1.2 m long skin—stringer panel with the stringer\nwelded to the skin longitudinally. The three types of samples have been described when reporting their\nresidual stress profiles earlier. Sample thickness in CT and M\u0003T\u0004 samples was 7 mm: this was the skin\nthickness in the skin-stringer panel. The effects of mean stress, weld process, and alloy type on fatigue\ncrack growth rates were systematically studied. In compact tension \u0003CT\u0004 and middle tension \u0001M\u0003T\u0004\u0002\nspecimens, crack lengths were monitored using a precision dc electrical potential technique. In skin-\nstringer panels an automated video system was used.\nFIG. 11—Multiple crack interaction\/coalescence across MIG weld fusion zone.\nFIG. 12—Subsize fatigue testing, showing test specimen and self-aligning bend fixtures.\nEDWARDS ET AL. ON RESIDUAL STRESS 11\nAll welds were loaded parallel to their longitudinal axis, with cracks growing across them. This\norientation will be relevant to aircraft applications, but it results in cracks growing across widely varying\nresidual stress fields, accompanied by changes in microstructure and hardness. A conventional constant\nload range fatigue crack growth test will therefore not exhibit similitude, as crack tips at different values\nof stress intensity range \u0001K will be subject to different crack tip conditions. Therefore additional testing\nwas performed in which the \u0001K was maintained constant with crack length, allowing the effect of changes\nin residual stress and microstructure on crack growth rates at a constant value of \u0001K to be determined. A\nselection of the data gathered on the welded samples which illustrate the influence of residual stress\nfollows.\nEffect of Residual Stress on Fatigue Crack Growth Rates in Welds\nFigure 14 compares fatigue crack growth rates for VPPA welded 2024-T4 with those of parent plate. Data\nfor the welded samples is at R values of 0.1 and 0.6, and shows that there is little effect of tensile mean\nstress in the presence of tensile residual stresses, and second, that crack growth rates in the welded samples\nare accelerated with respect to the parent plate by a factor of up to a factor of 10. Tests conducted at a\nconstant value of \u0001K=6 MPam1\/2 confirm that the acceleration is maintained at approximately this level\nup to 25 mm from the weld line.\nThe dramatic influence of residual stress on weld crack growth rates is further illustrated by a com-\nparison of growth rates produced in constant \u0001K=6 MPa m1\/2 in the M\u0003T\u0004 panels and in the CT samples.\nFIG. 13—Comparison of experimental and predicted fatigue lives for VPPA welded 2024-T4: Weld life and\npredictions are particularly shown for a crack length of 1 mm.\nFIG. 14—da\/dN vs \u0001K for VPPA welded 2024-T4, tested at R=0.1 and 0.6 in M(T) samples with 2 mm\nstarting defect in center of the weld line. Comparison with parent plate at R=0.1\n12 JOURNAL OF ASTM INTERNATIONAL\nThis is shown in Fig. 15; M\u0003T\u0004 panels, as shown in Fig. 7, produce substantial tensile residual stresses on\nthe weld line, whereas CT samples, a shown in Fig. 8, possess a compressive residual stress on the weld\nline. The growth rates in the tension residual stress field vary between 2\u000310−8 and 7\u000310−8 m\/cycle,\ndepending on distance from the weld line, whereas in the compact tension samples, growth rates declined\nto less than 10−10 m\/cycle as the crack approached the weld line, and at a maximum only achieved 7\n\u000310−9 m\/cycle—a factor of 10 slower than that in the M\u0003T\u0004 sample with an identical weld. 7\n\u000310−9 m\/cycle is the parent plate da\/dN for a \u0001K value of 6 MPa m1\/2. As the welds in the two samples\nwere virtually identical, the differences in growth rate must be due to residual stresses arising from\nwelding and modified by the sample preparation processes.\nFatigue crack growth rates produced on testing the 2024-T4 skin-stringer panel with a defect intro-\nduced on the weld line were similar to those measured in the much smaller center cracked panel, when\ncompared on the basis of stress intensity factor. Figure 16 shows da\/dN versus \u0001K for crack growth rate\nmeasured on the 2024-T4 skin-stringer panel and those measured on the center cracked panel. There is\nonly a small overlap in the two sets of data, but the linkup is smooth with only a little scatter. This is\nperhaps surprising in view of the differences in residual stresses in the two samples; however, in both cases\nthe stresses are tensile, and the crack is originating within the weld line in both samples. The CT samples\ndemonstrate more profound changes in growth rate when the residual stresses are compressive.\nFIG. 15—Comparison of growth rates measured in CT and M(T) samples of 2024-T4 with identical VPPA\nwelds at a constant \u0001K of 6 MPa-m1\/2, R=0.1.\nFIG. 16—Comparative fatigue crack growth rates in the skin stringer panel and the MT long crack growth\nspecimens.\nEDWARDS ET AL. ON RESIDUAL STRESS 13\nImplications for the Design, Fail Safety and Damage Tolerance of Aircraft Wing Panels\nThe main objectives of this work are to develop analysis approaches to predict fatigue crack growth that\ninclude the influence of welding residual stress and to explore fail-safety design options for integral\/\nwelded stringer panels. A global-local approach combining linear elastic fracture mechanics \u0003LEFM\u0004 with\nthe finite element method \u0003FEM\u0004 has been employed to investigate the influence of the measured residual\nstress fields and fatigue crack growth rates on the design of putative welded aircraft wing structures. Initial\nwork performed included the design of the welded skin-stringer panels for fatigue testing, crack growth\nanalysis of the CCT specimens, and fail-safety and damage tolerance analysis of welded stringer panels.\nDue to space constraints only some conclusions of the latter two studies will be reported here. The main\nfunction of this section is to illustrate how the residual stress measurements can be included in a holistic\ndesign model of the damage tolerance of welded aircraft structures. Details of fail-safety \u0003residual\nstrength\u0004 and damage tolerance analysis \u0003fatigue crack growth and inspection\u0004 can be found in \u000120\u0002.\nDesign of Two-Stringer Welded Wing Skin Panels for Fatigue Testing\nThe design constraints \u0003decided by the WELDES consortium\u0004 were that the weld joint in the stringer\nshould be in the web close to the skin panel and the thickness of all weld samples are 7 mm \u0003after\npost-weld machining\u0004. In addition, the panel had to be capable of being tested in the available 1 MN\nfatigue-testing machine. An “I” section was adopted to represent the wing’s lower covers, in order to make\ncomparisons with similar built-up designs. The final design configuration was shown in Fig. 9\u0003a\u0004. The\nstringer to skin area ratio \u0001Ast\/bt\u0002 is defined as the ratio of the stiffener cross-section area \u0001Ast\u0002 to the\nproduct of the bay width \u0003b\u0004 and skin thickness \u0003t\u0004. It is 1.03 for the tension panel.\nDamage Tolerance and Fail-Safety Analysis of Welded Stringer Panels\nWelded stringer panels behave like integrally machined panels; both are unitized structures without redun-\ndancy structural members. In contrast, the mechanically fastened \u0003built-up\u0004 panels are desirable in terms of\nfail-safety criterion since the stringers are effective crack stoppers. However, the integral and welded\npanels are becoming increasingly popular due to much reduced manufacturing cost and considerable\nweight savings. It is necessary and timely to investigate the fail-safety and damage tolerance aspects of this\nkind of stringer panel.\nThe first failure scenario considered was crack initiation and subsequent propagation from the weld\njoint at the stringer web \u0001Fig. 17\u0003a\u0004\u0002. The welded joint has high tensile residual stresses and local micro-\nstructural change resulting in lower fatigue strength \u0003crack initiation aspect\u0004 and faster crack growth rate\n\u0003crack propagation aspect\u0004. Another important failure mode is a crack propagating in the panel skin, e.g.,\ncrack under a broken stringer in Fig. 17\u0003b\u0004 and a midbay skin crack in Fig. 17\u0003c\u0004.\nFor built-up panels the bolted stringers act as effective crack stoppers to arrest these cracks. However,\nthe welded or integral stringers are not so effective; they will slow down the crack growth rate as the crack\ntip approaches an integral stringer due to the integral fastening system being completely rigid hence\nreducing the stress intensity factor \u0003K\u0004, but these stringers will not act as crack stoppers. Analyses were\nperformed for both damage tolerance \u0003crack growth life\u0004 and fail-safety \u0003residual strength and large crack\nFIG. 17—Failure scenarios: (a) Stringer failure due to flaws in weld join; (b) cracking under a broken\nstringer; (c) midbay skin cracks from a discrete damage source, maintenance-holes, or connection fastener\nholes to the ribs.\n14 JOURNAL OF ASTM INTERNATIONAL\ncapability\u0004 aspects. The stress intensity factor \u0003K\u0004 versus crack length relation for the skin-stringer panels\nwas established by finite element analysis \u0003FEA\u0004. FEA was then used to calculate crack closure induced\nchanges to derive \u0002Keff, taking into account extra plasticity effects arising from local softening in the\nHAZ and weld residual stress effects. In this first approach, crack opening stress is assumed to be a\nfunction of the stress ratio \u0001R\u0002 and welding residual stress and not related to geometry. For a given\nstructure, once the \u0002K and the crack opening stress are found, fatigue life prediction was carried out for\na given load spectrum using the AFGROW software package. This approach works well for the constant\namplitude loading cases. For variable amplitude loads, an alternative approach was used. The welding\nresidual stress distribution was simply input into the AFGROW code that calculates the residual stress\nintensity factor by either GAUSSIAN integration or weight function methods and then predicts fatigue crack\ngrowth life. Life prediction by both methods is demonstrated below.\nLife Prediction Results\nFor the two-stringer panel, we assumed that one stringer has a defect at the weld joint with the total length\nof 6 mm. This flaw could be caused by fatigue process and the local residual tensile stresses or an initial\nweld defect. So this is a real threat to welded structural panels under the damage tolerance design concept.\nThe crack is supposed to grow simultaneously toward the stringer upper flange and the skin doubler. This\nwas simulated by moving the two crack tips in both directions simultaneously. The virtual crack closure\ntechnique \u0003VCCT\u0004 was used to calculate the strain energy release rate that was then converted to a stress\nintensity factor \u0003SIF\u0004. Figure 18 shows the life prediction results under constant amplitude and aircraft\nservice loading spectra, respectively. The agreement with the test results is reasonably good for this\ncomplex problem. Further work is necessary to address the effect of residual stress relaxation and redis-\ntribution owing to crack growth. This may improve the accuracy of life prediction.\nConclusions\nThe WELDES project has uniquely integrated the powerful recent developments in non-destructive re-\nsidual stress measurement using neutron and synchrotron X-ray diffraction with the damage tolerance data\nFIG. 18—Stringer web cracking from the weld joint—predicted fatigue crack growth life and comparison\nwith test results. (a) Tension panel under CAL (Smax=88 MPa, R=0.1); (b) tension panel under aircraft\nservice load spectrum \u0001Smax=138 MPa\u0002.\nEDWARDS ET AL. ON RESIDUAL STRESS 15\nacquisition and design necessary to implement welded aircraft structures. Significant new knowledge has\nbeen obtained and a mechanism for dealing with the loss of similitude that occurs when residual stresses\nare present in structures has been developed. It is shown that if accurate reliable residual stress data is\navailable then adequate predictions of the fatigue life of welded structures can be made.\nReferences\n\u00011\u0002 Heinz, A., Haszler, A., Keidel, C., Moldenaur, S., Benedictus, R., and Miller, W. S., “Recent Devel-\nopments in Aluminium Alloys for Aerospace Applications,” Mater. Sci. Eng., A 280\u00032\u0004, 102–107\n\u00032000\u0004.\n\u00012\u0002 Fitzpatrick, M. E. and Edwards, L., “Fatigue Crack\/Residual Stress Field Interactions and Their\nImplications for Damage-Tolerant Design,” J. Mater. Eng. Perform. 7\u00032\u0004, 190–198 \u00031998\u0004.\n\u00013\u0002 Mendez, P. F., “New Trends in Welding in the Aeronautic Industry,” Proceedings of the Conference\n“New Trends for the Manufacturing in the Aeronautic Industry,” Publ. Hegan\/Inasmet, San Sebas-\ntian, Spain, 2000.\n\u00014\u0002 Angus, W. Thomas, “Parameter Development for the Mig Weldings of High Strength Aerospace\nAluminium Alloys,” Ph.D thesis, School of Industrial and Manufacturing Science Cranfield Univer-\nsity, 2002.\n\u00015\u0002 Nunes, A. C., Bayless, E. O., Jones, C. S., Munafo, P. M., Biddle, A. P., Wilson, W. A., Nuflez, A.\nC., and Bayless, E. O., “Variable Polarity Plasma Arc Welding on the Space Shuttle External Tank,”\nWeld. J. (Miami, FL, U. S.) 63\u00039\u0004, 27–35 \u00031984\u0004.\n\u00016\u0002 Woodward, H., “International Space Station-Welding Will Be Out of This world,” Weld. J. (Miami,\nFL, U. S.) 75\u00033\u0004, 34–40 \u00031996\u0004.\n\u00017\u0002 Withers, P. J. and Webster, P. J., “Neutron and Synchrotron Strain Scanning,” Strain 37\u00031\u0004, 19–25\n\u00032001\u0004.\n\u00018\u0002 ISO\/TTA 3:200I, “Polycrystalline Materials—Determination of Residual Stresses by Neutron Dif-\nfraction.”\n\u00019\u0002 Stelmukh, V., Edwards, L., Santisteban, J. R., Ganguly, S., and Fitzpatrick, M. E., “Weld Stress\nMapping Using Neutron and Synchrotron X-Ray Diffraction,” Mater. Sci. Forum 404–407, 599–604\n\u00032002\u0004.\n\u000110\u0002 Daymond, M. R. and Edwards, L., “A Fully Refined Diffractometer Designed Specifically for the\nMeasurement of Stress,” Neutron News 15, 24–29 \u00032004\u0004.\n\u000111\u0002 Stelmukh, V., Edwards, L., and Ganguly, S., “Full Stress Tensor Determination in a Textured Aero-\nspace Aluminium Alloy Plate Using Synchrotron X-Ray Diffraction,” Textures Microstruct. 35\u00033–4\u0004,\n175–183 \u00032003\u0004.\n\u000112\u0002 Zhang, Y., Fitzpatrick, M. E., and Edwards, L., “Cross-Sectional Mapping of Residual Stresses in a\nVPPA Weld Using the Contour Method,” Acta Mater. 52\u000317\u0004, 5225–5232 \u00032004\u0004.\n\u000113\u0002 Stelmukh, V. and Edwards, L., “Optimizing Neutron Strain Scanning by the Use of Electron Back-\nscatter Diffraction,” Microscopy and Analysis 91, 2002, pp. 15–18.\n\u000114\u0002 Ganguly, S., Fitzpatrick, M. E., and Edwards, L., “Use of Neutron and Synchrotron X-ray Diffraction\nfor Non-destructive Evaluation of Weld Residual Stresses in Aluminium Alloys,” J. Neutron Res. 11,\n219–225 \u00032004\u0004.\n\u000115\u0002 Ganguly, S., Fitzpatrick, M. E., and Edwards, L., “Comparative Neutron and Synchrotron X-Ray\nDiffraction Studies to Determine Residual Stress on an As-Welded AA2024 Plate,” Mater. Sci. Forum\n490, 223–228 \u00032005\u0004.\n\u000116\u0002 Pratihar, S., Stelmukh, V., Hutchings, M. T., Fitzpatrick, M. E., Stuwe, U., and Edwards, L., “Mea-\nsurement of the Residual Stress in MIG Welded 2024-T351 and 7150-T651 Compact Tension\nSamples,” Mater. Sci. Eng. to be published.\n\u000117\u0002 Lefebvre, F., Ganguly, S., and Sinclair, I., “Micromechanical Aspects of Fatigue in a MIG Welded\nAluminium Airframe Alloy,” Mater. Sci. Eng., A 397, 338–354 \u00032005\u0004.\n\u000118\u0002 Edwards, L. and Zhang, Y. H., “Investigation of Small Fatigue Cracks. II. A Plasticity Based Model\nof Small Fatigue Crack Growth,” Acta Metall. Mater. 42\u00034\u0004, 1423–1431 \u00031994\u0004.\n16 JOURNAL OF ASTM INTERNATIONAL\n\u000119\u0002 Hünecke, J. and Schöne, D., “Short Crack Behaviour in a Low Carbon Steel under Fatigue Loading,”\nProc Fatigue 2002, edited by A. F. Blom, ISBN 19015372853, 2002, pp. 2021–2028.\n\u000120\u0002 Zhang, X. and Li, Y., “Damage Tolerance and Fail Safety of Welded Aircraft Wing Panels,” AIAA J.\n43\u00037\u0004, 1613–1623 \u00032005\u0004.\nEDWARDS ET AL. ON RESIDUAL STRESS 17\n"}