{"doi":"10.1016\/j.cortex.2009.06.010","coreId":"67993","oai":"oai:eprints.lancs.ac.uk:34103","identifiers":["oai:eprints.lancs.ac.uk:34103","10.1016\/j.cortex.2009.06.010"],"title":"Lucky numbers : spatial neglect affects physical, but not representational, choices in a Lotto task.","authors":["Loetscher, Tobias","Nicholls, Michael E. R.","Towse, John N.","Bradshaw, John L.","Brugger, Peter"],"enrichments":{"references":[{"id":16629500,"title":"and action - from finger counting to the mental number line and beyond.","authors":[],"date":"2008","doi":null,"raw":"WOOD G and FISCHER MH. Numbers, space, and action - from finger counting to the mental number line and beyond. Cortex, 44: 353-358, 2008.","cites":null},{"id":16629427,"title":"Attentional shift towards the rightmost stimuli in patients with left visual neglect.","authors":[],"date":"1989","doi":null,"raw":"DE RENZI E, GENTILINI M, FAGLIONI P, and BARBIERI C. Attentional shift towards the rightmost stimuli in patients with left visual neglect. Cortex, 25: 231-7, 1989.","cites":null},{"id":16629512,"title":"Brain damage: Neglect disrupts the mental number line.","authors":[],"date":"2002","doi":null,"raw":"ZORZI M, PRIFTIS K, and UMILTA C. Brain damage: Neglect disrupts the mental number line. Nature, 417: 138-9, 2002.","cites":null},{"id":16629419,"title":"Comparison of a single case to a control or normative sample in neuropsychology: Development of a bayesian approach.","authors":[],"date":"2007","doi":null,"raw":"CRAWFORD JR and GARTHWAITE PH. Comparison of a single case to a control or normative sample in neuropsychology: Development of a bayesian approach. Cognitive Neuropsychology, 24: 343 - 372, 2007.","cites":null},{"id":16629431,"title":"Cross-linguistic regularities in the frequency of number words.","authors":[],"date":"1992","doi":null,"raw":"DEHAENE S and MEHLER J. Cross-linguistic regularities in the frequency of number words. Cognition, 43: 1-29, 1992.","cites":null},{"id":16629438,"title":"Early orientation of attention toward the half space ipsilateral to the lesion in patients with unilateral brain damage.","authors":[],"date":"1991","doi":null,"raw":"GAINOTTI G, D'ERME P, and BARTOLOMEO P. Early orientation of attention toward the half space ipsilateral to the lesion in patients with unilateral brain damage. Journal of Neurology, Neurosurgery & Psychiatry, 54: 1082-9, 1991.","cites":null},{"id":16629421,"title":"Early rightwards orienting of attention on simple reaction time performance in patients with left-sided neglect.","authors":[],"date":"1992","doi":null,"raw":"D'ERME P, ROBERTSON I, BARTOLOMEO P, DANIELE A, and GAINOTTI G. Early rightwards orienting of attention on simple reaction time performance in patients with left-sided neglect. Neuropsychologia, 30: 989-1000, 1992.","cites":null},{"id":16629476,"title":"Effects of parietal injury on covert orienting of attention.","authors":[],"date":"1984","doi":null,"raw":"POSNER MI, WALKER JA, FRIEDRICH FJ, and RAFAL RD. Effects of parietal injury on covert orienting of attention. Journal of Neuroscience, 4: 1863-74, 1984.","cites":null},{"id":16629487,"title":"Geographic information has to be spatialised to be neglected: A representational neglect case.","authors":[],"date":"2004","doi":null,"raw":"RODE G, ROSSETTI Y, PERENIN MT, and BOISSON D. Geographic information has to be spatialised to be neglected: A representational neglect case. Cortex, 40: 391-397, 2004. SANDRINI M and RUSCONI E. A brain for numbers. Cortex, In Press.","cites":null},{"id":16629444,"title":"How to win more : Strategies for increasing a lottery win.","authors":[],"date":"1998","doi":null,"raw":"HEINZE N and RIEDWYL H. How to win more : Strategies for increasing a lottery win. Natick, Mass: A K Peters, 1998.","cites":null},{"id":16629447,"title":"Interactions between number and space in parietal cortex.","authors":[],"date":"2005","doi":null,"raw":"HUBBARD EM, PIAZZA M, PINEL P, and DEHAENE S. Interactions between number and space in parietal cortex. Nature Reviews Neuroscience, 6: 435-48, 2005.","cites":null},{"id":16629452,"title":"Looking for the answer: The mind’s eye in number space.","authors":[],"date":"2008","doi":null,"raw":"LOETSCHER T, BOCKISCH C, and BRUGGER P. Looking for the answer: The mind’s eye in number space. Neuroscience, 151: 725-729, 2008.","cites":null},{"id":16629398,"title":"Orienting of attention in left unilateral neglect.","authors":[],"date":"2002","doi":null,"raw":"BARTOLOMEO P and CHOKRON S. Orienting of attention in left unilateral neglect. Neuroscience & Biobehavioral Reviews, 26: 217-34, 2002.","cites":null},{"id":16629416,"title":"Patterns of behavioral deficit associated with visual spatial neglect.","authors":[],"date":"1969","doi":null,"raw":"COSTA LD, VAUGHAN G, HORWITZ M, and RITTER W. Patterns of behavioral deficit associated with visual spatial neglect. Cortex, 5: 242-263, 1969.","cites":null},{"id":16629436,"title":"Perceiving numbers causes spatial shifts of attention.","authors":[],"date":"2003","doi":null,"raw":"FISCHER MH, CASTEL AD, DODD MD, and PRATT J. Perceiving numbers causes spatial shifts of attention. Nature Neuroscience, 6: 555-6, 2003.","cites":null},{"id":16629455,"title":"Random number generation in neglect patients reveals enhanced response stereotypy, but no neglect in number space.","authors":[],"date":"2009","doi":null,"raw":"LOETSCHER T and BRUGGER P. Random number generation in neglect patients reveals enhanced response stereotypy, but no neglect in number space. Neuropsychologia, 47: 276-279, 2009.","cites":null},{"id":16629410,"title":"Reasons for variability in the reported rate of occurrence of unilateral spatial neglect after stroke.","authors":[],"date":"1999","doi":null,"raw":"BOWEN A, MCKENNA K, and TALLIS RC. Reasons for variability in the reported rate of occurrence of unilateral spatial neglect after stroke. Stroke, 30: 1196-1202, 1999.","cites":null},{"id":16629413,"title":"Recovery from unilateral visuo spatial neglect?","authors":[],"date":"1976","doi":null,"raw":"CAMPBELL DC and OXBURY JM. Recovery from unilateral visuo spatial neglect? Cortex, 12: 303-312, 1976.","cites":null},{"id":16629460,"title":"Remote memory and neglect syndrome.","authors":[],"date":"1987","doi":null,"raw":"MEADOR KJ, LORING DW, BOWERS D, and HEILMAN KM. Remote memory and neglect syndrome. Neurology, 37: 522-6, 1987.","cites":null},{"id":16629458,"title":"Residual rightward attentional bias after apparent recovery from right hemisphere damage: Implications for a multicomponent model of neglect.","authors":[],"date":"1994","doi":null,"raw":"MATTINGLEY JB, BRADSHAW JL, BRADSHAW JA, and NETTLETON NC. Residual rightward attentional bias after apparent recovery from right hemisphere damage: Implications for a multicomponent model of neglect. Journal of Neurology, Neurosurgery & Psychiatry, 57: 597-604, 1994.","cites":null},{"id":16629450,"title":"Response availability and the apparent spontaneity of numerical choices.","authors":[],"date":"1977","doi":null,"raw":"KUBOVY M. Response availability and the apparent spontaneity of numerical choices. Journal of Experimental Psychology: Human Perception and Performance, 3: 359-364, 1977.","cites":null},{"id":16629407,"title":"Seeing and imagining the &quot;Same&quot; Objects in unilateral neglect.","authors":[],"date":"2008","doi":null,"raw":"BOURLON C, PRADAT-DIEHL P, DURET C, AZOUVI P, and BARTOLOMEO P. Seeing and imagining the &quot;Same&quot; Objects in unilateral neglect. Neuropsychologia, 46: 2602-2606, 2008.","cites":null},{"id":16629389,"title":"Sensitivity of clinical and behavioural tests of spatial neglect after right hemisphere stroke.","authors":[],"date":"2002","doi":null,"raw":"AZOUVI P, SAMUEL C, LOUIS-DREYFUS A, BERNATI T, BARTOLOMEO P, BEIS JM, CHOKRON S, LECLERCQ M, MARCHAL F, MARTIN Y, DE MONTETY G, OLIVIER S, PERENNOU D, PRADAT-DIEHL P, PRAIRIAL C, RODE G, SIEROFF E, WIART L, and ROUSSEAUX M. Sensitivity of clinical and behavioural tests of spatial neglect after right hemisphere stroke. Journal of Neurology, Neurosurgery & Psychiatry, 73: 160-166, 2002.","cites":null},{"id":16629385,"title":"Spatial neglect: Clinical and neuroscience review - a wealth of information on the poverty of spatial attention.","authors":[],"date":"2008","doi":null,"raw":"ADAIR JC AND BARRETT AM. Spatial neglect: Clinical and neuroscience review - a wealth of information on the poverty of spatial attention. Annals of the New York Academy of Sciences, 1142: 21-43, 2008.","cites":null},{"id":16629492,"title":"Specifying executive representations and processes in number generation tasks.","authors":[],"date":"2001","doi":null,"raw":"SCOTT S, BARNARD P, and MAY J. Specifying executive representations and processes in number generation tasks. Quarterly Journal of Experimental Psychology: Section A, 54: 641-664, 2001.     17 SIEROFF E, DECAIX C, CHOKRON S, and BARTOLOMEO P. Impaired orienting of attention in left unilateral neglect: A componential analysis. Neuropsychology, 21: 94-113, 2007.","cites":null},{"id":16629482,"title":"Speed of adding and comparing numbers.","authors":[],"date":"1970","doi":null,"raw":"RESTLE F. Speed of adding and comparing numbers. Journal of Experimental Psychology, 83: 274-278, 1970.","cites":null},{"id":16629503,"title":"The mental representation of ordered sequences in visual neglect.","authors":[],"date":"2007","doi":null,"raw":"ZAMARIAN L, EGGER C, and DELAZER M. The mental representation of ordered sequences in visual neglect. Cortex, 43: 542-550, 2007.","cites":null},{"id":16629428,"title":"The mental representation of parity and number magnitude.","authors":[],"date":"1993","doi":null,"raw":"DEHAENE S, BOSSINI S, and GIRAUX P. The mental representation of parity and number magnitude. Journal of Experimental Psychology: General, 122: 371-396, 1993.","cites":null},{"id":16629402,"title":"The relationship between visuospatial and representational neglect.","authors":[],"date":"1994","doi":null,"raw":"BARTOLOMEO P, D'ERME P, and GAINOTTI G. The relationship between visuospatial and representational neglect. Neurology, 44: 1710-4, 1994.","cites":null},{"id":16629497,"title":"The spatial representation of numbers: Evidence from neglect and pseudoneglect.","authors":[],"date":"2009","doi":null,"raw":"UMILTÀ C, PRIFTIS K, and ZORZI M. The spatial representation of numbers: Evidence from neglect and pseudoneglect. Experimental Brain Research, 192: 561-569, 2009.","cites":null},{"id":16629507,"title":"The spatial representation of numerical and non-numerical sequences: Evidence from neglect.","authors":[],"date":"2006","doi":null,"raw":"ZORZI M, PRIFTIS K, MENEGHELLO F, MARENZI R, and UMILTA C. The spatial representation of numerical and non-numerical sequences: Evidence from neglect. Neuropsychologia, 44: 1061-1067, 2006.","cites":null},{"id":16629434,"title":"Three parietal circuits for number processing.","authors":[],"date":"2003","doi":null,"raw":"DEHAENE S, PIAZZA M, PINEL P, and COHEN L. Three parietal circuits for number processing. Cognitive Neuropsychology, 20: 487-506, 2003.     16 DORICCHI F, GUARIGLIA P, GASPARINI M, and TOMAIUOLO F. Dissociation between physical and mental number line bisection in right hemisphere brain damage. Nature Neuroscience, 8: 1663-1665, 2005. DORICCHI F, MEROLA S, AIELLO M, GUARIGLIA P, BRUSCHINI M, GEVERS W, GASPARINI M, and TOMAIUOLO F. Spatial orienting biases in the decimal numeral system. Current Biology, in press.","cites":null},{"id":16629467,"title":"Time required for judgements of numerical inequality.","authors":[],"date":"1967","doi":null,"raw":"MOYER RS and LANDAUER TK. Time required for judgements of numerical inequality. Nature, 215: 1519-20, 1967.","cites":null},{"id":16629396,"title":"Time to imagine space: A chronometric exploration of representational neglect.","authors":[],"date":"2005","doi":null,"raw":"BARTOLOMEO P, BACHOUD-LEVI AC, AZOUVI P, and CHOKRON S. Time to imagine space: A chronometric exploration of representational neglect. Neuropsychologia, 43: 1249-57, 2005.","cites":null},{"id":16629406,"title":"Unilateral neglect of representational space.","authors":[],"date":"1978","doi":null,"raw":"BISIACH E and LUZZATTI C. Unilateral neglect of representational space. Cortex, 14: 129-133, 1978.","cites":null},{"id":16629441,"title":"Unilateral spatial neglect and defective performance in one half of space.","authors":[],"date":"1985","doi":null,"raw":"HALSBAND U, GRUHN S, and ETTLINGER G. Unilateral spatial neglect and defective performance in one half of space. International Journal of Neuroscience, 28: 173-195, 1985.","cites":null},{"id":16629424,"title":"Visualizing numbers in the mind's eye: The role of visuo-spatial processes in numerical abilities.","authors":[],"date":"2008","doi":null,"raw":"DE HEVIA MD, VALLAR G, and GIRELLI L. Visualizing numbers in the mind's eye: The role of visuo-spatial processes in numerical abilities. Neuroscience & Biobehavioral Reviews, 32: 1361-1372, 2008.","cites":null},{"id":16629472,"title":"What kind of visual spatial attention is impaired in neglect?","authors":[],"date":"2005","doi":null,"raw":"NATALE E, POSTERARO L, PRIOR M, and MARZI CA. What kind of visual spatial attention is impaired in neglect? Neuropsychologia, 43: 1072-1085, 2005.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-05","abstract":"Spatial neglect can be characterized by a “magnetic attraction” towards the right side of a visual stimulus array and a selection of stimuli from that hemispace. This study examined whether these distinctive characteristics in visuo-motor space are also evident in representational number space. Given that numbers are thought to be represented along a left-to-right oriented mental number line, an affinity for the spontaneous selection of larger numbers was anticipated for neglect patients. Contrary to this expectation, neglect patients (n = 20) picked a similar range of numbers compared to controls (n = 17) when generating a number between 1000 and 10 000 and when playing an imaginary lottery game. There was, however, a positive correlation between the biases for the imaginary lottery, number generation and a number bisection task – demonstrating that exploration asymmetries along the mental number line are consistent within individuals across tasks. Some of the patients selected smaller numbers in all of these tasks, confirming reports of dissociations between physical and numerical-representational forms of neglect. Conversely, only four (20%) of the patients could reliably be classified as demonstrating a neglect in number space. When filling out a physical lottery ticket, the neglect patients showed the expected bias towards picking numbers placed on the right-hand side of the ticket. These results demonstrate that the magnetic attraction towards the right side of mental representations is rather weak and that representational forms of neglect only occasionally co-exist with neglect in physical space","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/67993.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/34103\/1\/Cortex_370_FinalManuscript.pdf","pdfHashValue":"2d785d73575df8579d51e9983926997d1afbfaa9","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:34103<\/identifier><datestamp>\n      2018-01-24T03:02:41Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D42:4246<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Lucky numbers : spatial neglect affects physical, but not representational, choices in a Lotto task.<\/dc:title><dc:creator>\n        Loetscher, Tobias<\/dc:creator><dc:creator>\n        Nicholls, Michael E. R.<\/dc:creator><dc:creator>\n        Towse, John N.<\/dc:creator><dc:creator>\n        Bradshaw, John L.<\/dc:creator><dc:creator>\n        Brugger, Peter<\/dc:creator><dc:subject>\n        BF Psychology<\/dc:subject><dc:description>\n        Spatial neglect can be characterized by a “magnetic attraction” towards the right side of a visual stimulus array and a selection of stimuli from that hemispace. This study examined whether these distinctive characteristics in visuo-motor space are also evident in representational number space. Given that numbers are thought to be represented along a left-to-right oriented mental number line, an affinity for the spontaneous selection of larger numbers was anticipated for neglect patients. Contrary to this expectation, neglect patients (n = 20) picked a similar range of numbers compared to controls (n = 17) when generating a number between 1000 and 10 000 and when playing an imaginary lottery game. There was, however, a positive correlation between the biases for the imaginary lottery, number generation and a number bisection task – demonstrating that exploration asymmetries along the mental number line are consistent within individuals across tasks. Some of the patients selected smaller numbers in all of these tasks, confirming reports of dissociations between physical and numerical-representational forms of neglect. Conversely, only four (20%) of the patients could reliably be classified as demonstrating a neglect in number space. When filling out a physical lottery ticket, the neglect patients showed the expected bias towards picking numbers placed on the right-hand side of the ticket. These results demonstrate that the magnetic attraction towards the right side of mental representations is rather weak and that representational forms of neglect only occasionally co-exist with neglect in physical space.<\/dc:description><dc:date>\n        2010-05<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/34103\/1\/Cortex_370_FinalManuscript.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.cortex.2009.06.010<\/dc:relation><dc:identifier>\n        Loetscher, Tobias and Nicholls, Michael E. R. and Towse, John N. and Bradshaw, John L. and Brugger, Peter (2010) Lucky numbers : spatial neglect affects physical, but not representational, choices in a Lotto task. Cortex, 46 (5). pp. 685-690. ISSN 0010-9452<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/34103\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/j.cortex.2009.06.010","http:\/\/eprints.lancs.ac.uk\/34103\/"],"year":2010,"topics":["BF Psychology"],"subject":["Journal Article","PeerReviewed"],"fullText":" \nLucky numbers: Spatial neglect affects physical, but \nnot representational, choices in a Lotto task \n \n \n \n \n \nTobias Loetscher1,2 \nMichael E.R. Nicholls1 \nJohn N. Towse3 \nJohn L. Bradshaw4 \nPeter Brugger2 \n \n \n \n \n \n1 School of Behavioural Sciences, University of Melbourne, Melbourne, Australia \n2 Department of Neurology, University Hospital Zurich, Zurich, Switzerland \n3 Psychology Department, Lancaster University, Lancaster, U.K. \n4 School of Psychology, Psychiatry and Psychological Medicine, Monash University, \nAustralia \n \n \n \n \nMANUSCRIPT INFORMATION: \nTotal number of pages: 18 \nNumber of words: 3419 (main text) \nNumber of Figures: 1 \n \n \nTo appear in the journal Cortex. Please consult this journal for a final, authoritative version. \n \n \n \nCorresponding author: Tobias Loetscher, School of Behavioural Sciences, University of \nMelbourne, Parkville, VIC 3010, Australia; phone ++61 3 8344 4303; FAX: ++61 3 9347 \n6618; e-mail: tobias.loetscher@alumni.ethz.ch \n  2 \nAbstract  \nSpatial neglect can be characterized by a “magnetic attraction” towards the right side of a \nvisual stimulus array and a selection of stimuli from that hemispace. This study examined \nwhether these distinctive characteristics in visuo-motor space are also evident in \nrepresentational number space. Given that numbers are thought to be represented along a left-\nto-right oriented mental number line, an affinity for the spontaneous selection of larger \nnumbers was anticipated for neglect patients. Contrary to this expectation, neglect patients \n(n=20) picked a similar range of numbers compared to controls (n=17) when generating a \nnumber between 1,000 and 10,000 and when playing an imaginary lottery game. There was, \nhowever, a positive correlation between the biases for the imaginary lottery, number \ngeneration and a number bisection task - demonstrating that exploration asymmetries along \nthe mental number line are consistent within individuals across tasks. Some of the patients \nselected smaller numbers in all of these tasks, confirming reports of dissociations between \nphysical and numerical-representational forms of neglect. Conversely, only four (20%) of the \npatients could reliably be classified as demonstrating a neglect in number space. When filling \nout a physical lottery ticket, the neglect patients showed the expected bias towards picking \nnumbers placed on the right-hand side of the ticket. These results demonstrate that the \nmagnetic attraction towards the right side of mental representations is rather weak and that \nrepresentational forms of neglect only occasionally co-exist with neglect in physical space.  \n \nKeywords:  \nSpace representation, representational neglect, spatial attention, mental number line, \nnumerical cognition \nAcknowledgments \nThis study was supported by a grant from the Swiss National Science Foundation to T.L. \n  3 \n1. Introduction \nThe ability to shift spatial attention is fundamental for effective interactions with the world. \nThe importance of spatial attention is particularly evident in patients suffering from right \nbrain damage and symptoms of spatial neglect. A key characteristic in many of these patients \nis the automatic orienting of attention towards visual stimuli located on the ipsilesional side \n(D'Erme, Robertson et al., 1992; Gainotti, D'Erme et al., 1991) and the consecutive \ndifficulties in disengaging and reorienting attention from these stimuli (Posner, Walker et al., \n1984). Spatial neglect can therefore lead to bizarre behaviors such as bumping into objects \nplaced on the left, ignoring people situated on the left or eating only the right side of a dish. \nIntriguingly, the disorder of spatial neglect is not restricted to physical space, but also affects \nthe generation and\/or exploration of mental images (Bisiach and Luzzatti, 1978). Thus, when \nneglect patients describe familiar places, maps or other geographical facts from memory, they \nmay fail to name left-sided, but not right-sided landmarks of the imagined spatial layout (e.g., \nBartolomeo, D'Erme et al., 1994; Meador, Loring et al., 1987; Rode, Rossetti et al., 2004). \n \nIn a putatively independent line of research, cognitive psychologists are concerned with how \nnumbers are mentally represented and processed. Results of psychophysical experiments (e.g., \nDehaene, Bossini et al., 1993; Moyer and Landauer, 1967; Restle, 1970) suggest that \nnumerical magnitudes are represented on an analogue, oriented “mental number line”, with \nsmall numbers placed on the left, and larger numbers on the right side of space. Zorzi, Priftis \net al., (2002) tested this account of a mental number line in patients with left spatial neglect. \nThey reasoned that, if the numbers are spatially represented on a mental number line, then \nneglect patients who bisect physical lines to the right of the true center, should show a similar \nrightward bias for mental number lines. In support of this proposition, when asked to identify \nthe middle between two numbers (e.g. 1 & 9), neglect patients systematically placed the \n  4 \nbisection to the right of true centre (e.g. 6 or 7). These findings are an impressive \ndemonstration of the close interaction between spatial and numerical processing and are in \nline with research showing that space and numbers are intricately linked in the brain’s \norganization - with the parietal lobes playing a crucial role in this association (see de Hevia, \nVallar et al., 2008; Hubbard, Piazza et al., 2005; Wood and Fischer, 2008; Sandrini and \nRusconi, In Press). Indeed, it has been suggested that the parietal circuits involved in shifting \nattention in the external world are homologous to those that shift the spotlight of attention \nalong mental representations such as the number line (e.g., Dehaene, Piazza et al., 2003; \nFischer, Castel et al., 2003; Hubbard, Piazza et al., 2005). \n \nThe current study further examined the relation between spatial disorder and number \nprocessing in neglect patients using an ensemble of novel tasks. To date, many studies that \nhave explored attention along the mental number line have used bisection tasks, which \npotentially are analogous to physical line bisection tasks (see Umiltà, Priftis et al., 2009). \nBesides a rightward bias in line bisection tasks, neglect patients also show a “magnetic \nattraction” towards right-sided visual stimuli (De Renzi, Gentilini et al., 1989) and select \nitems from that side from a range of available response alternatives (Campbell and Oxbury, \n1976; Costa, Vaughan et al., 1969). For an array of horizontally arranged stimuli, neglect \npatients begin by naming objects on the right, whereas controls name objects on the left \n(Gainotti, D'Erme et al., 1991). Starting position is thought to be a particularly sensitive \nmeasure of visuo-spatial neglect (Azouvi, Samuel et al., 2002) and may detect residual \nimpairment after apparent recovery from neglect (Campbell and Oxbury, 1976; Mattingley, \nBradshaw et al., 1994). One specific aim of this study was to assess whether the distinctive \nfeatures of an initial rightward orientation and selection bias in visuo-motor space can also be \nfound in number space using a variety of tasks that allowed patients to select their response \n  5 \nfrom a range of correct response alternatives. The tasks were designed to involve every-day \nnumerical decision behavior without placing a high load on working memory (in contrast to \nthe abstract randomization procedure used by Loetscher and Brugger, 2009). They were \nexpected to provide further insight into systematic biases in numerical choice pertaining to the \npresence of hemispatial neglect. \n \nThe first task required participants to generate spontaneously a number between 1,000 and \n10,000 (Kubovy, 1977). This apparently simple task is potentially informative because a \nresponse is highly underspecified (i.e. there is a large range to sample from) and thus offers \nopportunities for schemata and representations to influence response selection (Scott, Barnard \net al., 2001). If numbers on the right side of the mental number line are more salient than \nthose on the left side, a rightward bias should be observed. Second, a ‘Lotto’ task was \nadministered, similar to an actual game highly popular in Switzerland. The Lotto task was \nadministered in two forms: one provided a physical record sheet, the other required use of a \nmental representation of the number range on this sheet. While a rightward bias was predicted \nfor both versions, dissociations were considered possible in some patients; such dissociations \nbetween physical and representational forms of neglect were previously described (Doricchi, \nGuariglia et al., 2005). Finally, a more traditional mental number line bisection task was \nadministered. The relationship between the biases across the different tasks was assessed \nusing a series of correlations. If asymmetries in the mental exploration of numbers are \nconsistent within individuals, a correlation should be observed between the tasks. Given that \nphysical and mental forms of neglect are dissociated in some individuals (Doricchi, Guariglia \net al., 2005), the correlation between the tasks that tap these functions may show little or no \ncorrelation. \n \n  6 \n2. Methods: \n2.1 Participants: \nTwenty patients (17 men) with left spatial neglect after a right hemisphere lesion and 17 \ncontrol patients (12 men) without spatial neglect after a right hemisphere lesion participated in \nthis study. The presence of spatial neglect was assessed by a series of paper and pencil tests, \nwhich included a line bisection task, a cancellation task, figure copying, reading and a figural \nfluency task (see Loetscher and Brugger, 2009, for task details and cut-off criteria). Inclusion \ncriteria for the neglect group were symptoms of left-sided neglect in at least two of these tests, \nwhereas the control group generally showed no neglect behavior in any task. The neglect \ngroup (mean age = 65 years, S.D. = 11) was older than the control group (mean age = 54 \nyears, S.D. = 11; t(35) = 3.0, p < .01). Importantly, however, the two groups did not differ in \nrespect to lesion etiology, days since incident, presence of visual field defects, years of \neducation and handedness (p > .2 in all cases). Testing was performed in accordance with the \nethical standards laid down in the 1964 Declaration of Helsinki. All participants provided \nwritten informed consent prior to participation. \n \n2.2 Numerical Tasks \nThree numerical tasks were administered to the patients. There was a time gap of at least 5 \nminutes between any two numerical tasks to avoid possible carry-over effects. During this \ntime the patients performed either paper and pencil neglect tasks or other neuropsychological \ntests. \n \n2.2.1 Number Generation Task: \nIn the number generation task participants spontaneously named the first number between \n1,000 and 10,000 that came to mind. The question was repeated using exactly the same \n  7 \nwording in case participants asked for clarification or if they produced a number outside the \ngiven range. The oral response was recorded by the experimenter.  \n \n2.2.2 Lottery Task: \nFor this experiment we adapted the Swiss Lotto game, which is very popular in Switzerland. \nIn the original game, participants pick six numbers from a set of 45 (i.e. from numbers \nranging from 1 to 45) by marking them on a lottery ticket. Six winning numbers are drawn by \na random number generator and the lucky participants, whose chosen numbers are drawn, \nreceive a monetary jackpot prize.  \n \nIn our adapted lottery game there were two conditions. In the imaginary condition, \nparticipants spontaneously named six numbers from a set of 45, which might be drawn the \nfollowing weekend. Importantly, before the participants were asked to generate the numbers, \nit was stressed that they should try to choose numbers randomly and not to pick significant \nnumbers like birthdays, anniversaries, street or house numbers as they might would do when \nplaying real lotto (see Heinze and Riedwyl, 1998). Furthermore, familiarity with the game \nwas assessed for each participant (e.g., whether the rules of the game are known by heart, how \nregularly they play). Oral responses were recorded by the experimenter. For each participant \nan imaginary lottery index was calculated as \n. The index scores \ncould range from -100 to +100. A negative imaginary lottery score indicates a bias towards \nthe selection of smaller numbers, whereas a positive score denotes a bias towards larger \nnumbers. Thus, a score of +100 indicates that all selected numbers were larger than the \nmiddle number (23). \n  8 \n \nIn the physical lottery condition, which took place roughly 40 minutes after the imaginary \ntask, a real lottery ticket was presented to the participants. On the original Swiss Lotto ticket, \nthe numbers are arranged on a 8 (rows) by 6 (columns) grid, starting with “1” on the top-left \ncorner and the following numbers ordered by their ordinal rank in reading direction, from left \nto right and from top to bottom. Since there are only 45 numbers, the bottom-right corner of \nthe grid is empty in the original ticket. We therefore changed the position of some numbers on \nthe bottom row so that they were arranged symmetrically around the midline of our \nexperimental ticket. This ticket was placed alongside the patient’s midsagittal plane and they \nwere asked to choose six numbers, which might be drawn next weekend. Again, participants \nwere encouraged to pick numbers randomly and not to choose significant numbers as they \nmight do in a real lottery game. They were told that they did not need to remember any of the \npreviously orally generated numbers since this task would have no direct reference to the \nimaginary Lotto task. Like the imaginary lottery index, a physical lottery index was calculated \nfor each participant as \n. A negative physical \nlottery index indicates a bias to the leftward columns; a positive score denotes a rightward \nbias on the graphic lottery ticket. Thus, a score of +100 indicates that all marked numbers laid \non the right side (columns 4 to 6) of the lottery ticket. \n \n2.2.3 Number line bisection task \nA number line bisection task was administered to a subgroup of the participants (same task as \nin Loetscher, Bockisch et al., 2008, inclusion of this task was decided rather late in the study). \nNine of the neglect patients performed the number bisection task, in which eleven ascending \n  9 \n(e.g. 1–7) and eleven descending (e.g. 7-1) one-digit number pairs were read to the patients, \nand they then had to guess the mid-number of the given interval. The selection of one-digit \nstimuli was based on the findings in Zamarian, Egger et al., (2007). For each participant, the \nmean deviation of the true midpoint was calculated, with negative values indicating leftward \nbisections towards smaller numbers and positive values indicating rightward bisections \ntowards larger numbers. \n \n3. Results \n3.1 Number Generation Task \nOne participant was excluded from analysis, because he was unable to respond with a number \nin the correct range. The distribution of responses was remarkably similar for the neglect and \ncontrol group, showing a preference for numbers in the lowest, middle, and uppermost \nquintiles of the numerical intervals (see top panel Figure 1). The magnitude of the generated \nnumber did not differ significantly between the neglect (x¯ = 5278, SD = 3205) and control \ngroup (x¯ = 6328, SD = 3280, U = 131, p > .32). \n \n3.2 Lotto Task \nFamiliarity and knowledge of Lotto rules did not differ between the neglect and control group \n(p > .25 in both cases). Examination of the mean deviation for the imaginary Lotto task \nrevealed a similar leftward bias for both groups (neglect: x¯ = -16.3, SD = 52.1; control: x¯ = -\n22.7, SD = 29.4; U = 159.5, p > .75). Four out of the 20 neglect patients picked more large \nthan small numbers, whereas none of the 17 control patients did so (see mid panel Figure 1 \nfor the distribution of the indices). Bayesian inferential statistics (see, Crawford and \nGarthwaite, (2007) confirmed that the larger-number bias in these four patients was \nsignificantly different to the controls (Bayesian p < .042, one tailed). There was a positive \n  10 \ncorrelation between the magnitude of the generated number between 1,000 and 10,000 and the \nimaginary Lotto index in the neglect- (Spearman’s rho = .49; p < .04), but not the control-\ngroup (Spearman’s rho = -.06; p > .8). Thus, neglect patients who picked larger numbers in \nthe imaginary Lotto task, also generated higher 4-digit numbers.  \n \nIn the physical lottery task, neglect patients marked significantly more numbers placed on the \nright-hand side of the lottery ticked than did the control patients (neglect: x¯ = 66.7, SD = 46.4; \ncontrol: x¯ = 19.6, SD = 33.5; U = 96, p < .03, see bottom panel Figure 1 for distribution of \nindices). The magnitude of this right-side bias for the physical Lotto task was not related to \nthe bias for the imaginary Lotto task for the neglect- (Spearman’s rho = .19; p > .42) or the \ncontrol-patients (Spearman’s rho = .03; p > .91). \n \n3.3 Number line bisection task \nAs a group, the nine neglect patients did not show a rightward bias when bisecting numerical \nintervals (range from -.27 to .44, x¯ = .08, SD = .22, z = 1.1, p > .26). There were, however, \nstrong correlations between the deviations in the number line bisections tasks and the \nmagnitude of the generated 4-digit number (Spearman’s rho = .77; p < .02) and the imaginary \nLotto task (Spearman’s rho = .69; p < .04). \n \n4. Discussion \nOne of the most distinctive features of spatial neglect in visuo-motor space is an initial \norienting bias towards the right side of a stimulus array and then a selection bias for stimuli \nfrom that side (Azouvi, Samuel et al., 2002). The present study examined whether this bias is \nalso evident in representational number space. In a left-to-right oriented representation of \nnumbers, selection biases would be reflected in an affinity for the spontaneous selection of \n  11 \nlarger numbers from a given numerical interval. Compared to 17 control patients, however, \nthe group of 20 patients with neglect neither picked larger numbers when choosing a number \nbetween 1,000 and 10,000 nor when playing an imaginary lottery game. In these tasks, \ntherefore, there was no indication of a general rightward bias in number space when \nspontaneously selecting from an array of small and large number response alternatives. \nConversely, when filling out a physical lottery ticket, the patients showed a bias towards \npicking numbers placed on the right-hand side of the ticket. \n \nFrom these results, one might conclude that one of the most sensitive clinical measures of \nvisual neglect – an initial rightward orienting bias – does not extend to the mental \nrepresentation of numbers. Thus, while the very first selection from an array of horizontally \narranged visual objects is typically from the right side (Azouvi, Samuel et al., 2002), this \ninitial attraction towards right-sided (i.e. larger) numbers is absent. The very first \nspontaneously selected number from an array of response alternatives is as often a small (left-\nsided) as it as a large (right-sided) number (see top panel Figure 1). This finding is in line \nwith research reported by Bartolomeo, D'Erme et al., (1994), who also failed to find an initial \nrightward orientation in representational space when patients described geographical maps \nfrom memory. Together these studies suggest that initial explorations with the mind’s eye are \nnot magnetically attracted towards the ipsilesional side of mental representations. \n \nSpatial neglect is a heterogeneous disorder with a multitude of manifestations (see Adair and \nBarrett, 2008). Consequently, group comparisons may well fail to reveal the whole story in \nthe pattern of data. Indeed, for the neglect patients, there was a positive correlation between \nthe biases for the imaginary Lotto, number generation and number bisection tasks. Thus, \nindividuals who selected numbers to the left for the imaginary Lotto task, selected leftward \n  12 \nnumbers in the number generation task and also bisected numerical intervals to the left (and \nvice versa for individuals who selected to the right). These correlations demonstrate that \nasymmetries in the exploration along the mental number line are consistent within individuals \nacross the different tasks. Individuals with a rightward bias for all three tasks appear to show \nthe signs of representational neglect, with an inattention to the left side of number space \n(Zorzi, Priftis et al., 2002). In contrast, individuals with a leftward bias for all three tasks may \nbe performing like the controls, with a propensity for selecting smaller numbers. These \npatients thus showed a dissociation between physical and representational neglect, supporting \na previous conjecture that these two forms of neglect can be dissociated (Doricchi, Guariglia \net al., 2005). \n \nIn the imaginary lottery task, 4 out of the 20 neglect patients picked more large than small \nnumbers, whereas none of the 17 controls did so. Bayesian inferential statistics (Crawford and \nGarthwaite, 2007) confirmed that these patients can be considered to suffer from neglect in \nnumber space. The incidence of 20% (4 out of 20) of patients suffering from neglect in \nphysical and representational space lies in the spectrum reported by other investigators using \nnon-numerical tasks, which range from 6% (Bourlon, Pradat-Diehl et al., 2008) to around \n30% (Bartolomeo, Bachoud-Levi et al., 2005; Bartolomeo, D'Erme et al., 1994). While our \ndata on the incidence of neglect in number space is in line with those of previous studies on \nthe incidence of neglect for imagined space, it stands in contrast to the numerous articles \nreporting reliable rightward biases in mental number line bisection tasks (see Umiltà, Priftis et \nal., 2009). The many single-case and small-group studies, however, may not serve as a \nreliable basis for estimating the incidence of neglect in number space in stroke populations. \nOther studies do not report individual bisection data and do thus not allow inferences about \nincidence rates (e.g., Zorzi, Priftis et al., 2006). As of now, only two studies applied the \n  13 \nmental bisection task to more than 10 patients suffering from neglect. In these studies a \nreliable rightward deviation was found in 27% (3 out of 11 patients, Doricchi, Guariglia et al., \n2005) and 45% (10 out of 22 patients, see table S5 in Doricchi, Merola et al., in press). Thus, \nin these relatively large patient samples, neglect in number space was found in fewer than half \nof the patients. \n \nEven for visual-spatial neglect, the reported rate of occurrence after stroke varies from 12% to \n100% (see Bowen, McKenna et al., 1999). With particular reference to the present study, a \nnumber of factors may affect estimated incidence rates of neglect in number space. In \nparticular, tasks requiring more explicit orienting along the mental number line may more \noften document the presence of neglect. Furthermore, an increased salience of numbers used \nmore frequently in everyday language (see Dehaene and Mehler, 1992) might have affected \nthe choices in the number generation tasks. Despite this, the results of our multi-task \nexperiment suggest that neglect in number space may be less prevalent than currently \nassumed. In fact, along with the studies by Doricchi and collaborators (Doricchi, Guariglia et \nal., 2005; Doricchi, Merola et al., in press) the present study questions the idea that a \nrightward bias in number space is found in a majority of patients suffering form visual-spatial \nneglect. Future prospective studies assessing larger, consecutive samples of patients are \nneeded to shed more light on this issue.  \n \nTo conclude, the results of the current study confirm previous research showing that, while \nvisual exploration of and motor interactions with the real world are severely impaired in \nneglect, spatial exploration with the mind’s eye may not be affected to a comparable extent \n(e.g., Bartolomeo, Bachoud-Levi et al., 2005; Bartolomeo, D'Erme et al., 1994; Bourlon, \nPradat-Diehl et al., 2008; Halsband, Gruhn et al., 1985). This imbalance in the frequencies of \n  14 \nvisuo-motor and representational neglect supports the notion that neglect is predominantly a \ndisorder of exogenous, stimulus-driven allocation of attention with relatively preserved \nendogenous, strategy-driven orienting capacities (Bartolomeo and Chokron, 2002; Natale, \nPosteraro et al., 2005; Sieroff, Decaix et al., 2007; Bourlon, Pradat-Diehl et al., 2008). \n  15 \nReferences: \nADAIR JC AND BARRETT AM. Spatial neglect: Clinical and neuroscience review - a wealth of information on \nthe poverty of spatial attention. Annals of the New York Academy of Sciences, 1142: 21-43, 2008. \nAZOUVI P, SAMUEL C, LOUIS-DREYFUS A, BERNATI T, BARTOLOMEO P, BEIS JM, CHOKRON S, \nLECLERCQ M, MARCHAL F, MARTIN Y, DE MONTETY G, OLIVIER S, PERENNOU D, \nPRADAT-DIEHL P, PRAIRIAL C, RODE G, SIEROFF E, WIART L, and ROUSSEAUX M. \nSensitivity of clinical and behavioural tests of spatial neglect after right hemisphere stroke. Journal of \nNeurology, Neurosurgery & Psychiatry, 73: 160-166, 2002. \nBARTOLOMEO P, BACHOUD-LEVI AC, AZOUVI P, and CHOKRON S. Time to imagine space: A \nchronometric exploration of representational neglect. Neuropsychologia, 43: 1249-57, 2005. \nBARTOLOMEO P and CHOKRON S. Orienting of attention in left unilateral neglect. Neuroscience & \nBiobehavioral Reviews, 26: 217-34, 2002. \nBARTOLOMEO P, D'ERME P, and GAINOTTI G. The relationship between visuospatial and representational \nneglect. Neurology, 44: 1710-4, 1994. \nBISIACH E and LUZZATTI C. Unilateral neglect of representational space. Cortex, 14: 129-133, 1978. \nBOURLON C, PRADAT-DIEHL P, DURET C, AZOUVI P, and BARTOLOMEO P. Seeing and imagining the \n\"Same\" Objects in unilateral neglect. Neuropsychologia, 46: 2602-2606, 2008. \nBOWEN A, MCKENNA K, and TALLIS RC. Reasons for variability in the reported rate of occurrence of \nunilateral spatial neglect after stroke. Stroke, 30: 1196-1202, 1999. \nCAMPBELL DC and OXBURY JM. Recovery from unilateral visuo spatial neglect? Cortex, 12: 303-312, 1976. \nCOSTA LD, VAUGHAN G, HORWITZ M, and RITTER W. Patterns of behavioral deficit associated with \nvisual spatial neglect. Cortex, 5: 242-263, 1969. \nCRAWFORD JR and GARTHWAITE PH. Comparison of a single case to a control or normative sample in \nneuropsychology: Development of a bayesian approach. Cognitive Neuropsychology, 24: 343 - 372, \n2007. \nD'ERME P, ROBERTSON I, BARTOLOMEO P, DANIELE A, and GAINOTTI G. Early rightwards orienting \nof attention on simple reaction time performance in patients with left-sided neglect. Neuropsychologia, \n30: 989-1000, 1992. \nDE HEVIA MD, VALLAR G, and GIRELLI L. Visualizing numbers in the mind's eye: The role of visuo-spatial \nprocesses in numerical abilities. Neuroscience & Biobehavioral Reviews, 32: 1361-1372, 2008. \nDE RENZI E, GENTILINI M, FAGLIONI P, and BARBIERI C. Attentional shift towards the rightmost stimuli \nin patients with left visual neglect. Cortex, 25: 231-7, 1989. \nDEHAENE S, BOSSINI S, and GIRAUX P. The mental representation of parity and number magnitude. Journal \nof Experimental Psychology: General, 122: 371-396, 1993. \nDEHAENE S and MEHLER J. Cross-linguistic regularities in the frequency of number words. Cognition, 43: 1-\n29, 1992. \nDEHAENE S, PIAZZA M, PINEL P, and COHEN L. Three parietal circuits for number processing. Cognitive \nNeuropsychology, 20: 487-506, 2003. \n  16 \nDORICCHI F, GUARIGLIA P, GASPARINI M, and TOMAIUOLO F. Dissociation between physical and \nmental number line bisection in right hemisphere brain damage. Nature Neuroscience, 8: 1663-1665, \n2005. \nDORICCHI F, MEROLA S, AIELLO M, GUARIGLIA P, BRUSCHINI M, GEVERS W, GASPARINI M, and \nTOMAIUOLO F. Spatial orienting biases in the decimal numeral system. Current Biology, in press. \nFISCHER MH, CASTEL AD, DODD MD, and PRATT J. Perceiving numbers causes spatial shifts of attention. \nNature Neuroscience, 6: 555-6, 2003. \nGAINOTTI G, D'ERME P, and BARTOLOMEO P. Early orientation of attention toward the half space \nipsilateral to the lesion in patients with unilateral brain damage. Journal of Neurology, Neurosurgery & \nPsychiatry, 54: 1082-9, 1991. \nHALSBAND U, GRUHN S, and ETTLINGER G. Unilateral spatial neglect and defective performance in one \nhalf of space. International Journal of Neuroscience, 28: 173-195, 1985. \nHEINZE N and RIEDWYL H. How to win more : Strategies for increasing a lottery win. Natick, Mass: A K \nPeters, 1998. \nHUBBARD EM, PIAZZA M, PINEL P, and DEHAENE S. Interactions between number and space in parietal \ncortex. Nature Reviews Neuroscience, 6: 435-48, 2005. \nKUBOVY M. Response availability and the apparent spontaneity of numerical choices. Journal of Experimental \nPsychology: Human Perception and Performance, 3: 359-364, 1977. \nLOETSCHER T, BOCKISCH C, and BRUGGER P. Looking for the answer: The mind’s eye in number space. \nNeuroscience, 151: 725-729, 2008. \nLOETSCHER T and BRUGGER P. Random number generation in neglect patients reveals enhanced response \nstereotypy, but no neglect in number space. Neuropsychologia, 47: 276-279, 2009. \nMATTINGLEY JB, BRADSHAW JL, BRADSHAW JA, and NETTLETON NC. Residual rightward attentional \nbias after apparent recovery from right hemisphere damage: Implications for a multicomponent model \nof neglect. Journal of Neurology, Neurosurgery & Psychiatry, 57: 597-604, 1994. \nMEADOR KJ, LORING DW, BOWERS D, and HEILMAN KM. Remote memory and neglect syndrome. \nNeurology, 37: 522-6, 1987. \nMOYER RS and LANDAUER TK. Time required for judgements of numerical inequality. Nature, 215: 1519-\n20, 1967. \nNATALE E, POSTERARO L, PRIOR M, and MARZI CA. What kind of visual spatial attention is impaired in \nneglect? Neuropsychologia, 43: 1072-1085, 2005. \nPOSNER MI, WALKER JA, FRIEDRICH FJ, and RAFAL RD. Effects of parietal injury on covert orienting of \nattention. Journal of Neuroscience, 4: 1863-74, 1984. \nRESTLE F. Speed of adding and comparing numbers. Journal of Experimental Psychology, 83: 274-278, 1970. \nRODE G, ROSSETTI Y, PERENIN MT, and BOISSON D. Geographic information has to be spatialised to be \nneglected: A representational neglect case. Cortex, 40: 391-397, 2004. \nSANDRINI M and RUSCONI E. A brain for numbers. Cortex, In Press. \nSCOTT S, BARNARD P, and MAY J. Specifying executive representations and processes in number generation \ntasks. Quarterly Journal of Experimental Psychology: Section A, 54: 641-664, 2001. \n  17 \nSIEROFF E, DECAIX C, CHOKRON S, and BARTOLOMEO P. Impaired orienting of attention in left \nunilateral neglect: A componential analysis. Neuropsychology, 21: 94-113, 2007. \nUMILTÀ C, PRIFTIS K, and ZORZI M. The spatial representation of numbers: Evidence from neglect and \npseudoneglect. Experimental Brain Research, 192: 561-569, 2009. \nWOOD G and FISCHER MH. Numbers, space, and action - from finger counting to the mental number line and \nbeyond. Cortex, 44: 353-358, 2008. \nZAMARIAN L, EGGER C, and DELAZER M. The mental representation of ordered sequences in visual \nneglect. Cortex, 43: 542-550, 2007. \nZORZI M, PRIFTIS K, MENEGHELLO F, MARENZI R, and UMILTA C. The spatial representation of \nnumerical and non-numerical sequences: Evidence from neglect. Neuropsychologia, 44: 1061-1067, \n2006. \nZORZI M, PRIFTIS K, and UMILTA C. Brain damage: Neglect disrupts the mental number line. Nature, 417: \n138-9, 2002. \n \n  18 \nFigure Legend: \nFigure 1 \nFrequencies of the generated 4-digit number lying between 1,000 and 10,000 (top panel), \n“imaginary lottery” indices (mid panel) and “physical lottery” indices (bottom panel) with the  \ndata of the neglect patients shown on the left, and the controls on the right side, respectively. \nThe first two panels represent the selection bias in number space, the bottom panel the \nselection bias in physical space. For each of the three panels, the possible range of responses \nwas split in 5 classes of equal length and the participants' answers were assigned accordingly. \nThe most leftward bar in each graph thus denotes a strong bias towards the selection of \nsmaller numbers in the numerical tasks and the left-side of physical space in the “physical \nlottery task” respectively. This bias gradually decreases from left to right, with the middle bar \nrepresenting the frequency of responses around the center of the possible selection ranges and \nthe most rightward bar denoting a strong bias towards large numbers and right-side of space. \nSee main text for calculation of indices. \n \n  19 \n \n"}