{"doi":"10.5194\/angeo-19-1613-2001","coreId":"70870","oai":"oai:eprints.lancs.ac.uk:9995","identifiers":["oai:eprints.lancs.ac.uk:9995","10.5194\/angeo-19-1613-2001"],"title":"Coordinated cluster and ground-based instrument observation of transient changes in the magnetopause boundary layer during an interval of predominantly northward IMF: Relation to reconnection pulses and FTE signatures","authors":["Lockwood, M.","Fazakerley, A. N.","Opgenoorth, H. J.","Moen, J.","van Eyken, A. P.","Dunlop, M. W.","Bosqued, J. M.","Lu, G.","Cully, C.","Eglitis, P.","McCrea, I. W.","Hapgood, M. A.","Wild, M. N.","Stamper, R.","Denig, W. F.","Taylor, M. G. G. T.","Wild, J. A.","Provan, G.","Amm, O.","Kauristie, K.","Pulkkinen, T. I.","Strömme, A.","Prikryl, P.","Pitout, F.","Balogh, A.","Rème, H.","Behlke, R.","Hansen, T. L.","Greenwald, R. A.","Frey, H. U.","Morley, S. K.","Alcaydé, D.","Blelly, P.-L.","Donovan, E. F.","Engebretson, M. J.","Lester, M.","Watermann, J. F.","Marcucci, M. F."],"enrichments":{"references":[{"id":16392406,"title":"A case and statistical study of transient magnetic ﬁeld events at geosynchronous orbit and their solar wind,","authors":[],"date":"1995","doi":"10.1029\/94ja03144","raw":"Bodokova, N. L., Zastenker, G. N., and Sibeck, D. G.: A case and statistical study of transient magnetic ﬁeld events at geosynchronous orbit and their solar wind, J. Geophys. Res., 100, 5643– 5656, 1995.","cites":null},{"id":16392651,"title":"A ﬂux transfer event observed at the magnetopause by the equator-S spacecraft and in the ionosphere by the CUTLASS HF radar,","authors":[],"date":"1999","doi":"10.1007\/s00585-999-0707-z","raw":"Neudegg, D. A., Yeoman, T. K., Cowley, S. W. H., Provan, G., Haerendel, G., Baumjohann, W., Auster, U., Fornacon, K.-H., Georgescu, E., and Owen, C. J., A ﬂux transfer event observed at the magnetopause by the equator-S spacecraft and in the ionosphere by the CUTLASS HF radar, Ann. Geophysicae, 17, 707– 711, 1999.","cites":null},{"id":16392740,"title":"A magnetic boundary signature within ﬂux transfer events,","authors":[],"date":"1987","doi":"10.1016\/0032-0633(87)90065-1","raw":"Rijnbeek, R. P., Farrugia, C. J., Southwood, D. J., Dunlop, M. W., Mier-Jedrejowicz, W. A. C., Chaloner, C. P., Hall, D. S., and Smith, M. F.: A magnetic boundary signature within ﬂux transfer events, Planet. Space Sci., 35, 871–878, 1987.","cites":null},{"id":16392790,"title":"A model for the transient magnetospheric response to sudden solar wind dynamic pressure variations,","authors":[],"date":"1990","doi":"10.1029\/ja095ia04p03755","raw":"Sibeck, D. G.: A model for the transient magnetospheric response to sudden solar wind dynamic pressure variations, J. Geophys. Res., 95, 3755–3771, 1990.","cites":null},{"id":16392788,"title":"A new functional form to study the solar wind control of the magnetopause size and shape,","authors":[],"date":"1997","doi":"10.1029\/97ja00196","raw":"Shue, J.-H., Chao, J. K., Fu, H. C., Russell, C. T., Song, P., Kurana, K. K., and Singer, H. J.: A new functional form to study the solar wind control of the magnetopause size and shape, J. Geophys. Res., 102, 9497, 1997.","cites":null},{"id":16392689,"title":"A quantitative model of magnetosheath plasma in the low-latitude boundary layer, cusp and mantle, in: “Physical signatures of magnetopause boundary layer Processes”,","authors":[],"date":"1994","doi":"10.1007\/978-94-011-1052-5_27","raw":"Onsager, T. G.: A quantitative model of magnetosheath plasma in the low-latitude boundary layer, cusp and mantle, in: “Physical signatures of magnetopause boundary layer Processes”, (Eds) Holtet, J. A. and Egeland, A. NATO ASI Series C, Vol. 425, Kluwer, pp. 385–400, 1994.","cites":null},{"id":16392465,"title":"A search for upstream pressure pulses associated with ﬂux transfer events: An AMPTE\/ISEE case study,","authors":[],"date":"1994","doi":"10.1029\/94ja00575","raw":"Elphic, R. C., Baumjohann, W., Cattell, C. A., L¨ uhr, H., and Smith, M. F.: A search for upstream pressure pulses associated with ﬂux transfer events: An AMPTE\/ISEE case study, J. Geophys. Res., 99, 13, 521–527, 1994.","cites":null},{"id":16392527,"title":"A statistical study of ﬂux transfer event signatures in the dayside aurora: the IMF By-related postnoon-prenoon asymmetry,","authors":[],"date":"1996","doi":"10.1029\/95ja02590","raw":"Karlson, K. A., Øieroset, M., Moen, J., and Sandholt, P. E.: A statistical study of ﬂux transfer event signatures in the dayside aurora: the IMF By-related postnoon-prenoon asymmetry, J Geophys. Res., 101, 59–68, 1996.","cites":null},{"id":16392636,"title":"A statistical survey of dayside pulsed ionospheric ﬂows as seen by the CUTLASS Finland HF radar,","authors":[],"date":"2000","doi":"10.1007\/s00585-000-0445-8","raw":"McWilliams, K. A., Yeoman, T. K., and Provan, G.: A statistical survey of dayside pulsed ionospheric ﬂows as seen by the CUTLASS Finland HF radar, Ann. Geophysicae, 18, 445–453, 2000.","cites":null},{"id":16392737,"title":"A survey of dayside ﬂux transfer events observed by","authors":[],"date":"1984","doi":"10.1029\/ja089ia02p00786","raw":"Rijnbeek, R. P., Cowley, S. W. H., Southwood, D. J., and Russell, C. T.: A survey of dayside ﬂux transfer events observed by the ISEE 1 and 2 magnetometers, J. Geophys. Res., 89, 786–800, 1984.","cites":null},{"id":16392879,"title":"A survey of ﬂux transfer events recorded by UKS spacecraft magnetometer,","authors":[],"date":"1986","doi":"10.1016\/0032-0633(86)90071-1","raw":"Southwood, D. J., Saunders, M. A., Dunlop, M. W., MierJedrzejowicz, W. A. C., and Rijnbeek, R. P.: A survey of ﬂux transfer events recorded by UKS spacecraft magnetometer, Planet. Space Sci., 34, 1349–1359, 1986.","cites":null},{"id":16392684,"title":"A Uniﬁed model of the magnetotail convection in geomagnetically quiet and active times,","authors":[],"date":"1998","doi":"10.1029\/97ja01617","raw":"Nishida, A., Mukai, T., Yamamoto, T., Kokubun, S., and Maezawa, K.: A Uniﬁed model of the magnetotail convection in geomagnetically quiet and active times, J. Geophys. Res., 103, 4409– 4418, 1998.","cites":null},{"id":16392882,"title":"A.: What are ﬂux transfer events?,","authors":[],"date":"1988","doi":"10.1016\/0032-0633(88)90109-2","raw":"Southwood, D. J., Farrugia, C. J., and Saunders, M. A.: What are ﬂux transfer events?, Planet. Space Sci., 36, 503–508, 1988.","cites":null},{"id":16392534,"title":"Aerodynamic aspects of magnetospheric ﬂow,","authors":[],"date":null,"doi":"10.2514\/6.1964-87","raw":"Levy, R., Petschek, H. E., and Siscoe, G. L.: Aerodynamic aspects of magnetospheric ﬂow, AIAA J., 2, 2065, 1964.","cites":null},{"id":16392645,"title":"An extended study of the low-latitude boundary layer on the dawn and the dusk ﬂanks on the magnetosphere,","authors":[],"date":"1987","doi":"10.1029\/ja092ia07p07394","raw":"Mitchell, D. G., Kutchko, F., Williams, D. J., Eastman, T. E., Frank, L. A., and Russell, C. T.: An extended study of the low-latitude boundary layer on the dawn and the dusk ﬂanks on the magnetosphere, J. Geophys. Res., 92, 7394, 1987. Moen, J., Evans, D., Carlson, H. C., and Lockwood, M.: Dayside moving auroral transients related to LLBL dynamics, Geophys.","cites":null},{"id":16392775,"title":"Asymmetric time-dependent and stationary magnetic reconnection at the dayside magnetopause,","authors":[],"date":"1989","doi":"10.1029\/ja094ia11p15099","raw":"Scholer, M.: Asymmetric time-dependent and stationary magnetic reconnection at the dayside magnetopause, J. Geophys. Res., 94, 15, 099–111, 1989.","cites":null},{"id":16392675,"title":"Can random reconnection on the magnetopause produce the low-latitude boundary layer?,","authors":[],"date":"1989","doi":"10.1029\/gl016i003p00227","raw":"Nishida, A.: Can random reconnection on the magnetopause produce the low-latitude boundary layer?, Geophys. Res. Lett., 16, 227–230, 1989.","cites":null},{"id":16392446,"title":"Characteristics of the magnetospheric boundary layer as observed by IMP-6,","authors":[],"date":"1979","doi":"10.1029\/ja084ia05p02019","raw":"Eastman, T. E. and Hones, Jr., E. W., Characteristics of the magnetospheric boundary layer as observed by IMP-6, J. Geophys. Res., 84, 2109, 1979.","cites":null},{"id":16392499,"title":"Cold ion beams in the low-latitude boundary layer during accelerated ﬂow events,","authors":[],"date":"1990","doi":"10.1029\/gl017i012p02245","raw":"Gosling, J. T., Thomsen, M. F., Bame, S. J., Elphic, R. C., and Russell, C. T.: Cold ion beams in the low-latitude boundary layer during accelerated ﬂow events, Geophys. Res. Lett., 17, 2245– 2248, 1990b.","cites":null},{"id":16392571,"title":"Comment on “Mapping the dayside ionosphere to the magnetosphere according to particle precipitation characteristics” by Newell and Meng,","authors":[],"date":"1993","doi":"10.1029\/93gl01967","raw":"Lockwood, M. and Smith, M. F.: Comment on “Mapping the dayside ionosphere to the magnetosphere according to particle precipitation characteristics” by Newell and Meng, Geophys. Res. Lett., 20, 1739–1740, 1993.","cites":null},{"id":16392666,"title":"Comment on “Unexpected features of the ion precipitation in the so-called cleft\/low latitude boundary layer region: Association with sunward convection and occurrence on open ﬁeld lines” by","authors":[],"date":"1994","doi":"10.1029\/94ja01096","raw":"Newell, P. T. and Meng, C.-I.: Comment on “Unexpected features of the ion precipitation in the so-called cleft\/low latitude boundary layer region: Association with sunward convection and occurrence on open ﬁeld lines” by Nishida, A., Mukai, T., Hayakawa, H., Matsuoka, A., Tsuruda, K., Kaya, N., and Fukunishi, H., J. Geophys. Res., 99, 19, 609, 1994b.","cites":null},{"id":16392642,"title":"Convection and auroral response to a southward turning of the IMF: Polar UVI, CUTLASS and IMAGE signatures of transient magnetic ﬂux transfer at the magnetopause,","authors":[],"date":"2000","doi":"10.1029\/2000ja900022","raw":"Milan, S. E., Lester, M., Cowley, S. W. H., and Brittnacher, M.: Convection and auroral response to a southward turning of the IMF: Polar UVI, CUTLASS and IMAGE signatures of transient magnetic ﬂux transfer at the magnetopause, J. Geophys. Res., 105, 15, 741–757, 2000.","cites":null},{"id":16392470,"title":"Coordinated Cluster and ground-based instrument observations structure,","authors":[],"date":"1988","doi":null,"raw":"Farrugia, C.J., etal.: Amulti-instrumentstudyofﬂuxtransferevent1636 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations structure, J. Geophys. Res., 93, 14465–14477, 1988.","cites":null},{"id":16392620,"title":"Coordinated Cluster, ground-based instrumentation and low-altitude satellite observations of transient poleward-moving events in the ionosphere and in the tail lobe, Ann. Geophysicae, this issue,","authors":[],"date":"2001","doi":"10.5194\/angeo-19-1589-2001","raw":"Lockwood, M., Opgenoorth, H., van Eyken, A. P., Fazakerley, A., Bosqued, J.-M., Denig, W., Wild, J., Cully, C., Greenwald, R., Lu, G., Amm, O., Frey, H., Strømme, A., Prikryl, P., Hapgood, M. A., Wild, M. N., Stamper, R., Taylor, M., McCrea, I., Kauristie, K., Pulkkinen, T., Pitout, F., Balogh, A., Dunlop, M., R` eme, H., Behlke, R., Hansen, T., Provan, G., Eglitis, P., Morley, S. K., Alcayd´ e, D., Blelly, P.-L., Moen, J., Donovan, E., Engebretson, M., Lester, M., Waterman, J., and Marcucci, M. F.: Coordinated Cluster, ground-based instrumentation and low-altitude satellite observations of transient poleward-moving events in the ionosphere and in the tail lobe, Ann. Geophysicae, this issue, 2001. Lotko, W. and Sonnerup, B. U. Ø.: The low-latitude boundary layer on closed ﬁeld lines, in: Physics of the Magnetopause, Geophys.","cites":null},{"id":16392699,"title":"coordinated ground-based, low altitude satellite and Cluster observations on global and local scales, during a transient postnoon sector excursion of the magnetospheric cusp, Ann. Geophysicae, this issue,","authors":[],"date":"2001","doi":null,"raw":"Opgennoorth, H. J., Lockwood, M., Alcayd´ e, D., et al., coordinated ground-based, low altitude satellite and Cluster observations on global and local scales, during a transient postnoon sector excursion of the magnetospheric cusp, Ann. Geophysicae, this issue, 2001.","cites":null},{"id":16392787,"title":"Counter-streaming electron beams at ∼1RE over the auroral zone,","authors":[],"date":"1980","doi":"10.1029\/ja085ia01p00092","raw":"Sharp, R. D., Shelley, E. G., Johnstone, R. G., and Ghielmetti, A. G.: Counter-streaming electron beams at ∼1RE over the auroral zone, J. Geophys. Res., 85, 92, 1980.","cites":null},{"id":16392486,"title":"Counterstreaming magnetosheath ions in the dayside low latitude boundary layer,","authors":[],"date":"1992","doi":"10.1029\/92gl00090","raw":"Fuselier, S. A., Klumpar, D. M., and Shelley, E. G.: Counterstreaming magnetosheath ions in the dayside low latitude boundary layer, Geophys. Res. Lett., 19, 425–428, 1992.","cites":null},{"id":16392760,"title":"Dayside auroral conﬁgurations: responses to southward and northward rotations of the interplanetary magnetic ﬁeld,","authors":[],"date":"1996","doi":"10.1029\/98ja01541","raw":"Sandholt, P. E., Farrugia, C. J., Moen, J., and Cowley, S. W. H.: Dayside auroral conﬁgurations: responses to southward and northward rotations of the interplanetary magnetic ﬁeld, J. Geophys. Res., in press, 1999.M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1639 Sanny, J., Sibeck, D. G., Venturini, C. C., and Russell, C. T.: A statistical study of transient events in the outer dayside magnetosphere, J. Geophys. Res., 101, 4939–4952, 1996.","cites":null},{"id":16392902,"title":"Diffusion at the magnetopause: A theoretical perspective, in:","authors":[],"date":"1995","doi":"10.1029\/gm090p0321","raw":"Winske, D., Thomas, V. A., and Omidi, N.: Diffusion at the magnetopause: A theoretical perspective, in: Physics of the Magnetopause, Geophys. Monogr Ser., vol. 90, (Eds) Song, P., Sonnerup, B. U. ¨ O., and Thomsen, M. F., AGU, Washington, D.C., pp. 321–330, 1995.","cites":null},{"id":16392896,"title":"Diffusion processes: an observational perspective, in:","authors":[],"date":"1995","doi":"10.1029\/gm090p0331","raw":"Treumann, R. A., LaBelle, J., and Bauer, T. M.: Diffusion processes: an observational perspective, in: Physics of the magnetopause, Geophys. Mono. 90, (Eds) Song, P., Sonnerup, B. U.¨ O., and Thompsen, M., pp. 331–341, 1995.","cites":null},{"id":16392488,"title":"Electron and ion signatures of ﬁeld line topology at the low shear magnetopause,","authors":[],"date":"1995","doi":"10.1029\/96ja03635","raw":"Fuselier, S., Anderson, B. J., and Onsager, T.G.: Electron and ion signatures of ﬁeld line topology at the low shear magnetopause, J. Geophys. Res., 100, 11805–11814, 1995.","cites":null},{"id":16392511,"title":"Electrons in the boundary layers near the dayside magnetopause,","authors":[],"date":"1991","doi":"10.1029\/90ja02137","raw":"Hall, D. S., Chanelor, C. P., Bryant, D. A., Lepine, D. R., and Tritakis, V. P.: Electrons in the boundary layers near the dayside magnetopause, J. Geophys. Res., 96, 7869, 1991.","cites":null},{"id":16392531,"title":"Electrons in the ionospheric source cone: evidence for runaway electrons as carriers of downward Birkeland currents,","authors":[],"date":"1992","doi":"10.1029\/gl009i008p00873","raw":"Klumpar, D. M. and Heikkila, W. J.: Electrons in the ionospheric source cone: evidence for runaway electrons as carriers of downward Birkeland currents, Geophys. Res. Lett., 9, 873, 1992.","cites":null},{"id":16392408,"title":"Empirical polar cap potentials,","authors":[],"date":"1997","doi":"10.1029\/96ja01742","raw":"Boyle, C. B., Reiff, P. H., and Hairston, M. R.: Empirical polar cap potentials, J. Geophys. Res., 102, 111–125, 1997.","cites":null},{"id":16392899,"title":"Energetic particle observations in the low-latitude boundary layer,","authors":[],"date":"1978","doi":"10.1029\/ja090ia06p05097","raw":"Williams, D. J., Mitchell, D. G., Eastman, T. E., and Frank, L. A.: Energetic particle observations in the low-latitude boundary layer, J. Geophys. Res., 92, 5097, 1978.","cites":null},{"id":16392781,"title":"Energetic protons, alpha particles and electrons in magnetic ﬂux transfer events,","authors":[],"date":null,"doi":"10.1029\/ja087ia04p02169","raw":"Scholer, M., Hovestadt, D., Ipavich, F. M., and Gloeckler, G.: Energetic protons, alpha particles and electrons in magnetic ﬂux transfer events, J. Geophys. Res., 87, 2169, 1982b.","cites":null},{"id":16392546,"title":"Energy and pitch angle dispersions of LLBL\/cuspM. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1637 ions seen at middle altitudes: predictions by the open magnetosphere model,","authors":[],"date":"1997","doi":"10.1007\/s005850050565","raw":"Lockwood, M.: Energy and pitch angle dispersions of LLBL\/cuspM. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1637 ions seen at middle altitudes: predictions by the open magnetosphere model, Ann. Geophysicae, 15, 1501–1511, 1997b.","cites":null},{"id":16392633,"title":"ESR and EISCAT observations of the response of the cusp and cleft to IMF orientation changes,","authors":[],"date":"2000","doi":"10.1007\/s005850000283","raw":"McCrea, I. W., Lockwood, M., Moen, J., Pitout, F., Eglitis, P., and Aylward, A. D.: ESR and EISCAT observations of the response of the cusp and cleft to IMF orientation changes, Ann. Geophysicae, 18, 1009–1026, 2000.","cites":null},{"id":16392869,"title":"Evidence for magnetic ﬁeld reconnection at the Earth’s magnetopause,","authors":[],"date":"1981","doi":"10.1029\/ja086ia12p10049","raw":"Sonnerup, B. U. ¨ O., Paschmann, G., Papamastorakis, I., Sckopke, N., Haerendel, G., Bame, S. J., Ashbridge, J. R., Gosling, J. T., and Russell, C. T.: Evidence for magnetic ﬁeld reconnection at the Earth’s magnetopause, J. Geophys. Res., 86, 10049–10067, 1981.","cites":null},{"id":16392414,"title":"Evidence of component magnetic merging equatorward of the cusp ,","authors":[],"date":"1999","doi":"10.1029\/1999ja900175","raw":"Chandler, M. O., Fuselier, S. A., Lockwood, M., and Moore, T. E.: Evidence of component magnetic merging equatorward of the cusp , J. Geophys. Res., 104, 22623–22648, 1999. Collin, H. L., Sharp, R. D., and Shelley, E. G.: The occurrence and characteristics of electron beams over the polar regions, J.","cites":null},{"id":16392523,"title":"Evidence of magnetospheric cusp proton acceleration by magnetic merging at the dayside magnetopause,","authors":[],"date":"1977","doi":"10.1029\/ja082i025p03623","raw":"Hill, T. W. and Reiff, P. H.: Evidence of magnetospheric cusp proton acceleration by magnetic merging at the dayside magnetopause, J. Geophys. Res., 82, 3623, 1977.","cites":null},{"id":16392516,"title":"Exploring the magnetospheric boundary layer,","authors":[],"date":"1992","doi":"10.1016\/0032-0633(92)90099-a","raw":"Hapgood, M. A. and Bryant, D. A.: Exploring the magnetospheric boundary layer, Planet. Space Sci., 40, 1431–1459, 1992.","cites":null},{"id":16392778,"title":"Field line topology determined by energetic particles during a possible magnetopause reconnection event,","authors":[],"date":null,"doi":"10.1029\/ja087ia08p06073","raw":"Scholer, M., Daly, P. W., Paschmann, G., and Fritz, T. A.: Field line topology determined by energetic particles during a possible magnetopause reconnection event, J. Geophys. Res., 87, 6073, 1982a.","cites":null},{"id":16392901,"title":"First results from the RAPIDImagingEnergeticParticleSpectrometer, Ann.Geophysicae, this issue,","authors":[],"date":"2001","doi":null,"raw":"Wilken, B., Daly, P. W., Mall, U., et al., First results from the RAPIDImagingEnergeticParticleSpectrometer, Ann.Geophysicae, this issue, 2001. Wing, S., Newell, P. T., and Onsager, T. G.: Modelling the entry of the magnetosheath electrons into the dayside ionosphere, J.","cites":null},{"id":16392900,"title":"First simultaneous oberservations of ﬂux transfer events at the high-latitude magnetopause by the Cluster spacecraft and pulsed radar signatures in the conjugate ionosphere by the CUTLASS and EISCAT radars, Ann. Geophysicae, this issue,","authors":[],"date":"2001","doi":"10.5194\/angeo-19-1491-2001","raw":"Wild, J. A., Cowley, S. W. H., Davies, J. A., Khan, H., Lester, M., Milan, S. E., Provan, G., Yeoman, T. K., Balogh, A., Dunlop, M. W., Fornacon, K.-H., and Georgescu, E.: First simultaneous oberservations of ﬂux transfer events at the high-latitude magnetopause by the Cluster spacecraft and pulsed radar signatures in the conjugate ionosphere by the CUTLASS and EISCAT radars, Ann. Geophysicae, this issue, 2001.","cites":null},{"id":16392784,"title":"Flux transfer events interpreted in terms of a generalized model for Petschek-type reconnection,","authors":[],"date":"1991","doi":"10.1016\/0273-1177(91)90004-4","raw":"Semenov, V. S., Kubyshkin, I. V., Biernat, H. K., Heyn, M. F., Rijnbeek, R. P., Besser, B. P., and Farrugia, C. J.: Flux transfer events interpreted in terms of a generalized model for Petschek-type reconnection, Adv. Space Res., 11, 9, 25–28, 1991.","cites":null},{"id":16392405,"title":"Flux transfer events on the magnetopause: Spatial distribution and controlling factors,","authors":[],"date":"1984","doi":"10.1029\/ja089ia08p06689","raw":"Berchem, J. and Russell, C. T.: Flux transfer events on the magnetopause: Spatial distribution and controlling factors, J. Geophys. Res., 89, 6689–6703, 1984.","cites":null},{"id":16392770,"title":"Flux transfer events, scale size and interior structure,","authors":[],"date":"1984","doi":"10.1029\/gl011i002p00131","raw":"Saunders, M. A., Russell, C. T., and Sckopke, N.: Flux transfer events, scale size and interior structure, Geophys. Res. Lett., 11, 131–134, 1984b. Savin, S. P., Balan, O., Borodkova, N., Budnik, E., Nikolaeva, N., Prokhorenko, V., Pulkkinen, T., Rybjeva, N., Safrankova, J., Sandahl, I., Amata, E., Auster, U., Bellucci, G., Blagau, A., Blecki, J., Buechner, J., Ciobanu, M., Dubinin, E., Yermolaev, Yu., Echim, M., Fedorov, A., Formisano, V., Grard, R., Ivchenko, V., Jiricek, F., Juchniewicz, J., Klimov, S., Korepanov, V., Koskinen, H., Kudela, K., Lundin, R., Lutsenko, V., Marghitu, O., Nemecek, Z., Nikutowski, B., Nozdrachev, M., Orsini, S., Parrot, M., Petrukovich, A., Pissarenko, N., Romanov, S., Rauch, J., Rustenbach, J., Sauvaud, J. A., Sarris, E. T., Skalsky, A., Smilauer, J., Triska, P., Trotignon, J. G., Vojta, J., Zastenker, G., Zelenyi, L., Agafonov, Yu., Grushin, V., Khrapchenkov, V., Prech, L., and Santolik, O.: Interball Magnetotail boundary case studies, Adv.","cites":null},{"id":16392702,"title":"Heikkila’s mechanism for impulsive plasma transport through the magnetopause: A reexamination,","authors":[],"date":"1991","doi":"10.1029\/90ja02695","raw":"Owen, C. J. and Cowley, S. W. H.: Heikkila’s mechanism for impulsive plasma transport through the magnetopause: A reexamination, J. Geophys. Res., 96, 5565–5574, 1991.","cites":null},{"id":16392743,"title":"HEOS 2 plasma observations in the distant polar magnetosphere: The plasma mantle,","authors":[],"date":"1975","doi":"10.1029\/ja080i019p02723","raw":"Rosenbauer, H., Gr¨ unwaldt, H., Montgomery, M. D., Paschmann, G., and Sckopke, N.: HEOS 2 plasma observations in the distant polar magnetosphere: The plasma mantle, J. Geophys. Res., 80, 2723–2737, 1975.","cites":null},{"id":16392695,"title":"High-latitude particle precipitation and its relationship to magnetospheric source regions,","authors":[],"date":"1997","doi":"10.1007\/978-94-009-0045-5_4","raw":"Onsager, T. G., Scudder, J. D., and Lockwood, M.: High-latitude particle precipitation and its relationship to magnetospheric source regions, Space Sci. Rev., 80, 77–107, 1997.","cites":null},{"id":16392555,"title":"How the Magnetopause Transition Parameter Works,","authors":[],"date":"1997","doi":"10.1029\/97gl00120","raw":"Lockwood, M. and Hapgood, M. A.: How the Magnetopause Transition Parameter Works, Geophys. Res. Lett., 24, 373–376, 1997.","cites":null},{"id":16392885,"title":"Hydromagnetic ﬂow around the magnetosphere,","authors":[],"date":"1966","doi":"10.1016\/0032-0633(66)90124-3","raw":"Spreiter, J. R., Summers, A. L., and Alksne, A. Y.: Hydromagnetic ﬂow around the magnetosphere, Planet. Space Sci., 14, 223–253, 1966. Takahashi, K., Sibeck, D. G., Newell, P. T., and Spence, H. E.: ULF waves in the low-latitude boundary layer and their relationship with magnetospheric pulsations: a multi-satellite observation, J.","cites":null},{"id":16392750,"title":"Initial ISEE magnetometer results: Magnetopause observations,","authors":[],"date":"1978","doi":"10.1007\/bf00212619","raw":"Russell, C. T. and Elphic, R. C.: Initial ISEE magnetometer results: Magnetopause observations, Space Sci. Rev., 22, 681–715, 1978.","cites":null},{"id":16392898,"title":"Interaction between the magnetospheric boundary layers and the ionosphere, in:","authors":[],"date":"1979","doi":null,"raw":"Vasyliunas, V. M.: Interaction between the magnetospheric boundary layers and the ionosphere, in: Proceedings of the Magnetospheric Boundary Layers Conference, Alpbach, Eur. Space Agency Spec Publ., ESA SP-148, 387–394, 1979.","cites":null},{"id":16392623,"title":"Interhemispheric asymmetry of the high-latitude ionospheric convection pattern,","authors":[],"date":"1994","doi":"10.1029\/93ja03441","raw":"Lu, G., Richmond, A. D., Emery, B. A., Reiff, P. H., de la Beaujardiere, O., Rich, F. J., Denig, W. F., Kroehl, H. W., Lyons, L. R., Ruohoniemi, J. M., Friis-Christensen, E., Opgenoorth, H., Persson, M. A. L., Lepping, R. P., Rodger, A. S., Hughes, T., McEwin, A., Dennis, S., Morris, R., Burns, G., and Tomlinson, L.: Interhemispheric asymmetry of the high-latitude ionospheric convection pattern, J. Geophys. Res., 99, 6491–6510, 1994.","cites":null},{"id":16392909,"title":"Interplanetary magnetic ﬁeld control of mantle precipitation and associated ﬁeld-aligned currents,","authors":[],"date":"1995","doi":"10.1029\/94ja02037","raw":"Xu, D., Kivelson, M. G., Walker, R. J., Newell, P. T., and Meng, C.-I.: Interplanetary magnetic ﬁeld control of mantle precipitation and associated ﬁeld-aligned currents, J. Geophys. Res., 100, 1837–1846, 1995.","cites":null},{"id":16392617,"title":"Ion acceleration at both the interior and exterior Alfv´ en waves associated with the magnetopause reconnection site: signatures in cusp precipitation,","authors":[],"date":"1996","doi":"10.1029\/96ja01948","raw":"Lockwood, M., Cowley, S. W. H., and Onsager, T. G.: Ion acceleration at both the interior and exterior Alfv´ en waves associated with the magnetopause reconnection site: signatures in cusp precipitation, J. Geophys. Res., 101, 21, 501, 1996. Lockwood, M., Davis, C. J., Onsager, T. G., and Scudder, J. A.: Modelling signatures of pulsed magnetopause reconnection in cusp ion dispersion signatures seen at middle altitudes, Geophys.","cites":null},{"id":16392525,"title":"Ion acceleration during steady-state reconnection at the dayside magnetopause, in: Ion acceleration in the magnetosphere and ionosphere,","authors":[],"date":"1986","doi":"10.1029\/gm038p0136","raw":"Johnstone, A. D., Rodgers, D. J., Coates, A. J., Smith, M. F., and Southwood, D. J.: Ion acceleration during steady-state reconnection at the dayside magnetopause, in: Ion acceleration in the magnetosphere and ionosphere, (Ed) Chang, T., AGU Monograph 38, 136–145, 1986.","cites":null},{"id":16392888,"title":"Ion and electron velocity distributions within ﬂux transfer events,","authors":[],"date":"1987","doi":"10.1029\/ja092ia11p12127","raw":"Thompsen, M., Stansberry, J. A., Barne, S. J., Fuselier, S. A., and Gosling, J. T.: Ion and electron velocity distributions within ﬂux transfer events, J. Geophys. Res., 92, 12, 127, 1987.","cites":null},{"id":16392521,"title":"Ion convection reversals in the dayside cleft,","authors":[],"date":"1976","doi":"10.1029\/ja081i022p03803","raw":"Heelis, R. A., Hanson, W. B., and Burch, J. L.: Ion convection reversals in the dayside cleft, J. Geophys. Res., 81, 3803, 1976.","cites":null},{"id":16392801,"title":"Ion distributions at the dayside magnetopause,","authors":[],"date":"1991","doi":"10.1029\/91ja00676","raw":"Smith, M. F. and Rodgers, D. J.: Ion distributions at the dayside magnetopause, J. Geophys. Res., 95, 11617–11624, 1991.","cites":null},{"id":16392560,"title":"Ion populations on open ﬁeld lines within the low-latitude boundary layer: theory and observations during a dayside transient event,","authors":[],"date":"1996","doi":"10.1029\/96gl02761","raw":"Lockwood, M. and Moen, J.: Ion populations on open ﬁeld lines within the low-latitude boundary layer: theory and observations during a dayside transient event, Geophys. Res. Lett., 23, 2895– 2898, 1996.","cites":null},{"id":16392484,"title":"Ion reﬂection and transmission during reconnection at the Earth’s subsolar magnetopause,","authors":[],"date":"1991","doi":"10.1029\/90gl02676","raw":"Fuselier, S. A., Klumpar, D. M., and Shelley, E. G.: Ion reﬂection and transmission during reconnection at the Earth’s subsolar magnetopause, Geophys. Res. Lett., 18, 139, 1991.","cites":null},{"id":16392663,"title":"Ionospheric projections of magne-1638 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations tospheric regions under low and high solar wind pressure conditions,","authors":[],"date":"1994","doi":null,"raw":"Newell, P. T. and Meng, C.-I.: Ionospheric projections of magne-1638 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations tospheric regions under low and high solar wind pressure conditions, J. Geophys. Res., 99, 273, 1994a.","cites":null},{"id":16392538,"title":"Ionospheric signatures of pulsed magnetopause reconnection, in: “Physical signatures of magnetopause boundary layer Processes”, (Eds) Holtet,","authors":[],"date":"1994","doi":"10.1007\/978-94-011-1052-5_16","raw":"Lockwood, M.: Ionospheric signatures of pulsed magnetopause reconnection, in: “Physical signatures of magnetopause boundary layer Processes”, (Eds) Holtet, J. A. and Egeland, A., NATO ASI Series C, Vol. 425, Kluwer, 229–243, 1994.","cites":null},{"id":16392753,"title":"ISEE observations of ﬂux transfer events at the dayside magnetopause,","authors":[],"date":"1979","doi":"10.1029\/gl006i001p00033","raw":"Russell, C. T. and Elphic, R. C.: ISEE observations of ﬂux transfer events at the dayside magnetopause, Geophys. Res. Lett., 6, 33– 36, 1979. Sandholt, P. E., Farrugia, C. J., Øieroset, M., Stauning, P., and Cowley, S. W. H.: Auroral signature of lobe reconnection, Geophys.","cites":null},{"id":16392574,"title":"Low and middle-altitude cusp particle signatures for general magnetopause reconnection rate variations, I, Theory,","authors":[],"date":"1994","doi":"10.1029\/93ja03399","raw":"Lockwood, M. and Smith, M. F.: Low and middle-altitude cusp particle signatures for general magnetopause reconnection rate variations, I, Theory, J. Geophys. Res., 99, 8531, 1994. Lockwood, M., Moen, J., Cowley, S. W. H., Farmer, A. D., Løvhaug, U. P., L¨ uhr, H., and Davda, V. N.: Variability of dayside convection and motions of the cusp\/cleft aurora, Geophys.","cites":null},{"id":16392627,"title":"Low-latitude boundary layer near noon: An open ﬁeld line,","authors":[],"date":"1994","doi":"10.1029\/94ja00867","raw":"Lyons, L. R., Schulz, M., Pridmore-Brown, D. C., and Roeder, J. L.: Low-latitude boundary layer near noon: An open ﬁeld line, J. Geophys. Res., 99, 2227, 1994.","cites":null},{"id":16392726,"title":"Low-latitude ﬂank magnetosheath, magnetopause and boundary layer for low magnetic shear: Wind observations,","authors":[],"date":"1997","doi":"10.1029\/97ja01596","raw":"Phan, T. D., et al.: Low-latitude ﬂank magnetosheath, magnetopause and boundary layer for low magnetic shear: Wind observations, J. Geophys. Res., 102, 19, 883–895, 1997.","cites":null},{"id":16392771,"title":"Magnetic ﬂux transfer at the magnetopause based on single X-line bursty reconnection,","authors":[],"date":null,"doi":"10.1029\/gl015i004p00291","raw":"Scholer, M.: Magnetic ﬂux transfer at the magnetopause based on single X-line bursty reconnection, Geophys. Res. Lett., 15, 291– 294, 1988a.","cites":null},{"id":16392494,"title":"Magnetopause stability threshold for patchy reconnection,","authors":[],"date":"1986","doi":"10.1007\/bf00227227","raw":"Galeev, A. A., Kuznetsova, M. M., and Zeleny, L. M.: Magnetopause stability threshold for patchy reconnection, Space Sci Rev., 44, 1–41, 1986.","cites":null},{"id":16392397,"title":"Magnetotail and boundary layer plasma at geocentric distance of 18RE,","authors":[],"date":"1973","doi":"10.1029\/ja078i031p07257","raw":"Akasofu, S. I., Hones, Jr., E. W., Bame, S. J., Ashbridge, J. R., and Lui, A. T. Y.: Magnetotail and boundary layer plasma at geocentric distance of 18RE, J. Geophys., Res., 78, 7257, 1973.","cites":null},{"id":16392747,"title":"Mapping high latitude plasma convection with coherent HF radars,","authors":[],"date":"1989","doi":"10.1029\/ja094ia10p13463","raw":"Ruohoniemi, J. M., Greenwald, R. A., Baker, K. B., Villain, J.-P., Hanuise, C., and Kelley, J. D.: Mapping high latitude plasma convection with coherent HF radars, J. Geophys. Res., 94, 13463, 1989.","cites":null},{"id":16392660,"title":"Mapping the dayside ionosphere to the magnetosphere according to particle precipitation characteristics,","authors":[],"date":"1992","doi":"10.1029\/92gl00404","raw":"Newell, P. T. and Meng, C.-I.: Mapping the dayside ionosphere to the magnetosphere according to particle precipitation characteristics, Geophys. Res. Lett., 19, 609–612, 1992.","cites":null},{"id":16392524,"title":"Measurements of magnetotail plasma ﬂow made with Vela 4B,","authors":[],"date":"1972","doi":"10.1029\/ja077i028p05503","raw":"Hones, Jr., E. W., Ashbridge, J. R., Bame, S. J., Montgomery, M. D., Singer, S., and Akasofu, S.-I.: Measurements of magnetotail plasma ﬂow made with Vela 4B, J. Geophys. Res., 77, 5503, 1972.","cites":null},{"id":16392807,"title":"Model of the formation of the lowlatitude boundary layer for strongly northward interplanetary magnetic ﬁeld,","authors":[],"date":"1992","doi":"10.1029\/91ja02377","raw":"Song, P. and Russell, C. T.: Model of the formation of the lowlatitude boundary layer for strongly northward interplanetary magnetic ﬁeld, J. Geophys. Res., 97, 1411, 1992.","cites":null},{"id":16392698,"title":"Modelofmagnetosheathplasmainthemagnetosphere: Cuspand mantle precipitations at low altitudes,","authors":[],"date":"1993","doi":"10.1029\/93gl00596","raw":"Onsager, T. G., Kletzing, C. A., Austin, J. B., and MacKiernan, H.: Modelofmagnetosheathplasmainthemagnetosphere: Cuspand mantle precipitations at low altitudes, Geophys. Res. Lett., 20, 479–482, 1993.","cites":null},{"id":16392399,"title":"Nonadiabatic precipitation of ions at the cusp equatorward edge,","authors":[],"date":"1995","doi":"10.1029\/95ja01160","raw":"Alem, F. and Delcourt, D. C.: Nonadiabatic precipitation of ions at the cusp equatorward edge, J. Geophys. Res., 100, 19, 321, 1995.","cites":null},{"id":16392814,"title":"Observational differences between ﬂux transfer events and surface waves at the magnetopause,","authors":[],"date":"1994","doi":"10.1029\/93ja02852","raw":"Song, P., Le, G., and Russell, C. T.: Observational differences between ﬂux transfer events and surface waves at the magnetopause, J. Geophys. Res., 99, 2309–2320, 1994. Song, P., Holzer, T. E., Russell, C. T., and Wang, Z.: Modelling the low-latitude boundary layer with reconnection entry, Geophys.","cites":null},{"id":16392687,"title":"Observations of electron beams in the low-latitude boundary layer,","authors":[],"date":"1984","doi":"10.1029\/ja089ia12p10723","raw":"Ogilvie, K., Fitzenreiter, R. J., and Scudder, J. D.: Observations of electron beams in the low-latitude boundary layer, J. Geophys. Res., 89, 10723, 1984.","cites":null},{"id":16392455,"title":"Observations of ﬂux transfer events: Are FTEs ﬂux ropes, islands, or surface waves?, in:","authors":[],"date":"1990","doi":"10.1029\/gm058p0455","raw":"Elphic, R. C.: Observations of ﬂux transfer events: Are FTEs ﬂux ropes, islands, or surface waves?, in: Physics of Magnetic Flux Ropes, Geophys. Monogr. Ser., vol. 58, (Eds) Russell, C. T., Preist, E. R., and Lee, L. C., AGU, Washington, D. C., pp. 455– 472, 1990.","cites":null},{"id":16392505,"title":"Observations of reconnection of interplanetary and lobe magnetic ﬁeld lines at the latitude magnetopause,","authors":[],"date":"1991","doi":"10.1029\/92ja02017","raw":"Gosling, J. T., Thomsen, M. F., Bame, S. J., Elphic, R. C., and Russell, C. T.: Observations of reconnection of interplanetary and lobe magnetic ﬁeld lines at the latitude magnetopause, J. Geophys. Res., 96, 14097–14106, 1991.","cites":null},{"id":16392657,"title":"On quantifying the distinctions between the cusp and the cleft\/LLBL, in: Electromagnetic coupling in the polar clefts and caps","authors":[],"date":"1989","doi":"10.1007\/978-94-009-0979-3_6","raw":"Newell, P. T. and Meng, C.-I.: On quantifying the distinctions between the cusp and the cleft\/LLBL, in: Electromagnetic coupling in the polar clefts and caps NATO ASI Ser C, vol. 278, (Eds) Sandholt, P. E. and Egeland, A., Kluwer Academic Publishers, Dordrecht, pp. 87–101, 1989.","cites":null},{"id":16392558,"title":"On the Cause of a Magnetospheric Flux Transfer Event,","authors":[],"date":"1998","doi":"10.1029\/98ja02244","raw":"Lockwood, M. and Hapgood, M. A.: On the Cause of a Magnetospheric Flux Transfer Event, Geophys. Res., 103, 26453–26478, 1998.","cites":null},{"id":16392550,"title":"On the longitudinal extent of magnetopause reconnection bursts,","authors":[],"date":"1996","doi":"10.1007\/s00585-996-0865-1","raw":"Lockwood, M. and Davis, C. J.: On the longitudinal extent of magnetopause reconnection bursts, Ann. Geophysicae, 14, 865–878, 1996.","cites":null},{"id":16392526,"title":"On the reversal from “sunward” to “antisunward” plasma convection in the dayside high latitude ionosphere,","authors":[],"date":"1984","doi":"10.1029\/gl011i009p00887","raw":"Jørgensen, T. S., Friis-Christiansen, E., Wickwar, V. B., Kelly, J. D., Clauer, C. R., and Banks, P. M.: On the reversal from “sunward” to “antisunward” plasma convection in the dayside high latitude ionosphere, Geophys. Res. Lett., I, 887–890, 1984.","cites":null},{"id":16392519,"title":"On the voltage and distance across the low latitude boundary layer,","authors":[],"date":"1993","doi":"10.1029\/93gl00063","raw":"Hapgood, M. A. and Lockwood, M.; On the voltage and distance across the low latitude boundary layer, Geophys. Res. Lett., 20, 145–148, 1993.","cites":null},{"id":16392668,"title":"Open and closed low-latitude boundary layer, in: “Polar Cap Boundary Phenomena”,","authors":[],"date":"1997","doi":"10.1007\/978-94-011-5214-3_8","raw":"Newell, P. T. and Meng, C.-I.: Open and closed low-latitude boundary layer, in: “Polar Cap Boundary Phenomena”, (Eds) Moen, J., Egeland, A., and Lockwood, M., NATO ASI Series C, Kluwer, 1997.","cites":null},{"id":16392532,"title":"Origin of energetic ions in the polar cusp inferred fromioncompositionmeasurementsbytheVikingsatellite,","authors":[],"date":"1995","doi":"10.1007\/s00585-995-0595-9","raw":"Kremser, G., Woch, J., Mursala, K., Tanskanen, P., Wilken, B., and Lundin, R.: Origin of energetic ions in the polar cusp inferred fromioncompositionmeasurementsbytheVikingsatellite, Ann. Geophysicae, 13, 595–607, 1995.","cites":null},{"id":16392721,"title":"Plasma acceleration at the Earth’s magnetopause: Evidence for reconnection,","authors":[],"date":"1979","doi":"10.1038\/282243a0","raw":"Paschmann, G., Sonnerup, B. U. ¨ O., Papamastorakis, I., Sckopke, N., Haerendel, G., Bame, S. J., Asbridge, J. R., Gosling, J. T., Russell, C. T., and Elphic, R. C.: Plasma acceleration at the Earth’s magnetopause: Evidence for reconnection, Nature, 282, 243–246, 1979. Paschmann, G., Papamastorakis, I., Baumjohann, W., Sckopke, N., Carlson, C. W., Sonnerup, B. U. ¨ O., and L¨ uhr, H.: The magnetopause for large magnetic shear: AMPTE\/IRM observations, J.","cites":null},{"id":16392475,"title":"Plasma characteristics near the exterior cusp under different orientations of the interplanetary magnetic ﬁeld,","authors":[],"date":"1999","doi":null,"raw":"Fedorov, A., Budnik, E., Novrachev, M., Romanov, V., Song, P., and Sauvaud, J.-A.: Plasma characteristics near the exterior cusp under different orientations of the interplanetary magnetic ﬁeld, Czech J. Phys., 49, 711–732, 1999.","cites":null},{"id":16392482,"title":"Plasma entry into the ﬂanks of the near-Earth magnetotail: Geotail observations,","authors":[],"date":"1998","doi":"10.1029\/97ja03340","raw":"Fujimoto, M., Terasawa, T., Mukai, T., Saito, Y., Yamamoto, T., and Kokubun, S.: Plasma entry into the ﬂanks of the near-Earth magnetotail: Geotail observations, J. Geophys. Res., 103, 4391– 4408, 1998.","cites":null},{"id":16392497,"title":"Plasma ﬂow reversals at the dayside magnetopause and the origin of asymmetric polar cap convection,","authors":[],"date":"1990","doi":"10.1029\/ja095ia06p08073","raw":"Gosling, J. T., Thomsen, M. F., Bame, S. J., Elphic, R. C., and Russell, C. T.: Plasma ﬂow reversals at the dayside magnetopause and the origin of asymmetric polar cap convection, J. Geophys. Res., 95, 8073–8084, 1990a.","cites":null},{"id":16392797,"title":"Plasma structure near the low-latitude boundary layer: a rebuttal,","authors":[],"date":"1991","doi":"10.1029\/91ja00564","raw":"Sckopke, N.: Plasma structure near the low-latitude boundary layer: a rebuttal, J. Geophys. Res., 96, 9815–9820, 1991.","cites":null},{"id":16392795,"title":"Plasma transfer processes at the magnetopause,","authors":[],"date":"1999","doi":"10.1023\/a:1005255801425","raw":"Sibeck, D. G., Paschmann, G., Treumann, R. A., Fuselier, S. A., Lennartsson, W., Lockwood, M., Lundin, R., Ogilvie, K. W., Onsager, T. G., Phan, T.-D., Roth, M., Scholer, M., Sckopke, N., Stasiewicz, K., and Yamauchi, M.: Plasma transfer processes at the magnetopause, Space Science Reviews, 88, 207–283, 1999.","cites":null},{"id":16392793,"title":"Pressure-pulse driven surface waves at the magnetopause: a rebuttal,","authors":[],"date":"1995","doi":"10.1029\/95ja01635","raw":"Sibeck, D. G. and Newell, P. T.: Pressure-pulse driven surface waves at the magnetopause: a rebuttal, J. Geophys. Res., 100, 21, 773–778, 1995.","cites":null},{"id":16392520,"title":"Rapid changes in LLBL thickness,","authors":[],"date":"1995","doi":"10.1029\/94gl02835","raw":"Hapgood, M. A. and Lockwood, M.: Rapid changes in LLBL thickness, Geophys. Res. Lett., 22, 77–80, 1995.","cites":null},{"id":16392514,"title":"Re-ordered electron data in the low-latitude boundary layer,","authors":[],"date":"1990","doi":"10.1029\/gl017i011p02043","raw":"Hapgood, M. A. and Bryant, D. A.: Re-ordered electron data in the low-latitude boundary layer, Geophys. Res. Lett. 17, 2043–2046, 1990.","cites":null},{"id":16392764,"title":"Recent ISEE observations of the magnetopause and low-latitude boundary layer: A review,","authors":[],"date":"1983","doi":null,"raw":"Saunders, M. A.: Recent ISEE observations of the magnetopause and low-latitude boundary layer: A review, J. Geophys., 52, 190– 198, 1983. Saunders, M. A., Russell, C. T., and Sckopke, N.: A dual-satellite study of spatial properties of FTEs, in: Magnetic Reconnection in Space and Laboratory Plasmas, Geophys. Monogr. Ser., vol.","cites":null},{"id":16392564,"title":"Reconﬁguration and closure of lobe ﬂux by reconnection during northward IMF: evidence for signatures in cusp\/cleft auroral emissions,","authors":[],"date":"1999","doi":"10.1007\/s00585-999-0996-2","raw":"Lockwood, M. and Moen, J.: Reconﬁguration and closure of lobe ﬂux by reconnection during northward IMF: evidence for signatures in cusp\/cleft auroral emissions, Ann. Geophysicae, 17, 996–1011, 1999.","cites":null},{"id":16392401,"title":"Relationships between plasma depletion and subsolar reconnection,","authors":[],"date":"1997","doi":"10.1029\/97ja00173","raw":"Anderson, B. J., Phan, T. D., and Fuselier, S. A.: Relationships between plasma depletion and subsolar reconnection, J. Geophys. Res., 102, 9531–9542, 1997.","cites":null},{"id":16392677,"title":"Reply to comment on “Unexpected features of the ion precipitation in the so-called cleft\/low-latitude boundary layer region” by","authors":[],"date":"1994","doi":"10.1029\/94ja01097","raw":"Nishida, A. and Mukai, T.: Reply to comment on “Unexpected features of the ion precipitation in the so-called cleft\/low-latitude boundary layer region” by Nishida, A., et al., J. Geophys. Res., 99, 23, 367, 1994.","cites":null},{"id":16392433,"title":"Reverse convection,","authors":[],"date":"1936","doi":"10.1029\/92ja01532","raw":"Crooker, N. U.: Reverse convection, J. Geophys. Res., 97, 19363– 19372, 1992.","cites":null},{"id":16392440,"title":"Self-consistent steady state model of the low-latitude boundary layer,","authors":[],"date":"1994","doi":"10.1029\/93ja02094","raw":"Drakou, E., Sonnerup, B. U.¨ O., and Lotko, W.: Self-consistent steady state model of the low-latitude boundary layer, J. Geophys. Res., 99, 2351–2364, 1994.","cites":null},{"id":16392462,"title":"Signatures of ﬂux transfer events at the dayside magnetopause and in the ionosphere: Combined ISEE, EISCAT and optical observations,","authors":[],"date":"1990","doi":"10.1029\/gl017i012p02241","raw":"Elphic, R. C., Lockwood, M., Cowley, S. W. H., and Sandholt, P. E.: Signatures of ﬂux transfer events at the dayside magnetopause and in the ionosphere: Combined ISEE, EISCAT and optical observations, Geophys. Res. Lett., 17, 2241–2244, 1990.","cites":null},{"id":16392459,"title":"Simultaneous measurements of the magnetopause and ﬂux transfer events at widely separated sites by","authors":[],"date":"1987","doi":"10.1029\/ja092ia12p13666","raw":"Elphic, R. C. and Southwood, D. J.: Simultaneous measurements of the magnetopause and ﬂux transfer events at widely separated sites by AMPTE UKS and ISEE 1 and 2, J. Geophys. Res., 92, 13, 666–672, 1987.","cites":null},{"id":16392426,"title":"Solar wind control of magnetospheric convection, in Achievements of the international magnetospheric study, IMS, pp 483–494,","authors":[],"date":"1984","doi":null,"raw":"Cowley, S. W. H.: Solar wind control of magnetospheric convection, in Achievements of the international magnetospheric study, IMS, pp 483–494, ESA SP-217, ESTEC, Noordwijk, The Netherlands, 1984. Cowley, S. W. H. and Lewis, Z. V., Magnetic trapping of energetic particles on open dayside boundary layer ﬂux tubes, Planet.","cites":null},{"id":16392729,"title":"Solar wind control of the polar cap voltage, in:","authors":[],"date":"1986","doi":"10.1007\/978-94-009-4722-1_33","raw":"Reiff, P. H. and Luhmann, J. G.: Solar wind control of the polar cap voltage, in: “Solar Wind-Magnetosphere Coupling”, (Eds) Kamide, Y. and Slavin, J. A., Terra Scientiﬁca, Tokyo, p. 453, 1986.","cites":null},{"id":16392731,"title":"Solar wind plasma injection at the dayside magnetospheric cusp,","authors":[],"date":"1977","doi":"10.1029\/ja082i004p00479","raw":"Reiff, P. H., Hill, T. W., and Burch, J. L.: Solar wind plasma injection at the dayside magnetospheric cusp, J. Geophys. Res., 82, 479, 1977.","cites":null},{"id":16392533,"title":"Statistical studies of ﬂux transfer events,","authors":[],"date":"1995","doi":"10.1029\/94ja02498","raw":"Kuo, H., Russell, C. T., and Le, G.: Statistical studies of ﬂux transfer events, J. Geophys. Res., 100, 3513–3519, 1995.","cites":null},{"id":16392773,"title":"Strong core magnetic ﬁelds in magnetopause ﬂux transfer events,","authors":[],"date":null,"doi":"10.1029\/gl015i008p00748","raw":"Scholer, M.: Strong core magnetic ﬁelds in magnetopause ﬂux transfer events, Geophys. Res. Lett., 15, 748–751, 1988b.","cites":null},{"id":16392810,"title":"Structure and properties of the subsolar magnetopause for northward IMF: ISEE observations,","authors":[],"date":"1990","doi":"10.1029\/ja095ia05p06375","raw":"Song, P., Elphic, R. C., Russell, C. T., Gosling, J. T., and Cattell, C. A.: Structure and properties of the subsolar magnetopause for northward IMF: ISEE observations, J. Geophys. Res., 95, 6375, 1990.","cites":null},{"id":16392799,"title":"Structure of the low-latitude boundary layer,","authors":[],"date":"1981","doi":"10.1029\/ja086ia04p02099","raw":"Sckopke, N., Paschmann, G., Haerendel, G., Sonnerup, B. U. ¨ O., Bame, S. J., Forbes, T. G., Hones, Jr., E. W., and Russell, C. T.: Structure of the low-latitude boundary layer, J. Geophys. Res., 86, 2099–2110, 1981.","cites":null},{"id":16392529,"title":"Survey of ﬂux transfer events observed with the ISEE spacecraft: dependence on the interplanetary magnetic ﬁeld,","authors":[],"date":"1997","doi":"10.1029\/97ja00481","raw":"Kawano, H. and Russell, C. T., Survey of ﬂux transfer events observed with the ISEE spacecraft: dependence on the interplanetary magnetic ﬁeld, J. Geophys. Res., 102, 11307–11313, 1997.","cites":null},{"id":16392528,"title":"Survey of ﬂux transfer events observed with the ISEE spacecraft: rotational polarity and the source region,","authors":[],"date":"1996","doi":"10.1029\/96ja02703","raw":"Kawano, H. and Russell, C. T., Survey of ﬂux transfer events observed with the ISEE spacecraft: rotational polarity and the source region, J. Geophys. Res., 101, 27299–27308, 1996.","cites":null},{"id":16392530,"title":"Survey of transient magnetic ﬁeld events in the dayside magnetosphere,","authors":[],"date":"1992","doi":"10.1029\/92ja00369","raw":"Kawano, H., Kokubun, S., and Takahashi, K.: Survey of transient magnetic ﬁeld events in the dayside magnetosphere, J. Geophys. Res., 97, 10, 677–692, 1992.","cites":null},{"id":16392804,"title":"Temperature anisotropies in a magnetospheric FTE,","authors":[],"date":"1992","doi":"10.1029\/92gl01618","raw":"Smith, M. F. and Owen, C. J.: Temperature anisotropies in a magnetospheric FTE, Geophys. Res. Lett., 19, 1907–1910, 1992.","cites":null},{"id":16392420,"title":"The causes of convection in the Earth’s magnetosphere: A review of developments during IMS,","authors":[],"date":null,"doi":"10.1029\/rg020i003p00531","raw":"Cowley, S. W. H.: The causes of convection in the Earth’s magnetosphere: A review of developments during IMS, Rev. Geophys., 20, 531–565, 1982.","cites":null},{"id":16392577,"title":"The characteristics of the magnetopause reconnection X-line deduced from low-altitude satellite observations of cusp ions,","authors":[],"date":"1994","doi":"10.1029\/94gl02696","raw":"Lockwood, M., Onsager, T. G., Davis, C. J., Smith, M. F., and Denig, W. F.: The characteristics of the magnetopause reconnection X-line deduced from low-altitude satellite observations of cusp ions, Geophys. Res. Lett., 21, 2757–2760, 1994.","cites":null},{"id":16392613,"title":"The contribution of ﬂux transfer events to convection,","authors":[],"date":"1995","doi":"10.1029\/95gl01008","raw":"Lockwood, M., Cowley, S. W. H., Smith, M. F., Rijnbeek, R. P., and Elphic, R. C.: The contribution of ﬂux transfer events to convection, Geophys. Res. Lett., 22, 1185–1188, 1995.","cites":null},{"id":16392655,"title":"The cusp and the cleft\/LLBL: Low altitude identiﬁcation and statistical local time variation,","authors":[],"date":"1988","doi":"10.1029\/ja093ia12p14549","raw":"Newell, P. T. and Meng, C.-I.: The cusp and the cleft\/LLBL: Low altitude identiﬁcation and statistical local time variation, J. Geophys. Res., 93, 14, 549, 1988.","cites":null},{"id":16392757,"title":"The dayside aurora and its regulation by the interplanetary magnetic ﬁeld, in: “Polar Cap Boundary Phenomena”,","authors":[],"date":"1998","doi":"10.1007\/978-94-011-5214-3_15","raw":"Sandholt, P. E., Farrugia, C. J., Moen, J., and Lybekk, B.: The dayside aurora and its regulation by the interplanetary magnetic ﬁeld, in: “Polar Cap Boundary Phenomena”, (Eds) Moen, J., Egeland, A., and Lockwood, M., NATO ASI Series C, Vol. 509, Kluwer, Dordrecht, pp. 189–208, 1998.","cites":null},{"id":16392502,"title":"The electron edge of the low-latitude boundary layer during accelerated ﬂow events,","authors":[],"date":"1990","doi":"10.1029\/gl017i011p01833","raw":"Gosling, J. T., Thomsen, M. F., Bame, S. J., Onsager, T. G., and Russell, C. T.: The electron edge of the low-latitude boundary layer during accelerated ﬂow events, Geophys. Res. Lett., 17, 1833–1836, 1990c.","cites":null},{"id":16392508,"title":"The frontside boundary layer of the magnetopause and the problem of reconnection,","authors":[],"date":"1978","doi":"10.1029\/ja083ia07p03195","raw":"Haerendel, G., Paschmann, G., Sckopke, N., Rosenbauer, H., and Hedgecock, P. C.: The frontside boundary layer of the magnetopause and the problem of reconnection, J. Geophys. Res., 83, 3195–3216, 1978.","cites":null},{"id":16392479,"title":"The interaction of a magnetic cloud with the earth: ionospheric convection in the northern and southern hemispheres for a wide range of quasi-steady interplanetary magnetic ﬁeld conditions,","authors":[],"date":"1993","doi":"10.1029\/92ja02350","raw":"Freeman, M. P., Farrugia, C. J., Burlaga, L. F., Hairston, M. R., Greenspan, M. E., Ruohoniemi, J. M., and Lepping, R. P.: The interaction of a magnetic cloud with the earth: ionospheric convection in the northern and southern hemispheres for a wide range of quasi-steady interplanetary magnetic ﬁeld conditions, J. Geophys. Res., 98, 7633–7655, 1993.","cites":null},{"id":16392429,"title":"The ionospheric signature of ﬂux transfer events, in:","authors":[],"date":"1991","doi":null,"raw":"Cowley, S. W. H., Freeman, M. P., Lockwood, M., and Smith, M. F.: The ionospheric signature of ﬂux transfer events, in: “CLUSTER – dayside polar cusp”, (Ed) Barron, C. I., ESA SP-330, European Space Agency Publications, Nordvijk, The Netherlands, 105–112, 1991.","cites":null},{"id":16392541,"title":"The location and characteristics of the reconnection X-line deduced from low-altitude satellite and ground-based observations, 1, Theory,","authors":[],"date":"1995","doi":"10.1029\/95ja01340","raw":"Lockwood, M.: The location and characteristics of the reconnection X-line deduced from low-altitude satellite and ground-based observations, 1, Theory, J. Geophys. Res., 100, 21, 791, 1995.","cites":null},{"id":16392693,"title":"The location of the magnetopause reconnection for northward and southward interplanetary magnetic ﬁeld, in: Solar System Plasmas in Space and Time,","authors":[],"date":"1994","doi":"10.1029\/gm084p0183","raw":"Onsager, T. G. and Fuselier, S. A.: The location of the magnetopause reconnection for northward and southward interplanetary magnetic ﬁeld, in: Solar System Plasmas in Space and Time, Geophys. Mono. Ser., vol. 84, (Eds) Burch, J. L. and Waite, Jr., J. H., AGU, Washington D. C., pp. 183–197, 1994.","cites":null},{"id":16392671,"title":"The low-latitude boundary and the boundary plasma sheet at low altitude: Prenoon precipitation regions and convection reversal boundaries,","authors":[],"date":"1991","doi":"10.1029\/91ja01818","raw":"Newell, P. T., Burke, W. J., Sanchez, E. R., Meng, C.-I., Greenspan, M. E., and Clauer, C. R.: The low-latitude boundary and the boundary plasma sheet at low altitude: Prenoon precipitation regions and convection reversal boundaries, J. Geophys. Res., 96, 21, 013, 1991.","cites":null},{"id":16392905,"title":"The low-latitude boundary layer at mid-altitudes: relation to large-scale Birkeland currents,","authors":[],"date":"1993","doi":"10.1029\/93gl01705","raw":"Woch, J., Yamauchi, M., Lundin, R., Potemra, T. A., and Zanetti, L. J.: The low-latitude boundary layer at mid-altitudes: relation to large-scale Birkeland currents, Geophys. Res. Lett., 20, 2251– 2254, 1993.","cites":null},{"id":16392903,"title":"The low-latitude boundary layer at midaltitudes: Identiﬁcation based on Viking hot plasma data,","authors":[],"date":"1993","doi":"10.1029\/93gl00849","raw":"Woch, J. and Lundin, R.: The low-latitude boundary layer at midaltitudes: Identiﬁcation based on Viking hot plasma data, Geophys. Res. Lett., 20, 979–982, 1993.","cites":null},{"id":16392724,"title":"The magnetopause and boundary layer for small magnetic shear: convection electric ﬁelds and reconnection,","authors":[],"date":"1990","doi":"10.1029\/gl017i011p01829","raw":"Paschmann, G., Sonnerup, B. U. ¨ O., Papamastorakis, I., Baumjohann, W., Sckopke, N., and L¨ uhr, H.: The magnetopause and boundary layer for small magnetic shear: convection electric ﬁelds and reconnection, Geophys. Res. Lett., 17, 1829–1832, 1990.","cites":null},{"id":16392874,"title":"The magnetopause for large magnetic shear: analysis of convection electric ﬁelds from AMPTE\/IRM,","authors":[],"date":"1986","doi":"10.1029\/ja095ia07p10541","raw":"Sonnerup, B. U. ¨ O., Papamastorakis, I., Paschmann, G., and L¨ uhr, H.: The magnetopause for large magnetic shear: analysis of convection electric ﬁelds from AMPTE\/IRM, J. Geophys. Res., 95, 10541–10557, 1986.","cites":null},{"id":16392451,"title":"The magnetospheric boundary layer: Site of plasma, momentum and energy transfer from the magnetosheath to the magnetosphere,","authors":[],"date":"1976","doi":"10.1029\/gl003i011p00685","raw":"Eastman, T. E., Hones, Jr., E. W., Bame, S. J., and Ashbridge, J. R.: The magnetospheric boundary layer: Site of plasma, momentum and energy transfer from the magnetosheath to the magnetosphere, Geophys. Res. Lett., 3, 685–688, 1976.","cites":null},{"id":16392649,"title":"The morningside lowlatitude boundary layer as determined from electric and magnetic ﬁeld measurements on Geotail,","authors":[],"date":"1994","doi":"10.1029\/94gl01296","raw":"Mozer, F. S., Hayakawa, H., Kokubun, S., Nakamura, M., Okada, T., Yamamoto, T., and Truruda, K.: The morningside lowlatitude boundary layer as determined from electric and magnetic ﬁeld measurements on Geotail, Geophys. Res. Lett., 21, 2983– 2986, 1994.","cites":null},{"id":16392403,"title":"The polar cusp from a particle point of view: A statistical model based on Viking data,","authors":[],"date":"1991","doi":"10.1029\/90ja01075","raw":"Aparicio, B., Thelin, B., and Lundin, R.: The polar cusp from a particle point of view: A statistical model based on Viking data, J. Geophys. Res., 14, 023, 1991.","cites":null},{"id":16392734,"title":"The population of the magnetosphere by solar wind ions when the interplanetary magnetic ﬁeld is northward,","authors":[],"date":"1994","doi":"10.1029\/94gl01427","raw":"Richard, R. L., Walker, R. J., and Ashour-Abdalla, M.: The population of the magnetosphere by solar wind ions when the interplanetary magnetic ﬁeld is northward, Geophys. Res. Lett., 21, 2455–2458, 1994.","cites":null},{"id":16392907,"title":"The projection of the magnetospheric boundary layers to mid-altitudes,","authors":[],"date":"1994","doi":"10.1007\/978-94-011-1052-5_6","raw":"Woch, J., Lundin, R., Potemra, T. E., and Shapshak, M.: The projection of the magnetospheric boundary layers to mid-altitudes, (Eds) Holtet, J. A. and Egeland, A., Physical Signatures of Magnetospheric Boundary Layer Processes, Kluwer, pp. 83–97, 1994.","cites":null},{"id":16392544,"title":"The relationship of dayside auroral precipitations to the open-closed separatrix and the pattern of convective ﬂow,","authors":[],"date":"1997","doi":"10.1029\/97ja01100","raw":"Lockwood, M.: The relationship of dayside auroral precipitations to the open-closed separatrix and the pattern of convective ﬂow, J. Geophys. Res., 102, 17475–17487, 1997a.","cites":null},{"id":16392631,"title":"The spatial development of the low-latitude boundary layer,","authors":[],"date":"1993","doi":"10.1029\/93ja01524","raw":"Manuel, J. R. and Samson, J. C.: The spatial development of the low-latitude boundary layer, J. Geophys. Res., 98, 17, 367–385, 1993.","cites":null},{"id":16392535,"title":"The structure of reconnection layers in the magnetosphere,","authors":[],"date":"1993","doi":"10.1007\/bf00749762","raw":"Lin, Y. and Lee, L. C.: The structure of reconnection layers in the magnetosphere, Space Sci. Rev., 65, 59–179, 1993. Lockwood, M.: Flux transfer events at the dayside magnetopause: Transient reconnection or magnetosheath pressure pulses?, J.","cites":null},{"id":16392522,"title":"The structure of reconnection layers,","authors":[],"date":"1988","doi":"10.1017\/s0022377800013246","raw":"Heyn, M. F., Biernat, H. K., Rijnbeek, R. P., and Semenov, V. S.: The structure of reconnection layers, J. Plasma Phys., 40, 2, 235– 252, 1988.","cites":null},{"id":16392568,"title":"The variation of reconnection rate at the dayside magnetopause and cusp ion precipitation,","authors":[],"date":"1992","doi":"10.1029\/92ja01261","raw":"Lockwood, M. and Smith, M. F.: The variation of reconnection rate at the dayside magnetopause and cusp ion precipitation, J. Geophys. Res., 97, 14, 841, 1992.","cites":null},{"id":16392491,"title":"Thesourcepopulationforthecuspandcleft\/LLBLforsouthward IMF,","authors":[],"date":"1999","doi":null,"raw":"Fuselier, S. A., Lockwood, M., Onsager, T. G., and Peterson, W. K.: Thesourcepopulationforthecuspandcleft\/LLBLforsouthward IMF, Geophys. Res. Lett., 26, 1665–1669, 1999.","cites":null},{"id":16392785,"title":"Time-varying reconnection: Implications for magnetopause reconnection,","authors":[],"date":"1995","doi":"10.1029\/95ja01182","raw":"Semenov, V. S., Lebedeva, V. V., Biernat, H. K., Heyn, M. F., Rijnbeek, R. P., and Farrugia, C. J.: Time-varying reconnection: Implications for magnetopause reconnection, J. Geophys. Res., 100, 21, 779–789, 1995.","cites":null},{"id":16392791,"title":"Transient events in the outer magnetosphere: Boundary waves or ﬂux transfer events?,","authors":[],"date":"1992","doi":"10.1029\/91ja03017","raw":"Sibeck, D. G.: Transient events in the outer magnetosphere: Boundary waves or ﬂux transfer events?, J. Geophys. Res., 97, 4009– 4026, 1992.","cites":null},{"id":16392437,"title":"Trapped electron distributions on open ﬁeld lines,","authors":[],"date":"1982","doi":"10.1029\/ja087ia08p06081","raw":"Daly, P. W. and Fritz, T. A.: Trapped electron distributions on open ﬁeld lines, J. Geophys. Res., 87, 6081, 1982. Daly, P. W., Saunders, M. A., Rijnbeek, R. P., Sckopke, N., and Russell, C. T.: The distribution of reconnection geometry in ﬂux transfer events using energetic ion, plasma, and magnetic data, J.","cites":null},{"id":16392891,"title":"Two encounters with the ﬂank low-latitude bound-1640 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations ary layer: further evidence for closed ﬁeld topology and investigation of the internal structure,","authors":[],"date":"1991","doi":"10.1029\/91ja02136","raw":"Traver, D. P., Mitchell, D. G., Williams, D. J., Frank, L. A., and Huang, C. Y.: Two encounters with the ﬂank low-latitude bound-1640 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations ary layer: further evidence for closed ﬁeld topology and investigation of the internal structure, J. Geophys. Res., 96, 21, 025– 035, 1991. Treumann, R. A., La Belle, J., and Pottelette, R.: Plasma diffusion at the magnetopause: the case of lower hybrid drift waves, J.","cites":null},{"id":16392639,"title":"Twodimensional electric ﬁeld measurement in the ionospheric footprint of a ﬂux transfer event, 18,","authors":[],"date":"2001","doi":"10.1007\/s005850000295","raw":"McWilliams, K. A., Yeoman, T. K., and Cowley, S. W. H.: Twodimensional electric ﬁeld measurement in the ionospheric footprint of a ﬂux transfer event, 18, Ann. Geophysicae, 1584–1598, 2001.","cites":null},{"id":16392681,"title":"Unexpected features of the ion precipitation in the so-called cleft\/low-latitude boundary layer region: Association with sunward convection and occurrence on open ﬁeld lines,","authors":[],"date":"1993","doi":"10.1029\/92ja00516","raw":"Nishida, A., Mukai, T., Hayakawa, H., Matsuoka, A., and Tsuruda, K.: Unexpected features of the ion precipitation in the so-called cleft\/low-latitude boundary layer region: Association with sunward convection and occurrence on open ﬁeld lines, J. Geophys. Res., 98, 11, 161, 1993.","cites":null},{"id":16392411,"title":"Upward electron beams measured by DE-1: a primary source of dayside region 1 Birkeland currents,","authors":[],"date":"1983","doi":"10.1029\/gl010i008p00753","raw":"Burch, J. L., Reiff, P. H., and Sugiura, M.: Upward electron beams measured by DE-1: a primary source of dayside region 1 Birkeland currents, Geophys. Res. Lett., 10, 753–756, 1983.","cites":null},{"id":16392705,"title":"Viscously driven plasma ﬂows in the deep geomagnetic tail,","authors":[],"date":"1992","doi":"10.1029\/92gl01280","raw":"Owen, C. J. and Slavin, J. A.: Viscously driven plasma ﬂows in the deep geomagnetic tail, Geophys. Res. Lett., 19, 1443–1446, 1992.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2001","abstract":"We study a series of transient entries into the low-latitude boundary layer (LLBL) of all four Cluster spacecraft during an outbound pass through the mid-afternoon magnetopause ([XGSM,YGSM,ZGSM] ≈ [2,7,9]RE). The events take place during an interval of northward IMF, as seen in the data from the ACE satellite and lagged by a propagation delay of 75 min that is well-defined by two separate studies: (1) the magnetospheric variations prior to the northward turning (Lockwood et al., 2001, this issue) and (2) the field clock angle seen by Cluster after it had emerged into the magnetosheath (Opgenoorth et al., 2001, this issue). With an additional lag of 16.5 min, the transient LLBL events correlate well with swings of the IMF clock angle (in GSM) to near 90 deg. Most of this additional lag is explained by ground-based observations, which reveal signatures of transient reconnection in the pre-noon sector that then take 10–15 min to propagate eastward to 15 MLT, where they are observed by Cluster. The eastward phase speed of these signatures agrees very well with the motion deduced by the cross-correlation of the signatures seen on the four Cluster spacecraft. The evidence that these events are reconnection pulses includes: transient erosion of the noon 630 nm (cusp\/cleft) aurora to lower latitudes; transient and travelling enhancements of the flow into the polar cap, imaged by the AMIE technique; and poleward-moving events moving into the polar cap, seen by the EISCAT Svalbard Radar (ESR). A pass of the DMSP-F15 satellite reveals that the open field lines near noon have been opened for some time: the more recently opened field lines were found closer to dusk where the flow transient and the poleward-moving event intersected the satellite pass. The events at Cluster have ion and electron characteristics predicted and observed by Lockwood and Hapgood (1998) for a Flux Transfer Event (FTE), with allowance for magnetospheric ion reflection at Alfvenic disturbances in the magnetopause reconnection layer. Like FTEs, the events are about 1 RE in their direction of motion and show a rise in the magnetic field strength, but unlike FTEs, in general, they show no pressure excess in their core and hence, no characteristic bipolar signature in the boundary-normal component. However, most of the events were observed when the magnetic field was southward, i.e. on the edge of the interior magnetic cusp, or when the field was parallel to the magnetic equatorial plane. Only when the satellite begins to emerge from the exterior boundary (when the field was northward), do the events start to show a pressure excess in their core and the consequent bipolar signature. We identify the events as the first observations of FTEs at middle altitudes","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70870.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/9995\/1\/art_682.pdf","pdfHashValue":"4f3990420d84acb2ff6d6a8ff3ab61917aac72a5","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:9995<\/identifier><datestamp>\n      2018-01-24T03:23:56Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Coordinated cluster and ground-based instrument observation of transient changes in the magnetopause boundary layer during an interval of predominantly northward IMF: Relation to reconnection pulses and FTE signatures<\/dc:title><dc:creator>\n        Lockwood, M.<\/dc:creator><dc:creator>\n        Fazakerley, A. N.<\/dc:creator><dc:creator>\n        Opgenoorth, H. J.<\/dc:creator><dc:creator>\n        Moen, J.<\/dc:creator><dc:creator>\n        van Eyken, A. P.<\/dc:creator><dc:creator>\n        Dunlop, M. W.<\/dc:creator><dc:creator>\n        Bosqued, J. M.<\/dc:creator><dc:creator>\n        Lu, G.<\/dc:creator><dc:creator>\n        Cully, C.<\/dc:creator><dc:creator>\n        Eglitis, P.<\/dc:creator><dc:creator>\n        McCrea, I. W.<\/dc:creator><dc:creator>\n        Hapgood, M. A.<\/dc:creator><dc:creator>\n        Wild, M. N.<\/dc:creator><dc:creator>\n        Stamper, R.<\/dc:creator><dc:creator>\n        Denig, W. F.<\/dc:creator><dc:creator>\n        Taylor, M. G. G. T.<\/dc:creator><dc:creator>\n        Wild, J. A.<\/dc:creator><dc:creator>\n        Provan, G.<\/dc:creator><dc:creator>\n        Amm, O.<\/dc:creator><dc:creator>\n        Kauristie, K.<\/dc:creator><dc:creator>\n        Pulkkinen, T. I.<\/dc:creator><dc:creator>\n        Strömme, A.<\/dc:creator><dc:creator>\n        Prikryl, P.<\/dc:creator><dc:creator>\n        Pitout, F.<\/dc:creator><dc:creator>\n        Balogh, A.<\/dc:creator><dc:creator>\n        Rème, H.<\/dc:creator><dc:creator>\n        Behlke, R.<\/dc:creator><dc:creator>\n        Hansen, T. L.<\/dc:creator><dc:creator>\n        Greenwald, R. A.<\/dc:creator><dc:creator>\n        Frey, H. U.<\/dc:creator><dc:creator>\n        Morley, S. K.<\/dc:creator><dc:creator>\n        Alcaydé, D.<\/dc:creator><dc:creator>\n        Blelly, P.-L.<\/dc:creator><dc:creator>\n        Donovan, E. F.<\/dc:creator><dc:creator>\n        Engebretson, M. J.<\/dc:creator><dc:creator>\n        Lester, M.<\/dc:creator><dc:creator>\n        Watermann, J. F.<\/dc:creator><dc:creator>\n        Marcucci, M. F.<\/dc:creator><dc:description>\n        We study a series of transient entries into the low-latitude boundary layer (LLBL) of all four Cluster spacecraft during an outbound pass through the mid-afternoon magnetopause ([XGSM,YGSM,ZGSM] ≈ [2,7,9]RE). The events take place during an interval of northward IMF, as seen in the data from the ACE satellite and lagged by a propagation delay of 75 min that is well-defined by two separate studies: (1) the magnetospheric variations prior to the northward turning (Lockwood et al., 2001, this issue) and (2) the field clock angle seen by Cluster after it had emerged into the magnetosheath (Opgenoorth et al., 2001, this issue). With an additional lag of 16.5 min, the transient LLBL events correlate well with swings of the IMF clock angle (in GSM) to near 90 deg. Most of this additional lag is explained by ground-based observations, which reveal signatures of transient reconnection in the pre-noon sector that then take 10–15 min to propagate eastward to 15 MLT, where they are observed by Cluster. The eastward phase speed of these signatures agrees very well with the motion deduced by the cross-correlation of the signatures seen on the four Cluster spacecraft. The evidence that these events are reconnection pulses includes: transient erosion of the noon 630 nm (cusp\/cleft) aurora to lower latitudes; transient and travelling enhancements of the flow into the polar cap, imaged by the AMIE technique; and poleward-moving events moving into the polar cap, seen by the EISCAT Svalbard Radar (ESR). A pass of the DMSP-F15 satellite reveals that the open field lines near noon have been opened for some time: the more recently opened field lines were found closer to dusk where the flow transient and the poleward-moving event intersected the satellite pass. The events at Cluster have ion and electron characteristics predicted and observed by Lockwood and Hapgood (1998) for a Flux Transfer Event (FTE), with allowance for magnetospheric ion reflection at Alfvenic disturbances in the magnetopause reconnection layer. Like FTEs, the events are about 1 RE in their direction of motion and show a rise in the magnetic field strength, but unlike FTEs, in general, they show no pressure excess in their core and hence, no characteristic bipolar signature in the boundary-normal component. However, most of the events were observed when the magnetic field was southward, i.e. on the edge of the interior magnetic cusp, or when the field was parallel to the magnetic equatorial plane. Only when the satellite begins to emerge from the exterior boundary (when the field was northward), do the events start to show a pressure excess in their core and the consequent bipolar signature. We identify the events as the first observations of FTEs at middle altitudes.<\/dc:description><dc:date>\n        2001<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/9995\/1\/art_682.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.5194\/angeo-19-1613-2001<\/dc:relation><dc:identifier>\n        Lockwood, M. and Fazakerley, A. N. and Opgenoorth, H. J. and Moen, J. and van Eyken, A. P. and Dunlop, M. W. and Bosqued, J. M. and Lu, G. and Cully, C. and Eglitis, P. and McCrea, I. W. and Hapgood, M. A. and Wild, M. N. and Stamper, R. and Denig, W. F. and Taylor, M. G. G. T. and Wild, J. A. and Provan, G. and Amm, O. and Kauristie, K. and Pulkkinen, T. I. and Strömme, A. and Prikryl, P. and Pitout, F. and Balogh, A. and Rème, H. and Behlke, R. and Hansen, T. L. and Greenwald, R. A. and Frey, H. U. and Morley, S. K. and Alcaydé, D. and Blelly, P.-L. and Donovan, E. F. and Engebretson, M. J. and Lester, M. and Watermann, J. F. and Marcucci, M. F. (2001) Coordinated cluster and ground-based instrument observation of transient changes in the magnetopause boundary layer during an interval of predominantly northward IMF: Relation to reconnection pulses and FTE signatures. Annales Geophysicae, 19 (10). pp. 1613-1640. ISSN 0992-7689<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/9995\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.5194\/angeo-19-1613-2001","http:\/\/eprints.lancs.ac.uk\/9995\/"],"year":2001,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"Annales Geophysicae (2001) 19: 1613–1640 c© European Geophysical Society 2001\nAnnales\nGeophysicae\nCoordinated Cluster and ground-based instrument observations of\ntransient changes in the magnetopause boundary layer during an\ninterval of predominantly northward IMF: relation to reconnection\npulses and FTE signatures\nM. Lockwood1, 2, A. Fazakerley3, H. Opgenoorth4, J. Moen5, 6, A. P. van Eyken7, M. Dunlop14, J.-M. Bosqued8,\nG. Lu9, C. Cully17, P. Eglitis4, I. W. McCrea1, M. A. Hapgood1, M. N. Wild1, R. Stamper1, W. Denig15, M. Taylor3,\nJ. A. Wild10, G. Provan10, O. Amm11, K. Kauristie11, T. Pulkkinen11, A. Strømme12, P. Prikryl13, F. Pitout4,\nA. Balogh14, H. Re`me8, R. Behlke4, T. Hansen12, R. Greenwald16, H. Frey21, S. K. Morley2, D. Alcayde´8, P.-L. Blelly8,\nE. Donovan17, M. Engebretson18, M. Lester10, J. Watermann19, and M. F. Marcucci20\n1Solar Terrestrial Physics Division, Department of Space Science and Technology, Rutherford Appleton Laboratory,\nOxfordshire, UK\n2Department of Physics and Astronomy, Southampton University, Southampton, UK\n3Mullard Space Science Laboratory, Holmbury St. Mary, Surrey, UK\n4IRF, Swedish Institute of Space Physics, Uppsala Division, Sweden\n5Department of Physics, University of Oslo, Blindern, Oslo, Norway\n6Also at Arctic Geophysics, University Courses on Svalbard, Longyearbyen, Norway\n7EISCAT Scientific Association, Longyearbyen, Svalbard, Norway\n8CESR, Centre d’Etude Spatiale des Rayonnements, Toulouse, France\n9High Altitude Observatory, National Center for Atmospheric Research, Boulder, Colorado, USA\n10Department of Physics and Astonomy, Leicester University, Leicester, UK\n11Finnish Meteorological Institute, Helsinki, Finland\n12University of Tromsø, Tromsø, Norway\n13Communications Research Centre, Ottawa, Ontario, Canada\n14Blackett Laboratory, Imperial College, London, UK\n15AFRL, Hanscom AFB, Cambridge, MA, USA\n16Remote Sensing Group, Applied Physics Laboratory, John Hopkins University, Laurel, MD, USA\n17University of Calgary, Calgary, Canada\n18Department of Physics, Augsburg College, Minneapolis, MN, USA\n19Danish Meteorological Institute, Kobenhavn, Denmark\n20Istituto di Fisica dello Spazio Interplanetario – CNR, Rome, Italy\n21Space Science Centre, Berkeley, USA\nReceived: 27 April 2001 – Revised: 11 July 2001 – Accepted: 16 July 2001\nAbstract. We study a series of transient entries into the low-\nlatitude boundary layer (LLBL) of all four Cluster spacecraft\nduring an outbound pass through the mid-afternoon magne-\ntopause ([XGSM, YGSM, ZGSM] ≈ [2, 7, 9]RE). The events\ntake place during an interval of northward IMF, as seen in\nthe data from the ACE satellite and lagged by a propagation\ndelay of 75 min that is well-defined by two separate stud-\nies: (1) the magnetospheric variations prior to the northward\nturning (Lockwood et al., 2001, this issue) and (2) the field\nclock angle seen by Cluster after it had emerged into the\nmagnetosheath (Opgenoorth et al., 2001, this issue). With\nan additional lag of 16.5 min, the transient LLBL events cor-\nCorrespondence to: M. Lockwood (m.lockwood@rl.ac.uk)\nrelate well with swings of the IMF clock angle (in GSM) to\nnear 90◦. Most of this additional lag is explained by ground-\nbased observations, which reveal signatures of transient re-\nconnection in the pre-noon sector that then take 10–15 min\nto propagate eastward to 15 MLT, where they are observed by\nCluster. The eastward phase speed of these signatures agrees\nvery well with the motion deduced by the cross-correlation\nof the signatures seen on the four Cluster spacecraft. The\nevidence that these events are reconnection pulses includes:\ntransient erosion of the noon 630 nm (cusp\/cleft) aurora to\nlower latitudes; transient and travelling enhancements of the\nflow into the polar cap, imaged by the AMIE technique; and\npoleward-moving events moving into the polar cap, seen by\nthe EISCAT Svalbard Radar (ESR). A pass of the DMSP-\n1614 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations\nF15 satellite reveals that the open field lines near noon have\nbeen opened for some time: the more recently opened field\nlines were found closer to dusk where the flow transient and\nthe poleward-moving event intersected the satellite pass. The\nevents at Cluster have ion and electron characteristics pre-\ndicted and observed by Lockwood and Hapgood (1998) for\na Flux Transfer Event (FTE), with allowance for magneto-\nspheric ion reflection at Alfve´nic disturbances in the magne-\ntopause reconnection layer. Like FTEs, the events are about\n1RE in their direction of motion and show a rise in the mag-\nnetic field strength, but unlike FTEs, in general, they show\nno pressure excess in their core and hence, no characteristic\nbipolar signature in the boundary-normal component. How-\never, most of the events were observed when the magnetic\nfield was southward, i.e. on the edge of the interior magnetic\ncusp, or when the field was parallel to the magnetic equa-\ntorial plane. Only when the satellite begins to emerge from\nthe exterior boundary (when the field was northward), do the\nevents start to show a pressure excess in their core and the\nconsequent bipolar signature. We identify the events as the\nfirst observations of FTEs at middle altitudes.\nKey words. Magnetospheric physics (magnetopause, cusp\nand boundary layers; magnetosphere-ionosphere interac-\ntions; solar wind-magnetosphere interactions)\n1 Introduction\nThe low-latitude boundary layer (LLBL) is characterised\nby the presence of both magnetosheath and magnetospheric\nplasma inside the main magnetopause current sheet (Hones\net al., 1972; Akasofu et al., 1973; Eastman et al., 1976;\nHaerendel et al., 1978; Eastman and Hones, 1979; Sonnerup,\n1980; Sckopke et al., 1981; Mitchell et al., 1987; Hapgood\nand Bryant, 1990; Gosling et al., 1990a, b, c; Song et al.,\n1990; Sckopke, 1991; Traver et al., 1991; Fuselier et al.,\n1992; Woch and Lundin, 1993; Woch et al., 1993; Saun-\nders, 1983; Hapgood and Lockwood, 1993, 1995; Phan et al.,\n1997; Savin et al., 1997; Fujimoto et al., 1998). The origin of\nthis layer is one of the major unanswered questions in mag-\nnetospheric physics and a key unknown in this regard is the\ntopology of the LLBL field lines: it is interesting to note that\nroughly half of the papers cited above interpret the LLBL in\nterms of closed field lines, and the other half in terms of open\nfield lines. There are three main classes of theory of LLBL\nformation (see review by Sibeck et al., 1999): (1) magne-\ntosheath plasma is injected by some process (such as wave-\ndriven diffusion) onto closed field lines that are already popu-\nlated with magnetospheric plasma (Drakou, 1994; Lotko and\nSonnerup, 1995; Treumann et al., 1991, 1995; Winske et al.,\n1995); (2) The plasma mixture arises on newly opened field\nlines along which magnetosheath plasma has flowed into the\nmagnetosphere but magnetospheric plasma has yet to escape,\neither due to time-of-flight considerations (Lockwood and\nSmith, 1993; Onsager, 1994; Lockwood, 1997a, b; Fuselier\net al., 1999; Onsager and Lockwood, 1997), or ion reflec-\ntion at the reconnection layer Alfve´n waves (Cowley, 1982;\nLockwood et al., 1996) or because a magnetic bottle still ex-\nists on open field lines (Daly and Fritz, 1982; Scholer et al.,\n1982a; Cowley and Lewis, 1990; Lyons et al., 1994); (3) The\nfield lines of the LLBL had been open, allowing for the mag-\nnetosheath plasma to enter, but have subsequently been re-\nclosed by re-reconnection (Nishida, 1989; Song and Russell,\n1992; Song et al., 1994; Richard et al., 1994). In both (2)\nand (3), gradient and curvature drift across the open-closed\nboundary may sometimes help to replenish magnetospheric\nplasma that has been lost when it flowed across the magne-\ntopause along open field lines.\n1.1 Middle and low altitude signatures of the LLBL\nIn addition to observations made at the magnetopause, data\nfrom mid- (Woch et al., 1993, 1994) and low- (Newell and\nMeng, 1988, 1992) altitudes have been used to discuss the\nLLBL. The “cleft” precipitation is often thought of as a\nthe field-aligned projection of the LLBL (Vasyluinas, 1979;\nNewell and Meng, 1988; 1989, 1992, 1993, 1994a; Newell\net al., 1991). However, this concept does not allow for two\nimportant considerations. First, the low-altitude observations\nare of particles that are within the loss cone and the magne-\ntopause observations are of particles that are primarily out-\nside of the lost cone. Thus, the low-altitude observations of\nthe LLBL require that the loss cone is filled and this need\nnot be true of the magnetopause observations. Thus, for ex-\nample, the mechanism proposed by Song and Russell (1992)\nwill not yield a low-altitude LLBL (the filling of the loss cone\nwith magnetosheath plasma ceasing when the field lines are\nre-closed), unless one also invokes strong pitch angle scat-\ntering of trapped particles on the re-closed field lines into\nthe loss cone. Second, such field-line mapping does not al-\nlow for the effects of velocity dispersion which is significant\nfor ions in a convecting magnetosphere (Rosenbauer et al.,\n1975; Reiff et al., 1977). This dispersion does not allow for\nLLBL boundaries at high altitudes to be mapped to low alti-\ntudes whenever there is convective flow across that boundary\n(Lockwood and Smith, 1993). Since observations of dayside\nconvection show flow into the polar cap throughout much of\nthe dayside (e.g. Jorgensen et al., 1984), usually without a\npronounced restriction or throat (Heelis et al., 1976), this ap-\npears to be the case for a large fraction of the dayside. The\nopen magnetosphere model predicts that the precipitation at\nlow altitudes evolves in its classification from “LLBL\/cleft”\nto “cusp” to “mantle” and then to “polar cap” as the field line\nevolves over the magnetopause away from the reconnection\nsite and into the tail lobe (Cowley et al., 1991; Lockwood and\nSmith, 1993, 1994; Onsager et al., 1993; Lockwood, 1995).\nThis evolution is seen in full along the flow streamlines in the\nsteady state case and thus may sometimes be seen if the satel-\nlite follows the flow streamline quite closely (Onsager et al.,\n1993; Lockwood et al., 1994). Thus, several authors have ar-\ngued that much of the low-altitude LLBL precipitation must\nbe on open field lines (Lockwood and Smith, 1993; Lyons\net al., 1994; Moen et al., 1996; Fuselier et al., 1991, 1992,\nM. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1615\n1999). Other authors, while accepting that this is true when\nreconnection is taking place, now argue that there is also a\nclosed LLBL at low-altitudes nearer dawn and dusk (Newell\nand Meng, 1997). Lockwood (1997a) has shown how adopt-\ning an open topology for the LLBL solves a number of long-\nstanding anomalies.\nThe idea that the low-altitude signature of the LLBL is\nion open field lines is supported by the fact that it covers\nroughly the same longitudinal extent as the low-altitude man-\ntle (Newell and Meng, 1992), which is known to also be on\nopen field lines (Xu et al., 1995). The longitudinal extent of\nthe cusp is lower than that of both the LLBL and the mantle\n(Aparicio et al., 1991; Newell and Meng, 1992) and would\nbe set by the longitudinal variation of sheath plasma con-\ncentration (Lockwood, 1997a). In addition, studies of the\nvoltage across regions of low-altitude LLBL precipitation in\nboth hemispheres (Lu et al., 1994) show that on any one flank\n(dawn or dusk), the same voltage does not always appear in\nthe two hemispheres: we interpret this as indicating that at\nleast some of the flank low-altitude LLBL was on open field\nlines and not closed field lines in these cases. Some obser-\nvations also show LLBL-like precipitation on sunward con-\nvecting field lines (Nishida et al., 1993; Nishida and Mukai,\n1994). There is some debate as to whether these are truly\nLLBL field lines (Newell and Meng, 1994b) but the sun-\nward convection can be explained in terms of the curvature\nforce on open field lines but is inconsistent with mechanisms\nthat transfer sheath plasma and momentum onto closed field\nlines.\n1.2 The open LLBL at the magnetopause\nObservations confirm the existence of an “open LLBL” (a\nterm hereafter used for an LLBL on field lines that have an\nopen topology) at the magnetopause. This type of LLBL\nis characterised by accelerated flows of magnetosheath-like\nions. The evidence that they are injected and accelerated by\nflowing along newly-opened field lines includes: an observed\ndependence of the east-west flow direction on the IMF BY\ncomponent and hemisphere (Gosling et al., 1990a); results of\ntangential stress balance tests (Paschmann et al., 1979, 1986;\nSonnerup et al., 1981, 1986; Johnstone et al., 1986); obser-\nvations of D-shaped distribution functions of injected ions\n(Smith and Rodgers, 1991; Fuselier et al., 1991; Gosling et\nal., 1990b, c) as predicted by Cowley (1982); the observa-\ntion of magnetosheath electron and ion edges inside the mag-\nnetic field rotational discontinuity (Gosling et al., 1990c);\nand depleted populations of trapped particles (Scholer et al.,\n1982a; Daly and Fritz, 1982). The observations by Fuselier\net al. (1991) show that the ion distributions on both sides\nof the magnetopause of both magnetospheric and magne-\ntosheath origin are as predicted by the theory of plasma mix-\ning along open field lines. In addition, Smith and Rodgers\n(1991) applied the stress-balance test to show that the low-\nvelocity cut-off of the injected sheath population was close\nto the local de-Hoffman Teller frame velocity, as also pre-\ndicted by the theory. Thus, at least part of the magnetopause\nLLBL is formed by plasma mixing on field lines opened by\nmagnetopause reconnection. Such processes could act for all\nIMF orientations, for example, a reconnection site at high-\nlatitudes above the magnetic cusp, similar to the type studied\nby Gosling et al. (1991), has been seen to give rise to a day-\nside LLBL (Paschmann et al., 1990).\nAt this time we should clarify some semantic points about\nnomenclature. Some authors would not term an open field\nline region as an “LLBL” at all. Instead they would use the\nterm “accelerated flows” or “reconnection layer”, as envis-\naged by Levy et al. (1964), Heyn et al. (1988) and Lin and\nLee (1993) and reserve the term LLBL for a layer on closed\nfield lines. In addition, the open LLBL produced by lobe re-\nconnection has also been referred to as an “overdraped lobe”\n(Crooker, 1992).\n1.3 The closed LLBL at the magnetopause\nMany researchers have discussed an LLBL on closed field\nlines (see review by Lotko and Sonnerup, 1995). Since\nthe LLBL was found to generally flow faster away from\nthe subsolar point (Haerendel et al., 1978), along with in-\ndications that it was also thinner at this point (Mitchell et\nal., 1987; Manuel and Samson, 1993), Eastman and Hones\n(1979) suggested that the LLBL was formed by the diffusion\nof magnetosheath plasma across the magnetopause. How-\never, Sonnerup (1980) pointed out that the observed waves\nwere not adequate to drive the required diffusion, a finding\nconfirmed by later studies (Owen and Slavin, 1992; LaBelle\nand Treumann, 1995; Winske et al., 1995; Treumann et al.,\n1995). Other mechanisms have been proposed for particle in-\njection onto a closed LLBL, but they were found to be either\ninvalid or inadequate. For example, one proposed impulsive\npenetration mechanism has been demonstrated to be theoret-\nically unsound (Owen and Cowley, 1991).\nNishida (1989) proposed a mechanism whereby reconnec-\ntion may be responsible for plasma populations on a closed\nLLBL when the IMF points northward. He invoked highly\npatchy reconnection such that field lines opened at one re-\nconnection site were re-closed a short time later elsewhere.\nDuring the time that the field line was open, magnetosheath\nplasma was free to flow in and magnetosphere plasma flowed\nout, thus releasing giving the observed plasma mixture which\nis trapped when the field line is closed again. More recently,\nSong and Russell (1992) and Song et al. (1994) proposed a\nsimilar mechanism, but used only two large-scale lobe re-\nconnection sites poleward of the magnetic cusps. Numeri-\ncal simulations by Richard et al. (1994) indicate that magne-\ntosheath plasma may indeed move onto closed field lines in\nthis manner during intervals of northward IMF.\n1.4 “Subsolar” reconnection during northward IMF\nAnother possibility is that low-latitude reconnection may of-\nten be maintained during periods of northward IMF, as it is\nduring southward IMF. The term “low-latitude” here means\nthat the reconnection site is between the magnetic cusps such\n1616 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations\nthat it generates new open flux from closed flux. Studies of\ntranspolar voltage as a function of IMF orientation show that\nthe rate of production of such LLBL field lines must be low\nduring northward IMF (Reiff and Luhmann, 1986; Cowley,\n1984; Freeman et al., 1993; Boyle et al., 1997). Neverthe-\nless, it may be sufficient to produce an open LLBL even dur-\ning northward IMF, especially if the IMF clock angle θ IMF\nis not too small (typically > 45◦). Evidence for this comes\nfrom electron and ion distribution functions and flows in the\nLLBL (Onsager and Fuselier, 1994; Fuselier et al., 1995;\nChandler et al., 1999). In addition, studies of the cusp au-\nrora during weakly northward IMF show evidence for contin-\nued low-latitude reconnection, in addition to lobe reconnec-\ntion (Sandholt et al., 1996, 1998). Such reconnection during\nnorthward IMF was also deduced by Nishida et al. (1998)\nfrom tail observations made by the GEOTAIL satellite. One\npossibility, suggested by Anderson et al. (1997), is that the\nmagnetosheath field is distorted and amplified in the plasma\ndepletion layer (which is less readily eroded during north-\nward IMF) and this allows low-latitude reconnection to con-\ntinue even when the upstream IMF points northward. Recent\nwork shows that if the IMF vector has a northward compo-\nnent, but lies at about 45◦ of the magnetic equatorial plane\n(45 < θIMF < 90◦), the cusp\/cleft aurora bifurcates into\ntwo bands (Sandholt et al., 1996, 1998, 1999; Lockwood and\nMoen, 1999). The higher latitude part is consistent with the\nreconfiguration of “old” open flux by reconnection at the lobe\nmagnetopause. There are two possible origins of the lower\nlatitude band: it could be the signature of the loss cone refill-\ning a closed northward-IMF LLBL, or it could be on newly\nopened field lines that are produced by continued sub-solar\nreconnection, despite the northward IMF component (proba-\nbly at a different MLT to the lobe reconnection site). McCrea\net al. (2000) observed the equatorward erosion of the lower\nlatitude band using EISCAT radar data and this argues for the\nreconnection origin and an open LLBL.\nHall et al. (1991) found that the counterstreaming elec-\ntrons often used to define the LLBL (for example, Taka-\nhashi et al., 1991) are present most of the time on most of\nthe dayside magnetopause. Lockwood and Hapgood (1997,\n1998) have used the ion observations and tangential stress\nbalance tests to show that the counterstreaming is well ex-\nplained as being a response of the electron gas to ion flight\ntime effects, which is required to maintain quasi-neutrality\non newly-opened field lines (Burch, 1985). The fact that\nthese electron streams are seen during both southward and\nnorthward IMF therefore implies that reconnection is nearly\nalways taking place somewhere on the magnetopause and is\nable to coat most of the boundary with newly-reconnected\nfield lines and thus counterstreaming injected sheath elec-\ntrons.\n1.5 Distinguishing of open and closed models of the LLBL\nMaking the distinction between open and closed field lines\nfrom observations of the LLBL is notoriously difficult, but\nhas usually rested on the forms of the particle distribution\nfunctions. It has been argued that particle distributions often\nused to classify field lines as closed, can arise simply in the\nopen magnetosphere model. This does not necessarily mean\nthat all of the LLBL is on open field lines, but it does im-\nply that more of it may be than previously had been thought.\nIn an open LLBL, the particle populations vary with time\nelapsed since the field line was reconnected. This means that\nany reconnection rate changes will result in spatial structure\n(“cusp ion steps”) in the open LLBL and cusp (Lockwood\nand Hapgood, 1997, 1998). This concept has been used suc-\ncessfully to explain spatially structured magnetosheath ion\nprecipitation at lower altitudes (Lockwood and Smith, 1992,\n1994; Lockwood and Davis, 1996; Lockwood et al., 1998).\nThere is a good reason to search for a unified mechanism\nfor a particle injection into the LLBL and a single magnetic\ntopology within the LLBL. Hapgood and Bryant (1992) have\nshown that electron temperature varies in a consistent and\nrepeatable manner with electron density throughout nearly\nall magnetopause crossings. Fluctuations in the time series\nof both quantities are produced by magnetopause motions,\nbut these are effectively caused by the satellite moving back\nand forth along what is a continuous transition in the bound-\nary rest frame. Such a transition, seen in the moments of\nthe electron gas, could be present for almost any process\nthat causes mixing of the magnetospheric and magnetosheath\npopulations. What is significant, however, is that using these\nelectron data to indicate the satellite’s relative position in the\nLLBL (the “transition parameter”) reveals coherent structure\nin both the ion flows and magnetic field, which are inde-\npendent of the electron measurements (Hapgood and Bryant,\n1992; Hapgood and Lockwood, 1993). Recently, Lockwood\nand Hapgood (1997) have shown that the transition parame-\nter (the degree of electron mixing) bears a simple relationship\nto time-elapsed since reconnection, showing that transition\nparameter works because there are open field lines coating\nthe magnetospheric surface, i.e. an open LLBL. With this\nbeing the case, the most significant point is that the transi-\ntion parameter ordering is effective for nearly all passes in\nall parts of the LLBL, producing coherent variations through\nstructures such as FTEs and accelerated flow events, as well\nas seemingly closed LLBL field lines (Hapgood and Lock-\nwood, 1995). It is difficult to see how the smooth coherent\nstructure could be achieved by a variety of mechanisms.\nThe identification of closed LLBL field lines has usually\nrested on two features, namely trapped magnetospheric par-\nticles and bi-directional streaming electrons.\n1.6 Trapped particles\nTrapped particles with a double loss cone pitch-angle dis-\ntributions arise on closed field lines connecting both iono-\nspheres. The particles are trapped between the mirror points\nin the two hemispheres. The problem with using such distri-\nbutions to determine the status of a field line is that they can\nalso exist on open field lines for a number of reasons.\nFirst, a magnetospheric population is not lost as soon as\nthe field line is opened. This is not only due to time-of-\nM. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1617\nflight effects. The theory of Cowley (1982), as verified by\nthe observations of Smith and Rodgers (1990), Fuselier et\nal. (1991) and Fedorov et al. (1999), predicts that of the order\nof one half of the population of magnetospheric ions which\noccur on the magnetopause on an open field line is reflected\nback into the magnetosphere in such a way as to conserve the\npitch angle distribution. Lockwood (1997b) has shown how\nthese reflected ions can combine with those that have yet to\ninteract with the magnetopause to produce a population that\nappears as an undisturbed magnetospheric population. This\nwould be seen on the same open field lines on which magne-\ntosheath plasma is detected. The reflection also gives ener-\ngised ions that are often seen in the LLBL and cusp (Hill and\nReiff, 1977; Alem and Delcourt, 1995; Moen et al., 1996;\nKremser et al., 1995; Lockwood, 1997b).\nLockwood et al. (1996) proposed that ions can be reflected\nin both the interior and exterior Alfve´n waves (rotational dis-\ncontinuities) that are found in the inflows to the reconnect-\ning magnetopause from the magnetosphere and the magne-\ntosheath. Since the plasma concentration is low in the mag-\nnetosphere, the interior RD propagates at a high Alfve´n speed\nand the reflection of ions from it can give the considerable ion\nenergisation that is sometimes found in the LLBL (Williams\net al., 1987). By including this ion reflection, Lockwood\nand Moen (1996) and Lockwood (1997b) were able to obtain\nvery good matches to the ion data from the LLBL presented\nby Moen et al. (1996) and Kremser et al. (1995), respectively.\nIn addition, there may be a local maximum in the magnetic\nfield strength near the point where the field line threads the\nboundary and\/or the bow shock, and thus, there can be mag-\nnetic bottles on open field lines (Cowley and Lewis, 1990)\nwhich maintain quasi-trapped double loss cone distributions\nof both ions and electrons (Scholer et al., 1982; Daly and\nFritz, 1982). Another factor may be that energetic, large\npitch angle ions and electrons can undergo gradient-B and\ncurvature-B drifts onto open field lines. Such penetration of\nthe open field line region by magnetospheric particles would\nbe on the dawn side for electrons and on the dusk side for\nions.\n1.7 Bi-directional streaming electrons\nThe LLBL is also often found to contain bi-directional field-\naligned streams of electrons with energies of typically 20–\n500 eV (Ogilvie et al., 1984; Hall et al., 1991; Traver et\nal., 1991). Ogilvie et al. (1984) suggested that these orig-\ninated from upward beams of accelerated ionospheric elec-\ntrons seen at low altitudes (Sharp et al., 1980; Klumpar and\nHeikkila, 1992; Collin et al., 1982; Burch et al., 1983). For\nadiabatic, scatter free motion, accelerated ionospheric elec-\ntrons produced in one hemisphere will arrive in the other\nionosphere via the loss cone. Thus, unless they are scat-\ntered out of the loss cone, the ionosphere in the other hemi-\nsphere must also be a source of electrons which produce\nthe observed counterstreaming. Thus, if the source of these\nstreams is indeed acceleration of ionospheric electrons, their\nbi-directional nature would prove that they were on closed\nfield lines.\nThe electron counterstreaming is often balanced (i.e. iden-\ntical in the field parallel and anti-parallel directions), which\nis often cited as evidence for an ionospheric source and thus,\nfor closed field lines (e.g. Traver et al., 1991). However, this\ncalls for the two independent ionospheric sources to coinci-\ndentally have equal strengths (in terms of fluxes) and iden-\ntical characteristics (in terms of distribution functions of the\naccelerated electrons produced). This may be unlikely, es-\npecially near the solstices when one of the sources would\nbe in summer and the other in winter, and the ionospheric\nconditions are different. Savin et al. (1997) report an associa-\ntion of ELF waves with these electrons, raising the possibility\nthat they are accelerated by such waves at the magnetopause.\nWith this being the case, the electrons could be of either mag-\nnetosheath or ionospheric origin but for the latter, an addi-\ntional acceleration and\/or heating mechanism would be re-\nquired at low altitudes for them to escape the ionosphere.\nThus, an alternative explanation of counterstreaming elec-\ntrons would place them on open field lines, where the source\nis the magnetosheath (with slight heating at the magne-\ntopause). The precipitating electrons would then mirror at\nlow altitudes and return upward, giving balanced counter-\nstreaming at all pitch angles outside the loss cone.\nThe AMPTE-UKS observations strongly suggest that the\nnature of these electron streams changes continuously as the\nsatellite traverses the LLBL, such that the density increases\nand the temperature decreases as the magnetosheath is ap-\nproached with the values that are almost identical to the\nmagnetosheath located immediately adjacent to the bound-\nary (Hall et al., 1991; Hapgood and Bryant, 1992; Lockwood\nand Hapgood, 1998). If this is indeed the case, it is very diffi-\ncult to see how these electrons are of ionospheric origin, as it\nwould require that the acceleration mechanism that is active\non the ionospheric electrons would be able to match the elec-\ntron population in the magnetosheath, such that there is no\ndiscontinuity across the last closed field line. The analysis of\nLockwood and Hapgood (1997) is a very good explaination\nof the mixing of magnetospheric and magnetosheath electron\nfluxes across the boundary, and it places the counterstream-\ning electrons on the most recently opened field lines. With\nthis being the case, the bi-directional streaming must arise\nfrom the presence of an injected (and slightly heated) sheath\npopulation which has travelled directly from the boundary\nto the satellite, as well as a population which was injected\nslightly earlier and has mirrored at low altitudes and returned\nto the satellite.\nTraver et al. (1991) also report a variation in the bi-\ndirectional stream characteristics across the LLBL and ob-\nserved the “hot” tail of the distribution above 200 eV. They\nnote that LLBL fluxes are enhanced over both sheath and\nplasma sheet values at these energies and conclude that some\nelectron heating is required if these are to be of sheath ori-\ngin. They argued that the heating of an ionospheric source\nwas more likely. However, recent observations of electron\nflows across the magnetopause by Onsager et al. (2001) show\n1618 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations\nthat such heating does indeed occur. Thus, the bi-directional\nelectron streams can be viewed as evidence for open LLBL\ntopology, rather than a closed one.\n1.8 The LLBL and Flux Transfer Events\nFlux transfer events (FTEs) were first identified in data taken\nby the ISEE 1 and 2 (Russell and Elphic, 1978, 1979) and\nthe HEOS 2 spacecraft (Haerendel et al., 1978) at the day-\nside magnetopause. The key defining features of the events\nare a bipolar oscillation in the boundary normal component\nof the magnetic field BN and a rise in the field strength |B|\nat the event centre. Studies using the nearby ISEE 1 and 2\nspacecraft suggested that the dimension of the FTEs normal\nto the magnetopause was typically of the order of 1RE (a\nmean Earth radius, 1RE = 6370 km) (Saunders et al., 1984\na, b). Statistical surveys of the occurrence of these events\nshowed that they are seen predominantly when the magne-\ntosheath or interplanetary magnetic field points southward\n(Berchem and Russell, 1984; Rijnbeek et al., 1984; South-\nwood et al., 1986; Kuo et al., 1995; Kawano and Russell,\n1996; 1997), strongly suggesting an association with patchy\nand transient magnetic reconnection (Galeev et al., 1986).\nHowever, seemingly similar events observed closer to the\nEarth, and therefore probably deeper in the magnetosphere,\nshow little or no tendency to occur during a southward inter-\nplanetary magnetic field (IMF) (Kawano et al., 1992; Borod-\nkova et al., 1995; Sanny et al., 1996). Furthermore, Sibeck\nand Newell (1995) questioned the association of magneto-\nspheric FTEs with southward IMF and magnetosheath field\norientations, pointing out that if the sheath field was used, it\nwas usually observed later\/earlier in the same pass as the FTE\nand that the sheath field direction was likely to change in the\nintervening time. In addition, they pointed out that the spatial\nstructure in the interplanetary medium can often result in the\nIMF orientation, as observed by an upstream satellite, which\ndiffers from that of the magnetosheath field, and that uncer-\ntainties in the propagation delay from the IMF monitor to the\nmagnetopause could be important. However, none of these\neffects would bias the statistical surveys toward southward\nIMF conditions, and so they do not offer an explanation of\nthe preponderance of the southward IMF\/sheath field during\nFTEs.\nLockwood and Hapgood (1998) have applied the success-\nful model of cusp ion steps (Lockwood and Smith, 1992;\nLockwood and Davis, 1996; Lockwood et al., 1998) to an\nFTE and proved that the event was a transient entry into the\nopen LLBL. Transient LLBL entries into the LLBL were ob-\nserved by Sckopke et al. (1981), and also interpreted in terms\nof LLBL thickenings. However, these events were not ac-\ncompanied by the classic bipolar boundary-normal field sig-\nnatures that define an FTE.\nThe interior of FTEs is a mixture of magnetospheric and\nmagnetosheath plasma (Thompsen et al., 1987, Farrugia et\nal., 1988; Lockwood and Hapgood, 1998), including ener-\ngetic magnetospheric ions (Scholer et al., 1982b; Daly et al.,\n1984). An important feature of FTEs is that they are not\nequilibrium structures, i.e. there is a total pressure excess\n(particle plus field) in the event core (Farrugia et al., 1988;\nRijnbeek et al., 1987; Lockwood and Hapgood, 1998).\nThe modelling of Lockwood and Hapgood (1998) con-\nfirmed that the field lines in the core of an FTE are open,\nas inferred from the ion composition (Thompsen et al.,\n1987) and ion velocity distributions (Smith and Owen, 1992).\nLockwood and Hapgood also used a variant of the method by\nLockwood and Smith (1992) to show that the field lines in\nthe core of an observed event were opened in a pulse of en-\nhanced reconnection rate. The layered structure of the event\nwas shown to be caused by the subsequent reconnection his-\ntory. Both numerical simulations and analytic theory predict\nthat such a reconnection pulse will cause an excess (unbal-\nanced) total pressure in the core of the event and this will\nthen cause the open LLBL to bulge, driving a bipolar signal\nas the signal propagates (Scholer, 1988a, b, 1989; Semenov\net al., 1991, 1995). On the other hand, Sibeck (1990) pro-\nposed that the excess pressure is not within the LLBL but in\nthe magnetosheath, making the event a ripple of the bound-\nary. Due to the reconnection signatures in the event core,\nthe Sibeck theory requires ongoing reconnection, indepen-\ndent of the pressure enhancement. This theory provoked a\ngreat deal of discussion about whether the signatures were\nbulges in the reconnection layer, caused by a reconnection\npulse (Southwood et al., 1988; Scholer, 1988a, b, 1989; Se-\nmenov et al., 1991, 1995), or corrugations of the reconnec-\ntion layer, driven by magnetosheath pressure pulses (Sibeck,\n1992; Song et al., 1994; Lockwood, 1991; Elphic, 1990).\nSearches for upstream pressure variations in the solar wind\nhave failed to find events that could act as a source of the\nrequired small-scale (of the order of 1RE) sheath pressure\nvariations (Elphic and Southwood, 1987; Elphic et al., 1994).\n2 Observations\nOn 14 January 2001, the four Cluster spacecraft approached\nthe magnetopause from the tail lobe, close to the 15:00 MLT\nmeridian. Simultaneous measurements were made using a\nwide array of ground-based instrumentation. An overview\nof this pass and of the instrumentation deployed is given\nby Opgenoorth et al. (2001, this issue), who also study\nthe intersection of the exterior particle cusp by the Cluster\ncraft at about 13:30 UT. In addition, combined Cluster and\nground-based observations of polar cap patches, seen be-\ntween 08:00 and 09:30 on this day, are discussed by Lock-\nwood et al. (2001, this issue). Figure 1 presents and overview\nof the data recorded by Cluster and EISCAT Svalbard Radar\n(ESR) between 10:30 and 14:00. Figure 1a shows the plasma\nconcentrations seen by the ESR beams pointing at low (30◦)\nelevation along the northward magnetic meridian. Figure 1b\nshows the plasma concentrations along the other ESR beam,\naligned with the local magnetic field direction. Figure 1c\nshows the ions seen by the CIS instrument of the Cluster C3\nspacecraft: differential energy flux is contoured in an energy-\ntime spectrogram format. Figure 1d shows the electrons seen\nM. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1619\n \n \n \n  e\nle\nct\nro\nn \nen\ner\ngy\n (e\nV)\n →\n  i\non\n e\nne\nrg\ny \n(e\nV)\n →\n  \n h\nei\ngh\nt (\nkm\n) →\n \nin\nv.\n la\ntit\nud\ne \n(d\neg\n) \n \ntime (hrs : min)   →\n83 \n81 \n79 \n77 \n75 \n14 January 2001 \n104\n103\n102\na) northward \nb\n600\n400\n200\nd) C3\/PEACE \n18           19        20    21                    22         23    24 25 26 27  28  29      \nb) field-aligned \n10:30                                  11.30                                  12:30                                 13:30     \nDMSP-F15        Cluster \nc) C3\/CIS 104-\n103-\n102-\n10 -\nFig. 1. Observation of transient events seen by Cluster and the EISCAT Svalbard Radar (ESR) on 14 January 2001. (a) The plasma\nconcentrations seen in the ionosphere along the low elevation (30◦) poleward beam of the ESR, are colour-coded as a function of time and\nlatitude. The centre of poleward-moving events are marked with a black line which is numbered in continuation of the events earlier on the\nsame day, as studied by Lockwood et al. (2001, this issue). (b) The observations along the field-aligned ESR beam are shown as a function\nof time and altitude. (c) An energy-time spectrogram of differential energy flux of ions, integrated over all pitch angles, as observed by the\nCIS instrument on Cluster C3. (d) An energy-time spectrogram of the count rate of electrons observed by the HEEA detector of the PEACE\ninstrument on Cluster C3 in zone 11 (electrons moving in the +ZGSE direction). The ESR and CIS data are colour-coded using the same\nscales as in Fig. 1 of Opgenoorth et al. (2001, this issue). The PEACE data are scaled using the same scale as in Fig. 8 of the present paper.\nThe vertical dashed lines give the times of closest conjunction of the ESR and Cluster (mauve) and the ESR and the DMSP-F15 satellite\n(green).\nin zone 11 of the HEEA detector (i.e. of electrons moving\nin the +ZGSE direction) of the PEACE instrument, also on\nthe Cluster spacecraft C3: count-rates are contoured in an\nenergy-time spectrogram format.\nIn this paper, we concentrate mainly on the data taken be-\ntween 11:00 and 12:30 which includes close conjunctions of\nthe ESR with the DMSP-F15 satellite and the Cluster space-\ncraft at about 11:44 and 12:20 UT, respectively (marked by\nthe green and purple dashed lines in Fig. 1). In this interval,\nthe Cluster craft were observing the dayside magnetospheric\npopulation often termed boundary plasma sheet (BPS, e.g.\nNewell and Meng, 1992) with frequent, but brief, excur-\nsions into the low latitude boundary layer (LLBL). These\nare marked by the appearance of low-energy sheath ions and\nelectrons (predominantly at energies below 500 eV) and the\npartial or complete disappearance of magnetospheric elec-\ntrons (predominantly at energies above 500 eV), but not of\nthe magnetospheric ions. Clear-cut examples of these LLBL\nentries are seen around 11:23, 11:37 and 12:52, with a more\ncomplex but long-lived example around 12:10. Other short-\nlived examples are also seen before the cusp convected east-\nward over the craft at around 13:30 (see Opgenoorth et al.,\n1620 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations\n2001, this issue) and further examples were seen in the in-\nterval after the cusp intersection and before the passage of\nthe satellites through the magnetopause (not shown here, see\nOpgenoorth et al., 2001, this issue).\nFigure 1a shows that the poleward-pointing ESR beam\ncontinued to observe poleward-moving events, as it had dur-\ning the prior interval of southward IMF (see Lockwood et\nal., 2001, this issue). The numbering scheme used in Fig. 1\nis a continuation of that used in the previous paper. How-\never, these events were slightly less frequent and migrated\npoleward at a somewhat lower phase speed that they had ear-\nlier (see Fig. 8 of Lockwood et al., 2001, this issue). An-\nother difference is that these were not, in general, seen by\nthe field-aligned ESR beam (Fig. 1b). Blelly et al. (2001,\nprivate communication) have shown that even the event that\nwas seen by the ESR field-aligned beam at around 11:00,\ndoes not have the same origin as the events (numbers 20,\n21, and 22) seen in the northward-pointing beam. At this\ntime the convection pattern was evolving in a complex way,\nfollowing the northward turning of the IMF. Figure 2 is an\noverview of the magnetic field seen by the FGM instruments\non the four Cluster spacecraft on this pass: the four panels\ngive BX, BY and BZ in GSE coordinates and |B|. All four\nspacecraft show almost identical variations on the timescales\nshown here. At the start of the plot at 11:00 [BX]GSE > 0,\nbut this reverses to [BX]GSE < 0 after about 12:00 com-\nbined with the plasma data (which show a progression from\nlobe to mantle to dayside plasma sheet), we interpret this\nas a motion of the spacecraft from tail-like field lines onto\ndayside field lines; [BY ]GSE < 0 is true at all times when\nCluster is in the magnetosphere, which is as expected for the\n15 MLT location of the spacecraft; [BZ]GSE < 0 until about\n12:05, it is approximately zero for 12:05–13:15, and sub-\nsequently, [BZ]GSE > 0 for the remainder of the time that\nCluster is within the magnetosphere. Thus, Cluster was ini-\ntially observing the interior boundary layers LLBL\/BPS (i.e.\non southward-pointing field lines in the magnetic cusp fun-\nnel, half way along the boundary field lines between the exte-\nrior magnetopause and middle altitudes). From 12:05–13:15,\nCluster was observing the field lines that connect the interior\nand exterior, and interior boundaries (BZ ≈ 0), and subse-\nquently, the spacecraft observed the exterior magnetopause\nboundary layers (BZ > 0) where they intersected the exterior\ncusp at about 13:30 (Opgenoorth et al., 2001, this issue). For\nthe LLBL entry event around 11:23, which is studied in this\npaper in detail, the spacecraft are in the interior boundary lay-\ners (BZ < 0). We also look at an event around 12:10, when\nthe spacecraft were in the region with BZ ≈ 0 and an event\naround 12:53. Within this last event is a pulse of positive BZ ,\nand this event takes place when the spacecraft are close to the\nexterior boundary layers (BZ > 0). Figure 3 of Lockwood\net al. (2001, this issue) gives the interplanetary magnetic\nfield seen by the ACE spacecraft on this day. Opgenoorth\net al. (2001, this issue) report a very high cross-correlation\nof the clock angle of the magnetosheath field (in the GSE\nZY plane) seen by Cluster, once it had emerged from the\nmagnetosphere after 15:00 UT, with the same angle seen by\nACE. The conservation of clock angle across the bow shock\nreveals a lag of 74 min between ACE and the magnetosheath.\nLockwood et al. (2001, this issue) have cross-correlated mag-\nnetic perturbation seen by the IMAGE magnetometer chain\nbefore the northward turning and derived a lag between ACE\nand the ionosphere that fluctuated around 75 min. Given that\nthe propagation delay from the magnetopause to the dayside\nauroral ionosphere is typically 1–2 min, these lag estimates\nare highly consistent. In the interval studied in this paper,\nthe lagged IMF is predominantly northward: the effects of\na clear northward turning of the IMF seen by ACE around\n09:50 are clearly detected around 11:00 in magnetometer de-\nflections, and the transpolar voltage from the potential model\nfits to the SuperDARN radar data. Here we concentrate on\nthe Cluster data taken in intervals marked B and C in Fig. 3\nof Lockwood et al. (2001, this issue). When allowing for the\nderived propagation lag of 75 min, these intervals correspond\nto 11:19–11:27 UT and 12:00–12:20 UT, both of which have\nnorthward IMF (for interval B, BZ ≈ +3 nT, BY ≈ +1.5 nT\nin GSM coordinates, giving a clock angle θIMF ≈ 26◦; for\ninterval C, BZ ≈ +3 nT, BY ≈ −3 nT, giving θIMF ≈ 45◦).\nHowever, both follow intervals in which the IMF BZ compo-\nnent fell briefly to near to zero (θIMF ≈ 90◦), with a positive\nIMF BY .\nThis association is stressed in Fig. 3 which shows the\nPEACE electron data from Fig. 1d with the IMF clock angle\nin GSM (θIMF, Fig. 3b), and the solar wind dynamic pressure\ndata observed by ACE (PSW , Fig. 3c). The interplanetary\ndata are plotted on a time scale that is lagged by the nomi-\nnal delay of 75 min, but an additional offset of 16.5 min has\nbeen introduced between the PEACE data and the ACE data\nplots, making a total lag of 91.5 min. This lag provides a\ngood alignment of the event seen by Cluster around 12:10,\nwhen Cluster and the ESR were in close conjunction. How-\never, Fig. 3 also demonstrates that there is a general corre-\nspondence between the onset of other LLBL events and the\nincreases in the IMF clock angle. There is no correspondence\nbetween the solar wind dynamic pressure changes and this or\nany other lag. The origin of the additional lag of 16.5 min,\nhowever, requires an explanation before the LLBL events can\nbe associated with the swings of the IMF vector toward the\nmagnetospheric equatorial plane (the rises in θIMF).\n2.1 DMSP-F15 observations\nFigure 4 shows (a) the electrons and (b) the ions observed\nby DMSP-F15 as it passed equatorward, moving close to\nthe ESR field-aligned beam around 11:44. The path of the\nsatellite relative to the two ESR beams is given in Fig. 5 in\ninvariant latitude with Magnetic Local Time (3-MLT) co-\nordinates. In Fig. 4, the differential energy flux is plotted\nas a function of energy (increasing upward) and observation\ntime. The satellite entered the polar cap, passing through an\nauroral oval showing a series of inverted-V electron arcs at\n11:36–11:39 UT, at around 3 = 70◦ and 19:00 MLT. The\npurple line in Fig. 4c shows the horizontal convection veloc-\nity perpendicular to the satellite track, which changed from\nM. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1621\nFig. 2. The magnetic field observed by the four Cluster spacecraft at 11:16 UT on 14 January 2001. The plots shows the BX , BY and BZ\ncomponents in the GSE frame and the field magnitude |B|. Data from spacecraft C1, C2, C3 and C4 are coloured (respectively) black, red,\ngreen and magenta. (Note: in this figure, data have been plotted in the order of C1, C2, C3 and then C4 and since the data are very similar\non this time scale, the magenta line for C4 has covered much of the other three lines).\nsunward (i.e. from right to left when looking forward along\nthe orbit) to weakly “anti-sunward” (i.e. from left to right\nacross the orbit) close to the poleward edge of this auroral\noval. The segment of the DMSP-F15 path that revealed the\nsunward flow channel and inverted-V events is marked with a\nthicker line in Fig. 5. At the poleward edge of the inverted-V\nevents, the satellite observed a convection reversal boundary,\nwith anti-sunward flow persisting thereafter.\nThe satellite was then briefly within a region where it ob-\nserved polar cap precipitation, with brief intersections of\nmagnetosheath. No significant ion flux was seen and the\nconvection was anti-sunward. This persisted until about\n11:41:30, when the satellite began to observe persistent\nsheath electron fluxes. This segment of the orbit is also\nmarked with a thick line in Fig. 4, labelled sheath-like elec-\ntrons because the spectrum is notably lacking in the lowest\nenergy electrons of the sheath distribution. At this time, weak\nfluxes of ions are seen at about 3–20 kV. Just before the satel-\nlite’s closest conjunction with the field-aligned ESR beam\n(at around 11:44, orange and black dashed line), the elec-\ntron spectrum becomes a low-flux, low-energy sheath dis-\ntribution which persists until the satellite passes through the\nopen-closed boundary (OCB), estimated here to be at 11:45\n(red and black dashed line). The OCB is identified by the\ndisappearance of the weak sheath electron population and the\nonset of persistent BPS electrons. After 11:45, there is a brief\ndispersed electron event at low-energies and a brief drop out\nof the BPS electrons (at energies above about 1 keV). This\nmay be a brief re-encounter with the OCB, but this is not\nas clear-cut as in the example presented by Lockwood et\nal. (2001, this issue). The OCB location is also marked on\nFig. 5.\n2.2 Convection and magnetometer observations\nFigure 5 also plots the flow streamlines (equipotentials 5 kV\napart) derived by the AMIE technique for 11:40–11:45 UT,\nwhen the DMSP-F15 satellite was close to the ESR. The\ntechnique has used observations by the SuperDARN radars,\nground-based magnetometers, the EISCAT radars and the\nDMSP satellites. The pattern shows a dominant dusk cell\nwith only a weak dawn cell. The pattern appears to show\na convection throat at high-latitudes (3 ≈ 80 − 85◦) in the\nmorning sector with eastward and poleward flow into the po-\nlar cap, suggesting negative IMF BY (Heelis et al., 1976).\nHowever, the lagged IMF data at this time gives positive\nIMF BY and such an interpretation would place both the\nESR beams on closed field lines, which is inconsistent with\nthe OCB location deduced from Fig. 4. This will be dis-\ncussed again below. The evolution of the pattern to the form\nshown in Fig. 5 is presented in Fig. 6. At 11:05, the lagged\n1622 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations\n \n \n \n11:00                                                       12:00                                                          13:00    \nUniversal Time (hr : min) \nD\nyn\nam\nic\n P\nre\nss\nur\ne \nP S\nW\n   \n(n\nPa\n) \nIM\nF \ncl\noc\nk \nan\ngl\ne \nθ I\nM\nF \n ( \n°\n ) \n1.4\n1.0\n0.6\n0.2\n120\n80\n60\n20\nb).\nc).\nlo\ng 1\n0 [\n E\ne \n in\n e\nv \n] \n4\n3\n2\na). lag = 16.5 min\n11:00                                                       12:00                                                           13:00    \n 11:30                                                         12:30                            \nFig. 3. (a) The PEACE data shown in Fig. 1d and compared with (b) the IMF clock angle θIMF in GSM coordinates, as observed by ACE and\n(c) the solar wind dynamic pressure, PSW , also observed by ACE. The ACE data are plotted against lagged time, using the nominal 75 min.\nlag derived independently by Lockwood et al. (2001, this issue) and Opgenoorth et al. (2001, this issue) for, respectively, before and after\nthe period of interest in this paper. An additional lag of 16.5 min has been introduced to obtain a good correspondence between the transient\nLLBL entries seen by Cluster and the increases in θIMF to near 90◦.\nIMF had turned northward, but the convection pattern had\nyet to respond in any significant way (the transpolar voltage\nis 55 kV, which was the value it had during the prior period\nof southward IMF, see Fig. 3, Lockwood et al., this issue),\nother than a small patch of low flow which appeared just to\nthe west noon. The flow pattern had a vigorous dawn cell\nas well as the dominant dusk cell and the flows in the day-\nside polar cap were poleward and weakly westward, which\nis consistent with the weakly positive IMF BY . At 11:10,\nthe transpolar voltage had dropped to 49 kV and the slow\nflow feature evolved into an unusual distortion of the dusk\ncell around noon. The perturbation to the flow had addi-\ntional anti-sunward flow just to the west of the ESR, with\nadditional sunward flow to the west of that paint. By 11:15,\nonly the additional poleward flow could be resolved, having\nmigrated towards dusk, such that it was to the east of the\nESR. The transpolar voltage had fallen to 39 kV. At 11:20,\nthe transpolar voltage had risen again to 47 kV, primarily due\nto a second enhancement in poleward flow, which like the\nprevious one, appears first near noon. The first enhancement\nin poleward flow can still be defined and has moved further\neast (but at a slower speed), occuring around 16:00 MLT at\nthis time. After 11:25, the transpolar voltage was roughly\nconstant at a baselevel of about 35 kV. This value is likely to\nreflect the rate of open flux destruction in the tail, in which\ncase further enhancements in the dayside voltage are not go-\ning to be reflected in the transpolar voltage. It appears that\npoleward flow features form near noon at 11:10, 11:20 and\nthen migrate east.\nThis eastward propagation may offer an explanation of\nsome or all of the delay of 16 min between the IMF clock\nangle changes and the seemingly associated LLBL entry\nevent. A more detailed study of the enhancements at the\nESR\/IMAGE meridian is presented in Fig. 7, which shows\nthe 3 components of the lagged IMF data (by the nominal\n75 min), the electron data seen by PEACE-C4 (panel d), and\nthe upward continuation of the ground BX perturbation, BX ′,\nseen by the IMAGE chain, in the same format as used by\nLockwood et al. (2001, this issue). A positive X (north-\nward) component (BX ′ > 0) is a response to an eastward\ncurrent. If the magnetometers are responding to a Hall cur-\nrent in the E-region (i.e. horizontal uniformity of conductiv-\nities can be assumed), this corresponds to a westward con-\nvection velocity in the F-region. Note that the yellow and\nred colours reveal positive BX ′ (eastward current and thus\nwestward flow) whereas green and blue reveal negative BX ′\n(westward current and thus eastward flow). Between 11:00\nand 12:00 (roughly 14:45–15:45 MLT), westward flow was\nseen poleward of weaker eastward current south of the ESR;\nonly the former of these can be seen in the AMIE flow pat-\nM. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1623\n \n \n \nDMSP-F15                                                                                             14 January 2001 ESR OCB \na) \n \n \n \n \n \nb) \n \n \n \n \n \nc) \nFig. 4. Energy-time spectrograms for (a) electrons and (b) ions observed by DMSP-F15 as it passed equatorward in close conjunction with\nthe ESR along the path shown in Fig. 5. In both cases, the differential energy flux is plotted as a function of energy (increasing upward)\nand observation time, ts . (c) Shows the vertical (green) and horizontal (purple) components of the ion velocity (the horizontal component is\nperpendicular to the satellite track such that positive values have a sunward component and negative values have an anti-sunward component.\nThe orange-and-black dashed line gives the time of closest conjunction with the ESR field-aligned beam and the red-and-black line gives the\nopen-closed field line boundary (OCB) defined from the energetic magnetospheric electrons.\nterns shown in Fig. 6. Figure 7e shows clear increases in\nBX\n′ a few minutes (respectively about 7 and 5 min) before\nthe first two LLBL entry events at Cluster (at around 11:23\nand 11:37 UT, Fig. 7d). Note that the first of these is clear\nat the highest latitudes, but is slightly masked by the (declin-\ning) residue of enhanced BX ′ due to the southward IMF prior\nto the northward turning. For these two events, the relevant\npart of the IMAGE magnetometer chain is at an MLT 49 and\n35 min ahead of Cluster. For the third LLBL event around\n12:10, there is an almost a coincident enhanced BX ′ event.\nIn this third case, IMAGE is at essentially the same MLT as\nCluster. These data are consistent with events propagating\neastward at about 7 min of MLT per min (roughly 0.9 km s−1\nat ionospheric altitudes), and giving both the enhanced flow\nsignatures (detected as BX ′ increases) and a transient entry\nof the Cluster spacecraft into the LLBL.\nIf these events are also manifest as the poleward flow en-\nhancements near noon as seen in Fig. 6 (that commence in\nthe intervals from 11:05–11:10 and 11:15–11:20), they must\nhave moved from noon to the IMAGE meridian at the higher\naverage speed of 14 min of MLT per 1 min (approximately\n1.8 km s−1) between 12 MLT and 14 MLT (double the av-\nerage speed between IMAGE and Cluster at 14 MLT and\n15 MLT). This is consistent with the flow perturbations high-\nlighted in Fig. 6, as they move rapidly initially east and then\nthey slow down. Thus, the first detected signatures of the\nevents seen by Cluster appear to be the flow enhancements\nnear noon at about 11:07:30 and 11:17:30 in the AMIE con-\nvection plots. These are both just 5 min after the transient\nswings of the IMF to a near 90◦ clock angle and if one al-\nlows for the magnetopause to ionosphere propagation delay\nof 1–2 min, this is then within the uncertainty of the nominal\nlag estimate of 75 min.\n2.3 Cluster observations\nFigures 8 to 11 present a detailed analysis of the Cluster data\nfrom the interval of 11:19 to 11:27, which includes the sec-\nond of the transient LLBL events shown in Fig. 1. Table 1\ngives the coordinates of the Cluster spacecraft for this inter-\nval: the X, Y and Z coordinates in GSM; the geocentric dis-\ntance, r; the latitudinal and longitudinal angles, φGSM and\nθGSM, respectively; the field-aligned distance to the iono-\nsphere, di ; and the smallest distance of the spacecraft to the\nmodel magnetopause of Shue et al. (1997), Dmp. All of these\nparameters are also referenced to spacecraft C1 so, for ex-\nample 11XGSM is the difference between the XGSM of the\nspacecraft considered to that of spacecraft 1. The separations\n1624 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations\n \n \n \n      35kV\n11:40 UT\n14 January 2001\nMLT = 00 hrs \n06 \n12 \n18 \n Λ = 60º \n  70º \nCluster \nfootprint \nDMSP-F15 \nESR field-aligned beam ESR low elevation beam \n-5kV \n0 kV \n+10kV \n+20kV \n  OCB \nsheath-like \nelectrons \ninverted-V \nelectrons \nFig. 5. An invariant-latitude (1) – MLT map of the convection\nequipotentials from the AMIE technique for magnetometer, Super-\nDARN, EISCAT\/ESR and DMSP data post-integrated over the in-\nterval 11:40–11:45. The path of the DMSP-F15 satellite is shown,\nwith the two thick segments showing where the satellite observed\nsunward convection and inverted-V electron precipitation and mag-\nnetosheath electron precipitation. The location of the open-closed\nboundary (OCB, crossed by DMSP-F15 at 11:45) is also marked as\nare the locations of the two ESR beams and the mapped footprint of\nthe Cluster spacecraft.\nare given in km, whereas the coordinates are given in Earth\nradii (1RE = 6370 km). The separations are also given in\nboundary-normal coordinates (L, M , N ). The boundary-\nnormal orientation was first determined from a model since\nthe spacecraft did not intersect the magnetopause until some\nconsiderable time after the events discussed here. How-\never, when it did intersect the magnetopause at around 15:30,\nthe boundary-normal coordinates were found by the mini-\nmum variance technique to be almost exactly the same as\nthose for this model. We employ the minimum variance\nresults that give unit vectors of (l, m, n) and (i, j , k) in\nthe boundary-normal and GSE frames which are related by\nl = (0.32i+0.59j −0.74k),m = (0.63i−0.71j −0.29k),\nand n = (0.70i + 0.37j + 0.61k). These values are suffi-\nciently accurate to ensure that Bn is relatively small through-\nout the interval.\nTable 1 shows that spacecraft C3 is closest to the model\nmagnetopause (both 11Dmp and 11N are maxima for this\nspacecraft, equal to, respectively, +73.8 km and +52.1 km),\nwhereas C4 is predicted to be at the deepest point in the mag-\nnetosphere (both 11Dmp and11N are minima of−565.2 km\nand −467.9 km); C1 and C2 are at a similar distance from\nthe model boundary and 11Dmp and 11N yield different an-\nswers as to which is closest: 11Dmp is −13.6 km for C2,\nTable 1. Cluster spacecraft coordinates and separations at 11:23 on\n14 January 2001\nC1 C2 C3 C4\nXGSM (RE) 1.7446 1.8096 1.7893 1.7282\nYGSM (RE) 7.1268 7.0869 7.1706 7.0970\nZGSM (RE) 8.9529 8.9065 8.8869 8.8689\nr (RE) 11.5754 11.5250 11.5584 11.4896\nφGSM(◦) 50.6641 50.6060 50.2526 50.5255\nθGSM(◦) 76.2452 75.6756 75.9890 76.3138\ndi (RE) 11.1751 11.1282 11.1734 11.0833\nDmp (RE) −2.3993 −2.4015 −2.3878 −2.4881\n11XGSE (km) 0 414.6287 285.0409 −103.9391\n11YGSE (km) 0 −249.2815 286.1437 −181.0572\n11ZGSE (km) 0 −299.7885 −415.2994 −538.0202\n11L (km) 0 207.4486 567.3594 258.0507\n11M (km) 0 525.1446 96.8506 219.0948\n11N (km) 0 15.1349 52.0692 −467.9409\n11r (km) 0 −321.1767 −108.1304 −546.2790\n11φGSM(◦) 0 −0.0580 −0.4114 −0.1386\n11θGSM(◦) 0 −0.5696 −0.2562 0.0686\n11di (km) 0 −298.7955 −10.7349 −584.4671\n11Dmp (km) 0 −13.5909 73.7636 −565.1925\nwhereas 11N is +15.13 km. Figure 8 compares the elec-\ntron and ion data observed by the PEACE and CIS instru-\nments on the four spacecraft C4 during this interval. The top\nfour panels show the data, from top to bottom, the HEEA\ndetector of PEACE for spacecraft C1, C2, C3 and C4. Data\nare shown for zone 11, i.e. the electrons are moving in the\n+ZGSE direction. This zone gives a continuous data series\nat the highest time resolution. The count rates (proportional\nto differential energy flux) are shown in spectrogram format\nas a function of energy and time. Also shown are data from\nthe three functioning CIS ion instruments (on board, in or-\nder, C1, C3 and C4). The differential energy flux is shown\nin energy-time spectrogram format, integrated over all pitch\nangles. The arrows mark the appearance and disappearance\nof the lowest energy (< 100 eV) magnetosheath electrons\nin the PEACE data. They are reproduced on the CIS data\npanels. It can be seen that these points also mark the ap-\npearance and disappearance of the largest fluxes of magne-\ntosheath ions. However, careful inspection reveals that there\nare some lower fluxes of sheath ions seen outside these two\narrows, particularly by C1 and C3. Outside of the arrows,\nthe electron data reveal both a continuously dispersed disap-\npearance and reappearance of magnetospheric electrons and\na similarly dispersed appearance and loss, respectively, of\nlower energy sheath electrons. This reveals that the space-\ncraft has passed through a layered structure, rather than wit-\nnessing a transient loss of magnetospheric electrons (for the\nlatter, the highest energy sphere electrons would have reap-\npeared first and the lowest energy sheath electrons would\nhave disappeared last). This layering is consistent with the\nsatellite passing onto open field lines along which magneto-\nsphere electrons were lost by flowing out across the magne-\nM. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1625\n \n \n \n \n \n \nFig. 6. The sequence of 5 min integrated AMIE convection patterns for 11:05–11:45. The locations of the two ESR beams are shown in each\npanel.\n1626 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations\n \n \n \nG\neo\nm\nag\nne\ntic\n L\nat\nitu\nde\n →\n \n  B\nX′\n   \n(n\nT)\n \n \n+50 \n \n \n+25 \n \n \n0 \n \n \n-25 \n \n \n-50 \n \n \n \n11:00                    11:30                    12:00                    12:30 \nUniversal Time (hrs: min) \n \n \n78\n76\n74\n72\n70\n68\n66\n64\n62\n60\n B\nZ (\nnT\n)  \n   \n   \n B\nY \n(n\nT)\n   \n   \n  B\nX \n(n\nT)\n  \n \n+5\n0\n-5\n+5\n0\n-5\n+5\n0\n-5\n   a) \n \n \n   b) \n \n \n   c) \n \n \n \n \n   d) \n \n \n \n \n   e) \n \n \nFig. 7. (a)–(c) represent the lagged (by 75 min) variations of the\nIMF components BX , BY and BZ in the GSM reference frame; (d)\nthe energy-time spectrogram of the electron data seen by PEACE-\nC4 (as shown in Figs. 1 and 3), and (e) the “upward continuation” of\nthe X component of the magnetic field BX ′ as a function of latitude\nand from the IMAGE magnetometer chain. The technique used to\nderive BX ′ employs Fourier analysis of the observations of the data\nfrom the latitudinal chain of stations on the ground to reconstruct\nhigh-resolution latitude variations that would have been observed\njust below the current layer.\ntopause, and magnetosheath electrons were gained, by flow-\ning in the opposite direction. The time-of-flight dispersion of\nboth reveals that the satellites passed onto field lines that had\nbeen open for longer at the event centre before returning to\nclosed field lines. The magnetospheric ions are the apparent\ndifficulty in this interpretation. Figure 8 shows that their flux\nis not really altered much at all in the event and remains con-\nstant, even when the magnetosheath ions are present. This\ncannot be an effect of the longer flight time of the ions (com-\npared to electrons of the same energy) since the sheath ions\nhave had time to arrive. Data from the RAPID instrument\nat higher energies confirms the decrease in flux of magneto-\nspheric electrons but only small reductions in the flux of the\nions (Wilken et al., 2001, this issue). The lack of any tran-\nsient decrease and recovery in the magnetosperic ions shows\nthat their maintenance is not due to drifts onto opened then\nre-closed field lines. Thus, if the satellite is moving onto,\nand then deeper into open field lines in this event, some pro-\ncess is maintaining the flux of magnetospheric ions on these\nnewly-opened field lines. The only alternative explanation\nis that the sheath plasma has been injected onto closed field\nlines, but this does not explain the loss of the magnetospheric\nelectrons, nor the dispersion ramps outside the arrows.\nFigure 9 gives the moments of the ion gas, as observed by\nthe CIS instrument on spacecraft 4. The times of the relevant\npair of arrows in Fig. 8 are given by the two vertical lines.\nThe panels show: (a) the proton number density, N(H+); (b)\nthe alpha particle number density, N(He++); (c) the field-\nparallel ion temperature, T||; (d) the field-perpendicular ion\ntemperature, T|; and the ion velocity components; (e) VX,\n(f) VY ; and (g) VZ , in GSE coordinates. The number den-\nsity of protons and alpha particles shows the same wave-\nform, such that the fraction of alpha particles is about 10%\nthroughout. The mixing of the two populations means that\nthe lower temperature sheath plasma depresses the temper-\natures in the event, in particular, the perpendicular temper-\nature which falls from typical magnetospheric values of the\norder of 5× 107 K for this location close to the dayside mag-\nnetopause to of the order of 2 × 106 K in the event cen-\ntre which is typical of sheath values for this magnetopause\nlocation. The number densities confirm that there is addi-\ntional plasma outside the event boundaries, particularly in\nits wake, but they have only a small effect on the average\ntemperatures. At the event centre, the velocities are of the\norder of [VX]GSE = −20 km s−1, [VY ]GSE = 25 km s−1 and\n[VZ]GSE = −25 km s−1. Although these point away from\nnoon around the magnetopause, these are much smaller val-\nues than the values seen once Cluster does emerge from the\nmagnetopause and into the sheath, which average [VX, VY ,\nVZ]GSE = [−170, 65,−70] km s−1 (see below). These char-\nacteristics clearly define the plasma as being the low-latitude\nboundary layer (LLBL) with a mixture of magnetospheric\nplasma and magnetosheath plasma, flowing anti-sunward,\nbut at much slower speed than the sheath itself. (Mozer et\nal., 1994).\nThe spacecraft potential is measured by the EFW instru-\nment on each spacecraft and varies with the ambient plasma\nconcentration. Figure 10 shows the values for spacecraft C1\n(in black), C2 (red), C3 (green) and C4 (blue). All space-\ncraft see the same variation, with minima outside a main\ncentral enhancement where the magnetospheric electrons are\nlost and magnetosheath plasma are gained, respectively. All\nsatellites see a small secondary peak after the main peak, as\ncan be seen in the N[H+] and N[He++] variations in Fig. 9.\nThe signatures are nested to some extent, with C4 entering\nthe event last and emerging from it first. Table 1 shows that\nC4 is the furthest from the nominal magnetopause location (it\nhas the largest |Dmp|) and thus this supports the concept of a\ntravelling indentation of the boundary. Nesting is not so clear\nfor the other spacecraft. The order of the observed event du-\nrations (from longest to shortest) is C2, C3, C1, C4; whereas\nM. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1627\n \n \n \nFig. 8. Observations of the electrons and ions made by the PEACE and CIS instruments of the Cluster spacecraft at 11:19–11:27. (a)–(d) are\nenergy-time spectrograms of count rates seen by the HEEA detector of PEACE in zone 11 (electrons moving in the +ZGSE direction) for\nspacecraft C1, C2, C3 and C4, respectively. (e)–(g) are energy-time spectrograms of differential number flux observed by CIS for spacecraft\nC1, C3 and C4. The arrows mark the boundaries of the LLBL event, defined from the lowest energy sheath electrons, and plotted for the\nsame times on the ion spectrograms and in Fig. 10.\nthe order set by a constant nested signature and the boundary-\nnormal separations 11N (see Table 1) would be C3, C2, C1,\nC4. The arrows in Fig. 10 are at the same times as those in\nFig. 8: they are colour-coded using the same scheme as the\ngraphs. The duration and nesting of the events defined this\nway are similar to those derived from the EFW spacecraft\npotential data.\nCross-correlating the signatures seen by EFW at the space-\ncraft gives a phase lag between spacecraft, which can be\nused to give one estimate of a phase velocity of [VX,\nVY , VZ]GSE = [−24, 0, 9] km s−1 , which in turn yields\nV|| = 1 km s−1 and V⊥ = 26 km s−1 in relation to\nthe average magnetic field direction and [VL, VM , VN ] =\n[−14.3,−17.7,−11.31] km s−1 in boundary-normal coordi-\nnates. The event is moving anti-sunward into the magneto-\nsphere, rather than around its dusk flank. Thus, the event\ndemonstrates a field-perpendicular convection of flux tubes,\nprimarily moving in the anti-sunward (−X) direction. Us-\ning the Tsyganenko T96 model with appropriate inputs, this\nvelocity maps to a speed of ionosphere Vi ≈ 0.8 km s−1,\nin a direction poleward and away from noon around the af-\nternoon sector. The core of the event at C2 lasts for 210 s,\n1628 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations \n \n \nFig. 9. The moments of the ion gas from spacecraft C3 for the\ninterval shown in Fig. 8. The panels show: (a) the proton number\ndensity, N(H+); (b) the alpha particle number density, N(He++);\n(c) the field-parallel ion temperature, T||; (d) the field-perpendicular\nion temperature, T⊥; and the ion velocity components (e) VX , (f)\nVY , and (g) VZ , in GSE coordinates.\nwhich gives a length of structure at the magnetopause and\nin its direction of motion of L ≈ 26 × 210 = 5460 km\n(∼ 1RE), which mapped to ionosphere gives Li ≈ 140 km.\nNote that the average ion velocities within the event (see\nFig. 9) are comparable in magnitude, but not precisely the\nsame as the derived event phase motion. The phase mo-\ntion is much lower than the exterior sheath speeds seen af-\nter the magnetopause crossing. Average velocities for 5 min\nafter the satellites emerge from the sheath (i.e. for 15:09–\n15:14 UT) are [VX, VY , VZ]GSE = [−170, 65,−70] km s−1,\ngiving [VL, VM , VN ] = [35.7,−133.0,−137.7] km s−1.\nThe large negative VN probably indicates that the satel-\nlites are already deep into the magnetosheath for much\nof this time. The best alignment of sheath flow\nwith the nominal boundary plane is seen at 15:06:10,\nwhen [VX, VY , VZ]GSE = [−80, 100,−15] km s−1, giving\n[VL, VM , VN ] = [44.5,−117.1 − 28.1] km s−1. For either\nestimate, the sheath flow velocity is an order of magnitude\nlarger than the event phase velocity. Both the event mo-\n \n \n \nFig. 10. The spacecraft potentials in the interval shown in Fig. 8,\nmeasured by the EFW instruments on spacecraft C1 (black), C2\n(red), C3 (green) and C4 (blue). The arrows correspond to those\nplotted in Fig. 8.\ntion and the sheath flow are towards dusk (negative M com-\nponent), but the event motion is equatorward (negative L),\nwhereas the sheath flow is poleward (positive L), indicating\nthat the magnetic curvature force, as well as the sheath flow,\nis playing a role in the field line evolution. The tension force\nmust have a strong component in the −L direction, implying\na high-latitude reconnection site. The large differences be-\ntween both the magnitude and the direction of the event ve-\nlocity and the sheath velocity mean that this event is certainly\nnot a boundary indentation caused by a feature propagating\naround the magnetosphere in the magnetosheath.\nFigure 11 shows the magnetic field observations during\nthis event in the boundary-normal frame, using the boundary-\nnormal orientation discussed earlier. Fig. 11 shows no co-\nherent signal in the boundary-normal component, BN , and\ncertainly no bipolar signature that could be interpreted as\nan FTE. However, primarily due to an increase in the BM\ncomponent, there is a weak peak in the field magnitude, |B|.\nThus, the event appears to be an FTE in all but one respect:\nit has a dimension of about 1RE in its direction of motion; it\nis moving anti-sunward into the polar cap and the motion is\nfield-perpendicular; it contains a mixture of magnetosphere\nand magnetosheath plasma. The only feature lacking is the\nbipolar signature in the boundary-normal field.\nUnfortunately, skies over Svalbard were cloudy at the time\nof this event and thus, we could not use auroral imagers to ob-\nserve any corresponding phase motion in the mid-afternoon\nauroral ionosphere. However, after the skies cleared, such\nobservations were possible for the less clear-cut event around\n12:10. These are discussed in the next section. For compari-\nson, Fig. 12 shows the PEACE and CIS data for this event, in\nthe same format as Fig. 8. Many of the same features are ob-\nM. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1629\nFig. 11. The magnetic field observed by the four Cluster spacecraft during 11:19–11:27 UT on 14 January 2001. The plots shows the BL,\nBM and BN components (in the boundary-normal frame described in the text) and the field magnitude |B|. Data from spacecraft C1, C2, C3\nand C4 are coloured (respectively) black, red, green and magenta.\nserved, but there are also differences . The event lasts longer\nat all spacecraft, but sheath electron fluxes at the centre of the\nevent are not as strong. There are more complex entries and\nexits from the event (in particular, for the exit from the event\nby C2), possibly implying corrugation and wave activity.\n2.4 Auroral observations\nFigure 13 shows a sequence of images taken at 630 nm by the\nall-sky camera at Ny A˚lesund, Svalbard from 12:00–12:34.\nThe images are in a geographic frame, with northward to the\ntop of each image and lines of constant geographic latitude\nand longitude marked. Each frame also shows the outline of\nSvalbard, the east coast of Greenland, and the mapped foot-\nprint of Cluster as a function of time. The luminosity to the\nsouth in each frame is scattered sunlight. Frames represent\n1 min integrations, shown every 2 min and the luminosity has\nbeen mapped by assuming it arises from 250 km altitude.\nAt 12:00, there was little 630 nm luminosity along the au-\nroral oval: what did exist was strongest amount to the west of\nSvalbard near the east coast of Greenland. The MLT of the\nobserving station at 12:00 is ∼ 4:45 h, and the western limb\nof the imager field-of-view is at an MLT of ∼ 2:15 h (for an\nassumed emission altitude of 250 km). Thus this 630 nm lu-\nminosity was in the right location near noon for it to be classi-\nfied as the cusp aurora. At 12:00, it was primariy to the north\nof the line denoting the path of the mapped Cluster footprint.\nBy 12:02, this noon cusp aurora had brightened and moved\nequatorward. Both the brightening and equatorward motion\n(compare its position relative to the Cluster path) continued\nuntil 12:08. This erosion is expected for enhanced recon-\nnection, which allows for the mean radiative lifetime of the\n630 nm emission at 110 s plus 1 min for the time-of-flight of\nsufficient enough ions to allow the electron precipitation flux\nto become sufficiently large. This means that a reconnection\npulse took place near noon at about 12:00–12:05. Figure 3\nshows that with the nominal lag of 75 min, the IMF clock an-\ngle was increased in a pulse (during which it rose above 90◦)\nbetween 11:54–12:00. Thus, this feature appears to be a re-\nsponse to the southward turning of the IMF seen by ACE, but\nwith a lag that is about 5 min longer than the nominal value\nof 75 min. This is certainly within both the uncertainty and\nthe fluctuation level of the lag estimates.\nAt subsequent times (12:08–12:18), the enhanced aurora\nspread eastward towards Svalbard. The appearance of a\nrayed feature to the east of Svalbard after about 12:14 marks\nits arrival at the zenith of the instrument. Note that this fea-\nture is almost certainly exaggerated in size and subsequent\nimages, since the emission comes from a wide range of al-\ntitudes and not just the 250 km (which is near the peak of\nthe volume emission rate) that had been assumed. Given that\nenhanced luminosity first appears about 2 h of MLT to the\nwest of Svalbard at 12:02, this is an approximate average\n1630 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations\n \n \n \nFig. 12. Same as Fig. 8 for the interval 12:00–12:20 UT.\npropagation speed of 10 min of MLT per min (corresponding\nto an ionospheric phase speed of 1.3 km s−1, very similar to\nthe initial eastward expansion speeds inferred from the multi-\ninstrument study of the event around 11:23). At subsequent\ntimes, the cusp aurora continues to brighten and careful in-\nspection reveals fine structure, with a series of events propa-\ngating poleward and expanding to the east.\nFigure 12 shows that the arrival of sheath electrons in the\nCluster LLBL intersection began at about 12:07 which, if\none allows for the particle propagation delay and the radia-\ntive lifetime, corresponds to the image at about 12:10. This\nis about 4 min before the expanding 630 nm aurora reached\nSvalbard and the Cluster footprint. Given the uncertainties of\nthe field line mapping, it is more than possible that the event\nseen by Cluster is related to the eastward-expanding 630 nm\nevent. Note that the expansion from first onset at 12:02 to the\nMLT of the ESR and Cluster (at about 12:14) explains much\nof the additional 16.5 min lag required to relate the Cluster\nLLBL entries and the clock angle changes in Fig. 3.\n2.5 Cluster magnetometer observations of an event in the\nexterior boundary layer\nFigure 1 shows that the series of LLBL intersections persists\nup to the cusp intersection at 13:30, and a particularly clear-\ncut particle event is seen around 12:53. Figure 14 shows\nM. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1631\n \n \n \nFig. 13. One-minute integrations (shown every 2 min) of 630 nm emissions seen by the Norwegian all-sky camera at Ny A˚lesund, Svalbard.\nEach frame shows the outline of Svalbard and, the east coast of Greenland and lines of constant geographic latitude and longitude, and the\nmapped footprint of the Cluster spacecraft. All emissions have been mapped assuming an emission altitude of 250 km. The images are\nordered from left to right in each row and rows are ordered from top to bottom. The first image (top left) is for 12:00 and the last (bottom\nright) is for 12:34 UT.\n1632 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations\nFig. 14. The same as Fig. 11, for the interval 12:45–13:00 UT.\nthe magnetometer data from the four spacecraft at this time,\nwhen Cluster was close to emerging into the exterior bound-\nary layers. A signature begins to emerge for this event,\nwhereas the interior boundary layer events show no clear\nmagnetic signature (Fig. 11). Figure 14 shows that this event\ndisplays a clear enhancement of the negativeBL in boundary-\nnormal coordinates; 3 of the 4 spacecraft show a reduction in\nthe magnitude of the negative BM and there is a signature in\nthe boundary normal field BN seen by all spacecraft. The\nmagnitude of the field |B| is increased in a broad peak.\nIn fact, careful inspection of both the electron and ion data\nin this event reveals that it was a double event (Fig. 1) and\nthis is also seen in Fig. 14 which shows peaks in |BL| and\n|B|. In addition, the BN data reveal two bipolar signatures\n(with first 1BN negative, then positive) centred at 12:52\nand 12:58. Outside the events, the field is pointing towards\ndawn and sunward ([BX]GSE ≈ −3 nT, [BX]GSE ≈ −20 nT,\n[BZ]GSE ≈ 0), so that the negative\/positive polarity signal is\nconsistent with two bumps in the magnetopause propagating\nanti-sunward and eastward over the spacecraft. These signa-\ntures are thus a pair of FTEs.\n3 Discussion and conclusions\nWhen approaching the magnetopause on an outbound pass\non 14 January 2001, Cluster underwent a series of brief in-\ntersections with the Low-Latitude Boundary Layer (LLBL),\nboth before and after it intersected the cusp at about 13:30\n(Opgenoorth et al., 2001, this issue). These are similar events\nto those observed by INTERBALL, as reported by Savin et\nal. (1997), and by GEOTAIL, as reported by Fujimoto et\nal. (1998) but are here observed by the four Cluster space-\ncraft.\nThe dispersed disappearance and reappearance of magne-\ntospheric electrons on the edges of these events is consistent\nwith the satellite moving into an open LLBL, as is the ap-\npearance of sheath ions. This electron dispersion was also\nseen in the FTE event studied by Farrugia et al. (1988) and\nmodelled by Lockwood and Hapgood (1998). However, that\nevent also showed continuous dispersion of ions. The step-\nlike edges of the injected ion events reported here is also con-\nsistent with this model, provided the reconnection is pulsed\nand falls to zero between the pulses (Lockwood and Davis,\n1996). The two main difficulties with this interpretation are:\n(1) the maintenance of magnetospheric ions (but not elec-\ntrons) on the open field lines and (2) the slow convection\nvelocities of the flux tubes. Considering the former, Fig. 1c\nshows that some events display slight decreases in magne-\ntospheric ion fluxes; this is the clearest for the event around\n12:52. The theory of Cowley (1982) and modelling by Lock-\nwood (1997b) offers an explanation in terms of ions which\nare accelerated from the reflection off of the Alfve´nic distur-\nbances in the reconnection layer (open LLBL), in particular,\nthe external RD (Alfve´n wave), the magnetopause, and the\nfaster internal RD. Lockwood and Moen (1996) have used\nion reflection off the Alfve´n waves at an open magnetopause\nM. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1633\nto match the partial moments of LLBL and cusp ions, and\nLockwood (1997a) was able to reproduce the full spin angle\ndistributions. Lockwood and Hapgood (1998) used the the-\nory to match the moments and distributions of the ions seen\nwithin an FTE. Because there is no transient loss and then re-\ncovery of magnetospheric ions at the start of the events, there\nis no reason to invoke re-closure of opened field lines.\nThe remaining difficulty is that the field lines are moving\nat a velocity that is an order of magnitude slower than the\nsheath flow, which has been used as evidence for a closed\ntopology (Fujimoto et al., 1998). The presence of sub-\nAlfve´nic ions and electrons means that the field line motion\nwould have responded to the opening of the field lines. Thus,\nfor these field lines to be open, we must conclude that the\ntension force is counteracting the effect of the sheath flow\non the part of the field line that is outside the magnetopause,\nsuch that the field lines are hung up on the dusk flank of the\nmagnetosphere.\nTable 2 summarises the evidence concerning the key ques-\ntions of the magnetic topology of the field lines within the\ntransient LLBL events. It can be seen that there are prob-\nlems with either explanation. However, possibilities exist for\nexplaining all features for an open topology (or with opened\nand then re-closed), and this is not the case for a closed topol-\nogy.\nThe magnetic field measured by FGM in both the magne-\ntosheath and the boundary layer was of the order of 20 nT, but\nthe plasma density seen by CIS was of the order of, respec-\ntively, 107 m−3 and 2 × 105 m−3. Using the mean ion mass\nof 1.3 amu seen by CIS on both sides of the boundary (10%\nHe++ and 90% H+), we find that the exterior and interior\nmagnetopause Alfve´n waves propagated at a speed VA of the\norder of 120 km s−1 and 850 km s−1, respectively. Reflection\noff of these waves gives an acceleration of ions by up to 2VA\n(Cowley, 1982; Lockwood et al., 1996), which means the\npeak of the distribution function is shifted to 470 eV for pro-\ntons (1.88 keV for He++) for the exterior wave and 23.5 keV\n(0.94 MeV for He++) for the interior wave. Considering the\nhot tail of the initial field-parallel magnetospheric distribu-\ntion, it can be seen that reflection of the interior wave will\nreadily generate MeV ions in the LLBL and cusp on open\nfield lines, as well as maintaining fluxes of unaccelerated\nmagnetospheric ions on open field lines (Lockwood, 1997b).\nComparison of the CIS and PEACE spectrograms at the\nonset of the intersection with the cusp event (13:22–13:27)\nis identical to the onset of one of the clear-cut events shown\nin this paper (e.g. 11:18–11:23). The same is true for the\n(somewhat protracted) exit from the cusp event. The differ-\nence appears to be that in the cusp event, the satellite moves\nonto field lines that have been open long enough for all mag-\nnetospheric electrons to vanish and for the low energy ion\nelectron fluxes to rise to about half of the values in the lo-\ncal magnetosheath. Thus, we conclude that the cusp inter-\nsection event studied by Opgenoorth et al. (2001, this issue)\nis exactly the same, in principle, as the events studied here,\ni.e. newly-opened flux was formed by reconnection in the\nmorning sector and dragged eastward to the satellites in all\ncases. The only difference is that more open flux was formed\nin the cusp event than in these LLBL events and they con-\nvected further over the Cluster spacecraft so that they sam-\npled field lines of greater elapsed time since reconnection.\nIn the cusp event, as in the LLBL events presented here, an\nadditional propagation lag was required to match the IMF\nclock angle variations to the event. As for the events studied\nhere, ground-based data reveal that the lag was due to event\nformation in the pre-noon sector and propagation to the mid-\nafternoon location of the spacecraft.\nThe events take place during predominantly northward\nIMF and appear to be triggered by swings of the IMF towards\nthe ecliptic so that the IMF clock angle approaches 90◦ in\nGSM coordinates. However, the lag is 15–20 min longer than\nobserved both before and after the period of interest here.\nThe ground-based observations explain this additional delay\nbecause signatures in both the flows and in the 630 nm au-\nrora indicate that the events form in the pre-noon sector and\nmost of the additional delay is the time taken for the events to\npropagate eastward to the mid-afternoon sector. The speed of\nthe eastward phase motion seen by the ground-based instru-\nments (of the order of 1 km s−1) is consistent with the phase\nmotion of the event derived from multi-spacecraft studies us-\ning Cluster. The propagation of active segments of reconnec-\ntion X-lines away from noon was first inferred from EISCAT\nradar data by Lockwood et al. (1993) and sketched schemat-\nically by Lockwood (1994). Lockwood et al. (1995) used\nthis concept to show that FTEs can be responsible for the full\ntranspolar voltage. Recently, Milan et al. (2000) has found\nfurther evidence for this concept in HF coherent radar data\nand UV global images: it has also been used to explain multi-\ninstrument and multi-point data by McWilliams et al. (2001).\nThe occurrence of these events is consistent with the\nidea that “subsolar” reconnection (meaning the production\nof open field lines by the merging of closed field lines and\ndraped interplanetary field lines, which may take place away\nfrom the equatorial plane) persists when the IMF is north-\nward, at least as long as the IMF clock angle is greater than\nabout 45◦. The direction of motion of the event is in the\n−L direction (equatorward), whereas the local sheath flow is\nin the +L direction, suggesting the magnetic curvature force\nhas an equatorward component and that the reconnection site\nresponsible for the reconnection pulse was at high-latitudes.\nThe ESR observed poleward-moving events which are also\nthought to be reconnection pulse signatures. The lower oc-\ncurrence rate of events, compared to the earlier interval of\nsouthward IMF (Lockwood et al., 2001, this issue) is con-\nsistent with the triggering of the northward IMF events by\nswings of the IMF to a greater clock angle. The events were\nnot, in general, seen by the field-aligned ESR beam. For\nmuch of the period, this may be due to the fact that the beam\nwas equatorward of the open-closed boundary. However, this\nwas not the case during the pass of the DMSP-F15 satellite\njust after one of the events and not long after the northward\nturning. This revealed the ESR field-aligned beam to be on\nopen field lines. However, these were “old” open field lines\nfor which the magnetopause threading point was located a\n1634 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations\nTable 2. Summary of explanations of observed features of the LLBL events\nFeature Explanation for a closed topology Explanation for an open topology\n1. Appearance of magnetosheath ions No viable mechanism known Well explained as ions flowing out\nalong open field lines\n2. Loss of magnetospheric electrons Mechanism also unknown, but must act on Well explained as electrons flowing out\nopposite side of magnetopause to the along open field lines\nmechanism invoked to explain 1, yet be\nactive at the same time and place\n3. Sharp edges to sheath ion regions Not known Requires reconnection pulses\n4. Dispersed loss of electrons Not known Well explained by time-of-flight of\nescaping electrons\n5. Maintenance of magnetospheric ions Well explained Requires ion reflection off of magnetopause\nAlfve´n waves or a magnetic bottle\non open field lines\n6. Some weak loss of magnetospheric ions Not explained Requires only a weakening of\nin some events the mechanism invoked for 5.\n7. Low event phase velocity (and Consistent Requires geometry such that tension force\nsimilarly low field-perpendicular and sheath flow are close to being in balance\nplasma velocity within event)\n8. Balanced counterstreaming electrons Requires identical electron acceleration in Requires weak heating of entering sheath\nboth ionospheres (even if there is additional electrons at magnetopause (which then\nheating at the magnetopause) mirror at low altitudes)\n9. Correspondence with IMF clock angle Not explained Well explained as reconnection pulses\n10. No correspondence with solar wind Eliminates several suggested Consistent\npressure pulses mechanisms\n11. Ionospheric events Not explained Well explained as reconnection pulses\nconsiderable distance down the tail and hence, sheath pre-\ncipitation fluxes were low. The newer open field lines were\nseen as a region of higher sheath fluxes that were to the dusk\nside and not near noon. We can identify this patch of sheath\nplasma precipitation with one of the poleward-moving en-\nhancements seen by the low elevation ESR beam.\nGiven that these events are well understood as transient\nplasma injections caused by bursts of reconnection, the one\nmajor surprise is that there was no bipolar deflection in the\nfield seen by cluster, at least in most of the cases. This is the\nclassic characteristic used to define FTEs. However, it is im-\nportant to remember where these Cluster observations were\nmade. Most of the events were seen on southward-pointing\nfield lines, i.e. on the boundary of the interior magnetic cusp,\nhalf way between the magnetopause boundary layer and its\nprojection at middle altitudes. Only the last events, for which\nthe satellites were moving onto a northward pointing field,\nshowed indications of bipolar FTE field signatures. Even in\nthese cases, the bipolar signature was weak; however, we\nnote that BZ was still close to zero and thus, the satellites\nwere only just entering the exterior boundary layer. We con-\nclude that the bipolar FTE signatures are a feature only of the\nexterior boundary layer. They are not seen on the southward-\npointing field on the edges of the interior magnetic cusp (nor\nare they seen at middle altitudes).\nThe lack of a bipolar magnetic signature for the first\nevent studied here (at around 11:23) is due to the fact that\nthe event does not bulge out in response to increased pres-\nsure from within the event. The magnetic field magnitude\n(pressure) is of the order of 30 nT (0.36 nPa) in the event\ncentre and 24 nT (0.23 nPa) outside of it. Thus the field\npressure excess for this event is 1.3 nPa. Figure 9 shows\nthat the ion concentration, parallel temperature and perpen-\ndicular temperatures at the event centre are of the of or-\nder 6.31 × 105 m−3, 2.51 × 107 K and 3.16 × 106 K, re-\nspectively. The corresponding values outside the event are\n2.00 × 105 m−3, 6.31 × 107 K and 6.31 × 107 K. These\nnumbers yield a roughly isotropic ion pressure outside the\nevent of 0.17 nPa, but field-perpendicular and field-parallel\nion pressures of 0.03 Pa and 0.22 nPa inside it. Thus, the drop\nin field-perpendicular ion pressure was 0.14 nPa and there\nwas a slight rise in the field-parallel ion pressure of 0.05 nPa.\nFull pressure balance considerations (including the electron\ngas) will be made elsewhere, but we note that the increased\nmagnetic pressure in this event is comparable with the drop\nin the field-perpendicular ion pressure. Thus, these events\nare much closer to existing a pressure equilibrium than are\nthe FTEs on the exterior boundary: with this being the case,\na bipolar magnetic signature is not expected.\nThis can be contrasted with the event closer to the outer\nboundary around 12:50 (for which a bipolar magnetic FTE\nsignature was seen). In this event, the field magnitude rose\nM. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1635\nfrom 20 to 24 nT, giving a modest field pressure increase of\n0.04 nPa. The ion concentration variation was similar to the\n11:23 case, but the perpendicular temperature fell to only\n3×107 K, such that the field-perpendicular ion pressure rose\nfrom 0.17 nPa outside the event to 0.25 nPa inside it. Thus,\nboth the magnetic and ion pressures show an excess in this\nevent, which is consistent with the bipolar field signature and\nwith FTE events on the exterior magnetopause boundary.\nAcknowledgements. This paper is dedicated to the memory of three\nCluster-1 PIs, Alan Johnstone, Les Wooliscroft and Berend Wilken\nwho’s tireless work, skill, enthusiasm is remembered by all who\nknew them. We thank R. Bonnet and all ESA staff who ensured\nCluster finally made the first 3D measurements in space. The au-\nthors are also particularly grateful to Halvard Bohlm, who with\nAPvE, managed to reach and run the ESR radar on 14 January\n2001, despite very severe weather conditions on Svalbard. EIS-\nCAT is an Association of Seven member nations: France, Germany,\nSweden, Norway, Finland, UK and Japan and the authors are grate-\nful to the director and staff of EISCAT for the provision of the\nEISCAT research facilities. EISCAT, Cluster and CUTLASS are\nprojects which are funded in the UK by the Particle Physics and As-\ntronomy Research Council (PPARC) and MLo, AF, MAH, MNW,\nRS, MD, JAW, IWM, MT, AB, GP, SKM and MLe are grateful for\nPPARC support. The SuperDARN radars are supported by funds\nfrom the research agencies of Australia, Canada, Finland, France,\nItaly, Japan, Sweden, UK and the USA. Other authors also acknowl-\nedge support from national funding agencies: HJO, PE and FP by\nNFR, Sweden; JM by NF, Norway, MFM by PNRA, Italy; work\nby GL at HAO\/NCAR was supported by the NASA SEC Guest In-\nvestigator program; work at CESR was funded by CNES grants.\nThe MIRACLE network is operated as an international collabora-\ntion under the leadership of the Finnish Meteorological Institute.\nThe IMAGE magnetometer data are collected as a Finnish-German-\nNorwegian-Polish-Russian-Swedish project.\nTopical Editor G. Chanteur thanks A. Nishida and another ref-\neree for their help in evaluating this paper.\nReferences\nAkasofu, S. I., Hones, Jr., E. W., Bame, S. J., Ashbridge, J. R.,\nand Lui, A. T. Y.: Magnetotail and boundary layer plasma at\ngeocentric distance of 18RE , J. Geophys., Res., 78, 7257, 1973.\nAlem, F. and Delcourt, D. C.: Nonadiabatic precipitation of ions at\nthe cusp equatorward edge, J. Geophys. Res., 100, 19, 321, 1995.\nAnderson, B. J., Phan, T. D., and Fuselier, S. A.: Relationships be-\ntween plasma depletion and subsolar reconnection, J. Geophys.\nRes., 102, 9531–9542, 1997.\nAparicio, B., Thelin, B., and Lundin, R.: The polar cusp from a\nparticle point of view: A statistical model based on Viking data,\nJ. Geophys. Res., 14, 023, 1991.\nBerchem, J. and Russell, C. T.: Flux transfer events on the magne-\ntopause: Spatial distribution and controlling factors, J. Geophys.\nRes., 89, 6689–6703, 1984.\nBodokova, N. L., Zastenker, G. N., and Sibeck, D. G.: A case\nand statistical study of transient magnetic field events at geosyn-\nchronous orbit and their solar wind, J. Geophys. Res., 100, 5643–\n5656, 1995.\nBoyle, C. B., Reiff, P. H., and Hairston, M. R.: Empirical polar cap\npotentials, J. Geophys. Res., 102, 111–125, 1997.\nBurch, J. L.: Quasi-neutrality in the polar cusp, Geophys. Res. Lett.,\n12, 469–472, 1985.\nBurch, J. L., Reiff, P. H., and Sugiura, M.: Upward electron beams\nmeasured by DE-1: a primary source of dayside region 1 Birke-\nland currents, Geophys. Res. Lett., 10, 753–756, 1983.\nChandler, M. O., Fuselier, S. A., Lockwood, M., and Moore, T. E.:\nEvidence of component magnetic merging equatorward of the\ncusp , J. Geophys. Res., 104, 22 623–22 648, 1999.\nCollin, H. L., Sharp, R. D., and Shelley, E. G.: The occurrence\nand characteristics of electron beams over the polar regions, J.\nGeophys. Res., 87, 7504, 1982.\nCowley, S. W. H.: The causes of convection in the Earth’s magne-\ntosphere: A review of developments during IMS, Rev. Geophys.,\n20, 531–565, 1982.\nCowley, S. W. H.: Solar wind control of magnetospheric con-\nvection, in Achievements of the international magnetospheric\nstudy, IMS, pp 483–494, ESA SP-217, ESTEC, Noordwijk, The\nNetherlands, 1984.\nCowley, S. W. H. and Lewis, Z. V., Magnetic trapping of ener-\ngetic particles on open dayside boundary layer flux tubes, Planet.\nSpace Sci., 38, 1343, 1990.\nCowley, S. W. H., Freeman, M. P., Lockwood, M., and Smith, M.\nF.: The ionospheric signature of flux transfer events, in: “CLUS-\nTER – dayside polar cusp”, (Ed) Barron, C. I., ESA SP-330, Eu-\nropean Space Agency Publications, Nordvijk, The Netherlands,\n105–112, 1991.\nCrooker, N. U.: Reverse convection, J. Geophys. Res., 97, 19 363–\n19 372, 1992.\nDaly, P. W. and Fritz, T. A.: Trapped electron distributions on open\nfield lines, J. Geophys. Res., 87, 6081, 1982.\nDaly, P. W., Saunders, M. A., Rijnbeek, R. P., Sckopke, N., and\nRussell, C. T.: The distribution of reconnection geometry in flux\ntransfer events using energetic ion, plasma, and magnetic data, J.\nGeophys. Res., 89, 3843, 1984.\nDrakou, E., Sonnerup, B. U. ¨O., and Lotko, W.: Self-consistent\nsteady state model of the low-latitude boundary layer, J. Geo-\nphys. Res., 99, 2351–2364, 1994.\nEastman, T. E. and Hones, Jr., E. W., Characteristics of the mag-\nnetospheric boundary layer as observed by IMP-6, J. Geophys.\nRes., 84, 2109, 1979.\nEastman, T. E., Hones, Jr., E. W., Bame, S. J., and Ashbridge, J.\nR.: The magnetospheric boundary layer: Site of plasma, mo-\nmentum and energy transfer from the magnetosheath to the mag-\nnetosphere, Geophys. Res. Lett., 3, 685–688, 1976.\nElphic, R. C.: Observations of flux transfer events: Are FTEs flux\nropes, islands, or surface waves?, in: Physics of Magnetic Flux\nRopes, Geophys. Monogr. Ser., vol. 58, (Eds) Russell, C. T.,\nPreist, E. R., and Lee, L. C., AGU, Washington, D. C., pp. 455–\n472, 1990.\nElphic, R. C. and Southwood, D. J.: Simultaneous measurements\nof the magnetopause and flux transfer events at widely separated\nsites by AMPTE UKS and ISEE 1 and 2, J. Geophys. Res., 92,\n13, 666–672, 1987.\nElphic, R. C., Lockwood, M., Cowley, S. W. H., and Sandholt, P. E.:\nSignatures of flux transfer events at the dayside magnetopause\nand in the ionosphere: Combined ISEE, EISCAT and optical ob-\nservations, Geophys. Res. Lett., 17, 2241–2244, 1990.\nElphic, R. C., Baumjohann, W., Cattell, C. A., Lu¨hr, H., and Smith,\nM. F.: A search for upstream pressure pulses associated with flux\ntransfer events: An AMPTE\/ISEE case study, J. Geophys. Res.,\n99, 13, 521–527, 1994.\nFarrugia, C. J., et al.: A multi-instrument study of flux transfer event\n1636 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations\nstructure, J. Geophys. Res., 93, 14 465–14 477, 1988.\nFedorov, A., Budnik, E., Novrachev, M., Romanov, V., Song, P.,\nand Sauvaud, J.-A.: Plasma characteristics near the exterior cusp\nunder different orientations of the interplanetary magnetic field,\nCzech J. Phys., 49, 711–732, 1999.\nFreeman, M. P., Farrugia, C. J., Burlaga, L. F., Hairston, M. R.,\nGreenspan, M. E., Ruohoniemi, J. M., and Lepping, R. P.: The\ninteraction of a magnetic cloud with the earth: ionospheric con-\nvection in the northern and southern hemispheres for a wide\nrange of quasi-steady interplanetary magnetic field conditions,\nJ. Geophys. Res., 98, 7633–7655, 1993.\nFujimoto, M., Terasawa, T., Mukai, T., Saito, Y., Yamamoto, T.,\nand Kokubun, S.: Plasma entry into the flanks of the near-Earth\nmagnetotail: Geotail observations, J. Geophys. Res., 103, 4391–\n4408, 1998.\nFuselier, S. A., Klumpar, D. M., and Shelley, E. G.: Ion reflec-\ntion and transmission during reconnection at the Earth’s subsolar\nmagnetopause, Geophys. Res. Lett., 18, 139, 1991.\nFuselier, S. A., Klumpar, D. M., and Shelley, E. G.: Counter-\nstreaming magnetosheath ions in the dayside low latitude bound-\nary layer, Geophys. Res. Lett., 19, 425–428, 1992.\nFuselier, S., Anderson, B. J., and Onsager, T.G.: Electron and ion\nsignatures of field line topology at the low shear magnetopause,\nJ. Geophys. Res., 100, 11 805–11 814, 1995.\nFuselier, S. A., Lockwood, M., Onsager, T. G., and Peterson, W. K.:\nThe source population for the cusp and cleft\/LLBL for southward\nIMF, Geophys. Res. Lett., 26, 1665–1669, 1999.\nGaleev, A. A., Kuznetsova, M. M., and Zeleny, L. M.: Magne-\ntopause stability threshold for patchy reconnection, Space Sci\nRev., 44, 1–41, 1986.\nGosling, J. T., Thomsen, M. F., Bame, S. J., Elphic, R. C., and Rus-\nsell, C. T.: Plasma flow reversals at the dayside magnetopause\nand the origin of asymmetric polar cap convection, J. Geophys.\nRes., 95, 8073–8084, 1990a.\nGosling, J. T., Thomsen, M. F., Bame, S. J., Elphic, R. C., and\nRussell, C. T.: Cold ion beams in the low-latitude boundary layer\nduring accelerated flow events, Geophys. Res. Lett., 17, 2245–\n2248, 1990b.\nGosling, J. T., Thomsen, M. F., Bame, S. J., Onsager, T. G., and\nRussell, C. T.: The electron edge of the low-latitude boundary\nlayer during accelerated flow events, Geophys. Res. Lett., 17,\n1833–1836, 1990c.\nGosling, J. T., Thomsen, M. F., Bame, S. J., Elphic, R. C., and Rus-\nsell, C. T.: Observations of reconnection of interplanetary and\nlobe magnetic field lines at the latitude magnetopause, J. Geo-\nphys. Res., 96, 14 097–14 106, 1991.\nHaerendel, G., Paschmann, G., Sckopke, N., Rosenbauer, H., and\nHedgecock, P. C.: The frontside boundary layer of the magne-\ntopause and the problem of reconnection, J. Geophys. Res., 83,\n3195–3216, 1978.\nHall, D. S., Chanelor, C. P., Bryant, D. A., Lepine, D. R., and Tri-\ntakis, V. P.: Electrons in the boundary layers near the dayside\nmagnetopause, J. Geophys. Res., 96, 7869, 1991.\nHapgood, M. A. and Bryant, D. A.: Re-ordered electron data in the\nlow-latitude boundary layer, Geophys. Res. Lett. 17, 2043–2046,\n1990.\nHapgood, M. A. and Bryant, D. A.: Exploring the magnetospheric\nboundary layer, Planet. Space Sci., 40, 1431–1459, 1992.\nHapgood, M. A. and Lockwood, M.; On the voltage and distance\nacross the low latitude boundary layer, Geophys. Res. Lett., 20,\n145–148, 1993.\nHapgood, M. A. and Lockwood, M.: Rapid changes in LLBL thick-\nness, Geophys. Res. Lett., 22, 77–80, 1995.\nHeelis, R. A., Hanson, W. B., and Burch, J. L.: Ion convection\nreversals in the dayside cleft, J. Geophys. Res., 81, 3803, 1976.\nHeyn, M. F., Biernat, H. K., Rijnbeek, R. P., and Semenov, V. S.:\nThe structure of reconnection layers, J. Plasma Phys., 40, 2, 235–\n252, 1988.\nHill, T. W. and Reiff, P. H.: Evidence of magnetospheric cusp\nproton acceleration by magnetic merging at the dayside magne-\ntopause, J. Geophys. Res., 82, 3623, 1977.\nHones, Jr., E. W., Ashbridge, J. R., Bame, S. J., Montgomery, M.\nD., Singer, S., and Akasofu, S.-I.: Measurements of magneto-\ntail plasma flow made with Vela 4B, J. Geophys. Res., 77, 5503,\n1972.\nJohnstone, A. D., Rodgers, D. J., Coates, A. J., Smith, M. F., and\nSouthwood, D. J.: Ion acceleration during steady-state recon-\nnection at the dayside magnetopause, in: Ion acceleration in the\nmagnetosphere and ionosphere, (Ed) Chang, T., AGU Mono-\ngraph 38, 136–145, 1986.\nJørgensen, T. S., Friis-Christiansen, E., Wickwar, V. B., Kelly, J. D.,\nClauer, C. R., and Banks, P. M.: On the reversal from “sunward”\nto “antisunward” plasma convection in the dayside high latitude\nionosphere, Geophys. Res. Lett., I, 887–890, 1984.\nKarlson, K. A., Øieroset, M., Moen, J., and Sandholt, P. E.: A sta-\ntistical study of flux transfer event signatures in the dayside au-\nrora: the IMF By-related postnoon-prenoon asymmetry, J Geo-\nphys. Res., 101, 59–68, 1996.\nKawano, H. and Russell, C. T., Survey of flux transfer events ob-\nserved with the ISEE spacecraft: rotational polarity and the\nsource region, J. Geophys. Res., 101, 27 299–27 308, 1996.\nKawano, H. and Russell, C. T., Survey of flux transfer events ob-\nserved with the ISEE spacecraft: dependence on the interplane-\ntary magnetic field, J. Geophys. Res., 102, 11 307–11 313, 1997.\nKawano, H., Kokubun, S., and Takahashi, K.: Survey of transient\nmagnetic field events in the dayside magnetosphere, J. Geophys.\nRes., 97, 10, 677–692, 1992.\nKlumpar, D. M. and Heikkila, W. J.: Electrons in the ionospheric\nsource cone: evidence for runaway electrons as carriers of down-\nward Birkeland currents, Geophys. Res. Lett., 9, 873, 1992.\nKremser, G., Woch, J., Mursala, K., Tanskanen, P., Wilken, B., and\nLundin, R.: Origin of energetic ions in the polar cusp inferred\nfrom ion composition measurements by the Viking satellite, Ann.\nGeophysicae, 13, 595–607, 1995.\nKuo, H., Russell, C. T., and Le, G.: Statistical studies of flux trans-\nfer events, J. Geophys. Res., 100, 3513–3519, 1995.\nLevy, R., Petschek, H. E., and Siscoe, G. L.: Aerodynamic aspects\nof magnetospheric flow, AIAA J., 2, 2065, 1964.\nLin, Y. and Lee, L. C.: The structure of reconnection layers in the\nmagnetosphere, Space Sci. Rev., 65, 59–179, 1993.\nLockwood, M.: Flux transfer events at the dayside magnetopause:\nTransient reconnection or magnetosheath pressure pulses?, J.\nGeophys. Res., 96, 5497–5509, 1991.\nLockwood, M.: Ionospheric signatures of pulsed magnetopause re-\nconnection, in: “Physical signatures of magnetopause boundary\nlayer Processes”, (Eds) Holtet, J. A. and Egeland, A., NATO ASI\nSeries C, Vol. 425, Kluwer, 229–243, 1994.\nLockwood, M.: The location and characteristics of the reconnec-\ntion X-line deduced from low-altitude satellite and ground-based\nobservations, 1, Theory, J. Geophys. Res., 100, 21, 791, 1995.\nLockwood, M.: The relationship of dayside auroral precipitations\nto the open-closed separatrix and the pattern of convective flow,\nJ. Geophys. Res., 102, 17 475–17 487, 1997a.\nLockwood, M.: Energy and pitch angle dispersions of LLBL\/cusp\nM. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1637\nions seen at middle altitudes: predictions by the open magneto-\nsphere model, Ann. Geophysicae, 15, 1501–1511, 1997b.\nLockwood, M. and Davis, C. J.: On the longitudinal extent of mag-\nnetopause reconnection bursts, Ann. Geophysicae, 14, 865–878,\n1996.\nLockwood, M. and Hapgood, M. A.: How the Magnetopause Tran-\nsition Parameter Works, Geophys. Res. Lett., 24, 373–376, 1997.\nLockwood, M. and Hapgood, M. A.: On the Cause of a Magneto-\nspheric Flux Transfer Event, Geophys. Res., 103, 26 453–26 478,\n1998.\nLockwood, M. and Moen, J.: Ion populations on open field lines\nwithin the low-latitude boundary layer: theory and observations\nduring a dayside transient event, Geophys. Res. Lett., 23, 2895–\n2898, 1996.\nLockwood, M. and Moen, J.: Reconfiguration and closure of lobe\nflux by reconnection during northward IMF: evidence for sig-\nnatures in cusp\/cleft auroral emissions, Ann. Geophysicae, 17,\n996–1011, 1999.\nLockwood, M. and Smith, M. F.: The variation of reconnection rate\nat the dayside magnetopause and cusp ion precipitation, J. Geo-\nphys. Res., 97, 14, 841, 1992.\nLockwood, M. and Smith, M. F.: Comment on “Mapping the day-\nside ionosphere to the magnetosphere according to particle pre-\ncipitation characteristics” by Newell and Meng, Geophys. Res.\nLett., 20, 1739–1740, 1993.\nLockwood, M. and Smith, M. F.: Low and middle-altitude cusp\nparticle signatures for general magnetopause reconnection rate\nvariations, I, Theory, J. Geophys. Res., 99, 8531, 1994.\nLockwood, M., Moen, J., Cowley, S. W. H., Farmer, A. D.,\nLøvhaug, U. P., Lu¨hr, H., and Davda, V. N.: Variability of day-\nside convection and motions of the cusp\/cleft aurora, Geophys.\nRes. Lett., 20, 1011–1014, 1993.\nLockwood, M., Onsager, T. G., Davis, C. J., Smith, M. F., and\nDenig, W. F.: The characteristics of the magnetopause recon-\nnection X-line deduced from low-altitude satellite observations\nof cusp ions, Geophys. Res. Lett., 21, 2757–2760, 1994.\nLockwood, M., Cowley, S. W. H., Smith, M. F., Rijnbeek, R. P.,\nand Elphic, R. C.: The contribution of flux transfer events to\nconvection, Geophys. Res. Lett., 22, 1185–1188, 1995.\nLockwood, M., Cowley, S. W. H., and Onsager, T. G.: Ion accel-\neration at both the interior and exterior Alfve´n waves associated\nwith the magnetopause reconnection site: signatures in cusp pre-\ncipitation, J. Geophys. Res., 101, 21, 501, 1996.\nLockwood, M., Davis, C. J., Onsager, T. G., and Scudder, J. A.:\nModelling signatures of pulsed magnetopause reconnection in\ncusp ion dispersion signatures seen at middle altitudes, Geophys.\nRes. Lett., 25, 591–594, 1998.\nLockwood, M., Opgenoorth, H., van Eyken, A. P., Fazakerley, A.,\nBosqued, J.-M., Denig, W., Wild, J., Cully, C., Greenwald, R.,\nLu, G., Amm, O., Frey, H., Strømme, A., Prikryl, P., Hap-\ngood, M. A., Wild, M. N., Stamper, R., Taylor, M., McCrea,\nI., Kauristie, K., Pulkkinen, T., Pitout, F., Balogh, A., Dunlop,\nM., Re`me, H., Behlke, R., Hansen, T., Provan, G., Eglitis, P.,\nMorley, S. K., Alcayde´, D., Blelly, P.-L., Moen, J., Donovan,\nE., Engebretson, M., Lester, M., Waterman, J., and Marcucci,\nM. F.: Coordinated Cluster, ground-based instrumentation and\nlow-altitude satellite observations of transient poleward-moving\nevents in the ionosphere and in the tail lobe, Ann. Geophysicae,\nthis issue, 2001.\nLotko, W. and Sonnerup, B. U. Ø.: The low-latitude boundary layer\non closed field lines, in: Physics of the Magnetopause, Geophys.\nMonogr. Ser., vol. 90, (Eds) Song, P., Sonnerup, B. U. Ø., and\nThomsen, M., AGU Washington, D. C., pp. 371–383, 1995.\nLu, G., Richmond, A. D., Emery, B. A., Reiff, P. H., de la Beau-\njardiere, O., Rich, F. J., Denig, W. F., Kroehl, H. W., Lyons, L.\nR., Ruohoniemi, J. M., Friis-Christensen, E., Opgenoorth, H.,\nPersson, M. A. L., Lepping, R. P., Rodger, A. S., Hughes, T.,\nMcEwin, A., Dennis, S., Morris, R., Burns, G., and Tomlinson,\nL.: Interhemispheric asymmetry of the high-latitude ionospheric\nconvection pattern, J. Geophys. Res., 99, 6491–6510, 1994.\nLyons, L. R., Schulz, M., Pridmore-Brown, D. C., and Roeder, J.\nL.: Low-latitude boundary layer near noon: An open field line,\nJ. Geophys. Res., 99, 2227, 1994.\nManuel, J. R. and Samson, J. C.: The spatial development of the\nlow-latitude boundary layer, J. Geophys. Res., 98, 17, 367–385,\n1993.\nMcCrea, I. W., Lockwood, M., Moen, J., Pitout, F., Eglitis, P., and\nAylward, A. D.: ESR and EISCAT observations of the response\nof the cusp and cleft to IMF orientation changes, Ann. Geophys-\nicae, 18, 1009–1026, 2000.\nMcWilliams, K. A., Yeoman, T. K., and Provan, G.: A statistical\nsurvey of dayside pulsed ionospheric flows as seen by the CUT-\nLASS Finland HF radar, Ann. Geophysicae, 18, 445–453, 2000.\nMcWilliams, K. A., Yeoman, T. K., and Cowley, S. W. H.: Two-\ndimensional electric field measurement in the ionospheric foot-\nprint of a flux transfer event, 18, Ann. Geophysicae, 1584–1598,\n2001.\nMilan, S. E., Lester, M., Cowley, S. W. H., and Brittnacher, M.:\nConvection and auroral response to a southward turning of the\nIMF: Polar UVI, CUTLASS and IMAGE signatures of transient\nmagnetic flux transfer at the magnetopause, J. Geophys. Res.,\n105, 15, 741–757, 2000.\nMitchell, D. G., Kutchko, F., Williams, D. J., Eastman, T. E., Frank,\nL. A., and Russell, C. T.: An extended study of the low-latitude\nboundary layer on the dawn and the dusk flanks on the magneto-\nsphere, J. Geophys. Res., 92, 7394, 1987.\nMoen, J., Evans, D., Carlson, H. C., and Lockwood, M.: Dayside\nmoving auroral transients related to LLBL dynamics, Geophys.\nRes. Lett., 23, 3247–3250, 1996.\nMozer, F. S., Hayakawa, H., Kokubun, S., Nakamura, M., Okada,\nT., Yamamoto, T., and Truruda, K.: The morningside low-\nlatitude boundary layer as determined from electric and magnetic\nfield measurements on Geotail, Geophys. Res. Lett., 21, 2983–\n2986, 1994.\nNeudegg, D. A., Yeoman, T. K., Cowley, S. W. H., Provan, G.,\nHaerendel, G., Baumjohann, W., Auster, U., Fornacon, K.-H.,\nGeorgescu, E., and Owen, C. J., A flux transfer event observed\nat the magnetopause by the equator-S spacecraft and in the iono-\nsphere by the CUTLASS HF radar, Ann. Geophysicae, 17, 707–\n711, 1999.\nNewell, P. T. and Meng, C.-I.: The cusp and the cleft\/LLBL: Low\naltitude identification and statistical local time variation, J. Geo-\nphys. Res., 93, 14, 549, 1988.\nNewell, P. T. and Meng, C.-I.: On quantifying the distinctions be-\ntween the cusp and the cleft\/LLBL, in: Electromagnetic coupling\nin the polar clefts and caps NATO ASI Ser C, vol. 278, (Eds)\nSandholt, P. E. and Egeland, A., Kluwer Academic Publishers,\nDordrecht, pp. 87–101, 1989.\nNewell, P. T. and Meng, C.-I.: Mapping the dayside ionosphere to\nthe magnetosphere according to particle precipitation character-\nistics, Geophys. Res. Lett., 19, 609–612, 1992.\nNewell, P. T. and Meng, C.-I.: Reply, Geophys. Res. Lett., 20,\n1741–1742, 1993.\nNewell, P. T. and Meng, C.-I.: Ionospheric projections of magne-\n1638 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations\ntospheric regions under low and high solar wind pressure condi-\ntions, J. Geophys. Res., 99, 273, 1994a.\nNewell, P. T. and Meng, C.-I.: Comment on “Unexpected fea-\ntures of the ion precipitation in the so-called cleft\/low latitude\nboundary layer region: Association with sunward convection\nand occurrence on open field lines” by Nishida, A., Mukai, T.,\nHayakawa, H., Matsuoka, A., Tsuruda, K., Kaya, N., and Fuku-\nnishi, H., J. Geophys. Res., 99, 19, 609, 1994b.\nNewell, P. T. and Meng, C.-I.: Open and closed low-latitude bound-\nary layer, in: “Polar Cap Boundary Phenomena”, (Eds) Moen, J.,\nEgeland, A., and Lockwood, M., NATO ASI Series C, Kluwer,\n1997.\nNewell, P. T., Burke, W. J., Sanchez, E. R., Meng, C.-I., Greenspan,\nM. E., and Clauer, C. R.: The low-latitude boundary and the\nboundary plasma sheet at low altitude: Prenoon precipitation re-\ngions and convection reversal boundaries, J. Geophys. Res., 96,\n21, 013, 1991.\nNishida, A.: Can random reconnection on the magnetopause pro-\nduce the low-latitude boundary layer?, Geophys. Res. Lett., 16,\n227–230, 1989.\nNishida, A. and Mukai, T.: Reply to comment on “Unexpected fea-\ntures of the ion precipitation in the so-called cleft\/low-latitude\nboundary layer region” by Nishida, A., et al., J. Geophys. Res.,\n99, 23, 367, 1994.\nNishida, A., Mukai, T., Hayakawa, H., Matsuoka, A., and Tsuruda,\nK.: Unexpected features of the ion precipitation in the so-called\ncleft\/low-latitude boundary layer region: Association with sun-\nward convection and occurrence on open field lines, J. Geophys.\nRes., 98, 11, 161, 1993.\nNishida, A., Mukai, T., Yamamoto, T., Kokubun, S., and Maezawa,\nK.: A Unified model of the magnetotail convection in geomag-\nnetically quiet and active times, J. Geophys. Res., 103, 4409–\n4418, 1998.\nOgilvie, K., Fitzenreiter, R. J., and Scudder, J. D.: Observations of\nelectron beams in the low-latitude boundary layer, J. Geophys.\nRes., 89, 10 723, 1984.\nOnsager, T. G.: A quantitative model of magnetosheath plasma in\nthe low-latitude boundary layer, cusp and mantle, in: “Physi-\ncal signatures of magnetopause boundary layer Processes”, (Eds)\nHoltet, J. A. and Egeland, A. NATO ASI Series C, Vol. 425,\nKluwer, pp. 385–400, 1994.\nOnsager, T. G. and Fuselier, S. A.: The location of the magne-\ntopause reconnection for northward and southward interplane-\ntary magnetic field, in: Solar System Plasmas in Space and Time,\nGeophys. Mono. Ser., vol. 84, (Eds) Burch, J. L. and Waite, Jr.,\nJ. H., AGU, Washington D. C., pp. 183–197, 1994.\nOnsager, T. G., Scudder, J. D., and Lockwood, M.: High-latitude\nparticle precipitation and its relationship to magnetospheric\nsource regions, Space Sci. Rev., 80, 77–107, 1997.\nOnsager, T. G., Kletzing, C. A., Austin, J. B., and MacKiernan, H.:\nModel of magnetosheath plasma in the magnetosphere: Cusp and\nmantle precipitations at low altitudes, Geophys. Res. Lett., 20,\n479–482, 1993.\nOpgennoorth, H. J., Lockwood, M., Alcayde´, D., et al., coordinated\nground-based, low altitude satellite and Cluster observations on\nglobal and local scales, during a transient postnoon sector excur-\nsion of the magnetospheric cusp, Ann. Geophysicae, this issue,\n2001.\nOwen, C. J. and Cowley, S. W. H.: Heikkila’s mechanism for\nimpulsive plasma transport through the magnetopause: A re-\nexamination, J. Geophys. Res., 96, 5565–5574, 1991.\nOwen, C. J. and Slavin, J. A.: Viscously driven plasma flows in\nthe deep geomagnetic tail, Geophys. Res. Lett., 19, 1443–1446,\n1992.\nPaschmann, G., Sonnerup, B. U. ¨O., Papamastorakis, I., Sckopke,\nN., Haerendel, G., Bame, S. J., Asbridge, J. R., Gosling, J. T.,\nRussell, C. T., and Elphic, R. C.: Plasma acceleration at the\nEarth’s magnetopause: Evidence for reconnection, Nature, 282,\n243–246, 1979.\nPaschmann, G., Papamastorakis, I., Baumjohann, W., Sckopke, N.,\nCarlson, C. W., Sonnerup, B. U. ¨O., and Lu¨hr, H.: The magne-\ntopause for large magnetic shear: AMPTE\/IRM observations, J.\nGeophys. Res., 91, 11 099–11 115, 1986.\nPaschmann, G., Sonnerup, B. U. ¨O., Papamastorakis, I., Baumjo-\nhann, W., Sckopke, N., and Lu¨hr, H.: The magnetopause and\nboundary layer for small magnetic shear: convection electric\nfields and reconnection, Geophys. Res. Lett., 17, 1829–1832,\n1990.\nPhan, T. D., et al.: Low-latitude flank magnetosheath, magne-\ntopause and boundary layer for low magnetic shear: Wind ob-\nservations, J. Geophys. Res., 102, 19, 883–895, 1997.\nReiff, P. H. and Luhmann, J. G.: Solar wind control of the polar\ncap voltage, in: “Solar Wind-Magnetosphere Coupling”, (Eds)\nKamide, Y. and Slavin, J. A., Terra Scientifica, Tokyo, p. 453,\n1986.\nReiff, P. H., Hill, T. W., and Burch, J. L.: Solar wind plasma injec-\ntion at the dayside magnetospheric cusp, J. Geophys. Res., 82,\n479, 1977.\nRichard, R. L., Walker, R. J., and Ashour-Abdalla, M.: The popu-\nlation of the magnetosphere by solar wind ions when the inter-\nplanetary magnetic field is northward, Geophys. Res. Lett., 21,\n2455–2458, 1994.\nRijnbeek, R. P., Cowley, S. W. H., Southwood, D. J., and Russell, C.\nT.: A survey of dayside flux transfer events observed by the ISEE\n1 and 2 magnetometers, J. Geophys. Res., 89, 786–800, 1984.\nRijnbeek, R. P., Farrugia, C. J., Southwood, D. J., Dunlop, M. W.,\nMier-Jedrejowicz, W. A. C., Chaloner, C. P., Hall, D. S., and\nSmith, M. F.: A magnetic boundary signature within flux transfer\nevents, Planet. Space Sci., 35, 871–878, 1987.\nRosenbauer, H., Gru¨nwaldt, H., Montgomery, M. D., Paschmann,\nG., and Sckopke, N.: HEOS 2 plasma observations in the distant\npolar magnetosphere: The plasma mantle, J. Geophys. Res., 80,\n2723–2737, 1975.\nRuohoniemi, J. M., Greenwald, R. A., Baker, K. B., Villain,\nJ.-P., Hanuise, C., and Kelley, J. D.: Mapping high latitude\nplasma convection with coherent HF radars, J. Geophys. Res.,\n94, 13 463, 1989.\nRussell, C. T. and Elphic, R. C.: Initial ISEE magnetometer results:\nMagnetopause observations, Space Sci. Rev., 22, 681–715, 1978.\nRussell, C. T. and Elphic, R. C.: ISEE observations of flux transfer\nevents at the dayside magnetopause, Geophys. Res. Lett., 6, 33–\n36, 1979.\nSandholt, P. E., Farrugia, C. J., Øieroset, M., Stauning, P., and Cow-\nley, S. W. H.: Auroral signature of lobe reconnection, Geophys.\nRes. Lett., 23, 1725–1728, 1996.\nSandholt, P. E., Farrugia, C. J., Moen, J., and Lybekk, B.: The\ndayside aurora and its regulation by the interplanetary magnetic\nfield, in: “Polar Cap Boundary Phenomena”, (Eds) Moen, J.,\nEgeland, A., and Lockwood, M., NATO ASI Series C, Vol. 509,\nKluwer, Dordrecht, pp. 189–208, 1998.\nSandholt, P. E., Farrugia, C. J., Moen, J., and Cowley, S. W.\nH.: Dayside auroral configurations: responses to southward and\nnorthward rotations of the interplanetary magnetic field, J. Geo-\nphys. Res., in press, 1999.\nM. Lockwood et al.: Coordinated Cluster and ground-based instrument observations 1639\nSanny, J., Sibeck, D. G., Venturini, C. C., and Russell, C. T.: A\nstatistical study of transient events in the outer dayside magneto-\nsphere, J. Geophys. Res., 101, 4939–4952, 1996.\nSaunders, M. A.: Recent ISEE observations of the magnetopause\nand low-latitude boundary layer: A review, J. Geophys., 52, 190–\n198, 1983.\nSaunders, M. A., Russell, C. T., and Sckopke, N.: A dual-satellite\nstudy of spatial properties of FTEs, in: Magnetic Reconnection\nin Space and Laboratory Plasmas, Geophys. Monogr. Ser., vol.\n30, (Ed) Hones, Jr., E. W., AGU, Washington, D. C., pp. 145–\n152, 1984a.\nSaunders, M. A., Russell, C. T., and Sckopke, N.: Flux transfer\nevents, scale size and interior structure, Geophys. Res. Lett., 11,\n131–134, 1984b.\nSavin, S. P., Balan, O., Borodkova, N., Budnik, E., Nikolaeva, N.,\nProkhorenko, V., Pulkkinen, T., Rybjeva, N., Safrankova, J., San-\ndahl, I., Amata, E., Auster, U., Bellucci, G., Blagau, A., Blecki,\nJ., Buechner, J., Ciobanu, M., Dubinin, E., Yermolaev, Yu.,\nEchim, M., Fedorov, A., Formisano, V., Grard, R., Ivchenko, V.,\nJiricek, F., Juchniewicz, J., Klimov, S., Korepanov, V., Koskinen,\nH., Kudela, K., Lundin, R., Lutsenko, V., Marghitu, O., Neme-\ncek, Z., Nikutowski, B., Nozdrachev, M., Orsini, S., Parrot, M.,\nPetrukovich, A., Pissarenko, N., Romanov, S., Rauch, J., Rusten-\nbach, J., Sauvaud, J. A., Sarris, E. T., Skalsky, A., Smilauer, J.,\nTriska, P., Trotignon, J. G., Vojta, J., Zastenker, G., Zelenyi, L.,\nAgafonov, Yu., Grushin, V., Khrapchenkov, V., Prech, L., and\nSantolik, O.: Interball Magnetotail boundary case studies, Adv.\nSpace Res., 20, 4\/5, 999–1015, 1997.\nScholer, M.: Magnetic flux transfer at the magnetopause based on\nsingle X-line bursty reconnection, Geophys. Res. Lett., 15, 291–\n294, 1988a.\nScholer, M.: Strong core magnetic fields in magnetopause flux\ntransfer events, Geophys. Res. Lett., 15, 748–751, 1988b.\nScholer, M.: Asymmetric time-dependent and stationary magnetic\nreconnection at the dayside magnetopause, J. Geophys. Res., 94,\n15, 099–111, 1989.\nScholer, M., Daly, P. W., Paschmann, G., and Fritz, T. A.: Field\nline topology determined by energetic particles during a possible\nmagnetopause reconnection event, J. Geophys. Res., 87, 6073,\n1982a.\nScholer, M., Hovestadt, D., Ipavich, F. M., and Gloeckler, G.: En-\nergetic protons, alpha particles and electrons in magnetic flux\ntransfer events, J. Geophys. Res., 87, 2169, 1982b.\nSemenov, V. S., Kubyshkin, I. V., Biernat, H. K., Heyn, M. F., Rijn-\nbeek, R. P., Besser, B. P., and Farrugia, C. J.: Flux transfer events\ninterpreted in terms of a generalized model for Petschek-type re-\nconnection, Adv. Space Res., 11, 9, 25–28, 1991.\nSemenov, V. S., Lebedeva, V. V., Biernat, H. K., Heyn, M. F., Ri-\njnbeek, R. P., and Farrugia, C. J.: Time-varying reconnection:\nImplications for magnetopause reconnection, J. Geophys. Res.,\n100, 21, 779–789, 1995.\nSharp, R. D., Shelley, E. G., Johnstone, R. G., and Ghielmetti, A.\nG.: Counter-streaming electron beams at∼ 1RE over the auroral\nzone, J. Geophys. Res., 85, 92, 1980.\nShue, J.-H., Chao, J. K., Fu, H. C., Russell, C. T., Song, P., Kurana,\nK. K., and Singer, H. J.: A new functional form to study the solar\nwind control of the magnetopause size and shape, J. Geophys.\nRes., 102, 9497, 1997.\nSibeck, D. G.: A model for the transient magnetospheric response\nto sudden solar wind dynamic pressure variations, J. Geophys.\nRes., 95, 3755–3771, 1990.\nSibeck, D. G.: Transient events in the outer magnetosphere: Bound-\nary waves or flux transfer events?, J. Geophys. Res., 97, 4009–\n4026, 1992.\nSibeck, D. G. and Newell, P. T.: Pressure-pulse driven surface\nwaves at the magnetopause: a rebuttal, J. Geophys. Res., 100,\n21, 773–778, 1995.\nSibeck, D. G., Paschmann, G., Treumann, R. A., Fuselier, S. A.,\nLennartsson, W., Lockwood, M., Lundin, R., Ogilvie, K. W.,\nOnsager, T. G., Phan, T.-D., Roth, M., Scholer, M., Sckopke, N.,\nStasiewicz, K., and Yamauchi, M.: Plasma transfer processes at\nthe magnetopause, Space Science Reviews, 88, 207–283, 1999.\nSckopke, N.: Plasma structure near the low-latitude boundary layer:\na rebuttal, J. Geophys. Res., 96, 9815–9820, 1991.\nSckopke, N., Paschmann, G., Haerendel, G., Sonnerup, B. U. ¨O.,\nBame, S. J., Forbes, T. G., Hones, Jr., E. W., and Russell, C. T.:\nStructure of the low-latitude boundary layer, J. Geophys. Res.,\n86, 2099–2110, 1981.\nSmith, M. F. and Rodgers, D. J.: Ion distributions at the dayside\nmagnetopause, J. Geophys. Res., 95, 11 617–11 624, 1991.\nSmith, M. F. and Owen, C. J.: Temperature anisotropies in a mag-\nnetospheric FTE, Geophys. Res. Lett., 19, 1907–1910, 1992.\nSong, P. and Russell, C. T.: Model of the formation of the low-\nlatitude boundary layer for strongly northward interplanetary\nmagnetic field, J. Geophys. Res., 97, 1411, 1992.\nSong, P., Elphic, R. C., Russell, C. T., Gosling, J. T., and Cattell,\nC. A.: Structure and properties of the subsolar magnetopause for\nnorthward IMF: ISEE observations, J. Geophys. Res., 95, 6375,\n1990.\nSong, P., Le, G., and Russell, C. T.: Observational differences\nbetween flux transfer events and surface waves at the magne-\ntopause, J. Geophys. Res., 99, 2309–2320, 1994.\nSong, P., Holzer, T. E., Russell, C. T., and Wang, Z.: Modelling the\nlow-latitude boundary layer with reconnection entry, Geophys.\nRes. Lett., 21, 625–628, 1994.\nSonnerup, B. U. ¨O.: Theory of the low-latitude boundary layer, J.\nGeophys. Res., 85, 2017, 1980.\nSonnerup, B. U. ¨O., Paschmann, G., Papamastorakis, I., Sckopke,\nN., Haerendel, G., Bame, S. J., Ashbridge, J. R., Gosling, J. T.,\nand Russell, C. T.: Evidence for magnetic field reconnection at\nthe Earth’s magnetopause, J. Geophys. Res., 86, 10 049–10 067,\n1981.\nSonnerup, B. U. ¨O., Papamastorakis, I., Paschmann, G., and Lu¨hr,\nH.: The magnetopause for large magnetic shear: analysis of con-\nvection electric fields from AMPTE\/IRM, J. Geophys. Res., 95,\n10 541–10 557, 1986.\nSouthwood, D. J., Saunders, M. A., Dunlop, M. W., Mier-\nJedrzejowicz, W. A. C., and Rijnbeek, R. P.: A survey of\nflux transfer events recorded by UKS spacecraft magnetometer,\nPlanet. Space Sci., 34, 1349–1359, 1986.\nSouthwood, D. J., Farrugia, C. J., and Saunders, M. A.: What are\nflux transfer events?, Planet. Space Sci., 36, 503–508, 1988.\nSpreiter, J. R., Summers, A. L., and Alksne, A. Y.: Hydromagnetic\nflow around the magnetosphere, Planet. Space Sci., 14, 223–253,\n1966.\nTakahashi, K., Sibeck, D. G., Newell, P. T., and Spence, H. E.: ULF\nwaves in the low-latitude boundary layer and their relationship\nwith magnetospheric pulsations: a multi-satellite observation, J.\nGeophys. Res., 96, 9503–9519, 1991.\nThompsen, M., Stansberry, J. A., Barne, S. J., Fuselier, S. A., and\nGosling, J. T.: Ion and electron velocity distributions within flux\ntransfer events, J. Geophys. Res., 92, 12, 127, 1987.\nTraver, D. P., Mitchell, D. G., Williams, D. J., Frank, L. A., and\nHuang, C. Y.: Two encounters with the flank low-latitude bound-\n1640 M. Lockwood et al.: Coordinated Cluster and ground-based instrument observations\nary layer: further evidence for closed field topology and inves-\ntigation of the internal structure, J. Geophys. Res., 96, 21, 025–\n035, 1991.\nTreumann, R. A., La Belle, J., and Pottelette, R.: Plasma diffusion\nat the magnetopause: the case of lower hybrid drift waves, J.\nGeophys. Res., 96, 16 009–16 013, 1991.\nTreumann, R. A., LaBelle, J., and Bauer, T. M.: Diffusion pro-\ncesses: an observational perspective, in: Physics of the magne-\ntopause, Geophys. Mono. 90, (Eds) Song, P., Sonnerup, B. U. ¨O.,\nand Thompsen, M., pp. 331–341, 1995.\nVasyliunas, V. M.: Interaction between the magnetospheric bound-\nary layers and the ionosphere, in: Proceedings of the Magne-\ntospheric Boundary Layers Conference, Alpbach, Eur. Space\nAgency Spec Publ., ESA SP-148, 387–394, 1979.\nWilliams, D. J., Mitchell, D. G., Eastman, T. E., and Frank, L.\nA.: Energetic particle observations in the low-latitude boundary\nlayer, J. Geophys. Res., 92, 5097, 1978.\nWild, J. A., Cowley, S. W. H., Davies, J. A., Khan, H., Lester, M.,\nMilan, S. E., Provan, G., Yeoman, T. K., Balogh, A., Dunlop,\nM. W., Fornacon, K.-H., and Georgescu, E.: First simultaneous\noberservations of flux transfer events at the high-latitude magne-\ntopause by the Cluster spacecraft and pulsed radar signatures in\nthe conjugate ionosphere by the CUTLASS and EISCAT radars,\nAnn. Geophysicae, this issue, 2001.\nWilken, B., Daly, P. W., Mall, U., et al., First results from the\nRAPID Imaging Energetic Particle Spectrometer, Ann. Geophys-\nicae, this issue, 2001.\nWing, S., Newell, P. T., and Onsager, T. G.: Modelling the entry\nof the magnetosheath electrons into the dayside ionosphere, J.\nGeophys. Res., 101, 13 155–13 168, 1996.\nWinske, D., Thomas, V. A., and Omidi, N.: Diffusion at the mag-\nnetopause: A theoretical perspective, in: Physics of the Mag-\nnetopause, Geophys. Monogr Ser., vol. 90, (Eds) Song, P., Son-\nnerup, B. U. ¨O., and Thomsen, M. F., AGU, Washington, D.C.,\npp. 321–330, 1995.\nWoch, J. and Lundin, R.: The low-latitude boundary layer at mid-\naltitudes: Identification based on Viking hot plasma data, Geo-\nphys. Res. Lett., 20, 979–982, 1993.\nWoch, J., Yamauchi, M., Lundin, R., Potemra, T. A., and Zanetti,\nL. J.: The low-latitude boundary layer at mid-altitudes: relation\nto large-scale Birkeland currents, Geophys. Res. Lett., 20, 2251–\n2254, 1993.\nWoch, J., Lundin, R., Potemra, T. E., and Shapshak, M.: The pro-\njection of the magnetospheric boundary layers to mid-altitudes,\n(Eds) Holtet, J. A. and Egeland, A., Physical Signatures of\nMagnetospheric Boundary Layer Processes, Kluwer, pp. 83–97,\n1994.\nXu, D., Kivelson, M. G., Walker, R. J., Newell, P. T., and Meng,\nC.-I.: Interplanetary magnetic field control of mantle precipita-\ntion and associated field-aligned currents, J. Geophys. Res., 100,\n1837–1846, 1995.\n"}