{"doi":"10.1103\/PhysRevLett.96.132003","coreId":"100645","oai":"oai:epubs.surrey.ac.uk:40","identifiers":["oai:epubs.surrey.ac.uk:40","10.1103\/PhysRevLett.96.132003"],"title":"Evidence for nucleon-resonance excitation in omega-meson photoproduction.","authors":["Ajaka, J.","Assafiri, Y.","Bouchigny, S.","Didelez, J. P.","Fichen, L.","Guidal, M.","Hourany, E.","Kouznetsov, V.","Kunne, R.","Mushkarenkov, A. N.","Nedorezov, V.","Rudnev, N.","Turinge, A.","Zhao, Q."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-04-07","abstract":"<p>The photoproduction of the omega meson has been studied at GRAAL from threshold up to a photon energy of 1.5 GeV. The differential cross sections and beam asymmetries have been measured precisely at all angles. The total cross section is also obtained. Systematic enhancements of the differential cross section at large angles and nonzero beam asymmetries at intermediate angles provide clear evidence for <i>s<\/i>- and <i>u<\/i>-channel resonant processes. The data are compared to the results of hadron and quark models.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:40<\/identifier><datestamp>\n      2017-10-31T13:56:25Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/40\/<\/dc:relation><dc:title>\n        Evidence for nucleon-resonance excitation in omega-meson photoproduction.<\/dc:title><dc:creator>\n        Ajaka, J.<\/dc:creator><dc:creator>\n        Assafiri, Y.<\/dc:creator><dc:creator>\n        Bouchigny, S.<\/dc:creator><dc:creator>\n        Didelez, J. P.<\/dc:creator><dc:creator>\n        Fichen, L.<\/dc:creator><dc:creator>\n        Guidal, M.<\/dc:creator><dc:creator>\n        Hourany, E.<\/dc:creator><dc:creator>\n        Kouznetsov, V.<\/dc:creator><dc:creator>\n        Kunne, R.<\/dc:creator><dc:creator>\n        Mushkarenkov, A. N.<\/dc:creator><dc:creator>\n        Nedorezov, V.<\/dc:creator><dc:creator>\n        Rudnev, N.<\/dc:creator><dc:creator>\n        Turinge, A.<\/dc:creator><dc:creator>\n        Zhao, Q.<\/dc:creator><dc:description>\n        <p>The photoproduction of the omega meson has been studied at GRAAL from threshold up to a photon energy of 1.5 GeV. The differential cross sections and beam asymmetries have been measured precisely at all angles. The total cross section is also obtained. Systematic enhancements of the differential cross section at large angles and nonzero beam asymmetries at intermediate angles provide clear evidence for <i>s<\/i>- and <i>u<\/i>-channel resonant processes. The data are compared to the results of hadron and quark models.<\/p><\/dc:description><dc:date>\n        2006-04-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/40\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Ajaka, J., Assafiri, Y., Bouchigny, S., Didelez, J. P., Fichen, L., Guidal, M., Hourany, E., Kouznetsov, V., Kunne, R., Mushkarenkov, A. N., Nedorezov, V., Rudnev, N., Turinge, A. and Zhao, Q.  (2006) Evidence for nucleon-resonance excitation in omega-meson photoproduction.   Physical Review Letters, 96 (132003).       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevLett.96.132003<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/40\/","10.1103\/PhysRevLett.96.132003"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"PRL 96, 132003 (2006) P H Y S I C A L R E V I E W L E T T E R S week ending7 APRIL 2006Evidence for Nucleon-Resonance Excitation in!-Meson Photoproduction\nJ. Ajaka,1 Y. Assafiri,1 S. Bouchigny,1 J. P. Didelez,1 L. Fichen,1 M. Guidal,1 E. Hourany,1,* V. Kouznetsov,2 R. Kunne,1\nA. N. Mushkarenkov,2 V. Nedorezov,2 N. Rudnev,2 A. Turinge,3 and Q. Zhao1,4\n1IN2P3, Institut de Physique Nucle´aire, 91406 Orsay, France\n2Institute for Nuclear Research, 60th October Anniversary Prospect 7a, 117 312 Moscow, Russia\n3I. Kurchatov Institute of Atomic Energy, Kurchatov Square Bldg. 1, 123182, Moscow, Russia\n4Department of Physics, University of Surrey, Guildford GU2 7XH, United Kingdom\n(Received 24 January 2006; published 7 April 2006)0031-9007=The photoproduction of the ! meson has been studied at GRAAL from threshold up to a photon energy\nof 1.5 GeV. The differential cross sections and beam asymmetries have been measured precisely at all\nangles. The total cross section is also obtained. Systematic enhancements of the differential cross section\nat large angles and nonzero beam asymmetries at intermediate angles provide clear evidence for s- and\nu-channel resonant processes. The data are compared to the results of hadron and quark models.\nDOI: 10.1103\/PhysRevLett.96.132003 PACS numbers: 13.60.Le, 13.88.+e, 14.40.CsThe quark model predicts a large number of nucleon\nresonances which have not yet been observed [1]. Since the\nmost used reaction for their study was pion-nucleon scat-\ntering, one could infer that these so-called ‘‘missing reso-\nnances’’ may couple weakly to this channel. In this Letter\nwe report on the study of the nucleon resonances via !\nmeson photoproduction on the proton. This channel is in-\nteresting for several reasons. First, there is no nucleon reso-\nnance well-established decaying by ! emission. Second,\nthe threshold of ! photoproduction lies in the third reso-\nnance region, which is less explored than the first two.\nThird, from the sparse data in the literature [2– 4] and a\nnew generation experiment [5], evidence for resonance\nexcitations in \u0001p ! !p is still not obvious. Because of\nthe t-channel dominance at forward angles, a backward\nangle measurement is needed to pin down decisive signals\nfor resonance excitations. Since the ! meson has isospin\nzero, only the isospin-1=2 nucleon resonances can couple\nto the !N channel. This simplifies the interpretation of the\ndata because there is no contribution from isospin-3=2\nresonances. Also, we can measure \u0001 beam asymmetries\nand it is known that polarization observables are generated\nby interference terms and can therefore reveal small con-\ntributions. Finally, theoretical models are available for the\ninterpretation of the results [6–11].\nAt GRAAL, a tagged and linearly polarized photon\nbeam is available to study ! production from threshold\n(1.1 GeV) up to 1.5 GeV [12]. The beam is produced by\nbackscattering a laser beam on the electron beam\n(6.04 GeV and 200 mA) in the European Synchrotron\nRadiation Facility (ESRF) ring. A UV line of the laser is\nused, which produces a photon beam with a flat energy\nspectrum from 0.6 up to 1.5 GeV. The beam is linearly\npolarized with a rate P, deduced from QED calculation,\nranging from 86% at threshold to 98% at the maximum\nenergy. The large acceptance detector allows the detection\nof the ! meson by its main decays into \u0002\u0001\u0002\u0002\u00020 and \u00020\u0001\nwith branching ratios of 89.1% and 8.7%, respectively. In06=96(13)=132003(4)$23.00 13200the central part of the detector, for 25 \u0003 \u0003 \u0003 155 degrees,\na barrel of 32 scintillators provides a veto for a bismuth\ngermanate (BGO) ball calorimeter of 32 sectors and\n15 crowns. In the frontal part, for 1 \u0003 \u0003 \u0003 25 degrees,\nthere is a double wall of scintillators backed by a lead-\nscintillator shower wall [12]. A liquid hydrogen target of\n6 cm is used.\nIn the analysis of \u0001p ! p! with ! ! \u00020\u0001, three pho-\ntons are requested in the BGO ball and one charged particle\nin the central or the forward part. For \u0001p ! p! with ! !\n\u0002\u0001\u0002\u0002\u00020, two photons are requested in the BGO ball and\nthree charged particles in the central or the forward part,\nwith at least one charged particle detected in the central\npart. The detection of photons is restricted to the BGO ball\nin order to take advantage of its energy resolution ( \u0003 3%)\n[13] in the detection of electromagnetic showers, which is\nmuch better than the resolution of the forward shower wall\n[14]. For the ! three pion decay all the phase space is\nexplored and the branching ratio is high. This channel is\ntherefore preferred for the quantitative study, while the\ndecay into \u00020\u0001 is analyzed for consistency and checking.\nConcerning the identification of the \u0001p ! p! with\n! ! \u0002\u0001\u0002\u0002\u00020, for each event the four energy and mo-\nmentum conservation laws were used. In these equations\nthe known quantities are the direction and energy of the\nincident photon given by the tagging system and of the\n\u00020-meson reconstructed from the BGO calorimeter. The \u0003\nand \u0004 angles of the proton and the 2 charged pions are also\nknown from the cellular geometry of the detector. Solving\n3 out of the 4 equations, one deduces the magnitude of the\nmomenta p of the 3 charged particles. By combining for\neach particle the deduced p and the measured \u0002E from the\nbarrel or the time of flight (TOF) from the double wall, and\nlooking at the location in a calibrated bidimensional\n(\u0002E\u0004 p) or (TOF\u0004 p) plot, the type of particle can be\nidentified. The fourth equation is used to determine the best\nvertex position along the axis of the target, which improves\nthe determination of the \u0003-angles of the particles detected3-1 © 2006 The American Physical Society\n010\n20\n30\n1.136-1.174 1.174-1.211\n0\n10\n20\ndσ\n\/d(\n|t|) \n (µb\n\/G\neV\n2 ) 1.211-1.246 1.246-1.281\n0\n10\n20\n1.281-1.316 1.316-1.349\n0\n10\n20\n1.349-1.384 1.384-1.418\n0\n10\n20\n0 .5 1.\n-t (GeV 2)\n1.418-1.453\n0 .5 1.\n-t (GeV 2)\n1.453-1.481\nFIG. 1. Differential cross sections of \u0001p ! p!. The GRAAL\ndata for ! ! \u0002\u0001\u0002\u0002\u00020 are shown as solid circles. For a con-\nsistency check of the angular distribution pattern, the GRAAL\ndata for the ! ! \u00020\u0001 channel have been plotted with open\ntriangles at the E\u0001 \b 1:246–1:281 GeV bin. The vertical dashed\nlines indicate the kinematical limits in \u0002t. The calculations of\nZhao are solid lines. The open circles are data from Ref. [5]. The\ndashed lines are the calculation of Penner and Mosel [10]. The\ntwo dotted curves are calculations of Oh et al. [8] and the dot-\ndashed curve, of Titov and Lee [9].\nPRL 96, 132003 (2006) P H Y S I C A L R E V I E W L E T T E R S week ending7 APRIL 2006\nin the central detector and consequently the resolution of\nthe invariant mass of the 3 pions. At this stage of analysis,\nthe selected events are pure \u0001p ! p\u0002\u0001\u0002\u0002\u00020 events. They\noriginate from 3 possible reactions: (i) \u0001p ! p! with\n! ! \u0002\u0001\u0002\u0002\u00020, (ii) \u0001p ! p\u0005 with \u0005 ! \u0002\u0001\u0002\u0002\u00020, and\n(iii) the 4-body phase space reaction \u0001p ! p\u0002\u0001\u0002\u0002\u00020.\nThe events of reaction (ii) can be completely removed\nby a cut around the invariant mass of the \u0005. Only the events\nof the nonresonant 4-body reaction (iii) constitute a real\nproblem and the only way to minimize their contribution is\nthe decomposition of the invariant mass spectrum of\n3 pions into a sharp peak (FWHM \u0005 35 MeV) from the\n! meson and a smooth background from the 4-body chan-\nnel under the peak. The shapes of the peak and of the\nbackground are taken from simulations. Within the re-\naction kinematics, the background-to-peak height ratio\nvaries from 10% to 30% and the decomposition error\nfrom 3% to 8%.\nThis method of decomposition is applied to each group\nof events after having sorted the data according to the\nkinematics of the 2-body reaction \u0001p ! p!. In order to\nextract the differential cross section d\u0006=d\u0006jtj\u0007 for \u0001p !\np!, where t is the Mandelstam variable, the events are\nsorted into 300 kinematical intervals, corresponding to\n10 bins in E\u0001 and 30 bins in t. To extract the beam\nasymmetry \u0001 as a function of E\u0001 and the scattering angle\n\u0003c:m:! (c.m. referring to the center-of-mass frame), the data\nare sorted, for each of the vertical and horizontal beam\npolarizations, into 336 kinematical intervals, correspond-\ning to 4 bins in E\u0001, 7 bins in \u0003c:m:! , and 12 bins in the\nazimuthal angle \u0004!. After these decompositions, the num-\nber of ! events obtained in each kinematical interval needs\nto be corrected by the detection efficiency using the simu-\nlation calculation.\nThe simulation calculation uses the code LAGGEN of\nGRAAL which consists of an event generator followed\nby tracking with GEANT3 from the CERN library. In the\nevent generator, we use an energy spectrum with Compton\nshape for the gamma beam and a differential cross section\nfor ! meson photoproduction based on a 2-body phase\nspace. As to the distribution of the 3 pions from ! decay, a\nphase space distribution in the rest frame of !, and a\ndistribution induced by a double polarization (beam-vector\nmeson) [15,16] are used. With the simulation calculation,\nan efficiency table \u0007\u0006E\u0001; jtj\u0007 is calculated. An essential\ncheck is that the values in the table do not change signifi-\ncantly (with respect to the statistical errors) between the\ntwo types of distributions of the 3 pions in the rest frame of\n!. Since the whole phase space is covered by the accep-\ntance of the detector, the cross sections are extracted\nwithout extrapolation, requiring only efficiency correc-\ntions, (average efficiency \u0005 0:10).\nIn order to extract the beam asymmetry \u0001\u0006E\u0001;\u0003c:m:! \u0007, the\nmethod used previously in single pseudoscalar meson pho-\ntoproduction is applied [12,17–19]. For ! events falling13200into each kinematical interval (E\u0001;\u0003c:m:! ), the distribution\nof N\u0006\u0004\u0007 is plotted, where \u0004 is the angle between the\nproduction plane of ! meson and the horizontal plane.\nThis gives two distributions NV\u0006\u0004\u0007 and NH\u0006\u0004\u0007 corre-\nsponding to the beam vertical and horizontal polariza-\ntion directions, respectively. The ratio R\u0006\u0004\u0007 \b 2NV\u0006\u0004\u0007=\n\tNV\u0006\u0004\u0007 \u0001 NH\u0006\u0004\u0007\n is fitted by the expression 1\u0001\nP\u0001cos\u00062\u0004\u0007, from which the beam asymmetry \u0001 is de-\nduced. Another essential check with the simulation is that\nR\u0006\u0004\u0007 does not significantly depend on the detection effi-\nciency for the above mentioned two types of distributions\nof the decay products of the ! in its rest frame. The success\nof these two checks comes from the averaging out due to\nthe large number of possible directions of the ! decay\nproducts spread through the detector acceptance (5 inde-\npendent kinematical variables in the ! rest frame).\nThe GRAAL data of the \u0001p ! p! reaction with ! !\n\u0002\u0001\u0002\u0002\u00020, corresponding to a total of 86 000 pure ! events,\nare displayed in Figs. 1–4, together with some of the\nexisting world data.\nRecently, for the search of the missing resonances,\nseveral theoretical models have been developed in ! me-\nson photoproduction and were particularly interested in the\nbeam asymmetry results from the GRAAL data. All these\nmodels took the nonresonant amplitudes of the ! channel3-2\nPRL 96, 132003 (2006) P H Y S I C A L R E V I E W L E T T E R S week ending7 APRIL 2006\nfrom previous investigations at higher energies and calcu-\nlated the resonant amplitudes from effective Lagrangians.\nTitov and Lee took the N\u000b ! \u0001N and N\u000b ! !N coupling\nconstants fixed by the empirical helicity amplitudes and the\nvector-meson dominance model [9]. Penner and Mosel,\nanalyzing the photon- and pion-induced reactions devel-\noped a unitary coupled-channel Lagrangian including the\n! production channel [10,11]. Zhao et al., within a quark\nmodel approach built on the SU\u00066\u0007 \f O\u00063\u0007 basis, used the\nquark vector-meson coupling [6,7] and resonance contri-\nbutions from the s and u -channels. Oh et al. [8] took the\nresonance parameters from a quark model by Capstick and\nRoberts [20].\nIn Fig. 1, the differential cross section d\u0006=d\u0006jtj\u0007 is\nshown as a function of \u0002t for 10 beam energy bins. The\nexperimental data are plotted as dots with statistical error\nbars. The systematic errors, not shown in the figure, come\nfrom the flux determination (3%) and the background\nsubtraction [21]. The data exhibit, at low jtj values, a fast\ndecrease which is characteristic of t-channel exchanges\n[22] and, at high jtj, a cross-section enhancement which\nis the signature of s- and u-channel transitions. The model\nof Zhao et al. [6,7], plotted in a continuous line, satisfac-\ntorily reproduces the trends of our data.\nWe show in the same figure (plotted in open circles)\nsome of the results of Barth et al. [5] which match ap-\nproximately our beam energy bins, together with the cal-\nculations of Penner and Mosel (plotted in a dashed line),\nwhich included in their database the data of Barth et al.\n[10]. These results do not exhibit the characteristic pattern\nseen in our results, especially near threshold. Nevertheless,\nthey show at high jtj values a clear deviation from the\nexponential decrease of the t-channel exchange. Such a\ndeviation is also confirmed by the two dotted curves given0\n2\n4\n6\n8\n10\n12\n1 1.2 1.4 1.6 1.8 2\nEγ  (GeV)\nσ\n (µ\nb)\n1.700 1.800 1.900 2.000 2.100\nW (GeV)\nGRAAL data\nOld data\nBarth et al. data\n Model of Zhao\nPenner and Mosel\nResonance\nπ\n0\nPomeron\nNucleon-pole\nFIG. 2. Total cross section of \u0001p ! p!. The GRAAL data are\nshown as solid circles. The old data are: diamonds from Ref. [2],\nstars from Ref. [3], triangles from Ref. [4], and open circles from\nRef. [5]. The calculations by Zhao are shown with several lines:\nsolid for the full calculation, and other line types for contributing\nterms. The thicker dashed line is the calculation of Penner and\nMosel [10].\n13200by the model of Oh et al. [8] and the dot-dashed curve\ngiven by the model of Titov.\nIn Fig. 2, the total cross section is shown. The GRAAL\ndata (solid dots), are obtained by the integration of the\ndifferential cross sections given in Fig. 1. The error bars\ncome mainly from the uncertainty at the limits of the\nintegration. The systematic error of 5% is not shown.\nSimilar to the previous existing data (shown with empty\nsymbols), a strong rise at threshold is seen in GRAAL data.\nMoreover, a bump structure appears near threshold before\nthe total cross section levels off to a value of \u0005 7:5\bb at\n1.45 GeV. The model of Zhao et al. (solid line) satisfac-\ntorily reproduces the GRAAL data, and, in particular,\namong its different transition processes (shown in the\nfigure) the resonant term is dominant near threshold and\nremains sizeable up to E\u0001 \b 2 GeV. The same structure is\nalso seen in the results of Barth et al. [5] plotted in open\ncircles and in the calculation of Penner and Mosel [10]\n(shown by the heavy dashed line), where the enhancement\nnear threshold is attributed by the authors to P11\u00061710\u0007 and\nP13\u00061900\u0007 contributions.\nIn Figs. 3 and 4 the beam asymmetry \u0001 data are pre-\nsented with dots as a function of \u0003c:m:! for 4 bins of beam\nenergy, together with the predictions or the fit results of the\nvarious theoretical models. The errors on the experimental\nvalues of \u0001 come from fitting the R\u0006\u0004\u0007 distribution with\nthe expression 1\u0001 P\u0001cos\u00062\u0004\u0007. The systematic errors, not\nshown in the figure, come from the polarization (3%) and\nfrom the background subtraction [21]. The experimental\nvalues of \u0001 are found negative and large at intermediate\nangles. They are the convincing signal of s- and u-channel\ntransitions, particularly the excitation of nucleonic reso-\nnances. Because of helicity conservation of the dominant\npion exchange and small diffractive contribution (e.g.,\nPomeron exchange) near threshold, the beam asymmetry-0.6\n-0.4\n-0.2\n0.0\n0.2 1.108-1.218\nBe\nam\n a\nsy\nm\nm\net\nry\n Σ 1.218-1.327\n-0.6\n-0.4\n-0.2\n0.0\n0.2\nΘc.m.ω    (Deg.)\n1.327-1.423\n30 90 150\n1.423-1.500\nΘc.m.ω    (Deg.)\n30 90 150\nFIG. 3. Beam asymmetry of \u0001p ! p! for 4 bins of beam\nenergy. The GRAAL data are shown as solid circles. The thick\nline is the calculation of Titov et al. at 1.175 GeV [9]. The thin\ncontinuous and dashed lines are the predictions of Penner and\nMosel calculation [10] for positive and negative signs of the\ncoupling g!\t\u0002. The dotted lines are the calculation of Shklyar\net al. [11].\n3-3\n-0.6\n-0.4\n-0.2\n0.0\n0.2 1.108-1.218\nBe\nam\n a\nsy\nm\nm\net\nry\n Σ 1.218-1.327\n-0.6\n-0.4\n-0.2\n0.0\n0.2\nΘc.m.ω    (Deg.)\n1.327-1.423\n30 90 150\n1.423-1.500\nΘc.m.ω    (Deg.)\n30 90 150\nFIG. 4. Beam asymmetry of \u0001p ! p!. The same GRAAL\ndata as in Fig. 3. The calculations by Zhao are given with\ndifferent lines: solid line for full calculation; dashed line for\nno D13\u00061520\u0007 contribution; dotted line for no P13\u00061720\u0007; and\ndot-dashed line for no F15\u00061680\u0007. At the 1.423–1.500 GeV bin,\nthe heavy-dashed line is for no F15\u00062000\u0007 and the heavy-dotted\nline for no P13\u00061900\u0007.\nPRL 96, 132003 (2006) P H Y S I C A L R E V I E W L E T T E R S week ending7 APRIL 2006\u0001 would be vanishing without the helicity-violating s- and\nu-channel transitions, particularly the excitation of\nresonances.\nIn Fig. 3, the results of hadronic models are shown. The\nthick continuous line represents the result of Titov et al.\ncalculated at 1.175 [9]. The authors attribute the sizeable\nnegative asymmetry to the interference between the non-\nresonant and resonant amplitudes. The dominant resonant\ncontribution comes from the excitation of F15\u00061680\u0007 state,\nwhereas smaller contributions come from D13\u00061520\u0007,\nS11\u00061650\u0007, and P13\u00061720\u0007 states. Also in the same figure,\nare plotted the predictions of the Penner and Mosel model\n[10], in thin continuous and dashed lines for the positive\nand negative sign of the coupling g!\t\u0002, respectively. The\npredictions agree better with the data at higher energy.\nFrom the figure, no decisive conclusion can be drawn to\nextract the sign of the coupling. The authors have found in\ntheir calculation of ! photoproduction a clear dominant\ncontribution from the P11\u00061710\u0007 and smaller ones from\nP13\u00061720\u0007 and P13\u00061900\u0007 states. The calculation by\nShklyar et al. [11] using the model of Penner and Mosel\nbut allowing several resonances to contribute in ! produc-\ntion is shown in dotted lines. Big changes in shape and size\nare seen, rendering a poorer agreement with the experi-\nmental results.\nIn Fig. 4, our beam asymmetry data are presented with\nthe interpretation by Zhao et al. who give, with solid lines,\nthe full calculation results and, with other line types, the\nresults when one single resonance is switched off (keeping\nthe relative strengths of the remaining resonances as im-\nposed by the quark model). So, some of the resonances,\ne.g., D13\u00061520\u0007, P13\u00061720\u0007, F15\u00061680\u0007, are found to play an13200indispensable role, and some effects due to the F15\u00062000\u0007\nare also seen. In particular, the model suggests that\nP13\u00061720\u0007 plays an important role near threshold despite\na small branching ratio 0.002 while the P13\u00061900\u0007 and\nF15\u00062000\u0007 have sizeable branching ratios, 0.1 and 0.4, but\nsmall contributions to the cross section.\nTo summarize, the photoproduction of the ! meson has\nbeen studied at GRAAL from threshold up to E\u0001 \b\n1:5 GeV. Strong signals indicating resonance excitations\nare observed in this channel via the precise measurements\nover a wide angular range of the differential cross sections\nand, for the first time, of the beam asymmetries.\nThe comparison of these data to hadron and quark model\nresults shows that contributions from on-shell and off-shell\nresonances are both required. In particular, two poorly\nknown resonances, P13\u00061900\u0007 and F15\u00062000\u0007, are found\nto have sizeable decay branching ratios into !N. It is\nexpected that the present data will trigger the improvement\nof the existing models.3-4*Electronic address: hourany@ipno.in2p3.fr\n[1] S. Capstick and W. Roberts, Prog. Part. Nucl. Phys. 45,\nS241 (2000).\n[2] R. Erbe et al. (ABBHHM Collaboration), Phys. Rev. 175,\n1669 (1968).\n[3] W. Struczinski et al., Nucl. Phys. B108, 45 (1976).\n[4] F. J. Klein, Ph.D. thesis, University of Bonn, Bonn-IR-96-\n008, 1996; \u0002N Newsletter 14, 141 (1998).\n[5] J. Barth et al., Eur. Phys. J. A 18, 117 (2003).\n[6] Q. Zhao, Z. Li, and C. Bennhold, Phys. Lett. B 436 42\n(1998); Phys. Rev. C 58, 2393 (1998).\n[7] Q. Zhao, Phys. Rev. C 63, 025203 (2001).\n[8] Y. Oh, A. I. Titov, and T. S. H. Lee, Phys. Rev. C 63,\n025201 (2001).\n[9] A. I. Titov and T. S. H. Lee, Phys. Rev. C 66, 015204\n(2002).\n[10] G. Penner and U. Mosel, Phys. Rev. C 66, 055212 (2002).\n[11] V. Shklyar, H. Lenske, U. Mosel, and G. Penner, Phys.\nRev. C 71, 055206 (2005).\n[12] J. Ajaka et al., Phys. Rev. Lett. 81, 1797 (1998).\n[13] F. Ghio et al., Nucl. Instrum. Methods Phys. Res., Sect. A\n404, 71 (1998).\n[14] V. Kouznetsov et al., Nucl. Instrum. Methods Phys. Res.,\nSect. A 487, 396 (2002).\n[15] K. Schilling et al., Nucl. Phys. B15, 397 (1970).\n[16] J. Ballam et al., Phys. Rev. D 7, 3150 (1973).\n[17] J. Ajaka et al., Phys. Lett. B 475, 372 (2000).\n[18] F. Renard et al., Phys. Lett. B 528, 215 (2002).\n[19] O. Bartalini et al., Phys. Lett. B 544, 113 (2002).\n[20] S. Capstick and W. Roberts, Phys. Rev. D 49, 4570 (1994).\n[21] Omega photoproduction data at GRAAL (to appear in\nDurham HEP Databases).\n[22] B. Friman and M. Soyeur, Nucl. Phys. A600, 477 (1996).\n"}