{"doi":"10.1017\/S0028688509990026","coreId":"65112","oai":"oai:dro.dur.ac.uk.OAI2:6857","identifiers":["oai:dro.dur.ac.uk.OAI2:6857","10.1017\/S0028688509990026"],"title":"Q as hypothesis : a study in methodology.","authors":["Watson, Francis B."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-10-01","abstract":"Arguments for the Q hypothesis have changed little since B. H. Streeter. The purpose of this article is not to advocate an alternative hypothesis but to argue that, if the Q hypothesis is to be sustained, the unlikelihood of Luke's dependence on Matthew must be demonstrated by a systematic and comprehensive reconstruction of the redactional procedures entailed in the two hypotheses. The Q hypothesis will have been verified if (and only if) it generates a more plausible account of the Matthean and Lukan redaction of Mark and Q than the corresponding account of Luke's use of Mark and Matthew","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65112.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6857\/1\/6857.pdf","pdfHashValue":"654e088c7b8a20fe558b13b98c80c60ef836f569","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6857<\/identifier><datestamp>\n      2010-11-23T15:31:37Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Q as hypothesis : a study in methodology.<\/dc:title><dc:creator>\n        Watson, Francis B.<\/dc:creator><dc:description>\n        Arguments for the Q hypothesis have changed little since B. H. Streeter. The purpose of this article is not to advocate an alternative hypothesis but to argue that, if the Q hypothesis is to be sustained, the unlikelihood of Luke's dependence on Matthew must be demonstrated by a systematic and comprehensive reconstruction of the redactional procedures entailed in the two hypotheses. The Q hypothesis will have been verified if (and only if) it generates a more plausible account of the Matthean and Lukan redaction of Mark and Q than the corresponding account of Luke's use of Mark and Matthew.<\/dc:description><dc:subject>\n        Q<\/dc:subject><dc:subject>\n         Synoptic problem<\/dc:subject><dc:subject>\n         Source criticism<\/dc:subject><dc:subject>\n         Two source hypothesis.<\/dc:subject><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:source>\n        New Testament Studies, 2009, Vol.55(4), pp.397-415 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2009-10-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6857<\/dc:identifier><dc:identifier>\n        issn:0028-6885<\/dc:identifier><dc:identifier>\n        issn: 1469-8145 <\/dc:identifier><dc:identifier>\n        doi:10.1017\/S0028688509990026<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6857\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1017\/S0028688509990026<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6857\/1\/6857.pdf<\/dc:identifier><dc:rights>\n        © Copyright Cambridge University Press. This paper has been published by Cambridge University Press in \"New Testament Studies\" (55: 4 (2009) 397-415)  http:\/\/journals.cambridge.org\/action\/displayJournal?jid=NTS. © 2009 Cambridge University Press\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0028-6885","0028-6885","issn: 1469-8145"," 1469-8145"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["Q","Synoptic problem","Source criticism","Two source hypothesis."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n21 May 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nWatson, Francis B. (2009) ’Q as hypothesis : a study in methodology.’, New Testament Studies., 55 (4). pp.\n397-415.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1017\/S0028688509990026\nPublisher’s copyright statement:\nCopyright Cambridge University Press. This paper has been published by Cambridge University Press in ”New\nTestament Studies” (55: 4 (2009) 397-415) http:\/\/journals.cambridge.org\/action\/displayJournal?jid=NTS. 2009\nCambridge University Press\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\nQ as Hypothesis: A Study in Methodology\nFRANCIS WATSON\nDepartment of Theology and Religion, Durham University, Abbey House,\nPalace Green, Durham DH1 3RS, UK.\nemail: francis.watson@durham.ac.uk\nArguments for the Q hypothesis have changed little since B. H. Streeter. The\npurpose of this article is not to advocate an alternative hypothesis but to argue\nthat, if the Q hypothesis is to be sustained, the unlikelihood of Luke’s depen-\ndence on Matthew must be demonstrated by a systematic and comprehensive\nreconstruction of the redactional procedures entailed in the two hypotheses.\nThe Q hypothesis will have been verified if (and only if) it generates a more\nplausible account of the Matthean and Lukan redaction of Mark and Q than\nthe corresponding account of Luke’s use of Mark and Matthew.\nKeywords: Q, synoptic problem, source criticism, two source hypothesis\nQ has a secure place within an account of synoptic origins that established\nitself in the later nineteenth century, and that has remained dominant ever since. If\nQ is a ‘hypothesis’, so too is Markan priority. If we are to dispense with modern\nscholarly hypotheses, we would have to rethink the gospels in purely ahistorical,\nsynchronic terms, as parallel texts whose interrelationship should not be further\ninvestigated. That would be to revert not only to a pre-Enlightenment but also\nto a pre-Augustinian perspective. For Q to be a hypothesis is not in itself a problem.\nReminders of Q’s hypothetical status are usually intended as warnings not to\nproceed as though Q were an established fact, a newly discovered document of\n ‘Narrative criticism’ does not characteristically claim that synoptic interrelations should not be\ninvestigated at all—only that source-critical investigation should not be made foundational for\nall other forms of gospel scholarship.\n Augustine is usually credited with the view that Mark was dependent on Matthew as his ‘fol-\nlower and summarizer’ (pedisequus et breviator)—the so-called ‘Augustinian hypothesis’. In\nfact, Augustine changed his mind in the course of writing De Consensu Evangelistarum, con-\ncluding that Mark was more probably dependent on both Matthew and Luke, and thereby\nanticipating the so-called ‘Griesbach hypothesis’ (see de cons. evang. i..; iv..). More sig-\nnificant than either theory is the fact that Augustine advocated literary dependence at all, in\nopposition to the dominant tradition of independent authorship. John Kloppenborg’s sugges-\ntion that Augustine does not actually envisage literary dependence is unlikely, given the use of\nbreviator and the vacillation between one theory and another; see his Excavating Q: The\nHistory and Setting of the Sayings Gospel (Minneapolis: Fortress, ) n. \nNew Test. Stud. , pp. –. Printed in the United Kingdom ©  Cambridge University Press\ndoi:10.1017\/S0028688509990026\nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\nprimitive Christianity like the Gospel of Thomas. The scholarly circumspection that\nreminds us that an ‘assured result of modern scholarship’ is in reality ‘only a\nhypothesis’ is not without value. Yet it misunderstands what a hypothesis is for. It\nassumes that a hypothesis is characterized by its uncertainty, referring as it does\nto probabilities or possibilities whose actuality can never be reliably established.\nA hypothesis is not simply an informed guess or speculation, however. Its purpose\nis to present itself for ongoing critical testing, in order to ascertain whether it can\nprovide a more plausible explanation of the relevant data than its rivals. If it is suc-\ncessful in this regard, it will have attained the fact-like status to which it aspires.\nThe plausibility of a hypothesis is dependent in part on the implausibility of its\nmain alternatives. This point has been recognized in principle in Q research—and\nnecessarily so, since Q is premised on the unlikelihood that either of the later evange-\nlists is dependent on the other in addition to Mark. Yet the arguments for this unli-\nkelihood are typically asserted as though self-evident, without any attempt to\nsubstantiate them in detail. From B. H. Streeter and others, we learn () that, after\nthe material relating to the beginnings of Jesus’ ministry, Luke’s insertion of\ndouble tradition material into the Markan sequence bears no relation to\nMatthew’s; () that Luke’s allegedly disordered presentation of Jesus’ teaching\ndemonstrates his ignorance of the orderly Matthean discourses, especially the\nSermon on the Mount; and () that the more primitive version of a particular\nsaying is sometimes found in the one gospel, sometimes in the other. Q is the\nproduct of arguments such as these. It is assumed (rightly, in my view) that\nMatthew and Luke both use Mark, and that the most significant rival to the Q\nhypothesis is the hypothesis that Luke used Matthew as well as Mark (referred to\nhenceforth as the Luke\/Matthew or L\/M hypothesis.) Given these parameters, the\n Thus A. Lindemann writes: ‘[E]s bleibt die Frage, ob eine umfassende literarische Analyse und\ntheologische Auslegung der Logienquelle, die der Analyse und Interpretation der synop-\ntischen Evangelien vergleichbar wäre, wirklich möglich ist’ (‘Die Logienquelle Q: Fragen\nan eine gut begründete Hypothese’, The Sayings Source Q and the Historical Jesus [ed.\nA Lindemann; Leuven: Leuven University, ] –, here ).\n According to John Kloppenborg, ‘[n]o volume of support for a hypothesiswill ever turn it into a\nfact’, for ‘hypotheses are our ways of configuring and accounting for data…’ (Excavating Q, ;\nitalics original). In practice Kloppenborg usually treats Q as though it were a fact. If the argu-\nments for the Q hypothesis are as strong as he believes them to be, he is not wrong to do so.\n B. H. Streeter, The Four Gospels: A Study of Origins (London: Macmillan, ) –; W. G.\nKümmel, Introduction to the NewTestament (London: SCM, ) –. Streeter devotes five para-\ngraphs to the independenceofMatthewandLukeandtheconsequentexistenceofQ;Kümmel,one.\nChristopher Tuckett bases his case for the existence of Q on four ‘traditional arguments’which do\nnot go significantly beyond Streeter (Q and the History of Earliest Christianity: Studies on Q\n[Edinburgh: T. & T. Clark, ] –). W. D. Davies and D. C. Allison devote fourteen lines to the\nargument for Q rather than Luke’s use of Matthew, and merely repeat Streeter’s familiar claims\n(The Gospel according to Saint Matthew [ICC;  vols.; Edinburgh: T. & T. Clark, –] .).\n The usual nomenclature—the ‘Farrer hypothesis’, the ‘Farrer–Goulder hypothesis’—should\nbe abandoned, for two reasons. First, the L\/M possibility is a concern not just of this or that\n F RANC I S WATSON\nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\nconventional arguments are not without force. But whether they represent a properly\nrigorous testing of the Q hypothesis is another matter. A systematic investigation of\nthe Q hypothesis would have to compare the redactional procedures entailed by both\nthe Q and the L\/M hypotheses, since it is the alleged implausibility of the latter that\ncreates the need for the former. It is inadequate merely to assert without argument\nthat, on the L\/M hypothesis ‘it would be difficult to account for the fact that Luke’s\nplacement of the double tradition differs almost entirely from that of Matthew’—and\nto found a whole new document of primitive Christianity on that assertion.\nEach hypothesis entails an account of a consequent redactional procedure\nwhich it should be possible to retrace. Q generates, as it were, a double redactional\nprocess, as it is independently incorporated along with Mark into the work of the\ntwo later evangelists. The L\/M hypothesis is concerned with the single process in\nwhich Luke edits Matthew. If the Q hypothesis can produce a more intelligible,\ncoherent and plausible account of the double redaction than the L\/M hypothesis\ncan of its single redaction, then—within the parameters of the investigation—it\nwill have been verified. If not, then Q may have to be returned to the limbo of prob-\nabilities and possibilities, or rejected altogether. Indeed, my argument here will tend\ntowards this latter conclusion. My intention is not, however, to produce arguments\nin favour of Luke’s knowledge of Matthew and against Q. Rather, the point is a\nmethodological one: to demonstrate the need for a comparative and systematic\nstudy of the redactional procedures entailed in competing source-critical hypotheses.\nThe redactional procedures consequent on both Q and Luke’s use of Matthewmust\nboth be reconstructed and compared if the Q hypothesis is to be rigorously assessed.\nEven so, the discussion will be limited in scope. Other hypotheses—the\n‘Griesbach’ theory, for example, according to which Mark is dependent on both\nMatthew and Luke—will not come directly into consideration. Neither will the\nview that the predominantly oral\/aural culture of the early church makes the dis-\ncussion of purely literary relationships redundant. Oral tradition may influence a\nlater evangelist’s handling of an earlier text, but it is still possible and necessary to\ndescribe the relationship in literary, redaction-critical terms.\nscholar but of anyone seriously wishing to assess Q itself. Second, the case for Luke’s use of\nMatthew is best articulated not by Farrer or Goulder but by Mark Goodacre, whose book,\nThe Case against Q (Harrisburg: Trinity, ) is fundamental to the renewed debate. See\nalso Mark Goodacre and Nicholas Perrin, ed., Questioning Q (London: SPCK, ).\n Kloppenborg, Excavating Q, .\n For a succinct defence of the need for literary explanations, see Kloppenborg, Excavating Q,\n. Kloppenborg appeals to () ‘[s]trong verbal agreements…between each pair of Gospels’,\nand () ‘striking agreements in the sequence of pericopae’, especially significant given that\n‘the relative ordering of most of the Synoptic pericopae is not intrinsically determined by\ntheir content’.\nQ as Hypothesis \nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\nIt will be convenient to base this investigation on the rendering of Q material in\n() Matthew – = Luke –; () Matthew – = Luke  (with parts of chs. –); and\n() Matthew – = Luke –. The aim is to cover most of the contents of Q, in the\nhope that the clarity of an overview will compensate for unavoidable lack of atten-\ntion to detail. For the text of Q I shall use the Critical Edition of Robinson, Hoffmann\nand Kloppenborg, although alternative possibilities will also be acknowledged.\nI shall assume Q except where the rival L\/M hypothesis is under consideration.\n. Parallel Redaction\nMatthew and Luke provide similar accounts of the beginnings of Jesus’min-\nistry, and—according to the Q hypothesis—the similarities derive from their inde-\npendent use of both Mark and Q. At the point where the later evangelists first make\ncontact with these two sources, a tendency to proceed in parallel has already\nbecome evident in their independent decision to supplement Mark with birth\nstories. As we shall see, the Q hypothesis entails a whole series of similar yet inde-\npendent redactional moves on the part of Matthew and Luke. The question is how\nfar this parallelism constitutes a problem for the hypothesis.\nIn the introductory account of the ministry of John the Baptist (Mark .– +\npars.), minor agreements between Matthew and Luke against Mark may indicate\nthat Q too began at this point. Matthew and Luke agree against Mark in their refer-\nences to ‘all the region of the Jordan’, as an area from which crowds came to John\n(Matt .) or as part of John’s own sphere of activity (Luke .). Both later evange-\nlists cite Isa . without the non-Isaianic elements present in Mark (Mark .–;\nMatt .; Luke .). These minor agreements may suggest that the later evangelists\nwere able to draw on a parallel Q introduction to the ministry of John the Baptist,\nin addition to Mark. Other phraseology, unique to Matthew or Luke, may also be\nderived from Q, though the lack of agreement with the other evangelist makes it\ndifficult to identify as such. A Q introduction is required not just to account for\nthe minor agreements, however, but also to prepare for the passage that follows.\nHere, a sample is given of the Baptist’s harsh proclamation of judgment to those\nhe describes as a ‘brood of vipers’, and this is clearly derived from Q (Matt .–;\nLuke .–). The almost complete verbal agreement demonstrates the need for a\nliterary explanation of the relationship between Matthew and Luke. Yet this\npassage cannot represent the beginning of Q; the speaker is not even named in\n I hope to provide a fuller discussion of these matters in Chapters  and  of a book provision-\nally entitled, Receiving Jesus: Gospel Writing in Canonical Perspective, scheduled for publi-\ncation in .\n James M. Robinson, Paul Hoffmann and John S. Kloppenborg, The Critical Edition of Q\n(Minneapolis: Fortress; Leuven: Peeters, ).\n The Critical Edition (pp. –) assigns the following items to Q: Q .a ἐν δέ (?), .b {Ἰωάννη},\n{ἐν τῇ ἐρήμῳ} (?), a πᾶσα..ἡ.. π1ρί{χωρ}ο… τοῦ Ἰορδάνου, b {κηρύσσων} (?), . the\nIsaiah citation (?).\n F RANC I S WATSON\nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\nit. There must, then, be a Q component as well as a Markan one in the Matthean\nand Lukan passages in which the Baptist is introduced.\nWe already note that the double redactional procedure entailed in the Q hypoth-\nesis requires both later evangelists independently to make broadly similar choices.\nIn the introductory passage, they choose to conflate elements of Mark with\nelements of Q, and they supplement this passage with the Q judgment oracle\nwhich they both cite almost verbatim. The parallelism extends into the passage\non the Coming One that follows. As formatted below, underlinings represent\nwords or phrases unique to a single evangelist; italics, points where the\nwording of Matthew and Luke agrees against Mark; [A] and [B,], the distribution\nof the Coming One and double baptism sayings.\n[A] There comes one stronger than me after me, and I am not worthy to stoop\nand undo the strap of his sandals. [B] I baptize you with water, [B] but he will\nbaptize you with the Holy Spirit. (Mark .–)\n[B] I indeed baptize you in water for repentance; [A] but the one who comes\nafter me is stronger than me, and I am not worthy to carry his sandals. [B]\nHe will baptize you in the Holy Spirit and fire. His winnowing-fork is in his\nhand… (Matt .–)\n[B] I indeed baptize you with water; [A] but there comes one stronger than me,\nand I am not worthy to undo the strap of his sandals. [B] He will baptize you in\nthe Holy Spirit and fire. His winnowing-fork is in his hand… (Luke .–)\nMatthew and Luke independently derive fromQ the transposition of [A] and [B],\nresulting in the division of the double baptism saying, and the addition of ‘…with\nfire’, leading into the winnowing-fork saying (worded almost identically). Matthew\ndeviates further from Mark than does Luke, perhaps deriving from Q the reference\nto ‘carrying’ sandals rather than ‘undoing’ them. Yet the parallel redactional pro-\ncedures are again noteworthy. Both evangelists prefer the longer Q format, although\nLuke is also influenced by the Markan wording. Q, then, has provided both later\nevangelists with two judgment oracles, one general, the other announcing the\nComing One, and these are linked by the theme of ‘fire’ (Q ., , ).\nWas there a Q account of Jesus’ baptism, the event that follows in all three\nsynoptic evangelists (Mark .–; Matt .–; Luke .–)? Minor agree-\nments against Mark are again slight but not negligible. Arguably, Q needs\n According to the Critical Edition, the following items may be assigned to Q from the baptism\naccounts: Q.[[]] {Ἰησου}, {βαπτισθ1}, ν1ῳχθη, {ο}, {οὐρανο} (p. ). Q.[[]] {καὶ},\n{καταβ…ν} (?), {τό πν1ῦμα}, το (?), {ὡς π1ριστ1ράν} (?), ἐπ’ {αὐτόν}, {καὶ ϕωνή} (?),\n[(ουραν)] (?), {ὁ υἱός μου ὁ ἀγαπητός, ἐν} (?), {1ὐδόκησα} (?). These items are sufficient\nto ensure a connection between the messianic preaching (Q .b–) and the temptations\n(Q .–). The Critical Edition also repeatedly suggests that phraseology apparently drawn\nfrom Mark or from Matthean or Lukan redaction may actually reflect identical wording in Q.\nQ as Hypothesis \nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\nsome such passage in order to bridge the gap between the Baptist’s proclamation\nand the extended temptation narrative that follows (Q .–). If so, Matthew and\nLuke independently prefer Mark to Q at this point. In the temptation narrative,\nhowever, they incorporate different elements from the brief Markan version\ninto the much fuller Q version, which completes this text’s opening narrative\nsequence. Almost imperceptible in the introductory passage, Q provides the\nlater evangelists with the two judgment oracles, gives way to Mark’s account of\nJesus’ baptism and the descent of the Spirit and reappears in the extended temp-\ntation narrative. In spite of their differences, the later evangelists proceed in par-\nallel as they undertake their parallel tasks, which are to compose new accounts of\nthe beginning of Jesus’ ministry on the basis of both Mark and Q.\nThe other equally striking parallelism is between Q and Mark. If these two texts\nare independent of each other, as Matthew and Luke are supposed to be, then both\nthe pairings that comprise the classic two-source hypothesis—Mark and Q,\nMatthew and Luke—give similar accounts of the beginnings of Jesus’ministry, pro-\nceeding inmysterious harmony like the four living creatures in Ezekiel’s vision. One\npossibility is simply to deny this opening narrative sequence to Q. A Q that begins\nwith the Inaugural Sermon (Q .–) is a more coherent text than one that sets\nout as a narrative gospel but diverts into sayings gospel mode. On that view, pas-\nsages such as the judgment oracle (Q .–) and the temptation story (Q .–)\nare independent fragments, not truly a part of Q. In that case, however, the redac-\ntional parallelism is not just striking but astonishing. Quite independently of one\nanother, Matthew and Luke insert the same fragments at the same points in their\ncommon Markan framework. Alternatively, Mark may be dependent on Q, or Q\non Mark. But if parallelism without dependence can exist on the second tier\n(Matthew and Luke), perhaps it can also exist on the first (Mark and Q).\nThe fact is that the Q hypothesis labours under a certain disadvantage in this\nopening narrative sequence. This is indirectly acknowledged by B. H. Streeter\nhimself. In response to ‘the obvious suggestion that Luke knew Matthew’s Gospel’,\nStreeter claimed that, ‘subsequent to the Temptation story, there is not a single\ncase in which Matthew and Luke agree in inserting the same saying at the same\npoint in the Marcan outline’. If that is the case only ‘subsequent to the\nTemptation story’, it is because the situation is quite different in the opening narrative\nsequence itself. Here, Matthew and Luke do agree in inserting the same sayings (the\ntwo judgment oracles) and the same narrative (the temptations) at the same points in\n So Lindemann, for whom no coherent opening for Q can be extracted from Matt – = Luke\n–; Q opened instead with the beatitudes (‘Die Logienquelle Q’, –).\n See Jan Lambrecht ‘John the Baptist and Jesus in Mark .–: Markan Redaction of Q?’, NTS\n () –.\n Streeter, The Four Gospels, .\n F RANC I S WATSON\nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\ntheMarkan outline. It follows that, for thismaterial, ‘the obvious suggestion that Luke\nknew Matthew’s Gospel’ must seem plausible, on Streeter’s own premises.\nThe L\/M hypothesis seeks to account for a single rather than a double redac-\ntion, and has no need of the coincidental parallelism required by the Q hypothesis.\nIf Luke knew Matthew’s Gospel, he would follow Matthew in the two judgment\noracles (while allowing Mark some influence over the wording of the second).\nHe would supplement Matthew with the exchanges between the Baptist and the\ncrowds, tax-collectors and soldiers (Luke .–), just as Matthew had previously\nsupplemented Mark with the first judgment oracle. But he would omit the\nexchange between the Baptist and Jesus himself (Matt .–). Why might he\nhave done so? If no plausible explanation lies to hand, does this suggest Luke’s\nignorance of Matthew, as the Q hypothesis requires? But little if anything should\nbe read into an omission. The later evangelists often omit material from Mark,\nand speculating about their motives is rarely fruitful.\nGiven that Matthew and Luke otherwise agree here in their additions to Mark,\nStreeter’s assumption must be that their disagreement elsewhere is such as to\noverride their agreement here. On the basis of this material alone, we would pos-\ntulate not Q but Luke’s knowledge of Matthew. If Q represents the best expla-\nnation for the rest of the ‘double tradition’, however, it makes sense to extend\nthe hypothesis even into material that does not display the all-important disagree-\nment. Probably no-one will be satisfied with the suggestion that Luke followed\nMatthew in the opening narrative sequence, but Q thereafter.\nThe crucial question is whether the redactional parallelism generated here by\nthe Q hypothesis should be regarded as entirely conceivable or as highly unlikely.\n. The Inaugural Sermon\nAccording to the Q hypothesis, Q moves rapidly on from the temptation\nnarrative to the Inaugural Sermon (Q .–). That is why, in Matthew, the\n Perhaps Luke felt that the Baptist’s initial reluctance to baptize Jesus was incompatible with\nthe predestined relationship between them, as portrayed in Luke ? Or perhaps he failed to\nunderstand Jesus’ cryptic reference to ‘fulfilling all righteousness’? Or perhaps the\nMatthean passage simply seemed superfluous to him? The possibilities could be multiplied.\n Contrast David Catchpole’s discussion of the opening narrative sequence, where the existence\nof Q is made to hang on the unlikelihood that Lukan wording is dependent on Matthean (The\nQuest for Q [Edinburgh: T. & T. Clark, ] –). Why, for example, would Luke omit the\nMatthean 1ἰς μ1τάνοιαν from the double baptism saying, given that he introduces this\nvery phrase into his rendering of Mark . in Luke . ()? It is assumed here that a\nwriter who introduces a phrase into one context would be ‘inconsistent’ if he failed to repro-\nduce it in another, where it appears in one though not the other of his sources. But that is to\noperate with a mechanistic model of ‘consistency’. Ad hoc arguments of this kind do nothing\nto demonstrate the likelihood of Q, in the absence of an overarching reconstruction of the\nredational procedure entailed in the alternative hypotheses.\nQ as Hypothesis \nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\nSermon occurs so early in Jesus’ministry. The Sermon on theMount follows the Q\nSermon only in the outline it shares with Luke, and it is expanded with Q and non-\nQ material drawn in from elsewhere. It therefore contains two types of Q material:\nframework material also found in the Lukan Sermon on the Plain and the under-\nlying Q text, in much the same sequence as in Matthew; and supplementary\nmaterial drawn from Q contexts that may still be preserved in Luke. The frame-\nwork material consists in the followingο five items:\n. a collection of four beatitudes, pronouncing blessings on the poor, the\nhungry, the sorrowful, and the persecuted—with or without corresponding\nwoes, which may be Lukan (Matt ., , , –; Luke .–);\n. sayings relating to love of enemies, non-resistance and the Golden Rule (Matt\n.–, .; Luke .–);\n. the warning against judging, with the corresponding parable of the mote and\nthe beam (Matt .–; Luke .–, –);\n. the passage on good and bad trees and their fruits (Matt .–; Luke .–);\n. the parable of the two houses, introduced by the saying, ‘Why do you call me\nLord, Lord…?’ (Matt ., –; Luke .–).\nThis framework material corresponds closely to Luke’s Sermon on the Plain,\nwhich in turn corresponds closely to Q in both sequence and content. Of the sup-\nplementary items with which Matthew expands this framework, the following thir-\nteen are drawn from Q:\n[ ] (= Q framework)\n salt Q .– → Matt .\n lighting lamp Q . → Matt .\n not an iota Q . → Matt .\n adversary Q .– → Matt .–\n divorce Q . → Matt .\n[ ]\n Lord’s Prayer Q .– → Matt .–\n treasure in heaven Q .– → Matt .–\n eye as lamp Q .– → Matt .–\n two masters Q . → Matt .\n do not be anxious Q .– → Matt .–\n[ ]\n ask, seek Q .– → Matt .–\n narrow gate Q .– → Matt .–\n[ ]\n rejection Q .– → Matt .–\n[ ]\nFurther analysis of Matthew’s use of Q would investigate the extension of the\ncollection of beatitudes (Matt .–), the construction of the antitheses (Matt\n F RANC I S WATSON\nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\n.–), the incorporation of the Lord’s prayer into a second antithetical struc-\nture (Matt .–) and so on. There seems no reason to doubt that a plausible\naccount of the Matthean redaction would come to light.\nIf Q is a hypothesis, however, requiring critical testing as such, it is not suffi-\ncient simply to describe the Matthean redaction as though Q were an extant docu-\nment. Any hypothesis must demonstrate its superiority over its rivals. In this case,\nthe hypothesis only exists at all on account of the alleged implausibility of its main\nrival, the L\/M hypothesis. On that view, the thirteen Q items inserted into the\nSermon on the Mount would have to be redescribed as items extracted from\nthe Sermon on the Mount by Luke, and reincorporated at later points in his\ngospel. It is at this point that the L\/M hypothesis is supposedly at its weakest.\nThus, W. G. Kümmel writes in an oft-quoted passage:\n[T]hat Lk took his common material over directly from Mt is championed\nagain and again. This position is completely inconceivable, however. What\ncould possibly have motivated Lk, for example, to shatter Mt’s Sermon on\nthe Mount, placing part of it in his Sermon on the Plain, dividing up other\nparts among various chapters of his Gospel, and letting the rest drop out of\nsight?\nThis familiar argument has perhaps done more than any other to establish a\nsense of the prima facie plausibility of Q. Yet it is seriously flawed.\nFirst, Kümmel assumes that a later evangelist would inevitably wish to repro-\nduce the Sermon on the Mount in his own work, in more or less its Matthean\nform. But Luke would not have known this material as ‘the Sermon on the\nMount’, and it is anachronistic to imagine that he would necessarily have\nshared the modern reverence for it. A later evangelist must reshape, omit or sup-\nplement source material if he is to produce a genuinely new gospel at all.\nSecond, Kümmel’s question about ‘motivation’ is premature. In order to test\nthe Q hypothesis, we should first reconstruct the redactional procedure the evan-\ngelist would have to follow in redistributing parts of the Matthean Sermon to later\npoints in his own gospel. Once this hypothetical redactional procedure has been\nestablished, we may then raise the question of ‘motivation’, seeking a possible\nredactional logic within the new juxtapositions.\nOn the L\/M hypothesis, the five framework items and thirteen supplementary\nitems, listed above, take on a different significance. The framework items—four\nbeatitudes; sayings on love of enemies, judging and fruitbearing; the parable of\nthe two houses—now represent the Lukan reduction of the Matthean Sermon\nto around a third of its original compass. Some material Luke would simply\nomit: nowhere in Luke do we find an equivalent of the Matthean prohibition of\noath-taking (Matt .–). There is no need for the L\/M hypothesis to explain\n Kümmel, Introduction to the New Testament, .\nQ as Hypothesis \nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\n‘what could possibly have motivated Luke’ to omit this prohibition, any more than\nthe Markan priority hypothesis is obliged to speculate about Luke’s objections to\neverything in Mark .–.. Both hypotheses generate accounts of redactional\nprocedure that involve omissions, and speculation about motives will usually\nbe inconclusive.\nThe thirteen supplementary items must now be presented as Matthean pas-\nsages extracted by Luke for reincorporation elsewhere:\n[ ]\n salt Matt . → Luke .–\n lighting lamp Matt . → Luke .\n not an iota Matt . → Luke .\n adversary Matt .– → Luke .–\n divorce Matt . → Luke .\n[ ]\n Lord’s Prayer Matt .– → Luke .–\n treasure in heaven Matt .– → Luke .–\n eye as lamp Matt .– → Luke .–\n two masters Matt . → Luke .\n do not be anxious Matt .– → Luke .–\n[ ]\n ask, seek Matt .– → Luke .–\n narrow gate Matt .– → Luke .–\n[ ]\n rejection Matt .– → Luke .–\n[ ]\nThe secondary Lukan sequence is quite different from the original Matthean\none. We may imagine that, in the course of reducing Matthew’s Sermon on the\nMount to his own Sermon on the Plain, Luke has copied into a notebook those\nMatthean items he wishes to set aside for subsequent use. These are all reincor-\nporated, along with other items shared with Matthew or unique to Luke, in the\ncentral section of Luke’s Gospel in which the Markan framework is absent\n(Luke .–.).\n For the ancient use of notebooks (codices) and wax tablets for preparatory work, see Loveday\nAlexander, ‘Ancient Book Production’, The Gospels for All Christians (ed. R. Bauckham; Grand\nRapids, MI: Eerdmans: ) – (–).\n Compare the analysis of Mark A. Matson, ‘Luke’s Rewriting of the Sermon on the Mount’,\nQuestioning Q (ed. Goodacre and Perrin) – (–).\n F RANC I S WATSON\nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\nIf the thirteen items are rearranged in their Lukan sequence, the following\npattern comes to light:\nA Luke .–  Lord’s Prayer\nA Luke .–  ask, seek\nB Luke .  lighting lamp\nB Luke .–  eye as lamp\nC Luke .–  do not be anxious\nC Luke .–  treasure in heaven\nD Luke .–  accuser\nE Luke .–  narrow gate\nE Luke .–  rejection\nF Luke .  two masters\nF Luke .  not an iota\nF Luke .  divorce\nIn four cases (A B C E) Luke has arranged the Matthean passages in pairs, the\nsecond member of which is inserted more or less directly after the first. In the first\nthree cases (A B C), an entirely new juxtaposition is created, as the dispersal of our\noriginal Matthean enumeration indicates (A\/ Luke =   Matthew, and so on).\nIn A and B, a thematic link between the paired passages is readily apparent even\nfrom the outline above, and closer investigation shows that this is also the case\nwith C, E and F\/. Also in E and F\/, traces of the original Matthean order\nare preserved.\nFurther analysis of the redactional procedure consequent on the L\/M hypoth-\nesis is unnecessary here, since our concern is primarily a methodological one.\nThis preliminary analysis confirms the Q hypothesis if and only if the redactional\nprocedure consequent on the L\/M hypothesis is held to be ‘completely inconcei-\nvable’. It supports the Q hypothesis if the thirteen items are more plausibly seen as\nsupplementing a short Sermon than as extracted from a long one. It undermines\nthe Q hypothesis if the L\/M redactional procedure is judged to be no less plausible\nthan the alternative. The issue is not resolved merely by observing that the\nSermon on the Mount appears to be a secondary construction put together by\nMatthew himself. Assuming that the evangelist made use of at least one source,\nthat source might or might not have been Q. As defined by the standard hypoth-\nesis, Q is not just a generic lost sayings source. It has its own particular contours.\n It is true that, ‘[i]f Luke were proved to have used Matthew, who in turn used Mark, the origin\nof the non-Marcan material in Matthew would still need clarification’ (Catchpole, Quest for\nQ, ). Yet, if one postulated a pre-Matthean sayings source on that basis, it would be utterly\nmisleading to call it ‘Q’.\nQ as Hypothesis \nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\nOne other way in which the issue might be resolved is by demonstrating what\nMark Goodacre has described as ‘alternating primitivity’: that Matthew pre-\nserves the earlier form of a passage on some occasions, Luke on others. The\nearlier form would then be the Q form; the L\/M hypothesis is vulnerable if pas-\nsages can be identified in which the earlier form is clearly preserved in Luke.\nOne possible candidate occurs at the very outset of the Inaugural Sermon. In\nLuke, Jesus pronounces blessings on ‘you poor’ and ‘you who hunger now’\n(Luke .–). In Matthew, he blesses ‘the poor in spirit’ and ‘those who\nhunger and thirst for righteousness’ (Matt ., ). It is often said that Matthew\nhas here ‘spiritualized’ sayings that originally referred to material deprivation.\nWhile this is certainly possible, it is methodologically important to exclude the\nalternative possibility only when one has attempted and failed to make a case\nfor it. If Luke’s beatitudes are constructed out of Matthew’s, then the later evange-\nlist has reapplied beatitudes relating to ethical qualities to the material depri-\nvations endured by Jesus’ disciples. By adding the woes, he has created a set of\nantitheses: poor\/rich, hungry\/satisfied, weeping\/laughing, hatred\/esteem (Luke\n.–). Arguably, the first two antitheses fit remarkably well into a Gospel\nthat contains the Magnificat (cf. Luke .), the scriptural motif of good news\nfor the poor (Luke .; .) and the parables of the Rich Fool (.–) and\nDives and Lazarus (.–). If so, there is no need to trace the beatitudes in\ntheir shorter form back to Q. If Matthew’s beatitudes are secondary then Luke’s\nmay be primary, but they may equally well be tertiary.\n. The Common Sequence\nThe chapters following Matthew’s Sermon on the Mount contain a sig-\nnificant quantity of Q material interspersed within Markan material in which\nthe original Markan sequence is not easy to detect. Indeed, it is the free handling\nof Markan sequence especially in Matthew – that has led to the view that Luke\n Goodacre, Case against Q, .\n See the detailed discussion of this point in Goodacre, Case against Q, –.\n The pressure to identify one version of a saying as ‘more primitive’ than another reflects the\nassumption that the favoured version may approximate to the very words Jesus uttered. For a\ntheoretically sophisticated critique of this view of ‘authenticity’, see Jens Schröter, ‘Die Frage\nnach dem historischen Jesus und der Charakter historischer Erkenntnis’, Sayings Source Q (ed.\nA Lindemann) –. According to Schröter: ‘[D]ie Quellen der Vergangenheit enthalten\nnicht die Tatsachen und Ereignisse, sondern Deutungen von diesen… Die Vorstellung, es\nkönne einen Zugang zu einer hinter diesen Interpretationen liegenden Wirklichkeit geben,\nwird damit grundsätzlich obsolet’ (). Thus, ‘[d]ie Vorstellung des “wirklichen” Jesus\nhinter den Quellen erweist sich dabei als obsolet, die Jesusfrage ist mithin umzuformulieren\nin diejenige nach einem an die Quellen gebundenen Entwurf des erinnerten Jesus als Inhalt\ndes sozialen Gedächtnisses des Urchristentums’ (; italics original).\n F RANC I S WATSON\nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\nis more likely to have preserved the Q sequence. This conclusion is unwar-\nranted, however. In Matthew –, three interlocking sequences may be ident-\nified. Two of these are Markan, and they are the result of Matthew’s decision to\nallow the sequences Mark .–. and .–. to overlap in his own\nrendering of them. As formatted below, the second sequence is italicized in\norder to differentiate it from the first; square brackets represent the third, non-\nMarkan sequence to which we shall shortly return; the asterisk denotes a\ndisplacement.\nThe leper Mark .– → Matt .–\n[ ]\nPeter’s mother-in-law *Mark .– → Matt .–\n[ ]\nStilling the storm Mark .– → Matt .–\nGerasene demoniac[s] Mark .– → Matt .–\nParalytic Mark .– → Matt .–\nCall of Levi\/Matthew Mark .– → Matt .\nEating with sinners Mark .– → Matt .–\nFasting Mark .– → Matt .–\nRuler’s daughter, haemorrhaging woman Mark .– → Matt .–\n[ ]\nGrain on sabbath Mark .– → Matt .–\nSabbath healing Mark .– → Matt .–\n[ ]\nBeelzebul controversy Mark .– → Matt .–\n[ ]\nJesus’ true family Mark .– → Matt .–\nParables Mark .– → Matt .–\nRejection at Nazareth Mark .– → Matt .–\nAs the italicization indicates, Matthew’s primary Markan sequence is inter-\nrupted by material from a later point in Mark’s narrative, constituting a second\nMarkan sequence. Both sequences are incorporated in their correct Markan\norder. With the incorporation of Mark .– in Matthew , the gap between\nthe first and second sequences has been filled up, so that from this point on\nMatthew follows a single Markan sequence. The one genuine displacement\n ‘It is…a matter of empirical observation that Matthew transposed Marcan passages. From this\nderives the possibility that in the case of disagreements, Matthew may be secondary in his\nsetting of Q’ (J. Kloppenborg, The Formation of Q: Trajectories in Ancient Wisdom\nCollections [Harrisburg: Trinity, nd ed. ] –, ; see also Excavating Q, –). For\na critique of the assumption that Luke keeps closer to Markan sequence than Matthew, see\nGoodacre, Case against Q, –.\n The Mission Discourse of Matt  is omitted here, since it depends on diverse Markan and\nnon-Markan materials.\nQ as Hypothesis \nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\noccurs at Mark .– (Peter’s mother-in-law). It occurs on account of Matthew’s\ndecision to place the healing of the leper on the road that leads from the mountain\nto Capernaum, where the centurion’s servant and Peter’s mother-in-law are\nhealed. It is therefore incorrect to assume that Matthew – in particular is\nbased on some non-Markan principle of organization. Although the Beelzebul\ncontroversy story is said to have occurred in Q as well as Mark, it should be\nnoted that it occurs here at the appropriate position within the primary Markan\nsequence.\nInterspersed within the two overlapping Markan sequences is a further\nsequence consisting of ten items that Matthew shares with Luke. Most of\nthese item are non-Markan, but three of them show signs of a Markan connec-\ntion (= { }, below). Surprisingly, two of these three simultaneously belong\nto Matthew’s primary Markan sequence, and represent points where\nMarkan and non-Markan sequences converge. The Mark column represents\nthe point reached in Matthew’s primary Markan sequence when an item is\ninserted:\ni Centurion’s servant Matt .– Mark .\nii Discipleship sayings Matt .– Mark .\niii {Mission Discourse} Matt .–. [Mark .–; .–; .–]\niv Jesus and John Matt .– Mark .\nv Woes against towns Matt .– Mark .\nvi Jesus’ thanksgiving Matt .– Mark .\nvii {Beelzebul controversy} Matt .– =Mark .–\nviii Sign of Jonah Matt .– Mark .\nix Return of unclean spirit Matt .– Mark .\nx {Jesus’ true family} Matt .– =Mark .–\nItems iii–vi occur consecutively in Matt .–., but i–ii and vii–x occur\nwithin contexts determined by the first Markan sequence (= Mark .–.), to\nwhich indeed two of them already belong (vii {Beelzebul controversy} and x\n{Jesus’ true family}).\nThe sequence recurs within two distinct sections in Luke (.–; .–.),\nseparated by the abbreviated Lukan rendering of Mark .–.. In the\nfollowing analysis, an asterisk indicates a difference from the Matthean order.\n According to Davies and Allison, in Matt – the evangelist has reorganized the Markan\nsequence to create three groups of three miracles stories concluding with a summary and\nwords of Jesus (Matthew, ., ; .– [Excursus V]). In Matt –, five transpositions of\nMarkan sequence may be identified (.–). The analysis is greatly simplified once it is\nseen that Matthew here follows two distinct Markan sequences. The double sequence is\nnoted by F. Neirynck, who distinguishes here between ‘Mk (A)’ and ‘Mk (B)’ (‘Matthew\n:–: and the Matthean Composition of :–:’, The Interrelations of the Gospels [ed.\nDavid L. Dungan; Leuven: Leuven University, ] – [–]).\n F RANC I S WATSON\nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\nTheMark column again represents the point reached when non-Markan items are\ninserted:\ni Centurion’s servant Luke .– Mark . (= Luke .)\niv* Jesus and John Luke .– Mark .\nii Discipleship sayings Luke .– Mark . (= Luke .)\niii {Mission Discourse} Luke .–,  Mark .\nv Woes against towns Luke .– Mark .\nvi Jesus’ thanksgiving Luke .– Mark .\nvii {Beelzebul controversy} Luke .– Mark .\nix Return of unclean spirit Luke .– Mark . (cf. .–)\nx {Jesus’ true family} Luke .– Mark . (cf. .–)\nviii* Sign of Jonah Luke .– Mark .\nSome general observations about this shared sequence are necessary, before\nseeking to recover the redactional procedures needed to create it under the\nL\/M and Q hypotheses respectively.\nFirst, in both Matthew and Luke this common sequence follows on from the\nSermon, which in turn follows on from the opening narrative sequence. In both\nlater gospels, this entire common sequence has been superimposed on the\nMarkan one, and around % of the ‘double tradition’ material occurs within it.\nThis is to be differentiated from the remaining % of this material which is dif-\nferently distributed: in Matthew, primarily in the great discourses (Matt –; ,\n; –); in Luke, primarily in .–., starting from the very point at\nwhich the common sequence ends. In both Matthew and Luke, the common\nsequence is partially concealed by material derived from Mark or unique to one\nor other evangelist. It comes to light only when this extraneous material is set\naside.\nSecond, the earlier position of iv Jesus and John in Luke connects this passage\nmore closely with the Baptist material that introduces Jesus’ own ministry (Luke\n.– and parallels). Since the sequence here concludes with viii Sign of Jonah,\nthe sequel to vii {Beelzebul controversy} is now, appropriately enough, ix Return of\nunclean spirit. In Matthew, the equivalent sequel is provided by the passage on\nfruitbearing (Matt .–), which this evangelist connects to the twin sayings\non blasphemy against the Spirit that conclude his account of the Beelzebul con-\ntroversy. However they are to be explained, these divergences do not seriously\nundermine the common non-Markan sequence.\n Kloppenborg also notes this common sequence, but adds further items to it—the parable of\nthe lost sheep, sayings on forgiveness, the parable of the talents (Formation of Q, ). The\neffect is to obscure the sharp divide in Luke between common sequence material (Luke\n.–. =Matt .–.) and non-sequential common material (Luke .–. =Matt\npassim; exceptions at Luke .–; .–, –).\nQ as Hypothesis \nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\nThird, after the opening narrative sequence Luke incorporates items from the\ncommon sequence in just two major groupings, and these items all occur at a later\npoint relative to Mark than in Matthew. While some grouping occurs in Matthew,\ncommon sequence items are more widely dispersed through the evangelist’s\noverlapping Markan sequences; and all have been incorporated by the point at\nwhich Matthew reaches Mark’s parable chapter (Matt  =Mark ). In contrast,\nonly two of the ten common sequence items have been incorporated at the equiv-\nalent point in Luke (Luke .–). As a result of Luke’s grouping of common\nsequence material, the Markan sequence stands out more clearly in Luke than\nin Matthew, even though it is equally fundamental to both evangelists. Matthew\nseeks to conflate his Markan and non-Markan sequences, whereas Luke seeks\nto preserve their individual integrity. The later positioning of the non-Markan\nmaterial relative to the Markan indicates that Luke gives a certain priority to Mark.\nFourth, Luke’s version of vii {Beelzebul controversy} is anomalous. In Matthew\nthis controversy story occurs within the primary Markan sequence. As with the\nother Markan controversy stories in Matthew , the later evangelist inserts sup-\nplementary material here, in the form of a new introduction (.–) and\nsayings relating to the source of exorcistic power (.–), being for or\nagainst Jesus (.) and defaming the Son of man and the Holy Spirit\n(.). Luke attests the first three of these four expansions, and he places\nthis story not in the appropriate location in his Markan sequence (that is, at\nLuke .) but within the sequence shared with Matthew. Thus, this controversy\nstory belongs both within Matthew’s rendering of the primary Markan sequence,\nand within the non-Markan sequence Matthew shares with Luke.\nFifth, a related anomaly arises from Luke’s version of x {Jesus’ true family}.\nHere, Jesus blesses ‘those who hear the word of God and keep it’, in response\nto a woman in the crowd who pronounces a blessing on his mother (.–).\nThis recalls the Markan passage on Jesus’ true family (Mark .–), which\nLuke has already reproduced (Luke .–). Thus Luke includes two passages\non this theme, and they are similar enough to comprise a ‘doublet’. In both pas-\nsages, Jesus’ saying is provoked by a reference to his mother (with or without his\nbrothers), and in both he responds by commending instead those who hear and\nobey the word of God. In Matthew, x {Jesus’ true family} occurs in a Markan form\nand within the primary Markan sequence. Yet Matthew and Luke have both\nattached a form of the true family passage to ix Return of unclean spirit. Like vii\n In the same way, Matthew supplements the Markan sabbath controversy stories with sayings\nrelating to the temple (Matt .–), and with the analogy of the sheep falling into a pit (Matt\n.–). Matt .,  are closely connected to one another and to the context, as is indi-\ncated by the sequence ἐν τῷ Β11ζ1βούλ (v. ), ἐν Β11ζ1βούλ, ἐν τίνι (v. ), ἐν πν1ύματι\nθ1οῦ (v. ). Matt .,  are both variants of Markan sayings.\n F RANC I S WATSON\nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\n{Beelzebul controversy}, this passage exists simultaneously within a Markan\nsequence (evidenced in Matthew) and a non-Markan one (evidenced in Luke).\nThis analysis of the sequence common to Matthew and Luke can now be used\nto test the L\/M and Q hypotheses. The question to be put to each is this: What kind\nof redactional procedure would produce this common sequence, differently dis-\ntributed and partially concealed by Markan and other material?\nOn the L\/M hypothesis, the common sequence is the result of Luke’s distinc-\ntive engagement with Matthew. The hypothesis requires Luke to be able to ident-\nify non-Markan material in Matthew, but to do so only after he has given his own\nrendering of the Markan context in which Matthew has located it, on the basis of\nMark’s narrative alone. Luke first rewrites a Markan sequence, and then incor-\nporates selected supplementary material from Matthew. After the opening narra-\ntive sequence, the third evangelist engages with each of the two earlier gospels in\nturn, alternating between them. Given a redactional decision to differentiate\nMarkan and Matthean material and to give precedence to Mark, it is unsurprising\nthat relatively few traces of Matthew’s redaction of Mark are evident in the equiv-\nalent Lukan redaction. Luke departs from his usual editorial practice, however, in\nthe case of vii {Beelzebul controversy} and x {Jesus’ true family}. In the one case, he\nhas followed Matthew rather than Mark, as both the positioning and the\nadditional sayings indicate. In the other case, he has followed Matthew as well\nas Mark, reworking the Markan version within his Markan sequence (Luke\n.–) and the Matthean version (itself dependent on Mark) within the\ncommon sequence derived from Matthew (Luke .–).\nOn the Q hypothesis, the non-Markan sequence common to Matthew and\nLuke is derived from Q, rather than being a Lukan construct derived from\nMatthew’s supplementation of Mark. Working independently but in parallel, the\nlater evangelists find different ways to accommodate the Q sequence within the\nMarkan one. Luke’s consistent grouping of items from Q may preserve their orig-\ninal connections. vii {Beelzebul controversy} and x {Jesus’ true family} create some\ncomplications, however. It is evident from Matthew that these passages belong to\nthe evangelist’s primary Markan sequence, and it is evident from Luke that they\nalso belong to the common sequence derived from Q. So we must envisage two\nindependent sequences, one from Mark, the other from Q, in both of which an\naccount of the Beelzebul controversy is followed—immediately in Mark, after\n It is therefore not a problem for the L\/M hypothesis that ‘there is no sign in Luke of the major\naddition Matthew makes to Mark at :–’ (Graham Stanton, The Four Gospels and Jesus\n[Oxford: Oxford University, ] ). Luke incorporates many Matthean additions to Mark\nbut not all (e.g. Matt .– = Luke .; Matt .– = Luke .–; Matt .– =\nLuke .–).\n Against Kloppenborg, the L\/M hypothesis does not find it ‘difficult to account for the fact that\nLuke’s placement of the double tradition differs almost entirely from that of Matthew’\n(Excavating Q, ). Once this placement is adequately investigated, its logic is straightforward.\nQ as Hypothesis \nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\nintervening material in Q—by an incident in which a reference to Jesus’mother or\nfamily provokes him to utter a saying commending those who observe the will or\nword of God. Since Matthew reproduces the Mark version here, the Lukan version\nof x {Jesus’ true family} probably derives from Q.\nThus Matthew has at his disposal two otherwise different sequences, derived\nfrom Mark and Q, which coincide at two points. These points occur late in the Q\nsequence, early in the Markan one, and the evangelist uses them to create a junc-\nture at which the two sequences merge into one. That is why Matthew’s Q\nmaterial has to occur so early in relation to Mark. The construction of Matthew\n– in its entirety is shaped by the decision that the two sequences should\nmeet and merge at their otherwise inconspicuous points of coincidence. This\nredactional decision is, however, the product of the Q hypothesis itself.\nMatthew expands Mark’s account of the Beelzebul controversy, as he expands\nother Markan controversy stories, but there is little in the Matthean text itself to\nsuggest that the evangelist has at his disposal a second version of the entire\nstory. The hypothetical Q version of the story is the product of Luke’s unusual\nproximity here to Matthew rather than Mark, interpreted on the assumption\nthat Luke cannot be dependent on Matthew. The proximity is such that, if one\nevangelist cannot be dependent on the other, a common source is the only\noption. But it remains a challenge for the Q hypothesis to show why its own con-\nsequent redactional procedure is more plausible than the straightforward one\nentailed in the L\/M hypothesis. The claim that the L\/M hypothesis must attribute\nto Luke a patently incredible redactional procedure has turned out to be prema-\nture, to say the least.\nIt is not my concern here to adjudicate between the Q and L\/M hypotheses.\nThe aim is methodological: to show the importance of systematic attention to\nthe redactional procedures entailed in competing source-critical hypotheses. In\nthe case of Q, refutation of the L\/M hypothesis is a prerequisite, and a full analysis\nof the redactional procedure consequent upon both hypotheses is therefore indis-\npensable for the critical assessment of Q itself. Anyone concerned to verify Q,\n This is acknowledged as a possibility in Critical Edition, . If Luke .– is not drawn\nfrom Q, independent redaction has coincidentally attached parallel passages from different\nsources to ix Return of unclean spirit (Q).\n The existence of a ‘doublet’ (Matt .– = .–) might be taken as an indication that the\nevangelist draws on a non-Markan as well as a Markan version of this story. Matt .– falls\noutside both the Markan and the Q sequences; on the other hand, it corresponds closely to the\nopening of Luke’s (single) version of the story (Luke .–), and could therefore derive\nfrom Q. The majority of Matthew’s doublets do not easily fit the ‘two source’ model,\nhowever, and the duplication is often the work of the evangelist himself. See the examples\nassembled in Sir John Hawkins, Horae Synopticae (Oxford: Oxford University, nd ed. )\n–.\n F RANC I S WATSON\nhttp:\/\/journals.cambridge.org Downloaded: 21 May 2010 IP address: 129.234.252.66\nrather than merely assuming it on the basis of traditional ad hoc arguments, must\nengage seriously with the major alternative.\nOnce an overview of the relevant redactional procedures has been achieved, it\nmay then be possible to identify decisive points that tell against one hypothesis\nand in favour of another. Some potential candidates for this role may have\ncome to light in the course of this study. Yet the moral of the story of Q research\nis that supposedly decisive points have been too readily accepted as such, passing\ninto wider circulation without consideration of the wider framework within which\nthey must be either verified or falsified. That is a pitfall to be avoided, whether in\nreaffirming Q or in dispensing with it.\n Neglect of this methodological point may be traced back to the very roots of the Q hypothesis.\nQ in its modern form originated in Weisse’s extension to Luke of Schleiermacher’s logia\nsource, which had been derived exclusively from Matthew (F. D. E. Schleiermacher, ‘Ueber\ndie Zeugnisse des Papias von unsern beiden ersten Evangelien’, ThStKr [] –;\nChristian Hermann Weisse, Die evangelische Geschichte kritisch und philosophisch bearbeitet\n[ vols.; Leipzig: Breitkopf & Härtel, ] .). Weisse makes the simple observation that\nmuch of the material in Schleiermacher’s logia recurs in Luke, who is therefore dependent\non the same source as Matthew (.). What is at issue is therefore not the existence of the\nsource (which Weisse like Schleiermacher believes is attested by Papias), but rather its\nscope. Support for the claim that two earlier sources underlie both Matthew and Luke is\nfound in the ‘doublets’ in both (.–). Thus Weisse is led to the conclusion that ‘[n]icht\nnur Marcus ist beiden gemeinschaftliche Quelle, sondern, unserer bestimmtesten\nUeberzeugung nach, auch die Spruchsammlung des Matthäus’ (.). It is taken for granted\nthat Luke is ‘völlig unabhängig’ of Matthew (.), and the importance of demonstrating\nthis independence is overlooked.\nQ as Hypothesis \n"}