{"doi":"10.1049\/cp.2009.0029","coreId":"68025","oai":"oai:eprints.lancs.ac.uk:33807","identifiers":["oai:eprints.lancs.ac.uk:33807","10.1049\/cp.2009.0029"],"title":"Advances in ionospheric propagation modelling at high-latitudes","authors":["Ritchie, S.E.","Honary, F."],"enrichments":{"references":[{"id":843907,"title":"A HF ionospheric propagation model using analytic ray tracing”,","authors":[],"date":"1995","doi":null,"raw":"[9]  R.J. Norman, I.G. Platt, P.S. Cannon, “A HF ionospheric propagation  model  using  analytic  ray  tracing”,  IEE Colloquium on HF Antennas and Propagation, pp. 8\/1 – 8\/6, 14 Nov (1995) [10] I. Tsagouri, Zolesi, B., Belehaki, A., and Cander, L.R. “Evaluation of the performance of the real-time updated simplified ionospheric regional model for the European area.”,  Journal  of  Atmospheric  and  Solar-Terrestrial Physics,  67, 1137-1146 (2005).","cites":null},{"id":844382,"title":"Dynamic management of HF communication and broadcasting systems”, IEE Colloquium on Frequency Selection and Management Techniques for HF Communications, pp 18\/1 – 18\/05","authors":[],"date":"1999","doi":null,"raw":"[13]  J.M  Goodman,  and  J.W.  Ballard,  “Dynamic management  of  HF  communication  and  broadcasting systems”, IEE Colloquium on Frequency Selection and Management  Techniques  for  HF  Communications,  pp 18\/1 – 18\/05 (1999) [14]  B.  Lundborg,  M.  Bröms  and  H.  Derblom,  “Oblique sounding  of  an  auroral  ionospheric  HF  channel”, Journal of Atmospheric and Terrestrial Physics, 57, No 1, 51 – 63 (1995) [15]  ISGI,  “Service  International  des  Indices Geomagnetiques”,  Bureau  des  publications  du  SIIG, http:\/\/isgi.cetp.ipsl.fr\/lesdonne.htm, 23 March (2008) [16]  T.  Kikuchi,  H.  Yamagishi,  “Latitudinal  features  of cosmic  noise  absorption  at  the  time  of  SSC-triggered substorm  a  observed  with  scanning  beam  riometer”, Proceedings  of  the  NIPR  symposium  on  upper atmospheric physics, 2, 9-14 (1989) [17] S.E. Ritchie, and F. Honary, “Observed characteristics of sudden  commencement  absorption”,  Journal  of Atmospheric  and  Solar-Terrestrial  Physics, doi:10.1016\/j.jastp.2008.11.011,  Article  in  press, (2009a) [18]  J.K. Hargreaves, “Auroral absorption of HF radio waves in  the  ionosphere:  A  review  of  results  from  the  first decade  of  riometry”,  Proceedings  of  the  IEEE,  57, 1348–1373 (1969) [19]  E. C. Stone, A. M. Frandsen, R. A. Mewaldt, E. R. , Christian,  D.  Margolies,  J.  F.  Ormes,  F.  Snow.  “The Advanced  Composition  Explorer”,  Space  Science Reviews, 86, Issue 1\/4, pp. 1-22 (1998).","cites":null},{"id":843281,"title":"High frequency radio communications with emphasis on polar problems”, AGARDograph 104,","authors":[],"date":"1967","doi":null,"raw":"[1]  F.  Leid,  “High  frequency  radio  communications  with emphasis  on  polar  problems”,  AGARDograph  104, Technivision, Maidenhead, UK (1967) [2]  J.M.  Goodman,  “HF  Communications:  Science  and Technology”,  Van  Nostrand  Reinhold,  New  York (1991).","cites":null},{"id":843449,"title":"Ionospheric Radio”,","authors":[],"date":"1990","doi":null,"raw":"[3]  K.  Davies,  “Ionospheric  Radio”,  IEE  Electromagnetic Wave Series, Vol 31, Peter Peregrinus Ltd, Institute of Engineers, London, 1990.","cites":null},{"id":844178,"title":"Modelling uncertainty in a real-time model (nowcast) of the ionosphere”,","authors":[],"date":"2008","doi":null,"raw":"[11] R. Gardiner-Garden, A. Heitmann, B. Northey and M. Turley,    “Modelling  uncertainty  in  a  real-time  model (nowcast)  of  the  ionosphere”,  12th  International Ionospheric  Effects  Symposium,  IES2008,  13-15  May (2008) [12]  B.Zolesi, Belehaki, A., Tsagouri, I., and Cander,  L.R. “Real-time  updating  of  the  Simplified  Ionospheric Regional  Model  for  operational  applications”,  Radio Science, 39, 2, (2004).","cites":null},{"id":844634,"title":"Precipitation patterns in the Arctic ionosphere determined from airborne observations”,","authors":[],"date":"1972","doi":null,"raw":"[20] J. Buchau, G.J. Gasman, C.P. Pike, R.A. Wagner and J.A.  Whalen,  “Precipitation  patterns  in  the  Arctic ionosphere  determined  from  airborne  observations”, Annales de Geophysique, 28, 443-453 (1972) [21] J.D. Whitehead, “Production and prediction of sporadic E”, Review of Geophysical Space Physics, 8, 1, 65-144 (1970) [22]  J.A  Whalen,  J.  Buchau  and  R.A.  Wagner,  “Airborne ionospheric  and  optical  measurements  of  noontime aurora”,  Journal  of  Atmospheric  and  Terrestrial Physics, 33, 661 (1971) [23]  R.A.  Wagner,  A.  L.  Snyder  and  S.  -I.  Akasofu,  “The structure  of  the  polar  ionosphere  during  exceptionally quiet  periods”,  Planetary  and  Space  Science,  21,  11, 1911-1916 (1973) [24]  N.  Naridner,  I.  Steen  Mikkelsen  and  T.  Stockflet Jørgensen,  “On  the  formation  of  high  latitude  Eslayers”, Journal of Atmospheric and Terrestrial Physics, 42, 841 – 852 (1980) [25] S.E.Ritchie, and F. Honary, “Case studies of enhanced Elayer  formation  at  high-latitudes  following  Sudden Commencement  Absorption  events”,  The  10 th  IET international conference on Ionospheric Radio Systems and Techniques, 18-21 July, London, UK (2006) [26] W.R. Piggott, K. Rawer, “URSI handbook of ionogram interpretation and reduction”, 2nd Edition, Report UAG23, World Data Centre A  for solar terrestrial physics, NOAA, Boulder, Colorado, (1972) FoE to 1Hr -2 MHz -1 MHz 0 MHz 1 MHz 2 MHz 3 MHz 4 MHz 1Hr to 2Hr -3 -2 -1 0 1 2 3 4 -3 -2 -1 -3 -2 -1 0 1 2 3 4 -3 -2 -1 Sector A B C D Count C h ang e of Crit ic al Freq u ency (MHz) -2.0 -1.8 -1.6 -1.4 -1.2 -1.0 -0.8 -0.6 -0.4 -0.2 0.0 0.2 0.4 0.6 0.8 1.0 1.2 1.4 1.6 1.8 2.0 2.2 2.4 Sector A B C D Count C h ang e of Crit ic al Freq u ency (MHz) -2.0 -1.8 -1.6 -1.4 -1.2 -1.0 -0.8 -0.6 -0.4 -0.2","cites":null},{"id":843865,"title":"Survey of polar and auroral region effects on HF propagation”,","authors":[],"date":"1969","doi":"10.1029\/RS004i004p00347","raw":"[4]  R.D. Hunsucker, and H.F. Bates, “Survey of polar and auroral  region  effects  on  HF  propagation”,  Radio Science, 4, No. 4, 347-365 (1969) [5]  R.D.  Hunsucker,  and  J.K.  Hargreaves,  “The  high latitude ionosphere and its effects on radio propagation”, Cambridge University Press (2003) [6]  D.V.  Blagoveshchensky,  A.S.  Kalishin  and  M.A. Sergeeva, “Space weather effects on radio propagation: Study of the  CEDAR, GEM and ISTP storm events”, Annales Geophysicae, 26, 1479-1490 (2008) [7]  M.  Bröms  and  B.  Lundborg,  “Results  from  Swedish oblique  sounding  campaigns”,  Annali  di  Geofisica, XXXVII, N.2 (1994) [8]  R.I.  Barnes,  R.  S.  Gardiner-Garden  and  T.  J.  Harris, “Real  time  ionospheric  models  for  the  Australian Defence  Force”,  Proceedings  of  a  Workshop  on  the Applications of Radio Science, La Trobe University, 27-29 April (2000).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-04-28","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68025.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/33807\/1\/inproc_608.pdf","pdfHashValue":"10cb8a7eb45e9cc3f9e46346bb577ac8ca02385a","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:33807<\/identifier><datestamp>\n      2018-01-24T02:17:07Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Advances in ionospheric propagation modelling at high-latitudes<\/dc:title><dc:creator>\n        Ritchie, S.E.<\/dc:creator><dc:creator>\n        Honary, F.<\/dc:creator><dc:date>\n        2009-04-28<\/dc:date><dc:type>\n        Contribution to Conference<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/33807\/1\/inproc_608.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1049\/cp.2009.0029<\/dc:relation><dc:identifier>\n        Ritchie, S.E. and Honary, F. (2009) Advances in ionospheric propagation modelling at high-latitudes. In: Proceedings of IET 11th International Conference on Ionospheric Radio Systems and Techniques (IRST 2009), 1900-01-01.<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/33807\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1049\/cp.2009.0029","http:\/\/eprints.lancs.ac.uk\/33807\/"],"year":2009,"topics":[],"subject":["Contribution to Conference","PeerReviewed"],"fullText":" Advances in Ionospheric Propagation Modelling at High-\nLatitudes \nS.E. Ritchie*\n†\n, F. Honary. \n†\n \n*Commission for Communications Regulation (ComReg), Irish Life Centre, \n Lower Abbey Street, Dublin 2, Ireland  \nEmail:  s.ritchie@lancaster.ac.uk \n \n†Department of Communication Systems, University of Lancaster, \nLancaster, LA1 4W4, UK  \nEmail:  f.honary@lancaster.ac.uk \n \n \nKeywords: Ionosphere, High-latitude, Modelling. \nAbstract \nMany services rely on the output of propagation planning \ntools to predict the future state of the ionosphere and the \navailability of suitable communications channels.  While this \napproach is adequate for services operating at high-latitudes \nduring quiet ionospheric conditions it is insufficient to deal \nwith a disturbed ionosphere.  This paper presents the results \nof empirical modelling of the changes that occur in the D- and \nE-regions of the ionosphere following the onset of disturbed \nconditions as defined by the occurrence of a storm sudden \ncommencement. \n \n1 Introduction \nThe use of HF communications at high latitudes still forms \nthe back bone of many communications systems.  At high \nlatitudes there are few alternatives to HF radio for the \nmerchant and fishing fleets, military forces (land, sea and air) \nand for the civil aviation industry.  The typical features of HF \nradio communications following magnetic disturbances \ninclude: the incidence of large absorption spikes, changes in \npropagation modes, reductions in operational frequencies as \nelectron density in the F-region changes and a growth in \nauroral absorption.  Ionospheric propagation during magnetic \ndisturbances at these latitudes has been an enigma, in part \nbecause ionograms do not always provide analysable data due \nto absorption, blanketing and spread-F effects.   \n \nNumerous studies of the high-latitude ionosphere have been \nundertaken to aid in understanding the response of the HF \ncommunication channel to space weather effects.  A review of \nboth effects and the associated problems, with many \nreferences, is provided in [1, 2, 3, 4] and [5].  More recently \nthe impact of 14 geomagnetic storms, which occurred during \n1997-1999, on radio propagation conditions, was examined \n[6].   \n \n1.1 HF Propagation Prediction. \nThe validity of using HF propagation prediction programs has \nbeen addressed [7] and good agreement between the \nprediction and measurements made during quiet conditions \nhas been found.  It has also been noted the aggregate correct \nprediction of these programs was only ~ 45% under disturbed \nconditions [5]. \n \nThe use of propagation prediction programs to establish, in \nadvance, the choice of operating frequency is still the basis of \noperations of many communication systems. For example HF \nbroadcasting requires frequencies and schedules to be agreed \nmonths in advance of actual usage and military exercises at \nhigh-latitudes are preceded by detailed advance planning and \nthe distribution of set tables of frequencies well in advance.  It \nappears that this methodology of advance planning and the \nrange of hourly median parameters produced by the \npropagation prediction programs is adequate for operational \npurposes, during quiet conditions.  The problem to be \novercome is to determine what propagation parameters need \nto be modified during disturbed conditions, that is, what \nconsequential modifications need to be made to the \ncommunications system parameters to ensure some form of \ncontinued operation during disturbed conditions.   \n \nFrom an operational point of view a technique is needed to \naddress the uncertainties generated by ionospheric \ndisturbances on key ionospheric parameters and a number of \nauthors have examined this problem (e.g. [8, 9, 10 and 11]).  \nA number of authors have also proposed the use of oblique \nand vertical sounding data to provide near real-time \nionospheric maps and communication performance \nparameters; e.g. [12 and 13].  Certainly while each of these \napproaches has different applications and merits, the authors \nhave chosen another approach. \n \nThe authors‟ approach is that advocated by Lundborg et al \n[14] – “It seems that priority should be given to the \ndevelopment of propagation prediction\n1\n methods which \npredict the deviation from the median rather than the \nmedian”.   \n \nWhat is missing is the defining point at which the deviation \nfrom the median starts.  The authors have used the storm \nsudden commencement (SSC) as this defining point.    \n1.2 Storm Sudden Commencement. \nCoronal mass ejections from the Sun give raise to shock \nwaves in the solar wind. The related pressure pulses, when \nimpinging on the earth's magnetosphere, both compress it and \nincrease the magnetopause current. This leads into a few tens \nof nano-Tesla (nT) change in the low-latitude ground-based \nmagnetic field intensity, lasting typically for some tens of \nminutes. These signatures are called Storm Sudden \nCommencements (SSC) and announce the onset of \ngeomagnetic storm and subsequently identify the start of a \nperiod of change in composition of the ionosphere, such as \nreconfiguration of the magnetosphere, injection of particles \ninto the radiation belts, changes of particle drift velocities, \nsudden onsets of wave activities etc.   \n \nThe advantages of using SSC events as the point of origin is \ntwo fold.  Firstly, the occurrence and timing of an SSC is \ninternationally agreed [15] and therefore a very useful \nreference point when comparing results from a number of \ndifferent instruments in different locations.  Secondly, the \nSSC identifies the start of the change of composition of the \nionosphere with associated energetic particle precipitation – \nthat is the transition point between a „quiet‟ and a „disturbed‟ \nionosphere.   \n \n2 Modelling Changes in the D-region \nThe first manifestation, coincident with the SSC is a large \nabsorption spike, known as sudden commencement \nabsorption (SCA), lasting tens of minutes that disrupts low to \nmid HF frequency operations.  The cause of this affect is the \nsudden increase of electron density in the D-layer due to \ndeeply penetrating charged particles [16]. \n \nIn a recent paper [17] the authors set out to find the best \npredictor of SCA based on solar wind parameters.  The \nauthors examined the characteristics of SCA across more than \nhalf a solar cycle, from the sunspot maximum in 2000 to the \nnear sunspot minimum in 2006.  Having discounted \nambiguous events, 175 SSC events and the co-incident SCA \nwere investigated. \n2.1 Data. \nFor each of the 175 events data from the IRIS Riometer at \nKilpisjärvi (69.10N, 20.80E, L=6.06) was used to measure the \npeak absorption resulting from particle precipitation caused \n                                                          \n1\n The italic text has been inserted by the authors to clarify the context of the \nquote \nby SSC shocks.   In essence a riometer observes temporal \nvariations in ionisation in the D and E regions caused by \ncharged particle precipitation [18].  An example of such an \nabsorption signature following a SSC event at 14:10 UT on 3 \nApril 2004, is shown in figure 1.   \n \n \n \nFigure 1:  Riometer measurement from the central beam of \nthe IRIS riometer - 1 minute resolution sampling.  \nThe SSC occurred at 14:10 UT which is indicated \nby the long-dashed line.  The peak SCA measured \nin this example is indicated by the dotted line. \n \nBefore the SSC the absorption was negligible.  At the start of \nthe SSC the absorption increases within 5 minutes to 0.8 dB, \npeaking at 0.85 dB ten minutes after the SSC event \ncommences.  Fifteen minutes after the peak the absorption \nfalls to less than 0.2 dB with some variability thereafter due to \nsubsequent magnetospheric activity. \n \nSolar wind and IMF Data for this study was sourced from \nmeasurements taken by the ACE spacecraft.  See [19] for \ndetails of the satellite and instrumentation.  For each SSC \nevent the following solar wind parameters were measured \nbefore and after the SSC: \n \n B – the IMF field strength (nT) \n Bz – the magnitude and direction of the Bz component of \nthe solar wind (nT) \n Vp - solar wind proton velocity (km.s\n-1\n) \n Np – solar wind proton density (cm\n-3\n) \n \n2.2 Results. \nAs the data spans more than half a solar cycle it was possible \nto determine if solar activity influenced the data set.  This was \ndone by evaluating the link between SCA and the change in \nIMF magnitude against solar activity as reflected by the value \nof the relevant monthly sunspot number.  Across a range of \nmonthly sunspot number from 8 to 170 it was concluded that \nthat there is no causal link between SCA and sunspot number \nor between IMF magnitude and SCA, other than in the \nfrequency of occurrence of SSC events.  This last point is not \nunexpected as higher sunspot levels reflect the increase in the \nnumber of active regions on the sun that are the source of \nshocks leading to SSC events. \n \nHaving calculated and compared the median, median and \nstandard deviation of SCA between the day (6-18 MLT) and \nthe night (18-6 MLT) it was shown that  while the occurrence \nof SCA is slightly greater during the day there is no \nsignificant difference in the mean, median or standard \ndeviation values of SCA between night and day.   \n \nFor all events where Bz information was available (152 \nevents) the mean, median and standard deviation of SCA for \nall the possible Bz movements (e.g. north to south, north to \nfurther north, etc) were compared against each other.  The \nsimilarity in statistics between all four types of event \nindicates that the direction of Bz has little impact on the \ntypical values of SCA, for example, more than half of the \nselected SCA events occurred during northward Bz \nmovements, which in some cases continued even more \nstrongly northward after the SSC event.   \n \n2.2 Modelling of SCA  \nHaving determined that there is no causal link between SCA \nand sunspot number, no causal link between IMF magnitude \nand SCA, no significant difference in night time and day time \nSCA and that Bz has little impact on the typical values of \nSCA the best predicator of  SCA was sought.   The method \nused was to find the best predictor of SCA based on one or \nmore solar wind parameters in order to clarify the affect of \nsolar wind and IMF shocks on SCA.  In order to do this a \nsubstantial body of work was undertaken to correlate each of \nthe parameters B, Bz, Vp and Np with the absolute, average \nand median values of SCA measured at the moment of SSC.   \n \nThe best results were achieved when using the median value \nof measured SCA.  The median value is a measure of central \ntendency that provides us with a description of the entire data \nset and is especially useful when data sets contain a few \nextremely high values that can skew the distribution, as is the \ncase here.  The median is less sensitive to extreme values and \nis an appropriate measure when dealing with the highly \nvariable ionosphere and magnetosphere.  It is for similar \nreasons and also convenient that hourly median values are the \nstandard output from HF propagation prediction programmes \nand using median values of SCA allows comparisons to be \nmade against predicted median values of absorption.   \n \nFigure 2 consists of four panels showing the median value of \nSCA compared against the step change in IMF and solar wind \nparameters at the moment of SSC; (ΔB) (top panel), solar \nwind velocity (ΔVp) (second panel) and solar wind particle \ndensity (ΔNp) (bottom panel).  A first order regression is \napplied to the last scatter plot and a second order regression is \napplied to the first two scatter plots.  The choice of only a first \norder regression for the last plot was determined by the wide \nspread of values in the data.  Figure 2 demonstrates the strong \ncorrelation between solar wind velocity and SCA but also the \neven stronger correlation between the IMF and SCA.   \n \n \n \nFigure 2:  Scatter plot and regression of median SCA vs. \n(from top to bottom) ΔB, ΔVp and ΔNp  \n \nBy a wide margin, the strongest correlation was found \nbetween the median value of SCA measured and ΔB, the step \nchange in IMF magnitude that occurred during the shock.  \nThe fitted curve in the top panel of figure 2, with a correlation \ncoefficient (R\n2\n) of 0.852, is a second order equation of the \nform:   \n2\nA 0.32 0.07 B 0.0077 Bm  \n  \nWhere: Am   =  the median value of SCA expected \n  ΔB =  the change in IMF due to the shock \n      \nThe fit for ΔB against median SCA is very good at values of \nΔB < 25 nT, reducing somewhat at values of ΔB > 25 nT.  \nWhile this does bear further investigation less than 3% of \nSSC shocks in the data, that is ~ 5 events in a six year period \ngenerate a change in IMF magnitude greater than 25 nT. \n \nThis result has a direct application to real-time and near-time \nionospheric propagation prediction in respect of the predicted \nchange in median value of absorption following a disturbance \nthe D-region. \n \n \n \n \n3 Modelling Changes in the E-region \nSporadic-E (Es) is a problem in high latitude HF \ncommunications because of its irregular and as yet \nunpredictable behaviour.  Es has different characteristics in \ndifferent latitudinal zones and there may be several \nmechanisms governing the behaviour of these layers.  The \nhigh latitude Es layers are generally considered to be due to \nparticle precipitation [20, 21, 22, 23].  It has been found that \nelectron precipitation usually is the major cause for the \nformation of the high latitude sporadic E-layer and that the \nmodified wind shear mechanism, which takes into account the \neffect of electric fields, is important under low electron \nprecipitation conditions only, i.e. „quiet‟ conditions [24]. \n \nIn the three to five hours following the onset of geomagnetic \nactivity the ionospheric path is characterised by changes in \nthe mode of propagation.  This is caused by an enhanced \nsporadic-E layer overshadowing the usual F-layer propagation \npaths [25].  These sporadic-E paths are known to be able to \nsupport HF communications during ionospheric storm periods \nand this section presents the results of research that has \nempirically modelled the deviations from the predicated \nmedian of f0Es following the onset of an ionospheric storm \nand provides guidance to HF communications operators for \nmaintaining link establishment. \n \n3.1 Data. \nThe data used in this section is gathered from f-plots \ngenerated at the Sodankylä observatory which is located 120 \nkm north of the Arctic Circle in Finland,  67° 22′ N, 26° 38′ \nE, L-value 5.2.  Data for this research work was gathered over \nsix years from the sunspot minimum in 2000 until the near \nsunspot maximum in 2006. \n \nThe f-plot is a daily graph of the frequency characteristics of \nall the daily ionograms as a function of time, using an \ninternationally agreed convention, so that detailed \nobservations from different stations may be compared \nefficiently.  The f-plot provides a summary of the original \nobservations with the minimum of interpretation and enables \ndifficult decisions needed for hourly tabulations to be made \nwith due consideration of all the available data.  This is \nparticularly important at high latitude stations were blackouts, \nspread echoes or rapidly changing oblique reflections \nfrequently prevent the normal characteristics from being \nobserved on individual hourly ionogram records.  Figure 3 is \nan example of an f-plot used in this analysis. \n \nIt has been acknowledged that the f-plot is a valuable tool for \nidentifying variations in the ionosphere, in the interpretation \nof complex records, particularly at high latitudes and it has \nbecome a primary tool for analysing the hour-to-hour or day-\nto-day changes in the ionosphere [26]. \n \n \nFigure 3:  Example of an f-plot - the arrow at 18:50 MLT \nindicates the occurrence time of the SSC. \n \nThe starting point for this study is again the occurrence of an \nSSC indicating the occurrence of magnetospheric changes \nand modifications to the ionosphere – that is the onset of a \ndisturbed state.   In order to collect data that captures all the \nE-layer effects which are initiated with a SSC occurring, data \nis collected for the four hours following SSC.  In order to \naccumulate an adequate number of samples the day was split \ninto four sectors. Sector A covering the period 0-6 MLT, \nsector B covering 6-12 MLT, sector C covering 12-18 MLT \nand sector D covering 18-24 MLT. \n \nFor each of the four hours following an SSC, the following \nstatistics are collected for each sector from the f-plot:  The \nmean, median, minimum, maximum, lower quartile and upper \nquartile of the change in critical frequency (ΔfoE) that occurs \nin each sector as well as the onset of screening (total \nblanketing) that occurs in each sector. \n \nThe difference in critical frequency measured on each hour \nfollowing an SSC event is used to define the variability that \noccurs.  This difference is designated in this paper as ΔfoEn-m \nwhere ΔfoE is the change in hourly E-layer critical frequency \nand n and m indicate which hour following the SSC is being \nmeasured.  These values reflect the reduction or increase in E-\nlayer ionisation due to all applicable factors.  However as \nenhanced ionisation due to particle precipitation which is by \nfar the dominant ionisation source, ΔfoEn-m captures \npredominantly the influence of particle precipitation. \n \n3.2 Results. \nThis section examines the variability of Es in the four hours \nfollowing an SSC as well as the occurrence of screening.  \nPolar plots are used in figure 4 where the radial axis is ΔfoE \nand the clock hours indicate local time.  The solid dots \nindicate where full screening of the F layers occurred.  The \nassociated line, scatter and error bar plot shows the mean \n(diamond) and median (circles) values of ΔfoEm-n per sector, \nthe 25% and 75% percentiles between vertical error bars and \nthe count of events in the lower panel.   \n \nThe statistics show considerable variation, as is expected \nwhen working with the ionosphere in general and which is \namplified when dealing with the high-latitude ionosphere.  A \nnumber of significant points are noted from examining the \nplots of figure 4.  It is noted that ΔfoE0-1 can be positive and \nnegative, this depends on whether or not storm induced \nprecipitation has commenced in this hour or not.  Full \nblanketing (screening) can occur even when ΔfoE0-1 is \nnegative.  This implies that the F-layer ionisation has \ndramatically reduced so even though the E-layer might be \npenetrated, no F-layer reflecting plane exists.  Screening can \noccur when ΔfoE0-1 is zero and this implies that F-layer \nionisation is severely reduced or particle precipitation is \nmaintaining a thick highly ionised Es-layer. \n \nIn the first hour following SSC when ΔfoE0-1   exceeds 2.1 \nMHz the onset of screening is guaranteed.  Screening occurs \nin all sectors in the first hour (ΔfoE0-1) except between 6 – 12 \nMLT (Sector B) where only one out of 33 events over a six \nyear period caused screening in the first hour.  Screening \noccurs extensively in the second hour when ΔfoE1-2 exceeds 1 \nMHz and exclusively when ΔfoE1-2 exceeds 2.1 MHz, \nidentical to what occurs in the first hour (ΔfoE0-1).    \n \nIn the third hour ΔfoE2-3  ≈ 2.1 MHz continues to be a \nmilestone indicator that guarantees screening will occur, with \nonly one exception occurring in six years of data.  The \nextensive occurrence of screening greatly increases in the \nthird hour when ΔfoE2-3 exceeds 0.5 MHz which is \nsignificantly less than in previous hours. \n \nIn the fourth hour ΔfoE3-4 ≈ 3 MHz is now a new milestone \nindicator that guarantees screening will occur.  The extensive \noccurrence of screening at negative values of ΔfoE3-4 in the \nfourth hour indicates that F-layer ionisation has dramatically \nreduced and that there is no F-layer reflecting plane even if \nthe E-layer is penetrated.  In this hour a ΔfoE3-4 ≈ 2.1 MHz \nagain provides a good threshold with screening occurring \nexclusively in sectors C and D above this level. \n \nRing currents during magnetic storms move the auroral region \n(at the pole ward boundary of the trapping region toward the \nequator.  All field lines from the auroral zone touch the outer \nboundary of the magnetosphere, thus allowing particle \ninjection.  This explains the highest ΔfoEm-n values that occur \nin sector D (18-24MLT) as sector D is when the field lines are \nopen to direct particle injection, directly opposite to sector B \n(9-12 MLT).  Sector A and Sector C have similar statistics \nand variance reflecting their intermediate position between \nsector D and sector B. \n \nIt can be seen from figure 4 that Es often fully screens the F-\nlayer leaving the operator little choice but to rely on Es layer \nreflections instead of F-layer reflections.  Noting the sector in \nwhich a SSC occurs allows the operator, using the \ninformation in figure 4, to modify the operating frequency \nestablished by standard prediction methodologies to \ncompensate for the change brought on by ionospheric \ndisturbances to the E-region.  \n4 Conclusion \nHF radiocommunications is still an essential service at high \nlatitudes even though the HF channel is adversely affected by \nthe impact of space weather.  Hence the importance of \nadvancing the prediction of propagation during disturbed \nperiods. \n \nUsing the occurrence of SSC as the defining point of the \ntransition between a „quiet‟ and „disturbed‟ ionosphere  \nensures a well defined and understood starting point from \nwhich to both gather data and predict the deviation of critical \nionospheric parameters from the expected norm following the \nonset of disturbances. \n \nThe first manifestation of an ionospheric disturbance is a \nlarge absorption spike lasting tens of minutes that disrupts \nlow to mid HF frequency operations.  The cause of this affect \nis the sudden increase of electron density in the D-layer due \nto deeply penetrating charged particles.  Research has \ndemonstrated that the amplitude of the expected absorption \nspike can be empirically determined based on IMF data.  \nDepending on solar wind velocity, this data is available 30 – \n60 minutes before the observed step-change in IMF \npropagates to the earth‟s magnetosphere. \n \nThe second manifestation of an ionospheric disturbance dealt \nwith in this paper is the formation of intense and prolonged \nEs. Sporadic-E layers are important to consider at high \nlatitudes where they modify the mode of propagation and \noften totally screen the f-layer off.   An investigation into \ndisturbances affecting the E-region has lead to the \ncharacterisation of the change in the median value of the \ncritical frequency of Es and the occurrence of fully-blanketing \nEs follow the onset of disturbances The results detail the \ndeviation of foEs (from its quiet ionosphere value) for the four \nhours immediately following the SSC.   \n \nThe approach adopted in this research is to empirically \npredict the deviation of key ionospheric parameters \n(absorption, f0E and the occurrence of E-layer screening)  \nfrom the median value as predicated by standard propagation \nprediction methodologies.  The strength of this approach is \nthat system operators can adjust for the deviation of critical \nfrequencies from the quiet-ionosphere predictive norm \nwithout the need for a supporting network of vertical and\/or \noblique sounders.    \n \nAcknowledgements \nRiometer data originated from the Imaging Riometer for \nIonospheric Studies (IRIS), operated by the Department of \nCommunications Systems at Lancaster University (UK) in \ncollaboration with the Sodankylä Geophysical Observatory, \nand funded by the Science and Technology Facilities Council \n(STFC) \n \nI acknowledge the Sodankylä Geophysical Observatory, \nFinland for use of the f-plot data. \n \nReferences \n[1] F. Leid, “High frequency radio communications with \nemphasis on polar problems”, AGARDograph 104, \nTechnivision, Maidenhead, UK (1967) \n[2] J.M. Goodman, “HF Communications: Science and \nTechnology”, Van Nostrand Reinhold, New York \n(1991). \n[3] K. Davies, “Ionospheric Radio”, IEE Electromagnetic \nWave Series, Vol 31, Peter Peregrinus Ltd, Institute of \nEngineers, London, 1990. \n[4] R.D. Hunsucker, and H.F. Bates, “Survey of polar and \nauroral region effects on HF propagation”, Radio \nScience, 4, No. 4, 347-365 (1969) \n[5] R.D. Hunsucker, and J.K. Hargreaves, “The high \nlatitude ionosphere and its effects on radio propagation”, \nCambridge University Press (2003) \n[6] D.V. Blagoveshchensky, A.S. Kalishin and M.A. \nSergeeva, “Space weather effects on radio propagation: \nStudy of the CEDAR, GEM and ISTP storm events”, \nAnnales Geophysicae, 26, 1479-1490 (2008) \n[7] M. Bröms and B. Lundborg, “Results from Swedish \noblique sounding campaigns”, Annali di Geofisica, \nXXXVII, N.2 (1994) \n[8]  R.I. Barnes, R. S. Gardiner-Garden and T. J. Harris, \n“Real time ionospheric models for the Australian \nDefence Force”, Proceedings of a Workshop on the \nApplications of Radio Science, La Trobe University, 27-\n29 April (2000). \n[9] R.J. Norman, I.G. Platt, P.S. Cannon, “A HF ionospheric \npropagation model using analytic ray tracing”, IEE \nColloquium on HF Antennas and Propagation, pp. 8\/1 – \n8\/6, 14 Nov (1995)  \n[10] I. Tsagouri, Zolesi, B., Belehaki, A., and Cander, L.R. \n“Evaluation of the performance of the real-time updated \nsimplified ionospheric regional model for the European \narea.”, Journal of Atmospheric and Solar-Terrestrial \nPhysics,  67, 1137-1146 (2005). \n[11] R. Gardiner-Garden, A. Heitmann, B. Northey and M. \nTurley,  “Modelling uncertainty in a real-time model \n(nowcast) of the ionosphere”, 12th International \nIonospheric Effects Symposium, IES2008, 13-15 May \n(2008) \n[12] B.Zolesi, Belehaki, A., Tsagouri, I., and Cander,  L.R.  \n“Real-time updating of the Simplified Ionospheric \nRegional Model for operational applications”, Radio \nScience, 39, 2, (2004). \n[13] J.M Goodman, and J.W. Ballard, “Dynamic \nmanagement of HF communication and broadcasting \nsystems”, IEE Colloquium on Frequency Selection and \nManagement Techniques for HF Communications, pp \n18\/1 – 18\/05 (1999)  \n[14] B. Lundborg, M. Bröms and H. Derblom, “Oblique \nsounding of an auroral ionospheric HF channel”, \nJournal of Atmospheric and Terrestrial Physics, 57, No \n1, 51 – 63 (1995) \n[15] ISGI, “Service International des Indices \nGeomagnetiques”, Bureau des publications du SIIG,  \nhttp:\/\/isgi.cetp.ipsl.fr\/lesdonne.htm, 23 March (2008) \n[16] T. Kikuchi, H. Yamagishi, “Latitudinal features of \ncosmic noise absorption at the time of SSC-triggered \nsubstorm a observed with scanning beam riometer”, \nProceedings of the NIPR symposium on upper \natmospheric physics, 2, 9-14 (1989) \n[17] S.E. Ritchie, and F. Honary, “Observed characteristics of \nsudden commencement absorption”, Journal of \nAtmospheric and Solar-Terrestrial Physics, \ndoi:10.1016\/j.jastp.2008.11.011, Article in press, \n(2009a) \n[18] J.K. Hargreaves, “Auroral absorption of HF radio waves \nin the ionosphere: A review of results from the first \ndecade of riometry”, Proceedings of the IEEE, 57, \n1348–1373 (1969) \n[19] E. C. Stone, A. M. Frandsen, R. A. Mewaldt, E. R. , \nChristian, D. Margolies, J. F. Ormes, F. Snow. “The \nAdvanced Composition Explorer”, Space Science \nReviews, 86, Issue 1\/4, pp. 1-22 (1998). \n[20] J. Buchau, G.J. Gasman, C.P. Pike, R.A. Wagner and \nJ.A. Whalen, “Precipitation patterns in the Arctic \nionosphere determined from airborne observations”, \nAnnales de Geophysique, 28, 443-453 (1972) \n[21] J.D. Whitehead, “Production and prediction of sporadic \nE”, Review of Geophysical Space Physics, 8, 1, 65-144 \n(1970) \n[22] J.A Whalen, J. Buchau and R.A. Wagner, “Airborne \nionospheric and optical measurements of noontime \naurora”, Journal of Atmospheric and Terrestrial \nPhysics, 33, 661 (1971) \n[23] R.A. Wagner, A. L. Snyder and S. -I. Akasofu, “The \nstructure of the polar ionosphere during exceptionally \nquiet periods”, Planetary and Space Science, 21, 11, \n1911-1916 (1973)  \n[24] N. Naridner, I. Steen Mikkelsen and T. Stockflet \nJørgensen, “On the formation of high latitude Es-\nlayers”, Journal of Atmospheric and Terrestrial Physics, \n42, 841 – 852 (1980) \n[25] S.E.Ritchie, and F. Honary, “Case studies of enhanced E-\nlayer formation at high-latitudes following Sudden \nCommencement Absorption events”, The 10th IET \ninternational conference on Ionospheric Radio Systems \nand Techniques, 18-21 July, London, UK (2006) \n[26] W.R. Piggott, K. Rawer, “URSI handbook of ionogram \ninterpretation and reduction”, 2nd Edition, Report UAG-\n23, World Data Centre A for solar terrestrial physics, \nNOAA, Boulder, Colorado, (1972) \n \n \n \n \n \n \nFoE to 1Hr\n-2 MHz\n-1 MHz\n0 MHz\n1 MHz\n2 MHz\n3 MHz\n4 MHz\n0\n2\n4\n6\n8\n10\n12\n14\n16\n18\n20\n22\n1Hr to 2Hr\n-3 -2 -1 0 1 2 3 4\n-3\n-2\n-1\n0\n1\n2\n3\n4\n-2-101234\n-2\n-1\n0\n1\n2\n3\n4\n0\n2\n4\n6\n8\n10\n12\n14\n16\n18\n20\n22\nSector\nA B C D\nC\no\nu\nn\nt\n15\n30\n45\n60\nC\nh\nan\ng\ne \no\nf \nC\nri\nti\nca\nl \nF\nre\nq\nu\nen\ncy\n(M\nH\nz)\n-2.0\n-1.8\n-1.6\n-1.4\n-1.2\n-1.0\n-0.8\n-0.6\n-0.4\n-0.2\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n1.4\n1.6\n1.8\n2.0\n2.2\n2.4\nSector\nA B C D\nC\no\nu\nn\nt\n15\n30\n45\n60\nC\nh\nan\ng\ne \no\nf \nC\nri\nti\nca\nl \nF\nre\nq\nu\nen\ncy\n(M\nH\nz)\n-2.0\n-1.8\n-1.6\n-1.4\n-1.2\n-1.0\n-0.8\n-0.6\n-0.4\n-0.2\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n1.4\n1.6\n1.8\n2.0\n2.2\n \n \n \nFigure 4  Polar plot – the radial axis is ΔfoE and the clock hours indicate local time.  The solid dots indicate where full \nscreening of the F layers occurred.  The associated line, scatter and error bar plot shows the mean (diamond) and median \n(circles) values of ΔfoEm-n per sector, the 25% and 75% percentiles between vertical error bars and the count of events in the \nlower panel. \n \nSector\nA B C D\nC\no\nu\nn\nt\n15\n30\n45\n60\nC\nh\nan\ng\ne \no\nf \nC\nri\nti\nca\nl \nF\nre\nq\nu\nen\ncy\n(M\nH\nz)\n-2.0\n-1.8\n-1.6\n-1.4\n-1.2\n-1.0\n-0.8\n-0.6\n-0.4\n-0.2\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n1.4\n1.6\n1.8\n2.0\n2.2\n3HR to 4HR\n-6 M\n-3 M\n0 M\n3 M\n6 M\n9 M\n0\n2\n4\n6\n8\n10\n12\n14\n16\n18\n20\n22\n2hr to 3hr\n-2 MHz 0 MHz\n2 MHz 4 MHz\n6 MHz\n0\n2\n4\n6\n8\n10\n12\n14\n16\n18\n20\n22\nSector\nA B C D\nC\no\nu\nn\nt\n15\n30\n45\n60\nC\nh\nan\ng\ne \no\nf \nC\nri\nti\nca\nl \nF\nre\nq\nu\nen\ncy\n(M\nH\nz)\n-2.0\n-1.8\n-1.6\n-1.4\n-1.2\n-1.0\n-0.8\n-0.6\n-0.4\n-0.2\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n1.4\n1.6\n1.8\n2.0\n2.2\n"}