{"doi":"10.1177\/1744987110380335","coreId":"15429","oai":"oai:dro.dur.ac.uk.OAI2:7390","identifiers":["oai:dro.dur.ac.uk.OAI2:7390","10.1177\/1744987110380335"],"title":"Developing workable research methods : lessons from a pilot study with vulnerable participants and complex assessments.","authors":["Jones, S.E.","Hamilton, S.","Perry, L.","O'Malley, C.","Halton, C."],"enrichments":{"references":[{"id":966291,"title":"A","authors":[],"date":"2010","doi":null,"raw":null,"cites":null},{"id":954374,"title":"A randomised controlled single-blind trial of nutritional supplementation after stroke.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":966294,"title":"Acute ischemic stroke: imaging-guided tenecteplase treatment in an extended time window.","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":966297,"title":"An exploration of nutrition and eating disabilities in relation to quality of life at 6 months post stroke.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":954373,"title":"CM (1998a) Influence of nutritional status on clinical outcome after acute stroke.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":954372,"title":"Collaboration","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":966293,"title":"Detecting psychiatric morbidity after stroke:","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":966295,"title":"Eating and dietary intake in communication-impaired stroke survivors: a cohort study from acute-stage hospital admission to 6 months post-stroke.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":966296,"title":"Eating difficulties after stroke.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":954366,"title":"Effect of malnutrition after acute stroke on clinical outcome.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":954365,"title":"Framework for design and evaluation of complex interventions to improve health.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":966292,"title":"Gustatory disturbance of cerebrovascular disorder.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":964574,"title":"Hospital Anxiety and Depression Scale.","authors":[],"date":"1983","doi":"10.1111\/j.1600-0447.1983.tb09716.x","raw":null,"cites":null},{"id":954367,"title":"Impaired sensory functioning in elders.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":966288,"title":"Measurement of eating disability in an acute stroke population.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":954371,"title":"Mini-mental state&quot;: a practical method for grading the cognitive state of patients for the clinician.","authors":[],"date":"1975","doi":null,"raw":null,"cites":null},{"id":950391,"title":"Prevalence of malnutrition and inadequate food intake in self-feeding rehabilitation patients with stroke.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":954368,"title":"Progress in improving stroke care. London: National Audit Office.","authors":[],"date":"2010","doi":null,"raw":null,"cites":null},{"id":954369,"title":"Prolonged length of stay and reduced functional improvement rate in malnourished stroke rehabilitation patients.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":966290,"title":"Quantitative assessment of gustatory function in a clinical context using impregnated “taste strips”,","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":964572,"title":"Recruitment and Retention of Stroke Survivors: the CAReS Experience.","authors":[],"date":"2006","doi":"10.1300\/J148v25n01_02","raw":null,"cites":null},{"id":964570,"title":"Research Networks: Do they perform for industry sponsor trials? Presentations from Capacity, Consent and Stroke Research,","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":964571,"title":"Taste and smell perception affects appetite and immunity on the elderly.","authors":[],"date":"2000","doi":"10.1038\/sj.ejcn.1601026","raw":null,"cites":null},{"id":966289,"title":"The CONSORT statement: revised recommendations for improving the quality of reports of parallel-group randomised trials.","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":950392,"title":"The frequency, causes and timing of death within 30 days of a first stroke: the Oxfordshire Community Stroke Project.","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":964573,"title":"The Oxfordshire Community Stroke Project classification in the early hours of ischaemic stroke and relation to infarct site and size on cranial computed tomography.","authors":[],"date":"2001","doi":"10.1053\/jscd.2001.29825","raw":null,"cites":null},{"id":954370,"title":"Weight reduction due to strokeinduced dysgeusia.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-07","abstract":"Following acute stroke, deterioration in nutritional status and weight loss is common; few studies have investigated this, perhaps due to difficulties with recruitment and completion of complex assessments with stroke patients. This study reports the feasibility of a study protocol to determine predictors of nutritional intake in stroke patients. The aim of the study was to test the feasibility of a protocol to measure taste and smell function, and explore links with dietary intake following stroke. Patients were recruited from one Acute Stroke Unit in 2007\/8. Data were collected at three time-points and entailed standardised validated assessments of taste and smell function, diet, appetite and mood state. Recruitment of this vulnerable population to a demanding assessment schedule was challenging. Of a cohort of 166 admissions, six were recruited and complete data collected from four participants. Slow recruitment was largely due to exacting inclusion criteria and rapid hospital discharge. Those who completed all assessments reported the schedule as tolerable and acceptable. This study illustrated the difficulties of recruiting this vulnerable population. Identification of reasons for slow recruitment facilitated development of measures to address them. It was possible to format a complex and lengthy assessment schedule to be acceptable to vulnerable participants","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15429.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7390\/1\/7390.pdf","pdfHashValue":"5b2fbffff0c15ea0dfc69952fc59d7547ae5705b","publisher":"Sage","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7390<\/identifier><datestamp>\n      2012-01-19T15:37:14Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Developing workable research methods : lessons from a pilot study with vulnerable participants and complex assessments.<\/dc:title><dc:creator>\n        Jones, S.E.<\/dc:creator><dc:creator>\n        Hamilton, S.<\/dc:creator><dc:creator>\n        Perry, L.<\/dc:creator><dc:creator>\n        O'Malley, C.<\/dc:creator><dc:creator>\n        Halton, C.<\/dc:creator><dc:description>\n        Following acute stroke, deterioration in nutritional status and weight loss is common; few studies have investigated this, perhaps due to difficulties with recruitment and completion of complex assessments with stroke patients. This study reports the feasibility of a study protocol to determine predictors of nutritional intake in stroke patients. The aim of the study was to test the feasibility of a protocol to measure taste and smell function, and explore links with dietary intake following stroke. Patients were recruited from one Acute Stroke Unit in 2007\/8. Data were collected at three time-points and entailed standardised validated assessments of taste and smell function, diet, appetite and mood state. Recruitment of this vulnerable population to a demanding assessment schedule was challenging. Of a cohort of 166 admissions, six were recruited and complete data collected from four participants. Slow recruitment was largely due to exacting inclusion criteria and rapid hospital discharge. Those who completed all assessments reported the schedule as tolerable and acceptable. This study illustrated the difficulties of recruiting this vulnerable population. Identification of reasons for slow recruitment facilitated development of measures to address them. It was possible to format a complex and lengthy assessment schedule to be acceptable to vulnerable participants. <\/dc:description><dc:publisher>\n        Sage<\/dc:publisher><dc:source>\n        Journal of research in nursing, 2011, Vol.16(4), pp.307-318 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2011-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7390<\/dc:identifier><dc:identifier>\n        issn:1744-9871<\/dc:identifier><dc:identifier>\n        issn: 1744-988X<\/dc:identifier><dc:identifier>\n        doi:10.1177\/1744987110380335<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7390\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1177\/1744987110380335<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7390\/1\/7390.pdf<\/dc:identifier><dc:rights>\n        The final definitive version of this article has been published in the Journal Journal of research in nursing 16\/4 2011 © SAGE Publications Ltd  by SAGE Publications Ltd at the Journal of research in nursing page: http:\/\/jrn.sagepub.com\/ on SAGE Journals Online: http:\/\/online.sagepub.com\/\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1744-9871","issn: 1744-988X"," 1744-988x","1744-9871"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2011,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n13 October 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nJones, S.E. and Hamilton, S. and Perry, L. and O’Malley, C. and Halton, C. (2010) ’Developing workable\nresearch methods : lessons from a pilot study with vulnerable participants and complex assessments.’, Journal\nof research in nursing., 15 .\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1177\/1744987110380335\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nDeveloping workable research methods: lessons from a pilot study with \nvulnerable participants and complex assessments \n \nMrs Susan E Jones. BSc (Hons). RN. Research Associate. Teesside University, \nMiddlesbrough, UK.  \n \nDr Sharon Hamilton. PhD, MA, BA (Hons). RN. Reader in Nursing. Teesside \nUniversity, Middlesbrough, UK.  \n \nProfessor Lin Perry. PhD, MSc, RN, RNT. Professor of Nursing Research and \nPractice Development. University of Technology, Sydney, Australia.  \n \nMrs Claire O‟Malley. BSc (Hons). Research Associate. Durham University, Stockton, \nUK.  \n \nMrs Carol Halton. RN.  Stroke Services Co-ordinator. James Cook University \nHospital, Middlesbrough, UK.  \n \n \nBiographies \nMrs Susan E Jones. Susan.Jones@tees.ac.uk 01642 342984 \nSusan Jones is a research associate within the Health and Social Care Institute at \nTeesside University, UK. She qualified as a Registered Nurse in 1981 then spent four \nyears working in oncology, before leaving to have a family. In 2006 she gained a BSc \nin Public Health and Well-being (Hons) from Teesside University. In the last three \nyears she has developed her undergraduate dissertation on the role of the school \nnurse assistant, undertaken a number of literature reviews, worked on several health \nservice evaluations and conducted primary research into taste and smell post-stroke. \nAt present she is working towards a Masters in Health Sciences (Public Health) and \nher dissertation topic is Stopping Smoking after a Stroke. \n \nDr Sharon Hamilton. Sharon.Hamilton@tees.ac.uk 01642 342750 \nSharon Hamilton is a Reader in Nursing and Director of the Centre for Health and \nSocial Evaluation at Teesside University in the UK.  The majority of her clinical \nexperience was gained in neurosurgical nursing.  She has a Masters degree in Social \nPolicy from Goldsmith‟s, University of London and was awarded a PhD in stroke care \nand change management from Kingston University.  Her research has two main \nthemes: developing the evidence-base underpinning nursing interventions including \nthose in stroke care; and the evaluation of new health services.   \n \nProfessor Lin Perry. Lin.Perry@uts.edu.au \nLin Perry is Professor of Nursing Research and Practice Development, University of \nTechnology, Sydney and the Northern Hospitals Network, South Eastern Sydney and \nIllawarra Area Health Service. She has an MSc in Healthcare (Professional Issues) \nfrom University of Exeter, and was awarded a doctoral degree from the Faculty of \nMedicine, St George‟s, University of London. Her special interest is chronic \nconditions, practice and service development, particularly in relation to knowledge \ntranslation and change management for front-line staff. A member of the \nIntercollegiate Stroke Working Party in the UK and the National Stroke Foundation \nGuidelines Working Party and Stroke Services New South Wales in Australia, she \nhas extensive experience with national guideline development, benchmarking, service \nreview and evaluation. \n \n \nMrs Claire O’Malley c.l.o‟malley@durham.ac.uk \nClaire O‟Malley is a Research Associate at Durham University. She has a degree in \nNutrition and Health Science from the Teesside University and is currently studying \nfor an MSc in Health Science (Public Health Pathway). Claire has been involved in \nevaluating various obesity and nutrition-related initiatives. Her main research \ninterests lie within the field of childhood obesity and novel ways of measuring dietary \nintake in both adults and children. Claire is currently working on a project funded \nthrough the World Cancer Research Fund (WCRF) entitled TeesCAKE (Tees \nConsumption and Activity in Kids' Experience) which aims to encourage healthy \nweight, healthy eating and healthy lives in school children.  \n \nMrs Carol Halton.  Carol.Halton@stees.nhs.uk  \nCarol Halton is the Stroke Rehabilitation Lead for South Tees Community Services \nand was working at James Cook Hospital, Middlesbrough at the time of the study.  All \nher stroke experience has come from within Clinical Practice.  Having established a \nStroke Rehabilitation Unit within a Community Hospital setting then moved to a large \nteaching hospital to develop the role of the Stroke Coordinator. She has a degree in \nGeneral Nursing Studies from York University and undertook degree level modules \nwithin Stroke Care. \nABSTRACT \nBackground:  \nFollowing acute stroke, deterioration in nutritional status and weight loss is common; \nfew studies have investigated this, perhaps due to difficulties with recruitment and \ncompletion of complex assessments with stroke patients. This study reports the \nfeasibility of a study protocol to determine predictors of nutritional intake in stroke \npatients. \n \nAim:  \nTo test the feasibility of a protocol to measure taste and smell function and explore \nlinks with dietary intake following stroke. \n \nMethods:  \nPatients were recruited from one acute stroke unit in 2007\/8. Data were collected at \nthree time points and entailed standardised validated assessments of taste and smell \nfunction, diet, appetite and mood state.   \n \nResults:  \nRecruitment of this vulnerable population to a demanding assessment schedule was \nchallenging. Of a cohort of 166 admissions, six were recruited and complete data \ncollected from four participants. Slow recruitment was largely due to exacting \ninclusion criteria and rapid hospital discharge. Those who completed all assessments \nreported the schedule as tolerable and acceptable.  \n \nConclusion:   \nThis study illustrated the difficulties of recruiting this vulnerable population. \nIdentification of reasons for slow recruitment facilitated development of measures to \naddress them. It was possible to format a complex and lengthy assessment schedule \nto be acceptable to vulnerable participants. \n200 words \n \nKey words: recruitment, feasibility, pilot study, taste, smell, stroke, nutrition.  \nINTRODUCTION  \nStroke is one of the top three causes of death and long-term disability in England and \ninternationally; research and service development to improve stroke patient \noutcomes is a priority (Dept of Health, 2010). However, research recruitment and \nretention of generally older people with multiple impairments and acute illness, such \nas stroke patients, is challenging (Schulz et al, 2006). This may be particularly the \ncase where studies require sequential, detailed assessment schedules (Jeffries, \n2009). Preliminary stages entailing, for example, theory development and qualitative \ntesting, are an important component of research programme development (Campbell \net al, 2000). This paper reports and discusses findings of pilot feasibility work to test \na recruitment and assessment protocol prior to initiation of a full-scale study. \n \nNutritional problems in stroke patients \nNutritional problems are common amongst stroke patients; sequential assessments \nduring acute and rehabilitation stages have demonstrated overall deterioration in \nnutritional status and weight loss (Davalos et al, 1996; Finestone et al, 1996). This is \nsignificant as malnutrition has been associated with increased morbidity and risk of \ndeath and dependency after a stroke (Davalos et al, 1996; Gariballa et al, 1998a).  \n \nSome patients, particularly older people and stroke patients, do not eat an adequate \nor balanced diet in hospital (Gariballa et al, 1998a, b). At 30 days post stroke, \ncomparison of food intake of 150 self-feeding stroke patients with their calculated \nenergy and protein requirements revealed nutritional deficits from 60% and 50% of \nthe cohort, respectively (Aquilani et al, 1999). At 5 weeks after a stroke 20 still-\nhospitalised patients who could swallow normally were eating an average of 1,084 \n(SD 343) kcal\/day: substantially less than requirements (Gariballa et al, 1998b). \nWhilst nutritional supplements can significantly increase energy and protein intakes, \nthey are seldom used systematically in hospital, and patients do not always consume \nthem in adequate amounts to counteract this deficit. A major international trial \nindicated routine administration of nutritional supplements to well-nourished stroke \npatients was not beneficial (FOOD Trial Collaboration, 2005).  \n \nStroke patients experience a variety of disabilities that may deter eating and links \nbetween eating disabilities, appetite, mood state and dietary intake have been \nreported (Perry and McLaren, 2003; 2004). Olfactory (smell) and gustatory (taste) \nfunctions both contribute to taste sensation; complaints of altered taste commonly \narise from olfactory dysfunction (Getchell et al, 1991). Decreased taste sensation has \nbeen linked with lower body weight and energy intake in older adults and with \nsignificant weight loss in stroke patients (De Jong et al, 1999; Finsterer et al, 2004). \nTaste disturbance has been reported in stroke patients, assessed via a variety of \nmethods. A single small cohort study and a series of case studies have reported \ndeficits in patients with brain lesions at a variety of locations (Heckmann et al, 2005; \nPritchard et al, 1999; Onoda et al, 1999). Symptoms ranged from reduced intensity of \ntaste sensation, loss of pleasant associations and conversion of some neutral to \nnoxious tastes, development of smell and taste intolerance, food aversion and \nmarked weight loss. Amongst groups of older adults, taste dysfunction has been \nlinked with reduced appetite and increased susceptibility to infections (Schiffman et \nal, 2000). Hence smell and taste can be strongly linked with eating, both of quantity \nand quality of food eaten.  \n \nA single research study has systematically investigated taste and smell dysfunction \nin a group of patients following minor strokes, demonstrating a sizeable proportion, \n30%, with poor or lost taste (Heckmann et al, 2005). Case studies and subjective \nself-report also note loss of and altered taste following stroke (Onoda et al, 1999; \nPritchard et al, 1999; Perry and McLaren, 2003). It is hard to estimate from these \nstudies to what degree stroke patients are affected by taste and smell problems, or \nthe extent to which this affects what they eat. No study has explored the potential of \nsuch impairments to resolve spontaneously, or attempted to quantify their \npersistence. These are important gaps in knowledge, bearing in mind the health \nproblems that can result from an inadequate diet. \n \nThis is clearly an important area for research, but stroke cohorts present challenges \nfor recruitment and completion of complex assessments (Schulz et al, 2006; Jeffries \net al, 2009). Nutritional studies may pose particular hurdles due to the complexity of \nassessment schedules; a previous nutritional study by this author group recruited 100 \nof a cohort of 438 stroke patients, and obtained complete datasets for only 38 \nparticipants (Nip et al, 2010). Recruitment and data collection have to be tailored to \nthe specific needs of stroke patients, including cognitive and speech impairments, \nand fatigue. If successfully accomplished, patients with a variety of stroke-related \nconditions may be able to participate and subsequently produce results clinically \nrelevant across the spectrum of stroke. This study tested the feasibility of a research \nprotocol designed to measure taste and smell function and explore links with dietary \nintake immediately following stroke.   \n \nDesign and setting \nA cohort study design was used. Participants were recruited from an Acute Stroke \nUnit (ASU) in one NHS Trust and followed to an inpatient Rehabilitation Unit (RU) in a \nseparate hospital, or home. Ethical approval was obtained from the appropriate \ncommittees prior to commencement of the study. \n \nParticipants \nAll patients admitted to one ASU between 09\/10\/07 – 14\/12\/07 and 07\/01\/08 – \n18\/02\/08 were considered for inclusion. Inclusion criteria were:  \n >18 years of age;  \n confirmation of stroke by Computerised Tomography (CT scan);  \n sufficient medical stability to sit out of bed and begin therapy.  \nExclusion criteria included:  \n known gustatory or olfactory impairments,  \n significant communication and\/ or cognitive impairments, identified through \nMini Mental State Examination (MMSE) (Folstein et al, 1975). \n recruitment to another study, \n unable to complete T1 assessment within 14 days of admission,  \n unable to complete T2 assessment (e.g. not fully orally fed) within 21 days of \nassessment. \nThe latter two exclusion criteria were designed to enable any change within the first \nmonth post stroke to be identified at the T3 assessment (at 1 month post-stroke). \n \nData collection \nAll consecutively admitted stroke patients were reviewed by the researcher and those \nmeeting the inclusion criteria were approached once medically stable. For consenting \npatients, the following data were extracted from medical and nursing records, with \nreliability of data extraction checked independently by a second researcher: age; \nsmoking status; sex; ethnic origin; co-morbidities; current medications (including \nscreening for possible effects on taste); weight; stroke severity assessed at \nadmission using the National Institute of Health Stroke Severity scale (Goldstein and \nSamsa, 1997); the Oxfordshire stroke sub-type (Bamford et al, 1990); CT scan \nfindings.  \n \n \n \nMeasurement battery  \nMeasurements were conducted once participants were medically stable (T1); when a \nnormal, oral diet was established (T2); at one month post stroke (T3). Assessments \nwere performed in a quiet area, away from strong smells. The following standardised, \nvalidated assessments were undertaken by study participants: \n \n• Olfactory function tested using „Sniffin‟ Sticks‟, a proprietary test kit using a \nwell-established, standard procedure used extensively in studies of older adults and \nin clinical work (Hummel et al, 1997; Schiffman et al, 2000). This test was first \nproduced in 1996 and has since been widely used and validated (Kobal et al, 2000). \nTesting entails a forced choice procedure comprising threshold, discrimination, and \nidentification (TDI) testing. Odour identification is accomplished with 16 pens filled \nwith standard odorants (e.g. rose, lemon, garlic, leather) presented with multiple \nchoice response options. Threshold and discrimination testing is accomplished using \nsimilar pens filled with differing concentrations of n-butanol, again with forced choice \nresponse options, in stepwise concentrations. A mean composite TDI score was \ncalculated.  \n• Gustatory function tests including taste threshold and identification was \nassessed using “Taste Strips”. This involved 16 Taste Strips and 2 blanks, \nrepresenting the 4 major tastes in a range of concentrations, being placed on the \ntongue one after the other in a pseudo-randomised sequence for identification and to \nestablish threshold values. This has been shown to be a valid and reliable test \nprocedure (Mueller et al, 2003), posing minimal hazard for those whose swallow \nfunction is not safe with thin fluids (Garon et al, 1997).   \n• Oral health and hygiene was evaluated using the THROAT assessment tool.  \nThis ordinal, nine item scale assesses the condition of the mouth on a scale of 0 – 3, \nand has demonstrated both inter and intra-rater reliability (Dickinson et al, 2001). \n• The Eating Disabilities Assessment Scale (EDAS) was used.  This ordinal \nscale covers eight types of disabilities that impact on ability to eat, assessed by \nobservation. Internal consistency and inter rater reliability were initially judged as \nacceptable (McLaren and Dickerson, 2000). \n• Patients‟ height in m2 and weight in kg were used to calculate Body Mass \nIndex and triceps skinfold thickness used as a measure of subcutaneous fat (Gibson \n1993).   \n• The Mini Nutritional Assessment (MNA) (Guigoz et al, 1994) was completed; \nthis widely validated composite nutritional assessment scale has been used \nextensively in international studies. Originally developed with older adults, it has been \nvalidated and demonstrated good reliability when used by different healthcare \nprofessionals (Guigoz et al, 1994) \n• The Hospital Anxiety and Depression Scale (HADS) (Zigmund and Snaith, \n1983) was used. Widely used with a broad range of patient groups, it has \ndemonstrated concurrent validity with stroke patients (O'Rourke et al, 1998).  \n• The Appetite, Hunger and Sensory Perception questionnaire (AHSP) (Mathey \net al, 2001) is a measure of self-reported appetite, taste and smell, developed for and \nrepeatedly used with elderly participants, and in a South London stroke study (Nip et \nal, 2010).  \n \nDietary intake was measured via standard weighed food procedures (Gibson, 1993) \nduring a single 24 hour period, following establishment of full oral intake. The \nresearcher was present on the ward during breakfast, lunch and dinner. Weighed \nfood data collection methods were negotiated at the study site, to tailor them to the \nprocedures of the two hospitals. Where food was plated on the ward, it was weighed \nimmediately prior to presentation to the patient. Where plated in the kitchen, food \nwas weighed by kitchen staff, prior to heating.   \n \nAt T1 and T3 the THROAT, gustatory and olfactory assessments only were \ncompleted, with all measures being undertaken at T2. At T2 dietary intake and \nanthropometric data were collected, and the MNA, EDAS, HADS and AHSP \nquestionnaires were completed by the researcher during face to face interviews with \nparticipants. The interview was formatted such that the order of questionnaire delivery \nwas structured to progress from simple questions working up to more complex ones. \nA single question at conclusion of each completed set of assessments sought \nacceptability of the schedule to participants.  \n \nField Diary \nThe researcher maintained a free-hand record of all process issues that arose during \ndata collection, notably around recruitment and assessment, in order to identify \nfactors impacting upon protocol delivery. \n \nAnalysis \nRecords were maintained of all activities, and notes made of details affecting protocol \ndelivery. Assessment data were entered using SPSS for Windows Version 13; \nfindings reported in this paper solely address study aims of feasibility testing of the \nrecruitment and assessment protocol. \nFINDINGS  \nRecruitment and T1 assessment \nInitial efforts were focused on establishing processes to enable data collection without \nhindering hospital or clinical procedures. This was most challenging for the weighed \nfood intake data, with the two hospitals employing differing catering systems. \nSatisfactory processes were established following extensive negotiation with all \nrelevant staff groups. \n \nDuring the 11 week study period, 166 patients were admitted with a clinical diagnosis \nof stroke, of whom six were eligible for recruitment (Figure 1). The most common \nreason for excluding patients was that acute stroke was not identified by CT scan \n(n=67). Of these patients, thirty-three were potentially eligible for recruitment: fifteen \nwould have been eligible if inclusion criteria had relied on clinical diagnosis alone; \neighteen remained unconfirmed clinically or by scan.  \n \nThirty patients were discharged too rapidly for recruitment. The mean duration from \nadmission to recruitment for the 6 recruits was 4 days, range 1 – 7 days; mean length \nof stay in the ASU was 7, range 6-11, days. For the group whose initial CT did not \nconfirm stroke, mean ASU length of stay was 6 days.  \n \nOther reasons for exclusion were: poor communication (n=20); acutely unwell\/ \nmedically unstable (n=18); cognitive impairment (n=8); requiring surgery (n=2); \nparticipating in another study (n=4); pre-existing gustatory impairment (n=3); \ncognitive impairment (n=3); consent withheld (n=2); risk of violence to researcher \n(n=1); unable to complete T1 within 14 days of admission (n=1); unable to complete \nT2 as remained nil orally (n=1). \n \nOf the patients who were judged too unwell to recruit on admission, nine were \nmonitored weekly but continued too drowsy or confused. Eight continued to show \nsignificant cognitive impairment and one showed promise of recovery but still was \nunable to complete the first assessment by day 14 following admission. \n \nAll six patients meeting the inclusion criteria completed T1 assessments.  \n \nT2 and T3 assessments \nOf these six participants, five completed T2 assessments and the 24 hour food \nrecord; one was transferred then discharged home prior to food intake assessments, \nand subsequently withdrew from the study. One participant moved out of area after \ncompleting T2. Four participants completed T3 and therefore all assessments (T1, T2 \nand T3).  \n \nAcceptability for participants \nParticipants reported the assessments at T1 and T2 as acceptable and tolerable; one \nparticipant reported the experience at T3 as wearisome, and another withdrew once \nat home. Initial consent was withheld for two potential participants; one patient and \none relative (in discussion with the patient) felt the study would be too onerous. To \nameliorate the demands of the study patients were offered breaks during the \nassessment process; however neither this offer nor the option to discontinue due to \nweariness were taken up by any participant. Some participants initially appeared \nmore motivated than others; some appeared to sustain motivation over time more \nreadily. All expressed interest in the taste and smell tests, appeared to enjoy them \nand wanted to know their results immediately. Other tests appeared of less interest to \nparticipants.  \n \nDISCUSSION \nThe aim of the study was to test the feasibility of a protocol to measure taste and \nsmell function and links with dietary intake after stroke, in terms of recruitment and \ncompletion of assessments.  \n \nRecruitment \nNumbers recruited were substantially less than had been anticipated from previous \nadmission data; a number of issues affected recruitment. \nA key finding was that the speed at which patients progressed through the ASU \nmilitated against recruitment, also noted by Jeffries et al (2009). As speed in \nrecognising, admitting and rehabilitating patients is a key factor in improving \noutcomes (Department of Health, 2010) researchers need to find ways of working \nwithin this framework, especially given the steady decrease in mean length of stay \ndemonstrated by the National Sentinel Audit for Stroke. For example, from 2001 to \n2008 total hospital length of stay including rehabilitation reduced from 34 to 23.7 days \n(Hoffman et al, 2002, 2009). However, this represents an aggregate of all those who \nare admitted and discharged from an ASU, including those with minor stroke \nsymptoms, those deemed likely to benefit from rehabilitation which may require \ntransfer to another location, and those who are severely affected and may or may not \nrecover sufficiently for active rehabilitation. Stroke audits do not collect data \nseparately for each component of care, given that patients may receive acute and \nrehabilitation services on any combination of a general ward, ASU, Combined or \nComprehensive Unit, and a RU which may be on the same or different site to the \nacute service. Recruitment for most studies tends to focus on the „middle band‟ stroke \ngroup (neither those most nor least severely affected) but detail of their specific \ntreatment patterns may not be available. As in this study, it may be difficult to \nanticipate parameters of clinical management within which research activities must be \naccommodated. \n \nSome patients were not well enough to be recruited in the early days after admission; \nJeffries et al (2009) also found ill health and fatigue limited recruitment. Although \nthese patients were monitored by the research assistant to see if swallowing, \nconfusion and\/or communication skills would improve sufficiently to meet eligibility \ncriteria, most often, if they recovered sufficiently to meet recruitment criteria, this \noccurred some considerable time after admission and they were transferred for \nrehabilitation before informed consent could be obtained. Whilst participants were \nfollowed from one site to another, early transfer to off-site facilities for rehabilitation \nposed a hurdle for recruitment. This should be born in mind at project set-up, and, if \ntime-post-stroke is not critical for assessment data, methods to offer delayed \nrecruitment established. \n \nFor many studies patients‟ specific patterns of impairment limit recruitment; Jeffries et \nal (2009) reported less than 1 in 3, Nip et al (2010) less than 1 in 4 stroke patients \nmet study inclusion criteria. In this study, presenting characteristics of 34 stroke \npatients barred their recruitment. More often, however, uncertainties around diagnosis \nand the severity of their condition were the barrier. Such patients are difficult, often \nimpossible to recruit, yet any service development arising from the research should \nnot ignore them. The mean stroke severity score of the cohort recruited by Heckman \net al (2005) indicated most participants experienced mild to moderate levels of \nimpairment. This study suggests these patients may be the group most suitable to \nparticipate with this sort of protocol. Whilst it may be feasible to complete a simplified \nform of the protocol with those with cognitive and\/or communication deficits (Perry, \n2004), timely recruitment may still pose challenges. Further work will be required to \nestablish and pilot a simplified protocol suitable for completion by those with mild \nimpairments. \n \nDiagnosis via CT scan as an inclusion criterion proved a limiting factor to recruitment. \nEarly CT scans are used primarily to exclude haemorrhage rather than diagnose \nstroke, and thrombo-embolic lesions are often not visible early on. In hindsight, some \npatients were excluded unnecessarily. The merits of clinical diagnosis of stroke have \nbeen debated as the validity of the resultant diagnosis can be variable (Liu et al, \n1999).  However, studies examining the reliability and validity of clinical classification \nof stroke suggest that clinical diagnosis may have an acceptable level of accuracy for \nrecruitment to many studies (Smith et al, 2001; Parsons et al, 2009). Thus use of this \nrather than CT scan as an inclusion criterion may facilitate recruitment.  \n \nFinally, this pilot study was not adopted by the relevant Stroke Local Research \nNetwork (LRN) and recruitment was therefore not supported by Network resources. \nAdoption by an LRN has been demonstrated to increase recruitment (Picker, 2008) \nand is therefore recommended for future studies. \n \nFeasibility of assessments \nIn relation to completion of assessments, timing was found to be problematic. The 24-\nhour food record required completion in hospital at T2; however, many patients were \ndischarged home as soon as full oral diet was established. A period of time needed to \nelapse between T1 and T2 to allow measurement of change but some who met the \ninclusion criteria achieved T2 criteria at recruitment, resulting in a single assessment \npoint simultaneously for T1 and T2. With hindsight, in this study T1 and T2 could have \nbeen a single assessment point.  \n \nThose patients who were recruited reported that the rather lengthy assessment \nschedule was nonetheless acceptable and achievable. This was probably helped by \nthe deliberate structuring of multiple items from different questionnaires into a logical \nconversational flow. This demonstrated that, whilst there were recruitment hurdles to \nbe overcome, the assessment schedule of the study was feasible with this population \ngroup.  \n \nCONCLUSION \nStroke is a disease with high morbidity and mortality rates; development of therapies \nto maximise recovery is essential. Research to support service development may \nrequire complex assessments to be undertaken with this vulnerable group of \nparticipants. This study demonstrated the challenges of recruiting such participants, \nidentified potential strategies to maximise recruitment, and the feasibility of the \nassessment schedule with those participants who could be recruited, although further \nwork will be required to develop a simplified protocol suitable for completion by those \nwith mild cognitive impairment. Findings have supported development of a full-scale \nproposal and may be encouraging to other stroke researchers. \n \nSource of Funding: Teesside University Research Fund. \n \nAcknowledgements \nWe acknowledge the support and help of Dr Bergin, Dr Broughton and Dr Ingram for \nallowing access to their patients and Sister Elliott and the staff for their support on the \nunit.  \n \nConflict of Interest: None. \n \nKey points \n Information provided by this pilot feasibility study identified elements of the \nprotocol that restricted recruitment and posed barriers to collection of full \ndatasets. \n Information provided by this pilot feasibility study indicated revision of \neligibility criteria to clinically rather than CT confirmed diagnosis of stroke to \nmaximise recruitment.  \n Information provided by this pilot feasibility study indicated reduction of the \nnumber and timing of assessment time-points to maximise collection of full \ndatasets. \n Information provided by this pilot feasibility study flagged the challenges of \nreducing length of stay for recruitment, and the need to develop strategies to \nmaximise recruitment within restricted time frames. \n Conduct of this pilot study enabled fine-tuning of the protocol for full-scale \nstudy to improve effective and timely research project delivery; lessons of this \npilot may be useful for other researchers in similar fields.  \n \n \n \n \n \n \n \nREFERENCES \n \n Aquilani, R, Galli, M, Guarnaschelli, C, Fugazza, G, Lorenzoni, M, Varalda, E, \nArrigoni, N, Achilli, P, Zelaschi, GP, Crespi, MG, Baiardi, P, Mariani P (1999) \nPrevalence of malnutrition and inadequate food intake in self-feeding \nrehabilitation patients with stroke. Europa Medicophysica 35: 2, 75-81. \n Bamford, J, Dennis, M, Sandercock, P, Burn, J, Warlow, C (1990) The \nfrequency, causes and timing of death within 30 days of a first stroke: the \nOxfordshire Community Stroke Project. Journal of Neurology, Neuroscience \nand Psychiatry 53: 824-9. \n Campbell, M, Fitzpatrick, R, Haines, A, Kinmonth, AL, Sandercock, P, \nSpiegelhalter, D, Tyrer, P (2000) Framework for design and evaluation of \ncomplex interventions to improve health. British Medical Journal 321: 694-6. \n Davalos, A, Ricart W, Gonzalez-Huix F, Soler S, Marrugat J, Molins A, Suner \nR, Genis D. (1996) Effect of malnutrition after acute stroke on clinical \noutcome. Stroke 27: 6,1028-32. \n De Jong, N, Mulder, I, De Graaf, C, Van Staveren WA (1999) Impaired \nsensory functioning in elders. Journal of Gerontology Series A Biological \nSciences and Medical Sciences 54: 8, B324-35. \n Department of Health (2010) Progress in improving stroke care. London: \nNational Audit Office. \n Dickinson, H, Watkins, C, Leath, M (2001) Development of THROAT. Clinical \nEffectiveness in Nursing 5: 104-10. \n Finestone, HM, Greene-Finestone, LS, Wilson, ES, Teasell, RW (1996) \nProlonged length of stay and reduced functional improvement rate in \nmalnourished stroke rehabilitation patients. Archives of Physical Medicine and \nRehabilitation 77: 4, 340-5. \n Finsterer, J, Stöllberger, C, Kopsa, W (2004) Weight reduction due to stroke-\ninduced dysgeusia. European Neurology 51: 1, 47-49. \n Folstein, MF, Folstein, SE, McHugh, PR (1975) \"Mini-mental state\": a \npractical method for grading the cognitive state of patients for the clinician. \nJournal Psychiatric Research 12: 189-198. \n FOOD Trial Collaboration (2005) Routine oral nutritional supplementation for \nstroke patients in hospital (FOOD): a multicentre randomised controlled trial. \nLancet 36: 5755–63. \n Gariballa, SE, Parker, SG, Taub, N, Castleden, CM (1998a) Influence of \nnutritional status on clinical outcome after acute stroke. American Journal of \nClinical Nutrition 68: 2, 275-81. \n Gariballa, SE, Parker, SG, Taub, N, Castleden, CM (1998b) A randomised \ncontrolled single-blind trial of nutritional supplementation after stroke. Journal \nof Parenteral and Enteral Nutrition 22: 315-9. \n Garon, BR, Engle, M, Ormiston, C (1997) A randomized control study to \ndetermine the effects of unlimited oral intake of water in patients with \nidentified aspiration. Neurorehabilitation and Neural Repair 11: 3, 139-148.   \n Getchell, TV, Doty, RL, Bartoshuk, LM, Snow, JB, Jr (eds) (1991) Smell and \nTaste in Health and Disease. New York: Raven Press. \n Gibson, RS (1993) Nutritional assessment: a laboratory manual. New York: \nOxford Press. \n Goldstein, LB, Samsa, GP (1997) Reliability of the NIH Stroke Scale. \nExtension to non-neurologists in the context of a clinical trial. Stroke 28: 2, \n307-10. \n Guigoz, B, Vellas, B, Garry, PJ (1994) The Mini Nutritional Assessment \n(MNA). Facts and Research in Gerontology 4: 2, 15-59. \n Heckmann, J, Stossel, C, Lang, CJ (2005) Taste disorders in acute stroke. \nStroke 36: 8,1690-1694.  \n Hoffman, A, Grant, R, Wurie, F, Campbell, J, Lowe, D, Rudd, A (2009) The \nNational Sentinel Audit of Stroke 2008. National and Local Results for the \nProcess of Stroke Care Audit 2008. Generic Hospital Report. London: \nPrepared on behalf of The Intercollegiate Stroke Working Party Royal College \nof Physicians of London. \n Hoffman, A, Lowe, D, Irwin, P, Rudd, A (2002) Concise report on the National \nSentinel Stroke Audit 2001\/02. London: Prepared on behalf of the \nIntercollegiate Stroke Working Party by Clinical Effectiveness and Evaluation \nUnit, Royal College of Physicians of London. \n Hummel, T, Sekinger, B, Wolf, SR, Pauli, E, Kobal, G (1997) 'Sniffin' sticks': \nolfactory performance assessed by combined testing of odor identification, \ndiscrimination, threshold. Chemical Senses 22: 39-52. \n Jeffries, J, Grimmer-Somers, K, Luker, J (2009) Practical aspects of repeated \nmeasures stroke research: Recruitment, resources, time frames and survey \ninstruments. The Internet Journal of Allied Health Sciences and Practice 7:1. \nAt http:\/\/ijahsp.nova.edu\/articles\/Vol7Num1\/pdf\/jeffries.pdf \n Kobal G, Klimek, L, Wolfensberger, M, Gudziol, H, Temmel, A, Owen CM, \nSeeber, H, Pauli, E, Hummel, T (2000) Multicenter investigation of 1,036 \nsubjects using a standardized method for the assessment of olfactory function \ncombining tests of odor identification, odor discrimination, and olfactory \nthresholds. European Archives of Otorhinolaryngology 257: 205–211. \n Liu, L, Reeder, B, Shuaib, A, Mazagri, R (1999) Validity of stroke diagnosis on \nhospital discharge records in Saskatchewan, Canada: implications for stroke \nsurveillance. Cerebrovascular Disease 9: 4, 224-230. \n Mathey, M-F, de Jong, N, de Groot, CPGM, de Graaf C, van Staveren WA \n(2001) Assessing appetite in Dutch elderly. Journal of Nutrition Health and \nAgeing 5: 1, 22-8. \n McLaren, SMG, Dickerson, JWT (2000) Measurement of eating disability in \nan acute stroke population. Clinical Effectiveness in Nursing 4, 109–120. \n Moher, D, Schulz, KF, Altman, DG (2001) The CONSORT statement: revised \nrecommendations for improving the quality of reports of parallel-group \nrandomised trials. Lancet 357: 9263, 1191-1194.  \n Mueller, C, Kallert, S, Renner, B, Stiassny, K, Temmel, AFP, Hummel, T, \nKobal, G (2003) Quantitative assessment of gustatory function in a clinical \ncontext using impregnated “taste strips”, Rhinology 41: 2– 6. \n Nip, W, Perry, L, McLaren, S, Mackenzie, A (2010) Dietary intake of stroke \npatients in hospital: is it adequate and does it matter? Submitted to Journal of \nHuman Nutrition and Dietetics. \n Onoda, K, Ikeda, M (1999) Gustatory disturbance of cerebrovascular disorder. \nLaryngoscope 109: 1, 123-8. \n O'Rourke, S, MacHale, S, Signorini D, Dennis, M (1998) Detecting psychiatric \nmorbidity after stroke: comparison of the GHQ and the HAD Scale. Stroke 29: \n5, 980-5. \n Parsons, M, Miteff, F, Bateman, G, Spratt, N, Loiselle, A, Attia, J, Levi, C \n(2009) Acute ischemic stroke: imaging-guided tenecteplase treatment in an \nextended time window. Neurology 72: 10, 915-921. \n Perry, L (2004) Eating and dietary intake in communication-impaired stroke \nsurvivors: a cohort study from acute-stage hospital admission to 6 months \npost-stroke. Clinical Nutrition 23: 6, 1333-43. \n Perry, L, McLaren, S (2003) Eating difficulties after stroke. Journal of \nAdvanced Nursing 43: 4, 360-69. \n Perry, L, McLaren, S (2004) An exploration of nutrition and eating disabilities \nin relation to quality of life at 6 months post stroke. Health and Social Care in \nthe Community 12: 4, 288-97. \n Picker, J (2008) Research Networks: Do they perform for industry sponsor \ntrials? Presentations from Capacity, Consent and Stroke Research, \nNewcastle. At: http:\/\/www.uksrn.ac.uk\/images\/files\/jean-luc%20picker%20-\n%20research%20networks%2C%20do%20they%20perform%20for%20indust\nry%20sponsor%20trials.ppt \n Pritchard, TC, Macaluso, DA, Eslinger, PJ (1999) Taste perception in patients \nwith insular cortex lesions. Behavioral Neuroscience 113: 4, 663-71. \n Schiffman, SS, Graham, BG (2000) Taste and smell perception affects \nappetite and immunity on the elderly. European Journal of Clinical Nutrition \n54: (supp 3), S54-63. \n Schulz, CH, Wasserman, J, Ostwald, S (2006) Recruitment and Retention of \nStroke Survivors: the CAReS Experience. Physical and Occupational Therapy \nGeriatrics 25: 1, 17–29.  \n Smith, C, Emsley, H, Libetta, C, Hughes, D, Drennan, R, Vail, A, Tyrrell, P \n(2001) The Oxfordshire Community Stroke Project classification in the early \nhours of ischaemic stroke and relation to infarct site and size on cranial \ncomputed tomography. Cerebrovascular Disease 10: 5, 205-209. \n Zigmund, AS, Snaith, RP (1983) Hospital Anxiety and Depression Scale. Acta \nPsychiatrica Scandinavica 67: 361-70. \nFigure 1: Recruitment Flowchart (Moher et al, 2001)  \n \n \n \n \n \n \n \n \n      \n \n \n \n \n \n \n \n \n \n \n \n \n      \n                                                   \n \n \nAnalyzed (n= 4) \nExcluded from analysis (n= 0) \n    \n \nT2 assessment completed (n=5) \n \nT3 assessment completed (n=4) \nT1 assessment completed (n=6) \nAssessed for eligibility \n(n= 166) \n \nExcluded (n= 160)  \n \n  \n \nEnrolment \nFollow-up \nAnalysis \n24 hour food record completed (n=5) Lost to follow up (n=1) \n \nLost to follow up (n=1) \n \n"}