{"doi":"10.1177\/0950017007076645","coreId":"197776","oai":"oai:lra.le.ac.uk:2381\/10044","identifiers":["oai:lra.le.ac.uk:2381\/10044","10.1177\/0950017007076645"],"title":"Customer oriented militants? A critique of the 'customer oriented bureaucracy' theory on front-line service worker collectivism","authors":["Brook, Paul A."],"enrichments":{"references":[{"id":43731084,"title":"(2003a) ‘Consumer Capitalism and Industrial Relations’","authors":[],"date":null,"doi":null,"raw":"Korczynski, M. (2003a) ‘Consumer Capitalism and Industrial Relations’ in P. Ackers and A. Wilkinson (eds.) Understanding Work & Employment, pp. 265-77. Oxford: OUP.","cites":null},{"id":43731061,"title":"An introduction to Marx’s theory of alienation’,","authors":[],"date":"1998","doi":"10.1007\/978-1-4684-8813-5_3","raw":"Cox, J. (1998) ‘An introduction to Marx’s theory of alienation’, International Socialism 79: 41-62.","cites":null},{"id":43731092,"title":"Back-office service work: bureaucracy challenged?","authors":[],"date":"2004","doi":"10.1177\/0950017004040764","raw":"Korczynski, M. (2004) ‘Back-office service work: bureaucracy challenged? Work, Employment and Society 18(1): 97-114.","cites":null},{"id":43731083,"title":"Communities of Coping: Collective Emotional Labour in Service Work’,","authors":[],"date":"2003","doi":"10.1177\/1350508403010001479","raw":"Korczynski, M. (2003b) ‘Communities of Coping: Collective Emotional Labour in Service Work’, Organization 10(1): 55-79.","cites":null},{"id":43731067,"title":"From adversarialism to partnership? Trade unionism and industrial relations in the banking sector in the UK’,","authors":[],"date":"2001","doi":"10.1108\/eum0000000005687","raw":"Gall, G. (2001) ‘From adversarialism to partnership? Trade unionism and industrial relations in the banking sector in the UK’, Employee Relations 23(4): 353-75.","cites":null},{"id":43731082,"title":"Human Resource Management in Service Work.","authors":[],"date":"2002","doi":"10.1111\/j.1748-8583.2005.tb00143.x","raw":"Korczynski, M. (2002) Human Resource Management in Service Work. Basingstoke: Palgrave.","cites":null},{"id":43731056,"title":"In the name of the client: the service ethic in two professional service firms’,","authors":[],"date":"2004","doi":"10.1177\/0018726700539003","raw":"Allen, K. (2004) Max Weber. London: Pluto. Anderson-Gough, F., Grey, C. and Robson, K. (2000) ‘In the name of the client: the service ethic in two professional service firms’, Human Relations 53 (9): 1151-74.","cites":null},{"id":43731069,"title":"Italy and its Discontents.","authors":[],"date":"2001","doi":"10.1007\/978-1-137-11741-0_9","raw":"Ginsborg, P. (2001) Italy and its Discontents. London: Allen Lane.","cites":null},{"id":43731076,"title":"Liberté, Égalité and Fraternité at Work: changing French employment relations and Management.","authors":[],"date":"2003","doi":"10.2307\/4126686","raw":"Jefferys, S. (2003) Liberté, Égalité and Fraternité at Work: changing French employment relations and Management. Basingstoke: Palgrave-Macmillan.","cites":null},{"id":43731080,"title":"No Logo.","authors":[],"date":"2001","doi":"10.14361\/9783839413272-106","raw":"Klein, N. (2001) No Logo. London: Flamingo.","cites":null},{"id":43731065,"title":"On the Front Line – organization of work in the information economy.","authors":[],"date":"1999","doi":"10.2307\/25149315","raw":"Frenkel, S.J., Korczynski, M., Shire, K.A. and Tam, M. (1999) On the Front Line – organization of work in the information economy. London: Cornell University.","cites":null},{"id":43731071,"title":"Partnership versus organising: alternative futures for British trade unionism’,","authors":[],"date":"2002","doi":"10.1111\/1468-2338.00217","raw":"Heery, E. (2002) ‘Partnership versus organising: alternative futures for British trade unionism’, Industrial Relations Journal 33(1): 20-35.","cites":null},{"id":43731097,"title":"Politics and the struggle’,","authors":[],"date":"2005","doi":null,"raw":"Smith, M. (2005) ‘Politics and the struggle’, International Socialism 105: 111-123.","cites":null},{"id":43731078,"title":"Rethinking Industrial Relations.","authors":[],"date":"1998","doi":"10.4324\/9780203213940","raw":"Kelly, J. (1998) Rethinking Industrial Relations. London: Routledge.","cites":null},{"id":43731095,"title":"Service Work and the Routinization of Everyday Life.","authors":[],"date":"1993","doi":"10.1177\/017084069501600209","raw":"Leidner, R. (1993) Service Work and the Routinization of Everyday Life. London: University of California.","cites":null},{"id":43731094,"title":"Service Work in Consumer Capitalism: Customers,","authors":[],"date":"2000","doi":"10.1177\/09500170022118671","raw":"Korczynski, M., Shire, K., Frenkel, S. and Tam, M. (2000) ‘Service Work in Consumer Capitalism: Customers, Control and Contradictions’, Work, Employment and Society 14 (4): 669-87.","cites":null},{"id":43731063,"title":"Shop stewards’ leadership, left wing activism and collective workplace union organisation’,","authors":[],"date":"2002","doi":"10.1177\/030981680207600104","raw":"Darlington, R. (2002) ‘Shop stewards’ leadership, left wing activism and collective workplace union organisation’, Capital & Class 76: 95-126.","cites":null},{"id":43731059,"title":"Social theory: an historical introduction.","authors":[],"date":"1999","doi":"10.2307\/1906358","raw":"Callinicos, A. (1999) Social theory: an historical introduction. Cambridge: Polity.","cites":null},{"id":43731057,"title":"The (mis)representation of customer service’,","authors":[],"date":"2005","doi":"10.1177\/0950017005058054","raw":"Bolton, S.C. and Houlihan, M. (2005) ‘The (mis)representation of customer service’, Work, Employment and Society 19 (4): 685-703.","cites":null},{"id":43731081,"title":"The contradictions of service work: call centre as Customer Oriented Bureaucracy’","authors":[],"date":"2001","doi":"10.4324\/9780203892268.ch5","raw":"Korczynski, M. (2001) ‘The contradictions of service work: call centre as Customer Oriented Bureaucracy’ in A. Sturdy, I. Grugulis and H. Willmott (eds.) Customer Service: Empowerment and Entrapment, pp.79-101. London: Palgrave.","cites":null},{"id":43731073,"title":"The Managed Heart: commercialization of human feeling.","authors":[],"date":"2005","doi":"10.1525\/si.1985.8.2.317","raw":"Harvey, D. (2005) Neoliberalism. Oxford: OUP Hochschild, A. (1983\/2003) The Managed Heart: commercialization of human feeling. London: University of California.","cites":null},{"id":43731096,"title":"The McDonaldization of Society: an investigation into the changing character of contemporary life.","authors":[],"date":"1996","doi":"10.2307\/1319033","raw":"Ritzer, G. (1996) The McDonaldization of Society: an investigation into the changing character of contemporary life. Newbury Park, C.A.: Pine Forge Press.","cites":null},{"id":43731093,"title":"The point of selling: capitalism, consumption and contradictions’.","authors":[],"date":"2005","doi":"10.1177\/1350508405048577","raw":"Korczynski, M. (2005) ‘The point of selling: capitalism, consumption and contradictions’. Organization 12(1): 69-88.","cites":null},{"id":43731098,"title":"Trade unions, workers’ rights and the frontier of control","authors":[],"date":"2001","doi":"10.1177\/0143831x01221003","raw":"Taylor, P. and Bain, P. (2001) ‘Trade unions, workers’ rights and the frontier of control in UK call centres’, Economic and Industrial Democracy 22(1): 39-66.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-06","abstract":"This critique challenges the Customer Oriented Bureaucracy (COB) theory’s argument that the experience of customer service is pivotal to the formation of front-line service worker collectivism. COB’s rejection of the major tenets of Marxist analysis, thereby denying the exploitative and class nature of service work, results in Korczynski theorising front-line worker collectivism as based only on the shared experience of doing customer service rather than as workers per se. As a neo-Weberian theory, COB argues ‘consumer capitalism’s’ ideology of ‘customer sovereignty’ is a contemporary ideological ‘iron cage’ of value rationalisation in a unified, contradictory relationship with bureaucratic rationalisation. COB theory, consequently, allows only for a trade unionism that is limited to contesting the terms of customer service rather than challenging the deepening commodification of social relations.Peer-reviewedPost-prin","downloadUrl":"http:\/\/hdl.handle.net\/2381\/10044","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/10044\/7\/WES%20COB%20final%202006.pdf","pdfHashValue":"46a58d46f96cf24bb2729eaff983214f0b77c612","publisher":"Sage","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/10044<\/identifier><datestamp>\n                2012-01-28T02:01:46Z<\/datestamp><setSpec>\n                com_2381_322<\/setSpec><setSpec>\n                com_2381_9551<\/setSpec><setSpec>\n                col_2381_512<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nCustomer oriented militants? A critique of the 'customer oriented bureaucracy' theory on front-line service worker collectivism<\/dc:title><dc:creator>\nBrook, Paul A.<\/dc:creator><dc:subject>\nCONTRADICTIONS<\/dc:subject><dc:subject>\nCAPITALISM<\/dc:subject><dc:subject>\ncustomer oriented bureaucracy<\/dc:subject><dc:subject>\nfront-line<\/dc:subject><dc:subject>\nmarxism<\/dc:subject><dc:subject>\nrationalisation<\/dc:subject><dc:subject>\nservice<\/dc:subject><dc:subject>\nunions<\/dc:subject><dc:subject>\nWeber<\/dc:subject><dc:description>\nThis critique challenges the Customer Oriented Bureaucracy (COB) theory’s argument that the experience of customer service is pivotal to the formation of front-line service worker collectivism. COB’s rejection of the major tenets of Marxist analysis, thereby denying the exploitative and class nature of service work, results in Korczynski theorising front-line worker collectivism as based only on the shared experience of doing customer service rather than as workers per se. As a neo-Weberian theory, COB argues ‘consumer capitalism’s’ ideology of ‘customer sovereignty’ is a contemporary ideological ‘iron cage’ of value rationalisation in a unified, contradictory relationship with bureaucratic rationalisation. COB theory, consequently, allows only for a trade unionism that is limited to contesting the terms of customer service rather than challenging the deepening commodification of social relations.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPost-print<\/dc:description><dc:date>\n2012-01-27T09:30:09Z<\/dc:date><dc:date>\n2012-01-27T09:30:09Z<\/dc:date><dc:date>\n2007-06<\/dc:date><dc:type>\nJournal Article<\/dc:type><dc:type>\nEditorial Material<\/dc:type><dc:identifier>\nWork, employment and society, 2007, 21 (2), pp. 363-374.<\/dc:identifier><dc:identifier>\n0950-0170<\/dc:identifier><dc:identifier>\nhttp:\/\/wes.sagepub.com\/<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/10044<\/dc:identifier><dc:identifier>\n10.1177\/0950017007076645<\/dc:identifier><dc:identifier>\n1469-8722<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nCopyright © 2007 BSA Publications Ltd®<\/dc:rights><dc:publisher>\nSage<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0950-0170","issn:1469-8722","1469-8722","issn:0950-0170"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["CONTRADICTIONS","CAPITALISM","customer oriented bureaucracy","front-line","marxism","rationalisation","service","unions","Weber"],"subject":["Journal Article","Editorial Material"],"fullText":"Customer Oriented Militants?  \nA critique of the ‘Customer Oriented Bureaucracy’ theory  \non front-line service worker collectivism \n \nPaul Brook, \nManchester Metropolitan University Business School, UK \n \nAbstract  \nThis critique challenges the Customer Oriented Bureaucracy (COB) theory’s argument \nthat the experience of customer service is pivotal to the formation of front-line service \nworker collectivism. COB’s rejection of the major tenets of Marxist analysis, thereby \ndenying the exploitative and class nature of service work, results in Korczynski \ntheorising front-line worker collectivism as based only on the shared experience of \ndoing customer service rather than as workers per se. As a neo-Weberian theory, COB \nargues ‘consumer capitalism’s’ ideology of ‘customer sovereignty’ is a contemporary \nideological ‘iron cage’ of value rationalisation in a unified, contradictory relationship \nwith bureaucratic rationalisation. COB theory, consequently, allows only for a trade \nunionism that is limited to contesting the terms of customer service rather than \nchallenging the deepening commodification of social relations.  \n \nKey Words \ncustomer oriented bureaucracy \/front-line \/marxism \/ rationalisation \/ service \/ unions \/ \nweber  \n \n \nIntroduction \nThe rising theoretical influence in recent years of the neo-Weberian body of work that \ncharacterises service organisations in contemporary ‘consumer capitalism’ as Customer \nOriented Bureaucracies (COB) (Frenkel et al., 1999) has met with little critical \nresistance not least from its principal target, the Marxist cum labour process tradition. \nThis theoretical contribution seeks to initiate just such an engagement by offering a \ncritique from within the classical Marxist tradition (see Callinicos, 1999). In so doing, it \nfocuses on Korczynski’s (2002) extension of COB theory to account for front-line \nservice workers’ capacity to organise collectively and the political-strategic parameters \nof subsequent unionisation. While what follows ostensibly tackles the issue of front-line \nworker collectivism it is not a contribution that seeks to retread debates on union \norganising and workplace conflict in services nor account for local variations at the \norganisational, sectoral and national levels (see Korczynski, 2002; Royle and Towers, \n2002; Gall, 2003). Rather, it tackles COB theory at its Weberian foundations.  \n \nKorczynski’s (2002) central argument is that front-line service workers’ experience is \nqualitatively different from that of back-office co-workers by virtue of ‘doing’ customer \nservice within the context of the ever-strengthening ideology of customer sovereignty. \nThis generates a theorisation of front-line collectivism where the management driven \ninculcation of customer-oriented values (underlain by capitalism’s consumerist \nideology) and increasing organisational bureaucratisation produces a trade unionism \nthat is limited to contesting the terms of customer service in favour of the worker and \ncustomer. This conclusion is the result of COB theory’s rejection of the major tenets of \nMarxism, principally the exploitative basis of the service labour process and its class \n 2 \nnature deriving from capitalism’s relations of production. Instead, its argument rests on \nWeber’s theories of rationalisation and class where the latter is premised on life \nchances, power and status bestowed by the market (Weber, 1978). Korczynski’s \nsubsequent theorisation explains the existence of front-line collectivism as essentially \nderiving from the shared dissatisfaction of performing customer service work. It is \nunable, however, to account theoretically for collectivism arising in response to other \ngrievances such as pay, conditions and management regime. COB theory, therefore, \nlacks the capacity to explain the existence of trade union organisation that unites front-\nline workers with back-office service employees and workers generally. The logical \ncompanion to this is a Weberian style denial of the feasibility of class-based resistance \nto the increasing commodification of social life (see Wright, 2002; Allen, 2004).  \n \nContradictory rationalisation \nCOB’s theoretical ‘base camp’ is Weber’s concept of formal economic rationalisation, \nwhich sees bureaucratisation as a dominant, ever-deepening and inevitable process in \nindustrial societies. This sits in conjunction with COB theory’s acceptance that \n‘consumer capitalism’ has elevated the ‘myth of customer sovereignty’ into today’s pre-\ndominant (ideological) substantive value rationalisation (Korczynski, 2001, 2003a). \nThese two dimensions do not sit easily together as ‘…the rise of the customer as a focus \nof authority and identity creates potentially significant implications for (bureaucratised) \nproduction relations within service work. However, these are not totalizing implications \n(as organisational) control is best theorised as being informed by the dual logic of \ncustomer orientation and continuing rationalisation’ (Korczynski et al., 2000: 684). \nCentral to COB theory, therefore, is the construction of a Weberian ideal type service \norganisation common to ‘consumer capitalism’ characterised as a Customer Oriented \nBureaucracy where the production of customer service necessitates dual and opposing \nobjectives (Korczynski, 2003a). \n    \nThe dual logic is a source of constant organisational contradiction and tension. \nMoreover, front-line service workers acutely experience these tense and contradictory \npressures. In a continuous juggling act, they try to process the requisite quantity of \ncustomers within a prescribed format while relating to each customer as an individual \nwith varying desires. Therefore, customer service is experienced as ‘…a clash between \nthe discipline, rationality and asceticism required in production and the indiscipline, \nirrationality and hedonism of consumption’ (Korczynski, 2001: 82). This contradictory \nstate is an inevitable condition of contemporary service production. Consequently, day-\nto-day, customer service creates a ‘fragile social order’ that is inherently unstable and \nsubject to constant breakdown, reconstruction and amendment (Korczynski 2001; \n2002).  \n \nKorczynski pays tribute to Ritzer’s neo-Weberian ‘McDonaldization’ thesis (1996) by \naccepting his characterisation of contemporary bureaucratic rationalisation as generating \nroutinised, scripted and dehumanised customer service. Ritzer is only half-right for \nKorczynski (2002), however, because he fails to acknowledge the existence of \ncountervailing tendencies to McDonaldization, principally the ‘myth of customer \nsovereignty’ and its desire to enchant the hedonistic customer - the bi-polar opposite of \nbureaucratic asceticism. Thus, for COB theory there exist two contradictory processes \nof rationalisation – customer orientation and bureaucratisation - continually clashing \nand accommodating in their day-to-day co-existence, producing uncertain outcomes. \nFor Weber (1978) and Ritzer (1996) there is little hope of escape from the ‘iron cage’ of \n 3 \nbureaucratic rationalisation. COB theory, however, argues that there exists the prospect \nfor front-line workers and customers to escape the ‘disenchantment’ of \nbureaucratisation via experiencing the enchantment of ‘personalised’ customer service \n(Korczynski 2005).  \n \nPrivileging customer service \nCOB theory maintains that customer orientation is more than an imposed and necessary \ncommercial condition for service organisations but rather a deeply infused social \nparadigm - a value rationalisation - where ‘…it becomes increasingly difficult to even \nfind the language to contest an action which is justified in terms of it helping to serve \nthe customer’ (Korczynski, 2002: 48-9). Yet COB theory formally rejects the post-\nmodernist assertion that the sphere of consumption, as opposed to production, is now \nthe principal arena of social relations and self-identity formation. This is because the \nargument overstates the dominance of consumption and fails to conceptualise \nbureaucratic continuities from producer-dominant periods of capitalism. Consequently, \ncustomer sovereignty is a myth because it is ‘one-eyed’ and is better understood as the \nraised importance of the customer (Korczynski et al., 2000).  \n \nCOB theory stresses that customer service involves a triadic relationship between front-\nline worker, customer and organisation. Korczynski (2002; 2005) refutes the tendency \nto ascribe the customer as either an ally or enemy of the front-line worker. He argues \nthat the producing organisation cannot presume to have unilateral determinative power \nover customer behaviour because in the act of seeking to structure the customer \nexperience there is a desire to enchant which in itself presupposes customer agency. \nCustomers, like front-line workers, seek a socially meaningful service experience within \nthe context of the contradictory clash between their supposed sovereignty and the \norganisation’s service norms. They adopt a complex range of stances at any given time \nand share front-line workers’ frustration at the myth of sovereignty and the \ndepersonalising pressures of service norms (see Bolton and Houlihan, 2005). For \nKorczynski (2005), the relationship between the customer and worker is not profoundly \nunequal, as argued by Hochschild (1983\/2003). Rather, the contradictions of the service \nencounter afford workers the space to influence substantively the behaviour of the \ncustomer while the customer is able to experience a sense of sovereignty as ‘…the \nparticipants in the service interaction to some degree step outside of their economic role \nand interact socially’ (Korczynski, 2004: 593).  \n \nKorczynski (2002) follows Leidner (1993) in stressing the importance of the socially \nembedded nature of service interactions, thereby implying that the potential pleasure \nderived from customer service is a principal source of job satisfaction for front-line \nworkers.  This is only achieved when the worker is able to fulfil a customer’s \nexpectations of enchantment and, in so doing, perpetuate the myth of customer \nsovereignty. A principal source of grievance, therefore, is worker frustration at not \nbeing able to deliver the level of service they believe is necessary to achieve \nenchantment. This occurs because front-line workers are regularly the victims of the \nCOB contradiction; caught between the rigidities and targets imposed by the company \nbureaucracy and customers’ realisation that their expectations of being sovereign are an \nillusion. To sustain this argument, COB theory rejects the notion that the systemic \ncommodification of service and the fetishised nature of customer relations are alienating \nfor the worker and the customer alike. Hence, Hochschild’s (1983\/2003) emotional \nlabour thesis is criticised for its ‘… sole focus on the harm of emotional labour…’ and \n 4 \n‘… that a fuller understanding of the social embeddedness of the economic exchange \nbetween service worker and customer allows a richer appreciation of the potential \npleasures and meanings in emotional labour’ (Korczynski, 2002: 155).  \n \nAside from the pleasure and pain of customer interaction there is no attempt to theorise \nand integrate into the COB other sources of grievance and potential conflict that may be \na shared experience with back-office workers in the same organisation. This is despite \nFrenkel et al’s ad hoc assertion that ‘…only in relation to job security and co-worker \nrelations could front-line workers be considered to be satisfied’ (1998: 957). Instead, \nCOB theory makes a careful distinction between ‘front line’ service work comprising \nsocially embedded interaction (e.g. checkout operators and cabin crew) and back-office \nwork (e.g. cleaners and baggage handlers) producing non-interactive service. \nConsequently, the COB conceptualisation does ‘… not translate theoretically to the \nback office environment’ (Korczynski, 2004: 112).  \n \nEmbryonic customer-oriented trade unionism \nInstability and fracture in the COB’s ‘fragile social order’ affords front-line workers \nspace to pursue the pleasurable, socially embedded side of customer work but always in \nthe context of the pain from routinisation and pseudo customer relations. Yet this pain \nalso in part generates another of the main pleasures of the job – ‘…the camaraderie \nexperienced with colleagues in the face of adversity’ (Korczynski, 2001: 98) pushing \nfront-line workers to seek redress through informal collective strategies via the \nformation of mutual support networks but at the same time contributing to maintaining \nthe ‘fragile social order’ (Korczynski, 2003b). These networks, called ‘communities of \ncoping’, are forms of nascent solidarity from which trade unionism can emerge \n(Korczynski, 2003b). This is because communities of coping make the ‘… social order \nless open to management intervention’ (2003b: 73) irrespective of the witting intentions \nof their members to merely offer mutual support. Thus, Korczynski (2002) argues that \nservice work is ‘fertile territory’ for trade unionism. The twist in the argument is that it \nis an embryonic collectivism constrained by the customer-oriented desires of front-line \nworkers (value rationalisation!). So in the case of flight crews the ‘…unspoken \nassumption is that conflict may exist for flight attendants, but that such conflict will \nonly rarely become open: attendants tend to take a deep breath and smile back at the \nirate customer’ (Korczynski, 2002: 177). Korczynski does accept, though, that union \nmilitancy is a feature of the service landscape by acknowledging the long history of \nconflict in the airline industry. Whether COB theory is able to accommodate such long-\nterm union militancy in services is discussed later.  \n \nArising from this conceptualisation of customer-oriented collectivism, Korczynski \n(2002) argues for a COB informed trade union strategy in services premised on a hybrid \nof the ‘organising’ and ‘partnership’ models currently central to debates on strategy in \nUK trade unionism (Heery, 2002). This is despite their apparent incompatibility. The \n‘organising’ model rests on the self-activity of workers and contesting managerial \nlegitimacy (Gall, 2001) generating a continuous struggle at the ‘frontier of control’ \nsustained by a class conflict ideology (Darlington, 2002). Conversely, the partnership \nmodel’s ideological starting point is co-operation with employers via a pragmatic \nacceptance of corporate objectives and managerial legitimacy (Heery, 2002). \n‘Partnership’, therefore, accepts the need for service workers to be imbued with \ncustomer-oriented and corporate values. What Korczynski (2002) does not acknowledge \nis that the organising model is also referred to as workplace unionism (Kelly, 1998). \n 5 \nHowever, the terms are not inter-changeable as the use of ‘organising’ signals that the \nmodel is applicable only at the early stages of unionisation, that is, during the \norganising phase. The use of the term workplace unionism, by contrast, implies a more \nlong-term, strategic and ideological orientation. \n \nIn practice, of course, the picture is more complex than is suggested by the models’ \ndichotomous definitions (Gall, 2001). The crucial point is that ‘organising – workplace’ \nand ‘partnership’ unionism have central tenets of belief offering diametrically opposed \nperspectives on the desirability of management driven customer-oriented work. \nKorczynski’s own interpretation of the respective models' implications for service work \ndownplays these contrasting ideological differences. Rather than understanding them as \ndistinct political alternatives, he suggests that it is a matter of which one to select as a \nstrategy depending on the pre-existing state of industrial relations:  \n \nIf contemporary service work is seen as offering a greater potential for interests shared between \nmanagement and workforce then a partnership approach makes sense… (Unions) must still be \ndemocratic, but in a representative rather than participative sense, and the sustaining ideology of \ntrade unionism is one of placing trade unions as a legitimate actor within a stakeholder \norganisation and society. (2002: 178) \n \n(If) service work is seen as increasingly steeped in conflict between management and the \nworkforce, then an organising model is the more appropriate one. Here unions seek to break into \nnon-unionised areas where the workforce is likely to be subject to greater exploitation, and to \nfocus their action on issues of conflict with management… (T)he mobilisation of the \nmembership may be necessary to keep forcing the employers’ hand and the sustaining ideology \nis that of class conflict. (2002: 179-80) \n \nThe characterisation of the models as principally strategies with sustaining ideologies \ncontingent upon changing circumstances is a denial of them as expressions of \nalternative political workplace strategies. Korczynski is thus able to follow Heery \n(2002) in arguing that an ‘either or’ approach is undesirable because ‘…if a central \ncharacteristic of contemporary work is its contradictory nature, then union strategies \nmust reflect this, implying an interplay and dynamic between elements of the two \napproaches’ (2002: 180). Furthermore, by limiting the applicability of the organising \nmodel to non-unionised contexts he effectively dismisses it as a basis for long-term \nunion organisation and activity.  \n \nIn practice, even the most combative unions make tactical decisions resulting in retreats, \nand accommodation with management. None of this means, however, that there is \nagreement with employers over their corporate objectives. Yet the notion of ‘co-\noperation’ in the partnership model requires just that. As Kelly argues, ‘…militancy and \nmoderation are best understood as two ends of a continuum’ (1998: 60-1) because \nunions are not free agents as they are subject to external constraints imposed by \nemployers, the state, economics, etc. when it comes to their goals, methods and \nresources. Hence, any ‘… observed degree of union militancy and moderation therefore \nresults from an interaction between unions and their environments and cannot \nnecessarily be regarded as a true measure of the preferences of the union’ (1998: 61). \n \nKorczynski’s portrayal of conflict and co-operation as complementary is only possible \nby conflating co-operation with tactical accommodation. He is able, therefore, to \neffectively dismiss the significance of fierce political debates within unions on their role \nand objectives, especially during industrial action (Darlington, 2002), political protest \n 6 \nand union elections (Smith, 2005). These battles for the right to interpret and articulate \nmembers’ interests are invariably between those groups of activists arguing for an \ninterpretation and strategy based on class struggle and those who reject the existence of \na profound structural class antagonism (see Kelly, 1998; Darlington, 2002; Gall, 2003). \nDespite this continuous organisational struggle, for Korczynski, unions’ choice of \nstrategy and ideology is one of expediency rather than profound political differences.  \n \nKorczynski’s argument is in keeping with COB theory’s Weberian concept of class. His \nimplied notion of collectivism is one founded solely on the expediency of articulated \nshared interests, exemplified by front-line ‘communities of coping’. It is a concept of \ncollectivism, following Weber, defined by ‘life chances’, status and power bestowed by \nthe capitalist market rather than one deriving from workers’ response to the exploitation \nand domination inherent in their relationship with capital as argued by Marxism: \n \nEmployers hire workers and seek to exploit their capacity to work in order to produce both value \n(sufficient to cover the worker’s wage or salary) and surplus value (to cover the employer’s \nprofit as well as interest, rent and dividends to shareholders. It is this inevitable exploitation and \ndomination of labour by capital that creates the conflict of interest between the social classes. \n(Kelly, 1998: 25) \n \nLike Weber (Wright, 2002), Korczynski rejects the notion that class is an objective \nrelation to capital existing irrespective of workers’ conscious, collective expressions of \nsolidarity. This, in turn, is theoretically disabling:  \n \nWeber’s overall argument was that capital and labour were not the main protagonists within the \npresent system. Each side was internally fragmented and ‘class conflict’ took place between \nvarieties of groups, which were formed in the market place. Workers had few common interests \nsince the focus was on the market rather than exploitation in the sphere of production… Weber \ncould not theoretically explain how shared economic interest of workers gives rise to class \nconscious organisations so ‘workers’ resistance has no theoretical foundation… (Allen, 2004: \n85-6) \n \nKorczynski suffers the same theoretical fate as Weber by arguing ‘communities of \ncoping’ are defined by front-line workers’ shared role in producing service and their \nnegative experiences of customers rather than as expressions of a collective solidarity \narising from common class experiences of domination by management and formal \nsubjugation to customers. COB theory is rendered silent regarding the basis on which \nback-office workers can affiliate and build a common collective consciousness with \ntheir front-line co-workers. Korczynski is left offering no more than a narrow set of \nsectional demands on improving customer service for the worker and customer as the \ncore strategic objective for service unionism aimed at ‘…structuring the service \nencounter to minimise the dark side of the customer surfacing, and to minimise it when \nit does surface’ (2002: 183).  \n \nPro-customer trade unionism and its limits \nKorczynski argues the bureaucratised side of customer service frequently undermines \nthe potential for meaningful and pleasurable customer relationships. This does not \nimply an anti-management stance because service management also pursues customer \norientation although not necessarily to the degree, and in ways, desired by staff and \ncustomers. Therefore, management too are victims of the dual logic, as it ‘… must walk \ndown its own fine lines, erring on one side and then the other over time, aware that its \nstandards are double’ (Korczynski, 2002: 185). \n 7 \n \nThe logical companion to the COB’s contradictory tensions acting as a principal source \nof worker grievance is that there is a rejection of service workers being subject to an \n‘intensification of work’ and ‘speed up’ as this implies an ‘anti-boss’ imagery and \nmanagerial culpability. Instead, Korczynski (2002) prefers to explain such phenomena \nas an extension of the bureaucratised rationalisation of work, thereby denying \nmanagement are the agents of exploitative capital. What remains is a Weberian \ncontested legitimacy between workers and management over the interpretation of good \ncustomer service that, in turn, allows Korczynski to let management off the culpability \nhook: \n \nWhat type of customer is being projected as the source of authority? Is it the disembodied \n‘average’ customer that management appears to prioritize, or is it the socially embedded specific \nindividual customer with whom service workers have empathy? ... Increasingly these become the \nkey contested questions of … legitimacy within the organizations of consumer capitalism. \n(2003a: 273) \n \nHere is the nub of Korczynski’s theoretical premise. By arguing that the key contested \nquestions in the front-line are now over the quality of customer service his only \ntheoretical basis for maintaining that service regimes are fertile territory for unionisation \nis that the COB continually frustrates front-line workers’ desire for meaningful relations \nwith customers. Even this is debatable, as it relies on management’s ability to \nmanufacture a believable vision of potential job satisfaction in order to preserve it as a \nrealistic aspiration. Taylor and Bain (2001) argue that their own call centre evidence \ncontradicts the claims of the COB adherents about the degree of satisfaction front-line \nworkers can extract from customer relationships. They conclude that whether ‘…labour \nis performed at the qualitative, or more commonly, the quantitative end of the spectrum, \nthe majority of call centre operators experience managerial control frontiers as \noppressive, far more than Frenkel et al. acknowledge’ (2001: 61). Even in the hi-skill \nand hi-pay world of ‘professional’ services where the client is sovereign rather than the \ncustomer the regime can still be experienced as oppressive. Anderson-Gough et al. \n(2000) in their study of international accountancy firms found that managerial control \nwas exercised via a discourse of privileging the ‘demanding client’. This refracted the \nsource of demands for behavioural compliance and commercial competitiveness so \nmuch that staff frequently resorted to blaming the client for management negotiated \ntight deadlines and unsocial hours. Apparently, even ‘professional’ regimes are not \nimmune to the pleasure side of client service becoming an aspiration tarnished by the \nsystemic demands of capitalist accumulation via the agency of management. \n \nConceptual fog \nCOB theory’s reliance on the ‘invisible hand’ of deepening rationalisation creates a \nconceptual fog when seeking to explain against what and whom front-line workers are \nsupposed to organise. This is because it closes off the possibility that the competitive \nand exploitative nature of capitalism driving the COB’s contradictory logic is also \nresponsible for the intensification of work via the agency of management. COB fails to \ntheorise the implications for work relations and workers’ collective consciousness of the \ncorporate search for ever-greater levels of effort, productivity, profit and \ncompetitiveness - increasing the rate of exploitation. Nor does it address the systemic \nrole played by management in attempting to secure greater ‘productivity’ from service \nworkers. COB theory, therefore, is unable to explain why many studies continue to find \n 8 \nthat the issues of pay, conditions and management regime remain central drivers to \nunionisation along side demands for customer service improvements (Gall, 2003).  \n \nKorczynski’s implied argument that the customer-oriented commitment of front-line \nstaff - a manifestation of value rationalisation - severely constrains the possibility of a \nthriving adversarial unionism also contradicts much of the evidence. Combative, anti-\nmanagement attitudes are prevalent not just in airlines or at the initial organising stage \nof service unionisation but can also develop over time where there is an established \nunion presence such as in UK financial services: \n \n…there is real derision at the way they’re being treated… and this is feeding through to them \nbeginning to learn the traditions of what we associate with ‘old fashioned’ trade unionism; more \nwidespread ‘them and us’ attitudes; more confidence and organisation to mount a fight. (Bifu \nClydesdale member quoted by Gall: 2001: 357) \n \nThis is not to say adversarial unionism is widespread in services or inevitable over time \nbut that it is possible and not uncommon. Paradoxically, Korczynski notes that \n‘…public sector workplaces have been where the rise of consumer authority has been \nexperienced most sharply’ (2003a: 268). Yet front-line public sector workers and those \nin privatised services provide some of the best contemporary examples of  sustained \ntrends in adversarial trade unionism such as the UK’s civil servant, fire fighter, post and \nrail unions (Smith, 2005). Elsewhere, the French SUD federation (Jefferys, 2003) and \nthe Italian COBAS movement (Ginsborg, 2001) have emerged and grown rapidly as \nmilitant ‘rank and file’ unions explicitly committed to the defence of working class \ninterests. In SUD and COBAS it is front-line public sector workers – especially in \npostal services, education and transport- who play central roles. \n \nRelated to the issue of front-line workers’ potential to pursue militant unionism is the \nquestion of popular social ideas feeding into and shaping anti-management and anti-\ncorporate sentiment. The anti-capitalist movement, par exemplar, has fanned, organised, \nconnected and given ideological expression to popular anti-corporate sentiment (Klein, \n2001) and otherwise isolated opposition to neo-liberal marketisation of employment and \npublic services (Harvey, 2005). With slogans such as ‘our world is not for sale’ \nencapsulating a widespread opposition to consumerism’s reduction of social interaction \nto marketised customer relations it raises the question of to what extent can workers \nimbued with customer-oriented values be immune to the counter-challenge of anti-\ncapitalist ideas? Korczynski is silent on this point because COB theoretically closes off \nthe possibility of anti-consumerist ideas competing with the corporate driven ideology \nof customer orientation. This is because it understands the rise of customer authority to \nbe a new process of value rationalisation, thereby, possessing a privileged position in \nthe arena of ideological struggle. Korczynski’s theorisation, in effect, grants customer \norientation near immunity to ideological competition from anti-capitalist argument. The \npractical consequence for service trade unionism is that COB theory sees only the \npossibility of front-line workers contesting the terms of customer service rather than \nquestioning its very desirability as exploitative and alienating for both parties (Cox, \n1998). The outcome is a conservative theorisation of front-line service worker trade \nunionism.  \n \nConclusion  \nCOB theory suggests that for front-line workers the rise of customer authority has made \ncustomer service the pivotal moment of their work experience. The theoretical \n 9 \nimplication being that front-line worker unionism should organise principally around \nwinning improvements in the quality of the customer service experience for the worker \nand customer alike. This produces a twofold argument. First, front-line workers are \nqualitatively different to other workers owing to their experience of customer service as \nsocially embedded and its potential to be fulfilling for worker and customer alike. This \ncoincidence of interests enables potential solidarity between front-line workers and \ncustomers. Second, there is a theoretical closure on front-line collectivism emerging in \nresponse to the common class experiences of exploitation and domination by \nmanagement. Therefore, Korczynski is unable to account for front-line collective unity \nwith back-office co-workers and other workers but can explain solidarity with \ncustomers.  \n \nThis closure is because managers are co-victims of COB’s contradictions. As the \ncustodians of customer service norms (bureaucratic rationalisation), they are sources of \nboth pleasure and pain for staff. They are not, however, the agents of systemic \nexploitation as argued by the Marxist cum labour process traditions where what COB \nidentifies as deepening bureaucratic rationalisation is understood as the intensification \nof labour and an increase in the rate of exploitation. Consequently, Korczynski’s \nargument for unionisation essentially downplays, if not rejects, the potential for \nstrategic workplace unionism because its rationale is a continual challenge to the \n‘frontier of control’ based on the premise that management’s corporate objectives are \nillegitimate. Related to this is the assumption that a sustaining trade union ideology \nbased on questioning ‘consumer capitalism’s’ extolling of the customer is effectively \nunassailable as an idea and practice. For Korczynski, unions can only contest the terms \nof customer service, not the architecture of a capitalist society increasingly suffused by \nthe alienation of commodified relationships.    \n \nReferences \n \nAllen, K. (2004) Max Weber. London: Pluto. \n \nAnderson-Gough, F., Grey, C. and Robson, K. (2000) ‘In the name of the client: the \nservice ethic in two professional service firms’, Human Relations 53 (9): 1151-74. \n \nBolton, S.C. and Houlihan, M. (2005) ‘The (mis)representation of customer service’, \nWork, Employment and Society 19 (4): 685-703. \n \nCallinicos, A. (1999) Social theory: an historical introduction. Cambridge: Polity. \n \nCox, J. (1998) ‘An introduction to Marx’s theory of alienation’, International Socialism \n79: 41-62. \n \nDarlington, R. (2002) ‘Shop stewards’ leadership, left wing activism and collective \nworkplace union organisation’, Capital & Class 76: 95-126. \n \nFrenkel, S.J., Korczynski, M., Shire, K.A. and Tam, M. (1999) On the Front Line – \norganization of work in the information economy. London: Cornell University. \n \nGall, G. (2001) ‘From adversarialism to partnership? Trade unionism and industrial \nrelations in the banking sector in the UK’, Employee Relations 23(4): 353-75. \n 10 \n \nGall, G. (ed.) (2003) Union Organizing. London: Routledge.  \n \nGinsborg, P. (2001) Italy and its Discontents. London: Allen Lane.  \n \nHeery, E. (2002) ‘Partnership versus organising: alternative futures for British trade \nunionism’, Industrial Relations Journal 33(1): 20-35. \n \nHarvey, D. (2005) Neoliberalism. Oxford: OUP \n \nHochschild, A. (1983\/2003) The Managed Heart: commercialization of human feeling. \nLondon: University of California. \n \nJefferys, S. (2003) Liberté, Égalité and Fraternité at Work: changing French \nemployment relations and Management. Basingstoke: Palgrave-Macmillan. \n \nKelly, J. (1998) Rethinking Industrial Relations. London: Routledge. \n \nKlein, N. (2001) No Logo.  London: Flamingo. \n \nKorczynski, M. (2001) ‘The contradictions of service work: call centre as Customer \nOriented Bureaucracy’ in A. Sturdy, I. Grugulis and H. Willmott (eds.) Customer \nService: Empowerment and Entrapment, pp.79-101. London: Palgrave. \n \nKorczynski, M. (2002) Human Resource Management in Service Work. Basingstoke: \nPalgrave. \n \nKorczynski, M. (2003b) ‘Communities of Coping: Collective Emotional Labour in \nService Work’, Organization 10(1): 55-79. \n \nKorczynski, M. (2003a) ‘Consumer Capitalism and Industrial Relations’ in P. Ackers \nand A. Wilkinson (eds.) Understanding Work & Employment, pp. 265-77.  Oxford: \nOUP.   \n \nKorczynski, M. (2004) ‘Back-office service work: bureaucracy challenged? Work, \nEmployment and Society 18(1): 97-114. \n \nKorczynski, M. (2005) ‘The point of selling: capitalism, consumption and \ncontradictions’. Organization 12(1): 69-88. \n \nKorczynski, M., Shire, K., Frenkel, S. and Tam, M. (2000) ‘Service Work in Consumer \nCapitalism: Customers, Control and Contradictions’, Work, Employment and Society 14 \n(4): 669-87. \n \nLeidner, R. (1993) Service Work and the Routinization of Everyday Life.  London: \nUniversity of California. \n \nRitzer, G. (1996) The McDonaldization of Society: an investigation into the changing \ncharacter of contemporary life. Newbury Park, C.A.: Pine Forge Press. \n \n 11 \nRoyle, T. and Towers, B. (eds.) (2002) Labour Relations in the Global Fast Food \nIndustry. London: Routledge. \n \nSmith, M. (2005) ‘Politics and the struggle’, International Socialism 105: 111-123. \n \nTaylor, P. and Bain, P. (2001) ‘Trade unions, workers’ rights and the frontier of control \nin UK call centres’, Economic and Industrial Democracy 22(1): 39-66. \n \nWeber, M. (1978) Economy and Society. Berkeley: University of California. \n \nWright, E. O. (2002) ‘The shadow of exploitation in Weber’s class analysis’, American \nSociological Review 67 (December): 832-853. \n \n \nPaul Brook \nPaul Brook is a Senior Lecturer at Manchester Metropolitan University Business \nSchool. His research interests include Marxist and Labour Process theory, front-line \ncustomer service work and trade unionism in services. He is currently working on a re-\nevaluation of Hochschild’s foundational use of Marx’s theory of alienation in her  \nemotional labour thesis. \nAddress: Manchester Metropolitan University Business School, Aytoun Building, \nAytoun Street, Manchester M1 3GH, UK. E-mail: p.brook@mmu.ac.uk  \n"}