{"doi":"10.1144\/1470-9236","coreId":"57345","oai":"oai:nora.nerc.ac.uk:9932","identifiers":["oai:nora.nerc.ac.uk:9932","10.1144\/1470-9236"],"title":"The role of biofilms in subsurface transport processes","authors":["Coombs, P.","Wagner, D.","Bateman, K.","Harrison, H.","Milodowski, A.E.","Noy, D.","West, J.M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"Landfill and radioactive waste disposal risk assessments focus on contaminant transport and are principally concerned with understanding the movement of gas, water and solutes through engineered barriers and natural groundwater systems. However, microbiological activity can affect transport processes, changing the chemical and physical characteristics of the subsurface environment. Such effects are generally caused by biofilms attached to rock surfaces. Currently most existing transport models have to introduce additional assumptions about the relationships between the microbial growth and changes to the porosity and permeability. These relationships are particularly poorly understood. This paper reviews recent experimental work directed at the development of biofilms and their influence on subsurface flow and the transport of contaminants in intergranular and fracture porosity flow systems. The results are then discussed in terms of a more complex conceptual model. \\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/57345.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/9932\/1\/Biofilm_Paper_Final.pdf","pdfHashValue":"b9ddfc01f3fb1845349d91e3e9d714ad5f0555c5","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:9932<\/identifier><datestamp>\n      2012-11-22T12:10:21Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9932\/<\/dc:relation><dc:title>\n        The role of biofilms in subsurface transport processes<\/dc:title><dc:creator>\n        Coombs, P.<\/dc:creator><dc:creator>\n        Wagner, D.<\/dc:creator><dc:creator>\n        Bateman, K.<\/dc:creator><dc:creator>\n        Harrison, H.<\/dc:creator><dc:creator>\n        Milodowski, A.E.<\/dc:creator><dc:creator>\n        Noy, D.<\/dc:creator><dc:creator>\n        West, J.M.<\/dc:creator><dc:description>\n        Landfill and radioactive waste disposal risk assessments focus on contaminant transport and are principally concerned with understanding the movement of gas, water and solutes through engineered barriers and natural groundwater systems. However, microbiological activity can affect transport processes, changing the chemical and physical characteristics of the subsurface environment. Such effects are generally caused by biofilms attached to rock surfaces. Currently most existing transport models have to introduce additional assumptions about the relationships between the microbial growth and changes to the porosity and permeability. These relationships are particularly poorly understood. This paper reviews recent experimental work directed at the development of biofilms and their influence on subsurface flow and the transport of contaminants in intergranular and fracture porosity flow systems. The results are then discussed in terms of a more complex conceptual model. \\ud\n<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9932\/1\/Biofilm_Paper_Final.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Coombs, P.; Wagner, D.; Bateman, K.; Harrison, H.; Milodowski, A.E.; Noy, D.; West, J.M..  2010  The role of biofilms in subsurface transport processes.   Quarterly Journal of Engineering Geology and Hydrogeology, 43 (2). 131-139.  https:\/\/doi.org\/10.1144\/1470-9236\/08-029 <https:\/\/doi.org\/10.1144\/1470-9236\/08-029>     \n <\/dc:identifier><dc:relation>\n        http:\/\/qjegh.geoscienceworld.org\/content\/vol43\/issue2\/<\/dc:relation><dc:relation>\n        10.1144\/1470-9236\/08-029<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/9932\/","http:\/\/qjegh.geoscienceworld.org\/content\/vol43\/issue2\/","10.1144\/1470-9236\/08-029"],"year":2010,"topics":[],"subject":["Publication - Article","PeerReviewed"],"fullText":" 1\nThe role of biofilms in subsurface transport processes \n \nP. Coombs, D. Wagner, K. Bateman, H. Harrison, A. E. Milodowski, D. Noy  \nand J. M. West \n \nBritish Geological Survey, Kingsley Dunham Centre, Keyworth, Nottingham, NG12 5GG, United \nKingdom   Corresponding author e-mail address: pcoo@bgs.ac.uk \n \n \nWords: 5623 \nAbbreviated title: Biofilms in subsurface transport processes \n \n \nAbstract \n \nLandfill and radioactive waste disposal risk assessments focus on contaminant \ntransport and are principally concerned with understanding the movement of gas, \nwater and solutes through engineered barriers and natural groundwater systems.  \nHowever, microbiological activity can impact on transport processes changing the \nchemical and physical characteristics of the subsurface environment.  Such effects are \ngenerally caused by biofilms attached to rock surfaces.  This paper will present the \nresults of an experimental study of the significance of biofilm growth on groundwater \nflow and the transport of contaminants in intergranular and fracture porosity flow \nsystems. \n \n \nRisk assessments for landfills and geological repositories for radioactive waste are \nprimarily based on the precepts of contaminant transport; and are concerned with \nunderstanding the movement of gas, water and solutes through engineered barriers \nand natural groundwater systems, within the concept of ‘Source’, ‘Pathway’ and \n‘Receptor’. The emphasis on solute migration for landfill investigations is reflected in \nthe theoretical development used during numerical simulation. However, microbes \nliving in such environments can have an impact on transport processes (Chapelle \n2000; Cunningham et al. 1997; Fredrickson et al. 1989; Keith-Loach & Livens 2002; \nWest & Chilton 1997; West et al. 2006).  Microbial activity in any environment is \ngenerally located on chemical or physical interfaces, usually within biofilms, and the \nimpacts can be both physical (e.g. altering porosity) and\/or chemical (e.g. changing \npH, redox conditions) and may result in intracellular or extracellular mineral \nformation or degradation (Beveridge et al. 1997; Ehrlich 1999; Konhauser et al. 1998; \nMilodowski et al. 1990; Tuck et al. 2006). Where biofilm growth in a crystalline host \nrock promotes mineral precipitation it can reduce water inflow and this can be a \npositive effect for limiting the transport of contaminants. Recent experimental work \nhas investigated some of these chemical and physical effects in more detail in the \ncontext of the geological containment of radioactive waste.  This paper will examine \nsome of these studies and will indicate the significance of biofilms in influencing both \ngranular and fracture flow.  \n \n  \n                                                 \n \n 2\nBiofilms \n \nA biofilm is an agglomeration of microbial cells and their excreted organic and \ninorganic products that is attached to, or coats, mineral surfaces or other substrates \n(Taylor & Jaffe 1990a). Biofilms are very common in the geosphere and biosphere, \nforming in diverse environments including the surfaces of human teeth (Marsh 2004), \nwall murals and stone monuments (Dornieden et al. 2000), stream sediments \n(Konhauser et al. 1998), cave and mine walls (Plate 1) and the subsurface (Tuck \n2006).  In such natural systems, they often comprise a mixture of interacting \nmicrobial species forming complex ecosystems. Biofilm thickness is extremely \nvariable ranging from a single cell monolayer, to thick mucous microcolonies of \nmicrobes held together by Extracellular Polymeric Substances (EPS) (Beyenal et al. \n2004; Bishop et al. 1995; Fletcher 1991; Paulsen et al. 1997; Wimpenny et al. 2000). \nIn all environments, including the subsurface, biofilm formation is initiated by the \nattachment of a microbe to a solid surface. Attachment may be a reversible transitory \nphysicochemical attraction or may become permanent if the EPS forms a strong \nchemical bridge to the solid surface (Dowd et al. 2000). The EPS provides a matrix \nfor the attachment of microbial cells and influences the functioning and survival of \nbiofilms in hostile environments by providing a microenvironment for viable \nmicrobial activity that may be very different to the ambient surroundings.  Biofilm \nstructure appears to be of three main types: planar structures; stacks of microcolonies \nof microbes held together by EPS; or mushroom or tulip shaped formations \n(Wimpenny et al. 2000; Beyenal et al. 2004). However, laboratory grown biofilms \noften comprise interwoven filamentous biomass with micropores of 20-200µm \ndiameter (Okabe et al. 1998).   \n \nThe formation and development of biofilms in the subsurface environment will \ndepend on the presence of the microbes themselves; plus the availability of nutrients, \nenergy sources and water necessary for life processes (West & Chilton 1997).  In a \nvery low nutrient\/energy environment with low groundwater flow, biofilms may not \nform and organisms may be dormant or maintain a very low metabolic rate.  In this \nsituation, it is unlikely that biofilm formation will influence the transport properties of \nthe surrounding rock. However, in environments where nutrients and energy are more \navailable, and where groundwater flow may be higher, biofilm formation will take \nplace.  As a result, the transport properties of the host rock will be altered to a greater \nor lesser degree depending on the characteristics and thickness of the biofilm and the \nnature of the rock itself.  Such alteration in rock transport properties will be important \nto contaminant movement, as illustrated by some recent studies. \n \n \nMicrobial transport studies associated with the Äspö Hard Rock Laboratory, \nSweden \n \nThe Äspö Underground Research Laboratory (URL) has been used for many studies \nand experiments evaluating aspects of the geological disposal of radioactive waste in \nhard rock (granodiorite) environments (SKB, Annual Reports 2003, 2004). The \nsignificance of microbiological processes in the containment of radioactive waste has \nlong been recognised (West et al. 1982; West 1995, West & McKinley 2002) and, \nconsequently, detailed evaluations of the biofilms present on the walls of the URL and \n 3\non the significance of indigenous microbial populations has been a key area of work \n(see Pedersen 1999 and references therein).   \n \nA recent in-situ study at the URL examined the redox buffering of groundwater in \nvertical fractures zones penetrated by recent, oxidising, shallow-recharged meteoric \nwater, simulating processes that might occur in repository construction, and which \ncould alter the geochemical experiment. This showed that indigenous bacteria were \ncapable of maintaining reducing conditions in the deep groundwaters (Banwart 1995).  \nAs a result, a further laboratory experimental study was undertaken to simulate the \ninteractions of microbes with mineralogical surfaces associated with groundwater \nflow systems at Äspö (Hama et al. 2001). Indigenous iron-reducing bacteria and \nsulphate-reducing bacteria were introduced in Äspö groundwater flowing through \neither columns or continuously stirred tank reactors (CSTR) packed with crushed \nÄspö diorite rock. The columns containing the organisms became blocked within a \nfew days and no flow was possible. Petrographic analyses of the column residues \ninoculated with the bacteria indicated that the reduction in permeability in the \ncolumns was associated with (1) mobilisation of ‘fines’ from grain surfaces and their \naccumulation in intergranular pore throats (Plate 2); (2) development of filamentous \norganic biofilaments (Plate 3); and (3) formation of secondary mixed-layer chlorite-\nsmectite.  The observed change in permeability, in the biotic experiments, was \nsurprising because of the low concentration of available nutrients (C, S, N, P) and \nbecause any mineralogical changes involved (and hence changes in porosity) were \nvolumetrically small.  Although only a small amount of biofilament was produced, it \nformed a filamentous mesh that acted as a sieve, trapping any ‘fines’ migrating within \npore throats, and also significantly decreased pore throat size whilst simultaneously \nincreasing pore tortuosity.  The liberation of ‘fines’ was not observed in the abiotic \nexperiment and their appearance seemed to be related to the presence of the bacteria – \npossibly influenced by surfactant properties of biocrobial exudates. The formation of \nthe secondary chlorite-smectite during the biotic experiment may have also had an \ninfluence and this again appeared to be related to the presence of the organisms.  The \nsame formation of secondary clay was also observed in the 3 month long CSTR \nexperiments although smectite, rather than the mixed-layer chlorite-smectite, was \ndetected.  Once again, the amount of smectite formed was greater in the biotic CSTR \nexperiments demonstrating that the bacteria were having a significant influence on \nclay mineral formation in the experiments.  More details of these studies are described \nelsewhere (West et al. 1998; Hama et al. 2001). \n \n \nOther studies at the Äspö URL examined radionuclide sorption processes which \ncompared the adsorption capacity of granitic rock to biofilms grown in situ on glass \nand rock surfaces (Anderson et al. 2006). After immersing the surfaces for 42 days in \nanaerobic synthetic groundwater containing a number of radioactive tracers the \nadsorption and distribution of the radionuclides was investigated using 2D \nautoradiography. Results showed that the rock absorbed more 60Co, 99Mo, 241Am, \n237Np and 234Th per unit area when compared to the biofilm grown on the glass slides \nwhilst the biofilm absorbed more 147Pm than the rock. Biofilms can form a barrier \nbetween the rock and groundwater and may slow down radionuclide diffusion to the \nrock. These results suggested that differences in adsorption were dependant upon the \nchemical properties of the individual radionuclides and the availability of different \nsurface functional groups modified by the presence or absence of biofilms. \n 4\n \nFurther experiments by Tuck et al (2006) used packed columns and stirred batch \nreactors to simulate microbial-geochemical interactions in deep subsurface low \nnutrient granitic environments. The columns, containing crushed Äspö grandodiorite \nand a single or mixed culture of chomolithotrophic bacteria became impermeable to \nsynthetic Äspö groundwater after 5 days. Analysis revealed copious filamentous \nbiofilm, encrusted with finer-grained material, across pore spaces with limited \nattachment sites on large grains in those columns.  The work also suggested that the \nindigenous bacteria were capable of surviving in relatively low nutrient conditions \nand that bacteria can either concentrate relevant chemical species for mineral \nformation in localised microenvironments or may accelerate clay formation. This \nstudy implies that the localised hydrological regime of a granitic environment can be \nchanged, particularly if new nutrient sources are introduced e.g. via links to surface \nwater; or via links to the repository components. Biogenic mineral precipitates and \ntrapped mineral matter are much more chemically and physically stable than the \nbiofilm, and can persist in the pore system long after the biofilm has decayed or been \nremoved (Brydie et al. 2005). \n \nStudies by Ferris et al. (1999) with iron oxides and groundwater samples collected \nfrom the Äspö site looked at the extent to which dissolved metals sorbed into \nbacteriogenic iron oxides in a deep, hard rock groundwater environment. Results of \nmetal distribution coefficients (Kd values) showed Kd values decreased with \nincreasing iron oxide content which appeared to be influenced by the bacterial organic \nmatter in the solids. This has implications for the transport and fate of dissolved \nmetals in groundwater systems where there is contact between iron oxides and \nbacterial organic matter. \n \nWork by West et al. (1991) looked at radionuclide sorption onto a host rock, calcium \nmontmorillonite (Fuller’s Earth) as an important retarding mechanism. These studies \nused a batch sorption method (West et al. 1986) of groundwater spiked with 137Cs and \npure rock and microorganisms under a variety of conditions. In anaerobic conditions \nCs and microbes were sorbed onto the rock material. A reduction in Cs was observed \nsuggesting that the varying amounts of biofilm produced were able to bind metals \nfrom solution thus lowering the amount of Cs in the groundwater. Their results \nshowed that the presence of microbes decreased the amount of retardation of 137Cs by \nthe solid phase.  \n \nExperiments to better understand the physicochemical processes occurring at the \nbiofilm-mineral interface were designed by Vaughan et al. (2001). These experiments \nused miniature flow cells to grow single species biofilms within a simulated rock \nfracture environment. The structure of the resulting biofilms and the bacterial \ndistribution was determined using confocal scanning laser microscopy. Results \nindicated a greater permeability of the biofilm in the centre compared to the \nsurrounding matrix areas surrounding it. This suggested that biofilms might have the \neffect of producing localised flow gradients and may have an important impact on \nhydraulic properties when modelling a flowing system. \n \nExperiments have shown that fluid movement is influenced by the presence of \nmicroorganisms in the system, in particular the presence of biofilms. Where \nconditions are suitable there is potential for biofilaments to establish (in a matter of \n 5\ndays) causing pore blockages resulting in a decrease in permeability of the porous \nmedia and a change in the local fluid flow patterns. Extensive formation of biofilm \nreduces pore space, which can lead to eventual blocking of the pore system (Taylor \nand Jaffé 1990a;b; Taylor et al. 1990) referred to as ‘bioclogging’ (Brydie et al. \n2005). Brydie et al. (2005) observed a 70 % reduction in the permeability of sand due \nto bioclogging. Even greater permeability reductions (three orders of magnitude) were \nobserved in earlier studies by Taylor and Jaffé (1990a).  \n \nModelling of biofilms \n \nThere have been numerous attempts to model microbial growth in sub-surface \nenvironments and its effects on contaminant transport in groundwater. These models \nmay be grouped into a number of categories depending upon sophistication and the \nnature of the processes that they try to represent: ‘microbe mass balance’ models, \n‘coupled microbe growth and mass transport’ models and ‘microbial transport and \nclogging’ models.  \nThe microbe mass balance model is perhaps the simplest in concept since it just \nattempts to calculate the limits to growth from the available supplies of nutrients and \nenergy provided by the flow of groundwater and the leaching of the solid phase. This \nstyle of model was first proposed by Grogan and McKinley (1990) and similar models \nwere used by Baker et al. (1998) and Jolley et al. (2003) \n \nThere are numerous models of ‘coupled microbe growth and mass transport’ reported \nin the literature over the past 30 or more years. A review of these models by Baveye \nand Valocchi (1989) divided them into three groups according to the treatment of the \nattached bacteria. The first group (I) consisted of those models that neglected pore \nscale processes and assumed that the bacteria respond directly to the macroscopic \nbulk fluid composition. The other two groups were based upon the assumptions of the \nbacteria forming microcolonies (II) or biofilms (III). Examples of the first group of \nmodels may be found in Corapcioglu and Haridas (1984), Corapcioglu and Haridas \n(1985), and Kindred and Celia (1989). Examples of the microcolonies approach are \nfound in Molz et al. (1986) and Widdowson et al. (1988) whilst the biofilm approach \nwas used, for example, in Rittmann et al. (1980) and Bouwer and McCarty (1984). \nBaveye and Valocchi noted the formal similarities in all the mathematical models \nwith the differences arising in the detailed implementation of particular terms. \nWiddowson (1991), in commenting on this review, noted the particularly close \nassociation of model types I and II, but demonstrated that the differences in detail \ncould result in noticeable differences in the calculated concentrations. Widdowson \nalso questioned the applicability of the biofilm concept to subsurface environments. \n \nMicrobial transport and clogging models are really a sub-set of those described in the \nprevious section.  They are distinguished by the fact that they attempt to model the \nchanges in the hydraulic properties of the medium as well as the microbial growth and \nconsequent changes of porewater chemistry. Examples of such models may be found \nin Corapcioglu and Haridas (1984), Corapcioglu and Haridas (1985), Vandevivere et \nal. (1995), Clement et al. (1996), and Thullner et al. (2004). \n \n \n \n 6\nDiscussion \n \nThese studies show the biofilm formation can have a significant impact on the \nporosity and permeability of fractures and porous media.  These are illustrated in \nFigure 1(a) and can be summarised as: \n \n1. Direct effects, including: (reduction of fluid flow by constriction of pore \nthroats and increasing the tortuosity of the pore network flow paths; sorption \nof contaminants onto biofilm; uptake of contaminants onto mobile and motile \nmicrobes). \n2. Indirect effects, including: (biofilm\/groundwater interaction with pH; redox \nchanges; alteration of groundwater chemistry; rock\/biofilm interaction with \npH, redox changes, alteration of rock surface; biomineralisation). \n \n \nFigure 1(b) summarises how a pore or fracture flow path is blocked by the growth of \nbiofilm filaments ‘capturing’ mineral particles which effectively stops fluid \nmovement.  Figure 1(c) shows the effect of high fluid flow on biofilm removal from a \nsurface which, in effect, indicates the shearing off of a large section of biofilm which \nwould then be transported until it lodges and potentially blocks another flow path.  \nThis can be viewed as analogous to what occurs in the coronary heart disease, where \nfatty deposits on blood vessel walls slow down blood flow and can potentially shear \noff and lodge in other narrowed blood vessels (http:\/\/www.bhf.org.uk\/default.aspx - \naccess date 16 May 2007).   \n \nThe direct effect of the accumulation of microbial biomass and EPS is to reduce pore \nspaces in porous media which can lead to eventual blocking of the pore system \n(Taylor and Jaffé 1990a & b; Taylor et al. 1990). Biofilms may further reduce \npermeability by acting as a filter, trapping fine-grained mineral particles and colloidal \nmaterial moving through the pore system and increasing pore tortuosity (Hama 1997). \nIn addition, microbially-mediated mineral precipitation can result in plugging or \ncementing of pore space thus further reducing porosity and permeability. \nExperimental studies have shown that even in groundwater systems with a low \nnutrient supply, small amounts of biofilm can form that trap particulate material and \neffectively prevent fluid flow after a few hours (West et al. 1998; Hama et al. 2001). \nSuch biogenic mineral precipitates and trapped mineral matter has a much higher \nchemical and physical stability than the biofilm, and therefore can persist in the pore \nsystem long after the biofilm has decayed or been removed (Brydie et al. 2005). The \nphenomenon of pore clogging is a well known problem in soil science, water \ntreatment and the petroleum industry (Taylor & Jaffé 1990a). In the oil industry, the \nattempt to improve oil recovery by injecting water into hydrocarbon reservoirs is \noften accompanied by the accumulation of biofilms resulting in clogging and \nformation damage near the injection well.  \n \nEven the development of smallest amounts of biofilm can alter transport properties of \nporous media systems significantly. As many biofilms are filamentous or bridge \nacross pores (West et al. 1998; Hama et al. 2001; Brydie et al. 2005) they narrow or \ndivide pore spaces into smaller pores separated by biofilm. Both reduced pore throat \nsize and increased flow-path tortuosity result in a dramatic decrease in permeability. \nThis effect is analogous to the significant reduction of permeability observed in \n 7\nsandstone reservoirs and aquifers, associated with the growth of very small amounts \nof authigenic fibrous illite clay (Milodowski et al. 1987). \n \nThe formation of biofilms can also affect flow velocity in its immediate vicinity. \nPrevious studies showed that the presence of biofilms has influence on \nhydrodynamics and may increase or decrease the frictional resistance, depending on \nthe degree of biofilm accumulation. In experiments using a flat plate reactor with and \nwithout biofilm (Lewandowski et al. 1992) a considerable difference in flow velocity \nwas noticed. The plate reactor without biofilm developed a jet form indicating flow \ninstability; on the other side in the presence of the biofilm a viscous flow was fully \ndeveloped. These observations resulted in the conclusion that the biofilm must have \nsmoothed the surface in order to allow a more stable flow in the presence of the \nbiofilm than in its absence. These experimental results differ from the popular opinion \nthat biofilm formation increases the surface roughness in conduits. However, little is \nstill known about these factors and recent studies seem to demonstrate that processes \nare much more complex then originally assumed. A study by Stoodley et al. (2002) \ninto deformation and detachment of biofilm structures suggested that biofilms grown \nunder higher fluid shear formed filamentous streamers, were more strongly adhered \nand had a stronger EPS matrix than those grown under lower fluid shear conditions.  \n \nThe diffusion of radionuclides between fractures and rock matrix strongly influences \nthe persistence of groundwater contamination in fractured rocks. Pathways within \nthese fractures make it easy for contaminants to migrate, allowing solutes and \ncolloidal particles (e.g. bacteria) to travel long distances in short periods of time in \ncertain hydrogeological conditions. In this environment the presence of biofilms can \nhave a significant effect on the solute transport properties of the matrix, and thus the \nmobility of contaminants within the system (Neretnieks 1980). \n \nThe development, morphology and physical stability of biofilms is influenced by \nseveral factors such as hydrodynamic and chemical conditions, nature of the substrate \nand nutrition supply. Changes in fluid chemistry can destabilise the biofilm, causing it \nto break up. High flow rates can apply shear on the biofilm, also causing it to break up \n(Taylor & Jaffé 1990c; Brydie et al. 2005). Both of these processes could result in the \nmobilisation of microbial material through the pore system and consequently cause \nclogging elsewhere in the system. In a study by Leon-Morales et al. (2004), quartz \nsand-filled columns and quartz sand-packed microscope flow cells were used to \ninvestigate the influence of ionic strength on stability and mobility of the clay colloid \nlaponite and a biofilm forming bacterium Pseudomonas aeruginosa. Experiments \nshowed that in clean bed columns the mobility of laponite was strongly affected by \nionic strength. The introduction of NaCl at concentrations of 1 x 10-2 M resulted in \nalmost complete retention of laponite within the sand columns. The mobility of \nPseudomonas aeruginosa was reduced by NaCl concentrations of up to 1 M but the \neffect was not as pronounced as for laponite. At relatively high ionic strengths  \n(7 x 10-2 M), the introduction of laponite into a sand column containing a biofilm \ncaused clogging and enhanced shear stress and thus laponite retention and \nremobilisation of a portion of the attached cells. By contrast in low ionic strength \nsolutions (6.2 x 10-4 M) detachment of biofilm cells and an altered laponite elution \nprofile was observed. Further experiments using different types of cations showed that \ndivalent cations can have a strong stabilizing effect on biofilms also increasing the \nretention of colloids. Environmental influences (e.g. intense rain events) can have \n 8\nmajor impact on ionic strength and\/or the type of ions present and therefore are able \nto dramatically change the mobility of colloids and thus of pollutants near the surface. \n \n \nSummary \n \nBiofilm formation in the subsurface environment can have significant impact on the \nporosity and permeability of fractures and porous media. Experimental work has also \nshown the complexity of the biological\/geochemical\/physical processes involved in \ntransport processes. This paper has discussed the results of a number of studies on the \neffects of  biofilms on contaminant transport and fracture systems. The literature \nshowed there has been some valuable work undertaken in this field but more data are \nrequired from experimental studies to provide quantitative data necessary for the \ndevelopment of biofilm models. In particular the effects of biofilms on contaminant \nand radionuclide transport under varying physical and chemical conditions are of \nmajor interest. This concurs with tighter legal regulations for radioactive and \ncontaminant waste disposal and implies that more studies are necessary for a better \nunderstanding of microbial influenced processes beneath the surface. A current study \n(‘Biotran’) carried out by the British Geological Survey is looking into the effects of \nbiofilm growth on transport processes under varying conditions (pH, ionic strength, \nphage input). However, this is only the experimental beginnings of an area which is \nstill little understood. \n \n \nAcknowledgements \n \nThis paper is published with permission of the Executive Director of the British \nGeological Survey (NERC). \n \n \n \nReferences  \n \nAnderson, C., Pedersen, K., Jakobsson, A. M. 2006. Autoradiographic comparisons of \nradionuclide adsorption between subsurface anaerobic biofilms and granitic host \nrocks. Geomicrobiology Journal 23, 15-19. \n \nBaker, S J, West, J M, Metcalfe, R, Noy, D J, Yoshida, H, and Aoki, K. 1998. A \nbiogeochemical assessment of the Tono site, Japan. Journal of Contaminant \nHydrology 35, 331-340. \n \nBanwart, S. 1995. The Äspö redox investigations in block scale project summary and \nimplications for repository assessment. Swedish Nuclear Fuel and Waste Management \nCo., Stockholm, Sweden. SKB Technical Report, 95-26. \n \nBaveye, P, & Valocchi, A J. 1989. An evaluation of mathematical models of the \ntransport of biologically reacting solutes in saturated soils and aquifers. Water \nResources Research 25(6), 1413-1421. \n 9\nBeveridge, T. J., Makin, S. A.. Kadurugamuwa, J. L. & Li, Z. 1997 Interactions \nbetween biofilms and the environment. FEMS Microbiology Reviews 20, 291-303. \n \nBeyenal, H., Donovan, C., Lewandowski, Z., Harkin, G. 2004. Three-dimensional \nbiofilm structure quantification. Journal Microbioogical. Methods 59, 395-413. \n \nBishop, P.L., Tian, C.Z., Yun-Chang, F. 1995. Effects of biofilm structure, microbial \ndistributions and mass transport on biodegradation processes. Water Science and \nTechnology 31, 143-152. \n \nBouwer, E J, and McCarty, P L.  1984. Modelling of trace organics biotransformation \nin the subsurface. Ground Water 22, 433-440. \n \nBrydie, J.R., Wogelius, R.A., Merrifield, C.M., Boult, S., Gilbert, P., Allison, D., \nVaughan, D.J. 2005. The µ2M project on quantifying the effects of biofilm growth on \nhydraulic properties of natural porous media and on sorption equilibria: an overview. \nIn: Shaw, R.A. (Editor). Understanding the micro to macro behaviour of rock-fluid \nsystems. Geological Society, London. Special Publication 249, 131-144. \n \nChapelle, F.H. 2000. In: Ground-water microbiology and geochemistry: New York, \nJohn Wiley and Sons, 468 p. \n \nClement, T  P, Hooker, B S, and Skeen, R S.  1996. Macroscopic models for \npredicting changes in saturated porous media properties caused by microbial growth. \nGround Water 34(5), 934-942. \n \nCorapcioglu, M Y, & Haridas, A. 1984. Transport and fate of microorganisms in \nporous media: A theoretical investigation.  Journal of Hydrology 72, 142-169. \n \nCorapcioglu, M Y, & Haridas, A.  1985. Microbial transport in soils and groundwater: \nA numerical model. Advances in Water Resources 8, 188-200. \n \nCunningham, A. L., Warwood, B., Sturman, P., Horrigan, K., James, G., Costerton, J. \nW. & Hiebert, R. 1997. Biofilm processes in porous media – practical applications. \nIn: Amy, P.A., Haldeman, D. L. (eds), The Microbiology of the Terrestrial Deep \nSubsurface. CRC Lews Publishers, pp 325-344. \n \nDornieden, T., Gorbushina, A. A., & Krumbein, W. E. 2000.  Biodecay of cultural \nheritage as a space\/time-related ecological situation – an evaluation of a series of \nstudies.  International Biodeterioration and Biodegradation 46, 261-270. \n \nDowd, S. E., Herman, D.C., Maier, R.M. 2000. Aquatic and Extreme Environments. \nIn:.R.M. Maier., I.L. Pepper, & C.P. Gerba (eds) Environmental Microbiology,  \nAcademic Press, London. 123-146.  \n \nEhrlich, H. L. 1999. Microbes as geologic agents:their role in mineral formation. \nGeomicrobiology Journa. 16, 135-153. \n \n 10\nFerris, F.G., Konhauser, K.O., Lyvén, B. & Pedersen, K.  1999.  Accumulation of \nmetals by bacteriogenic iron oxides in a subterranean environment.  Geomicrobiology \nJournal, 16, 181-192. \n \nFletcher, M. 1991. The physiological activity of bacteria attached to solid surfaces. \nAdvances in Microbiological Physiology 32, 53-85. \n \nFrederickson, J.K., Garland, T. R., Hicks. R. J., Thomas, J. M., Li, S. W., & \nMcFadden, K. M. 1989. Lithotrophic and heterotrophic bacteria in deep subsurface \nsediments and their relation to sediment properties. Geomicrobiology Journal 7, 53-\n66.. \n \nGrogan, H A, and McKinley, I G.  1990. An approach to microbiological modelling: \napplication to the near field of a Swiss low\/intermediate-level waste repository. \nNAGRA technical report 89-06. \n \nHama, K., Bateman, K., Coombs, P. Hards, V.L., Milodowski, A.E., West, J.M., \nWetton, P.D., Yoshida, H., Aoki, K., 2001. Influence of bacteria on rock-water \ninteraction and clay mineral formation in subsurface granitic environments. Clay \nMinerals 36, 599-613. \n \nHama, T. 1997. Primary productivity and photosynthetic products in the Northwest \nPacific Ocean. In: Biochemical Processes in the North Pacific, Proceedings of the \nInternational Marine Science Symposium, 187-191.  \n \nJolley, D M, Ehrhorn, T F, and Horn, J.  2003. Microbial impacts to the near-field \nenvironment geochemistry: a model for estimating microbial communities in \nrepository drifts at Yucca Mountain. Journal of Contaminant Hydrology  62-63, 553-\n575. \nKeith-Roach, M. J. and Livens, F. R. (eds) 2002. Interactions of microorganisms with \nradionuclides. Elsevier, Oxford, UK. 400pp. \n \nKonhauser, K. O., Fisher, Q. J., Fyfe, W.S., Longstaff, F. J. & Powell, M. A. 1998 \nAuthigenic mineralisation and detrital clay binding by freshwater biofilms: The \nBrahmani River, India. Geomicrobiology Journal 15, 209-222. \n \nKindred, J S, and Celia, M A.  1989. Contaminant transport and biodegradation. 2. \nConceptual model and test simulations. Water Resources Research  25(6), 1149-1159. \n \nLeon-Morales, C.F., Leis, A.P., Strathmann, M., Flemming, H.-C. 2004. Interactions \nbetween laponite and microbial biofilms in porous media: implications for colloid \ntransport and biofilm stability. Water Research 38, 3614-3626. \n \nLewandowski, Z., Altobelli, S.A., Majors, P.D., Fukushima, E. 1992. NMR imaging \nof hydrodynamics near microbially colonized surfaces. Water Science and \nTechnology 26(3\/4), 577-584. \n \nMarsh, P. D. 2004. Dental plaque as a microbial biofilm. Caries Research 38, 204-\n211. \n 11\n \nMilodowski, A.E., Strong, G.E., Wilson, K.S., Holloway, S., Bath, A.H. 1987. \nDiagenetic influences on the aquifer properties of the Permo-Triassic sandstones in \nthe East Yorkshire and Lincolnshire basin. Investigation of the Geothermal Potential \nof the UK, British Geological Survey, 36 pp \n \nMilodowski. A. E., West, J. M., Pearce, J. M., Hyslop, E. K., Basham, I. R. & \nHooker, P. J. 1990. Uranium-mineralised microorganisms associated with uraniferous \nhydrocarbons in southwest Scotland. Nature 347, 465-467. \n \nMolz, F J, Widdowson, M A, Benefield, L D. 1986. Simulation of microbial growth \ndynamics coupled to nutrient and oxygen transport in porous media. Water Resources \nResearch 22(8), 1207-1216. \n \nNeretnieks, I. 1980. Diffusion in the rock matrix: an important factor in radio nuclide \nretardation? Journal of Geophysical Research 85, 4379-4397. \n \nOkabe, S., Kuroda, H., Watanabe, Y. 1998. Significance of biofilm structure on \ntransport of inert participates into biofilms. Water Science and Technology 38, (8), \n163-170. \n \nPaulsen, J.E., Oppen, E., Bakke, R. 1997. Biofilm morphology in porous media, a \nstudy with microscopic and image techniques. Water Science and Technology 36, 1-9. \n \nPedersen, K. 1999. Subterranean microorganisms and radioactive waste disposal in \nSweden. Engineering Geology 52, 163-172. \n \nRittmann, B E., McCarty, P L, & Roberts, P V.  1980. Trace-organic biodegradation \nin aquifer recharge. Ground Water 18, 236-243. \n \nSKB, 2003. Äspö hard rock laboratory. Annual Report 2002. Swedish Nuclear Waste \nand Fuel Management Company (SKB). Technical Report TR-03-10.  \n \nSKB, 2004.  RD & D – Programme 2004.  Swedish Nuclear Waste and Fuel \nManagement Company (SKB). Technical Report TR-04-21.  \n \nStoodley, P., Cargo, R., Rupp, C.J., Wilson, S &  Klapper, I. 2002. Biofilm material \nproperties as related to shear-induced deformation and detachment phenomena. \nJournal of Industrial Microbiology and Biotechnology 29, 361-367. \n \nTaylor, S.W., Jaffé, P.R. 1990a. Biofilm growth and related changes in the physical \nproperties of a porous medium. 1. Experimental investigation. Water Resources \nResearch 26, 2153-2159. \n \nTaylor, S.W., Jaffé, P.R. 1990b. Biofilm growth and related changes in the physical \nproperties of a porous medium. 3. Diversity and model verification. Water Resources \nResearch 26, 2171-2180. \n \nTaylor, S.W., Jaffé, P.R. 1990c. Substrate and biomass transport in a porous medium. \nWater Resources Research 26, 2181. \n 12\n \nTaylor, S.W., Milly, P.C.D & Jaffé, P.R, 1990. Biofilm growth and related changes in \nthe physical properties of a porous medium. 2. Permeability. Water Resources \nResearch 26, 2161-2169. \n \n \nThullner, M, Schroth,  M H, Zeyer, J, and Kinzelbach, W. 2004. Modeling of a \nmicrobial growth experiment with bioclogging in a two-dimensional saturated porous \nmedia flow field. Journal of Contaminant Hydrology 70: 37-62. \n \nTuck, V. A., Edyvean, R. G.J., West, J. M., Bateman, K., Coombs, P., Milodowski, A. \nE. & McKervey, J. A. 2006. Biologically induced clay formation in subsurface \ngranitic environments. J. Geochemical Exploration 90, 123-133. \n \nVandevivere, P, Baveye, P, De Lozada, D S, and DeLeo, P.  1995. Microbial clogging \nof saturated soils and aquifer materials: Evaluation of mathemetical models. Water \nResources Research  31(9), 2173-2180. \n \nVaughan, D.J., Wogelius, R., Boult  S. & Merrifield, C.  2001. Quantifying the effects \nof biofilm growth on hydraulic properties and on sorbtion equilibria; microscopic to \nmacroscopic measurements. Progress summary 02\/01 – 11\/01 Williamson Research \nCentre, University of Manchester \n \nWest, J. M., McKinley, I. G. & Chapman, N. A. 1982.  Microbes in deep geological \nsystems and their possible influence on radioactive waste disposal.  In:Radioactive \nWaste Management and the Nuclear Fuel Cycle 3, 1-15 \n \nWest, J.M., Abbott, M.A.W. & Rowe E.J. 1986. Microbial activity in nutrient \ndepleted materials. Report of British Geological Survey Fluid Processes Research \nGroup FLPU 86-8 \n \nWest, J.M., Haigh, D.G., Hooker, P.J. & Rowe, E.J. 1991. Microbial influence on the \nsorption of 137Cs onto materials relevant to the geological disposal of radioactive \nwaste. Experimentia 47, Birkhauser Verlag, CH-4010 Basel\/Switzerland. \n \nWest, J. M., 1995. A review of progress in the geomicrobiology of radioactive waste \ndisposal. Radioactive Waste Management and Environmental Restoration 19, 263-\n283. \n \nWest, J. M. and Chilton, P. J., 1997. Aquifers as environments for microbiological \nactivity. Quarterly Journal of Engineering Geology 30, 147-154. \n \nWest, J.M., Aoki, K., Baker, S.J., Bateman, K., Coombs, P., Gillespie, M.R., Henney, \nP.J., Reeder, S., Milodowski, A.E., Yoshida, H. 1998. Redox experiment in detailed \nscale (REX) - Complementary laboratory work to examine microbial effects on redox. \nReport SKB-PR-HRL-98-14, Swedish Nuclear Fuel and Waste Management Co., \nStockholm, Sweden. Also published as report WE\/97\/3C, British Geological Survey, \nKeyworth, Nottingham. \n \n 13\nWest, J. M. & McKinley, I. G. 2002. The geomicrobiology of radioactive waste \ndisposal. In: Bitton, G. (ed) The Encyclopaedia of Environmental Microbiology. John \nWiley, New York. \n \nWest, J.M., Bateman, K., Coombs, P., Harrison, P., Milodowski, A.E., Noy, D., Vane, \nC.H., Wagner, D. 2006. Microbial transport and microbial indicators of mass \ntransport through geological media – A literature survey. British Geological Survey, \nKeyworth, Nottingham. Internal Report IR\/06\/029. \n \nWiddowson, M A, Molz, F J, and Benefield, L D.  1988. A numerical transport model \nfor Oxygen and Nitrate based respiration linked to substrate and nutrient availability \nin porous media. Water Resources Research  24(9), 1553-1565. \n \nWiddowson, M A. 1991. Comment on \"An evaluation of mathematical models of the \ntransport of biologically reacting solutes in saturated soils and aquifers.\" by Phillipe \nBaveye and Albert Valocchi. Water Resources Research  27(6), 1375-1378. \n \nWimpenny, J., Manz, W., Szewzyk, U. 2000. Heterogeneity in biofilms. FEMS \nMicrobiology Reviews 24, 661-671 \n \n \n \n \n \n \n \n \n \n \n \n \n \nPlate 1 Biofilm formation on the surface of a disused mine wall in Derbyshire, UK  \n \n \nPlate 2 CryoSEM photomicrograph showing fine-grained secondary smectite-like \nphase precipated as a pore-bridging clay and blocking a pore throat \n \n \nPlate 3 SEM photomicrograph showing a meshwork of organic filaments trapping \nfine-grained mineral particular matter \n \nFigure 1. (a) The effect of biofilm formation on the porosity and permeability of a \nfracture\/fissure flow environment. (b) How a pore or fracture flow path is blocked by \nthe growth of  biofilm filaments ‘capturing’ mineral particles which effectively stops \nfluid movement. (c) The effect of high fluid flow on biofilm removal from a surface \nshowing the shearing off of a large section of biofilm which would then be \ntransported until it lodges and potentially blocks another flow path. \n \n \n \n 14\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n"}