{"doi":"10.1063\/1.2339036","coreId":"71252","oai":"oai:eprints.lancs.ac.uk:4407","identifiers":["oai:eprints.lancs.ac.uk:4407","10.1063\/1.2339036"],"title":"Mid-infrared electroluminescence at room temperature from InAsSb multi-quantum-well light-emitting diodes. .","authors":["Krier, A.","Stone, M.","Zhuang, Q. D.","Liu, P. W.","Tsai, G.","Lin, H. H."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-08-28","abstract":"Room-temperature electroluminescence is reported from InAsSb multiple-quantum-well light-emitting diodes. The diodes exhibited emission in the mid-infrared peaking near 4 µm. The spectral dependence on injection current at 4 K was investigated and two transitions were identified, centered at 4.05 and 3.50 µm, which are associated with the eigenstates of the confined holes inside the quantum well. The use of an Sb predeposition and As flux surface exposure during epitaxial growth was observed to have a major effect on the electroluminescence output","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71252.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/4407\/1\/ak2006b.pdf","pdfHashValue":"73eddb0ebccce3d3e4af4b3ab36d4da043bafa0a","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:4407<\/identifier><datestamp>\n      2018-01-24T03:12:32Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Mid-infrared electroluminescence at room temperature from InAsSb multi-quantum-well light-emitting diodes. .<\/dc:title><dc:creator>\n        Krier, A.<\/dc:creator><dc:creator>\n        Stone, M.<\/dc:creator><dc:creator>\n        Zhuang, Q. D.<\/dc:creator><dc:creator>\n        Liu, P. W.<\/dc:creator><dc:creator>\n        Tsai, G.<\/dc:creator><dc:creator>\n        Lin, H. H.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        Room-temperature electroluminescence is reported from InAsSb multiple-quantum-well light-emitting diodes. The diodes exhibited emission in the mid-infrared peaking near 4 µm. The spectral dependence on injection current at 4 K was investigated and two transitions were identified, centered at 4.05 and 3.50 µm, which are associated with the eigenstates of the confined holes inside the quantum well. The use of an Sb predeposition and As flux surface exposure during epitaxial growth was observed to have a major effect on the electroluminescence output.<\/dc:description><dc:date>\n        2006-08-28<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/4407\/1\/ak2006b.pdf<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/4407\/2\/ak2006b.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1063\/1.2339036<\/dc:relation><dc:identifier>\n        Krier, A. and Stone, M. and Zhuang, Q. D. and Liu, P. W. and Tsai, G. and Lin, H. H. (2006) Mid-infrared electroluminescence at room temperature from InAsSb multi-quantum-well light-emitting diodes. . Applied Physics Letters, 89 (9). 091110. ISSN 1077-3118<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/4407\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1063\/1.2339036","http:\/\/eprints.lancs.ac.uk\/4407\/"],"year":2006,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"Mid-infrared electroluminescence at room temperature from InAsSb multi-\nquantum-well light-emitting diodes\nA. Krier,a\u0002 M. Stone, and Q. D. Zhuang\nDepartment of Physics, Lancaster University, Lancaster LA1 4YB, United Kingdom\nPo-Wei Liu, G. Tsai, and H. H. Lin\nDepartment of Electrical Engineering, National Taiwan University, Taipei 106, Taiwan and Institute of\nElectronic Engineering, National Taiwan University, Taipei 106, Taiwan\n\u0002Received 24 May 2006; accepted 6 July 2006; published online 30 August 2006\u0003\nRoom-temperature electroluminescence is reported from InAsSb multiple-quantum-well\nlight-emitting diodes. The diodes exhibited emission in the mid-infrared peaking near 4 \u0002m. The\nspectral dependence on injection current at 4 K was investigated and two transitions were identified,\ncentered at 4.05 and 3.50 \u0002m, which are associated with the eigenstates of the confined holes inside\nthe quantum well. The use of an Sb predeposition and As flux surface exposure during epitaxial\ngrowth was observed to have a major effect on the electroluminescence output. © 2006 American\nInstitute of Physics. \u0004DOI: 10.1063\/1.2339036\u0005\nThe development of light sources and detectors for the\nmid-infrared \u00022–5 \u0002m\u0003 spectral region continues to be of\nmuch academic and technological interest. If suitable opto-\nelectronic components could be made available, one can en-\nvisage a wide variety of applications, including chemical\nprocess control, environmental monitoring of atmospheric\npollution, noninvasive medical diagnosis, tunable IR spec-\ntroscopy, and free space optical communications. InAs1−xSbx\nalloys are promising materials for this spectral region; how-\never, strong nonradiative Auger recombination in these ma-\nterials results in low room-temperature quantum efficiencies\nin practical devices. One possible solution is to fabricate type\nII multiple-quantum-well \u0002MQW\u0003 structures and make use of\nthe two dimensional confinement to suppress Auger recom-\nbination and improve electroluminescence output.\nPrevious work in our laboratory using liquid phase epi-\ntaxial growth of InAsSb bulk alloys has resulted in light-\nemitting diodes \u0002LEDs\u0003 which operate at 300 K with emis-\nsion peaking near 4.2 \u0002m appropriate for CO2 detection.1 In\nrecent years MQW structures containing InAsSb have been\nused in the active region of diode lasers grown on GaSb and\nGaAs substrates by molecular beam epitaxy \u0002MBE\u0003 or metal-\norganic vapor phase epitaxy \u0002MOVPE\u0003.2,3 By comparison,\nthere have been very few reports of LEDs based on InAsSb\nMQW exhibiting emission within the 2–5 \u0002m spectral range\nat room temperature.4 Previously, we have reported on the\nphotoluminescence \u0002PL\u0003 from InAs1−xSbx quantum dot in the\nmid-infrared near 4 \u0002m.5 In the present work we report on\nthe observation of electroluminescence \u0002EL\u0003 from\nInAs0.87Sb0.13\/ InAs MQW light-emitting diodes grown by\nMBE.\nThe InAsSb\/ InAs MQW samples for this work were\ngrown on \u0002100\u0003 p+-InAs substrates using a VG-V80H MBE\nsystem. Two cracker cells were used to provide the Sb and\nAs2 beams. A thermal effusion K cell was used to provide the\nIn flux. A p+-InAs buffer layer with a thickness of 300 nm\nwas grown at 450 °C, followed by a ten-period\nInAsSb\/ InAs MQW with 13% Sb composition which was\ngrown at 466 °C. The thicknesses of the InAsSb well and\nInAs barrier were 7 and 24 nm, respectively. Finally, a n+\nlayer was grown to complete the simple homojunction\np-i-n diode structure. In situ reflection high energy electron\ndiffraction was used to monitor surface reconstruction. After\ngrowth the samples were characterized using double crystal\nx-ray diffraction and PL or EL spectroscopy to study their\nstructural and optical properties. For EL measurements the\nas-grown sample was processed into 1 mm diameter mesa-\netched LEDs using standard photolithographic techniques.\nThe resulting diodes were mounted onto TO-46 headers for\ntesting and a quasicontinuous current \u000250% duty cycle\u0003 at\n1 kHz was used to excite EL in the LEDs. The corresponding\nlow temperature luminescence spectra were measured using\na Bentham 0.3 m monochromator and a 77 K InSb photodi-\node to detect the radiation. We investigated the influence of\nthe As and Sb switching sequences employed during MBE\ngrowth on the structural properties and also on the resulting\nEL emission properties.\nFigure 1 shows the high resolution x-ray diffraction\na\u0003Electronic mail: a.krier@lancaster.ac.uk\nFIG. 1. \u0002Color online\u0003 High resolution x-ray diffraction spectra obtained\nfrom one of the InAsSb\/ InAs MQW samples; solid line—experimental re-\nsults, dashed line—simulated data. Inset shows FWHM dependence on Sb\npredeposition time.\nAPPLIED PHYSICS LETTERS 89, 091110 \u00022006\u0003\n0003-6951\/2006\/89\u00039\u0002\/091110\/3\/$23.00 © 2006 American Institute of Physics89, 091110-1\nDownloaded 11 Mar 2008 to 194.80.32.9. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\nspectrum measured from a sample containing ten InAsSb\nquantum wells. A number of well defined satellite peaks are\neasily observed and the full width at half maximum\n\u0002FWHM\u0003 of these peaks is a good indicator of the quality of\nthe MQW structure. To obtain the narrowest satellite peaks,\nit was necessary to carefully control the As and Sb flux\nswitching sequence. We found that the best results were ob-\ntained when a minimum of 3 s Sb predeposition was used\nprior to the growth of the InAsSb QW, followed by a 20 s As\ndeposition before growth of the InAs barrier. In this way we\nobtained the most abrupt interfaces and the brightest EL\nemission.\nFigure 2 shows the 4 K EL spectrum obtained from one\nof the InAsSb\/ InAs MQW LEDs using 150–500 mA\nquasi-cw injection current. At low injection only one peak \u0002I\u0003\nis observed which exhibits a small blueshift. Above about\n250 mA this peak saturates and a second higher energy peak\n\u0002II\u0003 is observed. The spectra may be interpreted based on the\ntransitions originating as shown in Fig. 3, where the band\nlineup is depicted as type II with strong hole confinement.6\nPeaks I \u00024.05 \u0002m\u0003 and II \u00023.50 \u0002m\u0003 can be assigned to re-\ncombination from the InAs conduction band to the heavy\nhole and light hole confined states in the InAsSb quantum\nwell. These transitions are in excellent agreement with cal-\nculated values. We also noted that no emission \u0002\u00063.0 \u0002m\u0003\nfrom the InAs barriers or from the InAs substrate was ob-\nserved, which suggests strong carrier localization at the QW.\nFigure 4\u0002a\u0003 shows the electroluminescence emission\nspectra obtained from the InAsSb MQW LED measured with\nincreasing temperature over the range of 4–300 K using\n500 mA injection current. The dominant emission peak \u0002II\u0003\ndecreased steadily with increasing temperature. On ap-\nproaching room temperature, the emission broadened and a\nhigh energy tail developed, presumably associated with some\nrecombination originating within the InAs barriers as carriers\nbecome released from the MQW. The peak intensity\nquenched by only a factor of 7 as a result of the carrier\nconfinement compared with a value of \u000315 typically ob-\nserved in the bulk alloy. The redshift of the EL peak emission\ncorresponds to the usual band gap narrowing with tempera-\nture. Figure 4\u0002b\u0003 shows the EL emission observed at room\ntemperature for three different injection currents using\nquasi-cw operation \u000250% duty cycle is the preferred mode of\noperation for many perceived practical applications\u0003. The\nemission peaks near 4 \u0002m and moves slightly to longer\nwavelength as the current is increased due to Joule heating in\nthe diode. The asymmetry in the spectra on the long wave-\nlength side is partly due to absorption from CO2 in the labo-\nratory atmosphere.\nThe LED output power under quasicontinuous drive\nconditions \u00021 kHz at 50% duty cycle\u0003 was measured at room\nFIG. 2. \u0002Color online\u0003 4 K electroluminescence emission spectra observed\nfrom the InAsSb MQW LED using different injection currents.\nFIG. 3. \u0002Color online\u0003 Schematic diagram showing the type II\nInAs1−xSbx \/ InAs quantum well and the transitions corresponding to peaks I\nand II observed in the 4 K EL spectra.\nFIG. 4. \u0002Color online\u0003 EL spectrum of the MQW LED \u0002a\u0003 at various tem-\nperatures using an injection current of 500 mA. \u0002b\u0003 The dependence of the\nroom-temperature emission spectrum on current.\n091110-2 Krier et al. Appl. Phys. Lett. 89, 091110 \u00032006\u0002\nDownloaded 11 Mar 2008 to 194.80.32.9. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\ntemperature using an integrating sphere and calibrated PbSe\nphotodetector. The corresponding internal quantum effi-\nciency was estimated to be 0.2%. This resulted in an output\npower of 1.4 \u0002W at room temperature. These values can be\nimproved since the LED is a homojunction diode and the\npresent devices have not yet been optimized with respect to\nthe active region thickness or the p+ and n+ doping concen-\ntrations.\nThe observed improvement in the InAsSb MQW as a\nresult of predeposition of Sb is in good agreement with pre-\nvious results obtained using MOVPE. Pillai et al. have stud-\nied the effect of Sb predeposition on the compositional pro-\nfile of InAs0.80Sb0.20\/ InAs superlattices and observed Sb\nsegregation for samples grown with no predeposition.7 For\nsamples grown with 0.8 ML Sb predeposition, sharper In-\nAsSb on InAs interfaces were obtained. Sb coverages of \u00031\nML resulted in broader x-ray satellite peaks and rougher in-\nterfaces. Kaspi and Evans showed that an Sb floating layer\nforms on a III-V alloy surface.8 By using the fact that Sb is\nmore volatile than As and choosing a suitable As exposure\ntime, the Sb floating layer can be removed. In our work a\n20 s As exposure was used to remove this floating layer and\nthus prevent Sb incorporation into the InAs barrier layers.\nOur results indicate that these benefits carry over to the lu-\nminescence efficiency with the best EL being obtained from\nthe samples with the sharpest interfaces. We also found that\nthe luminescence emission intensity from the MQW is en-\nhanced compared with samples grown without any predepo-\nsition or As exposure. This enhancement becomes more sig-\nnificant as the Sb content in the MQW increases. A\ncomparison of the emission spectra from samples prepared\nwith and without the Sb predeposition is shown in Fig. 5.\nThe MQW grown with predeposition exhibit emission at\nshorter wavelengths which we associate with reduced bow-\ning in the valence band arising from the more abrupt inter-\nfaces with less structural disorder. We note that the bowing\nparameter in InAsSb is almost entirely determined by struc-\ntural disorder.9 Hence, changes in structural perfection will\nhave a significant effect on the bowing parameter and con-\nsequently on the dependence of band gap on composition\nand the corresponding transition energy of the InAsSb in the\nMQW. Previously we reported the InAsSb conduction band\nbowing to be near 40% for samples grown without Sb\npredeposition.10 The present results indicate that a value near\n60% would be more appropriate for MQW grown using Sb\npredeposition.\nIn summary, mid-infrared electroluminescence from\nInAs0.87Sb0.13\/ InAs MQW homojunction LEDs grown by\nMBE has been observed near 4.0 \u0002m. The recombination\nwas identified as originating from type II transitions involv-\ning confined holes and persisted up to room temperature with\nimproved quenching behavior compared with the equivalent\nbulk alloy. The use of Sb predeposition during epitaxial\ngrowth produced MQWs with more abrupt interfaces which\nhad a major effect on the electroluminescence. Both the best\nluminescence and the narrowest x-ray satellite peak width\nwere obtained for an Sb predeposition time of 3 s. With\nsome optimization of the structure and with the addition of\nan electron blocking barrier to confine the injected electrons,\nit should be possible to obtain significant further improve-\nments in LED output and efficiency.\nThe authors wish to thank Kidde Ltd. for providing a\nCASE studentship for one of the authors \u0002M.S.\u0003. The authors\nalso wish to thank D. Campbell and G. Crook for valuable\ntechnical assistance and A. Godenir for x-ray measurements.\n1A. Krier, H. H. Gao, V. V. Sherstnev, and Y. Yakovlev, J. Phys. D 32,\n3117 \u00021999\u0003.\n2E. R. Glaser, B. R. Bennett, B. V. Shanabrook, and R. Magno, Appl. Phys.\nLett. 68, 3614 \u00021996\u0003.\n3G. Park, O. B. Shchekin, D. L. Huffaker, and D. G. Deppe, Appl. Phys.\nLett. 73, 3351 \u00021998\u0003.\n4A. Stein, D. Puttjer, A. Behres, and K. Heime, IEE Proc.: Optoelectron.\n145, 257 \u00021998\u0003.\n5A. Krier, X. L. Huang, and A. Hammiche, Appl. Phys. Lett. 77, 3791\n\u00022000\u0003.\n6S. H. Wei and A. Zunger, Phys. Rev. B 52, 12039 \u00021995\u0003.\n7M. Pillai, S. C. Theiring, S. A. Barnett, B. W. Wessels, A. Desikan, and E.\nP. Kvam, J. Cryst. Growth 208, 79 \u00022000\u0003.\n8R. Kaspi and K. R. Evans, J. Cryst. Growth 175\/176, 838 \u00021997\u0003.\n9M. Ferhat, Phys. Status Solidi B 241, R38 \u00022004\u0003.\n10P. W. Liu, G. Tsai, H. H. Lin, and A. Krier, OPT Conference \u0002Tainan,\nTaiwan, 2005\u0003, paper. No. A-FR-II 4-2.\nFIG. 5. \u0002Color online\u0003 Comparison of the PL emission spectra from samples\nprepared with and without the Sb predeposition and As exposure.\n091110-3 Krier et al. Appl. Phys. Lett. 89, 091110 \u00032006\u0002\nDownloaded 11 Mar 2008 to 194.80.32.9. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n"}