{"doi":"10.1109\/PCTHEALTH.2008.4571072","coreId":"69797","oai":"oai:eprints.lancs.ac.uk:21202","identifiers":["oai:eprints.lancs.ac.uk:21202","10.1109\/PCTHEALTH.2008.4571072"],"title":"Using NFC to support and encourage green exercise","authors":["Rashid, Omer","Coulton, Paul","Bird, William"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-02","abstract":"This paper presents a novel system using NFC to increase support and encouragement of outdoor physical activity, or dasiagreen exercisepsila. The main aim of the project is to help combat the effects of the increasingly sedentary lifestyle of the British population which is leading to increasing health problems. The paper presents both the design and implementation of prototype system together with results from the initial field trials conducted in Hyde Park in London. The results confirm that NFC has a number of benefits in that, it is easy to deploy, easy to use and understand, and highlight the potential significance of a long term study","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"IEEE","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:21202<\/identifier><datestamp>\n      2018-01-24T02:04:34Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5141:51413736<\/setSpec><setSpec>\n      74797065733D626F6F6B5F73656374696F6E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Using NFC to support and encourage green exercise<\/dc:title><dc:creator>\n        Rashid, Omer<\/dc:creator><dc:creator>\n        Coulton, Paul<\/dc:creator><dc:creator>\n        Bird, William<\/dc:creator><dc:subject>\n        QA76 Computer software<\/dc:subject><dc:description>\n        This paper presents a novel system using NFC to increase support and encouragement of outdoor physical activity, or dasiagreen exercisepsila. The main aim of the project is to help combat the effects of the increasingly sedentary lifestyle of the British population which is leading to increasing health problems. The paper presents both the design and implementation of prototype system together with results from the initial field trials conducted in Hyde Park in London. The results confirm that NFC has a number of benefits in that, it is easy to deploy, easy to use and understand, and highlight the potential significance of a long term study.<\/dc:description><dc:publisher>\n        IEEE<\/dc:publisher><dc:date>\n        2008-02<\/dc:date><dc:type>\n        Contribution in Book\/Report\/Proceedings<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/PCTHEALTH.2008.4571072<\/dc:relation><dc:identifier>\n        Rashid, Omer and Coulton, Paul and Bird, William (2008) Using NFC to support and encourage green exercise. In: Second International Conference on Pervasive Computing Technologies for Healthcare, 2008. PervasiveHealth 2008. IEEE, pp. 214-217. ISBN 978-963-9799-15-8<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/21202\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1109\/PCTHEALTH.2008.4571072","http:\/\/eprints.lancs.ac.uk\/21202\/"],"year":2008,"topics":["QA76 Computer software"],"subject":["Contribution in Book\/Report\/Proceedings","NonPeerReviewed"],"fullText":"Using NFC to Support and Encourage Green Exercise \n \nOmer Rashid and Paul Coulton \nInfolab21 \nLancaster University \nLancaster, UK \nm.rashid,p.coulton@lancaster.ac.uk \nWilliam Bird \nIntelligent Health \n2nd Floor, 145-157 St John St \nLondon, UK \nwilliam.birdinfo@intelligenthealth.co.uk\n \n \nAbstract— This paper presents a novel system using NFC to \nincrease support and encouragement of outdoor physical activity, \nor ‘Green Exercise’. The main aim of the project is to help \ncombat the effects of the increasingly sedentary lifestyle of the \nBritish population which is leading to increasing health problems. \nThe paper presents both the design and implementation of \nprototype system together with results from the initial field trials \nconducted in Hyde Park in London. The results confirm that \nNFC has a number of benefits in that, it is easy to deploy, easy to \nuse and understand, and highlight the potential significance of a \nlong term study.   \nKeywords; mobile, NFC, Green Exercise, Walking. \nI.  INTRODUCTION \nIt is well accepted that the increasingly sedentary lifestyle \nof the British population is helping fuel the dramatic rises in \ntype 2 diabetes, chronic heart disease and obesity [1]. It has \nbeen widely reported across the various News media that recent \nestimates suggest that over 40% of school age children are \noverweight or obese, and by 2010 more than half of children \nmay be obese. In addition to this, depression and mental ill \nhealth is set to be one of the fastest growing conditions in UK \nwith 1 in 6 of the population suffering from a neurotic disorder \n[1]. Whilst the overall reasons for this are complex there are \nsimple things we can all do to improve this situation.  A report \non the impact of physical activity and its relationship to health \nby the Chief Medical Officer in 2004[1] ‘concluded that: \n“The minimum amount of regular physical activity needed \nto improve peoples’ health and reduce disease risk is 30 \nminutes of moderate intensity physical activity on at least 5 \ndays a week.”   \nThe report also highlights that less than half of the British \npopulation manages to do this even though something as \nsimple as brisk walking can achieve this end. Walking is \nknown to have considerable benefits not only in combating the \nserious diseases highlighted but improving peoples general \nsense of social well being and is the most natural and \nconvenient form of moderate intensity physical activity that is \ncommon to all, except for the most seriously frail or disabled \nindividuals.  \nTo improve the levels of activity of the population a \nnumber of projects have been developed such as the Walking \nfor Health Initiative (WHI) from the British Heart Foundation \nand Natural England, which was originally conceived by Dr \nWilliam Bird in 1994, and supports a number of projects such \nas Green Exercise [2].  \nGreen Exercise encompasses any physical activity out of \ndoors but with an emphasis on accessible, regular and moderate \nactivities that people can build into their daily lives. Green \nExercise might be walking, cycling or, in the case of children, \nunstructured outdoor play activities. For the more adventurous \nit could be climbing, kiting or orienteering. For others the focus \ncould be on nature or the environment, such as conservation \nactivities, bird watching, gardening or wild camping. The \nfactor uniting all these activities is that they can encourage \npeople to be more active, more frequently, close to home and in \nthe outdoors. \nAn important element of encouraging walking is the need to \nprovide feedback as it is known [3] to aid both the level and \ncontinued engagement in activity. Additionally, many people \nmay have difficulties making sure that their activity is in fact \nmoderate and not just light and it is important for individuals to \nnot only be aware of their overall amount of exercise but also \nits intensity [4]. The obvious solution is some form of exercise \ndiary to record activity but these are heavily reliant on the users \nremembering what activities they undertook, how long the \nactivity lasted, and possibly the distance travelled. This \nrequirement would likely be perceived as particularly \nburdensome if required on a daily basis and is not well suited to \nrecording activities integrated into normal daily activity such as \nwalking. One possible solution is that of pedometers, which \nhave shown to have success [5] but as it is for such a specific \npurpose it requires a conscious effort on users to remember to \ncarry it around and would normally still require the user to \nrecord the details for further analysis.   \nIn this project we have created a system, originally \nconceived by Intelligent Health, which combines elements \nfrom a number of technologies and services to support and \nencourage walking as part of daily activity. These are; Mobile \nphones; Radio Frequency Identification (RFID) in the form of \nNear Field Communications (NFC); A redeemable points \naccumulation scheme. \nMobile phones are the most pervasive technology on the \nplanet with current subscriptions approaching 3 Billion and \nthey have become a must carry item along with money and \nkeys. Given the importance of the phone it seems an obvious \nchoice for aiding the recoding of activity levels. The use of \nmobile phones to track activity is not a new concept as a \nnumber of phone manufacturers have embedded pedometer \nAuthorized licensed use limited to: IEEE Xplore. Downloaded on December 22, 2008 at 05:27 from IEEE Xplore.  Restrictions apply.\nfunctionality (generally implemented through accelerometers) \nwith simple on-board activity logs into some of their devices, \nfor example the Nokia 5140 and Nokia 5500. Although \npedometers have proved effective for encouraging and \nrecording activity this functionality is unlikely to widespread \ninclusion of phones for some time if ever. A system designed \nto record activity automatically to the web was developed that \ntracked activity by monitoring cell IDs [4] and although this \nmet with some success its accuracy was limited in rural \nenvironments as it required consistent network coverage and \nwas computationally intensive [4] and thus likely to cause \nsignificant battery drain. Ideally a phone based system should \nbe; capable of being operated across a wide range of devices; \neasy to operate; capable of being used in a wide variety of \nscenarios and we shall return to these criteria when we have \ndiscussed the remaining components of the proposed system. \nThe choice of RFID, and in particular an associated \ntechnology NFC, may not be immediately obvious as RFID is \noften primarily associated with asset tracking.  However, it is \nalso finding application as a ticket replacement mechanism on \npublic transport such as the Oyster in London. Oyster is a \nRFID `smartcard` which can store £90 of pay as you go credit \nplus a travel card or annual bus pass and can be used on the \nTube, buses, Dockland Light Railway, trams and some national \nrail services in London. In a recent press release Lambeth \nCouncil state that by March 2007 over 10 million Oyster cards \nhad been issued and more than 80% of all journeys on services \nrun by Transport for London used the Oyster card. NFC is an \ninterface and protocol built on top of RFID and is targeted in \nparticular at consumer electronic devices, providing them with \na secure means of communicating without having to exert any \nintellectual effort in configuring the network [6]. Nokia was the \nfirst to combine mobile phones with RFID\/NFC when it \nintroduced clip-on RFID and NFC shells (Nokia Xpress-on \nMobile RFID\/NFC Kits) for the 5140 and 5140i Series 40 \nphones respectively. The RFID\/NFC shells can be accessed via \nJ2ME applications running on the phone to trigger defined \nactions within the application. The particular operating range \nfor mobile phones is generally 13.5 MHz which limits the \nrange to approx 3 cm or touch. These phones were but the first \nof a growing trend and the Japanese telecommunications giant \nNTT DoCoMo has reportedly shipped more than 5 million \nRFID enabled mobile phones for use instead of printed tickets \nin the National Rail Network [7].  \nThe final element of the system is related to creating \nmotivational forces to encourage continued engagement. \nPrevious research into motivational perspectives for engaging \nin physical activity [8] has highlighted the importance of \nintrinsic over extrinsic motivational forces. Whereas extrinsic \nmotivation originates outside of the person, for example social \ninfluence brought to bear through a counseling relationship \nsuch as a trainer or prize, intrinsic motivational forces involve \nphenomena that originate within the individual. The intrinsic \nmotivational perspective is based on people’s needs to be self-\ndetermining and competent, and is believed to be crucial to \nlong term behavior change [8].  \nThe proposed scheme is designed to facilitate both extrinsic \nand intrinsic motivational forces in that intrinsic behavior is \nfacilitated by allowing the user to see the recorded levels of \nactivity in terms of calories used and extrinsic motivation is \nfacilitated by a mechanism similar to those employed by banks \nand credit card companies whereby redeemable the points are \naccumulated for a prescribed activity in this case physical. In \nthe long term it is envisaged that these points could be \nredeemed within the local parks and shops. \nHaving defined the basic elements of the system in the \nfollowing section we provide a more detailed system design. \nII. SYSTEM DESIGN \nThe system described in this paper is known as Credx and \nworks by implying the location of a user [9] at a given time \nwhich is triggered when a user scans his\/her NFC tag. Credx \nusers are given NFC tags whose Unique Identifier (UID) is \nused as basis of monitoring their activity within the system. \nMobile phones equipped with NFC readers are placed at \ndifferent locations with distance between each location known \nand this is linked to known calorie data for healthy adults \nundertaking various physical activities such as walking, \nrunning and cycling.  \nA single scan at any location is not sufficient to imply the \npath taken by the user they must therefore scan their NFC tag at \ntwo distinct locations. Since the distance and calorie count is \nknown between these two locations and the users can register a \nparticular activity which means that a detailed description of \nactivity can be provided to user listing the time taken to travel, \ncalories consumed and speed to support intrinsic motivation.   \nThe extrinsic motivation is achieved by rewarding the user \nwith Credx points for each scan they make during their trip. \nThis encourages the user to scan more often although only \nscans that form a valid journey or trip contribute to Credx \npoints gained by the user. Each scan is time stamped which \nplays a vital role in identifying valid trips from those that are \ninvalid.  \nL1\nL2 L3\nY Miles\nX MilesZ Miles\nUser 1 User 2\nT1\nT2\nT3\nT4T5\n  \nFigure 1: Simple Credx Usage scenario \nFigure 1 shows a simple usage scenario which consists of \nthree access points (in this case mobile phones equipped with \nNFC readers). The example shows two users, each one starting \ntheir trip at Location L1. User 1 starts his trip by scanning his \ntag at L1 and ends it at L3 in T2-T1 seconds whilst user 2 \nstarts the journey at L1 but ends at L2 whilst going through \nAuthorized licensed use limited to: IEEE Xplore. Downloaded on December 22, 2008 at 05:27 from IEEE Xplore.  Restrictions apply.\nL3. Table 1 below shows the distance covered and points \naccumulated by each user in the earlier scenario.  \n \n Distance Scans Points \nUser 1 x 2 2 \nUser 2 x + z 3 3 + 1 \nTable 1: Example Credx Data \nAlthough User 2 has made 3 scans only during his trip he is \nstill awarded with 4 (3+1) points in total. This is done to further \nmotivate the user to increase their daily walking distance. \nThree points are awarded for number of scans done and since \nUser 2 is continuing his journey beyond points L3 an additional \npoint is awarded as an added bonus to encourage the user. So \nthe trip taken by User 2 will be reported as L1 – L3, L3 - L2.  \nIn order to achieve the scalability and ease of \nimplementation at various locations parent child architecture \nwas chosen for the selection of locations where NFC readers \nare placed. A parent location represents a park or a busy \nshopping mall. A child location will then be various key points \nwithin a parent location. Each of parent and child locations is \ngiven unique identifiers within the system to link a child \nlocation to a parent location and uniquely distinguish one \nparent or child location from another. NFC readers, with a \nunique reader identifier, are then assigned to a child location.  \nEach scan is time stamped and checked for validity against \ncertain set of rules. Some of these checks are made at the phone \nwhilst some are done at the back end server. However the \nchecks done at the backend server are more complex as \ncompared to the ones done on the phone which are very \nstraight forward. For example one of the simple checks done on \nthe phone is for duplicate scans where user has accidentally \nheld the tag in front of the phone for too long and the tag has \nbeen read twice. In this case the second scan is marked as void \nand no information is exchanged with the server. A typical \nexample of a check on server will be to see if that scan forms a \npart of previously started trip or not.  \nIII. SYSTEM IMPLEMENTATION \nThe Credx architecture is client server based where mobile \nNFC readers communicate with the backend server via GPRS \nas shown in Figure 2. At the heart of the system is the central \ndatabase which holds user, location and NFC scanning data. \nNFC readers located at various locations send the UID of the \nNFC tag along with the unique location identifier and timing \ndetails to the server. This information is processed by the \nserver and stored in the database.  \nIV. TRIAL IMPLMENTATION WITH ROYAL PARKS \nThe Royal Parks is the organization responsible for \nmanaging the 5,000 acres of historic parkland across eight \nmajor sites in the heart of London which are: Bushy Park, The \nGreen Park, Greenwich Park, Hyde Park, Kensington Gardens, \nThe Regent's Park, Richmond Park and St James's Park. \nMillions of Londoners and tourists visit the Royal Parks for \nfree each year and they provide opportunities for a simple walk \nor a picnic, sports, organized activities\/events etc and thus \npresents an ideal locale for trialing this project. \nCredX Mobile\nNFC Reader\nRead\nNFC Tag\nSend\/Receive\nData\nParse Data\nDatabase\nNo Feedback Audio Feedback\nServer\nResponse\nBad Read Read Ok\nOK\nFailure\nGPRS\n \nFigure 2: CredX System Overview \n \nFigure 3: Location of Credx NFC Readers in Hyde Park \nDuring the first trial phase nine key locations were \nidentified within Hyde Park shown in figure 3 which is in the \nheart of London. The key criteria being the fact that they are on \na path way within the park and within the walking distance of \nthe nearest London Underground station. These locations are \nshown on figure 3. Each of these locations was equipped with a \nNFC phone having a unique identifier within the system.  \nUsers can view the details of their trips through Hyde Park \non the project website. These are reported along with calories \nconsumed and speed. In order to facilitate more intrinsic \nmotivation the system differentiates the user activity into \nwalking, running or cycling. By default all activities are \nreported as ‘walking’ but users can then login to view their \nresults and change it to the activity they actually undertook. \nCalories consumed in that trip are then automatically updated.  \nUsers can also see an overview of their intrinsic and \nextrinsic benefits i.e. an overview and weekly comparison of \nAuthorized licensed use limited to: IEEE Xplore. Downloaded on December 22, 2008 at 05:27 from IEEE Xplore.  Restrictions apply.\ncalories consumed and Credx points accumulated. To further \nenhance intrinsic motivation users can view their calorie \nconsumption through a range of graphical representations. \nThey can either select a certain time frame or select a weekly \ncomparison which compares the current week’s calorie \nconsumption to that of the last 2 weeks as shown in figure 5 \n \nFigure 5: User Activity Feedback \nV. RESULTS AND CONCLUSIONS \nThe Main objectives of the first trial were to test the \nfeasibility, ease of use from both system administration and end \nuser perspective, and to ascertain the viability of the intrinsic \nand extrinsic motivation given by the system to the user.  \nThe system design allows ease of scalability as a new key \npoint can be added to a parent location and multiple NFC \nreaders can be added to the same child location if that \nparticular location gets very busy. The whole architecture can \nalso be ported easily to another location e.g. another park etc. \nThe system itself is very simple and economical as equipment \ninvolved is not very expensive. The design of mobile \napplication itself is kept to a bare minimum to conserve power \nas longer battery life is one of the requirements.  \nFrom an administrator point of view the system provides \noverall activity through the park and also provides usage of \ndifferent locations within the park. This information can further \nbe used by parks to provide other services at those locations. \n From a user point of view the combination of intrinsic and \nextrinsic motivation encourage the user to increase their \nphysical activity in their daily routine.  A clear comparison was \nseen with two different users in the trial. One user had many \nincomplete trips (trips where user scanned one tag only) and \nthis was done at the start and end of the working day. This \npoints out that the user has not changed his\/her daily routine \nwhilst in the other case many complete trips were seen which \nhighlighted that instead of taking  the shortest path that \nparticular user is undertaking extra physical activity to obtain \nthat second scan hence consuming more calories and gaining \npoints.  \nVI. FURTHER WORK \nAt this stage it is too early to ascertain the real effects on \nusers and therefore a long term study with an extended trial is \nplanned for future to document experiences of users within the \nsystem and obtain feedback from the participants as to how the \nsystem fits into their daily routine. As more and more phones \nare going to be shipped in future with NFC capability a \ndifferent approach can be used in the system where Credx \nNFC readers will be replaced by NFC tags and users will \nutilize their own NFC capable mobile phone to scan these \ntags. An advantage of this approach will be the fact that users \ncan view their Credx activity as soon as they scan a tag. Better \nfeedback can be provided to the user both in terms of tag \nscanning and calorie consumption. At the moment an audio \nfeedback in given to the users when they scan their tag but \nwhen roles are reversed the user can be given status of their \nscan and details on the mobile phone display.  \nACKNOWLEDGMENT \nThe authors acknowledge the support of Royal Parks for \nsupport provided in the trial and Nokia who provide support to \nthe Mobile Radicals Research Group at Lancaster University.  \nREFERENCES \n[1] Department of Health, “At least five a week: Evidence on the impact of \nphysical activity and its relationship to Health”. Crown Document, April \n2004.    \n[2] Walking for Health Initiative, Green Exercise - a triple-strength \nprescription”, February 2007, www.whi.org.uk\/green. \n[3] J.R. W hitehead, “Physical Activity and Intrinsic Motivation” Series 1, \nNumber 2, Of The PCPFS Research Digest. \n[4] J. Maitland, S. Sherwood, L. Barkhuus, I. Anderson, M. Hall, B. Brown, \nM. Chalmers and H. Muller, “Increasing the Awareness of Daily \nActivity Levels with Pervasive Computing. In proceedings of 1st \nInternational Conference on Pervasive Computing Technologies for \nHealthcare 2006, IEEE, November 2006. \n[5] D. Merom, C. Rissel, P. Phongsavan, B. Smith, C. Van Kemenade, W. \nBrown, A. Bauman, “Promoting Walking with Pedometers in the \nCommunityThe Step-by-Step Trial”,American Journal of Preventive \nMedicine, Volume 32, Issue 4, Pages 290-297, 2007. \n[6] ECMA, Near Field Communication: White Paper, Ecma\/TC32-\nTG19\/2004\/1, 2004. \n[7] P. Coulton, O. Rashid, and W. Bamford, , “Experiencing ‘Touch’ in \nMobile Mixed Reality Games”, The Fourth Annual International \nConference in Com-puter Game Design and Technology, Liverpool, \n15th – 16th November 2006, pp 68-75. \n[8] A. King, R. Friedman, B. Marcus, C. Castro, L. Forsyth, M. Napolitano \nand B. Pinto, “Harnessing motivational forces in the promotion of \nphysical activity: the Community Health Advice by Telephone (CHAT) \nproject”, Journal of Health Education Research, Vol. 17, No. 5, 627-636, \nOctober 2002. \n[9] O. Rashid ,W. Bamford, P. Coulton , R. Edwards, and J. Scheibel “PAC-\nLAN: Mixed reality gaming with RFID enabled mobile phones”, ACM \nComputers in Entertainment,Vol 4, Issue 4, October, 2006, pp 1-17.\n \nAuthorized licensed use limited to: IEEE Xplore. Downloaded on December 22, 2008 at 05:27 from IEEE Xplore.  Restrictions apply.\n"}