{"doi":"10.1063\/1.1772871","coreId":"102313","oai":"oai:epubs.surrey.ac.uk:1772","identifiers":["oai:epubs.surrey.ac.uk:1772","10.1063\/1.1772871"],"title":"Radiative and Auger recombination in 1.3  µm InGaAsP and 1.5  µm InGaAs quantum-well lasers measured under high pressure at low and room temperatures","authors":["Jin, S. R.","Sweeney, S. J.","Ahmad, C. N.","Adams, A. R.","Murdin, B. N."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-07-19","abstract":"<p>We report on the pressure dependence of the threshold current in 1.3  µm InGaAsP and 1.5  µm InGaAs quantum-well lasers measured at low temperatures ~100  K. It was found that the threshold current of both devices slowly increases with increasing pressure (i.e., increasing band gap) at ~100  K consistent with the calculated variation of the radiative current. In contrast, at room temperature we observed a reduction of the threshold current with increasing pressure. Our low-temperature, high-pressure data confirm the results of previous atmospheric pressure measurements on the same devices which indicated a transition in the dominant recombination mechanism from radiative to Auger as the device temperature is increased from ~100 to 300 K<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1772<\/identifier><datestamp>\n      2017-10-31T14:03:04Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:70686F746F6E696373<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1772\/<\/dc:relation><dc:title>\n        Radiative and Auger recombination in 1.3  µm InGaAsP and 1.5  µm InGaAs quantum-well lasers measured under high pressure at low and room temperatures<\/dc:title><dc:creator>\n        Jin, S. R.<\/dc:creator><dc:creator>\n        Sweeney, S. J.<\/dc:creator><dc:creator>\n        Ahmad, C. N.<\/dc:creator><dc:creator>\n        Adams, A. R.<\/dc:creator><dc:creator>\n        Murdin, B. N.<\/dc:creator><dc:description>\n        <p>We report on the pressure dependence of the threshold current in 1.3  µm InGaAsP and 1.5  µm InGaAs quantum-well lasers measured at low temperatures ~100  K. It was found that the threshold current of both devices slowly increases with increasing pressure (i.e., increasing band gap) at ~100  K consistent with the calculated variation of the radiative current. In contrast, at room temperature we observed a reduction of the threshold current with increasing pressure. Our low-temperature, high-pressure data confirm the results of previous atmospheric pressure measurements on the same devices which indicated a transition in the dominant recombination mechanism from radiative to Auger as the device temperature is increased from ~100 to 300 K<\/p><\/dc:description><dc:date>\n        2004-07-19<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1772\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Jin, S. R., Sweeney, S. J., Ahmad, C. N., Adams, A. R. and Murdin, B. N.  (2004) Radiative and Auger recombination in 1.3 µm InGaAsP and 1.5 µm InGaAs quantum-well lasers measured under high pressure at low and room temperatures   Applied Physics Letters, 357 (2004).       <\/dc:identifier><dc:relation>\n        10.1063\/1.1772871<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1772\/","10.1063\/1.1772871"],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Radiative and Auger recombination in 1.3 mm InGaAsP and 1.5 mm InGaAs\nquantum-well lasers measured under high pressure at low and room\ntemperatures\nS. R. Jin,a) S. J. Sweeney, C. N. Ahmad, A. R. Adams, and B. N. Murdin\nAdvanced Technology Institute, School of Electronics and Physical Sciences, University of Surrey,\nGuildford, Surrey GU2 7XH, United Kingdom\n(Received 1 March 2004; accepted 19 May 2004)\nWe report on the pressure dependence of the threshold current in 1.3 mm InGaAsP and 1.5 mm\nInGaAs quantum-well lasers measured at low temperatures ,100 K. It was found that the threshold\ncurrent of both devices slowly increases with increasing pressure (i.e., increasing band gap) at\n,100 K consistent with the calculated variation of the radiative current. In contrast, at room\ntemperature we observed a reduction of the threshold current with increasing pressure. Our\nlow-temperature, high-pressure data confirm the results of previous atmospheric pressure\nmeasurements on the same devices which indicated a transition in the dominant recombination\nmechanism from radiative to Auger as the device temperature is increased from ,100 to 300 K. ©\n2004 American Institute of Physics. [DOI: 10.1063\/1.1772871]\n1.3 and 1.5 mm semiconductor quantum-well lasers are\nthe key devices for optical communication applications.\nMuch work has been focused on the fundamental optical\nprocesses and the limiting factors in these laser systems.1–12\nSuch knowledge enables us to investigate the scope for fur-\nther device optimization by means of band structure engi-\nneering in low-dimensional heterostructure systems such as\nquantum-wells (QWs), quantum barriers, quantum wires, and\nquantum dots. In general, the threshold current, Ith, of semi-\nconductor lasers may be considered to consist of four carrier\ndensity, n, dependent recombination channels,13,14 namely,\nmonomolecular recombination s~nd which describes recom-\nbination via traps and defects, band-to-band radiative recom-\nbination s~n2d, Auger recombination s~n3d, and carrier leak-\nage. It has been shown5 that the monomolecular\nrecombination current is negligible in 1.3 and 1.5 mm\nInGaAssPd devices at the high carrier densities required to\nreach lasing threshold. The carrier leakage current is also\nassumed to be insignificant in the above-noted material\nsystems,15 which has previously been confirmed by room\ntemperature (RT) hydrostatic pressure studies.16 The contri-\nbutions of the different recombination mechanisms as a func-\ntion of temperature have been extensively investigated in our\nprevious work using both facet- and spontaneous-emission\nmeasurements.15 It was shown that, below a certain tempera-\nture [170 K for 1.3 mm InGaAssPd and 130 K for 1.5 mm\nInGaAs], the radiative current dominates Ith. With increasing\ntemperature, the Auger recombination current increases and\nbecomes the dominant contribution to Ith at RT. The signifi-\ncant Auger recombination in 1.3 and 1.5 mm InGaAsP de-\nvices at RT is also confirmed by RT high-pressure\nmeasurements.15,16 Therefore, one might expect completely\ndifferent pressure behavior of the threshold current in the\nabove-noted devices at low temperatures.\nHigh pressure is a very useful diagnostic tool, because it\nallows a controllable and continuous change in the band gap.\nBecause the above-mentioned processes all depend on band\ngap in different ways, the pressure dependence can be used\nto discriminate between them. Furthermore, since most im-\nportant nonradiative mechanisms including Auger recombi-\nnation and thermal leakage currents are strongly temperature\ndependent, becoming significant at high temperature, by per-\nforming the high pressure measurements at cryogenic tem-\nperatures we may consider the intrinsic properties of the ra-\ndiative recombination in the absence of nonradiative current\npaths.\nIn this letter we report low-temperature, high-pressure\nmeasurements on 1.3 mm InGaAsP and 1.5 mm InGaAs la-\nsers. It was found that Ith of both devices slowly increased\nwith increasing pressure at a temperature of ,100 K. These\nresults contrast strongly with the reduction of Ith with pres-\nsure at RT in both devices.\nThe devices studied here were buried-heterostructure\nmulti-quantum-well (MQW) lasers, grown using low-\npressure metalorganic vapor-phase epitaxy on n-type InP\nsubstrates. The 1.3 mm lasers consist of eight compressively\nstrained InGaAsP QWs within unstrained InGaAsP barriers\nand separate confinement heterostructure layers. The 1.5 mm\nlasers comprise four compressively strained InGaAs QWs\nwithin lattice-matched InGaAsP barriers. The detailed\ngrowth procedures of these devices can be found\nelsewhere.10 All of the lasers were as-cleaved with a cavity\nlength of 500 mm and were investigated in unmounted chip\nform. The optical pressure cell, mounted inside a liquid ni-\ntrogen bath cryostat was used in conjunction with Unipress\nU11 helium gas compressor capable of generating pressures\nup to 15 kbar. The temperature was measured using a buried\nthermocouple inside the pressure cell. The measurements\nwere performed under pulsed operation (500 ns pulse width\nat a repetition frequency of 10 kHz) at RT to avoid current\nheating effects. At low temperatures the threshold currents\nwere ,1 mA sJth,100 A cm−2d, and hence, cw operation\nwas used to improve the measurement accuracy. At such low\ncurrents, Ohmic heating was found to have a negligible ef-\nfect on the measured values of Ith or the measured emission\nwavelengths.a)Electronic mail: s.jin@surrey.ac.uk\nAPPLIED PHYSICS LETTERS VOLUME 85, NUMBER 3 19 JULY 2004\n0003-6951\/2004\/85(3)\/357\/3\/$20.00 © 2004 American Institute of Physics357\nDownloaded 15 May 2008 to 131.227.178.92. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\nFigure 1 shows the pressure dependence of the lasing\nenergy in 1.3 mm InGaAsP and 1.5 mm InGaAs lasers mea-\nsured at a current ,20% above threshold at both low tem-\nperature and RT. It can be seen that the lasing energy, Elase,\nof both devices varies approximately linearly with increasing\npressure, P, in the pressure range of 0–10 kbar. The values\nof dElase \/dP are 8.1s±0.1d meV\/kbar for the 1.3 mm device\nat 125 K and 9.0 s±0.1d meV\/kbar for the 1.5 mm device at\n102 K, which are close to their RT values of\n8.3 s±0.1d meV\/kbar and 8.4 s±0.2d meV\/kbar, respectively.\nThe rate of lasing energy shift of both devices is close to that\nof the InP cladding layer s8.4 meV\/kbard. This implies that\ncarrier leakage would cause no change in Ith with pressure in\neither 1.3 or 1.5 mm InGaAssPd lasers, which is not what is\nobserved.\nFigure 2 shows the variation of Ith with pressure in the\n1.3 mm InGaAsP laser at 125 K and RT. A reduction of 12%\nin Ith was observed over a 10 kbar pressure range at RT,\nwhich is consistent with our previous work.15,17 This sug-\ngests a significant contribution from Auger recombination\ncurrent rather than radiative current in Ith at RT. When the\ntemperature was decreased from RT to 125 K, Ith dropped\nfrom 9 to 1.5 mA, a reduction of 83%. At 125 K, however, it\nwas found that Ith increased slowly by ,9% over a 10 kbar\npressure range. The solid line in Fig. 2 indicates the calcu-\nlated variation of the radiative current as a function of pres-\nsure for the 1.3 mm InGaAsP laser at 125 K. For this calcu-\nlation, the QW band structure was calculated using a three-\nband k ·p Hamiltonian including contributions from the\nheavy-hole, light-hole, and spin split-off valence bands. The\nconduction and valence bands were calculated by solving\nPoisson’s and Schrödinger’s equations self-consistently. The\ngain and radiative current sIradd were calculated for single\nQWs using the density matrix formulation including Lorent-\nzian broadening. The optical confinement factor, G, was cal-\nculated using the effective index method for the complete\nMQW structure. The refractive index of the pressure medium\n(helium) was taken to be unity and pressure invariant from\nwhich the threshold gain was calculated for a fixed internal\nloss of 10 cm−1. Further details of the calculation can be\nfound in Ref. 15. From Fig. 2 it is clear that the calculated\nvariation of Irad fits closely with the pressure variation of Ith.\nFrom considerations of the gain of the active region above,\none would expect Irad to increase as Eg\n2 where Eg is the band\ngap. The lower than Eg\n2 increase of calculated Irad is caused\nby the increase in G due to the decreasing lasing wavelength.\nTogether, these data confirm that radiative recombination\ndominates Ith at 125 K, rather than Auger recombination, in\nagreement with our earlier studies.15\nFigure 3 displays the pressure dependence of Ith in the\n1.5 mm InGaAs laser at 102 K and RT. As in our previous\nreports,15,17 a reduction of Ith by 36% was observed over a\n10 kbar pressure range at RT, which is a three times greater\nFIG. 1. Lasing energy, Elase, as a function of pressure in 1.3 mm InGaAsP\nand 1.5 mm InGaAs lasers measured at low temperature ,100 K and room\ntemperature. The solid lines are guides to the eye.\nFIG. 2. The pressure dependence of (a) the threshold current and (b) nor-\nmalized threshold current in a 1.3 mm InGaAsP laser measured at 125 K\nand room temperature. Also shown are the calculated variation of the radia-\ntive recombination current (solid line) and measured Eg\n2 (dashed line) at\n125 K.\nFIG. 3. The pressure dependence of (a) the threshold current and (b) nor-\nmalized threshold current in a 1.5 mm InGaAs laser measured at 102 K and\nroom temperature. The solid line and dashed line describe the variation of\nthe calculated radiative recombination current and measured Eg\n2 vs pressure,\nrespectively, at 102 K.\n358 Appl. Phys. Lett., Vol. 85, No. 3, 19 July 2004 Jin et al.\nDownloaded 15 May 2008 to 131.227.178.92. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\ndecrease than for the 1.3 mm InGaAsP lasers. When the tem-\nperature was decreased from RT to 102 K, Ith decreased from\n12 to 0.58 mA, a reduction of 95%. This implies a larger\nAuger nonradiative recombination rate and therefore larger\ncontribution from Auger recombination in 1.5 mm InGaAs\n(,80% of Ith) than in 1.3 mm InGaAsP lasers (,50% of Ith)\nat RT. At 102 K, it was found that Ith increased by 9% over\na 10 kbar pressure range, which is the same as in 1.3 mm\nInGaAsP devices. This also indicates that in 1.5 mm InGaAs\ndevices at 102 K Ith is dominated by radiative recombination.\nThis is confirmed by the calculated pressure variation of Irad\nfor these devices at 102 K (solid line) from which we find\nthat the calculated Irad and measured Ith have similar pressure\ndependencies.\nThe above-mentioned pressure results at low tempera-\ntures are consistent with previous temperature dependence\nmeasurements for the same devices.15 From the temperature\ndependence of the characteristic temperature T0 and power\nfactor Z (defined by I~nZ)14,15 it was found that below a\ncertain “break-point”15 temperature (170 K for 1.3 mm\nInGaAsP and 130 K for 1.5 mm InGaAs), T0~T with the\nvalue of Z close to 2, suggesting a significant contribution\nfrom radiative recombination for both devices. In contrast,\nabove these temperatures, Auger recombination dominates\nthe temperature dependence. At RT, the value of Z<3 and a\nsmall value of T0 near T \/3 is observed. This strongly sug-\ngests that the dominant contribution to Ith at RT is due to\nAuger recombination. Since the temperatures used for the\npresent study (125 K for the 1.3 mm InGaAsP devices and\n102 K for the 1.5 mm InGaAs devices) are well below the\nbreak-point temperature for both the 1.3 and 1.5 mm lasers,\nour low-temperature high-pressure results provide strong\nevidence which shows a transition from radiative to Auger\ndominated behavior as the device temperature is increased\nfrom ,100 K to RT.\nIn conclusion, low-temperature, high-pressure measure-\nments in 1.3 mm InGaAsP and 1.5 mm InGaAs lasers are\npresented. At low temperature ,100 K, it was found that Ith\nincreased with increasing pressure by 9% over a 10 kbar\npressure range. This behavior corresponds well to the calcu-\nlated pressure dependence of the radiative current for both\ndevices and contrasts strongly with the reduction of Ith (by\n12% for the 1.3 mm InGaAsP devices and 36% for the\n1.5 mm InGaAs devices, respectively) over 10 kbar at RT.\nThis confirms our previous temperature dependence mea-\nsurements, indicating the transition from the laser threshold\nbeing dominated by the radiative current to one where Auger\nrecombination dominates as the device temperature is in-\ncreased from ,100 K to RT.\nThe authors would like to thank Mr. G. J. Strudwick and\nMr. D. McConville for their technical help with this work.\nThis work was supported by the Engineering and Physical\nSciences Research Council (EPSRC) (UK).\n1N. K. Dutta and R. J. Nelson, Appl. Phys. Lett. 38, 407 (1981).\n2G. Fuchs, C. Schiedel, A. Hangleiter, V. Härle, and F. Scholz, Appl. Phys.\nLett. 62, 396 (1993).\n3A. R. Adams, M. Asada, Y. Suematsu, and S. Arai, Jpn. J. Appl. Phys. 19,\nL621 (1980).\n4S. Seki, H. Oohashi, H. Sugiura, T. Hirono, and K. Yokoyama, IEEE J.\nQuantum Electron. 32, 1478 (1996).\n5J. O’Gorman, A. F. J. Levi, T. Tanbun-Ek, D. L. Coblentz, and R. A.\nLogan, Appl. Phys. Lett. 60, 1058 (1992).\n6D. A. Ackerman, G. E. Shtengel, M. S. Hybertsen, P. A. Morton, R. F.\nKazarinov, T. Tanbun-Ek, and R. A. Logan, IEEE J. Sel. Top. Quantum\nElectron. 1, 250 (1995).\n7Y. Zhou, J. S. Osinski, P. Grodzinski, P. D. Dapkus, W. Rideout, W. F.\nSharfin, and F. D. Crawford, Appl. Phys. Lett. 62, 175 (1993).\n8H. Kurakake, T. Uchida, T. Yamamoto, T. Higashi, S. Ogita, and M. Koba-\nyashi, IEEE J. Sel. Top. Quantum Electron. 3, 632 (1997).\n9T. R. Chen, B. Chang, L. C. Chiu, K. L. Yu, S. Margali, and A. Yariv,\nAppl. Phys. Lett. 43, 217 (1983).\n10P. J. A. Thijs, L. F. Tiemeijer, J. J. M. Binsma, and T. van Dongen, IEEE\nJ. Quantum Electron. 30, 477 (1994).\n11M. Kondow, K. Uomi, A. Niwa, T. Kitatani, S. Watahiki, and Y. Yazawa,\nJpn. J. Appl. Phys., Part 1 35, 1273 (1996).\n12M. Allovon and M. Quillec, IEE Proc.-J: Optoelectron. 139, 148 (1992).\n13G. P. Agrawal and N. K. Dutta, in Semiconductor Lasers, 2nd ed. (Van\nNostrand Reinhold, New York, 1993), p. 56.\n14A. R. Adams, M. Silver, and J. Allam, in Semiconductors and Semimetals\nedited by R. K. Willardson and E. R. Weber (Academic, New York, 1998),\nVol. 55, pp. 313, 322.\n15S. J. Sweeney, A. F. Phillips, A. R. Adams, E. P. O’Reilly, and P. J. A.\nThijs, IEEE Photonics Technol. Lett. 10, 1076 (1998); A. F. Phillips, S. J.\nSweeney, A. R. Adams, and P. J.A. Thijs, IEEE J. Sel. Top. Quantum\nElectron. 5, 401 (1999).\n16D. Patel, A. R. Adams, P. D. Greene, and G. D. Henshall, Electron. Lett.\n18, 527 (1982).\n17S. J. Sweeney, A. R. Adams, M. Silver, E. P. O’Reilly, J. R. Watling, A. B.\nWalker, and P. J. A. Thijs, Phys. Status Solidi B 211, 525 (1999).\nAppl. Phys. Lett., Vol. 85, No. 3, 19 July 2004 Jin et al. 359\nDownloaded 15 May 2008 to 131.227.178.92. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n"}