{"doi":"10.1080\/0968776030110303","coreId":"14204","oai":"oai:generic.eprints.org:411\/core5","identifiers":["oai:generic.eprints.org:411\/core5","10.1080\/0968776030110303"],"title":"Activating Boxmind: an evaluation of a web‐based video lecture with synchronized activities","authors":["Joiner, Richard","Durkin, Catherine","Morrison, Derek","Williams, Lisa"],"enrichments":{"references":[{"id":450882,"title":"Conversation for Action: The Computer Terminal as a Medium of Communication,","authors":[],"date":"1991","doi":"10.1075\/pbns.10","raw":"Murray, D. E. (1991), Conversation for Action: The Computer Terminal as a Medium of Communication, Amsterdam: John Benjamins.","cites":null},{"id":1042708,"title":"Definite reference and mutual knowledge', in","authors":[],"date":"1981","doi":null,"raw":"Clark, H. H. and Marshall, C. E. (1981), 'Definite reference and mutual knowledge', in A. K. Joshi, B. L. Weber and I. A. Sag (eds), Elements of Discourse Understanding, Cambridge: Cambridge University Press, 10-63.","cites":null},{"id":197284,"title":"Discourse in the novel',","authors":[],"date":"1981","doi":"10.1017\/cbo9780511483127.007","raw":"Bakhtin, M. M. (1981), 'Discourse in the novel', in M. Holquist (ed.), The Dialogic Imagination, Austin, TX: University of Texas Press, 259-422.","cites":null},{"id":197285,"title":"Distance learning through distributed collaborative video viewing',","authors":[],"date":"2000","doi":"10.1145\/358916.358984","raw":"Cadiz, J. J., Balachandran, A., Sanocki, E., Gupta, A., Grudin, J. and Jancke, G. (2000), 'Distance learning through distributed collaborative video viewing', in the Proceedings of Computer Supported Cooperative Work, New York: ACM Press, 135-44.","cites":null},{"id":450887,"title":"Does the medium matter? The interaction of task type and technology on group performance and member reactions',","authors":[],"date":"1994","doi":"10.1037\/\/0021-9010.79.1.87","raw":"Straus, S. G. and McGrath, J. E. (1994), 'Does the medium matter? The interaction of task type and technology on group performance and member reactions', Journal of Applied Psychology, 79, 87-97.","cites":null},{"id":450886,"title":"Economic development and technology transfer: implications for video based distance education',","authors":[],"date":"1990","doi":null,"raw":"Stone, H. R. (1990), 'Economic development and technology transfer: implications for video based distance education', in M. G. Moore (ed.), Contemporary Issues in American Distance Education, Oxford: Pergamon, 231-42.","cites":null},{"id":1042709,"title":"Enhancing mutual understanding in synchronous computer mediated communication by training - trade offs in judgemental tasks',","authors":[],"date":"2003","doi":"10.1177\/0093650202250874","raw":"Cornelius, C. and Boos, M. (2003), 'Enhancing mutual understanding in synchronous computer mediated communication by training - trade offs in judgemental tasks', Communication Research, 30 (2), 147-77.","cites":null},{"id":450888,"title":"et al Activating Boxmind an evaluation of a Web-based video lecture with synchronized activities","authors":[],"date":"2000","doi":"10.1080\/0968776030110303","raw":"29Richard Joiner et al Activating Boxmind an evaluation of a Web-based video lecture with synchronized activities Veerman, A., Andriessen, J. E. B. and Kanselaar, G. (2000), 'Learning through synchronous electronic discussion', Computers and Education, 34, 269-90.","cites":null},{"id":450885,"title":"Experiments comparing face-to-face with virtual collaborative learning',","authors":[],"date":"1999","doi":"10.3115\/1150240.1150308","raw":"Smith, R., Sipusic, M. and Pannoni, R. (1999), 'Experiments comparing face-to-face with virtual collaborative learning', in Proceedings of Computer Supported Collaborative Learning, Mahwah, NJ: Lawrence Erlbaum Associates.","cites":null},{"id":450530,"title":"Experiments in group decision making: communication process and outcome in face-to-face versus computerised conferences',","authors":[],"date":"1986","doi":"10.1111\/j.1468-2958.1986.tb00104.x","raw":"Hiltz, R. S., Johnson, K. and Turroff, M. (1986), 'Experiments in group decision making: communication process and outcome in face-to-face versus computerised conferences', Human Communication Research, 13, 225-52.","cites":null},{"id":1042707,"title":"Hearers and speech acts',","authors":[],"date":"1982","doi":"10.2307\/414102","raw":"Clark, H. H. and Carlson, T. B. (1982), 'Hearers and speech acts', Language, 58, 332-73.","cites":null},{"id":450531,"title":"Implicit and explicit dialogue structuring in virtual learning groups',","authors":[],"date":"2000","doi":"10.1348\/000709900157967","raw":"Hron, A., Hesse, F. W., Cress, U. and Giovis, C. (2000), 'Implicit and explicit dialogue structuring in virtual learning groups', British Journal of Educational Psychology, 70, 53-64.","cites":null},{"id":450535,"title":"Making sense of computer aided learning research: a critique of the pseudo-scientific method',","authors":[],"date":"1997","doi":null,"raw":"Mitchell, P. D. (1997), 'Making sense of computer aided learning research: a critique of the pseudo-scientific method', in Proceedings of CAL '97, University of Exeter, 23-26 March 1997.","cites":null},{"id":450889,"title":"Marxism and the Philosophy of Language,","authors":[],"date":"1986","doi":null,"raw":"Volsinov, V. N. (1986), Marxism and the Philosophy of Language, tr. L. Matejka and I. R. Titunik, Cambridge, MA: Harvard University Press.","cites":null},{"id":450534,"title":"Mind, Self and Society,","authors":[],"date":"1934","doi":"10.7208\/chicago\/9780226516608.001.0001","raw":"Mead, G. H. (1934), Mind, Self and Society, Chicago: University of Chicago Press.","cites":null},{"id":450884,"title":"Nonparametric Statistics for the Behavioural Sciences,","authors":[],"date":"1988","doi":"10.1177\/014662168901300212","raw":"Siegel, S. and Castellan, N. J. (1988), Nonparametric Statistics for the Behavioural Sciences, London: McGraw-Hill.","cites":null},{"id":450883,"title":"On Message Structure: A Framework for the Study of Language and Communication,","authors":[],"date":"1974","doi":null,"raw":"Rommetviet, R. (1974), On Message Structure: A Framework for the Study of Language and Communication, New York: Wiley.","cites":null},{"id":450528,"title":"Optimal teaching environment for laparoscopic splenectomy',","authors":[],"date":"2001","doi":"10.1016\/s0002-9610(01)00558-x","raw":"Heniford, B. T., Backus, C. L., Matthews, M. D., Greene, F. L., Teel, W. B. and Sing, R. E (2001), 'Optimal teaching environment for laparoscopic splenectomy', The American Journal of Surgery, 181 (3), 226-30.","cites":null},{"id":450532,"title":"Other-relatedness in language processing: discussion and comments',","authors":[],"date":"1991","doi":"10.1177\/0261927x8800700408","raw":"Krauss, R. M. and Fusell, S. R. (1991), 'Other-relatedness in language processing: discussion and comments', Journal of Language and Social Psychology, 7, 263-79.","cites":null},{"id":197283,"title":"Promoting reflective interactions in a CSCL environment',","authors":[],"date":"1997","doi":"10.1046\/j.1365-2729.1997.00019.x","raw":"Baker, M. J. and Lund, K. (1997), 'Promoting reflective interactions in a CSCL environment', Journal of Computer Assisted Learning, 13, 175-93.","cites":null},{"id":450537,"title":"Selecting and dragging: do computer-based learner activities contribute to psychology students' understanding of descriptive statistics?',","authors":[],"date":"2002","doi":null,"raw":"Morris, E., Joiner, R. and Scanlon, E. (2002), 'Selecting and dragging: do computer-based learner activities contribute to psychology students' understanding of descriptive statistics?', Journal of Computer Assisted Learning, 18 (2), 114-24.","cites":null},{"id":450533,"title":"Studies of turn taking in computer mediated communications',","authors":[],"date":"1994","doi":"10.1016\/0953-5438(94)90022-1","raw":"Mckinlay, A., Procter, R., Masting, O., Woodburn, R. and Arnot, J. (1994), 'Studies of turn taking in computer mediated communications', Interacting with Computers, 6, 151-71.","cites":null},{"id":1042711,"title":"Teaching problem solving and clinical reasoning: 20 years experience with video supported small group learning',","authors":[],"date":"1998","doi":"10.1046\/j.1365-2923.1998.00219.x","raw":"Dequeker, J. and Jaspaert, R. (1998), 'Teaching problem solving and clinical reasoning: 20 years experience with video supported small group learning', Medical Education, 32, 384-9.","cites":null},{"id":450536,"title":"The impact of educational technology: a radical reappraisal of research methods',","authors":[],"date":"2000","doi":"10.3402\/rlt.v5i1.10551","raw":"Mitchell, P. D. (2000), 'The impact of educational technology: a radical reappraisal of research methods', in D. Squires, G. Conole and J. Jacobs (eds), The Changing Face of Learning Technology, Cardiff: University of Wales Press, 51-8.","cites":null},{"id":1042710,"title":"The influence of face-to-face versus computer mediated communication channels on collective induction',","authors":[],"date":"1993","doi":"10.1016\/0959-8022(93)90006-r","raw":"Daley, B. L. (1993), 'The influence of face-to-face versus computer mediated communication channels on collective induction', Accounting, Management and Information Technologies, 3, 1-22.","cites":null},{"id":450529,"title":"The use of videotaped lectures and web based communications in teaching: a distance teaching and cross Atlantic collaboration experiment',","authors":[],"date":"2003","doi":"10.1080\/03043790110100209","raw":"28ALT-] Volume 11 Number 3 Herder, P. M., Subrahmanian, E., Talukdar, S., Turk, A. L. and Westerberg, A W. (2003), 'The use of videotaped lectures and web based communications in teaching: a distance teaching and cross Atlantic collaboration experiment', European Journal of Engineering Education, 27, 1, 39-48.","cites":null},{"id":1042713,"title":"Tutored videotape instruction: a new use of electronic media in education',","authors":[],"date":"1977","doi":"10.1126\/science.195.4283.1139","raw":"Gibbons, J. F., Kincheloe, W. R. and Down, K. S. (1977), 'Tutored videotape instruction: a new use of electronic media in education', Science, 195, 1139-46.","cites":null},{"id":1042712,"title":"Using multimedia cases for educating the primary school mathematics teacher educator: a design study',","authors":[],"date":"2002","doi":"10.1016\/s0883-0355(02)00058-7","raw":"Dolk, M., den Hertog, J. and Gravemeijer, K. (2002), 'Using multimedia cases for educating the primary school mathematics teacher educator: a design study', International Journal of Educational Research, 37 (2), 161-78.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2003","abstract":"The aim of this study was to evaluate the use of synchronous computer‐mediated communication activities in a video e‐lecture. Previous research has reported that learning is facilitated when communication activities are added to a video lecture. Twelve postgraduate students participated in the study and they viewed a video e‐lecture on the perspective‐taking theory of communication. The lecture consisted of a video image of the lecturer, an audio track, slides, the transcript and a number of communication activities. They were given a pre‐test a week before the lecture and a post‐test a week after. They were also asked to rate the helpfulness of various aspects of the lecture. Students’ post‐test scores were statistically significantly higher than their pre‐test scores. They found the audio track, transcript, slides and activities helpful. The most helpful aspects were the communication activities. The implications of these findings are discussed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14204.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/411\/1\/ALT_J_Vol11_No3_2003_Activating%20Boxmind_%20an%20evaluat.pdf","pdfHashValue":"9d3a76f932fe1b59faecb3ca5f015f065b61a241","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:411<\/identifier><datestamp>\n      2011-04-04T09:09:46Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/411\/<\/dc:relation><dc:title>\n        Activating Boxmind: an evaluation of a web‐based video lecture with synchronized activities<\/dc:title><dc:creator>\n        Joiner, Richard<\/dc:creator><dc:creator>\n        Durkin, Catherine<\/dc:creator><dc:creator>\n        Morrison, Derek<\/dc:creator><dc:creator>\n        Williams, Lisa<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        The aim of this study was to evaluate the use of synchronous computer‐mediated communication activities in a video e‐lecture. Previous research has reported that learning is facilitated when communication activities are added to a video lecture. Twelve postgraduate students participated in the study and they viewed a video e‐lecture on the perspective‐taking theory of communication. The lecture consisted of a video image of the lecturer, an audio track, slides, the transcript and a number of communication activities. They were given a pre‐test a week before the lecture and a post‐test a week after. They were also asked to rate the helpfulness of various aspects of the lecture. Students’ post‐test scores were statistically significantly higher than their pre‐test scores. They found the audio track, transcript, slides and activities helpful. The most helpful aspects were the communication activities. The implications of these findings are discussed.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2003<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/411\/1\/ALT_J_Vol11_No3_2003_Activating%20Boxmind_%20an%20evaluat.pdf<\/dc:identifier><dc:identifier>\n          Joiner, Richard and Durkin, Catherine and Morrison, Derek and Williams, Lisa  (2003) Activating Boxmind: an evaluation of a web‐based video lecture with synchronized activities.  Association for Learning Technology Journal, 11 (3).  pp. 19-30.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776030110303<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/411\/","10.1080\/0968776030110303"],"year":2003,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Activating Boxmind: an evaluation of a\nWeb-based video lecture with synchronized\nactivities\nRichard Joiner; Catherine Durkin, Derek Morrison and Lisa Williams\nUniversity of Bath\nemail: r.joiner@bath.ac.uk\nThe aim of this study was to evaluate the use of synchronous computer-mediated\ncommunication activities in a video e-lecture. Previous research has reported that\nlearning is facilitated when communication activities are added to a video lecture. Twelve\npostgraduate students participated in the study and they viewed a video e-lecture on the\nperspective-taking theory of communication. The lecture consisted of a video image of\nthe lecturer, an audio track, slides, the transcript and a number of communication\nactivities. They were given a pre-test a week before the lecture and a post-test a week\nafter. They were also asked to rate the helpfulness of various aspects of the lecture.\nStudents' post-test scores were statistically significantly higher than their pre-test scores.\nThey found the audio track, transcript, slides and activities helpful. The most helpful\naspects were the communication activities. The implications of these findings are\ndiscussed.\nIntroduction\nThe use of video tapes to support students' learning has a long history in higher education.\nVideo case studies have been successfully used in teacher education (see Dolk, Hertog and\nGravemeijer, 2002) and medical education (see Dequeker and Jaspaert, 1998). Similar\nsuccess stories have been reported for video practicals (see Heniford, Backus, Matthews,\nGreene, Teal and Sing, 2001). However, the perspective on video lectures is not quite so\npositive. Gibbons, Kincheloe and Down (1977) found that learning can suffer when\nstudents watch a lecture video individually. Students watched the video passively and\nshowed little engagement with the material. To overcome this problem, Gibbons et al.\n(1977) developed the method of Tutor Video Instruction (TVI). TVI involves groups of\nstudents watching video tapes of lectures in small groups with a tutor present to facilitate\n19\nRichard Joiner et al Activating Boxmind an evaluation of a Web-based video lecture with synchronized activities\nthe discussion. Both the tutor and the students can stop the video tape and initiate a\ndiscussion or ask a question concerning parts of the lecture they did not understand. They\nfound that students using TVI had higher course grades than students who attended the\nlive lectures in the classroom; students who watched the videos individually and students\nwho watched the lectures from remote locations. This finding was replicated by Stone\n(1990) who found the same superiority effects even when the students met without a tutor\npresent.\nRecently this approach has been adapted through the development of a Distributed\nTutored Video Instruction (DTVT) (Smith, Sipusic and Pannoni, 1999; Dutra, Gibbons,\nPannoni, Sipusic, Smith and Sutherland, 1999). DTVI involves groups of seven students\nwatching a video of the lecture from a number of distributed locations. Students are\nconnected with a high-quality audio and video connection. They found in a series of\nexperiments involving several hundred students and six different university courses that the\nDTVI and TVI groups course grades were significantly better than those students who\nattended the live lecture. They attributed the success of DTVI and TVI to the discussion\nbetween the students. The finding was replicated by Herder, Subrahmanian, Talukdar,\nTurk and Westerberg (2003) in an experiment to co-teach an engineering course\nsimultaneously in the Netherlands and the USA. Teams were formed which had members\nfrom both countries and the findings were positive.\nDTVI involves a tutor and a high-quality audio video communication. Cadiz,\nBalachandran, Sanocki, Gupta, Grudin and Jancke (2000) developed a similar approach\nwithout a tutor called CCTV. As with TV! and DTVI, the students can stop the video tape\nat any point and initiate a discussion about the lecture. Cadiz et al. (2000) compared four\ndifferent communication channels: synchronous computer-mediated communication,\naudio conferencing, video conferencing and face-to-face. They found that synchronous\ncomputer-mediated communication was not a helpful medium to support the kind of open\ndiscussion that was thought to be beneficial in TVI and DTVI. This finding was not\nsurprising. Previous research has reported that synchronous computer-mediated com-\nmunication has a number of problems that limit its ability to support discussions. The lack\nof verbal, non-verbal and paraverbal feedback can be a hindrance to communication\n(Hron, Hesse, Cress and Giovis, 2000). Other problems occur because the time sequence of\ncontributions differs from the logical sequence of argumentation due to input and transfer\ndelays, and this impairs the coherence of the discussion (Murray, 1991). These problems\nhamper its ability to support discussion (Daley, 1993; Hiltz, Johnson and Turroff, 1986;\nMckinlay, Procter, Masting^ Woodburn and Arnot, 1994; Straus and McGrath, 1994).\nHowever, a number of researchers have found that these difficulties can be overcome either\nby coaching (Cornelius and Boos, 2003; Veerman, Andriessen and Kanselaar, 2000) or by\nstructuring the activities (Baker and Lund, 1997; Hron et al, 2000). In view of these\nfindings, the aim of this paper is to re-examine the issue of the usefulness of synchronous\ncomputer-mediated communication for supporting video e-lectures by using structured\nactivities.\nVideo e-lecture\nThe video e-lecture was part of a Masters' programme on human communication and\ncomputing. Although this was a campus-based course, we were finding it difficult to have\n20\nALT-] Volume 11 Number 3\nface-to-face seminars and discussions. Therefore, we decided to examine whether these\ncould be supported using synchronous computer-mediated communication. The students\nwere able to take the lecture at any time of their choosing within a prescribed week of the\ncourse. The only constraint was that they had to participate in the lecture with a partner.\nThe video e-lecture was on the topic of perspective-taking models of communication (for\nexample, Bakhtin, 1981; Clark and Carlson, 1982; Clark and Marshall, 1981, Krauss and\nFusell, 1991; Rommetviet, 1974; Volsinov, 1986). These models are based on the idea that\nspeakers and addressees have different perspectives and that successful communication\nrequires both speakers and addressees to take these different perspectives into account. A\nconsiderable amount of research on the role of perspective-taking in communication has\nexamined how speakers refer to objects. To refer to an object, a speaker must first\nformulate a referring expression that will permit the addressee to identify the object. Acts\nof reference are complex. Most objects can be referred to in more than one way, which one\nis used depends on the context. For example the first author of this paper may be referred\nto as 'Richard', 'NB287 345' 'Richard Joiner', 'Dr Joiner', or 'the first author' depending\non the situation.\nThe video e-lecture was implemented on the Boxmind proprietal system. Video e-lectures\nwere delivered through the Web browser Internet Explorer (Version 4.0 or later) and\nWindows Media Player (Version 6.4 or later). The Web page is split into four areas or zones\n(see Figure 1). Each of these zones is designed to hold different types of content.\nZone I\nFull motion video\nand audio stream\nencoded in\nWindows Media\nPlayer format\nZone 3\nA lecture 'contents\npage' along v\/ith a\nselection of relevant\nweb links\n^ M » •£. ^L '.£\"'\"•& £ Z '-..?--«.?'\n• Zone 2\nSynchronized slides\nZone 4\nSynchronized\ntranscript\nFigure I: Screen shot of the Web video lecture\nZone 1 (top left corner of Figure 1) contained the digital video clip, typically a head and\nshoulders shot of the lecturer. The video was encoded in Windows Media (WMV) format,\nwhich reduced the size and made possible the delivery of the resource over an Intranet\nnetwork. The video played a vital role in the e-lecture because it synchronized all other\nevents. It achieved this by embedding a series of events in the video stream that instructed\nthe Boxmind environment concerning what else should be happening on the screen, for\nexample, opening another browser window.\nZone 2 (top right corner of Figure 1) was designed to contain supporting slides and\n21\nRichard Joiner et al Activating Boxmind an evaluation of a Web-based video lecture with synchronized activities\nimages. These slides appeared automatically as the video plays. The size of the image was\nrestricted to 400x300 pixels.\nZone 3 (bottom left corner of Figure 1) contained the lecture bookmarks and Web links.\nThe user switched between these two facilities by selecting the appropriate button found in\nthis area. Lecture bookmarks were the main method of navigating around the video e-\nlecture. By selecting the desired bookmark the viewer was transported to the beginning of\nthat section and was able to replay it if desired.\nZone 4 (bottom right corner of Figure 1) displayed a transcript of what the lecturer was\nsaying. The transcript was divided into short paragraphs and as the lecturer spoke the\ncorresponding paragraph in the transcript was highlighted.\nThe video, which held all commands for other content, was segmented into fifteen parts,\neach lasting between one and five minutes in length. The Boxmind framework was\nextended to include synchronized communication activities. They were embedded into the\nlecture by a series of instructions that told the Boxmind environment to open a new\nbrowser window. This' window contained instructions regarding the activity and a\nsynchronous chat facility, which allowed the students to interact with each other online.\nThe e-lecture had five synchronous text-mediated activities and they were designed to\nillustrate points introduced in the lecture. Members of each pair worked on the activities at\nthe same rate and used the synchronous chat facility to coordinate and discuss their\nactivities.\nBefore the start of the video e-lecture, the students were first familiarized with the\nsynchronous chat facility. The video e-lecture described the different components of\nperspective; outlined the types of experiment used to investigate perspective-taking and the\nkey findings reported in research on the role of perspective-taking in the act of reference.\nThese findings were exemplified in the activities. The first activity illustrated the way\nreferential expression changes according to the situation. In this activity, the students were\nasked to refer to a course lecturer when the addressee was another student on the course, a\nstudent who is not on the course, a member of staff who teaches on the course and a\ncomplete stranger. The second activity exemplified a fundamental distinction, first\nidentified by Mead (1934), between the self and another person and how referential\nexpressions change according to whether they are for the same or another person. In this\nactivity, the students were asked to refer to an object in an array so that they can pick it out\nlater and refer to an object in an array so that another person can pick it out later. The\nthird activity tried to demonstrate that the referential expression used to refer to an object\nvaried with the age of the addressee. In this activity, the students were asked to refer to an\nobject in an array so that a young person can pick it out later and refer to an object in an\narray so that an old person can pick it out. The fourth activity illustrated how referential\nexpressions vary depending on the knowledge the speakers has of the addressee. The\nstudents were asked to refer to an object in an array so that their partner can pick it out\nlater and refer to an object in an array so that another person can pick it out. The fifth\nactivity was designed to replicate findings, which have reported that the referential\nexpressions used to refer to objects between the same communicators change over time. In\nthis activity, the students were asked to carry out a classic conversational referential task\nusing the synchronous chat facility. One student was the director and the other was the\n22\nALT-J Volume 11 Number 3\nmatcher. The director must refer to an object in an array so that the matcher could identify\nit. They did this eight times. Its purpose was to illustrate how referential expressions\nshorten over time, because partners build up shared knowledge of each other. Directly\nafter these activities the students discussed their findings with their partner using\nsynchronous computer-mediated communication.\nMethod\nThe video e-lecture was part of the course unit on Communication, Interaction and Task,\npart of an M.Sc. course in Human Communication and Computing at the University of\nBath. One of the aims of the course unit was to investigate the use of different\ncommunication technologies in education and thus the unit provided an ideal vehicle for\nexamining the use of synchronous computer-mediated communication activities in video e-\nlectures. Twelve postgraduate students took part in the study (seven females and five males,\nranging in age from twenty-two to forty-eight).\nThe pre-test was administered a week before the video e-lecture and consisted of twelve\nquestions on the perspective-taking model of communication. The lecture was scheduled\nin a particular week of the course and lasted approximately fifty minutes. All the students\nwere expected to participate in the lecture during this week and were told to use the\ncomputers in the psychology laboratory. Each student had access to a computer and used\nheadphones to listen to the audio track. Before the lecture the students selected a partner.\nA partner was necessary for the communication activities embedded in the video e-lecture.\nMembers of each partnership sat in different parts of the room so they could not see each\nother.\nThe students completed a post-test a week later, which was exactly the same as the pre-test.\nThe purpose of the pre- and the post-test was to check if the students had improved after\nparticipating in the e-lecture. The post-test also included a questionnaire that assessed\nstudents' opinions concerning the video e-lecture. The purpose of the questionnaire was to\ninvestigate what students thought of the different aspects of the e-lecture. Thirteen of the\nquestions were in the form of statements and the students had to rate their agreement using\na five-point Likert scale, ranging from strongly agree to strongly disagree. The thirteen\nstatements are listed below:\n1. The video e-lecture was a useful learning experience;\n2. Visual image of the lecturer was helpful;\n3. The audio track was helpful;\n4. The transcript was helpful;\n5. The slides were helpful;\n6. The activities were helpful;\n7. The video e-lecture was interesting;\n8. The video e-lecture was difficult to understand;\n9. The video e-lecture was too long;\n10. The video e-lecture was too slow;\n11. I participated more in the video e-lecture than in any other lectures;\n12. I missed the opportunity to ask questions;\n13. The video e-lecture had too much information.\n. 23\nRichard Joiner et at Activating Baxmind an evaluation of a Web-based video lecture with synchronized activities\nThe last three questions were open-ended questions and concerned the students' opinions\nof the embedded communication activities. These were:\n1. What did you think of the activities in the lecture?\n2. Do you think the activities helped you understand the lecture?\n3. Do you think the activities helped make the lecture more interesting?\nResults\nThe data collected from the questionnaire were of an ordinal level of measurement.\nMitchel (1997, 2000) recommends that data of this form should be analysed using non-\nparametric statistical tests. Therefore all the findings were analysed with non-parametric\nstatistics. The mean score on the pre-test was 3.75 (SD = 1.5) and the mean score on the\npost-test was 7.5 (SD = 2.8). This difference was significant (Wilcoxan Signed Rank Test, z\n= 3.2, p < 0.005) indicating that the students had improved after the video e-lecture.\nThe findings were analysed from the fixed-response questions in the questionnaire. First of\nall examining the usefulness of the different aspects of the video e-lecture. Table 1 presents\nthe mean Likert scores for the questions designed to assess the students' opinions of the\nvideo e-lecture. It also shows the percentage of students who agreed with the statements\n(collapsing the strongly agree and agree categories); the percentage who neither agreed nor\ndisagreed with the statement and the percentage who disagreed with the statement\n(collapsing the strongly disagree and disagree categories). We used a binomial test to check\nif the students significantly agreed with the statements (Siegel and Castellan, 1988). We\ndivided the students into those who agreed with a statement and those who did not (that is,\ncollapsing the 'disagree' category and the 'either neither agreed nor disagreed' category).\nFor example, for question thirteen, ten students agreed with the statement 'The video e-\nlecture had too much information' compared with two students who did not agree with it\n(one disagreed and one neither disagreed or agreed). The two-tailed probability of this\noccurring by chance is 0.04.\nFifty-eight per cent of the students agreed that the e-lecture was a useful experience. The\nstudents were not positive about a number of aspects of the video e-lecture. As many as 92\nper cent of students did not agree that the visual image of the lecture was helpful and 83\nper cent of students did not agree that they participated more in the video e-lecture\ncompared with other lectures. Eighty-three per cent agreed that they missed the\nopportunity to ask questions and the same percentage agreed that the video e-lecture had\ntoo much information. On the positive side, 92 per cent agreed the transcript was helpful;\n83 per cent agreed the slides were helpful and 100 per cent agreed that the activities were\nhelpful.\nThe helpfulness of the activities was compared with the other parts of the course. There\nwas a statistically significant difference between the students' perceived helpfulness of the\nactivities and the visual image (Wilcoxan Signed Rank Test z = 3.1, p < 0.005); activities\nand the audio track (Wilcoxan Signed Rank Test z = 2.8, p < 0.05); activities and the\ntranscripts (Wilcoxan Signed Rank Test z = 2.3, p < 0.05); and activities and the slides\n(Wilcoxan Signed Rank Test z = 3.1, p < 0.005). The students reported that the activities\nwere more helpful than the other four aspects of the course (for example, visual image,\naudio track, slides and transcripts). There were no other statistically significant differences.\n24\nALT-J Volume 11 Number 3\nDisagree Neither Agree\n1 The video e-lecture was a useful Learning Experience\n2 Visual image of the lecturer was helpful\n3 The audio track was helpful\n4 The transcript was helpful\n5 The slides were helpful\n6 The activities were helpful\n7 The video e-lecture was interesting\n8 The video e-lecture was difficult to understand\n9 The video e-lecture was too Long\n10 The video e-lecture was too slow\n11 I participated more in the video e-lecture than other lectures\n12 I missed the opportunity to ask questions\n13 The video e-lecture had too much information\n3.4\n2.5\n3.8\n4.3\n3.9\n4.8\n3.6\n3.0\n3.2\n2.9\n2.3\n4.3\n4.3\n0.8\n0.8\n0.9\n0.6\n0.5\n0.4\n0.9\nI.I\n0.9\nI.I\nI.I\n0.8\n1.0\n17\n50\n8\n0\n0\n0\n17\n25\n33\n33\n58\n0\n8\n25\n42\n25\n8\n17\n0\n25\n33\n17\n8\n25\n17\n8\n58\n8\n67\n92\n83\n100\n58\n42\n50\n50\n17\n83\n83\n* p < 0.05\nTable I: Responses to the questions\nThe activities were designed with the aim of illustrating and exemplifying key points of the\nlecture. The transcripts were examined and they showed that the activities successfully\nachieved that aim. Below is an example of the student's responses for Activity 1:\nconcerning how referents change depending on the listener. They show how the referent to\na lecturer changes depending on whether the listener is a student who is on the course or a\nstudent who is not on the course.\nExample I\n1 \/•\n2 E\n3\n4\n5\n6\nA\nB\nA\nB\nHow would you refer to Richard to another student on the course\nTo a fellow student on the course\nThat's easy I have just done ft\n'Richard'\nFellow student NOT on the course\nRichard Joiner; one of my professors\nExample 2 was a discussion between two students concerning the second activity and\nshows that the students recognized that the referential expressions used to refer to a person\nwhom the speaker knows are shorter and more familiar.\nExample 2.\n1 A\n2 A\n3\n4\nB\nA\nTeacher on course: the comms lecturer; Richard\nStranger; his name is Richard Joiner he teaches us communication at Bath Uni\nLonger descriptions for people we don't know\nShorter familiar ones with people in the know\n25\nPichard Joiner et al Activating Boxmind an evaluation of a Web-based video lecture with synchronized activities\nThe students were observed having difficulties with the synchronous communication\nsystem. Example 3 presents a quote illustrating this point. The two students were finding it\ndifficult because they were typing at the same time.\nExample 3.\n1 A Oh you cheat\n2 B It's difficult to keep track of turn taking, and to know whether you are writing at the\nmoment or are waiting to hear\n3 I didn't mean to cheat\n4 A Yeah we always type at the same time\nThe responses to the open-ended questions were examined and revealed that all the\nstudents reported that the activities were good, fun, and enjoyable:\n1 I I enjoyed the activities\n2 2 Very good, definitely reinforced the key points\n3 5 They were helpful in understanding the content of the lecture and the outcome of the\nstudies\n4 II I thought that some of the activities were quite similar to each other I most enjoyed the\n'tangram' activities, thought this was interesting to see how the referring expressions\nchanged and developed as common ground\nThe quotes above show that the students thought the activities reinforced and helped them\nunderstand the content of the lecture. The quote from student eleven shows that activity\nfive (tangram activity) achieved what it was designed to do - illustrate how referring\nexpression changes with time.\nIn response to the question 'do you think they helped your understanding?', the quotes\nbelow show that students thought the activities made the lecture more interesting and\nstressed key points.\n1 2 Reinforced ft\n2 6 They were helpful in understanding the conduct of the lecture and the outcome of the\nstudies\n3 12 Most of the activities helped in understanding what was being described in the lecture\nBelow are some of the students' responses to the last question, 'do you think the activities\nhelp make the lecture more interesting?' They show that they thought the activities helped.\n1 7 They make the lecture interesting.\n2 10 It is interesting to chat so I guess yes.\nDiscussion\nThe aim of this study was to evaluate the use of synchronous computer-mediated com-\nmunication activities to support a video e-lecture. These activities required the students to\ncommunicate with each other using a text-based chat communication system. We found\nthat students' post-test performance was significantly higher than their pre-test\nperformance. The communication activities were designed with the aim of exemplifying\nkey points of the lecture. Analysis of the transcripts showed that they achieved this aim.\n26\nAIT-] Volume 11 Number 3\nThe students also reported that the activities were the most helpful aspect of the e-lecture.\nThey were fun and enjoyable and they reinforced the points made in the lecture.\nThis study shows that students' understanding of lecture content improved after\nparticipating in the video e-lecture. Unfortunately with no control group, we cannot say\nconclusively that this finding was the result of the video e-lecture. It is possible that these\nimprovements would have occurred just through participating in the pre- and post-test.\nMorris, Joiner and Scanlon (2002) have found this with an evaluation of software designed\nto support statistics learning.\nThe students reported that the communication activities were the most helpful aspect of\nthe lecture. This finding suggests that the incorporation of synchronous computer-\nmediated communication activities in a video e-lecture could be useful for supporting\nstudents' learning. This finding contrasts with the study reported by Cadiz et al. (2000),\nwho found no benefit of using synchronous chat facilities compared with audio and video\nconferencing. One possible reason for the difference could have been the highly structured\nnature of the communication activities and the limited nature of the communication in the\nstudy reported in this paper. A number of studies have also found that structured\nsynchronous computer-mediated communication was beneficial for students' learning\n(Baker and Lund, 1997; Hron et al, 2000).\nThe transcripts showed that the students had some difficulties using the synchronous\ncomputer-mediated communication system implemented in this video e-lecture. It is possible\nthat with a more sophisticated system some of these problems would have disappeared.\nAnother possible solution would be to train the students before they use the system. Training\nhas been found to be successful in the past (Cornelius and Boos, 2003; Veerman et al, 2000).\nAlternatively, we could use synchronous audio- or video-mediated communication. Cadiz et\nal (2000) found both were superior to text-based communication.\nThis study could be extended in a number of ways. One extension would be to develop\nanother video e-lecture and investigate whether the same benefits reported in this paper\ncould be replicated using a different set of students and in a different domain. Another\nextension would be to compare video-mediated, audio-mediated and text-based commu-\nnication channels. Following on from Cadiz et al. (2000), we would expect video-mediated\nand audio-mediated communication to be more beneficial than text-mediated\ncommunication. Finally, a training study could be carried out to investigate whether\nstudents who were trained to use synchronous computer-mediated communication would\nbenefit more than students who were not trained.\nConclusion\nIn conclusion, the aim of the study was to evaluate the use of synchronous communication\nactivities for supporting students' learning. The students' post-test performance was\nsignificantly higher than their pre-test performance, which shows that the students\nbenefited from participating in the video e-lecture. The activities were designed to illustrate\nkey points in the lecture and this was confirmed through analysing the transcripts. The\nstudents reported that the most useful aspect of the lecture were the activities. They found\nthem fun and enjoyable, although they did have some difficulties with the text-based\nsynchronous communication system.\n27\nRichard Joiner et al Activating Boxmind. an evaluation of a Web-based video lecture with synchronized activities\nThese findings have important implications for the use of ICT. They show that\nsynchronous, text-based, computer-mediated communication can support students'\nlearning from a video e-lecture. The system potentially provides the students with a means\nof discussing issues arising in lectures, which is economical in terms of resources and is not\nconstrained by time and space.\nReferences\nBaker, M. J. and Lund, K. (1997), 'Promoting reflective interactions in a CSCL\nenvironment', Journal of Computer Assisted Learning, 13, 175-93.\nBakhtin, M. M. (1981), 'Discourse in the novel', in M. Holquist (ed.), The Dialogic\nImagination, Austin, TX: University of Texas Press, 259-422.\nCadiz, J. J., Balachandran, A., Sanocki, E., Gupta, A., Grudin, J. and Jancke, G. (2000),\n'Distance learning through distributed collaborative video viewing', in the Proceedings of\nComputer Supported Cooperative Work, New York: ACM Press, 135-44.\nClark, H. H. and Carlson, T. B. (1982), 'Hearers and speech acts', Language, 58, 332-73.\nClark, H. H. and Marshall, C. E. (1981), 'Definite reference and mutual knowledge', in\nA. K. Joshi, B. L. Weber and I. A. Sag (eds), Elements of Discourse Understanding,\nCambridge: Cambridge University Press, 10-63.\nCornelius, C. and Boos, M. (2003), 'Enhancing mutual understanding in synchronous\ncomputer mediated communication by training - trade offs in judgemental tasks',\nCommunication Research, 30 (2), 147-77.\nDaley, B. L. (1993), 'The influence of face-to-face versus computer mediated com-\nmunication channels on collective induction', Accounting, Management and Information\nTechnologies, 3, 1-22.\nDequeker, J. and Jaspaert, R. (1998), 'Teaching problem solving and clinical reasoning: 20\nyears experience with video supported small group learning', Medical Education, 32,\n384-9.\nDolk, M., den Hertog, J. and Gravemeijer, K. (2002), 'Using multimedia cases for\neducating the primary school mathematics teacher educator: a design study', International\nJournal of Educational Research, 37 (2), 161-78.\nDutra, J., Gibbons, J. F., Pannoni, R. L., Sipusic, M. J., Smith, R. B. and Sutherland, W. R.\n(1999), 'Virtual collaborative learning: a comparison between face-to-face tutored video\ninstruction and distributed tutor video instruction', Sun Microsystems Laboratories\nTR-99-72. Available at http:\/\/research.sun.com\/research\/techrep\/1999\/abstract-72.html,\nURL last visited July 2003.\nGibbons, J. F., Kincheloe, W. R. and Down, K. S. (1977), 'Tutored videotape instruction: a\nnew use of electronic media in education', Science, 195, 1139-46.\nHeniford, B. T., Backus, C. L., Matthews, M. D., Greene, F. L., Teel, W. B. and Sing, R. E\n(2001), 'Optimal teaching environment for laparoscopic splenectomy', The American\nJournal of Surgery, 181 (3), 226-30.\n28\nALT-] Volume 11 Number 3\nHerder, P. M., Subrahmanian, E., Talukdar, S., Turk, A. L. and Westerberg, A W. (2003),\n'The use of videotaped lectures and web based communications in teaching: a distance\nteaching and cross Atlantic collaboration experiment', European Journal of Engineering\nEducation, 27, 1, 39-48.\nHiltz, R. S., Johnson, K. and Turroff, M. (1986), 'Experiments in group decision making:\ncommunication process and outcome in face-to-face versus computerised conferences',\nHuman Communication Research, 13, 225-52.\nHron, A., Hesse, F. W., Cress, U. and Giovis, C. (2000), 'Implicit and explicit dialogue\nstructuring in virtual learning groups', British Journal of Educational Psychology, 70, 53-64.\nKrauss, R. M. and Fusell, S. R. (1991), 'Other-relatedness in language processing:\ndiscussion and comments', Journal of Language and Social Psychology, 7, 263-79.\nMckinlay, A., Procter, R., Masting, O., Woodburn, R. and Arnot, J. (1994), 'Studies of\nturn taking in computer mediated communications', Interacting with Computers, 6,\n151-71.\nMead, G. H. (1934), Mind, Self and Society, Chicago: University of Chicago Press.\nMitchell, P. D. (1997), 'Making sense of computer aided learning research: a critique of the\npseudo-scientific method', in Proceedings of CAL '97, University of Exeter, 23-26 March\n1997.\nMitchell, P. D. (2000), 'The impact of educational technology: a radical reappraisal of\nresearch methods', in D. Squires, G. Conole and J. Jacobs (eds), The Changing Face of\nLearning Technology, Cardiff: University of Wales Press, 51-8.\nMorris, E., Joiner, R. and Scanlon, E. (2002), 'Selecting and dragging: do computer-based\nlearner activities contribute to psychology students' understanding of descriptive\nstatistics?', Journal of Computer Assisted Learning, 18 (2), 114-24.\nMurray, D. E. (1991), Conversation for Action: The Computer Terminal as a Medium of\nCommunication, Amsterdam: John Benjamins.\nRommetviet, R. (1974), On Message Structure: A Framework for the Study of Language\nand Communication, New York: Wiley.\nSiegel, S. and Castellan, N. J. (1988), Nonparametric Statistics for the Behavioural Sciences,\nLondon: McGraw-Hill.\nSmith, R., Sipusic, M. and Pannoni, R. (1999), 'Experiments comparing face-to-face with\nvirtual collaborative learning', in Proceedings of Computer Supported Collaborative\nLearning, Mahwah, NJ: Lawrence Erlbaum Associates.\nStone, H. R. (1990), 'Economic development and technology transfer: implications for\nvideo based distance education', in M. G. Moore (ed.), Contemporary Issues in American\nDistance Education, Oxford: Pergamon, 231-42.\nStraus, S. G. and McGrath, J. E. (1994), 'Does the medium matter? The interaction of task\ntype and technology on group performance and member reactions', Journal of Applied\nPsychology, 79, 87-97.\n29\nRichard Joiner et al Activating Boxmind an evaluation of a Web-based video lecture with synchronized activities\nVeerman, A., Andriessen, J. E. B. and Kanselaar, G. (2000), 'Learning through\nsynchronous electronic discussion', Computers and Education, 34, 269-90.\nVolsinov, V. N. (1986), Marxism and the Philosophy of Language, tr. L. Matejka and I. R.\nTitunik, Cambridge, MA: Harvard University Press.\n30\n"}