{"doi":"10.1016\/j.nuclphysb.2004.03.016","coreId":"66451","oai":"oai:dro.dur.ac.uk.OAI2:1410","identifiers":["oai:dro.dur.ac.uk.OAI2:1410","10.1016\/j.nuclphysb.2004.03.016"],"title":"Effective theory calculation of resonant high-energy scattering.","authors":["Beneke, M.","Chapovsky, A. P.","Signer, A.","Zanderighi, G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-05-10","abstract":"Tests of the Standard Model and its hypothetical extensions require precise theoretical predictions for processes involving massive, unstable particles. It is well-known that ordinary weak-coupling perturbation theory breaks down due to intermediate singular propagators. Various pragmatic approaches have been developed to deal with this difficulty. In this paper we construct an effective field theory for resonant processes utilizing the hierarchy of scales between the mass of the unstable particle, M, and its width, Γ. The effective theory allows calculations to be systematically arranged into a series in g2 and Γ\/M, and preserves gauge invariance in every step. We demonstrate the applicability of this method by calculating explicitly the inclusive line shape of a scalar resonance in an Abelian gauge-Yukawa model at next-to-leading order in Γ\/M and the weak couplings. We also discuss the extension to next-to-next-to-leading order and compute an interesting subset of these corrections","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66451.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1410\/1\/1410.pdf","pdfHashValue":"345c50ef208bdd47a0fabf2ca6f183c8adc430cc","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1410<\/identifier><datestamp>\n      2016-09-29T09:30:14Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Effective theory calculation of resonant high-energy scattering.<\/dc:title><dc:creator>\n        Beneke, M.<\/dc:creator><dc:creator>\n        Chapovsky, A. P.<\/dc:creator><dc:creator>\n        Signer, A.<\/dc:creator><dc:creator>\n        Zanderighi, G.<\/dc:creator><dc:description>\n        Tests of the Standard Model and its hypothetical extensions require precise theoretical predictions for processes involving massive, unstable particles. It is well-known that ordinary weak-coupling perturbation theory breaks down due to intermediate singular propagators. Various pragmatic approaches have been developed to deal with this difficulty. In this paper we construct an effective field theory for resonant processes utilizing the hierarchy of scales between the mass of the unstable particle, M, and its width, Γ. The effective theory allows calculations to be systematically arranged into a series in g2 and Γ\/M, and preserves gauge invariance in every step. We demonstrate the applicability of this method by calculating explicitly the inclusive line shape of a scalar resonance in an Abelian gauge-Yukawa model at next-to-leading order in Γ\/M and the weak couplings. We also discuss the extension to next-to-next-to-leading order and compute an interesting subset of these corrections. <\/dc:description><dc:subject>\n        Modified perturbation-theory<\/dc:subject><dc:subject>\n         2-loop propagator integrals<\/dc:subject><dc:subject>\n         Collinear effective theory<\/dc:subject><dc:subject>\n         Heavy unstable particles<\/dc:subject><dc:subject>\n         Effective field-theory<\/dc:subject><dc:subject>\n         Fermion-loop scheme<\/dc:subject><dc:subject>\n         W-pair production<\/dc:subject><dc:subject>\n         Nonfactorizable corrections<\/dc:subject><dc:subject>\n         Radiative-corrections<\/dc:subject><dc:subject>\n         Feynman-integrals.<\/dc:subject><dc:publisher>\n        Elsevier<\/dc:publisher><dc:source>\n        Nuclear physics B, 2004, Vol.686(1-2), pp.205-247 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2004-05-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1410<\/dc:identifier><dc:identifier>\n        issn:0550-3213<\/dc:identifier><dc:identifier>\n        doi:10.1016\/j.nuclphysb.2004.03.016<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1410\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1016\/j.nuclphysb.2004.03.016<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1410\/1\/1410.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0550-3213","issn:0550-3213"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":["Modified perturbation-theory","2-loop propagator integrals","Collinear effective theory","Heavy unstable particles","Effective field-theory","Fermion-loop scheme","W-pair production","Nonfactorizable corrections","Radiative-corrections","Feynman-integrals."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n06 May 2008\nVersion of attached file:\nOther\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBeneke, M. and Chapovsky, A. P. and Signer, A. and Zanderighi, G. (2004) ’Effective theory calculation of\nresonant high-energy scattering.’, Nuclear physics B., 686 (1-2). pp. 205-247.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1016\/j.nuclphysb.2004.03.016\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 3042 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online 25 April 2008 \n \nCitation for item:  \nBeneke, M. and Chapovsky, A. P. and Signer, A. and Zanderighi, G. (2004) 'Effective \ntheory calculation of resonant high-energy scattering.' , Nuclear physics B., 686 (1-2), \npp. 205-247. \n \nDefinitive version available at:  \nhttp:\/\/dx.doi.org\/10.1016\/j.nuclphysb.2004.03.016 \nar\nX\niv\n:h\nep\n-p\nh\/\n04\n01\n00\n2v\n1 \n 5\n Ja\nn \n20\n04\nPITHA 03\/14\nIPPP\/03\/83\nFERMILAB-Pub-03\/410-T\nhep-ph\/0401002\nDecember 31, 2003\nEffective theory calculation of resonant\nhigh-energy scattering\nM. Benekea, A.P. Chapovskya, A. Signerb and G. Zanderighic\naInstitut fu¨r Theoretische Physik E, RWTH Aachen,\nD–52056 Aachen, Germany\nbIPPP, Department of Physics, University of Durham,\nDurham DH1 3LE, England\ncFermi National Accelerator Laboratory, Batavia, IL 60510-500, USA\nAbstract\nTests of the Standard Model and its hypothetical extensions require precise the-\noretical predictions for processes involving massive, unstable particles. It is well-\nknown that ordinary weak-coupling perturbation theory breaks down due to inter-\nmediate singular propagators. Various pragmatic approaches have been developed\nto deal with this difficulty. In this paper we construct an effective field theory\nfor resonant processes utilizing the hierarchy of scales between the mass of the\nunstable particle, M , and its width, Γ. The effective theory allows calculations\nto be systematically arranged into a series in g2 and Γ\/M , and preserves gauge\ninvariance in every step. We demonstrate the applicability of this method by\ncalculating explicitly the inclusive line shape of a scalar resonance in an abelian\ngauge-Yukawa model at next-to-leading order in Γ\/M and the weak couplings.\nWe also discuss the extension to next-to-next-to-leading order and compute an\ninteresting subset of these corrections.\n1 Introduction\nAn important part of recent and future high-energy physics experiments belongs to the\ndetailed investigation of the production of heavy unstable particles, such as W and Z\nbosons, top quarks, Higgs bosons or perhaps other new particles. From single resonant\nor pair production the masses and couplings of the particles can be determined with high\nprecision, provided theoretical calculations are equally precise. Since the decay widths of\nthe particles are often non-negligible, this includes a consistent treatment of finite-width\neffects beyond the narrow-width approximation.\nSeveral higher-order calculations involving unstable particles have been performed in\nrecent years, in particular for the line shape of the Z boson [1], W -pair production [2], and\ntt¯-production [3]. In these calculations the finite width of the particles has been treated in\na variety of often pragmatic approaches. While this may be adequate for the present, it\nis certainly desirable to formulate a theoretical framework that would allow for systematic\nimprovements of the accuracy of such calculations. Moreover, future precision experiments\nrequire that such a framework be developed.\nThe difficulty with unstable particles is that they cause singularities in propagators,\nif the scattering amplitudes are constructed according to the rules of weak-coupling per-\nturbation theory. A well-known remedy of the singularity is resummation of self-energy\ncorrections to the propagator, which results in the substitution\n1\np2 −M2 →\n1\np2 −M2 − Π(p2) . (1)\nThe self-energy has an imaginary part of order M2g2 ∼ MΓ, where Γ is the on-shell decay\nwidth of the resonance, rendering the propagator large but finite. “Dyson resummation”\nsums a subset of terms of order (g2M2\/[p2−M2+iMΓ])n ∼ 1 (near resonance) to all orders\nin the expansion in the coupling g2. This procedure raises the question of how to identify\nall terms (and only these terms) required to achieve a specified accuracy in g2 and Γ\/M .\nThe failure to address this question may lead to a lack of gauge invariance and unitarity\nof the resummed amplitude, since these properties are guaranteed only order-by-order in\nperturbation theory, and for the exact amplitude.\nMany of the current approaches to unstable particles take the restoration of gauge\ninvariance as their starting point. One example is the fermion-loop scheme [4], which is\nbased on the observation that the dominant contribution to the width of the W and Z\ngauge bosons comes from fermion loops. The prescription reads to include the fermion-loop\ncorrections in propagators and vertices, so that gauge invariance is maintained, since all\nfixed-order g2Nf terms (where Nf is the number of fermion flavours) are included. Besides\nthe restriction to gauge bosons the disadvantage of this scheme is that one-loop vertices\nmust be computed even for a leading-order approximation. Another scheme [5] constructs\na gauge-invariant non-local effective action, which can be matched onto the two-point\nfunctions of the underlying theory. The gauge Ward identities are satisfied by construction\nin this scheme. Both schemes have been implemented in four-fermion production mediated\nby W -pair production solving not only the gauge-invariance problem but also capturing\n1\nsome sophisticated features such as running of the couplings. However, it is not evident\nhow to extend them to a systematic approximation of the scattering amplitude in powers\nof g2 and Γ\/M .\nOther approaches exploit the presence of two different momentum scales in the pro-\nduction and decay of weakly interacting unstable particles: M , the mass of the unstable\nparticle, and its width, Γ≪M , both related to the location of the resonance pole. In the\npole scheme [6] the scattering amplitude is approximated by an expansion in Γ\/M around\nthe poles in the complex plane. The coefficients of this expansion must be gauge-invariant\nin every order. In pair production of unstable particles this approximation is referred to as\n“double-pole approximation” [2]. It has been used in the complete next-to-leading order\n(NLO) calculation for W -pair production [2], where in one-loop radiative corrections the\nleading term in the Γ\/M expansion is sufficient.\nThe pole approximation can be considered as the first step towards a systematic ap-\nproximation scheme to the scattering amplitude based on the separation of scales. Within\nthe (double) pole approximation the process naturally consists of production and decay\nsubprocesses, connected by the intermediate resonance(s). One-loop corrections separate\ninto two subsets: factorizable corrections to the hard production\/decay subprocesses, and\nnon-factorizable corrections, accounting for interference between different hard subpro-\ncesses. This separation does not occur at the level of individual Feynman diagrams. For\nexample, the self-energy correction to the unstable particle contains both, factorizable and\nnon-factorizable pieces, and the two have to be separated carefully to avoid double count-\ning. This is expected to be complicated for multi-loop calculations, or for a calculation\nof Γ\/M suppressed contributions, which lie beyond the pole approximation. One-loop\nnon-factorizable corrections have been extensively studied in the double-pole approxima-\ntion. A few important theorems have been proved [7], and explicit calculations have been\nperformed [8]. We also mention an approach that constructs the expansion in g2 of the res-\nonant propagator squared in the distribution sense [9], also addressing the issues of gauge\ninvariance and systematic expansions.\nIn [10] it was suggested to use the scale hierarchy Γ≪ M for constructing an effective\nfield theory, from which hard modes with momenta of order M or larger are removed.\nThe effect of the hard modes is included into the coefficients of the effective Lagrangian\nand corresponds to the factorizable corrections. Non-factorizable effects are reproduced\nby the dynamical modes of the effective theory. This provides a more precise definition\nof “factorizable” and “non-factorizable” that generalizes to higher loop orders. In [10] it\nwas shown that this approach is equivalent to the double-pole approximation within the\naccuracy of the latter (i.e. one-loop, leading order in Γ\/M). However, the idea should work\nbeyond these approximations.\nIn this paper we pursue this idea and develop the effective field theory approach to\nunstable particle production from a systematic point of view. We take the attitude that\nthe scale hierarchy Γ ≪ M is the characteristic feature of the process, and that all other\nissues such as resummation and gauge invariance will be an automatic consequence of any\ntheory that formulates the rules for an expansion in g2 and Γ\/M correctly. We identify\nthe factorization properties of the process to any order in Γ\/M , and define the effective\n2\nproduction and decay vertices and the effective Lagrangian in dimensional regularization.\nThe matching corrections are computed by expansion of Feynman integrals in momentum\nregions [11]. In this way we identify all contributions to the scattering amplitude at a given\norder in g2 and Γ\/M (and only these). We believe that this approach solves the conceptual\ndifficulties that have so far been associated with the perturbative treatment of unstable\nparticles in principle; however, for complex scattering processes, the implementation in\nhigher orders than NLO still requires difficult calculations.\nHere we shall describe our approach for the case of inclusive production of a single\ncharged scalar resonance in fermion-fermion scattering in an abelian gauge model. The\nspecific set-up of the toy model, and the restriction to inclusive scattering, imply that\na minimal set of effective fields needs to be introduced, and only the forward scattering\namplitude needs to be considered. This allows us to concentrate on the essential features of\nthe approach, such as the identification of momentum modes, factorization of the scattering\namplitude, construction of the effective Lagrangian and matching, and the calculation of\nthe scattering amplitude in the effective theory. We compute explicitly the inclusive line\nshape of the scalar particle in this toy model, and discuss some features at the next-to-next-\nto-leading order related to gauge invariance and g2Γ\/M corrections. The generalization\nof the method to final states with detected particles or jets, to non-abelian gauge bosons,\nand to pair production appears not to encounter major new conceptual issues, but requires\nmore technical work, which we hope to complete in the future. A brief exposition of the\neffective theory approach discussed in the present paper has been given in [12].\nThe outline of the paper is as follows. In Section 2 we define our toy theory and proceed\nto discuss in a non-technical manner the ingredients of the effective field theory method:\nthe momentum scales, the presence of soft and collinear modes, the effective interactions\nand the expression for the forward scattering amplitude in the effective theory. We outline\na hierarchy of effective theories, in which collinear fields are either kept or integrated out.\nThe section concludes with a leading-order calculation of the line shape and a discussion\nof scheme-dependence and matching to the off-resonance cross section. The real virtue\nof the effective theory approach becomes only apparent when one goes beyond leading\norder. A complete next-to-leading order calculation is carried out in Section 3, where we\ncompute the two-loop matching of the two-point interaction, and the one-loop matching of\nthe production vertex, required at NLO. The NLO result is completed with the calculation\nof the forward scattering amplitude in the effective theory. At the end of Section 3 we\nperform a numerical comparison of the leading-order and next-to-leading-order line shape.\nThe formalism is sufficiently general to allow a systematic extension to next-to-next-to-\nleading order. While there is no point of doing this calculation in our toy model, we outline\nthe principles of such a calculation in Section 4. Then, as an example of a next-to-next-\nto-leading order contribution, we compute the one-loop short-distance coefficient of the\nΓ\/M-suppressed production-decay operators and illustrate how a gauge-independent result\nis obtained automatically from a combination of self-energy, vertex, and box diagrams. We\nconclude in Section 5. The renormalization constants of the toy theory are collected in an\nAppendix.\n3\n2 Outline of the method\nIn this section we explain the essential features of our approach. We first set up the toy\nfield theory and scattering process that we consider in this paper. We then discuss the\nshort- and long-distance scales in resonant scattering, the corresponding momentum modes,\nand derive a representation of the scattering amplitude, in which the different scales are\nfactorized, allowing for an expansion in Γ\/M . We end this section by giving the two-to-two\nforward scattering amplitude at leading order, and obtain from this the leading-order line\nshape of the resonance.\n2.1 Definition of the model\nWe shall consider the resonant production of a massive scalar particle in the scattering of\ntwo massless Dirac fermions. The scalar and one of the fermions (the “electron”) are as-\nsumed to be charged under an abelian gauge symmetry, the other fermion (the “neutrino”)\nis neutral. The charges are supposed to be equal, so as to allow a scalar-electron-neutrino\nYukawa coupling. The theory is much simpler than the electroweak Standard Model, but\nwe find that all conceptual issues related to the treatment of the scalar resonance can be\naddressed in this toy model.\nWe thus assume the Lagrangian\nL = (Dµφ)†Dµφ− Mˆ2φ†φ+ ψ¯i 6Dψ + χ¯i∂\/χ− 1\n4\nF µνFµν − 1\n2ξ\n(∂µA\nµ)2\n+ yφψ¯χ+ y∗φ†χ¯ψ − λ\n4\n(φ†φ)2 + Lct, (2)\nwhere Lct denotes the counterterm Lagrangian, and the scalar self-interaction is included\nto make the model renormalizable. Fields and parameters are renormalized in the MS\nscheme. The letter Mˆ is used to distinguish the MS mass (at scale µ) from the pole mass\nM defined below. Explicit expressions for the counterterm Lagrangian and the renormal-\nization constants are given in the Appendix. The gauge coupling g and Yukawa coupling\ny are assumed to be of the same order. We define αg = g\n2\/(4π), αy = (yy\n∗)\/(4π), and\nuse α to refer to them summarily. With no arguments the couplings are evaluated at scale\nµ. In general, we cannot set the scalar self-coupling λ to zero, but we would like it to be\nsmall (for simplicity of the model). Without fine-tuning it is consistent to assume that\nαλ\/(4π) ≡ λ\/(16π2) is of order α2\/(4π)2, since the leading counterterm is of this order.\nWe shall assume this counting in the following.\nWe shall consider the totally inclusive cross section in electron-neutrino scattering,\nν¯(q) + e−(p)→ X, (3)\nas a function of the center-of-mass energy squared s = (q + p)2 in the vicinity of s ≈ M2,\nwhere we expect an enhancement of the cross section due to the resonant production of\nthe charged scalar. By vicinity we mean that s−M2 ∼ MΓ ∼ M2α ≪ M2. Because the\n4\nelectron is massless, the total cross section is not infrared-safe. The initial-state collinear\nsingularity should be factorized into the electron distribution function. This being under-\nstood, we will usually quote the “partonic” cross section with the singularity regularized\nin dimensional regularization and subtracted minimally. Note that strictly speaking the\nelectron distribution function is not defined if the electron is truly massless as assumed in\n(2); however, we may always assume that the electron has a mass much smaller than any\nother scale in the scattering process. We can then neglect the mass in the Lagrangian,\nkeeping in mind that it must be reintroduced to regularize the distribution function.\nOur aim is to approximate this totally inclusive line shape of the scalar resonance in\nelectron-neutrino scattering systematically in powers of g2 and\nδ ≡ s− Mˆ\n2\nMˆ2\n∼ Γ\nM\n. (4)\nThis cannot be done with standard methods, since there are kinematic enhancements\nproportional to αMˆ2\/(s − Mˆ2) ∼ 1 at every order in the perturbation expansion in α.\nThis is the origin of the well-known need for resummation.\n2.2 Effective Lagrangians, effective vertices and representation\nof the scattering amplitude\nIn space-time the resonance is produced in the collision with a characteristic formation time\nof order 1\/M , lives a much longer time of order 1\/Γ, and then decays, again within a short\ntime of order 1\/M . We therefore expect some kind of factorization between production,\npropagation and decay. This essentially classical space-time picture is corrected, because\nquantum fluctuations exist at all scales. Factorization persists quantum-mechanically, since\nonly long-wavelength fluctuations can resolve the details of production and decay (sepa-\nrated by the long time interval 1\/Γ) simultaneously. The resulting picture is shown in the\nleft-hand graph of Figure 1 below. (The right-hand graph shows the featureless “back-\nground processes”, in which the final state of the collision is produced without the reso-\nnance.) Factorization in the presence of quantum corrections can be implemented with the\neffective Lagrangian technique.\n2.2.1 Effective Lagrangian for soft and collinear interactions\nTo obtain the expansion of the line-shape in δ, we construct the effective Lagrangian and\neffective vertices for the long-distance contributions to the process. “Hard” effects related\nto quantum fluctuations with momenta k ∼ M are included as coefficient functions by\nmatching the effective Lagrangian to the underlying theory. This can be done in ordinary\nweak-coupling perturbation theory, since hard propagators, being off-shell by an amount\nof order M2, do not cause kinematic enhancements proportional to 1\/δ. Each Feynman\ndiagram is broken into a hard and other contributions similar to the non-relativistic ex-\npansion of Feynman integrals [11]. The hard region corresponds to the Taylor expansion\nof the Feynman integrand in δ (counting the loop momentum k ∼ M), and goes into\n5\nthe coefficient functions of the effective Lagrangian and effective vertices. The remaining\nregions correspond to momentum configurations, where propagators are near mass-shell.\nThey must be reproduced by the diagrams in the effective theory.\nWhat are the momentum modes in the effective theory? Parameterize the momentum\nof the scalar particle near resonance by P = Mˆv+ k, where the velocity vector v2 = 1 and\nthe residual momentum k scales as Mδ ∼ Γ. Then P 2− Mˆ2 remains small, of order Mδ, if\nthe scalar interacts with a “soft” fluctuation with momentum of order Mδ. The effective\ntheory therefore contains soft massless modes, and the heavy scalar near mass-shell. (To\nemphasize the fact that the form of the effective theory is very much the same for stable\nand unstable particles, we will also call the heavy scalar near mass-shell a “soft” mode. In\nprevious work [10] the term “resonant mode” has been used.) Note that soft interactions\ndo not change the velocity vector of the scalar. We therefore define a field φv(x) with the\nrapid spatial variation e−iMˆv·x removed to represent the heavy scalar with momentum near\nMˆv. The field φv(x) carries only the residual slow variation in x over distances of order\n1\/δ. If the heavy particle was a stable heavy quark, the effective Lagrangian that describes\nits interactions with soft quark and gluon fluctuations would be the heavy quark effective\nLagrangian [13], which has become a standard tool in heavy quark physics to separate the\nphysics on the scales M and ΛQCD. The corresponding Lagrangian for an unstable scalar\nis\nLHSET = 2Mˆ φ†v\n(\niv ·Ds − ∆\n2\n)\nφv − 1\n4\nFsµνF\nµν\ns + ψ¯si 6Dsψs + χ¯si 6∂χs + . . . . (5)\nHere Ds = ∂ − igAs denotes the covariant derivative with a soft photon field, and we have\nkept the relativistic normalization with mass dimension 1 for the non-relativistic scalar field\nφv, hence the factor 2Mˆ . Furthermore, ψs (χs) stands for the soft electron (neutrino) field.\nOnly the leading power in the expansion in 1\/Mˆ has been given, but there is no difficulty\nin adding further terms. The leading-power Lagrangian contains a single short-distance\nmatching coefficient, ∆, which can be related to the resonance pole position M2 − iMΓ\nas we discuss below (Section 3.1). In the pole renormalization scheme ∆ equals −iΓ.\nSince the Lagrangian describes only effects related to the soft scale Mδ, all dimensionful\nquantities can be assigned a scaling power of δ. (In such assignments, we set M = 1.\nDimension is restored by inserting the appropriate power of M .) Partial derivatives and\nthe soft photon field count as δ. The field φv as well as soft massless fermion fields count as\nδ3\/2, because their position-space propagator is proportional to 1\/x3 ∼ δ3. In particular,\nsince ∆ is of order Γ ∼Mα ∼ δ, and so is iv ·Ds, the decay width of the heavy scalar, or,\nmore generally, the coefficient ∆, is a leading-power effect in the Lagrangian, and must be\nincluded in the scalar propagator. This is the effective theory counterpart of the familiar\nself-energy resummation.\nThe effective theory is not yet complete, because the scalar is produced in the scattering\nof energetic (E ∼M) massless particles. To describe these “collinear” modes, we suppose\nthat the electron moves with large momentum in the direction of ~n−, and introduce two\nreference light-like vectors, n±, with n\n2\n+ = n\n2\n− = 0 and n+n− = 2. A collinear momentum\n6\nis decomposed as\npµ = (n+p)\nnµ−\n2\n+ pµ⊥ + (n−p)\nnµ+\n2\n, (6)\nwhere n+p ∼ M , n−p ∼ Mδ and p⊥ ∼ Mδ1\/2. The scaling of the small components is\ndetermined by the interaction of collinear modes with soft modes, which implies that a\ngeneric collinear fluctuation has an off-shellness of order Mˆδ. The scaling of the transverse\ncomponent is then fixed by the poles of collinear propagators. Collinear modes in an\neffective field theory framework have been discussed previously in B meson decays into\nlight energetic mesons [14]. Our set-up is in fact very similar to this case, since the\nproduction of the scalar resonance represents the “inverse” kinematics of B decay. The\nneutrino plays the role of the weak current, so that we consider the production of a heavy\nparticle by scattering an energetic electron on this “current”. The effective Lagrangian\nfor the interactions of collinear modes and soft modes is, again at leading power in the\nexpansion in δ,\nLSCET = ψ¯c\n(\nin−D + iD\/⊥c\n1\nin+Dc + iǫ\niD\/⊥c\n)\nn\/+\n2\nψc − 1\n4\nFcµνF\nµν\nc + . . . , (7)\nwhere ψc denotes the collinear electron field, which satisfies 6 n−ψc = 0 [15, 16]. The\ncovariant derivative iDc = i∂ + gAc contains the collinear photon field. The interaction\nwith the soft field appears only in in−D = in−∂ + gn−Ac + gn−As. Again there is no\ndifficulty in going to higher orders in the expansion; we discuss this below (Section 3.2).\nThe δ power counting is as follows: the components of derivatives on collinear fields and\nthe collinear photon field scale as the corresponding collinear momentum components; the\ncollinear fermion field scales as ψc ∼ δ1\/2 as seen from the propagator. Note that there do\nnot exist collinear interactions with the heavy scalar in the Lagrangian, since the coupling\nof a collinear mode to the on-shell scalar causes the scalar propagator to become hard.\nThese hard effects are already integrated out, and appear as effective production and decay\nvertices (see the following subsection). Finally, we must add an effective Lagrangian for the\ncollinear neutrino field. Adopting a frame where the electron and neutrino collide head-\non, the neutrino Lagrangian is obtained from (7) by substituting ψc → χc2, interchanging\nn− ↔ n+, and replacing all covariant derivatives by ordinary derivatives. At the level of\nthe leading Lagrangian the neutrino is non-interacting.\nTo summarize, Feynman diagrams in resonant scattering involve contributions from the\nfollowing three momentum regions:\nhard (h): p ∼M\nsoft (s): p ∼Mδ\ncollinear (c1): p⊥ ∼Mδ1\/2, n+p ∼M, n−p ∼ Mδ\n(8)\n(We note that what we call “soft” here is called “ultrasoft” in [16] and much of the literature\non soft-collinear effective theory.) In the general case several types of collinear modes are\nrequired, one for each direction defined by energetic particles in the initial and final state.\nFor the inclusive line shape we calculate the forward scattering amplitude, so no direction\n7\nis distinguished in the final state. We then need two sets of collinear modes, one for the\ndirection of the incoming electron, labeled by “c1” (or often simply “c”), the other for\nthe direction of the incoming neutrino (labeled “c2”). When the hard fluctuations are\nintegrated out, the effective Lagrangian is built from the soft heavy scalar φv, a soft and\ncollinear photon, As and Ac1, respectively, a collinear and a soft electron, ψc1 and ψs, and a\nc2-collinear and soft neutrino, χc2 and χs. (In complete generality, we should also introduce\nthe collinear fields ψc2, Ac2 and χc1, but they appear only in highly suppressed terms, so\nwe can ignore them here.) The effective interactions of these modes are described by the\nsum of LHSET and the soft-collinear effective Lagrangians for the two directions. In order\nto describe resonant scattering with a desired accuracy one has to match the Lagrangian to\nthis accuracy, and calculate the scattering amplitude in the effective theory. The relevant\nterms can be identified a priori by applying the δ power counting rules.\n2.2.2 Effective vertices\nThe effective Lagrangian misses an essential piece of physics. Since LHSET does not contain\ncollinear fields, and since LSCET does not contain the heavy scalar field, the two can interact\nonly through soft modes. In particular, there is no vertex in the Lagrangian that allows\nthe production of the scalar in the scattering of energetic particles.\nSuch vertices cannot be included in the effective Lagrangian for soft and collinear\nterms as interaction terms, because they contribute to the scattering matrix element in the\neffective theory only in a very specific pattern. For instance, a vertex with fields φvψ¯c1χc2\ncan occur exactly twice, once for the production of the scalar, and once for its decay.\nMultiple insertions are not compatible with the kinematic restrictions on the process, which\nallow only one nearly on-shell scalar line in any diagram by energy conservation. Note that\na diagram in the full theory may of course have many internal scalar lines. However, these\nwill generally be far off-shell (“hard”) and these hard effects are included in the coefficient\nfunctions of the Lagrangian and effective vertices. What we are discussing here is the\nstructure of possible diagrams\/scattering processes after hard effects are integrated out.\nIn more technical terms the interaction of two collinear modes with opposite directions,\nhere the electron and the neutrino, produces a hard momentum configuration with invariant\nmass squared of order M2, and therefore cannot be included in the effective Lagrangian.\nWhat we actually need is that the momenta of the oppositely moving collinear modes are\npre-arranged (by the experimenter who sets up the beam energy to be near resonance) to\nproduce a configuration with invariant mass squared equal to M2 within a small amount\nof order M2δ ∼ s − M2. To account for these configurations we introduce production\nand decay vertices (“effective vertices”). The leading-order vertex is simply the original\nYukawa coupling expressed in terms of the fields in the effective theory,\nJ(x) = e−iMˆv·x y [φvψ¯c1χc2](x). (9)\nIn higher order in α or δ a larger set of operators – not necessarily local – is generated by\nintegrating out hard quantum fluctuations and the coefficient function will receive correc-\n8\nH H\nH\nC C\nS\nH\nS,C\nC C\nFigure 1: Reduced diagram topologies in 2 → 2 scattering near resonance. Left:\nresonant scattering. Right: non-resonant scattering. See text for explanations.\ntions. (This will be seen in more detail in Section 3.3.) However, these operators have in\ncommon that they contain the field φv exactly once.\nThe scattering may also occur without the production of the scalar near its mass-shell.\nIn our toy theory this still requires an intermediate scalar line, since the neutrino has only\nYukawa interactions. The scalar may be off-shell, because the electron has radiated an\nenergetic (hard or collinear) photon before it hits the neutrino. In this case the invariant\nmass of the colliding electron-neutrino system is of order M2 but not near M2, producing\na non-resonant scalar. In the effective theory this process is represented by production-\ndecay operators, which do not contain φv fields. The simplest operator of this type has the\ncoupling and field structure\nT (x) ∼ |y|2 [(ψ¯c1χc2)(χ¯c2ψc1)](x). (10)\nIn general, non-resonant scattering includes all “background processes”, which produce one\nof the final states under consideration.\nWith these preparations we obtain the following formula for the forward 2 → 2 scat-\ntering amplitude in the effective theory:\ni T = ∑\nm,n\n〈ν¯e|\n∫\nd4xT{iJ†m(0)iJn(x)}|ν¯e〉+\n∑\nk\n〈ν¯e|iTk(0)|ν¯e〉, (11)\nwhere in the first term “T” denotes time-ordering, and where the sums extend over the\nsets of effective vertices of the two types, J or T . The matrix elements on the right-hand\nside are evaluated with the effective Lagrangian for soft and collinear fields. This result is\ndepicted in graphical form in Figure 1. The “resonant” scattering term on the left-hand\nside involves a production and decay vertex, and collinear interactions at the electron\nlegs, which connect to the production and decay vertex. Soft (and only these) fields can\nconnect to all parts of the diagram. The double line denotes the heavy resonance, solid lines\ncollinear modes and dashed lines soft modes. A single solid (dashed) line may represent\na collection of several collinear (soft) fields, depending on the structure of the effective\ninteraction. Collinear fields cannot be exchanged from the left to the right of a resonant\n9\ndiagram, since this would cause the scalar to be off-shell. The corresponding configurations\nare included in the “non-resonant” scattering topology on the right-hand side of the figure.\nThis topology does not involve a resonant heavy scalar, and both soft and collinear fields\ncan be exchanged across the diagram.\nThe various terms in (11) can be ordered according to their scaling with δ and α, thus\nallowing for a determination of the terms needed for a calculation to some accuracy before\nperforming any computation. We will now estimate the importance of the resonant and\nnon-resonant contributions by a simple power counting argument, taking as representatives\nthe leading interactions of each type. Combining the scaling of the fields we find J ∼\ny δ5\/2 from (9). Furthermore x is soft, since x represents the distance of order 1\/δ over\nwhich the resonant scalar propagates, hence d4x in (11) counts 1\/δ4. The normalization of\nstates implies that an external collinear particle counts as 1\/δ1\/2, so |ν¯e〉 ∼ 1\/δ. Putting\neverything together, we obtain\nσ ∼ 1\ns\nIm T ∼ |y|\n2\nδ\n∼ |y|\n2\nMΓ\n, (12)\nwhich is the expected result. The leading non-resonant scattering operator T in (10) scales\nas |y|2 δ2. The matrix element 〈ν¯e|iT (0)|ν¯e〉 is non-vanishing only at order g2, since the\noverlap of T with the external states requires the emission of an energetic photon. Adding\nthe counting of the states, we find that the contribution to T is of order g2|y2|. This\nis suppressed by a factor g2Γ\/M relative to (12), hence establishing that non-resonant\ntopologies contribute only at next-to-next-to-leading order in the combined expansion in\nα and δ. We shall discuss these effects in some detail in Section 4.2.\nIn this discussion of the non-resonant contribution we assumed that the (ψ¯c1χc2) op-\nerator in T describes an electron-neutrino configuration with invariant mass far from M2.\nWe shall see below that the applications of the equation of motion to bring the scalar ef-\nfective Lagrangian into its canonical form generate a local four-fermion operator identical\nto T , but with (ψ¯c1χc2) describing an electron-neutrino configuration with invariant mass\nnear M2. This arises because the resonant propagator is canceled by the rearrangements\nimplied by the equation of motion. In this case T has a non-vanishing tree-level matrix\nelement and contributes already at next-to-leading order.\n2.2.3 Soft and collinear fluctuations of collinear modes\nThe complication mentioned in the previous paragraph, as well as the complication of\nexcluding “by hand” collinear loop contributions to the matrix element of T\n{\nJ†(0)J(x)\n}\n,\nwhich connect the initial and final state, can be avoided, if we distinguish modes that differ\nfrom the external collinear momenta only by a soft momentum from those which differ by\na collinear momentum. Both modes have virtualityMδ1\/2 and have been called “collinear”\nup to now. However, the former can be assigned momentum Mˆn−\/2 + k, where k is soft\nand the large collinear component Mˆn−\/2 is fixed. Only the latter represent collinear\nfluctuations associated with collinear loop momenta.\n10\nJust as for the heavy scalar with momentum close to Mˆv, it is useful to extract the\nfixed large momentum from the field, and to define\nψn−(x) = e\niMˆ\/2 (n−x)P+ψc1(x) (13)\nfor soft fluctuations around the external momentum. (P+ projects on the positive frequency\npart of ψc1.) The new field ψn−(x) has only variations over distances of order 1\/δ. For the\ncollinear fluctuations we keep the field ψc1(x). Similarly we define the field χn+(x).\nThe collinear effective Lagrangian now assumes a more complicated expression, since we\ndistinguish the interactions of the two types of collinear fields. However, it is now possible\nto add the effective vertices as interaction terms in the Lagrangian, since the kinematic\ndistinction of configurations with virtualities of order and near M2 is implemented at the\nlevel of the fields. In particular, the effective vertex operator J(x) is now given by\ny [φvψ¯n−χn+ ](x), (14)\nbut there is no interaction vertex of this form with ψ¯n− replaced by ψ¯c1. For the four-\nfermion operators, we must distinguish (ψ¯c1χn+)(χ¯n+ψc1) from (ψ¯n−χn+)(χ¯n+ψn−). Since\nthe external collinear state can be created or destroyed only by the softly fluctuating\ncollinear fields and their conjugates, the latter operator has a tree-level matrix element,\nbut the former does not, because it requires interaction vertices of the type ψ¯n−ψc1Ac1 from\nthe collinear Lagrangian to generate a non-vanishing overlap with the external state.\n2.2.4 Integrating out collinear fluctuations\nThe formalism developed up to this point contains propagating soft and collinear modes\nin the effective theory. We can go one step further and integrate out collinear fluctuations,\nthat is we integrate out loops with momenta that scale as collinear momenta. This can\nbe done perturbatively as long as the couplings at the scale Mδ1\/2 are small. We now\nsketch the structure of the resultant effective theory. At the level of the calculations in the\nremainder of the paper there is in fact no difference between the two descriptions before\nand after integrating out collinear loops, since the collinear loop integrals we encounter all\nvanish in dimensional regularization.\nTechnically we introduce two distinct collinear fields as described above and eliminate\nthe fields that describe collinear fluctuations from the effective Lagrangian. With only soft\nmodes remaining in the effective theory, the effective Lagrangian is constructed from the\nsoft electron and photon field, and the fields φv, ψn− , and χn+ , all scaling as δ\n3\/2. The\nscattering amplitude can be computed from\nL = LHSET + L− + L+ + Lint, (15)\nwhere LHSET describes the soft interactions of the heavy scalar as before, and L−, L+\nare bilinear in the fields ψn−(x) and χn+(x), respectively. The soft-collinear Lagrangian\nLSCET is non-local due to the presence of 1\/(in+∂), but these non-localities disappear,\n11\nwhen collinear fluctuations are integrated out, and the large component of the energetic\nfields is “frozen” to Mˆ\/2 (modulo soft variations). For instance, consider the leading-power\nSCET Lagrangian (7) for the electron field, which matches at tree level to the expression\nψ¯n−\n(\nin−Ds +\n[i∂⊥]\n2\nMˆ\n)\nn\/+\n2\nψn− (16)\nin the new effective theory. The term with the transverse derivative squared is already\nsuppressed by one factor of δ compared to the leading term, since derivatives on ψn−(x)\ncount as δ. When collinear quantum fluctuations are included, the set of allowed operators\nconsists of operators non-local in 1\/(in−∂), since the n− component of the external soft\nmomenta of a collinear loop are of the same order as the n− component of the collinear\nmomentum. These new non-localities, appearing at higher orders in α, correspond to the\nconvolution of a “jet factor” with the remaining soft matrix element. Similar considerations\napply to the neutrino field. The fields for the soft fluctuations of the energetic particles\nnow behave in many ways similar to the field for a static heavy particle. In both cases\nthe virtuality is Mˆ2δ, and the interaction with soft modes (of virtuality Mˆ2δ2) kicks the\nparticle off its classical trajectory only by a negligible amount; hence the fixed vector that\nlabels the field. (The discussion here is reminiscent of “large-energy effective theory” [17],\nexcept that we have in mind a situation where hard and collinear modes are eliminated.)\nAs mentioned above, the production and decay vertices can be implemented as interac-\ntion terms Lint in the Lagrangian, because the kinematic restriction that prevented us from\nadding generic interactions of collinear modes with different directions to the Lagrangian\nis now implemented at the level of the fields: by construction the scattering of the elec-\ntron described by ψn−(x) and the neutrino described by χn+(x) produces a mode with\nmomentum Mˆv + k with k soft. The most general terms allowed for a 2 → 2 scattering\nprocess are of the form φvψ¯n−χn+ (or its hermitian conjugate) or (ψ¯n−χn+) (χ¯n+ψn−) plus\nadditional soft fields. Since none of the fields φv, ψn− , and χn+ is created or destroyed by\nthe other terms in the Lagrangian, the terms in Lint can only contribute in a topology that\ncorresponds to a classical scattering process of the energetic particles and the heavy scalar.\n(In particular closed loops of only φv, ψn− and χn+ lines vanish due to the structure of\nthe poles of the propagators.) These are the two topologies shown in Figure 1 but with\nthe collinear subgraphs eliminated and interpreted as parts of the production and decay\nvertices. The power counting goes as follows: since\n∫\nd4xφvψ¯n−χn+ ∼ δ1\/2, each insertion\nof this interaction vertex gives a factor of δ1\/2. (Even though the effective theory contains\nonly a single scale, we must count powers of δ rather than dimensions due to our uncon-\nventional 2Mˆ normalization of the non-relativistic scalar kinetic term.) The insertion of\na four-fermion operator carries a δ2 suppression factor, which results in a δ suppression\nrelative to the resonant contribution, not counting factors of coupling constants.\n2.3 Leading-order line shape\nWe now perform the (trivial) leading-order calculation of the inclusive line shape of the\nresonance. From the foregoing it follows that we need only the leading-order Lagrangian (5)\n12\ntogether with the leading vertex J in (9). The calculation consists of two steps: matching\nthe effective Lagrangian to the “full” theory to leading order, and the calculation of the\nforward scattering amplitude in the effective theory. At the end, we use the optical theorem\nto obtain the line shape.\n2.3.1 Matching\nSince iv∂ is of order δ on soft fields, we see from (5) that we need ∆ to order δ ∼ α.\nThis implies that ∆ must be chosen so as to reproduce the (renormalized) full theory\npropagator i\/(p2 − Mˆ2 − Π(p2)) near the resonance pole with this accuracy. We discuss\nthe matching condition in more technical terms in Section 3.1. At leading order, one finds\n∆(1) = Π(1)(Mˆ2)\/Mˆ , where Π(1)(Mˆ2) is the renormalized one-loop self-energy evaluated at\np2 = Mˆ2.\nAll calculations will be done with dimensional regularization with d = 4 − 2ǫ, where\nthe loop integration measure is defined as\n[dl] =\n(\nµ2eγE\n4π\n)ǫ\nddl\n(2π)d\n. (17)\nWith this convention the MS scheme corresponds to subtracting all poles in ǫ minimally.\nIn our toy model a straightforward computation of four diagrams\n−iΠ(1) = + + + (18)\ngives\n∆\n(1)\nMS\nMˆ\n=\nαy\n4π\n(\n2 ln\nMˆ2\nµ2\n− 4− 2iπ\n)\n+\nαg\n4π\n(\n−3 ln Mˆ\n2\nµ2\n+ 7\n)\n(19)\nin the MS scheme. (Note that the one-loop diagram proportional to the scalar self-coupling\nλ counts as α2 and therefore does not contribute to Π(1).)\nThe renormalization scheme dependence of ∆ is related to the mass renormalization\nconvention in the underlying theory, if we choose the parameter Mˆ in the effective theory\nto be the renormalized mass of the full theory. The effective theory formalism does not\nrely on a specific renormalization convention. We will use the MS convention and the pole\nmass convention to illustrate this point. The pole mass M is defined through the location\nof the singularity,\ns¯ = M2 − iMΓ (20)\nin the scalar propagator. Writing M = Mˆ + δMˆ , and using ∆(1) = Π(1)(Mˆ2)\/Mˆ , the\nrelations\nδMˆ (1) =\n1\n2\nRe∆(1), Γ(1) = −Im∆(1) (21)\nhold at the one-loop order. Note that Mˆ = Mˆ(µ), but we do not indicate the scale-\ndependence explicitly.\n13\n2.3.2 Forward scattering amplitude\nThe forward scattering amplitude is given at leading order in the effective theory (not\ndistinguishing explicitly between collinear and soft fluctuations of the collinear fields) by\ni T (0) =\n∫\nd4x e−iMˆv·x 〈ν¯e|T{iy∗ [φ†vχ¯c2ψc1](0) iy[φvψ¯c1χc2](x)}|ν¯e〉LO\n= = i2yy∗ [u¯(p)v(q)]\ni\n2Mˆ(v · k −∆(1)\/2) [v¯(q)u(p)], (22)\nwhere the double line denotes the resonant propagator defined by the effective Lagrangian\nLHSET, and k = p + q − Mˆv. We take v = (1,~0) and the external momenta p =√\ns\/2 (1, 0, 0,−1) = √s\/2n−, q =\n√\ns\/2 (1, 0, 0, 1) =\n√\ns\/2n+, so v ·k =\n√\ns−Mˆ . Note that\nby construction the effective propagator includes the geometric series of all one-loop self-\nenergy insertions, evaluated at threshold according to the definition of ∆(1). Performing\nthe polarization average the forward scattering amplitude reads\nT (0) = − yy\n∗ s\n4Mˆ(\n√\ns− Mˆ −∆(1)\/2) . (23)\nNote that because we used spinors u(p) etc. for the external states, T (0) contains next-\nto-leading order terms from the factor s = Mˆ2 + [s − Mˆ2] in the numerator. For a strict\nexpansion it would be more appropriate to use the spinors u(Mˆn−\/2) etc., in which case\nT (0) would be strictly leading order, but in practice it may be convenient not to perform\nthis trivial expansion in order to reduce the number of terms.\n2.3.3 Inclusive line shape\nThe inclusive line shape is related to the forward scattering amplitude by the optical\ntheorem, which gives\nσ(0) =\n1\ns\nIm T (0) = yy\n∗\n4Mˆ\nΓ(1)\/2\n(\n√\ns− [Mˆ + δMˆ (1)])2 + Γ(1)2\/4\n=\nπα2y\n4\n1\n(\n√\ns− [Mˆ + δMˆ (1)])2 + (αyMˆ\/4)2\n, (24)\nwhere we used (21). The line shape has the form of a Breit-Wigner distribution in the\ncenter-of-mass energy\n√\ns. This is in fact the universal line shape that appears in the\nleading-order approximation to any resonant ν¯e scattering process in our toy model, but\nthe line shapes will depend on the final state beyond this approximation. (It is a matter of\nconvention whether we divide by s to obtain the cross section from the forward scattering\namplitude, or expand this factor around Mˆ2. Here we keep 1\/s unexpanded, so that the\nfactor of s in the numerator of (23) is canceled, and the leading-order line shape assumes\nan exact Breit-Wigner distribution.)\n14\nIn the presence of fields for unstable particles unitarity and the optical theorem apply\nto the scattering matrix defined on the Hilbert space of stable particle in- and out-states\nonly, since the resonance does not correspond to an asymptotic particle state [18]. The\noptical theorem can be interpreted as taking the sum over all “cuts” of a diagram, where\nnow the line for the unstable particle propagator must not be cut. For the leading order\ndiagram in (22) this means that cutting the effective propagator represents the sum over all\npossible cuts of the one-loop self-energy insertions implicitly contained in the double-line\npropagator. This corresponds to cutting the second diagram in (18), which is responsible\nfor the leading-order decay width Γ(1) of the scalar.\nWe remark that the effective Lagrangian is not real, since the hard coefficient functions\nhave imaginary parts, but this does not lead to a non-unitary time evolution. Consider,\nfor instance, the diagram in (22). Unitarity requires an amplitude that corresponds to the\n“square” of this diagram, but the effective theory does not contain diagrams with closed\nelectron-neutrino loops. Rather the corresponding (short-distance) effect is included in\nthe complex coefficient function. Matching the effective theory to the underlying theory\nautomatically guarantees that the combination of effective theory diagrams and complex\ncouplings reproduces the unitary time-evolution to the desired accuracy.\nThe calculation shows that if the result is represented in two different mass renormal-\nization schemes, the masses must be related to one-loop accuracy for a consistent change of\nconventions. For instance, if the pole massM = 100GeV is known from elsewhere, the MS\nmass for µ = Mˆ is Mˆ = M − δMˆ (1) = 98.8GeV, where we use αy = αg = 0.1 to illustrate\nthe numerics. From (24) we see that the denominator contains\n√\ns−M in any scheme to\none-loop accuracy, but there is a residual scheme dependence (and scale dependence, since\nMˆ depends on µ) due to the width αyMˆ\/2. This is a NLO effect, which will be reduced\nby a higher-order calculation, as will be the dependence on the renormalization convention\nof the coupling constants. The line shape in the pole and MS scheme is shown in the left\npanel of Figure 2.\nThe effective theory calculation (24) is valid only near resonance when\n√\ns−Mˆ is small,\nsince the expansion inherent to the construction neglects corrections of this order. In other\nwords, near resonance the corrections are of order α or δ, but the second quantity becomes\nlarge far off the resonance. To obtain an adequate description of the line shape in the\nentire kinematical range, the effective theory calculation must be matched to a full theory\ncalculation off resonance. The point to note here is that the full theory calculation of\nthe forward scattering amplitude can be done with ordinary perturbation theory, since no\nkinematic enhancements invalidate it off resonance. In particular, the optical theorem is\napplied to intermediate states including the scalar particle as if it were stable.\nThe off-resonance cross section is only of order α2 compared to order one near resonance.\nThe result takes the form\nσ =\nπα2y s\n(s− Mˆ2)2\n(\nfy(Mˆ\n2\/s) +\nαg\nαy\nθ(s− Mˆ2) fg(Mˆ2\/s)\n)\n(25)\nwith\nfy(z) = 1,\n15\n96 98 100 102 1040\n0.0005\n0.001\n0.0015\n50 100 1501e-06\n0.0001\n0.01\ncombined\neffective theory\nfull theory\nFigure 2: Left panel: line shape (in GeV−2) in the pole (solid) and MS scheme\n(dashed) as a function of the center-of-mass energy (in GeV). Right panel: Leading-\norder line shape (in GeV−2) as a function of center-of-mass energy (in GeV) in the\neffective theory (solid) and the cross section off resonance in the full theory (dashed).\nThe thick grey curve shows the leading-order line-shape with the two curves matched\nappropriately.\nfg(z) = (1− z)\n{\n(1 + z2) ln\ns(1− z)2\nν2\n− 2z\n}\n. (26)\nThe “partonic” cross section has a collinear divergence, which has been subtracted accord-\ning to the MS prescription. The physical cross section follows from convoluting the above\nresult with an electron distribution function (in the electron) that depends on the subtrac-\ntion scale ν. The argument of the logarithm suggests that the collinear factorization scale\nshould be taken to be of order (s− Mˆ2)\/Mˆ ∼ Mˆδ. In the right panel of Figure 2 we show\nthe leading-order computation in the effective theory, and in the full theory off resonance,\nevaluated at the running scale ν =\n√\ns (1 − z). The effective theory calculation correctly\nrepresents the line shape near the resonance with relative accuracy α. The peak height is\nof order 1. As the calculation is extrapolated off resonance the cross section decreases and\nbecomes of order α2. However, in this region the relative error on the effective theory cal-\nculation is of order unity. The full theory calculation correctly represents the off-resonance\ncross section of order α2 with relative accuracy α. As the calculation is extrapolated to-\nwards the resonance, the relative error becomes of order unity. (In fact, the cross section\ndiverges at s = Mˆ2 and the error becomes arbitrarily large.) The two calculations must\nbe matched in the intermediate region where δ ∼ (√s − Mˆ)\/Mˆ is small enough for both\ncalculations to be valid. The existence of this intermediate region is indicated in the figure\nby the vertical lines to the left and the right of the resonance peak. We also verify from (24)\nand (25) that the two calculations agree analytically in this intermediate region. (For com-\npleteness we mention that the partonic cross section proportional to αy δ(s− Mˆ2) should\nbe included in the convolution with the electron distribution function, which ensures that\n16\nthe off-resonance cross section is ν-independent, and sums large logarithms of\n√\ns over the\nelectron mass. Since this procedure is standard, we presented the partonic cross section at\nthe running scale, at which no large logarithms occur.)\n3 The line shape at next-to-leading order\nFollowing the formalism set up in the previous section we now discuss the matching calcu-\nlations in more detail. We construct the effective Lagrangian by matching on-shell Green\nfunctions and present the explicit form of all terms of the effective Lagrangian that are\nneeded for the evaluation of the line shape at next-to-leading order. At the end of this\nsection we also compute the scattering matrix element in the effective theory to next-to-\nleading order and obtain the complete NLO line shape.\nThe matching procedure involves three steps. Compute the renormalized on-shell Green\nfunctions in the full theory up to the required order in α. Evaluate the same quantity in\nthe effective theory. Determine the hard matching coefficient so that the two calculations\nagree within a specified accuracy. The Green functions in the full theory are calculated\nusing conventional weak-coupling perturbation theory. In general, we need an infrared reg-\nularization, and the same regularization must be used when computing the corresponding\nquantity in the effective theory. The result for the matching coefficient is independent of\nthe IR regularization. The calculations become particularly simple with dimensional reg-\nularization, since the effective theory loop diagrams vanish in this scheme. This is simply\na consequence of the fact that the matching is done on-shell, which renders the corre-\nsponding integrals scaleless. However, the matching coefficients depend on a factorization\nscheme, since the Green functions in the effective theory also exhibit ultraviolet singular-\nities. Thus they have to be UV-subtracted and the choice of the renormalization scheme\nfor the effective theory amounts to the choice of the factorization scheme.\nIn practice, we simplify the matching procedure by computing directly the hard part\nof the renormalized on-shell Green functions in the full theory, using the method of re-\ngions [11]. This also applies to the Z-factors that multiply the amputated on-shell Green\nfunction. Even though the method of regions forces us to use dimensional regularization\nto define the factorization scheme, we are still free to use another infrared regulator, such\nas a photon mass, in which case the loop diagrams in the effective theory are generally\nnon-vanishing. However, the result of the hard part is independent of the infrared regu-\nlarization of the full theory, but it contains infrared 1\/ǫ poles due to the separation into\nhard and soft contributions. These singularities coincide with the above-mentioned UV\nsingularities in the effective theory. We choose to subtract them minimally and thereby\ndefine the factorization scheme and the renormalization scheme for the effective theory.\n3.1 Matching LHSET\nFor the calculation of the line shape at leading order it is sufficient to consider the first\nterm of LHSET [Eq. (5)], with the matching coefficient ∆ known to order α ∼ δ. At next-to-\n17\nleading order we will need all terms of order {α2, αδ, δ2}×φ†vφv. Furthermore, at NLO there\nwill also be soft photon loop diagrams in the effective theory, so we will need to include\nthe corresponding terms in the Lagrangian. Since these diagrams will be suppressed by a\nfactor α with respect to the leading-order diagram, the soft photon vertices are only needed\nat leading order.\n3.1.1 The bilinear terms for the unstable field\nThe bilinear terms of the effective Lagrangian are determined by the dispersion relation\nfor the free-particle states. The field φv describes a heavy particle near mass-shell, so we\nneed the equivalent of the heavy-quark effective Lagrangian for a scalar field. The only\ncomplication is that the scalar is unstable, so the notion of a free-particle state is not really\ndefined. In this case the bilinear terms are constructed so as to reproduce the two-point\nfunction near the resonance pole.\nIn the underlying theory the full renormalized propagator for the unstable particle is\ngiven by i(s − Mˆ2 − Π(s))−1, where −iΠ(s) corresponds to the amputated 1PI graphs,\nincluding counterterms. Recalling P = Mˆv + k the propagator near the resonance pole\ncan be written as\ni Rφ\nP 2 − s¯ =\ni Rφ\n2Mˆvk + k2 − (s¯− Mˆ2) , (27)\nwhere we denoted the complex pole of the propagator by s¯ and the residue at the pole by\nRφ. Defining\n∆ ≡ s¯− Mˆ\n2\nMˆ\n, (28)\nwe solve P 2 = s¯ in the form\nvk = −Mˆ +\n√\nMˆ2 + Mˆ∆− k2⊤ =\n∆\n2\n− ∆\n2 + 4k2⊤\n8Mˆ\n+O(δ3), (29)\nwhere for any vector aµ⊤ ≡ aµ− (va) vµ. The second solution has vk ∼ Mˆ and is irrelevant.\nFrom this we obtain the effective Lagrangian\nLφφ = 2Mˆφ†v\n(\niv ·Ds − ∆\n2\n)\nφv + 2Mˆφ\n†\nv\n(\n(iDs⊤)\n2\n2Mˆ\n+\n∆2\n8Mˆ\n)\nφv + . . . . (30)\nThe terms in the second bracket are suppressed by one factor of δ relative to the leading\nterms. Several comments are in order:\n(i) The field φv is a pure destruction field. Even if the original scalar field had been\nneutral (real), the corresponding effective scalar field would have been complex, because\nit contains only the destruction part of the relativistic field. We keep a factor 2Mˆ in the\nkinetic terms to preserve the canonical mass dimension 1 for a scalar field.\n(ii) Since the full Lagrangian is gauge invariant and so is the separation into hard\nand soft contributions, the effective Lagrangian is also gauge invariant. Therefore, the\n18\ninteractions of the unstable field with soft photons can be taken into account by replacing\nordinary derivatives by covariant derivatives. This has been done in (30).\n(iii) The quantity ∆ plays the role of a matching coefficient. For a stable particle ∆\nvanishes in the pole mass scheme and is referred to as “residual mass” in a general scheme.\nIn the unstable case ∆ is complex and always non-vanishing. It is ∆ that prevents the\npropagators of the effective theory diagrams from becoming singular. For the interpre-\ntation of ∆ as a matching coefficient to be consistent, ∆ must be given entirely by hard\nfluctuations. This is related to the fact that the location of the pole of the propagator (27)\nis infrared-finite. Alternatively, we may note that quantum corrections to the effective the-\nory propagator do not modify the location of the pole to any order in perturbation theory,\nso the full self-mass must already be contained in the coefficient function ∆. Further, we\nnote that ∆ is gauge-independent, because s¯ and Mˆ are gauge-independent.\n(iv) Computing the propagator to all orders in δ with the effective Lagrangian (30)\ndoes not reproduce (27). Instead we obtain\niReffφ\n2Mˆ\n(\n(vP )−\n√\nMˆ2 + Mˆ∆− k2⊤\n) ≃ i̟−1Reffφ\nP 2 − s¯ (31)\nnear the resonance pole, where we used that the coefficients of the higher-order kinetic\nterms in the effective Lagrangian renormalize in the same way as the leading term due to\nLorentz invariance. Besides the different standard residue factors, there also appears the\nfactor\n̟−1 ≡\n(\n1 +\nMˆ∆− k2⊤\nMˆ2\n)1\/2\n= 1 +O (α, δ) , (32)\nwhich differs from 1 even at tree level (∆ = 0).\nThis is due to the fact that (up to the factor 2Mˆ) we use the standard form of a\nnon-relativistic Lagrangian, which does not reproduce the normalization of a relativistic\nfield. This is not a problem, because the different normalization is taken into account in\nmatching calculations. Whenever we compute an amputated Green function in the effective\ntheory we multiply every external φv-line by the additional wave-function normalization\nfactor ̟−1\/2. This will be important in Section 3.3, where we discuss the matching of the\nproduction (decay) vertex.\n3.1.2 Two-loop computation of ∆\nThe matching coefficient ∆ is of order Mˆδ with δ defined in (4) and will be computed from\nthe perturbative expansion of the hard part of the self-energy only. We write the expansion\nin the form\nΠh(s) = Mˆ\n2\n∑\nk,l\nδl Π(k,l), (33)\nwhere it is understood that Π(k,l) ∼ αk. Since the unstable field couples to massless particles\nthe full self-energy is not analytic at Mˆ2. In particular, for our model dΠ(s)\/ds|s=Mˆ2 has\n19\nan infrared singularity. However, only the hard part of the self-energy enters (33). This\npart is constructed from the Taylor expansion of the Feynman integrand in δ and hence\nanalytic at Mˆ2, so the Taylor expansion (33) is also well-defined.\nThe position of the pole of the propagator, s¯, and the hard part of the residue at the\npole, Rhφ, can be expressed in terms of the Π\n(k,l). Up to the third order we find\ns¯\nMˆ2\n= 1 + Π(1,0) +Π(2,0) +Π(1,1)Π(1,0) (34)\n+Π(3,0) +Π(2,1)Π(1,0) +Π(1,1)Π(2,0) + [Π(1,1)]2Π(1,0) +Π(1,2)[Π(1,0)]2 + . . . .\nR−1hφ = 1− Π(1,1) − Π(2,1) − 2Π(1,2)Π(1,0) (35)\n−Π(3,1) − 2Π(2,2)Π(1,0) − 2Π(1,2)Π(2,0) − 2Π(1,2)Π(1,1)Π(1,0) − 3Π(1,3)[Π(1,0)]2 + . . . .\nThe first equation allows us to express the matching coefficient ∆ [Eq. (28)] in terms of\nthe hard part of the self-energy. Note that even though only the hard part of Π appears in\n(34), s¯ is the physical pole location. In other words, there is no difference whether we use\nthe full self-energy or only its hard part in (34), since ∆ receives no soft contributions as\ndiscussed above. The situation is different for the residue, since its hard part, as defined in\n(35), does not in general coincide with the residue of the full propagator Rφ that appears\nin the LSZ reduction formula and in (27). Rφ is given by an equation similar to (35) where\nthe hard part is replaced by the full self-energy. The relation reads Rφ = RhφReffφ. The\nresidues Rφ and Reffφ in the full and effective theory are IR divergent and depend on the IR\nregulator, but the hard part of the residue is independent of this regularization. However,\nif dimensional regularization is adopted for the IR singularities, Reffφ = 1 (since all loops\nin the effective theory vanish), and the full and hard residues coincide.\nWe now turn to the explicit calculation of the matching coefficient\n∆ ≡∑\ni\n∆(i) = Mˆ Π(1,0) + Mˆ\n(\nΠ(2,0) +Π(1,1)Π(1,0)\n)\n+ . . . (36)\nwith ∆(i) = O (αi). We need Π(1,0) for the calculation of the matching coefficient at leading\norder, while we need Π(2,0) and Π(1,1) at NLO. Defining\nag ≡ αg\n4π\n, ay ≡ αy\n4π\n, aλ ≡ λ\n16π2\n, (37)\nwe find\nΠ(1,0) = ay\n(\nMˆ2\nµ2\n)−ǫ (\n−2\nǫ\n− 4− 8ǫ+ 7π\n2 ǫ\n6\n− 2iπ − 4iπǫ\n)\n(38)\n+ ag\n(\nMˆ2\nµ2\n)−ǫ (\n3\nǫ\n+ 7 + 15ǫ+\nπ2 ǫ\n4\n)\n+ δ\n(1)\nM − δ(1)φ ,\nΠ(1,1) = ay\n(\nMˆ2\nµ2\n)−ǫ (\n−2\nǫ\n− 2 + 7π\n2ǫ\n6\n− 4ǫ− 2iπ − 2iπǫ\n)\n− δ(1)φ , (39)\n20\nwhere δ\n(1)\nM and δ\n(1)\nφ refer to the order α part of the counterterms given in the Appendix.\nThe order ǫ terms will be needed only in (41) below.\nThe two-loop self-energy has contributions proportional to αyαg (4 diagrams), α\n2\ny (2\ndiagrams) and α2g (10 diagrams), not counting counterterm diagrams, as well as a contri-\nbution proportional to αλ, which by assumption is of the same order. The result reads\nΠ(2,0) =\n(\nMˆ2\nµ2\n)−2ǫ\nayag\n[\n− 3\nǫ2\n− 17\n2ǫ\n+\n17π2\n2\n− 99\n4\n− 24ζ(3)− 6iπ\nǫ\n− 39iπ + 8iπ\n3\n3\n]\n+\n(\nMˆ2\nµ2\n)−2ǫ\na2y\n[\n− 3\nǫ2\n− 5\n2ǫ\n− 11π\n2\n2\n+\n57\n4\n+\n2iπ\nǫ\n+ 5iπ\n]\n+\n(\nMˆ2\nµ2\n)−2ǫ\na2g\n[\n8\nǫ2\n+\n7\n2ǫ\n+\n44π2\n3\n− 149\n4\n+ 24ζ(3)− 16π2 ln 2\n]\n− aλ\n(\nMˆ2\nµ2\n)−ǫ (\n1\nǫ\n+ 1\n)\n+Π\n(2)\nct (40)\nwith the counterterms given by\nΠ\n(2)\nct =\n(\nδ\n(2)\nM − δ(2)φ\n)\n+\n(\n2δ(1)y − δ(1)ψ − δ(1)χ\n)\nΠ(1,0)y\n+\n(\n2δ′ (1)g − δ(1)A − δ(1)φ\n)\nΠ(1,0)g\n+\n(\nδ\n(1)\nM − δ(1)φ\n)\nMˆ2\n∂Π(1,0)g (Mˆ\n2, P 2)\n∂Mˆ2\n∣∣∣∣∣\nP 2=Mˆ2\n+ δ\n(2)\nλ\n∫\n[dk]\ni\nk2 − Mˆ2 . (41)\nIn (41) we indicated the power of α in the counterterms and denoted by Π(1,0)y and Π\n(1,0)\ng the\ncontribution to the one-loop self-energy proportional to αy and αg respectively, not includ-\ning counterterms. We adopt the MS renormalization scheme and refer to the Appendix for\nthe explicit expressions of the counterterms appearing in (41). The two-loop integrals have\nbeen computed with standard techniques. We checked some of our results with recurrence\nrelations from [19], and two-loop master integrals from [20]. Massive one-loop integrals\n(needed here and later) were in part computed with the method described in [21].\nThe matching coefficients ∆(1) and ∆(2) defined in (36) read in the MS-scheme\n∆(1)\nMˆ\n= ag\n(\n−3 ln Mˆ\n2\nµ2\n+ 7\n)\n+ ay\n(\n2 ln\nMˆ2\nµ2\n− 4− 2 iπ\n)\n(42)\n∆(2)\nMˆ\n= a2g\n(\n8 ln2\nMˆ2\nµ2\n+\n16\n3\nln\nMˆ2\nµ2\n− 193\n4\n+\n40π2\n3\n− 16π2 log(2) + 24ζ(3)\n)\n+ a2y\n(\nln2\nMˆ2\nµ2\n− (11 + 10 iπ) ln Mˆ\n2\nµ2\n+\n89\n4\n− 23π\n2\n3\n+ 13 iπ\n)\n+ agay\n(\n−9 ln2 Mˆ\n2\nµ2\n+ (31 + 12 iπ) ln\nMˆ2\nµ2\n− 115\n4\n+ 5π2 − 24ζ(3)− 41 iπ + 8 iπ\n3\n3\n)\n+ aλ\n(\nln\nMˆ2\nµ2\n− 1\n)\n. (43)\n21\nWe have computed these coefficients in an arbitrary covariant gauge and checked their\ngauge-parameter independence. Note that Π(1,1) and Π(2,0) in (39) and (40) have 1\/ǫ\ninfrared poles after MS renormalization, which must be associated with the factorization\nof the hard and soft contributions. For s¯ and, therefore, for the matching coefficient ∆\nthese singularities cancel as they should. On the other hand, the residue at the pole, Rφ,\nhas an infrared singularity in the MS-scheme. (In the on-shell scheme Rφ = 1 by definition,\nbut in this scheme the field renormalization factor Zφ exhibits the infrared singularity.)\n3.1.3 Including soft photons and fermions\nTo complete the soft Lagrangian LHSET for the NLO computation the bilinear terms of the\nunstable field, Lφφ, have to be supplemented by the kinetic terms of the soft photon and\nfermions. Due to gauge invariance, these terms will also contain the interaction terms of a\nsoft photon with a soft charged fermion.\nThe leading operators scale with δ4 and are given by the gauge-invariant kinetic terms\nψ¯si 6Dsψs, χ¯si 6 ∂χs and −1\/4FsµνF µνs . By convention the kinetic terms are canonically\nnormalized, and their coefficients do not receive corrections from hard loops. The effective\nLagrangian contains an infinite number of higher-dimension operators such as ψ¯sψsχ¯sχs\n(which scales with δ6). At NLO we need the operators that scale with δ5. However, since\nwe assume weak coupling with g ∼ δ1\/2, at NLO we only need the operators that have\nnon-zero coefficients as g → 0. There are no such operators, so we conclude that at NLO\nthe only relevant soft photon-fermion interaction is contained in ψ¯si 6Dsψs. No further\ncalculation is required to match LHSET at NLO.\nPutting everything together we obtain for LHSET including all terms needed for the\nNLO line shape in the weak-coupling limit\nLHSET = 2Mˆφ†v\n(\niv ·Ds − ∆\n(1)\n2\n)\nφv + 2Mˆφ\n†\nv\n(\n(iDs⊤)\n2\n2Mˆ\n+\n[∆(1)]2\n8Mˆ\n− ∆\n(2)\n2\n)\nφv\n− 1\n4\nFsµνF\nµν\ns + ψ¯si 6Dsψs + χ¯si 6∂χs (44)\nwith ∆(1) and ∆(2) given in (42) and (43) respectively. The first term of (44) gives rise\nto the unstable particle propagator used in the calculation of the leading-order amplitude\n(22). All other terms are needed at next-to-leading order only. Note that in writing the\nLagrangian (44) we have expanded the matching coefficient ∆ in powers of α, so that\nthe unstable particle propagator strictly counts as 1\/δ ∼ 1\/α. Alternatively, we could sum\nhigher-order corrections to ∆ back into the propagator, although this would not correspond\nto a strict expansion of the scattering amplitude in δ and α. We will investigate the effect\nof including additional terms in the propagator in the numerical analysis below.\n3.2 Matching LSCET\nThe leading Lagrangian for the collinear fields has been given in (7). In the position space\nformulation of soft-collinear effective theory the Lagrangian has been worked out to order\n22\nδ in [16]. (We note again that what is called “soft” here has been called “ultrasoft” in\n[16].) When expanded systematically in powers of δ1\/2, the interaction vertices are rather\ncomplicated. Our task of writing down all the terms needed for the NLO computation\nof the line shape is again simplified by the fact that we adopt the weak-coupling limit\ng ∼ δ1\/2. Inspection of the expressions in [16] shows that once again there are no relevant\noperators at order δ9\/2 and δ5 that survive as g → 0. All the vertices needed for collinear\nloop corrections to the LO line shape are contained in the leading-order Lagrangian\nψ¯c\n(\nin−D + iD\/⊥c\n1\nin+Dc + iǫ\niD\/⊥c\n)\nn\/+\n2\nψc. (45)\nThe Feynman rules for the three-point vertices ψ¯cψcAc and ψ¯cψcAs can be read off from\nthis expression. We may note that the inverse covariant derivative can be written in terms\nof Wilson lines\n(in+Dc + iǫ)\n−1 =Wc (in+∂ + iǫ)\n−1W †c , (46)\nwhere Wc is\nWc(x) = exp\n(\nig\n∫ 0\n−∞\nds n+Ac(x+ sn+)\n)\n. (47)\nThe term (45) therefore contains vertices with any number of Ac fields, which are all\nleading power in δ, but suppressed by gauge coupling factors g, so they are not needed for\nthe computations of the NLO line shape.\nInteractions with soft photons are contained in ψ¯c in−Dψc. In [16] collinear-soft in-\nteraction vertices are light-cone multipole-expanded, and the covariant derivative reduces\nto in−D = in−∂ + gn−Ac(x) + gn−As(x−) with x− = (n+x)n−\/2 at leading power. This\nshould be done here only for the coupling of soft fields to the fields describing collinear\nfluctuations, but not for the coupling to collinear fields with soft fluctuations, since only\nfor the former fields is the transverse momentum large compared to the transverse mo-\nmentum of soft fields. This affects the way momentum conservation is implemented at the\ncorresponding interaction vertices.\n3.3 Production (decay) vertex\nThe computation of the LO forward scattering amplitude (line shape) requires only the\nvertex φvψ¯c1χc2 + h.c. at tree level. At NLO we therefore need the one-loop coefficient\nfunction of this vertex, and production or\/and decay vertices suppressed by one factor of\nδ (without loop corrections).\n3.3.1 Power-suppressed vertices\nThe power-suppressed vertices with field content φvψ¯c1χc2 can be obtained to order δ from\nthe result for the heavy-to-light decay current in [16]. However, the result relevant for\nthe forward scattering amplitude can be obtained in a simpler way, since we only wish to\nreproduce the tree 2→ 2 scattering diagram (22) to better accuracy.\n23\nFor tree-level matching we can set Π(s) = 0. Leaving out the external spinors and\nsetting P = Mˆv + k, we obtain by expansion in the small momentum k\niy\ni\nP 2 − Mˆ2 iy\n∗ = iy\ni\n2Mˆv · k iy\n∗ + iy\ni\n2Mˆv · k ik\n2\n⊤\ni\n2Mˆv · k iy\n∗ + i\nyy∗\n4Mˆ2\n+O(δ). (48)\nThe first term on the right-hand side is accounted for by the leading-order term in LHSET\ntogether with the leading-order production (decay) vertex. The second term involves one\ninsertion of the kinetic energy correction (iD2s⊤) in (44). (For head-on collisions this term\nvanishes at tree level, because k⊤ = 0.) The third term is not reproduced by any term in\nthe Lagrangians we discussed so far. Since the intermediate unstable scalar propagator has\nbeen canceled by the expansion, we associate this term with the production-decay operator\nT =\nyy∗\n4Mˆ2\n(ψ¯c1χc2)(χ¯c2ψc1). (49)\nIt should be noted that this operator contributes at tree level contrary to the off-shell\nscattering topologies in the full theory discussed in the previous section. When we dis-\ntinguish collinear fields with collinear fluctuations from those with soft fluctuations, the\noperator discussed here appears with field content (ψ¯n−χn+)(χ¯n+ψn−), since each fermion\npair describes a configuration with invariant mass close to Mˆ2. This must be distinguished\nfrom the off-shell configurations produced in the scattering of a collinear electron fluctu-\nation off the neutrino. This scattering process is represented at tree-level by a non-local\nfour-fermion operator, but it does not contribute at tree-level to the forward scattering\namplitude in the effective theory, resulting in a NNLO contribution.\n3.3.2 Hard loop correction\nWe now turn to the one-loop matching of the coefficient function C of the production\n(decay) operator\nJ(x) = y e−iMˆvx [φvψ¯c1Wc1χc2](x) + h.c. (50)\nHere we have added the Wilson line Wc1 (see (47)) to the definition of the operator. This\ngenerates an infinite number of interaction vertices with additional n+Ac1 photons fields,\nwhich are not suppressed by powers of δ, but all have the same short-distance coefficient C\nbecause of gauge invariance [15]. The Wilson line accounts for full-theory diagrams where\na soft φ-field emits one or several c1-collinear photons and, thereby, becomes off-shell.\nIntegrating out the hard internal φ-field results in the Wilson line. At next-to-leading\norder we are only concerned with the emission of at most one collinear photon, which must\nthen couple to the external electron line attaching to the same production (decay) vertex\nfrom which the collinear photon is emitted. We also mention that in principle we should\nconsider the emission of photons collinear with the neutrino from the electron or the heavy\nscalar, which puts the electron or scalar lines off-shell. However, the effect cancels due\nto the charge-neutrality of the neutrino. It is for this reason that we do not introduce a\nc2-collinear photon field in the effective theory.\n24\nWe begin the one-loop computation of C by specifying the matching prescription. In\nthe underlying theory we compute the amputated, MS-renormalized, on-shell three-point\nfunction of an electron, neutrino and scalar field, multiplied by the LSZ residue factors, and\nexpand it to leading order in δ. The corresponding three-point function in the effective\ntheory contains one insertion of the operator y e−iMˆvx [φvψ¯c1Wc1χc2](x). Denoting this\nthree-point function by Γeff and the former by Γ, the matching equation reads√\nRψ\n√\nRχ\n√\nRφ Γ = C ̟\n−1\/2\n√\nReffψ\n√\nReffχ\n√\nReffφ Γeff (51)\nHere the various R-factors denote the ultraviolet-finite LSZ residues in the MS scheme\ngiven by the ratios of the on-shell and MS field renormalization constants. The factor\n̟−1\/2 defined in (32) appears because of the non-relativistic normalization of the field φv.\nIts origin can be understood most directly by comparing the scalar propagators in full\nand effective theory diagrams as done in (31). Note that the on-shell condition for the\nscalar line implies that its momentum satisfies P 2 = s¯ = Mˆ2 + Mˆ∆, but in a perturbative\nmatching calculation this condition must be fulfilled only to the appropriate order in α\nand δ. For the one-loop matching of C it is sufficient to put P 2 = Mˆ2.\nThe matching equation (51) is valid for any infrared regulator, but becomes particularly\nsimple in the case of dimensional regularization, where all loop diagrams in the effective\ntheory vanish on-shell. Then all the effective theory residues equal 1, Γeff equals its tree-\nlevel value and the matching equation becomes√\nRhψ\n√\nRhχ\n√\nRhφ\n√\n̟ Γh = C Γtree (52)\nThe full theory quantities must then be equal to their hard contribution in the sense of\nthe expansion by regions, and since ̟ can be expressed in terms of the short-distance\ncoefficient ∆, this equation says that we can obtain C by directly computing the hard\ncontributions in the full theory.\nThe residue Rhφ can be obtained from (35) and (39), and the residues Rhψ and Rhχ\ncan be computed in a similar way. The results are given in the Appendix. There is only\none one-loop diagram and one counterterm diagram contributing to Γ at next-to-leading\norder. Evaluating the hard part of this one-loop diagram we obtain\nΓh = iy\n\n1 + ag\n(\nMˆ2\nµ2\n)−ǫ (\n− 1\nǫ2\n− 1\nǫ\n− 2− π\n2\n12\n)\n+ δ(1)y\n\n (53)\nWe can now apply (52) to find the matching coefficient at NLO. Together with\n̟ = 1− ∆\n(1)\n2Mˆ\n+O\n(\nα2, αδ, δ2\n)\n(54)\nand the residues from the Appendix we obtain C = 1 + C(1) +O (α2), where\nC(1) = ay\n[\nlog\nMˆ2\nµ2\n− 1\n4\n− iπ\n2\n]\n+ ag\n[\n− 1\nǫ2\n+\n1\nǫ\n(\nln\nMˆ2\nµ2\n− 5\n2\n)\n− 1\n2\nln2\nMˆ2\nµ2\n+\n7\n4\nln\nMˆ2\nµ2\n− 15\n4\n− π\n2\n12\n]\n. (55)\n25\n× ×\nFigure 3: Hard contributions to the next-to-leading order amplitude. Left: Inser-\ntion of [∆(1)]2\/4 and −Mˆ∆(2). Right: Insertion of C(1), the symmetric diagram is\nunderstood.\nThe poles are infrared poles related to the factorization of hard and soft contributions. The\nfinal result for C(1) is obtained by subtracting the pole part. (In the following C(1) refers\nto this subtracted expression.) It is independent of the gauge parameter ξ as it should be,\nbecause the production (decay) operator is gauge-invariant. The double logarithm in the\ncoefficient of ag is related to the infrared divergence in Γh. The single logarithms on the\nother hand are also related to the scale dependence of the Yukawa coupling y.\n3.4 Forward scattering amplitude in the effective theory\nWe are now in the position to compute the forward scattering amplitude at next-to-leading\norder in the effective theory.\nThe first class of contributions consists of diagrams with the topology of the tree di-\nagram (22), but with corrections to the propagator and the production (decay) vertex as\nshown in Figure 3. As can be seen from (44), the relevant terms for the left diagram\nof Figure 3 are [∆(1)]2\/4 and −Mˆ∆(2). The remaining term (iDs⊤)2 does not lead to a\ncontribution at NLO. First for head-on collisions the scalar line has k⊤ = 0. Secondly, the\nphoton vertices from this term contribute only at NNLO for weak coupling g. The other\ndiagrams in this class are obtained from the hard corrections to the Wilson coefficient\nC of the production (decay) vertex. (The production and decay operator have the same\ncomplex coefficient C, and not the complex conjugates to each other, see (50).) There are\ntwo such diagrams, one of which is displayed in Figure 3. Adding up these three diagrams\nwe obtain\ni T (1)h = i T (0) ×\n[\n2C(1) − [∆\n(1)]2\n8DMˆ +\n∆(2)\n2D\n]\n(56)\nwith\nD ≡ √s− Mˆ − ∆\n(1)\n2\n. (57)\nAll these diagrams correspond to corrections due to hard loops and, thus, can be identified\nwith the factorizable corrections [10]. These corrections are separately gauge invariant\nsince so are the matching coefficients. In addition there is the contribution from the\n26\nFigure 4: Soft contributions to the next-to-leading order amplitude. A diagram\nwith a soft correction at the decay vertex is understood.\nproduction-decay operator T in (49), which contributes to i T (1)h the term\n=\niyy∗s\n8Mˆ2\n= i T (0) ×\n[\n− D\n2Mˆ\n]\n. (58)\nWe now turn to the one-loop corrections in the effective theory, which are due to soft\nor collinear photons. The loop provides a factor of α, so at NLO in a combined expansion\nin α and δ we can use the leading power soft and collinear photon vertices. We begin with\nthe soft correction. The coupling of the soft photon to the φv-field is given by the covariant\nderivative in the first term in LHSET (44), whereas the coupling to the collinear electron\ncan be obtained from the first term in LSCET (7). With dimensional infrared regularization\nthe residue factors equal 1, which leaves the diagrams shown in Figure 4. For the forward\nscattering amplitude the box diagram (third diagram in Figure 4) vanishes in Feynman\ngauge, because the photon-coupling to the collinear electron is proportional to nµ−. Thus\nthe amplitude is proportional to n2− = 0. Computing the remaining diagrams of Figure 4\nwe obtain\ni T (1)s = i T (0) × ag\n(−2D\nµ\n)−2ǫ [\n2\nǫ2\n+\n2\nǫ\n+ 4 +\n5π2\n6\n]\n. (59)\nThe final result for the soft amplitude is the above expression with the pole terms subtracted\nafter expanding the prefactor (−2D\/µ)−2ǫ. The soft part of the amplitude does not contain\nlogarithms of the hard scale as expected. We also note that the soft amplitude is gauge-\ninvariant, because it is computed with a gauge-invariant effective Lagrangian.\nThe only collinear photon correction at NLO comes from the diagram shown in Figure 5\n(and the corresponding symmetric diagram), where the collinear photon coupling at the\nproduction (decay) vertex is derived from the Wilson line in (50). However, for an on-shell\nelectron the integral is scaleless and vanishes in dimensional regularization.\nCombining (56), (58), (59) with the result for the matching coefficient C(1) in (55) we\nobtain for the forward scattering amplitude at next-to-leading order\ni T (1) = i T (0) ×\n[\nag\n(\n3 + 4 log\n−2MˆD\nMˆ2\n)(\n−1\nǫ\n+ log\n−2MˆD\nµ2\n)\n27\nFigure 5: Contributions to the next-to-leading order amplitude involving collinear\nphotons.\n+ ag\n(\n−7 log −2MˆD\nMˆ2\n− 3\n2\nlog\nMˆ2\nµ2\n− 7\n2\n+\n2π2\n3\n)\n+ ay\n(\n2 log\nMˆ2\nµ2\n− 1\n2\n− iπ\n)\n− [∆\n(1)]2\n8DMˆ +\n∆(2)\n2D −\nD\n2Mˆ\n]\n. (60)\nRather than inserting the subtracted expressions for T (1)s and C(1) we have used here the\nunsubtracted ones to display the structure of singularities. The double poles in 1\/ǫ have\ncanceled between the hard and soft corrections, but there are 1\/ǫ poles left over from T (1),\nwhich must be associated with the collinear singularity due to initial state radiation from\nthe massless electron. To verify that these singularities have the expected structure we\ncompute\n[i T (1)sing\/s] = −\nαg\n2π\n∫ 1\n0\ndx\n1\nǫ\nP (x) [i T (0)(xs)\/(xs)] (61)\nwhere i T (0)(xs) is the leading-order forward scattering amplitude given in (22), but with s\nreplaced by xs. (x is the momentum fraction of the electron in the electron.) Furthermore\nP (x) =\n2\n[1− x]+ +\n3\n2\nδ(1− x) (62)\nis the soft limit of the e → e Altarelli-Parisi splitting function, and we took into account\nthat the incoming neutrino does not radiate photons. Simplifying the splitting function\nto the soft limit is justified, because values of x not near one correspond to hard-collinear\nradiation, and this is a NNLO effect (which is part of the production-decay operator in the\nright panel of Figure 1). Similarly the x-integral could be restricted to an interval close\nto one. Equivalently, we perform the x-integration from zero to one and expand the result\naround\n√\ns = Mˆ to obtain\ni T (1)sing = i T (0) ×\n(\n−ag\nǫ\n)(\n3 + 4 log\n−2MˆD\nMˆ2\n)\n, (63)\nwhich agrees with the pole part of (60). This confirms that the cross section is finite once\nthe initial-state singularities have been factored into the electron distribution function.\n28\nSubtracting the initial-state singularities minimally according to our convention for the\nelectron distribution function, we obtain\ni T (1) = i T (0) ×\n[\nag\n(\n3 log\n−2MˆD\nν2\n+ 4 log\n−2MˆD\nMˆ2\nlog\n−2MˆD\nν2\n− 7 log −2MˆD\nMˆ2\n− 3\n2\nlog\nMˆ2\nµ2\n− 7\n2\n+\n2π2\n3\n)\n+ ay\n(\n2 log\nMˆ2\nµ2\n− 1\n2\n− iπ\n)\n− [∆\n(1)]2\n8DMˆ +\n∆(2)\n2D −\nD\n2Mˆ\n]\n(64)\nas the final result for the next-to-leading order contribution to the forward scattering\namplitude. The correction to the inclusive line shape is given by the imaginary part of\nthis expression. We have introduced the scale ν to distinguish the scale of the electron\ndistribution function from the renormalization scale in the masses and couplings. Referring\nto (25) we note that ν should be taken of order Mˆδ to make the initial-state collinear\nlogarithms small.\nWe performed several further checks of this result. First we find that the logarithms\nof µ cancel the scale dependence of Mˆ and yy∗ in i T (0) to NLO. Second we expand\n1\/s × Im (T (0) + T (1)) to order α2 and compare this to the expansion of the fixed-order\ncross section (25) to order α2\/δ. The two expansions coincide in the terms α2\/δ2, α2\/δ,\nwhich they have in common. Finally, we have also computed the δ expansion of the one-\nloop forward scattering amplitude directly in the full theory. This checks all the terms in\n(64) except for those involving ∆(2) and [∆(1)]2, which come from two-loop diagrams in the\nfull theory.\nThe final result (64) is given in the MS scheme. We briefly discuss how to translate this\nresult to the pole renormalization scheme, where the mass M is defined by s¯ = M2− iMΓ\nand the residue of the renormalized φ-propagator is Rφ = 1. All other renormalization\nconventions remain unchanged. From the definition of ∆ in (28) we obtain in the pole\nscheme Re∆p = 0 and\nIm\n∆p\nM\n=\nIm (∆\/Mˆ)\n1 + Re (∆\/Mˆ)\n(65)\nwith ∆ and Mˆ referring to the MS (or, in fact, any other) scheme. Using (42), (43) we\nobtain\n∆(1)p\nM\n= −2 iπay, (66)\n∆(2)p\nM\n= iπa2y\n(\n−6 lnM\n2\nµ2\n+ 5\n)\n+ iπagay\n(\n6 ln\nM2\nµ2\n− 27 + 8π\n2\n3\n)\n. (67)\nTo convert the matching coefficient C to the pole scheme, we observe that RφZφ is scheme-\nindependent, so the only modification comes from the normalization factor ̟, resulting\nin\nCp =\n(\n̟p\n̟\n)1\/2\nC, 2C(1)p = 2C\n(1) +\nRe∆(1)\n2Mˆ\n. (68)\n29\nThis is exactly what is needed to render the line shape scheme-independent to leading\norder in δ and to all orders in α. Using (65) and (68) together with M2 = Mˆ2 + Mˆ Re∆\nwe find C2p\/M = C\n2\/Mˆ , so\nC2p\nM\n(√\ns−\n√\nM2 +M∆p\n) = C2\nMˆ\n(√\ns−\n√\nMˆ2 + Mˆ∆\n) (69)\nexactly.\n3.5 Next-to-leading order line shape\nWe compute the line shape at NLO in the MS renormalization scheme by taking the\nimaginary part of (T (0) + T (1))\/s. The result depends on the renormalization scale µ and\nrather strongly on the collinear factorization scale ν. This dependence would be canceled\n(up to the order at which we perform the calculation), if we folded our cross section with\nthe electron distribution function. Since this is well understood and we are interested\nin displaying the next-to-leading order effects intrinsic to the line-shape calculation, we\npresent the partonic cross section, and adopt µ = M and ν = |2D| unless otherwise stated,\nsince this choice makes the collinear logarithms unimportant.\nIn order to illustrate the numerics we use ag = 0.1\/(4π), ay = 0.1\/(4π) and aλ =\n(0.1)2\/(4π)2 and assume the pole mass M = 100 GeV. For the plots in the MS scheme we\nhave to convert the pole mass to the MS mass Mˆ . At LO we use the one-loop relation\nbetween the pole mass and Mˆ and obtain Mˆ = 98.8 GeV, whereas at NLO we use the\ntwo-loop relation and get Mˆ = 99.1 GeV. The LO line shape has already been shown in\nFigure 2. In Figure 6 (upper panel) we show the LO and the NLO line shape in the MS\nscheme (solid curves) and the pole scheme (dashed curves). The scheme dependence is\nvery small, but the next-to-leading order correction is around −10% near the peak, and\ncan be up to −30% for center-of-mass energies between 95 GeV and 105 GeV . The ratio\nof NLO to LO is shown as the solid line in the lower panel of the figure.\nContrary to the LO line-shape the NLO line shape does not any longer have an exact\n(non-relativistic) Breit-Wigner shape. Performing a fit of the NLO line shape (MS scheme)\nto a Breit-Wigner curve in the range 95 ≤ √s ≤ 105 GeV we find deviations up to\n15%. The ratio of the NLO curve to the Breit-Wigner fit is shown in as dashed line\nin Figure 6. Moreover, the output mass parameter of the Breit-Wigner fit differs from\nthe input M = 100GeV by −160MeV. This illustrates that in realistic situations the\ndata should be fitted to the theoretically predicted shape rather than a Breit-Wigner-type\nansatz.\nUp to now we have performed a strict expansion in the couplings and δ to obtain the\nNLO result. In particular, we only included ∆(1) in the propagator and treated the terms\n∆(2) as well as higher powers of ∆(1) as interactions in a perturbative expansion. In other\nwords, we used i\/(2MˆD) for the propagator of the unstable field. A slightly different\napproach is to include the effect of higher-order bilinear terms in the Lagrangian into the\npropagator, which sums these terms to all orders. This can be done in different versions.\n30\n96 98 100 102 104\n0.0002\n0.0004\n0.0006\n0.0008\n0.001\n0.0012\n0.0014\n96 98 100 102 104\n0.7\n0.8\n0.9\n1\n1.1\nFigure 6: Upper panel: line shape (in GeV−2) in the MS scheme (solid) and\npole scheme (dashed) at LO (upper magenta\/light grey curves) and NLO (lower\nblue\/dark grey curves) as a function of the center-of-mass energy in GeV. Lower\npanel: The ratio of the NLO to the LO line shape in the MS scheme (solid blue\/dark\ngrey curve) and the ratio of the NLO MS line shape to a Breit-Wigner fit (dashed\nmagenta\/light grey curve).\nFor example, instead of ∆(1) we may use the full ∆. At NLO, this implies using the\npropagator\ni\n2Mˆ(D −∆(2)\/2) (70)\nwhich absorbs the interaction term ∆(2)\/2D and sums all powers of ∆(2) in the forward\nscattering amplitude. The difference to the non-summed line shape is of course a NNLO ef-\nfect. The ratio of summed to non-summed line shape at NLO is shown as the dashed curves\nin Figure 7 in the MS scheme (blue\/dark grey line) and the pole scheme (magenta\/light\ngrey line). In computing the resummed line shape we have adapted the factorization scale\nand used ν = |2D − ∆(2)|. It can be seen from Figure 7 that the effect of resummation\n31\n96 98 100 102 104\n0.98\n0.99\n1\n1.01\n1.02\n√\ns [GeV]\nσNLOres\nσNLO\nFigure 7: The ratio of the line shape with powers of ∆(2) (and ∆(1)) resummed over\nthe non-summed line shape in the pole (magenta\/light grey lines) and MS scheme\n(blue\/dark grey lines). The dashed curves represent the line shape including ∆(2)\nin the propagator. Resumming also all powers of ∆(1) results in the solid curves.\nis less than 2%, which indicates that the higher-order terms associated with ∆(2) are not\nlarge. The effect is still smaller in the pole scheme.\nWe can go one step further and also resum all terms associated with the expansion of ∆.\nIn order to achieve this we have to recall that we obtained the propagator by expanding\nvk = −Mˆ +\n√\nMˆ2 + Mˆ∆− k2⊤ in ∆ and k⊤ (see (29)). Expanding only k2⊤ we obtain the\nsummed propagator, which at NLO reads\ni\n2Mˆ(\n√\ns−\n√\nMˆ2 + Mˆ(∆(1) +∆(2)))\n. (71)\nThis also absorbs the interaction term −[∆(1)]2\/8MD into the propagator. The ratio of\ncorresponding summed to non-summed line shape at NLO is shown as the solid curves in\nFigure 7 in the MS scheme (blue\/dark grey line) and the pole scheme (magenta\/light grey\nline). (The factorization scale has been adapted to ν = 2|(√s−\n√\nM2 +M(∆(1) +∆(2)))|.)\nAgain the effect of resummation is marginal compared to the size of the NLO correction.\n4 Beyond NLO\nA crucial aspect of our formalism is that it allows to improve the accuracy of the calculations\nby including systematically higher-order corrections. After the explicit calculation of the\nline shape at NLO, we now discuss how to go beyond NLO. We will outline the necessary\ncalculations to obtain the line shape at NNLO in the effective theory approach. Then\nwe compute explicitly a subset of corrections to illustrate once more how the formalism\nautomatically maintains gauge invariance of the calculation.\n32\n4.1 Elements of the NNLO calculation\nSince we perform a double expansion in α and δ, the NNLO computation must include all\nterms suppressed with respect to the LO result by either α2, δ2 or αδ. In order to facilitate\nthe classification of terms we also distinguish between radiative corrections due to hard (h),\ncollinear (c), and soft (s) loops, denoting the coupling α with the corresponding subscript.\nFor example, a two-loop matrix element correction in the effective theory with no further\nsuppression by δ will be denoted as α2s, if both loops are soft, and if the vertices do not\ninclude hard corrections. With this in mind we proceed to the discussion of various NNLO\ncontributions.\n1) Tree amplitude in the effective theory with insertions of LO operators in δ, matched to\nNNLO (α2h)\nThe effective theory diagrams are the same as in Figure 3, but now the propagator and hard\nvertex corrections must be included to higher accuracy in α. This implies the computation\nof ∆(3), which, from (28) and (34), can be seen to involve Π(3,0), the three-loop self-energy\nat P 2 = Mˆ2, as the most difficult part. In addition, the two-loop hard correction C(2) to\nthe production (decay) vertex φvψ¯c1χc2 is required. These are standard loop calculations,\nwhich are difficult, but not impossible with present Feynman diagram technologies. Both\nmatching coefficients, ∆(3) and C(2), are gauge invariant.\n2) Tree amplitude in the effective theory with insertions of NLO operators in δ, matched\nto NLO (αhδ)\nThe number of possible terms of this type is limited by the requirement that they con-\ntribute to the tree 2 → 2 scattering amplitude in the effective theory. NLO operators\ncan be constructed from the LO operators by acting on soft and collinear fields with extra\nderivatives. The Wilson coefficients of these operators then have to be matched up to NLO.\nOperators with bilinear terms in the fields require no work, since they are determined by\nthe dispersion relation for the free field. Operators generated by adding derivatives to the\nLO production (decay) operator can be eliminated by the equation of motions or do not\ncontribute at tree level for external states with vanishing transverse momentum.\nThis leaves genuine NLO operators. An example is the four-fermion production-decay\noperator (49),\nyy∗\n4Mˆ2\n(ψ¯c1χc2)(χ¯c2ψc1),\nthat we encountered already in the computation of the NLO scattering amplitude. At\nNNLO we therefore need the hard radiative correction to the coefficient function. The\ncorresponding calculation is done explicitly in the subsequent subsection. In general, pro-\nduction (decay) operators need not be local. Consider a collinear electron fluctuation with\nmomentum Mˆn−\/2 + k1 (where n+k1 is of order Mˆ for a collinear fluctuation) scattering\non the neutrino with momentum Mˆn+\/2 + k2, where k2 is small. In this case, the scalar\n33\npropagator is i\/(Mˆn+k1), which is far off-shell but does not correspond to a local inter-\naction vertex. However, as discussed before, these non-local operators do not have tree\nmatrix elements with the external collinear modes in 2→ 2 scattering.\nFinally, there is a one-loop correction to the four-fermion production-decay operator\nthat arises indirectly. Loop corrections induce an effective soft photon-neutrino coupling\ngay\nMˆ2\n(χ¯c2γνχc2) ∂µF\nµν\ns (72)\nAlthough this operator scales as gαyδ\n4, which is gαyδ\n2 suppressed relative to the neutrino\nkinetic term, it contributes to the NNLO forward scattering amplitude through soft-photon\nexchange in the t-channel, because the soft photon propagator cancels the δ2 suppression.\nThis can be seen directly by converting (72) to the four-fermion operator using the soft\nphoton equation of motion. In the following subsection we compute the coefficient function\nand discuss how this operator contributes to the tree scattering amplitude in the effective\ntheory. There exists also a similar electron-photon coupling. However, in this case there is\nno tree scattering diagram due to the absence of a tree-level neutrino-photon coupling.\n3) Tree amplitude in the effective theory with insertions of NNLO operators in δ, matched\nto LO (δ2)\nThe task of writing down all relevant δ2 suppressed operators is simplified by the fact that\nwe do not consider further suppressions by α. Hence we only need to expand the tree\n2 → 2 scattering diagram in the underlying theory one order further than in (48). We\nthen find the NNLO production (decay) vertex ψ¯c1χc2(iDs⊤)\n2φv (which in fact gives no\ncontribution in the center-of-mass frame of the collision, where k⊤ = 0), and the NNLO\nproduction-decay operator\n− yy\n∗\n8Mˆ3\n(ψ¯c1χc2) ivDs (χ¯c2ψc1), (73)\nwhich produces a correction proportional to (\n√\ns− Mˆ)\/Mˆ3 to the line shape.\n4) One-loop amplitude in the effective theory with insertions of LO operators in δ, matched\nto NLO (αsαh, αcαh)\nThe one-loop scattering diagrams are those shown in Figure 4, however, now there is an\nadditional insertion of [∆(1)]2\/4 or −Mˆ∆(2) into the scalar propagator, or the production\n(decay) vertex is taken at NLO, involving the correction C(1), similar to the tree diagrams in\nFigure 3. These terms can be obtained from the calculation in the previous section without\nfurther work. We simply multiply (59) by C2, interpret D as√s−(Mˆ2+Mˆ(∆(1)+∆(2)))1\/2,\nexpand in α and δ and pick out the NNLO terms. Note that in the underlying theory\nthe two-loop diagrams corresponding to these contributions involve soft and hard loops,\nhence in the conventional terminology these are neither purely factorizable nor purely\nnon-factorizable corrections. Nevertheless, the effective theory formalism guarantees that\n34\nsc\nFigure 8: Contribution to the next-to-next-to-leading order amplitude involving\ncollinear (and soft) photons.\nthis set of terms is gauge-independent. Since the collinear one-loop contribution shown in\nFigure 5 vanishes, it follows that there are no terms proportional to αcαh.\n5) One-loop amplitude in the effective theory with insertions of NLO operators in δ, matched\nto LO (αsδ, αcδ)\nWe have already discussed possible NLO operators in the category 2), but some of the\nsimplifications based on the properties of the external momenta of the tree amplitude in\nthe effective theory no longer apply to the one-loop amplitude. For instance, the residual\nmomentum k⊤ of the internal scalar line no longer vanishes, and a non-zero contribution\nfrom the insertion of (iDs⊤)\n2 into the scalar propagator is obtained. In principle one may\nalso need new production (decay) operators with collinear or soft photon fields in addition\nto the basic structure φvψ¯c1χc2. The problem of deriving the operators at tree-level is\nvery similar to deriving the power-suppressed heavy-to-light decay current in soft-collinear\neffective theory [16]. Since the collinear one-loop diagrams vanish, the interesting operators\nare those with a soft photon field, but it turns out that after applying the field equations,\nthere is no gauge-invariant operator of this sort. It follows that the set of possible NNLO\nterms is again rather limited. One αsδ term that appears is the soft one-loop correction to\nthe local four-fermion interaction shown in (58).\n6) Two-loop amplitude in the effective theory with insertions of LO operators in δ, matched\nto LO (α2s, αsαc, α\n2\nc)\nThe final set of terms involves a two-loop calculation of the forward scattering amplitude\nin the effective theory, including vertex- and box-type corrections. However, since the\npropagators and vertices of the leading-order effective Lagrangian are much simpler than\nthose in the underlying theory, the two-loop calculation is also greatly simplified. It is\nworth noting that in this calculation there appear for the first time non-vanishing collinear\nloop integrals. A representative diagram is shown in Figure 8. The requirement is that the\nexternal electron first emits a soft photon, so that the subsequent collinear emission occurs\nfrom an off-shell line. The collinear loop integral is then no longer scaleless. Because of\nthis requirement, however, there are no contributions where both loops are collinear.\n35\nThis concludes the classification of terms. It is evident that a NNLO calculation of\nthe line shape can be performed in the effective field theory approach without conceptual\ndifficulties. In fact, the previous discussion shows that the most difficult calculations are\nreduced to standard calculations of a hard two-loop vertex correction and the on-shell three-\nloop self-energy. In particular, the difficulty of maintaining gauge invariance is absent in\nthis approach. Since the separation of terms by momentum scales is gauge-independent,\nthe sum of all contributions with a given power of δ, αh, αc, and αs is separately gauge-\nindependent.\nIn the version of the effective theory where collinear fluctuations are integrated out, the\ncollinear loop contributions move from the effective theory matrix element to a matching\ncorrection. The calculations to be performed remain of course the same, but the structure\nof operators is different, since the effective theory no longer contains fields for collinear\nfluctuations. While this simplifies the field content of possible operators, it also complicates\ntheir structure, introducing new non-localities related to the fact that one component of\ncollinear momentum is of the same order as the soft momentum. There is again a close\nanalogy with recent developments in soft-collinear effective theory, which, however, we do\nnot pursue further here.\n4.2 One-loop matching of the production-decay operator\nIn this subsection we perform an explicit calculation of the αhδ contributions to the forward\nscattering amplitude categorized under 2) above.\n4.2.1 Four-fermion operator\nThe four-fermion operator (49) is a sub-leading operator that gives rise to a production-\ndecay vertex. It contributes to the forward scattering amplitude at NLO through the tree\ndiagram (58). We now determine the loop correction to the coefficient function of this\nvertex.\nConsider the box diagram contribution to the scattering amplitude in the full theory\nshown in Figure 9. It is clear that the hard part of this diagram results in a loop correction\nto a local four-fermion operator. This contribution alone is gauge-dependent. However,\nthere are additional contributions from vertex and self-energy corrections (also shown in\nFigure 9), since expanding the corresponding subgraphs in δ results in terms where the\npropagators of the unstable scalar are canceled. Because of this cancellation these terms\nalso contribute to the coefficient of the local four-fermion operator, rendering the complete\nresult gauge-independent.\nTo see this, consider first the terms proportional to αyαg in Figure 9. Due to the\ntwo scalar propagators, the leading contribution from the self-energy diagram is of order\nα2\/δ2. This is a LO contribution, which is already included in the effective theory through\nthe propagator i\/(2Mˆ(vk) − Mˆ∆(1)) of the scalar field. The next term in the expansion\nin δ cancels one propagator, resulting in a local vertex. This is already included in the\ncomputation of the matching coefficient C(1). The second term in the expansion in δ,\n36\nFigure 9: Diagrams in the full theory proportional to αyαg, whose hard part con-\ntributes to the matching coefficient of the production-decay vertex at NLO. A dia-\ngram with a vertex correction at the decay vertex is understood.\nhowever, results in a NNLO contribution, which has to be reproduced by the effective\ntheory via the matching coefficient of the production-decay vertex. Similarly, the leading\ncontribution from the vertex diagram is included in C(1), and we need the next term\nin the expansion in δ, where the scalar propagator is canceled. We then obtain for the\ncontribution from the self-energy, vertex and box diagrams\nB(2)se = i|y|2\n[u¯(p)v(q)] [v¯(q)u(p)]\nMˆ2\nΠ(1,2)\n=\ni|y|2ag\nMˆ2\n[u¯(p)v(q)] [v¯(q)u(p)]\n(\n−3− ξ\n2 ǫ\n+\n3− ξ\n2\nln\nMˆ2\nµ2\n+ (1− ξ)\n)\n, (74)\nB(2)v =\ni|y|2ag\nMˆ2\n[u¯(p)v(q)] [v¯(q)u(p)]\n(\n− 2\nǫ2\n+\n2− ξ\nǫ\n+\n2\nǫ\nln\nMˆ2\nµ2\n− (2− ξ) ln Mˆ\n2\nµ2\n− ln2 Mˆ\n2\nµ2\n− 2(4− ξ)− π\n2\n6\n)\n, (75)\nB\n(2)\nb =\ni|y|2ag\nMˆ2\n[u¯(p)v(q)] [v¯(q)u(p)]\n(\n−1− ξ\n2ǫ\n+\n1− ξ\n2\nln\nMˆ2\nµ2\n+ (1− ξ)\n)\n+\ni|y|2ag\nMˆ2\n[u¯(p)γµγνv(q)] [v¯(q)γνγµu(p)]\n(\n− 1\n2ǫ\n+\n1\n2\nln\nMˆ2\nµ2\n− 3\n2\n)\n. (76)\nSumming (74), (75) and (76) we see that the gauge dependence cancels, and we obtain\niB1\nMˆ2\n[u¯(p)v(q)] [v¯(q)u(p)] +\niB2\nMˆ2\n[u¯(p)γµγνv(q)] [v¯(q)γνγµu(p)] (77)\nwith\nB1 = −|y|2ag\n(\n2\nǫ2\n− 2\nǫ\nln\nMˆ2\nµ2\n+ ln2\nMˆ2\nµ2\n+ 6 +\nπ2\n6\n)\n,\nB2 = −|y|2ag\n(\n1\n2ǫ\n− 1\n2\nln\nMˆ2\nµ2\n+\n3\n2\n)\n. (78)\n37\nFigure 10: Diagrams in the full theory proportional to α2y, whose hard part con-\ntributes to the matching coefficient of the production-decay vertex at NLO.\nThe cancellation of the gauge dependence is of course not accidental. Since the separation\nof hard and soft parts is gauge-invariant, and since we match S-matrix elements, the\nshort-distance coefficient must be gauge-independent.\nThere are further contributions to the matching coefficient. First, the terms propor-\ntional to α2y from the diagrams shown in Figure 10 are given by\niB3\nMˆ2\n[u¯(p)v(q)] [v¯(q)u(p)] +\niB4\nMˆ2\n[u¯(p)q\/u(p)] [v¯(q)p\/v(q)] +\niB5\nMˆ2\n[u¯(p)γµu(p)] [v¯(q)γµv(q)] (79)\nwith\nB3 = −|y|2ay, B4 = −|y|2ay\n(\n−5 + π\n2\n2\n)\n, B5 = −|y|2ay\n(\n1− π\n2\n12\n)\n. (80)\nSecond, up to now we have been discussing contributions which (with the exception of\nthe box diagrams) come from expanding the one-particle irreducible self-energy or vertex\nsubgraphs in δ. Additional contributions arise from the expansion of the one-particle\nreducible scalar propagator according to (48). For instance, combining the local NLO\nterm from (48) with the (renormalized) hard vertex at leading order in δ, we obtain a\ncontribution to the coefficient of the four-fermion operator proportional to C(1). Similar\nterms come from the self-energy diagram. Collecting all contributions, we obtain for the\nNLO correction to the production-decay operator (49)\nT (1) = −|y|\n2\nMˆ2\n(ψ¯c1χc2)(χ¯c2ψc1)\n[\nay + ag\n(\n2\nǫ2\n− 2\nǫ\nln\nMˆ2\nµ2\n+ ln2\nMˆ2\nµ2\n+\nπ2\n6\n+ 6\n)\n−C\n(1)\n2\n+\n∆(1)\n16Mˆ\n]\n−|y|\n2\nMˆ2\n(ψ¯c1γνγµχc2) (χ¯c2γ\nµγνψc1) ag\n(\n1\n2ǫ\n− 1\n2\nln\nMˆ2\nµ2\n+\n3\n2\n)\n−|y|\n2\nMˆ2\n(\nψ¯c1\nn\/+\n2\nψc1\n)(\nχ¯c2\nn\/−\n2\nχc2\n)\nay\n(\n−5 + π\n2\n2\n)\n−|y|\n2\nMˆ2\n(ψ¯c1γ\nµψc1) (χ¯c2γµχc2) ay\n(\n1− π\n2\n12\n)\n, (81)\n38\nFigure 11: NNLO forward scattering diagrams in the full theory with a soft pho-\nton exchanged in the t-channel. The hard contribution to the triangle subgraph\ngenerates the effective photon-neutrino coupling (χ¯χ)∂F .\nwith ∆(1)\/Mˆ and C(1) given in (42) and (55), respectively. Inserting the explicit expres-\nsions for these quantities, the poles in ǫ do not cancel. The left-over poles are related to\nthe factorization of hard, collinear and soft contributions, and the initial-state collinear\nsingularity, and are canceled only once all other NNLO contributions to the scattering\namplitude are combined. The final result for the matching coefficient is obtained from the\nabove expression with all poles subtracted minimally.\nWe expressed (81) in terms of four-fermion operators with four Dirac structures as they\ncome out of the calculation. Not all of them are independent. Using Fierz transformations\nand the projection properties n\/−ψc1 = n\/+χc2 = 0 of the collinear fermion fields, they can\nbe reduced to linear combinations of the three basis operators\n(ψ¯c1χc2)(χ¯c2ψc1), (ψ¯c1γ5χc2)(χ¯c2γ5ψc1), (ψ¯c1γµ⊥χc2)(χ¯c2γ\nµ⊥ψc1), (82)\nwhere “µ⊥” means that one sums only over the transverse components. To perform this\nreduction, it is necessary to define carefully the Dirac algebra in d dimensions in very much\nthe same way as in applications of the weak effective Hamiltonian to weak interaction\nprocesses at low energies.\n4.2.2 Effective photon-neutrino coupling\nThere is a second correction of order αhδ, which we discuss separately, although it can be\ninterpreted as a further contribution to (81). Consider the two diagrams in the full theory\ndisplayed in Figure 11, which do not involve resonant scalar lines. The hard contribution\nto the triangle subgraphs (consisting of scalar and electron lines) induces an effective soft-\nphoton neutrino coupling. The result of the calculation gives\ngay\nMˆ2\n(χ¯c2γνχc2) ∂µF\nµν\ns\n[\n1\n3ǫ\n− 1\n3\nln\nMˆ2\nµ2\n+\n1\n2\n]\n. (83)\nIn Figure 11 the photon must be soft, because we consider the forward scattering amplitude.\n(In fact, to regulate the otherwise divergent t-channel propagator, we must temporarily\nconsider the amplitude slightly non-forward.) Power counting shows that this is a δ2\nsuppressed operator. The factor of δ2 is compensated by the t-channel photon propagator\n39\nFigure 12: Effective theory tree diagrams related to the full theory diagrams in\nFigure 11. The left-hand diagram involves the (χ¯χ)∂F coupling, the right-hand\ndiagram the mixed collinear-soft four-fermion operator and a soft electron loop.\nof order 1\/δ2, the result being an αgαy (NNLO) contribution to the scattering amplitude in\nthe effective theory shown as the left-hand diagram of Figure 12. The photon propagator\nis canceled by a momentum factor from the vertex (83) resulting in a local contribution to\nthe scattering amplitude of the same form as (81). This can be seen explicitly using the\nsoft photon equation of motion ∂µF\nµν\ns = −g ψ¯c1γνψc1+ . . . to rewrite (83) as a four-fermion\noperator times a coefficient proportional to |y|2ag.\nThe 1\/ǫ pole in (83) is a soft divergence, which arises due to the hard-soft factorization\nfrom the second diagram in Figure 11. The divergence cancels with the soft contribution\nto this diagram, where the two internal electron lines are soft, and the scalar line is off-\nshell. The off-shell scalar induces a local (χ¯c2ψs)(ψ¯sχc2) vertex. This mixed collinear-\nsoft four-fermion operator contributes to the forward scattering amplitude in the effective\ntheory through the one-loop diagram shown on the right-hand side of Figure 12, where the\nelectron loop is soft. Once again the δ2 suppression of the operator is compensated by the\nsoft photon propagator.\n5 Summary and outlook\nIt has been recognized for some time that the perturbative treatment of unstable particles\nis difficult, because partial summations of the perturbative expansion are necessary. These\ndifficulties originated mainly from the fact that the guiding principle for resummation was\nnot understood. In this paper we advocated the idea that effective field theory methods\nfamiliar from other applications in high-energy physics can be adapted to solve the prob-\nlem of describing systematically the production and decay of unstable particles, since the\nfundamental reason for the breakdown of weak-coupling perturbation theory is related to\nthe emergence of a second (small) momentum scale near resonance. The advantages of the\neffective theory method are:\n• It breaks the calculation into several well-defined pieces (matching calculations, ma-\ntrix element calculations), thus rendering the organization of the calculation efficient\nand transparent.\n• It provides a power-counting scheme in the small parameters (δ, couplings), which\n40\nallows for an identification of the terms relevant for achieving a prescribed accuracy\nbefore actual calculations must be done.\n• It provides a set of (Feynman) rules to compute the minimal set of terms necessary\nfor a given accuracy. Since one does not calculate “too much”, the calculation to a\ngiven order is presumably technically simpler than in any other approach.\n• Gauge invariance is automatic at every order, since the effective Lagrangian is gauge-\ninvariant.\n• It can be extended to any accuracy in the expansion in δ and in couplings at the\nexpense of performing more complicated, but well-defined calculations.\nIn this paper we explained these ideas in a toy theory restricting ourselves to a single scalar\nresonance, an abelian gauge theory, and a totally inclusive resonant scattering cross section.\nExtending the method to non-abelian gauge theories or relaxing any of the other restric-\ntions causes only technical complications. For instance, for a resonant fermion, the heavy\nscalar Lagrangian would be replaced by the familiar heavy quark effective Lagrangian. For\nresonant gauge bosons in the electroweak Standard Model in Rξ gauge with ξ not near\none, the degrees of freedom with mass ξMˆ2 are integrated out, and the effective theory\ncontains a massive vector field with three polarizations. Non-renormalizability is not an\nissue, since the effective field describes only soft fluctuations. In ’t Hooft-Feynman gauge,\nor with ξ close to one, the effective theory contains a vector field with four polarizations\nand a pseudo-Goldstone field, which cancels the effect of the scalar polarization state, so\nthat one can work again with a canonical massive vector field.\nOther obvious extensions of this work concern non-inclusive kinematics and pair pro-\nduction of unstable particles. In these cases it will be necessary to enlarge the field content\nof the effective theory. For instance, if energetic particles (jets) are detected in the fi-\nnal state, one must introduce new collinear fields corresponding to the direction of these\nparticles. It is advantageous to work with cut diagrams rather than amplitudes, so that\nthe (final-state weighted) phase-space integrals can be treated on the same footing as loop\ndiagrams in matching calculations. Similarly the extension to pair production requires the\nintroduction of two copies of what we called the HSET Lagrangian in this paper, one for\neach unstable particle with different velocity vectors. The production (decay) vertices then\ndepend on additional kinematic quantities such as the scalar product of the velocities. Pair\nproduction near threshold appears in this context as the particular case, where the two ve-\nlocities become nearly equal. The two HSET Lagrangian then merge to the non-relativistic\nLagrangian, and standard methods can be applied to deal with the potential complications\ndue to the strong Coulomb force. We are confident that effective field theory will be\nthe method of choice to address unstable particle production in these different kinematic\nsituations and plan to return to some of them in the context of concrete applications.\n41\nAcknowledgements\nWe thank M. Kalmykov for correspondence. The work of M.B. and A.C. is supported by the\nDFG Sonderforschungsbereich\/Transregio 9 “Computer-gestu¨tzte Theoretische Teilchen-\nphysik”. We also acknowledge the use of the Mathematica packages FeynCalc and FeynArts\n[22] for performing some of the loop calculations.\nAppendix\nIn this appendix we collect the renormalization factors and counterterms of the theory\ndefined by the Lagrangian (2). The counterterm Lagrangian is\nLct = δφ ∂µφ†∂µφ− δMMˆ2φ†φ+ δψψ¯i∂\/ψ + δχχ¯i∂\/χ− δA\n4\nF µνFµν\n+ δggµ\nǫψ¯A\/ψ + δ′ggµ\nǫ\n(\nφ†Aµi∂\nµφ− (i∂µφ†)Aµφ\n)\n+ δg2g\n2µ2ǫφ†AµA\nµφ\n+ δyyµ\nǫφψ¯χ+ δ∗yy\n∗µǫφ†χ¯ψ − δλ\n4\nµ2ǫ(φ†φ)2. (84)\nThe relation between bare and renormalized quantities is\nφ0 =\n√\nZφφ, δφ = Zφ − 1,\nM20 = Z\n2\nMMˆ\n2, δM = Z\n2\nMZφ − 1,\nψ0 =\n√\nZψψ, δψ = Zψ − 1,\nχ0 =\n√\nZχχ, δχ = Zχ − 1,\nA0 =\n√\nZAA, δA = ZA − 1,\nξ0 = ZAξ,\ng0 = Zggµ\nǫ, δg = ZgZψ\n√\nZA − 1,\ny0 = Zyyµ\nǫ, δy = Zy\n√\nZφ\n√\nZψ\n√\nZχ − 1,\nλ0 = (λ+∆λ)µ\n2ǫ δλ = (Z\n2\nφ − 1)λ+ Z2φ∆λ,\n(85)\nThe counterterms δ′g and δg2 are not independent, but determined by the previous ones:\nδ′g = ZgZφ\n√\nZA − 1,\nδ′g2 = Z\n2\ngZφZA − 1. (86)\nIn this paper all renormalization constants are needed at the one-loop order except for Z2M ,\nwhich must be known to two loops. In the MS scheme, and in covariant gauge with gauge\nparameter ξ, the counterterms expressed in terms of the renormalized couplings are given\nby:\nZy = 1 +\n1\nǫ\n(\n−3\n2\nag +\n3\n2\nay\n)\n42\nZg = 1 +\n1\nǫ\n(\n5\n6\nag\n)\nZφ = 1 +\n1\nǫ\n((3− ξ) ag − 2 ay)\nZψ = 1 +\n1\nǫ\n(\n−ξag − 1\n2\nay\n)\nZχ = 1 +\n1\nǫ\n(\n−1\n2\nay\n)\nZA = 1 +\n1\nǫ\n(\n−5\n3\nag\n)\nZ 2M = 1 +\n1\nǫ\n(−3 ag + 2 ay) + 1\nǫ2\n(\n8 a2g + a\n2\ny − 9 agay\n)\n+\n1\nǫ\n(\n53\n6\na2g −\n3\n2\na2y +\n5\n2\nagay + aλ\n)\n(87)\nFurthermore, we need the part of δλ that is proportional to α\n2\ny and α\n2\ng. It is given by\nδλ = −\n8α2y\nǫ\n+\n12α2g\nǫ\n. (88)\nThe ultraviolet-finite residues of the MS-renormalized propagators read:\nRφ = 1− (3− ξ) 1\nǫ\nag + ay\n(\n2 log\nMˆ2\nµ2\n− 2− 2 iπ\n)\nRψ = 1 +\nξ\nǫ\nag + ay\n(\n1\n2\nlog\nMˆ2\nµ2\n− 1\n4\n)\nRχ = 1 + ay\n(\n1\n2\nlog\nMˆ2\nµ2\n− 1\n4\n)\nRA = 1 + ag\n(\n1\n3\nlog\nMˆ2\nµ2\n+\n4\n3ǫ\n)\n(89)\nThe 1\/ǫ poles in these equations are infrared divergences. In the dimensional infrared\nregularization scheme the full residues equal their hard contributions, so RhX = RX .\n43\nReferences\n[1] D. Y. Bardin et al., “Electroweak working group report”, in Reports of the working\ngroup on precision calculations for the Z resonance, Eds. D. Bardin, W. Hollik and\nG. Passarino, (CERN-95-03, Gene`ve, 1995), [hep-ph\/9709229].\n[2] W. Beenakker, F. A. Berends and A. P. Chapovsky, Nucl. Phys. B 548 (1999) 3 [hep-\nph\/9811481];\nA. Denner, S. Dittmaier, M. Roth and D. Wackeroth, Phys. Lett. B 475 (2000) 127\n[hep-ph\/9912261];\nA. Denner, S. Dittmaier, M. Roth and D. Wackeroth, Nucl. Phys. B 587 (2000) 67\n[hep-ph\/0006307];\nS. Jadach et al., Phys. Rev. D 61 (2000) 113010 [hep-ph\/9907436].\n[3] W. Beenakker, F. A. Berends and A. P. Chapovsky, Phys. Lett. B 454 (1999) 129\n[hep-ph\/9902304];\nN. Kauer and D. Zeppenfeld, Phys. Rev. D 65 (2002) 014021 [hep-ph\/0107181];\nM. L. Nekrasov, Phys. Lett. B 545 (2002) 119 [hep-ph\/0207215].\n[4] E. N. Argyres et al., Phys. Lett. B 358 (1995) 339 [hep-ph\/9507216];\nW. Beenakker et al., Nucl. Phys. B 500 (1997) 255 [hep-ph\/9612260];\nG. Passarino, Nucl. Phys. B 574 (2000) 451 [hep-ph\/9911482].\n[5] W. Beenakker, F. A. Berends and A. P. Chapovsky, Nucl. Phys. B 573 (2000) 503\n[hep-ph\/9909472];\nW. Beenakker et al., [hep-ph\/0303105].\n[6] R. G. Stuart, Phys. Lett. B 262 (1991) 113;\nA. Aeppli, G. J. van Oldenborgh and D. Wyler, Nucl. Phys. B 428 (1994) 126 [hep-\nph\/9312212].\n[7] V. S. Fadin, V. A. Khoze and A. D. Martin, Phys. Rev. D 49 (1994) 2247;\nK. Melnikov and O. I. Yakovlev, Phys. Lett. B 324 (1994) 217 [hep-ph\/9302311].\n[8] K. Melnikov and O. I. Yakovlev, Nucl. Phys. B 471 (1996) 90 [hep-ph\/9501358];\nW. Beenakker, A. P. Chapovsky and F. A. Berends, Nucl. Phys. B 508 (1997) 17\n[hep-ph\/9707326]; Phys. Lett. B 411 (1997) 203 [hep-ph\/9706339];\nA. Denner, S. Dittmaier and M. Roth, Nucl. Phys. B 519 (1998) 39 [hep-ph\/9710521];\nPhys. Lett. B 429 (1998) 145 [hep-ph\/9803306].\n[9] F. V. Tkachov, [hep-ph\/9802307];\nF. V. Tkachov, [hep-ph\/0001220];\nM. L. Nekrasov, Eur. Phys. J. C 19 (2001) 441 [hep-ph\/0002184].\n[10] A. P. Chapovsky, V. A. Khoze, A. Signer and W. J. Stirling, Nucl. Phys. B 621 (2002)\n257 [hep-ph\/0108190].\n44\n[11] M. Beneke and V. A. Smirnov, Nucl. Phys. B522 (1998) 321 [hep-ph\/9711391];\nV. A. Smirnov, Applied Asymptotic Expansions In Momenta And Masses, Springer\nVerlag, Berlin, Germany, 2002.\n[12] M. Beneke, A.P. Chapovsky, A. Signer and G. Zanderighi, [hep-ph\/0312331].\n[13] E. Eichten and B. Hill, Phys. Lett. B234 (1990) 511;\nH. Georgi, Phys. Lett. B240 (1990) 447;\nB. Grinstein, Nucl. Phys. B339 (1990) 253.\n[14] C. W. Bauer, S. Fleming and M. E. Luke, Phys. Rev. D 63 (2001) 014006 [hep-\nph\/0005275].\n[15] C. W. Bauer, S. Fleming, D. Pirjol, and I. W. Stewart, Phys. Rev. D63 (2001) 114020\n[hep-ph\/0011336];\nC. W. Bauer, D. Pirjol, and I. W. Stewart, Phys. Rev. D65 (2002) 054022 [hep-\nph\/0109045].\n[16] M. Beneke, A. P. Chapovsky, M. Diehl and Th. Feldmann, Nucl. Phys. B 643 (2002)\n431 [hep-ph\/0206152];\nM. Beneke and Th. Feldmann, Phys. Lett. B 553 (2003) 267 [hep-ph\/0211358].\n[17] M. J. Dugan and B. Grinstein, Phys. Lett. B 255 (1991) 583.\n[18] M. J. Veltman, Physica 29 (1963) 186.\n[19] O. V. Tarasov, Nucl. Phys. B 502 (1997) 455 [hep-ph\/9703319];\nR. Mertig and R. Scharf, Comput. Phys. Commun. 111 (1998) 265 [hep-ph\/9801383].\n[20] J. Fleischer, M. Y. Kalmykov and A. V. Kotikov, Phys. Lett. B 462 (1999) 169 [hep-\nph\/9905249];\nJ. Fleischer, M. Y. Kalmykov and A. V. Kotikov, [hep-ph\/9905379];\nJ. Fleischer and M. Y. Kalmykov, Comput. Phys. Commun. 128 (2000) 531 [hep-\nph\/9907431].\n[21] A. I. Davydychev, J. Math. Phys. 32 (1991) 1052;\nE. E. Boos and A. I. Davydychev, Theor. Math. Phys. 89 (1991) 1052 [Teor. Mat.\nFiz. 89 (1991) 56].\n[22] R. Mertig, M. Bo¨hm and A. Denner, Comput. Phys. Commun. 64 (1991) 345;\nJ. Kublbeck, M. Bo¨hm and A. Denner, Comput. Phys. Commun. 60 (1990) 165.\n45\n"}