{"doi":"10.1080\/00219266.2004.9655951","coreId":"196908","oai":"oai:lra.le.ac.uk:2381\/9120","identifiers":["oai:lra.le.ac.uk:2381\/9120","10.1080\/00219266.2004.9655951"],"title":"Teaching about bioethics through authoring of websites","authors":["Willmott, Christopher J. R.","Wellens, Jane"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-12","abstract":"There is growing awareness of the need to equip students to think through the ethical implications of developments in biology. We describe an exercise in which students work in teams to produce websites about current controversial issues within the subject. Participants report a significant improvement in their knowledge of bioethics and acquisition of new generic skills. Additionally, we note not only a broadening of their consciousness about such issues, but also an increase in their use of appropriate scientific terminology. This web-authoring activity could readily be adapted for use with students in a broader range of disciplines at both tertiary and secondary level","downloadUrl":"http:\/\/www.informaworld.com\/smpp\/title~db=all~content=g931094699,","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/9120\/3\/04%20Willmott%20and%20Wellens%28realversion0404%29.pdf","pdfHashValue":"f6e244c3d6ba39f474c64fa02fd924723db868c1","publisher":"Routledge (Taylor & Francis) on behalf of the Society of Biology","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/9120<\/identifier><datestamp>\n                2016-01-08T09:43:07Z<\/datestamp><setSpec>\n                com_2381_69<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_70<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nTeaching about bioethics through authoring of websites<\/dc:title><dc:creator>\nWillmott, Christopher J. R.<\/dc:creator><dc:creator>\nWellens, Jane<\/dc:creator><dc:subject>\nEthics<\/dc:subject><dc:subject>\nWeb<\/dc:subject><dc:subject>\nBioethics<\/dc:subject><dc:subject>\nPeer review<\/dc:subject><dc:description>\nThere is growing awareness of the need to equip students to think through the ethical implications of developments in biology. We describe an exercise in which students work in teams to produce websites about current controversial issues within the subject. Participants report a significant improvement in their knowledge of bioethics and acquisition of new generic skills. Additionally, we note not only a broadening of their consciousness about such issues, but also an increase in their use of appropriate scientific terminology. This web-authoring activity could readily be adapted for use with students in a broader range of disciplines at both tertiary and secondary level.<\/dc:description><dc:date>\n2011-02-25T15:33:57Z<\/dc:date><dc:date>\n2011-02-25T15:33:57Z<\/dc:date><dc:date>\n2004-12<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nJournal of Biological Education, 2004, 39 (1), pp. 27-31<\/dc:identifier><dc:identifier>\n0021-9266<\/dc:identifier><dc:identifier>\nhttp:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/00219266.2004.9655951<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/9120<\/dc:identifier><dc:identifier>\n10.1080\/00219266.2004.9655951<\/dc:identifier><dc:identifier>\n2157-6009<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nThis is the author’s final draft of the paper published as Journal of Biological Education, 2004, 39 (1), pp. 27-31.  The final published version is available at http:\/\/www.informaworld.com\/smpp\/title~db=all~content=g931094699, Doi: 10.1080\/00219266.2004.9655951.<\/dc:rights><dc:publisher>\nRoutledge (Taylor & Francis) on behalf of the Society of Biology<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0021-9266","2157-6009","issn:0021-9266","issn:2157-6009"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":["Ethics","Web","Bioethics","Peer review"],"subject":["Article"],"fullText":"Title: Teaching about bioethics through authoring of websites \n \nChristopher J.R. Willmott1* and Jane Wellens2 \n1Department of Biochemistry and 2Teaching and Learning Unit, University of Leicester, University \nRoad, Leicester, LE1 7RH  \n \n* Corresponding author (Chris Willmott) \nTelephone: 0116 2522094\/2523471 \nFax: 0116 2523369 \nE-mail: cjrw2@le.ac.uk \n \nRunning title: teaching bioethics through web authoring \n \nKey words: ethics, web, bioethics, peer review \n \nBrief description: An evaluation of the impact of a novel exercise using web authoring to teach \nabout bioethics \n \n \n \nClassification of manuscript: “Practical paper” \nTitle: Teaching about bioethics through authoring of websites \n \n \nABSTRACT \nThere is growing awareness of the importance of equipping students with the abilities to think \nthrough the ethical implications of developments in biology.  We describe an exercise in which \nstudents work in teams to produce websites about current controversial issues within the subject.  \nParticipants report improvement in their knowledge of bioethics. Additionally, we note not only a \nbroadening of their awareness of such issues, but also an increase in their use of appropriate \nscientific terminology.  This web authoring activity could readily be adapted for use with students \nin a broader range of disciplines at both tertiary and secondary level. \n \nINTRODUCTION \nThe frequency with which bioethical stories reach the front page of both the quality and popular \nnewspapers is an indication of the increasing impact new biological and medical techniques are \nhaving upon the wider society.  Many undergraduate programmes in the biosciences have \ntraditionally neglected discussion of the wider impact and ethics of the subject.  In the UK, the \nimportance of enhancing the ethical dimension of biological education has been recognised by the \nQuality Assurance Agency (QAA), the body charged with safeguarding standards in higher \neducation.  Between 2000 and 2002, the QAA published benchmarking documentation for different \nsubject areas designed to “make explicit the general academic characteristics and standards of \nhonours degrees in the UK” (QAA, 2002).  The benchmarking statements for bioscience included \nnine recommendations pertaining to the ethics of biology.  These included the suggestion that all \nstudents should “Have some understanding of ethical issues and the impact on society of advances \nin the biosciences” and that good students should “Be able to construct reasoned arguments to \nsupport their position on the ethical and social impact of advances in the biosciences”. \n \nHere we describe an exercise in which Second Year undergraduates engage with ethical issues by \nauthoring web sites about current controversial developments.  In addition to increasing their \nawareness of the ethical dimension of their subject, students also develop a range of generic skills, \nincluding teamwork and an ability to produce web pages.. \n \nMETHODOLOGY \nDescription of activity: The exercise described below has been incorporated as an aspect of a \nSecond Year undergraduate module “Targeting Biochemical Knowledge to Medical Problems”.  \nThe module is compulsory for students on our Medical Biochemistry programme (approximately 30 \nstudents per year) and is also offered to Medical students as one of their optional Special Study \nModules, with approximately 7 students per year electing to take this course.  The learning \noutcomes of the activity are given in Table 1.  From this list it will be clear that there are \nconsciously two main goals of this task.  Firstly, there is the intention to deepen the students’ \nunderstanding of the science and ethical considerations associated with a current development in \nbiomedicine.  Secondly, a number of transferable skills are addressed, including the ability to work \nas a team, the ability to produce web pages and an important but sometimes overlooked skill, \nnamely the ability to recognise that not all of the material published on the web is equally \nauthoritative or accurate. \n \nAt the core of this exercise, the students work in teams of four or five to produce a set of web pages \non a specific bioethical topic.  They are advised that although they may draw on whatever \ninformation is available in textbooks, journals and other printed media, their primary task is to \nproduce a website that reviews other web-based materials on their specified topic (see below).  \nFurthermore, they are instructed that their pages should include a background briefing on the \nscience underlying the issue and should fairly reflect the diversity of informed ethical opinion on \nthe topic.  In addition to this, each team is required to give a short presentation about their topic to \ntheir peers and the course staff. \n \nFew of the students had any previous experience of producing web pages; only 3 out of 35 students \nin 2002 and 8 out of 37 in 2003 reported that they had any prior experience of web authoring.  We \ntherefore began with an introductory lecture and a workshop in which the participants are asked to \nproduce a mini-web of four pages.  Various design parameters were set down for this exercise, \nincluding an ability to make links to pages within their own web (relative links) and links to \nexternal pages elsewhere on the worldwide web (absolute links).  The students were also required to \nimport text and images from the briefing documents, which was therefore provided to them as an e-\nmail attachment (a copy is currently posted on the web at \nwww.le.ac.uk\/by\/cjrw2\/archive\/webtraining.doc).  Local regulations require any web pages to be \nuploaded to the University server by an authorised member of staff, and the final section of the \ntraining therefore explained how to compress a web folder in order to send it as an attachment, \nwhich was also the preferred method for the submission of final projects.  Student feedback on this \nexercise has been extremely positive (see Box 1). \n \nSelection of topics and assignment to groups: Students were not given free choice in the \nformation of teams, but were instead allocated to groups of four or five.  Although the participants \nwere not told about the criteria used, the teams were, in fact, selected to have an even distribution of \nboth gender and biochemical knowledge, as judged by their performance in a first semester module \nin Year 2.  The topics were then assigned randomly to the teams by the drawing of lots.  Given the \ncontext in which this activity is undertaken (see above), the topics offered for the projects were \nfocussed on developments in molecular and cellular biology with current or near-future relevance to \nmedical practice.  The topics offered most recently are listed in Table 2.  For students pursuing \ndifferent Biology courses, the focus could easily be switched to, for example, use of GM technology \nin plants, the rights and wrongs of species introduction, or more long-standing areas of biomedical \ncontroversy such as abortion and euthanasia.   \n \nDetails of assessed exercise: Having been organised into groups, the students were given six weeks \nto prepare a series of web pages on their assigned topic.  The teams were briefed to ensure that their \nweb reviewed at least ten other online resources relating to their topic, with the expectation that \nthey would need to have investigated a larger number in order to decide upon a ‘best ten’.  It was \nstressed that their list of reviewed sites must appropriately reflect the diversity of informed ethical \nopinion on the subject.  In other words, whilst there was no need to evaluate ‘crank’ sites, it was \nnonetheless important that as part of the exercise the students appreciated that different people \ntaking a rational and measured look at the same topic can legitimately come to different \nconclusions. \n As part of their review process, teams had to devise a suitable rating system based on criteria of \ntheir own choice.  In practice, most groups elected to assess several different features of each site, \nincluding issues such as ease of navigation, authority of content, readability and design.  In addition \nto the review component, the students’ websites were required to include adequate background \ninformation on the science behind the ethical dilemma, such that another user coming to their site \nwould be sufficiently briefed to follow the linked pages.  They were recommended to make the \ncontent suitable for their peers in teams working on other topics. \n \nThe groups were encouraged to consider the diversity of roles that individuals within their team \nwould need to play, including: researching potential sites; deciding on review criteria; reviewing \nsites; designing their site, including visual appearance and navigation; and implementation of the \ndesign.  They were also reminded that their completed sites would need to be delivered to the \nrelevant member of staff for uploading onto the University server, in good time for it to be \noperational during the final presentations.  These presentations, each fifteen minutes in length, were \nto introduce staff and peers to the ethical arguments for and against their controversial topic, \ndrawing information from their own site and linked resources, as appropriate.  \n \nAssessment of students: Students were assessed on both the production of the website and the \npresentation.  The division of marks between these two components was 66% and 34% respectively.  \nThe talks were evaluated by three members of staff and the websites by two staff.  A variety of \ncriteria were considered, including factual accuracy of content, appropriateness of reviews and \nscoring systems and the design and navigation of the students’ own website.   \n \nThe marks for the talk and the website were then combined to produce an initial team score as a \npercentage.  Given, however, that this was a team exercise and not all members will have \ncontributed equally to the process, we gave students the opportunity to assess the relative input \nmade by members of their team, including themselves.  The criteria used here were: input of ideas \n& suggestions; leadership & help in organising the work; visual design of web pages; design of \nnavigation; design of scoring system; writing of original material (e.g. introduction); \nauthoring\/entering information into computer; and final presentation (preparation & delivery).  The \npeer assessments were carried out individually, under exam conditions, to negate as far as possible \nany collusion between team members. \n \nUsing the system developed by Conway et al (1993), these peer assessments were then used to scale \nthe original staff mark for the team to produce final marks for individual students.  In essence, the \nweighting process works as follows; all members of a team rate the contribution made by \nindividuals as a score out of 5 in each of the categories outlined above.  A grand total (all scores for \nall students added together) and an individual’s total (the sum of their scores as awarded by all team \nmembers, including themselves) can then be calculated.  By dividing the grand total by the number \nof students in the team, it is possible to work out the average mark for an individual in that team.  \nDividing the individual’s total by the team average will then give a number a little over or a little \nunder one.  This is the relative contribution made by that individual to the overall team \nperformance, as judged by the team themselves.  When this figure is multiplied by the team score \nawarded by the staff, it produces the final individual mark for each student.  Feedback to the \nstudents included staff comments and suggestions regarding both the website and the presentation, \nthe team mark, the scaling factor (as described) and their final individual mark.  This mark \nrepresented 20% of their assessment mark for this module. \n \nRESULTS \nEvaluation of the exercise by students:  All participants were invited to fill in a questionnaire \nbefore and after this project.  Firstly, they were asked to rate out of a maximum of ten marks their \nknowledge about bioethics, their interest in bioethics and their interest in being able to produce \nwebsites.  A summary of these findings is given in Table 3.  Secondly, they were asked to list up to \nten “bioethics issues” of which they were aware.  The synopsis of these findings is given in Tables \n4 and 5. \n \nWhen asked at the end of the exercise how able, on a scale up to 10, they felt to produce websites, \nthe average score was 7.1 (6.8 in 2002, 7.3 in 2003).  This is an encouraging figure, since only 11 \nout of 72 students reported any prior experience of web authoring.  Additionally, the participants \nrated the usefulness of the exercise at 6.8 out of 10 (6.6 in 2002 and 7.0 in 2003) and their \nenjoyment of the task at 6.2 out of 10 (6.0 in 2002, 6.4 in 2003). No students reported a lower \nknowledge of bioethics after the exercise than they had initially, though one student scored their \nknowledge the same after the activity as they had in the a priori self-assessment.  Participants \nreported, on average, an increase of just over 40% in their perceived knowledge about bioethics (it \nis worth noting that the students did not have access to their initial questionnaires when filling in the \npost-exercise questionnaires).  The individual increases ranged from 1 to 8 out of 10. \n \nThe students’ interest in both bioethics and in web authoring increased, but not as dramatically as \nreported for their bioethics knowledge.  This is, in part, a reflection of the higher baseline scores \n(Table 3), but is also a consequence of some individuals scoring their interest lower after experience \nof bioethics and\/or web authoring than their a priori expectation.  The range of changes in interest \nin bioethics was from -4 to +5, with 11 of the 69 participants registering lower interest at the end of \nthe exercise, and a further 12 remaining unchanged.  Similarly, the changes in interest in web \nauthoring varied from -5 to +5, with 19 participants reporting less interest after the activity and the \ninterest of a further 15 remained unchanged. \n \nBioethics issues identified by participants: On average (mean), students listed 4.1 topics as \n“bioethics issues” before the exercise in 2002 and 6.6 topics afterwards.  This is very similar to the \nfigures in 2003 (3.6 topics before, 7.1 afterwards).  Closer analysis of the specific issues cited by \nthe students reveals some interesting trends (see Tables 4 and 5).  In both years, cloning was the \nmost prominent issue identified by the students in the a priori surveys.  This is reflected not only in \nthe total number of students mentioning the issue (Table 4) but also in the fact that in each year it \nwas the first topic mentioned by approximately half of the students (Table 5).  It is interesting to \nnote that the particularly high figure of 89.2% in January 2003 followed closely after the news \nreports alleging successful human cloning by the Raelian cult (see, for example, BBC 2002b).  This \nissue is of significantly lower importance to the students after the course, both in terms of the \nnumber of mentions and the reduced ranking position relative to other subjects (only 2 students in \neach year still listed cloning first in their post-exercise questionnaires).  Other issues with declining \nprominence are the most overtly medical topics such as in vitro fertilisation (IVF), euthanasia and \nabortion, and vaccination (sometimes specifically associated with the MMR vaccine offering \nprotection against Measles, Mumps and Rubella but linked in the popular media with bowel \ncomplaints and autism.  See, for example, BBC 2001a).  GM crops, another stalwart of press \ncoverage of bioethical matters, was also listed less frequently by the students after the module. \n \nAs might be expected, the most significant increases in awareness relate to the topics addressed \ndirectly in the exercise.  For example, students showed high awareness of concern relating to the \nissue of experiments involving animals before the module (the second most cited topic, after \n‘cloning’, in both a priori surveys), but this increases to over 70% of students in both cohorts after \nthe activity.  The largest single increase for an issue came in 2003 and concerned \nxenotransplantation, the use of animal-derived organs for human transplants.  A remarkable 92% of \nstudents registered this topic as one of their list, with 13 out of 38 in that cohort citing it first.  It is \nworth speculating that this particular prominence is generated by the inclusion of a humorous \nanimation in the website reviewing this topic (Mughal et al, 2003).  The level of consciousness \n(over 25%) about the possibility of using animal organs for transplant in the 2002 a priori \nquestionnaires is also noteworthy.  This survey was undertaken shortly after widespread reporting \nof the cloning of transgenic pigs as a step towards making xenotransplantation a viable route to \ntreatment (see, for example, BBC 2002a).  This topic did not rise so strikingly in the psyche of that \ncohort, for whom the issue was addressed in a guest lecture rather than via the web authoring \nexercise.   \n \nIt might have been expected, given that the ‘anthrax letters’ in the USA had received prominence a \nmatter of weeks earlier (e.g. BBC 2001b), that the 2002 students might have made greater reference \nto biological warfare in their list of issues.  It was, in fact, only mentioned by three students (8.6%) \nthat year, and by the same number (equals 8.1%) the following year. \n \nDISCUSSION \nA number of arguments can be made for the importance of including a component of ethics \neducation within contemporary biology programmes at undergraduate level, and indeed as part of \nsecondary education.  These include the ‘carrot’ of highlighting the relevance of the subject \ndiscipline to items reported in the news media, thereby showing the importance of a good grasp of \nbiology to the broader population.  Within the UK, at least, there is also the ‘stick’ of legislation to \ninclude discussion of the ethical implications of our subject within the curriculum. \n \nWe report here an exercise which offers the opportunity for students to engage with some \ncontemporary issues in bioethics, whilst at the same time developing a number of important \ntransferable skills, notably teamwork and the ability to produce web pages.  Detailed analysis of the \nimpact of the activities upon students in two successive years indicates that they perceive significant \nincreases in both their ability to author websites and in their knowledge about ethical aspects of \nbiology.  Our surveys indicate that the students do indeed demonstrate awareness of a greater \nnumber of bioethics topics after participation in the project.  Furthermore, there was a growing \nmaturity not only in the sorts of issues of which they were aware, but also in the scientific \nterminology they employed.  So, for example, we note in 2003 that a priori discussion of “designer \nbabies” and “sex selection” were replaced subsequently by discussion of “pre-implantation genetic \ndiagnosis”. \n \nThe students’ websites generally included reviews of an appropriate range of other online resources.  \nA potential fear prior to the launch of this activity that all groups would end up making links only to \nthe same handful of websites was not, ultimately, substantiated. \n \nThis exercise was successful in meeting the intended learning outcomes relating to both generic \nskills and subject knowledge.  This approach can readily be adapted to focus on review of different \nethical topics, or indeed the authoring of websites on entirely different subjects.  There also exists \nthe possibility to extend the reported activities by, for example, incorporating a requirement for \nstudents to write an essay on an issue which was not the focus of their own website, utilising in \ntheir research the relevant pages produced by a different team. \n \n \nREFERENCES \nBBC (2001a) Parents call for MMR vaccine inquiry http:\/\/news.bbc.co.uk\/1\/hi\/health\/1513108.stm \n(last accessed, 30th March 2004) \n \nBBC (2001b) FBI pursues anthrax lead http:\/\/news.bbc.co.uk\/1\/hi\/health\/1586881.stm (last \naccessed, 30th March 2004) \n \nBBC (2002a) New pig clones born http:\/\/news.bbc.co.uk\/1\/hi\/sci\/tech\/1738730.stm (last accessed, \n30th March 2004) \n \nBBC (2002b) Cloned baby claim met with doubt http:\/\/news.bbc.co.uk\/1\/hi\/health\/2608655.stm \n(last accessed, 30th March 2004) \n \nConway R., Kember D., Sivah A. and Wu M. (1993) Peer assessment of an individual's contribution \nto a group project. Assessment and Evaluation in Higher Education 18, 45-56.   \n \nMughal W., Kadatcham F., Johnston N. and Evans D. (2003) Xenotransplantation \nhttp:\/\/www.le.ac.uk\/by\/cjrw2\/archive\/xeno\/index.htm (last accessed, 30th March 2004) \n \nQAA (2002) Benchmarking academic standards \nhttp:\/\/www.qaa.ac.uk\/crntwork\/benchmark\/phase2consult.htm (last accessed, 30th March 2004).  \nThe benchmarking statement for the biosciences can be reached from that website or directly at \nhttp:\/\/www.qaa.ac.uk\/crntwork\/benchmark\/phase2\/biosciences.pdf  \n \nPenman D. and Left S. (2002) MMR Vaccine \nhttp:\/\/www.guardian.co.uk\/theissues\/article\/0,6512,772073,00.html (last accessed, 30th March \n2004) \n \n \nRECOMMENDED WEBSITES FOR FURTHER READING \nhttp:\/\/www.nuffieldbioethics.org\/home\/ \nhttp:\/\/www.bioethics-today.org  \nTable 1: Learning outcomes of the reported exercise \n \nBy the end of the activity, students should be able to: \n• Appreciate the science underlying a current controversial development in \nbiomedicine \n• Recognise the diversity of informed ethical opinion regarding the development \nof a current controversial development in biomedicine \n• Distinguish the veracity of different web-based resources \n• Use web-authoring software, such as Microsoft FrontPage \n• Work as a member of a team \n• Present their website to their peers \n \nTable 2: Ethical topics assigned to the groups as the focus of their web sites (2003) \n \nGene therapy \nGenetic patenting \nXenotransplantation+ \nGenetic Screening (including Pre-implantation Genetic Diagnosis) \nUse of human material (including foetal tissue) \nUse of animals in research and alternatives \nTherapeutic cloning and stem cell research \nClinical trials (including use of placebos)$ \nHealthcare and developing countries* \n \n+ subject of a guest lecture, not a website, in 2002 \n$ “use of placebos” in 2002 \n* “marketing and pricing of pharmaceuticals” in 2002 \n \nTable 3: Evaluation by participants (n = 69, scores out of 10) \n \nCategory Before After Change \nKnowledge about bioethics 2.5 6.6 + 4.1 \nInterest in bioethics 5.8 6.8 + 1.0 \nInterest in web authoring 6.1 6.5 + 0.4 \n \nTable 4: Topics cited by students in questionnaires as “bioethics issues” \n \nTopic 2003 \nbefore \n(n=37) \n2003 \nafter \n(n=38) \n2002 \nbefore \n(n=35) \n2002 \nafter \n(n=34) \nXenotransplantation 10.8$ 92.1 25.7 44.1 \nCloning 89.2 29.0 77.1 50.0 \nAnimal experiments\/ testing 37.8 73.7 48.6 85.3 \nUse of human tissue\/ organs 2.7 73.7 5.7 44.1 \nGene patenting 0 68.4 0 35.3 \nGenetic screening 2.7 29.0 14.3 67.7 \nGene therapy 5.4 55.3 5.7 61.8 \nStem cell therapy\/ research 16.2 47.4 8.6 47.1 \nPharmaceutical pricing\/ marketing* 0 0 0 47.1 \nClinical trials\/ Random Controlled trials# 5.4 44.7 2.9 2.9 \nPlacebos# 0 34.2 0 26.5 \nResearch\/ drug sales in third world* 0 34.2 2.9 0 \nIVF\/ test tube babies 29.7 2.6 20.0 5.9 \nGM crops 13.5 2.6 28.6 11.8 \nGenetic engineering\/ modification+ 27.0 26.3 14.3 11.4 \nEuthanasia 27.0 0 17.1 5.9 \nEmbryo\/ Foetal research 2.7 5.3 8.6 23.5 \nAbortion  18.9 7.9 11.4 8.8 \nDesigner babies\/ Sex selection\/ PGD 13.5 10.5 17.1 0 \nVaccination\/MMR 5.4 0 17.1 2.9 \n$ figures quoted as % of cohort.  Only topics cited on at least one occasion by 10% or more \nof a cohort have been included \n+ excluding specific reference to GM crops (listed separately) \n* Topic switched from “pharmaceutical marketing and pricing” in 2002 to “healthcare and \ndeveloping countries” in 2003 \n# Topic switched from “use of placebos” in 2002 to “clinical trials (inc use of placebos)” in \n2003 \n \n \nTable 5: Topics identified in first place by more than one student  \n \n2003 before 2003 after 2002 before 2002 after \nCloning (19) \nAnimal expts (5) \nEuthanasia (3) \nAbortion (2) \nDrug testing (2) \nGenetic \nEngineering\/ \nModification (2) \nXenotransplantation \n(13) \nUse of stem cells \n(5) \nGene therapy (4) \nGene patenting (3) \nAnimal expts (2) \nCloning (2) \nClinical trials (2) \nUse of human \ntissue (2) \n \nCloning (16) \nAnimal expts (4) \nGenetic \nEngineering\/ \nModification (3)  \nXenotransplantation \n(3) \nEuthanasia (2) \n \nGene therapy (7) \nAnimal expts (5) \nXenotransplantation \n(4) \nGenetic screening (5) \nGene patenting (3) \nCloning (2) \nUse of human tissue \n(2) \nRespect for religious \nviews (2) \n \nBox 1: Student feedback on the initial training exercise \n \nI have never tried any thing like this before and I could actually do it, which I didn't expect! \n \nI think this was a very useful exercise with the instructions being very clear and easy to follow. It \nhas given me more of an idea of how to go about starting this assignment because before I wouldn't \nhave had a clue as to where to start. \n \nA good introduction to creating a website. Didn't know anything about it before today! \n \nI appreciated having the intro lecture before tackling the problem on the computer! \n \nPrior to today’s 'hands on' experience, I was absolutely petrified of undertaking this exercise. I \nthought it was, for me, a little farcical (I don't really like computers and thought it'd be totally out of \nmy league!!). I have actually enjoyed this and will now enjoy the ethics webpage-making exercise.  \n \nThis was the first opportunity for me to find out how to make design a website (sic). The lecture and \nthe exercise went well together as they complimented each other. The lecture allowed the topic to \nbe introduced and gave some background about the exercise so we were not led into it \"blind.\" \n \nThis was a very helpful and fun exercise:-) \n \nI have always been interested in learning how to write websites and this session has helped me to \nget to grips with the basics that we will need in producing the website for our assessment.  I think it \nwas a very worthwhile exercise. \n \nThis exercise was VERY helpful as I normally struggle to turn the monitor on, let alone write a web \npage.  \n \nGood point about the preview and normal pages from before. I thought I had lost my first page but \nit was because I was in preview rather than normal. \n \nI didn't really know much about making a web site but after the lecture I felt fairly confident.  This \nexercise has re-enforced that well. \n \nI'd always thought that designing a web page would be a very difficult thing, but the step-by-step \ninstructions made the hole (sic) thing very painless and easy to understand. The lecture last week \nwas a great introduction to web-design, so that coming to this practical, I had some idea what I was \ndoing. Thanks v. much  A* \n \nI'm hopeless with computers (its a mutual understanding... I hate them, they hate me) but I think I \nhave actually managed to make this work! Will also find this very useful when we start doing our \nown website. \n \nThe combination of lecture and exercise worked very well as it meant I had a basis of understanding \nbefore I started.  \n \nThis was a very useful exercise because I had no idea before where to start if I wanted to design a \nweb page, but it is something that I wanted to be able to do. \n \n"}