{"doi":"10.1088\/1475-7516","coreId":"70587","oai":"oai:eprints.lancs.ac.uk:11393","identifiers":["oai:eprints.lancs.ac.uk:11393","10.1088\/1475-7516"],"title":"Cosmological constraints on unparticles as continuous mass particles.","authors":["McDonald, John"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-03-16","abstract":"We study the cosmological constraints on unparticle interactions and the temperature of the Universe for the case where unparticle states can be modelled as continuous mass particles with lifetime 1s. By considering thermal background quark decay to continuous mass scalars via a scalar operator of dimension dU, we show that the condition that the Universe is not dominated by scalars at nucleosynthesis imposes a lower bound on the scale of the interaction of the unparticle sector, with MU 20−2600 TeV for ΛU 1 TeV, 1.1 ≤ dU ≤ 2.0 and 2 ≤ dBZ ≤ 4. The existence of a long-lived scalar sector also imposes an upper bound on the temperature of the Universe during radiation-domination, which can be as low as a TeV for MU close to its lower bound","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70587.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/11393\/1\/0709.2350v2.pdf","pdfHashValue":"a1876dbf0ae37beae1c031564de13f3cfff900b4","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:11393<\/identifier><datestamp>\n      2018-01-24T00:04:03Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Cosmological constraints on unparticles as continuous mass particles.<\/dc:title><dc:creator>\n        McDonald, John<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        We study the cosmological constraints on unparticle interactions and the temperature of the Universe for the case where unparticle states can be modelled as continuous mass particles with lifetime 1s. By considering thermal background quark decay to continuous mass scalars via a scalar operator of dimension dU, we show that the condition that the Universe is not dominated by scalars at nucleosynthesis imposes a lower bound on the scale of the interaction of the unparticle sector, with MU 20−2600 TeV for ΛU 1 TeV, 1.1 ≤ dU ≤ 2.0 and 2 ≤ dBZ ≤ 4. The existence of a long-lived scalar sector also imposes an upper bound on the temperature of the Universe during radiation-domination, which can be as low as a TeV for MU close to its lower bound.<\/dc:description><dc:date>\n        2009-03-16<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1088\/1475-7516\/2009\/03\/019<\/dc:relation><dc:identifier>\n        McDonald, John (2009) Cosmological constraints on unparticles as continuous mass particles. Journal of Cosmology and Astroparticle Physics, 2009 (3). p. 19. ISSN 1475-7516<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/11393\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1088\/1475-7516\/2009\/03\/019","http:\/\/eprints.lancs.ac.uk\/11393\/"],"year":2009,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"ar\nX\niv\n:0\n70\n9.\n23\n50\nv2\n  [\nhe\np-\nph\n]  \n16\n A\npr\n 20\n08\nCosmological Constraints on Unparticles\nJohn McDonald\n1\nCosmology and Astroparticle Physics Group, University of Lancaster, Lancaster LA1 4YB, UK\nApril 16, 2008\nAbstract\nWe study the cosmological constraints on unparticle interactions and the\ntemperature of the Universe for an unparticle sector with dimensional transmu-\ntation scale ΛU\n>\n∼\n1 TeV. By considering thermal background quark decay to\nunparticles via a scalar operator of dimension dU , we show that the condition\nthat the Universe is not dominated by unparticles at nucleosynthesis imposes\na lower bound on the scale of the interaction of the unparticle sector, with\nMU\n>\n∼\n20 − 2600 TeV for 1.1 ≤ dU ≤ 2.0 and 2 ≤ dBZ ≤ 4. The existence of\nan unparticle sector also imposes an upper bound on the temperature of the\nUniverse during radiation-domination, which can be as low as a TeV for MU\nclose to its lower bound.\n1j.mcdonald@lancaster.ac.uk\n1\n1 Introduction\nRecently there has been much interest in the possible existence of a conformally-\ninvariant hidden sector consisting of ’unparticles’ [1, 2] 1; see [4-11]. In this pic-\nture, the conformally-invariant unparticle sector is generated non-perturbatively from\na Banks-Zaks (BZ) sector consisting of vector-like non-Abelian gauge fields and mass-\nless fermions [14], which are assumed to interact very weakly with the SM sector via\noperators suppressed by a mass scaleMU . The BZ sector undergoes dimensional trans-\nmutation to the unparticle phase, corresponding to a strongly self-coupled conformal\nfield theory (CFT), below an infra-red fixed point energy ΛU . This unparticle phase\nhas no particle description but interacts with the SM via unparticle operators of mass\ndimension dU , which create states made of the conformal fields. The remarkable char-\nacteristic of unparticles is that the phase space in decay processes to unparticle stuff\nis the same as the phase space for decay to dU massless particles, where dU can be\nnon-integral. This could provide a distinctive signal for unparticle production in col-\nlider experiments in the case where the unparticle description is valid at future collider\nenergies, corresponding to ΛU\n>\n∼\n1 TeV.\nThe couplings of the unparticle operators and the value of dU will depend on the\nunderlying BZ operators and the infra-red dynamics of dimensional transmutation.\nSince these are model-dependent, most studies of unparticle physics have introduced\nseveral possible unparticle operators with unknown coefficients and investigated their\nconsequences. Under reasonable assumptions regarding the unknowns, the mass scale\nMU can then be constrained by the requirement that the unparticle sector does not\nconflict with present phenomenological [4], astrophysical [5], long-range force [6] and\ncosmological [8] observations.\nHere we consider the effect of an unparticle sector on the cosmology of the SM and\nthe resulting constraints on unparticle interactions and the temperature of the Uni-\nverse. To do this we calculate the decay and annihilation rates of thermal background\nSM quarks to unparticles. For clarity, we focus on a specific interaction between SM\n1Similar ideas were proposed earlier in [3].\n1\nquarks and a scalar unparticle operator, leaving a more general operator analysis for\nfuture work.\nThe article is organised as follows. In Section 2 we review unparticles and their\ninterpretation in terms of deconstructing scalars. We also relate these scalars to a\nphysical interpretation of the unparticle states. In Section 3 we calculate the decay\nand pair annihilation rates of thermal SM quarks to unparticles and derive bounds\nfrom requiring that the unparticle energy density does not disturb nucleosynthesis. In\nSection 4 we present our conclusions.\n2 The Model\nThe unparticle model [1, 2] is based on an interaction between Banks-Zaks (BZ) fields\nand SM fields mediated by exchange of heavy particles of mass MU\n1\nMkU\nOSMOBZ . (1)\nOBZ is an operator with mass dimension dBZ made out of BZ fields. At an energy\nscales less than ΛU the BZ sector undergoes dimensional transmutation and a scale-\ninvariant unparticle sector, corresponding to a strongly self-coupled CFT, is formed.\nThe BZ operators match onto unparticle operators and Eq. (1) becomes\nCUΛ\ndBZ−dU\nU\nMkU\nOSMOU , (2)\nwhere dU is the scaling dimension of the unparticle operators OU . The value of CU\nand dU will be determined by the infra-red dynamics of the Banks-Zaks fields and the\nform of OBZ . These will be considered as free parameters in the following. To study\nhow the unparticle sector influences the cosmology of the SM, we focus on a specific\ninteraction between SM quarks and a scalar unparticle operator OU [1],\niλ\nΛdUU\nqγµ (1− γ5) q′∂µOU + h.c. . (3)\nHere λ ≡ CU(ΛU\/MU)dBZ is a dimensionless coupling.\n2\nA useful conceptual framework for understanding the unparticle sector was pre-\nsented in [9]. It was shown that by breaking scale-invariance in a controlled way,\nthe continuous energy spectrum of the unparticle sector can be replaced by a discrete\ntower of deconstructing scalar particles φn of mass Mn, with mass spacing controlled\nby a mass parameter ∆ such that M2n = n∆\n2. In this case the unparticle operator OU\nis replaced by a sum over canonically normalized deconstructing scalar fields φn,\n∞∑\nn=1\niλFn\nΛdUU\nqγµ (1− γ5) q′∂µφn + h.c. , (4)\nwhere\nF 2n =\nAdU\n2pi\n∆2(M2n)\ndU−2\nand\nAdU =\n16pi5\/2\n(2pi)2dU\nΓ (dU + 1\/2)\nΓ (dU − 1) Γ (2dU) .\nAdU is a conventionally chosen phase space factor for unparticles [1]; only the combi-\nnation CUA\n2\ndU\nappears in physical processes. In the limit ∆→ 0, the sum over decays\nq\n′ → q+φn for all kinematically allowed values of n produces an expression for dΓ\/dEq\nin agreement with the direct unparticle calculation of q\n′ → q+U based on OU [9]. The\nindividual q+φn final states of energy Eq = (m\n2\nq\n′ −M2n)\/2mq′ merge into a continuum\ndecay rate as a function of Eq as ∆→ 0, reproducing the unparticle result.\nHow should the unparticles be interpreted physically? In [10] it was observed\nthat unparticle states can be considered to be particle-like states with a continuous\nmass. (See also [11].) In the limit ∆ → 0 the deconstructing scalar will also have a\ncontinuous mass, consistent with this picture. What are these continuous mass scalars?\nThe strongly self-coupled CFT will have no conventional particle interpretation (a\ncharacteristic feature of unparticles) since the conformal field quanta are confined by\ntheir self-interaction. The unparticle states we observe, which are created by the\nunparticle operator, will then correspond to composite objects made of the strongly\nself-interacting CFT fields. These objects can have all kinematically possible masses\nand radii as a result of the scale-invariance of the underlying CFT, consistent with\nthe continuous mass states proposed in [10]. The continuous mass implies that the\n3\nunparticle sector has a large number of effective degrees of freedom, corresponding to\nthe different confined states which can be formed from the CFT fields.\nMotivated by the above interpretation, we will assume in the following that the\nunparticles are physically equivalent to continuous mass particles. Ultimately this\npicture should be confirmed by the dynamics of the underlying CFT, which will also\ndetermine the parameters of the generic unparticle model dU , CU and AdU .\n3 Cosmological constraints from quark decay and\nannihilation to unparticles\nIn the following we will consider the couplings Eq. (3) and Eq. (4) in the context of\ncosmology. In particular, we will calculate the decay and annihilation rates of thermal\nbackground quarks to unparticles to obtain the conditions under which these processes\ncan produce a significant unparticle energy density and the resulting constraints on\ncosmology.\nA basic property of the unparticle sector is that the unparticles are stable and\nno SM particles are produced by decay of the unparticle energy density [9]. This\ncan be understood by considering the deconstructing scalars in the limit ∆ → 0.\nIn this limit the couplings of the deconstructing scalars, which are proportional to\nFn ∝ ∆dU−1, tend to zero if dU > 1. The reason the decay and scattering rates\nof SM particles to unparticles is finite in the ∆ → 0 limit is that the decrease in\nthe rate to a scalar particle final state φn is compensated for by an increase in the\nnumber of kinematically allowed scalar final states ≈ E2\/∆2, where E is the energy\nthe decaying or annihilating quark. (We will demonstrate this explicitly for the case of\npair annihilation of SM quarks to deconstructing scalars.) However, if we consider the\ndecay and scattering of deconstructing scalars to SM particles, then as ∆→ 0 there is\nno compensating increase in the number of SM particles. So the rates of all processes\nwhich could result in the decay of the unparticle energy density to SM particles tend\nto zero in the unparticle limit ∆ → 0 [9]. The relative stability of the unparticle\nstates is consistent with the picture of unparticle states having a continuous mass. SM\n4\nstates can scatter into any kinematically allowed unparticle mass state, analogous to\nproduction of different hadron-like states in a confined theory, except here the hadrons\nhave continuous masses. However, in the reverse process, the unparticle states can only\nscatter into a finite number of SM states. Therefore the rate of unparticle scattering\nor decay to SM particles will generally be much smaller than the reverse process of SM\nstates scattering or decaying into unparticle final states.\nSince the unparticle sector is scale-invariant, the unparticle density evolves with\nscale factor as ρU ∝ a−4 [8]. If the unparticle density decouples from the SM density\nat TDEC ≫ TBBN ≈ 0.1 MeV, where TBBN is the temperature at Big-Bang Nucle-\nosynthesis (BBN), then a dilution of the unparticle density relative to the radiation\ndensity is possible, due to subsequent photon heating by annihilation of massive SM\nparticles. However, the maximum dilution relative to photons is only by a factor\n(g(TBBN )\/g(Tdec))\n1\/3, since the photon energy density is proportional to g(T )T 4 while\nthe unparticle density redshifts as a−4 with g(T )a3T 3 = constant. The maximum\ndilution is obtained if decoupling occurs at a higher temperature than the electroweak\nphase transition, in which case g(TDEC) = 106.75. With g(TBBN ) = 2 for photons,\nand adding the neutrino density at BBN which increases the total radiation density\nby 1.7 relative to the photon component, this gives dilution by at most a factor 0.16.\nThis is not enough to dilute the unparticle density sufficiently unless ρU < 0.4ρSM\nat TDEC , since successful nucleosynthesis requires that any additional energy density\nbe less than 6% of the total at TBBN [15]. Therefore in order that the successful\nlight element abundance predictions of BBN are unaffected, SM quark decay or pair\nannihilation to unparticles should not produce a large unparticle density.\n3.1 Quark decay to unparticles\nThe interaction Eq. (4) implies a differential decay rate to unparticles q\n′ → q + U\ngiven by [1, 9]\ndΓ\ndEq\n=\n|λ|2\n2pi2\nm2\nq\n′AdUE\n2\nq\n(\nm2\nq\n′ − 2mq′Eq\n)du−2\nΛ2dUu\n. (5)\n5\nThis is the decay rate in the q\n′\nquark rest frame. Integrating this for all energies up\nto mq′\/2 gives\nΓ =\n|λ|2\n8pi2\nAdUm\n2dU+1\nq′\ndU(d2U − 1)Λ2dUU\n. (6)\nIn the limit dU → 1 the decay rate becomes infinite, therefore dU > 1 must be imposed\n[1], in agreement with general unitarity arguments for a scalar unparticle operator [16].\nFor thermal relativistic quarks of mean energy E ≈ 3T , the decay rate Γd is obtained\nfrom the rest frame decay rate by dividing by the Lorentz factor γ = 3T\/mq′ . Therefore\nΓd ≈ |λ|\n2\n8pi2\nAdU\ndU(d2U − 1)Λ2dUU\nm2dU+2\nq\n′\n3T\n. (7)\nAt T < TEW , where TEW is the temperature of the electroweak phase transition, we\nwill assume that the Higgs expectation value is given by the T = 0 value2 < H >= v.\nAt T > TEW , we expect the effective mass of the quarks to be given by the temperature,\nmq′ ≈ T . Therefore\nΓd ≈ C\n2\nUAdU\n24pi2\nΛ\n2(dBZ−dU )\nU\ndU(d\n2\nU − 1)M2dBZu\nm\n2(dU+1)\nq′\nT\n; T < TEW (8)\nand\nΓd ≈ C\n2\nUAdU\n24pi2\nΛ\n2(dBZ−dU )\nU T\n2dU+1\ndU(d2U − 1)M2dBZu\n; T > TEW . (9)\nIn order not to produce a large unparticle energy density we must then impose that\nΓd < H , where during SM radiation-domiationH = kTT\n2\/M with kT = (pi\n2g(T )\/90)1\/2\nand M =MP l\/\n√\n8pi.\nFor T < TEW , the strongest constraint comes from the case of t quark decay. In\nthis case the condition Γd < H is strongest at the lowest value of T for which there\nare relativistic thermal t-quarks, T ≈ mt\/3, which implies that\nM2dBZU\n>\n∼\n9\n8pi2\nk1\nkT\nm2dU−1t MΛ\n2(dBZ−dU )\nU\ndU(d\n2\nU − 1)\n, (10)\n2The Higgs expectation value is temperature dependent, given by < H >= v(1 − T 2\/T 2EW )1\/2,\nwhere TEW ≈ 1.2mh [17]. For simplicity in our estimates we will use the approximation that <\nH >= 0 at T < TEW and < H >= v at T > TEW .\n6\nwhere k1 = C\n2\nUAdU . If this condition is satisfied, then for mt\/3\n<\n∼\nT < TEW there\nis no significant decay of the SM radiation in unparticles. Once T <\n∼\nmt\/3, the next\npossible decay is to b quarks, but the condition for this not to occur, which replaces\nmt by mb in Eq. (10), is automatically satisfied if Eq. (10) is satisfied\n3. On the other\nhand, if Eq. (10) is not satisfied, then as T decreases from TEW , at some T\n>\n∼\nmt\/3 the\ndecay rate becomes faster than H . The SM radiation then loses energy to unparticles,\ndecreasing T and increasing Γd relative toH (which remains constant throughout since\nthe total energy density is constant) until T <\n∼\nmt\/3. As a result, if T is larger than\nmt\/3, a large fraction of the SM radiation energy will be transferred to the unparticle\nsector, resulting in an unparticle dominated Universe.\nFor T > TEW , the condition Γd < H requires that\nT 2dU−1 <\n∼\n24pi2\nkT\nk1\ndU(d\n2\nU − 1)M2dBZu\nΛ\n2(dBZ−dU )\nU M\n. (11)\nIf this condition is not satisfied, then SM radiation will rapidly decay to unparticles\nuntil T has decreased sufficiently that the condition Γd < H is satisfied. As a result, a\nlarge fraction of the SM radiation energy will have transfered to the unparticle sector\nwhen the decay rate becomes negligible. Therefore we reach the important conclusion\nthat there is an upper bound on the temperature of the radiation-dominated universe\nin the presence of an unparticle sector. This is likely to play an important role in the\ndevelopment of a complete unparticle cosmology.\nThese conclusions are based on the idea that any process which results in energy\ntransfer will always be much more rapid from the SM to the unparticle sector than the\nreverse process. In the deconstructing scalar picture the unparticle states are stable\nwith respect to decay and annihilation via the interaction Eq. (3). However, it is\nconceivable that unparticle self-interactions, which will depend on the details of the\nunderlying CFT, could results in processes transferring energy to the SM. Nevertheless,\nthe reverse process from SM to unparticles will always be much more rapid due to the\nlarge number of unparticle final states, parameterised by their continuous mass. It is\n3Decay to other light quarks is also possible, but these decays will be subdominant due to the\nquark mass factor in Eq. (10).\n7\nimportant to emphasize that our conclusions do not depend on thermal equilibrium of\nthe unparticle sector, nor do they require a large number of degrees of freedom in the\nunderlying CFT as in the case of cooling into large N CFTs [18]. The rapid transfer\nof energy is due to the continuous mass nature of the unparticle states formed by the\nstrongly-coupled CFT, which follows from the scale-invariance of the CFT.\n3.2 Quark pair annihilation to unparticles\nWe next consider the annihilation of thermal quark pairs to unparticles, by calculating\nthe scattering cross-section to deconstructing scalars in the ∆ → 0 limit. The CM\nannihilation cross-section q + q → φm + φn following from Eq. (4) is given by\nσmn ≈ g\n2\nmg\n2\nnE\n2\nM4s\n, (12)\nwhere E is the energy of the annihilating quarks,\ng2n =\n|λ|2\nn(2−dU )\nand\nM2s =\n2pi\nAdU\n(\nΛU\n∆\n)2dU\n∆2 .\n(In this we have written the coupling for each n in Eq. (4) as gn\/Ms.) The total\nscattering rate to deconstructing scalars is obtained by summing over the kinematically\nallowed final states. With quark energy E, the final state scalars have nmax = E\n2\/∆2,\ntherefore\nσTOT =\nnmax∑\nn=1\nmmax∑\nm=1\nσmn . (13)\nFor nmax ≫ 1 we can replace the sums with integrals,\nnmax∑\nn=1\ng2n ≈\n∫ E2\/∆2\n1\ng2ndn ≡\n∫ E2\/∆2\n1\n|λ|2\nn(2−dU )\ndn . (14)\nTherefore\nnmax∑\nn=1\ng2n ≈\n|λ|2\n(dU − 1)\n[(\nE\n∆\n)2(dU−1)\n− 1\n]\n. (15)\n8\nThus summing over m and n is Eq. (13) gives\nσTOT ≈ E\n2\nM4s\n|λ|4\n(dU − 1)2\n[(\nE\n∆\n)2(dU−1)\n− 1\n]2\n. (16)\nReplacing M2s by its definition then gives\nσTOT ≈ |λ|\n4E2\n(dU − 1)2\n[(\nE\n∆\n)2(dU−1)\n− 1\n]2\nA2dU∆\n4(dU−1)\n(2pi)2Λ4dUU\n. (17)\nIn the case dU > 1, in the unparticle limit ∆ → 0 the cross-section tends to a finite\nlimit\nσTOT ≈ |λ|\n4\n(dU − 1)2\nA2dUE\n4dU−2\n(2pi)2Λ4dUU\n. (18)\nIn the case dU ≤ 1, σTOT →∞ as ∆→ 0. Therefore, as in the case of the quark decay\nrate, the quark annihilation rate is singular as dU → 1.\nFor dU > 1 the annihilation rate is then Γann = nqσTOT , where nq = 12T\n3\/pi2 is\nthe number density of thermal quarks q. Therefore, with E ≈ 3T ,\nΓann ≈ 1\n9pi4\nC4UA\n2\ndU\n(dU − 1)2\n(3T )4dU+1\nΛ4dUU\n. (19)\nIn most cases this rate is small compared with the quark decay rate. However, for dU\nsufficiently close to 1, the annihilation rate (∝ (dU −1)−2) can become larger than the\ndecay rate Eq. (7) (∝ (dU − 1)−1).\n3.3 Cosmological constraints on unparticle parameters\nWe next consider the constraints on MU and ΛU as a function of dU following from\nthermal quark decay to unparticles. The bounds derived above assume that the energy\nof the quarks is less than ΛU , otherwise the decay and annihilation rates should be\ncalculated for BZ particle final states. Since the most interesting case is where unparti-\ncles may be observed in future colliders, we will consider ΛU\n>\n∼\n1 TeV in the following.\nThe decay rate depends upon the product k1 ≡ C2UAdU , which is determined by the\ninfra-red dynamics of the Banks-Zaks fields [1]. Therefore any conclusions about the\ncosmology of unparticles is dependent upon assumptions about this product, which\n9\nshould become better understood as unparticle physics develops. In the following we\nwill assume that k1 is not very large or small compared with 1.\nThe constraints will depend on the assumed values of the model parameters dBZ ,\ndU and ΛU . We first focus on the case where the BZ operator is a quark bilinear,\nso that dBZ = 3, and calculate constraints for the cases dU = 1.1, 1.5 and 2 when\nΛU\n>\n∼\n1 TeV.\nThe most important constraints come from Eq. (10) when T < TEW . This gives\nlower bounds on MU as a function of dU\ndU = 1.1 : MU\n>\n∼\n190 k\n1\/6\n1\n(\nΛU\n1 TeV\n)19\/30\nTeV\ndU = 1.5 : MU\n>\n∼\n110 k\n1\/6\n1\n(\nΛU\n1 TeV\n)1\/2\nTeV\ndU = 2.0 : MU\n>\n∼\n70 k\n1\/6\n1\n(\nΛU\n1 TeV\n)1\/3\nTeV , (20)\nwhere we have used kT = 3. Thus if k1 is not very large or small compared with 1 and\nΛU\n>\n∼\n1 TeV, the mass scale of the dBZ = 3 interaction between the BZ and SM fields\nmust be greater than around 100 TeV for dU between 1.1 and 2.0. These bounds hold\nif the radiation-dominated era has T >\n∼\nmt\/3 at some time, otherwise weaker bounds\nbased on lighter quark decays will apply.\nUpper bounds on the temperature of the radiation-dominated era when T > TEW\ncan be obtained from Eq. (11). However, these bounds stricly hold only if the energy of\nthe decaying quark E ≈ 3T is less than ΛU , since for larger temperatures and energies\nthe decay will produce BZ particles rather than unparticles. For TEW < T\n<\n∼\nΛU\/3 we\nobtain:\ndU = 1.1 : T\n<\n∼\n10 TeV\n(\n1\nk1\n)5\/6 ( MU\n250 TeV\n)5 (1 TeV\nΛU\n)19\/6\ndU = 1.5 : T\n<\n∼\n2.6 TeV\n(\n1\nk1\n)1\/2 ( MU\n150 TeV\n)3 (1 TeV\nΛU\n)3\/2\ndU = 2.0 : T\n<\n∼\n1.3 TeV\n(\n1\nk1\n)1\/3 ( MU\n100 TeV\n)2 (1 TeV\nΛU\n)2\/3\n. (21)\nThe upper bounds on T are sensitive to MU and the value of 3T can easily be above\nΛU . In this case the decay should be calculated to BZ sector fields using the interaction\n10\nEq. (1). For dBZ = 3 and OBZ corresponding to a bilinear of BZ fermions ΨΨ, the\ninteraction with the SM quarks becomes\n1\nMkU\nOSMOBZ → ∂µ(qγµ (1− γ5) q\n′\n)ΨΨ\nM3U\n. (22)\nThe decay rate for q\n′ → qΨΨ is then\nΓd ≈ 1\n(8pi)3\nT 7\nM6U\n(23)\nThe condition Γd < H then implies that\nT <\n∼\n1.8\n(\nMU\n100 TeV\n)6\/5\nTeV . (24)\nIf this bound is not satisfied, energy will flow to the BZ sector until thermal equilibrium\nis established with the BZ sector, resulting in a large BZ sector energy density. For\nexample, for the case of the original Banks-Zaks theory with an SU(3) gauge group and\nNF > 16.5 Dirac fermions transforming in the fundamental representation of SU(3)\n[14], the number of thermal degrees of freedom is at least g(T ) = 8 × 2 + 7\/8 × 4 ×\n3 × 17 = 195.5, which is larger than the number of degrees of freedom in the SM,\ng(T ) = 106.75. Therefore in thermal equilibrium, ρBZ ≈ 2ρSM . Once T drops below\nthe upper limit in Eq. (24), the SM and BZ sectors decouple. As the BZ fields lose\nenergy via expansion they will evolve into unparticles, leaving an energy density in\nthe unparticle sector which is too large to dilute sufficiently by photon heating in the\nSM before nucleosynthesis. Therefore, a stable unparticle sector in general implies an\nupper limit on the temperature of the radiation-dominated Universe, which is of the\norder of 1 TeV for MU close to its lower limit.\nThe above results are for the case dBZ = 3. To show the sensitivity to dBZ we\ncalcuate the lower bound on MU from Eq. (10) for the cases dBZ = 2 and 4:\ndBZ = 2\ndU = 1.1 : MU\n>\n∼\n2600 k\n1\/4\n1\n(\nΛU\n1 TeV\n)9\/20\nTeV\ndU = 1.5 : MU\n>\n∼\n1100 k\n1\/4\n1\n(\nΛU\n1 TeV\n)1\/4\nTeV\ndU = 2.0 : MU\n>\n∼\n520 k\n1\/4\n1 TeV . (25)\n11\ndBZ = 4\ndU = 1.1 : MU\n>\n∼\n43 k\n1\/8\n1\n(\nΛU\n1 TeV\n)29\/40\nTeV\ndU = 1.5 : MU\n>\n∼\n33 k\n1\/8\n1\n(\nΛU\n1 TeV\n)5\/8\nTeV\ndU = 2.0 : MU\n>\n∼\n23 k\n1\/8\n1\n(\nΛU\n1 TeV\n)1\/2\nTeV. (26)\nLarger dBZ for a given dU reduces the lower bound on MU for ΛU ≈ 1 TeV, but\nincreases the sensitivity to ΛU . From Eq. (20), Eq. (25) and Eq. (26) we see that the\nlower bounds on MU are in the range 20 TeV to 2600 TeV when 1.1 ≤ dU ≤ 2.0 and\n2 ≤ dBZ ≤ 4, assuming that ΛU >∼ 1 TeV and k1 is not too different from 1.\n3.4 Discussion\nThe first study of unparticle cosmology was presented in [8]. This was based on a\ndimensional estimate of the rate of production Γψ of unparticles from SM radiation\nvia a vector unparticle operator interaction of the form ψγµψO\nµ\nU . It was assumed that\nonce Γψ > H , the unparticles and SM particles are in thermal equilibrium at T . Once\nthe unparticles decouple, the unparticle sector is assumed to have a temperature TU\nwhich is less than the photon temperature T due to photon heating by subsequent\nannihilations. In order to ensure that TU is sufficiently suppressed that the additional\nunparticle energy does not affect BBN, it was required that decoupling of the unpar-\nticles occurs at T >\n∼\n1 GeV, before the QCD phase transition. Requiring this imposes\nan upper bound on ΛU . However, as we have shown, the actual suppression of the\nunparticle density relative to the radiation density is by at most a factor of 0.16, which\nis ineffective in suppressing a decoupled unparticle density with ρU > 0.4ρSM .\nThe main difference in our discussion of unparticle cosmology is in the interpreta-\ntion of the condition Γd > H . Rather than establishing thermal equilibrium between\nthe SM and unparticles, we interpret this as a rapid flux of energy from SM radiation to\nthe unparticle sector, resulting in an unparticle dominated Universe. Therefore Γd < H\nmust hold for all T , imposing an upper bound on T during radiation-domination. Our\nanalysis also differs in the interaction we considered, based on a scalar unparticle op-\n12\nerator. The decay and annihilation rates in this case differ from a simple dimensional\nestimate due to the quark mass factors which must also be included.\nStrong constraints on unparticles can be imposed by supernovae [5] and by unparticle-\nmediated long-range forces [6]. However, these constraints can be evaded by slightly\nby breaking the conformal invariance, for example by giving the deconstructing scalars\na mass > 30 MeV to suppress their creation in supernovae.\nSince we have shown that MU\n>\n∼\n100 TeV is typically necessary for compatibility\nwith SM cosmology, it might appear that detection of unparticles in collider exper-\niments is unlikely. However, in the case where unparticle operators couple to the\nHiggs doublet, it is possible to detect unparticles with such large MU e.g. by ob-\nserving the partial Higgs boson decay width to gluon and photon pairs [12]. Such\nunparticle-Higgs interactions can also break conformal invariance of the unparticles\nand can modify electroweak symmetry breaking [13].\n4 Conclusions\nWe have shown that the requirement that unparticles do not dominate the energy\ndensity at nucleosynthesis implies that there is a lower bound on the scale MU of\nthe interaction between the Banks-Zaks fields and the Standard Model and an upper\nbound on the temperature of the radiation-dominated Universe.\nFor an interaction between SM quarks and scalar unparticle operators with dBZ = 3\nand ΛU\n>\n∼\n1 TeV, the lower bound on MU is typically of the order of 100 TeV for\nunparticle dimensions dU in the range 1.1 - 2.0. Varying dBZ widens the range of\nlower bounds, with MU\n>\n∼\n20− 2600 TeV for 2 ≤ dBZ ≤ 4. Decays will dominate over\nannihilations except if dU is very close to 1. Including other unparticle operators can\nonly strengthen these bounds.\nAn important consequence of an unparticle sector coupled to the Standard Model\nis the existence an upper bound on the temperature of the Standard Model radiation-\ndominated era. In the example with dBZ = 3, the upper bound is of the order of 1\nTeV for MU close to its lower bound.\n13\nThese conclusions are based on the assumption that unparticles are physically\nequivalent to continuous mass particles. If true, this implies that the rate of scattering\nof SM particles to unparticle states is generally much larger than that of the reverse\nprocess scattering unparticle states to SM particles. As a result, energy will flow from\nthe SM thermal bath to the unparticle sector.\nThe existing literature on unparticles is based purely on scale-invariance, with the\nphysics of the strongly-coupled CFT being absorbed into the free parameters of the\ngeneric unparticle model. In order to establish the conditions under which unparticles\nare equivalent to continuous mass states, as well as to relate the unparticle parameters\nto the underlying CFT, a detailed analysis of strongly-coupled CFTs and their relation\nto unparticle states is needed.\nAn important issue related to this is the necessary equivalence of the thermody-\nnamics of the CFT, which is determined by its central charge, and the thermodynamics\nof unparticles in the continuous mass picture. This should shed light on the validity\nof the continuous mass picture and on the relationship between the parameters of the\nunderlying CFT and the unparticle parameters based on scale-invariance.\nThere are many other issues to be addressed before a complete understanding of\nunparticle cosmology can be achieved. One is the effect of breaking the conformal\ninvariance of the unparticle sector on the stability of the unparticle energy density.\nAnother is whether a complete unparticle cosmology, including inflation, reheating and\nbaryogenesis, can be constructed with a low maximum temperature during radiation-\ndomination. Establishing the lowest radiation-domination temperature for which a\ncomplete unparticle cosmology is feasible will place strong constraints on unparticle\noperators, which will in turn have direct consequences for the possibility of observing\nthe unparticle sector experimentally. We will return to these issues in future work.\nAcknowledgements\nWe would like to thank Misha Stephanov for his comments.\nThis work was supported by the European Union through the Marie Curie Re-\n14\nsearch and Training Network ”UniverseNet” (MRTN-CT-2006-035863) and by STFC\n(PPARC) Grant PP\/D000394\/1.\nReferences\n[1] H. Georgi, Phys. Rev. Lett. 98, 221601 (2007) [arXiv:hep-ph\/0703260].\n[2] H. Georgi, Phys. Lett. B 650, 275 (2007) [arXiv:0704.2457 [hep-ph]].\n[3] J. J. van der Bij and S. Dilcher, arXiv:0707.1817 [hep-ph];\nJ. J. van der Bij, Phys. Lett. B 636, 56 (2006) [arXiv:hep-ph\/0603082].\n[4] K. Cheung, W. Y. Keung and T. C. Yuan, arXiv:0704.2588 [hep-ph]; M. Luo\nand G. Zhu, arXiv:0704.3532 [hep-ph]; C. H. Chen and C. Q. Geng,\narXiv:0705.0689 [hep-ph]; G. J. Ding and M. L. Yan, arXiv:0705.0794 [hep-ph];\nY. Liao, arXiv:0705.0837 [hep-ph]; T. M. Aliev, A. S. Cornell and N. Gaur,\narXiv:0705.1326 [hep-ph]; X. Q. Li and Z. T. Wei, Phys. Lett. B 651, 380 (2007)\n[arXiv:0705.1821 [hep-ph]]; M. Duraisamy, arXiv:0705.2622 [hep-ph]; C. D. Lu,\nW. Wang and Y. M. Wang, arXiv:0705.2909 [hep-ph]; P. J. Fox, A. Rajara-\nman and Y. Shirman, arXiv:0705.3092 [hep-ph]; N. Greiner, Phys. Lett. B 653,\n75 (2007) [arXiv:0705.3518 [hep-ph]]; D. Choudhury, D. K. Ghosh and Mamta,\narXiv:0705.3637 [hep-ph]; S. L. Chen and X. G. He, arXiv:0705.3946 [hep-ph];\nT. M. Aliev, A. S. Cornell and N. Gaur, JHEP 0707, 072 (2007) [arXiv:0705.4542\n[hep-ph]]; P. Mathews and V. Ravindran, arXiv:0705.4599 [hep-ph]; S. Zhou,\narXiv:0706.0302 [hep-ph]; G. J. Ding and M. L. Yan, arXiv:0706.0325 [hep-ph];\nC. H. Chen and C. Q. Geng, Phys. Rev. D 76, 036007 (2007) [arXiv:0706.0850\n[hep-ph]]; M. Bander, J. L. Feng, A. Rajaraman and Y. Shirman, arXiv:0706.2677\n[hep-ph]; T. G. Rizzo, arXiv:0706.3025 [hep-ph]; K. Cheung, W. Y. Keung and\nT. C. Yuan, arXiv:0706.3155 [hep-ph]; S. L. Chen, X. G. He and H. C. Tsai,\narXiv:0707.0187 [hep-ph]; R. Zwicky, arXiv:0707.0677 [hep-ph]; T. Kikuchi and\nN. Okada, arXiv:0707.0893 [hep-ph]; R. Mohanta and A. K. Giri, arXiv:0707.1234\n[hep-ph]; C. S. Huang and X. H. Wu, arXiv:0707.1268 [hep-ph]; A. Lenz,\n15\narXiv:0707.1535 [hep-ph]; D. Choudhury and D. K. Ghosh, arXiv:0707.2074 [hep-\nph]; H. Zhang, C. S. Li and Z. Li, arXiv:0707.2132 [hep-ph]; X. Q. Li, Y. Liu and\nZ. T. Wei, arXiv:0707.2285 [hep-ph]; N. G. Deshpande, X. G. He and J. Jiang,\narXiv:0707.2959 [hep-ph]; R. Mohanta and A. K. Giri, arXiv:0707.3308 [hep-\nph]; G. Cacciapaglia, G. Marandella and J. Terning, arXiv:0708.0005 [hep-ph];\nM. Neubert, arXiv:0708.0036 [hep-ph]; M. x. Y. Luo, W. Wu and G. h. Zhu,\narXiv:0708.0671 [hep-ph]; G. Bhattacharyya, D. Choudhury and D. K. Ghosh,\narXiv:0708.2835 [hep-ph]; D. Majumdar, arXiv:0708.3485 [hep-ph]; A. T. Alan\nand N. K. Pak, arXiv:0708.3802 [hep-ph]; C. H. Chen and C. Q. Geng,\narXiv:0709.0235 [hep-ph]; T. i. Hur, P. Ko and X. H. Wu, arXiv:0709.0629\n[hep-ph]; L. Anchordoqui and H. Goldberg, arXiv:0709.0678 [hep-ph]; S. Majhi,\narXiv:0709.1960 [hep-ph].\n[5] S. Hannestad, G. Raffelt and Y. Y. Y. Wong, arXiv:0708.1404 [hep-ph]; P. K. Das,\narXiv:0708.2812 [hep-ph]. A. Freitas and D. Wyler, arXiv:0708.4339 [hep-ph];\n[6] Y. Liao and J. Y. Liu, arXiv:0706.1284 [hep-ph]; N. G. Deshpande, S. D. H. Hsu\nand J. Jiang, arXiv:0708.2735 [hep-ph].\n[7] Y. Nakayama, arXiv:0707.2451 [hep-ph]; T. A. Ryttov and F. Sannino,\narXiv:0707.3166 [hep-th]; Y. Liao, arXiv:0708.3327 [hep-ph]; I. Gogoladze,\nN. Okada and Q. Shafi, arXiv:0708.4405 [hep-ph].\n[8] H. Davoudiasl, arXiv:0705.3636 [hep-ph].\n[9] M. A. Stephanov, Phys. Rev. D 76, 035008 (2007) [arXiv:0705.3049 [hep-ph]].\n[10] N. V. Krasnikov, arXiv:0707.1419 [hep-ph];\n[11] H. Nikolic, arXiv:0801.4471 [hep-ph].\n[12] T. Kikuchi and N. Okada, arXiv:0707.0893 [hep-ph].\n[13] A. Delgado, J. R. Espinosa and M. Quiros, arXiv:0707.4309 [hep-ph].\n[14] T. Banks and A. Zaks, Nucl. Phys. B 196, 189 (1982).\n16\n[15] J. P. Kneller and G. Steigman, Phys. Rev. D 67, 063501 (2003)\n[arXiv:astro-ph\/0210500].\n[16] G. Mack, Commun. Math. Phys. 55, 1 (1977).\n[17] G. W. Anderson and L. J. Hall, Phys. Rev. D 45, 2685 (1992).\n[18] S. S. Gubser, Phys. Rev. D 63, 084017 (2001) [arXiv:hep-th\/9912001].\n17\n"}