{"doi":"10.1088\/1748-9326","coreId":"53088","oai":"oai:nora.nerc.ac.uk:13711","identifiers":["oai:nora.nerc.ac.uk:13711","10.1088\/1748-9326"],"title":"How committed are we to monitoring human impacts in Antarctica?","authors":["Hughes, Kevin"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"Under the Antarctic Treaty System, environmental monitoring is a legal obligation for signatory nations and an essential tool for managers attempting to minimize local human impacts, but is it given the importance it merits?\\ud\n\\ud\nAntarctica is a vast frozen continent with an area around 1.5 times that of Europe (14 000 000 km2), but the majority of its terrestrial life is found on multiple outcrops or 'islands' of ice-free coastal ground, with a combined area of ~6000 km2, equivalent to four times that of Greater London (Tin et al 2009). The biological communities of these ice-free terrestrial habitats are dominated by a small number of biological groups, primarily mosses, lichens, microinvertebrates and microorganisms. They include many endemic species, while birds and marine mammals use coastal areas as breeding sites (Chown and Convey 2007)","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/53088.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/13711\/1\/1748-9326_5_4_041001.pdf","pdfHashValue":"067ca3c2c49c2c086520c597aab6eb8b0efa624b","publisher":"IOP Publishing Ltd","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:13711<\/identifier><datestamp>\n      2013-09-06T10:55:24Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533139<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/13711\/<\/dc:relation><dc:title>\n        How committed are we to monitoring human impacts in Antarctica?<\/dc:title><dc:creator>\n        Hughes, Kevin<\/dc:creator><dc:subject>\n        Management<\/dc:subject><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        Under the Antarctic Treaty System, environmental monitoring is a legal obligation for signatory nations and an essential tool for managers attempting to minimize local human impacts, but is it given the importance it merits?\\ud\n\\ud\nAntarctica is a vast frozen continent with an area around 1.5 times that of Europe (14 000 000 km2), but the majority of its terrestrial life is found on multiple outcrops or 'islands' of ice-free coastal ground, with a combined area of ~6000 km2, equivalent to four times that of Greater London (Tin et al 2009). The biological communities of these ice-free terrestrial habitats are dominated by a small number of biological groups, primarily mosses, lichens, microinvertebrates and microorganisms. They include many endemic species, while birds and marine mammals use coastal areas as breeding sites (Chown and Convey 2007).<\/dc:description><dc:publisher>\n        IOP Publishing Ltd<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_sa<\/dc:rights><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/13711\/1\/1748-9326_5_4_041001.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Hughes, Kevin.  2010  How committed are we to monitoring human impacts in Antarctica?   Environmental Research Letters, 5 (4), 041001. 3, pp.  https:\/\/doi.org\/10.1088\/1748-9326\/5\/4\/041001 <https:\/\/doi.org\/10.1088\/1748-9326\/5\/4\/041001>     \n <\/dc:identifier><dc:relation>\n        http:\/\/iopscience.iop.org\/1748-9326\/5\/4\/041001<\/dc:relation><dc:relation>\n        10.1088\/1748-9326\/5\/4\/041001<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/13711\/","http:\/\/iopscience.iop.org\/1748-9326\/5\/4\/041001","10.1088\/1748-9326\/5\/4\/041001"],"year":2010,"topics":["Management","Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":"How committed are we to monitoring human impacts in Antarctica?\nThis article has been downloaded from IOPscience. Please scroll down to see the full text article.\n2010 Environ. Res. Lett. 5 041001\n(http:\/\/iopscience.iop.org\/1748-9326\/5\/4\/041001)\nDownload details:\nIP Address: 194.66.0.114\nThe article was downloaded on 06\/09\/2013 at 11:54\nPlease note that terms and conditions apply.\nView the table of contents for this issue, or go to the journal homepage for more\nHome Search Collections Journals About Contact us My IOPscience\nIOP PUBLISHING ENVIRONMENTAL RESEARCH LETTERS\nEnviron. Res. Lett. 5 (2010) 041001 (3pp) doi:10.1088\/1748-9326\/5\/4\/041001\nPERSPECTIVE\nHow committed are we to monitoring\nhuman impacts in Antarctica?\nKevin A Hughes\nBritish Antarctic Survey,\nNatural Environment\nResearch Council, High\nCross, Madingley Road,\nCambridge CB3 0ET, UK\nkehu@bas.ac.uk\nUnder the Antarctic Treaty System, environmental monitoring is a legal\nobligation for signatory nations and an essential tool for managers attempting to\nminimize local human impacts, but is it given the importance it merits?\nAntarctica is a vast frozen continent with an area around 1.5 times that of\nEurope (14 000 000 km2), but the majority of its terrestrial life is found on\nmultiple outcrops or ‘islands’ of ice-free coastal ground, with a combined area of\n∼6000 km2, equivalent to four times that of Greater London (Tin et al 2009). The\nbiological communities of these ice-free terrestrial habitats are dominated by a\nsmall number of biological groups, primarily mosses, lichens, microinvertebrates\nand microorganisms. They include many endemic species, while birds and marine\nmammals use coastal areas as breeding sites (Chown and Convey 2007).\nFigure 1. Map of the Antarctic Treaty area (south of latitude 60◦S) showing the\nlocations of year-round and seasonal stations built on rock or permanent ice (i.e.\nice sheets or ice shelves). Data on station locations were taken from the Council\nof Managers of National Antarctic Programs website (COMNAP 2010). There is\nevidence to suggest that although these stations are registered on the COMNAP\nlist, a number of stations are not regularly occupied or in use (see United\nKingdom et al 2006, p9).\n1748-9326\/10\/041001+03$30.00 1 © 2010 IOP Publishing Ltd Printed in the UK\nEnviron. Res. Lett. 5 (2010) 041001 Perspective\nSince the influx of national scientific research programmes and infrastructure\nthat accompanied the International Geophysical Year (1957–1958), Antarctica’s\nhabitats have been encroached upon increasingly by human activities. Over 120\nresearch stations have been built (∼75 currently operational) with the great\nmajority located on ice-free coastal ground to allow ease of access by ship.\n(Headland 2009, COMNAP 2010). Construction of cargo and personnel landing\nand handling facilities, station buildings, airport infrastructure, roads and fuel\nstorage areas have, to varying degrees, destroyed native vegetation and terrestrial\nfauna and displaced bird and marine mammals from breeding sites in their\nimmediate environment. An early history of poor environmental management and\nwaste disposal practices around many stations has left a legacy of\nfuel-contaminated ground and abandoned waste sites in adjacent marine and\nterrestrial environments (Tin et al 2009).\nConstruction of research stations and other infrastructure fulfils two national\nobjectives: (1) supporting geopolitical aspirations of claimant nations and (2)\ndemonstrating a significant commitment to undertaking science in Antarctica,\nwhich is a prerequisite for attaining consultative status at the Antarctic Treaty\nConsultative Meeting. However, these objectives may not be supported equally,\nwith little or no science performed routinely at some stations (United Kingdom et\nal 2006). In addition, co-ordination of science activities between\nnations—another aspiration under the Antarctic Treaty—is often lacking, leading\nto duplication of research between national programmes, and even that\nundertaken at nearby stations. In some cases, components of national research\nprogrammes lack any international, open or objective assessment of quality.\nNevertheless, new nations continue to become involved in Antarctic affairs, and\nalmost inevitably seek to establish their own infrastructure, while some\nestablished Treaty Parties continue to further expand their existing logistic and\ninfrastructure footprints. Despite calls for nations to share existing infrastructure\nor reuse abandoned stations (ATCM 2006), new stations continue to be\nconstructed on pristine sites, with the Antarctic terrestrial environment in\nparticular coming under increased pressure.\nThe Protocol on Environmental Protection to the Antarctic Treaty (commonly\nknown as the Environmental Protocol), which came into force in 1998, sets out\ncommon minimum standards for environmental management by all Antarctic\nTreaty Parties. Under the Protocol, it is mandatory to regularly monitor the\nenvironmental impacts caused by any new infrastructure that requires the\ncompletion of a Comprehensive Environmental Evaluation during the planning, as\nwould be required for research stations or other large building projects. Ideally,\nmonitoring should include assessment of levels of physical disruption of marine\nand terrestrial habitats, and should record levels of pollutants and also their\nimpacts upon the full range of biological groups within local ecosystems.\nBiodiversity surveys should also be undertaken, in order that introduced\nnon-native species can be identified at an early stage and eradicated (Hughes and\nConvey 2010).\nBut where can the scientific data describing national Antarctic programme\nimpacts be found? Some nations have a good track record of publishing\nenvironmental monitoring data, but the large majority do not. With around 75\nactive stations, monitoring research should be well represented in the scientific\nliterature, but data for most stations are not available. Furthermore, Antarctic\nTreaty signatory nations are required to supply details of their monitoring work\nthrough the Antarctic Treaty System’s Electronic Information Exchange System\n(see www.ats.aq\/e\/ie.htm), yet only three out of 28 Treaty nations did so for\n2008\/2009.\nIn their recent synthesis paper, Kennicutt et al (2010) describe the results of a\nlong-term monitoring programme at the United States’ McMurdo Station, giving\nus a comprehensive picture of human impacts at this location. The high quality\nand breadth of this research makes it one of the best-documented\n2\nEnviron. Res. Lett. 5 (2010) 041001 Perspective\nand longest-running monitoring programmes within Antarctica to date. Yet, why\nis this work so exceptional, when the USA have simply fulfilled their obligations\nunder the Environmental Protocol? Monitoring programmes of this standard\nshould be undertaken for all stations and large infrastructure. Factors preventing\nthis may include (1) a lack of monitoring expertise or access to sophisticated\ntechniques, particularly by smaller or less well-funded Antarctic programmes,\nand (2) the lack of importance or prestige attributed to ‘routine’ monitoring or\nsurvey programmes by science funding bodies, compared to other ‘forefront’\nscience areas.\nWith little formal international scrutiny other than occasional station\ninspections, a lack of enforcement mechanisms in place to penalize contravention\nof the provisions of the Antarctic Treaty and its related legal instruments, and a\nneed to maintain good diplomatic relations between Antarctic Treaty Parties,\nnations are under little pressure to prioritize human impact monitoring. Despite\nthe efforts of the Scientific Committee for Antarctic Research and COMNAP,\nmost Antarctic nations still act individually, with little co-ordination of\nmonitoring effort or use of standardized techniques. Close examination of the\nEnvironmental Protocol even casts some doubt over whether monitoring of\ninfrastructure constructed before its implementation in 1998 is a formal\nobligation, although many would maintain that failure to do so would be contrary\nto the spirit of the Protocol.\nWhile it can be hoped that most signatory nations take their Antarctic\nenvironmental responsibilities seriously, recent reports of poor environmental\npractice show that not all national programmes adhere fully to even the minimum\nrequirements of the Environmental Protocol (Braun et al 2010). If basic\nenvironmental practice is poor, then standards of environmental monitoring may\nalso be poor or non-existent. In stark contrast, researchers from Antarctic\nprogrammes who willingly disseminate their results through the scientific\nliterature deserve credit as they allow other nations to learn from their efforts.\nUntil all Antarctic Treaty nations engage with their monitoring obligations and\ndevelop together a co-ordinated continent-wide view of human impacts,\nAntarctica’s environmental values will remain under threat of continued\ndegradation and the principles of the Antarctic Treaty brought into disrepute.\nReferences\nATCM 2006 Final Report of the 29th Antarctic Treaty Consultative Meeting paragraph 73, available\nonline at www.ats.aq\/documents\/ATCM29\/fr\/ATCM29 fr001 e.pdf\nBraun C et al 2010 Environmental situation and management proposals for the Fildes region\n(Antarctic) Int. Polar Year Conf., 8–12 June 2010 Abstract no EA8.4-6.8, available online at\nhttp:\/\/ipy-osc.no\/event\/8917\nChown S L and Convey P 2007 Spatial and temporal variability across life’s hierarchies in the\nterrestrial Antarctic Phil. Trans. R. Soc. B 362 2307–31\nCouncil of Managers of National Antarctic Programs (COMNAP) 2010 Antarctic Facilities\navailable online at www.comnap.aq\/facilities\nHeadland R 2009 A Chronology of Antarctic Exploration (London: Quaritch) p 722\nHughes K A and Convey P 2010 The protection of Antarctic terrestrial ecosystems from inter- and\nintra-continental transfer of non-indigenous species by human activities: a review of current\nsystems and practices Glob. Environ. Change 20 96–112\nKennicutt M C II, Klein A, Montagna P, Sweet S, Wade T, Palmer T, Sericano J and Denoux G 2010\nTemporal and spatial patterns of anthropogenic disturbance at McMurdo Station, Antarctica\nEnviron. Res. Lett. 5 034010\nTin T et al 2009 Impacts of local human activities on the Antarctic environment Antarct. Sci. 21 3–33\nUnited Kingdom et al 2006 Report of joint inspections under Article VII of the Antarctic Treaty and\nArticle 14 of the Environmental Protocol ATCM XXVIII 2006 Working paper 32, available\nonline at www.ats.aq\/documents\/ATCM28\/att\/ATCM28 att270 e.pdf\n3\n"}