{"doi":"10.1080\/00498250600861603","coreId":"102489","oai":"oai:epubs.surrey.ac.uk:1951","identifiers":["oai:epubs.surrey.ac.uk:1951","10.1080\/00498250600861603"],"title":"ESTs and SNPs: What large scale sequencing projects can tell us about ADME","authors":["Plant, Nick"],"enrichments":{"references":[],"documentType":{"type":0.5555555556}},"contributors":[],"datePublished":"2006-10-01","abstract":"<p>To date over 800 complete genomes have been sequenced, with many more partially complete. Coupled with the large amount of mRNA transcript sequence data being produced from expression studies, there is now a daunting amount of information available to the research scientist. This review examines how this information may be best used, focusing on examples from sequences encoding absorption, distribution, metabolism and excretion (ADME)-related proteins in particular. Through the use of phylogenetic, splice variant and single nucleotide polymorphism (SNP) analysis, the review examines not only how insights into species-specific responses to drug exposure may be gained, but also how best to utilize this information to predict both individual human responses and the impact of population variance in response.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1951<\/identifier><datestamp>\n      2017-10-31T14:03:46Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:62696F736369656E6365735F6D65646963696E65:62696F5F6D6F6C6563<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1951\/<\/dc:relation><dc:title>\n        ESTs and SNPs: What large scale sequencing projects can tell us about ADME<\/dc:title><dc:creator>\n        Plant, Nick<\/dc:creator><dc:description>\n        <p>To date over 800 complete genomes have been sequenced, with many more partially complete. Coupled with the large amount of mRNA transcript sequence data being produced from expression studies, there is now a daunting amount of information available to the research scientist. This review examines how this information may be best used, focusing on examples from sequences encoding absorption, distribution, metabolism and excretion (ADME)-related proteins in particular. Through the use of phylogenetic, splice variant and single nucleotide polymorphism (SNP) analysis, the review examines not only how insights into species-specific responses to drug exposure may be gained, but also how best to utilize this information to predict both individual human responses and the impact of population variance in response.<\/p><\/dc:description><dc:date>\n        2006-10-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1951\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Plant, Nick  (2006) ESTs and SNPs: What large scale sequencing projects can tell us about ADME   Xenobiotica, 36 (10-11).  pp. 10-11.      <\/dc:identifier><dc:relation>\n        10.1080\/00498250600861603<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1951\/","10.1080\/00498250600861603"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"   ESTs and SNPs: What large scale sequencing projects can tell us about ADME \n \n \nNICK PLANT \n \n \nSchool of Biomedical and Molecular Sciences, University of Surrey, Guildford, \nSurrey, GU2 7XH, UK \n \n 2\n1. To date over 800 complete genomes have been sequenced, with many more \npartially complete. Coupled with the large amount of mRNA transcript \nsequence data being produced from expression studies there is now a daunting \namount of information available to the research scientist. This review will aim \nto examine how this information may be best used, focussing on examples \nfrom sequences encoding ADME-related proteins in particular.  \n2. Through the use of phylogenetic, splice variant and SNP analysis I shall \nexamine how insights into not only species-specific responses to drug \nexposure may be gained, but also how best we utilize this information to \npredict both individual human responses and the impact of population variance \nin response. \n \nKeywords: Phylogenetic analysis, Expressed sequence tag, Single nucleotide \npolymorphism, species difference \n \nRunning Title: ESTs and SNPs \n \nCorrespondence: Nick Plant, School of Biomedical and Molecular Sciences, \nUniversity of Surrey, Guildford, Surrey, GU2 7XH, UK. Fax: +44 (0)1483 686401. \nEmail: N.Plant@Surrey.ac.uk \n 3\nGeneral Introduction \nThe ultimate aim of biological sciences has always been to understand how the body \nworks, to actually explain what makes humans tick. An extension of this is required \nby the ADME scientist; not only to understand how the body works but, more \nimportantly, to be able to predict how it will respond to chemical exposure. In the last \ndecade a step-change has occurred in the capacity of man to generate information \nabout the biological subsystems of the body, and how these alter in response to \nchemical exposure. This increase in technological ability has resulted in a huge \namount of data available in silico to the research scientist; the challenge now is how \nto make the most use of this information. \nThis review will aim to examine the emergent technologies available for large \nscale information gathering, as well as the databases where such information is stored. \nWhereas public data storage is a central part of open-access research for the scientist, \nperhaps of more import today is the development of tools with which to analyse this \nfreely available data, and a selection of these tools will also be covered in this review. \nPublic domain storage of sequence information and the development of \ncomputational tools to examine such a large amount of data are central to our further \nunderstanding of systems biology. However, six years after the sequencing of the \nhuman genome how far have we actually come? What insights (if any) have we learnt \nthrough the mining of these large databases? This review will attempt to address this \nquestion, or at least some parts of it,  by examining how in silico analysis has aided \nour understanding of human biology, and in particular ADME: First, how the \nsequencing of non-human genomes may increase our knowledge of how the human \nbody functions. Second, the discovery of novel genes, which may represent novel \ntherapeutic targets, or whose protein products may impact upon ADME processes. \n 4\nFinally, how single nucleotide polymorphism (SNP) analysis may help researchers to \nunderstand\/predict inter-individual variation in response to chemical exposure. \n \nLooking in to the past: What can phylogenetic analysis tell us? \nThere are presently fully sequenced genomes from just over 800 different species \n(www.ncbi.nlm.nih.gov\/), the majority of which are available through public domain \nrepositories such as NCBI, EBI and GenomeNet (based in the USA, Europe and Japan \nrespectively).  If one also includes all currently active genome sequencing projects \nthen this number increases to over 4500 (Table 1), with approximately one third of \nthese being animal species. However, a cursory glance at these will tell you that of \nthese 800 only a relatively small number represent species directly applicable to the \nAMDET process (Table 2). \n \n[TABLE 1+2 AROUND HERE] \n \nThe impact of the human genome sequence has been obvious and immediate; with \nit we are (theoretically) able to identify every human gene and extrapolate this \ninformation to functional biology. Indeed, some startling discoveries have been made \nsuch as the relatively low number of genes (now estimated at 20-25,000; Consortium \n2004), and the overall high level of identity to supposedly very different organisms \nsuch as the mouse (Lander, et al. 2001, Waterston, et al. 2002). What has not been \nachieved (yet) however is a full understanding of the human biological system and all \nits intricate workings, and for that the other 800+ sequenced genomes have a \nsignificant role to play. From a homocentric point of view one can imagine that \nhumans are at the (current) end of an evolutionary process that began some 3.5 billion \n 5\nyears ago (Kumar and Hedges 1998). This evolutionary process, culminating in Homo \nsapiens has revolved around the emergence of traits that allow humans to survive in \nour particular environment. Thus, we cannot say that we are the pinnacle of evolution, \nmerely the end of this particular branch; other organisms have evolved to suit their \nparticular environments and are hence the ‘top’ of their evolutionary tree. Traits that \nare beneficial for survival are kept, whereas those that are non-essential to life may be \nlost or altered through time. Following this argument in reverse it can be argued that \ntraits (or genes) maintained in a large number of organisms are important for life in \ngeneral, whereas those that exist in only a single species are important for that \norganism to exist in its particular environment. Through the study of the genomes of \nour evolutionary ancestors it may thus be possible to gain insights into the functioning \nof the human body. In addition, the less complex biological systems exhibited by \nmany of these organisms means that gene functions are much better described, and \nhence it is possible to gain insights into human systems biology through the study of \nthese ‘simpler’ organisms. \nGenes whose protein products are involved in ADME lend themselves well to this \ntype of analysis for a number of reasons. First, the need to respond to external \nchemicals has existed for a long time, thus meaning that these genes are present \nthrough millions of years of phylogenetic lineage. Second, the requirement to respond \nto a large number of different chemical entities has resulted in relatively large gene \nfamilies: Such large numbers per species are useful in phylogenetic analysis for \nexamining differences between evolutionarily close species (e.g. rats and humans). \nThird, the different environments that organisms are exposed to results in different \npressures upon them, favouring the emergence of traits to cope with these specific \npressures. By studying how different organisms have evolved to cope with their \n 6\nparticular environments we may gain important insights into how humans have \nevolved to cope with ours. \nPerhaps the two best examples of where phylogenetic analysis has yielded insights \ninto biological function for ADME-related genes are the cytochrome P450s and their \ncontrolling ligand-activated transcription factors, the nuclear receptors. \nCytochrome P450 phylogenetic analysis \nCytochrome P450 (CYP) enzymes are amongst the most ancient proteins known, with \ngene present in all species examined from archaebacteria to humans (Nelson, et al. \n1996). The reason for the prevalence is simple; CYPs are a fundamental enzyme \nfamily in the metabolism (both anabolic and catabolic) of the endogenous chemicals \nrequired for life (Nebert and Gonzalez 1987). Their ability to metabolise xenobiotics \nis to a great extent an acquired secondary characteristic, albeit one central to ADME. \nIndeed, the majority of human CYPs are still concerned with endogenous metabolism, \nwith only CYP families 1-3 (representing 18 out of 57 human CYPs) primarily \nconcerned with the metabolism of xenobiotics (Werck-Reichhart and Feyereisen \n2000). The number of CYP genes underwent a rapid increase following the \ndevelopment of organisms with a gastro-intestinal tract, with increased chemical \nintake through the diet becoming a significant driver in the need to evolve new \nproteins capable of metabolising these chemicals (Nebert and Gonzalez 1987). An \ninteresting example of this is how rodents have evolved over 100 individual CYP \ngenes, far greater than the 57 found in humans. A cogent argument is that omnivorous \nrodents take in many more chemicals through their diet due to their scavenging \nlifestyle, and hence require more CYPs to protect them from potential toxins. \nThe Committee for Standardised Cytochrome P450 nomenclature has accepted the \nunenviable task of bringing all CYP sequence-related research under one roof, and \n 7\nmore importantly under one naming system. Sequences are named according to their \nidentity, being assigned to families and sub-families at the 70 % and 40 % identity \nlevels respectively. Such a nomenclature relies upon the accuracy of gene \nidentification, and by inference the accuracy of gene prediction software (Wang, et al. \n2004). Unfortunately, Cytochrome P450 gene sequences do not lend themselves well \nto automated identification; CYP genes sequences are often highly similar, and often \nexist as chromosome clusters of related genes. Such clusters are easily misinterpreted \nby automated gene prediction programs, producing ‘fusion-genes’ from two CYP-\ngene sequences within the gene cluster (Nelson 2002, Nelson 2005). For example, in \nhuman the four CYP3A sub-family members CYP3A4, 5, 7 and 43 are located on \nchromosome 7q21 within a single cluster, demonstrating an average 82 % identity \n(Gibson, et al. 2002). CYP gene prediction is particularly difficult in plant genomes, \nwhere gene clusters can extend to 10 or more highly related gene sequences (Nelson, \net al. 2004). To further complicate the situation some CYP genes have evolved \nremarkably short exons, often comprised of only three or four amino acids \n(Doddapaneni, et al. 2005). Such short exons are often excluded by automated gene \nprediction programs, obviously impacting upon any naming system relying upon \nsequence identity, as well as potentially altering the implied biologically functioning \nof the protein products. Thus, it can be seen that whereas there have been huge \nimprovements in the gene-hunting software available, for many gene families such as \nthe CYPs there is no alternative but painstaking individual annotation by scientists. \nMore than anything else this justifies the existence of websites such as the Committee \nfor Standardised Cytochrome P450 Nomenclature, preventing duplication of this \npainstaking work, or invalid investigations based upon the erroneous gene sequences \nproduced via automated data mining. \n 8\nThe many genome sequencing projects underway now make it possible to \nexamine CYP evolution among a wide range of organisms, including humans and \nrodents (96 million years divergence), humans and pufferfish (420 million years \ndivergence; Nelson 2003) and humans and Arabidopsis (670 million years \ndivergence; Nelson, et al. 2004). Through the study of CYPs in a monocot (Oryza \nsativa, Japanese rice) and dicot (Arabidopsis) plant it is apparent that plants have \nmany more CYPs than humans, with these species having ~350 and ~250 CYP genes \nrespectively. The reason for this large number of CYP genes is not clear, but Nelson \nand colleagues speculate that it may be as a result of the pressures exerted on early \nplants during colonization of land (Nelson, et al. 2004). Of the rice and Arabidopsis \nCYPs approximately two-thirds are shared, having emerged prior to the monocot-\ndicot divergence 200 million years ago; however, despite this large overlap in shared \ngenes only approximately one fifth of the CYP subfamilies are conserved, with these \npresumably encoding those CYPs involved in reaction fundamental to survival.   \nComparing CYPs from humans and the pufferfish (Takifugu rubripes) produces \nfar fewer differences than observed between plants and humans (Nelson 2003). \nDespite over 420 million years of divergence pufferfish and humans share 17 out of \nthe 18 CYP families, and within these families gene structures (e.g. intron-exon \nboundaries) are well conserved. Such results suggest that the defining characteristics \nof vertebrate CYPs have been in place for at least 420 million years, with the only \nmajor divergences seen in those subfamilies, such as CYP2C, which are primarily \ntargeted towards the metabolism of xenobiotics (Nelson 2003). The unique family in \nhumans compared to pufferfish is CYP39, and this in itself is interesting as the \nemergence of this sub-family provides an alternate pathway for the biosynthesis of \nbile acids: This is a demonstration of the ability of CYPs to produce safety-nets, \n 9\nwhereby important metabolic functions exhibit redundancy in an attempt to prevent \ntoxicity due to disruption of cellular homeostasis.  \nNuclear receptor phylogenetic analysis \nIf the CYP-family members are the engines of Phase I metabolism then the nuclear \nreceptors can be envisaged as the drivers; they control the when, where and how \nmuch for expression of many of the CYP genes as well as a large number of other \ngene families involved in ADME. It is thus logical to apply the same phylogenetic \nanalysis to this family of ligand-activated transcription factors as it was to their target \ngenes; understanding the evolution and biological functioning of nuclear receptors \nmay help researchers further understand the regulation\/functioning of their target \ngenes. \nFollowing the complete sequencing of the first three mammalian genomes \n(human, rat and mouse) Zhang and colleagues undertook an examination of the \nnuclear receptor family in these three species, employing a different approach to \nidentifying novel related genes (Zhang, et al. 2004). Using the Pfam database \n(http:\/\/www.sanger.ac.uk\/Software\/Pfam\/; Bateman, et al. 2004) these latter authors \nidentified six structural and functional protein domains specific for the members of \nthe nuclear receptor family, and then identified these in the 62 previously annotated \nhuman, rat or mouse nuclear receptors. Next, the complete genomes of the three \nspecies were examined for these Pfam domains using GENEWISEDB (Birney and \nDurbin 2000). Finally, alignment to the known nuclear receptor family members was \nthen used to complete gene characterization. Using this methodology an additional 82 \ncomplete nuclear receptor genes were identified, along with two decayed aberrant \ngenes sequences and ten pseudogenes. Of the 144 complete genes, 47 were present in \nrats, 49 in mice and 48 in humans; in itself an interesting finding when one considers \n 10\nthe disparity in murine and human CYP number, archetypal nuclear receptor target \ngenes. The ‘missing genes’ in rats are NR1D2 and NR2E3, but their absence may be \nexplained by gaps in the rat genome sequence at the places where they would be \npredicted to occur based upon their location in the mouse genome.  \nExamination of the rate of nucleotide substitutions within the nuclear receptor \nfamily, resulting in either synonymous (Ks) or non-synonymous (Ka) amino acid \nsubstitutions within the translated protein, revealed little species-specific differences, \nsuggesting that for most of the nuclear receptors ligands were unlikely to be species-\nspecific. However, for PXR and CAR Ka\/Ks values were 4.0 and 5.6 times greater \nthan average respectively, suggesting positive selection for ligands; this is perhaps \nunsurprising considering the role of these two nuclear receptors in regulating the \nbody’s ability to respond to external chemicals, exposure to which is often species-\nspecific due to the different diet compositions of these species. Such information must \nalso raise concerns for ADME-testing and species extrapolation; this data confirms \nthe observation first made in CYPs, that the very proteins whose responses we wish to \nstudy\/predict are those that evolve the most rapidly and are therefore the most \nproblematic to predict for. Increased Ka\/Ks rates were also observed for members of \nthe NR0B and NR1H sub-families, although the biological causes\/consequences of \nthis have not yet been elucidated. \nThe examination of the nuclear receptor family has resulted in a number of \nimportant discoveries. First, rapid evolution of members of this family, in particular \nPXR and CAR, demonstrates a strong positive selection, probably driven by the need \nto respond to external stimuli. Indeed, the Chicken Xenobiotic Receptor (CXR) has \ndiverged into the Constitutive Androstane Receptor (CAR, NR1I3) and Pregnane X \nReceptor (PXR, NR1I2) in the space of only 310 million years (Handschin, et al. \n 11\n2000). As a result of this divergence, higher vertebrates, including primates, have \ngained a second receptor targeted toward the capture, interpretation and response to \nexternal stimuli, potentially an important factor in the success of these species in \nsurviving on an omnivorous diet. Second, this evolution has resulted in the same sort \nof redundancy seen in the CYP enzymes, where one chemical may be a ligand for \nseveral receptors (e.g. CAR and PXR) providing a ‘metabolic safety net’ (Xie, et al. \n2000), or where internal control mechanisms (e.g. auto-regulation of PXR expression \nby PXR protein) are present to regulate the biological action of these interactions, thus \npreventing\/reducing negative impacts on cellular homeostasis (Aouabdi, et al. 2006). \nPerhaps the most surprising conclusion from the phylogenetic analysis was the \nancestry of the SHP and DAX1 genes. SHP and DAX1 are the two members of the \nNR0 family of nuclear receptors and are unique in the fact that they do not contain a \nDNA-binding domain (Bavner, et al. 2005). The lack of functional DNA-binding \ncapacity within these two proteins was suggestive of ancient nuclear receptors, from \nwhich the DNA-binding, fully functional family members had evolved (Guo, et al. \n1996). However, this more complete phylogenetic analysis clearly demonstrates that \nthese two latter nuclear receptors evolved from the NR2 branch of the phylogenetic \ntree, rather than acting as the root for the entire tree. During, or closely after the \nemergence of these NR0 family members the DNA-binding domain coding sequence \nappear to have been lost, with rapid sequence evolution following. The biological \nconsequence of nuclear receptors without DNA-binding capacity is now emerging, \nwith both SHP and DAX1 being implicated in the regulation of other nuclear \nreceptors via protein:protein interactions (Bavner, et al. 2005, Niakan and McCabe \n2005). The formation of non-DNA binding heterodimers of SHP\/DAX1 with other \n 12\nnuclear receptors effectively acts as a sink, removing nuclear receptors from the pool \navailable to interact with ligand and\/or DNA, regulating their biological effect. \n \nNew gene discovery \nExpressed Sequence Tag Analysis \nThe advent of high throughput sequence analysis has had two major benefits. As \ndiscussed in the previous section, the first of these is the production of complete \ngenome sequences for a large number of organisms, allowing phylogenetic analysis of \ngene families, providing further insights into their biological roles. The second major \nbenefit is a large increase in the number of expressed sequences available in \ndatabases. These sequences are often multiple repeat sequencing reads of known \ngenes\/transcripts, which can be used to identify sequence variation, as will be \ndiscussed in the next section. However, a large number of these sequences are \nunassigned to any particular gene\/transcript and hence may represent ‘novel’ \nsequences; herein I will discuss how these potentially novel sequences can be further \nexamined.  \nEntire sections of sequence repositories are now devoted to expressed sequence \ntags (ESTs); those sequences are derived from mRNA and which should therefore \nresult in a protein product, but for which no protein product or biological function has \nbeen assigned. It is from this latter pool that the exciting possibility of novel gene \nidentification emerges. Before classifying any EST as a product of a ‘novel gene’ it is \nimportant to note that the majority of ESTs merely represent unassigned transcripts \nand not novel transcripts. Due to technical considerations in transcript \nisolation\/processing and the use of high throughput single-read sequencing, much of \nthe transcript sequence deposited in databases is not full length and biased towards the \n 13\n3’ terminus. Given that the majority of eukaryotic genes produce transcripts with \nuntranslated regions (UTRs) at either extremity, and that the average length of a 3’ \nUTR is 826 bp for humans (Wren, et al. 2000) and \nhttp:\/\/innovation.swmed.edu\/research\/informatics\/res_inf_pom.html), it is perhaps not \nsurprising that the majority of ESTs contain mainly 3’ UTR sequences. As UTRs are \nin general not as well conserved as the coding sequence within a transcript (Wren, et \nal. 2000) identification of any transcript from this sequence may be problematic as \nidentification via orthologues may be inaccurate, particularly for transcripts from \nlarge gene families, such as those associated with ADME. Hence, ESTs often merely \nrepresent 3’ sequences of transcripts that have not been married to their known genes, \nand this can be achieved with relative ease using simple database searching. However, \na number of ESTs do not map to known genes, nor translate to proteins of known \nfunction; these represent transcripts from completely novel genes, and are of \nparticular interest both in understanding the potential biological effects of chemicals, \nbut also for the identification of potential novel therapeutic targets for the treatment of \ndisease. \nTarget Gene Identification \nAn important step in understanding\/predicting how the body responds to chemical \nexposure is the characterisation of what molecular events occur immediately \nfollowing exposure. Such events may be classed as direct (e.g. binding of a nuclear \nreceptor to its target gene) or indirect (e.g. expression of other genes as a result of the \ndirect actions of the chemical), and it is important to separate these two if we are to \nfully understand the molecular responses to chemical stimulation. To understand the \nchronology of response, and hence the mode of action of chemicals it is important to \n 14\nidentify the primary gene targets, with these later being associated with (secondary) \nbiological responses.  \nAn example of such an approach is provided by Horie-Inoue and colleagues, who \nmined the human genome sequence to identify potential binding sites for nuclear \nreceptors involved in hormone homeostasis\/response (Horie-Inoue, et al. 2006). The \nandrogen receptor, glucocorticoid receptor, progesterone receptor and \nmineralocorticoid receptor all bind to an IR3 response element comprised of two \ninverted AGAACA half-sites, separated by three nucleotides. Genome wide scanning \nfor this sequence identified 565 exact matches for this element, and of these 26 were \nwithin 10 Kb of the known transcription start sites for annotated human genes. \nChromosome immunoprecipitation (ChIP) was then used to identify which  nuclear \nreceptors (if any) bound to these sites, revealing 14\/26 to be active. This data shows \nthe potential and limitations of in silico screening; whereas such data mining \nidentified 565 potential binding sites, only 5% were close to known genes and of \nthese only one-half were shown to be bound by a nuclear receptor. Thus, while such \ntechniques can be seen to generate a lot of potential clues, they do not provide the \nanswers – for that wet-lab experiments are a necessity.  \nIt should also be noted that this type of analysis concentrates on perfect matches to \nthe consensus binding site, and will almost certainly miss some functional binding \nsites as nuclear receptors have been clearly demonstrated to bind to sequences \ndivergent from their consensus binding site (Song, et al. 2004, Xie, et al. 2000). This \nis highlighted by the recent work of Steketee and colleagues who, rather than search  \nfor one perfect ‘consensus’ element within a large amount of DNA, searched for \nmany near-perfect elements within a restricted region of DNA (Steketee, et al. 2004). \nUsing this approach these latter authors identified a non-perfect HRE within the first \n 15\nintron of the specifically androgen-regulated gene (SARG), and went on to show that \nthis site was functional via ChIP.  \nHence, it can be seen that a combination of the two previous methods is \nrecommended to provide the most complete coverage for identifying putative \ntranscription factor binding sites – an arduous task given the complexity of the human \ngenome. A potential solution for this problem is the use of phylogenetic \nfingerprinting. Through the use of programs such as rVISTA (Loots and Ovcharenko \n2004, Loots, et al. 2002) and PipMaker (Schwartz, et al. 2000) it is possible to scan \ngenome sequences for areas of conservation across species (Pennacchio and Rubin \n2003). Those regions that show highest conservation usually correspond to genes, \nwith the next most highly conserved regions often representing regulatory elements. \nUsing such an approach Ozyildirim and colleagues recently examined lacrimal gland \ntranscriptomes to identify ‘lacrimal-specific’ transcripts, plus the regulatory elements \nputatively involved in their expression (Ozyildirim, et al. 2005). They were able to \nidentify a number of ‘lacrimal-specific’ transcripts but showed that conservation of \nthe expression and regulation of these specific transcripts between mouse and human \nwas poor; questioning the relevance of currently used murine models of human dry \neye syndromes. \nBiological function identification \nAnother benefit from the large sequence repositories is that there is now a large \namount of data available for transcript expression levels in different tissues and under \ndifferent conditions. With such information it should be possible to identify \ndifferences between, for example, normal and diseased tissue (Mandel, et al. 2003, \nMariadason, et al. 2002) or before and after exposure to a chemical (Natsoulis, et al. \n2005, Rogler, et al. 2004). This would allow the identification of the expression \n 16\nchanges elicited by a stimulus, and through modelling of the pathways affected by \nthese changes insights into the molecular mechanisms of response can be gained. \nMassively parallel signature sequencing (MPSS) is a technique for generating \nlarge numbers of very short sequences very rapidly (Brenner, et al. 2000). These can \nthen be identified through mining of sequence databases to identify longer sequences \nfor which genes\/protein products have been assigned, and the number of tags present \nfor each signal provides a measure of the expression level. The throughput of MPSS \nmeans that all transcripts within a given cell (>200,000) can be sampled very rapidly, \nmeaning that the complete cataloguing of gene expression within cell types\/conditions \nis now possible (Jongeneel, et al. 2005). Chen and colleagues used such an approach \nto first identify 1,056 transcripts predominantly expressed in human testis, and then \ncompared the expression of these genes in normal tissue and testis cell lines. Using \nthis approach they were able to identify 20 cancer\/testis antigen genes, whose \nexpression is linked to the hypomethylation that occurs during cell transformation \n(Feinberg, et al. 2002), including a previously unidentified gene family. Such genes \noffer exciting potential therapeutic targets for the development of antibody-based anti-\ncancer agents.  \n \nSNPs and Splicing: Producing alternate transcripts \nAs previously discussed, the rapid increase in the size of sequence databases is due to \ntwo main driving forces, the sequencing of novel genes\/transcripts\/genomes from \ndisparate species and the repeated sequencing of these targets. The repeat sequencing \nof already ‘known’ sequences is important for two functions: First, it confirms the \naccuracy of a sequencing project, analogous to the requirement to carry out a wet-lab \nexperiment at least twice to confirm the validity\/robustness of conclusions, and \n 17\nsecond, it reveals any variation seen within that sequence that is not due to \nexperimental\/technical error but a true variation seen within the general population. \nThis variation may be due to alternative splicing of identical pre-mRNA transcripts, \nor due to variations within the genome itself; both of these scenarios will be discussed \nin the following sections, along with their potential implications for ADME. \nSplice variants of ADME-related genes \nFollowing the discovery that the human genome contains only approximately 20,000 \ngenes came the realisation that added complexity must be factored in to achieve the \ntotal number of observed proteins in humans, estimated at an order of magnitude \nhigher. A large amount of this variation can be accounted for by the presence of post-\ntranslational modifications such as phosphorylation, which occur to most proteins. \nHowever,  it is becoming increasingly clear that at least some of this increase in \ncomplexity is achieved through the use of alternative splicing, where different  exons \nare spliced  together from the nascent pre-mRNA to form the mature mRNA, \ntranslation of which produces a protein product with the inclusion\/removal of \ndifferent amino acid cassettes (Lareau, et al. 2004). Indeed, it has been estimated that \nmore than half of all human genes are capable of producing alternative splice variants \n(Hanke, et al. 1999). Such splice variants may have a number of roles; for example \nthe tumour necrosis factor receptor gene (TNFR) gives rise to at least ten different \nsplice variants, which may affect factors such as sub-cellular localisation of the \nreceptor (Xing, et al. 2003) or cellular predisposition to apoptosis (Screaton, et al. \n1997). A number of specialist websites have now been developed to provide central \nrepositories for alternate splice variants of genes, some of which are given in Table 3. \n \n[TABLE 3 AROUND HERE] \n 18\n \nAlternative splicing of ADME-related genes is a common phenomenon, with \nexamples existing at the level of drug transporters, nuclear receptors and enzymes. \nThis review will concentrate on splice variants within ADME-related enzymes as \nexamples of both the prediction and biological consequences of alternative splicing. \nN-acetyltransferases are widely expressed enzymes important in the conjugation of \namino and hydroxyl amino groups with acetate, and are responsible for the \nmetabolism of a number of xenobiotics, including the activation of arylamine and \nheterocyclic amine procarcinogens (Gooderham, et al. 2001). In humans, two N-\nacetlytransferase enzymes are present, NAT1 and NAT2, and recent work by Butcher \net al described the genomic organization of the former of these genes, and identifies a \nnumber of splice variants (Butcher, et al. 2005). The NAT1 gene is comprised of nine \nexons, but, unusually, the protein coding region of NAT1 is contained within just a \nsingle exon, with the remaining eight coding for the 5’ untranslated region (UTR). \nExamination of the NCBI EST database identified these non-coding exons and \nsuggested that at least three alternative promoters were involved in the production of \nnine separate splice variants from this gene. As the splice variants alter the non-\ncoding region of the transcript they do not produce proteins with different activities \nbut rather have different translation efficiencies. Butcher et al suggested that the \ndifferential expression of these splice variants throughout the body may go some way \nto explaining the different activity of NAT1 in different organs of the body. \nAn interesting form of alternative splicing seen in a number of ADME-related \ngenes is the use of alternative promoters. Here, transcription may begin at a number of \nalternate first exons within a gene, presumably driven via alternative \nbiological\/xenobiotic stimuli. The resultant pre-mRNA will contain the requisite \n 19\nnumber of conserved exons plus at least one alternate first exon(s): The mature \nmRNA is then generated through the splicing out of any extra first exons. Examples \nof ADME-related genes for which alternative promoters\/first exons play an important \nrole in their biological functioning are the UDP-glucoronosyltransferase (UGT1A) \ngene (Tukey and Strassburg 2000) and the N-acetyltransferase 1 gene (Butcher, et al. \n2005). These two examples demonstrate the different biological affects that \nalternative splicing may cause: In the UGT1A gene, splice variants result in proteins \nwith significantly different catalytic activities, whereas NAT1 splice variants result in \ndifferent levels of protein expression. The UGT1A gene is of particular interest since \nthe protein products generated from four common exons and one, variable, first exon \nare sufficiently different to be termed separate proteins, forming the members of the \nUGT1A-family (Tukey and Strassburg 2000). This is thus an example of how \nalternative splicing can considerably alter the functionality of a protein product, to the \npoint where it can be considered a separate entity rather than just a variant. \nAlternate splicing shows the remarkable flexibility of genomic DNA, in that the \nderivation of protein products from static nucleotide sequences can be manipulated to \nincrease the complexity of the biological system. Not only is this a very elegant \nmethod for increasing the ability of a system to change in response to external \nsituations, be they developmental stage of chemical exposure, but it also allows the \nmaximal variation in protein products to be formed with the minimum changes in \ngenomic DNA: Thus, alternative splicing represents a very elegant method for \nbiological systems to respond to the World in which it lives. \n \nDNA variation in ADME-related genes \n 20\nAlternative splicing may be seen as a consistent form of variation (if such a thing \nexists!) in that it allows all members of a species to produce alternate transcripts, and \ntherefore protein products from a single gene, under different biological conditions. In \ncontrast, genetic polymorphisms are defined as variation in genome sequences within \na population, with not all members of that species having the same sequence. These \nfeatures may be combined, with a polymorphism creating splice variants through the \naddition\/removal of splice donor\/acceptor sites. For example, expression of CYP3A5 \nin humans is varied, with only approximately 25% of American Caucasians \nexpressing a functional protein (Gibson, et al. 2002). This variation is, at least in part, \ncontrolled by a polymorphism that allows the introduction of mini-exons into the \nmature mRNA; as these mini-exons contain stop codons the resultant splice variant \nproduces a truncated protein that is non-functional (Kuehl, et al. 2001).  \nPolymorphisms are a likely source for the well known variation in predisposition \nto disease, and as such much study has been undertaken on examining associations \nbetween genotype status and predisposition to disease. However, due to a large \nnumber of factors (population size\/source screened, environmental considerations etc) \nmany of these studies have failed to show convincing, or reproducible, associations. \nPerhaps the most convincing association to date between a DME and disease \npredisposition is  CYP19 and hyperandrogenism. In comparison to the relatively \nsparse evidence for associations between DME status and disease predisposition, \nmuch evidence exists for the role of DME status and variation in response to \ntherapeutic agents (Table 4 for examples), and this is hence an important research \ntarget, particularly given the increasingly global market for drugs. The ability to \npredict the efficacy, or potential adverse effects, caused by drugs when given to \nindividuals from different genetic backgrounds would be of great benefit, perhaps \n 21\neven heading towards the holy grail of personalised medicine (Vizirianakis 2004). \nHowever, before such a goal can be reached not only must the sources of genetic \nvariation be identified, but their effect on ADME established. \n \n[TABLE 4 AROUND HERE] \n \nAs can be seen from Table 4 even a cursory search of PubMed will reveal a host \nof SNPs associated with altered response to therapeutic agents, resulting in \nloss\/reduced efficacy or an increased risk of adverse effects. However, such \ninformation is not particularly accessible, with the search term largely determining the \ninformation retrieved. To allow more efficient identification of SNPs and their \nbiological function a number of specialized websites have been developed such as \nHGVBase (http:\/\/hgvbase.cgb.ki.se\/; (Fredman, et al. 2002), dbSNP \n(http:\/\/www.ncbi.nlm.nih.gov\/projects\/SNP\/; (Sherry, et al. 1999), SNP Consortium \n(http:\/\/snp.cshl.org\/; (Thorisson and Stein 2003) and HapMap \n(http:\/\/www.hapmap.org; (Consortium 2003), which are fully searchable curated \ndatabases of SNPs. Perhaps the most ambitious of these is HapMap, which aims to \nproduce a freely available resource of the frequency and associations between in \nexcess of one million variants from population deriving from Africa, Asia and \nEurope; the first phase of this project was recently completed, with 269 DNA samples \nfrom diverse ethnic backgrounds analyzed for these SNPs (Consortium 2005). In \naddition to these more specialized databases, general databases such as Gene and \nOMIM (both at http:\/\/www.ncbi.nlm.nih.gov\/), Ensembl (http:\/\/www.ensembl.org; \n(Birney, et al. 2004) ) and GeneCards (http:\/\/bioinformatics.weizmann.ac.il\/cards\/) \ncontain much useful information on a large number of genes, including \n 22\ncommon\/biologically important polymorphisms, with links to relevant literature; as \nsuch they should be the first stop for any researcher wishing to assess the potential \nimpact of polymorphisms on their pet gene. In relation to ADME-related genes it is \nalso worth noting that for CYPs the CYP alleles nomenclature website \n(http:\/\/www.imm.ki.se\/CYPalleles\/) includes details of polymorphisms present within \nthe CYP family of genes, along with biological significance, prevalence and related \nliterature, although this information is limited to human alleles. \n \nSummary \nThe emergence of high throughput sequencing has resulted in a vast increase in the \ninformation available to researchers in their quest to understand human biology. \nGenome sequencing projects provide information on where we have come from, with \nphylogenetic analysis helping scientists to examine the way humans have evolved to \ncope with their biological needs. Large scale sequencing projects have also revealed \nthe large numbers of splice variants used by biological organisms to further increase \nthe complexity of their protein pool, allowing humans to respond to variations in their \npresent environments. Finally, SNP analysis may give some hints as to where we are \ngoing, showing genetic variations that are fixed within the population, and their \neffects on an individual’s disease predisposition or response to therapeutic agents. \n \n 23\nReferences: \nAndo M, Hasegawa Y and Ando Y. 2005. Pharmacogenetics of irinotecan: a promoter \npolymorphism of UGT1A1 gene and severe adverse reactions to irinotecan. \nInvestigations on New Drugs. 23:539-545. \nAouabdi S, Gibson GG and Plant N. 2006. Transcriptional regulation of PXR: \nIdentification of a PPRE within the proximal promoter responsible for fibrate-\nmediated transcriptional activation of PXR. Drug Metabolism and Disposition. \n34:138-144. \nBateman A, Coin L, Durbin R, Finn RD, Hollich V, Griffiths-Jones S, Khanna A, \nMarshall M, Moxon S, Sonnhammer EL, Studholme DJ, Yeats C and Eddy SR. 2004. \nThe Pfam protein families database. Nucleic Acids Research. 32:D138-41. \nBavner A, Sanyal S, Gustafsson JA and Treuter E. 2005. Transcriptional corepression \nby SHP: molecular mechanisms and physiological consequences. Trends in \nEndocrinology and Metabolism. 16:478-488. \nBertilsson L, Dahl ML, Dalen P and Al-Shurbaji A. 2002. Molecular genetics of \nCYP2D6: clinical relevance with focus on psychotropic drugs. British Journal of \nClinical Pharmacology. 53:111-122. \nBirney E, Andrews TD, Bevan P, Caccamo M, Chen Y, Clarke L, Coates G, Cuff J, \nCurwen V, Cutts T, Down T, Eyras E, Fernandez-Suarez XM, Gane P, Gibbins B, \nGilbert J, Hammond M, Hotz H-R, Iyer V, Jekosch K, Kahari A, Kasprzyk A, Keefe \nD, Keenan S, Lehvaslaiho H, McVicker G, Melsopp C, Meidl P, Mongin E, Pettett R, \nPotter S, Proctor G, Rae M, Searle S, Slater G, Smedley D, Smith J, Spooner W, \nStabenau A, Stalker J, Storey R, Ureta-Vidal A, Woodwark KC, Cameron G, Durbin \nR, Cox A, Hubbard T and Clamp M. 2004. An overview of Ensembl. Genome \nResearch. 14:925-926 \n 24\nBirney E and Durbin R. 2000. Using GeneWise in the Drosophila annotation \nexperiment. Genome Research. 10:547-548. \nBrenner S, Johnson M, Bridgham J, Golda G, Lloyd DH, Johnson D, Luo S, McCurdy \nS, Foy M, Ewan M, Roth R, George D, Eletr S, Albrecht G, Vermaas E, Williams SR, \nMoon K, Burcham T, Pallas M, DuBridge RB, Kirchner J, Fearon K, Mao J and \nCorcoran K. 2000. Gene expression analysis by massively parallel signature \nsequencing (MPSS) on microbead arrays. Nature Biotechnology. 18:630-634. \nBurset M, Seledtsov IA and Solovyev VV. 2001. SpliceDB: database of canonical and \nnon-canonical mammalian splice sites. Nucleic Acids Research. 29:255-259. \nButcher NJ, Arulpragasam A, Goh HL, Davey T and Minchin RF. 2005. Genomic \norganization of human arylamine N-acetyltransferase Type I reveals alternative \npromoters that generate different 5'-UTR splice variants with altered translational \nactivities. Biochemical Journal. 387:119-27. \nChantry-Darmon C, Urien C, Hayes H, Bertaud M, Chadi-Taourit S, Chardon P, \nVaiman D and Rogel-Gaillard C. 2005. Construction of a cytogenetically anchored \nmicrosatellite map in rabbit. Mammalian Genome. 16:442-459. \nCollier DA, Stober G, Li T, Heils A, Catalano M, Di Bella D, Arranz MJ, Murray \nRM, Vallada HP, Bengel D, Muller CR, Roberts GW, Smeraldi E, Kirov G, Sham P \nand Lesch KP. 1996. A novel functional polymorphism within the promoter of the \nserotonin transporter gene: possible role in susceptibility to affective disorders. \nMolecular Psychiatry. 1:453-60. \nConsortium HG. 2004. Finishing the euchromatic sequence of the human genome. \nNature. 431:931-945. \nConsortium IH. 2003. The International HapMap project. Nature. 426:789-796 \n 25\nConsortium IH. 2005. A haplotype map of the human genome. Nature. 437:1299-\n1320 \nDai Y, Hebert MF, Isoherranen N, Davis CL, Marsh C, Shen DD and Thummel KE. \n2006. Effect of cyp3a5 polymorphism on tacrolimus metabolic clearance in vitro. \nDrug Metabolism and Disposition. 34:836-847. \nDoddapaneni H, Chakraborty R and Yadav JS. 2005. Genome-wide structural and \nevolutionary analysis of the P450 monooxygenase genes (P450ome) in the white rot \nfungus Phanerochaete chrysosporium: evidence for gene duplications and extensive \ngene clustering. BMC Genomics. 6:92. \nDonald PR, Sirgel FA, Venter A, Parkin DP, Seifart HI, van de Wal BW, Werely C, \nvan Helden PD and Maritz JS. 2004. The influence of human N-acetyltransferase \ngenotype on the early bactericidal activity of isoniazid. Clinical Infection and Disease. \n39:1425-1430.  \nFeinberg AP, Cui H and Ohlsson R. 2002. DNA methylation and genomic imprinting: \ninsights from cancer into epigenetic mechanisms. Seminars in Cancer Biology. \n12:389-398. \nFredman D, Siegfried M, Yuan YP, Bork P, Lehvaslaiho H and Brookes AJ. 2002. \nHGVBase: a human sequence variation database emphasizing data quality and a \nbroad spectrum of data sources. Nucleic Acids Research. 30:387-391. \nFrikke-Schmidt R, Nordestgaard BG, Jensen GB and Tybjaerg-Hansen A. 2004. \nGenetic variation in ABC transporter A1 contributes to HDL cholesterol in the \ngeneral population. Journal of Clinical Investigation. 114:1343-1353. \nFuruta T, Shirai N, Sugimoto M, Nakamura A, Hishida A and Ishizaki T. 2005. \nInfluence of CYP2C19 pharmacogenetic polymorphism on proton pump inhibitor-\nbased therapies. Drug Metabolism and Pharmacokinetics. 20:153-167. \n 26\nGawronska-Szklarz B, Lubinski J, Kladny J, Kurzawski G, Bielicki D, Wojcicki M, \nSych Z and Musial HD. 1999. Polymorphism of GSTM1 gene in patients with \ncolorectal cancer and colonic polyps. Experimental and Toxicologic Pharmacology. \n51:321-5. \nGibbs RA, Weinstock GM, Metzker ML, Muzny DM, Sodergren EJ, Scherer S, Scott \nG, Steffen D, Worley KC, Burch PE, Okwuonu G, Hines S, Lewis L, DeRamo C, \nDelgado O, Dugan-Rocha S, Miner G, Morgan M, Hawes A, Gill R, Celera, Holt RA, \nAdams MD, Amanatides PG, Baden-Tillson H, Barnstead M, Chin S, Evans CA, \nFerriera S, Fosler C, Glodek A, Gu Z, Jennings D, Kraft CL, Nguyen T, Pfannkoch \nCM, Sitter C, Sutton GG, Venter JC, Woodage T, Smith D, Lee HM, Gustafson E, \nCahill P, Kana A, Doucette-Stamm L, Weinstock K, Fechtel K, Weiss RB, Dunn DM, \nGreen ED, Blakesley RW, Bouffard GG, De Jong PJ, Osoegawa K, Zhu B, Marra M, \nSchein J, Bosdet I, Fjell C, Jones S, Krzywinski M, Mathewson C, Siddiqui A, Wye \nN, McPherson J, Zhao S, Fraser CM, Shetty J, Shatsman S, Geer K, Chen Y, \nAbramzon S, Nierman WC, Havlak PH, Chen R, Durbin KJ, Egan A, Ren Y, Song \nXZ, Li B, Liu Y, Qin X, Cawley S, Cooney AJ, D'Souza LM, Martin K, Wu JQ, \nGonzalez-Garay ML, Jackson AR, Kalafus KJ, McLeod MP, Milosavljevic A, Virk \nD, Volkov A, Wheeler DA, Zhang Z, Bailey JA, Eichler EE, Tuzun E, Birney E, \nMongin E, Ureta-Vidal A, Woodwark C, Zdobnov E, Bork P, Suyama M, Torrents D, \nAlexandersson M, Trask BJ, Young JM, Huang H, Wang H, Xing H, Daniels S, \nGietzen D, Schmidt J, Stevens K, Vitt U, Wingrove J, Camara F, Mar Alba M, Abril \nJF, Guigo R, Smit A, Dubchak I, Rubin EM, Couronne O, Poliakov A, Hubner N, \nGanten D, Goesele C, Hummel O, Kreitler T, Lee YA, Monti J, Schulz H, Zimdahl H, \nHimmelbauer H, Lehrach H, Jacob HJ, Bromberg S, Gullings-Handley J, Jensen-\nSeaman MI, Kwitek AE, Lazar J, Pasko D, Tonellato PJ, Twigger S, Ponting CP, \n 27\nDuarte JM, Rice S, Goodstadt L, Beatson SA, Emes RD, Winter EE, Webber C, \nBrandt P, Nyakatura G, Adetobi M, Chiaromonte F, Elnitski L, Eswara P, Hardison \nRC, Hou M, Kolbe D, Makova K, Miller W, Nekrutenko A, Riemer C, Schwartz S, \nTaylor J, Yang S, Zhang Y, Lindpaintner K, Andrews TD, Caccamo M, Clamp M, \nClarke L, Curwen V, Durbin R, Eyras E, Searle SM, Cooper GM, Batzoglou S, \nBrudno M, Sidow A, Stone EA, Payseur BA, Bourque G, Lopez-Otin C, Puente XS, \nChakrabarti K, Chatterji S, Dewey C, Pachter L, Bray N, Yap VB, Caspi A, Tesler G, \nPevzner PA, Haussler D, Roskin KM, Baertsch R, Clawson H, Furey TS, Hinrichs \nAS, Karolchik D, Kent WJ, Rosenbloom KR, Trumbower H, Weirauch M, Cooper \nDN, Stenson PD, Ma B, Brent M, Arumugam M, Shteynberg D, Copley RR, Taylor \nMS, Riethman H, Mudunuri U, Peterson J, Guyer M, Felsenfeld A, Old S, Mockrin S \nand Collins F. 2004. Genome sequence of the Brown Norway rat yields insights into \nmammalian evolution. Nature. 428:493-521. \nGibson G, Plant N, Swales K, Ayrton A and El-Sankary W. 2002. Receptor-\ndependent transcriptional activation of cytochrome P450 3A genes: Induction \nmechanisms, species differences and inter-individual variation in man. Xenobiotica. \n32:165-206 \nGooderham NJ, Murray S, Lynch AM, Yadollahi-Farsani M, Zhao K, Boobis AR and \nDavies DS. 2001. Food-derived heterocyclic amine mutagens: Variable metabolism \nand significance to humans. Drug Metabolism and Disposition. 29:529-534 \nGuo W, Burris TP, Zhang YH, Huang BL, Mason J, Copeland KC, Kupfer SR, Pagon \nRA and McCabe ER. 1996. Genomic sequence of the DAX1 gene: an orphan nuclear \nreceptor responsible for X-linked adrenal hypoplasia congenita and hypogonadotropic \nhypogonadism. Journal of Clinical Endocrinology and Metabolism. 81:2481-2486. \n 28\nHandschin C, Podvinec M and Meyer U. 2000. CXR, a chicken xenobiotic-sensing \norphan nuclear receptor is related to both mammalian pregnane X receptor (PXR) and \nconstitutive androstane receptor (CAR). Proceedings of the National Academy of \nSciences USA. 97:10769-10774 \nHanke J, Brett D, Zastrow I, Aydin A, Delbruck S, Lehmann G, Luft F, Reich J and \nBork P. 1999. Alternative Splicing of human genes: more the rule than the exception? \nTrends in Genetics. 15:389-390 \nHorie-Inoue K, Takayama K, Bono HU, Ouchi Y, Okazaki Y and Inoue S. 2006. \nIdentification of novel steroid target genes through the combination of bioinformatics \nand functional analysis of hormone response elements. Biochemical and Biophysical \nResearch Communications. 339:99-106. \nHuang HD, Horng JT, Lee CC and Liu BJ. 2003. ProSplicer: a database of putative \nalternative splicing information derived from protein, mRNA and expressed sequence \ntag sequence data. Genome Biology. 4:R29 \nHughes DA, Vilar FJ, Ward CC, Alfirevic A, Park BK and Pirmohamed M. 2004. \nCost-effectiveness analysis of HLA B*5701 genotyping in preventing abacavir \nhypersensitivity. Pharmacogenetics. 14:335-42. \nJongeneel CV, Delorenzi M, Iseli C, Zhou D, Haudenschild CD, Khrebtukova I, \nKuznetsov D, Stevenson BJ, Strausberg RL, Simpson AJ and Vasicek TJ. 2005. An \natlas of human gene expression from massively parallel signature sequencing \n(MPSS). Genome Research. 15:1007-1014. \nJun JB, Cho DY, Kang C and Bae SC. 2005. Thiopurine S-methyltransferase \npolymorphisms and the relationship between the mutant alleles and the adverse \neffects in systemic lupus erythematosus patients taking azathioprine. Clinical and \nExperimental Rheumatology. 23:873-976. \n 29\nKirchheiner J and Brockmoller J. 2005. Clinical consequences of cytochrome P450 \n2C9 polymorphisms. Clinical Pharmacology and Therapeutics. 77:1-16. \nKuehl P, Zhang J, Lin Y, Lanba J, Assem M, Scheutz J, Watkins P, Daly A, Wrighton \nS, Hall S, Maurel P, Relling M, Brimer C, Yasuda K, Venkataramanan R, Strom S, \nThummel K, Boguski M and Schuetz E. 2001. Sequence diversity in CYP3A \npromoters and characterisation of the genetic basis of polymorphic CYP3A5 \nexpression. Nature Genetics. 27:383-391 \nKumar S and Hedges SB. 1998. A molecular timescale for vertebrate evolution. \nNature. 392:917-20. \nLander ES, Linton LM, Birren B, Nusbaum C, Zody MC, Baldwin J, Devon K, \nDewar K, Doyle M, FitzHugh W, Funke R, Gage D, Harris K, Heaford A, Howland J, \nKann L, Lehoczky J, LeVine R, McEwan P, McKernan K, Meldrim J, Mesirov JP, \nMiranda C, Morris W, Naylor J, Raymond C, Rosetti M, Santos R, Sheridan A, \nSougnez C, Stange-Thomann N, Stojanovic N, Subramanian A, Wyman D, Rogers J, \nSulston J, Ainscough R, Beck S, Bentley D, Burton J, Clee C, Carter N, Coulson A, \nDeadman R, Deloukas P, Dunham A, Dunham I, Durbin R, French L, Grafham D, \nGregory S, Hubbard T, Humphray S, Hunt A, Jones M, Lloyd C, McMurray A, \nMatthews L, Mercer S, Milne S, Mullikin JC, Mungall A, Plumb R, Ross M, \nShownkeen R, Sims S, Waterston RH, Wilson RK, Hillier LW, McPherson JD, Marra \nMA, Mardis ER, Fulton LA, Chinwalla AT, Pepin KH, Gish WR, Chissoe SL, Wendl \nMC, Delehaunty KD, Miner TL, Delehaunty A, Kramer JB, Cook LL, Fulton RS, \nJohnson DL, Minx PJ, Clifton SW, Hawkins T, Branscomb E, Predki P, Richardson \nP, Wenning S, Slezak T, Doggett N, Cheng JF, Olsen A, Lucas S, Elkin C, \nUberbacher E, Frazier M, Gibbs RA, Muzny DM, Scherer SE, Bouck JB, Sodergren \nEJ, Worley KC, Rives CM, Gorrell JH, Metzker ML, Naylor SL, Kucherlapati RS, \n 30\nNelson DL, Weinstock GM, Sakaki Y, Fujiyama A, Hattori M, Yada T, Toyoda A, \nItoh T, Kawagoe C, Watanabe H, Totoki Y, Taylor T, Weissenbach J, Heilig R, \nSaurin W, Artiguenave F, Brottier P, Bruls T, Pelletier E, Robert C, Wincker P, \nRosenthal A, Platzer M, Nyakatura G, Taudien S, Rump A, Yang HM, Yu J, Wang J, \nHuang GY, Gu J, Hood L, Rowen L, Madan A, Qin SZ, Davis RW, Federspiel NA, \nAbola AP, Proctor MJ, Myers RM, Schmutz J, Dickson M, Grimwood J, Cox DR, \nOlson MV, Kaul R, Shimizu N, Kawasaki K, Minoshima S, Evans GA, Athanasiou \nM, Schultz R, Roe BA, Chen F, Pan HQ, Ramser J, Lehrach H, Reinhardt R, \nMcCombie WR, de la Bastide M, Dedhia N, Blocker H, Hornischer K, Nordsiek G, \nAgarwala R, Aravind L, Bailey JA, Bateman A, Batzoglou S, Birney E, Bork P, \nBrown DG, Burge CB, Cerutti L, Chen HC, Church D, Clamp M, Copley RR, Doerks \nT, Eddy SR, Eichler EE, Furey TS, Galagan J, Gilbert JGR, Harmon C, Hayashizaki \nY, Haussler D, Hermjakob H, Hokamp K, Jang WH, Johnson LS, Jones TA, Kasif S, \nKaspryzk A, Kennedy S, Kent WJ, Kitts P, Koonin EV, Korf I, Kulp D, Lancet D, \nLowe TM, McLysaght A, Mikkelsen T, Moran JV, Mulder N, Pollara VJ, Ponting \nCP, Schuler G, Schultz JR, Slater G, Smit AFA, Stupka E, Szustakowki J, Thierry-\nMieg D, Thierry-Mieg J, Wagner L, Wallis J, Wheeler R, Williams A, Wolf YI, \nWolfe KH, Yang SP, Yeh RF, Collins F, Guyer MS, Peterson J, Felsenfeld A, \nWetterstrand KA, Patrinos A and Morgan MJ. 2001. Initial sequencing and analysis \nof the human genome. Nature. 409:860-921 \nLareau LF, Green RE, Bhatnagar RS and Brenner SE. 2004. The evolving roles of \nalternative splicing. Current Opinion in Structural Biology. 14:273-282. \nLee C, Atanelov L, Modrek B and Xing Y. 2003. ASAP: the Alternative Splicing \nAnnotation Project. Nucleic Acids Research. 31:101-105. \n 31\nLim YP, Liu CH, Shyu LJ and Huang JD. 2005. Functional characterization of a \nnovel polymorphism of pregnane X receptor, Q158K, in Chinese subjects. \nPharmacogenetics and Genomics. 15:337-341. \nLindblad-Toh K, Wade CM, Mikkelsen TS, Karlsson EK, Jaffe DB, Kamal M, Clamp \nM, Chang JL, Kulbokas EJ, 3rd, Zody MC, Mauceli E, Xie X, Breen M, Wayne RK, \nOstrander EA, Ponting CP, Galibert F, Smith DR, DeJong PJ, Kirkness E, Alvarez P, \nBiagi T, Brockman W, Butler J, Chin CW, Cook A, Cuff J, Daly MJ, DeCaprio D, \nGnerre S, Grabherr M, Kellis M, Kleber M, Bardeleben C, Goodstadt L, Heger A, \nHitte C, Kim L, Koepfli KP, Parker HG, Pollinger JP, Searle SM, Sutter NB, Thomas \nR, Webber C, Baldwin J, Abebe A, Abouelleil A, Aftuck L, Ait-Zahra M, Aldredge T, \nAllen N, An P, Anderson S, Antoine C, Arachchi H, Aslam A, Ayotte L, Bachantsang \nP, Barry A, Bayul T, Benamara M, Berlin A, Bessette D, Blitshteyn B, Bloom T, Blye \nJ, Boguslavskiy L, Bonnet C, Boukhgalter B, Brown A, Cahill P, Calixte N, Camarata \nJ, Cheshatsang Y, Chu J, Citroen M, Collymore A, Cooke P, Dawoe T, Daza R, \nDecktor K, DeGray S, Dhargay N, Dooley K, Dooley K, Dorje P, Dorjee K, Dorris L, \nDuffey N, Dupes A, Egbiremolen O, Elong R, Falk J, Farina A, Faro S, Ferguson D, \nFerreira P, Fisher S, FitzGerald M, Foley K, Foley C, Franke A, Friedrich D, Gage D, \nGarber M, Gearin G, Giannoukos G, Goode T, Goyette A, Graham J, Grandbois E, \nGyaltsen K, Hafez N, Hagopian D, Hagos B, Hall J, Healy C, Hegarty R, Honan T, \nHorn A, Houde N, Hughes L, Hunnicutt L, Husby M, Jester B, Jones C, Kamat A, \nKanga B, Kells C, Khazanovich D, Kieu AC, Kisner P, Kumar M, Lance K, Landers \nT, Lara M, Lee W, Leger JP, Lennon N, Leuper L, LeVine S, Liu J, Liu X, \nLokyitsang Y, Lokyitsang T, Lui A, Macdonald J, Major J, Marabella R, Maru K, \nMatthews C, McDonough S, Mehta T, Meldrim J, Melnikov A, Meneus L, Mihalev \nA, Mihova T, Miller K, Mittelman R, Mlenga V, Mulrain L, Munson G, Navidi A, \n 32\nNaylor J, Nguyen T, Nguyen N, Nguyen C, Nguyen T, Nicol R, Norbu N, Norbu C, \nNovod N, Nyima T, Olandt P, O'Neill B, O'Neill K, Osman S, Oyono L, Patti C, \nPerrin D, Phunkhang P, Pierre F, Priest M, Rachupka A, Raghuraman S, Rameau R, \nRay V, Raymond C, Rege F, Rise C, Rogers J, Rogov P, Sahalie J, Settipalli S, \nSharpe T, Shea T, Sheehan M, Sherpa N, Shi J, Shih D, Sloan J, Smith C, Sparrow T, \nStalker J, Stange-Thomann N, Stavropoulos S, Stone C, Stone S, Sykes S, Tchuinga \nP, Tenzing P, Tesfaye S, Thoulutsang D, Thoulutsang Y, Topham K, Topping I, \nTsamla T, Vassiliev H, Venkataraman V, Vo A, Wangchuk T, Wangdi T, Weiand M, \nWilkinson J, Wilson A, Yadav S, Yang S, Yang X, Young G, Yu Q, Zainoun J, \nZembek L, Zimmer A and Lander ES. 2005. Genome sequence, comparative analysis \nand haplotype structure of the domestic dog. Nature. 438:803-819. \nLoots GG and Ovcharenko I. 2004. rVISTA 2.0: evolutionary analysis of transcription \nfactor binding sites. Nucleic Acids Research. 32:W217-221. \nLoots GG, Ovcharenko I, Pachter L, Dubchak I and Rubin EM. 2002. rVista for \ncomparative sequence-based discovery of functional transcription factor binding sites. \nGenome Research. 12:832-839. \nMandel S, Weinreb O and Youdim MB. 2003. Using cDNA microarray to assess \nParkinson's disease models and the effects of neuroprotective drugs. Trends in \nPharmacological Sciences. 24:184-91. \nMariadason JM, Arango D, Corner GA, Aranes MJ, Hotchkiss KA, Yang W and \nAugenlicht LH. 2002. A gene expression profile that defines colon cell maturation in \nvitro. Cancer Research. 62:4791-804. \nMurata M, Watanabe M, Yamanaka M, Kubota Y, Ito H, Nagao M, Katoh T, \nKamataki T, Kawamura J, Yatani R and Shiraishi T. 2001. Genetic polymorphisms in \ncytochrome P450 (CYP) 1A1, CYP1A2, CYP2E1, glutathione S-transferase (GST) \n 33\nM1 and GSTT1 and susceptibility to prostate cancer in the Japanese population. \nCancer Letters. 165:171-177 \nNatsoulis G, El Ghaoui L, Lanckriet GR, Tolley AM, Leroy F, Dunlea S, Eynon BP, \nPearson CI, Tugendreich S and Jarnagin K. 2005. Classification of a large microarray \ndata set: algorithm comparison and analysis of drug signatures. Genome Research. \n15:724-736. \nNebert DW and Gonzalez FJ. 1987. P450 genes: structure, evolution, and regulation. \nAnnual Review of Biochemistry. 56:945-993. \nNelson DR. 2002. Mining databases for cytochrome P450 genes. Methods in \nEnzymology. 357:3-15. \nNelson DR. 2003. Comparison of P450s from human and fugu: 420 million years of \nvertebrate P450 evolution. Archives of Biochemistry and Biophysics. 409:18-24. \nNelson DR. 2005. Gene nomenclature by default, or BLASTing to Babel. Human \nGenomics. 2:196-201. \nNelson DR, Koymans L, Kamataki T, Stegeman JJ, Feyereisen R, Waxman DJ, \nWaterman MR, Gotoh O, Coon MJ, Estabrook RW, Gunsalus IC and Nebert DW. \n1996. P450 superfamily: Update on new sequences, gene mapping, accession \nnumbers and nomenclature. Pharmacogenetics. 6:1-42 \nNelson DR, Schuler MA, Paquette SM, Werck-Reichhart D and Bak S. 2004. \nComparative genomics of rice and Arabidopsis. Analysis of 727 cytochrome P450 \ngenes and pseudogenes from a monocot and a dicot. Plant Physiology. 135:756-772. \nNeuhaus T, Ko YD, Lorenzen K, Fronhoffs S, Harth V, Brode P, Vetter H, Bolt HM, \nPesch B and Bruning T. 2004. Association of cytochrome P450 2E1 polymorphisms \nand head and neck squamous cell cancer. Toxicology Letters. 151:273-282. \n 34\nNiakan KK and McCabe ER. 2005. DAX1 origin, function, and novel role. Molecular \nGenetics and Metabolism. 86:70-83. \nNiemi M, Backman JT, Kajosaari LI, Leathart JB, Neuvonen M, Daly AK, \nEichelbaum M, Kivisto KT and Neuvonen PJ. 2005. Polymorphic organic anion \ntransporting polypeptide 1B1 is a major determinant of repaglinide pharmacokinetics. \nClinical Pharmacology and Therapeutics. 77:468-478. \nNiemi M, Schaeffeler E, Lang T, Fromm MF, Neuvonen M, Kyrklund C, Backman \nJT, Kerb R, Schwab M, Neuvonen PJ, Eichelbaum M and Kivisto KT. 2004. High \nplasma pravastatin concentrations are associated with single nucleotide \npolymorphisms and haplotypes of organic anion transporting polypeptide-C (OATP-\nC, SLCO1B1). Pharmacogenetics. 14:429-440. \nOzyildirim AM, Wistow GJ, Gao J, Wang J, Dickinson DP, Frierson HF, Jr. and \nLaurie GW. 2005. The lacrimal gland transcriptome is an unusually rich source of \nrare and poorly characterized gene transcripts. Investigations in Ophthalmology and \nVisual Science. 46:1572-1580. \nPennacchio LA and Rubin EM. 2003. Comparative genomic tools and database: \nProviding insights into the human genome. Journal of Clinical Investigation. \n111:1099-1106 \nPetry CJ, Ong KK, Michelmore KF, Artigas S, Wingate DL, Balen AH, de Zegher F, \nIbanez L and Dunger DB. 2005. Association of aromatase (CYP 19) gene variation \nwith features of hyperandrogenism in two populations of young women. Human \nReprodroduction. 20:1837-1843.  \nRebbeck. 1999. Modification of clinical presentation of prostate tumors by a novel \ngenetic variant in CYP3A4 (vol 90, pg 1225 1998). Journal of the National Cancer \nInstitute. 91:1082 \n 35\nRogler CE, Tchaikovskaya T, Norel R, Massimi A, Plescia C, Rubashevsky E, Siebert \nP and Rogler LE. 2004. RNA expression microarrays (REMs), a high-throughput \nmethod to measure differences in gene expression in diverse biological samples. \nNucleic Acids Research. 32:e120. \nSachse C, Brochmoller J, Bauer S and Roots I. 1999. Functional significance of a C -\n> A polymorphism in intron I of the cytochrome P450 CYP1A2 gene tested with \ncaffeine. British Journal of Clinical Pharmacology. 47:445-449 \nSaitoh A, Singh KK, Powell CA, Fenton T, Fletcher CV, Brundage R, Starr S and \nSpector SA. 2005. An MDR1-3435 variant is associated with higher plasma nelfinavir \nlevels and more rapid virologic response in HIV-1 infected children. AIDS. 19:371-\n80. \nSchwartz S, Zhang Z, Frazer KA, Smit A, Riemer C, Bouck J, Gibbs R, Hardison R \nand Miller W. 2000. PipMaker--a web server for aligning two genomic DNA \nsequences. Genome Research. 10:577-586. \nScreaton GR, Xu XN, Olsen AL, Cowper AE, Tan R, McMichael AJ and Bell JI. \n1997. LARD: a new lymphoid-specific death domain containing receptor regulated by \nalternative pre-mRNA splicing. Proceedings of the National Academy of Science \nUSA. 94:4615-4619. \nSherry ST, Ward M and Sirotkin K. 1999. dbSNP-database for single nucleotide \npolymorphisms and other classes of minor genetic variation. Genome Research. \n9:677-679. \nSong X, Xie M, Zhang H, Li Y, Sachdeva K and Yan B. 2004. The pregnane X \nreceptor binds to response elements in a genomic context-dependent manner, and \nPXR activator rifampicin selectively alters the binding among target genes. Drug \nMetabolism and Disposition. 32:35-42. \n 36\nSpiecker M, Darius H, Hankeln T, Soufi M, Sattler AM, Schaefer JR, Node K, Borgel \nJ, Mugge A, Lindpaintner K, Huesing A, Maisch B, Zeldin DC and Liao JK. 2004. \nRisk of coronary artery disease associated with polymorphism of the cytochrome \nP450 epoxygenase CYP2J2. Circulation. 110:2132-6. Epub 2004 Oct 4. \nSteketee K, Ziel-van der Made AC, van der Korput HA, Houtsmuller AB and \nTrapman J. 2004. A bioinformatics-based functional analysis shows that the \nspecifically androgen-regulated gene SARG contains an active direct repeat androgen \nresponse element in the first intron. Journal of Molecular Endocrinology. 33:477-491. \nThanaraj TA, Stamm S, Clark F, Riethoven JJ, Le Texier V and Muilu J. 2004. ASD: \nthe Alternative Splicing Database. Nucleic Acids Research. 32:D64-69. \nThorisson GA and Stein LD. 2003. The SNP Consortium website: past, present and \nfuture. Nucleic Acids Research. 31:124-127. \nTukey RH and Strassburg CP. 2000. Human UDP-glucuronosyltransferases: \nmetabolism, expression, and disease. Annu Rev Pharmacol Toxicol. 40:581-616. \nVizirianakis IS. 2004. Challenges in current drug delivery from the potential \napplication of pharmacogenomics and personalized medicine in clinical practice. \nCurrent Drug Delivery. 1:73-80. \nWang Y, O'Brate A, Zhou W and Giannakakou P. 2005. Resistance to microtubule-\nstabilizing drugs involves two events: beta-tubulin mutation in one allele followed by \nloss of the second allele. Cell Cycle. 4:1847-1853.  \nWang Z, Chen Y and Li Y. 2004. A brief review of computational gene prediction \nmethods. Genomics Proteomics Bioinformatics. 2:216-221. \nWaterston RH, Lindblad-Toh K, Birney E, Rogers J, Abril JF, Agarwal P, Agarwala \nR, Ainscough R, Alexandersson M, An P, Antonarakis SE, Attwood J, Baertsch R, \nBailey J, Barlow K, Beck S, Berry E, Birren B, Bloom T, Bork P, Botcherby M, Bray \n 37\nN, Brent MR, Brown DG, Brown SD, Bult C, Burton J, Butler J, Campbell RD, \nCarninci P, Cawley S, Chiaromonte F, Chinwalla AT, Church DM, Clamp M, Clee C, \nCollins FS, Cook LL, Copley RR, Coulson A, Couronne O, Cuff J, Curwen V, Cutts \nT, Daly M, David R, Davies J, Delehaunty KD, Deri J, Dermitzakis ET, Dewey C, \nDickens NJ, Diekhans M, Dodge S, Dubchak I, Dunn DM, Eddy SR, Elnitski L, Emes \nRD, Eswara P, Eyras E, Felsenfeld A, Fewell GA, Flicek P, Foley K, Frankel WN, \nFulton LA, Fulton RS, Furey TS, Gage D, Gibbs RA, Glusman G, Gnerre S, Goldman \nN, Goodstadt L, Grafham D, Graves TA, Green ED, Gregory S, Guigo R, Guyer M, \nHardison RC, Haussler D, Hayashizaki Y, Hillier LW, Hinrichs A, Hlavina W, Holzer \nT, Hsu F, Hua A, Hubbard T, Hunt A, Jackson I, Jaffe DB, Johnson LS, Jones M, \nJones TA, Joy A, Kamal M, Karlsson EK, Karolchik D, Kasprzyk A, Kawai J, \nKeibler E, Kells C, Kent WJ, Kirby A, Kolbe DL, Korf I, Kucherlapati RS, Kulbokas \nEJ, Kulp D, Landers T, Leger JP, Leonard S, Letunic I, Levine R, Li J, Li M, Lloyd \nC, Lucas S, Ma B, Maglott DR, Mardis ER, Matthews L, Mauceli E, Mayer JH, \nMcCarthy M, McCombie WR, McLaren S, McLay K, McPherson JD, Meldrim J, \nMeredith B, Mesirov JP, Miller W, Miner TL, Mongin E, Montgomery KT, Morgan \nM, Mott R, Mullikin JC, Muzny DM, Nash WE, Nelson JO, Nhan MN, Nicol R, Ning \nZ, Nusbaum C, O'Connor MJ, Okazaki Y, Oliver K, Larty EO, Pachter L, Parra G, \nPepin KH, Peterson J, Pevzner P, Plumb R, Pohl CS, Poliakov A, Ponce TC, Ponting \nCP, Potter S, Quail M, Reymond A, Roe BA, Roskin KM, Rubin EM, Rust AG, \nSantos R, Sapojnikov V, Schultz B, Schultz J, Schwartz MS, Schwartz S, Scott C, \nSeaman S, Searle S, Sharpe T, Sheridan A, Shownkeen R, Sims S, Singer JB, Slater \nG, Smit A, Smith DR, Spencer B, Stabenau A, Strange-Thomann NS, Sugnet C, \nSuyama M, Tesler G, Thompson J, Torrents D, Trevaskis E, Tromp J, Ucla C, Vidal \nAU, Vinson JP, von Niederhausern AC, Wade CM, Wall M, Weber RJ, Weiss RB, \n 38\nWendl MC, West AP, Wetterstrand K, Wheeler R, Whelan S, Wierzbowski J, Willey \nD, Williams S, Wilson RK, Winter E, Worley KC, Wyman D, Yang S, Yang SP, \nZdobnov EM, Zody MC and Lander ES. 2002. Initial sequencing and comparative \nanalysis of the mouse genome. Nature. 420:520-562 \nWerck-Reichhart D and Feyereisen R. 2000. Cytochromes P450: a success story. \nGenome Biology. 1:REVIEWS3003. Epub 2000 Dec 8. \nWren JD, Forgacs E, Fondon JWr, Pertsemlidis A, Cheng S, Gallardo T, Williams \nRS, Shohet RV, Minna JD and Garner HR. 2000. Repeat polymorphisms within gene \nregions: Phenotypic and evolutionary implications. American Journal of Human \nGenetics. 67:345-356. \nXie W, Barwick JL, Simmon CM, Pierce AM, Safe S, Blumberg B, Guzelian PS and \nEvans RM. 2000. Reciprocal activation of xenobiotic response genes by nuclear \nreceptors SXR\/PXR and CAR. Genes and Development. 14:3014-3023 \nXing Y, Xu Q and Lee C. 2003. Widespread production of novel soluble protein \nisoforms by alternative splicing removal of transmembrane anchoring domains. FEBS \nLetters. 555:572-578. \nZhang H, Ahmadi A, Arbman G, Zdolsek J, Carstensen J, Nordenskjold B, Soderkvist \nP and Sun XF. 1999. Glutathione S-transferase T1 and M1 genotypes in normal \nmucosa, transitional mucosa and colorectal adenocarcinoma. International Journal of \nCancer. 84:135-8. \nZhang Z, Burch PE, Cooney AJ, Lanz RB, Pereira FA, Wu J, Gibbs RA, Weinstock G \nand Wheeler DA. 2004. Genomic analysis of the nuclear receptor family: new insights \ninto structure, regulation, and evolution from the rat genome. Genome Research. \n14:580-90. \n \n \n 39\n \nGroup Number of Sequencing Projects \nBacteria 472 \nFungi  508 \nPlants 1740 \nLower Eukaryotes 203 \nAnimals 1581 \nTOTAL 4504 \n \nTable 1: Current genome sequencing projects \n(Data sourced from NCBI March 2006)\n 40\n \nOrder Species Genome Status Reference \nPrimates Human Complete. \nBuild 35.1 \n(Lander, et al. 2001) \nPrimates Marmoset In Progress N\/A \nCarnivora Dog Complete \nBuild 2.1 \n(Lindblad-Toh, et al. 2005) \nLagomorpha Rabbit Microsatellite map (Chantry-Darmon, et al. 2005) \nRodentia Rat Complete. \nBuild 3.1 \n(Gibbs, et al. 2004) \nRodentia Mouse Complete. \nBuild 35.1 \n(Waterston, et al. 2002) \nRodentia Hamster Not Started N\/A \n \nTable 2: Status of whole genome sequencing projects in ADME-relevant \nmammalian species.\n Database URL Description Reference \nAlternative Splicing \nDatabase (ASDB) \nhttp:\/\/www.ebi.ac.uk\/asd\/ Splice variants from annotated genes for human (Thanaraj, et al. \n2004) \nAlternative Splicing \nAnnotation Project  \nhttp:\/\/bioinfo.mbi.ucla.edu\/ASAP\/ EST based splice variant prediction with tissue \ninformation \n(Lee, et al. 2003) \nProSplicer http:\/\/prosplicer.mbc.nctu.edu.tw\/ Putative alternative splice variant database for human (Huang, et al. 2003) \nSpliceDB http:\/\/www.softberry.com\/berry.phtml Canonical and non-canonical splice sites in mammals (Burset, et al. 2001) \n \n \nTable 3: Alternative Splice Variant Databases\n Gene with \nSNPs \nDisease State Reference \nCYP19 Hyperandrogenism (Petry, et al. 2005) \nCYP2E1 Head\/neck squamous cell cancer (Neuhaus, et al. 2004) \nCYP2J2 Coronary Heart Disease (Spiecker, et al. 2004) \nCYP1A1  Prostate Cancer (Murata, et al. 2001) \nCYP3A4 Prostate Cancer (Rebbeck 1999) \nGSTM1 Colorectal cancer (Gawronska-Szklarz, et al. 1999) \nGSTT1 Colorectal cancer (Zhang, et al. 1999) \nSerotonin \nTransporter \nAffective Disorder (Collier, et al. 1996) \nABCA1 Coronary heart disease (Frikke-Schmidt, et al. 2004) \n \nTable 4: Human SNPs associated with an increased predisposition to disease \nstates \n 43\n \nGene with \nSNP \nDrug Effected  Reference \nCYP1A2 Caffeine (Sachse, et al. 1999) \nCYP2C9 Warfarin (Kirchheiner and Brockmoller 2005) \nCY2C19 Omeprazole (Furuta, et al. 2005) \nCYP2D6 Psychotropic Drugs (Bertilsson, et al. 2002) \nCYP3A5 Tacrolimus (Dai, et al. 2006) \nNAT2 Isoniazid (Donald, et al. 2004) \nTMPT Azothioprine (Jun, et al. 2005) \nUGT1A1 Irinotecan (Ando, et al. 2005) \nMDR1 Nelfinavir (Saitoh, et al. 2005) \nOATP2 Pravastatin, Repaglinide (Niemi, et al. 2005, Niemi, et al. 2004) \nPXR Rifampicn and Paclitaxel (Lim, et al. 2005) \nHLA B Abacavir (Hughes, et al. 2004) \nβ-tubulin Taxol\/Epothilones (Wang, et al. 2005) \n \nTable 4: Human SNPs associated with altered response to therapeutic agents \n"}