{"doi":"10.1080\/0968776020100112","coreId":"6372","oai":"oai:generic.eprints.org:374\/core5","identifiers":["oai:generic.eprints.org:374\/core5","10.1080\/0968776020100112"],"title":"Reviews","authors":["Barker, Philip","Fowell, Sue","Funnell, Peter","Ingraham, Bruce","Mogey, Nora","Goodison, Terry","O'Donoghue, John"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002","abstract":"Alan Clarke, Designing Computer‐Based Learning Materials, Aldershot: Gower, 2001. ISBN: 0–566–08320–5. Hardback, xviii+196 pages, £45.00","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/6372.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/374\/1\/ALT_J_Vol10_No1_2002_Reviews.pdf","pdfHashValue":"c8679bdc82934861860ed588abdb7af8b9bfdbd3","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:374<\/identifier><datestamp>\n      2011-04-04T09:12:18Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/374\/<\/dc:relation><dc:title>\n        Reviews<\/dc:title><dc:creator>\n        Barker, Philip<\/dc:creator><dc:creator>\n        Fowell, Sue<\/dc:creator><dc:creator>\n        Funnell, Peter<\/dc:creator><dc:creator>\n        Ingraham, Bruce<\/dc:creator><dc:creator>\n        Mogey, Nora<\/dc:creator><dc:creator>\n        Goodison, Terry<\/dc:creator><dc:creator>\n        O'Donoghue, John<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Alan Clarke, Designing Computer‐Based Learning Materials, Aldershot: Gower, 2001. ISBN: 0–566–08320–5. Hardback, xviii+196 pages, £45.00.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2002<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/374\/1\/ALT_J_Vol10_No1_2002_Reviews.pdf<\/dc:identifier><dc:identifier>\n          Barker, Philip and Fowell, Sue and Funnell, Peter and Ingraham, Bruce and Mogey, Nora and Goodison, Terry and O'Donoghue, John  (2002) Reviews.  Association for Learning Technology Journal, 10 (1).  pp. 90-97.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776020100112<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/374\/","10.1080\/0968776020100112"],"year":2002,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Reviews\nedited by Philip Barker\nAlan Clarke, Designing Computer-Based Learn-\ning Materials, Aldershot: Gower, 2001. ISBN:\n0-566-08320-5. Hardback, xviii+196 pages,\n£45.00.\nThe utility of computers as learning resources is\nnow well established. They can be used as stand-\nalone devices to explore various localized\nphenomena or they can be networked together to\nfacilitate the creation of global learning com-\nmunities. Between these two extremes, a variety of\npossibilities exist for using computer and\ncommunications technologies for the support of\nteaching and learning processes. More often than\nnot, some form of courseware material will\nusually be needed to facilitate these pedagogic\napplications of computers. The creation of this\neducational software is no simple task and, if it is\nto be effective, requires careful design. This book\nby Alan Clarke discusses some of the important\nissues that need to be considered when designing\ncomputer-based learning (CBL) materials for use\nin different contexts.\nThe material in the book is organized into three\nbasic sections. The early chapters in the book (1\nto 4) make up the first of these. They cover some\nof the more fundamental issues of CBL. They\ndeal, for example, with the nature of interaction\nand learning, communication styles, types of\ncomputer-based learning material and assess-\nment methods. The second part of the book,\n(chapters 5 to 8) deal with the 'primitive' types of\nresource and techniques that designers might use\nto create a learning product. The topics covered\ninclude the use of text, colour, graphics and\n90\nmultimedia. Alan Clarke is well known for his\nextensive work on 'screen design for computer-\nbased learning'. Needless to say, this work\nfigures prominently in this second section of the\nbook - and also in the third part (chapters 9 to\n12). The latter chapters of the book are less\n'media-orientated' than the previous ones and\nare devoted to some of the more interesting\ndesign issues. The topics covered in these\nchapters include designing for online learning,\nscreen layout, content, and evaluation. I enjoyed\nreading them all. However, the chapter on\nevaluation is the shortest and, in my view, the\none that is covered in least depth.\nAlthough this book is well written and easy to\nread, there are a few minor spelling and\/or\ntypographical errors. For example, the section of\nthe 'Periodic Table' given on page 90 includes the\nmetal calcium (Ca) both in the alkali metals\n(Group I) and in the alkaline earth metals (Group\nII). This confusion arises because the atomic\nsymbol for cesium is Cs and not Ca! Obviously, a\nsimple typographical error? Similarly, the symbol\nfor the element zirconium is Zr (and not Ze) and\nthe element with atomic number 104 is\nrutherfordium (Rf). Of course, simple errors of\nthis sort reflect the need (especially within CBL)\nfor sound proof-reading and the use of subject-\nmatter experts (a topic that is not extensively\ncovered in this book - although reference to\n'subject expertise' is fleetingly made in a few\nplaces in Chapter 11).\nThe only major shortcoming of the book is the\nabsence of any reference section and any useful\nAlt-J Volume 10 Number I\ncitations to the very large volume of related liter-\nature that is now available on designing and\nproducing CBL materials. A 'selected biblio-\ngraphy' would therefore have been a useful addi-\ntion to this otherwise outstanding book.\nUnfortunately, within the 12 chapters that make\nup this volume, there is only one (rather dated -\n1987) reference. This appears at the end of\nchapter 7 (the 'graphics' chapter). As well as the\ndistinct lack of references to conventional\nliterature sources, there are also very few Web\nreferences - three in total! One of these (the\nGower Web page) appears repeatedly in Chapter\n6 (referencing examples of the use of colour)\nand the other two appear in the chapter on\nevaluation. I think a few more references of both\nsorts (conventional and electronic) would have\nmade a useful addition to the book.\nOverall, this book provides • an excellent\nintroduction to the world of designing materials\nfor the support of computer-based learning. It is\nwritten in a clear, lucid style and contains lots and\nlots of good pictorial illustrations. Of course,\nunlike electronic books, the use of colour in\nconventional paper-based books is often a difficult\nand costly process for many publishers. All the\nillustrations that appear in this book are therefore\nin black and white. Naturally, writing a chapter on\nthe use of colour (Chapter 6) without actually\nbeing able to use it is not easy. The author\novercomes this problem by placing his eight\nfigures for chapter 6 on the Gower Website\n{http:llwww.gowerpub.com). But now, to get at\nthese figures the reader has to navigate through\nthis site to get to the entry for this book and then\ndownload a 'pdf' file. Unfortunately, after I down-\nloaded this file and opened it with Adobe Acrobat,\nI found that the numbering of the figures used by\nthe publisher (Figures 44 to 51) did not cor-\nrespond with the numbering used by the author\n(Figures 6.1 to 6.8)! Of course, this is an error that\ncould easily be rectified - and reflects the\ntremendous flexibility of electronic (e-book) over\npaper-based publication.\nIn my view, this is a book that is aimed at\nnewcomers to the area of CBL design rather\nthan established veterans like myself - although\nI am sure many (like me) would find it a good\nread. Undoubtedly, the book clearly identifies\nwhat is involved in designing CBL materials and\nwhat users of this technique can expect to\nachieve through its use.\nPhilip Barker\nUniversity of Teesside\nHelen Edwards, Brenda Smith and Graham Webb\n(eds), Lecturing - Case Studies, Experience and\nPractice, London: Kogan Page, 2001. ISBN\n0-7494-3519-4. Softback, 168 pages, £19.99.\nAs the title suggests, this book is about lecturing,\nwith a specific focus on higher education. It is\none of the most useful and usable books on\nlecturing around. The target audience is anyone\nwho has to prepare and deliver a single lecture or\ncoordinate entire lecture courses.\nThe main part of the book is a collection of\nseventeen real-life cases from universities in the\nUK, Australia and the USA, illustrating the range\nof challenges facing university educators today.\nEach case (of six to ten pages in length) follows\nthe same format. It begins with two short\nsections: one providing an overview of the issue\nunder discussion and the other giving an account\nof the context of the case. The contexts cover a\nrange of types of higher education (theoretical,\npractitioner, professional) and disciplines\nincluding politics, physiotherapy, telecommunica-\ntions engineering and contemporary poetry. The\ncases also deal with educators with very different\nlevels of teaching experience, from the new\nteacher preparing to lecture for the first time\nthrough to experienced lecturers looking at ways\nof improving their current practice.\nEach case account is divided into two or three\nparts. The first part expands on the issues being\ndiscussed, explaining what happened, how the\nteacher was feeling, how colleagues or students\nwere responding to the emerging challenge. This\nis then followed by a small number of questions\nthat lead the reader to think about the case, such\nas how they might have responded in the same\nsituation and what they might do in order to get\nthe class working effectively again. The\nquestions depend on the nature of the case, but\nin each instance they provide a starting point for\naddressing the emerging problem. It is easy to\nenvisage how this book could be used as part of\na short course on university teaching or to help\nguide the discussions in teaching seminars.\nThe second part continues the case account,\ndeveloping it further by outlining the course of\naction the teacher followed in order to improve\nthe situation. This is then followed by a more\nextensive series of questions and maybe a further\ndevelopment of the case. The case account ends\nwith a discussion section and in some instances\nincludes further questions for reflection and\naction. Each case includes references to relevant\neducation literature.\n91\nReviews\nThe seventeen cases are divided into four\nsections. Part 1 deals with key competencies in\nlecturing. It includes four cases that address\ntopics such as dealing with disruptive students,\ntaking over a course from a more experienced\ncolleague, and - that all too common situation\nthese days - being asked to teach a subject in\nwhich you have little expertise. Whilst the\nemphasis in this section is primarily on new or\ninexperienced teachers, the case content will\nprovide useful insights or points for discussion\nto educators of all experience levels. In Part 2\n('Orchestrating learning in lectures') there are\nfour cases focusing on the learning that takes\nplace during lectures, in particular large lecture\nsettings. There is also an emphasis on individual\nlearning in these cases, drawing the student out\nfrom the crowd and encouraging them to engage\nin discovery and interaction. There is also a\nuseful case entitled 'Just give us the right\nanswer'. It deals with the situation facing many\nteachers where students prefer to be told the\nanswer than spend time working on reasoning\nand constructing the answer for themselves.\nPart 3 deals with feedback. This section includes\ncases that explore dealing with hostile feedback\nand responding to feedback in order to improve\ncourse content and the learning environment.\nThe final section of the book (Part 4:\nAuthenticity: living your values in lectures)\ncovers cases that deal with carrying through our\nbeliefs about learning and embraces various\naspects of learning such as deep learning and the\nteaching of culturally sensitive material. There is\na strong theme of experiential learning and\nvaluing the students' lived experiences.\nI have already lent this book to a couple of\ncolleagues and the feedback from them has been\nextremely positive. They had two main\nresponses: firstly, they expressed a feeling of\nrelief that other educators faced the same\nproblems as they did and secondly, that the\nformat of the cases provided a framework for\nthinking about ways of addressing the issues\narising in each situation.\nThis collection of cases is readable and thought-\nprovoking. It addresses practical problems and\nchallenges, and provides insights into possible\nsolutions without being prescriptive or resorting\nto a 'tips and tricks' format. The inclusion of\nreferences provides further support for those not\nfamiliar with the literature. These cases will serve\nas an excellent resource for group discussions\nabout teaching and learning - it should be a part\n92\nof the library of every Teaching and Learning\nSupport Unit.\nSue Fowell\nUniversity of New South Wales\nP. Schwartz, S. Mennin and G. Webb (eds),\nProblem-Based Learning: Case Studies, Experi-\nence and Practice, London: Kogan Page, 2001.\nISBN: 0-7494-3492-9. Softback, 182 pages,\n£19.99.\nIn the dynamic world of educational practice,\nProblem-Based Learning (PBL) is a hot topic.\nWith its international origins and high profile\napplication in a number of areas of professional\neducation, PBL offers the tantalizing opportunity\nto support active, learner-centred, collaborative,\ninterdisciplinary learning. However, in operation\nthis opportunity is somewhat more challenging to\ngrasp. For example, a review of the literature\nsuggests a lack of consistency about what con-\nstitutes PBL, and questions whether its focus on\nthe 'problem' as the stimulus for learning is in any\nreal sense different from any other approach to\nlearning (or indeed life itself!). There are defini-\ntional and terminological concerns and differ-\nences of emphasis and focus. And whilst the\n'problem' is the common starting point for\nlearning, the degree to which this needs to be\nsituated into the everyday experience of the\nlearner is contested. Acknowledging this context,\n'Problem-Based Learning: Case Studies, Experi-\nence and Practice' is designed to help the reader\nsteer a course through these issues and explore\nand exploit the potential of PBL.\nThe book is intended to be a practical guide for\nboth experienced PBL practitioners and those\nwho 'do not yet understand it' (page 1). The\nbook offers twenty-two short case studies\ndesigned to share experience and practice from a\nrange of perspectives so that by\n. . . learning from the compelling accounts of\ntheir experiences you can develop helpful\nstrategies for when you use (or suggest using)\nPBL in your own curriculum, (page 1)\nEach case has a descriptive element written in\nthe first person and a 'case reporter's discussion'.\nEach description is split into two or more parts,\neach part concluding with a set of questions for\nthe reader to prompt reflection and engagement\nwith the text. Readers will either love or hate this\nuncommon approach. Certainly, prompts and\nquestions of this kind can encourage the active\nengagement the editors seek. However, it can\nAlt-] Volume 10 Number I\nalso reinforce the perhaps inevitable lack of\ndetail and substance in each of the short case\nstudies, and highlight the questions not asked at\nleast as strongly as those that are. Whatever one's\npersonal preferences the editors have, through\nthis device, made a useful attempt at simulating a\nproblem-based approach to the underlying\nstrengths and pitfalls of PBL.\nThe case studies are grouped. The first set of\neight case studies explores political, administra-\ntive and resourcing issues. All these are located\nin medical or dentistry contexts, which may limit\nthe extent to which the points raised in the\ndiscussion sections can be generalized to other\neducational and training contexts.\nThe second set of six case studies explores issues\nrelating to teachers. Here medical school ex-\namples are enhanced by one located in an\nArchitectural Department of an Australian\nuniversity and another located in an Instruc-\ntional Innovation Institute in the USA. The\nlatter case study illustrates many of the strengths\nand issues of the collection as a whole. Whilst it\nis an honest 'warts and all' account of a staff\ndevelopment workshop held in 1996 which raises\nsome important issues about assessment in PBL,\nthe format of the case study means that many of\nthe issues are left hanging without a set of\npractical 'solutions' that might be transferred to\nother practice. This would be less of a concern\nhad the promotion of the book not explicitly\nindicated that it had been designed to provide\n. . . an invaluable resource from which to draw\nexemplary lessons for those approaching\nteaching with PBL for the first time, this\ncollection provides an inspiring and valuable\nguide to understanding its methods and\ndeveloping successful strategies for using it in\ntheir own curriculum and teaching, (back cover)\nThe third and final set of seven case studies\naddresses issues from a student perspective.\nAgain all but one are taken from a medical or\ndentistry context. However, the learner-focused\nnature of these contributions and the signific-\nance of assessment in many of them, helps to\nmake this section the most rewarding of the\nthree, particularly in terms of the transferability\nof the insights and 'lessons learned'.\nThe final conclusion picks up on, and\nsummarizes, the key 'lessons learned' from the\ncase studies. The list of key points will not be a\nsurprise to experienced practitioners and\neducational managers:\n• Leadership is crucial to the successful\nintroduction of PBL.\n• Teaching staff need to 'buy in' and 'own'\nPBL as a legitimate approach to teaching,\nlearning and assessment.\n• Teaching staff need to be developed to\ndeploy PBL successfully.\n• PBL requires effective communication and\ncollaboration between key stakeholders.\n• Conflict and uncertainty about power and\ncontrol in teaching and learning will arise in\nthe introduction and use of PBL.\n• Assessment has to be consistent with the\noverall aims and intentions of PBL.\n• Not all learners will 'play' the PBL 'game'\n(although whether this makes the individual\nor group 'dysfunctional' as suggested on\npage 175 is open to debate).\nThose familiar with PBL will enjoy and\nempathize with many of the situations described\nin the case studies. However, I am less convinced\nthat they will learn a great deal that is new from\nthe book. Rather, it offers a very accessible,\nthought-provoking and occasionally moving\ninduction into the issues associated with PBL\nand indeed significant curriculum change more\ngenerally. As such it is a useful introduction to\nthe topic which would have benefited from a\nwider range of case study contexts, and in\nparticular case studies located in cross-\ndisciplinary contexts or where so-called mixed or\nhybrid approaches to PBL were employed.\nPeter Funnell\nSuffolk College\nJohn Field, Lifelong Learning and the New\nEducational Order, Stoke-on-Trent, UK:\nTrentham Books, 2000. ISBN: 1-8585-6199-X.\nSoftback, 200 pages, £13.95.\nJohn Field's Lifelong Learning and the New\nEducational Order is an interesting, useful and\nscholarly view of the contemporary Lifelong\nLearning debate. Written from what is largely a\nsocial science, rather than pedagogical, perspec-\ntive, he draws together a range of social, political\nand economic perspectives on the issue of\nlifelong learning in the emergent 'knowledge\neconomy'. Although he doesn't especially engage\nwith issues surrounding the application of\nlearning technologies to lifelong learning, the\n93\nReviews\nbook will nevertheless provide ALT-J readers\nwith a valuable perspective from which to view\nthose technological and pedagogical issues that\nare perhaps their more immediate concern. Of\nparticular interest in this context is his success in\ndistinguishing the reality from the rhetoric of\nlifelong learning.\nThe book is relatively short. In the author's\nwords, it is an 'extended essay'; but it is\nextremely thoroughly researched. The essay itself\nis about 150 pages and the bibliography almost\n20 pages long. This care serves to situate his\nargument convincingly in a contemporary and\ninternational view of the issues he addresses in\nthe book's five chapters. In brief, Field argues\nthat, like it or not, we currently inhabit both a\nknowledge economy and lifelong learning\nsociety. However, he goes on to argue that many\nof the commonplaces surrounding those ideas\nhave little real foundation and that we need to be\nmore reflective about what the implications of\nthis emergent social order are and what we need\nto do in the face of this change.\nThe first chapter spells out the case for recog-\nnizing that, at least in the developed world,\nlifelong learning is a genuine and significant\nphenomenon. However, rather than point at the\ninstitutional evidence for this, he reflects on the\nimportance of what he calls 'informal learning' (p.\nxi). In this he includes such things as all the learn-\ning implicit in the pursuit of alternative medicines\nand leisure activities. In these he sees both\nevidence of a greater individualization of interest\nwithin society, but also of growing insecurity.\nIn the second chapter he extends this view into\nthe area of work-related learning and addresses\nmany of those commonly expressed views about\nthe ways in which changing patterns of employ-\nment both encourage and demand a more\ncontinuous approach to the acquisition of\nknowledge and skills. However, while acknow-\nledging that essential truth, he is also careful to\npoint out that this is less universally true than\none might expect from the rhetoric. Significant\nelements of the world's population as yet remain\nlargely unaffected by these changes.\nStill further in the third chapter, 'The Learning\nEconomy', he argues that the knowledge\neconomy is also not necessarily what policy and\nrhetoric might suggest. Notably the realities of\ncorporate economics do not necessarily support\nthe often promoted view that well-organized and\nregular training is necessary to success. He offers\nseveral interesting case studies of major organiza-\n94\ntions that adopted worker-centred management\nand training strategies that, far from leading to\ncorporate success, led to the sale of companies\nand the abolition of the training systems.\nIn the fourth chapter, 'Who is being left behind?',\nhe examines the human cost of the changing\nenvironment. He observes that while human-\nkind's capacity for learning throughout a lifetime\nempowers at least some people to cope with our\nrapidly changing contemporary world, others\nmay be being positively excluded by the very\nmechanisms that are created to support the\nsuccessful lifelong learners.\nIn the final chapter he explores what he calls\n'four key elements of a future strategy' (p. 134).\nThese are:\n• rethinking the role of schooling in a learning\nsociety;\n• widening participation in adult learning;\n• building active citizenship in social capital;\n• pursuing the search for meaning.\nI have only one small reservation about what\nis, overall, a sound and scholarly perspective\non the lifelong learning debate; and that is\nwith the author's occasional 'pot-shots' at post-\nmodernism. I describe his comments on the post-\nmodern as 'pot-shots' because, while he dismisses\npost-modernism as 'a dead end' (p. 133), he never\nactually engages with it intellectually or presents\nany arguments to indicate why he views it as\nintellectually impoverished. Reading between the\nlines it is clear that his problem with the post-\nmodern is that it embraces uncertainty as a funda-\nmental aspect of understanding. As indicated\nabove, the last of his four elements of a future\nstrategy is 'pursuing the search for meaning'. His\nquest throughout the book is an essenti-ally\npositivist one which sees lifelong learning as a\nroute to a more certain understanding of one's\nrole and place in an uncertain world. However,\nthis is by no means incompatible with post-\nmodernism. Understanding that knowing is con-\ntingent, rather than certain, in no way undermines\nits ability to provide intellectually robust coping\nstrategies. However, even if the author's pursuit of\nthe philosophical underpinnings of his argument\nare a little less rigorous than might be ideal, it\nreally takes away very little from this otherwise\ninsightful essay.\nBruce Ingraham\nUniversity of Teesside\nAlt-J Volume 10 Number I\nD. Squires, G. Conole and G. Jacobs (eds), The\nChanging Face of Learning Technology, Cardiff:\nUniversity of Wales Press, 2000. ISBN:\n0-7083-1681-6. Softback, 182 pages, £7.99.\nSelecting the papers to be included in this collec-\ntion must have been an interesting task. The\nconcept of illustrating the evolution of learning\ntechnology since 1993 when ALT-J was first\npublished, by synthesizing papers previously\npublished in that journal, was well conceived,\nand this book provides a stimulating anthology.\nInevitably, the academic style and variety of\nauthors means that this is not a book to read\ncasually in a single sitting. It merits time, several\nreturn visits, and dipping in and out of sections\nas ideas emerge and re-emerge in different areas.\nThere are thirteen papers in the collection. The\nearliest were first published in 1995, and the\nmost recent in 2000. Their authors are spread\nworld-wide - Australia, New Zealand, Canada\nand USA as well as the UK, although the overall\nfocus is very much on experiences from Australia\nand the UK. The papers are presented under\nfour headings: 'Design and Evaluation of\nLearning Technology'; 'Institutional Change';\n'Learning Technology in a Networked\nInfrastructure' and 'The Future'. Each paper is\nreproduced in full in its original form, but with\nan addendum to provide the author(s) with an\nopportunity to update their work, or comment\non subsequent developments and experiences.\nThe book begins with an introduction and\noverview of each of the sections, and could serve\nwell in place of this review because it attempts to\nprecis each paper and illustrate why they have\nbeen grouped into the sections chosen. In the first\nsection, headed 'Design and Evaluation of\nLearning Technology', the emphasis seems to be\non the need for, and the importance of, effective\ncommunication and interaction. Two frameworks\nare presented, one to support the design of\nstudent-centred constructivist learning experi-\nences (REALs from Grabinger and Dunlap), and\none to support evaluation by considering the\nwhole context within which technology may be\nsituated (SECAL from Gunn). These are\nsupported by Fowler and Mayes' discussion of\nlearning relationships from a psychological and\nanthropological context. Mitchell's wonderful\npaper on the outrageous abuse of statistical\nmethods, and his challenge to the appropriateness\nof parametric approaches delighted me, but I did\nwonder whether it really fitted into the context\nboth of this collection and this section. The\nsection on 'Institutional Change' presents two\npapers from Australia and two from the UK.\nReading the papers in close succession highlights\na difference in scale and resource which is\nalarming, although there are still many common\nissues identified. Unfortunately in the paper from\nMcNaught and Kennedy, describing the 'sub-\nstantial' (their word - I think I might say\nbreathtaking!) investment strategy at RMIT,\nsome of the tables have not printed with sufficient\ncontrast, so much valuable information is lost to\nthe reader.\nThe three papers under the heading of 'Learning\nTechnology in a Networked Infrastructure'\nreturn to the idea of learning communities,\nlifelong experiential learning, and the import-\nance of supporting communication. They are\ngenerally ethnological and illustrated with\nspecific examples, in contrast to the more\ntheoretical papers in the opening section, but\nmany ideas presented there can be seen echoed in\nthis section. The final section is entitled 'The\nFuture' but acknowledges that the rate at which\ntechnology is evolving poses great challenges for\nanyone who wishes to speculate about or to\nforecast the future. It contains two papers, and\nagain the ideas from the opening section are\nrevisited here. One paper describes BT's Real\nTime Interactive Social Environment (RISE),\nwhich aims to present a user-centric portal to\ntools or modules, but via a sufficiently generic\nstructure that it can be readily adapted and\ntransported to different contexts. The other\nconsiders the notion of a Peripatetic Electronic\nTeacher (PET) working in a virtual university,\nand the implications and requirements to make\nsuch a model effective.\nOverall, I have enjoyed reading this book.\nBecause someone else has gone to the trouble of\nselecting the papers, I have read things I missed\npreviously, as well as revisiting some well-\nthumbed pieces. Perhaps I was a little dis-\nappointed to see so many familiar names\namongst the authors, and I felt that the selection\ntended to present the views of staff in senior\neducational development or educational techno-\nlogy roles. The historical overview is good in\nterms of presenting frameworks and discussion\nof strategy, but I felt that perhaps it did not\nreflect the process which so many of us have\nbeen through - where were the reflections on the\nmistakes and frustrations that we have all experi-\nenced? The editors express the hope that the\npublication will 'provide an interpretative frame-\nwork for an understanding of the design and use\n95\nReviews\nof learning technology, and stimulate an ap-\npreciation of the underlying issues and their\nsignificance for supporting learning and teach-\ning'. This a grand aim which I will not attempt\nto appraise, but in providing a single volume to\ndraw together diverse papers representing a\nhistorical perspective on learning technology, the\neditors have succeeded in creating a readily\naccessible and thought-provoking collection of\nideas and experiences. Yes, we would all have\nmade our own different selections of papers to\nrepresent the last eight years, but that does not\nmake this particular collection less valuable.\nNora Mogey\nUniversity of Edinburgh\nPat Maier and Adam Warren, Integrating\nTechnology in Learning and Teaching: A\nPractical Guide For Educators, London: Kogan\nPage, London, 2000. ISBN: 0-7494-3180-6.\nSoftback, vii + 162 pages, £19.99.\nTo quote its authors, this book is first and\nforemost 'a resource book for academics engaging\nin C&IT learning and teaching innovations'. The\nacademics that the authors have in mind are\nmainly teachers in higher education within the\nUK and this narrows significantly the scope\nindicated by the title. It aims to bring together,\nand integrate within an educational framework,\nthe dispersed and wide-ranging literature dealing\nwith C&IT implementation. This framework con-\nsists of three main elements:\n• the political agendas driving C&IT\nimplementation in the UK, together with\nsupport mechanisms;\n• the pedagogy of open and independent\nlearning;\n• the technical issues involved in producing\nand delivering digital learning materials.\nThe intended readership for this book is not just\nacademics who use (or wish to use) C&IT in their\nteaching but also educational developers who are\n'devising staff development programmes'.\nIn terms of coverage, there are five chapters:\n• Agendas for change in higher education;\n• Developing new teaching skills;\n• Designing learning environments;\n• Using communication technologies to\nfacilitate learning;\n96\n• Assessing student learning.\nEach chapter follows the same format:\nexposition of a theme, with integrated references\nto relevant Websites, followed by a set of\nactivities, followed by exposition of another\ntheme and so on. At the end of each chapter is a\nset of references for further reading. There is\nalso a very useful, and well-designed, Website at\nhttp:llwww.clt.soton.ac.uk\/activeguide. This pro-\nvides further Web references and some useful\nlearning materials relating to issues mentioned in\nthe text.\nThis formula works particularly well in those\nchapters which are strong on the practicalities of\nC&IT implementation; the chapter on using\ncommunication technologies to facilitate\nlearning is a case in point. Almost two-thirds of\nthe chapter deal with the broad educational\nissues of discussion, communication and col-\nlaboration within an online context, enabling\nreaders to make informed choices about the\nmethods they might employ in a given technical\nenvironment. Referring to the available literature\npublished to date on the Web, it covers the\npossible structures for online group work and\ncompares these with face-to-face group work,\nallowing the reader to make a balanced judge-\nment. It also includes a section on the assess-\nment of participation in online communication.\nThe activities provide a clear and helpful\nframework, which should enable newcomers to\nthis form of tutoring to make a confident start in\nmanaging online seminars, avoiding most of the\nwell-known pitfalls. The last third of the chapter\nprovides comprehensive coverage of the various\ntechnical options open to the teacher, evaluating\ntheir various strengths and weaknesses. Given\nthe importance of online communication in\ntoday's educational setting, this chapter alone is\nworth the price of the book.\nThe chapter on developing new teaching skills is\na useful starting point for any lecturer\nconsidering developing digital materials. It not\nonly shows how easy it is to begin this type of\ndevelopment but also provides a great deal of\nrealistic advice on the difficulties inherent in\nmastering some of the more complex tech-\nnologies. It points out that a great deal of time\nand effort can be saved by exploiting materials\nthat have already been created and are sitting on\nthe Web waiting to be discovered. The Web\nreferences are especially valuable and the Active\nGuide provides further support materials. One\nof the most pleasing features is the authors'\nAlt-J Volume 10 Number I\nconcern to highlight the disadvantages as well as\nthe advantages of digital materials.\nA resource book of only 160 pages is hardly\nlikely to be able to address in any depth the\ncomplexities of the political agendas discussed in\nthe first chapter or the pedagogy of instructional\ndesign which is dealt with at the beginning of the\nchapter on designing learning environments. In\nthe case of chapter one, for instance, two para-\ngraphs on the knowledge economy and just over\na page on the globalization of higher education\nare clearly insufficient to provide a meaningful\noverview of the concepts involved. More\nworryingly, perhaps, the authors present teachers\nin HE as being required to 'comply with the\neconomic agenda of providing the right kind of\nwork-force for the next century' and appear to\nbelieve that this new obligation is contempor-\naneous with' changes in educational theory' that\nare focusing on ' the learning process as well as\nthe content'. In reality, of course, the nature of\nthe learning process has been at the centre of\neducationalists' concerns for at least the last\ntwenty years or so. This kind of superficial\noverview leads, perhaps inevitably, to activities\nwhich are far weaker than those of a more\nfocused, practical nature to be found embedded\nin the other chapters. For example, in order to\nintroduce the distinction between deep and\nsurface approaches to learning, teachers in HE\nare asked whether, when they are learning, they\n'really want to understand what it is all about' or,\nalternatively, whether they 'prefer to collect facts,\ndetails and examples and then memorize them'.\nAnd with that the issue of approaches to learning\ndisappears from view, never to resurface.\nDespite these weaknesses, the authors were\nprobably right to make the attempt to introduce\nsome of the political and educational issues\nwhich inform C&IT implementation, as all too\noften technological issues are discussed in a\nvacuum and educational priorities are pushed\ninto the background. One could only wish that\nthey had been more selective, however, and\ncovered one or two of the more central issues in\ngreater depth (approaches to learning and\ninstructional design for example) rather than\nrisk undermining their endeavour by surveying\ntoo wide an area. This said, the book does\nperform a valuable service not only to teachers\nin HE and FE but also to teachers in primary\nand secondary schools, who, as the authors\npoint out, are already grappling with C&IT\nimplementation within the context of the\nNational Grid for Learning.\nTerry Goodison and John O'Donoghue\nUniversity of Wolverhampton\n97\n"}