{"doi":"10.1016\/j.ijimpeng.2007.12.009","coreId":"140086","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5317","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5317","10.1016\/j.ijimpeng.2007.12.009"],"title":"Penetration of a glass-faced transparent elastomeric resin by a lead-antimony-\ncored bullet","authors":["Hazell, P. J.","Edwards, M. R.","Longstaff, H.","Erskine, J."],"enrichments":{"references":[{"id":37967621,"title":"An Approach to the Study of Light Armour, Lawrence Radiation Laboratory,","authors":[],"date":"1967","doi":"10.2172\/4308612","raw":"Wilkins M L, Honodel C A, Swale D, An Approach to the Study of Light Armour, Lawrence Radiation Laboratory, Livermore, UCRL-50284, June (1967).","cites":null},{"id":37967629,"title":"An improved computational constitutive model for brittle materials,","authors":[],"date":"1994","doi":null,"raw":"Johnson GR, Holmquist TJ. An improved computational constitutive model for brittle materials, High Pressure Science and Technology—1993, Part 2, American Institute of Physics, New York, pp. 981–984, (1994).","cites":null},{"id":37967624,"title":"An investigation into the energy absorbed during ballistic perforation of composite armours.","authors":[],"date":"1991","doi":"10.1016\/0734-743x(91)90029-f","raw":"Hetherington J G, Rajagopalan B P, An investigation into the energy absorbed during ballistic perforation of composite armours. Int. J. of Impact Engng: 1991; 11: 33-40.","cites":null},{"id":37967636,"title":"Analysis of ceramic\/metal armour systems.","authors":[],"date":"2009","doi":"10.1016\/s0734-743x(01)00025-2","raw":"Lee M, Yoo YH. Analysis of ceramic\/metal armour systems. Int. J. of Impact Engng: 2001; 25 (9): 819-29.  Int. J. Impact Engng., 36 (1) pp. 147-153 (2009)","cites":null},{"id":37967639,"title":"Analysis of high-velocity projectile penetration mechanics.","authors":[],"date":"1966","doi":"10.1063\/1.1708570","raw":"Christman DR, Gehring JW. Analysis of high-velocity projectile penetration mechanics. J. Appl. Phys: 1966; 37 (4): 1579-87.    21","cites":null},{"id":37967617,"title":"Ballistic impact of polycarbonate—an experimental investigation.","authors":[],"date":"1993","doi":"10.1016\/0734-743x(93)90105-g","raw":"Wright SC, Fleck NA, Stronge WJ. Ballistic impact of polycarbonate—an experimental investigation. Int. J. of Impact Engng: 1993; 13 (1):1-20.","cites":null},{"id":37967632,"title":"Ballistics performance assessment of glass laminates through experimental and numerical investigation.","authors":[],"date":"1999","doi":null,"raw":"Richards M, Clegg R, Howlett S. Ballistics performance assessment of glass laminates through experimental and numerical investigation. Proceedings of the 18th International Symposium on Ballistics, San Antonio, Texas, USA, Vol. 2, 15–19 November 1999, p. 1123-30.","cites":null},{"id":37967638,"title":"Birnbaum N SPH simulation of the ballistic perforation of GFRP.","authors":[],"date":"1999","doi":null,"raw":"Quan X, Birnbaum N SPH simulation of the ballistic perforation of GFRP. In the proceedings of the 18 th International Symposium on Ballistics, 15-19 November 1999, San Antonio, Texas, USA.","cites":null},{"id":37967626,"title":"Century Dynamics Limited, Dynamics House,","authors":[],"date":null,"doi":null,"raw":"AUTODYN™ Theory Manual, Century Dynamics Limited, Dynamics House, Hurst Road, Horsham, West Sussex, RH12 2DT, UK.","cites":null},{"id":37967623,"title":"Characterisation of ceramic\/steel and ceramic\/aluminium armours subjected to oblique impact.","authors":[],"date":"1997","doi":"10.1016\/s0734-743x(97)00019-5","raw":"Sadanandan S, Hetherington J G, Characterisation of ceramic\/steel and ceramic\/aluminium armours subjected to oblique impact. Int. J. of Impact Engng: 1997; 19: 811-819.","cites":null},{"id":37967627,"title":"Fracture characteristics of three metals subjected to various strains, strain rates, temperatures and pressures. Engineering Fracture Mechanics:","authors":[],"date":"1985","doi":"10.1016\/0013-7944(85)90052-9","raw":"Johnson GR, Cook WH. Fracture characteristics of three metals subjected to various strains, strain rates, temperatures and pressures. Engineering Fracture Mechanics: 1985; 21 (1): 31-48.","cites":null},{"id":37967620,"title":"Fracture criterion for glass under impact loading.","authors":[],"date":"2001","doi":"10.1016\/s0734-743x(01)00023-9","raw":"Bouzid S, Nyoungue A, Azari Z, Bouaouadja N, Pluvinage G. Fracture criterion for glass under impact loading. Int. J. of Impact Engng: 2001; 25 (9): 831-845.","cites":null},{"id":37967630,"title":"High strain rate properties and constitutive modeling of glass,","authors":[],"date":null,"doi":"10.2172\/41367","raw":"Holmquist TJ, Johnson GR, Grady DE, Lopatin CM, Hertel Jr. ES. High strain rate properties and constitutive modeling of glass, Proceedings of the 15th International Symposium on Ballistics, Jerusalem, Israel, Vol 1, 21–24 May 1995. p. 234-44.","cites":null},{"id":37967634,"title":"Hydrocode modelling of hypervelocity impact on brittle materials: depth of penetration and conchoidal diameter.","authors":[],"date":"1999","doi":"10.1016\/s0734-743x(99)00133-5","raw":"Taylor EA, Tsembelis K, Hayhurst CJ, Kay L, Burchell MJ. Hydrocode modelling of hypervelocity impact on brittle materials: depth of penetration and conchoidal diameter.  Int. J. of Impact Engng: 1999; 23: 895-904.","cites":null},{"id":37967619,"title":"Impact of small steel spheres on the surfaces of “normal” and “anamolous” glasses.","authors":[],"date":"1986","doi":"10.1111\/j.1151-2916.1986.tb04769.x","raw":"Chaudhri MM, Kurkjian CR, Impact of small steel spheres on the surfaces of “normal” and “anamolous” glasses. Journal of the American Ceramic Society: 1986; 69 (5): 404-10.","cites":null},{"id":37967625,"title":"Investigation of nanotechnology enhanced polyurethane replacement resin (PRR) as transparent armour material, MSc Thesis,","authors":[],"date":"2004","doi":null,"raw":"Chin S. Investigation of nanotechnology enhanced polyurethane replacement resin (PRR) as transparent armour material, MSc Thesis, Cranfield University, Shrivenham Campus, (2004).","cites":null},{"id":37967615,"title":"Land-based military applications in &quot;Comprehensive Composite Materials&quot;","authors":[],"date":"2000","doi":"10.1016\/b0-08-042993-9\/00197-2","raw":"Edwards MR. Land-based military applications in &quot;Comprehensive Composite Materials&quot; volume 6 (M G Bader, K T Kedward and Y Sawada eds), Elsevier Science, Oxford, (2000), 681-99.","cites":null},{"id":37967616,"title":"Normal missile penetration and perforation of layered plates.","authors":[],"date":"1988","doi":"10.1016\/0734-743x(88)90028-0","raw":"Radin J, Goldsmith W. Normal missile penetration and perforation of layered plates. Int. J. Impact Engng: 1988; 7: 229–259.","cites":null},{"id":37967635,"title":"Numerical modelling of the compressive and tensile response of brittle materials under high pressure dynamic loading.","authors":[],"date":"1999","doi":null,"raw":"Clegg RA, Hayhurst CJ. Numerical modelling of the compressive and tensile response of brittle materials under high pressure dynamic loading. In Shock Compression of Condensed Matter – 1999 (M.D. Furnish, L. C. Chhabildas and R. S. Hixson), American Institute of Physics (2000), 321-324.","cites":null},{"id":37967618,"title":"On the impact and penetration of soda-lime glass.","authors":[],"date":"2005","doi":"10.1016\/j.ijimpeng.2004.10.004","raw":"Bourne, NK. On the impact and penetration of soda-lime glass. Int. J. of Impact Engng: 2005; 32: 65-79.","cites":null},{"id":37967633,"title":"Quasistatic to hypervelocity impactor loading of glass: Autodyn hydrocode and static testing configurations.","authors":[],"date":"2001","doi":"10.1016\/s0734-743x(01)00103-8","raw":"McDonnell JAM, Catling DJ, Herbert MK, Clegg RA. Quasistatic to hypervelocity impactor loading of glass: Autodyn hydrocode and static testing configurations. Int. J. of Impact Engng: 2001; 26: 487-496.","cites":null},{"id":37967628,"title":"Selection: Nonferrous Alloys and Special-purpose Materials, Metals Handbook, Vol 2, 10 th Edition,","authors":[],"date":"1990","doi":null,"raw":"Properties and Selection: Nonferrous Alloys and Special-purpose Materials, Metals Handbook, Vol 2, 10 th Edition, ASM International (1990). Int. J. Impact Engng., 36 (1) pp. 147-153 (2009)","cites":null},{"id":37967637,"title":"The application of SPH techniques in AUTODYN-2D™ to Ballistic Impact Problems.","authors":[],"date":"1996","doi":null,"raw":"Hayhurst CJ, Clegg RA, Livingstone IH, Francis NJ, The application of SPH techniques in AUTODYN-2D™ to Ballistic Impact Problems. In the proceedings of the 16 th International Symposium on Ballistics, San-Francisco, 23-28 September 1996","cites":null},{"id":37967622,"title":"The optimization of two component composite armours,","authors":[],"date":"1992","doi":"10.1016\/0734-743x(92)90145-j","raw":"Hetherington J, The optimization of two component composite armours, Int. J. of Impact Engng: 1992; 12: 409-414.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-12-31T00:00:00Z","abstract":"The penetration of the lead antimony-cored 7.62 mm × 51 mm bullet into a glass-\nfaced polyurethane elastomeric polymer resin has been studied. The resulting\ncraters in the resin contained elongated bullet core material that had a\nsignificant amount of porosity. A simple linear viscoelastic model was applied\nto AUTODYN-2D to describe the behaviour of the resin and numerical results of\nthe penetration mechanism and depth-of-penetration appeared to match\nexperimental observations well. Analysis of the high speed photography and a\nnumerical model of this bullet penetrating a viscoelastic polymer showed that\nduring the initial stages of penetration, the projectile is essentially turned\ninside out. Furthermore, the shape of the cavity was defined by the elastic\nrelaxation of the polymer that led to compression of the core material. A weight\nanalysis of the penetrated materials showed that using a thicker tile of glass\nresulted in better ballistic performanc","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140086.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.ijimpeng.2007.12.009","pdfHashValue":"400f0c2fef969d7f1f87de4190f9fd271da09550","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5317<\/identifier><datestamp>2011-05-10T23:18:02Z<\/datestamp><setSpec>hdl_1826_13<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Penetration of a glass-faced transparent elastomeric resin by a lead-antimony-\ncored bullet<\/dc:title><dc:creator>Hazell, P. J.<\/dc:creator><dc:creator>Edwards, M. R.<\/dc:creator><dc:creator>Longstaff, H.<\/dc:creator><dc:creator>Erskine, J.<\/dc:creator><dc:subject>bullet impact<\/dc:subject><dc:subject>transparent armour<\/dc:subject><dc:subject>modelling<\/dc:subject><dc:subject>elastomeric resin.<\/dc:subject><dc:description>The penetration of the lead antimony-cored 7.62 mm × 51 mm bullet into a glass-\nfaced polyurethane elastomeric polymer resin has been studied. The resulting\ncraters in the resin contained elongated bullet core material that had a\nsignificant amount of porosity. A simple linear viscoelastic model was applied\nto AUTODYN-2D to describe the behaviour of the resin and numerical results of\nthe penetration mechanism and depth-of-penetration appeared to match\nexperimental observations well. Analysis of the high speed photography and a\nnumerical model of this bullet penetrating a viscoelastic polymer showed that\nduring the initial stages of penetration, the projectile is essentially turned\ninside out. Furthermore, the shape of the cavity was defined by the elastic\nrelaxation of the polymer that led to compression of the core material. A weight\nanalysis of the penetrated materials showed that using a thicker tile of glass\nresulted in better ballistic performance<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-05-10T23:18:02Z<\/dc:date><dc:date>2011-05-10T23:18:02Z<\/dc:date><dc:date>2009-12-31T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>0734-743X<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.ijimpeng.2007.12.009<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5317<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0734-743x","issn:0734-743X"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["bullet impact","transparent armour","modelling","elastomeric resin."],"subject":["Article"],"fullText":"Int. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 1\nPENETRATION OF A GLASS-FACED TRANSPARENT ELASTOMERIC \nRESIN BY A LEAD-ANTIMONY-CORED BULLET \n \nP J Hazell1*, M R Edwards1, H Longstaff1 and J Erskine2 \n \n1Cranfield University, Defence College of Management and Technology, Shrivenham, Oxfordshire, \nSN6 8LA, United Kingdom. \n2Hamilton Erskine Ltd, 17 Moss Road, Ballygowan, Co. Down, BT23 6JQ, Northern Ireland. \n* Corresponding author \n \nSUMMARY \nThe penetration of the lead antimony-cored 7.62 mm × 51 mm bullet into a \nglass-faced polyurethane elastomeric polymer resin has been studied. The resulting \ncraters in the resin contained elongated bullet core material that had a significant \namount of porosity. A simple linear viscoelastic model was applied to AUTODYN-\n2D to describe the behaviour of the resin and numerical results of the penetration \nmechanism and depth-of-penetration appeared to match experimental observations \nwell. Analysis of the high-speed photography and a numerical model of this bullet \npenetrating a viscoelastic polymer showed that during the initial stages of penetration, \nthe projectile is essentially turned inside-out. Furthermore, the shape of the cavity was \ndefined by the elastic relaxation of the polymer that led to compression of the core \nmaterial. A weight analysis of the penetrated materials showed that using a thicker tile \nof glass resulted in better ballistic performance. \n \nKeywords: lead-antimony-cored bullet, penetration mechanisms, elastomeric resin, \ntransparent armour, numerical modelling. \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 2\nINTRODUCTION \nArmour systems usually consist of a hard disrupting face and some kind of \nabsorbing element behind. The purpose of the disruptor is to induce fragmentation in \nthe projectile or induce erosion thereby redirecting and dispersing the kinetic energy. \nThe absorber on the other hand, acts to transfer the kinetic energy of the projectile to a \nlower form of energy – such as heat, through inelastic deformation (for example). A \nreview of materials used for ballistic protection applications can be found in Edwards \n[1] \nTypical commercially available transparent armour use laminates consisting of \nglass with interlayers of polyvinylbutyrate backed by a layer of polycarbonate. \nIndividual materials that are used in these systems have been extensively studied \nunder a wide variety of loading conditions by a number of researchers [2, 3, 4, 5, 6]. \nUnderstandably, most researchers opt for using a simple projectile design such as a \nsphere or rod. However, unlike ceramic-faced armours where there is a plethora of \ndata dating back from the 1960s on penetration by high velocity rifle bullets (e.g. [1, \n7, 8, 9, 10, 11, 12]), there is a paucity of data on the impact and penetration of glass-\nfaced materials using these relatively complex projectiles.  \n Despite the advances in the manufacture of transparent ceramic materials \nsuch as Aluminium Oxynitride and Spinel the most commonly used disruptor-type \nmaterial used in a transparent armour system is glass. Float-glass (for example) is a \nhard material but is very brittle. The high hardness of the glass elements (400-500HV) \ndisrupts the projectile whilst the polymeric interlayer and boundary layers in a \nlaminate armour system act to confine the fragmentation. \nA candidate polymer material that can be incorporated into transparent armour \ndesigns is a thermosetting polyurethane resin known as a polyurethane replacement \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 3\nresin (PRR). This resin has advantageous properties for the manufacture of laminate \narmour systems. It is transparent and has also been shown to be a candidate for nano-\nparticle reception that provides the possibility of enhancing the strength of the \nmaterial whilst maintaining good transparency [13]. It has a lower density than either \nglass or the polycarbonate. In contrast to polycarbonate which has a plastic elongation \nof 100-150 %, this resin is elastomeric with a typical elastic elongation of greater than \n150 %. It possesses a coefficient of thermal expansion that is very similar to glass and \ncan be moulded into any shape. It can also be cured in contact with the glass to \nprovide strong adhesion.  \nThe aim of this present work is to examine the penetration of a lead-antimony-\ncored small-arms bullet (7.62 mm × 51 mm NATO Ball) into a glass-face backed by \nthis elastomeric resin. In the target set-up we are using relatively large thicknesses of \nresin to examine the effect that this material has on a lead antimony projectile. \nModelling approaches, using a simple linear viscoelastic model for the resin have \nbeen used to enhance our understanding of the early stages of penetration. To the best \nof our knowledge, this is the first time results of penetration of a soft-cored projectile \ninto a glass-faced transparent elastomer have been presented. \n \nEXPERIMENTAL \nMaterials Used \nThe targets were manufactured by Hamilton Erskine Ltd by casting the \nthermosetting polyurethane replacement resin (PRR) into transparent 6-mm thick \npolycarbonate surrounds. During this process the float glass facings of 6 mm, 8 mm, \nor 10 mm thickness were chemically bonded to the resin as it cured. These targets \nwere 100-mm square and were at least 45% thicker than the maximum depth-of-\nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 4\npenetration. Additional targets using 6-mm and 10-mm thick glass were also tested \nwhere the resin had been cured into a ∅87-mm plastic beer cup. The beer cups were \n112 mm deep and tapered to a diameter of 68 mm over their depth. The glass used \nwas float glass (SiO2 72.6, Na2O 13.0, CaO 8.4, MgO 4.0, Al2O3, 1.0 weight percent) \nmanufactured by Pilkingtons; ρ = 2500 kg\/m3. A target without the glass-face was \nalso tested.  \nThe bullet used was a 7.62 mm × 51 mm NATO Ball round. The lead \nantimony core was of composition (weight percent) Sb 10.2, Cu 0.16, balance Pb with \nno other element greater than 0.05 weight percent. The core was enclosed in a gilding \nmetal (Cu – 10 Zn) jacket. The microstructure of the core was the expected eutectic \nmixture with small amounts of primary antimony. Key properties of the bullet are \nshown in Table 1; the geometry and key dimensions of the bullet are shown in Figure \n1. Hardness measurements were carried out using an Indentec HWDM7 digital micro \nhardness machine. \nThe yaw characteristic of this projectile fired from our experimental set-up \nwas measured by firing fifteen projectiles and imaging the yaw in the vertical and \nhorizontal planes using a single Phantom 7 high-speed video camera and an angled \nmirror. The average maximum yaw recorded in the field-of-view (255 mm) was 1.8° \nwith a standard deviation of 0.7°. \n \nTable 1: NEAR HERE \n \n \nFigure 1:  NEAR HERE \n \n  \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 5\nThe properties of the resin are summarised in Table 2. The density was \nmeasured using a Micrometrics AccuPyc 1330 gas pycnometer. Tensile properties \nwere measured using an Instron universal testing machine and the longitudinal wave \nvelocity was measured using a Panametrics 5MHz transducer using the pulse-echo \nmethod. \n \nTable 2: NEAR HERE \n \nExperimental methods \nThe bullets were fired from a proof barrel situated 10 metres from the front of \nthe target. The average velocity of the bullet was 844 m\/s with a standard deviation of \n10 m\/s; bullet velocities were measured using a sky-screen system. A Phantom 7 \nhigh-speed video camera was used to measure the motion of the bullet through the \ntarget. Frame speeds of 80,000 frames –per–second were used with exposure times of \n2 µs.  \n Optical microscopy was carried out on polished (and etched samples). \nBecause of the low melting point of the lead-antimony alloy, specimens were \nmounted in a cold-setting polymer rather than the customary bakelite. Polishing was \ndone using an automatic polishing machine and diamond paste (1 micron). Etching \nwas carried out using an aqueous solution of ferric chloride for examination of the \ncopper gilding metal and glacial acetic acid, concentrated nitric acid and glycerol for \nthe lead-antimony. \n \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 6\nNUMERICAL \nTo provide insight into the penetration mechanisms a numerical model was \ndeveloped in an explicit non-linear transient dynamic numerical code - AUTODYN-\n2D. All simulations were done using axial symmetry. \nMany of the values required for the constitutive models are currently unknown \nand therefore the penetration into a known elastomeric material (polyrubber) with a \nsimilar density to the PRR was simulated. This software is explained in detail \nelsewhere [14]. However in brief, this code solves the conservations laws of mass and \nmomentum based on initial boundary conditions. The user is prompted for an \nequation of state that describes the pressure in terms of the internal energy and \nvolume and a constitutive relationship that calculates the flow stress in terms of a \nnumber of material and application-dependent parameters including strain, strain-rate \nand temperature. Failure models can be introduced to describe the failure.  \nThe behaviour of the lead antimony core was simulated using an elastic \nperfectly plastic criterion using a yield strength of 40 MPa. This was due to the low \nmelting point of this material where strain hardening effects are assumed to be \nminimal. Hardness measurements of the lead antimony from the recovered projectiles \nembedded in the resin indicated that little or no strain-hardening had occurred which \nis consistent with this low melting point alloy. Strain-rate effects for this material \nwere also assumed to be negligible. Thermal softening was introduced by adopting \nthe approach used by Johnson and Cook [15] viz. \n⎥⎥⎦\n⎤\n⎢⎢⎣\n⎡\n⎟⎟⎠\n⎞\n⎜⎜⎝\n⎛\n−\n−−=\nm\nrm\nr\ny TT\nTT1σσ      (1) \nwhere T is the temperature, Tm is the melting temperature, Tr is the reference \ntemperature (293 K), m is the thermal softening exponent, σy is the yield strength of \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 7\nthe material and σ is the resulting flow stress due to thermal softening. Strain to \nfailure values for this type of lead-alloy lie in the region of 15 -- 20 % [16] \nThe gilding metal jacket was modelled assuming a flow stress of 575 MPa; \nthis is consistent with the hardness measurements of the jacket before firing. Due to \nthe face-centred cubic structure of this material and because it was heavily cold-\nworked during the bullet’s manufacture, strain-rate effects were assumed to be zero. \nTo test this, we introduced a strain-rate sensitive term to the flow stress identical to \nthe method used in [15] with a strain-rate constant equal to that of fully annealed \ncopper. This resulted in very little change in the morphology of the penetrating bullet. \nThe strain-to-failure values for this type of cold-worked alloy are typically less than 5 \n% [16] and therefore a principle strain failure criteria was used that was set to this \nvalue. However, we found that increasing the strain-to-failure to values as high as 30 \n% had little effect on the changing shape of the penetrating bullet and the depth-of-\npenetration. \nModelling the failure of brittle materials is particularly troublesome not least \nbecause it is difficult to measure the strength of the comminuted material. A \nconstitutive model presented by Johnson and Holmquist [17,18] was used  that had \nbeen previously calibrated for a 7.62 mm × 51 mm NATO Ball round penetrating a \nglass laminate system by Richards et al [19]. The Johnson Holmquist damage model \nhas been used previously by other researchers for these types of materials at a range \nof velocities [20,21] and is discussed in detail in previously presented work \n[17,18,19]. The polyurethane was modelled using a linear viscoelastic model \nsummarised by the following recursive formula used to calculate the viscoelastic \nstresses [14]: \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 8\nεβσσ\nβ\nβ ′−−+′=′\nΔ−\n∞\nΔ−\n+ &\n)1()(2 01\nt\nt\nnn\neGGe      (2) \nHere, the long term behaviour of the material is described by the elastic shear \nmodulus, G∞. Viscoelastic behaviour is modelled by the introduction of the \ninstantaneous shear modulus, G0 and a viscoelastic decay constant, β. Δt is the \nincremental time-step and ε&′ is the strain-rate for that time-step. \nBoth the instantaneous shear modulus G0 and the viscoelastic decay constant, \nβ were evaluated by simulating a rigid bullet passing through the resin without the \nglass and calibrating this value to the similar resin recovery rate and projectile \nresidual velocity observed experimentally with the high speed video camera (689 ± 10 \nm\/s for a beer-cup example). This yielded values of G0 and β of 119 MPa and 21 \nrespectively; G∞ was estimated from the elastic modulus measurements of E \n(assuming ν = 0.5) and was 1.4 MPa. However due to G0>> G∞ , the modelling \nresults were relatively insensitive to this value. Tensile failure of the resin was \nmodelled by applying a principle failure strain of 150%. \nThe equation of state was Mie-Grüneisen derived from a linear shock-particle \nrelationship thus: \n \nps SUcU += 0        (3) \n \nwhere Us and Up are the shock and particle velocities respectively, c0  is the bulk \nsound speed and S is the slope in the Us versus Up diagram. Material data is available \nin the AUTODYN material libraries and is presented in Table 3. The AUTODYN \nmaterial name is listed in brackets. \n \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 9\nTable 3: NEAR HERE \nTable 4: NEAR HERE \n \nFigure 2 shows a description of the numerical model set-up. The glass face of \nthe target was modelled using a Smooth Particle Hydrodynamics (SPH) processor. \nThis processor has previously been shown to be successful in modelling failure in \nbrittle materials [22,23,24] due to the avoidance of erosion and ability to \naccommodate separation in the material due to cracking. It also has been used to \nmodel materials that are subjected to large deformations such as tungsten alloy \npenetrators [24] and polymer-based composites [25]. Consequently, the bullet core \nwas modelled using SPH due to the very large amounts of deformation and material \nseparation observed experimentally. The core consisted of 1550 SPH nodes. The glass \ntargets consisted of 7750, 10250 and 12750 SPH nodes for 6, 8 and 10-mm thick \ntargets respectively. The jacket was modelled using a lagrangian jacket that provided \ngood definition for this relatively thin (0.75 mm) complex shape and consisted of 505 \ncells. The resin was modelled using a lagrangian processor with an erosion strain of \n200% -- this was the minimum erosion strain tested that did not adversely affect the \ndepth-of-penetration results. The mesh was graded at 15 mm from the central axis to \nexpedite the simulations (see Figure 2). Each cell in the central zone was 0.4 mm in \nsize. A lagrangian polycarbonate confinement was also added. \n \nFigure 2: NEAR HERE \n \nRESULTS \nThe depth-of-penetration results from the penetration into the targets of PRR \nare shown in Figure 3. The numerical results from the presented model set-up are also \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 10\npresented and demonstrate good correlation with the experimental measurements. An \nexample of the penetration using 6 mm of glass facing is shown in Figure 4. For the \nbeer-cup surround targets there was more scatter recorded in the penetration depths. \nThe likely explanation for this is that due to the geometry and size of these targets, \nrelatively little inertial confinement was offered to the penetrating projectile compared \nto the targets with the polycarbonate surrounds.  \n \nFigure 3: NEAR HERE \n \nFigure 4: NEAR HERE \n \n Figure 4 shows that during the penetration of the resin it has extended in \nlength with the remnants being present along the whole length of the cavity. \nMeasurements of the apparent diameter of the projectile showed that the expected \nreduction in diameter following the lengthening of the bullet, assuming constancy of \nvolume in plastic deformation, had not occurred. Microscopy revealed extensive \nporosity along the length of the residual projectile. There was also evidence of \nmushrooming at the tip, as well as a series of broken petals and “wings” pointing in \nthe direction of travel of the projectile. Typically, an amount of heavily distorted \ngilding metal from the jacket was present at the bottom of the cavity in the elastomer \n(See Figure 5). Smaller fragments of gilding metal can be seen along the length of the \ncavity. \n \nFigure 5: NEAR HERE \n \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 11\n This gilding metal has a similar hardness value as its original hardness which \nitself is typical of a cold-worked material with varying amounts of cold-work along \nthe length of the bullet (see Table 1). Typical hardness measurements of the recovered \ngilding metal and the core material at the front of the penetrating mass are shown in \nFigure 6.  \n \nFigure 6: NEAR HERE \n \nAnalysis of the high speed video of a bullet penetrating the glass-faced system \nshowed that as the round penetrates the PRR its tip is mushroomed into a \nhemispherical shape. The size of this shape was very much dependent on the \nthickness of the glass penetrated with the 10 mm glass face producing a hemispherical \npenetrating mass of approximately 20 mm diameter and the 6-mm glass face \nproducing a hemispherical shape of 13 mm diameter. Material continues to flow from \nbehind the projectile \/ target interface and when it encounters the PRR continues to \nmushroom. Typically for a 6-mm glass faced system between 50 and 75 µs after the \nmushroom begins to form, its radial expansion comes to a halt and elastic recovery of \nthe PRR begins. The strain-energy that is stored in the resin by the radial expansion of \nthe mushroom head is released and acts to contract the lead-antimony shank. The \nmaximum diameter of the lead antimony shank is reached at 100 µs after contact \nbetween the bullet and the glass face. Post-mortem analysis of a projectile penetrating \na glass-faced resin showed that the shank of the penetrating mass was contracted by \n50% when compared to the early-in-time video measurements. Figure 7 shows the \nfootage from the projectile penetrating a 6-mm faced target with the PRR cured into \nthe beer-cup surround. The time in-between frames is 50µs. \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 12\n \nFigure 7: NEAR HERE \n \nThe numerical programme yielded some insights into the penetration \nmechanisms that footage from the high-speed video camera could not reveal. The \npenetration mechanism through the glass-face is typified by the 10-mm example \nshown in Figure 8. At 10 µs after impact, the nose of the gilding jacket has been split \nand a process begins whereby the gilding metal is peeled away from the lead \nantimony core. Glass ahead of the penetrator is progressively damaged due to the \naccumulation of inelastic strains and is compressing the resin. Eventually, the strength \nof the damaged glass ahead of the penetrator forces the lead-antimony and the gilding \nmetal to flow radially. By 40µs the relatively soft lead antimony core was forced to \nflow in a mushroom-like fashion around the outside of the jacket. By 70 µs extensive \ndeformation to the gilding metal has taken place as the core material appears to flow \nrearward with relation to the front of the penetrating mass. However, it still retains \nforward inertia. By 100 µs, the resin material forces the failed rear-flowing antimony \nmaterial towards the axis of penetration.  \n \n \nFigure 8: NEAR HERE \n \nDISCUSSION \nThe penetration of the 7.62 mm × 51 mm NATO ball round into a glass-faced \nPPR resulted in an unusual penetration cavity. By comparing features of the \npenetrating mass at different time intervals we determined that the material on the \noutside of the penetrating mass was moving at a very much lower velocity than the \ncentrally located material and in some cases appeared stationary. For example, with a \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 13\n6-mm case shown below in Figure 9 the lump indicated by ‘A’ at the top of the image \nis also present in a very similar location 25 µs later. Similarly the lumps contained \nwithin the oval (‘B’) appear to have not moved despite the penetration progressing. \nWe believe that the most likely explanation for this is shown by the way in which the \nmodel predicted the penetration mechanism as shown in Figure 8. That is, during \npenetration core material is being forced from the central part of the penetrating mass \nto the extremities. Essentially, the bullet is being turned inside-out. Given that the \nfront of the penetrating mass appears to a have a hemispherical shape – in the early \nstages at least, we believe this to be a reasonable assessment. This is similar to the \nfluid-jet penetration mechanisms seen with high velocity penetrators [26]. However, \nunlike the eroded debris from a fluid-jet penetrating a target (where the density of the \njet is greater than the target) the lead antimony material that flows to the periphery \nappears to retain little or no inertia. This is probably due to the particulated penetrator \nmaterial becoming embedded in the resin as a consequence of contact pressure (see \nFigure 10). Post-mortem analysis of the penetrated samples revealed that it was very \ndifficult to separate the lead antimony core material that was embedded in the resin. \nConsequently, the final crater contained the deposits of lead antimony as shown in \nFigure 4.  \n \nFigure 9: NEAR HERE \n \nFigure 10: NEAR HERE \n \nMicrohardness measurements of the gilding metal suggested that very little \nwork-hardening had occurred and there was no evidence of re-crystallisation. The \nlocation of the gilding metal at the bottom of the crater as shown in Figure 5 suggests \nthat the gilding metal is being stripped to offer the lead-antimony to the PRR but \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 14\nremains at the front of the penetration channel. This was also confirmed by the \nexistence of an intact jacket after penetration of a 6-mm glass-faced target. In this \ncase, it appeared that the front of the gilding jacket had been peeled back to offer the \nlead antimony material; the rear portion of the jacket remained intact (see Figure 11).  \n \nFigure 11: NEAR HERE \n \nThe simple viscoelastic model appeared to corroborate the main experimental \nobservations in that the projectile’s jacket was stripped away by the glass whilst the \ntail of the gilding metal came to rest at the bottom of the cavity. The gilding metal \ncells were mostly eroded during penetration whilst the material was being deposited \nalong the length of the cavity.  The modelling results also showed a hemispherically-\nshaped penetrating mass moving into the resin. For the viscoelastic cases there was \ngood agreement between the experimentally measured depth-of-penetration and the \nsimulation results.  However, the model was unable to simulate the apparent adhesion \nat the lead antimony \/ resin interface due to cell-erosion behind the penetrating mass \nand the resulting uneven penetration channel. Consequently the lead antimony that \nflowed rearward with respect to the penetration interface retained a forward velocity \nthat was relatively small but significant compared to the penetration rate. \nThe modelling results showed that the penetration into glass led to the splitting \nof the gilding jacket and heavy deformation of the lead antimony core that eventually \nlead to a hemispherically-shaped plug of penetrating mass at the glass-PRR interface. \nThe diameter of this penetrating mass that included the comminuted glass, the gilding \nmetal and the lead antimony core material increased with the glass-face thickness and \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 15\nlike the experiments varied from approximately 14 mm in diameter for the 6-mm case \nto 20 mm for the 10-mm thick glass face. \nThe core within the cavity contained a significant amount of porosity. One \nexplanation is that as the jacket is being stripped away, the lead antimony is \nparticulated whilst being deposited. The recovery in the PRR then compresses the \nparticulated lead-antimony to form a channel of relatively porous material. The \nformation of the “wings” along the core is unexplained but may be due to the \nturbulent flow of the lead-antimony as recovery occurs. Remnants of the lead-\nantimony left on the recovered jacket shown in Figure 11 showed that it had flowed \nextensively however, no evidence of melting was found from the polished and etched \nsample. This indicated that the relatively low melting temperature of ~250°C for this \neutectic structure had not been reached at the latter stages of penetration. However, it \nis thought that the flow and \/ or particulation of the material would have been \nexacerbated by thermal softening. The measured hardness values for this material \nwere comparable to the values quoted in Table 1 indicating that little hardening had \noccurred during penetration.   \nFinally, Figure 3 shows that increasing the thickness of glass results in a lower \ndepth-of-penetration into the PRR resin. The weight advantage of each system can be \nassessed by comparing the areal densities of material penetrated, including the glass \nface and the resin. With this experimental set-up, the average areal density of material \npenetrated for the 6, 8 and 10 mm glass-faced system was 103 kg\/m2, 97 kg\/m2 and 90 \nkg\/m2 respectively (for the polycarbonate confined samples). Consequently, the 10-\nmm faced system is the most weight-efficient. This illustrates the importance of the \nglass face in deforming the projectile prior to penetrating the PRR resin. As the glass \nface thickness was increased, the degree of deformation in the lead antimony core was \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 16\ngreater. Therefore, for this resin and this experimental set-up there is no weight \nadvantage in using a larger resin thickness over glass.  \n \nSUMMARY AND CONCLUSIONS \n \nThe penetration of the lead antimony-cored 7.62 mm × 51 mm bullet into a \nglass-faced polymer resin produces a rather unusual penetration cavity. The crater \nformed contained a porous bullet core with significant elongation. A simple linear \nviscoelastic model was applied to AUTODYN-2D to describe the behaviour of the \nresin and numerical results of the penetration morphology and depth-of-penetration \nappeared to match experimental observations well. Analysis of the high-speed camera \nfootage and a numerical model of a bullet penetrating a viscoelastic polymer showed \nthat during the initial stages of penetration, mushrooming and radial flow of the core \nmaterial was occurring. Furthermore, it was evident from the experimental trials that \ncontact between the porous lead antimony and the resin restricted the penetration. \nExperiments and numerical simulations both showed that the final shape of the cavity \nwas defined by the relaxation of the polymer that leads to compression of the porous \ncore material. A weight analysis of the penetrated materials showed that using a \nthicker tile of glass resulted in better ballistic performance. \n \nACKNOWLEDGMENTS \n \nThe authors would like to thank their Cranfield University colleagues: Mr \nAdrian Mustey for metallography and tensile testing, Mr Paul Moth for hardness \ntesting and Mr Steven Champion and Mr David Miller for their assistance with the \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 17\nrange facilities. Some of this work presented was carried out for Harvey Longstaff’s \nForensic Engineering and Science MSc project dissertation.  The course chairman, Dr \nDavid Lane, is gratefully acknowledged. \n \nREFERENCES \n                                                 \n1. Edwards MR. Land-based military applications in \"Comprehensive Composite \nMaterials\" volume 6 (M G Bader, K T Kedward and Y Sawada eds), Elsevier \nScience, Oxford, (2000), 681-99. \n2. Radin J, Goldsmith W. Normal missile penetration and perforation of layered \nplates. Int. J. Impact Engng: 1988; 7: 229–259. \n3. Wright SC, Fleck NA, Stronge WJ. Ballistic impact of polycarbonate—an \nexperimental investigation. Int. J. of Impact Engng: 1993; 13 (1):1-20. \n4. Bourne, NK. On the impact and penetration of soda-lime glass. Int. J. of Impact \nEngng: 2005; 32: 65-79.  \n5. Chaudhri MM, Kurkjian CR, Impact of small steel spheres on the surfaces of \n“normal” and “anamolous” glasses. Journal of the American Ceramic Society: \n1986; 69 (5): 404-10.  \n6. Bouzid S, Nyoungue A, Azari Z, Bouaouadja N, Pluvinage G. Fracture criterion for \nglass under impact loading. Int. J. of Impact Engng: 2001; 25 (9): 831-845. \n7. Wilkins M L, Honodel C A, Swale D, An Approach to the Study of Light Armour, \nLawrence Radiation Laboratory, Livermore, UCRL-50284, June (1967). \n8. Wilkins M L, Cline C F, Honodel C A, Fourth Progress Report of Light Armour \nProgram, Lawrence Radiation Laboratory, Livermore, UCRL-50694 (1969). \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 18\n                                                                                                                                            \n9. Wilkins M L, Landingham R L, Honodel C A, Fifth Progress Report of Light \nArmour Program, Lawrence Radiation Laboratory, Livermore, UCRL-50980, \nJanuary (1971).  \n10. Hetherington J, The optimization of two component composite armours, Int. J. of \nImpact Engng: 1992; 12: 409-414.  \n11. Sadanandan S, Hetherington J G, Characterisation of ceramic\/steel and \nceramic\/aluminium armours subjected to oblique impact. Int. J. of Impact Engng: \n1997; 19: 811-819. \n12. Hetherington J G, Rajagopalan B P, An investigation into the energy absorbed \nduring ballistic perforation of composite armours. Int. J. of Impact Engng: 1991; \n11: 33-40. \n13. Chin S. Investigation of nanotechnology enhanced polyurethane replacement resin \n(PRR) as transparent armour material, MSc Thesis, Cranfield University, \nShrivenham Campus, (2004). \n14. AUTODYN™ Theory Manual, Century Dynamics Limited, Dynamics House, \nHurst Road, Horsham, West Sussex, RH12 2DT, UK. \n15. Johnson GR, Cook WH. Fracture characteristics of three metals subjected to \nvarious strains, strain rates, temperatures and pressures. Engineering Fracture \nMechanics: 1985; 21 (1): 31-48. \n16. Properties and Selection: Nonferrous Alloys and Special-purpose Materials, \nMetals Handbook, Vol 2, 10th Edition, ASM International (1990). \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 19\n                                                                                                                                            \n17. Johnson GR, Holmquist TJ. An improved computational constitutive model for \nbrittle materials, High Pressure Science and Technology—1993, Part 2, American \nInstitute of Physics, New York, pp. 981–984, (1994). \n18. Holmquist TJ, Johnson GR, Grady DE, Lopatin CM, Hertel Jr. ES. High strain \nrate properties and constitutive modeling of glass, Proceedings of the 15th \nInternational Symposium on Ballistics, Jerusalem, Israel, Vol 1, 21–24 May 1995. \np. 234-44. \n19. Richards M, Clegg R, Howlett S. Ballistics performance assessment of glass \nlaminates through experimental and numerical investigation. Proceedings of the \n18th International Symposium on Ballistics, San Antonio, Texas, USA, Vol. 2, \n15–19 November 1999, p. 1123-30. \n20. McDonnell JAM, Catling DJ, Herbert MK, Clegg RA. Quasistatic to \nhypervelocity impactor loading of glass: Autodyn hydrocode and static testing \nconfigurations. Int. J. of Impact Engng: 2001; 26: 487-496.  \n21. Taylor EA, Tsembelis K, Hayhurst CJ, Kay L, Burchell MJ. Hydrocode modelling \nof hypervelocity impact on brittle materials: depth of penetration and conchoidal \ndiameter.  Int. J. of Impact Engng: 1999; 23: 895-904. \n22. Clegg RA, Hayhurst CJ. Numerical modelling of the compressive and tensile \nresponse of brittle materials under high pressure dynamic loading. In Shock \nCompression of Condensed Matter – 1999 (M.D. Furnish, L. C. Chhabildas and R. \nS. Hixson), American Institute of Physics (2000), 321-324. \n23.  Lee M, Yoo YH. Analysis of ceramic\/metal armour systems. Int. J. of Impact \nEngng: 2001; 25 (9): 819-29.  \nInt. J. Impact Engng., 36 (1) pp. 147-153 (2009) \n 20\n                                                                                                                                            \n24. Hayhurst CJ, Clegg RA, Livingstone IH, Francis NJ, The application of SPH \ntechniques in AUTODYN-2D™ to Ballistic Impact Problems. In the proceedings \nof the 16th International Symposium on Ballistics, San-Francisco, 23-28 \nSeptember 1996 \n25. Quan X, Birnbaum N SPH simulation of the ballistic perforation of GFRP. In the \nproceedings of the 18th International Symposium on Ballistics, 15-19 November \n1999, San Antonio, Texas, USA. \n26. Christman DR, Gehring JW. Analysis of high-velocity projectile penetration \nmechanics. J. Appl. Phys: 1966; 37 (4): 1579-87.  \n 21\nTable 1: Key properties of the 7.62 mm NATO Ball round. \n \nBullet mass 9.4 g \nCore hardness HV (300 g load) 10 \nJacket hardness HV (300 g load) 150 – 160 (tip); 170 – 190 (base) \n \n \nTable 2: Measured mechanical properties of the resin. \n \nDensity (kg\/m3) 1078 \nHardness (Shore A) 90 \nTensile strength (MPa) 16 \nTensile elastic modulus (MPa) 4.1 \nElongation (%) 150-160 \nLongitudinal wave velocity (km\/s) 1.94±0.04 \n \n \nTable 3: Hydrodynamic data for the materials used. \n Notation \nPRR \n(Polyrubber) \nGilding metal \n(Copper) \nCore \n(Lead) \nPolycarbonate \nReference density \n(kg\/m3) \nρ 1010 8930 11340 1200 \nBulk sound speed \n(m\/s) \nc0 852 3940 2006 1933 \nSlope in Us versus \nUp diagram \nS 1.865 1.489 1.429 2.65 \nGrüneisen \ncoefficient \nΓ 1.50 2.02 2.74 0.61 \n 22\nTable 4: Strength data used for the materials. \n \n Notation Gilding metal Core Polycarbonate \nShear modulus (GPa) G 44 7 1 \nYield stress (MPa) Y0 575 40 88 \nThermal softening \nexponent \nm 1.09 1.0 - \nMelting temperature \n(°K) \nTm 1323 525 - \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 23\n \n \n0.7622.54\n28.73\n7.82\n \n \nFigure 1: Geometry and key dimensions of the 7.62 mm × 51 mm NATO ball bullet (dimensions in \nmm).  \n \n \n \nGraded meshResin (Lagrange)\n844 m\/s\nGlass target \n(SPH)\nPolycarbonate (Lagrange)\nNon-graded \nmesh\n \nFigure 2: Numerical model set-up.  \n \n0\n20\n40\n60\n80\n100\n120\n0 2 4 6 8 10 12\nGlass thickness (mm)\nD\nep\nth\n-o\nf-\npe\nne\ntra\ntio\nn \n (m\nm\n)\n0\n2\n4\n6\n8\n1\n1\nPolycarbonate surround\nBeer-cup surround\nModel\n \nFigure 3: Depth-of-penetration (DOP) measurements. \n \n 24\n \n \nFigure 4: Penetrated 6-mm glass-faced target and 7.62 mm calibre bullet shown for comparison \n(polycarbonate surround). \n \nFigure 5: Cross-section of cavity showing glass, lead antimony and jacket after penetrating a 6-mm \nglass-faced resin target (beer-cup surround). The arrow shows the direction of penetration. \n 25\n \n147 \n \n10 \n \n10 \n \n147 \n \n180 \n \n186 \n \n \nDirection of penetration \n \nFigure 6: Vickers microhardness (100gF load) measurements of the gilding jacket and lead antimony \nat the head of the bullet remains after it has completely penetrated 6 mm of glass  and penetrated the \nPRR (polycarbonate surround). \n \n \nFigure 7: Penetration of a 7.62 mm × 51 mm NATO Ball round into a 6-mm glass-faced PRR target \n(beer-cup surround); time between frames = 50 µs. The curved surfaces of the beer-cup produce a \nlens effect and consequently the penetrating mass appears larger in diameter than it actually is. \n \n \n \n 26\n \n \nFractured glass \ncompressing the \nresin\nAxis of penetration\nGlass and gilding \nmetal deposited in \nthe cavity\nt=10µs t=40µs t=70µs\nt=100µs t=130µs t=160µs\nContraction of core \nmaterial\nFailed lead \nantimony flowing \naround the failed \ngilding metal\n \n \nFigure 8: Numerical simulation of the penetration into a 10-mm glass-faced resin target with a \npolycarbonate surround; t = time from impact of glass face. \n \n \nJacket rear \n 27\nA\nB\nA\nB\nt t + 25μs  \nFigure 9: Penetration of a 6-mm glass-faced PRR target. The highlighted areas ‘A’ and ‘B’ indicate \nidentical facets of the penetrating mass; time in-between frames is 25 µs. \n \n \nParticulated \nmaterial embedded \nin the resin\nPRR \/ glass \ninterface\nPenetrating bullet\n \nFigure 10: Penetration mechanism of the bullet.  \n \n \n \n 28\n \n \nFigure 11: Recovered bullet after completely penetrating a 6-mm glass-faced PRR target (beer-cup \nsurround). \n \nRear portion \nof jacket. \n"}