{"doi":"10.1080\/0968776042000211485","coreId":"6035","oai":"oai:generic.eprints.org:615\/core5","identifiers":["oai:generic.eprints.org:615\/core5","10.1080\/0968776042000211485"],"title":"EDITORIAL","authors":[],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/6035.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/615\/1\/ALT_J_Vol12_No1_2004_EDITORIAL.pdf","pdfHashValue":"3bc55719f849de879fa288f9db97048923253b3d","publisher":"Taylor Francis Ltd","rawRecordXml":"<record><header><identifier>\n  \n    \n    \n      oai:generic.eprints.org:615<\/identifier><datestamp>\n      2011-04-04T08:52:13Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/615\/<\/dc:relation><dc:title>\n        EDITORIAL<\/dc:title><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:publisher>\n        Taylor Francis Ltd<\/dc:publisher><dc:date>\n        2004<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/615\/1\/ALT_J_Vol12_No1_2004_EDITORIAL.pdf<\/dc:identifier><dc:identifier>\n          UNSPECIFIED  (2004) EDITORIAL.  Association for Learning Technology Journal, 12 (1).  pp. 3-4.  ISSN 0968-7769 (print)\/1741-1629 (online)     <\/dc:identifier><dc:relation>\n        10.1080\/0968776042000211485<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/615\/","10.1080\/0968776042000211485"],"year":2004,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":" ALT-J, Research in Learning Technology\nVol. 12, No. 1, March 2004\n           EDITORIAL\nTaylor & Francis LtdCALT1210110.1080\/0968776...Resea ch in Learning Technology0968-7769 (print)\/1741-1629 (online)Article2 04As ociatio for Learning Techno ogy2 000March 2004This issue marks a new beginning for ALT-J; it is the first with our new publishers,\nTaylor & Francis, under their Carfax imprint. Re-launching a journal is, we have\nfound, an interesting process. Like moving house or changing jobs, it manages to\nblend logistical complications with a rare opportunity to pause, reflect and take stock.\nIt isn’t often that we have the chance to re-assess what is important to us, so as editors\nwe grasped this particular challenge with glee.\nOne thing we all valued was the belief that ALT-J should be a leading international\nfocus for the study of learning technology. Achieving this means reaching a wider\naudience and publishing thoughtful, scholarly research from across the world. We\nbelieve that this first issue is an important step towards this, but recognise that our\ncommitment to this principle is something that will need to be attended to on an\nongoing basis.\nWhat we agreed that we could not do is to simply print articles that report ‘what\nworks’. To do so would be naïve and would maintain the current position of fragmen-\ntation within the field. Whilst we expect that empirical studies will continue to form\nthe core of our articles, we believe that it is also important to understand why such\nfindings arise and what people should do about them. This means paying attention to\ntheory (understood broadly to including personal beliefs as well as formally recogn-\nised theoretical positions) and values (without which we cannot decide what is ‘good’\npractice and what might merely be more efficient) as well as outcomes.\nThe articles in this issue represent a useful illustration of these principles. Alongside\nstudies of the reuse of learning objects (by Currier et al) we have recommendations\nfor social re-engineering (provided by Koper et al) to facilitate this process. These\narticles also consider the impact of such contextual changes, with Peruski and Mishra\nlooking at the impact of introducing new technology on staff roles in higher education\nand Seale considering the ways in which legal constraints and our espoused values\nought to influence our practice. Moving from implications to meaning, Berglund\noutlines an approach to studying the use of learning technology (illustrating this in\nthe context of group activities within an online course) and Jones debates the question\nof whether the metaphor of ‘networks’ is helpful in understanding learning technol-\nogy. Both of these articles are generative, opening up opportunities for new research\nthat will allow these ideas to be explored in the context of particular studies.\nWe are also committed to the belief that our understanding of this field should\nremain open, rather than allowing any single position to dominate and stifle discus-\nsion. We felt it was important to keep our discussion section for this very reason, to\nillustrate how different perspectives can help strengthen and deepen our understand-\ning of the field. This issue sees Gunn and Dempster exploring ideas raised byISSN 0968–7769 (print)\/ISSN 1741–1629 (online)\/04\/010003–02\n© 2004 Association for Learning Technology\nDOI: 10.1080\/0968776042000211485\n 4\n \nEditorial\n        Dempster and her colleagues concerning the challenges of using portals to support\nor create communities of practice. It is our hope that illustrating such exchanges will\nencourage readers to approach articles in an open, questioning way.\nThis is the vision we hoped to capture with this first, re-launched issue. Welcome\nto ALT-J.\nMartin Oliver, Deputy Editor\nGrainne Conole, Editor and Jane Seale, Deputy Editor\n"}