{"doi":"10.1177\/0306312710385853","coreId":"197015","oai":"oai:lra.le.ac.uk:2381\/9237","identifiers":["oai:lra.le.ac.uk:2381\/9237","10.1177\/0306312710385853"],"title":"Alter-ontologies: Towards a constituent politics in technoscience","authors":["Papadopoulos, Dimitris"],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2010-12-15","abstract":"This paper identifies four recent conceptualizations of politics in relation to technoscience that focus on expertise, institutional participation, the inclusion of non-human others and the importance of marginalized experiences. The paper argues that each of these forms of politics is mainly concerned with renegotiating the already constituted terms of inclusion in a specific technoscientific field. In many cases such a strategy is necessary, but the paper aims to open up discussion of alternative forms of politics that act as constituent forces of radical social and material transformation in technoscience: alter-ontologies.Peer-reviewedPost-prin","downloadUrl":"http:\/\/hdl.handle.net\/2381\/9237","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/9237\/2\/Papadopoulos-Alter-onto_FINAL%20AS%20SENT%20TO%20PRODUCTION.pdf","pdfHashValue":"59b2e19891c43939b490081f9b650919936b6e12","publisher":"Sage","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/9237<\/identifier><datestamp>\n                2013-10-23T15:39:48Z<\/datestamp><setSpec>\n                com_2381_322<\/setSpec><setSpec>\n                com_2381_9551<\/setSpec><setSpec>\n                col_2381_512<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nAlter-ontologies: Towards a constituent politics in technoscience<\/dc:title><dc:creator>\nPapadopoulos, Dimitris<\/dc:creator><dc:subject>\nalter-ontology<\/dc:subject><dc:subject>\nassembly<\/dc:subject><dc:subject>\nconstituent politics<\/dc:subject><dc:subject>\nexpertise<\/dc:subject><dc:subject>\nobjectivity<\/dc:subject><dc:subject>\nparticipation<\/dc:subject><dc:subject>\nsituated knowledges<\/dc:subject><dc:subject>\ntechnoscience<\/dc:subject><dc:description>\nThis paper identifies four recent conceptualizations of politics in relation to technoscience that focus on expertise, institutional participation, the inclusion of non-human others and the importance of marginalized experiences. The paper argues that each of these forms of politics is mainly concerned with renegotiating the already constituted terms of inclusion in a specific technoscientific field. In many cases such a strategy is necessary, but the paper aims to open up discussion of alternative forms of politics that act as constituent forces of radical social and material transformation in technoscience: alter-ontologies.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPost-print<\/dc:description><dc:date>\n2011-04-14T10:03:24Z<\/dc:date><dc:date>\n2011-04-14T10:03:24Z<\/dc:date><dc:date>\n2010-12-15<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nSocial Studies of Science, 2011, 41 (2), pp. 177-201<\/dc:identifier><dc:identifier>\n0306-3127<\/dc:identifier><dc:identifier>\nhttp:\/\/sss.sagepub.com\/content\/41\/2\/177<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/9237<\/dc:identifier><dc:identifier>\n10.1177\/0306312710385853<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nCopyright © The Author(s) 2010. Deposited with reference to the publisher’s open access archiving policy.<\/dc:rights><dc:publisher>\nSage<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0306-3127","issn:0306-3127"]}],"language":null,"relations":[],"year":2010,"topics":["alter-ontology","assembly","constituent politics","expertise","objectivity","participation","situated knowledges","technoscience"],"subject":["Article"],"fullText":" –1– \n \nAlter-ontologies: Towards a constituent politics in technoscience \n \nDimitris Papadopoulos \nUniversity of Leicester \n \nContact author: \nDimitris Papadopoulos, School of Management, University of Leicester, Ken Edwards \nBuilding, Leicester LE1 7RH, UK. Email: papadopoulosd@cardiff.ac.uk \n \nAbstract \nThis paper identifies four recent conceptualisations of politics in relation to technoscience, \nwhich focus on expertise, institutional participation, the inclusion of non-human others, and \nthe importance of marginalised experiences. The paper argues that each of these forms of \npolitics is mainly concerned with renegotiating the already constituted terms of inclusion in a \nspecific technoscientific field. While in many cases such a strategy is necessary, the paper \naims to open up discussion of alternative forms of politics that act as constituent forces of \nradical social and material transformation in technoscience: alter-ontologies. \n \nKeywords \nalter-ontology, assembly, constituent politics, expertise, objectivity, participation, situated \nknowledges, technoscience \n \n \n \nAttempts to find definite descriptions of the connection between technoscience and politics \nare usually prone to reductionism and oversimplification. The traditional way in philosophy \nof science to think of this relation was epistemology, where the content of technoscience and \nthe associated politics were subordinated to ways of knowing and defining truth (Alcoff, \n1998). Social studies of science emerging in the 1970s contested this view, but their attempts \nto question traditional epistemology devolved into a new cycle of epistemological disputes \nbetween proponents of rationality and sociality (Longino, 2002). These debates will be \nbriefly discussed later in this paper. My argument here is that epistemology is less useful as a \ntool for discerning and navigating through the intricacies of scientific knowledge\/politics than \nas a tool for reproducing them by other means. The covert politics of epistemology \nculminated in provoking the science wars of the 1990s. \n The response to these heated debates in science and technology studies (STS) was an \nattempt to exit epistemology altogether. Furthermore, there is an increasing tendency to \nconsider science together with technological and other applications -- as technoscience or in \nthe words of Jerome Ravetz (2006) post-normal science. These changes led to a new \nunderstanding of objectivity; one that limits its validity in time and space to a certain field but \nnevertheless recognizes that technoscientific knowledge holds objective status within that \n –2– \n \nfield. That is, knowledge is shaped by the actual process of technoscientific research and its \nobjects and simultaneously shapes social relations and material arrangements in each \nparticular field. Here, I use the expression 'regions of objectivity' to refer to the ultimate \nhorizon against which any question about politics in technoscience can be discussed. In the \nsections that follow, I will discuss four current conceptualizations of how politics is \nconsidered to be operative in a region of objectivity. I start with a formalist approach to \npolitics, which is mainly concerned with rethinking expertise and creating the appropriate \nprocedures for considering legitimate experts in a debate. A second approach to politics, \nparticipatory politics, is concerned with the expansion of the limits of public deliberation in a \nregion of objectivity. The third approach focuses on the extension of our understanding of \npolitics beyond human actors. A fourth emerges when actors who have been hitherto \nneglected in a region of objectivity contest existing knowledge and restructure the conditions \nof scientific knowledge production from the standpoint of their experience.  \n Not only do all these approaches attempt to conceptualize different types of politics in \na region of objectivity, but they also are directly or indirectly influenced by existing forms of \npolitical practice beyond the realm of technoscience. I will draw upon resources stemming \nfrom political theory, social theory and actual political practice that inform the understanding \nof these four approaches. This leads to the final section of the paper, which attempts to open \nup debate on a form of politics which seems to be less visible in prevalent approaches to \ntechnoscience: I call this alter-ontological politics, in reference to the practices of new social \nactors emerging in the wake of the alter-globalization movements in the past ten years. The \nmain concern of these politics is to create different forms of knowledge production that act as \nconstituent forces of political change: forces aiming to craft alternative regions of objectivity.  \n \n \nExit from epistemology: Regions of objectivity \n \nConstructivist positions emerging within the field of the social studies of science and \ntechnology, starting in the1970s and ’80s asserted that scientific knowledge is genuinely \nsocial and political: depending on values, interests, ideologies, and resources available to the \nresearcher in the laboratory or in the field. This view was fiercely disputed by proponents of \nobjectivist positions who argued that knowledge is a cognitive achievement emerging out of \nthe application of rational criteria for evaluating salient phenomena of the social or natural \nworld. In a strange way, both positions are somehow relevant and neither of them is quite true \n –3– \n \non its own: there is always a social and political context shaping the design and outcomes of \nresearch, and there is always relative autonomy to the intrinsic rules and material constraints \nthat govern how research takes place. So, if the distinction between constructivism and \nobjectivism does not hold (at least in the way often supposed), why was it conceived as a \nproblem that dominated the debates over the nature of knowledge production for almost \ntwenty years? A likely answer is that these debates served as instruments for changing the \ncontents of knowledge. Rather than illuminating how knowledge is produced, they served as \nmeans by which scientific and social scientific knowledge itself was contested or \nconsolidated. \n The constructivism-objectivism debates tried to establish zones of contention in the \nmiddle of a relatively stable unfolding of science and social science. Epistemological \ndiscussions became an integral part of the everyday functioning of the fabrication of \nknowledge. Even if epistemology is a poor way to understand how knowledge is \nmanufactured, objectivist and constructivist arguments serve as an exceptional tool that can \nbe used to challenge the very content of knowledge. Epistemological disputes are usually \ndeveloped by specialists (for example social studies of science scholars or philosophers of \nscience) but the discourses themselves are implicated in the production of science itself. Like \nthe controversy between Boyle and Hobbes, contemporary scientific dispute are fought also \non the ground of what counts as truth, and not only on the success of particular experiments. \nThe debate about ideology in the natural and life sciences coming from the radical science \nmovement was not just about politics, truth and ideology but had implications for the \nconstruction of knowledge itself, for example in strengthening the critical voices against \ngenetic reductionism in biology. We could conclude from such debates that epistemology \nneither shapes scientific knowledge directly nor is a completely independent discourse \nhovering above the 'real' scientists themselves. Epistemology is an active force -- one of \nmany and probably not the most important -- in the making of scientific knowledge. The \nquestion of evidence (scientific and social scientific research) and the epistemology of \nevidence (epistemological debates in each particular scientific field, philosophy of science \nand social studies of science and technology) are both located in the same economy of \nknowledge production. Epistemology is not about scientific research, it is its continuation.  \n Following the science wars of the 1990s there seems to be a departure from \nepistemology as a detached observation of science, and a subsequent turn to consider \nepistemological debates as part of the broader conditions of knowledge production. Scientists \nand their research -- the organisms, things or populations under study; technological \n –4– \n \napparatuses, methodological instruments and epistemological debates; ethical beliefs, cultural \nimaginaries and the wider polity; interest groups and state authorities; transnational \ninstitutions and national funding bodies -- all are players in the same game. They exist in \nsame social\/ontological field and their co-actions establish spaces in which certain ways of \nthinking and acting, and the very materiality of their existence, appear as given, or, if you \nlike, as matters of fact. In this paper, I shall call such an integrated field a region of \nobjectivity. This type of objectivity is very different from the objectivity that dominated the \ndebates of the 1980s and earlier, as the undistorted representation of the logic of things. As \nwe exit epistemology and enter into zones of contention, a different conception of objectivity \nappears to be emerging, as knowledge now seems to be objective in a certain field to the \nextent that it manages to thoroughly transform the material conditions of existence in that \nfield. It is objective to the extent that different actors in the field manage to object, transform \nand remake the process of knowledge production itself. Thus, being objective is no longer \nconsidered to be an abstract qualifying attribute of knowledge, but refers instead to the \nefficacy of knowledge practices to transform the materiality of existence.  \n Desires, hopes and investments in the objects under study -- be they individuals, \nsocial groups, animals or things -- mingle with the constraints these objects impose on the \nresearcher, as well as with interest groups, ethics and beliefs, affected social actors, and state \ninstitutions.  Together, they produce knowledge in ways that inexorably transform the \nimmediate ontological composition of a region of objectivity. The main question for my \nargument is: What holds together a region of objectivity and organises the internal relations \nbetween the multiplicity of actors involved, if we know already that organizing agency is not \nlimited to social interests or other external factors, scientific authority itself, or some hidden \nepistemological foundation? I would argue that it is a form of politics, but what kind of \npolitics? There is something paradoxical here: the stronger and more stable a region of \nobjectivity, the stronger the impression that politics has been expelled from it. Nevertheless \nwe also know that the stronger a region of objectivity is, the more it relies on some sort of \npolitics that regulates collective relatedness in order to attain and maintain its (relative) \nstability. What is the particular type of politics we perform in a region of objectivity? What is \nthis form of politics and how does it differ from and relate to other forms of polity? That is, \nwhat is the politics of knowledge when it is not about epistemology, but about the making \nand remaking of regions of objectivity? In the following sections, I approach four distinctive \nanswers to these questions. \n \n –5– \n \n \nFormalist politics and the liberal predicament \n \nOne approach to how a region of objectivity is constituted and regulated is to illuminate how \nlegitimacy is conferred to participate in a debate over a technoscientific issue. This is a \nprescriptive approach to technoscience and politics, which tries to demarcate expertise and \ndeploy a formal structure to resolve technoscientific controversies. It is thus an exercise in \nformalist politics. The starting point is a classification of different types of expertise that are \nnecessary for shaping public discourse and decision-making (Collins and Evans, 2007). In the \nCollins and Evans version, the formalist approach focuses mainly on identifying different \nforms of expertise beyond 'contributory' expertise (that is the highest level of expertise \npossessed by active practitioners who have a level of skill and knowledge allowing them to \nparticipate fully in their scientific field and to contribute substantially to its development).  \n Here, the inclusion of legitimate experts (and subsequently the exclusion of non-\nlegitimate experts) in a formalised process of deliberation over a technoscientific controversy \nis seen as the main way to reshape the relations between different actors in a region of \nobjectivity. Crucial in this process is then to extend expertise in a regulated way by using \ncertain standards for identifying actors who can express valuable opinions about relevant \ntechnical aspects in a controversial issue (for examples, see Edwards and Sheptycki, 2009; \nWeinel, 2007). From the perspective of formalist politics there is a technical phase and a \npolitical phase in every technoscientific issue: technical decisions should be left to experts \nand experts should try to avoid influences from the broader cultural and political environment \n(Collins and Evans, 2007: 8-9; Collins, et al., forthcoming). This distinction between \ntechnical and political phases challenges the social constructionist enterprise, as discussed \nearlier. Instead of focusing on how extra-scientific factors influence the production of \nknowledge (the so called political phase), the formalist approach tries to find out how intra-\nscientific factors can be meaningfully regulated. This may seem like a response by social \nconstructivists to the science wars of the 1990s, and it is indeed a way to preserve the relative \nautonomy and specificity of scientific knowledge. Social constructivism becomes Weberian, \nbut with a twist or two: not only can the credentialed 'contributory experts' make a difference \nin the technical phase of debate, but so can other potential experts who lack contributory \nskills but hold potentially important knowledge on particular topics in virtue of their \nexperience. However, this is not a trick used in the wake of the science wars to appease \nscientists enraged with the debunking of their specific expertise by social constructionists. \n –6– \n \nRather, it is an attempt to preserve the specificity of scientific knowledge production while \nalso opening it up to contributors who had not been acknowledged previously.  \n The formalist approach simultaneously opens and closes the process of knowledge \nproduction. It opens the process of legitimacy by not restricting it to contributory experts, but \nit closes it down again when the process of scientific knowledge production is about to \nimplode through the introduction of extra-scientific interests. The opening is performed by \nassigning expertise to social actors who possess relevant knowledge without being \ntraditionally recognised as contributory experts. Collins and Evans (2007: Ch. 3) call this \ncrucial type of expertise interactional, which allows affected social groups with sufficient \nexperience and knowledge to participate in a debate over a specific controversy. However, \nthey also exclude other types of knowledge, such as general popular understanding or \nknowledge extracted from primary sources without deeper immersion (Collins and Evans, \n2007: Ch. 1). This inclusion and exclusion of different expertises attempts to define and \npreserve the borders of what counts as legitimate expert participation in a region of \nobjectivity. In fact, the formalist approach is about policing these borders, rather than offering \nsubstantial sociological or other insights into any particular scientific controversy. \nThe formalist approach addresses the question of politics not in a substantive way, but \nby defining rights of participation and inclusion. It does not formulate a core set of guiding \nissues which can be used to resolve a controversy or a debate. Rather it attempts to provide a \nframework for regulating how to approach a technical issue. An underlying assumption of the \napproach is the necessity of basic agreement on the normative principles that govern the \ndeliberation process, and so its point of departure is contractualism (Rawls, 1971). Formalist \npolitics ask what circumstances should be appropriate for resolving a technoscientific \ncontroversy, and what principles of deliberation should people reasonably embrace in order \nto achieve resolution. That is, it tries to set out rules according to which all legitimate \nparticipants offer reasons for or against certain arguments; rules that need to be followed in \nunforced communications in which all participants act reasonably, and are well-informed \n(Habermas, 1993; Scanlon, 1998). According to the formalist approach, such principles are \nnegated when extra-scientific politics enter into the technical phase of a debate and dilute \nexpert negotiations. This logic is akin to the centrality experts play in contemporary liberal \ndemocratic political ontology (Turner, 2003), in which well-informed representatives and \nexperts are assumed to settle disputes in terms of fundamental rules based on principles that \nprotect everyone: a constitution that regulates the process of decision making.  \n –7– \n \nHowever, there is a crucial complication with the formalist approach: the structures \nthat can be used to facilitate informed and democratic deliberation over a particular \ncontroversy are already permeated by the controversy itself. The political architecture that \ncreates the possibility for resolving the controversy does not exist prior to the controversy \nitself. The crux of formalist politics -- the possibility of constituting a flawless space as a \nstarting point for communication between the participants in the social contract -- is an \nuntenable position when viewed in real historical perspective. Such a space is never a given \nor actual starting point. One can argue that this presents an even stronger argument for the \nformalist approach: the more such spaces of communication elude us the more they are \nnecessary, the more they are necessary the more we should accept them as a paramount value \n(what Collins calls 'elective modernism'). However, elevating formal-regulative principles to \ncore values does little other than to invoke an authoritative moral code; it does not make them \nwork in reality. Formalist politics occupy the space of the normative by vacating the space of \nthe actual. \nLike any other version of formal-regulative ethics of political engagement (see for \nexample Habermas, 1984), formalist politics in science and technology miss the substantial \nembeddedness of structures of communication in the deeply asymmetrical and unequal social, \ncultural and historical grammars that traverse the structures themselves (Wellmer, 1977; \nTaylor, 1986). Formalist politics thus miss the fact that controversies emerge, not because a \nproper process of expert deliberation has not (yet) taken place, but because it already has \nfailed somewhere along the way. The formalist approach is good at illustrating, in retrospect, \nhow such failure takes place. However, a historical moment in which science and technology \nincreasingly fold into each other, demanding that actors behave as though they could invoke a \nseparate and pure technical phase, becomes untenable. In fact, what the formalist approach is \ngood at detecting is the stratified and unequal contributions that each participant can make. \nWhat it cannot do is to engage with them in a real and processual fashion. Formalist politics \noccupy the space of observation by missing the space of transformation.  \nIt is, of course, the case  that formal rules sometimes can instigate social \ntransformation in a region of objectivity. When rules of negotiation are derived from the \nparticular conditions of a controversy they can have transformative effects. When viewed \nfrom an historical political perspective, such rules are always the target of social movements \nthat contest the formal structures of liberal democracies by demanding radical changes in the \nnorms and legislation governing social reality (for example, the civil rights movement, the \nwomen's movement, the gay rights movement), but this kind of understanding is exactly what \n –8– \n \nthe formalist approach denies. Formalist politics are literally formal: the rules are not derived \nfrom a certain situation or controversy; instead, the same rules are assumed to apply to every \ntechnoscientific controversy. Formalist politics -- in a truly Habermasian fashion (see \nWimmer, 1980) -- attempt to operate as a transcendental judge in order to control procedures \nfor deliberating over the controversy. This external universalising position can only function \nas an adjustment within the constituted order in a certain region of objectivity. Despite its \nheuristic function and democratic flair, the formalist approach cannot act as constituent force \nthat remakes, not only the rules for debate, but also its very content and scope. Formalist \npolitics perpetuate the given constituted order because they fail to engage with effective ways \nfor intervening in the actual circumstances of a controversy.  \n \n \nParticipatory politics and the limits of institutions \n \nA second approach to conceiving politics in a region of objectivity focuses on the conditions \nof participation and the processes through which lay people are included in debates over \nscientific research. The participatory approach does not start from a 'normative' or 'formalist' \ndefinition of who has the necessary expertise to be included in the deliberation process. \nInstead, it makes a structural claim about the inclusive conditions for shaping science and \ntechnology (Lengwiler, 2008). This approach thus focuses on three aspects of participatory \npolitics: Who needs to be included? Where and when is participation needed? How can we \nenhance participation; what specific processes need to be considered?  \n The broad answer to the 'who?' question usually attempts to develop insight into how \nto facilitate the co-constructive role of the public for shaping technological objects and \nscientific practices. It attempts to go beyond seeing the public as an influence on applications \nand social consequences of science (Wynne, 2005; Irwin and Michael, 2003; Leach et al., \n2005). The public is a highly elusive and easily instrumentalised category, however. Attempts \nto concretise the public mainly include stakeholders such as NGOs, affected social groups \n(usually self-organised), or other Civil Society Organisations into the process of decision \nmaking. They tend to emphasize user groups, patient groups, and activist groups that organize \nthemselves to articulate specific claims on existing technologies (for examples see Callon and \nRabeharisoa, 2008; Elliott et al., 2010; Epstein, 1996; Felt et al., 2008). This particular form \nof inclusion has its roots in the women's health movement (Hubbard et al., 1979) and feminist \napproaches to medicine (Clarke and Olesen, 1998; Rapp, 2000), organizations of people \n –9– \n \nliving with HIV and AIDS (Epstein, 1995), as well as environmental health movements \n(Brown, 2007).  Facilitating the participation of such groups can be strengthened by changing \nbroader scientific research agendas themselves or more specific science policies. For example \nthere are calls to intervene in science 'upstream' (Wynne, 2003), before applications are \ndecided and when it is still possible to shape the compilation of research agendas. Science \npolicy has received particular attention in science and technology studies as well as the \ninvestigation of active interventions in the policies for governing science (Chilvers, 2008; \nJasanoff, 2003; Rowe and Frewer, 2004; Webster, 2007).  \n The question of 'where?' often appears in close connection to the problem of 'how?': \nwe find approaches that call for practices that invigorate advocacy (Fortun, 2001), public \nengagement (Elliott and Williams, 2008) and that reinforce the conditions of possibility for \naccountability (Munro and Mouritsen, 1997; Neyland and Woolgar, 2002). There are also \nbroader quests for a civic epistemology and the setting up of an agora as space for negotiation \nbetween scientific and social actors (Nowotny et al., 2001) as well as accounts that strive to \nenhance inclusive procedures in decision making (Liberatore and Funtowicz, 2003) and \ndeliberation (Davies, 2006). \n Participatory politics in all their variety and nuance shift the focus from who is an \nexpert or who is a legitimate participant in a region of objectivity to the problem of enhancing \ninclusion of lay citizens, and in certain cases to the issue of becoming expert. They are thus \nconcerned with changing the very structures in which debate in a region of objectivity takes \nplace. Participatory politics differ significantly in their scope, target, tactics and radicalism. In \nthis paper when I refer to participatory politics I mean approaches that aim to reform existing \ninstitutions in order to change the conditions of citizens' inclusion. Of course, there are more \nradical approaches that go so far as to question the whole institutional structure and propose a \nradical democratic approach to creating grassroots initiatives, or even alternative institutions. \nSome of these more radical democratic positions will be discussed later, as part of the \ngrounded approaches that highlight the importance of power inequalities in society and their \neffects on the shaping of science and technology. The form of participatory politics that I \ndiscuss here is more central to STS, which are mainly concerned with the role of social \ndifference in science policy and with invigorating public participation (Epstein, 2007). \nDeliberative democracy, policy adjustments and public accountability become the tactical \nmeans deployed in participatory politics to promote inclusion that changes the balance of \nknowledge\/power in a region of objectivity. \n –10– \n \n The public in participatory approaches is imagined to be civil society -- one of the \nmost empty and vague categories in social and political theory. This concept of the public \ntends to homogenise people beyond the main participants in a debate -- it can be a whole \nnation, the inhabitants of a certain region or city, or an affected group of people by a certain \ntechnology or scientific application. In a sense, this ‘outside’ public is constructed by the \n‘inside’ actors who define the terms of the debate. However vague and opportunistic, this \nconcept of the public performs an important function for the balance of power in a region of \nobjectivity: it acts as an avatar of civil society. The civic imperative of participatory politics \nis to construct regions of objectivity such that civil society can be included in processes of \ndirect democratic decision-making. Civil society in participatory approaches refers to actors \nwho come together on a voluntary basis rather than as functions of state-supported \ninstitutions such as education and science, or pure market forces. Civil society is seen as a \ncounterbalance to both strong individualising tendencies of liberal democracies that \nemphasise the single person as well as to the excessive growth of particular state functions \nand governmental institutions. Instead of focusing on abstract and formal procedures for \nsettling technoscientific controversies, participatory politics emphasise that sound science \npolicy can only be achieved if there is a system in place that relies on citizen deliberation and \nengagement. \n There is here a strong echo of communitarian positions (Taylor, 1991; MacIntyre, \n1981), which portray a ‘community’ whose members negotiate specific issues in terms of \ntheir 'horizons of meaning'. In participatory politics, the public is comprised of social groups \nand communities who deliberate over a common good against the background of a shared \nhorizon of practice and meaning. Participatory politics works on the interface between the \ncommunity and existing institutional structures. Institutional spaces guarantee the broadening \nor narrowing of the accepted horizons of meaning against which a controversy in a region of \nobjectivity can be debated and eventually resolved.  \n The keyword here is framing: appropriate framing of an issue in order to include \npublic actors. Framing in this context is not a pure discursive strategy (Leach et al., 2005); \nrather it refers to real social spaces that enable alternative ways to frame an issue. However, \nthe questions of how far and how many actors can be included in the deliberative processes of \nan institution is always filtered through the existing possibilities and margins that the \ninstitution allows -- in Neyland and Woolgar's (2002: 272) words the 'conditions of \npossibility for accountability'. Participatory politics -- and here I refer to the mainstream of \nparticipatory approaches, not to radical forms of participation which will be discussed below \n –11– \n \n-- operate as corrective forces to the shortcomings of existing institutions. It is not the \ninstitutions that are seen from the perspective of the public but the public that is seen from the \nperspective of the institution. Transforming existing institutions can, of course, have far \nreaching effects in democratising a region of objectivity. Nevertheless the limitation remains \nthat the public is indeed a plastic category that shrinks or extends to include the stakeholders \nwho can be included in a given institutional structure. Participation of this kind operates in an \nalready constituted field of existing institutional coordinates which not only define a certain \nproblem but also its potential participants. As such it has far reaching consequences but does \nnot provide for a form of constituent politics that not only transforms existing institutions but \nalso has the capacity to operate, if necessary, outside existing institutions and to give birth to \nalternative forms of action, imagination and reasoning in a region of objectivity. \n \nAssembly politics and the ignorance of governance \n \nIf participatory politics focuses on the inclusion of social actors in existing political \ninstitutions, Actor Network Theory (ANT) attempts to include non-humans in descriptions \nand ways of acting in a region of objectivity. ANT avoids thinking in terms of the socio-\npolitical and the natural as divided worlds. In accordance with Whitehead's diagnosis of the \nbifurcation of nature, ANT has questioned the split between science and the humanities\/social \nsciences. It proposes a reassembling of the social that complicates this bifurcation and \nprevents us from 'counting in advance' what comprises society and nature (Latour, 1993). \nDingpolitik according to Latour (2005b) -- and here we also can think of other ANT theorists \n(e.g. Mol, 2002; Law, 2004; Callon, 1987) -- is a way to explore how humans and non-\nhumans collectively and in an emergent way make meaning out of an issue by being \nimplicated in networks of connectivity.  \n Thus the main concern is to describe these connections, and to elucidate the \nappropriate assembly for dealing with particular issues: 'Every new non-human entity brought \ninto connection with humans modifies the collective and forces everyone to redefine all the \nvarious cosmograms' (Latour, 2007: 813). Cosmograms are divergent and often conflicting \nways of actual world-making. Latour argues that the task of STS is to 'detect how many \nparticipants are gathered in a thing to make it exist and to maintain its existence' (Latour, \n2004: 246; see also Stengers, 2005). Latour and other ANT theorists therefore also propose a \nformalist approach, albeit quite different from that described earlier: to define the appropriate \nstaging for each problem, so as to enable effective processes of representation, mediation and \n –12– \n \ntranslation between human and non-human actors. In order to accomplish this, it is necessary \nto maintain symmetry between the different actants and explanations, since a hasty \nconclusion about a prevalent form of agency can trap us into 'prematurely naturalized \nobjectified facts' (Latour, 2004: 227). Attention to symmetry reveals how new entities are \nformed in the socio-material world and how new complex 'entanglements' (Callon and \nRabeharisoa, 2004) of mutual attachments involve different actors and things. \n The central political theme reverberating through the assembly approach is a strong \nanti-foundationalism, in particular a critique of the split between society and non-human \nothers, whereby 'society' and its organizational principles are given primacy over the non-\nhuman in other STS accounts. This anti-foundationalism is situated in the broader context of \nfashionable object-oriented theories concerned with issues of diffused power, hybridity, \nemergence, and open architectures of networks. Anti-foundationalism of this kind rests on the \nassumption that a given entity is an effect: it is made through its connections with other \nthings: 'Actor-network is, has been, a semiotic machine for waging war on essential \ndifferences' (Law, 1999: 7). What exists is produced and made through relations: 'relations \neverywhere' (Strathern, 2005: 37).   \n This focus on relations and connections, I want to argue, corresponds to a broader \nshift in thinking about politics as governance in contemporary political theory and practice: \npolitics as an affair of actants perpetually adapting to, and establishing alliances and networks \nwith, others. This conceptualisation of the political implicitly critiques the governmentality \nmodel that has dominated socio-political theory in recent decades (e.g. Barry et al., 1996). \nInstead of self-activating actors and processes of subjectivation, that is instead of conceiving \nthe production of subjectivities as an effect of power, governance is a form of a-subjective \nmanagement which emerges through connecting actors and creating alignments between \nthem.  \n Governance has increasingly become a dominant trope of political thought and \npractice (Rosenau and Czempiel, 1992; Rhodes, 1997). Governance signifies the erosion of \nconstitutionalism as an established set of generally accepted principles in sovereign law. It is \npost-constitutionalist, that is, in a scene populated by many different interconnected and \npartial actors, governance offers a common mode of effective political stability and \nfunctioning (for example: Bevir and Rhodes, 2003; Edwards and Hughes, 2005; EC \nCommission, 2001). In other words, the polity is not made possible by following predefined \nor abstract principles imposed by a central authority (usually the nation-state). Rather, \ngovernance today describes the process that regulates the search for regulating principles, in \n –13– \n \nthe absence of an authority which guarantees such principles. Regulating principles are \ndeveloped ad hoc through intensive negotiation between participating actants. In the language \nof ANT this is an assembly. The important contribution of assembly politics is that it \nelucidates the existence of, and the connections between, human as well as non-human actors \nwhich are necessary for sustaining a region of objectivity.  \n However, governance is not an innocent form of political organisation and \nmanagement, it is related to an overarching form of production predominant in contemporary \nWestern societies (Harney, 2006). It is a mode which renders the actants and entities \nparticipating in a region of objectivity productive, in a double sense: First, politically \nproductive and, second, active participants in the existing mode of production. Regarding the \nfirst: there is a preoccupation in ANT with discerning how a situation comes into being, how \ncomplex assemblages evolve through the relational actions of the participating actants. This \nis the political side of assembly politics: it necessitates the creation of new political forums \nwhich accommodate the emerging constellations between human and non-human others. \nHowever, the insertion into the political assembly happens in correspondence with the \nincorporation of these entities into a new mode of production. Assembly here refers to its \nother meaning, the assembly plant, yet this is not the linear assembly line of the Fordist \nfactory, but the self-valorising assembly system of the Post-Fordist economy. This economy \nis characterised by deindustrialisation, the rise of services and immaterial work in the Global \nNorth, the global precarisation of employment relations, flexible and lean production \narchitectures and the neoliberal dismantling of social provision (see for example Panzieri et \nal., 1976; Marazzi, 1998; Gorz, 1999). \n Thinking politics in a region of objectivity in terms of governance goes hand in hand \nwith the emergence of new forms of displacement. The assembly, as the space for negotiation \nand governance, is not just a descriptive category for practices in the current polity. Rather, it \nresolves certain limitations and antinomies of the existing order and at the same time installs \nnew forms of social and material control. The point here is not about good or bad governance, \nbut about how governance as such is the very political algorithm of contemporary structures \nof power. Various positions question the effects of governance and the underlying logic of \nproductionism (Papadopoulos et al., 2008; Haraway, 1992b; Negri, 2005; Harney, 2008). \nWhat is common to all of them is that they highlight the proliferation of injustice towards \nthose who cannot or are not willing to contribute to the spaces that are regulated through \ngovernance. The assembly, as the space where governance is executed, is all-inclusive apart \nfrom those who do not or cannot express themselves in the required language -- let alone \n –14– \n \nthose who are unwilling to contribute to production or, even worse, who undermine the \nassembly with alternative political actions.  \n Latour (2004) envisions the assembly as a new possibility for political action that \ngoes beyond politics as 'debunking'. An emphasis within STS on debunking, understood as \nthe search for hidden causes behind people's actions, was responsible for igniting a strong \nantagonism from scientists (who supposedly neither know the sources nor the effects of the \nknowledge they produce). Social constructivism is probably the most powerful 'debunking' \ndevice in STS: it seeks to unravel the secret and invisible life of scientists' practices. The \nscience wars were in fact a response to this understanding of science. Against the old-\nfashioned debunker, Latour proposes the 'new critic', someone who assembles, who is \nvisionary, chic, slick, witty and effective, the spokesperson of the region of objectivity, \nsomebody who smoothes the way of the participants into the new assembly.  \n However, this new critic resembles the prototypical inhabitant of the productionist \nregime of the Global North after the rise in the past twenty years of governance and the \nconsolidation of neoliberalism. For Latour, the ultimate political question is: '[c]an \nfundamentalism be undone?' (Latour, 2005a: 31; see also Latour, 2003: 28). In other words \nhow can we ignore or attenuate the effect of all these actors who disrupt the assembly of \ngovernance with an intractable conviction about justice, who ask inappropriate questions, \nwho position themselves outside the 'we' of the assembly, who create alternative spaces and \nbring the wrong messages? 'If you cannot bring good news, then don't bring any' is ANT's \nanswer. Ignore the troublemakers, ignore otherness which is incompatible. From the point of \nview I am developing in this paper it is necessary to betray the constituted order of \ngovernance in order to allow for a really self-organised assembly to take place, such as the \nradical democratic social and ecological movements since the end of the 1990s have shown \nso clearly (Chesters and Welsh, 2006; Papadopoulos et al., 2008). Assembly politics offers an \nimportant insight into the intricacies of a region of objectivity by enlarging our understanding \nof material agency, but ultimately these new forms of agency are reinserted into the \nconstituted form of polity. \n \n \nGrounded politics and the indeterminacy of experience \n \nHaraway's (1988) proposal for a situated view of technoscientific knowledge signifies a very \ndifferent starting point for conceiving politics in a region of objectivity. Instead of thinking \n –15– \n \nthat a region of objectivity is an already constituted field, a situated perspective identifies \nwith the neglected experiences that certain participants in a region of objectivity enunciate \n(also see Star, 1991). This line of knowledge politics initially arose within feminist standpoint \ntheory. It engages with different marginalised standpoints in a context of structural relations \nof power (e.g. Rose, 1994; Harding, 1991; Hartsock, 1983). This approach to knowledge \npolitics attempts to understand how knowledge is situated and grounded in the real conditions \nof conflicting existences in a region of objectivity. It is the very process of approaching \nknowledge as a grounded endeavour that valorises neglected experiences as 'oppositional' \nknowledge (Sandoval, 1991). One of the avenues that standpoint theory opens is the \ninsistence that the 'we' so often assumed or summoned in all previous approaches does not \nexist (the contractualist we, the possibility of all-inclusive institutions or the we of the \nassembly). Of course, recognised experts, policy-makers, law-makers, facilitators, observers, \nor mediators are all necessary instances in creating the political architectures of a region of \nobjectivity, but from the perspective of grounded politics the most crucial viewpoint is that of \na fully engaged yet partial participant in a real socio-material configuration. This is the reason \nwhy I call this approach grounded: grounded in actual social and material modes of being and \ntaking into account that every attempt to contest or change them, every possible line of flight, \nhas, as its starting point, situatedness in a concrete ecology of existence. \n Politics in this grounded approach ensues because every engagement with science and \ntechnology is arranged across asymmetrical positions. While other approaches attempt to \navoid asymmetry altogether (the assembly approach), or locate asymmetry in the quality of \nour knowledge (the formalist approach) or in the access to structural institutional functions \n(the participatory approach), the grounded approach sees asymmetrical relations as \nconstitutive of the very conditions that produce science and technology in a region of \nobjectivity. Thus we see stronger critiques of how technoscience contributes to domination \n(Winner, 1993; Feenberg, 1991) or louder calls for a deep change of the social and political \nstructures that facilitate radical forms of intervention (Figueroa and Harding, 2003; Shiva, \n2006). Finally, attention is drawn to mobilisations of radical science movements (Nowotny \nand Rose, 1979; Rose and Rose, 1969; Ravetz, 1990) and radical democratic participation \nand science activism (Woodhouse et al., 2002; Hess, 2007b). Many of these positions are \nreflecting radical critiques of technological, scientific and medical rationalities (e.g. Illich, \n1979; Marcuse, 1991; for a discussion see Feenberg, 1995) and are historically rooted in the \nsocial movements of 1960s and 1970s -- in particular feminist, antiwar and antinuclear and \necological movements and the new social movements after the 1990s (Hess, 2007a, 2004; \n –16– \n \nWelsh et al., 2007). It is no coincidence that standpoint theory, which marked an important \nhistorical moment in the development of grounded politics, resonates strongly with a Marxist \nview of social organisation. Existing institutions (as in the participatory approach), calibrated \nand standardised procedures (as in the formalist approach), or spaces of inclusion (as in the \nassembly approach) are facets of a continuous movement of social transformation that is \nprimarily initiated by neglected, silenced or effaced positions in an asymmetrical and thus \nantagonistic social order. \n Yet the grounded approach also opens up a post-Marxist reading of social \ntransformation when it refuses to reduce all the contradictions in a region of objectivity to the \ntotalizing social dichotomy and dialectical struggle emanating from one underlying \nantagonism (usually conceived as the antagonism between capital and labour). Here there is \nno monolithic totalising structure that determines the existence of marginalized positions \n(Marcuse, 1991), it is rather a decentered and multifaceted structure of injustice that produces \na range of different positions. This understanding of marginalised positions is supported by \nthe rejection of a unified reading of the composition of oppositional experience. Instead, there \nis a focus on how different autonomous 'subaltern' social groups -- black people, migrant \nworkers, women, new segments of the working class which could not be easily subsumed to \nfactory workers -- develop divergent self-organised experiences which do not simply reflect \nthe main social antagonisms but diffract them into new forms of social existence (Malos, \n1980; Moulier Boutang, 1998; Negri, 2005; Papadopoulos et al., 2008).  \n However there is an important question which has to be asked in relation to the very \nnature of the groups, human and non-human, which are effaced in a region of objectivity: \nCan their experience -- which is positioned as a more authentic form of objectivity (Harding, \n1986) -- be treated as given and definite? Does the experience of the excluded pre-exist the \nrelation of exclusion? While the formalist and participatory approaches seem to take \nexperience for granted (as a 'have' or 'have not' feature of an individual actor), the assembly \napproach complicates the problem of experience by refuting its primacy altogether. \nExperience seems to be either reified as a substance or eliminated and dissolved in pure \nconnectivity (for an extended discussion see Papadopoulos and Stephenson, 2007). This \nimpasse between reification and dissolution also pertains to early positions in the grounded \napproach to politics. The problem here lies in a paradox for performing politics that starts \nfrom the assumption that situatedness in an asymmetrical world matters. If experience is \nreduced to a mere reflection of the immediate given position of the actor in power \ninequalities, it is also reduced to something that is instantaneously accessible and transparent. \n –17– \n \nIt is this move that undercuts any possibility for real transformation of the actors themselves \nbecause they are ultimately captured in an endless process of reiterating their own experience. \nThis move underpinned identity politics during the post-war period in the Global North. \nAlthough cultural studies have vividly shown that identity is always in process, because it \nentails the remaking of the actors themselves and their social relations (Clifford, 2000; Hall, \n1990; Papadopoulos, 2006), the 1990s marked a moment at which identity politics became \nincreasingly unable to contribute to radical political mobilisations. Poststructuralism \nattempted to resolve this problem by introducing an idea of experience as discursive \nformation (e.g. Scott, 1991). This consists of two parallel endeavours: it challenges both the \nindividualistic fallacy invoked in much talk of experience, and the notion that experience is a \nmonolithic and transparent object of knowledge. However, this important critique of \nexperience usually goes hand in hand with a reduction of experience to a mere socio-\nhistorical incident that undercuts any possibility for agency and introduces a disembodied \nform of social relationality and existence (Stephenson, 2003).  \n Can grounded politics challenge the pervasive logic that sees experience trapped in \nthe binary logic between reductionist essentialism on the one hand and discursive anti-\nfoundationalism on the other? Is it possible to question both the reification of experience in \nearlier accounts of grounded politics as well as the elimination of experience through the \nthinking of governance, assemblies and discourse? The answer is yes, if experience is \nunderstood as something which is simultaneously constructed in the process of knowledge \npolitics and yet powerful enough to craft alternative worlds that challenge a given region of \nobjectivity. The crucial move here is that actors do not already have experience, they make it \nas they collectively contest existing forms of injustice. Experience in this sense evades \nrepresentation: represent yourself and your experience (reification of experience in \nessentialist positions) or study the representations of experience in discourse (dissolution of \nexperience in anti-foundationalism). Thus, the processual and collectively constructed \nunderstanding of experience that I am arguing for here becomes a retreat from the self, from \nclichéd subject positions, from the oppressive reduction of experience to the discourses \nprevailing in a certain context. Experience becomes a process that pushes itself to change \n(Whitehead, 1979). Experience is all there is (for an extended discussion, see Stephenson and \nPapadopoulos, 2006). \n The point of departure for grounded politics is how experience of the involved human \nand non-human actors is collectively produced. The involved actors experience the world by \nmaking it, in a process where radical divergences between participants are negotiated and \n –18– \n \nthese negotiations constitute the processes of social and ecological world making (Haraway, \n1992a). Many new social movements -- probably first and foremost the alter-globalisation \nmovement and radical ecological movements -- rely on non-representational understandings \nof experience that do not connect participants on the basis of shared subject-positions or \nexperiences, but on the basis of creating common spaces that afford negotiation of the radical \ndivergences between them and allow for common action. This politics contests formalist \napproaches (whether in the form of the inclusion of experts or of governance) as well as \napproaches which limit participation to an institutional endeavour. From the perspective of \ngrounded politics the point is not to create the correct assembly or institution but to engage \nwith the dividing forms of power that count -- whether we like it or not -- for the practice of \nexisting radical divergences in social, material and ecological environments (Haraway, 1988; \nBracke and Puig de la Bellacasa, 2009; Stephenson and Papadopoulos, 2006).  \n \nTable 1: Politics in technoscience \n \n \nAlter-ontologies: Constituent politics in technoscience \n \nDespite their significant differences and occasional disputes, all these approaches cast light \non distinct aspects of the political in technoscience. In a peculiar way they all seem to \ncomplement each other. Perhaps this is the reason why a field as diverse as STS can be still \nconsidered a field, a region of objectivity in its own right. Winner's question '[d]o artefacts \nPOLITICS KEY PROCESS \nPOLITICAL \nONTOLOGY \nCRUX \nformalist \nnormative \ndefinition of \nexpertise \ncontractualism \ndemocratic \nliberalism \nactual structures of \ncommunication \nparticipatory \ndeliberation and \ninclusion of the \npublic \ninvigoration of \ncivil society \ncommunitarianism \ninstitutional \nreductionism \nassembly \nanti-\nfoundationalism \nrelational \nproductionism \ngovernance ignorance \ngrounded situated action \ncontentious \npolitics \nsocial and \necological \nantagonism \nformation of \nexperience \n –19– \n \nhave politics?' is more than a crucial research question or an astute description of one of the \nfirst items on the agenda of a then-emerging field; it indicates the plane on which many of the \nissues in STS can be debated. Although the various approaches described in this paper \noccupy different positions on this plane, they remain within it and contribute to the \ndevelopment of the field by performing the very politics they try to describe. Perhaps a \nrecurring theme in all these approaches is that they scrutinise the barriers of a region of \nobjectivity: by broadening and codifying the limits of legitimate participants, the expansion \nand re-structuring of institutions, the inclusion of non-human actors, or the inclusion of \nneglected voices.  \n Technoscientific artefacts are indeed political phenomena. Every new technoscientific \nartefact resembles a legislative act that inaugurates a form of public order (Winner, 1986). \nWhat this paper asks is: if technoscientific things are legislative acts then how is it possible \nnot only to develop a politics that illustrates and highlights the nature of these acts, but also \ncontributes to their making? This is what is meant throughout this paper by constituent \npolitics: a force that not only operates in the realm of the already constituted order but also \nreconstitutes a region of objectivity by developing language and skilled practices for the \nmaking of things: not how things are made, but how to make things with constituent political \nenergies. The issue is therefore to develop a form of politics in technoscience that attempts to \ncreate alternative forms of life that primarily aim to make new socio-material realities rather \nthan renegotiating the conditions of a given constituted order (as with formalist, participatory \nand assembly politics). I borrow the term forms of life from Winner (1986, especially Ch. 1), \na term he traces back to Wittgenstein as well as to Marx. In forms of life we encounter a re-\nweaving of the social and the material through the development of new practices and \ntechnologies. However, a practice or new technical device is not just used. It does not just \nenter into an existing organisation of life. Rather, a form of life is remade through it; a \npractice, a set of practices, a device, a new form of relationality becomes part of a form of life \nby changing it. Here I want to foreground a materialist reading of forms of life: they set up \nthe very material constraints to what we are, how we act and what we can become: 'What has \nto be accepted, the given, is -- so one could say -- forms of life' (Wittgenstein, 1958: 226). I \nunderstand this as the making and sustaining of forms of life which have to be accepted \nbecause they transform the social and material order in ways that cannot be bypassed or \nneglected. Therefore, a form of life acts as a set of constraints against which actions as well \nas possibilities for new actions evolve and take place. It is in this sense that a form of life \ncannot be bypassed -- not because it defines in a deterministic fashion the outcome of actions \n –20– \n \n(Smith and Marx, 1994), but because actions take place in the real space and time of a form \nof life.  \n The meaning of constituent politics in technoscience can be illustrated with the \nexample of AIDS treatment activism in the 1980s. Epstein's (1995) description of how \nactivists became recognized experts and increasingly contributed to shaping biomedical \nresearch can be re-interpreted as a form of constituent politics. Epstein describes a moment \nwhen a collective inserted itself into a biomedical region of objectivity in ways that \nundermined the existing terms and conditions of debate. He investigates how AIDS treatment \nactivism, once it became powerful enough to enter existing institutions (such as the FDA \ndrugs trial committees), changed the format of treatment research, clinical trial procedures \nand the distribution of medication,. In contrast, I am here interested in how AIDS activism \nbecame possible at all in order to be able to affect the changes Epstein describes. Epstein \ninvestigates the formation of AIDS activism in a somewhat teleological way: as something \nthat targeted the inclusion of the movement's demands in committees and regulation. I want \nto read AIDS activism differently: as concrete, ordinary practical action that primarily \ntargeted the making of justice in everyday life. Such remaking of the everyday led to the \nformation of new conditions of existence and action, which could not be ignored by existing \ninstitutions and public discourse. So, an approach is required that can account for the \nemergence of such actors long before any question about their inclusion is apparent. If one \nwishes to discuss constructivism (Stengers, 2008), then this would be a truly constructivist \nform of politics: the making of entities that change the conditions of possibility in a region of \nobjectivity. \n In retrospect, AIDS treatment activism has been analysed from the perspective of \nexpertise and formalist politics; enhancing institutional participation; assembly politics, in \nterms of tracing the unpredictable entanglements of human (patients, activists, research, FDA \nregulators, etc.) and non-human (HIV virus, medications, tests for viral loads, circulating \nblood, etc.) actants; an actor which develops a voice based on the conditions of its exclusion. \nIn this example however, I want to suggest a politics in technoscience that achieves all of \nthis, but additionally and primarily participates in the very making of an actor that ultimately \nchanged the very conditions of counting, perceiving, knowing, seeing and acting in the region \nof objectivity of HIV. It is exactly this kind of constituent politics that HIV treatment activists \nembarked upon in the early 1980s (Harrington, 2008; Bersani, 1987), long before their \npractices were codified as a form of politics (whether formalist, assembly or participatory). \nThey reordered the conditions of everyday experience so as to facilitate the emergence of a \n –21– \n \nnew social actor, as well as the conditions in which questions could be posed anew \n(Stephenson and Papadopoulos, 2006). They created a whole new everyday lifeworld, by \nbuilding organisations on the ground, renting and squatting spaces that facilitated a common \nculture, changing their sexual practices, fighting homophobia, sharing non-available \nmedication in illegal clubs, re-appropriating biomedical knowledge, confronting oppression, \nand reordering personal relations and intimacies.  \n This is the moment that is crucial for constituent politics: the making of a socio-\nmaterial actor on the level of everyday existence, before negotiations about inclusion in \nexisting institutions, expert committees or assemblies are possible. Now, beyond that, \nimagine a constituent politics approach within STS research that can provide concepts and \npractices that account for and participate in the making of such an actor. Politics happens \nwhen certain human or non-human actors, imperceptible actors, emerge in the \ntechnoscientific scene and change the very constitution of being by materialising ordinary \nrelations of justice. Politics is not primarily concerned with contesting given regimes of \ncontrol by introducing new diversifications of law: that is, rules of equality, the codification \nof rights and the cultivation of public responsibility. This seems to be a paradoxical \nproposition since rules of equality, rights and responsibility constitute an indispensable and \nplausible part of today’s forms of active political engagement (and are also at the heart of the \nformalist, participatory and assembly approaches, and to a certain extent the grounded \napproach). Rather, politics arises from the emergence of the miscounted, those who have no \nplace and whose capacities remain imperceptible within the normalizing organization of the \nsocial realm (Rancière, 1998). Politics is a collective enterprise that exposes a given social \norder to be limited, contingent and inconsistent by creating an alternative lifeworld inhabited \nby the previously miscounted. \n The aim of this paper was to pose the question: How can we develop an account of \nconstituent politics that is relevant to the specificities of technoscience: a constituent politics \nthat accounts for the remaking of the very substance of being and of life? If technoscience \ntoday produces new worlds of existence -- new ontologies -- constituent politics in \ntechnoscience is about producing alternative ontologies: alter-ontologies. This involves \nmerging social and material transformations in ways that cannot be simply accommodated \nwithin the existing order of a region of objectivity. In fact the whole constituted situation \nitself needs to be restructured (Rancière, 1998) in order to be able to respond to the \nalternative ethical, political and material projects that a constituent power puts in motion. \nConstituent power acts in this sense as a subject (Negri, 1999: 324), but a subject which is not \n –22– \n \nexternal to technoscience itself. Although this subject emerges from within the dynamics of a \nspecific technoscientific field, it, paradoxically, gradually dissolves as a subject and becomes \na new form of life that is an alternative social and material way of being. This is what AIDS \ntreatment activists did years before they became political subjects in their own right and \nconstituted a social movement with a distinct profile. Activists created an alternative \nobjectivity, and alter-ontology of existence. How else can we describe the circulation of \nillegal medications, bodily self-experimentation, the changing of forms of everyday \nsociability and of sexual intimacy, the militant attacks of political institutions, and the \nmaterial restructuring of urban spaces? Alter-ontologies go beyond the subject-object \ndichotomy, not because everything is hybrid or because everything is related to everything \nelse, but because they establish forms of life that are simultaneously the effect and the \nprecondition for the continuation of existence of marginalised actors. \n The new social movements of the past decade have increasingly focussed on such \nsocio-material constituent politics. Consider for example the alter-globalisation movement, \nlabour struggles of precarious workers, feminist politics, the new migration movement, \nradical ecological mobilisations (Bauchspies and Puig de la Bellacasa, 2009; Papadopoulos et \nal., 2008; Puig de la Bellacasa, 2010a; Samaddar, 2010; Shukaitis et al., 2007). This kind of \npolitics has yet to find clear articulation in the world of technoscience; articulation in the \nsense of expression but primarily in the sense of recombining existing approaches to politics \nin new, unexpected ways. Constituent politics in technoscience cannot but emerge out of the \ndifferent accounts of politics already existing in STS. They draw from the formalist approach \nits democratic sensibility towards non-contributory experts, from participatory politics its \nbottom-up citizen perspective on science, from assembly politics the agency of non-humans, \nand finally from grounded politics -- of which constituent politics are obviously a direct \ncontinuation -- the importance of a situated view of complex asymmetrical lifeworlds and the \ntransversality of neglected experiences. At the same time constituent politics evolve from the \nlimitations of these approaches: the neglect of the conflicts which underlie technoscientific \ncontroversies in the formalist approach; the reduction of public deliberation to the extent to \nwhich given institutions allow participatory politics; the ignorance towards radical \ndivergences which do not comply with relational networks of governance in assembly \npolitics; the reification of the experiences of marginalised actors in early notions of grounded \npolitics. \n Making something that is not already given in technoscience, that performs \nconstituent politics in technoscience, is something that, firstly, is concerned with matter and, \n –23– \n \nsecondly, is necessarily a posthumanist affair. Starting from the latter, posthumanism does \nnot deny human agency, nor does it signify the obsolescence of the human (posthumanism is \nnot about a post-human world); instead, it refers to the complex socio-material constellations \nin which certain human, non-human others and the biosphere participate equally but \ndifferently in the creation of alternative environments of existence (for examples see Puig de \nla Bellacasa, 2010a). This is an approach to politics that questions the new grand narratives of \n'innovation and sustainability' in favour of a more 'humble view of human roles and powers \nalong with a more demanding sense of personal responsibilities' (Winner, 2009) in order to \ncreate viable forms of life. This relation to posthumanism is neither about representational \npolitics in a new parliament of things nor about including things as equal others, but about \nredrawing the material conditions of existence in close cooperation with non-human others in \na way that forces the constituted order in a certain region of objectivity to rearrange itself. In \nan important book Callon and colleagues propose that the posthumanist condition can be \ndealt with by entering into hybrid forums of negotiation and exchange (Callon et al., 2009). \nThey discuss how actors enter into a new hybrid space of exchange in order to be transformed \nthrough this very process of negotiation. However this endeavour proposes (once again) a \nnew representational arena that will foster communication between, and transformation of, \nthe human and non-human actors involved. Constituent politics are less concerned with the \ncreation of such representational spaces. Rather they attempt to create material alliances \nbetween particular groups of people (there is no such thing as 'humans') and particular non-\nhuman others (there is no such thing as the 'non-humans') in order to confront injustice and to \nmake new conditions that ultimately challenge how a certain region of objectivity works. So \nthe first issue for constituent politics is to develop the tools and practices for making \ncooperative alliances between particular human and non-human groups in order to establish \nalternative lifeworlds of material justice. \n Constituent politics are neither acts of opposition nor of renegotiation of the \narchitectures of power (as Callon et al. propose with their hybrid forums); rather constituent \npolitics attempt to think through and literally make alternative forms of sociability and \nmateriality. Constituent politics in technoscience are inherently transformative and operate \nimmanently on the plane of matter and material justice. The second open question for \nconstituent politics is thus the question of matter and material justice. Constituent politics is a \nform of politics in technoscience that not only is concerned with knowing but also with \ncareful doing (Haraway, 1997; Puig de la Bellacasa, 2009, 2010b). Crafting alternative \nreadings, new stories of the world, new ways of existing in the world -- all these practices \n –24– \n \ncoexist on the same plane of action. In this sense constituent politics in technoscience is not \njust a theory about science and technology but a 'minor science of matter as such' (Deleuze \nand Guattari, 1987: Ch. 12; for a discussion see Papadopoulos, 2010). Pamela Smith's work \nshows that artisanal production was crucial for the emergence of the rationalist objectivist \nscientific word-view which came to dominate the Western world increasingly after the 16th \ncentury. It was the artisans' work, an intellectual revolution from the bottom up, that \n'transformed the contemplative discipline of natural philosophy into an active one' (Smith, \n2006: 239; see also Sennett, 2009). Artisan science was later codified and appropriated into a \nnew disembodied epistemology of experimental science; but experimental science never \nabandoned artisanal production. In fact experimental sciences always rely on artisanal \nproduction and the minor science of matter. It is on the purported modesty of meticulous \nartisanal efforts that Boyle's bottom-up experimental laboratory science wins over Hobbes' \ntop down geometric science (Shapin and Schaffer, 1985; Haraway, 1997). Rather, what has \nhappened is that experimental science and, to a larger extent today's corporate science, came \nto obliterate and alienate this artisanal work with matter (Shapin, 2008: 172). The open \nquestion for constituent politics is how to re-appropriate the capacity to craft with matter, \nhow to reclaim a science of matter, which, rather than being anchored in a given institution, \nposition, network or subjectivity, creates alternative conditions of existence that make new \nforms of life emerge: Alter-ontologies. \n \nNotes \nDiscussions with Maria Puig de la Bellacasa and her invaluable critical comments made this \npaper possible. Special thanks go to Harry Collins, Joanna Latimer and Ernst Schraube for \ntheir suggestions. The input from presentations of earlier versions of this paper at the Culture, \nImagination and Practice Research Group and the Centre for the Study of Knowledge, \nExpertise and Science at the School of Social Sciences, Cardiff University, the Institute for \nEuropean Ethnology, Humboldt University in Berlin and the Centre for Philosophy and \nPolitical Economy, University of Leicester, and especially the comments from Stefan Beck, \nMichalis Kontopodis, Steve Brown and Stevphen Shukaitis were crucial for developing the \nideas presented here. This paper wouldn't be possible without the collaborations with Niamh \nStephenson and Vassilis Tsianos and our common work in earlier publications. \n \n \nReferences \n \nAlcoff L (1998) Epistemology: The Big Questions. Malden: Oxford: Blackwell. \nBarry A, Osborne, T and Rose N (1996) Foucault and Political Reason: Liberalism, Neo-\nliberalism, and Rationalities of Government. Chicago: University of Chicago Press. \n –25– \n \nBauchspies W, Puig de la Bellacasa M (guest eds) (2009) Special issue: Re-tooling \nsubjectivities, exploring the possible with feminist science and technology studies. \nSubjectivity 28. \nBersani L (1987) Is the rectum a grave? October 43: 197-222. \nBevir M, Rhodes, RAW (2003) Interpreting British Governance. London: Routledge. \nBologna S (2006) Die Zerstörung der Mittelschichten: Thesen zur Neuen Selbstständigkeit. \nGraz: Nausner & Nausner. \nBracke S, Puig de la Bellacasa M (2009) The arena of knowledge: Antigone and feminist \nstandpoint theory. In: Buikema R and van der Tuin I (eds) Doing Gender in Media, \nArt and Culture. London: Routledge, 39-53. \nBrown P (2007) Toxic Exposures: Contested Illnesses and the Environmental Health \nMovement. New York: Columbia University Press. \nCallon M (1987) Society in the making: The study of technology as a tool for sociological \nanalysis. In: Bijker, WE, Hughes, TP and Pinch, TJ (eds), The Social Construction of \nTechnological Systems: New Directions in the Sociology and History of Technology. \nCambridge, Mass.: MIT Press. 83-103. \nCallon M, Lascoumes P and Barthe Y (2009) Acting in an Uncertain World: An Essay on \nTechnical Democracy. Cambridge, MA: MIT Press. \nCallon M,  Rabeharisoa V (2004) Gino's lesson on humanity: Genetics, mutual entanglements \nand the sociologists role. Economy and Society 33: 1-27. \nCallon M, Rabeharisoa V (2008) The growing engagement of emergent concerned groups in \npolitical and economic life: Lessons from the French Association of Neuromuscular \nDisease Patients. Science, Technology, & Human Values 33(2): 230-261. \nChesters G, Welsh I (2006) Complexity and Social Movements: Multitudes at the Edge of \nChaos. London: Routledge. \nChilvers J (2008) Deliberating competence: Theoretical and practitioner perspectives on \neffective participatory appraisal practice. Science Technology and Human Values 33: \n155-85. \nClarke A, Olesen VL (1998). Revisioning women, health and healing : feminist, cultural, and \ntechnoscience perspectives. New York: Routledge. \nClifford J (2000) Taking identity politics seriously: 'The contradictory, stony ground ...'. In:  \nGilroy P, Grossberg L and McRobbie, A (eds.) Without Guarantees: In Honour of \nStuart Hall. London ; New York: Verso: 94-112. \nCollins HM, Evans R (2007) Rethinking Expertise. Chicago: University of Chicago Press. \nCollins HM, Weinel M and Evans, R (forthcoming) The politics of the third wave and \nelective modernism. Critical Policy Studies. \nDavies G (2006) Mapping deliberation: Calculation, articulation and intervention in the \npolitics of organ transplantation. Economy and Society 35: 232-258. \nDeleuze G, Guattari F (1987) A Thousand Plateaus: Capitalism and Schizophrenia. \nMinneapolis: University of Minnesota Press. \nEC Commission (2001) European Governance: White Paper. COM(2001) 428 final: \nAvailable at: http:\/\/europa.eu.int\/comm\/governance\/white_paper\/index_en.htm. \nEdwards A, Hughes G (2005) Comparing the governance of safety in Europe: A geo-\nhistorical approach. Theoretical Criminology 9: 345-63. \nEdwards A, Sheptycki J (2009) Third wave criminology: Guns, crime and social order. \nCriminology & Criminal Justice, 9(3): 379-97. \nElliott E, Harrop E, and Williams G (2010) Contesting the science: Public health knowledge \nand action in controversial land-use developments. In: Bennett P and Alman K (eds) \nRisk, Communication and Public Health. Oxford: Oxford University Press. \n –26– \n \nElliott E, Williams G (2008) Developing public sociology through health impact assessment. \nSociology of Health and Illness 30(7): 1101-16. \nEpstein S (1995) The construction of lay expertise: AIDS activism and the forging of \ncredibility in the reform of clinical trials. Science Technology and Human Values, \n20(4): 408-37. \nEpstein S (1996) Impure Science. AIDS, Activism, and the Politics of Knowledge. Berkeley: \nUniversity of California Press. \nEpstein S (2007) Inclusion: The Politics of Difference in Medical Research. Chicago: \nUniversity of Chicago Press. \nFeenberg A (1991) Critical Theory of Technology. New York: Oxford University Press. \nFeenberg A (1995) Alternative Modernity: The Technical Turn in Philosophy and Social \nTheory. Berkeley: University of California Press. \nFelt U, Fochler M, Mager A and Winkler P (2008) Visions and versions of governing \nbiomedicine: Narratives on power structures, decision-making and public \nparticipation in the field of biomedical technology in the Austrian context. Social \nStudies of Science 38: 233-258. \nFigueroa R, Harding S (eds) (2003) Science and Other Cultures: Diversity in the Philosophy \nof Science and Technology. New York: Routledge. \nFortun K (2001) Advocacy after Bhopal: Environmentalism, Disaster, New Global Orders. \nChicago: University of Chicago Press. \nGorz A (1999) Reclaiming Work. Beyond the Wage-Based Society. Cambridge: Polity Press. \nHabermas J (1984) The Theory of Communicative Action. Cambridge: Polity. \nHabermas J (1993) Justification and Application. Remarks on Discourse Ethics. Cambridge, \nMA: MIT Press. \nHall S (1990) Cultural identity and diaspora. In: Rutherford J (ed), Identity: Community, \nCulture, Difference. London: Lawrence and Wishart, 222-237. \nHaraway DJ (1988) Situated knowledges: The science question in feminism and the privilege \nof partial perspective. Feminist Studies, 14(3): 575-599. \nHaraway DJ (1992a) Primate Visions: Gender, Race, and Nature in the World of Modern \nScience. London: Verso. \nHaraway DJ (1992b) The promises of monsters: A regenerative politics for inappropriate\/d \nothers. In: Grossberg L, Nelson C and Treichler PA (eds), Cultural Studies. London: \nRoutledge, 295-337. \nHaraway DJ (1997) Modest_Witness@Second_Millennium. \nFemaleMan©_Meets_OncoMouse™: Feminism and Technoscience. New York: \nRoutledge. \nHarding S (1986) The Science Question in Feminism. Ithaca, NY: Cornell University Press. \nHarding S (1991) Whose Science? Whose Knowledge? Thinking From Women's Lives. Ithaca, \nNY: Cornell University Press. \nHarney S (2006) Governance, state, and living labour. Cultural Logic: An Electronic Journal \nof Marxist Theory and Practice, http:\/\/clogic.eserver.org\/2006\/harney.html, date last \naccessed: 22.6.2009. \nHarney S (2008) Governance and the undercommons. InterActivist, \nhttp:\/\/slash.autonomedia.org\/node\/10926, date last accessed: 11.4.2009. \nHarrington M (2008) AIDS activists and the people with AIDS. A movement to revolutionize \nresearch and for universal access to treatment. In: Da Costa B and Philip K (eds) \nTactical Biopolitics: Art, Activism, and Technoscience. Cambridge, MA: MIT, 323-\n340. \nHartsock N (1983) The feminist standpoint: Developing the ground for a specifically feminist \nhistorical materialism. In: Harding S and Hintikka M (eds) Discovering Reality: \n –27– \n \nFeminist Perspectives on Epistemology, Metaphysics, Methodology and Philosophy of \nScience. Dordrecht: Reidel, 283-310. \nHess DJ (2004) Special issue: Health, the environment and social movements. Science as \nCulture 13(4): 421-586. \nHess DJ (2007a) Crosscurrents: Social movements and the anthropology of science and \ntechnology. American Anthropologist 109(3): 463-472. \nHess DJ (2007b) Pathways in Science and Industry: Activism, Innovation, and the \nEnvironment in an Era of Globalization. Cambridge, MA: MIT Press. \nHubbard R, Henifin MS, Fried B, Druss V and Star, SL (eds) (1979) Women Look at Biology \n– Looking at Women: A Collection of Feminist Critiques. Cambridge, MA: \nSchenkman. \nIllich I (1979) Tools for Conviviality. London: Fontana. \nIrwin A, Michael M (2003) Science, Social Theory and Public Knowledge. Maidenhead: \nOpen University Press. \nJasanoff S (2003) Technologies of humility: Citizen participation in governing science. \nMinerva 41(3): 223-244. \nLatour B (1993) We Have Never Been Modern. Cambridge, MA: Harvard University Press. \nLatour B (2003) The promises of constructivism. In Ihde D and Selinger E (eds), Chasing \nTechnoscience: Matrix for Materiality. Bloomington: Indiana University Press, 27-46. \nLatour B (2004) Why has critique run out of steam? From matters of fact to matters of \nconcern. Critical Inquiry 30(2): 225-248. \nLatour B (2005a) From realpolitik to dingpolitik or how to make things public. In Latour B \nand Weibel P (eds), Making Things Public: Atmospheres of Democracy. Cambridge, \nMA: MIT Press, 4-31. \nLatour B (2005b) Reassembling the Social: An Introduction to Actor-Network-Theory. \nOxford: Oxford University Press. \nLatour B (2007) Turning around politics: A note on Gerard de Vries' paper. Social Studies of \nScience 37: 811-820. \nLaw J (1999) After ANT: Complexity, naming and topology. In Law J and Hassard J (eds), \nActor Network Theory and After. Oxford: Blackwell, 1-14. \nLaw J (2004) After Method: Mess in Social Science Research. London: Routledge. \nLeach M, Scoones I, and Wynne B (eds) (2005) Science and Citizens: Globalization and the \nChallenge of Engagement. London: Zed. \nLengwiler M (2008) Participatory approaches in science and technology: Historical origins \nand current practices in critical perspective. Science Technology, & Human Values \n33: 186-200. \nLiberatore A, Funtowicz S (2003) Introduction: 'Democratising' expertise, 'expertising' \ndemocracy: what does this mean, and why bother? Science and Public Policy, 30(3): \n146-150. \nLongino HE (2002) The Fate of Knowledge. Princeton: Princeton University Press. \nMacIntyre A (1981) After Virtue: A Study in Moral Theory. Notre Dame, IN: University of \nNotre Dame Press. \nMalos E (ed) (1980) The Politics of Housework. London: Allison and Busby. \nMarazzi C (1998) Der Stammplatz der Socken. Die linguistische Wende der Ökonomie und \nihre Auswirkungen in der Politik. Zürich: Seismo Verlag. \nMarcuse H (1991) One-Dimensional Man: Studies in the Ideology of Advanced Industrial \nSociety. London: Routledge. \nMol A (2002) The Body Multiple: Ontology in Medical Practice. Durham: Duke University \nPress. \n –28– \n \nMoulier Boutang Y (1998) De L'esclavage au Salariat. Economie Historique du Salariat \nBridé. Paris: Presses Universitaires de France. \nMunro R, Mouritsen J (eds) (1997) Accountability: Power, Ethos, and the Technologies of \nManaging. Boston: International Thomson Business Press. \nNegri A (1999) Insurgencies: Constituent Power and the Modern State. Minneapolis: \nUniversity of Minnesota Press. \nNegri A (2005) The Politics of Subversion: A Manifesto for the Twenty-first Century. \nCambridge: Polity. \nNeyland D, Woolgar S (2002) Accountability in action? The case of a database purchasing \ndecision. British Journal of Sociology 53(2): 259–274. \nNowotny H, Rose H (1979) Counter-Movements in the Sciences: The Sociology of the \nAlternatives to Big Science. Dordrecht: Reidel. \nNowotny H, Scott P, and Gibbons M (2001) Re-thinking Science: Knowledge and the Public \nin an Age of Uncertainty. Cambridge: Polity. \nPanzieri R, Sohn-Rethel A, Palloix C, Bologna S, and Tronti M (1976). CSE Pamphlet No. 1: \nThe Labour Process & Class Strategies. London: Conference of Socialist Economists. \nPapadopoulos D (2006) World 2: On the significance and impossibility of articulation. \nCulture, Theory and Critique 47(2): 165–179. \nPapadopoulos D (2010). Activist Materialism. Deleuze Studies (in press). \nPapadopoulos D, Stephenson N (2007) Traveling experience: Rethinking the limits of \nempirical evidence in social science. In: Van Deventer V, Terre Blanche M, Fourie \nM, and Segalo P (eds) Citizen City: Between Constructing Agent and Constructed \nAgency. Toronto: Captus, 128-137. \nPapadopoulos D, Stephenson N and Tsianos V (2008) Escape Routes: Control and \nSubversion in the 21st Century. London: Pluto Press. \nPuig de la Bellacasa M (2009) Power to touch: The remaking of sensual experience and the \npolitics of speculative constructivism. Subjectivity 28: 297-315. \nPuig de la Bellacasa M (2010a) Ethical doings in naturecultures. Ethics, Place and \nEnvironment 13(3): ??- ??. \nPuig de la Bellacasa M (2010b). Matters of care in technoscience: Assembling neglected \nthings. Social Studies of Science 40(6): ???-???. \nRancière J (1998) Disagreement: Politics and Philosophy. Minneapolis: University of \nMinnesota Press. \nRapp R (2000) Testing Women, Testing the Fetus: The Social Impact of Amniocentesis in \nAmerica. New York: Routledge. \nRavetz JR (1990) The Merger of Knowledge with Power: Essays in Critical Science. London: \nMansell. \nRavetz JR (2006) The No-Nonsense Guide to Science. Oxford: New Internationalist. \nRawls J (1971) A Theory of Justice. Cambridge, MA: Belknap Press. \nRhodes RAW (1997) Understanding Governance: Policy Networks, Governance, Reflexivity \nand Accountability. Buckingham: Open University Press. \nRose H (1994) Love, Power and Knowledge. Cambridge: Polity Press. \nRose H, Rose S (1969) Science and Society. London: Penguin. \nRosenau JN, Czempiel EO (1992) Governance Without Government: Order and Change in \nWorld Politics. Cambridge: Cambridge University Press. \nRowe G, Frewer LJ (2004) Evaluating public-participation exercises: A research agenda. \nScience Technology and Human Values 29: 512-557. \nSamaddar R (2010) Emergence of the Political Subject. New Delhi: Sage. \nSandoval C (1991) U.S. third world feminism: The theory and method of oppositional \nconsciousness in the postmodern world. Genders 10: 1-24. \n –29– \n \nScanlon T (1998) What We Owe to Each Other. Cambridge, MA: Harvard University Press. \nScott JW (1991) The evidence of experience. Critical Inquiry 17(4): 773-797. \nSennett R (2009) The Craftsman. London: Penguin. \nShapin S (2008) The Scientific Life: A Moral History of a Late Modern Vocation. Chicago: \nUniversity of Chicago Press. \nShapin S, Schaffer S (1985) Leviathan and the Air-Pump: Hobbes, Boyle, and the \nExperimental Life. Princeton: Princeton University Press. \nShiva V (2006) Earth Democracy: Justice, Sustainability and Peace. London: Zed. \nShukaitis S, Graeber D, Biddle E (2007) Constituent Imagination: Militant Investigations, \nCollective Theorization. Oakland, CA: AK Press. \nSmith MR, Marx L (eds) (1994) Does Technology Drive History? The Dilemma of \nTechnological Determinism. Cambridge, MA: MIT Press. \nSmith PH (2006) The Body of the Artisan: Art and Experience in the Scientific Revolution. \nChicago: University of Chicago Press. \nStar SL (1991) Power, technologies and the phenomenology of conventions: On being \nallergic to onions. In: Law J (ed) A Sociology of Monsters: Essays on Power, \nTechnology and Domination. London: Routledge, 26-56. \nStengers I (2005) The cosmopolitical proposal. In: Latour B and Weibel P (eds), Making \nThings Public: Atmospheres of Democracy. Cambridge, MA: MIT Press, 994-1003. \nStengers I (2008) A constructivist reading of process and reality. Theory Culture and Society \n25: 91-110. \nStephenson N (2003) Interrupting neo-liberal subjectivities. Continuum: Journal of Media \nand Cultural Studies 17(2): 135-146. \nStephenson N, Papadopoulos D (2006) Analysing Everyday Experience: Social Research and \nPolitical Change. London: Palgrave Macmillan. \nStrathern M (2005) Kinship, Law and the Unexpected: Relatives are Always a Surprise. \nCambridge: Cambridge University Press. \nTaylor C (1986) Sprache und Gesellschaft. In: Honneth A and Joas H (eds), Kommunikatives \nHandeln. Frankfurt\/M.: Suhrkamp, 35-52. \nTaylor C (1991) The Malaise of Modernity. Concord: Anansi. \nTurner SP (2003) Liberal Democracy 3.0: Civil Society in an Age of Experts. London: Sage. \nWebster A (2007) Crossing boundaries: Social science in the policy room. Science \nTechnology, & Human Values 32: 458-478. \nWeinel M (2007) Primary source knowledge and technical decision-making: Mbeki and the \nAZT debate. Studies in History and Philosophy of Science 38(4): 748-760. \nWellmer A (1977) Kommunikation und Emanzipation. Überlegungen zur \n»sprachanalytischen Wende« der kritischen Theorie. In: Jaeggi U and Honneth A \n(eds) Theorien des Historischen Materialismus. Frankfurt\/M.: Suhrkamp, 465-499. \nWelsh I, Plows A, and Evans R (2007) Human rights and genomics: Science, genomics and \nsocial movements at the 2004 London Social Forum. New Genetics and Society 26(2): \n123-135. \nWhitehead AN (1979) Process and Reality: An Essay in Cosmology. New York: Free Press. \nWimmer R (1980) Universalisierung in der Ethik. Analyse, Kritik und Rekonstruktion \nethischer Rationalitätsansprüche. Frankfurt\/M.: Suhrkamp. \nWinner L (1986) The Whale and the Reactor: A Search for Limits in an Age of High \nTechnology. Chicago: University of Chicago Press. \nWinner L (1993) Upon opening the black box and finding it empty: Social constructivism and \nthe philosophy of technology. Science Technology, & Human Values 18(3): 362-378. \n –30– \n \nWinner L (2009) Mega-narratives of scientific technology: A time of crisis. Unpublished \nmanuscript, Department of Science and Technology Studies, Rensselaer Polytechnic \nInstitute. \nWittgenstein L (1958) Philosophical Investigations. Oxford: Blackwell. \nWoodhouse E, Hess,DJ, Breyman S, and Martin B (2002) Science studies and activism: \nPossibilities and problems for reconstructivist agendas. Social Studies of Science \n32(2): 297-320. \nWynne B (2003) Seasick on the third wave? Subverting the hegemony or propositionalism: \nResponse to Collins and Evans (2002). Social Studies of Science 33(3): 401-418. \nWynne B (2005) Reflexing complexity: Post-genomic knowledge and reductionist returns in \npublic science. Theory Culture and Society 22(5): 67–94. \n \n \n \nBiographical Note \nDr. Dimitris Papadopoulos teaches politics, organisation and culture at the School of \nManagement, University of Leicester. His work on social and political theory, experience and \nsubjectivity, labour and social transformation has appeared in various journals including \nBoundary 2; Culture, Theory & Critique; Darkmatter; British Journal of Social Psychology; \nand Ephemera. He has published numerous books, including, most recently, two co-authored \nmonographs: Escape Routes. Control and Subversion in the 21\nst\n Century (Pluto Press, 2008) \nand Analysing Everyday Experience: Social Research and Political Change (Palgrave, 2006). \nHe is currently working on the Politics of Matter: Ontology and Justice after Constructivism, \na study of matter, materialism, and radical interventions in technoscience. He is co-editor of \nthe journal Subjectivity. \n \n \n"}