{"doi":"10.1016\/j.asr.2007.02.059","coreId":"195987","oai":"oai:lra.le.ac.uk:2381\/8135","identifiers":["oai:lra.le.ac.uk:2381\/8135","10.1016\/j.asr.2007.02.059"],"title":"SPEAR: Early results from a very high latitude ionospheric heating facility","authors":["Yeoman, Tim K.","Blagoveshchenskaya, N.","Kornienko, V.","Robinson, T. R.","Dhillon, R. S.","Wright, D. M.","Baddeley, L. J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-03","abstract":"Early results are presented from high power ionospheric modification experiments with the SPEAR (Space Plasma Exploration by Active Radar) HF facility, which is used to generate artificial field-aligned irregularities (AFAI) in the polar cap ionosphere. These AFAIs are detected both through HF coherent backscatter radar and bistatic HF Doppler experiments. The AFAIs created with SPEAR are demonstrated to provide an important geophysical diagnostic of the polar cap ionospheric electric field, and may also scatter radio waves out of the ionospheric waveguide, even when they have propagated over very considerable distances","downloadUrl":"http:\/\/www.sciencedirect.com\/science\/journal\/02731177.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/8135\/3\/16-SPEAR-tky-C5.2-0032-06%5b1%5d.pdf","pdfHashValue":"091a5de851c7ca861421a6f529551f929cf678fe","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/8135<\/identifier><datestamp>\n                2015-12-10T16:07:49Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nSPEAR: Early results from a very high latitude ionospheric heating facility<\/dc:title><dc:creator>\nYeoman, Tim K.<\/dc:creator><dc:creator>\nBlagoveshchenskaya, N.<\/dc:creator><dc:creator>\nKornienko, V.<\/dc:creator><dc:creator>\nRobinson, T. R.<\/dc:creator><dc:creator>\nDhillon, R. S.<\/dc:creator><dc:creator>\nWright, D. M.<\/dc:creator><dc:creator>\nBaddeley, L. J.<\/dc:creator><dc:description>\nEarly results are presented from high power ionospheric modification experiments with the SPEAR (Space Plasma Exploration by Active Radar) HF facility, which is used to generate artificial field-aligned irregularities (AFAI) in the polar cap ionosphere. These AFAIs are detected both through HF coherent backscatter radar and bistatic HF Doppler experiments. The AFAIs created with SPEAR are demonstrated to provide an important geophysical diagnostic of the polar cap ionospheric electric field, and may also scatter radio waves out of the ionospheric waveguide, even when they have propagated over very considerable distances.<\/dc:description><dc:date>\n2010-07-01T15:04:21Z<\/dc:date><dc:date>\n2010-07-01T15:04:21Z<\/dc:date><dc:date>\n2007-03<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nAdvances in Space Research, 2007, 40 (3), pp. 384-389.<\/dc:identifier><dc:identifier>\n0273-1177<\/dc:identifier><dc:identifier>\nhttp:\/\/www.sciencedirect.com\/science\/article\/pii\/S0273117707001627<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/8135<\/dc:identifier><dc:identifier>\n10.1016\/j.asr.2007.02.059<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRadio and Space Plasma Physics<\/dc:relation><dc:rights>\nThis is the author's final draft of the paper published as Advances in Space Research, 2007, 40 (3), pp. 384-389.  The final version is available from http:\/\/www.sciencedirect.com\/science\/journal\/02731177.  Doi: 10.1016\/j.asr.2007.02.059<\/dc:rights><dc:publisher>\nElsevier<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0273-1177","issn:0273-1177"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["Radio and Space Plasma Physics"],"year":2007,"topics":[],"subject":["Article"],"fullText":" 1 \nSPEAR: Early results from a very high latitude ionospheric heating facility  \n \nT. K. Yeomana, N. Blagoveshchenskayab, V. Kornienkob, T. R. Robinsona, R. S. Dhillona, D. M. \nWrighta, and L. J. Baddeleya \n \naDepartment of Physics and Astronomy, University of Leicester, LE1 7RH, UK. \nbArctic and Antarctic Research Institute (AARI), 199397, St. Petersburg, Russia. \n \nAbstract \n \nEarly results are presented from high power ionospheric modification experiments with the SPEAR \n(Space Plasma Exploration by Active Radar) HF facility, which is used to generate artificial field-\naligned irregularities (AFAI) in the polar cap ionosphere.  These AFAIs are detected both through \nHF coherent backscatter radar and bistatic HF Doppler experiments.  The AFAIs created with \nSPEAR are demonstrated to provide an important geophysical diagnostic of the polar cap \nionospheric electric field, and may also scatter radio waves out of the ionospheric waveguide, even \nwhen they have propagated over very considerable distances. \n \n1.  Introduction \n \nHigh power radio wave facilities such as the EISCAT Heating facility at Tromsø, Norway \n(Rietveld et al., 1993) provide a highly flexible tool for investigating fundamental plasma physics \nand geophysical phenomena.  It is well known that O-mode heating is capable of generating \nartificial field aligned irregularities (AFAI) using high power HF radio waves (e.g. Hedberg et al., \n1983; Djuth et al., 1985; Blagoveshchenskaya and Troshichev, 1996; Yampolski et al., 1997; \nBlagoveshchenskaya et al., 1998; Eglitis et al., 1998; Robinson, 1989; Rietveld et al., 2003). These \nirregularities are detectable by both incoherent and coherent scatter radars (e.g. Robinson et al., \n1997). The striations are thought to be generated by a thermal parametric instability at the upper-\nhybrid resonance (UHR) height, although they extend for several tens of kilometres along the \ngeomagnetic field (Robinson, 1989).  AFAI provide a powerful source of coherent backscatter for \nHF radars, where the heater-induced scatter is usually very much stronger than scatter of natural \norigin e.g. Bond et al. (1997). The Doppler shift imposed on the AFAI by oscillations in the \nbackground convection electric field in which the AFAI are imbedded provide a valuable diagnostic \nof geophysical phenomena. Such Doppler-shifted signals may be detected by both HF backscatter \nsystems (e.g. Yeoman et al., 1997) and bistatic HF Doppler experiments (e.g. Blagoveshchenskaya \net al., 1998).  Previously, such experiments were restricted to the auroral zone and lower latitudes, \nbut the new SPEAR (Space Plasma Exploration by Active Radar) HF facility (Robinson et al., \n2006) now allows for such experiments in the polar cap.  The results presented here illustrate the \ncapability of the SPEAR high-power beam to generate artificial field-aligned irregularities (AFAI).  \n \n2.  Experimental arrangement \n \nSPEAR (Space Plasma Exploration by Active Radar) is a new high-power radar system located at \n78.15° N latitude, 16.05° E longitude, in the vicinity of Longyearbyen (Spitzbergen) and is \ndesigned to carry out a range of space plasma investigations of the polar ionosphere and \nmagnetosphere. The SPEAR site is located adjacent to the EISCAT Svalbard Radar (ESR). The \nSPEAR antenna system comprises a 6×4 array of full-wave, crossed-dipoles, 16m above the \nground, with an antenna spacing of 48.4m, allowing the transmission of both linear and circularly \npolarised signals. The individual dipoles are rhombically broadened to allow operation between 4 \nand 6 MHz. The resulting beam has a quasi-elliptical cross-section, with an average half-power \nwidth of 21° along its major axis and 14° along its minor axis. This results in an overall antenna \ngain of 21 dB. Individual phase-control provides beam-steering within ±30° from zenith, at any \n 2 \nazimuth, without significantly altering the antenna gain or introducing significant side-lobe signals. \nThe beam may thus be pointed in directions which include vertical and field-aligned. Beam-steering \nto angles further from the zenith may be achieved but in this case significant side-lobes are \nintroduced into the radiation pattern.  SPEAR has a distributed transmitting and receiving system \nconsisting of individual 4-kW solid-state transmitters connected to the antenna array. Each \ntransmitter consists of a single driver-stage and 4 individual 1-kW modules, the outputs of which \nare combined and fed to the antenna. In the 4×6 configuration 48 such transmitters are required. \nThese are made up of 192 power-amplifier modules, 48 driver stages and a total of 240 power-\nsupply units. Each transmitter contains an embedded controller and an individual Direct Digital \nSynthesiser (DDS) which provides a transmit signal and the IF for the receiver front-end.  During \nthe operations reported here the complete 6×4 SPEAR array was available (48 transmitters), \noperating at 4.45 MHz, which produced an antenna gain of 21 dB. The transmitters were operated at \n2kW, resulting in an Effective Radiated Power (ERP) for SPEAR of ~ 15 MW.   \nThe SPEAR site is within the fields of view of both the CUTLASS radars at Hankasalmi, Finland \nand Þykkvibær, Iceland, which are routinely operated throughout SPEAR experiments and are \nideally situated for making observations of AFAI in the SPEAR-modified ionosphere over the ESR. \nThe stereo-CUTLASS radar is an HF coherent backscatter radar system, capable of near \nsimultaneous operation on two separate frequencies (Lester et al., 2004). The radars form part of the \nSuperDARN array (Greenwald et al., 1995). Both radars reach the ionosphere above SPEAR via a \n1.5-hop HF propagation path. Normal operations for both radars involve a 16-beam scan over \nranges 180–3555 km, with an integration time of 3 or 6 s providing a full-scan time resolution of 1 \nor 2 min. In the experiments presented here the CUTLASS radars ran in a high temporal and spatial \nresolution mode, with both radars running a reduced scan of 3–5 beams centred over SPEAR \n(beams 6 and 9 for Þykkvibær and Hankasalmi respectively), with an integration time of 1 s. \nChannel-A of each of the radars provides high spatial resolution, with a field-of-view restricted to \n75 range-gates of size 15 km covering ranges of 1485–2610 km, while Channel-B provides data \nover the complete propagation path from the HF radars to SPEAR at a resolution of 45 km, over \ndistances of 180–3555 km.  The viewing geometry of Channels A and B for Hankasalmi and \nÞykkvibær are illustrated in Fig. 2.  Both Channels A and B of each radar additionally perform a \nsmall frequency sweep, with the scans cycling through approximately three HF frequencies which \nare appropriate to allow propagation to Svalbard over a 1.5-hop path. Frequencies of 11–13 MHz \nwere chosen for the experiments presented here. Thus the combination of the integration-time, scan-\npattern and frequency-sweep provided a time-resolution of between 9 and 15 s in this arrangement.   \nSimultaneous bistatic HF Doppler measurements are also available from four channels recorded at \nSt. Petersburg (SPB). The HF diagnostic signals from broadcasting stations at Pori (Finland, 11.755 \nMHz) and London (BBC stations, 17.64 MHz) were recorded, along with the SPEAR frequency \nand its second harmonic (4.45 and 8.90 MHz) to analyse possible self-scattering effects (Yampolski \net al., 2005).  The geometry of the bistatic HF Doppler experiments is illustrated in Fig. 2 which \nshows the \"direct\" paths London-SPB and Pori-SPB (thin lines) where signals propagate from the \ntransmitter to the receiver along a great circle path. Scattered paths correspond to the London-\nSPEAR-SPB and Pori-SPEAR-SPB paths (thick lines). The mechanism of bi-static scatter is very \nsimilar to the backscatter recorded at CUTLASS, but with the transmitter and receiver at different \nlocations. \n \n3.  Results \n \nData from SPEAR-induced AFAI detected in the CUTLASS Þykkvibær radar on 1 October 2004 \nbetween 12:00 and 14:00 UT are presented in Fig. 3.  The Doppler velocity of the AFAI is \npresented as a function of geographic longitude and time for Þykkvibær beam 6. Spear was \ntransmitting a 4 min on, 4 min off O-mode cycle, represented in Fig. 3 by vertical lines, and AFAI \ncan clearly be observed, centred on Þykkvibær range gate 45, 20° – 24° geographic longitude, when \nSPEAR was transmitting.  This apparent range is shifted somewhat eastward of the true longitude of \n 3 \nSPEAR, due to group retardation of the HF propagation path from Þykkvibær to SPEAR.  The line \nof sight velocity data shows a consistent drift towards the radar of 0 – 400 m s-1, resulting from the \nE^B drift imposed by the ionospheric convection electric field.  AFAI induced by the SPEAR \nsystem may similarly be diagnosed from bi-static HF Doppler scatter observations.  Figure 4 \npresents a dynamic Doppler spectrum of received signal strength from bi-static HF Doppler scatter \nobservations on the London-SPEAR-St.Petersburg path on 31 Jan 2006 between 17:12 and 17:48 \nUT. The time intervals when SPEAR was transmitting are marked by vertical bars on the time axis. \nSpear was again transmitting an O-mode signal, but this time a 2 min on, 2 min off cycle was \nemployed.  Zero Doppler frequency corresponds to the direct signals propagating from the \ntransmitter to the receiver along a great-circle path. Signals scattered from SPEAR-induced field-\naligned small-scale irregularities are recorded as additional tracks shifted in frequency from that of \nthe direct signals at zero Doppler frequency. Positive Doppler frequency shifts correspond to a \nsouthward motion of irregularities (toward the reception point) and negative Doppler frequency \nvalues correspond to a northward motion (away from the receiver). Well-defined signals scattered \nfrom AFAI generated at SPEAR are recorded as additional tracks shifted by ~+3 Hz Doppler \nfrequency (equivalent to a line-of-sight horizontal irregularity velocity in the direction of the \nbisector of the HF radio propagation paths of ~ 30 m s-1), visible only when SPEAR is transmitting.   \nFigure 5 presents dynamic Doppler spectra of the received signals on the SPEAR-St. Petersburg \nand Botswana (southern Africa)-SPEAR-St. Petersburg paths for data taken on 29 Jan 2006, 18:50 - \n19:50 UT. SPEAR was again transmitting at 4.45 MHz, using O-mode polarisation with a 2 min on, \n2 min off cycle. In this case data from the SPEAR-St. Petersburg propagation path are presented in \nthe left hand panel. This direct propagation path clearly illustrates the on\/off cycles of the SPEAR \nhigh power transmissions, and in this case therefore contains no Doppler frequency shifts.  A \nweaker trace is visible from 19:00 – 19:20 UT at a frequency shift of 4 Hz, presumably due to an \nadditional propagation path where a motion of the reflecting ionosphere (perhaps due to a gravity \nwave, applies a frequency shift.  Bistatic HF Doppler scatter observations, this time from a \nBotswana-SPEAR-St. Petersburg path at 17.895 MHz are presented in the right hand panel. Here \nzero Doppler frequency corresponds to the direct signals propagating from the diagnostic \ntransmitter at Botswana to the receiver at St. Petersburg along a great circle path. One can see that \nthe direct signals were very weak. At the same time strong scattered signals from the bistatic path \nare recorded shifted by about -3.5 Hz Doppler frequency (equivalent to a line-of-sight horizontal \nirregularity velocity in the direction of the bisector of the HF radio propagation paths of ~ 35 m s-1). \nThese scattered signals were only observed during SPEAR-on times when scattering from SPEAR-\ninduced AFAI occurs. \n \n4.  Discussion \n \nFig.3 presented data from SPEAR-induced AFAI detected in the CUTLASS Þykkvibær radar on 1 \nOctober 2004 between 12:00 and 14:00 UT.  The AFAI act as very coherent artificial targets for HF \nradars such as CUTLASS, and have been demonstrated to accurately track the natural ionospheric \nconvection velocity (Eglitis et al., 1998).  The backscatter obtained is of very high power and very \nnarrow spectral width. This allows a short integration time to be run on the radar, providing higher \ntime resolution than is normally available. The narrow spectral widths also produce ionospheric \nelectric field measurements of unprecedented accuracy.  Combining common-volume data from the \nCUTLASS Hankasalmi and Þykkvibær radars then allows a vector velocity determination.  This has \nbeen done with the EISCAT heater at Tromsø, (Yeoman and Wright, 2001) and is now possible for \nthe first time over the EISCAT Svalbard radar. \nFigure 4 presented data from 31 Jan 2006 between 17:12 and 17:48 UT. Well-defined signals \nscattered from AFAI generated at SPEAR are recorded as additional tracks shifted by ~+3 Hz \nDoppler frequency, visible only when SPEAR is transmitting.  Some variability in the Doppler shift \nof the scattered signals can be seen during the interval presented, presumably resulting from \nvariability in the convection electric field, which imposes a drift velocity on the AFAI, and hence a \n 4 \nDoppler shift on the received signal.  In addition to the Doppler variability of the scattered signals, \nsmall frequency variations in the directly-propagating signal can also be seen. These are most likely \ndue to frequency shifts imposed on the propagation path by naturally occurring ULF waves of \nmagnetospheric origin.  Such oscillations are frequently observed on both near-vertical HF Doppler \nsounders, and on ground scatter from SuperDARN HF radar data (Menk et al., 2003). The \namplitude of frequency variations in both direct great circle signals and signals scattered from AFAI \nat SPEAR are small, only about 1 Hz, but the frequency resolution is 0.1 Hz, so we can be confident \nthat these Doppler frequency shift variations are real.  For the time periods displayed in Figs. 4 and \n5, no artificial backscatter data were available from the CUTLASS radars, as no propagation path \nwas viable between the radars and the ionosphere overlying SPEAR.  This illustrates the difficulty \nin performing HF experiments over such large ranges, and also illustrates the value of having more \nthan one HF propagation path for the diagnosis of the ionospheric modification experiments \nperformed at SPEAR.  Figure 6 illustrates the median Doppler frequency shifts for signals scattered \nfrom SPEAR-induced AFAI on the London-SPEAR-St. Petersburg path obtained from the dynamic \nDoppler spectra in Fig. 4.  The Doppler frequency shift measurements during each 2 min on interval \ncan be seen to be very consistent.  However a systematic variation is seen in the Doppler shift over \nthe ~30 min interval covered in Fig. 6, as the convection electric field varies over this longer \ninterval. \nFigure 5 presented data from the direct SPEAR-St. Petersburg propagation path and bi-static HF \nDoppler scatter observations, this time from a Botswana-SPEAR-St.Petersburg path on 29 Jan \n2006, 18:50 – 19:50 UT.  Here the diagnostic signal received at St. Petersburg was at 17.895 MHz, \nfrom a transmitter located in Botswana, some 10 000 km from the SPEAR site. Thus propagation \nover such a large distance was presumably through an ionospheric wave-guide. The removal from \nwave-guide then occurred when the signal impinged on the AFAIs produced by SPEAR, and the \nscattered signals were subsequently detected by the SPB receiver.  This illustrates the immense \nvariety of HF propagation paths which can be utilised for the diagnosis of the effects of high power \nionospheric modification experiments at SPEAR.  High power SPEAR campaigns are now running \nroutinely four times a year, and significant further progress in plasma physics and geophysical \nexperiments is anticipated over the next few years of operations. \n \nAcknowledgments.  \n \nSPEAR is supported by PPARC grant PP\/E002544\/1, RSD and LJB are supported by PPARC \ngrant PPA\/G\/O\/2003\/00013. \n \nReferences \n \nBlagoveshchenskaya, N.F., and Troshichev, O.A.: Ionospheric phenomena produced by \nmodification experiments, J. Atmos. Terr. Phys., 58, 397-406, 1996. \nBlagoveshchenskaya N. F., V. A. Kornienko, A. V. Petlenko, A. Brekke, and M. T. Rietveld, \nGeophysical phenomena during an ionospheric modification experiment at Tromsø, Ann. \nGeophys. 16, 1212–1225, 1998. \nBond, G., T. R. Robinson, P. Eglitis, D. M. Wright, A. J. Stocker, M. T. Rietveld, and T. B. Jones, \nSpatial observations by the CUTLASS coherent scatter radar of ionospheric modification by \nhigh power radio waves, Ann. Geophys., 15, 1412–1421, 1997, \nDjuth, F.T., Jost, R.J., Noble, S.T., Gordon, W.E., Stubbe, P., Kopka, H., Nielsen E., Bostrøm, R., \nDerblom, H., Hedberg, A., and Thide, B.: Observations of E region irregularities generated at \nauroral latitudes by a high power radio wave, J. Geophys. Res., 90, 12293−12306, 1985. \nEglitis, P., T. R. Robinson, M. T. Rietveld, D. M. Wright, and G. E. Bond, The phase speed of \nartificial irregularities observed by CUTLASS during HF modification of the auroral \nionosphere, J. Geophys. Res., 103, 2253, 1998. \n 5 \nGreenwald, R. A., K. B. Baker, J. R. Dudeney, M. Pinnock, T. B. Jones, E. C. Thomas, J.-P. \nVillain, J.-C. Cerisier, C. Senior, C. Hanuise, R. D. Hunsucker, G. Sofko, J. Koehler, E. \nNielsen, R. Pellinen, A. D. Walker, N. Sato, and H. Yamagishi, DARN\/SuperDARN: A global \nview of the dynamics of high latitude convection, Space Sci. Rev., 71, 761–796, 1995. \nHedberg, A., Derblom, H., Thide, B., Kopka, H.,and Stubbe, P.: Observations of HF backscatter \nassociated with the heating experiment at Tromsø, Radio Sci., 18, 840−850, 1983. \nLester, M., P. J. Chapman, S. W. H. Cowley, S. J. Crooks, J. A. Davies, P. Hamadyk, K. A. \nMcWilliams, S. E. Milan, M. J. Parsons, D. B. Payne, E. C. Thomas, J. D. Thornhill, N. M. \nWade, T. K. Yeoman, and R. J. Barnes, Stereo CUTLASS: A new capability for the \nSuperDARN radars, Ann. Geophys., 22, 459–473, 2004, \nMenk, F. W., T. K. Yeoman, D. Wright, M. Lester, and F. Honary, High latitude observations of \nimpulse-driven ULF pulsations in the ionosphere and on the ground, Ann. Geophysicae, 21, \n559-576, 2003. \nRietveld, M. T., H. Kohl, , H. Kopka, , and P. Stubbe, , Introduction to ionospheric heating at \nTromsø – I. Experimental overview, J. Atmos. Terr. Phys., 55, 577, 1993. \nRietveld, M.T., Kosch, M.J., Blagoveshchenskaya, N.F., Kornienko, V.A., Leyser, T.B., and \nYeoman, T.K.: Ionospheric electron heating, aurora and striations induced by powerful HF radio \nwaves at high latitudes: aspect angle dependence, J.Geophys.Res., 108(A4), 1141, \ndoi:10.1029\/2002JA009543, 2003. \nRobinson, T. R.: The heating of the high latitude ionosphere by high power radio waves, Phys. Rep. \n179, 79–209, 1989. \nRobinson, T. R., A. J. Stocker, G. Bond, P. Eglitis, D. M. Wright, and T. B. Jones, O and X mode \nheating effects observed simultaneously with the CUTLASS and EISCAT radars and low power \nHF diagnostics at Tromsø, Ann. Geophys., 15, 134–136, 1997. \nRobinson T. R., T. K. Yeoman, R. S. Dhillon, M. Lester, E. C. Thomas, J. D. Thornhill, D. M. \nWright, A. P. van Eyken and I. W. McCrea, First observations of SPEAR-induced artificial \nbackscatter from CUTLASS and EISCAT Svalbard radars, Ann. Geophys., 24, 291-309, 2006. \nYampolski, Y.M., Beley, V.S., Kasheev, S.B., Koloskov, A.V., Somov, V.G., Hysell, D.L., Isham, \nB., and Kelley, M.C.: Bistatic HF radar diagnostic induced field-aligned irregularities, J. \nGeophys. Res., 102(A4), 7461-7467, 1997. \nYampolski, Yu. M., A.V Zalizovski, V.G. Galushko, A.V. Koloskov, S.B. Kascheev, Self scattering \neffect of powerful HF radiation as observed in Europe and Antarctica, proceedings of RF \nIonospheric Interactions Workshop, Santa Fe, New Mexico, pp. 31 – 38, 2005. \nYeoman, T. K. and D. M. Wright, ULF waves with drift resonance and drift-bounce resonance \nenergy sources as observed in artificially-induced HF radar backscatter, Ann. Geophys. 19, 159–\n170, 2001. \nYeoman, T. K., D. M. Wright, T. R. Robinson, and M. T. Rietveld, High spatial and temporal \nresolution observations of an impulse-driven field line resonance in backscatter radar artificially \ngenerated with the Tromsø heater, Ann. Geophys., 15, 634–644, 1997. \n \nFigure captions \n \n \n \nFigure 1.  The viewing geometry of the high spatial resolution and standard channels of the \nHankasalmi, (left panel) and Þykkvibær (right panel) CUTLASS HF coherent scatter radars when \noperated with the SPEAR high power facility on Svalbard. \n \nFigure 2.  The geometry of the SPEAR-bistatic HF Doppler experiments  \n \nFigure 3.  HF radar measurements of the Doppler velocity of AFAI induced by the SPEAR system, \npresented as a function of geographic longitude and time for Þykkvibær beam 6. Spear was \n 6 \ntransmitting a 4 min on, 4 min off O-mode cycle, represented by vertical lines, and AFAI can \nclearly be observed, centred on Þykkvibær range gate 45, 20° – 24° geographic longitude. \n \nFigure 4.  A dynamic Doppler spectrum of received signal strength from bi-static HF Doppler \nscatter observations on the London-SPEAR-St.Petersburg path on 31 Jan 2006 from 17:12 to 17:48 \nUT. Spear was transmitting a 2 min on, 2 min off O-mode cycle, represented by vertical bars.  Zero \nDoppler frequency corresponds to the direct signals propagating from the transmitter to the receiver \nalong a great-circle path. Scattered signals are recorded as additional tracks shifted by ~+3 Hz \nDoppler frequency. \n \nFigure 5.  Dynamic Doppler spectra of the received signals on the SPEAR-St. Petersburg (left hand \npanel) and Botswana (southern Africa)-SPEAR-St.Petersburg (right hand panel) paths for data \ntaken on 29 Jan 2006, 18:50 – 19:50 UT. Spear was transmitting at 4.45 MHz, using O-mode \npolarisation, with a 2 min on, 2 min off cycle. Zero Doppler frequency in each panel corresponds to \nthe direct signals propagating from the transmitter to the receiver along a great-circle path. \nScattered signals from the bistatic path are recorded, shifted by ~-3.5 Hz Doppler frequency, in the \nright hand panel. \n \nFigure 6.  The measured Doppler frequency shift from the bi-static HF Doppler observations on the \nLondon-SPEAR-St.Petersburg path, as presented in the dynamic spectrum in Figure 4.   \n \n \n \n60°N\n70°N\n70°N\n0 ° E 15 ° E 30 ° E 45 °E\n60°N\n70°N\n70°N\n0 ° E 15 °E 30 °E 45 °E\nFigure 1\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 2 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 3 \n \n \n \n \n \n11.2 12.2 13.2 14.2 15.2 16.2\n17:15\n17:20\n17:25\n17:30\n17:35\n17:40\n17:45\nJanuary 31, 2006, f = 17640 kHz\nTi\nm\ne,\n U\nT\nDoppler frequency, Hz\nLondon - SPEAR - St. Petersburg\n0 2 4\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 4 \n 14 15 16 17 18 19 20\n55\n60\n65\n70\n75\n80\n85\n90\n95\n100\n105\n1 6 11 16 21\n19:0\n19:5\n19:10\n19:15\n19:20\n19:25\n19:30\n19:35\n19:40\n19:45\n0-5-10-15 5 0-2\nTi\nm\ne,\n U\nT\nDoppler frequency, Hz\nJanuary 29, 2006\nf = 17895 kHz fH = 4450 kHz\n SPEAR - St. Petersburg\n18:55\n-4\nBotswana - SPEAR - St. Petersburg \nand Botswana - St. Petersburg\nFigure 5\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 6 \n17:12               17:20                17:28               17:36               17:44 \n"}