{"doi":"10.1111\/j.1365-246X.2008.03725.x","coreId":"63223","oai":"oai:nora.nerc.ac.uk:2623","identifiers":["oai:nora.nerc.ac.uk:2623","10.1111\/j.1365-246X.2008.03725.x"],"title":"Extreme sensitivity of crosshole electrical resistivity tomography measurements to geometric errors","authors":["Wilkinson, Paul","Chambers, Jonathan","Lelliott, Michael","Wealthall, Gary","Ogilvy, Richard"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-04","abstract":"The effects of geometric errors on crosshole resistivity data are investigated using analytical methods. Geometric errors are systematic and can occur due to uncertainties in the individual electrode positions, the vertical spacing between electrodes in the same borehole, or the vertical\\ud\noffset between electrodes in opposite boreholes. An estimate of the sensitivity to geometric error is calculated for each of two generic types of four-electrode crosshole configuration: current flow and potential difference crosshole (XH) and in-hole (IH). It is found that XH configurations are not particularly sensitive to geometric error unless the boreholes are closely spaced on the scale of the vertical separation of the current and potential electrodes. However, extremely sensitive IH configurations are shown to exist for any borehole separation. Therefore, it is recommended that XH configurations be used in preference to IH schemes. The effects of geometric error are demonstrated using real XH data from a closely spaced line of boreholes designed to monitor bioremediation of chlorinated solvents at an industrial site.Asmall fraction of the data had physically unrealistic apparent resistivities, which were either negative or unexpectedly large. However by filtering out configurations with high sensitivities to geometric\\ud\nerror, all of the suspect data were removed. This filtering also significantly improved the convergence between the predicted and the measured resistivities when the data were inverted. In addition to systematic geometric errors, the measured data also exhibit a high level of random noise. Despite this, the resulting inverted images correspond reasonably closely with the known geology and nearby cone penetrometer resistivity profiles","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/63223.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/2623\/1\/XHSensPost.pdf","pdfHashValue":"35b7acd0c22516479fa4737fea68199a5cd56c24","publisher":"Blackwell Publishing","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:2623<\/identifier><datestamp>\n      2017-07-25T00:30:16Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533234<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/2623\/<\/dc:relation><dc:title>\n        Extreme sensitivity of crosshole electrical resistivity tomography measurements to geometric errors<\/dc:title><dc:creator>\n        Wilkinson, Paul<\/dc:creator><dc:creator>\n        Chambers, Jonathan<\/dc:creator><dc:creator>\n        Lelliott, Michael<\/dc:creator><dc:creator>\n        Wealthall, Gary<\/dc:creator><dc:creator>\n        Ogilvy, Richard<\/dc:creator><dc:subject>\n        Physics<\/dc:subject><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        The effects of geometric errors on crosshole resistivity data are investigated using analytical methods. Geometric errors are systematic and can occur due to uncertainties in the individual electrode positions, the vertical spacing between electrodes in the same borehole, or the vertical\\ud\noffset between electrodes in opposite boreholes. An estimate of the sensitivity to geometric error is calculated for each of two generic types of four-electrode crosshole configuration: current flow and potential difference crosshole (XH) and in-hole (IH). It is found that XH configurations are not particularly sensitive to geometric error unless the boreholes are closely spaced on the scale of the vertical separation of the current and potential electrodes. However, extremely sensitive IH configurations are shown to exist for any borehole separation. Therefore, it is recommended that XH configurations be used in preference to IH schemes. The effects of geometric error are demonstrated using real XH data from a closely spaced line of boreholes designed to monitor bioremediation of chlorinated solvents at an industrial site.Asmall fraction of the data had physically unrealistic apparent resistivities, which were either negative or unexpectedly large. However by filtering out configurations with high sensitivities to geometric\\ud\nerror, all of the suspect data were removed. This filtering also significantly improved the convergence between the predicted and the measured resistivities when the data were inverted. In addition to systematic geometric errors, the measured data also exhibit a high level of random noise. Despite this, the resulting inverted images correspond reasonably closely with the known geology and nearby cone penetrometer resistivity profiles.<\/dc:description><dc:publisher>\n        Blackwell Publishing<\/dc:publisher><dc:date>\n        2008-04<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/2623\/1\/XHSensPost.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Wilkinson, Paul; Chambers, Jonathan; Lelliott, Michael; Wealthall, Gary; Ogilvy, Richard.  2008  Extreme sensitivity of crosshole electrical resistivity tomography measurements to geometric errors.   Geophysical Journal International, 173 (1). 49-62.  https:\/\/doi.org\/10.1111\/j.1365-246X.2008.03725.x <https:\/\/doi.org\/10.1111\/j.1365-246X.2008.03725.x>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.blackwell-synergy.com\/doi\/pdf\/10.1111\/j.1365-246X.2008.03725.x<\/dc:relation><dc:relation>\n        10.1111\/j.1365-246X.2008.03725.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/2623\/","http:\/\/www.blackwell-synergy.com\/doi\/pdf\/10.1111\/j.1365-246X.2008.03725.x","10.1111\/j.1365-246X.2008.03725.x"],"year":2008,"topics":["Physics","Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":" 1 \nExtreme sensitivity of crosshole Electrical Resistivity \nTomography measurements to geometric errors \n \nPaul B. Wilkinson, Jonathan E. Chambers, Mike Lelliott, Gary P. Wealthall, and \nRichard D. Ogilvy. \n \nBritish Geological Survey, Natural Environment Research Council, Kingsley Dunham \nCentre, Keyworth, Nottingham, NG12 5GG, UK \n  \nAccepted 2008 January 9. Received 2008 January; in original form 2007 June 18   \n \n(Short title: Extreme geometric errors in crosshole ERT) \n \n \n \n \nCorresponding Author: Paul Wilkinson, Tel: +44(0) 115 936 3086 \nFax: +44(0) 115 936 3261. Email: pbw@bgs.ac.uk \n \n \n \n 2 \nPublished in Geophysical Journal International (Royal Astronomical Society \/ \nBlackwell Publishing). The definitive version is available at www.blackwell-\nsynergy.com \n \nGeophysical Journal International (2008) 173, 49-62 \nhttp:\/\/www.blackwell-synergy.com\/doi\/pdf\/10.1111\/j.1365-246X.2008.03725.x \n \n 3 \nSummary \nThe effects of geometric errors on crosshole resistivity data are investigated \nusing analytical methods. Geometric errors are systematic and can occur due to \nuncertainties in the individual electrode positions, the vertical spacing between \nelectrodes in the same borehole, or the vertical offset between electrodes in opposite \nboreholes. An estimate of the sensitivity to geometric error is calculated for each of \ntwo generic types of four-electrode crosshole configuration: current flow and potential \ndifference crosshole (XH) and in-hole (IH). It is found that XH configurations are not \nparticularly sensitive to geometric error unless the boreholes are closely spaced on the \nscale of the vertical separation of the current and potential electrodes. But extremely \nsensitive IH configurations are shown to exist for any borehole separation. Therefore \nit is recommended that XH configurations be used in preference to IH schemes. The \neffects of geometric error are demonstrated using real XH data from a closely spaced \nline of boreholes designed to monitor bioremediation of chlorinated solvents at an \nindustrial site. A small fraction of the data had physically unrealistic apparent \nresistivities, which were either negative or unexpectedly large. But by filtering out \nconfigurations with high sensitivities to geometric error, all of the suspect data were \nremoved. This filtering also significantly improved the convergence between the \npredicted and the measured resistivities when the data were inverted. In addition to \nsystematic geometric errors, the measured data also exhibit a high level of random \nnoise. Despite this, the resulting inverted images correspond reasonably closely with \nthe known geology and nearby cone penetrometer resistivity profiles. \n 4 \nKeywords \nElectrical resistivity, Borehole, Tomography, Inversion, Sensitivity\n 5 \n1. Introduction \nVolumetric imaging of the electrical properties of the subsurface by electrical \nresistivity tomography (ERT) has been intensively developed for over a decade. \nPermanently installed electrode arrays can now be used with automated multi-channel \ndata acquisition systems and rapid inversion algorithms to enable 2D or 3D time-lapse \nimaging of dynamic processes (Versteeg et al. 2004; LaBreque et al. 2004; Ogilvy et \nal. 2007). As the capabilities of such systems increase, more electrodes can be used \nthereby potentially increasing the spatial resolution of the resulting images. However, \nthe resolution is not only limited by the separation of the electrodes, but also by errors \naffecting the data (LaBrecque et al. 1996). An often-overlooked source of error in \ngeoelectrical imaging is uncertainty in the geometry of the array, which can include \nerrors in the position or spacing of the electrodes, or in the relative offset between \nadjacent arrays. However, in the closely related technique of medical Electrical \nImpedance Tomography (EIT) this problem has been known for several years. This is \npartly because the EIT electrodes tend to be closely spaced due to the size of the body \nand the need for high-resolution images (Blott et al. 1998). But it is also important \nbecause electrodes attached to certain parts of the body (e.g. the chest) will move \nduring imaging (Zhang & Patterson 2005). Indeed, recent improvements to medical \nEIT inversion algorithms treat the electrode positions in the same way as the \nimpedance distribution; they are unknown model parameters to be determined from \nthe data and the a priori constraints (Soleimani et al. 2006).  \n 6 \nIn geoelectrical imaging, it is usually reasonable to assume that the electrode \nlocations will remain constant over time. But configurations with small electrode \nspacings could be prone to significant errors due to uncertainties in those locations. \nThis could be more of an issue for subsurface than surface electrodes, since the \npositions of the latter are much easier to check. As the use of site-scale crosshole ERT \nimaging is becoming more common in engineering and environmental investigations \n(Ramirez et al. 1996; Daily & Ramirez 2000; Slater & Binley 2003; Goes & Meekes \n2004; LaBreque et al. 2004; Wilkinson et al. 2006; Chambers et al. 2007), the \nincidence of data affected by geometric errors is likely to increase. To our knowledge, \nthere have only been two detailed studies of the effects of this type of error on \nresistivity data. Zhou & Dahlin (2003) discuss the effect of such errors on the \ngeometric factors of commonly used 2D surface ERT arrays. Using heterogeneous \nsynthetic forward models, they found that the relative error in the observed apparent \nresistivity can be more than double the relative electrode spacing error for certain \nconfigurations. Oldenborger et al. (2005) studied the effects of electrode mislocation \non synthetic crosshole ERT data for pole-pole and bipole-bipole configurations (either \nvertical bipoles of 1 m length, or horizontal bipoles of 6 m length). They found that \nlarge errors in resistivity (~50 % for a 10 cm position error) could occur depending on \nthe relative positions and orientation of the bipoles (either horizontal or vertical). \nThey also found that the statistical distribution of errors was complicated and multi-\nmodal and could introduce bias into the measured data sets. \nIn this paper, we take an approach similar to that of Zhou & Dahlin (2003) to \ncalculate an estimate of the sensitivity to geometric error of any inter-borehole four-\n 7 \nelectrode ERT configuration that falls into one of two generic types. These types \nencompass and extend the bipole-bipole configurations studied by Oldenborger et al. \n(2005), and our findings support and complement theirs. Rather than repeating their \nsynthetic modelling, we demonstrate the efficacy of our approach using real crosshole \nERT data from a “transect borehole array”, a line of seven closely spaced boreholes \nthat has been installed to monitor resistivity changes associated with the \nbioremediation of a contaminated site. Following the suggestion of Oldenborger et al. \n(2005), we use the estimates of geometric error sensitivity in our processing and \ninversion procedure to remove highly sensitive measurements from the data set. We \ndemonstrate that this removes all the outlying data points with negative or \nsuspiciously large apparent resistivities. After removal of the outlying data, the \ntomographic images from individual panels (pairs of boreholes) and the whole \ntransect show significant improvements in the RMS misfits between the inverted and \nmeasured data. \n2. Electrode array geometric errors \nTo assess the sensitivity of inter-borehole resistivity measurements to \ngeometric errors, we categorize the commonly used four-electrode measurements into \ntwo basic types (Bing & Greenhalgh 2000); those for which the current flow and \npotential measurements are crosshole (XH, see Figs. 1(a) and (c)) or in-hole (IH, see \nFigs. 1(b) and (d)). Of the two types, XH configurations provide greater image \nresolution in the region between the boreholes, and tend to offer better signal-to-noise \ncharacteristics (Bing & Greenhalgh 2000; Wilkinson et al. 2006; Chambers et al. \n 8 \n2007). For these reasons research into the use of crosshole ERT is starting to favor \nXH over IH configurations, e.g. compare Slater & Binley (2003) with Slater et al. \n(2002). \nDepending on the method of installation of the borehole electrodes, errors in \nthe geometry may be general (i.e. all four electrodes have uncertain positions), \nspacing related (e.g. imprecise spacings between electrodes in the same borehole), or \noffset related (e.g. spacings are known to high precision, but the depths of arrays in \nadjacent boreholes are uncertain). Figure 1 illustrates the general case, and also the \ncase of uncertain offsets between adjacent boreholes, which affects the data that is \npresented in this paper. The general case is shown for XH and IH measurements in \nFigs. 1(a) and 1(b) respectively. The current electrodes (labelled A and B) are located \nat depths α and β, and the potential electrodes (M and N) are at depths µ and ν. Each \nof the four depths is imprecisely known. The effect of errors in the electrode depths \non the apparent resistivity is calculated from the geometric factor K. This is given by \n \nNB'MB'NA'MA'BNBMANAM\n11111111\n4\nrrrrrrrr\nK\n+−−++−−\n=\npi\n, (1) \nwhere, for example, rAM is the distance between A and M. A′ and B′ represent the \nlocations of the images of the current electrodes A and B respectively. If the location \nof A is (xA, yA, zA), then A′ is at (xA, yA, -zA), assuming that the ground surface is \nz = 0. The systematic error in K due to uncertainty in the depths depends on the partial \nderivatives (∂K\/∂α), (∂K\/∂β), (∂K\/∂µ) and (∂K\/∂ν) where, for example,  \n \nααααα ∂\n∂\n∂\n∂\n+\n∂\n∂\n∂\n∂\n+\n∂\n∂\n∂\n∂\n+\n∂\n∂\n∂\n∂\n=\n∂\n∂ NA'\nNA'\nMA'\nMA'\nAN\nAN\nAM\nAM\nr\nr\nKr\nr\nKr\nr\nKr\nr\nKK\n. (2) \n 9 \nNote that for (∂K\/∂α), all partial derivatives of distances involving electrode B are \nzero and have been left out of Eq. 2. Similar simplifications apply for (∂K\/∂β), \n(∂K\/∂µ) and (∂K\/∂ν). Assuming that the errors ∆α, ∆β, ∆µ and ∆ν are independent and \nuncorrelated then an estimate of the error in K, ∆K, is given by Gaussian error \npropagation as \n \n2\n2\n2\n2\n2\n2\n2\n2\n2 ν\nν\nµ\nµ\nββαα ∆\n\n\n∂\n∂\n+∆\n\n\n∂\n∂\n+∆\n\n\n∂\n∂\n+∆\n\n\n∂\n∂\n=∆ KKKKK . (3) \nIn ERT inversion it is usually the relative error in the apparent resistivity, ρa, that is \nused in the merit function to test for convergence. It is also often the case that \nlogarithms of the resistivity data are used to improve the stability of the inversion by \ntransforming the typically large resistivity range to a linear scale. If so, then the \nrelative error also appears in the data discrepancy vector (Loke & Barker 1995) since \n∆ln(ρa) = ∆ρa \/ρa. This ensures that the apparent resistivity data all have equal weight, \nwhatever their magnitude. For these reasons, relative rather than absolute errors are \nalso used throughout this paper. Since ρa = KV\/I, where V is the measured voltage and \nI is the applied current, then the relative error in the apparent resistivity due to a \nsystematic error in K is \n \nK\nK∆\n=\n∆\na\na\nρ\nρ\n. (4) \nBefore we consider specific cases, it is worth noting that the preceding \nanalysis is not limited to four-electrode configurations; it can be applied to any \nconfiguration with any number of electrodes providing that their positions are \nindependent. In certain situations, however, the errors in some electrode positions \n 10 \nmay be correlated. One such case is where electrodes are fixed to a rigid structure \nprior to deployment in the borehole. In this case, the errors in the vertical electrode \nspacings are negligible in comparison with the errors in the depths to which each \narray is installed. Therefore the spacing errors can be neglected, leaving only errors in \nthe two independent depths of installation. Since this arrangement was used to collect \nthe data that is presented later in this paper, we examine it here in detail for a range of \nborehole separations and electrode depths in both XH and IH configurations. We \nassume for now that the electrodes in each hole have the same vertical separation a, \nand express the other distances in the problem as multiples of a (see Figs. 1(c) and \n1(d)). The inter-borehole separation is δa, and the midpoint depths of the electrodes in \nthe left- and right-hand boreholes are γa, and εa respectively. To illustrate the \ndependence of ∆K\n \n\/K on borehole separation and midpoint depth, we calculate the \nrelated quantity σ\n \n\/K where \n \n22\n\n\n\n∂\n∂\n+\n\n\n∂\n∂\n=\nεγ\nσ\nKK\n (5) \nis the estimate of the error in K that would occur for unit errors in γ and ε, and σ\n \n\/K is \nthe associated relative error. The reason for assuming constant unit uncertainties in γ \nand ε is so that we can compare the behaviours of the error estimate for different \nconfigurations.  \nThe 3D surface plot in Fig. 2(a) shows σ for XH configurations as a function \nof the borehole separation δ and the right-hand borehole midpoint depth ε. Below this \nthe 2D plots show the detailed behaviour of σ for δ = 0.5, 0.7 and 1.0. For all the plots \nthe range of right-hand midpoint depths is 5 ≤ ε ≤ 15, and the left-hand midpoint \n 11 \ndepth is fixed at γ = 10. Figs. 2(b) and 2(c) show 1\/K and σ\n \n\/K respectively. For δ < 1, \nthe vertical spacing between the electrodes in the same hole, a, is larger than the \nspacing between the boreholes, δa. Figure 2(c) shows that large values of σ\n \n\/K can \noccur in this regime. Consequently, large relative changes in K, and hence in ρa, can \noccur for small uncertainties in the depths of the arrays (γ and ε). For small δ (< ~0.7), \nσ\n \n\/K can be negative and large enough to cause the apparent resistivity to change sign. \nAlthough real negative apparent resistivities are unusual, they can occur when large \nresistivity contrasts exist in the vicinity of the electrodes (see Appendix A). Therefore \nthe presence of such data can cause inversion algorithms to generate unstable \nsolutions with large abrupt changes in resistivity near electrode locations. However it \nis usually the case that δ > 1, unless the aspect ratio (borehole separation \/ borehole \ndepth) is small. Figure 2 shows that XH configurations are not strongly affected by \noffset errors between adjacent borehole arrays when δ > 1. \nFor IH configurations Fig. 3 shows (a) σ\n \n(δ,\n \nε), (b) 1\/K\n \n(δ,\n \nε), and (c) σ\n \n\/K\n \n(δ,\n \nε) \nas surface plots and line plots for δ = 0.5, 1.0 and 1.5. Note that the ordinate axes of \nall plots in Fig. 3 have larger ranges than in Fig. 2. By contrast with the case for the \nXH configurations, 1\/K for the IH configurations can change sign for any borehole \nseparation δ (Fig. 3(b)). Also, for most combinations of δ and ε, the error estimate σ \n(Fig. 3(a)) is typically much larger than for XH configurations. Therefore the estimate \nof the relative error σ\n \n\/K shows that, for any borehole separation, there are IH \nconfigurations that are extremely sensitive to small uncertainties in array depth. \nDepending on the exact details of the actual and assumed locations of the electrodes, \n 12 \nthese configurations could easily return apparent resistivities with the incorrect sign \n(usually negative). \nHigh sensitivities to geometric error will occur when K is close to a \nsingularity, or equivalently 1\/K ≈ 0 (compare Figs. 2(b) and (c), and 3(b) and (c) for \nexamples). To understand why this is, we consider the extreme cases where the sign \nof the apparent resistivity can change with a small change in the depth of one of the \nrigid arrays. In general, if the potential electrode M is closer to the current electrode A \nthan it is to B, and similarly N is closer to B than A, then the geometric factor K > 0. \nBut if, for example, M moves significantly closer to B than to A, then the geometric \nfactor can change sign (K < 0). If we are sufficiently close to this situation, then a \nsmall uncertainty in the position of M can cause the calculated magnitude (and sign) \nof K to be wrong, giving a large error in the apparent resistivity, which may also \nchange sign. This explains why the XH configurations are largely unaffected by \ngeometric errors; if δ > 1 it is not possible for M to be closer to A than it is to B (see \nFig. 1(c)). But for IH configurations, there will always be combinations of γ and ε for \nwhich M is closer to A than B and vice versa (see Fig. 1(d)). Note that these \narguments are rather simplistic since they do not account for the effect of N, nor of \nthe image charges A′ and B′. Nevertheless it is true that, whatever the borehole \nseparation, there will always be IH configurations that will be very sensitive to \ngeometric error, and which should not be used to collect data. Any XH configuration \nwill be safe to use provided that the borehole separation is larger than the vertical \nspacing between the current and potential electrodes. For this reason, we recommend \n 13 \nthe use of XH configurations over IH schemes such as skip-1, skip-2, …, skip-n \n(Slater et al., 2002). \n \n3. SABRE test site and data collection \nThe data set that is analyzed in this paper was collected to test a high-density \nERT transect array as part of the SABRE (Source Area BioREmediation) project. \nThis project comprises a public \/ private consortium of twelve companies, two \ngovernment agencies, and three research institutions. Its charter is to determine if \nenhanced anaerobic bioremediation can result in effective and quantifiable treatment \nof chlorinated solvent Dense Non-Aqueous Phase Liquid (DNAPL) source areas. The \nSABRE research site is located at an operational industrial plant in the UK, within an \narea contaminated with trichloroethene (TCE). The TCE source zone impacts a \nshallow unconsolidated aquifer comprising alluvium and river terrace deposits, \nunderlain by mudstones. The water table at the site is between 0.5 m and 0.8 m below \nground level. A pilot-scale experimental test cell has been installed at the SABRE site \nto study the combined effects of biostimulation and bioaugmentation on the \nbiodegradation of TCE.  \nIt is anticipated that ERT will be sensitive to changes in groundwater \nchemistry associated with the dissolution of DNAPL TCE and its breakdown \nproducts, dichloroethene, vinyl chloride and chloride. The SABRE test cell has \ntherefore been instrumented to monitor the enhanced bioremediation experiment \nusing ERT imaging as well as conventional groundwater sampling. Combined ERT \n 14 \nand multi-level groundwater sampling arrays have been installed on borehole \ntransects in both the source and plume zones (see Fig. 4). The ERT arrays consist of \nstainless steel ring electrodes with a vertical separation of 200 mm mounted on a \n40 mm diameter plastic tube. The use of ring electrodes can cause systematic artefacts \nwhen the data is inverted if the inversion code assumes, as is typically the case, that \nthe electrodes are point-like. It is fairly straightforward to calculate the difference \nbetween potentials measured from ring and point electrodes (Ridd 1994); the effect on \nthe various configurations used in this work will be between ~0.5 % and ~3.5 % \ndepending on the vertical electrode separation. This is somewhat smaller than the \neffects of random noise and geometric uncertainties, which are quantified below. The \narrays were installed in 100 mm diameter holes drilled using the sonic percussion \ndrilling method. It is estimated that this method disturbed and compacted the ground \nin a cylindrical region around each borehole with a diameter of ~200 mm. Figure 4 \nshows a simplified lithostratigraphic section along the source zone transect, the \nexpected resistivities of each stratum estimated from nearby cone penetrometer \nresistivity profiles, and an indication of the depths below ground level (bgl) to the \nbase of each borehole. The strata interfaces are approximate since they were \ninterpolated from core logs taken from other boreholes adjacent to the site; the logs \nfrom the transect boreholes were not used due to slippages in the core barrels. The \nlocations of the transect boreholes are given in Table 1 (as distances from borehole \n44) together with the surveyed elevation of the ground and the depths to which each \narray was installed. In each borehole, the top few electrodes within the made ground \nhad very high contact resistances and so were not used for resistivity measurements. \n 15 \nThe depths of the top functional electrode in each borehole are also shown in Table 1. \nAll depths were measured to an accuracy of ~1 cm. \n \nBorehole ID Distance (m) Surveyed gound \nelevation (m) \nDepth to base \nof array (mbgl) \nDepth of top \nelectrode (mbgl) \n44 0.00 0.000 6.71 ± 0.01 0.71 ± 0.01 \n45 0.45 0.043 6.31 ± 0.01 0.71 ± 0.01 \n46 0.96 0.055 6.29 ± 0.01 0.69 ± 0.01 \n47 1.48 0.009 6.02 ± 0.01 0.62 ± 0.01 \n48 1.96 0.053 6.11 ± 0.01 0.91 ± 0.01 \n49 2.36 0.041 6.08 ± 0.01 0.88 ± 0.01 \n50 2.74 0.018 6.38 ± 0.01 0.98 ± 0.01 \n \nTABLE 1: Locations and depths of borehole arrays. \n \nApparent resistivity measurements were made on each panel (adjacent pair of \nboreholes) using an AGI SuperSting R8 IP system. This is a 200 W, eight-channel \ninstrument, which permits the automated acquisition and storage of up to eight \nsimultaneous apparent resistivity measurements for a given pair of current electrodes. \nA XH-only measurement scheme was used, which is shown in Fig. 5(a). Current was \npassed between electrodes A and B, and potential differences were measured between \nadjacently numbered potential electrodes (i.e. P2-P1, P3-P2, … , P9-P8). A and B \nstarted at the base of each borehole (so there could be a significant vertical offset \nbetween A and B depending on the differing depths to the bases of the adjacent \nholes). The eight potential differences were measured, and then A was moved to the \nposition of B, B to P1, P1 to P2 etc, and the process was repeated. This continued until \nthe top of the boreholes was reached. At this point, a similar scheme was used where \nthe potential differences below A and B were measured, with A and B moving back \n 16 \ndown the boreholes. This ensured that each measurement was made twice in \nreciprocal configurations (Parasnis 1988), with the average of the two measurements \nbeing taken as the apparent resistivity for that particular configuration. The same \nmeasurement scheme was used for each panel, but the total number of measurements \nfor each panel was different because differing numbers of electrodes were left unused \nat the tops of the boreholes (see Table 1). In total, there were 2,378 reciprocal data \npairs for the whole transect array, comprising 419 for panel 1 (boreholes 44-45), 411 \nfor panel 2 (45-46), 403 for panel 3 (46-47), 387 for panel 4 (47-48), 379 for panel 5 \n(48-49), and 379 for panel 6 (49-50). The difference between each pair of reciprocal \nmeasurements was used as an estimate of its random error to weight the data in the \ninversion. The full data set of 2,378 measurements had a median reciprocal error of \n4.5 %. Note that the error estimated from the reciprocal pair data is due to random \nnoise in the voltage measurement; it is not affected by geometric errors since these are \nsystematic in nature (Oldenborger et al. 2005).   \n4. Data processing and inversion \nDespite the fact that only XH measurements were used to collect the data, \nsome of the electrode configurations were still highly sensitive to geometric error. \nThis was due to the narrow aspect ratio of the panels and the presence of large vertical \noffsets between some pairs of adjacent boreholes. To reduce the effect of geometric \nerrors, we calculated the estimated sensitivity of each measurement to this type of \nuncertainty. The geometry of the XH arrays is defined in Fig. 5(b). Note that the \nspacing between the current and potential electrodes can be different in each hole, and \n 17 \nthat the distances a, b, c, d, and e are absolute (they are no longer dimensionless \nmultiples of a common distance). We define  \n \n22\n\n\n\n∂\n∂\n+\n\n\n∂\n∂\n=\ne\nK\nc\nK\ns . (6) \nsuch that s\n \n\/K represents the estimate of the relative error in K (and hence in ρa) per \nmeter of uncertainty in c and e. By neglecting the topography, K and its partial \nderivatives can be calculated directly from Eq. 1. Therefore for these calculations we \nassume a flat surface at the average ground elevation across the transect. It should \nalso be noted that, to be strictly correct, the values of c and e in Eq. 6 should be exact. \nThe fact that they are uncertain by definition further reinforces the point that s\n \n\/K is an \nestimate. Nevertheless the following example suggests that s\n \n\/K provides a useful \nmeasure for identifying electrode configurations that are prone to geometric errors. \nWe calculated s\n \n\/K for all 2,378 apparent resistivities, and removed any with an \nestimated relative error of s\n \n\/K ≥ 5 m-1. This limit was chosen to reduce the systematic \ngeometric errors to a level similar to that of the random noise. Since we estimated that \nthe uncertainty in the array depths was ~1 cm, this limit equates to geometric errors of \n~5 %, which is similar to the median level of reciprocal (random) error observed in \nthe data. In total 342 apparent resistivities were removed by this process, leaving a \ndata set comprising 2,036 measurements. \n Figure 6(a) shows histograms comparing the distributions of apparent \nresistivity data before (black bars) and after (light gray bars) the data with high \nsensitivities to geometric error were filtered out. Note that the bin widths in the \nhistogram are not uniform; this is so that we can depict in the same diagram the \n 18 \ndetailed distributions of the data before and after filtering. In the original data set, the \napparent resistivities occurred in the range -3,646 Ωm < ρa < 7,112 Ωm. Since we \nexpected the actual subsurface resistivities to lie approximately in the range \n5 Ωm < ρ < 100 Ωm, the presence of negative and large positive apparent resistivities \nmakes it likely that some of the measurements were affected by geometric errors. \nExamining the distribution of the filtered data set strengthens this hypothesis. The \nrange of apparent resistivities after filtering is 11 Ωm < ρa < 142 Ωm, which seems \nmore physically realistic. It is important to emphasize that none of the data were \nremoved because of outlying resistivity values; they were filtered solely on the basis \nof the estimated sensitivity to geometric error, using limits set by the uncertainty in \nthe electrode array depths and the degree of contamination by random noise. The fact \nthat this technique has removed all the suspect data significantly increases our \nconfidence in its use. \n As demonstrated in Figs. (2) and (3), the geometric sensitivity of an electrode \nconfiguration depends on the geometric factor and its partial derivatives with respect \nto the positions of the electrodes. Large geometric sensitivities occur when K changes \nrapidly with position, which will occur when K is close to singular. Since K will also \nbe large in the vicinity of a singularity, it is reasonable to ask whether filtering by \ngeometric sensitivity could be replaced with filtering by the geometric factor, which is \nsimpler to calculate. Figure 6(b) shows a comparison of s\n \n\/K and K for a specific \nconfiguration taken from panel 6 for which the in-hole electrode separations are \na = 0.8 m, b = 0.8 m, the borehole separation is d = 0.387 m, and the midpoint depths \nare c = 1.79 m, e = 1.27 m. This configuration has a sensitivity of s\n \n\/K = 9.5 m-1 and \n 19 \ngeometric factor of |K| = 42.5 m. In Fig. 6(b), c is varied to demonstrate the behaviour \nof s\n \n\/K and K. Although both are large near the singularity, there is no one-to-one \nmapping between the two parameters, e.g. values of s\n \n\/K = 5 m-1 occur where \n|K| = 63.8 m on one side of the singularity and |K| = 25.2 m on the other. To reinforce \nthis point, we removed 342 measurements with the largest |K| from the full data set to \ncompare with the results shown Fig. 6(a). Of the 342 measurements removed by |K| \nfiltering, 71 were different to those removed by s\n \n\/K filtering. After |K| filtering, the \nresulting range of apparent resistivities was -1 Ωm < ρa < 142 Ωm, which is not as \nrealistic as that produced by filtering on s\n \n\/K. A final question raised by filtering on \n|K| is how to define the cut-off limit? In the above example, we chose to remove the \nsame number of data as in Fig. 6(a), but without this prior information it seems that \nany upper limit on |K| could only be assigned on an ad-hoc basis. By contrast, limits \non geometric sensitivity can be determined directly from the known configuration \ngeometry and estimates of the uncertainty in the electrode positions. \nTo investigate the benefits of removing the geometrically sensitive \nmeasurements, we inverted data from each individual panel and also the combined \ndata set for the transect comprising all six panels. We used the Res2DInv software, \nwith the finite-element method to permit the inclusion of topography, the complete \nGauss-Newton solver, and L2 model and data constraints (Loke et al., 2003). The \ndefault settings were used for nearly all control parameters, which were kept identical \nfor each inversion. However, the default damping factor was increased by a factor of \ntwo due to the high level of random noise in the data. In addition, the data were \nweighted using the difference between reciprocal measurements as an estimate of \n 20 \ntheir random error. The systematic geometric errors were treated by filtering out \nconfigurations with high geometric sensitivity, which removed data from three of the \npanels. The inversions of the original and filtered data sets for these panels are \ncompared in Fig. 7. For panel 1 (boreholes 44-45) 33 % of the data were removed; for \npanel 5 (boreholes 47-48) 6 % were removed; and for panel 6 (boreholes 49-50) 48 % \nwere removed. Although the same measurement scheme (Fig. 5(a)) was used for each \npanel, the number of data that were removed from each is different. This is due to \ndifferences between the depths of the base electrodes in neighbouring boreholes, \nwhich changes the geometric factors and sensitivities of the electrode configurations \nfrom one panel to the next. For panels 1 and 6, removing the geometrically sensitive \nmeasurements significantly improved the RMS misfit between the inverted and \nobserved apparent resistivities. For panel 5 there was almost no change, either in the \ninverted image or in the RMS misfit. But this is consistent with the estimated \nsensitivities of the data to geometric error. The small number of data that were \nremoved from panel 5 had sensitivity estimates in the range 5.04 m-1 < s\n \n\/K < \n5.38 m-1, only just above the selected limit of 5 m-1. By contrast, the data that were \nremoved from panels 1 and 6 had sensitivities of 5.01 m-1 < s\n \n\/K < 1,020 m-1 and \n8.67 m-1 < s\n \n\/K < 1,380 m-1 respectively. Given that the data that were removed from \npanel 5 were consistent with the data that remained (since the RMS misfit was \nunchanged), whilst the data that were removed from panels 1 and 6 were not (since \nthe RMS misfits significantly decreased), this provides further evidence that s\n \n\/K is a \nuseful estimate of the sensitivity to geometric error. \n 21 \nHaving assessed the individual panels, in Fig. 8 we compare the inverted \nimages of the data set before (a) and after (b) filtering for the entire six-panel transect. \nBoth images exhibit regions of low resistivity within ~0.05 m of each vertical \nelectrode array, which is consistent with a borehole of 100 mm diameter filled with \nwater and poorly consolidated material from collapsed borehole walls. Between the \nboreholes, the resistivities are somewhat higher than the expected values shown in \nFig. 4. This may be due to compaction by the sonic percussion drilling method. \nNevertheless, the images do seem to show four distinct layers that correspond quite \nclosely with the lithostratigraphic section in Fig. 4. The interfaces between the strata \nare shown by dotted lines overlaid on Fig. 8(a). In both images, there appears to be a \nfairly low contrast boundary at a depth of ~1.5 m that corresponds well with the first \ninterface. Another more obvious, higher contrast boundary occurs at ~3 m, which is \nabout 0.1 m - 0.2 m above the second interface. The highest contrast boundary exists \nat ~5.8 m, which probably corresponds to the third interface, although this is about \n0.5 m below. We note again however that the lithostratigraphic interfaces are \napproximate, having been interpolated from boreholes adjacent to the test site. For \nclarity we have plotted our observed boundaries on Fig. 8(b) only (dashed lines), \nalthough they apply equally well to both images. They partition each image into four \nregions (I, II, III, and IV), and the average resistivities in each region are shown. It \nshould be noted that in all four regions the material was highly disturbed by the \ndrilling and the installation of the multi-level sampler completions. There may also \nhave been localized differences in the vertical distribution of chloride resulting from \nthe reductive dechlorination process. Both of these considerations make an exact \n 22 \ncorrelation between the inverted image and nearby cone penetrometer resistivity \nprofiles unlikely. In region I, the average resistivity is much lower than expected \n(~20 Ωm compared to ~100 Ωm). This is probably because there were several \nelectrodes in the resistive vadose zone that failed to make good galvanic contact and \nwere not used. Therefore most data in region I were measured in the less resistive \nsaturated zone of the made ground. For region II, the resistivity is significantly higher \nthan expected (~30 Ωm instead of ~5 Ωm), but the exact reasons for this discrepancy \nare not clear. In region III, the average resistivity of ~60 Ωm is in reasonable \nagreement with the expected value of ~20 Ωm - 50 Ωm. At the base of the image \n(region IV), the resistivity is somewhat higher than expected (~20 Ωm compared to \n~10 Ωm), but the lack of agreement is probably due to low data density since only \n~10 % of the electrodes were in this region. \nThe qualitative differences between Figs. 8(a) and 8(b) are not as obvious as \nfor some of the individual panels. This is because no data were removed from three of \nthe panels (2, 3 and 4). The unchanged data from these panels have an influence on \nthe inverted image in adjacent panels (Maurer & Friedel 2006), which tends to ensure \nconsistency of the image across the entire transect. Figure 9(a) shows a quantitative \ncomparison in terms of the logarithm of the ratio of the model resistivities before and \nafter filtering. This shows that the changes occur predominantly in panel 6, and to a \nlesser extent in panel 1, which is consistent with the numbers of measurements that \nwere removed from each. As noted above, the influence of data on adjacent panels is \nthe likely cause of the resistivity changes in panel 2, and is probably largely \nresponsible for the changes in panel 5, given that the small number of data removed \n 23 \nfrom this panel had little effect on its individual inverted image (see Fig 7(b)). It is not \npossible to associate specific localised resistivity changes with the removal of \nindividual measurements, since the data tend to be filtered out in groups that are \ndistributed evenly along the vertical extent of each affected panel. This is illustrated in \nFig. 9(b) which indicates the configurations that were removed from panel 5. The \nreason for the removal of all configurations with a particular fixed geometry over a \nrange of depths is that the geometric factor and its derivatives depend only weakly on \nthe depth of the configuration below the surface.   \nIn resistivity inversion, it is normally desirable to use the logarithm of the \napparent resistivity as the data parameter. This transforms the typically large range of \nresistivity values to a linear scale and ensures that all the data have equal weight \nirrespective of their magnitude. But it is worth noting that the full data set, including \nmeasurements with negative apparent resistivities, can be inverted without filtering if \na different data parameter is used. Table 2 shows the RMS misfit obtained for the full \nand filtered data sets using the resistance, the apparent resistivity, and the logarithm of \nthe apparent resistivity as the data parameters. In each case, the inversion was \nterminated when the relative change in the RMS misfit was <0.1 %. It is clear from \nTable 2 that removing geometrically sensitive measurements is beneficial whichever \ndata parameter is used. But the advantage of geometric sensitivity filtering is that it \nwill extract a subset of measurements that can be inverted using the logarithmic data \nparameter. Of the three that were tested, this parameter produced the lowest value of \nthe RMS misfit in the above example (4.8 %), significantly improving on the quality \nof the fit obtained before filtering. This misfit is consistent with the level of random \n 24 \nnoise in the data, which strongly suggests that the systematic geometric errors have \nbeen suppressed effectively by this approach.  \n \nData set Resistance Apparent Resistivity Log Apparent Resistivity \nFull 10.3 % 11.1 % - \nFiltered 6.9 % 5.7 % 4.8 % \n \nTABLE 2: RMS misfit errors obtained using the specified data parameters. \n \n \n6. Conclusions \nSince data errors caused by uncertainties in the geometry of borehole ERT \nconfigurations are systematic in nature, they will not directly be accounted for by \nweighting or filtering based on the reciprocal error. Therefore it is important to obtain \nother estimates of their effects on the measured data. We have shown how to derive \nanalytical expressions for the sensitivity of such measurements to geometric error, \nwhich can be applied to configurations with any number of electrodes from pole-pole \nupwards. The sensitivity, which is calculated from the geometric factor for a \nhomogeneous half-space, is an estimate since the exact geometry of the measurement \nconfiguration and the resistivity distribution of the subsurface are unknown.  \nWe have studied the behaviour of the geometric sensitivity for two generic \nfour-electrode configurations that are frequently used in borehole ERT: IH (current \nflow and potential difference in-hole) and XH (current flow and potential difference \ncrosshole). Using dimensionless distance units for generality, our results show that \nsome IH configurations possess high sensitivity to geometric error for any separation \nbetween the boreholes. By contrast, XH configurations are affected to a much lesser \n 25 \ndegree, only exhibiting high sensitivities for small borehole separations (typically less \nthan the vertical spacing of the current and potential electrodes in the same hole). \nSince XH configurations also provide superior image resolution and signal-to-noise \ncharacteristics, this additional advantage strengthens the case for their use in \npreference to the IH type. \nTo demonstrate the usefulness of this approach, we applied it to estimate the \nsensitivities of all the measurement configurations that were used to gather test data \nfrom a newly installed transect of closely spaced boreholes. This transect is part of an \nongoing research program to monitor bioremediation of chlorinated solvents at a \ncontaminated industrial site. The electrode arrays were installed on rigid plastic \ntubing with precise and constant inter-electrode spacings of 20 cm. However, the \nestimated uncertainty in the depths of installation of each array was ~1 cm. Although \nonly XH configurations were used, the small separations between the boreholes \n(~45 cm) caused some configurations to be highly sensitive to geometric error. Using \nthe estimated sensitivity to geometrical error and the uncertainty in the array depth, \nwe filtered out 14 % of the data that had estimated systematic errors, caused by \nuncertain array geometries, of ≥5 %. Without referring to the measured data in any \nway, this process removed all the outlying measurements with physically unrealistic \napparent resistivities. This enabled the use of logarithmic data which tends to improve \nthe stability of the inversions. The results showed a marked improvement in \nconvergence between the inverted and measured data, both for individual borehole \npairs and for the whole transect. \n 26 \nThe calculations involved in estimating the sensitivity of borehole ERT \nmeasurements to geometric error are straightforward and easy to implement. It may \nbe possible to combine the estimates of geometric error with those obtained from the \ndata for random noise, and subsequently use the combined error to weight the data in \nthe inversion. However, our results show that simply filtering apparent resistivity \nmeasurements using this estimate can significantly improve the fit between the \nobserved and the inverted data. \nAcknowledgements \nProject SABRE is being undertaken by a collaborative team comprising: \nAcetate Products; Archon Environmental; British Geological Survey; Chevron; \nCL:AIRE; DuPont; Environment Agency (England and Wales), ESI; General \nElectric; GeoSyntec; Golder Associates; Honeywell; ICI; Scientifics; SiREM; Shell; \nTerra Systems; University of Edinburgh; University of Sheffield; US EPA. SABRE is \na UK DTI Bioremediation LINK project with specific funding contributions made by \nBBSRC, DTI, the Environment Agency, EPSRC and NERC. Additional funding has \nbeen provided by SERDP (US Department of Defense).  The SABRE team gratefully \nacknowledges these supporting organizations and the in-kind and direct financial \ncontributions made by each team member. \nWe thank the editor (Dr. Oliver Ritter) and two anonymous reviewers for their \nhelpful comments on our original manuscript. This paper is published with permission \nof the Executive Director of the British Geological Survey (NERC). \n 27 \n \nReferences \nBing, Z. & Greenhalgh, S.A., 2000. Cross-hole resistivity tomography using different \nelectrode configurations, Geophysical Prospecting, 48, 887-912. \nBlott, B.H., Daniell, G.J. & Meeson, S., 1998. Electrical impedance tomography with \ncompensation for electrode positioning variations, Physics in Medicine and \nBiology, 43, 1731-1739. \nCarpenter, E.W. & Habberjam, G.M., 1956. A tri-potential method of resistivity \nprospecting, Geophysics, 11, 455-469. \nChambers, J.E., Wilkinson, P.B., Weller, A.L., Meldrum, P.I., Ogilvy, R.D. & Caunt, \nS., 2007. Mineshaft imaging using surface and crosshole 3D electrical \nresistivity tomography: a case history from the East Pennine Coalfield, UK, \nJournal of Applied Geophysics, 62, 324-337. \nCho, I.-K., Kim, J.-H., Chung, S.-H. & Suh, J.-H., 2002. Negative apparent resistivity \nin resistivity method, Mulli-Tamsa (Geophysical Exploration), 5, 199-205. \nDaily, W. & Ramirez, A.L., 2000. Electrical imaging of engineered hydraulic barriers, \nGeophysics, 65, 83-94. \nGoes, B.J.M. & Meekes, J.A.C., 2004. An effective electrode configuration for the \ndetection of DNAPLs with electrical resistivity tomography, Journal of \nEnvironmental and Engineering Geophysics, 9, 127-141. \nKeller, G.V. & Frischknecht, F.C., 1966. Electrical methods in geophysical \nprospecting, Pergamon Press, Oxford. \n 28 \nKumar, R., 1973. Resistivity type curves over outcropping vertical dyke-I, \nGeophysical Prospecting, 21, 560. \nOgilvy, R.D., Kuras, O., Meldrum, P.I., Wilkinson, P.B., Gisbert, J., Jorreto, S., \nPulido Bosch, A., Kemna, A., Nguyen, F. & Tsourlos, P., 2007. Automated \nmonitoring of coastal aquifers with electrical resistivity tomography. In: A. \nPulido Bosch, J.A. López-Geta and G. Ramos González (Editors), Coastal \nAquifers: Challenges and Solutions. Hidrogeología y aguas subterraneas; nº \n23. Instituto Geológico y Minero de España, Madrid, 333-342. \nLaBrecque, D.J., Milleto, M., Daily, W., Ramirez, A. & Owen, E., 1996. The effects \nof noise on Occam’s inversion of resistivity tomography data, Geophysics, 61, \n538-548. \nLaBrecque, D.J., Heath, G., Sharpe, R. & Versteeg, R., 2004. Autonomous \nmonitoring of fluid movement using 3-D electrical resistivity tomography, \nJournal of Environmental and Engineering Geophysics, 9, 167-176. \nLoke, M.H. & Barker, R.D., 1995. Least-squares deconvolution of apparent resistivity \npseudosections, Geophysics, 60, 1682-1690. \nLoke, M.H., Acworth, I. & Dahlin, T., 2003. A comparison of smooth and blocky \ninversion methods in 2-D electrical imaging surveys, Exploration Geophysics, \n34, 182–187. \nMaurer, H. & Friedel, S., 2006. Outer-space sensitivities in geoelectrical tomography, \nGeophysics, 71, G93-G96. \n 29 \nOldenborger, G.A., Routh, P.S. & Knoll, M.D., 2005. Sensitivity of electrical \nresistivity tomography data to electrode position errors, Geophysical Journal \nInternational, 163, 1-9. \nParasnis, D.S., 1966. Mining Geophysics, Elsevier Publishing, London. \nParasnis, D.S., 1988. Reciprocity theorems in geoelectric and geoelectromagnetic \nwork, Geoexploration, 25, 177-198. \nRamirez, A., Daily, W., Binley, A., LaBrecque, D. & Roelant D., 1996. Detection of \nleaks in underground storage tanks using electrical resistance methods, \nJournal of Environmental and Engineering Geophysics, 1, 189-203. \nRidd, P.V., 1994. Electric potential due to a ring electrode, IEEE Journal of Oceanic \nEngineering, 19, 464-467. \nSoleimani, M., Gomez-Laberge, C. & Adler, A., 2006. Imaging of conductivity \nchanges and electrode movement in EIT, Physiological Measurement, 27, \nS103-S113. \nSlater, L., Binley, A., Versteeg, R., Cassiani, G., Birken, R. & Sandberg, S., 2002. A \n3D ERT study of solute transport in a large experimental tank, Journal of \nApplied Geophysics, 49, 211-229. \nSlater, L. & A. Binley, 2003. Evaluation of permeable reactive barrier (PRB) integrity \nusing electrical imaging methods, Geophysics, 68, 911-921. \nVersteeg, R., Ankeny, M., Harbour, J., Heath, G., Kostelnik, K., Mattson, E., Moor, \nK., Richardson, A. & Wangerud, K., 2004. A structured approach to the use of \nnear-surface geophysics in long-term monitoring, The Leading Edge, 23, 700-\n703 \n 30 \nWilkinson, P.B., Chambers, J.E., Meldrum, P.I., Ogilvy, R.D. & S. Caunt, 2006. \nOptimization of array configurations and panel combinations for the detection \nand imaging of abandoned mineshafts using 3D cross-hole electrical resistivity \ntomography, Journal of Environmental and Engineering Geophysics, 11, 213-\n221. \nZhang, J. & Patterson, R.P., 2005. EIT images of ventilation: what contributes to the \nresistivity changes?, Physiological Measurement, 26, S81-S92. \nZhou, B. & Dahlin, T., 2003. Properties and effects of measurement errors on 2D \nresistivity imaging surveying, Near Surface Geophysics, 1, 105-117. \n 31 \nFigure Captions \nFigure 1. Geometry of (a) crosshole (XH) and (b) in-hole (IH) arrays for \nevaluation of general electrode position errors, and (c) XH and (d) IH arrays for \nevaluation of depth offset errors between adjacent boreholes. Current and potential \nelectrodes are shown as open and filled circles respectively. Distances in (c) and (d) \nare given as multiples of the vertical electrode separation a. \nFigure 2. Surface and line plots of (a) error estimate σ, (b) inverse of the \ngeometric factor 1\/K, and (c) relative error estimate σ\/K for XH configurations.  In all \nplots, the left-hand midpoint depth is fixed at γ = 10, and the right-hand midpoint \ndepth range is 5 ≤ ε ≤ 15. In the surface plots, the range of borehole separations is 0.5 \n≤ δ ≤ 5. \nFigure 3. Surface and line plots of (a) error estimate σ, (b) inverse of the \ngeometric factor 1\/K, and (c) relative error estimate σ\/K for IH configurations.  In all \nplots, the left-hand midpoint depth is fixed at γ = 10, and the right-hand midpoint \ndepth range is 5 ≤ ε ≤ 15. In the surface plots, the range of borehole separations is 0.5 \n≤ δ ≤ 5. \nFigure 4. Plan view of SABRE test cell, showing source and plume zone transect \nborehole fences. The lithostratigraphic section shows the expected resistivities of the \nfour strata and the depths of the seven boreholes on the source zone transect. \n 32 \nFigure 5. (a) XH multi-channel measurement scheme used to collect ERT data \non each panel. The dashed line joins the current electrodes, the dotted lines join \nsequential pairs of potential electrodes. (b) Geometry for evaluation of depth offset \nerrors between adjacent boreholes for general XH arrays.  \nFigure 6. (a) Distribution of apparent resistivities before and after filtering out \nmeasurements with high sensitivity to geometric error (black and gray bars \nrespectively). (b) Comparison of the geometric sensitivity (s\n \n\/K) and geometric factor \n(K) with midpoint depth c for a specific four-electrode configuration. The shaded \nregion indicates the region for which s\n \n\/K > 5 m-1, and the arrow indicates the actual \nmidpoint depth and sensitivity of the given measurement. \nFigure 7. Comparison of ERT images before and after filtering for (a) panel 1, \n(b) panel 5, and (c) panel 6. The RMS misfits (Erms) are given beneath each image. \nFigure 8. Comparison of ERT images for the entire transect (a) before and (b) \nafter filtering. The RMS misfit (Erms) and average resistivities for regions I-IV are \ngiven beneath each image. Predicted lithostratigraphic interfaces are shown as dotted \nlines in (a), observed interfaces are shown as dashed lines in (b). \nFigure 9. (a) Logarithm of the ratio of the model resistivities before and after \nfiltering. (b) Illustration of the shallowest and deepest configurations that were \nremoved from panel 5 by geometric sensitivity filtering. The current and potential \nbipoles are shown by red and blue lines respectively. The arrow indicates that all \n 33 \nconfigurations with the same fixed geometry lying between these two were also \nremoved from panel 5.  \nFigure A1. (a) Geometry of a XH configuration with a large and close to singular \ngeometric factor. The subsurface resistivity distribution is a vertically faulted half-\nspace, with resistivities ρ1 and ρ2. (b) Dependence of apparent resistivity ρa on ρ2. \n 34 \n \n \nFigure 1 \n 35 \n \n \nFigure 2 \n 36 \n \n \nFigure 3 \n 37 \n \n \nFigure 4 \n 38 \n \n \nFigure 5 \n 39 \n \n \nFigure 6 \n 40 \n \nFigure 7 \n 41 \n \n \nFigure 8 \n 42 \n \n \nFigure 9 \n \n 43 \n \n \nFigure A1 \n 44 \nAppendix A: The reality of negative apparent \nresistivities \nThe apparent resistivity ρa is often described as a weighted average of the \nresistivity distribution through which the current flows, despite the fact that this has \nlong been known to be wrong (Parasnis 1966). More correctly, it can be understood as \nthe resistivity of a hypothetical homogeneous subsurface that would yield the same \npotential difference when using the same current and arrangement of electrodes. But \nin either interpretation, it is very difficult to understand the physical meaning of \nnegative apparent resistivities. In our experience, they are often attributed to noise, or \nto the current or voltage electrodes being accidentally transposed. But it is not always \nthe case that a negative apparent resistivity is an indicator of random or systematic \nerror. There are circumstances under which ρa < 0 is possible, and is a valid \nmeasurement. This was first pointed out by Carpenter & Habberjam (1956) for a \nlayered earth, by Kumar (1973) for an outcropping vertical dyke, and has been \nrecently rediscovered by Cho et al. (2002) and by ourselves. \nLet Ei be the electric field in the vicinity of the potential electrodes M and N \nin the inhomogeneous half-space in which we are measuring the apparent resistivity. \nSimilarly, let Eh be the electric field in the same region of a homogeneous half-space \nwith the same electrode configuration. Also, let rMN be the vector from M to N. If \nρa < 0 it implies that the component of Ei along rMN points in the opposite direction to \nthe same component of Eh. This can happen if the secondary field in the vicinity of M \n 45 \nand N, which is caused by the inhomogeneous resistivity distribution, is greater than \nthe primary field, which is due to the current electrodes (Cho et al., 2002). This is not \noften the case, but it can happen if the primary field is weak (i.e. the potential \ndifference is small, which occurs if the geometric factor is close to singular), and if \nthere are strong resistivity contrasts near the electrodes (so that the weak primary \nfields are distorted by strong secondary fields). \nSince geoelectrical inversion algorithms usually regard the electrode positions \nas fixed and accurate, what happens if a geometric error significantly changes an \napparent resistivity measurement, or causes it to become negative? If ρa increases then \nthe volumetric average concept suggests that localized high contrast anomalies will \nappear in the resistivity tomogram near the affected electrodes, increasing the \napparent resistivity of that particular measurement. But if ρa becomes negative then \nthis interpretation is not valid. In this case, we must consider the problem in terms of \nstrong secondary fields. This also suggests that high contrast anomalies are likely to \nappear near the electrodes. These anomalies would distort the primary field, and if \nstrong enough, could cause the predicted apparent resistivity to become negative and \ntherefore improve the fit to the observed data that are negative due to geometric error. \nFigure A1 demonstrates a simple example of a real negative apparent resistivity \nmeasured using a XH configuration and caused by a resistivity contrast close to two \nof the electrodes. In Fig. A1a, the XH configuration is close to singular, and has a \nhigh geometric factor of K ≈ 5,700 m. The resistivity distribution is a vertically \nfaulted half space, with ρ = ρ1 to the left of the fault, and ρ = ρ2 to the right. The \napparent resistivity for this configuration can be calculated easily by incorporating \n 46 \nimage charges above the surface into the standard solution for the surface potential \n(Keller & Frischknecht 1966). The variation of ρa as a function of the resistivity \ncontrast is shown in Fig. A1b. This demonstrates that the apparent resistivity can \nchange dramatically with the contrast across the fault, and can indeed become \nnegative. Since ρa > ρ1 when ρ2 < ρ1, and ρa < ρ1 when ρ2 > ρ1, there are no \ncircumstances in this example for which ρa can be a weighted average of ρ1 and ρ2. \nThis is true whether ρa is positive or negative. \n \n"}