{"doi":"10.1007\/978-3-642-00413-1_11","coreId":"69751","oai":"oai:eprints.lancs.ac.uk:22899","identifiers":["oai:eprints.lancs.ac.uk:22899","10.1007\/978-3-642-00413-1_11"],"title":"Persuasive Mobile Health Applications.","authors":["Garcia Wylie, Carlos Miguel","Coulton, Paul"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":["Weerasinghe, Dasun"],"datePublished":"2008-09","abstract":"With many industrialized societies bearing the cost of an increasingly sedentary lifestyle on the health of their populations there is a need to find new ways of encouraging physical activity to promote better health and well being. With the increasing power of mobile phones and the recent emergence of personal heart rate monitors, aimed at dedicated amateur runners, there is now a possibility to develop “Persuasive Mobile Health Applications” to promote well being through the use of real-time physiological data and persuade users to adopt a healthier lifestyle. In this paper we present a novel general health monitoring software for mobile phones called Heart Angel. This software is aimed at helping users monitor, record, as well as improve their fitness level through built-in cardio-respiratory tests, a location tracking application for analyzing heart rate exertion over time and location, and a fun mobile-exergame called Health Defender","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:22899<\/identifier><datestamp>\n      2018-01-24T02:04:20Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5141:51413736<\/setSpec><setSpec>\n      74797065733D626F6F6B5F73656374696F6E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Persuasive Mobile Health Applications.<\/dc:title><dc:creator>\n        Garcia Wylie, Carlos Miguel<\/dc:creator><dc:creator>\n        Coulton, Paul<\/dc:creator><dc:subject>\n        QA76 Computer software<\/dc:subject><dc:description>\n        With many industrialized societies bearing the cost of an increasingly sedentary lifestyle on the health of their populations there is a need to find new ways of encouraging physical activity to promote better health and well being. With the increasing power of mobile phones and the recent emergence of personal heart rate monitors, aimed at dedicated amateur runners, there is now a possibility to develop “Persuasive Mobile Health Applications” to promote well being through the use of real-time physiological data and persuade users to adopt a healthier lifestyle. In this paper we present a novel general health monitoring software for mobile phones called Heart Angel. This software is aimed at helping users monitor, record, as well as improve their fitness level through built-in cardio-respiratory tests, a location tracking application for analyzing heart rate exertion over time and location, and a fun mobile-exergame called Health Defender.<\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:contributor>\n        Weerasinghe, Dasun<\/dc:contributor><dc:date>\n        2008-09<\/dc:date><dc:type>\n        Contribution in Book\/Report\/Proceedings<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/978-3-642-00413-1_11<\/dc:relation><dc:identifier>\n        Garcia Wylie, Carlos Miguel and Coulton, Paul (2008) Persuasive Mobile Health Applications. In: Electronic healthcare. Lecture Notes of the Institute for Computer Sciences, Social Informatics and Telecommunications Engineering . Springer, Berlin, pp. 90-97. ISBN 978-3-642-00412-4<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/22899\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1007\/978-3-642-00413-1_11","http:\/\/eprints.lancs.ac.uk\/22899\/"],"year":2008,"topics":["QA76 Computer software"],"subject":["Contribution in Book\/Report\/Proceedings","NonPeerReviewed"],"fullText":"Persuasive Mobile Health Applications \nCarlos Garcia Wylie and Paul Coulton. \nInfolab21, Lancaster University Lancaster, LA1 4WA, UK \n  \nc.garciawylie@lancaster.ac.uk , p.coulton@lancaster.ac.uk \n \nAbstract. With many industrialized societies bearing the cost of an increasingly \nsedentary lifestyle on the health of their populations there is a need to find new \nways of encouraging physical activity to promote better health and well being. \nWith the increasing power of mobile phones and the recent emergence of \npersonal heart rate monitors, aimed at dedicated amateur runners, there is now a \npossibility to develop “Persuasive Mobile Health Applications” to promote well \nbeing through the use of real-time physiological data and persuade users to \nadopt a healthier lifestyle. In this paper we present a novel general health \nmonitoring software for mobile phones called Heart Angel. This software is \naimed at helping users monitor, record, as well as improve their fitness level \nthrough built-in cardio-respiratory tests, a location tracking application for \nanalyzing heart rate exertion over time and location, and a fun mobile-exergame \ncalled Health Defender. \nKey words: 1eHealth, Persuasive, Exercise, Mobile. \n1 Introduction \nIt is well accepted that the increasing sedentary lifestyle of many industrialized \nsocieties is helping fuel the dramatic rises in type 2 diabetes, chronic heart disease and \nobesity. In the UK it has been reported across the various News media that recent \nestimates suggest that over 60% of males and 50% of females will be clinically obese \nby 2050, and that 40% of school age children are overweight or obese. In addition to \nthis, depression and mental ill health is set to be one of the fastest growing conditions \nin UK with 1 in 6 of the population suffering from a neurotic disorder [7]. Whilst the \noverall reasons for this are may seem complex there is one simple thing we can all do \nto improve this situation, exercise.  \nExercise not only makes the body stronger, fitter and more flexible. It also helps to \nreduce the risk of illnesses such as heart disease and stroke, the latter being the \ngreatest single cause for severe disability in the UK [9]. It is widely recommended by \nexperts that everybody should undergo at least 30 minutes of mild exercise 5 times a \nweek, but with our ever increasing busy life styles we try to find new ways in which \nto persuasively encourage people to undertake such physical exercise.  \n                                                 \neHealth 2008, September 8th and 9th, 2008, City University, London EC1 \nIn the early years of this decade health clubs where at the peak of their popularity \nwith around 8.7 million members in Britain, though numbers have been falling \nrapidly in recent years. Surveys show that 6 months after joining there is a dropout \nrate of around 60%, and that near 20% of members only attend once a month [10]. \nWith attendance to health clubs dropping, new technologies are arising to try to \npromote individual personal exercising.  \nNike and Apple joined forces to release Nike+ iPod Sports Kit which calculates \ndistance and pace for a walk or run while storing and relaying back the data to the \nuser as they listen to music. The data can later be uploaded to Nike’s website for \nanalysis, as well as sharing and comparing it to other members of the community. \nSimilarly Adidas and Samsung released miCoach, which consists of a specific \nSamsung mobile phone connected to a heart rate monitor and external stride sensor \nwith very similar functionalities to the Nike+. Both approaches are great at \nmonitoring physical exercise though limiting as they are principally targeting users \nalready involved in physical activities, required to purchase specific gadgets that can \nonly be used together. With the increasing power of mobile phones and the ability to \nconnect them between emerging health monitoring devices, as well as their \nadaptability to the mobile health sector [5], is making it possible to develop and \ndeploy mobile heath promoting applications at low prices to an ever growing mobile \ncommunity. \nPersuasive technologies [2] can be described as those that attempt to change user \nattitudes and behavior in some way or another. In this paper we present a novel \npersuasive mobile health application called Heart Angel intended to encourage users \nto assess, monitor and improve their fitness level. \n2 Heart Angel \nHeart Angel is a structured exercise and health monitoring application written in \nJ2ME developed to help people measure, monitor, record, and improve their personal \nhealth whether starting or already indulged in physical activities. This is achieved \nthrough in-built cardio-respiratory tests, a HR and position tracking application, or a \nmini-game inspired by the old arcade classic Space Invaders called Health Defender. \nThe application makes use of a Bluetooth enabled mobile phone connected to a Heart \nRate Monitor (HRM), as well as an inbuilt Global Positioning System (GPS) receiver \nto collect data on users HR, as well as location trail.  \n \nHeart Angel incorporates a series of tests developed to measure and improve health. \nUsers can choose between a 3 minute Step-Test, or the recognized Rockport Test, to \nmeasure and monitor their current fitness level. Results can be saved to a text file for \nfuture analysis and interpretation through the application itself, or downloaded to a \npersonal computer. \n \nUsers requiring a detailed analysis of performance can use the phones inbuilt GPS \nreceiver together with the HRM. This allows data on HR at a given time for a given \nlocation to be recorded at 2 second intervals and then saved as a text file on the device \nfor download. Exertion Maps can then be drawn for analysis seeing when, where, and \nwhy, exertion was highest during workouts.  Multiple workouts for the same circuit \ncan then be analyzed over time to observe improvements in performance. \n \nIn the following paragraphs we present the different cardio-respiratory workouts \nincorporated in the application, as well as how Heart Angel tries to persuasively \nencourage users to exercise on a regular basis through real-time physiological data \nand results feedback. Further development to the application will also be discussed. \n \n2.1 Connectivity  \n \nTo make use of the Heart Angel application users are required to enable Bluetooth \nconnectivity on their mobile phones, as well as strapping up to the Alive \nTechnologies HRM Chest Strap, as shown in Fig. 1. Initial testing showed that the \nHRM was prone to errors due to the nature of the connection between the Chest \nStraps and a user’s skin, as well as friction generated between these when users where \nin motion. Dampening the area of contact minimized the frequency and range of the \nerrors, but a five value filtered average for HR was implemented for HR feedback.  \n \n \nFig. 1.  Alive Technologies HRM Chest-Strap connected to phone via Bluetooth. \n \n2.2 Cardio-Respiratory Workouts \n \nHeart Angel provides a selection of workouts from which users can calculate, \nmonitor, and improve their physical fitness. Following is a description on each \nfocusing on their functionality. \n \n2.2.1 Tecumseh Step-Test \n \nThis is the simplest cardio-respiratory workout available for calculating user fitness \nlevel. Users are required to enter details on gender and age, and have the option to \nsave their results for future interpretation through the application it self, or download \nto a personal computer. \n \nWhen ready, users perform a 3min step-test performing a four-step cycle (R-foot UP, \nL-foot UP, R-foot DOWN, L-foot DOWN) ideally completing an average of 24 \ncycles in one minute on an 8inch (20cm) bench\/step. An inbuilt pace keeper can be \nenabled by users to help them keep to this pace. Once completed user HR is captured, \nand their subsequent results calculated and displayed on the phones screen. During the \ncardio-respiratory test the last 115 HR values for a user are displayed via a line graph \nat the top of the screen, allowing users to visualize HR exertion over time \n \n2.2.2 Rockport Test \n \nUsers can also perform the internationally recognised cardio-respiratory test, The \nRockport Test in which they are required to walk a distance of one mile as fast as \npossible. As in the Tecumseh Step-Test, users are required to enter data on gender, \nage as well as weight, and choose whether to save their results for future comparisons. \nWhen completed the walk, users stop the workout and a measure of their current \nfitness level as well as their VO2MAX2 is displayed, see Fig. 2 leftmost screenshot. \nAgain the last 115 HR values for a user are displayed via a line graph at the top of the \nscreen, allowing users to visualize HR exertion over time \n \nTo try to ensure that results are as accurate as possible, the application makes use of a \nrunning filter which collects user HR every 15 seconds as well as at workout \ncompletion. Such filter tries to minimise errors due to users increasing their pace near \ncompletion, giving a higher than normal final HR. \n \n2.2.3 Free-Jog \n \nFor users more concerned in analysing and comparing past and future workouts \nwhether it be walking, jogging or cycling, Heart Angel includes it’s “Free-Jog” \napplication which allows use of a GPS receiver. Users are required to enter details on \nage and resting HR, entered manually or automatically collected via the HRM, as well \nas being able to enter a description on their location which will be saved along with \nthe results. \n \nBy knowing a user’s resting HR and age it is possible to calculate their maximum HR \nand consequently their different HR Training Zones. This information is then relayed \nback in real-time to the user through a pie chart displayed on the mobile phone’s \nscreen showing at what Training Zone intensity they are currently working at as well \nas the linked health benefit it carries. The last 115 HR values for a user are again \ndisplayed via a line graph at the top of the screen, allowing users to visualize HR \nexertion over time, see Fig. 2 rightmost screenshot.  \n                                                 \n2   The volume of oxygen that can be consumed while exercising at maximum capacity, or the \nmaximum amount of oxygen in millilitres that can be consumed in one minute per kilogram \nof body weight. \n                  \nFig. 2. Rockport-Test (left) & Free-Jog (right) display and result layouts. \n \nThrough the use of the inbuilt GPS receiver, data on user position can be collected \ntogether with current HR and time. This data is saved at 2 second intervals to a text \nfile on the mobile phone’s memory for download. From such file it is then possible to \ndraw Exertion Maps for individual or multiple workouts and have a much improved \nvisual representation of HR exertion over time and location. Though Heart Angel \ndoes not provide the means to plot such graphs, Fig. 3 represents an exertion map \nshowing two different routes for Lancaster University’s South-West Campus in which \nHR exertion can be analysed with knowledge of the terrain. \n \n \nFig. 3 Exertion Map showing two routes for Lancaster University’s SW Campus. 3 \n \n                                                 \n3 Subject to Crown Copyright OS Landline 2006. An Ordnance Survey\/Edina supplied service. \n \n2.2.4 Health Defender Exergame \n \nHealth Defender is an Exergame inspired in the old classic Space Invaders which \nmakes use of a HRM to collect and relay real-time HR data back to a player. Such \ndata is used to inform users on their current HR exertion during game play, and \ntrigger Bonus events. It is through these bonuses that Health Defender tries to \nencourage users to physically exercise by raising their HR to obtain such bonus. The \nobjective of the application is to encourage players to exercise during game play to \nboth improve gaming experience, as well as personal health [3]. \n \n2.3 Persuasive Physical Exercise through User Feedback  \n \nHeart Angel tries to persuade users to keep using the application, and therefore \ncontinue exercising, by providing real-time feedback on user current HR exertion and \nrelative HR Training Zone. Users have a real-time visual representation of the \nintensity at which they are exercising at together with a report on the health benefit \nthat exercising at such intensity is providing them. By reporting such information to \nusers while actively involved in the physical workout, these are encouraged to either \nmaintain or further increase their physical exertion as they are reassured that a \nphysical benefit is being achieved. \n \nAllowing users to keep track of past workout results is also important to allow for \nobservations in any physical fitness improvement. Before initializing any of the \ninbuilt cardio-respiratory test users may choose to save their results for future \ninterpretation and analysis through the application itself, or downloaded to a \ncomputer. This allows users to conduct weekly or monthly tests, compare their results \nand observe any improvements in fitness, which in turn encourages users to carry on \nexercising due to improvements being observed. \n \n \n3 Further Work \n \nThrough interpretation of the HRM inbuilt Accelerometers it would be possible to \ncalculate user pace, and encourage users to increase it by matching beat of a music \ntrack to their own foot fall. It would also be possible to count the number of strides a \nuser takes and with knowledge of their average stride length estimate the distance \ncovered for a workout. The average number of calories burned could then also be \ncalculated and relayed back to the users while exercising. By relaying back this \nadditional information Section 2.3 is further developed by encouraging users to \nfurther indulge into physical exercise. The use of the accelerometer data would also \nmake it possible to further accessorise user workouts by introducing specific exercises \nsuch as crunches or push-ups verified by the application.  \n \nThe discussed version of Heart Angel has been designed as a personal assistant to \nhelp in the assessment and improvement of personal fitness. But just as data is saved \nto a mobile phone, it would be easily possible to allow for network data transmission \nof such data back to GP’s. Through the use of 2.5 and 3G technologies it is possible to \nsafely transmit user real-time physiological data after or during workouts over the \nwireless network for their interpretation and monitoring of GP’s [4, 8]. This would \nhelp minimise on site patient health monitoring visits and allow users to perform their \nassessments in whatever location was most convenient for them while relaying \nprogress and results back to GPs. \n \nFinding the time to be able to perform structured exercise, where HR is elevated for \nlong periods of time, is less probable every day that goes by. Our ever increasing busy \nlife styles prevent us from taking much time off, and less people are using such time \nfor exercising. By introducing opportunistic physical activity feedback, incorporation \nof physical activities into everyday lifestyle to increase the overall level of activity, it \nwould be possible to further encourage users to exercise while going about their \neveryday lives. By informing users on the total number of steps taken and calories \nburned in a normal day, it would be possible to encouraged users to further increase \ntheir calories burned by, for example, taking the stairs as oppose to an elevators. \nNatural human competitiveness could then be used to further encourage exercise by \nallowing comparison of results between users in nearby areas, though data shared \nshould be limited to purely performance data, such as steps taken or calories burned, \nand not personal such as weight or age [1]. \n \n \n4 Conclusion \n \nWith people no longer turning to health clubs as a means of getting and keeping fit \nbut rather choosing to perform their own workouts whenever convenient for them, it \nis necessary to come up with genuine ways in which to assess, monitor, encourage \nand promote well being through physical exercise, structured or opportunistic. With \nmobile phone technology ever improving, and the number of applications we find on \nthese growing, mobiles have become the ultimate gadget for work as well as \nentertainment. With the development of external health monitoring devices and the \nincreasing connectivity of mobiles it is now possible to pair up such devices to \npromote personal health. \n \nHeart Angel effectively allows users to convert their already acquired and daily used \nmobile phone into a mobile personal trainer with the only extra cost of acquiring a \nHRM. Users can decide to firstly assess their current fitness level against recognised \ncardio-respiratory tests, and then monitor any improvements to their fitness level at \ntheir own convenience carrying no extra gadgets other than their own mobile phone \nand a HRM. The ability to assess user fitness level through the application allows \nusers to obtain a standardised measure of their current fitness level, as oppose to \njudging how fit they may be based on their relative performances during workouts, \nand therefore observe and measure improvements. Heart Angel allows using mobile \nphone functionalities without any limitations or restrictions so users can listen to their \nfavourite music using their phones inbuilt mp3 player while running the application, \nas well as making and receiving phone calls. \n \nMonitoring and promoting personal health through the use of technology should not \nbe limited to an economically segmented minority required to purchase the latest \nspecialised equipment. Rather it should be widely available to all that posses a mobile \nphone that meets a set of basic requirements. The discussed version of Heart Angel \ndoes necessitate the use of an inbuilt GPS receiver to obtain location coordinates, but \nthis is not a basic requirement to operate the software and so users can still obtain the \nmaximum health benefit from the application. Not only is the cost of monitoring \nphysical exercise drastically reduced by limiting the number of specialised exercising \ngadgets users are required to purchase, but users can go round their everyday lives \ncarrying a personal trainer at the touch of a button while using their already \npurchased, daily used mobile phone.  \n \nAcknowledgements \n \nThe authors would like to express their thanks to Nokia for the provision of software \nand hardware to the Mobile Radicals research group at Lancaster University which \nwas used for the implementation of this project.  \n \nReferences \n \n1. Consolvo S., Everitt K., Smith I., Landay James A. Design Requirements for Technologies \nthat Encourage Physical Activity, Proceedings of the SIGCHI conference on Human \nFactors in computing systems. Montréal, Québec, Canada April 22-27, 2006, pp 457 – \n466. \n2. Fogg B.J., Persuasive computers: perspectives and research directions, Proceedings of the \nSIGCHI conference on Human factors in computing systems, p.225-232, April 18-23, \n1998, Los Angeles, California, United States  \n3. Garcia Wylie C., Coulton P., Mobile Exergaming, Submitted to ACE’08, December 3–5, \n2008, Yokohama, Japan. \n4. Konstantas D., Jones V., Bults R.. Herzog R. MobiHealth - Innovative 2.5 \/ 3G mobile \nservices and applications for healthcare, 11th IST Mobile and Wireless \nTelecommunications Summit 2002, Thessaloniki, Greece, June 16-19, 2002,  \n5. Lacal Jose C. Cell Phones and Tele-Medicine, Proceedings of Healthcom 2003, the Fifth \nInternational Workshop on Enterprise Networking and Computing in Healthcare Industry; \nSanta Monica, California June 2003. \n6. Marti R., Delgado J., Security in a Wireless Mobile Health Care System, Universitat \nPompai Fabra – white paper. 2003 \n7. Rashid O., Coulton P, and Bird W. Using NFC to Support and Encourage Green Exercise, \nProceedings of the 2nd International Conference on Pervasive Computing Technologies \nfor Healthcare 2008, Tampere, Finland 30 Jan - 1 Feb 2008. \n8. Varshney U. Using wireless technologies in healthcare. International Journal of Mobile \nCommunications 2006 - Vol. 4, No.3  pp. 354 – 368 \n9. BBC Health, http:\/\/www.bbc.co.uk\/health\/conditions\/stroke\/ \n10. Times Online, Britons are leaving the gym, March 4, 2008 \nhttp:\/\/www.timesonline.co.uk\/tol\/life_and_style\/health\/features\/article3476487.ece \n"}