{"doi":"10.1080\/00330121003600835","coreId":"214933","oai":"oai:eprints.lse.ac.uk:28351","identifiers":["oai:eprints.lse.ac.uk:28351","10.1080\/00330121003600835"],"title":"Visa restrictions and bilateral travel","authors":["Neumayer, Eric"],"enrichments":{"references":[{"id":17296336,"title":"Armed Conflict 1946–2001: A New Dataset.","authors":[],"date":null,"doi":"10.1177\/0022343302039005007","raw":"Armed Conflict 1946–2001: A New Dataset. Journal of Peace Research 39:615-37.","cites":null},{"id":17296349,"title":"Coming and going: on the state monopolization of the legitimate ‘means of movement’.","authors":[],"date":"1998","doi":"10.1111\/0735-2751.00055","raw":"Torpey, J. 1998. Coming and going: on the state monopolization of the legitimate ‘means of movement’. Sociological Theory 16:239-259.","cites":null},{"id":17296340,"title":"Estimation with correctly interpreted dummy variables in semilogarithmic equations.","authors":[],"date":"1981","doi":null,"raw":"Kennedy,  P.  E.  1981.  Estimation  with  correctly  interpreted  dummy  variables  in semilogarithmic equations. American Economic Review 71: 801.","cites":null},{"id":17296332,"title":"Frontiers and security in the European Union: The illusion of migration control.","authors":[],"date":"1998","doi":null,"raw":"Bigo,  D.  1998.  Frontiers  and  security  in  the  European  Union:  The  illusion  of migration control. In The frontiers of Europe, eds. M. Anderson and E. Bort, 148-164. London and Washington, D.C.: Pinter.","cites":null},{"id":17296348,"title":"Globalisation and its discontents.","authors":[],"date":"1998","doi":"10.1057\/9780333981610","raw":"———. 1998. Globalisation and its discontents. New York: New Press.","cites":null},{"id":17296330,"title":"Gravity for Dummies and Dummies for Gravity Equations. Working Paper 12516.","authors":[],"date":"2006","doi":"10.3386\/w12516","raw":"Baldwin, Richard and Daria Taglioni. 2006. Gravity for Dummies and Dummies for Gravity Equations. Working Paper 12516. Cambridge, MA: National Bureau of Economic Research.","cites":null},{"id":17296350,"title":"International migration report.","authors":[],"date":"2002","doi":null,"raw":"UN. 2002. International migration report. New York: United Nations.","cites":null},{"id":17296347,"title":"Losing control? Sovereignty in an age of globalisation.","authors":[],"date":"1996","doi":"10.1177\/089692059802400112","raw":"Sassen, S. 1996. Losing control? Sovereignty in an age of globalisation. New York: Columbia University Press.","cites":null},{"id":17296334,"title":"Nations rebound?: crossing borders in a gated globe.","authors":[],"date":"2004","doi":"10.1080\/10702890490493527","raw":"Cunningham,  H.  2004.  Nations  rebound?:  crossing  borders  in  a  gated  globe.","cites":null},{"id":17296344,"title":"On passports and border controls.","authors":[],"date":"2001","doi":"10.1016\/s0160-7383(00)00050-5","raw":"O’Byrne, D. J. 2001. On passports and border controls. Annals of Tourism Research 28: 399-416.","cites":null},{"id":17296341,"title":"Real challenges for virtual borders: the implementation of USVISIT.","authors":[],"date":"2005","doi":null,"raw":"Koslowski, R. 2005. Real challenges for virtual borders: the implementation of USVISIT. Washington, DC: Migration Policy Institute.","cites":null},{"id":17296345,"title":"Rights of passage – the passport in international relations. Boulder and London: Lynne Riener.","authors":[],"date":"2003","doi":"10.7202\/010493ar","raw":"Salter,  M.  B.  2003.  Rights  of  passage  –  the  passport  in  international  relations. Boulder and London: Lynne Riener.","cites":null},{"id":17296353,"title":"Statistical information on CD-Rom. Madrid: World Tourism Organization.","authors":[],"date":"2007","doi":null,"raw":"WTO.  2007.  Statistical  information  on  CD-Rom.  Madrid:  World  Tourism Organization.","cites":null},{"id":17296328,"title":"The escalation of U.S. immigration control in the post-NAFTA era.","authors":[],"date":"1998","doi":"10.2307\/2658246","raw":"Andreas, P. 1998. The escalation of U.S. immigration control in the post-NAFTA era. Political Science Quarterly 113: 591-615.","cites":null},{"id":17296342,"title":"The Impact of Violence on Tourism – Dynamic Econometric Estimation in a Cross-National Panel.","authors":[],"date":"2004","doi":"10.1177\/0022002703262358","raw":"———.  2004.  The  Impact  of  Violence  on  Tourism  –  Dynamic  Econometric Estimation in a Cross-National Panel. Journal of Conflict Resolution 48 (2): 259-281.","cites":null},{"id":17296346,"title":"The log of gravity.","authors":[],"date":"2006","doi":"10.2139\/ssrn.380442","raw":"Santos  Silva,  J.  M.  C.,  and  S.  Tenreyro.  2006.  The  log  of  gravity.  Review  of Economics and Statistics 88: 641-658.","cites":null},{"id":17296327,"title":"The transformation of border controls: A European precedent?","authors":[],"date":"2000","doi":null,"raw":"Anderson, M. 2000. The transformation of border controls: A European precedent? In The wall around the West – state borders and immigration controls in North America and Europe, eds. P. Andreas and T. Snyder, 15-29. Lanham: Littlefield.","cites":null},{"id":17296337,"title":"Travel information manual.","authors":[],"date":"2004","doi":null,"raw":"IATA. 2004. Travel information manual. Badhoevedorp: International Air Transport Association.","cites":null},{"id":17296331,"title":"U.S. immigration: groups urge easing of restrictions on visa policies affecting scientists.","authors":[],"date":"2004","doi":"10.1126\/science.304.5673.943a","raw":"Bhattacharjee, Y. 2004. U.S. immigration: groups urge easing of restrictions on visa policies affecting scientists. Science 304: 943.","cites":null},{"id":17296343,"title":"Unequal Access to Foreign Spaces: How States Use Visa Restrictions to Regulate Mobility in a Globalised World.","authors":[],"date":"2006","doi":"10.2139\/ssrn.695122","raw":"———. 2006. Unequal Access to Foreign Spaces: How States Use Visa Restrictions to Regulate Mobility in a Globalised World. Transactions of the British Institute of Geographers 31: 72-84. 22 ———. 2010. On the Detrimental Impact of Visa Restrictions on Bilateral Trade and Foreign  Direct  Investment.  Working  Paper.  London  School  of  Economics: Department  of  Geography  and  Environment. http:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=1470717 Nevins, J. 2002. Operation gatekeeper. New York and London: Routledge.","cites":null},{"id":17296338,"title":"Updating of the consolidated statement of continuing ICAO policies in the air transport field A35-WP\/44. Montreal: International Civil Aviation Organization.","authors":[],"date":"2004","doi":null,"raw":"ICAO. 2004. Updating of the consolidated statement of continuing ICAO policies in the  air  transport  field  A35-WP\/44.  Montreal:  International  Civil  Aviation Organization.","cites":null},{"id":17296335,"title":"US visa delays: keeping scientists from where they want to be?","authors":[],"date":"2004","doi":"10.1641\/0006-3568(2004)054[0296:uvdksf]2.0.co;2","raw":"Identities: Global Studies in Culture and Power 11: 329-350. 21 Froelich, A. 2004. US visa delays: keeping scientists from where they want to be? BioScience 54: 296.","cites":null},{"id":17296333,"title":"Visa requirements, carrier sanctions, ‘safe third countries’ and ‘readmission’: the development of an asylum ‘buffer zone’ in Europe.","authors":[],"date":"1996","doi":"10.2307\/622926","raw":"Collinson, S. 1996. Visa requirements, carrier sanctions, ‘safe third countries’ and ‘readmission’:  the  development  of  an  asylum  ‘buffer  zone’  in  Europe. Transactions of the Institute of British Geographers 21: 76-90.","cites":null},{"id":17296352,"title":"World Development Indicators on CD-Rom.","authors":[],"date":"2007","doi":"10.1596\/978-0-8213-6959-3","raw":"World Bank 2007. World Development Indicators on CD-Rom. Washington, D.C.: World Bank.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"The vast majority of states impose visa restrictions on travelers from some foreign countries. Such restrictions are likely to deter foreign visitors from affected countries. They will therefore reduce the flow of tourists, businesspeople, and other travelers and thereby damage a country's tourism industry, reduce its trade, and affect its scientific, cultural, and other exchanges with foreign countries. This study estimates the damaging effect exerted by visa restrictions on bilateral travel in a country dyad data set covering the period from 1995 to 2005. It finds that, depending on the exact model specification chosen, visa restrictions reduce such travel by on average between 52 and 63 percent but with substantial regional variation. Given this large detrimental effect of visa restrictions on bilateral travel, the article discusses the determinants of why states impose such restrictions","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/214933.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/28351\/1\/Visa%20restrictions%20and%20bilateral%20travel%28lsero%29.pdf","pdfHashValue":"23591a162ced9673a6854620f3ab536e2fb0d2be","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:28351<\/identifier><datestamp>\n      2017-05-04T09:36:07Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4759<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/28351\/<\/dc:relation><dc:title>\n        Visa restrictions and bilateral travel<\/dc:title><dc:creator>\n        Neumayer, Eric<\/dc:creator><dc:subject>\n        G Geography (General)<\/dc:subject><dc:description>\n        The vast majority of states impose visa restrictions on travelers from some foreign countries. Such restrictions are likely to deter foreign visitors from affected countries. They will therefore reduce the flow of tourists, businesspeople, and other travelers and thereby damage a country's tourism industry, reduce its trade, and affect its scientific, cultural, and other exchanges with foreign countries. This study estimates the damaging effect exerted by visa restrictions on bilateral travel in a country dyad data set covering the period from 1995 to 2005. It finds that, depending on the exact model specification chosen, visa restrictions reduce such travel by on average between 52 and 63 percent but with substantial regional variation. Given this large detrimental effect of visa restrictions on bilateral travel, the article discusses the determinants of why states impose such restrictions.<\/dc:description><dc:publisher>\n        Routledge<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/28351\/1\/Visa%20restrictions%20and%20bilateral%20travel%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Neumayer, Eric  (2010) Visa restrictions and bilateral travel.  Professional Geographer, 62 (2).  pp. 171-181.  ISSN 0033-0124     <\/dc:identifier><dc:relation>\n        http:\/\/www.informaworld.com\/smpp\/title~content=t788352615<\/dc:relation><dc:relation>\n        10.1080\/00330121003600835<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/28351\/","http:\/\/www.informaworld.com\/smpp\/title~content=t788352615","10.1080\/00330121003600835"],"year":2010,"topics":["G Geography (General)"],"subject":["Article","PeerReviewed"],"fullText":"  \nEric Neumayer  \nVisa restrictions and bilateral travel \n \nArticle (Accepted version) \n(Refereed) \n \n \nOriginal citation: \nNeumayer, Eric (2010) Visa restrictions and bilateral travel. Professional geographer, 62 (2). pp. \n171-181. ISSN 0033-0124  \nDOI: 10.1080\/00330121003600835 \n \n© 2010 Association of American Geographers \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/28351\/ \nAvailable in LSE Research Online: September 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \n \n1 \nVisa restrictions and bilateral travel \n \n \nPublished in: \nThe Professional Geographer, 62 (2), 2010, pp. 1-11 \n \n \n \n \n \n \n \n \nEric Neumayer \nLondon School of Economics and Political Science, Department of Geography and \nEnvironment, Houghton Street, London WC2A 2AE, UK and Centre for the Study of \nCivil War, International Peace Research Institute Oslo (PRIO), Norway. \nPhone: +44-207-9557598. Fax: +44-207-9557412. Email: e.neumayer@lse.ac.uk. \nWebsite: http:\/\/personal.lse.ac.uk\/neumayer \n2 \nAbstract \nThe vast majority of states impose visa restrictions on travellers from some foreign \ncountries. Such restrictions are likely to deter foreign visitors from affected countries. \nThey will therefore reduce the flow of tourists, businesspeople and other travellers \nand thereby damage a country’s tourism industry, reduce its trade as well as its \nscientific, cultural and other exchange with foreign countries. This study estimates the \ndamaging effect exerted by visa restrictions on bilateral travel in a country dyad \ndataset covering the period 1995 to 2005. It finds that, depending on the exact model \nspecification chosen, visa restrictions reduce such travel by on average between 52 \nand 63 per cent. \n \nKey words: visa, visitors, travellers, trade, tourism \n3 \nIntroduction \nSovereign nation-states postulate and exercise a right to control and restrict entry by \nforeign visitors into their domestic territory. Such controls and restrictions have \n“historically been viewed as inherent in the very nature of sovereignty” (Collinson \n1996, 77). As Sassen (1996, 1998) remarks, there is no right to enter foreign spaces \nanywhere in international law. Even the non-binding Universal Declaration of Human \nRights only postulates a right of exit and entry to one’s own country (article 13), not a \nright to enter foreign spaces. Two important mechanisms by which states exert their \nright are border controls and visa restrictions.  \nVisa restrictions represent an important hurdle to and deterrent against \nunwelcome visitors that is binding before visitors even arrive at one’s borders. First, \nthere is the additional cost and hassle of applying for the visa before travel either via \npost, which can take weeks or months, via employing a professional visa service \nprovider or in person, which implies travelling to the embassy or one of the few \nconsulates and often queuing, possibly for hours until served. Second, the issuing \nconsulate or embassy can of course, and sometimes does, deny the application without \ngiving any reason. As Torpey (1998, 252) has put it: “Passport and visa controls are \n(…) the ‘first line of defense’ against the entry of undesirables.” \nYet, visa restrictions are likely to deter both welcome and unwelcome travellers. \nThey will deter foreign businessmen and businesswomen as well as foreign tourists \nand other travellers to the detriment of the domestic economy – see Neumayer (2010) \nfor an analysis of the effect of visa restrictions on bilateral trade and foreign direct \ninvestment. Already the League of Nations in the inter-War period and, after World \nWar II, the Council of Europe reminded nation-states that visa restrictions inhibit \n4 \ninternational trade and tourism (Salter 2003). By imposing visa restrictions on foreign \ntravellers, countries are thus, in some sense, damaging themselves.1 \nGiven the potentially great economic damage that visa restrictions impose on the \ndomestic economy, it is perhaps surprising that this is the first study to analyze the \nextent to which visa restrictions actually reduce the flow of travellers.2 My findings \nsuggest that visa restrictions on average reduce the bilateral flow of travellers by \nbetween 52 and 63 percent, depending on model specification. The effect is bigger for \ntravel to and coming from developing countries than it is for developed country travel. \nThere are also regional differences across the developing world. The effect of visa \nrestrictions is thus substantially large, even if it is smaller than the effect of \ngeographical location and former colonial links, which are themselves highly \ncorrelated with visa restrictions, however. \nThis article complements Neumayer (2006) where country-specific variations in \nvisa restrictions are explained. In the current article, the effect of visa restrictions on \nbilateral travel is examined instead. Neumayer (2006) speculated that visa restrictions \nhave a large detrimental effect on bilateral travel, but could not test this hypothesis. \nThe empirical validation offered in this article adds to our understanding of the \ncomplex trade-off between providing travellers access for economic and other \n                                                 \n1\n The detrimental economic impacts have played a high-profile political role in the United States, \nwhere after 9\/11 the issuance of visas has been severely restricted. This has created much concern \namong business groups, research centres and universities of undue delay in granting visas and keeping \nout students, scientists and businessmen whose entry would be beneficial to US interests (Froelich \n2004; Bhattacharjee 2004). \n2\n One potential reason for this lack of existing studies is the work effort involved in inputting data on \nvisa restrictions for a global sample of nation-states. This article’s analysis can build on an earlier study \nof visa restrictions, for which I have coded these data already (Neumayer 2006). \n5 \nbenefits and denying travellers access for preventing illegal immigration and for \nperceived security reasons. \n \nResearch design \nThe estimation of the effect of visa restrictions on travel has to deal with an \nidentification problem due to potential omitted variable bias. If variables that both \nhave an influence on travel and are correlated with the explanatory variables of the \nestimation model are omitted from the specification, then this will cause omitted \nvariable bias (OVB). In principle the bias can go both ways, but there are good \nreasons to presume that OVB will bias the estimated coefficients of the variable(s) of \ninterest upwards (Baldwin and Taglioni 2006). Travel costs, for example, will impact \ntravel, but are impossible to measure correctly. Baldwin and Taglioni (2006) therefore \nsuggest including dyad fixed effects as well as time-varying nation fixed effects in the \nestimation model to deal with the identification problem. However, because my visa \nrestrictions variable is time-invariant, dyad fixed effects cannot be included in the \nestimations. This would hold true even if one collected data on visa restrictions for \nother years, which is very time-consuming. The reason is that there will be little \nwithin-variation (variation over time) and practically all of the variation of the visa \nrestriction variable will be dominated by between-variation (variation across dyads).3 \nGiven dyad fixed effects are impossible, I try to reduce OVB as much as possible by \nincluding, where possible, year-specific nation dummies and dyadic explanatory \nvariables that could be correlated with visa restrictions. This cannot solve the \nidentification problem, but it reduces it as much as possible. \n                                                 \n3\n Technically, dyad fixed effects could be included in this case, but with hardly any within-variation in \nthe visa restrictions variable, no valid coefficient can be estimated in such a model. \n6 \nIn the base model, I estimate the following model of travel demand for the period \n1995 to 2005, which is a log-linearized version of a gravity-type model: \n \nyijt = α + β1Vij + β2xit + β3xjt + β4xij + γt*ui + γt*vj + εijt ,.  \n \nThe subscript i represents the destination country, the subscript j represents the \nforeign source country and t stands for time, measured in years since I have annual \ndata. y is a suitable variable of travel demand. It is determined by visa restrictions \nbetween country i and country j (Vij). This variable is in principle time-variant, but I \nhave data only for one year, which is taken over for the other years (see the discussion \non the measurement error this introduces below). Travel demand is further determined \nby xit, that is by time-varying conditions in the destination country, xjt, i.e. time-\nvarying conditions in the foreign source country, as well as xij, i.e. links between the \ntwo countries, which could in principle be time-varying as well, but are constant over \ntime in my actual research design. The year-specific destination fixed effects γt*ui and \nyear-specific source country fixed effects γt*vj capture both any destination and source \ncountry-specific effects that do not change over time, such as the general \nattractiveness of a destination for tourists (weather, beaches, cultural and historical \nattractions etc.) and the general propensity of individuals from source countries to \ntravel, as well as time-varying effects specific to destination or source countries, such \nas market attractiveness, foreign investment climate, business cycles etc. \nI employ standard errors that are clustered on country dyads, i.e. observations are \nmerely assumed to be independent across country dyads, but not necessarily within \ndyads. Since annual observations within the same dyads cannot be independent from \neach other, failure to do so would lead to a large under-estimation of standard errors. \n7 \n \nThe dependent variable \nTravel demand can be measured by number of visitors or by receipts from such travel. \nUnfortunately, neither can capture the wider economic benefits generated to a country \nby incoming visitors. Receipts measure the more direct economic benefits somewhat \ncloser than the number of visitors, but no bilateral data on receipts exist, which is why \nI use data on bilateral visitor numbers instead, for which data are available. Note, \nhowever, that at the aggregate national level the number of visitors and receipts are \nvery highly correlated with each other (Neumayer 2004).  \nData for visitor arrivals are taken from WTO (2007) and cover the period 1995 to \n2005. For the ordinary least squares (OLS) estimations the natural log of the \ndependent variable is taken in order to render its distribution less skewed. This also \nallows an easy interpretation of estimated coefficients as elasticities. As will be \nexplained further below, some estimations employ a Poisson count data estimator \ninstead, for which the dependent variable is the number of travelers in levels, i.e. not \nlogged. The sample consists of all countries for which data are available. In a \nrobustness check, I ran the same models for a sample consisting of developing \ncountries only. The results reported further below are similar. \n \nThe explanatory variables \nInformation on the main explanatory variable, bilateral visa restrictions, is taken from \nthe November 2004 edition of the International Civil Aviation Association’s Travel \nInformation Manual (IATA 2004). Used by the vast majority of airlines and travel \nbureaus, this manual provides authoritative information on restrictions in place. \nIdeally, one would like to trace changes in restrictions over time, but with \n8 \napproximately 36,300 relevant country pairs (dyads) doing so would be prohibitively \ncostly in terms of effort (it took several months to input the existing data).4 Given that \nthe panel covers the years 1995 to 2005, there is therefore some measurement error in \nthe visa restrictions variable as a few countries will have changed some of their visa \nrestrictions during this time period. However, this measurement error is small because \nthe number of changes to visa restrictions is likely to be very small compared to the \ntotal number of restrictions in place. The cost of measurement error may be \noutweighed by the benefit of being able to use a panel dataset, which allows the \ninclusion of year-specific destination and source country fixed effects. However, I \nalso report results from a cross-sectional analysis from the year 2004 only, which \nleads to an estimated elasticity for the visa restrictions variable that is close to the one \nderived from the panel model. \nThere are two types of visa restrictions. One is the usual or common type that \nneeds to be applied for before travelling. The other, less common, type of visa can be \napplied for upon arrival at the border. This latter type of visa typically does not \nrepresent any restriction at all since the procedure of getting it is extremely simple and \ndoes not involve any major check on the applicant. In fact, it is fair to say that its main \npurpose is to generate further revenue for the destination country rather than deterring \nforeign travellers from the countries facing such visa restrictions, even if the \nadditional cost may of course deter some. Egypt is a good example. Passport holders \nfrom OECD and other major tourist sending countries need a visa, but can obtain one \nat the border for a fee of US$15 without complication. With an estimated number of \narrivals in 2006 of around 8.6 million people, this might have generated an additional \nrevenue to the country of up to US$129 million. Since visas that can be applied for at \n                                                 \n4\n Due to lack of data for the explanatory variables not all dyads enter the sample. \n9 \nthe border are very different from visas that need to be applied for in advance and \nbefore travelling, I will count only the latter as visa restrictions in the estimations. \nSimilarly, countries on a so-called “visa waiver program”, with which the United \nStates exempts travellers from selected countries from the need to obtain a prior visa \nare deemed free of visa restrictions, even though the United States has recently \nintroduced a kind of intermediate regime by requiring visitors from visa waiver \nprogram countries to apply for so-called Electronic Travel Authorization before the \nstart of travel. \nVisa restrictions are a fairly common phenomenon. 66 percent of country dyads \nimpose such restrictions, but the large standard deviation of 48 percent demonstrates \nthat there is a lot of variation in the data. There is a good deal of reciprocity: around \n68 percent of country dyads either impose visa restrictions on each other or are \nmutually free of such restrictions. Western developed countries impose restrictions on \ntravellers from many more developing countries than their citizens face when \ntravelling to the developing world. The average Western citizen needs a visa for \ntravelling to around 93 foreign countries, whereas the average developing country \ncitizen can enter 156 foreign countries only with a visa. In addition to economic \nconsiderations, visa restrictions are often driven by geostrategic reasons. Countries \noften allow visa-free travel for visitors from neighbouring countries or countries from \nthe same region, unless they are on unfriendly terms with the foreign government. \nWhereas there is a roughly 69 percent chance that a dyad located in different regions \nhas a visa restriction in place, this likelihood decreases to 49 percent if the two \ncountries are from the same region. \nIn sum, the international system of visa restrictions provides highly unequal \naccess to foreign spaces. Facilitating the mobility of some is achieved at the expense \n10 \nof inhibiting and deterring mobility of others. By and large, citizens from rich and \ngeographically or culturally close countries are far less likely to be subjected to visa \nrestrictions than others. Maps 1 and 2 demonstrate the geographical unevenness in the \ntotal number of visa restrictions a country imposes on foreign travellers and in the \ntotal number of restrictions its nationals face when travelling abroad. Clearly, while \nsuch aggregated information does not do justice to the complexity and variety of \nbilateral relationships between countries, the maps clearly demonstrate that access to \nforeign spaces is very unequal (Neumayer 2006). I discuss reasons for the variation in \nthe system of visa restrictions in more detail after the section that presents the \nestimation results. \n \n< Insert maps 1 and 2 around here > \n \nRecall from the estimating equation that in addition to the visa restriction \nvariable, there are destination- and source-specific time-varying variables as well as \ntime-invariant variables that measure the link between the two countries. As \ndestination- and source-specific variables I include the natural logs of population size \nand per capita income as well as a measure of democracy in both countries. The idea \nis that larger and richer countries are more attractive destination countries and \ngenerate more travelers as source countries. Democracies tend to impose fewer, if \nany, restrictions on travel abroad and fewer restrictions on travellers from abroad. \nData on income and population are taken from World Bank (2007), data on \ndemocracy from the Polity IV project (Marshall, Jaggers, and Gurr 2008). Political \nviolence in destination countries is a deterrent to travelers (Neumayer 2004). I \n11 \ntherefore employ a variable that measures the intensity of armed conflict in a country, \nwith data taken from Gleditsch et al. (2002). \nAs variables measuring links between two countries, I use the natural log of the \ngeographical distance between the capital cities, a dummy variable for when the two \ncountries are located in the same geographical region and, finally, a dummy variable \nfor the existence of a former colonial link. Data on distance are taken from Bennett \nand Stam (2008), geographical classification largely follows the World Bank’s (2007) \ngrouping of countries.5 The colonial ties dummy variable is taken from Neumayer \n(2003) and complemented to include Russia in this definition since its imposition of \npolitical and military control over ex-Soviet territories was analogous to that \nexercised by the classic Western and Japanese colonisers. \n \nRegression results \nTable 1 contains the estimation results. Column 1 reports the base model, which will \nbe compared to various extensions and modifications. Addressing the control \nvariables first, the estimated elasticities for per capita income in destination and \nsource countries suggest that bilateral travel increases by around 11.5 and 6.4 percent \nfor a ten percent increase in respective per capita incomes. In other words, bilateral \ntravel is a normal good (income elasticity above zero), as one would expect. The \nestimated elasticity for population size in the source country suggests that a ten \npercent higher population size increases travel by 5.9 percent. The elasticity of \npopulation size in the destination country is somewhat smaller at 5 percent. \n \n                                                 \n5\n The major difference is that the United States and Canada do not constitute their own region, but are \npart of Northern and Central America, while South America forms a group of its own. \n12 \n< Insert table 1 around here > \n \nGeographical distance deters bilateral travel: for every 10 percent increase in \ndistance between the two countries, bilateral travel falls by 5.2 percent. Dyads in \nwhich the destination and source country belong to the same geographical region on \naverage receive a travel flow that is 492 per cent higher than dyads in which the two \ncountries belong to different regions.6 Together, the distance and regional belonging \nvariable demonstrate a very strong effect of geographical location on bilateral travel. \nA former colonial link between the destination- and source-country also has a strong \nimpact on bilateral travel, increasing it on average by 505 per cent. A more \ndemocratic regime in either source or destination country or armed conflict in the \ndestination country do not impact on bilateral travel in this model specification. \nTurning now to the main variable of interest, visa restrictions, the estimated \ncoefficient suggests that the existence of a visa requirement reduces the bilateral flow \nof visitors by roughly 60 per cent. While a substantively large effect, it may seem \nsmall in comparison to the geographical and colonial link variables. However, one \nneeds to keep in mind that these variables are strongly correlated with each other. The \nlikelihood of a visa restriction in place is much lower for geographically close dyads, \ndyads with countries in the same geographical region and dyads in which there is a \nformer colonial link (Neumayer 2006). \nIn column 2 I estimate the model for the year 2004 only to avoid the \nmeasurement error from using the visa restrictions variable, which was derived from \n                                                 \n6\n These and similar estimated elasticities take into account the necessary correction for the \ninterpretation of estimated dummy variable coefficients in semilogarithmic equations (see Kennedy \n1981). \n13 \ndata of 2004 only, for the entire time period of the panel. At 63 percent, the estimated \neffect of visa restrictions is almost identical to the one derived from the fixed effect \npanel model. In column 3, I include destination and source specific fixed effects into \nthis model, which means that all the xi and xj variables are dropped from the \nestimation. The effect of visa restrictions is estimated at 62 percent, i.e. almost \nidentical. \nSantos Silva and Tenreyro (2006) argue that the interpretation of estimated \ncoefficients as elasticities in OLS log-linearized models can be highly misleading in \nthe presence of heteroskedasticity. They suggest estimating the model in levels (i.e., \nnot log-linearized) instead and using a Poisson estimator with clustered standard \nerrors. Results are reported in column 4 for the panel and in columns 5 and 6 for the \nyear 2004 only, respectively. Note that the model in column 4 cannot include year-\nspecific nation dummies as was the case in column 1, as the model failed to converge. \nInstead, it includes time-invariant dummy variables for destination and source \ncountries as well as year-specific time dummies. The estimated coefficients suggest \nthat the expected number of visitors goes down by 56.4, 52 and 59.4 percent, \nrespectively, which represents slightly lower elasticities than in the log-linearized \nmodel. \nDoes the effect of visa restrictions differ across groups of countries? To test for \nthis, I have interacted the visa restrictions variable with various dummy variables for \ncountry groups and have re-estimated model 1 (detailed results not reported, but \navailable upon request). See table 2, which summarizes the results together with some \ndescriptive information on actual travel flows in 2005. To start with, visa restrictions \nhave a more damaging effect on bilateral travel to developing than to developed \ncountries. Whereas such restrictions reduce bilateral travel by approximately 37 \n14 \npercent to developed countries, the effect is much stronger at 64 percent in travel to \ndeveloping countries. The likely reason is that, on average, travel to developed \ncountries is more beneficial for potential visitors than travel to developing countries \nsuch that fewer of them are deterred from travelling by the existence of visa \nrestrictions. Among the developed countries, travel to the high-income East Asian and \nPacific countries (Japan, Australia, New Zealand) is more strongly affected at minus \n61 percent than travel to high-income North America (Canada and United States) at \nminus 31 percent, whereas travel to Western Europe is not affected in a statistically \nsignificant way. Among the developing countries, visa restrictions have the largest \neffect on travel to countries in Eastern Europe and Central Asia (minus 77 percent), \nfollowed by Latin America and the Caribbean (minus 68 percent), Sub-Saharan Africa \n(minus 63 percent), Middle East and Northern Africa (minus 51 percent) as well as \nlow-income Eastern Asia and the Pacific (minus 25 percent). The effect on travel to \nSouth Asian countries is statistically insignificant, but there are only three countries in \nthis region so the respective coefficient is likely to be estimated unreliably. \nTesting conversely for differential effects of visa restrictions on visitors coming \nfrom certain groups of countries, I find again that such restrictions have a stronger \neffect on visitors from developing (minus 66 percent) than developed countries \n(minus 36 percent). The reason is most likely that individuals in developed countries \nfind it easier to obtain a visa and are better able to pay for the direct and indirect costs. \nAmong the developed countries, it is again travel from the high-income East Asian \nand Pacific countries which is most strongly affected (minus 58 percent), followed by \ntravel from Western Europe (minus 26 percent), whereas travel from North America \nis not statistically significantly affected. Among the various regions of the developing \nworld, visa restrictions have the strongest negative effect on travel from Latin \n15 \nAmerica and the Caribbean (minus 76 percent), followed by Sub-Saharan Africa \n(minus 66 percent), Northern Africa and the Middle East (minus 52 percent), Eastern \nEurope and Central Asia (minus 45 percent), and South Asia (minus 29 percent).  \n \nWhy restrict the number of travellers via visa restrictions? \nThe results reported above suggest that visa restrictions have a large negative effect \non the flow of travellers between two countries. Most policy makers now subscribe to \nthe view that international trade, foreign investment, tourism, scientific, business and \nother contacts are desirable for mainly economic reasons. So, the question arises, why \ndo states impose visa restrictions if these are economically damaging? The reason is \nthat every state faces the dilemma between facilitating the cross-border flow of people \nfor its own economic and political benefit on the one hand and monitoring, controlling \nand limiting that same flow for its perceived security interest as well as preventing \nillegal immigration on the other hand.  \nWhat differs across countries is the relative weight they put on the two aspects of \nthe trade-off. Visa restrictions provide a crude, but powerful mechanism to manage \nthis trade-off. They fulfil the double role of pre-selection and deterrence: Those who \ndo not need a visa are regarded as welcome and low-risk visitors by default, those \nwho need a visa and have been approved by the country’s consulate or embassy \nabroad are regarded as not unwelcome and not representing a great risk upon closer \ninspection, whereas those who need a visa and do not have one or have been denied a \nvisa are unwelcome. To be sure, even if no visa is needed or a visa has been attained, \nthe final decision of whether one can enter a foreign space is made at the border itself \nand there is always the risk that border control will deny entry even if one is in \npossession of a valid visa. However, in practice this risk is rather small, which is why \n16 \nthe pre-selection role of the system of visa restrictions is so important.7 Not so much \npassports as such, as Salter (2003, 2) seems to suggest, but the visa restrictions \nimposed on passport holders from certain countries are one of the most important \nmechanisms, with which nation states exert their prerogative to control entry into their \nterritory. \nThose countries more concerned about security will impose more restrictions. \nOne obvious concern is that visitors might turn into immigrants by staying on \n(illegally) in the country instead of returning back home. Illegal entry is only one way \ninto illegal immigration. Gaining legal access, but then overstaying the allowed period \nof leave is another and quite important one.8 Western developed countries are \n                                                 \n7\n This importance is further heightened by the fact that it might not be possible to send people whose \nentry is rejected back to their home country. True, in principle the passport ‘provides an assurance for \nthe State of transit or destination that the bearer can return to the State which issued the passport’ \n(ICAO 2004, 13). In other words, in principle the passport guarantees that those denied access can be \nsent back to the issuing country. However, there have been many cases where individuals have \ndestroyed their passports or countries have refused to take their nationals back. It is exactly for this \nreason that many countries require airlines not to let anyone enter the aircraft who is not in the \npossession of a valid visa (if required to do so). Otherwise the dual purpose of visa restrictions, pre-\nselection and deterrence, would be defeated. Increasingly, sanctions are applied to sea and ground \ntransport companies as well (UN 2002). \n8\n Just how important is difficult to say. Bigo (1998, 152) reports from discussions with French \nSchengen Officials and the Central Directorate for the repression of illegal immigration and \nemployment that only 20% of illegal immigrants crossed the border illegally, whereas the vast majority \nentered the country perfectly legally, but then overstayed the allowed period of time. Andreas (1998, \n607) and Koslowski (2005, 5) report a higher share of individuals crossing the border illegally for the \nUnited States (50 to 60% and 60 to 70%, respectively) despite the increasing militarisation of the U.S.-\nMexican border (Nevins 2002). But even so an estimated 150,000 people each year overstay their visa \nwith the intention of settlement. \n17 \nattractive destinations for illegal immigrants who often come from poor developing \ncountries, which explains why Western countries usually have restrictive visa policies \nin place with respect to travellers from developing countries. Besides immigration, \nanother big concern to many states is the infiltration by potential terrorists, drug \ntraffickers, political activists and other persona non grata. Visa restrictions represent \nan important mechanism to counter threats to regime stability by politically \nundesirable individuals and threats to national security by politically motivated \nviolence. Autocratic regimes are suspicious that foreign influence might undermine \nthe regime’s foundations and are therefore eager to control who enters the country. \nThe more autocratic and repressive a regime is, the more it is threatened by open \nborders (Anderson 2000). It is therefore not surprising that some of the most \nautocratic countries in the world (e.g. China, Myanmar and Northern Korea) impose \nvisa restrictions on travellers from almost every other country in the world. \nIn contrast, those governments more concerned about the detrimental economic \nand other impacts of visa restrictions will impose fewer visa restrictions. For example, \ncountries which are heavily dependent on trade need to provide easy access to foreign \nvisitors in order to facilitate the international exchange of goods and services. Major \ntourist destinations have an incentive not to impose visa restrictions on sending \ncountries in order to remain attractive in the increasingly competitive market for mass \ntourism. O’Byrne (2001) argues that the relaxation of visa requirements in many \ncountries can be explained as a direct response to the demands by the tourism industry \nto whom ‘freedom of travel is freedom to trade’ (emphasis in original). Hence, it is \nagain not surprising that some of the most tourism-dependent countries in the world \n(e.g., Barbados, Kenya, Maldives, Seychelles, Tanzania) as well as some of the most \n18 \ntrade-dependent countries and country-like entities (e.g., Hong Kong, Malaysia, \nSingapore) impose very few, if any, visa restrictions on travellers. \nDoes this mean that the estimations reported above suffer from endogeneity bias, \nwhich would follow if the explanatory variables like visa restrictions were correlated \nwith the error term? Not necessarily. The destination and source country fixed effects \nincluded in the estimations capture, among other things, the general trade and tourism \nopenness (dependence) of countries. They certainly reduce potential correlation of the \nkey explanatory variable visa restrictions with the error term, even if they perhaps \ncannot eliminate it entirely. That explanatory variables are correlated with each other \n(rather than with the error term) is not a problem for the estimations, however. It \nsimply changes the interpretation of the estimated coefficient, which then has to be \nseen as estimating the effect of visa restrictions conditional on the other explanatory \nvariables, including the fixed effects, being included in the estimation model. \n \nConclusion \nIn this article, I have estimated the effect of visa restrictions on bilateral travel. The \nresults show that bilateral travel is significantly and substantively affected by such \nrestrictions. It is estimated to be reduced by between 52 and 63 percent on average. I \nhave also shown that travel to and from developing countries suffers more from the \nimposition of visa restrictions and that there are also regional differences across the \ndeveloping world. These estimated effects need to be treated with some caution due to \nthe identification problem (potential omitted variable bias), which I tried to mitigate \nthrough careful model specification, but could not solve completely. Moreover, the \ndata are not dis-aggregated so I cannot distinguish between different types of travel. \nHowever, while visa restrictions may not affect all types equally, they will dampen all \n19 \ntravel. There will be less trade, fewer tourists, less scientific, cultural and other \nexchange. In other words, countries imposing visa restrictions on foreign travellers \npay a price for doing so. \nImposing visa restrictions need not be irrational, however. Governments will \nbalance the economic or other benefits of allowing foreign travellers access to their \ncountry’s domestic space against the security and other concerns foreign visitors \ngenerate. As pointed out above, the system of visa restrictions varies in predictable \nways. More trade and tourism dependent countries impose fewer restrictions, richer \ncountries fearful of illegal immigration and more autocratic countries impose more \nrestrictions.  \nYet, visa restrictions have a substantively large damaging effect on bilateral \ntravel and policy makers would be well advised to consider whether the large benefits \nof lifting visa restrictions would outweigh any security or other concerns they may \nhave. Visa restrictions are strangely at odds with a world that is becoming more and \nmore inter-connected via myriad links and in which economic and other gains \nincreasingly depend on international exchange and mobility. However, human \ngeographers and other social scientists have long since noted how increases in \n“globalization” do not necessarily mean increases in the cross-border flow of human \nbeings (Collinson 1996; Andreas and Snyder 2000; Nevins 2002; Cunningham 2004). \nNation-states have proven far keener to bring down barriers to telecommunication, \ntrade and, if less so, capital flows than they have been keen to remove barriers to the \ncross-border movement of people. \n20 \nReferences \nAnderson, M. 2000. The transformation of border controls: A European precedent? In \nThe wall around the West – state borders and immigration controls in North \nAmerica and Europe, eds. P. Andreas and T. Snyder, 15-29. Lanham: Littlefield. \nAndreas, P. 1998. The escalation of U.S. immigration control in the post-NAFTA era. \nPolitical Science Quarterly 113: 591-615. \nAndreas, P., and T. Snyder (eds.). 2000. The wall around the West – state borders and \nimmigration controls in North America and Europe. Lanham: Rowman & \nLittlefield. \nBaldwin, Richard and Daria Taglioni. 2006. Gravity for Dummies and Dummies for \nGravity Equations. Working Paper 12516. Cambridge, MA: National Bureau of \nEconomic Research. \nBennett, D. S. and A. C. Stam. 2008. EUGene. http:\/\/www.eugenesoftware.org\/ (last \naccessed 2 October 2008). \nBhattacharjee, Y. 2004. U.S. immigration: groups urge easing of restrictions on visa \npolicies affecting scientists. Science 304: 943. \nBigo, D. 1998. Frontiers and security in the European Union: The illusion of \nmigration control. In The frontiers of Europe, eds. M. Anderson and E. Bort, 148-\n164. London and Washington, D.C.: Pinter. \nCollinson, S. 1996. Visa requirements, carrier sanctions, ‘safe third countries’ and \n‘readmission’: the development of an asylum ‘buffer zone’ in Europe. \nTransactions of the Institute of British Geographers 21: 76-90. \nCunningham, H. 2004. Nations rebound?: crossing borders in a gated globe. \nIdentities: Global Studies in Culture and Power 11: 329-350. \n21 \nFroelich, A. 2004. US visa delays: keeping scientists from where they want to be? \nBioScience 54: 296. \nGleditsch, N. P., P. Wallensteen, M. Eriksson, M. Sollenberg, and H. Strand. 2002. \nArmed Conflict 1946–2001: A New Dataset. Journal of Peace Research 39:615-\n37. \nIATA. 2004. Travel information manual. Badhoevedorp: International Air Transport \nAssociation. \nICAO. 2004. Updating of the consolidated statement of continuing ICAO policies in \nthe air transport field A35-WP\/44. Montreal: International Civil Aviation \nOrganization. \nKennedy, P. E. 1981. Estimation with correctly interpreted dummy variables in \nsemilogarithmic equations. American Economic Review 71: 801. \nKoslowski, R. 2005. Real challenges for virtual borders: the implementation of US-\nVISIT. Washington, DC: Migration Policy Institute. \nMarshall, M. G., K. Jaggers, and T. R. Gurr. 2008. Polity IV Project. \nhttp:\/\/www.systemicpeace.org\/polity\/polity4.htm (last accessed 2 October 2008). \nNeumayer, E. 2003. The Pattern of Aid Giving – The Impact of Good Governance on \nDevelopment Assistance. London: Routledge. \n———. 2004. The Impact of Violence on Tourism – Dynamic Econometric \nEstimation in a Cross-National Panel. Journal of Conflict Resolution 48 (2): 259-\n281. \n———. 2006. Unequal Access to Foreign Spaces: How States Use Visa Restrictions \nto Regulate Mobility in a Globalised World. Transactions of the British Institute \nof Geographers 31: 72-84. \n22 \n———. 2010. On the Detrimental Impact of Visa Restrictions on Bilateral Trade and \nForeign Direct Investment. Working Paper. London School of Economics: \nDepartment of Geography and Environment. \nhttp:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=1470717 \nNevins, J. 2002. Operation gatekeeper. New York and London: Routledge. \nO’Byrne, D. J. 2001. On passports and border controls. Annals of Tourism Research \n28: 399-416. \nSalter, M. B. 2003. Rights of passage – the passport in international relations. \nBoulder and London: Lynne Riener. \nSantos Silva, J. M. C., and S. Tenreyro. 2006. The log of gravity. Review of \nEconomics and Statistics 88: 641-658. \nSassen, S. 1996. Losing control? Sovereignty in an age of globalisation. New York: \nColumbia University Press. \n———. 1998. Globalisation and its discontents. New York: New Press. \nTorpey, J. 1998. Coming and going: on the state monopolization of the legitimate \n‘means of movement’. Sociological Theory 16:239-259. \nUN. 2002. International migration report. New York: United Nations. \nWorld Bank 2007. World Development Indicators on CD-Rom. Washington, D.C.: \nWorld Bank. \nWTO. 2007. Statistical information on CD-Rom. Madrid: World Tourism \nOrganization. \n \n23 \nTable 1. Estimation results. \n (1) (2) (3) (4) (5) (6) \n ln visitors ln visitors ln visitors visitors visitors visitors \nVisa restrictions -0.923** -0.997** -0.968** -0.822** -0.723** -0.902** \n (0.0469) (0.0500) (0.0447) (0.127) (0.160) (0.122) \nln GDP pc (destination country) 1.151** 0.752**  0.486* 0.368**  \n (0.148) (0.0157)  (0.207) (0.0504)  \nln Population (destination country) 0.504** 0.788**  1.720** 0.479**  \n (0.128) (0.0145)  (0.546) (0.0386)  \nDemocracy (destination country) 0.0407 -0.00489  0.00721 0.0213  \n (0.0241) (0.00391)  (0.00903) (0.0154)  \nArmed conflict (destination country) 0.0852 -0.0558*  -0.0364* -0.139**  \n (0.0888) (0.0228)  (0.0155) (0.0522)  \nln GDP pc (foreign source country) 0.640** 0.863**  0.964** 0.480**  \n (0.0967) (0.0157)  (0.292) (0.0666)  \nln Population (foreign source country) 0.587** 0.778**  0.636 0.444**  \n (0.131) (0.0134)  (0.392) (0.0396)  \nDemocracy (foreign source country) -0.0166 0.0257**  -0.00352 0.00933  \n (0.0180) (0.00432)  (0.0108) (0.0169)  \nln Distance  -0.515 -0.576** -0.533** -0.348** -0.309** -0.331** \n (0.0141) (0.0152) (0.0135) (0.0203) (0.0412) (0.0187) \nColonial link 1.811** 1.834** 1.520** 0.619** 1.061** 0.637** \n (0.216) (0.266) (0.235) (0.227) (0.263) (0.229) \nSame region 1.780** 1.787** 1.737** 0.756** 0.747* 0.900** \n (0.0522) (0.0592) (0.0490) (0.173) (0.360) (0.159) \nConstant -21.34** -27.22** 9.617** -35.24* -9.767** 10.56** \n (3.672) (0.375) (0.279) (12.10) (1.265) (0.721) \nObservations 95117 8222 10870 95205 8230 10879 \nR-squared 0.84 0.73 0.83 0.89 0.72 0.89 \nEstimator OLS OLS OLS Poisson Poisson Poisson \nYear-specific nation dummies Yes No No No No No \nNation dummies No No Yes Yes No Yes \nTime dummies No No No Yes No No \nTime period 1995-2005 2004 2004 1995-2005 2004 2004 \n \n \nNote: Standard errors clustered on country dyads. Standard errors in parentheses. \n* statistically significant at .05 level  ** at .01 level. \n24 \nTable 2. Estimated effects of visa restrictions on travel to and from regions. \n Travel to: Travel from: \n Million visitors in \n2005  \n% impact of visa \nrestrictions \nMillion visitors \nin 2005 \n% impact of visa \nrestrictions \nDeveloped countries: 436 -37 555 -36 \n   East Asia and Pacific (high-income) 13 -61 30 -58 \n   North America 84 -31 107 n.s. \n   Western Europe 339 n.s. 418 -26 \n     \nDeveloping countries: 523 -64 404 -66 \n   Eastern Europe and Central Asia 219 -77 160 -45 \n   East Asia and Pacific (low-income) 169 -25 148 -51 \n   Latin America and the Caribbean 51 -68 34 -76 \n   Northern Africa and Middle East 56 -51 36 -52 \n   South Asia 6 n.s. 9 -29 \n   Sub-Saharan Africa 22 -63 17 -66 \n \nNote: n.s.: not significant. Source: WTO (2007) and own estimations. \n25 \n \n \n \nMap 1. Visa restrictions imposed by country on nationals of other countries (darker colours mean more restrictions). \n26 \n \n \n \nMap 2. Visa restrictions faced by nationals of country travelling to other countries (darker colours mean more restrictions). \n \n \n \n"}