{"doi":"10.1103\/PhysRevB.77.115348","coreId":"71214","oai":"oai:eprints.lancs.ac.uk:4656","identifiers":["oai:eprints.lancs.ac.uk:4656","10.1103\/PhysRevB.77.115348"],"title":"Temperature dependence of the photoluminescence of self-assembled InAs\/GaAs quantum dots in pulsed magnetic fields.","authors":["Nuytten, Thomas","Hayne, Manus","Henini, Mohamed","Moshchalkov, Victor V."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-03-25","abstract":"We have studied the magnetic field (< 50 T) dependence of the photoluminescence (PL) of self-assembled InAs\/GaAs quantum dots as a function of temperature (T). As the temperature is raised from 4.2 up to 80 K thermal redistribution causes the PL to be increasingly dominated by dots with a lower PL energy. Magneto-PL demonstrates that these low energy dots are larger in size only in the growth direction, and not in the plane of the sample. At high temperatures (T > 100 K) a different physical phenomenon emerges: we see an anomalous decrease of the PL shift in magnetic field, which is attributed to field-enhancement of the quantum dot barrier potential. This mechanism strongly favors excitons in small dots with a weak PL shift in magnetic field, hence laterally smaller dots increasingly dominate the PL at high temperatures and high fields","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71214.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/4656\/4\/Nuytten_PRB_77_115348_2008_.pdf","pdfHashValue":"b18c048f20deb9032da61ed0b3664b15b21e6bbf","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:4656<\/identifier><datestamp>\n      2018-01-24T03:13:12Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Temperature dependence of the photoluminescence of self-assembled InAs\/GaAs quantum dots in pulsed magnetic fields.<\/dc:title><dc:creator>\n        Nuytten, Thomas<\/dc:creator><dc:creator>\n        Hayne, Manus<\/dc:creator><dc:creator>\n        Henini, Mohamed<\/dc:creator><dc:creator>\n        Moshchalkov, Victor V.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        We have studied the magnetic field (< 50 T) dependence of the photoluminescence (PL) of self-assembled InAs\/GaAs quantum dots as a function of temperature (T). As the temperature is raised from 4.2 up to 80 K thermal redistribution causes the PL to be increasingly dominated by dots with a lower PL energy. Magneto-PL demonstrates that these low energy dots are larger in size only in the growth direction, and not in the plane of the sample. At high temperatures (T > 100 K) a different physical phenomenon emerges: we see an anomalous decrease of the PL shift in magnetic field, which is attributed to field-enhancement of the quantum dot barrier potential. This mechanism strongly favors excitons in small dots with a weak PL shift in magnetic field, hence laterally smaller dots increasingly dominate the PL at high temperatures and high fields.<\/dc:description><dc:date>\n        2008-03-25<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/4656\/4\/Nuytten_PRB_77_115348_2008_.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevB.77.115348<\/dc:relation><dc:identifier>\n        Nuytten, Thomas and Hayne, Manus and Henini, Mohamed and Moshchalkov, Victor V. (2008) Temperature dependence of the photoluminescence of self-assembled InAs\/GaAs quantum dots in pulsed magnetic fields. Physical Review B, 77. p. 115348. ISSN 1550-235X<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/4656\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1103\/PhysRevB.77.115348","http:\/\/eprints.lancs.ac.uk\/4656\/"],"year":2008,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"  1 \nTemperature dependence of the photoluminescence of self-\nassembled InAs\/GaAs quantum dots in pulsed magnetic fields \n \nT. Nuytten \nINPAC-Institute for Nanoscale Physics and Chemistry, Pulsed Fields Group, K.U. Leuven, \nCelestijnenlaan 200D, B-3001 Leuven, Belgium \nM. Hayne \nDepartment of Physics, Lancaster University, Lancaster LA1 4YB, United Kingdom and \nINPAC-Institute for Nanoscale Physics and Chemistry, Pulsed Fields Group, K.U. Leuven, \nCelestijnenlaan 200D, B-3001 Leuven, Belgium \nM. Henini \nSchool of Physics and Astronomy, University of Nottingham, Nottingham NG7 2RD, United \nKingdom \nV.V. Moshchalkov \nINPAC-Institute for Nanoscale Physics and Chemistry, K.U. Leuven, Celestijnenlaan 200D, \nB-3001 Leuven, Belgium \n \nWe have studied the magnetic field (< 50 T) dependence of the photoluminescence (PL) of \nself-assembled InAs\/GaAs quantum dots as a function of temperature (T). As the temperature \nis raised from 4.2 up to 80 K thermal redistribution causes the PL to be increasingly \ndominated by dots with a lower PL energy. Magneto-PL demonstrates that these low energy \ndots are larger in size only in the growth direction, and not in the plane of the sample. At high \ntemperatures (T > 100 K) a different physical phenomenon emerges: we see an anomalous \ndecrease of the PL shift in magnetic field, which is attributed to field-enhancement of the \nquantum dot barrier potential. This mechanism strongly favors excitons in small dots with a \n  2 \nweak PL shift in magnetic field, hence laterally smaller dots increasingly dominate the PL at \nhigh temperatures and high fields. \n \nI. INTRODUCTION \n \nSelf-assembled quantum dot (QD) semiconductor nanostructures are currently attracting \nsubstantial interest due to their high potential for novel opto-electronic devices.1-3 The \nadvantages of QD-based devices originate largely from the spatial confinement of the carriers \nin all three dimensions, resulting in discrete atom-like energy levels.4 For devices like lasers, \nthe occupancy of these energy levels is ideally temperature independent for T ≤ 300 K, but \nsuch ideal behavior is not observed in practice. Hence, a thorough understanding of the effect \nof temperature is essential for device fabrication. Here we show that the application of a very \nlarge magnetic field can give important new insight into this problem. Although the \napplication of a magnetic field has proven to be a very powerful tool for studying the optical \nand electronic properties of semiconductor materials,5 the magneto-optical study of self-\nassembled QDs requires the application of very strong magnetic fields, of the order of tens of \ntesla, in order to provide anything more than a small perturbation to the orbital motion of \nstrongly confined carriers.  \nIn this work, we report non-resonant photoluminescence studies of InAs\/GaAs QDs as a \nfunction of temperature and magnetic field. In order to investigate some key properties that \ngovern its electronic behavior, such as the exciton wave-function extent and effective mass, \nwe use very high pulsed magnetic fields of up to 50 T to probe the PL of the QD sample in \nthe temperature range between liquid helium temperature and 160 K. The data is then \nanalyzed via a simple model enabling us to extract information about the exciton wave-\nfunction. Our data clearly indicate a distinction between two different temperature regimes. \nAt lower temperatures (T < 80 K), the PL energy shift between 0 and 50 T, EΔ , increases \n  3 \nwith temperature when the magnetic field is applied perpendicular to the growth direction, z, \nrevealing an enhanced transfer of carriers towards QDs that are bigger in the growth \ndirection. No such trend is observed for B \/\/ z, which means that the exciton extent in the \nplane remains unchanged for T < 80 K. At higher temperatures (T > 100 K), our results show \nthat the zero-field PL energy decreases with increasing temperature according to the \nempirical Varshni law6 for the InAs bandgap, i.e. with no change in confinement. In contrast, \nEΔ  is characterized by a strong and anomalous decrease with increasing temperature, \nimplying an increasingly strong confinement of the carriers as the temperature is raised. We \nresolve these contradictory observations by proposing that the magnetic field effectively \nincreases the QD barrier potential in a way that is particularly favorable for the higher energy \ndots, such that their PL is less easily quenched at high temperatures.  \nThe paper is structured as follows: In Sec. II we outline the sample morphology and \nexperimental conditions under which this work has taken place, and we comment on the \nmodel that we have used to analyze the dependence of the PL on magnetic field. Sec. III \ndiscusses the results and Sec. IV describes their interpretation. Finally, we will summarize the \nconclusions in Sec. V. \nII. EXPERIMENTAL DETAILS AND ANALYSIS METHOD \n \nThe sample was prepared using solid-source molecular beam epitaxy. A 0.5 μm thick \nGaAs-layer was grown on top of a semi-insulating GaAs substrate. Subsequently, \n1.8 monolayers of InAs were deposited at a temperature of 480°C. During this phase, QDs \nwere formed following the Stranski-Krastanow growth mode. Finally, the sample was capped \nwith 25.2 nm of GaAs. The sample was excited by the light from a solid-state laser at 532 nm \nvia a 200 µm core optical fiber with a power density of 1 – 10 Wcm-2. The sample itself was \nlocated in the bore of a home-made pulsed field coil, placed in a He flow system allowing PL \nmeasurements over a broad temperature range (4.2 – 160 K). The coil was connected to a \n  4 \n5 kV 500 kJ capacitor bank, enabling magnetic field pulses of 20 ms and up to 50 T. The PL \nsignal was collected by a single 550-µm core collection fiber and subsequently analyzed by a \n30 cm monochromator and a liquid nitrogen cooled InGaAs diode array, using count times up \nto 4 ms. Although this sample has already been studied in high magnetic fields at low \ntemperatures,7,8 there are, to our knowledge, no previous reports of QDs studied as a function \nof temperature in such high fields. \nCombining the effect of the magnetic field on the electron and hole energy levels through \nthe use of the exciton effective mass and exciton radius, \n1 22ρ , enables us to construct a \nmodel for the PL energy as a function of magnetic field.9 The influence of a magnetic field on \nan exciton can be divided into a low-field and a high-field limit based on the size of the \nmagnetic length, ( )1 20l eB= h , where h  is the reduced Planck constant. In the low-field \nregime, the magnetic length is much larger than the size of the confined exciton wave-\nfunction, and the magnetic field can be treated as a small perturbation to the orbital motion of \nthe confined carriers, yielding a diamagnetic shift of the energy which is quadratic with \nfield:10,11,12 ( )2 2 28LE e Bρ μΔ = , where µ is the reduced exciton mass. In the high-field \nlimit, i.e. when the magnetic length is much smaller than the exciton wave-function extent, \nthe magnetic confinement of the carriers dominates the spatial confinement, and the energy \nlevels shift with magnetic field following the quantized Landau levels13: 1\n2n c\nE n ω⎛ ⎞= +⎜ ⎟⎝ ⎠h  \n( cω  is the cyclotron frequency). The resulting energy shift of the PL peak energy is linear \nwith magnetic field and when limiting our discussion to the electron and hole ground states, \nwe can write: ( )2HE e BμΔ = h . Although these results only strictly apply to the two \nlimits, a practical expression describing the entire magnetic field range can readily be derived \nby simply demanding continuity in ( )E B  and its derivative. The entire data set for a given \n  5 \ntemperature is then fitted with an equation describing the PL energy as a function of magnetic \nfield as follows: \n \n2 2\n2\n0 2\n2\n0 2 2\n2                for \n8\n2       for \n22\ncm\ncm\ne\nE E B B\ne\neE E B B\ne\nρ\nμ ρ\nμμ ρ ρ\n= + <\n= − + >\nh\nh h h\n (1) \n \nwhere Ecm is the centre of mass PL energy and E0 is the zero field PL energy.  Through the \ncombination of the parabolic and linear behavior of the PL shift into one equation, where the \ncrossover field is given by \n2\n2\ncB e ρ=\nh , we are able to extract both the effective exciton \nradius \n1\/ 22ρ  and the reduced exciton mass µ. It should be noted that our experimental \nmethods and analysis essentially probe the exciton radius. However, the relation between the \nexciton size due to quantum confinement and the physical size of the QDs12 enables us to \nformulate conclusions about the average size of PL-active QDs at a certain temperature. For \nthe purposes of this investigation, we will concentrate on the shift in energy of the PL peak \nbetween 0 and 50 T, EΔ , and the exciton radius, but not the exciton mass. \n    Upon application of a magnetic field, the structure of the exciton is affected mainly \nthrough a compression of the wave-function in the plane perpendicular to the applied field. \nTherefore, when examining the PL shift with B \/\/ z, the exciton radius in the plane of the \nsample is measured. On the other hand, with B ⊥  z, we probe the vertical and one lateral \ndimension of the dots. However, since it is the direction with the strongest confinement \n(smallest exciton radius) that determines both the size of the shift with field and the crossover \nfield Bc,14 and since the dots are smaller in the growth direction than in the plane of the \nsample, applying a magnetic field in the plane of the sample probes the vertical extent of the \nexciton. Indeed, we find that the shift and effective exciton radius are smaller for this field \n  6 \norientation, in agreement with earlier magneto-PL measurements on self-assembled QD \nnanostructures.7,8,12,15 \nIII. RESULTS \n \nThe inset of Fig. 1 shows the zero-field PL energy at different temperatures. For \ntemperatures below 80 K, the decrease in PL energy with temperature is faster than \npredicted6 for the InAs bandgap. This behavior was previously observed and attributed to \nthermal redistribution of electrons from higher to lower energy dots via the wetting layer.16-18 \nThe increase of temperature thus not only activates the expansion of the lattice and phonon-\nrelated effects, but also introduces an additional transfer of carriers between the dots which \nfavors lower-energy recombination. At higher temperatures, the PL energy nicely follows the \nchanges according to the Varshni law for the InAs bandgap. Following Brusaferri et al.,16 \nwho reported evidence of families of dots with ‘remarkably uniform sizes’, we interpret this \ntemperature dependence of the PL energy as suggesting the presence of different dot families \nwith distinct sizes in our sample. \nIn order to gain further insight into the confinement of the carriers inside the dots, we then \nstudied the magneto-PL of the sample at different temperatures and with different \norientations of the field with respect to the growth direction. Fig. 2 shows PL spectra for \ndifferent strengths of the magnetic field for 18 and 160 K. From these spectra it is already \nclear that the PL energy shift with B is larger at low temperatures, and that the intensity of the \nPL signal is significantly reduced when increasing the temperature. The dependence of the \nPL peak energy on magnetic field is summarized in Fig. 1 for the same two temperatures. The \n18 K data is typical of the low temperature regime, which is characterized by a crossover \nfrom parabolic to linear field dependence at a certain field Bc, indicated by the arrow. As the \ntemperature increases above 100 K, the shift of the PL energy is reduced, and there is a \ndecreasingly smaller linear regime at fields below 50 T, indicating stronger confinement. Fig. \n  7 \n3 shows EΔ  as a function of temperature for both field orientations. From this figure it is \nevident that, for lower temperatures (i.e. below ~80 K), as the temperature is raised there is a \nstrong increase in EΔ  with the magnetic field perpendicular to the growth direction (B⊥ z), \nwhereas an increase in temperature hardly affects the energy shift for B \/\/ z. In contrast, for T \n> 100 K there is a drastic reduction in the size of the shift for both field orientations. Given \nsuch different behavior it seems clear that different mechanisms are at work in the two \ntemperature regimes of our experiment. We will therefore go on to discuss each of these \nseparately. \nIV. DISCUSSION \na. T < 80 K \nFor the low temperature regime, the dependence of the shift ΔE on temperature is \nsubstantially different for the two different field orientations, as can be seen in Fig. 3. While \nthe shift is more or less constant with a magnetic field applied in the growth direction, \nexperiments with B ⊥  z reveal an increase of the shift with temperature. As mentioned \nabove, when B ⊥  z, we are probing the vertical extent of the exciton, since this is the \ndirection with the strongest confinement with this field orientation. Because the exciton \nwave-function is so small in this direction, ΔE is dominated by the low field regime where it \nis proportional to 2ρ μ . An increase in ΔE is thus either because μ is decreasing or \n1\/ 22ρ  is increasing (or both). However, if it were only because μ was decreasing this would \nalso increase the confinement energy, and result in an increase of the zero-field PL energy \nrelative to the change expected from the Varshni law, which is the opposite of what we \nobserve. On the other hand, a decrease in the zero-field PL energy is entirely consistent with \nan enhanced transfer of carriers towards larger QDs leading to a decrease in confinement. \nHence, the increase in EΔ  with the magnetic field perpendicular to the growth direction \n  8 \nindicates an expansion of the exciton wave-function in the growth direction reflecting the \nincreased contribution of larger QDs to the PL emission. In contrast, the energy shift with \nmagnetic field parallel to the growth direction remains unaltered at temperatures below 80 K. \nThus, the explanation of the data in the inset of Fig. 1 that there is thermal excitation from \nsmaller to bigger dots is indeed supported by our magneto-PL measurements, but the \nmagneto-PL data crucially reveal that these dots are larger in size only in the growth \ndirection: there is no indication of a change in the average lateral size of the ensemble of dots \nin this temperature range.  \nb. T > 100 K \nWe now turn to the high temperature regime. Here, the field-induced PL shift is \ncharacterized by a massive decrease as a function of temperature in both field \norientations (Fig 3.). Applying an analysis to the data following the magnetic field \ndependence of the peak energy as described in Eq. (1) would lead us to interpret this as a \nshrinkage of the exciton radius (or, equivalently, an increase in confinement) as a result of \nincreasing temperature (inset of Fig. 3). However, if the QDs active at higher temperatures \nwere, on average, smaller than the ones responsible for the PL at low temperatures, their \nconfinement energy should be higher, as would be the corresponding transition energies \nwithin the QD. In this case, the zero-field PL energy would not follow the empirical Varshni \nlaw for the InAs bandgap, but show a weaker temperature dependence or even an increase as \na function of temperature, i.e. the exact opposite of what we observe at low T. However, this \nis clearly not the case, and we therefore conclude that the decrease of the field-induced PL \nshift with temperature is not due to a decrease of the (zero-field) exciton radius as a function \nof temperature, but has some other cause. \nThe contradiction is resolved when noting that the energy shift is determined in the \npresence of a very strong magnetic field, which, we propose, affects the confinement \n  9 \npotentials. In general, applying a magnetic field causes the energy levels of bulk GaAs (the \nbarrier material) to be lifted by 1\n2 c\nωh , or about 0.9 meVT-1.19 In contrast, the PL energy shift \nbetween 0 and 50 T of the InAs QDs with B \/\/ z for the considered temperature range, varies \nbetween 10 and 20 meV (see Fig. 3), resulting in an energy shift of about 0.2 to 0.4 meVT-1. \nFig. 4 shows a schematic representation of the electron energy levels of an InAs QD in the \nGaAs matrix, and illustrates the fact that the application of a strong magnetic field increases \nthe energy gap between the states in the QDs and the states of the surrounding bulk GaAs \nmaterial. When applying a magnetic field, the energy levels of the GaAs barrier material are \nsubstantially raised, while the increase of the QD levels is rather moderate. Consequently, a \nstrong magnetic field enhances the temperature stability of the system by counteracting the \nescape of carriers from the dots into the surrounding barrier material. This phenomenon has \npreviously been observed in quantum well laser structures in an attempt to simulate a \nreduction in dimensionality by placing the structure in a magnetic field.20,21 However, the \ninfluence of a magnetic field on the energy levels of the QDs is strongly dependent on the \ndegree of confinement present in the dots. Smaller dots have a stronger confinement \npotential, resulting in a weaker dependence on magnetic field. Therefore, the energy levels of \nthe excitons with strong lateral confinement, i.e. those with a weak energy shift in magnetic \nfield (~ 0.2 meVT–1), are lifted much less than the ones with a weak lateral confinement, as \nthe latter have a larger PL shift in field (~ 0.4 meVT–1). In both cases, however, the barrier \nenergy is raised by the same larger amount. This results in a field-induced enhancement of \n0.7 to 0.5 meVT-1 of the QD barrier potential. Correspondingly, the extra energy difference \nbetween the QD levels and the GaAs barrier material at 50 T is 35 meV (400 K) for the high \nenergy dots (i.e. the ones with strong lateral confinement), while it is only 25 meV (290 K) \nfor the low energy dots (i.e. with weaker lateral confinement). In other words, the effect of \nthe magnetic field is to deepen the confinement potentials of the QDs, and counter-\n  10 \nintuitively, the mechanism is much stronger for smaller, high energy dots, as the energy \nlevels of these dots are the least affected by a magnetic field. The result is that at high \ntemperatures and high magnetic fields the contribution of the high energy dots to the PL \nrelative to the low energy dots is increased, which in turn results in a smaller PL shift in \nmagnetic field. This explanation is supported by the observation that at high temperatures the \nPL intensity is strongly increased upon applying a magnetic field, as can be seen in Fig. 2(b). \nIn contrast, at low temperatures, when there is insufficient thermal energy to excite the \ncarriers entirely out of the InAs dots and wetting layer into the barrier material, the magnetic \nfield has very little impact on the PL intensity [Fig. 2(a)]. This corroborates the assertion that \nthe excitation between large and small dots at low temperature occurs via the wetting layer.16-\n18 \n \nV. CONCLUSIONS \n \nWe have studied exciton confinement in self-assembled InAs\/GaAs QDs. At low \ntemperatures (T < 80 K), we find that the PL energy decreases faster with temperature than \npredicted by the Varshni law for the InAs band gap. This is attributed to thermal excitation \nvia the wetting layer to dots which are larger only in the growth direction of the sample. At \nhigher temperatures (T > 100 K) we observe a strong decrease of the PL shift in field, which \nwe attribute to field enhancement of the QD barrier potential. As the influence of a magnetic \nfield on the energy levels of the QDs depends inversely on the confinement energy, this \nmechanism is particularly important for smaller dots. \n \nThis work was supported by the Belgian IAP, the SANDiE Network of Excellence (NMP4-\nCT-2004-500101), the Engineering and Physical Sciences Research Council (United \nKingdom), a Royal Society International Joint Project and the EuroMagNET project (contract \n  11 \nno. RII3-CT-2004-506239) of the European Commission. M. Hayne acknowledges support \nof the Research Councils, UK. \na)Electronic mail: thomas.nuytten@fys.kuleuven.be \n  12 \n1D. J. Mowbray, M. S. Skolnick, J. Phys. D: Appl. Phys. 38, 2059 (2005).  \n2N. N. Ledentsov, V. A. Shchukin, T. Kettler, K. Posilovic; D. Bimberg, L. Ya. Karachinsky, \nA. Yu. Gladyshev, M. V. Maximov, I. I. Novikov, Yu. M. Shernyakov, A. E. Zhukov, V. M. \nUstinov, A. R. Kovsh, Journal of Crystal Growth 301-302, 914 (2007). \n3D. Bimberg, M. Grundmann and N. N. Ledentsov, Quantum dot heterostructures, Wiley \nLondon (1999). \n4D. Gammon, Nature (London) 405, 899 (2000). \n5A. Polimeni, G. Baldassarri Höger von Högersthal, F. Masia, A. Frova, M. Capizzi, S. \nSanna, V. Fiorentini, P. J. Klar,  W. Stolz, Phys. Rev. B 69, 041201(R) (2004). \n6Y. P. Varshni, Physica (Amsterdam) 34, 149 (1967). \n7J. Maes, M. Hayne, V. V. Moshchalkov, A. Patanè, M. Henini, L. Eaves and P. C. Main,  \nAppl. Phys. Lett. 81, 1480 (2002). \n8S. Godefroo, J. Maes, M. Hayne, V. V. Moshchalkov, M. Henini, F. Pulizzi, A. Patanè and \nL. Eaves, J. Appl. Phys. 96, 2535 (2004). \n9M. Hayne, J. Maes, S. Bersier, M. Henini, L. Müller-Kirsch, Robert Heitz, D. Bimberg and \nV.V. Moshchalkov, Physica B 346-347, 421 (2004). \n10T. Someya, H. Akiyama and H. Sakaki, Phys. Rev. Lett. 74, 3664 (1995). \n11S. N. Walck and T. L. Reinecke, Phys. Rev. B 57, 9088 (1998). \n12M. Sugisaki, H.-W. Ren, S. V. Nair, K. Nishi, Y. Masumoto, Phys. Rev. B 66, 235309 \n(2002). \n13S. Nomura, L. Samuelson, M.-E. Pistol, K. Uchida, N. Miura, T. Sugano, Y. Aoyagi, Appl. \nPhys. Lett. 71, 2316 (1997). \n14J. Maes, M. Hayne, M. Henini, F. Pulizzi, A. Patanè, L. Eaves, V. V. Moshchalkov, Physica \nB 346-347, 428 (2004). \n  13 \n15Y. Sidor, B. Partoens, F. M. Peeters, N. Schildermans, M. Hayne, V. V. Moshchalkov, A. \nRastelli, O. G. Schmidt, Phys. Rev. B 73, 155334 (2006). \n16L. Brusaferri, S. Sanguinetti, E. Grilli, M. Guzzi, A. Bignazzi, F. Bogani, L. Carraresi, M. \nColocci, A. Bosacchi, P. Frigeri and S. Franchi, Appl. Phys. Lett. 69, 3354 (1996). \n17A. Polimeni, A. Patanè, M. Henini, L. Eaves and P. C. Main, Phys. Rev. B 59, 5064 (1999). \n18P. Dawson, E. O. Göbel, K. Pierz, O. Rubel, S. D. Baranovskii, P. Thomas, Phys. Stat. \nSol. (b) 244, 2803 (2007). \n19Here, we have calculated the increase in barrier height for the electrons, since we are \ndiscussing thermal excitation of the carriers (electrons) out of the dot. However, the total \nincrease in energy for the dots would be the increase for the excitons (holes + electrons), \nwhich makes our assessment an underestimate of the effect. \n20Y. Arakawa, H. Sakaki, Appl. Phys. Lett. 40, 939 (1982). \n21T. T. J. M. Berendschot, H. A. J. M. Reinen, H. J. A. Bluyssen, C. Harder, H. P. Meier, \nAppl. Phys. Lett. 54, 1827 (1989). \n  14 \nFigure Captions \nFigure 1 (color online): The PL energy, Ecm, versus magnetic field. The data for 160 K has \nbeen shifted for clarity. The lines are fits to the data using Eq. (1). At lower temperatures, a \ncrossover from parabolic to linear behavior occurs at 19 T (indicated by the arrow), whereas \nthe 160 K data is parabolic up to 50 T. Note that the energy shift is much larger for low \ntemperatures. The inset shows the zero-field PL energy as a function of temperature. For low \ntemperatures, the decrease of the PL energy with temperature is faster than predicted by the \nVarshni law6 for the InAs bandgap (full lines). \n \nFigure 2 (color online): PL spectra at different magnetic fields for the B \/\/ z configuration for \n(a) 18 and (b) 160 K. Two PL spectra for the B ⊥  z orientation at low temperature are also \nshown in the left panel (a). The PL intensity is enhanced when applying a magnetic field, in \nparticular for the experiments at higher temperatures. The low temperature data has a larger \nfield shift compared to the high temperature data. Additionally, it can be seen that the PL \nshift with field is larger for the B \/\/ z orientation than for the B ⊥  z configuration. \n \nFigure 3 (color online): Energy shift between 0 and 50 T versus temperature for a magnetic \nfield applied parallel (circles) and perpendicular to the growth direction (triangles). A strong \ndecrease of the PL shift characterizes the high temperature (T > 100 K) regime. The inset \nshows the exciton wave-function extent as a function of temperature following Eq. (1) for \nB \/\/ z, and reveals an apparent wave-function shrinkage at high temperatures. For T > 120 K \nthe lateral exciton radius becomes so small that the cross-over to the high-field regime is at \ntoo high a field to be determined reliably. The lines are guides to the eye. \n \n  15 \nFigure 4 (color online): Schematic representation of the electron energy levels of the InAs \nQDs and GaAs matrix material as they are lifted by the magnetic field. The differential rise in \nenergy levels as a function of B increases the effective barrier height by 0.5 to 0.7 meVT-1. \nThe confinement energy cEΔ , the barrier potential bpEΔ  and the band offset boEΔ  are \nindicated. \n  16 \n \n \n \n \n \n \nFig. 1. Nuytten et al. \n \n \n \n \n \n \n0 10 20 30 40 50\n1.240\n1.245\n1.250\n1.255\n1.260\n1.265\n1.270\n \n \nE c\nm\n (e\nV)\nMagnetic Field (T)\n18 K \n160 K, shifted up \nby 32.6 meV \n0 40 80 120 160\n1.21\n1.22\n1.23\n1.24\n1.25\n InAs Varshni fit\n \nE c\nm\n (e\nV)\nTemperature (K)\nB \/\/ z \n  17 \n1.2 1.3\n \n \nB=50 T\nB=0 T\nB=35 T\nB=16 T\n18 K\n1.2 1.3\n \n \n \nB=0 T\nB=16 T\nB=35 T\nB=50 T\n160 K\nEnergy (eV)Energy (eV)\nIn\nte\nns\nity\n (a\nrb\n. u\nni\nts\n)\nIn\nte\nns\nity\n (a\nrb\n. u\nni\nts\n)(a) (b)\nB=50 T\nB=0 T\n \n \n \n \n \n \n \n \n \nFig. 2. Nuytten et al.\nB \/\/ z B \/\/ z\nB⊥ z \n  18 \n0 20 40 60 80 100 120 140 160 180\n8\n10\n12\n14\n16\n18\n20\n4\n5\n6\n7\n8\n0 20 40 60 80 100 120\n6\n7\n8\n9\nEn\ner\ngy\n S\nhi\nft \n(m\neV\n)\nE\nxc\nito\nn \nR\nad\niu\ns \n(n\nm\n)\nEn\ner\ngy\n S\nhi\nft \n(m\neV\n)\n \nTemperature (K)\nTemperature (K)\n \nB \/\/ z\n \n \n \n \n \n \n \n \n \n \n \n \nFig. 3. Nuytten et al. \n \n \n \n \n  B \/\/ z \n  B ⊥ z \n  19 \n0.2 to 0.4\nmeV\/T\n0.9 meV\/T\nGaAs InAs QD GaAs\nB = 0\nB > 0\nE\n∆Ebo\n∆Ec\n∆Ebp\n \n \n \n \n \n \n \n \nFig. 4. Nuytten et al. \n \n"}