{"doi":"10.1144\/pygs.58.1.265","coreId":"56348","oai":"oai:nora.nerc.ac.uk:10714","identifiers":["oai:nora.nerc.ac.uk:10714","10.1144\/pygs.58.1.265"],"title":"Conodont colour alteration pattern in the Carboniferous of the Craven Basin and adjacent areas, Northern England","authors":["Metcalfe, I.","Riley, N.J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"Conodont Colour Alteration Indices (CAI) values in the Craven area show a general range of 2.5–3.5, the majority being a value of 3. The higher values generally occur in the south and south-west and low values are found on the Ashnott High (Ashnott Anticline and eastern closure of the Whitewell Anticline) and in Waulsortian limestones. These values are consistent with the limited vitrinite reflectance data and are a result of the Carboniferous sedimentary and tectonic history of the region. There is no evidence of significant modification by subsequent burial, igneous events, reheating or mineralization. Low values of CAI 2–2.5 on the Ashnott High are interpreted to be due to the thinner sedimentary cover in that area and possible insulation derived from underlying Waulsortian limestones. Relatively high values of CAI 4 for Dinantian strata in the Holme Chapel Borehole and 3.5 in the Silesian sediments to the south of the Craven Basin probably reflect a thicker Westphalian cover than further north","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/56348.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/10714\/1\/Metcalfe__Riley_Revised.pdf","pdfHashValue":"487e5e514c05d48ca5c1678f9fafb17b93b348b3","publisher":"Yorkshire Geological Society","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:10714<\/identifier><datestamp>\n      2012-11-22T12:12:07Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/10714\/<\/dc:relation><dc:title>\n        Conodont colour alteration pattern in the Carboniferous of the Craven Basin and adjacent areas, Northern England<\/dc:title><dc:creator>\n        Metcalfe, I.<\/dc:creator><dc:creator>\n        Riley, N.J.<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        Conodont Colour Alteration Indices (CAI) values in the Craven area show a general range of 2.5–3.5, the majority being a value of 3. The higher values generally occur in the south and south-west and low values are found on the Ashnott High (Ashnott Anticline and eastern closure of the Whitewell Anticline) and in Waulsortian limestones. These values are consistent with the limited vitrinite reflectance data and are a result of the Carboniferous sedimentary and tectonic history of the region. There is no evidence of significant modification by subsequent burial, igneous events, reheating or mineralization. Low values of CAI 2–2.5 on the Ashnott High are interpreted to be due to the thinner sedimentary cover in that area and possible insulation derived from underlying Waulsortian limestones. Relatively high values of CAI 4 for Dinantian strata in the Holme Chapel Borehole and 3.5 in the Silesian sediments to the south of the Craven Basin probably reflect a thicker Westphalian cover than further north. <\/dc:description><dc:publisher>\n        Yorkshire Geological Society<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/10714\/1\/Metcalfe__Riley_Revised.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Metcalfe, I.; Riley, N.J..  2010  Conodont colour alteration pattern in the Carboniferous of the Craven Basin and adjacent areas, Northern England.   Proceedings of the Yorkshire Geological Society, 58 (1). 1-8.  https:\/\/doi.org\/10.1144\/pygs.58.1.265 <https:\/\/doi.org\/10.1144\/pygs.58.1.265>     \n <\/dc:identifier><dc:relation>\n        http:\/\/pygs.lyellcollection.org\/<\/dc:relation><dc:relation>\n        10.1144\/pygs.58.1.265<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/10714\/","http:\/\/pygs.lyellcollection.org\/","10.1144\/pygs.58.1.265"],"year":2010,"topics":["Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":" 1\nConodont Colour Alteration pattern in the Carboniferous of the Craven Basin \nand adjacent areas, northern England \n \nI. METCALFE1&2, and N. J. RILEY3  \n \n1 School of Environmental & Rural Science, University of New England, Armidale NSW 2351, Australia (Email: \nimetcal2@une.edu.au) \n2 National Key Centre for Geochemical Evolution and Metallogeny of Continents (GEMOC), Department of Earth \nand Planetary Sciences, Macquarie University, NSW 2109, Australia \n3 British Geological Survey, Keyworth, Nottingham, NG12 5GG, U.K. \n \n \nSUMMARY: Conodont Colour Alteration Indices (CAI) values in the Craven area show a general \nrange of 2.5-3.5, the majority being a value of 3. The higher values generally occur in the south \nand south-west and low values are found on the Ashnott High (Ashnott Anticline and eastern \nclosure of the Whitewell Anticline) and in Waulsortian limestones. These values are consistent \nwith the limited vitrinite reflectance data and are a result of the Carboniferous sedimentary and \ntectonic history of the region. There is no evidence of significant modification by subsequent \nburial, igneous events, reheating or mineralization. Low values of CAI 2-2.5 on the Ashnott High \nare interpreted to be due to the thinner sedimentary cover in that area and possible insulation \nderived from underlying Waulsortian limestones. Relatively high values of CAI 4 (Dinantian) in \nthe Holme Chapel Borehole and 3.5 in the Silesian sediments to the south of the Craven Basin, \nprobably reflect a thicker Westphalian cover than further north. \n \n 2\n1. INTRODUCTION \n \nConodonts, an extinct group of Palaeozoic-Triassic elongate marine chordates (e.g. Sweet & \nDonoghue, 2001), were soft-bodied animals, except for small phosphatic tooth-like elements that \nformed the feeding apparatus. The hard phosphatic elements of conodonts are generally found \nscattered in marine sedimentary rocks of Cambrian to Triassic age and have immense \nbiostratigraphical utility.  Preservation of soft body parts is rare and the first unequivocal soft \nbodied conodont was only described in 1983 (Briggs et al., 1983). The phosphatic elements of \nconodonts contain some organic material and when the elements are heated in the subsurface, \nthey progressively and irreversibly change colour with increased temperature and time (Fig. 1, \nTable 1). In addition, as conodonts are heated, or subject to matamorphism, their microstructure \nis altered texturally and at very high temperatures and pressures, the conodont elements may be \nrecrystallized, or become pitted, distorted and eventually destroyed. Studies of conodont colour \nand textural alteration have led to the establishment of a scale of Conodont Colour Alteration \nIndices (CAIs) and textural alteration types (Epstein et al., 1977; Rejebian et al., 1987). The \nprogressive change in conodont colour has been used extensively in the petroleum industry as an \nindex of thermal maturation, but has also been used to indicate temperatures of mineralization \n(Rejebian et al., 1987; Jones, 1992). Conodont colour and levels and type of textural alteration \ncan also be used in regional basin history and tectonic studies (e.g. Metcalfe, 2003). We here \npresent CAI data for the Carboniferous of the Craven Basin that has implications for sedimentary \nburial histories, basin evolution, hydrocarbon exploration and mineralisation. The study area \nincludes the Craven Basin of Hudson (1933), equivalent to the Bowland Basin of Ramsbottom \n(1974), and adjacent Silesian outcrops to the south. \n \n 3\nTABLE 1 HERE \n \n CAI values reported in this study come from published biostratigraphical collections \n(Austin, 1968; Higgins, 1975; Metcalfe, 1980, 1981; Metcalfe & Leeder, 1979; Riley et al. 1987: \nTurner et al., 1979) and unpublished material held at the British Geological Survey, the \nUniversity of New England, Armidale, Australia and Trinity College Dublin (see Appendix for \nlisting and grid localities). The emphasis on Dinantian (Mississippian) CAI values is a \nconsequence of the nature of these collections. Before discussion of the CAI values in the region \nit is necessary to give a general outline of the Carboniferous succession, in particular that of the \nDinantian, and the subsequent burial history.  \n \n2. POST DEVONIAN TECTONICS AND SEDIMENTATION \n \nA sketch map showing the principal anticlines that expose Dinantian rocks in the Craven Basin \nand a sketch map of the principal basement structures which affected Carboniferous deposition \nare given in Fig. 2. The Craven Basin is a Dinantian depositional and structural basin trending \nsouth-west. Like many contemporaneous basins in northern Britain, it is believed to have formed \nunder an extensional tectonic regime produced by lithospheric stretching, possibly initiated \nduring the late Devonian (Leeder, 1982; Gawthorpe, 1987), which may have been punctuated by \na period of transpression in Visean and early Namurian times (Arthurton 1983, 1984; Arthurton \net al. 1988). This tectonic regime resulted in basement rift faulting and the formation of an \nasymetric graben, with a southward tilting floor, bounded by shallow basement comprising the \nSouthern Lake District High and Askrigg Block to the north and the Central Lancashire High to \nthe south (Miller & Grayson, 1982). The western and eastern boundaries of the basin are unclear, \n 4\nsince exposure is lost beneath Permo-Triassic cover but it extends towards Formby. Various \nmodels for the basement configuration in the region have been given by Miller & Grayson \n(1982), Gawthorpe (1987), Lawrence et al. (1987), Arthurton et al. (1988), Lee, (1988), Leeder \n& McMahon (1988) and Gawthorpe et al. (1989). The regional depositional history of the \nDinantian has been described in detail by Gawthorpe (1966, 1987) and Riley (1990).  \n \n The Dinantian succession which overlies the shallow basement at the basin margins \ncomprises locally an initial sequence of red beds, marine peritidal limestones and evaporites \n(Stockdale Farm Formation of Arthurton et al. 1988), overlain by more widespread, shallow-\nwater marine shelf and platform carbonates. These sequences contrast strongly with the Craven \nBasin, in which the sequence is much thicker, more complete and varied. Geophysical (gravity) \nevidence (Cornwell & Evans in Arthurton et al. 1988) suggests that at least 3 km of unexposed \nsediment overlie the basement in the Craven Basin and a further 3 km is known to have \naccumulated from mid-Courceyan to late Brigantian times (Charsley 1984; Kirby et al. 2000, \nMap 4). The earliest exposed strata comprise the Chatburn Limestone Group and consist of \nimpure shallow water marine limestones and fine-grained terriginous clastics. These sediments \nwere rapidly deposited and there was little bathymetric variation across the basin. During \nChadian times (Clitheroe Limestone Formation) the effects of basement rifting became more \npronounced. This resulted in a varied basin floor topography with a reduction in the deposition of \nshallow marine limestones that were generally replaced by deeper water Waulsortian limestones. \nWidespread erosion occurred within the basin during the late Chadian, but by Arundian times the \nbasin was dominated by pelagic mudstone and limestone turbidite deposition (Hodder Mudstone, \nHodderense Limestone, Pendleside Limestone, and Bowland Shale formations). Intrabasinal \ntopography was maintained by syndepositional movement along basement fractures in the graben \n 5\nfloor.  \n \nDuring early Namurian times, the southern boundary of the basin became less distinct in \nterms of facies and sediment thickness. Subsidence extended to areas of basement, such as the \nCentral Lancashire High, which had previously been stable relative to the basin. This regional \nsubsidence, attributed to thermal subsidence by Leeder (1982), resulted in the accumulation of at \nleast 1.75 km of Namurian mudstones and sandstones exposed in the Rossendale Anticline which \noverlies the Central Lancashire High (Ramsbottom et al. 1978). General Namurian cover across \nthe study area was probably in the order of 1.5 km, with south-eastwards transfer of a depocentre \nresulting in a thick early Namurian sequence in the north-west of the region and a thick late \nNamurian sequence in the south-east (Kirby et al. 2000). Much of the Westphalian is no longer \npreserved in the study area, however the South Lancashire Coalfield comprises at least 1.84 km \nof sandstone, siltstone and mudstone-dominated strata (Ramsbottom et al. 1978). Since early \nWestphalian strata preserved in the Burnley Syncline and Ingleton-Austwick coalfields are \nthinner than the contemporary strata in southern and western parts of the Lancashire Coalfield, it \nis assumed that a Westphalian cover over the area was in the order of 1.5 km, resulting in an \nestimated general burial of the top Dinantian by approximately 3 km of Silesian sediments (Kirby \net al. 2000).  \n \nToward the close of the Carboniferous, compressional tectonics replaced thermal \nsubsidence. This resulted in Hercynian reactivation of the Lower Palaeozoic basement structures, \nsuch as the Central Lancashire High and the Craven Basin resulting in the formation of the \nRossendale Anticline and Ribblesdale Fold Belt respectively (Leeder 1982; Kirby et al. 2000).  \n \n 6\n During the Permo-Triassic, sedimentation resumed upon the eroded Hercynian structures. \nRemnants of this cover remain in faulted outliers around Clitheroe and Ingleton, suggesting post-\nTriassic fault activity in the region. It is unclear how much Permo-Triassic sediment \naccumulated, but Jackson et al. (1987) gave a total thickness of around 5 km of Permo-Triassic \nsediments in the East Irish Sea Basin, which lies offshore to the west of the study area. However, \nthe CAI values which we have observed suggest that post-Carboniferous burial in the study area \nwas much less than 5 km and generally less than 1 km (Kirby et al. 2000) and was insufficient to \naffect the CAI values already achieved during the Carboniferous.  \n \nCenozoic tectonic activity can be deduced from the intrusion of two igneous dykes, one in \nthe Grindleton Anticline [SD 7540 4710] and the other in the Lancaster Fells at Caton Moor [SD \n5632 6302] (Thompson. Green (1986) considered from fission track analysis, that the Lake \nDistrict to the north of the study area had undergone between 1 and 4 km of uplift since the \nPalaeogene. In the Craven Basin, Moseley (1972) suggested that uplift was greatest along-the \nAskrigg Block and decreased south-westwards. Evidence for Neogene uplift can also be inferred \nfrom Walsh et al. (1972) who correlated Neogene weathering with a 450 m altitude topographic \nbench present in the Pennines (Sissons, 1954). It would appear, therefore, that during the \nCenozoic, the study area was uplifted and eroded with renewed tectonic activity along certain \ninherited fractures, in rare cases associated with limited igneous intrusion.  \n \n3. THE CAI PATTERN \n \nCAI values are plotted on Fig. 3. Some localities that are very close to each other have been \ncombined as single plots. The precise location, stratigraphic horizon and lithology for each value \n 7\nis given in the Appendix. Apart from the Holme Chapel Borehole [SD 8608 2878] all the samples \nare from surface sections or shallow boreholes.  \n \n There is generally little variation in the CAI values across the area, with a range of \nbetween 2 and 3.5, apart from a single exceptional value of CAI 4 recorded in the Holme Chapel \nBorehole. The higher values generally occur in the south and south-west and low values are \nfound on the Ashnott High (Ashnott Anticline and eastern closure of the Whitewell Anticline) \nand in Waulsortian limestones. Because of the generally consistent CAI values and the lack of a \ncomprehensive geographical coverage, no attempt is made to draw CAI isograds. The values \nobserved are in broad agreement with expected values for the Carboniferous indicated by \nregional studies to the north (Burnett, 1987; Armstrong & Purnell, 1993).  \n \n4. INTERPRETATION OF THE CAI PATTERN \n \n4.1. Facies effect \n \nThe effect of facies on CAI values has already been demonstrated by Mayr et al. (1978), and it \nappears that conodonts from black shales can show CAI values one unit higher than in those from \nlimestones. Almost all the conodonts used in this study come from limestones (mainly \npackstones), and Silesian samples were obtained mainly from wackestone nodules (\"bullions\"). \nIn general, there is a variation of about half a CAI unit value within samples at any given locality, \nexcept for Waulsortian limestone facies where there is a variation of one CAI value. For example, \nin the Clitheroe area the Waulsortian limestones of the Clitheroe Limestone Formation show a \nCAI value of 2.5 whereas crinoidal limestones in the overlying Hodder Mudstone Formation \n 8\nyield conodonts with CAI values of 3.0 to 3.5. This variation may be due to a number of possible \ncauses, including (a) the type and amount of organic matter incorporated into the conodont \nelements by the animals living in these different environments, (b) differences in conodont \nelement growth rates, (c) differences in thermal conductivity of the various limestones and \nadjacent strata, (d) differential effects of migrating fluids due to variations in porosity and \npermeability in the different facies, and (e) early cementation of the Waulsortian limestones \n(Miller & Lees, 1985).  \n \n4.2. Burial and uplift \n \nAs already noted the top Dinantian was probably buried by approximately 3 km of Silesian \nsediments. Most of the observations in this study are of mid-Dinantian sediments, generally \naround 0.8 km below the top of the Dinantian succession. Since the present tectonic pattern was \nestablished by Permo-Triassic times, the burial time for the late Dinantian would be \napproximately 30 million years. Most of the CAI values in the Craven Basin range between 2.5 \nand 3.5 and are most commonly 3.0. Epstein et al. (1977) suggest a minimum temperature of \n110oC to ~190oC for a CAI value of 3. However, with a burial time of 30 million years this CAI \nvalue indicates temperatures of near 125oC (Epstein et al. 1977). Since most of the samples are \nfrom the mid-Dinantian, heating time may have been a little longer, suggesting temperatures in \nthe region of 110-120oC for the Dinantian. Given an assumed geothermal gradient of 30oC\/km \n(typical for extensional basins), the Craven area CAI values are not in general anomalously high \nand are consistent with their burial-uplift history.  \n \n The relatively high CAI value of 4 recorded from Dinantian limestones at a depth of 5875 \n 9\nft (1790.7 m) in the Holme Chapel Borehole, and CAI values of 3.5 in Namurian and early \nWestphalian sediments south of the Craven Basin, are probably a result of increased Westphalian \ncover (now removed) compared to further north. The lower CAI values of 2-2.5 seen over the \nAshnott High are probably due to a combination of both relatively lower depth of burial, since \nthis site accumulated a condensed sequence from mid-Dinantian until early Namurian times, and \nthe proximity of thick Waulsortian limestones, which as already noted possibly inhibited thermal \nconduction.  \n \n4.3. Basin tectonics \n \nWe consider the development of the Craven Basin to follow the model of McKenzie (1978), \ninvolving lithospheric thinning due to extension followed by thermal subsidence. Observed CAI \nvalues agree moderately well with McKenzie’s (1981) computation of temperatures within a \nsediment pile following extension. McKenzie (1981) concluded that maximum temperatures for \nshallow burial at less than 4km were attained much later than the onset of subsidence. For a \nstretching factor () of 2, applied by Dewey (1982), to the Silesian sequence in this region, and 3 \nkm of burial, a maximum temperature of 150oC at top Dinantian would be attained after 45 \nmillion years. Clearly the Hercynian uplift and folding which occured some 20 million years after \nthe onset of thermal subsidence (Leeder, 1988), prevented the maximum temperatures from being \nachieved. It appears, therefore, that McKenzie's (1981) modeled temperatures can be applied in a \ntruncated form to the regional CAI values.  \n \n4.4. Igneous rocks \n 10\n \nThe only igneous rocks recorded in the area comprise two Tertiary olivine-basalt dykes, located \nin the Grindleton Anticline and at Caton Moor respectively (Eccles,1870). Conodont samples are \nnot yet available from these sites and the local CAI value of 3-3.5 is likely to be exceeded only \nwithin a few metres of these intrusions, when compared to other examples outside the study area \n(Armstrong & Strens, 1987). The regional CAI values do not appear to have been modified by \nigneous activity.  \n \n4.5. Mineralization and fluid processes \n \nMineralization in the area is of lead-zinc-copper type with associated baryte and fluorite. CAI \nvalues in mineralized areas for example at Raygill, [SD 9400 4520] (CAI value of 3.0) Skeleron \n[SD 8140 4520] (CAI value of 3.0), and Ashnott [SD 6970 4860] (CAI values of 2.0-2.5) are \nwithin the regional range and do not appear to be affected by the mineralization. This is as \nexpected, since fluid inclusion studies indicate mineralization temperatures of between 104oC and \n138oC (Rogers, 1977), which are too low to have increased the CAI values already attained.  \n \n Evidence of late Carboniferous diagenesis by dolomitizing fluids is provided by the \nrecognition of remagnetization of late Dinantian limestones (Pendleside Limestone Formation) \non the Pendle Monocline (Addison et al. 1985) and around Skipton (Turner et al. 1979). It is \nunclear whether these fluids have had any influence on the CAI values.  \n \n The relatively high present day heat flows of over 8OmWm-2 observed in the Bowland \nFells (Lee et al., 1987) cannot be explained by underlying granite (as in the Askrigg and Alston \n 11\nBlocks). These values are probably caused by circulating groundwater (Downing et al., 1987), \nwhich relates either to a Carboniferous aquifer or a localised concentration of fracturing.  \n \n5. OTHER SOURCES OF MATURITY DATA AND CORRELATION WITH CAI \nVALUES \n \nPublished information on independent maturity data in the study area is sparse and is largely \nlimited to vitrinite reflectance. Shelley's (1967) volatile matter and fixed carbon data, from coal \nseams in the Great Scar Limestone north of the Ingleton Coalfield, suggests a vitrinite reflectance \nof approximately 1.2% Ro. This corresponds to a CAI value of 2. This is broadly consistent with \nCAI data reported here. Similar data reported by Shelley (1967) from the Ingleton coalfield \nsuggests a vitrinite reflectance of approximately 0.5% Ro corresponding to a CAI of 1. Trotter \n(1954) reported volatile matter and other data that represent vitrinite reflectance values of 1.25-\n1.35% Ro from the Westphalian of the Burnley Syncline, equivalent to CAI 2. Lawrence et al. \n(1987) reported values of 0.7-1.09% Ro (= CAI 2) from Namurian strata at Abbeystead (SD 5700 \n6400) in the Bowland Fells, 0.7-0.99% Ro (= CAI 2) from subcropping Dinantian\/ lower \nNamurian (Pendleian) strata at Sykes [SD 6250 5200] and two values of 0.91% Ro (= CAI 2) and \n1.46% Ro (= CAI 3) from the Whitmoor Borehole [SD 5874 6315], from the lower Namurian \n(Pendleian), and the late Dinantian (Asbian) Pendleside Limestone, at 865 ft (263.65 m) and \n3830 ft (1167.38 m) respectively. These vitrinite reflectance data are generally in agreement with \nthe observed CAI values in the Bowland - Lancaster Fells, when allowance is made for the fact \nthat the CAI values are slightly increased by the facies effect produced by the black shale nodular \nlimestones from which the values were obtained.  \n \n 12\n6. HYDROCARBON-OCCURENCE \n \nThe observed CAI values correspond to a range from the base of the oil window into the \ncondensate\/dry gas sectors of Heroux et al. (1979). Hydrocarbon shows are reported from a \nnumber of localites in the area, but these tend to be minor and of no commercial value. Most of \nthe shows are of oil or gas associated with past coal mining, for instance oil at Huncoat Colliery \nnear Blackburn and from pits around Burnley (Strahan, 1920), and gas at Birstall Smitheries near \nHuddersfield (Wray et al. 1930) and in the Bradford area (Stephens et al. 1953). Oil seeps have \nalso been reported at surface in the Formby area (Wray & Wolverson Cope 1948) where there is \nalso a small oilfield (Falcon and Kent, 1960). Here the reservoir is Triassic strata, but it is \ngenerally thought that the source is Carboniferous. Stephens et al. (1953) reported oil in \nNamurian bullions at Moor Houses, near Skipton. As already noted, biogenic methane was \nresponsible for the underground pipeline explosion at Abbeystead in 1984. Solid bitumen veinlets \nare known from the Haw Bank Limestone (Courceyan), which forms the core of the Skipton \nAnticline (Lees & Cox 1937). In addition visual observation by NJR shows liquid hydrocarbons \n(light oil) to be common on vein surfaces and in vughs in bullions from black shales. In the \nAshnott and Cow Ark anticlines, liquid hydrocarbons and pyrobitumen, within cavities and \nfractures associated with mineralization, have also been noted in boreholes penetrating \nWaulsortian limestones.  \n \n7. CONCLUSIONS \n \nCAI values in the Craven area show a general range of 2.5-3.5, the majority being a value of 3. \nThese values are consistent with the limited vitrinite reflectance data and are a result of the \n 13\nCarboniferous sedimentary and tectonic history of the region. There is no evidence of significant \nmodification by subsequent burial, igneous events, reheating or mineralization. Low values of \nCAI 2-2.5 on the Ashnott High are interpreted to be due to the thinner sedimentary cover in that \narea and possible insulation derived from underlying Waulsortian limestones. Relatively high \nvalues of CAI 4 (Dinantian) in the Holme Chapel Borehole and 3.5 in the Silesian sediments to \nthe south of the Craven Basin, probably reflect a thicker Westphalian cover than further north. \nObserved CAI values in the Craven Basin can therefore be explained as entirely due to depth of \nburial and pre-dates Permian extension. \n \nAPPENDIX \n \nThe following sample localities used in this study are listed below in ascending lithostratigraphic \norder, together with their national grid reference, the range of CAI values observed and \nchronostratigraphic division(s). In cases where a spread of values was observed at one locality, \nonly the dominant value was plotted on Fig. 3. Repositories are referred to in brackets at the end \nof each entry. The abbreviations BGS, TCD, UNE refer to geological collections held at the \nBritish Geological Survey, Trinity College Dublin and University of New England respectively.  \n \nDinantian \n \nChatburn Limestone Group. \n1) Chatburn, SD 7742 4416, CAI 2.5-3.0, Courceyan-Chadian (BGS). \n2) Chatburn By-pass, SD 7737 4409, CAI 3.0, Courceyan-Chadian (BGS). \n3) Skeleron Quarry, SD 8180 4490, CAI 3.0, Chadian (UNE). \n 14\n4) Swinden, railway cutting, SD 8675 543, CAI 3.0, Chadian (UNE). \n5) Haw Bank Quarry, SE 0150 5320, CAI 2.5, Courceyan (UNE). \n6) Gisburn, railway cutting, SD 8030 4750, CAI 2-2.5, Courceyan (UNE). \n7) Gisburn, railway cutting, SD 8025 4750, CAI 3.0, Courceyan (BGS). \n8) Holywell Bridge, railway cutting, SD 0270 5340, CAI 2.5, Chadian \n(UNE). \n9) Horrocksford Quarry, SD 7600 4422, CAI 3-3.5, Courceyan (BGS).  \n \nClitheroe Limestone Formation. \n10) Winterburn Grange, SD 9399 5786, CAI 3.0, Chadian (BGS). \n11) Hetton, SD 9556 5838, CAI 3.0, Chadian (BGS). \n12) Swinden Gill, SD 8691 5389, CAI 3.0, Chadian (BGS). \n13) Swinden Gill, SD 8678 5393, CAI 3.0. Chadian (BGS). \n14) Low Scarth Barn, SD 8884 5983, CAI 3-3.5 Chadian (BGS). \n15) Crake Moor Farm, SD 8774 6033, CAI 3.0, Chadian (BGS). \n16) Ormes Gill, SD 8786 6020, CAI 3-3.5, Chadian (BGS). \n17) Scothrop House, SD 8888 5987, CAI 2.5-3.0, Chadian (BGS). \n18) Knoll Wood, SD 6837 5005, CAI 3, Chadian (BGS). \n19) Salthill Quarry, SD 7550 4260, CAI 3.0, Chadian (UNE). \n20) Twiston Hill, SD 8090 4430, CAI 3.0, Chadian (UNE). \n21) Smellows North Quarry, SD 9420 5207, CAI 2.5, Chadian (UNE). \n22) Smellows South Quarry, SD 9425 5225, CAI 2.5, Chadian (UNE). \n23) Butter Haw, SD 9370 5255, CAI 2.5, Chadian (UNE). \n24) Worsaw Hill, SD 7780 4310, CAI 2.5, Chadian (UNE). \n 15\n25) Townfield Rock Quarry, SD 8990 5670, CAI 2.5, Chadian (UNE). \n26) Sykes Knoll, SD 7990 4420, CAI 2.5, Chadian (UNE). \n27) Cobbers Laithe, SD 8630 5370, CAI 2.5, Chadian (UNE). \n28) Butterhaw Beck, SD 9412 5305, CAI 2.5, Chadian (UNE). \n29) Clitheroe By-pass, SD 7740 4450, CAI 2.5, Chadian (UNE). \n30) Broughton Quarry, SD 9470 5273, CAI 3.0, Chadian (UNE). \n31) Butterhaw Quarry, SD 9409 5301, CAI 3.0, Chadian (UNE). \n32) Eller Beck, SD 9940 5300, CAI 3.0, Chadian (UNE).  \n \nHodder Mudstone Formation \n33) River Hodder, Buck Hill, SD 6830 4270, CAI 3-3.5, Arundian (BGS). \n34) Green Bank Gill, SD 9359 5959, CAI 3.0, Arundian? (BGS). \n35) Brockabank, SD 9346 5674, CAI 3.0, Chadian (BGS). \n36) Winterburn Beck, SD 9440 5989, CAI 3.5, Arundian (BGS). \n37) Haw Crag Quarry, SD 9135 5640, CAI 3-3.5, Arundian with reworked Chadian, (BGS). \n38) Bell Busk Bridge, SD 9082 5669, CAI 3-3.5, Arundian (BGS). \n39) Orms Gill, SD 8699 5991, CAI 3.5, Holkerian? (BGS). \n40) Otterburn Beck, SD 8641 5879, CAI 3-3.5, Arundian? (BGS). \n41) Rylstone, railway cutting, SD 9633 5811, CAI 2.5-3.0, Arundian-Holkerian (BGS). \n42) Leagram Brook, SD 6350 4510, CAI 3.0, Arundian (BGS). \n43) Leagram Brook, SD 6353 4435, CAI 2.5-3.0, Chadian (BGS). \n44) Ashnott, SD 6970 4862, CAI 1.5-2.5, Chadian (BGS). \n45) Ashnott, SD 6943 4833, CAI 1.5-2.0, Chadian (BGS). \n46) Hetton, SD 9600 5796, CAI 3-3.5, Arundian-Holkerian (BGS). \n 16\n47) Dinckling Green, SD 6455 4760, CAI 3-3.5, Chadian (BGS). \n48) Whitemore Knott, SD 6467 4790, CAI 3.0, Chadian (BGS). \n49) Low Cocks, SD 7495 4600, CAI 3-3.5, Arundian (BGS). \n50) River Hodder, Paper Mill Wood, SD 6790 4318, CAI 3.0, Arundian (BGS). \n51) River Hodder, Limekiln Wood, SD 6675 4325. CAI 3-3.5, Chadian (BGS). \n52) Porter Wood, SD 6600 4705, CAI 1.5-2.0, Chadian (BGS). \n53) Ashnott, SD 6945 4834, CAI, 2.5-3.0, Chadian (BGS). \n54) Sandal Holme, SD 6802 4338, CAI 3.0, Arundian (BGS). \n55) Hall Hill, SD 6685 4695, CAI 2.5-3.0, Chadian (BGS). \n56) King Syke, SD 7120 5150, CAI 2.5-3.0, Arundian (BGS). \n57) River Hodder, Agden, SD 6845 4275, CAI 2.5-3.0, Arundian (BGS). \n58) River Hodder, Higher Hodder, SD 6977 4125, CAI 2.5-3.0, Holkerian (BGS). \n59) Worston, SD 7680 4310, CAI 3.0, Chadian, (UNE). \n60) Ings Beck, SD 8160 4470, CAI 3.0, Chadian? (UNE). \n61) Embsay Beck, SE 0030 5400, CAI 2.5, Arundian (UNE). \n62) Ray Gill Quarry, SD 9400 4520, CAI 3.0, Arundian (UNE). \n63) River Hodder, Great Falls, SD 7040 3890, CAI 2.5-3.0, Holkerian (BGS). \n64) Hellifield, SD 8650 5641, CAI 3.0, Arundian-Holkerian (TCD).  \n \nHodderense Limestone Formation \n66) Ashnott, SD 6897 4815, CAI 2-2.5, Holkerian (BGS).  \n \nPendleside Limestone Formation \n67) Draughton, SE 0342 5249, CAI 2.5, Asbian (TCD). \n 17\n68) Rylstone, SD 9727 5788, CAI 3.0, Asbian (BGS). \n69) Clints Rock Quarry, SD 9669 5754, CAI 2.5-3.0, Asbian (BGS). \n70) River Hodder, Great Falls, SD 7025 4000, CAI 2.5, Holkerian (BGS). \n71) Pendle Hill, 7850 4170, CAI 3.0, Holkerian (UNE). \n72) Hambleton Quarry, SE 0580 5340, CAI 2.5, Asbian (UNE). \n73) Rad Brook, SD 7900 4260, CAI 3.0, Holkerian-Asbian (UNE).  \n \nMalham Formation \n74) Swinden Quarry, SD 9815 6176, CAI 2.5-3.0, Asbian (BGS).  \n \nBowland Shale Group \n75) River Wharfe, Bolton Abbey, SE 0755 5424, CAI 2.5-3.V, Brigantian (BGS). \n76) Orms Gill, SD 8705 5980, CAI 3-3.5, Asbian-Brigantian (BGS). \n77) Banks Gill, SE 0500 5250, CAI 2.5, Brigantian (UNE). \n78) Leagram, SD 6279 4378, CAI 3.5, Asbian (BGS). \n79) Dobsons Brook, SD 6201 4415, CAI 2.5, Asbian (BGS).  \n \nDinantian (undifferentiated) \n80) Holme Chapel Borehole, SD 8608 2878, 1790.70 m depth, CAI 4.0 (UNE). \n \nNamurian \n \nBowland Shale Group \n81) Light Clough, SD 7513 3765, CAI 3-3.5, Pendleian (BGS). \n 18\n82) Jenny Gill, SE 0050 5100, CAI 2.5-3.5, Pendleian (UNE). \n83) Bolton Abbey, SE 0750 5450, CAI 2.5-3.0, Pendleian (UNE). \n \nRoeburndale Formation \n84) Pedders Wood, SD 5120 4785, CAI 3.0, Arnsbergian (BGS). \n \nCaton Shale Formation \n85) River Hyndburn, Wray, SD 6487 6468, CAI 3.0, Arnsbergian (BGS). \n86) Salter Fell, SD 6300 6073, CAI 3.5, Arnsbergian (BGS). \n \nSabden Shale Formation \n87) Samlesbury Bottoms, SD 6170 2920, CAI 3-3.5, Kinderscoutian (BGS). \n \nKinderscout Grit Group \n88) Otley Chevin, SE 2000 4430, CAI 3-3.5, Kinderscoutian (BGS). \n \nMiddle Grit Group \n89) Sabden Brook, Cock Bridge, SD 7462 3438, CAI 3-3.5, Marsdenian \n(BGS). \n90) Blue Scar Beck, Keighley, SE 0002 3993, CAI 3.5, Marsdenian (BGS). \n \nRough Rack Group \n91) Nab Scar, Oxenhope, SE 0353 3287, CAI 3.5, Yeadonian.(BGS). \n 19\n92) Winter Hill, SD 6590 1480, CAI 3-3.5, Yeadonian (TCD). \n \nWestphalian \n \nLower Coal Measures \n93) Burnley, SD 8450 3360, CAI 3.5, Langsettian (BGS). \n94) Cottingly Beck, Shipley, SE 1150 3656, CAI 3.5 (BGS). \n \n \nAcknowledgements. The authors would like to thank Dr Richard Burnett for data and information \non CAIs of conodonts held at Trinity College Dublin. We thank Drs Q. Evans and D. W. \nHolliday of the British Geological Survey for comments on an earlier draft of this paper. We also \nthank Howard Armstrong and Nigel Smith for their very helpful reviews. N J Riley publishes \nwith the permission of the Executive Director, British Geological Survey. \n \nREFERENCES \n \nADDISON F. T., TURNER, P & TARLING, D. H. 1985. Magnetic studies on the Pendleside \nLimestone: evidence for remagnetisation and late diagenetic dolomitisation during a post \nAsbian normal event. Journal of the Geological Society, London, 142, 983-994. \nARMSTRONG, H. A. & PURNELL, M.A. 1993. Thermal maturation of the Lower Carboniferous \nstrata of the Northumberland Trough and Tweed Basin from conodont colour alteration \nindex (CAI) data. Proceedings of the Yorkshire Geological Society, 49, 335-343. \n 20\nARMSTRONG, H. A. & STRENS, M. R. 1987. Contact metamorphism of conodonts as a test of \ncolour alteration index temperatures. Pp. 203-208 in AUSTIN, R. L. (Ed.), Conodonts: \nInvestigative Techniques and Applications, British Micropalaeontological Society Series, \nEllis Horwood, Chichester, 422 pp.  \nARTHURTON, R. S. 1983. The Skipton Rock Fault -an Hercynian wrench fault associated with the \nSkipton Anticline, northwest England. Geological Journal, 18, 105-114.  \nARTHURTON, R. S. 1984. The Ribblesdale fold belt, NW England-a Dinantian-early Namurian \ndextral shear zone. Pp. 131-138 in HUTTON, D. H. W. AND SANDERSON, D. J. (Eds.), \nVariscan tectonics of the North Atlantic region. Geological Society, London Special \nPublication, 14, 270 pp.  \nARTHURTON, R. S., JOHNSON, E. W. & MUNDY, D. J. C. 1988. Geology of the country around \nSettle. Memoir of the Geological Survey of England and Wales, sheet 60, Her Majesty's \nStationary Office, London, 147 pp.  \nAUSTIN, R. L. 1968. Five Visean conodont horizons in the North of England. Geological \nMagazine, 105, 367-371.  \nBOTT, M. H. P., SWINBURN, P. M. & LONG, R. E. 1984. Deep structure and origin of the \nNorthumberland and Stainmore Troughs. Proceedings of the Yorkshire Geological \nSociety, 44, 479-496.  \nBRIGGS, D.E.G., CLARKSON, E.N.K. & ALDRIDGE, R.J. 1983. The conodont animal. Lethaia, 16, \n1-14. \nBURNETT, R. D. 1987. Regional maturation patterns for late Visean (Carboniferous, Dinantian) \nrocks of Northern England based on mapping of conodont colour. Irish Journal of Earth \nSciences, 8, 165-185.  \n 21\nCHARSLEY, T. J. 1984. Early Carboniferous rocks of the Swinden I Borehole west of Skipton, \nYorkshire. Report of the British Geological Survey, 84\/1, pp. 5-12, Her Majestys \nStationary Office, London.  \nDEWEY, J. F. 1982. Plate tectonics and the evolution of the British Isles. Journal of the \nGeological Society, London, 139, 371-412.  \nDOWNING, R. A., EDMUNDS, W. M. & BALE, I. N. 1987. Regional growndwater flow in \nsedimentary basins in the U.K. Pp. 105-125, in GOFF, J. C. & WILLIAMS, B. P. J. (Eds.), \nFluid flow in sedimentary basins and aquifers, Blackwell Scientific, Oxford, 150 pp.  \nEARP, J. R., MAGRAW, D., POOLE, E. G., LAND, D. H. & WHITEMAN, A. J. 1961. Geology of the \nCountry around Clitheroe and Nelson. Memoir of the Geological Survey of England and \nWales, sheet '08, 346pp., Her Majesty's Stationary Office, London  \nECCLES, J. 1870. On Two Dykes recently found in North Lancashire. Transactions of the \nManchester Geological Society, 9, pp. 26-28.  \nEPSTEIN, A. G., EPSTEIN, J. B. & HARRIS, L. D. 1977. Conodont color alteration - an index to \norganic metamorphism. U.S. Geological Survey Professional Paper, Washington, 995, 27 \npp.  \nFALCON, N. M. & KENT, P. E. 1960. Geological results of petroleum exploration in Britain 1945-\n1957. Geological Society of London Memoir, 2, 56 pp.  \nGAWTHORPE, R. L. 1986. Sedimentation during carbonate ramp-to-slope evolution in a \ntectonically active area: Bowland Basin (Dinantian), northern England. Sedimentology, \n33, 185-206.  \nGAWTHORPE, R. L. 1987. Tectono-sedimentary evolution of the Bowland Basin, N. England, \nduring the Dinantian. Journal of the Geological Society, 144, 44-59.  \n 22\nGAWTHORPE, R. L., GUTTERIDGE, P. & LEEDER, M. R. 1989. Late Devonian and Dinantian basin \nevolution in northern England and North Wales. Pp. 1-23 in ARTHURTON R. S., \nBUTTERIDGE, P. & NOLAN S. C. (Eds.), The role of tectonics in the Devonian and \nCarboniferous sedimentation in the British Isles. Yorkshire Geological Society \nOccasionial Publication, 6, 258 pp. Leeds.  \nGEORGE, T. N., JOHNSON, G. A. L., MITCHELL, M., PRENTICE, J. E., RAMSBOTTOM, W. H. C., \nSEVASTOPULO, G. D. & WILSON, R. B. 1976. A correlation of the Dinantian rocks in the \nBritish Isles. Special Report of the Geological Society, London, 7, 86 pp.  \nGRAYSON, R. F. & OLDHAM, L. 1987. A new structural framework for the northern British \nDinantian as a basis for oil, gas and mineral exploration. Pp. 33-59, in MILLER, I., ADAMS, \nA. E. & WRIGHT, V. P. (Eds.), European Dinantian Environments. John Wiley and Sons, \nChichester, 402 pp.  \nGREEN, P. F. 1986. On the thermo-tectonic evolution of Northern England: Evidence from fission \ntrack analysis. Geological Magazine, 123, 493-503.  \nHEALTH AND SAFETY EXECUTIVE. 1985. The Abbeystead Explosion: A report of the investigation \nby the Health and Safety Executive into the explosion on 23 May 1984 at the valve house \nof the Lune\/Wyre Water Transfer Scheme at Abbeystead. Her Majesty's Stationary Office, \nLondon, 22pp. \nHEROUX, Y., CHAGNON, A. & BERTRAND, R. 1979. Compilation and correlation of major thermal \nand maturation indicators. American Association of Petroleum Geologists Bulletin, 63, \n2128-21144.  \nHIGGINS, A. C. 1975. Conodont zonation of the late Visean-early Westphalian strata of the South \nand Central Pennines of Northern England. Bulletin of the Geological Survey of Great \nBritain, Her Majesty's Stationary Office, London, 53, 90 pp.  \n 23\nHUDSON, R. G. S. 1933. The scenery and geology of north-west. Yorkshire. Proceedings of the \nGeologists Association, 44, 227-269.  \nJACKSON, D. I., MULHOLLAND, P., JONES, S. M. & WARRINGTON, G. 1987. The geological \nframework of the East Irish Sea Basin. Pp. 191-203 in BROOKS J. & GLENNIE, K. (Eds.), \nPetroleum Geology of North West Europe, Graham and Trotman, London. \nJONES, G.L. 1992. Irish Carboniferous conodonts record maturation levels and the influence of \ntectonism, igneous activity and mineralization. Terra Nova, 4, 238–244. \nKIRBY, G.A., BAILY, H.E., CHADWICK, R.A., EVANS, D.J., HOLLIDAY, D.W., HOLLOWAY, S., \nHULBERT, A.G., PHARAOH, T.C., SMITH, N.J.P., AITKENHEAD, N. & BIRCH, B. 2000. The \nStructure and Evolution of the Craven Basin and Adjacent Areas. British Geological \nSurvey, Subsurface Memoir. London: The Stationary Office. \nLAWRENCE, S. R., COSTER, P. W. & IRELAND, R. J. 1967. Structural development and petroleum \npotential of the northern flanks of the Bowland basin (Carboniferous) Northwest \nEngland. Pp. 225-233 in BROOKS, J. & GLENNIE, K. (Eds.), Petroleum Geology of North \nWest Europe. Graham and Trotman, London. \nLEEDER, M. R. 1962. Upper Palaeozoic basins of the British Isles-Caledonide inheritance versus \nHercynian plate margin processes. Journal of the Geological Society, London, 139, 479-\n491.  \nLEEDER, M. R. 1986. Recent developments in Carboniferous geology: A critical review with \nimplications for the British Isles and N. W. Europe. Proceedings of the Geological \nAssociation, 59, 73-100.  \nLEEDER, M. R. & GAWTHORPE, R. L. 1987. Sedimentary models for extensional tilt block\/half \ngraben basins. Pp. 139-152 in COWARD, M. P., DEWEY, J. F. & HANCOCK, P. L. (Eds.), \n 24\nContinental extensional tectonics. Geological Society of London Special Publication, 28, \n637 pp.  \nLEEDER, M. R. & MCMAHON, A. H. 1988. Upper Carboniferous (Silesian) basin subsidence in \nnorthern Britain. Pp. 43-51 in BESLY, B. M. & KELLING, G. (Eds.). Sedimentation in a syn-\norogenic basin complex: the Carboniferous of northwest Europe. Blackie and Sons, \nLondon, 286 pp.  \nLEE, A. G. 1988. Carboniferous basin configuration of central England, modelled using gravity \ndata. Pp. 69-84 in BESLY, B. M. & KELLING, G. (Eds.). Sedimentation in a syn-orogenic \nbasin complex: the Carboniferous of northwest Europe. Blackie and Sons, London, 286 \npp. \nLEE, M. K., BROWN. G. C., WEBB, P. C., WHEILDON, J. & ROLLIN, K. E. 1987. Heat flow, heat \nproduction and thermo-tectonic setting in mainland U. K. Journal of the Geological \nSociety, London, 144, 35-42.  \nLEES, G. M. & COX, P. T. 1937. The geological basis of the present search for oil by the D'Arcy \nExploration Co. Ltd. Quarterly Journal of the Geological Society, London, 93, 156-194. \nMAYR, U., UYENO, T. T. & BARNES, C. R. 1976. Subsurface stratigraphy, conodont zonation and \norganic metamorphism of the Lower Palaeozoic succession, Biorne Peninsula, Ellesmere \nIsland, District of Franklin. Geological Survey of Canada Paper, Montreal, 78-1A, 393-\n398.  \nMCKENZIE, D. P. 1978. Some remarks on the development of sedimtntarly basins. Earth and \nPlanetary Science Letters, 40, 25-32.  \nMCKENZIE, D. P. 1981. The variation of temperature With time and hydrocarbon maturation in \nsedimentary basins formed by extension. Earth and Planetary Science Lctters, 55, 87-98.  \n 25\nMETCALFE, 1. 1980. Conodont faunas and the age of the Raygill Quarry limestones (Embsay \nLimestone), Lothersdale, Yorkshire. Proceedings of the Yorkshire Geological Society, 43, \n169-178.  \nMETCALFE, 1. 1981. Conodont zonation and correlation of the Dinantian and early Namurian \nstrata of the Craven lowlands of Northern England. Report of the Institute of Geological \nSciences, 80\/10, 1-70.  \nMETCALFE, I. 2003. Colour and textural alteration of Palaeozoic and Triassic conodonts from \nPeninsular Malaysia: implications for tectonic evolution and hydrocarbon generation. \nCourier Forschungsinstitut Senckenberg. 245, 261-280. \nMETCALFE, I. & LEEDER, M. R. 1979. Palaeontology and petrography of the St. Helens Well \nBorehole, Eshton, Yorkshire. Transactions of the Leeds Geological Association, 9, 53-60.  \nMILLER, J. & GRAYSON, R. F. 1962. The regional context of Waulsortian facies in northern \nEngland. Pp. 17-33 in BALTON, K.. LANE, R. H. & LEMONE, D. V. (Eds.), Symposium on \nthe paleaenvironmental setting and distribution of the Waulsortian facies: El Paso, Texas. \nEl Paso Geological Society, 165 pp.  \nMILLER, J. & LEES, A. 1985. Facies variation in Waulsortian buildups, Part 2. Mid-Dinantian \nbuildups from Europe and North America. Geological Journal, 20, 159-180. \nMOSELEY, F. 1972. A tectonic history of northwest England. Journal of the Geological Society, \nLondon, 128, 561-598.  \nNOWLAN, G.S. & BARNES, C.R. (1987): Application of conodont colour alteration indices to \nregional and economic geology. In, AUSTIN, R.L. (ed.) CONODONTS: Investigative \nTechniques and Applications. Ellis Horwood Limited, Chichester: 188-202. \n 26\nRAMSBOTTOM, W. H. C. 1974. Dinantian. Pp. 47-73 in RAYNER, D. H. & HEMMINGWAY, J. E. \n(Eds.), The Geology and Mineral Resources of Yorkshire. Yorkshire Geological Society \nOccasional Publications, Leeds 2, 405pp.  \nRAMSBOTTOM, W. H. C., CALVER, M. A., EAGAR, R. M. C., HODSON, F., HOLLIDAY, D. W., \nSTUBBLEFIELD, C. J. & WILSON, R. B. 1978. A correlation of Silesian rocks in the British \nIsles. Geological Society Special Report, 10, 82pp.  \nREJEBIAN, V.A., HARRIS, A.G. & HUEBNER, J.S. 1987. Conodont color  and  textural alteration: \nAn index to regional metamorphism, contact metamorphism and hydrothermal alteration. \nGeological Society of America Bulletin 99, 471-479. \nRILEY, N. J. (1990). Stratigraphy of the Worston Shale Group, Dinantian, Craven Basin, NW \nEngland. Proceedings of the Yorkshire Geological Society 48, 163–187. \nRILEY, N. J.. VARKER, W. J., OWENS, B., HIGGINS A. C. AND RAMSBOTTOM, W. H. C. 1987. \nStonehead Beck, Cowling, North -Yorkshire, England: A British proposal for the Mid-\nCarboniferous Boundary Stratotype. Courier Forschungsinstitut Senckenberg, 98, 159-\n177.  \nROGERS, P. J. 1977. Fluid inclusion studies in fluorite from the Derbyshire Orefield. Transactions \nof the Institute of Mining and Metallurgy  B86, 128-132.  \nSHELLEY, A. E. 1967. Analysis of two coals from the Great scar Limestone near Ingleton, \nYorkshire. Proceedings of the Yorkshire Geological Society, 36, pp. 51-56.  \nSISSONS, J. B. 1954. The erosion surfaces and drainage system of SW Yorkshire. Proceedings of \nthe Yorkshire Geological Society, 29, 305-342.  \nSTEPHENS, J. V., MITCHELL, G. H. & EDWARDS, W. 1953. Geology of the country between \nBradford and Skipton. Memoir of the Geological Survey of England and Wales, sheet 69, \n180pp., His Majesty’s Stationary Office, London.  \n 27\nSTRAHAN, A. 1920. Mineral oil, Kimmeridge oil-shale, lignites, jets, cannel coals, natural gas, \nEngland and Wales. Geological Survey of Great Britain Special Reports an the Mineral \nResources of Great Britain, 7, 125pp., His Majesty's Stationary Office, London.  \nSWEET, W.C. & DONOGHUE, P.C.J. 2001. Conodonts: Past, Present, Future. Journal of \nPaleontology 75, 1174-1184. \nTROTTER, F. M. 1954. The genesis of the high rank coals. Proceedings of the Yorkshire \nGeological Society, 29, 267-303.  \nTURNER, P., METCALFE, I. & TARLING, D. H. 1979. Palaeomagnetic studies of some Dinantian \nlimestones in the Craven Basin and a contribution to Asbian magnetostratigraphy. \nProceedings of the Yorkshire Geological Society, 42, 3171-396.  \nWALSH, P. T., BOULTER, M. C., IJTABA, M & URBAN, D.M. 1972. The preservation of the \nNeogene Brassington Formation of the southern Pennines and its bearinq on the evolution \nof Upland Britain. Journal of the Geological Society, London, 128, 519-559.  \nWRAY, D. A., STEPHENS, J. V. EDWARDS, W. N. & BROMHEAD, C. E. N. 1930. The geology of the \ncountry around Huddersfield and Halifax. Memoir of the Geological Survey of Great \nBritain, sheet 77, 221 pp., His Majesty's Stationary Office, London.  \nWRAY, D. A. & WOLVERSON COPE, F. 1948. Geology of Southport and Formby. Memoir of the \nGeological Survey of Great Britain, sheets 74 and 83, 54 pp., His Majesty's Stationary \nOffice, London.  \n 28\nTable 1. Temperature calibration of conodont colour alteration index (CAI) and correlation with \nvitrinite reflectance values. Compiled from Epstein et al. (1977), Rejebian et al. (1987), and \nJones (1992). \n \nCAI Temperature \nRange oC \nMean \ntemp oC \nVitrinite \nreflectance \n%Ro \n1 50-80 65 0.8 \n1.5 50-90 70 0.7-0.85 \n2 60-140 100 0.85-1.3 \n3 110-200 160 1.4-1.95 \n4 190-300 245 1.95-3.6 \n5 300-400 330 3.6 \n6 350-435 400  \n6.5 425-500 460  \n7 480-610 550  \n8 >600   \n \n  \n 29\nFigure Captions \n \n \nFig. 1. Conodont Colour Alteration Indices (CAIs) in relation to other organic metamorphic \nfacies and vitrinite reflectance values (after Nowlan and Barnes, 1987). \n \nFig. 2. Sketch map of the Craven Basin showing principal anticlines and Carboniferous \n(Dinantian and Silesian) and Permo-Triassic outcrop. Inset map of north-west England shows the \nprincipal basement features which controlled Carboniferous sedimentation. Abbreviations: AH- \nAshnott High, BB- Boulsworth Borehole, FB- Fletcher -Bank Borehole, WB- Whitmoor \nBorehole.  \n \nFig. 3. Plot of CAI values across the study area using Fig. 2 as a base map for the area where \nmost of the values have been recorded. Inset map shows distribution of values in the Silesian \noutcrop to the south of the Craven Basin.  \n \nORGANIC\nMETAMORPHIC\nFACIES\nCONODONT\nCAI\nRANGES\nVITRINITE\nREFLECTANCE\n%R\nASSOCIATED\nHYDRO-\nCARBONS\nIncipientmaturation\n250\n200\n150\n100\n50\nCo\n1\n1.5\n2\n3\n4\n300\no\nEarly dry gas\nwet gas &\noil\nHeavy to\nlight oil\n&\nwet gas\nDry gas\nor\nbarren\nImmature\nM\nat\nur\ne \nLi\nq\nui\nd\n \nw\nin\nd\now\n \nS\nup\nra\nm\nat\nur\ne \no\n< 0.8\n0.70-0.85\n0.85-1.30\n1.40-1.95\n1.95-3.60\nASKRIGG    BLOCK\nCRAVEN BASIN\nPE\nND\nLE\n M\nON\nOC\nLIN\nE\nEsh\nton\n - H\netto\nn\nCatlo\nw\nSaw\nley \n- G\nisbu\nrn B\nrou\ngh\nton Skip\nton\nTho\nrnt\non\nM\nid\ndo\np\nClither\noe\nLo\nthe\nrsd\nale\nGrin\ndlet\non\nSy\nke\ns \n- B\nre\nnn\nan\nd\nSla\nidb\nurn\nAs\nhn\not\nt\nW\nhi\nte\nw\nel\nl\nCo\nw \nAc\nk\nTh\nor\nnle\ny\nPl\nan\nta\ntio\nn F\nar\nm\nN\nDi\nnc\nkl\ney\n10 km\nPermo-Triassic\nSilesian\nDinantian\nPre-Carboniferous\nSOUTHERN\nLAKE DISTRICT HIGH\nASKRIGG BLOCK\nCENTRAL\nLANCASHIRE HIGH\nRIBBLES\nDALE FO\nLD BELTB\nOW\nLA\nND\n LIN\nE\nIRISH SEA\nAH\nWB\nBB\nHC\nFB\nDent\nIngleton\nLancaster Settle\nSkipton\nClitheroe\nBlackburn\n10 km\nSD 00 10 20 30 40 50 60 70 80 90 SE 00\n00\n90\n80\n70\n60\n50\n40\n30\n20\n10\n10 km \nCAI VALUES \n2.0 \n2.5 \n3.0 \n3.5 \n4.0 \nSD50 60 70 80 90 SE00 10 \n70 \n60 \n50 \n40 \n30 \n20 \nIlkley \nOtley \nClitheroe \nColne \nBlackburn \nLeeds \nBradford \nHalifax \nRochdale \nHuddersfield \nBury \n70 80 90 00 20 10 \n10 \n20 \n30 \n40 \n50 \n30 SD60 \n"}