{"doi":"10.1016\/j.ijpvp.2011.08.003","coreId":"177413","oai":"oai:aura.abdn.ac.uk:2164\/2226","identifiers":["oai:aura.abdn.ac.uk:2164\/2226","10.1016\/j.ijpvp.2011.08.003"],"title":"Cold hydraulic expansion of oil well tubulars","authors":["Akisanya, Alfred Rotimi","Khan, Fariq","Deans, Wiliam F","Wood, Peter"],"enrichments":{"references":[{"id":4319,"title":"An analytical model to predict the burst capacity of pipelines,","authors":[],"date":"1994","doi":null,"raw":"Stewart G, Klever FJ, Ritchie D.  An analytical model to predict the burst capacity of  pipelines,    Proceedings  of  the  13 th  International  Conference  on  Offshore Mechanics and Artic Engineering, Houston, Texas, USA; 1994.","cites":null},{"id":4320,"title":"Analytical burst strength prediction of OCTG with and without defects, SPE Paper 48329,","authors":[],"date":"1998","doi":"10.2523\/48329-ms","raw":"Klever  FJ,  Stewart  G. Analytical  burst  strength  prediction  of  OCTG  with  and without  defects,  SPE  Paper  48329,  Proceedings  of  SPE  Applied  Technology Workshop on Risk-based Design of  well  Casing and Tubing, The Woodlands, Texas, USA; 1998.","cites":null},{"id":4317,"title":"Development of a hydraulically expanded metal internal casing patch.","authors":[],"date":"2005","doi":"10.2118\/94056-MS","raw":"Louden  F,  Hazel  P,  Skjerping  F,  Gorrara  A,  Boe  K.  Development  of  a hydraulically expanded metal internal casing patch.  Paper number SPE 94056-PP. Proceedings of the SPE\/ICoTA Coiled Tubing Conference and Exhibition, The Woodlands, Texas, USA; 2005.","cites":null},{"id":4315,"title":"Expandable tubular solutions,","authors":[],"date":"1999","doi":"10.2118\/56500-MS","raw":"Filippov A, Mack R, Cook L, York P, Ring L, McCoy T. Expandable tubular solutions, Paper number SPE 56500, Proceedings of the SPE Annual Technical Conference and Exhibition, Houston, Texas, USA; 1999.","cites":null},{"id":4316,"title":"Expandable wellbore tubular,","authors":[],"date":"1999","doi":"10.2118\/60766-ms","raw":"Stewart RB, Marketz F, Lohbeck WCM. (1999). Expandable wellbore tubular, Paper  number  SPE  60766,  Proceedings  of  the  SPE  Technical  Symposium  on Quest for Solutions in a Changing Industry, Dhahran, Saudi Arabia; October 1999.","cites":null},{"id":4318,"title":"Forming mechanism of double-layered tubes by internal hydraulic expansion.","authors":[],"date":"2004","doi":"10.1016\/j.ijpvp.2004.03.014","raw":"Liu F, Zheng J, Xu P, Xu M, Zhu G. Forming mechanism of double-layered tubes by internal hydraulic expansion.  International Journal of Pressure Vessels and Piping, 2004; 81: 625-633.","cites":null},{"id":4321,"title":"In-situ expansion of casing and tubing – effect on mechanical properties and resistance to sulphide stress cracking,","authors":[],"date":"2000","doi":null,"raw":"Mack R, Filippov A, Kendziora L, Ring L. In-situ expansion of casing and tubing – effect on mechanical properties and resistance to sulphide stress cracking,  Paper number 164, NACE International Corrosion Conference, Houston Texas, USA; 2000.","cites":null},{"id":4314,"title":"Optimum expansion and residual contact pressure levels of hydraulically expanded tube-to-tubesheet joints, Trans. Canadian Society for Mechanical Engineering,","authors":[],"date":"1997","doi":null,"raw":"Allam  M,  Chaaban  A,  Bazegui  A.  Optimum  expansion  and  residual  contact pressure  levels  of  hydraulically  expanded  tube-to-tubesheet  joints,  Trans. Canadian Society for Mechanical Engineering, 1997; 21: 415-434.","cites":null},{"id":4313,"title":"Residual-stresses associated with the hydraulic expansion of steam-generator tubing into tubesheets, Nuclear Engineering and Design,","authors":[],"date":"1993","doi":"10.1016\/0029-5493(93)90220-4","raw":"Middlebrooks WB, Harrod DL, Gold RE. Residual-stresses associated with the hydraulic  expansion  of  steam-generator  tubing  into  tubesheets,  Nuclear Engineering and Design, 1993; 143: 159-169.","cites":null},{"id":4322,"title":"Theory of Plasticity,","authors":[],"date":"1987","doi":"10.1002\/crat.2170240705","raw":"Chakrabarty J. Theory of Plasticity, New York: McGraw-Hill; 1987.","cites":null},{"id":4323,"title":"Thermal contact resistance at the interface of double tubes assembled by plastic deformation. Experimental Thermal and Fluid Science,","authors":[],"date":"1998","doi":"10.1016\/S0894-1777(98)10010-9","raw":"Bourouga B, Bardon  JP.  Thermal  contact  resistance at the interface  of double tubes  assembled  by  plastic  deformation.    Experimental  Thermal  and  Fluid Science, 1998; 18: 168-181.","cites":null}],"documentType":{"type":1}},"contributors":["University of Aberdeen, School of Engineering","University of Aberdeen, Energy","University of Aberdeen, Centre for Micro- and Nanomechanics (CEMINACS)"],"datePublished":"2011-12","abstract":"Peer reviewedPostprin","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:aura.abdn.ac.uk:2164\/2226<\/identifier><datestamp>\n                2018-01-02T00:05:38Z<\/datestamp><setSpec>\n                com_2164_320<\/setSpec><setSpec>\n                com_2164_319<\/setSpec><setSpec>\n                com_2164_318<\/setSpec><setSpec>\n                com_2164_677<\/setSpec><setSpec>\n                com_2164_371<\/setSpec><setSpec>\n                com_2164_331<\/setSpec><setSpec>\n                com_2164_705<\/setSpec><setSpec>\n                col_2164_321<\/setSpec><setSpec>\n                col_2164_678<\/setSpec><setSpec>\n                col_2164_706<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nCold hydraulic expansion of oil well tubulars<\/dc:title><dc:creator>\nAkisanya, Alfred Rotimi<\/dc:creator><dc:creator>\nKhan, Fariq<\/dc:creator><dc:creator>\nDeans, Wiliam F<\/dc:creator><dc:creator>\nWood, Peter<\/dc:creator><dc:contributor>\nUniversity of Aberdeen, School of Engineering<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Energy<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Centre for Micro- and Nanomechanics (CEMINACS)<\/dc:contributor><dc:subject>\nExpandable tubular<\/dc:subject><dc:subject>\nHydraulic expansion<\/dc:subject><dc:subject>\nThick-walled cylinders<\/dc:subject><dc:subject>\nInterference<\/dc:subject><dc:subject>\nResidual stresses<\/dc:subject><dc:subject>\nTA Engineering (General). Civil engineering (General)<\/dc:subject><dc:subject>\nTA<\/dc:subject><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPostprint<\/dc:description><dc:date>\n2012-02-02T11:47:01Z<\/dc:date><dc:date>\n2012-02-02T11:47:01Z<\/dc:date><dc:date>\n2011-12<\/dc:date><dc:type>\nJournal article<\/dc:type><dc:identifier>\nAkisanya , A R , Khan , F , Deans , W F & Wood , P 2011 , ' Cold hydraulic expansion of oil well tubulars ' International Journal of Pressure Vessels and Piping , vol 88 , no. 11-12 , pp. 465-472 . DOI: 10.1016\/j.ijpvp.2011.08.003<\/dc:identifier><dc:identifier>\n0308-0161<\/dc:identifier><dc:identifier>\nPURE: 6465643<\/dc:identifier><dc:identifier>\nPURE UUID: ebdcfe04-7733-4c55-b2f2-82071534a3f7<\/dc:identifier><dc:identifier>\nScopus: 80053386382<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2164\/2226<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.1016\/j.ijpvp.2011.08.003<\/dc:identifier><dc:language>\neng<\/dc:language><dc:relation>\nInternational Journal of Pressure Vessels and Piping<\/dc:relation><dc:rights>\nNOTICE: this is the author’s version of a work that was accepted for publication International Journal of Pressure Vessels and Piping. Changes resulting from the publishing process, such as peer review, editing, corrections, structural formatting, and other quality control mechanisms may not be reflected in this document. Changes may have been made to this work since it was submitted for publication. A definitive version was subsequently published in International Journal of Pressure Vessels and Piping, [VOL 88, ISSUE 11-12, (Dec 2011)] DOI 10.1016\/j.ijpvp.2011.08.003<\/dc:rights><dc:format>\n8<\/dc:format>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0308-0161","issn:0308-0161"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["International Journal of Pressure Vessels and Piping"],"year":2011,"topics":["Expandable tubular","Hydraulic expansion","Thick-walled cylinders","Interference","Residual stresses","TA Engineering (General). Civil engineering (General)","TA"],"subject":["Journal article"],"fullText":"Accepted Manuscript\nTitle: Cold hydraulic expansion of oil well tubulars\nAuthors: A.R. Akisanya, F.U. Khan, W.F. Deans, P. Wood\nPII: S0308-0161(11)00105-0\nDOI: 10.1016\/j.ijpvp.2011.08.003\nReference: IPVP 3137\nTo appear in: International Journal of Pressure Vessels and Piping\nReceived Date: 11 May 2010\nRevised Date: 15 July 2011\nAccepted Date: 10 August 2011\nPlease cite this article as: Akisanya AR, Khan FU, Deans WF, Wood P. Cold hydraulic expansion\nof oil well tubulars, International Journal of Pressure Vessels and Piping (2011), doi: 10.1016\/\nj.ijpvp.2011.08.003\nThis is a PDF file of an unedited manuscript that has been accepted for publication. As a service to\nour customers we are providing this early version of the manuscript. The manuscript will undergo\ncopyediting, typesetting, and review of the resulting proof before it is published in its final form. Please\nnote that during the production process errors may be discovered which could affect the content, and all\nlegal disclaimers that apply to the journal pertain.\nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 1 \nCOLD HYDRAULIC EXPANSION OF OIL WELL TUBULARS \n \n \nA.R. Akisanyaa,∗, F.U. Khanb, W.F. Deansa and P. Woodb \n \n \na School of Engineering, College of Physical Sciences,  \nKing’s College, University of Aberdeen, Aberdeen AB24 3UE, U.K. \n \nb Read Well Services Limited, Viking House, 1 Claymore Avenue, \nOffshore Technology Park, Aberdeen AB23 8GW, U.K. \n \n \n \n \nABSTRACT \n \nThe cold hydraulic expansion of two concentric tubulars is analysed with emphasis on the \napplications to oil and gas casings.  Theories of elasticity and plasticity are used to develop \na model relating the hydraulic pressure, the geometric dimensions of the tubulars and the \nresidual contact pressure between the pipes. Nonlinear finite element analysis is used to \nvalidate the theoretical results and to investigate the effects of end support conditions. \nHydraulic expansion experiments are conducted on tubulars and the measured evolution of \nthe deformation and residual contact pressure are compared with the corresponding \ntheoretical predictions and finite element solutions. There is a good agreement between the \nexperimental results and predictions from the theoretical analysis and numerical \nsimulations.  The implications of the results for the design of casing hangers and patch \nrepairs of oil and gas tubulars are discussed. \n \nKeywords \nExpandable tubular; Hydraulic expansion; thick-walled cylinders; interference; residual \nstresses. \n \n1.     INTRODUCTION \n \nThe cold expansion of tubes has been used for many decades in the assembly and leak \nrepair of heat exchangers in power generation, nuclear and process industries, see for \nexample Middlebrooks et al. [1] and Allam et al. [2].  In the assembly of many shell and \ntube heat exchangers, holes are drilled in the tube-sheet and a tube is placed in each of the \nholes.  The tube is then plastically expanded onto the tube-sheet using either mechanical \nrolling method or hydraulic pressure. The interference fit that develops between the tube \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 2 \nand the tube-sheet upon unloading must provide a leak-proof joint between them. A similar \nexpansion method is also used in the process industry to repair badly corroded tubes in heat \nexchangers.  Here a new thin-walled tube (sometimes referred to as a sleeve) is inserted \ninside the existing tube bridging across the degraded section. The new tube is then cold \nexpanded onto the existing tube, thereby eliminating the leak path. In these applications, \nthe expansion is usually carried out over a relatively short length of the tube (between \n25 mm to 50 mm) with the primary aim of providing a good leak-proof joint. The post-\nexpansion structural and mechanical response is usually not a major concern since the joint \nis not load bearing in service. \n \nThe use of cold expanded tubulars in the oil and gas industry started just over a decade ago, \ndriven mainly by the need to reduce drilling and completion costs and to explore deeper \nhydrocarbon reserves [3].   Recent applications of expandable technology in the industry \ninclude the cold expansion of production tubing, expandable sand screens, cladding or \npatching systems, expandable liner hangers and multilateral junctions; some of these \napplications are illustrated in Figure 1. \n \nIn contrast to the application to heat exchangers, the cold expansion of tubulars in the oil \nand gas industry is subject to many technical and operational challenges.  The expansion is \ncarried out in-situ downhole in an oil or gas well at a depth of several thousands metres, \nand the level of expansion can be up to 30% with an expanded length of pipe of up to \n600 m (or more).  In addition, the expanded tubular must withstand the downhole loading \nand environmental conditions, e.g. pressure of up to 150 MPa, temperature of up to 200 oC \nand the presence of a potentially corrosive environment.  Consequently, the design of the \ndeployment tools and the assessment of the post-expansion behaviour are technically more \nchallenging. There is therefore an urgent need for detailed understanding of the inter-\nrelationship between the expansion method, material selection, geometric parameters, and \npost-expansion mechanical response and corrosion characteristics of cold expanded \ntubulars before the technology can be fully accepted in the high costs and high risk \nenvironment as found in the oil and gas industry. \n \n                                                                                                                                               \n∗\n Corresponding author. Email: a.r.akisanya@abdn.ac.uk.  Tel.: +44 1224 272989. Fax: +44 1224 272497. \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 3 \nSome of these relationships are beginning to emerge, and recent efforts have focused on the \ndevelopment of expansion tools and means of downhole deployment.  Three different \nmethods currently exist for performing the expansion in-situ in an oil or gas well. These \ninclude: (i) roller cone tools whereby a radially expanding tool is rotated and pulled \nsimultaneously through the pipe causing the pipe to expand, (ii) solid cone tools which are \nhydraulically and\/or mechanically pulled (or pushed) through the pipe [4], and (iii) \nhydraulic expansion [5].   The choice of expansion method depends on the operational \nrequirements. Both the roller and solid cone expansion methods are strain-controlled and \nhave greater maximum achievable diametrical expansion than the hydraulic method, which \nis stress-controlled [4].  The hydraulic expansion method is considered in this paper.  \n \nThe applications of the cold expansion of tubulars in the oil industry can be grouped into \ntwo main classes:  internal tubing patch and external casing patch. In the internal tubing \npatch, the patch tubular is deployed into the oil or gas well to the depth at which it is to be \nset. The patch is then plastically expanded or swaged into contact with the outer casing \nusing one of the three methods mentioned above; an interference fit is generated between \nthe pipes upon unloading. This technique is well suited for a range of applications; for \nexample, water shut off, repair of damaged tubing, and for isolation of perforated zones \n(see Figure 1).  The external casing patch however is used for reconnecting casing string \ndownhole.  If a casing has been damaged (e.g. due to corrosion or wear) and its pressure \nrating is compromised then it may need to be replaced. The casing string below the damage \nwill most likely be cemented in place and therefore not free to be removed. The section of \nthe casing above the damage is removed by mechanical backoff at a threaded coupling or \nby cutting and subsequent pulling out of the well.  A new casing is run over the outer \ndiameter of the remaining casing allowing for an overlap between the two casings, and the \nold casing is then expanded onto the casing patch, thereby reconnecting a new length of \ncasing which can now be “tied off” at surface. \n \nThe two applications described above involve the expansion of an inner pipe onto an outer \npipe; this is sometimes referred to as swaging.  The outer pipe for the internal tubing patch \n(and the inner pipe for the external casing patch) may be corroded, damaged or perforated, \nand thus the material and geometric dimensions of the patch tubular (and of the external \ncasing patch) must be appropriately chosen to ensure adequate connection strength between \nthe two pipes.   \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 4 \nLiu et al [6] presented an elastic – plastic analysis of the hydraulic expansion of concentric \ntubulars.  However, the analysis, which is based on strain compatibility between the \ntubulars, neglects the effects of the initial radial clearance between the tubulars on the \nresidual contact pressure. \n \nIn the current paper, the mechanics of hydraulic expansion of tubulars are examined.  \nElastic\/plastic analysis of the expansion process is carried out to determine the effects of \nmaterial properties, geometric dimensions (including the initial radial clearance) and the \nswage pressure on the post-expansion interface or contact pressure between the pipes.  The \neffects of the end support conditions on the expansion process are examined by nonlinear \nfinite element analysis.  Hydraulic expansion experiments are conducted using full-size \ntypical oil well tubulars and the results are compared with predictions from the finite \nelement and theoretical analyses.   \n \n2.    ANALYSIS OF STRESS AND STRAIN DURING HYDRUALIC EXPANSION \n       OF TUBULARS \n \nLet us consider the hydraulic expansion of an internal pipe (referred to as pipe 1) onto an \nexternal pipe (referred to as pipe 2). The internal pipe is concentrically placed inside the \nexternal pipe such that a radial clearance δ exits between the pipes, see Figure 2.  The \ninternal pipe 1 has inner radius ri and outer radius ro; the corresponding radii for the \nexternal pipe 2 are denoted by Ri and Ro.   For the internal tubing patch, the actual \ndimensions of the outer pipe may not be known but estimated values can be obtained from \nspecialised cased-hole inspection tool.  \n \nThe inner surface of the internal pipe 1 is pressurised using, for example, water, to swage \nor plastically expand a length of the internal pipe against the external pipe 2; the pressure is \nbled off after attaining a maximum swage pressure Psmax.  In the following we shall provide \nthe relationship between the applied swage pressure and the post-expansion interface (or \ncontact) pressure between the two concentric pipes with given initial geometric parameters \nand material properties.  The burst capacity of tubulars is not considered in this paper, but  \na detailed analysis of pre- and post-expansion burst capacity of tubulars under different end \nsupport conditions is available elsewhere; see for example Stewart et al. [7] and Klever and \nStewart [8]. \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 5 \n \nFor simplicity, the following assumptions are made in the present analysis of the hydraulic \nexpansion of tubulars. \n(i) Both pipes are elastic\/ideally-plastic with Young’s modulus E, Poisson ratio ν \nand uniaxial yield strength Y1 for pipe 1 and Y2 for pipe 2.   \n(ii) The pipes are assumed to be isotropic, and the magnitude of the residual stresses \ndeveloped after unloading from the maximum swage pressure is relatively small \nthat Bauschinger effects on the deformation can be neglected.  However, \nBauschinger effects are important in assessing the post-expansion collapse \nresponse of the pipes [9]. \n(iii) The constraint on the axial movement of the pipes is small and thus the axial (or \nlongitudinal) stress σz ≅ 0. \n(iv) Plastic yielding of pipe 1 occurs according to Tresca’s yield criterion. \n(v) The deformation of pipe 2 remains within the elastic limit during the swaging \nprocess.  \n \nThe deformation of the pipes can be divided into four stages: elastic deformation of pipe 1; \nelastic\/plastic deformation of pipe 1; post-contact deformation of pipes 1 and 2; and the \ndeformation of pipes 1 and 2 during depressurisation.  In the following we summarise the \nrelationship between the applied swage pressure and the deformation (as characterised by \nthe radial displacement or the hoop strain) for each stage of the deformation.   \n \nThe elastic in-plane stresses and corresponding displacements in a thick-walled cylinder \nsubjected to a combination of internal pressure Pint and external pressure Pext are well-\nknown, and are given by [10, 11] \n( ) ( ) ( ) ( ) ( ) ( ) \n\n\n\n\n\n++−\n−\n−\n\n\n\n\n\n\n\n\n++−\n−\n=\n\n\n\n\n\n\n\n\n+\n−\n−\n\n\n\n\n\n\n\n\n+\n−\n=\n\n\n\n\n\n\n\n\n−\n−\n−\n\n\n\n\n\n\n\n\n−\n−\n=\n2\n2\n22\n2\n2\n2\n2\n2\n2\n2\n2\n2\n2\n2\n2\n2\n2\n2\n2\n11\n1\n11\n1\n1\n1\n1\n1\n1\n1\n1\n1\nr\nr\nkE\nrPk\nr\nr\nkE\nrP\nu\nr\nr\nk\nPk\nr\nr\nk\nP\nr\nr\nk\nPk\nr\nr\nk\nP\niext\n2\noint\niextoint\niextoint\nr\nνννν\nσ\nσ\nθ    (1) \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 6 \nwhere σr and σθ  are the radial and hoop stresses respectively, u is the radial displacement,  \nri and ro are respectively the internal and external radii, k = ro\/ri, r is the radial coordinate, \nand E and ν are respectively the Young’s modulus and Poisson ratio of the material.  \n \nStage I – Elastic deformation of pipe 1 \nDuring the initial stages of the pressurisation, the deformation of the internal pipe (pipe 1), \nwhich is subjected to an internal pressure Ps, is linear elastic, and there is no deformation of \npipe 2 since the two pipes are not yet in contact.  From (1), the in-plane stresses, hoop \nstrain and the radial displacements at the outer surface of pipe 1 are  \n( )12         ;12          ;0 212 −==−== kE Purk P sooosoro εσσ θ     (2) \nand the corresponding stresses and hoop strain at the inner surface of the pipe are  \n \n( ) ( ) ( )[ ]( )1 11         ;11          ; 2\n22\n12\n2\n−\n−++\n==\n−\n+\n=−=\nkE\nkkP\nur\nk\nPk\nP siii\ns\nisri\nν\nεσσ θ  (3) \n \nwhere subscripts i and o refer to inner and outer surfaces respectively, and the other \nparameters are as defined earlier.  The relationship between the applied pressure Ps and the \nhoop strain at the outer surface of pipe 1, ε1ο,  is shown schematically in Figure 3; the initial \nelastic deformation is identified by curve 0-1 in the figure.   \n \nStage II – Elastic\/plastic deformation of pipe 1 \nThe magnitude of the stresses in the pipe increases with increasing swage pressure until \nplastic yielding starts at the inner surface of the pipe. Using Tresca’s yield criterion and the \nstresses given in (3), it can be shown that plastic yielding starts at an applied swage \npressure of magnitude \n( )\n2\n2\n1\n2\n1\nk\nkYPP ys\n−\n==          (4) \nwhere Y1 is the uniaxial yield strength of the material from which the pipe is made.  \n \nFurther increase in the pressure beyond the yield pressure given by (4) results in the spread \nof the plastic deformation towards the outer surface of the pipe.  By solving the stress \nequilibrium equation and making use of Tresca’s yield criterion, the pressure at which \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 7 \nplastic deformation occurs across the whole wall thickness of the pipe (sometimes referred \nto as the ultimate or limit pressure) is obtained as [10] \n \nkYPP ps ln1== .         (5) \n \nFor an elastic\/ideally-plastic material as assumed in the present study, or for materials \nwhose rate of hardening is of the order of the yield stress, a slight increase in the pressure \nabove the ultimate pressure given by (5) is sufficient to produce strains of appreciable \nmagnitude.   Thus, once the ultimate pressure (5) is attained, significant plastic deformation \noccurs at almost a constant pressure until pipe 1 makes contact with pipe 2; this \ndeformation process is identified as curve 2-3 in Figure 3.   This significant plastic \ndeformation may lead to strain localisation and necking before pipe 1 makes contact with \npipe 2; this must be avoided in practice. \n \nThe engineering hoop strain at the onset of localisation for a circular pipe subjected to an \ninternal pressure has been shown to be }1)2\/{exp( −n , where n is the strain hardening \nindex of the material from which the pipe is made; n ≅  0.15 for duplex stainless steel, \nn ≅  0.2 for low carbon steel, and n ≅  0.5 for austenitic stainless steel  [4, 7,8].  For a pipe \nmade from low carbon steel, the strain at the onset of localisation is about 10%. Although \nmaterial strain hardening is not considered in the present analysis, a comparison between \nthe hoop strain at the onset contact (i.e. ε1c = δ\/ro) and the predicted localisation hoop \nstrain can be used to determine the maximum allowable radial clearance δ between the \ntubulars.  \n \nStage III – Post contact deformation of pipes 1 and 2 \nOnce contact is made with the outer pipe 2 (identified as point 3 in figure 3), an interface \npressure Pc develops at the contact surface between the pipes due to the constraint which \npipe 2 imposes on the deformation of pipe 1.  The swage pressure must therefore increase \nto ensure further plastic deformation of pipe 1.  The inner pipe 1, which is fully plastic, is \nnow subjected to an internal swage pressure of magnitude  \nkYPPPP cpcs ln1+=+= ,        (6) \nand an external pressure of magnitude Pc, while pipe 2 is simultaneously subjected to an \ninternal  pressure of Pc, as illustrated in Figure 4.  \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 8 \n \nThe maximum allowable interface pressure Pc (= Pcy) for pipe 2 to remain elastic during \nthe swaging process, which is one of the assumptions, can be determined in the same \nmanner as for pipe 1 (see eqn. (4)), and it is given by   \n( )\n2\n2\n2\n2\n1\nK\nKY\nPcy\n−\n= ,         (7) \nwhere Y2 is the uniaxial yield strength of the material from which pipe 2 is made, and \nK = Ro\/Ri, where Ro and Ri are respectively the outer and inner radii of pipe 2.  \nConsequently, the maximum allowable swage pressure, Psmax, before de-pressurisation \nmust satisfy the relation  \n)( pcysmaxp PPPP +≤<          (8) \nto avoid plastic deformation of pipe 2, where Pp is the ultimate pressure for pipe 1.  \n \nThe stresses, strains and radial displacement in pipe 2 during the expansion can be obtained \nby using eqn. (1) for a circular cylindrical pipe subjected to an internal pressure Pint = Pc \nand external pressure Pext = 0.  The hoop strain ε2ο at the outer surface and the \ncorresponding radial displacement Ui at the inner surface of pipe 2 during loading are \ntherefore given by  \n( )\n( )1\n2\n22\n−\n−\n=\nKE\nPP ps\noε          (9) \n \n( )\n( ) ( ) ( )[ ]111 222 −++−\n−\n= KK\nKE\nPPR\nU psii ν       (10) \nRecall that the swage pressure Ps > Pp after the onset of contact.  \n \nPipe 1 remains fully plastic as the swage pressure is increased after the initial contact with \npipe 2, and the radial displacement of the outer surface of pipe 1 increases by a magnitude \nUi, given in eqn. (10).  The total hoop strain ε1o at the outer surface of pipe 1 at a given \nswage pressure Ps (> Pp) is therefore (δ + Ui)\/ro, where δ is the initial radial clearance \nbetween the pipes.   This total strain is a combination of the plastic and elastic (i.e. \nrecoverable) strains.  The plastic strain is not considered here, since the focus of this paper \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 9 \nis on the determination of the interface pressure after unloading.   The Ps versus ε1o relation \nafter contact is shown schematically as curve 3-4 in Figure 3.  \n \nSince pipe 1 is subjected to a combination of internal pressure Ps (> Pp) and external \npressure Pc after contact with pipe 2, the elastic radial displacement at the outer surface of \npipe 1 during this stage of the deformation is therefore  \n \n( ) ( ) ( ) ( )[ ]11112 2222 −−+−−−= kkkE PrkE Pru cosoo ν      (11) \n \nwhere Pc = 0 if ps PP ≤ . \n \nStage IV – Deformation of the pipes during unloading \nAfter reaching a chosen maximum swage pressure Psmax, the system is completely \ndepressurised. The choice of the maximum pressure will depend on the expected level of \nexpansion for the particular application of the process. The interface pressure just before \nunloading is Pcmax (= Psmax – Pp), and the corresponding elastic displacement of the inner \nsurface of pipe 2, Uimax, is obtained by substituting Psmax into eqn. (10). \n \nLet the instantaneous swage pressure and the corresponding interface pressure between the \ntwo pipes during the unloading be Psu and Pcu, respectively.  We assume that both pipes \nunload in a linear elastic manner. The interface pressure depends on the relative elastic \ndisplacement recovery at the contacting surfaces, i.e. recoreci rR 12 εε − , where ε1rec and \nε2rec are the elastic hoop strains at the contacting surfaces of the pipes (see Figure 3). Thus, \na reduction of the swage pressure from Psmax to Psu will reduce the elastic radial \ndisplacement at the outer surface of pipe 1 by a magnitude ∆ ou  given by \n( )( ) ( )( ) ( ) ( )[ ]11112 222max2max −−+−−−−−= kkkE PPrkE PPru cucosusoo ν∆ ,   (12) \nwhile the elastic radial displacement at the inner surface of pipe 2 should reduce by a \nmagnitude ∆U, given by \n( )( ) ( ) ( )[ ]111 222max −++−−= KKKE PPRU cuci ν∆      (13) \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 10 \nThese two displacements must be equal to ensure the two pipes remain in contact during \nthe unloading. Equality of (12) and (13) gives the interface pressure Pcu during the \ndepressurisation as  \n( )( ) ( )12ln 1 21 212\n2\n−\n+−\n\n\n\n\n\n\n\n\n−\n−−\n=\nkQ\nPkYP\nkQ\nkQP sumaxscu      (14) \n \nwhere  \n( ) ( ) ( ) ( )\n\n\n\n\n\n\n\n\n−\n−−+\n+\n\n\n\n\n\n\n\n\n−\n−++\n\n\n\n\n\n\n−=\n−\n1\n11\n1\n111 2\n22\n2\n221\nk\nkk\nK\nKK\nR\nQ\ni\nννδ\n.   (15) \n \nIn eqns. (14) and (15), Psmax is the maximum swage pressure just before unloading, Psu is \nthe instantaneous swage pressure during unloading, δ is the initial radial clearance between \nthe pipes, ro is the initial outer radius of pipe 1, and k and K are respectively the ratio of the \nouter radius to the inner radius for pipes 1 and 2.    The corresponding hoop strain at the \nouter surface of pipe 2 during unloading is therefore \n \n( )12 22 −= KE Pcuuε         (16) \nNote that the instantaneous interface pressure during unloading Pcu depends on the \ninstantaneous swage pressure Psu as given by eqn. (14). \n \nAfter complete depressurisation, Psu = 0, and Pcu in eqn. (14) then becomes the residual \ninterface (or contact) pressure between the pipes, Pcr, where \n( )( ) kYPkQkQP scr ln1 21 1max2\n2\n−\n\n\n\n\n\n\n\n\n−\n−−\n=  .     (17) \n \nThe analysis presented above for open-ended pipes and based on Tresca yield criterion is \nalso valid for von Mises yield criterion as the pressure at full plasticity Pb = Y1ln(k) for both \ncriteria.  Thus, the predicted fully plastic pressure (5) and the residual interface pressure \n(17) are valid for both Tresca and von Mises yield criteria provided the pipes are open-\nended.  However for closed-ended pipes, eqn (17) is only valid for Tresca yield criterion, \nand while for von Mises criterion the yield stress Y1 for pipe 1 must be multiplied by a \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 11 \nfactor of 32 \/ .   Klever and Stewart [8] have shown that the average of the burst pressure \npredicted by Tresca and von Mises criteria is an unbiased predictor of the actual burst \npressure; the same can be said for the fully plastic pressure. Therefore, for closed-ended \npipes, a more accurate prediction of Pp and Pcr based on the average of the Tresca and von \nMises predictions can be obtained by multiplying the yield stress Y1 by the factor \n081\n3\n21\n2\n1\n.=\n\n\n\n\n\n+  in eqns. (5) and (17). Thus, the residual interface pressure predicted by \n(17) would be greater for open-ended pipes than for closed-ended pipes. \n \nThe analysis of hydro-forming of double layered tubes by Liu et al. [6] suggested the use of \nhoop strain compatibility between the tubes to determine the residual interface pressure.  \nHowever, the analysis neglects the strain accumulated in the inner pipe (Pipe 1) just before \ncontact is made with the outer pipe (Pipe 2).  Consequently, the relationship between the \nswage pressure and the residual interface (or contact) pressure provided by Liu et al. [6] \n(see eqn. (18) of Liu et al. [6]) is independent of the initial radial clearance between the \npipes.  The hoop strain in pipe 1 is in general not equal to the hoop strain in pipe 2 because \npipe 1 is pre-strained before contact is made with pipe 2; the level of pre-strain depends on \nthe initial radial clearance between the pipes. The strain in pipe 1 at the instance of first \ncontact with the pipe 2 may be dominated by significant plastic deformation and this has a \nmajor effect on the residual interface pressure. \n \nThe use of the hoop strain compatibility as suggested by Liu et al. [6] may be suitable for \ntubes which are initially in contact before the expansion process commences or which have \nrelatively insignificant initial radial clearance, as usually found in the patch repair of heat \nexchanger tubes, where the plastic strain in the inner pipe just before contact with the outer \npipe is kept below about 1% [12].  Such an approach may, however, not be suitable for the \nexpansion of tubulars for applications where the internal pipe 1 is subject to significant \nhoop strain, as found, for, example, in some applications in the oil industry where the \nmaximum hoop strain during the expansion process may be as high as 25%.   The method \nof relative elastic displacement between the pipes, as described in the present paper, is \nsuitable for both scenarios of small and relatively large radial clearance. \n \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 12 \n3.   NUMERICAL SIMULATIONS \nFinite element analysis of the expansion process was carried out using ABAQUS CAE [13] \nto verify the analytical solution presented above and to examine the effects of other effects, \nsuch as the end constraint conditions.   The inner and outer radii of the pipes used in the \nfinite element simulation were ri = 110 mm and ro = 122 mm for the internal pipe 1, and \nRi = 125 mm and Ro = 137 mm for the external pipe 2.  Consequently, k = ro\/ri = 1.11, \nK = Ro\/Ri = 1.1, and the relative radial clearance δ \/ro = 0.0246.  Both pipes were 3.05 m in \nlength and arranged such that there was 2.44 m overlap between them, as shown in \nFigure 5a.    \n \nOne end of each pipe was constrained to move only in the radial direction (see Figure 5a), \nwhile the other end was unconstrained, thus ensuring there was no constraint on the axial \nmovement of the pipes. This boundary condition is referred to in this paper as “free ends”.    \nMesh sensitivity test was carried out for a pipe subjected to an internal pressure by \ncomparing the finite element prediction of the elastic stresses with the corresponding \ntheoretical prediction given by eqn. (1). The finite element results using four eight-noded \naxisymmetric elements with reduced integration (CAX8R in ABAQUS) along the \nthickness direction was in agreement with the theoretical prediction to within 0.5%.  Each \npipe was therefore modelled with a total of 4,060 eight-node, two-dimensional \naxisymmetric elements with four elements in the thickness direction.  Internal pressure \nduring the swaging was applied incrementally on the inner surface of pipe 1 over a 1.59 m \nlength as shown in Figure 5a, and then unloaded once the required maximum swage \npressure was reached. \n \nThe simulation of the cold expansion process was carried out using J2 flow theory \nassuming an elastic\/ideally-plastic solid. Recall that the fully plastic pressure and the \nresidual interface pressure for open-ended pipes are independent of the yield criteria used: \nTresca or von Mises (i.e. J2 flow theory). Both pipes had identical Young’s modulus \nE = 210 GPa and Poisson ratio ν = 0.33, and uniaxial yield strength Y1 = 702 MPa for \npipe 1 and Y2 = 980 MPa.  The contact interaction between the pipes was modelled using a \nfriction coefficient of µ = 0.25. \n \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 13 \nThe deformed shape of the pipes after complete depressurisation is shown schematically in \nFigure 5b; the contact length of the pipe is slightly less than the pressurised length due to \naxial contraction and bending of the pipes, mostly of internal pipe 1. The numerically \npredicted residual interface (or contact) pressure after swaging to a pressure of \nPs = 169 MPa is shown in Figure 6 as a function of distance along the contacting surfaces; \nthe distance is measured from point A to D along the length of the pipe, as identified in \nFigure 5b.  The interface pressure is nearly uniform along the contact length, with peaks in \nthe interface pressure at either end of the contact length.  Hereafter, the interface pressure \nwill be reported as the average value over the contact length, excluding the peak values. \n \nThe evolution of the hoop strain at the outer surface of pipe 2 with the applied swage \npressure Ps is shown in Figure 7.  For each of the three different values of Ps considered, \nthe deformation of pipe 2 started at an applied swage pressure of 76 MPa; this is the \npressure at which the inner pipe 1 first made contact with the outer pipe 2. This is in \nreasonable agreement with the predicted value of kY ln1  = 73 MPa.  \n \nFurther increase in the swage pressure resulted in the elastic deformation of the outer pipe 2 \nuntil plastic yielding commenced in pipe 2 at a swage pressure of 154 MPa. This compares \nfavourably with the theoretically predicted swage yield pressure for pipe 2 of magnitude \n152 MPa, see eqns. (7) and (8).   We note that the magnitude of the residual hoop strain at \nthe outer surface of pipe 2 and the corresponding residual interface pressure increase with \nincreasing maximum swage pressure before depressurisation.     \n \nOne of the assumptions of the theoretical analysis was that the outer pipe 2 must remain \nelastic during the swaging process.  In order to compare the theoretical prediction of the \npressure versus hoop strain response with the corresponding finite element solution, a \nswage pressure less than yield pressure for pipe 2 (= 154 MPa) must be used in the finite \nelement simulation. A comparison between the predictions from the analytical model and \nthe finite element analysis at a maximum swage pressure of Ps = 145 MPa is shown \nFigure 8.  There is a very good agreement between the theoretical and finite element \npredictions during loading and unloading for the swage pressure versus hoop strain \nresponse of pipe 2 (Figure 8a), and also the swage pressure versus interface pressure \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 14 \nresponse (Figure 8b).  We conclude that the theoretical model adequately describes the \nresponse of the pipes during the loading and unloading phases of the hydraulic expansion.  \n \nAdditional numerical simulation was carried out to investigate the effects of end support \nconditions on the swaging process and residual interface pressure.  The cold expansion of \ntubulars in oil and gas wells usually involve the use of relatively large elastomeric seals \n(usually referred to as packers), and the external tubulars (mainly casings) may be \ncemented in place.  These will therefore restrict the axial movement of the pipes during the \nexpansion. The results presented above are for pipes with no axial constraint. In this \nadditional simulation, the ends of the two pipes were constrained against axial movement; \nthis is referred to as “fixed ends”.  For the fixed ends, axial tension develops as the swaging \nprocess progresses; the magnitude of the axial tension will increase with increasing swage \npressure.  Plastic yielding of the internal pipe 1 is therefore dependent on both the applied \npressure and the axial tension. The distribution of the residual interface pressure along the \ncontact length is qualitatively similar for both the “fixed ends” and the “free ends”, as \nshown in Figure 6.  The average residual interface pressure at the same maximum swage \npressure before depressurisation is 14 MPa  for the “fixed end” and 16 MPa for the “free \nends”. The greater value of the fully plastic pressure for closed-ended pipes in comparison \nto open-ended pipes as discussed earlier leads to a lower residual interface pressure for \nclosed-ended pipes.    Thus, the constraint on the axial movement due to the seals and \ncementing of the casings slightly reduces the residual interface pressure at a given \nmaximum swage pressure.    \n \n4. EXPERIMENTS  \nSwaging experiments were carried out on oil well steel tubulars to validate the theoretical \nand numerical predictions.  The internal pipe 1 was a L80 grade tubular with inner radius of \nri = 110 mm and outer radius of ro = 122 mm (i.e. 8\n59 -inch OD), while the external pipe 2 \nwas a P110 grade casing with inner radius of  Ri = 125 mm and outer radius of Ro = \n137 mm (i.e. 4\n310 -inch OD).  Thus the initial radial clearance was δ = 3 mm. \n \nUniaxial tensile samples were machined from the pipes in the hoop direction and tested; \nrepresentative uniaxial stress-strain responses are shown in Figure 9.  The uniaxial yield \nstress was 640 MPa for the L80 and 897 MPa for P110, and the ultimate tensile strength \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 15 \n(UTS) was 764 MPa for L80 and 1063 MPa for P110.  The level of strain hardening was \nsmall in the material from which the pipes were made.  \n \nThe length of each of the pipes tested was 3.05 m, and the L80 pipe was inserted inside the \nP110 pipe ensuring the pipes were concentrically placed, with an overlapping axial length \nof 2.4 m between the two pipes.  An axial length 1.65 m within the overlapping region was \nisolated for expansion by elastomeric seals.  Three strain gauges were mounted on the \nexternal surface of the outer pipe to measure the hoop strain during the swaging operation. \nOne of the gauges was placed mid-way between the seal locations, while each of the other \ntwo gauges was placed at a distance of 413 mm from the centrally placed gauge. A \nschematic diagram of the experimental setup is shown in Figure 10. The swage pressure \nwas applied in increments using a hydraulic pump until a pressure of 145 MPa was \nattained, and the system was then depressurised. The hoop strains and the swage pressure \nwere continuously monitored and recorded using a computerised data logger.   \n \nThe experimentally measured swage pressure versus hoop strain response for pipe 2, and \nthe swage pressure versus interface pressure response are compared with the corresponding \ntheoretical and the finite element predictions in Figure 8.   The finite element results shown \nin Figure 8 were obtained by assuming the pipes were made from an elastic-ideally plastic \nmaterial, with a yield strength which is the average of the initial yield strength and the UTS \nas obtained in the uniaxial tensile test: Y1 = (640 + 764)\/2 = 702 MPa for pipe 1, and \nY2 = (897 + 1063)\/2 = 980 MPa for pipe 2.  The experimental results from the hydraulic \nexpansion indicate the internal L80 pipe came into contact with the external P110 pipe at a \npressure of 71 MPa; this is in good agreement with the value of 76 MPa from the finite \nelement simulation and a value of 73 MPa from the theoretical prediction.    \n \nThe measured residual interface pressure was 8 MPa  which is slightly less than 10.8 MPa \nfrom the theoretical model and the 11.5 MPa from the finite element analysis.  There is \ntherefore a very good agreement between the residual interface pressure predicted by the \ntheoretical model and by the finite element simulation. The discrepancy between the \nmeasured residual interface pressure and the two predictions can be attributed to the fact \nthat the model and the finite element simulations assumed elastic\/ideally-plastic material \nwhile the materials from which the pipes were made do actually strain harden, though \nmildly.  The level of deformation and the strains at a given swage pressure would therefore \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 16 \nbe lower in the strain hardening pipes than for the corresponding elastic\/ideally-plastic \npipes, thereby reducing the interface pressure.  Further, the seals used to contain the \nhydraulic fluid in the pipe do impose some constraint on the axial movement of the pipes, \nwith a consequential effects of reducing the residual interface pressure at a given maximum \nswage pressure, see for example, Figure 6. \n \nThe solution of the residual interface pressure presented by Liu et al. [6] does not account \nfor the effect of the initial radial clearance.  Using the geometric and material parameters \nfor the materials tested, the analysis of Liu et al. [6] predicts a residual interface pressure of \n9.2 MPa; cf 8 MPa from the experiment, 10.8 MPa from current theoretical analysis and \n11.5 MPa from finite element analysis. The discrepancy between Liu et al. [6] prediction \nand that from the current analysis is attributed to the initial radial clearance.  The effect of \nthe relative initial radial clearance δ\/ro on the residual interface pressure from the current \nanalysis is shown in Figure 11; δ\/ro = 0.0245 in the experiment.  The difference between \nthe residual interface pressure predicted by Liu et al. [6] and that predicted from the current \nanalysis increases with increasing value of the initial radial clearance.    \n \n5. CONCLUDING REMARKS \nThe hydraulic expansion of two concentric tubulars has been analysed and the pressure \nrequirements have been determined as functions of the material properties and geometric \ndimensions.  The predictions of the evolution of the deformation and residual interface \npressure from the analytical model, which was based on the analysis of a thick-walled \ncylinder, compare favourably with those from non-linear finite element analysis and full-\nsize hydraulic expansion experiments.  The analysis presented in the paper is applicable to \nthe hydraulic expansion of two concentric plain pipes for a wide range of applications, \nincluding the repair of heat exchanger tubes, and patch and cladding of oil and gas well \nproduction and completion tubulars and casings.   \n \nACKNOWLEDGEMENTS \nThis work was funded as part of a KTP programme (Programme Number 4267). The \nauthors are grateful to the UK Department for Business, Innovation and Skills (formerly \nDepartment of Trade and Industry) for financial support.  \n \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 17 \nREFERENCES \n \n[1] Middlebrooks WB, Harrod DL, Gold RE. Residual-stresses associated with the \nhydraulic expansion of steam-generator tubing into tubesheets, Nuclear \nEngineering and Design, 1993; 143: 159-169. \n[2] Allam M, Chaaban A, Bazegui A. Optimum expansion and residual contact \npressure levels of hydraulically expanded tube-to-tubesheet joints, Trans. \nCanadian Society for Mechanical Engineering, 1997; 21: 415-434.  \n[3] Filippov A, Mack R, Cook L, York P, Ring L, McCoy T. Expandable tubular \nsolutions, Paper number SPE 56500, Proceedings of the SPE Annual Technical \nConference and Exhibition, Houston, Texas, USA; 1999. \n[4] Stewart RB, Marketz F, Lohbeck WCM. (1999). Expandable wellbore tubular, \nPaper number SPE 60766, Proceedings of the SPE Technical Symposium on \nQuest for Solutions in a Changing Industry, Dhahran, Saudi Arabia; October 1999. \n[5] Louden F, Hazel P, Skjerping F, Gorrara A, Boe K. Development of a \nhydraulically expanded metal internal casing patch.  Paper number SPE 94056-PP. \nProceedings of the SPE\/ICoTA Coiled Tubing Conference and Exhibition, The \nWoodlands, Texas, USA; 2005. \n[6] Liu F, Zheng J, Xu P, Xu M, Zhu G. Forming mechanism of double-layered tubes \nby internal hydraulic expansion.  International Journal of Pressure Vessels and \nPiping, 2004; 81: 625-633. \n[7] Stewart G, Klever FJ, Ritchie D.  An analytical model to predict the burst capacity \nof pipelines,  Proceedings of the 13th International Conference on Offshore \nMechanics and Artic Engineering, Houston, Texas, USA; 1994. \n[8] Klever FJ, Stewart G. Analytical burst strength prediction of OCTG with and \nwithout defects, SPE Paper 48329, Proceedings of SPE Applied Technology \nWorkshop on Risk-based Design of well Casing and Tubing, The Woodlands, \nTexas, USA; 1998. \n[9] Mack R, Filippov A, Kendziora L, Ring L. In-situ expansion of casing and tubing \n– effect on mechanical properties and resistance to sulphide stress cracking,  Paper \nnumber 164, NACE International Corrosion Conference, Houston Texas, USA; \n2000. \n[10] Ugural AC, Fenster SK.  Advanced Strength and Applied Elasticity, 3rd ed., New \nJersey: Prentice-Hall PTR; 1995. \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 18 \n[11] Chakrabarty J. Theory of Plasticity, New York: McGraw-Hill; 1987. \n[12] Bourouga B, Bardon JP. Thermal contact resistance at the interface of double \ntubes assembled by plastic deformation.  Experimental Thermal and Fluid \nScience, 1998; 18: 168-181. \n[13] ABAQUS CAE, Hibbitt, Karlsson and Sorensen, Inc. Pawtucket R.I., USA; 2005. \n \n \n \n \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 19 \nFIGURE CAPTIONS \n \nFigure 1    Illustration of some applications of expandable tubular technology in the oil \nand gas industry. \n \nFigure 2   A schematic diagram showing the configuration of the two concentric pipes, \ngeometric parameters and the swage pressure. \n \nFigure 3  Schematic of the loading and unloading response of (a) swage pressure Ps \nversus hoop strain ε1o at the outer surface of internal pipe 1, and (b) swage \npressure Ps versus hoop strain ε2o at the outer surface of external pipe 2.  \nThe arrows indicate the directions of loading and unloading. \n \nFigure 4   The cross-section of the pipes and, loading before and after contact. \n \nFigure 5 (a) The configuration, dimensions (in mm) and boundary conditions used in \nthe finite element simulation. (b) A schematic of the deformed shape \nobtained from the finite element analysis. \n \nFigure 6  The variation of the post-expansion residual interface pressure along the \ncontact length for two different end support conditions as predicted by the \nfinite element analysis.  The letters A to D relate to the points along the \ndeformed shape as shown in Figure 5. \n \nFigure 7 Finite element prediction of the evolution of the hoop strain at the outer \nsurface of external pipe 2 with the swage pressure.  The arrows in indicate \nthe directions of loading and unloading. \n \nFigure 8    Comparison of the predictions from the theoretical model, finite element \nanalysis and full-size experiments for (a) swage pressure versus hoop strain \nresponse for pipe 2, and (b) swage pressure versus interface pressure \nrelation. The arrows indicate the directions of loading and unloading. \n \nFigure 9 The uniaxial stress – strain response in tension for L80 grade tubular \n   and P110 casing. \n \nFigure 10 A schematic diagram of the experimental setup of the hydraulic expansion \nof  two concentric tubulars. \n \nFigure 11 The effect of relative initial radial clearance on the residual interface \npressure.  The swage pressure was 145 MPa. \n \n \n \n \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 1    \nExpandable \nLiner \nExpandable \nLiner Hanger \nCasing Clad \nTubing \nPatch \nElastomeric plug \nWater\/Gas shut-off \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 2 \nro \nri \nRi \nRo \nδ\n \nSeal \nSeal \nPipe 1 Pipe 2 \nPs \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n       \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 3   \n \n \nPsmax \nPp \nPy \n0 \n1 \n2 3 \n4 \nε1res ε1ο \nPs \n5 \n(a) \nε1c \nPcmax \nε1rec \nPsmax \nPp \n0, 1 \n2, 3 \n5 \n4 \nε2res ε2ο \nPs \n(b) \nε2rec \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\nPipe 2 \nPipe 1 Ps \nδ \nPs \nPc Pc \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Before contact     After contact \n \n \n \n \nFigure 4 \n \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(a) (b) \n \n \nFigure 5  \n \n3048 \n610 \n1033 \n1592 \n423 \n110 \n122 \n125 \n136 \nPs \nA \nD \nB \nC \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n \n0\n20\n40\n60\n80\n0 0.5 1 1.5 2 2.5 3 3.5\nAxial distance along inner surface of pipe 2 (m)\nIn\nte\nrfa\nce\n \npr\nes\nsu\nre\n \nbe\ntw\nee\nn\n \nth\ne \npi\npe\ns \n(M\nPa\n)\nFree ends\nFixed ends\n \n \n \nFigure 6  \nA B C D \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n \n0\n50\n100\n150\n200\n0 0.5 1 1.5 2 2.5 3 3.5\nHoop strain at the outer surface of pipe 2 (%)\nSw\na\nge\n \npr\nes\nsu\nre\n \n(M\nPa\n)\n \n \n \nFigure 7  \n \n \n164 MPa 169 MPa Psmax =  172 MPa \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n \n \n \n0\n50\n100\n150\n200\n0 0.1 0.2 0.3 0.4 0.5\nHoop strain at the outer surface of pipe 2 (%)\nSw\na\nge\n \npr\nes\nsu\nre\n \n(M\nPa\n) Theoretical model\nFinite element\nExperiment\n \n \n \n \n0\n20\n40\n60\n80\n100\n0 50 100 150 200\nSwage pressure (MPa)\nIn\nte\nrf\na\nce\n \npr\nes\nsu\nre\n \n(M\nPa\n)\nTheoretical model\nFinite element\nExperiment\n \n \n \n \nFigure 8  \n \n(a) \n(b) \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n \n \n \n \n0\n200\n400\n600\n800\n1000\n1200\n0 5 10 15 20 25\nUniaxial strain (%)\nUn\nia\nx\nia\nl s\ntr\nes\ns \n(M\nPa\n)\n \n \n \nFigure 9 \n \nL80 \nP110 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n 1 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 10 \n \n2.4 m \n1.65 m \nSeal \nOuter pipe \nInner pipe \n0.413 m 0.413 m \nStrain gauge \nTo hydraulic  \npump \nMandrel Seal \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n \n \n \n \n \n \n \n \nFigure 11 \n"}