{"doi":"10.1109\/IEMBS.2005.1617114","coreId":"102271","oai":"oai:epubs.surrey.ac.uk:1726","identifiers":["oai:epubs.surrey.ac.uk:1726","10.1109\/IEMBS.2005.1617114"],"title":"Intensity Non-uniformity Correction of Magnetic Resonance Images Using a Fuzzy Segmentation Algorithm","authors":["Shen, Shan","Sandham, William A.","Granat, Malcolm H.","Sterr, Annette"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-09-01","abstract":"<p>Artifacts in magnetic resonance images can make conventional intensity-based segmentation methods very difficult, especially for the spatial intensity non-uniformity induced by the radio frequency (RF) coil. The non-uniformity introduces a slow-varying shading artifact across the images. Many advanced techniques, such as nonparametric, multi-channel methods, cannot solve the problem. In this paper, the extension of an improved fuzzy segmentation method, based on the traditional fuzzy c-means (FCM) algorithm and neighborhood attraction, is proposed to correct the intensity non-uniformity. Experimental results on both synthetic non-MR and MR images are given demonstrate the superiority of the algorithm.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1726<\/identifier><datestamp>\n      2017-10-31T14:02:53Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:50737963686F6C6F6779<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1726\/<\/dc:relation><dc:title>\n        Intensity Non-uniformity Correction of Magnetic Resonance Images Using a Fuzzy Segmentation Algorithm<\/dc:title><dc:creator>\n        Shen, Shan<\/dc:creator><dc:creator>\n        Sandham, William A.<\/dc:creator><dc:creator>\n        Granat, Malcolm H.<\/dc:creator><dc:creator>\n        Sterr, Annette<\/dc:creator><dc:description>\n        <p>Artifacts in magnetic resonance images can make conventional intensity-based segmentation methods very difficult, especially for the spatial intensity non-uniformity induced by the radio frequency (RF) coil. The non-uniformity introduces a slow-varying shading artifact across the images. Many advanced techniques, such as nonparametric, multi-channel methods, cannot solve the problem. In this paper, the extension of an improved fuzzy segmentation method, based on the traditional fuzzy c-means (FCM) algorithm and neighborhood attraction, is proposed to correct the intensity non-uniformity. Experimental results on both synthetic non-MR and MR images are given demonstrate the superiority of the algorithm.<\/p><\/dc:description><dc:date>\n        2005-09-01<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1726\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Shen, Shan, Sandham, William A., Granat, Malcolm H. and Sterr, Annette  (2005) Intensity Non-uniformity Correction of Magnetic Resonance Images Using a Fuzzy Segmentation Algorithm  In: 2005 IEEE Engineering in Medicine and Biology 27th Annual Conference.     <\/dc:identifier><dc:relation>\n        10.1109\/IEMBS.2005.1617114<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1726\/","10.1109\/IEMBS.2005.1617114"],"year":2005,"topics":[],"subject":["Conference or Workshop Item","PeerReviewed"],"fullText":"Intensity Non-uniformity Correction of Magnetic\nResonance Images Using a Fuzzy Segmentation\nAlgorithm\nS. Shen1, W. A. Sandham2, M. H. Granat3, A. Sterr1\n1Department of Psychology, University of Surrey, UK\n2Scotsig, Glasgow, UK\n3Glasgow Caledonian University, Glasgow, UK\nAbstract- Artifacts in magnetic resonance images can make\nconventional intensity-based segmentation methods very difficult,\nespecially for the spatial intensity non-uniformity induced by the\nradio frequency (RF) coil. The non-uniformity introduces a\nslow-varying shading artifact across the images. Many advanced\ntechniques, such as nonparametric, multi-channel methods,\ncannot solve the problem. In this paper, the extension of an\nimproved fuzzy segmentation method, based on the traditional\nfuzzy c-means (FCM) algorithm and neighborhood attraction, is\nproposed to correct the intensity non-uniformity. Experimental\nresults on both synthetic non-MR and MR images are given to\ndemonstrate the superiority of the algorithm.\nI. INTRODUCTION\nMagnetic resonance imaging (MRI) is an advanced medical\nimaging technique, which provides rich information about\nhuman anatomical structure due to its high spatial resolution\nand excellent discrimination of soft tissues. Brain is the most\ncomplex organ in the human body, and therefore segmentation\nof brain MR images is an important technique for facilitating\nan image-based diagnosis, especially for the analysis of brain\ntumors. Unfortunately, manual segmentation of different\ntissues is very time-consuming due to the large amount of data\ninvolved. A number of supervised and unsupervised\ntechniques have therefore been proposed in recent years for\nautomatic segmentation of MR images. However, their\neffectiveness is deteriorated by spatial intensity\nnon-uniformity, also called the bias field, induced by the radio\nfrequency (RF) used during MRI acquisition [1, 2]. This is a\nmajor problem for automated segmentation techniques.\nSpecifically, these artifacts have made conventional\nintensity-based segmentation very difficult, since the statistics\nof tissue intensities are spatially altered by the bias field. A\nwide variety of approaches have therefore been developed for\nintensity non-uniformity correction. Tincher et al [3] modeled\nthe bias field using a second-order polynomial and fitted it to\na uniform phantom-scanned MRI. However, it required the\ngeometry relationship between the coils and the image data,\nwhich is not usually available. Wells et al [4] presented a\nmethod called adaptive segmentation to correct and segment\nMR images, using the expectation-maximization (EM)\nalgorithm. This is a very popular method for non-uniformity\ncorrection and is used by many other researchers [5].\nHowever, there are two main disadvantages of EM approaches.\nFirst, the EM algorithm is computationally intensive,\nespecially for large data sets. Second, the EM algorithm\nrequires a reasonable initial guess for either the bias field or\nthe clustering estimate; otherwise the algorithm could become\neasily trapped in a local minimum. In this paper, a different\napproach using a fuzzy clustering technique is described. It is\nbased on the traditional fuzzy c-means (FCM) clustering\nalgorithm and considers neighborhood attraction to correct the\nintensity non-uniformity during segmentation.\nThe paper is organized as follows. Section II describes the\nmethodology of the procedure. Section III then validates the\nmethod using synthetic non-MR and MR images. Conclusions\nare summarized in Section IV.\nII. METHODOLOGY\nA. Background\nLet { }1 2, , , , ,j NX X X X X= \u0016 \u0016 be the observed MRI\nintensities (with artifacts) and { }1 2, , , , ,j NX X X X X∗ ∗ ∗ ∗ ∗= \u0016 \u0016\nbe the ideal intensities (without artifacts). N is the number of\npixels in the image. The bias field is denoted by\nProceedings of the 2005 IEEE\nEngineering in Medicine and Biology 27th Annual Conference\nShanghai, China, September 1-4, 2005\n0-7803-8740-6\/05\/$20.00 ©2005 IEEE. 3035\n{ }1 2, , , , ,j NB B B B B= \u0016 \u0016 . The observed MRI intensity is\nmodeled as a product of the true signal generated by the\nunderlying anatomy and the bias field, expressed as follows:\n( 1 )j j jX X B j N∗= × = \u0015 (1)\nThe application of a logarithmic transformation to the\nintensities allows the bias field to be modeled as an addition\nto the ideal intensities. Let jx and j\n∗x denote the observed\nand ideal log-transformed intensities of the j-th pixel. jβ is\nthe log-transformed bias field of the j-th pixel. So,\njjj β+= *xx (2)\njβ is modeled by an N-dimensional zero-mean Gaussian\nprior probability density, which is one of the most successful\nmodels [2, 4, 5]. It is defined as follows,\n1\n1 0\nN\nj\njN\nβ\n=\n=¦ (3)\nB. Improved Fuzzy Segmentation Method\nThe improved fuzzy c-means clustering (IFCM) algorithm\nis a segmentation method which was proposed to overcome\nnoise effects in MR images. Instead of modifying the\nobjective function in the traditional FCM algorithm [6], it\nimproves the similarity measurement of the pixel intensity and\nthe cluster centre by considering neighborhood attraction.\nDetails of the algorithm can be found in [7, 8].\nThe objective function is expressed as follows:\n2\n1 1\n( , ) ( , )\nN C\nm\nm ij j i\nj i\nJ U V d\n= =\n=¦¦u x v (4)\nwhere jx represents the pixel intensity of the j-th voxel\nand ij U⊆u is its membership function to the i-th cluster,\nwhich satisfies [0,1]ij ∈u ,\n1\n1\nC\nij\ni=\n=¦u .\n{ }, , , , ,1 2 i CV = v v v v\u0016 \u0016 denotes the intensity center of\nthe clusters, and C is the total number of clusters in the image.\n),(2 ijd vx was described as a similarity measurement\nbetween the pixel intensity and the cluster center in FCM.\nSince the intensity of a pixel should be identical to its\nneighboring pixels, an attraction is supposed to exist between\nthose pixels nearby. Therefore, 2 ( , )j id x v was modified in\nIFCM as follows,\n( )22 ( , ) 1j i j i ij ijd H Fλ ξ= − − −x v x v (5)\nwhere Hij and Fij are two factors of the neighbourhood\nattraction, called feature attraction and distance attraction. λ\nand ξ adjust the degree of attraction and have a magnitude\nbetween 0 and 1.\n⋅\nis regarded as a Euclidean distance.\nC. Bias Field Estimation\nSince the objective function must be minimized in IFCM,\nby considering the model in eq.(3), the constrained\noptimization may be expressed using Lagrange multipliers,\n2\n1 1 1\n1( , ) ( , ) ( )\nN C N\nm\nm ij j i j\nj i j\nJ U V d\nN\nη β\n= = =\n= +¦¦ ¦u x v (6)\nTaking the derivative of\nmJ with respect to jβ and setting the\nresult to zero,\n2\n1\n(1 ) 2 0\nC\nmm\nij j j i\nij\nJ\nH F\nN\nηλ ξ ββ\n=\n∂\n= − − ⋅ − − + =\n∂ ¦u x v (7)\nLet 1M H Fλ ξ= − − , and redefine\nN\nηη = ,\n02\n1\n2\n=+−−⋅¦\n=\nηβC\ni\nijj\nm\nij M vxu\n2\n1\n2 2\n1 1\n2\nC\nm\nij i\ni\nj j C C\nm m\nij ij\ni i\nM\nM M\nηβ =\n= =\n= − +\n¦\n¦ ¦\nu v\nx\nu u\n(8)\nAccording to eq.(3),\n2\n1\n2 21 1 1 1\n1 1\n0\n2\nC\nm\nij iN N N N\ni\nj j C C\nm mj j j j\nij ij\ni i\nM\nM M\nηβ =\n= = = =\n= =\n= − + =\n¦¦ ¦ ¦ ¦¦ ¦\nu v\nx\nu u\n(9)\n2\n1\n21\n1\n1\n2\n1 1\n2\nC\nm\nij iN\ni\njC\nmj\nij\ni\nN C\nm\nij\nj i\nM\nM\nM\nη\n=\n=\n=\n−\n= =\n§ ·¨ ¸¨ ¸\n−¨ ¸¨ ¸© ¹\n=\n§ ·\n⋅¨ ¸© ¹\n¦¦ ¦\n¦ ¦\nu v\nx\nu\nu\n(10)\nSubstituting eq.(10) into eq.(8), the bias field may be\nestimated as follows,\n( )\n1\n1\n2 2\n1 1 1\nN\nj j\nj\nj j j C N C\nm m\nij ij\ni j i\np\np\nM M\nβ =\n−\n= = =\n−\n= − −\n§ ·\n⋅ ¨ ¸© ¹\n¦\n¦ ¦ ¦\nx\nx\nu u\n(11)\nwhere\n2\n1\n2\n1\nC\nm\nij i\ni\nj C\nm\nij\ni\nM\np\nM\n=\n=\n=\n¦\n¦\nu v\nu\n.\n3036\nGenerally, the bias field is a very smooth field. It has\nalways been modeled as a linear combination of smooth basis\nfunctions [9, 10]. In this case, the bias field is smoothed by a\ntwo-dimensional Gaussian function,\n2\n2\n( )\nexp jj j\nµβ β\nσ\n§ ·− −\n= ∗ ¨ ¸¨ ¸© ¹\nx (12)\nThe cluster intensity center of IFCM is modified as follows,\n1\n1\n( ) ( )\n( )\nN\nm\nij j j\nj\ni N\nm\nij\nj\nβ\n=\n=\n−\n=\n¦\n¦\nu x\nv\nu\n(13)\nD. Implementation of the IFCM Algorithm\nThe IFCM algorithm iteratively optimizes ( , )mJ U V with\nthe continuous update of the membership function and the\ncluster center. The basic steps of this algorithm are given as\nfollows:\n1. Determine the number of clusters C, 2 C N≤ ≤ .\n2. Initialize the fuzzy membership (0)iju of jx belonging to\nthe i-th cluster.\n3. Initialize the bias field, 0jβ = .\n4. At the l-th iteration, calculate the cluster intensity\ncentre ( )liv using eq.(13), 1,2, ,i C= \u0016 .\n5. Calculate the extended 2 ( )( , )lj id x v in eq.(5).\n6. Update ( )liju with\n2 ( )( , )lj id x v as follows,\n¦\n=\n−\n¸¸¹\n·\n¨¨©\n§\n=\nC\nk\nm\nij\ni\nij\nd\nd\n1\n1\n2\n),(\n),(\n1\nvx\nvx\nu\nj\n7. Estimate the bias field using eq.(11) and smooth it\nusing a Gaussian function\n8. Compare ( )liju and\n( 1)l\nij\n−u . If ( ) ( 1)l lij ij ε\n−\n− <u u then stop,\notherwise l = l+1, go to Step 4 and repeat.\nIII. RESULTS\nIn this section, the improved fuzzy clustering method is\napplied to synthetic non-MR images corrupted with a\nmultiplicative bias field, and simulated MR images with a\n40% bias field. The parameters λ and ξ in eq.(5) were\nestablished as 0.47 and 0.53, respectively, by trial and error.\nFig. 1(a) shows a two-class synthetic image corrupted by a\nGaussian bias field. The segmentation results of FCM and\nIFCM are shown in Figs. 1(b) and 1(c), respectively. These\ndemonstrate that the traditional FCM method was unable to\novercome the effect of the intensity non-uniformity, whereas\nIFCM segmentation achieved the correct result.\nAnother synthetic image with four classes is shown in Fig.\n2(a). It also contained a Gaussian bias field. Fig. 2(b) displays\nthe estimated bias field and 2(c) shows the corrected image.\nTo further demonstrate the ability of the extended IFCM\nmethod, a simulated MR image was downloaded from Brain\nWeb (http:\/\/www.bic.mni.mcgill.ca\/brainweb), a MRI\nsimulated brain database [11-14]. It was a T1-weighted image\nwith 1% noise and 40% non-uniformity. Fig. 3(a) shows the\noriginal simulated MR image and Fig. 3(b) shows the\ncorrected image using the extended IFCM method. The image\nwas segmented into four classes corresponding to background,\ngray matter, white matter and cerebral spinal fluid (CSF). The\nsegmentation results of FCM and IFCM are given in Figs. 3(c)\nand 3(d), respectively. These demonstrate that the FCM\nalgorithm was affected by the non-uniformity, while the\nextended IFCM algorithm not only succeeded in segmenting\nthe image but also estimated the bias field (Fig. 3(e)).\nHowever, using the extended IFCM algorithm specifically\nfor the bias field estimation may lead to the loss of some\nimage detail. Further work is required to solve this problem.\n(a)\nFigure 2 Synthetic image II for bias field estimation. (a) Image corrupted by\na Gaussian bias field. (b) Estimated bias field. (c) IFCM segmentation result.\n(c)(b)\nFigure 1 Synthetic image I. (a) Image corrupted by a Gaussian bias field. (b)\nFCM segmentation result. (c) IFCM segmentation result.\n(b) (c)(a)\n3037\nIV. CONCLUSIONS\nThis paper has presented an improved fuzzy c-means\nclustering algorithm (IFCM) for the intensity non-uniformity\ncorrection of brain MR images. The traditional FCM\nalgorithm is based on minimizing an objective function,\ndefined by the difference between the intensity centers of the\nclusters and the signal intensities of pixels. However, MR\nimages always include an intensity non-uniformity caused by\nthe RF coil in MRI acquisition, which may introduce\nunexpected intensity values of the pixels. This may cause an\ninaccurate segmentation. The improved FCM algorithm was\ndeveloped to solve this problem. It assumes that a\nneighborhood attraction exists between two neighboring\npixels. During clustering, each pixel attempts to attract its\nneighboring pixels towards its own cluster. Therefore, in the\nIFCM algorithm, segmentation is not only decided by the\npixel intensity, but also by its neighbors. The presence of the\nbias field changes the intensities of some pixels; these may be\nsegmented more appropriately with the help of their neighbors.\nThe bias field is modeled by a zero mean Gaussian field and\nestimated during the process of segmentation.\nDifferent types of synthetic images with an intensity\nnon-uniformity were employed for demonstration. The bias\nfields were corrected and estimated using IFCM. The\nsegmentation results validated the superiority of IFCM over\nthe traditional FCM algorithm. The drawback of IFCM for the\nbias field estimation is the loss of some image detail.\nFuture work will investigate reducing the loss of image\ndetail during bias field estimation, and validating the IFCM\nalgorithm on real MR images.\nREFERENCES\n[1] B. W. Dawant, A. P. Zijdenbos, and R. A. Margolin, “Correction of\nintensity variations in MR Images for computer-aided tissue\nclassification,” IEEE Trans. Medical Imaging, vol. 12, no. 4, pp.\n770-781, 1993.\n[2] M. N. Ahmed, S. M. Yamany, A. A. Farag and T. Moriarty, “Amodified\nfuzzy c-means algorithm for bias field estimation and segmentation of\nMRI data,” IEEE Trans. Medical Imaging, vol. 21, no. 3, pp. 193-199,\n2002.\n[3] M. Tincher, C. R.Meyer, R. Gupta and D. M. Williams, “Polynomial\nmodeling and reduction of RF body coil spatial inhomogeneity in MRI,”\nIEEE Trans. Medical Imaging, vol. 12, no. 2, pp. 361-365, 1993.\n[4] W. M. Wells, III, W. E. L. Grimson, R. Kikinis and F. A. Jolesz,\n“Adaptive segmentation of MRI data,” IEEE Trans. Medical Imaging,\nvol. 15, no. 4, pp. 429-442, 1996.\n[5] Y. Y. Zhang, M. Brady and S. Smith, “Segmentation of brain MR\nimages through a hidden markov random field model and the\nexpectation-maximization algorithm,” IEEE Trans. Medical Imaging,\nvol. 20, no.1, pp. 45-57, 2001.\n[6] J. C. Bezek, Pattern Recognition with fuzzy object function algorithms,\nPlenum Press, 1981.\n[7] S. Shen, W. A. Sandham, M. H. Grant, J. Patterson and M. F. Dempsey,\n“Fuzzy clustering based applications to medical image processing,”\nProc. IEEE EMBS 25th Annu. Int. Conf., pp. 747-750, 2003.\n[8] S. Shen, W. A. Sandham, M. H. Grant, A. Sterr, “MRI fuzzy\nsegmentation of brain tissue using neighborhood attraction with neural\nnetwork optimization,” IEEE Trans. Inf. Technol. Biomed., Accepted.\n[9] J. G. Sled, B. Zijdenbos and A. C. Evans, “A nonparametric method for\nautomatic correction of intensity nonuniformity in MRI data,” IEEE\nTrans. Medical Imaging, vol. 17, pp. 89-97, 1998.\n[10] K. V. Leemput, F. Maes, D. Vandermeulen, and P. Suetens, “Automated\nmodel based bias field correction of MR images of the brain,” IEEE\nTrans. Medical Imaging, vol. 18, pp. 885-896, 1999.\n[11] C. A. Cocosco, V. Kollokian, R. K. -S. Kwan and A.C. Evans,\n“BrainWeb: Online Interface to a 3D MRI Simulated Brain Database,”\nNeuroImage, vol. 5, no. 4, part 2\/4, S425, 1997.\n[12] R. K. S. Kwan, A. C. Evans and G. B. Pike, “An Extensible MRI\nSimulator for Post-Processing Evaluation,” Visualization in Biomedical\nComputing (VBC'96). Lect. Notes. Comput SC, vol. 1131, pp. 135-140,\nSpringer-Verlag, 1996.\n[13] R. K. S. Kwan, A. C. Evans and G. B. Pike, “MRI simulation-based\nevaluation of image-processing and classification methods,” IEEE Trans.\nMed. Imag., vol. 18, no. 11, pp.1085-1097, 1999.\n[14] D. L. Collins, A. P. Zijdenbos, V. Kollokian, J. G. Sled, N. J. Kabani, C.\nJ. Holmes, and A. C. Evans, “Design and construction of a realistic\ndigital brain phantom,” IEEE Trans. Med. Imag., vol. 17, no. 3,\npp.463-468, 1998.\n(e)\n(d)(c)\n(b)(a)\nFigure 3 Simulated MR image. (a) Original image. (b) Corrected image. (c)\nFCM segmentation result. (d) IFCM segmentation result. (e) Estimated bias\nfield\n3038\n"}