{"doi":"10.1088\/0954-3899","coreId":"100736","oai":"oai:epubs.surrey.ac.uk:131","identifiers":["oai:epubs.surrey.ac.uk:131","10.1088\/0954-3899"],"title":"Decays of J\/ psi and psi-prime into vector and pseudoscalar meson and the pseudoscalar glueball-q anti-q mixing.","authors":["Li, Gang","Zhao, Qiang","Chang, Chao-Hsi"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-03-18","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:131<\/identifier><datestamp>\n      2017-10-31T13:56:54Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/131\/<\/dc:relation><dc:title>\n        Decays of J\/ psi and psi-prime into vector and pseudoscalar meson and the pseudoscalar glueball-q anti-q mixing.<\/dc:title><dc:creator>\n        Li, Gang<\/dc:creator><dc:creator>\n        Zhao, Qiang<\/dc:creator><dc:creator>\n        Chang, Chao-Hsi<\/dc:creator><dc:date>\n        2008-03-18<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/131\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Li, Gang, Zhao, Qiang and Chang, Chao-Hsi  (2008) Decays of J\/ psi and psi-prime into vector and pseudoscalar meson and the pseudoscalar glueball-q anti-q mixing.   Journal of Physics G: Nuclear and Particle Physics, 35 (055002).       <\/dc:identifier><dc:relation>\n        10.1088\/0954-3899\/35\/5\/055002<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/131\/","10.1088\/0954-3899\/35\/5\/055002"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Decays of J\/ψ and ψ′ into vector and pseudoscalar meson and the\npseudoscalar glueball-qq¯ mixing\nGang Li1, Qiang Zhao1,2\n1) Institute of High Energy Physics, Chinese Academy of Sciences, Beijing, 100049, P.R. China and\n2) Department of Physics, University of Surrey, Guildford, GU2 7XH, United Kingdom\nChao-Hsi Chang3,4\n3) CCAST (World Laboratory), P.O. Box 8730, Beijing 100080, P.R. China and\n4) Institute of Theoretical Physics, Chinese Academy of Sciences, Beijing, 100080, P.R. China\n(Dated: February 18, 2008)\nWe introduce a parametrization scheme for J\/ψ(ψ′)→ V P where the effects of SU(3) flavor sym-\nmetry breaking and doubly OZI-rule violation (DOZI) can be parametrized by certain parameters\nwith explicit physical interpretations. This scheme can be used to clarify the glueball-qq¯ mixing\nwithin the pseudoscalar mesons. We also include the contributions from the electromagnetic (EM)\ndecays of J\/ψ and ψ′ via J\/ψ(ψ′) → γ∗ → V P . Via study of the isospin violated channels, such\nas J\/ψ(ψ′) → ρη, ρη′, ωpi0 and φpi0, reasonable constraints on the EM decay contributions are\nobtained. With the up-to-date experimental data for J\/ψ(ψ′)→ V P , J\/ψ(ψ′)→ γP and P → γγ,\netc, we arrive at a consistent description of the mentioned processes with a minimal set of parame-\nters. As a consequence, we find that there exists an overall suppression of the ψ′ → 3g form factors,\nwhich sheds some light on the long-standing “ρpi puzzle”. By determining the glueball components\ninside the pseudoscalar η and η′ in three different glueball-qq¯ mixing schemes, we deduce that the\nlowest pseudoscalar glueball, if exists, has rather small qq¯ component, and it makes the η(1405) a\npreferable candidate for 0−+ glueball.\nPACS numbers: 13.20.Gd, 12.40.Vv, 13.25.-k, 12.39.Mk\nI. INTRODUCTION\nCharmonium decays into light hadrons provides unique places to probe light hadron structures. In\nparticular, in the hadronic decays of charmonia such as J\/ψ, ηc and χcJ etc, the annihilation of the heavy\ncc¯ pair into intermediate gluons, which must be then hadronized into hadrons, could favor the production\nof unconventional hadrons such as glueball and hybrids in the final-state. Such states, different from the\nconventional qq¯ or qqq structures in the non-relativistic constituent quark model, can serve as a direct\ntest of QCD as a non-Abelian gauge theory.\nIn the past decades, the exclusive hadronic decays of J\/ψ(ψ′)→ V P have attracted a lot of attention\nin both experiment and theory. These processes, in which the helicity is non-conserved, must be sup-\npressed according to the selection rule of pQCD hadronic helicity conservation due to the vector nature\nof gluons [1]. According to the “pQCD power” suppression of helicity conservation and breaking, one\nshould have BR(ψ′ → ρπ)\/BR(J\/ψ → ρπ) ≃ (MJ\/ψ\/Mψ′)6 ∼ 0.35 [1]. However, the experimental data\nshow that this ratio is badly violated in reality, BR(ψ′ → ρπ)\/BR(J\/ψ → ρπ) ≃ (0.2 ± 0.1)% [2], i.e.\nmuch greatly suppressed. It led to the so-called “ρπ puzzle” in the study of J\/ψ and ψ′ exclusive decays,\nand initiated a lot of interests to the relevant issues [3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17].\nAn alternative expression of the “ρπ puzzle” is via the ratios between J\/ψ and ψ′ annihilating into three\ngluons and a single photon:\nR ≡ BR(ψ\n′ → hadrons)\nBR(J\/ψ → hadrons)\n≃ BR(ψ\n′ → e+e−)\nBR(J\/ψ → e+e−) ≃ 12%, (1)\n2which is empirically called “12% rule”. Since most of those exclusive decays for J\/ψ and ψ′ seem to\nabide by this empirical rule reasonably well, it is puzzling that the ratios for ρπ and K∗K¯ + c.c. deviate\ndramatically from it. A recent article by Mo, Yuan and Wang provides a detailed review of the present\navailable explanations (see Ref. [18] and references therein).\nA catch-up of this subject is an analysis by authors here for the electromagnetic decays of J\/ψ(ψ′)→\nγ∗ → V P [19]. There, it is shown that although the EM contributions to J\/ψ → V P are generally small\nrelative to the strong decays as found by many other studies [20], they may turn to be more competitive\nin ψ′ → V P compared with ψ′ → 3g → V P amplitudes, and produce crucial interferences [19]. For a\nbetter understanding of the “ρπ puzzle”, a thorough study of J\/ψ(ψ′)→ V P including both strong and\nEM transitions and accommodating the up-to-date experimental information [21, 22, 23, 24] should be\nnecessary.\nThe reaction channels J\/ψ(ψ′)→ V P also give access to another interesting issue in non-perturbative\nQCD. They may be used to probe the structure of the isoscalar 0−+, i.e. η and η′ in their recoiling isoscalar\nvector mesons ω or φ. Since vector meson ω and φ are almost ideally mixed, i.e. ω = (uu¯+ dd¯)\/\n√\n2 and\nφ = ss¯, the decay of J\/ψ(ψ′)→ ωη, ωη′, φη, and φη′ will provide information about η and η′, which can\nbe produced via the so-called singly OZI disconnected (SOZI) processes for the same flavor components,\nand doubly OZI disconnected (DOZI) processes for different flavor components.\nNonetheless, it can also put experimental constraints on the octet-singlet mixing as a consequence of\nthe U(1)A anomaly of QCD [25, 26, 27, 28, 29, 30, 31, 32, 33]. Recently, Leutwyler [32], and Feldmann\nand his collaborators [33] propose a η-η′ mixing scheme in the quark flavor basis with an assumption that\nthe decay constants follow the pattern of particle state mixing, and thus are controlled by specific Fock\nstate wavefunctions at zero separation of the quarks, while the state mixing is referred to the mixing in\nthe overall wavefunctions. In the quark flavor basis it is shown that higher Fock states (specifically, |gg〉)\ndue to the anomaly give rise to a relation between the mixing angle and decay constants. This analysis\nbrings the question of gluon components inside η and η′ to much closer attention from both experiment\nand theory [33, 34], and initiates a lot of interests in the pseudoscalar sector, in particular, in line with\nthe search for pseudoscalar glueball candidates.\nThe lattice QCD (LQCD) calculations predict a mass for the lowest pseudoscalar glueball around 2.5\nGeV [35], which is higher than a number of 0−+ resonances observed in the range of 1∼ 2.3 GeV. However,\nsince the present LQCD calculations are based on quenched approximation, the glueball spectrum is still\nan open question in theory. In contrast, QCD phenomenological studies [36, 37, 38, 39] favor a much\nlower 0−+ glueball mass, and make η(1405) a good glueball candidate due to its strong couplings to KK¯π\nand a0(980)π and absence in γγ → KK¯π and ηππ [2]. Study of J\/ψ → V P in flavor parametrization\nschemes was pursued in Ref. [20], where the η and η′ were treated as eigenstates of qq¯. By assuming the\nη(1405) to be a glueball essentially and introducing a DOZI suppression factor for φG and ωG amplitudes\nrelative to the SOZI processes, the authors seemed to have underestimated the branching ratios for\nBR(J\/ψ → φη(1405)) and BR(J\/ψ → ωη(1405)). In Ref. [40] a mixing scheme for η, η′ and η(1405)\nin a basis of (uu¯ + dd¯)\/\n√\n2, ss¯ and G (glueball) was proposed and studied in J\/ψ → V P . η(1405) was\nfound to be dominated by the glueball component, while the glueball component in η′ was also sizeable.\nIn both studies, the EM contributions were included as a free parameter in J\/ψ → V P . However, as we\nnow know that the EM contributions in ψ′ are important [19]. Thus, a coherent study of J\/ψ(ψ′)→ V P\nincluding the EM contributions would be ideal for probing the structure of the pseudoscalar mesons.\nOn the theoretical side there is only one possible term in the effective Lagrangian for J\/ψ(ψ′)→ V P\nand it will reduce the number of the parameters needed in phenomenological studies. On the experimental\nside many new data with high accuracy are available. Hence, in this work, we shall revisit J\/ψ(ψ′)→ V P\ntrying to clarify the following points: (i) What is the role played by the EM decay transitions? By isolating\nand constraining the EM transitions in a VMD model, we propose a parametrization scheme for the strong\ntransitions where the SU(3) flavor symmetry breaking and DOZI violation effects can be accommodated.\nA reliable calculation of the EM transitions in turn will put a reasonable constraint on the strong decay\ntransitions in J\/ψ(ψ′) → V P , and thus mechanisms leading to the “ρπ puzzle” can be highlighted. (ii)\nWe shall probe the glueball components within η and η′ based on the available experimental data and\ndifferent quarkonia-glueball mixing schemes, and predict the 0−+ glueball production rate in J\/ψ(ψ′)\nhadronic decays.\nAs follows, we first present the parametrization scheme for J\/ψ(ψ′)→ V P and introduce the glueball\n3components into the pseudoscalars. We then briefly discuss the VMD model for J\/ψ(ψ′) → γ∗ → V P .\nIn Section III, we present the model calculation results with detailed discussions. A summary will be\ngiven in Section IV.\nII. MODEL FOR J\/ψ(ψ′)→ V P\nIn this Section, we first introduce a simple rule to parametrize out the strong decays of J\/ψ(ψ′)→ V P .\nWe then introduce a VMD model for the J\/ψ(ψ′) EM decays into V P . A recent study of J\/ψ(ψ′) →\nγ∗ → V P shows that the EM decay contributions become important in ψ′ decays due to its large partial\ndecay width to e+e− though their importance is not so significant in J\/ψ → V P [19]. In the isoscalar\npseudoscalar sector, we introduce three different glueball-qq¯ mixing schemes for η, η′ and a glueball\ncandidate η′′. Its production in J\/ψ(ψ′) hadronic decays can then be factorized out and estimated.\nA. Decay of J\/ψ(ψ′)→ V P via strong interaction\nThe strong decay of J\/ψ(ψ′)→ V P via 3g can be factorized out in a way similar to Ref. [41].\nFirst, we define the strength of the non-strange singly OZI disconnected (SOZI) process as\ngJ\/ψ(ψ′) ≡ 〈(qq¯)V (qq¯)P |V0|J\/ψ(ψ′)〉, (2)\nwhere V0 denotes the 3g decay potential of the charmonia into two non-strange qq¯ pairs of vector and\npseudoscalar via SOZI processes. But it should be noted that the subscription V and P do not mean\nthat the quark-antiquark pairs are flavor eigenstates of vector and pseudoscalar mesons. The amplitude\ngJ\/ψ(ψ′) is proportional to the charmonium wavefunctions at origin. Thus, it may have different values\nfor J\/ψ and ψ′.\nIn order to include the SU(3) flavor symmetry breaking effects in the transition, we introduce\nR ≡ 〈(qs¯)V (sq¯)P |V0|J\/ψ(ψ′)〉\/gJ\/ψ(ψ′) = 〈(sq¯)V (qs¯)P |V0|J\/ψ(ψ′)〉\/gJ\/ψ(ψ′), (3)\nwhich implies the occurrence of the SU(3) flavour symmetry breaking at each vertex where a pair of ss¯ is\nproduced, and R = 1 is in the SU(3) flavour symmetry limit. For the production of two ss¯ pairs via the\nSOZI potential, the recognition of the SU(3) flavor symmetry breaking in the transition is accordingly\nR2 ≃ 〈(ss¯)V (ss¯)P |V0|J\/ψ(ψ′)〉\/gJ\/ψ(ψ′) . (4)\nSimilar to Ref. [41], the DOZI process is distinguished from the SOZI ones by the gluon counting rule.\nA parameter r is introduced to describe the relative strength between the DOZI and SOZI transition\namplitudes:\nr ≡ 〈(ss¯)V (qq¯)P |V1|J\/ψ(ψ′)〉\/gJ\/ψ(ψ′) = 〈(qq¯)V (ss¯)P |V1|J\/ψ(ψ′)〉\/gJ\/ψ(ψ′), (5)\nwhere V1 denotes the charmonium decay potential via the DOZI processes; In the circumstance that the\nOZI rule is respected, one expects |r| ∼ 0.\nThrough the above definitions, we express the amplitudes for J\/ψ(ψ′)→ V (qq¯)P as\nMK∗+K− = 〈K∗+K−|V0|J\/ψ(ψ′)〉 = gJ\/ψ(ψ′)R , (6)\nMρ+pi− = 〈ρ+π−|V0|J\/ψ(ψ′)〉 = gJ\/ψ(ψ′) , (7)\nMρ0pi0 = 〈ρ0π0|V0|J\/ψ(ψ′)〉 = gJ\/ψ(ψ′) , (8)\nMφ(ss¯) = 〈φ(ss¯)P |V0 + V1|J\/ψ(ψ′)〉 = R2gJ\/ψ(ψ′)(1 + r), (9)\nMφ(nn¯) = 〈φ(nn¯)P |V1|J\/ψ(ψ′)〉 =\n√\n2r〈φ(ss¯)P |V0|J\/ψ(ψ′)〉 =\n√\n2rRgJ\/ψ(ψ′), (10)\nMω(ss¯) = 〈ω(ss¯)P |V1|J\/ψ(ψ′)〉 =\n√\n2RrgJ\/ψ(ψ′), (11)\nMω(nn¯) = 〈ω(nn¯)P |V0 + V1|J\/ψ(ψ′)〉 = gJ\/ψ(ψ′)(1 + 2r), (12)\n4where the channels KK¯∗ and ρ−π+ have the same expressions as their conjugate channels; nn¯ ≡ (uu¯+\ndd¯)\/\n√\n2 is the non-strange isospin singlet. We have assumed that φ and ω are ideally mixed and they are\npure ss¯ and nn¯, respectively.\nThe recoiled pseudoscalars by φ and ω can be either η or η′ for which we consider that a small glueball\ncomponent will mix with the dominant qq¯ in the quark flavour basis. The detailed discussion about the\nqq¯ and glueball mixings in η and η′ will be given in the next section. Here, we relate the production of\nglueball G in J\/ψ(ψ′)→ ωG and φG with the basic amplitude gJ\/ψ(ψ′) by assuming the validity of gluon\ncounting rule in the transitions [41, 42], i.e.\n〈(qq¯)VG|V3|J\/ψ(ψ′)〉 ≡ gJ\/ψ(ψ′) , (13)\nwhere V3 denotes the glueball G production potential recoiling a flavour singlet qq¯. This can be regarded\nas reasonable since generally the glueball does not pay a price for its couplings to gluons. Consequently,\nwe have\nMφG = 〈φG|V3|J\/ψ(ψ′)〉 = gJ\/ψ(ψ′)R\nMωG = 〈ωG|V3|J\/ψ(ψ′)〉 =\n√\n2gJ\/ψ(ψ′) , (14)\nwith the SU(3) flavor symmetry breaking considered for the φ production.\nThe above parametrization highlights several interesting features in those decay channels. It shows\nthat the decay of J\/ψ(ψ′) → ρπ is free of interferences from the DOZI processes and possible SU(3)\nflavor symmetry breaking. Ideally, such a process will be useful for us to determine gJ\/ψ(ψ′). The decay\nof J\/ψ(ψ′)→ K∗K¯+c.c. is also free of DOZI interferences, but correlates with the SU(3) breaking. These\ntwo sets of decay channels will, in principle, allow us to determine the basic decay amplitude gJ\/ψ(ψ′)\nand the SU(3) flavor breaking effects, which can then be tested in other channels. For φη, φη′, ωη and\nωη′, the transition amplitudes will also depend on the η-η′ mixing angles and we will present detailed\ndiscussions in later part.\nIn the calculation of the partial decay width, we must apply the commonly used form factor\nF2(P) ≡ |P|2l exp(−P2\/8β2), (15)\nwhere P and the l are the three momentum and the relative orbit angular momentum of the final-\nstate mesons, respectively, in the J\/ψ(ψ′) rest frame. We adopt β = 0.5GeV, which is the same as\nRefs. [42, 43, 44]. At leading order the decays of J\/ψ(ψ′) → V P are via P -wave, i.e. l = 1. This form\nfactor accounts for the size effects from the spatial wavefunctions of the initial and final-state mesons.\nB. Decay of J\/ψ(ψ′)→ V P via EM interaction\nDetailed study of J\/ψ(ψ′) → γ∗ → V P in a VMD model is presented in Ref. [19]. In this process,\nthree independent transitions contribute to the total amplitude as shown by Fig. 2. The advantage of\ntreating this process in the VMD model is to benefit from the available experimental information for all\nthose coupling vertices. As a result the only parameter present in the EM transition amplitude is the\nform factor for the virtual photon couplings to the initial (J\/ψ and ψ′) and final state vector mesons (ω,\nφ, ρ and K∗). As shown in Ref. [19], the isospin violated channels, ρη, ρη′, ωπ and φπ, provides a good\nconstraint on the γ∗V P form factors without interferences from the strong decays. Therefore, a reliable\nestimate of the EM transitions can be reached.\nFollowing the analysis of Ref. [19], the invariant transition amplitude for J\/ψ → γ∗ → V P at tree level\ncan be expressed as:\nMEM ≡ MA +MB +MC\n=\n(\ne\nfV 2\ngV 1γP\nMV 1\nFa + e\nfV 1\ngV 2γP\nMV 2\nFb + e\n2\nfV 1fV 2\ngPγγ\nMP\nFc\n)\nǫµναβ∂\nµV ν1 ∂\nαV β2 P, (16)\n5where e\/fV denotes the γ\n∗V couplings, and gV γP is the coupling determined in the radiative decay of\nV → γV ; Fa, Fb and Fc denote the form factors corresponding to the transitions of Fig. 2. For Fig. 2(a)\nand (b) a typical monopole (MP) form factor is adopted:\nF(q2) = 1\n1− q2\/Λ2 (17)\nwith Λ = 0.542 ± 0.008 GeV and Λ = 0.577 ± 0.011 GeV determined with a constructive (MP-C) or\ndestructive phase (MP-D) between (a) and (b), respectively. We think that the non-perturbative QCD\neffects might have played a role in the transitions at J\/ψ energy. For instance, in Fig. 2(a) and (b) a\npair of quarks may be created from vacuum as described by 3P0 model, the pQCD hadronic helicity-\nconservation due to the vector nature of gluon is violated quite strongly. A monopole-like (MP) form\nfactor should be appropriate for coping with the suppression effects, and it is consistent with the VMD\nframework. In principle such a form factor can be tested experimentally via measuring the couplings of\nthe processes J\/ψ(ψ′) → Pe+e− and e+e− → Pe+e−, respectively, when the integrated luminosity at\nJ\/ψ and the suitable energies for e+e− colliders is accumulated enough.\nDue to an error of missing a factor of\n√\n2 in Tab. I of Ref. [19], we give here in Table I the coupling\ne\/fV again. Also, we clarify that although the overall factor of\n√\n2 will change the fitted cut-off energy\nΛ and the fitted branching ratios slightly in Ref. [19], the pattern obtained there retains and the major\nconclusion is intact.\nThe form factor for (c) has a form of:\nFc(q21 , q22) =\n1\n(1 − q21\/Λ2)(1 − q22\/Λ2)\n, (18)\nwhere q21 = M\n2\nV 1 and q\n2\n2 = M\n2\nV 2 are the squared four-momenta carried by the time-like photons. We\nassume that the Λ is the same as in Eq. (17), thus, Fc = FaFb.\nA parameter δ is introduced to take into account the relative phase between the EM and strong\ntransitions:\nM =M3g + eiδMEM . (19)\nIt will then be determined by the experimental data in the numerical fitting. In the limit of δ = 0, the\nrelative phase reduces to the same ones given in Ref. [20].\nC. Mixing of the η − η′ and implication of a 0−+ glueball\nThe η−η′ mixing is a long-standing question in the literature. Here we would like to study the “mixing”\nproblem by including empirically a possible glueball component in the η and η′ wavefunctions. We extend\nthe mixing of the the η and η′ as a consequence of the flavor singlet nn¯, ss¯ and glueball mixing. The\ncorresponding glueball candidate is denoted as η′′. In the quark flavor basis, treating η, η′ and η′′ as the\neigenstates of the mass matrix M with the eigenvalues of their masses Mη, Mη′ and Mη′′ , we have\nUMU−1 =\n(\nMη 0 0\n0 Mη′ 0\n0 0 Mη′′\n)\n, (20)\nwhere U is the state mixing matrix:(\nη\nη′\nη′′\n)\n= U\n(\nnn¯\nss¯\nG\n)\n=\n(\nx1 y1 z1\nx2 y2 z2\nx3 y3 z3\n)(\nnn¯\nss¯\nG\n)\n. (21)\nThree mixing schemes are applied to determine the mixing matrix elememts.\nI) CKM approach\n6By assuming that the nn¯, ss¯ and glueball G make a complete set of eigenstates, and physical states\nare their linear combinations, we can express the mixing in the same way as the CKM matrix with the\nphase δ = 0 (no CP violation is involved):\nU =\n(\nc12c13 s12c13 s13\n−s13c23 − c12s23s13 c12c23 − s12s23s13 s23c13\ns12s23 − c12c23s13 −c12s23 − s12c23s13 c23c13\n)\n, (22)\nwhere cij ≡ cos θij and sij ≡ sin θij with θij the mixing angles to be determined by the experimental data.\nThe feature of this approach is that the completeness guarantees the unitary and orthogonal relations\nof the matrix. However, it also implies that mixings beyond qq¯ and glueball are not allowed. This may\nbe a strong assumption since resonances and exotic states such as tetraquarks with the same quantum\nnumber could also mix with the qq¯ and glueball. Because of this, the CKM approach will test the extreme\ncondition that only ground state qq¯ and G mix with each other.\nII) qq¯-G mixing due to higher Fock state |gg〉\nThis scenario is initiated by the QCD U(1)A anomaly. In a series of studies by Feldmann et al. [33, 34],\nit is pointed out that an appropriate treatment of the mixing requires to distinguish matrix elements\nof η and η′ with local currents and overall state mixings. Nonetheless, the divergences of axial-vector\ncurrents including the axial anomaly connect the short-distance properties, i.e. decay constants, with\nthe long-distance phenomena such as the mass-mixing, and highlight the twist-4 |gg〉 component in the\nFock state decomposition. In the quark flavor basis, higher Fock state due to anomaly can give rise to a\nnon-vanishing qq¯ → |gg〉 transition. Similar to the prescription of Ref. [33, 34], we introduce the glueball\ncomponents in η and η′ via the higher Fock state decompositions in ηn and ηs:\n|ηn〉 = Ψq|nn¯〉+Ψgq |gg〉+ · · · ,\n|ηs〉 = Ψs|ss¯〉+Ψgs |gg〉+ · · · , (23)\nwhere Ψq and Ψs are amplitudes of the corresponding qq¯ while Ψ\ng\nq and Ψ\ng\ns are those of the |gg〉 components;\nThe dots denote higher Fock states with additional gluon and\/or qq¯ which is beyond the applicability of\nthis approach. The presence of the gluonic Fock states in association with isoscalar nn¯ and ss¯ breaks the\northogonality between nn¯ and ss¯, and we parametrize such an effect in η and η′ wavefunctions:\n|η〉 = 1√\nN1\n[a(cosφ|nn¯〉 − sinφ|ss¯〉) + b(cosφ− sinφ)|gg〉],\n|η′〉 = 1√\nN2\n[a(sinφ|nn¯〉+ cosφ|ss¯〉) + b(sinφ+ cosφ)|gg〉], (24)\nwhere the normalization factors are N1 = a\n2+b2(1−sin 2φ) and N2 = a2+b2(1+sin 2φ), and parameters\na and b are to be determined by experiment. In this treatment, a and b now correlate with the mixing\nangle φ ≡ θ + arctan√2, with θ as the octet-singlet mixing angle defined in the SU(3) symmetry limit\n(b → 0). For the commonly accepted range θ ≃ −24.6◦ or −11.5◦ from the linear or quadratic mass\nformulae, respectively [2], the glueball component in η has a strength of b(cosφ − sinφ)\/√N1, which is\nrelatively suppressed in comparison with that in η′, i.e. b(sinφ + cosφ)\/\n√\nN2, for 0\n◦ < φ < 90◦. This\nnaturally gives rise to the scenario addressed in Ref. [33, 34].\nBased on the unitary and orthogonal relation for three mixed states, we can derive:\n\nx23 = 1− (x21 + x22),\ny23 = 1− (y21 + y22),\nz23 = 1− (z21 + z22).\n(25)\nwhich will provide information about the qq¯ and glueball components in η′ though it is not necessary for\nthe unitary and orthogonal relation being satisfied. If other higher Fock states which are negligible in η\nand η′ are present in η′′ with sizable amplitude, further constraints on the mixing wavefunction for η′′\nwill be needed.\nIII) Mixing in an old perturbation theory\n7Considering the mixing between quarkonia and glueball at leading order of a perturbation potential,\ni.e. the transition strength between two states are much smaller than the mass difference of these two\nstates, we can then express the physical states as [43]\n|η〉 = 1\nC1\n[\n|nn¯〉+\n√\n2fb\nMnn¯ −Mss¯ |ss¯〉+\n√\n2fa\nMnn¯ −MG |G〉\n]\n|η′〉 = 1\nC2\n[ √\n2fb\nMss¯ −Mnn¯ |nn¯〉+ |ss¯〉+\n√\n2fa\nMss¯ −MG |G〉\n]\n|η′′〉 = 1\nC3\n[ √\n2fa\nMG −Mnn¯ |nn¯〉+\n√\n2fa\nMG −Mss¯ |ss¯〉+ |G〉\n]\n, (26)\nwhere fa ≡ 〈ss¯|Vg|G〉 = 〈nn¯|Vg|G〉\/\n√\n2 is the mixing strength for glueball-qq¯ transitions, while\nfb ≡ 〈qq¯|Vq|ss¯〉 is the ss¯ and non-strange qq¯ mixing strength via transition potential Vq. C1,2,3 are\nthe normalization factors. Mnn¯, Mss¯ and MG are masses for the pure 0\n−+ quarkonia and glueball states,\nrespectively. They will be determined with parameters fa and fb by fitting the experimental data to\nsatisfy the the physical masses for η, η′ and η′′, and unitary and orthogonal relations.\nThe above three parametrization schemes address different aspects correlated with the glueball-qq¯\nmixing. The CKM approach automatically satisfies the unitary and orthogonal relations, and allows the\nmixing exclusively among those three states. In reality, this may not be the case, and other configurations\nwith the same quantum number may also be present in the wavefunctions. The second scheme introducing\nquarkonia-glueball mixing within η and η′ via higher Fock state. In principle, there is no constraint on the\nη′′ configuration. Thus, unitary and orthogonal relations do not necessarily apply to those three states.\nThe third scheme applies the old perturbation theory and considers the non-vanishing transitions between\nthose pure states. As a result, a physical state will be a mixture of quarkonia-glueball configurations. The\nunitary and orthogonal relations will be a constraint in the determination of the parameters. Comparing\nthese three different parametrization schemes, we expect that the quarkonia-glueball mixing mechanism\nand implication of the pseudoscalar glueball candidate can be highlighted.\nIn Table II, the transition amplitudes for the strong decays of J\/ψ(ψ′)→ V P are given.\nIII. NUMERICAL RESULTS\nWith the above preparations, we do the numerical calculations and present the results in this section.\nA. Parameters and fitting scheme\nThe parameters introduced in these three different approaches can be classified into two classes. One\nconsists of parameters which are commonly defined in all three schemes, such as gJ\/ψ(ψ′), r and R,\nand δ. Parameter gJ\/ψ(ψ′) is the basic transition strength for J\/ψ(ψ\n′) → V P , and proportional to the\nwavefunctions at origin for J\/ψ(ψ′). Obviously, it has different values for J\/ψ and ψ′ decays, respectively.\nParameter R and r are the relative strengths of the SU(3) flavor symmetry breaking and DOZI violation\nprocesses to gJ\/ψ(ψ′). They can also have different values in J\/ψ and ψ\n′ decays. Parameter δ indicates\nthe relative phases between the strong and EM transition amplitudes.\nThe other class consists of parameters for quarkonia-glueball mixings, for instance, the mixing angles\nin the CKM approach, and masses Mnn¯, Mss¯, and MG for the 0\n−+ quarkonia and glueball, respectively.\nThese parameters depend on the mixing schemes, and as mentioned earlier they give rise to different\nscenarios concerning the η and η′ mixings. We shall discuss their properties in association with the\nnumerical results in the next section.\nIt should be noted that in the VMD model for the EM decay transitions [19] all couplings are deter-\nmined independently by accommodating the experimental information for V1(V2)→ e+e−, P → γγ, and\nV1(V2) → γP or P → γV2, where V1 = J\/ψ or ψ′, V2 = ω, φ, ρ, or K∗, and P = π, η, η′ or K. This\n8is essential for accounting for the EM contributions properly. Meanwhile, the radiative decays, such as\nV → γη and γη′, η → γγ and η′ → γγ, can probe the qq¯ structure of the vector and pseudoscalar mesons.\nTheir constraints on the η and η′ mixing have been embedded in constraining the EM transitions. As\nshown in Ref. [19], all the experimental data for V1(V2)→ e+e−, P → γγ, and V1(V2)→ γP or P → γV2\nhave been included.\nGiven a reliable description of the EM transitions, we can then proceed to determine the strong transi-\ntion parameters and configuration mixings within the pseudoscalars by fitting the data for J\/ψ(ψ′)→ V P .\nThe numerical study step is taken as follows: i) Fit the data for J\/ψ(ψ′) → V P with only the strong\ndecay transitions; ii) Fit the data for J\/ψ(ψ′)→ V P including the EM decay contributions. Comparing\nthose two situations, information about the role played by the EM transitions, and their correlations\nwith the strong decay amplitudes can thus be extracted. The η and η′ configurations can also be con-\nstrained. We emphasize that a reasonable estimate of the EM contributions is a prerequisite for a better\nunderstanding of the underlying mechanisms in J\/ψ(ψ′)→ V P .\nB. Numerical results and analysis\nFor each of these three parametrization schemes, three cases are examined: i) with exclusive contri-\nbutions from J\/ψ(ψ′) strong decays; ii) with a MP-D form factor for the EM transitions; and iii) with\na MP-C form factor for the EM transitions. The parameters are listed in Table III-V, and the fitting\nresults are listed in Tables VII and VIII for J\/ψ and ψ′, respectively.\nIn general, without the EM contributions the fitting results have a relatively larger χ2 value. With the\nEM contributions, the results are much improved for both MP-D and MP-C model. To be more specific,\nwe first make an analysis of the commonly defined parameters, i.e. gJ\/ψ(ψ′), r, R and δ, and then discuss\nthe quarkonia-glueball mixing parameters for each scheme.\nFor those commonly defined parameters their fitted values turn to be consistent with each other in those\nthree schemes. It is interesting to compare the fitted values for the basic transition amplitude gJ\/ψ(ψ′)\nfor J\/ψ and ψ′. It shows that the inclusion of the EM contributions will bring significant changes to this\nquantity in ψ′ decays, while it keeps rather stable in J\/ψ decays. This agrees with the observation that\nthe EM contributions in J\/ψ hadronic decays are less significant relative to the strong ones [20, 40]. The\nabsolute value of gJ\/ψ(ψ′) for ψ\n′ is naturally smaller than that for J\/ψ. Since gJ\/ψ(ψ′) is proportional to\nthe wavefunctions at origins [19], the small fraction, [gψ′\/gJ\/ψ]\n2 ≃ 0.018, implies an overall suppression\nof the ψ′ → 3g form factors in ψ′ → V P , which is smaller than the pQCD expectation, ∼ 12%. It is\nworth noting that this suppression occurs not only to ρπ, but also to all the other V P channels. We shall\ncome back to this point in the later part.\nParameter r, denoting the OZI-rule violation effects, turns to be sizeable in J\/ψ decays but smaller in\nψ′ decays though relatively large uncertainties are accompanying. This is consistent with our expectation\nthat the DOZI processes in ψ′ decays will be relatively suppressed in comparison with those in J\/ψ\ndecays. However, it is noticed that r has quite large uncertainties in ψ′ decays though the central values\nare small. This reflects that data for ψ′ decays still possess relatively large errors, and increased statistics\nmay better constrain this parameter.\nThe SU(3) breaking parameter exhibits an overall consistency in the fittings. Relatively large SU(3)\nflavor symmetry breaking turns to occur in the J\/ψ decays compared with that in ψ′. In the case without\nEM contributions, the SU(3) breaking in ψ′ decays also turns to be large. This may reflect the necessity\nof including the EM contributions. It shows that the SU(3) symmetry breaking in J\/ψ can be as large\nas about 34%, while it is about 5-20% in ψ′ decays.\nThe phase angle δ is fitted for J\/ψ and ψ′, respectively, when the EM contributions are included. It\nshows that J\/ψ favors a complex amplitude introduced by the EM transitions. In contrast, the strong\nand EM amplitudes in ψ′ decays is approximately out of phase. This means that the strong and EM\ntransitions will have destructive cancellations in ρπ, K∗+K−+c.c., but constructively interfere with each\nother in K∗0K¯0 + c.c. As qualitatively discussed in Ref. [19], this phase can lead to further suppression\nto ψ′ → ρπ, and also explain the difference between K∗+K−+ c.c. and K∗0K¯0+ c.c. The relative phases\nare in agreement with the results of Ref. [14], but different from those in Ref. [16].\n91. CKM approach\nIn this mixing scheme it shows that mixing angles θ12 and θ23 are well constrained by the experimental\ndata while large uncertainties occur to θ13 when the EM transitions are included. The corresponding\nmatrix element sin θ12 favors a small value which implies small glueball component inside η meson. The\nmixed wavefunctions obtained with different EM interferences are:\nwithout EM :\n\n\n|η〉 = 0.915|nn¯〉 − 0.404|ss¯〉+ 0.003|G〉\n|η′〉 = −0.398|nn¯〉 − 0.903|ss¯〉 − 0.163|G〉\n|η′′〉 = 0.068|nn¯〉+ 0.148|ss¯〉 − 0.987|G〉\n; (27)\nMP-D Model:\n\n\n|η〉 = 0.904|nn¯〉 − 0.427|ss¯〉+ 1.44× 10−5|G〉\n|η′〉 = −0.421|nn¯〉 − 0.892|ss¯〉 − 0.166|G〉\n|η′′〉 = 0.071|nn¯〉+ 0.150|ss¯〉 − 0.986|G〉\n; (28)\nand\nMP-C Model:\n\n\n|η〉 = 0.901|nn¯〉 − 0.433|ss¯〉+ 5.0× 10−7|G〉\n|η′〉 = −0.427|nn¯〉 − 0.888|ss¯〉 − 0.168|G〉\n|η′′〉 = 0.073|nn¯〉+ 0.151|ss¯〉 − 0.986|G〉\n. (29)\nIt shows that though θ13 has large uncertainties, its central values indicate a small glueball component\nin η. In particular, we find sin θ13 ≃ 0 in the MP-D model, while sin θ13 = 0.003 or 5.0× 10−7 from the\ncalculations without EM contributions or in the MP-C model, respectively. In contrast, the amplitude of\nthe glueball component in the η′ wavefunction is much larger. In all three models (and also in all three\nmixing schemes), a stable glueball mixing magnitude of ∼ 17% is favored.\nThe automatically satisfied unitary and orthogonal conditions lead to the prediction of the structure\nof the η′′. Assuming η(1405) corresponding to η′′, the CKM scheme leads to a prediction of glueball-\ndominance inside η(1405). About 15% of ss¯ and 7% of nn¯ are also required in η′′ and they favor to be\nout of phase to the G component.\n2. Quarkonia-glueball mixing due to higher Fock state\nTable IV shows that the octet-singlet mixing angle θ for η and η′ is within the reasonable range\nof −24.6◦ ∼ −11.5◦ as found by other studies [2]. Both η and η′ can accommodate a small glueball\ncomponent in association with the dominant qq¯. Parameter a and b are fitted by quite different values\nwith or without EM contributions. But remember that it is the quantities a\/\n√\nN1, b\/\n√\nN1, a\/\n√\nN2 and\nb\/\n√\nN2 that alter the simple quark flavor mixing angles, we should compare the mixed wavefunctions for\nη and η′ in those fittings:\nwithout EM :\n{ |η〉 = 0.866|nn¯〉 − 0.494|ss¯〉 − 0.070|G〉\n|η′〉 = 0.480|nn¯〉+ 0.841|ss¯〉+ 0.250|G〉 ; (30)\nMP-D Model:\n{ |η〉 = 0.859|nn¯〉 − 0.510|ss¯〉+ 0.046|G〉\n|η′〉 = 0.503|nn¯〉+ 0.847|ss¯〉 − 0.173|G〉 ; (31)\nand\nMP-C Model:\n{ |η〉 = 0.859|nn¯〉 − 0.510|ss¯〉+ 0.042|G〉\n|η′〉 = 0.504|nn¯〉+ 0.848|ss¯〉 − 0.163|G〉 . (32)\nGenerally, it shows that the glueball component in η is small and in η′ is relatively large. The qq¯\ncontents are the dominant ones in their wavefunctions. In the case without EM contributions, the signs\n10\nfor the glueball component are opposite to those with the EM contributions included. Since the glueball\ncomponents are small, the qq¯ mixing patterns are quite similar in these three fittings, in particular, MP-D\nand MP-C give almost the same results. We note in advance that the best fitting results are obtained in\nthe MP-C model. Thus, we concentrate on the MP-C model here and try to extract information about\nthe glueball candidate η′′. Similar discussions can be applied to the other two schemes.\nThe above three equations indicate that orthogonality between |η〉 and η′〉 is approximately satisfied:\n〈η|η′〉 = −0.6%. This would allow us to derive the mixing matrix elements for η′′ based on the unitary\nand orthogonal relation:(\nη\nη′\nη′′\n)\n=\n(\nx1 y1 z1\nx2 y2 z2\nx3 y3 z3\n)(\nnn¯\nss¯\nG\n)\n=\n(\n0.859 −0.510 0.042\n0.504 0.848 −0.163\n0.090 0.140 0.986\n)(\nnn¯\nss¯\nG\n)\n, (33)\nwhere the orthogonal relation is satisfied within 5% of uncertainties. Note that an overall sign for |η′′〉 is\npossible.\nSo far, there is no much reliable information about the masses for |nn¯〉 and |ss¯〉. Also, there is no firm\nevidence for a 0−+ state (denoted as η′′) as a glueball candidate and mixing with η and η′. Interestingly,\nthe above mixing suggests a small qq¯-G coupling in the pseudoscalar sector, which is consistent with\nQCD sum rule studies [45]. As a test of this mixing pattern, we can substitute the physical masses for η,\nη′ and 0−+ resonances such as η(1405), η(1475) and η(1835) [46] into Eq. (33) to derive the pure glueball\nmass MG, and we obtain, MG ≃Mη′′ due to the dominant of the glueball component in η′′. Empirically,\nthis allows a 0−+ glueball with much lighter masses than the prediction of LQCD [35].\nThe amplitude for J\/ψ(ψ′)→ φη′′ and ωη′′ can be expressed as\nMφη′′ = gJ\/ψ(ψ′)R[rx3 + (1 + r)y3 + z3]F(p) , (34)\nand\nMωη′′ = gJ\/ψ(ψ′)[(1 + 2r)x3 +\n√\n2Rry3 +\n√\n2z3]F(p) . (35)\nFor those 0−+ resonances assumed to be the η′′ in Eq. (33), predictions for their production rates in\nJ\/ψ(ψ′) decays are listed in Table VI. It shows that if those states are glueball candidates, their branching\nratios are likely at order of 10−3 in J\/ψ → φη′′ and ωη′′, and at 10−5 in ψ′ decays. We do not present\nthe same calculations for the other two mixing schemes since they all produce similar results.\nExperimental signals for η(1405) in J\/ψ radiative decays were seen at Mark III [47, 48] and DM2 [49].\nIn J\/ψ hadronic decays DM2 reported BR < 2.5×10−4 at CL = 90% with the unknown η(1405)→ KK¯π\nbranching ratio included [50], and the search in Mark III [51] gave BR(J\/ψ → φη(1405) → φKK¯π) <\n1.2× 10−4 (90%C.L.) and BR(J\/ψ → ωη(1405)→ ωKK¯π) = (6.8 +1.9−1.6 ± 1.7)× 10\n−4.\nThe estimate of its total width is still controversial and ranges from tens to more than a hundred MeV\nin different decay modes [2]. This at least suggests that BR(η(1405)→ KK¯π) ≃ 10 ∼ 50%, and leads to\nBR(J\/ψ → φη(1405)) → φKK¯π ∼< (1.49 ∼ 7.45)× 10−4. This range seems to be consistent with the\ndata [50, 51]. The prediction, BR(J\/ψ → ωη(1405)) = 7.32 × 10−3 turns to be larger than φ channel.\nA similar estimate gives, BR(J\/ψ → ωη(1405) → ωKK¯π) ≃ (0.73 ∼ 3.66) × 10−3, and can also be\nregarded as in agreement with the data from Mark III [51]. A search for η(1405) at BES-III in J\/ψ and\nψ′ hadronic decays will be helpful to clarify its property.\nThe same expectation can be applied to η(1475) and η(1835). If they are dominated by glueball\ncomponents, their production rate will be at order of 10−3 as shown in Table VI. η(1475), as the higher\nmass 0−+ in the η(1440) bump, tends to favor decaying into KK¯π (also via a0(980)π and K\n∗K¯) [49].\nAs observed in experiment that the partial width for η(1475)→ KK¯π is about 87 MeV [2], an estimated\nbranching ratio of BR(η(1475) → KK¯π) = 0.1 ∼ 0.5 will lead to BR(J\/ψ → φη(1475) → φKK¯π) =\n(1.33 ∼ 6.65) × 10−4 and BR(J\/ψ → ωη(1475) → ωKK¯π) = (6.81 ∼ 34.05) × 10−4. This value is\ncompatible with the production of η(1405), thus, should have been seen at Mark III in both ω and φ\nchannel. However, signals for η(1475) is only seen in φ channel at BR(J\/ψ → φη(1475) → φKK¯π) <\n2.1×10−4 (90%C.L.) [51]. Such an observation is more consistent with the η(1475) being an ss¯-dominant\nstate as the radial excited state of η′ [36, 52]. Its vanishing branching ratio in ω channel can be naturally\n11\nexplained by the DOZI suppressions. We also note that η(1475)’s presence in γγ → KK¯π [53] certainly\nenhances its assignment as a radial excited ss¯ state in analogy with η(1295) as the radial excited nn¯ [36,\n52].\nThe narrow resonance X(1835) reported by BES in J\/ψ → γX(1835) → γπ+π−η′ is likely to have\nJPC = 0−+ [46], and could be the same state reported earlier in J\/ψ → γpp¯ [54]. Its branching ratio is\nreported to be BR(J\/ψ → γX(1835)→ γπ+π−η′) = (2.2± 0.4 ± 0.4)× 10−4. By assuming that it is a\npseudoscalar glueball candidate, its production branching ratios in φη(1835) and ωη(1835) are predicted\nin Table VI. If π+π−η′ is the dominant decay channel, one would expect to have a good chance to see it\nin ωη(1835) channel. Since it is unlikely that a glueball state decays exclusively to π+π−η′ (and possibly\npp¯), the predicted branching ratio BR(J\/ψ → ωX(1835)) = 3.66 × 10−3 has almost ruled out its being\na glueball candidate though a search for the X(1835) in its recoiling ω should still be interesting. A\nnumber of explanations for the nature of the X(1835) were proposed in the literature. But we are not to\ngo to any details here.\nWith the above experimental observation, our results turn to favor the η(1405) being a pseudoscalar\nglueball candidate.\n3. Mixing in an old perturbation theory\nIn this scheme, the masses of the nn¯, ss¯ and glueball G are treated as parameters along with the\n“perturbative” transition amplitudes fa and fb. What we refer to as “perturbative” here is that both\nfa and fb have values much smaller than the mass differences between those mixed states. The fitted\nresults in Table V indeed satisfy this requirement. Parameters fa is fitted to be around 76 MeV, which\nsuggests a rather small glueball component in η and η′ wavefunctions. In contrast, the nn¯ and ss¯ mixing\nstrength is slightly larger, i.e. fb ≃ 94 MeV. The fitted masses Mnn¯ ≃ 0.658 GeV and Mss¯ ≃ 0.853 GeV\nare located between the η and η′, which is consistent with the expectation of the quark-flavor mixing\npicture with a mixing angle φ = θ+arctan\n√\n2 ∼ 34.7◦. The fitted mass for the glueball is about 1.4 GeV,\nwhich is determined by the assumption that the η(1405) is a pseudoscalar glueball candidate. Since the\ntransition amplitude fa is relatively small, the mixing does not bring significant differences between the\npure and physical glueball masses.\nThe wavefunctions for η, η′ and η′′ in the three different considerations of the EM transitions are\nwithout EM :\n\n\n|η〉 = 0.864|nn¯〉 − 0.479|ss¯〉 − 0.157|G〉\n|η′〉 = 0.480|nn¯〉+ 0.864|ss¯〉 − 0.152|G〉\n|η′′〉 = 0.176|nn¯〉+ 0.170|ss¯〉+ 0.970|G〉\n; (36)\nMP-D Model:\n\n\n|η〉 = 0.864|nn¯〉 − 0.478|ss¯〉 − 0.155|G〉\n|η′〉 = 0.479|nn¯〉+ 0.865|ss¯〉 − 0.150|G〉\n|η′′〉 = 0.174|nn¯〉+ 0.168|ss¯〉+ 0.970|G〉\n; (37)\nand\nMP-C Model:\n\n\n|η〉 = 0.868|nn¯〉 − 0.473|ss¯〉 − 0.153|G〉\n|η′〉 = 0.473|nn¯〉+ 0.869|ss¯〉 − 0.147|G〉\n|η′′〉 = 0.171|nn¯〉+ 0.165|ss¯〉+ 0.971|G〉\n. (38)\nIn comparison with the first two mixing schemes, this approach in the framework of old perturbation\ntheory produces a similar mixing pattern as that in Scheme-II except that the glueball component in the\nη wavefunction is quite significant, e.g. as shown in Eq. (38).\n4. The branching ratios for J\/ψ(ψ′)→ V P and violation of the “12% rule”\nThe fitted branching ratios for J\/ψ(ψ′)→ V P are listed in Tables VII and VIII, and the results for the\nisospin violated channels are also included as a comparison. It shows that all these three parametrizations\ncan reproduce the data quite well though there are different features arising from the fitted results.\n12\nOne predominant feature is that in all the schemes, parameter gJ\/ψ(ψ′) is found to have overall consistent\nvalues for both J\/ψ and ψ′. As pointed out earlier that the relatively small value of gJ\/ψ(ψ′) for ψ\n′ suggests\nan overall suppression of the ψ′ → 3g form factor. With the destructive interferences from the relatively\nlarge EM contributions, the branching ratios for ψ′ → ρπ are further suppressed and this leads to the\nabnormally small branching ratio fractions between the exclusive decays of J\/ψ and ψ′. Numerically,\nthis explains why the 12% rule is violated in J\/ψ(ψ′) → ρπ. Nonetheless, such a mechanism is rather\nindependent of the final state hadron, thus, should be more generally recognized in other exclusive\nchannels. This turns to be true. For instance, the large branching ratio difference between the charged\nand neutral K∗K¯ + c.c. channels highlights the interferences from the EM transitions [19], where the\nrelative phases to the strong amplitudes are consistent with the expectations for the ρπ channel [20].\nIn line with the overall good agreement of the fitting results to the data is an apparent deviation in\nψ′ → ωη′ in Scheme-II and III. The numerical fitting in Scheme-II gives BR(ψ′ → ωη′) = 9.49 × 10−8\nin contrast with the data (3.2\n+2.5\n−2.1 )× 10\n−5 [2]. The significant deviation from the experimental central\nvalue is allowed by the associated large errors. In fact, this channel bears almost the largest uncertainties\nin the datum set. The small values from the numerical fitting also reflect the importance of the EM\ninterferences. Note that in the fitting with only strong transitions, the branching ratio for ωη′ has\nalready turned to be smaller than the data. With the EM contributions, which are likely to interfere\ndestructively, this channel is further suppressed.\nIn contrast, the CKM mixing scheme is able to reproduce the ψ′ → ωη′ branching ratio. This is because\nthe qq¯ and G components are in phase in the η′ wavefunctions in Eqs. (27)-(29). Since the ψ′ → ωη′\ndecay shows large sensitivities to the mixing scheme, it is extremely interesting to have more precise data\nfor this channel as a directly test of the mixing schemes proposed here. As BES-II may not be able to\ndo any better on this than been published [23], CLEO-c with a newly taken 25 million ψ′ events can\npresumably clarify this [55].\nIn Table IX, we present the branching ratio fractions R for all the exclusive decay channels for the MP-C\nmodel. The extracted ratios from experimental data are also listed. Apart from those three channels, ωη′,\nρη′ and φπ, of which the data still have large uncertainties, the overall agreement is actually quite well. It\nclearly shows that the “12% rule” is badly violated in those exclusive decay channels, and the transition\namplitudes are no longer under control of pQCD leading twist [1]. The power suppression due to the\nviolation of the hadronic helicity conservation in pQCD will also be contaminated by other processes\nwhich are much non-perturbative, hence the pQCD-expected simple rule does not hold anymore. Note\nthat it is only for those isospin violated channels with exclusive EM transition as leading contributions,\nmay this simple rule be partly retained [13].\nIV. SUMMARY\nIn this work, we revisit J\/ψ(ψ′)→ V P in a parametrization model for the charmonium strong decays\nand a VMD model for the EM decay contributions. By explicitly defining the SU(3) flavor symmetry\nbreaking and DOZI violation parameters, we obtain an overall good description of the present available\ndata. It shows that a reliable calculation of the EM contributions is important for understanding the\noverall suppression of the ψ′ → 3g form factors. Our calculations suggest that ρπ channel is not very much\nabnormal compared to other V P channels, and similar phenomena appear in K∗K¯ as well. Meanwhile,\nwe strongly urge an improved experimental measurement of the ψ′ → ωη′ as an additional evidence for\nthe EM interferences. Although it is not for this analysis to answer why ψ′ → 3g is strongly suppressed,\nour results identify the roles played by the strong and EM transitions in J\/ψ(ψ′) → V P , and provide\nsome insights into the long-standing “ρπ puzzle”.\nSince the EM contributions are independently constrained by the available experimental data [2], the\nparameters determined for the pseudoscalar in the numerical study, in turn, can be examined by those\ndata. In particular, we find that η and η′ allow a small glue component, which can be referred to the\nhigher Fock state contributions due to the U(1)A anomaly. This gives rise to the correlated scenario\nbetween the octet-singlet mixing angle and the decay constants as addressed by Feldmann et al [33, 34].\nWe are also interested in the possibility of a higher glue-dominant state as a 0−+ glueball candidate.\n13\nIndeed, based on the fact that only a comparatively small glueball component exists in η and η′, we\nfind that a 0−+ glueball which mixes with η and η′ is likely to have nearly pure glueball configuration.\nAlthough the obtained mixing matrix cannot pin down the mass for a glueball state, the glueball dom-\ninance suggests that such a glueball candidate will have large production rate in both φη′′ and ωη′′ at\n10−3. This enhance the assignment that η(1405) is the 0−+ glueball candidate if no signals for η(1475)\nand η(1835) appear simultaneously in their productions with φ and ω in J\/ψ(ψ′) decays. High-statistics\nsearch for their signals in φ and ω channel at BESIII will be able to clarify these results.\nAcknowledgement\nUseful discussions with F.E. Close, C.Z. Yuan and B.S. Zou are acknowledged. This work is supported,\nin part, by the U.K. EPSRC (Grant No. GR\/S99433\/01), National Natural Science Foundation of China\n(Grant No.10547001, No.90403031, and No.10675131), and Chinese Academy of Sciences (KJCX3-SYW-\nN2).\n[1] S.J. Brodsky and G.P. Lepage, Phys. Rev. D 24, 2848 (1981).\n[2] W. M. Yao et al. [Particle Data Group], J. Phys. G 33 1 (2006).\n[3] W.S. Hou and A. Soni, Phys. Rev. Lett. 50, 569 (1983).\n[4] G. Karl and W. Roberts, Phys. Lett. 144B, 263 (1984).\n[5] S.S. Pinsky, Phys. Rev. D 31, 1753 (1985).\n[6] S.J. Brodsky, G.P. Lepage and S.F. Tuan, Phys. Rev. Lett. 59, 621 (1987).\n[7] M. Chaichian and N.A. To¨rnqvist, Nucl. Phys. B 323, 75 (1989).\n[8] S.S. Pinsky, Phys. Lett. B 236, 479 (1990).\n[9] S.J. Brodsky and M. Karliner, Phys. Rev. Lett. 78, 4682 (1997).\n[10] X. Q. Li, D. V. Bugg and B. S. Zou, Phys. Rev. D 55, 1421 (1997).\n[11] Y.-Q. Chen and E. Braaten, Phys. Rev. Lett. 80, 5060 (1998).\n[12] J.-M. Ge´rald and J. Weyers, Phys. Lett. B 462, 324 (1999); P. Artoisenet, J.-M. Ge´rald and J. Weyers, Phys.\nLett. B 628, 211 (2005).\n[13] T. Feldmann and P. Kroll, Phys. Rev. D 62, 074006 (2000).\n[14] M. Suzuki, Phys. Rev. D 63, 054021 (2001).\n[15] J.L. Rosner, Phys. Rev. D 64, 094002 (2001).\n[16] P. Wang, C.Z. Yuan, X.H. Mo, Phys. Lett. B 574, 41 (2004).\n[17] X. Liu, X.Q. Zeng and X.Q. Li, Phys. Rev. D 74, 074003 (2006) [arXiv:hep-ph\/0606191].\n[18] X.H. Mo, C.Z. Yuan, and X.H. Mo, hep-ph\/0611214.\n[19] Q. Zhao, G. Li and C. H. Chang, Phys. Lett. B 645, 173 (2007) [arXiv: hep-ph\/0610223].\n[20] A. Seiden, H. F.-W. Sadrozinski and H.E. Haber, Phys. Rev. D 38, 824 (1988).\n[21] M. Ablikim et al. [BES Collaboration], Phys. Rev. D 71, 032003 (2005).\n[22] M. Ablikim et al. [BES Collaboration], Phys. Rev. D 70, 112007 (2004); Erratum-ibid, D71, 019901 (2005).\n[23] M. Ablikim et al. [BES Collaboration], Phys. Rev. D 70, 112003 (2004).\n[24] M. Ablikim et al. [BES Collaboration], Phys. Lett. B 614, 37 (2005).\n[25] H. Fritzsch and J.D. Jackson, Phys. Lett. 66B, 365 (1977).\n[26] E. Witten, Nucl. Phys. B149, 285 (1979).\n[27] F.J. Gilman and R. Kauffman, Phys. Rev. D 36, 2761 (1987).\n[28] N. Isgur, Phys. Rev. D 13, 122 (1976).\n[29] K. Kawarabayashi and N. Ohta, Nucl. Phys. B 175, 477 (1980).\n[30] Kuang-Ta Chao, Nucl. Phys. B 317 597 (1989).\n[31] J. Schechter, A. Subbaraman and H. Weigel, Phys. Rev. D 48, 339 (1993).\n[32] H. Leutwyler, Nucl. Proc. Suppl. 64 223 (1998); H. Leutwyler, Eur. Phys. J. C 17, 623 (2000).\n[33] T. Feldmann, P. Kroll, and B. Stech, Phys. Rev. D 58, 114006 (1998); Phys. Lett. B 449, 339 (1999); T.\nFeldmann, Int. J. Mod. Phys. A 15, 159 (2000); T. Feldmann, P. Kroll, Phys. Scripta T99 13 (2002)\n[34] P. Kroll, AIP Conf. Proc. 717, 451 (2004).\n[35] C. Morningstar and M. Peardon, Phys. Rev. D 56, 4043 (1997); Phys. Rev. D60, 034509 (1999); G. Bali et\nal., UKQCD Collaboration, Phys. Lett. B 309, 378 (1993); Y. Chen et al., Phys. Rev. D 73, 014516 (2005).\n14\n[36] F.E. Close, G.R. Farrar and Z. Li, Phys. Rev. D 55, 5749 (1997).\n[37] G.R. Farrar, Phys. Rev. Lett. 76, 4111 (1996).\n[38] M.B. Cakir and G.R. Farrar, Phys. Rev. D 50, 3268 (1994).\n[39] L. Faddeev, A. J. Niemi and U. Wiedner, Phys. Rev. D 70, 114033 (2004) [arXiv:hep-ph\/0308240].\n[40] D.-M. Li, H. Yu and S.-S. Fang, Eur. Phys. J. C 28, 335 (2003).\n[41] Q. Zhao, Phys.Rev. D72, 074001 (2005).\n[42] F. E. Close and Q. Zhao, Phys. Rev. D 71, 094022 (2005).\n[43] C. Amsler and F. E. Close, Phys. Lett. B 353, 383 (1995); Phys. Rev. D 53, 295 (1996)\n[44] F. E. Close and A. Kirk, Phys. Lett. B 483, 345 (2000).\n[45] S. Narison, Nucl. Phys. B 509, 312 (1998).\n[46] M. Ablikim et al. [BES Collaboration], Phys. Rev. Lett. 95, 262001 (2005).\n[47] Z. Bai et al. [Mark III Collaboration], Phys. Rev. Lett. 65, 2507 (1990).\n[48] T. Bolton et al. [Mark III Collaboration], Phys. Rev. Lett. 69, 1328 (1992).\n[49] J.E. Augustin et al. [DM2 Collaboration], Phys. Rev. D 46, 1951 (1992).\n[50] A. Falvard et al., Phys. Rev. D 38, 2706 (1988).\n[51] J.J. Becker et al., Phys. Rev. Lett. 59, 186 (1987).\n[52] T. Barnes, F.E. Close, P.R. Page and E.S. Swanson, Phys. Rev. D 55, 4157 (1997).\n[53] M. Acciarri et al. [L3 Collaboration], Phys. Lett. B 501, 1 (2001).\n[54] J.Z. Bai et al. [BES Collaboration], Phys. Rev. Lett. 91, 022001 (2003).\n[55] G. S. Huang [CLEO Collaboration], AIP Conf. Proc. 842, 616 (2006).\nCoupling const. e\/fV Values (×10−2) Total width of V BR(V → e+e−)\ne\/fρ 6.05 146.4 MeV (4.70± 0.08) × 10−5\ne\/fω 1.78 8.49 MeV (7.18± 0.12) × 10−5\ne\/fφ 2.26 4.26 MeV (2.97± 0.04) × 10−4\ne\/fJ\/ψ 2.71 93.4 keV (5.94 ± 0.06)%\ne\/fψ′ 1.65 337 keV (7.35± 0.18) × 10−3\nTABLE I: The coupling constant e\/fV determined in V → e+e−. The data for branching ratios are from\nPDG2006 [2].\nDecay channels Transition amplitudeM = (M1 +M2 +M3)\nφη gJ\/ψ(ψ′)R[\n√\n2rx1 +R(1 + r)y1 + z1]F(P)\nφη′ gJ\/ψ(ψ′)R[\n√\n2rx2 +R(1 + r)y2 + z2]F(P)\nωη gJ\/ψ(ψ′)[(1 + 2r)x1 +\n√\n2Rry1 +\n√\n2z1]F(P)\nωη′ gJ\/ψ(ψ′)[(1 + 2r)x2 +\n√\n2Rry2 +\n√\n2z2]F(P)\nρ0pi0 gJ\/ψ(ψ′)F(P)\nρ+pi− or ρ−pi+ gJ\/ψ(ψ′)F(P)\nK∗0K¯0 or K¯∗0K0 gJ\/ψ(ψ′)RF(P)\nK∗+K− or K∗−K+ gJ\/ψ(ψ′)RF(P)\nTABLE II: General expressions for the transition amplitudes for J\/ψ(ψ′)→ V P via strong interactions.\n15\nwithout EM MP-D MP-C\nJ\/ψ ψ′ J\/ψ ψ′ J\/ψ ψ′\nr −0.265 ± 0.023 −0.185 ± 0.194 −0.270± 0.024 −0.080 ± 0.155 −0.273 ± 0.024 −0.054± 0.162\nR 0.660 ± 0.023 1.400 ± 0.112 0.667 ± 0.024 1.293 ± 0.163 0.667 ± 0.024 1.233 ± 0.238\ngJ\/ψ(ψ′)(×10−3) 18.94 ± 0.64 1.66 ± 0.15 18.62 ± 0.63 2.06± 0.25 18.66 ± 0.63 2.22± 0.49\nδ − − 75.0◦ ± 5.2◦ 143.9◦ ± 14.6◦ 73.7◦ ± 5.8◦ 159.5◦ ± 29.9◦\nθ12 156.2\n◦ ± 2.0◦ 154.7◦ ± 2.4◦ 154.3◦ ± 2.4◦\nθ13 179.8\n◦ ± 0.7◦ 180.0◦ ± 0.3◦ 180.0◦ ± 0.2◦\nθ23 9.4\n◦ ± 1.7◦ 9.5◦ ± 1.9◦ 9.7◦ ± 1.9◦\nχ2\/d.o.f 37.0\/9 9.8\/11 9.1\/11\nTABLE III: Parameters introduced in the overall fitting of J\/ψ(ψ′)→ V P in Scheme-I, i.e. the CKM approach.\nwithout EM MP-D MP-C\nJ\/ψ ψ′ J\/ψ ψ′ J\/ψ ψ′\nr −0.183 ± 0.034 0.101 ± 0.237 −0.308 ± 0.037 −0.237 ± 0.155 −0.307 ± 0.038 −0.206± 0.129\nR 0.661 ± 0.024 1.400 ± 0.106 0.672 ± 0.027 1.098 ± 0.232 0.674 ± 0.028 1.065 ± 0.181\ngJ\/ψ(ψ′)(×10−3) 18.91 ± 0.64 1.63 ± 0.15 18.45 ± 0.69 2.40± 0.53 18.45 ± 0.70 2.54 ± 0.44\nδ − − 74.0◦ ± 5.2◦ 30.7◦ ± 20.4◦ 72.3◦ ± 6.0◦ 11.0◦ ± 61.8◦\nθ −25.0◦ ± 3.7◦ −24.0◦ ± 0.8◦ −24.0◦ ± 0.9◦\na 0.673 ± 0.159 (3.15± 0.90) × 10−2 (3.44 ± 1.03) × 10−2\nb −0.127± 0.013 (4.03± 0.60) × 10−3 (4.13 ± 0.65) × 10−3\nχ2\/d.o.f 41.1\/9 11.2\/11 10.7\/11\nTABLE IV: Parameters introduced in the overall fitting of J\/ψ(ψ′)→ V P in Scheme-II, i.e. qq¯-G mixing due to\nhigher Fock state contributions.\nwithout EM MP-D MP-C\nJ\/ψ ψ′ J\/ψ ψ′ J\/ψ ψ′\nr −0.035 ± 0.056 0.115 ± 0.193 −0.037 ± 0.055 0.031 ± 0.151 −0.044 ± 0.057 0.041 ± 0.141\nR 0.698 ± 0.025 1.400 ± 0.297 0.715 ± 0.027 1.079 ± 0.155 0.718 ± 0.028 1.047 ± 0.158\ngJ\/ψ(ψ′)(×10−3) 18.05 ± 0.64 1.65 ± 0.15 17.53 ± 0.64 2.44± 0.34 17.52 ± 0.66 2.57 ± 0.42\nδ − − 74.9◦ ± 5.07◦ 149.2◦ ± 19.6◦ 73.8◦ ± 5.8◦ 168.2◦ ± 136.7◦\nMnn¯ (GeV) 0.658 ± 0.083 0.658 ± 0.055 0.657 ± 0.081\nMss¯ (GeV) 0.855 ± 0.076 0.853 ± 0.057 0.853 ± 0.077\nMG (GeV) 1.389 ± 0.093 1.390 ± 0.093 1.391 ± 0.095\nfa (GeV) 0.077 ± 0.039 0.076 ± 0.022 0.076 ± 0.038\nfb (GeV) 0.094 ± 0.033 0.093 ± 0.034 0.091 ± 0.036\nχ2\/d.o.f 46.3\/13 18.9\/13 18.3\/13\nTABLE V: Parameters introduced in the overall fitting of J\/ψ(ψ′) → V P in Scheme-III, i.e. mixing via an old\nperturbation theory.\n16\nBR(J\/ψ → V η′′) (×10−3) BR(ψ′ → V η′′) (×10−5)\nη′′ φη′′ ωη′′ φη′′ ωη′′\nη(1405) 1.49 7.32 4.07 7.17\nη(1475) 1.33 6.81 3.96 7.03\nη(1835) 0.44 3.66 3.09 5.93\nTABLE VI: Predictions for production of η′′ in J\/ψ(ψ′) → V P by assuming it is η(1405), η(1475) and η(1835),\nrespectively, in Scheme-II. Calculations by Scheme-I and III give similar results with the same order of magnitude.\nDecay channels without EM Scheme-I Scheme-II Scheme-II Scheme-III Exp. data\n(MP-C) (MP-D) (MP-C) (MP-C)\nρ0pi0 5.64 × 10−3 5.76 × 10−3 5.64 × 10−3 5.65 × 10−3 5.09 × 10−3 (5.6 ± 0.7) × 10−3\nρpi 1.69 × 10−2 1.73 × 10−2 1.70 × 10−2 1.69 × 10−2 1.53 × 10−2 (1.69 ± 0.15) × 10−2\nωη 1.55 × 10−3 1.53 × 10−3 1.60 × 10−3 1.60 × 10−3 1.75 × 10−3 (1.74 ± 0.20) × 10−3\nωη′ 1.82 × 10−4 1.82 × 10−4 1.83 × 10−4 1.83 × 10−4 1.80 × 10−4 (1.82 ± 0.21) × 10−4\nφη 6.45 × 10−4 6.40 × 10−4 6.91 × 10−4 6.94 × 10−4 5.92 × 10−4 (7.4 ± 0.8) × 10−4\nφη′ 4.00 × 10−4 4.22 × 10−4 4.00 × 10−4 4.00 × 10−4 3.17 × 10−4 (4.0 ± 0.7) × 10−4\nK∗+K− + c.c. 4.67 × 10−3 5.01 × 10−3 5.03 × 10−3 5.03 × 10−3 5.11 × 10−3 (5.0 ± 0.4) × 10−3\nK∗0K¯0 + c.c. 4.66 × 10−3 4.30 × 10−3 4.25 × 10−3 4.23 × 10−3 4.39 × 10−3 (4.2 ± 0.4) × 10−3\nρη − 1.5 × 10−4 1.1 × 10−4 1.5× 10−4 (1.93 ± 0.23) × 10−4\nρη′ − 7.9 × 10−5 4.2 × 10−5 7.9× 10−5 (1.05 ± 0.18) × 10−4\nωpi − 3.3 × 10−4 4.2 × 10−4 3.3× 10−4 (4.5 ± 0.5) × 10−4\nφpi − 9.9 × 10−7 8.0 × 10−7 9.9× 10−7 < 6.4× 10−6\nTABLE VII: Fitted branching ratios for J\/ψ → V P in different parametrization schemes for the isoscalar mixings.\nColumn (without EM) is for results without EM contributions; Columns of MP-C correspond to processes Fig. 2(a)\nand (b) in a constructive phase with an effective mass Λ = 0.616 GeV; and Column MP-D corresponds to (a) and\n(b) in a destructive phase with Λ = 0.65 GeV, which are the same as in Ref. [19]. The isospin violated channels\n(last four channels) are also listed. The experimental branching ratios are from PDG2006 [2].\n17\nDecay channels without EM Scheme-I Scheme-II Scheme-II Scheme-III Exp. data\n(MP-C) (MP-D) (MP-C) (MP-C)\nρ0pi0 0.89 × 10−5 0.71 × 10−5 0.88 × 10−5 0.97 × 10−5 1.02 × 10−5 ***\nρpi 2.68 × 10−5 2.03 × 10−5 2.58 × 10−5 2.78 × 10−5 2.92 × 10−5 (3.2 ± 1.2) × 10−5\nωη 6.36 × 10−6 6.08 × 10−6 5.63 × 10−6 5.35 × 10−6 4.97 × 10−6 < 1.1× 10−5\nωη′ 1.35 × 10−6 9.68 × 10−6 1.96 × 10−7 9.49 × 10−8 5.21 × 10−7 (3.2 +2.5−2.1 )× 10\n−5\nφη 0.95 × 10−5 1.78 × 10−5 2.02 × 10−5 2.04 × 10−5 1.96 × 10−5 (2.8 +1.0−0.8 )× 10\n−5\nφη′ 1.75 × 10−5 2.11 × 10−5 2.13 × 10−5 2.41 × 10−5 2.80 × 10−5 (3.1 ± 1.6) × 10−5\nK∗+K− + c.c. 3.50 × 10−5 2.28 × 10−5 2.07 × 10−5 2.01 × 10−5 2.00 × 10−5 (1.7 +0.8−0.7 )× 10\n−5\nK∗0K¯0 + c.c. 3.50 × 10−5 1.18 × 10−4 1.18 × 10−4 1.17 × 10−4 1.13 × 10−4 (1.09 ± 0.20) × 10−4\nρη − 1.4 × 10−5 9.4 × 10−6 1.4× 10−5 (2.2 ± 0.6) × 10−5\nρη′ − 7.4 × 10−6 3.9 × 10−6 7.4× 10−6 (1.9 +1.7−1.2 )× 10\n−5\nωpi − 3.0 × 10−5 3.9 × 10−5 3.0× 10−5 (2.1 ± 0.6) × 10−5\nφpi − 7.3 × 10−8 9.6 × 10−8 7.3× 10−8 < 4× 10−6\nTABLE VIII: Fitted branching ratios for ψ′ → V P . The notations are the same as Table VII. The stars “***”\nin ρ0pi0 channel denotes the unavailability of the data.\nDecay channels Scheme-I (%) Scheme-II (%) Scheme-III (%) Exp. data (%)\nρpi 0.12 0.15 0.19 0.2± 0.1\nωη 0.40 0.35 0.28 < 0.6± 0.1\nωη′ 5.33 0.11 0.29 18.5± 13.2\nφη 2.78 2.93 3.30 4.1± 1.6\nφη′ 5.00 5.34 8.86 8.7± 5.5\nK∗+K− + c.c. 0.45 0.41 0.39 0.4± 0.2\nK∗0K¯0 + c.c. 2.74 2.79 2.67 2.7± 0.7\nρη 8.97 11.5 ± 5.0\nρη′ 9.44 23.5± 17.8\nωpi 9.01 5.0± 1.8\nφpi 7.41 < 62.5\nTABLE IX: Branching ratio fractions for all V P channels in the MP-C model. The isospin violated channels are\nalso included.\n18\nJ\/ψ\nφ(ss–)\nP(ss–)\n(a)\nJ\/ψ\nφ(ss–)\nP(nn–)\n(b)\nJ\/ψ\nP(G)\nφ(ss–)\n(c)\nFIG. 1: Schematic diagrams for J\/ψ → φP via strong interaction, where the production of different components\nof the pseudoscalar P is demonstrated via (a): SOZI process; (b) DOZI process; and (c) glueball production.\nSimilar prcesses apply to other V P channels as described in the text.\n(a) (b)\nγ∗\n(c)\nV1 V1\nγ∗ V1 V2γ\n∗\ngV2γP\nP\nV2\nP\ngPγγ\ne\nfV2\nP\ne\nfV2\ne\nfV1\ne\nfV1\nV2\ngV1γP\nFIG. 2: Schematic diagrams for J\/ψ(ψ′)→ γ∗ → V P .\n"}