{"doi":"10.1155\/S111086570440506X","coreId":"102483","oai":"oai:epubs.surrey.ac.uk:1946","identifiers":["oai:epubs.surrey.ac.uk:1946","10.1155\/S111086570440506X"],"title":"Image Content Authentication Using Pinned Sine Transform","authors":["Ho, Anthony T. S.","Zhu, Xunzhan","Guan, Yong Liang"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-06-01","abstract":"<p>Digital image content authentication addresses the problem of detecting any illegitimate modification on the content of images. To cope with this problem, a novel semifragile watermarking scheme using the <i>pinned sine transform<\/i> (PST) is presented in this paper. The watermarking system can localize the portions of a watermarked image that have been tampered maliciously with high accuracy as well as approximately recover it. In particular, the watermarking scheme is very sensitive to any texture alteration in the watermarked images. The interblock relationship introduced in the process of PST renders the watermarking scheme resistant to content cutting and pasting attacks. The watermark can still survive slight nonmalicious manipulations, which is desirable in some practical applications such as legal tenders. Simulation results demonstrated that the probability of tamper detection of this authentication scheme is higher than 98%, and it is less sensitive to legitimate image processing operations such as compression than that of the equivalent DCT scheme.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1946<\/identifier><datestamp>\n      2017-10-31T14:03:45Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:436F6D707574696E67<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1946\/<\/dc:relation><dc:title>\n        Image Content Authentication Using Pinned Sine Transform<\/dc:title><dc:creator>\n        Ho, Anthony T. S.<\/dc:creator><dc:creator>\n        Zhu, Xunzhan<\/dc:creator><dc:creator>\n        Guan, Yong Liang<\/dc:creator><dc:description>\n        <p>Digital image content authentication addresses the problem of detecting any illegitimate modification on the content of images. To cope with this problem, a novel semifragile watermarking scheme using the <i>pinned sine transform<\/i> (PST) is presented in this paper. The watermarking system can localize the portions of a watermarked image that have been tampered maliciously with high accuracy as well as approximately recover it. In particular, the watermarking scheme is very sensitive to any texture alteration in the watermarked images. The interblock relationship introduced in the process of PST renders the watermarking scheme resistant to content cutting and pasting attacks. The watermark can still survive slight nonmalicious manipulations, which is desirable in some practical applications such as legal tenders. Simulation results demonstrated that the probability of tamper detection of this authentication scheme is higher than 98%, and it is less sensitive to legitimate image processing operations such as compression than that of the equivalent DCT scheme.<\/p><\/dc:description><dc:date>\n        2004-06-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1946\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Ho, Anthony T. S., Zhu, Xunzhan and Guan, Yong Liang  (2004) Image Content Authentication Using Pinned Sine Transform   EURASIP Journal on Advances in Signal Processing, 2004 (14).  pp. 2174-2184.      <\/dc:identifier><dc:relation>\n        10.1155\/S111086570440506X<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1946\/","10.1155\/S111086570440506X"],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"EURASIP Journal on Applied Signal Processing 2004:14, 2174–2184\nc© 2004 Hindawi Publishing Corporation\nImage Content Authentication Using\nPinned Sine Transform\nAnthony T. S. Ho\nSchool of Electrical & Electronic Engineering, Nanyang Technological University, Nanyang Avenue, Singapore 639798\nEmail: etsho@ntu.edu.sg\nXunzhan Zhu\nSchool of Electrical & Electronic Engineering, Nanyang Technological University, Nanyang Avenue, Singapore 639798\nEmail: xzzhu@pmail.ntu.edu.sg\nYong Liang Guan\nSchool of Electrical & Electronic Engineering, Nanyang Technological University, Nanyang Avenue, Singapore 639798\nEmail: eylguan@ntu.edu.sg\nReceived 23 October 2003; Revised 24 December 2003\nDigital image content authentication addresses the problem of detecting any illegitimate modification on the content of images.\nTo cope with this problem, a novel semifragile watermarking scheme using the pinned sine transform (PST) is presented in this\npaper. The watermarking system can localize the portions of a watermarked image that have been tampered maliciously with high\naccuracy as well as approximately recover it. In particular, the watermarking scheme is very sensitive to any texture alteration in\nthe watermarked images. The interblock relationship introduced in the process of PST renders the watermarking scheme resistant\nto content cutting and pasting attacks. The watermark can still survive slight nonmalicious manipulations, which is desirable in\nsome practical applications such as legal tenders. Simulation results demonstrated that the probability of tamper detection of this\nauthentication scheme is higher than 98%, and it is less sensitive to legitimate image processing operations such as compression\nthan that of the equivalent DCT scheme.\nKeywords and phrases: semifragile watermarking, content authentication, pinned sine transform.\n1. INTRODUCTION\nWhile digital media oﬀer many distinct advantages over their\nanalog counterparts, the ease with which they can be edited\nand tampered makes the protection of their integrity and au-\nthenticity a serious and important issue. In certain practical\napplications, such as remote sensing, legal defending, news\nreporting, and medical archiving, there is a need for verifica-\ntion or authentication of the integrity of the media content.\nA fragile watermarking detects changes of the watermarked\nimage such that it can provide some form of guarantee that\nthe image has not been tampered with and is originated from\nthe right source. In addition, a fragile watermarking scheme\nshould be able to identify which portions of the watermarked\ndata are authentic and which are corrupted; if unauthenti-\ncated portions are detected, it should be able to restore it [1].\nThe earliest fragile watermarking schemes are designed\nto detect any slight changes to the bits of the watermarked\nimage and the watermark becomes undetectable after the wa-\ntermarked image is modified in any way [2, 3, 4, 5]. However,\nsince the meaning of multimedia data is generally based on\ntheir semantic content rather than the bit streams, in some\napplications, a semifragile watermarking is more desirable.\nA semifragile watermarking seeks to verify that the content\nof the multimedia has not been modified by any predefined\nset of illegitimate distortions, while allowing modification by\nlegitimate distortions [1]. Although a variety of semifragile\nwatermarking schemes have been proposed in the literature\nto solve this problem, the above issue of “selective content\nauthentication” has not been vigorously addressed.\nIn [6], Lin and Chang proposed a method that could lo-\ncalize malicious tampering to the image content while ac-\ncepting JPEG compression to a predetermined quality factor\n(QF). Their method achieved its goal by using an invariant\nrelationship between two DCT coeﬃcients in a block pair\nbefore and after JPEG compressions. Such relationship was\nencoded and inserted into the least significant bits (LSBs) of\nrounded DCT coeﬃcients. Although their method proved to\nImage Content Authentication Using Pinned Sine Transform 2175\nOriginal\nimage\nLSBs\nnulling\nPinned field\nBoundary field\nWatermark\nEmbedding\nalgorithm\nKey\nRecovery bits\ngeneration\nWatermarked\nimage\nFigure 1: Watermark embedding process; the parts in the dashed windows are optional for the host image restoration.\nbe robust to JPEG compression by both mathematical de-\nduction and experimental results, they actually proposed a\nwatermarking scheme that was very robust to JPEG compres-\nsion rather than addressed the issue of selective content au-\nthentication. Recently, some fragile watermarking schemes\nusing the wavelet domain have been proposed [7, 8, 9, 10].\nThe localization ability in both spatial domain and fre-\nquency domain makes the wavelets a potential candidate for\nsemifragile watermarking. However, to authenticate content,\nsome significant features, for example, the edges of the host\nimage, are required to be encoded and embedded in the low\nfrequencies of the wavelet decomposition. Thus, there ex-\nists a tradeoﬀ between the visual quality of the watermarked\nimage and the ability of the scheme to detect changes. An-\nother drawback of these schemes is the high computation\ncost during the feature extraction and visual hash coding\nprocesses.\nFurther ways to completely thwart many existing fragile\nwatermarking schemes are the “cutting and pasting” attacks.\nThe well-known vector quantization (VQ) counterfeiting at-\ntacks [11] is one of such attacks. Some inter-relationship be-\ntween the watermarked blocks is introduced to avoid the VQ\nattacks [4, 5, 6]; however, a close relationship between uncor-\nrelated blocks may come at the cost of reduced error localiza-\ntion properties and introduce confusion for the consequent\nauthentication process.\nIn this paper, a novel semifragile watermarking scheme\nusing the pinned sine transform (PST) in [12] is proposed.\nThe motivation for developing a semifragile watermarking\nbased on PST is due to the observation that this trans-\nform could provide an eﬀective way to solve both the above-\nmentioned selective content authentication problem and the\nissue of exposing the cutting and pasting counterfeiting at-\ntacks. The observation is as follows. The PST conducts a\ndecomposition of the original image into two mutually un-\ncorrelated fields, namely, the boundary field and the pinned\nfield. The texture information of the original image is con-\ntained in the pinned field, wherein the sine transform is\nequivalent to a fast Karhunen-Loeve transform (KLT). By ex-\nploiting this important property, we propose to embed a wa-\ntermark signal into the sine transform domain of the pinned\nfield for content authentication. As illustrated in this paper,\nthe proposed watermarking scheme is especially sensitive to\ntexture alterations of the host image while permitting con-\ntrolled amount of modifications to nontexture aspects of the\nhost image. Moreover, although our scheme is blockwise, the\nwatermarking of one block is closely related to all the blocks\nsurrounding it, in a way that will become apparent later in\nthis paper, which renders our scheme robust to the cutting\nand pasting attacks.\nSection 2 presents a brief review of the PST. The pro-\nposed watermark embedding and image authentication pro-\ncesses are then described in Sections 3 and 4, respectively.\nIn Section 5, we discuss how the proposed scheme ensures\na selective content authentication. The proposed scheme’s\nresistance to VQ counterfeiting attacks is demonstrated in\nSection 6, followed by experimental results and the conclu-\nsion in Sections 7 and 8.\n2. THE PINNED SINE TRANSFORM\nAn overview of the PST is discussed in this section. Suppose\na data vector\nX = [x0 · · · xn+1]T (1)\nis separated into a boundary response Xb defined by x0 and\nxn+1, and a residual sequence X′ −Xb, where\nX′ = [x1 · · · xn]T . (2)\nIn [13], Jain showed that ifX is a first-order stationary Gauss-\nMarkov sequence, the sequence X′ − Xb will have the sine\ntransform as its KLT.\nExtending the above theory to the more general 2D case,\nMeiri and Yudilevich [12, 14] proposed the PST for images.\nAn image field is decomposed into two subfields, namely,\nthe boundary field and a residual field. The boundary field\ndepends only on the block boundaries and for the residual\nfield, so-called the pinned field in [12], which vanishes at\nthe boundaries, its KLT is the sine transform. The detailed\nPST process as well as the proposed watermark embedding\nmethod based on this transform are found in the next sec-\ntion.\n2176 EURASIP Journal on Applied Signal Processing\n(m− 1,n− 1) (m− 1,n) (m− 1,n + 1)\nb1x(i)\nc11 c1k\n(m,n− 1) (m,n) (m,n + 1)\nb\ny1\n(j\n)\nb\nyk\n(j\n)\nN\new\nbo\nu\nn\nda\nry\nck1 ckk\n(m + 1,n− 1) (m + 1,n) (m + 1,n + 1)\nbkx(i)\nNew boundary New corner\ni\nj\nFigure 2: The dual-field decomposition in PST for a typical block.\n3. WATERMARK EMBEDDING\nThe watermark embedding process is described in Figure 1.\nThe details are described as follows. The original image X\nis partitioned into non-overlapping blocks of size k × k as\nshown in Figure 2. Consider a typical block Xm,n, where m\nand n are the coordinate numbers of this block, we define its\ncorner response as\ncm,n =\n(\nc11, c1k, ck1, ckk\n)\n(3)\nand its boundary response as\nbm,n =\n(\nb1x,bkx,by1,byk\n)\n(4)\nas illustrated in Figure 2. The corner response is obtained us-\ning the corner function\ncm,n = C\n[\nXu,v : m− 1 ≤ u ≤ m+ 1, n− 1 ≤ v ≤ n+ 1\n]\n. (5)\nMore specifically, the corner function is defined as follows:\nc11 = Xm,n(1, 1)+Xm−1,n−1(k, k)+Xm−1,n(k, 1) +Xm,n−1(1, k)4 ,\nc1k = Xm,n(1, k)+Xm−1,n(k, k)+Xm−1,n+1(k, 1) +Xm,n+1(1, 1)4 ,\nck1 = Xm,n(k, k)+Xm,n−1(k, k)+Xm+1,n−1(1, k) +Xm+1,n(1, 1)4 ,\nckk = Xm,n(k, k)+Xm,n+1(k, 1)+Xm+1,n(1, k) +Xm+1,n+1(1, 1)4 ;\n(6)\nand the boundary response is defined by the boundary func-\ntion\nbm,n = B\n[\nXu,v : m− 1 ≤ u ≤ m + 1, n− 1 ≤ v ≤ n + 1\n]\n(7)\nwhich is further defined as follows:\nb1x(i) = Xm,n(1, i) +Xm−1,n(k, i)2 ,\nbkx(i) = Xm,n(k, i) +Xm+1,n(1, i)2 ,\nby1( j) = Xm,n( j, 1) +Xm,n−1( j, k)2 ,\nbyk( j) = Xm,n( j, k) +Xm,n+1( j, 1)2 .\n(8)\nAs we can see from (5)–(8), the processing of one block\nshould involve all the blocks surrounding it, and we can ob-\nserve in Figure 2 that in a sequential processing of blocks,\nonly one new corner ckk and two new boundaries bkx and\nbyk are required to be computed for a new input block.\nThe boundary field of Xm,n is achieved by the pinning\nfunction [12]\nXbm,n = P\n[\ncm,n,bm,n\n]\n. (9)\nCorresponding to the above general form, the specific form\nof the pinning function is defined as follows:\nXbm,n(i, j) = Xm,n(1, 1) +\n(\nc1k − c11\n) (i− 1\/2)\nk\n+\n(\nck1 − c11\n) ( j − 1\/2)\nk\n+\n(\nc11 + ckk − ck1 − c1k\n) (i− 1\/2)( j − 1\/2)\nk2\n+ gx(i) +\n(\nhx(i)− gx(i)\n) j − 1\/2\nk\n+ gy( j) +\n(\nhy( j)− gy( j)\n) i− 1\/2\nk\n,\n(10)\nwhere\ngx(i) = bkx(i)−\n(\nck1 +\nckk − ck1\nk\n(\ni− 1\n2\n))\n,\nhx(i) = b1x(i)−\n(\nc11 +\nc1k − c11\nk\n(\ni− 1\n2\n))\n,\ngy( j) = byk( j)−\n(\nc1k +\nckk − c1k\nk\n(\nj − 1\n2\n))\n,\nhy( j) = by1( j)−\n(\nc11 +\nck1 − c11\nk\n(\nj − 1\n2\n))\n(11)\nImage Content Authentication Using Pinned Sine Transform 2177\nare the pinned boundaries. The pinned field X\np\nm,n is then\ngiven by\nX\np\nm,n = Xm,n −Xbm,n. (12)\nNext, we perform a sine transform to this pinned field\nblock as follows:\nX\np(s)\nm,n = SkXpm,nSTk , (13)\nwhere Sk is the sine transform matrix of order k which is de-\nfined as [15]\nSk(i, j) =\n√\n2\nk + 1\nsin\nπ(i + 1)( j + 1)\nk + 1\n, (14)\nwhere 0 ≤ i, j ≤ k − 1.\nWe use a pseudorandom binary sequence as the water-\nmark for image authentication. The length of the sequence\nL and its initial state number is contained as a part of the\nsecret key file K . The watermark embedding process pro-\nceeds by embedding the Pseudorandom sequence into each\nsine transformed pinned-field block.\nConsider a certain transformed block X\np(s)\nm,n ; we denote it\nas\nX\np(s)\nm,n =\n{\nx\np(s)\nm,n [t]\n}\n(15)\nby viewing it column by column and with t ∈ T =\n{1, 2, . . . , k2}. The watermark signal intended to be embed-\nded into this block is marked as\nWm,n =\n{\nwm,n[l]\n}\n(16)\nwith l ∈ L = {1, 2, . . . ,L} and wm,n[l] ∈ {0, 1}.\nIn the middle-to-high frequency bands of X\np(s)\nm,n , we se-\nlect, according to the length of the watermark sequence L,\ncoeﬃcients for watermarking modulation. Suppose the la-\nbelling set of these selected coeﬃcients is denoted as S =\n{t1, t2, . . . , tL}; the watermarking function is then given by\nY\np(s)\nm,n = F\n[\nX\np(s)\nm,n ,Wm,n,K\n]\n, (17)\nwhere\nY\np(s)\nm,n =\n{\ny\np(s)\nm,n [t]\n}\n, t ∈ T (18)\nis the block of watermarked sine transform coeﬃcients. More\nspecifically, the watermarking function F[·] is defined as in\nAlgorithm 1.\nIf t ∈ S, then\nif wm,n[lt] = 1, then\nif x\np(s)\nm,n [t] > λ, then\ny\np(s)\nm,n [t] = xp(s)m,n [t]\nelse\ny\np(s)\nm,n [t] = α1\nend if\nelse if wm,n[lt] = 0, then\nif x\np(s)\nm,n [t] < −λ, then\ny\np(s)\nm,n [t] = xp(s)m,n [t]\nelse\ny\np(s)\nm,n [t] = α2\nend if\nend if\nelse if t \/∈ S, then\ny\np(s)\nm,n [t] = xp(s)m,n [t]\nEnd if\nAlgorithm 1\nThe variables involved in the problem are the following:\n(i) x\np(s)\nm,n [t] is the original coeﬃcient;\n(ii) wm,n[lt] is the watermark to be embedded into x\np(s)\nm,n [t];\n(iii) y\np(s)\nm,n [t] is the corresponding watermarked coeﬃcient;\n(iv) λ is a suﬃciently large threshold of positive value. It\ncan be determined by users; its value will aﬀect the\ntradeoﬀ between the perceptual quality of the water-\nmarked image and the probability of detection of the\nwatermarking scheme;\n(v) α1 and α2 are floating point values chosen randomly\nfrom [λ\/2, λ] and [−λ,−λ\/2], respectively.\nThe watermarked pinned field block is obtained by the\ninverse 2D sine transform\nY\np\nm,n = STk Yp(s)m,nSk (19)\nand a watermarked block is therefore achieved by\nYm,n = Ypm,n +Xbm,n. (20)\nAfter processing all the blocks, the watermarked image is\nthe union of all the watermarked blocks:\nY =\nM⋃\nm=1\nN⋃\nn=1\nYm,n, (21)\nwhereM ×N is the total number of blocks.\n2178 EURASIP Journal on Applied Signal Processing\nTest image\nResidual\nimage\nPinned field\nBoundary field\nDetection\nalgorithm\nExtracted\nwatermark\nOriginal\nwatermark\nKey Authenticated\nor not\nNo\nRestoration\nalgorithm\nRecovery\nbits\nRestored image\nFigure 3: Watermark detection and image authentication process; the parts in the dashed window are optional for host image restoration.\nWhile t ∈ S do\nif yˆ\np(s)\nm,n [t] ≥ 0, then\nwˆm,n[lt] = 1\nelse\nwˆm,n[lt] = −1\nEnd if\nEnd while\nAlgorithm 2\n4. WATERMARK DETECTION, IMAGE\nAUTHENTICATION AND RESTORATION\nThe watermark detection and image authentication process\nis illustrated in Figure 3. The detection system receives as in-\nput a watermarked and possibly tampered image Ŷ. Similar\nto the watermarking process, a decomposition is performed\non Ŷ by (3)–(12), and then we obtain the sine transform co-\neﬃcients of its pinned field by (13).\nConsider the sine transform components matrix of a cer-\ntain watermarked pinned filed block:\nŶ\np(s)\nm,n =\n{\nyˆ\np(s)\nm,n [t]\n}\n(22)\nby viewing it column by column and with t ∈ T =\n{1, 2, . . . , k2}. The retrieved and possibly corrupted water-\nmark Wˆm,n is decided based on the watermark detection\nfunction\nWˆm,n = G\n[\nŶ\np(s)\nm,n ,K\n]\n. (23)\nMore specifically, G[·] is given by Algorithm 2.\nwˆm,n[lt] denotes the watermark bit retrieved from yˆ\np(s)\nm,n [t],\nand S has the same meaning as in Section 3, which is\nachieved by the secret key fileK .\nThe original watermark signalWm,n is also generated us-\ning the initial state number in the K , and this binary se-\nquence with elements {0, 1} is mapped into a corresponding\nbipolar sequence with elements {−1, 1}. The watermark bits\nare compared via the normalized cross correlation function\n[16]:\nρ =\n∑L\nl=0 wˆm,n[l]wm,n[l][∑L\nl=0\n(\nwˆm,n[l]\n)2]1\/2[∑L\nl=0\n(\nwm,n[l]\n)2]1\/2 , (24)\nwhere ρ ∈ [−1, 1].\nThe integrity of the block Ŷm,n is evaluated according to\nthe value of ρ. If no tampering ever occurred to this block,\nρ → 1; on the other hand, ρ will decrease due to diﬀer-\nent tampering of Ŷm,n. If the content of the block has been\nchanged, that is, the block has been replaced, due to prop-\nerties of the normalized cross correlation function, ρ will be\nextremely low.\nAssume γ is a properly set threshold; the block is consid-\nered to be maliciously tampered with if ρ < γ. The thresh-\nold is determined mathematically or experimentally so as\nto maximize the probability of detection subject to a given\nprobability of false alarm. In our current simulations, γ is ex-\nperimentally set to tolerate unavoidable nonmalicious mod-\nifications in some practical applications, such as JPEG com-\npression and noise addition, while maintaining the sensitiv-\nity of the authentication process to malicious modification\non the content of the watermarked images.\nIf some parts of the watermarked image are detected to be\nremoved or destroyed, these modified regions can be roughly\nrecovered using the method of self-embedding [5]. To facili-\ntate a restoration process, the watermarking embedding and\ndetection processes in Sections 3 and 4 are modified slightly\nas shown in the dash windows in Figures 1 and 3. In our\nscheme, the down-sampled image is obtained by compress-\ning the two fields of the original image separately through\na sine transform coder as described in [12]. As mentioned\nin Section 3, for the pinned field, the sine transform coder\nis equivalent to a fast KLT coder, which results in optimal\ncoding. Another significant advantage of the PST coder over\nthe DCT technique in [5] is that it suppresses significantly\nthe block eﬀect appearing in the recovered image when the\ncompression rate is high by retaining the continuity between\nblocks [12].\nImage Content Authentication Using Pinned Sine Transform 2179\n(a) (b) (c)\nFigure 4: The dual-field decomposition in the PST of the Dubai image: (a) the original image, (b) the boundary field, and (c) the pinned\nfield.\n(m,n)\nFigure 5: The interblock relationship in the PST.\n5. DUAL-FIELD DECOMPOSITION AND SELECTIVE\nCONTENT AUTHENTICATION\nThe semifragile watermarking seeks a selective authentica-\ntion on the content of images. Our scheme aims at protect-\ning the primary textures, such as edges, of the images. To\nthis end, the watermark should not survive the authentica-\ntion process if such textures are tampered or damaged. The\nresults of the PST dual-field decomposition of the 512× 512\nDubai image using (3)–(12) are shown in Figure 4. We find\nthat the boundary field is only a blurred version of the orig-\ninal image, while the pinned field is a good characterization\nof edges, which largely reflects the texture information in\nthe original image. Thus the watermark can be embedded\ninto the pinned field as an indicator of the authenticity of\nthe watermarked image. Moreover, since most common im-\nage manipulations tend to preserve such primary features of\nimages, this embedding method ensures that the watermark\ndoes not suﬀer significantly from such legitimate manipula-\ntions.\n6. INTERBLOCK RELATIONSHIP AND\nCOUNTERFEITING ATTACKS\nThe most important malicious attacks on existing fragile wa-\ntermarking schemes are the “cutting and pasting” attacks.\nThe well-known VQ counterfeiting attack proposed by Hol-\nliman and Memon [11] is one of such attacks, which thwarts\nmany existing blockwise fragile watermarking methods. In\nthis section, we briefly review the VQ attack by Holliman and\nMemon and then explain why our scheme can survive the VQ\nattack.\nThe success of the VQ attack is based on the assump-\ntion that the attacker has a partial knowledge of the pos-\nsible watermark patterns and it is not restrictive in public\napplications. The attack starts by collecting a large num-\nber of watermarked images, and constructing the codebooks\nby categorizing all the blocks in those images so that the\nblocks in the same class correspond to the same watermark\npattern. Suppose that the attacker has an unmarked image\nZ and intends to counterfeit from it an approximate im-\nage Z′ which can pass the authentication system. He ex-\namines every block of Z, say, Zp,q, and identifies it as a\nmember of a certain class according to the specific wa-\ntermarking technique. He then replaces Zp,q with a water-\nmarked block in that class that minimizes the diﬀerence\nbetween this block and Zp,q. As thus the attacker achieves\nhis goal without being detected by the authentication sys-\ntem.\nIn our scheme, we exploit the intrinsic interblock depen-\ndence in the PST to detect the above counterfeiting attacks.\nThe “PST style” encoding in (3)–(12) introduces an inter-\nblock relationship to the PST images as shown in Figure 5.\nTherefore, the watermarking of any particular block also de-\npends on its location in the image instead of depending only\non its own content. Thus, simple VQ counterfeiting attack\ncan be exposed by this encoding style since the counterfeit\nof one block aﬀects all the blocks around it; and the con-\nstruction of codebooks would be very diﬃcult for the reason\nthat the identification of one block should take all the blocks\naround it into account.\n2180 EURASIP Journal on Applied Signal Processing\n(a) (b) (c)\nFigure 6: The original images: (a) Couple, (b) Tank, and (c) Pyramids.\n(a) (b) (c)\nFigure 7: The watermarked images with recovery bits.\n7. EXPERIMENTAL RESULTS\nThree 512×512 gray-scale images with diﬀerent contents and\ntextures were used to test our authentication algorithm. The\nblock size in our experiments was 8× 8. The original images\nare shown in Figure 6. The images shown in Figures 6a and\n6b are simple natural images, while Figure 6c is a satellite im-\nage with complex texture and fine details. Figure 7 displays\nthe respective watermarked image. We can see that the wa-\ntermarked images look identical to the original images, with\nPSNR greater than 33 dB.\nWe modified the content of the watermarked images in a\nsimilar way to the cutting and pasting attacks: all the mod-\nifications were performed by cutting and pasting blocks in\nthe same or similar watermarked images. The modification\nresults are shown in Figures 8a–8c. The modifications made\nto the respective images are as follows: the table in the bot-\ntom right corner was removed from the Couple image; the\ntank was shifted in the Tank image; and in the Pyramids im-\nage, some geographical textures were modified. As illustrated\nin Figures 8d–8f, the modified areas were accurately detected\nand identified. The approximately recovered images are also\npresented in Figure 8, which are shown to be visually accept-\nable. We define the probability of tamper detection PTD of\nthe authentication scheme as\nPTD = NUMdetectedNUMmodified , (25)\nwhere NUMmodified is the number of actually modified\nblocks, and NUMdetected is the number of correctly detected\nblocks. In our experiments, PTD without nonmalicious at-\ntacks was always higher than 98%.\nWe also tested the insensitivity of our algorithm to com-\npression. As shown in Figure 9, before compression, the out-\nput ρ of the watermark detection system sharply peaked at\n1; after compression, the values of ρ decreased as shown in\nthe same figure. To illustrate the advantage of PST water-\nmarking, we compare the performance of PST watermark-\ning with that of DCT watermarking. In the DCT water-\nmarking, the same watermark embedding method was used\nand the same middle frequency-band coeﬃcients were se-\nlected as those in the PST watermarking. The comparison\nwas based on the same PSNR values of the watermarked im-\nages and the results were obtained through averaging the\noutcomes of the three test images. We found that after the\nImage Content Authentication Using Pinned Sine Transform 2181\n(a) (b) (c)\n(d) (e) (f)\n(g) (h) (i)\nFigure 8: Sample results of the proposed watermarking scheme: (a)–(c) modified images, (d)–(f) authentication outputs, and (g)–(i)\nrestoration outputs.\ncompression, the drop in the detector output ρ for the PST\nwatermarking was smaller than that of the DCT watermark-\ning. This indicates that the PST watermarking is less sensitive\nto JPEG compression than the DCT watermarking, which\nmakes it a better candidate for semifragile watermarking.\nGiven a certain value of the threshold γ, the probability of\ndetection PD is shown as the shaded area in Figure 9. It is\napparent from this figure that the PD of the PST scheme\nis larger than that of DCT. The collective comparison re-\nsults with γ = 0.1 and varying compression quality factor\n(QF) values are reported in Figure 10. The higher values of\nPD indicated the better detection performance of PST over\nDCT. Even when the images were in very poor quality as\nshown in Figure 11, the PD of our scheme was still higher\nthan 95%.\nThe performance of our algorithm against JPEG com-\npression and additive noise from Stirmark 41 was also\ntested. After content modification, the watermarked image\nin Figure 8a was JPEG compressed with a QF of 90% and the\nwatermarked image in Figure 8c is added with an additive\nwhite Gaussian noise of zero mean and a variance of σ2 = 5,\nas shown in Figures 12a and 12b, respectively. As the recovery\nbits were simply inserted into the pixels’ LSBs, the recovery\nresults are no longer correct. However, such manipulations\nonly have minimum eﬀect on the authentication process. As\nindicated in Figures 12c and 12d, the modified area still can\nbe correctly identified.\n1www.cl.cam.ac.uk\/fapp2\/watermarking\/stirmark.\n2182 EURASIP Journal on Applied Signal Processing\nPST\nDCT\n−1 −0.6 −0.2 0.2 0.6 1\nρ\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\nFr\neq\nu\nen\ncy\nof\noc\ncu\nrr\nen\nce Before compression\nAfter compression\nThreshold\nFigure 9: The distribution of the watermark detection outputs before and after JPEG compression (QF = 40).\nPST\nDCT\n10 20 30 40 50 60 70 80 90 100\nCompression (QF)\n80\n82\n84\n86\n88\n90\n92\n94\n96\n98\n100\nP\nD\n(%\n)\n(a)\nPST\nDCT\n101 102\nCompression (QF) (log scaled)\n80\n82\n84\n86\n88\n90\n92\n94\n96\n98\n100\nP\nD\n(%\n)\n(b)\nFigure 10: Comparisons between PST watermarking and conventional DCT watermarking: the probability of detection after (a) JPEG\ncompression and (b) wavelet compression.\n8. CONCLUSION AND FUTUREWORK\nIn this paper, we investigated the problem of the selective\ncontent authentication of digital images through a novel\nsemifragile watermarking using the pinned sine transform\n(PST). The watermark is embedded into the pinned field of\nPST, which contains the texture information of the original\nimage. This important property of the pinned field provides\nthe scheme with special sensitivity to any texture alteration of\nthe watermarked image. The eﬀectiveness of the newmethod\nhas been demonstrated by using natural scene images and\nsatellite images. In the authentication process, the probabil-\nity of detection was higher than 98%. The scheme was very\nrobust to cutting and pasting counterfeiting attacks. It was\nalso able to tolerate some common image processing manip-\nulations; the probability of detection after JPEG compression\nImage Content Authentication Using Pinned Sine Transform 2183\n(a) (b)\nFigure 11: Attacked images. (a)Watermarked Couple image after JPEG compression (QF= 40). (b)Watermarked Couple image after wavelet\ncompression (QF= 60).\n(a) (b)\n(c) (d)\nFigure 12: Sample authentication results after JPEG compression and additive noise from Stirmark 4. (a)Watermarked andmodified Couple\nimage after JPEG compression (QF= 90). (b) Watermarked and modified Pyramids image with additive noise (σ2 = 5). (c) Authentication\nresult of (a). (d) Authentication result of (b).\nand wavelet compression is higher than that of equivalent\nDCT scheme. In future work, we are interested in develop-\ning image authentication methods incorporating restoration\nthat can survive various nonmalicious manipulations.\nREFERENCES\n[1] I. J. Cox, M. L. Miller, and J. A. Bloom, Digital Watermark-\ning, Morgan Kauﬀman Publishers, San Francisco, Calif, USA,\n2001.\n[2] M.M. Yeung and F.Mintzer, “An invisible watermarking tech-\nnique for image verification,” in Proc. IEEE International Con-\nference on Image Processing (ICIP ’97), vol. 2, pp. 680–683,\nSanta Barbara, Calif, USA, October 1997.\n[3] P. W. Wong, “A watermark for image integrity and ownership\nverification,” in Proc. IS & T’s Image Processing, Image Quality,\nImage Capture, Systems Conference (PICS ’98), pp. 374–379,\nPortland, Ore, USA, May 1998.\n[4] P. W. Wong, “A public key watermark for image verification\nand authentication,” in Proc. IEEE International Conference on\n2184 EURASIP Journal on Applied Signal Processing\nImage Processing (ICIP ’98), vol. 1, pp. 455–459, Chicago, Ill,\nUSA, October 1998.\n[5] J. Fridrich and M. Goljan, “Images with self-correcting capa-\nbilities,” in Proc. IEEE International Conference on Image Pro-\ncessing (ICIP ’99), vol. 3, pp. 792–796, Kobe, Japan, October\n1999.\n[6] C.-Y. Lin and S.-F. Chang, “Semifragile watermarking for au-\nthenticating JPEG visual content,” in Security andWatermark-\ning of Multimedia Contents II, vol. 3971 of Proceedings of SPIE,\npp. 140–151, San Jose, Calif, USA, January 2000.\n[7] D. Kundur and D. Hatzinakos, “Digital watermarking for tell-\ntale tamper proofing and authentication,” Proceedings of the\nIEEE, vol. 87, no. 7, pp. 1167–1180, 1999.\n[8] C.-S. Lu and H.-Y. M. Liao, “Multipurpose watermarking for\nimage authentication and protection,” IEEE Trans. Image Pro-\ncessing, vol. 10, no. 10, pp. 1579–1592, 2001.\n[9] L. Me and G. R. Arce, “A class of authentication digital\nwatermarks for secure multimedia communication,” IEEE\nTrans. Image Processing, vol. 10, no. 11, pp. 1754–1764, 2001.\n[10] M. U. Celik, G. Sharma, E. Saber, and A. M. Tekalp, “Hier-\narchical watermarking for secure image authentication with\nlocalization,” IEEE Trans. Image Processing, vol. 11, no. 6, pp.\n585–595, 2002.\n[11] M. Holliman and N. Memon, “Counterfeiting attacks\non oblivious block-wise independent invisible watermarking\nschemes,” IEEE Trans. Image Processing, vol. 9, no. 3, pp. 432–\n441, 2000.\n[12] A. Z.Meiri and E. Yudilevich, “A pinned sine transform image\ncoder,” IEEE Trans. Communications, vol. 29, no. 12, pp. 1728–\n1735, 1981.\n[13] A. K. Jain, “Some new techniques in image processing,” in\nProc. ONR Symposium on Current Problems in Image Science,\nO. Wilde and E. Barrett, Eds., pp. 201–223, Monterey, Calif,\nUSA, November 1976.\n[14] A. Z. Meiri, “The pinned Karhunen-Loeve transform of a two\ndimensional Gauss-Markov field,” in Proc. SPIE Conference\nImage Processing, San Diego, Calif, USA, 1976.\n[15] A. K. Jain, Fundamentals of Digital Image Processing, Prentice-\nHall, Englewood Cliﬀs, NJ, USA, 1989.\n[16] W. K. Pratt, Digital Image Processing, JohnWiley & Sons, New\nYork, NY, USA, 2nd edition, 1991.\nAnthony T. S. Ho is currently an Associate\nProfessor in the Division of Information\nEngineering, School of Electrical and Elec-\ntronic Engineering, Nanyang Technological\nUniversity (NTU). He is also the Program\nDirector for Digital Watermarking, Centre\nfor Information Security at NTU. He co-\nfounded DataMark Technologies (DMT) in\n1998 which specializes in digital watermark-\ning and steganography. He obtained his B.S.\ndegree (Honors) in physical electronics from the University of\nNorthumbria, UK, in 1979, his M.S. degree in applied optics from\nImperial College of Science, Technology and Medicine, University\nof London, in 1980, and his Ph.D. degree in digital image process-\ning from King’s College, University of London, in 1983. He is a Fel-\nlow of the Institution of Electrical Engineers (FIEE), a Chartered\nElectrical Engineer (C.Eng.), and a Senior Member of the Institute\nof Electrical and Electronic Engineers (SMIEEE). He also serves as\na Director on the Board of DMT and provides consultancy to the\ncompany.\nXunzhan Zhu was born in 1980 in Zhe-\njiang, China. She received her B.S. degree in\n2002 in communication engineering from\nBeijing University of Posts and Telecommu-\nnications, China. She is now a Ph.D. can-\ndidate at the School of Electrical and Elec-\ntronic Engineering at Nanyang Technologi-\ncal University (NTU), Singapore. Her cur-\nrent research area is digital image water-\nmarking.\nYong Liang Guan received his B.Eng. and\nPh.D. degrees from the National Univer-\nsity of Singapore and Imperial College of\nScience, Technology and Medicine, Uni-\nversity of London, respectively. He is cur-\nrently an Assistant Professor at the School\nof Electrical and Electronic Engineering,\nNanyang Technological University (NTU),\nSingapore. He is also the Program Direc-\ntor of theWireless Network Research Group\nin the Positioning and Wireless Technology Center (PWTC), and\nthe Deputy Director of the Center for Information Security, NTU.\nHis research interests include digital multimedia watermarking, ad-\nvanced modulation and coding, and broadband channel modeling.\n:: Open Access ::\nEURASIP Journal on\nAudio, Speech, and Music Processing\nh t t p : \/ \/ w w w . h i n d a w i . c o m \/ j o u r n a l s \/ a s m p \/\nSpecial Issue on\nIntelligent Audio, Speech, and Music Processing Applications\nCall for Papers\nFuture audio, speech, and music processing applications need inno-\nvative intelligent algorithms that allow for human\/environmental-\nbased interactive interfaces with surrounding devices\/systems in real-\nworld settings. The need exists to control, process, render, and play-\nback\/project sound signals for diﬀerent platforms under a diverse\nrange of listening environments. The presence of these intelligent au-\ndio, speech, and music processing applications will create an envi-\nronment that is sensitive, adaptive, and responsive to the presence of\nusers.\nGenerally, three areas of research are considered, namely, analysis,\ncommunication, and interaction. Analysis covers both preprocessing\nof sound signals and extraction of information from the environment.\nCommunication covers the transmission path\/network, coding tech-\nniques, and conversion between spatial audio formats. The final area\ninvolves intelligent interaction with the audio\/speech\/music environ-\nment based on the users’ location, signal information, and acoustical\nenvironment.\nThis special issue includes a variety of intelligent devices and ap-\nplications working together to create an integral audio experi-\nence\/environment for the users. A vision of intelligent signal process-\ning environments and applications can also be proposed and describe\nhow new audio\/speech\/music applications can enhance everyday en-\ntertainment as well as human communication experiences.\nTopics of interest include (but are not limited to):\n• 3D and spatial audio\n• Automotive audio\n• Audio\/speech installation\n• Audio network\n• Audio\/speech delivery\n• Audio\/speech for mobile and handheld\/wearable devices\n• Environmental noise controlactive & passive\n• Embedded audio\/speech intelligence\n• Intelligent speech communication\n• Coding techniques\n• Music processing\n• Personal soundscape\/personal audio space\n• Speech enhancement\n• New applications\/domains\nAuthors should follow the EURASIP Journal on Audio, Speech, and\nMusic Processing manuscript format described at the journal site\nhttp:\/\/www.hindawi.com\/journals\/asmp\/. Prospective authors should\nsubmit an electronic copy of their complete manuscript through the\njournal Manuscript Tracking System at http:\/\/mts.hindawi.com\/, ac-\ncording to the following timetable:\nManuscript Due January 1, 2008\nFirst Round of Reviews March 1, 2008\nPublication Date July 1, 2008\nGuest Editors\nWoon-Seng Gan, Digital Signal Processing Laboratory, School of\nElectrical and Electronic Engineering, Nanyang Technological\nUniversity, 50 Nanyang Avenue, Singapore 639798;\newsgan@ntu.edu.sg\nSen M. Kuo, Department of Electrical Engineering, Northern\nIllinois University, Dekalb, IL 60115, USA; kuo@ceet.niu.edu\nJohn H. L. Hansen, Department of Electrical Engineering,\nUniversity of Texas at Dallas, Richardson, TX 75083, USA;\njohn.hansen@utdallas.edu\nHindawi Publishing Corporation\n410 Park Avenue, 15th Floor, #287 pmb, New York, NY 10022, USA \u0002INDAWI\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n         \n\n      \n\n          \n         \n       \n        \n \n           \n\n\n•        \n     \n     \n \n     \n\n• \n\n     \n\n•      \n\n•      \n\n\n• \n• \n• \n\n           \n\n\n\n\n\n\n\n         \n\n\n\n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}