{"doi":"10.1108\/00251741011076807","coreId":"141013","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5091","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5091","10.1108\/00251741011076807"],"title":"Auditing employee ownership in a neo-liberal world","authors":["Knyght, P. R.","Kouzmin, Alexander","Kakabadse, Nada K.","Kakabadse, Andrew P."],"enrichments":{"references":[{"id":37923709,"title":"A research model to investigate the organizational impact of an","authors":[],"date":"2003","doi":"10.1108\/01443330310790390","raw":"Hallock, S. and Salazar, R. J. (2003), “A research model to investigate the organizational impact of an ESOP,” International Journal of Sociology and Social Policy, Vol. 23, No. 12, pp. 47-63.","cites":null},{"id":37923803,"title":"A stake in the outcome: Building a culture of ownership for the long term success of your business, Currency,","authors":[],"date":"2002","doi":null,"raw":"Stack, J. and Burlingham, B. (2002), A stake in the outcome: Building a culture of ownership for the long term success of your business, Currency, New York.","cites":null},{"id":37923766,"title":"A Statistical Profile of Employee Ownership”, National Centre for Employee Ownership, http:\/\/www.nceo.org\/library\/eo_stat.html http:\/\/www.nceo.org\/esops\/index.html (Accessed:","authors":[],"date":null,"doi":null,"raw":"NCEO, (2008c), “A Statistical Profile of Employee Ownership”, National Centre for Employee Ownership, http:\/\/www.nceo.org\/library\/eo_stat.html http:\/\/www.nceo.org\/esops\/index.html (Accessed: 03.03.2008).","cites":null},{"id":37923765,"title":"A statistical profile of employee ownership&quot;, National Center for Employee Ownership,","authors":[],"date":null,"doi":null,"raw":"NCEO, (2005b), &quot;A statistical profile of employee ownership&quot;, National Center for Employee Ownership, Oakland, CA, March, http:\/\/www.nceo.org\/library\/eo_stat.html (Accessed: 05.03.2008).33 NCEO, (2008a), “A Short History of the ESOP”, National Centre for Employee Ownership, http:\/\/www.nceo.org\/library\/history.html, http:\/\/www.nceo.org\/esops\/index.html (Accessed: 03.03.2008) NCEO, (2008b), “Employee Stock Ownership Plans (ESOPs)”, National Centre for Employee Ownership, http:\/\/www.nceo.org\/esops\/index.html (Accessed: 03.03.2008).","cites":null},{"id":37923679,"title":"Banks and labour as stakeholders: Impact on economic performance”, IMF Working paper, International Monetary Fund","authors":[],"date":"2008","doi":"10.5089\/9781451870879.001","raw":"Claessens, S. and Ueda, K. (2008), “Banks and labour as stakeholders: Impact on economic performance”, IMF Working paper, International Monetary Fund Washington, DC.","cites":null},{"id":37923767,"title":"Beyond stock options: Phantom stock, restricted stock, restricted stock Units, stock appreciation rights, and other equity alternatives","authors":[],"date":"1982","doi":"10.1177\/2374556815598299","raw":"NCEO, (2008d), Beyond stock options: Phantom stock, restricted stock, restricted stock Units, stock appreciation rights, and other equity alternatives (6th ed.), February, http:\/\/www.nceo.org\/pubs\/beyondstockoptions.html NYSE (New York Stock Exchanges). (1982), “People and productivity: A challenge to corporate America, Office of Economic Research, New York.","cites":null},{"id":37923781,"title":"Broad-based employee financial participation in the European Union&quot;,","authors":[],"date":"2003","doi":"10.1080\/0958519032000106128","raw":"Poutsma, E. and de Nijs, W. (2003), &quot;Broad-based employee financial participation in the European Union&quot;, International Journal of Human Resource Management, Vol. 14, No. 6, pp. 863-92.","cites":null},{"id":37923801,"title":"Broad-based employee stock options in U.S. ‘New economy’ firms&quot;,","authors":[],"date":"2002","doi":"10.1111\/1467-8543.00232","raw":"Sesil, J. C., Kroumova, M. K., Blasi, J. R. and Kruse, D. L. (2002), &quot;Broad-based employee stock options in U.S. ‘New economy’ firms&quot;, British Journal of Industrial Relations, Vol. 40, No.2, pp. 273-94.","cites":null},{"id":37923771,"title":"Characteristics of workplaces with financial participation: evidence from the WIRS’,","authors":[],"date":"1997","doi":"10.1111\/1468-2338.00047","raw":"Pendleton, A. (1997) ‘Characteristics of workplaces with financial participation: evidence from the WIRS’, Industrial Relations Journal, 28, pp.103-19 Pendleton, A. (2001), Employee ownership, participation and governance: a study of ESOPs in the UK, Routledge, London.","cites":null},{"id":37923727,"title":"Control in Organizational Analysis: The Lost Politics”,","authors":[],"date":"1980","doi":null,"raw":"Kouzmin, A. (1980), “Control in Organizational Analysis: The Lost Politics”, in Dunkerley, D. and Salaman, G. (Eds.), 1979 International Yearbook of Organizational Studies, Routledge and Kegan Paul, London, pp. 56-89.","cites":null},{"id":37923808,"title":"Cooperatives: Principles and practices in the 21st century, Cooperative Extension Publications,","authors":[],"date":"2004","doi":null,"raw":"Zeuli, K. A. and Cropp, R. (2004), Cooperatives: Principles and practices in the 21st century, Cooperative Extension Publications, Wisconsin.","cites":null},{"id":37923726,"title":"Correlates of employee satisfaction with stock ownership: Who likes an ESOP most?&quot;","authors":[],"date":"1988","doi":"10.1037\/\/0021-9010.73.4.630","raw":"Klein, K. J. and Hall, R.J. (1988), &quot;Correlates of employee satisfaction with stock ownership: Who likes an ESOP most?&quot; Journal of Applied Psychology, Vol. 73, No.4, pp. 630-8.","cites":null},{"id":37923723,"title":"Directors’ remuneration: The need for a geo-political perspective”,","authors":[],"date":"2004","doi":"10.1108\/00483480410550161","raw":"Kakabadse, N., Kakabadse, A. and Kouzmin, A. (2004), “Directors’ remuneration: The need for a geo-political perspective”, Personnel Review, Vol. 33, No. 5, pp. 561-582.31 Kato, T. and Morishima, M. (2002), “The productivity effects of participatory employment practices: Evidence from new Japanese panel data”. Industrial Relations, Vol. 41, No. 4, pp. 487-520.","cites":null},{"id":37923770,"title":"Does employee ownership enhance firm survival?&quot; Employee Participation, Firm Performance and","authors":[],"date":"2004","doi":"10.1016\/s0885-3339(04)08001-9","raw":"Park, R., Kruse, D. and Sesil, J. (2004), &quot;Does employee ownership enhance firm survival?&quot; Employee Participation, Firm Performance and Survival Advances in the Economic Analysis of Participatory and Labour-Managed Firms, Vol. 8, pp. 3-33.","cites":null},{"id":37923701,"title":"Does good governance include employee representation? Evidence from German corporate boards”,","authors":[],"date":"2006","doi":"10.2139\/ssrn.534422","raw":"Fauver, L. and Fuerst, M. E. (2006), ”Does good governance include employee representation? Evidence from German corporate boards”, Journal of Financial Economics, Vol. 82, pp. 673-710.","cites":null},{"id":37923684,"title":"Effects of profit sharing plans on union organising efforts,&quot;","authors":[],"date":"1970","doi":null,"raw":"Czarnecki, E. R. (1970), &quot;Effects of profit sharing plans on union organising efforts,&quot; Personnel Journal, pp. 763-73.","cites":null},{"id":37923763,"title":"Employee financial participation: Evidence from a major UK retailer”’,","authors":[],"date":"2006","doi":"10.1108\/01425450610673394","raw":"Morris, D., Bakan, U. and Wood, G. (2006), “Employee financial participation: Evidence from a major UK retailer”’, Employee Relations, Vol. 28, No. 4, pp. 326-341.","cites":null},{"id":37923759,"title":"Employee investment funds: An approach to collective capital formation, George Allen and Unwin,","authors":[],"date":"1978","doi":null,"raw":"Meidner, R. (1978), Employee investment funds: An approach to collective capital formation, George Allen and Unwin, London.","cites":null},{"id":37923755,"title":"Employee ownerhsip and attitudes toward the union: An empirical study,”","authors":[],"date":"1978","doi":"10.7202\/028864ar","raw":"Long, R.J. (1978), ”Employee ownerhsip and attitudes toward the union: An empirical study,” Industrial Relations, Vol. 33, No. 2, pp. 237-254.","cites":null},{"id":37923743,"title":"employee owners in ESOP firms: Human resource policies and company performance”,","authors":[],"date":"2003","doi":"10.3386\/w10177","raw":"Kruse, D., Freeman, R.B., Blasi, J., Buchele, R., Scharf, A., Rodgers, L. and Mackin, C. (2003),”Motivating employee owners in ESOP firms: Human resource policies and company performance”, NBER Working Paper No. 10177, National Bureau of Economic Research, Cambridge, http:\/\/www.nber.org\/papers\/w10177.pdf (accessed: 20.02.2009).","cites":null},{"id":37923706,"title":"Employee ownership, board representation, and corporate financial policies”, Social Science Research January,","authors":[],"date":"2010","doi":"10.2139\/ssrn.1259609","raw":"Ginglinger, E, Megginson, W. L. and Waxin, T. (2010), “Employee ownership, board representation, and corporate financial policies”, Social Science Research January, papers.ssrn.com\/sol3\/papers.cfm?abstract_id=1252645 (accessed: 15.04.2010).","cites":null},{"id":37923732,"title":"Employee ownership, employee attitudes, and firm performance: a review of the evidence,’","authors":[],"date":"1997","doi":"10.3386\/w5277","raw":"Kruse, D. and Blasi, J. (1997) ‘Employee ownership, employee attitudes, and firm performance: a review of the evidence,’ in Lewin, D., Mitchell, D. and Zaira, M (eds.), The Human Resource Management Handbook, London: JAI Press.","cites":null},{"id":37923761,"title":"Employee ownership, motivation and productivity, The Work Foundation,","authors":[],"date":"2002","doi":null,"raw":"Michie, J., Oughton, C. and Bennion, Y. (2002), Employee ownership, motivation and productivity, The Work Foundation, London, November. www.efesonline.org\/LIBRARY\/Employees20Dircet20Report.qxd.pdf.","cites":null},{"id":37923661,"title":"Employee ownership: Revolution or rip off?","authors":[],"date":"1988","doi":"10.2307\/2072574","raw":"Blasi, J. (1988), Employee ownership: Revolution or rip off? Ballingen Publishing Company, Cambridge.","cites":null},{"id":37923779,"title":"Employee participation and tax obstacles in the EU, European Federation of Employee Share Ownership (EFES),","authors":[],"date":"2003","doi":null,"raw":"Pourceau, F. (2003), Employee participation and tax obstacles in the EU, European Federation of Employee Share Ownership (EFES), Brussels.","cites":null},{"id":37923775,"title":"Employee participation in profit and ownership: a review of the area and evidence’, Luxembourg: European Parliament, Directorate General for Research: Working Paper,","authors":[],"date":"2003","doi":null,"raw":"Pérotin, V., and Robinson, A. (2003) ‘Employee participation in profit and ownership: a review of the area and evidence’, Luxembourg: European Parliament, Directorate General for Research: Working Paper, SOCI 109 EN.","cites":null},{"id":37923659,"title":"Employee participation, ownership and productivity: A theoretical framework’,","authors":[],"date":"1995","doi":"10.1111\/j.1468-232x.1995.tb00387.x","raw":"Ben-ner, A. and Jones, D.C. (1995), ‘Employee participation, ownership and productivity: A theoretical framework’, Industrial Relations, Vol. 34, No. 4, pp.532 – 554.","cites":null},{"id":37923703,"title":"Employee perspectives on stock ownership: Financial investment or mechanism of control”,","authors":[],"date":"1987","doi":"10.2307\/258510","raw":"French, J. (1987), ”Employee perspectives on stock ownership: Financial investment or mechanism of control”, Academy of Management Review, Vol. 12, No. 3, pp.427-435.","cites":null},{"id":37923772,"title":"Employee share ownership, employment relationships, and corporate governance’,","authors":[],"date":"2005","doi":null,"raw":"Pendleton, A. (2005) ‘Employee share ownership, employment relationships, and corporate governance’, in Harley, B., Hyman, J. and Thompson, P. (eds.), Participation and Democracy at Work: Essays in Honour of Harvie Ramsay, London: Palgrave, pp. 75-93.","cites":null},{"id":37923784,"title":"Employee share ownership: safeguarding investments in human capital,","authors":[],"date":"2005","doi":"10.1111\/j.1467-8543.2005.00365.x","raw":"Robinson, A. and Zhang, H. (2005), ‘Employee share ownership: safeguarding investments in human capital, British Journal of Industrial Relations. Vol. 43, No.3, pp. 469 – 488 Rosen, C. and Carberry, E. (2002), Ownership management: Building a culture of lasting innovation, National Center for Employee Ownership, Oakland, CA.","cites":null},{"id":37923764,"title":"Employee stock options fact sheet&quot;, National Center for Employee Ownership,","authors":[],"date":null,"doi":null,"raw":"NCEO, (2005a), &quot;Employee stock options fact sheet&quot;, National Center for Employee Ownership, Oakland, CA, March, www.nceo.org\/library\/optionfact.html.","cites":null},{"id":37923725,"title":"Employee stock ownership and employee attitudes: A test of three models&quot;,","authors":[],"date":"1987","doi":"10.1037\/\/0021-9010.72.2.319","raw":"Klein, K. J. (1987), &quot;Employee stock ownership and employee attitudes: A test of three models&quot;, Journal of Applied Psychology, Vol. 72, No. 2, pp. 319-32.","cites":null},{"id":37923798,"title":"Employee stock ownership plans (ESOPs)”,","authors":[],"date":"2008","doi":"10.4135\/9781412956260.n277","raw":"SEC (Securities and Exchange Commission) (2008), “Employee stock ownership plans (ESOPs)”, http:\/\/www.sec.gov\/answers\/esops.htm(Accessed: 05.03.2008).","cites":null},{"id":37923758,"title":"Employee stock ownership plans: Union influence and stakeholder interests&quot;,","authors":[],"date":"1999","doi":"10.1177\/0143831x99204003","raw":"McHugh, P., Cutcher-Gershenfeld, J. and Polzin, M. (1999), &quot;Employee stock ownership plans: Union influence and stakeholder interests&quot;, Economic and Industrial Democracy, Vol. 20, pp. 535-560.","cites":null},{"id":37923804,"title":"Employee-owned companies”,","authors":[],"date":"1983","doi":"10.1787\/eco_surveys-mex-2013-graph12-en","raw":"Tannenbaum, A. S. (1983), “Employee-owned companies”, Research in Organizational Behaviour, Vol. 5, No. 2, pp. 235-268.","cites":null},{"id":37923786,"title":"Equity: Why employee ownership is good for business,","authors":[],"date":"2005","doi":null,"raw":"Rosen, C., Case, J. and Staubus, M. (2005a), Equity: Why employee ownership is good for business, Harvard Business School Press, Boston.","cites":null},{"id":37923789,"title":"ESOPs grow significantly","authors":[],"date":"2008","doi":null,"raw":"Rosen, G. (2008), “ESOPs grow significantly in 2007”, The National Centre for Employee Ownership (NVEO), http:\/\/www.nceo.org\/columns\/cr247.html (accessed: 07.05.2008).","cites":null},{"id":37923698,"title":"Federation of Employee Share Ownership),","authors":[],"date":"2008","doi":null,"raw":"EFESO (European Federation of Employee Share Ownership), (2008), EFES Newsletter, March 8, Brussels. http:\/\/www.efesonline.org\/efes20news\/2008\/efes20newsletter20203-200820en.htm (Accessed: 05.03.2008).","cites":null},{"id":37923730,"title":"From phobias and ideological prescription: Towards multiple models in transformation management for socialist economies in transition,”","authors":[],"date":"1997","doi":"10.1177\/009539979702900202","raw":"Kouzmin, A. and Korac-Kakabadse, N. (1997), “From phobias and ideological prescription: Towards multiple models in transformation management for socialist economies in transition,” Administration & Society, Vol. 29, No. 2, May, pp. 139-188.","cites":null},{"id":37923729,"title":"Fundamentalism, Delusions and Epistemic Failure in Policy and Administration”,","authors":[],"date":"2009","doi":"10.1108\/17574320910942150","raw":"Kouzmin, A. (2009),”Market Fundamentalism, Delusions and Epistemic Failure in Policy and Administration”, Asia-Pacific Journal of Business Administration, Vol.1, Issue 1, March\/April, pp. 23-39.","cites":null},{"id":37923690,"title":"Home page&quot;, European Federation of Employee Share Ownership, Brussels, available at: www.efesonline.org,","authors":[],"date":"2005","doi":null,"raw":"EFESO (2005), &quot;Home page&quot;, European Federation of Employee Share Ownership, Brussels, available at: www.efesonline.org, (Accessed: 05.03.2008).","cites":null},{"id":37923724,"title":"How to turn eighty million workers into capitalists on borrowed money, Random House,","authors":[],"date":"1967","doi":null,"raw":"Kelso, L. and Hetter, P. (1967), How to turn eighty million workers into capitalists on borrowed money, Random House, New York.","cites":null},{"id":37923800,"title":"impact of employee-share-ownership schemes on performance in unionized and non-unionized workplaces”,","authors":[],"date":"2008","doi":"10.1111\/j.1468-2338.2007.00483.x","raw":"Sengupta, S. (2008),”The impact of employee-share-ownership schemes on performance in unionized and non-unionized workplaces”, Industrial Relations Journal, Vol. 39, No. 3, pp. 170-90.35 Sengupta, S., Whitfield, K. and McNabb, B. (2007), ‘Employee share ownership and performance: Golden path or golden handcuffs?’ The International Journal of Human Resource Management, Vol. 18, pp. 1507 – 1538.","cites":null},{"id":37923665,"title":"In the company of owners: the truth about stock options (and why every employee should have them), Basic Books,","authors":[],"date":"2003","doi":"10.5860\/choice.40-5283","raw":"Blasi, J., Kruse, D. and Bernstein, A. (2003), In the company of owners: the truth about stock options (and why every employee should have them), Basic Books, New York.","cites":null},{"id":37923664,"title":"In the company of owners: The truth about stock options and why every employee should Have them, Basic Books,","authors":[],"date":"2002","doi":"10.5465\/amp.2006.21903491","raw":"Blasi, J., Kruse, D. and Bernstein, A. (2002), In the company of owners: The truth about stock options and why every employee should Have them, Basic Books, New York.","cites":null},{"id":37923773,"title":"Incentives, Monitoring, and Employee Stock Ownership Plans: New Evidence and Interpretations’,","authors":[],"date":"2006","doi":"10.1111\/j.1468-232x.2006.00450.x","raw":"Pendleton, A. (2006) ‘Incentives, Monitoring, and Employee Stock Ownership Plans: New Evidence and Interpretations’, Industrial Relations, 45 (4), pp.753–77.","cites":null},{"id":37923806,"title":"Industrial cooperation: The story of a peaceful revolution, Cooperative","authors":[],"date":"1912","doi":null,"raw":"Webb, C. (1912), Industrial cooperation: The story of a peaceful revolution, Cooperative Union, Manchester.","cites":null},{"id":37923708,"title":"Innovation in small businesses: Culture and ownership structures do matter”,","authors":[],"date":"2003","doi":null,"raw":"Gudmundson, D., Tower, C.B. and Hartman, E.A. (2003), “Innovation in small businesses: Culture and ownership structures do matter”, Journal of Developmental Entrepreneurship, Vol. 8, No. 1, pp.1-17.","cites":null},{"id":37923731,"title":"Intellectual capital, monitoring and risk: what predicts the adoption of broad-based employee stock options?&quot; SSRN Working Paper Series.","authors":[],"date":"2005","doi":"10.2139\/ssrn.456040","raw":"Kroumova, M. and Sesil, J.C. (2005), &quot;Intellectual capital, monitoring and risk: what predicts the adoption of broad-based employee stock options?&quot; SSRN Working Paper Series.","cites":null},{"id":37923722,"title":"Leading the Board,","authors":[],"date":"2008","doi":"10.1057\/9780230589667","raw":"Kakabadse, A. and Kakabdse, N. (2008), Leading the Board, Plagrave, London.","cites":null},{"id":37923760,"title":"Measuring performance: Differences between capitalist and labour-owned enterprises”,","authors":[],"date":"2007","doi":"10.1108\/03068290710760254","raw":"Melgarejo, Z., Arcelus, F.J. and Simon, K. (2007), “Measuring performance: Differences between capitalist and labour-owned enterprises”, International Journal of Social Economics, Vol. 34, No. 7, pp. 485-501.","cites":null},{"id":37923702,"title":"Monitoring colleagues at work: Profit sharing, employee ownership, broad-based stock options and workplace performance in the United States’, A paper presented at the Association","authors":[],"date":"2004","doi":"10.7208\/chicago\/9780226056968.003.0005","raw":"Freeman, R.B., Kruse, D. and Blasi, J. (2004), ’Monitoring colleagues at work: Profit sharing, employee ownership, broad-based stock options and workplace performance in the United States’, A paper presented at the Association for30 Comparative Economic Studies Conference, Manchester Grand Hyatt, San Diego, 3-5 January.","cites":null},{"id":37923682,"title":"Mutuality: Invaluable lessons from a classic model’,","authors":[],"date":"2006","doi":"10.1108\/02580540610644032","raw":"Couper, F. (2006), ‘Mutuality: Invaluable lessons from a classic model’, Strategic Direction, Vol. 22, No. 2, pp. 6-8.","cites":null},{"id":37923658,"title":"North American employee ownership survey results”,","authors":[],"date":"2002","doi":null,"raw":"BCI Group. (2002), “North American employee ownership survey results”, Pension Benefits, Vol. 9, Issue 8, p. 6.","cites":null},{"id":37923807,"title":"Ownership and the changing employment relationship: A comment on Rousseau and Shperling&quot;,","authors":[],"date":"2004","doi":"10.2307\/20159069","raw":"Zardkoohi, A. and Paetzold, R. L. (2004), &quot;Ownership and the changing employment relationship: A comment on Rousseau and Shperling&quot;, Academy of Management Review, Vol. 29, No.4, pp. 556-562.","cites":null},{"id":37923795,"title":"Ownership and the changing employment relationship: Why stylized notions of labour no longer generally apply – a reply to Zardkoohi and Paetzold&quot;,","authors":[],"date":"2004","doi":"10.5465\/amr.2004.14497608","raw":"Rousseau, D. M. and Shperling, Z. (2004), &quot;Ownership and the changing employment relationship: Why stylized notions of labour no longer generally apply – a reply to Zardkoohi and Paetzold&quot;, Academy of Management Review, Vol. 29, No.4, pp. 562-9.","cites":null},{"id":37923745,"title":"Ownership reform amongst state firms in China and its implications”,","authors":[],"date":"2005","doi":"10.1108\/00251740510593567","raw":"Li, J., Lam, K. and Moy, J.W. (2005), “Ownership reform amongst state firms in China and its implications”, Management Decision, Vol. 43, No. 4, pp. 568-588.32 LO Lands Organization in Denmark (Federation of Danish Unions) (1980), Economic democracy – co-ownership and co-determination of employees as seen from the point of view of the Danish trade union movement, JMF\/GM, Copenhagen.","cites":null},{"id":37923768,"title":"Participation and work attitudes in Yugoslavia”,","authors":[],"date":"1970","doi":"10.1111\/j.1468-232x.1970.tb00503.x","raw":"Obradovic, J. (1970), “Participation and work attitudes in Yugoslavia”, Industrial Relations, Vol. 9, No. 2, pp.161-169.","cites":null},{"id":37923667,"title":"Paying for productivity - A look at the evidence,","authors":[],"date":"1990","doi":"10.5860\/choice.28-0415","raw":"Blinder, A.S. (ed.) (1990), Paying for productivity - A look at the evidence, Washington, DC, The Brookings Institute.","cites":null},{"id":37923793,"title":"Pieces of the action: Ownership and the changing employment relationship&quot;,","authors":[],"date":"2003","doi":"10.5465\/amr.2003.10899368","raw":"Rousseau, D.M. and Shperling, Z. (2003), &quot;Pieces of the action: Ownership and the changing employment relationship&quot;, Academy of Management Review, Vol. 28 No.4, pp. 553-570.","cites":null},{"id":37923796,"title":"Privatization and popular capitalism,","authors":[],"date":"1994","doi":"10.2307\/1410411","raw":"Saunders, P. and Harris, C. (1994), Privatization and popular capitalism, Open University Press, Buckingham.","cites":null},{"id":37923776,"title":"Producing sustainable competitive advantage through the effective management of people&quot;,","authors":[],"date":"1995","doi":"10.5465\/ame.1995.9503133495","raw":"Pfeffer, J. (1995), &quot;Producing sustainable competitive advantage through the effective management of people&quot;, Academy of Management Executive, Vol. 9, No.1, pp. 55-69.34 Poole, M. (1988), &quot;Factors affecting the development of employee financial participation in contemporary Britain: Evidence from a national survey&quot;, British Journal of Industrial Relations, Vol. 26, No.1, pp. 21-36.","cites":null},{"id":37923686,"title":"Profit sharing, firm performance and union influence in selected European countries,&quot;","authors":[],"date":"2004","doi":"10.1108\/00483480410528869","raw":"D' Art, D. and Turner, T. (2004), &quot;Profit sharing, firm performance and union influence in selected European countries,&quot; Personnel Review, Vol. 33, No.3, pp. 335-50.","cites":null},{"id":37923805,"title":"reprinted 1999), Privatization surprises in transition economies:","authors":[],"date":"1997","doi":"10.5860\/choice.35-1645","raw":"Uvalić, M. and D. Vaughan-Whitehead (eds.), (1997, reprinted 1999), Privatization surprises in transition economies: Employee-ownership in Central and Eastern Europe, Edward Elgar, Cheltenham.","cites":null},{"id":37923728,"title":"Review Essay” – Labour Relations in Eastern Europe: Organizational Design and Dynamics [(Petkov, K. and Thirkell,","authors":[],"date":"1993","doi":"10.1177\/017084069301400109","raw":"Kouzmin, A. (1993), “Review Essay” – Labour Relations in Eastern Europe: Organizational Design and Dynamics [(Petkov, K. and Thirkell, J.E.M.), Routledge, London, 1991], Organizational Studies, Vol. 14, No. 1, pp. 127-132.","cites":null},{"id":37923742,"title":"Shared Capitalism in the U.S. Economy: Prevalence, Characteristics, and Employee Views of Financial Participation in Enterprises’, Paper presented for the Russell Sage\/NBER conference in","authors":[],"date":"2007","doi":"10.3386\/w14225","raw":"Kruse, D., Blasi, J. and Park, R. (2007) ‘Shared Capitalism in the U.S. Economy: Prevalence, Characteristics, and Employee Views of Financial Participation in Enterprises’, Paper presented for the Russell Sage\/NBER conference in New York City, October 2006.","cites":null},{"id":37923802,"title":"Sharing ownership via employee stock ownership”, in","authors":[],"date":"2003","doi":"10.3386\/w14233","raw":"Sesil, J. C., Kruse, D. L. and Blasi, J. R. (2003), “Sharing ownership via employee stock ownership”, in Sun, L. (Ed.), Ownership and governance of enterprises: Recent innovative developments, Palgrave Macmillan, New York, pp. 96-123.","cites":null},{"id":37923685,"title":"Social partnership in Ireland: a view from below,&quot;","authors":[],"date":"2000","doi":null,"raw":"D' Art, D. and Turner, T. (2000), &quot;Social partnership in Ireland: a view from below,&quot; The Journal of the Irish Academy of Management, Vol. 21, No.1, pp. 51-69.","cites":null},{"id":37923657,"title":"Stakeholder capitalism, corporate governance and firm value”, EFA","authors":[],"date":"2007","doi":"10.2139\/ssrn.968141","raw":"Allen, F., Carletti, E. and Marquez, R. (2007), ”Stakeholder capitalism, corporate governance and firm value”, EFA 2007 Ljubljana Meetings Paper, ECGI -Finance Working Paper No. 190\/2007, Wharton Financial Institutions Center Working Paper, No. 09-28.","cites":null},{"id":37923705,"title":"Stakeholders and the composition of the voting rights of the board of directors”,","authors":[],"date":"2008","doi":"10.2139\/ssrn.1087905","raw":"Galai, D. and Wiener, Z. (2008), “Stakeholders and the composition of the voting rights of the board of directors”, Journal of Corporate Finance, Vol. 14, pp. 107–117.","cites":null},{"id":37923662,"title":"stock ownership and corporate performance among public companies&quot;,","authors":[],"date":"1996","doi":"10.1177\/001979399605000104","raw":"Blasi, J., Conte, M. and Kruse, D. (1996),&quot;Employee stock ownership and corporate performance among public companies&quot;, Industrial and Labour Relations Review, Vol. 50, No.1, pp. 60-79.","cites":null},{"id":37923744,"title":"Strategic stakeholder perspective to ESOP negotiations: The case of United Airlines”,","authors":[],"date":"2003","doi":"10.1108\/00251740310468211","raw":"Lamberg, J.A., Savage, G.T. and Pajunen, K. (2003), “Strategic stakeholder perspective to ESOP negotiations: The case of United Airlines”, Management Decision, Vol. 41, No.4, pp. 383-393.","cites":null},{"id":37923683,"title":"The behaviour of worker cooperatives: the plywood companies of the Pacific Northwest&quot;,","authors":[],"date":"1992","doi":null,"raw":"Craig, B. and Pencavel, J. (1992), &quot;The behaviour of worker cooperatives: the plywood companies of the Pacific Northwest&quot;, American Economic Review, Vol. 82, pp. 1083-1105.","cites":null},{"id":37923688,"title":"The effect of executive stock option plans on stockholders and bondholders&quot;,","authors":[],"date":"1990","doi":"10.1111\/j.1540-6261.1990.tb03707.x","raw":"DeFusco, R. A., Johnson, R. R. and Zorn, T. S. (1990), &quot;The effect of executive stock option plans on stockholders and bondholders&quot;, The Journal of Finance, Vol. 45, No.2, pp. 617-627.","cites":null},{"id":37923721,"title":"The fit of employee ownership with other human resource management practices: Theoretical and empirical suggestions regarding the existence of an ownership high-performance work system, or “Theory O”,","authors":[],"date":"2006","doi":"10.1177\/0143831x06069009","raw":"Kaarsemaker, E., and Poutsma, E. (2006), “The fit of employee ownership with other human resource management practices: Theoretical and empirical suggestions regarding the existence of an ownership high-performance work system, or “Theory O”, Economic and Industrial Democracy, Vol. 27, No. 2, pp. 669-685.","cites":null},{"id":37923762,"title":"The history of Coatbridge co-operative Ssciety, http:\/\/www.monklands.co.uk\/CoatbridgeCo-operative\/index.htm http:\/\/www.nceo.org\/esops\/index.html (Accessed:","authors":[],"date":"2008","doi":null,"raw":"Monklands (2008), “The history of Coatbridge co-operative Ssciety, http:\/\/www.monklands.co.uk\/CoatbridgeCo-operative\/index.htm http:\/\/www.nceo.org\/esops\/index.html (Accessed: 03.03.2008).","cites":null},{"id":37923710,"title":"The impact of human resource management practices on turnover, productivity, and corporate financial performance,&quot;","authors":[],"date":"1995","doi":"10.2307\/256741","raw":"Huselid, M. A. (1995), &quot;The impact of human resource management practices on turnover, productivity, and corporate financial performance,&quot; Academy of Management Journal, Vol. 38, pp. 635-672.","cites":null},{"id":37923777,"title":"The origins of economic democracy: Profit sharing and employee shareholding schemes,","authors":[],"date":"1989","doi":"10.2307\/1060359","raw":"Poole, M. (1989), The origins of economic democracy: Profit sharing and employee shareholding schemes, Routledge, London.","cites":null},{"id":37923757,"title":"The PEPPER IV Report: Benchmarking of employee participation in profits and enterprise results in the member and candidate countries of the European Union (preliminary version for presentation to the European Parliament,","authors":[],"date":"2008","doi":null,"raw":"Lowitzsch, J. Hshi, I. and Woodword, R. (Eds.), (2008), The PEPPER IV Report: Benchmarking of employee participation in profits and enterprise results in the member and candidate countries of the European Union (preliminary version for presentation to the European Parliament, Strasbourg, May 21 2008), InterUniversity Centre at the Institute for Eastern European Studies, Free University of Berlin, Berlin May 2008. http:\/\/www.efesonline.org\/2008\/seventheuropeanmeeting\/Presentations\/DraftPE PPERIVReportStrasbourgEditionJensLowitzschandothers.pdf, (Accessed: 20.03.2009) Matsunaga, S. (1995), &quot;The effects of financial reporting costs on the use of employee stock options&quot;, The Accounting Review, Vol. 70, No.1, pp.1-26.","cites":null},{"id":37923774,"title":"The perceptions and effects of share ownership: Empirical evidence from employee buyouts&quot;,","authors":[],"date":"1998","doi":"10.1111\/1467-8543.00082","raw":"Pendleton, A., Wilson, M. and Wright, M. (1998), &quot;The perceptions and effects of share ownership: Empirical evidence from employee buyouts&quot;, British Journal of Industrial Relations, Vol. 36, pp. 99-123.","cites":null},{"id":37923681,"title":"The performance effects of employee ownership plans”","authors":[],"date":"1990","doi":null,"raw":"Conte, M. A. and Svenjar (1990), ”The performance effects of employee ownership plans” in Blinder, A. (ed.), Paying for productivity: A look at the evidence, Washington DC: Brookings Institution, pp. 143-18129 Conyon, M.J. and Freeman, R.B. (2001), Shared modes of compensation and firm performance: UK evidence. Working Paper 8448, National Bureau of Economic Research, Cambridge, MA, August. www.nber.org\/papers\/w8448.pd Core, J. E. and Guay, W.R. (2001), &quot;Stock options for non-executive employees,&quot; Journal of Financial Economics, Vol. 61, No.2, pp. 253-287.","cites":null},{"id":37923720,"title":"The productivity effects of employee stockownership plans and bonuses: Evidence from Japanese panel data&quot;,","authors":[],"date":"1995","doi":null,"raw":"Jones, D. C. and Kato, T. (1995), &quot;The productivity effects of employee stockownership plans and bonuses: Evidence from Japanese panel data&quot;, The American Economic Review, Vol. 85, No.3, pp. 391-414.","cites":null},{"id":37923782,"title":"The relationship between financial participation and other forms of employee participation:","authors":[],"date":"2006","doi":"10.1177\/0143831x06069006","raw":"Poutsma, E., Kalmi, P. and Pendleton, A. (2006), “The relationship between financial participation and other forms of employee participation: New survey evidence from Europe’, Economic and Industrial Democracy, Vol. 27, No. 2, pp. 637-668.","cites":null},{"id":37923753,"title":"The relative effects of share ownership versus control on job attitudes in an employee-owned company&quot;,","authors":[],"date":"1978","doi":"10.1177\/001872677803100901","raw":"Long, R. J. (1978), &quot;The relative effects of share ownership versus control on job attitudes in an employee-owned company&quot;, Human Relations, Vol. 31, No. 9, pp. 753-763.","cites":null},{"id":37923687,"title":"The revival of profit sharing: cyclical recurrence or paradigmatic shift?&quot;","authors":[],"date":"2005","doi":null,"raw":"D' Art, D. and Turner, T. (2005), &quot;The revival of profit sharing: cyclical recurrence or paradigmatic shift?&quot; Kemmy Business School, University of Limerick, Working Paper, Department of Personnel and Employment Relations, Limerick.","cites":null},{"id":37923704,"title":"The sociology of Max","authors":[],"date":"1972","doi":"10.2307\/588276","raw":"Freund, J. (1972), The sociology of Max Weber, Penguin, London.","cites":null},{"id":37923711,"title":"The structure and performance consequences of equity grants to employees of new economy firms,”","authors":[],"date":"2002","doi":"10.2139\/ssrn.296275","raw":"Ittner, C., Lambert, R. and Larcker, D. (2002), “The structure and performance consequences of equity grants to employees of new economy firms,” Journal of Accounting & Economics, Vol. 34, Nos. 1-3, pp. 89-127.","cites":null},{"id":37923668,"title":"Theoretical and empirical studies of producer co-operatives: Will the twain meet?&quot;","authors":[],"date":"1993","doi":null,"raw":"Bonin, J. P., Jones, D. C. and Putterman, L. (1993), &quot;Theoretical and empirical studies of producer co-operatives: Will the twain meet?&quot; Journal of Economic Literature, Vol. 31, pp. 1290-320.","cites":null},{"id":37923712,"title":"Theory of the firm: managerial behaviour, agency costs and ownership structure&quot;,","authors":[],"date":"1976","doi":"10.2139\/ssrn.94043","raw":"Jensen, M. and Meckling, W. (1976), &quot;Theory of the firm: managerial behaviour, agency costs and ownership structure&quot;, Journal of Financial Economics, Vol. 3, pp. 305-360.","cites":null},{"id":37923700,"title":"Trade Unions and Collective Capital Formation: A Review of initiatives in Western European Countries.","authors":[],"date":"1983","doi":null,"raw":"European Trade Union Institute (1983), Trade Unions and Collective Capital Formation: A Review of initiatives in Western European Countries. Brussels.","cites":null},{"id":37923680,"title":"Trends in ESOPs&quot;, in","authors":[],"date":"1992","doi":null,"raw":"Conte, M. A. and Lawrence, H. (1992), &quot;Trends in ESOPs&quot;, in Turner, J. and Beller, D. L. (Eds.), Trends in pensions, Government Printing Office, Washington, DC, pp.135-48.","cites":null},{"id":37923707,"title":"Unions and the incidence of performance-linked pay schemes in Britain’,","authors":[],"date":"1988","doi":"10.1016\/0167-7187(88)90008-2","raw":"Gregg, P. and Machin, S. (1988) ‘Unions and the incidence of performance-linked pay schemes in Britain’, International Journal of Industrial Organisation, (6), pp.91-107.","cites":null},{"id":37923656,"title":"Updating the determinants of firm performance: Estimation using the","authors":[],"date":"2001","doi":"10.1111\/1467-8543.00204","raw":"Addison, J. and Belfield, C. (2001), ”Updating the determinants of firm performance: Estimation using the 1998 UK Workplace Employee Relations Survey”, British Journal of Industrial Relations, Vol. 39, No. 3, pp. 341-66.","cites":null},{"id":37923788,"title":"When employees have equity attitude, Harvard Business School Working Knowledge Series.","authors":[],"date":"2005","doi":null,"raw":"Rosen, C., Case, J. and Staubus, J. (2005b), When employees have equity attitude, Harvard Business School Working Knowledge Series.","cites":null},{"id":37923689,"title":"Worker participation and productivity in labor-managed and participatory capitalist firms: a meta-analysis’,","authors":[],"date":"1995","doi":"10.1177\/001979399504900104","raw":"Doucouliagos, C. (1995) ‘Worker participation and productivity in labor-managed and participatory capitalist firms: a meta-analysis’, Industrial and Labor Relations Review, 49, pp.58-77.","cites":null},{"id":37923769,"title":"Workers enjoy fruits of their labor”,","authors":[],"date":"2007","doi":null,"raw":"Odoi, A. (2007), “Workers enjoy fruits of their labor”, The Guardian, August 20, http:\/\/www.worldbusinesslive.com\/HumanCapital\/Article\/733048\/unsungbenefits-employee-ownership\/Monday, (accessed: 20.05.2009).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-08-31T00:00:00Z","abstract":"Purpose - Employee ownership has attracted much attention across the globe.\nWhether affected by the global financial crisis (GFC), or not, this paper seeks\nto canvass what is known about employee ownership in neo-liberal political\neconomies. Design\/methodology\/approach - This paper is a literature review,\ncross cultural analysis and critique. Findings - The findings indicate future\nresearch directions. Research limitations\/implications - The paper suggests a\nreconsideration of organizational configurations for possible greater\napplication in the future. Social implications - The paper hightlights the re-\nregulation of neo-liberal markets. Originality\/value - The paper focuses on\nemployee share ownership schemes","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/141013.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1108\/00251741011076807","pdfHashValue":"65240a18d8ed2b2bf1e121cceaff30a2b12b2399","publisher":"Emerald Group Publishing Limited","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5091<\/identifier><datestamp>2012-02-13T13:46:08Z<\/datestamp><setSpec>hdl_1826_28<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Auditing employee ownership in a neo-liberal world<\/dc:title><dc:creator>Knyght, P. R.<\/dc:creator><dc:creator>Kouzmin, Alexander<\/dc:creator><dc:creator>Kakabadse, Nada K.<\/dc:creator><dc:creator>Kakabadse, Andrew P.<\/dc:creator><dc:description>Purpose - Employee ownership has attracted much attention across the globe.\nWhether affected by the global financial crisis (GFC), or not, this paper seeks\nto canvass what is known about employee ownership in neo-liberal political\neconomies. Design\/methodology\/approach - This paper is a literature review,\ncross cultural analysis and critique. Findings - The findings indicate future\nresearch directions. Research limitations\/implications - The paper suggests a\nreconsideration of organizational configurations for possible greater\napplication in the future. Social implications - The paper hightlights the re-\nregulation of neo-liberal markets. Originality\/value - The paper focuses on\nemployee share ownership schemes.<\/dc:description><dc:publisher>Emerald Group Publishing Limited<\/dc:publisher><dc:date>2011-11-16T23:00:48Z<\/dc:date><dc:date>2011-11-16T23:00:48Z<\/dc:date><dc:date>2010-08-31T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>0025-1747<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1108\/00251741011076807<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5091<\/dc:identifier><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0025-1747","issn:0025-1747"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Article"],"fullText":"1Management Decision, Volume 48, Number 8, 2010, Pages 1304-1323\nThis article is © Emerald Group Publishing and permission has been granted for\nthis version to appear here (https:\/\/dspace.lib.cranfield.ac.uk\/index.jsp).\nEmerald does not grant permission for this article to be further copied\/distributed\nor hosted elsewhere without the express permission from Emerald Group\nPublishing Limited.\nwww.emeraldinsight.com\nAuditing Employee Ownership in a Neo-Liberal World\nAbstract:\nEmployee ownership has attracted much attention across the globe. Whether affected\nby the Global Financial Crisis (GFC), or not, this paper invokes a serious audit of\nempirical findings and cross-cultural approaches to an ideologically-sensitive agenda.\nPurpose: To canvass what is known about employee ownership in Neo-liberal\npolitical economies.\nDesign\/methodology\/approach: Literature review, cross cultural analysis and\ncritique.\nFindings: Indicate future research directions.\nResearch limitations\/implications: Reconsideration of organizational configurations\nfor possible greater application in the future.\nPractical implications: Public policy imperatives.\nSocial implications: Re-regulation of neo-liberal markets\nOriginality\/value: Knowledge\/policy transfer.\nCategory: Literature Review\nKey Words: Employee Ownership; Stock Ownership; ESOPs; Share structures;\nManagement incentives\/philosophies.\n2Introduction: Employee Share (stock) Ownership\nEmployee ownership is currently attracting considerable attention in the press across\nthe globe. For example, in February 2008, there were 1,436 press articles published,\nof which 683 focused on stock options, whilst 212 focused on workers' cooperatives\n(EFESO, 2008). There have also been a growing number of academic articles in the\nlast few years, particularly in the U.S., where Employee Stock Ownership (ESO) or\nrather Employee Stock Ownership Plan (ESOP) diversification is an issue of concern.\nSuch interest has been stimulated in part by the governments in North America, Europe,\nAustralia and Asia promoting various forms of employee share ownership through a\nvariety of schemes which, in turn, have resulted in considerable differences in the practice\nof employee participation between countries. Thus making generalizations about\nemployee share ownership has to be done with considerable caution.\nFurthermore, employee ownership terminology usage in the literature is not always\nclear and, at times, is confusing as articles refer to ‘employee stock ownership;’\n‘employee’s financial participation; ‘profit sharing;’ ‘sharing ownership;’ and\n‘employee ownership’. Equally, what exactly constitutes an ESOP varies. A narrow\ndefinition is one where at least one employee receiving payment from an ESOP deems\nthe firm as an employee stock ownership (ESO) employing company (Sengupta et al,\n2007). A less restricted definition requires that a majority of non-managerial employees\nparticipate in the scheme for the company to be considered ESO employing (Robinson\nand Zhang, 2005). A broad-based definition theoretically covers the entire workforce.\nHowever, as most schemes never have 100 per cent coverage at any given time, since\nparticipation in the scheme calls for a minimum employment period, in practice, an ESO\ncompany is considered as such if a minimum of 50 per cent of the employees are\ncovered by an ESO scheme (Pendleton, 2001).\n3Yet, despite the variance of interpretation and practice, ESOPs are the longest-\nestablished method for sharing ownership (Blasi et al, 2002). As such, employees\nacquire equity shares thus permitting them a shareholding in their employing\ncompany. For the majority of cases, employee share ownership plans consist of one of\nseveral components of the company’s reward package. Additionally, employee ownership\nmay come about through an employee buy-out or through the exiting owner wanting to\npass on the business to the employees. In theory, employee ownership provides\nemployees with additional rights, such as the right to share in the company’s profits,\naccess to information about the company’s finances and operations and the right to\nparticipate in the management of the company (Rousseau and Shperling, 2003). These\nrights are intended to bring about fundamental changes in employee attitudes and\nbehaviour, which may be reflected in a range of company-level outcomes such as\nimproved productivity and financial performance (Rousseau and Shperling, 2003).\nIt was Sydney Webb (1912: 232) who noted that making an employee a shareholder\nin the business would ‘stimulate his zeal and careful working and, as part owner of the\ncapital, with which he works,’ he will share responsibility in the business. Developed\nfurther as a concept in the 1950s by the lawyer and investment banker Louis Kelso,\nthe ESOP was introduced in 1973 under the premise that the capitalist system would\nbe stronger if all workers, and not just a few stockholders, could share in owning\ncapital-producing assets and that tax benefits for ESOPs should be permitted and\nencouraged under employee benefit law (NCEO, 2008d). Thus, the assumption made\nis that sharing equity with most or all employees in a corporation is one way of\ngaining employees’ involvement in profit-sharing programs (Blasi et al, 2002).\n4However, the extent to which employees enjoy profit-sharing and information and\nparticipation rights varies considerably (Ben-ner and Jones, 1995; French, 1987) and\nthat is considered to be a reason that the benefits from employee ownership vary\nsubstantially.\nAs emphasized, there exist various modes of employee ownership. At one end of the\nspectrum are workers’ co-operatives, whilst the other end is populated by executive\nshare-options. With the latter, participation in share ownership plans may be limited\nto just a few individuals, typically senior managers, or can be open to the entire\nworkforce. Still, the assumption underling both profit-sharing and employee-\nownership is that the better re-distribution of the benefits of economic growth itself\nstimulates greater and continued economic growth (Lowitzsch, et al 2008). Broadly,\nthree sets of schemes can be distinguished.\nDirect: Through using one or more share plans, employees become registered as the\nshareholders of a majority of the shares in their company. In order to do so,\nemployees may acquire shares over time, perhaps as bonuses or as part of their\nremuneration. Some share schemes offer tax advantages to the company and\nemployees. Alternatively, the shares in the company could initially be bought by an\nemployee trust which later are distributed, in part or whole to individual employees.\nAs a result shares may be held individually or collectively. In the UK, there are three\nmain types of non-cash, profit sharing schemes: Approved profit sharing; Save as You\nEarn (SAYE) schemes, also referred to as savings-related share- option schemes or\n‘share-save’ schemes (initially established under the terms of The Finance Act 1980);\n5and Company share options schemes. For these schemes to be put into operation,\nclear agreement needs to be reached between employer and employees. Employees\nmust receive their shares in addition to their wages or salaries; the share price must be\nfixed beforehand and the employees' shares must be related to profits (Morris et al,\n2006). Whilst cash schemes are the simplest method of distributing profits to\nemployees, share options schemes, on the other hand, provide links between\nindividual rewards and organizational success in profit terms more on a long-term\nbasis (Morris et al, 2006).\nIndirect: In this case, shares are held collectively on behalf of employees, normally\nthrough an employee trust. An indirect model of employee-ownership is through a co-\noperative structure (such as the Industrial and Provident Society structure) which\nprovides benefits to the members. The trust might hold the shares in perpetuity or\ndistribute them to individual employees, or a combination of the two. The trust also\ncan buy shares back from employees particularly those who want to sell on their\nretirement. For example, a legal arrangement can be reached whereby an asset is\ndeposited into an escrow account under the trust of a neutral third party (escrow\nagent) pending satisfaction of contractual contingencies or conditions, and who, in\nturn, will deliver the asset to the party as prescribed by the contract. Placing shares\ninto an employee trust can have tax advantages and also provides an effective way of\nraising bank finance to acquire the shares (financing an employee buyout).\nWith both the direct and indirect models, there exist a plethora of variations. On the\none hand, employees acquire only a small minority stake. On the other, a large\nproportion of company share possibly even the entire share capital, is owned by the\n6employees. As far as employee-owned enterprises (EOE) are concerned, they often\nadopt profit sharing schemes, where the profits of the enterprise are shared with the\nemployees. To safeguard such arrangements, boards of directors are constituted,\nelected directly by the employees.\nThe Co-operative: A corporation owned entirely by its employees (co-operative, co-\nownership, partnership) will not have its shares traded publicly on stock markets. Co-\noperatives, or co-ops, emerged in response to economic and social inadequacies and\nrepresent a legal entity owned and democratically controlled by its members. The\nInternational Co-operative Alliance's Statement on the Co-operative Identity defines a\nco-operative as ‘an autonomous association of persons united voluntarily to meet their\ncommon economic, social and cultural needs, and aspirations, through a jointly-\nowned and democratically-controlled enterprise’ (Zeuli and Cropp, 2004). Co-\noperatives are businesses owned and controlled by the people who use its services or\nwho work in the business.\nThe Fenwick Weavers Society has been posited as being the first co-operative. It was\nfounded in 1761 to promote and maintain high standards in the craft of weaving, but\nsoon became involved in the bulk purchase of oatmeal for re-sale to its members\n(Monklands, 2008). Shortly after, Rochdale’s mill workers set up the Rochdale\nEquitable Pioneers Society whose underlying purpose was that of member self-help.\nTheir co-operative existed for the benefit of its members and the improvement of their\nsocial and household condition (Monklands, 2008). They also worked out their aims\nand purposes, and committed them to paper in 1844 in the form of nine specific rules,\nthe Rochdale Principles of Co-operation. The nine rules were: open membership;\n7democratic control; distributing profits to members in proportion to their spending;\npaying small amounts of interest on capital; political and religious neutrality; cash\ntrading; no credit; promotion of education; and quality goods and services, including\ndistributing a share of profits according to purchases (Monklands, 2008).\nRecognising the considerable variance of employee ownership schemes, this paper\nexamines the nature of different forms of employee ownership and whether an\nadditional level of difference exists according to regional or country idiosyncrasies. A\nsharp distinction is made between employee ownership and the mainstream, minority\nemployee share plans in large enterprises. This paper also highlights the fact that\nfuture research needs to distinguish between the various forms of employee share\nownership if the impact of share ownership is to be more precisely understood and\ncalibrated.\nA ’global’ Audit of ESOPs\nThe United States: In the U.S., an ESOP is a retirement plan in which the company\ncontributes its stock for the benefit of the company’s employees (SEC, 2008). U.S.\nbased ESOP employees never buy or hold stock directly (SEC, 2008). As such, an\nESOP is different from other non-retirement plans such as employee stock options\nplans which give the employee the right to buy their company’s stock at a set price\nwithin a certain period of time (SEC, 2008). Employee ownership in the U.S. takes\nfour broad forms and a number of combinations (NCEO, 2008c).\n ESOPs, stock bonus plans and profit sharing plans primarily invested in employer\nstock;\n8 401(k) plans primarily invested in employer stock;\n broad-based stock option plans; and\n stock-purchase plans.\nESOPs are the most popular employee-ownership scheme in the U.S according to the\nNCEO (2008c). Approximately 70 per cent of ESOP owners are employed in large,\npublic companies (Rousseau and Shperling, 2004). In 2007, there were 9,774 ESOPs,\nspread across 11.2 millions employee owners in over 11,000 companies, holding 630\nbillion Euros in assets (Rosen, 2008; NCEO, 2008a). The NCEO (2008b) definition\nof ESOPs is broad and includes plans filed as ESOPs, stock-bonus plans and profit-\nsharing plans primarily invested in company stock (Rosen, 2008). Whilst profit-\nsharing and stock-bonus plans are not technically ESOPs, they are included because\nthere are functionally few differences, especially for the participants (Rosen, 2008).\nOther employee-ownership schemes, additional to ESOPs, have some 25 million\nemployee owners, holding more than 1,000 billion Euros in assets (NCEO, 2008a).\nOverall, in the U.S., the broad-based stock options (grants given to at least half of a\nfirm's workforce) have been increasing steadily, from 17 per cent in 1993 to 39 per\ncent in 1999 (Rousseau and Shperling, 2004).\nThe United Kingdom: In the UK, employee-ownership associations (EOAs)\ncomprise of employee-owned and trust-owned businesses. These EOAs came about\npredominately in two ways. One stream of EOAs is composed of management and\nemployees who benefitted from the buy-outs of public-sector firms undergoing\nprivatization (most in the late 1980s and early 1990s). These were predominately\nhighly-unionized firms, pursuing highly-leveraged buy-outs with loans from central or\n9local government bodies (Pendleton, 2001). The second stream of EOAs arose from\nemployee-ownership conversion from the private sector where owners wanted to\ndivest themselves of, or exit from the business. Many of these were owner-managed\nfirms. Typical motivation for conversion were, and are the protection of the firm from\ntake-over and paternalistic sentiment concerning the welfare of employees (Pendleton,\n2001). According to the EOA (2008), employee ownership is about the majority in the\ncompany owning part of it, whether via a trust or shares, and where no outside interest\nhas a controlling stake.\nEurope: Shared ownership plans in Europe are considerably diverse due to historical\nand institutional arrangements paralleled by a huge diversity in tax treatment. Across\nContinental Europe, studies of employee ownership report mixed results in terms of\nemployee motivation and employee and company performance (D' Art and Turner,\n2004; EFESO’ 2005; Pourceau, 2003; Poutsma and de Nijs, 2003). Employee\nfinancial participation in Europe has been more influenced by profit sharing, with\ngovernment and trade unions in support of such an arrangement (D' Art and Turner,\n2004; Poutsma and de Nijs, 2003). In contrast to the UK, where there has been a trend\nto introduce ESOPs in unionized enterprises (Gregg and Machin, 1988; Pendleton,\n1997), in the European Union (EU), union representation and employee share\nownership co-exist and the two appear to function largely independently of each other\n(Pendleton, 2005). Union involvement in the design, implementation and operation of\nemployee share plans in most cases is minimal. Additionally, the trend for\nprivatization of state-owned companies has contributed to wider employee ownership.\nIn Ireland, for example, nearly half a million employees were recorded as being\ncovered by ’profit-sharing’ schemes between 1983 and 2003 (D' Art and Turner,\n2005).\n10\nIn contrast, in the early 1980s, both Scandinavia and the EU generally appeared to\nfavour schemes of collective, capital formation in preference to schemes of financial\nparticipation based at the level of the individual firm (European Trade Union Institute,\n1983; LO, 1980; Meidner, 1978). However, since 1987, with the development of\nsocial partnership between EU governments and employers, this position has largely\nbeen abandoned in favour of firm-level profit sharing or employee share-holding\nschemes (D' Art and Turner, 2000; 2005). EU leaders seem uncertain as to their role\nin employee-owned enterprises (Long, 1978). Although unions have a role in\nconceptualizing and\/or initiating the “ideal type” of employee ownership, (Freund,\n1972), once ideas become a reality the union’s role tends to be superseded. The reason\nis conflict of interests between labour and capital and the need for the unions to\nmaintain their traditional role (Long, 1978). In numerous instances where unionized\ncompanies have converted to employee ownership, companies have remained\nunionized (Long, 1978).\nIn Germany, 73 per cent of companies call for greater employee share ownership\nwhilst in Spain, legislation in support of employee-owned companies (sociedades\nlaborales) is being prepared (EFESO, 2008). France, on the other hand, exhibits\ncontradictions as the government plans to develop employee financial participation\nmore in SMEs. The President has so far displayed an interest in unblocking employee\nsavings to boost private consumption and investment in the more medium sized\nFrench business organization. In contrast, ’The Movement of French Enterprises’\n(MEDEF) organized a ‘Tour de France’ to more broadly promote employee share\nownership (EFESO, 2008). For example, France Telecom, Société Générale, Essilor\nand Saint-Gobain have all adopted ESOPs (EFESO, 2008). Overall and similar to\n11\nGermany, French law makes provision for employees of large, publicly-listed\ncompanies to elect two types of directors to represent employees. Partially privatized\ncompanies must reserve two or three seats, depending on board size, for directors\nelected by employees by right of employment. Additionally, employee-shareholders\nin any public company have the right to elect one director whenever they hold at least\n3 per cent of outstanding shares. Ginglinger et al (2010) found that employee\nrepresentation on corporate boards in France seems to be at least value-neutral, with\nsome evidence supporting an actual increase in firm valuation and profitability when\nemployee-shareholders elect company directors. However, when the firm’s\nemployees are represented by radical, left-wing unions, the financial payout is\nsignificantly reduced, whilst ironically corporate valuation is unaffected and firm\nprofitability is significantly increased due to a more structured corporate governance\nregime and demanding climate of industrial relations (Ginglinger et al 2010). In Italy\nemployee-share ownership still seems to be absent from political debates. In\ncomparison to many other European countries, Italy seems to be becoming\nmarginalized in this area (EFESO, 2008).\nOverall, some 2,500 of the largest European companies now have 8.2 million\nemployee owners across Europe, holding 260 billion Euros in value (EFESO, 2008).\nJapan: Japanese employee share ownership plans (4.4 per cent of all firms in Japan in\n1960 to 95.9 per cent in 1992) differ from their U.S. and UK counterparts (Kato and\nMorishima, 2002). For a start, there are no tax incentives to employee share\nparticipation for Japanese corporations. However, employees are encouraged to\n12\nparticipate in share ownership plans by the company matching the employee’s\ncontribution and bearing the administrative cost. Executives are often ineligible for\nmembership. Shares are held in a trust, though each participant has the right to\nwithdraw their shares which then become privately owned and cannot be re-entered\ninto the fund.\nRetired workers are required to exit completely. Further all employees leaving the\nplan must sell their shares to the trust at current market value. The trust is required to\nappoint a general director, who is a participant in the plan (but not an executive of the\nfirm) and who is chosen democratically by participants in the plan on a one-\nparticipant, one-vote, basis. These trusts act as a collective voice for the employee\nowners, ensuring that their views are incorporated at all levels of company\nmanagement. These trusts, or employee shareholder associations, have the capacity to\nrepresent employees’ opinions as a whole and, thus have become a powerful voice.\nSpread of Practice\nAs can be seen substantial differences exist between countries in the structure and\nnature of owner\/representative participation. The three leaders in the EU, with\nemployee coverage averaging over 50 per cent, are the UK, France and Poland\n(Lowitzsch et al, 2008). Certain countries have decentralized systems of indirect\nparticipation whilst others have centralized arrangements, and still others have a\ncombination of the two. In the UK, it appears that share ownership tends to be found\nin unionized establishments through mainly single-channelled representation where\nall or the most representation occurs through the union and comparable bargaining\n13\nchannels (Gregg and Machin, 1988; Pendleton, 1997). Other countries, such as\nGermany, have dual systems, one through union representation in terms of collective\nbargaining and a further separate representation through works councils. In many\ninstances, union representation and employee share ownership co-exist and function\nlargely independently of each other, with little union involvement in the design,\nimplementation and operation of employee share plans (Pendleton, 2005; 2006). The\nexception to this is majority, employee-owned firms where unions are involved in\nmounting buy-outs (Pendleton, 2006).\nESOPs Contextualized\nAs has been argued, ESOPs are contingent on each country’s laws and regulations and\nphilosophic predisposition. The increased usage of ESOPs in neo-liberal economies\nhas arisen primarily due to ‘managerial incentivization’ and favourable tax treatment\nin the hands of both the issuer and the recipients (Matsunaga, 1995). After the mid-\n1970s, U.S. legislation which encouraged ESOPs saw the number of ESOP companies\nin the U.S. dramatically increase (Conte and Lawrence, 1992), reaching peaks in 1993\nand 2005 - due to affordable tax and accounting practices. In the late 1980s, many\npublic companies set up ESOPs but when, accounting rules changed in a way that was\nless favourable for ESOPs, many companies closed down their ESOPs and moved\ntheir contributions of stock to 401(k) plans.\nDespite the praises sung about share redistribution\/participation, serious concerns\nhave also been voiced (Odoi, 2007). The favourable accounting and tax treatment that\nfacilitated the rise of ESOPs has often resulted in inflated corporate earnings, raising\nthe legitimate concern that many firms adopted broad-based stock option schemes to\nprovide an artificial boost to earnings rather than for sound business reasons\n14\n(Kroumova and Sesil, 2005). The corporate frauds and scandals, beginning with\nEnron in 2001 highlighted incidents of extraordinary executive pay and stock option\nexercises, whilst employees suffered losses in their 401(k) plan. These scandals\ninvoked new regulations and legislation, notably that of the Sarbanes-Oxley Act 2002.\nMoreover, starting from June 2005, U.S. firms have been subject to reporting stock\noptions as an expense on their balance sheets (NCEO, 2005a). In March 2005, the IRS\nissued a correction to the accounting regulations of 2004, thus curbing further\ncorporate abuse of employee incentive schemes, including ESOPs (SEC, 2008). In\nanticipation of such requirement, firms started granting options to fewer employees\n(NCEO, 2005b). Thus, since 2005, US firms are required to measure the ‘fair value’\nof options and other equity awards at the time of the grant and then expense the value\nof the award. A similar trend in the UK has paralleled the US experience, whereby the\nLabour government, in 2003, scrapped tax relief on company contributions to\nemployee benefit trusts with the intent of minimizing tax avoidance but as a result\nhave made it more difficult for companies to be trust-owned (Odoi, 2007).\nAs can be seen, individual country laws influence whether or not employees are\nallocated control rights in the companies for which they work, whether they own\nshares in it or not. As highlighted in Germany, France and Japan, the law mandates\nthat workers be represented on corporate boards. The German co-determination policy\nbegan in 1951 for mining, coal and steel companies, and was extended in 1976 to all\nfirms with more than 2000 workers. The policy requires substantial worker\nrepresentation, reserving between one-third and one-half of board seats on the\nsupervisory board (Aufsichgrat) of publicly listed companies for that purpose (Fauver\nand Fuerst, 2006). A later law required that workers receive one-third of supervisory\n15\nboard seats in companies with between 500 and 2000 workers (Fauver and Fuerst,\n2006).\nRecognising the notable difference between countries holding a stakeholder\nphilosophy such as Germany, against those with a shareholder philosophy such as the\nU.S.A, certain scholars still argue that employee participation in firm governance can\nbe value-enhancing, particularly when companies are confronted with economic or\nfinancial distress (Acharya et al, 2008; Galai and Weiner, 2008). Allen et al (2007)\nand Claessens and Ueda (2008) support this view presenting empirical evidence that\nstakeholder-oriented firms often prosper when competing against purely shareholder-\noriented firms. In fact, Allen et al (2007) predict that firms in stakeholder-oriented\nsocieties, such as Germany and Japan where a close relationship exists between the\nenterprise and the banking system, will be more able to reduce the probability of firm\nbankruptcy despite the use of debt.\nImperatives for Employee Ownership\nDifferent reasons drive a firm's decision to adopt an employee- ownership model. The\nobjectives of profit sharing tend to vary according to the desire of particular\ninitiator(s) (D' Art and Turner, 2004). Social harmonizers, recognising the altruistic\nproponents of these schemes, see them as a way to realize equity and social justice (D'\nArt and Turner, 2004). Couper (2006) has argued that the underlying values of self-\nhelp, equity, equality, democracy and solidarity are values required for finding a\ncommon voice and sense of responsibility. It is contended that there is a ‘direct\nparallel with the employees' need to feel responsibility (self-help), belonging\n(community), involvement (democracy) and reward (equity) and the sustainable long-\nterm direction for the business, drawing on genuine employee engagement (Couper,\n16\n2006: 7). In the wholly employee-owned firms, ‘the great strength of the partnership's\nmodel is that employees have a real stake in the business [...] co-ownership allows the\npartnership to take a long-term view, because we do not have to answer to external\nshareholders who are usually seeking quick returns’ (Killen, quoted in Odoi, 2007: 1).\nManagerial proponents have contended that employee ownership schemes enhance\norganizational outcomes such as productivity and profitability (D' Art and Turner,\n2004). Long (1978: 755) stated that ESOP’s will put each worker in the position of\nimproving ‘his own efforts towards costs minimization’, thus enhancing the value of\nthe enterprise and in turn, eliminating strikes, slowdowns, antiquated work rules and\nunreasonable wage-demands. Thus, the imperative proposed is that profit sharing and\nshare ownership schemes represent an attempt to link pay with the performance of the\nfirm as a whole, with the aim of engendering a commonality of interest. Even from\nan agency theory perspective, scholars have argued that agency costs can be reduced\nby aligning executive, managerial and employee compensation to firm performance\n(DeFusco et al., 1990; Jensen and Meckling, 1976). This is the case where\nparticularly ’difficult to monitor’ inputs from human capital will more likely adopt\ncompensation plans that provide inexpensive substitutes for more formal monitoring,\nsuch as hiring more managers or supervisors (DeFusco et al, 1990; Jensen and\nMeckling, 1976). The hypothesis put forward by scholars is that employee monitoring\nis likely to be more severe in knowledge-based firms especially ones that are large\nand where intellectual capital is the main source of customer value, or in firms that are\nexperiencing rapid growth (De Fusco et al, 1990).\n17\nSimilarly Rousseau and Shperling’s (2004: 563) put forward the perspective that\n‘ownership is increasingly part of a larger set of practices for firms where a highly-\ncommitted workforce is viewed as a competitive advantage’. In similar vein, Rosen et\nal (2005a; 2005b) state that when employees own a stake in the company, their\nattitude also sharpens as does the company’s bottom line. Morris et al (2006: 328)\nfound that in the UK the most common reason for employee ownership is ‘to make\nemployees feel that they are a part of the company and to create a feeling of\ninvolvement and interest in the company's fortune’. The SEC (2008) suggests that\nmany companies use stock plans to compensate, retain and attract employees. Thus,\nbroad-based ownership arrangements may reflect employer efforts to retain and\nmotivate a collective of value-creating labour. For example, broad-based stock\noptions are more common where monitoring costs are high, such as where intellectual\ncapital drives value creation (Kroumova and Sesil, 2005).\nHowever, and in contrast, firms may adopt broad-based options not to promote\nalignment, but rather because their expensing treatment makes them appear to be an\ninexpensive means of delivering compensation. This, in turn, suggests some\ncompanies adopt ESOPs for the wrong reason(s) and this may also mean that firms\nthat could benefit from their use may be abandoning them unnecessarily.\nOverall, the neo-liberal proponents of financial participation expect a diffusion of\nshare ownership to establish people's capitalism (D' Art and Turner, 2004; Kelso and\nHetter, 1967; Saunders and Harris, 1994)). Arguing from the unitary perspective,\nsome have proposed that there is a convergence of the roles of owner, manager and\nworker, particularly in knowledge-intensive firms where expanded worker\n18\nparticipation in ownership and related privileges include access to financial\ninformation and greater freedom in decision making (Rousseau and Shperling, 2004;\nZardkoohi and Paetzold, 2004)\nAs share schemes have been principally used for social equity and employee\nmotivation reasons, they have equally been used as anti trade union measures.\nManagement of non-union firms, particularly in the US, use financial participation as\npart of a unitarist strategy to exclude trade unions. Profit sharing, or employee share-\nholding, is used as a defence or deterrent against union-organizing drives (Czarnecki,\n1970; 2005; D' Art and Turner, 2004; McHugh et al, 1999). The reason for the\nadoption of employee ownership is the historical shift from the centrality of rigidly\ndirecting Taylorist ’hired hands’ (Kouzmin, 1980) to the subtlety of influencing the\nthinking, values and self-managing norms and ’identities’ of ’hired heads’. Bridging\nthe paradigmatic Taylorist\/Fordist ‘thinking versus doing’ breach remains an over-\narching legacy in Anglo-American managerial praxis, consolidated further in Neo-\nliberalism (Kouzmin, 2009). The subtle re-branding of labour or employees into\n’worker-owners’ or ‘employee-owners,’ further advances the institutionalization of\nthe ’worker-owner’ identity within the neo-liberal ideology (Kouzmin, 1980).\nEmployee Ownership Value\nWhatever the reasoning for adopting shareholding participation, a growing body of\nempirical evidence suggests that there is a weak, but positive relationship between the\nbroad dispersion of ESOPs and superior firm performance outcomes such as\nemployee productivity, firm profitability and stock performance (Klein, 1987). Blasi\n19\net al (2003:176), for example, have argued that a company cannot achieve desired\nmotivation and participation effects without financial participation, as,\n“telling employees to take ownership of their jobs rings hollow if\nmanagement doesn’t offer actual financial ownership or some share in the\nimproved performance […]. Without wealth sharing, in some form, it feels\nlike the company is just trying to con you into working harder.”\nBased on the assumption that owners do not need to be motivated, one stream of the\nliterature submits that ownership of itself creates the motivation for continuous\nperformance improvement (Blasi et al, 2003). An agency-theory-informed stream of\nliterature highlights the possible economic rewards as root causes of the beneficial\nmotivational effect (BCI Group, 2002; Hallock and Salazar, 2003; Ittner et al, 2002;\nSesil et al, 2002). Others argue that if an ESOP is combined with some of the basic\nrights of ownership, such as information about the company and participation in\ndecision-making, that of itself will also have a positive impact on work attitude and\nbehaviour (Gudmundson et al, 2003; Rosen and Carberry, 2002; Stack and\nBurlingham, 2002). Thus, there appears to be a performance premium associated with\nsharing stock options with the broader set of employees, especially in ’knowledge’\nintensive firms where better company performance is associated with the use of\nemployee ownership (Pendleton, 2001; Sesil et al, 2003). Pendleton (2001) supports\nthis case purporting that ESOP participation is more widespread within the financial\nsector due to employees higher knowledge of the characteristics of the plans and more\ngenerally in sectors with a higher concentration of non-manual employees who may be\nmore familiar with the use and concept of stock savings.\n20\nSome (Bonin et al, 1993; Craig and Penavel, 1992; Park et al, 2004) have argued that,\nwhile employee ownership is associated with higher productivity, the greater survival\nrate of these companies is not explained by greater employment stability, but rather by\nhigher productivity, financial strength or compensation flexibility. Bonin et al (1993)\nhave argued that the switch from focusing on profit maximizing to other optimizing\ncriteria ensures workers-owners’ interest in the firm's decision-making process and in\ntheir sharing of the surplus benefits. Thus, employee ownership companies may\nprovide greater employment security in an effort to build a more co-operative culture,\nwhich can increase employee commitment, training and willingness to make\nadjustments when economic difficulties occur (Melgarejo et al, 2007; Park et al,\n2004). It should be noted however, that the majority of the empirical studies\nexamining ESOPs are carried out within the U.S. shareholder value market (Blasi et\nal, 2003), with only a few notable studies carried out in the European Union (EU)\n(Pendleton , 2001).\nOverall, employee share plans or ‘partnership capitalism’ is found to increase the\nproductivity level by about 4 per centage points, compared to firms that do not adopt\nsuch practice (Blasi et al, 2002). Total shareholder returns increase by about two per\ncentage points relative to other firms, whilst profit levels go up by about 14 per cent\n(Blasi et al, 2002). Although certain studies have produced inconclusive results,\noverall research results have shown that employee ownership has a modest positive\nimpact on workplace variables (Blasi et al., 1996; Huselid, 1995; Klein, 1987;\nPendleton et al, 1998; Pfeffer, 1995; ). Certainly one consistent theme has been the\nemphasis on good human resource practice and the impact of that on firm\n21\nperformance and competitive advantage (Huselid, 1995; Morris et al, 2006; Pfeffer,\n1995).\nWhat we Know (or do not Know) about ESOPs\nAs shown attention has focused on exploring the relationship between profit sharing\nand organizational performance, controlling for possible exogenous and endogenous\neffects including firm size, market location, product portfoliom, date of establishment\nand individual country effects (D' Art and Turner, 2004). Firm performance has been\nmeasured and compared through such components as pre-adoption and post–adoption\nof ESOPs, as well as between ESOP and non-ESOP firms. In addition to financial\nperformance, profit sharing impact on the level of productivity, service quality,\nproduct to market time and rate of innovation, have also been examined (D' Art and\nTurner, 2004). Various types of employee ownership in Britain, Ireland, Japan,\nScandinavia, Spain and the former Eastern bloc have also been studied (D’ Art and\nTurner, 2004; Jones and Kato, 1995; Melgarejo et al, 2007; Morris et al, 2006;\nPendleton et al, 1998; Pendleton, 2001; Poole, 1988). Further, the presence or the\nabsence of staff associations (unions) and the impact of that on share ownership\nadoption have also equally been given attention (Morris et al, 2006; Poole, 1989).\nSome scholars (Gudmundson et al, 2003; Rosen and Carberry, 2002; Stack and\nBurlingham, 2002) have found a link between employee share ownership, financial\nparticipation and involvement in decision making, resulting a ‘culture of ownership’,\non the one hand, and innovation on the other, due to ‘initiation and implementation of\ninnovation being significantly enhanced when employees are empowered to take\naction’ (Gudmundson et al, 2003: 14). Certain scholars contend that firms with\n22\nemployee share ownership are able to tap into human capital by operating ‘policies\nthat draw more fully on worker skills and innovation’ (Kruse et al, 2003: 6).\nResearch has also shown that companies with employee share ownership (50 per cent\nor more), or with significant levels of employee financial participation, have higher\nproductivity and financial performance, greater innovation, higher levels of customer\nloyalty, lower staff turnover, increased shareholder returns, productivity and financial\nperformance (Conyon and Freeman, 2001; Freeman et al, 2004; Kato and Morishima,\n2002; Lamberg et al, 1993; Michie et al, 2002).\nAn overall literature review (Conte and Svejnar, 1990; Doucouliagos, 1995; Kruse\nand Blasi, 1997; Kruse et al, 2007; Pérotin and Robinson, 2003), suggests that\nemployee share ownership has limited but positive effects on organizational\nperformance and particular productivity, albeit these outcomes are often small and\/or\nstatistically insignificant. Studies based on western-market economies suggest that\nemployee share-ownership and profit-sharing have had positive effects on workers\nincentives and productivity (Blinder, 1990). In similar vein, studies from new EU\nentrants, such as the Baltic countries, Poland, Hungary and Slovenia, indicate that\npost-privatization performance of employee-owned firms have been similar to that of\nother types of firms (Uvalić and Vaughan-Whitehead, 1997). The Doucouliagos\n(1995) study suggests that the positive effects tend to be more prominent and\nstatistically significant amongst firms with majority employee ownership rather than\namongst firms with employee share plans, (Conte and Svejnar, 1990). Although most\nshare-ownership plans do not appear to fundamentally transform the employment\nrelationship, evidence has emerged which highlights the minimizing of the ‘free-rider’\n23\nsyndrome and the redirection of alignment concerns common to large and listed\nenterprises (Sengupta, 2008).\nOne theme runs through many of the studies and that is the lack of transformation of\nthe firm through employee relationship and that may be due to the fact that in the\nmajority of cases ‘shareholders do not own the corporation, which is an autonomous\nlegal person’ (Heracleous and Lan, 2010: 24). Thus, when company ‘directors go\nagainst shareholder wishes, even when a loss in value is documented, courts tend to\nside with directors the vast majority of the time’ and, as such, render shareholders\nimpotent (Heracleous and Lan, 2010: 24). Although share-ownership schemes transfer\nequity to employees, in many cases this is proportionally small and so little\nexpectation is created on the part of those employees involved in transforming the\nway the company is run. However, in companies with a substantial employee\nownership (50 per cent or more), employee expectations have been captured as\ndifferent (Pendleton et al, 1998). Some have argued that the effects of employee\nownership are greater or are achieved only when there is employee participation in\ndecision-making (Pendleton et al. 1998; Addison and Belfield, 2001). In employee-\nowned firms, employee participation appears requisite for achieving a full sense of\nownership; namely the right to determine how an asset is used and disposed off\n(Pendleton et al. 1998; Addison and Belfield, 2001; Rosen et al, 2005; Kaarsemaker\nand Poutsma, 2006).\nYet, despite findings for and against, the majority of studies of ESOPs favourably\nconclude that the advantages of employee involvement and\/or ownership of the\nenterprise outweigh the disadvantages. However, the voice of concern (Kaarsemaker\n24\nand Poutsma, 2006) relates to the simplicity of the studies and inadequacy of research\nmethodology. Kaarsemaker, and Poutsma (2006) especially highlight to,\n an inadequate probing of the conditions supporting positive employee ownership\noutcomes. Are identified positive effects due to ownership structure or other\nfactors such as leadership?\n an inadequate study of the experiences\/concerns of the individual in terms of\nhappiness, stress, adequacy of earnings or sufficiency of pensions;\n an inadequate scrutiny of the relationship between improved productivity and\nindividual well being, despite the volume of conclusions linking positive\noutcomes for the company and the employee; and\n an undue focus on EO enterprises in Anglo-Saxon nations rather than broader\ninternational comparisons especially where financial participation is supported by\ntask incentives such as in Austrian, Germany, Ireland, France, etc.\nCertainly studies of multi-national corporations (MNC’s), strongly suggests that the\npositive outcomes attributed to ESOPs enterprises could be more the result of\n(Kakabadse and Kakabadse, 2008),\n capable leadership;\n well-trained and developed management, both strategically and operationally\ncapable despite pressures for meeting short-term targets;\n well-thought through human resource management (HRM) policies promoting\ntalent management, collaborative\/team ways of working, work\/life balance,\ncoaching and counselling;\n responsible and disciplined governance; and\n25\n a positive orientation to corporate social responsibility (CSR) and sustainability\nadoption.\nWhere to for ESOPS?\nThe assumptions underlying employee ownership research point to the fact that\nemployee ownership modifies the relationship between workers and their work\norganization which, in turn, has implications for the quality of working life of\nemployees, for their performance and the performance of the organisation\n(Tannenbaum, 1983). Some argue that such effects occur through companies designed\nto be more egalitarian, participative and supportive, appealing to a sense of\nidentification with, and contributing to, the success of the enterprise (Tannenbaum,\n1983). However, other studies have shown modest outcomes of worker participation\nas they had relatively little influence compared with that of the enterprise managers\n(Obardovic, 1970). Workers who were members of the councils were only slightly\nmore satisfied with their jobs than workers who were not council members\n(Obradovic, 1970).\nOn a broader scale, one powerful call is for employee ownership studies to be pursued\non a cross-cultural basis. A number of researchers (Blasi, 1988; Hallock and Salazar,\n2003; Klein and Hall, 1988) propose that future research should avoid the\nmanipulation of large, readily-available data sets which have dominated previous\nstudies and should concentrate more on detailed studies of individual firms that have\nadopted ESOPs. Some critics (Odoi, 2007) argue that although there is a range of\nemployee-ownership business models, there is an overall unawareness, not only\namongst employees but also amongst accountants and lawyers, about how these\n26\nmodels work and how co-owned schemes have been or are structured (Kouzmin,\n1993).\nThe alternative voice is that the study of employee-ownership models is hampered not\nso much by empirical concerns as much as by paradigmatic and ideological\nconstraints, especially in relation to the on-going presence of managerial prerogatives\nand increasing disparities in remuneration in Neo-liberal economies (Kakabadse, et al\n2004). Then there is the question of 20th Century European history. Commissar,\nentrepreneur, manager and bureaucrat constitute one social cleavage. They cohere and\narticulate similar interests by virtue of the common problems and experiences to\nwhich their position exposes them: the logic of authority relations within formal\norganizations (Kouzmin, 1980). One has yet to see a ‘distributive,’ rather than a\n‘production,’ socialism (Kouzmin and Korac-Kakabadse, 1997), the latter having led\nto a universal embrace of a highly-exploitative, technical division of labour.\nWithin the grip of ‘means’ over ‘ends’, Eastern Europe did struggle to find some\nexpression of labour concerns within ‘Fordist’ industrialism. Despite the challenges,\nhow can one seriously engage with the question of employee ownership whilst\nignoring such rich veins of experience from Eastern Europe? Even the Chinese have\nentered into the fray (li et al, 2005).\nThe case for cross-cultural, bottom up research is simply overwhelming. Moreover,\nthere is a need for better understanding how employee-ownership firms perform in\nrelation to the non-employee ownership firms in a globally-depressed market, and,\nmore importantly, whether employee-ownership schemes will continue to survive in a\n27\nconstantly changing labor market? Moreover, the literature is predominately silent on\nwhether:\n shareholding structure, of itself, determines higher-quality performance at the\ncompany, team and individual level or not;\n quality management, supportive organization culture and a positive orientation\ntowards CSR and sustainability result as much from capable leadership and\nforward thinking HRM policies and practices, rather than just financial and legal\nstructures,\n security of employment, particularly under global financial crisis conditions, may\nor may not have the beneficial effects discussed above,\n the tension between employees and management, and between parts of the\norganization is a phenomenon of most medium to large-sized organizations,\nirrespective of ownership structure. The leadership capability of top management\nto minimize misalignment effects on company performance emerges as a critical\nfactor, possibly less so than ownership structures.\nCertainly future study of the effects and benefits of employee participation\/employee\nownership schemes can no longer remain within the paradigm of, is it good to have or\nnot? The need is to examine ESOP schemes as one alternative available to the firm in\ntheir quest for performance improvement within a context of rapidly changing\neconomic conditions.\n28\nReferences\nAcharya, V. V., Myers, S. and Rajan, R. (2008), ‘The internal governance of firms,”\nCEPR Discussion Papers 7210, Centre for Economic Policy Research, London.\nAddison, J. and Belfield, C. (2001), ”Updating the determinants of firm performance:\nEstimation using the 1998 UK Workplace Employee Relations Survey”, British\nJournal of Industrial Relations, Vol. 39, No. 3, pp. 341-66.\nAllen, F., Carletti, E. and Marquez, R. (2007), ”Stakeholder capitalism, corporate\ngovernance and firm value”, EFA 2007 Ljubljana Meetings Paper, ECGI -\nFinance Working Paper No. 190\/2007, Wharton Financial Institutions Center\nWorking Paper, No. 09-28.\nBCI Group. (2002), “North American employee ownership survey results”, Pension\nBenefits, Vol. 9, Issue 8, p. 6.\nBen-ner, A. and Jones, D.C. (1995), ‘Employee participation, ownership and\nproductivity: A theoretical framework’, Industrial Relations, Vol. 34, No. 4,\npp.532 – 554.\nBlasi, J. (1988), Employee ownership: Revolution or rip off? Ballingen Publishing\nCompany, Cambridge.\nBlasi, J., Conte, M. and Kruse, D. (1996),\"Employee stock ownership and corporate\nperformance among public companies\", Industrial and Labour Relations\nReview, Vol. 50, No.1, pp. 60-79.\nBlasi, J., Kruse, D. and Bernstein, A. (2002), In the company of owners: The truth\nabout stock options and why every employee should Have them, Basic Books,\nNew York.\nBlasi, J., Kruse, D. and Bernstein, A. (2003), In the company of owners: the truth\nabout stock options (and why every employee should have them), Basic Books,\nNew York.\nBlinder, A.S. (ed.) (1990), Paying for productivity - A look at the evidence,\nWashington, DC, The Brookings Institute.\nBonin, J. P., Jones, D. C. and Putterman, L. (1993), \"Theoretical and empirical studies\nof producer co-operatives: Will the twain meet?\" Journal of Economic\nLiterature, Vol. 31, pp. 1290-320.\nClaessens, S. and Ueda, K. (2008), “Banks and labour as stakeholders: Impact on\neconomic performance”, IMF Working paper, International Monetary Fund\nWashington, DC.\nConte, M. A. and Lawrence, H. (1992), \"Trends in ESOPs\", in Turner, J. and Beller,\nD. L. (Eds.), Trends in pensions, Government Printing Office, Washington, DC,\npp.135-48.\nConte, M. A. and Svenjar (1990), ”The performance effects of employee ownership\nplans” in Blinder, A. (ed.), Paying for productivity: A look at the evidence,\nWashington DC: Brookings Institution, pp. 143-181\n29\nConyon, M.J. and Freeman, R.B. (2001), Shared modes of compensation and firm\nperformance: UK evidence. Working Paper 8448, National Bureau of Economic\nResearch, Cambridge, MA, August. www.nber.org\/papers\/w8448.pd\nCore, J. E. and Guay, W.R. (2001), \"Stock options for non-executive employees,\"\nJournal of Financial Economics, Vol. 61, No.2, pp. 253-287.\nCouper, F. (2006), ‘Mutuality: Invaluable lessons from a classic model’, Strategic\nDirection, Vol. 22, No. 2, pp. 6-8.\nCraig, B. and Pencavel, J. (1992), \"The behaviour of worker cooperatives: the\nplywood companies of the Pacific Northwest\", American Economic Review,\nVol. 82, pp. 1083-1105.\nCzarnecki, E. R. (1970), \"Effects of profit sharing plans on union organising efforts,\"\nPersonnel Journal, pp. 763-73.\nD' Art, D. and Turner, T. (2000), \"Social partnership in Ireland: a view from below,\"\nThe Journal of the Irish Academy of Management, Vol. 21, No.1, pp. 51-69.\nD' Art, D. and Turner, T. (2004), \"Profit sharing, firm performance and union\ninfluence in selected European countries,\" Personnel Review, Vol. 33, No.3, pp.\n335-50.\nD' Art, D. and Turner, T. (2005), \"The revival of profit sharing: cyclical recurrence or\nparadigmatic shift?\" Kemmy Business School, University of Limerick, Working\nPaper, Department of Personnel and Employment Relations, Limerick.\nDeFusco, R. A., Johnson, R. R. and Zorn, T. S. (1990), \"The effect of executive stock\noption plans on stockholders and bondholders\", The Journal of Finance, Vol.\n45, No.2, pp. 617-627.\nDoucouliagos, C. (1995) ‘Worker participation and productivity in labor-managed and\nparticipatory capitalist firms: a meta-analysis’, Industrial and Labor Relations\nReview, 49, pp.58-77.\nEFESO (2005), \"Home page\", European Federation of Employee Share Ownership,\nBrussels, available at: www.efesonline.org, (Accessed: 05.03.2008).\nEFESO (European Federation of Employee Share Ownership), (2008), EFES\nNewsletter, March 8, Brussels.\nhttp:\/\/www.efesonline.org\/efes20news\/2008\/efes20newsletter20203-\n200820en.htm (Accessed: 05.03.2008).\nEOA (Employee Ownership Association) (2008), ‘Member companies’,\nhttp:\/\/www.employeeownership.co.uk\/member-companies.htm (Accessed:\n05.03.2008).\nEuropean Trade Union Institute (1983), Trade Unions and Collective Capital\nFormation: A Review of initiatives in Western European Countries. Brussels.\nFauver, L. and Fuerst, M. E. (2006), ”Does good governance include employee\nrepresentation? Evidence from German corporate boards”, Journal of Financial\nEconomics, Vol. 82, pp. 673-710.\nFreeman, R.B., Kruse, D. and Blasi, J. (2004), ’Monitoring colleagues at work: Profit\nsharing, employee ownership, broad-based stock options and workplace\nperformance in the United States’, A paper presented at the Association for\n30\nComparative Economic Studies Conference, Manchester Grand Hyatt, San\nDiego, 3-5 January.\nFrench, J. (1987), ”Employee perspectives on stock ownership: Financial investment or\nmechanism of control”, Academy of Management Review, Vol. 12, No. 3, pp.427-\n435.\nFreund, J. (1972), The sociology of Max Weber, Penguin, London.\nGalai, D. and Wiener, Z. (2008), “Stakeholders and the composition of the voting\nrights of the board of directors”, Journal of Corporate Finance, Vol. 14, pp.\n107–117.\nGinglinger, E, Megginson, W. L. and Waxin, T. (2010), “Employee ownership, board\nrepresentation, and corporate financial policies”, Social Science Research\nJanuary, papers.ssrn.com\/sol3\/papers.cfm?abstract_id=1252645 (accessed:\n15.04.2010).\nGregg, P. and Machin, S. (1988) ‘Unions and the incidence of performance-linked\npay schemes in Britain’, International Journal of Industrial Organisation, (6),\npp.91-107.\nGudmundson, D., Tower, C.B. and Hartman, E.A. (2003), “Innovation in small\nbusinesses: Culture and ownership structures do matter”, Journal of\nDevelopmental Entrepreneurship, Vol. 8, No. 1, pp.1-17.\nHallock, S. and Salazar, R. J. (2003), “A research model to investigate the\norganizational impact of an ESOP,” International Journal of Sociology and\nSocial Policy, Vol. 23, No. 12, pp. 47-63.\nHeracleous, L. and Lan, L.L. (2010) ‘The Myth of Shareholder Capitalism’ Harvard\nBusiness Review, April, 24-24.\nHuselid, M. A. (1995), \"The impact of human resource management practices on\nturnover, productivity, and corporate financial performance,\" Academy of\nManagement Journal, Vol. 38, pp. 635-672.\nIttner, C., Lambert, R. and Larcker, D. (2002), “The structure and performance\nconsequences of equity grants to employees of new economy firms,” Journal of\nAccounting & Economics, Vol. 34, Nos. 1-3, pp. 89-127.\nJensen, M. and Meckling, W. (1976), \"Theory of the firm: managerial behaviour,\nagency costs and ownership structure\", Journal of Financial Economics, Vol. 3,\npp. 305-360.\nJones, D. C. and Kato, T. (1995), \"The productivity effects of employee stock-\nownership plans and bonuses: Evidence from Japanese panel data\", The\nAmerican Economic Review, Vol. 85, No.3, pp. 391-414.\nKaarsemaker, E., and Poutsma, E. (2006), “The fit of employee ownership with other\nhuman resource management practices: Theoretical and empirical suggestions\nregarding the existence of an ownership high-performance work system, or\n“Theory O”, Economic and Industrial Democracy, Vol. 27, No. 2, pp. 669-685.\nKakabadse, A. and Kakabdse, N. (2008), Leading the Board, Plagrave, London.\nKakabadse, N., Kakabadse, A. and Kouzmin, A. (2004), “Directors’ remuneration:\nThe need for a geo-political perspective”, Personnel Review, Vol. 33, No. 5, pp.\n561-582.\n31\nKato, T. and Morishima, M. (2002), “The productivity effects of participatory\nemployment practices: Evidence from new Japanese panel data”. Industrial\nRelations, Vol. 41, No. 4, pp. 487-520.\nKelso, L. and Hetter, P. (1967), How to turn eighty million workers into capitalists on\nborrowed money, Random House, New York.\nKlein, K. J. (1987), \"Employee stock ownership and employee attitudes: A test of\nthree models\", Journal of Applied Psychology, Vol. 72, No. 2, pp. 319-32.\nKlein, K. J. and Hall, R.J. (1988), \"Correlates of employee satisfaction with stock\nownership: Who likes an ESOP most?\" Journal of Applied Psychology, Vol. 73,\nNo.4, pp. 630-8.\nKouzmin, A. (1980), “Control in Organizational Analysis: The Lost Politics”, in\nDunkerley, D. and Salaman, G. (Eds.), 1979 International Yearbook of\nOrganizational Studies, Routledge and Kegan Paul, London, pp. 56-89.\nKouzmin, A. (1993), “Review Essay” – Labour Relations in Eastern Europe:\nOrganizational Design and Dynamics [(Petkov, K. and Thirkell, J.E.M.),\nRoutledge, London, 1991], Organizational Studies, Vol. 14, No. 1, pp. 127-132.\nKouzmin, A. (2009),”Market Fundamentalism, Delusions and Epistemic Failure in\nPolicy and Administration”, Asia-Pacific Journal of Business Administration,\nVol.1, Issue 1, March\/April, pp. 23-39.\nKouzmin, A. and Korac-Kakabadse, N. (1997), “From phobias and ideological\nprescription: Towards multiple models in transformation management for\nsocialist economies in transition,” Administration & Society, Vol. 29, No. 2,\nMay, pp. 139-188.\nKroumova, M. and Sesil, J.C. (2005), \"Intellectual capital, monitoring and risk: what\npredicts the adoption of broad-based employee stock options?\" SSRN Working\nPaper Series.\nKruse, D. and Blasi, J. (1997) ‘Employee ownership, employee attitudes, and firm\nperformance: a review of the evidence,’ in Lewin, D., Mitchell, D. and Zaira, M\n(eds.), The Human Resource Management Handbook, London: JAI Press.\nKruse, D., Blasi, J. and Park, R. (2007) ‘Shared Capitalism in the U.S. Economy:\nPrevalence, Characteristics, and Employee Views of Financial Participation in\nEnterprises’, Paper presented for the Russell Sage\/NBER conference in New\nYork City, October 2006.\nKruse, D., Freeman, R.B., Blasi, J., Buchele, R., Scharf, A., Rodgers, L. and Mackin,\nC. (2003),”Motivating employee owners in ESOP firms: Human resource\npolicies and company performance”, NBER Working Paper No. 10177, National\nBureau of Economic Research, Cambridge,\nhttp:\/\/www.nber.org\/papers\/w10177.pdf (accessed: 20.02.2009).\nLamberg, J.A., Savage, G.T. and Pajunen, K. (2003), “Strategic stakeholder\nperspective to ESOP negotiations: The case of United Airlines”, Management\nDecision, Vol. 41, No.4, pp. 383-393.\nLi, J., Lam, K. and Moy, J.W. (2005), “Ownership reform amongst state firms in\nChina and its implications”, Management Decision, Vol. 43, No. 4, pp. 568-588.\n32\nLO Lands Organization in Denmark (Federation of Danish Unions) (1980),\nEconomic democracy – co-ownership and co-determination of employees as\nseen from the point of view of the Danish trade union movement, JMF\/GM,\nCopenhagen.\nLong, R. J. (1978), \"The relative effects of share ownership versus control on job\nattitudes in an employee-owned company\", Human Relations, Vol. 31, No. 9,\npp. 753-763.\nLong, R.J. (1978), ”Employee ownerhsip and attitudes toward the union: An\nempirical study,” Industrial Relations, Vol. 33, No. 2, pp. 237-254.\nLowitzsch, J. Hshi, I. and Woodword, R. (Eds.), (2008), The PEPPER IV Report:\nBenchmarking of employee participation in profits and enterprise results in the\nmember and candidate countries of the European Union (preliminary version\nfor presentation to the European Parliament, Strasbourg, May 21 2008), Inter-\nUniversity Centre at the Institute for Eastern European Studies, Free University\nof Berlin, Berlin May 2008.\nhttp:\/\/www.efesonline.org\/2008\/seventheuropeanmeeting\/Presentations\/DraftPE\nPPERIVReportStrasbourgEditionJensLowitzschandothers.pdf, (Accessed:\n20.03.2009)\nMatsunaga, S. (1995), \"The effects of financial reporting costs on the use of employee\nstock options\", The Accounting Review, Vol. 70, No.1, pp.1-26.\nMcHugh, P., Cutcher-Gershenfeld, J. and Polzin, M. (1999), \"Employee stock\nownership plans: Union influence and stakeholder interests\", Economic and\nIndustrial Democracy, Vol. 20, pp. 535-560.\nMeidner, R. (1978), Employee investment funds: An approach to collective capital\nformation, George Allen and Unwin, London.\nMelgarejo, Z., Arcelus, F.J. and Simon, K. (2007), “Measuring performance:\nDifferences between capitalist and labour-owned enterprises”, International\nJournal of Social Economics, Vol. 34, No. 7, pp. 485-501.\nMichie, J., Oughton, C. and Bennion, Y. (2002), Employee ownership, motivation and\nproductivity, The Work Foundation, London, November.\nwww.efesonline.org\/LIBRARY\/Employees20Dircet20Report.qxd.pdf.\nMonklands (2008), “The history of Coatbridge co-operative Ssciety,\nhttp:\/\/www.monklands.co.uk\/CoatbridgeCo-operative\/index.htm\nhttp:\/\/www.nceo.org\/esops\/index.html (Accessed: 03.03.2008).\nMorris, D., Bakan, U. and Wood, G. (2006), “Employee financial participation:\nEvidence from a major UK retailer”’, Employee Relations, Vol. 28, No. 4, pp.\n326-341.\nNCEO, (2005a), \"Employee stock options fact sheet\", National Center for Employee\nOwnership, Oakland, CA, March, www.nceo.org\/library\/optionfact.html.\nNCEO, (2005b), \"A statistical profile of employee ownership\", National Center for\nEmployee Ownership, Oakland, CA, March,\nhttp:\/\/www.nceo.org\/library\/eo_stat.html (Accessed: 05.03.2008).\n33\nNCEO, (2008a), “A Short History of the ESOP”, National Centre for Employee\nOwnership, http:\/\/www.nceo.org\/library\/history.html,\nhttp:\/\/www.nceo.org\/esops\/index.html (Accessed: 03.03.2008)\nNCEO, (2008b), “Employee Stock Ownership Plans (ESOPs)”, National Centre for\nEmployee Ownership, http:\/\/www.nceo.org\/esops\/index.html (Accessed:\n03.03.2008).\nNCEO, (2008c), “A Statistical Profile of Employee Ownership”, National Centre for\nEmployee Ownership, http:\/\/www.nceo.org\/library\/eo_stat.html\nhttp:\/\/www.nceo.org\/esops\/index.html (Accessed: 03.03.2008).\nNCEO, (2008d), Beyond stock options: Phantom stock, restricted stock, restricted\nstock Units, stock appreciation rights, and other equity alternatives (6th ed.),\nFebruary, http:\/\/www.nceo.org\/pubs\/beyondstockoptions.html\nNYSE (New York Stock Exchanges). (1982), “People and productivity: A challenge\nto corporate America, Office of Economic Research, New York.\nObradovic, J. (1970), “Participation and work attitudes in Yugoslavia”, Industrial\nRelations, Vol. 9, No. 2, pp.161-169.\nOdoi, A. (2007), “Workers enjoy fruits of their labor”, The Guardian, August 20,\nhttp:\/\/www.worldbusinesslive.com\/HumanCapital\/Article\/733048\/unsung-\nbenefits-employee-ownership\/Monday, (accessed: 20.05.2009).\nPark, R., Kruse, D. and Sesil, J. (2004), \"Does employee ownership enhance firm\nsurvival?\" Employee Participation, Firm Performance and Survival Advances in\nthe Economic Analysis of Participatory and Labour-Managed Firms, Vol. 8, pp.\n3-33.\nPendleton, A. (1997) ‘Characteristics of workplaces with financial participation:\nevidence from the WIRS’, Industrial Relations Journal, 28, pp.103-19\nPendleton, A. (2001), Employee ownership, participation and governance: a study of\nESOPs in the UK, Routledge, London.\nPendleton, A. (2005) ‘Employee share ownership, employment relationships, and\ncorporate governance’, in Harley, B., Hyman, J. and Thompson, P. (eds.),\nParticipation and Democracy at Work: Essays in Honour of Harvie Ramsay,\nLondon: Palgrave, pp. 75-93.\nPendleton, A. (2006) ‘Incentives, Monitoring, and Employee Stock Ownership Plans:\nNew Evidence and Interpretations’, Industrial Relations, 45 (4), pp.753–77.\nPendleton, A., Wilson, M. and Wright, M. (1998), \"The perceptions and effects of\nshare ownership: Empirical evidence from employee buyouts\", British Journal\nof Industrial Relations, Vol. 36, pp. 99-123.\nPérotin, V., and Robinson, A. (2003) ‘Employee participation in profit and ownership:\na review of the area and evidence’, Luxembourg: European Parliament,\nDirectorate General for Research: Working Paper, SOCI 109 EN.\nPfeffer, J. (1995), \"Producing sustainable competitive advantage through the effective\nmanagement of people\", Academy of Management Executive, Vol. 9, No.1, pp.\n55-69.\n34\nPoole, M. (1988), \"Factors affecting the development of employee financial\nparticipation in contemporary Britain: Evidence from a national survey\", British\nJournal of Industrial Relations, Vol. 26, No.1, pp. 21-36.\nPoole, M. (1989), The origins of economic democracy: Profit sharing and employee\nshareholding schemes, Routledge, London.\nPourceau, F. (2003), Employee participation and tax obstacles in the EU, European\nFederation of Employee Share Ownership (EFES), Brussels.\nPoutsma, E. and de Nijs, W. (2003), \"Broad-based employee financial participation in\nthe European Union\", International Journal of Human Resource Management,\nVol. 14, No. 6, pp. 863-92.\nPoutsma, E., Kalmi, P. and Pendleton, A. (2006), “The relationship between financial\nparticipation and other forms of employee participation: New survey evidence\nfrom Europe’, Economic and Industrial Democracy, Vol. 27, No. 2, pp. 637-\n668.\nRobinson, A. and Zhang, H. (2005), ‘Employee share ownership: safeguarding\ninvestments in human capital, British Journal of Industrial Relations. Vol. 43,\nNo.3, pp. 469 – 488\nRosen, C. and Carberry, E. (2002), Ownership management: Building a culture of\nlasting innovation, National Center for Employee Ownership, Oakland, CA.\nRosen, C., Case, J. and Staubus, M. (2005a), Equity: Why employee ownership is\ngood for business, Harvard Business School Press, Boston.\nRosen, C., Case, J. and Staubus, J. (2005b), When employees have equity attitude,\nHarvard Business School Working Knowledge Series.\nRosen, G. (2008), “ESOPs grow significantly in 2007”, The National Centre for\nEmployee Ownership (NVEO), http:\/\/www.nceo.org\/columns\/cr247.html\n(accessed: 07.05.2008).\nRousseau, D.M. and Shperling, Z. (2003), \"Pieces of the action: Ownership and the\nchanging employment relationship\", Academy of Management Review, Vol. 28\nNo.4, pp. 553-570.\nRousseau, D. M. and Shperling, Z. (2003), \"Pieces of the action: Ownership and the\nchanging employment relationship\", Academy of Management Review, Vol. 28,\nNo.4, pp. 553-570.\nRousseau, D. M. and Shperling, Z. (2004), \"Ownership and the changing employment\nrelationship: Why stylized notions of labour no longer generally apply – a reply\nto Zardkoohi and Paetzold\", Academy of Management Review, Vol. 29, No.4,\npp. 562-9.\nSaunders, P. and Harris, C. (1994), Privatization and popular capitalism, Open\nUniversity Press, Buckingham.\nSEC (Securities and Exchange Commission) (2008), “Employee stock ownership\nplans (ESOPs)”, http:\/\/www.sec.gov\/answers\/esops.htm(Accessed: 05.03.2008).\nSengupta, S. (2008),”The impact of employee-share-ownership schemes on\nperformance in unionized and non-unionized workplaces”, Industrial Relations\nJournal, Vol. 39, No. 3, pp. 170-90.\n35\nSengupta, S., Whitfield, K. and McNabb, B. (2007), ‘Employee share ownership and\nperformance: Golden path or golden handcuffs?’ The International Journal of\nHuman Resource Management, Vol. 18, pp. 1507 – 1538.\nSesil, J. C., Kroumova, M. K., Blasi, J. R. and Kruse, D. L. (2002), \"Broad-based\nemployee stock options in U.S. ‘New economy’ firms\", British Journal of\nIndustrial Relations, Vol. 40, No.2, pp. 273-94.\nSesil, J. C., Kruse, D. L. and Blasi, J. R. (2003), “Sharing ownership via employee\nstock ownership”, in Sun, L. (Ed.), Ownership and governance of enterprises:\nRecent innovative developments, Palgrave Macmillan, New York, pp. 96-123.\nStack, J. and Burlingham, B. (2002), A stake in the outcome: Building a culture of\nownership for the long term success of your business, Currency, New York.\nTannenbaum, A. S. (1983), “Employee-owned companies”, Research in\nOrganizational Behaviour, Vol. 5, No. 2, pp. 235-268.\nUvalić, M. and D. Vaughan-Whitehead (eds.), (1997, reprinted 1999), Privatization\nsurprises in transition economies: Employee-ownership in Central and Eastern\nEurope, Edward Elgar, Cheltenham.\nWebb, C. (1912), Industrial cooperation: The story of a peaceful revolution,\nCooperative Union, Manchester.\nZardkoohi, A. and Paetzold, R. L. (2004), \"Ownership and the changing employment\nrelationship: A comment on Rousseau and Shperling\", Academy of Management\nReview, Vol. 29, No.4, pp. 556-562.\nZeuli, K. A. and Cropp, R. (2004), Cooperatives: Principles and practices in the 21st\ncentury, Cooperative Extension Publications, Wisconsin.\n"}