{"doi":"10.1111\/j.1475-6765.2009.01914.x","coreId":"215087","oai":"oai:eprints.lse.ac.uk:28648","identifiers":["oai:eprints.lse.ac.uk:28648","10.1111\/j.1475-6765.2009.01914.x"],"title":"Cabinet structure and fiscal policy outcomes","authors":["Wehner, Joachim"],"enrichments":{"references":[],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2010","abstract":"A central explanation of fiscal performance focuses on the structure of the cabinet. However, the partisan context of cabinet decisions remains under-explored, the findings are based on small samples and the variables of interest are often poorly operationalised. Using a new dataset of spending ministers and partisan fragmentation in the cabinets of 58 countries between 1975 and 1998, this study finds a strong positive association between the number of spending ministers and budget deficits and expenditures, as well as weaker evidence that these effects increase with partisan fragmentation","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/215087.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/28648\/1\/Wehner_Cabinet-structure-and-fiscal-policy-outcomes_2010.pdf","pdfHashValue":"bd4e7949ce2d26adafde1ae2c58b26bac65f58de","publisher":"Blackwell Publications on behalf of the European Consortium for Political Research","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:28648<\/identifier><datestamp>\n      2017-05-04T09:36:12Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4756<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/28648\/<\/dc:relation><dc:title>\n        Cabinet structure and fiscal policy outcomes<\/dc:title><dc:creator>\n        Wehner, Joachim<\/dc:creator><dc:subject>\n        HJ Public Finance<\/dc:subject><dc:subject>\n        JF Political institutions (General)<\/dc:subject><dc:description>\n        A central explanation of fiscal performance focuses on the structure of the cabinet. However, the partisan context of cabinet decisions remains under-explored, the findings are based on small samples and the variables of interest are often poorly operationalised. Using a new dataset of spending ministers and partisan fragmentation in the cabinets of 58 countries between 1975 and 1998, this study finds a strong positive association between the number of spending ministers and budget deficits and expenditures, as well as weaker evidence that these effects increase with partisan fragmentation.<\/dc:description><dc:publisher>\n        Blackwell Publications on behalf of the European Consortium for Political Research<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/28648\/1\/Wehner_Cabinet-structure-and-fiscal-policy-outcomes_2010.pdf<\/dc:identifier><dc:identifier>\n          Wehner, Joachim  (2010) Cabinet structure and fiscal policy outcomes.  European Journal of Political Research, 49 (5).  pp. 631-653.  ISSN 0304-4130     <\/dc:identifier><dc:relation>\n        http:\/\/www3.interscience.wiley.com\/journal\/117963514\/home<\/dc:relation><dc:relation>\n        10.1111\/j.1475-6765.2009.01914.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/28648\/","http:\/\/www3.interscience.wiley.com\/journal\/117963514\/home","10.1111\/j.1475-6765.2009.01914.x"],"year":2010,"topics":["HJ Public Finance","JF Political institutions (General)"],"subject":["Article","PeerReviewed"],"fullText":"  \nJoachim Wehner \nCabinet structure and fiscal policy \noutcomes \n \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: \nWehner, Joachim (2010) Cabinet structure and fiscal policy outcomes. European Journal of \nPolitical Research, 49 (5). pp. 631-653. ISSN 0304-4130  \nDOI: 10.1111\/j.1475-6765.2009.01914.x  \n \n© 2010 European Consortium for Political Research \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/28648\/ \nAvailable in LSE Research Online: November 2014 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \n  \n \nCabinet structure and fiscal policy outcomes \n \n \n \n \nJoachim Wehner \nGovernment Department \nLondon School of Economics and Political Science \nj.h.wehner@lse.ac.uk \nTel: +44 (0)20 7107 5408 \nFax: +44 (0)20 7107 5173 \n \n \n \n \n\t\r   2 \n \n \n \n \n \nAcknowledgements: I received valuable comments and suggestions from Michael \nBruter, Daniel Chasquetti, Thomas Cusack, Patrick Dunleavy, Sarah Edwards, Benny \nGeys, Mark Hallerberg, Joseph Joseph, James Ker-Lindsay, Ian Lienert, James E. Mahon, \nFrancisco Panizza, Lauren Phillips, Waltraud Schelkle, Daniel Sturm, Jane Tinkler, \nFlorian Walch, David Woodruff and three anonymous reviewers. Octavio Amorim Neto \ngenerously shared his data on cabinet composition in several Latin American countries. I \nalso thank Mike Seiferling and Christian Fingerhuth for outstanding research assistance. \nPrevious versions of this paper were presented at seminars held at the Social Science \nResearch Center Berlin and the London School of Economics and Political Science, as \nwell as the 2009 Annual Meeting of the American Political Science Association and the \n2009 General Conference of the European Consortium for Political Research. \n\t\r   3 \n \n \n \n \n \nAbstract: A central explanation of fiscal performance focuses on the structure of the \ncabinet. However, the partisan context of cabinet decisions remains underexplored, the \nfindings are based on small samples and the variables of interest are often poorly \noperationalised. Using a new dataset of spending ministers and partisan fragmentation in \nthe cabinets of 58 countries between 1975 and 1998, I find a strong positive association \nbetween the number of spending ministers and budget deficits and expenditures, as well \nas weaker evidence that these effects increase with partisan fragmentation. \n \nKeywords: Cabinet; Fiscal policy; Political parties. \n \nJEL classification: H11, H61, H62. \n\t\r   4 \nThe outcome of the annual budget process is crucial in the competition amongst cabinet \nministers for political standing. As one minister sums up the effect of budgetary decisions \non his career prospects:1 ‘If that bugger in transport gets more money than me, I look like \na loser.’ Such individual level incentives to boost spending can have profound aggregate \nconsequences (Niskanen 1971; Von Hagen & Harden 1995). Cross-national studies find \nthat cabinet size or the number of spending ministers affects fiscal performance \n(Volkerink & De Haan 2001; Perotti & Kontopoulos 2002; Woo 2003; Ricciuti 2004). \nHowever, this literature suffers from several shortcomings. First, it gives insufficient \nconsideration to the possible interaction between the number of spending ministers and \nthe partisan context of bargaining over the budget. Second, sample size is limited and the \nextent to which the findings can be generalised beyond a few industrialised democracies \nremains unclear. Finally, the main variables of interest are often poorly operationalised, \nwhich raises doubts about the robustness of some of the results. These shortcomings \nprovide strong reasons to re-examine the relationship between cabinet structure and fiscal \nperformance.  \n \nThis article advances the literature on fiscal performance by addressing the above \nlimitations. I introduce a new dataset of the number of spending ministers and partisan \nfragmentation in a diverse sample of countries. The definition of spending ministers is \nclosely linked to the theoretical argument that certain cabinet members lack incentives to \ninternalise the full cost of their actions. The analysis shows a strong positive association \nbetween the number of spending ministers and central government budget deficits and \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \n1 The comment was made under condition of anonymity. \n\t\r   5 \nexpenditures. Moreover, I use data on the allocation of ministerial portfolios to explore \nwhether the effect of the number of spending ministers is conditional on the extent of \npartisan fragmentation in the cabinet. I find some evidence that political parties may be \nable to mitigate the profligate tendencies of individual spending ministers. Overall, my \nresults confirm that the structure of cabinet, and the number of spending ministers in \nparticular, is an essential determinant of fiscal policy outcomes. \n \nThe article has three main parts. Part one reviews cross-national studies that include \nevidence on the fiscal policy impact of cabinet size or the number of spending ministers \nas well as the partisan fragmentation of the cabinet. I pay particular attention to the \ndefinition of the variables of interest, sample characteristics and the estimated effects. \nThe second part introduces a new dataset of spending ministers and partisan \nfragmentation in the cabinets of 58 countries between 1975 and 1998, which forms the \nbasis of the empirical analysis presented here. This part also describes the remaining \nvariables, including indicators of fiscal performance as well as economic and political \ncontrols. Part three presents the statistical models and results. The conclusion explores \npolicy implications and possibilities for further research. \n \n \nBackground and hypotheses \n \nThe theoretical literature on the common pool resource problem in budgeting highlights \nthe adverse fiscal effects of fragmented decision making. Weingast, Shepsle and Johnsen \n\t\r   6 \n(1981) express this as the ‘law of 1\/n’. In their model, expenditure can be targeted at a \nparticular geographical district, while costs are shared equally across all districts. This \nimplies that the larger the number of decision makers with separate constituencies, the \nsmaller the share of the tax burden each considers. As a result, assuming universalistic \nlogrolls, ‘the degree of inefficiency in project scale… is an increasing function of the \nnumber of districts’ (p. 654). Von Hagen and Harden (1995) explore the fiscal impact of \ndifferent cabinet structures. Amongst others, they show that a process where spending \nministers independently develop their spending plans results in a budget that is larger \nthan optimal for the government as a whole. The larger the number of spending ministers, \nthe greater this spending bias. Elsewhere, Velasco (2000) demonstrates the effect of \nincreasing the number of special interests represented in fiscal policy decisions on \nspending, deficits and debt. Overall, this theoretical literature strongly cautions against a \nproliferation of fiscal decision makers.2 In the context of cabinet decision making, the \nrelevant fiscal actor can be either an individual minister or a political party, if the latter \noperates as ‘a more or less cohesive entity representing the interests of specific groups’ \n(Perotti & Kontopoulos 2002: 195; see also Volkerink & De Haan 2001: 222). \n \n\t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \n2 The common pool literature contrasts with veto player theory (Tsebelis 2002), according to which the \nnumber of decision makers and their ideological dispersion affect policy change, that is, the likelihood and \nmagnitude of departures from the status quo. The existence of multiple veto actors is associated with \ndelayed adjustment to economic shocks (Roubini & Sachs 1989; Alesina & Drazen 1991; Poterba 1994). \nThe literature on spending ministers is based on the common pool resource problem. It is beyond the scope \nof this paper to conduct a unified assessment of the two theories (see Franzese 2008). \n\t\r   7 \nSeveral papers provide empirical evidence on the relationships amongst the number of \nspending ministers (or cabinet size), partisan fragmentation and fiscal outcomes. \nVolkerink and De Haan (2001) use a panel of 22 OECD countries over the period 1971 to \n1996 to investigate the effects of various indicators of fragmentation on deficits. One of \ntheir independent variables is the number of spending ministers, which they define as ‘the \ntotal number of ministers in government… minus the ministers of finance and\/or the \nbudget and the prime minister’ (p. 224). In their sample, the number of spending \nministers ranges between five and 33 and the average is about 15. They find a robust \npositive effect of this variable on central government deficits. According to their basic \nresults, the addition of one spending minister leads to a deterioration of the budget \nbalance by 0.08 per cent of GDP (p. 229). Their analysis also includes the effective \nnumber of parties in government, defined in accordance with Laakso and Taagepera \n(1979). Volkerink and De Haan (2001: 229) find that adding one effective party to the \ncoalition increases the deficit by 0.4 percentage points. They also report that the fiscal \neffects of an increase in the number of spending ministers and the effective number of \nparties in government are dampened as economic growth increases, although the paper \ndoes not contain a complete analysis of this interaction. However, they do not interact the \nnumber of spending ministers and the effective number of parties in government. \n \nPerotti and Kontopoulos (2002) use a panel of 19 OECD countries between 1970 and \n1995 to investigate the role of fragmentation in fiscal performance, including the number \nof spending ministers. Their operationalisation of this variable is based on counting a \nselection of sectoral portfolios plus finance ministers and related positions, such as \n\t\r   8 \nministers responsible for the budget (p. 219). The inclusion of the latter does not make \ntheoretical sense, since a central role of finance ministers is to safeguard fiscal discipline \nvis-à-vis spending ministers (e.g., Von Hagen & Harden 1995; Schick 2001; Jensen et al. \n2003). I discuss this issue in detail in the following section. In addition, the count of \nportfolios by Perotti and Kontopoulos (2002) is highly selective and excludes important \nministries such as those relating to welfare and social assistance. In this sample, the \nmisleadingly labelled ‘number of spending ministers’ ranges between eight and 18 and \nhas a mean of about 11. Despite the poor operationalisation of this variable compared \nwith Volkerink and De Haan (2001), the conclusions are similar. Perotti and Kontopoulos \n(2002: 208) find that spending ministers are ‘a very important and robust determinant of \nfiscal outcomes’. They estimate that an additional ministry increases the general \ngovernment deficit by 0.12 percentage points of potential GDP per year, due to impacts \non spending. They also include the unweighted number of parties in the coalition as a \nmeasure of partisan fragmentation, but the estimates are not statistically significant in \nalmost all of their regressions. According to this analysis, an increase in unemployment \naccentuates the fiscal effects of spending ministers and parties in the coalition (pp. 213-\n214). The authors do not explore the interaction between the two variables. \n \nThe analysis of economic, political and institutional determinants of deficits by Woo \n(2003) is more comprehensive in terms of countries covered. He uses data comprised of \ndecade averages for 57 developed and developing countries for the periods 1970 to 1979 \nand 1980 to 1990. One of his independent variables is cabinet size, defined as the number \nof ministers. During the 1970s, cabinet size in this sample ranged between 11 and 36, \n\t\r   9 \nwith a mean of about 19. During the 1980s, the range was from nine to 45 and the \naverage about 22. Woo finds a strong association with public sector deficits. He estimates \nthat adding one minister to the cabinet is associated with an increase in the deficit of the \npublic sector amounting to 0.2 per cent of GDP (p. 399). This analysis also includes \nindicators of coalition and minority government, as well as measures of partisan \nfragmentation in the legislature, but none of them is statistically significant at \nconventional levels. The author does not explore the possible interaction between the \npartisan fragmentation of the government and cabinet size. \n \nRicciuti (2004) analyses the association between fragmentation and fiscal policy \noutcomes using a panel of 19 OECD countries over the years 1975 to 1995. One of his \nindependent variables is the number of spending ministers, based on the definition by \nVolkerink and De Haan (2001). In this sample, the number of spending ministers varies \nbetween seven and 33 and the mean is about 16. According to the results, the number of \nspending ministers is the only ‘consistently significant’ determinant of the primary \nsurplus and primary expenditures of central government (Ricciuti 2004: 382). The \nestimated effects of an additional spending minister on the primary surplus and primary \nspending are -0.13 and 0.11 per cent of GDP, respectively (pp. 378 and 382). This study \nalso includes a measure of the partisan fractionalisation of the government based on the \nseat shares of the ruling parties in the lower house of the legislature. The variable has no \nstatistically significant effect on deficits (p. 378) and barely achieves significance at the \n10 per cent level in only one out of four expenditure regressions (p. 382). As in the three \n\t\r   10 \nother papers reviewed above, the author does not explore the interaction between the \nnumber of spending ministers and the partisan fractionalisation of the government. \n \nIn sum, the cross-national literature on fiscal performance contains evidence that cabinet \nsize or the number of spending ministers affects budget outcomes.3 This finding appears \nto be robust to different operationalisations of this variable and to hold for several \nindicators of fiscal performance. On the other hand, the evidence on an association \nbetween partisan fragmentation in the executive and fiscal policy outcomes is much \nweaker. However, the existing literature also has a number of shortcomings, which I \ndiscuss in detail in the following paragraphs. \n \nFirst, previous work does not consider the potential interaction between partisan \nfragmentation and the number of spending ministers. If political parties can force their \nspending ministers to internalise a larger share of the costs than they otherwise would \n(Perotti & Kontopoulos 2002: 195), then a cabinet with a large number of spending \nministers should be less profligate if all of them belong to a single political party. Von \nHagen and Harden (1995: 775) recognise this possibility and speculate that party \ndiscipline may mitigate fiscal illusion, ‘but most likely does not do so completely’. To \nmy knowledge, this possible interaction has yet to be investigated empirically. Here, I \n\t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \n3 Other authors focus on the determinants of fiscal performance at the subnational level (see the review by \nKirchgässner 2001). Some of these consider equivalent measures of cabinet size or the number of spending \nministers as independent variables, for instance Ashworth and Heyndels (2005) in their analysis of Flemish \nlocal governments or Schaltegger and Feld (2009) in their study of Swiss cantons. \n\t\r   11 \nconjecture that the fiscal effect of the number of spending ministers is conditional on the \npartisan fragmentation of the cabinet. \n \nA second limitation of existing empirical work is that the samples used are of modest \nsize. The evidence from OECD countries is based on less than 500 observations and a \nselection of the advanced industrialised democracies (Volkerink & De Haan 2001; Perotti \n& Kontopoulos 2002; Ricciuti 2004). While Woo (2003) expands the number of \ncountries, missing data forces him to work with pooled averages for two decades, which \nyields a maximum of less than 100 observations. In contrast, important recent \ncontributions to the empirical literature on the fiscal effects of constitutions (Persson & \nTabellini 2003) and political budget cycles (Brender & Drazen 2005) use much larger \nglobal samples. Such an approach can help to explore the generalisability or context \nconditionality of theories. The empirical study of fiscal institutions should follow suit and \nexpand beyond the usual suspects. \n \nA third critique is that the key variables of interest are not always precisely defined and \noperationalised. Notably, Perotti and Kontopoulos (2002) and Woo (2003) use indicators \nof cabinet size rather than spending ministers. However, the cabinet includes several \nactors who can be expected to internalise much of the cost of their actions. As Wildavsky \n(1975: 9) puts it, budgeting always involves ‘spenders’ and ‘savers’. More precisely, Von \nHagen and Harden (1995: 774) highlight that ‘the prime minister and the finance \nminister… are not bound by the particular interests of a spending department and can be \nassumed to give more weight to the collective interest of the government’. Alesina and \n\t\r   12 \nPerotti (1996: 20-21) argue along similar lines: ‘The constituencies of spending ministers \nare groups and industries who benefit from certain spending programs while, at least in \ntheory, the constituency of the Treasury Minister is the “average” tax-payer. Thus the \nspending ministers do not internalize the aggregate costs of certain spending programs, \nwhile the Treasury has an incentive to internalize.’ Both Volkerink and De Haan (2001) \nand Ricciuti (2004) use a more appropriate measure, excluding the chief executive and \nthe finance and\/or budget ministers.4 \n \nMoreover, the measures of partisan fragmentation in the government that are used in \nthese studies are flawed. An analysis based on the common pool resource problem \nrequires a size-weighted measure of partisan fragmentation to capture the extent to which \nparties have incentives to internalise costs (Franzese 2008). Only Volkerink and De Haan \n(2001) and Ricciuti (2004) use size-weighted measures, but not Perotti and Kontopoulos \n(2002) and Woo (2003). In addition, none of the studies reviewed here use measures of \npartisan fragmentation based on the portfolio shares of each party in the cabinet. One \nreason might be that these data are not routinely collected for a large number of countries \nand years. For instance, the World Bank’s Database of Political Institutions (Beck et al. \n2001) includes several measures of partisan fragmentation, but they are based on seat \nshares in the legislature. Empirical studies of portfolio allocation have found a near-\nperfect correlation between seat shares and portfolio shares in coalition governments, \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \n4 In addition, the relationship between the chief executive and the finance minister deserves more attention \nin future research. For instance, Jochimsen and Nuscheler (2009) find that the partisan alignment between \nthe prime minister and the finance minister in coalition governments affects deficits in the German Länder. \n\t\r   13 \nwhich Warwick and Druckman (2006: 635) describe as ‘one of the strongest empirical \nrelationships documented in the social sciences’. Yet, this finding is based almost entirely \non data for a few parliamentary democracies in Western Europe (see the review in \nVerzichelli 2008). We cannot simply assume that seat shares translate into portfolio \nshares in quite such mechanical ways elsewhere (Amorim Neto 2006; Cheibub 2007).5 \n \nIn addition, the model by Von Hagen and Harden (1995) shows that the fiscal effect of an \nincrease in the number of spending ministers depends upon the strategic power of the \nfinance minister in the budget process. Unfortunately, I have insufficient institutional \ndata on the balance of power between the finance minister and spending ministers to test \nthis prediction. Hallerberg, Strauch and Von Hagen (2007) carefully document several \ninstitutional features to assess the strategic authority of finance ministers, for example the \npower to impose ceilings on the budget bids of spending ministers, but only for 15 \nEuropean Union countries and part of the sample period used here. The data for Latin \nAmerican countries collected by Alesina, Hausmann, Hommes and Stein (1999) are not \ndetailed enough in this regard (see the critique by Hallerberg & Marier 2004: 578), while \nselected indicators in Perotti and Kontopoulos (2002: 220-221) are again limited to some \nindustrialised democracies. Ideally, a comprehensive empirical analysis of the \nrelationship between cabinet structure and fiscal policy outcomes would also cover the \n\t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \n5 A further potential problem with any measure of partisan fragmentation is that factions within parties may \nbe very powerful and in some cases functionally equivalent to separate parties (Thies 2001). Similarly, the \nrole of political parties in policy decisions is affected by the degree of discipline that their leaders can \nenforce (Hallerberg & Marier 2004; Hankla 2006). These possibilities deserve investigation elsewhere. \n\t\r   14 \ninteraction between the number of spending ministers and the strategic power of the \nfinance minister. However, given the paucity of institutional data on executive budget \nprocesses, this aspect has to be tackled in future research. \n \nUsing a diverse sample of countries as well as theoretically grounded operationalisations \nof the variables of interest, the contribution of this paper is to test whether the number of \nspending ministers is associated with fiscal policy outcomes and whether this effect is \nincreasing in the partisan fragmentation of the cabinet. The original formulation of the \n‘law of 1\/n’ suggests that we should expect effects on expenditure levels. However, an \nempirical test should not ignore tax expenditures, which are substantial in many countries \n(Organisation for Economic Co-operation and Development 1984 and 1996).6 The \nextensive use of tax expenditures undermines the usefulness of public spending as an \nindicator of the size of government (Howard 1997). On the other hand, whether money is \nspent directly or through a ‘tax loophole’ on the revenue side does not affect the budget \nbalance. Hence, I consider impacts on both the budget deficit as well as expenditures and \ntest the following two sets of hypotheses: \n \nH1a: An increase in the number of spending ministers is associated with an increase in \nthe budget deficit. \n \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \n6 A tax expenditure is ‘a transfer of public resources that is achieved by reducing tax obligations with \nrespect to a benchmark tax, rather than by a direct expenditure’ (Kraan 2004: 130). Tax expenditures can \ntake a number of forms, including exemptions, allowances, credits, rate relief and tax deferral. \n\t\r   15 \nH1b: An increase in the number of spending ministers is associated with an increase in \npublic spending. \n \nH2a: The effect of an increase in the number of spending ministers on the budget deficit \nis increasing in the partisan fragmentation of the cabinet. \n \nH2b: The effect of an increase in the number of spending ministers on public spending is \nincreasing in the partisan fragmentation of the cabinet. \n \n \nA new dataset of spending ministers and partisan fragmentation \n \nThe analysis requires a theoretically grounded definition of the number of spending \nministers. Here, I code all ministers with full cabinet rank as spending ministers with the \nexceptions of the chief executive (prime minister, president or chancellor)7 and her \ndeputies, finance ministers (including budget ministers, ministers of the economy and the \ntreasury) and attached ministers, as well as any minister who is directly attached to the \nchief executive or who is subordinate to a portfolio for which a representative minister \nalready exists, such as associate ministers, assistant ministers, minister delegates, \n\t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \n7 In Switzerland’s unique executive arrangement, the presidency rotates annually and confers no special \npowers over the other members of the cabinet. In this case only, I do not subtract the president and vice \npresident from my count of spending minsters, unless they also meet one of the remaining conditions for \nexclusion established in this definition. \n\t\r   16 \nministers in other ministries and parliamentary secretaries. The latter group can also \ninclude ministers of state and secretaries of state, but these titles have to be carefully \ninterpreted, since their meaning is heterogeneous across countries.8 This \noperationalisation focuses on cabinet members who are most likely to externalise a large \nshare of the cost of their actions and disregards junior members who are unlikely to be as \nclosely involved in budgetary negotiations as the main minister in charge of a portfolio. \n \nBased on this definition, the project collected data on spending ministers in all 58 \ncountries in Persson and Tabellini’s (2003) panel dataset, using the Europa World \nYearbook. Portfolios that are indicated as vacant in the source book are included in the \ndataset, assuming this state to be temporary. The number of spending ministers coded for \nany given year reflects the information on the composition of the cabinet reported in the \nYearbook for that particular year. Hence, I assume that the cabinets in place around the \nbeginning of the calendar year, when the Yearbook data were collected, affect fiscal \noutcomes for that year. Governments typically have a degree of flexibility during the \nexecution of the budget (Hallerberg et al. 2007; Beetsma et al. 2009), so this is a \nreasonable assumption (see also Tsebelis & Chang 2004: 457-458).9 \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \n8 In France, Portugal and Japan, ‘ministers of state’ are full members of cabinet with equivalent or greater \nstatus than other independent cabinet ministers and are coded as spending ministers. Similarly, only where \nthe title ‘secretary of state’ indicates a full member of cabinet – as in the United States, the United \nKingdom, the Dominican Republic and Mexico – are they included in the count of spending ministers. \n9 Cabinets also exert influence during the formulation of the budget, prior to the start of the fiscal year. \nHowever, the design and duration of the budget formulation process varies across countries. To take into \naccount these differences would require very detailed data on the executive budget process, which are not \n\t\r   17 \n \nI make no attempt to assign differential weights to portfolios, for several reasons. First, \nwhile it would be nice to capture variation in the degree to which spending ministers \ninternalise the cost of their actions, it is unclear how this might be achieved. Portfolio \nsalience scores (Druckman & Warwick 2005) do not capture such incentives. Nor do \nbudget shares. Fiscal illusion may affect different components of expenditure differently, \nas spending units vary greatly with regard to the structure of their budgets, not only the \noverall envelope (Dunleavy 1991). Second, political clout in cabinet negotiations depends \non personality factors that vary over time depending on the minister in charge, which \narguably is impossible to capture systematically. Finally, any weights would have to be \nrecalculated every time portfolios are reconfigured. This would be very data intensive, \ngiven the substantial amount of within-country variation in the number of spending \nministers (see below). For these reasons, and in line with the empirical literature \nreviewed above, I give equal weight to each spending minister. \n \nThe dataset of the number of spending ministers comprises 1358 observations over the \nperiod 1975 to 1998, excluding observations for years during which Freedom House \nclassified a country as ‘not free’.10 Figure 1 summarises the distribution of spending \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \navailable for most countries in this sample. As a robustness check, I experimented with a lagged version of \nthe spending ministers variable and obtained baseline results similar to those reported in the next section. \n10 The Government Finance Statistics (GFS) published by the International Monetary Fund contain fiscal \ndata for more recent periods. However, as a result of the introduction of the 2001 GFS Manual, data \navailability is limited to the period from 1990 onwards and in many series there are breaks when the basis \nof reporting changed from cash to non-cash. \n\t\r   18 \nministers with a box plot. For each country, the box contains the inter-quartile range, the \nwhiskers indicate the range of the more extreme values, and the dots mark any outliers. \nFigure 1 highlights substantial variation both within countries as well as across countries. \nOverall, the number of spending ministers ranges from five to 28. The median in the \npooled sample is 13, which is indicated by the dashed line in Figure 1. Despite losing \nsome observations due to missing data for the dependent or control variables, the analysis \nin the following section is based on about three times as many observations as previous \nempirical work. Moreover, as the sample contains both industrialised and developing \ncountries, it is substantially more diverse compared with most prior studies. \n \n[FIGURE 1 ABOUT HERE] \n \nNote that the ‘law of 1\/n’ may apply to both the executive and the legislative arenas. \nEmpirical scrutiny of the relationship between the number of legislators and fiscal policy \noutcomes has largely focused on state and local governments in the United States (e.g., \nGilligan & Matsusaka 2001; Baqir 2002; MacDonald 2008).11 To date, there is limited \ncross-national work on the fiscal effect of legislative size (Stein et al. 1998; Bradbury & \nCrain 2001). The latter studies do not include cabinet size or the number of spending \nministers, although the work reviewed in the previous section highlights that the \nexecutive arena should not be neglected. One of the robustness checks I discuss in the \nfollowing section entails the simultaneous inclusion of both the number of seats in the \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \n11 For an exception, see Fiorino and Ricciuti’s (2007) analysis of the effect of legislature size on per capita \nexpenditure by regional governments in Italy. \n\t\r   19 \nlower house of the legislature and the number of spending ministers. Elsewhere, I provide \na detailed investigation into the fiscal effect of partisan fragmentation in legislatures \n(Wehner 2010). \n \nTo investigate the possible interaction of spending ministers with the partisan \nfragmentation of the cabinet, I use a Herfindahl-like index: \n€ \n1− Partyi2i=1\nn∑ . Here, Partyi \ndenotes the number of portfolios of governing party i as a share of the total number of \nportfolios held by all n parties in the cabinet (excluding deputy ministers and similar \njunior positions, but this time including the finance minister and chief executive). The \nequation can generate values between zero (single party cabinets) and close to one (when \nno party has more than a single cabinet portfolio). This measure is better at dealing with \noutliers at the upper end of the distribution than the ‘effective number of parties’ (Laakso \n& Taagepera 1979), which lacks an upper bound. To ensure consistency with the data on \nspending ministers, the main source is again the Europa World Yearbook, supplemented \nwhere necessary with data from Amorim Neto (2006) and national sources. \n \nRelated literature controls for annual GDP growth and inflation (Hallerberg & Marier \n2004) as well as trade openness (Alesina et al. 1999). In addition, I use a dummy for \nyears with executive elections to control for possible electoral budget cycles (Franzese \n2002; Brender & Drazen 2005). I also speculate that left parties in government might be \nmore profligate than administrations from the centre or the right of the political spectrum \nand control for a head of government from a left-of-centre party (for a more nuanced \nanalysis, see Cusack 1997). Freedom House scores account for the possibility that \n\t\r   20 \ndemocracy affects the demand for public spending (Stasavage 2005). I also account for \nthe possible fiscal effect of the 1992 Maastricht Treaty with a dummy set equal to one for \nthe 12 original Eurozone members from that year onwards. Finally, I capture the fiscal \ncost of armed conflict with a dummy indicating years were countries participated in wars \naccording to Sarkees (2000).12 The appendix provides variable definitions and data \nsources, and Table 1 reports summary statistics. \n \nIn addition, a wide range of time invariant or rarely changing variables may also affect \nfiscal policy outcomes, including colonial heritage, population size, geographic location, \nthe form of government and the type of electoral system (Persson & Tabellini 2003). \nHere, as specified below, I use an empirical model with country fixed effects to capture \nthe direct impact of any time invariant variables and to ‘soak up’ most of the explanatory \npower of rarely changing variables (Beck 2001: 285). \n \n[TABLE 1 ABOUT HERE] \n \n \nEmpirical models and results \n \nTo test the hypotheses that an increase in spending ministers is associated with an \nincrease in deficits (H1a) and public spending (H1b), I use the following fixed effects \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \n12 These data have casualty-based inclusion criteria, which are explained in detail in Sarkees (2000). More \nrefined measures could be explored in future research. \n\t\r   21 \nspecification to model fiscal outcomes (either the central government budget deficit or \nexpenditures as a share of GDP) in country i at time t: \n \nFiscal outcomei,t = β1(Spending ministersi,t) + β2(Partisan fragmentationi,t) + \nβ3(Fiscal outcomei,t-1) + β4(Controlsi,t) + Countryi + Yeart + εi,t \n \nThe coefficients β1 and β2 capture, respectively, the effect of Spending ministers and \nPartisan fragmentation. A lagged dependent variable is included in all models to account \nfor the path dependence of fiscal performance (Davis et al. 1966), plus the controls \nindicated in the previous section. Unit fixed effects control for unobserved heterogeneity \ndue to country-specific unchanging features, T – 1 year effects control for common \nshocks and ε is an error term.13 \n \nI extend the above baseline model to test the set of interactive hypotheses that the effect \nof an increase in spending ministers on deficits (H2a) and public spending (H2b) is \nincreasing in the partisan fragmentation of the cabinet: \n \n\t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \n13 A potential problem of dynamic models with fixed effects is Nickell bias (Nickell 1981), but this is less \nof a concern when the number of time periods is twenty or more (Beck & Katz 2004: 15). Also, the Fisher \ntest did not indicate that it is problematic to assume stationarity (Maddala & Wu 1999). \n\t\r   22 \nFiscal outcomei,t = γ1(Spending ministersi,t) + γ2(Partisan fragmentationi,t) + \nγ3(Spending ministersi,t × Partisan fragmentationi,t) + \nγ4(Fiscal outcomei,t-1) + γ5(Controlsi,t) + Countryi + Yeart + εi,t \n \nThe only difference compared with the first regression equation is the inclusion of the \ninteraction term. The second equation can be used to identify the marginal effect of \nspending ministers at a given level of partisan fragmentation in the cabinet: \n \n∂(Fiscal outcomei,t) \/ ∂(Spending ministersi,t) = γ1 + γ3(Partisan fragmentationi,t) \n \nIn contrast to the coefficient β1 in the first (additive) model, the coefficient γ1 in the \nsecond (multiplicative or interactive) model represents the effect of a one-unit increase in \nspending ministers when partisan fragmentation is zero, that is, under single party \ncabinets. In the presence of partisan fragmentation, both γ1 and γ3 are required to \ncalculate the effect of adding a spending minister (Brambor et al. 2006; Kam & Franzese \n2007). I expect partisan fragmentation to augment the effect of an increase in the number \nof spending ministers. This suggests a positive sign for γ3 so that (γ1 + γ3) > γ1. \n \n[TABLE 2 ABOUT HERE] \n \nTable 2 reports the results. The columns are numbered in accordance with the relevant \nhypothesis. Columns (1a) and (1b) indicate that the number of spending ministers has a \nstrong direct impact on both deficits and public spending. The estimated effects of adding \n\t\r   23 \none spending minister are to increase the deficit and public spending by 0.116 and 0.074 \nper cent of GDP, respectively.14 The effect on deficits is significant at the 1 per cent \nlevel, while the effect on expenditures is significant at the 5 per cent level. The direct \neffects of partisan fragmentation, on the other hand, are indistinguishable from zero. With \nregard to the control variables, only GDP growth and trade openness have statistically \nsignificant effects on both of these fiscal aggregates. A one-unit increase in GDP growth \nreduces deficits and expenditures by 0.058 and 0.070 per cent of GDP, respectively, and a \none-unit increase in trade openness reduces both deficits and outlays by 0.024 per cent of \nGDP (see also Busemeyer 2009). Executive elections are associated with a deterioration \nof the deficit by almost half a percentage point of GDP. Although the estimated effect on \nspending is positive, it is smaller and does not achieve significance at conventional \nlevels. This suggests that the adverse effect of electioneering on the deficit is partly due \nto measures on the revenue side. Finally, a worsening in the quality of democracy by one \nunit, as measured by Freedom House, reduces expenditures by 0.355 per cent of GDP. \nOverall, these are strong results in support of the hypothesised link between the number \nof spending ministers and fiscal performance. \n \n\t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \n14 It is not appropriate to compare the exact size of the coefficients on Spending ministers with those \ndocumented in most previous studies, due to the use of different fiscal indicators with varying levels of \nconsolidation, as well as different operationalisations of the variable of interest. The Volkerink and De \nHaan (2001) study is most similar in these regards, but very different in terms of the diversity of the \nsample. Their estimated effect on the deficit of adding a spending minister is somewhat smaller: 0.08 per \ncent of GDP in the baseline model (p. 229). \n\t\r   24 \nI conducted several robustness checks. First, I added the number of lower house seats to \nmodels (1a) and (1b) to allow for the possibility that the common pool resource problem \nin the legislative arena contributes to fiscal performance. This did not substantively affect \nthe results and the coefficient on lower house seats was far from statistically significant in \nboth cases. As there is much less within-country variation in the number of seats in the \nlower house than in the number of spending ministers, this aspect could be explored \nfurther through cross-sectional analysis. Such an analysis should take into account \nbicameralism and the possibly distinct budgetary impact of second chambers (Heller \n1997, 2001; Bradbury & Crain 2001; Cusack & Fuchs 2003). Second, I checked whether \nthe effect of the number of spending ministers differs across forms of government, by \ninteracting this variable with a dummy for presidential systems (Persson & Tabellini \n2003). I also tested whether the effect differs according to level of development, using an \ninteraction with a dummy indicating OECD membership. In both cases, the interaction \nterms were far from statistically significant. In other words, I found no evidence that the \neffect of the number of spending ministers on deficits and expenditures differs \nsystematically between presidential and parliamentary regimes, or between the \nindustrialised democracies and other countries. I do not report these results here to \nconserve space, but they are available upon request. \n \nColumns (2a) and (2b) report results for the second set of hypotheses that the effect of the \nnumber of spending ministers on deficits and spending is increasing in the degree of \npartisan fragmentation of the cabinet. Since γ3 is positive, the estimates in columns (2a) \nand (2b) of Table 2 imply that the impact on the deficit and expenditures of adding a \n\t\r   25 \nspending minister to the cabinet increases as the partisan fragmentation of the cabinet \nrises. In column (2a), the t-value for the interaction term is 0.87 (p = 0.388) and in \ncolumn (2b) it is 1.85 (p = 0.069). As a robustness check, I excluded extreme cases of \npartisan fragmentation, that is, those with a value of 0.9 or higher, which weakened these \nresults. Overall, these findings do lend some support to the interactive hypotheses, \nespecially with regard to expenditures, but the evidence is not very strong.  \n \n[FIGURE 2 ABOUT HERE] \n \nGraphic exposition helps further interpretation of the marginal effect of spending \nministers on fiscal policy outcomes as partisan fragmentation changes. Figure 2 plots the \nconditional coefficients and standard errors for the entire sample range of Partisan \nfragmentation. For both dependent variables, the conditional coefficient on Spending \nministers is positive across the sample range of, and increasing in, Partisan \nfragmentation. With the deficit as the dependent variable, the coefficient is statistically \nsignificant at the 10 per cent level for all values of the conditioning variable. With \nspending as the dependent variable, the coefficient falls short of significance at the 10 per \ncent level when a single party forms the cabinet, as the coefficient on Spending ministers \nin column (2b) of Table 2 indicates. However, the coefficient is significant for most non-\nzero values of Partisan fragmentation. In sum, the fiscal effect of increasing the number \nof spending ministers is somewhat less pronounced in single party cabinets or those with \n\t\r   26 \nvery low levels of partisan fragmentation than in multi-party coalitions with high levels \nof partisan fragmentation.15 \n \n \nConclusions \n \nThis article has advanced the literature on fiscal performance in several ways. First, I give \nattention to the possible interaction between partisan fragmentation and the number of \nspending ministers. Second, I present evidence with a larger and more diverse sample \nthan any previous cross-national study of this topic. Finally, the operationalisations of the \nvariables of interest are carefully aligned with theoretical work, resulting in a new dataset \nof the number of spending ministers and partisan fragmentation. The empirical results \nimpressively confirm that the number of spending ministers affects fiscal performance. \nUsing an additive model, an extra spending minister is estimated to increase the deficit \nand expenditures of the central government by 0.116 and 0.074 per cent of GDP, \nrespectively. I also find some evidence that the marginal effect of spending ministers on \nexpenditures in particular is increasing in partisan fragmentation. The results suggest that \nsingle party cabinets may be able to mitigate, but not eliminate, fiscal illusion. \n \n\t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \t\r  \n15 Of course, it is equally possible to compute the marginal effect of Partisan fragmentation as Spending \nministers changes, but the theoretical discussion does not require this. \n\t\r   27 \nAn important question for further research is to explore exactly how parties may mitigate \nthe common pool resource problem in the cabinet. For instance, does it help if the finance \nminister has the same partisan affiliation as important spending ministers, such as those \nin charge of health or pensions? An answer to this question would require a more detailed \nlook at portfolio assignment in coalition governments. In-depth qualitative work may \noffer further clues. In terms of policy implications, my findings suggest that a reduction \nin the number of spending ministers is a promising strategy for fiscal consolidation, in \nparticular in countries with cabinets that are politically fragmented. However, to \nunderstand when this would be a feasible approach requires more work on the \ndeterminants of the number of spending ministers. A cursory glance at Figure 1 suggests \npossible determinants of cross-country variation, such as country size, but the causes of \nthe variation within countries are less obvious. Future research should also extend the \ncoverage of this database of spending ministers and partisan fragmentation in the cabinet. \nThese variables should be routinely included in empirical work on fiscal performance. \n\t\r   28 \nReferences \nAlesina, A. & Drazen, A. (1991). Why are stabilizations delayed? American Economic \nReview 81: 1170-1188. \nAlesina, A. & Perotti, R. (1996). Budget deficits and budget institutions. NBER Working \nPaper 5556. \nAlesina, A., Hausmann, R., Hommes, R. & Stein, E. (1999). Budget institutions and \nfiscal performance in Latin America. Journal of Development Economics 59(2): 253-273. \nAmorim Neto, O. (2006). The presidential calculus: Executive policy making and cabinet \nformation in the Americas. Comparative Political Studies 39(4): 415-440. \nAshworth, J. & Heyndels, B. (2005). Government fragmentation and budgetary policy in \n‘good’ and ‘bad’ times in Flemish municipalities. Economics and Politics 17(2): 245-\n263. \nBaqir, R. (2002). Districting and government overspending. Journal of Political Economy \n110(6): 1318-1354. \nBeck, N. (2001). Time-series-cross-section data: What have we learned in the past few \nyears? Annual Review of Political Science 4: 271-293. \nBeck, N. & Katz, J.N. (2004). Time-series-cross-section issues: Dynamics. Unpublished \nmanuscript, New York, New York University. \nBeck, T., Clarke, G., Groff, A., Keefer, P. & Walsh, P. (2001). New tools in comparative \npolitical economy: The Database of Political Institutions. World Bank Economic Review \n15(1): 165-176. \nBeetsma, R., Giuliodori, M. & Wierts, P. (2009). Planning to cheat: EU fiscal policy in \nreal time. Economic Policy 24(60): 753-804. \nBradbury, J.C. & Crain, M.W. (2001). Legislative organization and government \nspending: Cross-country evidence. Journal of Public Economics 82(3): 309-325. \n\t\r   29 \nBrambor, T., Clark, W.R. & Golder, M. (2006). Understanding interaction models: \nImproving empirical analyses. Political Analysis 14(1): 63-82. \nBrender, A. & Drazen, A. (2005). Political budget cycles in new versus established \ndemocracies. Journal of Monetary Economics 52(7): 1271-1295. \nBusemeyer, M.R. (2009). From myth to reality: Globalisation and public spending in \nOECD countries revisited. European Journal of Political Research 48(4): 455-482. \nCheibub, J.A. (2007). Presidentialism, parliamentarism, and democracy. New York: \nCambridge University Press. \nCusack, T.R. (1997). Partisan politics and public finance: Changes in public spending in \nthe industrialized democracies, 1955-1989. Public Choice 91(3-4): 375-395. \nCusack, T.R. & Fuchs, S. (2003). Parteien, Institutionen und Staatsausgaben. In Obinger, \nH., Wagschal, U. & Kittel, B. (eds), Politische Ökonomie: Demokratie und \nwirtschaftliche Leistungsfähigkeit. Opladen, Leske und Budrich: 321-354. \nDavis, O.A., Dempster, M.A.H. & Wildavsky, A. (1966). A theory of the budgetary \nprocess. American Political Science Review 60(3): 529-547. \nDruckman, J.N. & Warwick, P.V. (2005). The missing piece: Measuring portfolio \nsalience in Western European parliamentary democracies. European Journal of Political \nResearch 44(1): 17-42. \nDunleavy, P. (1991). Democracy, bureaucracy and public choice: Economic \nexplanations in political science. London: Prentice Hall. \nEuropa Publications Limited (various years). Europa World Yearbook. London, Europa \nPublications Limited. \nFiorino, N. & Ricciuti, R. (2007). Legislature size and government spending in Italian \nregions: Forecasting the effects of a reform. Public Choice 131: 117-125. \nFranzese, R.J. (2002). Electoral and partisan cycles in economic policies and outcomes. \nAnnual Review of Political Science 5: 369-421. \n\t\r   30 \nFranzese, R.J. (2008). Multiple policymakers: Veto actors bargaining in common pools. \nUnpublished manuscript, Ann Arbor MI, University of Michigan. \nGilligan, T.W. & Matsusaka, J.G. (2001). Fiscal policy, legislature size, and political \nparties: Evidence from state and local governments in the first half of the 20th century. \nNational Tax Journal 54(1): 57-82. \nHallerberg, M. & Marier, P. (2004). Executive authority, the personal vote, and budget \ndiscipline in Latin American and Caribbean countries. American Journal of Political \nScience 48(3): 571-587. \nHallerberg, M., Strauch, R. & Von Hagen, J. (2007). The design of fiscal rules and forms \nof governance in European Union countries. European Journal of Political Economy \n23(2): 338-359. \nHankla, C.R. (2006). Party strength and international trade: A cross-national analysis. \nComparative Political Studies 39(9): 1133-1156. \nHeller, W.B. (1997). Bicameralism and budget deficits: The effect of parliamentary \nstructure on government spending. Legislative Studies Quarterly 22(4): 485-516. \nHeller, W.B. (2001). Political denials: The policy effect of intercameral partisan \ndifferences in bicameral parliamentary systems. Journal of Law, Economics, and \nOrganization 17(1): 34-61. \nHoward, C. (1997). The hidden welfare state: Tax expenditures and social policy in the \nUnited States. Princeton, NJ: Princeton University Press. \nJensen, L., De Vries, J. & Wanna, J. (eds) (2003). Controlling public expenditure: The \nchanging roles of central budget agencies - better guardians? Cheltenham: Edward \nElgar. \nJochimsen, B. & Nuscheler, R. (2009). The political economy of the German Länder \ndeficits: Weak governments meet strong finance ministers. Applied Economics \n(forthcoming). \n\t\r   31 \nKam, C.D. & Franzese, R.J. (2007). Modeling and interpreting interactive hypotheses in \nregression analysis. Ann Arbor, MI: University of Michigan Press. \nKirchgässner, G. (2001). The effects of fiscal institutions on public finance: A survey of \nthe empirical evidence. CESifo Working Paper 617. Munich: CESifo. \nKraan, D.-J. (2004). Off-budget and tax expenditures. OECD Journal on Budgeting 4(1): \n121-142. \nLaakso, M. & Taagepera, R. (1979). ‘Effective’ number of parties: A measure with \napplication to West Europe. Comparative Political Studies 12(1): 3-27. \nMacDonald, L. (2008). The impact of government structure on local public expenditures. \nPublic Choice 136(3-4): 457-473. \nMaddala, G.S. & Wu, S. (1999). A comparative study of unit root tests with panel data \nand a new simple test. Oxford Bulletin of Economics and Statistics 61(S1): 631-652. \nNickell, S. (1981). Biases in dynamic models with fixed effects. Econometrica 49(6): \n1417-1426. \nNiskanen, W.A. (1971). Bureaucracy and representative government. Chicago: Aldine \nAtherton. \nOrganisation for Economic Co-operation and Development (1984). Tax expenditures: A \nreview of the issues and country practices. Paris: OECD. \nOrganisation for Economic Co-operation and Development (1996). Tax expenditures: \nRecent experiences. Paris: OECD. \nPerotti, R. & Kontopoulos, Y. (2002). Fragmented fiscal policy. Journal of Public \nEconomics 86(2): 191-222. \nPersson, T. & Tabellini, G.E. (2003). The economic effects of constitutions. Cambridge, \nMA: MIT Press. \n\t\r   32 \nPoterba, J.M. (1994). State responses to fiscal crises: The effects of budgetary institutions \nand politics. Journal of Political Economy 102(4): 799-821. \nRicciuti, R. (2004). Political fragmentation and fiscal outcomes. Public Choice 118(3): \n365-388. \nRoubini, N. & Sachs, J.D. (1989). Political and economic determinants of budget deficits \nin the industrial democracies. European Economic Review 33(5): 903-934. \nSarkees, M.R. (2000). The Correlates of War data on war: An update to 1997. Conflict \nManagement and Peace Science 18(1): 123-144. \nSchaltegger, C.A. & Feld, L.P. (2009). Do large cabinets favor large governments? \nEvidence on the fiscal commons problem for Swiss cantons. Journal of Public \nEconomics 93(1-2): 35-47. \nSchick, A. (2001). The changing role of the central budget office. OECD Journal on \nBudgeting 1(1): 9-26. \nStasavage, D. (2005). Democracy and education spending in Africa. American Journal of \nPolitical Science 49(2): 343-358. \nStein, E., Talvi, E. & Grisanti, A. (1998). Institutional arrangements and fiscal \nperformance: The Latin American experience. NBER Working Paper 6358. \nThies, M.F. (2001). Keeping tabs on partners: The logic of delegation in coalition \ngovernments. American Journal of Political Science 45(3): 580-598. \nTsebelis, G. (2002). Veto players: How political institutions work. Princeton, NJ: \nPrinceton University Press. \nTsebelis, G. & Chang, E.C.C. (2004). Veto players and the structure of budgets in \nadvanced industrialized countries. European Journal of Political Research 43(3): 449-\n476. \nVelasco, A. (2000). Debts and deficits with fragmented fiscal policymaking. Journal of \nPublic Economics 76: 105-125. \n\t\r   33 \nVerzichelli, L. (2008). Portfolio allocation. In Strøm, K., Müller, W.C. & Bergman, T. \n(eds), Cabinets and coalition bargaining: The democratic life cycle in Western Europe. \nOxford: Oxford University Press: 237-267. \nVolkerink, B. & De Haan, J. (2001). Fragmented government effects on fiscal policy: \nNew evidence. Public Choice 109(3-4): 221-242. \nVon Hagen, J. & Harden, I.J. (1995). Budget processes and commitment to fiscal \ndiscipline. European Economic Review 39: 771-779. \nWarwick, P.V. & Druckman, J.N. (2006). The portfolio allocation paradox: An \ninvestigation into the nature of a very strong but puzzling relationship. European Journal \nof Political Research 45(4): 635-665. \nWehner, J. (2010). Institutional constraints on profligate politicians: The conditional \neffect of partisan fragmentation on budget deficits. Comparative Political Studies 43(2). \nWeingast, B.R., Shepsle, K.A. & Johnsen, C. (1981). The political economy of benefits \nand costs: A neoclassical approach to distributive politics. Journal of Political Economy \n89(4): 642-664. \nWildavsky, A.B. (1975). Budgeting: A comparative theory of budgetary processes. \nBoston: Little Brown. \nWoo, J. (2003). Economic, political, and institutional determinants of public deficits. \nJournal of Public Economics 87: 387-426. \nWorld Bank (2007). World Development Indicators. Washington, DC: World Bank. \n\t\r   34 \nAppendix: Variable definitions and data sources \n \nDEFICIT: Central government budget deficit (if positive) or surplus (if negative), as a percentage of GDP. \nSource: Variable SPL in Persson and Tabellini (2003; corrected version dated June 2003) multiplied by -1. \nEU12: Dummy variable, equal to 1 for Austria, Belgium, Finland, France, Germany, Greece, Ireland, Italy, \nLuxembourg, the Netherlands, Portugal and Spain from 1992 onwards, zero otherwise. \nEXECUTIVE ELECTIONS: Dummy variable, equal to 1 in the year the executive is elected, zero \notherwise. Source: Persson and Tabellini (2003; corrected version dated June 2003). \nFREEDOM: Freedom House combined average scores, ranging from 1 (free) to 7 (not free). Source: \nwww.freedomhouse.org. \nGDP GROWTH: GDP growth (annual per cent). Source: World Bank (2007). \nINFLATION: Natural logarithm of consumer price inflation (annual per cent). Source: World Bank (2007). \nLEFT CHIEF EXECUTIVE: Dummy variable, equal to 1 if the head of government is from a political \nparty at the left of the ideological spectrum, zero otherwise. Sources: Author’s calculations based on the \nvariable EXECRLC in Beck et al. (2001; April 2008 update); missing data added on the basis of \ninformation from Europa Publications Limited (various years) and national sources. \nPARTISAN FRAGMENTATION: One minus the sum of the squared portfolio shares of the political \nparties in the cabinet. Independents are counted as single-member political parties. Sources: Author’s \ncalculations based on information in Europa Publications Limited (various years); missing data added on \nthe basis of information from Octavio Amorim Neto (personal correspondence) and national sources. \nSPENDING MINISTERS: All ministers with full cabinet rank minus (a) the chief executive (prime \nminister, president or chancellor) and her deputies, (b) finance ministers (including budget ministers, \nministers of the economy and the treasury) and attached ministers, as well as (c) any minister who is \ndirectly attached to the chief executive or who is subordinate to a portfolio for which a representative \nminister already exists. See text for further details. Source: Author’s calculations based on information in \nEuropa Publications Limited (various years). \nSPENDING: Central government expenditures as a percentage of GDP. Source: Variable CGEXP in \nPersson and Tabellini (2003; corrected version dated June 2003). \nTRADE OPENNESS: Sum of exports and imports of goods and services measured as a share of GDP. \nSource: Variable TRADE in Persson and Tabellini (2003; corrected version dated June 2003). \nWAR: Dummy variable, equal to 1 for each year in which a country participates in inter-, extra- or intra-\nstate war as defined by the Correlates of War Project, zero otherwise. Source: Sarkees (2000). \n\t\r   35 \nFigure 1: The number of spending ministers in 58 countries, 1975-1998 \n \n0 5 10 15 20 25 30\nNumber of spending ministers\nAustralia\nPapua New Guinea\nSri Lanka\nCanada\nItaly\nUnited Kingdom\nMalaysia\nPhilippines\nMauritius\nJapan\nDenmark\nBrazil\nNew Zealand\nMexico\nGreece\nNorway\nFrance\nChile\nVenezuela\nTurkey\nIndia\nGermany\nCosta Rica\nSweden\nSpain\nPortugal\nBolivia\nPeru\nNicaragua\nUnited States\nIreland\nEl Salvador\nDominican Republic\nColombia\nBelgium\nAustria\nFinland\nThailand\nNetherlands\nHonduras\nFiji\nGuatemala\nUruguay\nNepal\nMalta\nGambia\nEcuador\nBahamas\nCyprus\nParaguay\nBotswana\nBelize\nBarbados\nSt. Vincent and the Grenadines\nIceland\nArgentina\nLuxembourg\nSwitzerland\n \nNotes: Only observations where Freedom ≤ 5.5 \nare included. The dashed line indicates the \npooled sample median (13). N = 1358. \t\r  \n\t\r   36 \nFigure 2: The conditional marginal effect of spending ministers \n \n0\n.1\n.2\n.3\nM\na\nrg\nin\na\nl \ne\nff\ne\nc\nt \no\nf \ns\np\ne\nn\nd\nin\ng\n m\nin\nis\nte\nrs\n0 .1 .2 .3 .4 .5 .6 .7 .8 .9 1\nPartisan fragmentation\nA. Dependent variable: Central government deficit (as per cent of GDP)\n \n0\n.1\n.2\n.3\nM\na\nrg\nin\na\nl \ne\nff\ne\nc\nt \no\nf \ns\np\ne\nn\nd\nin\ng\n m\nin\nis\nte\nrs\n0 .1 .2 .3 .4 .5 .6 .7 .8 .9 1\nPartisan fragmentation\nB. Dependent variable: Central government spending (as per cent of GDP)\n \nNotes: The dashed lines indicate 90% confidence intervals. The marginal \neffects and standard errors in panels A and B are calculated, respectively, \non the basis of models (2a) and (2b) in Table 2. \t\r  \n\t\r   37 \nTable 1: Summary statistics \n \nVariable Obs Mean Std. Dev. Min Max \nDeficit 1235 3.409 4.398 -22.631 24.450 \nEU12 1362 0.062 0.241 0 1 \nExecutive elections 1359 0.239 0.427 0 1 \nFreedom 1362 2.193 1.275 1.000 5.500 \nGDP growth 1352 3.417 4.009 -26.479 26.139 \nInflation 1343 2.170 1.362 -4.074 9.372 \nLeft chief executive 1262 0.312 0.464 0 1 \nPartisan fragmentation 1310 0.217 0.300 0.000 0.949 \nSpending 1307 27.681 11.049 8.087 67.702 \nSpending ministers 1358 13.898 4.789 5.000 28.000 \nTrade openness 1334 69.490 39.494 8.868 208.643 \nWar 1362 0.095 0.294 0 1 \nNote: Only observations where Freedom ≤ 5.5 are included. \t\r  \n\t\r   38 \nTable 2: Results \n \n (1a) (1b) (2a) (2b) \n Deficit Spending Deficit Spending \nSpending ministers 0.116 0.074 0.095 0.033 \n (0.042)*** (0.032)** (0.044)** (0.030) \nPartisan fragmentation -0.037 0.749 -0.990 -1.072 \n (0.366) (0.538) (1.055) (1.061) \nSpending ministers × Partisan fragmentation   0.066 0.126 \n   (0.076) (0.068)* \nLagged deficit 0.622  0.621  \n (0.063)***  (0.063)***  \nLagged spending  0.692  0.688 \n  (0.045)***  (0.044)*** \nExecutive elections 0.481 0.160 0.478 0.153 \n (0.166)*** (0.154) (0.165)*** (0.155) \nLeft chief executive 0.260 0.291 0.265 0.297 \n (0.276) (0.329) (0.279) (0.329) \nFreedom -0.238 -0.355 -0.228 -0.337 \n (0.183) (0.147)** (0.181) (0.149)** \nEU12 -0.304 -0.158 -0.298 -0.139 \n (0.518) (0.512) (0.514) (0.511) \nGDP growth -0.058 -0.070 -0.058 -0.070 \n (0.029)* (0.031)** (0.029)* (0.030)** \nInflation -0.024 0.030 -0.025 0.025 \n (0.086) (0.140) (0.085) (0.138) \nTrade openness -0.024 -0.024 -0.024 -0.025 \n (0.009)** (0.010)** (0.009)** (0.010)** \nWar 0.702 0.236 0.715 0.257 \n (0.547) (0.480) (0.553) (0.479) \nObservations 1058 1120 1058 1120 \nNumber of countries 58 58 58 58 \nCountry effects Yes Yes Yes Yes \nYear effects Yes Yes Yes Yes \nAdjusted R-squared (within) 0.48 0.60 0.48 0.60 \nNotes: Standard errors clustered by country are in parentheses. Only observations where Freedom ≤ 5.5 are \nincluded. Refer to the appendix for variable definitions and sources. \n* Significant at 10%; ** significant at 5%; *** significant at 1% (two-tailed). \t\r  \n \n"}