{"doi":"10.1145\/1930488.1930504","coreId":"52615","oai":"oai:eprints.lincoln.ac.uk:3436","identifiers":["oai:eprints.lincoln.ac.uk:3436","10.1145\/1930488.1930504"],"title":"Emergence and playfulness in social games","authors":["Kirman, Ben"],"enrichments":{"references":[{"id":18428640,"title":"21 st Century Game Design,","authors":[],"date":"2006","doi":null,"raw":"Bateman, C. and Boon, R. 2006. 21 st Century Game Design, Charles River Media","cites":null},{"id":18428639,"title":"AppData Facebook Application Metrics,","authors":[],"date":null,"doi":null,"raw":"AppData Facebook Application Metrics, www.appdata.com","cites":null},{"id":18428653,"title":"Archive, Community Rules,","authors":[],"date":"2010","doi":null,"raw":"Speed Demos Archive, Community Rules, Accessed April 2010: http:\/\/speeddemosarchive.com\/lang\/rules_en.html","cites":null},{"id":18428648,"title":"Electronic Arts Buys Playfish, a Social Games Start-Up.","authors":[],"date":"2009","doi":null,"raw":"Miller, C C. and Stone, B. 2009. Electronic Arts Buys Playfish, a Social Games Start-Up. New York Times November 9 th 2009, New York","cites":null},{"id":18428651,"title":"Facebook Applications and playful mood: the construction of Facebook as a “third place”. MindTrek","authors":[],"date":"2008","doi":"10.1145\/1457199.1457202","raw":"Rao, V. 2008. Facebook Applications and playful mood: the construction of Facebook as a “third place”. MindTrek 2008, Tampere, Finland","cites":null},{"id":18428644,"title":"Farm Town Report,","authors":[],"date":"2010","doi":null,"raw":"Developer Analytics, Farm Town Report, April 2010 http:\/\/www.developeranalytics.com\/app.php?id=56748925791","cites":null},{"id":18428646,"title":"Game Design for Social Networks, Accessed","authors":[],"date":"2009","doi":"10.1145\/1581073.1581088","raw":"Järvinen, A. 2009. Game Design for Social Networks, Accessed april 2010: http:\/\/www.mygamestudies.com\/content\/game-design-socialnetworks-part-1","cites":null},{"id":18428647,"title":"Hardcore Classification: identifying play styles in social games using network analysis.","authors":[],"date":"2009","doi":"10.1007\/978-3-642-04052-8_28","raw":"Kirman, B and Lawson, S. 2009. Hardcore Classification: identifying play styles in social games using network analysis. Lecture notes in Computer Science 5709, Springer","cites":null},{"id":18428650,"title":"Nethack Voluntary Challenges,","authors":[],"date":"2010","doi":null,"raw":"Nethack Voluntary Challenges, Accessed April 2010: http:\/\/www.steelypips.org\/nethack\/conduct.html","cites":null},{"id":18428652,"title":"Rules of Play: Game Design Fundamentals,","authors":[],"date":"2004","doi":"10.1162\/leon.2004.37.5.414","raw":"Salen, K. and Zimmerman, E. 2004. Rules of Play: Game Design Fundamentals, MIT Press","cites":null},{"id":18428645,"title":"Simulation versus Narrative. The Game Theory Reader,","authors":[],"date":"2003","doi":null,"raw":"Frasca, G. 2003. Simulation versus Narrative. The Game Theory Reader, Routledge","cites":null},{"id":18428643,"title":"Study: 21 Percent of Gamers Aware of FarmVille Play it Daily, Gama Sutre, online: http:\/\/www.gamasutra.com\/view\/news\/28322\/Study_21_Perc ent_Of_Gamers_Aware_Of_FarmVille_Play_It_Daily.php","authors":[],"date":"2010","doi":null,"raw":"Caoili, E. 2010. Study: 21 Percent of Gamers Aware of FarmVille Play it Daily, Gama Sutre, online: http:\/\/www.gamasutra.com\/view\/news\/28322\/Study_21_Perc ent_Of_Gamers_Aware_Of_FarmVille_Play_It_Daily.php","cites":null},{"id":18428641,"title":"The Anarchy of Paidia, accessed 4\/2010: http:\/\/onlyagame.typepad.com\/only_a_game\/2005\/12\/the_an archy_of__1.html","authors":[],"date":"2005","doi":null,"raw":"Bateman, C. 2005. The Anarchy of Paidia, accessed 4\/2010: http:\/\/onlyagame.typepad.com\/only_a_game\/2005\/12\/the_an archy_of__1.html","cites":null},{"id":18428642,"title":"The PASION Project: Psychologically Augmented Social Interaction over Networks,","authors":[],"date":"2006","doi":null,"raw":"Brugnoli, M.C., Morabito, F., Walker, R. and Davide, F. 2006. The PASION Project: Psychologically Augmented Social Interaction over Networks, PsychNology 4:1","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-10-06","abstract":"Social Games, built and played on social networks such as Facebook, have rapidly become a major force in the world of game development, and the top social games today claim more players than any other online game on any format.\\ud\nAs social games begin to mature from their roots as simple playful social toys and into the products of big business, the patterns and mechanics used in the design have begun to be formalised. \\ud\nIn this paper, it is argued that experimentation and playfulness is still a very important part of the play experience and a valuable source of fun. As game designs explore the space opened by the new genre of social games, it is vital for designers to leave “gaps” in the design to allow for playful and serendipitous experiences to emerge from the activities of the players.\\ud\nTo support this argument, Caillois’ classification of play is used as a lens through which social games can be examined. Examples of paidic, playful and emergent play are presented from popular social and offline games, and a detailed case study of paidic play in a new social game is presented from the designer’s perspective. Interviews from participants to an open trial are discussed, and their experiences in creating their own playful experiences and goals within the formal structure of the social game design are explored","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/52615.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/3436\/1\/pasionfruit_cameraready_postprint.pdf","pdfHashValue":"123d0b442b602520105ff589a136c18870cd3213","publisher":"ACM Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:3436<\/identifier><datestamp>\n      2013-03-13T08:48:27Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F47:6A6163735F47343430<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/3436\/<\/dc:relation><dc:title>\n        Emergence and playfulness in social games<\/dc:title><dc:creator>\n        Kirman, Ben<\/dc:creator><dc:subject>\n        G440 Human-computer Interaction<\/dc:subject><dc:description>\n        Social Games, built and played on social networks such as Facebook, have rapidly become a major force in the world of game development, and the top social games today claim more players than any other online game on any format.\\ud\nAs social games begin to mature from their roots as simple playful social toys and into the products of big business, the patterns and mechanics used in the design have begun to be formalised. \\ud\nIn this paper, it is argued that experimentation and playfulness is still a very important part of the play experience and a valuable source of fun. As game designs explore the space opened by the new genre of social games, it is vital for designers to leave “gaps” in the design to allow for playful and serendipitous experiences to emerge from the activities of the players.\\ud\nTo support this argument, Caillois’ classification of play is used as a lens through which social games can be examined. Examples of paidic, playful and emergent play are presented from popular social and offline games, and a detailed case study of paidic play in a new social game is presented from the designer’s perspective. Interviews from participants to an open trial are discussed, and their experiences in creating their own playful experiences and goals within the formal structure of the social game design are explored.<\/dc:description><dc:publisher>\n        ACM Press<\/dc:publisher><dc:date>\n        2010-10-06<\/dc:date><dc:type>\n        Conference or Workshop contribution<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/3436\/1\/pasionfruit_cameraready_postprint.pdf<\/dc:identifier><dc:identifier>\n          Kirman, Ben  (2010) Emergence and playfulness in social games.  In: MindTrek 2010, 6th October - 8th October 2010, Tampere, Finland.  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1145\/1930488.1930504<\/dc:relation><dc:relation>\n        10.1145\/1930488.1930504<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/3436\/","http:\/\/dx.doi.org\/10.1145\/1930488.1930504","10.1145\/1930488.1930504"],"year":2010,"topics":["G440 Human-computer Interaction"],"subject":["Conference or Workshop contribution","PeerReviewed"],"fullText":"Emergence and Playfulness in Social Games  \nBen Kirman \nLincoln Social Computing Research Centre \nUniversity of Lincoln, LN6 7TS, UK \n+44 (0)1522837083 \nbkirman@lincoln.ac.uk \nABSTRACT \nSocial Games, built and played on social networks such as \nFacebook, have rapidly become a major force in the world of \ngame development, and the top social games today claim more \nplayers than any other online game on any format. \nAs social games begin to mature from their roots as simple playful \nsocial toys and into the products of big business, the patterns and \nmechanics used in the design have begun to be formalised.  \nIn this paper, it is argued that experimentation and playfulness is \nstill a very important part of the play experience and a valuable \nsource of fun. As game designs explore the space opened by the \nnew genre of social games, it is vital for designers to leave “gaps” \nin the design to allow for playful and serendipitous experiences to \nemerge from the activities of the players. \nTo support this argument, Caillois’ classification of play is used \nas a lens through which social games can be examined. Examples \nof paidic, playful and emergent play are presented from popular \nsocial and offline games, and a detailed case study of paidic play \nin a new social game is presented from the designer’s perspective. \nInterviews from participants to an open trial are discussed, and \ntheir experiences in creating their own playful experiences and \ngoals within the formal structure of the social game design are \nexplored.  \nKeywords \nSocial Games, Game Design, Paidia, Playfulness, Ludology \n1. INTRODUCTION \nSocial Games, popularly defined as games played on and around \nonline social networks, have had a meteoric rise in popularity \nsince the genre was effectively created in 2007.  \nThe most popular, Farmville had just over 77 million unique \nplayers in April 2010 [7] and other top social games count their \nplayers in the tens of millions. The stereotypical views of game \nplayers as being mostly adolescent males interested only in \nshooting games has become profoundly challenged. According to \nrecent research [6], the average FarmVille player is 31 (33% over \n35) and equally likely to be female as male (51%\/49% \nrespectively). \nAs the audience for social games grows, the need to purposefully \ndesign game experiences that appeal to this particular type of \ngamer has become important. The huge success of the top few \ngames have led to a succession of copycat games trying similar \nideas with new mechanical tweaks. The academic field of Games \nStudies is still trying to catch up and understand what these social \ngames are and how gamers behave differently while playing (e.g., \n[11]).  \nOver their short evolution, Social games as a sub-genre of online \ngames have become rather more formalised. In their origin they \nwere built around the social network, as a purely playful tool to \nenhance your social experience with friends on the social network \n[14]. However, now the most popular applications are now full-\nfledged game “experiences” with vast amounts of content and \nhours of playtime that perhaps have more in common with \ntraditional computer games than their social forebears - for some \nplayers the current games may have more value than the social \nnetwork itself. \nRather than being developed by small teams of “bedroom” \nprogrammers, now social games are big business, with major \nplayers such as Zynga and EA\/Playfish [12]. \nThe design of games could be in danger of becoming \nhomogenized as designers try to duplicate the success of the first \n“huge” social games like Mafia Wars and Farmville by using \nsimilar mechanics on a smaller budget. The game experiences \nbecome simplified in order to appeal to the new demographics, \nthat may not have been exposed to a lot of games before, and as \nsuch may not be “game literate” or be able to immediately \nrecognise traditional patterns and structures used in games design \nfor other platforms. \nHowever, despite the new opportunities and challenges created by \nthe developing genre of social games, some important ideas about \ngame design theory, that were first proposed before the invention \nof Pong, remain just as relevant today. \n2. THE IMPORTANCE OF PAIDIA (or \nPLAYFULNESS) \nIn the seminal work Man, Play and Games [5], the sociologist \nRoger Caillois described all forms of play, including games, as \nbeing positioned on an axis between two extreme points: Paidia \nand Ludus. He described the concept of Paidia as “a primary \npower of improvisation and joy” compared to its polar opposite, \nLudus, for play heavily defined by strict rules, which is defined by \n“a taste for gratuitous difficulty”. Every game conceptually sits at \nsome point on the scale, depending on how much of the \nexperience is driven by a formal system of rules. \nMan, Play and Games was written long before digital games \nbecame popular, but still applies just as well in both the analogue \nand digital worlds. When thinking about playfulness in all kinds \nof games, it is very helpful in thinking about the types of play \nencouraged and enforced by the game design. Caillois’ \nclassifications of play simply serve as a lens through which we \ncan analyse play. \nUsing examples from “traditional” console games to illustrate \nthese concepts, The Guitar Hero and Rock Band series’ of games \nare examples of play that is further towards the ludic end of \nCaillois’ conceptual scale. In these games, you either succeed in \nfollowing the instructions of the game as best you can, or you fail. \nThere is no room for individual interpretation or play within the \nrules as imposed by the games. The rules can’t be bent and there \nare little to no meaningful choices offered to the players. In the \nwords of Gonzalo Frasca, “Clearly defined goals do not generally \nleave much room neither for doubts nor for contesting that \nparticular objective”[9] This does not mean the games aren’t fun, \nwhich they evidently are, but that the source of that fun is not the \nsame as it is in other games that rely less on Ludus. \nIn non-electronic games, such as those found on every decent \nschoolyard, play that is at the Paidic end of the scale are supported \nnatively because the rules are highly flexible and defined largely \nsocially. However, when games are mediated by computer \nsystems, the inflexible way the systems are built means there are \nfew such “holes” that allow rules to be bent and adjusted on-the-\nfly.  \nAt this end of the scale, Grand Theft Auto, The Sims and other \n“sandbox” games can be found since they are designed to be more \nfreeform play experiences, where players are allowed, or even \nencouraged, to explore the environment and find their own source \nof amusement. \nIn the words of Caillois, \n“[Paidia] covers spontaneous manifestations of the play \ninstinct: a cat in a ball of wool, a dog sniffing, and an infant \nlaughing at rattle represent the first identifiably examples of \nthis type of activity” \nThe noted game designer Chris Bateman interprets Paidia as the \n“anarchic nebula from which all play originates” [3] and argues \nthat the first moments of playing any new game are highly \nplayful, until the user learns the ludic rules of the game and falls \ninto the structured patterns of play [2]. \nHowever, it is important to note that Paidia is not just found in \ngames that are designed specifically to allow for this form of play. \nJust about every game supports paidic play in some form (even if \nit is just using the game disc as a Frisbee!), but through design \nchoices, some games support this style of play more explicitly.  \n2.1 The Freedom to Fail \nA lot of games give the illusion of freedom, but the formal \nstructure of “how the game should be played” only allows \nfreedom within these carefully constrained limits.  \nTrue freedom in design gives the players the opportunity to \nwilfully fail at the task they have been given. By giving the player \nfreedom to do this, they can generate their own goals that are not \ndependent on playing within the constraints of the “normal” way a \ngame is played. \nSalen and Zimmerman call this freedom for explorative play a \nform of “emergence” in a design [15], something that must be \nallowed for within the formal game design and possibly enabled \nby tools as channels for sharing newly discovered opportunities \nfor play between players. \n“One of the sweetest pleasures as a game designer is seeing \nyour game played in ways that you did not anticipate” (p540) \nAs a contrary example, in Rock Band, a group of players may \ndecide they wish to play their own version of a song, only \nincluding the lead guitar at some sections, and giving more room \nfor extended drum solos where they don’t exist in the original \nsong. If they tried this, when the game detects the lead guitarist is \nnot playing notes where they should, it would interpret the \nplayfulness as “failure” and cut the game short. This would then \ndeprive the players the chance to enjoy their self-directed paidic \nexperience. \nGrand Theft Auto (GTA) is an example of a large commercial \ngame that gives players the freedom to fail and therefore far more \nfreedom over their experience of the game. In the original game \nreleased in 1997, the players only had a limited number of lives, \nand when the player died too often, the game would end in failure. \nIn the sequels, the game’s designers have learnt that the player has \nthe “right” to die, and to die as often as they please (e.g. by \nrepeatedly throwing themselves off the top of the tallest buildings \nin the game-world just because it sounds funny when the avatar \nhits the pavement). This gives players the freedom to create their \nown fun experiences within the game, without fear of intervention \nby the game design. The Grand Theft Auto series is not without \ncriticism on this point, however. For example, in all of the \niterations of the game, players are punished for not following \nstory points by being denied access to the complete game world. \nLarge swathes of game world ripe for exploratory, paidic and \nemergent play are hidden until the player operates the game \n“correctly” by playing through a series of linear and controlled \nmissions as part of the story arc. \nThese examples of paidia and ludus are taken from popular \nconsole games, however it is very important to stress that paidia \nand playfulness are present in all kinds of games, regardless of \nplatform. \n2.2 Freedom is not Necessarily Design \nComplexity \nWhen talking about game design using terms like “player \nfreedom”, the implication is that the game design must therefore \nbecome much more complicated in order to allow paidic or \nplayful behaviour. As Bateman says, the approach taken by the \nGTA developers to add more and more opportunities for paidia in \ntheir complex environments can be “devastatingly expensive” [3]. \nHowever (as Bateman acknowledges), this is not always the case. \nAlthough it can be argued that the type of player who enjoys \npaidic experiences would also enjoy exploring and messing \naround in a large, open and highly detailed virtual world (that has \ncost many thousands of man-hours to develop), it is short-sighted \nto view that as a requirement for that kind of playful fun to occur. \nIn actual fact, all that is required is a lack of barriers. It is still \nprobably a good and solid design idea to guide new players along \nthe conceptual footpath or “vector” of normal play, to make sure \nthey understand the designed goals of the game and how to \nachieve formal rewards. However, the players should be allowed \nto stray from the path if they wish, and do so without fear of \npunishment by the game (either formally or socially). \nIt is these “design gaps” that give players the ability to create fun, \nespecially in social and multiplayer games, rather than having the \n“fun” predetermined, regardless of whether the game is a simple \nplayground game, a multi-million dollar console title or even a \nsimple web-based social game. \n2.3 Freedom does not Necessarily Make the \nGame Easy \nAnother assumption that can be made, is that paidic play is easy, \ncheating, or somehow a “way out” of the perceived challenge of a \ngame. While this is strictly true, it should be regarded as a positive \neffect - the freedom of paidic play can also quickly lead players to \ndevelop new systems of rules in order to create challenges even \ngreater than those posed by the formal system of the game itself. \nFor example, consider the emergence of “speedruns” [16]. In this \nactivity, a player chooses to try and complete a game, or section \nof a game, as quickly and flawlessly as possible. Although this \nform of play is not implied by the game rules, it has emerged as a \nway to demonstrate skill far above and beyond what is required to \nwin the game “formally” within the usual parameters since it \nrequires superb timing and memorisation skills. Since emerging as \na paidic activity played around game rules, the speedrun \ncommunity has since developed its own formal rule system to \nallow competition, itself becoming a more ludic activity as time \nprogressed. \nOther examples of players subverting the rules of games to make \nthings purposefully more difficult can be found for many games. \nIn the famously difficult Nethack, a fiendishly hard dungeon \ncrawling game, some players make the game even more difficult \nby choosing to play as strictly vegetarian, vegan or even pacifist \ncharacters [13]. \n3. PLAYFULNESS IN SOCIAL GAMES \nAs far as game design complexity goes, it is fair to consider that \nthe new breed of social games lie on the simpler side. Since they \nare nearly always web-based, the graphics and interactions are \nlimited to what is workable on the typical web browser. As the \ndemographics of the average player shifts away from those who \nmay have high literacy of games, game mechanics and their own \nhigh-powered dedicated gaming machines; and toward people \nwho, for example, may play on restricted or underpowered \nmachines used for playing during lunch hour in the office; there \nare limits to complexity of designs (both graphically and \nconceptually) that can become popular in this context. \nDespite these limitations, some games have been designed, either \npurposefully or by accident, with low barriers to non-linear play. \nGiving the players tools to create their own experiences within the \n(even limited) game world has allowed players to engage in their \nown paidic and playful experiences. \n3.1 Creative Agriculture in Farm Town \nFarm Town [8] is one of a range of popular farming themed \ngames found on Facebook. In these games, players own a farm, \nand must maintain both the business and the finer details of arable \nand pastoral farming. This includes buying land and animal feed, \nplanting crops and harvesting them for profit when the time is \nright. Farm Town has nearly 9 million unique players each month \n[7]. One of the key mechanics of Farm Town is that each user has \na particular amount of virtual land on which they can build their \nfarm, and the player has complete control over where fields, \nbuildings and pastures are placed within this virtual space. The \nlocation of crops has no direct impact on the player’s ability to be \na successful farmer (e.g. crops are no less likely to produce a \nharvest if very far away from the farm buildings) so this control \nhas no direct in-game impact. \nThe logical and mathematically rational strategy would be to \nplace the elements of the farm in an arbitrary fashion based on the \norder of construction, and the developers would have been \nforgiven if this had been an automatic feature, however, some \nplayers have taken this “gap” as an opportunity to show their \ncreativity while playing the game. \nFigure 1 shows several examples of how players have contrived to \narrange their farms specifically for aesthetic or artistic purposes. \nThe examples show a map of the world, a reconstruction of tile \npatterns taken from the mosaics at the Alhambra in Granada, the \n \n \n \n \nFigure 1 - Creative Agriculture in Farm Town \n \n \n \n \n \n \n \n \n \nlikeness of Elvis and finally a maze based on the 18th century \ngarden mazes found at palaces and stately homes such as Tatton \nPark and Hampton Court in England. Players have formed groups \nwithin Facebook in order to share hundreds of their creations with \none another, sharing tips and techniques for how to use the tools \nof the game to create various effects1. The maze is of particular \ninterest, the creator reports: \n“[the maze] actually works – the avatar makes its way to the \ncentre of the maze if you click by the cone hedge “ \nThe maze creator has taken advantage of the fact that the software \nimplements a pathfinding algorithm for avatars within the game, \nto allow them to automatically walk between any two locations on \na farm based on mouse clicks by the user. Although they may not \nbe aware of the technical details of the pathfinding algorithm, they \nhave devised mazes as a way of “testing” its efficiency at finding \nthe shortest paths. Therefore the original design choice made by \nthe developers to use a pathfinding algorithm to determine avatar \nmovement (instead of, say, just direct control using the cursor \nkeys) has led to another serendipitous form of fun that has \nemerged through paidic play by some of the users. \n                                                                  \n1 E.g. http:\/\/www.facebook.com\/#!\/group.php?gid=91934065717 \nFarm Town is just one example of games that allow the possibility \nto create such “pixel art” from the building blocks provided in the \ngame. The key point for these games that allow this particular \nform of play is the provision of virtual space that allows players \ncontrol over individual graphical elements. Farms, villages and \nnight clubs (as seen in other games) could have easily been \nrepresented by a simple list of buildings and items, but the simple \nvirtual grid allows for exciting creativity and play generated by \nthe players themselves. This is an example of a “design gap” \nwhere the players have enough freedom to express their own \nplayful nature despite there being no direct benefit to them in the \nformal game structure, such as gaining points or rewards. \n3.2 Restrictive Social Games \nFarm Town, FarmVille, and other games that have these “design \ngaps” are popular, but there unfortunately the majority of social \ngames appear to be highly restrictive. In other words, the high \nbarriers that guide players along their game experience can be \nalmost impossible to overcome. Players are forced to play along \nwith the strict narrative path of the game and are unable to create \ntheir own playful experiences for themselves. \nGames like Mafia Wars, Vampires, West Wars and many others \nare driven by one major form of interaction - semi-random \n“missions” that must be completed by repeatedly clicking the \nsame button again and again. The descriptions and rich game \nnarrative of the missions change over time but the actual player \nactivity remains the same – clicking a button. There is no \ncapability for players to escape out of this design loop, and \ntherefore no “design gaps” that allow for playfulness as paidia to \nappear. \nAlthough these games have been criticized and parodied (e.g. \nFigure 3) for their simple and repetitive nature, it is very \nimportant to note that these games are still fun for millions of \nusers. The narrative is strong enough that it does not matter to the \nplayers that there is low depth of interactivity. This form of \nstructured play and enjoyment is perfectly valid (and should not \nbe treated dismissively), however in Caillois’ classifications these \ngames sit very far on the side of ludus and are presented as \ncontrast to other games presented here since they offer little to no \noptions for paidic play. \n4. EMERGENCE BY ACCIDENT: PASION \nFRUIT \nEmergence and playfulness in social games clearly happens, but it \nis unclear about the role of the game designer in creating or \nenabling these behaviours. In order to explore this, we present an \nexample of paidia and playfulness that emerged in one of the \nauthors’ games. In particular how unintentional “design gaps” led \nto emergence, and how this was observed in real time across a \ncomplete player-base.  \nAs part of our own research into mediated social communication \n[4], a social game was developed to study interactions in games \ndeployed on social networks such as Facebook. It was deployed \nonline (at www.pasionfruit.eu) and interactions recorded during \nan 11-week formal public trial. The research questions that \nPASION Fruit was designed to answer were based around group \ncooperation within online games. \nThe core theme of PASION Fruit is environmental sustainability. \nEach player, upon registering to play the game, is asked to choose \na real location for his or her garden. This is provided either by \naddress\/postal code or by clicking a location on an interactive \n \n \nFigure 3 - Mafia Wars and parody Progress Quest; Simple \ninteractions with rich game narratives \n \nmap. PASION Fruit is hosted on its own private webserver, \nhowever through the service “Facebook Connect” it is able to \nconnect to players’ social networks on Facebook. \nInitially, each garden contains five fruit trees of the same type, \ndepending on the country in which the garden is found. For \nexample, gardens planted in the UK will grow one of Apples, \nPears or Strawberries natively. Gardens in Italy will grow \nLemons, Grapes or Olives. There are twenty different types of \nfruit represented in the game, and the relationship between fruit \ntypes and countries were defined manually by the designer. \nThe formal goal of the game is to gain points based on the \ndiversity of fruit types within your garden, however this is \nbalanced against the environmental cost of transporting fruits long \ndistances. Since each country only grows a certain subset of fruits \nnatively, in order to be successful players are forced to transport \nmore exotic fruit from distant locations and pay an environmental \ncost represented by CO2 expenditure. \nA main feature of the design is that players don’t get to choose \nwhat fruit they plant in their garden – they can only receive gifts \nof fruit trees from other players. They can request types of fruit \nusing the comments\/messaging system within the game, but \nwhether the other player will send the desired fruit or not is \nunknown. Secondly, the player sending the gift bears the entire \ncost of CO2 emissions generated by sending the fruit the distance \nbetween the two gardens. Therefore, when sending a gift of one of \nyour valuable fruit trees to another player, you not only lose the \ntree itself, but you lose the points it contributed towards your own \ngarden’s diversity, you pay the environmental cost (and therefore \ncost in score) to send it however far it must travel, and get no \ndirect benefit from your act.  \nPASION Fruit provides a wealth of social history tools for players \nto be able to see the past behaviour of other players, to help them \nmake informed decisions about who to send gifts to – do they \nneed this kind of fruit? Are they likely to return a gift? Do they \nhave a type of fruit I need? Will they be willing to lose it? \nAn abstract score is generated in real-time for each player based \non the diversity of their garden, and the amount of CO2 emissions \nthey have generated as a result of gifts they have sent. This score \nis then ranked against others in a high score table so players can \nsee how they are performing. \n4.1 Public Trial \nPASION Fruit was opened to the public in a trial lasting 11 \nweeks, starting in mid-February 2010. Initially, a handful of \nparticipants were recruited in Italy and the UK and asked to play \nthe game. Since registration was publicly open, and the game \nintegrated with the social network Facebook, the player-base was \npermitted to grow as a natural viral or snowballing effect as would \nbe experienced by a typical social game on the site. By the end of \nthe trial, there were 99 active users who had between them \ngenerated 3922 gifts of fruit between one another. \nAlthough the trial had gathered the data necessary for the separate \nresearch on the social behaviour of game players, unusual \nbehaviour had also been noticed in the game that didn’t fit the \nprofile of what was expected. \nThe introduction to the game had a clear tutorial, and the game \nmechanics were fairly straightforward, so some behaviours within \nthe game were surprising. In particular some players had \noutrageously large CO2 expenditure, and therefore very low (even \nnegative) scores. In order to learn more, a qualitative \nquestionnaire was sent to all participants asking for them to \nexplain how they had played the game. 30 responses were \nreceived from players. \n4.2 Self-Directed Goals and Playfulness in \nPASION Fruit \nAs stated earlier, PASION Fruit was designed specifically to \nanswer research questions about group cooperation in online \ngames. However, while running the trial it quickly became clear \nthat the players were not simply playing the game as designed, but \nbreaking out of our carefully designed experience to create their \nown fun. \nAccording to the responses to the questionnaire, there appears for \na subset of PASION Fruit players to be an alternative goal, not \nrelated to score. \nSince the game had 20 different types of fruit, and the players had \nspace for 20 trees in their gardens, some players created an \ninformal challenge to have all 20 types of fruit in their garden at \nany one time. This was no small feat, since every day each fruit \ntree has a chance of dying, and a small chance of breeding a new \ntree. Therefore, with no space for new trees to breed, and existing \nand perhaps rare fruit trees dying, maintaining a garden full of \nindividual trees is very difficult. Maintaining a garden with all 20 \nfruit trees at once is even harder, and only sustainable for a few \nhours (before another tree dies). \nCO2 expenditure has a huge impact on score in PASION Fruit, so \nfor a player trying to be competitive, it is not in their advantage to \ncollect a huge variety of fruits. The recommended strategy was \none of sustainability, choosing to maintain local sources of rare \nfruits with players in the local regions. As described by a \nrespondent:  \n“I tried to keep a mix of fruits locally. I worked with people \nlocally to keep the rare fruits alive. After a while i would get \nrid of any fruits that were prolific in the area by deleting them \nrather than sending them on to people who probably didn't \n \nFigure 6 - Players can see histories of distances fruit has \ntravelled and CO2 generated \n \nwant them. At first i sent these locally prolific fruits to other \ncountries in hope to get some different fruits in return. Once \nall the fruits were in the country i stopped sending abroad in \nhope to keep my carbon count down.” (P5) \nThe players choosing to challenge themselves to get all 20 fruit \nwere doing so in the knowledge that it would irrecoverably \ndamage their score due to the amount of CO2 emissions \ngenerated. This was directly against the designed goals of the \ngame. \nOne player reported they had set a goal that took this idea to the \nextreme: \n“Be #1 with the highest possible score. I.e. No CO2.”  (P6) \nThis player had realised that getting 20 distinct trees would be \ndifficult without generating huge amounts of CO2, had set a new \ngoal: achieve the maximum possible score. \nSince the game mechanics of PASION Fruit only define that the \nsender of a gift has to pay costs in terms of CO2, it is technically \npossible to have a garden without any CO2, by never sending a \ngift. This player went on a mission to ask other players within the \ngame to sacrifice their own score in order to help him achieve this \nimpossible task. Surprisingly, enough of the other players wanted \nto see him succeed, that quickly he managed to achieve, not only \n20 different fruits, but simultaneously with a CO2 expenditure of \n0. This gave him the maximum possible score of 200,000 points \nfor a few short hours before the trees started to die and the score \ndecreased. \n4.3 Emergence by Accident \nFrom the designer’s perspective, players behaved erratically in \nPASION Fruit - in particular, the emergent ideas of players to \nignore their scores and focus on self-directed goals for getting \nvarieties and types of fruit in their garden was clearly a result of \npaidic experimentation within the game rules. These players \nwanted to explore the boundaries of what was permitted within \nthe game and what could reasonably be fun to achieve. In doing \nso, this emergent challenge was created that a significant portion \nof players felt was, perhaps, more fun than following the formally \ndefined game objectives. \nIn this respect it is pleasing the players have found new and novel \nways to enjoy the game that were previously unexpected, but it \nchallenges the game designer to think, “what could we have done \nto allow more of this behaviour?” \nDespite not having the resources of a large game developer to \nmake sweeping changes to the design, subtle changes could still \nencourage further playful and emergent activity within the \nconfines of the game functionality.  \n5. DESIGN GAPS \nThe emergence of playful behaviours in social games appears to \nbe based on what we term “design gaps” – that is, some \npossibilities for players to have an effect on the game world that \nmay not have direct benefits or cost (and may have been \nunintentional on the part of the designer). For example, being able \nto manually place items in a virtual world, or being able to \ncustomize avatars, or even providing scope for player-defined \nchallenges are all kinds of “gap” in the experience as defined by \nthe formal, ludic, game structure.  \nIt is also possible for some designs to be so tight that there is little \nor no scope for playfulness within the formal game structure. The \nexamples of highly ludic “restrictive” social games such as Mafia \nWars appear to lack any of these “gaps” for players to exploit. \nEven in games that contain such “gaps”, the possibilities become \nclosed as barriers to use them increase. If a player is punished for \nexploring a game space, or going “off the beaten path”, the \nmotivation to do so may be reduced; the player is effectively \ndiscouraged from creating more playful experiences. \nIn the case of PASION Fruit, every action in the game has a direct \nconsequence, and emergent play only occurred in spite of these \ndesign decisions. Had there been lower barriers on the “design \ngaps” – where lack of ludic barriers mean the game does not \ndirectly punish the player for failing to conform to the rules, \nexperience suggests we might have seen a much more active and \npaidic in-game society. \n \nFigure 9 - Diversity, but at huge environmental cost \n \n \nFigure 8 - The \"Perfect\" PASION Fruit Garden \n \n6. DISCUSSION \nSocial games are the latest in a long history of innovations in \ngames design. In just a few short years, the genre has quickly \nbecome one of the most popular forms of gaming available. The \naudience demographics have shifted dramatically from what had \nbecome the norm in digital games, and along with it the \nexpectations, skills, likes and dislikes of the players. \nDespite this seismic shift in the landscape of game design theory \nand practice, core theories of games, such as those proposed by \nCaillois in the mid 20th century, are still as relevant today as they \nhave been throughout the evolution of games as a medium. \nIn this paper, one particular aspect of Caillois’ theories of play, \nPaidia, has been reintroduced and used as a lens to examine the \nsocial games phenomenon. Specific examples have been taken \nfrom popular social games in order to illustrate how, even in \nsimple social games, paidia and playfulness can still be an \nimportant part of the game experience. This is contrary to the idea \nthat playfulness requires significant extra development in order to \nsupport (e.g. as sandbox-style console games do) \nAnother social game, PASION Fruit, has been presented as a case \nstudy with more examples of playfulness on the part of the players \nto create more challenging experiences that were not a part of the \ngame design. This designers’ eye view demonstrates that the \ndesign process can lack any intentional will to support playfulness \nin social games – paidic and playful experiences will be created \nby the players themselves using whatever tools are available. \nHowever, as in the case of PASION Fruit, too many design \nbarriers can directly punish the players who try to exhibit their \nplayful desires. As seen in even more restrictive social games \nsuch as Mafia Wars, even if the games are fun as is, if there is no \nplayer freedom in the design, it can be argued that playfulness and \npaidia are prevented from emerging.  \nAlthough social games as a genre offer great new challenges and \nopportunities for novel game design, it is still vitally important to \nremember that the players are also capable of creating their own \nsources of amusement. Paidia and playful explorative activities \nwithin the confines of a system of rules, is perfectly capable of \nleading players to create new emergent meta-games with their \nown rule-sets. It appears that given the chance, players will find \nways to subvert the formal rules of a game by exploiting “design \ngaps” in order to find new and exciting ways to have fun. \nHowever, the capabilities of the players is still limited by the tools \navailable – the fewer the number of barriers and restrictions on \nplayer behaviour, and the more actions a player is able to take in a \ngame, the more enabled the players become to define their own \nfun as games-within-the-game beyond what the game designer \nplanned. \n7. ACKNOWLEDGMENTS \nPASION Fruit was designed as part of the PASION Project which \nwas funded under the Presence II Initiative in the Future \nEmerging Technologies within the European Framework VI \nProgramme. \n8. REFERENCES \n[1] AppData Facebook Application Metrics, www.appdata.com \n[2] Bateman, C. and Boon, R. 2006. 21st Century Game Design, \nCharles River Media \n[3] Bateman, C. 2005. The Anarchy of Paidia, accessed 4\/2010: \nhttp:\/\/onlyagame.typepad.com\/only_a_game\/2005\/12\/the_an\narchy_of__1.html  \n[4] Brugnoli, M.C., Morabito, F., Walker, R. and Davide, F. \n2006. The PASION Project: Psychologically Augmented \nSocial Interaction over Networks, PsychNology 4:1 \n[5] Caillois, R. 1961. Man, Play and Games, The Free Press \n[6] Caoili, E. 2010. Study: 21 Percent of Gamers Aware of \nFarmVille Play it Daily, Gama Sutre, online: \nhttp:\/\/www.gamasutra.com\/view\/news\/28322\/Study_21_Perc\nent_Of_Gamers_Aware_Of_FarmVille_Play_It_Daily.php \n[7] Developer Analytics, Farm Town Report, April 2010 \nhttp:\/\/www.developeranalytics.com\/app.php?id=56748925791 \n[8] Farm Town, Accessed April 2010: \nwww.facebook.com\/apps\/application.php?id=56748925791 \n[9] Frasca, G. 2003. Simulation versus Narrative. The Game \nTheory Reader, Routledge \n[10] Järvinen, A. 2009. Game Design for Social Networks, \nAccessed april 2010: \nhttp:\/\/www.mygamestudies.com\/content\/game-design-social-\nnetworks-part-1 \n[11] Kirman, B and Lawson, S. 2009. Hardcore Classification: \nidentifying play styles in social games using network \nanalysis. Lecture notes in Computer Science 5709, Springer \n[12] Miller, C C. and Stone, B. 2009. Electronic Arts Buys \nPlayfish, a Social Games Start-Up. New York Times \nNovember 9th 2009, New York \n[13] Nethack Voluntary Challenges, Accessed April 2010: \nhttp:\/\/www.steelypips.org\/nethack\/conduct.html \n[14] Rao, V. 2008. Facebook Applications and playful mood: the \nconstruction of Facebook as a “third place”. MindTrek 2008, \nTampere, Finland \n[15] Salen, K. and Zimmerman, E. 2004. Rules of Play: Game \nDesign Fundamentals, MIT Press \n[16] Speed Demos Archive, Community Rules, Accessed April \n2010: http:\/\/speeddemosarchive.com\/lang\/rules_en.html \n \n \n \n"}