{"doi":"10.1111\/j.1467-8519.2009.01781.x","coreId":"213065","oai":"oai:eprints.lse.ac.uk:25825","identifiers":["oai:eprints.lse.ac.uk:25825","10.1111\/j.1467-8519.2009.01781.x"],"title":"Undignified bioethics","authors":["Cochrane, Alasdair"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-06","abstract":"The concept of dignity is pervasive in bioethics. However, some bioethicists have argued that it is useless on three grounds: that it is indeterminate; that it is reactionary; and that it is redundant. In response, a number of defences of dignity have recently emerged. All of these defences claim that when dignity is suitably clarified, it can be of great use in helping us tackle bioethical controversies. This paper rejects such defences of dignity. It outlines the four most plausible conceptions of dignity: dignity as virtuous behaviour; dignity as inherent moral worth; Kantian dignity; and dignity as species integrity. It argues that while each conception is coherent, each is also fundamentally flawed. As such, the paper argues for a bioethics without dignity: an ‘undignified bioethics.","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/213065.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/25825\/1\/Undignified_bioethics%28LSERO%29.pdf","pdfHashValue":"f4bdb338d41326677eb986ccf1bdcfab17279ff4","publisher":"Wiley-Blackwell Publishing Ltd.","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:25825<\/identifier><datestamp>\n      2017-05-04T09:35:32Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/25825\/<\/dc:relation><dc:title>\n        Undignified bioethics<\/dc:title><dc:creator>\n        Cochrane, Alasdair<\/dc:creator><dc:subject>\n        BJ Ethics<\/dc:subject><dc:description>\n        The concept of dignity is pervasive in bioethics. However, some bioethicists have argued that it is useless on three grounds: that it is indeterminate; that it is reactionary; and that it is redundant. In response, a number of defences of dignity have recently emerged. All of these defences claim that when dignity is suitably clarified, it can be of great use in helping us tackle bioethical controversies. This paper rejects such defences of dignity. It outlines the four most plausible conceptions of dignity: dignity as virtuous behaviour; dignity as inherent moral worth; Kantian dignity; and dignity as species integrity. It argues that while each conception is coherent, each is also fundamentally flawed. As such, the paper argues for a bioethics without dignity: an ‘undignified bioethics.’<\/dc:description><dc:publisher>\n        Wiley-Blackwell Publishing Ltd.<\/dc:publisher><dc:date>\n        2010-06<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/25825\/1\/Undignified_bioethics%28LSERO%29.pdf<\/dc:identifier><dc:identifier>\n          Cochrane, Alasdair  (2010) Undignified bioethics.  Bioethics, 24 (5).  pp. 234-241.  ISSN 0269-9702     <\/dc:identifier><dc:relation>\n        http:\/\/www3.interscience.wiley.com\/journal\/118486360\/home<\/dc:relation><dc:relation>\n        10.1111\/j.1467-8519.2009.01781.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/25825\/","http:\/\/www3.interscience.wiley.com\/journal\/118486360\/home","10.1111\/j.1467-8519.2009.01781.x"],"year":2010,"topics":["BJ Ethics"],"subject":["Article","PeerReviewed"],"fullText":"  \nAlasdair Cochrane  \nUndignified bioethics \n \nArticle (Submitted version) \n(Pre-refereed) \n \nOriginal citation: \nThis is the pre-peer reviewed version of the following article - Cochrane, Alasdair (2010) \nUndignified bioethics. Bioethics, 24 (5). pp. 234-241. ISSN 0269-9702 which has been published \nin final form at \nDOI: 10.1111\/j.1467-8519.2009.01781.x  \n \n© 2010 Wiley-Blackwell\n \nThis version available at: http:\/\/eprints.lse.ac.uk\/25825\/\nAvailable in LSE Research Online: June 2010 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s submitted version of the journal article, before the peer review \nprocess.  There may be differences between this version and the published version.  You are \nadvised to consult the publisher’s version if you wish to cite from it. \n \nFor more research by LSE authors go to LSE Research Online   \nUndignified Bioethics \n \nFor some bioethicists, ‘dignity’ is a useless concept.1  It has been claimed to be \nuseless for at least three reasons.  First of all, some have accused dignity of being \nindeterminate.  These thinkers claim that dignity is used in so many opposing senses \nthat the concept is just too slippery to help us tackle difficult problems in bioethics.2  \nSecond, others have accused dignity of being reactionary.  Proponents of this claim \nargue that dignity is unjustifiably invoked as a kind of moral trump to stall progressive \nadvances in medicine and thus to impede the alleviation of great harms.3  Finally, still \nothers have accused dignity of being redundant.  These thinkers claim that if any \ndeterminate and plausible meaning can be given to dignity, it sheds no new light on \nbioethical debates, and simply restates ideas that can be found in other ethical \nprinciples such as ‘respect for autonomy’.4\n  Interestingly, however, a number of recent articles and books have mounted a \ndefence of dignity.  These defences have claimed that dignity is so ingrained in \nbioethical discourse and legal instruments, that aiming to do away with it is simply, \n“…whistling in the wind.”5  As such, defenders of dignity argue that instead of purging \nthe concept from bioethical debates, we should concentrate on clarifying the term, \nand making it more useful for addressing bioethical controversies.6\n  This paper rejects these defences of dignity.  It acknowledges that coherent \nunderstandings of dignity can be found, but argues that they are all flawed.  As such, \nit argues that these conceptions of dignity should be rejected.  It claims that they \nshould be rejected not simply because they are indeterminate, reactionary or \nredundant, but more fundamentally, because they rest on or invoke flawed ethical \narguments.  Overall then, the paper argues for a bioethics without dignity: an \n‘undignified bioethics’. \n                                                 \n1 R. Macklin. 2003. Dignity is a Useless Concept. British Medical Journal 2003; 327: 1419-1420. \n2 H. Kuhse. 2000. Is There a Tension Between Autonomy and Dignity? In Bioethics and Biolaw, Vol. \nII: Four Ethical Principles. P. Kemp, J. Rendtorff, & N. Mattson Johansen, eds., Copenhagen: Rhodos \nInternational Science and Art Publishers and Centre for Ethics and Law: 61-74.  \n3 S. Pinker. 2008. The Stupidity of Dignity. The New Republic 28 May.    \n4 Macklin, op. cit. note 1. \n5 D. Beyleveld & R. Brownsword. 2001. Human Dignity in Bioethics and Biolaw. Oxford: Oxford \nUniversity Press: 63; and D. Schroeder. Dignity: Two Riddles and Four Concepts. Cambridge \nQuarterly of Healthcare Ethics 2008; 17: 230-238: 237. \n6 For attempts at clarification in this spirit see Beyleveld & Brownsword, op. cit. note 5; M. Hayry. \nAnother Look at Dignity. Cambridge Quarterly of Healthcare Ethics 2004; 13: 7-14; L. Nordenfelt. \nThe Varieties of Dignity. Health Care Analysis 2004; 12: 69-81; R.E. Ashcroft. Making Sense of \nDignity. Journal of Medical Ethics 2005; 31: 679-682; Schroeder, op. cit. note 5; & R. Van Der Graaf \n& J.J.M. Van Delden. Clarifying Appeals to Dignity in Medical Ethics from an Historical Perspective. \nBioethics 2009; 23: 151-160. \n 1\n  In order to make this argument, the paper is divided into four sections, each of \nwhich considers a different conception of dignity.  Of course, the paper does not \nconsider every possible conception of dignity.  Instead, the paper considers only \nthose conceptions that are the most plausible and which are claimed to offer the \nmost potential in helping us address bioethical controversies.  As such, the paper \nfocuses on four different conceptions of dignity: dignity as virtuous behaviour; dignity \nas inherent moral worth; Kantian dignity; and dignity as species integrity.   In each \nsection, the conception of dignity is explained, and is conceded to be coherent.  \nImportantly, however, each section also argues that the particular conception of \ndignity should be rejected.   \n \nDignity as Virtuous Behaviour \nThe first important conception of dignity that we need to consider understands dignity \nto be a form of virtuous behaviour.7  This behaviour-based conception of dignity is \nregularly invoked in bioethical discussions.  For example, it is often used to describe \nand praise those in the medical profession.  Doctors are sometimes said to act in a \ndignified manner when they conduct themselves in a composed and serious manner.  \nMoreover, dignity is also used to describe and praise individuals when they show \ncourage and self-control in the face of terrible illness and suffering.  Far from being \nslippery and useless then, it might be argued that conceiving of dignity as a form of \nvirtuous behaviour offers a coherent understanding of the term which is helpful in \ntackling complex issues in bioethics. \n  However, if this conception of dignity is in fact to be useful, it is vital that we have a \nclear understanding of what behaviour counts as dignified.  From the literature, it \nseems that there are two interpretations of what constitutes dignified behaviour: one \ntrivial and the other more noble. The trivial understanding sees dignified behaviour as \nacting in accordance, “…with society’s expectations of well-mannered demeanour \nand bearing.”8   Here then, to act in a dignified way is to act in accordance with the \nrecognised norms and customs of one’s society: to cover one’s mouth when \nsneezing, to wait one’s turn when queuing, to refrain from swearing in front of \nchildren, and so on.  Of course, even if it is true that we should all aspire to conform \nto our society’s expectations of well-mannered behaviour, that alone tells us nothing \nabout controversial issues in bioethics, such as the permissibility of stem cell \n                                                 \n7 This understanding is identified by Nordenfelt, op. cit. note 6, p. 72; Schroeder, op. cit. note 5, p. 234; \nand Beyleveld & Brownsword, op. cit. note 5, p. 43. \n8 Schroeder, op. cit. note 5, p. 234. \n 2\nresearch, cloning, genetic engineering and the like.  The trivial understanding of \ndignified behaviour does not appear to be of much use to bioethics.   \n  In response, it might be argued that such rules over well-mannered behaviour do \ntell us something about how scientists and medical professionals should undertake \ntheir work.  Perhaps it is important that these individuals perform their tasks in a \ndignified way: in keeping with the recognised standards of demeanour of the society \nthey work in.  Perhaps.  But even if such standards are easily identifiable, which is by \nno means obvious, we must ask ourselves just how important they are.  After all, \nsome of us may prefer it if our medical professionals conform to certain behavioural \nnorms when dealing with us, but it is unlikely that any of us actually consider such \nbehaviour to be mandatory.  Surely the only behaviour of medical professionals that \nreally matters is that which sees them doing everything in their power to minimise \nsuffering, and to restore health where possible.  And it is obvious that medical \nprofessionals can act in this way even if they have certain habits and eccentricities \nwhich do not conform to ordinary societal norms.  As such, it would be extremely odd \nto demand that medical professionals and scientists act in accordance with this trivial \nunderstanding of dignified behaviour.               \n  However, there is a more demanding, and perhaps more noble, understanding of \ndignified behaviour which also needs to be considered.  This interpretation sees as \ndignified that behaviour which shows self-control, and in particular self-control in the \nface of adversity.9  As such, it is often suggested that the lives of figures such as \nSocrates, Jesus and Nelson Mandela are all exemplars of dignified behaviour.  That \nis to say, even when these individuals faced extreme adversity and injustice in their \nlives, they did not lose self-control.  Instead, they maintained their moral principles \neven at high cost to themselves, and acted in a composed manner when most others \nwould lash out.  This interpretation of dignity is relevant to bioethics in that it is often \nused to describe individuals living with serious disease and suffering.  For example, \nwhen the American actor Christopher Reeve was paralysed following a horse riding \naccident, and subsequently campaigned on behalf of those with spinal cord injuries, \nhe was regularly described as acting with dignity.  This term was no doubt assigned \nto him on the basis that although he suffered terribly, and had lost so much of his \nphysical capability, he did not wallow in self-pity, but instead maintained his self-\ncontrol, and steadfastly got on with the job of campaigning on behalf of others. \n  Clearly this interpretation of dignified behaviour is perfectly coherent.  However, \nonce again, we must ask what kind of role it can usefully play in bioethics.  For even \n                                                 \n9 Beyleveld & Brownsword, op. cit. note 5, p. 43; and Nordenfelt, op. cit. note 6, p. 72. \n 3\nif we admit that there is something admirable about individuals behaving in such \nways when they suffer so much, it is hard to see how the notion helps us address \nproblems in bioethics such as abortion, euthanasia, organ transfers and the like.  In \nresponse, it might be claimed that it offers a form of behaviour that all those suffering \nfrom disease and illness should aspire to.  But is that really fair or reasonable?  It is \nsurely too much to ask that we all live up to the standards set by such remarkable \nfigures as Socrates, Jesus and Nelson Mandela! And indeed, why should we?  \nLosing self-control in the face of adversity, whether it be wallowing in self-pity or \nranting and raving uncontrollably at injustice, is surely a perfectly legitimate \nresponse.  More importantly, all of us surely recognise that it is a perfectly \npermissible reaction to adversity, provided that it harms no-one else.  Given all of \nthis, it is hard to see why conceiving of dignity as virtuous behaviour is of any use to \nbioethics.   \n \nDignity as Inherent Moral Worth \nThe second important conception of dignity that we need to consider does not see \ndignity as a form of behaviour, but as a property.  Under this conception, the \npossession of dignity by humans signifies that they have an inherent moral worth.10  \nIn other words, because human beings possess dignity we cannot do what we like to \nthem, but instead have direct moral obligations towards them.  Indeed, this \nunderstanding of dignity is also usually considered to serve as the grounding for \nhuman rights.  As Article 1 of the Universal Declaration of Human Rights states: “All \nhuman beings are born free and equal in dignity and rights.”11  \n  In effect, this conception of dignity as moral worth is a universalised version of the \nmore ancient understanding of the term.  Several authors have pointed out that the \nancient understanding of dignity (or ‘dignitas’) was hierarchical.  That is to say, \ndignity was a moral worth reserved for those of extraordinary quality, who occupied \nthe highest ranks and offices in society, and which individuals won as they climbed \nup the social hierarchy, and lost as they moved down.12  In more modern times, this \nextraordinary quality is said to be possessed by all human beings, irrespective of \nsocial rank.  It is also, of course, now said to be possessed by all human beings \nirrespective of race, religion, gender, age, nationality and so on.  In both cases, \n                                                 \n10 This type of dignity is identified by Lennart Nordenfelt as ‘dignity of menschenwürde’ in Nordenfelt, \nop. cit. note 6, pp. 77-78. \n11 United Nations. 1948. Universal Declaration of Human Rights. Reprinted in 2006. International \nHuman Rights Documents. P. R. Ghandi, ed., 5th edition, Oxford: Oxford University Press: 21-25.  \n12 See Hayry, op. cit. note 6, p. 11; Nordenfelt, op. cit. note 6, pp. 71-72; Van Der Graaf & Van Delden, \nop. cit. note 6, p. 154; and Schroeder, op. cit. note 5, p. 233. \n 4\nhowever, dignity refers to a property possessed by human beings which makes them \ndeserving of certain treatment.  By seeing this quality as possessed by every single \nhuman being, the modern understanding of dignity simply makes noblemen of us all. \n  This conception of dignity as inherent moral worth certainly seems coherent enough \nas an idea.  Indeed, we can also see why this conception of dignity is employed in \ncertain debates around bioethics.  For if all individual human beings possess dignity, \nthen they should not be viewed simply as resources that we can treat however we \nplease.  To take an example then, it may be that we could achieve rapid and \nsignificant progress in medical science if we were to conduct wide-ranging medical \nexperiments on groups of human beings.  However, because human beings have \ndignity, so it is argued, this means that they possess a particular quality which \ngrounds certain moral obligations and rights.  These obligations and rights restrict \nwhat we may permissibly do to them.  As such, inflicting great harms on individual \nhumans, as would be inflicted in medical experiments, is impermissible on the \ngrounds that human individuals possess dignity.  The dignity of individual human \nbeings prevents us from doing certain acts to them, even if those acts would lead to \ngreat social benefits.   \n  But while this conception of dignity does indeed make sense, there is a huge \nproblem with it.  It remains extremely unclear where dignity comes from.  For \ninstance, Article 1 of the UDHR simply stipulates that, “All human beings are born \nfree and equal in dignity...”  But why are they?  If all human beings possess dignity - \nthis extraordinary moral worth – we need some explanation of what it is about the \nspecies Homo sapiens that makes them so deserving.  When we start looking at \nparticular characteristics that might ground dignity - language-use, moral action, \nsociality, sentience, self-consciousness, and so on – we soon see that none of these \nqualities are in fact possessed by each and every human.  We are therefore left \nwondering why all human beings actually do possess dignity. \n  Moreover, the crucial point about conceiving of dignity as signifying our inherent \nmoral worth is surely that it does not depend on the qualities of individuals.  Rather, \ndignity is simply ingrained in every member of the human species.  As such, if there \nis to be any justification of the idea that all and only human beings possess this \ninherent moral worth, it must then be that humans are special in a sense which \ntranscends their physical characteristics.  And indeed, this is where religion - and in \nparticular the Christian religion - fills the explanatory gap.  For the Christian religion \ntells us that humans are indeed special in some non-physical sense: they alone are \nmade in the image of God, and they alone are in possession of a soul.  If we buy into \nthese ideas, the idea of dignity as inherent moral worth suddenly starts to make a lot \n 5\nmore sense.  All and only humans possess dignity because all and only humans are \nin this special relationship with God.13  \n  But while this conception of dignity now makes sense, it only does so by being \ngrounded in extremely controversial claims that not all individuals can reasonably be \nexpected to accept.  The problem is not so much that it is obviously wrong that \nhumans are made in the image of God; but rather, that in modern pluralistic societies, \nmany people have quite different religious beliefs, or even none at all.14  Using this \nunderstanding of dignity to make policy decisions over controversial issues in \nbioethics thus seems to privilege one type of religious viewpoint without reasonable \njustification. \n  Furthermore, even if we were to accept the conception of dignity as a property of all \nhuman beings signifying their inherent moral worth, it still does not help us get very \nfar in tackling controversies in bioethics.  The dignity of human beings tells us that \nindividuals have a moral worth and thus that we have certain important obligations \ntowards them.  But which obligations?  For example, is assisting those who are \nterminally ill, suffering terribly and who have asked for help in ending their lives \npermissible or impermissible?  The conception of dignity as the inherent moral worth \nof human beings tells us nothing.  It may be, as some conservatives argue, that the \nmoral worth of human beings means that we can never take the life of another \nindividual.  But it may also be, as some liberals argue, that the moral worth of human \nbeings demands that we take individuals’ informed choices extremely seriously.15  \nOn its own, conceiving of dignity as the inherent moral worth of all human beings \noffers nothing to help us resolve such difficult problems. \n  I believe then that we should reject the conception of dignity as a property \npossessed by all human beings signifying their inherent moral worth.  Obviously, \ngiven controversies over abortion, stem cell research, genetic interventions, animal \nexperimentation, euthanasia and so on, bioethics does need to engage in debates \nover which entities possess moral worth and why.  But these are best conducted by \nusing the notion of ‘moral status’ and arguing over the characteristics that warrant \npossession of it.16  Simply stipulating that all and only human beings possess this \ninherent moral worth because they have dignity is arbitrary and unhelpful.   \n \n                                                 \n13 For an understanding of dignity along these lines see, L. R. Kass. 2002. Life, Liberty and the Defense \nof Dignity. San Francisco, CA: Encounter Books: 241-243.  \n14 Beyleveld & Brownsword, op. cit. note 5, p. 45. \n15 Hence we see dignity invoked by both sides in debates over euthanasia. \n16 See M. A. Warren. 1997. Moral Status: Obligations to Persons and Other Living Things. Oxford: \nOxford University Press. \n 6\nKantian Dignity  \nThe third important conception of dignity that must be considered is Kantian.17  This \nconception of dignity also sees dignity as a property, but it differs from the inherent \nmoral worth conception in two ways.  First of all, a strict interpretation of it implies \nthat it is not necessarily inherent in all (or only) human beings.  Only those entities \nwith the capacities for personhood possess dignity under the Kantian interpretation.  \nThe second difference with this conception of dignity is that while it does \nacknowledge that those with dignity possess a moral worth, and are thus owed \ncertain forms of treatment, it also tells us what kinds of treatment possessors of \ndignity are owed.   \n  We can see then that the Kantian conception of dignity remedies two of the \nproblems with the inherent moral worth interpretation.  Kantian dignity does not \narbitrarily assign moral status to all and only human beings.  Nor does it make moral \nworth dependent on controversial faith-based premises that not all can accept.  \nInstead, the Kantian conception sees the capacities of personhood as determining \nmoral status.  The capacities of personhood are moral agency and autonomy.  Moral \nagency is the ability to reason about and act upon moral principles. Autonomy is the \ncapacity to self-determine: to frame, revise and pursue a conception of the good.  \nFrom this, it is evident that not all human beings are endowed with dignity from birth, \nas stipulated in the UDHR.  Nor is it necessarily true that only members of the \nspecies Homo sapiens possess this moral worth.  As such, Kantian dignity provides a \nplausible and determinate means of assigning moral status in bioethical discussions.     \n  Furthermore, and unlike the inherent moral worth conception, Kantian dignity also \ngives us some guidance as to what obligations we owe to those with dignity.  For \nunder the Kantian conception, those entities with dignity are ends-in-themselves: \nself-determining entities who can exercise moral judgement and free will.  Because \nthey are ends-in-themselves, Kant argued that possessors of dignity should always \nbe treated as an end-in-themselves, and never solely as a means.  This ‘ends-in-\nthemselves’ formula has been applied directly to various bioethical questions.  But it \nhas also been used more loosely in order to ground the principle of respect for \nautonomy.  Clearly then, Kantian dignity offers a coherent conception of the term and \nis potentially a very useful tool to help us address complex problems in bioethics.   \n  Despite the advantages of Kantian dignity over the inherent moral worth conception, \nI maintain that it too should be rejected.  First of all, using Kantian dignity as a means \nto assign moral status to entities is overly exclusive.  If only ‘persons’ – those with the \n                                                 \n17 This conception is identified in Hayry, op. cit. note 6, p. 9; Van Der Graaf & Van Delden, op. cit. \nnote 6, p. 157; Schroeder, op. cit. note 5, p. 233; and Beyleveld & Brownsword, op. cit. note 5, p. 11.  \n 7\ncapacities for moral agency and autonomy – possess moral status, then a huge \nrange of individuals are left out of the moral community.  For example, young infants, \nthe severely mentally disabled and the vast majority of species of non-human animal \nall lack the ability to make moral choices and formulate conceptions of the good.  But \neven though these individuals lack such capacities, surely there are limits to what we \ncan permissibly do to them. \n  In response, proponents of Kantian dignity might draw a distinction between direct \nand indirect obligations.18  They would point out that denying moral status to non-\npersons does not mean we can do what we like to them.  We may have no direct \nobligations to such individuals, so the argument goes, but we do have indirect \nobligations in respect of them.  For example, they might argue that we should not \nsteal from the severely mentally disabled not because we owe anything to them \ndirectly, but because we owe something to their friends, family and society, or even \nbecause stealing from them might lead us to commit further crimes against others. \n  However, most of us will quite rightly consider this response to be entirely wrong.  \nFor our obligation not to steal from the mentally disabled – just like our obligation to \nfeed infants and not to beat dogs – is surely and uncontroversially something owed \ndirectly to these individuals themselves.  True, these individuals may not be persons \nin the Kantian sense, but they do have interests which can be set back or promoted.  \nAnd it is the possession of these interests which alone seems sufficient to warrant \nrecognition of moral status.19  As such, we should reject using Kantian dignity as a \nmeans of assigning moral status to entities. \n  Secondly, we should also question the ethical principles which are said to derive \nfrom the Kantian conception of dignity.  You will recall that Kantian dignity not only \nassigns to its possessors a moral worth, it also tells us that we cannot treat its \npossessors solely as a means.  But what precisely does it involve to treat an \nindividual solely as a means?  To help explain, consider the case of so-called \n‘saviour siblings’, where parents conceive a child specifically in order to help an older \nbrother or sister, say by providing stem cells for transplantation.  Some have argued \nagainst the creation of such children by invoking Kant’s formula.20  They claim that \n                                                 \n18 See Kant’s discussion of our obligations regarding animals on this distinction.  I. Kant. 1963. \nLectures on Ethics. L. Infield trans. New York: Harper and Row: 239. \n19 The notion that the possession of interests is the necessary and sufficient condition for the possession \nof moral status has been famously advanced by utilitarian thinkers such a Jeremy Bentham and Henry \nSidgwick.  See also P. Singer. 1995. Animal Liberation. 2nd edition. London: Pimlico: 7-8. \n20 See for example the exchange between Axel Kahn and John Harris with regards to the creation of \nsuch individuals through cloning as described in J. Harris. 2004. On Cloning. London: Routledge: 38-\n42.  I very much agree with Harris’s position. \n 8\ncreating children in this way is to use them solely for the benefit of others, and thus \nsolely as a means, which is impermissible under the ends-in-themselves principle.  \n  But we should remember that Kant’s formula does not rule out using individuals as \na means per se, but rules out using them solely as a means.  After all, we use people \nas a means to our ends quite permissibly and quite uncontroversially all the time, \nsuch as using plumbers to fix our leaky radiators.  Using peoples as a means only \nbecomes impermissible when we treat them solely as a means: say, for example, if I \nkeep the plumber locked up in my shed so that he is available to fix my radiators at \nmy whim.  We can see then that treating people solely as means is a fairly extreme \nform of behaviour.  Indeed, returning to saviour siblings, we have to question whether \nthe parents of saviour siblings really are using those individuals solely as a means.  \nIn the overwhelming majority of real-life cases, that seems not to be the case.  The \nindividuals are created and used in order to benefit the older sibling, but they \nthemselves are also loved, respected and cared for as an equal member of the \nfamily.  Certainly, saviour siblings are treated as means, but they are also respected \nand treated as individuals with ends of their own. \n  Of course, it is certainly possible that a family could treat a saviour sibling \nexclusively as a means: for example, perhaps a family could regard the saviour \nsibling simply as an organ bank, and so kill them at some point so that all their \norgans are available for transplantation.  That does seem obviously wrong; and it \ndoes seem to be a case where individuals are treated exclusively as a means.  In \neffect, it is much like my enslavement of the plumber, where the individual is treated \nas a mere thing that exists purely for my own ends.  But do we really need the \nKantian notion of dignity to tell us that slaughtering innocent children for their organs \nis wrong?  Surely the wrong of slaughtering children is straightforwardly identified in \nthe fact that the children’s own interests in continued life are set back, and not in the \nfact that they are treated exclusively as means.  And surely the wrong of enslaving a \nplumber derives from the fact that a great many of the plumber’s most basic interests \nare set back, and not from any notion that he is being treated exclusively as a \nmeans. \n  In light of all this, I believe that we should be much more suspicious of the end-in-\nthemselves principle which derives from the Kantian conception of dignity.  First of \nall, the practical use of the principle can be questioned, given that we only ever treat \nother individuals exclusively as means in very extreme cases.  Secondly, while in \nthose extreme cases, like killing innocents for their organs and slavery, there is \nobvious moral wrong, that moral wrong does not seem to rest on the fact that those \n 9\nindividuals are being treated exclusively as means.  Rather, it simply seems to rest \non the fact that their most important interests are set back in an improper way. \n  But while a strict use of the end-in-themselves principle might be unhelpful, perhaps \na looser use of it could be of more benefit.   For, as I pointed out above, the Kantian \nunderstanding of dignity has been used to ground the principle of respect for \nautonomy: that the autonomous choices of individual persons should be respected as \nfar as possible.  After all, according to the Kantian conception, dignity belongs to \nthose who are persons.  Furthermore, part of being a person involves the capacity for \nautonomy: the ability to self-determine.  Given the importance of self-determination to \ndignity, we can justifiably surmise that being treated with dignity involves having \none’s autonomous capacities respected.  Importantly, this principle of respect for \nautonomy holds an important place in bioethics, often being invoked in debates over \nabortion, sexual reproduction, euthanasia, informed consent, and so on.21  As such, \nit may well be that the Kantian conception of dignity does offer a plausible and useful \ntool for helping to resolve tricky questions in bioethics. \n  However, the Kantian conception of dignity is not necessary to ground the principle \nof respect for autonomy.  To ground such a principle, all we need to say is that most \nhuman beings have a strong interest in having their autonomous choices respected.  \nThere is simply no need to ground the principle of respect for autonomy in any notion \nof dignity whatsoever.  In fact, basing respect for autonomy in ‘dignity’ is actually \nunhelpful.  Because dignity is also used by some to assign moral status – and thus to \nbe the very basis of our moral obligations - stating that our autonomy should be \nrespected because we possess dignity implies that autonomy is of ultimate \nimportance.  But first of all, we would be wise to remember that our interest in \nautonomy is just one of our interests, and it does need to be balanced against other \ngoods that are of value to us.  Pleasure, community, physical health and so on, are \nall other important interests that must not automatically be subsumed in the name of \nautonomy.  Furthermore, we must remember that not all individuals of moral worth \neven possess autonomous capacities.  There are some individuals for whom the \nprinciple of respect for autonomy has no relevance.  For example, it is of no good to \nnewborn babies to have their informed choices respected.  So while respecting the \nautonomous choices of individual persons is often a laudable goal, there are good \nreasons to keep that principle separated from conceptions of dignity. \n   \nDignity as Species Integrity  \n                                                 \n21 Respect for autonomy is one of the four principles advocated in T.L. Beauchamp & J. F. Childress.  \n2001.  Principles of Biomedical Ethics. 5th edition. New York, NY: Oxford University Press. \n 10\nThe final conception of dignity understands dignity not as a form of behaviour, nor as \na property, but as a form of flourishing life, or ‘dignified existence’.22  Indeed, Martha \nC. Nussbaum claims that in order to lead a dignified existence one must be able to \nflourish as the kind of being that one is.23  As such, to lead a life of dignity is to lead a \nlife where one is capable of performing the central valuable functionings of one’s \nspecies.    In many cases then, this dignity is a kind of self-respect that can be lost \nwhen we suffer certain forms of ‘dehumanising’ treatment.24  For example, it is \nregularly said that individuals suffer from a loss of dignity when they are tortured or \ntreated in other ways not fit for human beings.  Such treatment might involve being \ntied up, forced to eat like an animal, made to display one’s naked body, and so on \nand so forth.  In all cases, such treatment is considered to treat individuals without \ndignity, because it deprives them of certain valuable human functionings. \n  Of course, such a conception of dignity is familiar in bioethics.  For example, elder \nabuse has recently become an important issue in the UK and elsewhere.  Acts which \ndehumanise those in care, such as leaving individuals in soiled clothing and \nbedclothes, overmedicating individuals in order to sedate them, failing to provide \nassistance at mealtimes, and so on, have all been said to diminish the dignity of their \nelderly victims.  Furthermore, individuals who have lost certain central human \ncapacities through illness or disability sometimes themselves claim to have suffered \nfrom a loss of dignity. This was clearly the case for Daniel James, a 23 year old \nBriton who suffered paralysis in a rugby training accident in 2007.  After several \nunsuccessful attempts at committing suicide, James died at the Dignitas clinic in \nSwitzerland in 2008.  His parents said that because of his loss of functioning, James \nfelt that he led a second-class life, filled with terror, discomfort and indignity.25   \n  However, proponents of this conception of dignity do not claim that it centres solely \non a subjective feeling of loss.  In fact, they claim that a large part of its normative \npower derives from the fact that it rests on something more than subjective well-\nbeing.26  The claim is that a dignified existence depends on the possession of certain \nkey species functionings, irrespective of whether one feels happier for having them.  \n                                                 \n22 This is the conception least discussed by defenders of dignity.  I find this odd, as it seems the most \npotentially useful to my mind.  Nordenfelt’s notion of ‘dignity of identity’ is closely related, however.  \nSee Nordenfelt, op. cit. note 6. pp. 76-76. \n23 M.C. Nussbaum. 2006. Frontiers of Justice: Disability, Nationality, Species Membership. \nCambridge, MA: The Belknap Press of Harvard University Press: 162. \n24 The importance of self-respect to dignity is highlighted in P. Balzer; K. Rippe; and P. Schaber. Two \nConcepts of Dignity for Humans and Non-human Organisms in the Context of Genetic Engineering. \nJournal of Agricultural and Environmental Ethics 2000; 13: 7-27. \n25 D. Foggo. 2008. Why Daniel James chose to die. The Sunday Times 19 October. \n26 Nordenfelt, op. cit. note 6, p. 76; and M. Marmot. Dignity and Inequality.  The Lancet 2004; 364: \n1019-1021. \n 11\nBecause of this, they are able to say that those in comas lack a dignified existence, \nthat the dead can be treated without dignity, and that the deliberate creation of \nindividuals with disabilities undermines their dignity.  In all such cases, there is no \ndiminution of subjective well-being, but it is claimed that the loss of species integrity \nsignals something morally problematic.     \n  But in order for this conception of dignity to be plausible, we need some means of \ndetermining what it means to flourish as a member of one’s species.  It cannot be the \ncase that a dignified life can simply be equated with all of the natural functionings of \nhuman beings.  After all, some natural human acts are morally bad, such as rape and \nmurder; while others are morally neutral, such as our growing of hair and fingernails.  \nAs such, a dignified human life can surely not be equated with strict species integrity.  \nIn order to address such problems, Nussbaum claims that while the capabilities \nwhich amount to a dignified life are informed by the ‘characteristic activities’ of the \nspecies, not all human activities are included.  Instead, the list is ethical and \nevaluative.27  This of course makes sense.  But given that we are now being asked to \nmake ethical and evaluative judgements about which capabilities amount to a \ndignified existence, one wonders how much work the notion of species integrity is \nactually doing.  Why not just list those goods that are of value to individuals, without \nreference to any notion of species? \n  Nussbaum’s answer is that species norms are crucial in determining what counts as \na flourishing life.  To explain, she asks us to consider a child with severe mental \nimpairments and a chimpanzee with normal mental faculties.  Nussbaum tells us that \nalthough their mental capacities are in fact extremely similar, the two individuals have \nvery different possibilities for a flourishing and dignified life.28  She argues that \nbecause he is close to his species norm, the chimpanzee has excellent opportunities \nfor a flourishing life, but because the child falls well below her species norm, she \ndoes not.  On this view, species norms set the possibilities for a dignified life. \n  Of course, this explanation does seem to chime with many people’s intuitions.  \nMany do seem to use ‘normal species capacities’ as a kind of measuring stick for a \nflourishing life.  Those that are born without certain key species functions, or lose \nthem over the course of their lives, are considered by many to be worse off simply for \nthat fact, no matter how high their subjective well-being.  These intuitions are in \nkeeping with Nussbaum’s argument that there is a threshold of species functionings \nbelow which, “…a decently dignified life for citizens is not available.”29  But perhaps \n                                                 \n27 Nussbaum, op. cit. note 22, p. 180. \n28 Ibid: 363. \n29 Ibid: 179. \n 12\nNussbaum and those with these intuitions are wrong on this point.  Perhaps this is \nthe wrong attitude to disability.  After all, many disability campaigners would reject \nthe claim that they are unfortunate to the extent that they fall ‘below’ the normal \nspecies threshold, and would find feelings of pity directed towards them patronising.  \nThey would point out that their functionings are simply different to the species norm, \nand that they are perfectly capable of leading decent lives, not by being brought into \nconformity with the functionings of the species norm, but by living in societal \nconditions that allow them to flourish as the individuals they are.  In this way, they \nwould claim that equating a flourishing life with the notion of species integrity \nmistakenly adopts a perfectionist understanding of what counts as a decent human \nlife, and has the serious potential to stigmatise those with disabilities. \n  But while this charge of perfectionism certainly carries some weight, we should not \ncompletely ignore the serious suffering and impediments to well-being that disabilities \ncan cause.  For it is surely implausible to say that those with the most debilitating \nforms of disability are not at all unfortunate, and can always lead lives that are as \nflourishing as any other individual.  But if that is so, how are we to base judgements \nof a flourishing life?  I believe that we can do so not by any reference to dignity, but \nby reference to opportunities for well-being. This avoids the perfectionism of the \nspecies integrity approach, recognises the serious obstacles to flourishing that \ndisabilities can create, and also takes into account the important role that societal \nconditions have in affecting opportunities for flourishing. \n To illustrate, consider an individual who lacks some valuable human functioning.  \nAccording to the species integrity approach, that individual lacks the possibility for a \nfully flourishing life on that basis alone.  The opportunities for well-being approach, \nhowever, is more subtle.  Firstly, it asks what the nature of the disability is.  Some \ndisabilities, such as permanent vegetation, may be so debilitating that they afford \nvery few or even no opportunities for well-being.  For individuals suffering in these \nways, a fully flourishing life is clearly not available.  As well as the nature of the \ndisability, the approach also considers the level of societal provision.  For example, \nlacking something like the ability to walk seems like it would obviously result in that \nperson possessing fewer opportunities for well-being.  And yet, the opportunities that \nthe ability to walk affords, such as freedom of movement, participation in sport, and \nso on, can also be provided to those in wheelchairs, given proper investment.  In \nother words, those in wheelchairs can certainly lead fully flourishing lives given the \nright social conditions.  What seems crucial for a flourishing life then is not that \nindividuals possess the normal functionings of their species, but that they have \nadequate opportunities for well-being.  Whether such opportunities are available will \n 13\nbe determined in part by the nature of the disability and in part by the societal \nprovisions that are in place. \n  The important point from all this is that we should reject making judgements of a \nflourishing life on the possession of normal species functionings.  We can make more \nplausible judgements on the simple basis of opportunities for well-being, and without \nany reference to dignity or species integrity whatsoever.  As such, I claim that the \nconception of dignity as species integrity should also be rejected. \n \nConclusion \nThis paper has attempted to give dignity the benefit of the doubt.  I have surveyed \nwhat I consider to be the best and most plausible conceptions of dignity, and have \nrejected them all.  Dignity as virtuous behaviour should be rejected on the grounds \nthat it is either trivial or overly demanding.  Dignity as the inherent moral worth of all \nhuman beings should be rejected on the grounds that is arbitrary and rests on \ncontroversial premises.  Kantian dignity should be rejected on the grounds that it \nexcludes too many from the moral community and is unhelpful in delineating our \nmoral obligations.  Dignity as species integrity should be rejected on the grounds that \nit wrongly associates a flourishing life with the possession of normal species \nfunctionings.  Given that these are the best conceptions of dignity available, and that \nall are flawed, it would be preferable to purge dignity from bioethics.  However, and \nas mentioned above, several scholars have pointed out that the term is deeply \ningrained in bioethical debate, so attempting to do away with it is equivalent to \n‘whistling in the wind’.30  I disagree.  Just because an ethical term is popular does not \nmean that we are under an obligation to keep it.  Trends in ethical discourse change, \nand scholars can affect that change, even if only minimally.  If concepts are unclear, \nit is the job of scholars to push that they be clarified.  Moreover, if concepts are \nflawed and unhelpful, it is the job of scholars to push that they be rejected.  In the \ncase of dignity in bioethical discourse, I take the latter view.  As such, I urge for an \nundignified bioethics. \n \n \n \n                                                 \n30 See note 5. \n 14\n"}