{"doi":"10.1017\/S026357470100368X","coreId":"135585","oai":"oai:bradscholars.brad.ac.uk:10454\/3158","identifiers":["oai:bradscholars.brad.ac.uk:10454\/3158","10.1017\/S026357470100368X"],"title":"Iterative learning control for manipulator trajectory tracking without any control singularity","authors":["Jiang, Ping","Woo, P.","Unbehauen, R."],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2002","abstract":"NoIn this paper, we investigate trajectory tracking in a multi-input nonlinear system, where there is little knowledge of the system parameters and the form of the nonlinear function. An identification-based iterative learning control (ILC) scheme to repetitively estimate the linearity in a neighborhood of a desired trajectory is presented. Based on this estimation, the original nonlinear system can track the desired trajectory perfectly by the aid of a regional training scheme. Just like in adaptive control, a singularity exists in ILC when the input coupling matrix is estimated. Singularity avoidance is discussed. A new parameter modification procedure for ILC is presented such that the determinant of the estimate of the input coupling matrix is uniformly bounded from below. Compared with the scheme used for adaptive control of a MIMO system, the proposed scheme reduces the computation load greatly. It is used in a robotic visual system for manipulator trajectory tracking without any information about the camera-robot relationship. The estimated image Jacobian is updated repetitively and then its inverse is used to calculate the manipulator velocity without any singularity","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/3158<\/identifier><datestamp>\n                2016-07-25T16:41:21Z<\/datestamp><setSpec>\n                com_10454_413<\/setSpec><setSpec>\n                col_10454_6345<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nIterative learning control for manipulator trajectory tracking without any control singularity<\/dc:title><dc:creator>\nJiang, Ping<\/dc:creator><dc:creator>\nWoo, P.<\/dc:creator><dc:creator>\nUnbehauen, R.<\/dc:creator><dc:subject>\nVisual servo<\/dc:subject><dc:subject>\nAdaptive control<\/dc:subject><dc:subject>\nSingularity avoidance<\/dc:subject><dc:subject>\nIterative learning control<\/dc:subject><dc:description>\nNo<\/dc:description><dc:description>\nIn this paper, we investigate trajectory tracking in a multi-input nonlinear system, where there is little knowledge of the system parameters and the form of the nonlinear function. An identification-based iterative learning control (ILC) scheme to repetitively estimate the linearity in a neighborhood of a desired trajectory is presented. Based on this estimation, the original nonlinear system can track the desired trajectory perfectly by the aid of a regional training scheme. Just like in adaptive control, a singularity exists in ILC when the input coupling matrix is estimated. Singularity avoidance is discussed. A new parameter modification procedure for ILC is presented such that the determinant of the estimate of the input coupling matrix is uniformly bounded from below. Compared with the scheme used for adaptive control of a MIMO system, the proposed scheme reduces the computation load greatly. It is used in a robotic visual system for manipulator trajectory tracking without any information about the camera-robot relationship. The estimated image Jacobian is updated repetitively and then its inverse is used to calculate the manipulator velocity without any singularity.<\/dc:description><dc:date>\n2009-07-28T07:16:21Z<\/dc:date><dc:date>\n2009-07-28T07:16:21Z<\/dc:date><dc:date>\n2002<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\nNo full-text available in the repository<\/dc:type><dc:identifier>\nJiang, P., Woo, P. and Unbehauen, R. (2002). Iterative learning control for manipulator trajectory tracking without any control singularity. Robotica. Vol. 20, No. 2, pp. 149-158.<\/dc:identifier><dc:identifier>\n90013634<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/3158<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/dx.doi.org\/10.1017\/S026357470100368X<\/dc:relation>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1017\/S026357470100368X"],"year":2002,"topics":["Visual servo","Adaptive control","Singularity avoidance","Iterative learning control"],"subject":["Article","No full-text available in the repository"],"fullText":null}