{"doi":"10.1049\/cp:20000483","coreId":"197752","oai":"oai:lra.le.ac.uk:2381\/10023","identifiers":["oai:lra.le.ac.uk:2381\/10023","10.1049\/cp:20000483"],"title":"Charge injection, electroluminescence, and ageing of an epoxy resin in high divergent fields","authors":["Griseri, V","Fukunaga, K","Laurent, C","Mary, D","Dissado, Len A.","Fothergill, John C."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2000-09-17","abstract":"[INTRODUCTION]Most experimental studies of electrical ageing have concentrated on semi-crystalline polymers such as those used in cable insulation and capacitors (see for example [1]). Theoretical models [2-4] for electrical ageing have been developed on the basis of these studies. The consensus is that ageing involves the formation of low-density regions, though the mechanisms responsible are disputed. For example, bond scission by high-energy electrons [2,5], and mechanical deformation have both been suggested. Both of these mechanisms are related to charge injection and the subsequent formation of high local fields. The semi-crystalline polymers studied so far have similar chemistries and almost identical morphologies. They tend, therefore, to show many similarities in, for example, the size of the energy barriers for the ageing reaction, critical ageing levels, and field dependence of ageing [4]. These similarities make it difficult to discriminate between mechanisms. Epoxy resins, however, are network polymers with a different molecular chemistry to that of the semi-crystalline polymers and are thus ideal to evaluate the proposed ageing mechanisms. We have therefore studied an epoxy resin (CY1301) under both uniform field and high divergent field conditions. Uniform field conditions were used to gain baseline characteristics for the properties of the unaged epoxy resin, and also for the effects of electrical ageing in low fields. Studies in high divergent fields were made using an electrode arrangement adapted from that of [6]. A number of wires set approximately 0.5mm apart were embedded, parallel to the flat faces, in thin (290 m ) flat samples. The radius of the wires ranged from 5 m (gold plated tungsten) to 25 m (tungsten).  Relatively small voltages applied to the wires (5 kV DC) therefore produced local fields up to 170 kV\/mm depending upon the wire radius chosen. These field levels are high enough to inject space-charge [6] without leading to instantaneous failure. This geometry, therefore, may both inject charge and simulate local stress enhancements arising from charge accumulation. The number of wires is large (30) so that the volume affected is big enough to allow changes on ageing to be detectable.Peer-reviewedPost-print8th International Conference on Dielectric Materials, Measurements and Applications, Heriot Watt University, Edinburgh, Scotland","downloadUrl":"http:\/\/hdl.handle.net\/2381\/10023","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/10023\/5\/dmmapap9.pdf","pdfHashValue":"1f099852efa8c072e1b22413d9a866127e233a48","publisher":"Institution of Electrical Engineers","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/10023<\/identifier><datestamp>\n                2012-01-31T14:11:31Z<\/datestamp><setSpec>\n                com_2381_171<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_172<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nCharge injection, electroluminescence, and ageing of an epoxy resin in high divergent fields<\/dc:title><dc:creator>\nGriseri, V<\/dc:creator><dc:creator>\nFukunaga, K<\/dc:creator><dc:creator>\nLaurent, C<\/dc:creator><dc:creator>\nMary, D<\/dc:creator><dc:creator>\nDissado, Len A.<\/dc:creator><dc:creator>\nFothergill, John C.<\/dc:creator><dc:subject>\nSPACE CHARGES<\/dc:subject><dc:subject>\nMODEL<\/dc:subject><dc:description>\n[INTRODUCTION]Most experimental studies of electrical ageing have concentrated on semi-crystalline polymers such as those used in cable insulation and capacitors (see for example [1]). Theoretical models [2-4] for electrical ageing have been developed on the basis of these studies. The consensus is that ageing involves the formation of low-density regions, though the mechanisms responsible are disputed. For example, bond scission by high-energy electrons [2,5], and mechanical deformation have both been suggested. Both of these mechanisms are related to charge injection and the subsequent formation of high local fields. The semi-crystalline polymers studied so far have similar chemistries and almost identical morphologies. They tend, therefore, to show many similarities in, for example, the size of the energy barriers for the ageing reaction, critical ageing levels, and field dependence of ageing [4]. These similarities make it difficult to discriminate between mechanisms. Epoxy resins, however, are network polymers with a different molecular chemistry to that of the semi-crystalline polymers and are thus ideal to evaluate the proposed ageing mechanisms. We have therefore studied an epoxy resin (CY1301) under both uniform field and high divergent field conditions. Uniform field conditions were used to gain baseline characteristics for the properties of the unaged epoxy resin, and also for the effects of electrical ageing in low fields. Studies in high divergent fields were made using an electrode arrangement adapted from that of [6]. A number of wires set approximately 0.5mm apart were embedded, parallel to the flat faces, in thin (290 m ) flat samples. The radius of the wires ranged from 5 m (gold plated tungsten) to 25 m (tungsten).  Relatively small voltages applied to the wires (5 kV DC) therefore produced local fields up to 170 kV\/mm depending upon the wire radius chosen. These field levels are high enough to inject space-charge [6] without leading to instantaneous failure. This geometry, therefore, may both inject charge and simulate local stress enhancements arising from charge accumulation. The number of wires is large (30) so that the volume affected is big enough to allow changes on ageing to be detectable.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPost-print<\/dc:description><dc:description>\n8th International Conference on Dielectric Materials, Measurements and Applications, Heriot Watt University, Edinburgh, Scotland.<\/dc:description><dc:date>\n2012-01-18T10:53:34Z<\/dc:date><dc:date>\n2012-01-18T10:53:34Z<\/dc:date><dc:date>\n2000<\/dc:date><dc:date>\n2000-09-21<\/dc:date><dc:date>\n2000-09-17<\/dc:date><dc:type>\nConference Paper<\/dc:type><dc:identifier>\n8th International Conference on Dielectric Materials, Measurements and Applications, 2000 (473), pp. 88-93.<\/dc:identifier><dc:identifier>\n0-85296-730-6<\/dc:identifier><dc:identifier>\n0537-9989<\/dc:identifier><dc:identifier>\nhttp:\/\/ieeexplore.ieee.org\/xpl\/mostRecentIssue.jsp?asf_arn=null&asf_iid=null&asf_pun=7124&asf_in=null&asf_rpp=null&asf_iv=null&asf_sp=null&asf_pn=1<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/10023<\/dc:identifier><dc:identifier>\n10.1049\/cp:20000483<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nCopyright © IEE 2000.<\/dc:rights><dc:publisher>\nInstitution of Electrical Engineers<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0537-9989","issn:0537-9989"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2000,"topics":["SPACE CHARGES","MODEL"],"subject":["Conference Paper"],"fullText":"CHARGE INJECTION, ELECTROLUMINESCENCE, AND AGEING OF AN EPOXY RESIN IN HIGH \nDIVERGENT FIELDS \n \n \nV. Griseri*, K. Fukunaga+, C. Laurent, # D. Mary#, L.A. Dissado*, J.C. Fothergill* \n \n*University of Leicester, UK, + Communications Research Laboratory, Japan, # University Paul Sabatier, France \n \n \n \nINTRODUCTION \nMost experimental studies of electrical ageing have \nconcentrated on semi-crystalline polymers such as those \nused in cable insulation and capacitors (see for example \n[1]). Theoretical models [2-4] for electrical ageing have \nbeen developed on the basis of these studies. The \nconsensus is that ageing involves the formation of low-\ndensity regions, though the mechanisms responsible are \ndisputed. For example, bond scission by high-energy \nelectrons [2,5], and mechanical deformation have both \nbeen suggested. Both of these mechanisms are related to \ncharge injection and the subsequent formation of high \nlocal fields. The semi-crystalline polymers studied so \nfar have similar chemistries and almost identical mor-\nphologies. They tend, therefore, to show many similari-\nties in, for example, the size of the energy barriers for \nthe ageing reaction, critical ageing levels, and field \ndependence of ageing [4]. These similarities make it \ndifficult to discriminate between mechanisms. Epoxy \nresins, however, are network polymers with a different \nmolecular chemistry to that of the semi-crystalline \npolymers and are thus ideal to evaluate the proposed \nageing mechanisms. We have therefore studied an \nepoxy resin (CY1301) under both uniform field and \nhigh divergent field conditions. Uniform field condi-\ntions were used to gain baseline characteristics for the \nproperties of the unaged epoxy resin, and also for the \neffects of electrical ageing in low fields. Studies in high \ndivergent fields were made using an electrode arrange-\nment adapted from that of [6]. A number of wires set \napproximately 0.5mm apart were embedded, parallel to \nthe flat faces, in thin (∼290 µm ) flat samples. The \nradius of the wires ranged from 5 µm (gold plated \ntungsten) to 25 µm (tungsten).  Relatively small volt-\nages applied to the wires (≤5 kV DC) therefore pro-\nduced local fields up to 170 kV\/mm depending upon the \nwire radius chosen. These field levels are high enough \nto inject space-charge [6] without leading to instantane-\nous failure. This geometry, therefore, may both inject \ncharge and simulate local stress enhancements arising \nfrom charge accumulation. The number of wires is large \n(∼30) so that the volume affected is big enough to allow \nchanges on ageing to be detectable. \n \n \nEXPERIMENTAL INVESTIGATIONS \nDielectric Response \nThe dielectric response of the epoxy exhibited a glass \ntransition just below 40 ˚C [7]. At this temperature and \nabove a loss peak was observed at low frequencies that \nmerged into a power law response at higher frequencies \nand eventually into a high frequency loss peak at \n∼3 105Hz.  A dc conductivity masking the low fre-\nquency side of the alpha peak was observed at T≥70 ˚C, \nfigure 1. An Arrhenius plot of the low frequency peak \nshow the approach to zero frequency typical of the \nalpha response of a glass transition, figure 2. The power \nlaw response is less clear-cut as it is partially obscured \nby the two peaks surrounding it. Ageing in uniform field \nprogressively reduced the power law component, figure \n3a. A similar reduction of the loss component C” in this \nfrequency region was found when the ageing was \ncarried out in divergent fields (7 days with –2 kV \napplied to 50 µm diameter tungsten wires), figure 3b. \nHere the dielectric measurement was carried out both \nbetween the two plane electrodes and between the wires \nand a plane electrode. The results differed only by a \nmultiplicative factor arising from the different geome-\ntries. \nCurrent-Voltage Measurements \nUniform Applied Fields. These measurements were \nperformed on samples 55 µm thick using a step ramp \ntechnique.  The dwell time was 300s on the ascending \nramp and 150s on the descending ramp. The current was \naveraged after the first 50s of the dwell time and was \nmeasured simultaneously with the electroluminescence \n(EL). The ascending ramp shows a linear I-E depend-\nence up to 140 kV\/mm, and thereafter a strongly field \ndependent current up to 300 kV\/mm.  In the experiment \nthe sample was cycled to progressively higher applied \nfields. It was noted that the current in the ohmic region \nvaried from cycle to cycle whereas that in the high field \nregion was effectively unchanged. Figure 4 shows the \ncurrent obtained on the final cycle. The high field \ncurrent could be described empirically by an E4 law, but \nit also fits an exponential dependence appropriate to \ncharge hopping between neutral traps, i.e. \n( ) ( )[ ]kTaeEkTaeEI −−∝ expexp , see figure 4. The \nestimated value of a is 0.52 nm, which is acceptable for \nthis kind of mechanism. The descending ramp shows a \nreverse current that changed sign below 220 kV\/mm, \nindicating the presence of a zero-field plane in the \ndielectric at and below these applied fields as a conse-\nquence of the strong charging occurring on the ramp-up. \nSpace Charge Measurements \nIn Uniform Applied Fields. The pulsed electro-\nacoustic (PEA) technique was used to measure the space \ncharge generated in the epoxy under uniform fields \napplied by brass electrodes.  The form of the space \ncharge distribution observed depended upon the dura-\ntion of the period of electric stress and the temperature.  \nUnder short term stressing (1-6h) at room temperature \n(~25˚C) a field of ≥18 kV\/mm was required before \ncharge injection could be identified via the formation of \nhomocharges near the electrodes, figure 5. Homo space-\ncharge was also, however, produced by prolonged \nstressing (1day to 2 weeks) at lower fields, e.g. \n7kV\/mm. A similar behaviour was obtained at 35 ˚C, \nfigure 6.  At temperatures of 40 ˚C and above any space \ncharge produced by prolonged stressing at low fields \nwas obscured by the polarisation charges on the elec-\ntrodes. \nIn Divergent Applied Fields. These samples were first \nmeasured at room temperature with 0.67 kV applied \nbetween the plane electrodes with the wires floating, \nfigure 7a. No signal was observed from parts of the \nsamples that contained no wires but a weak peak \n(approx. -0.5 C\/m3 ) was obtained around the region of \nthe wires. A sample was then stressed by applying 1.5 \nkV to the wires for 1 week at 33 ˚C. The voltage was \nremoved and the sample measured at 33 ˚C.  A positive \nsignal was observed across most of the sample rising to \na peak of ∼0.75 C\/m3 close to the wires, figure 7b. The \nsignal persisted for at least 90 min at 33 ˚C.  This result \nis consistent with the injection of positive charge from \nthe wires that are retained in deep traps [8]. The contri-\nbution of a polarisation gradient [9] to the effective \ncharge would be expected to give a similar signal but it \nshould decay rapidly as the polarisation relaxed. \nElectroluminescence Measurements \nIn Uniform Applied Fields. These were measured \nsimultaneously with the charging and discharging \ncurrents. Continuous EL was observed to occur above –\n150 kV\/mm dc when ramping up. When the voltage was \nramped down EL ceased at –250 kV\/mm dc, figure 8.  \nIn Divergent Applied Fields. In the first instance a \nsquare voltage pulse of duration of 100 ms to 60 s was \napplied to the sample. Electroluminescence was ob-\nserved at the beginning and end of the pulse if an onset \nvoltage is exceeded, figure 9. The onset voltage ∼400-\n500V corresponds to a field of 22-27 kV\/mm if the \nwires are assumed to lie exactly in a plane midway \nthrough the sample. Continuous electroluminescence \nwas not observed in these experiments even at the \nhighest fields reached of 160 kV\/mm. No appreciable \npolarity effect was found. A second set of experiments \nwas carried out in which a train of positive probe pulses \nwas applied following a negative polarisation pulse. The \nprobe voltage level was chosen so that it did not excite \nany luminescence by itself. The delay time between the \npolarisation pulse and the 1st probe was varied with a \nminimum of 1 s. The repetition frequency of the probe \npulses was also varied, but this parameter was not \ninfluential and most of the results were obtained by \nusing a frequency of 1Hz. The luminescence intensity \ndetected decreased throughout the sequence of probe \npulses following on from the initial polarisation pulse. \nIn these experiments the probe pulses detected lumines-\ncence up to several seconds after polarisation. A large \nscatter about a typical mean value of 60 s was observed \nwith extremes of 35 s and 80 s.  The period over which \nluminescence is detected (‘decay’ time) can be taken to \nbe the time required for the space charge to reduce to a \nlevel below which it is incapable of exciting lumines-\ncence centres to a detectable extent. This interpretation \nis valid as long as the probe pulses themselves do not \naffect the amount of space charge existing at the time of \ntheir application.  In order to check that this is indeed \nthe case the delay time between the polarisation pulse \nand the 1st probe pulse was varied over the range 1 s to \n16 s.  The EL measured by the 1st probe pulse decreased \n(approximately exponentially with time) but the time for \nthe EL to decay (i.e. decay time) was not altered appre-\nciably. This indicates that the probe pulses did indeed \nact as true probes for the space charge field. No appre-\nciable effect on the ‘decay’ time was observed when the \npolarisation pulse was varied in magnitude (from 2 to \n2.8 kV) and duration (from 100ms to 60 s). This indi-\ncates that the process of charge injection and accumula-\ntion in the vicinity of the wires is saturated in a time less \nthan 100 ms, and that the field dependence of charge \ninjection is not very strong at these levels (108 to 150 \nkV\/mm). This is in agreement with other workers [8]. It \nwas also noted that EL was observed on the first two \nprobe pulses even when the voltage of the polarisation \npulse was set below the EL threshold of 500 V.  This \nobservation demonstrates that charge injection can \noccur without detectable EL, but its presence can be \nrevealed when the probe pulse increases the local field. \nThe need to increase the local field through the opposite \npolarity pulse implies that a true threshold field is \nrequired in order to generate EL in this case.  \nDISCUSSION \nThe PEA technique has shown that short-time space \ncharge injection occurs in uniform applied fields above \n18 kV\/mm and in divergent fields of at least 52 kV\/mm \n(at the wire) over a period of time. This latter measure-\nment could be attributed to a positive polarisation \ngradient around the wires, however, the dielectric \nresponse shows that any polarisation should have \nrelaxed within a few seconds, whereas the positive PEA \nsignal has not decayed even 90 minutes after voltage \nremoval. The signal therefore appears to be due to \ninjected positive charge. This is confirmed by the \ntransient EL data in divergent fields, for which the onset \nthreshold field of 22-27 kV\/mm correlates well with that \nfound for injection in the PEA experiments.  \n \nThese experiments also show that the common assump-\ntion that uniform field injection occurs at low fields \nbecause of local stress enhancing features on the elec-\ntrode surfaces is not applicable in this case unless the \ninjecting features are smaller in size than the 5 µm wire \nradius, e.g. crystalline boundary edges. Because of the \npresence of space charge at low fields we would expect \nto find a non-ohmic I-E dependence above 18 kV\/mm in \nuniform fields. This is not the case. When the high-\ntemperature low-field (3.5 V\/mm) conductivity deter-\nmined from the dielectric response is extrapolated to \nT=24 ˚C (activation energy = 1.6 eV) it yields a value \n(2.2 10-16 S\/m) close to that found for fields up to \n140kV\/mm (i.e. ∼ 5.2 10-17 S\/m). This implies that space \ncharge injection does not modify the conductivity very \nmuch in the experiments performed at uniform fields up \nto ~140 kV\/mm. The high activation energy for the \nlinear conductivity indicates that charge transport is \ndominated by hopping between neutral deep traps. \nHence, in the thin samples, injected charge may be \ntrapped close to the electrodes to form a virtual elec-\ntrode during the dwell time at a given voltage. The \ndielectric thickness would then be reduced slightly \ngiving an actual electric field that would be slightly \nhigher than the applied field but still uniform.  \n \nA possible explanation of the transient EL observed in \ndivergent fields lies with the excitation of luminescence \ncentres by inelastic scattering of the injected carriers up \nto the point where a sufficient amount of charges have \nbeen trapped in the vicinity of the wire to counterbal-\nance the injecting field. On depolarisation the field at \nwires has the same magnitude as the applied injecting \nfield but in the opposite direction. Consequently the \nsame EL excitation occurs on extraction and with \nessentially the same magnitude. The absence of con-\ntinuous dc EL is in accordance with a transient injection \nprocess limited by the space charge field. An alternative \nmechanism based on discharges in sub-micro sized \nmesovoids cannot be ruled out, however, without a \nspectral analysis of the EL emission. Conversely, a \ncontinuous EL emission is found for uniform applied \nfields above 160 kV\/mm. At these fields, different \ncontinuously operating excitation mechanisms can be \ninvoked e.g. charge packet generation leading to a \nrecombination front between positive and negative \ncharge carriers [10]. It is noteworthy that the EL onset-\ncorresponds to the change from the ohmic to the non-\nlinear regimes in the current measurements. This corre-\nlation has previously been reported for different poly-\nmeric materials submitted to a dc field [5]. It indicates \nthat the high-field conduction process drives the excita-\ntion of EL.  Our observation of an exponential field-\ndependence of the conductivity indicates a trap-to trap \nhopping mechanism for the mobile carriers that enables \nthe charge packet to advance in the form of an ionisa-\ntion front [11].  Further work is, however, needed to \ndetermine the details of the relationship between current \nand EL in epoxy resins.  \n \nThe maximum applied field achieved so far in the \ndivergent field geometry only just reaches the onset \nvalue for continuous EL in uniform applied fields and \ndoes not generate continuous EL.  Transient electrolu-\nminescence is, however, observed on polarisation and \ndepolarisation at fields above an onset value. The results \nof the probe-pulse experiments indicate that even below \nthe onset field for transient luminescence, the applied \nvoltage generates space charge. At these fields the PEA \nexperiments show that some space charge can be gener-\nated given sufficient time. These charges can produce \nluminescence when a sufficiently large pulse of oppo-\nsite polarity is applied. It is noticeable that lumines-\ncence occurs when the sum of the polarisation voltage \nand the probe voltage is sufficient to exceed the EL \nonset field found in the single pulse experiments. The \nquantity of charges available to produce luminescence \ndecays rapidly with time (time constant ~ 10.5 s). It \ntherefore appears that the charges have a non-radiative \nform of neutralisation, with luminescence only occur-\nring when the local field exceeds a level sufficient for \nrapid charge injection or extraction. These results \nassociate the luminescence with charges possessing a \nhigh kinetic energy, i.e. those charges that initiate EL \nvia inelastic scattering. In lower fields extraction or \nnon-radiative recombination can proceed without \nluminescence. This would be consistent with the obser-\nvation that the onset fields and field dependence of \nelectroluminescence are the same for the polarisation \nand depolarisation transients in both positive and \nnegative polarity. \n \nThe evidence for ageing under the influence of electric \nfields high enough to inject space charge comes from \ntwo directions. In the first instance there is reduction of \nthe intermediate power law response in the dielectric \nresponse. The epoxy used was cured at room tempera-\nture and thus had a Tg about 10 °C lower than if it had \nbeen post-cured at high temperature. However, the \nchange cannot be assigned to a global increase of Tg by \nadditional cross-linking, as the alpha-response is not \naffected. Power law dielectric responses have been \nassociated with a hierarchy of relaxing dipoles embed-\nded within one another in a self-similar form (e.g. see \n[12]). Fragmentation of such a hierarchy such as to \nreduce the number of embeddings, will reduce the \nfrequency range of the power law dependence. The \nremoval of this response on ageing would thus be \nattributable to a fragmentation of the self-similar sys-\ntem; probably by additional cross-linking which would \nbreak connections in the hierarchy of relaxations. The \nsecond instance of ageing relates to charge injection on \nlong time exposure to fields below the short-time onset \nthreshold.  It is not clear what is happening here, except \nthat the factors influencing charge injection are being \naltered over a period of time. Possibly ionically dissoci-\nated species migrate slowly to the electrode in the \nelectric field and produce heterocharge that eventually \nbuilds up sufficiently to induce homocharge injection. A \nprocess like this can also be expected to cause material \nchanges over a long period of stressing in consequence \nof injection currents and local field modification.  The \nchanges in the ohmic current that are observed during \nvoltage cycling may provide further evidence that \nchanges are introduced by exposure to high fields. A \nsystematic investigation is, however, required in order \nto verify this effect. \nCONCLUSIONS \n• Charge injection in both uniform and divergent \nfields has been observed. The onset field for injec-\ntion in both cases is essentially the same and equal \nto the onset field for transient electroluminescence.  \n• Charge injection at these fields has been shown to \nreduce the response of certain set of re-orientable \ndipoles in the epoxy resin.  \n• Long term stressing at lower fields can lead to \ncharge injection even at fields below the onset \nthreshold for short-term injection and electrolumi-\nnescence.  \n• A high field conduction process involving trap-to \ntrap hopping is associated with continuous EL. \nACKNOWLEDGMENTS \nThe authors would like to thank Dr. J. Alison (King’s \nCollege London), Prof. J. Champion and Dr. S. Dodd \n(London Guildhall University) for their useful discus-\nsions and practical assistance. \nREFERENCES \n1. J-L Parpal, J.P.Crine, C.Dang, 1997, IEEE Trans. \nDiel.&EI-4, 197-209 \n2. J.P.Crine, 1997,IEEE Trans. Diel. & EI- 4, 487-495 \n3. T.J.Lewis, J.P.Llewellyn, M.van der Sluijs, \nR.N.Hampton, 1996, IEE Conf. Pub. 430, 220-224 \n4. L.A.Dissado, G.Mazzanti, G.C.Montanari, 1997, \nIEEE Trans Diel.& EI-4, 496-506 \n5. D.Mary, C.Albertini, C.Laurent, J.Phys.D., 1997, \nAppl.Phys., 30, 171-184 \n6. O.Naz, J.Lewiner, T.Ditchi, C.Alquie, 1998, IEEE \nTrans. Diel. & EI-5, 2-8  \n7. J.V.Champion, S.J.Dodd, J.Alison, and L.Askew, \n1998, Proc.IEEE 6th Int.Conf.Cond. & Breakdown in \nSolid Dielectrics, 321- 324 \n8. L.A.Dissado, O.Paris, T.Ditchi, C.Alquie, and \nJ.Lewiner, 1999, Ann. Rep.CEIDP, 23-26. \n9  A.De Reggi , B.Dickens, T.Ditchi, C.Alquie, \nJ.Lewiner, I.K.Lloyd, J.Appl.Phys.,1992, 71, 854-\n863. \n10. J.L.Augé, C.Laurent, G.C. Montanari, D.Fabiani, \n1999, Ann. Rep. CEIDP, 564-567 \n11. K.Kaneko, T.Mizutani, Y.Suzuoki,, 1999, IEEE \nTrans. Diel. & EI, 6, 152-158. \n12. R.M.Hill, L.A.Dissado, R.R.Nigmatullin, 1991, \nJ.Phys.Cond.Mat., 3, 9773-9790 \n \n Figure 1. Dielectric response measured for a range of \ntemperatures. \n \nFigure 2. Arrhenius plots of the relative position of the \nalpha dielectric response ▲ (Right Hand Scale)  and the \nconductance ■ (Left Hand Scale) \n \nFigure 3(a) Dielectric response of epoxy resin at 40 ˚C \nbefore and after ageing in a uniform field \n(72h\/34.5kV\/mm at 35 ˚C + 47h\/51.7kV\/mm at 40˚C; \nsecond curve for additional 47h\/51.7kV\/mm at 40˚C) \n \nFigure 3(b) As Fig. 3(a) but in a divergent field at 20˚C. \n \nFigure 4. I-E plot for the ascending ramp ▽. Continuous \nline, power law fit, crosses (+) exponential fit  \n \nFigure 5. Space charge distribution measured following \nvoltage removal after 1h under a uniform applied field \nof 18kV\/mm at room temperature. Horizontal scale is \ntime in ns and converts to distance on multiplying by \nacoustic velocity. The times at which measurements are \nmade after voltage-removal are shown inset. \n \nFigure 6. Space charge distribution observed on voltage \nremoval after a polarisation time of 42h under a uniform \napplied field of 7kV\/mm at 35˚C. Horizontal scale is \ntime in ns and converts to distance by multiplying by \nthe acoustic velocity. \n \nFigure 7(a) Space charge distribution obtained by \napplying 0.67kV between the plane electrodes with the \nwires floating. \n \nFigure 7(b).Space charge distribution measured at 33˚C \nfollowing 2 weeks with 1.5kV applied to the 25µm \ndiameter gold plated tungsten wires at 33 ˚C. Left hand \nscale gives the charge density and the right hand scale \nthe derived field. \n \nFigure 8. Electroluminescence counts as a function of \nfield during ramp-up ▽ and ramp-down ▼. Noise level \n= 2 counts. \n \nFigure 9. Electroluminescence counts. Positive pulses \n(•), and negative pulses (6). \n \n"}