{"doi":"10.1057\/kmrp.2010.8","coreId":"215861","oai":"oai:eprints.lse.ac.uk:29839","identifiers":["oai:eprints.lse.ac.uk:29839","10.1057\/kmrp.2010.8"],"title":"Knowledge management technology-in-practice: a social constructionist analysis of the introduction and use of knowledge management systems","authors":["Venters, Will"],"enrichments":{"references":[{"id":17305632,"title":"A confessional account of an ethnography about knowledge work.&quot;","authors":[],"date":"2000","doi":"10.2307\/3250978","raw":"Schultze, U. (2000). &quot;A confessional account of an ethnography about knowledge work.&quot; MIS Quarterly 24(1): 3-41.","cites":null},{"id":17305580,"title":"Action research and the generation of knowledge.&quot;","authors":[],"date":"1993","doi":"10.1177\/001872679304601105","raw":"Gustavsen, B. (1993). &quot;Action research and the generation of knowledge.&quot; Human Relations 46(11): 1361-1365.","cites":null},{"id":17305615,"title":"Affordance, Conventions, and Design.&quot;","authors":[],"date":"1999","doi":"10.1145\/301153.301168","raw":"Norman, D. (1999). &quot;Affordance, Conventions, and Design.&quot; Interactions ACM 6(3): 38-43.","cites":null},{"id":17305591,"title":"Affordances, Motivation, and the Design of User Interfaces.&quot;","authors":[],"date":"2000","doi":"10.1145\/345124.345141","raw":"Karat, J., C.-M. Karat, et al. (2000). &quot;Affordances, Motivation, and the Design of User Interfaces.&quot; Communications of the ACM 43(8): 49-51.","cites":null},{"id":17305575,"title":"An interview with Eric Trist, father of the sociotechnical systems approach.&quot;","authors":[],"date":"1990","doi":"10.1177\/0021886390262014","raw":"Fox, W. (1990). &quot;An interview with Eric Trist, father of the sociotechnical systems approach.&quot; The Journal of Applied Behavioural Science 26(11): 259-279.","cites":null},{"id":17305561,"title":"At the Crossroads of Knowledge Management and Social Software.&quot;","authors":[],"date":"2006","doi":null,"raw":"Avram, G. (2006). &quot;At the Crossroads of Knowledge Management and Social Software.&quot; Electronic Journal of Knowledge Management 4(1): 1-10.","cites":null},{"id":17305583,"title":"Back to the future for KM: the case for sensible organisation.&quot;","authors":[],"date":"2008","doi":"10.1057\/palgrave.kmrp.8500158","raw":"Hasan, H. (2008). &quot;Back to the future for KM: the case for sensible organisation.&quot; Knowledge Management Research and Practice 6(1): 26-30.","cites":null},{"id":17305577,"title":"Back to the future: From knowledge management to data management.","authors":[],"date":"2001","doi":"10.1007\/bf02683507","raw":"Galliers, B. and S. Newell (2001). Back to the future: From knowledge management to data management. The 9th European Conference on Information Systems, Bled, Slovenia, Moderna Obganizacija,.","cites":null},{"id":17305627,"title":"Building Social Identity through Blogging. Exploring Virtuality Within and Beyond Organisations.","authors":[],"date":"2008","doi":null,"raw":"Pluempavarn, P. and N. Panteli (2008). Building Social Identity through Blogging. Exploring Virtuality Within and Beyond Organisations. N. Panteli. Basingstoke,UK, Palgrave Macmillan.","cites":null},{"id":17305579,"title":"Codifying collaborative knowledge: Using Wikipedia as a basis for automated ontology learning.&quot;","authors":[],"date":"2009","doi":"10.1057\/kmrp.2009.14","raw":"Gou, T., D. Schwartz, et al. (2009). &quot;Codifying collaborative knowledge: Using Wikipedia as a basis for automated ontology learning.&quot; Knowledge Management Research and Practice 7(3): 206-217.","cites":null},{"id":17305582,"title":"Communities of Practice: Fostering Peer-to-Peer Learning and Informal Knoweldge Sharing in the workplace.","authors":[],"date":"2009","doi":"10.1002\/asi.21208","raw":"Hara, N. (2009). Communities of Practice: Fostering Peer-to-Peer Learning and Informal Knoweldge Sharing in the workplace. Berlin, Springer-Verlag.","cites":null},{"id":17305673,"title":"Cultivating Communities of Practice.","authors":[],"date":"2002","doi":"10.5465\/amle.2009.41788855","raw":"Wenger, E., R. McDermott, et al. (2002). Cultivating Communities of Practice. Boston, Massachusetts, Harvard Business School Press.","cites":null},{"id":17305667,"title":"Degenerative structures that inhibit the emergence of communities of practice: a case study of knowledge management in the British Council.&quot;","authors":[],"date":"2007","doi":"10.1111\/j.1365-2575.2007.00247.x","raw":"Venters, W. and B. Wood (2007). &quot;Degenerative structures that inhibit the emergence of communities of practice: a case study of knowledge management in the British Council.&quot; Information Systems Journal 17(4): 349-368.","cites":null},{"id":17305671,"title":"Doing interpretive research.&quot;","authors":[],"date":"2006","doi":"10.1057\/palgrave.ejis.3000589","raw":"Walsham, G. (2006). &quot;Doing interpretive research.&quot; European Journal of Information Systems 15(3): 320-330. Wenger, E. (1998). Communities of practice : Learning, meaning and identity. Cambridge, Cambridge University Press.","cites":null},{"id":17305593,"title":"Epistemic Cultures: How the sciences make knowledge.","authors":[],"date":"1999","doi":"10.2307\/2653984","raw":"Knorr-Cetina, K. (1999). Epistemic Cultures: How the sciences make knowledge. Cambridge, MA, Harvard University Press.","cites":null},{"id":17305636,"title":"Evolution in the ontology-based knowledge management systems.","authors":[],"date":"2002","doi":"10.1007\/3-540-36124-3_75","raw":"Stojanovic, N., L. Stojanovic, et al. (2002). Evolution in the ontology-based knowledge management systems. European Conference on Information Systems, Gdansk, Poland.","cites":null},{"id":17305569,"title":"Exploring the Reality of Knowledge Management Systems: A Case Study.","authors":[],"date":"2002","doi":null,"raw":"Butler, T. (2002). Exploring the Reality of Knowledge Management Systems: A Case Study. The Third European Conference on Organisational Knowledge, Learning and Capabilities, Athens.","cites":null},{"id":17305590,"title":"Farewell to constructivism: technology and context-embedded action.","authors":[],"date":"2004","doi":null,"raw":"Kallinikos, J. (2004). Farewell to constructivism: technology and context-embedded action.  The Social Study of Information and Communication Technology: Innovation, Actors and Contexts. C. Avgerou, C. Ciborra and F. Land. Oxford, Oxford University Press.","cites":null},{"id":17305665,"title":"Guest Editorial: To codify or collaborate -Introduction to the special issue on Knowledge Management and e-Research technologies.&quot;","authors":[],"date":"2009","doi":"10.1057\/kmrp.2009.20","raw":"Venters, W. and E. Ferneley (2009). &quot;Guest Editorial: To codify or collaborate -Introduction to the special issue on Knowledge Management and e-Research technologies.&quot; Knowledge Management Research and Practice 7(3): 192-195.","cites":null},{"id":17305576,"title":"Implicit Knowledge.&quot;","authors":[],"date":"2008","doi":"10.1057\/palgrave.kmrp.8500168","raw":"Frappaolo, C. (2008). &quot;Implicit Knowledge.&quot; Knowledge Management Research and Practice 6(1): 23-25.","cites":null},{"id":17305609,"title":"Integrating knowledge management technologies in organizational business processes: getting real time enterprises to deliver real business performance.&quot;","authors":[],"date":"2005","doi":"10.1108\/13673270510582938","raw":"Malhotra, Y. (2005). &quot;Integrating knowledge management technologies in organizational business processes: getting real time enterprises to deliver real business performance.&quot; Journal of Knowledge Management 9(1): 7-28. Milton, N., N. Shadbolt, et al. (1999). &quot;Towards a knowledge technology for knowledge management.&quot; International Journal of Human Computer Studies 51(3): 615-64.","cites":null},{"id":17305592,"title":"Internal Consultation Paper: Action to promote knowledge sharing in the British Council.","authors":[],"date":"1999","doi":null,"raw":"Khalid, M. and E. Marsden (1999). Internal Consultation Paper: Action to promote knowledge sharing in the British Council. Manchester, British Council.","cites":null},{"id":17305668,"title":"Interpreting Information Systems in Organizations.","authors":[],"date":"1993","doi":"10.2307\/2584090","raw":"Walsham, G. (1993). Interpreting Information Systems in Organizations. Chichester, Wiley.","cites":null},{"id":17305669,"title":"Interpretive case studies in IS research: nature and method.&quot;","authors":[],"date":"1995","doi":"10.1057\/ejis.1995.9","raw":"Walsham, G. (1995). &quot;Interpretive case studies in IS research: nature and method.&quot; European Journal of Information Systems 4(2): 74-81.","cites":null},{"id":17305631,"title":"Investigating the Contradictions in Knowledge Management.","authors":[],"date":"1998","doi":null,"raw":"Schultze, U. (1998). Investigating the Contradictions in Knowledge Management. IFIP WG8.2 & WG8.6 Joint Working Conference on Information Systems: Current Issues and Future Changes, Helsinki, Finland, Omnipress, Wisconsin, USA.","cites":null},{"id":17305586,"title":"IT to support knowledge sharing in communities, towards a social capital analysis.&quot;","authors":[],"date":"2006","doi":"10.1057\/palgrave.jit.2000053","raw":"Huysman, M. and V. Wulf (2006). &quot;IT to support knowledge sharing in communities, towards a social capital analysis.&quot; Journal of Information Technology 21: 40-51.","cites":null},{"id":17305634,"title":"Knowing what you don't know? Discourses and Contradictions in Knowledge Management Research.&quot;","authors":[],"date":"2004","doi":"10.1111\/j.1467-6486.2004.00444.x","raw":"Schultze, U. and C. Stabell (2004). &quot;Knowing what you don't know? Discourses and Contradictions in Knowledge Management Research.&quot; Journal of Management Studies 41(4): 549-573.","cites":null},{"id":17305663,"title":"Knowledge about Sustainability: SSM as a Method for Conceptualising the UK Construction Industry's Knowledge Environment.&quot;","authors":[],"date":"2005","doi":"10.2498\/cit.2005.02.05","raw":"Venters, W., T. Cornford, et al. (2005). &quot;Knowledge about Sustainability: SSM as a Method for Conceptualising the UK Construction Industry's Knowledge Environment.&quot; Journal of Computing and Information Technology 13(2): 137-148.","cites":null},{"id":17305567,"title":"Knowledge and Organization: A Social-Practice Perspective.&quot;","authors":[],"date":"2001","doi":"10.1287\/orsc.12.2.198.10116","raw":"Brown, J. S. and P. Duguid (2001). &quot;Knowledge and Organization: A Social-Practice Perspective.&quot; Organization Science 12(2): 198-213.","cites":null},{"id":17305635,"title":"Knowledge Discourses and Information Technologies.","authors":[],"date":"2002","doi":null,"raw":"Sørensen, C. (2002). Knowledge Discourses and Information Technologies. 35th Hawaii International Conference on Systems Sciences, Hawaii, IEEE.","cites":null},{"id":17305674,"title":"Knowledge management and IT: How are they related?&quot;","authors":[],"date":"1999","doi":null,"raw":"Wilson, L. T. and C. Snyder (1999). &quot;Knowledge management and IT: How are they related?&quot; IEEE IT Professional 1(2): 73-75.","cites":null},{"id":17305637,"title":"Knowledge Management Initiatives: Learning from Failure.&quot;","authors":[],"date":"2000","doi":"10.1108\/13673270010372279","raw":"Storey, J. and E. Barnett (2000). &quot;Knowledge Management Initiatives: Learning from Failure.&quot; Journal of Knowledge Management 4(2): 145-156.","cites":null},{"id":17305629,"title":"Knowledge Management Strategies: A Handbook of Applied Technologies.","authors":[],"date":"2008","doi":"10.4018\/978-1-59904-603-7","raw":"Russ, M., M. Lytras, et al. (2008). Knowledge Management Strategies: A Handbook of Applied Technologies. Hershey, PA, USA IGI Publishing.","cites":null},{"id":17305573,"title":"Knowledge management strategies: Toward a taxonomy.&quot;","authors":[],"date":"2001","doi":null,"raw":"Earl, M. (2001). &quot;Knowledge management strategies: Toward a taxonomy.&quot; Journal of Management Information Systems 18(1): 215-233.","cites":null},{"id":17305633,"title":"Knowledge management technology and the reproduction of knowledge work practices.&quot;","authors":[],"date":"2000","doi":"10.1016\/s0963-8687(00)00043-3","raw":"Schultze, U. and R. J. Boland (2000). &quot;Knowledge management technology and the reproduction of knowledge work practices.&quot; Journal of Strategic Information Systems 9(2-3): 193-212.","cites":null},{"id":17305670,"title":"Knowledge Management: The Benefits and Limitations of Computer Systems.&quot;","authors":[],"date":"2001","doi":null,"raw":"Walsham, G. (2001). &quot;Knowledge Management: The Benefits and Limitations of Computer Systems.&quot; European Management Journal 19(6): 599-608.","cites":null},{"id":17305661,"title":"Knowledge Management: The fad that forgot technology.","authors":[],"date":"2006","doi":null,"raw":"Venters, W. (2006a). Knowledge Management: The fad that forgot technology. International Conference on Organizational Learning, Knowledge and Capabilities (OLKC). Warwick, UK.","cites":null},{"id":17305638,"title":"Knowledge management: The next fad to forget people?","authors":[],"date":"1999","doi":null,"raw":"Swan, J., H. Scarbrough, et al. (1999). Knowledge management: The next fad to forget people?  7th European Conference on Information Systems, Copenhagen, Denmark.","cites":null},{"id":17305585,"title":"Many rivers to cross: from ICT to knowledge management systems.&quot;","authors":[],"date":"2001","doi":"10.1080\/02683960110054799","raw":"Hendriks, P. (2001). &quot;Many rivers to cross: from ICT to knowledge management systems.&quot; Journal of Information Technology 16(2): 57-72. Hutchby, I. (2001). &quot;Technologies, Texts and Affordances.&quot; Sociology 35(2): 441-456.","cites":null},{"id":17305621,"title":"Material knowing: the scaffolding of human knowledgeability.&quot;","authors":[],"date":"2006","doi":"10.1057\/palgrave.ejis.3000639","raw":"Orlikowski, W. (2006). &quot;Material knowing: the scaffolding of human knowledgeability.&quot; European Journal of Information Systems 15(5): 460-466.","cites":null},{"id":17305607,"title":"Materiality and change: Challenges to building better theory about technology and organizing &quot;","authors":[],"date":"2008","doi":"10.1016\/j.infoandorg.2008.03.001","raw":"Leonardi, P. and S. Barley (2008). &quot;Materiality and change: Challenges to building better theory about technology and organizing &quot; Information and organisation 18(3): 159-176.","cites":null},{"id":17305664,"title":"Motility Of Practiced Knowledge: An Exploration Within The UK Construction Industry. Organisational Knowledge, Learning and Capabilities,","authors":[],"date":"2003","doi":null,"raw":"Venters, W., M. Cushman, et al. (2003). Motility Of Practiced Knowledge: An Exploration Within The UK Construction Industry. Organisational Knowledge, Learning and Capabilities, Barcelona, Spain.","cites":null},{"id":17305594,"title":"Negotiating mutually satisfying IS action research topics with organisations: and analysis of Rapoport's initiative dilemma.&quot;","authors":[],"date":"1997","doi":"10.1108\/13665629710190059","raw":"Kock, N. (1997). &quot;Negotiating mutually satisfying IS action research topics with organisations: and analysis of Rapoport's initiative dilemma.&quot; Journal of Workplace Learning 9(7): 253-262.","cites":null},{"id":17305564,"title":"Of Bicycles, Bakerlites and Bulbs; Toward a theory of SocioTechnical Change.","authors":[],"date":"1995","doi":"10.2307\/3107114","raw":"Bijker, W. (1995). Of Bicycles, Bakerlites and Bulbs;  Toward a theory of SocioTechnical Change. Cambridge, MA, MIT Press.","cites":null},{"id":17305666,"title":"Organizational Knowledge, Learning and Capabilities in action:","authors":[],"date":"2005","doi":null,"raw":"Venters, W. and B. Wood (2005). Organizational Knowledge, Learning and Capabilities in action: The case of the British Council. The Sixth European Conference on Organizational Knowledge, Learning, and Capabilities, Bentley College, Boston,MA.","cites":null},{"id":17305619,"title":"Out of the Shadows: The Role of Human Agency in Technology. Sloan School of Management.","authors":[],"date":"1998","doi":null,"raw":"Orlikowski, W. (1998). Out of the Shadows: The Role  of Human Agency in Technology. Sloan School of Management. Cambridge, Massachusetts Institute of Technology.","cites":null},{"id":17305596,"title":"Pandora's Hope: Essays on the Reality of Science Studies.","authors":[],"date":"1999","doi":"10.2307\/2655272","raw":"Latour, B. (1999). Pandora's Hope: Essays on the Reality of Science Studies. Boston, MA, Harvard University Press.","cites":null},{"id":17305639,"title":"Placing Knowledge Management in Context.&quot;","authors":[],"date":"2004","doi":"10.1111\/j.1467-6486.2004.00451.x","raw":"Thompson, M. and G. Walsham (2004). &quot;Placing Knowledge Management in Context.&quot; Journal of Management Studies 41(5): 725-747. Tsoukas, H. (2005). Complex Knowledge: Studies in Organizational Epistemology. Oxford, Oxford University Presss.","cites":null},{"id":17305565,"title":"Power, Mastery and Organisational Learning.&quot;","authors":[],"date":"2000","doi":"10.1111\/1467-6486.00206","raw":"Blackler, F. and S. McDonald (2000). &quot;Power, Mastery and Organisational Learning.&quot; Journal of Management Studies 37(6): 833-851.","cites":null},{"id":17305587,"title":"Process to Product: Creating tools for knowledge management.&quot; Retrieved 13\/7\/1999, from www.brint.com\/members\/120205\/jackson\/.","authors":[],"date":"1999","doi":null,"raw":"Jackson, C. (1999). &quot;Process to Product: Creating tools for knowledge management.&quot; Retrieved 13\/7\/1999, from www.brint.com\/members\/120205\/jackson\/.","cites":null},{"id":17305559,"title":"Reflexive Methodology: New Vistas for Qualitative Research.","authors":[],"date":"2000","doi":"10.1177\/002194360203900107","raw":"Alvesson, M. and K. Skoldberg (2000). Reflexive Methodology: New Vistas for Qualitative Research. London, Sage Publications.","cites":null},{"id":17305624,"title":"Research Commentary: Desperately Seeking the &quot;IT&quot; in IT Research--A Call to Theorizing the IT Artifact.&quot;","authors":[],"date":"2001","doi":"10.1287\/isre.12.2.121.9700","raw":"Orlikowski, W. J. and C. S. Iacono (2001). &quot;Research Commentary: Desperately Seeking the &quot;IT&quot; in IT Research--A Call to Theorizing the IT Artifact.&quot; Information Systems Research 12(2): 121 -134.","cites":null},{"id":17305558,"title":"Review: Knowledge Management and Knowledge Management Systems: Conceptual Foundations and Research Issues.&quot;","authors":[],"date":"2001","doi":"10.2307\/3250961","raw":"Alavi, M. and D. Leidner (2001). &quot;Review: Knowledge Management and Knowledge Management Systems: Conceptual Foundations and Research Issues.&quot; MIS Quarterly 25(1): 107-136.","cites":null},{"id":17305584,"title":"Safe enclaves, political enclaves and knowledge work. Managing knowledge: critical investigations of work and learning.","authors":[],"date":"2000","doi":null,"raw":"Hayes, N. and G. Walsham (2000). Safe enclaves, political enclaves and knowledge work.  Managing knowledge: critical investigations of work and learning. C. Prichard, R. Hull, M. Chumer and H. Willmott. London, Macmillan: 69-87.","cites":null},{"id":17305602,"title":"Situated Learning: Legitimate Peripheral Participation.","authors":[],"date":"1991","doi":"10.1017\/cbo9780511815355","raw":"Lave, J. and E. Wenger (1991). Situated Learning: Legitimate Peripheral Participation. New York, Cambridge University Press.","cites":null},{"id":17305625,"title":"Social-embed-ness of EPR Systems in KM practice. IEEE Managing Technologically Driven Organisations: The human side of innovation and change.,","authors":[],"date":"2003","doi":"10.1109\/iemc.2003.1252227","raw":"Park, J.-H. and L. Hossain (2003). Social-embed-ness of EPR Systems in KM practice. IEEE Managing Technologically Driven Organisations: The human side of innovation and change., Albany, LA, IEEE International Engineering Management Conference.","cites":null},{"id":17305568,"title":"Sociological Paradigms and Organisational Analysis.","authors":[],"date":"1979","doi":"10.1177\/017084068200300409","raw":"Burrell, G. and G. Morgan (1979). Sociological Paradigms and Organisational Analysis. London, Heineman.","cites":null},{"id":17305622,"title":"Sociomaterial Practices: Exploring Technology at Work.&quot;","authors":[],"date":"2007","doi":"10.1177\/0170840607081138","raw":"Orlikowski, W. (2007). &quot;Sociomaterial Practices: Exploring Technology at Work.&quot; Organization Studies 28(9): 1435-1448.","cites":null},{"id":17305570,"title":"Soft Systems Methodology in Action.","authors":[],"date":"1990","doi":"10.1177\/135050769202300124","raw":"Checkland, P. and J. Scholes (1990). Soft Systems Methodology in Action. Chichester, John Wiley & Sons Ltd. Crotty, M. (1998). The Foundations of Social Research. London, Sage.","cites":null},{"id":17305571,"title":"Successful knowledge management projects.&quot;","authors":[],"date":"1998","doi":null,"raw":"Davenport, T., D. DeLong, et al. (1998). &quot;Successful knowledge management projects.&quot; Sloan Management Review 39(2): 43-59.","cites":null},{"id":17305672,"title":"Supporting communities of practice; a survey of communityoriented technologies.&quot; Retrieved","authors":[],"date":"2001","doi":null,"raw":"Wenger, E. (2001). &quot;Supporting communities of practice; a survey of communityoriented technologies.&quot;   Retrieved March, 2001, from http:\/\/www.ewenger.com\/tech\/.","cites":null},{"id":17305623,"title":"Technological Frames: Making Sense of Information Technology in Organizations.&quot;","authors":[],"date":"1994","doi":"10.1145\/196734.196745","raw":"Orlikowski, W. J. and D. C. Gash (1994). &quot;Technological Frames: Making Sense of Information Technology in Organizations.&quot; ACM Transactions on Information Systems 12(2): 669-702.","cites":null},{"id":17305613,"title":"The Design of Everyday Things.","authors":[],"date":"1990","doi":"10.2307\/3106094","raw":"Norman, D. (1990). The Design of Everyday Things. London, The MIT Press.","cites":null},{"id":17305618,"title":"The duality of technology: Rethinking the concept of technology in organisations.&quot;","authors":[],"date":"1992","doi":"10.1287\/orsc.3.3.398","raw":"Orlikowski, W. (1992). &quot;The duality of technology: Rethinking the concept of technology in organisations.&quot; Organisational Science 3(3): 398-426.","cites":null},{"id":17305578,"title":"The Ecological Approach to Perception.","authors":[],"date":"1979","doi":"10.1002\/bs.3830260313","raw":"Gibson, J. J. (1979). The Ecological Approach to Perception. London, Houghton Mifflin.","cites":null},{"id":17305651,"title":"The Introduction of Knowledge Management Technology within the British Council: An Action Research Study. Information Systems","authors":[],"date":"2003","doi":null,"raw":"Venters, W. (2003). The Introduction of Knowledge Management Technology within the British Council: An Action Research Study. Information Systems Institute. Salford, University of Salford: 375.","cites":null},{"id":17305611,"title":"The knowledge-creating company: how Japanese companies create the dynamics of innovation.","authors":[],"date":"1995","doi":"10.1016\/0024-6301(96)81509-3","raw":"Nonaka, I. and H. Takeuchi (1995). The knowledge-creating company: how Japanese companies create the dynamics of innovation. New York, Oxford University Press.","cites":null},{"id":17305626,"title":"The Mangle of Practice.","authors":[],"date":"1995","doi":"10.7208\/chicago\/9780226668253.001.0001","raw":"Pickering, A. (1995). The Mangle of Practice. Chicago, Chicago University Press.","cites":null},{"id":17305574,"title":"The Ontolingua Server: a tool for collaborative ontology construction.&quot;","authors":[],"date":"1997","doi":"10.1006\/ijhc.1996.0121","raw":"Farquhar, A., R. Fikes, et al. (1997). &quot;The Ontolingua Server: a tool for collaborative ontology construction.&quot; International Journal of Human-Computer Studies 46(6): 707-727.","cites":null},{"id":17305630,"title":"The Reflective Practitioner: How Professionals Think in Action.","authors":[],"date":"1982","doi":"10.2307\/2392894","raw":"Schön, D. (1982). The Reflective Practitioner: How Professionals Think in Action. New York, Basic Books.","cites":null},{"id":17305560,"title":"The Reflexive Thesis.","authors":[],"date":"1989","doi":"10.1086\/356102","raw":"Ashmore, M. (1989). The Reflexive Thesis. Chicago, The University of Chicago Press.","cites":null},{"id":17305604,"title":"The Reorganisation of the British Council: Management Improvisation and Policy Uncertainty.&quot;","authors":[],"date":"1995","doi":"10.1111\/j.1467-9299.1995.tb00832.x","raw":"Lee, J. M. (1995). &quot;The Reorganisation of the British Council: Management Improvisation and Policy Uncertainty.&quot; Public Administration 73(3): 339-355.","cites":null},{"id":17305562,"title":"The social construction of reality. London,","authors":[],"date":"1966","doi":"10.1177\/089692057300400113","raw":"Berger, P. and T. Luckmann (1966). The social construction of reality. London, Penguin  Books.","cites":null},{"id":17305566,"title":"The Social Life of Information.","authors":[],"date":"2000","doi":"10.5210\/fm.v5i4.736","raw":"Brown, J. S. and P. Duguid (2000). The Social Life of Information. Boston, Massachusetts, Harvard Business School Press.","cites":null},{"id":17305628,"title":"The Tacit Dimension.","authors":[],"date":"1967","doi":"10.1016\/b978-0-7506-9718-7.50010-x","raw":"Polanyi, M. (1967). The Tacit Dimension. New York, Doubleday.","cites":null},{"id":17305662,"title":"The use of Technology within Knowledge Management: A Review.&quot;","authors":[],"date":"2006","doi":"10.1515\/jisys.2006.15.1-4.329","raw":"Venters, W. (2006b). &quot;The use of Technology within Knowledge Management: A Review.&quot; Journal of Intelligent Systems 15(1-4): 329-356.","cites":null},{"id":17305675,"title":"Understanding computers and cognition.","authors":[],"date":"1986","doi":"10.1002\/bs.3830330107","raw":"Winograd, T. and F. Flores (1986). Understanding computers and cognition. Norwood,NJ, Ablex.","cites":null},{"id":17305620,"title":"Using Technology and Constituting Structures: A Practice Lens for Studying Technology in Organizations.&quot;","authors":[],"date":"2000","doi":"10.1287\/orsc.11.4.404.14600","raw":"Orlikowski, W. (2000). &quot;Using Technology and Constituting Structures: A Practice Lens for Studying Technology in Organizations.&quot; Organization Science 11(4): 404-428.","cites":null},{"id":17305563,"title":"Weaving the Web.","authors":[],"date":"1997","doi":null,"raw":"Berners-Lee, T. and M. Fischetti (1997). Weaving the Web. San Francisco,CA, Harper.","cites":null},{"id":17305595,"title":"What Firms do? Coordination, Identity and Learning.&quot;","authors":[],"date":"1996","doi":"10.1287\/orsc.7.5.502","raw":"Kogut, B. and U. Zander (1996). &quot;What Firms do? Coordination, Identity and Learning.&quot; Organization Science 7(5): 502-520.","cites":null},{"id":17305617,"title":"What is Web 2.0: Design Patterns and Business Models for the Next Generation of Software.&quot;","authors":[],"date":"2007","doi":null,"raw":"O'Reilly, T. (2007). &quot;What is Web 2.0: Design Patterns and Business Models for the Next Generation of Software.&quot; Communications & Strategies 1(65): 17.","cites":null},{"id":17305581,"title":"What's your strategy for managing knowledge?&quot;","authors":[],"date":"1999","doi":null,"raw":"Hansen, M. T., N. Nohria, et al. (1999). &quot;What's your strategy for managing knowledge?&quot; Harvard Business Review 77(2): 106-116.","cites":null},{"id":17305572,"title":"Working Knowledge: how organisations manage what they know.","authors":[],"date":"1998","doi":"10.1145\/347634.348775","raw":"Davenport, T. and L. Prusak (1998). Working Knowledge: how organisations manage what they know. Boston, Harvard Business School Press.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2010-06","abstract":"This paper argues that Knowledge Management Technology (KMT) is socially constructed in use based on the affordances and constraints of the technology artefact. Since many Knowledge Management (KM) systems are introduced with vague purposes (such as to improve knowledge sharing) it is therefore their affordances and constraints which strongly shape the socially constructed 'KMT-in-practice'. The paper argues that knowledge is also socially constructed and that knowledge creation requires an element of surprise and challenge to routine. Using a case study of the British Council's KM programme between 1998 and 2003, the paper explores the social construction of a KMT as it is developed and used; describing how various features afforded by the technology influence its adoption and institutionalisation. The paper concludes by arguing that KMTs-in-practice, which are successful in supporting knowledge creation, must paradoxically remain in a state of neither stabilisation and acceptance, nor abandonment and disuse. Practical implications of how this might be achieved are provided","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/215861.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/29839\/1\/Knowledge%20management%20technology%20in%20practice%20%28LSERO%29.doc.pdf","pdfHashValue":"0286edb8523308c3b0e62d3a1b36a63b921df8b8","publisher":"Palgrave Macmillan Ltd.","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:29839<\/identifier><datestamp>\n      2017-05-04T09:35:37Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4D414E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/29839\/<\/dc:relation><dc:title>\n        Knowledge management technology-in-practice: a social constructionist analysis of the introduction and use of knowledge management systems<\/dc:title><dc:creator>\n        Venters, Will<\/dc:creator><dc:subject>\n        HD28 Management. Industrial Management<\/dc:subject><dc:description>\n        This paper argues that Knowledge Management Technology (KMT) is socially constructed in use based on the affordances and constraints of the technology artefact. Since many Knowledge Management (KM) systems are introduced with vague purposes (such as to improve knowledge sharing) it is therefore their affordances and constraints which strongly shape the socially constructed 'KMT-in-practice'. The paper argues that knowledge is also socially constructed and that knowledge creation requires an element of surprise and challenge to routine. Using a case study of the British Council's KM programme between 1998 and 2003, the paper explores the social construction of a KMT as it is developed and used; describing how various features afforded by the technology influence its adoption and institutionalisation. The paper concludes by arguing that KMTs-in-practice, which are successful in supporting knowledge creation, must paradoxically remain in a state of neither stabilisation and acceptance, nor abandonment and disuse. Practical implications of how this might be achieved are provided.<\/dc:description><dc:publisher>\n        Palgrave Macmillan Ltd.<\/dc:publisher><dc:date>\n        2010-06<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/29839\/1\/Knowledge%20management%20technology%20in%20practice%20%28LSERO%29.doc.pdf<\/dc:identifier><dc:identifier>\n          Venters, Will  (2010) Knowledge management technology-in-practice: a social constructionist analysis of the introduction and use of knowledge management systems.  Knowledge Management Research and Practice, 8 (2).  pp. 161-172.  ISSN 1477-8238     <\/dc:identifier><dc:relation>\n        http:\/\/www.palgrave-journals.com\/kmrp\/index.html<\/dc:relation><dc:relation>\n        10.1057\/kmrp.2010.8<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/29839\/","http:\/\/www.palgrave-journals.com\/kmrp\/index.html","10.1057\/kmrp.2010.8"],"year":2010,"topics":["HD28 Management. Industrial Management"],"subject":["Article","PeerReviewed"],"fullText":"  \nWill Venters \nKnowledge management technology-in-\npractice: a social constructionist analysis \nof the introduction and use of knowledge \nmanagement systems \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: \nVenters, Will (2010) Knowledge management technology-in-practice: a social constructionist \nanalysis of the introduction and use of knowledge management systems. Knowledge \nmanagement research & practice, 8 (2). pp. 161-172. ISSN 1477-8238 \nDOI: 10.1057\/kmrp.2010.8  \n \n© 2010 Palgrave Macmillan \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/29839\/ \nAvailable in LSE Research Online: April 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \n \nKnowledge Management Technology-in-\npractice: A social constructionist analysis of the \nintroduction and use of Knowledge Management \nSystems.  \n \nDr Will Venters \nLondon School of Economics \nHoughton Street \nLondon \nWC2A 2AE \nUnited Kingdom \nTel +44 2078523619  \nFax +44 207 9557385 \nw.venters@lse.ac.uk  \nhttp:\/\/personal.lse.ac.uk\/venters  \nABSTRACT \nThis paper argues that Knowledge Management Technology (KMT) is socially \nconstructed in use based on the affordances and constraints of the technology artefact. \nSince many Knowledge Management Systems are introduced with vague purposes \n(such as to improve knowledge sharing) it is therefore their affordances and constraints \nwhich strongly shape the socially constructed “KMT-in-practice”. The paper argues that \nknowledge is also socially constructed and that knowledge creation requires an element \nof surprise and challenge to routine. Using a case study of the British Council’s \nknowledge management programme between 1998 and 2003 the paper explores the \nsocial construction of a KMT as it is developed and used; describing how various \nfeatures afforded by the technology influence its adoption and institutionalisation. The \npaper concludes by arguing that KMTs-in-practice, which are successful in supporting \nknowledge creation, must paradoxically remain in a state of neither stabilisation and \nacceptance, nor abandonment and disuse. Practical implications of how this might be \nachieved are provided.  \n \nKeywords: knowledge management tools, knowledge management system, \ninformation systems, theory of knowledge, groupware, case study\/studies. \n Introduction \nThis paper considers the way in which Knowledge Management technology \n(KMT) is socially constructed.  The paper begins from the premise that social activity \nis, in many contexts, necessarily mediated through technology and that technology is a \npowerful and available instrument enrolled in all human practice. Technology has a \nsignificant role within knowledge creation activities and forms part of the social context \nin which they occurs. The paper thus asserts that a richer view of KMT is required \nwhich acknowledges that KMT is socially constructed in development and use, and \nwhich also takes into account social constructivist perspectives towards knowledge \n(Schultze 2000; Venters, Cushman et al. 2003; Tsoukas 2005) and in this way \nresearches how social construction influences how knowledge is created, shared and \nstored using such KMT.  \nDrawing upon a theoretical framework based on a practice lens of technology \n(Orlikowski 2000), the concept of materiality (Orlikowski 2007; Orlikowski and Scott \n2008) and a view of technology based on affordances and constraints (Norman 1990; \nNorman 1999; Hutchby 2001) the paper seeks to show that a KMT’s success, when \nviewed through a social constructionist lens, depends upon its ability to neither stabilise \nas a routine taken for granted technology, nor become abandoned as an unusable \ntechnology.  \nThis study contributes to demands to theorise the IT artefact within information \nsystems (Orlikowski and Iacono 2001) and reflects debates within science and \ntechnology studies to explore technology’s place in social action (Latour 1999); \nintroducing these debates into the knowledge and organisational learning literature. The \npaper extends previous literatures which have considered the role of KMT within social \nsettings (Schultze 1998; Schultze 2000) and adds further empirical and theoretical depth \nto the limited literature on the social construction of KMT (of which Makoto, Wilensky \net al. (2007) and Park and Hossain (2003) are examples).  \nThe empirical contribution of the paper draws upon a case study of the \nintroduction of KMT as part of a global organisation’s Knowledge Management (KM) \nprogramme between 1998 and 2003. As with many KM programmes the strategic intent \nwas vague and focused on broad cultural goals such as improving communication, \ndeveloping community and learning. Similarly the KMT was introduced without a \npredefined advertised purpose that was meaningful to users. The KMT was introduced \nwith the broad aim to “transform British Council [employees] into a community and \nmaintain such a community” (taken from the definition of the KM system’s objectives). \nThis bland, arguably meaningless, statement suggests that the KMT’s meaning was at \nthe outset unstable or even incoherent. This is not unusual; many intranets, websites, \ngroupware tools, and social network technologies have also been introduced with broad \nexpectations of positive consequences: as acts of technological faith. In such cases, as \nhere, the technology’s purpose maybe undefined but the vision of technology is clear \nserving as a powerful proxy for a general commitment to modernise, change and \nimprove. We thus argue that without a strong vision for the technology its purpose is \nsocially constructed from the interaction of users with its material form.  \nThe paper unpicks this vision of KMT as an act of technological faith and \nlacking purpose. This is undertaken through the analysis of the case study using a \ntheoretical framework of social construction of knowledge, design and practice, in \nwhich technology is both an artefact of design, and enacted in practice (Orlikowski \n1998). The paper explores the research question: how is KMT socially constructed in \nuse, and how does the materiality of the KMT affect both the social construction of the \ntechnology, and the social construction of knowledge (which is itself the primary aim of \nthe technology).  \nThe paper concludes by arguing that once a KM technology becomes \n“technology-in-practice” (Orlikowski 1998) and stabilizes within the routine work of \nusers it loses its “knowledge-managementness” and it ceases to have any transformative \npotential and hence becomes little more than an information or data management tool \n(Galliers and Newell 2001). Yet, despite this, much of the focus of KMT aims at  \nbecoming routine, taken for granted and even institutionalised – essentially stabilised.  \nThe next section of the paper reviews the literature KMT and in so doing \ndevelops the theoretical framework for the paper based on social constructionist ideas. \nThis is followed by a brief description of the methodology employed. The case study is \nthen presented, discussed and finally conclusions are reached.    \nLiterature Review  \nWhile there are no intrinsic characteristics which define an ICT application as a \nKnowledge Management Technology (Hendriks 2001), there are a range of \ntechnologies which have been closely aligned with the field (Venters 2006b) and \nemployed within KM initiatives. Such technologies can be defined in two waves \n(Huysman and Wulf 2006), the first focused on managing knowledge, supporting \nindividual learning and direct communication. Examples of these included decision \nsupport systems, intranets, data-warehouses and video conferencing (Davenport and \nPrusak 1998; Wilson and Snyder 1999; Alavi and Leidner 2001; Butler 2002).  The \nsecond wave of KMT research (Huysman and Wulf 2006) focused on the collective \nemergent nature of knowledge sharing (Brown and Duguid 2000). This later literature \nrecognised that “socio-psychological” factors are important in determining KMT’s \nsuccess (Malhotra 2005) and focused on social networking technologies and Web2.0 \n(O'Reilly 2007) including taxonomies and the semantic web (Thompson and Walsham \n2004; Venters and Ferneley 2009). Yet both these waves of research have taken little \ninterest in the social construction of KMT (two exceptions are (Makoto, Wilensky et al. \n2007) and (Park and Hossain 2003) though these papers are not empirically grounded). \nInstead they see KMT as outside the individual knowledge creation – as its medium or \ncapture device, rather than (as this paper argues) a fundamental part of the social \nconstruction of knowledge.  \nThis lack of focus on the sociology of knowledge and of KMT reflects a \ndichotomy within the field of knowledge management in which the field seems split \nbetween opposing dimensions. Those who have attempted to classify the field observe \nthese two dimensions; defined by Shultze as functionalist and interpretivist (Schultze \n1998) so reflecting the philosophical opposition also dominant in the social sciences \n(Burrell and Morgan 1979) and in studies of technology in organisations (Orlikowski \n1998). Functionalist approaches consider knowledge as an objective representation of \nthe world waiting to be discovered, and focus on technological and informational means \nto transfer understanding (Schultze 1998). This is similar to Earl’s categorisation of \n“technocratic approaches” to knowledge management (Earl 2001), Nonaka and \nTakeuchis SECI model (Nonaka and Takeuchi 1995), Hansen, Nohria et al.’s \n“codification approaches” (Hansen, Nohria et al. 1999) and Newell, Robertson et al.’s \n“Cognitive Model” (Newell, Robertson et al. 2002). Knowledge is capable of some \ndegree of objectification, suggesting a technocentric perspective in which KMT should \nsupport the gathering, organisation, refinement, analysis and dissemination of \nknowledge in the form of data (Jackson 1999). The central focus is on the KMT as a \nrepository (Schultze 1998), and on taxonomies (Farquhar, Fikes et al. 1997; Avram \n2006) and ontologies (Milton, Shadbolt et al. 1999; Stojanovic, Stojanovic et al. 2002; \nGou, Schwartz et al. 2009) as a backbone for categorisation and search (Schultze 1998; \nStojanovic, Stojanovic et al. 2002). Technology is part of a process whereby human \nknowledge is ordered, transferred, searched or disseminated within the machine (Russ, \nLytras et al. 2008, pp. xvii) and by which work practices become more knowledge \nefficient (Makoto, Wilensky et al. 2007). Web 2.0 folksonomies (such as delicious.com, \nDigg.com or Facebook.com(Avram 2006)), blogs (Pluempavarn and Panteli 2008), \ngames, simulations and wiki’s (Hasan 2008) might be examples. \nIn contrast, broadly “interpretivist” (Schultze 1998) approaches to knowledge \nmanagement, which Hansen terms “personalisation” (Hansen, Nohria et al. 1999) and \nwhich align with Earl’s “Behavioural” approaches (Earl 2001) and Newellet al.’s (2002) \n“Community Model”, intrinsically link knowledge with human action and so suggest an \nanthropocentric view of technology in which it is employed to support social practices \nof humans; usually through better communication. KMT should attempt to integrate \nwith social activity and “recognise the tacit basis of all sense-reading and sense-giving \nactivities, and try to make these activities more meaningful and valuable to all parties” \n(Walsham 2001, p601). Such KMT aims to “reconcile the informational features of \ncomputer technology with the social needs of individuals engaged in knowledge work” \n(Venters 2006b, p350). Capabilities such as threaded discussions, e-mail, newsgroups \nand videoconferencing are often associated with such interpretivist perspectives \n(Venters, Cornford et al. 2005) as are social networking technologies and peer-to-peer \ncommunication technologies including instant-messaging, Wikis, FaceBook.com, \nLinkedIn.com and Skype.  \nObviously many Web 2.0 services are used to support both these two \nperspectives (social networking sites in particular, but also Wikis and Blogs (Avram \n2006) enabling both codification and personalisation (Hansen, Nohria et al. 1999)) and \nsome researchers have even attempted to challenge the dichotomy (for example by \nintroducing the idea of “implicit knowledge” (Frappaolo 2008) or re-casing KMT as \nsocio-technical and organisations as ‘sensible’ (Hasan 2008)). The dichotomy however \nstill remains prevalent as a means of structuring and understanding KM interventions \n(Venters and Ferneley 2009). More importantly however, as Schultze and Stabell (2004) \nhave acknowledged, polarising the field in this way has denied alternative perspectives \ntowards KMT, overplaying the role of KMT as either the deterministic capturing of \nknowledge-objects, or as a basic support or medium for social processes of \ninterpretation which are centred on the human. This bi-polar view of KMT simplifies \ntechnology’s role in social practices by denying its role in intrepretivism’s underlying \nsuggestion that social reality is socially constructed (Schultze and Stabell 2004), with \nknowledge seen as a continuous accomplishment (Kogut and Zander 1996). Where \nknowledge is considered as socially constructed there seems to be considerable \nambivalence towards the role of technology (e.g. (Brown and Duguid 2000; Brown and \nDuguid 2001; Hara 2009)) and it is this gap which the paper sets out to address.  \nThe social construction of knowledge referred to here is rooted in \nphenomenology and focuses on the social context within which knowledge is \nconstructed between individuals. Reality is socially constructed as an ongoing dynamic \nprocess reproduced by the actions of individuals based on their interpretation and \nknowledge of the world (Berger and Luckmann 1966). It is a dialectic construction of \nmeaning through which knowledge and society are socially constructed. Extending this \nto consider the social construction of KMT is consistent with Berger and Luckmann’s \n(1966) argument regarding the social construction of knowledge; for they argue that a \nstudy of human knowledge must include a study of the taken-for-granted reality which \nis socially constructed by such knowledge; a reality which they acknowledge includes \ntechnological artefacts which are themselves socially constructed. This puts the role of \ntechnology centrally within knowledge practices - indeed Polanyi’s (1967) famous \n“tacit dimension of knowledge”, regularly quoted in KM debates, is creative and \nsensory and so linked to “things” which are interacted with. Similarly, the famous \nexample of tacit knowledge as the inexpressible skill of “riding a bicycle” fails to focus \non the materiality of the bicycle itself required in this knowing. Likewise, Nonaka and \nTakeuchi’s (1995) famous bread-making example includes dough, kneading, timers, \ningredients and the experience of such “things” in use, and the social construction of \nthese and other things in the engineers laboratory.  “We know more than we can tell” \n(Polanyi, 1967 p4)} because our experiential knowledge is influenced by things.  \nAdopting this social constructionist stance towards knowledge management, \nindicates the need to further investigate KMTs’ role as material artefacts within the \nsocial construction of reality through this process of knowing – a call reflected in recent \nwork on the materiality of technology (Orlikowski 2007; Orlikowski and Scott 2008) in \nwhich it is argued that “knowing is material” (Orlikowski 2006).  \nThis realignment of the view of technology is a move away from asking what \nfeatures a KMT might provide benefit alongside or for a knowledge practice, to instead \nask how  knowledge practices are shaped and institutionalised by the affordances and \nconstraints of such features within the social construction of reality.  \n As Leonardi and Barley (2008, p161) makes clear; \n“Materiality matters for theories of technology and organizing because the \nmaterial properties of artefacts are precisely those tangible resources that \nprovide people with the ability to do things in new ways and to do things they \ncould not do before. The materiality of information technology remains grossly \nunder-theorised (Orlikowski and Iacono 2001; Zammuto, Griffith et al. 2007), in \nlarge part, because conflating materialism with determinism poses subsidiary \nchallenges that make it difficult to tease apart the role of the material and the \nsocial”.  \nTheoretical Framework \n In exploring the socially constructed role of technology within knowledge \nmanagement, Orlikowski’s practice lens is adopted, considering KMT as inscribed with \ndesigners’ intention, but socially constructed through use within recurrent social \npractices (Orlikowski 2000). This reflects Hendrick’s (2001) suggestion that KMTs \ncannot be considered intrinsically as “knowledge management tools” based on their \nown characteristics, but that they “become” KMT through the method and situation in \nwhich they are employed (Hendriks 2001). Orlikowski argues that experiential \ndifferences affect the way technology is appropriated and used and hence “in using a \nparticular technological artefact in particular ways in particular conditions, users enact a \nsituated technology which structures their ongoing interaction with the artefact” \n(Orlikowski 1998, p3), a situated technology which she titles “technology-in-practice”. \nThrough this analytical framework the role of “KMT-in-practice” (within the aspirations \nof broadly using KMT to create, share and communicate knowledge) is explored.  \nThis paper’s analytical focus is also on the affordances of the material \ntechnology that lead it to become technology in use. As Leonardi and Barley eloquently \nargues researchers “pay too little analytic attention to a technology’s material \nconstraints and affordances, and focus, instead, on showing how people organize around \nthe technologies they employ” (Leonardi and Barley 2008, p163). In this context an \naffordance is the technology’s “call-out” to human beings (Gibson 1979; Hutchby 2001) \nit is the fixed notion which “constrains the ways that [technologies] can be ‘written’ or \n‘read’” (Hutchby 2001). An example of this might be that that a door-handle affords \nturning or a button affords pushing (Norman 1990).  \n“The affordance of something does not change as the need of the \nobserver changes. The observer may or may not perceive or attend to the \naffordance, according to his needs, but the affordance, being invariant is always \nthere to be perceived… The object offers what it does because it is what it is.” \n(Gibson 1979, p138-9) \nSimilarly, technology might not afford something a user desires and may have \nconstraints which constrain action. “Technologies resist” (Leonardi and Barley 2008, \np163), by not allowing users all the possibilities they want and thus users must alter \ntheir practices correspondingly in response to these constraints. \nFocusing on these affordances and constraints attends to the demand to directly \naddress the means by which specific features of a technology become entangled in the \nsocial practices of individuals undertaking knowledge work (Pickering 1995; Knorr-\nCetina 1999; Leonardi and Barley 2008). In addition, it focuses the analysis on new \nthings enabled by KMT, and not simply on their role in replicating existing knowledge \npractices (Karat, Karat et al. 2000; Zammuto, Griffith et al. 2007). It must be \nacknowledged that certain structures (which embody social rules and political interests) \nare embedded within any technology’s design (Orlikowski 1992) in the affordances and \nconstraints of the technology. Therefore the KMT-in-practice is based on the materiality \nof the technology itself, reflecting the designers’ intentions and beliefs.  \nThis theoretical framework (technology in practice, constraints and affordances) \nis used to analyse how, within the case study, the material artefact of a KMT, and its \naffordances and constraints, become embodied within the Knowledge Management \npractices and either become (or fail to become) stabilised (and subsequently \ninstitutionalised) within the organisation. This provides empirical evidence and \nexplanation for Huysman and Wulf’s (2006, p40) observation that “most tools designed \nto support knowledge sharing, do not become institutionalised within organisations”.  \nMethodology of the Case Study \nThe interpretive case study is drawn from action research to develop and \nintroduce a KMT as part of the British Council’s knowledge management initiative \ndating from 1998-2003. While the case study is now quite old (the organisation and its \nKM practices have changed considerably in the intervening period), and hence its \nrelevance to modern KMT may be challenged, it is also advantageous as it is a less \ncomplex technological context in which to analyse materiality and the social \nconstruction of technology. Unlike today’s organisations where Web 2.0 technology \nabounds, the case provides an example of the introduction of a new collaborative \nknowledge management system into an organisation with a scant communications \ninfrastructure consisting of only email and a simple flat-file Intranet. Given that this \nresearch is not focused on the form of technology per se but rather explores how the \nmateriality of any KMT becomes used, so the case is beneficial since the lack of a wider \nWeb 2.0 context, the lack of integration of systems, and the limited features of the KMT \nitself makes it easier to demonstrate and explore its socially constructed and material \nnature. It is hoped that by returning to an earlier and simpler case study it may be \npossible to demonstrate KMT’s socially constructed nature and demonstrate such a \nperspective’s relevance to contemporary interests in social networking technologies. \nThe action research study has been described elsewhere in relation to the institutional \nimpact of the KM strategy (Venters 2003; Venters and Wood 2007) however it is \nuniquely used here to focus on the social construction of a KMT during its development \nand use. \nAction research involves an intervention by a researcher into a real \norganisational context with the aim of both improving the context and at the same time \ngaining relevant knowledge of the intervention. Soft Systems Methodology (SSM) was \nemployed within the action research as the systems development methodology \n(Checkland and Scholes 1990). Here however, one cycle of this SSM intervention is \nused as an interpretive case study (Walsham 1993; Walsham 1995; Walsham 2006). \nThe wider intervention is described elsewhere (Venters 2003); however here, the \nqualitative data collected for this cycle of intervention was interpreted to make sense of \nthe social construction of the KMT in practice. Crucially the researcher’s involvement \nwithin the case, and the subsequent reflexive analysis of this involvement (Ashmore \n1989; Alvesson and Skoldberg 2000), allows the case study to penetrate deeper into the \ndesigners’ intentions than a conventional interpretive case study may have allowed. \nAction research ensures the active interest of the organisation’s management and further \nenables access to situations usually unavailable to other research approaches (Fox 1990; \nGustavsen 1993; Kock 1997). Significantly for this research, alternative accounts may \nhave been unable to document the abstract attributes of the technology that are \nembedded within their design (Kallinikos 2004) and the political impact of the \ntechnology. Using action research, the researcher was undertaking such design and was \ninvolved in the implementation and thus can report on this. In this way the study \nprovides a unique historical account of the process of designing and constructing a \nKnowledge Management System. The research was conducted over a five and a half \nyear period. During this period over fifty research interviews were undertaken across six \ncountries (Spain, South Korea, Hungary, France, Slovenia and the UK), alongside many \nmonths of participative interaction with the actors (filling ten research diaries). The \nresearcher was given full access to the organisation’s intranet, IT infrastructure and \ndocument archive during this period. \nCase Study \nThe British Council is a non-profit organisation, partially funded by the UK \nGovernment’s foreign and commonwealth office, which aims to develop relationships \nwith overseas stakeholders by gaining recognition for the UK’s values, ideas and \nachievements (Lee 1995). At the time of the research the organisation had a \nheadquarters in London and in Manchester with about 1000 members of staff \nadministering around 5000 employees based in about 257 offices in 110 countries. As a \ntruly global organisation focused on innovation, learning and knowledge sharing, its \nsenior management felt knowledge management to be of paramount importance to the \norganisation’s success (Khalid and Marsden 1999; Venters and Wood 2005). Its \nknowledge management programme aimed to “design and implement measures which \nwill encourage people working in the Council to generate and share information and \nknowledge in ways which advance our purpose and strategic objectives and will become \na permanent feature of the way we work” (Internal British Council Memo 1999). Its \nglobal nature meant that most members of the organisation could not physically meet \nand unsurprisingly technology was seen as central to the KM programme. Specifically \nthe programme aimed to exploit new technology (particularly the organisation’s \nIntranet) in “creating a comprehensively networked organisation” that would engender a \ngreater sense of the organisation being a community. The intervention described was \nfounded on a desire to engender “a sense of community” and develop communities of \npractice (Lave and Wenger 1991; Wenger 1998) among senior staff in the organisation \nand drew heavily on the literature providing advice on achieving this (Wenger 2001; \nWenger, McDermott et al. 2002). \nAs an action researcher, the researcher’s role in the Knowledge Management \nprogramme was defined as “to provide the British Council with pilot tools to support \nthe knowledge sharing needs of [the Country Director] community” (terms of reference \nproduced by the Knowledge Manager). The pilot tool was titled CD:net and in \ndeveloping it the Knowledge Manager assumed a project management role with the \nresearcher acting as the developer, designing and programming the system. In addition, \na recently retired Country Director was employed as a consultant to provide “expertise \nin understanding the needs of the Country Director community…to edit, produce and \npublish information to be provided to the community and to support the community in \nits knowledge sharing…[and]…to support the rest of the team in understanding the \ncommunity” (Consultant’s terms of reference).  \nThe aim of CD:net was not precisely defined, other than “to support this \noverloaded and pressured group” of Country Directors through the provision of \n“knowledge management tools”. This was to be achieved by “bringing people overseas \nmore closely into the [general] debate” (Internal British Council Memo 1999) through \nproviding Intranet technology which would “comprehensively network” (ibid) them. \nIt was decided to provide Country Directors with an easy to use KMT that could \nbe developed further as its use changed. While some structure was imposed, it was seen \nas inevitable that once introduced the use made of the technology would be different. \nThe CD:net team used the metaphor of a “mobile phone” in designing the service; \nsuggesting that CD:net should aspire to become like a mobile phone in that Country \nDirectors could use it without real thought in a huge variety of ways to make life easier \nfor themselves. In this way CD:net would act as a conduit for complex social practices. \nUnlike many Knowledge Management Systems at that time, CD:net would not aim to \ncodify the work of Country Directors, as their work was considered too varied (one \nCountry Director described his work as of “Butterfly nature”). To develop a “sense of \ncommunity” among the group the consultant would take on the role of “catalyst” to \nencourage participation by prompting questions, seeding articles and representing users.  \nMaterial affordances and constraints \nThe CD:net technology’s design was constrained by the organisation’s IT \npolicies, costs and by their chosen technological infrastructure. These constraints \nincluded issues of security, network bandwidth availability and corporate standards for \nIntranet sites. As the cost of installing software on PCs globally was large, the service \nwas forced to run entirely using server-side Internet technology and was only accessible \nthrough a web browser. The system had to conform to the organisation’s standards for \nIntranet sites, imposing a series of constraints on the graphic design. Similarly, the use \nof website technology itself constrained the provision of capabilities to develop a sense \nof community. HTML (and the underlying HTTP protocol) is designed for rendering \nhypertext information and is thus more suited for simple information provision than for \ncomplex interaction (Berners-Lee and Fischetti 1997), therefore leading to systems that \nare argued to support a more codified than personalised approach to knowledge \n(Sørensen 2002). While other technologies existed which could have enabled this (e.g. \nclient-side Java or ActiveX controls), these were forbidden from use on the \norganisation’s Intranet, as was Instant Messaging and similar groupware technologies. \nWithin these constraints, the service was designed wherever possible to promote social \nactivity through discussion. CD:net provided the usual features of generic knowledge \nmanagement systems focused on personalisation (Hansen, Nohria et al. 1999; Venters \n2006a) including hierarchical discussions, new postings, advanced search, linking to \nwebsites and personal details pages linked to comments. \n \n Figure 1: CD:net page: This shows the home page with folders and discussions at the \nbottom of the page (folders contain further discussions, the newspapers are individual messages \nand the arrow is a link to a website) . The author’s name is associated with every message.  Names \nhave been pixilated. \nThese facilities afforded different levels of participation, and allowed the \nconsultant to separate the website into areas for various types of discussion. The \nsystem’s content was to change regularly as users posted messages and as the consultant \ncommissioned articles. While a small part of the CD:net system was public (i.e. all \nmembers of the organisation could view them),  the vast majority of the system required \na software-token and password so that only registered Country Directors could access it. \nSuch privacy was provided for three reasons. Firstly, the system required the software-\ntoken so that it would know the identity of the user and could tailor the webpages \naccordingly. Secondly, the security requirements of the organisation necessitated \npasswords being issued to Country Directors – something that was interpreted as \nensuring privacy. Thirdly, the development team felt it was important that country \ndirectors should be provided with a safe-enclave for debates (Hayes and Walsham 2000) \nor for asking embarrassing questions. The service was not however advertised as \n‘private’ per se, though the security measures were interpreted by Country Directors as \nensuring their privacy. Furthermore a number of Country Directors were keen that \ndiscussion on CD:net would remain private – as one stated: “[CD:net] should be an \nopen forum where staff can post ideas, complaints, rants brainwaves etc without fear of \nretribution, regulation or sanction”.   \nCD:net was launched with only a small number of articles and postings (mostly \nsolicited by the consultant). This was because the consultant felt, on the basis of \nconsultation with Country Directors, that the imposition of a strong structure and large \nvolume of material would overload Country Directors, and that their interest in CD:net \nwas to gain opinions and discussions from other Country Directors, not to receive large \nvolumes of information. This was supported by many Country Directors, one of whom \nstated during the design: “The danger of imposing something [structured around \nspecific issues] is that you channel the way people think, within a medium which should \nbe liberating”. Similarly another stated that “a strong structure should only be imposed \nwhen the service becomes too anarchic to be useful and user friendly. If straight away \nyou put a structure to it, then you might stop people thinking laterally”. CD:net was \ntherefore launched reflecting the consultant’s view that Country Directors wished to \ndiscuss simple issues of “policy, people and money”, and that the system should be used \nto enable wide-ranging discussions of policy in these areas. \nCD:net in practice \nThe system was launched by an e-mail from the development team containing a \nsoftware token to access the site. This introductory email, including a high-level \nchampion’s message of support, focused on the value of the service to Country \nDirectors. Upon launch, the CD:net service was used actively for a couple of months, \nwhereupon its use slowed and eventually ceased. This section considers how the CD:net \ntechnology was understood by users, and how this led to it falling from use. This \ndiscussion is based on interviews while the system was in development, in use, and \nshortly after it was abandoned. \nCountry Directors had a wide variety of demands for the system. Some wanted it \nto support their personal lives in overseas countries, for example aiding them in tax and \nfinancial arrangements of working overseas. Others wanted to use the system for  \nkeeping in touch with friends who were Country Directors and were keen to share ideas \nso that “you can see where everyone is coming from…”. In particular that  was seen as \n“useful in getting feedback from all colleagues and could save time”. Others saw the \nsystem as a tool to discuss local problems with countries that may face similar concerns. \nOne Country Director felt the system enabled policy decisions to be better disseminated. \nIn particular they felt that “it shouldn’t be the personal choice of a Country Director \nwho dictates the focus of activity” within their country, rather   they “would like to use \nCD:net to share experience with [countries in their region]”.  \nOne Country Director complained of “too much top-down thinking” decreed \nfrom headquarters and felt CD:net was part of redressing the balance. Finally others \nwere uninterested in the wider views of Country Directors, and felt the technology \nsimply supported “a series of little networks” to which people register an interest. \nA small number of Country Directors were concerned that the system did not \nignore the political aspects of a Country Directors job (at a time when they faced \nsignificant strategic change) and that it should “handle dissent”. This contrasted with \nanother Country Director’s view that “there is a danger of creating an underground \nmovement… [if you don’t involve authority] you might get conflict!” \nThe messages posted on the service reflected these various interpretations of \nCD:net. Some posted messages about personal issues of living in overseas countries, \nothers posted requests for advice, and suggestions for activity. A final group however \nsoon began a discussion on the specific ramifications of an organisation wide strategic \nchange initiative – something which was considered quite political. \nOnce a small number of ‘political’ messages began to be posted, other Country \nDirectors appeared to change their interpretation of the system. The areas of the \ndiscussion board focusing on politically benign topics began to also see political \nmessages posted (as users perceived CD:net afforded a space to discuss political issues), \nwhile others slowly stopped being used. This appeared to suggest that those who \ninterpreted CD:net as “unpolitical” were confused about the nature of the tool. Country \nDirectors who had valued the ability to discuss issues away from the glare of senior \nmanagement began to interpret the tool not simply as a safe enclave for knowledge \nsharing, but rather as a political tool; even describing it as “subversive”. Significant \npressure was placed on the development team to provide senior management with \npasswords. Indeed trust in CD:net became an issue with a Country Director stating “I \nwould not trust CD:net…I know many people would send things straight to [senior \nmanagement]”, while another stated “I would not trust any electronic medium; every \ntime you send an e-mail you have in your mind that the message may get out to other \npeople’s hands”.  And yet CD:net was not designed to afford a hidden ‘dissention \nsupport system’ – but as a community-engendering tool where knowledge might be \ncreated and shared.  Ironically, CD:net seemed to be increasing mistrust among Country \nDirectors rather than engendering a “sense of community” as the organisation’s KM \nstrategy had intended. \nAnalysis of CD:net through a Practice Lens \nThe social construction of reality is determined by technological arrangements \n(Crotty 1998) of which, in the British Council’s case, CD:net aspired to form part. If \nsuccessful as a KMT (i.e. supporting knowledge construction and sharing) CD:net \nwould form part of the dialectic construction of meaning (Berger and Luckmann 1966), \nby which its users co-construct their knowledge in a reciprocal interaction with others \nalongside and through the CD:net technology. A Country Director participating in the \nworld (a world including CD:net) might simultaneously externalise their being into the \nworld (perhaps posting messages on CD:net) helping form social order, and internalise \nsuch social order (including CD:net and its messages) as an objective reality (Berger \nand Luckmann 1966). This process would be undertaken over time, as the Country \nDirector is inducted into a particular social dialectic and so gains knowledge (Berger \nand Luckmann 1966). \nIn using CD:net, within such a social dialectic, Country Directors draw upon its \nvarious affordances to construct their enacted technology-in-practice by which they \nconstruct the subjectivity of others. The form the KMT-in-practice takes will therefore \ninfluence the knowledge created through it (for it forms part of the social reality of \nknowledge construction). Orlikowski suggests that in constructing technology-in-\npractice individuals are influenced by “the properties comprising the technological \nartefact – those provided by its constituent materiality, those inscribed by the designers, \nand those added on by users through previous interactions (e.g. specific data content, \ncustomised features or expanded software\/hardware)” (Orlikowski 2000, p410). She \ngoes on to suggest that users draw upon their own “skills, power, knowledge, \nassumptions, and expectations about the technology” which are influenced by factors \nsuch as communication about the technology and previous experiences of similar \ntechnology” (Orlikowski 2000, p410) drawing on (Orlikowski and Gash 1994). If a \nKMT-in-practice is to form part of the knowledge creation practices of individuals it is \nnecessary to consider the influence of these factors on users’ construction of a KMT-in-\npractice, or on their abandonment of the technology – noting that their influence would \nnot be the same for all users (for some an affordance might be irrelevant, for others the \nsame affordance might presents rich possibilities). Here CD:net is considered in relation \nto these suggested factors. \nIn constructing their “KMT-in-Practice” CD:net users were unlikely to have \nbeen strongly influenced by organisational communication about the technology since, \nas outlined in the introduction, CD:net was introduced without a predefined advertised \npurpose. Rather, CD:net blandly aspired to “support the knowledge sharing needs of \n[the Country Director] community”. This suggests previous communication would have \nhad little impact on the forms of technology-in-practice which emerged. Similarly, past \nexperience of similar technology would align users’ interpretation with the rather bland \nand uncontroversial corporate Intranet (the BC:net) since the IT policies required \nCD:net to use only HTML, to confirm to Intranet design standards and to operate very \nmuch like an Intranet site.  \nOne affordance which appeared to strongly influence a range of users’ \n“technology-in-practice” was the security properties imposed by the designers and the \nBritish Council’s IT policies, which provided a sense of privacy from non-Country \nDirectors. This was reinforced by the consultant’s view that the system should handle \ndissent and closed discussion, and perhaps by the title “CD:net” suggesting a network of \nand for Country Directors. These factors perhaps led some Country Directors to \ninterpret CD:net as a ‘political’ tool in which it was safe to dissent from corporate \npolicies.  \nGiven that lack of strong material factors shaping CD:net, the most significant \nfactor in the construction of the KMT-in-practice for users was the messages added by \nothers. These messages formed the means by which knowledge would be socially \nconstructed for users. A Country Director exploring CD:net would be faced by the \nsubjectivity of others made available as messages and technology (not necessarily \nindependently interpreted). The knowledge they constructed would thus be a \nhermeneutic process of meaning construction on the basis of the text posted on CD:net \n(alongside other similar interaction). Yet their interpretation of the meaning of a posting \non CD:net would be influenced by many factors including their perception of its author \n(who they may know); the meaning they gleaned from the text; the meetings they have \nattended in which the topics were discussed; and the meaning gleaned from the \ntechnology’s afforded features. Upon launch CD:net included discussions on a range of \ntopics from a range of individuals and its users appeared to interpret the technology in a \nrange of ways (as a place to discuss working overseas tax arrangements -a key issue for \nstaff, a place to keep in touch and as a place for discussing local issues) perhaps \ninconsistently. However, perhaps influenced by the material affordance of security, \nonce CD:net began to be used for political postings challenging the strategic aims of the \norganisation others’ interpretation of CD:net appeared to change. By using CD:net in \nthis way (that is, posting messages of a politically contentious nature because it was \nperceived as secure and available for this) the KMT was itself changed (since it \nincorporated political messages which other Country Directors could observe) and seen \nas subversive. CD:net was enacted in practice, so we cannot easily separate the \ninterpretation of the postings on CD:net, from the interpretations of CD:net itself. The \nKMT-in-practice is “both a medium for and outcome of users’ patterned interaction” \n(Orlikowski 1998, p 2). Similarly, the dialectic of meaning construction suggests it is \nnot possible to separate the messages on CD:net from CD:net as a technological \nplatform for both are drawn upon in knowledge construction. Messages posted form \npart of the technology and the basis by which people construct meaning. When political \nmessages were posted, CD:net was interpreted differently and became a different \ntechnology-in-practice, and hence the way CD:net was used quickly shifted. A Country \nDirector upon perceiving CD:net as political might fundamentally change the nature of \nCD:net by posting a further political message, or by avoiding it, and either way further \nreinforcing its “politicalness”. One can speculate that only by challenging such political \nmessages (perhaps through a request to have the message censured, or by initiating an \nopen discussion on the purpose of the tool) could this have been shaped in another \nmanner. The overall perception of a KMT will not be homogenous. During the political \ndiscussions on CD:net messages were still being posted, for example requesting support \nfor events, describing recent activity, though these quickly ceased as the purpose of \nCD:net stabilised around “dissention”, “subversion” and politics and so users quickly \nmoved away, ultimately leading to its abandonment.  \nThis discussion, in which weak material properties and minority perceptions of \nCD:net were reinforced and so became dominant, ultimately leading to CD:net as a \n“subversive” dissention support system feared by senior management, appears to \nsuggest that there is a need to impose a strong structure and purpose to a KMT so \ncreating a powerful technological form which strongly influences the form of KMT-in-\npractice around which users stabilise their habitual practices. Indeed it has traditionally \nbeen argued that for any technology to be successful, a user’s interpretation of a \ntechnology must stabilise (Bijker 1995) whereupon its meaning may be black-boxed. \nOnly upon such stabilisation of meaning can a technology-in-practice form part of the \nrecurrent working practices of users so structuring their actions (Orlikowski 2000). \nFurthermore, such continued habitual use of the KMT will reinforce its structure over \ntime (Orlikowski 2000) and avoid a technology falling out of habitual use and being \nabandoned as occurred with CD:net. Such stabilised technology-in-practice would \ngenerally be considered as successfully well used technology though in CD:net’s case \nthis failed to happen and it was abandoned. It is perhaps for this reason that so many call \nfor a strong vision and leadership within Knowledge Management (Davenport, DeLong \net al. 1998; Blackler and McDonald 2000; Earl 2001). \nAnd yet, taking the social construction of knowledge perspective, there seems to \nbe a paradox in this position. For what role would such habitualised, routine, stabilised-\nin-use KMT have in the dialectic construction of meaning? Would such a technology \nenable the creation and sharing of knowledge – its essential “knowledge-\nmanagementness”? Berger and Luckmann (1966) assert that our knowledge creation \noccurs in a foreground of deliberation and innovation, while habitualized actions’ \nmeanings “become embedded as routines in [an individual’s] general stock of \nknowledge, taken for granted.” (Berger and Luckmann 1966, p71). It is only when \nsurprise, challenge and reflection are faced with breakdown that we learn (Schön 1982; \nWinograd and Flores 1986; Argyris and Schön 1996). The social construction of \nknowledge (Berger and Luckmann 1966) suggests that stabilisation and habiltualization \nof a KMT aiming to create knowledge might inhibit its ability to create meaning and \nknowledge; and hence the KMT simply becomes another stagnant information \ndissemination tool rather than a place of debate and conflict and learning. Had CD:net’s \nmeaning stabilised (for example as a basic discussion board on tax arrangements) its \npotential to create and share knowledge would have diminished – it would simply have \nbecome a repository of advice on tax arrangements. Perhaps if, or when, a KMT \nstabilises it may fail to create the ongoing breakdowns of the meaning (Winograd and \nFlores 1986) necessary for knowledge creation to occur, and indeed become just another \ndata management technology as Galliers and Newell (2001) argue that most KMTs are \nlittle more than. Indeed one could argue that CD:net was successful in creating \nincreased knowledge among Country Directors of the political situation within the \norganisation. Certainly, its users gained knowledge of the political landscape of the \norganisation at that time and particularly on issues of trust relating to how fellow \nCountry Directors act when presented with such dissent – perhaps demonstrated in the \nquote “I would not trust CD:net” noted above. \nGiven this paradox it is of little surprise that few Knowledge Management \ninitiatives succeed as expected (Schultze and Boland 2000; Storey and Barnett 2000; \nHendriks 2001), while many of those that survive stabilise to become little more than \ndata management tools (Galliers and Newell 2001). Yet the above analysis suggests that \na successful knowledge management technology should aspire not to stabilise in use, \nbut rather remain an unstable, poorly understood and challenging technology-in-use so \nenabling the social construction of knowledge – essentially remaining “Fad” like (Swan, \nScarbrough et al. 1999). Unfortunately such faddishness leads to the regular \nabandonment of technology (as it fails to stabilise), or to its stabilisation and descent \ninto being a straightforward information management system. \nPerhaps the challenge is therefore to take seriously the social construction of \ntechnology within Knowledge Management as a significant actor with a powerful role \nto play, and to value the faddishness of such technology as an important component in \nknowledge creation and sharing. Similarly, rather than aiming for stabilisation and \nlongevity for KMTs, we should perhaps consider them as of-the-moment and requiring \nfrequent or constant re-invention.   \nConclusions \nThis paper has presented a case study of the development, introduction and use \nof a knowledge management technology, CD:net, within the British Council. The \nsystem was introduced as an act of technological faith without a predefined, advertised \npurpose. Drawing upon a social constructionist account of knowledge the paper asserts \nthat there must be correspondence between an individual’s meaning and the meaning of \nothers in order to share a common sense of reality and so learn (Berger and Luckmann \n1966). Employing Orlikowski’s (2000) practice lens towards technology the paper \nexplores how CD:net was enacted in use based on recurrent social practices, but \ninfluenced by the designer’s intentions inscribed within the technology’s affordances \nand constraints. This theoretical framework enables a discussion of the stabilisation, or \nlack of stabilisation of KMT-in-practice. The study shows how external factors such as \nthe organisation’s security policy and Intranet standards were embedded within the \nCD:net’s form; how such factors influenced the CD:net technology-in-practice for \nCountry Directors; and how this in turn shaped the CD:net technology.  \nWhile traditional accounts of technology suggest stabilisation as the ultimate \ngoal of successful technology, this research on the social construction of KMT suggests \nthat stabilisation of a KMT aiming to create knowledge might inhibit its ability to do so; \nand lead to KMT simply becoming a stagnant information dissemination tool rather than \na place of debate and conflict. Had CD:net stabilised, its potential to create and share \nknowledge would have diminished. This paper therefore suggests that if a KMT is to \nachieve its desire to enhance knowledge creation and sharing then, perhaps, stability \nshould not be desired.  But there is a paradox for one might equally argue that without \nstabilisation the KMT cannot survive, as demonstrated by the British Council case. It is \nthen of little surprise that few Knowledge Management initiatives succeed as expected \n(Schultze and Boland 2000; Storey and Barnett 2000; Hendriks 2001), while many of \nthose that survive stabilise to become little more than data management tools (Galliers \nand Newell 2001). In either case, it is argued here, that technology is central, and not \nincidental to the experience.  \nWhat is required is a new understanding of technology within Knowledge \nManagement, in which the socially situated and enacted technology’s properties \n(including communication about the technology, materiality of the technology, and \nmessages on the technology) are employed to maintain the technology as neither \nstabilised nor rejected. This can only be achieved through the ongoing engagement of a \ndesigner appreciating users’ technology-in-use. It is interesting to note that successful \nsocial networking technologies (of which FaceBook is an obvious example) reflect this \nby enabling the user community to develop applications which run on the social \nnetwork and allow groups of users to develop new uses for the platform. However, such \nsystems are not directed or managed – they emerge and many also fail and die as they \nstabilise and become boring, or become too chaotic (Friends-Reunited.co.uk, \nSixDegrees.com, and increasingly MySpace are examples). Those developing KMT in \nthe future should consider whether it is possible to engender a system to somehow lie \nbetween stabilisation and failure. This research suggests that a strong vision of the \npurpose of the KMT may help. Such a vision should focus on the work practices of \nthose involved rather than on Knowledge Management related ideas. Issues of security \nand privacy should be considered in relation to their potential interpretation. Similarly \nthe design of the system should be undertaken with user involvement which specifically \nconsiders how the new KMT might be interpreted. Finally, once the system is \nintroduced, care should be given to moderating the service with time spent discussing, \nwithin the KMT, its purpose.  \nAcknowledgement \nI would like to thank Bob Wood for his guidance during this research. The research was \ngenerously funded by the British Council.  \nReferences \n \nAlavi, M. and D. Leidner (2001). \"Review: Knowledge Management and Knowledge \nManagement Systems: Conceptual Foundations and Research Issues.\" MIS \nQuarterly 25(1): 107-136. \nAlvesson, M. and K. Skoldberg (2000). Reflexive Methodology: New Vistas for \nQualitative Research. London, Sage Publications. \nArgyris, C. and D. Schön (1996). Organisational Learning 2 :Theory, Method and \nPractice. Reading, Mass, Addison-Wesley. \nAshmore, M. (1989). The Reflexive Thesis. Chicago, The University of Chicago Press. \nAvram, G. (2006). \"At the Crossroads of Knowledge Management and Social \nSoftware.\" Electronic Journal of Knowledge Management 4(1): 1-10. \nBerger, P. and T. Luckmann (1966). The social construction of reality. London, \nPenguin  Books. \nBerners-Lee, T. and M. Fischetti (1997). Weaving the Web. San Francisco,CA, Harper. \nBijker, W. (1995). Of Bicycles, Bakerlites and Bulbs; Toward a theory of Socio-\nTechnical Change. Cambridge, MA, MIT Press. \nBlackler, F. and S. McDonald (2000). \"Power, Mastery and Organisational Learning.\" \nJournal of Management Studies 37(6): 833-851. \nBrown, J. S. and P. Duguid (2000). The Social Life of Information. Boston, \nMassachusetts, Harvard Business School Press. \nBrown, J. S. and P. Duguid (2001). \"Knowledge and Organization: A Social-Practice \nPerspective.\" Organization Science 12(2): 198-213. \nBurrell, G. and G. Morgan (1979). Sociological Paradigms and Organisational \nAnalysis. London, Heineman. \nButler, T. (2002). Exploring the Reality of Knowledge Management Systems: A Case \nStudy. The Third European Conference on Organisational Knowledge, Learning \nand Capabilities, Athens. \nCheckland, P. and J. Scholes (1990). Soft Systems Methodology in Action. Chichester, \nJohn Wiley & Sons Ltd. \nCrotty, M. (1998). The Foundations of Social Research. London, Sage. \nDavenport, T., D. DeLong, et al. (1998). \"Successful knowledge management projects.\" \nSloan Management Review 39(2): 43-59. \nDavenport, T. and L. Prusak (1998). Working Knowledge: how organisations manage \nwhat they know. Boston, Harvard Business School Press. \nEarl, M. (2001). \"Knowledge management strategies: Toward a taxonomy.\" Journal of \nManagement Information Systems 18(1): 215-233. \nFarquhar, A., R. Fikes, et al. (1997). \"The Ontolingua Server: a tool for collaborative \nontology construction.\" International Journal of Human-Computer Studies \n46(6): 707-727. \nFox, W. (1990). \"An interview with Eric Trist, father of the sociotechnical systems \napproach.\" The Journal of Applied Behavioural Science 26(11): 259-279. \nFrappaolo, C. (2008). \"Implicit Knowledge.\" Knowledge Management Research and \nPractice 6(1): 23-25. \nGalliers, B. and S. Newell (2001). Back to the future: From knowledge management to \ndata management. The 9th European Conference on Information Systems, Bled, \nSlovenia, Moderna Obganizacija,. \nGibson, J. J. (1979). The Ecological Approach to Perception. London, Houghton \nMifflin. \nGou, T., D. Schwartz, et al. (2009). \"Codifying collaborative knowledge: Using \nWikipedia as a basis for automated ontology learning.\" Knowledge Management \nResearch and Practice 7(3): 206-217. \nGustavsen, B. (1993). \"Action research and the generation of knowledge.\" Human \nRelations 46(11): 1361-1365. \nHansen, M. T., N. Nohria, et al. (1999). \"What's your strategy for managing \nknowledge?\" Harvard Business Review 77(2): 106-116. \nHara, N. (2009). Communities of Practice: Fostering Peer-to-Peer Learning and \nInformal Knoweldge Sharing in the workplace. Berlin, Springer-Verlag. \nHasan, H. (2008). \"Back to the future for KM: the case for sensible organisation.\" \nKnowledge Management Research and Practice 6(1): 26-30. \nHayes, N. and G. Walsham (2000). Safe enclaves, political enclaves and knowledge \nwork. Managing knowledge: critical investigations of work and learning. C. \nPrichard, R. Hull, M. Chumer and H. Willmott. London, Macmillan: 69-87. \nHendriks, P. (2001). \"Many rivers to cross: from ICT to knowledge management \nsystems.\" Journal of Information Technology 16(2): 57-72. \nHutchby, I. (2001). \"Technologies, Texts and Affordances.\" Sociology 35(2): 441-456. \nHuysman, M. and V. Wulf (2006). \"IT to support knowledge sharing in communities, \ntowards a social capital analysis.\" Journal of Information Technology 21: 40-51. \nJackson, C. (1999). \"Process to Product: Creating tools for knowledge management.\"   \nRetrieved 13\/7\/1999, from www.brint.com\/members\/120205\/jackson\/. \nKallinikos, J. (2004). Farewell to constructivism: technology and context-embedded \naction. The Social Study of Information and Communication Technology: \nInnovation, Actors and Contexts. C. Avgerou, C. Ciborra and F. Land. Oxford, \nOxford University Press. \nKarat, J., C.-M. Karat, et al. (2000). \"Affordances, Motivation, and the Design of User \nInterfaces.\" Communications of the ACM 43(8): 49-51. \nKhalid, M. and E. Marsden (1999). Internal Consultation Paper: Action to promote \nknowledge sharing in the British Council. Manchester, British Council. \nKnorr-Cetina, K. (1999). Epistemic Cultures: How the sciences make knowledge. \nCambridge, MA, Harvard University Press. \nKock, N. (1997). \"Negotiating mutually satisfying IS action research topics with \norganisations: and analysis of Rapoport's initiative dilemma.\" Journal of \nWorkplace Learning 9(7): 253-262. \nKogut, B. and U. Zander (1996). \"What Firms do? Coordination, Identity and \nLearning.\" Organization Science 7(5): 502-520. \nLatour, B. (1999). Pandora's Hope: Essays on the Reality of Science Studies. Boston, \nMA, Harvard University Press. \nLave, J. and E. Wenger (1991). Situated Learning: Legitimate Peripheral Participation. \nNew York, Cambridge University Press. \nLee, J. M. (1995). \"The Reorganisation of the British Council: Management \nImprovisation and Policy Uncertainty.\" Public Administration 73(3): 339-355. \nLeonardi, P. and S. Barley (2008). \"Materiality and change: Challenges to building \nbetter theory about technology and organizing \" Information and organisation \n18(3): 159-176. \nMakoto, N., H. Wilensky, et al. (2007). The Gospel of Knowledge Management in and \nout of a Professional Community. International ACM Conference on Supporting \nGroup Work, Sanibel Island, FL. \nMalhotra, Y. (2005). \"Integrating knowledge management technologies in \norganizational business processes: getting real time enterprises to deliver real \nbusiness performance.\" Journal of Knowledge Management 9(1): 7-28. \nMilton, N., N. Shadbolt, et al. (1999). \"Towards a knowledge technology for knowledge \nmanagement.\" International Journal of Human Computer Studies 51(3): 615-64. \nNewell, S., M. Robertson, et al. (2002). Managing Knowledge Work. London, Palgrave \nMacmillan. \nNonaka, I. and H. Takeuchi (1995). The knowledge-creating company: how Japanese \ncompanies create the dynamics of innovation. New York, Oxford University \nPress. \nNorman, D. (1990). The Design of Everyday Things. London, The MIT Press. \nNorman, D. (1999). \"Affordance, Conventions, and Design.\" Interactions ACM 6(3): \n38-43. \nO'Reilly, T. (2007). \"What is Web 2.0: Design Patterns and Business Models for the \nNext Generation of Software.\" Communications & Strategies 1(65): 17. \nOrlikowski, W. (1992). \"The duality of technology: Rethinking the concept of \ntechnology in organisations.\" Organisational Science 3(3): 398-426. \nOrlikowski, W. (1998). Out of the Shadows: The Role of Human Agency in \nTechnology. Sloan School of Management. Cambridge, Massachusetts Institute \nof Technology. \nOrlikowski, W. (2000). \"Using Technology and Constituting Structures: A Practice \nLens for Studying Technology in Organizations.\" Organization Science 11(4): \n404-428. \nOrlikowski, W. (2006). \"Material knowing: the scaffolding of human \nknowledgeability.\" European Journal of Information Systems 15(5): 460-466. \nOrlikowski, W. (2007). \"Sociomaterial Practices: Exploring Technology at Work.\" \nOrganization Studies 28(9): 1435-1448. \nOrlikowski, W. J. and D. C. Gash (1994). \"Technological Frames: Making Sense of \nInformation Technology in Organizations.\" ACM Transactions on Information \nSystems 12(2): 669-702. \nOrlikowski, W. J. and C. S. Iacono (2001). \"Research Commentary: Desperately \nSeeking the \"IT\" in IT Research--A Call to Theorizing the IT Artifact.\" \nInformation Systems Research 12(2): 121 -134. \nOrlikowski, W. and S. V. Scott (2008). The Entangling of Technology and Work in \nOrganizations. ISIG Working Papers Series. London, London School of \nEconomics. \nPark, J.-H. and L. Hossain (2003). Social-embed-ness of EPR Systems in KM practice. \nIEEE Managing Technologically Driven Organisations: The human side of \ninnovation and change., Albany, LA, IEEE International Engineering \nManagement Conference. \nPickering, A. (1995). The Mangle of Practice. Chicago, Chicago University Press. \nPluempavarn, P. and N. Panteli (2008). Building Social Identity through Blogging. \nExploring Virtuality Within and Beyond Organisations. N. Panteli. \nBasingstoke,UK, Palgrave Macmillan. \nPolanyi, M. (1967). The Tacit Dimension. New York, Doubleday. \nRuss, M., M. Lytras, et al. (2008). Knowledge Management Strategies: A Handbook of \nApplied Technologies. Hershey, PA, USA IGI Publishing. \nSchön, D. (1982). The Reflective Practitioner: How Professionals Think in Action. New \nYork, Basic Books. \nSchultze, U. (1998). Investigating the Contradictions in Knowledge Management. IFIP \nWG8.2 & WG8.6 Joint Working Conference on Information Systems: Current \nIssues and Future Changes, Helsinki, Finland, Omnipress, Wisconsin, USA. \nSchultze, U. (2000). \"A confessional account of an ethnography about knowledge \nwork.\" MIS Quarterly 24(1): 3-41. \nSchultze, U. and R. J. Boland (2000). \"Knowledge management technology and the \nreproduction of knowledge work practices.\" Journal of Strategic Information \nSystems 9(2-3): 193-212. \nSchultze, U. and C. Stabell (2004). \"Knowing what you don't know? Discourses and \nContradictions in Knowledge Management Research.\" Journal of Management \nStudies 41(4): 549-573. \nSørensen, C. (2002). Knowledge Discourses and Information Technologies. 35th \nHawaii International Conference on Systems Sciences, Hawaii, IEEE. \nStojanovic, N., L. Stojanovic, et al. (2002). Evolution in the ontology-based knowledge \nmanagement systems. European Conference on Information Systems, Gdansk, \nPoland. \nStorey, J. and E. Barnett (2000). \"Knowledge Management Initiatives: Learning from \nFailure.\" Journal of Knowledge Management 4(2): 145-156. \nSwan, J., H. Scarbrough, et al. (1999). Knowledge management: The next fad to forget \npeople? 7th European Conference on Information Systems, Copenhagen, \nDenmark. \nThompson, M. and G. Walsham (2004). \"Placing Knowledge Management in Context.\" \nJournal of Management Studies 41(5): 725-747. \nTsoukas, H. (2005). Complex Knowledge: Studies in Organizational Epistemology. \nOxford, Oxford University Presss. \nVenters, W. (2003). The Introduction of Knowledge Management Technology within \nthe British Council: An Action Research Study. Information Systems Institute. \nSalford, University of Salford: 375. \nVenters, W. (2006a). Knowledge Management: The fad that forgot technology. \nInternational Conference on Organizational Learning, Knowledge and \nCapabilities (OLKC). Warwick, UK. \nVenters, W. (2006b). \"The use of Technology within Knowledge Management: A \nReview.\" Journal of Intelligent Systems 15(1-4): 329-356. \nVenters, W., T. Cornford, et al. (2005). \"Knowledge about Sustainability: SSM as a \nMethod for Conceptualising the UK Construction Industry's Knowledge \nEnvironment.\" Journal of Computing and Information Technology 13(2): 137-\n148. \nVenters, W., M. Cushman, et al. (2003). Motility Of Practiced Knowledge: An \nExploration Within The UK Construction Industry. Organisational Knowledge, \nLearning and Capabilities, Barcelona, Spain. \nVenters, W. and E. Ferneley (2009). \"Guest Editorial: To codify or collaborate - \nIntroduction to the special issue on Knowledge Management and e-Research \ntechnologies.\" Knowledge Management Research and Practice 7(3): 192-195. \nVenters, W. and B. Wood (2005). Organizational Knowledge, Learning and \nCapabilities in action: The case of the British Council. The Sixth European \nConference on Organizational Knowledge, Learning, and Capabilities, Bentley \nCollege, Boston,MA. \nVenters, W. and B. Wood (2007). \"Degenerative structures that inhibit the emergence of \ncommunities of practice: a case study of knowledge management in the British \nCouncil.\" Information Systems Journal 17(4): 349-368. \nWalsham, G. (1993). Interpreting Information Systems in Organizations. Chichester, \nWiley. \nWalsham, G. (1995). \"Interpretive case studies in IS research: nature and method.\" \nEuropean Journal of Information Systems 4(2): 74-81. \nWalsham, G. (2001). \"Knowledge Management: The Benefits and Limitations of \nComputer Systems.\" European Management Journal 19(6): 599-608. \nWalsham, G. (2006). \"Doing interpretive research.\" European Journal of Information \nSystems 15(3): 320-330. \nWenger, E. (1998). Communities of practice : Learning, meaning and identity. \nCambridge, Cambridge University Press. \nWenger, E. (2001). \"Supporting communities of practice; a survey of community-\noriented technologies.\"   Retrieved March, 2001, from \nhttp:\/\/www.ewenger.com\/tech\/. \nWenger, E., R. McDermott, et al. (2002). Cultivating Communities of Practice. Boston, \nMassachusetts, Harvard Business School Press. \nWilson, L. T. and C. Snyder (1999). \"Knowledge management and IT: How are they \nrelated?\" IEEE IT Professional 1(2): 73-75. \nWinograd, T. and F. Flores (1986). Understanding computers and cognition. \nNorwood,NJ, Ablex. \nZammuto, R., T. Griffith, et al. (2007). \"Information Technology and the Changing \nFabric of Organization.\" Organization Science 18(5): 749-762. \n \n \nWill Venters is a lecturer in Information Systems within the Department of \nManagement at the London School of Economics and Political Sciences. His research \ninterests are in social study of ICT, in particular the development and use of globally \ndistributed systems to support new work practices and new types of organisation. In \nparticular he has researched the introduction and use of knowledge management \nsystems within various industries. He is principle investigator of an EPSRC research \nproject looking at the work practices of the particle physics community as it develops \ndistributed computer systems and knowledge infrastructure for its research at the Large \nHadron Collider at CERN. He is also involved in evaluating the UK Electronic \nPrescribing Service. In addition he is a member of the board of www.youthnet.org an \nexclusively online UK charity.  \n \n \n"}