{"doi":"10.1080\/13621020903466357","coreId":"69346","oai":"oai:eprints.lancs.ac.uk:27153","identifiers":["oai:eprints.lancs.ac.uk:27153","10.1080\/13621020903466357"],"title":"Designed to fail : a biopolitics of British Citizenship.","authors":["Tyler, Imogen"],"enrichments":{"references":[{"id":991381,"title":"[1948]. The Origins of Totalitarianism.","authors":[],"date":"1973","doi":null,"raw":null,"cites":null},{"id":996806,"title":"2 Biopolitics is understood here as the ‗explosion of numerous and diverse techniques for achieving the subjugation of bodies and the control of populations‘ (see Foucault,","authors":[],"date":"1981","doi":null,"raw":null,"cites":null},{"id":997045,"title":"4 `National minorities` is a term used by Hannah Arendt to describe precarious populations within a nation-state who risk disenfranchishment.","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":997168,"title":"6 It was Marshall‘s pivotal ‗Citizenship and Social Class‘","authors":[],"date":"1950","doi":null,"raw":null,"cites":null},{"id":993836,"title":"A Brief History of Neoliberalism Oxford","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":991090,"title":"Background - British racism.","authors":[],"date":"1981","doi":null,"raw":null,"cites":null},{"id":992353,"title":"Border Security and Immigration: Our Deal for Delivery in 2008‘ [online]. Available from:","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":996255,"title":"Designing safe citizens.","authors":[],"date":"2008","doi":"10.1080\/13621020801900069","raw":null,"cites":null},{"id":995890,"title":"Governance Innovation and the Citizen: The Janus Face of Governance-beyond-the-State.","authors":[],"date":"2005","doi":"10.1080\/00420980500279869","raw":null,"cites":null},{"id":990808,"title":"Homo Sacer: Sovereign Power and Bare Life, trans. Daniel HellerRoazen.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":996512,"title":"I am indebted to Weber‘s argument that citizenship designates some US citizens as normal, safe, and successful and others abnormal, unsafe, and temporarily failed (Weber,","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":996024,"title":"Immigration Interview. Granada Television, [online]. Available from: http:\/\/www.margaretthatcher.org\/speeches\/displaydocument.asp?docid=103485 [Accessed 1 April] Tyler, I.,","authors":[],"date":"1978","doi":null,"raw":null,"cites":null},{"id":995138,"title":"Listen to our Cry. [online] Available at: http:\/\/www.ncadc.org.uk\/archives\/filed%20newszines\/oldnewszines\/Old%2051-100\/Newszine93\/Yarl'sWood.html [Accessed 1 April]","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":994853,"title":"Massive change.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":992957,"title":"Mothers United in Yarl's Wood IRC.","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":991620,"title":"Out of Place: Englishness, Empire and the Locations of Identity.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":994081,"title":"Practitioners‘ Association (IPLA), 2007.Submission to Lord Goldsmith for the Citizenship Review: The Different Categories of British Nationality.","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":995377,"title":"Rethinking Refugees: Beyond States of Emergency.","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":991887,"title":"Social Insurance and Allied Services. London, HMSO. Available from: http:\/\/news.bbc.co.uk\/1\/shared\/bsp\/hi\/pdfs\/19_07_05_beveridge.pdf Blitz, B.,","authors":[],"date":"1942","doi":null,"raw":null,"cites":null},{"id":993441,"title":"Society must be defended: Lectures at the Collège de France 1975-1976. Translated David Macey.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":992415,"title":"Thatcher's People: The British Nationality Act","authors":[],"date":"1983","doi":null,"raw":null,"cites":null},{"id":993731,"title":"The Ethics and Politics of Asylum: Liberal Democracy and the Response to Refugees.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":994594,"title":"The General Theory of Employment , Interest and Money.","authors":[],"date":"1936","doi":null,"raw":null,"cites":null},{"id":993205,"title":"The History of Sexuality: Volume I. trans. Robert Hurley.","authors":[],"date":"1981","doi":null,"raw":null,"cites":null},{"id":995616,"title":"The New Empire Within Britain. New Society, 417- 421 [online] Available from:","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":994337,"title":"The New Front Line: Security in a changing world ippr","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":995680,"title":"The Path for Citizenship: Next Steps in Reforming the Immigration System. Border and Immigration Agency Communications Directorate.","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":992692,"title":"Violent Intersections: The Role of Prisons and Welfare in the Exclusion of Mexican Immigrant Women‘ UCSD.","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":992130,"title":"Who Sings the Nation State.","authors":[],"date":"2007","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-02","abstract":"Tracing a route through the recent 'ugly history' of British citizenship, this article advances two central claims. Firstly, British citizenship has been designed to fail specific groups and populations. Failure, it argues, is a design principle of British citizenship, in the most active and violent sense of the verb to design: to mark out, to indicate, to designate. Secondly, British citizenship is a biopolitics - a field of techniques and practices (legal, social, moral) through which populations are controlled and fashioned. This article begins with the 1981 Nationality Act and the violent conflicts between the police and black communities in Brixton that accompanied the passage of the Act through the British parliament. Employing Michel Foucault's concept of state racism, it argues that the 1981 Nationality Act marked a pivotal moment in the design of British citizenship and has operated as the template for a glut of subsequent nationality legislation that has shaped who can achieve citizenship. The central argument is that the existence of populations of failed citizens within Britain is not an accident of flawed design, but is foundational to British citizenship. For many 'national minorities' the lived realities of biopolitical citizenship stand in stark contradistinction to contemporary governmental accounts of citizenship that stress community cohesion, political participation, social responsibility, rights and pride in shared national belonging","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69346.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/27153\/1\/biopoliticsbritishcitizenshipdraft.pdf","pdfHashValue":"329bcfba6ae37c4c320d96a63cff274e3fd1c85e","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:27153<\/identifier><datestamp>\n      2018-01-24T02:50:20Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D48:484D<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Designed to fail : a biopolitics of British Citizenship.<\/dc:title><dc:creator>\n        Tyler, Imogen<\/dc:creator><dc:subject>\n        HM Sociology<\/dc:subject><dc:description>\n        Tracing a route through the recent 'ugly history' of British citizenship, this article advances two central claims. Firstly, British citizenship has been designed to fail specific groups and populations. Failure, it argues, is a design principle of British citizenship, in the most active and violent sense of the verb to design: to mark out, to indicate, to designate. Secondly, British citizenship is a biopolitics - a field of techniques and practices (legal, social, moral) through which populations are controlled and fashioned. This article begins with the 1981 Nationality Act and the violent conflicts between the police and black communities in Brixton that accompanied the passage of the Act through the British parliament. Employing Michel Foucault's concept of state racism, it argues that the 1981 Nationality Act marked a pivotal moment in the design of British citizenship and has operated as the template for a glut of subsequent nationality legislation that has shaped who can achieve citizenship. The central argument is that the existence of populations of failed citizens within Britain is not an accident of flawed design, but is foundational to British citizenship. For many 'national minorities' the lived realities of biopolitical citizenship stand in stark contradistinction to contemporary governmental accounts of citizenship that stress community cohesion, political participation, social responsibility, rights and pride in shared national belonging.<\/dc:description><dc:date>\n        2010-02<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/27153\/1\/biopoliticsbritishcitizenshipdraft.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1080\/13621020903466357<\/dc:relation><dc:identifier>\n        Tyler, Imogen (2010) Designed to fail : a biopolitics of British Citizenship. Citizenship Studies, 14 (1). pp. 61-74. ISSN 1362-1025<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/27153\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1080\/13621020903466357","http:\/\/eprints.lancs.ac.uk\/27153\/"],"year":2010,"topics":["HM Sociology"],"subject":["Journal Article","PeerReviewed"],"fullText":"1 \n \n \nDesigned to Fail: a Biopolitics of British Citizenship  \nImogen Tyler, Lancaster University \n \nAbstract \nTracing a route through the recent ‗ugly history‘ of British citizenship, this article advances \ntwo central claims: Firstly, British citizenship has been designed to fail specific groups and \npopulations. Failure, it argues, is a design principle of British citizenship, in the most active \nand violent sense of the verb to design: to mark out, to indicate, to designate. Secondly, \nBritish citizenship is a biopolitics - a field of techniques and practices (legal, social, moral) \nthrough which populations are controlled and fashioned. This article begins with the 1981 \nNationality Act and the violent conflicts between the police and black communities in Brixton \nwhich accompanied the passage of the Act through the British parliament. Employing Michel \nFoucault‘s concept of state racism, it argues that the 1981 Nationality Act marked a pivotal \nmoment in the design of British citizenship and has operated as the template for a glut of \nsubsequent nationality legislation which has shaped who can achieve citizenship. The \ncentral argument is that the existence of populations of failed citizens within Britain is not an \naccident of flawed design, but is foundational to British citizenship. For many `national \nminorities` the lived realities of biopolitical citizenship stand in stark contradistinction to \ncontemporary governmental accounts of citizenship which stress community cohesion, \npolitical participation, social responsibility, rights and pride in shared national belonging.  \n \nBiographical Note \nImogen Tyler is a Lecturer in Sociology at Lancaster University. This article is part of a series \nof essays about immigration and borders in Britain. Correspondence can be directed to \ni.tyler@lancaster.ac.uk.\n2 \n \n \nChildren and young people born in the UK who have lived here all their life may be \nshocked to discover ... that they are not citizens of the country where they have \nalways lived.  \nImmigration Law Practitioners’ Association 2007 \n \nCynthia Weber argues that ‗modern liberal citizenship is a failing design‘ (2008, p. 125).  \nWeber‘s argument draws on design guru Bruce Mau‘s statement that ‗For most of us, design \nis invisible. Until it fails‘ (2004, p. 1). If, for Mau, successful design becomes naturalised so \nthat it no longer visibly intrudes upon its environment, then, for Weber, ‗the sheer volume of \nideas, images, and events‘ in circulation about citizenship regarding ‗who has it but shouldn‘t \nhave it, who should have it but doesn‘t have it, [and] who had it but renounced it‘ is evidence \nof a failure of citizenship design (2008, p. 125).1 Mau‘s statement tellingly begins with the \nphrase, ‗for most of us‘, and it is those whom citizenship fails that this article will focus on. \nTracing a route through the recent ‗ugly history‘ (ILPA, 2007, p.7) of British citizenship, this \narticle advances two central claims: Firstly, British citizenship has been designed to fail \nspecific groups and populations. Failure, it argues, is a design principle of British citizenship, \nin the most active and violent sense of the verb to design: to mark out, to indicate, to \ndesignate. Secondly, British citizenship is a biopolitics - a field of biopolitical2 techniques and \npractices (legal, social, moral) through which populations are controlled and fashioned.  \n \nThis article begins with the 1981 Nationality Act and the violent conflicts between the police \nand black communities in Brixton which accompanied the passage of the Act through the \nBritish parliament.3 Employing Michel Foucault‘s concept of state racism (2003), it argues \nthat the 1981 Nationality Act marked a pivotal moment in the design of British citizenship and \nhas operated as the template for a glut of subsequent nationality legislation which has \nshaped who can achieve citizenship Some of the consequences of the abolition of birth right \ncitizenship (Jus soli) in the 1981 Act and the subsequent institution of harsh immigration and \nasylum laws and systems are explored through an account of the experiences of a failed \nasylum-seeker, Sonia, and her children, drawn from interview data and the campaign \nmaterials of anti-deportation activists. The central argument is that the existence of \npopulations of failed citizens within Britain is not an accident of flawed design, but is \nfoundational to British citizenship. For many `national minorities`4 the lived realities of \nbiopolitical citizenship stand in stark contradistinction to contemporary governmental \naccounts of citizenship which stress community cohesion, political participation, social \nresponsibility, rights and pride in shared national belonging. Indeed, the (counter) argument \n3 \n \nthat I develop in this article, is that from the 1980s onwards British citizenship has become a \nmechanism through which democratic freedoms are retracted from individuals and \ncommunities, as wealth and power is concentrated in the hands of the social and political \nelites. \n \nState Racism   \nAlthough a vast theoretical literature on citizenship has been imported into Britain, \ncitizenship is an oddly undeveloped concept within British society and culture.5 The first \nsubstantive accounts of British citizenship emerged in the 1950s, inspired by economist \nJohn Maynard Keynes (1936), social reformer William Beveridge (1942) and sociologist T.H \nMarshall (1950).6 If British citizenship has its roots in the liberal welfarism that predominated \nafter the Second World War, by the early 1980s citizenship had become dislocated from any \nredistributive ideals, the Marshallian constellation of welfare state, social rights and class \nequality was replaced with nationality, immigration and security. The 1981 Nationality Act \nwas not concerned with the constitutional rights of citizens, nor with mapping out the \nrelationship between citizen and state; it was an Immigration Act designed to define, limit \nand remove the entitlements to citizenship from British nationals in the Commonwealth (the \nformer colonies) thereby restricting immigration to the British Isles and creating ‗aliens‘ within \nthe borders of the nation state. This Act instituted a ‗citizenship gap‘ within the British state, \nand between the state and former British colonies, as large numbers of British nationals \nfound they had been designed out of citizenship (see Alison Brysk and Gershon Shafir \n2004).  Political geographer Brad Blitz argues that ‗the revocation of the rights to citizenship \nand residency‘ often take place ‗during periods of state building‘. The 1981 Act was passed \nby the conservative Thatcher government (1979--1990) during a period of intense \ninstitutional reorganization that was to transform Britain into a neoliberal nation-state, a \ntransformation as significant as the social and infrastructural reforms that took place during \nthe 1950s post-War period (2006, p. 453). \n \nThe 1981 Nationality Act created several categories of nationality and citizenship, including a \ncategory of ‗Commonwealth citizenship‘, which removed from British nationals in the \nCommonwealth and Hong Kong their historic rights to residency in the United Kingdom. As \nThe Sunday Times reported in 1981, the act ‗for the first time seeks to define British \nCitizenship and those who ―belong to Britain‖ [and] to abolish the historic right of common \nBritish Citizenship enjoyed by the colonial peoples‘ (in Baucom, 1999, p. 195). Whilst race \nand ethnicity were never directly named, the 1981 Act effectively designed citizenship so as \nto exclude black and Asian populations in the Commonwealth while leaving ‗routes home‘ for \n4 \n \nwhite nationals born within the boundaries of the empire. As postcolonial theorist Ian \nBaucom notes, ‗to be British, [the Act] mandated, one had to trace a line of descent to an \nancestor born on the island. In effect, the law thus drew the lines of the nation [...] around the \nboundaries of race‘ (1999, p. 195). The passage of this Act through parliament was thus a \nsignificant event in the history of British race relations, a moment when, through citizenship, \nracism was implicitly incorporated within the judicial body of the State becoming an active \ncomponent part of its operational system of ‗legal justice‘. Indeed, critical lawyer David Dixon \ndescribed the Act as ‗constitutionalising racism‘ (Dixon 1981).  \n \nThe Nationality Act provoked public debate about the meaning of Britishness and the \nrelationship between the United Kingdom and the Commonwealth. While the Act was being \npassed in parliament, riots broke out in Brixton, a borough of London with a significant black \npopulation.7 The Brixton riots marked the beginning of a significant period of civil unrest \nsparking three months of intensive rioting between Black and Asian communities and police \nacross England. In Brixton, public anger was directed towards the Metropolitan police force, \nand the uprising was triggered by a police operation called Operation Swamp 81. The \noperation‘s name was widely interpreted as a reference to a notorious comment by Margaret \nThatcher in a 1978 television interview in which she implied that a white native population \nfeared being swamped by ‗people of a different culture‘. Operation Swamp 81 was \npurportedly part of a city-wide operation to reduce street crime in London. In actuality it \nfocused on Brixton, employing ancient vagrancy legislation, the infamous ‗sus‘ laws.8 In the \nfirst six days of the operation, 120 plain-clothes officers stopped and searched 943 people in \nBrixton, arresting 118 predominantly black male youths.9   \n \nLord Scarman‘s influential report into the causes of the Brixton riots, The Scarman Report: \nThe Brixton Disorders 10-12 April 1981 (1982), argued that the black population in Brixton \nhad been subject to ‗disproportionate and indiscriminate‘ policing. The ‗sus laws‘ were \nabolished on the recommendation of his report. Scarman also acknowledged that social \ndeprivation and racial prejudice had contributed to the riots but refused to accept claims of \ninstitutional racism within the police or indeed other parts of the state. The report argued that \ninstitutional racism referred to a society ‗which knowingly and as a matter of policy \ndiscriminated against Black people‘ and denied that this was the case in Britain (Scarman \n1982, p.28). However, others have insisted that the Brixton riots should be read as a \nresponse to the 1981 Nationality Act. The creation of a ‗second-class‘ commonwealth \ncitizenship and news coverage of the Act created palpable anxiety and growing rage within \n5 \n \nblack communities across Britain. These communities perceived that a new form of imperial \nracism was driving the citizenship agenda. As an anonymous commentary in the journal \nRace and Class argued in 1981, the Nationality Act transformed immigration law into an \ninstrument of domestic social control and formed ‗the administrative basis for what is \ntantamount to a pass law society. [This Act has] brought immigration law within doors‘ (1981, \np. 242).  \n \nThis Act illustrates what Foucault termed ‗state racism‘: a means of classifying, \ndistinguishing and opposing a population on the basis of appeals to essentialist categories of \norigin. For Foucault racism always disguises, or is an alibi for, an historical class struggle. In \nthe context of Britain a post-imperial class struggle over the resources of a diminished \nEmpire was underway. The 1981 Act, produced `ethnic hierarchies` in Britain which, \ncombined with the existing class divisions, led to civil unrest. This in turn enabled minorities \nto be constituted `as a threat to the social body‘ and targeted through policing and reform \n(see Nelson, 2008, p.33). The claim that the Act was ushering in a new period of ‗home rule‘ \nthrough state racism was central to Salman Rushdie‘s polemical 1982 essay ‗The New \nEmpire within Britain‘. Rushdie argued that as the British Empire contracted, the borders of \nthe Empire were being reproduced at home through newly legitimized practices of state \nracism, which in turn explained hostility towards the police as agents of state power. As \nRushdie wrote, ‗For the citizens of the new, imported Empire, for the colonized Asians and \nblacks of Britain, the police force represents that colonizing army, those regiments of \noccupation and control‘ (1982).  \n \nThe 1981 Nationality Act and the nostalgia for a British homeland expressed within it, \nexposes a fear amongst the ruling elites that Britain was losing its sense of national identity \nas it lost its hold on the Empire. Right wing MP Enoch Powell, who was in many ways the \nreal author of this act, declared on hearing that it had passed through Parliament: ‗from the \nhumiliation of having no nation to which we distinctively belong, the people of the United \nKingdom are now setting themselves free‘. The Nationality Act, Powell stated, marked ‗the \nend of our brief imperial episode ... and the laying of that ghost, the Common-wealth‘ (in \nDixon, 1983, p. 175).  The link between post-imperial national identity, democratic freedom \nand immigration control, has become cemented into a form of common sense in Britain and \ndrives the New Labour citizenship agenda. As Prime Minster Gordon Brown stated in a 2008 \nspeech on citizenship: \n \n6 \n \nthere is a real danger that while other countries gain from having a clear definition of \ntheir destiny in a fast changing global economy, we may lose out if we prove slow to \nexpress and live up to the British values that can move us to act together. ... being \nmore explicit about what it means to be a British citizen we can not only manage \nimmigration in a way that is good for Britain - for our citizens, our way of life, our \nsociety, and our economy but at the same time move forward as a more confident \nBritain (Brown 2008). \n \nState racism is legitimized predominantly through the need for security and the idea that \nnon-citizens threaten to overwhelm the diminishing resources of the Welfare state and are \nstealing the resources which rightfully belong to citizens. Perversely, appeals to Marshallian \nrights-based notions of citizenship, rooted in welfare and distributive justice, are thus used to \nlegitimize the abjection of ‗illegal‘ populations from the protections of citizenship and the \nenforcement of brutal and inhumane immigration controls.  \nHome front \n \nIn the last decade, ‗security‘ has emerged as a central preoccupation of European and North \nAmerican governments. Increasingly, the idea of security is framed less in relation to \nexternal threats than in terms of securing the state from the hidden threats of `dangerous \nclasses` within the ‗nation home‘. In the US this is perhaps best encapsulated by the \nestablishment of the office of Homeland Security in 2001, a title that echoes the now defunct \nBritish Government office, the Ministry of Home Security established during the Second \nWorld War to manage national civil defence in anticipation of foreign invasion. In this \ncontext, the nation is implicitly or explicitly redesignated as the ‗home front‘, a battle line \nbehind which the civilian populace is mobilized as a supporting arm of the military. It implies \nthe imperative of effective militarization of a society during wartime. This redesignation \nlegitimizes the militarization of everyday life and presumes a popular consensus in favour of \nforgoing democratic freedoms in the face of external and internal threats to security.  \nMichael Hardt and Antonio Negri describe the shift from ‗defence‘ to ‗security‘ as a \nmovement from ‗a reactive and conservative‘ to an ‗active and constructive‘ mode of \ngovernment (2005, p.20). For Hardt and Negri this shift is framed by a simultaneous \nmovement to a ‗perpetual state of war‘ in which war is an active and indeed integral \ncomponent of state governance, ‗justifying constant martial activity in the homeland and \nabroad‘ (2005, p.21). Britain, understood as ‗a nation at war‘, is thus able to implement \nendless ‗security measures‘ including the use of ‗terror laws‘ to suspend indefinitely the \n7 \n \nliberties and rights promised by citizenship. Changes to the Terrorism Act in 2006 \ncriminalised ‗anti-governmental‘ activities in ways unprecedented since the Second World \nWar. There have also been calls for Britain to develop its own homeland security office, a \ndevelopment which many predict will be a key recommendation of the Government‘s \nCommission on National Security in the 21st Century. The first publication to result from this \ncommission, entitled ‗The New Front Line: Security in a changing world‘, states that, ‗old \nnotions of the security front line no longer work and that some frontlines now exist overseas \nin places like Afghanistan, while some also exist at the local community level here at home \n(Kearns and Gude, 2008, p.7 ). \nThere is nothing new here, of course. We have been aware for some time that the front line \nis here, at home, this is precisely what Rushdie argues when he states that the frontline of \nthe Empire was brought home by the 1981 Nationality Act. William Walters terms this \nreconfiguration of the relations between citizen, state and territory ‗domopolitics‘: ‗a fateful \nconjunction of home, land and security‘ which ‗rationalizes a series of security measures in \nthe name of a particular conception of home‘ (2004, p. 241). As he writes: \n[Homeland] has powerful affinities with family, intimacy, place: the home as hearth, \na refuge or a sanctuary in a heartless world; the home as our place, where we \nbelong naturally, and where, by definition, others do not; international order as a \nspace of home…Domopolitics embodies a tactic which juxtaposes the ‗warm words‘ \nof community, trust, and citizenship, with the danger words of a chaotic outside - \nillegals, traffickers, terrorists; a game which configures things as ‗Us vs. Them‘ \n(2004, p. 241). \n‗Domopolitics‘ is a performative politics which employs the rhetoric of home as a means of \nsanctioning exceptional measures, including the violent abjection of non-citizens. As Walters \nsuggests, citizenship, a legal sign of belonging to the nation-home, is integral to this \nrefiguration of the nation and, indeed, of the international order as a space of homes. \nFurthermore, domopolitics is perfomative because the mechanisms though which the \nmilitarisation of everyday life is ushered in, are not clandestine but take place in full view with \npublic sanction: from the police brutality in Brixton to the current deportation of hundreds of \nthousands of non-citizens. British citizens demand it. As Foucault has extensively argued, \nevery citizen is sovereign in the context of the bio-political state, just as every German \ncitizen was responsible for spying on and exposing their Jewish neighbours, so in \ncontemporary Britain, all citizens are expected to report on those cheating the system—this \nextends from those seen to be exploiting social security or national health care, to those \n8 \n \nwithout passports. As Didier Bigo (1994) suggests, the militarisation of the nation is figured \nas part of a necessary ‗security continuum‘ that ‗stretches from terrorism to regulation of \nasylum rights, including drugs, action against crime, clandestine immigration, and migratory \nflows‘ (Bigo cited Walters, 2004, p. 240). Citizenship plays a central role within this \nsecuritised State, enabling specific groups and populations to be legitimately targeted and \ncriminalised as non-citizens, or failing citizens. Central to this home rule is a ‗transfer of \nillegitimacy‘ in which previously ‗protected‘ populations, such as regular migrants and asylum \nseekers, and their British-born children, find themselves subjected to diverse bio-political and \ncarceral technologies (Bigo cited Walters, 2004, p. 240).   \nI have argued that from the perspective of the 1981 Act the proliferation of categories of \npeople variously marginalised by or excluded from citizenship (and the rights which flow from \nthis status) is not an unintentional ‗design flaw‘ but is an integral component of British \ncitizenship design. If British citizenship has been designed to fail, it has been thus designed \nin order to govern populations within the state by producing some subjects as successful \ncitizens and others as variously precarious or failed. These failed citizens, who have been \nlegally abjected from the state are nevertheless often contained and sometimes detained \n‗within the state as its interiorised other‘ (Butler 2007, p. 17). These populations of the failed \nare in the strange position of being outside the legal protections of citizenship, but \nnevertheless subject to the full force of state power. As Judith Butler describes it, they are \n‗both expelled and contained...saturated with power at the moment in which [they are] \ndeprived of citizenship‘ (2007, p. 40). In the next part of this article, I will introduce the story \nof one family of failed citizens to examine the ways citizenship functions as a biopolitical \nregime.  \n \nSonia \n \nIn 2006 a heavily pregnant West African teenager, ‗Sonia‘, was apprehended trying to leave \nBritain with a false passport. Despite her young age and her condition, the Crown Court \ndeemed it appropriate, employing new legislative guidance, to punish this offence with a six-\nmonth jail sentence in an adult prison. The court also recommended that Sonia be deported \nimmediately after serving her sentence. For a decade now, Britain has been engaged in a \nsignificant deportation programme.  According to the British Government 63,140 non-citizens \nwere deported in 2008, ‗one person every eight minutes‘ (Byrne2007). The brutal treatment \nof unwanted migrants at the borders of European states and at the land and coastal borders \n9 \n \nof the European Union became routinised during the 1980s and 1990s. Within the \nsecuritised imaginary that currently dominates in Britain, the mass imprisonment and \ndeportation of failed asylum seekers and other suspect foreigners, is widely perceived as the \nonly logical solution to the imagined threats of immigration (Tyler 2006). Sonia‘s case is thus \nnot exceptional, but it nevertheless enables us to focus on some of the micro-practices \nwhich are a consequence of the constellation of citizenship, borders and failure that I have \nbeen describing.  One of few notable things about Sonia‘s case is that it was reported, albeit \nvery briefly and factually, in a national newspaper. In one sense, this news story simply \nreinforces the perception that Britain is ‗tough on illegals‘. From another perspective it is \nextraordinary, for Sonia‗s ‗crime‘ involved an attempt to leave Britain, a country in which she \nwas deemed to be illegally residing.  \nWhen I interviewed Sonia, she explained that when she was arrested at the border she had \nbeen desperate to escape Britain. She had been evicted from her temporary accommodation \nand was destitute, and she feared for what would become of her and her unborn child on the \nstreets of Britain, or if she was deported to her country of origin. So she had planned to \ntravel to another African state where she had some friends and contacts. Now a convicted \ncriminal, Sonia‘s ability to make a fresh claim of asylum had been severely compromised, \nand she has failed all her possible appeals.  \nAsylum-seekers convicted of crimes, however minor, rescind their rights to political asylum in \nBritain. For the purposes of this article, the legitimacy of Sonia‘s claim for refugee protection \nunder interntional law is less significant than her disproportionate treatment by the British \nState. A teenage girl, heavily pregnant in a foreign country, she was imprisoned for six \nmonths and detained for over a year for using a fake passport. Sonia is totally traumatized \nand deeply ashamed at being treated ‗like a criminal...I just really...really...I didn‘t think it was \ntrue...I just couldn‘t believe it ... I worried very much [about] what would people [at home] \nthink of me if they found out‘. Sonia served the full six-month custodial sentence at Holloway \nPrison, where she gave birth to her daughter, ‗Mary‘. She recalled being taken in handcuffs \nto ante-natal appointments and had to endure the presence of prison officers throughout her \nlabour and childbirth.  \nAfter serving her prison sentence, Sonia and Mary were transferred directly to Yarl‘s Wood \nImmigration Detention Centre, the largest immigrant prison for women and children in \nEurope, to await their deportation to West Africa. The detention of people subject to \nmigration control in Britain was first codified under the 1920 Aliens Act and elaborated in the \n1971 Immigration Act. Britain now has more wide-ranging powers than any other European \n10 \n \nnation to imprison foreign nationals, however, prior to 1988 non-citizens were rarely \ndetained, or indeed deported. There were on average between 200 and 300 people in \ndetention at any given time. By 2003, that had ‗escalated to over 2260 people detained, \nincluding children and pregnant women‘ (Welch and Schuster 2005, p. 402). Mary, who had \nbeen imprisoned since her birth, was, like most children in detention, failing to thrive in \nconditions which the British Government‘s own prison inspectors have repeatedly called \ntotally inappropriate for pregnant women, nursing mothers and children. Sonia‗s homeless \nand destitute husband ‗Jonah‘ was stopped from visiting his wife and daughter in detention. \nSonia‘s body shakes as she recounts to me what she happened to Jonah, ‗he was shouting \nand screaming at them [the guards] ... they just said we can‘t tell you if she is here or not \nbecause you don‗t have a [visting] pass...they [the guards] told me later that he went crazy \nright there... ripping at his clothes....crying...finally they brought a doctor [and] took him \naway‘. Jonah was later sectioned under the Mental Health Act (1983). As far as Sonia is \nconcerned he had literally been driven to insanity by the British state. Whilst she was in \nYarl‘s Wood, Sonia took part in a hunger strike with other mothers to protest at the detention \nof their babies and children. Months later, with the support of anti-deportation activists, Sonia \nmanaged to obtain a lawyer and, with the help of a friend, was eventually granted bail out of \ndetention. Mary had spent the first six-months of her life in prison. \n \nWhen I interviewed Sonia in 2009, she was living in social housing in a city in the North of \nEngland with Mary, now a toddler, and a new baby, ‗Sam‗. She tells me Jonah doesn‘t live \nwith her and his children but that he visits them. She suggests, indirectly, that he is \nstruggling with mental health problems. Like all failed asylum seekers, Sonia cannot work. \nShe has absolutely minimal benefits, significantly below those deemed necessary to support \na dignified life for British citizens, and she has no legal access to health or social care. She \nis dependent on charity for basics such as clothing and furniture and receives social housing \nbecause she has children, (otherwise as a failed asylum seeker she would be made \nforceably homeless).  My field notes read. There is little very furniture, or stuff in the house, \napart from a television, which playing an African movie very loudly, and a sofa. Everything is \nclean but I am shocked by the condition of the children, Mary seems tiny for her age and \nthey are both covered in ezcema and rashes,  and they are dressed in dirty clothes. Sonia is \nalso dishevelled, it occurs to me that she is frightened of me. Outside in the garden I see a \nwashing line with all the families clean clothes blowing dry in the wind. I feel ashamed that I \nam passing judgement on her, as though I could possibly know what it means to be living \nher life.  \n11 \n \n \nSonia and her children are surviving in conditions of crushing poverty and deprivation. When \nI ask her how she managed to survive, she reassures me that things `aren‗t that bad now‗ \nand describes as a counterpoint a period immediately after she had been bailed from \nimmigration detention but before she was in reciept of any state benefits. `I  was so hungry, I \nthought I was going  to die - the terrible pains in my stomach‗, she grasps herself as she \ntalks. Sonia has exhausted all her legal appeals for leave to remain in Britain, and remains \nunder ‗bail conditions‗ - subject to detention and deportation at any time. Sonia detailed her \ndaily routines, explaining how she has to register at the local immigrant office each week, \n(ironically, this is in case she absconds). She explains that ‗this is much better than before \nbecause when they first moved me here I had to register everyday and it was a long way \nfrom my house, two buses‗.  Many failed asylum seekers are taken into detention when they \nregister, and Sonia describes how she always leaves her children with a friend whilst she \nattends at the imigration centre, as she thinks that the border and immigration officials will be \nless likely to detain her without them. Registering with the immigration and border control \ncan take hours if it is busy. Throughout my interview with her, Sonia is extremely agitated \nand wary.  She is literally on the edge of her seat.  She relaxes only at the end of the \ninterview when I turn off the recorder. I represent the state who has treated her `worse than \na dog‗, or perhaps one of `those activists` who she worries will draw attention to her, whilst \nwhat she wants is to become invisible: ‗The longer nobody comes [to deport her and the \nchildren], I keep thinking, it is possible they have forgotten about me, and that I can stay and \nhave [a] normal life then the door knocks...I think, ―No!―...because I cannot describe it [the \nprison and the detention centre]...I cannot go back...anything is better than that‗. \n \nSociologist Saskia Sassen argues that the criminalisation of migration is slowly poisoning \nEuropean civic societies. In particular she suggests that the growing numbers of \n(predominantly African) migrant deaths at European borders ‗represent a failing policy, but \nalso a gradual corrosion of the sense of citizenship, responsibility, and ultimately humanity \nitself‘ (2008). Sassen‘s intervention is important, but the risk of this ‗moral bankruptcy‘ \nargument is that it fails to acknowledge the increasingly central role of citizenship in \nestablishing border controls. As I have argued, the 1981 Act instituted a mass classification \nof types of citizens that was designed to exclude specific post-colonial populations and \nmanage ‗migrant‘ populations within the nation-home. The abjection of migrants like Sonia \nand her British-born children, who came to Britain from a former European colony, is an \neffect of the racist design of British citizenship, the abolition of birthright citizenship and \nremoval of residency rights from former colonised peoples.   \n12 \n \nSonia‘s story also reveals how borders are highly gendered practices. As Martha Escobar \nargues, `Ideal migrant labor is frequently defined as sojourner and exploitable, meaning that \nthey migrate, labor for a while, and return to their home countries. The presence of migrant \nwomen disrupts this ideal since they represent reproduction and settlement (2008). \nImmigration controls often focus on the reproductive bodies of women, for example home \noffice guidelines stipulate that pregnant women should be routinely questioned by \nimmigration officials as suspected `heath tourists‘. However, if unwanted migrant mothers \nare soft targets for immigration controls, they are also sites of migrant resistance. For whilst \ntheir status as mothers often constitutes their vulnerability and otherness - as maternal \nfigures who represent `life itself‗ they carry moral and ethical weight, which is why mothers \nand children feature so prominently in anti-deportation campaigns. \nMary \nDespite the fact she was born in Britain, the Government was able to imprison Sonia‘s \ndaughter, Mary, indefinitely from birth because under the British Nationality Act 1981 (which \ncame into force on 1 January 1983) children born in Britain to non-citizen mothers are not \nentitled to British citizenship. As the UK Border Agency states on its website: \nEven if you were born in the United Kingdom, you will not be a British citizen if \nneither of your parents was a British citizen or legally settled here at the time of your \nbirth. This means you are not a British citizen if, at the time of your birth, your parents \nwere in the country temporarily, had stayed on without permission, or had entered \nthe country illegally and had not been given permission to stay here indefinitely \n(United Kingdom Border Agency2008).  \nMary‘s birth certificate, like that of all de facto stateless children born in Britain, was \nconfiscated by the immigration authorities. Had Mary been born before 1983, she would \nautomatically have been granted citizenship, and as a citizen her indefinite detention as a \nBritish Citizen could have been legally challenged. As it stands, Mary, like thousands of \nother children born in Britain each year, is in the extraordinary position of having entered \nBritain illegally at birth. With the cut of the umbilical cord and her first breath she became \nsubject to the full force of Britain‘s border controls including indefinite detention within a \nrapidly expanding, privately owned, ‗for profit‘ immigration prison estate.10  \n \nDetention centres in the UK are generally screened from public view and, as one \nhumanitarian report on conditions inside detention centres notes, ‗The voices of the people \n13 \n \naffected by detention are seldom heard in the debate about immigration detention…. \nDetainees are forcibly physically separated from the outside world. As a result, their rage, \nbewilderment and shock at what is happening to them remains largely hidden‘ (2004, p. 12). \nIf they are released, detainees are often too afraid to speak out about their experiences, \nfearing backlash and targeting from immigration authorities. Hence there are very few \naccounts of detention or representations of British detention sites in circulation. Few images \nexist of the physical structures themselves and little documentary evidence of what takes \nplace within the regimes of detention is in circulation. Places of detention are literally \nenclosed by internal borders, states within states screened from view.  Paradoxically, \nhowever, the existence of detention centres is a matter of public fact, a fact that is routinely \ncapitalised on in Governmental rhetoric as a means of demonstrating Britain‘s ‗toughness‘. \nImmigrant prisons and practices of deportation thus play a central role in materialising \nborders in the national imaginary. Thus detention centres have a visible and instrumental \nexistence; they physically separate citizens and non-citizens, keeping apart those who \ndeserve to be protected by the British state from the abject -- those who do not. Rushdie \nargued that the abolition of birthright citizenship in the 1981 Nationality Act was State \nRacism, the implications of which would impact on all the people of Britain, stripping away \ntheir most fundamental freedoms. As he wrote: \nFor nine centuries any child born on British soil was British. Automatically. By right. \nNot by permission of the State. The Nationality Act abolished the ius soli. From now \non citizenship is the gift of government. You were blind, because you believed the \nAct was aimed at the blacks; and so you sat back and did nothing as Mrs. Thatcher \nstole the birthright of every one of us, black and white, and of our children and \ngrandchildren for ever. \nSince the abolition of birthright citizenship, maternity wards across Britain have become \n‗border zones‘ through which ‗aliens‘ enter Britain. Pregnant non-citizens are searched at \nairports as ‗health tourists‘, turned away from hospitals in childbirth, detained, deported. The \nbodies of non-citizens, pregnant women, mothers and children, have become one of the key \nsites through which Britain‘s national borders materialise. In migration studies, borders have \ntended to be understood as places; however, borders are also practices, and for non-citizen \nmothers the everyday activities of mothering, attending toddlers‘ groups, and the school run \ncan become routines fraught with risk as they make themselves and their children visible \nand thus vulnerable to immigration control.  As Nyers argues, ‗For people without status, \neveryday activities (working, driving, and going to school) are at risk of being transformed \n14 \n \ninto criminal and illicit acts with dire consequences‘ (2008, p.166-167). This anxiety about \nvisibility in everyday situations is not misplaced. As Liz Fekete has noted, the British Home \nOffice issued Border and Immigration Officials with a manual advising on ‗the use of control \nand restraint techniques for deporting asylum seeker children, stipulating that they must \nhave skills in paediatric emergency lifesaving‘. The same manual also ‗gives official sanction \nto the rounding up of children from schools to be detained with their families‘ (2005, p.75). \nFor pregnant women and mothers the possibility of ‗flying below the radar‘ of the social \napparatuses that trigger the bureaucratic machinery of detention and deportation is almost \nimpossible. What Rushdie foresaw was the ways in which governance through citizenship \nwould come to subject not only non-citizens but all citizens, so that all social institutions, \nprisons, factories, hospitals, universities, schools become border zones, sites of immigration \ncontrol.  Indeed, one of the obligations of citizenship is henceforth to establish the right to \ncitizenship of others.  \n \nThe 1981 British Nationality Act has formed the basis for some of the most discriminatory \nand dehumanising state practices to take place on British soil in the modern era. It \ndesignated who could be a citizen and from whom citizenship could be legally deprived. For \nexample, section 40 of the Act granted powers to the Secretary of State to deprive a British \ncitizen of their citizenship status if s\/he ‗is satisfied that to do so is conducive to the public \ngood‘ (Goldsmith 2007). Being without citizenship in a world of states is often devastating. \nAs political scientist Matthew Gibney argues:   \n \nIn an international system where sovereign states each claimed the right to fashion \ntheir entry and citizenship policies according to their own national or ethnic criteria, \nrefugees were outcasts. They were, in Arendt‘s words, ‗the scum of the earth‘ (2004, \np.3)  \n \nWhile international protections, such as the Convention relating to the Status of Refugees \n(1951) and the Convention on the Prevention of Stateless Persons (1954) were ostensibly \nput in place by the international community to enable non-citizens to have access to the \nprotection of states, since the 1980s individual states and regional governments have \nincreasingly flouted international law.  Since the mid 1990s, Britain has witnessed one of the \nlargest imprisonments of foreign nationals (non-citizens) since the internment of German \nnationals during the Second World War, the deportation of hundreds of thousands of failed \nasylum seekers and other ‗illegals‘, and the enforced destitution of at least 250,000 men, \n15 \n \nwomen and children who have failed to secure citizenship, and have no access to the \nprovisions of the welfare state, but are unable or unwilling to return to their often war-torn \ncountries of origin. This final, and by far the largest group, are de facto stateless; they have \nno civil or political rights, no legal right to work, no access to any social security, housing or \nhealth care (except in life or death situations), and they are consequently vulnerable and \nsubject to exploitation (Blitz 2006).   \n \nConclusion \nAt an historical juncture when the British government is instituting a programme of reforms \naimed at ‗deepening citizenship‘ through further legislation, compulsory citizenship \neducation, and new categories of ‗active‘ and ‗earned‘ citizenship (Goldsmith 2008, p.11, \nand Smith 2008), this article has made a critical intervention in debates about citizenship and \nits design. It has explored the abject underside of the democratic veneer of British \ncitizenship, the gap between stated objectives of social citizenship agendas and the \nauthoritarian character of much legislation, policy and practice in this area. This is not an \noriginal claim.  Michel Foucault (and latterly Giorgio Agamben) argued that the bestowal of \nrights and liberties to people always marks the institution of a biopolitical relation between \nthe subject and the state. In this respect, citizenship has always been ‗two-faced‘, ‗the bearer \nboth of subjection to sovereign power and of individual liberties‘ (Agamben, 1998, p. 125). \nSimilarly, political geographer Erik Swyngedouw has used the term ‗governance innovation‘ \nto describe the ways in which the proliferation and expansion of purportedly democratic \nforms, such as citizenship, are employed as a means of controlling and in some cases \nexcluding of populations deemed undesirable (2005, p. 1992). However, this article does \nmake a specific historical claim, that the 1981 British Nationality Act marked a decisive break \nfrom a Marshallian model of liberal citizenship, founded in social justice, welfare and mutual \nobligation, to a model of citizenship, in which it is the responsibility of the individual citizen to \nearn, demonstrate or buy their ‗right‘ to state protection and care. The result is aA citizenship \nwhich combines the post-imperial state racism I have been describing in this essay, with a \nneoliberal ideology in which the market has become ‗an ethic in itself, capable of acting as a \nguide for all human action, and substituting for all previously existing ethical beliefs‘ (Harvey \n2005, p.3). The intersections of state racism and global markets are illustrated by the \ntremendous growth of a global immigration industry, a global multi-billion-dollar business, \nwhich is one arm of the massive ‗industrial corrections complex‘. Whilst it is beyond the \n16 \n \nscope of this article, this argument suggests we need better accounts of the economics of \nstate racism as it intersects with global corporate interests.   \nIn 1981, then, British citizenship was redesigned to fail specific populations.  British \ncitizenship transitioned into biopolitical ‗governmentality‘,11 a vast and proliferating \nbureaucracy from which flow categories of people marginalised by, excluded or disqualified \nfrom citizenship and the rights which flow from this status. British citizenship now describes a \nlegal, political and social field of intelligibility, a biopolitics which produces some bodies and \ngroups as failing, abject or outside of the realm of citizenship altogether. This might mean \nfailures at mundane and banal levels of everyday identification, such as the failure to have \nthe right kind of educational aspirations or the right kind of body, or the kinds of failures I \nhave described in this article--such as possession of the wrong kind of paperwork, the failure \nto produce the right kind of evidence to secure leave to remain, or being born in Britain to a \n‗failed‘ mother. The central point is that failure is an organising logic of British citizenship. \n \nAny account of British citizenship will be provisional because citizenship is continually \nrecreated through complex legal, political, social and pedagogical practices. Different kinds \nof citizens emerge at the intersections of formal and informal practices of states, within \ninstitutions, legal and political practices, communication flows and through pedagogical \ntraining. Conflicting forms of citizenship materialize through local, national and transnational \nbureaucratic processes: for T.H Marshall, debate about citizenship was evidence of its \ndemocratic potentiality. I do not wish to devalue the diverse, rich and important history of \ncitizenship in global democratic struggles, or claim that citizenship can never be a positive \nforce for social change. However, we must acknowledge the other face of citizenship, the \nglobal business in immigrant prisons, the vast, monstrous bureaucracy from which flows \ncategories of destitute peoples marginalised by, excluded or disqualified from citizenship. \nThere are many hundreds of thousands of people like Sonia who are living ‗unliveable lives‘ \nat the borders of the British State, and their children born in British hospitals are de facto \nstateless aliens. As a group of hunger-striking mothers held in immigration detention with \ntheir children wrote in a letter to the British Government in 2008 `Even a dog is better treated \nthan a child who is born in this country‘. If citizenship is increasingly designed for purposes \nof disenfranchisment and political dispossession, in what sense can it be said to retain any \nradical promise for social justice?  \n \nReferences \n17 \n \nWith thanks to Bruce Bennett and Cynthia Weber for editorial advice, and to ‗Sonia‘ for \nallowing me to tell her story. \nAgamben, G. 1998. Homo Sacer: Sovereign Power and Bare Life, trans. Daniel Heller-\nRoazen. Stanford, CA: Stanford University Press. \n \nAnon. 1981. Background - British racism. Race and Class, 23 (1\/2), 232-244. \n  \nArendt, H., 1973 [1948]. The Origins of Totalitarianism. New York: Harcourt, Brace & \nCompany. \nBaucom, I., 1999. Out of Place: Englishness, Empire and the Locations of Identity. New \nJersey: Princeton University Press. \n \nBeveridge, W., 1942. Social Insurance and Allied Services.  London, HMSO. \nAvailable from: http:\/\/news.bbc.co.uk\/1\/shared\/bsp\/hi\/pdfs\/19_07_05_beveridge.pdf \n \nBlitz, B., 2006. Statelessness and the Social (De)Construction of Citizenship: Political \nRestructuring and Ethnic Discrimination in Slovenia. Journal of Human Rights 5 (4), 453-\n479. \n \nBrown, G., 2008. Managed Migration and Earned Citizenship: Speech to members of the \nthird sector and local government representatives in North London. [transcript online]. \nAvailable at: http:\/\/www.astrid-online.it\/Immigrazio\/Studi--ric\/GORDON-BROWN-Managed-\nMigration-and-Earned-Citizenship-20_02_08.pdf [Accessed 1 April 2009] \n \nBrysk, A. and Shafir, G. (Eds), 2004. People Out of Place: Globalization, Human Rights, and \nthe Citizenship Gap (New York, Routledge). \n \nButler, J. and Spivak, G. 2007. Who Sings the Nation State. (Calcutta, Seagull). \n \nByrne, L., 2007 ‗Border Security and Immigration: Our Deal for Delivery in 2008‘ [online]. \nAvailable from: \nhttp:\/\/www.ukba.homeoffice.gov.uk\/sitecontent\/documents\/news\/Milestones_final_speech_1\n4.1.pdf [Accessed 1 April 2009] \n \n18 \n \nCrick Report., 1988. Education for Citizenship and the Teaching of Democracy in Schools, \nFinal report of the Advisory Group on Citizenship. London: QCA. [online]. Available at: \nhttp:\/\/www.qca.org.uk\/libraryAssets\/media\/6123_crick_report_1998.pdf \n[Accessed 1 April 2009] \n \nDixon, D., 1981. Constitutionalising Racism: The British Nationality Bill 1981. Critical Social \nPolicy, 1 (22), 94-100. \n \nDixon, D., 1983. Thatcher's People: The British Nationality Act 1981. Journal of Law and \nSociety, 10 (2), 161-180.  \n \nEscobar, M., 2006. ‗Violent Intersections: The Role of Prisons and Welfare in the Exclusion \nof Mexican Immigrant Women‘ UCSD. \n \nMothers United in Yarl's Wood IRC. 2008. Listen To Our Cry. [online].Available from: \nhttp:\/\/www.ncadc.org.uk\/archives\/filed%20newszines\/oldnewszines\/Old%2051-\n100\/Newszine93\/Yarl'sWood.html  [Accessed 1 April] \n \nFekete, L., 2005. ‗The deportation machine: Europe, asylum and human rights‘ Race and \nClass 47(1): 64–91.  \n \nFoucault, M., 1981. The History of Sexuality: Volume I. trans. Robert Hurley. London: \nPenguin.  \nFoucault, M., 2003. Society must be defended: Lectures at the Collège de France 1975- \n1976. Translated David Macey. Picador, New York \nG4S. 2009. Securing Your World. http:\/\/www.g4s.com [Accessed 1 April]. \nGibney, M., 2004. The Ethics and Politics of Asylum: Liberal Democracy and the Response \nto Refugees. Oxford: Oxford University Press. \nGoldsmith, Lord. 2008. Citizenship Our Common Bond [online]. \nhttp:\/\/www.justice.gov.uk\/docs\/citizenship-report-full.pdf [Accessed 1 April]. \nHarvey, D., 2005. A Brief History of Neoliberalism Oxford University Press. \n19 \n \nImmigration Law Practitioners‘ Association (IPLA), 2007.Submission to Lord Goldsmith for \nthe Citizenship Review: The Different Categories of British Nationality. [online]. Available at: \nhttp:\/\/www.justice.gov.uk\/docs\/ilpa-citizenship.pdf \n \nIsin, E., and Turner, B . 2007. Investigating Citizenship: An Agenda for Citizenship Studies. \nCitizenship Studies.11 (1):  5 – 17.  \n \nKearns, I., and Gude, K., 2008., The New Front Line: Security in a changing world \nippr Commission on National Security. Institute for Public Policy Research [online]. Available \nat: http:\/\/www.ippr.org\/publicationsandreports\/publication.asp?id=588 \n \nKeith, M., 1993. Race, Riots and Policing: Lore and Disorder in a Multi-Racist Society. \nLondon: UCL Press. \n \nKeynes, J. M.,. 1936. The General Theory of Employment , Interest and Money. London: \nMacmillan \n \n \nMarshall, T.H., 1950. Citizenship and social class and other essays. Cambridge: Cambridge \nUniversity Press.   \n \nMau, B., 2004. Massive change. London: Phaidon Press. \n \nMothers United in Yarl's Wood IRC. 2008. Listen to our Cry. [online] Available at: \nhttp:\/\/www.ncadc.org.uk\/archives\/filed%20newszines\/oldnewszines\/Old%2051-\n100\/Newszine93\/Yarl'sWood.html [Accessed 1 April] \n \nNelson, J., 2008. Razing Africville: A Geography of Racism. University of Toronto Press: \nToronto ; Buffalo \n \nNyers, P., (2004) ‗Introduction: What's left of citizenship?‘ Citizenship Studies 8(3). 203-215. \n \nNyers, P., 2006. Rethinking Refugees: Beyond States of Emergency. New York, \nRoutledge. \n \n20 \n \nRushdie, S., 1982. The New Empire Within Britain. New Society, 417- 421 [online] Available \nfrom:  http:\/\/www.english.ccsu.edu\/hegglund\/206\/rushdie_empire.htm [Accessed 1 April \n2009] \n \nSassen, S., A universal harm: making criminals of migrants. Open Democracy [online]. \nAvailable from:  \nhttp:\/\/www.opendemocracy.net  [Accessed 1 April] \n \nScarman, Lord. 1982. The Scarman Report The Brixton Disorders 10-12 April 1981. London: \nPenquin. \n \nSmith, J., et al. 2008. The Path for Citizenship: Next Steps in Reforming the Immigration \nSystem. Border and Immigration Agency Communications Directorate. \n \nSwyngedouw, E.,  2005. Governance Innovation and the Citizen: The Janus Face of \nGovernance-beyond-the-State. Urban Studies, 42 (11),1991-2006. \n \nThatcher, M., 1978. Immigration Interview. Granada Television, [online]. Available from: \nhttp:\/\/www.margaretthatcher.org\/speeches\/displaydocument.asp?docid=103485  [Accessed \n1 April] \n \nTyler, I., 2006. 'Welcome to Britain': The Cultural Politics of Asylum. European \nJournal of Cultural Studies 9(2),185 - 202 \nUK Border Agency Website \nhttp:\/\/www.ukba.homeoffice.gov.uk\/britishcitizenship\/othernationality\/Britishcitizenship\/bornin\nukorqualifyingterritory\/ [Accessed 1 Apri 2009] \nWalters, W., 2004. Secure Borders, Safe Haven, Domopolitics. Citizenship Studies, 8 (3): \n237-260. \n \nWeber, C., Forthcoming. ‗I am an American‘:  Video portraits of unsafe US citizens. \nMillennium.  \n \nWeber, C., 2007.  ‗I am an American‘ film project.  \nhttp:\/\/www.youtube.com\/user\/opendemocracyteam. \n \nWeber, C., 2008. Designing safe citizens. Citizenship Studies, 12:2, 125 – 142 \n21 \n \n \n \nWelch, M. and Schuster. L.,2005. Detention of asylum seekers in the UK and USA: \nDeciphering noisy and quiet constructions.Punishment & Society 7(4): 397 - 417. \n                                                          \n1\n I am indebted to Weber‘s argument that citizenship designates some US citizens as \nnormal, safe, and successful and others abnormal, unsafe, and temporarily failed (Weber, \n2007, forthcoming). \n2  Biopolitics is understood here as the ‗explosion of numerous and diverse techniques for \nachieving the subjugation of bodies and the control of populations‘ (see Foucault, 1981. p. \n140).  \n3 See Keith 1993. \n4 `National minorities` is a term used by Hannah Arendt to describe precarious populations \nwithin a nation-state who risk disenfranchishment. \n5 Whilst British citizenship has arguably existed in fragmented forms in common law since \nthe mediæval period, it was predominantly a means of legal protection (for property owners) \nagainst crown and\/or state power, enabling the wealthy to remain free from state \ninterference, rather than offering rights or protections to the majority population (see Isin and \nTurner, 2007, p.6). \n6 It was Marshall‘s pivotal ‗Citizenship and Social Class‘ (1950) that placed citizenship at the \ncentre of debates about the establishment of a new ‗civic bargain‘ between the individual \nand the state in Britain. In a series of essays and books written over three decade, Marshall \nlaid down the principles of a social citizenship founded in equality and political solidarity \nacross classes. Nevertheless, within popular culture citizenship remained an obscure and \noften derided concept associated with radical unionism or communist politics. \n \n7 Approximately a quarter of residents of Brixton are of African and\/or Caribbean descent. \nBrixton is particularly associated with the ‗Windrush Generation‘ British Nationals from the \nformer colonies who immigrated to Britain from the West Indies in the 1940s.   \n8 ‗Sus law‘ is the informal name for the use of an 1824 law which enabled police to ‗stop and \nsearch‘ people on suspicion alone. This law was abolished as a consequence of the Brixton \nriots and as a recommendation of the Scarman Report (1982). However, recent terror laws \nhave arguably returned the powers of 'sus law' to the police \n9 This data is taken from Channel Four, \nhttp:\/\/www.channel4.com\/history\/microsites\/U\/untold\/programs\/riot\/timeline.html \n \n10 The detention of Sonia and Mary cost British taxpayers at least £2,000 a week. This was \npaid to Global Solutions Limited (GSL), the multinational company that managed Yarl‘s \nWood during this period. GSL is an arm of multinational security company GS4, which \ndescribes itself as ‗the largest security services provider globally with operations in more \nthan 100 countries on 6 continents‘, a turnover of £4.5 billion in 2007, and over 570,000 \nemployees (GS4, 2009). In July 2007, then Immigration Minister Liam Byrne delivered a \nspeech to Border and Immigration Agency staff entitled ‗Border Security and Immigration: \n22 \n \n                                                                                                                                                                                    \nOur Deal for Delivery in 2008‘, in which he promised further, massive expansion of Britain‘s \ndetention estate, financed through public-private partnerships.  \n \n11 I am defining governmentality, after Foucault, as a mode of governance in which power \nand authority is defused and becomes distributed through a range of social and institutional \nsites and practices within the state. \n"}