{"doi":"10.1080\/14616730601151417","coreId":"103202","oai":"oai:repository.tavistockandportman.ac.uk:109","identifiers":["oai:repository.tavistockandportman.ac.uk:109","10.1080\/14616730601151417"],"title":"A controlled study of hostile-helpless states of mind among borderline and dysthymic women","authors":["Hobson, R Peter","Lyons-Ruth, Karlen","Melnick, Sharon","Patrick, Matthew"],"enrichments":{"references":[{"id":803041,"title":"A relational diathesis model of hostile-helpless states of mind: Expressions in mother-infant interaction. In","authors":[],"date":"1999","doi":null,"raw":"Lyons-Ruth, K., Bronfman, E., & Atwood, G. (1999). A relational diathesis model of hostile-helpless states of mind: Expressions in mother-infant interaction. In J. Solomon & C. George (Eds.), Attachment disorganization (pp. 33–69). New York: Guilford.","cites":null},{"id":806238,"title":"Adult attachment rating and classiﬁcation system. Unpublished scoring manual (Version 5.0).","authors":[],"date":"1991","doi":null,"raw":"Main, M., & Goldwyn, R. (1991). Adult attachment rating and classiﬁcation system. Unpublished scoring manual (Version 5.0). Department of Psychology, University of California, Berkeley, CA.","cites":null},{"id":806916,"title":"Adult attachment rating and classiﬁcation system. Unpublished scoring manual.","authors":[],"date":"1985","doi":null,"raw":"Main, M., Goldwyn, R., & Hesse, E. (1985–2005). Adult attachment rating and classiﬁcation system. Unpublished scoring manual. Department of Psychology, University of California, Berkeley, CA.","cites":null},{"id":813980,"title":"Affective and impulsive personality disorder traits in the relatives of patients with borderline personality disorder.","authors":[],"date":"1991","doi":null,"raw":"Silverman, J., Pinkham, L., Horvath, T., Coccara, E., Klar, H., Schear, S., et al. (1991). Affective and impulsive personality disorder traits in the relatives of patients with borderline personality disorder. American Journal of Psychiatry, 148, 1378–1385.","cites":null},{"id":787833,"title":"American Psychiatric Association.","authors":[],"date":"1987","doi":"10.1007\/springerreference_179659","raw":"American Psychiatric Association. (1987). Diagnostic and statistical manual of mental disorders (3rd ed.). Washington, DC: Author.","cites":null},{"id":812137,"title":"An approach to the psychobiology of personality disorders.","authors":[],"date":"2003","doi":"10.1017\/s0954579403000506","raw":"Posner, M. I., Rothbart, M. K., Vizueta, N., Thomas, K. M., Levy, K. N., Fosella, J., Silbersweig, D., Stern, E., Clarkin, J., & Kernberg, O. (2003). An approach to the psychobiology of personality disorders. Development & Psychopathology, 15(4), 1093–1106. Borderline and dysthymic women 15 D o w n l o a d e d B y : [ T a v i s t o c k & P o r t m a n C e n t r e ] A t : : M a y","cites":null},{"id":793263,"title":"Assessment of dysfunctional beliefs in borderline personality disorder.","authors":[],"date":"2002","doi":"10.1016\/s0005-7967(02)00031-1","raw":"Butler, A. C., Brown, G. K., Beck, A. T., & Grisham, J. R. (2002). Assessment of dysfunctional beliefs in borderline personality disorder. Behaviour Research & Therapy, 40, 1231–1240.","cites":null},{"id":791451,"title":"Attachment and loss.","authors":[],"date":"1980","doi":"10.1017\/s0021932000013596","raw":"Bowlby, J. (1980). Attachment and loss. Vol. 3: Loss: Sadness and depression. New York: Basic Books.","cites":null},{"id":795295,"title":"Attachment organization in maltreated preschoolers.","authors":[],"date":"1991","doi":"10.1017\/s0954579400007598","raw":"Cicchetti, D., & Barnett, D. (1991). Attachment organization in maltreated preschoolers. Development and Psychopathology, 3, 397–411.","cites":null},{"id":815285,"title":"Attachment patterns at age six in south Germany: Predictability from infancy and implications for preschool behavior.","authors":[],"date":"1994","doi":"10.2307\/1131301","raw":"Wartner, U. G., Grossmann, K., Fremmer-Bombik, E., & Suess, G. (1994). Attachment patterns at age six in south Germany: Predictability from infancy and implications for preschool behavior. Child Development, 65, 1014– 1027.","cites":null},{"id":787169,"title":"Attachment studies with borderline patients: A review.","authors":[],"date":"2004","doi":"10.1080\/10673220490447218","raw":"Agrawal, H. R., Gunderson, J., Holmes, B. M., & Lyons-Ruth, K. (2004). Attachment studies with borderline patients: A review. Harvard Review of Psychiatry, 12, 94–104.","cites":null},{"id":7599342,"title":"Biparental failure in the childhood experiences of borderline patients.","authors":[],"date":"2000","doi":"10.1521\/pedi.2000.14.3.264","raw":"Zanarini, M. C., Frankenburg, F. R., & Reich, D. B. (2000). Biparental failure in the childhood experiences of borderline patients. Journal of Personality Disorders, 14, 264–273.","cites":null},{"id":7599212,"title":"Child Care Research Network.","authors":[],"date":"2001","doi":"10.3102\/00028312042003537","raw":"NICHD Early Child Care Research Network. (2001). Child-care and family predictors of preschool attachment and stability from infancy. Developmental Psychology, 37, 847–862.","cites":null},{"id":808244,"title":"Child-care and family predictors of preschool attachment and stability from infancy.","authors":[],"date":"2001","doi":"10.1037\/\/0012-1649.37.6.847","raw":null,"cites":null},{"id":7599345,"title":"Childhood experiences of borderline patients.","authors":[],"date":"1989","doi":"10.1016\/0010-440x(89)90114-4","raw":"Zanarini, M., Gunderson, J., Marino, M., Schwartz, E., & Frankenburg, F. (1989). Childhood experiences of borderline patients. Comprehensive Psychiatry, 30, 18–25.","cites":null},{"id":805477,"title":"Childhood experiences of trauma and loss have different relations to maternal unresolved and hostile-helpless states of mind on the AAI. Attachment and Human Development,","authors":[],"date":"2003","doi":"10.1080\/14616730310001633410","raw":"Lyons-Ruth, K., Yellin, C., Melnick, S., & Atwood, G. (2003). Childhood experiences of trauma and loss have different relations to maternal unresolved and hostile-helpless states of mind on the AAI. Attachment and Human Development, 5, 330–352.","cites":null},{"id":792643,"title":"Childhood sexual and physical abuse as factors in adult psychiatric illness.","authors":[],"date":"1987","doi":null,"raw":"Bryer, J. B., Nelson, B. A., Miller, J. B., & Krol, P. A. (1987). Childhood sexual and physical abuse as factors in adult psychiatric illness. American Journal of Psychiatry, 144, 1426–1430.","cites":null},{"id":799930,"title":"Childhood trauma in borderline personality disorder.","authors":[],"date":"1989","doi":null,"raw":"Herman. J., Perry, J., & van der Kolk, B. (1989). Childhood trauma in borderline personality disorder. American Journal of Psychiatry, 146, 490–495.","cites":null},{"id":7599255,"title":"Classiﬁcation of occupations.","authors":[],"date":"1965","doi":null,"raw":"0Registrar General. (1965). Classiﬁcation of occupations. London: HMSO.","cites":null},{"id":798532,"title":"D o w n lo ad ed B y: [ Ta vi st oc k & Po rt ma n Ce nt re","authors":[],"date":"1985","doi":null,"raw":null,"cites":null},{"id":812623,"title":"Developmental aspects of borderline personality disorder.","authors":[],"date":"2001","doi":"10.1080\/10673220127909","raw":"Reich, D. B., & Zanarini, M. C. (2001). Developmental aspects of borderline personality disorder. Harvard Review of Psychiatry, 9, 294–301.","cites":null},{"id":789047,"title":"Developmental protective and risk factors in borderline personality disorder: A study using the adult attachment interview.","authors":[],"date":"2003","doi":"10.1080\/1461673031000078634","raw":null,"cites":null},{"id":7599038,"title":"Developmental protective and risk factors in borderline personality disorder: A study using the adult attachment interview. Attachment and Human Development,","authors":[],"date":"2003","doi":"10.1080\/1461673031000078634","raw":"Barone, L. (2003). Developmental protective and risk factors in borderline personality disorder: A study using the adult attachment interview. Attachment and Human Development, 5, 64–77.","cites":null},{"id":814616,"title":"Disorganized attachment in early childhood: Meta-analysis of precursors, concomitants, and sequelae.","authors":[],"date":"1999","doi":"10.1017\/s0954579499002035","raw":"van IJzendoorn, M. H., Schuengel, C., & Bakermans-Kranenburg, M. J. (1999). Disorganized attachment in early childhood: Meta-analysis of precursors, concomitants, and sequelae. Development and Psychopathology, 11, 225–249.","cites":null},{"id":793914,"title":"Disorganized\/disoriented attachment relationships in maltreated infants.","authors":[],"date":"1989","doi":"10.1037\/\/0012-1649.25.4.525","raw":"Carlson, V., Cicchetti, D., Barnett, D., & Braunwald, K. (1989). Disorganized\/disoriented attachment relationships in maltreated infants. Developmental Psychology, 25, 525–531. Carver, C. S., & Ganellen, R. J. (l983). Depression and components of self-punitiveness: High standards, selfcriticism, and overgeneralization. Journal of Abnormal Psychology, 92, 330–337.","cites":null},{"id":790249,"title":"Do object relations deﬁcits distinguish BPD from other diagnostic groups?","authors":[],"date":"1988","doi":"10.1002\/1097-4679(198807)44:4<511::aid-jclp2270440406>3.0.co;2-t","raw":"Bell, M., Billington, R., & Cicchetti, D. (1988). Do object relations deﬁcits distinguish BPD from other diagnostic groups? Journal of Clinical Psychology, 44, 511–516.","cites":null},{"id":788407,"title":"Early traumatic life events, parental attitudes, family history, and birth risk factors in patients with borderline personality disorder and healthy controls.","authors":[],"date":"2005","doi":"10.1016\/j.psychres.2003.07.008","raw":"Bandelow, B., Krause, J., Wedekind, D., Broocks, A., Hajak, G., & Ruther, E. (2005). Early traumatic life events, parental attitudes, family history, and birth risk factors in patients with borderline personality disorder and healthy controls. Psychiatry Research, 134, 169–179.","cites":null},{"id":790838,"title":"Electrophysiological aberration in borderline personality disorder: State of the evidence.","authors":[],"date":"2003","doi":"10.1176\/appi.neuropsych.15.2.145","raw":"Boutros, N. N., Torello, M., & McGlashan, T. H. (2003). Electrophysiological aberration in borderline personality disorder: State of the evidence. Journal of Neuropsychiatry & Clinical Neuroscience, 15, 145–154.","cites":null},{"id":792063,"title":"Etiology of borderline personality disorder: Disentangling the contributions of intercorrelated antecedents.","authors":[],"date":"2005","doi":"10.1097\/01.nmd.0000149215.88020.7c","raw":"Bradley, R., Jenei, J., & Westen, D. (2005). Etiology of borderline personality disorder: Disentangling the contributions of intercorrelated antecedents. Journal of Nervous & Mental Disease, 193, 24–31.","cites":null},{"id":805531,"title":"Expanding the concept of unresolved mental states: Hostile\/Helpless states of mind on the adult attachment interview are associated with atypical maternal behavior and infant disorganization.","authors":[],"date":"2005","doi":"10.1017\/S0954579405050017","raw":"Lyons-Ruth, K., Yellin, C., Melnick, S., & Atwood, G. (2005). Expanding the concept of unresolved mental states: Hostile\/Helpless states of mind on the adult attachment interview are associated with atypical maternal behavior and infant disorganization. Development and Psychopathology, 17, 1–23.","cites":null},{"id":796081,"title":"Exploring the intergenerational transmission of attachment disorganization.","authors":[],"date":"2006","doi":null,"raw":"Finger, B. (2006). Exploring the intergenerational transmission of attachment disorganization. Unpublished doctoral dissertation, Department of Psychology, University of Chicago.","cites":null},{"id":816050,"title":"Family studies of borderline personality disorder: A review.","authors":[],"date":"2003","doi":"10.1097\/00023727-200301000-00002","raw":"White, L. N., Gunderson, J. G., Zanarini, M. L., & Hudson, J. I. (2003). Family studies of borderline personality disorder: A review. Harvard Review of Psychiatry, 11, 8–19.","cites":null},{"id":813283,"title":"Frightening maternal behavior linking unresolved loss and disorganized infant attachment.","authors":[],"date":"1999","doi":"10.1037\/0022-006x.67.1.54","raw":"Schuengel, C., Bakermans-Kranenburg, M., & van IJzendoorn, M. (1999). Frightening maternal behavior linking unresolved loss and disorganized infant attachment. Journal of Consulting and Clinical Psychology, 67, 54–63.","cites":null},{"id":804815,"title":"Hostile-helpless relational models and disorganized attachment patterns between parents and their young children: Review of research and implications for clinical work.","authors":[],"date":"2004","doi":null,"raw":"Lyons-Ruth, K., Melnick, S., Bronfman, E., Sherry, S., & Llanas, L. (2004). Hostile-helpless relational models and disorganized attachment patterns between parents and their young children: Review of research and implications for clinical work. In L. Atkinson & S. Goldberg (Eds.), Attachment issues in psychopathology and intervention (pp. 65–94). Mahwah, NJ: Erlbaum.","cites":null},{"id":808680,"title":"Malevolent object representations in borderline personality disorder and major depression.","authors":[],"date":"1992","doi":"10.1037\/0021-843X.101.1.61","raw":"Nigg, J. T., Lohr, N. E., Westen, D., Gold, L. J., & Silk, K. R. (1992). Malevolent object representations in borderline personality disorder and major depression. Journal of Abnormal Psychology, 101, 61–67.","cites":null},{"id":803472,"title":"Maternal frightened, frightening, or atypical behavior and disorganized infant attachment patterns. In","authors":[],"date":"1999","doi":"10.1111\/1540-5834.00034","raw":"Lyons-Ruth, K., Bronfman, E., & Parsons, E. (1999). Maternal frightened, frightening, or atypical behavior and disorganized infant attachment patterns. In J. Vondra & D. Barnett (Eds.), Atypical patterns of infant attachment: Theory, research, and current directions. Monographs of the Society for Research in Child Development, 64 (3, Serial No. 258), 67–96.","cites":null},{"id":801166,"title":"Maternal sensitivity and infant triadic communication.","authors":[],"date":"2004","doi":"10.1111\/j.1469-7610.2004.00238.x","raw":"Hobson, R. P., Patrick, M. P. H., Crandell, L. E., Perez, R. M. G., & Lee, A. (2004). Maternal sensitivity and infant triadic communication. Journal of Child Psychology & Psychiatry, 45, 470–480.","cites":null},{"id":797859,"title":"Mourning and melancholia. In","authors":[],"date":"1957","doi":"10.1097\/00005053-192211000-00066","raw":null,"cites":null},{"id":795986,"title":"Neural darwinism.","authors":[],"date":"1987","doi":"10.1111\/npqu.11422","raw":"Edelman, G. M. (1987). Neural darwinism. New York: Basic Books.","cites":null},{"id":808906,"title":"Object representations in the early memories of sexually abused borderline patients.","authors":[],"date":"1991","doi":null,"raw":"Nigg, J., Silk, K., Westen, D., Lohr, N., Gold, L., Goodrich, S., et al. (1991). Object representations in the early memories of sexually abused borderline patients. American Journal of Psychiatry, 148, 864–869.","cites":null},{"id":801780,"title":"Objectivity in psychoanalytic judgements.","authors":[],"date":"1998","doi":"10.1192\/bjp.173.2.172","raw":"Hobson, R. P., Patrick, M. P. H., & Valentine, J. D. (1998). Objectivity in psychoanalytic judgements. British Journal of Psychiatry, 173, 172–177.","cites":null},{"id":7599348,"title":"Parents’ emotional neglect and overprotection according to recollections of patients with borderline personality disorder.","authors":[],"date":"1991","doi":null,"raw":"Zweig-Frank, H., & Paris, J. (1991). Parents’ emotional neglect and overprotection according to recollections of patients with borderline personality disorder. American Journal of Psychiatry, 148, 648–651. 16 K. Lyons-Ruth et al. D o w n l o a d e d B y : [ T a v i s t o c k & P o r t m a n C e n t r e ] A t : : M a y","cites":null},{"id":800549,"title":"Personal relatedness and attachment in infants of mothers with borderline personality disorder.","authors":[],"date":"2005","doi":"10.1017\/s0954579405050169","raw":"Hobson, R. P., Patrick, M., Crandell, L., Garcia-Perez, R., & Lee, A. (2005). Personal relatedness and attachment in infants of mothers with borderline personality disorder. Development and Psychopathology, 17, 329–347.","cites":null},{"id":811497,"title":"Personality disorder and mental representation of early social experience.","authors":[],"date":"1994","doi":"10.1017\/s0954579400004648","raw":"Patrick, M., Hobson, R. P., Castle, P., Howard, R., & Maughan, B. (1994). Personality disorder and mental representation of early social experience. Development and Psychopathology, 6, 375–388.","cites":null},{"id":804911,"title":"Pervasively unintegrated\/hostile-helpless states of mind on the Adult Attachment Interview. Unpublished coding manual,","authors":[],"date":"1995","doi":"10.1017\/S0954579405050017","raw":"Lyons-Ruth, K., Melnick, S., Yellin, C., & Atwood, G. (1995–2005). Pervasively unintegrated\/hostile-helpless states of mind on the Adult Attachment Interview. Unpublished coding manual, Department of Psychiatry, Cambridge Hospital\/Harvard Medical School, Cambridge, MA.","cites":null},{"id":815923,"title":"Physical and sexual abuse in adolescent girls with borderline personality disorder.","authors":[],"date":"1990","doi":"10.1037\/h0079175","raw":"Westen, D., Ludolph, P., Misle, B., Rufﬁns, S., & Block, J. (1990). Physical and sexual abuse in adolescent girls with borderline personality disorder. American Journal of Orthopsychiatry, 60, 55–66.","cites":null},{"id":802442,"title":"Positron emission tomography in female patients with borderline personality disorder.","authors":[],"date":"2003","doi":"10.1016\/s0022-3956(02)00084-5","raw":"Juengling, F. D., Schmahl, C., Heblinger, B., Ebert, D., Bremner, J. D., Gostomozyk, J., et al. (2003). Positron emission tomography in female patients with borderline personality disorder. Journal of Psychiatric Research, 37, 109–115.","cites":null},{"id":804141,"title":"Prospective longitudinal predictors of borderline and conduct symptoms in late adolescence: The early caregiving context. In","authors":[],"date":"2005","doi":null,"raw":"Lyons-Ruth, K., Holmes, B., & Hennighausen, K. (2005, April). Prospective longitudinal predictors of borderline and conduct symptoms in late adolescence: The early caregiving context. In P. Hobson & K. Lyons-Ruth (Co-Chairs), Borderline psychopathology and early caregiving: Concurrent and longitudinal relations. Symposium conducted at the biennial meeting of the Society For Research in Child Development, Atlanta, GA.","cites":null},{"id":810872,"title":"Psychological risk factors for borderline personality disorder in female patients.","authors":[],"date":"1994","doi":"10.1016\/0010-440x(94)90023-x","raw":"Paris, J., Zweig-Frank, H., & Guzder, J. (1994). Psychological risk factors for borderline personality disorder in female patients. Comprehensive Psychiatry, 35, 301–305.","cites":null},{"id":799264,"title":"relations in psychoanalytic theory.Cambridge,MA:HarvardUniversity","authors":[],"date":"1983","doi":null,"raw":null,"cites":null},{"id":7599346,"title":"Reported pathological childhood experiences associated with the development of borderline personality disorder.","authors":[],"date":"1997","doi":null,"raw":"Zanarini, M. C., Williams, A. A., Lewis, R. E., Reich, R. B., Vera, S. C., Marino, M. F., et al. (1997). Reported pathological childhood experiences associated with the development of borderline personality disorder.","cites":null},{"id":807577,"title":"Security in infancy, childhood and adulthood: A move to the level of representation.","authors":[],"date":"1985","doi":"10.2307\/3333827","raw":"Main, M., Kaplan, N., & Cassidy, J. (1985). Security in infancy, childhood and adulthood: A move to the level of representation. In I. Bretherton & E. Waters (Eds.), Growing Points of Attachment Theory and Research. Monographs of the Society for Research in Child Development, 50 (1–2), 66–104.","cites":null},{"id":7599347,"title":"Severity of reported childhood sexual abuse and its relationship to severity of borderline psychopathology and psychosocial impairment among borderline inpatients.","authors":[],"date":"2002","doi":"10.1097\/00005053-200206000-00006","raw":"Zanarini, M. C., Young, L., & Frankenburg, F. R. (2002). Severity of reported childhood sexual abuse and its relationship to severity of borderline psychopathology and psychosocial impairment among borderline inpatients. Journal of Nervous & Mental Disease, 190, 381–387.","cites":null},{"id":797319,"title":"Societies of brains.","authors":[],"date":"1995","doi":null,"raw":"Freeman, W. (1995). Societies of brains. Hillsdale, NJ: Erlbaum.","cites":null},{"id":795386,"title":"Still-face’’ interactions between mothers with borderline personality disorder and their 2-month-old infants.","authors":[],"date":"2003","doi":"10.1192\/bjp.183.3.239","raw":"Crandell, L. E., Patrick, M. P. H., & Hobson, R. P. (2003). ‘‘Still-face’’ interactions between mothers with borderline personality disorder and their 2-month-old infants. British Journal of Psychiatry, 183, 239–247.","cites":null},{"id":7599115,"title":"The Attachment Interview for Adults. Unpublished manuscript,","authors":[],"date":"1985","doi":null,"raw":"0George, C., Kaplan, N., & Main, M. (1985). The Attachment Interview for Adults. Unpublished manuscript, University of California, Berkeley. Greenberg,J.,&Mitchell,S.(1983).Objectrelationsinpsychoanalytictheory.Cambridge,MA:HarvardUniversityPress.","cites":null},{"id":789609,"title":"The Beck Depression Inventory. In","authors":[],"date":"1984","doi":"10.1007\/springerreference_179754","raw":"Beck, A. (1984). The Beck Depression Inventory. In M. Williams (Ed.), The psychological treatment of depression: A guide to the theory and practice of cognitive behavioral therapy. New York: Free Press.","cites":null},{"id":794653,"title":"The MacArthur Working Group on Attachment: Attachment organization in preschool children: Coding guidelines (3rd ed.).","authors":[],"date":"1991","doi":null,"raw":"Cassidy, J., & Marvin, R. S. (1991). The MacArthur Working Group on Attachment: Attachment organization in preschool children: Coding guidelines (3rd ed.). Unpublished manuscript.","cites":null},{"id":796684,"title":"The relation of attachment status, psychiatric classiﬁcation, and responses to psychotherapy.","authors":[],"date":"1996","doi":"10.1037\/\/0022-006x.64.1.22","raw":"Fonagy, P., Leigh, T., Steele, M., Steele, H., Kennedy, G., Mattoon, M., et al. (1996). The relation of attachment status, psychiatric classiﬁcation, and responses to psychotherapy. Journal of Consulting and Clinical Psychology, 64, 22–31.","cites":null},{"id":7599114,"title":"The standard edition of the complete psychological works of","authors":[],"date":"1957","doi":"10.1037\/021356","raw":"Freud, S. (1957). Mourning and melancholia. In J. Strachey (Ed. & Trans.), The standard edition of the complete psychological works of Sigmund Freud (Vol. 14, pp. 237–260). London: Hogarth Press. (Original work published 1917). 14 K. Lyons-Ruth et al. D o w n l o a d e d B y : [ T a v i s t o c k & P o r t m a n C e n t r e ] A t : : M a y","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"The aim of this study was to determine whether women with borderline personality disorder (BPD) are more likely than those with dysthymia to manifest contradictory Hostile-Helpless (HH) states of mind. A reliable rater blind to diagnosis evaluated features of such mental representations in transcripts of Adult Attachment Interviews from 12 women with BPD and 11 women with dysthymia of similar socioeconomic status (SES), all awaiting psychotherapy. In keeping with three hierarchical (non-independent) a priori predictions regarding the mental representations of women with BPD, the results were that (a) all those with BPD, compared with half the group with dysthymia, displayed HH states of mind; (b) those with BPD manifested a significantly higher frequency of globally devaluing representations; and (c) they exhibited a strong trend toward identifying with the devalued hostile caregiver (58% BPD vs. 18% dysthymic). In addition, significantly more BPD than dysthymic patients made reference to controlling behavior towards attachment figures in childhood. These findings offer fresh insights into the nature of BPD and extend previous evidence concerning affected individuals' patterns of thinking and feeling about childhood attachment figures","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Taylor & Francis","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:repository.tavistockandportman.ac.uk:109<\/identifier><datestamp>\n      2017-03-28T11:58:10Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6469736162696C697479:4639<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.tavistockandportman.ac.uk\/109\/<\/dc:relation><dc:title>\n        A controlled study of hostile-helpless states of mind among borderline and dysthymic women<\/dc:title><dc:creator>\n        Hobson, R Peter<\/dc:creator><dc:creator>\n        Lyons-Ruth, Karlen<\/dc:creator><dc:creator>\n        Melnick, Sharon<\/dc:creator><dc:creator>\n        Patrick, Matthew<\/dc:creator><dc:subject>\n        Personality Disorders (e.g. narcissism)<\/dc:subject><dc:description>\n        The aim of this study was to determine whether women with borderline personality disorder (BPD) are more likely than those with dysthymia to manifest contradictory Hostile-Helpless (HH) states of mind. A reliable rater blind to diagnosis evaluated features of such mental representations in transcripts of Adult Attachment Interviews from 12 women with BPD and 11 women with dysthymia of similar socioeconomic status (SES), all awaiting psychotherapy. In keeping with three hierarchical (non-independent) a priori predictions regarding the mental representations of women with BPD, the results were that (a) all those with BPD, compared with half the group with dysthymia, displayed HH states of mind; (b) those with BPD manifested a significantly higher frequency of globally devaluing representations; and (c) they exhibited a strong trend toward identifying with the devalued hostile caregiver (58% BPD vs. 18% dysthymic). In addition, significantly more BPD than dysthymic patients made reference to controlling behavior towards attachment figures in childhood. These findings offer fresh insights into the nature of BPD and extend previous evidence concerning affected individuals' patterns of thinking and feeling about childhood attachment figures.<\/dc:description><dc:publisher>\n        Taylor & Francis<\/dc:publisher><dc:date>\n        2007<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/repository.tavistockandportman.ac.uk\/109\/1\/Hobson_%26_Patrick_-_Controlled_study.pdf<\/dc:identifier><dc:identifier>\n          Hobson, R Peter and Lyons-Ruth, Karlen and Melnick, Sharon and Patrick, Matthew  (2007) A controlled study of hostile-helpless states of mind among borderline and dysthymic women.  Attachment and Human Development, 9  (1).   pp. 1-16.  ISSN 1461-6734      Full text available   <\/dc:identifier><dc:relation>\n        http:\/\/www.informaworld.com\/smpp\/content~db=all~content=a772700534<\/dc:relation><dc:relation>\n        10.1080\/14616730601151417 <\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.tavistockandportman.ac.uk\/109\/","http:\/\/www.informaworld.com\/smpp\/content~db=all~content=a772700534","10.1080\/14616730601151417"],"year":2007,"topics":["Personality Disorders (e.g. narcissism)"],"subject":["Article","PeerReviewed"],"fullText":" \n \nTavistock and Portman E-Prints Online \n \n  \n \n \nJOURNAL ARTICLE \n \nOriginal citation:  Hobson, R Peter and Lyons-Ruth, Karlen and Melnick, Sharon and \nPatrick, Matthew (2007) A controlled study of hostile-helpless states of mind \namong borderline and dysthymic women. Attachment and Human Development, 9 (1). \npp. 1-16. ISSN 1461-6734 \n \n© 2007 Peter Hobson & Matthew Patrick \nThis version available at: http:\/\/taviporttest.da.ulcc.ac.uk\/ \n \nAvailable in Tavistock and Portman E-Prints Online: Oct 2009 \nThe Trust has developed the Repository  so that users may access the clinical, \nacademic  and research work of the Trust. \n \n Copyright © and Moral Rights for the papers on this site are retained by the \nindividual authors and\/or other copyright owners. Users may download and\/or print \none copy of any article(s) in  Tavistock and Portman E-Prints Online to facilitate \ntheir private study or for non-commercial research. You may not engage in further \ndistribution of the material or use it for any profit-making activities or any \ncommercial gain. You may freely distribute the URL \n(http:\/\/taviporttest.da.ulcc.ac.uk\/) of  Tavistock and Portman E-Prints Online. \n \nThis is an electronic version of an article published in ‘Attachment and Human \nDevelopment © 2007 Copyright Taylor & Francis; Attachment and Human Development \nis available online at: http:\/\/www.informaworld.com\/openurl?genre=issue&issn=1461-\n6734&volume=9&issue=1.  You are encouraged to consult the remainder of this \npublication if you wish to cite from it. \n \n \n \n \n \n \n \n \nA controlled study of Hostile-Helpless states of mind\namong borderline and dysthymic women\nKARLENLYONS-RUTH1, SHARON MELNICK1, MATTHEW PATRICK2, &\nR. PETER HOBSON2\n1Harvard Medical School, Cambridge, MA, USA, and 2Tavistock Clinic, London, UK\nAbstract\nThe aim of this study was to determine whether women with borderline personality disorder\n(BPD) are more likely than those with dysthymia to manifest contradictory Hostile-Helpless (HH)\nstates of mind. A reliable rater blind to diagnosis evaluated features of such mental representations\nin transcripts of Adult Attachment Interviews from 12 women with BPD and 11 women with\ndysthymia of similar socioeconomic status (SES), all awaiting psychotherapy. In keeping with three\nhierarchical (non-independent) a priori predictions regarding the mental representations of women\nwith BPD, the results were that (a) all those with BPD, compared with half the group with\ndysthymia, displayed HH states of mind; (b) those with BPD manifested a significantly higher\nfrequency of globally devaluing representations; and (c) they exhibited a strong trend toward\nidentifying with the devalued hostile caregiver (58% BPD vs. 18% dysthymic). In addition,\nsignificantly more BPD than dysthymic patients made reference to controlling behavior towards\nattachment figures in childhood. These findings offer fresh insights into the nature of BPD and\nextend previous evidence concerning affected individuals’ patterns of thinking and feeling about\nchildhood attachment figures.\nKeywords: Borderline personality disorder, attachment, identification, mental representation,\nHostile-Helpless\nIntroduction\nOne of the most challenging tasks facing psychiatry is to understand the nature of\npersonality disorder. We seem to be a long way from determining the etiology and\npathogenesis of the conditions that fall under this notoriously ill-defined nosological\ncategory. The aim of the present paper is to elucidate one relatively clearly demarcated\nsyndrome, that of borderline personality disorder (BPD), through a novel approach to\nevaluating Adult Attachment Interviews (AAI; George, Kaplan, & Main, l985). This\napproach focuses upon qualities of narrative that convey Hostile-Helpless (HH) states of\nmind in relation to childhood attachment figures (Lyons-Ruth, Yellin, Melnick, &\nAtwood, 2005).\nCorrespondence: Karlen Lyons-Ruth, PhD, Cambridge Hospital, Department of Psychiatry, 1493 Cambridge Street, Cambridge,\nMA 02139, USA. Tel: 617-547-3116. Fax: 617-332-2715. R. Peter Hobson, MD, PhD, Adult Department, Tavistock Clinic, 120\nBelsize Lane, London NW3 5BA, UK. Tel: 0207 447 3744. Fax: 0207 447 3745. E-mail: klruth@hms.harvard.edu or\nr.hobson@ich.ud.ac.uk\nAttachment & Human Development,\nMarch 2007; 9(1): 1 – 16\nISSN 1461-6734 print\/ISSN 1469-2988 online \u0002 2007 Taylor & Francis\nDOI: 10.1080\/14616730601151417\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\nNature and origins of borderline personality disorder\nThere are good reasons for investigating BPD from this point of view. According to DSM-\nIV, individuals are said to have BPD when they meet five out of nine diagnostic criteria: a\npattern of intense, unstable relationships; impulsiveness in at least two areas that are\npotentially self-damaging; affective instability; inappropriate, intense anger or lack of control\nof anger; recurrent suicidal threats or self-mutilating behavior; marked and persistent\nidentity disturbance; chronic feelings of emptiness or boredom; frantic efforts to avoid real\nor imagined abandonment, and transient paranoid or dissociative symptoms. It is far from\nself-evident that, defined in this way, the syndrome of BPD should be associated with any\nparticular forms of mental representation concerning important relationships. However,\nthere is evidence that childhood experiences (and plausibly, current ways of thinking,\nfeeling, and relating to others that result from such experiences) play a role in its\npathogenesis.\nThere are, of course, a number of complementary perspectives and competing hypotheses\nconcerning the appropriate way to characterize the nature and origins of BPD. For example,\nthere is tentative evidence that temperamental factors such as impulsive aggression and\naffective instability may act as risk factors for the disorder (e.g. Posner et al., 2003).\nAlthough a number of studies have identified familial aggregation of BPD (Silverman et al.,\n1991; White, Gunderson, Zanarini, & Hudson, 2003, for review), there is, as Posner et al.\n(2003, p. 1102) conclude, ‘‘currently no strong evidence that BPD is heritable.’’ Attempts\nto conceptualize the underlying pathology in terms of a biological model of affective disorder\nhave remained speculative (Boutros, Torello, & McGlashan, 2003; Juengling et al. 2003).\nTherefore it is timely to consider whether there might be another way to capture essential\nfeatures of borderline psychopathology from a developmental perspective, through a focus\nupon the nature and implications of affected individuals’ experiences and the mental\nrepresentations of relationships related to those experiences.\nRetrospective self-reports provide highly suggestive evidence in this regard. There are now a\nnumber of studies that have indicated how patients with BPD often describe their early\nchildhoods as characterized by sexual, physical, or verbal abuse (Bryer, Nelson, Miller, &\nKrol, l987; Herman, Perry, & van der Kolk, 1989; Westen, Ludolph, Misle, Ruffins, & Block,\n1990; Zanarini, Frankenburg, & Reich, 2000). Childhood sexual abuse appears to be a strong\npredictor of symptom severity (Zanarini, Young, & Frankenburg, 2002) but a non-specific\npredictor of the development of BPD versus other personality disorders (Paris, Zweig-Frank,\n& Guzder, 1994; Zanarini et al., 2000). Individuals with BPD report early family\nenvironments in which they experienced emotional neglect from both parents, and portray\ncaregivers who denied the validity of their thoughts and feelings, were emotionally withdrawn\nand inconsistent, and either failed to protect them or were overcontrolling (Patrick, Hobson,\nCastle, Howard, &Maughan, 1994; Zanarini et al., 1997, 2000; Zweig-Frank & Paris, 1991).\nEarly separations are also reported as part of this caregiving constellation (Bandelow, Krause,\nWedekind, Broocks, Hajak, & Ruther, 2005; Reich & Zanarini, 2001).\nA recent attempt to disentangle the relative contributions of these intercorrelated variables\nconcluded that family environments, parental psychopathology, and early abuse all\nindependently predicted clinical features of BPD, and that family environment mediated\nthe relations between early childhood abuse and these clinical features (Bradley, Jenei, &\nWesten, 2005). More direct evidence regarding the role of family environment is now\nemerging from prospective longitudinal studies. As early as the first 2 years of life, deviations\nin observed parent – child relatedness are predictive of the prevalence of BPD features 19\nyears later (Lyons-Ruth, Holmes, & Hennighausen, 2005).\n2 K. Lyons-Ruth et al.\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\nAttachment representations of the BPD patient\nWhat might this mean for affected individuals’ memories and\/or construals of attachment\nrelationships, or what is often termed their ‘‘mental representations’’? Some of the most\npersuasive evidence has come from controlled studies of patients with BPD that have\nemployed the AAI (George et al., 1985). The first of these studies, by Patrick et al. (1994),\nyielded evidence that affected women are frequently enmeshed in their attitudes to\nattachment figures, often ‘‘confused, fearful, and overwhelmed’’ in relation to traumatic\naspects of attachment-related experiences, and more likely to be ‘‘unresolved’’ and\ndisoriented with respect to childhood experiences of trauma and loss than are women\nexperiencing dysthymia. These findings are largely in keeping with those from subsequent\nstudies (Agrawal, Gunderson, Holmes, & Lyons-Ruth, 2004; Barone, 2003; Fonagy et al.,\n1996).\nA complementary picture has emerged from BPD patients’ utterances and behavior in\npsychotherapy assessment interviews (Hobson, Patrick, & Valentine, 1998), as well as from\ntheir responses to projective and other psychological tests (Bell, Billington, & Cicchetti,\n1988; Nigg et al., 1991). In these assessments, they respond as though they expect\nrelationships to involve untrustworthy and potentially threatening figures. When compared\nwith women with depression or dysthymia, they imbue relationship representations with\nmalevolence (Nigg, Lohr, Westen, Gold, & Silk, 1992). More often than patients with other\npersonality disorders, they endorse beliefs that they will be hurt or abandoned by others on\nwhom they depend (Butler, Brown, Beck, & Grisham, 2002).\nSuch findings highlight the need to provide an account of the psychological mechanisms\nthrough which adverse childhood experiences might influence a person’s subsequent social\nand emotional functioning to increase the risk of BPD. One approach consistent with\ncurrent models of neural functioning (Edelman, 1987; Freeman, 1995) has been to consider\nhow mental representations of relations between self and others might account for\ncontinuities in social experience and behavior from early to later phases in life. Such mental\nrepresentations can be described either as the ‘‘internal object relations’’ posited by\npsychoanalysis or as the ‘‘internal working models’’ described in attachment theory\n(Bowlby, 1980; Greenberg & Mitchell, 1983). For example, it is proposed that in the\nabsence of sensitive caregiving early in life, an individual may develop particular types of\nunintegrated idealized and denigrated representations of others and, through identifying with\nthe figures-as-represented, assume their characteristics. Such mental representations may\ncolor a person’s experiences of other people and the self, and also shape his or her unstable\nand affectively turbulent interpersonal relations.\nWith this developmental perspective in mind, it appears that one pattern of early\nrelatedness that may have special relevance for adult BPD is disorganized attachment in\ninfancy. Attachment research has provided evidence that when parents display frightened,\nfrightening, or otherwise disrupted forms of affective communication with their infants, the\ninfants may fail to develop an organized strategy for achieving comfort from their caregivers\nand instead show contradictory and disorganized approach-avoidance behavior toward the\nparent (Lyons-Ruth, Bronfman, & Parsons, 1999; Schuengel, Bakermans-Kranenburg, &\nvan IJzendoorn, 1999). Recently, infants of mothers with BPD have also been reported to\ndisplay a high prevalence of disorganized attachment (80%) (Hobson, Patrick, Crandell,\nGarcia-Perez, & Lee, 2005). Other studies of infants with disorganized attachments\nindicate that by 3 – 5 years old, many previously disorganized infants reorganize their\nattachment behaviors into either a controlling – punitive attachment pattern (hostile or\nhumiliating behavior towards parent) or a controlling-caregiving pattern (helping,\nBorderline and dysthymic women 3\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\nprotecting, worrying about the parent; Main, Kaplan, & Cassidy, 1985; NICHD Early Child\nCare Research Network, 2001; Wartner, Grossmann, Fremmer-Bombik, & Suess, 1994).\nSuch controlling patterns are thought to serve the function of maintaining the attention and\ninvolvement of an otherwise emotionally distanced caregiver. If such punitive and caregiving\nattachment strategies were sustained into adulthood, they might result in the intense,\nconflictual, and often coercive patterns of relatedness observed among borderline patients.\nConsistent with this proposal, research suggests that many features of BPD, as assessed by\nbehavioral symptomatology, initially appear during childhood and adolescence (Reich &\nZanarini, 2001).\nHostile-Helpless states of mind and borderline personality disorder\nIn the present study, we employed a recently developed system to evaluate participants’ HH\nstates of mind regarding attachment as manifest in transcripts from the AAI (George et al.,\n1985). These transcripts had been gathered as part of a previous study of the attachment\nrepresentations of BPD patients and in the earlier study had been coded using the Main and\nGoldwyn (1991) coding system (Patrick et al., 1994). The HH coding system differs\nsubstantially from the Main, Goldwyn, and Hesse (1985 – 2005) system for classifying\nUnresolved states of mind. The unresolved coding which focuses on lapses in reasoning or\nnarrative structure when discussing loss or trauma as the primary indicators of a dis-\norganized adult state of mind. The HH measure, in contrast, does not address how loss or\ntrauma is discussed, but instead assesses the extent to which a person mentally represents\nattachment figures in contradictory and malevolent ways and also appears to assume\n(identify with) the characteristics of these figures. As discussed more thoroughly in an earlier\npaper (Lyons-Ruth et al., 2005), the HH coding system was first developed with the\nhypothesis that these codes would converge with and provide a more developed theoretical\nframework for understanding the rare AAI classifications seen mostly among clinical\nsamples, including the Dismissing Derogating (Ds2), Fearfully Preoccupied (E3) and\nCannot Classify (CC) categories. Contrary to expectations, the HH codes did not overlap\nsubstantially with any of these classifications in initial validity work. There are a number of\nreasons that this could have occurred, including the lack of demonstrated coder reliability\nfor these rare AAI categories that may contribute to the variable prevalence of the categories\nacross studies.\nRecent work has demonstrated that HH representations on the AAI are associated with\nparental histories of trauma, but not loss (Finger, 2006; Lyons-Ruth, Yellin, Melnick, &\nAtwood, 2003). Such HH representations also occur more frequently among mothers who\ndisplay disrupted forms of affective communication with their infants, and disrupted\ncommunication mediates the significant relation between mothers’ HH attachment\nrepresentations and their infants’ disorganized attachment strategies (Lyons-Ruth et al.,\n2005). Finally, in previous work, HH representations on the AAI were unrelated to\nindicators of Unresolved loss or trauma, as coded by the standard Main, Goldwyn, and\nHesse (1985 – 2005) system (Finger, 2006; Lyons-Ruth et al., 2005). The reader is referred\nto Lyons-Ruth et al. (2005) for more extended description and relevant findings regarding\nhow the criteria for HH states of mind differ from the criteria for organized forms of\ndismissing and preoccupied states of mind and for Unresolved states of mind.\nDrawing on ideas from trauma theory, attachment theory, and psychoanalytic practice, we\nexpected that the interpersonal psychopathology of borderline patients would correspond\nwith a particular style of mental organization characterized by contradictory idealized and\ndenigrated representations of significant attachment figures. This prediction is in keeping\n4 K. Lyons-Ruth et al.\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\nwith the clinically observed tendency of such patients to segregate feelings and to switch\n(often abruptly) between contrasting positive and negative attitudes towards people, as well\nas their propensity to experience others as untrustworthy and malevolent (e.g., Butler et al.,\n2002). For these reasons, HH mental representations were predicted to be significantly\nmore characteristic of borderline than dysthymic individuals. The hypothesis was not that\nhigh HH ratings would be specific to the group of women with BPD. On the contrary, we\nanticipated that a subgroup of women with dysthymia would also manifest features of HH\nmental functioning, because punitive and self-punitive attitudes are a well-established\nfeature of certain forms of depression, and possibly correspond with mental representations\nof figures embodying these attitudes (Carver & Ganellen, 1983; Freud, 1917\/1957).\nTherefore our group comparison represents a stringent test that such mental representations\nare even more prevalent among borderline individuals than among patients with dysthymia.\nWe derived two more specific predictions: first, individuals with BPD would be more likely\nto represent attachment figures in globally devalued terms; and second, yet more specifically,\nthey would be more likely than women with dysthymia to give evidence of being identified\nwith malevolent figures-as-represented by conveying a close alignment between the qualities\nof such figures and themselves. As a more exploratory investigation, we assessed whether\nwomen with BPD were more likely to indicate that in childhood they engaged in punitive or\ncaregiving forms of controlling relations with attachment figures. This assessment holds\nspecial interest from a developmental perspective because of the established connection\nbetween controlling behavior in childhood and disorganized attachment strategies in infancy.\nMethod\nParticipants\nParticipants were 12 borderline and 11 dysthymic adult female patients, identified from the\noutpatient psychotherapy waiting list of a major teaching hospital. Although the original\nsample included another person with dysthymia, procedural problems meant that her Adult\nAttachment Interview could not be coded with the current measures. Categorical diagnoses\nwere assigned based on extensive psychiatric case notes employing as diagnostic criteria\nDSM-III-R features of BPD (American Psychiatric Association, 1987; the groups were\nconstituted before DSM-IV had appeared). Diagnoses were assigned without reference to\npatients’ early childhood experiences or relationships with their parents. Because of the\nfocus on early attachment relationships, individuals with a history of death of both parents or\nprolonged separation (e.g., fostering or adoption) before the age of 16 were excluded. All\nborderline patients met at least seven of the eight DSM-III-R diagnostic criteria for BPD,\nalthough only five out of eight were required for the diagnosis to be assigned.\nPatients in the dysthymic group exhibited none of the eight DSM-III-R borderline\ncharacteristics and fulfilled DSM-III-R criteria for dysthymia, namely a chronic disturbance\nof affect involving a depression of mood extending over a prolonged period of time (at least 2\nyears) but without evidence of a major depressive episode, hypomania, or superimposed\nchronic psychotic disorder. Dysthymic women had experienced the same process of\npsychiatric referral for outpatient psychotherapy as those with BPD. Individuals with any\ncomorbid Axis I diagnosis were excluded from both groups. Borderline and dysthymic\ngroups were comparable on socio-demographic characteristics: BPD group mean age 35\nyears 2 months (SD 8.5), dysthymic group 32 years 4 months (SD 6.8); 58% of borderline\npatients and 55% of dysthymic patients had university degrees; one subject in the borderline\ngroup and two in the dysthymic group were in stable co-habiting relationships; three in each\nBorderline and dysthymic women 5\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\ngroup were classified as Social Class 1 (Registrar General, 1965), four as Social Class 2,\nthree in the borderline, and two in the dysthymic group were in Social Class 3, and in each\ngroup, one was Social Class 4 and one was Social Class 5.\nProcedure\nEach subject was administered the Adult Attachment Interview, approximately an hour in\nlength, which was tape-recorded and transcribed. Written informed consent was obtained\nafter the procedures had been fully explained to the participants. Interviews were conducted\nby five clinicians who were blind to diagnosis. Transcripts were coded using the coding\nsystem for HH states of mind developed for the Adult Attachment Interview (see Measures\nbelow). Coders were located in an independent laboratory and were blind to diagnosis.\nMeasures\nThe Beck Depression Inventory (Beck, 1984) was administered to provide an index of current\ndepression.\nThe Adult Attachment Interview (AAI; George et al., 1985) was developed to elicit a\nparticipant’s state of mind regarding his or her early attachment experiences. The interview\nwas developed from research on parent – infant attachment relationships (Main et al., 1985).\nParticipants are asked to give adjectives describing the relationship with each parent; to back\nthese up with specific memories; to recall specific experiences of parental responsiveness to\nupset, accidents, and illness; to discuss incidents of loss or trauma; and to reflect on how\nrelationships with parents had changed over time and how they had influenced their adult\npersonalities.\nThe occurrence of physical or sexual abuse to age 16 was recorded from the Adult Attachment\nInterview. Physical abuse severe enough to leave marks on the child and any kind of sexual\nactivity with an adult was counted as abuse.\nThe Hostile-Helpless coding system for the Adult Attachment Interview (Lyons-Ruth,\nMelnick, Yellin, & Atwood, 1995 – 2005) has several components. Individuals are classified\nas having a HH state of mind regarding attachment experiences if they score five or above on\na scale for level of HH state of mind (1 – 9). Transcripts classified HH are characterized by\nevidence of opposing and globalized ‘‘all-good, all-bad’’ evaluations of central relationships\noccurring across the interview that are neither discussed nor reconciled by the participant,\ne.g., ‘‘We were friends . . .We were enemies’’; ‘‘She was terrible to me . . .We were very\nclose.’’ A HH state of mind suggests that the individual has not engaged in reflection\nadequate to bring these contradictions to a conscious level and achieve a more coherent\nevaluation of attachment experiences. In the Hostile subtype, at least one attachment figure\nfrom childhood is represented in globally negative terms, whereas in the Helpless subtype,\nhostile affects are less prominent, pervasive feelings of fearfulness are often present, and one\nor more caregivers are represented as anxious or helpless to the point of abdicating a\nparental role. Both states of mind can be evident in a single transcript and are viewed as\nrelated aspects of a single HH dyadic representational model of self-other relations (Lyons-\nRuth, Bronfman, & Atwood, 1999). Scoring for level of HH state of mind is based on the\npervasiveness and\/or extreme quality of the manifestations of such contradictory evaluations\nacross the interview.\nBefore a rating is assigned, the transcript is also scored for seven indicators theoretically\nrelated to such contradictory states of mind in prior clinical theory and observation (see\nLyons-Ruth et al., 2005, for additional background). While there is no simple algorithm\n6 K. Lyons-Ruth et al.\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\nrelating these frequencies to a particular scale score, the first two indicators are especially\ncentral to the concept of an HH state of mind and would be heavily weighted in assigning a\nclassification. These seven indicators include frequency of global devaluation of a caregiver,\nincluding actively hostile devaluation and ‘‘cool’’ derogating descriptions; evidence of\nidentification with a hostile caregiver, where the participant appears to accept or value\nsimilarities between the negatively evaluated attachment figure and the self, even though\nthese similarities may not be explicitly acknowledged; frequency of indicators of a sense of special\nunworthiness, including generalized negative self descriptors and references to feelings of\nshame or feelings of being undeserving of positive attention; frequency of references to fearful\naffect; frequency of instances of laughter at pain, in which the relating of emotionally painful or\nnegative experiences is accompanied by laughter; evidence of controlling behavior in childhood\nwhen a participant makes reference to having engaged in either controlling – punitive\nbehavior (e.g., punitive, humiliating, dominating behavior towards the parent in childhood)\nor controlling-caregiving behavior (e.g., helping, protecting, worrying about, or displaying\nvigilance towards the parent’s needs in childhood); (Cassidy & Marvin, 1991); and evidence\nof ruptured attachments, when a participant refers to no longer having contact with one or\nmore nuclear family members through a deliberate decision to terminate contact. Table I\nprovides examples of these codes, and additional detail is available elsewhere describing the\nclassification criteria and detailing how this coding system differs from and extends the\nMain et al. (1985 – 2005) coding system for the AAI (Lyons-Ruth et al., 1995 – 2005, 2003,\n2005).\nTranscripts were coded blind to all other data. Intraclass or kappa coefficients on 15\nrandomly selected transcripts were as follows: scaled score for HH state of mind ri¼ .83,\nHH classification K¼ .86; global devaluation of a caregiver ri¼ .77; identification with a\nhostile caregiver ri¼ .80; sense of self as bad ri¼ .85; recurrent references to fearful affect\nri¼ .70; recurrent laughter at pain ri¼ .90; ruptured attachments in adulthood ri¼ .71;\ncontrolling\/caregiving behaviors in childhood ri¼ .85; controlling\/punitive behaviors in\nchildhood ri¼ .83.\nResults\nAbuse history and current mood state\nBorderline and dysthymic groups did not differ in incidence of abuse, with 50% and 45%\nreporting abuse, respectively. Nor did they differ in current mood state at the time of the\ninterviews: mean scores on the Beck Depression Inventory were in the moderately depressed\nrange (borderline group: M 21.6, SD 6.9; dysthymic group: M 19.9, SD 8.9).\nHostile-Helpless states of mind among borderline and dysthymic women\nGroup differences were assessed by two-tailed tests using F-tests for frequency data and\nMann-Whitney tests for ordinal data. Fisher’s Exact test was used to assess group\ndifferences for dichotomous (presence\/absence) codes. The data that relate to our\npredictions are presented by individual participants in Table II. The principal prediction\nwas that an HH state of mind would be significantly more prevalent among participants with\nBPD than those with dysthymia. In keeping with this prediction, 100% of the borderline\ngroup were rated over the threshold for an HH state of mind, whereas this was the case for\n55% of the dysthymic group, Fisher’s Exact p¼ .01, phi¼ .551. On the ratings for overall\nlevel of HH state of mind, women with BPD scored M¼ 6. 7 (SD 1.1), and those with\nBorderline and dysthymic women 7\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\ndysthymia scored M¼ 5.0 (SD 1.95), Mann Whitney U¼ 34.00, p5 .04, Kendall’s\ntau¼ .48.\nThe second prediction, which focused upon a specific component of the H-H rating\nscheme, was that the borderline group would display a greater frequency of globally\ndevaluing representations of caregivers. In this respect, there was a highly significant group\ndifference: BPD M¼ 2.6 (SD .6); dysthymic M¼ .45 (SD .82); F(1,21)¼ 16.23, p5 .001,\neta¼ .661. In fact, this aspect of the narratives proved to be most differentiating of the\ndiagnostic groups, with 92% of borderline patients but only 27% of dysthymics evidencing\ndevaluation of caregivers, Fisher’s Exact p¼ .003, phi¼ .66.\nThe third prediction, also not independent of the first, concerned an even more specific\naspect of the H-H ratings. We predicted that compared with dysthymic patients, those with\nBPD would more often make reference to identification with globally devalued hostile\nTable I. Examples of Hostile-Helpless codes.\nA. Global Devaluation of Caregiver\n‘‘I even feel contempt. I don’t hate them any more, I used to hate them, I used to daydream what I’d do to them,\nhow I’d kill them, but she is not worth it.’’\n‘‘Tyrannical. He was horrible to us.’’\nB. Identification with a Hostile Caregiver1\n‘‘. . . and I used to shout at them in the same way that people I felt threatened by used to tell me off like school\nteachers and things, and my mother. I use the same tone and say the same sort of things.’’\n‘‘. . . it’s very seldom that I get angry, which is the same as my father, but when I do get angry, I fly off the handle, I\njust go totally AWOL type uurrgh, which again is exactly the same as my father, because my father never expresses\nhis anger to start with, he never says ‘you’re making me cross’ he lets it go and go and go and go until you’ve made\nhim so furious that he has, he loses control and that’s exactly the same as I’ve got now . . .’’\nC. Sense of Special Unworthiness\n‘‘. . . it was my fault that she was sick and so, when she got sick and got old I felt it was my fault, you know, it was\nall my fault that she was just getting old, you know.’’\n‘‘. . . it always made me feel like a bit of an outsider, the troublemaker of the family.’’\nD. Repeated References to Fearful Affect\n‘‘. . . so there was a feeling around all the time that something dreadful was going to happen at any minute.’’\n‘‘. . . I, kind of, am terrified of what is round the next corner really . . .’’\nE. Laughter at Pain\n‘‘. . . then I was 9 when I took my first overdose [you were nine when you took an overdose?]’’ (laughs)\n‘‘. . . you know, I could have put in a cardboard substitute for myself and nobody would really have noticed.’’\n(laughs)\nF. References to Controlling –Punitive Behavior towards Caregiver in Childhood\n‘‘I used to say some hateful things to her . . . and taunt her . . . (what would you say?) That she deserved what he was\ndoing to her . . .’’\n‘‘I would push them to a certain point . . . they’d start to break . . . because I was very, like, insolent and cheeky and\ndemanding.’’\nG. References to Controlling-Caregiving Behavior towards Caregiver in Childhood\n‘‘. . . I think the only way I could experience closeness was to take care of her. Get her tea when she came in from\ndoing this work and go out with her and help her . . .’’\n‘‘. . . I was aware that I was, kind of, responsible for her and I used to . . . if I was at school I used to be worrying\nwas she alright.’’\nH. Ruptured Attachment with Family Member\n‘‘I went through quite a long period um . . . a few years, about four years, five years ago having no contact\nwhatsoever with my parents . . .’’\n‘‘I mean, I don’t speak to him now. I don’t want to have anything to do with him at all.’’\n1Identification with a hostile caregiver is usually coded not for a single passage but for the combination of global\ndevaluation and evidence of identification over the entire interview.\n8 K. Lyons-Ruth et al.\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\ncaregivers. This group difference did not reach significance, Fisher’s Exact p¼ .09,\nphi¼ .41. However, the direction of the results was as predicted, and the effect size was\nsubstantial: 58% of women with BPD but only 18% of those with dysthymia made reference\nto one or more identifications with a hostile caregiver. Finally, BPD patients were\nsignificantly more likely to report evidence that they had adopted a controlling (punitive or\ncaregiving) attachment strategy toward parents in childhood. Seventy-five percent of women\nwith BPD but only 27% of dysthymic women described controlling behavior toward\nparents, Fisher’s Exact p¼ .04, phi¼ .48. Among the BPD group, 42% reported punitive\nbehavior and 50% reported caregiving behavior (two subjects reported both). Eighteen per\ncent of dysthymic women reported each subtype (one subject reported both). Other aspects\nof the transcripts, including references to fearful affects, special sense of unworthiness,\nlaughter at pain, and ruptured attachments, were not significantly different between the\ntwo groups. However, 42% of BPD patients but only 9% of dysthymic patients had no\ncontact with at least one nuclear family member, and the effect size for such ruptured\nattachments was sizeable, phi¼ .37, indicating that this finding warrants further study in\nlarger samples.\nHostile-Helpless state of mind and Unresolved (U) or Fearfully Preoccupied (E3) AAI\nclassifications\nAs noted in the introduction, the standard Main and Goldwyn (l991) AAI classifications for\nthis sample were previously reported in Patrick et al. (1994). Given this previous report,\nexploratory\/descriptive analyses examined the extent to which the HH codes overlapped\nwith or extended these previous findings regarding attachment states of mind among\nborderline and dysthymic women. Descriptively, in the total sample of both dysthymic and\nBPD women, 44% were classified Unresolved (U), 44% Fearfully Preoccupied (E3), and\n78% Hostile-Helpless (HH). HH Classification was moderately related to the other two\nclassifications, U by HH phi¼ .46, E3 by HH phi¼ .46, while the U and E3 classifications\nTable II. Data for borderline and dysthymic individuals on indicators of Hostile-Helpless states of mind.\nLevel of Hostile-Help-\nless state of Mind1\nNo. of globally\ndevaluing references\nto caregiver\nNo. of references to\nidentification with\nhostile caregiver\nParticipants in each group BPD Dysthymic BPD Dysthymic BPD Dysthymic\nS1 7 8 3 1 1 2\nS2 7 7 2 2 2 2\nS3 7 7 5 2 0 0\nS4 7 6 4 0 2 0\nS5 7 6 3 0 1 0\nS6 6 5 0 0 0 0\nS7 6 4 1 0 1 0\nS8 6 4 2 0 3 0\nS9 6 3 2 0 1 0\nS10 6 3 2 0 0 0\nS11 5 2 1 0 0 0\nS12 5 – 5 – 0 –\n1Max score¼9; individuals with scores\u00025 are classified as Hostile-Helpless.\nNote: The measures are not independent (see measures for hierarchical scheme of rating).\nBorderline and dysthymic women 9\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\nwere strongly related to one another, phi¼ .65. However, these associations among the\nclassifications were due to the associations of all three features with borderline disturbances,\nrather than being a characteristic of the coding systems themselves. Among borderline\nwomen 75% were classified Unresolved, 83% were classified Fearfully Preoccupied, and\n100% were classified HH, while there was less association among these categories among\ndysthymic women, with none classified Fearfully Preoccupied, 17% classified Unresolved,\nand 55% classified Hostile-Helpless. This lack of association between HH and Unresolved\nor Fearfully Preoccupied classifications in the dysthymic group is consistent with previous\nwork (Finger, 2006; Lyons-Ruth et al., 2005).\nNone of the specific HH indicator codes, except references to a special sense of\nunworthiness, were associated with Unresolved status. Overall then, the HH codes,\nincluding global devaluation of a caregiver and identification with a hostile caregiver,\nappeared to be indexing aspects of representations of caregivers that were relatively\nindependent of the lapses in discourse related to loss or trauma that lead to cate-\ngorization as Unresolved. These latter findings are consistent with Lyons-Ruth et al.’s\n(2005) findings of a lack of overlap between Unresolved classification and HH classifi-\ncation in a less severely disturbed sample of low-income mothers and infants and\nwith similar findings by Finger (2006) in a case-control sample of substance-abusing\nwomen.\nWith regard to the relations between HH states of mind and Fearfully Preoccupied states\nof mind, two specific links emerged. Fearfully Preoccupied states of mind were significantly\nassociated with references to caregiving behavior in childhood [caregiving Fisher’s Exact\np¼ .04, phi¼ .46]. Sixty percent of Fearfully Preoccupied (E3) women (all E3 were also\nBPD) made reference to caregiving behavior in childhood, while 18% of dysthymic women\ndid so and none of the non-Fearfully Preoccupied BPD women did so. There was no\nrelation between Fearfully Preoccupied states of mind and references to punitive behavior in\nchildhood [punitive Fisher’s Exact p¼ 1.00]. In addition, Fearful Preoccupation was related\nto globally devaluing references to the caregiver during the interview, eta¼ .62, p5 .01. So\nFearfully Preoccupied women described caregiving behavior toward the parent in childhood\nbut in their present discourse made devaluing comments about the same caregiver,\ncomments that were somewhat contradictory to the solicitousness described in childhood.\nSuch unreflected-upon contradictions in orientation towards attachment figures are\nimportant aspects of an HH state of mind. Furthermore, the indication that Fearfully\nPreoccupied adults are likely to have employed caregiving forms of controlling behavior in\nchildhood adds a new developmental dimension to our understanding of the Fearfully\nPreoccupied classification and deserves follow up in future work. No other relations between\nFearful Preoccupation and HH codes were significant.\nDiscussion\nAccording to blind ratings of transcripts from AAIs, women with BPD displayed a higher\nprevalence of HH states of mind than did a matched group of participants with dysthymia.\nEvery one of the women with the borderline diagnosis scored above threshold on ratings\nfor this form of mental representation. It was expected that a number of patients with\ndysthymia would also have had to deal with troubled representations of significant\nattachment figures, and 55% of women with dysthymia were also categorized as HH.\nAs anticipated, therefore, HH states of mind were not specifically associated with a single\ndiagnosis, but were especially prevalent among, and perhaps characteristic of, women\nwith BPD.\n10 K. Lyons-Ruth et al.\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\nWe had also predicted that the mental representations of women with BPD would be\ncharacterized by portrayals of caregivers in hostile and devalued terms, and the tendency to\ndevalue caregivers proved to be the characteristic that most strongly differentiated the two\ngroups. There was also a strong trend for BPD women to give evidence of identification with\nsuch figures-as-represented, in that 58% of BPD women also conveyed a sense of being like\nthe devalued caregiver in the same ways that were being devalued elsewhere in the\ntranscript. Finally, a greater number of participants with BPD conveyed that in childhood\nthey had engaged in punitive or caregiving forms of controlling behavior toward parents,\nstances that we have reasoned elsewhere may represent childhood precursors of adult hostile\nand helpless states of mind, respectively (Lyons-Ruth, Melnick, Bronfman, Sherry, &\nLlanas, 2004).\nThere are several methodological limitations of the study. The first concerns the small\ngroup sizes. Second, participants were recruited from referrals to a psychotherapy clinic and\nwere probably not representative of the broader range of individuals with the diagnosis of\nBPD who do not seek outpatient treatment. Finally, BPD and dysthymic patients were\nscreened for comorbid Axis I and II conditions. These considerations limit how far one can\ngeneralize the findings to all women who satisfy criteria for these diagnoses, especially those\nwith comorbidity. As noted earlier, the presence of comorbidity presents a constant dilemma\nin the design of psychiatric studies. Because of the small sample size here, we opted to screen\nout comorbidity, even at the risk of a lack of generalizability, so that any results could be\nconfidently attributed to the personality diagnosis. Further work is needed to evaluate the\ndegree to which the present findings are generalizable to the broader group of women with\nBPD comorbid for major depression, post-traumatic stress disorder, or substance abuse, as\nwell as to BPD women who do not seek treatment. However, when considered alongside the\nclose matching for social status, intellectual achievement, history of trauma, and degree of\ndepression, it becomes all the more striking that significant group differences with\nsubstantial effect sizes were found. In particular, the measures of depression not only\nconfirmed that the women with dysthymia were significantly troubled, but also established\nthat group differences in response to the Adult Attachment Interview could not be attributed\nto the effects of current mood state.\nThe present results also complement prior evidence that a majority of BPD women\ndisplay lapses in reasoning or narrative structure on the AAI in relation to themes of trauma\nor loss, as well as high rates of Fearfully Preoccupied stances (Barone, 2003; Fonagy et al.,\n1996; Patrick et al., 1994). The co-occurrence of high rates of HH features in the same\ntranscripts indicate that contradictory and devaluing references to primary attachment\nfigures are also prominent features of the narratives of BPD women. These several disturbed\nfeatures captured by different coding systems in the accounts of borderline women are not\nredundant because these various AAI classifications are not related to one another in less\ndisordered samples. Instead, the convergence of all three sets of features indicates a\npervasive form of disturbance among BPD patients, disturbance that is seen in the\nunintegrated nature of representations of attachment relationships (HH coding), in lapses in\nreasoning and narrative structure when discussing loss or trauma (Unresolved coding), and\nin a preoccupation with traumatic events throughout the transcript (Fearful Preoccupation\ncoding).\nNew hypotheses also emerged regarding the form of earlier attachment relationships that\nmay be differentially associated with borderline psychopathology. Results highlighted an\nintriguing relation between borderline psychopathology and references to controlling\nbehavior in childhood, as well as a more specific association between Fearfully Preoccupied\nstates of mind and references to caregiving forms of control. These findings suggested that\nBorderline and dysthymic women 11\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\nsome BPD women show overt signs of being identified with the punitive attitudes of hostile\ncaregivers, while others are more explicitly preoccupied with the helpless attitudes of\ninadequate caregivers. Fearfully Preoccupied borderline women, in particular, may have\ndeveloped fearful preoccupation not only through exposure to fear-inspiring events, as\nindexed by the Fearfully Preoccupied classification, but also in relation to the overwhelming\ntask of assuming a parental caregiving role in relation to inadequate and unprotective\nattachment figures in childhood. The further juxtaposition of global devaluation and\nreferences to caregiving behavior among those classified Fearfully Preoccupied points to a\nparticular kind of conflict around unintegrated hostility that is associated with this\ndevelopmental pathway.\nIt is notable that borderline patients consistently report high rates of abusive experiences\nearly in life (e.g., Zanarini, Gunderson, Marino, Schwartz, & Frankenburg, 1989), and\nabusive and neglectful parenting may contribute to the child’s development of controlling\nforms of attachment (Cicchetti & Barnett, 1991). In the current study, women with\nborderline psychopathology made references to such controlling forms of behavior when\nthey were children. In longitudinal investigations, these controlling attachment stances have\nbeen predicted by earlier disorganized attachment strategies in infancy, and infant\ndisorganized strategies are also related to maltreatment (Carlson, Cicchetti, Barnett, &\nBraunwald, 1989; Main et al., 1985; NICHD Early Child Care Research Network, 2001;\nWartner et al., 1994). Disorganized infant attachment strategies are characterized by\ncontradictory approach-avoidance behavior toward a caregiver when under stress and\nneeding comfort. Therefore it is plausible that these contradictory responses in the early\nattachment relationship may bear a developmental relation to the contradictory caregiving\nand devaluing references observed in the present work and to the contradictory clinging but\nmistrustful relational attitudes found to characterize borderline patients (Butler et al., 2002;\nHobson et al., 1998).\nClinical implications\nIt is far from trivial that, in keeping with theoretically-based a priori predictions, individuals\nwith the diagnosis of BPD should be characterized by malevolent representations of\nattachment figures. Women who were selected on the basis of clinical features such as self-\ncutting, identity disturbance, intense mood fluctuations, and turbulent relationships proved\nto be globally devaluing towards their central attachment figures. This provides evidence\nthat there is an important relation between their disorder in self-experience, mood, and\ncurrent relationships, and the quality of their mental representations of attachment figures.\nThe present results complement evidence such as the self-endorsed relational beliefs of\npatients with BPD (Butler et al., 2002) and their observed-and-reported experiences of\nother people in videotaped clinical interviews (Hobson et al., 1998) to suggest that\nrepresentations of untrustworthy and malevolent figures are consistent features of the\nsyndrome. The presence of HH states of mind does not preclude the possibility that genetic\nand\/or other biologically-based disorders in temperament might contribute to early social\nexperience and to the establishment of certain forms of mental representation. Rather, it\nbrings into question any account of BPD that fails to encompass these attachment-\nrepresentational features of psychopathology and points to the need for an adequate\ndevelopmental account of the shaping of mental representations that accompany, and,\nplausibly, underpin, the social relationships of BPD individuals. Why is it that they are\nintolerant of separation, fear abandonment, and have an inability to trust and rely on others?\nWhy are their patterns of moment-to-moment relatedness with others so often intense,\n12 K. Lyons-Ruth et al.\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\nconflictual, and unstable? Any adequate response to these questions will entail an account of\nthe development of these individuals’ mental representations of interpersonal relations.\nEvidence is also accumulating regarding the potential for intergenerational transmission\nof attachment disturbances related to BPD. For example, previous studies have revealed an\nelevated prevalence of Unresolved states of mind with respect to trauma and loss in women\nwith BPD (Barone, 2003; Patrick et al., 1994). Meta-analytic review has further confirmed\nthat Unresolved states of mind are associated with disorganized attachment in the next\ngeneration (van IJzendoorn, Schuengel, & Bakermans-Kranenburg, 1999). Disorganized\nattachment in infancy has also been shown to be related to mothers’ HH states of mind;\nstates of mind which the current report also finds more prevalent among BPD women\n(Lyons-Ruth et al., 2005). Finally, recent studies of mothers with BPD have revealed\nintrusive insensitivity with their own infants at 2 months and 12 months of age (Crandell,\nPatrick, & Hobson, 2003; Hobson et al., 2005).\nInfants of BPDmothers also show deviations in early relatedness. The 2-month-old infants\nof BPD mothers, compared to infants of mothers without psychopathology, responded to a\n‘‘still-face’’ challenge with increased looking away, dazed looks, and subsequent lowering of\naffect (Crandell et al., 2003). At 12 months, the infants of BPD mothers showed lowered\navailability for positive engagement with a stranger and higher rates of disorganized\nattachment with their mothers when compared with infants of mothers without psycho-\npathology (Hobson, Patrick, Crandell, Perez, & Lee, 2004; Hobson et al., 2005). The\nconvergence of these findings prompts clinical concern about potential transgenerational\neffects of borderline psychopathology. Further developmental investigations are needed\nthat coordinate measures of adult psychopathology, mental representation, parent – infant\ninteraction, and infant attachment. In addition, more systematic evaluation and family\nsupports for children of women suffering from borderline psychopathology may be indicated.\nThe most far-reaching clinical implication of this work, then, has to do with the nature of\nthe theoretical\/developmental framework needed for conceptualizing and treating borderline\npsychopathology. Present results add credence to the view that borderline psychopathology\nis associated with ways of understanding relationships that are pervasively unintegrated and\nare often imbued with both hostility and helplessness. The findings also implicate a\ndevelopmental account that includes earlier attempts to punish and\/or provide care for adult\nattachment figures. To develop adequate treatments for this complex disorder, the\npervasively unintegrated relational representations of the borderline patient will need to\nbe addressed and translated into treatment strategies that increase the patient’s ability to\ncontain, integrate, and thereby modify these recurring and unsatisfying expectations and\nresponses in close relationships. A more developmentally sensitive account of the possible\norigins of such disturbed and unintegrated expectations of others can help both clinician and\npatient to organize and make sense of the patient’s relational experiences. Much remains to\nbe established about the sources of Hostile-Helpless, Fearfully Preoccupied, and\nUnresolved states of mind among women with BPD. However, future research efforts\nshould focus not only on the links between childhood adverse events and later\nmanifestations of personality disorder, but also upon social-developmental influences that\nconfigure an individual’s mental representations of self-other relationships, representations\nthat may correspond with specific forms of relational psychopathology.\nAcknowledgements\nWe are indebted to the patients who kindly agreed to take part in the study; to David Castle,\nRobert Howard, and Barbara Maughan who helped to administer the Adult Attachment\nBorderline and dysthymic women 13\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\nInterviews; to Gwendolyn Atwood and Claudia Yellin for their contributions to earlier\nversions of the coding system; and to the support we received from NHS R&D funding in\nthe UK and from the Livingston Fund of Harvard Medical School. Preparation of this\npaper was supported in part by grant #MH062030 to K. Lyons-Ruth and by a Fellowship\nto the Center for Advanced Study in the Behavioral Sciences, Stanford University, to\nP. Hobson.\nNote\n1 Phi is a measure of strength of association for a 26 2 table; eta is a measure of strength of association for the F\ntest.\nReferences\nAgrawal, H. R., Gunderson, J., Holmes, B. M., & Lyons-Ruth, K. (2004). Attachment studies with borderline\npatients: A review. Harvard Review of Psychiatry, 12, 94 – 104.\nAmerican Psychiatric Association. (1987). Diagnostic and statistical manual of mental disorders (3rd ed.). Washington,\nDC: Author.\nBandelow, B., Krause, J., Wedekind, D., Broocks, A., Hajak, G., & Ruther, E. (2005). Early traumatic life events,\nparental attitudes, family history, and birth risk factors in patients with borderline personality disorder and\nhealthy controls. Psychiatry Research, 134, 169 – 179.\nBarone, L. (2003). Developmental protective and risk factors in borderline personality disorder: A study using the\nadult attachment interview. Attachment and Human Development, 5, 64 – 77.\nBeck, A. (1984). The Beck Depression Inventory. In M. Williams (Ed.), The psychological treatment of depression: A\nguide to the theory and practice of cognitive behavioral therapy. New York: Free Press.\nBell, M., Billington, R., & Cicchetti, D. (1988). Do object relations deficits distinguish BPD from other diagnostic\ngroups? Journal of Clinical Psychology, 44, 511 – 516.\nBoutros, N. N., Torello, M., & McGlashan, T. H. (2003). Electrophysiological aberration in borderline personality\ndisorder: State of the evidence. Journal of Neuropsychiatry & Clinical Neuroscience, 15, 145 – 154.\nBowlby, J. (1980). Attachment and loss. Vol. 3: Loss: Sadness and depression. New York: Basic Books.\nBradley, R., Jenei, J., & Westen, D. (2005). Etiology of borderline personality disorder: Disentangling the\ncontributions of intercorrelated antecedents. Journal of Nervous & Mental Disease, 193, 24 – 31.\nBryer, J. B., Nelson, B. A., Miller, J. B., & Krol, P. A. (1987). Childhood sexual and physical abuse as factors in\nadult psychiatric illness. American Journal of Psychiatry, 144, 1426 – 1430.\nButler, A. C., Brown, G. K., Beck, A. T., & Grisham, J. R. (2002). Assessment of dysfunctional beliefs in borderline\npersonality disorder. Behaviour Research & Therapy, 40, 1231 – 1240.\nCarlson, V., Cicchetti, D., Barnett, D., & Braunwald, K. (1989). Disorganized\/disoriented attachment relationships\nin maltreated infants. Developmental Psychology, 25, 525 – 531.\nCarver, C. S., & Ganellen, R. J. (l983). Depression and components of self-punitiveness: High standards, self-\ncriticism, and overgeneralization. Journal of Abnormal Psychology, 92, 330 – 337.\nCassidy, J., & Marvin, R. S. (1991). The MacArthur Working Group on Attachment: Attachment organization in\npreschool children: Coding guidelines (3rd ed.). Unpublished manuscript.\nCicchetti, D., & Barnett, D. (1991). Attachment organization in maltreated preschoolers. Development and\nPsychopathology, 3, 397 – 411.\nCrandell, L. E., Patrick, M. P. H., & Hobson, R. P. (2003). ‘‘Still-face’’ interactions between mothers\nwith borderline personality disorder and their 2-month-old infants. British Journal of Psychiatry, 183, 239 – 247.\nEdelman, G. M. (1987). Neural darwinism. New York: Basic Books.\nFinger, B. (2006). Exploring the intergenerational transmission of attachment disorganization. Unpublished doctoral\ndissertation, Department of Psychology, University of Chicago.\nFonagy, P., Leigh, T., Steele, M., Steele, H., Kennedy, G., Mattoon, M., et al. (1996). The relation of attachment\nstatus, psychiatric classification, and responses to psychotherapy. Journal of Consulting and Clinical Psychology,\n64, 22 – 31.\nFreeman, W. (1995). Societies of brains. Hillsdale, NJ: Erlbaum.\nFreud, S. (1957). Mourning and melancholia. In J. Strachey (Ed. & Trans.), The standard edition of the complete\npsychological works of Sigmund Freud (Vol. 14, pp. 237 – 260). London: Hogarth Press. (Original work published\n1917).\n14 K. Lyons-Ruth et al.\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\nGeorge, C., Kaplan, N., & Main, M. (1985). The Attachment Interview for Adults. Unpublished manuscript,\nUniversity of California, Berkeley.\nGreenberg, J.,&Mitchell, S. (1983).Object relations in psychoanalytic theory.Cambridge,MA:HarvardUniversity Press.\nHerman. J., Perry, J., & van der Kolk, B. (1989). Childhood trauma in borderline personality disorder. American\nJournal of Psychiatry, 146, 490 – 495.\nHobson, R. P., Patrick, M., Crandell, L., Garcia-Perez, R., & Lee, A. (2005). Personal relatedness and attachment\nin infants of mothers with borderline personality disorder. Development and Psychopathology, 17, 329 – 347.\nHobson, R. P., Patrick, M. P. H., Crandell, L. E., Perez, R. M. G., & Lee, A. (2004). Maternal sensitivity and\ninfant triadic communication. Journal of Child Psychology & Psychiatry, 45, 470 – 480.\nHobson, R. P., Patrick, M. P. H., & Valentine, J. D. (1998). Objectivity in psychoanalytic judgements. British\nJournal of Psychiatry, 173, 172 – 177.\nJuengling, F. D., Schmahl, C., Heblinger, B., Ebert, D., Bremner, J. D., Gostomozyk, J., et al. (2003). Positron\nemission tomography in female patients with borderline personality disorder. Journal of Psychiatric Research, 37,\n109 – 115.\nLyons-Ruth, K., Bronfman, E., & Atwood, G. (1999). A relational diathesis model of hostile-helpless states of\nmind: Expressions in mother-infant interaction. In J. Solomon & C. George (Eds.), Attachment disorganization\n(pp. 33 – 69). New York: Guilford.\nLyons-Ruth, K., Bronfman, E., & Parsons, E. (1999). Maternal frightened, frightening, or atypical behavior and\ndisorganized infant attachment patterns. In J. Vondra & D. Barnett (Eds.), Atypical patterns of infant attachment:\nTheory, research, and current directions. Monographs of the Society for Research in Child Development, 64 (3, Serial\nNo. 258), 67 – 96.\nLyons-Ruth, K., Holmes, B., & Hennighausen, K. (2005, April). Prospective longitudinal predictors of borderline\nand conduct symptoms in late adolescence: The early caregiving context. In P. Hobson & K. Lyons-Ruth\n(Co-Chairs), Borderline psychopathology and early caregiving: Concurrent and longitudinal relations. Symposium\nconducted at the biennial meeting of the Society For Research in Child Development, Atlanta, GA.\nLyons-Ruth, K., Melnick, S., Bronfman, E., Sherry, S., & Llanas, L. (2004). Hostile-helpless relational models and\ndisorganized attachment patterns between parents and their young children: Review of research and\nimplications for clinical work. In L. Atkinson & S. Goldberg (Eds.), Attachment issues in psychopathology and\nintervention (pp. 65 – 94). Mahwah, NJ: Erlbaum.\nLyons-Ruth, K., Melnick, S., Yellin, C., & Atwood, G. (1995 – 2005). Pervasively unintegrated\/hostile-helpless states of\nmind on the Adult Attachment Interview. Unpublished coding manual, Department of Psychiatry, Cambridge\nHospital\/Harvard Medical School, Cambridge, MA.\nLyons-Ruth, K., Yellin, C., Melnick, S., & Atwood, G. (2003). Childhood experiences of trauma and loss have\ndifferent relations to maternal unresolved and hostile-helpless states of mind on the AAI. Attachment and\nHuman Development, 5, 330 – 352.\nLyons-Ruth, K., Yellin, C., Melnick, S., & Atwood, G. (2005). Expanding the concept of unresolved mental states:\nHostile\/Helpless states of mind on the adult attachment interview are associated with atypical maternal behavior\nand infant disorganization. Development and Psychopathology, 17, 1 – 23.\nMain, M., & Goldwyn, R. (1991). Adult attachment rating and classification system. Unpublished scoring manual\n(Version 5.0). Department of Psychology, University of California, Berkeley, CA.\nMain, M., Goldwyn, R., & Hesse, E. (1985 – 2005). Adult attachment rating and classification system. Unpublished\nscoring manual. Department of Psychology, University of California, Berkeley, CA.\nMain, M., Kaplan, N., & Cassidy, J. (1985). Security in infancy, childhood and adulthood: A move to the level of\nrepresentation. In I. Bretherton & E. Waters (Eds.), Growing Points of Attachment Theory and Research.\nMonographs of the Society for Research in Child Development, 50 (1 – 2), 66 – 104.\nNICHD Early Child Care Research Network. (2001). Child-care and family predictors of preschool attachment and\nstability from infancy. Developmental Psychology, 37, 847 – 862.\nNigg, J. T., Lohr, N. E., Westen, D., Gold, L. J., & Silk, K. R. (1992). Malevolent object representations in\nborderline personality disorder and major depression. Journal of Abnormal Psychology, 101, 61 – 67.\nNigg, J., Silk, K., Westen, D., Lohr, N., Gold, L., Goodrich, S., et al. (1991). Object representations in the early\nmemories of sexually abused borderline patients. American Journal of Psychiatry, 148, 864 – 869.\nParis, J., Zweig-Frank, H., & Guzder, J. (1994). Psychological risk factors for borderline personality disorder in\nfemale patients. Comprehensive Psychiatry, 35, 301 – 305.\nPatrick, M., Hobson, R. P., Castle, P., Howard, R., & Maughan, B. (1994). Personality disorder and mental\nrepresentation of early social experience. Development and Psychopathology, 6, 375 – 388.\nPosner, M. I., Rothbart, M. K., Vizueta, N., Thomas, K. M., Levy, K. N., Fosella, J., Silbersweig, D., Stern, E.,\nClarkin, J., & Kernberg, O. (2003). An approach to the psychobiology of personality disorders. Development &\nPsychopathology, 15(4), 1093 – 1106.\nBorderline and dysthymic women 15\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\nRegistrar General. (1965). Classification of occupations. London: HMSO.\nReich, D. B., & Zanarini, M. C. (2001). Developmental aspects of borderline personality disorder. Harvard Review\nof Psychiatry, 9, 294 – 301.\nSchuengel, C., Bakermans-Kranenburg, M., & van IJzendoorn, M. (1999). Frightening maternal behavior linking\nunresolved loss and disorganized infant attachment. Journal of Consulting and Clinical Psychology, 67, 54 – 63.\nSilverman, J., Pinkham, L., Horvath, T., Coccara, E., Klar, H., Schear, S., et al. (1991). Affective and impulsive\npersonality disorder traits in the relatives of patients with borderline personality disorder. American Journal of\nPsychiatry, 148, 1378 – 1385.\nvan IJzendoorn, M. H., Schuengel, C., & Bakermans-Kranenburg, M. J. (1999). Disorganized attachment in early\nchildhood: Meta-analysis of precursors, concomitants, and sequelae. Development and Psychopathology, 11,\n225 – 249.\nWartner, U. G., Grossmann, K., Fremmer-Bombik, E., & Suess, G. (1994). Attachment patterns at age six in south\nGermany: Predictability from infancy and implications for preschool behavior. Child Development, 65, 1014 –\n1027.\nWesten, D., Ludolph, P., Misle, B., Ruffins, S., & Block, J. (1990). Physical and sexual abuse in adolescent girls\nwith borderline personality disorder. American Journal of Orthopsychiatry, 60, 55 – 66.\nWhite, L. N., Gunderson, J. G., Zanarini, M. L., & Hudson, J. I. (2003). Family studies of borderline personality\ndisorder: A review. Harvard Review of Psychiatry, 11, 8 – 19.\nZanarini, M. C., Frankenburg, F. R., & Reich, D. B. (2000). Biparental failure in the childhood experiences of\nborderline patients. Journal of Personality Disorders, 14, 264 – 273.\nZanarini, M., Gunderson, J., Marino, M., Schwartz, E., & Frankenburg, F. (1989). Childhood experiences of\nborderline patients. Comprehensive Psychiatry, 30, 18 – 25.\nZanarini, M. C., Williams, A. A., Lewis, R. E., Reich, R. B., Vera, S. C., Marino, M. F., et al. (1997). Reported\npathological childhood experiences associated with the development of borderline personality disorder.\nAmerican Journal of Psychiatry, 154, 1101 – 1106.\nZanarini, M. C., Young, L., & Frankenburg, F. R. (2002). Severity of reported childhood sexual abuse and its\nrelationship to severity of borderline psychopathology and psychosocial impairment among borderline\ninpatients. Journal of Nervous & Mental Disease, 190, 381 – 387.\nZweig-Frank, H., & Paris, J. (1991). Parents’ emotional neglect and overprotection according to recollections of\npatients with borderline personality disorder. American Journal of Psychiatry, 148, 648 – 651.\n16 K. Lyons-Ruth et al.\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nTa\nvi\nst\noc\nk \n& \nPo\nrt\nma\nn \nCe\nnt\nre\n] \nAt\n: \n15\n:2\n3 \n18\n M\nay\n 2\n01\n0\n"}