{"doi":"10.1093\/eurpub","coreId":"65491","oai":"oai:dro.dur.ac.uk.OAI2:5658","identifiers":["oai:dro.dur.ac.uk.OAI2:5658","10.1093\/eurpub"],"title":"Welfare state regimes and income related health inequalities : a comparison of 23 European countries.","authors":["Eikemo,  T.","Bambra,  C.","Joyce,  K.","Dahl,  E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-12-01","abstract":"Objective: The objective of this study was to determine whether the magnitude of income-related\\ud\nhealth inequalities varies between welfare regimes (Scandinavian, Anglo-Saxon, Bismarckian, Southern\\ud\nand Eastern). Specifically, it examined whether the Scandinavian welfare state regime has smaller\\ud\nincome-based health inequalities than the other welfare state regimes. Methods: The first (2002) and\\ud\nsecond (2004) waves of the representative cross-sectional European Social Survey (ESS), which comprised\\ud\nmore than 80 000 respondents, were used to analyse income inequalities (relative health difference\\ud\nbetween the first and third income tertile) in self-reported health (general health, limiting longstanding\\ud\nillness) amongst those aged 25 or more. Data related to 23 European countries classified into\\ud\nfive welfare state regimes. The study controlled for age and adjusted for educational attainment.\\ud\nResults: When comparing the health of the first income tertile with the third, the Scandinavian\\ud\ncountries only seemed to hold an intermediate position: they did not have the smallest, or the largest,\\ud\nhealth inequalities. However, the Anglo-Saxon welfare states had the largest income-related health\\ud\ninequalities for both men and women, while countries with Bismarckian welfare states tended to\\ud\ndemonstrate the smallest. This pattern was unchanged after controlling for educational attainment.\\ud\nHowever, education seemed to explain the largest part of income-related health inequalities in\\ud\nthe Southern regime. Conclusion: This study shows that the magnitudes of income-related health\\ud\ninequalities indeed vary by welfare state regime. However, this variation was not always in the direction\\ud\nexpected as the Scandinavian countries did not exhibit the smallest health inequalities","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65491.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5658\/1\/5658.pdf","pdfHashValue":"9d08b65714da6e7e2230a2341424d0934b861f66","publisher":"Oxford University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5658<\/identifier><datestamp>\n      2011-11-04T17:08:18Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Welfare state regimes and income related health inequalities : a comparison of 23 European countries. <\/dc:title><dc:creator>\n        Eikemo,  T.<\/dc:creator><dc:creator>\n        Bambra,  C. <\/dc:creator><dc:creator>\n        Joyce,  K. <\/dc:creator><dc:creator>\n        Dahl,  E.<\/dc:creator><dc:description>\n        Objective: The objective of this study was to determine whether the magnitude of income-related\\ud\nhealth inequalities varies between welfare regimes (Scandinavian, Anglo-Saxon, Bismarckian, Southern\\ud\nand Eastern). Specifically, it examined whether the Scandinavian welfare state regime has smaller\\ud\nincome-based health inequalities than the other welfare state regimes. Methods: The first (2002) and\\ud\nsecond (2004) waves of the representative cross-sectional European Social Survey (ESS), which comprised\\ud\nmore than 80 000 respondents, were used to analyse income inequalities (relative health difference\\ud\nbetween the first and third income tertile) in self-reported health (general health, limiting longstanding\\ud\nillness) amongst those aged 25 or more. Data related to 23 European countries classified into\\ud\nfive welfare state regimes. The study controlled for age and adjusted for educational attainment.\\ud\nResults: When comparing the health of the first income tertile with the third, the Scandinavian\\ud\ncountries only seemed to hold an intermediate position: they did not have the smallest, or the largest,\\ud\nhealth inequalities. However, the Anglo-Saxon welfare states had the largest income-related health\\ud\ninequalities for both men and women, while countries with Bismarckian welfare states tended to\\ud\ndemonstrate the smallest. This pattern was unchanged after controlling for educational attainment.\\ud\nHowever, education seemed to explain the largest part of income-related health inequalities in\\ud\nthe Southern regime. Conclusion: This study shows that the magnitudes of income-related health\\ud\ninequalities indeed vary by welfare state regime. However, this variation was not always in the direction\\ud\nexpected as the Scandinavian countries did not exhibit the smallest health inequalities.<\/dc:description><dc:publisher>\n        Oxford University Press<\/dc:publisher><dc:source>\n        European journal of public health, 2008, Vol.18(6), pp.593-599 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2008-12-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5658<\/dc:identifier><dc:identifier>\n        issn:1101-1262<\/dc:identifier><dc:identifier>\n        issn: 1464-360X <\/dc:identifier><dc:identifier>\n        doi:10.1093\/eurpub\/ckn092<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5658\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1093\/eurpub\/ckn092<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5658\/1\/5658.pdf<\/dc:identifier><dc:rights>\n        This is a pre-copy-editing author-produced PDF of an article accepted for publication in European journal of public health following peer review. The definitive publisher-authenticated version Eikemo, T. and Bambra, C. and Joyce, K. and Dahl, E. (2008) 'Welfare state regimes and income related health inequalities : a comparison of 23 European countries.', European journal of public health., 18 (6). pp. 593-599 is available online at: http:\/\/dx.doi.org\/10.1093\/eurpub\/ckn092<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1101-1262"," 1464-360x","1101-1262","issn: 1464-360X"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n20 January 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nEikemo, T. and Bambra, C. and Joyce, K. and Dahl, E. (2008) ’Welfare state regimes and income related\nhealth inequalities : a comparison of 23 European countries.’, European journal of public health., 18 (6). pp.\n593-599.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1093\/eurpub\/ckn092\nPublisher’s copyright statement:\nThis is a pre-copy-editing author-produced PDF of an article accepted for publication in European journal of public\nhealth following peer review. The definitive publisher-authenticated version Eikemo, T. and Bambra, C. and Joyce, K.\nand Dahl, E. (2008) ’Welfare state regimes and income related health inequalities : a comparison of 23 European\ncountries.’, European journal of public health., 18 (6). pp. 593-599 is available online at:\nhttp:\/\/dx.doi.org\/10.1093\/eurpub\/ckn092\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \nDurham Research Online \n \nDeposited in DRO: \n20 January 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nAccepted for publication version \n \nCitation for published item: \nEikemo, T. and Bambra, C. and Joyce, K. and Dahl, E. (2008) 'Welfare state regimes and \nincome related health inequalities : a comparison of 23 European countries.', European \njournal of public health., 18 (6). pp. 593-599. \n \nFurther information on publishers website: \nhttp:\/\/dx.doi.org\/10.1093\/eurpub\/ckn092 \n \nPublisher’s copyright statement: \nThis is a pre-copy-editing author-produced PDF of an article accepted for publication in \nEuropean journal of public health following peer review. The definitive publisher-\nauthenticated version Eikemo, T. and Bambra, C. and Joyce, K. and Dahl, E. (2008) \n'Welfare state regimes and income related health inequalities : a comparison of 23 European \ncountries.', European journal of public health., 18 (6). pp. 593-599 is available online at: \nhttp:\/\/dx.doi.org\/10.1093\/eurpub\/ckn092 \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \n 1 \n \nWelfare state regimes and income related health inequalities:  \na comparison of 23 European countries \n \n \n \n \nT.A.Eikemo,\n1,2 \n* C.Bambra, \n3 \nK. Joyce \n3 \nand Espen Dahl \n4\n \n \n \n1 \nInstitute of Political Science and Sociology, Norwegian University of Science and Technology, \nNorway. \n2\n Department of Public Health, Erasmus MC, Netherlands. \n3\n Department of Geography, Wolfson Research Institute, Durham University, UK. \n4\n Health Sciences and Social Welfare, Oslo University College, Norway. \n \n \n \nCorresponding author: \n \nEmail: Terje.A.Eikemo@sintef.no   \nPhone: +47 99034077 \nFax: +47 93270800 \n \n \nWord count (main text): 3460 (original article) \n \n \n \nRunning head: Health inequalities between welfare state regimes \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 2 \nAbstract \nIntroduction: The objective of this study was to determine whether the magnitude of income \nrelated health inequalities varies between welfare regimes (Scandinavian, Anglo-Saxon, \nBismarckian, Southern and Eastern). Specifically, it examined whether the Scandinavian welfare \nstate regime has smaller income based health inequalities than the other welfare state regimes.  \nMethods: The first (2002) and second (2004) waves of the representative cross-sectional \nEuropean Social Survey (ESS), which comprised more than 80,000 respondents, were used to \nanalyse income inequalities (relative health difference between the first and third income tertile) \nin self-reported health (general health, limiting longstanding illness) amongst those aged 25 or \nmore. Data related to 23 European countries classified into five welfare state regimes. The study \ncontrolled for age and adjusted for educational attainment.  \nResults: When comparing the health of the first income tertile with the third, the Scandinavian \ncountries only seemed to hold an intermediate position: they did not have the smallest, or the \nlargest, health inequalities. However, the Anglo-Saxon welfare states had the largest income \nrelated health inequalities for both men and women, while countries with Bismarckian welfare \nstates tended to demonstrate the smallest. This pattern was unchanged after controlling for \neducational attainment. However, education seemed to explain the largest part of income related \nhealth inequalities in the Southern regime.  \nConclusion: This study shows that the magnitudes of income-related health inequalities indeed \nvary by welfare state regime. However, this variation was not always in the direction expected as \nthe Scandinavian countries did not exhibit the smallest health inequalities.  \n \nKeywords: Europe, health inequalities, income, welfare state regimes \n \n 3 \nIntroduction  \nStudies focusing on individual health differences within wealthy nations have shown that there is \na strong and consistent gradient along the whole income hierarchy. (1, 2) It might therefore be \nexpected that income related health inequalities would be smaller in the Scandinavian countries \nthan elsewhere given their relatively generous and universal welfare provision and the strong \nemphasis they place on equality of outcomes, such as income. (3) However, from the few studies \nthat have investigated health inequalities by European region, the Scandinavian countries do not \nperform as well on this in relation to other countries as might be expected given their relative \nstanding in terms of overall population health and income inequalities. In fact, previous studies of \nthe association between self-assessed health and relative income position in the wider European \ncontext have suggested that such health inequalities are perhaps not actually the smallest in the \nScandinavian countries. (4-8) Instead, these empirical studies have almost consistently reported \nthat income related health inequalities are smallest in the Central European countries (particularly \nin Germany). In addition, they have reported that they are largest in the UK.  \n \nMore recently, the comparative literature on income related health inequalities has utilised the \nconcept of welfare state regimes.  It is widely acknowledged that welfare states are important \ndeterminants of health and health inequalities as they mediate the extent, and impact, of socio-\neconomic position on health. Welfare state provision varies extensively across Europe, but \ntypologies have been put forward to categorise them into distinctive types or welfare state \nregimes. Increasingly, despite debates about how countries should be classified (9) and the \ncohesiveness of regimes (e.g. there is considerable debate within the comparative social policy \nliterature about the existence of a distinctive Southern regime with some commentators such as \nEsping-Andersen (3) arguing against and others, most notably Ferrera (10) and Leibfreid (11) \narguing in favour), there is a growing concensus that there are five regime types within Europe: \n 4 \nScandinavian, Anglo-Saxon, Bismarckian, Southern and Eastern. (10-13) In some cases, most \nnotably in terms of the Scandinavian welfare state regime, these regimes are similar to the \ngeographic clusters mentioned above so the ”regional” differences noted in earlier studies may \nwell be due to differences in welfare state arrangments – but this has not been explored to date. \nStudies which have examined how health varies by welfare state regime have invariably all \nconcluded that population health is enhanced by the relatively generous and universal welfare \nprovision of the more egalitarian and redistributive Scandinavian countries. (14-16)  \n \nHowever, as existing studies of income related health inequalities are few in number, have only \nexamined a limited number of countries, have focused on regions (rather than welfare state \nregimes) and may even be a little outdated, there remains a need to determine more clearly any \npatterns in income related health inequalities in Europe and how this varies by welfare state \nregime. The objective of the present study is therefore to determine whether the magnitude of \nincome related health inequalities varies by welfare regime (Scandinavian, Anglo-Saxon, \nBismarckian, Southern and Eastern). (9, 12, 17) The Anglo-Saxon welfare state regime (UK and \nIreland) is characterised by its basic and minimal levels of provision: social transfers are modest \nand often attract strict entitlement criteria; recipients are usually means-tested and stigmatised; \nthe dominance of the market is encouraged both passively, by guaranteeing only a minimum, and \nactively, by subsidising private welfare schemes. The Bismarckian welfare state regime \n(Germany, France, Austria, Belgium, and, to a lesser extent, the Netherlands) is distinguished by \nits „status differentiating‟ welfare programs in which benefits are often earnings related, \nadministered through the employer; and geared towards maintaining existing social patterns. The \nrole of the family is also emphasised and the redistributive impact is minimal. However, the role \nof the market is marginalised. The Scandinavian welfare regime (Denmark, Finland, Norway and \nSweden) is characterised by universalism, comparatively generous social transfers, a commitment \n 5 \nto full employment and income protection; and a strongly interventionist state. The state is used \nto promote social equality through a redistributive social security system. The southern welfare \nstate regime (Greece, Italy, Portugal and Spain) is characterised by a fragmented system of \nwelfare provision which consists of diverse income maintenance schemes that range from the \nmeagre to the generous and a health care system that provides only limited and partial coverage. \nThere is also a strong reliance on the family and charitable sector. Countries belonging to the \neastern welfare state regime (Czech Republic, Estonia, Hungary, Poland, Slovakia, and Slovenia) \nare clearly the most under defined and understudied region in terms of welfare state development. \nThe formerly Communist countries of East Europe have experienced extensive economic \nupheaval and have undertaken extensive social reforms throughout the 1990s. These have seen \nthe demise of the universalism of the Communist welfare state and a shift towards policies \nassociated more with the liberal welfare state regime notably marketisation and decentralisation. \nIn comparison with the other member states of the European Union, they have limited health \nservice provision.  \n \nIt should be noted that these are generalised descriptions of ideal type regimes; no single country \nwill have all the characteristics of a specific regime.   \n  \nThe present paper examines whether the magnitude of income related health inequalities varies \nbetween welfare state regimes (Anglo-Saxon, Bismarckian, Scandinavian, Southern and Eastern. \nThe European Social Survey is well suited for this purpose, as it provides regularly updated data \non self-assessed health from 23 European countries. If a between-regime pattern were to be \nfound, then it could suggest that certain within-regime policies may be an important factor in \nterms of understanding, and thereby finding ways of reducing, the health gap that exists between \nincome groups across Europe. \n 6 \n \nData and Methods  \nThe present study is based on data from the first and second wave of the European Social Survey \n(ESS), conducted in 2002 and 2004, comprising more than 80,000 respondents in 23 countries. \nThe main objective of the ESS is to provide high quality data over time about changing social \nattitudes and values in Europe. The objective of the ESS sampling strategy is the \"design and \nimplementation of workable and equivalent sampling strategies in all participating countries\". \nThe requirement is for random (probability) samples with comparable estimates based on full \ncoverage of the eligible residential populations aged 15+. They are based on the same basic \nprinciples of strict probability and representativeness. The data and extensive documentation are \nfreely available for downloading at the Norwegian Social Science Data Services (NSD) web site. \n(Norwegian Social Science Data Services) A total number of 69 821 respondents were available \nin the sample after deleting cases listwise by each variable in our analysis (99,4 % of the original \nsample for the included age groups). \n \nWe used two indicators of morbidity from the ESS: self reported general health and limiting \nlongstanding illness. Self reported general health was constructed from a variable asking; „How is \nyour (physical and mental) health in general?‟. Eligible responses were „very good‟, „good‟, \n„fair‟, „bad‟, and „very bad‟. We dichotomized the variable into „very good or good‟ health versus \n„less than good‟ health („fair‟, „bad‟, and „very bad‟). Regarding the second variable, participants \nwere asked if they were hampered in daily activities in any way by any longstanding illness or \ndisability, infirmity or mental health problem. Eligible responses were „yes a lot‟, „yes to some \nextent‟ and „no‟. We dichotomized this variable into „yes‟ (regardless of whether to some extent \nor a lot) and „no‟. The European Social Survey also gives information on household income and \neducation. The respondents were shown a card, on which weekly, monthly and annual wage \n 7 \nintervals were given, each marked with a letter. The respondents were then asked: „Using this \ncard, if you add up the income from all sources, which letter describes your household‟s total net \nincome? If you don‟t know the exact figure, please give an estimate. Use the part of the card that \nyou know best: weekly, monthly or annual income‟. From this variable, we constructed a scaled \nvariable based on the median value of these intervals, which then was recoded into a weekly \nequivalent income variable, using the OECD-modified scale. This scale was first proposed by \nHaagenars et al. (18) and assigns a value 1 to the household head, 0.5 to each additional adult \nmember and 0.3 to each child. This variable was divided into three equal sized groups (tertiles), \nwhich will be used to answer our research question (see Table 1 for an overview of all variables). \nEducation was measured as years of full-time education completed. \n \nOur research question will be addressed applying relative inequality measures, comparing the \nrichest (third income tertile) with the poorest (first income tertile) income group. The variables \nrepresenting the first and second income tertiles were introduced as independent variables in a \nlogistic regression analysis, controlled for age, with health variables as the dependent variable. \nNext, these odds ratios were adjusted by also including education in the models. The analysis is \nbased on responses from people aged 25 or over. A weight has been applied (dweight) to correct \nfor design effects due to sampling designs in countries where not all individuals in the population \nhave an identical selection probability (for example, the unweighted samples in some countries \nover- or under-represent people in certain types of address or household, such as those in larger \nhouseholds). \n \nThe results are presented as thematic maps.  For each of the five welfare regimes data pertaining \nto odds ratios with 95% confidence interval were input into ArcMap (v8.0) in dbf format.  Based \non the country field, attribute data were joined to shapefiles accessed from the Centers for \n 8 \nDisease Control and Prevention, Atlanta (http:\/\/www.cdc.gov\/EPIINFO\/europe.htm) to produce \nchoropleth maps. \n \nResults \nFigure 1 shows odds ratios with 95 % confidence intervals for each of the five welfare regimes \nand for men and women separately (country specific odds ratios are shown in web table C).  \nWhen comparing the odds between the first and third income tertiles, the results showed that the \nScandinavian welfare regimes only had intermediate odds ratios compared to the other regime \ntypes. For limiting longstanding illness the odds ratios were 1.82men and 1.89women, while they \nwere calculated to be 1.97men and 2.14women with respect to poor\/fair health respectively. \nFurthermore, the largest inequalities were found in the Anglo-Saxon welfare regimes (limiting \nlongstanding illness: ORmen=2.67 and ORwomen=2.21 \/ general health: ORmen=2.86 and \nORwomen=2.73) while the Bismarckian welfare regimes demonstrated the smallest (limiting \nlongstanding illness: ORmen=1.80 and ORwomen=1.57 \/ general health: ORmen=1.68 and \nORwomen=1.81).  \n \nThe odds ratios were reduced in all regimes after the adjustment for educational attainment \n(Figure 2). However, the Scandinavian welfare regimes still only held an average position \ncompared to other regime types. Educational attainment explained the largest part for women in \nthe South, as the proportional reduction of the odds ratios was largest in this welfare regime (40% \nfor men and 55 % for women with respect to limiting longstanding illness and 51 % for men and \n39 % for women with respect to poor\/fair general health). The slightly larger reduction of \nwomen‟s odds ratio of poor\/fair general health in the East (41 %) was the only exception from \nthis pattern. \n \n 9 \n--- Figure 1 and 2 about here --- \n \n \nDiscussion \nReturning to our original research questions, we have found that the magnitude of income related \nhealth inequalities does vary by welfare state regime; that the smallest income related health \ninequalities are found in the Bismarckian welfare regime; and that the Anglo-Saxon countries \n(UK in particular) have the largest health inequalities.  \n \nOur results are in keeping with previous regional studies of income related morbidity differences. \nWith the exception of rather large health inequalities among Dutch men and the intermediate \nposition of French men and women, the observations of Cavelaars et al. (4) seem to be largely in \nline with ours, as they also observed smallest inequalities in the Bismarckian countries (West \nGermany and the Netherlands), intermediate in Scandinavian welfare regimes (Finland and \nSweden), while they were largest in the UK. Van Doorslaer & Koolman (7) also found relatively \nsmall inequalities in Bismarckian welfare regimes (Netherlands, Germany, Belgium and Austria), \nwhile they were observed intermediate\/large in Scandinavia (Denmark) and large in the UK. The \nonly clear discrepancies from our results were smaller inequalities in the Anglo-Saxon regime \nIreland. Another study of nine industrialized countries showed particularly large inequalities in \nthe UK (and the United States), while amongst other European countries, Sweden, Finland and \nthe former East Germany had the lowest inequality. (8) Finally, Kunst et al. (6) reported larger \ninequalities among British men and women and smallest in (West) Germany, both in the 1980s \nand the 1990s. Although these studies did not have a particular focus on welfare regimes and \nwere based on different data sources and methodological strategies, they seem to reinforce our \nmain results.  \n 10 \n \nIn terms of other research on welfare state regimes and health inequalities, a recent literature \nreview, Dahl et al. (19) conclude that there was no apparent patterning of health inequalities by \nwelfare state regime. However, this study utilised Esping-Andersen‟s three-fold welfare state \ntypology, it reviewed studies which utilised various socio-economic indicators, based on national, \nrather than international, data sources and covered fewer countries than our ESS based study. \nPerhaps of more interest and relevance is therefore the study of health inequalities by welfare \nstate regime which used education as the indicator of socio-economic status. The educational \nstudy (20) used the same data, countries and regime classification as the present study, and it too \nfound an evident patterning of educational health inequalities by welfare state regime. This study \nfound that Southern European welfare regimes had the largest health inequalities, while countries \nwith Bismarckian welfare states tended to demonstrate the smallest. Although the other welfare \nregimes ranked relatively close to each other, the Scandinavian welfare regimes were placed less \nfavourably than the Anglo-Saxon and East European. The findings for educational inequalities in \nhealth for the Southern European and Anglo-Saxon countries differ notably from the income \ninequalities finding. This could be due to the fact that while education is often regarded as a non-\nmaterial resource, which promotes a healthy life-style, income on the other hand is usually \nconsidered to reflect material resources which are related to paid work. (21) In fact, in this \nincome analysis, educational attainment seemed to explain the largest part of health inequalities \nin the South.  \n \nOur study has found that the Anglo-Saxon welfare state regime has the highest income related \ninequalities in health. This is in keeping with expectations as they are also the most unequal \nWestern countries in terms of income inequality and operate the least generous social safety net. \nHowever, the finding that it is the Bismarckian welfare state regime which has the smallest health \n 11 \ninequalities and not the Scandinavian regime will need to be examined in more empirical detail in \nthe future. In terms of the positioning of the Scandinavian welfare states, it could mean that social \ndeterminants of health are not as equally distributed as might be expected within the most \negalitarian countries in the world. They have lower income inequalities and lower poverty rates \nthan most other European countries (22) and the Scandinavian welfare states are also considered \nas the most egalitarian on almost all other social and cultural measures. (3) Despite this, over the \nyears surveys of living conditions have documented that social inequalities prevail in respect to a \nnumber of material living conditions and life style behaviours. Thus, factors termed “social \ndeterminants of health” are systematically unevenly distributed among positions in the \nsocioeconomic hierarchy. It seems that lower levels of income inequality do not negate \ninequalities in exposure to the other social determinants of health and that, as Diderichsen (23) \nsuggests, “income and poverty therefore seem to have much less potential to reduce inequalities \nin health amongst adults, at least in those countries that already have universal entitlements or \nsocial insurance”. The degree to which the Scandinavian welfare regime departs in these respects \nfrom other regime types is hard to assess since comparative data are hard to find for the major \ndeterminants. The best evidence comes from life style factors such as smoking, and these studies \nshow that social inequalities in smoking are wider in Northern Europe than in the south. (24-27) \nDahl et al. (28) also suggest that relative deprivation may be a contributory factor and social \nexclusion of newer populations could also be involved. (20) Overall, it seems that the relatively \negalitarian income distribution in Scandinavian welfare regimes has not prevented the emergence \nand maintenance of relatively large socioeconomic inequalities in health. However, it should be \nnoted that the absolute inequalities in health are quite small and that health across the \nScandinavian populations is generally better than elsewhere in Europe.  \n \n 12 \nOur findings therefore require further exploration perhaps via sub-group analysis. For example, \nare the relative inequalities in health in different welfare state regimes consistent across different \nsocial or demographic groups e.g. are there variations by ethnicity, employment or immigration \nstatus. (20) Future research will need to explore such issues before we are able to fully explain \nthe comparative performance of the Scandinavian welfare state regime. Further, our study has \nonly focused on differences between welfare state regimes whereas in fact, there are also \ninteresting differences in the magnitude of income based health inequalities within welfare state \nregimes. This is perhaps most notable in the Eastern regime where, for example, the differences \nin longstanding illness amongst men range from OR 1.13 (0.80 – 1.58) in the Czech republic to \nOR 3.20 (1.85 – 5.52) in Estonia (Web table C). Similarly, income based inequalities in health \nare smaller in Sweden, and to a lesser extent in Denmark, than in Norway or Finland (Web table \nC). Clearly comparing most similar cases (i.e. different countries within one welfare state regime) \nis the next step for comparative social epidemiology and may well serve to be very beneficial in \nterms of helping to isolate specific policy interventions to reduce inequalities in health.  \n \nLimitations  \nOur study is subject to the following limitations. The first limitation concerns those who have not \nreported their household income. Clearly, the Southern European countries, Austria, \nLuxembourg, Czech Republic and Slovakia have rather large proportions of respondents who do \nnot report their income (up to 45.9 % among Italian women – see web table 1). To examine \nwhether this missing data affected our results, we undertook a sensitivity analysis, using \neducational tertiles and three occupational class categories (comparing ESeC classes I and II and \nIII to VII with VIII and IX). Both the education and class data showed that non-respondents did \nnot report systematically different health status, as compared to those with known household \nincome within the same educational tertiles or class categories.  \n 13 \n \nThe second potential limitation concerns the ESS response rates, which vary strongly between \ncountries, as shown in web table A. This is especially the case for the first wave in Switzerland, \nwhich had a response rate of only 33.5 %. If the non-response is related to health and socio-\neconomic position, then this would produce biased inequality measures. It should also be noted \nthat we have data for only one year with respect to Italy, Slovakia, and Estonia, which makes the \nsample size smaller in these countries compared to the others. Another methodological issue is \nthat our sample comes from two sweeps of the ESS. We therefore tested the effect of combining \nthese data by means of a sensitivity analysis. This analysis (not shown in tables) showed that our \nmain results could be replicated on the basis of each survey separately.   \n \nThird, self-assessed health might be comprehended across the income tertiles. However, van \nDoorslaer & Gerdham (29) studied the correlation between self-assessed health and mortality \naccording to different income groups and found that there is no systematic adjustment of self-\nassessed health by socio-economic position and therefore that the measured income-related \ninequality in self-assessed health is unlikely to be biased by reporting error. Also, as European \nregions and welfare state regimes are so entwined, it is possible that regional variations in culture \nmay have impacted on levels of self-rated health. However, a growing number of studies have \nshown that measures of self assessed health are strongly correlated with more objective measures \nsuch as mortality. (30, 31) \n \nFourthly, although we can not conclude whether the income inequalities in health are explained \nby health selection or social causation, available evidence from other investigations indicates that \nhealth selection explains only a small portion of the observed social gradient in health. (32) \n \n 14 \nFifthly, interpretations of relative health inequalities may be misleading if absolute measures are \nnot presented additionally. (33, 34) We have thus calculated the rate differences (RD) between \nthe higher (3\nrd\n) and lower (1\nst\n) income tertile, additionally. We also calculated the (age-adjusted) \npercentages of the total sample reporting fair\/poor general health and limiting longstanding \nillness in each welfare regime (web table B). The rate differences showed a similar pattern as \ncompared to the odds ratios, although not totally consistent, as the rate differences (RD) in the \nSouthern welfare regime were slightly smaller than the RD in Bismarckian regime with regard to \nlimiting longstanding illness. The prevalence rates were reported intermediate in the \nScandinavian countries, while they were consistently largest in Eastern Europe. Smallest \nprevalence rates were observed in the Anglo-Saxon countries with respect to poor\/fair general \nhealth and in the Southern welfare states for cases of limiting longstanding illness. \n \nSixthly, the study is subject to the problem of common method variance as both the independent \nand the dependent variables were based on self reports. Reports of longstanding illness are \nconsidered less subjective than self-rated health measures, and evidence suggests that the former \nrepresents a source of reliable and valid data on health status. (30, 35) \n \nFinally, we have not controlled for the variation of health between individuals within countries. \nHowever, sensitivity analyses by means of two-level multilevel models (not presented in tables) \nshowed that the odds ratios did not change substantially as compared to our original findings.   \n \nKEY POINTS \n This study is the first to examine whether income related health inequalities vary by \nwelfare state regime, using European Social Survey data for 23 European countries, \nclassified into five welfare state regimes: Anglo-Saxon, Bismarckian, Eastern, \nScandinavian and Southern.  \n \n The study shows that the magnitude of income related (self-assessed) health inequalities \nvary between welfare state regimes, that they are smallest in the Bismarckian welfare \n 15 \nregimes, only intermediate in the Scandinavian welfare regimes and largest in the Anglo-\nSaxon welfare regimes (UK in particular). \n \n The countries with the least extensive welfare state (Anglo-Saxon countries of UK and \nIreland) had the largest income related health inequalities. This suggests that the minimal \napproach taken in such countries exacerbates health inequalities.  \n \n Reducing health inequalities should continue to be an important public health strategy in \nall European countries and particularly in the UK but the approach will need to be multi-\nfaceted, tackling not just income inequalities but differential exposure by socio-economic \nstatus to the other major social determinants of health. \n \n \n \n \n \n \n \nReferences \n \n1. Adler NE, Boyce T, Chesney MA, Cohen S, Folkman S, Kahn RL, et al. Socioeconomic-\nStatus and Health - the Challenge of the Gradient. American Psychologist. 1994 Jan;49(1):15-24. \n2. Marmot M., Smith G., Stansfeld S., et al. Health inequalities among British civil servants \n– the Whitehall II study. Lancet. 1991(337):1387-93. \n3. Esping-Andersen G. The three worlds of welfare capitalism. London: Polity; 1990. \n4. Cavelaars A, Kunst AE, Geurts JJM, Helmert U, Lahelma E, Lundberg O, et al. \nDifferences in self-reported morbidity by income level in six European countries. Rotterdam: \nDepartment of Public Health, Erasmus University Rotterdam; 1998. \n5. Fritzell J, Nermo M, Lundberg O. The impact of income: assessing the relationship \nbetween income and health in Sweden. Scandinavian Journal of Public Health. 2004 Feb;32(1):6-\n16. \n 16 \n6. Kunst AE, Bos V, Lahelma E, Bartley M, Lissau I, Regidor E, et al. Trends in \nsocioeconomic inequalities in self-assessed health in 10 European countries. International Journal \nof Epidemiology. 2005 Apr;34(2):295-305. \n7. van Doorslaer E, Koolman X. Explaining the differences in income-related health \ninequalities across European countries. Health Economics. 2004 Jul;13(7):609-28. \n8. vanDoorslaer E, Wagstaff A, Bleichrodt H, Calonge S, Gerdtham UG, Gerfin M, et al. \nIncome-related inequalities in health: Some international comparisons. Journal of Health \nEconomics. 1997 Feb;16(1):93-112. \n9. Bambra C. Going Beyond The Three Worlds of Welfare Capitalism: Regime theory and \npublic health research Journal of Epidemiology and Community Health. in press. \n10. Ferrera M. The southern model of welfare in social Europe. Journal of European Social \nPolicy. 1996;6:17-37. \n11. Leibfreid S. Towards a European welfare state. In: Ferge Z, Kolberg JE, editors. Social \npolicy in a changing Europe. Frankfurt: Campus-Verlag; 1992. p. 245-79. \n12. Bambra C. Sifting the wheat from the chaff: A two-dimensional discriminant analysis of \nwelfare state regime theory. Social Policy and Administration. 2007;41:1-28. \n13. Eurothine project. http:\/\/mgzlx4.erasmusmc.nl\/eurothine. \n14. Bambra C. Health status and the worlds of welfare. Social Policy and Society. \n2006a;5:53-62. \n15. Chung H., Muntaner C. Welfare state matters: A typological multilevel analysis of \nwealthy countries. . Health Policy. 2007;80:328-39. \n16. Coburn D. Beyond the income inequality hypothesis: class, neo-liberalism, and health \ninequalities. Social Science & Medicine. 2004 Jan;58(1):41-56. \n17. Eikemo T., Bambra C. The welfare state: a glossary for public health. Journal of \nEpidemiology and Community Health. in press. \n 17 \n18. Hagenaars A, de Vos K, Zaidi MA. Poverty Statistics in the Late 1980s: Research Based \non Micro-data. Luxembourg; 1994. \n19. Dahl E, Fritzell, J., Lahelma, E., Martikainen, P., Kunst, A., Mackenbach, J.,. Welfare \nstate regimes and health inequalities. In: Siegrist J., Marmot M., editors. Social inequalities in \nhealth. Oxford Oxford University Press; 2006. p. 193-222. \n20. Eikemo T., Huisman M., Bambra C., Kunst A. Health inequalities according to \neducational level under different welfare regimes: a comparison of 23 European countries. \nSociology of Health and Illness. in press. \n21. Geyer S, Hemstrom O, Peter R, Vagero D. Education, income, and occupational class \ncannot be used interchangeably in social epidemiology. Empirical evidence against a common \npractice. Journal of Epidemiology and Community Health. 2006 Sep;60(9):804-10. \n22. Ritakallio VM, Fritzell J. Societal Shifts and Changed Patterns of Poverty, Luxembourg \nIncome Study Working Paper Series; 2004. \n23. Diderichsen F. Impact of income maintenance policies. In: Mackenbach J, Bakker M, \neditors. Reducing inequalities in health: a European perspective. London: Routledge; 2002. p. 53-\n66. \n24. Avendano M, Kunst AE, Huisman M, Lenthe FV, Bopp M, Regidor E, et al. \nSocioeconomic status and ischaemic heart disease mortality in 10 western European populations \nduring the 1990s. Heart. 2006 Apr;92(4):461-7. \n25. Cavelaars A, Kunst AE, Geurts JJM, Crialesi R, Grotvedt L, Helmert U, et al. Educational \ndifferences in smoking: international comparison. British Medical Journal. 2000 \nApr;320(7242):1102-7. \n26. Huisman M, Kunst AE, Mackenbach JP. Inequalities in the prevalence of smoking in the \nEuropean Union: comparing education and income. Preventive Medicine. 2005b Jun;40(6):756-\n64. \n 18 \n27. Kunst AE, Groenhof F, Anderson O, Borgan JK, Costa G, Desplanques G, et al. \nOccupational class and ischemic heart disease mortality in the United States and 11 European \ncountries. American Journal of Public Health. 1999 Jan;89(1):47-53. \n28. Dahl E., Fritzell J., Lahelma E., Martikainen P., Kunst A., Mackenbach J. Welfare state \nregimes and health inequalities. In: Siegrist J., Marmot M., editors. Social inequalities in health. \nOxford Oxford University Press; 2006. p. 193-222. \n29. van Doorslaer E, Gerdtham UG. Does inequality in self-assessed health predict inequality \nin survival by income? - Evidence from Swedish data. Social Science & Medicine. 2003 \nNov;57(9):1621-9. \n30. Idler EL, Benyamini Y. Self-rated health and mortality: A review of twenty-seven \ncommunity studies. Journal of Health and Social Behavior. 1997 Mar;38(1):21-37. \n31. Heistaro S, Jousilahti P, Lahelma E, Vartiainen E, Puska P. Self rated health and \nmortality: a long term prospective study in eastern Finland. Journal of Epidemiology and \nCommunity Health. 2001 Apr;55(4):227-32. \n32. Chandola T, Bartley M, Sacker A, Jenkinson C, Marmot M. Health selection in the \nWhitehall II study, UK. Social Science & Medicine. 2003 May;56(10):2059-72. \n33. Benzeval M, Judge K, Shouls S. Understanding the relationship between income and \nhealth: How much can be gleaned from cross-sectional data? Social Policy & Administration. \n2001 Sep;35(4):376-96. \n34. Vagero D, Erikson R. Socioeconomic inequalities in morbidity and mortality in western \nEurope. The Lancet. 1997;350(9076):516. \n35. Benjamins MR, Hummer RA, Eberstein IW, Nam CB. Self-reported health and adult \nmortality risk: An analysis of cause-specific mortality. Social Science & Medicine. 2004 \nSep;59(6):1297-306. \n \n \n"}