{"doi":"10.3982\/ECTA7953","coreId":"96331","oai":"oai:eprints.lse.ac.uk:29705","identifiers":["oai:eprints.lse.ac.uk:29705","10.3982\/ECTA7953"],"title":"Sorting and decentralized price competition","authors":["Eeckhout, Jan","Kircher, Philipp"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-04-08","abstract":"Econometrica publishes original articles in all branches of economics - theoretical and empirical, abstract and applied, providing wide-ranging coverage across the subject area. It promotes studies that aim at the unification of the theoretical-quantitative and the empirical-quantitative approach to economic problems and that are penetrated by constructive and rigorous thinking. It explores a unique range of topics each year - from the frontier of theoretical developments in many new and important areas, to research on current and applied economic problems, to methodologically innovative, theoretical and applied studies in econometrics","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96331.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/29705\/1\/Sorting_and_decentralized_price_competition_%28LSERO%29.pdf","pdfHashValue":"ebac93f050d05930da8ac819c0d6495296697a63","publisher":"Wiley","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:29705<\/identifier><datestamp>\n      2014-04-09T15:05:11Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4543<\/setSpec><setSpec>\n      74797065733D434F4C4C53:4C53455F435F454F<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/29705\/<\/dc:relation><dc:title>\n        Sorting and decentralized price competition<\/dc:title><dc:creator>\n        Eeckhout, Jan<\/dc:creator><dc:creator>\n        Kircher, Philipp<\/dc:creator><dc:subject>\n        HB Economic Theory<\/dc:subject><dc:description>\n        Econometrica publishes original articles in all branches of economics - theoretical and empirical, abstract and applied, providing wide-ranging coverage across the subject area. It promotes studies that aim at the unification of the theoretical-quantitative and the empirical-quantitative approach to economic problems and that are penetrated by constructive and rigorous thinking. It explores a unique range of topics each year - from the frontier of theoretical developments in many new and important areas, to research on current and applied economic problems, to methodologically innovative, theoretical and applied studies in econometrics.<\/dc:description><dc:publisher>\n        Wiley<\/dc:publisher><dc:date>\n        2010-04-08<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/29705\/1\/Sorting_and_decentralized_price_competition_%28LSERO%29.pdf<\/dc:identifier><dc:identifier>\n          Eeckhout, Jan and Kircher, Philipp  (2010) Sorting and decentralized price competition.  Econometrica, 78 (2).  pp. 539-574.  ISSN 0012-9682     <\/dc:identifier><dc:relation>\n        http:\/\/www.wiley.com\/bw\/journal.asp?ref=0012-9682<\/dc:relation><dc:relation>\n        10.3982\/ECTA7953<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/29705\/","http:\/\/www.wiley.com\/bw\/journal.asp?ref=0012-9682","10.3982\/ECTA7953"],"year":2010,"topics":["HB Economic Theory"],"subject":["Article","PeerReviewed"],"fullText":"  \nJan Eeckhout and Philipp Kircher\nSorting and decentralized price competition\n \nArticle (Accepted version) \n(Refereed) \nOriginal citation: \nEeckhout, Jan and Kircher, Philipp (2010) Sorting and decentralized price competition. \nEconometrica, 78 (2). pp. 539-574. \n \nDOI: 10.3982\/ECTA7953\n \n© 2010 Econometric Society. The copyright to this article is held by the Econometric Society, \nhttp:\/\/www.econometricsociety.org\/. It may be downloaded, printed and reproduced only for \npersonal or classroom use. Absolutely no downloading or copying may be done for, or on behalf \nof, any for-profit commercial firm or other commercial purpose without the explicit permission of \nthe Econometric Society. For this purpose, contact Claire Sashi, General Manager, at \nsashi@econometricsociety.org. \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/29705\/\n \nAvailable in LSE Research Online: October 2010 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \nSorting and Decentralized Price Competition∗\nJan Eeckhout†and Philipp Kircher‡\nSecond Revision, October 2009\nAbstract\nWe investigate the role of search frictions in markets with price competition and how it leads to\nsorting of heterogeneous agents. There are two aspects of value creation: the match-value when two\nagents actually trade, and the probability of trading governed by the search technology. We show\nthat positive assortative matching obtains when complementarities in the former outweigh comple-\nmentarities in the latter. This happens if and only if the match-value function is root-supermodular,\ni.e., its n-th root is supermodular, where n reflects the elasticity of substitution of the search tech-\nnology. This condition is weaker than the condition required for positive assortative matching in\nmarkets with random search.\nKeywords. Competitive Search Equilibrium. Directed Search. Two-Sided Matching. Decentralized\nPrice Competition. Complementarity. Root-Supermodularity. Sorting.\n∗The paper initially circulated under the title “The Sorting Effect of Price Competition”. We would like to thank nu-\nmerous colleagues and seminar participants for insightful discussions and comments. We greatly benefited from comments\nby Ken Burdett, John Kennan, Stephan Lauermann, Benny Moldovanu, Michael Peters, Andrew Postlewaite, Shouyong\nShi, Robert Shimer and Randy Wright. Kircher gratefully acknowledges support from the National Science Foundation,\ngrant SES-0752076, and Eeckhout by the ERC, grant 208068.\n†Department of Economics, UPF Barcelona, ICREA, GSE, and University of Pennsylvania eeckhout@ssc.upenn.edu.\n‡Department of Economics, University of Oxford and University of Pennsylvania, kircher@econ.upenn.edu.\n1\n1 Introduction\nWe address the role of search frictions in the classic assignment problem when there is price competition.\nWe are interested in a simple condition for Positive Assortative Matching (PAM) that exposes the\ndifferent forces inducing high types to trade with other high types. In the neoclassical benchmark\n(Becker 1973, Rosen 1974) there is full information about prices and types, and markets clear perfectly.\nSupermodularity of the match-value then induces PAM. At the other extreme, Shimer and Smith\n(2000) assume that there are random search frictions and agents cannot observe prices and types until\nafter they meet. They derive a set of conditions that ensure PAM, and these jointly imply that the\nmatch-value is log-supermodular. In this paper we consider a world with search frictions, yet there is\ninformation about prices and types. This circumvents the feature of the random search model that\nagents necessarily meet many trading partners that they would have rather avoided. Heterogeneous\nsellers compete in prices for buyers, and we find that sorting is driven by a simple efficiency trade-off\nbetween the gains from better match values and the losses due to no trade. The former are captured by\ncomplementarities in the match-value, which have to offset complementarities in the search technology\nas measured by the elasticity of substitution. This economic trade-off establishes that PAM occurs\nfor all type distributions if and only if the match-value is root-supermodular, i.e., its n−th root is\nsupermodular where n depends on the elasticity of substitution of the search technology. This condition\nis weaker than log-supermodularity and has a transparent economic interpretation.\nThe key ingredients of our model are diversity, market frictions, and price competition. Diversity is\nthe hallmark of economic exchange. People have different preferences over goods and are endowed with\ndiverse talents. Such diverse tastes and endowments lead to different market prices that are driven by\nthe supply and demand of each variety. Spatially differentiated goods like houses, for example, are priced\ndepending on the characteristics of the occupants, location and the dwelling itself. Assets in the stock\nmarket are differentiated depending on many characteristics, most notably mean and variance. And in\nlabor markets, salaries vary substantially depending on the experience and skill of the worker and on the\nproductivity and safety of the job. And while centralized price setting (see Rosen 2002, for an overview)\nadequately captures environments such as the stock market, in many other environments agents trading\nis decentralized and frictions are non-negligible. In the labor market for example, unemployment is a\nnatural feature, and in the housing market several months delay in finding a buyer are usual.\nTo captures these features, we consider a decentralized market framework with search frictions, yet\nwith price competition. This framework is known as directed search or competitive search. Sellers have\n2\none unit for sale, buyers want to buy one unit. Think of “locations” or ”submarkets” indexed by the\nquality of the product and the trading price. Sellers of a particular quality choose the location with\nthe price they want to obtain. Buyers observe the sellers at the various locations and decide at which\nlocation they would like to trade, i.e., which quality-price combination to seek. At each location there\nremain search frictions that prevent perfect trade: When the ratio of buyers to sellers at a location\nis high, then the probability of trade is high for the sellers and low for the buyers. Observe that the\nlocation metaphor is used for simplicity but is not crucial (e.g., in Peters (1991, 1997) buyers choose an\nindividual seller with the desired quality-price announcement but sometimes multiple buyers choose the\nsame seller and not all can trade). Prices guide the trading decisions just like in the Walrasian model\nof Becker (1973) and Rosen (1974), only now the possibility that a person cannot trade remains an\nequilibrium feature that is taken into account in the price setting. One novelty of our setting relative to\nthe earlier directed search literature is that it is designed to handle rich (continuous) type distributions\non both sides of the market.\nWe identify the economic forces that drive the sorting pattern, and provide a necessary and sufficient\ncondition on the strength of supermodularity that ensures positive assortative matching. The key\neconomic insight is that the creation of value can be decomposed into two sources: the complementarity\nin the match-value upon trading and the complementarity in the search technology. In the Walrasian\nframework, only the first source is present. When both are present, they trade off against each other:\nthe first leads towards positive assortative matching, the second leads towards negative assortative\nmatching. If the former outweighs the latter, positive assortative matching obtains. We can summarize\nthe necessary and sufficient condition required for PAM by root-supermodularity of the match-value\nfunction, i.e., the n-th root of the match-value function is supermodular. The magnitude of n is\ndetermined by the upper bound of the elasticity of substitution of the search technology. Similarly,\nmatch-values that are nowhere n−root-supermodular lead to negative assortative matching, where n\nnow denotes the lower bound of the elasticity of substitution in the search technology.\nThe economic intuition of this trade-off between frictions and complementarities in match values\nis transparent in terms of the fundamentals of the economy. In the absence of any complementarities,\nsorting is not important for the creation of match-value. The key aspect is “trading security”, i.e., to\nensure trade and avoid frictions. High-type buyers would like to trade where few other buyers attempt\nto trade. This allows them to secure trade with high probability, and they are willing to pay for this.\nWhile sellers know that they might be idle if they attract few buyers on average, some are willing\nto do this at a high enough price. The low-type sellers are those who find it optimal to provide this\n3\ntrading security, as their opportunity cost of not trading is lowest. This results in negative assortative\nmatching: high-type buyers match with low-type sellers. In the directed search literature, Shi (2001)\nwas the first to highlight for a specific search technology that supermodularity is not enough to ensure\npositive assortative matching. Here, we address in a general context the extent of the complementarities\nrequired for positive assortative matching, and we isolate the economic forces that govern such sorting.1\nHow much supermodularity is needed – how fast marginal output changes across different matched\ntypes – depends on how fast the probability of matching changes when moving across different types with\ndifferent buyer-to-seller ratios. The change in the matching probability is captured by the elasticity of\nsubstitution of the search technology. The elasticity of substitution measures how many more matches\nare created as the ratio of buyers to sellers increases. If it is high, then matching rates are very sensitive\nto the buyer-seller ratio and submarkets with lots of low type sellers make it easy for the high type\nbuyers to trade while submarkets with lots of low type buyers make it easy for the high seller types\nto trade. The “trading-security” motive is important since the gains from negative sorting are large,\nand positive sorting only arises if the match-value improves substantially when high types trade with\nhigh types rather than low types. If the elasticity of substitution in the search technology is low, then\nit is difficult to generate additional matches for the high types and even moderate strength of the\nmatch-value motive will offset the tendency to seek trading security.\nThe exact level of supermodularity required for positive sorting can be expressed by requiring a\nconcave transformation of the match-value to be supermodular. In particular, it can be summarized\nby the (relative) Arrow-Pratt measure of the transform, which has to be as large as the elasticity of\nsubstitution of the search technology. The latter is in the unit interval, so the associated transform\nis the n − th root, where n depends on the exact magnitude of the elasticity of substitution. The\nroot-supermodularity condition therefore neatly summarizes the trade-off between complementarity in\nmatch-value and the elasticity of substitution of the search technology.\nFor PAM our condition is weaker than log-supermodularity required in random search models such\nas Shimer and Smith (2000)2 and Smith (2006). The key difference is that our framework allows agents\nto seek the quality and price they desire. This leads to a rather simple and straightforward condition\nfor sorting. It requires a lower degree of complementarity in the match-value to overcome the search\n1We relate our findings to Shi’s (2001) insight in greater detail in section 6.\n2The models are not immediately comparable partly because random search requires a set based notion of assortative\nmatching, while the frictionless benchmark and our model does not. Note also that the conditions in Shimer and Smith\n(2000) include log-supermodularity even of first and cross-partial derivatives, but not log-supermodularity. However,\ncoupled with monotonicity as assumed throughout our model, log-supermodularity is implied by their conditions. We\ndiscuss the relation to Shimer and Smith (2000) and other work in Section 6.\n4\nfrictions. Only when the search technology approaches perfect substitutability is log-supermodularity\nneeded. Our condition for positive assortative matching therefore falls in between those for frictionless\ntrade of Becker and random search. Yet, when it comes to negative assortative matching, our results\ndiffer substantially. Match-values that are nowhere n-root-supermodular induce negative sorting. In\nparticular, this is the case for any weakly submodular match-value function. And if the matching\ntechnology never approaches perfect complementarity (this excludes the urn-ball search technology),\nthen there are strictly supermodular match-value functions such that negative sorting arises for any\ndistribution of types. To our knowledge, this is new in the literature on sorting with or without\nfrictions. In comparison, negative assortative matching obtains only under stronger conditions both in\nthe frictionless case (strict submodularity) and with random search (log-submodularity).\nOur requirement of root-supermodularity is necessary and sufficient to ensure positive assortative\nmatching if we allow for any distribution of types. It is binding when the buyer-seller ratio in some\nmarket induces the highest possible elasticity of substitution of the search technology. For some dis-\ntributions this is not a binding restriction, and in this case there are match-value functions with less\ncomplementarity that nonetheless induce positive assortative matching. In that sense, our condition\nis one of weak necessity. Likewise, the condition that ensures negative assortative matching for any\ndistribution of types is stringent, requiring for example the absence of any complementarities for the\ncase of urn-ball matching. Again, we show that for many search technologies (such as urn-ball) there\nexist particular distributions for which weaker requirements suffice.\nOur results hold for very general search technologies and match-values. Yet, it turns out that a large\nclass of widely used search technologies has a common condition, that of square-root-supermodularity.\nThis is the case for any search technology that has bounds on its derivatives at zero and some curvature\nrestriction, for example the urn-ball search technology. In this class, the value of the elasticity at zero\nis always one half. The CES search technology satisfies the Inada conditions and therefore does not\nhave bounded derivatives. Because in the latter the elasticity of substitution is constant, it separates\nthe range of positive and negative sorting exactly.\nFinally, we establish existence of a sorting equilibrium and show efficiency, i.e., the planner’s so-\nlution can be decentralized. While the efficiency properties of directed search models are well-known\n(see e.g. Moen (1997), Acemoglu and Shimer (1999b), and Shi (2001)) we discuss in particular the\nconnection of our condition to the well-known Hosios condition. Hosios’ (1990) original contribution\nconsiders identical buyer and seller types, and relates the first derivative of the aggregate search tech-\nnology to the match-value. In our setting this holds for each submarket. With heterogeneity, agents\n5\nhave a choice which submarket to join. Our root-supermodularity condition ensures efficient sorting\nacross submarkets by relating the elasticity of substitution of the aggregate search technology to the\ncomplementarities in the match-value.\nIn the discussion section, we relate our model to existing results in the search literature. We discuss\ndirected and random search, and the relationship of our model to the large literature on the foundations\nof competitive equilibria as limits of matching games with vanishing frictions. We consider a convergent\nsequence of search technologies in our static economy such that in the limit the short side of the market\ngets matched with certainty. To our knowledge, considering vanishing frictions as the limit of a sequence\nof static search technologies is new in this literature on foundations for competitive equilibrium. In the\nconclusions we also highlight that our results do not only apply to search markets, but also shed some\ninitial light on sorting in many-to-many matching markets.\n2 The Model\nWe cast our model in the context of a generic trading environment between buyers and sellers, as is\noften done in the directed search literature. This environment includes the labor market and many\nother markets with two-sided heterogeneity and search frictions. Our set-up is chosen to be as general\nas possible and to encompass a broad class of different search technologies.\nPlayers. There is a mass of heterogeneous sellers who are indexed by a type y ∈ Y that is observable.\nLet S(y) denote the measure of sellers with types weakly below y ∈ Y. We assume Y =[y, y] ⊂ R+,\nand S(y) denotes the overall measure of sellers. Each seller has one good for sale. On the other side\nof the market there is a unit mass of buyers. Buyers differ in their valuation for the good, which is\nprivate information. Each buyer draws his type x i.i.d. from distribution B(x) on X =[x, x] ⊂ R+. S\nand B are C2 and with strictly positive derivatives s and b, respectively. It is convenient to think of a\ncontinuum of agents of each type, and of b(x) and s(y) as the densities of x and y types.\nPreferences. The value of a good consumed by buyer x and bought from seller y is given by f(x, y),\nwhere f is a strictly positive function f : R2+→R++. Conditional on consuming and paying a price p,\nthe utility of the buyer is f(x, y)−p and that of the seller is p. That is, agents have quasi-linear utilities.\nWe discuss broader preferences for the seller in the conclusion. We assume that f is twice continuously\ndifferentiable in (x, y). We consider indices x and y that are ordered such that they increase the utility\nof the buyer: fx > 0, fy > 0. The utility of an agent who does not consume is normalized to zero.\nClearly, no trade takes place at prices below 0 and above f(x, y), and we define the set of feasible prices\n6\nas P = [0, f(x, y)]. All agents maximize expected utility.\nSearch Technology. The model is static.3 There are search frictions in the sense that with positive\nprobability, a buyer does not get to match with the seller he has chosen. The extent of the frictions\ndepends on the competition for the goods. We capture this idea of competition by considering the ratio\nof buyers to sellers, denoted by λ ∈ [0,∞], and refer to it as the expected queue length. This ratio\nvaries in general with the quality of the good offered and the price posted. When a seller faces a ratio\nof λ, then he meets (and trades with) a buyer with probability m(λ). The idea that relatively more\nbuyers make it easier to sell is captured by assuming that m : [0,∞] → [0, 1] is a strictly increasing\nfunction. Analogously, buyers who want to trade at a price-quality combination that attracts a ratio\nλ of buyers to sellers can buy with probability q(λ), where q : [0,∞] → [0, 1] is a strictly decreasing\nfunction: when there are relatively more buyers, it becomes harder to trade. Trading in pairs requires\nthat q(λ) = m(λ)\/λ. We additionally impose the standard assumption that m is twice continuously\ndifferentiable, strictly concave, and has a strictly decreasing elasticity.\nExamples of Search Technologies. There are many ways to interpret and provide a micro foundation\nfor the search technology. The most common one arises when buyers directly choose a seller but use\nan anonymous strategy in their selection. That means that once they decide on the quality-price\ncombination, they choose one of the sellers with these characteristics at random. In a large market\nwith many buyers and sellers, the probability that a seller has at least one buyer and can trade is\napproximately m1(λ) = 1− e−λ. This search technology was first proposed by Butters (1977) (see also\nPeters (1991), Shi (2001), Shimer (2005)). Variations of this specification arise naturally, e.g., when a\nfraction 1−β of the buyers gets lost on the way to the sellers, we have m2(λ) = 1−e−βλ. Alternatively,\nif at each price-quality combination agents form pairs randomly, but trade only occurs when a seller is\npaired with a buyer (in the spirit of Kiyotaki and Wright (1993)) the matching probability is m3(λ) =\nλ\/(1 + λ).\nExtensive Form and Trading Decisions. The extensive form of the market interaction has two stages.\nIn stage one, all sellers simultaneously post a price p at which they are willing to sell the good. In stage\ntwo, after observing the sellers’ qualities and their posted prices (y, p), buyers simultaneously decide\nwhere to attempt to buy, i.e., each buyer chooses the quality-price combination (y, p) that she seeks.\nA buyer for whom all the prices p are too high can always choose the option of no trade, denoted by\n∅.4 A buyer who gets matched consumes the good and pays the posted price. Whether or not a buyer\n3We discuss our findings for steady-states of a repeated model in the conclusion. See also our working paper version.\n4To make the choice of no trade consistent with the rest of our notation, let ∅ = (∅y, ∅p) where ∅y < y denotes a\n7\ngets matched with a seller is determined by the search technology. This two-stage extensive form is\nin the spirit of, e.g., Peters (1991, 2000) and Acemoglu and Shimer (1999a,b). We denote by G(y, p)\nand H(x, y, p) the distribution of trading decisions of sellers and buyers, i.e., G(y, p) is the measure of\nsellers that offer a quality-price combination below (y, p), and H(x, y, p) is the measure of buyers with\ntypes below x who attempt to buy a quality-price combination that is below (y, p).\nFor many subsequent discussions the marginals of these distributions are important, which we denote\nwith subscripts. For example, HX is the buyers’ marginal distribution across their types, and HYP is the\nbuyers’ marginal distribution over seller types and prices. We impose the following two requirements.\nFirst, we require GY = S and HX = B, i.e., the measure of traders coincides with the distribution in\nthe population. Second, we require HYP to be absolutely continuous with respect to G, which means\nthat if there are no sellers who have chosen prices in some set, then no buyers will try to buy from that\nset. This will enables us to use the Radon-Nikodym derivative below.\nEquilibrium. Our equilibrium concept follows the literature on large games (see e.g., Mas-Colell\n1984) where the payoff of each individual is determined only by his own decision and by the distribution\nof trading decisions G and H in the economy, which in turn have to arise from the optimal decisions\nof the individual traders.5 To define the expected payoffs for each agent given G and H, let the\nfunction ΛGH : Y × P → [0,∞] denote the expected queue length at each quality-price combination.\nAlong the support of the sellers’ trading distribution G it is given by the Radon-Nikodym derivative\nΛGH = dHYP\/dG.6 Along the support of G we can define the expected payoff of sellers as\npi(y, p,G,H) = m(ΛGH(y, p))p (1)\nand of buyers as\nu(x, y, p,G,H) = q(ΛGH(y, p)) [f(x, y)− p] . (2)\nSo far the payoffs are only determined on the path of play, since the buyer-seller ratio ΛGH is only\nwell defined there. We extend the payoff functions by extending the queue length function ΛGH to all\nof Y × P. A seller who contemplates a deviation and offers a price different from all other sellers, i.e.,\nnon-existent quality and ∅p < 0 denotes a non-existent price, and the trading probability at ∅ is zero.\n5We are grateful to Michael Peters for pointing this approach out to us, which brings the competitive search model in\nline with the standard game theoretic approach to large markets.\n6On the support of G the Radon-Nikodym derivative is well-defined, up to a zero measure set: any two derivatives\ncoincide almost everywhere. To achieve everywhere well-defined payoffs in (1) and (2), assume some rule that selects a\nunique ΛGH on suppG for each (G,H). For our existence proof we require the selection to be continuous and differentiable\nwherever possible on suppG, as this will select the derivative that we construct.\n8\n(y, p) \/∈suppG has to form a belief about the queue length that he will attract. We follow the literature\n(e.g. McAfee (1993), Acemoglu and Shimer (1999b), Shimer (2005)) by imposing restrictions on beliefs\nin the spirit of subgame perfection: the seller expects a queue length ΛGH(y, p) larger than zero only if\nthere is a buyer type x ∈ X that is willing to trade with him. Moreover, he expects the highest queue\nlength for which he can find such a buyer type, which means that he expects buyers to queue up for\nthe job until it is no longer profitable for them to do so. Formally, that means that\nΛGH(y, p) = sup\n{\nλ ∈ R+ : ∃x; q(λ) [f(x, y)− P ] ≥ max\n(y′,p′)∈suppG\nu(x, y′, P ′, G,H)\n}\n(3)\nif that set is non-empty, and ΛGH(y, p) = 0 otherwise. This extension defines the queue length and\nthus the matching frictions and payoffs on the entire domain.7 Here the queue length function ΛGH\nacts similar to Rosen’s (1974) hedonic price schedule in the sense that individuals take this function\nas given, and an equilibrium simply states that all trading decisions according to G and H are indeed\noptimal given the implied queue length.\nDefinition 1 An equilibrium is a pair of trading distributions (G,H) such that:\n(i) Seller Optimality: (y, p) ∈ suppG only if p maximizes (1) for y;\n(ii) Buyer Optimality: (x, y, p) ∈ suppH only if (y, p) maximizes (2) for x.\nAssortative Matching. Our main focus is on the sorting of buyers across sellers. In ex ante terms, an\nallocation is not one-to-one since the ratio of buyers to sellers is in general different from one. Therefore,\nwe define sorting in terms of the distribution of visiting decisions of buyers H. Consider active buyer\ntypes x who choose to be in the market rather than taking their outside option ((x, ∅) \/∈suppH). We say\nthat H entails assortative matching if there exists a strictly monotone function ν that maps these buyer\ntypes into Y such that HXY(x, ν(x)) = B(x) for all active buyer types. This means that ν(x) is the\nseller type with which buyer type x would like to trade. We say that matching is positive assortative if\nν is strictly increasing, and negative assortative if it is strictly decreasing. Since ν is strictly monotone,\nit is uniquely characterized by its inverse µ ≡ ν−1, where µ(y) denotes the buyer type that visits seller\ny. Throughout we will consider this inverse and call it the assignment.\n7For particular micro foundations of the matching function in an economy with one sided heterogeneity, Peters (1991,\n1997, 2000) shows that this specification of the matching frictions in (3) arises out of equilibrium after a deviation by an\nindividual seller.\n9\n3 The Main Results\nIn equilibrium an individual seller of type y takes the trading distributions G and H as given, and\naccording to part (i) of the equilibrium definition his pricing decision solves: maxpm(ΛGH(y, p))p.\nThis seller can set a price that does not attract any buyers (ΛGH(y, p) = 0). Or he can set a price\nthat attracts buyers (ΛGH(y, p) > 0) and we can substitute (3), which holds by assumption outside\nthe support of G and by equilibrium condition (ii) also on the support of G, and the seller’s problem\ntherefore can be written as\nmax\nλ,p\n{\nm(λ)p : λ = sup\n{\nλ′ : ∃x; q(λ′) [f(x, y)− p] ≥ U(x,G,H)}} ,\nwhere we introduced U(x,G,H) ≡ max(y′,p′)∈suppG u(x, y′, p′, G,H) to denote the highest utility that\na buyer of type x can obtain. By equilibrium condition (ii), U(x,G,H) is continuous. Therefore, for\nsellers that trade with positive probability this problem is equivalent to\nmax\nx,λ,p\n{m(λ)p : q(λ) [f(x, y)− p] = U(x,G,H)} . (4)\nThis maximization problem has a natural interpretation that is common to much of the literature on\ncompeting mechanism design. It states that a seller can choose prices and trading probabilities as well\nas the buyer type that he wants to attract, as long as the utility for this buyer is as large as the utility\nthat he can get by trading with other sellers. Note also that (x, y, p) cannot be in the support of the\nbuyers’ equilibrium trading strategy H if there does not exist a λ such that (x, λ, p) solves (4) for y,\nsince the price and associated queue length offered by y will not allow buyer x to obtain his expected\nequilibrium utility U(x,G,H). In what follows and to simplify notation we suppress the dependence of\nthe variables on G and H when there is no danger of confusion.\nWe will now derive a necessary condition for assortative matching. For expositional purposes we\nwill focus on a particular class of equilibria in this derivation that fulfill a number of differentiability\nconditions. Consider a candidate equilibrium (G,H) that is assortative, i.e., it permits a strictly\nmonotone assignment µ(y), and has unique price p(y) offered by seller type y, with both µ(y) and p(y)\ndifferentiable.8 The focus on differentiable equilibrium is just for convenience of exposition in the main\nbody. The formal proofs do not assume differentiability a priori.\n8We require this only for those types that trade with positive probability. A unique price p(y) means that\n(y, p(y)) ∈suppG and (y, p′) \/∈suppG for any other p′ 6= p(y). Finally, we note that µ(y) and p(y) are differentiable\nonly if U(x,G,H) is twice differentiable in x and Λ(y, p(y)) is totally differentiable in y, as shown in (10) and (11) below.\n10\nFor any seller y who trades at an interior queue length we can use the constraint to substitute out\nthe price in (4). Since m(λ) = λq(λ), this yields\nmax\nx,λ\nm(λ)f(x, y)− λU(x). (5)\nAlong the equilibrium path seller y’s assigned buyer type µ (i.e. µ(y)) and his queue length Λ (i.e.\nΛ(y, p(y))) solve this program and are characterized by its first order conditions\nm′(Λ)f(µ, y)− U(µ) = 0 (6)\nm(Λ)fx(µ, y)− ΛU ′(µ) = 0. (7)\nThe first order conditions only characterize an optimal choice if the second order condition is satisfied.\nTo verify the second order condition we derive the Hessian along the equilibrium path:\n m′′(Λ)f(µ, y) m′(Λ)fx(µ, y)− U ′(µ)\nm′(Λ)fx(µ, y)− U ′(µ) m(Λ)fxx(µ, y)− ΛU ′′(µ)\n . (8)\nThe term m′′(Λ)f(µ, y) is strictly negative, and the point (Λ, µ) is a local maximum only if the deter-\nminant of the Hessian is positive:\nm′′(Λ)f(µ, y)\n(\nm(Λ)fxx(µ, y)− ΛU ′′(µ)\n)− (m′(Λ)−m(Λ)\/Λ)2fx(µ, y)2 ≥ 0, (9)\nwhere in the last term of this inequality we have substituted U ′ from (7). Totally differentiating (7)\nwith respect to y and using (7) yields an expression for U ′′(µ):\nU ′′(µ) =\nm(Λ)\nΛ\nfxx(µ, y) +\n1\nΛµ′\n(\n(m′(Λ)−m(Λ)\/Λ)fx(µ, y)dΛ\ndy\n+m(Λ)fxy(µ, y)\n)\n. (10)\nTotally differentiating (6) with respect to y and substituting (7) yields an expression for the change\ndΛ\/dy of the queue length along the equilibrium path:\ndΛ\ndy\n= − 1\nm′′(Λ)f(µ, y)\n[\n(m′(Λ)−m(Λ)\/Λ)fx(µ, y)µ′ +m′(Λ)fy(µ, y)\n]\n. (11)\nSubstituting (10) and (11) into (9) allows us to cancel terms, and after rearranging and multiplying by\n11\nµ′(y)2 we are left with\nµ′(y)\n[\nfxy(µ, y)− m\n′(Λ)(Λm′(Λ)−m(Λ))\nΛm′′(Λ)m(Λ)\nfx(µ, y)fy(µ, y)\nf(µ, y)\n]\n≥ 0. (12)\nTo satisfy the second-order condition, both terms in (12) must have identical signs. Under PAM (µ′ > 0)\nthe term in square brackets has to be positive. Under NAM (µ′ < 0) it has to be negative. Defining\na(λ) as\na(λ) ≡ m\n′(λ) (m′(λ)λ−m(λ))\nλm(λ)m′′(λ)\n, (13)\nthe following Lemma follows immediately.\nLemma 1 In any differentiable equilibrium that satisfies positive assortative matching,\nfxy(µ, y)f(µ, y)\nfy(µ, y)fx(µ, y)\n≥ a(Λ) (14)\nhas to hold along the equilibrium path, with the opposite sign in any differentiable equilibrium with\nnegative assortative matching.\nThis condition is stronger than standard supermodularity, because our assumptions on the search\ntechnology imply that a(λ) ∈ [0, 1] for all λ.9 A related but different condition has been reported in Shi\n(2001) for a specific directed search model. His condition arises as a special case of (14), as we discuss in\nmore detail in Section 6. The benefit of expression (14) is that it provides a clear economic interpretation\nof the trade-offs for sorting in markets in which both search frictions and complementarities in values\nare present.\nThe economic insight of Lemma 1 becomes transparent when we interpret condition (14) in terms of\nthe aggregate search technology M . This aggregate search technology is defined as the total number of\nmatches that arise when β buyers are in a market with σ sellers, i.e., M(β, σ) = σm(β\/σ). Substituting\nfor M in (14) delivers the condition\nMb(Λ, 1)Ms(Λ, 1)\nMbs(Λ, 1)M(Λ, 1)\n· fy(µ, y)fx(µ, y)\nfxy(µ, y)f(µ, y)\n≤ 1. (15)\nThe left hand side of this condition can be separated into two components that measure the degree of\n9One can rewrite (13) as a(λ) = m′(λ)q′(λ)\/(m′′(λ)q(λ)), and our assumptions on the search technology immediately\nyield a(λ) > 0 for all λ ∈ (0,∞). Further, some straightforward algebra shows that a strictly decreasing elasticity of m\nimplies that a(λ) < 1 for all λ ∈ (0,∞). More details are presented in the published working paper version. All results in\nthis paper would obtain even without the standard assumption that the elasticity of m is decreasing, only that the right\nhand side of condition (14) might be larger than 1, which requires stronger supermodularity conditions.\n12\ncomplementarity (substitutability). It is the product of the elasticity of substitution of the aggregate\nsearch technology M denoted by ESM and, when f is constant returns, the elasticity of substitution of\nthe match-value function f denoted by ESf (see Hicks (1932)).10 The condition highlights the nature\nof the trade-off between match-value and trading security. In order to obtain PAM, the inverse of the\nelasticity of substitution of the surplus function ESf must exceed the elasticity of substitution of the\nsearch technology ESM : ES−1f ≥ ESM .\nIf different markets are very substitutable (high ESM ), then x and y have to be strong comple-\nments (high fxy and therefore low ESf ). The latter corresponds to the gain in match-value due to\ncomplementarity and reflects the marginal increase in output from increasing both types. That degree\nof complementarity must offset the opportunity cost induced by not trading, i.e., the trading security\naspect mentioned in the introduction. It consists of the marginal loss of value from increasing the ratio\nof buyers to sellers. Only when the match-value motive outweighs the costs induced by the trading\nsecurity motive does positive assortative matching arise. For aggregate search technologies with a con-\nstant elasticity of substitution, the right-hand side of (14) is constant and determines the degree of\nsupermodularity required of f . In general, the supremum and infimum of that elasticity become of\nimportance. Let a = sup a(λ); a = inf a(λ). Both lie in [0, 1]. We will discuss some specific search\ntechnologies in depth in the next section, after presenting the main results on sorting.\nTo state our main result, we first introduce a notion of the degree of supermodularity. Clearly,\nfor condition (14) to hold it does not suffice that function f is simply supermodular. For any two\nbuyer and seller types x2 > x1 and y2 > y1, supermodularity means that the total value when the high\ntypes trade and when the low types trade is higher than when there is cross-trade (low with high and\nvice-versa): f(x2, y2) + f(x1, y1) ≥ f(x2, y1) + f(x1, y2). This also means that the extreme values (very\nhigh f and very low f) on the left side of the inequality are jointly higher than the intermediate values\non the right. The equivalent condition when f(x, y) is differentiable is that the cross-partial is positive:\nfxy(x, y) > 0. Such a condition only includes the gains if agents trade, but in our setting we also need\nto consider the losses if agents do not trade. These losses especially affect the high types and gives\nthem extra incentives to insure trade by attracting (many) low types. We therefore need a stronger\ncondition for positive sorting, and the idea that assortative matching becomes harder can be captured\nby strengthening the supermodularity condition as follows. Let g be a concave function and require\nthat g◦f is supermodular, i.e., g◦f(x2, y2)+g◦f(x1, y1) ≥ g◦f(x2, y1)+g◦f(x1, y2). Concavity affects\n10We are grateful to John Kennan for pointing out to us that a(λ) is equal to the elasticity of substitution of the\naggregate search technology ESM .\n13\nextreme values on the left of the inequality more than intermediate values on the right, which makes\nthis condition of assortative matching more difficult to fulfill. This is easiest to see in the differential\nversion of this inequality: ∂2g(f(x, y))\/∂x∂y ≥ 0, or equivalently\nfxy(x, y)f(x, y)\nfx(x, y)fy(x, y)\n≥ −g\n′′(f(x, y))f(x, y)\ng′(f(x, y))\n. (16)\nExactly how much more difficult it is to sustain this inequality is captured by the (relative) Arrow-Pratt\nmeasure of the transform g on the right hand side of (16). For example, this measure is zero if g is a\nlinear transformation, and it is 1 if it is a log-transformation. Compare this inequality with (14). By\nvirtue of the sup (or inf) of a, the right hand side of (14) is a constant in the unit interval. A constant\nright hand side of (16) with similar magnitude is exactly induced by the transformation g(f) = n\n√\nf .\nWe say that function f is n-root-supermodular with coefficient n ∈ (1,∞) if n√f is supermodular. By\n(16), this requires that the cross-partial derivative of f is sufficiently large, i.e., fxy(x,y)f(x,y)fx(x,y)fy(x,y) ≥ 1−n−1.\nThis captures standard supermodularity when n = 1 and approaches log-supermodularity as n → ∞.\nWe can now state the main result:\nTheorem 1 For any type distributions B and S any equilibrium is\n(i) positive assorted if and only if function f is n-root-supermodular, where n = (1− a)−1\n(ii) negative assorted if and only if function f is nowhere n-root-supermodular, where n = (1−a)−1.\nProof. See Appendix.\nThe proof focusses on positive assortative matching and consists of two parts. First, we show that\n(strict) n-root-supermodularity implies positive assortative matching. Since we want to rule out other\nequilibria that might be non-assortative, we cannot work with a monotone differentiable assignment\nµ, and therefore deploy a different proof technique than in the derivation of condition (14). Second,\nwe show that positive assortative matching for all type distributions implies that f has to be (weakly)\nn−root-supermodular. Here the proof works by contradiction: If f is not n-root-supermodular at\nsome point (x, y) in the domain, then we can construct a type distribution such that types in the\nneighborhood of (x, y) trade at a queue length λ with a(λ) close enough to a, and therefore larger than\nthe degree of root-supermodularity of f . This directly contradicts the condition for PAM in Lemma\n1 for differentiable equilibria, and a similar contradiction can be derived for non-differential equilibria.\nKey here is that the result holds for all distributions. For a particular type distribution, PAM may arise\n14\nwith less complementarities, because the value of a might not be attained in equilibrium. The proofs\nin the case of negative assortative matching are completely analogous and are omitted for brevity.\nThe theorem establishes a dividing range between positive and negative sorting. This dividing range\ncollapses to a line when a = a (see also Section 4 where we discuss constant elasticity of substitution\nmatching technologies). Such a sharp cut-off is also a feature of Becker’s (1973) frictionless theory, but\nour cut-off is shifted towards larger complementarities. In our environment the fact that low types are\nvaluable because they can help facilitate trade for the high types has the novel implication that under\na > 0, for all type distributions NAM obtains even if f is strictly supermodular as long as it is nowhere\nn−root-supermodular (n = (1 − a)−1). On the other hand, if a < a then the areas of positive and\nnegative sorting are not as sharply divided. This is the case specifically for those search technologies\nsuch as urn-ball technology that have a = 0. Still, any f that is weakly submodular (fxy ≤ 0) induces\nNAM.11\nThe conditions in Theorem 1 are particularly strong in order to ensure sorting under any possible\ntype distribution. This gives us useful bounds, but these bounds might not be necessary for given\ntype distributions. If the elasticity of substitution is not constant, it may be the case that neither\nthe supremum a nor the infimum a are reached on the equilibrium path. This explains the weaker\nnotion in an example in Shi (2001) who considers the urn-ball search technology and a given seller type\ndistribution. His example 5.2 has negative sorting despite fxy > 0 and a = 0. We formalize this in the\nnext Proposition.\nProposition 1 Consider a search technology such that a(·) is not constant:\n(i) There exist distributions B and S and functions f that are nowhere n−root-supermodular\n(n = (1− a)−1) such that any equilibrium exhibits positive assortative matching.\n(ii) There exist distributions B and S and strictly n−root-supermodular (n = (1− a)−1) functions\nf such that any equilibrium exhibits negative assortative matching.\nProof. See Appendix.\nFinally, we establish existence of a (differentiable) equilibrium. Existence in our setup is more\ncomplicated than in frictionless matching models because we cannot employ the standard measure-\n11In general negative assortative matching has to arise under the strict inequality fxy < afxfxf\n−1. The case of a = 0\nis special because negative assortative matching is ensured even when fxy = 0, since in this case our assumptions on the\nsearch technology still imply a(λ) > 0 whenever λ ∈ (0,∞). Therefore, for all types that trade with positive probability\n(λ 6= 0,∞) the elasticity is strictly positive and the proof technique immediately extends to this case.\n15\nconsistency condition. In our setup, it is possible that more agents from one side attempt to trade with\nthe other, and this imbalance is absorbed through different trading probabilities.12 The system retains\ntractability when we impose the sufficient conditions for assortative matching (either PAM or NAM),\nin which case we can exploit differential equation (11) to construct the equilibrium path along the first\norder condition, and use the sufficient conditions to show that deviations are not profitable.\nProposition 2 If the function f satisfies n−root-supermodularity for n = (1−a)−1 (or nowhere n-root-\nsupermodularity for n = (1−a)−1), then for any type distributions B and S there exists a differentiable\nequilibrium.\nProof. See Appendix.\n4 Characterization\nIn this section we discuss the characterization of the equilibrium. We consider two particular classes of\ncommonly used search technologies that allow particularly sharp bounds on the degree of supermodu-\nlarity, those that are bounded and imply square-root-supermodularity and those that have a constant\nelasticity of substitution. We then investigate the properties of the equilibrium price schedule.\n4.1 Common Search Technologies\nSquare-Root-Supermodularity is the property that applies to a large class of search technologies,\nincluding those that are built on micro-foundations, such as the example search technologies m1, m2 and\nm3 outlined above. The class is characterized by technologies with local bounds on the derivatives and\nenough curvature. To lay this out formally, it will be convenient to consider the matching probability\nq(λ) of the buyers, which is linked to the matching probability of the sellers via m(λ) = λq(λ).\nProposition 3 (Square-Root-Supermodularity) Let |q′(0)| > 0 and |q′′(0)| <∞, and let 1\/q be convex.\nFor any type distributions B and S any equilibrium exhibits PAM if and only if f(x, y) is square-root-\nsupermodular.\n12In frictionless one-to-one matching models with a continuum of agents existence can be proven by considering the\nefficient allocation, which can be characterized by a linear program that has existence proofs since Kantorovich (1942). The\nefficient allocation in our setting resembles Kantorovich’s optimal transportation problem, with the one major difference\nthat it is not a linear program since the buyer-seller-ratio enters the objective (see (18)). Interpretation of a submarket\nas a coalition of many buyers and sellers in the spirit of the many-to-many matching literature still does not allow us\nto adopt existence proofs from this literature, since the proofs we are aware of rely on finite coalitions of bounded size,\nwhereas in our setting submarket with uncountably many buyer and seller arise.\n16\nProof. See Appendix.\nUnderstanding what drives the sorting pattern is motivated by the relation between the complemen-\ntarities in match-value and the elasticity of substitution of the search technology. It is then somewhat\nstriking that in such a large class of search technologies – arguably the most relevant ones – all depend\nexactly on that same condition, square-root supermodularity. The explanation for this is entirely driven\nby the value of the elasticity of substitution at zero. The bounds on the derivatives imply that it is\nnecessarily pinned down at one half, which turns out to be a general property of homothetic functions as\ncan be seen in the proof. This makes square-root-supermodularity necessary. The curvature restriction\nis equivalent to the requirement that the elasticity of substitution does not exceed one half at some\npoint other than zero, and therefore square-root-supermodularity is sufficient.\nConstant Elasticity of Substitution (CES) matching technologies are often assumed for their\nsimplicity. Since the elasticity of substitution is invariant, they can be represented by m(λ) = (1 +\nkλ−r)−1\/r where r > 0 and k > 1. The associated aggregate CES search technology for a given number\nof buyers and sellers β and σ is defined as (see amongst others Menzio (2007)):\nM(β, σ) = (βr + kσr)−1\/rβσ.\nThe elasticity of substitution is given by ES = (1 + r)−1. The CES matching technologies do not fall\ninto the previous category because either the bounds at zero are violated or the curvature restriction\ndoes not hold. The exception is the knife-edge case with r = 1 that corresponds to (a variation of) the\nmatching technology m3 = λ\/(λ+ k) that is CES.\nThe CES search technology nonetheless gives very sharp predictions on the necessary and suffi-\ncient conditions for Positive and Negative Assortative Matching: PAM arises when f(x, y) is n-root-\nsupermodular and NAM arises when f(x, y) is nowhere n-root-supermodular, where n = (1 + r)\/r\nis the same in both cases. It is important to stress here that n-root-supermodularity is a necessary\ncondition for positive assortative matching even if we consider only a particular type distribution. This\nis stronger than our Theorem 1, and arises exactly because the elasticity is constant and we do not\nhave to worry whether the supremum is actually realized on the path of play. Moreover, since Theorem\n1 ensures NAM for any given distribution, it also provides direct evidence that NAM will arise for any\ntype distributions even if the match-value function is (moderately) supermodular since the elasticity of\nsubstitution is bounded away from zero. The class of CES search technologies spans the entire range of\n17\nn-root-supermodularity, from supermodularity to log-supermodularity, as stated in the next corollary\nto Theorem 1:\nCorollary 1 Let the search technology be CES with elasticity ES. Then a necessary and sufficient\ncondition for PAM is:\n(i) Supermodularity if ES ' 0 (Leontief);\n(ii) Square-Root-Supermodularity if ES = 12 (m3);\n(iii) Log-Supermodularity if ES ' 1 (Cobb-Douglas).\n4.2 The Equilibrium Price Schedule\nOur results are cast in terms of the monotonicity of the allocation, offering sharp predictions on assor-\ntative matching. In contrast, equilibrium does not provide equally general predictions in terms of the\nmonotonicity of the price schedule. Equilibrium prices can be both increasing and decreasing in type\nbecause agents are compensated through both prices and trading probabilities. This is not the case\nin the frictionless model of Becker (1973). There, p′(y) = fy > 0, i.e., the slope of the price schedule\nis equal to the marginal product of being matched with a better seller. For our setting we derive the\nequilibrium price schedule in the appendix. It satisfies\np′(y) = fy + a[(1− ηm)fxµ′ − ηmfy], (17)\nwhere ηm = λm′\/m is the elasticity of m, a is the elasticity of substitution, and µ′ is the change of\ntrading partner along a differentiable equilibrium. This price schedule decentralizes the efficient allo-\ncation (Proposition 4 below). It reflects the marginal benefit conditional on matching, but additionally\nreflects the marginal benefit from the change in the probability of a match. In this world with trading\nfrictions, sellers can be rewarded through higher prices or better trading probabilities. Higher seller\ntypes obviously have to make higher equilibrium profits, yet this increase may be due more to the\nsecond source than to the first and equilibrium prices can actually be declining. For this to happen the\ntrading probabilities have to rise substantially, though, which is only possible under negative assortative\nmatching.\nInspection of equation (17) immediately reveals that under PAM (with µ′ > 0) the price schedule\nis increasing in firm type. The effect introduced by the search frictions can never be so strong that\nprices actually decrease: both a and ηm are in [0, 1], and as a result the aggregate sign on the fy term\nas determined by (1 − aηm) is positive. This is not necessarily true under NAM where µ′ < 0. Prices\n18\ncan then be decreasing, e.g., consider some fixed type distributions and fy sufficiently small. Then\nsellers must make nearly identical profits. If buyer types remain important (fx >> 0), high buyer\ntypes obtain substantially higher equilibrium utility than low buyer types. Therefore, in equilibrium\nlow seller types leave high utility to their (high types) customers, and obtain low queue length since\ndΛ\/dy in equation (11) is positive under NAM. To make nearly equal profits according to (4) the low\nseller types have to charge a higher price in equilibrium. Since the price change (17) does not depend\ndirectly on the cross-partial, particularly simple examples of this phenomenon can be constructed with\na-modular match-values (fxy = 0).\nFinally, it is instructive to consider the price function in a symmetric world. Suppose there is\nsymmetry between buyers and sellers in the match-value function f(x, y) and in the aggregate search\ntechnology M(β, σ), and the type distributions are identical for buyers and sellers. Then it is straight-\nforward to show that under root-supermodularity and therefore PAM a “symmetric” equilibrium exists\nwith µ(y) = x and a constant queue length λ = 1 along the equilibrium path. Since symmetry of M\nimplies that ηm = 1\/2, the pricing function reduces exactly to the marginal value of Becker (1973), i.e.,\np′ = fy. This highlights the fact that the effect on prices due to search frictions is only prevalent in the\npresence of asymmetries. In a positively assorted equilibrium, under symmetry the effects of frictions\nexactly cancel out.\n5 Efficiency of the Decentralized Allocation\nConsider a planner who chooses trading distributions (G,H) to maximize the surplus in the economy,\nsubject to the same search technology. The planner maximizes\nmax\nG,H\n∫\nq(ΛGH(y, p))f(x, y)dH (18)\ns.t. GY = S ; HX = B ; ΛGH = dHYP\/dG, (19)\nwhere the constraints correspond to the restrictions in the decentralized economy. Prices simply con-\nstitute transfers between agents, and therefore they do not enter the planner’s objective directly. They\ndo allow the planner to let identical sellers trade at different queue lengths Λ(y, p) and Λ(y, p′) with\npotentially different buyers, which is also possible in the decentralized economy. Since in the planner’s\nproblem prices play no direct role, we could as well have indexed the queue length by some other label\nsuch as a “location” instead of prices.\n19\nProposition 4 If f is strictly n-root-supermodular with n = (1− a¯)−1 (nowhere n−root-supermodular\nwith n = (1− a)−1) then any solution to the planner’s problem is positive (negative) assorted and can\nbe decentralized as an equilibrium.\nProof. See Appendix.\nThis result is in line with the efficiency properties of directed search models in general, see e.g.,\nMoen (1997), Acemoglu and Shimer (1999b), and Shi (2001). It is worth highlighting this efficiency\nproperty, because it allows us to interpret our sorting condition from an efficiency point of view.\nOur result provides a condition that augments the standard Hosios (1990) condition for efficiency\nby relating different submarkets. The Hosios (1990) condition holds for a particular (x, y) market and\nequates the social contribution to match formation with the split of the surplus between buyer and\nseller. In our decentralized equilibrium, substituting (6) into (5) yields the Hosios condition, which\ncan be rewritten to say that seller y’s equilibrium profits are Ms(Λ, 1)f(x, y) and reflect his marginal\ncontribution to match creation. With two-sided heterogeneity, the issue of efficiency hinges on which\n(x, y) combinations trade in equilibrium. Our contribution is to show that this is governed not by the\nderivative of the aggregate matching technology M , but by its elasticity of substitution a(λ).\nThe Hosios condition is usually associated with the elasticity ηm of the individual search technology\nm since Ms = 1−ηm. A similar connection exists in our setting between the elasticity of substitution of\nM , denoted by a, and the elasticity ηm of the individual matching technology m. To see this, observe\nthat\na(λ) ≡ m\n′(λ) (m′(λ)λ−m(λ))\nλm(λ)m′′(λ)\n=\n1− ηm(λ)\nηm′(λ)\n. (20)\nThe first equality is the condition we derived above in equation (13). The second equality follows\nimmediately after rearranging terms, where η denotes the elasticity of the subscripted function: ηm =\nλm′\nm and ηm′ =\nλm′′\nm′ . As with the Hosios condition, the condition here depends on the elasticity via\n1 − ηm, which captures the marginal effect on the search technology. In addition it depends on ηm′\nwhich captures the second degree marginal effect on the search technology. This effect governs how the\nmatching probability changes as we move across different matched pairs. The latter effect is obviously\nabsent with homogeneous types, and therefore in the standard Hosios condition.\n6 Discussion of Related Literature\nWe relate our findings to models and results from three distinct literatures.\n20\n6.1 Directed Search\nThere is an extensive literature on directed search with and without two-sided heterogeneity. Contri-\nbutions range from work that provides a rationale for unemployment in the labor market and waiting\ntimes in the product market (for example Peters (1991, 1997b, 2000, 2007), Acemoglu and Shimer\n(1999a,b), Burdett, Shi and Wright (2001), Shi (2001), Mortensen and Wright (2002), Galenianos and\nKircher (2006), Kircher (2009), Delacroix and Shi (2006)), to work that models more elaborate trad-\ning mechanisms (such as McAfee (1993), Peters (1997a), Shi (2002), Shimer (2005) and Eeckhout and\nKircher (2008)).\nHere we focus our attention on specific aspects of the most closely related paper by Shi (2001). Shi\nis the first to show that, in an environment with directed search, supermodularity is not sufficient to\nattain PAM. He assumes that firms can freely enter with type y if they pay some entry cost C(y). He\nderives a condition requiring fxy to be sufficiently large that is seemingly different from ours. Here we\nshow that our findings are consistent. His condition is:\nffxy\nfxfy\n>\nCfy(fy − Cy)\nCy(fCy − Cfy) . (21)\nThe strength of this condition, i.e., the magnitude of the right hand side, cannot readily be evaluated.\nMoreover, this condition seems not to depend on the search technology m, which is in apparent con-\ntradiction with our results. Our results imply that sorting depends on the elasticity of substitution of\nthe search technology. It turns out, even though it is not directly visible, that condition (21) depends\ncrucially on the feature of the urn-ball search technology assumed in Shi (2001). In particular, the RHS\nwill look different when the search technology is not urn-ball. A simple example is the case of CES\nwhere the RHS is a constant.\nRecall that our condition (14) gives a condition for PAM for a given type distribution. To see that\ncondition (21) arises as a special case of this, we now derive the equilibrium conditions in Shi (2001)\nfor a general search technology. Shi considers a model where the seller type distribution arises from a\nfree entry consideration. Sellers can decide to enter with type y when paying the entry cost C(y), then\ntrade occurs as in our model (even though his off-equilibrium specification is different). Equilibrium\nprofits can be obtained by substituting (6) into (5). If after entry seller type y trades with buyer type\nµ(y) at queue length Λ(y) (more precisely: Λ(y, p(y))), the free entry condition requires\n[m(Λ(y))− Λ(y)m′(Λ(y))]f(µ(y), y) = C(y). (22)\n21\nDifferentiating (22), we obtain after eliminating terms that add to zero by (7), and using the derivative\nof (6), that m(Λ(y))fy(µ(y), y) = Cy(y). For the special case of the urn-ball search technology m1\nthese two equations coincide with Shi’s (2001) characteristic equations. We can invert these to obtain\nan analytic expression of Λ(y) as a function of the entry cost, and substitution into the RHS of (14)\nrecovers Shi’s (2001) result.13 Still the right hand side of (14) depends crucially on the elasticity of\nsubstitution for the specific search technology in question, as can easily be seen when the RHS of (14)\nis constant and therefore the level of entry plays no role. For urn-ball the elasticity of substitution is\nnon-constant and does indirectly depend on the entry cost. By varying the entry cost, any type seller\ntype distribution can be sustained (by setting the entry cost equal to the equilibrium profits) and by\nProposition 3 square-root-supermodularity provides the relevant bound on the strength of (21).\nIn our setting, entry does not simplify the analysis because inverting the free entry conditions\nyields Λ(y) as a function of the inverse of the search technology, which for general search technologies\ndoes not have a nice analytic representation. Our approach therefore relies directly on the second order\nconditions of the seller’s optimization problem (4). Using a general search technology allows us to derive\nthe fundamental economic trade-off between complementarities in match-value and complementarities\nin the search technology, and to obtain explicit bounds on the strength of supermodularity that hold\nfor any type distribution.\n6.2 Random Search\nIn the introduction we compared our root-supermodularity condition to the conditions in the random\nsearch model of Shimer and Smith (2000). It is worth noting first that random search models adopt a\nnotion of positive assortative matching that differs from the notion in this paper and in the frictionless\nenvironment of Becker (1973). In random search sellers meet many different buyer types, and the\nprobability of meeting any particular buyer type is zero. Therefore, they are willing to accept matches\nfrom some set of types. For a given seller, the set of buyers for which matching is mutually agreeable is\nthen called the matching set. Positive assortative matching means that any element in the acceptance\nset of a lower types is either included or strictly below any element in the acceptance set of a higher\ntype.\n13For m1(λ) = 1−e−λ we obtain a nice analytic expression for the elasticity of substitution: a(Λ) = λ−1 +e−λ\/(1−e−λ).\nThere is a multitude of ways to use the entry cost to substitute out the queue length along the equilibrium path. Observe\nthat m1(Λ(y))fy(µ(y), y) = Cy(y) implies Λ(y) = − ln(1−Cy(y)\/fy(µ(y), y)). Using this, one could write the elasticity of\nsubstitution and thus the RHS of (21) as a(Λ(y)) = − ln(1− Cy(y)\/fy(µ(y), y))−1 + 1− fy(µ(y), y)\/Cy(y). Alternatively,\none can use both entry conditions to express the elasticity of substitution as a(Λ(y)) =\nC(y)fy(µ(y),y)[fy(µ(y),y)−Cy(y)]\nCy(y)[f(µ(y),y)Cy(y)−C(y)fy(µ(y),y)]\n,\nwhich exactly recovers the RHS of (21).\n22\nThe conditions in Shimer and Smith (2000) derive their economic meaning from the fact that\nthey ensure connectedness of these matching sets. The exact conditions are: supermodularity of f,\nlog-supermodularity of fx and fy, and log-supermodularity of fxy. Unlike our match-value function,\ntheirs is a symmetric function f such that f (x, y) = f(y, x). They also assume that f ≥ 0 and\nfy(0, y) ≤ 0 ≤ fy(1, y) for all y. These do not directly include log-supermodularity of f , which we used\nas a lower bound to compare the strength of our condition to theirs. We will now show that this is\nimplied under the additional monotonicity restriction imposed in our model, i.e., that fx(x, y) ≥ 0 (and\nby symmetry fy(x, y) ≥ 0).\nAssume that the conditions of the previous paragraph hold. A function f is log-supermodular if\nlog f is supermodular, or equivalently if for all (x, y) the following condition holds (where we suppress\nthe arguments): fxyf − fxfy ≥ 0. Obviously this condition holds whenever fx = 0 because of super-\nmodularity (fxy ≥ 0) and f ≥ 0. Now we establish that it holds even at points with fx > 0. First,\nobserve that log-supermodularity trivially holds at (0, 0) under the assumptions above. Then it is suffi-\ncient to show that at any (x, y) at which log-supermodularity holds, the left hand side of the condition\nincreases in x. The argument applies symmetrically for increases in y, which establishes the result that\nlog-supermodularity holds at all (x, y). The left hand side of the log-supermodularity condition increases\nin x if\nfx2yf + fxyfx − fx2fy − fxfxy ≥ 0. (23)\nLog-supermodularity of fx was assumed, which implies fx2yfx − fx2fxy ≥ 0. We can now from\nthis inequality substitute for fx2y in (23), and also substitute for fxy from the inequality of the log-\nsupermodularity condition to get the more demanding inequality fx2fy + fxyfx − fx2fy − fxfxy ≥ 0,\nwhich holds trivially.\nWe have therefore established that the conditions in Shimer and Smith (2000) together with mono-\ntonicity imply log-supermodularity. While the reverse is not true (not every log-supermodular function\nfulfills the conditions in Shimer and Smith (2000) – not all log-supermodular functions also have first\nand cross-partial derivatives that are log-supermodular), at least this result gives us a useful lower bound\nfor the strength of supermodularity required under random search that can be used for comparison with\nour setting.\n23\nm(λ; δn)\nλ1\n1\nm(λ)\nδn → 1\nFigure 1: Vanishing Frictions for the Static search technology\n6.3 Vanishing Frictions and Convergence to the Walrasian Equilibrium\nThe competitive benchmark of the Walrasian economy (Becker 1973, Rosen 1974) induces positive\nsorting under mere supermodularity. There are no frictions in a competitive setting. Such a lack of\nfrictions can in our setup be captured by assuming that agents can perfectly match into pairs. This\nleads to a benchmark search technology represented by mB(λ) = min{λ, 1} (see the kinked, solid line\nm(λ) in Figure 1). The short side of the market always matches with probability one while those types\non the long side get rationed in proportion to the buyer-seller ratio. We can now consider vanishing\nfrictions a sequence of matching functions that converges to mB and investigate whether the condition\nfor sorting reduces to mere supermodularity as required in the Walrasian Benchmark.\nThis approach of considering the limit economy as frictions vanish ties in with the large literature\nthat validates Walrasian trade as the limit of matching and bargaining games (see amongst many others\nRubinstein and Wolinsky (1985), Gale (1986) and recently Lauermann (2007)). This literature generally\nstudies dynamic games and shows convergence as trading becomes more frequent. While this approach\ncan be replicated with similar success in a dynamic extension of our setting,14 our contribution here is\nto take a different perspective by modeling vanishing frictions directly through changes in the search\ntechnology.\nWe obtain immediately an apparent discrepancy between the idea of convergence to Becker’s (1973)\nsupermodularity condition and the n-root-supermodularity condition as implied by Theorem 1. For\nexample, the class of logarithmic search technologies m(λ) = 1−ln(1+e(1−λ)\/(1−δ))\/ ln(1+e1\/(1−δ)) with\nδ ∈ (0, 1) fulfills the premise of Proposition 3 and therefore requires square-root-supermodularity for\n14The working paper version of this paper includes the fully dynamic extension of the model, including results on the\nconvergence of our condition. We further discuss the dynamic model in the conclusion.\n24\nany level of δ to induce assortative matching. Yet it converges uniformly to the competitive benchmark\nmB(λ) as δ → 1, where we would expect the weaker condition of supermodularity (Becker 1973) to\napply.\nTo resolve this apparent discrepancy, observe that our condition for sorting entails the elasticity of\nsubstitution a(λ, δ) that depends on the search technology through the parameter δ.15 While m→ mB\nuniformly as δ → 1, the elasticity of substitution does not converge to zero uniformly. In particular, in\nmarkets with few buyers the elasticity of substitution remains close to one half. With vanishing frictions\nthe strength of the square-root-supermodularity condition comes only from the submarkets with few\nbuyers (λ ≈ 0), i.e., when at least some sellers match with very low probabilities due for example to an\naggregate imbalance where the overall mass of sellers exceeds the mass of buyers. If this is not the case,\ni.e., if all sellers can trade with probability bounded away from zero along a sequence of δ’s such that\nm→ mB, then the standard supermodularity condition emerges: some tedious application of l’Hoˆpital’s\nrule reveals that limδ→1 a(λ, δ) = 0 for all λ > 0. More generally this means that the set of seller types\nthat trade with positive probability but for whom Becker’s condition does not (approximately) govern\nthe matching pattern includes only those sellers with queue length around zero (i.e., those that can\nhardly trade) as frictions vanish. Becker’s (1973) insight is therefore recovered for vanishing frictions\nas it applies to all types that have non-vanishing trading prospects.\nA special case is that of the CES search technology, because the only way to get convergence to\nmB is by changing the elasticity of substitution a→ 0. By construction there is then not only uniform\nconvergence of m, but also uniform convergence of a, and as a result, the necessary and sufficient\ncondition for PAM converges to mere supermodularity for all matched pairs.\nConclusion\nIn the presence of search frictions in a market with two-sided matching, price competition gives rise to\ntwo distinct and opposing forces that determine sorting. The degree of complementarity in the match-\nvalue is a force towards positive assortative matching, whereas search frictions embody a force towards\nnegative assortative matching. We have identify a condition based on the elasticities of substitution\nof the match-value function and that of the search technology that summarizes this tradeoff. It tells\nus exactly how much additional complementarity above and beyond mere supermodularity – namely\nroot-supermodularity – is needed in terms of the match-value to induce positive sorting, where the\n15Some algebra establishes that a(Λ, δ) =\n“\n1 + e\n1−Λ\n1−δ\n”\n1−δ\nΛ\n− e\n1−Λ\n1−δ\n“\nln(1 + e\n1\n1−δ )− ln(1 + e 1−Λ1−δ )\n”−1\n.\n25\nexact root depends on the elasticity of substitution in the search technology.\nThis elasticity condition also augments the standard Hosios (1990) condition for efficiency by relating\ndifferent submarkets. In addition to the split of the surplus for a given pair of buyer-seller types as\nanalyzed by Hosios, the novel determinant of efficiency here is which types are matched in equilibrium.\nThen not only the derivative of the aggregate search technology is important (as in Hosios), but also\nthe elasticity of substitution across different pairs.\nIn this work we have made various simplifying assumptions. Some of them we have relaxed in the\nworking paper version of this paper: If seller preferences depend on the price and additionally their\nown type – e.g., due to opportunity costs that depend on the seller’s own type – our results still obtain,\nonly now the match-value is the sum of the buyer’s and the seller’s valuation: If the sellers preferences\nare of the form fs(y) + p, then our conditions on the match-value function refer to f(x, y) + fs(y). Our\nresults further generalize if sellers also care about the buyer’s type, provided they are able to specify\nthe desired buyer type together with the price in order to avoid the lemon’s problem. Alternatively, our\nresults apply if the seller posts a payoff he wants to obtain (rather than a price) which makes the buyer\nthe residual claimant. In addition to the preferences, we also relax the time structure. We consider\nsteady-states in a repeated interaction, and show that n−root-supermodularity still ensures positive\nassortative matching. The condition of n-root-supermodularity (n = 1− a¯−1) is still sufficient, though\na weaker root depending on the discount factor may also suffice.16\nWe conclude with a final thought on the connection to many-to-many matching markets, for which\nthe literature yet lacks a characterization of the sorting patterns. While our setup requires each seller\nto trade a single unit with at most one buyer, it does resemble a particular kind of two-sided many-\nto-many matching market. When β buyers of type x and σ sellers of type y form a coalition, they\nproduce output M(β, σ)f(x, y). Instead of buyers and sellers, the sides can be interpreted as teachers\nand students where a coalition is a school, or machines and workers where a coalition is a factory. Given\nthe similarity in structure, we expect our results to apply to this setting as well.\n16For the search technologies in Proposition 3, square-root-supermodularity remains necessary while for CES matching\ntechnologies weaker conditions apply that depend on the discount factor. Note that these results assume existence of a\nsteady-state, which can be assured under a “cloning” assumption that we make in the working paper.\n26\n7 Appendix\nProof of Theorem 1\nWe prove the result for case 1., positive assortative matching. An analogous derivation establishes the\nresult for negative assortative matching. The proof for PAM consists of two parts, one for the sufficient\ncondition, and one for the necessary condition.\nProposition A1. (Sufficiency) If the function f(x, y) is strictly n-root-supermodular where n = (1 −\na)−1 then any equilibrium entails positive assortative matching under any type distributions B(x), S(y).\nProof. By contradiction. Consider a (candidate) equilibrium (G,H) that does not entail positive\nassortative matching. Then there exist (x, y, p) and (x′, y′, p′) on the support of H such that x > x′ but\ny < y′. Then x has to be part of the solution to the seller’s optimization problem (4) for y, and x′ has\nto be part of the solution to (4) for y′, given U(·, G,H). We will contradict this in four steps.\n1. Reformulating the sellers’ maximization problem\nThe optimization problem (4) of seller y can be written as\nmax\nx,λ,p\n{m(λ)p : q(λ) [f(x, y)− p] = U(x,G,H)}\n⇔ max\nx,λ\n{m(λ)f(x, y)− λU(x,G,H)}\n⇔ max\nx\nΠ(x, y|U(·, G,H)), (24)\nwhere Π in the last line is defined as\nΠ(x, y|V (·)) ≡ max\nλ\nm(λ)f(x, y)− λV (x) (25)\nfor any positive and continuous function V (·). The following obvious property will be useful later on:\n(I) For any two positive and continuous functions V (·) and W (·) and any seller type x, the inequality\nΠ(x, y|V (·)) < Π(x, y|W (·)) holds if and only if V (x) > W (x). We have achieved the desired contradic-\ntion if the maximizer of (24) for y is smaller than for y′. Defining Γ(y|V (·)) = arg maxx Π(x, y|V (·)),\nthis means that we have achieved the contradiction if\nmax Γ(y|U(·, G,H)) ≤ min Γ(y′|U(·, G,H)). (26)\n2. Introducing differentiability through auxiliary buyer utility V(·)\nTo show (26), it will convenient to have Π differentiable. To achieve this, we will not directly work with\nbuyers’ equilibrium utility U(·, G,H), but rather we will work with a particular auxiliary function V (·)\nthat we define implicitly as follows:\nΠ(x, y|V (·)) = Π(κ, y|U(·, G,H)) (27)\nfor all x ≤ κ ≡ max Γ(y|U(·, G,H)); and V (x) = U(x,G,H) otherwise. This means the following: If\nseller y has to leave utility V (x) to the buyers, he is indifferent between all types that are below κ, i.e.\nΓ(y|V ) = [x,κ]. Equation (27) defines V (x) uniquely by property (I) established in the previous step.\nNote that V (x) is differentiable by construction since the implicit function theorem delivers\nV ′ =\nm(λ)\nλ\nfx(x, y)\n27\nwhere λ takes the value that maximizes the right hand side of (25). Since κ is a maximizer of\nΠ(x, y|U(·, G,H)) property (I) also establishes: (II) V (x) ≤ U(x,G,H) everywhere.\n3. Positive cross-partials\nNow consider seller y′ > y in a neighborhood of y. Taking the cross-partial of Π(x, y′|V ), and incor-\nporating that V is defined by (27) together with (25), we obtain after some tedious algebra for all\nx ∈ [x,κ] that\n∂Π(x, y′|V )\n∂x∂y′\n|y′=y =\n[\nfxy(x, y)− m\n′(λ)(λm′(λ)−m(λ))\nλm′′(λ)m(λ)\nfx(x, y)fy(x, y)\nf(x, y)\n]\nm(λ), (28)\nwhen λ takes the value that maximizes the right hand side of (25). This cross-partial evaluated at\ny′ = y is strictly positive since the RHS of (28) is strictly positive by strict n-root-supermodularity of\nf . Hence for y′ slightly larger than y the cross-partial remains strictly positive by continuity. On [x,κ]\nwe have Π(x, y|V ) = Π(x′, y|V ) by construction, and therefore Π(x, y′|V ) < Π(x′, y′|V ) when x < x′.\nTherefore, any x that maximizes Π has to lie above κ, and we obtain: (III) min Γ(y′|V ) ≥ κ.\n4. Reintroducing U(·,G,H) instead of the auxiliary buyer utility V(·)\nBy construction V (x) = U(x,G,H) for x ≥ κ, and by (II) it holds that V (x) ≤ U(x,G,H) everywhere.\nTherefore by (I) we have Π(x, y|V ) = Π(x, y|U(·, G,H)) for x ≥ κ and Π(x, y|V ) ≥ Π(x, y|U(·, G,H))\neverywhere. Since by (III) min Γ(y′|V ) ≥ κ, this implies immediately that min Γ(y′|U(·, G,H)) ≥ κ.\nBy the definition of κ this implies (26).\nProposition A2. (Necessity) If any equilibria is positive assorted under any type distributions B(x)\nand S(y), then f(x, y) is weakly n-root-supermodular where n = (1− a)−1.\nProof. By contradiction. Suppose there exists some (xˆ, yˆ) such that the match-value function is not\nn-root-supermodular, but there exists an equilibrium exhibiting PAM for any distributions B,S. We\nwill contradict this in four steps; the main insights are in the first three steps:\n1. Construct a set Zε around (xˆ, yˆ) where f is nowhere n-root-supermodular\nBy the smoothness properties of f there exists ε > 0 such that f is not root-supermodular anywhere\non Zε = [xˆ − ε, xˆ + ε] × [yˆ − ε, yˆ + ε]. We can choose ε such that fxy(x, y) − α fx(x,y)fy(x,y)f(x,y) < 0 for\nall (x, y) ∈ Zε for some α < a. By continuity of a(λ), there exists λ1, λ2 such that a(λ) > α for all\nλ ∈ [λ1, λ2]. If buyer and seller types are in Zε and they trade at queue lengths in [λ1, λ2], the lack of\nsufficient supermodularity means that PAM cannot be sustained, as we will formalize in the next steps.\n2. Let Zε shrink so that types are similar\nConsider a sequence {εk}∞k=1, 0 < εk < ε, that monotonically converges to zero. Let Bk and Sk\nbe associated sequences of distributions of buyer and seller types. Let Bk be uniform with support on\nXk = [xˆ−εk, xˆ+εk] and unit mass: Bk(xˆ+εk) = 1. Let Sk be uniform with support on Yk = [yˆ−εk, yˆ+εk]\nwith mass Sk(yˆ+εk) = 2λ1+λ2 , i.e., the aggregate ratio of buyers to sellers remains constant at the average\nof λ1 and λ2, independent of k. By construction the buyer-seller types that trade are within Zε for any\nk.\n3. For some k all buyers and sellers trade at a queue lengths in (λ1, λ2).\nConsider an equilibrium (Gk, Hk) for each k. Note first that the difference in expected buyer utilities con-\nverges to zero, in the sense that for every ξ > 0 there exists κ such that |U(x1, Gk, Hk)−U(x2, Gk, Hk)| ≤\nξ for any x1, x2 ∈ Xk and any k ≥ κ. This notion of converges will be used throughout this proof. It\ncan be shown based on equilibrium condition (ii), which ensures that |U(x1, Gk, Hk)−U(x2, Gk, Hk)| ≤\nmaxλ∈[0,∞] maxy∈Yk q(λ)|f(x1, y)−f(x2, y)|. Assuming without loss of generality that x1 ≥ x2, the right\n28\nhand side of the inequality is bounded by f(x1, yˆ + εk) − f(x2, yˆ − εk), and this term vanishes since\nx1 − x2 ≤ 2εk → 0 and yˆ + εk − (yˆ − εk) = 2εk → 0 and f continuous. Given that the differences\nin buyer utility vanish with large k, and given that the distance in types vanishes, it is easy to show\nthat the distance between the highest queue length that is part of a solution to (4) for some y ∈ Yk\nand the lowest queue length that is part of a solution to (4) for some y′ ∈ Yk converge to zero. (Also\nthe differences in the value to program (4) across seller types in Yk vanish with increasing k, as used\nin the next step.) Since the differences in queue lengths across sellers vanish but the aggregate buyer\nseller ratio is (λ1 + λ2)\/2, all sellers trade at queue lengths in (λ1, λ2) for k sufficiently large. If we\nrestrict attention only to differentiable equilibria, this immediately contradicts the assumption that the\nequilibria are PAM since condition (14) in Lemma 1 is violated.\n4. Non-differentiable equilibria\nFinally, we rule out that equilibria are PAM but non-differentiable. Let pik(y) = maxp pi(y, p,Gk, Hk)\ndenote the equilibrium profit of seller y, i.e., the value of program (4). In the previous proof of\nProposition A1 the indifference condition (27) which defines auxiliary utility Vk(x) can be restated as\nΠ(x, y|Vk(·)) = pik(y) or\nmax\nλ\nm(λ)f(x, y)− λVk(x) = pik(y). (29)\nNote that the maximizer of the LHS of (29) is used in (28) in the previous proof. We are done if we\ncan show: there exists k such that the maximizers of the LHS of (29) lie in [λ1, λ2] for all x ∈ Xk and\nany y ∈ Yk. Then analogous arguments as in the previous proof establish that there has to be negative\nassortative matching since the cross-partial in (28) is negative, ruling out PAM.\nTo show the missing part, recall that the equilibrium profits pik(y) across sellers in Yk becomes\nnearly identical for large k (see previous step 3). Since profits lie in a bounded set, there exists limit\npoint pi∞ and a subsequence such that for any ξ the distance between the equilibrium profit pik(y) of\nany y ∈ Yk and pi∞ are less than ξ as k becomes sufficiently large. This convergence of the RHS of (29)\nand the vanishing differences between buyer types mean that there is a subsequence for which Vk(x)\napproaches some limit value V∞ arbitrarily close for all x ∈ Xk and any y ∈ Yk. Since Vk(x) converges\nto V∞ and the support of buyer types shrinks to xˆ, the queue lengths that maximize the LHS of (29)\nhave to converge. Finally, observe that they have to converge to a value within [λ1, λ2] as we will show\nnow. The profit pik(y) can by (5) be written as maxx,λm(λ)f(x, y) − λU(x,Gk, Hk). Let (x∗k, λ∗k) be\nthe equilibrium type and equilibrium queue length which maximize this expression. Since equilibrium\nqueue lengths lie in [λ1, λ2] for large k as shown in Step 3, we have λ∗k ∈ (λ1, λ2) for k large enough.\nSince all maximizers of the LHS of (29) converge, and λ∗k is such a maximizer (for x\n∗\nk), all maximizers\nconverge to the limit of λ∗k that lies within (λ1, λ2).\nProof of Proposition 1\nProof. First part of the theorem: Given search technology m, let a1 = 13a +\n2\n3a and a2 =\n2\n3a +\n1\n3a.\nChoose λ1 and λ2 such t.hat a(λ) ∈ [a1, a2] for all λ ∈ [λ1, λ2]. Consider f(x, y) = (x+ y + 1)(n+n2)\/2.\nThis function is n2-root-supermodular but nowhere n-root-supermodular where n2 = (1 − a2)−1 and\nn = (1 − a)−1. Now consider a sequence of distributions Bk and Sk with support on [0, εk], with\nBk(εk) = 1 and Sk(εk) = 2λ1+λ2 . Analogous arguments as in step 2 - 4 in the proof of Proposition 7\nshow that all agents desire trade at a queue lengths in (λ1, λ2), and n2-root-supermodularity implies\nPAM. This establishes the first part. The second part can be established analogously, with preference\nfunction f(x, y) = (x+ y + 1)(n+n1)\/2 where n1 = (1− a1)−1 and n = (1− a)−1.\n29\nProof of Proposition 2\nProof. We prove the result for positive sorting; the proof for negative sorting is analogous. We con-\nstruct a positively assorted differentiable equilibrium (G,H) in three steps: First we explore necessary\nconditions that restrict the connection between the queue length, the assignment and the price that\ndifferent seller types face in equilibrium, then we “reverse-engineer” the associated equilibrium (G,H),\nand finally we check that the equilibrium conditions are indeed met.\n1. Exploiting necessary conditions\nRather than considering equilibrium distributions (G,H) directly, we will ”reverse-engineer” them\nby exploiting first some necessary conditions about the relationship between the queue-length Λ(y)\n[formally Λ(y, p(y))], the assignment µ(y), and the price p(y) in a differentiable equilibrium.\nFirst, the buyer-seller ratio integrated over a range of seller types equals the number of buyers that\nchoose these types (as required by the RN-derivative), which relates Λ to µ via\n∫ y\ny Λ(·)dS =\n∫ x\nµ(y) dB.\nThis yields\nµ′(y) = s(y)Λ(y)b(µ(y))−1. (30)\nSecond, Λ and µ are linked via the first-order conditions given in (6) and (7) for some positive and\nincreasing function U(y). From (6) and (7) we can derive (11), which together with (30) yields\nΛ′(y) = − 1\nm′′(Λ(y))f(µ(y), y)\n[\n(Λ(y)m′(Λ(y))−m(Λ(y)))s(y)\nb(µ(y))\nfx(µ(y), y) +m′(Λ(y))fy(µ, y)\n]\n. (31)\nThird, Λ and µ are linked via two boundary conditions. Intuitively, the lowest active seller type, i.e.\nthe lowest type x0 that does not take the outside option, has to obtain at least as much utility as the\noutside option of zero, and has to get exactly zero if x0 > x as otherwise lower types would get more by\nbecoming active. A similar logic holds for the lowest seller type y0 that trades in equilibrium Therefore\nthe boundary buyers’ equilibrium utility [given in (6)] and boundary sellers’ equilibrium profits [given\nby (6) substituted into (5)] have to satisfy\nm′(Λ(y0))f(µ(y0), y0) ≥ 0, with equality if µ(y0) > x, (32)\n[m(Λ(y0))− Λ(y0)m′(Λ(y0))]f(µ(y0), y0) ≥ 0, with equality if y0 > y. (33)\nEquations (30) and (31) together constitute a differential equation system in Λ, µ. One initial\ncondition is µ(y) = x. Given a second initial condition on the queue length at the top seller, Λ(y) =\nλ ∈ (0,∞), the system uniquely determines Λ(y) and µ(y) (in the direction of lower y) at all y down\nto some limit point y0(λ). This limit point is characterized by either y0(λ) = y or µ(y0(λ)) = x or\nlimy↘y0(λ) Λ(y) = 0 or limy↘y0(λ) Λ(y) = ∞, whichever arises first. Since the lower bound has to\nsatisfy (32) and (33), this imposes restrictions on the free parameter λ. We can show that (the proof is\navailable in the working paper version of the paper): There exists an initial condition λ ∈ (0,∞) such\nthat resulting y0(λ), λ(y0(λ)) and µ(y0(λ)) fulfill boundary conditions (32) and (33). For the following,\nconsider such a λ, which fixes the associated solutions Λ and µ to (30) and (31) and associated boundary\ntypes y0 and x0 = µ(y0)) uniquely.\nThe price function p(y) for each type y ≥ y0 can then be reconstructed since the profit m(Λ(y))p(y)\nhas to equal the constructed profits given by (6) substituted into (5), yielding after division by m(Λ(y)\nthat p(y) = [1−Λ(y)m′(Λ(y))\/m(Λ(y))]f(µ(y), y). For types below y0, note that y0 > y implies by (32)\nthat Λ(y0) = limy→y0 λ(y) = 0, which implies p(y0) = limy→y0 p(y) = 0 since limΛ→0m(Λ)\/Λ = m′(0)\nand therefore limy→y0 Λ(y)m′(Λ(y))\/m(Λ(y)) = 1. Note that the finite limit limΛ→0m(Λ)\/Λ = m′(0)\nindeed exists: finite m′(λ) exists by assumption for λ > 0 and is monotone (by m′′(λ) < 0), and it is\n30\nbounded (by m′(λ) ≤ 1 as otherwise limλ→0 q(λ) = limλ→0m(λ)\/λ = limλ→0m′(λ) > 1 which violates\nq(λ) ∈ [0, 1]). The boundary seller does not obtain any buyers even at a zero price, and all types below\nhim also obtain no buyers independent of the price they charge because their quality is also too low.\nSo we can set p(y) = 0 for all y < y0.\n2. Recovering the equilibrium (G,H)\nThe equilibrium distributions (G,H) can now be constructed from the µ and p functions derived in\nthe first step. Consider the sellers first. We integrate all of them that offer prices below p as derived in\nthe previous step:\nG(y, p) =\n∫ y\ny0\ns(y˜)I[p(y˜)≤p]dy˜,\nwhere I is an indicator function that takes the value of 1 if the qualifier in square brackets it true, and\ntakes the value 0 otherwise. Clearly, GY = S by construction, as required. Next consider the buyers.\nTypes below x0 choose their outside option ∅. Therefore, at any price p ≥ 0 these types trade below (by\nour convention in footnote 4) and therefore have mass B(x) : For all x < x0 we have H(x, y, p) = B(x)\nfor all (y, p) ∈ (Y × P) ∪ {∅}. For all buyers with x ≥ x0 we have H(x, ∅) = B(x0) and for all other\n(y, p) ∈ Y × P\nH(x, y, p) =\n∫ y\ny0\nb(µ(y˜))I[µ(y˜)≤x]I[p(y˜)≤p]dy˜ +B(x0). (34)\nClearly HX = B, as required.\n3. Checking the equilibrium conditions\nBy construction, the function Λ(y) as constructed in the first step coincides with a Radon-Nikodym\nderivative ΛGH(y, p) of G w.r.t. H along all (y, p(y)). Also, the function U(·) in the first step coincides\nwith U(·, G,H) by construction. To check that (G,H) is indeed an equilibrium, we can extend ΛGH to\nthe entire domain by (3) and check the equilibrium conditions i and ii.\nCondition i amounts to verifying that no seller y wants to deviate and offer a different price than p(y)\nconstructed above (because (y, p(y)) are the only combinations in the support of G), which is equivalent\nto checking that no seller has a profitable deviation from (µ(y),Λ(y), p(y)) in (4). Additionally, condition\nii requires us to check that no buyer µ(y) wants to deviate and trade at some combination other than\n(y, p(y)) (again (µ(y), y, p(y)) are the only combinations in the support of H, except for those buyers\nbelow x0 for which we have to check that they do not want to trade at all).\nThe verification is facilitated by the following observations: If sellers do not have an incentive to\ndeviate, then buyers have no incentive to deviate. This follows directly from the fact that a profitable\ndeviation for buyers means that in program (4) sellers can make higher profits. (Another way of seeing\nthis is that (31) is exactly the buyers’ envelope condition.) Moreover, for the sellers we only have to\nconsider types in [y0, y]. If there are seller types below y0, these types do not have a profitable deviation\nbecause, by boundary condition (33), type y0 makes zero profits and we will verify that he does not\nhave a profitable deviation despite being a higher type.\nFor types in [y0, y] we know that (µ(y),Λ(y), p(y)) constructed above is indeed a local maximum in\n(4), because n-root-supermodularity implies that the Hessian (8) is negative definite. We now establish\nthat the solution is a global maximum. Consider a seller y with assigned buyer type x, i.e. x = µ(y).\nNow suppose there is another buyer x′ = µ(y′), different from x, which is optimal for y, i.e. x′ satisfies\nthe necessary first order conditions (6) and (7) for optimality for seller y (together with for some queue\n31\nlength).17 Since (x′, y) fulfill both (6) and (7), they satisfy the following generalization of (6)\nq(ς(x′, y))fx(x′, y)− U ′(x′) = 0, (35)\nwhere ς(x′, y) is defined as the queue length such that Λ(y) = ς(x′, y) solves m′(Λ(y))f(x′, y)−U(x′) = 0\nin analogy to (7). Now suppose that x′ > x, which implies y′ > y, the opposite case is analogous. Since\nµ(y′) = x′ these types also fulfill (6) and (7) by our construction in Step 1, and therefore they fulfill\nalso\nq(ς(x′, y′))fx(x′, y′)− U ′(x′) = 0. (36)\nWe rule out that both (35) and (36) are satisfied simultaneously by showing that the that q(ς(x′, y))fx(x′, y)\nis strictly increasing in y. The derivative of this expression with respect to y, together with implicit\ndifferentiation of (7) to recover ∂ς(x′, y)\/∂y, is strictly positive if and only if\nfxy(x′, y)) > a(ς(x′, y))fy(x′, y)fx(x′, y)f(x′, y)−1,\nwhich is ensured by n-root-supermodularity (where n = (1 − a)−1). This implies that the solution to\nthe FOC in (6) and (7) is a global maximum.\nProof of Proposition 3\nProof. Trade in pairs requires λq(λ) = m(λ). Therefore, q′′(λ) = [m′′(λ)− 2q′(λ)]λ−1. Then |q′′(0)| <\n∞ implies m′′(0) = 2q′(0). Together with q′(0) 6= 0 this implies m′′(0) 6= 0. Use λq(λ) = m(λ) to\nwrite (13) as a(λ) = m′(λ)q′(λ)\/(m′′(λ)q(λ)), and substitute to get a(0) = m′(0)\/(2q(0)). Since q(0) =\nlimλ→0m(λ)\/λ = m′(0) one obtains a(0) = 1\/2. Further, a(λ) ≤ 1\/2 for all λ iff q(λ)−1 is convex: since\nq(λ)−1 = λm(λ)−1 we have (suppressing the argument of m) (λm−1)′′ = λ2m−3[−m′′q + 2m′q′]. This\nis positive iff −m′′q + 2m′q′ ≥ 0 or equivalently a(λ) = m′q′\/(m′′q) ≤ 1\/2.\nProof of Proposition 4\nProof. We first show that the planner’s assignment coincides with the equilibrium assignment if it\nis assortative positive assortative. Then we sketch why root-supermodularity implies the associated\ndirection of sorting by showing that it induces the direction locally (the full proof for global assortative\nmatching is available on request).\nAssume that H in the planner’s solution is assortative, i.e., it permits µ that is strictly monotone.\nSince HXY(µ(y), y) = B(y) and HX = B, all the mass is concentrated only on (µ(y), y) pairs. For\na given (µ(y), y) pair, the concavity of the matching function implies that it is optimal if all of these\nagents trade at the same queue length Λ(y) [formally, Λ(y, p(y)) for some p(y)].18 Since all mass is only\nconcentrated on (µ(y), y) pairs, the constraints can be conveniently summarized by a single constraint∫ y¯\ny Λ(.)dS = 1−B(µ(y)) in case of positive sorting and\n∫ y¯\ny Λ(.)dS = B(µ(y)) in case of negative sorting.\nFor given (G,H) there is almost everywhere unique Λ fulfilling this constraint, and a given Λ yields\n17This argument assumes x′ satisfied x′ = µ(y′) for some y′, which does not hold if x′ < x0. Note that in the case.\nx′ < x0 both types x′ and x0 obtain zero utility (see (32)) and seller y is at least as well off according to (4) by attracting\nx0 as by attracting x\n′. For x0 it holds that µ(y0) = x0.\n18Formally, the objective in (18) can be written as maxG,H\nR\nq(ΛGH(y, p))f(µ(y), y)dHYP , which is\nequivalent to maxG,H\nR\nm(ΛGH(y, p))f(µ(y), y)dG by the third constraint. This problem is equivalent to\nmaxG,H\nR\nm(Λ(y))f(µ(y), y)dGY , such that GY = S;HX = B; Λ = dHY\/dGY where Λ(y) :=\nR\nΛGH(y, p)dG(p|y),\nsince the concavity of m always makes it optimal to assign the average queue length.\n32\nunique µ and, thus, a unique (G,H) [for the given p(y)] as a can be seen by the analogous construction\nin Step 2 of the existence proof. The planner can therefore directly control Λ, which by the constraint\ngoverns the assignment µ, leading to the much simpler control problem\nmax\nΛ,y0\n∫ y¯\ny0\ns(y) ·m(Λ(y)) · f(µ(y), y)dy (37)\ns.t. µ′(y) = ±s(y)Λ(y)\/b(µ(y)),\nwhere the sign on the constraint is positive for positive sorting and negative for negative sorting, y0\ndenotes the lowest type which is assigned to sellers by the planner and the rest of the buyers is assigned\nto ∅.\nThe Hamiltonian to problem (37) is:\nH(y, λ, µ) = s(y) ·m(Λ) · f(µ, y) + φ · s(y)Λ\/b(µ), (38)\nwhere φ is the multiplier.\nThe optimality conditions of the Hamiltonian satisfy:\nΛ :\n∂H\n∂Λ\n= m′(Λ) · f(µ, y) + φ\nb(µ)\n= 0\nµ :\n∂H\n∂µ\n= s(y) ·m(Λ) · fx(µ, y)− φ · s(y)Λ b\n′(µ)\nb2(µ)\n= −φ′.\nDefining A(µ(y)) = − φ(y)b(µ(y)) , the optimality conditions can be written as\nm′(Λ(y)) · f(µ(y), y) = A(µ(y)) (39)\nq(Λ(y)) · fx(µ(x), y) = A′(µ(y)). (40)\nThese equations are identical to First-Order Conditions (6) and (7) of the decentralized economy with\nappropriate reinterpretation of the variables.\nTo establish that the solution to this program is identical to the solution of the decentralized\neconomy, focus on the case of positive sorting (the alternative case follows analogous steps). The\nplanner’s boundary conditions are the following: at the upper bound assortative matching means that\nµ(y) = x. At the lower bound, observe that it is never optimal to assign lower types if higher types have\nmatching probability zero. Therefore Λ(y) = 0 or Λ(y) =∞ only at y = y0. Moreover, obviously y0 ≥ y\nand µ(y0) ≥ x. Therefore, the planners’ problem has the same boundary conditions as the decentralized\nequilibrium. In the proof of existence (Proposition 2) we showed that under n-root-supermodularity\nfor n = (1− a)−1 any solution of these first-order-conditions and the boundary solutions constitutes an\nequilibrium when integrated up to the corresponding distributions (G,H).\nFinally, we sketch why the planner’s solution is positive assortative if f is n−root-supermodular with\nn = (1 − a)−1. Assume that the planner’s solution yields a differentiable assignment: on some subset\nof X × Y the distribution H fulfills HXY(µ(y), y) = B(x) for some function µ that is differentiable.\nOptimality still requires that µ′ satisfies (38) and associated optimality conditions (39) and (40). Yet\nin order to maximize the Hamiltonian the second order condition must be satisfied: (39) and (40)\nare identical to (6) and (7) under appropriate relabeling of variables, and the second-order condition\ntherefore reduces to (14), which requires positive sorting. This rules out locally decreasing assignments.\nA tedious proof that extends this logic globally is available from the authors.\n33\nThe Equilibrium Price Schedule\nProof. In a differentiable assortative equilibrium with price function p(y), assignment function µ(y) and\nqueue length Λ(y) [formally Λ(y, p(y))] the equilibrium buyer utility U(µ(y)) = q(Λ(y))[f(µ(y), y)−p(y)]\ncan be totally differentiated to get\nU ′µ′ = Λ′q′[f − p] + q(fxµ′ + fy − p′), (41)\nwhere we suppressed all arguments. Note further that firms equilibrium profits can be recovered by\nsubstituting (6) into (5), yielding [m − Λm′]f. Equating this to the definition of expected profits as\nprice times quantity, i.e. mp, we obtain the price schedule p(y) along the equilibrium path as p =\n[1 − Λm′\/m]f = [1 − ηm]f. Substituting this and (6) into (41) we get after canceling terms that\n0 = q′ηmΛ′f + q[fy − p′]. We can solve this for p′ : use (11) to substitute out Λ′f, and use the fact that\na = m′q′\/(m′′q) to get after rearranging that p′ = fy + a[fxµ′(m\/Λ −m′)ηm\/m′ − (1 − ηm)fy]. Since\n[m\/Λ−m′]ηm\/m′ = 1− ηm we obtain (17).\n34\nReferences\n[1] Acemoglu, Daron, and Robert Shimer, ”Efficient Unemployment Insurance,” Journal of\nPolitical Economy 107, 1999a, 893-928.\n[2] Acemoglu, Daron, and Robert Shimer, ”Holdups and Efficiency with Search Frictions,”\nInternational Economic Review 40, 1999b, 827-849.\n[3] Becker, Gary S., ”A Theory of Marriage: Part I”, Journal of Political Economy 81(4), 1973,\n813-46.\n[4] Burdett, Kenneth, Shouyong Shi and Randall Wright, “Pricing and Matching with\nFrictions,” Journal of Political Economy 109, 2001, 1060-1085.\n[5] Butters, G.R., “Equilibrium distributions of sales and advertising prices,” Review of Economic\nStudies 44, 1977, 465-491.\n[6] Delacroix, Alain, and Shouyong Shi, ”Directed Search on the Job and the Wage Ladder,”\nInternational Economic Review 47, 2006, 651-699.\n[7] Eeckhout, Jan and Philipp Kircher, “Sorting versus Screening: Prices as Optimal Competi-\ntive Sales Mechanisms”, UPenn mimeo, 2009.\n[8] Gale, Douglas, “Bargaining and Competition, Part I: Characterization,” Econometrica 54,\n1986, 785-806.\n[9] Galenianos, Manolis and Philipp Kircher, “Directed Search with Multiple Job Applica-\ntions,” Journal of Economic Theory, 114(2), 2009, 445-471\n[10] Hicks, J.R. The Theory of Wages, London: Macmillan, 1932.\n[11] Hosios, Arthur, “On the Efficiency of Matching and Related Models of Search and Unemploy-\nment,” Review of Economic Studies 57(2), 1990, 279-298.\n[12] Kantorovich, L.V., “On the Translocation of Masses”, (Translated into English and reprinted\nin Management Science 5(1), 1-4 (1958)) Comptes Rendus (Doklady) de l’Academie des Sciences\nde L’URSS 37, 199-201 (1942).\n[13] Kircher, Philipp, “Efficiency of Simultaneous Search”, Journal of Political Economy 117(5),\n2009, 861-913.\n[14] Kiyotaki, Nobuhiro and Randall Wright, “A Search-Theoretic Approach to Monetary Eco-\nnomics,” American Economic Review 83, 1993, 63-77.\n[15] Lauermann, Stephan, “Dynamic Matching and Bargaining Games: A General Approach,” Uni-\nversity of Michigan mimeo 2007.\n[16] Mas-Colell, Andreu, “On a Theorem by Schmeidler,” Journal of Mathematical Economics 13,\n1984, 201-206.\n[17] McAfee, R Preston, “Mechanism Design by Competing Sellers,” Econometrica 61(6), 1993,\n1281-1312.\n35\n[18] Menzio, Guido, “A Theory of Partially Directed Search,” Journal of Political Economy 115,\n2007, 748-769.\n[19] Moen, Espen, “Competitive Search Equilibrium”, Journal of Political Economy 105(2), 1997,\n385-411.\n[20] Mortensen, Dale, and Randall Wright, “Competitive Pricing and Efficiency in Search\nEquilibrium,” International Economic Review 43, 2002, 1-20.\n[21] Peters, Michael, “Ex Ante Pricing in Matching Games: Non Steady States”, Econometrica\n59(5), 1991, 1425-1454.\n[22] Peters, Michael, “A Competitive Distribution of Auctions”, The Review of Economic Studies\n64(1), 1997a, 97-123.\n[23] Peters, Michael, “On the Equivalence of Walrasian and Non-Walrasian Equilibria in Contract\nMarkets: The Case of Complete Contracts”, The Review of Economic Studies 64, 1997b, 241-264.\n[24] Peters, Michael, “Limits of Exact Equilibria for Capacity Constrained Sellers with Costly\nSearch,” Journal of Economic Theory 95, 2000, 139-168.\n[25] Peters, Michael, “Unobservable Heterogeneity in Directed Search”, mimeo UBC, 2007.\n[26] Rosen, Sherwin, “Hedonic Prices and Implicit Markets: Product Differentiation in Pure Com-\npetition,” Journal of Political Economy 82(1), 1974, 34-55.\n[27] Rosen, Sherwin, “Markets and Diversity,” American Economic Review 92(1), 2002, 1-15.\n[28] Rubinstein, Ariel, and Asher Wolinsky, “Equilibrium in a Market with Sequential Bargain-\ning,” Econometrica 53 (1985), 1133-1150.\n[29] Shapley, Lloyd S. and Martin Shubik, “The Assignment Game I: The Core”, International\nJournal of Game Theory 1(1), 1971, 111-130.\n[30] Shi, Shouyong, “Frictional Assignment. 1. Efficiency,” Journal of Economic Theory, 98, 2001,\n232-260.\n[31] Shi, Shouyong, “A Directed Search Model of Inequality with Heterogeneous Skills and Skill-\nBiased Technology,” The Review of Economic Studies 69, 2002, 467-491.\n[32] Shimer, Robert, “The Assignment of Workers to jobs in an Economy with Coordination Fric-\ntions,” Journal of Political Economy 113(5), 2005, 996-1025.\n[33] Shimer, Robert, and Lones Smith, “Assortative Matching and Search,” Econometrica 68,\n2000, 343–369.\n[34] Smith, Lones, “The Marriage Model With Search Frictions,” Journal of Political Economy 114,\n2006, 1124–1144.\n36\n"}