{"doi":"10.1080\/09575140701594418","coreId":"10169","oai":"oai:repository.tavistockandportman.ac.uk:95","identifiers":["oai:repository.tavistockandportman.ac.uk:95","10.1080\/09575140701594418"],"title":"Nurseries and emotional well-being.  Evaluating an emotionally containing model of professional development","authors":["Dearnley, Katy","Elfer, Peter"],"enrichments":{"references":[{"id":765870,"title":"Action research, child observation and professional development: some evidence from a research study, Early Years: An","authors":[],"date":"1998","doi":"10.1080\/0957514980190108","raw":"Blenkin, G. & Hutchin, V. (1998) Action research, child observation and professional development: some evidence from a research study, Early Years: An International Journal of Research and Development, 19(1), 62–75.","cites":null},{"id":777973,"title":"Action research, in: B. Somekh & C. Lewin (Eds) Research methods in the social sciences (London,","authors":[],"date":"2005","doi":"10.3126\/ejon.v29i2.156","raw":"Noffke, S. & Somekh, B. (2005) Action research, in: B. Somekh & C. Lewin (Eds) Research methods in the social sciences (London, Sage Publications).","cites":null},{"id":769432,"title":"Babies and Young Children in Nursery: Using psychoanalytic ideas to explore tasks and interactions,","authors":[],"date":"2007","doi":"10.1111\/j.1099-0860.2006.00034.x","raw":"0Elfer, P. (2007) Babies and Young Children in Nursery: Using psychoanalytic ideas to explore tasks and interactions, Children and Society, 21(2).","cites":null},{"id":781797,"title":"Basics of qualitative research: techniques and procedures for developing grounded theory (London,","authors":[],"date":"1998","doi":"10.1177\/1094428108324514","raw":"Strauss, A. & Corbin, J. (1998) Basics of qualitative research: techniques and procedures for developing grounded theory (London, Sage Publications).","cites":null},{"id":775691,"title":"Child benefits: the importance of investing in quality childcare (Facing the Future: Policy Papers) (London, Daycare Trust).","authors":[],"date":"2004","doi":null,"raw":"Melhuish, E. (2004) Child benefits: the importance of investing in quality childcare (Facing the Future: Policy Papers) (London, Daycare Trust).","cites":null},{"id":770970,"title":"Children and day nurseries (London,","authors":[],"date":"1980","doi":"10.1177\/174114328301100109","raw":"Garland, C. & White, S. (1980) Children and day nurseries (London, Grant McIntyre).","cites":null},{"id":781022,"title":"Clinical implications of attachment concepts: retrospect and prospect,","authors":[],"date":"1995","doi":"10.1111\/j.1469-7610.1995.tb02314.x","raw":"Rutter, M. (1995) Clinical implications of attachment concepts: retrospect and prospect, Journal of Child Psychology and Psychiatry, 36(4), 549–571.","cites":null},{"id":776367,"title":"Containing anxiety in institutions: selected essays (vol. 2) A report on a study of the nursing service of a general hospital (London,","authors":[],"date":"1988","doi":null,"raw":null,"cites":null},{"id":7600650,"title":"Containing anxiety in institutions: selected essays (vol.2) A report on a study of the nursing service of a general hospital (London,","authors":[],"date":"1988","doi":null,"raw":"Menzies-Lyth, I. (1988) Containing anxiety in institutions: selected essays (vol.2) A report on a study of the nursing service of a general hospital (London, Free Association Books).","cites":null},{"id":781250,"title":"Day nurseries at a crossroads: meeting the challenge of child care in the nineties (London, National Children’s Bureau).","authors":[],"date":"1994","doi":null,"raw":"Smith, C. & Vernon, J. (1994) Day nurseries at a crossroads: meeting the challenge of child care in the nineties (London, National Children’s Bureau).","cites":null},{"id":766530,"title":"Early child development in the 21st century: profiles of current research initiatives","authors":[],"date":"2003","doi":"10.1111\/1467-8624.00141","raw":"Brooks-Gunn, J., Sidle-Fuligni, A. & Berlin, L. J. (Eds) (2003) Early child development in the 21st century: profiles of current research initiatives (New York, Teachers College Press).","cites":null},{"id":767683,"title":"Education and Skills (DfES)","authors":[],"date":"2006","doi":null,"raw":"Department for Education and Skills (DfES) (2006) Personal, social and emotional development training materials – birth to five (London, DfES SureStart Unit).","cites":null},{"id":768738,"title":"Education and Skills\/Department for Work and Pensions (DfES\/DWP)","authors":[],"date":"2006","doi":null,"raw":"Department for Education and Skills\/Department for Work and Pensions (DfES\/DWP) (2006) The Early Years Foundation Stage: consultation on a single quality framework for services to children from birth to five (London, DfES Publications).","cites":null},{"id":782408,"title":"Equal access? Appropriate and affordable childcare for every child (London, Institute for Public Policy Research).","authors":[],"date":"2006","doi":null,"raw":"Stanley, K., Bellamy, K. & Cooke, G. (2006) Equal access? Appropriate and affordable childcare for every child (London, Institute for Public Policy Research).","cites":null},{"id":773624,"title":"Facilitating the development of intimacy between nurses and infants in day nurseries,","authors":[],"date":"1988","doi":"10.1080\/0300443880330108","raw":"Hopkins, J. (1988) Facilitating the development of intimacy between nurses and infants in day nurseries, Early Child Development and Care, 33, 99–111.","cites":null},{"id":777405,"title":"Helping providers to improve quality of day-care provision: theories of education and learning, Early Child Development and Care,","authors":[],"date":"1996","doi":"10.1080\/0300443961180102","raw":"Munton, A., Mooney, A. & Rowland, L. (1996) Helping providers to improve quality of day-care provision: theories of education and learning, Early Child Development and Care, 1184, 15–25.","cites":null},{"id":775129,"title":"Infant care: a day nursery under the microscope,","authors":[],"date":"1982","doi":null,"raw":"Marshall, T. (1982) Infant care: a day nursery under the microscope, Social Work Service, No. 32(Winter), 15–31.","cites":null},{"id":770010,"title":"Key persons in the nursery: building relationships for quality provision (London,","authors":[],"date":"2003","doi":"10.4324\/9780203828151","raw":"Elfer, P., Goldschmied, E. & Selleck, D. (2003) Key persons in the nursery: building relationships for quality provision (London, David Fulton).","cites":null},{"id":767104,"title":"Learning to labour with feeling: class, gender and emotion in childcare education and training,","authors":[],"date":"2006","doi":"10.2304\/ciec.2006.7.1.15","raw":"Colley, H. (2006) Learning to labour with feeling: class, gender and emotion in childcare education and training, Contemporary Issues in Early Childhood, 7(1), 15–29.","cites":null},{"id":774199,"title":"Models of continuing professional development: a framework for analysis,","authors":[],"date":"2005","doi":"10.1080\/13674580500200277","raw":"Kennedy, A. (2005) Models of continuing professional development: a framework for analysis, Journal of In-Service Education, 31(2), 235–250.","cites":null},{"id":768846,"title":"Observation observed, in:","authors":[],"date":"2005","doi":null,"raw":"Elfer, P. (2005) Observation observed, in: L. Abbott & A. Langston (Eds) Birth to three matters (Buckingham, Open University Press). 278 P. Elfer and K. Dearnley D o w n l o a d e d B y : [ D o u g l a s , A n g e l a ] [ T a v i s t o c k a n d P o r t m a n L i b r a r y ] A t : : J u n e","cites":null},{"id":780343,"title":"Observing infants: reflections on methods, in:","authors":[],"date":"1989","doi":null,"raw":"Rustin, M. (1989) Observing infants: reflections on methods, in: L. Miller, M. Rustin, M. Rustin & J. Shuttleworth (Eds) Closely observed infants (London, Duckworth).","cites":null},{"id":772385,"title":"Observing organisations: anxiety, defence and culture in health care","authors":[],"date":"2000","doi":"10.1046\/j.1365-2850.2002.00483.x","raw":"Hinshelwood, R. D. & Skogstad, W. (2000) Observing organisations: anxiety, defence and culture in health care (Hove, Brunner-Routledge).","cites":null},{"id":770553,"title":"Organisation in the mind: psychoanalysis, group relations and organisational consultancy. Occasional Papers of David Armstrong 1989–2003","authors":[],"date":"2005","doi":null,"raw":"French, R. (2005) Organisation in the mind: psychoanalysis, group relations and organisational consultancy. Occasional Papers of David Armstrong 1989–2003 (London, Karnac).","cites":null},{"id":771597,"title":"People under three: young children in day care","authors":[],"date":"1994","doi":"10.4324\/9780203992814","raw":"Goldschmied, E. & Jackson, S. (1994) People under three: young children in day care (London, Routledge).","cites":null},{"id":779209,"title":"Professionalism and performativity: the feminist challenge facing early years practitioners, Early Years: An","authors":[],"date":"2006","doi":"10.1080\/09575140600759997","raw":"Osgood, J. (2006) Professionalism and performativity: the feminist challenge facing early years practitioners, Early Years: An International Journal of Research and Development, 26(2), 187–200.","cites":null},{"id":779749,"title":"Real world research","authors":[],"date":"1993","doi":"10.1177\/144078339403000311","raw":"Robson, C. (1993) Real world research (Oxford, Blackwell).","cites":null},{"id":777077,"title":"Research and policy in early childhood services: time for a new agenda","authors":[],"date":"1997","doi":null,"raw":"Mooney, A. & Munton, A. (1997) Research and policy in early childhood services: time for a new agenda (London, Institute of Education, Thomas Coram Research Unit).","cites":null},{"id":772146,"title":"Some unconscious aspects of organisational life: contributions from psychoanalysis, in:","authors":[],"date":"1994","doi":null,"raw":"Halton, W. (1994) Some unconscious aspects of organisational life: contributions from psychoanalysis, in: A. Obholzer & V. Z. Roberts (Eds) The unconscious at work: individual and organizational stress in the human services (London, Routledge).","cites":null},{"id":773045,"title":"The cradle of thought","authors":[],"date":"2002","doi":"10.1002\/icd.332","raw":"Hobson, P. (2002) The cradle of thought (London, Macmillan).","cites":null},{"id":765258,"title":"The design of a day care system in a nursery setting for children under five, Document No. 2T347 (London, Tavistock Institute of Human Relations [TIHR]).","authors":[],"date":"1986","doi":null,"raw":null,"cites":null},{"id":7600589,"title":"The design of a day care system in a nursery setting for children under five, Document No.2T347 (London, Tavistock Institute of Human Relations [TIHR]).","authors":[],"date":"1986","doi":null,"raw":"Bain, A. & Barnett, L. (1986) The design of a day care system in a nursery setting for children under five, Document No.2T347 (London, Tavistock Institute of Human Relations [TIHR]).","cites":null},{"id":774511,"title":"The personal is professional: professionalism and the birth to three practitioner,","authors":[],"date":"2006","doi":"10.2304\/ciec.2006.7.1.42","raw":"Manning-Morton, J. (2006) The personal is professional: professionalism and the birth to three practitioner, Contemporary Issues in Early Childhood, 7(1), 42–52.","cites":null},{"id":778594,"title":"The unconscious at work: individual and organizational stress in the human services","authors":[],"date":"1994","doi":"10.4324\/9780203359860","raw":"Obholzer, A. & Roberts, V. Z. (1994) The unconscious at work: individual and organizational stress in the human services (London, Routledge).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"Despite official endorsement of attachment principles in nursery work, these are often not translated into nursery practice. One possible reason for this is that staff training does not sufficiently address the personal implications and anxieties that children's attachments may entail for practitioners. Working from a psychoanalytic perspective on organisational functioning and group learning, this paper describes action research with a group of nursery heads who participated in a professional development programme designed specifically to explore emotional experience in professional work. The positive evaluations of the programme by heads and their staff are described including examples of experiential learning and of increased staff awareness about, and responsiveness to, the emotional experience of children. However, the research also concluded that sustained effectiveness of the model is likely to be dependent on an ongoing culture of attention to the emotional experience of nursery staff within nursery umbrella organisations.  \\u","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:repository.tavistockandportman.ac.uk:95<\/identifier><datestamp>\n      2016-02-09T10:28:22Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6368696C64:423133<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.tavistockandportman.ac.uk\/95\/<\/dc:relation><dc:title>\n        Nurseries and emotional well-being.  Evaluating an emotionally containing model of professional development<\/dc:title><dc:creator>\n        Dearnley, Katy<\/dc:creator><dc:creator>\n        Elfer, Peter<\/dc:creator><dc:subject>\n        Child Care Services<\/dc:subject><dc:description>\n        Despite official endorsement of attachment principles in nursery work, these are often not translated into nursery practice. One possible reason for this is that staff training does not sufficiently address the personal implications and anxieties that children's attachments may entail for practitioners. Working from a psychoanalytic perspective on organisational functioning and group learning, this paper describes action research with a group of nursery heads who participated in a professional development programme designed specifically to explore emotional experience in professional work. The positive evaluations of the programme by heads and their staff are described including examples of experiential learning and of increased staff awareness about, and responsiveness to, the emotional experience of children. However, the research also concluded that sustained effectiveness of the model is likely to be dependent on an ongoing culture of attention to the emotional experience of nursery staff within nursery umbrella organisations.  \\ud\n <\/dc:description><dc:publisher>\n        Routledge<\/dc:publisher><dc:date>\n        2007<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/repository.tavistockandportman.ac.uk\/95\/1\/Dearnley_Nurseries.pdf<\/dc:identifier><dc:identifier>\n          Dearnley, Katy and Elfer, Peter  (2007) Nurseries and emotional well-being. Evaluating an emotionally containing model of professional development.  Early Years: An International Journal of Research and Development, 27  (3).   pp. 267-279.  ISSN 0957-5146      Full text available   <\/dc:identifier><dc:relation>\n        http:\/\/www.informaworld.com\/smpp\/content~content=a782256621~db=all?tab=references<\/dc:relation><dc:relation>\n        10.1080\/09575140701594418 <\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.tavistockandportman.ac.uk\/95\/","http:\/\/www.informaworld.com\/smpp\/content~content=a782256621~db=all?tab=references","10.1080\/09575140701594418"],"year":2007,"topics":["Child Care Services"],"subject":["Article","PeerReviewed"],"fullText":" \n \nTavistock and Portman E-Prints Online \n \n  \n \n \nJOURNAL ARTICLE \n \nOriginal citation: Dearnley, Katy and Elfer, Peter (2007) Nurseries and emotional \nwell-being. Evaluating an emotionally containing model of professional development. \nEarly Years: An International Journal of Research and Development, 27 (3). pp. \n267-279. ISSN 0957-5146 \n \n© 2007  Katy Dearnley \nThis version available at: http:\/\/repository.tavistockandportman.ac.uk\/ \n \nAvailable in Tavistock and Portman E-Prints Online: Oct 2009 \nThe Trust has developed the Repository so that users may access the clinical, \nacademic and research work of the Trust. \n \n Copyright © and Moral Rights for the papers on this site are retained by the \nindividual authors and\/or other copyright owners. Users may download and\/or print \none copy of any article(s) in Tavistock and Portman E-Prints Online to facilitate \ntheir private study or for non-commercial research. You may not engage in further \ndistribution of the material or use it for any profit-making activities or any \ncommercial gain.   You may freely distribute the URL \n(http:\/\/repository.tavistockandportman.ac.uk\/) of Tavistock and Portman E-Prints \nOnline.    \n \nThis is an electronic version of an article published in ‘Early Years’© 2007 Copyright \nTaylor & Francis; ‘Early Years’ is available online at: \nhttp:\/\/www.informaworld.com\/openurl?genre=journal&issn=0957-5146.   You are \nencouraged to consult the remainder of this publication if you wish to cite from it. \n \n \n \n \nNurseries and emotional well-being:\nevaluating an emotionally containing\nmodel of professional development\nPeter Elfer*a and Katy Dearnleyb\na\nRoehampton University, London, UK; bTavistock and Portman NHS Trust, London,\nUK\nDespite official endorsement of attachment principles in nursery work, these are often not\ntranslated into nursery practice. One possible reason for this is that staff training does not\nsufficiently address the personal implications and anxieties that children’s attachments may entail\nfor practitioners. Working from a psychoanalytic perspective on organisational functioning and\ngroup learning, this paper describes action research with a group of nursery heads who participated\nin a professional development programme designed specifically to explore emotional experience in\nprofessional work. The positive evaluations of the programme by heads and their staff are\ndescribed including examples of experiential learning and of increased staff awareness about, and\nresponsiveness to, the emotional experience of children. However, the research also concluded that\nsustained effectiveness of the model is likely to be dependent on an ongoing culture of attention to\nthe emotional experience of nursery staff within nursery umbrella organisations.\nKeywords: Nursery; Emotion; Personal feelings; Professional development\nIntroduction\nThe increase (in both age range and hours of attendance) in nursery provision for\nyoung children has been accompanied by increasing concern about their emotional\nwell-being. Children’s emotional well-being is facilitated when interactions with\nadults are consistent, responsive and sensitive (Rutter, 1995; Mooney and Munton,\n1997; Brooks-Gunn et al., 2003; Melhuish, 2004; Stanley et al., 2006). To facilitate\nthis, official guidance has emphasised the key-person approach, where one or two\nstaff are responsible for most of the daily care of a small group of children (DfES,\n2002; DfES, 2006; DfES\/DWP, 2006).\nWhilst official reference to key-person approaches is relatively recent, concern\nabout inconsistent adult attention to children has been evident for much longer\n(Bain & Barnett, 1986; Garland & White, 1980; Marshall, 1982; Goldschmied &\n*Corresponding author. Roehampton University, Froebel College, Grove House, Roehampton\nLane, London SW15 5PJ, UK. Email: p.elfer@roehampton.ac.uk\nEarly Years, Vol. 27, No. 3, October 2007, pp. 267–279\nISSN 0957-5146 (print)\/ISSN 1472-4421 (online)\/07\/030267-13\n# 2007 TACTYC\nDOI: 10.1080\/09575140701594418\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nDo\nug\nla\ns,\n A\nng\nel\na]\n[T\nav\nis\nto\nck\n a\nnd\n P\nor\ntm\nan\n L\nib\nra\nry\n] \nAt\n: \n09\n:5\n7 \n29\n J\nun\ne \n20\n10\nJackson, 1994). Further, even in nurseries nominally committed to the keyperson\napproach, there is a failure of implementation (Goldschmied & Jackson, 1994;\nSmith & Vernon, 1994; Elfer et al., 2003). Why might this be?\nFirst, it is difficult for many nursery staff, particularly those in the private sector, to\neasily access continuing professional development (CPD). Many practitioners have\nnot had the training opportunities to help them understand the rationale for the key-\nperson approach.\nSecond, the terms ‘key worker’ and ‘key person’ appear to be confused and used\ninterchangeably. In social care provision, ‘key worker’ normally refers to a\ncoordinating and liaison role in multiple agency and multidisciplinary work. By\ncontrast, the term ‘key person’ refers to a role involving a direct relationship with a\nparticular child.\nThird, for reasons of child protection, practitioners may be reluctant to allow close\nrelationships to form with children, particularly involving physical contact.\nFinally, there may be a culture in nurseries where status derives from not being\nwith the children but in attending to more administrative or organisational tasks.\nDirect work with children, particular babies and very young children, may be seen as\nlower status, particular as it involves much physical care such as nappy changing.\nThe significance and interrelationship of these factors, in undermining consistency\nand intimacy in interactions with children, requires further investigation. However,\nthe intention of this paper is to draw attention to underlying aspects of the\nfunctioning of social care organisations (for example hospitals or residential homes\nas well as nurseries) that have been identified in psychoanalytic studies of such\norganisations.\nThis paper introduces ‘social defence system’ as a theoretical construct, illustrated\nby reference to two case studies involving a hospital and the nurseries of a local\nauthority. It then reports on an action research study of the use of a model of CPD\nwith heads of nurseries and their staff, designed to be specifically conscious of and\nsensitive to social defence systems. It describes the process of the CPD, the\nevaluations of the participants and some implications for its wider application.\nA psychoanalytic approach to group learning as a model for continuing professional\ndevelopment\nOur attention was first drawn to the possible wider issues involved in the provision of\nconsistent intimate care in professional social care organisations by the work of\nMenzies-Lyth (1988). Psychoanalytic theory includes the key concepts of ‘projec-\ntion’ and ‘containment’. The application of these concepts in the context of early\nyears practice has been introduced elsewhere (Elfer, 2007) but, in brief, ‘projection’\ndescribes the capacity to split off painful feelings:\nLocating feelings in others rather than oneself. Thus the child attributes slyness to the\nfox or jealousy to the bad sister…. (Halton, 1994, p. 13)\n‘Containment’, the process of managing a projected emotion, has been illustrated by\nHobson:\n268 P. Elfer and K. Dearnley\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nDo\nug\nla\ns,\n A\nng\nel\na]\n[T\nav\nis\nto\nck\n a\nnd\n P\nor\ntm\nan\n L\nib\nra\nry\n] \nAt\n: \n09\n:5\n7 \n29\n J\nun\ne \n20\n10\n… an adult who has the mental space to pick up and be sensitive to the infant’s state, so\nthat the infant feels responded to and somehow encompassed within the adult’s\nattentive care … when things go well, the infant can feel her joy received, her upset\nsoothed, her rage contained. (Hobson, 2002, p. 125)\nThese descriptions refer to children but containment occurs between adults too. It is\nmore than sympathetic listening. It is a process of enabling people to think about and\ntalk through threatening or anxiety-provoking ideas with someone who can listen\nand think about them, returning them reframed in an emotionally more manageable\nway (Elfer, 2007).\nMenzies-Lyth has used the concepts of ‘projection’ and ‘containment’ as central\nanalytic tools in exploring the functioning of social care organisations. In the analysis\nof the organisation of a large teaching hospital, the senior staff were increasingly\nconcerned about the conflict between the tasks of patient care and nurse training\n(Menzies-Lyth, 1988).\nIn initial investigatory work interviewing nurses, Menzies-Lyth noted their high\nlevel of tension, distress and anxiety (1988, p. 45). She describes the reality of the work\nthat nurses must undertake, caring for patients 24 hours a day every day of the year,\nmany getting better or improving but some of whom will not and may die. Daily\nwork includes tasks that may be distressing or distasteful, evoking anxiety and stress.\nNurses will also have to support patients’ anxious relatives and have to respond to\ntheir projected feelings, such as dependency, high expectation and maybe rejection,\ndisappointment and anger.\nMenzies-Lyth acknowledges the exceptional emotional demands of such work but\nargued that this alone did not explain the levels of stress experienced by nurses. An\nequally powerful contributing factor to their stress was the response of the hospital\nmanagement, in particular referring to the development of particular attitudes and\nworking practices intended to support nurses in managing the stress of the work.\nExamples of these include promoting the sense of a ‘good nurse’ as one who does not\nget involved with her (or his) patients, does not get too upset or distressed and is able\nto well control her feelings. Working practices promoted and demanded nurses’\nflexible deployment between different wards and different types of nursing work so\ntasks were broken down and sustained contact with patients was minimised. Over\ntime, these attitudes and practices become institutionalised into the ethos, culture\nand procedures of the hospital and it is these that Menzies-Lyth describes as social\ndefence systems. Although well intentioned, such systems did not actually contain\nnurses’ stress and anxiety in the way described by Hobson. Rather, stress and anxiety\nare pushed underground, maybe because nurses fear being seen as unprofessional or\nnot coping or just that there is no opportunity for difficult feelings to be considered\n(contained). Nurses may be only partially aware of this repression for example, using\nextensive activity as a mechanism to avoid them thinking about how they really feel\nbut leaving them with a general sense of stress.\nThe context of an ordinary nursery is very different but nursery practitioners are\nalso subject to the intense projection of feelings, in this case from young children.\nDistress in children is stressful and many practitioners may feel anxious about\nNurseries and emotional well-being 269\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nDo\nug\nla\ns,\n A\nng\nel\na]\n[T\nav\nis\nto\nck\n a\nnd\n P\nor\ntm\nan\n L\nib\nra\nry\n] \nAt\n: \n09\n:5\n7 \n29\n J\nun\ne \n20\n10\nchildren being separated from their families for long periods. This may make\npractitioners feel inadequate as alternative parental figures. They may also feel the\ndesire to provide physical holding and comfort to particular children but be reluctant\nto offer it for fear of forming a closer attachment to children than they might have\nwith their own parents. This dilemma may be resolved by invoking ‘child protection\nprocedures’ as grounds for minimising physical contact with children (in this case a\n‘social defence system’ rather than genuinely directed at child protection). This may\nbe a more manageable psychological ‘position’ for practitioners to adopt but risks\nleaving children to manage their own feelings that arise from the absence of sufficient\nholding and comforting. The children may also experience this as an inability of the\npractitioners to help the children with their distress or other states of mind.\nHopkins, in a six-month training intervention, showed the existence of such\nresponses from nursery practitioners including their fear that individual attachments\nwould result in different degrees of closeness, breaching the principle that children\nshould be treated equally, and that some children might be ignored and become\njealous whilst others were spoiled. They also feared that to experience different\nresponses to different children (some appealing whilst others annoying) was\nreprehensible and that parents might be jealous if they witnessed a close relationship\ndeveloping between a practitioner and their child (Hopkins, 1988, pp. 103–104).\nMenzies-Lyth and Hopkins draw on psychoanalytic insights into organisational\nand group processes, to illustrate how the emotionally containing practices of\norganisations and training interventions with staff can assist them to respond to the\nemotional demands of their work and not to have to resort to distancing behaviours\nand the creation of social defences systems.\nThe features identified by Hopkins as important included the perception by\nnursery practitioners that they were not criticised for the ‘unprofessional feelings’\nthey described, the provision of a regular and consistent place in which the training\ndiscussions could take place and the individual interest shown in them and their\nwork. Although differing models of CPD have been evaluated in the literature (see\nfor example Munton et al., 1996; Blenkin & Hutchin, 1998; Kennedy, 2005), no\nfurther research has yet been published building on Hopkins’s work in a nursery\ncontext. Nevertheless, there is an extensive literature on the process of consultation\nto organisations in which the elements of an ‘emotionally containing approach’ have\nbeen elaborated (see for example Obholtzer & Roberts, 1994; Trowell & Bower,\n1995; Hinshelwood & Skogstad, 2000; French, 2005). Drawing on this literature,\nwe have added to the elements identified by Hopkins to construct an emotionally\ncontaining model of CPD for nursery staff, characterised by:\nN the provision of a reliable and consistent meeting place with clear time limits;\nN close attention to the meaning of detailed interactions in group behaviours and\nthe relationship between what is said and how the group behaves;\nN sensitive exploration, with careful attention to timing, of anxieties, emotional\nconflicts and disagreements expressed by staff;\nN encouragement of learning by experience and shared reflection within the group\nrather than by direct teaching;\n270 P. Elfer and K. Dearnley\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nDo\nug\nla\ns,\n A\nng\nel\na]\n[T\nav\nis\nto\nck\n a\nnd\n P\nor\ntm\nan\n L\nib\nra\nry\n] \nAt\n: \n09\n:5\n7 \n29\n J\nun\ne \n20\n10\nN paying particular attention to discussing ‘negatives’ (absences, disappointments,\nfrustrations and conflicts).\nOur hypothesis was that such a model of CPD would assist staff to reflect and\nprocess their own feelings, thus enabling them to be more thoughtful about\nthemselves and the children. The staff might then be more empathic to children’s\nconflicts and losses, more ready to engage in emotionally close and sustained\ninteraction and less distanced from painful experiences.\nThis paper reports on an action research study in which we worked with a group of\nnursery heads in one local authority using this model. The aim was to explore the\nheads’ experience of the CPD and compare it with other models of CPD they had\nexperienced.\nMethodology\nResearch design\nThe model of CPD explored in this paper is seeking to engage practitioners in a\nthoughtful and participatory exchange on the tensions in managing personal\nresponsiveness to children within professional parameters. Following recent\ndiscussion about power differentials in training and CPD (Colley, 2006;\nManning-Morton, 2006; Osgood, 2006), the model adopts action research\nprinciples, which have their roots in both the systematic gathering of information\n(research) and the use and control of this information by practitioners to inform and\nchange their own practice (action) (Robson, 1993; Cohen et al., 2000; Noffke &\nSomekh, 2005).\nPractitioners have significant personal power in how they choose to respond to\nchildren, despite the constraints of organisational factors. Our aim was to establish a\nCPD process encouraging participants to speak openly about the difficulties of\nemotionally close professional work with children. We pursued this through building\ngroup feelings of safety and trust, but enabling the heads to recognise the degree of\ncontrol they held over their interactions with children and their openness in\ndiscussing them. In keeping with this aim of getting close to the real dynamics of the\nheads’ daily interactions, analysis of all the data was undertaken using grounded\ntheory (Strauss & Corbin, 1988). Heads’ written evaluations were anonymous and\nseen only by us.\nWhose questions?\nThe questions we wished to explore with the heads were:\n1. What are the necessary elements to facilitate an emotionally containing CPD\nprocess?\n2. How would such a process be experienced by participants?\n3. How would participants experience the effectiveness of this model in\nstrengthening practice?\nNurseries and emotional well-being 271\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nDo\nug\nla\ns,\n A\nng\nel\na]\n[T\nav\nis\nto\nck\n a\nnd\n P\nor\ntm\nan\n L\nib\nra\nry\n] \nAt\n: \n09\n:5\n7 \n29\n J\nun\ne \n20\n10\nWe were mindful however, that within an action research method, research\nquestions and findings are in a continuous state of evolution:\n… the cyclical process of action research does not come to a natural conclusion\nalthough at some point it is necessary to bring it to a close and publish the outcomes in\nsome form. (Noffke & Somekh, 2005, p. 89)\nCPD design\nThe CPD was structured in two phases. Phase One was conducted withnursery\nheads, over four full days, held at monthly intervals from September to December\n2005, each comprising two sessions of two and a half hours and one hour for lunch.\nEach day included two taught topics concerning children’s emotional well-being, an\nopen discussion concerning the heads’ thinking since the last session and a\ndiscussion of holistic child observations (Rustin, 1989; Elfer, 2005) undertaken by\nthe heads.\nPhase Two was conducted from February to May 2006 with the heads working in\npairs with their own staff groups using the same CPD model. Three half-day support\nmeetings and one half-day evaluation meeting were held for the heads.\nTrainers and participants\nOur professional backgrounds (an early years lecturer and a child psychoanalytic\npsychotherapist) ensured a combination of knowledge of nursery practice and of\ngroup process skills. We were supervised by an experienced consultant in group\nprocesses between each of the Phase One sessions and continuing less frequently for\nthe duration of Phase Two.\nTwelve heads (10 LEA and two voluntary sector) were invited by the senior early\nyears development officer of the local authority on the basis of their interest and\navailability to participate.\nEvaluation strategy\nThe evaluation strategy included five elements:\n1. A contemporaneous detailed record was made of the discussions and\ninterpretations of process and group dynamics during each session including\ncomments and ideas from the heads.\n2. The heads had dedicated time at the end of each day to discuss their views on\nthe day’s process and content without interruption from us. The heads also\ncompleted an anonymous written feedback form.\n3. During Phase Two we met with the heads to offer support and to hear their\ninterim evaluations of implementing the CPD with their own staff.\n4. The heads’ own staff teams also completed evaluation forms.\n5. Taped discussions were conducted with a random sample of four heads, four\nmonths after completion of Phase Two.\n272 P. Elfer and K. Dearnley\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nDo\nug\nla\ns,\n A\nng\nel\na]\n[T\nav\nis\nto\nck\n a\nnd\n P\nor\ntm\nan\n L\nib\nra\nry\n] \nAt\n: \n09\n:5\n7 \n29\n J\nun\ne \n20\n10\nProcess and evaluation data from Phase One\nOn the first day, our anxiety to deliver the planned content of the day (introduction\nto working and thinking together and transition to nursery) meant that we did not\nallow enough time for the group to meet and settle. Equally, the group seemed\nprotectively cautious, talking largely about their external managerial roles. When we\ndid try to explore what they said we were told we were being philosophical and that it\nwas too early in the morning for that! The message seemed to be that our timing was\npremature, the group viewing exploration as potentially critical and not as a way of\ndeveloping ideas together.\nNext, an observation of a child at the end of his day in nursery was presented. The\nchild is tired, other children are departing and he becomes distressed but receives\nlittle attention. The heads’ initial response was to be critical of the style of the\nobservation—‘this is not how we were taught to observe’—possibly another\nreference to the sense of unfamiliar territory. They were also adamant that this\nabsence of attention would not happen in their own nurseries. Again, they seemed\ndefensively critical, seeming to preclude reflection on why distressed children may go\nunnoticed in nursery. We were also worried by a sub-group of three heads, who were\nsilent and non-participating.\nIn the taught topic (transitions to nursery), we invited the heads to experiment\nwith a variety of unfamiliar sensory experiences. This seemed to enable them to\nexperience how powerful the impact of new situations might be, for example what\nmight it be like for a baby to bury her head in a heavily scented neck? One\nhead recalled her experience of having water in a plastic cup ‘shoved down my neck\nas a child’. It seemed as if the group was, in part, speaking to the disjuncture\nbetween our and the group’s agenda: we could not force them to take in what was on\noffer.\nA prominent theme of this first day was of defensiveness. For us, the anxiety\nconcerned whether this model would be seen as effective by the heads. The anxiety\nexpressed itself in the form of preoccupation with roles and too much planning,\ncontradictory given our endeavours to be process focussed. For the participants, we\nfelt the anxiety expressed itself in caution about what they were prepared to consider\nand contribute to discussions. However, the evaluative discussion and written\nfeedback was uniformly positive. They spoke of ‘permission to act and respond\ninstinctively’ and of the greater effectiveness of this type of discussion.\nThe second day was started by one head, saying ‘we all feel…’ without reference to\nothers. This seemed to preclude the possibilities of different viewpoints. This\nabsence of difference also emerged when a head told us she ‘mucked in’ with her\nstaff, seeming to avoid issues of seniority and authority.\nHowever later, another head, faced with a complaint about workloads, described\nhow she had sought to impose a fairer distribution of tasks including nappies being\nchanged by one person at one time. This had resolved the complaint, but was not\nnecessarily in the children’s interests and the head was self-critical. Here, in their\ndiscussion of this dilemma, the group did seem to be able to accommodate different\nviews without anyone necessarily holding a ‘right’ solution.\nNurseries and emotional well-being 273\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nDo\nug\nla\ns,\n A\nng\nel\na]\n[T\nav\nis\nto\nck\n a\nnd\n P\nor\ntm\nan\n L\nib\nra\nry\n] \nAt\n: \n09\n:5\n7 \n29\n J\nun\ne \n20\n10\nThe discussions on the third taught topic (the scope of social and emotional\ndevelopment in official guidance) turned to the dangers of children ‘not being\nnoticed’. This renewed in our minds a concern about the three non-participating\nheads perhaps feeling ‘not noticed’. It raised the dilemma too of the tensions in\ngroup priorities, to pursue the concrete ‘taught’ agenda or the more tenuous thread\nof what might be passing ‘unnoticed’.\nDuring the fourth taught topic (personality development), the discussion revolved\naround feeding experiences. As the session ended one head told us that as part of her\ntraining she was taught to swaddle and force-feed babies and there was a sense of\nshock in the group. Our dilemma was about overrunning time. To continue could\ngive the group the message that this was too serious to stop. If we stopped then it\ncould be felt as if this was something we did not want to hear and a painful disclosure\nmight not be processed.\nThe struggle with allowing differences to emerge and the disclosures about force\nfeeding seemed to represent a struggle with how things are ‘taken in’. Challenges had\nemerged for us too, holding different views of the balance between teaching and\nattention to group process. Further, should time boundaries be maintained when\nsome painful difficulty arises?\nThe heads’ evaluations were again all positive but included comments such as ‘this\nis different and sometimes more difficult than just being taught’. Others noted the\nemerging links between staff experience and interactions with children.\nOn day three, the group commented on how much more attentive they felt\ntowards particular children who often seemed overlooked and towards the non-\nverbal behaviours of staff and children. Following the fifth teaching topic (team\nwork), the group returned later than agreed after coffee and we asked about this.\nWith humour they insisted that the clocks in the canteen were slow although most\nwore wrist watches. At one level, this could be understood as ordinary latitude about\nadhering to agreed times. Underneath this, however, it seemed representative of the\ngap between decisions teams make and how these are then implemented or avoided.\nTheir slight lateness was an opportunity to think about this gap in action and the\nreality of staff agency.\nDiscussion (arising from the sixth topic, attachments and key-person relation-\nships) concerned a staff member who was so afraid of children’s dislike or anger that\nshe could not easily be firm or help a child manage separation, leading to some\ndisturbed and anxious behaviour. Her team wanted the head to intervene but the\nhead said she felt she would be criticised whatever she did, by the staff who wanted\nher to act, or the staff member who could not bear separation. The group considered\nhow the head seemed paralysed by the same anxiety as the staff member, unable to\nface angry reactions. In the end, separation occurred as the child had to move to the\nnext age-group room and the personal and professional dilemma was avoided,\npresumably only to emerge again with another child.\nThe head’s evaluations were again positive with indications of a new depth of\nreflection:\nThis is really making me think about what is happening in the nursery\n274 P. Elfer and K. Dearnley\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nDo\nug\nla\ns,\n A\nng\nel\na]\n[T\nav\nis\nto\nck\n a\nnd\n P\nor\ntm\nan\n L\nib\nra\nry\n] \nAt\n: \n09\n:5\n7 \n29\n J\nun\ne \n20\n10\nAlthough these evaluations were anonymous, no negative comments were forth-\ncoming, yet three quiet staff continued to concern us.\nOn day four, with three heads absent, discussion (concerning children’s behaviour\nin nursery and family context) turned to a child who had taken against her key\nperson, who had felt hurt and rejected. The head felt that it was best to allocate\nanother key person. We discussed the risk that a child may understand the change as\nhappening because her feelings of dislike are experienced as unmanageable. Another\nhead described a child who always turned self-assuredly away from her when she\nentered the room. She suggested that she could bear the discomfort of being rejected\nby the child because she was experienced and secure within herself. Yet it seemed\nvery difficult to discuss the possible rejection of the group by the absentees.\nThe evaluations were again positive with comments valuing how the group had\nbecome more willing to share experiences and how the CPD had illuminated how\ntheir experiences and beliefs affected the way they managed their nurseries. Sadness\nabout the end of Phase One and anxiety about Phase Two were also expressed.\nProcess and evaluation data from Phase Two\nSupport meetings were held with the heads as they worked with their own staff\ngroups during Phase Two. Data included our notes of these discussions and\nindividual written anonymous evaluations from the heads and the staff they were\nworking with. These data partly concerned their further reflections on Phase One,\nincluding some initially negative feelings leading to uncertainty and anxiety about\nthe value and purpose of the model. However, the positive experiences from Phase\nOne (relief at being listened to; their personal and professional identities being\nsupported; and the validation of social and emotional development as an important\nintegral aspect of children’s experience) were sustained. There was a new pleasure\nand satisfaction too at being able to deploy group facilitation skills and seeing the\ngrowing confidence of their own staff.\nThese have been valuable in triangulating the positive evaluations given by the\nheads at the end of each of the individual Phase One sessions. The positives have\nremained consistent even when the heads’ evaluation of the model was being ‘tested’\nby their own direct use of it.\nTurning to the views of the staff trained by the heads during Phase 2, 90%\n(N567) of their evaluations rated this CPD more likely to have a greater impact on\ntheir work than previous training experience. However, our hypothesis was that an\nemotionally containing CPD process would lead to greater emotional responsiveness\nof staff to children. What the staff actually reported as most helpful was positive\nshifts in team interactions, building team relationships and the process of beginning\nto exchange ideas and to discover differences (75%). References to having a clearer\nfocus on the child’s perspective were present (20%) but much less frequent. This\ndoes not negate the hypothesis but suggests that the process of bringing about\nsignificant change for children is at least a two-stage process rather than a direct one,\nin which staff first strengthen their own professional relationships together. The\ncritical question then becomes whether these do translate into positive changes in\nNurseries and emotional well-being 275\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nDo\nug\nla\ns,\n A\nng\nel\na]\n[T\nav\nis\nto\nck\n a\nnd\n P\nor\ntm\nan\n L\nib\nra\nry\n] \nAt\n: \n09\n:5\n7 \n29\n J\nun\ne \n20\n10\nstaff interactions with children. The heads’ final evaluations (see below), offered\nsome provisional affirmative evidence.\nWhat staff found difficult was having to sit still for a long time (36%) and the\n‘intensity of thinking’ involved, beginning to think about childhood experiences\n(their own and colleagues’), and the possible influence of these on working\ninteractions with children (24%). They also referred to the challenge of speaking in\ngroups (20%).\nThe first of these has obvious implications for the duration of CPD for a\npractitioner group used to continual activity. However, further work is needed to\nexplore how much it is ‘staying with’ difficult ideas and experiences rather than\n‘staying still’ in itself that is most difficult.\nAt follow-up with the heads four months after completion of Phase Two, the\npositive assessment of the CPD remained stable. The heads’ retrospective reflections\nreferred again to participation in Phase One (the heads’ group) as an essential\nlearning experience in order to be able to facilitate Phase Two. It also referred to the\ndiscomfort involved in thinking about their own childhood experiences and those of\ncolleagues and possible links with their work with children. Here, the trust in the\nheads’ group itself was both brought about by and facilitated the sharing of painful\nexperiences, although a minority had either declined to participate or contributed\nvery little, perhaps because it was too painful.\nThese final evaluations added convincing illustrations of changes in interactions\nwith children and parents, which often involved an increased capacity for ‘negative’\nemotion:\nN allowing a child to be upset when her parents departed in the morning, being\nalongside and not trying too quickly to distract her;\nN reviewing the timing of the transition of a boy to the next age-group room with the\nkey person from each room and his parents and recognising that, due to the arrival\nof a baby sister, the move should be delayed; this was linked to how disturbing this\nhad sometimes felt for the heads when there had had to be room changes during\nPhase One;\nN increased consciousness of the impact on children when practitioners entered and\nleft rooms, particularly towards the end of the day when some children were\nanxious about being collected;\nN linking experiences of oppression in practitioners’ own childhoods and the use\nand misuse of power in nursery interactions;\nN increased empathy for a mother who had been judged ‘overprotective and\ndemanding’, when the staff were able to think about the impact on this mother of\nher child’s near-fatal illness before coming to nursery.\nResearch questions\nWhat are the necessary elements to facilitate an emotionally containing CPD process?\nFirst, it would be problematic to manage with only one trainer. Two enables one to\nbe attentive to conscious rational learning whilst the other is attentive to group\n276 P. Elfer and K. Dearnley\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nDo\nug\nla\ns,\n A\nng\nel\na]\n[T\nav\nis\nto\nck\n a\nnd\n P\nor\ntm\nan\n L\nib\nra\nry\n] \nAt\n: \n09\n:5\n7 \n29\n J\nun\ne \n20\n10\nprocesses and the possible significance of silences and shifting group states. Most of\nthe heads said that it took one or two sessions before they felt they acclimatised to\nthe process. Therefore it is important not to underestimate the time needed for a\ngroup to establish itself.\nThere was a tendency to revert to ‘delivery of training’ mode, a more known and\naction-orientated way of functioning. Timing was important here too, allowing\napparently ‘not much to happen’. The maintenance of boundaries mattered as well,\nto help contain the group and to acknowledge personal disclosures, which are likely\nwhen the participants experience a group as ‘safe’. However, full discussion of such\ndisclosures in a professional development group may not be appropriate.\nFinally, supervision for us with a more experienced group leader proved valuable\nin thinking about and managing our responses to the group.\nHow was this process experienced by the practitioners?\nDrawing on all the sources of evaluation data, the main points of experience from the\nheads and their staff were, first, relief at the opportunity to discuss issues of the\nemotional well-being of very young children and a valuing of a process in which their\nown experience, personal and professional, was uppermost. In this respect, the\nsharing of some of their own early childhood experiences and how it contributed to\nbuilding trusting team relationships and enabling insight into the possibilities of the\nchildren’s experiences was cited.\nHowever, these discussions were not necessarily easy and often involved\ndiscomfort and upset. The heads acknowledged that when discussion was too\npainful or threatening, it could be avoided in a number of ways (for example by\ntalking only in generalities, talking for the whole group, perceiving the trainers as\ncritical, blaming external groups, externalising issues or silence). Our formal support\nwas important, as were the informal networks that developed during the breaks.\nHow did participants experience the effectiveness of this model in strengthening practice?\nThe mainly positive evaluations of the heads and staff were given added credibility\nby specific examples of the positive change in work with children and families\nillustrated earlier.\nThere remained a paradox. The course discussion showed again and again the\nemotional complexity of nursery work. After this action research was completed,\nresources were negotiated for the group to continue with new trainers.\nMost of the heads were committed to ensuring the continuation of the work with\ntheir own staff groups and said they would value this ongoing support. Yet they did\nnot take it up. This was discussed at the follow-up evaluation stage, where significant\npractical and emotional obstacles were cited.\nThese included the feeling that the group, having established a relationship with\nus, were reluctant to make the transition to new trainers. Institutionally, this was not\na coherent group in the overall organisation of the LEA, the heads were not\nunanimous in their desire to continue and two heads had changed role. The CPD\nNurseries and emotional well-being 277\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nDo\nug\nla\ns,\n A\nng\nel\na]\n[T\nav\nis\nto\nck\n a\nnd\n P\nor\ntm\nan\n L\nib\nra\nry\n] \nAt\n: \n09\n:5\n7 \n29\n J\nun\ne \n20\n10\nhad finished and there was an understandable ambivalence about continuing with\nwhat had at times been an uncomfortable experience. The heads who wanted to\ncontinue also wondered whether continuing to participate would be viewed by\nothers as a sign of strength (openness to critical appraisal of practice) or as a sign of\nweakness (in need of extra help).\nConclusion\nAs increasing emphasis is given to the emotional well-being of children in nursery, it\nis important to evaluate new methods of CPD to facilitate this. The model discussed\nin this paper, based on psychoanalytic insights into group learning, is one such\nmethod. The discussions highlighted the emotional complexity of the work and\nintensity of demands on staff. The evaluations showed evidence of considerable\nexperiential learning and reported significant shifts in interactions with children and\nparents. However, the research also showed how demanding such a CPD process is\nand that it would be difficult to manage without two trainers who have early years\nexperience and psychoanalytic group facilitation skills. Provision for a reflective\nspace needs to be built in as an institutional requirement, rather than an individual\nrequest. Senior management must be committed if the organisational structures are\nto support reflective practice in a systematic and ongoing way. It needs to be\nrecognised that resources have to be allocated for the time and facilitation for staff to\nthink about and process the individual feelings evoked by their emotional work with\nthe children. This involves an attitudinal shift too, seeing reflective practice as an\nentitlement of staff, both legitimate and necessary, if changes in professional practice\nare to be facilitated and sustained.\nReferences\nBain, A. & Barnett, L. (1986) The design of a day care system in a nursery setting for children under five,\nDocument No. 2T347 (London, Tavistock Institute of Human Relations [TIHR]).\nBlenkin, G. & Hutchin, V. (1998) Action research, child observation and professional\ndevelopment: some evidence from a research study, Early Years: An International Journal\nof Research and Development, 19(1), 62–75.\nBrooks-Gunn, J., Sidle-Fuligni, A. & Berlin, L. J. (Eds) (2003) Early child development in the 21st\ncentury: profiles of current research initiatives (New York, Teachers College Press).\nCohen, L., Manion, L. & Morrison, K. (2000) Research methods in education (5th edn) (London,\nRoutledge Falmer).\nColley, H. (2006) Learning to labour with feeling: class, gender and emotion in childcare\neducation and training, Contemporary Issues in Early Childhood, 7(1), 15–29.\nDepartment for Education and Skills (DfES) (2002) Birth to three matters: a framework for\nsupporting early years practitioners (London, DfES SureStart Unit).\nDepartment for Education and Skills (DfES) (2006) Personal, social and emotional development\ntraining materials – birth to five (London, DfES SureStart Unit).\nDepartment for Education and Skills\/Department for Work and Pensions (DfES\/DWP) (2006)\nThe Early Years Foundation Stage: consultation on a single quality framework for services to\nchildren from birth to five (London, DfES Publications).\nElfer, P. (2005) Observation observed, in: L. Abbott & A. Langston (Eds) Birth to three matters\n(Buckingham, Open University Press).\n278 P. Elfer and K. Dearnley\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nDo\nug\nla\ns,\n A\nng\nel\na]\n[T\nav\nis\nto\nck\n a\nnd\n P\nor\ntm\nan\n L\nib\nra\nry\n] \nAt\n: \n09\n:5\n7 \n29\n J\nun\ne \n20\n10\nElfer, P. (2007) Babies and Young Children in Nursery: Using psychoanalytic ideas to explore\ntasks and interactions, Children and Society, 21(2).\nElfer, P., Goldschmied, E. & Selleck, D. (2003) Key persons in the nursery: building relationships for\nquality provision (London, David Fulton).\nFrench, R. (2005) Organisation in the mind: psychoanalysis, group relations and organisational\nconsultancy. Occasional Papers of David Armstrong 1989–2003 (London, Karnac).\nGarland, C. & White, S. (1980) Children and day nurseries (London, Grant McIntyre).\nGoldschmied, E. & Jackson, S. (1994) People under three: young children in day care (London,\nRoutledge).\nHalton, W. (1994) Some unconscious aspects of organisational life: contributions from\npsychoanalysis, in: A. Obholzer & V. Z. Roberts (Eds) The unconscious at work: individual\nand organizational stress in the human services (London, Routledge).\nHinshelwood, R. D. & Skogstad, W. (2000) Observing organisations: anxiety, defence and culture in\nhealth care (Hove, Brunner-Routledge).\nHobson, P. (2002) The cradle of thought (London, Macmillan).\nHopkins, J. (1988) Facilitating the development of intimacy between nurses and infants in day\nnurseries, Early Child Development and Care, 33, 99–111.\nKennedy, A. (2005) Models of continuing professional development: a framework for analysis,\nJournal of In-Service Education, 31(2), 235–250.\nManning-Morton, J. (2006) The personal is professional: professionalism and the birth to three\npractitioner, Contemporary Issues in Early Childhood, 7(1), 42–52.\nMarshall, T. (1982) Infant care: a day nursery under the microscope, Social Work Service,\nNo. 32(Winter), 15–31.\nMelhuish, E. (2004) Child benefits: the importance of investing in quality childcare (Facing the Future:\nPolicy Papers) (London, Daycare Trust).\nMenzies-Lyth, I. (1988) Containing anxiety in institutions: selected essays (vol. 2) A report on a study of\nthe nursing service of a general hospital (London, Free Association Books).\nMooney, A. & Munton, A. (1997) Research and policy in early childhood services: time for a new\nagenda (London, Institute of Education, Thomas Coram Research Unit).\nMunton, A., Mooney, A. & Rowland, L. (1996) Helping providers to improve quality of day-care\nprovision: theories of education and learning, Early Child Development and Care, 1184,\n15–25.\nNoffke, S. & Somekh, B. (2005) Action research, in: B. Somekh & C. Lewin (Eds) Research\nmethods in the social sciences (London, Sage Publications).\nObholzer, A. & Roberts, V. Z. (1994) The unconscious at work: individual and organizational stress in\nthe human services (London, Routledge).\nOsgood, J. (2006) Professionalism and performativity: the feminist challenge facing early years\npractitioners, Early Years: An International Journal of Research and Development, 26(2),\n187–200.\nRobson, C. (1993) Real world research (Oxford, Blackwell).\nRustin, M. (1989) Observing infants: reflections on methods, in: L. Miller, M. Rustin, M. Rustin\n& J. Shuttleworth (Eds) Closely observed infants (London, Duckworth).\nRutter, M. (1995) Clinical implications of attachment concepts: retrospect and prospect, Journal\nof Child Psychology and Psychiatry, 36(4), 549–571.\nSmith, C. & Vernon, J. (1994) Day nurseries at a crossroads: meeting the challenge of child care in the\nnineties (London, National Children’s Bureau).\nStrauss, A. & Corbin, J. (1998) Basics of qualitative research: techniques and procedures for developing\ngrounded theory (London, Sage Publications).\nStanley, K., Bellamy, K. & Cooke, G. (2006) Equal access? Appropriate and affordable childcare for\nevery child (London, Institute for Public Policy Research).\nTrowell, J. & Bower, M. (1995) The emotional needs of young children and their families: using\npsychoanalytic ideas in the community (London, Routledge).\nNurseries and emotional well-being 279\nD\no\nw\nn\nlo\nad\ned\n B\ny:\n [\nDo\nug\nla\ns,\n A\nng\nel\na]\n[T\nav\nis\nto\nck\n a\nnd\n P\nor\ntm\nan\n L\nib\nra\nry\n] \nAt\n: \n09\n:5\n7 \n29\n J\nun\ne \n20\n10\n"}