{"doi":"10.1080\/0968776990070108","coreId":"14282","oai":"oai:generic.eprints.org:292\/core5","identifiers":["oai:generic.eprints.org:292\/core5","10.1080\/0968776990070108"],"title":"Supporting organizational change: Fostering a more flexible approach to course delivery","authors":["Hart, Gail","Ryan, Yoni","Bagdon, Kerry"],"enrichments":{"references":[{"id":199488,"title":"Globalising Education: Trends and Applications,","authors":[],"date":"1998","doi":"10.5860\/choice.36-6411","raw":"Mason, R. (1998), Globalising Education: Trends and Applications, London and New York: Routledge.","cites":null},{"id":199487,"title":"Improving the Practice of Mental Health Nursing in Rural and Remote Communities, A Report for the Rural Health Support,","authors":[],"date":"1998","doi":null,"raw":"Hart, G., Ryan, Y., Williams, H. and Lunney, P. (1998), Improving the Practice of Mental Health Nursing in Rural and Remote Communities, A Report for the Rural Health Support, Education and Training Program of the Commonwealth Department of Human Services and Health, Canberra.","cites":null},{"id":199486,"title":"Technology, Open Learning and Distance Education,","authors":[],"date":"1995","doi":"10.1080\/0268051880030302","raw":"Bates, A. (1995), Technology, Open Learning and Distance Education, London: Routledge. Cunningham, S., Tapsall, S., Ryan, Y, Stedman, L., Bagdon, K. and Flew, T. (1998), New Media and Borderless Education, Canberra: Australian Government Publishing Service.","cites":null},{"id":199489,"title":"The Digital Edge: Teaching and Learning in the Knowledge Age,","authors":[],"date":"1997","doi":null,"raw":"Rossiter, D. (1997), The Digital Edge: Teaching and Learning in the Knowledge Age, Brisbane: QUT.","cites":null},{"id":199490,"title":"The Unconscious Civilization,","authors":[],"date":"1997","doi":"10.5860\/choice.34-5948","raw":"Saul, J. R. (1997), The Unconscious Civilization, Ringwood: Penguin.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1999","abstract":"Queensland University of Technology (QUT) adopted a flexible delivery policy in 1996. The main objective of the policy was to develop a more student‐centred approach to teaching and learning, since QUTs student population is predominantly part‐time, ‘mature age’, already in employment, and very diverse in cultural and academic background For many staff, the policy was threatening: staff were uncertain where they might begin to adapt their traditional face‐to‐face teaching approaches to overcome the limitations associated with time and place, and they were fearful that their teaching role and academic expertise might be superseded by a technological alternative. They lacked confidence to incorporate appropriate and relevant technologies in an innovative and effective way to support student learning objectives. This paper focuses on the implementation of QUTs policy. It highlights the role of a central services department, Teaching and Learning Support Services (TALSS), in providing training and fostering cultural change across the university. The implementation was guided by a model of flexible education and a set of principles underpinning a ‘whole of organization approach to flexible delivery. Strategies for supporting innovators, sharing experience across disciplines, co‐ordinating and focusing the support of educational developers, and embedding staff development processes are outlined The success and limitations of the organizational change strategy are summarized as ‘lessons learned’ to inform ongoing institutional policy and procedures","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14282.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/292\/1\/ALT_J_Vol7_No1_1999_Supporting%20organizational%20chan.pdf","pdfHashValue":"00a5e1d760b86b5764cab95cf7f30a50a26790d1","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n  \n    \n    \n      oai:generic.eprints.org:292<\/identifier><datestamp>\n      2011-04-04T09:17:40Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/292\/<\/dc:relation><dc:title>\n        Supporting organizational change: Fostering a more flexible approach to course delivery<\/dc:title><dc:creator>\n        Hart, Gail<\/dc:creator><dc:creator>\n        Ryan, Yoni<\/dc:creator><dc:creator>\n        Bagdon, Kerry<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Queensland University of Technology (QUT) adopted a flexible delivery policy in 1996. The main objective of the policy was to develop a more student‐centred approach to teaching and learning, since QUTs student population is predominantly part‐time, ‘mature age’, already in employment, and very diverse in cultural and academic background For many staff, the policy was threatening: staff were uncertain where they might begin to adapt their traditional face‐to‐face teaching approaches to overcome the limitations associated with time and place, and they were fearful that their teaching role and academic expertise might be superseded by a technological alternative. They lacked confidence to incorporate appropriate and relevant technologies in an innovative and effective way to support student learning objectives. This paper focuses on the implementation of QUTs policy. It highlights the role of a central services department, Teaching and Learning Support Services (TALSS), in providing training and fostering cultural change across the university. The implementation was guided by a model of flexible education and a set of principles underpinning a ‘whole of organization approach to flexible delivery. Strategies for supporting innovators, sharing experience across disciplines, co‐ordinating and focusing the support of educational developers, and embedding staff development processes are outlined The success and limitations of the organizational change strategy are summarized as ‘lessons learned’ to inform ongoing institutional policy and procedures.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        1999<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/292\/1\/ALT_J_Vol7_No1_1999_Supporting%20organizational%20chan.pdf<\/dc:identifier><dc:identifier>\n          Hart, Gail and Ryan, Yoni and Bagdon, Kerry  (1999) Supporting organizational change: Fostering a more flexible approach to course delivery.  Association for Learning Technology Journal, 7 (1).  pp. 46-53.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776990070108<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/292\/","10.1080\/0968776990070108"],"year":1999,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Supporting organizational change: fostering a\nmore flexible approach to course delivery\nGail Hart, Yoni Ryan and Kerry Bagdon\nTeaching and Learning Support Services, Queensland University of Technology,\nemail: g.hart@qutedu.au\nQueensland University of Technology (QUT) adopted a flexible delivery policy in 1996.\nThe main objective of the policy was to develop a more student-centred approach to\nteaching and learning, since QUTs student population is predominantly part-time,\n'mature age', already in employment, and very diverse in cultural and academic\nbackground For many staff, the policy was threatening: staff were uncertain where they\nmight begin to adapt their traditional face-to-face teaching approaches to overcome the\nlimitations associated with time and place, and they were fearful that their teaching role\nand academic expertise might be superseded by a technological alternative. They lacked\nconfidence to incorporate appropriate and relevant technologies in an innovative and\neffective way to support student learning objectives. This paper focuses on the\nimplementation of QUTs policy. It highlights the role of a central services department,\nTeaching and Learning Support Services (TALSS), in providing training and fostering\ncultural change across the university. The implementation was guided by a model of\nflexible education and a set of principles underpinning a 'whole of organization\napproach to flexible delivery. Strategies for supporting innovators, sharing experience\nacross disciplines, co-ordinating and focusing the support of educational developers, and\nembedding staff development processes are outlined The success and limitations of the\norganizational change strategy are summarized as 'lessons learned' to inform ongoing\ninstitutional policy and procedures.\nOrganizational contexts\nIn Australia, as in the UK, the political, economic and technological contexts within which\nhigher education operates are shifting. Many commentators (e.g. Tiffin and Rajasingham,\n1995; Oblinger and Rush, 1997) have predicted that the outcomes for teaching and learning\nenvironments will be as shattering to the 'bricks and mortar' universities as the long-\npredicted tectonic plate shift which will swallow San Francisco.\n46\nAu-J VWume 7 Number I\nOur vision is less apocalyptic. Indeed, we are convinced from various research projects in\nwhich we have participated (Hart et al, 1998; Cunningham et ai, 1998) that the move to\nstudent-centred education, if it is genuinely embraced by universities, will result in a slow\nevolution of existing university environments.\nHowever, there is no doubt that the last decade has already produced many changes within\nuniversities worldwide. Classes are larger, student populations more diverse, both culturally\nand in terms of their preparation for independent learning. With the introduction of\ntuition fees and supplementary charges for support services such as computer access,\nstudents are becoming more discerning 'consumers'. They expect high-quality learning\nopportunities and better ancillary services. At the same time, public funding has been\nreduced as governments of mature economies seek to reduce their outlays by privatizing as\nmany of their traditional services as possible. Tertiary education has become a victim of its\nown success: in moving from an elite to a mass system, it has ceased to become a public\ninvestment by the community in its collective future, and has become a 'private good' (cf.\nSaul, 1997) requiring economic decisions as to its worth to individual students.\nWhether we view these changes with delight or dismay, the reality is that we must respond\nenergetically and responsibly to ensure that we continue to foster optimum learning\noutcomes for our students. Much of the burden of this work falls upon individual\nacademics. But the organizational culture within which teaching and learning occurs plays\nan increasingly important role in teaching, for several reasons:\n• the increasing use of technology in the delivery of learning materials means that\ninstitutions have new challenges, e.g. in the provision and\/or co-ordination of computer\nfacilities, to ensure access and equity prevail;\n• individual academics cannot master alone the intricacies of technology-aided com-\nmunication;\n• communication technologies are changing the nature of personal interactions, with less\nneed for face-to-face communication to resolve course enquiries or provide\nindividualized advice.\nAnalysis of QUT's student population in the late 1990s revealed a changed demographic to\npredominantly part-time and mature-age students. Students are attracted to QUT because\nof its strong industry and professional links, high rates of graduate employment, and\nreputation for applied research. Such a population seemed to demand more flexible\nadministrative and teaching approaches that could accommodate their part-time status,\nand their need for highly relevant professional qualifications. QUT is also a multi-campus\ninstitution with three campuses in the northern suburbs of Brisbane, creating consequent\ntravel difficulties for staff and students who operate across campuses. Hence the university\ndetermined to investigate and if necessary 're-engineer' its structure to accommodate\nchanging student needs and better prepare students for their professional futures. It was\nrecognized that cultural change was integral to any systemic change, as both Bates (1995)\nand Mason (1998) argue.\nThe term 'flexible delivery' is now widely used in Australia to describe an educational\napproach that takes advantage of technology and new procedures (such as automated\ntelephone or online enrolment) to allow students more choice in relation to the time and\n47\nGail Hart et al Supporting organizational change: fostering a more flexible approach to course delivery\nplace of their study experiences, and to bring greater efficiencies to an organization's\nadministrative practices. QUT introduced a flexible delivery policy in 1996.\nHowever, the launch of the policy prompted real concern amongst our staff. It coincided\nwith the first round of job losses in Australian universities and was linked with potential\nstaff retrenchments. The emphasis on unfamiliar technologies alienated staff who were\ncommitted to face-to-face teaching, and who feared their hard-won discipline expertise\nwould be de-valued in what they perceived to be an inevitable 'online university'. Our staff\nare not alone: University of Washington staff, USA, have protested strongly against the\n'de-humanization' of teaching via online courses (The Industry Standard, 12 June 1998, at\nttp:\/\/www.thestandard.net\/articles\/news_display\/0,1270,670,00.html).\nHowever, changing practice was perceived as an imperative at QUT, in order to maintain a\ncompetitive edge in the higher education sector and in response to the demands of an\nincreasingly discerning student body. The task facing the institution's management was to\ndevelop:\n• an organizational climate which diminished fear and encouraged appropriate change;\n• a support structure which built on staff strengths, and involved staff in devising their own\nsolutions to the problems of the external environment and the needs of their students;\n• a robust system, which could accommodate upgrades, software changes, and increasing\nbandwidth demands, as well as legal changes;\n• a support unit that provided the physical infrastructure and the initial\/ongoing\ntechnical advice, and specialist academic development staff who could bridge the divide\nbetween the 'techos' and the teachers.\nA model of flexibility in tertiary education\nThe first stage of the process was to develop a succinct definition of flexible delivery that\nmight serve to allay the fears of staff by focusing on the goal of meeting student needs,\nthus aligning staff and organizational goals. The focus on flexible delivery was intended to\nsignal to the university community that the strategy was underpinned by a commitment to\nincremental rather than radical change. Hence the following definition was developed:\nFlexible delivery refers to the use of a range of strategies and technologies to meet the\ndiverse needs of students regarding the location and time of study. Flexible delivery is\napplicable to both internal and external students (QUT Office of the Deputy-Vice-\nChancellor, 3 July 1998).\nThe Deputy-Vice-Chancellor's policy adviser, in consultation with key senior staff in the\nuniversity, prepared a discussion paper that was widely circulated and then tabled as a\npolicy document at Teaching and Learning Committee and then University Academic\nBoard. A model of flexible delivery was subsequently developed as a framework within\nwhich policy and procedures could be determined. We reiterate that integral to the\nemphasis on flexible delivery was recognition that flexibility was merely the visible tip of a\nsignificant cultural change to the traditional university model. Figure 1 represents the\nframework.\n48\nAa-J Volume 7 Number I\nEuan*\nMnatiaetara ^^^M\n«aH M..<» a g a j a ^ ^ ^ ^ ^ ^ H\nEJdMkia ^ ^ \" ^ ^ ^ ^ |\nttnjaiil Maadi ^ * ^ H\nCarricala Orsai\n•Uatntctutv l i n a M n g Strwc\n^ n\nttan\n•tow\ntur» kAaaWaa\n^ ^ ^ ^ ^ ^ ^ ^ ^ ^ ^ M | ^ ^ ^ OtawaaaUttnal\nHaw\nfigure \/: The flexible delivery framework\nThe structure signals that we see this model as requiring continuous adjustment, not to the\nextent of the changes of the last two years, but that the intersection of the ovals will always\nmean deliberate pressure on the organizational structure through management decision-\nmaking to support teaching and learning. We recognized that neither flexible learning nor\nflexible teaching can be mandated. Flexible learning depends on student needs and\nabilities. Flexible teaching rests on staff abilities such as discipline imperatives,\ncommitment to quality teaching, knowledge of and confidence in using a range of\ntechnologies. However, we could, by 're-engineering' our systems and structures, nurture an\norganizational culture which valued 'learning about teaching and learning in a new\ncontext' as its primary goal.\nPrinciples of an organizational approach to flexible delivery\nInforming the model and the decisions consequent on the policy were several core\nprinciples:\n• 'Flexibility' must be linked to specific learning objectives for each course and each\nsubject, based on objective knowledge of student needs and the subject's rationale.\nWhile academic judgements regarding these objectives must be the final arbiter of the\ntypes of flexibility introduced, academics must also be fully informed of their students'\nemerging needs, and the potential of technology to assist them in enhancing learning.\n• Student skills cannot be presumed in any pedagogic approach drawing on new\ntechnologies. Therefore, unlike the MIT Management for the 1990s Framework (Scott\nMorton, 1991), which focuses on strategy, structure, technology, management\nprocesses, and staff skills and roles, the QUT approach includes student skills and roles\nas a primary component.\n• Collaborative approaches drawing on the expertise of academics, technical and\nlearning support staff result in the best possible learning materials and teaching\nstrategies.\n• Staff development is embedded in the experience of actually developing flexible\noptions.\n• While individual academics must be encouraged to experiment and develop unique\nmaterials and strategies, sensible use of central resources means that investment must\n49\nGail Hart et al Supporting organizational change fostering a more flexible approach to course delivery\nbe largely directed in university-wide or faculty-wide initiatives which contribute to the\norganization as a whole.\n• The 'learning organization' must demonstrate its commitment to whole-of-institution\nchange by recognizing that university culture in particular is strongly individualistic\nand strongly decentralized. Hence support structures must balance the strengths of\ncentralized units of expertise with the strengths of localized and semi-autonomous\nunits of discipline and teaching knowledge.\n• Full evaluation must be integrated in the design and development of all flexible delivery\nstrategies and materials.\nImplementation\nOnce the initial policy on flexible delivery was disseminated throughout the university, a\nnumber of activities and processes were undertaken progressively (not always, we should\nadd, in a thoroughly planned way).\n• A series of information sessions explicated the changing contexts of higher education,\nexamples and demonstrations of flexible delivery within QUT and in other institutions,\nand how the administration was proposing to assist staff. These sessions were\nsponsored by the Senior Executive, thus ensuring that they had a high profile within the\nuniversity community.\n• The policy adviser to the Deputy-Vice-Chancellor undertook a data collection exercise\nto determine the extent of existing operational flexibility within the institution, and to\nfocus on the variety of ways 'flexibility' could be perceived and implemented. Currently\na more detailed pilot 'mapping' exercise is being undertaken within one faculty to\nunderstand better the impact of current initiatives and policy on the development of\nflexible practices, since we are convinced that information and staff consultation and\ninput are vital to policy development. Changed practice can only result from a sound\nknowledge base.\n• A series of commissioned divisional and departmental reviews over a two-year period\nfrom 1996 assessed the effectiveness of the central services supporting teaching and\nlearning, identified potential cost savings and recommended structural changes to\nimprove service provision. A three-staged restructuring process was implemented to\nforge synergies across previously separate units and ensure a more focused service. The\nresultant department is a large central unit, Teaching and Learning Support Services,\nproviding a broad range of technical, professional and pedagogical expertise to staff\nand students.\n• A drop-in centre, staffed part-time, was established and featured learning resources that\ncapitalized on technological advances such as data visualization and the range of\ncommercial CD-ROMs available, in a threat-free informal environment outside the\nformal training programme.\n• Since 1992, QUT has provided funding for innovative teaching and learning projects.\nAn internal evaluation of the grant scheme, following an earlier external evaluation,\nwas designed to ensure a closer alignment between the projects funded and strategic\nso\nALT-J Volume 7 Number I\nuniversity initiatives. The most important result has been our 'large grants', which\nprovide funding up to $150,000 over two years, for projects which embed flexible\ndelivery practices across a faculty, or between faculties. Projects must have the support\nof the relevant dean or deans.\n• Two extensive reports were commissioned from QUT staff with a knowledge of the\nexisting organizational culture; one examined the pedagogical dimensions of the new\ntechnologies (Rossiter, 1997), the other evaluated existing computer-assisted learning at\nQUT (Wilss, 1997). The intention was to inform decision-making relating to the\ncontribution that technology could make to increase flexibility.\n• The Division invested in infrastructure and initiatives which demonstrated to staff the\ncentral commitment to extending flexibility. Among these was a combined student help\ndesk, the student computing guide and the continued development of Datawarehouse\nas a teaching and learning vehicle as well as a management information system.\n• A Web site, 'Teaching and Learning on the Internet', dedicated to teaching with\ntechnology in various forms, was established with easy-to-use features, an inviting\ninterface, and links to QUT and international exemplars.\n• Specialist positions at senior levels were identified and have progressively been filled\nwith staff who combine both academic and technical expertise; the present authors are\nrespectively at professorial and senior policy adviser (educational media and flexible\ndelivery) levels.\nLessons learned\nThe key lessons we have learned from the processes and initiatives described above might\nprove useful to other institutions seeking to avoid wasteful pilot projects and 'wheel\nreinvention'.\n• The visible and energetic support of senior management is critical to any strategic\ninitiative involving cultural change and new approaches to teaching and learning. One\nof our successful faculties in 1998 admitted that had it not been for the criterion that\ntheir proposal for a grant must address flexibility, they would not have had to re-\nexamine the nature of their curriculum and their students' expressed needs, and hence\nwould not have realized how dated their teaching had become.\n• Notwithstanding early resistance to the notion of uniting the academic and\neducational technology support units, it became obvious that unless management\n'forced' the issue through amalgamation, the organizational culture would continue to\nbe dichotomized between the 'techos' and the teachers. The resultant unit is a team of\ngeneral and academic staff who bring their respective skills to catalyse flexible delivery\ninitiatives across and within disciplines and faculty units. The renamed and\nrestructured division (the Division of Information and Academic Services) has\nactivated a high-profile promotion of its staff development activities to complement its\nexisting reputation as a provider of technical and library services.\n• Publicizing the successes (and failures) of initiatives through the university avoids ad\nhoc and sporadic small projects which are not sustainable. Workshops, seminars,\n51\nGail Hart et al Supporting organizational change: fostering a more flexible approach to course delivery\nnewsletters, Web discussion groups, training programmes are all vital in this process.\nThe variety of information modes acknowledges the diverse learning approaches of\nstaff and students, and models flexibility.\n• Notwithstanding the energy and commitment of the part-time staff member\nappointed, the drop-in centre was not as successful as we had expected. We surmise that\nthis reflected its part-time status, its confinement to one campus, and the initial attitude\nof staff.\n• The early data collection exercises revealed that 'flexibility' was not clearly and widely\nunderstood among staff: for example, many academics reported that they used\npresentation software such as PowerPoint, with no apparent recognition that\ncomputer-developed overheads, of themselves, do not imply flexibility. In order to be\nused flexibly, overheads must be available on the Web or placed in the library for\nstudent access independent of the lecture context in which they are delivered. Such\ninformation has informed our staff development activities.\n• Restructuring organizations, particularly universities, with their fierce defence of\nterritories, is not without pain for many individuals. Tempering fear and reworking job\nresponsibilities, promoting team responsibility and collaboration while maintaining\nmorale, demand time-consuming negotiation processes which require sensitivity on the\npart of senior management. Accurate and timely information and communication, we\nhave found, assist to dispel the atmosphere of distrust which can easily arise.\nConclusion\nThere is no single template for organizational and cultural change within a university,\nanymore than there is a single template for online delivery. QUT has taken the view that far\nfrom inducing cataclysmic change in the shape of universities, the new technologies offer\nan opportunity for evolutionary development in approaches to teaching and learning,\nwhich can accommodate student and staff needs and abilities. That view is informed by a\nbelief that learning in organizations is a continuous and evolving process, and that focusing\non the purpose of the university, learning itself, we can develop appropriate institutional\nresponses.\nReferences\nBates, A. (1995), Technology, Open Learning and Distance Education, London: Routledge.\nCunningham, S., Tapsall, S., Ryan, Y, Stedman, L., Bagdon, K. and Flew, T. (1998), New\nMedia and Borderless Education, Canberra: Australian Government Publishing Service.\nHart, G., Ryan, Y., Williams, H. and Lunney, P. (1998), Improving the Practice of Mental\nHealth Nursing in Rural and Remote Communities, A Report for the Rural Health Support,\nEducation and Training Program of the Commonwealth Department of Human Services\nand Health, Canberra.\nMason, R. (1998), Globalising Education: Trends and Applications, London and New York:\nRoutledge.\n52\nALT-] Volume 7 Number I\nOblinger, D. and Rush, S. (eds.) (1997), The Learning Revolution: The Challenges of\nInformation Technology in the Academy, Bolton, MA: Anker.\nRossiter, D. (1997), The Digital Edge: Teaching and Learning in the Knowledge Age,\nBrisbane: QUT.\nSaul, J. R. (1997), The Unconscious Civilization, Ringwood: Penguin.\nScott Morton, S. (ed.) (1991), The Corporation of the 1990s: Information Technology and\nOrganizational Transformation, New York: Oxford University Press.\n'Teaching and Learning on the Internet', http:\/\/www.tals.dis.qut.edu.au\/tlow\/tlow.htm.\nTiffin, J. and Rajasingham, L. (1995), In Search of the Virtual Class: Education in an\nInformation Society, London: Routledge.\nWilss, L. (1997), Computer Assisted Learning at Queensland University of Technology:\nStudent Learning Process and Outcomes, Brisbane: QUT.\n53\n"}