{"doi":"10.1029\/2002JB002269","coreId":"96967","oai":"oai:generic.eprints.org:549\/core69","identifiers":["oai:generic.eprints.org:549\/core69","10.1029\/2002JB002269"],"title":"Dissolution\/precipitation mechanisms for diagenesis in sedimentary basins","authors":["Fowler, A. C.","Yang, Xinshe"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96967.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/549\/1\/2003.6.pdf","pdfHashValue":"23a4a33342ed07aaa7fd300d30d811dabe061537","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:549<\/identifier><datestamp>\n      2015-05-29T18:24:16Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4447:4D3836<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/549\/<\/dc:relation><dc:title>\n        Dissolution\/precipitation mechanisms for diagenesis in sedimentary basins<\/dc:title><dc:creator>\n        Fowler, A. C.<\/dc:creator><dc:creator>\n        Yang, Xinshe<\/dc:creator><dc:subject>\n        Geophysics<\/dc:subject><dc:date>\n        2003<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/549\/1\/2003.6.pdf<\/dc:identifier><dc:identifier>\n          Fowler, A. C. and Yang, Xinshe  (2003) Dissolution\/precipitation mechanisms for diagenesis in sedimentary basins.  J. Geophys. Res., 108  (B10).        <\/dc:identifier><dc:relation>\n        doi: 10.1029\/2002JB002269<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/549\/","doi: 10.1029\/2002JB002269"],"year":2003,"topics":["Geophysics"],"subject":["Article","PeerReviewed"],"fullText":"Dissolution \/precipitation mechanisms for diagenesis in\nsedimentary basins\nA. C. Fowler\nMathematical Institute, University of Oxford, Oxford, UK\nXin-She Yang\nFaculty of Engineering, University of Wales, Swansea, Singleton Park, Swansea, UK\nReceived 28 October 2002; revised 16 April 2003; accepted 28 May 2003; published 30 October 2003.\n[1] The transformation of hydrated clay minerals (smectite) to anhydrous forms (illite)\noccurs in the diagenesis of shales in sedimentary basins. The released pore water can lead\nto excess pore pressures and is of concern in oil drilling operations. Most simply, the\nprocess can be modeled as a first-order thermally activated reaction, but an alternative\ninterpretation is that diagenesis occurs via dissolution of smectite in free pore water and\nsubsequent precipitation of illite. We show how such a realistic model of diagenesis\ncan be included in a compactive model of the sediment\/pore water system, and by using\nthe limit of weak solubility (also known as solid density asymptotics), we show how an\nexplicit expression can be derived for the smectite dissolution rate, even when this is\nmediated by feldspar dissolution and other reactions. In certain circumstances, the reaction\nrate reduces to that of a simple first-order model. By solving the model we also show\nthat shale diagenesis provides a mechanism for the generation of fractures at depth in\nrapidly deposited sediments. When sedimentation is slow (or compaction is fast), the\nsmectite to illite transition occurs over a reaction window which typically lies below the\nequilibrated normally pressured part of the profile, but it does not generally contribute\nsignificantly to the overpressuring. INDEX TERMS: 1010 Geochemistry: Chemical evolution; 3210\nMathematical Geophysics: Modeling; 8105 Tectonophysics: Continental margins and sedimentary basins\n(1212); KEYWORDS: dissolution, precipitation, compaction, diagenesis, sedimentary basins\nCitation: Fowler, A. C., and X.-S. Yang, Dissolution\/precipitation mechanisms for diagenesis in sedimentary basins, J. Geophys.\nRes., 108(B10), 2509, doi:10.1029\/2002JB002269, 2003.\n1. Introduction\n[2] Diagenesis occurs in sedimentary basins when\nhydrated clay minerals such as smectite are converted to\nillite by a dehydration reaction. The process is facilitated by\nhigh temperatures and pressures, and the resultant water\nwhich is released invades the pore space. One consequence\nof this is that pore water pressures can be increased, thus\nleading to the phenomenon of over pressuring, which is of\nconcern in oil drilling operations. The purpose of the present\npaper is to provide a possible model for the mechanism of\ndiagenesis, and in particular to show how a description of the\nprocesses of smectite dissolution and quartz precipitation,\nmediated by the presence of potassium feldspar, can in\ncertain circumstances be effectively considered as occurring\nvia the kinetics of a simple nonlinear reaction scheme.\n[3] The conversion of smectite to illite has received a good\ndeal of attention in the literature. Eberl and Hower [1976]\nessentially treat the reaction using first-order kinetics as\nS k\u0001!I; ð1Þ\nwhere S denotes smectite and I denotes illite, with a\nthermally activated reaction rate\n\u0001 dS\ndt\n¼ kðTÞS; ð2Þ\nwhere the rate constant k is given by\nk ¼ k0 exp½\u0001E=RT \u0007: ð3Þ\nSuch a description would appear at best to be schematic,\ninsofar as the ‘‘reaction’’ is likely to occur through various\nsubsidiary processes. On the other hand, shale diagenesis\ndoes appear to ‘‘switch on’’ quite suddenly at temperatures\nof about 100\u0001C [Eberl and Hower, 1976; Abercrombie et\nal., 1994], and occurs throughout a diagenetic ‘‘window’’\nbetween about 100\u0001C and 200\u0001C. A thermally activated\nreaction rate constant such as equation (3) can mimic this\nbehavior if the activation energy E is relatively high. This\nsuggests that simple reaction kinetics may mimic a more\nrealistic scheme. On the other hand, Velde and Vasseur\n[1992] found that a two-step model was necessary to rep-\nresent their data. Part of our purpose is to establish\nconditions under which a detailed dissolution-precipitation\nprocess can be represented by a simpler scheme.\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 108, NO. B10, 2509, doi:10.1029\/2002JB002269, 2003\nCopyright 2003 by the American Geophysical Union.\n0148-0227\/03\/2002JB002269$09.00\nEPM 13 - 1\n[4] An alternative description to the first-order reaction\ninvolves the dissolution of smectite in pore water to form an\naqueous silica compound. At the same time, potassium\nfeldspar dissolves to yield potassium (and aluminium\nhydroxyl) ions in solution. These combine with the aqueous\nsilica compound and precipitate as illite, leaving aqueous\nsilica in solution, which can precipitate as quartz.\n[5] A common reaction scheme which includes the role\nof potassium feldspar is to write\n2Sþ KFs! 2Iþ 4QzðaqÞ þ 9H2O ð4Þ\n(Abercrombie et al. [1994] give the detailed chemistry),\nwhere KFs represents potassium feldspar, Qz(aq) is aqueous\nquartz (i.e., in solution), and H2O represents released pore\nwater. Huang et al. [1993] analyzed experimental and field\ndata and derived the reaction rate\n\u0001 dS\ndt\n¼ kðTÞ½Kþ\u0007S2; ð5Þ\nwhere [K+] is the potassium ion concentration, S is the\nrelative shale fraction of smectite (thus 1 \u0001 S = I is the\nrelative fraction of illite), and k(T ) is a temperature-\ndependent rate constant.\n[6] The rate (5) follows from equation (4) by application\nof the law of mass action but cannot legitimately be derived,\nsince equation (4) is a compound reaction. Our purpose in\nthe remainder of this paper is therefore to pose a model for\nsmectite dissolution and illite precipitation, with a view to\nestablishing conditions under which simplified rates such as\nequation (5) or (2) may be appropriate. Continuum models\nof the type we consider below have been presented before\n[e.g., Steefel and Lasaga, 1994; Aharonov et al., 1997], and\napplications to the generation of abnormal pore pressures\nhave been made [Wong et al., 1997]. Our approach differs in\nthat we use the weak solubility hypothesis to provide an\neffective reduction of the governing transport equations to a\nmuch simpler form, and we relate the solutions of the\nresultant model to our earlier work on fast and slow\ncompaction [Fowler and Yang, 1998]. In this way we\nprovide an insight into the potential importance of diagen-\nesis in the generation of high pore pressures.\n2. Precipitation\/Dissolution Model of Diagenesis\n[7] The processes of smectite dissolution, illite precipita-\ntion, K-feldspar dissolution, and quartz precipitation are\nwritten as the following sequence of reactions:\nSS\nR1\u0001!XL þ nH2O; ð6aÞ\nKFs\nR2\u0001!KþL þ AlðOHÞ\u0001L4 þ sSiOL2 ; ð6bÞ\nKþL þ AlðOHÞ\u0001L4 þ fXL R3\u0001! f IS þ SiOL2 ; ð6cÞ\nSiOL2\nRþ4Ð\nR\u00014\nQz: ð6dÞ\nSequentially, these represent smectite dissolution (super-\nscripts S, L refer to solids or aqueous phases, S is smectite,\nX is an aqueous silica combination, such as (for example)\nSi4O10(OH)2); potassium feldspar (KFs) dissolution to form\npotassium and aluminium hydroxyl ions and aqueous silica\nSiO2; illite precipitation via the combination of the silica\ncompound with potassium and aluminium hydroxyl ions;\nand finally the precipitation (or dissolution) of quartz (Qz)\nfrom the aqueous silica phase. The coefficients n, s, f are\nstoichiometric coefficients. The indicated rates Ri are the\nreaction rates of the various reactions.\n[8] In order to describe the evolution of the species\nconcentrations, we denote by S, X, I, K, A, L, Q and F the\nconcentrations of smectite, aqueous silica compound, illite,\npotassium ions, aluminium hydroxyl ions, aqueous silica,\nquartz, and feldspar. For the solid phases, the units are mol\nm\u00013 of solids; for the aqueous phases (assumed dilute), the\nunits are mol m\u00013 of pore water. If f is the porosity and the\npore fluid has velocity ul, the solid matrix has velocity us\n(the same for each solid phase), then conservation laws\nfollowing from equation (6) are the following:\n@\n@t\n1\u0001 fð ÞS½ \u0007 þ #\n 1\u0001 fð ÞSus½ \u0007 ¼ \u0001r1;\n@\n@t\nðfX Þ þ #\n fXul\u0001 \u0002 ¼ #\n ðfD #X Þ þ r1 \u0001 fr3;\n@f\n@t\nþ #\n ful\u0001 \u0002 ¼ nr1Mw=rw;\n@\n@t\n½ð1\u0001 fÞF\u0007 þ #\n ð1\u0001 fÞFus½ \u0007 ¼ \u0001r2;\n@ðfKÞ\n@t\nþ #\n fKul\u0001 \u0002 ¼ #\n ðfD #KÞ þ r2\u0001 r3;\n@ðfAÞ\n@t\nþ #\n fAul\u0001 \u0002 ¼ #\n ðfD #AÞ þ r2 \u0001 r3;\n@ðfLÞ\n@t\nþ #\n fLul\u0001 \u0002 ¼ #\n ½fD #L\u0007 þ sr2 þ r3 \u0001 rþ4 þ r\u00014 ;\n@½ð1\u0001 fÞQ\u0007\n@t\nþ #\n ð1\u0001 fÞQus½ \u0007 ¼ rþ4 \u0001 r\u00014\n@½ð1\u0001 fÞI \u0007\n@t\nþ #\n ð1\u0001 fÞIus½ \u0007 ¼ fr3;\nð7Þ\nwherein Mw is the molecular weight of water and rw is its\ndensity (thus rw\/Mw is its ‘‘concentration’’ in units of mol\nm\u00013 of pore water).\n[9] As well as advection, these equations include a\ndiffusion term for the aqueous components (but this is\nomitted for the water phase due to the diluteness of the\nsolutions). The reaction rates ri correspond to Ri. If the\naqueous phase is assumed well mixed and if precipitation\noccurs heterogeneously on preexisting solid grains, then\nri ¼ \u0001iRi; ð8Þ\nfor each i, where \u0001i is the specific interfacial surface area\n(surface area per volume of rock) of the relevant solid\nsubstrate. The units of Ri are mol s\n\u00011 (surface area)\u00011, since\nthe dissolution reactions are surface specific; those of ri are\nmol s\u00011 m\u00013 of rock. Prescription of the specific surface\nareas is hazardous, but the simplest assumption is to write\n\u00011 \/ S; \u00012 \/ F; \u00013 \/ I ; \u0001\f4 \/ Q; ð9Þ\nbearing in mind that some adjustment needs to be made for\nQ and I near zero. In this reaction scheme, we see that\nEPM 13 - 2 FOWLER AND YANG: DIAGENESIS IN SEDIMENTARY BASINS\npotassium and aluminium hydroxyl ions act in concert, and\nwe henceforth ignore the hydroxyl ions as separate entities\nin the discussion.\n[10] A general expression for the reaction rates Ri is\n[Lasaga, 1984; Lasaga et al., 1994]\nRi ¼ kifiðajÞgð\u0003GiÞ; ð10Þ\nwhere aj are the activities of the species in solution, and a\ntypical assumption is that\nfiðajÞ ¼\nY\nj\na\nnij\nj ; ð11Þ\nwhere nij are stoichiometric coefficients of the aqueous\nspecies participating in the reaction. The function g depends\non the free energy of the solution, where we take \u0003Gi < 0\nfor undersaturation, and \u0003Gi > 0 for supersaturation.\nLasaga et al. [1994] write\ng ¼ ½1\u0001 expð\u0003Gi=RTÞ\u0007þ ð12Þ\nfor dissolution (where [x]+ = max (x, 0)), and\ng ¼ ½expð\u0003Gi=RTÞ \u0001 1\u0007þ ð13Þ\nfor precipitation. For single species in dilute solutions, we\ncan take \u0003G = RTln(c\/ceq), where c is the aqueous\nconcentration, and then\ng ¼ ½1\u0001 ðc=ceqÞ\u0007þ ð14aÞ\nfor dissolution, and\ng ¼ ½ðc=ceqÞ \u0001 1\u0007þ ð14bÞ\nfor precipitation, where ceq represents the solubility limit\n(saturated concentration) of the relevant aqueous species\nand [c]+ = max(c, 0). More generally, nonlinear expressions\nof a similar type have also been suggested [e.g., Nielsen,\n1964]. The rate coefficients ki will also vary with\ntemperature, in the general Arrhenius form\nki ¼ ni exp½\u0001Ei=RT \u0007; ð15Þ\nwhere Ei is the activation energy for the reaction i. In\nexperiments [e.g., Eberl and Hower, 1976], the premulti-\nplicative factor is usually given as a frequency (i.e., the\nreaction rate is given as the frequency\nk i* ¼ n i* exp½\u0001Ei=RT \u0007; ð16Þ\nsince the rate of reaction is measured volumetrically and not\nsurface specifically). The two are related as follows:\nequation (8) gives the reaction rate in moles per unit volume\nper unit time. IfMi is the molecular weight (kg mol\n\u00011) and ri\nthe density of the solid substrate (kg m\u00013), then Mi\u0001iki\/ri is\nthe reaction rate as a frequency, i.e., k*, and hence\nn i* ¼ Mi\u0001iniri\n: ð17Þ\n[11] It is convenient to write the reaction equations (7) in\nterms of solid volume fractions. In addition, we will also\nintroduce a convenient scaling for the aqueous concentra-\ntions. For a solid concentration Y S (mol m\u00013 of solids) of\nsubstance Y with molecular weight MY (kg mol\n\u00011) and\ndensity rY (kg m\n\u00013 of rock), rY \/MY (mol m\u00013 of Y) is the\nmolar density of Y, thus (1 \u0001 f)Y SMY \/rY is the quantity of Y\n(m3 of Y m\u00013 of rock), and is thus the volume fraction fY\nof Y. Therefore we define (writing YS = Y )\nfY ¼\nð1\u0001 fÞYMY\nrY\n; ð18Þ\nfor Y = S, F, Q, I. We scale the aqueous concentrations X, L,\nK in terms of their solubility limits cXS (aqueous silica\ncompound in the presence of smectite), cLQ (aqueous silica\nin the presence of quartz) and cKF (potassium ions in the\npresence of feldspar); these may be given in dimensionless\nunits as parts per million (by weight: 1 ppm = 1 mg solute\nper 1 kg solution). For example, the solubility of quartz\ntakes a value of about 6 ppm at room temperature (the\nactivity is about 10\u00014 M, and the gram molecular weight of\nSiO2 is 60) [Krauskopf and Bird, 1995], while that of an\namorphous silica phase is higher, about 120 ppm. These\nvalues increase with temperature, by factors of about 3 to 5\nat 100\u0001C [Krauskopf and Bird, 1995]. In our model, we\nassociate these two solubility limits with illite precipitation\nand smectite precipitation in the presence of feldspar, i.e.,\ncXI and cXS [Aagaard and Helgeson, 1983]; more generally,\nall these solubility limits are very small [Rimstidt, 1997].\nThe dissolved species DL (D = X, L or K) has concentration\nDL, with units of mol m\u00013 of pore water. If DL has\nmolecular weight MD (kg mol\n\u00011), then MDD\nL is the density\nin kg m\u00013. A convenient normalization is to write this in\nterms of the solubility limit. If this is cD ppm, we write cD* =\ncD \r10\u00016, and then we define the dimensionless concen-\ntration of DL, yD, via\nDL ¼ rw\nMD\ncD*yD; ð19Þ\nso that yD is the density of D\nL relative to that at saturation.\nValues of yD > 1 correspond to supersaturated pore water,\nwhereas values <1 represent unsaturated pore water.\n[12] Equations (7) can now be written in the form\n@fS\n@t\nþ #\n ½fSus\u0007 ¼ \u0001\nMS\nrS\nr1; ð20aÞ\n@fF\n@t\nþ #\n ½fFus\u0007 ¼ \u0001\nMF\nrF\nr2; ð20bÞ\n@fQ\n@t\nþ #\n fQus\n\u0004 \u0005 ¼ MQ\nrQ\nðrþ4 \u0001 r\u00014 Þ; ð20cÞ\n@fI\n@t\nþ #\n ½fIus\u0007 ¼ f\nMI\nrI\nr3; ð20dÞ\n@f\n@t\nþ #\n ðfulÞ ¼ nMw\nrw\nr1; ð20eÞ\nFOWLER AND YANG: DIAGENESIS IN SEDIMENTARY BASINS EPM 13 - 3\ncXS*\n@\n@t\nðfyX Þ þ\n#\n ½fyXul \u0007\n\u0006\n\u0001 #\n ½fD #yX \u0007\n\u0007\n¼ MX\nrw\nðr1 \u0001 fr3Þ;\nð20fÞ\ncKF*\n@\n@t\nðfyKÞ þ\n#\n ½fyKul \u0007\n\u0006\n\u0001 #\n ½fD #yK \u0007\n\u0007\n¼ MK\nrw\nðr2 \u0001 r3Þ;\nð20gÞ\ncLQ*\n@\n@t\nðfyLÞþ\n#\n ½fyLul\u0007\u0001\n#\n ½fD #yL\u0007\n\u0006 \u0007\n¼ ML\nrw\nfsr2 þ r3 \u0001 ðrþ4 \u0001 r\u00014 Þg; ð20hÞ\nEquations (20) form the basis of our subsequent discussion.\n3. Weak Solubility and the Pseudo-Steady\nState Hypothesis\n[13] We begin our discussion by noting that the total\nvolume fraction of solids and liquid must be conserved; if S,\nQ, F, and I constitute all the solid mass, then (ignoring the\nsmall quantities of dissolved species) we have\nfþ fS þ fF þ fQ þ fI ¼ 1; ð21Þ\nif there is another (unreactive) solid fraction fU = 1 \u0001 (f +\nfS + fF + fQ + fI), then also @fU\/@t +\n#\n [fUus] = 0. This\nextra equation is necessary when the present diagenesis\ntheory is subsumed into a compaction model.\n[14] Our principal aim in this section is to relate the\nmodel incorporated in Equations (20) to those of other,\nsimpler models. These can be represented as the following\nreaction schemes, respectively.\n[15] Scheme I is a one-step (dehydration) reaction:\nSS ! IS þ nH2O: ð22Þ\nThe smectite-illite transformation is considered to be a first\norder reaction through the dehydration of smectite [Eberl\nand Hower, 1976; Huang et al., 1993; Abercrombie et al.,\n1994].\n[16] Scheme II is a two-step precipitation\/dissolution\nreaction:\nSS ! XL þ nH2O;\nXL ! IS :\nð23Þ\nThe intermediate aqueous silica combination is included,\nbut the mediating role of K-feldspar is neglected. Reactions\nof this type have implicitly been considered by Lasaga\n[1981] and Velde and Vasseur [1992].\n3.1. Kinetics Without Transport\n[17] The basic simplification we can make to the com-\nplete reaction model we have posed can be called the ‘‘weak\nsolubility limit’’; it is analogous to the pseudo-steady state\nhypothesis in enzyme kinetics and is due to the fact that the\nsolubility limits c*DY in Equations (20) are all extremely\nsmall [Rimstidt, 1997]. In the context of geochemically\nreactive flows in porous media, the same approximation is\nknown as ‘‘solid density asymptotics’’ [Ortoleva, 1994]. For\nexample, using the values for cXS and cXI of 120 ppm and\n6 ppm quoted previously [Aagaard and Helgeson, 1983],\nwe have c*XS = 120 \r 10\u00016, c*XI = 6 \r 10\u00016. On the\nassumption that c*XS , c*LQ , c*KF \u0010 1, we can assume the\ncorresponding reactions (20f ), (20g), and (20h) are at\nequilibrium, whence there follows\nr1 \u0011 fr3;\nr2 \u0011 r3;\nrþ4 \u0001 r\u00014 \u0011 ðsþ 1Þr3:\nð24Þ\nSubstitution into the equations for fJ then gives equations\nfor the solid concentrations; however, the on-off nature of\nthe precipitation\/dissolution kinetics makes the procedure a\nlittle more subtle.\n[18] To see this, we adopt specific forms for the reaction\nrates based on the prescription in section 2. Equations (8),\n(10), (11), and (14) give the reaction rates in the general\nform (D for dissolution, P for precipitation)\nrDi ¼ \u0001ikifi 1\u0001\nci\ncq\n\u0006 \u0007\nþ\n;\nrPi ¼ \u0001ikifi\nci\ncq\n\u0001 1\n\u0006 \u0007\nþ\n;\nð25Þ\nwhere ci is the relevant aqueous concentration and cq the\nassociated solubility limit. \u0001i is the precipitate surface area,\nki is the thermally activated rate constant, and fi is the\nactivity dependence: we leave these as fixed for the\nmoment. In consideration of equation (6), we have to\ngeneralize equation (25) to accommodate precipitation or\ndissolution of two solutes.\n[19] We do this in the obvious way, allowing products of\nthe excess concentration factors such as [ci\/cq \u0001 1]+.\nSpecifically, reactions two and three in equation (6) repre-\nsent dissolution of feldspar and precipitation of illite, and\nare controlled respectively by the liquid phases K+L and\nSiOL2 (for equation (6b)) and K\n+L and XL (for equation\n(6c)). Thus we assume that dissolution in these two reac-\ntions is controlled by the product of the appropriate con-\ncentration factors, and when written in terms of the\ndimensionless aqueous concentrations yD (D = L, K, X),\nwe find that equation (6c) can be written in the form\nrD1 ¼ \u0001Sk1f1½1\u0001 yX \u0007þ;\nrD2 ¼ \u0001f k2f2½1\u0001 yK \u0007þ½qL \u0001 yL\u0007þ;\nrP3 ¼ \u0001I k3f3½yK \u0001 qK \u0007þ½yX \u0001 qX \u0007þ;\nrP4 ¼ \u0001Qkþ4 f þ4 ½yL \u0001 1\u0007þ;\nrD4 ¼ \u0001Qk\u00014 f \u00014 ½1\u0001 yL\u0007þ;\nð26Þ\nwhere the solubility ratios are defined as\nqL ¼ cLF=cLQ;\nqK ¼ cKI=cKF ;\nqX ¼ cXI=cXS :\nð27Þ\n[20] Various possibilities now occur depending on the\nvalues of the different solubility limits. We have indicated\nEPM 13 - 4 FOWLER AND YANG: DIAGENESIS IN SEDIMENTARY BASINS\nthat silica compound (X ) solubility with respect to illite is\nmuch less than that with respect to smectite [Aagard and\nHelgeson, 1983; Sass et al., 1987] (thus q X \u0010 1), and we\nsuppose this is also true for potassium, that is to say qK\u0010 1\n[Aagard and Helgeson, 1983, Figure 14]. On the other\nhand, we suppose that the solubilities of silica with respect\nto feldspar or quartz are comparable, so that qL \u0012 1. We\ndenote the reaction terms ki fi in equation (26) as\nkifi ¼ \u0004RRi; ð28Þ\nwhere \u0004R (mol area\u00011 time\u00011) is a normalization to be\ndefined below (andRi is dimensionless) and we specifically\nwrite, for notational convenience,\nSmectite dissolution R1 ¼ RSD;\nFeldspar dissolution R2 ¼ RFD;\nIllite precipitation R3 ¼ RIP;\nQuartz precipitation Rþ4 ¼ RQP;\nQuartz dissolution R\u00014 ¼ RQD;\nð29Þ\nbearing in mind that Ri may typically depend (perhaps\nalgebraically) on concentrations (via fi) and on temperature\n(via ki). For simplicity, we suppress the dependence of Ri\non aqueous phase concentrations. The typical form for the\nreaction rates is then\nRi ¼ exp½liðT \u0001 TiÞ\u0007; ð30Þ\nequation (30) represents a Frank-Kamenetskii [1955]\napproximation to the Arrhenius rate law; Ti is a character-\nistic ‘‘switch-on’’ temperature, and li is proportional to the\nactivation energy Ei. Specifically, if the dimensional\nreaction rate is ki = niexp(\u0001Ei\/RT ), then the Frank-\nKamenetskii approximation is that ki = \u0004RRi, where Ri is\ngiven by equation (30), and\nTi ¼ ðEi=RÞ\nlnðni=\u0004RÞ ; li ¼ Ei=RT\n2\ni : ð31Þ\nIt is valid in practice if Ti \u0010 E\/R, or equivalently ni \u0014 \u0004R,\nwhich we shall later find to be an accurate assumption. Eberl\nand Hower [1976] report experimental results fromwhich we\ncan infer values EIP \u0011 80 kJ mol\u00011 and nIP* \u00111.3 s\u00011 (see\nequation (17)). Other estimates of the activation energy are\nsimilar to this; for example, Lasaga [1984] quotes a range\n40–80 kJ mol\u00011 for other mineral reactions, while Rimstidt\nand Barnes [1980] quote dissolution values of 50 kJ mol\u00011\nand precipitation values in the range 67–76 kJ mol\u00011 for\na simple silica-water reaction. Huang et al. [1993] find a\nhigher activation energy (about 120 kJ mol\u00011) with an\nappropriately lower n* (about 0.4\r 10\u00015 s\u00011), but these data\nare from experiments at higher temperatures, above 250\u0001C.\n[21] Indirect inferences of Ti in equation (31) come from\nmeasured illite fraction in illite\/smectite in deep wells.\nMany different wells show that the smectite-illite reaction\nstarts at typical temperatures which range from about 70\u0001 to\nabout 120\u0001 [Abercrombie et al., 1994; Freed and Peacor,\n1989; Pearson and Small, 1988], and the reaction occurs\nover a temperature range upward of 20\u0001, and over a\ncorresponding depth interval of 0.5–1 km, beginning at\ndepths between 1.5 and 3 km [Abercrombie et al., 1994;\nFreed and Peacor, 1989; Pearson and Small, 1988; Hower\net al., 1976]. We use these field and experimental observa-\ntions later to estimate reasonable values of Ti and li.\n[22] The equilibrium equations (24) are then (with\nr3\/ \u0004R ¼ \u0004r)\n\u0001Q½Rþ4 ðyL \u0001 1Þþ \u0001 R\u00014 ð1\u0001 yLÞþ\u0007 ¼ ðsþ 1Þ\u0004r;\n\u0001SR1ð1\u0001 yX Þþ ¼ f \u0004r;\n\u0001FR2ð1\u0001 yX ÞþðqL \u0001 yLÞþ ¼ \u0004r;\n\u0004r ¼ \u0001IR3ðyK \u0001 qKÞþðyX \u0001 qX Þþ; ð32Þ\nand these are four equations for the reaction rate \u0004r\nand the three aqueous concentrations yX, yL, and yK.\nAssuming nonzero reaction rates, and taking qK,qX \u0010\n1, and qL > 1 (see discussion after equation (27)), we\ndeduce from equation (32) that yL > 1 (thus quartz\nprecipitates from solution), and\n\u0004r ¼ \u0001IR3yKyX ;\nyX ¼ 1\u0001\nf \u0004r\n\u0001SR1 ;\nyL ¼ 1þ\nðsþ 1Þ\u0004r\n\u0001QRþ4\n;\nyK ¼ 1\u0001\n\u0004r\n\u0001FR2 qL \u0001 1\u0001 ðsþ 1ÞR3\n\u0001QRþ4\n\b \t ; ð33Þ\nwhence the basic reaction rate r3 is given by\nr3 ¼ \u0004R\u0004r ¼ ð\u0004R=dgÞfIRIPr*; ð34Þ\nwhere\nr* \u0011 1\u0001 f fIRIP\nfSRSD\n\n \u000b\nr*\n\u0006 \u0007\n1\u0001 ðfIRIP=fFRFDÞr*\nqL \u0001 1\u0001 ðsþ 1ÞfIRIPfQRQP\n !\nr*\n( )\n2\n66664\n3\n77775;\nð35Þ\nand we have assumed that the specific mineral surface areas\n\u0001i are given by\n\u0001i ¼ fi=dg; ð36Þ\nwhere dg is a measure of grain size. Equation (35)\ndetermines r* uniquely (taking into account the constraints\nthat yX, yK > 0, and hence (since \u0004r > 0) are also <1) as a\nfunction of the relative reaction rates RIP\/RSD, RIP\/RFD,\nRIP\/RQP, i.e., the rate of illite precipitation as compared to\nthose of smectite dissolution, feldspar dissolution and quartz\nprecipitation. It can in fact be written explicitly as the\nsolution of a quadratic equation, providing qL > 1, i.e., cLF >\ncLQ. If qL! 1+, then r*! 0, and if qL \u0015 1, then inspection\nof equation (32) shows that r3 = 0, and hence also\nyL ¼ 1; yX ¼ 1; yK ¼ qK ; ð37Þ\nthe aqueous phases rapidly reach saturation, and the\nsmectite-illite transition is unable to proceed. However, it\nFOWLER AND YANG: DIAGENESIS IN SEDIMENTARY BASINS EPM 13 - 5\nis typically the case that qL > 1 [Aagard and Helgeson,\n1983].\n[23] Substitution of the reaction rates given by equations\n(24) into the mineral phase conservation equations gives\n@fS\n@t\nþ #\n ½fSus\u0007 ¼ \u0001 f\nMS\nrS\n\n \u000b\nr3; ð38aÞ\n@fF\n@t\nþ #\n ½fFus\u0007 ¼ \u0001\nMF\nrF\n\n \u000b\nr3; ð38bÞ\n@fQ\n@t\nþ #\n ½fQus\u0007 ¼ ðsþ 1Þ\nMQ\nrQ\n( )\nr3; ð38cÞ\n@fI\n@t\nþ #\n ½fIus\u0007 ¼ f\nMI\nrI\n\n \u000b\nr3; ð38dÞ\n@f\n@t\nþ #\n ½ful\u0007 ¼ nf Mw\nrw\n\n \u000b\nr3: ð38eÞ\n[24] Summation of the solid phase equations (together\nwith an inert phase, if one exists) also gives\n\u0001 @f\n@t\nþ #\n ½ð1\u0001 fÞus\u0007 ¼ f MI\nrI\nþ ðsþ 1ÞMQ\nrQ\n\"\n\u0001MF\nrF\n\u0001 f MS\nrS\n\u0007\nr3;\nð39Þ\nbut in general (even with the simplifications we have\nintroduced), the rate r3 is a complicated function of the\nindividual components of the solid phases. Note also that if\nwe add equations (38e) and (39), we have\n#\n½ð1\u0001fÞusþful\u0007¼ fMI\nrI\nþðsþ1ÞMQ\nrQ\n\"\n\u0001MF\nrF\n\u0001 fMS\nrS\nþ nf Mw\nrw\n\n \u000b\u0007\nr3;\nð40Þ\nso that if the diagenetic reactions are significant, then in\ngeneral the mixture is not incompressible.\n[25] It is convenient to write these equations in dimen-\nsionless form. We let d denote a physically relevant depth\nscale, typically several kilometers, over which porosity\nchanges due to mechanical compaction operate, for exam-\nple. The sedimentation rate _m defines a natural velocity\nscale for us and ul, and thus d\/ _m defines a natural burial\ntimescale. Writing t, x and the velocities in terms of these,\nwe then obtain the dimensionless set\n@fS\n@t\nþ #\n ½fSus\u0007 ¼ \u0001R*;\n@fF\n@t\nþ #\n ½fFus\u0007 ¼ \u0001aFR*;\n@fQ\n@t\nþ #\n ½fQus\u0007 ¼ \u0001aQR*;\n@fI\n@t\nþ #\n ½fIus\u0007 ¼ aIR*;\n@f\n@t\nþ #\n ½ful\u0007 ¼ awR*;\nð41Þ\nwhere\nR* ¼ f fIRIPr*; ð42Þ\nand we have finally chosen the reaction rate normalization \u0004R\n(see equation (28)) as\n\u0004R ¼ _mdgrS\ndMS\n: ð43Þ\nThe molar density ratios are given by\naF ¼ rSMF\nf rFMS\n;aQ ¼ ðsþ 1ÞrSMQ\nf rQMS\n;aI ¼ rSMIrIMS\n;aw ¼ nrSMwrwMS\n:\nð44Þ\nWe assume the following values of the molecular weights,\ndensities and stoichiometric constants (using units of g cm\u00013\nfor density and g mol\u00011 for molecular weight, and following\nchemical formulae of Abercrombie et al. [1994]):\nrw ¼ 1; rQ \u0011 rF\u0011rS \u0011 rI \u0011 2:6;\nMS ¼ 450:2; MI ¼ 388:2;\nMF¼278:3; Mw ¼ 18; MQ ¼ 60;\nf ¼ 2; s¼3; n ¼ 4:5;\nð45Þ\nwhence values of ai are given by\naF ¼ 0:31; aQ ¼ 0:27; aI ¼ 0:86; aw ¼ 0:47: ð46Þ\nWe assume typical values of _m, dg and d to be\n_m ¼ 300 m Myr\u00011 ¼ 10\u000111m s\u00011; d ¼ 1000 m; dg ¼ 10\u00014 m\nð47Þ\nWe then find that the reaction rate normalization parameter\n\u0004R \u0011 0.6 \r 10\u000118 g mol cm\u00012 s\u00011.\n3.2. Simplifications\n[26] The dimensionless smectite reaction rate R* is given,\nfrom equations (42) and (35), by\nR*\u0011 f fIRIP 1\u0001\nR*\nfSRSD\n\u0006 \u0007\n1\u0001 R*\nfFRFD f ðqL\u00011Þ\u0001\nðsþ1ÞR*\nfQRQP\n( )\n2\n66664\n3\n77775;\nð48Þ\nand thus is a function of all four solid fractions fI, fS, fF and\nfQ. It is uniquely determined since, although equation (48)\nhas two positive roots, only the smaller of these has physical\nmeaning, for the reasons stated following equation (36). In\ngeneral, therefore, all the mineral phase equations need to\nbe solved separately. In practice, it is of interest to see\nwhether any simplification is possible if any of the\nEPM 13 - 6 FOWLER AND YANG: DIAGENESIS IN SEDIMENTARY BASINS\ndissolution or precipitation reactions are rate limiting, and\nin fact, this is the case for illite precipitation. Quartz\nprecipitation is slow [Abercrombie et al., 1994; Bjørlykke\nand Egeberg, 1993], and feldspar dissolution is fast\n[Busenberg and Clemency, 1976; Gautier et al., 1994]. If\nwe suppose that RQP \u0010 1 and RFD \u0010RQP (Bjørlykke and\nEgeberg [1993] infer values RQP \u0012 10\u00015, Gautier et al.\n[1994] imply RFD \u0012 10), then the last bracketed term in\nequation (48) is approximately one, and thus equation (48)\nsimplifies to\n1\nR*\n\u0011 1\nf fIRIP\nþ 1\nfSRSD\n: ð49Þ\n[27] The reaction rates of smectite and illite, RSD and\nRIP, are given by Ri = exp[li(T \u0001 Ti)]. Values of Ti and l i\nare determined by equation (31). Using equations (17), (36),\nand (43), we can write\nnS\n\u0004R\n¼ nS*tb; ð50Þ\nwhere\ntb ¼ d\n_mfS\nð51Þ\nis a representative burial time to the depth d. We choose\nvalues d = 1000 m and _m = 300 m Myr\u00011 = 10\u000111 s\u00011 so\nthat tb \u0012 1014 s. If we use Eberl and Hower’s [1976] data\nEIP = 80 kJ mol\n\u00011, n*IP = 1.3 s\n\u00011, and suppose that the\nequivalent of equation (50) applies, then nIP\/\u0004R \u0012 1014 (and\nis indeed large as we supposed), and we find TIP \u0012 300 K,\nor about 30\u0001. This is actually quite close to the observed\nonset reaction temperatures of 70–120\u0001 (340–400 K) (they\nappear worse in the arbitrarily zeroed centigrade scale). The\nvalue of TIP is very sensitive to the values of EIP and n*IP; for\nexample if we use Huang et al.’s [1993] values of 120 kJ\nmol\u00011 and 10\u00015 s\u00011, we find TIP = 700 K, which is clearly\ninappropriate. Our preferred choice of TIP and also TSD is\nthus \u0011100\u0001C, and we denote this common value as Tc. The\nvalue of EIP = 80 kJ mol\n\u00011 then implies lIP \u0011 0.07 K\u00011.\nFollowing Rimstidt and Barnes [1980], we might expect\nthat EIP > ESD, and thus lIP > lSD. In this case RSD > RIP\nfor T < Tc \u0011 100\u0001C, while RSD < RIP for T > Tc.\nApproximately,\nR* \u0011 f fIRIP; T < Tc;\nR* \u0011 fSRSD; T > Tc: ð52Þ\nThe reaction would then be rate limited by illite precipita-\ntion for T < Tc but by smectite dissolution for T > Tc, and the\neffect of equation (52) is to slow the reaction to that of the\nrate-limiting precipitation\/dissolution process. The (appar-\nently unlikely) case where f RSD \u0010 RIP reproduces first-\norder kinetics precisely, with\nR* \u0011 RSIfS ; ð53Þ\nwhere\nRSI ¼ fRSD; ð54Þ\nbut this may not be quantitatively accurate in practice. Note\nthat equation (53) is precisely what one obtains from\nreaction (22) (or reaction (23) using the weak solubility\nlimit) if the scaled smectite to illite reaction rate is RSI.\n[28] The simplification which leads us to equation (49)\nallows the model to be reduced to three equations for f, fS\nand fI, and this is detailed in section 4; this is because the\nreduced reaction rate R* in equation (49) is R*(fS, fI). In\nfact, inspection of equation (41) shows that the subsidiary\nmineral phase concentrations fF and fQ can be written\nexplicitly as linear combinations of fS and fI; therefore this\nreduction works in general. To be specific, suppose that the\nsolid phase Y with volume fraction fY satisfies\n@fY\n@t\nþ #\n ½fYus\u0007 ¼ aYR*; ð55Þ\ntogether with the boundary condition\nfY ¼ f0Y on @V ; ð56Þ\nwhere @V denotes the top surface. Then fY is a simple linear\ncombination of fI and fS, explicitly\nfY ¼\nðaYf0S þ f0Y ÞfI þ ðaIf0Y \u0001 aYf0I ÞfS\naIf0S þ f0I\n: ð57Þ\n4. One-Dimensional Model\n[29] Let us suppose that the smectite reaction rate R* can\nbe taken as a function of fI and fS only. (At least in the\npresent reaction scheme, this can always be done using\nequation (57).) We construct a one-dimensional model by\nadding to the mass conservation equations in equation (41)\nthe equation of momentum conservation in the form of\nDarcy’s law, together with constitutive laws for the effective\npressure and the permeability. The details of the equations\nand their scaling have been given several times previously\n[Audet and Fowler, 1992; Fowler and Yang, 1998, 1999]\nand are therefore only summarized here. The generalized\nform of Darcy’s law written in nondimensional form (for a\none-dimensional flow) is\nfðul \u0001 usÞ ¼ l~k @~p\n@z\nþ 1\u0001 f\n\n \u000b\n; ð58Þ\nwhere\nl ¼ k0ðrs \u0001 rlÞg\nm _m0s\nð59Þ\nis a dimensionless parameter measuring the rate of\ncompaction; k0 is the uncompacted permeability, rs and rl\nare solid and liquid densities (we assume all the solid phases\nhave the same density), m is the pore water viscosity, g is\ngravity, and _ms\n0 is the specific choice of sedimentation rate\nscale. Large values of l correspond to rapid compaction or\nslow sedimentation, while small values indicate slow\ncompaction or rapid accumulation. Both small and large\nvalues are possible, although large values are likely to be\nFOWLER AND YANG: DIAGENESIS IN SEDIMENTARY BASINS EPM 13 - 7\nmore common. We choose constitutive laws for ~k and ~p\nfollowing Smith [1971] and Sharp [1976]:\n~p ¼ lnðf0=fÞ \u0001 ðf0 \u0001 fÞ;\n~k ¼ ðf=f0Þm; ð60Þ\nand a typical assumption is that m is large, e.g., m = 8.\n[30] The assumptions in equation (60) are likely to be\noversimplified. In particular, we have not made allowance\nhere for the dependence of permeability on clay mineralogy\n[e.g., Revil et al., 2002], where there appears to be a strong\nincrease (at fixed porosity) of permeability with the illite\/\nsmectite ratio. In our model, this would be represented by\nallowing ~k to depend on the smectite and illite volume\nfractions fS and fI as well as the porosity f. While it is not\ncomplicated to do so, we have not included this effect here,\nas we wish to isolate the effect of the diagenetic reaction\nscheme, and compare the results with those we have\nobtained previously. It should be noted, however, that the\neffect of increasing permeability with illite fraction is to\noffset the decrease with porosity, and this will cause the\nincreased pore pressure gradient found in Figure 1, for\nexample, to become localized in space.\n[31] We suppose the sediments lie between a fixed\nimpermeable basement at z = 0 and a free upper surface\nat z = h(t) (in conditions of accumulation, this represents the\nocean bottom). Suitable boundary conditions are then\nus ¼ ul ¼ 0 z ¼ 0;\n_h ¼ _ms þ us z ¼ h;\nf ¼ f0 z ¼ h;\nfY ¼ fY0 z ¼ h; Y ¼ I ; S;F;Q:\nð61Þ\nThese represent conditions at the impermeable basement,\nthe kinematic condition of sediment accumulation at the top\nsurface, prescribed porosity resulting from the condition of\nzero effective pressure (i.e., pore pressure equals over-\nburden pressure) at the top surface, and prescribed\nconstitution of surface composition of the solid sediments\nbeing deposited, respectively.\n[32] We define the integrated smectite dissolution\ny ¼\nZ z\n0\nR* dz; ð62Þ\nthen integration of the one-dimensional version of equation\n(40) implies\nful þ ð1\u0001 fÞus ¼ \u0001ay; ð63Þ\nwhere\na ¼ 1þ aF þ aQ \u0001 aI \u0001 aw: ð64Þ\nIt follows that\nus ¼ \u0001ay\u0001 l~k @~p\n@z\nþ 1\u0001 f\n\n \u000b\n; ð65Þ\nand the smectite and illite conservation laws are\n@fS\n@t\n¼ \u0001 @\n@z\nðfSusÞ \u0001 R*; ð66Þ\n@fI\n@t\n¼ \u0001 @\n@z\nðfI usÞ þ aIR*; ð67Þ\nwith equivalent equations for fF and fQ if R* depends on\nthese also. Without loss of generality we can take R* =\nR*(fS, fI). The evolution of porosity is given by\n@f\n@t\n¼ @\n@z\n½ð1\u0001 fÞus\u0007 þ ðaþ awÞR*; ð68Þ\nFigure 1. Fast compaction with l = 100, and the same first-order kinetics as in Figure 2. Snapshots of\nporosity and pressure profiles in terms of scaled height Z = z\/h(t) at t = 5. The dotted curve corresponds to\nthe absence of diagenesis, that is aI = 1, aw = 0. The diagenetic case corresponds to values aI = 0.86, aw =\n0.47. The effect on porosity and pore pressure is relatively small due to the smallness of 1 \u0001 aI.\nEPM 13 - 8 FOWLER AND YANG: DIAGENESIS IN SEDIMENTARY BASINS\nand with the choice of constitutive law in equation (60) for\n~p, us is given from equation (65) by\nus ¼ \u0001ay\u0001 lð1\u0001 fÞ\n~k\nf\n@f\n@z\n\u0001 f\n\n \u000b\n: ð69Þ\n[33] Suitable boundary conditions are then as in equation\n(61) (the condition on ul is redundant, as it has already been\nused in obtaining equation (63). The kinematic condition\ndetermines h, and the conditions on f at z = h and on us at\nz = 0 are suitable boundary conditions for the parabolic\nequation (68) for f. Equations (66) and (67) are then\nhyperbolic equations for the solid fractions, and the single\nboundary conditions for fS, etc., are appropriate for their\nsolution, since the characteristics move downward relative\nto z = h if _ms > 0 as we assume here. These observations\nalso color the numerical method we use. Essentially, a\ndiffusive solver is used to step forward f assuming R* is\nknown; then fS and fI are stepped forward with a hyper-\nbolic solver, and the stepping procedure is iterated toward\nconvergence.\n[34] In sections 4.1–4.3, we study the behavior of the\nsolutions of this model in the particular limits of slow and\nfast compaction. Before doing so, however, we reconsider\nhow the model reaction scheme can be compared to the first-\nand second-order schemes (22) and (23). The first point to\nnotice is that the application of the weak solubility (or solid\ndensity) asymptotics implies that the second-order reaction\nis essentially equivalent to the first-order scheme (22). If the\nderivation of the model (20) is followed through for the first-\norder scheme, we find that the equations for fS, fI and f are\nthe same, except that the right hand side of the fI equation is\nMIr1\/rI. However, the weak solubility limit implies that r1 =\nfr3, and thus we regain the model in equations (66)–(69),\nthe only difference being in the definitions of R* and aY. For\na first-order reaction, equation (53) would be appropriate,\nand the absence of quartz or feldspar reaction (even if\nthe minerals are present as inert species) is simply effected\nin the model by putting aF = aQ = 0: whence we would\ntake a + aw = 1 \u0001 aI \u0001 aw in equation (68).\n4.1. Reaction Rates\n[35] The temperature-dependent reaction rates Ri are\nassumed to be exponentials of the form (see discussion\nafter equation (49))\nRi ¼ exp½liðT \u0001 TiÞ\u0007; ð70Þ\nin our simulations we suppose that the temperature\nincreases linearly with depth, thus (dimensionally)\nT ¼ T0 þ Gðh\u0001 zÞ; ð71Þ\nwhere G is the geothermal temperature gradient and T0 is\nthe surface temperature. We define the dimensionless\ntemperature \u0007 by\nT ¼ T0 þ Gd\u0007; ð72Þ\nso that the present assumption of a linear temperature\ngradient gives, dimensionlessly,\n\u0007 ¼ h\u0001 z; ð73Þ\nand the reaction rates can be written as\nRi ¼ exp½bið\u0007\u0001\u0007iÞ\u0007; ð74Þ\nwhere\nbi ¼ liGd; \u0007i ¼\nTi \u0001 T0\nGd\n: ð75Þ\nTypical values of the parameters bi and\u0007i are^O(1) and are\nused in our numerical illustrations below. More specifically,\nfollowing the discussion after equation (51), we use\nrepresentative values Ti \u0001 T0 \u0012 100 K, li \u0012 0.07 K\u00011,\nd \u0012 1000 m, and the geothermal temperature gradient is\ntypically 25 K km\u00011 [Turcotte and Oxburgh, 1982, p. 53].\nWith these values, bi = 1.75, \u0007i = 4. Observed depths of\ndiagenetic windows in kilometers suggest corresponding\nranges of \u0007i should in fact be around 1.5–3. Similar\nvariation of bi can be inferred. The parameter \u0007i represents\nthe dimensionless depth where the reaction is ‘‘switched\non,’’ and the size of bi represents the sharpness of the\nwindow.\n4.2. Slow Compaction, L \u0010 1\n[36] When l \u0010 1, the basic mechanical compaction\nmodel (i.e., with no diagenesis) has a compacting basal\nboundary layer, above which the porosity is essentially\nconstant, and the pore pressure is close to lithostatic, and\nthus much higher than the equilibrium hydrostatic pres-\nsure. In this situation, the effect of diagenesis is to release\nextra pore water, and this causes the porosity to be\nincreased above its initial value in the diagenetic window,\nas a result of which the effective pressure becomes\nnegative. This is illustrated for the first-order reaction\n(53) in Figure 2. A zone of overpressure forms above\nthe diagenetic window, and extends all the way to the\nsurface.\n[37] Negative effective pressures are, of course, unphys-\nical, and their occurrence indicates the formation of hydro-\nfracture in the uncemented sediments. A natural hypothesis\nis then that the effective permeability adjusts itself in order\nto maintain the effective pressure just at zero in such\nregions. Figure 3 shows the solution of the model with this\nassumption. The model equations are the same, but if f is\ncomputed to be greater than f0 anywhere, then it is set equal\nto f0 there, and equations (67) and (69) are used to compute\nthe effective permeability. We see that a hydrofractured\nregion with a tenfold increase in effective permeability lies\nabove the diagenetic window.\n[38] A feature of these results is the relatively well\ndefined diagenetic window between normalized heights\nZ = 0.2 and Z = 0.5. The relative sharpness of this window\nis associated with the size of the exponent in the reaction\nrate law (74), and it is possible to obtain analytic solutions\nin the limit as b!1 [Yang, 1998], using ‘‘high activation\nenergy’’ asymptotics. We omit analytic details but illustrate\nthe effect of increasing values of b in Figure 4, where we\nFOWLER AND YANG: DIAGENESIS IN SEDIMENTARY BASINS EPM 13 - 9\nalso show that the effect of changing \u0007i is simply to shift\nthe reaction zone lower in the burial zone.\n4.3. Composite Reaction Kinetics, L \u0010 1\n[39] We omit presentation of results for the case when\nl \u0010 1 for the complex reaction scheme in equation (49),\nsince the pertinent features are unaltered. There is a basal\ncompacting layer, and diagenesis causes an overporous\nregion above the window, which causes hydrofracturing\nand an associated increase of effective permeability, as we\nhave shown before.\n4.4. Fast Compaction, L \u0014 1\n[40] When l\u0014 1, compaction is fast, or sedimentation is\nslow, and the porosity relaxes rapidly to an equilibrium in\nwhich the pore pressure is hydrostatic: hence the effective\nfigure 2. First-order reaction kinetics using reaction (22) with n = 2, bSI = 2.3, and \u0007SI = 3. Snapshot of\na slowly compacting basin profile when l = 0.01 at a time t = 5. The height variable Z = z\/h(t) is scaled to\nlie between 0 and 1. (left) Reaction window between Z = 0.2 and Z = 0.5, and porosity profile (‘‘water’’),\nwhich has the usual basal compaction layer but also a region of excess porosity in the diagenetic window.\n(right) This leads to a physically unacceptable negative effective pressure.\nFigure 3. Same calculation as in Figure 2, except that hydrofracturing is allowed to occur in the\noverporous region and is modeled by constraining the permeability to be such that the minimum effective\npressure is zero. The result in Figure 3 (right) is that the effective permeability increases twentyfold, and\nhydrofracture occurs from the surface down to the diagenetic window. The dotted curves represent an\napproximate analytic solution [Yang, 1998] which is not presented here.\nEPM 13 - 10 FOWLER AND YANG: DIAGENESIS IN SEDIMENTARY BASINS\npressure increases with depth, and thus the porosity\ndecreases with depth. However, because the permeability\ndecreases rapidly with the porosity, the high permeability\nassumption becomes invalid at a critical depth (dimension-\nlessly, this is denoted by \b = (ln l)\/m, and below this,\ncompaction is slow and the pore pressure gradient becomes\nlithostatic. Figure 1 shows this situation, and also shows the\neffect of diagenesis. It can be seen that the diagenetic\nwindow lies below the transition to low permeability, and\nthis is generally the case. With the temperature \u0007 = h \u0001 z,\nthe diagenetic window begins at depth \u0007i, and typical\nvalues of this are greater than \b; for example, \b \u0011 0.58\nfor m = 8, l = 100.\n[41] We see from Figure 1 that diagenesis has little effect\non the porosity, or on the pore pressure. The reason for this\nlies in the amount of dewatering which occurs; this is\nmeasured by the value of aI, which is the ratio of the molar\ndensities of smectite and illite. Its value is about 0.86, so\nthat 1 \u0001 aI \u0011 0.14 and is small. It is in fact possible to\nderive analytic approximations to the model in this case,\nand specifically if we assume 1 \u0001 aI \u0012 1\/m \u0012 bSI; Figure 5\nshows the comparison of the theoretical results (Yang 1998)\nwith those obtained numerically. The agreement is reason-\nable (given that bSI = 2.3!), and clearly improves for higher\nvalues of bSI, as indicated in Figure 6. More specifically,\nFowler and Yang [1998] and Yang [1998] show that below\nthe transition region, f is given by\nf ¼ f* exp 1\nm\nð\u0001 lnmþ\tÞ\n\u0006 \u0007\n; ð76Þ\nwhere \t = O(1). This applies both if diagenesis occurs and\nif not, and inspection of equation (6.76) of Yang [1998]\nshows that the effect of diagenesis is to alter \t by O{bSI\/m,\nm(1 \u0001 aI)}, which is O(1) for the values we use. Thus the\nrelative variation of f due to diagenesis is O(1\/m),\nconsistent with the small variation we see in Figure 1.\n4.5. Composite Reaction Kinetics, L \u0014 1\n[42] Figure 7 shows a comparison of the first-order\nkinetic solution with that derived from the composite\nFigure 4. Effect of changing the first-order reaction parameters (left)\u0007SI and (right) bSI in equation (74).\nClearly, \u0007SI affects the depth of the diagenetic window while increasing bSI makes it thinner. The profiles\nare of smectite and illite with dimensionless height z above the basement, at t = 5 with l = 0.01 and n = 2.\nThe value of bSI is 2.3 in Figure 4 (left), and the value of \u0007SI is 3 in Figure 4 (right).\nFigure 5. Comparison of theoretical results from Yang\n[1998], but not presented in the text, with numerical results\nof the first-order reaction kinetics, when l = 100, n = 2, aI =\n0.86, aw = 0.47, bSI = 2.3, \u0007SI = 3 at time t = 5.\nFOWLER AND YANG: DIAGENESIS IN SEDIMENTARY BASINS EPM 13 - 11\nprecipitation\/dissolution scheme (equation (49)), when com-\npaction is fast (l \u0010 1). We omit illustration in slow\ncompaction, since in that case the compactive basal boundary\nlayer occurs whatever the reaction scheme, and any reaction\nleads to the hydrofracturing as before. Figure 8 shows\nthe corresponding pressure profiles. If the kinetic parame-\nters bSD and bIP are equal and \u0007SD and \u0007IP are equal, then\nequation (49) is exactly equivalent to reaction (22). In\npractice, the values of these reaction parameters are not\nlikely to be too dissimilar for smectite dissolution and illite\nprecipitation, and this is consistent with the comparability\nof activation energies and rate constants which are gener-\nally reported for water-rock interactions (e.g., Lasaga,\n1984), and also with the observation of narrow reaction\nwindows in which both smectite dissolution and illite\nprecipitation take place [Abercrombie et al., 1994]. If this\nis the case, there is, in fact, little difference between\nprecipitation\/dissolution and first-order reaction. Clearly,\nthe difference would be exacerbated if the b and \u0007 param-\neters were less comparable.\n[43] In Figure 9, we repeat the exercise of Figure 4, in\nexamining the effects of changing either \u0007SD or \u0007IP.\nClearly, the effects are similar, except that the change of\nreaction depth with \u0007i is nonlinear, reflecting the bipartite\ncontrol of the two parameters on the reaction rate, as\nindicated by equation (49).\n5. Conclusions\n[44] Our principal aim in this paper has been to consider a\nrealistic model of the smectite to illite transformation\nprocess, and to show how the corresponding model set of\nreaction transport equations is related to models derived\nusing simpler kinetics. In particular, we have considered a\ndetailed composite reaction scheme involving dissolution of\nsmectite and precipitation of illite via the intermediary\ndissolution of potassium feldspar. The kinetics of precipi-\ntation and dissolution are very different from mass action\nderived rate laws, but we have shown that for this particular\ncomposite precipitation\/dissolution scheme (and, we infer,\nmost probably for more general ones) the application of\nweak solubility (or, solid density) asymptotics based on the\nextremely small molar concentrations of aqueous saturated\nmineral solutions leads to effective reaction equations which\nare in fact very similar to a model based on first-order\nkinetics. The primary distinction is that where a first-order\nmodel naturally leads to a reaction rate (for smectite\ndissolution) of R* \/ fS, the composite reaction rate is a\nFigure 6. Similar to Figure 5 but a closeup of the\ndiagenetic window with higher values of bSI, when the\napproximation improves in accuracy.\nFigure 7. A snapshot comparison of the first-order kinetic\nreaction (22), using l = 100, n = 2, aI = 0.86, aw = 0.47, bSI =\n2.3, \u0007SI = 3 at time t = 5, with the multistep reaction kinetics\ndescribed by equation (49), with the same parameter values,\nexcept that f = 2,\u0007SD =\u0007IP = 3, bSD = 2.3, and bIP = 2.5. The\nreaction window is slightly deeper, and the porosity increase\nis consequently slightly enhanced.\nFigure 8. Pressure profiles corresponding to the snapshot\nin Figure 7. There is little effect of which reaction scheme is\nused.\nEPM 13 - 12 FOWLER AND YANG: DIAGENESIS IN SEDIMENTARY BASINS\nfunction of all the solid mineral reactive constituents, and\nthis leads to certain differences in the consequent diagenetic\nporosity profiles. The weak solubility limit is a very\npowerful way of producing useful rate equations from very\ncomplicated reaction schemes.\n[45] We have used the derived reaction model to derive\nporosity and pore pressure profiles in the limits of fast and\nslow compaction, and for both the first-order kinetic\nscheme and an approximate form of the feldspar mediated\nprecipitation\/dissolution scheme. When l \u0010 1, i.e., com-\npaction is slow (sedimentation is fast) then in the absence\nof diagenesis, pore pressures are almost lithostatic every-\nwhere except near a boundary layer at the basement, and\nthe effect of the extra pore water release due to diagenesis\nis to cause hydrofracturing to occur. We infer that in this\ncase the effective permeability increases to allow effective\npressure to be reduced to zero, and this is a predictive\nmechanism whereby fractures in sedimentary rocks may be\nexplained.\n[46] In the more interesting and probably common situ-\nation where compaction is fast, i.e., sedimentation is slow\n(l\u0014 1), the diagenetic window will typically lie below the\nequilibrium compaction region, where the pore pressure is\nhydrostatic. Below this, compaction is slow and the pore\npressure gradient becomes approximately lithostatic (see\nFigure 1); however, the effect of diagenesis is fairly small,\nand this can be ascribed to the relatively small quantity of\npore water release, mathematically signaled by the close-\nness of aI to one. Thus, at least within the confines of the\nmodel studied here, diagenesis is not a primary agent for\nexcess pore pressure.\n[47] It should be noted that the result in Figure 1 assumes\na uniformly decreasing permeability with compaction, i.e.,\nwith decreasing porosity. The counteracting effect of per-\nmeability increase with illite fraction [Revil et al., 2002] will\ntend to localize the region of high pore pressure gradient, as\nfound in pressurized seals [Hunt, 1990].\n[48] The use of the weak solubility limit allows us to\nreduce a quite general precipitation\/dissolution scheme to\none involving two species, the source (smectite) and the\nproduct (illite), with a reaction rate which is in general a\ncomplicated function of both their concentrations. When\nsource dissolution and product precipitation are slow and\nthus rate limiting, then the reaction rate is equation (49),\nand indicates that precipitation and dissolution effectively\noccur serially (by analogy to two resistors in series).\nFurthermore, if the reaction parameters b and \u0007 for the\ntwo processes are similar (as here), then in fact the overall\nscheme is essentially the same as the simpler first-order\nreaction scheme.\nReferences\nAagaard, P., and H. Helgeson, Activity\/composition relations among\nsilicates and aqueous solutions: II. Chemical and thermodynamic conse-\nquences of ideal mixing of atoms on homological sites in montmorillo-\nnites, illites, and mixed-layer clays, Clays Clay Miner., 31, 207–217,\n1983.\nAbercrombie, H. J., I. E. Hutcheon, J. D. Bloch, and P. de Caritat, Silica\nactivity and the smectite-illite reaction, Geology, 22, 539–542, 1994.\nAharonov, E., M. Spiegelman, and P. Kelemen, Three-dimensional flow\nand reaction in porous media: Implications for the Earth’s mantle and\nsedimentary basins, J. Geophys. Res., 102, 14,821–14,833, 1997.\nAudet, D. M., and A. C. Fowler, A mathematical model for compaction in\nsedimentary basins, Geophys. J. Int., 110, 577–590, 1992.\nBjørlykke, K., and P. K. Egeberg, Quartz cementation in sedimentary\nbasins, AAPG Bull., 77, 1538–1548, 1993.\nBusenberg, E., and C. V. Clemency, The dissolution kinetics of feldspar at\n25\u0001C and 1 atm CO2 partial pressure, Geochim. Cosmochim. Acta, 40,\n41–49, 1976.\nEberl, D., and J. Hower, Kinetics of illite formation, Geol. Soc. Am. Bull.,\n87, 1326–1330, 1976.\nFowler, A. C., and X.-S. Yang, Fast and slow compaction in sedimentary\nbasins, SIAM J. Appl. Math., 59, 365–385, 1998.\nFowler, A. C., and X.-S. Yang, Pressure solution and viscous compaction in\nsedimentary basins, J. Geophys. Res., 104, 12,989–12,997, 1999.\nFigure 9. Effects of changing \u0007i on the depth of the reaction window. Snapshots are shown at t = 5. The\nparameters are as in Figure 7, except as indicated on the diagrams. This figure can be compared to Figure 4,\nbut note that l = 0.01 in Figure 4 and thus _h\u0011 1, whereas l = 100 here and _h\u0011 0.66, hence the difference in\nvertical scale.\nFOWLER AND YANG: DIAGENESIS IN SEDIMENTARY BASINS EPM 13 - 13\nFrank-Kamenetskii, D. A., Diffusion and Heat Exchange in Chemical\nKinetics, Princeton Univ. Press, Princeton, N. J., 1955.\nFreed, R. L., and D. R. Peacor, Geopressured shale and sealing effect of\nsmectite to illite transition, AAPG Bull., 73, 1223–1232, 1989.\nGautier, J. M., E. H. Oelkers, and J. Schott, Experimental study of\nK-feldspar dissolution rates as a function of chemical affinity at 150\u0001C\nand pH 9, Geochim. Cosmochim. Acta, 58, 4549–4560, 1994.\nKrauskopf, K. B., and D. K. Bird, Introduction to Geochemistry, 3rd ed.,\nMcGraw-Hill, New York, 1995.\nHower, J., E. V. Eslinger, M. E. Hower, and E. A. Perry, Mechanism of\nburial metamorphism of argillaceous sediment: 1. Mineralogical and che-\nmical evidence, Geol. Soc. Am. Bull., 87, 725–737, 1976.\nHuang, W.-L., J. M. Longo, and D. R. Pevear, An experimentally derived\nkinetic model for smectite-to-illite conversion and its use as a geother-\nmometer, Clays Clay Miner., 41, 162–177, 1993.\nHunt, J. M., Generation and migration of petroleum from abnormally pres-\nsured fluid compartments, AAPG Bull., 74, 1–12, 1990.\nLasaga, A. C., Rate laws of chemical reactions, in Kinetics of Geochemical\nProcesses, Rev. Mineral., vol. 8, edited by A. C. Lasaga and R. J.\nKirkpatrick, pp. 1–66, Mineral. Soc. of Am., Washington, D. C., 1981.\nLasaga, A. C., Chemical kinetics of water-rock interactions, J. Geophys.\nRes., 89, 4009–4025, 1984.\nLasaga, A. C., J. M. Soler, J. Ganor, T. E. Burch, and K. L. Nagy, Chemical\nweathering rate laws and global geochemical cycles, Geochim. Cosmo-\nchim. Acta, 58, 2361–2386, 1994.\nNielsen, A. E., The Kinetics of Precipitation, Macmillan, Old Tappan, N. J.,\n1964.\nOrtoleva, P., Geochemical Self-Organisation, Oxford Univ. Press, New\nYork, 1994.\nPearson, M. J., and J. S. Small, Illite-smectite diagenesis and palaeotem-\nperatures in North Sea Quaternary to Mesozoic shale sequences, Clay\nMiner., 23, 109–132, 1988.\nRevil, A., D. Grauls, and O. Brevart, Mechanical compaction of sand\/clay\nmixtures, J. Geophys. Res., 107(B11), 2293, doi:10.1029\/2001JB000318,\n2002.\nRimstidt, J. D., Gangue mineral transport and deposition, in Geochemistry\nof Hydrothermal Ore Deposits, 3rd ed., edited by H. L. Barnes, pp. 487–\n515, John Wiley, Hoboken, N. J., 1997.\nRimstidt, J. D., and H. L. Barnes, The kinetics of silica-water reactions,\nGeochim. Cosmochim. Acta, 44, 1683–1699, 1980.\nSass, B. M., P. E. Rosenberg, and J. A. Kittrick, The stability of illite\/\nsmectite during diagenesis: An experimental study, Geochim. Cosmo-\nchim. Acta, 51, 2103–2115, 1987.\nSharp, J. M., Momentum and energy balance equations for compacting\nsediments, Math. Geol., 8, 305–332, 1976.\nSmith, J. E., The dynamics of shale compaction and evolution in pore-fluid\npressures, Math. Geol., 3, 239–263, 1971.\nSteefel, C. I., and A. C. Lasaga, A coupled model for transport of multiple\nchemical species and kinetic precipitation\/dissolution reactions with\napplication to reactive flow in single phase hydrothermal systems, Am.\nJ. Sci., 294, 529–592, 1994.\nTurcotte, D. L., and G. Schubert,Geodynamics, John Wiley, Hoboken, N. J.,\n1982.\nVelde, B., and G. Vasseur, Estimation of the diagenetic smectite illite\ntransformation in time-temperature space, Am. Mineral., 77, 967–976,\n1992.\nWong, T.-F., S.-C. Ko, and D. L. Olgaard, Generation and maintenance of\npore pressure excess in a dehydrating system. 2. Theoretical analysis,\nJ. Geophys. Res., 102, 841–852, 1997.\nYang, X.-S., Mathematical modelling of compaction and diagenesis in\nsedimentary basins, Ph.D., thesis, Oxford Univ., Oxford, England,\n1998.\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\nA. C. Fowler, Mathematical Institute, University of Oxford, 24-29 St\nGiles’, Oxford OX1 3LB, UK. (fowler@maths.ox.ac.uk)\nX.-S. Yang, Faculty of Engineering, University of Wales, Swansea,\nSingleton Park, Swansea SA2 8PP, UK.\nEPM 13 - 14 FOWLER AND YANG: DIAGENESIS IN SEDIMENTARY BASINS\n"}