{"doi":"10.1007\/s00168-008-0249-4","coreId":"95627","oai":"oai:eprints.lse.ac.uk:25512","identifiers":["oai:eprints.lse.ac.uk:25512","10.1007\/s00168-008-0249-4"],"title":"Impact of sports arenas on land values: evidence from Berlin","authors":["Ahlfeldt, Gabriel M.","Maennig, Wolfgang"],"enrichments":{"references":[{"id":17238679,"title":"Building Homes, Reviving Neighbourhoods: Spillovers from Subsidized Construction of OwnerOccupied Housing in New York City.","authors":[],"date":"2001","doi":null,"raw":"Methuen, London 26 Ellen IG, MH Schill, S Susin, and AE Schwartz (2001) Building Homes, Reviving Neighbourhoods: Spillovers from Subsidized Construction of OwnerOccupied Housing in New York City. J Housing Res 12:185-216 Galster G, P Tatian, and K Pettit (2004) Supportive Housing and Neighborhood Property Value Externalities. Land Econ 80:33-54 Gatzlaff DH and MT Smith (1993) The Impact of the Miami Metrorail on the Value of Residences Near Station Locations. Land Econ 69:54-66 Halvorsen R and R Palmquist (1980) The Interpretation of Dummy Variables in Semilogarithmic Equations. Am Econ Rev 70:474-475 Heikkila E, P Gordon, JI Kim, RB Peiser, HW Richardson, and D Dale-Johnson (1989) What Happened to the CBD-Distance Gradient?: Land Values in a Policentric City. Envir Plan 21:221–232 Isakson HR (1997) An Empirical Analysis of the Determinants of the Value of Vacant Land. J Real Est Res 13:103-114 Jordaan AC, BE Drost, and MA Makgata (2004) Land Value as a Function of Distance from the CBD : The Case of the Eastern Suburbs of Pretoria. South African J Econ Man Sci 7:532-541 Meyer U (1997) Betreten erbeten. Max-Schemeling-Arena in Berlin-Prenzlauer Berg. Bauwelt:1678-1684 Mills ES and R Simenauer (1996) New Hedonic Estimates of Regional Constant Quality House Prices. J Urban Econ 39:209-215 Mitchell DM (2000) School Quality and Housing Values. J Econ 26:53-68 Muellbauer J (1974) Household Production Theory, Quality, and the &quot;Hedonic Technique&quot;. Am Econ Rev 64:977-994 Munneke HJ and BA Slade (2001) A Metropolitan Transaction-Based Commercial Price Index: A Time-Varying Parameter Approach. Real Est Econ 29:55-85 Myerson J and J Hudson (2000) International Interiors. Laurence King, London 27 Noll RG and A Zimbalist (1997) Sports, Jobs and Taxes: Are New Stadiums Worth the Cost? Brookings Rev 15:35-39 Perrault D and A Ferré (2002) Dominique Perrault - Nature-Architecture : Velodrom and Swimming Arena, Berlin. Actar, Barcelona Polensky T (1974) Die Bodenpreise in Stadt und Region München : räumliche Strukturen und Prozessabläufe. Lassleben, Kallmünz Redding SJ and DM Sturm (2008) The Cost of Remoteness: Evidence from German Division and Reunification. Am Econ Rev (in press) Rosen S (1974) Hedonic Prices and Implicit Markets : Product Differentiation in Pure Competition. J Pol Econ 82:34-55 Rosentraub MS (1997) The Myth and the Reality of the Economic Development from Sports. Real Est Iss 22:24-29 Senatsverwaltung für Stadtentwicklung Berlin (2006a) Bodenrichtwertatlas 2006. Berlin Senatsverwaltung für Stadtentwicklung Berlin, 2006b, Urban and Environmental Information System Senatsverwaltung für Wirtschaft Arbeit und Frauen (2004) Zentrenatlas Wirtschaftsstandort Berlin (2. ed.). Regioverlag, Berlin Siegfried J and A Zimbalist (2006) The Economic Impact of Sports Facilities, Teams and Mega-Events. Australian Econ Rev 39:420-427 Tu CC (2005) How Does a New Sports Stadium Affect Housing Values? The Case of FedEx Field. Land Econ 81:379-395 Zaretsky A, M. (2001) Should Cities Pay for Sports Facilities? Reg Economist 2001 28 s F i g u r e – S t a n d a r d L a n d V a l u e s N o t e s : M a p w a s c r e a t e d o n t h e b a s e o f t h e &quot; C i t y a n d E n v i r o n m e n t I n f o r m a t i o n S y s t e m ” o f t h e S e n a t e D e p a r t m e n t . ( K a r t e n g r u n d l a g e : I n f o r m a t i o n s s y s t e m S t a d t u n d U m w e l t d e r S e n a t s v e r w a l t u n g f ü r S t a d t e n t w i c k l u n g )","cites":null},{"id":17238678,"title":"If Alonso Was Right: Accessibility as Determinant for Attractiveness of Urban Location. Hamburg Contemp Econ Disc 12 Ahlfeldt","authors":[],"date":"2007","doi":null,"raw":"Ahlfeldt GM (2007) If Alonso Was Right: Accessibility as Determinant for Attractiveness of Urban Location. Hamburg Contemp Econ Disc 12 Ahlfeldt GM and W Maennig (2008) The Role of Architecture on Urban Revitalisation: The Case of &quot;Olympic Arenas&quot; in Berlin-Prenzlauer Berg: Hamburg Contemp Econ Disc 01 Andersson DE (Households and Accessibility: an Empirical Study of Households’ Valuation to one or more Concentrations of Employment or Services. Disc Pap Urban Reg Econ 97, University of Reading Alonso W (1964) Location Theory. M.I.T. Press, Cambridge, Mass Baade RA (1988) An Analysis of the Economic Rationale for Public Subsidization of Sports Stadiums. Ann Reg Sci 22:37-47 Baade RA (1996) What Explains the Stadium Construction Boom? Real Est Iss 21:5-11 Baade RA and RF Dye (1990) The Impact of Stadiums and Professional Sports on Metropolitan Area Development. Growth Change 21:1-14 Baade RA and AR Sanderson (1997) The Employment Effect of Teams and Sports Facilities. The Brookings Institute, Washington, D.C Baim DV (1990) Sports Stadiums as Wise Investments: An Evaluation. The Heartland Institute, Chicago Bowes DR and KR Ihlanfeldt (2001) Identifying the Impacts of Rail Transit Stations on Residential Property Values. J Urban Econ 50:1 Can A and I Megbolugbe (1997) Spatial Dependence and House Price Index Construction. J Real Est Fin Econ 14:203-222 Carlino G and NE Coulson (2004) Compensating Differentials and the Social Benefits of the NFL. J Urban Econ 56:25-50 25 Caroll TM, TM Clauretie, and J Jensen (1996) Living Next to Godliness: Residential Property Values and Churches. J Real Est Fin Econ 12:319-330 Cheshire PC and S Sheppard (1995) On the Price of Land and the Value of Amenities. Economica 62:247-267 Coates D and BR Humphreys (1999) The Growth Effects of Sport Franchises, Stadia and Arenas. J of Pol Anal Man 18:601-624 Coates D and BR Humphreys (2000) The Stadium Gambit and Local Economic Development. Regulation 23:15-20 Coates D and BR Humphreys (2003) The Effect of Professional Sports on Earnings and Employment in the Services and Retail Sectors in U.S. Cities. Reg Sci Urban Econ 33:175-198 Coates D and BR Humphreys (2006) Proximity benefits and voting on stadium and arena subsidies. J Urban Econ 59:285-299 Colwell PF, CA Dehring, and NA Lash (2000) The Effect of Group Homes on Neighborhood Property Values. Land Econ 76:615 Colwell PF and HJ Munneke (1997) The Structure of Urban Land Prices. J Urban Econ 41:321-336 Colwell PF and HJ Munneke (1999) Land Prices and Land Assembly in the CBD. J Real Est Fin Econ 18:163-171 Colwell PF and CF Sirmans (1993) A Comment on Zoning, Returns to Scale, and the Value of Undeveloped Land. Rev of Econ Stat 75:783-786 Debrezion G, E Pels, and P Rietveld (2006) The Impact of Rail Transport on Real Estate Prices: An Empirical Analysis of the Dutch Housing Market. Tinbergen Inst Disc Pap 2006, 031 3 Dubin RA and C-H Sung (1990) Specification of Hedonic Regressions: Non-nested Tests on Measures of Neighborhood Quality. J Urban Econ 27:97-110 Elkins TH and B Hofmeister (1988) Berlin: The Spatial Structure of a Divided City.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"This paper develops a hedonic price model explaining standard land values in Berlin. The model assesses the impact of three multifunctional sports arenas situated in Berlin-Prenzlauer Berg which were designed to improve the attractiveness of their formerly deprived neighbourhoods. Empirical results confirm expectations about the impact of various attributes on land values. Sports arenas have significant positive impacts within a radius of about 3,000 m. The patterns of impact vary, indicating that the effective impact depends on how planning authorities address potential countervailing negative externalities","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/95627.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/25512\/1\/Impact_of_sports_arenas_on_land_values_%28LSERO_version%29.pdf","pdfHashValue":"77940dbae9c2a11ac10f3e7739b21eaca46baef6","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:25512<\/identifier><datestamp>\n      2018-01-11T17:01:58Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4759<\/setSpec><setSpec>\n      74797065733D434F4C4C53:4C53455F435F454F<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/25512\/<\/dc:relation><dc:title>\n        Impact of sports arenas on land values: evidence from Berlin<\/dc:title><dc:creator>\n        Ahlfeldt, Gabriel M.<\/dc:creator><dc:creator>\n        Maennig, Wolfgang<\/dc:creator><dc:subject>\n        HD100 Land Use<\/dc:subject><dc:subject>\n        HC Economic History and Conditions<\/dc:subject><dc:description>\n        This paper develops a hedonic price model explaining standard land values in Berlin. The model assesses the impact of three multifunctional sports arenas situated in Berlin-Prenzlauer Berg which were designed to improve the attractiveness of their formerly deprived neighbourhoods. Empirical results confirm expectations about the impact of various attributes on land values. Sports arenas have significant positive impacts within a radius of about 3,000 m. The patterns of impact vary, indicating that the effective impact depends on how planning authorities address potential countervailing negative externalities.<\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/25512\/1\/Impact_of_sports_arenas_on_land_values_%28LSERO_version%29.pdf<\/dc:identifier><dc:identifier>\n          Ahlfeldt, Gabriel M. and Maennig, Wolfgang  (2010) Impact of sports arenas on land values: evidence from Berlin.  Annals of Regional Science, 44 (2).  pp. 205-227.  ISSN 0570-1864     <\/dc:identifier><dc:relation>\n        http:\/\/www.springerlink.com\/content\/100498\/<\/dc:relation><dc:relation>\n        10.1007\/s00168-008-0249-4<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/25512\/","http:\/\/www.springerlink.com\/content\/100498\/","10.1007\/s00168-008-0249-4"],"year":2010,"topics":["HD100 Land Use","HC Economic History and Conditions"],"subject":["Article","PeerReviewed"],"fullText":"  \nGabriel M. Ahlfeldt and Wolfgang Maennig \nImpact of sports arenas on land values: \nevidence from Berlin \n \nArticle (Accepted version) \n(Refereed) \nOriginal citation: \nAhlfeldt, Gabriel M. and Maennig, Wolfgang (2008) Impact of sports arenas on land values: \nevidence from Berlin. Annals of regional science . ISSN 1432-0592 (Submitted) \n \nThe original publication is available at http:\/\/www.springerlink.com\/\n \nDOI: 10.1007\/s00168-008-0249-4\n \n© 2008 Springer\n \nThis version available at: http:\/\/eprints.lse.ac.uk\/25512\/\n \nAvailable in LSE Research Online: October 2009 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \nImpact of Sports Arenas on Land Values:  \nEvidence from Berlin \n \n \nP. Gabriel M. Ahlfeldt \nUniversity of Hamburg \nFaculty Economics and Social Sciences \nDepartment of Economics and Business Administration \nChair for Economic Policy \nVon-Melle-Park 5 \n20146 Hamburg \nGermany \nE-mail: ahlfeldt@econ.uni-hamburg.de \nPhone: +49 (0)40 42838 – 5569 \nFax: +49 (0)40 42838 – 6251 \n \nWolfgang Maennig \nUniversity of Hamburg \nFaculty Economics and Social Sciences \nDepartment of Economics and Business Administration \nChair for Economic Policy \nVon-Melle-Park 5 \n20146 Hamburg \nGermany \nE-mail: maennig@econ.uni-hamburg.de \nPhone: +49 (0)40 42838 - 4622 \nFax +49 (0)40 42838 - 6251 \n \n \nAbstract: This paper develops a hedonic price model explaining standard land values in Berlin. The \nmodel assesses the impact of three multifunctional sports arenas situated in Berlin-Prenzlauer Berg \nwhich were designed to improve the attractiveness of their formerly deprived neighbourhoods. \nEmpirical results confirm expectations about the impact of various attributes on land values. Sports \narenas have significant positive impacts within a radius of about 3000 meters. The patterns of impact \nvary, indicating that the effective impact depends on how planning authorities address potential \ncountervailing negative externalities. \nKeywords: Stadium Impact, Land Gradient, Hedonic Regression, Spatial Autocorrelation, Berlin \nJEL classification: R31, R53, R58\n1 \n \n1 \n1 Introduction \nDue to a stadium construction boom, the economic impact of new stadium \ndevelopment has become a more controversial and discussed issue. Politicians who \naddress the citizens’ civic pride by spending large amounts of public money on \nsubsidizing major stadium projects usually have familiar arguments. They affirm that \nthe expenditures will be good investments, due to creation of construction jobs and \nattracting businesses and tourists, leading to stimulation of spending in the \ncommunity and increased tax revenues. Critics maintain that high expectations are \nbased upon unrealistic assumptions about multiplier effects, underestimation of \nsubstitution effects and by neglecting opportunity costs (Baade, 1996; Noll and \nZimbalist, 1997; Rosentraub, 1997; , 2000; Zaretsky, 2001). Econometric ex-post \nevaluation has long supported scepticism regarding the economic benefits of new \nstadium projects, since few positive and often negative impacts have been found on \nincome (Baade, 1988; Baade and Dye, 1990; Coates and Humphreys, 1999), \nemployment (Baade and Sanderson, 1997) and wages (Coates and Humphreys, 2003). \nRelatively few studies have identified positive impacts on employment (Baim, 1990) \nor rents (Carlino and Coulson, 2004) on a city or metropolitan statistical area (MSA) \nlevel. Siegfried and Zimbalist (2006) provide a detailed discussion on why sports \nfacilities have failed to stimulate local economies. \nThis debate, however, might neglect a crucial aspect. Critics themselves emphasize \nthat stadiums and corresponding franchises are relatively small “businesses” \ncompared to major cities or metropolitan areas and that impacts are therefore limited \n(Rosentraub, 1997). At the same time empirical studies usually use aggregated data \non a city or MSA level, instead of focusing on areas for which impact might be \n2 \n \n2 \nexpected. Sometimes neighbourhood activists tend to oppose new stadium \nconstruction, arguing that they expect emerging traffic congestion and crowds to \nlower property values nearby. Contrary to these expectations, Tu (2005), who was the \nfirst to empirically analyse stadium construction from the homeowner perspective by \nusing transaction data on single-family properties, found a clear positive impact on \nproperty prices when investigating the impact of FedEx Field in Prince Georges \nCounty, Maryland, USA. Coates and Humphreys (2006) show that voters in close \nproximity to facilities tend to favour subsidies more than voters living farther from \nthe facilities, indicating that benefits from stadia might exhibit an unequal spatial \ndistribution. \nThe present study investigates the impact of two sports complexes completed during \nthe 1990s in downtown Berlin, Germany, which were explicitly designed to improve \nneighbourhood quality. Impact will be assessed by using highly disaggregated data \nand a comprehensive hedonic model, which explains land value patterns for all of \nBerlin and provides valuable insights on land gradient behaviour and impacts. Our \nresults show that sports arenas have an impact at the neighbourhood scale, although \nthis may vary for different arenas. \nThe remainder of this article is organized as follows. In section 2 two projects are \npresented in detail. Section 3 and 4 discuss data, empirical strategy and \nmethodological issues. Section 5 contains the empirical results and an interpretation. \nSection 6 concludes and gives an outlook. \n3 \n \n3 \n2 Velodrom and Max-Schmeling-Arena \nThe two sports arenas investigated are the Max-Schmeling-Arena and \nVelodrom\/Swimming-Arena, both located in Prenzlauer Berg, a district within former \nEast Berlin.1 The arenas were originally designed to the standards of the International \nOlympic Committee (IOC) as they played a role in the unsuccessful bid of Berlin for \nthe Olympics of 2000. To simplify matters from hereon we refer to \nVelodrom\/Swimming-Arena as Velodrom. As well as serving as Olympic venues for \nboxing (Max-Schmeling-Arena), track cycling and aquatics (Velodrom), all arenas \nwere intended to be regarded as local amenities by neighbouring residents. Special \nattention was paid to appealing architecture of visible buildings and their \nincorporation into park landscapes, thereby providing recreational spaces in one of \nthe most densely populated areas of Berlin. These integrated concepts were honoured \nwith important architectural awards, including the German Architectural Award \n(Velodrom in 1999) and the IOC\/IAKS Gold medal2 (Max-Schmeling-Arena in \n2001). As well as large arenas with capacities for 10000 spectators in the case of \nMax-Schmeling-Arena and 11500 for Velodrom, they have additional facilities for \nnon-professional sports. The sites were chosen to connect well with local public \ntransportation networks. Although no subsequent improvements in public \ninfrastructure were necessary the project total expenditure, financed by land funds, \nreached remarkable dimensions. Max-Schmeling-Arena cost about $118 Million (205 \nMillion DM, current prices) and Velodrom over $295 Million (545 Million DM) \n                                                 \n1\n Exact location of arenas is shown in Figure 1 that also illustrates standard land value pattern for 2006. \n2\n This prize is sponsored by the IOC and the International Association for Sports and Leisure Facilities \n(IAKS) and the only international prize awarded to sports and leisure facilities in operation. \n4 \n \n4 \n(Myerson and Hudson, 2000; Perrault and Ferré, 2002).3 The projects were finished in \n1997 (Max-Schmeling-Arena) and 1999 (Velodrom) leaving more than five years to \nthe time of this study.  \n<-      INSERT FIGURE 1    -> \n \n3 Data and Data Management \nThe study area covers the whole of Berlin, capital city of Germany, which on July 30, \n2006 had 3,399,511 inhabitants and an area of approximately 892 km2. We use \nstandard land values per square meter (Bodenrichtwerte) from the local Committee of \nValuation Experts (Senatsverwaltung für Stadtentwicklung Berlin 2006a), which are \naggregated market values for properties lying within block boundaries and are \nassessed on the basis of statistical evaluation of all transactions during the reporting \nperiod. Data on legal density of development according to the zoning regulations is \nprovided in the form of typical floor space index (FSI) values for the zone.4 The FSI, \nalso called floor space ratio (FSR), is the ratio of building total floor area to the area \nof the corresponding plot of land. Zoning regulations also determine whether \nproperties within a statistical block are to be used for business, industrial or \nresidential purposes.  \nThe data refers to the official statistical block structure, the most disaggregated level \navailable at the Statistical Office of Berlin, as defined in December 2005. In this data \n                                                 \n3\n Dollar values have been calculated based on the average exchange rates during the years of \ncompletion. For Max-Schmeling-Arena the average 1997 exchange rate of 1.7348 DM per dollar has \nbeen applied while values referring to the Velodrom complex rely to the average 1999 exchange rate \nof 1.0658 Euros per Dollar and 1.95583 DM per Euro. \n4\n More information on sources and the process of collection of standard land values is in the data \nappendix. \n5 \n \n5 \nBerlin consists of 15,937 statistical blocks with a median surface area of less than \n20,000 m2, approximately the size of a typical inner-city block of houses. The mean \npopulation of the 12,314 populated blocks was 271 (median 135).5 To analyse this \nhighly disaggregated dataset we employ GIS tools and a projected GIS map of the \nofficial block structure that brings a geographic dimension into our analysis. There is \nGIS information available for public infrastructure such as schools, playgrounds and \nrailway stations enabling generation of impact variables that are discussed in more \ndetail in the section below.6 Information can be retrieved on location attributes, such \nas proximity to water spaces or above ground railway tracks. Furthermore, we use \npopulation data at block-level, including demographic characteristics from the \nStatistical Office of Berlin. All data used in this paper strictly refers to the end of \n2005.7 \n4 Empirical Strategy, Data and Methodological Discussion \nOur empirical strategy consists of two steps. First, we develop a hedonic pricing \nmodel explaining present land value pattern. In the second step we extend the basic \nmodel by a set of dummy- and distance-variables, capturing impacts of the arenas on \nland values. Hedonic models are commonly applied in real estate and urban \neconomics since they treat real estate commodities as bundles of attributes, whose \nprices are estimated using multiple regression. Examples of hedonic pricing models in \nurban economic literature include; construction of house indices (Mills and \nSimenauer, 1996; Can and Megbolugbe, 1997; Munneke and Slade, 2001), impact \n                                                 \n5\n Especially in the outer areas of Berlin there are much larger blocks. These typically cover recreational \nareas such as parks, forest and lakes which are undeveloped and unpopulated and are not included in \nthe present study. \n6\n All GIS maps were provided by the Senate Department of Urban Development (Senatsverwaltung für \nStadtentwicklung) and are based on “The City and Environment Information System” of the Senate \nDepartment (Senatsverwaltung für Stadtentwicklung Berlin, 2006b). \n7\n Standard land values of 2006 are assessed on the base of transactions from the reporting period year \n2005. \n6 \n \n6 \nassessment of of quality of public services (Gatzlaff and Smith, 1993; Bowes and \nIhlanfeldt, 2001), school quality (Mitchell, 2000), group homes (Colwell, Dehring \nand Lash, 2000), churches (Caroll, Clauretie and Jensen, 1996) or even supportive \nhousing (Galster, Tatian and Pettit, 2004). However, with the exception of Tu (2005), \nhedonic analysis of property values has not been applied to the impacts of sports \nstadium construction. \nWe assume that the characteristics of real estate can be described by their structural \nattributes [S], and a set of attributes capturing the effects of the neighbourhood [N] \nand local public services [L], where [N] can be assumed to cover accessibility \nattributes (Muellbauer, 1974; Rosen, 1974): \nFollowing Tu (2005) the relationships in (1) and (2) can be formulated more precisely \nin a regression equation  \nεδδγγββα ++++++++++= kkjjii L...LN...NS...S)Pln( 111111  (1) \nwhere i, j and k represent the number of attributes, β, γ and δ are coefficients and ε is \nan error term. When interpreting regression results in log-linear specifications, the \nattribute coefficient gives the percentage impact of changes in attribute value on \nproperty value. For coefficient values smaller than 10% this rule may also be applied \nto dummy-variables (Ellen, Schill, Susin and Schwartz, 2001).8  \nAny hedonic model must take into account structural and location characteristics such \nas floor space or accessibility to account for profitability and transport costs, theory \ndoes not ultimately determine which variables are to be used in an appropriate \nhedonic specification.. To compare property transactions it is necessary to correct all \ntransactions for a complete set of unit characteristics. Indeed, as noted by Heikkila, et \n                                                 \n8\n For larger coefficient values a simple formula is strongly recommended, providing a much better \napproximation. For a parameter estimate b the percentage effect is equal to (eb – 1) (Halvorsen and \nPalmquist, 1980) \n7 \n \n7 \nal. (1989), a feasible correction for unit characteristics gives the analysis a character \nof referring to land values instead of property prices, while accessibility and other \nlocation and neighbourhood attributes ideally isolate the effects of land value \ncomponents. As we directly focus on land values as the endogenous variable we can \nlargely abstract from unit characteristics and even the price-lot size relationship.9 We \ncapture land use by dummy-variables that identify blocks where considerable retail or \nbusiness activity takes place or where the main use is industrial,10 the remaining \nblocks represent residential areas. We use a variable representing the typical block \nFSI value, allowing for a quadratic term, since land value is expected to increase at a \ndeclining rate with increased FSI. \nLocation characteristics are captured by a set of distance-variables reflecting \naccessibility and proximity to amenities. Following Von Thünen and Alonso (1964), \nthe most important accessibility indicator is distance to CBD  (Dubin and Sung, 1990; \nCheshire and Sheppard, 1995; Isakson, 1997; Jordaan, Drost and Makgata, 2004), \nalthough Heikkila et al. (1989) find that distance to CBD prove to be an inferior \nindicator of accessibility in the Los Angeles region.  \nIn contrast to the usual assumption of one single CBD, Berlin is characterised by duo-\ncentricity. This characteristic emerged during the 1920s and was strengthened during \nthe period of division (Elkins and Hofmeister, 1988). Modelling Berlin as a typical \nmono-centric city could lead to biased estimates (Dubin and Sung, 1990). The Senate \nDepartment of Berlin considers CBD West and CBD East to be of equivalent \nimportance with regard to their functions as employment, retailing and cultural \ncentres (Senatsverwaltung für Wirtschaft Arbeit und Frauen, 2004). Picking up the \n                                                 \n9\n Lot size was typically found to have a concave functional impact on land values (Colwell and \nSirmans, 1993; Colwell and Munneke, 1997) later a convex structure was indicated within \nmetropolitan area central business districts (CBD) (Colwell and Munneke, 1999). \n10\n The Committee of Valuation Experts provides information on land use for all land values. A detailed \ndescription of data sources is provided in the data appendix. \n8 \n \n8 \nidea of access to employment being the major determinant for land valuation (Alonso, \n1964), Ahlfeldt (2007) adopts a basic concept of new economic geography to \nrepresent employment centers in Berlin. Figure 2 highlights the duo-centric structure \nof Berlin. As a consequence our main accessibility measure consists of minimum \ndistance to either CBD West or CBD East.11 \n<-      INSERT FIGURE 2    -> \nWe believe this will make a valuable contribution to land-gradient discussion since \nthere is little empirical evidence available in European and in particular German \ncities.12 Allowing land-gradient to vary across land uses further enriches our \ncontribution. Of course, distance to CBD is only an approximation, the degree to \nwhich local transportation infrastructure is developed may impact on accessibility. \nImpact of public transport on property prices has been investigated by Gatzlaff and \nSmith (1993) and Bowes and Ihlanfeldt (2001), who also discussed related sources of \nnegative externalities. We capture the impact of the public transportation network on \nprice pattern by using distances to metro and suburban railway stations. To capture \nexternalities created by railroad noise, which have a negative impact on property \nvalues (Cheshire and Sheppard, 1995; Debrezion, Pels and Rietveld, 2006), we add \ndistances to above ground railways. In the same way we consider the effects of \nproximity to bodies of water (lakes and rivers), natural amenities that are expected to \nbe a major determinant for the emergence of high quality residential areas. We also \ninclude proximity to playgrounds and schools, providing information on the supply of \npublic services infrastructure.  \n                                                 \n11\n We define CBD West as a point on Breitscheidplatz, the place where the Kaiser-Wilhelm \nMemorial Church stands. CBD East is defined as the crossroads of Friedrichstrasse and Leipziger \nStrasse. Centrality of this point is highlighted by the nearby metro-station called Downtown \n(Stadtmitte). \n12\n One of the few existing studies focuses on Munich and supports theoretical implications \n(Polensky, 1974). \n9 \n \n9 \nAs indicators of neighbourhood quality we add population density and proportions of \nforeign people (Dubin and Sung, 1990; Tu, 2005).13We also consider proportions of \nother potential low-income groups such as people over the age of 65, and young \nprofessionals and students between 18 and 27. Inclusion of the proportion of elder \npopulation will also control for positive impacts such as peaceful atmosphere \n(Andersson, 1994). To assess any impacts related to households with children we use \nproxy-variables of proportions of the population in the age classes: below 6, from 6 to \n15, and from 15 to 18.  \nWe use this concept to account for potential East-West heterogeneity by introducing a \ndummy-variable for West Berlin, which we allow to interact with all explanatory \nvariables to allow for heterogeneity of all implicit attribute prices. \nSpatial dependence may lead to autocorrelation, which violates the assumption of \nzero-correlation between residuals, leading to inefficient OLS estimates and biased \ntest-scores. Intuitively spatial dependence can be imagined to be the result of external \neffects of surrounding areas. One explanation for spatial dependence in property \nprices and rents is that the buyer and seller consider previous transactions that have \noccurred in the immediate vicinity. To deal with spatial dependence, Can and \nMegbolugbe (1997) used a spatial autoregressive explanatory variable that \nrepresented a distance-weighted average of local sales prices that had occurred prior \nto the transaction.14 The spatially lagged variable  takes the following form for block \ni: \njijjijji )]P(1\/d)\/1\/dLagSpatial ∑∑= [(_  (2) \n                                                 \n13\n Inclusion of additional neighborhood characteristics such as income and education would have \nonly been possible at the expense of geographic precision, since no data is available at the level of \nstatistical blocks.  \n14\n Since assessed standard land values all refer to the same point in time we do not have to define \nany relevant pre-transaction period. \n10 \n \n10 \nwhere Pj  is the land value of neighbouring block j and (1\/dij) represents the inverse \nof distance between centroids of blocks i and j.  \nHaving decided to use a spatial weight-matrix using inverse distance weights, then \nthe spatial extent surrounding properties needs to be defined. Can and Megbolugbe \n(1997) found a 3000 m radius to be superior, considering only the three nearest \nproperties. Tu (2005) used a very similar distance of 1.8 miles. To test which of the \nspecifications proposed by Can and Megbolugbe (1997) best match our requirements \nwe calculate inverse distance matrixes according to both specifications. Figure 3 \nshows Moran scatter plots for logarithms of land values for 2006. The plot based on a \ndistance-matrix capturing three nearest blocks (Fig. 3b) clearly exhibits a more linear \nrelationship, better capturing spatial dependence. This is confirmed by a larger \nMoran’s I coefficient.15  \n<-     INSERT FIGURES 3a AND 3b   -> \nSpatially lagged variables not only affect correlations of residuals but also have \npositive effects on the explanatory power of models. This additional advantage is the \nresult of omitted attributes that are most likely correlated across space. Due to the \nlarge explanatory power of the spatial lag variable (i.e. Moran’s I coefficient close to \none) we emphasise that the explanatory power of our model depends only to a minor \nextent on the introduction of the lag-term. In Table 2 we compare the performance of \nour final hedonic baseline-regression (1) with the performance when omitting the lag-\nterm (3). An R² of close to 0.9 indicates that our model performs well when \nneglecting spatial dependence. However, the improvements in residuals following the \n                                                 \n15\n Comparing the effects of different spatial weight matrixes on nominal values yields similar \nresults. We provide scatter-plots of logarithms since we use log-values as endogenous variables. \n11 \n \n11 \nspatial model extension are substantial. In Figure 4 the residuals corresponding to \nmodel (3) (Table 2) are plotted in three dimensional space.16, 17  \n<-    INSERT FIGURE 4     -> \nThe model specification can be expressed in the following way: \nεγ\nβββα\n++\n×+×+×+\n×+\n×+×+\n×+\n×+×+\n+++\n+++=\nLag_Spatial\nd)NEIGHWest(d)LOCWest(d)SRUCTWest(\nc)NEIGHIndustry(\nc)LOCIndustry(c)STRUCTIndustry(\nb)NEIGHBusiness(\nb)LOCBusiness(b)STRUCTBusiness(\naNEIGHaLOCaSTRUCT\nWestIndustryBusiness)Pln(\n321\n3\n21\n3\n21\n321\n321\n(3) \nwhere ln(P) is the natural logarithm of standard land values, Business, Industry and \nWest are dummy-variables capturing land use and spatial heterogeneity, STRUCT, \nLOC and NEIGH are vectors of structural, locational and neighbourhood \ncharacteristics and Spatial_Lag is the spatial autoregressive term  from (2). α, β, γ and \nlower case letters represent the set of coefficients to be estimated and ε is an error \nterm. In Table 1 is a detailed description of components. Attribute-variables interact \nwith dummy-variables to allow implicit prices to vary across space and land use. \n<-    INSERT TABLE 1      -> \nTo capture irregularities in land value pattern due to the presence of Velodrom and \nMax-Schmeling-Arena dummy-variables are introduced, representing mutually \nexclusive distance rings surrounding the arenas. Distance-impact variables \n                                                 \n16\n These residual surfaces also serve as a useful tool to eliminate extreme values. The most western \nblock, isolated and contiguous to Berlin’s boundaries within a forest, has an extremely large residual. \nThis indicates that our model, largely calibrated to inner-city areas, does not explain the valuation of an \nisolated area. Consequently we exclude this observation. \n17\n To check for robustness we consider numerous lag-term specifications, including two, four, five \nand six nearest blocks as well as a specification which considered all blocks within 1500 m. However, \nMoran scatter plots and R² both suggest that the final model performs best in capturing spatial \ndependence. \n12 \n \n12 \nrepresenting distance from block centroids to the subject arena are introduced \nsubsequently. We allow for quadratic terms in distances and interact dummy- with \ndistance-variables to identify the most appropriate function.  \n5 Empirical Results \n5.1 Baseline Hedonic Model \nThe baseline hedonic model (Table 2, column 1) performs satisfactorily with all \ncoefficients showing the expected signs. The theoretically predicted negative \ndistance-price relationship is much larger for West Berlin. The significantly negative \ncoefficient on West x Dist_Cent can be interpreted as the persistence of different \nspatial equilibriums that emerged during the time of division, which has already been \nfound for Germany on regional scale (Redding and Sturm, 2008). In East Berlin, no \nfree markets were allowed for decades, so there may be continuing market \nsegmentation between population segments with different preferences and\/or budget \nconstraints..  \n<-     INSERT TABLE 2     -> \nLand gradient varies across space and land use. As expected, for residential and \nindustrial areas centrality is clearly important. However, the significant positive \ncoefficient on Business x Dist_Cent shows that the location premium that business \nusers are willing to pay is not linked strongly to distance from CBD. Apparently, \nremoteness is less problematic for business use. This may be explained by business, \nparticularly retailers, having considerable market access in suburban areas. In \ncontrast, for residents there is no alternative to the CBD for various specialized \nservices. Proximity to metro and suburban railway stations has a significantly larger \nimpact on prices paid for business real estate than for other land uses. In West Berlin \nthe proximity to suburban railway stations appears to have a significantly larger \n13 \n \n13 \nimpact on property valuation than in East Berlin, while for metro stations the opposite \nis true. This pattern might be partially attributable to the more developed metro \nnetwork of West Berlin, whereas in East Berlin the suburban railway system \ndominates.18 The implication is that if a particular service is provided relatively \nevenly across locations, residents then no longer recognize it as a local amenity. A \nsimilar argument applies for schools and playgrounds that have virtually no impact on \nland values.  \nPopulation density has a negative impact on area valuation and the effect is \nsignificantly stronger within West Berlin. The coefficient on proportions of foreigners \nis also significantly negative, indicating that foreign population indeed concentrates \nin areas of lower valuation, most probably due to lower incomes. This impact is \nsimilar in both parts of the city. The 18 to 27 year-olds also concentrate in areas of \nrelatively lower valuation, probably since this group largely consists of trainees and \nstudents who have left home and are confronted with serious budget constraints. In \ncontrast, people over 65 show no major concentration in economically deprived \nneighborhoods. The coefficient on the proportion of population below the age of six, \na proxy for families with young children, is significantly positive.  \n5.2 Impact of Sports Arenas \nWe consider the general neighbourhood of each arena to be the area within a 5000 m \nradius, which had proved useful in the case of the larger FedEx Field (Tu, 2005). To \ncapture neighbourhood fixed-effects we create two dummy-variables denoting all \nblocks lying within each of those impact-areas. In our first approach to assess arena \nimpact we introduce two sets of mutually exclusive distance rings surrounding both \n                                                 \n18\n Even before Berlin’s division the largest part of the metro network was within the western part of \nthe city. However, after separation this imbalance increased. Since the eastern Municipal Transport \nServices managed the suburban railway network, the western authorities focused on the improvement \nof metro infrastructure.  \n14 \n \n14 \narenas, again represented by dummy-variables. For each arena, four 1000 m radius \nrings, the first from 0-1000 m, the second 1000-2000 m, etc. are added to capture \neffects across distance. The results of this basic impact model are presented in column \n(1) of Table 3, with robustness checked by comparison with individual estimations of \neach arena impact in columns (2) and (3).19  \n<-     INSERT TABLE 3-     > \nBoth neighbourhood effects show negative coefficient values, indicating that arenas \nare located in relatively undervalued areas. Coefficients estimates for distance rings \n2000-4000 m were not significant, indicating no systematic effect on the \nneighbourhood. In contrast, coefficients for the 1000-2000 m distance ring have \npositive values of similar size and are statistically significant at conventional levels. \nThese suggest a positive arena impact of around 3.5% within both areas. In the \nimmediate proximities, however, results differ substantially for Velodrom and Max-\nSchmeling-Arena. In the case of Velodrom the impact in 0-1000 m is approximately \n7.5% while for Max-Schmeling-Arena it is not significantly different from zero. \nThese results suggest a positive impact of Velodrom on land values, decreasing with \ndistance and disappearing within the 2000-3000 m ring. However, for Max-\nSchmeling-Arena a positive impact was only found at 1000-2000 m, implying an \nimpact on land values that first increases and then decreases with distance and \ndisappears within the 2000-3000 m ring.  \nAlthough both arenas are situated in general neighbourhoods in which properties \nappear to sell at a discount, this discount does not increase with proximity to the \narenas as for the FedEx Field (Tu, 2005).Within the general neighbourhood, the \narenas seem to have significant positive impacts. In immediate proximity to \n                                                 \n19\n Results for individual and simultaneous estimation show the same general pattern. \n15 \n \n15 \nVelodrom, for instance, positive impacts outweigh the general neighbourhood \ndisadvantages.  \nTo confirm these results and to find the most appropriate functional form of arena-\nimpact, we introduce distance-based variables and set up two series of hedonic \nmodels (Table 4). Our results suggest that impacts are limited to a distance of 3000 \nm. We consequently omit the 3000-4000 m dummy-variable in following models. As \nsuggested by Tu (2005), three distinct model specifications are tested. In column (1) \nof Table 4 (a and b) the specification used in Table 3  is repeated, but omitting the \n3000-4000 m dummy-variable. Column (2) tests for a linear impact of distance to \narena, therefore the 0-1000 m and 1000-2000 m dummy-variables are substituted with \nan interactive term that consists of the 0-3000 m dummy interacted with distance to \narena. Column (3) specification allows for a quadratic term to account for non-linear \neffects, in particular for the potentially parabolic form of impact of Max-Schmeling-\nArena. \n<-     INSERT TABLES 4a AND 4b   -> \nThe results in Table 4 are similar to those of Table 3. For Velodrom, we find a highly \nsignificant linear distance-price relationship. The quadratic distance term is not \nstatistically significant. For Max-Schmeling-Arena, in contrast, specification (3) \nclearly provides a better fit. Both interactive distance terms are significant, revealing \nthat the pattern of land value impact is in a parabolic form. Having identified the \nappropriate functional form for each arena we finally estimate coefficients for both \narenas, assuming that the land value-distance relationship is linear for Velodrom and \nquadratic for Max-Schmeling-Arena. Level-effects are now omitted for Max-\nSchmeling-Arena since the corresponding dummy-variable was not statistically \n16 \n \n16 \nsignificant in specification (3) of Table 4b.20 Estimations for our final hedonic \nspecification are presented in Table 5.  \n<-     INSERT TABLE 5     -> \nThese results are presented graphically in Figure 5 where the relative land value \ngradients are plotted, based on the corresponding coefficient estimates. \nTo provide a better spatial impression of both overlapping arena-impacts the \ndifferences in residuals were plotted, between our final hedonic impact specification \n(Table 5) and the hedonic baseline specification of column (1) Table 4 in three \ndimensional space (Figure 6). It can be shown that these differences correspond to the \nestimated arena impacts. Assuming that  \nεβα ++= BASE)Pln(  (4) \nrepresents our hedonic baseline specification and \nµMSVELOBASE)Pln( ++++= δγβα  (5) \nis our final hedonic impact specification, where BASE is a vector of attribute variables \nincluded in our baseline model, VELO is a vector of impact variables related to \nVelodrom and MS is similar for Max-Schmeling-Arena. β, γ and δ represent sets of \ncoefficients to be estimated and ε and µ  are error terms. Taking differences yields: \nδγµε MSVELO +=−  (6) \nIn our econometric specification this relationship corresponds to taking differences \nbetween residuals in order to visualize the additional explanatory power provided by \nthe introduction of impact variables. \n<-    INSERT FIGURES 5 and 6   -> \n                                                 \n20\n We only omit the 0-3000 m dummy-variable for Max-Schmeling-Arena. Neighbourhood fixed \neffects are still captured in two 0-5000 m area dummy-variables. \n17 \n \n17 \nFigures 5 and 6 demonstrate how irregularities in land value pattern are attributable to \nthe locations of Max-Schmeling-Arena and Velodrom. For both arenas there is a \nconsistent pattern of impacts at distances ranging from 1500 to 3000 m. Impacts are \npositive, decrease with distance and disappear after 3000 m. If these positive impacts \nare attributable to the presence of the arenas, one would intuitively expect location \npremium to be highest in the immediate proximity, since positive external effects \nshould lose intensity with increasing distance. While this story fits the results for \nVelodrom, it conflicts with the estimations for the immediate vicinity of Max-\nSchmeling-Arena. \nHowever, the estimated pattern of impact becomes more conclusive when \ncountervailing externalities are considered (Galster, Tatian and Pettit, 2004). Instead \nof assuming the existence of just one positive (or negative) externality, various \npositive and negative externalities should be considered. Assuming that distinct \nexternalities differ in range, size and sign; externalities may cancel each other out \nwithin a certain distance range, while at other distances one externality may \ndominate. As previously discussed, Velodrom and Max-Schmeling-Arena are \ncomparable in terms of utilization, architectural quality, physical size and provision \nof new recreational spaces, suggesting that positive externalities should be \ncomparable. The distinct impacts may be caused by negative externalities of limited \nrange that are associated with Max-Schmeling-Arena. Ahlfeldt and Maennig (2008) \nprovide a detailed discussion on how parking scarcity caused by a lack of additional \nparking facilities adversely impacts on property prices in proximity to Max-\nSchmeling-Arena.21 Moreover, in contrast to Velodrom, Max-Schmeling-Arena is the \n                                                 \n21\n The original plans for Max-Schmeling-Arena included an underground car park. These plans were \nabandoned after Berlin’s bid for the 2000 Olympics was rejected by the IOC (Meyer, 1997).  \n18 \n \n18 \nhome of two sports clubs of national importance.22 The regular presence of highly \ninvolved fans may represent a source of noise and disturbances that might have an \nadditional price depreciating effect. This potentially affects land values by \nparticularly discouraging car-owning households. In the case of Velodrom an \nadjoining empty lot was transformed into a car-park, whereas the absence of such \navailable space in the proximity of Max-Schmeling-Arena has meant that the problem \nis still unsolved. \n6 Conclusion \nThis paper contributes to the wider discussion on land value behaviour as well as to \nthe more specific debate on stadium impact. Application of GIS techniques and \nhighly disaggregated data allowed the development of a cross-sectional hedonic \nmodel capturing the full range of structural and location attributes, as well as spatial \nspill-over effects. While controlling for location and neighbourhood characteristics, \nland values in Berlin show some peculiarities. One and a half decades after re-\nunification the land gradient is significantly flatter for East Berlin, indicating that the \npossible effects of four decades of centralized allocation of land are still persistent. At \nleast we find two segmented markets in disequilibrium that if at all, tend towards an \nintegrated equilibrium very slowly. This finding points to high transaction costs \nassociated to spatial arbitrage and is particularly striking in light of the ongoing \ndebate about the existence of multiple equilibria in spatial distribution of economic \nactivity. Allowing for variation of land gradient reveals that the location premium that \nbusiness is willing to pay is less sensitive to remoteness than that of residents. These \nfindings reflect the presence of numerous and relatively strong sub-centers in \nsuburban areas of Berlin where business finds considerable market access. The more \n                                                 \n22\n Resident teams are the basketball team of “Alba Berlin” and the handball team of “Füchse \nBerlin”. \n19 \n \n19 \ndistinct relation of business land values and distance to public transportation \nhighlights the importance of market access for business. The results suggest that for \nresidents the specialized services of the CBD are less substitutable by those of sub-\ncenters.  \nThe baseline hedonic model was extended by a set of geographic variables attributing \nunexplained land value variation to the location of Velodrom and Max-Schmeling-\nArena. While the presence of Velodrom has a significantly positive impact on land \nvalues, decreasing with distance, Max-Schmeling-Arena has more ambiguous effects; \nthere are no positive effects in close proximity, but relative land values increase in \nmore distant proximity. Since positive externalities emanated by arenas are expected \nto be comparable, the distinct patterns of impact on land values can be explained by \nthe presence of countervailing negative externalities of limited range that surround \nMax-Schmeling-Arena. Besides potential problems caused by fans, traffic \ncongestions following unrealistic assumptions about visitors’ travel customs prove to \nbe obvious explanation. Bearing in mind that arenas were suited with a sophisticated \ndesign in order to contribute to an increase in location desirability of their \nneighbourhoods, our results suggest that the relatively large investments, for which \nthe projects had been criticized, may be justifiable from ex-post perspective. \nHowever, results do not allow for a precise separation of effects associated to the \noriginal functions of sports facilities and those related to sophisticated architecture \nand urban design.  \nOur results suggest that the arenas have an impact within a radius of approximately \n3000 m. This result is to be compared with Tu (2005), who identified a three-mile \nimpact area for the much larger FedEx Field. Empirical results of studies using \naggregated data should be interpreted carefully in light of these findings. It confirms \n20 \n \n20 \nthe insights of Coates and Humphrey (2006) who – on the basis of analysing voting \nbehaviour in Stadia polls – argue that researchers should focus on the spatial aspects \nof sport-related economic effects. Any impact that does not exceed a range of a few \nmiles may hardly be expected to significantly influence aggregated values for entire \nmetropolitan areas. Consequently, the absence of measurable effects at high levels of \naggregation does not imply an absence of impact at the neighbourhood scale. \n21 \n \n21 \nData Appendix \nWe collected data on standard land values, FSI values and land use as determined by \nzoning regulations from atlases of standard land valuation (Bodenrichtwertatlanten) \n(Senatsverwaltung für Stadtentwicklung Berlin, 2006a). The Committee of Valuation \nExperts in Berlin have been publishing these atlases at intervals of one to four years, \nsince 1967. \nData collection was conducted by assigning values represented in atlases of standard \nland valuation to the official block structure as defined in December 2005. If more \nthan one value was provided by an atlas of standard land valuation for one particular \nblock, then an average of the highest and lowest values was used. Price data has been \ncollected individually for blocks, which were not used for purely residential purposes. \nIn contrast, for pure residential areas data on land values at a lower level of \ndisaggregation (Statistische Gebiete) was used, since variation was typically much \nsmaller. Since Berlin consists of 195 statistical areas (Statistische Gebiete), this \nensured that price data for residential areas was sufficiently disaggregated to draw a \ncomprehensive picture. Aggregation to statistical area-level was by averaging the \nhighest and lowest standard land values within the respective area. To guarantee that \naverages represented a feasible proxy of overall area valuation a threshold for the \nratio of maximum-to-minimum land value within a statistical area was introduced. If \nthis ratio was > 2, then the extreme values were entered individually and averages \nwere taken over the remaining blocks until the ratio had fallen below the threshold \nvalue. This had to be done in only very few cases, since generally maximum and \nminimum values were close. This short cut accelerated data entry enormously, with \nlimited losses in data quality. However, for the areas of potential arena impact \n22 \n \n22 \nconsisting of Prenzlauer Berg and the adjoining, land values were on block level for \nall land uses. \n23 \n \n23 \nAcknowledgements: \nWe would like to thank the editors and two anonymous referees for valuable \ncomments and suggestions. We acknowledge the support of the Berlin Senate \nDepartment for Urban Development for provision of Data and GIS content. We \nwould also like to thank seminar participants at University of Hamburg, in particular \nArne Feddersen, for valuable comments and suggestions. \n24 \n \n24 \nReferences \nAhlfeldt GM (2007) If Alonso Was Right: Accessibility as Determinant for \nAttractiveness of Urban Location. Hamburg Contemp Econ Disc 12 \nAhlfeldt GM and W Maennig (2008) The Role of Architecture on Urban \nRevitalisation: The Case of \"Olympic Arenas\" in Berlin-Prenzlauer Berg: \nHamburg Contemp Econ Disc 01 \nAndersson DE (Households and Accessibility: an Empirical Study of Households’ \nValuation to one or more Concentrations of Employment or Services. Disc \nPap Urban Reg Econ 97, University of Reading \nAlonso W (1964) Location Theory. M.I.T. Press, Cambridge, Mass \nBaade RA (1988) An Analysis of the Economic Rationale for Public Subsidization of \nSports Stadiums. Ann Reg Sci 22:37-47 \nBaade RA (1996) What Explains the Stadium Construction Boom? Real Est Iss 21:5-\n11 \nBaade RA and RF Dye (1990) The Impact of Stadiums and Professional Sports on \nMetropolitan Area Development. Growth Change 21:1-14 \nBaade RA and AR Sanderson (1997) The Employment Effect of Teams and Sports \nFacilities. The Brookings Institute, Washington, D.C \nBaim DV (1990) Sports Stadiums as Wise Investments: An Evaluation. The \nHeartland Institute, Chicago \nBowes DR and KR Ihlanfeldt (2001) Identifying the Impacts of Rail Transit Stations \non Residential Property Values. J Urban Econ 50:1 \nCan A and I Megbolugbe (1997) Spatial Dependence and House Price Index \nConstruction. J Real Est Fin Econ 14:203-222 \nCarlino G and NE Coulson (2004) Compensating Differentials and the Social \nBenefits of the NFL. J Urban Econ 56:25-50 \n25 \n \n25 \nCaroll TM, TM Clauretie, and J Jensen (1996) Living Next to Godliness: Residential \nProperty Values and Churches. J Real Est Fin Econ 12:319-330 \nCheshire PC and S Sheppard (1995) On the Price of Land and the Value of \nAmenities. Economica 62:247-267 \nCoates D and BR Humphreys (1999) The Growth Effects of Sport Franchises, Stadia \nand Arenas. J of Pol Anal Man 18:601-624 \nCoates D and BR Humphreys (2000) The Stadium Gambit and Local Economic \nDevelopment. Regulation 23:15-20 \nCoates D and BR Humphreys (2003) The Effect of Professional Sports on Earnings \nand Employment in the Services and Retail Sectors in U.S. Cities. Reg Sci \nUrban Econ 33:175-198 \nCoates D and BR Humphreys (2006) Proximity benefits and voting on stadium and \narena subsidies. J Urban Econ 59:285-299 \nColwell PF, CA Dehring, and NA Lash (2000) The Effect of Group Homes on \nNeighborhood Property Values. Land Econ 76:615 \nColwell PF and HJ Munneke (1997) The Structure of Urban Land Prices. J Urban \nEcon 41:321-336 \nColwell PF and HJ Munneke (1999) Land Prices and Land Assembly in the CBD. J \nReal Est Fin Econ 18:163-171 \nColwell PF and CF Sirmans (1993) A Comment on Zoning, Returns to Scale, and the \nValue of Undeveloped Land. Rev of Econ Stat 75:783-786 \nDebrezion G, E Pels, and P Rietveld (2006) The Impact of Rail Transport on Real \nEstate Prices: An Empirical Analysis of the Dutch Housing Market. Tinbergen \nInst Disc Pap 2006, 031 3 \nDubin RA and C-H Sung (1990) Specification of Hedonic Regressions: Non-nested \nTests on Measures of Neighborhood Quality. J Urban Econ 27:97-110 \nElkins TH and B Hofmeister (1988) Berlin: The Spatial Structure of a Divided City. \nMethuen, London \n26 \n \n26 \nEllen IG, MH Schill, S Susin, and AE Schwartz (2001) Building Homes, Reviving \nNeighbourhoods: Spillovers from Subsidized Construction of Owner-\nOccupied Housing in New York City. J Housing Res 12:185-216 \nGalster G, P Tatian, and K Pettit (2004) Supportive Housing and Neighborhood \nProperty Value Externalities. Land Econ 80:33-54 \nGatzlaff DH and MT Smith (1993) The Impact of the Miami Metrorail on the Value \nof Residences Near Station Locations. Land Econ 69:54-66 \nHalvorsen R and R Palmquist (1980) The Interpretation of Dummy Variables in \nSemilogarithmic Equations. Am Econ Rev 70:474-475 \nHeikkila E, P Gordon, JI Kim, RB Peiser, HW Richardson, and D Dale-Johnson \n(1989) What Happened to the CBD-Distance Gradient?: Land Values in a \nPolicentric City. Envir Plan 21:221–232 \nIsakson HR (1997) An Empirical Analysis of the Determinants of the Value of \nVacant Land. J Real Est Res 13:103-114 \nJordaan AC, BE Drost, and MA Makgata (2004) Land Value as a Function of \nDistance from the CBD : The Case of the Eastern Suburbs of Pretoria. South \nAfrican J Econ Man Sci 7:532-541 \nMeyer U (1997) Betreten erbeten. Max-Schemeling-Arena in Berlin-Prenzlauer Berg. \nBauwelt:1678-1684 \nMills ES and R Simenauer (1996) New Hedonic Estimates of Regional Constant \nQuality House Prices. J Urban Econ 39:209-215 \nMitchell DM (2000) School Quality and Housing Values. J Econ 26:53-68 \nMuellbauer J (1974) Household Production Theory, Quality, and the \"Hedonic \nTechnique\". Am Econ Rev 64:977-994 \nMunneke HJ and BA Slade (2001) A Metropolitan Transaction-Based Commercial \nPrice Index: A Time-Varying Parameter Approach. Real Est Econ 29:55-85 \nMyerson J and J Hudson (2000) International Interiors. Laurence King, London \n27 \n \n27 \nNoll RG and A Zimbalist (1997) Sports, Jobs and Taxes: Are New Stadiums Worth \nthe Cost? Brookings Rev 15:35-39 \nPerrault D and A Ferré (2002) Dominique Perrault - Nature-Architecture : Velodrom \nand Swimming Arena, Berlin. Actar, Barcelona \nPolensky T (1974) Die Bodenpreise in Stadt und Region München : räumliche \nStrukturen und Prozessabläufe. Lassleben, Kallmünz \nRedding SJ and DM Sturm (2008) The Cost of Remoteness: Evidence from German \nDivision and Reunification. Am Econ Rev (in press) \nRosen S (1974) Hedonic Prices and Implicit Markets : Product Differentiation in Pure \nCompetition. J Pol Econ 82:34-55 \nRosentraub MS (1997) The Myth and the Reality of the Economic Development from \nSports. Real Est Iss 22:24-29 \nSenatsverwaltung für Stadtentwicklung Berlin (2006a) Bodenrichtwertatlas 2006. \nBerlin \nSenatsverwaltung für Stadtentwicklung Berlin, 2006b, Urban and Environmental \nInformation System \nSenatsverwaltung für Wirtschaft Arbeit und Frauen (2004) Zentrenatlas \nWirtschaftsstandort Berlin (2. ed.). Regioverlag, Berlin \nSiegfried J and A Zimbalist (2006) The Economic Impact of Sports Facilities, Teams \nand Mega-Events. Australian Econ Rev 39:420-427 \nTu CC (2005) How Does a New Sports Stadium Affect Housing Values? The Case of \nFedEx Field. Land Econ 81:379-395 \nZaretsky A, M. (2001) Should Cities Pay for Sports Facilities? Reg Economist 2001 \n28 \n \n28 \n \n \ns \n \nFi\ngu\nre\n \n1 \n–\n \nSt\na\nn\nda\nrd\n \nLa\nn\nd \nV\na\nlu\nes\n \n20\n06\n \nN\no\nte\ns:\n \nM\nap\n \nw\nas\n \ncr\nea\nte\nd \no\nn\n \nth\ne \nba\nse\n \no\nf t\nhe\n \n\"\nCi\nty\n \nan\nd \nEn\nv\niro\nn\nm\nen\nt I\nn\nfo\nrm\nat\nio\nn\n \nSy\nst\nem\n”\n \no\nf t\nhe\n \nSe\nn\nat\ne \nD\nep\nar\ntm\nen\nt. \n(K\nar\nte\nn\ngr\nu\nn\ndl\nag\ne:\n \nIn\nfo\nrm\nat\nio\nn\nss\nys\nte\nm\n \nSt\nad\nt u\nn\nd \nU\nm\nw\nel\nt d\ner\n \nSe\nn\nat\nsv\ner\nw\nal\ntu\nn\ng \nfü\nr \nSt\nad\nte\nn\ntw\nic\nkl\nu\nn\ng) \n29 \n \n29 \nFigure 2 – Employment Potentiality in Berlin \n \nSource: (Ahlfeldt, 2007). \n30 \n \n30 \nFigure 3a – Spatial Dependence with 3000 meter Specification \n \nNotes: LOG(LV2006) are natural logarithms of the standard land values of Berlin for 2006. W_LOG(LV2006) are the \ncorresponding spatial lag values calculated on the basis of the respective spatial weight matrix. The corresponding Moran’s I test \nstatistics is 0.7051. \n31 \n \n31 \n \nFigure 3b – Spatial Dependence with 3 Nearest Blocks Specification \n \nNotes: LOG(LV2006) are natural logarithms of the standard land values of Berlin for 2006. W_LOG(LV2006) are the \ncorresponding spatial lag values calculated on the basis of the respective spatial weight matrix. The corresponding Moran’s I test \nstatistics is 0.9346. \n \n32 \n \n32 \nFigure 4 – Gridded Residual Surface of Spatially Extended Model \n \n33 \n \n33 \nFi\ngu\nre\n \n5 \n–\n \nEs\ntim\na\nte\nd \nIm\npa\nct\n \no\nf V\nel\no\ndr\no\nm\n \na\nn\nd \nM\na\nx\n-\nSc\nhm\nel\nin\ng-\nA\nre\nn\na\n \no\nn\n \nSt\na\nn\nda\nrd\n \nLa\nn\nd \nV\na\nlu\nes\n \nN\no\nte\ns:\n \nTh\ne \ngr\nap\nhs\n \ndi\nsp\nla\nye\nd \nin\n \nth\nis \nfig\nu\nre\n \nar\ne \nth\ne \ngr\nap\nhi\nca\nl i\nllu\nst\nra\ntio\nn\ns \no\nf c\no\nef\nfic\nie\nn\nt e\nst\nim\nat\nes\n \nre\npr\nes\nen\nte\nd \nin\n \nta\nbl\ne \n5.\n \n \n34 \n \n34 \n \n \n \nFi\ngu\nre\n \n6 \n–\n \nEs\ntim\na\nte\nd \nIm\npa\nct\n \no\nf V\nel\no\ndr\no\nm\n \na\nn\nd \nM\na\nx\n-\nSc\nhm\nel\nin\ng-\nA\nre\nn\na\n \no\nn\n \nSt\na\nn\nda\nrd\n \nLa\nn\nd \nV\na\nlu\nes\n \nN\no\nte\ns:\n \nTh\nis \npl\no\nt r\nep\nre\nse\nn\nts\n \nth\ne \ngr\nid\nde\nd \nsu\nrfa\nce\n \no\nf r\nes\nid\nu\nal\ns’\n \ndi\nffe\nre\nn\nce\ns \nbe\ntw\nee\nn\n \no\nu\nr \nhe\ndo\nn\nic\n \nba\nse\nlin\ne \nsp\nec\nifi\nca\ntio\nn\n \nan\nd \nth\ne \nfin\nal\n \nim\npa\nct\n \nm\no\nde\nl. \n \nIt \nco\nv\ner\ns \nth\ne \nes\ntim\nat\ned\n \nar\nea\n \no\nf i\nm\npa\nct\n \nfo\nr \nbo\nth\n \nar\nen\nas\n.\n \nCo\no\nrd\nin\nat\nes\n \nar\ne \ngi\nv\nen\n \nin\n \npr\no\njec\nte\nd \nm\net\ner\n \nu\nn\nits\n \no\nf t\nhe\n \n“\nSo\nld\nn\ner\n”\n \nco\no\nrd\nin\nat\ne \nsy\nst\nem\n \nw\nhi\nch\n \nis \nu\nse\nd \nby\n \nth\ne \nSe\nn\nat\ne \nD\nep\nar\ntm\nen\nt o\nf B\ner\nlin\n.\n \n \nTh\ne \no\nrig\nin\n \no\nf t\nhi\ns \nco\no\nrd\nin\nat\ne \nsy\nst\nem\n \nis \nth\ne \nm\no\nst\n \nso\nu\ntw\nes\nte\nrn\n \npo\nin\nt o\nf B\ner\nlin\n.\n \n35 \n \n35 \nTable 1 – Description of Variables and Abbreviations \n \nVariable Description \nBusiness  Dummy-variable; 1 for blocks where a considerable amount of retail and\/or \noffice activity takes place \nIndustry Dummy-variable; 1 for blocks where land is at least partially used for industrial purposes \nWest Dummy-variable; 1 for blocks lying within the area of former West-Berlin \nFSI Floor-Space-Index: Quotient of full storey-area and plot-area \nFSI² Floor-Space-Index squared \nDist_Cent Shortest great circle distance to CBD East or West in meters \nDist_Metro Great circle distance to next metro-station in meters \nDist_Suburban Great circle distance to next suburban railway-station in meters \nDist_Water Great circle distance to next water space in meters (lake or river) \nDist_Schools Great circle distance to next school in meters \nDist_Play Great circle distance to next playground in meters \nDist_Rail Great circle distance to over-ground railway tracks in meters \nPop_Prop_Sub6 Proportion of population below the age of 6  \nPop_Prop_6_15 Proportion of population of age group: 6 to 15 years  \nPop_Prop_15_18 Proportion of population of age group: 15 to 18 years  \nPop_Prop_18_27 Proportion of population of age group: 18 to 27 years \nPop_Prop_65plus Proportion of population above the age of 65  \nPop_Density Population density (inhabitants per square meter) \nProp_Foreigners Proportion of foreign population \nProp_Male Proportion of male population  \nSpatial_Lag Spatial autoregressive term as described in the methodology section \nSTRUCT Vector of structural characteristics including FSI and FSI² \nLOC Vector of locatioal characteristics including Dist_Cent, Dist_Metro, Dist_Suburban, Dist_Water, Dist_Schools, Dist_Play, Dist_Rail \nNEIGH \nVector of neighbourhood characteristics including Pop_Prop_Sub6, \nPop_Prop_6_15, Pop_Prop_15_18, Pop_Prop_18_27, Pop_Prop_65plus, \nPop_Density, Prop_Foreigners, Prop_Male \n \n36 \n \n36 \nTable 2 – Baseline Empirical Results of Hedonic Analysis (1-3) \n (1) (2) (3) \n Land Value \n(Log) \nLand Value \n(Log) \nLand Value \n(Log) \nIntercept 1.419380*** (0.067685) \n1.409932*** \n(0.069337) \n4.770188*** \n(0.013161) \nBusiness -0.476554*** (0.178338) \n-0.555828*** \n(0.206850) \n0.049848 \n(0.226227) \nIndustry -0.201496*** (0.052465) \n-0.659793*** \n(0.184922) \n-0.483550*** \n(0.072417) \nWest 0.677466*** (0.038296) \n0.678161*** \n(0.041387) \n2.105208*** \n(0.032986) \nFSI 0.241159*** (0.016054) \n0.250090*** \n(0.015889) \n0.702962*** \n(0.014560) \nFSI² -0.025354*** (0.005085) \n-0.030463*** \n(0.004964) \n-0.056465*** \n(0.005059) \nDist_Cent -0.00000438*** (0.000000587) \n-0.00000444*** \n(0.000000599) \n-0.0000179*** \n(0.00000084) \nDist_Metro -0.00000211*** (0.000000625) \n-0.000018*** \n(0.000000659) \n-0.00000865*** \n(0.00000118) \nDist_Suburban -0.0000113*** (0.00000341) \n-0.0000104*** \n(0.00000362) \n-0.0000485*** \n(0.00000392) \nDist_Water -0.0000118*** (0.00000201) \n-0.0000113*** \n(0.000002) \n-0.0000415*** \n(0.00000253) \nDist_Schools  0.000000299 (0.0000041) \n \nDist_Play  -0.0000019 (0.00000302) \n \nDist_Rail 0.0000122*** (0.00000327) \n0.0000117*** \n(0.0000034) \n0.0000468*** \n(0.0000042) \nPop_Prop_Sub6 0.062190** (0.025417) \n0.054859** \n(0.025282) \n0.103997** \n(0.051869) \nPop_Prop_6_15  0.006943 (0.019842) \n \nPop_Prop_15_18  -0.006325 (0.024015) \n \nPop_Prop_18_27 -0.046841*** (0.0057) \n-0.040212** \n(0.019973) \n-0.235991*** \n(0.034376) \nPop_Prop_65plus  -0.026906** (0.013406) \n \nPop_Density -0.737185*** (0.0012) \n-0.705164*** \n(0.225787) \n-0.846712*** \n(0.253823) \nProp_Foreigners -0.085958*** (0.018556) \n-0.059999* \n(0.035007) \n-0.096806*** \n(0.030934) \nProp_Male  0.006376 (0.017495) \n \nBusiness x FSI 0.355788*** (0.104214) \n0.371846*** \n(0.110039) \n0.138966 \n(0.129089) \nBusiness x FSI² -0.030011* (0.015922) \n-0.027947* \n(0.016820) \n0.024650 \n(0.019060) \nBusiness x Dist_Cent 0.0000499*** (0.00000637) \n0.0000534*** \n(0.00000699) \n0.0000783*** \n(0.0000114) \nBusiness x Dist_Metro -0.0000304* (0.0000161) \n-0.0000435** \n(0.0000167) \n-0.000119*** \n(0.0000187) \n37 \n \n37 \nTable 2 – Baseline Empirical Results of Hedonic Analysis (2-3) \nBusiness x Dist_Suburban -0.000064* (0.0000347) \n-0.0000927* \n(0.0000532) \n-0.000188*** \n(0.0000442) \nBusiness x Dist_Water 0.0000402*** (0.0000127) \n0.0000430*** \n(0.0000129) \n0.0000240 \n(0.0000153) \nBusiness x Dist_Schools  -0.00000580 (0.0000806) \n \nBusiness x Dist_Play  -0.0000188 (0.0000885) \n \nBusiness x Dist_Rail  0.0000512 (0.0000498) \n \nBusiness x Pop_Prop_Sub6  -0.235726 (0.202178) \n \nBusiness x Pop_Prop_6_15 -0.577296** (0.273710) \n-0.476419 \n(0.315174) \n-0.864808*** \n(0.256952) \nBusiness x Pop_Prop_15_18  -0.105855 (0.353263) \n \nBusiness x Pop_Prop_18_27 -0.288284*** (0.102699) \n-0.228749** \n(0.100348) \n-0.421970* \n(0.244511) \nBusiness x Pop_Prop_65plus  0.178150 (0.139387) \n \nBusiness x Pop_Density -2.547692*** (0.907527) \n-2.555855*** \n(0.882346) \n-2.082144* \n(1.211372) \nBusiness x Prop_Foreigners 0.188215*** (0.058839) \n0.182792*** \n(0.068185) \n0.360568*** \n(0.107345) \nBusiness x Prop_Male  -0.014353 (0.089939) \n \nIndustry x FSI  0.103909 (0.137109) \n \nIndustry x FSI²  0.018786 (0.031367) \n \nIndustry x Dist_Cent  0.0000161** (0.00000693) \n \nIndustry x Dist_Metro  0.0000401 (0.0000285) \n \nIndustry x Dist_Suburban -0.0000862** (0.0000339) \n-0.0000768* \n(0.0000456) \n-0.0000303 \n(0.0000407) \nIndustry x Dist_Water  -0.00000984 (0.0000211) \n \nIndustry x Dist_Schools -0.000180* (0.000105) \n-0.000111 \n(0.000107) \n0.0000422 \n(0.000150) \nIndustry x Dist_Play 0.000354*** (0.000117) \n0.000240* \n(0.000126) \n0.000281* \n(0.000167) \nIndustry x Dist_Rail  0.0000387 (0.0000645) \n \nIndustry x Pop_Prop_Sub6 0.780610** (0.352927) \n0.530378 \n(0.361221) \n0.204225 \n(0.408747) \nIndustry x Pop_Prop_6_15  0.050427 (0.390445) \n \nIndustry x Pop_Prop_15_18  0.018953 (0.200147) \n \nIndustry x Pop_Prop_18_27 0.344214** (0.352927) \n0.312817** \n(0.129166) \n0.469512*** \n(0.160178) \nIndustry x Pop_Prop_65plus  -0.098714 (0.126594) \n \n \n38 \n \n38 \nTable 2 – Baseline Empirical Results of Hedonic Analysis (3-3) \nIndustry x Pop_Density  2.107667 (2.572701) \n \nIndustry x Prop_Foreigners  -0.077971 (0.078824) \n \nIndustry x Prop_Male  0.140772 (0.089877) \n \nWest x FSI -0.268710*** (0.020125) \n-0.263000*** \n(0.020561) \n-0.851855*** \n(0.023213) \nWest x FSI² 0.039513*** (0.004624) \n0.038739*** \n(0.004887) \n0.121320*** \n(0.006546) \nWest x Dist_Cent -0.0000317*** (-0.00000194) \n-0.0000319*** \n(0.00000196) \n-0.000103*** \n(0.00000193) \nWest x Dist_Metro 0.0000236*** (0.00000186) \n0.0000236*** \n(0.00000198) \n0.0000727*** \n(0.00000309) \nWest x Dist_Suburban -0.00000769* (0.00000398) \n-0.00000815* \n(0.00000421) \n-0.0000322*** \n(0.00000556) \nWest x Dist_Water 0.00000979*** (0.00000236) \n0.00000963*** \n(0.00000234) \n0.000038*** \n(0.00000359) \nWest x Dist_Schools  0.00000277 (0.00000764) \n \nWest x Dist_Play  0.0000497*** (0.00000863) \n \nWest x Dist_Rail -0.0000302*** (0.00000430) \n-0.0000307*** \n(0.00000445) \n-0.0000842*** \n(0.00000682) \nWest x Pop_Prop_Sub6  0.032696 (0.052924) \n \nWest x Pop_Prop_6_15  -0.028291 (0.034885) \n \nWest x Pop_Prop_15_18 -0.156947*** (0.040899) \n-0.145205*** \n(0.048004) \n-0.432046*** \n(0.093982) \nWest x Pop_Prop_18_27  -0.035878 (0.041474) \n \nWest x Pop_Prop_65plus  0.020985 (0.024180) \n \nWest x Pop_Density -0.595791*** (0.297937) \n-0.549493* \n(0.302441) \n-3.295263*** \n(0.404408) \nWest x Prop_Foreigners  -0.032307 (0.041970) \n \nWest x Prop_Male -0.134591*** (0.025066) \n-0.141145*** \n(0.032014) \n-0.311987*** \n(0.047581) \nSpatial_Lag Yes Yes  \nBlock Sample Berlin Berlin Berlin \nObservations 11184 11184 11184 \nR² 0.966127 0.966472 0.893846 \nAdjusted R² 0.966002 0.966255 0.893465 \nModel (1) is our baseline hedonic model, which we obtain after stepwise deletion of statistically insignificant variables of model \n(2). In (3) we repeat our baseline regression omitting the spatial lag-variable. The dependent variable is the natural logarithm of \nstandard land values in all models. Independent variables are described in Table 1. Standard errors (in parentheses) are \nheteroscedasticity robust. * denotes significance at the 10% level; ** denotes significance at the 5% level; *** denotes \nsignificance at the 1% level. \n39 \n \n39 \nTable 3 – Empirical Results of Baseline Impact-Models \n (1) (2) (3) \n Land Value \n(Log) \nLand Value \n(Log) \nLand Value \n(Log) \nImpact Area Velodrom Max-Schmeling Velodrom Max-Schmeling \n0-1000 m 0.076287*** (0.018011) \n-0.014916 \n(0.019143) \n0.047019*** \n(0.002779) \n-0.025293 \n(0.018605) \n1000-2000 m 0.037178*** (0.012739) \n0.035705*** \n(0.012628) \n0.020877*** \n(0.011617) \n0.025153*** \n(0.011895) \n2000-3000 m 0.002686 (0.013498) \n-0.005757 \n(0.013051) \n0.013639* \n(0.212798) \n-0.004855 \n(0.013132) \n3000-4000 m 0.009350 (0.010437) \n-0.018397 \n(0.012352) \n0.007239 \n(0.010420) \n-0.014858 \n(0.012130) \nNeighbourhood -0.013436* (0.007272) \n-0.033593*** \n(0.007023) \n-0.017581** \n(0.007344) \n-0.030855*** \n(0.006849) \nSpatial Lag Yes Yes Yes \nBlock Sample Berlin Berlin Berlin \nObservations 11184 11184 11184 \nR-squared 0.966402 0.966168 0.966329 \nNotes: The basic model is the same as in (1) of Table 2. To reduce the table size we only display variables indicating impact of \neither Velodrom or Max-Schmeling-Arena. Log of standard land values is the endogenous variable in models (1) – (3). 0-1000 \nm, 1000-2000 m, 2000-3000 m, 3000-4000 m are dummy-variables taking the value of 1 for blocks lying within corresponding \none kilometre distance rings surrounding the respective arena, and 0 otherwise. Neighbourhood is defined in a similar way, \ncapturing general neighbourhood effects within 0-5000 m distance. In (1) impact variables for both arenas entered the model \nsimultaneously while in (2) and (3) impact of each arena is estimated individually. Standard errors (in parentheses) are \nheteroscedasticity robust. * denotes significance at the 10% level; ** denotes significance at the 5% level; *** denotes \nsignificance at the 1% level. \n \n40 \n \n40 \nTable 4a – Empirical Results of Alternative Models for Velodrom \n (1) (2) (3) \n Land Value \n(Log) \nLand Value \n(Log) \nLand Value \n(Log) \nImpact Area Velodrom Velodrom Velodrom \n0-1000 m 0.073995*** (0.019412) \n  \n1000-2000 m 0.034716** (0.012383) \n  \n0-3000 m -0.001965 (0.012383) \n0.075524*** \n(0.021105) \n0.121969*** \n(0.036593) \n0-3000 m x Distance  -0.0000289*** (0.00000934) \n-0.0000893** \n(0.0000422) \n0-3000 m x Distance²   0.0000000165 (0.0000000112) \nSpatial Lag Yes Yes Yes \nNeighbourhood-Effects Yes Yes Yes \nBlock Sample Berlin Berlin Berlin \nObservations 11184 11184 11184 \nR² 0.966398 0.966377 0.966384 \nNotes: The basic model is the same as in (1) of Table 1. We capture the effects of Max-Schmeling-Arena by introducing the full \nset of dummy-variables represented in column (3) of Table 3. To reduce the table size we only display variables indicating \nimpact of Velodrom. Log of standard land values is the endogenous variable as in the tables above. 0-1000m, 1000-2000m, and \n0-3000 m are dummy-variables representing multiple distance rings as defined as in Table 3. Distance is defined as the distance \nfrom each blocks centroid to the corresponding arena, in meters. Neighbourhood effects are defined as in Table 3. Standard \nerrors (in parentheses) are heteroscedasticity robust. * denotes significance at the 10% level; ** denotes significance at the 5% \nlevel; *** denotes significance at the 1% level. \n \n41 \n \n41 \nTable 4b – Empirical Results of Alternative Models for Max-Schmeling-Arena \n (1) (2) (3) \n Land Value \n(Log) \nLand Value \n(Log) \nLand Value \n(Log) \nImpact Area Max-Schmeling Max-Schmeling Max-Schmeling \n0-1000 m -0.009482  (0.021002) \n  \n1000-2000 m 0.041065*** (0.015273) \n  \n0-3000 m 0.003211  (0.013001) \n0.030773  \n(0.023960) \n-0.049672 \n0.041028 \n0-3000 m x Distance  -0.00000718 (0.0000111) \n0.000100** \n(0.0000505) \n0-3000 m x Distance²   -0.0000000301** (0.0000000147) \nSpatial Lag Yes Yes Yes \nNeighbourhood-Effects Yes Yes Yes \nBlock Sample Berlin Berlin Berlin \nObservations 11184 11184 11184 \nR² 0.966390 0.966342 0.966365 \nNotes: The basic model is the same as in (1) of Table 2. We capture effects of Velodrom by introducing the full set of dummy-\nvariables represented in column (2) of Table 3. To reduce the table size we only display variables indicating impact of Max-\nSchmeling-Arena. All variables are the same as in Table 4a. Standard errors (in parentheses) are heteroscedasticity robust. * \ndenotes significance at the 10% level; ** denotes significance at the 5% level; *** denotes significance at the 1% level. \n \n42 \n \n42 \nTable 5 – Empirical Results of Final Hedonic Specification \n \n (1) \n Land Value \n(Log) \nImpact Area Velodrom Max-Schmeling \n0-3000 m 0.073160*** (0.021013) \n \n0-3000 m x Distance -0.0000276*** (0.00000953) \n0.0000459** \n(0.0000206) \n0-3000 m x Distance²  -0.0000000164** (0.00000000826) \nSpatial Lag Yes \nNeighbourhood-Effects Yes \nBlock Sample Berlin \nObservations 11.184 \nR² 0.966337 \nNotes: The basic model is the same as in model  (1) of Table 2. To reduce the table size we only display variables indicating \nimpact of Velodrom and Max-Schmeling-Arena. All variables are the same as in Table 4. Standard errors (in parentheses) are \nheteroscedasticity robust. * denotes significance at the 10% level; ** denotes significance at the 5% level; *** denotes \nsignificance at the 1% level. \n \n \n \n \n \n \n \n"}