{"doi":"10.1063\/1.2908894","coreId":"69757","oai":"oai:eprints.lancs.ac.uk:22892","identifiers":["oai:eprints.lancs.ac.uk:22892","10.1063\/1.2908894"],"title":"Observation of acoustic turbulence in a system of nonlinear second sound waves in superfluid 4He.","authors":["Ganshin, A. N.","Efimov, V. B.","Kolmakov, G. V.","McClintock, Peter V. E.","Mezhov-Deglin, L. P."],"enrichments":{"references":[{"id":1025621,"title":"An Introduction to the Theory of Superfluidity,","authors":[],"date":"1965","doi":null,"raw":null,"cites":null},{"id":1026246,"title":"Doklady Acad. Nauk SSSR 192,","authors":[],"date":"1970","doi":null,"raw":null,"cites":null},{"id":1026425,"title":"Doklady Akad.","authors":[],"date":"1941","doi":null,"raw":null,"cites":null},{"id":1025908,"title":"Kolmogorov Spectra of Turbulence I,","authors":[],"date":"1992","doi":"10.1063\/1.860257","raw":null,"cites":null},{"id":1026832,"title":"Low Temp Phys.","authors":[],"date":"2007","doi":"10.1007\/s10909-006-9271-z","raw":null,"cites":null},{"id":1026736,"title":"Wave turbulence under parametric excitation. Application to magnetics,","authors":[],"date":"1994","doi":"10.1007\/978-3-642-75295-7_8","raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008","abstract":"We discuss the results of recent studies of acoustic turbulence in a system of nonlinear second sound waves in a high-quality resonator filled with superfluid 4He. It was found that, when the driving amplitude was sufficiently increased, a steady-state direct wave cascade is formed involving a flux of energy towards high frequencies. The wave amplitude distribution follows a power law over a wide range of frequencies. Development of a decay instability at high driving amplitudes results in the formation of subharmonics of the driving frequency, and to a backflow of energy towards the low-frequency spectral domain, in addition to the direct cascade","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69757.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/22892\/1\/preLTP2008AcousticTurbulence.pdf","pdfHashValue":"0a325e97744e5f5896acab30f53b69e5d262bc33","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:22892<\/identifier><datestamp>\n      2018-01-24T02:42:24Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Observation of acoustic turbulence in a system of nonlinear second sound waves in superfluid 4He.<\/dc:title><dc:creator>\n        Ganshin, A. N.<\/dc:creator><dc:creator>\n        Efimov, V. B.<\/dc:creator><dc:creator>\n        Kolmakov, G. V.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:creator>\n        Mezhov-Deglin, L. P.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        We discuss the results of recent studies of acoustic turbulence in a system of nonlinear second sound waves in a high-quality resonator filled with superfluid 4He. It was found that, when the driving amplitude was sufficiently increased, a steady-state direct wave cascade is formed involving a flux of energy towards high frequencies. The wave amplitude distribution follows a power law over a wide range of frequencies. Development of a decay instability at high driving amplitudes results in the formation of subharmonics of the driving frequency, and to a backflow of energy towards the low-frequency spectral domain, in addition to the direct cascade.<\/dc:description><dc:date>\n        2008<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/22892\/1\/preLTP2008AcousticTurbulence.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1063\/1.2908894<\/dc:relation><dc:identifier>\n        Ganshin, A. N. and Efimov, V. B. and Kolmakov, G. V. and McClintock, Peter V. E. and Mezhov-Deglin, L. P. (2008) Observation of acoustic turbulence in a system of nonlinear second sound waves in superfluid 4He. Low Temperature Physics, 34. pp. 288-292. ISSN 1090-6517<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/22892\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1063\/1.2908894","http:\/\/eprints.lancs.ac.uk\/22892\/"],"year":2008,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"Observation of acoustic turbulence in a system\nof nonlinear second sound waves in superfluid 4He\nA.N. Ganshin1, V.B. Efimov1,2, G.V. Kolmakov1,2,\nP.V.E. McClintock1, and L.P. Mezhov-Deglin2\n1 Department of Physics, Lancaster University, Lancaster, LA1 4YB, UK\n2 Institute of Solid State Physics RAS, Chernogolovka,\nMoscow region, 142432, Russia\nA paper prepared for the special issue of\nLow Temperature Physics\n“Helium: 100 years”.\nRunning title: Acoustic turbulence in superfluid 4He\nPACS: 67.40.Pm, 47.27.Cn, 05.20.Dd\n1\nAbstract\nWe discuss the results of recent studies of acoustic turbulence in a system of\nnonlinear second sound waves in a high-quality resonator filled with superfluid\n4He. It was found that, when the driving amplitude was sufficiently increased,\na steady-state direct wave cascade is formed involving a flux of energy towards\nhigh frequencies. The wave amplitude distribution follows a power law over a\nwide range of frequencies. Development of a decay instability at high driving\namplitudes results in the formation of subharmonics of the driving frequency,\nand to a backflow of energy towards the low-frequency spectral domain, in\naddition to the direct cascade.\nKeywords: Superfluid helium, second sound, acoustic turbulence, Kolmogorov\nspectrum\n2\n1 Introduction\nFirst, we are much indebted to the Editorial Board of the Low Temperature Physics\njournal for their invitation to report the results of our recent studies in this special\nissue to mark the 100th anniversary of the liquefaction of helium.\nIn what follows, we review our experimental investigations of the acoustic turbu-\nlence created in a system of nonlinear second sound standing waves in a high-quality\nresonator filled with He II, the superfluid phase of 4He.\nIt is well-known that He II supports two quite separate sound propagation\nmodes: first sound (conventional pressure\/density waves) and second sound (tem-\nperature\/entropy waves) [1, 2]. Second sound waves of infinitely small amplitude\nrunning in bulk superfluid He II are characterized by a linear dispersion relation\nbetween frequency ω and wave vector k [2]\nωk = u20k, (1)\nwhich is also typical of acoustic waves in condensed matter and in gases. Here u20 is\nthe second sound velocity, which depends on the temperature of the helium sample.\nAt temperatures close to that of the superfluid-to-normal transition at Tλ = 2.177 K,\nthe velocity u20 tends to zero. At temperatures down to T ∼ 1 K, the second sound\nvelocity is u20 ≤ 20 m\/s, which is much smaller than the velocity of conventional\nsound in condensed media, u10 ≥ 3 × 10\n2 m\/s. We emphasize that in contrast to\nordinary (classical) media, where a temperature wave is damped over a distance\nof the order of its wavelength [1], the second sound wave mode has very small\ndissipation within the experimentally convenient temperature range T ∼ 1.5−2.1 K:\ntypically, a second sound pulse of duration τ ∼ 1 µs (i.e. of wavelength λ ∼ 2×10−3\ncm) can propagate through the superfluid over a distance of metres before being\ndamped by viscous losses.\nSecond sound is characterized by rather strong nonlinear properties [2, 3, 4]. For\nexample, a traveling second sound pulse of amplitude δT ∼ 1 mK (i.e. with relative\namplitude δT\/T ∼ 10−3) transforms into a shock wave over a distance L < 1 cm\n3\nfrom the source [5, 6, 7]. To a first approximation, the velocity of a second sound\nwave of finite amplitude depends on the wave amplitude δT as\nu2 = u20 (1 + αδT ) .\nHere\nα =\n∂\n∂T\nln\n(\nu3\n20\nC\nT\n)\nis the nonlinearity coefficient of second sound and C is the specific heat per unit\nmass at constant pressure. Under the saturated vapor pressure, in the region of\nroton second sound, T > 0.9 K, the nonlinearity coefficient is positive (α > 0) for\ntemperatures T < Tα = 1.88 K (like the nonlinearity coefficient of conventional\nsound waves in ordinary media); but it is negative in the range Tα < T < Tλ (and\nmany times larger than the nonlinearity coefficient of first sound) [4]. At T = Tα\nthe nonlinearity coefficient passes through zero.\nIn the studies reported below, we exploit these special properties of second sound\nin He II for an investigation of turbulence in a system of nonlinear acoustic waves\n(acoustic turbulence). This is a state in which a large number of acoustic wave\nmodes are excited and interacting strongly with each other. It is is characterized by\na directed energy flux through frequency scales [8, 9, 10, 11].\nAcoustic turbulence has been at the focus of numerous investigations during the\nlast few decades because of its importance for basic nonlinear physics and in view\nof numerous applications in engineering and fundamental science [8]. Well known\nexamples of acoustic turbulence include the turbulence of sound waves in oceanic\nwaveguides [12], magnetic turbulence in interstellar gases [13], and shock waves in\nthe solar wind and their coupling with the Earth’s magnetosphere [14].\nSecond sound is ideal for modelling the dynamics of nonlinear waves because\nof the way in which its nonlinearity coefficient, which determines the strength of\nthe wave interactions, can be tuned over a wide range simply by changing the bath\ntemperature. It allows one to study the dynamics of both nearly linear and strongly\nnonlinear waves, with both positive (like conventional sound) and negative non-\n4\nlinearity, while using exactly the same experimental techniques. Such possibilities\nare unavailable in conventional experiments. The fact that the velocity of second\nsound u20 is relatively small permits one to increase time resolution of the measure-\nments. Note that the acoustic turbulent state is radically different from quantum\nturbulence (QT) [15], which is also formed in He II, because the density of quantized\nvortices is close to zero. Furthermore, the motions of both the normal and superfluid\ncomponents can be considered as being to a first approximation potential.\nBased on measurements of nonlinear second sound waves in a high-quality res-\nonator, we observed formation of a steady-state wave-energy cascade in He II in-\nvolving a flux of energy through the spectral range towards high frequencies. Initial\nresults of the studies were published in Ref. [11]. Since then, we have found that,\nunder some circumstances, wave energy in the acoustic system can also flow in the\nreverse direction. Below we discuss these observations in more detail.\n2 Experimental techniques\nThe experimental arrangements were similar to those used in our earlier studies of\nnonlinear second sound waves [16, 17]. The cryoacoustical resonator was made of a\ncylindrical quartz tube of nominal length L = 7 cm and internal diameter D = 1.5\ncm, filled with superfluid helium. The low-inertial film heater and bolometer were\ndeposited on the surfaces of flat glass plates capping the ends of the tube. The heater\nwas driven by a harmonic voltage generator in the frequency range 0.1 – 100 kHz.\nThe frequency of the second sound (twice the frequency of the voltage generator)\nwas set close to the frequency of a longitudinal resonance in the resonator. The\namplitude of the standing wave δT could be changed from 0.05 mK up to a few\nmK by adjustment of the power to the heater. The measured heat flux density W\ninto the liquid is subject to systematic uncertainties of up to ±10% associated with\nestimation of the resonator cross-section and the resistances of the leads, and possible\nsmall inhomogeneities in the heater film thickness. The Q-factor of the resonator\n5\ndetermined from the widths of longitudinal resonances at small heat fluxes W ≤ 4\nmW\/cm2 (nearly linear regime) was Q ∼ 3000 for resonance numbers 20 < p < 100\nand decreased to about 500 at frequencies below 500 Hz. A typical resonance curve\nis shown in Fig. 1 (the 32nd resonance).\nUse of a high-Q resonator enables us to create nonlinear second sound standing\nwaves of high amplitude (δT ∼ 1 mK) accompanied by only small heat input at\nthe source W < 55 mW\/cm2, thus avoiding possible complications [18] due to\nvortex creation in the bulk He II and nonlinear phenomena at the heater\/superfluid\ninterface. The second sound waveform registered by the bolometer was Fourier-\nanalyzed and its power spectrum was computed.\n3 Results and discussion\nFig. 2 shows the evolution of the second sound wave spectrum with increasing AC\nheat flux density W from the heater, measured at temperature close to 2.08 K\nwhen driving at the frequency of the 31st resonance. For small W ≤ 4 mW\/cm2\nwe observed a nearly linear regime of wave generation, where a small number of\nharmonics of the driving frequency were excited due to nonlinearity (see Fig. 2(a)),\nand the shape of the recorded signal was close to sinusoidal. An increase of the\nexcitation above 12 mW\/cm2 led to visible deformation of the signal shape and to\nthe generation of a large number of harmonics in the second sound wave spectrum\nas shown in Fig. 2(b).\nIt is evident from Fig. 2 that the main spectral peak (marked by the arrow) lies\nat the driving frequency ωd, and that high-frequency peaks appear at its harmonics\nωn = n×ωd with n = 2, 3, . . .. It can be seen in Fig. 2(b) that a cascade of waves is\nformed over the frequency range up to 80 kHz, i.e. up to a frequency 25 times higher\nthan the driving frequency. As also shown in Fig. 2(b), the dependence of peak height\non frequency may be described by a power-law-like function δTω = const× ω\n−s for\nfrequencies lower than some cut-off frequency ωb that increases with increasing W .\n6\nNote there are systematic uncertainties of about ±10% in the values of s and ωb\nextracted from plots of this kind, depending on the range of ω through which the\nstraight line is drawn. For sufficiently high AC heat flux densities W > 12 mW\/cm2\n(i.e. for the developed cascade), the scaling index tends towards s ≈ 1.5.\nFormation of the spectra observed in the experiments is evidently attributable to\nthe cascade transfer of wave energy through the frequency scales due to nonlinearity,\nthus establishing an energy flux in K space directed from the driving frequency\ntowards the high-frequency domain. In accordance with basic ideas formulated in\nRefs. [8, 9, 10] we may infer that, at relatively high driving amplitudes, we are\nobserving acoustic turbulence formed in the system of second sound waves within\nthe inertial (nondissipative) range of frequencies. Formation of the observed direct\ncascade is similar to creation of the Kolmogorov distribution of fluid velocity over\nfrequency in the bulk of a classical fluid [19].\nWe observed also that, when the AC heat flux density was raised above some\ncritical value at even resonance numbers p > 30, a spectral peak appeared at the\nfrequency equal to half the driving frequency (i.e. formed on the left of the funda-\nmental peak) and at its harmonics. Fig. 3 shows the evolution of the wave spectrum\nwith increasing AC heat flux density when driving on the 32nd resonance. It is\nevident that, at the relatively small heat flux density W = 4 mW\/cm2, the wave\nspectrum shown in Fig. 3(a) is quite similar to that observed under similar conditions\nwhen driving at the 31st resonance (i.e. at the nearest odd numbered resonance),\nsee Fig. 2(a). Formation of the low-frequency harmonic (subharmonic) at ω = ωd\/2\nat W = 16 mW\/cm2 is clearly seen in Fig. 3(b). It was found that the threshold\nvalue for generation of subharmonics obtained in measurements with 30 < p < 95\nwas about 12 mW\/cm2.\nThe formation of subharmonics may be attributed to development of a decay\ninstability of the periodic wave. In accordance with general theory [8, 20, 21], the\ninstability is controlled mainly by nonlinear decay of the wave into two waves of\nlower frequency, and by the opposite process of the confluence of two waves to form\n7\none wave. The energy (or frequency) conservation law for this 3-wave process is\nω1 = ω2 + ω3, (2)\nwhere ωi = u20ki is the frequency of a linear wave of wave vector ki. The case shown\nin Fig. 3(b) evidently corresponds to generation of subharmonics with ω2 = ω3 =\nωd\/2.\nWe also observed the high-frequency cutoff of the wave spectrum due to viscosity.\nAs shown in Fig. 2(a), it manifests itself as an abrupt decrease in the amplitudes\nof the harmonics at W < 12 mW\/cm2, and as a change in slope of the spectrum\nat higher W (Fig. 2(b)) when plotted on double-log scales, which occurs at some\ncharacteristic frequency ωb. At ω ∼ ωb the nonlinear mechanism for nearly nondis-\nsipative transfer of the wave energy changes to viscous damping of the waves (cf.\nobservations of the high-frequency edge of the inertial range of frequencies of capil-\nlary turbulence on the surface of liquid hydrogen [22]). It causes a faster reduction\nof sound amplitudes at frequencies ω > ωb, as observed.\nThe dependence of the boundary frequency ωb\/2pi on the standing wave ampli-\ntude δT is shown in Fig. 4. It is seen that the inertial range is extended towards\nhigher frequencies when the driving force is increased. When driving at resonant fre-\nquencies with odd resonance numbers p, with sufficiently large driving amplitudes,\nthe boundary frequency depends linearly on wave amplitude\nωb\/2pi = const(T, ωd)× δT,\n(the filled symbols in Fig. 4) in agreement with our numerical calculations [11].\nWhen driving at even p (open symbols in Fig. 4) the boundary frequency is\nnoticeably lower than that measured for the nearest odd resonance number, with\nW > 12 mW\/cm2. This reduction may be connected with a change in the mechanism\nof energy relaxation in the wave system caused by the generation of subharmonics\nwith frequencies lower than ωd.\nOne can see from Fig. 4 that the energy balance in the wave system is highly\nnonlocal in K space: energy is pumped into the system in the low-frequency (long-\n8\nwave) domain and it flows to the high frequency (short-wave) domain where it is\nabsorbed by dissipative mechanisms.\nIt was found that, when driving at sufficiently high AC heat flux densitiesW > 23\nmW\/cm2 and at resonance numbers p > 50, multiple subharmonics were generated\nin the low-frequency spectral domain ω < ωd, see Fig. 5. Here we present the initial\nresults of our study of the decay instability in the acoustic system, a phenomenon\nthat promises to be of huge interest for nonlinear sound wave dynamics. The results\nof the more detailed investigations now in progress will be published and discussed\nelsewhere in due course.\nThe formation of subharmonics in the wave spectrum is evidently attributable to\nfurther development of the decay instability, when not only a wave with frequency\nωd\/2 is created due to nonlinearity, but a number of waves with frequencies obeying\nthe conservation law (2) are generated. This regime is quite similar to the kinetic\ninstability known for weak turbulent systems [21]. It is seen from Fig. 5 that, when\nthe instability develops, the wave spectrum becomes almost continuous: all possible\nmodes seem to be excited.\nWe may interpret the generation of waves of frequency lower than the driving fre-\nquency as the establishment of an energy backflow towards low frequencies. Inverse\nenergy cascades are known in 2-dimensional incompressible liquids [23] and Bose\ngases [24] but, to our knowledge, this phenomena has not been observed earlier for\nnonlinear acoustic waves. Absorption of the wave energy at low frequencies is prob-\nably attributable to viscous drag of the normal fluid component on the resonator\nwalls, given that bulk second sound damping is negligibly small in this frequency\nrange: this would be consistent with the observed strong decrease of the resonator\nQ-factor below 2 kHz. We have also observed that formation of the inverse energy\ncascade is accompanied by a reduction of wave amplitude in the high frequency\nspectral domain, and by a contraction of the inertial range. This observation is\nconsistent with our inference that, after onset of the instability, the energy flux is\nshared between the direct and inverse energy cascades.\n9\n4 Conclusions\nWe have demonstrated that the system of second sound waves in a high-Q resonator\nfilled with He II can be used as an effective tool for the detailed modelling and\ninvestigation of acoustic turbulence. We observed a smooth crossover in the system\nof second sound waves from a nearly linear regime at low driving amplitudes to a\nnonlinear regime at moderate driving amplitudes, and, further, to developed turbu-\nlence at high driving amplitudes (a Kolmogorov-like cascade). In the high frequency\ndomain a cutoff of the cascade is observed, caused by a change in the mechanism\nof energy transfer, from nonlinear wave transformation to viscous damping. When\ndriving at moderate amplitudes at resonances of even resonance number, a decay\ninstability develops in the system due to 3-wave interactions. It results in the gener-\nation of a subharmonic of frequency equal to half the driving frequency. At relatively\nhigh driving amplitudes multiple subharmonics are generated in the wave spectrum,\ncorresponding to the formation of an inverse energy cascade directed towards the\nlow-frequency spectral domain.\nAcknowledgments\nThe investigations were supported by the Russian Foundation for Basic Research,\nproject Nos. 06-02-17253 and 07-02-00728, by the Presidium of the Russian Academy\nof Sciences in frames of the programs “Quantum Macrophysics” and “Mathematical\nMethods in Nonlinear Dynamics”, and by the Engineering and Physical Sciences\nResearch Council (UK).\n10\nReferences\n[1] L. D. Landau and E. M. Lifshits, Fluid Mechanics, 2nd ed., Pergamon Press,\nOxford (1987).\n[2] I. M. Khalatnikov, An Introduction to the Theory of Superfluidity, Benjamin,\nNew York (1965).\n[3] D. V. Osborne, Proc. Phys. Soc. (London) A 64, 114 (1951).\n[4] A. J. Dessler and W. M. Fairbank, Phys. Rev. 104, 6 (1956).\n[5] A. Yu. Iznankin and L. P. Mezhov-Deglin, Sov. Phys. JETP 57, 801 (1983).\n[6] L. S. Goldner, G. Ahlers, and R. Mehrotra, Phys. Rev. B 43, 12861 (1991).\n[7] G. V. Kolmakov, V. B. Efimov, A. N. Ganshin, P.V.E. McClintock, E. V.\nLebedeva, and L. P. Mezhov-Deglin, Low Temp. Phys. 32, 981 (2006).\n[8] V. E. Zakharov, G. Falkovich, and V. S. L’vov, Kolmogorov Spectra of Turbu-\nlence I, Springer, Berlin (1992).\n[9] V. E. Zakharov and R. Z. Sagdeev, Doklady Acad. Nauk SSSR 192, 297 (1970).\n[10] G. Falkovich and M. Meyer, Phys. Rev E 54, 4431 (1996).\n[11] G. V. Kolmakov, V. B. Efimov, A. N. Ganshin, P. V. E. McClintock, and L. P.\nMezhov-Deglin, Phys. Rev. Lett. 97, 155301 (2006).\n[12] S. N. Gurbatov, V. V. Kurin, L. M. Kustov, and N. V. Pronchatov-Rubtsov,\nAcoust. Phys. 51, 152 (2005).\n[13] G. S. Bisnovatyi-Kogan and S. A. Silich, Rev. Mod. Phys. 67, 661 (1995).\n[14] M. Ryutova and T. Tarbell, Phys. Rev. Lett. 90, 191101(2003).\n[15] W. F. Vinen, J. Low Temp. Phys. 145, 7 (2006).\n11\n[16] I. Yu. Borisenko, V.B. Efimov, L.P. Mezhov-Deglin, Sov. J. Low Temp. Phys.\n14, 619 (1988).\n[17] V. B. Efimov, A. N. Ganshin, P. V. E. McClintock, G. V. Kolmakov and L. P.\nMezhov-Deglin, J. Low Temp. Phys. 145, 155 (2006).\n[18] H. Davydowitz, Yu. L’vov, and V. Steinberg, Physica D 84, 635 (1995).\n[19] A. N. Kolmogorov, Doklady Akad. Nauk SSSR 30, 299 (1941).\n[20] V. S. L’vov, Wave turbulence under parametric excitation. Application to mag-\nnetics, Springer, Berlin (1994).\n[21] V. S. L’vov and V.B. Cherepanov, Sov. Phys. JETP 54 746 (1981).\n[22] G. V. Kolmakov, A. A. Levchenko, M. Yu. Brazhnikov, L. P. Mezhov-Deglin, A.\nN. Silchenko, and P. V. E. McClintock, Phys. Rev. Lett. 93 (7), 074501 (2004).\n[23] R. H. Kraichnan, Phys. Fluids 10, 1417 (1967).\n[24] S. Nazarenko and M. Onorato, J. Low Temp Phys. 146, 31 (2007).\n12\nFigure Captions\nFig. 1. Second sound resonance curve measured in the He II filled resonator at a\ntemperature close to 2.08 K. The system was driven at a frequency close to its 32nd\nresonance with an AC heat flux density of W = 4 mW\/cm2.\nFig. 2. Evolution in the power spectrum of second sound standing waves as the\nAC heat flux density is increased from (a) W = 4 mW\/cm2 to (b) 25 mW\/cm2.\nThe dashed line in (a) is a guide to the eye, whereas that in (b) corresponds to\nδT ∝ ω−1.7. The arrows indicate the positions of the fundamental spectral peak\nformed at the driving frequency ωd and of the high-frequency edge ωb of the inertial\nfrequency range. The system was driven at its 31st resonance, at a temperature\nclose to 2.08 K.\nFig. 3. Second sound wave spectra measured when driving on the frequency of\nthe 32nd resonance with (a)W = 4 mW\/cm2 and (b)W = 16 mW\/cm2. The arrows\nindicate the fundamental peaks at the driving frequency ω = ωd and a subharmonic\nformed at ω = ωd\/2. The temperature was close to 2.08 K.\nFig. 4. Dependence of the viscous cutoff frequency ωb\/2pi on the amplitude δT of\nthe standing wave for different temperatures T and resonance numbers p. Dashed\nlines indicate the results of our numerical computations [11]; data points represent\nexperimental measurements.\nFig. 5. A second sound wave spectrum measured when driving at the frequency\nof the 96th resonance with an AC heat flux density W = 25 mW\/cm2. The tem-\nperature was close to 2.08 K. The arrow marks the fundamental peak at the driving\nfrequency ω = ωd.\n13\n3224 3228 3232 3236\n0.00\n0.01\n0.02\n \n \ndT\n (a\n.u\n.)\nwd\/2p (Hz)\nFigure 1: Ganshin et al, “Formation of acoustic turbulence...”\n14\n1000 10000\n10-6\n10-4\n10-2\nwb\nwd\n(a)\n \nw\/2p (Hz)\ndT\nw\n (a\n.u\n.)\n1000 10000 100000\n10-6\n10-4\n10-2\nwb\nwd\n(b)\n \nw\/2p (Hz)\ndT\nw\n (a\n.u\n.)\nFigure 2: Ganshin et al, “Formation of acoustic turbulence...”\n15\n1000 10000\n10-6\n10-4\n10-2\nwd (a)\n \nw\/2p (Hz)\ndT\nw\n (a\n.u\n.)\n1000 10000\n10-6\n10-4\n10-2 wd\/2\nwd\n(b)\n \nw\/2p (Hz)\ndT\nw\n (a\n.u\n.)\nFigure 3: Ganshin et al, “Formation of acoustic turbulence...”\n16\n0.00 0.05 0.10 0.15 0.20 0.25 0.30\n0\n25\n50\n75\n100\n \n \nw\nb\/2\np,\n k\nH\nz\ndT, a.u.\np=31, 2.08K                  p=31, 1.77K \np=32, 2.08K                  p=32, 1.77K             \nFigure 4: Ganshin et al, “Formation of acoustic turbulence...”\n17\n1000 10000 100000\n10-5\n10-3\n10-1 wd\n \nw\/2p (Hz)\ndT\nw\n (a\n.u\n.)\nFigure 5: Ganshin et al, “Formation of acoustic turbulence...”\n18\n"}