{"doi":"10.1017\/S0266462310001364","coreId":"177297","oai":"oai:aura.abdn.ac.uk:2164\/2086","identifiers":["oai:aura.abdn.ac.uk:2164\/2086","10.1017\/S0266462310001364"],"title":"Photodynamic diagnosis of bladder cancer compared with white light cystoscopy : Systematic review and meta-analysis","authors":["Mowatt, Graham","N'Dow, James","Vale, Luke","Nabi, Ghulam","Boachie, Charles","Cook, Jonathan A","Fraser, Cynthia","Griffiths, T R Leyshon","Aberdeen Technology Assessment Review (TAR) Group"],"enrichments":{"references":[],"documentType":{"type":0.7777777778}},"contributors":["University of Aberdeen, Medicine, Medical Sciences & Nutrition, Institute of Applied Health Sciences","University of Aberdeen, Academic Urology Unit","University of Aberdeen, Institute of Applied Health Sciences"],"datePublished":"2011","abstract":"Peer reviewedPostprin","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:aura.abdn.ac.uk:2164\/2086<\/identifier><datestamp>\n                2018-01-02T00:04:42Z<\/datestamp><setSpec>\n                com_2164_320<\/setSpec><setSpec>\n                com_2164_319<\/setSpec><setSpec>\n                com_2164_318<\/setSpec><setSpec>\n                com_2164_632<\/setSpec><setSpec>\n                com_2164_364<\/setSpec><setSpec>\n                com_2164_330<\/setSpec><setSpec>\n                com_2164_705<\/setSpec><setSpec>\n                col_2164_321<\/setSpec><setSpec>\n                col_2164_633<\/setSpec><setSpec>\n                col_2164_706<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nPhotodynamic diagnosis of bladder cancer compared with white light cystoscopy : Systematic review and meta-analysis<\/dc:title><dc:creator>\nMowatt, Graham<\/dc:creator><dc:creator>\nN'Dow, James<\/dc:creator><dc:creator>\nVale, Luke<\/dc:creator><dc:creator>\nNabi, Ghulam<\/dc:creator><dc:creator>\nBoachie, Charles<\/dc:creator><dc:creator>\nCook, Jonathan A<\/dc:creator><dc:creator>\nFraser, Cynthia<\/dc:creator><dc:creator>\nGriffiths, T R Leyshon<\/dc:creator><dc:creator>\nAberdeen Technology Assessment Review (TAR) Group<\/dc:creator><dc:contributor>\nUniversity of Aberdeen, Medicine, Medical Sciences & Nutrition, Institute of Applied Health Sciences<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Academic Urology Unit<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Institute of Applied Health Sciences<\/dc:contributor><dc:subject>\nsystematic review<\/dc:subject><dc:subject>\nmeta-analysis<\/dc:subject><dc:subject>\ndiagnostic tests<\/dc:subject><dc:subject>\nbladder cancer<\/dc:subject><dc:subject>\nR Medicine<\/dc:subject><dc:subject>\nR<\/dc:subject><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPostprint<\/dc:description><dc:date>\n2011-07-22T10:10:02Z<\/dc:date><dc:date>\n2011-07-22T10:10:02Z<\/dc:date><dc:date>\n2011<\/dc:date><dc:type>\nJournal article<\/dc:type><dc:identifier>\nMowatt , G , N'Dow , J , Vale , L , Nabi , G , Boachie , C , Cook , J A , Fraser , C , Griffiths , T R L & Aberdeen Technology Assessment Review (TAR) Group 2011 , ' Photodynamic diagnosis of bladder cancer compared with white light cystoscopy : Systematic review and meta-analysis ' International Journal of Technology Assessment in Health Care , vol 27 , no. 1 , pp. 3-10 . DOI: 10.1017\/S0266462310001364<\/dc:identifier><dc:identifier>\n1471-6348<\/dc:identifier><dc:identifier>\nPURE: 3825539<\/dc:identifier><dc:identifier>\nPURE UUID: 714977e0-5a5b-43d3-8b91-4df62dc93b82<\/dc:identifier><dc:identifier>\nPubMed: 21262078<\/dc:identifier><dc:identifier>\nScopus: 79955703830<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2164\/2086<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.1017\/S0266462310001364<\/dc:identifier><dc:language>\neng<\/dc:language><dc:relation>\nInternational Journal of Technology Assessment in Health Care<\/dc:relation><dc:rights>\n© Cambridge University Press 2011<\/dc:rights><dc:format>\n8<\/dc:format>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1471-6348","1471-6348"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["International Journal of Technology Assessment in Health Care"],"year":2011,"topics":["systematic review","meta-analysis","diagnostic tests","bladder cancer","R Medicine","R"],"subject":["Journal article"],"fullText":" 1 \nThis is a pre-copy-editing, author-produced PDF of an article accepted for \npublication in International Journal of Technology Assessment in Health Care \n2011;27(1)3-10 following peer review. The definitive publisher-authenticated \nversion is available online from http:\/\/journals.cambridge.org  \n \nPhotodynamic diagnosis of bladder cancer compared with white light cystoscopy:  \nsystematic review and meta-analysis  \nShort title: Photodynamic diagnosis of bladder cancer \n \nGraham Mowatt,1 James N’Dow,2 Luke Vale,1,3 Ghulam Nabi,4 Charles Boachie,1 \nJonathan A Cook,1 Cynthia Fraser,1 TR Leyshon Griffiths,5 for the Aberdeen \nTechnology Assessment Review (TAR) Group  \n \n1Health Services Research Unit, Institute of Applied Health Sciences, University of \nAberdeen, AB25 2ZD \n2Academic Urology Unit, Institute of Applied Health Sciences, University of \nAberdeen, AB25 2ZD \n3Health Economics Research Unit, Institute of Applied Health Sciences, University of \nAberdeen, AB25 2ZD \n4Centre for Academic Clinical Practice and Department of Urology, University of \nDundee, DD1 4HN \n5Department of Cancer Studies and Molecular Medicine, University of Leicester, LE5 \n4PW \n \nCorrespondence to:  \nMr Graham Mowatt, Health Services Research Unit \n3rd Floor, University of Aberdeen \nHealth Sciences Building, Foresterhill \n 2 \nAberdeen AB25 2ZD, UK \nTel: 44 1224 552494, Fax: 44 1224 554580, Email: g.mowatt@abdn.ac.uk \n 3 \nABSTRACT \nObjectives \nThe aim of this study was to assess the test performance and clinical effectiveness of \nphotodynamic diagnosis (PDD) compared with white light cystoscopy (WLC) in \npeople suspected of new or recurrent bladder cancer. \n \nMethods \nA systematic review of randomised controlled trials (RCTs), non-randomised \ncomparative studies or diagnostic cross-sectional studies comparing PDD with WLC.  \nFifteen electronic databases and websites were searched (last searches April 2008).  \nFor clinical effectiveness only RCTs were considered.   \n \nResults \nTwenty-seven studies (2949 participants) assessed test performance.  PDD had \nhigher sensitivity than WLC (92%, 95% CI 80 to 100% versus 71%, 95% CI 49 to 93%) \nbut lower specificity (57%, 95% CI 36 to 79% versus 72%, 95% CI 47 to 96%).  For \ndetecting higher risk tumours, median sensitivity of PDD (89% (6 to 100%)) was \nhigher than WLC (56% (0 to 100%)) whereas for lower risk tumours it was broadly \nsimilar (92% (20 to 95%) versus 95% (8 to 100%)).  Four RCTs (709 participants) using \n5-aminolaevulinic acid (5-ALA) as the photosensitising agent reported clinical \neffectiveness.  Using PDD at transurethral resection of bladder tumour (TURBT) \nresulted in fewer residual tumours at check cystoscopy (relative risk (RR) 0.37, 95% \nCI 0.20 to 0.69) and longer recurrence-free survival (RR 1.37, 95% CI 1.18 to 1.59), \ncompared with WLC.   \n \n 4 \nConclusions \nPDD detects more bladder tumours than WLC, including more high risk tumours.  \nBased on four RCTs reporting clinical effectiveness, 5-ALA mediated PDD at TURBT \nfacilitates a more complete resection and prolongs recurrence-free survival.   \n \n \nKeywords: Systematic review, Meta-analysis, Diagnostic tests, Bladder cancer   \n \n 5 \nAcknowledgements \nThis paper was developed from a Health Technology Assessment on the clinical and \ncost-effectiveness of photodynamic diagnosis and urine biomarkers (FISH, \nImmunoCyt, NMP22) and cytology for the detection and follow-up of bladder cancer \nthat was funded by the National Institute for Health Research Health Technology \nAssessment Programme (project number 07\/02\/01).  See the HTA Programme \nwebsite for further project information.  JC holds a Medical Research Council UK \nSpecial Research Training Fellowship in Health Services and Health of the Public.  \nThe Health Services Research Unit and Health Economics Research Unit are core \nfunded by the Chief Scientist Office of the Scottish Government Health Directorates.  \nWe thank Clare Robertson and Susan Wong for assistance with assessing full text \nstudies for inclusion and Clare Robertson for assistance with data extraction and \nquality assessment.  The views expressed in this report are those of the authors and \ndo not necessarily reflect those of the Chief Scientist Office, Medical Research \nCouncil or the Department of Health.  \n \n 6 \nINTRODUCTION \nBladder cancer is the seventh most common cancer in the UK, affecting more than \n10,000 people each year (16).  The majority of diagnosed patients (75 to 85%) present \nwith non-muscle invasive disease, which is characterised by a probability of \nrecurrence at five years of 31 to 78% (1).  Flexible cystoscopy and voided urine \ncytology are currently the initial investigations of choice for patients with symptoms \nsuggestive of bladder cancer.  If flexible cystoscopy confirms a bladder tumour or \nurine cytology shows malignant cells in the absence of an upper urinary tract \nurothelial tumour, a rigid white light cystoscopy (WLC) under general or regional \nanaesthesia is performed with transurethral resection of bladder tumour (TURBT) \nwhere applicable.   \nThe ultimate goal in the management of non-muscle invasive transitional cell \ncarcinoma (TCC) of the bladder is the prevention of disease recurrence and \nprogression.  Early cancer detection is an essential prerequisite of successful therapy.  \nUnfortunately, small papillary bladder tumours and flat urothelial tumours such as \ncarcinoma in situ (CIS) can easily be overlooked during conventional WLC.  Indeed, \nmany of the recurrent tumours may be due to the persistence of residual tumour in \nthe bladder after an incomplete TURBT.  Moreover, progression to muscle invasive \nor metastatic TCC is more likely to occur in those with concomitant CIS (1).  Non-\nmuscle invasive TCC of the bladder is one of the most expensive cancers to manage \non a per patient basis, because of its high prevalence, high recurrence rate and the \nneed for long-term cystoscopic surveillance.  The total cost of treatment and five year \nfollow-up of patients with non-muscle invasive bladder cancer diagnosed during \n2001-2002 in the UK was over £35 million (12). \nPhotodynamic diagnosis (PDD) is a technique that has been proposed to \nenhance tumour detection and resection.  The principle of PDD is based on the \ninteraction between a photosensitising agent with a high uptake by tumour cells and \nlight with an appropriate wavelength, which is absorbed by the agent and re-emitted \n 7 \nwith a different wavelength (18).  We carried out a systematic review of the literature \nto assess the diagnostic performance of PDD compared with rigid WLC and its \neffects on patient outcomes.  \n   \nMETHODS \nSearch strategy \nHighly sensitive electronic searches, using both controlled vocabulary and free text \nterms, were undertaken.  The search strategies were originally developed for a \nsystematic review (11) with a wider scope than this review and were designed to \ninclude retrieval of studies that assessed selected biomarker tests as well as PDD.  \nWe searched Medline (1966 - March  Wk 3 2008), Medline In-Process (1st April 2008), \nEmbase (1980 –  Wk 13 2008), Biosis (1985- 27th March 2008), Science Citation Index \n(1970 – 1st April 2008), Health Management Information Consortium (March 2008) \nCochrane Controlled Trials Register (The Cochrane Library, Issue 1 2008) as well as \ncurrent research registers (National Research Register Archive (September 2007),  \nCurrent Controlled Trials (March 2008), Clinical Trials (March 2008) and WHO \nInternational Clinical Trials Registry (March 2008)).  Additional databases searched \nincluded the Cochrane Database of Systematic Reviews (The Cochrane Library, Issue \n1, 2008), Database of Abstracts of Reviews of Effectiveness (March 2008), HTA \nDatabase (March 2008) and Medion (March 2008).  Searches were restricted to \nEnglish language publications.  Details of the full strategies used for each database \nare available from the authors.  Reference lists of all included studies were scanned \nto identify additional potentially relevant studies.   \n \nStudy selection \nWe included studies that assessed the test performance or clinical effectiveness of \nPDD compared with WLC in people suspected of having bladder cancer or \npreviously diagnosed with non-muscle invasive bladder cancer and on follow-up \n 8 \ncystoscopic examination.  For test performance both randomised and observational \n(diagnostic cross-sectional or case-control) studies were included.  However case-\ncontrol studies in which the controls were healthy volunteers were excluded.  The \nreference standard was histopathological examination of biopsied tissue and studies \nhad to report or allow the calculation of true and false positives and negatives.    For \nassessment of clinical effectiveness we included only RCTs and the outcomes \nconsidered were residual tumour at check cystoscopy, recurrence of bladder cancer \nover time following initial resection, and progression to muscle invasive disease.   \n \nData abstraction and quality assessment \nOne reviewer screened the titles (and abstracts if available) of all reports identified \nby the search strategy.  Full-text copies of all studies deemed to be potentially \nrelevant were obtained and two reviewers independently assessed them for \ninclusion.  One of three reviewers extracted details of study design, participants, \nindex, comparator and reference standard tests and outcome data, and another \nchecked the data extraction.  Disagreements were resolved by consensus or \narbitration by another reviewer.   \nTwo reviewers independently assessed the quality of the included studies \nusing a version of the quality assessment of diagnostic accuracy studies (QUADAS) \ntool adapted to make it more applicable for assessing reports of tests for bladder \ncancer.  QUADAS is a quality assessment tool for use in systematic reviews of \ndiagnostic studies (17) but it is designed to be adapted to make it applicable to a \nspecific review topic.  Disagreements were resolved by consensus or arbitration by a \nthird reviewer.   \n \nQuantitative data synthesis \nFor studies of test performance, separate summary receiver operating characteristic \n(SROC) curves were derived for patient and biopsy level analysis.  These meta-\n 9 \nanalysis models were fitted using the hierarchical summary receiver operating \ncharacteristic (HSROC) model (9) in SAS 9.1.  Summary sensitivity, specificity, \npositive and negative likelihood ratios and diagnostic odds ratios (DORs) for each \nmodel were reported as point estimate and 95% confidence interval (CI).  Due to the \nclustering of biopsies within patients, the intervals from the biopsy level analyses \nwere expected to be an underestimate of the true uncertainty. \nFor studies reporting clinical effectiveness, dichotomous outcome data were \ncombined as relative risk (RR).  In the absence of statistical heterogeneity, which was \nexplored using chi-squared tests, I2 statistics and visual inspection, a fixed effect \nmodel was used.  Where there was evidence of heterogeneity, data were analysed \nusing a random effects meta-analysis.   \n \nRESULTS \nTrial flow \nFigure 1 shows the flow of studies through the review.  A list of the included \ndiagnostic studies is shown in Supplementary Table 1 and a list of the included \neffectiveness studies is shown in Supplementary Table 2.   \n \nStudy characteristics and methodological quality \nThe 27 diagnostic studies, published in 36 reports enrolled 2949 participants, with \n2807 contributing to the analysis.  Across 19 studies (2327 participants) reporting this \ninformation, 41% of the patients (n=946) were first time presenters with symptoms \nsuspicious of bladder cancer while 59% (n=1381) had previously diagnosed bladder \ncancer.  Further details of the diagnostic studies are shown in Supplementary Table \n3.   \nIn the four RCTs reporting effectiveness outcomes, published in eight reports, \nthe groups were randomised to WLC or PDD, while in the other studies the groups \nwere randomised to WLC or WLC and PDD.  In Babjuk and colleagues (2), 33% \n 10 \n(20\/60) of the PDD group and 45% (28\/62) of the WLC group were newly presenting \nwith symptoms suspicious of bladder cancer while 67% (40\/60) of the PDD group \nand 55% (34\/62) of the WLC group had previously diagnosed bladder cancer.  The \nremaining studies did not report this information.  All four studies used 5-\naminolaevulinic acid (5-ALA) as the photosensitising agent.  The follow-up periods \nfor the studies were eight years, five years, two years and 10 to 14 days.  Kriegmair \nand colleagues (7) only aimed to evaluate residual tumour following TURBT.  \nFurther details of the effectiveness studies are shown in Supplementary Table 4.   \n Figure 2 summarises the results of the quality assessment for the diagnostic \nstudies.  In all studies partial verification bias (all patients received a reference \nstandard test) and test review bias (PDD and WLC were interpreted without \nknowledge of the results of the reference standard) were avoided.  However all \nstudies were judged to suffer from incorporation bias, in that PDD was considered \nnot to be independent of the reference standard test, as biopsies used in the reference \nstandard test were obtained via the PDD procedure.  In all four studies reporting \neffectiveness outcomes it was unclear whether the sequence generation was really \nrandom or the treatment allocation was adequately concealed or whether outcomes \nassessors, care providers or patients were blinded.  \n \nQuantitative data synthesis \nDiagnostic performance \nIn the pooled estimates for patient level analysis, based on evidence from five \nstudies, PDD had higher sensitivity than WLC (92%, 95% CI 80 to 100% versus 71%, \n95% CI 49 to 93%) but lower specificity (57%, 95% CI 36 to 79% versus 72%, 95% CI \n47 to 96%).  In the pooled estimates for biopsy level analysis, based on evidence from \n14 studies, PDD also had higher sensitivity than WLC (93%, 95% CI 90 to 96% versus \n65%, 95% CI 55 to 74%) but lower specificity (60%, 95% CI 49 to 71% versus 81%, 95% \n 11 \nCI 73 to 90%).  Figure 3 shows the SROC plot for studies reporting biopsy-level \nanalysis.   \nAcross studies, the median sensitivity (range) of PDD compared with WLC \nfor detecting lower risk, less aggressive tumours was broadly similar for patient level \ndetection but higher for PDD for biopsy level detection (Table 1).  However, for the \ndetection of more aggressive, higher risk tumours the median sensitivity of PDD for \nboth patient and biopsy level detection was higher than WLC.  The higher sensitivity \nof PDD was also reflected in the detection of CIS alone, both for patient and biopsy \nlevel detection (Table 1).  \n \nType of photosensitising agent \nMost studies (n = 18) used 5-ALA as the photosensitising agent, while five used \nhexaminolaevulinate (HAL), two used hypericin and two used either 5-ALA or HAL.  \nIn patient based detection of bladder cancer, across four studies using 5-ALA and \nthree using HAL, the median (range) sensitivity and specificity for 5-ALA was 96% \n(64 to 100%) and 52% (33 to 67%) respectively, compared with 90% (53 to 96%) \nsensitivity and 81% (43 to 100%) specificity for HAL.  In biopsy based detection of \nbladder cancer, across 15 studies using 5-ALA, the median (range) sensitivity and \nspecificity for 5-ALA was 95% (87 to 98%) and 57% (32 to 67%), compared with 85% \n(76 to 94%) and 80% (58 to 100%) for HAL.   \n \nClinical effectiveness \nAll four studies, involving 544 patients, reported residual tumour rate (pTa and pT1).  \nThe timing of cystoscopy following TURBT ranged from 10 to 14 days, to 10 to 15 \nweeks after the initial resection.  Compared with WLC, the use of PDD was \nassociated with statistically significantly fewer residual pTa and pT1 tumours (RR \n0.32, 95% CI 0.15 to 0.70 and RR 0.26, 95% CI 0.12 to 0.57 respectively), with an \noverall RR of 0.37 (95% CI 0.20 to 0.69).  Two studies involving 313 patients reported \n 12 \nrecurrence-free survival at 12 and 24 months.  In the pooled estimates there was a \nstatistically significant difference in favour of PDD at 24 months (RR 1.37, 95% CI \n1.18 to 1.59) but not at 12 months (RR 1.40, 95% CI 0.96 to 2.03).  The benefits of using \nPDD at TURBT in reducing tumour recurrence (pooled estimate RR 0.64, 95% CI 0.39 \nto 1.06) and progression (pooled estimate RR 0.57, 95% CI 0.22 to 1.46) in the longer \nterm were less clear, with the effect estimates favouring PDD without reaching \nstatistical significance.   \n \nDISCUSSION \nStatement of principal findings \nThe pooled estimates for both patient and biopsy level analysis showed that PDD \nhad higher sensitivity than WLC for detecting bladder cancer, but lower specificity.  \nPDD also had a much higher sensitivity than WLC in the detection of more \naggressive, higher risk tumours, including the detection of CIS alone.   With regard \nto effectiveness outcomes, compared with WLC the use of PDD during TURBT \nresulted in a statistically and clinically significant reduction in residual pTa and pT1 \ntumours, longer recurrence-free survival of patients at two years following surgery \nand a longer interval between TURBT and tumour recurrence.  There was no clear \nevidence of a difference between PDD and WLC for the outcomes of tumour \nrecurrence and progression in the longer term.  These results should be interpreted \nwith caution as they are based on only a small number of studies. \nAdjuvant single-dose chemotherapy administered within the first 24 hours \nand ideally within the first six hours following TURBT is standard practice in the UK \nand much of Europe and was shown in a meta-analysis to reduce the relative risk of \nrecurrence by 39% with a median follow-up of 3.4 years (15).  The administration of \nadjuvant intravesical therapy varied across the four RCTs and this made it more \ndifficult to assess what the true added value of PDD might be in reducing bladder \ntumour recurrence rates in routine practice.  Although single-dose intravesical \n 13 \nchemotherapy can chemoresect small residual papillary marker lesions (10) it is \nknown to be insufficient treatment for patients with intermediate and high-risk \ntumours including concomitant CIS, the types more likely to be detected by PDD \n(14). \n \nStrengths and limitations of the study \nIn terms of strengths, a recently recommended HSROC model was employed which \ntakes account of the trade off between true and false positives and models between \nstudy heterogeneity (8).  Pooled estimates of both patient and biopsy level detection \nwere undertaken.  However biopsy level estimates were likely to be an \nunderestimate of the true uncertainty due to clustering of biopsies within patients.  \nFor reports of clinical effectiveness we focused on RCTs.  In terms of limitations, non-\nEnglish language studies were excluded.  Based on screening English language titles \nor abstracts our searches identified 33 non-English language studies relating to PDD, \nsome of which may have otherwise met the inclusion criteria.   \n \nImplications for practice and research \nOur results suggest that the appropriate point in the clinical pathway for PDD to be \nused is in conjunction with rigid WLC during the initial TURBT, and possibly also in \nconjunction with rigid WLC during surveillance monitoring of high risk patients.  \nThe advantages of higher sensitivity (fewer false negative results, better detection of \nhigher risk tumours) of PDD compared with WLC have to be weighed against the \ndisadvantages of lower specificity (more false positive results, leading to additional \nunnecessary biopsies, potentially additional unnecessary investigations and the \nresulting anxiety caused to patients and their families).  In terms of the \nphotosensitising agents used, HAL would result in fewer false positives than 5-ALA \n(based on data for both patient and biopsy-level analyses), although it is possible that \n 14 \nother factors apart from the agent used may also have contributed to the specificity \nvalues reported.   \n The literature continues to develop with regard to PDD in conference \nabstracts.  The study by Stenzl and colleagues (13) is noteworthy because it reports \nfor the first time a HAL-based phase III multicentre RCT (PC B305) with clinical \neffectiveness outcomes.  Of 766 patients randomised in 28 European and USA \ncentres, the recurrence rate at nine months was 36% following HAL-based TURBT \nand 46% following WLC-assisted TURBT (p=0.029).  Although full publication is \nawaited, the FDA in December 2009 approved HAL as an adjunct to WLC in the \ndetection of non-muscle invasive bladder cancer.  \n We are aware of one other systematic review of PDD in non-muscle invasive \nbladder cancer, by Kausch and colleagues (5).  Although Kausch and colleagues \nconsidered studies published in English, French or German, of 21 reports of 17 trials \nincluded, only two were non-English language (both German).  Their review \npresented a patient-based meta-analysis of additional detection rate of PDD \ncompared with WLC and considered effectiveness outcomes such as residual tumour \nand recurrence-free survival but did not report diagnostic accuracy measures such as \nsensitivity and specificity.  However, similar to our review, Kausch and colleagues \n(5) concluded that PDD detects more patients with bladder tumours, especially more \nwith CIS, than WLC, and that more patients have a complete resection and a longer \nrecurrence-free survival when diagnosed with PDD.      \n Further research is needed in the form of RCTs comparing PDD alone, with \nPDD or rigid WLC plus single dose adjuvant chemotherapy at TURBT in patients \npresumed to have non-muscle invasive bladder cancer.  Study design should take \ninto account participant risk factors, for example smoking and age and allow \noutcomes to be reported based on risk categories at randomisation.  Clinical \neffectiveness outcomes should include residual tumour rates at first check \ncystoscopy, recurrence-free survival, tumour recurrence rates, time to first \n 15 \nrecurrence, and progression.  Provision should be made for longer term (up to 10 \nyears) follow-up.   \n \n 16 \nReference List \n \n \n 1.  Babjuk M, Oosterlinck W, Sylvester R, et al. Guidelines on TaT1 (non-muscle-\ninvasive) bladder cancer. [document on the Internet]. Arnhem: European \nAssociation of Urology; 2009. [accesssed January 2010] URL: \nhttp:\/\/www.uroweb.org\/fileadmin\/tx_eauguidelines\/2009\/Full\/TaT1_BC.pdf \n \n 2.  Babjuk M, Soukup V, Petrik R, Jirsa M, Dvoracek J. 5-aminolaevulinic acid-\ninduced fluorescence cystoscopy during transurethral resection reduces the \nrisk of recurrence in stage Ta\/T1 bladder cancer. BJU Int 2005; 96:798-802. \n 3. Hendricksen K, Moonen PM, der Heijden AG, Witjes JA. False-positive \nlesions detected by fluorescence cystoscopy: any association with p53 and p16 \nexpression? World J Urol 2006; 24:597-601. \n 4.  Jichlinski P, Wagnieres G, Forrer M, et al. Clinical assessment of fluorescence \ncytoscopy during transurethral bladder resection in superficial bladder \ncancer. Urol Res 1997; 25:S3-S6. \n 5.  Kausch I, Sommerauer M, Montorsi F, et al. Photodynamic Diagnosis in Non-\nMuscle-Invasive Bladder Cancer: A Systematic Review and Cumulative \nAnalysis of Prospective Studies. Eur Urol 2010; 57:595-606. \n 6.  Koenig F, McGovern FJ, Larne R, et al. Diagnosis of bladder carcinoma using \nprotoporphyrin IX fluorescence induced by 5-aminolaevulinic acid. BJU Int \n1999; 83:129-135. \n 7.  Kriegmair M, Zaak D, Rothenberger KH, et al. Transurethral resection for \nbladder cancer using 5-aminolevulinic acid induced fluorescence endoscopy \nversus white light endoscopy. J Urol 2002; 168:475-478. \n 17 \n 8.  Leeflang MM, Deeks JJ, Gatsonis C, Bossuyt PM, Cochrane Diagnostic Test \nAccuracy Working Group. Systematic reviews of diagnostic test accuracy. \nAnn Intern Med 2008; 149:889-897. \n 9.  Macaskill P. Empirical Bayes estimates generated in a hierarchical summary \nROC analysis agreed closely with those of a full Bayesian analysis. J Clin \nEpidemiol 2004; 57:925-932. \n 10.  Masters JRW, Popert RJM, Thompson PM, et al. Intravesical chemotherapy \nwith epirubicin: A dose response study. J Urol 1999; 161:1490-1493. \n 11. Mowatt G, Zhu S, Kilonzo M, et al.  Systematic review of the clinical \neffectiveness and cost-effectiveness of photodynamic diagnosis and urine \nbiomarkers (FISH, ImmunoCyt, NMP22) and cytology for the detection and \nfollow-up of bladder cancer.  Health Technol Assess 2010;14(4).   \n \n 12.  Sangar VK, Ragavan N, Matanhelia SS, Watson MW, Blades RA. The \neconomic consequences of prostate and bladder cancer in the UK. BJU Int \n2005; 95:59-63. \n 13.  Stenzl AS, Roessler WR, Fradet YF, et al. HEXVIX fluorescence cystoscopy \nimproves detection and resection of papillary bladder cancer and reduces \nearly recurrence: a multicentre prospective randomized trial. Abstract 1010. \nEur Urol Suppl 2009; 8:373. \n 14.  Sylvester RJ, Oosterlinck W. An Immediate Instillation after Transurethral \nResection of Bladder Tumor in Non-Muscle-Invasive Bladder Cancer: Has the \nEvidence Changed? Eur Urol 2009; 56:43-45. \n 15.  Sylvester RJ, Oosterlinck W, Van Der Meijden APM. A single immediate \npostoperative instillation of chemotherapy decreases the risk of recurrence in \n 18 \npatients with stage Ta T1 bladder cancer: A meta-analysis of published results \nof randomized clinical trials. J Urol 2004; 171:2186-2190. \n 16.  UK bladder cancer statistics [webpages on the Internet]. Cancer Research UK; \n2010. [accessed January 2010] URL: \nhttp:\/\/info.cancerresearchuk.org\/cancerstats\/types\/bladder\/?a=5441 \n 17.  Whiting P, Rutjes AW, Reitsma JB, Bossuyt PM, Kleijnen J. The development \nof QUADAS: a tool for the quality assessment of studies of diagnostic \naccuracy included in systematic reviews. BMC Med Res Methodol 2003; \n3(25):Nov 10. \n 18.  Zaak D, Karl A, Knuchel R, et al. Diagnosis of urothelial carcinoma of the \nbladder using fluorescence endoscopy. BJU Int 2005; 96:217-222. \n \n \n \n \n \n 19 \n \n \nTable 1 Sensitivity of PDD and WLC in detecting stage\/grade of tumour \n \n PDD sensitivity % \nMedian (range) \nWLC sensitivity %  \nMedian (range) \nNumber of  \npatients (biopsies) \nNumber \nof studies \nLess aggressive\/lower risk \nPatient based \ndetection \n92 (20 to 95) 95 (8 to 100) 266 3 \nBiopsy based \ndetection \n96 (88 to 100) 88 (74 to 100) 1206 (5777) 7 \nMore aggressive\/higher risk including CIS \nPatient based \ndetection \n89 (6 to 100) 56 (0 to 100) 563 6 \nBiopsy based \ndetection \n99 (54 to 100) 67 (0 to 100) 1756 (7506) 13 \nCIS \nPatient based \ndetection \n83 (41 to 100) 32 (0 to 83) 563 6 \nBiopsy based \ndetection \n86 (54 to 100) 50 (0 to 68) 1756 (7506) 13 \n \nNotes: \n1. The number of biopsies is the overall total reported by the studies. \n2. Number of biopsies.  In some studies more biopsies were taken for PDD than \nWLC and in these cases the higher number used for PDD has been used in the \ntable.  In the less aggressive\/lower risk category, Hendricksen and colleagues (3) \nreported 217 biopsies for PDD and 123 for WLC while Koenig and colleagues (6) \nreported 130 biopsies for PDD and 67 for WLC.  Hendricksen and colleagues and \nKoenig and colleagues were also included in the more aggressive\/higher risk \ncategory, as was Jichlinski and colleagues (4), who reported 421 biopsies for PDD \nand 414 for WLC.  The studies by Hendricksen and colleagues, Jichlinski and \ncolleagues and Koenig and colleagues were also amongst those reporting \ndetection of CIS.       \n \n 20 \n \n \nFigure 1 Flow of studies through review process \n \n \n Titles and abstracts screened (n=5680) \n(for PDD and selected biomarkers) \nNot relevant for PDD review (n=5600) \nFull articles screened for PDD review (n=80) \nExcluded studies (n=36): \nRequired outcomes not reported: 12 \nRequired study design not met: 10 \nRequired reference standard not met: 2 \nComparator not WLC: 1 \nRetained for background information: 11 \n44 reports of 31 studies included (diagnostic accuracy \nn=27, clinical effectiveness n=4) \n 21 \n \n \nFigure 2 Summary of quality assessment of the diagnostic studies (n=27)  \n \n0% 20% 40% 60% 80% 100%\nSpectrum representative?\nRef standard correctly classifies condition? \nTime period between tests short enough?\nPartial verification bias avoided?\nDifferential verification bias avoided?\nIncorporation bias avoided?\nTest review bias avoided?\nDiagnostic review bias avoided?\nClinical review bias avoided?\nUninterpretable results reported?\nWithdrawals explained?\nPositive result clearly defined?\nData on observer variation reported?\nYes\nUnclear\nNo\n \n 22 \nFigure 3 SROC plot for biopsy level analysis (n=14 studies) \n \n \n \n \n 23 \nFigure captions \nFigure 1 Flow of studies through review process \nFigure 2 Summary of quality assessment of the diagnostic studies (n=27)  \nFigure 3 SROC plot for biopsy level analysis (n=14 studies) \n \n \n \n \n"}