{"doi":"10.1017\/S0022278X06242228","coreId":"11129","oai":"oai:eprints.lancs.ac.uk:35504","identifiers":["oai:eprints.lancs.ac.uk:35504","10.1017\/S0022278X06242228"],"title":"Between a rock and a hard place : African NGOs, donors and the state. Igoe, J. & Kelsall, T.","authors":["Hearn, Julie"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-12","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/11129.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/35504\/1\/displayFulltext.pdf","pdfHashValue":"9758bce6ad544dbfa25c77908c4413ef11b7c120","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:35504<\/identifier><datestamp>\n      2018-01-23T00:02:45Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4A:4A41<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Between a rock and a hard place : African NGOs, donors and the state. Igoe, J. & Kelsall, T.<\/dc:title><dc:creator>\n        Hearn, Julie<\/dc:creator><dc:subject>\n        JA Political science (General)<\/dc:subject><dc:date>\n        2006-12<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/35504\/1\/displayFulltext.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0022278X06242228<\/dc:relation><dc:identifier>\n        Hearn, Julie (2006) Between a rock and a hard place : African NGOs, donors and the state. Igoe, J. & Kelsall, T. Journal of Modern African Studies, 44 (4). p. 653. ISSN 1469-7777<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/35504\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S0022278X06242228","http:\/\/eprints.lancs.ac.uk\/35504\/"],"year":2006,"topics":["JA Political science (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"http:\/\/journals.cambridge.org Downloaded: 13 Jan 2011 IP address: 194.80.32.10\nReviews\nFanon’s Warning: a civil society reader on the New Partnership for\nAfrica’s Development edited by PATRICK BOND\nTrenton, NJ: Africa World Press, 2005. Pp. 295. US$24.95 (pbk.).\ndoi:10.1017\/S0022278X06212229\nThe onset of the New Partnership for Africa’s Development (NEPAD) seemed\nto signal the formation of political will within Africa’s leadership to adhere to\nprinciples of good governance and market economics. Yet, a persistent worry was\nthat ‘on the ground’, few understood NEPAD and civil society had not been\nconsulted. This edited volume by Patrick Bond addresses this omission through\nits comprehensive and important collection of civil society’s concerns about\nNEPAD.\nMost significantly, Fanon’s Warning brings the voice of civil society to the fore.\nIt provides a stinging critique of NEPAD; South Africa, a leader of NEPAD;\nand the policies employed to advance Africa’s development. According to the\ncivil society organisations cited, NEPAD is neither new nor an indication of\nchanging political will. While NEPAD extols the virtues of honouring\nhuman rights, in practice civil society groups charge that the opposite is true.\nEchoing other civil society groups, Ian Taylor of the University of Botswana notes\nthat Africa’s commitment to good governance and democratic principles is\nbetrayed by the lack of response to Mugabe’s austere policies in Zimbabwe\n(p. 81).\nThe main part of the book is a nearly paragraph by paragraph criticism\nof NEPAD by scholars associated with the Alternative Intellectual and\nDevelopment Centre. NEPAD is denounced as incomplete and illogical\n(pp. 101–3) and wrongly focused on globalisation (pp. 115, 137). A primary criti-\ncism warns that NEPAD’s focus on market policies will cloud efforts to improve\nrespect for human rights in Africa, as decisions will be made based on privilege\nand market access, rather than on basic rights (p. 145). Although Egypt, Algeria,\nSenegal, and Nigeria also led the NEPAD proposal, the annotated critique\nfrequently points to South Africa, because of its leadership position in Africa,\nas a test for NEPAD’s viability. Bond and others repeatedly accuse President\nThabo Mbeki of ‘ talking left, acting right ’ (p. 22) – meaning that he is seeks to\nplease international financial institutions, while claiming to champion plans that\nadvance basic human rights and development through NEPAD. But, in their\nview, NEPAD has nothing new or beneficial to offer Africa (p. 126).\nBond offers an Afterword to bring the assessment of NEPAD up to date from the\nbook’s first printing in 2002. He concedes that governments have increased their\nconsultation with civil society, but contends that NEPAD has still not proved\nbeneficial to Africa, as exemplified by the continuing economic decline and\npersistent political crises. Yet Bond’s harsh criticism is not entirely justified. While\nZimbabwe remains a glaring failure in Africa’s international relations, African\nJ. of Modern African Studies, 44, 4 (2006), pp. 649–660. f 2006 Cambridge University Press\nPrinted in the United Kingdom\nhttp:\/\/journals.cambridge.org Downloaded: 13 Jan 2011 IP address: 194.80.32.10\ngovernments have increased their interventions to resolve other internal conflicts,\na dramatic change from the past. Furthermore, in implementing NEPAD’s\nAfrican Peer Review Mechanism, civil society organisations are integral partners\nin assessing their country’s governance and economic policies. Omitting\nsuch critical developments paints a one-sided picture of civil society’s view of\nNEPAD. Moreover, Bond states that he does not suggest an alternative to\nNEPAD, because such a proposal should come from civil society (p. 94), and this\ndecision weakens his argument. Without a doubt, Africa needs a new approach\nto development, but merely criticising NEPAD without offering an alternative\nonly accomplishes half the task.\nDOR I N A A. B E KO E\nUnited States Institute of Peace\nFrench Beans and Food Scares: commerce and culture in an anxious\nage by SUSANNE FREIDBERG\nOxford: Oxford University Press, 2004. Pp. 269. £15.99 (pbk.).\ndoi:10.1017\/S0022278X06222225\nSusanne Freidberg’s illuminating book details the commodity networks of French\nbean production and commercialisation from Burkina Faso and Zambia, to\nFrance and Britain, respectively. Using a multi-sited analysis of these networks, it\nprovides a thorough history of them, and provides an account for changes within\nthem from the colonial era to the present day. In recent years, food markets in\nEurope have experienced a number of scares, such as BSE and foot-and-mouth\ndisease. These provide an interesting and topical backdrop to the book. It does\nnot, however, focus exclusively upon these scares. Instead, Freidberg absorbs the\nreader through her analysis of how cultural views of food in the two European\ncountries, and their views on best practice in French bean production in\nFrancophone and Anglophone Africa, impact very differently on the two bean\ncommodity networks. Hence, the book primarily shows that while Burkina Faso\nand Zambia are both former colonies which now produce beans for markets in\nFrance and Britain respectively, the actors, business relationships and quality\ncontrols instilled within the production and commercialisation of this crop greatly\ndiffer between the two commodity networks. Freidberg argues that these differ-\nences exist as a result of the shared histories and cultures within each network,\nboth of which are situated within a broader framework of structural power that is\nstill exerted by France and Britain.\nBuilding on research in Burkina Faso which she began in 1993, Freidberg’s\narguments are clearly supported by detailed qualitative research of the two net-\nworks from the producers and exporters in Burkina Faso and Zambia, through to\nthe importers, wholesalers and retailers in France and Britain. Consequently,\nresearch data shows how French and British dominance within French bean\nproduction in Burkina Faso and Zambia continues. For example, it is docu-\nmented that French importers of green beans to this day prefer to source crops\nfrom smallholder farmers in Burkina Faso, while British importers endorse bean\nproduction within large-scale, often white-owned farms in Zambia. In the case of\nthe latter, the author also shows how non-governmental organisations (NGOs),\nsuch as the Soil Association and the Ethical Trading Initiative, have helped to\n650 R E V I EW S\nhttp:\/\/journals.cambridge.org Downloaded: 13 Jan 2011 IP address: 194.80.32.10\ninfluence the country’s biggest food retailers about the procedures which should\nbe in place throughout the different stages of crop cultivation and commercial-\nisation. However, Freidberg argues that while NGO involvement in food com-\nmodity networks is welcome in markets dominated by just a handful of\nsupermarket chains, setting such standards also helps to reinforce the power of\ncrop importers regarding best practice in food quality control within producer\ncountries.\nOverall, Freidberg’s book helps us to understand and evaluate how standards\nwithin cross-continental food markets during the colonial era through to recent\nyears have increasingly removed the influence of crop producers with ‘practical\nknowledge ’ (p. 222). Although the book would benefit from a list of acronyms, it is\na much welcome insight into food commodity networks which generate and are\ngenerated by historical and current patterns of culture, economics and power.\nN I C O L A S COT T\nManchester University\nDemocratic Reform in Africa: the quality of progress edited by\nE. GYIMAH-BOADI\nBoulder, CO and London: Lynne Rienner Publishers, 2004. Pp. 349. US$23.50\n(pbk.).\ndoi:10.1017\/S0022278X06232221\nGyimah-Boadi has no illusions about the current situation. Democratisation is\n‘highly incomplete ’, and its institutions are fragile and weak (pp. 14, 22–3). Reform\nprogrammes have only achieved less than optimum results, even by ‘African\nstandards ’, and remain stalled at best (p. 3). Even in such relatively successful\ncases as Botswana, Mauritius, Senegal and South Africa, the prospects of\ndemocratic consolidation – more than one transfer of power through the ballot\nbox – are assessed as ‘no better than fair ’ (p. 10), though in actuality Mauritius\nhas uniquely experienced multiple transfers. Standards of democratic perform-\nance are everywhere low, as existing presidents manoeuvre to perpetuate their\nrule, appoint incompetents and sycophants to office, neglect minority interests,\nand administer elections unfairly. Under prevailing limitations, Gyimah-Boadi is\nclear, two or three elections do not make a democracy, and he distinguishes\nbetween the existing issues of constitutionalism and those of future, possible\ndemocratisation (pp. 6, 12).\nHe presents useful socio-economic data, including Human Development\nIndexes (Tables 1.1, 1.2), which Larry Diamond backs up with further important\ndata. But neither offer Gini coefficient figures, nor data on income inequalities,\neven though these are highly revealing of underlying social realities which\ngovernments try to obscure. The institutional barriers to democratisation are\ndescribed as patrimonial rule, and economic weakness and clientelism are seen\nas hallmarks of African statehood (p. 13). All these judgements are refreshingly\nrealistic. But a more concrete analysis of the barriers, in, say, ubiquitous\npresidential powers, and in ruling-party predominance – characteristic features of\nsouthern Africa – is not attempted.\nDemocratic potentialities are not fully analysed either. Gyimah-Boadi says that\ncivil societies have emerged as key forces in moving away from unalloyed state\nR E V I EW S 651\nhttp:\/\/journals.cambridge.org Downloaded: 13 Jan 2011 IP address: 194.80.32.10\nhegemony (p. 7), but the specifics of their size, organisation, aims and\nautonomy are not addressed. He sees democracy as never complete (p. 13), and\nnotes that African democratic experiments have yet to extend from their liberal-\nrepresentative forms to participatory elements (p. 11). But the great participatory\nupsurge in South Africa through the 1980s, focussed on the United Democratic\nFront and COSATU, a process of historic importance, is unnoticed. In recent\nyears, new social formations, large, well organised and determined, have again\nbecome a prominent feature of participatory aspirations in Africa’s strongest\neconomy.\nDiamond sees weak democracy, corruption, and economic weaknesses as\ninter-linked, and believes that economic failure will continue as poor governance\nprevails (p. 267). He quotes an estimate from 2002 of the cost of corruption\nin Africa as US$148 billion annually (p. 269). His judgements of the new\/old\nAfrican Union, and especially of its Peer Review Process, are pertinent : ‘ there is\nlittle … to suggest that African leaders – most of whom themselves are drenched\nin the very problems of corrupt, neopatrimonial, patronage politics that NEPAD\nis supposed to combat – are prepared to allow blunt and probing evaluations of\ntheir own and their fellow governments’ performance’ (p. 276). Fifteen out of fifty\nthree countries had agreed to peer review in 2003, and only four have undergone\nReview by early 2006. None of the expected Country Reports have been made\npublic.\nDiamond considers democratisation at national, continental and global levels,\nand stresses the need for foreign assistance to move from conditionality to selectivity\n(his emphasis), where aid will be dispensed selectively to ‘reward and deepen,\nand thus preserve and consolidate, reforms that have already begun to be\nimplemented by [a] country, according to its own design’ (p. 280). Selectivity\nis fundamentally different from earlier conditionalities, he says. ‘ It rewards\ncountries for what they are already doing: it would precisely compel African\nrulers to be accountable and responsive to their own people as a pre-\nrequisite … involvement of the African people themselves is crucial to the success\nof this approach’ (p. 285).\nGyimah-Boadi’s book is a mixture of strengths and weaknesses by inclusion\nand exclusion. The extreme presidentialist systems of Angola and Zimbabwe are\nnot examined, and Mauritius, Africa’s most functional liberal democracy, is also\nabsent. Botswana is included, but Patrick Molutsi, an analyst of civil society,\nchooses to ignore the severe limitations evident in this authoritarian ‘African\nmiracle ’ – presidential autocracy, ruling party predominance, weak parliament,\njudiciary and civil society, diamond dependency, and deep inequalities. Like\nMauritius, Botswana is an Upper Middle Income country where, unlike in the\nformer, some fifty per cent of the people subsist on less than two US dollars a day.\nSteven Friedman is the author of the path-breaking work, Building Tomorrow\nToday, but he restricts his study of South Africa largely to the period of the\n1999 election, and to voting and voting behaviour. Overall, however, it is the\ncritical strengths which stand out, and make this an especially important and\nuseful book.\nK E N N E TH GOOD\nUniversity of Melbourne\n652 R E V I EW S\nhttp:\/\/journals.cambridge.org Downloaded: 13 Jan 2011 IP address: 194.80.32.10\nBetween a Rock and a Hard Place: African NGOs, donors and the\nstate edited by J. IGOE and T. KELSALL\nDurham, NC: Carolina Academic Press, 2005. Pp. 309. US$40.00.\ndoi:10.1017\/S0022278X06242228\nThis is a collection of nine ethnographic case studies, looking at a range of African\nNGOs in seven countries, including Zimbabwe, Mali and Guinea-Bisseau. The\naim of the book is to insert some ‘ thick description’ into the contemporary\ndiscussion on African NGOs. African NGOs came to centre-stage in the 1990s\namidst the flurry of interest in African civil society, perceived and intervened in\nthrough a rigidly de Tocquevillean lens. The authors maintain that the debate has\nmoved from an initial enthusiasm, indeed romanticisation, to disappointment,\nleading to a pathologisation of African NGOs. They argue that the discourse\nhas suffered from a lack of detailed research on the ground into the context in\nwhich specific NGOs operate and how these interact with local as well as global\npolitics, weaving new cultural meanings and restructuring the institutional land-\nscape. The literature has been informed by Northern policy imperatives rather\nthan reality.\nFine examples of detailed case studies of African NGOs do exist, such as Susan\nDicklitch’s 1998 study of five Ugandan NGOs and more recently, Sarah\nMichael’s 2004 comparative analysis of local NGOs in Zimbabwe, Tanzania and\nSenegal, provocatively entitled Undermining Development. However, this volume\naddresses important issues, such as autonomy, and adds to our understanding\nof them. Marie-Emmanuelle Pommerolle’s chapter provides a carefully observed\nand, I would argue, accurate study of autonomy by examining the Kenya Human\nRights Commission (KHRC). The KHRC has succeeded in defining its own\nradical version of human rights that is deeply embedded in the Kenyan context,\nand has avoided falling prey to the hegemonic projects of both ‘donors ’ and the\nstate. However, I would argue that the KHRC is the exception that proves the\nrule, as indicated by the material in the other chapters. Despite entwinement in\nthe international aid regime, KHRC has maintained its autonomy, unlike other\nAfrican NGOs, because of its uniquely radical political roots that have shaped its\ncore identity. This raises the interesting question of whether KHRC is more a\nsocial movement than an NGO.\nThe main shortcoming of this collection is that all the contributors appear to be\noutsiders to the context that they are studying. In a volume of this range, I would\nhave liked to see some African writers. This issue is carefully discussed in the\njointly authored conclusion, and the general premise appears to be a dividing line\nbetween the actors and activists who are insiders, and the observers and analysts\nwho are outsiders. A progressive partnership between the two camps is espoused,\nbut why not reflect a productive joint enterprise between African and Northern\nobservers within this book? From East Africa, Mutahi Ngunyi, Wachira Maina,\nSylvia Tamale, Joe Oloka-Onyango and Jean John Barya have all written\nextensively on the ‘ institutional and discursive interstices that exist in the global\ndevelopment apparatus, upon which many social movements in Africa and else-\nwhere unfortunately depend for their success ’ (p. 300).\nJ U L I E H E A RN\nLancaster University\nR E V I EW S 653\nhttp:\/\/journals.cambridge.org Downloaded: 13 Jan 2011 IP address: 194.80.32.10\nHIV\/AIDS in South Africa edited by S. S. ABDOOL KARIM and Q. ABDOOL\nKARIM\nCambridge: Cambridge University Press, 2005. Pp. 592. £35.00.\ndoi:10.1017\/S0022278X06252224\nThis book makes an extraordinary contribution to the growing body of literature\non HIV\/AIDS in South Africa. The editors bring together an extensive group\nof researchers who write about the full range of issues associated with the\nHIV\/AIDS epidemic. The book is organised into seven sections (36 chapters),\nand explores HIV\/AIDS in relation to its history, molecular structure and\ndevelopment, risk factors and prevention strategies, key focal (or vulnerable)\ngroups ; its widespread impact (social, political and ethical) ; and treatment and\nmanagement.\nThe breadth of issues covered in this collection is both a strength and a limi-\ntation. The wide range of topics dealt with demonstrates the extent to which\nHIV\/AIDS permeates all elements of South African society. Indeed, this book\nhighlights the importance of engaging with the epidemic in a multi-disciplinary\nway. Section 5 on ‘The Impact of AIDS’ does this particularly well. It begins with\na narrative account of living with HIV\/AIDS, but also includes illuminating\nchapters on the health care burden of the epidemic which highlight its conse-\nquences for other diseases and health care services in general (Colvin), as\nwell as the challenging and contentious ethical questions which vaccine (and\nother) trials pose for researchers (Singh). These chapters articulate well with\nother ‘ impacts ’ – political (Heywood), economic (Whiteside) and community\n(Frohlich). This collection succeeds in bringing a number of scholars and disci-\nplines together. It places epidemiologists, biomedical and social scientists in con-\nversation with each another, in ways which have been difficult to do over the\ncourse of the epidemic in South Africa. Yet, this is critical to both understanding\nand combating the epidemic. Although many arguments and issues are tackled\nin this collection in individual chapters, the editors argue that it remains poss-\nible to ‘ turn the tide of the epidemic ’ (p. 572) in South Africa. They suggest\nthat wide-scale provision of antiretroviral therapy in conjunction with multiple\nprevention strategies has created the opportunity to change the course of the\nepidemic in the region.\nThe expansive scope of the book of necessity means that many issues are\ncovered, some too briefly. This is particularly the case in respect of matters of\nsexuality, which is not adequately engaged through ‘gender ’. Extensive anthro-\npological and sociological work on sexuality, sexual practices, and the complex\nrole of culture in the transmission and prevention of HIV\/AIDS could usefully\nbe included. Detailed guidance in the book on further reading would go some\nway to remedying this.\nThis collection has been well organised and carefully conceptualised. It is\nencyclopaedic in nature, and constitutes an extremely valuable resource for those\nworking and researching in the field of HIV\/AIDS.\nL I Z W A L K E R\nUniversity of Hull\n654 R E V I EW S\nhttp:\/\/journals.cambridge.org Downloaded: 13 Jan 2011 IP address: 194.80.32.10\nStarter Packs: a strategy to fight hunger in developing countries?\nLessons from the Malawi experience 1998–2003 edited by S. LEVY\nWallingford: Cabi Publishing, 2005. Pp. 295. £55.00.\ndoi:10.1017\/S0022278X06262220\nThe re-emergence of non-conflict-precipitated famine in southern and eastern\nAfrica has re-ignited old questions about the most effective means of ensuring\nnational-level food security. This detailed and wide-ranging book offers import-\nant insights into the urgent and seemingly intractable issue of food security in\nMalawi. This is through a candid account of the successes and failures of the\nStarter Pack scheme implemented from the 1998\/99 to the 2003\/04 agricultural\nseason.\nThe book’s 19 chapters cover an extensive range of issues, stretching from\nagronomy and logistics to inter-donor rivalries and conflicts. The chapters have\nbeen written predominantly by those involved in the creation, management,\nmonitoring, and evaluation of Starter Pack, as well as a chapter each by Conroy,\nHarrigan, Whiteside, and Dorwood\/Kydd, none of whom were closely connected\nwith the programme. Despite the diversity of subjects broached by the book,\nand tension between some of the chapters, the editor, Sarah Levy, makes\na persuasive argument that a universal Starter Pack should continue to be used as\na short-term measure to contribute to national-level food security in Malawi.\nTo counteract a decline in maize production in the 1996\/97 and 1997\/98\nagricultural seasons, Starter Pack provided smallholders with a free pack of\nimproved maize seed, fertiliser and legume seed to grow 0.1 ha of maize. Initially,\nit was distributed universally to over 2.8 million households, and financed by\ngovernment and numerous donors including the World Bank. The Starter Pack\nscheme contributed to bumper maize harvests in 1999 and 2000. In subsequent\nyears, Starter Pack was scaled down, evolved into a ‘ targeted’ social safety net,\nand became increasingly financed by DfID. In 2004\/05 Starter Pack was replaced\nby President Mutharika with a broad fertiliser subsidy.\nLevy argues strongly for the efficacy and efficiency of a universal Starter\nPack programme. Whilst originally conceived to foster smallholder commercial\nmaize farming through technology transfer, Starter Pack never increased small-\nholders’ supply of maize into markets. Instead, Levy argues that Starter Pack’s\nmain contribution to national-level food security has been through reducing\nand delaying demand side pressure on maize prices during the critical ‘hungry\nperiod’, thus ensuring that poorer households are not priced out of the market.\nMaize prices are critical in determining rural households’ access to food, as\nhardly any rural households in Malawi produce enough food for subsistence.\nA key point in Levy’s argument is that scale matters : when Starter Pack was not\nuniversal its impact declined a disproportionate amount. Levy also argues\nthat Starter Pack is the most efficient means through which to deliver national\nfood security, compared with a general fertiliser subsidy, maize imports or\nfood aid.\nAway from the main argument of the editor, this book offers numerous insights\nabout the evolution of Starter Pack. For example, how the creation of Starter\nPack dovetailed with the UDF government’s re-election efforts in 1999 (ch. 2), the\npivotal roles of Aleke Banda and Harry Potter (DfID) in determining the size of\nR E V I EW S 655\nhttp:\/\/journals.cambridge.org Downloaded: 13 Jan 2011 IP address: 194.80.32.10\nthe programme each year (ch. 2), and the controversy over the relative merits\nof hybrid and open pollinating varieties of maize (chs. 1, 12). Further issues raised\nby the book have a wider relevance than the case in question. For example, how\na secondary purpose of the monitoring and evaluation of Starter Pack was to\nincrease research capacity in Malawi (ch. 5), and how attempts at ‘community\ntargeting ’ of Starter Pack failed comprehensively (ch. 14).\nFor this reader, the most interesting sections of the book are the responses it\nprovides to critics of the scheme. Starter Pack was accused of crowding out the\nprivate sector, fostering smallholder dependency on hand-outs, and being overly\nbureaucratic. The book (especially chs. 9, 10, 14, 17) offers clear evidence to refute\nthese accusations, and suggests that such criticisms were not based on the\nempirical evidence available, but on ideological objections.\nDespite the breadth of topics discussed in the book, there are three subjects that\nshould have merited more consistent attention. Firstly, the book does not address\nthe issue of deagrarianisation sufficiently, especially in relation to the southern\nregion. Secondly, the book tends to marginalise the possible role of the estate sub-\nsector in contributing to national food security. Thirdly, and most importantly,\nthe book engages very superficially with a highly significant shift in the Malawian\nrural economy in the past ten years – the switch of burley tobacco production\nfrom estates to smallholders. Considering the macro-economic impact of declines\nin foreign exchange earnings from tobacco exports, and the World Bank\/USAID\nexpectation that smallholder burley tobacco production would increase hybrid\nmaize production, this is a considerable omission.\nThis frank account of the successes and shortcomings of Starter Pack will\nbe keenly read by those with an interest in Malawian affairs. Whether it will\nbe read by critics of the scheme, or whether the lessons learnt from Starter\nPack will be put into practice in Malawi or elsewhere in the region, remains to\nbe seen.\nM A R T I N P ROW S E\nManchester University\nCattle Bring Us to Our Enemies: Turkana ecology, politics, and\nraiding in a disequilibrium system by J. T. MCCABE\nAnn Arbor, MI: University of Michigan Press, 2004. Pp. 301. US$29.00 (pbk.).\ndoi:10.1017\/S0022278X06272227\nThis book is a late product of the remarkable South Turkana Ecosystem Project\n(STEP), a long-term US-funded research programme that attempted to develop\nscientific understanding of the ecology of pastoral activities among one section\nof the Turkana in northern Kenya, the Ngisonyoka. The approach was primarily\nbiological rather than cultural, the work attempting to combine sociocultural\nanthropology, ecology, human population biology, and demography. The result\nwas a long series of papers that helped transform thinking about the way pas-\ntoralists manage their herds under variable rainfall conditions, and on the ecology\nof disequilibrial ecosystems. This work underpinned the development of so-called\n‘new range ecology ’ in the early 1990s. A valuable feature of this book is that\nit reviews STEP’s work, and incorporates a complete bibliography, including\n656 R E V I EW S\nhttp:\/\/journals.cambridge.org Downloaded: 13 Jan 2011 IP address: 194.80.32.10\nclassic papers such as those on energy pathways (Couhgenour et al. 1985, Science\n230: 619–25), or on livestock feeding ecology (Coppock et al. 1986, Journal of Applied\nEcology 23: 573–83 & 585–95).\nTerrence McCabe’s own fieldwork in Turkana began in 1980, and this book is\nbased on his original doctoral study and subsequent fieldwork up to 1996. He\nprovides a useful historical, environmental and social introduction to Turkana,\nand the long time-frame of the analysis (McCabe’s fieldwork period incorporated\nseveral intense droughts, and periods of intense raiding against Ngisonyoka herds)\nprovides telling insights into the challenge of livelihood sustainability in this re-\ngion. At one level, therefore, this book provides an excellent demonstration of the\nimportance of ecosystem dynamics to the understanding of human–environment\nrelations, through detailed work on the decision-making about movements of\nstock and people by four pastoral families. The four families are described, and\ndata on their individual movements and on group decision-making are carefully\npresented and painstakingly analysed. The empirical chapters are illustrated with\nexcellent black and white photographs, and detailed (but rather confusing) maps.\nBeyond this valuable account of micro-decision-making by Turkana livestock\nkeeping households, McCabe also has broader aims. Unsurprisingly, given his\nacademic DNA, he has a great deal to say about the way anthropologists\nshould relate to the idea of the ecosystem. His review of non-equilibrial dynamics\nof ecosystems and changing thinking about pastoral ecology are clear and con-\nvincing. However, McCabe takes his thinking well beyond the boundaries of\nBiological Anthropology, and the book also has interesting things to say about\npolitical ecology. The analysis of stock movements by his four families reveals\nclearly that fear of livestock raiding is as potent a factor in stock movement as\nrainfall and the availability of grass, as the title quotation (from a Turkana woman\nexplaining the risks attendant on owning grass-dependent cattle in an ecosystem\nwith a fiercely seasonal rainfall regime) highlights. McCabe’s focus is on what\nhappens at the confluence of ecology, history and politics : as he notes ‘an\nexamination of how the ecosystem is structured and functions, and how the\nhuman population articulates with the ecosystem, is necessary but not sufficient to\nunderstand the complexity of human-environmental relationships ’ (p. 7).\nThis is a book rich in data, but also rich in insights into people as individuals.\nMcCabe’s first-hand accounts of cattle raids make compelling reading. The\nbook’s synthesis of material on Turkana pastoralism and on pastoral ecology\nwill be invaluable for students. Its honest and constructive discussion of how to\nbalance social and the ecological in research is worthy of wider debate, by both\ngraduate students and their elders.\nW I L L I AM AD AM S\nCambridge University\nThe African Union: Pan-Africanism, peacebuilding and development\nby TIMOTHY MURITHI\nAldershot : Ashgate, 2005. Pp. 182. £50.00.\ndoi:10.1017\/S0022278X06282223\nIn Timothy Murithi’s words, ‘ the founders of the AU have embarked on an\nambitious project of re-definition of what it means to be an African’ (p. 165).\nR E V I EW S 657\nhttp:\/\/journals.cambridge.org Downloaded: 13 Jan 2011 IP address: 194.80.32.10\nAlthough the Union’s architects have drawn from older discourses of Pan-\nAfricanism, Murithi suggests that they have set out a genuinely novel set of\nmechanisms to promote peace and development on the continent. The problem\nhis analysis persistently raises is whether those same state leaders are genuinely\ncommitted to implementing their grandiose statements of intent.\nMurithi offers a wide-ranging survey of the African Union’s initial efforts to\npromote peace and development, and to engage with various actors within civil\nsociety. After a short introduction, chapter 2 provides an overview of the Pan-\nAfrican idea and how it set the scene for the new Union. Chapter 3 recounts the\nmain obstacles to peace and development in Africa, while chapter 4 discusses\nthe institutions that have been created to deal with them. Chapter 5 surveys the\nways in which actors within civil society have been engaged or marginalised\nby the Union. Chapter 6 offers a road-map for what Murithi calls an ‘auto-\ndevelopment’ path for the continent. The short conclusion reflects on the main\nthemes that emerge throughout the book.\nThe first theme is the tension between viewing African states as part of the\nproblem of insecurity and underdevelopment in Africa, and seeing the new\nUnion and certain members of it as the main hope for the continent’s salvation.\nHere Murithi poses the key question of whether Africa’s leaders can or want to\nmove beyond their fixation with the sovereign state as the ideal form of political\ncommunity. He also offers several suggestions about how the Union should\nengage with non-state actors. Second, Murithi criticises neo-liberal policies such\nas those embodied in the New Partnership for Africa’s Development, and instead\ncalls for his own version of auto-development that focuses on the needs of local\nAfricans and fighting corruption, debt and low levels of productivity. He also\nsuggests that African states should issue Pan-African passports, and that they and\ntheir international partners should hire more local people rather than expensive\nforeign consultants. A third theme that emerges is Murithi’s disdain for many of\nthe continent’s elites and leaders. When exploring the reasons for widespread\npoverty in Africa, for instance, Murithi concludes that the ‘first line of defence\nagainst this [external] exploitation should have been African leaders and\nthe elites. They regrettably turned out to be the primary agents for Africa’s\nimpoverishment. Foreign European, North American and Asian actors would not\nhave been able to exploit Africa if the leaders and elites had not permitted\nthemselves to become complicit in what is, in effect, the greatest orchestrated\ntheft and economic sleight-of-hand perpetuated in the history of humanity ’\n(pp. 140–1). The problem remains, however, that the African Union will not live\nup to its stated objectives unless those same elites change their behaviour. Murithi\nregularly appeals to their better natures, and hopes that civic associations both\nwithin and outside Africa will be able to hold them accountable to the objectives\nset out in the Union’s new frameworks. To date, however, the signs are not\nencouraging, with Murithi listing a plethora of conferences and forums that have\nproduced reams of paper and platitudes, but little in the way of practical solutions\nto the challenges preventing peace and development on the continent.\nOverall, although seasoned observers will find little new information in\nMurithi’s book, it does provide a reasonably clear overview of the terrain\non which the African Union will develop. Finally, however, I have to ask whether\nAshgate Publishing Limited employs copy-editors, because if it does, they have\n658 R E V I EW S\nhttp:\/\/journals.cambridge.org Downloaded: 13 Jan 2011 IP address: 194.80.32.10\nfailed to do their jobs properly in relation to this book, which is littered with\nliterally hundreds of typographical and grammatical errors. Readers paying\n£50.00 for this volume should be able to expect a polished product, and in that\nsense at least they will be disappointed.\nP A U L D. W I L L I AM S\nUniversity of Birmingham\nBattling terrorism in the Horn of Africa edited by ROBERT I. ROTBERG\nWashington, DC: Brookings Institution Press, 2005. Pp. 210. US$49.95 ;\nUS$19.95 (pbk.).\ndoi:10.1017\/S0022278X0629222X\nThere have been literally hundreds of books on terrorism published since the\nSeptember 11 attacks. A tiny minority of them advance our understanding of\nterrorism and contain genuine insights, in large part because they are well\ngrounded in the terrorism studies literature, develop new theoretical insights,\nemploy rigorous methodologies, and gather new data. However, such works are\nfew and far between. The vast majority of recent books on terrorism actually\noffer very little of academic value, mainly because most are written by scholars\nunfamiliar with the terrorism studies field, who are simply looking to exploit the\ncurrent popularity of the subject. Unfortunately, Battling Terrorism in the Horn of\nAfrica falls firmly into this latter category. Written by area studies scholars and\nformer US diplomats, the book begins with an introductory chapter, which is\nthen followed by chapters offering an overview of the main terrorist threats, the\nlocal and international counter-terrorism efforts, and policy recommendations for\neach of the countries of the region: Somalia, Djibouti, Eritrea, Ethiopia, Sudan,\nYemen, and Kenya.\nOf all the book’s numerous faults, three in particular stand out. First, the\noverall findings of the book are exceedingly banal, even trivial : despite an\nalarmist introduction (which seems to contradict most of the country studies that\nfollow), virtually every other chapter begins with the admission that no significant\nterrorist threat currently exists, but that potential (mainly ‘Islamist ’ or ‘ Jihadist ’)\nterrorists could arise in the future. There then follows a desperate attempt by the\nauthors to conjure up reasons for concern about the potential terrorist threat in\nthe region. In other words, the book’s own evidence suggests that, in fact, there is\nvery little ‘battling ’ of terrorism to do at the present time in the Horn.\nSecond, and far more seriously, the book lacks any grounding at all in the\ntheoretically and empirically based terrorism literature. There is virtually no\nattempt to define terrorism or distinguish it from other forms of political violence,\nnor are there any attempts to link the analysis to the extensive literature that exists\non the complex types and causes of terrorist violence. Disturbingly, the book\nassumes a direct causal link between fundamentalist expressions of Islam and\nterrorist violence – a link thoroughly debunked by serious scholarship on both\nIslamic culture and terrorism studies. Indicative of its lack of grounding in the\nestablished terrorism literature is the ubiquitous use of a hyperbolic and propa-\ngandistic language that permeates the entire text : the region is described as a\n‘reservoir of terror ’ (p. 2) and a ‘bastion of terror ’ (p. 8) ; Yemen is purportedly\nin danger of becoming a major ‘ incubator and exporter of transnational\nR E V I EW S 659\nhttp:\/\/journals.cambridge.org Downloaded: 13 Jan 2011 IP address: 194.80.32.10\nrevolutionary Islam’ (p. 18) ; the countries of the region need to be immunised (p.\n18) and innoculated (p. 22) against terror ; the serious danger is that the region’s\n‘volatile mix could produce America’s worst nightmare’ (p. 83) ; on the terrorist\n‘balance sheet ’, Sudan is no longer the Islamist firebrand it was a decade ago\n(p. 121) ; and so on. The point is that no serious terrorism scholar (or regional\nspecialist, for that matter) would ever use such emotive, misleading and value-\nladen language.\nMore importantly, such language, as well as many of the book’s fundamental\nassumptions about the societies of the region, reveals a deep-seated paternalism\nthat frequently morphs into an explicitly civilising discourse ; it is openly stated\nthroughout the text that Western-style neoliberalism (wrapped up in US military\nassistance, good governance promotion, and IMF structural adjustment) is\nthe desperately needed antidote to local ‘ tribal ’ conflicts, backward-looking\ntraditionalism, primitivism, brutish poverty and terrorism-producing religious\nfundamentalism.\nFinally, the book’s tabloid-style language also indicates a much more profound\nand insidious problem, namely, an uncritical acceptance of official US counter-\nterrorism discourse and practice, and a willingness to lend it intellectual legitimacy.\nFrom this perspective, Battling Terrorism in the Horn of Africa functions primarily as an\nattempted academic endorsement of the general thrust of US security policy in the\nregion, and the authors wittingly or unwittingly serve the larger ideological project\nof sustaining US hegemony. The harsh reality is that it is precisely US counter-\nterrorism in the region, with its support for dictatorial and undemocratic regimes,\nits military bases and large-scale exercises, its interference in local politics, and its\ndirect military intervention (all documented without a hint of self-consciousness\nby the authors), that is likely to produce violent anti-US resistance. The authors\nrefuse to countenance such a possibility, instead arguing for ever greater levels\nof US intervention. In the end, the volume contains very little that will interest\nor excite either terrorism researchers or area studies specialists. It will, however,\nprovide reassurance to the architects of the global war on terror.\nR I C H A RD J A CK SON\nManchester University\n660 R EV I EW S\n"}