{"doi":"10.1063\/1.2213790","coreId":"101056","oai":"oai:epubs.surrey.ac.uk:461","identifiers":["oai:epubs.surrey.ac.uk:461","10.1063\/1.2213790"],"title":"Quasiperiodic attractors, Borel summability and the Bryuno condition for strongly dissipative systems","authors":["Gentile, G","Bartuccelli, Michele","Deane, Jonathan"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-07-01","abstract":"We consider a class of ordinary differential equations describing one-dimensional\\ud\nanalytic systems with a quasiperiodic forcing term and in the presence of damping.\\ud\nIn the limit of large damping, under some generic nondegeneracy condition on the\\ud\nforce, there are quasiperiodic solutions which have the same frequency vector as\\ud\nthe forcing term. We prove that such solutions are Borel summable at the origin\\ud\nwhen the frequency vector is either any one-dimensional number or a twodimensional\\ud\nvector such that the ratio of its components is an irrational number of\\ud\nconstant type. In the first case the proof given simplifies that provided in a previous\\ud\nwork of ours. We also show that in any dimension d, for the existence of a quasiperiodic\\ud\nsolution with the same frequency vector as the forcing term, the standard\\ud\nDiophantine condition can be weakened into the Bryuno condition. In all cases,\\ud\nunder a suitable positivity condition, the quasiperiodic solution is proved to describe\\ud\na local attractor","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:461<\/identifier><datestamp>\n      2017-08-04T12:36:20Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6D617468737075626C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/461\/<\/dc:relation><dc:title>\n        Quasiperiodic attractors, Borel summability and the Bryuno condition for strongly dissipative systems<\/dc:title><dc:creator>\n        Gentile, G<\/dc:creator><dc:creator>\n        Bartuccelli, Michele<\/dc:creator><dc:creator>\n        Deane, Jonathan<\/dc:creator><dc:description>\n        We consider a class of ordinary differential equations describing one-dimensional\\ud\nanalytic systems with a quasiperiodic forcing term and in the presence of damping.\\ud\nIn the limit of large damping, under some generic nondegeneracy condition on the\\ud\nforce, there are quasiperiodic solutions which have the same frequency vector as\\ud\nthe forcing term. We prove that such solutions are Borel summable at the origin\\ud\nwhen the frequency vector is either any one-dimensional number or a twodimensional\\ud\nvector such that the ratio of its components is an irrational number of\\ud\nconstant type. In the first case the proof given simplifies that provided in a previous\\ud\nwork of ours. We also show that in any dimension d, for the existence of a quasiperiodic\\ud\nsolution with the same frequency vector as the forcing term, the standard\\ud\nDiophantine condition can be weakened into the Bryuno condition. In all cases,\\ud\nunder a suitable positivity condition, the quasiperiodic solution is proved to describe\\ud\na local attractor.<\/dc:description><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        2006-07-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/461\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Gentile, G, Bartuccelli, Michele and Deane, Jonathan  (2006) Quasiperiodic attractors, Borel summability and the Bryuno condition for strongly dissipative systems   JOURNAL OF MATHEMATICAL PHYSICS, 47 (7), 072702.       <\/dc:identifier><dc:relation>\n        10.1063\/1.2213790<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/461\/","10.1063\/1.2213790"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Q\nB\nI\ns\nn\nw\nw\nd\na\nw\nt\na\nb\nc\nJOURNAL OF MATHEMATICAL PHYSICS 47, 072702 \u00012006\u0002\n0\nDownloaded 31 uasiperiodic attractors, Borel summability and the\nryuno condition for strongly dissipative systems\nGuido Gentilea\u0001\nDipartimento di Matematica, Università di Roma Tre, Roma, I-00146, Italy\nMichele V. Bartuccellib\u0001 and Jonathan H. B. Deanec\u0001\nDepartment of Mathematics and Statistics, University of Surrey, Guildford, GU2 7XH,\nUnited Kingdom\n\u0001Received 14 March 2006; accepted 23 May 2006; published online 18 July 2006\u0002\nWe consider a class of ordinary differential equations describing one-dimensional\nanalytic systems with a quasiperiodic forcing term and in the presence of damping.\nIn the limit of large damping, under some generic nondegeneracy condition on the\nforce, there are quasiperiodic solutions which have the same frequency vector as\nthe forcing term. We prove that such solutions are Borel summable at the origin\nwhen the frequency vector is either any one-dimensional number or a two-\ndimensional vector such that the ratio of its components is an irrational number of\nconstant type. In the first case the proof given simplifies that provided in a previous\nwork of ours. We also show that in any dimension d, for the existence of a quasi-\nperiodic solution with the same frequency vector as the forcing term, the standard\nDiophantine condition can be weakened into the Bryuno condition. In all cases,\nunder a suitable positivity condition, the quasiperiodic solution is proved to de-\nscribe a local attractor. © 2006 American Institute of Physics.\n\u0003DOI: 10.1063\/1.2213790\u0004\n. INTRODUCTION\nIn this paper we pursue the study started in Refs. 6 and 2. We consider one-dimensional\nystems with a quasiperiodic forcing term in the presence of strong damping, described by ordi-\nary differential equations of the form\n\u0001x¨ + x˙ + \u0001g\u0001x\u0002 = \u0001f\u0001\u0001t\u0002 , \u00011.1\u0002\nhere \u0001\u0001Rd is the frequency vector, g\u0001x\u0002 and f\u0001\u0002\u0002 are functions analytic in their arguments, with\nf quasiperiodic, i.e.,\nf\u0001\u0002\u0002 = \u0005\n\u0003\u0001Zd\nei\u0003·\u0002f\u0003, \u00011.2\u0002\nith average \u0006f\u0007= f0, and \u0001\u00020 is a real parameter, physically representing the inverse of the\namping coefficient. With · we are denoting the scalar product in Rd. A Diophantine condition is\nssumed on \u0001 for d\u00021, that is\n\b\u0001 · \u0003\b\u0003 C0\b\u0003\b−\u0004 \" \u0003\u0001 Zd \\ \t0\n , \u00011.3\u0002\nhere \b\u0003\b= \b\u0003\b1\u000b\b\u00051\b+ ¯ + \b\u0005d\b, and C0 and \u0004 are positive constants. The set of vectors satisfying\nhe condition \u00011.3\u0002 is nonvoid for \u0004\u0003d−1 and is of full measure for \u0004\u0002d−1. For d=1 we denote\n\u0002Electronic mail: gentile@mat.uniroma3.it\n\u0002Electronic mail: m.bartuccelli@surrey.ac.uk\n\u0002Electronic mail: j.deane@surrey.ac.uk\n47, 072702-1022-2488\/2006\/47\u00027\u0001\/072702\/10\/$23.00 © 2006 American Institute of Physics\nMar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jmp.aip.org\/jmp\/copyright.jsp\ntt\nf\nw\nB\na\n\u0001\nf\nr\nc\ns\ns\ns\nh\nb\nt\ns\nI\np\ns\n\u0001\n\u0001\n\u0001\nM\nR\ns\nd\nw\no\ne\nr\nd\n072702-2 Gentile, Bartuccelli, and Deane J. Math. Phys. 47, 072702 \u00022006\u0001\nDownloaded 31 he vectors without boldface; in that case \u0006 will be called the frequency number.\nIn Ref. 6 we show that, under the nondegeneracy condition\n$c0\u0001 R such that g\u0001c0\u0002 = f0 and g\u0001\u0001c0\u0002 \u0003 0, \u00011.4\u0002\nhe system \u00011.1\u0002 admits a quasiperiodic solution x\u0001t ;\u0001\u0002 with the same frequency vector as the\norcing. Such a solution can be obtained by a suitable summation of the formal power series\nx0\u0001t;\u0001\u0002 ª\u0005\nk=0\n\u0007\n\u0001kx\u0001k\u0002\u0001t\u0002, x\u0001k\u0002\u0001t\u0002 = \u0005\n\u0003\u0001Zd\nei\u0003·\u0001tx\u0003\n\u0001k\u0002\n, \u00011.5\u0002\nhich solves the equations of motion order by order. For d=1 \u0001periodic forcing\u0002 the series \u00011.4\u0002 is\norel summable in \u0001. In Ref. 2 we also show that if g\u0001\u0001c0\u0002\u00020, for any d such a solution is locally\nn attractor. In some cases, for instance if g\u0001x\u0002=x2p+1, p\u0001N, and f0\u00020, the attractor is global.\nIn this paper we first give a different \u0001simpler\u0002 proof of Borel summability in the periodic case\nSec. II\u0002, then we prove that the formal series for the solution turns out to be Borel summable also\nor d=2 and \u0004=1 \u0001Sec. III\u0002; this corresponds to frequency vectors with components such that their\natios are irrational numbers of constant type \u0001i.e., numbers with bounded partial quotients in their\nontinued fraction expansion\u0002. The proof does not rely on Nevanlinna-type theorems,7,8 but con-\nists in checking directly that the conditions for the formal series of the solution to be Borel\nummable are satisfied, and follows the same strategy introduced in Ref. 4 to investigate Borel\nummability of lower-dimensional tori.\nFinally in Sec. IV we show how to relax the Diophantine condition. We show that, in order to\nave the same results on existence and attractivity of the quasiperiodic solution, one can take \u0001 to\ne a Bryuno vector, that is one can assume that, by defining\nB\u0001\u0001\u0002 = \u0005\nn=0\n\u0007 1\n2n\nlog\n1\n\bn\u0001\u0001\u0002\n, \bn\u0001\u0001\u0002 = inf\n\b\u0003\b\t2n\n\b\u0001 · \u0003\b , \u00011.6\u0002\nhen \u0001 satisfies the Bryuno condition B\u0001\u0001\u0002\n\u0007. More formal statements will be given in the next\nections.\nI. BOREL SUMMABILITY FOR d=1\nFirst of all let us recall the definition of Borel summability.8 Let f\u0001\u0001\u0002=\u0005n=1\u0007 an\u0001n be a formal\nower series \u0001which means that the sequence \tan\nn=1\n\u0007 is well defined\u0002. We say that f\u0001\u0001\u0002 is Borel\nummable if\n1\u0002 B\u0001p\u0002ª\u0005n=1\u0007 anpn \/n! converges in some circle \bp\b\n\u000b,\n2\u0002 B\u0001p\u0002 has an analytic continuation to a neighborhood of the positive real axis, and\n3\u0002 g\u0001\u0001\u0002=\f0\n\u0007e−p\/\u0001B\u0001p\u0002dp converges for some \u0001\u00020.\nThen the function B\u0001p\u0002 is called the Borel transform of f\u0001\u0001\u0002, and g\u0001\u0001\u0002 is the Borel sum of f\u0001\u0001\u0002.\noreover if the integral defining g\u0001\u0001\u0002 converges for some \u00010\u00020 then it converges in the circle\ne \u0001−1\u0002Re \u00010\n−1\n. A function which admits the formal power series expansion f\u0001\u0001\u0002 is called Borel\nummable if f\u0001\u0001\u0002 is Borel summable; in that case the function equals the Borel sum g\u0001\u0001\u0002.\nTheorem 2.1: Consider the system (1.1) for d=1, and assume that the nondegeneracy con-\nition (1.4) is fulfilled. There exists \u00010\u00020 such that for \b\u0001\b\n\u00010 there is a periodic solution x\u0001t ;\u0001\u0002\nhich has the same frequency number as the forcing term and is Borel summable in \u0001 at the\nrigin. If g\u0001\u0001c0\u0002\u00020 such a solution describes a local attractor.\nProof: We consider explicitly the case g\u0001x\u0002=x2 in \u00011.1\u0002, which corresponds to the varactor\nquation extensively studied in Refs. 6, 1, and 2; the general case can be easily dealt with by\neasoning as in Sec. VII of Ref. 6. In Ref. 6 we proved that the formal power series \u00011.5\u0002 is well\nefined and that to any order k one has\nMar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jmp.aip.org\/jmp\/copyright.jsp\nf\nt\nw\ni\nw\nn\nR\nl\np\np\ne\ne\ne\na\n\u0001\n\f\nl\no\nw\n\u0003\ns\ne\ni\nk\nm\nw\na\n072702-3 Quasiperiodic attractors J. Math. Phys. 47, 072702 \u00022006\u0001\nDownloaded 31 \bx\u0005\n\u0001k\u0002\b\t A1\u00012\n−kk!, \bx\u0001k\u0002\u0001t\u0002\b\t A1\u00012\n−kk!, \u00012.1\u0002\nor suitable constants A1 and \u00012 \u0003cf. formula \u00014.5\u0002 in Ref. 6\u0004. This means that the first condition, in\nhe definition of Borel summability, is satisfied, with \u000b=\u00012.\nIn Ref. 6 we also proved that the formal power series can be summed, and gives a function\nx\u0001t;\u0001\u0002 = \u0005\nk=0\n\u0007\n\u0005\n\u0005\u0001Z\nei\u0006\u0005tx\u0005\n\u0003k\u0004\n, \u00012.2\u0002\nhich is real-analytic and periodic in t, and analytic in \u0001 in a suitable domain tangent to the\nmaginary axis at the origin. The coefficients x\u0005\n\u0003k\u0004\ncan be written as\nx\u0005\n\u0003k\u0004\n= \u0005\n\f\u0001Tk,\u0005\nVal\u0001\f\u0002, Val\u0001\f\u0002 = \r \u000e\n\u0001\u0001L\u0001\f\u0002\ng\u0001\u000f\r \u000e\nv\u0001E\u0001\f\u0002\u0004V\u0001\f\u0002\nFv\u000f , \u00012.3\u0002\nhere the symbols are defined as in Sec. V of Ref. 6. We briefly recall the basic definitions and\notations, with the purpose of making self-consistent the discussion; reference should be made to\nef. 6 for further details.\nA tree \f is a graph, that is a connected set of points and lines, with no cycle, such that all the\nines are oriented toward a unique point \u0001root\u0002 which has only one incident line \u0001root line\u0002. All the\noints in a tree except the root are denoted nodes. The orientation of the lines in a tree induces a\nartial ordering relation \u0001\u0002\u0002 between the nodes. Given two nodes v and w, we shall write w\u0002v\nvery time v is along the path \u0001of lines\u0002 which connects w to the root. We call E\u0001\f\u0002 the set of\nndpoints in \f, that is the nodes which have no entering line. The endpoints can be represented\nither as white bullets or as black bullets; we denote with EW\u0001\f\u0002 and EB\u0001\f\u0002 the set of white bullets\nnd the set of black bullets, respectively. With each endpoint v we associate a mode label \u0005v\nZ, such that \u0005v=0 if v\u0001EW\u0001\f\u0002 and \u0005v\u00030 if v\u0001EB\u0001\f\u0002. We denote with L\u0001\f\u0002 the set of lines in\n. Since \u0001 is uniquely identified with the point v which it leaves, we may write \u0001=\u0001v. With each\nine \u0001 we associate a momentum label \u0005\u0001\u0001Z. The modes of the endpoints and and the momenta\nf the lines are related as follows: if \u0001=\u0001v one has\n\u0005\u0001 = \u0005\ni=1\nsv\n\u0005\u0001i = \u0005\nw\u0001EB\u0001\f\u0002:w\u0002v\n\u0005w, \u00012.4\u0002\nhere sv denotes the number of lines entering v \u0003one has sv=2 if g\u0001x\u0002=x2 in \u00011.1\u0002, otherwise sv\n2\u0004, and \u00011 , . . . ,\u0001sv are the lines entering v. We denote by V\u0001\f\u0002 the set of vertices in \f, that is the\net of points which have at least one entering line. We set V0\u0001\f\u0002= \tv\u0001V\u0001\f\u0002 :\u0005\u0001v=0\n. We call\nquivalent two trees which can be transformed into each other by continuously deforming the lines\nn such a way that they do not cross each other. Let Tk,\u0005 be the set of inequivalent trees of order\nand total momentum \u0005, that is the set of inequivalent trees \f such that \bV\u0001\f\u0002\b+ \bEB\u0001\f\u0002\b=k and the\nomentum of the root line is \u0005. We associate with each line \u0001 a propagator\ng\u0001 = \u00101\/\u0001\u0001i\u0006\u0005\u0001\u0002\u00011 + i\u0001\u0006\u0005\u0001\u0002\u0002 , \u0005\u0001 \u0003 0,1, \u0005\u0001 = 0, \u0011 \u00012.5\u0002\nith each vertex v a node factor\nFv = \u0010− \u0001 , v\u0003 V0\u0001\f\u0002 ,\n− 1\/2c0, v\u0001 V0\u0001\f\u0002 ,\n\u0011 \u00012.6\u0002\nnd with each endpoint v a node factor\nMar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jmp.aip.org\/jmp\/copyright.jsp\nT\nm\na\ni\na\nm\nf\nM\nl\nt\nw\nL\nc\nb\nw\na\np\ni\nc\no\na\nc\n072702-4 Gentile, Bartuccelli, and Deane J. Math. Phys. 47, 072702 \u00022006\u0001\nDownloaded 31 Fv = \u0010c0, v\u0001 EW\u0001\f\u0002 ,\u0001f\u0005v, v\u0001 EB\u0001\f\u0002 . \u0011 \u00012.7\u0002\nhen \u00012.3\u0002 says that each coefficient x\u0005\n\u0003k\u0004 is given by the sum over all trees of order k and total\nomentum \u0005 of the corresponding values.\nIt is more convenient to slightly change the definition of node factors and propagators, by\nssociating the factor \u0001 with the propagator g\u0001 of the line \u0001 coming out from v and not with v\ntself. In this way the propagator of any line with \u0001 momentum \u0005\u0001\u00030 is\ng\u0001 = g\u0001\u0006\u0005\u0001;\u0001\u0002, g\u0001x;\u0001\u0002 =\n\u0001\nix\u00011 + i\u0001x\u0002\n, \u00012.8\u0002\nnd the only dependence on \u0001 in Val\u0001\f\u0002 is through the product of propagators with nonvanishing\nomentum. \u0003Note that g\u0001x ;\u0001\u0002 in \u00012.8\u0002 has a completely different meaning with respect to the\nunction g\u0001x\u0002 appearing in \u00011.1\u0002. The same caveat applies to the propagators g\u0003n\u0004\u0001x ;\u0001\u0002 in Sec. III.\u0004\nThe function \u00012.8\u0002 is Borel summable, and its Borel transform is easily computed to be\ngB\u0001x;p\u0002 =\ne−ipx\nix\nÞ \bgB\u0001x;p\u0002\b\t\ne\bIm p\b\bx\b\n\bx\b\n. \u00012.9\u0002\noreover gB\u0001x ; p\u0002 is an entire function in p, and the integral \f0\u0007e−p\/\u0001gB\u0001x ; p\u0002dp converges \u0001abso-\nutely\u0002 for all \u0001\u00020.\nFor any tree \f\u0001Tk,\u0005 the Borel transform of Val\u0001\f\u0002 is given by a constant times the Borel\nransform of the product of the propagators with nonzero momentum. One has\n\u0001Val\u0001\f\u0002\u0002B\u0001p\u0002 = \r \u000e\n\u0001\u0001L0\u0001\f\u0002\ng\u0001\u000f\r \u000e\nv\u0001E\u0001\f\u0002\u0004V\u0001\f\u0002\nFv\u000f\r\r \u000e\n\u0001\u0001L2\u0001\f\u0002\ng\u0001\u000f\nB\n\u0001p\u0002\u000f , \u00012.10\u0002\nhere we have called L0\u0001\f\u0002 is the set of lines in L\u0001\f\u0002 with zero momentum, and we have set\n2\u0001\f\u0002=L\u0001\f\u0002 \\L0\u0001\f\u0002 \u0001cf. Sec. IV of Ref. 6\u0002. The Borel transform appearing in \u00012.10\u0002 equals the\nonvolution of the Borel transforms of the propagators with nonzero momentum, so that it can be\nounded as\n\u0012\r \u000e\n\u0001\u0001L2\u0001\f\u0002\ng\u0001\u000f\nB\n\u0001p\u0002\u0012 \t \u000e\n\u0001\u0001L2\u0001\f\u0002\n*\bgB\u0001\u0006\u0005\u0001;p\u0002\b\t \r \u000e\n\u0001\u0001L2\u0001\f\u0002\n1\n\b\u0006\u0005\u0001\b\n\u000f \bp\bk−1\u0001k − 1\u0002! exp\u0001\bIm p\b max\u0001\u0001L2\u0001\f\u0002\b\u0006\u0005\u0001\b\u0002 ,\n\u00012.11\u0002\nhere \u000e* denotes the convolution product, and \b\u0006\b\n \b\u0006\u0005\u0001\b\n \b\u0006\b\u0005v\u0001EB\u0001\f\u0002\b\u0005v\b; cf. Remarks \u00014\u0002 to \u00016\u0002\nfter Definition 1 in Ref. 3 for properties of the Borel transforms we are using here.\nTherefore, for p in any strip \r\u000e= \tp\u0001C : \bIm p\b\n\u000e\n of the real axis, we have\n\u0012 \u000e\nv\u0001EB\u0001\f\u0002\nFv\u0012exp\u0001\bIm p\b max\u0001\u0001L2\u0001\f\u0002\b\u0006\u0005\u0001\b\u0002\t F\bEB\u0001\f\u0002\b \u000ev\u0001EB\u0001\f\u0002 e−\u000f\b\u0005v\b\/2, \u00012.12\u0002\nrovided \b\u0006\b\u000e\n\u000f \/2, and summability over the Fourier labels in \u00012.3\u0002 is assured. The sum over k\nn \u00012.2\u0002 produces a quantity bounded proportionally to the exponential e\u0010\bp\b, for some positive\nonstant \u0010. A comparison with Ref. 6 shows that \u0010=1\/\u00010, where \u00010 is the same as in the statement\nf the theorem. In particular the Borel transform xB\u0001t ; p\u0002 of the series \u00012.2\u0002 turns out to have an\nnalytic continuation to the strip \r\u000e, and admits there the bound \bxB\u0001t ; p\u0002\b\tCe\u0010\bp\b, for a suitable\nonstant C. Hence the integral\nMar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jmp.aip.org\/jmp\/copyright.jsp\nax\nf\nN\nC\nw\nI\nc\n\u0002\nv\nd\nf\na\nw\nd\no\no\n\u0001\nn\ns\nW\nl\na\na\nd\nf\nw\nn\n072702-5 Quasiperiodic attractors J. Math. Phys. 47, 072702 \u00022006\u0001\nDownloaded 31 g\u0001t;\u0001\u0002 ª \u0013\n0\n\u0007\ne−p\/\u0001xB\u0001t;p\u0002dp \u00012.13\u0002\nbsolutely converges provided 0\n\u0001\n\u00010. So also the last two conditions for the formal series of\n\u0001t ;\u0001\u0002 to be Borel summable are satisfied.\nThat the solution x\u0001t ;\u0001\u0002 describes a local attractor, under the further condition g\u0001\u0001c0\u0002\u00020,\nollows from the analysis performed in Ref. 2. \u0001\nNote that, because of the analyticity properties of xB\u0001t ; p\u0002, it follows, as a consequence of\nevanlinna’s theorem,8 that the function defined by the integral \u00012.13\u0002 is analytic in the circle\nR= \t\u0001\u0001C :Re \u0001−1\u0002R−1\n, with R=\u00010, and satisfies the bound\ng\u0001t;\u0001\u0002 = \u0005\nk=0\nN−1\n\u0001kx\u0001k\u0002\u0001t\u0002 +RN\u0001\u0001\u0002, \bRN\u0001\u0001\u0002\b\t ABNN!\b\u0001\bN, \u00012.14\u0002\nith constants A and B independent of N. This is consistent with Proposition 5.3 of Ref. 6.\nII. BOREL SUMMABILITY FOR d=2 AND \u0005=1\nIn the case of quasiperiodic forcing terms for d=2 we obtain the following result.\nTheorem 3.1: Consider the system (1.1) for d=2, and assume that \u0001 satisfies the Diophantine\nondition (1.3) with \u0004=1 and that the nondegeneracy condition (1.4) is fulfilled. There exists \u00010\n0 such that for \b\u0001\b\n\u00010 there is a quasiperiodic solution x\u0001t ;\u0001\u0002 which has the same frequency\nector as the forcing term and is Borel summable at the origin. If g\u0001\u0001c0\u0002\u00020 such a solution\nescribes a local attractor.\nProof: Again we discuss explicitly the case g\u0001x\u0002=x2 in \u00011.1\u0002. Let \u0011 be a nondecreasing C\u0007\nunction defined in R+, such that\n\u0011\u0001u\u0002 = \u00101 for u\u0003 1,0 for u\t 1\/2,\u0011 \u00013.1\u0002\nnd set \u0012\u0001u\u0002ª1−\u0011\u0001u\u0002. Define, for all n\u0001Z+, \u0012n\u0001u\u0002ª\u0012\u00012nC0−1u \/4\u0002 and \u0011n\u0001u\u0002ª\u0011\u00012nC0−1u \/4\u0002.\nWith each line \u0001 with zero momentum we associate a scale label n\u0001=−1, while with each line\nith nonzero momentum we associate \u0001arbitrarily\u0002 a scale label n\u0001\u0001Z+= \t0\n\u0004N. Then we can\nefine cluster and self-energy clusters as in Refs. 4 and 6. A cluster T on scale n is a maximal set\nf points and lines connecting them such that all the lines have scales n\u0001\tn and there is at least\nne line with scale n. The lines entering the cluster T and the possible line coming out from it\nunique if existing at all\u0002 are called the external lines of the cluster T. Given a cluster T on scale\n, we shall denote by nT=n the scale of the cluster; we call V\u0001T\u0002, E\u0001T\u0002, EW\u0001T\u0002, EB\u0001T\u0002, and L\u0001T\u0002 the\net of vertices, of endpoints, of white endpoints, of black endpoints, and of lines of T, respectively.\ne call self-energy cluster any cluster T such that T has only one entering line \u0001T\n2 and one exiting\nine \u0001T\n1\n, and one has \u0005v\u0001EB\u0001T\u0002\u0003v=0. With each line \u0001 with momentum \u0003\u0001 and scale n\u0001 we associate\nrenormalized propagator g\u0001=g\u0003n\u0001\u0004\u0001\u0001 ·\u0003\u0001 ;\u0001\u0002, still to be defined. On the contrary the node factors\nre defined as in the previous case \u0001with the only trivial difference that now \u0003v, replacing \u0005v, is a\n-dimensional vector\u0002.\nDefine the self-energy value VT\u0001\u0001 ·\u0003 ;\u0001\u0002 in terms of the renormalized propagators and node\nactors as\nVT\u0001\u0001 · \u0003;\u0001\u0002 = \r \u000e\n\u0001\u0001L\u0001T\u0002\ng\u0003n\u0001\u0004\u0001\u0001 · \u0003\u0001;\u0001\u0002\u000f\r \u000e\nv\u0001E\u0001T\u0002\u0004V\u0001T\u0002\nFv\u000f , \u00013.2\u0002\nhere \u0003 is the momentum of both the external lines of T.\nWe proceed as in Sec. VI of Ref. 6, with the only two differences that we perform a prelimi-\nary summation by including the contribution −2\u0001c0 \u0001arising from the self-energy graphs on scale\nMar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jmp.aip.org\/jmp\/copyright.jsp\n−\u0001\nS\nw\nt\nw\nT\nf\n\u0001\nw\nI\na\nw\nf\ns\nt\n072702-6 Gentile, Bartuccelli, and Deane J. Math. Phys. 47, 072702 \u00022006\u0001\nDownloaded 31 1\u0002 into the propagator g\u00030\u0004\u0001x ;\u0001\u0002, and—as in the periodic case of Sec. II—we associate the factors\nto the propagators with nonzero momentum. Therefore we define \u0003see the comment after \u00012.8\u0002 in\nec. II\u0004\ng\u00030\u0004\u0001x;\u0001\u0002 =\n\u0001\u00110\u0001\bx\b\u0002\nix\u00011 + i\u0001x\u0002 − 2\u0001c0\n, M\u00030\u0004\u0001x;\u0001\u0002 = \u0001\u0005\nk=1\n\u0007\n\u0005\nT\u0001Sk,0\nR\nVT\u0001x;\u0001\u0002 , \u00013.3\u0002\nhereas the propagators on scale n\u00031 are defined as in Ref. 6, again with a factor \u0001 appearing in\nhe numerator of the propagators with nonzero momentum; this means that one has\ng\u0003n\u0004\u0001x;\u0001\u0002 =\n\u0001\u00120\u0001\bx\b\u0002 ¯ \u0012n−1\u0001\bx\b\u0002\u0011n\u0001\bx\b\u0002\nix\u00011 + i\u0001x\u0002 − M\u0003n−1\u0004\u0001x;\u0001\u0002 ,\n\u00013.4\u0002\nM\u0003n\u0004\u0001x;\u0001\u0002 = \u0005\np=1\nn\n\u00120\u0001\bx\b\u0002 ¯ \u0012p−1\u0001\bx\b\u0002\u0012n\u0001\bx\b\u0002M\u0003p\u0004\u0001x;\u0001\u0002, M\u0003n\u0004\u0001x;\u0001\u0002 = \u0001\u0005\nk=1\n\u0007\n\u0005\nT\u0001Sk,n\nR\nVT\u0001x;\u0001\u0002 ,\nhere the set of renormalized self-energy clusters Sk,nR is defined and the set of self-energy clusters\non scale nT=n and of order k \u0003that is with \bV\u0001T\u0002\b+ \bEB\u0001T\u0002\b=k\u0004. With respect to Refs. 6 and 4 a\nurther factor \u0001 appears in M\u0003n\u0004\u0001x ;\u0001\u0002, n\u00030, simply because there is one such factor per node\nvertex or endpoint\u0002 with exiting line carrying a nonzero momentum—cf. Sec. 6 in Ref. 4—and\ne are associating the factors \u0001 with the lines instead of the nodes.\nAn easy computation gives, for the Borel transform of g\u00030\u0004\u0001x ;\u0001\u0002,\ngB\n\u00030\u0004\u0001x;p\u0002 =\n\u00110\u0001\bx\b\u0002\nix\nexp\r− ip\rx − 2c0\nx\n\u000f\u000fÞ \bgB\u00030\u0004\u0001x;p\u0002\b\t 1\bx\be\u0001\bx\b+2\bc0\b\/\bx\b\u0002\bIm p\b. \u00013.5\u0002\nf we set, for n\u00030,\ng˜\u0003n\u0004\u0001x;\u0001\u0002 =\n\u0001\nix\u00011 + i\u0001x\u0002 − M\u0003n−1\u0004\u0001x;\u0001\u0002 \" \bx\b\t 2\n−\u0001n−1\u0002C0, \u00013.6\u0002\nnd define M\u0003n\u0004\u0001x ;\u0001\u0002=M\u0003n\u0004\u0001x ;\u0001\u0002−M\u0003n−1\u0004\u0001x ;\u0001\u0002, we obtain the recursive equations\n\u0001g˜\u0003n\u0004\u0001x;\u0001\u0002\u0002−1 = \u0001g˜\u0003n−1\u0004\u0001x;\u0001\u0002\u0002−1 − \u00120\u0001\bx\b\u0002 ¯ \u0012n−1\u0001\bx\b\u0002\u0001−1M\u0003n−1\u0004\u0001x;\u0001\u0002, n\u0003 1. \u00013.7\u0002\nBy using these equations we can prove inductively the bound\n\bg˜B\n\u0003n\u0004\u0001x;p\u0002\b\t\nK0\n\bx\b\ne\u0001cn+cn\u0001\bx\b\n−1\/2\u0002\bp\b+\u00130\bIm p\b\u0001dn\bx\b+dn\u0001\bx\b\n−1\u0002\n, \u00013.8\u0002\nhere K0 and \u00130 are two constants, and the sequences \tcn\nn=0\n\u0007\n, \tcn\u0001\nn=0\n\u0007\n, \tdn\nn=0\n\u0007\n, \tdn\u0001\nn=0\n\u0007 are to be\nound.\nThe proof proceeds as in Appendix A1 of Ref. 3. Set x\u0001=\u0001 ·\u0003\u0001, and call L0\u0001T\u0002 and L2\u0001T\u0002 the\net of lines in L\u0001T\u0002 with zero momentum and the set L2\u0001T\u0002=L\u0001T\u0002 \\L0\u0001T\u0002, respectively. First we use\nhe inductive bound to obtain\nMar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jmp.aip.org\/jmp\/copyright.jsp\nwl\nn\nd\n\u0013\nw\no\na\ns\nw\nw\n+\nt\nt\nA\nf\ni\ni\n072702-7 Quasiperiodic attractors J. Math. Phys. 47, 072702 \u00022006\u0001\nDownloaded 31 \u0012\rM\u0003N\u0004\u0001x;\u0001\u0002\n\u0001\n\u000f\nB\n\u0012 \t\u0005\nk=2\n\u0007\n\u0005\nT\u0001Sk,N−1\nR \r \u000e\u0001\u0001L0\u0001T\u0002 \bg\u0001\b\u000f\r \u000ev\u0001E\u0001T\u0002\u0004V\u0001T\u0002 \bFv\b\u000f\n\u0014 \r \u000e\n\u0001\u0001L2\u0001T\u0002\n*\nK0\n\bx\u0001\b\ne\u0001cn\u0001+cn\u0001\u0001\n\bx\u0001\b\n−1\/2\u0002\bp\b+\u00130\u0001dn\u0001\bx\u0001\b+dn\u0001\u0001 \bx\u0001\b\n−1\u0002\bIm p\b\u000f\n\t \r \u000e\nv\u0001EB\u0001\f\u0002\ne−\u000f\b\u0005v\b\u000f\u0005\nk=2\n\u0007\n\u0010k\n\bp\bk−2\n\u0001k − 2\u0002!\ne\u0001cN−1+cN−1\u0001 2\nN\/2\u0002\bp\b+\u00130dN−1\u0001 2\nN\bIm p\b\n, \u00013.9\u0002\nhere D0=\u00102, rN=\u0010+cN−1+\u00100cN−1\u0001 2N\/2, for some N-independent constant \u00100. The bound in the\nast line of \u00013.9\u0002 has been obtained by using part of the exponential decay \u0001say one-fourth\u0002 of the\node factors associated with the endpoints to control the exponent \u00130dN−1 max\u0001\u0001L2\u0001T\u0002\bx\u0001\b, provided\nN−1\nd for some N-independent constant d and \bIm p\b\t\u000e, with \u000e small enough, more precisely\n0\u000ed\b\u0006\b\n\u000f \/4.\nBy explicitly performing the sum over k we obtain from \u00013.6\u0002,\n\u0012\rM\u0003N\u0004\u0001x;\u0001\u0002\n\u0001\n\u000f\nB\n\u0012 \t D0erN\bp\be−\u000f02N, \u00013.10\u0002\nhere we have used the bound \u0005\u0005\u0001EB\u0001T\u0002\b\u0003v\b\u0003\u001012\nN\n, for a suitable constant \u00101—see formula \u00017.12\u0002\nf Ref. 4—and again part of the exponential decay \u0001say another one-fourth\u0002 of the node factors\nssociated with the endpoints to control the exponent \u00130dN−1\u0001 2N\bIm p\b, provided again dN−1\u0001 \nd\u0001 for\nome N-independent constant d\u0001 and \u00130d\u0001\u000e\n\u000f\u00101 \/4; in particular one finds \u000f0=\u00101\u000f \/4.\nThen, by using \u00013.10\u0002 and, once more, the inductive bound, we obtain from \u00013.7\u0002,\n\bg˜B\n\u0003N\u0004\u0001x,p\u0002\b\t\nK0\n\bx\b\ne\u0001cN−1+cN−1\u0001 \bx\b\n−1\/2\u0002\bp\b+\u00130\u0001dN−1\bx\b+dN−1\u0001 \bx\b\n−1\u0002\bIm p\b * \u0005\nk=0\n\u0007 \r\u0001D0e−rN\bp\be−\u000f02N\u0002\n* \rK0\bx\b e\u0001cN−1+cN−1\u0001 \bx\b−1\/2\u0002\bp\b+\u00130\u0001dN−1\bx\b+dN−1\u0001 \bx\b−1\u0002\bIm p\b\u000f\u000f\n*k\n, \u00013.11\u0002\nith a*k=a\u0002a\u0002¯ \u0002a \u0001k times\u0002. This gives\n\bg˜B\n\u0003N\u0004\u0001x,p\u0002\b\t\nK0\n\bx\b\u0005k=0\n\u0007 1\n\u00012k\u0002!\rK0\bp\b\n2\n\bx\b\nD0e−\u000f02\nN\u000fKe\u0001rN+cN−1\u0001 \bx\b−1\/2\u0002\bp\b+\u00130\u0001dN\bx\b+dN\u0001 \bx\b−1\u0002\bIm p\b, \u00013.12\u0002\nhich implies the bound \u00013.5\u0002 for n=N, with cN=rN=\u0010+cN−1+\u00100cN−1\u0001 2N\/2, cN\u0001 =cN−1\u0001\u0014K0D0e−\u000f02N, dN=dN−1 and dN\u0001 =dN−1\u0001 . In particular one has dN=d=1 and dN\u0001=d\u0001=2\bc0\b, so that\nhere exists a constant c\u00020 such that max\tcn2−n\/2 ,cn\u0001 ,dn ,dn\u0001\n\tc for all n\u00030.\nThe bounds \u00013.8\u0002 for the Borel transforms of the propagators can be used to obtain a bound on\nhe Borel transform xB\u0001t ; p\u0002 of x\u0001t ;\u0001\u0002. We omit the details, which can be derived exactly as in\nppendix A1 of Ref. 3. Eventually one finds the bound\n\bxB\u0001t;p\u0002\b\t C1eC2\bp\b\n2\n, \u00013.13\u0002\nor suitable constants C1 and C2. Again, the bound \u00013.13\u0002 and the analyticity properties of xB\u0001t ; p\u0002\nmplies that x\u0001t ;\u0001\u0002 is Borel summable, and it can be written for \u0001\u00020 as\nx\u0001t;\u0001\u0002 = \u0013\n0\n\u0007\ne−p\/\u0001xB\u0001t;p\u0002dp , \u00013.14\u0002\nn terms of its Borel transform.\nAs in the case d=1 the last statement of the theorem has been proved in Ref. 2. \u0001\nMar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jmp.aip.org\/jmp\/copyright.jsp\ngt\nt\nN\nI\nc\ns\ng\ng\nF\nd\na\nt\ni\nw\ns\nI\n\u0001\ns\ni\nf\na\nc\nf\nf\nb\n072702-8 Gentile, Bartuccelli, and Deane J. Math. Phys. 47, 072702 \u00022006\u0001\nDownloaded 31 In the general case g\u0001x\u0002\u0003x2 in \u00011.1\u0002 the quantity 2c0 must be replaced with g\u0001\u0001c0\u0002, with\n\u0001\u0001c0\u0002\u00030 by hypothesis. Then the discussion proceeds as in Sec. VII of Ref. 6.\nNote also that in the case d=2 and \u0004=1 the Borel transform is still defined in a strip around\nhe real axis, but it does not satisfy any more an exponential bound like in the case d=1 \u0001at least\nhe argument given above does not provide an estimate of this kind\u0002. Thus, we cannot apply\nevanlinna’s theorem to prove Borel summability.7,8\nV. BRYUNO FREQUENCY VECTORS\nLet \u0001\u0001Rd be a Bryuno vector. This means that B\u0001\u0001\u0002\n\u0007, with B\u0001\u0001\u0002 defined in \u00011.6\u0002.\nTheorem 4.1: Consider the system (1.1) for any d\u00032, and assume that \u0001 satisfies the Bryuno\nondition B\u0001\u0006\u0002\n\u0007 and that the nondegeneracy condition (1.4) is fulfilled. There exists \u00010\u00020\nuch that for all real \b\u0001\b\n\u00010 there is a quasiperiodic solution with frequency vector \u0001. If\n\u0001\u0001c0\u0002\u00020 such a solution describes a local attractor.\nFor simplicity’s sake we discuss the case g\u0001x\u0002=x2 and \u0001\u0001R, but the analysis can be easily\neneralized to any analytic function g \u0003provided the nondegeneracy condition \u00011.4\u0002 is satisfied\u0004.\nurthermore the solution can be showed to extend to a function analytic in \u0001 in the domain CR\nefined in Sec. VI of Ref. 6 \u0001cf. Fig. 16 in Ref. 6\u0002.\nLet \u0011\u0001x\u0002 be the nondecreasing C\u0007 function defined in \u00013.1\u0002 and set \u0012\u0001x\u0002ª1−\u0011\u0001x\u0002. Define, for\nll n\u0001Z+, \u0012n\u0001x\u0002ª\u0012\u0001\bn−1\u0001\u0001\u0002x \/4\u0002 and \u0011n\u0001x\u0002ª\u0011\u0001\bn−1\u0001\u0001\u0002x \/4\u0002.\nSet g\u0003−1\u0004\u0001x ;\u0001\u0002=1 and M\u0003−1\u0004\u0001x ;\u0001\u0002=0, and define iteratively g\u0003n\u0004\u0001x ;\u0001\u0002 and M\u0003n\u0004\u0001x ;\u0001\u0002 as done in\nhe case of Diophantine vectors. This means that for n=0 we can define g\u00030\u0004\u0001x ;\u0001\u0002 and M\u00030\u0004\u0001x ;\u0001\u0002 as\nn \u00013.3\u0002, while for n\u00031 we define\ng\u0003n\u0004\u0001x;\u0001\u0002 =\n\u0001\u00120\u0001\bx\b\u0002 ¯ \u0012n−1\u0001\bx\b\u0002\u0011n\u0001\bx\b\u0002\nix\u00011 + i\u0001x\u0002 − M\u0003n−1\u0004\u0001x;\u0001\u0002 ,\n\u00014.1\u0002\nM\u0003n\u0004\u0001x;\u0001\u0002 = \u0005\np=0\nn\n\u00120\u0001\bx\b\u0002 ¯ \u0012p\u0001\bx\b\u0002M\u0003p\u0004\u0001x;\u0001\u0002, M\u0003n\u0004\u0001x;\u0001\u0002 = \u0001\u0005\nk=1\n\u0007\n\u0005\nT\u0001Sk,n\nR\nVT\u0001x;\u0001\u0002 ,\nhere Sk,nR is the set of renormalized self-energy clusters T on scale n and of order k, and the\nelf-energy value VT\u0001x ;\u0001\u0002 is defined as in \u00013.2\u0002. Note that we are using the same definitions of Sec.\nII, in particular we are associating the factors \u0001 with the propagators rather than with the nodes\ncontrary to what done in Ref. 6\u0002. So far the only difference with respect to the case of the\ntandard Diophantine condition concerns the multiscale decomposition: the factors 2nC0\n−1 appear-\nng in \u0012n and \u0011n are substituted with \bn\n−1\u0001\u0006\u0002.\nLemma 4.2: Assume that the renormalized propagators up to scale n−1 can be bounded as\n\bg\u0003n\u0001\u0004\u0001\u0001 · \u0003\u0001;\u0001\u0002\b\t C−1\bn\u0001\n−\u0015\u0001\u0001\u0002 \u00014.2\u0002\nor some positive constants \u0015 and C. Then for all p\tn−1 the number Np\u0001\f\u0002 of lines on scale p in\nny renormalized tree \f and the number Np\u0001T\u0002 of lines on scale p in any renormalised self-energy\nluster T are bounded both by\nNp\u0001\f\u0002\t K2−p \u0005\nv\u0001EB\u0001\f\u0002\n\b\u0003v\b, Np\u0001T\u0002\t K2−p \u0005\nv\u0001EB\u0001T\u0002\n\b\u0003v\b , \u00014.3\u0002\nor some positive constant K. If \b\u0001\b\n\u00010, with \u00010 small enough, then for all p\tn−1 one has\n\bM\u0003p\u0004\u0001x;\u0001\u0002\b\t D1\b\u0001\b2e−D22\np\n, \b\u0004xM\u0003p\u0004\u0001x;\u0001\u0002\b\t D1\b\u0001\b2e−D22\np\n, \u00014.4\u0002\nor some positive constants D1 and D2. Only the constant D1 depends on \u0015. The constant \u00010 can\n\u0015e written as \u00010=C1\bn0, with n0\u0001\u0001 ,\u0015\u0002 such that\nMar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jmp.aip.org\/jmp\/copyright.jsp\nap\no\nn\ni\n−\nh\nA\nr\n\b\n−\ne\nt\nc\nC\ns\ne\nt\nc\no\nw\nw\np\nd\nD\na\nr\nw\n072702-9 Quasiperiodic attractors J. Math. Phys. 47, 072702 \u00022006\u0001\nDownloaded 31 K\u0015 \u0005\nn=n0+1\n\u0007 1\n2n\nlog\n1\n\bn\u0001\u0001\u0002\n\t\n\u000f\n4\n, \u00014.5\u0002\nnd C1 a positive constant dependending on C but not on \u0015.\nProof: The lemma can be proved by reasoning as in Refs. 4 and 5. We simply sketch the\nroof, and omit the details. First of all note that, if we define n\u0001\u0003\u0002= \tn\u0001Z+ :2n−1\n \b\u0003\b\t2n\n then\nne has \b\u0001 ·\u0003\b\u0003\bn\u0001\u0003\u0002\u0001\u0001\u0002. Moreover n\u0001\u0002n implies \bn\u0001\u0001\u0001\u0002\t\bn\u0001\u0001\u0002, and \bn\u0001\u0001\u0001\u0002\n\bn\u0001\u0001\u0002 implies\n\u0001\u0002n. Set M\u0001\f\u0002=\u0005v\u0001EB\u0001\f\u0002\b\u0003v\b and M\u0001T\u0002=\u0005v\u0001EB\u0001T\u0002\b\u0003v\b. The bound on Np\u0001\f\u0002 is obtained by prov-\nng by induction on the order of the renormalized tree that if Np\u0001\f\u0002\u00030 then Np\u0001\f\u0002\t22−pM\u0001\f\u0002\n1 Then, given a renormalized self-energy cluster T\u0001Sk,nR , one proves first that M\u0001T\u0002\u00022n−1,\nence, again by induction, that if Np\u0001T\u0002\u00030 then Np\u0001T\u0002\t22−pM\u0001T\u0002−1. Therefore \u00014.3\u0002 is proved.\nn important property is that if a cluster T has two external lines, with momenta \u0003 and \u0003\u0001,\nespectively, with \u0003\u0003\u0003\u0001, both on scales greater or equal to n, so that \b\u0001 ·\u0003\b\t\bn−1\u0001\u0001\u0002 \/4 and\n\u0001 ·\u0003\b\t\bn−1\u0001\u0001\u0002 \/4, then one has \b\u0001 · \u0001\u0003−\u0003\u0001\u0002\b\n\bn−1\u0001\u0001\u0002, hence n\u0001\u0003−\u0003\u0001\u0002\u0003n, so that M\u0001T\u0002\u0003 \b\u0003\n\u0003\u0001\b\u00022n−1. For details we refer to Ref. 5.\nThe bounds \u00014.4\u0002 are obtained by exploiting the just mentioned bound on M\u0001T\u0002 and half the\nxponential decay factors e−\u000f\b\u0003v\b associated with the vertices and endpoints internal to T to derive\nhe factors e−D22\np\n, with D2 independent of \u0015, and by using the fact that any self-energy cluster T\nontributing to M\u0003p\u0004\u0001x ;\u0001\u0002 must be of order at least 2 to derive the factors \b\u0001\b2.\nThen for any n0\u0001N and for any tree \f, we can bound each propagator on scale up to n0 with\n−1\bn0\n−\u0015\u0001\u0001\u0002 and the product of propagators on scale greater than n0 with\n\u000e\nn=n0+1\n\u0001C−1\bn\n−\u0015\u0001\u0001\u0002\u0002Nn\u0001\f\u0002 = C−\u0005n=n0+1\n\u0007 Nn\u0001\f\u0002 exp\r\u0015M\u0001\f\u0002 \u0005\nn=n0+1\n\u0007 1\n2n\nlog\n1\n\bn\u0001\u0001\u0002\n\u000f , \u00014.6\u0002\no that, by choosing n0 according to \u00014.5\u0002, the last exponential in \u00014.6\u0002 is controlled by half the\nxponential decay factor e−\u000fM\u0001T\u0002 arising from the node factors. Then the sum of the values of all\nrees of order k is bounded by \u0001C−1C\u0001\bn0\n−\u0015\u0002k, for a suitable constant C\u0001—taking into account all the\nonstants other than C and the sums over the trees. Hence also the assertion about the dependence\nf \u00010 on \bn0\u0001\u0001\u0002 follows, and the proof of the lemma is complete. \u0001\nAs in Ref. 6, to prove existence of the quasiperiodic solution we need the following result,\nhich together with Lemma 4.2 provides the proof of Theorem 4.1.\nLemma 4.3: For real \u0001 small enough the renormalized propagators satisfy the bounds (4.2)\nith \u0015=1. For \u0001 in the domain CR in Fig. 16 of Ref. 6 they satisfy the bounds (4.2) with \u0015=2.\nProof: The proof can be carried out exactly as in Ref. 6. Indeed it is enough to show that the\nropagators g\u0003n\u0004\u0001x ;\u0001\u0002 can be bounded proportionally to \bx\b−\u0015, for \u0001 small enough in a suitable\nomain, and this follows from Lemmata 6.2 to 6.5 of Ref. 6, independently on the particular\niophantine condition assumed on \u0001. \u0001\nThe proof of the theorem is completed if we show that the quasiperiodic solution is a local\nttractor if g\u0001\u0001c0\u0002\u00020. But this can be proved as in the case of Diophantine frequency vectors, by\neasoning as in Ref. 2: indeed the only property that we need for the argument given in Ref. 2 to\nork is the existence of the quasiperiodic solution.\n1 Bartuccelli, M. V., Deane, J. H. B., Gentile, G., and Marsh, L., “Invariant sets for the varactor equation,” Proc. R. Soc.\nLondon, Ser. A 462, 439–457 \u00012006\u0002.\n2 Bartuccelli, M. V., Deane, J. H. B., and Gentile, G., Globally and locally attractive solutions for quasiperiodically forced\nsystems, J. Math. Anal. Appl. \u0001in press\u0002.\n3 Costin, O., Gallavotti, G., Gentile, G., and Giuliani, A., Borel summability and Lindstedt series, Commun. Math. Phys.\n\u0001in press\u0002.\n4 Gentile, G., “Quasi-periodic solutions for two-level systems,” Commun. Math. Phys. 242, 221–250 \u00012003\u0002.\n5 Gentile, G., Resummation of perturbation series and reducibility for Bryuno skew-product flows, J. Stat. Phys. \u0001in press\u0002.\nMar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jmp.aip.org\/jmp\/copyright.jsp\n072702-10 Gentile, Bartuccelli, and Deane J. Math. Phys. 47, 072702 \u00022006\u0001\nDownloaded 31 6 Gentile, G., Bartuccelli, M. V., and Deane, J. H. B., “Summation of divergent series and Borel summability for strongly\ndissipative differential equations with periodic or quasiperiodic forcing terms,” J. Math. Phys. 46, 062704 \u00012005\u0002.\n7 Nevanlinna, F., “Zur Theorie der Asymptotischen Potenzrehen,” Ann. Acad. Sci. Fenn., Ser. A 12, 1–18 \u00011916\u0002.\n8 Sokal, A. D., “An improvement of Watson’s theorem on Borel summability,” J. Math. Phys. 21, 261–263 \u00011980\u0002.Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/jmp.aip.org\/jmp\/copyright.jsp\n"}