{"doi":"10.1080\/0968776970050303","coreId":"6725","oai":"oai:generic.eprints.org:248\/core5","identifiers":["oai:generic.eprints.org:248\/core5","10.1080\/0968776970050303"],"title":"Computer‐based interactive tutorial versus traditional lecture for teaching introductory aspects of pain","authors":["Johnson, Mark","Dewhurst, David","Williams, Alan"],"enrichments":{"references":[{"id":1885124,"title":"29Mark I.Johnson et ol Computer-based interactive tutorial versus traditional lecture","authors":[],"date":"1996","doi":null,"raw":"29Mark I.Johnson et ol Computer-based interactive tutorial versus traditional lecture Johnson, M.I. and Dewhurst, D.G. (1996), 'Clinical aspects of pain: a computer-based learning program to introduce the subject to undergraduate students', Journal of the Pain Society., 12, 71.","cites":null},{"id":192883,"title":"A comparison of CAI and tutorials in hematology and oncology',","authors":[],"date":"1987","doi":"10.1097\/00001888-198711000-00007","raw":"Garrett, T.J., Ashford, A.R. and Savage, D.G. (1987) 'A comparison of CAI and tutorials in hematology and oncology', Journal of Medical Education, 62, 918-22.","cites":null},{"id":192879,"title":"A computer simulation for learning about the physiological response to exercise',","authors":[],"date":"1994","doi":null,"raw":"Coleman, I.P., Dewhurst, D.G., Meehan, A.S. and Williams, A.D. (1994), 'A computer simulation for learning about the physiological response to exercise', American Journal of Physiology, 266 (11), S2-S9.","cites":null},{"id":1041878,"title":"A study of retention of knowledge of neurosciences information',","authors":[],"date":"1973","doi":"10.1097\/00001888-197309000-00012","raw":"Levine, H.G. and Forman, P.M. (1973), 'A study of retention of knowledge of neurosciences information', Journal of Medical Education, 48, 867-9.","cites":null},{"id":1041880,"title":"A technique for the measurement of attitudes',","authors":[],"date":"1932","doi":"10.1080\/00224545.1965.9922270","raw":"Likert, R.A. (1932), 'A technique for the measurement of attitudes', Archives of Psychology, 140.","cites":null},{"id":442668,"title":"An outline curriculum for medical schools',","authors":[],"date":"1988","doi":"10.1016\/0304-3959(88)90196-0","raw":"Pilowsky, I. (1988), 'An outline curriculum for medical schools', Pain, 33, 1-2.","cites":null},{"id":1041873,"title":"CAL in human anatomy',","authors":[],"date":"1996","doi":"10.1111\/j.1365-2729.1996.tb00052.x","raw":"Gunn, C. and Maxwell, L. (1996), 'CAL in human anatomy', Journal of Computer Assisted Learning, 12 (4), 205-15.","cites":null},{"id":192880,"title":"Comparison of a computer simulation program and a traditional laboratory practical class for teaching the principles of intestinal absorption',","authors":[],"date":"1994","doi":null,"raw":"Dewhurst, D.G., Hardcastle, J., Hardcastle, P.T. and Stuart, E. (1994), 'Comparison of a computer simulation program and a traditional laboratory practical class for teaching the principles of intestinal absorption', American Journal of Physiology, 267 (12), S95-S104.","cites":null},{"id":192884,"title":"Computer-assisted instruction in AIDS infection control for physicians', Teaching and Learning in Medicine,","authors":[],"date":"1990","doi":"10.1080\/10401339009539463","raw":"Garrett, T.J., Selnow, G., Dobkin, J.F. and Healton, C. (1990) 'Computer-assisted instruction in AIDS infection control for physicians', Teaching and Learning in Medicine, 2,215-18.","cites":null},{"id":442671,"title":"Computer-assisted instructions: a role in teaching human gross anatomy',","authors":[],"date":"1990","doi":"10.1111\/j.1365-2923.1990.tb02665.x","raw":"Walsh, R. and Bohn, R. (1990), 'Computer-assisted instructions: a role in teaching human gross anatomy', Medical Education, 24, 499-506.","cites":null},{"id":1041874,"title":"Computer-assisted learning (CAL) programs in drug disposition: replacement of lectures',","authors":[],"date":"1991","doi":null,"raw":"Hollingsworth, M. and Foster, R.W. (1991), 'Computer-assisted learning (CAL) programs in drug disposition: replacement of lectures', British Journal of Pharmacology Proc. Suppl., 102, 216P.","cites":null},{"id":192882,"title":"Computer-assisted learning compared with weekly seminars for teaching fundamental electrocardiography to junior medical students',","authors":[],"date":"1988","doi":"10.1097\/00007611-198810000-00020","raw":"Fincher, R.M.E., Abdulla, A.M., Sridharan, M.R., Houghton, J.L. and Henke, J.S. (1988), 'Computer-assisted learning compared with weekly seminars for teaching fundamental electrocardiography to junior medical students', Southern Medical Journal, 81, 1291-4.","cites":null},{"id":192877,"title":"Confounding in educational computing research',","authors":[],"date":"1985","doi":"10.2190\/hc3l-g6yd-bak9-eqb5","raw":"Clark, R.E. (1985a) 'Confounding in educational computing research', Journal of Educational Computing Research, 1 (2), 137-148.","cites":null},{"id":192881,"title":"Core curriculum for professional education' in Fields,","authors":[],"date":"1992","doi":"10.1212\/wnl.42.1.268-b","raw":"Fields, H.L. (1992), 'Core curriculum for professional education' in Fields, H.L. (ed), Pain (2nd edition), Seattle WA: International Association for the Study of Pain Publications.","cites":null},{"id":1041877,"title":"Empirical evidence shows that measuring users' opinions is not a satisfactory way of evaluating computer-assisted learning in nurse education',","authors":[],"date":"1992","doi":"10.1016\/0020-7489(92)90018-c","raw":"Jones, B.T. and McCormac, K. (1992), 'Empirical evidence shows that measuring users' opinions is not a satisfactory way of evaluating computer-assisted learning in nurse education', International Journal of Nursing Studies, 29, 411-25.","cites":null},{"id":442669,"title":"Evaluation of a computer-based program for teaching cardiac anatomy',","authors":[],"date":"1994","doi":"10.1097\/00004424-199402000-00022","raw":"Stanford, W. et al (1994), 'Evaluation of a computer-based program for teaching cardiac anatomy', Investigative Radiology, 29, 248-52.","cites":null},{"id":1041875,"title":"Evaluation of computer-based cancer education modules at the Arkansas Cancer Research Center',","authors":[],"date":"1995","doi":null,"raw":"Hutchins, L. et al (1995), 'Evaluation of computer-based cancer education modules at the Arkansas Cancer Research Center', Journal of Medical Education Technologies, 6 (1), 4-9.","cites":null},{"id":192878,"title":"Evidence for confounding in computer-based instruction studies: analysing the meta-analyses',","authors":[],"date":"1985","doi":null,"raw":"Clark, R.E. (1985b) 'Evidence for confounding in computer-based instruction studies: analysing the meta-analyses', Educational Communication and Technology Journal, 33 (4), 249-62.","cites":null},{"id":442667,"title":"Interactive video instruction increases efficiency in cognitive learning in a Baccalaureate nursing education program',","authors":[],"date":"1994","doi":null,"raw":"Napholz, L. and McCanse, R. (1994), 'Interactive video instruction increases efficiency in cognitive learning in a Baccalaureate nursing education program', Computers in Nursing, 12 (3), 149-53.","cites":null},{"id":1041881,"title":"Intractable pain: a neglected area of medical education in the UK',","authors":[],"date":"1988","doi":null,"raw":"Marcer, D. and Deighton, S. (1988), 'Intractable pain: a neglected area of medical education in the UK', Journal of the Royal Society of Medicine, 81, 698-700.","cites":null},{"id":1041876,"title":"Mark I.Johnson et ol Computer-based interactive tutorial versus traditional lecture","authors":[],"date":"1996","doi":"10.1080\/0968776970050303","raw":null,"cites":null},{"id":442672,"title":"Medical students' attitudes toward pain before and after a brief course on pain',","authors":[],"date":"1992","doi":"10.1016\/0304-3959(92)90028-a","raw":"Wilson, J.F., Brockopp, G.W., Kryst, S., Steger, H. and Witt, W.O. (1992), 'Medical students' attitudes toward pain before and after a brief course on pain', Pain, 50, 251-6. 30ALT-] Volume 5 Number 3","cites":null},{"id":192885,"title":"Non-verbal communication: evaluation of a computer-assisted learning package',","authors":[],"date":"1993","doi":"10.1111\/j.1365-2923.1993.tb00306.x","raw":"Garrud, P. et al (1993) 'Non-verbal communication: evaluation of a computer-assisted learning package', Medical Education, 27, 474-8.","cites":null},{"id":442670,"title":"Pharyngitis in Louisiana: use of CBT to teach public health workers skills in outbreak investigation',","authors":[],"date":"1995","doi":null,"raw":"Stehr-Green, J. and Gathany, N. (1995), 'Pharyngitis in Louisiana: use of CBT to teach public health workers skills in outbreak investigation', Journal of Medical Education Technologies, 5 (3), 14-18.","cites":null},{"id":192876,"title":"Problem based, self-directed learning',","authors":[],"date":"1983","doi":"10.1001\/jama.1983.03340220045031","raw":"Barrows, H.S. (1983), 'Problem based, self-directed learning', J.A.M.A., 250, 3077-80. Bonica, J.J. (1987), Preface, Journal of Pain Symptom Management, 2, S3-S4.","cites":null},{"id":1041879,"title":"The International Pain Foundation meeting for education in pain management'","authors":[],"date":"1987","doi":"10.1016\/0304-3959(87)90079-0","raw":"Liebeskind, J.C. and Melzack, R. (1987), 'The International Pain Foundation meeting for education in pain management' (Editorial), Pain, 30, 1-2.","cites":null},{"id":1041882,"title":"What should medical students learn about pain?'","authors":[],"date":"1992","doi":"10.1016\/0304-3959(92)90027-9","raw":"Max, M.B. (1992), 'What should medical students learn about pain?' (Editorial), Pain, 50, 249-50.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1997","abstract":"In the health sciences, a wide range of computer‐based courseware is now available. The aim of the study described in this paper has been to compare the effectiveness of a computer‐based learning (CBL) software package and a traditional lecture (TL) for the delivery, of introductory material on pain. Nineteen undergraduate nursing students were divided into two groups to attend a one‐hour learning session which introduced clinical aspects of pain and which was delivered by either CBL or TL. Students were assessed for prior knowledge by a pre‐session test, and for knowledge gain by an identical post‐session test. In addition, a multiple‐choice question paper was used to examine differences in pain knowledge between the two groups, and a questionnaire was used to examine the students’ views on their experience during the learning session. The results demonstrated that both groups showed significant knowledge gain after their respective learning sessions. No significant differences between the groups in the magnitude of knowledge gain were found for clinical aspects of pain delivered during the learning sessions. The attitude questionnaire revealed that students attending CBL reported similar learning experiences to those attending the lecture","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/6725.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/248\/1\/ALT_J_Vol5_No3_1997_Computer_based_interactive_tut.pdf","pdfHashValue":"15e1a41d18c61b9836851b2d6bcef701aa800186","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:248<\/identifier><datestamp>\n      2011-04-04T09:21:03Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/248\/<\/dc:relation><dc:title>\n        Computer‐based interactive tutorial versus traditional lecture for teaching introductory aspects of pain<\/dc:title><dc:creator>\n        Johnson, Mark<\/dc:creator><dc:creator>\n        Dewhurst, David<\/dc:creator><dc:creator>\n        Williams, Alan<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        In the health sciences, a wide range of computer‐based courseware is now available. The aim of the study described in this paper has been to compare the effectiveness of a computer‐based learning (CBL) software package and a traditional lecture (TL) for the delivery, of introductory material on pain. Nineteen undergraduate nursing students were divided into two groups to attend a one‐hour learning session which introduced clinical aspects of pain and which was delivered by either CBL or TL. Students were assessed for prior knowledge by a pre‐session test, and for knowledge gain by an identical post‐session test. In addition, a multiple‐choice question paper was used to examine differences in pain knowledge between the two groups, and a questionnaire was used to examine the students’ views on their experience during the learning session. The results demonstrated that both groups showed significant knowledge gain after their respective learning sessions. No significant differences between the groups in the magnitude of knowledge gain were found for clinical aspects of pain delivered during the learning sessions. The attitude questionnaire revealed that students attending CBL reported similar learning experiences to those attending the lecture.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        1997<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/248\/1\/ALT_J_Vol5_No3_1997_Computer_based_interactive_tut.pdf<\/dc:identifier><dc:identifier>\n          Johnson, Mark and Dewhurst, David and Williams, Alan  (1997) Computer‐based interactive tutorial versus traditional lecture for teaching introductory aspects of pain.  Association for Learning Technology Journal, 5 (3).  pp. 22-31.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776970050303<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/248\/","10.1080\/0968776970050303"],"year":1997,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Computer-based interactive tutorial versus\ntraditional lecture for teaching introductory\naspects of pain\nMark I. Johnson, David G. Dewhurst and Alan D. Williams\nSchool of Applied Sciences, Leeds Metropolitan University\nIn the health sciences, a wide range of computer-based courseware is now available. The aim of the study\ndescribed in this paper has been to compare the effectiveness of a computer-based learning (CBL)\nsoftware package and a traditional lecture (TL) for the delivery, of introductory material on pain. Nineteen\nundergraduate nursing students were divided into two groups to attend a one-hour learning session which\nintroduced clinical aspects of pain and which was delivered by either CBL or TL. Students were assessed\nfor prior knowledge by a pre-session test, and for knowledge gain by an identical post-session test. In\naddition, a multiple-choice question paper was used to examine differences in pain knowledge between the\ntwo groups, and a questionnaire was used to examine the students' views on their experience during the\nlearning session. The results demonstrated that both groups showed significant knowledge gain after their\nrespective learning sessions. No significant differences between the groups in the magnitude of knowledge\ngain were found for clinical aspects of pain delivered during the learning sessions. The attitude\nquestionnaire revealed that students attending CBL reported similar learning experiences to those\nattending the lecture.\nIntroduction\nPain is one of the most frequent complaints presenting to medical institutions. However,\npain and its management continues to be marginalized in the content of health-care\nprofessional education due in part to the multi-disciplinary nature of the subject which\nmakes it difficult to locate within the curriculum (Bonica, 1987; Liebeskind and Melzack,\n1987; Marcer and Deighton, 1988; Pilowsky, 1988). Furthermore, the factual elements\nrelating to pain often overlap with other parts of the curriculum, making it impossible to\ndecide who should deliver the information, and how much time can be devoted within the\nlimited time frame of normal health-care professional courses (Max, 1992). The\nInternational Association for the Study of Pain (IASP) core curriculum on pain education\nwas developed to overcome some of these problems (Fields, 1995).\nTraditionally the lecture has been considered as the most efficient and convenient method\nfor disseminating information to health-care professionals. However, there are a number of\n22\nALT-] Volume 5 Number 3\ninherent problems with the use of lecture-based education. In the biomedical and clinical\nscience arenas there has been a large expansion in knowledge in the field and, as a\nconsequence, educators are prone to try to deliver more and more information into their\nallotted time-slot in the course. Consequently, students are overloaded with information\nand lecturers do not allow students to develop the problem-solving skills which are\nessential in clinical reasoning (Barrows, 1983; Wilson et al, 1992). The widespread\navailability of computers and the development of a wide range of courseware mean that\nthis need no longer be the case. Students engaged in computer-based learning (CBL) can\ncontrol the pace of their learning and study independently with potential savings in staff\ntime while achieving primary learning goals (Dewhurst et al, 1994). Moreover, it is\nimportant to employ a variety of educational methodologies to improve the learning\nexperience of students and to reinforce facts. In this respect, CBL software packages are\nbecoming a useful tool for modern-day medical students.\nAn interactive computer-based tutorial which aimed to introduce the clinical aspects of\npain has been developed by ourselves (Johnson and Dewhurst, 1996) using Authorware\nProfessional. The aim of the preliminary study presented in this paper was to evaluate\nwhether the CBL program could adequately replace a traditional lecture (TL) on pain and\nits management.\nMethods\nSubjects\nNineteen undergraduate students (17 female, 2 male) at Leeds Metropolitan University\nparticipated in the study. The students were at Level (year) 2 of a four-year BSc (Hons)\nNursing course, and had not received any previous formal lectures on pain or its\nmanagement. However, the students had received a one-hour informal tutorial on\npsychological aspects of the pain experience and pain-assessment methods. All students\nwere familiar with the use of CBL and had used a number of biomedical CBL programs at\nLevel 1 of the course.\nProcedure\nPrior to the study, students were asked to identify their preferred mode of learning (lecture\nn = 11; CBL n = 8). The class was then divided into two groups to attend a one-hour\nsession of either CBL or TL. Only half of the students in the class were allowed to attend\ntheir preferred mode of study (CBL group preferred mode, TL = 5, CBL = 4; TL group\npreferred mode, CBL = 4, TL = 6). The content of the lecture was identical to that of the\nCBL program. Students were assessed for prior knowledge by a 30-minute pre-session test,\nand were told that they would be re-examined after the learning session. Students were\nallowed a coffee break after the learning session before they attempted to complete three\npost-session tests, viz: (i) a short answer examination (identical to the pre-test, although\nstudents were unaware of this fact); (ii) a multiple-choice question (MCQ) paper (20\nquestions); and (iii) an attitude questionnaire.\n23\nMark I.Johnson et al Computer-based interactive tutorial versus traditional lecture\nTests of knowledge acquired\nPre- and post-test examination paper\nThe pre- and post-test examination paper consisted of 10 short answer questions. Students\nwere allowed 30 minutes to complete the paper which was subdivided into Section A (to\nassess student understanding of pain terminology) and Section B (to assess student\nunderstanding of clinical aspects of pain). Section A questions were:\n7. Define pain\n2. Define analgesia\n3. Define pain threshold\n4. What is a placebo?\n5. What is the difference between the terms acute and chronic pain?\nA maximum of two marks were assigned to each question (total of 10 marks), and all\nscripts were coded and marked blindly by the lecturer (MIJ).\nSection B questions were:\n6. List (name) as many painful conditions as you can\n7. What components (aspects) of a patient's pain experience are useful for the medical\nstaff to monitor?\n8. Highlight some of the ways (methods) that you could use to assess a patient in pain\n9. Outline how the body produces a sensation of pain when you stick your hand in a burning\nflame\n10. List as many therapies as you can that are currently used to manage painful conditions\nQuestions 9 and 10 were not based on material delivered during the learning session and\nwere included as controls. Questions 6 to 10 were marked by the lecturer (MIJ) using a\nside-by-side comparison of pre- and post-test scripts (blind) and identifying the best\ncontent-based answer. On breaking the code, a better post-test answer was assigned +1 in\nthe data set, a better pre-test answer a -1, and if both answers were equal in their content a\nvalue 0 was recorded. The results of the examinations were analysed by subtracting\nnumerical scores for section A of the pre-test short-answer questionnaire from post-test\nscores, group differences being determined using an unpaired t-test. Pre- to post-\ndifferences for the whole group for section B were analysed using the Binomial Sign Test,\nand differences pre versus post between CBL and TL were analysed using the Mann-\nWhitney U Test.\nPost-session multiple-choice paper\nA 20-minute, 20-question multiple-choice paper was used to assess post-session differences\nin knowledge in a variety of basic and clinical aspects of pain between the two groups.\nQuestions included a stem and a selection of 5 possible answers of which only one was\ncorrect. Examples of stems included:\nPain can be best described as ...\nWhich of the following is NOT a characteristic of chronic pain...\n24\nALT-] Volume 5 Number 3\nWhich of the following is NOT a descriptor associated with the SENSORY components of\npain?\nThe basic means of pain assessment in the human isby...\nGroup differences in MCQ scores were analysed using an unpaired t-test.\nLearning-session evaluation questionnaire\nA questionnaire was used to evaluate the views of the students towards their learning\nexperience during the session that they attended. The questionnaire consisted of 23\nstatements (see Appendix) and was administered immediately after the MCQ examination.\nStudents were requested to rank their agreement or disagreement with statements using a\n5-point Likert scale (Likert, 1932) using the following descriptors: Strongly agree (+2),\nAgree (+1), Neutral (0), Disagree (-1), Strongly disagree (-2). Differences in the median\nresponses between the CBL and TL students were analysed using the Mann-Whitney Test.\nMaterial delivered during the learning session\nThe learning session aimed to introduce students to general concepts of pain. The content\nof the CBL and TL were identical and delivered in the following order:\n1. Introduction\n2. Terminology (definitions of important terms e.g. pain, analgesia, allodynia,\nhyperalgesia, nociceptors)\n3. Types of Pain (e.g. acute, chronic, nociceptive, neuropathic)\n4. Functions of Pain (under normal physiological conditions)\n5. Pain and Injury (the variable link between pain and injury)\n6. Dimensions of Pain (sensory, affective, cognitive)\n7. Pain Assessment (pain rating scales and pain location charts)\n8. Pain Management (introduction to pharmacological and non-pharmacological\nmethods of pain relief)\n9. Summary\n10. Revision (20 self-assessment MCQs).\nThe lecture was delivered by an IASP member (MIJ) using a combination of OHP\ntransparencies (text and diagrams) and a whiteboard. Students were occasionally engaged\nby questions from the lecturer, although students were discouraged from asking questions\nuntil the end of the session. Students made notes during the lecture. The CBL program\nconsisted of 10 sections, each containing a number of pages which combined descriptive\ntext with high-resolution graphics. Features actively to engage the student - such as\nanimation, a Hypertext facility, hangman games, drag-and-drop exercises, interpreting\npain charts, completing statements, and multiple choice and true\/false questions - were\nincluded in the program The CBL session was supervised by an IT specialist who was able\nto troubleshoot software and program navigational problems but was who was unable to\nadvise on any specific aspects of the academic content of package. Students were\ninstructed on the general aspects of navigation through the CBL package and were advised\nto examine the program Instructions for Use section before starting.\n25\nMark I.Johnson et ol Computer-based interactive tutorial versus traditional lecture\nResults\nKnowledge acquired\nPre- and post-tests\nNo significant differences were observed between the groups in pre-test scores for section A\n(pain terminology, mean ±SD: CBL = 4.6±1.2; TL = 3.8±1.9; P = 0.29, unpaired t-test).\nThere was a significant knowledge gain for section A between the pre- and post-sessions\nfor the whole class (pre-test = 4.2+1.6; post-test = 6.8±1.9; P<0.01, paired t-test), and a\nsignificantly greater knowledge gain for students attending TL compared to CBL (increase\npre- to post-test CBL = +1.4±2.3; TL = +3.8±2.2; P<0.05, unpaired t-test). There was a\nsignificant knowledge gain between the pre- and post-sessions for the whole class for\nSection B Q7 (P<0.01, Binomial Sign Test) and Q8 (P<0.01), but not for Q9 and Q10\n(P>0.05, control questions) or Q6 (P>0.05). Q6 required students to name as many painful\nconditions as they could, and it is likely that the examples of painful conditions used\nduring the TL and CBL were already familiar to the students. No significant differences in\nknowledge gain were observed between CBL and TL for any of the section B questions.\nMCQ paper\nThere were no significant differences in post-session MCQ scores between CBL (15.8±1.6)\nand TL (16.312.8) students (mean+SD; P = 0.62, unpaired t-test). As no pre-test MCQ\nscores were obtained, it was not possible to determine whether there had been any\nknowledge gain.\nStudent attitudes to the learning session\nStudents from both groups expressed similar views towards their learning session (see\nAppendix). They agreed that they would recommend their session to colleagues interested\nin the subject (Q22), and that their session should be used again in future courses (Q21).\nThey felt that the material in the CBL\/TL was interesting (Q8), easy to follow (Q7),\nenjoyable (Q9), and they agreed that they gained much new information (Q15) and\nunderstanding of pain (Q16).\nSignificant differences were noted between the groups for Q3, Q17, and Q20 (Appendix).\nAll 9 students attending the CBL session either 'strongly agreed' or 'agreed' that they were\nin control of their learning (Q3 median = 'strongly agree') compared to only 3 out of 10\nTL students (median = 'neutral'; P<0.01). This finding was supported by the results of an\nopen-ended question where students reported that the 'best feature' of CBL was the ability\nto work through topics at their own pace, something which allowed them to spend more\ntime on topics they found difficult (55% of responses). However, CBL students were\nallowed to use the program for only one hour. This may have compromised their ability to\ncomplete all the material, and may thus have contributed to the differences in knowledge\ngain between the groups observed in section A (pain terminology) of the short-question\npaper. 45% of CBL students stated that the 'best feature' of the program was its interactive\nproperties which made them think through problems and allowed them to work at their\nown pace.\nEight out of ten TL students 'strongly agreed' that the lecture was a better way to learn\nthan private reading compared to three out of nine CBL students (Q17, median response:\nTL = 'strongly agree'; CBL = 'agree'; P<0.05). Similarly, when comparing their learning\nsession to a tutorial, seven out of nine TL students 'strongly agreed' or 'agreed ' that the\n26\nALT-J Volume 5 Number 3\nlecture was a better way to learn than a tutorial. Only one out of nine CBL students\n'agreed' that CBL was a better way to learn than a tutorial (Q20, P<0.01). However, the\nidentical response distributions for Q15 and Q16 may indicate that students failed to\ndifferentiate between certain terms in the questionnaire, and it is possible that students\napplied a generic definition to the word 'learn'. The variations in student attitudes between\nthe different methods of delivery of material therefore merits further examination.\nDiscussion\nThis study has demonstrated that CBL can be a useful adjunct to the delivery of\neducational material on pain. It is consistent in this respect with other studies in the area of\nbiomedical science that attempt to replace or supplement existing teaching methods (Safrit\net al, 1988; Garrett et al, 1990; Walsh and Bohn, 1990; Hollingsworth and Foster, 1991;\nGarrud et al, 1993; Napholz and McCanse, 1994; Stanford et al, 1994; Hutchins et al,\n1995; Stehr-Green and Gathany, 1995; Gunn and Maxwell, 1996). Studies that oppose the\nview that CBL can replace existing methods include Garrett et al (1987). There has been\nmuch argument as to the validity of studies that take the experimental approach to\nevaluating the effectiveness of learning technology, and no firm conclusions have been\ndrawn as yet, but Clark (1985a; 1985b) provides a thorough explanation of ways in which\nsuch studies may be confounded.\nIt was found that students attending a one-hour CBL session significantly gained in\nknowledge about pain when compared to their pre-session baseline. However, students\nattending the lecture showed a greater increase in knowledge acquired for basic pain\nterminology when compared to students attending the CBL session, although the\nmagnitude of knowledge gain on other questions (e.g. Section B and MCQ) was\ncomparable. Similar views about the learning experience were found between CBL and TL\nstudents, although TL students were more positive towards the role of traditional lectures\nwhen compared to private reading and tutorials than CBL students were towards CBL. We\nsuspect that students view CBL as a method to supplement rather than replace traditional\nlectures, a suspicion supported by Garrett et al (1987).\nStudents attending the CBL session appeared to be deficient in knowledge acquired for\nbasic pain terminology (Section A). Subsequent to the study, we have found that, on\naverage, it takes our nursing students two to four hours to thoroughly complete the CBL\nprogram. As students in the present study were given only one hour to complete it, it is\nlikely that they will have quickly progressed through the entire program in an effort to\nobserve all information rather than systematically attempting to answer problems from\neach section. Moreover, the lecture delivered a concentrated version of the material\ncontained within the CBL program and it is likely that more emphasis was given by the\nlecturer to basic terminology. Napholz and McCanse (1994) suggest that CBL can reduce\nthe time students need to learn specific content.\nIt is often perceived by lecturing staff that disseminating content-based material is\nachieved most quickly by lectures, although students often report that they are\noverwhelmed by the volume of material delivered. CBL students commented that the\ninteractive properties of the CBL program enabled them to think through problems and\nallowed them to study at their own pace. The finding that students in the CBL group felt\n27\nMark I.Johnson et al Computer-based interactive tutorial versus traditional lecture\nmore in control of their learning is important. They reported that the best feature of CBL\nwas the ability it gave them to spend more time on topics they found difficult. Students are\nmore confident in their ability and consequently more enthusiastic about their learning\nwhen they feel that they are in control of the pace of their studies. Lectures ultimately\ndictate the speed of delivery of information and allow no flexibility for the wide range of\nstudent abilities within groups. Lecturers commonly encounter problems with students\nwho fall behind due to an inability to assimilate difficult information quickly during the\ncourse of a lecture. With an ever-increasing range of student ability entering higher\neducation, it is important to allow students to learn at a pace which is comfortable for\nthem. As students have a greater access to computers, CBL programs will enable them to\nmanage their own time. Furthermore, students quickly forget the factual elements of the\ncurriculum after examinations and the reinforcement of facts is therefore an essential part\nof the learning experience (Levine and Forman 1973). CBL packages can be a useful and\nenjoyable revision tool.\nA significantly greater proportion of TL students rated the session as a better way to learn\nthan both private reading and a tutorial. This finding is interesting and suggests, once\nagain, that students may see CBL as being more appropriate as tutorial material than as\nreplacing the traditional lecture. Fincher et al (1988) have shown that medical students\nusing, CBL for the learning of electrocardiography performed significantly better than an\nequivalent group attending a weekly seminar on the subject for a six-week period. We\ncurrently use CBL as an independent study task to be completed outside formal teaching\ntime and following one introductory lecture on pain. However, caution must be applied\nwhen interpreting the findings of our attitudes questionnaire. Although users' opinions\nand attitudes are routinely used to evaluate CBL, Jones and McCormac (1992) have shown\nthat such criteria are poor evaluation tools as it can be difficult to standardize student\ninterpretation of words used within the questionnaire. The identical response distributions\nfor Q15 and Q16 (Appendix) may indicate that students have failed to differentiate between\nthe terms 'information' and 'understanding', and it is likely that students applied a generic\ndefinition to the word 'learn' which encompasses a combination of gain in factual\ninformation, understanding and cognitive ability.\nIn general, the learning-session evaluation questionnaire revealed few differences in\nstudent views towards their respective learning experiences. This suggests that students are\ncomfortable with CBL as a study aid, and students agreed that they would recommend\nCBL to colleagues interested in the subject. This is important, given an ever-increasing\nconsumer-based student population who demand educational value for money. CBL\nstudents reported some problems associated with navigating through the program, and\nsome students expressed concern that they might accidentally miss important information.\nFurthermore, some students expressed worry at the lack of lecture notes for future\nreference. Students attending the lecture reported that one of the best features of lectures\nwas the ability readily to obtain these. A study guide incorporating printed lecture notes\nhas been designed to accompany the CBL program in an attempt to overcome this\nproblem.\nIn summary, this study has found that CBL can, generally speaking, be used effectively as\nan alternative to traditional lectures for the delivery of educational material on pain.\n28\nAu-J Volume 5 Number 3\nAcknowledgements\nThe authors wish to express their thanks to Dr Paul Marchant for statistical advice, and\nBrett Bailey, Oliver Dawson and Natha Modhawadia who were involved in the design and\ndevelopment of the CBL software package.\nReferences\nBarrows, H.S. (1983), 'Problem based, self-directed learning', J.A.M.A., 250, 3077-80.\nBonica, J.J. (1987), Preface, Journal of Pain Symptom Management, 2, S3-S4.\nClark, R.E. (1985a) 'Confounding in educational computing research', Journal of\nEducational Computing Research, 1 (2), 137-148.\nClark, R.E. (1985b) 'Evidence for confounding in computer-based instruction studies:\nanalysing the meta-analyses', Educational Communication and Technology Journal, 33 (4),\n249-62.\nColeman, I.P., Dewhurst, D.G., Meehan, A.S. and Williams, A.D. (1994), 'A computer\nsimulation for learning about the physiological response to exercise', American Journal of\nPhysiology, 266 (11), S2-S9.\nDewhurst, D.G., Hardcastle, J., Hardcastle, P.T. and Stuart, E. (1994), 'Comparison of a\ncomputer simulation program and a traditional laboratory practical class for teaching the\nprinciples of intestinal absorption', American Journal of Physiology, 267 (12), S95-S104.\nFields, H.L. (1992), 'Core curriculum for professional education' in Fields, H.L. (ed), Pain\n(2nd edition), Seattle WA: International Association for the Study of Pain Publications.\nFincher, R.M.E., Abdulla, A.M., Sridharan, M.R., Houghton, J.L. and Henke, J.S. (1988),\n'Computer-assisted learning compared with weekly seminars for teaching fundamental\nelectrocardiography to junior medical students', Southern Medical Journal, 81, 1291-4.\nGarrett, T.J., Ashford, A.R. and Savage, D.G. (1987) 'A comparison of CAI and tutorials\nin hematology and oncology', Journal of Medical Education, 62, 918-22.\nGarrett, T.J., Selnow, G., Dobkin, J.F. and Healton, C. (1990) 'Computer-assisted\ninstruction in AIDS infection control for physicians', Teaching and Learning in Medicine,\n2,215-18.\nGarrud, P. et al (1993) 'Non-verbal communication: evaluation of a computer-assisted\nlearning package', Medical Education, 27, 474-8.\nGunn, C. and Maxwell, L. (1996), 'CAL in human anatomy', Journal of Computer Assisted\nLearning, 12 (4), 205-15.\nHollingsworth, M. and Foster, R.W. (1991), 'Computer-assisted learning (CAL) programs\nin drug disposition: replacement of lectures', British Journal of Pharmacology Proc. Suppl.,\n102, 216P.\nHutchins, L. et al (1995), 'Evaluation of computer-based cancer education modules at the\nArkansas Cancer Research Center', Journal of Medical Education Technologies, 6 (1), 4-9.\n29\nMark I.Johnson et ol Computer-based interactive tutorial versus traditional lecture\nJohnson, M.I. and Dewhurst, D.G. (1996), 'Clinical aspects of pain: a computer-based\nlearning program to introduce the subject to undergraduate students', Journal of the Pain\nSociety., 12, 71.\nJones, B.T. and McCormac, K. (1992), 'Empirical evidence shows that measuring users'\nopinions is not a satisfactory way of evaluating computer-assisted learning in nurse\neducation', International Journal of Nursing Studies, 29, 411-25.\nLevine, H.G. and Forman, P.M. (1973), 'A study of retention of knowledge of\nneurosciences information', Journal of Medical Education, 48, 867-9.\nLiebeskind, J.C. and Melzack, R. (1987), 'The International Pain Foundation meeting for\neducation in pain management' (Editorial), Pain, 30, 1-2.\nLikert, R.A. (1932), 'A technique for the measurement of attitudes', Archives of\nPsychology, 140.\nMarcer, D. and Deighton, S. (1988), 'Intractable pain: a neglected area of medical\neducation in the UK', Journal of the Royal Society of Medicine, 81, 698-700.\nMax, M.B. (1992), 'What should medical students learn about pain?' (Editorial), Pain, 50,\n249-50.\nNapholz, L. and McCanse, R. (1994), 'Interactive video instruction increases efficiency in\ncognitive learning in a Baccalaureate nursing education program', Computers in Nursing,\n12 (3), 149-53.\nPilowsky, I. (1988), 'An outline curriculum for medical schools', Pain, 33, 1-2.\nStanford, W. et al (1994), 'Evaluation of a computer-based program for teaching cardiac\nanatomy', Investigative Radiology, 29, 248-52.\nStehr-Green, J. and Gathany, N. (1995), 'Pharyngitis in Louisiana: use of CBT to teach\npublic health workers skills in outbreak investigation', Journal of Medical Education\nTechnologies, 5 (3), 14-18.\nWalsh, R. and Bohn, R. (1990), 'Computer-assisted instructions: a role in teaching human\ngross anatomy', Medical Education, 24, 499-506.\nWilson, J.F., Brockopp, G.W., Kryst, S., Steger, H. and Witt, W.O. (1992), 'Medical\nstudents' attitudes toward pain before and after a brief course on pain', Pain, 50, 251-6.\n30\nALT-] Volume 5 Number 3\nAppendix\nA summary of student attitudes towards their respective learning session. Students ranked\ntheir agreement or disagreement with the statement according to Strongly Agree (SA),\nAgree (A), Neutral (N), Disagree (D), Strongly Disagree (SD). Values shown are the\nfrequency of responses within each category. (CBL = students attending the computer-\nbased learning session, TL = students attending the traditional lecture).\nLearning session evaluation tool SA N SD\nQ I The objectives were clear to me\nQ2 Effective use was made of other forms of\npresentation than merely verbal exposition (e.g.\ndiagrams, animation, questions with feedback)\nQ3 During the CBL\/lecture I was in control of my\nlearning\nQ4 The CBL\/lecture involved a large amount of\ninteraction\nQ5 The interaction during the CBL\/lecture was\nactive and stimulating\nQ6 The diagrams were clear\nQ7 It was easy to follow the CBL\/lecture\nQ8 The CBL\/lecture was interesting\nQ9 I enjoyed the CBL\/lecture\nQ101 had sufficient background to follow the lecture 2\nQ l I The learning objectives were fully covered by\nthe content of the CBL\/lecture\nQ12 The CBL\/lecture presented and explained the\nmaterial in an organised and systematic way\nQ13 The content of CBL\/lecture was at the right\nlevel for my needs\nQ14 The CBL\/lecture detected misunderstanding\nor lack of knowledge on my part\nQ151 gained a lot of information from the\nCBL\/lecture\nQ161 gained a lot of understanding from the\nCBL\/lecture\nQ17 The CBL\/lecture was a better way to learn\nthis material than private reading\nQ18 The CBL\/lecture was a better way to learn\nthis material than a lecture\/CBL\nQ19 The CBL\/lecture was a better way to learn\nthis material than a practical\nQ20The CBL\/lecture was a better way to learn\nthis material than a tutorial\nQ211 recommend that this CBL\/lecture be used\nagain in the course\nQ221 would recommend using this CBL\/lecture\nto students interested in the subject\nQ23 The CBL\/lecture motivates me to study\nfurther in some of these areas\n5\n8\n5\n3\n7\n1\n3\n4\n3\n2\n5\n4\n2\n4\n3\n5\n4\n3\n2\n2\n3\n4\n6\n2\n6\n1\n0\n3\n2\n3\n2\n3\n8\n1\n2\n1\n1\n0\n1\n4\n3\n4\n3\n5\n0\n1\n2\n4\n6\n2\n2\n5\n5\n5\n8\n4\n6\n6\n6\n5\n5\n5\n7\n7\n5\n1\n7\n5\n3\n4\n3\n4\n0\n5\n8\n5\n8\n3\n1\n0\n2\n2\n1\n1\n6\n2\n6\n4\n4\n1\n7\n3\n0\n0\n1\n0\n7\n1\n1\n0\n0\n0\n0\n1\n0\n1 .\n0\n0\n0\n0\n3\n4\n0\n0\n0\n0\n1\n1\n7\n0\n0\n0\n0\n2\n1\n6\n5\n3\n6\n4\n1\n1\n1\n0\n3\n2\n2\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n1\n0\n0\n0\n1\n0\n3\n3\n1\n0\n1\n0\n0\n0\n1\n0\n2\n1\n3\n1\n0\n0\n0\n0\n1\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n0\n1\n0\n1\n0\n1\n0\n1\n0\n1\n0\n0\n0\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\nCBL\nTL\n31\n"}