{"doi":"10.1109\/TMAG.2002.804812","coreId":"54879","oai":"oai:eprints.lincoln.ac.uk:2352","identifiers":["oai:eprints.lincoln.ac.uk:2352","10.1109\/TMAG.2002.804812"],"title":"Influence of an aperture on the performance of a two-degree-of-freedom iron-cored spherical permanent-magnet actuator","authors":["Mitchell, J. K.","Jewell, G. J.","Wang, J.","Bingham, Chris","Howe, David"],"enrichments":{"references":[{"id":18444697,"title":"A novel spherical permanent magnet actuator with three degrees-of-freedom,”","authors":[],"date":"1998","doi":"10.1109\/intmag.1998.742226","raw":"J. Wang, W. Wang, G. W. Jewell, and D. Howe, “A novel spherical permanent magnet actuator with three degrees-of-freedom,” IEEE Trans. Magn., vol. 34, pp. 2078–2080, July 1998.","cites":null},{"id":18444693,"title":"Analysis of a spherical permanent magnet actuator,”","authors":[],"date":"1997","doi":"10.1049\/ic:19970525","raw":", “Analysis of a spherical permanent magnet actuator,” J. Appl. Phys., vol. 81, no. 8, pp. 4266–4268, 1997.","cites":null},{"id":18444698,"title":"Analysis, design and control of a novel spherical permanent magnet actuator with three degrees-of-freedom,” IEEE\/ASME Trans. Mechatron., submitted for publication.","authors":[],"date":null,"doi":"10.1109\/tmech.2003.820003","raw":"W. Wang, J. Wang, G. W. Jewell, and D. Howe, “Analysis, design and control of a novel spherical permanent magnet actuator with three degrees-of-freedom,” IEEE\/ASME Trans. Mechatron., submitted for publication.","cites":null},{"id":18444691,"title":"control,”","authors":[],"date":"1997","doi":null,"raw":"J.Wang,G.W.Jewell,andD.Howe,“Anovelsphericalactuator:Design and control,” IEEE Trans. Magn., vol. 33, pp. 4209–4211, Sept. 1997.","cites":null},{"id":18444695,"title":"design and control of a novel spherical permanent magnet actuator,”","authors":[],"date":"1998","doi":"10.1049\/ip-epa:19981635","raw":", “Analysis, design and control of a novel spherical permanent magnet actuator,” Proc. Inst. Elec. Eng.—Electric Power Applicat., vol. 145, no. 1, pp. 61–71, 1998.","cites":null},{"id":18444699,"title":"Modeling of a novel spherical permanent magnet actuator,” in","authors":[],"date":"1997","doi":"10.1109\/robot.1997.614299","raw":"J. Wang, G. W. Jewell, and D. Howe, “Modeling of a novel spherical permanent magnet actuator,” in Proc. IEEE Int. Conf. Robotics and Automation, Albuquerque, NM, Apr. 1997, pp. 1190–1196.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002","abstract":"Abstract—This paper describes a computational and experimental study of a two-degree-of-freedom spherical permanent-magnet actuator equipped with an iron stator. In particular, it considers the effect of introducing an aperture in the stator core to facilitate access to the armature. The resultant magnetic field distribution in the region occupied by the stator windings, the net unbalanced radial force, and the resulting reluctance torque are determined by three-dimensional magnetostatic finite-element\\ud\nanalysis. The predicted reluctance torque is validated experimentally, and its implications on actuator performance are described","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/54879.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/2352\/1\/mitchell_influence_aperture.pdf","pdfHashValue":"f010af1af0cbb8b1f2993172c0d3470cfef8c2f0","publisher":"Institution of Electronic and Electrical Engineers","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:2352<\/identifier><datestamp>\n      2014-08-28T09:25:01Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48363030<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/2352\/<\/dc:relation><dc:title>\n        Influence of an aperture on the performance of a two-degree-of-freedom iron-cored spherical permanent-magnet actuator<\/dc:title><dc:creator>\n        Mitchell, J. K.<\/dc:creator><dc:creator>\n        Jewell, G. J.<\/dc:creator><dc:creator>\n        Wang, J.<\/dc:creator><dc:creator>\n        Bingham, Chris<\/dc:creator><dc:creator>\n        Howe, David<\/dc:creator><dc:subject>\n        H600 Electronic and Electrical Engineering<\/dc:subject><dc:description>\n        Abstract—This paper describes a computational and experimental study of a two-degree-of-freedom spherical permanent-magnet actuator equipped with an iron stator. In particular, it considers the effect of introducing an aperture in the stator core to facilitate access to the armature. The resultant magnetic field distribution in the region occupied by the stator windings, the net unbalanced radial force, and the resulting reluctance torque are determined by three-dimensional magnetostatic finite-element\\ud\nanalysis. The predicted reluctance torque is validated experimentally, and its implications on actuator performance are described.<\/dc:description><dc:publisher>\n        Institution of Electronic and Electrical Engineers<\/dc:publisher><dc:date>\n        2002<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/2352\/1\/mitchell_influence_aperture.pdf<\/dc:identifier><dc:identifier>\n          Mitchell, J. K. and Jewell, G. J. and Wang, J. and Bingham, Chris and Howe, David  (2002) Influence of an aperture on the performance of a two-degree-of-freedom iron-cored spherical permanent-magnet actuator.  IEEE Transactions on Magnetics, 38  (6).   pp. 3650-3653.  ISSN 0018-9464  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/TMAG.2002.804812<\/dc:relation><dc:relation>\n        10.1109\/TMAG.2002.804812<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/2352\/","http:\/\/dx.doi.org\/10.1109\/TMAG.2002.804812","10.1109\/TMAG.2002.804812"],"year":2002,"topics":["H600 Electronic and Electrical Engineering"],"subject":["Article","PeerReviewed"],"fullText":"3650 IEEE TRANSACTIONS ON MAGNETICS, VOL. 38, NO. 6, NOVEMBER 2002\nInfluence of an Aperture on the Performance\nof a Two-Degree-of-Freedom Iron-Cored\nSpherical Permanent-Magnet Actuator\nJ. K. Mitchell, G. W. Jewell, J. Wang, C. M. Bingham, and D. Howe\nAbstract—This paper describes a computational and ex-\nperimental study of a two-degree-of-freedom spherical perma-\nnent-magnet actuator equipped with an iron stator. In particular,\nit considers the effect of introducing an aperture in the stator core\nto facilitate access to the armature. The resultant magnetic field\ndistribution in the region occupied by the stator windings, the\nnet unbalanced radial force, and the resulting reluctance torque\nare determined by three-dimensional magnetostatic finite-element\nanalysis. The predicted reluctance torque is validated experimen-\ntally, and its implications on actuator performance are described.\nIndex Terms—Finite-element modeling, permanent-magnet ac-\ntuators, reluctance torque, spherical actuators, unbalanced mag-\nnetic pull.\nI. INTRODUCTION\nSPHERICAL permanent-magnet actuators, capable of pro-ducing motion with either two or three degrees of freedom\n(DOF), are being developed for applications that require pre-\ncise and complex motion control, such as stereoscopic active\nvision systems and force feedback joysticks. To date, however,\nonly spherical actuators employing air-cored stators or stators in\nwhich the windings were contained within a smooth, infinitely\npermeable spherical iron core have been considered [1]–[6].\nSuch spherical actuators comprise an appropriately magnetized\npermanent-magnet rotor around which are disposed a number\nof stator coils and linear Hall sensors for rotor position sensing.\nExcellent closed-loop servo-characteristics have been demon-\nstrated, albeit the actuators having only moderate specific torque\ncapabilities [3].\nThe use of an iron-cored stator, either slotless in which\nthe coils are surrounded by a smooth spherical iron shell or\nslotted in which the coils are wound around a toothed iron core,\ncan considerably enhance the specific torque capability. For\nexample, previous analysis, has demonstrated that the torque\ncapability of a slotless iron-cored two-DOF actuator would be\nsome 30% higher than for a similarly sized air-cored actuator\n[3]. This analysis was, however, based on a simplified model\nof the actuator, which assumed that the spherical iron core\ncompletely surrounded the permanent-magnet rotor and stator\ncoils, and, hence, maintained the rotational symmetry so as to\nenable an exact analytical field solution to be derived.\nManuscript received November 27, 2001; revised August 6, 2002. This work\nwas supported by the U.K. Engineering and Physical Sciences Research Council\nunder the Electrical Machines and Drives Program.\nThe authors are with the Department of Electronic and Electrical Engineering,\nThe University of Sheffield, Sheffield S1 3JD, U.K.\nDigital Object Identifier 10.1109\/TMAG.2002.804812\nHowever, in a practical iron-cored spherical actuator, it would\nbe necessary to incorporate at least one aperture in the iron core\nin order to gain access to the rotor so as to attach the external\npayload, e.g., a camera in an active vision system, the handle of\na force-feedback joystick, etc. Such an aperture would modify\nthe magnetic field distribution, which, in turn, may degrade the\nperformance of the actuator in three respects, since it may result\nin the following:\n1) an asymmetrical flux density distribution, which would\naffect the excitation torque versus rotor angular displace-\nment characteristics;\n2) a reluctance torque component, due to the interaction of\nthe permanent-magnet field and the asymmetrical stator\niron geometry;\n3) asymmetry in the radial force distribution and, hence, an\n“unbalanced magnetic pull,” which could impose a sig-\nnificant additional load on the bearing system.\nThis paper describes a computational and experimental in-\nvestigation of the influence of an aperture on the performance\nof a slotless iron-cored two-DOF permanent-magnet spherical\nactuator.\nII. ACTUATOR SPECIFICATIONS\nThe investigation is based on the iron-cored two-DOF\nspherical actuator whose leading dimensions and stator ge-\nometry are shown in Fig. 1. The permanent-magnet rotor\nis a 48-mm-diameter sintered anisotropic Nd–Fe–B sphere\n(UGIMAG 37 B; with a remanence of 1.28 T) which is\nmagnetized diametrically. It is the same rotor as that which\nwas employed previously in an air-cored two-DOF spherical\nactuator which had torque capabilities of 0.15 Nm (continuous)\nand 0.4 Nm (peak) [3].\nA 13-mm-diameter flat with a 5-mm-deep, 5-mm-diameter\nholewasmachined in the rotor inorder to facilitate theattachment\nof the aluminum payload arm. The 88-mm inner diameter of\nthe stator iron core, accords with the optimal “split-ratio” for\nmaximizing the specific torquecapability, asdescribed in [1], [3],\nwhile the aperture was dimensioned to accommodate a 45 pan\nand tilt excursionwitha10-mm-diameterpayloadarm.Hence, its\ninner surface subtends an angle of 51.5 . The outer diameter of\nthe stator iron core was dimensioned to avoid undue saturation.\nIII. FINITE-ELEMENT MODELING\nAlthough the actuator has a relatively simple geometry, re-\ncourse to three-dimensional (3-D) magnetostatic field analysis is\n0018-9464\/02$17.00 © 2002 IEEE\nMITCHELL et al.: INFLUENCE OF AN APERTURE ON THE PERFORMANCE OF A PERMANENT-MAGNET ACTUATOR 3651\n(a)\n(b)\nFig. 1. (a) Leading dimensions of actuator (in millimeters). (b) Stator\ngeometry (shown with permanent-magnet rotor removed).\nnecessary in order to determine the magnetic field as the rotor ori-\nentation is varied. The actuator was modeled using 3-D finite-el-\nement analysis (ANSYS Version 5.6). In order to minimize the\ncomputational effort, the stator iron was assumed to have a con-\nstant relative permeability of 7000. As will be demonstrated, this\nassumption is justified by the fact that the maximum flux density\nwithin the iron (which occurs near the corner adjacent to the aper-\nture) is 1.1 T. Thus, the working points lie on the linear region of\nthe magnetization characteristic.\nThe geometrical symmetry of the actuator was exploited by\nreducing the problem domain to one half of the actuator, illus-\ntrated by the typical 3-D finite-element mesh in Fig. 2, which,\nin this case, models the actuator for zero rotor displacement.\nAlthough the discretization varied with rotor displacement, the\nnumber of finite elements was typically in the region of 120 000.\nIn order to ensure that the reluctance force was calculated to an\nacceptable accuracy, the air space in the vicinity of the aperture\nwas finely discretized, and a 1-mm-thick layer of uniformly dis-\ncretized elements being employed adjacent to the surface of the\nrotor. The problem domain was bounded by a tangential flux\nFig. 2. Three-dimensional finite-element mesh with zero rotor displacement.\nFig. 3. Predicted radial flux density profiles for zero rotor displacement\nangular position as defined in Fig. 1. (—–) Finite element. (\u000f\u000f\u000f\u000f\u000f)Analytical.\ncondition imposed at an enclosing spherical boundary having a\nradius of 100 mm. The open-circuit magnetic field distributions\n(i.e., with stator coils unexcited) were determined using a scalar\npotential formulation and employing first-order finite elements\n(type SOLID96 [7]). For a given angular displacement of the\nrotor, the reluctance torque and the net unbalanced force were\ncalculated using the Virtual Work method.\nIV. PREDICTED AND MEASURED RESULTS\nFig. 3 compares finite-element predicted profiles of the radial\ncomponent of flux density around three circular paths having\ndifferent radii, viz. 24 mm (on surface of permanent magnet);\n34 mm (center of the air gap); and 44 mm (on inner surface of\niron) for zero displacement. Also shown in Fig. 3 are the corre-\nsponding flux density profiles calculated analytically assuming\nthat the stator core comprises a complete spherical iron shell [3].\nAs will be seen, while there is reasonable agreement between\nthe predicted flux density profiles within the region that is en-\nclosed by the stator core, there is a considerable difference be-\ntween the flux density profiles in the region under the aperture,\nparticularly at the surface of the rotor, where the influence of\nthe payload arm mounting hole is apparent at the stator bore im-\nmediately adjacent to the aperture. Similar behavior is observed\n \n3652 IEEE TRANSACTIONS ON MAGNETICS, VOL. 38, NO. 6, NOVEMBER 2002\nFig. 4. Predicted radial flux density profiles for a rotor displaced by 45\nangular position as defined in Fig. 1. (—–) Finite element. (\u000f \u000f \u000f \u000f \u000f)\nAnalytical.\nFig. 5. Experimental test rig for measurement of reluctance torque.\nwhen the rotor is displaced by 45 , as shown in Fig. 4. The exci-\ntation torque that results when a particular stator coil is excited\nis obtained from a volume integration of the radial component of\nflux density over the volume occupied by the coil. Hence, given\nthat the stator coils are all located entirely within the stator iron\ncore, it is evident from Figs. 3 and 4 that an aperture having the\ndimensions shown in Fig. 1 will have a negligible influence on\nthe excitation torque characteristics predicted by the analytical\ndesign technique described in [3].\nThe variation of the reluctance torque with rotor angular\ndisplacement was calculated from ten finite-element field so-\nlutions with increments of 5 in angular displacement. In order\nto validate the calculation, the reluctance torque was measured\nusing the test rig shown in Fig. 5, in which the spherical perma-\nnent-magnet sphere rotor was rigidly fixed to the base, and the\nspherical iron stator core was supported by a pair of rolling ele-\nment bearings. At any given rotor angular displacement (which\nis set by a precision dowel arrangement), the net reluctance\ntorque was measured by a pair of rotary load cells (ENTRAN\nELT-1 M–2.5 NM). The predicted and measured reluctance\ntorque characteristics are compared in Fig. 6, the maximum\ndifference being some 10% of the peak magnitude.\nAn interesting feature of the reluctance torque characteristics\nof Fig. 6 is that they exhibit “negative” stiffness, i.e., at zero\nFig. 6. Comparison of predicted and measured reluctance torque as a function\nof rotor angular displacement.\nFig. 7. Predicted magnitude of net radial force as a function of rotor angular\ndisplacement.\ndisplacement the rotor is in an unstable equilibrium, and if dis-\nplaced would rotate to a position of minimum reluctance. For\nmany applications, which require rapid and precise movement\nof a payload, this is likely to be an undesirable feature, in that\nit will inevitably compromise the achievable closed-loop dy-\nnamic performance. For applications with more subjective per-\nformance criteria, such as force-feedback joysticks, it is likely\nto compromise the haptic “feel” of the device. However, of par-\nticular concern is that the peak reluctance torque is comparable\nto the peak excitation torque rating of 0.56 Nm [3] (predicted\nanalytically for a current density of 4 A\/mm and no aperture).\nHowever, the problem could be largely overcome by incorpo-\nrating a restoring spring mechanism in the actuator, although it\nwould inevitably be rather complex in order to provide the re-\nquired restoring forces in the two DOF.\nThe magnitude and resultant direction of the “unbalanced\nmagnetic pull” that is produced as the rotor is displaced from its\nequilibrium zero displacement position was also deduced from\nthe finite-element field solutions. The resulting characteristics\nare shown in Figs. 7 and 8. As can be seen, the magnitude of this\nforce is very significant, being some 12 times the gravitational\nforce exerted by the permanent-magnet rotor and payload arm.\nMITCHELL et al.: INFLUENCE OF AN APERTURE ON THE PERFORMANCE OF A PERMANENT-MAGNET ACTUATOR 3653\nFig. 8. Predicted direction of net radial force (relative to reference angle\ndefined in Fig. 1) as a function of rotor angular displacement.\nIn terms of realizing a practical iron-cored spherical actuator,\nin order to accommodate this magnitude of unbalanced force a\nrelatively complex precision bearing arrangement is likely to be\nrequired.\nV. CONCLUSION\nFinite-element analyses and experimental measurements pre-\nsented have enabled the influence of an aperture in an iron-cored\nstator of a spherical two-DOF actuator to be quantified. For the\nparticular actuator dimensions considered in this paper, the ex-\ncitation torque characteristic is not modified to any great extent\nby the presence of the aperture. However, the presence of the\naperture does introduce significant problems in terms of the re-\nsulting reluctance torque and unbalanced radial forces. Thus,\nwhile an iron-cored stator would increase the volumetric torque\ncapability, it would inevitably required a more complex rotor\nmechanical support arrangement and, thereby, compromise one\nof the attractive features of spherical actuators, viz. their rela-\ntive simplicity. Further, the use of a solid iron stator may com-\npromise the dynamic performance due to the influence of in-\nduced eddy currents, although this has not been considered in\nthis paper.\nACKNOWLEDGMENT\nThe authors are particularly grateful to J. Morrison and I.\nLyne for the design and manufacture of the test rig.\nREFERENCES\n[1] J. Wang, G. W. Jewell, and D. Howe, “A novel spherical actuator: Design\nand control,” IEEE Trans. Magn., vol. 33, pp. 4209–4211, Sept. 1997.\n[2] , “Analysis of a spherical permanent magnet actuator,” J. Appl.\nPhys., vol. 81, no. 8, pp. 4266–4268, 1997.\n[3] , “Analysis, design and control of a novel spherical permanent\nmagnet actuator,” Proc. Inst. Elec. Eng.—Electric Power Applicat., vol.\n145, no. 1, pp. 61–71, 1998.\n[4] J. Wang, W. Wang, G. W. Jewell, and D. Howe, “A novel spherical per-\nmanent magnet actuator with three degrees-of-freedom,” IEEE Trans.\nMagn., vol. 34, pp. 2078–2080, July 1998.\n[5] W. Wang, J. Wang, G. W. Jewell, and D. Howe, “Analysis, design and\ncontrol of a novel spherical permanent magnet actuator with three de-\ngrees-of-freedom,” IEEE\/ASME Trans. Mechatron., submitted for pub-\nlication.\n[6] J. Wang, G. W. Jewell, and D. Howe, “Modeling of a novel spherical\npermanent magnet actuator,” in Proc. IEEE Int. Conf. Robotics and Au-\ntomation, Albuquerque, NM, Apr. 1997, pp. 1190–1196.\n[7] Ansys User’s Manual, vol. 3 (Elements)—Section 4.96, Ansys Inc.,\nCanonsburg, PA.\n"}