{"doi":"10.1007\/s10750-010-0397-2","coreId":"53661","oai":"oai:nora.nerc.ac.uk:12917","identifiers":["oai:nora.nerc.ac.uk:12917","10.1007\/s10750-010-0397-2"],"title":"Invasive fish species in the largest lakes of Scotland, Northern Ireland, Wales and England:  the collective U.K. experience","authors":["Winfield, I.J.","Fletcher, J.M.","James, J.B."],"enrichments":{"references":[{"id":871997,"title":"1899. The English Lake District Fisheries.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":871352,"title":"A Global Strategy on Invasive Alien Species. International Union for Conservation of Nature and Natural Resources,","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":865746,"title":"A neutral terminology to define ‘invasive’ species.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":869539,"title":"Assessment of long-term changes in habitat availability for Arctic charr (Salvelinus alpinus) in a temperate lake using oxygen profiles and hydroacoustic surveys.","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":867655,"title":"Bream (Abramis brama), a new fish species confirmed in Loch Lomond.","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":867219,"title":"Changes in reproductive strategy in the ruffe during a period of establishment in a new habitat.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":866774,"title":"Coarse fish and fishery management in Northern Ireland.","authors":[],"date":"1973","doi":null,"raw":null,"cites":null},{"id":871762,"title":"Cormorant (Phalacrocorax carbo [L]) populations and patterns of abundance at breeding and feeding sites in Northern Ireland, with particular reference to Lough Neagh. Hydrobiologia","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":873851,"title":"Ecological studies of the fish community. In","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":874850,"title":"Feeding ecology of the diving ducks pochard (Aythya ferina), tufted duck (A. fuligula), scaup (A. marila) and goldeneye (Bucephala clangula) overwintering on Lough Neagh,","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":872827,"title":"First record of the carp, Cyprinus carpio L., in the Lough Neagh catchment (Northern Ireland).","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":875722,"title":"Gwyniad translocation project: Phase One – A condition assessment of the potential donor population in Llyn Tegid.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":873814,"title":"Interactions between the roach, Rutilus rutilus, and waterfowl populations of Lough Neagh,","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":876472,"title":"Long-term case histories of ruffe (Gymnocephalus cernuus) introductions to four U.K. lakes containing native vendace (Coregonus albula) or whitefish (C. lavaretus) populations.","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":877883,"title":"Northern pike (Esox lucius) in a warming lake: changes in population size and individual condition in relation to prey abundance.","authors":[],"date":"2008","doi":"10.1007\/s10750-007-9264-1","raw":null,"cites":null},{"id":872428,"title":"Notes on the introduction of some freshwater fish into Ireland.","authors":[],"date":"1950","doi":null,"raw":null,"cites":null},{"id":874321,"title":"Possible competitive interactions between overwintering tufted duck (Aythya fuligula (L.)) and fish populations of Lough Neagh, Northern Ireland: evidence from diet studies.","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":863496,"title":"Powan, Coregonus lavaretus (L.), ova predation by newly introduced ruffe,","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":865284,"title":"Public attitudes to the management of invasive nonnative species in Scotland.","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":875304,"title":"Recent introductions of the ruffe (Gymnocephalus cernuus) to three United Kingdom lakes containing Coregonus species.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":876194,"title":"SCM of fish in standing waters (Phase II). Unpublished report.","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":877003,"title":"SCM of fish in standing waters 2007\/2008 (Phase I). Unpublished report.","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":863076,"title":"Shift in pike, Esox lucius (L.), predation pressure following the introduction of ruffe, Gymnocephalus cernuus (L.) to Loch Lomond.","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":877422,"title":"The Arctic charr (Salvelinus alpinus) populations of Windermere, U.K.: population trends associated with eutrophication, climate change and increased abundance of roach (Rutilus rutilus).","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":869052,"title":"The climate of the United Kingdom and recent trends. Met Office Hadley Centre,","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":871186,"title":"The dietary response of otters (Lutra lutra) to introduced ruffe (Gymnocephalus cernuus) in Loch Lomond,","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":870500,"title":"The ecology and conservation of the fish of Llyn Tegid. In","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":863939,"title":"The fish community of Loch Lomond: its history and its rapidly changing status.","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":870035,"title":"The fish of Lough Neagh, Part A: A historical and taxonomic perspective of the fish fauna of Lough Neagh. In","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":868591,"title":"The Irish pollan, Coregonus autumnalis: options for its conservation.","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":864887,"title":"The occurrence of rudd (Scardinius erythrophthalmus) in Llyn Tegid.","authors":[],"date":"1977","doi":null,"raw":null,"cites":null},{"id":868125,"title":"The occurrence of silver bream (Blicca bjoerkna (L.)) in Llyn Tegid.","authors":[],"date":"1979","doi":null,"raw":null,"cites":null},{"id":864425,"title":"The Response of a Grey Heron Ardea cinerea Breeding Colony to Rapid Change in Prey Species.","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":870897,"title":"The Windermere perch and pike project.","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":873398,"title":"Threats to the lake fish communities of the U.K. arising from eutrophication and species introductions.","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":866293,"title":"To be, or not to be, a non-native freshwater fish.","authors":[],"date":"2005","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011","abstract":"An invasive species is defined as an alien (or introduced or non-native) species whose establishment and spread threaten ecosystems, habitats or species with harm. Such threats to UK lake fish communities have long been appreciated and this review assembles case histories, including new data, from the largest lakes of Scotland, Northern Ireland, Wales and England to examine the hypothesis that at least some of these introductions have become invasive. Loch Lomond in Scotland has experienced six introductions [chub (Leuciscus cephalus), common bream (Abramis brama), crucian carp (Carassius carassius), dace (Leuciscus leuciscus), gudgeon (Gobio gobio) and ruffe (Gymnocephalus cernuus)], of which the most significant has been that of the percid ruffe, which has been implicated in a recent decline of the native coregonid whitefish (Coregonus lavaretus). In Northern Ireland, the introduction of the cyprinid roach (Rutilus rutilus) to Lough Neagh has apparently had a negative impact on some overwintering waterfowl, although the native coregonid pollan (Coregonus autumnalis) remains abundant. Llyn Tegid in Wales has received three introductions [rudd (Scardinius erythrophthalmus), ruffe and silver bream (Blicca bjoerkna)], although no impacts on the native whitefish or other fish populations have been observed. In England, individuals of at least 12 native and non-native fish species have been brought to Windermere for the purpose of live-baiting, although only those of the cyprinids roach and common bream have established abundant populations. At the same time, the native salmonid Arctic charr (Salvelinus alpinus) has declined markedly while the native esocid pike (Esox lucius) has shown changes in abundance, distribution and individual condition, although these developments have not been shown to be causally linked. None of these introductions were sanctioned by appropriate fisheries or other regulatory bodies and almost all of them probably arose from the release or escape of live-bait used by pike anglers. Of the 10 species introductions documented here, four (common bream, gudgeon, roach and ruffe) have established abundant populations and two of these (roach and ruffe) have apparently caused or currently threaten harm, supporting the hypothesis that at least some of these introductions have become invasive","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/53661.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/12917\/1\/N012917PP.pdf","pdfHashValue":"e1d37ed69886bbca87bab7abd39a7550c5230bfa","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:12917<\/identifier><datestamp>\n      2012-11-22T12:19:16Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/12917\/<\/dc:relation><dc:title>\n        Invasive fish species in the largest lakes of Scotland, Northern Ireland, Wales and England:  the collective U.K. experience<\/dc:title><dc:creator>\n        Winfield, I.J.<\/dc:creator><dc:creator>\n        Fletcher, J.M.<\/dc:creator><dc:creator>\n        James, J.B.<\/dc:creator><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        An invasive species is defined as an alien (or introduced or non-native) species whose establishment and spread threaten ecosystems, habitats or species with harm. Such threats to UK lake fish communities have long been appreciated and this review assembles case histories, including new data, from the largest lakes of Scotland, Northern Ireland, Wales and England to examine the hypothesis that at least some of these introductions have become invasive. Loch Lomond in Scotland has experienced six introductions [chub (Leuciscus cephalus), common bream (Abramis brama), crucian carp (Carassius carassius), dace (Leuciscus leuciscus), gudgeon (Gobio gobio) and ruffe (Gymnocephalus cernuus)], of which the most significant has been that of the percid ruffe, which has been implicated in a recent decline of the native coregonid whitefish (Coregonus lavaretus). In Northern Ireland, the introduction of the cyprinid roach (Rutilus rutilus) to Lough Neagh has apparently had a negative impact on some overwintering waterfowl, although the native coregonid pollan (Coregonus autumnalis) remains abundant. Llyn Tegid in Wales has received three introductions [rudd (Scardinius erythrophthalmus), ruffe and silver bream (Blicca bjoerkna)], although no impacts on the native whitefish or other fish populations have been observed. In England, individuals of at least 12 native and non-native fish species have been brought to Windermere for the purpose of live-baiting, although only those of the cyprinids roach and common bream have established abundant populations. At the same time, the native salmonid Arctic charr (Salvelinus alpinus) has declined markedly while the native esocid pike (Esox lucius) has shown changes in abundance, distribution and individual condition, although these developments have not been shown to be causally linked. None of these introductions were sanctioned by appropriate fisheries or other regulatory bodies and almost all of them probably arose from the release or escape of live-bait used by pike anglers. Of the 10 species introductions documented here, four (common bream, gudgeon, roach and ruffe) have established abundant populations and two of these (roach and ruffe) have apparently caused or currently threaten harm, supporting the hypothesis that at least some of these introductions have become invasive.<\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2011<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/12917\/1\/N012917PP.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Winfield, I.J.; Fletcher, J.M.; James, J.B..  2011  Invasive fish species in the largest lakes of Scotland, Northern Ireland, Wales and England: the collective U.K. experience.   Hydrobiologia, 660. 93-103.  https:\/\/doi.org\/10.1007\/s10750-010-0397-2 <https:\/\/doi.org\/10.1007\/s10750-010-0397-2>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.springerlink.com\/content\/y016q5k8704u4827\/<\/dc:relation><dc:relation>\n        10.1007\/s10750-010-0397-2<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/12917\/","http:\/\/www.springerlink.com\/content\/y016q5k8704u4827\/","10.1007\/s10750-010-0397-2"],"year":2011,"topics":["Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":" 1\nInvasive fish species in the largest lakes of Scotland, Northern Ireland, Wales \nand England:  the collective U.K. experience \n \nWinfield, I. J.*, Fletcher, J. M. & James, J. B. \n \nCentre for Ecology & Hydrology, Lancaster Environment Centre, Library Avenue, \nBailrigg, Lancaster LA1 4AP, U.K. \n \n* Author for correspondence.  E-mail ijw@ceh.ac.uk \n \nKey words:  Species introductions, alien species, Loch Lomond, Lough Neagh, Llyn \nTegid, Windermere. \n \nThis paper has not been submitted elsewhere in identical or similar form, nor will it be \nduring the first three months after its submission to Hydrobiologia. \n \nAbstract \n \nAn invasive species is defined as an alien (or introduced or non-native) species whose \nestablishment and spread threaten ecosystems, habitats or species with harm.  Such \nthreats to U.K. lake fish communities have long been appreciated and this review \nassembles case histories, including new data, from the largest lakes of Scotland, \nNorthern Ireland, Wales and England to examine the hypothesis that at least some of \nthese introductions have become invasive.  Loch Lomond in Scotland has experienced \nsix introductions (chub (Leuciscus cephalus), common bream (Abramis brama), \n 2\ncrucian carp (Carassius carassius), dace (Leuciscus leuciscus), gudgeon (Gobio \ngobio) and ruffe (Gymnocephalus cernuus)), of which the most significant has been \nthat of the percid ruffe, which has been implicated in a recent decline of the native \ncoregonid whitefish (Coregonus lavaretus).  In Northern Ireland, the introduction of \nthe cyprinid roach (Rutilus rutilus) to Lough Neagh has apparently had a negative \nimpact on some overwintering waterfowl, although the native coregonid pollan \n(Coregonus autumnalis) remains abundant.  Llyn Tegid in Wales has received three \nintroductions (rudd (Scardinius erythrophthalmus), ruffe and silver bream (Blicca \nbjoerkna)), although no impacts on the native whitefish or other fish populations have \nbeen observed.  In England, individuals of at least 12 native and non-native fish \nspecies have been brought to Windermere for the purpose of live-baiting, although \nonly those of the cyprinids roach and common bream have established abundant \npopulations.  At the same time, the native salmonid Arctic charr (Salvelinus alpinus) \nhas declined markedly while the native esocid pike (Esox lucius) has shown changes \nin abundance, distribution and individual condition, although these developments \nhave not been shown to be causally linked.  None of these introductions were \nsanctioned by appropriate fisheries or other regulatory bodies and almost all of them \nprobably arose from the release or escape of live-bait used by pike anglers.  Of the 10 \nspecies introductions documented here, four (common bream, gudgeon, roach and \nruffe) have established abundant populations and two of these (roach and ruffe) have \napparently caused or currently threaten harm, supporting the hypothesis that at least \nsome of these introductions have become invasive. \n \nIntroduction \n \n 3\nThe Global Invasive Species Programme global strategy on invasive alien species \n(McNeely et al., 2001) defines alien species as ‘a species, subspecies, or lower taxon \nintroduced outside its normal past or present distribution’ and invasive alien species \nas ‘an alien species whose establishment and spread threaten ecosystems, habitats or \nspecies with economic or environmental harm’.  Alien species are also frequently \nreferred to in the literature as introduced or non-native species with slightly varying \naccompanying definitions (see Colautti & MacIsaac, 2004), but for those species \nconsidered to be invasive there are two clear common defining elements of \n‘introduced’ and ‘harm’. \nDetermining that a species has been introduced is relatively easy in theory, \nalthough in practise it is rather more complex given frequently limited historical data \nand complex conceptual issues as reviewed by Copp et al. (2005).  Showing that an \nintroduced species is threatening or actually causing harm is even more difficult, \ngiven that this can include both direct and indirect interactions which to be \ndemonstrated require extensive and quantitative studies.  For the fauna and flora of \nlarge lakes, such difficulties are usually further exacerbated by considerable sampling \nchallenges. \nThreats arising from species introductions to the depauparate lake fish \ncommunities within the collection of islands known as the U.K. have long been \nappreciated (Winfield, 1992) and have recently been shown to be due in large part to \nthe use of live bait by anglers fishing for pike (Esox lucius) (Winfield et al., 2007).  \nRecipient lakes include the largest standing water body of each of the four component \ncountries of the U.K., which together present a diverse array of environmental \nconditions (e.g. altitude 4 to 158 m, surface area 415 to 38,179 ha, mean depth 9 to 37 \n 4\nm, and oligotrophic to eutrophic conditions (see below)) completely or largely free of \nfisheries impacts. \nThis review brings together the fish introduction histories of the largest lakes \nof Scotland (Loch Lomond), Northern Ireland (Lough Neagh), Wales (Llyn Tegid \nalso known as Bala Lake) and England (Windermere), together with new data where \navailable, in order to present the collective U.K. experience of this major \nenvironmental threat.  Specifically, by analysing temporal trends in native and \nintroduced fish species to look for decreases in the former coinciding with increases \nin the latter, the hypothesis is examined that at least some of these introductions have \nbecome invasive. \n \nLoch Lomond \n \nLoch Lomond is situated (56°7' N, 4°37' W; altitude 4 m) in the Loch Lomond & The \nTrossachs National Park of west-central Scotland (Fig. 1).  It comprises an \noligotrophic north basin (surface area: 2,280 ha, mean depth: 140 m), a mesotrophic \nmid basin (surface area: 1,410 ha, mean depth: 60 m) and a eutrophic south basin \n(surface area: 3,350 ha, mean depth: 27 m). \nThe fish community of Loch Lomond has been better documented than that of \nany other water body in Scotland, with many findings reviewed by Adams (1994) \nwho noted a native fish community composed of 15 species including the nationally \nimportant whitefish (known locally as powan) (Coregonus lavaretus).  This species \nnumber is higher than for any other loch and is due in part to the diverse nature of the \nloch’s three basins.  However, Adams (op. cit.) also reviewed a series of post-1970 \nfish species introductions, including the first records of gudgeon (Gobio gobio) in \n 5\n1981, ruffe (Gymnocephalus cernuus) in 1982, dace (Leuciscus leuciscus) in 1987, \nchub (Leuciscus cephalus) in 1987, and crucian carp (Carassius carassius) in 1991.  \nAdams (op. cit.) noted that gudgeon were deliberately introduced to a pond in the \nloch’s catchment from which they made their way into the river system and thus the \nloch itself, whereas he considered that the other four introduced species probably \narrived as discarded live-bait of pike anglers.  Subsequently, Etheridge & Adams \n(2008) reported the first common bream (Abramis brama) in the loch in 2006. \nOf all of the above introductions, that of the ruffe has been the most dramatic \nand the most concerning.  Adams (1994) reported a survey of the fish community in \n1988 and 1989 that found the native whitefish still dominating at 40% by numbers, \nbut the ruffe comprising 24%.  Adams & Tippett (1991) calculated that at that time \nruffe accounted for 64% of whitefish egg predation, whereas its subsequent increased \nabundance has been reflected in changes in the diets of the loch’s major piscivores \npike (Adams, 1991), great cormorant (Phalacrocorax carbo) (Adams, 1994), grey \nheron (Ardea cinerea) (Adams & Mitchell, 1995) and Eurasian otter (Lutra lutra) \n(McCafferty, 2005).  Changes in the reproductive strategy of the ruffe population with \nthis increasing abundance, i.e. changes in size at maturity and size-related fecundity, \nsuggest that food resources have become limiting (Devine et al., 2000).  In turn, this \nsituation increases the likelihood of significant harm occurring to the native fish \ncommunity. \nMore recent and methodologically consistent surveys of Loch Lomond’s fish \ncommunity in inshore, offshore bottom and offshore surface habitats in 2004 \n(Winfield et al., 2006) and 2007 (Winfield et al., 2008a) found that the relative \nnumerical contribution of whitefish to the fish community declined markedly (χ2 = \n12.110, df = 1, P < 0.001) while that of the ruffe increased (χ2 = 42.069, df = 1, P < \n 6\n0.001) (Fig. 2).  In addition, the cyprinid roach (Rutilus rutilus) showed no significant \nchange in relative abundance over the same time period (χ2 = 0.054, df = 1, P > 0.10).  \nThis latter finding is notable because although this species has been introduced to \nother large lakes in the U.K., Adams (op. cit.) considers it to be native to Loch \nLomond. \n \nLough Neagh \n \nLough Neagh is situated (54°37' N, 6°25' W; altitude 10 m) in central Northern \nIreland (Fig. 1).  It comprises a single eutrophic basin (surface area: 38,179 ha, mean \ndepth: 9 m) that has been strongly impacted by cultural eutrophication.  Unique for \nthe U.K., the lough supports commercial fisheries for European eel (Anguilla \nanguilla), Eurasian perch (Perca fluviatilis) (hereafter referred to as perch) and the \nnationally important pollan (Coregonus autumnalis). \nIn a review of the fish community, Kennedy & Vickers (1993) noted that \nalthough 21 species had been recorded, a paucity of historical data made the \ndetermination of their native or introduced status generally difficult.  However, the \nroach is a notable exception because Went (1950) described its introduction to Ireland \nas live-bait in 1889 and Cragg-Hine (1973) reported its first record in the Lough \nNeagh catchment in 1970.  In addition, in 1989 Winfield & Bean (1991) found a \nsingle common carp (Cyprinus carpio) in a small lake connected to Lough Neagh, \nalthough this species has not subsequently been recorded from the latter location (C. \nHarrod, Queen’s University Belfast, pers. comm.). \n In contrast, the roach population of Lough Neagh rapidly increased in \ndistribution and abundance such that by the 1980s it had become a major component \n 7\nof the lough’s fish community (Winfield et al., 1993).  During the same decade, the \ndiets of the roach and nationally important overwintering tufted duck (Aythya \nfuligula) populations were found to show a high degree of overlap due to the common \nconsumption of the mollusc Valvata piscinalis (Winfield & Winfield, 1994a; Winfield \n& Winfield, 1994b).  Moreover, although the overwintering population of the \npiscivorous great crested grebe (Podiceps cristatus) had shown a positive relationship \nwith increased roach abundance and Warke et al. (1994) considered that the increase \nin this cyprinid was causally related to an increase in cormorants in the area, roach \nabundance also showed a negative relationship with the numbers of overwintering \ntufted duck (Winfield et al., 1992).  More recently, in a consideration of threats facing \nthe pollan Harrod et al. (2001) noted possible food competition with roach.  However, \nsubsequent extensive sampling between 2006 and 2009 has shown that both species \ncontinue to form major components of the Lough Neagh fish community (C. Harrod, \nQueen’s University Belfast, pers. comm.). \n \nLlyn Tegid \n \nLlyn Tegid is situated (52°53' N, 3°37' W; altitude 158 m) in the Snowdonia National \nPark of north Wales (Fig. 1).  It comprises a single eutrophic basin (surface area: 415 \nha, mean depth: 24 m) that has been impacted to some degree by cultural \neutrophication. \nIn a review of studies on the fish community, Leah (2003) noted that a total of \n16 fish species had been recorded including native populations of both salmonids and \ncyprinids and the nationally important whitefish (known locally as gwyniad) \n(Coregonus lavaretus).  He also suggested a possible long-term decline in growth and \n 8\nlongevity of the whitefish, although early studies suffered from age determination \nproblems, and he referred to unpublished semi-quantitative hydroacoustics data, \nwhich suggested no change in population density or distribution of this species \nbetween the 1960s and 1990s.  Leah (op. cit.) also considered that introductions of \nrudd (Scardinius erythrophthalmus) and silver bream (Blicca bjoerkna), documented \nby Andrews (1977) and Grainger (1979) respectively, had probably arrived as live-\nbait in the 1970s.  More notably, Leah (op. cit.) also reported that ruffe was first \nrecorded in 1980 after which it increased rapidly in abundance between 1983 and \n1992.  At the same time, the native perch population declined, but this was considered \nprobably to be due not to any interaction but to an ulcerative disease that had been \nresponsible for perch declines elsewhere in the U.K. at that time.  Leah (op. cit.) also \nreferred to unpublished records and notes showing that roach have been present in \nsignificant numbers since at least the start of scientific studies in approximately 1939 \nand that perch and pike had both been culled by fishery managers in earlier decades. \nAmong the three species introductions described above, only that of ruffe has \nresulted in a significant change to the composition of the fish community in inshore \nand offshore habitats (Fig. 3).  By 1991 (Winfield et al., 1996), this percid comprised \na numerically substantial component and continued to do so in 2003 (Winfield et al., \n2003) although its relative numerical contribution to the fish community had \ndecreased over the intervening period (χ2 = 63.643, df = 1, P < 0.001).  In contrast, \nneither whitefish (χ2 = 0.060, df = 1, P > 0.10) nor the at least long-established and \npossibly native roach (χ2 = 0.576, df = 1, P > 0.10) showed any significant relative \nchange over the same period. \n \nWindermere \n 9\n \nWindermere is situated (54°21' N, 2°56' W; altitude 39 m) in the Lake District \nNational Park of north-west England (Fig. 1).  It comprises a mesotrophic north basin \n(surface area: 805 ha, mean depth: 25 m) and a eutrophic south basin (surface area: \n672 ha, mean depth: 17 m), although nutrient levels in both basins have long histories \nof change as a result of cultural eutrophication and its management. \nThe fish community of Windermere, which comprises 16 species including the \nnationally important Arctic charr (Salvelinus alpinus), is undoubtedly the best studied \nlake fish community in the U.K.  Much of the resulting extensive literature of the \nprevious century was reviewed by Le Cren (2001), with many of the more recent \nstudies being reviewed and extended by Winfield et al. (2008b) and Winfield et al. \n(2008c) which focussed on its Arctic charr and pike populations, respectively.  In \naddition, Winfield & Durie (2004) reviewed the history of fish species introductions \nin Windermere and nearby lakes, to which individuals of a total of 12 native (brown \ntrout (Salmo trutta), European minnow (Phoxinus phoxinus), perch, pike) and non-\nnative (common bream, crucian carp, dace, grayling (Thymallus thymallus), rainbow \ntrout (Oncorhynchus mykiss), roach, rudd and tench (Tinca tinca)) fish species are \nknown to have been brought for the purpose of live-baiting.  Given these recent \nextensive reviews, the present review will be largely restricted to the species \nintroductions of roach and common bream. \n Watson (1899) contains the first published reference to roach in Windermere, \nnoting that the species was first seen in the late 1890s following its apparent \nintroduction by visiting anglers live-baiting for pike.  He also remarked that common \nbream was absent from the area.  Roach subsequently remained a scarce and spatially \nrestricted component of the fish community throughout almost all of the extensive \n 10\nresearch reviewed by Le Cren (2001), which included a period of marked \neutrophication in the lake’s south basin.  It was only in the 1990s, when the water \ntemperature of Windermere showed a significant and sustained increase (Winfield et \nal., 2008b), that roach numbers started to increase.  Periodic sampling of the fish \ncommunities of the two basins showed that by the early 2000s roach had become \nsignificant components of the fish communities of inshore and offshore surface \nhabitats (Winfield et al., 2008b). \nAdditional and more consistent temporal information on roach, common \nbream and the native salmonids Arctic charr and brown trout in Windermere is \navailable from long-term sampling of the lake’s pike population conducted since the \n1940s and described in detail by Winfield et al. (2008c).  In addition to adult pike \ncaught by the 64 mm bar mesh gill nets used in this programme, large roach, common \nbream, Arctic charr and brown trout in excess of 300 mm fork length are also sampled.  \nFor these two cyprinids and two salmonids, such size selection is very strongly biased \nto only the largest and oldest members of the populations.  The first roach and \ncommon bream taken in this way were both recorded in 1999 in the lake’s south basin, \nwith the first records of roach and common bream in the north basin not occurring \nuntil 2005 and 2009, respectively.  Temporal trends in these records expressed as \ncatch-per-unit-effort (CPUE) from 1990 to 2009, together with corresponding patterns \nfor Arctic charr and brown trout, are given in Fig. 4.  In the north basin, neither roach \n(ANOVA, F = 0.905, df = 19, P > 0.10), common bream (ANOVA, F = 3.000, df = \n19, P > 0.10), nor brown trout (ANOVA, F = 0.021, df = 19, P > 0.10) have shown \nany significant trend, but Arctic charr has shown a significant decline (ANOVA, F = \n16.078, df = 19, P < 0.001).  In contrast, significant changes have occurred for all \nspecies in the south basin where roach (ANOVA, F = 4.612, df = 19, P < 0.05), \n 11\ncommon bream (ANOVA, F = 11.312, df = 19, P < 0.01) and brown trout (ANOVA, \nF = 4.091, df = 19, P = 0.05822) have increased and Arctic charr (ANOVA, F = 8.808, \ndf = 19, P < 0.01) have decreased. \nA correlation analysis for each permutation of native species, introduced \nspecies and lake basin is presented in Table 1, with data for native species augmented \nby time series for pike from the same gill-netting programme and for perch from a \nperch-specific trapping programme (see Winfield et al., 2008c).  As expected from the \ntemporal trends, no correlations were significant in the north basin.  However, in the \nsouth basin there were three significant correlations;  a positive correlation between \ncommon bream and perch, a negative correlation between roach and Arctic charr, and \na positive correlation between roach and brown trout.  In addition, over the same time \nperiod common bream and roach showed no correlation in the north basin (Kendall \nrank correlation, τ = -0.053, P > 0.10) but a positive one in the south basin (τ = \n+0.416, P < 0.01),  Arctic charr and brown trout showed no correlation in the north \nbasin (τ = +0.198, P > 0.10) but a negative one in the south basin (τ = -0.318, p < \n0.05), and Arctic charr and pike showed no correlation in the north basin (τ = -0.097, \nP > 0.10) but a negative one in the south basin (τ = -0.105, P > 0.10). \nThe above trend and correlation analyses are necessarily simple and \nconsiderably restricted by available data.  For example, they consider only changes in \nfish CPUE as a surrogate for abundance when in fact it is known that the pike \npopulation has also shown recent marked changes in distribution and individual \ncondition (Winfield et al., 2008c).  Other species may also have shown changes in \nthese population features.  In addition, the analyses do not take into account \nenvironmental factors such as the deoxygenation of Windermere’s deep water (Jones \net al., 2008) which is likely to have differential effects on different components of the \n 12\nfish community.  Perhaps most importantly, such analyses can only demonstrate \nassociation and not causality and so the construction of an elaborate interpretation of \nthe observed relationships would be premature at this time.  Nevertheless, they show \nthat the recent marked expansion of roach and common bream in the south basin of \nWindermere has been accompanied by a decrease in the abundance of Arctic charr.  \nFurthermore, they suggest that colonisation of the less eutrophic north basin is simply \nat an earlier stage and may develop in the same way as events in the south basin, \nalthough the ability of all of the major fish species to migrate between the basins \nfurther complicates the situation.  The causalities of these marked population changes \ncurrently remain under study. \n \nCross-lake synthesis \n \nThis review has brought together case histories from the largest standing water body \nof each of the four component countries of the U.K., which together present a diverse \narray of environmental conditions (e.g. altitude 4 to 158 m, surface area 415 to 38,179 \nha, mean depth 9 to 37 m, and oligotrophic to eutrophic conditions).  Furthermore, \nand uniquely in a European context, each water body is completely or largely free \nfrom fisheries impacts which greatly simplifies the interpretation of observations in \nthe context of invasive species. \n The above sections of this review were presented using a simple lake-specific \nframework and with the exceptions of Winfield (1992), Winfield et al. (1996), \nWinfield & Durie (2004) and Winfield et al. (2007), cross-lake syntheses are largely \nabsent from the U.K. lake fish introduction literature.  This scarcity reflects both the \nhistorically and geographically limited nature of lake fish community monitoring in \n 13\nthe U.K. and the conceptual difficulty of drawing robust lessons from the study of one \naspect of a number of diverse and complex lacustrine ecosystems.  Nevertheless, \nsome attempt will be made here to offer a cross-lake synthesis of the present findings. \nThe most striking observation from all four study lakes is that none of the \nrecorded fish introductions were sanctioned by appropriate fisheries or other \nregulatory bodies and almost all of them probably arose from the release or escape of \nlive-bait used by anglers fishing for pike.  This common agency of introduction in \nturn probably contributed to the common taxonomic composition of the introductions, \ni.e. a strong dominance of cyprinids in general and roach in particular.  The frequent \nintroduction of the percid ruffe through live-baiting may be unexpected given that the \nhighly spined and cryptic nature of this species presumably make it a relatively \nunattractive prey for pike, but it is extremely robust which facilitates its easy transport \nby anglers using just simple containers (Winfield & Durie, 2004).  To some degree, \nall four study lakes also share a common taxonomy of their native communities in the \nform of substantial components of coregonids, i.e. whitefish, or salmonids, i.e. Arctic \ncharr and brown trout.  Consequently, in each lake a native salmonid-containing \nassemblage has met with an introduced cyprinid-containing assemblage. \nThis contrasting taxonomy of natives and invaders is accompanied by \ncontrasting environmental requirements of the two groups, with the native salmonids \nthriving in oligotrophic and cold conditions and the invading cyprinids preferring \nmore eutrophic and warmer surroundings.  Thus, any movement towards the latter \nconditions as a result of cultural eutrophication and\/or climate change is likely to \naccelerate the development and potentially ultimate dominance of introduced \ncyprinids.  For example, had Lough Neagh not been subjected to extreme \neutrophication and had instead retained its original conditions which once supported \n 14\nArctic charr (Kennedy & Vickers, 1993), then its waters may not have become \ndominated by introduced roach.  However, eutrophication alone does not necessarily \ninduce an expansion of introduced roach as shown by the case history of Windermere.  \nIn this lake, significant nutrient enrichment of its south basin and a more limited \nenrichment of its north basin during the middle part of the last century did not result \nin any significant population increase.  Such expansion only occurred in the last \ndecade of the previous century after water temperatures increased, although it has \nbeen both more pronounced and more rapid in the more eutrophic south basin.  The \nhistory of Windermere also shows that an introduced population can withstand a \nprolonged period of relatively inhospitable conditions, before increasing dramatically \nwhen conditions become more suitable.  Further increases in temperatures in the U.K. \nresulting from climate change (see Jenkins et al., 2008) may ‘wake’ more currently \ndormant introduced fish populations, particularly in northern parts of the country. \n \nConclusion \n \nIntroductions of fish species have now occurred in all of the largest lakes of Scotland \n(Loch Lomond), Northern Ireland (Lough Neagh), Wales (Llyn Tegid) and England \n(Windermere).  None of these introductions were sanctioned by appropriate fisheries \nor other regulatory bodies and almost all of them probably arose from the release or \nescape of live-bait used by anglers fishing for pike.  Although some have been \nhistoric, the rate of new introductions has accelerated markedly in recent decades.  Of \nthe 10 introduced (or alien or non-native) species documented above, four of them \n(common bream, gudgeon, roach and ruffe) have established abundant populations.  \nAlthough causality has not been demonstrated, two of these species (roach and ruffe) \n 15\nhave apparently caused or currently threaten harm, supporting the hypothesis that at \nleast some of these introductions have become invasive.  Such apparently negative \neffects have been seen in three (Loch Lomond, Lough Neagh and Windermere) of the \nlargest lakes of each of the four component countries of the U.K.  As noted by Boon \n& Bean (in press), prevention is by far the most preferred management tool for \ninvasive species and for fish in large lakes it is effectively the only feasible option.  \nConsequently, formal consent is now required throughout the U.K. for fish species \nintroductions and live-baiting is banned on many lakes (Winfield & Durie, 2004).  \nHowever, such regulations need effective public support if they are to be successful \nand Bremner & Park (2007) observed that such help is greatest when individuals are \nwell informed.  Public awareness and education are crucial tools in the management \nof invasive species and environmental scientists must play their part in such activities. \n \nAcknowledgements \n \nWe thank Colin Bean of Scottish Natural Heritage, Cameron Durie of the \nEnvironment Agency and Rhian Thomas of the Countryside Council for Wales for \ntheir significant contributions to components of the work reviewed here.  We are also \ngrateful to Colin Adams and Elizabeth Etheridge of the University of Glasgow and \nChris Harrod of Queen’s University Belfast for helpful discussions concerning the \ncurrent situations at Loch Lomond and Lough Neagh, respectively.  We acknowledge \nthe Freshwater Biological Association for their joint stewardship of the Windermere \nlong-term data.  Major components of this work were funded by the Centre for \nEcology & Hydrology, Countryside Council for Wales, Environment Agency and \nScottish Natural Heritage. \n 16\n \nReferences \n \nAdams, C. E., 1991.  Shift in pike, Esox lucius (L.), predation pressure following the \nintroduction of ruffe, Gymnocephalus cernuus (L.) to Loch Lomond.  Journal of \nFish Biology 38:  663-667. \nAdams, C. E. & R. Tippett, 1991.  Powan, Coregonus lavaretus (L.), ova predation by \nnewly introduced ruffe, Gymnocephalus cernuus (L.), in Loch Lomond, \nScotland.  Aquaculture and Fisheries Management 22:  239-246. \nAdams, C. E., 1994.  The fish community of Loch Lomond: its history and its rapidly \nchanging status.  Hydrobiologia 290:  91-103. \nAdams, C. E. & J. Mitchell, 1995.  The Response of a Grey Heron Ardea cinerea \nBreeding Colony to Rapid Change in Prey Species.  Bird Study 42:  44-49. \nAndrews, C. R., 1977.  The occurrence of rudd (Scardinius erythrophthalmus) in Llyn \nTegid.  Nature in Wales 15:  31-50. \nBoon, P.J. & C. W. Bean, in press.  Freshwater non-native species - prevention, \ncontrol or eradication?  In Baxter, J. M. & C. A. Galbraith (eds), Species \nManagement: Challenges and Solutions for the 21st Century.  TSO Scotland, \nEdinburgh. \nBremner, A. & K. Park, 2007.  Public attitudes to the management of invasive non-\nnative species in Scotland.  Biological Conservation 139:  306-314. \nColautti, R. I. & H. J. MacIsaac, 2004.  A neutral terminology to define ‘invasive’ \nspecies.  Diversity and Distributions 10:  135-141. \nCopp, G. H., Bianco, P. G., Bogutskaya, N. G., Erős, T., Falka, I., Ferreira, M. T., Fox, \nM. G., Freyhof, J., Gozlan, R. E., Grabowska, J., Kováč, V., Moreno-Amich, R., \n 17\nNaseka, A. M., Peňáz, M., Povž, M., Przybylski, M., Robillard, M., Russell, I. \nC., Stakėnas, S., Šumer, S., Vila-Gispert, A. & C. Wiesner, 2005.  To be, or not \nto be, a non-native freshwater fish.  Journal of Applied Ichthyology 21:  242-\n262. \nCragg-Hine, D., 1973.  Coarse fish and fishery management in Northern Ireland.  \nProceedings of the 6th British Coarse Fish Conference.  University of Liverpool, \nLiverpool:  52-59. \nDevine, J. A., Adams, C. E. & P. S. Maitland, 2000.  Changes in reproductive strategy \nin the ruffe during a period of establishment in a new habitat.  Journal of Fish \nBiology 56:  1488-1496. \nEtheridge, E. C. & C. E. Adams, 2008.  Bream (Abramis brama), a new fish species \nconfirmed in Loch Lomond.  Glasgow Naturalist 25:  93-94. \nGrainger, R. C., 1979.  The occurrence of silver bream (Blicca bjoerkna (L.)) in Llyn \nTegid.  Nature in Wales 16:  250-251. \nHarrod, C., Griffiths, D., McCarthy, T. K. & R. Rosell, 2001.  The Irish pollan, \nCoregonus autumnalis:  options for its conservation.  Journal of Fish Biology 59 \n(Supplement A):  339-355. \nJenkins, G. J., Perry, M. C. & M. J. Prior, 2008.  The climate of the United Kingdom \nand recent trends. Met Office Hadley Centre, Exeter, U.K. 117 pp. \nJones, I. D., Winfield, I. J. & F. Carse, 2008.  Assessment of long-term changes in \nhabitat availability for Arctic charr (Salvelinus alpinus) in a temperate lake \nusing oxygen profiles and hydroacoustic surveys.  Freshwater Biology 53:  393-\n402. \nKennedy, G. J. A. & K. U. Vickers, 1993.  The fish of Lough Neagh, Part A:  A \nhistorical and taxonomic perspective of the fish fauna of Lough Neagh.  In \n 18\nWood, R. B. & R. V. Smith (eds), Lough Neagh.  Kluwer Academic Publishers, \nDordrecht:  381-395. \nLeah, R. T., 2003.  The ecology and conservation of the fish of Llyn Tegid.  In Gritten, \nR. H., Duigan, C. A. & H. Millband (eds), Llyn Tegid Symposium:  The \nEcology, Conservation and Environmental History of the Largest Natural Lake \nin Wales.  University of Liverpool, Liverpool:  115-138. \nLe Cren, E. D., 2001.  The Windermere perch and pike project.  Freshwater Forum \n15:  3–34. \nMcCafferty, D. J., 2005.  The dietary response of otters (Lutra lutra) to introduced \nruffe (Gymnocephalus cernuus) in Loch Lomond, Scotland.  Journal of Zoology \n266:  255-260. \nMcNeely, J. A., Mooney, H. A., Neville, L. E., Schei, P. & J. K. Waage (eds), 2001.  \nA Global Strategy on Invasive Alien Species.  International Union for \nConservation of Nature and Natural Resources, Gland.  50 pp. \nWarke, G. M. A., Day, K. R., Greer, J. E. & R. D. Davidson, 1994.  Cormorant \n(Phalacrocorax carbo [L]) populations and patterns of abundance at breeding \nand feeding sites in Northern Ireland, with particular reference to Lough Neagh.  \nHydrobiologia 279-280:  91-100. \nWatson, J., 1899.  The English Lake District Fisheries.  George Routledge and Sons \nLtd, London. \nWent, A. E. J., 1950.  Notes on the introduction of some freshwater fish into Ireland.  \nJournal of the Irish Department of Agriculture 47:  1-8. \nWinfield, I. J. & C. W. Bean, 1991.  First record of the carp, Cyprinus carpio L., in \nthe Lough Neagh catchment (Northern Ireland).  Journal of Fish Biology 38, \n629-630. \n 19\nWinfield, I. J., 1992.  Threats to the lake fish communities of the U.K. arising from \neutrophication and species introductions.  Netherlands Journal of Zoology 42:  \n233-242. \nWinfield, I. J., Winfield, D. K. & C. M. Tobin, 1992.  Interactions between the roach, \nRutilus rutilus, and waterfowl populations of Lough Neagh, Northern Ireland.  \nEnvironmental Biology of Fishes 33:  207-214. \nWinfield, I. J., Tobin, C. M. & C. R. Montgomery, 1993.  Ecological studies of the \nfish community.  In Wood, R. B. & R. V. Smith (eds), Lough Neagh.  Kluwer \nAcademic Publishers, Dordrecht:  451-471. \nWinfield, D. K. & I. J. Winfield, 1994a.  Possible competitive interactions between \noverwintering tufted duck (Aythya fuligula (L.)) and fish populations of Lough \nNeagh, Northern Ireland:  evidence from diet studies.  Hydrobiologia 279\/280:  \n377-386. \nWinfield, I. J. & D. K. Winfield, 1994b.  Feeding ecology of the diving ducks pochard \n(Aythya ferina), tufted duck (A. fuligula), scaup (A. marila) and goldeneye \n(Bucephala clangula) overwintering on Lough Neagh, Northern Ireland.  \nFreshwater Biology 32:  467-477. \nWinfield, I. J., Fletcher, J. M. & P. R. Cubby, 1994.  Status of Rare Fish, Project \nRecord Volume 1.  Unpublished report.  National Rivers Authority, Bristol.  244 \npp. \nWinfield, I. J., Adams, C. E. & J. M. Fletcher, 1996.  Recent introductions of the ruffe \n(Gymnocephalus cernuus) to three United Kingdom lakes containing Coregonus \nspecies.  Annales Zoologici Fennici 33:  459-466. \nWinfield, I. J., Fletcher, J. M. & J. B. James, 2003.  Gwyniad translocation project:  \nPhase One – A condition assessment of the potential donor population in Llyn \n 20\nTegid.  CCW Contract Science Report No. 597. Countryside Council for Wales, \nBangor.  52 pp. \nWinfield, I. J. & N. C. Durie, 2004.  Fish introductions and their management in the \nEnglish Lake District.  Fisheries Management and Ecology 11:  1-7. \nWinfield, I. J., Fletcher, J. M. & J. B. James, 2006.  SCM of fish in standing waters \n(Phase II).  Unpublished report.  Scottish Natural Heritage, Clydebank.  40 pp. \nWinfield, I. J., Fletcher, J. M. James, J. B., Duigan, C., Bean, C. W. & N. C. Durie, \n2007.  Long-term case histories of ruffe (Gymnocephalus cernuus) introductions \nto four U.K. lakes containing native vendace (Coregonus albula) or whitefish (C. \nlavaretus) populations.  Advances in Limnology 60:  301-309. \nWinfield, I. J., Fletcher, J. M. & J. B. James, 2008a.  SCM of fish in standing waters \n2007\/2008 (Phase I).  Unpublished report.  Scottish Natural Heritage, \nClydebank.  36 pp. \nWinfield, I. J., Fletcher, J. M. & J. B. James, 2008b.  The Arctic charr (Salvelinus \nalpinus) populations of Windermere, U.K.:  population trends associated with \neutrophication, climate change and increased abundance of roach (Rutilus \nrutilus).  Environmental Biology of Fishes 83:  25-35. \nWinfield, I. J., James, J. B. & J. M. Fletcher, 2008c.  Northern pike (Esox lucius) in a \nwarming lake:  changes in population size and individual condition in relation to \nprey abundance.  Hydrobiologia 601:  29-40. \n \n 21\nFigure Captions \n \nFigure 1.  The approximate locations of the study sites of Loch Lomond (Scotland), \nLough Neagh (Northern Ireland), Llyn Tegid (Wales) and Windermere (England) \nwithin the U.K. \n \nFigure 2.  Fish community compositions for inshore, offshore bottom and offshore \nsurface habitats of Loch Lomond in 2004 (N = 135 fish, closed bars) and 2007 (N = \n321 fish, open bars).  Redrawn from Winfield et al. (2006) and Winfield et al. (2008a).  \nScientific names of all fish species are given in the main text, with the exception of \nthat of the three-spined stickleback (given as stickleback in the figure) which is \nGasterosteus aculeatus. \n \nFigure 3.  Fish community compositions for inshore, offshore bottom and offshore \nsurface habitats (2003 only) of Llyn Tegid in in 1991 (N = 174 fish, closed bars) and \n2003 (N = 179 fish, open bars).  Redrawn from Winfield et al. (1994) and Winfield et \nal. (2003).  Scientific names of all fish species are given in the main text. \n \nFigure 4.  Catch-per-unit-effort (CPUE) for native Arctic charr and brown trout \n(closed symbols and continuous lines) and introduced common bream and roach \n(open symbols and broken lines) in the north and south basins of Windermere from \n1990 to 2009.  Scientific names of all fish species are given in the main text. \n 22\n \nLoch Lomond\nWindermere\nLlyn Tegid\nLough Neagh\n 23\nInshore\n0\n20\n40\n60\n80\n100\nBrown\ntrout\nEel Gudgeon Perch Pike Roach Ruffe Stickleback Whitefish\nSpecies\nPe\nrc\nen\nta\nge\nOffshore bottom\n0\n20\n40\n60\n80\n100\nBrown\ntrout\nEel Gudgeon Perch Pike Roach Ruffe Stickleback Whitefish\nSpecies\nPe\nrc\nen\nta\nge\nOffshore surface\n0\n20\n40\n60\n80\n100\nBrown\ntrout\nEel Gudgeon Perch Pike Roach Ruffe Stickleback Whitefish\nSpecies\nPe\nrc\nen\nta\nge\n 24\nInshore\n0\n20\n40\n60\n80\n100\nBrown trout Gudgeon Minnow Perch Roach Ruffe Whitefish\nSpecies\nPe\nrc\nen\nta\nge\nOffshore surface\n0\n20\n40\n60\n80\n100\nBrown trout Gudgeon Minnow Perch Roach Ruffe Whitefish\nSpecies\nPe\nrc\nen\nta\nge\nOffshore bottom\n0\n20\n40\n60\n80\n100\nBrown trout Gudgeon Minnow Perch Roach Ruffe Whitefish\nSpecies\nPe\nrc\nen\nta\nge\n 25\nNorth\n0.00\n0.05\n0.10\n0.15\n1990 1992 1994 1996 1998 2000 2002 2004 2006 2008 2010\nYear\nC\nPU\nE \n(f\nis\nh \nne\nt-1\n d\nay\n-1\n)\nArctic charr Brown trout Common bream Roach\nSouth\n0.00\n0.05\n0.10\n0.15\n1990 1992 1994 1996 1998 2000 2002 2004 2006 2008 2010\nYear\nC\nPU\nE \n(f\nis\nh \nne\nt-1\n d\nay\n-1\n)\nArctic charr Brown trout Common bream Roach\n 26\nTable \n \nTable 1.  Kendall rank correlation coefficients (τ, with their statistical significances P) \nbetween catch-per-unit-efforts of introduced common bream and roach and those of \nnative Arctic charr, brown trout, perch and pike in the north and south basins of \nWindermere from 1990 to 2009.  Scientific names of all fish species are given in the \nmain text.  Coefficients significant at the 0.05 level are indicated by *. \n \nSpecies pair Basin τ P \nCommon bream \/ Arctic charr North -0.210 0.195 \nCommon bream \/ Brown trout North -0.256 0.115 \nCommon bream \/ Perch North +0.150 0.356 \nCommon bream \/ Pike North -0.283 0.081 \nCommon bream \/ Arctic charr South -0.230 0.156 \nCommon bream \/ Brown trout South +0.243 0.134 \nCommon bream \/ Perch South +0.365 0.025* \nCommon bream \/ Pike South -0.045 0.780 \nRoach \/ Arctic charr North +0.019 0.906 \nRoach \/ Brown trout North +0.256 0.115 \nRoach \/ Perch North -0.316 0.051 \nRoach \/ Pike North +0.150 0.356 \nRoach \/ Arctic charr South -0.344 0.034* \nRoach \/ Brown trout South +0.400 0.014* \nRoach \/ Perch South +0.302 0.063 \nRoach \/ Pike South -0.235 0.160 \n \n \n"}