{"doi":"10.1016\/j.saa.2005.11.017","coreId":"138078","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1196","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1196","10.1016\/j.saa.2005.11.017"],"title":"Modelling and interpretation of gas detection using remote laser pointers.","authors":["Hodgkinson, Jane","van Well, Ben","Padgett, Miles","Pride, Russ D."],"enrichments":{"references":[{"id":38114336,"title":"A 7,","authors":[],"date":"2005","doi":"10.1088\/1464-4258\/7\/6\/025","raw":"B. van Well, S. Murray, J. Hodgkinson, R. Pride, R. Strzoda, G. Gibson, M. Padgett, J. Opt. A 7, (2005) S420-S424.","cites":null},{"id":38114339,"title":"APPENDIX A. Derivation of reflectivity equation Iseki et al used the following equation in their model:","authors":[],"date":"2002","doi":null,"raw":"D.J. Wuebbles, K. Hayhoe, Earth-Sci. Rev. 57 (2002), 177-210. APPENDIX A.  Derivation of reflectivity equation Iseki et al used the following equation in their model: W cos ) 1 ( 1 2 Ω + = − d k P dP k tot i r θ π ρ (5) We realised that this would not normalise successfully for all values of k, so for clarity we show a detailed derivation of our equation (3) in this appendix. Consider a light beam incident on an area δA, as shown in Figure 13. In cylindrical polar coordinates the incident beam has angle θi to the normal and rotational angle φi about the normal axis. For simplicity, the angle φ has been omitted from the figure, and we assume no dependence on φ.","cites":null},{"id":38114338,"title":"m reported gas UK escapes in 2001, over 259,000 were outside reports, of which around 25% resulted in 'no gas found'. NGT website, http:\/\/www.transco.co.uk\/safety\/index\/index.asp,","authors":[],"date":"2005","doi":null,"raw":"Of 1.35 m reported gas UK escapes in 2001, over 259,000 were outside reports, of which around 25% resulted in 'no gas found'. NGT website, http:\/\/www.transco.co.uk\/safety\/index\/index.asp, (May 2005).","cites":null},{"id":38114337,"title":"Physical principles of remote sensing, 2 nd ed.,","authors":[],"date":"2001","doi":"10.1017\/cbo9780511812903","raw":"W.G. Rees, Physical principles of remote sensing, 2 nd ed., Cambridge University Press, Cambridge (2001).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-04","abstract":"We have developed a quantitative model of the performance of laser pointer style gas leak detectors, which are based on remote detection of backscattered radiation. The model incorporates instrumental noise limits, the reflectivity of the target background surface and a mathematical description of gas leak dispersion in constant wind speed and turbulence conditions. We have investigated optimum instrument performance and limits of detection in simulated leak detection situations. We predict that the optimum height for instruments is at eye level or above, giving an operating range of 10 m or more for most background surfaces, in wind speeds of up to 2.5 m s−1. For ground based leak sources, we find laser pointer measurements are dominated by gas concentrations over a short distance close to the target surface, making their readings intuitive to end users in most cases. This finding is consistent with the results of field trials","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138078.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/1826\/1196","pdfHashValue":"8887b8644f1da224814e3207adb75c4cd503390b","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1196<\/identifier><datestamp>2008-06-09T09:45:01Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Modelling and interpretation of gas detection using remote laser pointers.<\/dc:title><dc:creator>Hodgkinson, Jane<\/dc:creator><dc:creator>van Well, Ben<\/dc:creator><dc:creator>Padgett, Miles<\/dc:creator><dc:creator>Pride, Russ D.<\/dc:creator><dc:subject>Gas<\/dc:subject><dc:subject>Methane<\/dc:subject><dc:subject>Leak<\/dc:subject><dc:subject>Detection<\/dc:subject><dc:subject>Dispersion<\/dc:subject><dc:description>We have developed a quantitative model of the performance of laser pointer style gas leak detectors, which are based on remote detection of backscattered radiation. The model incorporates instrumental noise limits, the reflectivity of the target background surface and a mathematical description of gas leak dispersion in constant wind speed and turbulence conditions. We have investigated optimum instrument performance and limits of detection in simulated leak detection situations. We predict that the optimum height for instruments is at eye level or above, giving an operating range of 10 m or more for most background surfaces, in wind speeds of up to 2.5 m s−1. For ground based leak sources, we find laser pointer measurements are dominated by gas concentrations over a short distance close to the target surface, making their readings intuitive to end users in most cases. This finding is consistent with the results of field trials.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2006-10-02T11:33:31Z<\/dc:date><dc:date>2006-10-02T11:33:31Z<\/dc:date><dc:date>2006-04<\/dc:date><dc:type>Postprint<\/dc:type><dc:format>1095899 bytes<\/dc:format><dc:format>application\/pdf<\/dc:format><dc:identifier>J. Hodgkinson, B. van Well, M. Padgett and R.D. Pride, Modelling and interpretation of gas detection using remote laser pointers, Spectrochimica Acta Part A: Molecular and Biomolecular Spectroscopy, Volume 63, Issue 5, 5th International Conference on Tunable Diode Laser Spectroscopy, 2005, April 2006, Pages 929-939.<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/1196<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.saa.2005.11.017<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Gas","Methane","Leak","Detection","Dispersion"],"subject":["Postprint"],"fullText":"Modelling and interpretation of gas detection using remote laser \npointers \n \nJ Hodgkinson ac*, B van Wellb, M Padgettb and R D Pride ad \n \na Advantica, Loughborough, UK     \nb Dept of Physics and Astronomy, Glasgow University, Glasgow, UK \nc Now at School of Engineering, Cranfield University, Bedfordshire, MK 43 0AL, UK.  \nAddress for correspondence. \nTel +44 (0) 1234 750111 ext 5364 \nFax +44 (0) 1234 752452 \nj.hodgkinson@cranfield.ac.uk \nd Now at Joint Research Centre, European Commission, Ispra, Italy \n \n \nAbstract \n \nWe have developed a quantitative model of the performance of laser pointer style gas leak detectors, \nwhich are based on remote detection of backscattered radiation. The model incorporates instrumental \nnoise limits, the reflectivity of the target background surface and a mathematical description of gas \nleak dispersion in constant wind speed and turbulence conditions. We have investigated optimum \ninstrument performance and limits of detection in simulated leak detection situations. We predict that \nthe optimum height for instruments is at eye level or above, giving an operating range of 10m or more \nfor most background surfaces, in wind speeds of up to 2.5 m.s-1. For ground based leak sources, we \nfind laser pointer measurements are dominated by gas concentrations over a short distance close to the \ntarget surface, making their readings intuitive to end users in most cases. This finding is consistent \nwith the results of field trials. \n \n \n \nKeywords: \nGas, methane, leak, detection, dispersion \n1 Introduction \n \nThere is great interest in remote gas detectors, based on tunable diode lasers, operating over distances \nof 10m or more[1,2,3]. These systems use a laser beam aimed through open space at a target, collecting \nthe backscattered light and applying a spectroscopic signal demodulation. Applications include the \ndetection of natural gas leaks from low-pressure distribution pipes, with a methane detector based on a \ntunable DFB laser emitting light at 1.65nm. \nThis detection geometry represents a significant step change within the gas industry from the use of \npumped sampling sensors that detect gas concentrations at a single point in space. The new \ninstruments present challenges for instrument designers and operators that cannot be fully addressed \nwithout also understanding the behaviour of the leaking gas plume. Iseki et al have modelled their \nsystem’s reflectivity and noise performance, relating this to a minimum detectable gas concentration \nsignals in ppm.m[1]. For indoor leaks in the absence of wind, they have demonstrated gas leak \ndetection with leak rates as low as 0.01litre min-1. We have now extended this understanding to \ninclude outdoor wind speed and turbulence characteristics as well as the effects of different leak plume \nviewing conditions. \n \nWe present results from a collaborative project to develop a laser pointer instrument. Understanding \nthe interaction between the laser beam and the leaking gas needed to inform both instrument design \nand operation guidelines. Our model combines the behaviour of the dispersing gas plume, the \nbackground target, and the interaction of the instrument laser beam with both of these. It has enabled \nus to investigate trends in behaviour under controlled conditions, more rapidly than would be the case \nwhen performing field tests. We report our findings concerning the optimum instrument height, \npointing accuracy required, ability to “zero trace” (confirm the absence of gas) and the intuitive use of \nthe measurements to locate gas leaks. Conclusions drawn from the model have been compared \nqualitatively with the results of instrument field tests. \n \n2 Method \n \nA typical laser pointer, shown schematically in Figure 1, provides readings proportional to the number \ndensity of methane molecules along the path of the laser beam. Because the measurement takes the \nform of a line integral, the units of measurement are ppm.m as opposed to ppm, typically found with \ntraditional point sampling instruments. In other words, the instrument would give the same reading for \n(i) 100% gas spread over a distance of 1mm, and (ii) 1000ppm gas spread over a distance of 1m. \n \nleaking gas\ndiffuse reflection\nhand-held\nlaser pointer\n \nFigure 1. Schematic diagram of a laser pointer in action. \n \nWe used a Gaussian model of leaking gas concentrations, based on a previous study of gas dispersion \nperformed using a wind tunnel. A computer model of the instrument response was developed, taking a \nline integral of gas concentrations through the simulated cloud from the position of the instrument to a \ntarget position on the ground. The relative positions of instrument and target could be changed in the \nmodel in three dimensions, as could the type of background target (using their different characteristic \nreflectivities). The line integral was summed numerically. Signal to noise ratios were considered using \na model for surface reflectivity based on experimental data. \n \n \n2.1 Gas dispersion model \n \nAs shown in Figure 2, a narrow plume may meander within a diffusely defined envelope, with a gas \nconcentration that can change both spatially and temporally. The concentration map described by the \nfollowing model should therefore be thought of as a gas probability distribution rather than as an \ninstantaneous map of the gas concentration. \n \n \nσ y \nwind direction \nz \n y \nσ z\nx \n \nFigure 2. Schematic of a gas leak plume meandering within an envelope. \n \nIn the Pasquill-Gifford model for passive gas releases, the concentration of gas downwind of a ground \nlevel, point leak source at the origin (x,y,z) = (0,0,0) is predicted by the following Gaussian \nrelationship[4]. \n ( )\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n+−= 2\n2\n2\n2\n2\n1\nexp2,,\nzyzy\nzy\nu\nQ\nzyxC\nσσσσpi\n (1) \nC is the concentration in kg·m-3, Q is the flow rate in kg·s-1, σy and σz are dispersion coefficients in m, \nx, y and z are distances in m and u is the wind speed in m·s-1. For an extended source of width 2a \nalong the y-axis, equation (1) is integrated over the source: \n ( ) ( ) ( )\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n +\n+\n\n\n\n\n\n\n\n\n−\n\n\n\n\n\n\n\n\n−=\nyyzz\nya\nerfyaerfz\nau\nQ\nzyxC\nσσσσpi 2\n1\n2\n1\n2\n1\nexp\n2\n,, 2\n2\n (2) \nIdeally we would also integrate equation (2) over the extended source along the x-axis. However, the \ndependence of the dispersion coefficients, σy and σz, on x make this analytically difficult. Instead we \nhave used equation (2) as it stands, making the approximation to our real rectangular source. At wind \nspeeds of ≥1m·s-1 along the x-axis, downwind dispersion over the short (10cm) length of the source \nwould be negligible. \nThe values of the gas dispersion coefficients σy and σz shown in equation (2) were found in a study of \ngas leak behaviour conducted in the controlled conditions of a wind tunnel[5]. Their values are \ndependent on the prevailing turbulence conditions, which in the wind tunnel were controlled so as to \nbe representative of mixed rural setting (ie relatively flat, fields broken by hedges and occasional \nbuildings). The more turbulent urban environment would necessitate use of different coefficients. So \nalthough these values are not universally applicable, we can nevertheless study trends and the question \nof the intuitiveness for our modelled instrument. \n \nTable 1. Values of σy and σz used in this study for each of the wind speeds considered. \n \nWind speed σy \/ m σz \/ m \n1 m·s-1 0.14 x 0.098 0.21 x 0.97 \n1.8 m·s-1 0.15 x 0.39 0.16 x 0.93 \n2.5 m·s-1 0.14 x 0.54 0.12 x 0.94 \n \n \nEquation (2) predict that gas concentrations will be highest very close to the ground, within a few cm. \nFigure 3 shows a representation of the 3-d concentration distribution for a 1m\/s wind speed.  \n  \nx (length) \nz \n(height) \ny \n(width) \nWind direction \nz \/ mm \ny \/ m \nx \/ m \n20001000 0 \nconcentration \nscale \/ ppm\n \nFigure 3. Concentration profile modelled by equation (2), for fitted turbulence conditions, a wind \nspeed of 1 m·s-1 and a leak rate of 1 litre min-1. \n \n2.2 Reflectivity model \n \nThe ability of the instrument to detect gas depends on the level of instrument noise and the level of \nbackscattered light received by the detector. Because the instrument is self-normalising, information is \navailable on the amount of received light as well as the measured concentration. Thus, the instrument \ncould give a level of confidence in its readings and indicate when a threshold level of light has not \nbeen received. \n \nFor instrument performance limited entirely by the detector \/ preamplifier combination, surface \nreflectivity was considered to be the most significant factor affecting signal to noise ratios, especially \nfor distant targets. We measured the reflectivity of 21 real, flat surfaces encountered in gas leak \ndetection, including brick, concrete, old and new tarmac and bitumen, in wet and dry states. \nMeasurements were made using the same backscatter geometry depicted in Figure 1, at angles of 15º, \n45º and 75º to the normal. Figure 4 shows a photograph of the measurement apparatus, based on a near \nIR diode array spectrometer. We were able to take this apparatus into the field at an early stage in our \nproject to measure a range of real outdoor surfaces.  \n \n  \nA \nD \nE \nG \nF \nB \nC \n \nFigure 4. Reflectivity measurement apparatus. \n \nA Optomechanical measurement rig designed to hold the collimating optics for the incident and \ncollected light at three angles of incidence. \nB Near infrared diode array spectrometer (Avantes NIR 128) containing a dispersive grating that \nsplit the light into its component wavelengths in the range 1100nm – 1750nm, detected at a \n128element diode array. Control of the spectrometer and collection of the data was performed \nusing Avantes proprietary software (supplied with the spectrometer) on a lap-top computer. For \nfield measurements, the spectrometer was powered by a 6V lead acid battery via two separate \n5V voltage regulators. \nC Fibre-aligned tungsten halogen lamp (Avantes) powered from a 12V lead acid battery (two such \nbatteries can be seen in the background of the picture).  \nD Optical fibre for incident light, diameter 800µm. \nE Input fibre to the spectrometer, diameter 300µm. This element was the limiting aperture for the \nlight collection optics. \nF Light collection fibre, connected to the short spectrometer input fibre E. \nG Input and output collection optics. The measurement spot had a diameter of 9mm and was a \ndistance of 88mm from the collimating lenses. \n \nMeasurements were made relative to a diffuse reflection standard (Spectralon) at exactly the same \nposition and height as the target surface. The standard was assumed to have a perfectly Lambertian \nreflection profile with 99% total reflectivity. Use of the relative standard enabled us to correct for \nslight changes in the background conditions at the time of measurement.  \n Readings at different angles of incidence, taken at 1651nm (the operating wavelength of the laser \npointer), were fitted to a diffuse reflectance model as follows;  \n \n ( ) Ω= δθρ\npi\nδ ktotalir\nkPP 2cospower light returned  (3) \n \nPi is the power incident on the surface, which we take to be 10mW.  ρtotal  is the total reflectivity, k is \nthe Minnaert constant[6], θ is the angle of incidence to the normal and Ω is the solid angle of the light \ncollection aperture. The derivation of this equation is given in APPENDIX A, using radiometric \nrelationships defined in reference [7]. \n \nThe parameters ρtotal and k were determined using a least squares fit to our data at the three angles of \nincidence, with results shown in Table 2, APPENDIX B. Observation of real-world surfaces suggests \nthat in practice, roughness and dirt play an important role in increasing reflectivity at high (>80º) \nangles of incidence, such that our model may give a worst case estimate of the reflectivity for the most \ndistant targets. \n \nWe used the same model to calculate the amount of backscattered light for the laser pointer. The \ninstrument background noise level was found to be constant, giving a signal to noise ratio (SNR) that \nwas proportional to the level of backscattered light collected by the lens[3]. For a returned light power \nof 20nW the detection limit at SNR=1 was 100ppm.m. Thus we modelled the SNR here as, \n \n \nnW20ppm.m100\nSNR rPc ⋅=  (4) \n \nc is the calculated concentration in ppm.m and Pr is the level of returned light power expected for a \n10mW incident beam, scattered from the modelled target distance into a 150mm diameter aperture. \n \n2.3 Combined instrument model \n \nThe concentration profile in section 2.1 was used to generate theoretical instrument responses. It was \nassumed for this exercise that the earth is completely flat and that all target surfaces are horizontal, so \nfor example, walls were not considered. Thus, the angle of incidence is determined by the height that \nthe pointer is held and the distance to the target; even at moderate distances, the angle to the horizontal \nis small. The hypothetical instrument response was calculated as follows. \n \n(i) Place theoretical pointer at position P=(x,y,z) in space, relative to the gas leak at (0,0,0). \n(ii) Point towards target at position T=(x,y,z), typically on the ground ie with z=0. \n(iii) Determine the locus of a line between the two points. \n(iv) Calculate the gas concentration at a large number (100) of equally spaced points along this \nline. For some models a constant set value was added to the value given by equation (2), \nto account for the methane background.  \n(v) Use these point concentrations to calculate a numerical approximation to the instrument \nresponse in ppm.m for a double pass along the line. \n(vi) Plot this response in ppm.m on a map of the ground, at the target location T. \n(vii) Plot similar responses to cover all other ground level target locations in a 20m square \ncentred on the pointer. \n \nNote that the gas dispersion model of equation (2) gives infinitely high concentration at the source, \nsince the source is infinitely thin. Such high concentrations were therefore capped at a maximum of \n100% volume, to force the calculations to be tractable in the case of a “direct hit” on the leak source. \nThe volume affected by this change was very small, corresponding to around 1cm above ground level. \nThe overall effect might have been to reduce the modelled signal compared to that from an extended \nsource, thus giving a worst case estimate of the line-integrated concentration. In physical terms, this \nadjustment would model a situation in which, very close to a thin leak source, the passive release \nmodel breaks down and the gas has its own momentum, issuing at higher speed under a small pressure \ndifferential. It presents a worst case view of the concentration for alternative situations. \n \nThe result of this model was a 2-d representation of measured concentrations, mapped to their \ncorresponding ground level targets around the pointer location. The process is illustrated by Figure 5. \nThe exercise was repeated for different pointer locations, modelled wind conditions and background \nsurfaces.  \n \n Plotted map \nof results\nWind speed   u\ny\nl\nϑ\nLeak rate Q \nfrom (0,0,0)\nR = (x,y,z)\nx\nz\n \ndrCsignal ∫=\nl\n.2\n \nFigure 5. Illustration of combined modelling process \n \nThe advantages of numerical modelling were that it provided quick results in controlled \ncircumstances, in contrast to outdoor testing where wind conditions are not repeatable. We were able \nto investigate trends and consider the questions described later in section 3. However, a number of \nlimitations of this approach should be noted. The gas dispersion model only considered time-averaged \nprobability distributions of gas concentration, not temporal fluctuations. In practice, concentrations are \nhighly variable, especially in urban settings, giving higher peak readings and potentially more rapid \ndilution of concentration with distance.  \n \n3 Results of modelling \n \nWe can draw a number of insights from the results, each discussed in the following sections. A theme \nof this investigation was the issue of whether the results can indicate the location of a gas leak in an \nintuitive manner for operators more familiar with point measurements.  \n \nUnless otherwise indicated, the following standard conditions were used in these models. An \nintermediate wind speed of u = 1.8 m s-1 was used, with a gas leak rate of Q = 1 litre min-1. Results are \npresented in the same mapped format throughout, with an explanation provided on the first image. In \nmany cases a number of different alternative pointer locations were investigated; because of space \nconstraints we have presented typical indicative examples of these sets of results. \n \n \n3.1 Ability to zero trace \n \nDetermining the absence of gas, or finding out whether there is a gas leak present on site, is a different \nactivity from locating a known leak. A large proportion of public reported escapes can result in a zero \ntrace[8]. We require a zero signal to be a reliable indication of an absence of gas leaks over a given \narea, therefore the area should be surveyed with sufficient resolution and signal to noise ratio to ensure \ndetection of any significant leaks. A pointer could enable more rapid zero tracing compared to a spot \nmeasurement instrument. The following sections discuss a number of potential issues that have been \ninvestigated using the model. \n \n \n3.1.1 Background methane \n \nThe background concentration of methane is 1.75ppm [9] but can rise above that in areas close to other \nmethane sources such sewers or cattle farms; for simplicity we used a value of 2ppm. In the absence of \na gas leak, the pointer will still measure the background methane, integrated over the interaction \npathlength of the laser beam. For long pathlengths, the question was raised of whether this \nmeasurement would be interpreted as a spurious gas indication. The issue does not arise for traditional \npoint sampling instruments, since the background level of methane is usually zeroed out in clean air \nbefore using the instrument. In the case of the laser pointer, the operator does not know the pathlength \nnor keep it fixed, and it is not possible to zero out the background reading.  \n \nIn all cases considered, significant background readings could not be detected within the model with a \nhigh enough signal to noise ratio for it to register as a real measurement. At long distances, and \ntherefore grazing angles of incidence on flat ground, there is insufficient returned light to measure \nanything but signals that are much larger than the background. Figure 6 shows an example in which \nthe background methane can only be detected within a circle around the operator (approx 6m diameter \nfor the “old tarmac” surface), where the signal level is under 30ppm.m, and not elsewhere. \n \n  \nFigure 6. Example set of results showing the effect of the methane background as a detectable but low \nsignal within a circle around the operator, approximately 6m diameter (surface – old tarmac). \n \nHowever, it is possible that a wall, especially one with a highly reflective surface, might return \nsufficient light at long distances to enable detection of the methane background. The effect would be \ncounter-intuitive to an operator and would give a false positive indication of a gas leak, which at least \nwould be a fail safe condition, and the spurious signal would reduce on closer inspection.  \n \n \n3.1.2 Target material and range of operation of the instrument \n \nThe reflectivity of the target materials and the angle that the laser beam makes with this target both \ndetermine the amount of backscattered light collected by the lens, and therefore whether the \ninstrument has sufficient light with which to work. For flat surfaces, the angle to the ground is also \ndetermined by the height at which the instrument is held and the distance to the target.  \nLaser pointers can be designed to fail safe, to give an error if there is insufficient light, so that a false \nzero trace is not reported. However, we need to ensure the availability of the reading in typical field \nsituations, to justify its use when zero tracing. Our performance target was to be able to detect a signal \nlevel of 1000ppm.m at a distance of 10m over flat ground, with a range of target materials. This \nrequirement was tested using the model for various surfaces, and the results are plotted in Figure 7. \nFor this example we chose a pointer height of 1.5m, which is not untypical. \n10 6 2 2 6 10 \n1\n1\n9 \n5 \n1 \n3\nMax signal = 7.3×104 ppm.m Max SNR = 3,000 \n104\n3000 \n1000 \n300 \n100 \n30 \n10 \nscale \/ ppm.m \ndistance \/ m \ndi\nst\nan\nce\n \n\/ m\n \ndetectable leak \n(high signal) \ndetectable background \nmethane (low signal) \npointer \nleak \nWIND \nR=(0,-7,1.5) \n100 \n10 \n3 \n1 \nSNR scale \n30 \n1000 \n300 \nSignal in ppm.m mapped to \ntarget location in 2 dimensions, \nMap of leak and pointer \nlocations, shown from above \nMap of signal to noise ratio (SNR), \nouter white region indicating SNR<1 \n  \nFigure 7. Range in metres at which a hypothetical laser pointer would detect a signal strength of \n1000ppm.m, 100ppm.m and 10ppm.m, with a signal to noise ratio of unity, for different surface types. \nIn this model the pointer was held at a height of 1.5m and the target ground was flat. \n \nThe results quantify the increased operating range when used over highly reflective backgrounds \ncompared with use over poorly reflective backgrounds. For example, the modelled ranges for clay soil, \nsteel and red brick are well in excess of 30m for large signals, and at 10m signals lower than \n100ppm.m are detectable. Black PVC, which has a shiny surface, gave the worst performance but is \nunlikely to be encountered as a horizontal background, rather as vertical pipework. Wet, new black \ntarmac (surface type 19) is a worst-case material likely to be encountered more frequently in leak \ndetection operations. For this material, we could detect a 1000ppm.m signal at 9.2m in the model. Or \nin other words, a zero reading from 9.2m distance over this material would be just capable of \nindicating that the level of gas was at 1000ppm.m or lower. In fact older tarmac (surface type 17) \nwould be more typically encountered and has better reflectance properties, giving a modelled working \ndistance over flat ground of well over 10m. \n \n1 10 100\nBlack PVC \nBitumen \nWet new tarmac \n3 month tarmac \nOld road tarmac \nPaving bricks \nGrey painted lab floor \nSteel bench \nWet concrete slab \nDamp concrete slab \nConcrete slab \nDamp soil \nClay soil \nWet wood \nDamp wood \nWood \nGrass \nWhite road marking \nDamp red brick \nRed brick \nWhite melamine \nSurface type \n21 \n20 \n19 \n18 \n17 \n16 \n15 \n14 \n13 \n12 \n11 \n10 \n9 \n8 \n7\n6\n5\n4\n3 \n2 \n1 \nworking distance \/ m \n10 ppm.m 100 ppm.m 1000 ppm.m\n \n3 \n3.1.3 Spatial resolution \n \nThe fundamental spatial resolution of the instrument is determined by the width of the laser beam. \nHowever, we must consider other effects, namely (i) the accuracy with which a user can point the laser \nbeam to the target, and (ii) the resolution required to reliably detect (or show the absence of) a leak. \nModelling results suggest that leaks are only detectable within a small target area close to the leak \nsource. The size of the area depends on the distance to the leak, the wind conditions and the surface \nreflectivity. For this exercise we have used a 1 litre min-1 leak in the strongest modelled wind of \n2.5 m s-1. \n \nFor an old tarmac surface with a pointer-to-leak distance of 10 m, the detectable spot size is small, \napproximately 80 cm wide in a 2.5 m s-1 wind, and extending into an observable plume at greater \ndistances subtending an angle of ±3º at the pointer. The modelled leak is detectable over a width \ngreater than the 10cm width of our modelled source. This is encouraging because in the region \ncorresponding to the source, the passive release model breaks down as previously discussed. The \nmodel is also untested here, being based on raw concentration measurements made at downwind \ndistances of greater than 200mm, and made with point sampling detectors that sampled gas from a \nwider volume than that determined by the source dimensions.  \n \n \nFigure 8. Example of a small detectable spot width at the leak source (see right hand map) at long \nworking distances. The leak can be detected in a 1m wide region, highlighted for clarity. \n \n \nThe model predicts that in the worst case condition, the pointer should be targeted at the leak source, \nwithin a tolerance of ±0.4m or better, to yield a detectable gas reading. Pointing the invisible laser \nbeam at 10m distance with this accuracy might be difficult for a user and is likely to require a visual \nsighting aid and \/ or visible laser pointer. Furthermore, the laser beam would need to be scanned over \nthe entire surface with just such a high resolution to give a reliable zero trace.  \n \nMax signal = 1,700 Max SNR = 31 distance \/ m \n104 \n3000\n1000\n300\n100\n30\n10\nscale \/ ppm.m \n \n100 \n10 \n3 \n1 \nSNR scale \n30 \n1000\n300 \ndetectable \nleak \ndi\nst\na\nn\nce\n \n\/ m\n \n-24 -20 -16 -12 -8 -4 0 4 \n-14 \n-10\n-6\n-2 \n2\n6\n10 \n14 \nR=(10,0,1.5) \npointer \nWIND \nleak\nFor smaller leaks and \/ or stronger winds, the required tolerance tightens in our model. In field trials of \na prototype pointer instrument, we gained some anecdotal evidence also of the difficulty of detecting \nvery small leaks (unquantified but broadly estimated to be below 0.1 litre min-1) issuing from small (2-\n3mm) cracks in paving. To detect such small leaks required a direct hit by the laser beam, but this was \nmade difficult at long working distances. We therefore recommend that the laser beam should be \nexpanded as far as possible, so as to just underfill the detectable area created by the photodetector \/ \nlens combination. \n \n \n3.2 Is there potential for ambiguous leak location? \n \nIn general, our results show that, in the model at least, the pointer target that gives the largest \nintegrated concentration signal correspond to the location of the gas leak. Such instrument behaviour \nwould be highly intuitive to operators. It derives from the gas dispersion behaviour mentioned \npreviously, that the gas concentration remains highest in a layer very close to ground level, and \ntherefore the line-integrated gas concentration from a higher pointer is dominated by the gas nearest \nthe ground-level target. Some specific questions were raised about whether this principle was \nsustained in two particular circumstances. \n \nThe first question concerned the case of an operator standing within a leaking gas plume. The model \nhas confirmed that a maximum reading would be observed upwind of the operator, corresponding to \nthe leak source. However, a second, broader maximum could also be observed downwind, where \nincreasing interactions lengths coincided with the leak plume. The downwind maximum could be \nwrongly interpreted as a gas leak source, and confusion could arise particularly if multiple leak \nsources were present. Figure 9 shows two examples at different distances to the source. \n \n9 1 3 7 11 15 \n1\n6\n2\n2\n6\n1\nR=(5,0,1.5)\nleak \npointer \nMax signal = 5.4×104 ppm.m Max SNR = 4,500 distance \/ m \nWIND \ndi\nst\na\nn\nce\n \n\/ m\n \n104\n3000 \n1000 \n300 \n100 \n30 \n10 \nscale \/ ppm.m \n100 \n10 \n3 \n1 \nSNR scale \n30 \n1000 \n300 \n \nFigure 9(a). 5m away from the leak, a large maximum appears at the leak source with a lower, less \nwell-defined maximum away from the source (surface: dry concrete). \n \nR=(1,0,1.5)\nleak \npointer \nMax signal = 1.8×104 ppm.m Max SNR = 1,600 distance \/ m \nWIND \ndi\nst\na\nn\nce\n \n\/ m\n \n104\n3000 \n1000 \n300 \n100 \n30 \n10 \nscale \/ ppm.m \n9 5 1 3 7 1\n1\n6 \n2 \n2\n6\n1\n100 \n10 \n3 \n1 \nSNR scale \n30 \n1000 \n300 \n \nFigure 9(b). Closer to the leak (1m away), the maximum reading from the leak source is reduced, \nwhile the maximum away from the leak source has increased. \n \nA number of observations of this case have been made using the model, based on different \ncircumstances. For small leaks (around 1 litre min-1, as used here) and \/ or poor reflectors, the \nambiguity is removed by a poor signal to noise ratio in the region of the broader, smaller apparent \nmaximum reading downwind. The ambiguity is reduced if the pointer is held higher, out of the plume, \nat > 1m. This has the effect that the interaction distance is defined more by the gas plume height and \nless by the pointer-target distance.  \n \nA further strategy to remove or reduce the ambiguity in the field would draw on operators’ existing \nskills and experience. When using point sampling detectors, it is known that the gas plume drifts \ndownwind and therefore an upwind source is sought for a positive measurement. Knowledge of the \nwind direction would also be of use in this case with a laser pointer.  \n \nThe second question concerned the apparent shape of the gas plume. It can be seen that for identical \ngas leaks, the location of the pointer can distort the apparent plume shape and a gas “shadow” may be \nobserved for plumes viewed from the side. At glancing angles of incidence, the laser beam is more \nlikely to interact with the gas cloud on its way to a more distant target. Figure 10 shows this effect.  \n \n5 1 3 7 11 15 \n11 \n7\n3\n1\n5\n9 \nR=(5,-1,1.5)\nleak \npointer \nMax signal = 5.5×104 ppm.m Max SNR = 4,400 distance \/ m \nWIND \ndi\nst\na\nn\nce\n \n\/ m\n \n104\n3000 \n1000 \n300 \n100 \n30 \n10 \nscale \/ ppm.m \n100 \n10 \n3 \n1 \nSNR scale \n30 \n1000 \n300 \n \nFigure 10(a). With a pointer held at a height of 1m, the gas plume has a little distortion (apart from the \npreviously observed minimum in reading around the operator). \n \nMax signal = 5.4×104 ppm.m Max SNR = 3,600 distance \/ m \ndi\nst\na\nn\nce\n \n\/ m\n \n104\n3000 \n1000 \n300 \n100 \n30 \n10 \nscale \/ ppm.m \n5 1 3 7 11 15 \n11 \n7\n3\n1\n5\n9 \nR=(5,-1,0.4)\nleak \npointer \nWIND \n100 \n10 \n3 \n1 \nSNR scale \n30 \n1000 \n300 \n \nFigure 10(b). With a lowered pointer (at a height of 0.4m) the gas “shadow” has increased (see left \nhand map of the signal). \n \nAgain, for small leaks and \/ or poor reflectors, signal to noise limitations remove any major ambiguity. \nThe shadowing effect is anyway not considered to be a significant hindrance for leak location, because \nthe plume shape may be distorted but the leak location remains obvious. We can express the effect \nsuccinctly as a “gas shadow” behind the leak, which hopefully should convey the nature of the \nambiguity to operators.  \n \n3.3 What is the optimum pointer height? \n \nWe were able to model two competing effects on the instrument response as a function of pointer \nheight. As discussed in section 2.1, gas concentrations remain highest in a layer closest to the ground, \nwithin a few cm. Therefore over flat ground, a low pointer will emit a beam at a more grazing angle of \nincidence, with a greater degree of interaction with the gas plume. However, a higher pointer will gain \nfrom better reflectivity at an angle of incidence closer to the normal. So which effect wins?  \n \nWe modelled pointers used at different heights in a number of different locations relative to the leak \nsource. The maximum modelled signal to noise ratio was used as a figure of merit and has been \nplotted as a function of pointer height for different pointer \/ leak positions in Figure 11. \n \n \n Figure 11. Effect of probe height on the maximum measured signal to noise ratio for a modelled laser \npointer operating with a 1litre\/min leak in a 1.8m\/s wind over a flat surface, at various arbitrarily \nchosen pointer locations. The map also shows locations that are equivalent by reflection in y=0. \n \nThe optimum height depended on the relative location of the pointer and the leak, as well as the target \nsurface. For leaks that were the most difficult to detect, with the lowest observed maximum SNRs, the \noptimum was rather high for a handheld device and a pointer held at eye level (approx 1.5m or higher) \nwould be preferable to one held at ground level. \n \n \n4 Instrument field tests \n \nThe signal from the laser pointer was compared to the reading from a flame ionisation detector (FID) \nin an outdoor test with a buried natural gas leak whose leak rate was 10 litre min-1. The FID is a point \nsampling instrument, whose sample probe was positioned approximately 0.5m downwind of the leak \nsource. The laser pointer was aimed at this same position as a target. Data from both instruments was \nlogged simultaneously, while wind turbulence caused variations in the measured concentration. \n \n0\n1\n10\n100\n103\n104 \n0 2 4 6 8 10 \nHeight \/ m \nm\nax\nim\nu\nm\n \nSN\nR \nR1 (9.5,0) old tarmac \nR2 (0,9.5) old tarmac \nR3 (1, 4)  old tarmac \nR4 (-9.5,0) old tarmac \nR5 (-7, -7)  old tarmac \nR6 (9.5, 0) old tarmac \nR6 (9.5,0) concrete \nR6 (9.5,0) damp concrete \nR6 (9.5,0) wet new tarmac \nKey \npointer\nR2 \nR3 \nR4 \nR5 R6 \nR1 \nR3 \nR5 \nR6 \n-10 \n-5 \n0 \n5 \n10\n-10 -5 0 5 10\ndistance \/ m \ndi\nst\nan\nce\n \n\/ m\n \nR2 \nMap of leak locations \nWIND \nwind directiongas release\nFID sample probe VOGUE laser \npointer\n  \nFigure 12. Correspondence between field measurements from a prototype laser pointer and flame \nionisation detector targeted at the same sampling location, taken during a release of natural gas at \n10 litre min-1. \n \nThe results, when re-scaled manually, show a remarkable correspondence between the point sampled \nreadings in ppm and line integrated readings in ppm.m. We suggest that this is again a result of the \nleaking gas lying very close to ground level. Another related prediction of the model is that the \nmaximum in line-integrated gas concentration should coincide with the location of the gas leak source, \nand this has also been borne out in field tests. \n \n5 Discussion and conclusions \n \nA model has been developed that combines gas leak dispersion behaviour, reflectivity data and laser \npointer performance. Our model represents a simplified and idealised view of reality that has allowed \nus to quickly study a wide range of trends and phenomena that would have been impossible to \nquantify in real outdoor tests. We have been able to identify trends and highlight phenomena that help \nto understand the more complex interaction between real gas leaks plumes and our prototype laser \npointer. The model has its limitations and therefore the results should be treated with some caution. \nHowever, they have broadly agreed with the general findings of a series of practical field tests of laser \npointer prototypes.  \nThe model is limited in a number of ways: \n(i) Reflectivity data is limited, being based on a restricted number of measurements taken using \nequipment that wasn’t fully representative of the laser pointer itself. Further work is needed \nusing a prototype pointer to investigate real reflectivities at specific angles of incidence. \n0\n100 \n200 \n300 \n400 \n500\nCo\nn\nce\nn\ntra\ntio\nn\n \n\/ p\npm\n.\nm\n \nLaser pointer\nFID \n0 5 10 15\nTime \/ mins \n0 \n2 \n4 \n6 \n8\n10 \nCo\nn\nce\nn\ntra\ntio\nn\n \n\/ \npp\nm\n \n×\n \n10\n00\n \n(ii) The gas leak model used in this work was non-physical around the leak source, for example \ngiving an infinite gas concentration at the origin. To circumvent this problem, the gas \nconcentration was effectively capped at 100% and the leak source extended to a finite but small \nvolume. During modelling, it has been found that the area around the source has by far the \ngreatest significance for leak detection, but this is where the model is considered most \nambiguous and based on limited experimental data. \n(iii) The leak dispersion model was constructed for time-averaged gas concentrations as measured in \na wind tunnel. However, the temporal variation of real gas concentrations can be very high, \ndepending on wind velocity and turbulence. Thus, much higher concentrations than in the model \nare occasionally detectable, with better signal to noise ratios. \nDespite these potential problems, the modelling work has enabled us to look at trends in performance \nmuch more quickly than would have been the case in the field. It has shown us a number of possible \neffects that are worth investigating and confirming with the real instrument, as follows. \n(i) The potential for confusion arising from background methane. \n(ii) Possible ambiguities that arise when standing in or near to the leaking gas plume. \n(iii) The level of pointing accuracy required for zero tracing. \n(iv) The optimum height for use. \nFor ground based leak sources, the laser pointer measurements appear to be dominated by gas \nconcentrations over a short distance, close to the target surface and to the position sampled by the FID, \nfor both modelled and field results. Maxima in both modelled and field measurements have shown \ngood spatial correspondence to the leak source. This characteristic makes laser pointers potentially \nintuitive for operators more familiar with point sampling. \n \n \n6 Acknowledgements \n \nWe would like to thank the two organisations who funded this work under EC contract no. NNE5-\n1999-20031, namely the European Commission and National Grid Transco Plc. \n \n7 References\n \n[1]  T. Iseki; H. Tai, K. Kimura, Meas. Sci. Technol. 11 (2000), 594-602.  \n[2]  R.T. Wainner, B.D. Green, M.G. Allen, M.A. White, J. Stafford-Evans, R. Naper. Appl. Phys. B \n75 (2002), 249-254.  \n[3]  B. van Well, S. Murray, J. Hodgkinson, R. Pride, R. Strzoda, G. Gibson, M. Padgett, J. Opt. A \n7, (2005) S420-S424.  \n[4]  F.P. Lees, Loss Prevention in the Process Industries, Butterworth-Heinemann, (1996). \n[5]  J. Hodgkinson, Q. Shan, R. Pride, Environ. Sci. and Technol. (submitted 2005). \n[6]  M. Minnaert, Astrophys. J. 93 (1941), 403-410. \n[7]  W.G. Rees, Physical principles of remote sensing, 2nd ed., Cambridge University Press, \nCambridge (2001). \n[8]  Of 1.35 m reported gas UK escapes in 2001, over 259,000 were outside reports, of which \naround 25% resulted in 'no gas found'. NGT website, \nhttp:\/\/www.transco.co.uk\/safety\/index\/index.asp, (May 2005). \n[9]  D.J. Wuebbles, K. Hayhoe, Earth-Sci. Rev. 57 (2002), 177-210. \n \n \n \n \nAPPENDIX A. Derivation of reflectivity equation \n \nIseki et al used the following equation in their model: \n  Wcos\n2\n)1( 12 Ω+= − dkPdP ktotir θpi\nρ\n  (5) \nWe realised that this would not normalise successfully for all values of k, so for clarity we show a \ndetailed derivation of our equation (3) in this appendix. \n \nConsider a light beam incident on an area δA, as shown in Figure 13. In cylindrical polar coordinates \nthe incident beam has angle θi to the normal and rotational angle φi about the normal axis. For \nsimplicity, the angle φ has been omitted from the figure, and we assume no dependence on φ.  \n \n  \nFigure 13. Schematic of terms used to calculate scattered power distribution. \n \nThe following radiometric definitions are given by Rees[7]. Let F be the flux density of incoming \nradiation in W m-2, which is a constant. The irradiance at the surface, E, is given by \n  \n2mWcos −= iFE θ .  (6) \nWe define Lr(θr,φr) as the radiance of scattered radiation in the direction (θr,φr), in W m-2 sr-1. the \nbidirectional reflectance distribution function, BRDF, is then defined as \n  \n( ) 1sr, −=\nE\nL\nBRDF rrr\nϕθ\n.  (7) \nFor a Lambertian surface, BRDF=1\/pi, but this model was altered by Minnaert who suggested the \nfollowing relationship[6]; \n  ( ) 11 srcoscos −− ⋅⋅= constantBRDF kri θθ ,  (8) \nwhere k is the so-called Minnaert constant, a parameter that describes non-Lambertian scattering \ndistributions (k=1 for a Lambertian surface). \n \nThe contribution to power dI in direction (θ,φ), into solid angle dΩ, is given by \nθi θi \nF \ndA \ndΩ \n  Wcos Ω= ddALdI θ ,  (9) \nNow we apply these definitions to our system. In this case θi = θr, and we can set them both equal to θ \nfor simplicity. At large distances we make a small angle approximation and define dA as the projected \ncross-sectional area of our laser beam at angle θ, such equation (6) gives; \n  \n2mWcos −==\ndA\nP\nFE iiθ ,  (10) \nwhere Pi is the incident light power in watts. The backscattered radiance from area dA is given by \nequation (7): \n  \n12 srmW −−⋅=⋅=\ndA\nP\nBRDFEBRDFL ir .  (11) \nNow using equations (9) and (11), we find the contribution to the received light power dPr, assuming \nthat we collect light from the same illuminated area dA (which is true for our system in which the laser \nbeam underfills the detectable area): \n  Wcos Ω⋅= dPBRDFdP ir θ ,  (12) \nNow substituting from equation (8) gives the following. \n  Wcos 12 Ω⋅= − dPconstantdP kir θ ,  (13) \nThe value of the constant is determined by normalisation, invoking a constant ρtot as the total reflection \ncoefficient, Pr\/Pi: \n  Wsin2costota\n2\n0\n12 θθpiθρ\npi\nθ\ndPconstantPl kitotr ∫\n=\n−\n⋅⋅= ,  (14) \ngiving \n  Wcos 12 Ω= − dkPdP ktotir θpi\nρ\n.  (15) \nThis is slightly different to the equation used by Iseki et al. However, for values of k between values of \n0.5 and 2.6 (see Table 2) we found little practical difference between the two equations for the same \nsurface, and both showed a good fit to the experimental data. \nAPPENDIX B. Reflectivity data \n \n \nTable 2. Comparison of the reflectivity of different surfaces with a reference. Left hand side: measured \nrelative reflectivity at 1651nm. Right hand side: fitted reflectivity parameters following equation (3). \n \nMeasured relative reflectance Fitted reflectivity parameters \nAngle to normal (θ) \nMaterial \n15º 45º 75º \nρtot k \nrms fit \nerror \/ 10-3 \nSpectralon reference 0.99 (by definition) 0.99 1.5 0 \nWhite melamine 0.69 0.69 0.51 0.65 1.09 8 \nRed brick 0.60 0.70 1.12 0.77 0.76 3 \nDamp red brick 0.44 0.43 0.82 0.54 0.77 10 \nWhite road marking 0.59 0.66 0.59 0.62 0.96 13 \nGrass 0.45 0.34 0.32 0.35 1.26 11 \nWood (old rough pine) 0.40 0.43 0.71 0.48 0.79 6 \nDamp wood 0.19 0.20 0.24 0.21 0.91 0.7 \nWet wood 0.09 0.15 0.09 0.12 0.9 10 \nSoil (clay type) 0.37 0.50 1.32 0.68 0.52 0.2 \nDamp soil 0.16 0.19 0.56 0.29 0.513 6 \nConcrete slab 0.27 0.32 0.53 0.36 0.74 2 \nDamp concrete slab 0.10 0.08 0.09 0.085 1.11 2 \nWet concrete slab 0.06 0.05 0.03 0.047 1.24 0.04 \nSteel bench 0.23 0.069 0.48 0.22 0.70 36 \nGrey painted lab floor 0.14 0.10 0.12 0.11 1.24 6 \nPaving bricks 0.13 0.21 0.39 0.23 0.60 6 \nOld tarmac on road 0.11 0.13 0.31 0.17 0.60 1.5 \nNew tarmac (3 month) 0.065 0.069 0.18 0.097 0.60 2 \nWet new tarmac 0.034 0.026 0.033 0.029 1.12 1.3 \nBitumen 0.053 0.094 0.16 0.096 0.61 4 \nBlack PVC 0.036 0.013 0.013 0.015 2.60 1.0 \n"}