{"doi":"10.5194\/angeo-23-87-2005","coreId":"71145","oai":"oai:eprints.lancs.ac.uk:6655","identifiers":["oai:eprints.lancs.ac.uk:6655","10.5194\/angeo-23-87-2005"],"title":"Phenomena in the ionosphere-magnetosphere system induced by injection of powerful HF radio waves into nightside auroral ionosphere","authors":["Blagoveshchenskaya, N. F.","Borisova, T. D.","Kornienko, V. A.","Thidé, B.","Rietveld, M. T.","Kosch, M. J.","Bösinger, T."],"enrichments":{"references":[{"id":16377601,"title":"A new digital all-sky imager experiment for optical auroral studies in conjunction with Scandinavian twin auroral radar experiment,","authors":[],"date":"1998","doi":"10.1063\/1.1148697","raw":"Kosch, M. J., Hagfors T., and Nielsen, E.: A new digital all-sky imager experiment for optical auroral studies in conjunction with Scandinavian twin auroral radar experiment, Rev. Sci. Instr., 69, 578–584, 1998.","cites":null},{"id":16377579,"title":"A statistical study of diurnal, seasonal and solar cycle variations of F-region and topside auroral upﬂows observed by EISCAT between","authors":[],"date":"1984","doi":"10.1007\/s00585-998-1144-0","raw":"Foster, C., Lester, M., and Davies, J. A.: A statistical study of diurnal, seasonal and solar cycle variations of F-region and topside auroral upﬂows observed by EISCAT between 1984 and 1996, Ann. Geophys., 16, 1144–1158, 1998, SRef-ID: 1432-0576\/ag\/1998-16-1144.","cites":null},{"id":16377572,"title":"and Thid´ e, B.: Doppler shift simulation of scattered HF signals during the Tromsø HF pumping experiment on 16","authors":[],"date":"1996","doi":"10.5194\/angeo-20-1479-2002","raw":"Borisova, T. D., Blagoveshchenskaya, N. F., Moskvin, I. V., Rietveld, M. T., Kosch, M. J., and Thid´ e, B.: Doppler shift simulation of scattered HF signals during the Tromsø HF pumping experiment on 16 February, 1996, Ann. Geophys., 20, 1479–1486, 2002, SRef-ID: 1432-0576\/ag\/2002-20-1479.","cites":null},{"id":16377568,"title":"Artiﬁcial airglow excited by high-power radio waves,","authors":[],"date":"1988","doi":"10.1126\/science.242.4881.1022","raw":"Bernhardt, P. A., Duncan, L. M., and Tepley, C. A.: Artiﬁcial airglow excited by high-power radio waves, Science, 242, 1022– 1027, 1988.","cites":null},{"id":16377592,"title":"Aspect angle dependence","authors":[],"date":"1999","doi":"10.1016\/s0273-1177(99)00555-4","raw":"Isham, B., Rietveld, M. T., Hagfors, T., La Hoz, C., Mishin, E., Kofman, W., Leyser, T. B., and van Eyken, A. P.: Aspect angle dependence of HF enhanced incoherent backscatter, Adv. SpaceN. F. Blagoveshchenskaya et al.: Phenomena in the ionosphere-magnetosphere system 99 Res., 24, 1003–1006, 1999.","cites":null},{"id":16377582,"title":"Atmospheric gravity waves generated in the high-latitude ionosphere: a review,","authors":[],"date":null,"doi":"10.1029\/rg020i002p00293","raw":"Hunsucker, R. D.: Atmospheric gravity waves generated in the high-latitude ionosphere: a review, Rev. Geophys., 20, 293–315, 1982.","cites":null},{"id":16377621,"title":"Convection electric ﬁeld observations near Arecibo HF heater beam,","authors":[],"date":"2001","doi":"10.1029\/2000ja000279","raw":"Peria, W. J. and Kelley, M. C.: Convection electric ﬁeld observations near Arecibo HF heater beam, J. Geophys. Res., 106, 18, 517–524, 2001.","cites":null},{"id":16377635,"title":"Coupled-mode scenario for the magnetospheric dynamics,","authors":[],"date":"1996","doi":"10.1029\/95ja03192","raw":"Sergeev, V. A., Pulkkinen, T. I., and Pellinen, R. J.: Coupled-mode scenario for the magnetospheric dynamics, J. Geophys. Res., 101, 13047–13065, 1996.","cites":null},{"id":16377620,"title":"Current convective instability in the diffuse aurora,","authors":[],"date":null,"doi":"10.1029\/gl006i004p00332","raw":"Ossakow, S. L. and Chaturvedi, P. K.: Current convective instability in the diffuse aurora, Geophys. Res. Lett., 6, 332–335,1979.","cites":null},{"id":16377600,"title":"Density depletions at the 10-m scale induced by the Arecibo heater,","authors":[],"date":"1995","doi":"10.1029\/95ja00063","raw":"Kelley, M. C., Arce, T. L., Salowey, J., Sulzer, M., Armstrong, W. T., Carter, M., and Duncan, L.: Density depletions at the 10-m scale induced by the Arecibo heater, J. Geophys. Res., 100, A9, 17367–17376, 1995.","cites":null},{"id":16377614,"title":"Dynamic of auroral arc formation during substorms, in","authors":[],"date":"1998","doi":"10.1007\/978-94-011-4798-9_6","raw":"Lysak, R. L. and Song, Y.: Dynamic of auroral arc formation during substorms, in Proc. Substorms 4 (ICS 4), vol. 238, 35–40, Kluwer Academic Publishers, Dordrecht, 1998. M¨ alkki A. and Lundin, R.: Altitude distributions of upward ion beams and solitary wave structures on the Viking data, Geophys.","cites":null},{"id":16377652,"title":"EISCAT observations of topside ionospheric ion outﬂows during auroral activity: revisited,","authors":[],"date":"1992","doi":"10.1029\/91ja02438","raw":"Wahlund, J.-E., Opgenoorth, H. J., H¨ aggstr¨ om, I., Winsler, K. J., and Jones, G. O. L.: EISCAT observations of topside ionospheric ion outﬂows during auroral activity: revisited, J. Geophys. Res., 97, 3019–3037, 1992.","cites":null},{"id":16377626,"title":"EISCAT: Early history and the ﬁrst ten years of operation ,","authors":[],"date":"1993","doi":"10.1016\/0021-9169(93)90002-g","raw":"Rishbeth, H. and van Eyken, T.: EISCAT: Early history and the ﬁrst ten years of operation , J. Atmos. Terr. Phys., 55, 525–542, 1993.","cites":null},{"id":16377612,"title":"Electrodynamic coupling of the magnetosphere and ionosphere,","authors":[],"date":"1990","doi":"10.1007\/bf00704239","raw":"Lysak, R. L.: Electrodynamic coupling of the magnetosphere and ionosphere, Space Sci. Rev., 52, 33–87, 1990.","cites":null},{"id":16377577,"title":"Enhanced ion acoustic ﬂuctuations and ion outﬂow,","authors":[],"date":"1999","doi":"10.1007\/s00585-999-0182-6","raw":"Forme, F. R. E. and Fontaine, D.: Enhanced ion acoustic ﬂuctuations and ion outﬂow, Ann. Geophys., 17, 190–209, 1999, SRef-ID: 1432-0576\/ag\/1999-17-190.","cites":null},{"id":16377566,"title":"F region ion temperature enhancements resulting from Joule heating,","authors":[],"date":"1983","doi":"10.1029\/ja088ia05p04114","raw":"Baron, M. J. and Wand, R. H.: F region ion temperature enhancements resulting from Joule heating, J. Geophys. Res., 88, 4114– 4118, 1983.","cites":null},{"id":16377630,"title":"FAST observations of ULF waves injected into the magnetosphere by means of modulated RF heating of the auroral electrojet,","authors":[],"date":"2000","doi":"10.1029\/2000gl011882","raw":"Robinson, T. R., Strangeway, R., Wright, D. M., Davies, J. A., Horne, R. B., Yeoman, T. K., Stocker, A. J., Lester, M., Rietveld, M. T., Mann, I. R., Carlson, C. W., and McFadden, J. P.: FAST observations of ULF waves injected into the magnetosphere by means of modulated RF heating of the auroral electrojet, Geophys. Res. Lett., 27, 19, 3165–3168, 2000.","cites":null},{"id":16377613,"title":"Feedback instability of the ionospheric resonant cavity,","authors":[],"date":"1991","doi":"10.1029\/90ja02154","raw":"Lysak, R. L.: Feedback instability of the ionospheric resonant cavity, J. Geophys. Res., 96, 1553–1568, 1991.","cites":null},{"id":16377628,"title":"First CUTLASS–EISCAT heating results,","authors":[],"date":"1998","doi":"10.1016\/s0273-1177(97)01000-4","raw":"Robinson, T. R., Stocker, A., Bond, G., Eglitis, P., Wright, P., Jones, T. B., and Rietveld, M. T.: First CUTLASS–EISCAT heating results, Adv. Space Res., 21, 5, 663–666, 1998.","cites":null},{"id":16377581,"title":"First direct observation of the reduced striations at pump frequencies close to the electron gyroharmonics,","authors":[],"date":"1999","doi":"10.1007\/s005850050848","raw":"Honary, F., Robinson, T. R., Wright, D. M., Stocker, A. J., Rietveld, M. T., and McCrea, I.: First direct observation of the reduced striations at pump frequencies close to the electron gyroharmonics, Ann. Geophys., 17, 1235–1238, 1999, SRef-ID: 1432-0576\/ag\/1999-17-1235.","cites":null},{"id":16377567,"title":"First evidence at high latitudes for the ionospheric Alfv´ en resonator,","authors":[],"date":"1999","doi":"10.1029\/1999ja900165","raw":"Belyaev, P. P., B¨ osinger, T., Isaev, S. V., Trakhtengerts, V. Y., and Kangas, J.: First evidence at high latitudes for the ionospheric Alfv´ en resonator, J. Geophys. Res., 104, 4305–4318, 1999.","cites":null},{"id":16377642,"title":"First observations of stimulated electromagnetic emissions at Arecibo,","authors":[],"date":"1989","doi":"10.1029\/gl016i005p00369","raw":"Thid´ e, B., Hedberg, A., Fejer, J. A., and Sulzer, M. P.: First observations of stimulated electromagnetic emissions at Arecibo, Geophys. Res.Lett., 16, 369–372, 1989.","cites":null},{"id":16377593,"title":"Frequency dependence of anomalous absorption caused by high power radio waves,","authors":[],"date":"1984","doi":"10.1016\/0021-9169(84)90140-5","raw":"Jones, T. B., Robinson, T. R., Stubbe, P., and Kopka, H.: Frequency dependence of anomalous absorption caused by high power radio waves, J. Atmos. Terr. Phys., 46, 147–153, 1984.","cites":null},{"id":16377604,"title":"Geocorona of hot plasma,","authors":[],"date":"2001","doi":null,"raw":"Kovtyukh, A. S.: Geocorona of hot plasma, Cosmic Res., Engl. Transl., 39, 527–558, 2001.","cites":null},{"id":16377570,"title":"Geophysical phenomena during an ionospheric modiﬁcation experiment at Tromsø,","authors":[],"date":null,"doi":"10.1007\/s00585-998-1212-5","raw":"Blagoveshchenskaya, N. F., Kornienko, V. A., Petlenko, A. V., Brekke, A., and Rietveld, M. T.: Geophysical phenomena during an ionospheric modiﬁcation experiment at Tromsø, Ann. Geophys., 16, 1212–1225, 1998a, SRef-ID: 1432-0576\/ag\/1998-16-1212.","cites":null},{"id":16377655,"title":"High spatial and temporal resolution observations of an impulse-driven ﬁeld line resonance in radar backscatter artiﬁcially generated with the Tromsø heater,","authors":[],"date":"1997","doi":"10.1007\/s00585-997-0634-9","raw":"Yeoman, T. K., Wright, D. M., Robinson, T. R., Davies, J. A., and Rietveld, M. T.: High spatial and temporal resolution observations of an impulse-driven ﬁeld line resonance in radar backscatter artiﬁcially generated with the Tromsø heater, Ann. Geophys., 15, 634–644, 1997, SRef-ID: 1432-0576\/ag\/1997-15-634.","cites":null},{"id":16377603,"title":"Highlatitude HF-induced airglow displaced equatorwards of the pump beam,","authors":[],"date":"2000","doi":"10.1029\/2000gl003754","raw":"Kosch, M. J., Rietveld, M. T., Hagfors, T., and Leyser, T. B.: Highlatitude HF-induced airglow displaced equatorwards of the pump beam, Geophys. Res. Lett., 27, 2817–2820, 2000.","cites":null},{"id":16377625,"title":"Ionospheric electron heating, aurora and striations induced by powerful HF radio waves at high latitudes: aspect angle dependence,","authors":[],"date":"2003","doi":"10.1029\/2002ja009543","raw":"Rietveld, M. T., Kosch, M. J., Blagoveshchenskaya, N. F., Kornienko, V. A., Leyser, T. B., and Yeoman, T. K.: Ionospheric electron heating, aurora and striations induced by powerful HF radio waves at high latitudes: aspect angle dependence, J.Geophys.Res., 108(A4), 1141, doi:10.1029\/2002JA009543, 2003. Rietveld, M. T., Kohl, H., Kopka, H., and Stubbe, P.: Introduction to ionospheric heating at Tromsø, I. Experimental overview, J.","cites":null},{"id":16377569,"title":"Ionospheric HF pump wave triggering of local auroral activation,","authors":[],"date":"2001","doi":"10.1029\/2001ja900002","raw":"Blagoveshchenskaya, N. F., Kornienko, V. A., Borisova, T. D., Thid´ e, B., Kosch, M. J., Rietveld, M. T., Mishin, E. V., Luk’yanova, R. Yu., and Troshichev, O. A.: Ionospheric HF pump wave triggering of local auroral activation, J. Geophys. Res., 106, 29071–29089, 2001.","cites":null},{"id":16377575,"title":"Large F region electron-temperature enhancements generated by highpower HF radio waves,","authors":[],"date":"1987","doi":"10.1029\/gl014i009p00953","raw":"Djuth, F. T., Thid´ e, B., Ierkic, H. M., and Sulzer, M. P.: Large F region electron-temperature enhancements generated by highpower HF radio waves, Geophys. Res. Lett., 14, 953–956, 1987.","cites":null},{"id":16377634,"title":"Low energy upﬂowing ion events observed by EXOS-D: Initial results,","authors":[],"date":"1991","doi":"10.1029\/91gl00028","raw":"Sagawa, E. I., Iwamoto, I., Watanabe, S., Whalen, B. A., Yau, A. W., and Fukunishi, H.: Low energy upﬂowing ion events observed by EXOS-D: Initial results, Geophys. Res. Lett., 18, 337– 340, 1991.","cites":null},{"id":16377651,"title":"Magnetic activity in the Polar Cap – a new index,","authors":[],"date":"1988","doi":null,"raw":"Troshichev, O. A., Andresen, V. G., Vennerstr¨ om, S., and FriisChristensen, E.: Magnetic activity in the Polar Cap – a new index, Planet. Space Sci., 36, 1095–1103, 1988.100 N. F. Blagoveshchenskaya et al.: Phenomena in the ionosphere-magnetosphere system Vas’kov, V. V., Dimant, Ya. S., and Ryabova, N. A.: Magnetospheric plasma thermal perturbations induced by resonant heating of ionospheric F-region by high-power radio wave, Adv.","cites":null},{"id":16377596,"title":"Magnetosphere-Ionosphere Coupling,","authors":[],"date":"1993","doi":"10.1007\/978-3-642-50062-6","raw":"Kamide, Y. and Baumjohann, W.: Magnetosphere-Ionosphere Coupling, Springer-Verlag, New York, 1993.","cites":null},{"id":16377623,"title":"Measurements of HF-enhanced plasma and ion lines at EISCAT with high-altitude resolution,","authors":[],"date":"2000","doi":"10.1029\/1999ja900476","raw":"Rietveld, M. T., Isham, B., Kohl, H., La Hoz, C., and Hagfors, T.: Measurements of HF-enhanced plasma and ion lines at EISCAT with high-altitude resolution, J. Geophys. Res., 105, 7429–7439, 2000.","cites":null},{"id":16377573,"title":"Model of the auroral electrojets,","authors":[],"date":"1964","doi":"10.1029\/jz069i023p04983","raw":"Bostr¨ om, R. A.: Model of the auroral electrojets, J. Geophys. Res. 69, 4983–4999, 1964.","cites":null},{"id":16377590,"title":"New phenomena observed by EISCAT during an RF ionospheric modiﬁcation experiment,","authors":[],"date":"1990","doi":"10.1029\/rs025i003p00251","raw":"Isham, B., Kofman, W., Hagfors, T., Nordling, J., Thid´ e, B., La Hoz, C., and Stubbe, P.: New phenomena observed by EISCAT during an RF ionospheric modiﬁcation experiment, Radio Sci., 25, 251–262, 1990.","cites":null},{"id":16377585,"title":"Nonlinear phenomena in the ionosphere,","authors":[],"date":"1978","doi":"10.1007\/978-3-642-87649-3","raw":"Gurevich, A. V.: Nonlinear phenomena in the ionosphere, Springer, New York, 1978.","cites":null},{"id":16377587,"title":"Nonlinear structuring of the ionosphere modiﬁed by powerful radio waves at low latitudes,","authors":[],"date":"1999","doi":"10.1016\/s0375-9601(98)00786-5","raw":"Gurevich, A. V., Carlson, H., Kelly, M., Hagfors, T., Karashtin, A., and Zybin, K. P.: Nonlinear structuring of the ionosphere modiﬁed by powerful radio waves at low latitudes, Phys. Lett. A, 251, 311–321, 1999.","cites":null},{"id":16377588,"title":"Nonlinear structuringandsouthwardshiftofastronglyheatedregioninionospheric modiﬁcation,","authors":[],"date":"2001","doi":"10.1016\/s0375-9601(01)00516-3","raw":"Gurevich, A. V., Carlson, H., and Zybin, K. P.: Nonlinear structuringandsouthwardshiftofastronglyheatedregioninionospheric modiﬁcation, Phys. Lett. A, 288, 231–239, 2001.","cites":null},{"id":16377644,"title":"Observations of stimulated electromagnetic emissions in ionospheric heating experiments,","authors":[],"date":"1983","doi":"10.1029\/rs018i006p00851","raw":"Thid´ e, B., Derblom, H., Hedberg, A., Kopka, H., and Stubbe, P.: Observations of stimulated electromagnetic emissions in ionospheric heating experiments, Radio Sci., 18, 851–859, 1983.","cites":null},{"id":16377646,"title":"Observations of stimulated scattering of a strong high-frequency radio wave in the ionosphere,","authors":[],"date":null,"doi":"10.1103\/physrevlett.49.1561","raw":"Thid´ e, B., Kopka, H., and Stubbe, P.: Observations of stimulated scattering of a strong high-frequency radio wave in the ionosphere, Phys. Rev. Lett., 49, 1561–1563, 1982.","cites":null},{"id":16377598,"title":"Onthecauseofsubstormexpansiononsetandtheprocesses driving the substorm expansion phase,","authors":[],"date":"1993","doi":"10.1016\/0021-9169(93)90091-c","raw":"Kan, J.: Onthecauseofsubstormexpansiononsetandtheprocesses driving the substorm expansion phase, J. Atmos. Terr. Phys., 55, 979–983, 1993.","cites":null},{"id":16377583,"title":"Propagation of electromagnetic waves in plasma (in Russian),","authors":[],"date":"1967","doi":"10.1063\/1.3057811","raw":"Ginzburg, V. L.: Propagation of electromagnetic waves in plasma (in Russian), Nauka, Moscow, 1967.","cites":null},{"id":16377580,"title":"Radar backscattering from artiﬁcial ﬁeld-aligned irregularities,","authors":[],"date":"1999","doi":"10.1029\/1998rs900035","raw":"Franz, T. L., Kelley, M. C., and Gurevich, A. V.: Radar backscattering from artiﬁcial ﬁeld-aligned irregularities, Radio Sci., 34, 465–475, 1999. Haerendel, G.: Field-aligned currents in the Earth’s magnetosphere, in physics of magnetic ﬂux ropes, Geophys. Monogr. Ser., vol.","cites":null},{"id":16377578,"title":"Radar observations of magnetosphere – ionosphere coupling at middle and high latitudes,","authors":[],"date":"1995","doi":"10.5636\/jgg.47.801","raw":"Foster, J. C.: Radar observations of magnetosphere – ionosphere coupling at middle and high latitudes, J. Geomag. Geoelectr., 47, 801–812, 1995.","cites":null},{"id":16377616,"title":"Response of the convecting high-latitude F layer to a powerful HF wave,","authors":[],"date":"1997","doi":"10.1007\/s00585-997-1291-8","raw":"Mingaleva, G. I. and Mingalev, V. S.: Response of the convecting high-latitude F layer to a powerful HF wave, Ann. Geophys., 15, 1291–1300, 1997, SRef-ID: 1432-0576\/ag\/1997-15-1291.","cites":null},{"id":16377654,"title":"Reverberative scattering on artiﬁcial ionospheric turbulence, Izv. Vuzov (Radioﬁzika and Quantum Electronics,","authors":[],"date":"1989","doi":null,"raw":"Yampolski, Y. M.: Reverberative scattering on artiﬁcial ionospheric turbulence, Izv. Vuzov (Radioﬁzika and Quantum Electronics, in Russian), 32, 519–521, 1989.","cites":null},{"id":16377640,"title":"Review of ionospheric modiﬁcation experiments at Tromsø,","authors":[],"date":"1996","doi":"10.1016\/0021-9169(95)00041-0","raw":"Stubbe, P.: Review of ionospheric modiﬁcation experiments at Tromsø, J. Atmos. Terr. Phys., 58, 349–368, 1996.","cites":null},{"id":16377594,"title":"Signiﬁcance of ﬁeld-aligned currents for F-region perturbations,","authors":[],"date":"1996","doi":"10.1016\/0021-9169(95)00155-7","raw":"Kagan, L. M. and Frolov, V. L.: Signiﬁcance of ﬁeld-aligned currents for F-region perturbations, J. Atmos. Terr. Phys., 58, 1465– 1474, 1996.","cites":null},{"id":16377618,"title":"Simultaneous EISCAT Svalbard and VHF radar observations of ion upﬂows at different aspect angles,","authors":[],"date":"2000","doi":"10.1029\/1999gl010665","raw":"Ogawa, Y., Fujii, R., Buchert, S. C., Nozawa, S., Watanabe, S., and van Eyken, A. P.: Simultaneous EISCAT Svalbard and VHF radar observations of ion upﬂows at different aspect angles, Geophys. Res. Lett., 27, 81–84, 2000.","cites":null},{"id":16377638,"title":"Small scale Alfv´ enic structure in the aurora,","authors":[],"date":"2000","doi":null,"raw":"Stasiewicz, K., Bellan, P., Chaston, C., Kletzing, C., et al.: Small scale Alfv´ enic structure in the aurora, Space Sci. Rev., 92, 423– 533, 2000.","cites":null},{"id":16377608,"title":"Stimulated electromagnetic emission near electron cyclotron harmonics in the ionosphere,","authors":[],"date":"1989","doi":"10.1103\/physrevlett.63.1145","raw":"Leyser, T. B., Thid´ e, B., Derblom, H., Hedberg, A., Lundborg, B., Stubbe, P., and Kopka, H.: Stimulated electromagnetic emission near electron cyclotron harmonics in the ionosphere, Phys. Rev. Lett., 63, 1145–1147, 1989.","cites":null},{"id":16377606,"title":"Stimulated electromagnetic emissions by highfrequency electromagnetic pumping of the ionospheric plasma,","authors":[],"date":"2001","doi":null,"raw":"Leyser, T. B.: Stimulated electromagnetic emissions by highfrequency electromagnetic pumping of the ionospheric plasma, Space Sci. Rev., 98, 223–328, 2001.","cites":null},{"id":16377571,"title":"Stimulated emissions around the second harmonic of Tromsø heater frequency observed by long-distance diagnostic HF tools,","authors":[],"date":"1998","doi":"10.1029\/98gl00492","raw":"Blagoveshchenskaya, N. F., Kornienko, V. A., Rietveld, M. T., Thid´ e, B., Brekke, A., Moskvin, I. V., and Nozdrachev, S.: Stimulated emissions around the second harmonic of Tromsø heater frequency observed by long-distance diagnostic HF tools, Geophys. Res. Lett., 25, 873–876, 1998b.","cites":null},{"id":16377637,"title":"Stochastic ion heating by orbit chaotization on electrostatic waves and nonlinear structures,","authors":[],"date":"2000","doi":"10.1238\/physica.topical.084a00060","raw":"Stasiewicz, K., Lundin, R., and Marklund, G.: Stochastic ion heating by orbit chaotization on electrostatic waves and nonlinear structures, Physica Scripta, T84, 60–63, 2000.","cites":null},{"id":16377610,"title":"Substorms: Fundamental observational features, distinction from other disturbances, and external triggering,","authors":[],"date":"1996","doi":"10.1029\/95ja01987","raw":"Lyons, L. R.: Substorms: Fundamental observational features, distinction from other disturbances, and external triggering, J. Geophys. Res., 101, 13011–13025, 1996.","cites":null},{"id":16377648,"title":"T.: Excitation of Alfv´ en waves and vortices in the ionospheric Alfv´ en resonator by modulated powerful radio waves.,","authors":[],"date":"2000","doi":"10.1016\/s1364-6826(99)00121-2","raw":"Trakhtengerts, V. Y., Belyaev, P. P., Polyakov, S. V., Demekhov, A. G., and B¨ osinger, T.: Excitation of Alfv´ en waves and vortices in the ionospheric Alfv´ en resonator by modulated powerful radio waves., J. Atmos. Terr. Phys., 62, 267–276, 2000.","cites":null},{"id":16377565,"title":"The development of the auroral substorm,","authors":[],"date":"1964","doi":"10.1016\/0032-0633(64)90151-5","raw":"Akasofu, S.-I.: The development of the auroral substorm, Planet. Space Sci., 12, 273–282, 1964.","cites":null},{"id":16377632,"title":"The evolving concept of a magnetospheric substorm,","authors":[],"date":"1999","doi":"10.1016\/s1364-6826(98)00119-9","raw":"Rostoker, G.: The evolving concept of a magnetospheric substorm, J. Atmos. Terr. Phys., 61, 85–100, 1999.","cites":null},{"id":16377576,"title":"The phase speed of artiﬁcial ﬁeld-aligned irregularities observed by CUTLASS during HF modiﬁcation of the auroral ionosphere,","authors":[],"date":"1998","doi":"10.1029\/97ja03233","raw":"Eglitis, P., Robinson, T. R., Rietveld, M. T., Wright, D. M., and Bond, G. E.: The phase speed of artiﬁcial ﬁeld-aligned irregularities observed by CUTLASS during HF modiﬁcation of the auroral ionosphere, J. Geophys. Res, 103, 2253–2259, 1998.","cites":null},{"id":16377650,"title":"Turbulent Alfv´ en boundary layer in the polar ionosphere, 1. Excitation conditions and energetics,","authors":[],"date":"1991","doi":"10.1029\/91ja00376","raw":"Trakhtengerts, V. Y. and Feldstein, A. Y.: Turbulent Alfv´ en boundary layer in the polar ionosphere, 1. Excitation conditions and energetics, J. Geophys. Res., 96, 19363–19372, 1991.","cites":null},{"id":16377574,"title":"Unambiguous evidence of HF pump-enhanced airglow at auroral latitudes,","authors":[],"date":"1999","doi":"10.1029\/1999gl010693","raw":"Br¨ andstr¨ om, B. U. E., Leyser, T. B., Steen, A., Rietveld, M. T., Gustavsson, B., Aso, T., and Ejiri, M.: Unambiguous evidence of HF pump-enhanced airglow at auroral latitudes, Geophys. Res. Lett., 26, 3561–3564, 1999.","cites":null},{"id":16377609,"title":"Westward moving dynamic substorm features observed with the IMAGE magnetometer network and other ground-based instruments,","authors":[],"date":"1998","doi":"10.1007\/s005850050613","raw":"L¨ uhr, H., Aylward, A., Buchert, S. C., Pajunpaa, A., Holmboe, T., and Zalewski, S. M.: Westward moving dynamic substorm features observed with the IMAGE magnetometer network and other ground-based instruments, Ann. Geophys., 16, 425–440, 1998, SRef-ID: 1432-0576\/ag\/1998-16-425.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71145.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/6655\/1\/art_638.pdf","pdfHashValue":"b97e5cfa24477839f4270a0f033d6ddb00c8be81","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:6655<\/identifier><datestamp>\n      2018-01-24T03:15:22Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5431<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Phenomena in the ionosphere-magnetosphere system induced by injection of powerful HF radio waves into nightside auroral ionosphere<\/dc:title><dc:creator>\n        Blagoveshchenskaya, N. F.<\/dc:creator><dc:creator>\n        Borisova, T. D.<\/dc:creator><dc:creator>\n        Kornienko, V. A.<\/dc:creator><dc:creator>\n        Thidé, B.<\/dc:creator><dc:creator>\n        Rietveld, M. T.<\/dc:creator><dc:creator>\n        Kosch, M. J.<\/dc:creator><dc:creator>\n        Bösinger, T.<\/dc:creator><dc:subject>\n        T Technology (General)<\/dc:subject><dc:date>\n        2005-01<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/6655\/1\/art_638.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.5194\/angeo-23-87-2005<\/dc:relation><dc:identifier>\n        Blagoveshchenskaya, N. F. and Borisova, T. D. and Kornienko, V. A. and Thidé, B. and Rietveld, M. T. and Kosch, M. J. and Bösinger, T. (2005) Phenomena in the ionosphere-magnetosphere system induced by injection of powerful HF radio waves into nightside auroral ionosphere. Annales Geophysicae, 23 (1). pp. 87-100. ISSN 0992-7689<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/6655\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.5194\/angeo-23-87-2005","http:\/\/eprints.lancs.ac.uk\/6655\/"],"year":2005,"topics":["T Technology (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Annales Geophysicae (2005) 23: 87–100\nSRef-ID: 1432-0576\/ag\/2005-23-87\n© European Geosciences Union 2005\nAnnales\nGeophysicae\nPhenomena in the ionosphere-magnetosphere system induced by\ninjection of powerful HF radio waves into nightside auroral\nionosphere\nN. F. Blagoveshchenskaya1, T. D. Borisova1, V. A. Kornienko1, B. Thide´2, M. T. Rietveld3, M. J. Kosch4, and\nT. Bo¨singer5\n1Arctic and Antarctic Research Institute, 38 Bering Str., St. Petersburg, 199397, Russia\n2Swedish Institute of Space Physics, Box 537, SE-75221, Uppsala, Sweden\n3EISCAT, N9027, Ramfjordmoen, Norway\n4Department of Communication Systems, Lancaster University, LA1 4YR, Lancaster, UK\n5Department of Physical Sciences, University of Oulu, P.O. Box 3000, FIN-90014, Oulu, Finland\nReceived: 30 September 2003 – Revised: 2 February 2004 – Accepted: 8 March 2004 – Published: 31 January 2005\nPart of Special Issue “Eleventh International EISCAT Workshop”\nAbstract. Experimental results from three ionospheric HF\npumping experiments in overdense E or F regions are sum-\nmarized. The experiments were conducted by the use of the\nEISCAT HF Heating facility located near Tromsø, Norway,\nallowing HF pumping the ionosphere in a near geomagnetic\nfield-aligned direction. Distinctive features related to auro-\nral activations in the course of the experiments are identified.\nTypical features observed in all experiments are the follow-\ning: generation of scattered components in dynamic HF radio\nscatter Doppler spectra; strong increase of ion temperatures\nTi and local ionospheric electric field E0; modification of the\nauroral arc and local spiral-like formation. However, some\neffects were observed only when the HF pump wave was re-\nflected from the F2 layer. Among them are the generation\nof intense field-aligned ion outflows, and a strong increase\nin the electron temperature Te with altitude. A possible sce-\nnario for the substorm triggering due to HF pumping into an\nauroral ionosphere is discussed. The authors present their in-\nterpretation of the data as follows. It is suggested that two\npopulations of charged particles are at play. One of them\nis the runaway population of electrons and ions from the\nionosphere caused by the effects of the powerful HF radio\nwave. The other is the population of electrons that precipi-\ntate from the magnetosphere. It is shown that the hydrody-\nnamical equilibrium was disrupted due to the effects of the\nHF pumping. We estimate that the parallel electric field can\nreach values of the order of 30 mV\/m during substorm trig-\ngering.\nKey words. Ionosphere (active experiments; ionosphere-\nmagnetosphere interactions). Radio science (nonlinear phe-\nnomena).\nCorrespondence to: N. F. Blagoveshchenskaya\n(nataly@aari.nw.ru)\n1 Introduction\nThe significance of the general class of problems related to\nthe manmade impact on the near-Earth space environment is\nevident from the results of well-known scientific programs\nsuch as TRIGGER, CRRES, CEDAR, and HAARP. Never-\ntheless, a number of crucial problems still remain unsolved,\namong them those associated with the modification of the\nionosphere-magnetosphere coupling, the possible active role\nof the ionosphere in magnetospheric dynamics, and the re-\nsponse of the ionosphere-magnetosphere system to artificial\nperturbations. The controlled injection of powerful radio\nwaves into space from purpose-built ground-based HF ra-\ndio facilities has proved to be an excellent tool for studying\nthe associated fundamental linear and nonlinear plasma pro-\ncesses and instabilities.\nConsiderable success has been achieved by the use of the\nEISCAT HF Heating facility located at auroral latitudes in\nTromsø, Norway (see, for example, Stubbe, 1996 (and ref-\nerences therein); Thide´ et al., 1982; 1983; Rietveld et al.,\n1993, 2000; Robinson et al., 1998; Leyser, 2001; Leyser et\nal., 1989; Isham et al., 1990; 1999; Jones et al., 1984; Honary\net al., 1999; Yeoman et al., 1997; Bra¨ndstro¨m et al., 1999;\nEglitis et al., 1998; Blagoveshchenskaya et al., 1998b; Kosch\net al., 2000).\nIt should be noted that in most HF pumping experiments\nperformed hitherto, the plasma physics aspect has, for ob-\nvious reasons, dominated. However, taking the distinctive\nfeatures and behavior of the auroral ionosphere into account,\none would expect that the interaction between powerful HF\nradio waves and the auroral near-Earth space plasma can lead\nto the generation of specific modification effects not encoun-\ntered at middle latitudes. As this article will show, this is\nindeed the case.\n88 N. F. Blagoveshchenskaya et al.: Phenomena in the ionosphere-magnetosphere system\n 34\n \n \n \nTable 1. Operational modes of the EISCAT HF heating facility during experiments \n \nDate of experiments Operational modes \n16.02.1996 17.02.1996 2.10.1998 \nTime, UT 21-23 20-22 18-22 \nHeater frequency, kHz 4040 4040 4040 \nReflection layer of HF pump wave Es Es F2 \nElevation of HF heater antenna \nbeam and its width, degrees \n84±9 84±9 78±6 \nGain of HF heater antenna, dBi  19.9 19.9 22.35 \nERP, MW 53 53 188 \nHeating cycles, on\/off, min +4\/-6 +4\/-6 +8\/-7 \nPolarization O-mode O-mode O-mode \n \n Table 1. Operational modes of the EISCAT HF heating facility\nduring experiments.\nA large volume of work has been conducted by many sci-\nentists in understanding auroral substorm (see, for exam-\nple, Akasofu, 1964; Kamide and Baumjohann, 1993; Kan,\n1993; Foster, 1995; Lyons, 1996; Sergeev et al. 1996; Ros-\ntoker, 1999). Nonetheless, some problems still remaine un-\nsolved, among them is the role of internal instabilities in the\nmagnetosphere-ionosphere system leading to substorm trig-\ngering, a role of the auroral ionosphere in the substorm pro-\ncess. In this respect HF pumping experiments at auroral lat-\nitudes can provide answers to such problems. Experimental\nresults from multi-instrument observations during Tromsø\nionospheric modification experiments (Blagoveshchenskaya\net al., 2001), make it evident that HF pumping into a sporadic\nauroral Es layer in the near field-aligned direction, can lead\nto a local auroral activation. The results obtained suggest\nthat the energy source for such activations is the interaction\nbetween the solar wind and the magnetosphere.\nCertain possibilities of HF pumping experiments related to\nthe role of the ionospheric Alfve´n resonator (IAR) in auroral\nphenomena were considered by Trakhtengerts et al. (2000).\nThe theory developed allows for two types of triggering of\nthe Alfve´n vortex instability (AVI) in the IAR. The first is\nthe generation of a resonant current in the dynamo region\nof the ionosphere. Its frequency and spatial scale across the\nmagnetic field should coincide with the eigenfrequency and\nwavelength of the Alfve´n vortex. The second type is based\non a non-resonant local variation of the macroscopic electric\nfield that can artificially turn on the AVI in the heated region\n(Trakhtengerts et al., 2000).\nExcitation of Alfve´n waves by modulated HF heating of\nthe ionosphere, as well as the stimulated electron precipi-\ntation, was detected from the FAST satellite at an altitude\nof 2550 km above the Tromsø HF heater (Robinson et al.,\n2000).\nIn the present paper we invest our efforts on the fur-\nther research of the ionospheric modification effects in the\nionosphere-magnetosphere system caused by powerful HF\nradio waves. The main attention has been paid to the search\nfor distinctive features related to the modification of the\nionosphere-magnetosphere coupling in the course of three\nTromsø HF pumping experiments in the nightside auroral\nionosphere. Experimental results from multi-instrument ob-\nservations in the course of the experiment on 2 October 1998\nare examined in detail. In this event, the HF pump wave was\nreflected from the F2 layer in contrast to other experiments,\nwhen the powerful wave was reflected from a sporadic Es\nlayer. The possible mechanisms responsible for the trigger-\ning of local auroral activations due to the effects of powerful\nHF radio waves are also discussed. The successful resolu-\ntion of the problem concerning the HF pump wave impact\non the ionosphere-magnetosphere coupling that could lead\nto the triggering of auroral activations requires the follow-\ning: (1) fundamental studies in several fields and sub-fields,\nincluding plasma instabilities and nonlinear phenomena, on\nthe one hand, and environmental magnetospheric physics,\non the other; (2) the use of multi-instrument observations,\nnew instruments, methods and observational methodology;\n(3) the performance of HF pumping experiments under spe-\ncific geophysical conditions; (4) consistant, repeatable ef-\nfects needed, that is more events showing the same effect.\nBelow we present our interpretation of the experimental\ndata obtained in the course of HF ionospheric modification\nexperiments in the nightside auroral ionosphere.\n2 Description of the HF pumping experiments\nThe experiments reported here were carried out by the use\nof the EISCAT HF Heating facility (Rietveld et al., 1993)\nlocated near Tromsø, Norway (geographical coordinates\n69.6◦ N, 19.2◦ E; magnetic dip angle I=78◦). We have sum-\nmarized the experimental findings from such experiments\nperformed in the nightside auroral ionosphere on 16 and 17\nFebruary 1996, and 2 October 1998. Notable is that in the\ncourse of the experiment on 16 February 1996, two auroral\nevents occurred. A distinctive feature of the experiments is\nthe tilt of the heater antenna beam to the south from zenith of\n6◦ or 12◦, thus allowing HF pumping in a near field-aligned\ndirection. The heating phased antenna array No. 2 was used\nin all experiments. The duration of the heater-on cycles was\nin all cases 4 or 8 minutes. The operational modes and the\nmain parameters of the HF Heating facility for the experi-\nments are given in Table 1.\nThe diagnostics of the ionospheric plasma based on ef-\nfects due to HF pumping comprised multi-instrument obser-\nvations from bistatic HF Doppler scatter (Blagoveshchen-\nskaya et al., 1998a), the European Incoherent Scatter (EIS-\nCAT) UHF radar (Rishbeth and van Eyken, 1993), the digital\nall-sky imager DASI (Kosch et al., 1998), and the Interna-\ntional Monitor for Auroral Geomagnetic Effects (IMAGE)\nmagnetometer network in Scandinavia (Lu¨hr et al., 1998).\nAdditionally, bistatic scatter measurements of HF diagnostic\nsignals were carried out on the London–Tromsø–St. Peters-\nburg path at operational frequencies of 12,095 and 9410 kHz.\nThe diagnostic HF transmitter is located near London (52◦ N,\n0◦ E). The reception of the diagnostic waves, scattered from\nN. F. Blagoveshchenskaya et al.: Phenomena in the ionosphere-magnetosphere system 89\nfield-aligned irregularities (FAIs) above Tromsø, was made\nwith a Doppler spectral method in St. Petersburg (60◦ N,\n30.5◦ E) at a great circle distance of∼1200 km from Tromsø.\nThe condition for a bistatic scatter is given by\n(k0 · B)=(kS · B) , (1)\nwhere k0 and kS are the wave vectors of the incident and\nscattered wave respectively, andB is the vector of the Earth’s\nmagnetic field. A general view of the experiment geometry\nis shown in Fig. 1 of Blagoveshchenskaya et al. (2001). The\nsimulation of bistatic scatter geometry for Tromsø HF pump-\ning experiments is given by Borisova et al., (2002).\nThe onsets of the activations are the following: 21:21 and\n22:41 UT on 16 February 1996; 20:33 UT on 17 February\n1996, 19:30 UT on 2 October 1998. The first three activa-\ntions were observed when the powerful HF radio waves were\nreflected from the sporadic Es layers, but the last activation\noccurred when the HF pump wave was reflected from the F2\nlayer.\nIn addition to IMAGE magnetometer data, AE, AU, and\nAL indices of the auroral activity, the PC index from the near\npole Vostok magnetic station (Troshichev et al., 1988), the\nDst index of the magnetic activity, and parameters of the\ninterplanetary magnetic field from the IMP-8 satellite have\nbeen used in the analysis of the auroral activations.\nThe results from the multi-instrument observations dur-\ning Tromsø HF pumping experiments on 16 and 17 Febru-\nary 1996, when the powerful HF radio wave was reflected\nfrom the sporadic Es layer, were analyzed in detail by\nBlagoveshchenskaya et al. (2001). Experimental findings\nfrom the experiment of 2 October 1998, under the reflection\nof the HF pump wave from the F2 layer of the ionosphere,\nare given in the next section.\n3 Observational results of 2 October 1998\nThe experiment on 2 October 1998 was conducted during\nplanetary-scale disturbed magnetic conditions. The values of\ntheDst index ranged between−56 and−61 nT. The behavior\nof the interplanetary magnetic field (IMF) as measured from\nthe IMP-8 satellite is shown in Fig. 1. The top panel in Fig. 1\ndisplays variations of the PC index from the near-pole Vostok\nstation. One can see that the Bz component of the IMF was\nsteadily southward from 16:00 to 22:00 UT.\nIonograms from the Tromsø dynasonde showed that the\ncritical frequencies of the F2 layer increased from 4.1 MHz\nat 19:00 UT to 5.5 MHz at 19:30 UT. A sporadic Es layer is\nalso identified in the ionograms, but its maximum frequency\ndid not exceed 3.5 MHz. Therefore, in the experiment the HF\npump wave (fH=4040 kHz) was certainly reflected from the\nF2 layer.\nIMAGE magnetograms for the event on 2 October 1998\nare presented in Fig. 2. It can be seen that a substorm activa-\ntion occurred at 19:30 UT between the SOR (70.54◦ N) and\nPEL (66.9◦ N) magnetic stations. A westward electrojet ap-\npeared between the MAS (69.46◦ N) and MUO (68.02◦ N)\n 38\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 1. The temporal behavior of the PC index of the magnetic activity, Bz, By, and Bx \ncomponents of the interplanetary magnetic field on 2 October 1998. \n \n \n \n \n \n \n \n \n \n \n \nig. 1. he temporal behavior of the PC index of the magnetic\nactivity, Bz, By , and Bx components of the interplanetary magnetic\nfield on 2 October 1998. 39\n \n \nFigure 2. The temporal behavior of the X, Y, and Z components of the magnetic field \nvariations on 2 October 1998. Data from the IMAGE magnetometers. \n \n \n \n \n \n \n \n \n \n \n \n \n \nig. 2. he temporal behavior of the X, Y , and Z components of the\nmagnetic field variations on 2 October 1998. Data from the IMAGE\nmagnetometers.\nstations (reversal of Z component from positive values at\nMAS to negative values at MUO station and maximum neg-\native values of the X component). This can be clearly seen\nmore accurately from the X−Z profiles obtained from the\nIMAGE magnetometers (see Fig. 3). Taking into account the\ntilt of the Tromsø heater antenna beam by 12◦ to the south\nand the size of the heated patch in the F2 layer, it is possible\nto conclude that the electrojet appeared in the southern part of\nthe heated patch. The spatial position of the heated patch de-\ntermined by the diagram of the heater antenna (3 dB contour)\n90 N. F. Blagoveshchenskaya et al.: Phenomena in the ionosphere-magnetosphere system 40\n \n \nFigure 3. X-Z latitudinal profiles obtained from IMAGE magnetometers on 2 October 1998, \nat 19.55 UT. The spatial position of the heated patch at the altitude of 300 km is depicted by a \ncircle. \nFig. 3. X−Z latitudinal profiles obtained from IMAGE magne-\ntometers on 2 October 1998, at 19:55 UT. The spatial position of\nthe heated patch at the altitude of 300 km is depicted by a circle.\nis also shown in Fig. 3. In reality, from the CUTLASS HF\nradar measurements the spatial size of the heated patch can\noccupy a region significantly larger than the area contained\nwithin 3 dB contour (Robinson et al., 1998). It is interest-\ning to note that a southward displacement preference was\nobserved in other heater-induced phenomena during other\nHF pumping experiments, such as the radio-induced airglow\n(Kosch et al., 2000), and Langmuir turbulence (Isham et al.,\n1999) which may excite energetic electrons. The behavior of\nthe AE index describing the auroral activity as a whole also\nshows that the substorm occurred at 19:30 UT.\nFigure 4 displays dynamic Doppler spectra of HF diag-\nnostic signals obtained on 2 October 1998, on the London–\nTromsø–St. Petersburg path, for a radio scatter operational\nfrequency of 12 095 kHz from 18:57 to 19:46 (Fig. 4a) and\nfrom 20:01 to 20:45 UT (Fig. 4b). One can see that during\nheater-on periods, 19:00–19:08 and 19:15–19:23 UT, the am-\nplification of natural field-aligned irregularities can be rec-\nognized in the positive part of the Doppler sonogram. The\nheater turn-off at 19:23 UT is accompanied by the appear-\nance of continuous noise-like spectral broadening. Then the\nburst-like noise enhancement in the dynamic Doppler spectra\nover a frequency range up to 20 Hz starts at about 19:27 UT\n(see Fig. 4a), i.e. 4 min after the Tromsø heater was turned\noff at 19:23 UT. It should be noted that the eigenperiod for\nthe Tromsø magnetic flux tube is about 4 min (the Alfve´n\nwave travel time to the magnetic conjugate ionosphere in the\nSouthern Hemisphere and back, along magnetic field line).\nOne might expect that an HF heater turn-off launches an\nAlfve´n wave and leads to the reverberative echo effect in\nthe HF scattered signals, which should manifest itself about\n4 min later. This effect was discovered by Yampolski (1989)\nin SURA heating experiments.\nWhat is the nature of the continuous and burst-like noise\nenhancements observed from HF Doppler measurements?\nWe have analyzed the magnetic pulsation data recorded near\n 41\n \n \nFigure 4. Dynamic Doppler spectra of HF diagnostic signals on the London–Tromsø–St. \nPetersburg path on 2 October 1998, at the frequency 12,095 kHz: (a) 18.57–19.46 UT;  \n(b) 20.01–20.45 UT. The direct signals propagating from the transmitter to the receiver along \na great circle path correspond to zero Doppler shifts. The intervals when the Tromsø HF \nheating facility was turned on are marked by bars on the time axis. Arrows on the Doppler \nsonogram correspond to the signals scattered from the heater-enhanced natural field-aligned \nirregularities. \nFig. 4. Dynamic Doppler spectra of HF diagnostic signals on the\nLondon–Tromsø–St. Petersburg path on 2 October 1998, at the fre-\nquency 12,095 kHz: (a) 18:57–19:46 UT; (b) 20:01–20:45 UT. The\ndirect signals propagating from the transmitter to the receiver along\na great circle path correspond to zero Doppler shifts. The inter-\nvals when the Tromsø HF heating facility was turned on are marked\nby bars on the time axis. Arrows on the Doppler sonogram cor-\nrespond to the signals scattered from the heater-enhanced natural\nfield-aligned irregularities.\nTromsø at Kilpisjarvi (geographical coordinates 69.02◦ N,\n20.79◦ E). By way of illustration Fig. 5 shows the temporal\nbehavior of H , D, and Z components of the magnetic field\nvariations with 0.1-s temporal resolution and their sonogram\n(dynamic frequency spectra) in the frequency band of 5 Hz\non 2 October 1998, from 19:00 to 19:40 UT. One can see the\nappearance of continuous pulsations in the frequency range\nup to 0.8 Hz from 19:23 UT (HF heater turn-off), which can\nbe associated with the Pi1 short-period irregular magnetic\npulsations of the PiC type. Thereafter, against this back-\nground the well-defined burst-like signals at frequencies up\nto 2.4 Hz are recognized from the sonogram. In accordance\nwith classification of magnetic pulsations, these signals are\nidentified as PiB magnetic pulsations. It should be pointed\nout that PiC and PiB magnetic pulsations are observed in\nall components (H , D, Z) of the magnetic field. The com-\nparison between HF Doppler scatter and magnetic pulsation\ndata shows clearly the following. Features in the dynamic\nDoppler spectra of HF diagnostic signals, such as continu-\nous and burst-like noise enhancements, may be attributed to\nPiC and PiB magnetic pulsations, correspondingly. In this\nrespect it is significant that PiB pulsations correspond to the\ntrapping of Alfve´n wave energy in the ionospheric Alfve´n\nN. F. Blagoveshchenskaya et al.: Phenomena in the ionosphere-magnetosphere system 91\n 42\n \n \n \nFigure 5. H, D, and Z components of magnetic pulsations recorded at Kilpisjarvi on 2 \nOctober 1998, and their sonograms (dynamic frequency spectra) in the frequency range from \n0.2 to 5 Hz. \n \nFig. 5. H , D, and Z components of magnetic pulsations recorded at Kilpisjarvi on 2 October 1998, and their sonograms (dynamic frequency\nspectra) in the frequency range from 0.2 to 5 Hz.\nresonator, IAR (Lysak and Song, 1998) or, in other words, to\nthe generation of Alfve´n vortices (short-scale oblique Alfve´n\nwaves) captured in the IAR (Trakhtengerts and Feldstein,\n1991; Trakhtengerts et al., 2000). Recall that the IAR eigen-\nfrequencies lie within the range 0.1–10 Hz; they manifest\nthemselves in the spectra of magnetic pulsations, as well as\nin the electromagnetic noise (Belyaev et al., 1999; Trakht-\nengerts et al., 2000). Therefore, there are reasons to assume\nthat the observed electromagnetic noise, and PiC and PiB\nmagnetic pulsations can be the manifestation of an excita-\ntion of the Alfve´n vortices trapped in the ionospheric Alfve´n\nresonator.\nThe other distinctive feature in the dynamic Doppler spec-\ntra of the scattered HF signals is the generation of an intense\nwave process with periods of 7–8 min. It started at 19:30 UT\nafter the heater was turned on. The observed ionospheric\nwave disturbance is likely be to the signature of short-period\natmospheric gravity waves, AGWs (Hunsucker, 1982). It is\nconceivable that an AGW can be launched by strong heater-\nenhanced electric fields via Joule heating and an indication\nof this has been observed in Arecibo (Thide´ et al., 1989).\nThereafter, the ionospheric wave process which takes place\nis not dependent on whether the Tromsø heater is turned on\nor off. At substorm maximum (about 20:00 UT) a large-scale\nionospheric wave disturbance was generated above Tromsø.\nIt was observed throughout the recovery phase of the sub-\nstorm. Its period was more than 45 min (see Fig. 4b). Similar\nwave disturbances are usually considered typical signatures\nof intense magnetospheric substorms and storms.\nInteresting features in the ionospheric plasma parameters\nwere observed by the EISCAT UHF incoherent scatter radar\nat Tromsø, pointing in the magnetic field-aligned direction\n(77◦). Figure 6 presents temporal variations of the electron\ndensity Ne, ion and electron temperatures (Ti and Te), the\nratio of Te\/Ti , and ion velocities Vi obtained on 2 October\n1998, from 18:57 to 20:10 UT at altitudes of 300, 430, and\n92 N. F. Blagoveshchenskaya et al.: Phenomena in the ionosphere-magnetosphere system\n 43\n \nFigure 6. The temporal behavior of the electron density Ne, ion temperature Ti, electron temperature Te, the ratio of the Te\/Ti, and ion velocities Vi \nas observed with the Tromsø EISCAT UHF incoherent scatter radar in the field-aligned direction on 2 October 1998, from 18.56 to 20.10 UT at \naltitudes of 300, 430, and 500 km. EISCAT UHF radar data are obtained by using the long-pulse and analyzed with 20 s integration time. The \nintervals when the Tromsø HF heating facility was operated are marked by bars on the time axis. The Tromsø HF facility Heating was operated \nwith a 8 min on, 7 min off pump cycle (4 min 50% full power, 4 min 100% power then 7 min off).  \n \n 43\n \nFigure 6. The temporal behavior of the electron density Ne, ion temperature Ti, electron temperature Te, the ratio of the Te\/Ti, and ion velocities Vi \nas observed with the Tromsø EISCAT UHF incoherent scatter radar in the field-aligned direction on 2 October 1998, from 18.56 to 20.10 UT at \naltitudes of 300, 430, and 500 km. EISCAT UHF radar data are obtained by using the long-pulse and analyzed with 20 s integration time. The \nintervals when the Tromsø HF heating facility was operated are marked by bars on the time axis. The Tromsø HF facility Heating was operated \nwith a 8 min on, 7 min off pump cycle (4 min 50% full power, 4 min 100% power then 7 min off).  \n \ni i \nFig. 6. The temporal behavior of the electron density Ne, ion temperature Ti , electron temperature Te, the ratio of the Te\/Ti , and ion\nvelocities Vi as observed with the Tromsø EISCAT UHF incoherent scatter radar in the field-aligned direction on 2 October 1998, from\n18:56 to 20:10 UT at altitudes of 300, 430, and 500 km. EISCAT UHF radar data are obtained by using the long-pulse and analyzed with\n20-s integration time. The intervals when the Tromsø HF heating facility was operated are marked by bars on the time axis. The Tromsø HF\nheating facility was operated with a 8-min on, 7-min off pump cycle (4-min 50% full power, 4-min 100% power then 7-min off).\nN. F. Blagoveshchenskaya et al.: Phenomena in the ionosphere-magnetosphere system 93\n 35\n \n \nTable 2. The mean values, the standard deviations, the standard errors of the means, the \nminimum and maximum values of the Te and Ti at altitudes of 315 and 517 km calculated \nduring the heater-on and heater-off periods on 2 October 1998 \n \nParameter Time,  \nUT \nMean, \nK \nStandard \ndeviation, \nK \nStandard \nerror of the \nmean, K \nMinimum \nvalue,  \nK \nMaximum \nvalue,  \nK \n19.00-19.08 (on) 2144 309 45 1514 2738 \n19.15-19.23 (on) 2052 215 31 1596 2569 \n19.30-19.38 (on) 2511 538 78 1345 3702 \n19.08-19.15 (off) 1711 254 39 1305 2320 \nTe at  \n315 km \n19.23-19.30 (off) 1644 196 31 1344 2055 \n19.00-19.08 (on) 2380 463 68 1682 3615 \n19.15-19.23 (on) 2252 484 72 1367 4763 \n19.30-19.38 (on) 3270 1148 169 1515 6119 \n19.08-19.15 (off) 2048 366 57 1427 2699 \nTe at  \n517 km \n19.23-19.30 (off) 2060 309 49 1553 2795 \n19.00-19.08 (on) 1366 162 23 1087 1715 \n19.15-19.23 (on) 1777 224 32 1314 2394 \n19.30-19.38 (on) 1434 293 42 1098 2884 \n19.08-19.15 (off) 1212 130 20 1019 1748 \nTi at  \n315 km \n19.23-19.30 (off) 1228 92 14 1021 1514 \n19.00-19.08 (on) 1552 381 56 737 2655 \n19.15-19.23 (on) 1855 360 53 1010 2734 \n19.30-19.38 (on) 1789 583 86 663 3691 \n19.08-19.15 (off) 1395 251 39 829 1830 \nTi at  \n517 km \n19.23-19.30 (off) 1396 186 29 1080 1833 \n \n \n \n \nTable 2. The mean values, the standard deviations, the standard errors of the means, the minimum and maximum values of the Te and Ti at\naltitudes of 315 and 517 km calculated during the heater-on and heater-off periods on 2 October 1998.\n500 km. Note that the EISCAT UHF radar was probing in\nthe geomagnetic field-aligned direction. From Fig. 6 one can\nsee very strong Te enhancements, closely related to the con-\nsecutive heater-on periods from 19:00–19:08, 19:15–19:23,\n19:30–19:38, and 19:45–19:53 UT. Enhancements in Te were\nobserved over a wide altitude range from 200 to 600 km (the\nupper altitude limit of the EISCAT UHF radar measurements\nin the experiment). It is common knowledge that HF pump-\ninduced electron heating, as well as the excitation of artifi-\ncial field-aligned irregularities (AFAI) and the anomalous ab-\nsorption, is a phenomenon related to the upper hybrid wave.\nIt is generated at the vicinity of the upper hybrid resonance\n(UHR) altitude, where the heater frequency fH is equal to\nthe local upper hybrid frequency, f 2H=f 20 +f 2ce (f0 is the lo-\ncal plasma frequency and fce is the electron gyrofrequency).\nThe UHR height is several kilometers below from the reflec-\ntion level of the HF pump wave. In the course of the exper-\niment on 2 October 1998 very strong electron temperature\nenhancements were observed in a wide altitude range well\nabove the reflection level of the HF waves. Enhancements in\nTe were accompanied by strong Ti increases along with pos-\nitive (upward) ion velocities from altitudes above 350 km.\nThe variations in Te and Ti during the heater on and off\ncycles are stronger under disturbed magnetic conditions than\nunder quiet conditions. There is a good reason to compare\nthe mean values of Te and Ti during heater-on and heater-\noff periods. For this purpose 10-s resolution data from the\nEISCAT UHF radar measurements at altitudes of 315 km\n(near the reflection level of the HF pump wave) and 517 km,\nthat is well above the reflection altitude of the powerful\nHF radio wave, were employed. Calculation results of the\nmeans, the standard deviations, and the standard errors of the\nmeans are summarized in Table 2, where one can see that the\nmeans and standard deviations of the Te and Ti in all heater-\non cycles exceed the same parameters calculated in heater-off\nperiods at both altitudes of 315 and 517 km.\nThe positive Vi , indicative of the generation of upward\nion flows, reached their maximum values (about 400 m\/s\nat the height of 500 km) in the heater-on period from\n19:30–19:38 UT, corresponding in time to the substorm on-\nset. Note that the HF pump waves modify significantly the\nionospheric plasma, even after the substorm onset. During\nthe heater-on period, from 19:45 to 19:53 UT there are the\nTe enhancements, as well as a generation of heater-induced\nupward ion flow.\nLarge electron temperature enhancements (a doubling)\nproduced by strong HF pump waves during winter night\nhours were observed at Arecibo (Djuth et al., 1987). These\nTe enhancements were measured in a narrow altitude range\nnear the upper hybrid resonance (UHR) height. Recent ex-\nperimental results from Tromsø HF pumping experiments\nin the nightside ionospheric F -region during quiet magnetic\nconditions (Rietveld et al., 2003) clearly demonstrate not\nonly extremely strong Te enhancements in a wide altitude\nrange, but also increases in the ion temperatures of about\none hundred degrees and the generation of upward ion flows\n94 N. F. Blagoveshchenskaya et al.: Phenomena in the ionosphere-magnetosphere system\n 36\n \n \n \n \nTable 3. Background geophysical conditions in course of the HF pumping experiments \n \nAuroral activation onsets, date and time, UT \n16.02.96 17.02.96 2.10.98 \nGeophysical \nconditions \n21.21 22.41 20.33 19.30 \nBz component of \nIMF, nT \n−1.5 −1.5 1.0 −4.0 \nDst index, nT 3 1 −4 −59 \nКр index 3о 3о 2о 5+ \nΣКр 17+ 17+ 15+ 33+ \nOrientation of the \nbackground electric \nfield \nnorth-\nsouth \nnorth-\nsouth \nnorth-south \nnorth- \nsouth \n \n \n \n \n \nTable 3. Background geophysical conditions in the course of the\nHF pumping experiments.\nalong magnetic field-aligned direction as well. Moreover, the\nstrongest pumping effects occurred when the powerful HF\nradio wave is beamed along magnetic field line.\nEven though the HF pumping effects observed in the ex-\nperiment on 2 October 1998 resemble the effects observed\nby Rietveld et al. (2003), there is a clear distinction between\nthem. On 2 October 1998 strong Te increases with altitude\nare measured, especially at the beginning of a heater-on pe-\nriod corresponding to the substorm onset, when Te=2800 K\nat the altitude of h=300 ; they reach the values of Te=5000 K\nat h=500 km.\nThe Ti enhancements most pronounced in the heater-on\nperiods from 19:15–19:23 and 19:30–19:38 UT may be at-\ntributed to the increase in the ionospheric electric field. In\nthis respect it should be mentioned that a very strong Ti in-\ncrease, accompanied by drastic enhancements in the iono-\nspheric electric field, was observed during the triggering of\nthe local auroral activations when HF pumping was made\ninto the nightside auroral E region (Blagoveshchenskaya et\nal., 2001). A substantial doubling of the southward-pointing\nconvection electric field caused by HF heating was also mea-\nsured from a sounding rocket inside of the Arecibo HF heater\nbeam (Peria and Kelley, 2001).\nThe origin of heater-induced upward ion flows in HF iono-\nspheric modification experiments is not clear. Ion upflow\nevents from EISCAT UHF radar measurements, observed\nnaturally in the F region, can be devided into two types as de-\nscribed by Wahlund et al. (1992). Type I events are related to\nthe strong perpendicular electric field E0, enhanced Ti due to\nfrictional heating and low electron densities (thermal plasma\noutflow). Type II upflows are associated with active auroral\nconditions and increased electron temperatures Te. They may\nbe related to enhanced parallel electric field E|| along mag-\nnetic field-aligned direction caused by anomalous resistivity\ndue to ion acoustic turbulence. Forme and Fontaine (1999)\nhave found that ion acoustic turbulence can greatly increase\nthe electron temperature, leading to the upward ion acceler-\nation by enhanced field-parallel electric field. In the course\nof the experiment on 2 October 1998, carried out during dis-\nturbed background conditions, the occurrence of upward ion\nflows was observed in conjunction with greatly increased\nboth Te and Ti . Moreover, the appearance of ion upflows\nwas accompanied by heater-enhanced ion lines after turn-on\nof the Tromsø HF heater, which is indicative of ion acous-\ntic turbulence. Heater-enhanced ion lines were measured at\n19:00:05, 19:15:05, and 19:30:05 at altitudes of 303, 267,\nand 248 km, correspondingly. Heater-enhanced ion lines are\nobserved at altitudes in the close vicinity of the reflection\nheight of the powerful HF radio wave. One may speculate\nthat the generation of the heater-driven upward ion flows may\nbe related to the parallel electric field. Nonetheless, we do\nnot exclude the other ion acceleration mechanisms which can\noperate in the HF modified auroral ionosphere.\nSummarizing the experimental findings from the multi-\ninstrument observations in the course of the Tromsø HF\npumping experiment on 2 October 1998, one can distin-\nguish the following features related to the auroral activation:\n(1) amplification of natural field-aligned irregularities during\nheater-on periods; (2) possible appearance of the reverbera-\ntive echo effect in the HF scattered signals that manifests it-\nself about 4 min (eigenfrequency of the TromsøL-shell) after\nthe HF heater was turned off; (3) burst-like electromagnetic\nnoise enhancements in the dynamic Doppler spectra of HF\nscattered signals accompanied by PiB magnetic pulsations\nthat can be associated with the trapping of Alfve´n wave en-\nergy in the ionospheric Alfve´n resonator; (4) strong Te and Ti\nenhancements in a wide altitude range driven by HF pump-\ning; (5) generation of the heater-induced intense upward ion\nflows along the magnetic field lines; (6) strong Te increases\nwith altitude during heater-on period corresponding to the\nsubstorm onset; (7) substorm onset in the southern part of\nthe heated patch under a steady southward Bz component of\nthe IMF.\n4 Distinctive features related to the auroral activations\nIn this section we summarize and compare the distinctive fea-\ntures related to auroral activations from Tromsø HF pumping\nexperiments in the nightside auroral ionosphere under the re-\nflection of HF pump wave from F2 layer (Sect. 3), as well\nas from the sporadic Es layer (Blagoveshchenskaya et al.,\n2001).\nFirst of all, there is a need to examine the background\ngeophysical conditions during the HF pumping experiments.\nFrom Table 3 one can see that the experiments on 16 and\n17 February 1996 were conducted under slightly disturbed\nmagnetic conditions. The values of the Kp index were about\nKp=2–3 and 15≤6Kp≤18. During the experiment on 2 Oc-\ntober 1998, the magnetic conditions were disturbed, and val-\nues of the Kp index were Kp=5 and 6Kp=33.\nThe distinctive features related to four auroral activa-\ntions from multi-instrument observations are summarized\nin Table 4. Let us consider these characteristics in more\ndetail. The generation of wide band spectral features\nin the Doppler radio scattering data was observed in all\nN. F. Blagoveshchenskaya et al.: Phenomena in the ionosphere-magnetosphere system 95\n 37\n \n \nTable 4. Distinctive features related to auroral activations in course of the experiments \n \nAuroral activations onsets, date and time, UT \n16.02.96 17.02.96 2.10.98 \nDistinctive features from different \nobservational methods \n21.21 22.41 20.33 19.30 \nGeneration of spectral broadening \ncomponents \n+ + + + \nIncreases of Ti and local E0 + + + + \nModification of the auroral arc + + + no meas. \nStrong Te enhancements with \naltitude \n− − − \n+ \nGeneration of upward ion flows \n− − − \n+ \nAuroral activations above the \nartificially disturbed ionospheric \nregion (ADIR) \n+ + + + \nMagnetic disturbances to the \nnorthward direction after \nactivation above ADIR \n+ + + + \n \n \n Table 4. Distinctive features related to auroral activations in course\nof the experiments.\nexperiments. As it was shown in Sect. 3, there is the as-\nsociation of electromagnetic noise enhancements from HF\nDoppler observations with Pi1 magnetic pulsations. It can be\nindicative of ionospheric Alfve´n resonator effects (Trakht-\nengerts et al., 2000). What are the possible mechanisms\nneeded for the excitation of ionospheric Alfve´n resonator\neffects due to unmodulated HF heating of the Earth’s iono-\nsphere? Clearly, to answer this, new theoretical approaches\nand special-oriented experiments are needed.\nThe strong increases of the ion temperatures, as well as\nthe local ionospheric electric fields, observed in all events\nanalyzed can be explained in terms of the theory for non-\nresonant local variations of the macroscopic electric field\ndeveloped by Trakhtengerts et al. (2000). Peria and Kel-\nley (2001) have proposed the ponderomotive force and tem-\nperature gradients, both of which are ubiquitous during HF\nheating, as the candidate mechanisms for the heater-induced\nionospheric electric field.\nModification of the auroral arc and local spiral-like for-\nmation is seen in all experiments under reflection of the HF\npump wave from the sporadic Es layer, see Plates 1 and 2 of\nBlagoveshchenskaya et al. (2001). Unfortunately, the opti-\ncal observations were not carried out when the powerful HF\nradio wave was reflected from F2 layer (experiment on 2\nOctober 1998).\nNevertheless, there are some effects observed only on 2\nOctober 1998, when the F2 layer was overdense, during dis-\nturbed magnetic conditions (see Tables 3 and 4). Only the\nlatter experiment show evidence for a generation of intense\nheater-induced upward ion flows (ion velocities up to 400 m\/s\nat the altitude of 500 km), strong enhancement of the electron\ntemperature Te along the magnetic field-aligned direction in\na wide altitude range from 200 to 600 km (upper limit of the\nEISCAT UHF radar measurements during the experiment),\nand strong Te increases with altitude during the heater-on\n 44\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 7.  A possible scheme for the triggering of local auroral activations due to HF \npumping into night-side auroral ionosphere. IAR is the ionospheric Alfvén resonator; \nTABL is the turbulent Alfvén boundary layer. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig. 7. A possible scheme for the triggering of local auroral acti-\nvations due to HF pumping into nightside auroral ionosphere. IAR\nis the ionospheric Alfve´n resonator; TABL is the turbulent Alfve´n\nboundary layer.\nperiod, corresponding to the substorm onset. Furthermore,\nin the latter experiment, auroral activation occurred in a lo-\ncalized latitudinal region that extends to larger scales with a\nlatitudinal width of 3◦ (see Sect. 3) as compared to the acti-\nvations on 16 and 17 February 1996 (latitudinal width of 1◦)\nobserved by Blagoveshchenskaya et al. (2001).\nStrong electron temperature enhancements and a south-\nward shift of the strongly heated region can apparently be\nexplained by the theory of self-focusing on striations of the\nHF pump wave developed by Gurevich et al. (2001). This\ntheory describes a formation of a large-scale nonlinear struc-\nture along the magnetic field line, consisting of a number of\nbunches of striations (solitons). It is interesting to mention\nthat in experiments at Arecibo, direct measurements of stri-\nations were performed by Kelly et al. (1995). The nonlinear\nstructuring is also manifested in observations (Kelly et al.,\n1995; Franz et al., 1999). It should be pointed out that the\ngeneration of striations and the large-scale nonlinear struc-\nturing at Arecibo is much more difficult than at high latitudes\n(Gurevich et al., 1999).\nIt was shown by Bernhardt et al. (1988) that HF pump-\ninduced ohmic and anomalous heating increases the elec-\ntron temperature and the plasma pressure in the heated patch,\nwhich, in turn, accelerates the plasma along the magnetic\nfield lines. Upward ion flows were predicted by Vas’kov et\nal. (1993) for the Arecibo case based on a model with a soli-\ntary ion-acoustic compression wave propagating along the\nfield-aligned direction. Mingaleva and Mingalev (1997) per-\nformed modelling for conditions of the high-latitudinal iono-\nsphere.\nIn spite of numerous radar and satellite observations of\nion upflows at auroral latitudes, see, for example, Fos-\nter et al. (1998), the initial mechanisms that preheats the\nionospheric ions, which then propagate upward along mag-\nnetic field lines due to the parallel electric field and mirror\nforce, are widely debated. Postulated mechanisms include\n96 N. F. Blagoveshchenskaya et al.: Phenomena in the ionosphere-magnetosphere system\n 45\n \n \n \n \n \n \nFigure 8. The temporal behavior of the electron density Ne at the altitude of 300 km from \nthe EISCAT UHF radar, relative values of partial pressure P\/P0 at the altitudes of 300 and \n500 km in course of the Tromsø HF pumping experiments on 2 October 1998, from 18.55 \nto 20.00 UT. The intervals when the Tromsø heater was turned on are marked by bars on \nthe time axis.  \n \n \n \n \n \nFig. 8. The temporal behavior of the electron density Ne at the alti-\ntude of 300 km from the EISCAT UHF radar measurements, relative\nvalues of partial pressure P \/P0 at the altitudes of 300 and 500 km\nin the course of the Tromsø HF pumping experiments on 2 Octo-\nber 1998, from 18:55 to 20:00 UT. The intervals when the Tromsø\nheater was turned on are marked by bars on the time axis.\nion frictional heating due to the perpendicular electric field\n(Baron and Wand, 1983), lower hybrid waves, ion cyclotron\nwaves, and solitons (Forme and Fontaine, 1999; Ogawa et al.,\n2000; Kovtyukh, 2001; Ma¨lkki and Lundin, 1994), stochastic\nion heating on short perpendicular wavelength electrostatic\nwaves and structures (Stasiewicz et al., 2000). Note that mul-\ntiple acceleration processes may be operative along magnetic\nfield lines at different altitudes (Sagawa et al., 1991).\n5 Possible mechanisms for the triggering of auroral ac-\ntivations\nA possible scenario for the substorm triggering due to HF\npumping into the nightside auroral ionosphere along mag-\nnetic field-aligned direction is illustrated by the scheme in\nFig. 7.\nThe accumulation of the energy in the magnetospheric tail\ndue to the solar wind-magnetosphere interaction is accompa-\nnied by an increase in the laminar magnetospheric convec-\ntion. Thermal nonlinear interaction between powerful HF ra-\ndio waves and the auroral ionospheric plasma leads to a local\nincrease in the ionospheric electric field E0 (Blagoveshchen-\nskaya et al., 2001), the excitation of the ionospheric Alfve´n\nresonator (IAR) and low-frequency turbulence. The en-\nhanced currents lead to Alfve´n wave trapping in the iono-\nspheric Alfve´n resonator, which is bounded from below by\nthe heater-modified E region and from above by the region\nof a sharp increase in the Alfve´n velocities at altitudes up to\none Earth radius (Trakhtengerts and Feldstein, 1991). Mod-\nels predicting changes in the ionospheric conductivity and\nfeedback instability in the magnetosphere-ionosphere system\nwere developed by Lysak (1990, 1991), Trakhtengerts and\nFeldstein (1991), and Stasiewicz et al. (2000).\nHeater-induced low-frequency turbulence leads to a field-\naligned potential drop in the magnetic flux tube, anomalous\nresistivity, and the development of a parallel electric field\nE||. It was found by Haerendel (1990) that the parallel elec-\ntric field may be responsible for the decoupling of the mag-\nnetospheric convection from the ionosphere. The enhanced\nionospheric electric field, the parallel electric field, the turbu-\nlent plasma heating, and the acceleration of runaway charged\nparticles are possible mechanisms for the Alfve´n wave dissi-\npation in the ionospheric Alfve´n resonator which, in turn,\nleads to the excitation of the turbulent Alfve´n boundary layer\n(TABL) or, in other words, Alfve´n vortex instability (AVI) in\nthe IAR (Trakhtengerts and Feldstein, 1991; Trakhtengerts et\nal., 2000). It may serve as a trigger of the auroral activation.\nIt is of interest to estimate possible changes in the iono-\nspheric electric field E0 and the parallel electric field E||\nduring HF pumping experiments at high latitudes. It has\nbeen predicted by Trakhtengerts et al. (2000) that a strong\nlocal increase of E0 can occur near the “nose” of the heater-\nmodified ionospheric region, if the disturbed region is elon-\ngated along the background electric field E0 and the distur-\nbance is large. In this case the amplitude of the electric field\nEm near the nose of the heater-modified ionospheric region\nis of the order of Em≈3.5E0 (Trakhtengerts et al., 2000),\nwhich is close to that which we observed from the EIS-\nCAT UHF radar measurements in HF heating experiments\n(Blagoveshchenskaya et al., 2001).\nAssuming charge neutrality, Jz can be estimated by\n(Kamide and Baumjohann, 1993)\nJz=1neV||, (2)\nwhere 1n is the change in the electron density, V|| is the\nfield-aligned current velocity, e is the electron charge.\nFigure 8 displays the temporal behavior of the electron\ndensity Ne at an altitude of 300 km, as measured by the\nEISCAT UHF radar during the HF pumping experiment on\n2 October 1998, as well as the calculated values of the\nrelative plasma partial pressure P\/P0 at altitudes of 300\nand 500 km. The condition of the hydrodynamical equilib-\nrium is fulfilled when the partial pressure is kept constant,\nP=Ne(Te + Ti)=const.\nTherefore, the values of P \/P0 can be written as (Gurevich,\n1978)\nP\/P0= Ne(Te + Ti)\nNe0(Te0 + Ti0) , (3)\nwhere Te0, Ti0, and Ne0 are the electron and ion tempera-\ntures, and the electron density before the HF heater is turned\non; Te, Ti , and Ne are the same parameters in the course of\nthe heater-on periods. From Fig. 8 one can see that the hydro-\ndynamical equilibrium has been disrupted due to the effects\nof powerful HF radio waves. The strongest increase in the\nN. F. Blagoveshchenskaya et al.: Phenomena in the ionosphere-magnetosphere system 97\npartial pressure takes place in the heating cycles at 19:15–\n19:23 and 19:30–19:38 UT. Furthermore, heater-induced ef-\nfects in the behavior of P \/P0 were observed at the altitudes\nof 300 and 500 km as well.\nWe speculate that there are two electron populations dur-\ning heater-on periods. One of them is the downward field-\naligned current carrying heater-induced runaway electrons\nfrom the ionosphere. The other one is the electron precip-\nitation from the magnetosphere carrying the background up-\nward field-aligned current, responsible for the formation of\nthe substorm current system (Bostro¨m, 1964; Kan, 1993;\nHaerendel, 1990; Kamide and Baumjohann, 1993; Rostoker,\n1999). The presence of two electron populations in HF\npumping experiments is confirmed by direct observations\nfrom the FAST satellite (Robinson et al., 2000). One might\nexpect that the heater-induced runaway electron population\nmay promote the development of current-driven instabilities\nwhich, in turn, leads to the decoupling of magnetospheric\nconvection from the ionosphere. This corresponds to the on-\nset of auroral activation.\nThe field-aligned current velocity V|| can be obtained from\nthe condition of a current convective instability growth (Os-\nsakow and Chaturvedi, 1979)\nV‖\nLN\n≥ (Te + Ti)k\n2‖\nmνe\n√\nM\nm\nνin\nνen\n, (4)\nwhere m and M , Te and Ti are the electron and ion masses\nand the temperatures, respectively; νen and νin are colli-\nsion frequencies of electrons\/ions with neutrals; νe=νen+νei ,\nwhere νei is the Coulomb collision frequency; LN is a typi-\ncal scale of the perpendicular plasma density gradient; k|| is\nthe field-aligned wave number of irregularities. For V|| cal-\nculations, the Te and Ti values were taken from the EISCAT\nUHF radar measurements. We assume that LN=1. The col-\nlision frequencies νen, νei , and νe were calculated by taking\ninto account the values of Te, Ne, Nn, and Ni . Calculations\nof the neutral component Nn on 2 October 1998 versus alti-\ntude and time were made by using MSIS-E-90 Model (http:\n\/\/nssdc.gsfc.nasa.gov\/space\/model\/models\/msis.html). The\nfield-aligned wave number of irregularities k|| is found, tak-\ning into account the ratio of field-aligned to cross-field scales\nl||\/l⊥∼2·103 (Kagan and Frolov, 1996). In the course of our\nexperiments, the bistatic HF Doppler radio scatter used the\n12 095 and 9410 kHz carrier signals from London transmit-\nters and therefore was sensitive to irregularities with spatial\nscales l⊥≈12−15 m.\nFrom expression (4) and with the use of the experimental\nvalues of Te=2500–3000 K and Ti=1700–2500 K at the alti-\ntude of 300 km and Te=3200–5000 K and Ti=2000–3500 K at\nthe altitude of 500 km, the field-aligned current velocity V||\nis estimated to be in the range 2< V||<4 km·s−1 at h=300 km\nand in the range 5<V||<15 km·s−1 at h=500 km.\nRough estimates of the parallel electric field E|| can be\nmade from the expression (Ginzburg, 1967)\nE|| ∼ m\ne\nV||\n√\nω2 + ν2e\n√\n2m\nM\n, (5)\nwhere V|| is the field-aligned current velocity from Eq. (4), ω\nis the plasma frequency, and m, M , e, and νe are the same as\nin Eq. (4).\nSetting V||=2−4 km·s−1 at h=300 km and V||=5−15 km·s−1\nat h=500 km for a pump frequency of 4040 kHz, we find\nthat E||=(10−15) mV·m−1 at the altitude 300 km and\nE||=(20−40)mV·m−1 at the altitude 500 km.\nSummarizing the results of the calculations, one can dis-\ntinguish the following: (1) the hydrodynamical equilibrium\nhas been disrupted due to the effects of HF pumping into\nthe nightside auroral ionosphere; (2) the partial pressure of\nionospheric plasma is about four times higher during the sub-\nstorm onset than the background level just before the HF\nheater was turned on; (3) the parallel electric field can reach\nthe values of the order of E||=30 mV·m−1 during the sub-\nstorm onset at 19:30 UT.\n6 Summary\nWe suggest that the results obtained provide evidence that HF\npumping into nightside auroral ionosphere along the mag-\nnetic field-aligned direction produces a modification of the\nmagnetosphere-ionosphere coupling. It is expected that a lo-\ncal heater-driven current system is formed which, in turn, un-\nder certain geophysical conditions may cause triggering of\nauroral activations.\nDistinctive features related to auroral activations in the\ncourse of the Tromsø HF pumping experiments are iden-\ntified. Typical peculiarities observed in all events are the\nfollowing: (1) the generation of burst-like electromagnetic\nnoise observed in bistatic HF Doppler scatter measurements;\n(2) a strong increase in the ion temperature Ti and the local\nionospheric electric field E0; (3) modification of the auro-\nral arc and local spiral-like formation. However, some fea-\ntures were observed only when the HF pump wave was re-\nflected from the F2 layer under disturbed magnetic condi-\ntions. Only the latter experiment shows evidence of strong\nTe increases with altitude, especially during the triggering\nof auroral activation. The generation of the intense upward\nion flows, strong enhancement of the electron temperature\nTe in a wide altitude range (from 200 km to the upper altitude\nlimit of the EISCAT UHF incoherent scatter radar which was\n600 km during experiment) are also observed in this experi-\nment.\nA possible scenario for the substorm triggering due to the\nexcitation of the turbulent Alfve´n boundary layer (TABL), or\nin other words, Alfve´n vortex instability (AVI), by an un-\nmodulated HF pump wave in the ionospheric Alfve´n res-\nonator (IAR) is considered. In this respect the potential-\nity of the IAR excitation by an unmodulated HF pump\nwave is discussed. The comparison between electromagnetic\nnoise enhancement from HF Doppler scatter measurements\nand PiC and PiB types of Pi1 magnetic pulsations points\nto an association between them. Taking into account that\nAlfve´n wave energy can be trapped in the IAR causing PiB\nmagnetic pulsations, the appearance of the burst-like noise\n98 N. F. Blagoveshchenskaya et al.: Phenomena in the ionosphere-magnetosphere system\nenhancement on the Doppler sonogram and PiB magnetic\npulsations can be indicative of ionospheric Alfve´n resonator\neffects. Clearly, further experiments and new theoretical ap-\nproaches are needed.\nThe enhanced ionospheric electric field, parallel electric\nfield, and turbulent plasma heating are possible mechanisms\nfor Alfve´n wave dissipation in the IAR that leads to the\nexcitation of the TABL. One would expect that the heater-\ninduced runaway electrons may promote the development of\ncurrent driven instabilities and the formation of an additional\nacceleration region at low altitudes (350–1000 km). The hy-\ndrodynamical equilibrium has been disrupted due to effects\nof HF pumping. The partial pressure is about four times\ngreater during the substorm onset than the background level.\nAcknowledgements. We would like to thank the Director and\nStaff of the EISCAT Scientific Association. EISCAT is an In-\nternational Association supported by Finland, France, The Fed-\neral Republic of Germany, Japan, Sweden, Norway, and the\nUnited Kingdom. We thank P. Gamet and S. Buchert for mak-\ning available plotting routines of EISCAT UHF incoherent scat-\nter data. The work is supported by INTAS, grant 03-51-5583\nand by RFBR, grant 04-05-64160, NATO Research programme,\ngrant EST.CLG.978226, and the Royal Swedish Academy of Sci-\nences. The financial support from the Swedish Research Council\nand Uppsala University is gratefully acknowledged. The authors\nthank A. Gurevich, V. Sergeev, V. Trakhtengerts, K. Stasiewicz, and\nB. Isham for useful discussions and helpful comments.\nTopical Editor M. Lester thanks a referee for his help in evalu-\nating this paper.\nReferences\nAkasofu, S.-I.: The development of the auroral substorm, Planet.\nSpace Sci., 12, 273–282, 1964.\nBaron, M. J. and Wand, R. H.: F region ion temperature enhance-\nments resulting from Joule heating, J. Geophys. Res., 88, 4114–\n4118, 1983.\nBelyaev, P. P., Bo¨singer, T., Isaev, S. V., Trakhtengerts, V. Y., and\nKangas, J.: First evidence at high latitudes for the ionospheric\nAlfve´n resonator, J. Geophys. Res., 104, 4305–4318, 1999.\nBernhardt, P. A., Duncan, L. M., and Tepley, C. A.: Artificial air-\nglow excited by high-power radio waves, Science, 242, 1022–\n1027, 1988.\nBlagoveshchenskaya, N. F., Kornienko, V. A., Borisova, T. D.,\nThide´, B., Kosch, M. J., Rietveld, M. T., Mishin, E. V.,\nLuk’yanova, R. Yu., and Troshichev, O. A.: Ionospheric HF\npump wave triggering of local auroral activation, J. Geophys.\nRes., 106, 29 071–29 089, 2001.\nBlagoveshchenskaya, N. F., Kornienko, V. A., Petlenko, A. V.,\nBrekke, A., and Rietveld, M. T.: Geophysical phenomena during\nan ionospheric modification experiment at Tromsø, Ann. Geo-\nphys., 16, 1212–1225, 1998a,\nSRef-ID: 1432-0576\/ag\/1998-16-1212.\nBlagoveshchenskaya, N. F., Kornienko, V. A., Rietveld, M. T.,\nThide´, B., Brekke, A., Moskvin, I. V., and Nozdrachev, S.: Stim-\nulated emissions around the second harmonic of Tromsø heater\nfrequency observed by long-distance diagnostic HF tools, Geo-\nphys. Res. Lett., 25, 873–876, 1998b.\nBorisova, T. D., Blagoveshchenskaya, N. F., Moskvin, I. V., Ri-\netveld, M. T., Kosch, M. J., and Thide´, B.: Doppler shift simula-\ntion of scattered HF signals during the Tromsø HF pumping ex-\nperiment on 16 February, 1996, Ann. Geophys., 20, 1479–1486,\n2002,\nSRef-ID: 1432-0576\/ag\/2002-20-1479.\nBostro¨m, R. A.: Model of the auroral electrojets, J. Geophys. Res.\n69, 4983–4999, 1964.\nBra¨ndstro¨m, B. U. E., Leyser, T. B., Steen, A., Rietveld, M. T.,\nGustavsson, B., Aso, T., and Ejiri, M.: Unambiguous evidence of\nHF pump-enhanced airglow at auroral latitudes, Geophys. Res.\nLett., 26, 3561–3564, 1999.\nDjuth, F. T., Thide´, B., Ierkic, H. M., and Sulzer, M. P.: Large\nF region electron-temperature enhancements generated by high-\npower HF radio waves, Geophys. Res. Lett., 14, 953–956, 1987.\nEglitis, P., Robinson, T. R., Rietveld, M. T., Wright, D. M., and\nBond, G. E.: The phase speed of artificial field-aligned irregu-\nlarities observed by CUTLASS during HF modification of the\nauroral ionosphere, J. Geophys. Res, 103, 2253–2259, 1998.\nForme, F. R. E. and Fontaine, D.: Enhanced ion acoustic fluctua-\ntions and ion outflow, Ann. Geophys., 17, 190–209, 1999,\nSRef-ID: 1432-0576\/ag\/1999-17-190.\nFoster, J. C.: Radar observations of magnetosphere – ionosphere\ncoupling at middle and high latitudes, J. Geomag. Geoelectr., 47,\n801–812, 1995.\nFoster, C., Lester, M., and Davies, J. A.: A statistical study of di-\nurnal, seasonal and solar cycle variations of F-region and topside\nauroral upflows observed by EISCAT between 1984 and 1996,\nAnn. Geophys., 16, 1144–1158, 1998,\nSRef-ID: 1432-0576\/ag\/1998-16-1144.\nFranz, T. L., Kelley, M. C., and Gurevich, A. V.: Radar backscat-\ntering from artificial field-aligned irregularities, Radio Sci., 34,\n465–475, 1999.\nHaerendel, G.: Field-aligned currents in the Earth’s magnetosphere,\nin physics of magnetic flux ropes, Geophys. Monogr. Ser., vol.\n58, 539–553, AGU, Washington, D.C., 1990.\nHonary, F., Robinson, T. R., Wright, D. M., Stocker, A. J., Rietveld,\nM. T., and McCrea, I.: First direct observation of the reduced\nstriations at pump frequencies close to the electron gyroharmon-\nics, Ann. Geophys., 17, 1235–1238, 1999,\nSRef-ID: 1432-0576\/ag\/1999-17-1235.\nHunsucker, R. D.: Atmospheric gravity waves generated in the\nhigh-latitude ionosphere: a review, Rev. Geophys., 20, 293–315,\n1982.\nGinzburg, V. L.: Propagation of electromagnetic waves in plasma\n(in Russian), Nauka, Moscow, 1967.\nGurevich, A. V.: Nonlinear phenomena in the ionosphere, Springer,\nNew York, 1978.\nGurevich, A. V., Carlson, H., Kelly, M., Hagfors, T., Karashtin,\nA., and Zybin, K. P.: Nonlinear structuring of the ionosphere\nmodified by powerful radio waves at low latitudes, Phys. Lett. A,\n251, 311–321, 1999.\nGurevich, A. V., Carlson, H., and Zybin, K. P.: Nonlinear structur-\ning and southward shift of a strongly heated region in ionospheric\nmodification, Phys. Lett. A, 288, 231–239, 2001.\nIsham, B., Kofman, W., Hagfors, T., Nordling, J., Thide´, B., La\nHoz, C., and Stubbe, P.: New phenomena observed by EISCAT\nduring an RF ionospheric modification experiment, Radio Sci.,\n25, 251–262, 1990.\nIsham, B., Rietveld, M. T., Hagfors, T., La Hoz, C., Mishin, E.,\nKofman, W., Leyser, T. B., and van Eyken, A. P.: Aspect angle\ndependence of HF enhanced incoherent backscatter, Adv. Space\nN. F. Blagoveshchenskaya et al.: Phenomena in the ionosphere-magnetosphere system 99\nRes., 24, 1003–1006, 1999.\nJones, T. B., Robinson, T. R., Stubbe, P., and Kopka, H.: Frequency\ndependence of anomalous absorption caused by high power radio\nwaves, J. Atmos. Terr. Phys., 46, 147–153, 1984.\nKagan, L. M. and Frolov, V. L.: Significance of field-aligned cur-\nrents for F-region perturbations, J. Atmos. Terr. Phys., 58, 1465–\n1474, 1996.\nKamide, Y. and Baumjohann, W.: Magnetosphere-Ionosphere Cou-\npling, Springer-Verlag, New York, 1993.\nKan, J.: On the cause of substorm expansion onset and the processes\ndriving the substorm expansion phase, J. Atmos. Terr. Phys., 55,\n979–983, 1993.\nKelley, M. C., Arce, T. L., Salowey, J., Sulzer, M., Armstrong, W.\nT., Carter, M., and Duncan, L.: Density depletions at the 10-m\nscale induced by the Arecibo heater, J. Geophys. Res., 100, A9,\n17 367–17 376, 1995.\nKosch, M. J., Hagfors T., and Nielsen, E.: A new digital all-sky\nimager experiment for optical auroral studies in conjunction with\nScandinavian twin auroral radar experiment, Rev. Sci. Instr., 69,\n578–584, 1998.\nKosch, M. J., Rietveld, M. T., Hagfors, T., and Leyser, T. B.: High-\nlatitude HF-induced airglow displaced equatorwards of the pump\nbeam, Geophys. Res. Lett., 27, 2817–2820, 2000.\nKovtyukh, A. S.: Geocorona of hot plasma, Cosmic Res., Engl.\nTransl., 39, 527–558, 2001.\nLeyser, T. B.: Stimulated electromagnetic emissions by high-\nfrequency electromagnetic pumping of the ionospheric plasma,\nSpace Sci. Rev., 98, 223–328, 2001.\nLeyser, T. B., Thide´, B., Derblom, H., Hedberg, A., Lundborg, B.,\nStubbe, P., and Kopka, H.: Stimulated electromagnetic emission\nnear electron cyclotron harmonics in the ionosphere, Phys. Rev.\nLett., 63, 1145–1147, 1989.\nLu¨hr, H., Aylward, A., Buchert, S. C., Pajunpaa, A., Holmboe,\nT., and Zalewski, S. M.: Westward moving dynamic substorm\nfeatures observed with the IMAGE magnetometer network and\nother ground-based instruments, Ann. Geophys., 16, 425–440,\n1998,\nSRef-ID: 1432-0576\/ag\/1998-16-425.\nLyons, L. R.: Substorms: Fundamental observational features, dis-\ntinction from other disturbances, and external triggering, J. Geo-\nphys. Res., 101, 13 011–13 025, 1996.\nLysak, R. L.: Electrodynamic coupling of the magnetosphere and\nionosphere, Space Sci. Rev., 52, 33–87, 1990.\nLysak, R. L.: Feedback instability of the ionospheric resonant cav-\nity, J. Geophys. Res., 96, 1553–1568, 1991.\nLysak, R. L. and Song, Y.: Dynamic of auroral arc formation dur-\ning substorms, in Proc. Substorms 4 (ICS 4), vol. 238, 35–40,\nKluwer Academic Publishers, Dordrecht, 1998.\nMa¨lkki A. and Lundin, R.: Altitude distributions of upward ion\nbeams and solitary wave structures on the Viking data, Geophys.\nRes. Lett., 21, 2243–2246, 1994.\nMingaleva, G. I. and Mingalev, V. S.: Response of the convecting\nhigh-latitude F layer to a powerful HF wave, Ann. Geophys., 15,\n1291–1300, 1997,\nSRef-ID: 1432-0576\/ag\/1997-15-1291.\nOgawa, Y., Fujii, R., Buchert, S. C., Nozawa, S., Watanabe, S.,\nand van Eyken, A. P.: Simultaneous EISCAT Svalbard and VHF\nradar observations of ion upflows at different aspect angles, Geo-\nphys. Res. Lett., 27, 81–84, 2000.\nOssakow, S. L. and Chaturvedi, P. K.: Current convective instability\nin the diffuse aurora, Geophys. Res. Lett., 6, 332–335,1979.\nPeria, W. J. and Kelley, M. C.: Convection electric field observa-\ntions near Arecibo HF heater beam, J. Geophys. Res., 106, 18,\n517–524, 2001.\nRietveld, M. T., Isham, B., Kohl, H., La Hoz, C., and Hagfors, T.:\nMeasurements of HF-enhanced plasma and ion lines at EISCAT\nwith high-altitude resolution, J. Geophys. Res., 105, 7429–7439,\n2000.\nRietveld, M. T., Kosch, M. J., Blagoveshchenskaya, N. F., Ko-\nrnienko, V. A., Leyser, T. B., and Yeoman, T. K.: Ionospheric\nelectron heating, aurora and striations induced by powerful\nHF radio waves at high latitudes: aspect angle dependence,\nJ.Geophys.Res., 108(A4), 1141, doi:10.1029\/2002JA009543,\n2003.\nRietveld, M. T., Kohl, H., Kopka, H., and Stubbe, P.: Introduction\nto ionospheric heating at Tromsø, I. Experimental overview, J.\nAtmos. Terr. Phys., 55, 577–599, 1993.\nRishbeth, H. and van Eyken, T.: EISCAT: Early history and the first\nten years of operation , J. Atmos. Terr. Phys., 55, 525–542, 1993.\nRobinson, T. R., Stocker, A., Bond, G., Eglitis, P., Wright, P., Jones,\nT. B., and Rietveld, M. T.: First CUTLASS–EISCAT heating\nresults, Adv. Space Res., 21, 5, 663–666, 1998.\nRobinson, T. R., Strangeway, R., Wright, D. M., Davies, J. A.,\nHorne, R. B., Yeoman, T. K., Stocker, A. J., Lester, M., Rietveld,\nM. T., Mann, I. R., Carlson, C. W., and McFadden, J. P.: FAST\nobservations of ULF waves injected into the magnetosphere by\nmeans of modulated RF heating of the auroral electrojet, Geo-\nphys. Res. Lett., 27, 19, 3165–3168, 2000.\nRostoker, G.: The evolving concept of a magnetospheric substorm,\nJ. Atmos. Terr. Phys., 61, 85–100, 1999.\nSagawa, E. I., Iwamoto, I., Watanabe, S., Whalen, B. A., Yau, A.\nW., and Fukunishi, H.: Low energy upflowing ion events ob-\nserved by EXOS-D: Initial results, Geophys. Res. Lett., 18, 337–\n340, 1991.\nSergeev, V. A., Pulkkinen, T. I., and Pellinen, R. J.: Coupled-mode\nscenario for the magnetospheric dynamics, J. Geophys. Res.,\n101, 13 047–13 065, 1996.\nStasiewicz, K., Lundin, R., and Marklund, G.: Stochastic ion heat-\ning by orbit chaotization on electrostatic waves and nonlinear\nstructures, Physica Scripta, T84, 60–63, 2000.\nStasiewicz, K., Bellan, P., Chaston, C., Kletzing, C., et al.: Small\nscale Alfve´nic structure in the aurora, Space Sci. Rev., 92, 423–\n533, 2000.\nStubbe, P.: Review of ionospheric modification experiments at\nTromsø, J. Atmos. Terr. Phys., 58, 349–368, 1996.\nThide´, B., Hedberg, A., Fejer, J. A., and Sulzer, M. P.: First ob-\nservations of stimulated electromagnetic emissions at Arecibo,\nGeophys. Res.Lett., 16, 369–372, 1989.\nThide´, B., Derblom, H., Hedberg, A., Kopka, H., and Stubbe, P.:\nObservations of stimulated electromagnetic emissions in iono-\nspheric heating experiments, Radio Sci., 18, 851–859, 1983.\nThide´, B., Kopka, H., and Stubbe, P.: Observations of stimulated\nscattering of a strong high-frequency radio wave in the iono-\nsphere, Phys. Rev. Lett., 49, 1561–1563, 1982.\nTrakhtengerts, V. Y., Belyaev, P. P., Polyakov, S. V., Demekhov, A.\nG., and Bo¨singer, T.: Excitation of Alfve´n waves and vortices in\nthe ionospheric Alfve´n resonator by modulated powerful radio\nwaves., J. Atmos. Terr. Phys., 62, 267–276, 2000.\nTrakhtengerts, V. Y. and Feldstein, A. Y.: Turbulent Alfve´n bound-\nary layer in the polar ionosphere, 1. Excitation conditions and\nenergetics, J. Geophys. Res., 96, 19 363–19 372, 1991.\nTroshichev, O. A., Andresen, V. G., Vennerstro¨m, S., and Friis-\nChristensen, E.: Magnetic activity in the Polar Cap – a new in-\ndex, Planet. Space Sci., 36, 1095–1103, 1988.\n100 N. F. Blagoveshchenskaya et al.: Phenomena in the ionosphere-magnetosphere system\nVas’kov, V. V., Dimant, Ya. S., and Ryabova, N. A.: Magneto-\nspheric plasma thermal perturbations induced by resonant heat-\ning of ionospheric F-region by high-power radio wave, Adv.\nSpace Res., 13, 25–33, 1993.\nWahlund, J.-E., Opgenoorth, H. J., Ha¨ggstro¨m, I., Winsler, K. J.,\nand Jones, G. O. L.: EISCAT observations of topside ionospheric\nion outflows during auroral activity: revisited, J. Geophys. Res.,\n97, 3019–3037, 1992.\nYampolski, Y. M.: Reverberative scattering on artificial ionospheric\nturbulence, Izv. Vuzov (Radiofizika and Quantum Electronics, in\nRussian), 32, 519–521, 1989.\nYeoman, T. K., Wright, D. M., Robinson, T. R., Davies, J. A., and\nRietveld, M. T.: High spatial and temporal resolution observa-\ntions of an impulse-driven field line resonance in radar backscat-\nter artificially generated with the Tromsø heater, Ann. Geophys.,\n15, 634–644, 1997,\nSRef-ID: 1432-0576\/ag\/1997-15-634.\n"}