{"doi":"10.1080\/09574040801919955","coreId":"197538","oai":"oai:lra.le.ac.uk:2381\/9789","identifiers":["oai:lra.le.ac.uk:2381\/9789","10.1080\/09574040801919955"],"title":"Michèle Roberts and Romance","authors":["Parker, Emma"],"enrichments":{"references":[{"id":43713317,"title":"Distinction: A Social Critique of the Judgement of Taste","authors":[],"date":"1979","doi":"10.17323\/1726-3247-2005-3-25-48","raw":"Works Cited Bourdieu, Pierre. Distinction: A Social Critique of the Judgement of Taste (1979.","cites":null},{"id":43713320,"title":"Fiction, Feminism and Femininity from the Eighties to the Noughties’ in Contemporary British Women Writers,","authors":[],"date":"2004","doi":null,"raw":"Hanson, Clare. ‘Fiction, Feminism and Femininity from the Eighties to the Noughties’ in Contemporary British Women Writers, ed. Emma Parker (Cambridge: D.S Brewer, 2004), pp. 16-27 Hughes, Helen. The Historical Romance (London: Routledge, 1993) Jones, Ann Rosalind. ‘Mills & Boon Meets Feminism’ in The Progress of Romance: The Politics of Popular Fiction, ed. Jean Radford (London: Routledge, 1986), pp. 195-218 Kristeva, Julia. Revolution in Poetic Language. Trans. Margaret Walker (1974. New York: Columbia University Press, 1984) Neill, Anna. ‘Civilization and the Rights of Woman: Liberty and Captivity in the Work of Mary Wollstonecraft’, Women’s Writing 8:1 (2001): 99-117 Newman, Jenny. ‘An Interview with Michèle Roberts’, Cercles (2003) <http:\/\/www.cercles.com\/interviews\/roberts.html> Radway, Janice A. Reading the Romance: Women, Patriarchy and Popular Literature (1984. London: Verso, 1987) Roberts, Michèle. Fair Exchange (London: Little Brown, 1999) ---. Food, Sex and God: On Inspiration and Writing (London: Virago, 1998) ---. ‘Preface’. Madame Bovary. Trans. Geoffrey Wall (London: Penguin Classics, 2003), pp. vii-x ---. Reader, I Married Him (London: Little, Brown, 2004) ---. The Looking Glass. 2000 (London: Virago, 2001) ---. The Mistressclass. 2003 (London: Virago, 2004) ---. ‘Write, she said’ in The Progress of Romance: The Politics of Popular Fiction, ed. Jean Radford (London: Routledge, 1986), pp. 221-235 Thurston, Carol. The Romance Revolution: Erotic Novels for Women and the Quest for a New Sexual Identity (Urbana: University of Illinois Press, 1987) Westman, Karen. ‘A Story of Her Weaving: The Self-Authoring Heroines of Georgette Heyer’s Regency Romance’ in Doubled Plots: Romance and History, ed. Susan Strehle and Mary Paniccia Carden (Jackson: University Press of Mississipppi, 2003), pp. 165-184 Whelehan, Imelda. Helen Fielding’s ‘Bridget Jones’s Diary’: A Reader’s Guide (London: Continuum, 2002) ---. The Feminist Bestseller: From Sex and the Single Girl to Sex and the City (London: Palgrave, 2005) White, Rosie. ‘Permeable Borders, Possible Worlds: History and Identity in the Novels of Michèle Roberts’, Studies in Literary Imagination 36:2 (Fall 2003):","cites":null},{"id":43713319,"title":"Truth and Lies, History and Fiction in Michèle Roberts’s The Looking Glass’, Ecloga,","authors":[],"date":"2002","doi":null,"raw":"Falcus, Sarah. ‘Truth and Lies, History and Fiction in Michèle Roberts’s The Looking Glass’, Ecloga, Spring 2002 <http:\/\/www.strath.ac.uk\/ecloga\/Falcus.html> Gordon, Lyndall. Charlotte Bronte: A Passionate Life (1994. London: Vintage, 1995).","cites":null},{"id":43713318,"title":"Women’s writing leaves sex behind’,","authors":[],"date":"2002","doi":null,"raw":"Chrisafis, Angelique. ‘Women’s writing leaves sex behind’, The Guardian, 10 June, 2002, p. 5 Close, Ajay. ‘Feminist fun with a twist in the tale’, The Sunday Herald, Seven Days supplement, 9 January, 2005, p. 30 DuPlessis, Rachel Blau. Writing Beyond the Ending: Narrative Strategies of Twentieth-Century Women Writers (Bloomington: Indiana University Press, 1985).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-03-25","abstract":"This is an electronic version of an article published in Women: A Cultural Review, 2008, 19 (1), pp. 21-36. Women: A Cultural Review is available online at: www.tandfonline.com\/openurl?genre=article&issn=0957-4042&date=2008&volume=19&issue=1&spage=21.Since her debut novel, A Piece of the Night (1978), the first new book to be published by the Women’s Press, Michèle Roberts has produced literary fiction that is avowedly feminist in impulse. However, her twelfth novel, Reader, I Married Him (2004), appears to mark a transition from feminist to feminine fiction, a form of writing epitomised by chick lit, and one preoccupied with femininity, ‘the dark “Other” of feminism’ (Hanson, p. 16). As the cover of Reader (approved by Roberts) indicates, the novel self-consciously draws on the conventions of chick lit; it features a cartoon-style drawing of a woman sporting the contemporary signifiers of patriarchal femininity, a handbag and high-heeled shoes. Alluding to the text that spawned the genre, one reviewer even describes Roberts’s middle-aged protagonist as ‘a menopausal Bridget Jones’ (Ajay Close, p. 30). Like the re-publication of her third novel The Wild Girl (1984) as The Secret Gospel of Mary Magdalene (2007) in the wake of Dan Brown’s bestselling religious mystery The Da Vinci Code (2003), this apparent shift from feminist to feminine fiction (from a focus on ‘wimmin’ to ‘girlz’) could be interpreted as a cynical bid for commercial success. However, I propose that Roberts’s latest novel expresses concerns central to her work – namely, a critical preoccupation with romance and a desire to challenge boundaries. Focusing on Reader, I Married Him and the three novels that precede it - Fair Exchange (1999), The Looking Glass (2000) and The Mistressclass (2003) - I argue that Roberts rewrites romance in order to stress both its perils and disruptive potential. Further, I propose that by highlighting the subversive appeal of romance, she recoups a denigrated feminine genre and the women who cherish it. Finally, I suggest that by drawing on literary and popular forms of romantic fiction, Roberts confounds the categories that structure the literary marketplace, rather than attempting to shift her position in it. [Taken from the introduction]Peer-reviewedPost-prin","downloadUrl":"http:\/\/hdl.handle.net\/2381\/9789","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/9789\/1\/%5b04%5d%20Roberts%20and%20Romance%20Final%20Version%20for%20WCR.pdf","pdfHashValue":"26629f3ebacfafa573d7052ab4cae7161f2a7f7d","publisher":"Taylor & Francis (Routledge)","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/9789<\/identifier><datestamp>\n                2011-10-28T01:01:39Z<\/datestamp><setSpec>\n                com_2381_849<\/setSpec><setSpec>\n                com_2381_9548<\/setSpec><setSpec>\n                col_2381_9371<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nMichèle Roberts and Romance<\/dc:title><dc:creator>\nParker, Emma<\/dc:creator><dc:description>\nThis is an electronic version of an article published in Women: A Cultural Review, 2008, 19 (1), pp. 21-36. Women: A Cultural Review is available online at: www.tandfonline.com\/openurl?genre=article&issn=0957-4042&date=2008&volume=19&issue=1&spage=21.<\/dc:description><dc:description>\nSince her debut novel, A Piece of the Night (1978), the first new book to be published by the Women’s Press, Michèle Roberts has produced literary fiction that is avowedly feminist in impulse. However, her twelfth novel, Reader, I Married Him (2004), appears to mark a transition from feminist to feminine fiction, a form of writing epitomised by chick lit, and one preoccupied with femininity, ‘the dark “Other” of feminism’ (Hanson, p. 16). As the cover of Reader (approved by Roberts) indicates, the novel self-consciously draws on the conventions of chick lit; it features a cartoon-style drawing of a woman sporting the contemporary signifiers of patriarchal femininity, a handbag and high-heeled shoes. Alluding to the text that spawned the genre, one reviewer even describes Roberts’s middle-aged protagonist as ‘a menopausal Bridget Jones’ (Ajay Close, p. 30). Like the re-publication of her third novel The Wild Girl (1984) as The Secret Gospel of Mary Magdalene (2007) in the wake of Dan Brown’s bestselling religious mystery The Da Vinci Code (2003), this apparent shift from feminist to feminine fiction (from a focus on ‘wimmin’ to ‘girlz’) could be interpreted as a cynical bid for commercial success. However, I propose that Roberts’s latest novel expresses concerns central to her work – namely, a critical preoccupation with romance and a desire to challenge boundaries. Focusing on Reader, I Married Him and the three novels that precede it - Fair Exchange (1999), The Looking Glass (2000) and The Mistressclass (2003) - I argue that Roberts rewrites romance in order to stress both its perils and disruptive potential. Further, I propose that by highlighting the subversive appeal of romance, she recoups a denigrated feminine genre and the women who cherish it. Finally, I suggest that by drawing on literary and popular forms of romantic fiction, Roberts confounds the categories that structure the literary marketplace, rather than attempting to shift her position in it. [Taken from the introduction]<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPost-print<\/dc:description><dc:date>\n2011-10-27T12:46:11Z<\/dc:date><dc:date>\n2011-10-27T12:46:11Z<\/dc:date><dc:date>\n2008-03-25<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nWomen: A Cultural Review, 2008, 19 (1), pp. 21-36<\/dc:identifier><dc:identifier>\n0957-4042<\/dc:identifier><dc:identifier>\nhttp:\/\/www.tandfonline.com\/toc\/rwcr20\/19\/1<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/9789<\/dc:identifier><dc:identifier>\n10.1080\/09574040801919955<\/dc:identifier><dc:identifier>\n1470-1367<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\n© 2008, Toylor & Francis. Deposited with reference to the publisher’s archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:publisher>\nTaylor & Francis (Routledge)<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["1470-1367","0957-4042","issn:0957-4042","issn:1470-1367"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":[],"subject":["Article"],"fullText":"Michèle Roberts and Romance \nEmma Parker \nSince her debut novel, A Piece of the Night (1978), the first new book to be published \nby the Women’s Press, Michèle Roberts has produced literary fiction that is avowedly \nfeminist in impulse. However, her twelfth novel, Reader, I Married Him (2004), \nappears to mark a transition from feminist to feminine fiction, a form of writing  \nepitomised by chick lit, and one preoccupied with femininity, ‘the dark “Other” of \nfeminism’ (Hanson, p. 16). As the cover of Reader (approved by Roberts) indicates, \nthe novel self-consciously draws on the conventions of chick lit; it features a cartoon-\nstyle drawing of a woman sporting the contemporary signifiers of patriarchal \nfemininity, a handbag and high-heeled shoes. Alluding to the text that spawned the \ngenre, one reviewer even describes Roberts’s middle-aged protagonist as ‘a \nmenopausal Bridget Jones’ (Ajay Close, p. 30). Like the re-publication of her third \nnovel The Wild Girl (1984) as The Secret Gospel of Mary Magdalene (2007) in the \nwake of Dan Brown’s bestselling religious mystery The Da Vinci Code (2003), this \napparent shift from feminist to feminine fiction (from a focus on ‘wimmin’ to ‘girlz’) \ncould be interpreted as a cynical bid for commercial success. However, I propose that \nRoberts’s latest novel expresses concerns central to her work – namely, a critical \npreoccupation with romance and a desire to challenge boundaries. Focusing on \nReader, I Married Him and the three novels that precede it - Fair Exchange (1999), \nThe Looking Glass (2000) and The Mistressclass (2003) - I argue that Roberts \nrewrites romance in order to stress both its perils and disruptive potential. Further, I \npropose that by highlighting the subversive appeal of romance, she recoups a \ndenigrated feminine genre and the women who cherish it. Finally, I suggest that by \ndrawing on literary and popular forms of romantic fiction, Roberts confounds the \n 2 \ncategories that structure the literary marketplace, rather than attempting to shift her \nposition in it. \n \nFair Exchange \nRoberts has described Fair Exchange, her first historical romance, as an homage to \nGeorgette Heyer, whose Regency romances she consumed avidly in adolescence. Like \nThese Old Shades (1926), the prototype of the formula for which Heyer became \nfamous (Hughes 39), Roberts’s novel features a spirited protagonist, is set in \neighteenth century France and England, and uses the plot device of infants switched at \nbirth. Following Heyer, who is credited with transforming historical romance from an \nadventure story into a love story that appealed to women readers (Hughes 132), \nRoberts uses the genre to express specifically female concerns. Helen Hughes \nproposes that Heyer’s work reflects on power relationships between men and women \n(17), stresses female vulnerability and articulates the impossibility of a woman’s \nsituation in a patriarchal world (118). Like Heyer, Roberts uses romance to explore \nwomen’s anxieties about relationships with men. \nWhile Roberts acknowledges her debt to the queen of Regency Romance, she \nalso describes Heyer’s influence as ‘damaging’ because her books offered a \ndisempowering view of gender and heterosexual relations (Newman). As Hughes \nnotes, although Heyer plays with gender roles, her heroines finally submit to the \nsocial conventions they contest and endorse the myth that romantic love is the source \nof female fulfilment (Hughes 122). Even after embracing feminism, this is a myth that \nRoberts struggled to escape. She confesses that she still experienced a ‘strong drive’ \nto write romance (‘Write’ 228) and, reflecting this, Rosie White notes that her early \nfiction never entirely escapes the romance plot (73). Because Heyer’s novels damaged \n 3 \nRoberts, she ‘had to come back and deal with them’ (Newman), and she does this in \nFair Exchange by rewriting romance.  \nFair Exchange underlines the damage wrought by romance through its two \nfemale protagonists, Jemima Boote and Annette Villon, both of whom internalise the \npatriarchal ideals of romantic love. Jemima is modelled on Mary Wollstonecraft and, \nlike her historical counterpart, falls prey to the seductive appeal of romance. Although \nWollstonecraft challenged the ideology of separate spheres that equated men with \nsense and women with sensibility in her revolutionary polemic Vindication of the \nRights of Woman (1794), passion overcame reason in her personal relationships with \nmen, causing her profound suffering. After a torrid affair, she was abandoned by her \nlover, Gilbert Imlay, shortly after the birth of their daughter. Unable to accept this \nrejection, Wollstonecraft’s despair culminated in several suicide attempts.  \nIn Fair Exchange, Jemima’s relationship with Paul Gilbert mirrors \nWollstonecraft’s unhappy liaison with Gilbert Imlay. Although Jemima is \ncharacterised by reason – ‘She had chosen well, she thought, a friendly man whom \nshe liked’ (189) – she finds herself overwhelmed by emotions that ‘entered her and \ntook her over’ (189). Like Wollstonecraft, Jemima casts aside politics for passion: \nawaiting Gilbert’s delayed and indefinite arrival, she passes the time ‘pretending to \nwrite a political memoir and scribbling a romance in secret instead’ (186). \nDisappointed by her lover, Jemima gives her romantic heroines ‘more adventures than \nshe had had herself and less misfortune’ (186-7), confirming Janice Radway’s \ncontention that the appeal of the genre lies in its ability to satisfy emotional needs not \nmet in women’s intimate relationships with men (Radway 94, 96). As Roberts \nexplains in her Preface to Madame Bovary (1857), romantic fiction simultaneously \narticulates and appeases female discontent: although it may enable women to explore \n 4 \nanxious questions, it tends to ‘offer sentimental and reassuring answers’ (Preface, \nMadame Bovary, viii). Jemima thus demonstrates that romance can function as a \ndangerous political sedative that maintains the patriarchal status quo. \nHowever, despite their similarities, Jemima is not Wollstonecraft and avoids \nthe painful fate of her historical counterpart. Wollstonecraft’s appearance in the novel \nemphasises that the two figures are not the same. Indeed, by naming Jemima after the \nprison warden in Wollstonecraft’s final (unfinished) novel Maria (1798), who \ndistrusts romantic fiction (in contrast to the eponymous heroine), Roberts points to the \nimportance of resisting romance. Resistance is also signalled by the marginalisation of \nJemima’s lover and foregrounding of her relationships with women: her childhood \nfriend, Fanny, Annette (the novel’s other protagonist) and her daughter. Furthermore, \nscenes of courtship and seduction are occluded until the end of the narrative, when \nthey are related in retrospect, confirming that Roberts is less concerned with romance \nthan its damaging effects. As Jemima’s life does not feature the suicide attempts that \nhave defined Wollstonecraft as a tragic victim of a failed romance, and ends with her \ndiscovering a ‘new cheerfulness’ (241), Roberts celebrates her protagonist’s sexual \npassion whilst saving her from the romantic delusions that almost destroyed the \nfounding mother of modern feminism.  \nRoberts’s desire to rewrite romance is also evident in the parallels between \nFair Exchange and Wollstonecraft’s Maria. Following the affair with Imlay, \nWollstonecraft poured her torment into this highly autobiographical novel, in which \nexcessive sensibility leads the protagonist, incarcerated in a madhouse by her cruel \nhusband, to mistake a fellow-prisoner for the hero of the romances she has read, and \nthus take as her lover a cad who later betrays and deserts her. Fair Exchange echoes \nthe central theme of Maria in its condemnation of the patriarchal structures that \n 5 \n‘preserve women as commodities in a system of exchange between men’ (Neill 110), \nand both texts contain characters called Jemima and Maria, feature incarcerated \nwomen who become friends, feckless men who seduce and desert their lovers, and \nfathers who hide children from their mothers. Although incomplete, Wollstonecraft \nsketched several possible conclusions to Maria before her death, all unhappy. \nHowever, ‘The End’ is followed by a longer passage which offers an alternative, more \npositive, denoument: Jemima reunites Maria with her long lost daughter, who has \nbeen ‘secreted’ by her husband, inspiring Maria to live rather than die. Similarly, at \nthe end of Fair Exchange, Jemima has a daughter she thought dead returned to her \nwhen it is revealed that Gilbert and his friend Saygood swapped their daughters and \nthat Jemima is the biological mother of Annette’s daughter, Caroline. By embracing \nthis conclusion, Roberts illustrates the central tenet of Rachel Blau DuPlessis’s \nWriting Beyond the Ending (1985), that women writers resist the restrictive \nresolutions of the romance plot, subverting a literary tradition in which, for women, \ndeath is the only alternative to marriage.  \n \nThe Looking Glass \nThe Looking Glass continues to explore the damaging effects of romance on women \nwhilst rewriting literary and popular fictions, this time, Madame Bovary and The \nLittle Mermaid (1836). This novel relates the stories of five women, all connected to \nthe poet Gerard Colbert, based partly on Gustave Flaubert. Like Madame Bovary, The \nLooking Glass highlights the perils of romance but, as Sarah Falcus has shown, \nRoberts rewrites Flaubert’s novel by revising the fate of his protagonist. Isabelle, \nColbert’s mistress, closely resembles Louise Colet, Flaubert’s lover and model for \nEmma Bovary. There are numerous parallels between the two women but, just as \n 6 \nJemima is not Wollstonecraft, Isabelle is not Emma. When Colbert ends their affair, \nIsabelle declares, having read Madame Bovary, ‘I had decided on a better fate for \nmyself. I chose a happy ending, not a tragic one’ (184). When she starts work, \nIsabelle relinquishes her romantic ideals. She has ‘little time for being in love’ and no \nlonger thinks of Colbert as ‘the hero, the prince who would ride up and rescue me’ \n(191; 193). In contrast to Emma, who is destroyed by romance, Isabelle finds \nhappiness in economic and emotional independence.  \nAlthough Falcus focuses on Isabelle, Emma’s romantic inclinations are also \nshared by Millicent, Colbert’s English governess. Through Millicent, Roberts \ndemonstrates that romance upholds patriarchy by equating femininity with silence, \nsubmission and suffering. Like Emma, Millicent’s view of life is shaped by romantic \nfiction: she ‘weave[s] her life into a shining love story like a cobweb spangled with \nrain’ (158). Romance obscures her vision and Millicent, like Emma, idealises her \nlover: ‘I can’t imagine why I once thought him ugly…Now I think him beautiful’ \n(127). Reflecting Carol Thurston’s observation that the traditional romantic heroine is \nquiet and unable to express her emotions (38), Millicent loses the ability to speak in \nthe presence of the poet: ‘I could hardly form an opinion let alone shape it into words; \nI felt tongue-tied and stammering’ (144). Furthermore, for Millicent, romantic love \nmeans self-denial: ‘I love him and that’s got to be enough. I must not ask for anything \nback’ (127). Moreover, romantic love is masochistic; after cutting her hand Millicent \ncherishes her wound because ‘It throbbed and stung, just like love does’ (130). \nMillicent also confirms Radway’s assertion that ‘Passivity is at the heart of the \nromance experience’ (97). Once dismissed from the Colbert household, she refuses to \nrelinquish her romantic fantasies: ‘She existed in a kind of dreamy state, constantly \nre-imagining her next meeting with the poet, and the beautiful consequences which \n 7 \nwould ensue’ (264). Only once Millicent is awoken from her paralyzing romantic \ndreams does she fulfil her own dream of becoming a poet. \nIf The Looking Glass rewrites Madame Bovary, it simultaneously revises Hans \nChristian Andersen’s The Little Mermaid, whose protagonist epitomises the self-\nsacrificing romantic heroine. Reflecting their internalisation of romantic myths, each \nof Colbert’s three lovers implicitly identifies herself as a mermaid. Millicent describes \nherself, slipping and slithering down the pebbles on the beach as ‘transformed; \nanother creature’ (140), and Isabelle dreams of swimming up the river to Colbert’s \nhouse ‘disguised as an eel or a carp or some such’ and ‘landing flop! on his carpet’ \n(188). Although Genevieve, Colbert’s housekeeper, compares herself to a mermaid \nmost often she also articulates a desire to revise dominant narratives: ‘I began \nferociously to tell myself a story about a mermaid; only this time she would not die; \nshe would escape; she would dive into the depths of the sea and hide there’ (84).  \nGenevieve resists the grand narrative of romance, realizing ‘I was not condemned to \nrepeat the mermaid story from now till eternity. I could grow up; I could move; I \ncould get away’ (89).  However, highlighting the power of patriarchy, initially she \nreplays the story that she seeks to rewrite. Like the Little Mermaid, Genevieve leaves \nhome to live with a man who does not love her and gives up language: ‘Words were \nsomething I seemed to have left behind’ (149). The danger of identification with the \nmermaid is underscored by Genevieve’s plan to drown herself: ‘Sooner or later the \nmermaid had to return to the sea, which was her only true home’ (250). However, \nafter leaving Colbert and relinquishing her romantic fantasies, Genevieve no longer \nidentifies with the archetypical romantic heroine: ‘the mermaid had gone. She had \nswum off and I was left alone…with a feeling of lightness’ (270). The retreat of the \nmermaid signals her rejection of romance and the possibility of happiness. \n 8 \nLike the Little Mermaid, Genevieve has no mother, and the heroine’s \nmotherless state offers an insight into the powerful appeal that romance holds for \nfemale readers. Radway proposes that despite its preoccupation with men and \nmarriage, romance represents an unconscious quest for maternal nurturance (124). \nHer thesis draws on the psychoanalytic work of Nancy Chodorow, who employs a \nfeminist interpretation of Freudian object relations theory to analyse how the \npatriarchal context of mothering shapes female development. Chodorow argues that \nthe daughter’s intense identification with the mother leads to incomplete separation \nfrom her in the oedipal stage, producing a continuing need for maternal nurturance \nand a desire to regress into infancy and reconstruct the lost intensity of the mother-\ndaughter bond (Radway 136). Radway proposes that through its promise of ‘utopian \nbliss’ romance offers women a means of recovering the mother (100), of re-\nestablishing the blissful pre-oedipal union between mother and child (151; 156), and \nthus satisfies desires that heteropatriarchy either represses or dictates must be met \nthrough men (140). Roberts echoes Radway in her view of romance as a quest \nnarrative in which the heroine searches for the ‘lost mother’ (‘Write’ 227).  ‘The \nhero’, she claims, ‘symbolizes the mother’ (‘Write’ 227), and she compares the \nblissful kiss that typically draws the romantic novel to a close with ‘the ecstatic \npleasure of the tiny girl sucking on her mother’s milk’ (FSG 16). Likewise, Roberts \nconnects the pleasures of reading romance with maternal nurturance in her description \nof romantic fiction as ‘good milk’ (FSG 54).  \nLike the archetypal romantic heroine (and like Jemima in Fair Exchange), \nGenevieve is an orphan thrown into an unfamiliar environment and emotional \nisolation when she moves to a new town. However, rather than meeting a man, \nGenevieve finds a longed-for mother-figure in her employer, Madame Patin. She \n 9 \ncompares her arrival to birth -  ‘I fell down that last stretch of road as though I were \nbeing born’ (11) - and soon experiences the emotional and physical satisfaction of \nmother-love: ‘This was what it must be like to have a mother, I thought, this loving \nher and being allowed to be near her’ (34). The imagery she employs to describe her \njoy evokes the bliss associated with the maternal breast: ‘goodness and plenty in the \nland of milk and honey…paradise’ (44-45).  \nMadame Patin’s name, which evokes the slang for ‘French kiss’ (rouler un \npatin), indicates that the mother is implicated in romance. Furthermore, whereas the \nromantic heroine longs to be rescued by a lover, Genevieve longs to be saved from a \nlover by her mother, suggesting that she is the real object of desire. When Madame \nPatin marries, Genevieve reluctantly becomes embroiled in a sexual relationship with \nher husband and longs for her surrogate mother to end the affair: ‘I longed for her to \nrescue me’ (77). Upon discovery, Genevieve flees, only to be rescued by Colbert and \nbecome his lover. However, water imagery suggests that Colbert functions as a male \nmother through whom Genevieve seeks to assuage the loss of maternal love. Radway \nproposes that the goal of romance is oceanic merging with an other (153), a metaphor \nthat evokes the semiotic, the pre-oedipal realm that Kristeva defines in terms of \nfluidity and associates with the ‘mother’s body’ (27). Genevieve uses sea imagery to \narticulate sexual desire: ‘Something powerful, a tide of wanting, was drawing me \ntowards him and pushing me back, forward and back, like the rhythm of the sea itself, \nthe waves falling urgently onto the beach…I thought I might turn to water’ (144).  \nThe oceanic metaphor Genevieve employs to describe her relationship with Colbert \nechoes that used to convey the happiness inspired by Madame Patin: ‘It went on \nmoving up and down inside me, like the waves swelling and breaking on the beach’ \n(34). Sea imagery thus suggests Colbert’s status as a mother substitute. \n 10 \nChild-like hunger and cave imagery indicate that Colbert functions as a \nmother substitute not only for Genevieve but also for his other lovers, Millicent and \nIsabelle. Radway proposes that the romantic heroine desires to be nurtured as an \ninfant by its mother (146), and, like Genevieve, who is a ‘hungry child’ in Madame \nPatin’s presence (40), Millicent feels ‘childish’ with something inside her ‘starving \nand shouting’ (104), and Isabelle wonders if it is ‘childish’ to seek in her lover the \nsatisfaction she does not find in her husband (186). Caves and mothers are linked by \nGenevieve’s desire to live with Madame Patin ‘at the bottom of the sea in a cave \nmade fast with coral and guarded by dragons’ (66), a home reminiscent of that \ninhabited by the pagan mother goddess, Cybele. Colbert is implicitly compared to \nCybele, traditionally represented by a black stone set in a silver statue, when Isabelle \nimagines their affair ‘like a silver statue hidden in a cave’ (186). The symbolic \nsignificance of caves suggests that when Millicent sits in a cave with Colbert on the \nbeach the desire she feels for him is an unconscious expression of a desire for her \nmother, to whom she eventually returns. Underlining that the mother is the primary \nobject of desire in romance, the novel ends with Genevieve likewise preparing to \nreturn to Madame Patin, her surrogate mother. By bringing to the fore female desires \nthat Radway suggests are submerged in romance, Roberts challenges the commonly \nheld view that women read romantic novels because they are ‘weak and silly’ \n(Preface viii), and suggests that the appeal of the genre lies in its ability to give covert \nexpression to taboo female desires.   \n \nThe Mistressclass \nIn The Mistressclass, Roberts turns her attention to one of the ur-texts of romantic \nfiction, Jane Eyre (1847), and examines the historical figures upon whom the \n 11 \narchetypal romantic couple (Jane and Rochester) are modelled: Charlotte Bronte and \nher Belgian teacher, Constantin Heger.1\nLike the two novels that precede it, The Mistressclass stresses that romance \nengenders masochism in, and antagonism between, women. Charlotte is passionately \nin love with Heger, her ‘master’ (3). His mastery is professional and personal: she is \nhis pupil and longs to be his mistress. The dangers of dependence are clear when \nCharlotte tells Heger that she cannot write because ‘you are not close to me, to inspire \nme and argue with me and spur me on’ (7). In contrast to the needy Charlotte, Heger, \nlike Rochester, is ‘cool and impersonal’ (44). He is also cruel and Charlotte cherishes \nthe pain that he inflicts: ‘I treasured every savage and satirical rebuke you scrawled in \nmy margins’ (3-4). She longs to be in his presence, even though it is ‘torture’ because, \nas Madame Heger informs her, ‘real love involves real pain. It must hurt or it’s not \nlove’ (41; 182).  \n Inspired by Bronte’s letters to Heger, the \nnovel offers a fictional account of their relationship. As well as reimagining Bronte’s \nromantic life, Roberts intersperses Charlotte’s unsent letters to Heger with a parallel \nnarrative about a contemporary love triangle that rewrites Jane Eyre. \nBoth the nineteenth century and contemporary narratives illustrate that \nromance divides women against each other. Charlotte and her sister Emily compete \nfor Heger’s attention just as modern-day sisters Vinny and Catherine vie for Adam, \nwho moves from being Vinny’s boyfriend to Catherine’s husband. Like Charlotte, \nCatherine and Vinny are both happy to adopt the role of mistress. Vinny longs to be \nAdam’s lover (even though he is married to her sister) and Catherine is content to be \n                                                 \n1 Roberts’s novel challenges Lyndall Gordon’s view that Bronte begins Jane Eyre having ‘worked off \nthe Brussels experience’ in The Professor (1846) (p. 144), and does not return to her preoccupation \nwith Heger until Villette (1853), ‘her most autobiographical treatment of their relationship’ (p. 110), by \nsuggesting that Jane Eyre is shaped as much by Bronte’s passion for her tutor as the novels that deal \nwith the relationship more directly. Despite her assertion that Jane Eyre does not draw on the Brussels \naffair, Gordon concedes that Rochester resembles Heger (p. 148). \n 12 \nthought to be intimately involved with father-in-law: ‘People assumed she was his \nmistress and she let them’ (245). All three women are willing to embrace a \ndisempowering role: while ‘master’ suggests control and authority, ‘mistress’ denotes \na man’s lover, illustrating that female identity is defined in relation to men. \nWhilst critical of romance, Roberts again reveals its appeal by presenting \nHeger as a male mother. The motherless Charlotte expresses her desire for nurturance \nand implicitly casts Heger in a maternal role: ‘The language that links us is an \ninvisible, living cord….If I were not connected to you by that cord then I should die’ \n(3). She later compares herself to a child seeking parental approval: ‘I yearned to \nremain in your presence, to please you in every possible way, and never to arouse \nyour wrath’ (43). Charlotte’s longing makes it clear that romantic love and fiction \nexpress a desire for mother-love: ‘I had no mother. No mother I could know or \nremember…I stoppered up my child-self; all its longings. Only in reading and writing \ncould they emerge and live freely. Only when I met you and began to love you. Then \nout they leaped’ (77).  \nAs well as highlighting the subtext of romance, Roberts rewrites the rules of \nthe genre when Charlotte transfers her affection from a master to a mistress. Heger is \nusurped by an alternative mother-figure, George Sand (a fictional version of the \nnineteenth century cross-dressing French author who paved the way for other \nprofessional women writers). Having been nursed back to good health and encouraged \nto write by her new surrogate mother,  Charlotte tells Heger, having ‘gnawed at the \nhalf-eaten crusts on the floor under your table like a ravening dog’ (77), Madame \nSand ‘fills me up with good things’ (232). Once she acquires the maternal nurturance \nshe seeks, Charlotte is ‘cured’ of romantic love and ready to ‘write another novel’ \n 13 \n(235; 293). Having renounced her desire to be Heger’s mistress, she is able to write \nher ‘masterpiece’ (67). \nLike Charlotte, Vinny and Catherine are motherless and mourn the maternal \nnurturance they once enjoyed. Having her hair washed in a salon reminds Catherine of \nbeing in the bath with Vinny as a child and she feels ‘soothed’ (21), ‘comforted’ (22), \nand ‘cossetted’ (23), sensations akin to those experienced in the womb or at the \nmaternal breast (23). Dozing on a train, Vinny becomes ‘a baby again, held on mum’s \nlap…she could have as she wanted’, an experience that brings ‘sweetness and bliss’ \n(126). When she wakes with the realization that her mother is dead, ‘Tears wanted to \nspill’ (127). For both sisters, romance, in the form of Jane Eyre, offers emotional \ncompensation for the loss of mother-love.  \nBoth sisters identify closely with Jane Eyre. Catherine teaches the novel and \nVinny knows it ‘almost by heart’ (49). Even though she claims not to believe in \nromantic love, which is a ‘delusion, a snare. Bourgeois ideology’ (124), Vinny is \nsubsumed with romantic desire. She holds the lilac she has picked like ‘a bride’ and \ncompares its scent to ‘the wafts of perfume drifting through the garden of Thornfield \non that Midsummer’s Eve’ when Mr Rochester tells Jane that he loves her (51-2). \nVinny also ‘wishes she were the sort of woman you meet in novels, who just radiates \na soft feminine sexuality that has the hero madly in love with her within three \nseconds’ (115), and her name, which Catherine truncates to ‘Vin’, suggests that she \nfunctions as Plain Jane’s modern double: ‘Vin de table, Catherine labelled her: Vin \nordinaire’ (175). Catherine’s yearning for a romantic hero suggests that she likewise \nidentifies with Bronte’s romantic heroine: ‘Charlie might not scowl like Mr Rochester \nbut he would do’ (62).  \n 14 \nHowever, as the narrative progresses, Catherine and Vinny become as \ndisillusioned and resistant to romance as Charlotte. Parallels between Catherine and \nMrs Dalloway, both middle-aged women who wander through London buying \nflowers in preparation for a party, emphasise that Roberts, like Woolf, opposes the \ntraditional romance plot. DuPlessis argues that in Mrs Dalloway (1925) Woolf \ndisplaces romance from the center of the narrative and from this point on it never \nagain appears in her work ‘assumed or unquestioned’ (47-8). Vinny’s rejection of \nromance is anticipated by an allusion to another novel by Woolf.  Towards the end of \nOrlando (1928), Woolf’s eponymous protagonist sees an incomplete sign that reads \n‘Amor Vin-’ (212). Vinny’s name echoes this sign, likewise fracturing, and rendering \nmeaningless, the romantic motto ‘Amor vincit omia’ or ‘love conquers all’ (DuPlessis \n62).  \nVinny’s scepticism towards romance is expressed through her growing \ndissatisfaction with fairy tales. Reflecting Radway’s observation that romances are \nlike fairy tales (109), Vinny initially views life through a fairy tale lens: she describes \nherself and Catherine as ‘Babes in the Wood’ (107), the setting of their holiday home \nin France as ‘fairytale’ (128), and Adam as ‘the prince in disguise’ (128). Later, \nhowever, Vinny rejects fairy tales and the simple binary oppositions that underpin \nthem: ‘Who were those two sisters in that French fairy tale? Rose Red and Snow \nWhite. One good and one bad. One feminine and one not….Was that the right story? \nNo, Vinny shouted to herself: too simplistic’ (139-40). Vinny’s desire to rupture the \nbinary oppositions that define women as good or bad and position them as rivals is \nreflected in her twin kinship with Jane Eyre and Bertha Mason, Rochester’s first wife. \nLike Bertha, Vinny is described as a ‘madwoman’ and ‘monster’ (105; 224), and \nfantasises that she is an ‘arsonist’ (176). This dual identification echoes readings of \n 15 \nBronte’s novel that suggest Bertha represents the socially unacceptable side of Jane \n(her sexual desire and rage) but also subverts the traditional construction of women as \nantagonists. \nVinny’s rejection of narratives that construct women as rivals (like Snow-\nWhite and Rose-Red) allows the novel’s various love triangles to be redrawn: the \ntriangle in the modern-day narrative (Vinny-Adam-Catherine) reflects the triangle that \nCharlotte transposes from her life (Charlotte-Heger-Heger’s wife) to her fiction (Jane-\nRochester-Bertha). Initially, Vinny and Catherine are set against each other in the \nsame manner as Jane and Bertha in Jane Eyre. However, whereas Bronte has Bertha \nfall to her death, so that Jane and Rochester can marry, Roberts has Adam fall from a \nbridge. Although he does not die, the removal of Adam enables Catherine and Vinny \nto renew their relationship, suggested by the possibility of a travelling to India \ntogether. As Roberts’s woman-centred title indicates, the lesson that women learn in \nThe Mistressclass is not to seek fulfilment in romantic relationships with men. \n \nReader, I Married Him  \nAs the cover and title indicates, Reader, I Married Him blends canonical nineteenth \ncentury romantic fiction, epitomised by Jane Eyre, with its contemporary offspring, \nchick lit: a modern form of romantic fiction that follows the comic misadventures of a \nsingle, professional, young woman as she struggles to find Mr Right. While alluding \nto Bronte’s classic, the novel simultaneously invokes Gillian Beer’s influential study \nof Austen, Bronte, Eliot, and Gaskell, which bears the same title. Despite Beer’s \ninterest in romance, in her capacity as a 2002 Orange Prize judge she denounced \nchick lit and celebrated the demise of writing by women that deals with romantic \n 16 \nlove.2\nReader focuses on Aurora, whose romantic inclinations are signalled by her \nidentification with the heroines of her ‘favourite novels’ (24), the classic romantic \nnarratives that form the basis of Beer’s study: ‘I felt like Dorothea in Middlemarch, \nwhen, after her dreary courtship by Casaubon, Will Ladislaw suddenly comes into her \nlife’ (49); ‘I translated. Like Anne Elliott in Persuasion, at the concert in Bath, I gave \njust the gist of the speech’ (169); ‘Like Mr Darcy watching Elizabeth cry in Pride and \nPrejudice, he [Frederico] observed me in a compassionate silence’ (184). As \nDuPlessis points out, these are all novels in which the heroine’s quest for self-\nrealization is ultimately subordinated to the marriage plot (7). Like the novel that has \ncome to define chick lit, Helen Fielding’s Bridget Jones’s Diary (1996), which draws \non Austen’s Pride and Prejudice (1813) (the first book that Roberts ever bought), and \nlike its sequel, Bridget Jones: The Edge of Reason (1999), which parallels the plot of \nAusten’s Persuasion (1818), Roberts’s allusion to nineteenth century novels suggests \nthat, despite the changes wrought by feminism, modern relationships between men \nand women remain largely unreconstructed in the personal sphere.   \n  By embracing chick lit, Roberts offers a playful retort to Beer’s literary double \nstandard whilst continuing to explore the seductive power of romance.   \nInitially, Reader appears to adopt the typical features of romantic fiction. In \nthe exotic setting of Italy, Aurora pursues her passion for the handsome Father \nMichael, a man who bears all the hallmarks of the romantic hero: ‘mysterious’ (37), \n‘unattainable’ (131), and macho – he rides a Harley Davidson and wears ‘Eau \nSauvage’ aftershave (45). The dangers of romance are highlighted when, dancing with \nMichael, Aurora, who normally prefers ‘to act rather than reflect’ (156), relinquishes \ncontrol and allows herself to be ‘swept away’ (131). Illustrating that romance \n                                                 \n2  See Angelique Chrisafis, ‘Women’s writing leaves sex behind’, The Guardian, 10 June, 2002, p.5 \n 17 \neroticises male dominance and female submission, Aurora exclaims, ‘Born along by \nhis strength, all I had to do was yield, follow. It was blissful!’ (130-1). The blindness \nengendered by romantic love is underlined when swollen mosquito bites prevent \nAurora from opening her eyes and when she picks up the wrong spectacles and, \nblinded by love, she fails to see that the hero is a rake incapable of offering her love, \ncare and commitment.  \nHowever, inspired by capriccio, a form of landscape painting that involves the \nplayful transgression of norms, Roberts subverts the conventions of chick lit by \nreinventing the romantic heroine. As her name (meaning ‘dawn’) suggests, Aurora is \na new kind of heroine. In contrast to the calorie-counting, thirty-something Bridget \nJones, the middle-aged Aurora is a woman of appetite: offered three different \nspecialities in a restaurant, she tells the waiter, ‘I’ll have the lot’ (93). Roberts also \ndebunks a stock romantic device. Aurora regards Father Michael’s appearance in Italy \nwhile she is on holiday there as a ‘coincidence’ (50), but it transpires that he is an \nundercover detective pursuing her on suspicion of murder. Thus, running into each \nother is ‘Not synchronicity after all’ (227). Subverting the traditional male role, Father \nMichael turns out to be less a hero than a villain. Quashing all hopes of romance, he \ncallously informs Aurora that he only slept with her to elicit information and she later \nwitnesses him picking up a prostitute.  \n In the manner of many romances, Reader presents its heroine with two \npotential partners and Frederico, the feminine museum director, functions as an \nalternative hero. Following the formula of romance, in which a misunderstanding \nkeeps the true lovers apart, Aurora initially discounts Frederico as a romantic prospect \non the grounds he is gay. However, Roberts subverts the conventions she invokes by \nturning the gay male friend, a stock chick lit character, into the hero, albeit one who \n 18 \nresists dominant definitions of gender. In Food, Sex and God (1998), Roberts \nproposes that part of the unconscious appeal of romance lies in its subversion of \ngender roles: ‘Under its cloak of convention, the romance allows for some disruptive \ngoings on, for the fixed categories of gender to lurch about a little’ (16). Like \nRochester, whose ‘rampant masculinity’ is undercut by his cross-dressing (FSG 16), \nFrederico is an ambiguously gendered hero. He has some of the hero’s typically \nmasculine features: like Rochester or Darcy, he is ‘standoffish’ (73), and like Father \nMichael he too wears ‘Eau Sauvage’ (115).  Yet, in contrast to the classic hero, \nFrederico is ‘no mystery’ (122), and possesses several feminine characteristics. He is \nemotionally articulate, he can put ‘feelings into words’ (207), has ‘Masculine \nintuition’ (207), and is ‘oddly nervous’, rather than sexually dominant, in the bedroom \n(209). These feminine attributes subvert the ‘extremes of sexual difference’ on which \ntraditional romance is based (DuPlessis 5), and undercut what Imelda Whelehan terms \nthe ‘emotional separatism’ of chick lit (Bridget 68), epitomised by Bridget Jones’ \nfavourite advice manual, John Gray’s Men are from Mars, Women are from Venus \n(1993). Roberts further feminises her hero, and makes explicit the subtext of the \nclassic romance narrative, when Frederico offers the motherless Aurora maternal \nnurturance: after a series of missed lunches, he feeds the ‘hungry’ heroine (206). The \nimportance of the mother is signalled by the opening words of the novel - ‘My \nmother’ (1) – and the theme of the male mother is underlined by the revelation that \nAurora’s step-mother, Maude, is a man. \n Roberts’s resistance to the tropes of romantic fiction is underlined by the \nnovel’s conclusion: Frederico does not propose. Whelehan notes that ‘feminist fiction \ntakes its heroines out of marriage into singledom, [whereas] chick lit moves in the \nopposite direction’ (Feminist 4). While the chick lit heroine is desperate to marry, the \n 19 \nthrice-married Aurora finally escapes the romantic myth that ‘a woman’s greatest \nhappiness lies in love and marriage’ (Jones 198). Reader draws to a close with the \nlovers temporarily parting, rather than uniting, and ends with murder rather than \nmarriage: Aurora shoots Michael and confesses, ‘Reader, I murdered him’ (229). The \nfigure on the cover of the novel may be adorned with the trappings of hegemonic \nfemininity but, anticipating Roberts’s departure from the conventions of gender and \ngenre, she also holds a gun. \nBy the end of the novel, Aurora has learned to be wary of romance: ‘A \nwarning bell clanged in my memory. Hastily I promised myself that this time I would \nbe careful, at the beginning, not to become too romantic’ (224). As her attitude to \nromance changes so does her attitude to sex. In contrast to Bridget Jones, who seeks \ncommitment rather than casual sex, Aurora abandons her belief that ‘You were only \nsupposed to have sex if you were married’ (33). Further, while chick lit tends to be \ncoy about sex (Whelehan, Feminist 206), Roberts offers a candid representation of the \npleasures of the flesh. In her essay ‘Write, she said’, Roberts states that she wants to \ncounter the myth that romance is to women what pornography is to men by joining \nthe two genres (‘Write’ 233). Reader goes some way towards achieving this aim and, \nin doing so, challenges the ‘literary separatism’ that chick lit endorses (Whelehan, \nBJD 68). In contrast to Mills & Boon novels, in which orgasms are ‘always vaginal, \nalways single, simultaneous with the man’s and experienced in missionary position’ \n(Jones 210), Roberts offers a woman-centred representation of sex that counters the \nmyth of the vaginal orgasm and affirms female sexual pleasure: ‘He pulled off my \nknickers, slid his fingers in, found my clitoris, circled it’ (213). Reader, I Married \nHim may not be quite the ‘lesbian sado-masochistic romantic pornographic epic’ that \n 20 \nRoberts once said she wanted to write (‘Write’ 234), but it does transform chick lit \ninto what might be better termed ‘clit lit’. \nRoberts’s interest in romance reflects her socialist as well as her feminist \nsympathies. Aware from an early age that romance is regarded as ‘trivial and banal’ \n(‘Write’ 222), and that ‘trash’ is a term used to describe not only romance but also, \nimplicitly, its (overwhelmingly female) readership (FSG 15), Roberts learned to hide \nher shameful desire for romantic fiction, which she consumed in secret. As Karen \nWestman notes, historical romance is regarded as ‘bottom of the literary pit’ and \nHeyer as ‘Jane Austen “lite”’ (Westman 165-6). By claiming writers like Heyer and \nWollstonecraft as twin influences, Roberts situates herself in a specifically female \nliterary tradition and erodes the boundary between high and popular culture. The \nsuggestion that literary, mass-market and middlebrow romance explore similar \nconcerns exposes the arbitrary nature of literary value, confirming Pierre Bourdieu’s \ncontention that cultural capital (forms of knowledge that confer power and status) \nworks to reify class difference and legitimate the dominance of the ruling elite. By \nblending allusions to canonical and non-canonical texts, Roberts subverts the \ndistinctions that maintain class hegemony and that shape the literary marketplace. \nIn conclusion, like the anonymous aphorism ‘It begins when you sink in his \narms and ends with your arms in his sink’, Roberts demystifies romance, revealing \nthat it upholds patriarchy.  Yet, while she shows that romance is complicit with the \ndominant order, Roberts also illustrates that it gives unconscious expression to a \ntransgressive desire for the mother. By rewriting romance, Roberts brings the \nsubversive potential of the genre to the fore and subverts the social and literary \nhierarchies that affirm the value of canonical texts like Jane Eyre but dismiss the \npopular romances they inspire, and the women who read them. As her most recent \n 21 \nfiction demonstrates, it is only by revising romance (and the values of the literary \nmarket) that women can live - and read - happily ever after.  \n 22 \nWorks Cited \n \nBourdieu, Pierre. Distinction: A Social Critique of the Judgement of Taste (1979.  \n Cambridge, Mass.: Harvard University Press, 1984). \nChrisafis, Angelique. ‘Women’s writing leaves sex behind’, The Guardian, 10 June,  \n 2002, p. 5 \nClose, Ajay. ‘Feminist fun with a twist in the tale’,  The Sunday Herald, Seven Days  \n supplement, 9 January, 2005,  p. 30 \nDuPlessis, Rachel Blau. Writing Beyond the Ending: Narrative Strategies of  \nTwentieth-Century Women Writers (Bloomington: Indiana University Press, \n1985). \nFalcus, Sarah. ‘Truth and Lies, History and Fiction in Michèle Roberts’s The Looking  \n Glass’, Ecloga, Spring 2002  <http:\/\/www.strath.ac.uk\/ecloga\/Falcus.html> \nGordon, Lyndall. Charlotte Bronte: A Passionate Life (1994. London: Vintage, 1995). \nHanson, Clare. ‘Fiction, Feminism and Femininity from the Eighties to the Noughties’  \nin Contemporary British Women Writers, ed. Emma Parker (Cambridge: D.S \nBrewer, 2004), pp. 16-27 \nHughes, Helen. The Historical Romance (London: Routledge, 1993) \nJones, Ann Rosalind. ‘Mills & Boon Meets Feminism’ in The  \nProgress of Romance: The Politics of Popular Fiction, ed. Jean Radford \n(London: Routledge, 1986), pp. 195-218 \nKristeva, Julia. Revolution in Poetic Language. Trans. Margaret Walker (1974. New  \n York: Columbia University Press, 1984) \nNeill, Anna. ‘Civilization and the Rights of Woman: Liberty and Captivity in the  \n Work of Mary Wollstonecraft’, Women’s Writing 8:1 (2001): 99-117 \n 23 \nNewman, Jenny. ‘An Interview with Michèle Roberts’, Cercles (2003) \n <http:\/\/www.cercles.com\/interviews\/roberts.html> \nRadway, Janice A. Reading the Romance: Women, Patriarchy and Popular  \n Literature (1984. London: Verso, 1987) \nRoberts, Michèle. Fair Exchange (London: Little Brown, 1999) \n---. Food, Sex and God: On Inspiration and Writing (London: Virago, 1998) \n---. ‘Preface’. Madame Bovary. Trans. Geoffrey Wall (London: Penguin Classics,  \n 2003), pp. vii-x \n---. Reader, I Married Him (London: Little, Brown, 2004) \n---. The Looking Glass. 2000 (London: Virago, 2001) \n---. The Mistressclass. 2003 (London: Virago, 2004) \n---. ‘Write, she said’ in The Progress of Romance: The Politics of Popular  \nFiction, ed. Jean Radford (London: Routledge, 1986), pp. 221-235 \nThurston, Carol. The Romance Revolution: Erotic Novels for Women and the Quest  \n for a New Sexual Identity (Urbana: University of Illinois Press, 1987) \nWestman, Karen. ‘A Story of Her Weaving: The Self-Authoring Heroines of  \nGeorgette Heyer’s Regency Romance’ in Doubled Plots: Romance and \nHistory, ed. Susan Strehle and Mary Paniccia Carden (Jackson: University \nPress of Mississipppi, 2003), pp. 165-184 \nWhelehan, Imelda. Helen Fielding’s ‘Bridget Jones’s Diary’: A Reader’s Guide  \n (London: Continuum, 2002) \n---. The Feminist Bestseller: From Sex and the Single Girl to Sex and  \n the City (London: Palgrave, 2005) \nWhite, Rosie. ‘Permeable Borders, Possible Worlds: History and Identity in the  \n 24 \nNovels of Michèle Roberts’, Studies in Literary Imagination 36:2 (Fall 2003): \n71-90 \n \n"}