{"doi":"10.1016\/j.snb.2007.05.047","coreId":"139944","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5065","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5065","10.1016\/j.snb.2007.05.047"],"title":"Direct and converse magnetoelectic effect in laminate bonded Terfenol-D-PZT\ncomposites","authors":["Record, P. M.","Popov, C.","Fletcher, J.","Abraham, E.","Huang, Zhaorong","Chang, Harrison Hoon Seok","Whatmore, Roger W."],"enrichments":{"references":[],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2007-09-20T00:00:00Z","abstract":"Results from measurements of the direct and converse magnetoelectric (ME) effect\non a three-layer, epoxy-bonded, laminate composite are presented. The laminae\nare a single transversely polarized piezoelectric elements (PZ29) sandwiched\nbetween two longitudinal-magnetic ally polarized magnetostrictive TD elements\n(Terfenol-D-TX GMM). The direct ME effect was determined by measuring laminate\noutput with a Helmholtz-generated AC field (up to 7 Oe) in the range 50 Hz-100\nkHz biased by a DC field (0-1000 Oe). Peak voltage output occurred at the\nsample's mechanical resonant frequency, its value depending on the strength and\ndirection of the applied magnetic field. The peak output was 3061 mV at 3 Oe AC\nfield and 1000 Oe bias, equivalent to 74.4 V cm(-1) Oe(-1). The peak output\ncoefficient, however, was 93.6 V cm(-1) Oe(-1) at 0.1 Oe AC field and 1000 Oe DC\nbias. The reduction at higher drive amplitudes was attributed to increased\nYoung's modulus of the TD phase. Anomalous peaks in the low frequency spectrum\nof sample's output are explained. The converse magnetoelectric effect was\nmeasured by recording the voltage induced in a solenoid encompassing the ME\nwhile exposed to a DC bias field and the PZ phase driven by a 10 VAC source. The\npeak output is shown to depend on the strength of the applied DC magnetic field\nand developed a maximum field of 15.4 Oe at the sample's mechanical resonant\nfrequency. This equates to a converse magnetoelectric coefficient of 55 Oe cm kV\n(-1) (c) 2007 Elsevier B.V. All rights reserved","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139944.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.snb.2007.05.047","pdfHashValue":"09f18c0c8693289b30d670b26219b24cbbe24d39","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5065<\/identifier><datestamp>2012-02-15T14:21:37Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Direct and converse magnetoelectic effect in laminate bonded Terfenol-D-PZT\ncomposites<\/dc:title><dc:creator>Record, P. M.<\/dc:creator><dc:creator>Popov, C.<\/dc:creator><dc:creator>Fletcher, J.<\/dc:creator><dc:creator>Abraham, E.<\/dc:creator><dc:creator>Huang, Zhaorong<\/dc:creator><dc:creator>Chang, Harrison Hoon Seok<\/dc:creator><dc:creator>Whatmore, Roger W.<\/dc:creator><dc:subject>magnetoelectric effect magnetoelectric composites magnetostriction piezoelectricity MEMS alloys<\/dc:subject><dc:description>Results from measurements of the direct and converse magnetoelectric (ME) effect\non a three-layer, epoxy-bonded, laminate composite are presented. The laminae\nare a single transversely polarized piezoelectric elements (PZ29) sandwiched\nbetween two longitudinal-magnetic ally polarized magnetostrictive TD elements\n(Terfenol-D-TX GMM). The direct ME effect was determined by measuring laminate\noutput with a Helmholtz-generated AC field (up to 7 Oe) in the range 50 Hz-100\nkHz biased by a DC field (0-1000 Oe). Peak voltage output occurred at the\nsample's mechanical resonant frequency, its value depending on the strength and\ndirection of the applied magnetic field. The peak output was 3061 mV at 3 Oe AC\nfield and 1000 Oe bias, equivalent to 74.4 V cm(-1) Oe(-1). The peak output\ncoefficient, however, was 93.6 V cm(-1) Oe(-1) at 0.1 Oe AC field and 1000 Oe DC\nbias. The reduction at higher drive amplitudes was attributed to increased\nYoung's modulus of the TD phase. Anomalous peaks in the low frequency spectrum\nof sample's output are explained. The converse magnetoelectric effect was\nmeasured by recording the voltage induced in a solenoid encompassing the ME\nwhile exposed to a DC bias field and the PZ phase driven by a 10 VAC source. The\npeak output is shown to depend on the strength of the applied DC magnetic field\nand developed a maximum field of 15.4 Oe at the sample's mechanical resonant\nfrequency. This equates to a converse magnetoelectric coefficient of 55 Oe cm kV\n(-1) (c) 2007 Elsevier B.V. All rights reserved.<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-03-31T23:15:36Z<\/dc:date><dc:date>2011-03-31T23:15:36Z<\/dc:date><dc:date>2007-09-20T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Record P, Popov C, Fletcher J, Abraham E, Huang Z, Chang H, Whatmore RW, Direct and converse magnetoelectic effect in laminate bonded Terfenol-D-PZT composites, Sensors and Actuators B-Chemical, Volume 126, Issue 1, 2007, Pages 344-349.<\/dc:identifier><dc:identifier>0925-4005<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.snb.2007.05.047<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5065<\/dc:identifier><dc:language>en_UK<\/dc:language><dc:rights>NOTICE: this is the author’s version of a work that was accepted for publication in Sensors and Actuators B-Chemical. Changes resulting from the publishing process, such as peer review, editing, corrections, structural formatting, and other quality control mechanisms may not be reflected in this document. Changes may have been made to this work since it was submitted for publication. A definitive version was subsequently published in Sensors and Actuators B-Chemical,  Volume 126, Issue 1, 2007 DOI:10.1016\/j.snb.2007.05.047<\/dc:rights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0925-4005","issn:0925-4005"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["magnetoelectric effect magnetoelectric composites magnetostriction piezoelectricity MEMS alloys"],"subject":["Article"],"fullText":" 1 \nDirect and converse Magnetoelectic Effect  \nin Laminate Bonded Terfenol-D - PZT Composites  \nP Record; C Popov,  J Fletcher , E.Abraham;   \nHeriot-Watt University, School of EPS, Electronics Department, Edinburgh EH14 4AS \nZ. Huang, H. Chang,  R.W. Whatmore \nDepartment of Advanced Materials, SIMS, Cranfield University, Beds,  MK43 0AL,UK \n \n \nAbstract: Results from measurements of the direct and converse magnetoelectric \neffect on a three-layer, epoxy-bonded, laminate composite are presented. The laminae \nare a single transversely-polarised piezoelectric elements (PZ29) sandwiched between \ntwo longitudinal-magnetically polarised magnetostrictive TD elements (Terfenol-D – \nTX GMM).  The direct ME effect was determined by measuring laminate output with \na Helmholtz-generated AC field (of up to 7Oe) in the range 50 Hz – 100 kHz biased \nby a DC field (0 – 1000Oe). Peak voltage output occurred at the sample’s mechanical \nresonant frequency, its value otherwise depending on the strength and direction of the \napplied magnetic field. The peak output is 3061mV at 3 Oe AC field and 1000 Oe \nbias, equivalent to 74.4 V\/cm Oe was achieved.  The peak output coefficient, however \nwas 93.6V\/cm Oe at 0.1Oe AC field and 1000Oe DC bias.  The reduction at higher \ndrive amplitudes was attributed an increased Young’s modulus of TD phase. \nAnomalous peaks in the sample’s output, related to the proximity of the DC \nelectromagnet poles, are also investigated and explained. The converse \nmagnetoelectric effect was measured by recording the voltage induced in a solenoid \nencompassing the ME  and exposed to a DC bias field and the PZ phase driven by a 10 \nVAC source. A peak output is shown to depend on the strength of the applied DC \nmagnetic field and gave a maximum output voltage of 600 mV, representing 15.4 Oe  \nat the sample’s mechanical resonant frequency. This equates to a converse \nmagnetoelectric coefficient of 55 Oe cm\/ kV.   \n \n 2 \nKeywords: Magnetoelectric effect; Magnetoelectric Composites; Magnetostriction; Piezo-electricity; \nMEMS;  \n 3 \n \n \nIntroduction: The Magnetoelectric effect represents the coupling between an applied \nmagnetic field and a change in electric polarization in a solid. While the effect can \noccur in single phase materials, such as Cr2O3, it is usually small. Much larger effects \ncan be obtained in composites consisting of two functional phases – a magnetostrictive \nmaterial, in which a strain is produced by application of a magnetic field, coupled to a \npiezoelectric material, in which a change in electric polarization is produced by an \napplied stress. Reciprocally, an electric field applied to the piezoelectric phase of such \na composite will cause a change in the magnetization of the magnetostrictive phase – \ndescribed here as the Converse Magnetoelectric effect. The magnetoelectric effect is \ngenerally characterized by the Magnetoelectric Voltage Coefficient:  \nH\nE\nE   V Oe\n-1\n m\n-1\n \nLikewise, the inverse magnetoelectric effect, being the exact reversed process would \nbe characterized by an inverse coefficient:  \ndE\ndH\nM   Oe m V\n-1\n \nA variety of materials have been used to produce magnetoelectric composites; \ncomprehensively reviewed in the works of M. Fiebig \n1\n and of J. Ryu et al \n2\n.  These \nauthors conclude that the best magnetostrictive material in this case was Terfenol-D \nand the best piezoelectric material was PMN-PT. Reported magnetoelectric research in \nliterature on the latter is sparse, perhaps owing to the very high commercial price of \nthe PMN-PT. The most commonly used piezoelectric material in current research \n1 - 9\n \nis the lead zirconium titanate, PZT, having suitable characteristics for magnetoelectric \napplications. A variety of ferrites have been used as a magnetostrictive phase, \n 4 \ngenerating however a much smaller ME effects \n1, 2\n. The application of Permendur, an \niron\/cobalt\/vanadium alloy, as the magnetostrictive phase has been presented only by \nLaletsin et al \n1, 3\n with impressive results. Being known as the best magnetostrictive \nmaterial, the application of Terfenol-D in magnetoelectric composites has been \npreferred by many researchers \n1 - 9\n.   This material is brittle and prone to oxidation \nmaking manufacture of  specific shapes and thicknesses  difficult.,  however, reports \nfor methods of producing films of Terfenol-D by N. Cai et al \n4\n and W. Zhang et al \n10\n, \nmay provide a solution for these problems in the future.  \nMost research groups investigating the ME effect expose the sample to DC \nbias  with superimposed AC field magnetic fields\n1-7 \n.  An alternative method, \npresented by J Huang et al \n8\n and A Bayrashev et al \n9\n involves a low frequency \nvibration of a DC magnetic field source in close proximity to a magnetoelectric \nsample. The highest magnetoelectric voltage coefficient so far has been achieved by \nLaletsin et al \n3\n, reporting 90 V Oe\n-1\n cm\n-1\n, yielded by a tri-layered sample of \nPermendur\/ PZT\/ Permendur. To the authors’ knowledge, no experimental results on \nthe converse magnetoelectric effect have been reported. \n \nIn single phase materials the magnetoelectric effect is a material property, the \nmagnetoelectric effect in laminate composites, however, is regarded as a product \nproperty \n1, 2\n  The magnitude of this effect depends on factors, such as; magnetostrictive \nand piezoelectric phase composition, thickness ratio between the phases, pre-stress, \npoling direction, magnetic field strength and direction. A finite element analysis on the \nsensitivity of magnetoelectric composites in relation to geometric configuration and \nthickness of the phases, orientation of magnetization and polarization of \nmagnetostrictive and piezoelectric layers, has been presented by G. Liu et al \n5\n. The \nauthors conclude that the magnitude of the magnetoelectric voltage coefficient \n 5 \ndepends on the overall thickness and length of the sample and the thickness ratio of \nthe magnetostrictive and piezoelectric phases \n1 - 3, 5, 6\n. This is confirmed by a \ntheorectically analysis by one of our group \n12\n .  In addition, the highest \nmagnetoelectric output is achieved when the magnetic field is being applied in the \nsame direction as the polarisation of the piezoelectric phase.  This was  confirmed  by \nS. Dong et al \n6\n with a similar composite design. By using finite element modelling of a \nbi-layer Terfenol-D\/PZT composite X Liu et al \n7\n demonstrated there was a phase \nthickness ratio and frequency dependence of the magnitude of the magnetoelectric \noutput. The resonant magnetoelectric effect, attributed to the electro-mechanical \nresonance of the sample \n1-3\n , has been reported to generate the largest magnetoelectric \nresponse. \nThe advantages of the magnetoelectric composites over single phase materials \nand the possible practical applications of the magnetoelectric effect are widely \ndiscussed \n1 – 9\n. In the current state of research however major advances in material \nprocessing  need to occur before miniaturization of the samples can be used for \nMEMS  applications. \n \nMaterials and Sample preparation: Tri-layer laminated composites of Terfenol-D\/ \nPZT\/ Terfenol-D and PZT \/TD\/ PZT were prepared by epoxy bonding using \ncommercially purchased poled PZT (PZ29) and magnetised Terfenol-D (TX GMM) \nwafers. Meso-scale magneto-electric samples, with total thickness of 1.262 mm were \nfabricated by polishing down the Terfenol-D and the PZT elements and then cutting \nthe laminated composites. They were bonded by epoxy, ( EPOTEK301-2) at 85 deg. C \nfor 150 minutes. The results presented here are for a tri-layered, transversely-polarised \npiezoelectric element (PZ29) sandwiched between two longitudinal magnetically \n 6 \npolarised magnetostrictive elements (TX GMM) with dimensions L=15mm\/ \nT=1.262mm\/ W=2.5mm. The PZT thickness was measured to be 0.137 mm, with two \nequally thick plates of Terfenol-D (0.560 mm), with the PZT occupying 12.25%  of  \nthe overall sample. Prior to testing, the resonant frequency of the sample was \nmeasured, using a circuit shown in figure 1, left insert. Figure 1, right inset, displays \nthe electromechanical resonance of one sample with 1.5Vac test voltage. Prior to \nmagnetoelectric testing, the sample was suspended between two electrodes, each \nattached by means of conductive epoxy to the centres of the two outer plates of the test \nspecimen, figure 3b. This type of mounting allows physical restrictions on the sample \nto be reduced to a minimum, which compared to stiffer sample holders increases the \nvoltage output some 30%.  \n \nEquipment and experimental set-up: The installation for measuring the direct \nmagnetoelectric effect is shown schematically, in figure 3a.  This consists of an \nelectro-magnet providing DC magnetic field in a 0 – 1000 Oested range, a pair of \nHelmholtz coils powered by a linear power amplifier, providing AC magnetic field in \na 0 – 7 Oested range and recording equipment over the frequency of 0 -100kHz. The \nHelmholtz coil pair field output was calibrated both in AC and DC mode, by direct \nmeasurements with a Linear Output Hall Effect Transducer (LOHET SS94A2D) Hall \nEffect probe. These measurements  were compared to theoretically calculated values, \nusing equation derived from the Biot-Savart law where the flux density, given  by \n125.\n108 7\ncR\nNI\nB  , where   \nN is the number of turns; I is the current; and Rc is the coils radius. A Hirst Fluxmaster \nFM70 with Radcliffe Magtronics Ltd Hall Effect probe and the LOHET probe were \n 7 \nused to measure the DC and AC magnetic fields respectively. Early reports of \ncomposite ME below resonance reported a peak at around 200Hz this was found to \nbeen artefact generated by the proximity of the iron pole pieces of the electro-magnet \nto the Helmhotz coil pair, figure 4. \n  \nFor all magnetoelectric experiments presented here, the electromagnet poles \nand the coils were arranged in such a way, so that the AC and DC magnetic fields are \nparallel in direction , figure 3a. The tested composite, mounted on a holder as shown \non figure 03b, was positioned centrally between the DC electromagnet poles on the \nHelmholtz coils axis, so that the fields direction were transverse to the poling direction \nof the PZT and parallel to the Terfenol-D magnetisation direction. The \nmagnetoelectric sample was exposed to DC magnetic field strengths in a 50 – 1000 \nOested range and AC magnetic field strengths in a 1 – 5 Oested range, in various \ncombinations.  At high AC fields the inductance of the Helmholtz pair generates a \nprohibitively large voltage at frequencies > 10kHz so for frequencies above 10kHz  \nthe inductance was tuned out by  series variable capacitance. The total capacitance \nrequired to put the coils in resonance was calculated from inductance and resistance \nmeasured  with Fluke RCL Bridge PM6306. For frequencies below 10kHz the \nHelmholtz coil pair was driven directly.  \nThe tests for the converse magnetoelectric effect were conducted  by directly \ndriving the sample piezoelectric phase by a signal generator and measuring the voltage \ninduced in a solenoid which encompassed the sample. The solenoid was long enough \nto neglect the end effects.   The flux was then estimated from the induced voltage.  \n \n 8 \nResults and Discussion: During the calibration of Helmholtz coils, a possibility was \nconsidered that by positioning the coils in close proximity to the DC electromagnet \npoles would  influence the results of the ME tests. Indeed, the results, shown in figure  \n4 demonstrate that the size and proximity of the poles affect the inductance of the \ncoils, especially at low frequencies, the inductance peak however, as expected, was  \nnot related to the DC magnetic field strength applied by the electromagnet. A peak of \nthe same bandwidth was discovered during initial magnetoelectric testing, figure 5, its \nexistence and size depending on the DC poles separation, misleadingly suggesting a \npeak of magnetoelectric activity at low frequencies. This may be a source for possible \nerror in publications claiming that a magnetoelectric output peak occurs in the 50 – \n400 Hz region. A distance between the poles of 6 cm reduced the artefact to a \nnegligible amount and was adhered to for all subsequent experiments.  \nThe shift in capacitance shown in figure 2 can be explained by accounting the \nchange in stress induced by the DC magnetic field applied to the sample. Similar \nfrequency shifting effect was observed during direct and converse magnetoelectric \ntests figure6,7.  The non-monotonic change in resonant suggests that stress is first \nrelieved at low fields but increases at high fields. \nThe results for the lower frequency range, figure 05 - blue line, show that the \nvoltage output of the sample is low and flat throughout this range. Similar results, with \nvariation of only by 5 – 10 mV were obtained for all combinations of DC\/AC \nmagnetic fields experiments. The red line on the same chart represents the dependency \nof the results in this range to the proximity of the Helmholtz coils to the DC poles that \nwas already discussed in the paragraph above. The results from the upper frequency \nrange, figure 7,  show that the highest voltage output always occurs at, or close to the \nsample’s mechanical resonance frequency, its value otherwise depending on the \n 9 \nstrength and direction of the applied magnetic fields. Although not thoroughly tested, \nit was established that when the sample was positioned in such a way that The PZT \npoling direction was parallel to the magnetic fields direction, the magnetoelectric \nvoltage output was reduced with some 60%. This result seems to be in agreement with \nthe findings of other researchers \n1, 3\n. For the sample presented, the highest output was \nachieved with 1000 Oested DC magnetic field, with an increase of the AC magnetic \nfield amplitude, proportionally increasing the sample output, figure 8. The highest \nvoltage output recorded was 3051mV, corresponding to Magnetoelectric Voltage \nCoefficient value of 74.4 V cm\n-1\n Oe\n-1\n,  demonstrating its capability for  a micro-power \nsource.   The maximum ME coefficient, of 94 V cm\n-1\n Oe\n-1\n  occurred, however, at a \nlower drive field of  0.05Oe,  figure 8. \n \nThe results from the converse magnetoelectric tests, figure7 also confirm that \nthe highest magnetoelectric activity occurs at the sample’s resonance frequency and its \nsize is dependant of the strength of the applied DC magnetic field.  \n \nDevices results \nOne of the drivers for these studies was providing power remote to small electronic \ndevices.  It was thought that conventional inductive powering of  RFID tags and \nMEMS could be achieved by a magneto-electric elements.  The target power for a \nUHF transponding tag was estimated to be 50μW.  To this end a tri-layar sample \nconsisting of PZ, TD,PZ, similar to that described above, was placed in throat of a 5 \ncm diameter Helmhotz coil pair.  The DC magnetic field bias was provide by an \nelectro-magnet allowing field of up 1000Oe to be applied..  The output from the PZ \nelement was coupled to Schottky diode bridge via an inductor, figure9a,b .  The \n 10 \ninductor was adjusted to match the reactance of the PZ element capacitance.  For a 1 \nOe AC field and open circuit voltage of 28 V and a short circuit current of 60uA was \nproduced. At a load voltage of 3V approximately 110uW of power was developed for \n1 Oe AC drive.  For maximum power transfer the device was operated in \nelectromechanical resonance.  It will be noted that even at ½ AC field drive  the target \npower still was met.   The second driver for this work was a low field sensor and in \nparticular to allow near field communication in which device demonstrating the \nConverse ME effect would be the transmitter and the direct ME effect would be the \nreceiver.  The sensitivity of the latter is shown in figure 10, where field  as low as 1nT \nare readily detected.  Interestingly, in most countries of the world local time is sent \nencoded on low frequency RF bands span 10 – 80kHz.  The estimated flux denisty at \n200km distant from a 15kW transmitter operating at 60kHz was 158nG so these \ndevices could readily detect this signal. \n \n \nConclusions: The direct and inverse magnetoelectric effect of a tri-layer Terfenol-D\/ \nPZT\/ Terfenol-D magnetoelectric composite sample has been investigated, achieving \nresults of 94 V cm\n-1\n Oe\n-1\n for the and 55 Oe cm kV\n-1 \nfor the direct and converse \nmagnetoelectric voltage coefficients respectively. It was observed that the voltage \noutput in both cases occurs at the sample’s electro-mechanical frequency point. \nAnomalous peaks at low frequencies were detected and explained. The sample’s \ncapabilities to be used as a micro-power source were demonstrated in a simple device \nprototype, achieving 110 uW of rectified power. The results from the converse \nmagnetoelectric tests demonstrate that magnetoelectric composite samples can be used \n 11 \nin MEMS applications, not only as power generator source, but also a transducer for \nhalf-duplex communication. \n  \n \nRefferences:  \n1. ; J. Ryu et al.  Magnetoelectric Effect in Composites of Magnetostrictive and Piezoelectric Materials; \nJournal of Electroceramics, 8,  (2002) 107–119 \n \n2. ; Manfred Fiebig.  Revival of the magnetoelectric effect; J. Phys. D: Appl. Phys. 38 (2005) 123–152 \n \n3. U. Laletsin et al. Frequency dependence of magnetoelectric interactions in layered  structures of \nferromagnetic alloys and piezoelectric oxides; Appl. Phys. A 78, (2004) 33–36 \n \n4. Ning Cai et al. The magnetoelectric properties of lead zirconate titanate\/terfenol-D\/ PVDF laminate \ncomposites;;Materials Science and Engineering B 99 (2003) 211-213 \n \n5. Gang Liu et al. Calculations of giant magnetoelectric effect in multiferroic composites of rare-earth-\niron alloys and PZT by finite element method; International Journal of Solids and Structures 41 (2004) \n4423–4434 \n \n6. Shuxiang Dong. Longitudinal and Transverse Magnetoelectric Voltage Coefficients of \nMagnetostrictive\/Piezoelectric Laminate Composite: Theory; IEEE Transactions on Ultrasonics, \nFerroelectrics, and Frequency Control, Vol. 50. No. 10, 2003 \n \n7. Y.X. Liu et al. Numerical modeling of magnetoelectric effect in a novel composite structure; \nCeramics International 30 (2004) 1999–2003 \n \n8.  J. Huang et al.  New, high-sensitivity, hybrid magnetostrictive\/electroactive magnetic field sensors;; \nProceedings of SPIE Vol. 5050 (2003) \n \n \n9. Andrey Bayrashev et al. Low frequency wireless powering of microsystems using piezoelectric–\nmagnetostrictive laminate composites;; Sensors and Actuators A 114 (2004) 244–249 \n \n10. Wenxu Zhang et al. Preparation and characterization of thick magnetostrictive films;; Journal of \nMagnetism and Magnetic Materials 261 (2003) 118–121 \n \n11\n \nM.I. Bichurin and V.M. Petrov. Theory of low frequency magnetoelectric coupling in \nmagnetostrictve-piezoelectric bilayers, Phys. Rew. B: 1 Aug. 2003 \n \n12  Z. Huang.  “Magnetization by Electric Field Through Product Property: Theoretical Modelling”, \nsubmitted to J. Appl. Physics, 4 April 2006. \n \n \n \n \n 12 \n \nFigure 1 test circuit and corresponding response showing electromechanical resonance \n \n \n \n \n \n \n \nResonance Frequency of TD_PZT_TD Meso-\nScale Sample\n5\n10\n15\n20\n25\n30\n20 30 40 50 60 70 80 90 100 110 120 130 140 150\nFrequency [kHz]\nVoltage [mV]\n \nCapacitance of Meso Scale Sample 01 at Various DC \nMagnetic Fields \n3\n4\n5\n6\n7\n8\n9\n10\n70 72.5 75 77.5 80 82.5 85 87.5 90 92.5 95 97.5 100\nFrequency [kHz]\nCapacitance \n[nF]\nDC=0 G DC=75 G DC=300 G\nDC=500 G DC=750 G DC=1000 G  \nFigure 02 PZ phase capacitance change  with varying bias fields \n 13 \n \nFigure 3a :  Schematic for the test facility to measure sample ME response \n \nFigure 3b sample holder \n \n \n \n \n \n \n \n \n 14 \n \n \n \n \n \n \n \n \n \n \n \nEffect of poles on Htz coils inductance\n2.225\n2.475\n2.725\n2.975\n0 200 400 600 800 1000 1200 1400 1600 1800 2000\nFrequency [Hz]\nInductance [mH]\nCoils Inductance Small poles d=4cm Large poles d=4cm Small poles d=5cm\nLarge poles d=5cm Small poles d=6cm Large poles d=6cm Small poles d=7cm\nLarge poles d=7cm Small poles d=8cm Large poles d=8cm\n \nFigure04  \n \nFigure 5  \n 15 \nMeso Scale Sample Voltage Response at 3 Oe AC \nMagnetic Field  (longitudal)\n0\n500\n1000\n1500\n2000\n2500\n3000\n3500\n70 72.5 75 77.5 80 82.5 85 87.5 90 92.5 95 97.5 100\nFrequency [kHz]\nVoltage \n[mV]\nDC=0 Oe DC=75 G DC=300 Oe\nDC=500 Oe DC=750 Oe DC=1000 G\n \nFigure 6 Magnetoelectric output for a 3 Oe drive field with difference DC bias field. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 16 \nReversed Magnetoelectric Effect of Meso Scale \nSample 01 at 3500 mV Wave input \n0\n10\n20\n70 72.5 75 77.5 80 82.5 85 87.5 90 92.5 95 97.5 100\nFrequency [kHz]\nField \nstrength \n(Oe)\nDC=0 Oe DC=300 Oe\nDC=500 Oe DC=750 Oe\n \nFigure 7 Converse ME measurements  the for bias fields 0 – 750Oe .  For the sample \nPZ thickness of 127um gives a converse coeff of 55 Oe cm\/KV \n \n \n \nPeak MEV Coefficients of MEC Sample at Various AC Magnetic \nFields\n0\n5\n10\n15\n20\n25\n30\n35\n40\n45\n50\n55\n60\n65\n70\n75\n80\n85\n90\n95\n100\n0 100 200 300 400 500 600 700 800 900 1000\nDC Magnetic Field [Oe]\nMEVC \n[V cm\n-1\n Oe\n-1\n]\nAC=0.05 G AC=0.1 G AC=0.5 G\nAC=1.5 G AC=3 G\n \nFigure 8  Peak ME coefficients vs DC bias field for different AC drive fields \n 17 \n \nFigure 9a ME micro-power generator, Inductance L1 tunes out the capacitance of the \nPZ phase. \n \nRectified Power Output at Various DC Magnetic Fields from TD-PZT-TD \nSample With Dimensions W=25; T=1.262; L=9 mm\n0.00E+00\n1.00E-05\n2.00E-05\n3.00E-05\n4.00E-05\n5.00E-05\n6.00E-05\n7.00E-05\n8.00E-05\n9.00E-05\n1.00E-04\n1.10E-04\n1.20E-04\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\nAC Magnetic Field [G]\nDC Power Output [W]\nHdc=0 G Hdc=75 G Hdc=300 G\nHdc=500 G Hdc=750 G Hdc=1000 G\n \nFigure 9b output power in watts for Trialayer sample resonated at 125kHz \n 18 \nOutput Voltage at 500Oe DC\n0\n5\n10\n15\n20\n25\n30\n35\n40\n40000 40500 41000 41500 42000 42500 43000 43500 44000 44500\nFrequency (Hz)\nO\nu\ntp\nu\nt \nV\no\nlt\na\ng\ne\n (\nu\nV\n)\n1nT\n3nT\n \nFigure10 – ME sample output vs frequency for  2 applied ac fields at 500 Oe bias \nfield.  This sample had a resonant frequency of 41.5kHz and consisted of a trilayer \narranged :PZ TD PZ \n"}