{"doi":"10.1016\/j.snb.2008.06.038","coreId":"138606","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3155","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3155","10.1016\/j.snb.2008.06.038"],"title":"Table olives volatile fingerprints: Potential of an electronic nose for quality discrimination.","authors":["Panagou, Efstathios Z.","Sahgal, Natasha","Magan, Naresh","Nychas, George-John E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-09-25","abstract":"In the present work, the potential of an electronic nose to differentiate the quality of fermented green table olives based on their volatile profile was investigated. An electronic gas sensor array system comprising a hybrid sensor array of 12 metal oxide and 10 metal ion-based sensors was used to generate a chemical fingerprint (pattern) of the volatile compounds present in olives. Multivariate statistical analysis and artificial neural networks were applied to the generated patterns to achieve various classification tasks. Green olives were initially classified into three major classes (acceptable, unacceptable, marginal) based on a sensory panel. Multivariate statistical approach showed good discrimination between the class of unacceptable samples and the classes of acceptable and marginal samples. However, in the latter two classes there was a certain area of overlapping in which no clear differentiation could be made. The potential to discriminate green olives in the three selected classes was also evaluated using a multilayer perceptron (MLP) neural network as a classifier with an 18–15–8–3 structure. Results showed good performance of the developed network as only two samples were misclassified in a 66-sample training dataset population, whereas only one case was misclassified in a 12-sample test dataset population. The results of this study provide promising perspectives for the use of a low-cost and rapid system for quality differentiation of fermented green olives based on their volatile profile","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138606.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.snb.2008.06.038","pdfHashValue":"c2c4d26bae00d35b6a9260c56a7526ef3863fb79","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3155<\/identifier><datestamp>2014-02-18T13:39:15Z<\/datestamp><setSpec>hdl_1826_2005<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Table olives volatile fingerprints: Potential of an electronic nose for quality discrimination.<\/dc:title><dc:creator>Panagou, Efstathios Z.<\/dc:creator><dc:creator>Sahgal, Natasha<\/dc:creator><dc:creator>Magan, Naresh<\/dc:creator><dc:creator>Nychas, George-John E.<\/dc:creator><dc:subject>Table olives<\/dc:subject><dc:subject>Sensors<\/dc:subject><dc:subject>Quality<\/dc:subject><dc:subject>Electronic nose<\/dc:subject><dc:subject>Volatile fingerprints<\/dc:subject><dc:subject>Neural networks<\/dc:subject><dc:description>In the present work, the potential of an electronic nose to differentiate the quality of fermented green table olives based on their volatile profile was investigated. An electronic gas sensor array system comprising a hybrid sensor array of 12 metal oxide and 10 metal ion-based sensors was used to generate a chemical fingerprint (pattern) of the volatile compounds present in olives. Multivariate statistical analysis and artificial neural networks were applied to the generated patterns to achieve various classification tasks. Green olives were initially classified into three major classes (acceptable, unacceptable, marginal) based on a sensory panel. Multivariate statistical approach showed good discrimination between the class of unacceptable samples and the classes of acceptable and marginal samples. However, in the latter two classes there was a certain area of overlapping in which no clear differentiation could be made. The potential to discriminate green olives in the three selected classes was also evaluated using a multilayer perceptron (MLP) neural network as a classifier with an 18–15–8–3 structure. Results showed good performance of the developed network as only two samples were misclassified in a 66-sample training dataset population, whereas only one case was misclassified in a 12-sample test dataset population. The results of this study provide promising perspectives for the use of a low-cost and rapid system for quality differentiation of fermented green olives based on their volatile profile.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2009-02-10T15:14:42Z<\/dc:date><dc:date>2009-02-10T15:14:42Z<\/dc:date><dc:date>2008-09-25<\/dc:date><dc:type>Postprint<\/dc:type><dc:identifier>E.Z. Panagou, N. Sahgal, N. Magan, G.-J.E. Nychas, Table olives volatile fingerprints: Potential of an electronic nose for quality discrimination, Sensors and Actuators B: Chemical, Volume 134, Issue 2, 25 September 2008, Pages 902-907<\/dc:identifier><dc:identifier>0925-4005<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.snb.2008.06.038<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/3155<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0925-4005","issn:0925-4005"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":["Table olives","Sensors","Quality","Electronic nose","Volatile fingerprints","Neural networks"],"subject":["Postprint"],"fullText":"1Sensors and Actuators B: Chemical, Volume 134, Issue 2, 25 September 2008, Pages 902-9071\n2\nTable olives volatile fingerprints: Potential of an electronic nose for quality discrimination3\n4\nE.Z. Panagoua,*, N. Sahgalb, N. Maganb, G.-J.E. Nychasa5\n6\na Agricultural University of Athens, Department of Food Science and Technology, Laboratory of7\nMicrobiology and Biotechnology of Foods, Iera Odos 75, Athens, Greece, GR-118 558\nb Applied Mycology Group, Cranfield Health, Cranfield University, Bedford, MK43 0AL, UK9\n10\nCorresponding author. Tel.\/Fax.: +30 210 5294693. E-mail address: stathispanagou@aua.gr11\n2Abstract1\nIn the present work, the potential of an electronic nose to differentiate the quality of fermented green2\ntable olives based on their volatile profile was investigated. An electronic gas sensor array system3\ncomprising of a hybrid sensor array of 12 metal oxide and 10 metal ion based sensors were used to4\ngenerate a chemical fingerprint (pattern) of the volatile compounds present in olives. Multivariate5\nstatistical analysis and artificial neural networks were applied to the generated patterns to achieve various6\nclassification tasks. Green olives were initially classified into three major classes (acceptable,7\nunacceptable, marginal) based on a sensory panel. Multivariate statistical approach showed good8\ndiscrimination between the class of unacceptable samples and the classes of acceptable and marginal9\nsamples. However, in the latter two classes there was a certain area of overlapping in which no clear10\ndifferentiation could be made. The potential to discriminate green olives in the three selected classes was11\nalso evaluated using a multilayer perceptron (MLP) neural network as a classifier with a 18-15-8-312\nstructure. Results showed good performance of the developed network as only two samples were13\nmisclassified in a 66-sample training dataset population, whereas only one case was misclassified in a 12-14\nsample test dataset population. The results of this study provide promising perspectives for the use of a15\nlow-cost and rapid system for quality differentiation of fermented green olives based on their volatile16\nprofile.17\n18\nKeywords: Table olives; Sensors; Quality; Electronic nose; Volatile fingerprints; Machine learning;19\nNeural networks20\n31. Introduction1\nOdour is a major olfactory parameter determining the sensory quality of food products and it2\nis therefore of interest to investigate if volatile compounds contributing to the characteristic3\nodours can be measured as indicators of quality assessment. This is also important for green table4\nolives, one of the most popular fermented vegetables in the Western world. The production of5\nvolatile compounds tends to be the first mechanism for the development of flavour specific to a6\nparticular fermented food. Lowering the pH in lactic acid fermentation may reduce the enzymatic7\nactivity in olive tissue that generate either flavour components or flavour precursor compounds.8\nAdditionally, the microorganisms during the course of fermentation may directly metabolise9\nprecursor flavour compounds of flavour components producing a plethora of volatile compounds10\n(esters, acids, alcohols, aldehydes, ketones, phenols, etc.) that characterise the process [1].11\nGenerally, sensory analysis based on a trained expert panel is necessary for table olive12\nclassification and quality control but it is not always feasible due to high cost, while it is time-13\nconsuming and often without any objective value. In the last decades many efforts have been14\nmade to study the aromatic fraction of fermented olives based mainly on chromatographic15\ndeterminations [2-9]. However, these analytical techniques are also time-consuming and require16\nsophisticated equipment and skilled personnel. It would be therefore of great interest to17\ninvestigate the potential of low-cost, rapid and non-destructive analytical procedure, such as the18\nelectronic nose, to quantify the overall quality of table olives.19\nIn the last decade the electronic nose technology has offered the possibility to exploit, from a20\npractical point of view, the information contained in the headspace in many different application21\nareas. The use of the electronic nose for quality evaluation as a means of non-destructive22\nolfactory sensing is becoming widespread as it has the advantage of low cost, good reliability and23\n4high portability for in situ and on-line measurements [10,11]. Moreover, this technique has been1\nshown to be rapid and simple compared with GC-MS [12-14]. The underlying hypothesis in2\nelectronic nose sensing for food safety\/quality assessment is that the interaction of microbial3\nassociation with the food system affects the type as well as the rate of metabolites produced4\neither in the form of gas, solid or liquid. Sensing the gaseous metabolites (mainly volatile organic5\ncompounds) present in the headspace of a food commodity could provide useful information for6\nthe determination of the quality of a given food product [15]. The interaction of volatiles on the7\nsensing element causes changes in electrical resistance of the sensor, and since sensor kinetics is8\ndifferent, the data produced are converted into an odour fingerprint which can be interpreted with9\nthe use of appropriate mathematical techniques, like multivariate statistical methods or artificial10\nneural networks (ANNs). The obtained data are comparable in the sense that different samples11\nmay be characterised and discriminated based on their volatile production patterns [16,17]. In the12\nliterature there are several reports that demonstrate the potential of electronic nose in food-13\nrelevant applications for the classification of vegetable oils [18], quality control of olive oil14\naroma [19], characterisation of wines [20,21], determination of fish freshness [22], quality15\nestimation of ground meat [23], grain quality evaluation [15,24-26], detection of microorganisms16\n[27-30], detection of boar taint in meat [31], shelf life determination of tomato [32], and quality17\nassessment of modified atmosphere packaged poultry meat [33]. However, the application of an18\nelectronic nose for quality discrimination of fermented table olives is reported here for the first19\ntime.20\nAn artificial neural network (ANN) can be referred to as a neurocomputer with parallel21\ndistributed processors [34]. ANNs have been employed in recent years as an alternative to22\nconventional regression models, due to their ability to describe highly complex and non-linear23\n5problems in many fields of science. The most common neural network approach is multilayer1\nperceptrons (MLPs) [35]. The basic idea behind ANNs lies in the direct exploration of the2\nknowledge contained in the input-output patterns by adjusting the parameters of the non-linear3\nnetwork topology, as the input-output patterns are repeatedly presented to the network [34].4\nWhen the system is supervised using an appropriate training dataset it can then be used to predict5\nor classify different patterns not initially introduced to the network.6\nThe objective of this study was to evaluate the performance of an electronic nose system to7\ndifferentiate the quality of fermented green table olives based on their volatile fingerprints and8\nclassify them in three major classes (acceptable, marginal, unacceptable). Classification of the9\nsamples was based on both multivariate data analysis and artificial neural networks (ANNs)10\nalgorithms.11\n12\n2. Materials and methods13\na. Table olive samples14\nTwenty six samples of fermented green olives were obtained from a central hyper-market in15\nAthens. The amount of each sample was ca. 0.5 kg. The volatile profile was each sample was16\nassessed by a sensory panel and classified into three major groups, namely unacceptable (n = 3),17\nacceptable (n = 16), and marginal (n = 7). As there was no previous information on the18\napplication of an electronic nose for table olive quality assessment based on their volatile profiles,19\na bottom-up approach was followed to create a knowledge basis for the product. Initially, the20\npotential of electronic nose to discriminate between unacceptable and a typical acceptable21\n(reference) sample was investigated. Furthermore, the analysis was extended taking into account22\nthe unacceptable and marginal samples together with the reference sample. In the final step, all23\n6groups of samples were taken together and their volatile profile was recorded and subjected to1\nmultivariate analysis.2\n3\nb. Electronic nose data acquisition and analysis4\nElectronic nose analysis was performed with a NST 3320 Lab Emission Analyser (Applied5\nSensors, Linköping, Sweden), equipped with a built-in headspace autosampler for 12 samples, a6\ndetector unit containing 23 different sensors and a built-in software package (NST Senstool) for7\ncollecting and processing data from the sensors. The instrument was equipped with 12 MOS8\n(metal oxide semiconductor) sensors operating at 250-400°C, 10 MOSFET (metal oxide9\nsemiconductor field effect transistor) sensors operating at 140-170°C, and a humidity sensor for10\nthe determination of relative humidity at 70°C. The electronic nose operating system employed in11\nthis study has been described in detail elsewhere [33].12\nOlive samples of 2 g were weighed and placed in 25 ml glass vials, sealed with septa and13\nscrew caps, and incubated at 37°C for 1 h for headspace equilibration above the sample. Samples14\nwere then randomly placed in the autosampler and headspace gas was pumped over the sensors of15\nthe electronic nose. The total cycle time per sample was 4 min and 20 s. The baseline phase was16\nset to 30 s, the sample phase to 30 s and the recovery phase of the sensors to 240 s including the17\nflush time of the gas lines . Every sample was analysed in triplicate.18\n19\nc. Data analysis20\nThe data collected were analysed using the XLStat software (version 2006.06, Addinsoft,21\nParis, France), a built-in statistical software package of Excel. Data exploration and interpretation22\nwas based on multivariate analytical techniques such as principal components analysis (PCA),23\n7hierarchical cluster analysis (HCA), and discriminant function analysis (DFA) on the obtained1\nsensor responses. Prior to analysis the raw sensor responses were normalised using the following2\nequation:3\nmin\nmax min\ni\nnorm\nX X\nX\nX X\n\n\n(1)4\nwhere, Xi and Xnorm are the raw and normalized response of a sensor i, and Xmin, Xmax are the5\nminimum and maximum sensor responses of the i sensor, respectively.6\nPredictive learning (classification) was performed on the whole dataset (n = 78) of7\nunacceptable, acceptable and marginal samples using artificial neural network (ANN) techniques.8\nThe type chosen in this study was a multilayer perceptron (MLP) based on back propagation. In9\nthese networks each node receives signals through connections with other nodes or the outside10\nworld in the case of the input layer. The net input to node j has the form:11\n\n\n\nn\ni\njiijj xwI\n1\n (2)12\nwhere xi are the inputs (sensor responses in our case), wij are connection weights associated with13\neach input\/node and θj is the bias associated with node j. The output from each node is used as an14\ninput in a nonlinear transfer function:15\n jj IfO  (3)16\nIn our work the sigmoidal function was selected as a transfer function in both hidden and output17\nneurons. The standard backpropagation algorithm for network training is based on the steepest-18\ndescent gradient approach applied to the minimization of the error function defined as:19\n \n2\n1\n1 n\ni i\ni\nMSE t d\nn \n  (4)20\n8where ti represents the desired network output, di is the actual network output, and n is the1\nnumber of samples. The difference between the desired value and the actual network output was2\npropagated back through the network to the input level. This training process, known as delta rule,3\nis based on the minimization of the error by adjusting the weights given by the following4\nequation:5\n         1kj kj k j kjw n w n e n x n w n      (5)6\nwhere wkj(n) is the weight adjustment at time n, ek is the negative derivative of the total square7\nerror with respect to the neuron’s output, xj is the element of the input vector, η is the learning8\nrate parameter, and α the momentum term. In order to train and test the developed neural network,9\nthe entire database (78 samples) was divided into training (66 samples) and test (12 samples)10\ndataset. To avoid any bias in database partitioning, table olive samples were allocated into each11\ncategory using a method based on random number generation. The strategy employed for the12\nclassification of olives is the so-called one-of-many encoding [36]. The output of the network is13\na multidimensional vector with the number of the dimensions equal to the number of the classes14\nof table olives to be determined, and each vectorial dimension is assigned to a class. In the15\ntraining file, the class membership of a single data is coded in a numerical format by assigning 116\nto the belonging class and 0 to all others, i.e., acceptable olives are coded as (1,0,0), marginal17\nsamples as (0,1,0), and unacceptable as (0,0,1). In the test file, the membership of an input data is18\nassigned to the class with greatest net output. The prediction performance of the network was19\ndefined as the ratio of number of correctly identified patterns to that of total patterns introduced20\nto the network. The MLP network was developed using NeuralWorks Professional II\/PLUS21\nversion 5.50 (NeuralWare, Carnegie, PA).22\n23\n93. Results1\nAnalyses were initially conducted with all samples of unacceptable olives together with the2\nreference sample and the headspace of three replicates per treatment was examined using metal3\noxide\/ion-based sensor arrays for discrimination. Replication of the sensor array was firstly4\nexamined and was found to be very consistent (Figure 1), indicating clear differences in volatile5\nfingerprints between unacceptable and reference samples. The variation between replicates was6\nrelatively small and consistent. The potential for discrimination was better in the MOS sensors7\nrather than the MOSFET sensors. Four of the sensors (MOSFET 104B, 105B, MOS 115, 116) of8\nthe electronic nose were excluded due to limited or very high response, when subjected to the9\nvolatile compounds of green olives. In addition, the responses of the humidity sensor were10\nexcluded as they did not show any clear differences among the samples.11\nFigure 2 depicts a PCA scores plot of the separation between the samples. This shows that12\nPC1 and PC2 accounted for almost 91.6% of the variance and resulted in a clear discrimination13\nbetween the volatile patterns of unacceptable samples compared to the reference sample. Cluster14\nanalysis, using Euclidean distance and Ward’s linkage measure, on the same dataset, using just15\nthe first two principal components, also produced a similar result (Figure 3). Two major groups16\ncan be visualised with reference samples (A) being separate from unacceptable ones (HN, PL,17\nAV).18\nFigure 4 shows a PCA scores plot of the separation between unacceptable, marginal and the19\nreference sample. About 97.4% of the total variance of the data was explained by PCA in which20\nPC1 and PC2 accounted for 87.1% and 10.3%, respectively. Although a clear differentiation was21\nevident between the reference sample and the unacceptable and marginal samples as a whole, no22\nclear separation could be obtained between the latter two groups. However, after analysing the23\n10\nsame dataset with DFA each group was clearly distinguishable (Figure 5). The two discriminant1\nfunctions accounted for 99.7% of the variance, indicating that the separated result is better with2\nDFA (supervised method) than PCA (unsupervised method). It is worth noting that when the3\nsame data set was analysed with both MOSFET and MOS sensors no clear differentiation could4\nbe obtained among the groups (data not shown). For this reason, only the responses of the MOS5\nsensors were taken into account for further analysis, as sample separation could be better attained6\nwith these types of sensors (see Figure 1). The data presented in Figure 6 is the whole dataset7\nconsisting of unacceptable, marginal and acceptable samples. DFA analysis showed good8\ndiscrimination between unacceptable samples and the other two qualitative groups of green9\nolives. However, in the case of marginal and acceptable samples there was an area of overlap10\nbetween the two clusters (area of uncertainty), implying that some samples cannot be classified11\nas belonging clearly to one class or the other.12\nThe MLP neural network based on back propagation was used to classify olive samples into13\nthe three categories from the volatile metabolites profile obtained from the electronic sensor array14\nanalysis. For neural network development three steps were followed including creating the15\nnetwork, training the network, and validating the network. A variety of hidden layers (one or16\ntwo), hidden neurons, learning rates and momenta were tried by developing different networks.17\nThe selected network architecture included an input layer, two hidden layers of neurons, and an18\noutput layer. There were 18 neurons in the input layer (one for each sensor apart from the19\ninitially excluded sensors), 15 neurons in the first hidden layer, 8 neurons in the second hidden20\nlayer, and 3 neurons in the output layer (Figure 7). The learning rate (n = 0.10) and momentum (α21\n= 0.20) parameters were selected to ensure that the convergence of the learning process was22\nachieved. The learning process performed until the error covering the entire training dataset23\n11\nconverged to a minimum value (RMSE = 0.017), whereas the relative value of RMSE for the test1\ndataset was 0.206. Two olive samples were misclassified in the training dataset. Specifically, one2\nmarginal sample was classified as acceptable, and one unacceptable sample was classified as3\nacceptable. In the test dataset, one sample was misclassified, i.e. an unacceptable sample was4\nclassified as acceptable (Table 1). The prediction performance of the network was fairly high as5\n97% and 92% for the training and test dataset, respectively.6\n7\n4. Discussion8\nThis study examined the potential of using an array of metal oxide\/ion sensor system for9\ndifferentiating the quality of fermented green olives. Results indicated that qualitative volatile10\npatterns using electronic nose technology could be successfully employed as a rapid tool for table11\nolives discrimination. The volatile fraction of table olives depends on many factors such as12\nvariety, ripening stage, process conditions, and the microbiological composition of the13\nfermentation brines [37]. Several classes of compounds have been identified in the aroma profile14\nof table olives, the most important being ethanol, methanol, 2-butanol, acetone, ethyl acetate, and15\nacetaldehyde for both green and black olives [9, 38]. Many of these volatile compounds are16\namong the end products known to be formed by the initial (e.g. coliforms, yeasts, etc) and\/or final17\nmicrobial association e.g. lactic acid bacteria, the major group responsible for olive fermentation18\nor any other group (e.g. yeasts, filamentous fungi, clostridia) associated with spoilage of these19\nfermented products [2]. It is thus clear that volatile compounds have a decisive role in the20\ncharacterisation of the flavour pattern of a given olive sample. Sensory quality is taken into great21\naccount by consumers, and is therefore the predominant element of appreciation and choice.22\n12\nIndeed sensory analysis has evolved considerably in recent years thanks to the development1\nof statistical analysis techniques which are crucial for data processing. However, although taste2\npanels are useful in quality classification tasks they have high running costs, are time consuming,3\nand sometimes lead to controversial interpretations. Therefore it would be interesting to employ4\nanother method for quality discrimination based on instrumental analytical techniques, such as5\nthe electronic nose. As a first step in the investigation of the method, the volatile patterns of6\nsamples characterised as unacceptable by a sensory panel were compared with an acceptable7\nsample that was considered as a reference. The electronic nose could clearly distinguish between8\nthe two classes as inferred by principal components analysis (PCA) and cluster analysis (CA)9\n(see Figures 2, 3). However, as more samples were introduced in the analysis, PCA, as an10\nunsupervised method, could not produce satisfactory discrimination (see Figure 4). For this11\nreason, discriminant function analysis (supervised method) was employed producing a clear12\ndifferentiation between unacceptable, marginal and reference sample (see Figure 5). An13\nelectronic nose is a system created to mimic the function of human nose. However, this analytical14\ninstrument is more a multi-sensor array technology than a real nose. Therefore, a sensory panel is15\nnecessary to define the desired product quality which in turn can be used to train the system for16\nmaximum discrimination [39]. Finally, when all samples were analysed and subjected to17\nmultivariate statistical interpretation, a certain level of overlapping between the classes of18\nmarginal and acceptable samples was observed (Figure 6). As discriminant function analysis was19\nemployed in the differentiation of the samples, this overlapping could be due to misclassification20\nof the original samples by the sensory panel.21\nThe discrimination of the analysed table olive samples has been tackled with a pattern22\nrecogniser based on an artificial neural network providing nonlinearity in the multivariate23\n13\nclassification performance. A feed-forward fully connected multilayer perceptron network has1\nbeen trained with the back-propagation algorithm for this purpose. By introducing nonlinear2\nmethods like ANNs, it would be possible to model electronic nose data in a better way, as3\nmultivariate statistical techniques are based on a linear approach, neglecting the fact that gas4\nsensor array data may often be nonlinear in nature [35]. The overall performance of the predictive5\nrecogniser can be appreciated by the confusion matrix obtained for each one of the three sensory6\nclasses used (see Table 1). One of the three misclassified olive samples lies in the zone of7\nuncertainty, as it was originally marginal and classified as acceptable. For the other two points,8\nprobably a larger training dataset or another neural network classifier (e.g. a radial basis function9\nnetwork) could have improved classification performance [26].10\n11\n5. Conclusion12\nThe results of this study demonstrated the applicability of an electronic nose as a screening13\ntool for quality control of fermented table olives based on their volatile patterns. It is worth14\nnoting that better description of the quality classes is necessary by an expert sensory panel to15\nimprove the discriminating performance of the system. Even if a larger number of table olive16\nsamples is required for better discrimination, the present results demonstrated the possibility of17\nusing this analytical technique to obtain in a rapid and objective manner information about the18\nsensorial properties of table olives.19\n20\nAcknowledgments21\nThe authors acknowledge the TRUEFOOD-“Traditional United Europe Food”, an Integrated22\nProject financed by the European Commission under the 6th Framework Programme for RTD23\n14\n(contract n. FOOD-CT-2006-016264). The information in this document reflects only the1\nauthors’ views and the Community is not liable for any use that may be made of the information2\ncontained therein.3\n15\nReferences1\n[1] R.F. McFeeters, Fermentation microorganisms and flavour changes in fermented foods, J.2\nFood Sci. 69 (2004) 35-37.3\n[2] H.P. Fleming, J.L. Etchells, T.A. Bell, Vapor analysis of fermented Spanish-type green4\nolives by gas chromatography, J. Food Sci. 34 (1969) 419-422.5\n[3] A. Montaño, A.H. Sánchez, L. Rejano, Rapid quantitative analysis of headspace6\ncomponents of green olive brine, J. Chromatogr. 521 (1990) 153-157.7\n[4] A. Montaño, A. de Castro, L. Rejano, A.H. Sánchez, Analysis of zapatera olives by gas and8\nhigh-performance liquid chromatography, J. Chromatogr. 594 (1992) 259-267.9\n[5] A. Montaño, A.H. Sánchez, A. de Castro, Controlled fermentation of Spanish-type green10\nolives, J. Food Sci. 4 (1993) 842-844.11\n[6] A. Montaño, A. de Castro, L. Rejano, M. Brenes, 4-hydroxycarboxylic acid as a substrate12\nfor cyclohexanocarboxylic acid production during the zapatera spoilage of Spanish style13\ngreen table olives, J. Food Prot. 59 (1996) 657-662.14\n[7] A.H. Sánchez, A. de Castro, L. Rejano, A. Montaño, Comparative study on chemical15\nchanges in olive juice and brine during green olive fermentation, J. Agric. Food Chem. 4816\n(2000) 5975-5980.17\n[8] T. Navarro, C. de Lorenzo, R.A. Perez, SPME analysis of volatile compounds from18\nunfermented olives subjected to thermal treatment, Anal. Bioanal. Chem. 379 (2004) 812-19\n817.20\n[9] E.Z. Panagou, C.C. Tassou, Changes in volatile compounds and related biochemical profile21\nduring controlled fermentation of cv. Conservolea green olives, Food Microbiol. 23 (2006)22\n738-746.23\n16\n[10] J.W. Gardner, P.N. Bartlett, A brief history of electronic noses, Sens. Actuators B 18-191\n(1994) 211-220.2\n[11] T.A. Dickinson, J. White, J.S. Kauer, D.R. Walt, Current trends in ‘artificial nose’3\ntechnology, Trends Biotechnol. 16 (1998) 250-258.4\n[12] P. Erti, S.R. Mkkelsen, Electrochemical biosensor for the identification of microorganisms5\nbased on lectin-lipopolysaccharide recognition, Anal. Chem. 7 (2001) 91-96.6\n[13] D.S. Lee, J.K. Jung, J.W. Lim, J.S. Huh, D.D. Lee, Recognition of volatile organic7\ncompounds using SnO2 sensor array and pattern recognition analysis, Sens. Actuators B 778\n(2001) 228-236.9\n[14] P. Mielle, Electronic nose: towards the objective instrumental characterization of food10\naroma, Trends Food Sci. Technol. 7 (1996) 432-440.11\n[15] S. Balasubramanian, S. Panigrahi, B. Kottapalli, C.E. Wolf-Hall, Evaluation of an artificial12\nolfactory system for grain quality discrimination, Lebensm.-Wiss. u. Technol. 40 (2007)13\n1815-1825.14\n[16] T. Elkov, G. Johansson, F. Winquist, I. Lundstrom, Monitoring sausage fermentation using15\nan electronic nose, J. Sci. Food Agr. 76 (1998) 525-532.16\n[17] A.K. Pavlou, N. Magan, D. Sharp, J. Brown, H. Barr, A.P.F. Turner, An intelligent rapid17\nodour recognition model in discrimination of Helicobacter pylori and other gastrophageal18\nisolates in vitro, Biosens. Bioelectron. 15 (2000) 333-342.19\n[18] H.L. Gan, Y.B. Che Man, C.P. Tan, I. Noraini, S.A.H. Nazimah, Characterisation of20\nvegetable oils by surface acoustic wave sensing electronic nose, Food Chem. 89 (2005)21\n507-518.22\n17\n[19] M.S. Cosio, D. Ballabio, S. Benedetti, C. Gigliotti, Evaluation of different storage1\nconditions of extra virgin olive oils with an innovative recognition tool built by means of2\nelectronic nose and electronic tongue, Food Chem. 101 (2007) 485-491.3\n[20] M. Penza, G. Cassano, Chemometric characterization of Italian wines by thin-film4\nmultisensors array and artificial neural networks, Food Chem. 86 (2004) 283-296.5\n[21] S. Buratti, D. Ballabio, S. Benedetti, M.S. Cosio, Prediction of Italian red wine sensorial6\ndescriptors from electronic nose, electronic tongue and spectrophotometric measurements7\nby means of genetic algorithm regression models, Food Chem. 100 (2007) 211-218.8\n[22] P. Schweizer-Berberich, S. Vaihinger, W. Gopel, Characterization of food freshness with9\nsensor arrays, Sens. Actuators B 18-19 (1994) 282-290.10\n[23] E. Winquist, Performance of an electronic nose for quality estimation of ground meat, Meat11\nSci. Technol. 9 (1993) 1493-1500.12\n[24] G. Keshri, N. Magan, Detection and defferentiation between mycotoxigenic and non-13\nmycotoxigenic strains of two Fusarium spp. using volatile production profiles and14\nhydrolytic enzymes, J. Appl. Microbiol. 89 (2000) 825-833.15\n[25] N. Magan, P. Evans, Volatiles as an indicator of fungal activity and differentiation between16\nspecies, and potential use of electronic nose technology for early detection of grain spoilage,17\nJ. Stored Prod. Res. 36 (2000) 319-340.18\n[26] P. Evans, K.C. Persaud, A.S. McNeish, R.W. Sneath, N. Hobson, N. Magan, Evaluation of19\na radial basis function neural network for the determination of wheat quality from20\nelectronic nose data, Sens. Actuators B 69 (2000) 348-358.21\n18\n[27] J.W. Gardner, M. Craven, C. Dow, E.L. Hines, The prediction of bacteria type and culture1\ngrowth phase by an electronic nose with a multi-layer perceptron network, Measurement2\nSci. Technol. 9 (1998) 120-127.3\n[28] T.D. Gibson, O. Prosser, J.N. Hulbert, R.W. Marshall, P. Corcoran, P. Lowery, E.A.4\nRuckKeene, S. Heron, Detection and simultaneous identification of microorganisms from5\nheadspace samples using an electronic nose, Sens. Actuators B 44 (1997) 413-422.6\n[29] U. Siripatrawan, J.E. Linz, B.R. Harte, Rapid method for prediction of Escherichia coli7\nnumbers using an electronic sensor array and an artificial neural network, J. Food Prot. 678\n(2004) 1604-1609.9\n[30] A. Catarina Bastos, N. Magan, Potential of an electronic nose for the early detection and10\ndifferentiation between Streptomyces in potable water, Sens. Actuators B 116 (2006) 151-11\n155.12\n[31] J.S. Vestergaard, J.E. Haugen, D.V. Byrne, Application of an electronic nose for13\nmeasuments of boat taint in entire male pigs, Meat Sci. 74 (2006) 564-577.14\n[32] A.H. Gomez, J. Wang, G. Hu, A.G. Pereira, Monitoring storage shelf life of tomato using15\nelectronic nose technique, J. Food Eng. 85 (2008) 625-631.16\n[33] T. Rajamaki, H.L. Alakomi, T. Ritvanen, E. Skytta, M. Smolander, R. Ahvenainen,17\nApplication of an electronic nose for quality assessment of modified atmosphere packaged18\npoultry meat, Food Control 17 (2006) 5-13.19\n[34] I.A. Basheer, M. Hajmeer, Artificial neural networks: Fundamentals, computing, design,20\nand application, J. Microbiol. Meth. 43 (2000) 3-31.21\n[35] J.E. Haugen, K. Kvaal, Electronic nose and artificial neural network, Meat Sci. 49 (1998)22\nS273-S286.23\n19\n[36] V. Marsilio, Sensory analysis of table olives, Olivae 90 (2002) 32-41.1\n[37] A. Montaño-Asquerino, A.H. Sánchez, L. Rejano, Rapid quantitative analysis of headspace2\ncomponents of green olive brine, J. Chromatogr. 521 (1990) 153-157.3\n[38] E. Schaller, J.O. Bosset, F. Escher, Electronic noses and their application to food,4\nLebensm.-Wiss. u. Technol. 31 (1998) 305-316.5\n6\n20\nFigure Legends1\n2\nFigure 1. Comparison of the responses of metal oxide sensors to three replicates of unacceptable3\nolive samples (solid line) and the acceptable reference olive sample (dotted line).4\n5\nFigure 2. The principal components (PC) analysis map of data for three replicates of unacceptable6\nolive samples and the acceptable reference sample using the metal oxide\/ion-based electronic7\nnose.8\n9\nFigure 3. Dendrogram showing the cluster analysis and separation of the acceptable reference10\nsample (A) and the unacceptable olive samples (AV, PL, HN). Numbers correspond to the11\nreplicates for each olive sample.12\n13\nFigure 4. The principal components (PC) analysis map of data showing the discrimination of14\nunacceptable (U), marginal (M) and the acceptable (A) reference sample. Three replicates for15\neach sample were used.16\n17\nFigure 5. Discriminant function analysis (DFA) plot of the differentiation between unacceptable,18\nmarginal and the acceptable reference sample. Three replicates for each sample were used.19\n20\nFigure 6. Discriminant function analysis (DFA) plot of the differentiation between unacceptable,21\nmarginal and acceptable olive samples. Three replicates for each sample were used.22\n23\nFigure 7. Schematic representation of a four-layered MPL network used as patterns classifier for24\ntable olives quality identification.25\n26\n27\n28\n29\n21\n1\nFig. 12\n0.00\n50.00\n100.00\n150.00\n200.00\n250.00\n300.00\n350.00\n400.00\n450.00\nFE\n10\n1A\nFE\n10\n2A\nFE\n10\n3A\nFE\n10\n1B\nFE\n10\n2B\nFE\n10\n3B\nFE\n10\n5B\nM\nO\n10\n1\nM\nO\n10\n2\nM\nO\n10\n4\nM\nO\n11\n0\nM\nO\n11\n1\nM\nO\n11\n2\nM\nO\n11\n3\nM\nO\n11\n4\nM\nO\n11\n7\nM\nO\n11\n8\nSensors\nSe\nns\nor\nre\nsp\non\nse\n(m\nV\n)\n22\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\nFig. 229\n-3\n-2\n-1\n0\n1\n2\n3\n-3 -2 -1 0 1 2 3\nScores for PC1 (68.7%)\nSc\nor\nes\nfo\nr\nP\nC\n2\n(2\n2.\n9%\n) Acceptable\nUnacceptable\n23\n1\n2\nFig. 33\nA1\nA2\nA3\nNH2\nHN3\nHN1\nPL1\nPL2\nPL3\nAV2\nAV1\nAV3\n0 2 4 6 8 10 12\nLinkage distance\n24\n1\n2\nFig. 43\n4\nMM\nM\nM\nM M\nM\nM\nM\nA\nAA\nU U U\nU\nU\nU\nU U\nU\n-3\n-2\n-1\n0\n1\n2\n3\n-3 -2 -1 0 1 2 3\nScores for PC1 (87.1%)\nSc\nor\nes\nfo\nr\nP\nC\n2\n(1\n0.\n3%\n)\n25\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\nFig. 530\n-6\n-4\n-2\n0\n2\n4\n6\n-25 -20 -15 -10 -5 0 5 10 15 20 25\nFunction 1 (96.9%)\nF\nun\nct\nio\nn\n2\n(3\n.1\n%\n)\nAcceptable\nUnacceptable\nMarginal\n26\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\nFig. 631\n-5\n-4\n-3\n-2\n-1\n0\n1\n2\n3\n4\n5\n-6 -4 -2 0 2 4 6\nFunction 1 (81.4%)\nF\nun\nct\nio\nn\n2\n(1\n8.\n6%\n) Unacceptable\nMarginal\nAcceptable\n27\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\nFig. 713\n14\n15\n16\n17\n18\n19\n20\nAcceptable (1,0,0)\nM arginal (0,1,0)\nUnacceptable (0,0,1)\nOutput layerHidden layer 1 Hidden layer 2Input layer\nSensor 1\nSensor 2\nSensor i\nBias Bias\n28\nTable 11\nConfusion matrix of the MLP classifier performing the task of discrimination of table olive samples.2\nFrom\/To Acceptable Marginal Unacceptable\nAcceptable 34 0 0\nMarginal 1 17 0Training dataset\nUnacceptable 1 0 13\nAcceptable 5 0 0\nMarginal 3 0 0Test dataset\nUnacceptable 1 0 3\n3\n"}