{"doi":"10.1371\/journal.pone.0001078","coreId":"91187","oai":"oai:kar.kent.ac.uk:3949","identifiers":["oai:kar.kent.ac.uk:3949","10.1371\/journal.pone.0001078"],"title":"Optimized protein extraction for quantitative proteomics of yeasts","authors":["von der Haar, Tobias"],"enrichments":{"references":[{"id":846957,"title":"A sampling of the yeast proteome.","authors":[],"date":"1999","doi":null,"raw":"Futcher B, Latter GI, Monardo P, McLaughlin CS, Garrels JI (1999) A sampling of the yeast proteome. Mol Cell Biol 19: 7357–7368.","cites":null},{"id":846981,"title":"Global analysis of protein expression in yeast.","authors":[],"date":"2003","doi":"10.1038\/nature02046","raw":"Ghaemmaghami S, Huh WK, Bower K, Howson RW, Belle A, et al. (2003) Global analysis of protein expression in yeast. Nature 425: 737–741.","cites":null},{"id":847264,"title":"Absolute protein expression profiling estimates the relative contributions of transcriptional and translational regulation.","authors":[],"date":"2007","doi":"10.1038\/nbt1270","raw":"Lu P, Vogel C, Wang R, Yao X, Marcotte EM (2007) Absolute protein expression profiling estimates the relative contributions of transcriptional and translational regulation. Nat Biotechnol 25: 117–124.","cites":null},{"id":847518,"title":"Single-cell proteomic analysis of S. cerevisiae reveals the architecture of biological noise.","authors":[],"date":"2006","doi":"10.1038\/nature04785","raw":"Newman JR, Ghaemmaghami S, Ihmels J, Breslow DK, Noble M, et al. (2006) Single-cell proteomic analysis of S. cerevisiae reveals the architecture of biological noise. Nature 441: 840–846.","cites":null},{"id":847799,"title":"Rapid and reliable protein extraction from yeast.","authors":[],"date":"2000","doi":"10.1002\/1097-0061(20000630)16:9<857::aid-yea561>3.0.co;2-b","raw":"Kushnirov VV (2000) Rapid and reliable protein extraction from yeast. Yeast 16: 857–860.","cites":null},{"id":847984,"title":"Reactions of the Cyanate Present in Aqueous Urea with Amino Acids and Proteins.","authors":[],"date":"1960","doi":null,"raw":"Stark GR, Stein WH, Moore S (1960) Reactions of the Cyanate Present in Aqueous Urea with Amino Acids and Proteins. J Biol Chem 235: 3177–3181.","cites":null},{"id":848048,"title":"A method for the quantitative recovery of protein in dilute solution in the presence of detergents and lipids.","authors":[],"date":"1984","doi":"10.1016\/0003-2697(84)90782-6","raw":"Wessel D, Flugge UI (1984) A method for the quantitative recovery of protein in dilute solution in the presence of detergents and lipids. Anal Biochem 138: 141–143.","cites":null},{"id":848314,"title":"Cell wall construction in Saccharomyces cerevisiae.","authors":[],"date":"2006","doi":"10.1002\/yea.1349","raw":"Klis FM, Boorsma A, De Groot PW (2006) Cell wall construction in Saccharomyces cerevisiae. Yeast 23: 185–202.","cites":null},{"id":848519,"title":"Global analysis of protein localization in budding yeast.","authors":[],"date":"2003","doi":"10.1038\/nature02026","raw":"Huh WK, Falvo JV, Gerke LC, Carroll AS, Howson RW, et al. (2003) Global analysis of protein localization in budding yeast. Nature 425: 686–691.","cites":null},{"id":848766,"title":"Stepwise dissociation of yeast 60S ribosomal subunits by LiCl and identification of L25 as a primary 26S rRNA binding protein.","authors":[],"date":"1984","doi":"10.1111\/j.1432-1033.1984.tb08477.x","raw":"El-Baradi TT, Raue HA, De Regt CH, Planta RJ (1984) Stepwise dissociation of yeast 60S ribosomal subunits by LiCl and identification of L25 as a primary 26S rRNA binding protein. Eur J Biochem 144: 393–400. Quantitative Yeast Proteomics PLoS ONE | www.plosone.org 7 October 2007 | Issue 10 | e107811. Remacha M, Jimenez-Diaz A, Santos C, Briones E, Zambrano R, et al. (1995) Proteins P1, P2, and P0, components of the eukaryotic ribosome stalk. New structural and functional aspects. Biochem Cell Biol 73: 959–968.","cites":null},{"id":849013,"title":"Proteins P1, P2, and P0, components of the eukaryotic ribosome stalk. New structural and functional aspects.","authors":[],"date":"1995","doi":"10.1139\/o95-103","raw":null,"cites":null},{"id":849300,"title":"Regulated translational bypass of stop codons in yeast.","authors":[],"date":"2007","doi":"10.1016\/j.tim.2006.12.002","raw":"von der Haar T, Tuite MF (2007) Regulated translational bypass of stop codons in yeast. Trends Microbiol 15: 78–86.","cites":null},{"id":849503,"title":"The [PSI+] prion of yeast: a problem of inheritance.","authors":[],"date":"2006","doi":"10.1016\/j.ymeth.2006.04.001","raw":"Tuite MF, Cox BS (2006) The [PSI+] prion of yeast: a problem of inheritance. Methods 39: 9–22.","cites":null},{"id":849786,"title":"Role of the chaperone protein Hsp104 in propagation of the yeast prion-like factor [psi+].","authors":[],"date":"1995","doi":"10.1126\/science.7754373","raw":"Chernoff YO, Lindquist SL, Ono B, Inge-Vechtomov SG, Liebman SW (1995) Role of the chaperone protein Hsp104 in propagation of the yeast prion-like factor [psi+]. Science 268: 880–884.","cites":null},{"id":850026,"title":"Designer deletion strains derived from Saccharomyces cerevisiae S288C: a useful set of strains and plasmids for PCR-mediated gene disruption and other applications.","authors":[],"date":"1998","doi":"10.1002\/(SICI)1097-0061(19980130)14:2<115::AID-YEA204>3.0.CO;2-2","raw":"Brachmann CB, Davies A, Cost GJ, Caputo E, Li J, et al. (1998) Designer deletion strains derived from Saccharomyces cerevisiae S288C: a useful set of strains and plasmids for PCR-mediated gene disruption and other applications. Yeast 14: 115–132.","cites":null},{"id":850294,"title":"Cleavage of structural proteins during the assembly of the head of bacteriophage T4.","authors":[],"date":"1970","doi":"10.1038\/227680a0","raw":"Laemmli UK (1970) Cleavage of structural proteins during the assembly of the head of bacteriophage T4. Nature 227: 680–685.","cites":null},{"id":850543,"title":"Electrophoretic transfer of proteins from polyacrylamide gels to nitrocellulose sheets: procedure and some applications.","authors":[],"date":"1979","doi":"10.1073\/pnas.76.9.4350","raw":"Towbin H, Staehelin T, Gordon J (1979) Electrophoretic transfer of proteins from polyacrylamide gels to nitrocellulose sheets: procedure and some applications. Proc Natl Acad Sci U S A 76: 4350–4354. Quantitative Yeast Proteomics PLoS ONE | www.plosone.org 8 October 2007 | Issue 10 | e1078","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-10-24","abstract":"BACKGROUND: The absolute quantification of intracellular protein levels is technically demanding, but has recently become more prominent because novel approaches like systems biology and metabolic control analysis require knowledge of these parameters. Current protocols for the extraction of proteins from yeast cells are likely to introduce artifacts into quantification procedures because of incomplete or selective extraction. PRINCIPAL FINDINGS: We have developed a novel procedure for protein extraction from S. cerevisiae based on chemical lysis and simultaneous solubilization in SDS and urea, which can extract the great majority of proteins to apparent completeness. The procedure can be used for different Saccharomyces yeast species and varying growth conditions, is suitable for high-throughput extraction in a 96-well format, and the resulting extracts can easily be post-processed for use in non-SDS compatible procedures like 2D gel electrophoresis. CONCLUSIONS: An improved method for quantitative protein extraction has been developed that removes some of the sources of artefacts in quantitative proteomics experiments, while at the same time allowing novel types of applications","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/91187.pdf","fullTextIdentifier":"http:\/\/kar.kent.ac.uk\/3949\/1\/von_der_Haar_2007_PLOS_One.pdf","pdfHashValue":"3983a2c87d93d79986cb78a8b956c974f565261f","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:kar.kent.ac.uk:3949<\/identifier><datestamp>\n      2014-05-07T08:24:59Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D466163756C74696573:3132303030:3132313030<\/setSpec><setSpec>\n      6469766973696F6E733D466163756C74696573:3132303030:3132313030:31323130302F31<\/setSpec><\/header><metadata><rioxx xmlns=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/\" xmlns:ali=\"http:\/\/ali.niso.org\/2014\/ali\/1.0\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:dcterms=\"http:\/\/purl.org\/dc\/terms\/\" xmlns:rioxxterms=\"http:\/\/docs.rioxx.net\/schema\/v2.0\/rioxxterms\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/ http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/rioxx.xsd\" ><ali:free_to_read>\n    \n      <\/ali:free_to_read><ali:license_ref start_date=\"2007-10-24\" >http:\/\/creativecommons.org\/licenses\/by\/4.0<\/ali:license_ref><dc:description>BACKGROUND: The absolute quantification of intracellular protein levels is technically demanding, but has recently become more prominent because novel approaches like systems biology and metabolic control analysis require knowledge of these parameters. Current protocols for the extraction of proteins from yeast cells are likely to introduce artifacts into quantification procedures because of incomplete or selective extraction. PRINCIPAL FINDINGS: We have developed a novel procedure for protein extraction from S. cerevisiae based on chemical lysis and simultaneous solubilization in SDS and urea, which can extract the great majority of proteins to apparent completeness. The procedure can be used for different Saccharomyces yeast species and varying growth conditions, is suitable for high-throughput extraction in a 96-well format, and the resulting extracts can easily be post-processed for use in non-SDS compatible procedures like 2D gel electrophoresis. CONCLUSIONS: An improved method for quantitative protein extraction has been developed that removes some of the sources of artefacts in quantitative proteomics experiments, while at the same time allowing novel types of applications.<\/dc:description><dc:format>application\/pdf<\/dc:format><dc:identifier>http:\/\/kar.kent.ac.uk\/3949\/1\/von_der_Haar_2007_PLOS_One.pdf<\/dc:identifier><dc:language>en<\/dc:language><dc:relation>http:\/\/www.plosone.org\/article\/info:doi\/10.1371\/journal.pone.0001078<\/dc:relation><dc:source>1932-6203<\/dc:source><dc:subject>Q<\/dc:subject><dc:title>Optimized protein extraction for quantitative proteomics of yeasts<\/dc:title><rioxxterms:apc>unknown<\/rioxxterms:apc><rioxxterms:author>von der Haar, Tobias<\/rioxxterms:author><rioxxterms:project funder_name=\"notused\" >notused<\/rioxxterms:project><rioxxterms:publication_date>2007-10-24<\/rioxxterms:publication_date><rioxxterms:type>Journal Article\/Review<\/rioxxterms:type><rioxxterms:version>NA<\/rioxxterms:version><rioxxterms:version_of_record>http:\/\/dx.doi.org\/10.1371\/journal.pone.0001078<\/rioxxterms:version_of_record><\/rioxx><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/www.plosone.org\/article\/info:doi\/10.1371\/journal.pone.0001078"],"year":2007,"topics":["Q"],"subject":["Q"],"fullText":"Optimized Protein Extraction for Quantitative\nProteomics of Yeasts\nTobias von der Haar*\nProtein Science Group, Department of Biosciences, University of Kent, Canterbury, United Kingdom\nBackground. The absolute quantification of intracellular protein levels is technically demanding, but has recently become\nmore prominent because novel approaches like systems biology and metabolic control analysis require knowledge of these\nparameters. Current protocols for the extraction of proteins from yeast cells are likely to introduce artifacts into quantification\nprocedures because of incomplete or selective extraction. Principal Findings. We have developed a novel procedure for\nprotein extraction from S. cerevisiae based on chemical lysis and simultaneous solubilization in SDS and urea, which can\nextract the great majority of proteins to apparent completeness. The procedure can be used for different Saccharomycetes\nyeast species and varying growth conditions, is suitable for high-throughput extraction in a 96-well format, and the resulting\nextracts can easily be post-processed for use in non-SDS compatible procedures like 2D gel electrophoresis. Conclusions. An\nimproved method for quantitative protein extraction has been developed that removes some of the sources of artefacts in\nquantitative proteomics experiments, while at the same time allowing novel types of applications.\nCitation: von der Haar T (2007) Optimized Protein Extraction for Quantitative Proteomics of Yeasts. PLoS ONE 2(10): e1078. doi:10.1371\/\njournal.pone.0001078\nINTRODUCTION\nThe recent literature has seen a significant increase in the number of\npublications that attempt the determination of protein abundances\nin yeast cells on a large scale [1–4]. These studies provide an\nimportant data source for the emerging fields of systems biology and\ncontrol analysis, where macromolecular abundance data are\nrequired for the construction of meaningful models. However,\na detailed comparison showed that correlations between data sets\ngenerated by different groups are generally poor (see the\nsupplementary data in Lu et al., ref. 3). A good illustration of the\nvariability of published abundance data is given by the example of\ntranslation elongation factor eEF2, for which values during\nlogarithmic growth in YPD at 30uC are given as 78,100; 321,782;\nand 8,764 proteins per cell [2–4]. Importantly, this spread of\nreported abundance values is representative for the data set as\na whole, since the weighted standard deviation for reported eEF2\nabundance equals the median of weighted standard deviations for\ndata sets of all individual proteins (TvdH, unpublished).\nWith the exception of one study [4], all of the work cited above\nanalyzed protein abundance following the extraction of these\nmolecules from cells. Importantly, none of these studies evaluated\nthe efficiencies of the respective extraction procedures they\nemployed. During attempts to quantify intracellular levels of the\npolypeptide release factors eRF1 (Sup45p) and eRF3 (Sup35p) in S.\ncerevisiae, we found that apparent abundance values for both factors\nvaried widely depending on the exact protein preparation\nprocedures used. Although the poor consistency between genome-\nwide protein abundance studies is likely to arise from many different\nsources, these observations suggest that varying extraction efficien-\ncies could be one factor contributing to high data variance.\nOur problems with the quantification of release factor levels\nprompted an attempt to develop an improved, more quantitative\nprotein extraction procedure. Criteria for an ideal approach were\na), quantitative extraction and solubilization of all S. cerevisiae\nproteins, b) maintenance of the proteome in the pre-extraction\nstate, c) easy quantification of the numbers of extracted cells to aid\nin the determination of absolute protein levels per cell, and d)\na minimum of manual intervention in order to make the\nprocedure easily applicable and amenable to high-throughput\nexperimental approaches.\nRESULTS\nBasic Procedure\nAs starting point for the development of an improved method, we\nchose a published ‘‘alkaline lysis’’ procedure [5], which in our\nhands gave the highest extraction efficiency of the different\napproaches initially tested (data not shown). In the original\nprotocol, yeast cells are harvested, resuspended in 0.1 N NaOH\nand incubated for several minutes, harvested again and then\nresuspended and boiled in standard SDS-PAGE sample buffer.\nAlthough the exact mode of cell lysis is not clearly understood, it\nappears to be the combined action of NaOH in the pre-lysis buffer\nand of 2-mercaptoethanol in the sample buffer that makes cell\nwalls porous enough for proteins to escape into the surrounding\nbuffer. The initial treatment with NaOH leads to some membrane\ndamage, since small molecules are readily released during this\nincubation. In contrast, bulk protein is only released once the cells\nare boiled in sample buffer. It should be noted that cell walls are\nnot completely destroyed during the extraction, since the cells\nremain visible as ‘‘ghosts’’ throughout the entire procedure. The\nsame is also true for the modified procedure described below.\nAlthough generally of high efficiency, this procedure has\ndrawbacks for the purposes of accurate protein quantification.\nAcademic Editor: Thomas Preiss, Victor Chang Cardiac Research Institute,\nAustralia\nReceived September 14, 2007; Accepted October 5, 2007; Published October 24,\n2007\nCopyright: \u0001 2007 Tobias von der Haar. This is an open-access article distributed\nunder the terms of the Creative Commons Attribution License, which permits\nunrestricted use, distribution, and reproduction in any medium, provided the\noriginal author and source are credited.\nFunding: This work was funded by a Wellcome Trust (UK) Research Career\nDevelopment Fellowship (Ref. 075438\/Z\/04\/Z). The funders had no role in the\ndesign or conduct of this study, nor in the preparation of the manuscript.\nCompeting Interests: The author has declared that no competing interests\nexist.\n* To whom correspondence should be addressed. E-mail: T.von-der-Haar@kent.\nac.uk\nPLoS ONE | www.plosone.org 1 October 2007 | Issue 10 | e1078\nSmall proteins (,15 kDa) are released during the NaOH\nincubation, and are therefore underrepresented in the final\nextract. Second, yeast cells remain viable during the several\nminutes of NaOH incubation [5]. Cells may therefore respond to\nthis harsh treatment with significant proteome alterations, and the\nfinal extract may not reflect the proteome composition under\nnormal culture conditions. Lastly, although yeast cell density can\nbe accurately quantified during the NaOH incubation step,\nsubsequent centrifugation and resuspension steps often lead to\na partial loss of cells which is difficult to control. Once resuspended\nin sample buffer, accurate cell quantification is made difficult by\nthe presence of the loading dye.\nIn order to circumvent these problems, the basic procedure from\nreference 5 was initially modified as follows. Harvested cells were\nresuspended in a solution containing NaOH, 2-mercaptoethanol\nand SDS and immediately heated to 90uC, thus achieving\nsimultaneous lysis and solubilization. In the next step, the extract\nwas neutralized, and then Tris-HCl buffer, glycerol and bromophe-\nnol blue were added to make up a final buffer composition very\nsimilar to standard SDS-PAGE sample buffer. This extract could\nimmediately be loaded onto SDS-PAGE gels or further processed for\nnon-SDS compatible applications (see below).\nOptimization of total protein extraction\nAs an initial control experiment, it was tested how stable proteins\nwere under the hot alkaline buffer conditions of the first extraction\nstep. Incubation of a yeast extract under these conditions did not\ndetectably change the pattern of protein bands for up to\n20 minutes, although the band pattern did degrade upon\nprolonged incubation (.1 hour, data not shown). In contrast,\nonce the NaOH in this buffer was neutralized, the protein band\npattern was stable almost indefinitely at this temperature. The lysis\nstep was therefore limited to a ten minute incubation under\nalkaline high temperature conditions, in order to ensure that the\nproteome was not artifactually altered during the lysis procedure.\nThe procedure was then optimized by systematic variation of\nparameters like SDS concentration, boiling time, and inclusion of\nadditional solubilizing agents. Extraction in these experiments was\nassessed by determining the amount of total protein that could be\nreleased from a fixed number of cells. The optimized procedure,\nwhich among all the conditions tested extracted the maximum\namount of protein (corresponding to ,5610212 g protein per\ncell), is given in Figure 1.\nIn these experiments, the single most important parameter for\nefficient extraction was the ratio of SDS to cells during the hot\nalkaline incubation in lysis buffer (Figure 2). The conditions given\nin figure 1 correspond to 56108 cells\/ml in a solution containing\n2% SDS. If this ratio was altered, either by decreasing the SDS\nconcentration (Figure 2A) or by increasing the cell density\n(Figure 2B), extraction quickly became sub-optimal. Importantly,\nthis reduction in extraction efficiency did not affect the proteome\nuniformly. The gel shown in figure 2B demonstrates a bias against\nextraction of larger proteins when the cell density was increased\n(compare lane A, extracted at 56108cells\/ml, versus lane B,\nextracted at 2.56109 cells\/ml). These proteins remained associ-\nated with the cellular debris and could be recovered by a second\nextraction, as shown in lane C of this gel (this sample is two-fold\nconcentrated compared to lanes A and B). In contrast, at the\n‘‘correct’’ SDS-to-cell ratio, no protein could be recovered in\na second extraction step (data not shown). Thus, the procedure\nshown in figure 1 achieved maximal release of total protein into\nthe extraction buffer, without producing apparent alterations to\nthe proteome.\nWestern blotting experiments showed that many individual\nproteins are extracted to maximum efficiency with the conditions\ngiven in figure 1, consistent with the data obtained for total protein\n(Act1p, Hsp104p, Pgk1p, Yef3p, Sui2p, Rnq1p, Rpp0; figure 3B and\ndata not shown). Surprisingly however, a minority of protein species\nshowed extraction patterns that were significantly different. In\nparticular, inclusion of extra solubilizing agents significantly affected\nthe extraction efficiency for Sup35p, Sup45p, and Rpl25p (figure 3B\nand C). The inclusion of 1% deoxycholate significantly increased\nextraction efficiencies for Sup45p and Rpl25p, but it also significantly\ndecreased extraction efficiencies for Sup35p. The latter protein was\nextracted with greatly increased efficiency when 8 M Urea was\nincluded in buffer 1, but under these conditions the abundance of\nmany other proteins in the extracts dropped dramatically.\nThe most straightforward interpretation of these results is that\nconditions as shown in Figure 1 are sufficient for the maximal\nextraction of the great majority of proteins, but that some proteins\nrequire harsher conditions for efficient transfer to the solubilized\nstate. Surprisingly, however, these data also show that conditions\nwhich increase solubilization of one protein species decrease the\nabundance of other proteins in the extract. In the case of\ndeoxycholate, the molecular mechanisms underlying the decrease\nin Sup35p extraction are not clear. In contrast, in the case of urea,\nit is likely that the apparently lower extraction efficiencies for many\nproteins are not actually the result of reduced extraction, but\nrather of degradation of these proteins.\nUrea in solution establishes an equilibrium with cyanate, which\ncovalently modifies several different amino acid side chains in\na reaction that is greatly accelerated by heat and alkaline conditions\n[6]. These modifications may lead to a destabilization of some\nproteins under the extraction conditions. In order to test whether\na reduction in incubation temperatures might prevent destabilization\nof apparently urea-sensitive proteins but still permit efficient\nsolubilization of Sup35p, extraction with the urea containing buffer\nwas attempted over a range of incubation temperatures (figure 3D).\nUrea sensitive proteins like Rnq1p were indeed stabilized by\nlowering the extraction temperature. However, efficient Sup35p\nextraction required raising the temperature to a point where Rnq1p\nlevels became nearly undetectable.\nThe example of Sup35p and Rnq1p illustrates the difficulty in\nfinding extraction conditions that are equally efficient for all\ncellular proteins. It should be noted, however, that proteins which\ncan not be extracted to apparent completeness in simple SDS\nbuffer are the exception rather than the rule. Thus, none of the\nproteins represented by bands visible in gels stained for total\nprotein increased significantly when deoxycholate or Urea were\nincluded in the extraction buffer.\nAnalysis of non-extracted proteins\nThe previous experiments analyzed extraction efficiency in terms\nof the maximum amount of protein recovered from a certain\nnumber of cells. However, populations of some proteins may be\nvery tightly associated with the post-extraction cellular debris, and\nmay thus not be extractable at all. Proteins remaining associated\nwith the cellular structures following extraction were therefore\nanalyzed by two independent means.\nFirst, samples of cells were subjected to the new procedure,\ncollected by centrifugation, and then extracted a second time using\na variety of alternative procedures. Re-extraction by alkaline lysis\nin the presence of 8 M urea did not yield significant extra bands in\nan SDS-PAGE gel (figure 4A). This confirms that protein species\nthat are only extractable with urea (such as Sup35p, figure 4B)\nconstitute a minority among yeast proteins. Some extra proteins\nappeared to be liberated by physical breakage of the cell ‘‘ghosts’’\nQuantitative Yeast Proteomics\nPLoS ONE | www.plosone.org 2 October 2007 | Issue 10 | e1078\nusing glass beads, although these constitute a clear minority among\nyeast protein species. Note that the re-extracted samples in figure 4\nare twice concentrated compared to the first extraction sample.\nAs a second approach to analyzing potential non-extractable\nproteins, cells that had been extracted as described in figure 1 were\nstained with a fluorescent total protein stain (SYPRO Red), and\nanalyzed using fluorescence microscopy. These samples were\ncompared to mock-extracted cells, which had been treated with\n0.1 N NaOH for ten minutes, a treatment that does not release\nany proteins larger than ,15 kDa from the cells. Figure 4C\ndemonstrates that mock-extracted cells showed bright fluorescence\nconsistent with a high protein content, whereas the extracted cells\nshowed very low levels of fluorescence near the detection limit. On\naverage, the fluorescent signal per cell dropped by .95%, again\nconfirming that the great majority of yeast proteins are\nquantitatively extracted by the alkaline lysis procedure.\nExtraction from different growth conditions and of\nother yeast species\nin order to test the applicability of the new procedure, S. cerevisiae\ncells recovered from a variety of growth conditions were extracted.\nExtraction was efficient for cells growing in liquid as well as on\nplates, and also for stationary phase cells. Moreover, tests with\nother yeast species showed that this procedure worked well with\nother yeasts from the Saccharomycetes group including S. bayanus,\nCandida albicans and Pichia pastoris.\nHigh-throughput extraction\nThe new extraction procedure is also well suited to application in\na high-throughput context. Yeast cells can be easily processed in\n96 well plates, and this format is sufficiently sensitive e.g. for the\nidentification of strains that show altered expression levels of\nFigure 1. Outline of the basic extraction procedure. Yeast cells are harvested, resuspended in lysis buffer 1, and heated to 90uC for ten minutes. The\nlysate is then brought to neutral pH, and heated again to increase solubilization. Following this step, the lysate can either be brought to\na composition similar to standard SDS-PAGE sample buffer and immediately used in gel electrophoresis-based applications (left branch), or the\nproteins can be precipitated and the SDS-containing buffer can be removed for SDS-incompatible applications (right branch).\ndoi:10.1371\/journal.pone.0001078.g001\nQuantitative Yeast Proteomics\nPLoS ONE | www.plosone.org 3 October 2007 | Issue 10 | e1078\na particular gene product. Three yeast strains showing different\nexpression levels of Sup35p were employed in a pilot experiment:\nBY4741, which contains wild-type levels of this protein, the same\nstrain containing a deletion for the mkc7 gene, which as we\npreviously observed shows moderately increased levels of Sup35p\n(TvdH and M.F. Tuite, unpublished), and BY4741 transformed\nwith the SUP35 gene on a high copy plasmid, which shows the\nhighest levels of Sup35p. These strains were grown in 24\nindependent micro-cultures each in the wells of a 96 well plate,\nharvested and extracted with minor modifications to the pro-\ncedure described in Figure 1 (a detailed description of the 96-well\nextraction is given in the Materials and Methods section). The\nresulting protein samples were separated on a 96-well gel\nelectrophoresis system, transferred onto a nitrocellulose mem-\nbrane, and Sup35p and Pgk1p in the samples were detected by\nwestern blotting using a mixture of the two respective primary\nantibodies (Pgk1p levels were used as an internal loading control).\nFigure 5A shows a 364 well section of the resulting blot,\ncontaining four independent samples for each of the three strains.\nImportantly, the different strains showed significantly different\ngrowth rates and final cell densities, thus mimicking conditions\nwhich would be encountered in a real-life screening experiment\ninvolving many different strains. These differences in growth were\nefficiently corrected for by use of the internal loading control.\nFigure 5B shows that this procedure could reliably differentiate\nbetween the different Sup35p expression levels in the three strains.\nFigure 2. Extraction efficiency is limited by the ratio of SDS to cells.\n(A) The amount of total protein that can be extracted at a density of\n56108 cells\/ml is shown as a function of SDS-concentration in the lysis\nbuffer. Other buffer components were kept constant (0.1 M NaOH,\n0.05 M EDTA, 2% 2-mercaptoethanol). SDS-concentrations below ,2%\nlimit extraction efficiency at this cell concentration. (B) Cells were lysed\nin buffer containing 2% SDS, at cell densities of 56108 cells\/ml (Lane A)\nor 2.56109 cells\/ml (Lane B). Extract representing 56106 cells was\nresolved on a 10% SDS-PAGE gel. The lower intensity of many bands in\nlane B shows that extraction efficiency is limited at the higher cell\ndensity. Lane C shows a re-extraction of the cells from lane B at a cell\ndensity of 56108cells\/ml. In this lane, twice the amount of extract (107\ncells) was loaded compared to lanes A and B in order to make bands\nthat were under-extracted in sample B more clearly visible.\ndoi:10.1371\/journal.pone.0001078.g002\nFigure 3. A subset of proteins is sensitive to additional solubilizing factors. (A) Protein extracts were prepared in the absence or presence of 1%\ndeoxycholate (DC) or 8 M Urea. The amount of extracted total protein and individual proteins was then determined using gel electrophoresis and\nwestern blotting. Rpl25p and Sup45p show an increase in extraction efficiency in the presence of DC, whereas Sup35p shows a decrease. Conversely,\nSup35p is more efficiently extracted in the presence of Urea, while Rnq1p, Rpl25p and Sup45p are extracted less efficiently. (B) shows the western\nblot for the data presented in panel A for Sup35p and Rnq1p. (C) Temperature dependence of extraction in the presence of Urea for total protein,\nRnq1p and Sup35p. Rnq1p is extracted to maximum efficiency at ,60uC, but decays at higher temperatures, whereas Sup35p requires high\ntemperatures for efficient extraction.\ndoi:10.1371\/journal.pone.0001078.g003\nQuantitative Yeast Proteomics\nPLoS ONE | www.plosone.org 4 October 2007 | Issue 10 | e1078\nFrom the spread of the data for each strain, it can be estimated\nthat a moderate two-fold change in expression level can be\ndetected with $80% confidence in individual experiments. As an\nalternative to the use of an internal loading control, the optical\ndensity of the 96-well cultures can be determined, however, this\nincreases the variability in the data, presumably because it does\nnot correct for different rates of recovery of cells during harvesting.\nPost-processing for non-SDS compatible\napplications\nA drawback of the alkaline\/SDS extraction procedure is the\npresence of SDS in the final extracts, which precludes its application\nfor many important proteomic techniques that are not SDS-\ncompatible. However, methanol-induced precipitation of proteins\ncan be efficiently used for removal of SDS from protein extracts (for\nmore details, see reference 7 and the right hand branch of the flow\nchart in figure 1). Figure 6A shows the result of an experiment where\nprotein from one half of an SDS-containing extract was precipitated,\nresuspended in sample buffer, and applied next to an aliquot of the\nnon-precipitated portion of the sample. The banding pattern and\noverall band intensity are indistinguishable for the original and\nprecipitated samples in the molecular weight range between ,10\nand ,150 kDa, thus demonstrating that precipitation by this\nmethod is highly quantitative and does not change the apparent\ncomposition of the sample. The only exception are very large\nproteins (.150 kDa), for which partial loss or degradation occur\nduring the precipitation procedure. Figure 6B shows that the\nprecipitation removes the SDS sufficiently for analysis using non-\nSDS compatible two-dimensional gel systems.\nDISCUSSION\nA new alkaline\/SDS extraction procedure has been developed that\ncan quantitatively solubilize and extract the large majority of yeast\nproteins. This is demonstrated by observations that the apparent\nextraction efficiency for total protein could not be increased when\nextraction conditions were systematically altered, that re-extraction\nof the cell pellets with alternative methods yielded very few\nadditional bands, and that direct probing for protein remaining in\nthe cells using a fluorescent protein stain showed a drop in\nfluorescence by more than 95 per cent following extraction.\nFigure 4. Extraction is near complete for the majority of proteins. (A) Yeast cells were extracted in a first round with the procedure described in\nfigure 1 and recovered. They were then subjected to a second round of extraction either by boiling in sample buffer also containing 8 M Urea (sample\n‘‘Urea’’), by glass bead lysis followed by boiling in normal sample buffer (sample ‘‘Glass Beads’’), or by glass bead lysis followed by boiling in sample\nbuffer also containing 8 M Urea (sample ‘‘Glass Beads, Urea’’). Note that the second extracts are twice concentrated with respect to the first extract.\n(B) Western blotting analysis of samples from panel A. The western blot using anti-Sup35 antibodies confirms that this particular protein requires\nUrea for efficient extraction. In contrast, other individually tested proteins were not recovered by a second Urea-based extraction (Pgk1p is shown\nhere as a representative example). (C) The total protein content of mock-extracted and extracted yeast cells was visualized by staining with the\nfluorescent protein stain Sypro Red. The Sypro Red Signal drops by .95% following application of the extraction procedure.\ndoi:10.1371\/journal.pone.0001078.g004\nQuantitative Yeast Proteomics\nPLoS ONE | www.plosone.org 5 October 2007 | Issue 10 | e1078\nOur data also clearly show that extraction of individual proteins\ncan proceed in ways that are very different from extraction of the\nbulk proteome. Despite many attempts to alter the conditions in\nways that would allow quantitative extraction of all proteins, the\nsolubilization of some proteins always required conditions that\ndestabilized others. For quantifying individual proteins, a routine\nstarting point should therefore be the assessment of different\nextraction procedures, including different solubilizing agents and\nmechanical disruption. However, proteins that are not maximally\nextracted when using SDS as sole solubilizing agent represent\na minority of protein species. For simultaneous large scale (i.e.,\nproteome-wide) quantifications, extraction using these conditions\nwill therefore yield the most accurate results for the majority of\nproteins.\nThe molecular causes underlying poor extraction for some\nproteins remain to be established. The fact that cell wall structures\nremain intact during the extraction procedure (Figure 4C) suggests\nthat proteins must diffuse across them during extraction. Since\nphysical disruption of the remaining cell wall structures generates\na few additional bands on SDS-PAGE gels (figure 4A), this\ndiffusion process may be limiting for some gene products.\nHowever, extraction of much larger proteins than the ones\nliberated by physical breakage proceeds efficiently using alkaline\nextraction only (figure 4A), so that these species must constitute\nsome special case in terms of their extraction requirements.\nIt should be noted that there are two known types of covalently\ncell-wall associated proteins in S. cerevisiae, namely those linked to\nthe b-1,3-glucan matrix through an unknown alkali-sensitive\nlinkage, and those linked to the same matrix in a glycosylpho-\nsphatidylinositol- (GPI-) dependent manner [8]. Of these, the\nformer should be readily released during the alkaline incubation\nstep, whereas the latter can normally only be released from cell\nwalls by enzymatic destruction of the covalent linkage. It is\ntherefore unlikely that the protein species liberated after physical\nbreakage correspond to conventional cell wall proteins.\nEspecially difficult to understand is the varying extraction\nefficiency observed for Rpl25p, Sup45p and Sup35p. All three\nproteins are presumed to be soluble and to show a cytoplasmic\nlocalization [9]. Rpl25p is a large ribosomal subunit protein that is\nnot known to be tightly associated with any cellular structures, and\nRpp0p, another protein component of the large ribosomal\nsubunit, is efficiently extracted using only SDS as solubilizing\nagent. One of the differences between these two proteins is that\nRps25p makes strong direct contacts with the ribosomal RNA and\nFigure 5. Yeast Protein extraction in 96 well format. Different yeast strains were grown in a 96 well plate format, followed by protein extraction and\ngel electrophoretic analysis in the same format. (A) Shows the western blot for a 364 well section from the 96 well plate. Pgk1p and Sup35p were\ndetected simultaneously by mixing the respective antibodies. Note that the 96 well electrophoresis system employed here uses a staggered row\nformat, hence the change in alignment between the different rows. The three columns correspond to three strains with different Sup35p expression\nlevels (see text for further explanation). (B) Box plot summarizing variability of the Sup35p abundance data generated from all 24 wells for each strain.\nSup35p levels were normalized to Pgk1 levels. Indicated are the mean (central line in the boxes and numbers above the boxes), 25th\/75th percentiles\n(box limits), and 10th\/90th percentiles (feathers).\ndoi:10.1371\/journal.pone.0001078.g005\nFigure 6. Post-processing of samples for non-SDS compatible\napplications. (A) A protein extract was prepared, split in half and one\nhalf directly applied to an SDS-PAGE gel. The other half was methanol-\nprecipitated, resuspended in the same volume of SDS-PAGE sample\nbuffer as the non-precipitated sample, and then applied to the same\ngel. The identical band patterns for the two samples indicate that\nsamples can be precipitated and resuspended without any apparent\nloss of proteins, with the exception of very large proteins (.150 kDa)\nwhich appear to be partially lost or degraded during the precipitation\nprocedure. (B) 25 mg of precipitated protein (representing ,16107\ncells) were subjected to two-dimensional gel electrophoresis in order to\ndemonstrate the suitability of this procedure for efficient SDS removal.\ndoi:10.1371\/journal.pone.0001078.g006\nQuantitative Yeast Proteomics\nPLoS ONE | www.plosone.org 6 October 2007 | Issue 10 | e1078\nis part of the large ribosomal subunit core [10], whereas Rpp0 is\nmore peripherally associated with this complex [11]. It may thus\nbe the detachment from a tightly associated rRNA-protein\ncomplex that limits solubilization of Rps25p and that requires\ndeoxycholate as additional detergent.\nSup45p and Sup35p are translation termination factors that act\non ribosomes containing stop codons in their A-site, catalyzing\nrelease of the nascent polypeptide [12]. Sup35p can exist in an\naggregated prion form in S. cerevisiae [13], however, the strain used\nin this study has no such prion-type aggregates (data not shown).\nMoreover, although prion aggregates are resistant to treatment\nwith SDS at room temperature, they can normally be disrupted by\nboiling in 2% SDS [14]. Nevertheless, the fact that additional\nSup35p was released from SDS-extracted cells by re-solubilizing in\nurea, but not by physically destroying the cell wall structures and\nre-solubilizing in the absence of urea, suggests that the problem\nwith Sup35p extraction lies in the solubilization of this protein,\nrather than in liberation of the protein from the cell structures\nonce solubilization has occurred.\nIn conclusion, this study describes a novel protein extraction\nprocedure for Saccharomycetes yeasts that combines several desirable\naspects. Proteins are denatured very rapidly following cell harvest,\nthus minimizing proteome alterations during the extraction pro-\ncedure. The majority of proteins are quantitatively solubilized, and\nthe number of extracted cells can be determined very accurately,\nthus forming an ideal basis for the absolute quantification of protein\ncontent per cell. Samples are easily post-processed for non-SDS\ncompatible applications, thus making the procedure widely\napplicable. Lastly, the fact that relatively little manual intervention\nis required for the preparation of extracts allowed us to develop\na novel high-throughput version of this procedure.\nMATERIALS AND METHODS\nYeast strains and growth conditions\nS. cerevisiae BY4741 (MATa leu2-D0 met15-D0 ura3-D0 his3-D0)[15]\nwas grown in liquid rich medium (2% glucose, 1% peptone, 1%\nyeast extract) and harvested from logarithmically growing cultures\n(oD600#1) except where otherwise stated.\nPreparation of yeast extracts\nThe basic extraction procedure is described in detail in the Results\nsection and in figure 1. For the re-extraction experiments, cells that\nhad been subjected to a first extraction procedure were pelleted,\nwashed briefly with 200 ml of 0.1% SDS, and re-extracted as\ndescribed. For mechanical disruption, cells were resuspended in\n200 ml of SDS sample buffer. 1 volume of glass beads was added, and\nthe samples beaten in a Precellys 24 bead beater (Stretton Scientific\nLtd., 3 cycles of 30 seconds beating, 30 seconds pause).\nGel electrophoresis and western blotting were carried out using\nstandard procedures [16,17]. Protein gels were incubated in\nSYPRO Red stain (Invitrogen) and visualized using an FLA5200\nlaser scanner (Fuji). Western blots were performed using FITC-\nlabeled secondary antibodies (Sigma Aldrich), and were scanned\non the same instrument.\nMicroscopy\nCells were pelleted, washed briefly in 200 ml of 0.1% SDS and\nincubated in 1 ml of 5% formaldehyde at room temperature for\n30 minutes. Cells were then resuspended in 1 ml of 0.01% SDS\ncontaining SYPRO Red stain at a dilution of 1:5000, and\nobserved under a fluorescence microscope.\nExtraction in 96-well plate format\nWells of a 96 well deep-well plate (2 ml well capacity, Whatman)\nwere filled with 600 ml of medium and inoculated with the\ndifferent yeast strains. Following overnight growth, 50 ml of culture\nper well were transferred to a fresh microtitre plate, and the oD595\nwas determined using a 96 well plate reader. 250 ml of culture per\nwell were then transferred to a 96 well microfilter plate (0.45 m\ncellulose acetate, Whatman), and centrifuged at 2500 g for\n5 minutes. The filtrate was discarded, and the last step was\nrepeated once with 250 ml of additional culture to bring the total\nvolume of harvested culture to 500 ml. For lysis, yeast cells were\nrecovered from the filter surfaces by resuspension in 45 ml of buffer\n1 lacking SDS but also containing 8 M Urea (i.e. 8 M Urea, 0.1 N\nNaOH, 0.05 M EDTA, 2% 2-mercaptoethanol). SDS was omitted\nfrom this buffer and only added in the subsequent step because\nexcessive foaming was observed when trying to resuspend the cells\nin its presence. 8 M Urea was included because we wanted to\ndetermine the levels of Sup35p in the extracts, which requires this\ncompound for efficient solubilization (see the results section for\ndetails).\nResuspended cells were mixed with 5 ml of 20% SDS in the\nwells of a 96-well PCR plate, and heated to 90uC for 10 minutes in\na thermocycler. The uncleared lysates were directly transferred to\nthe wells of a 96-well protein electrophoresis gel (E-PAGE 96,\nInvitrogen), resolved and transferred onto nitrocellulose mem-\nbrane using a dry blotting format (iBlot, Invitrogen). Detection of\nproteins was performed as for mini-gel based western blots.\nACKNOWLEDGMENTS\nThe author would like to thank Prof. Mick F. Tuite and Dr. C. Mark\nSmales (both University of Kent, Canterbury, UK) for generously making\navailable antibodies and for performing the two-dimensional gel analysis.\nAuthor Contributions\nConceived and designed the experiments: Tv. Performed the experiments:\nTv. Analyzed the data: Tv. Contributed reagents\/materials\/analysis tools:\nTv. Wrote the paper: Tv.\nREFERENCES\n1. Futcher B, Latter GI, Monardo P, McLaughlin CS, Garrels JI (1999) A sampling\nof the yeast proteome. Mol Cell Biol 19: 7357–7368.\n2. Ghaemmaghami S, Huh WK, Bower K, Howson RW, Belle A, et al. (2003)\nGlobal analysis of protein expression in yeast. Nature 425: 737–741.\n3. Lu P, Vogel C, Wang R, Yao X, Marcotte EM (2007) Absolute protein\nexpression profiling estimates the relative contributions of transcriptional and\ntranslational regulation. Nat Biotechnol 25: 117–124.\n4. Newman JR, Ghaemmaghami S, Ihmels J, Breslow DK, Noble M, et al. (2006)\nSingle-cell proteomic analysis of S. cerevisiae reveals the architecture of biological\nnoise. Nature 441: 840–846.\n5. Kushnirov VV (2000) Rapid and reliable protein extraction from yeast. Yeast\n16: 857–860.\n6. Stark GR, Stein WH, Moore S (1960) Reactions of the Cyanate Present in\nAqueous Urea with Amino Acids and Proteins. J Biol Chem 235: 3177–3181.\n7. Wessel D, Flugge UI (1984) A method for the quantitative recovery of protein in\ndilute solution in the presence of detergents and lipids. Anal Biochem 138:\n141–143.\n8. Klis FM, Boorsma A, De Groot PW (2006) Cell wall construction in\nSaccharomyces cerevisiae. Yeast 23: 185–202.\n9. Huh WK, Falvo JV, Gerke LC, Carroll AS, Howson RW, et al. (2003) Global\nanalysis of protein localization in budding yeast. Nature 425: 686–691.\n10. El-Baradi TT, Raue HA, De Regt CH, Planta RJ (1984) Stepwise dissociation of\nyeast 60S ribosomal subunits by LiCl and identification of L25 as a primary 26S\nrRNA binding protein. Eur J Biochem 144: 393–400.\nQuantitative Yeast Proteomics\nPLoS ONE | www.plosone.org 7 October 2007 | Issue 10 | e1078\n11. Remacha M, Jimenez-Diaz A, Santos C, Briones E, Zambrano R, et al. (1995)\nProteins P1, P2, and P0, components of the eukaryotic ribosome stalk. New\nstructural and functional aspects. Biochem Cell Biol 73: 959–968.\n12. von der Haar T, Tuite MF (2007) Regulated translational bypass of stop codons\nin yeast. Trends Microbiol 15: 78–86.\n13. Tuite MF, Cox BS (2006) The [PSI+] prion of yeast: a problem of inheritance.\nMethods 39: 9–22.\n14. Chernoff YO, Lindquist SL, Ono B, Inge-Vechtomov SG, Liebman SW (1995)\nRole of the chaperone protein Hsp104 in propagation of the yeast prion-like\nfactor [psi+]. Science 268: 880–884.\n15. Brachmann CB, Davies A, Cost GJ, Caputo E, Li J, et al. (1998) Designer\ndeletion strains derived from Saccharomyces cerevisiae S288C: a useful set of strains\nand plasmids for PCR-mediated gene disruption and other applications. Yeast\n14: 115–132.\n16. Laemmli UK (1970) Cleavage of structural proteins during the assembly of the\nhead of bacteriophage T4. Nature 227: 680–685.\n17. Towbin H, Staehelin T, Gordon J (1979) Electrophoretic transfer of proteins\nfrom polyacrylamide gels to nitrocellulose sheets: procedure and some\napplications. Proc Natl Acad Sci U S A 76: 4350–4354.\nQuantitative Yeast Proteomics\nPLoS ONE | www.plosone.org 8 October 2007 | Issue 10 | e1078\n"}