{"doi":"10.1063\/1.1611635","coreId":"138099","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1231","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1231","10.1063\/1.1611635"],"title":"Strain behavior of thin film PbZr0.3Ti0.7O3 (30\/70) examined through piezoforce microscopy.","authors":["Dunn, Steve"],"enrichments":{"references":[{"id":38113426,"title":"Applied Physics Letters,","authors":[],"date":"1999","doi":"10.1063\/1.124822","raw":"Alexe, M., et al., Applied Physics Letters, 1999. 75(8): p. 1158.","cites":null},{"id":38113427,"title":"Ferroelectric Thin Films VI;","authors":[],"date":"1998","doi":"10.1016\/s0040-6090(97)00270-8","raw":"Gruverman, A., et al., Ferroelectric Thin Films VI; Materials Research Society Symposium Proceedings, 1998. 493: p. 53-58.","cites":null},{"id":38113419,"title":"Integrated Ferroelectrics,","authors":[],"date":"1999","doi":"10.1080\/10584589908210137","raw":"Zhang, Q., et al., Integrated Ferroelectrics, 1999. 23(1): p. 215-228.","cites":null},{"id":38113428,"title":"Microelectronics and Reliability,","authors":[],"date":"1996","doi":"10.1016\/0026-2714(96)00193-x","raw":"Wouters, D.J. and H.E. Maes, Microelectronics and Reliability, 1996. 36(11-12): p. 1763-1766.   13","cites":null},{"id":38113425,"title":"Sensors and Actuators A: Physical,","authors":[],"date":"1996","doi":"10.1016\/s0924-4247(95)01196-x","raw":"Luginbuhl, P., et al., Sensors and Actuators A: Physical, 1996. 54(1-3): p. 530-","cites":null},{"id":38113424,"title":"Solid State Communications,","authors":[],"date":"2001","doi":"10.1016\/s0038-1098(01)00236-8","raw":"Zhang, J., et al., Solid State Communications, 2001. 118(5): p. 241-246.   12","cites":null},{"id":38113429,"title":"Thin Solid Films,","authors":[],"date":"2000","doi":"10.1016\/s0040-6090(00)01378-x","raw":"Li, A., et al., Thin Solid Films, 2000. 375(1-2): p. 220-223.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-11","abstract":"Using an atomic force microscope (AFM) modified to perform PiezoAFM we have\ninvestigated the piezoelectric response of sol-gel thin film lead zirconate titanate (PZT 30\/70, PbZr0.3Ti0.7O3) on Pt-Ti\/SiO2\/Si to a quasi DC electric field. The films were produced by spin coating a PZT 30\/70 sol onto a selected substrate and firing at 520ºC. This generated a film that was highly [111] orientated and single phase perovskite. By applying a sinusoidal 2Hz AC waveform between the AFM cantilever and ground we have generated strain-field, or butterfly loops for the PZT film. PiezoAFM butterfly loops show that the localised piezoelectric response for PZT varies depending on the sign of the applied field. The degree of asymmetry in the hysteresis loop has been attributed to\ncharge trapping at the electrode-PZT interface generating a system that can\npreferentially re-pole in one direction. The charge trapped at the interface has an\noverwhelming effect on the polarisability of the film. Coercive fields have been calculated from the minimum point of the strain before reversal for the system and are shown to be -30V\/μm and +32V\/μm in absolute terms and -23V\/μm and +39V\/μm in terms relative to the charge trapped at the electrode interface. δ33 values obtained for the PZT thin film 2 investigated ranged from 30 to 40pm\/V. The maximum strain of the system was shown at applied biases of +\/-10V and was 0.3% at a bias of +10V, although at this field the sample was not showing saturated behaviour. By relating the offset of the butterfly loops to the charge density generated by defects at the PZT-electrode interface, calculated to\nbe 0.025Cm-2, an estimate of the number of defects at the interface has been drawn.\nThe concentration of defects at the interface is 1 defect for every 6nm2 of surface, representing 1 defect for every 40 unit cells or 2.5% of unit cells being defected","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138099.pdf","fullTextIdentifier":"https:\/\/dspace.lib.cranfield.ac.uk\/bitstream\/1826\/1231\/3\/Strain%20behaviour-thin%20film%20PZT%2030-70-2003.pdf","pdfHashValue":"0496e54bb09e04d7fd8c504548e6cf8cad1f63a9","publisher":"American Institute of Physics","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1231<\/identifier><datestamp>2009-03-31T11:49:43Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Strain behavior of thin film PbZr0.3Ti0.7O3 (30\/70) examined through piezoforce microscopy.<\/dc:title><dc:creator>Dunn, Steve<\/dc:creator><dc:description>Using an atomic force microscope (AFM) modified to perform PiezoAFM we have\ninvestigated the piezoelectric response of sol-gel thin film lead zirconate titanate (PZT 30\/70, PbZr0.3Ti0.7O3) on Pt-Ti\/SiO2\/Si to a quasi DC electric field. The films were produced by spin coating a PZT 30\/70 sol onto a selected substrate and firing at 520ºC. This generated a film that was highly [111] orientated and single phase perovskite. By applying a sinusoidal 2Hz AC waveform between the AFM cantilever and ground we have generated strain-field, or butterfly loops for the PZT film. PiezoAFM butterfly loops show that the localised piezoelectric response for PZT varies depending on the sign of the applied field. The degree of asymmetry in the hysteresis loop has been attributed to\ncharge trapping at the electrode-PZT interface generating a system that can\npreferentially re-pole in one direction. The charge trapped at the interface has an\noverwhelming effect on the polarisability of the film. Coercive fields have been calculated from the minimum point of the strain before reversal for the system and are shown to be -30V\/μm and +32V\/μm in absolute terms and -23V\/μm and +39V\/μm in terms relative to the charge trapped at the electrode interface. δ33 values obtained for the PZT thin film 2 investigated ranged from 30 to 40pm\/V. The maximum strain of the system was shown at applied biases of +\/-10V and was 0.3% at a bias of +10V, although at this field the sample was not showing saturated behaviour. By relating the offset of the butterfly loops to the charge density generated by defects at the PZT-electrode interface, calculated to\nbe 0.025Cm-2, an estimate of the number of defects at the interface has been drawn.\nThe concentration of defects at the interface is 1 defect for every 6nm2 of surface, representing 1 defect for every 40 unit cells or 2.5% of unit cells being defected.<\/dc:description><dc:publisher>American Institute of Physics<\/dc:publisher><dc:date>2006-11-15T16:12:26Z<\/dc:date><dc:date>2006-11-15T16:12:26Z<\/dc:date><dc:date>2003-11<\/dc:date><dc:type>Postprint<\/dc:type><dc:format>128362 bytes<\/dc:format><dc:format>application\/pdf<\/dc:format><dc:identifier>S. Dunn. Strain behavior of thin film PbZr0.3Ti0.7O3 (30\/70) examined through piezoforce microscopy. Journal of Applied Physics, Vol. 94, No. 9, November 2003, pp. 5964-5968<\/dc:identifier><dc:identifier>0021-8979<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/1231<\/dc:identifier><dc:identifier>http:\/\/www.ebsco.com\/home\/<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1063\/1.1611635<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0021-8979","issn:0021-8979"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":[],"subject":["Postprint"],"fullText":" 1\nStrain behaviour of thin film PZT (30\/70) examined through Piezo-\nforce microscopy (P-AFM) \n \n \n \nS. Dunn* \n \n \nBuilding 70, Nanotechnology, Cranfield University, Cranfield, MK43 0AL, UK \n \n* corresponding author;  S Dunn, s.c.dunn@cranfield.ac.uk \n \n \nAbstract \n \nUsing an atomic force microscope (AFM) modified to perform PiezoAFM we have \ninvestigated the piezoelectric response of sol-gel thin film lead zirconate titanate (PZT \n30\/70, PbZr0.3Ti0.7O3) on Pt-Ti\/SiO2\/Si to a quasi DC electric field. The films were \nproduced by spin coating a PZT 30\/70 sol onto a selected substrate and firing at 520ºC. \nThis generated a film that was highly [111] orientated and single phase perovskite. By \napplying a sinusoidal 2Hz AC waveform between the AFM cantilever and ground we \nhave generated strain-field, or butterfly loops for the PZT film. PiezoAFM butterfly loops \nshow that the localised piezoelectric response for PZT varies depending on the sign of \nthe applied field. The degree of asymmetry in the hysteresis loop has been attributed to \ncharge trapping at the electrode-PZT interface generating a system that can \npreferentially re-pole in one direction. The charge trapped at the interface has an \noverwhelming effect on the polarisability of the film. Coercive fields have been calculated \nfrom the minimum point of the strain before reversal for the system and are shown to be \n-30V\/μm and +32V\/μm in absolute terms and -23V\/μm and +39V\/μm in terms relative to \nthe charge trapped at the electrode interface. δ33 values obtained for the PZT thin film \n 2\ninvestigated ranged from 30 to 40pm\/V. The maximum strain of the system was shown \nat applied biases of +\/-10V and was 0.3% at a bias of +10V, although at this field the \nsample was not showing saturated behaviour. By relating the offset of the butterfly loops \nto the charge density generated by defects at the PZT-electrode interface, calculated to \nbe 0.025Cm-2, an estimate of the number of defects at the interface has been drawn. \nThe concentration of defects at the interface is 1 defect for every 6nm2 of surface, \nrepresenting 1 defect for every 40 unit cells or 2.5% of unit cells being defected. \n \nIntroduction \n \nFerroelectric materials such as lead zirconate titanate (PbZrxTi1-xO3, PZT) have been \nundergoing increasing study in recent years, as their suitability for use in non-volatile \nmemories1-3 and other MEMS4-8 applications has been recognised. The development of \ntechniques, such as sol-gel, that allow the production of very highly orientated thin film \nPZT at temperatures compatible with standard Si fabrication techniques has further \nenhanced this interest9-13. For devices to be made successfully the ferroelectric material \nproduced should be high quality with a minimum of rosettes and, for many applications, \nhighly [111] orientated14. The generation of a ferroelectric material that is highly \nrepeatable in terms of ferroelectric performance is very desirable. \n \nThe scale of interest for the grain and domain structures is now sub-micron15. Standard \nanalytical techniques do not allow the determination of ferroelectric properties at this \nscale. The development of atomic force microscopy has allowed the routine evaluation \nof surface topography of these materials, and in the last few years a number of \nadditional techniques have been developed. Prime among these for determining the \n 3\nferroelectric properties of a material is piezoelectric atomic force microscopy (P-AFM)16-\n20. P-AFM detects the converse piezoelectric response of the material under \ninvestigation and allows the mapping of the ferroelectric domains, the generation of \nhighly localised hysteresis loops and the production of strain-field (butterfly) loops. The \nuse of an AFM tip as a small and moveable conductive probe has reduced the scale of \nthe study of piezoelectricity to just a few tens of nanometers. Using P-AFM it is possible \nto map ferroelectric domains in a film without a top electrode and without altering them21, \n22. The technique described in this paper also allows the strain behaviour of the material \nto be determined in the absence of a top electrode with the obvious advantages that the \nsample can be reworked and the possibility of having the same top electrode structure \nas that on the bottom. This advantage allows for electrodes with the same work function \nto be evaluated and hence asymmetry in hysteresis loops is not caused by preferential \ninjection of electrons but by inherent features of the films. \n \nWhen the drive voltage applied to the sample is stepped from one drive amplitude (such \nas 5V to 6V) to another the sample was left for a period of between 10 and 15 minutes in \norder to eliminate drift. Drift in the image obtained was always seen for the first few \nminutes after changing the drive voltage. \n \nExperimental \n \nA schematic of the experimental arrangement used to perform PFM is shown in Figure \n1. A sinusoidal voltage was passed between the AFM tip and the back electrode of the \nPZT sample, usually held at ground. The signal used in all cases was 2Hz with a \nvariation in the amplitude (from -10V to +10V) to investigate the displacement generated \nin the sample. During the experiment the scan size was set to 0nm in order to remove \n 4\nany topographic variation from the z-axis displacement with a scan rate of 2Hz. The \ndisplacement of the sample surface due to the applied field was directly interpreted from \nthe z-axis scale of the microscope. The microscope used was a Digital Instruments 3000 \nsystems with series III controller. The variation in the z-axis displacement was plotted \nagainst the applied field and can be interpreted as a typical strain\/field plot for the \nsample. In this paper we use the term δ33 to describe the piezoelectric response of the \nferroelectric film under investigation. The tips used for the experiment were standard \noxide sharpened Si probes with a spring constant of 0.02 to 0.1 N\/m. These tips where \ncoated with Ti(2nm)\/Pt(5nm) in order to generate the same electrode structure on the tip \nas the back electrode of the ferroelectric sample. Great care was taken during the \nelectroding of the tips to ensure that they were free of stress. PZT films with x = 0.3 (PZT \n30\/70) were prepared using a sol-gel technique that has been described previously23, 24. \nThe films were fired at two temperatures. Initially, a pyrolysis temperature of 200ºC for \n30 seconds was used.  A final phase transformation temperature of 520ºC with a dwell \nof 5 minutes completed the transformation to the perovskite phase. \n \nResults and discussion \n \nCalculation of piezoelectric constants \n \nAn example of a typical ‘’Scope trace’ capture obtained from the microscope is shown in \nFigure 2. The ‘scope trace represents z-axis displacement against applied AC drive \nvoltage for the PZT which the SPM generates for one line of scanning in the fast scan \ndirection. There are two lines on the trace as the SPM captures both a trace and retrace \nscan. For this experiment the scan size has been set to 0nm, and so the y-axis of the \nscope trace is equivalent to time. The variation in the z-axis displacement obtained from \n 5\nthe surface of the sample is the true variation in displacement that the surface is \nexhibiting due to the converse piezoelectric effect. The lack of noise and drift in the \nsample is typical of a sample that has been allowed to stabilise for ca. 15 minutes after a \nvariation in the applied field. The image was obtained at +\/- 10V and 2Hz and shows that \nthe cantilever is displaced by approximately 0.6nm during each cycle.  The low value of \nthis displacement along with the asymmetry in the response to the positive and negative \napplied fields is in contrast to the result shown in Figure 3. The displacement of the \ncantilever in Figure 3 is not being driven by the converse piezoelectric effect but by \nelectrostatic repulsion between the cantilever and the surface. The large displacements \n(+\/- 25nm) for a film that is 500nm thick are indicative of a sample that has a poor tip-\nsurface contact or is not correctly grounded. Figure 4 shows a typical scope trace that is \nobtained when the sample is cycled through +\/- 7V at 2Hz and shows the increased \nnoise due to the lower amplitude of displacement of the cantilever. Figure 4 also shows \na significant amount of drift in the signal over time, this capture was taken after only 1 \nminute after a change in applied bias and is typical of the signal obtained before the \nsystem has stabilised. \n \nFigure 5 presents a set of ‘butterfly loops’ for the PZT sample. Where, the applied bias is \nvaried from +\/-7 to +\/- 10V. It was not possible to get data for a sample being driven with \na bias of +\/-6V, because the data was swamped by the noise in the system. The loops \nshow that even at the applied biases of +\/- 10V the ferroelectric material is not saturating \nand that a full loop is starting to form at biases of +\/-8V, or more. The displacement of \nthe ‘butterfly loops’ with respect to the origin in the field axis is believed to be due to the \ntrapped charge at the electrode-PZT interface. There has been much speculation in the \nliterature as to the exact nature of the trapped charge at the interface8, 25-30. It is generally \nagreed that this charge takes the form of oxygen defects, generating an inherent positive \n 6\ncharge at the interface. The variation in coercive field found in this work, and the \nassociated variation in shape of the butterfly loops, supports that theory. When applying \na positive field to the top surface of the PZT the initial orientation of dipoles is positive \nup. The negative end of the dipole (towards the bottom electrode) is stabilised by the \npositive field at the electrode interface meaning that the coercive field is higher. In \nabsolute terms, the coercive field is found to be similar for both negative and positive \nfields (ca.30V\/μm). However, when the displacement in electric field due to the positive \nelectric field at the back electrode is considered, the coercive fields become +39V\/μm \nand -23V\/μm. The values obtained lie close to those for other PZT films grown on similar \nsubstrates that have been examined using either PFM and on Radiant Technologies \nequipment. These values, of coercive field, reflect the sensitivity of the dipoles in the \ndomains to all external electric fields, including those generated at the electrode PZT \ninterface. The maximum strain achieved for the sample was ca 0.3% at +10V of applied \nbias. This value is consistent with that expected for a fully clamped PZT thin film.  \n \nIt is interesting to note that the point at which the butterfly loop crosses itself varies as a \nfunction of applied bias. There is no shift in this ‘origin’ position until biases of 9V, or \nmore, are applied. After this bias the ‘origin’ point shifts to the right, indicating that there \nis a reduction in the bias at the interface. The sample was run for a number of cycles (10 \nminutes or more) at each bias and the data shown represents a ‘capture’ that was made \ntowards the end of the cycling period. No estimate can be made as to the dynamics of \nthe inherent bias movement but it is interesting that as the sample begins to show fully \nopen loops the inherent bias of the sample shifts to a more neutral position. This may be \nassociated with the increase in the applied field which is capable of moving defects \n 7\nthrough the lattice and thereby reducing the density of the defects. Or it may be due to a \nrestructuring of the crystal after reversal of the domains and polling in both directions.  \n \nThe relative ‘openness’ of the loop, which is found to be more open and nearer \nsaturation for the positive applied field indicates that the mechanism dictating domain \nreversal lies more in the nucleation kinetics\/dynamics than on the absolute field applied. \nThe reason for this is that the effective field applied during the negative bias cycle is \nlarger than during the positive cycle. The potential difference between a plate held at a \npositive bias and a negative electrode is higher than that between a plate held at ground \nand the same negative electrode, but the strain developed in the system and the degree \nof openness of the loops is less for negative cycles than positive ones.  \n \nIt is possible to use a butterfly loop to determine the piezoelectric coefficients for a \nsample. In this case we do not give the piezoelectric coefficients as d33 values but as δ33 \nas the method for analysis does not strictly conform to IEEE standards. By plotting the \nregion of the butterfly loop that has a constant slope when crossing the 0 applied bias \nregion it is possible to determine the d33 from the slope. In this case the slope of the plot \nis equivalent to the δ33 for the sample. This has been done for all four applied bias’s and \nis shown in Table 1, indicating that the δ33 for the samples lie around 40pm\/V. Previous \nwork, PFM and Berlincourt, have shown that the d33 for the samples lies between 60 and \n40pm\/V, hence this result ties in very nicely.  \n \nThe values of the strain induced in the sample and the calculated δ33 value indicate that \nthe sample is not being significantly clamped by the SPM cantilever. The cantilever used \nhas a low spring constant and so is not exerting a large force on the surface of the \n 8\nsample; the sample is therefore able to displace the cantilever a distance that is close to \nthe ‘open circuit’ values. If the cantilever was significantly restricting the movement of the \nsurface then the values of strain and δ33 would be reduced with respect to those \nobtained from other techniques.  \n \nA standard hysteresis loop for a similar sample of PZT (poled positive up) is shown in \nFigure 6. This hysteresis loop was obtained using a Radiant Technologies P\/E machine \nand shows all the characteristics of a standard thin film ferroelectric material. The values \nfor piezoelectric constant (40pm\/V) are very similar to those obtained using the PFM \ntechniques. Using a similar technique employed for the ‘butterfly’ loops the bias in the \nfilm can be calculated due to the offset of the hysteresis loop. In this case the hysteresis \nloop is found to be biased towards a negative applied field by 0.94 V\/μm. Using this \nfigure the coercive fields for the film as analysed by the Radiant Technologies technique \nare -11.6 V\/μm and 12.5 V\/μm. The slightly higher value for the positive coercive field is \nexpected from the arguments given earlier in this paper. The difference in the positive \nand negative applied fields is lower than seen for the sample probed with the SPM \ncantilever. There are a number of possible reasons why this might be the case, the most \nimportant one is likely to be that the sample used to generate the P\/E loop had been \npoled. The fields used to pole the sample could be high enough to displace the charge at \nthe interfacial region. The procedure of poling the sample may make the charge at the \ninterface of ferroelectric material and electrode become more dispersed and therefore \nreside over a larger volume.  \n \nCalculation of defect concentration at back electrode-PZT interface \n \n 9\nThe offset, along the field axis, in the butterfly loops is a direct result of the imposed \ncharge at the back electrode-PZT interface. The values of the charge density at the back \nelectrode have been calculated for the applied biases of +\/-10V.  Given that; \n Es = σ\/εε0  Equation 1 \nWe can calculate the charge density at the interface of the PZT and electrode. By \nintroducing the values of the known variables into Equation 1, where ε is approximately \n300 for PZT (30\/70), ε0 is 8.85 x 10-12 and σ is 8V\/μm we can determine the charge \ndensity to be 0.025Cm-2. This compares to a charge density of ca. 0.3Cm-2 for the \nsurface of poled PZT, this value is consistent with a fully charged surface. The relatively \nlarge value of the charge density at the interface compared with the surface of a fully \npoled and therefore charged material indicates why such large variations in the coercive \nfield are obtained when driving the sample negatively and positively. Furthermore it is \npossible to determine the concentration of defects that are generating such a charge \ndensity at the electrode-PZT interface. A charge density of 0.025Cm-2 is roughly \nequivalent to one unit of charge per 6nm2, or one charge for every 40 unit cells of the \nPZT at the interface. This assumes that the defect charge resides at or along the \ninterface plane. As the charge concentration is likely to be associated with a defect in the \ncrystal lattice then it is possible to assume that 2.5% of unit cells in the interfacial region \nare defected. The region that contains these charge defects is going to be the unit cells \nof PZT that are closest to the electrode-PZT interface, indeed the 2.5% of defected cells \ncould be those that are on the interface. This large number of defects will have a very \nlarge affect on the fatigue and other fundamental properties of the sample. Other studies \nhave shown that PZT grown in the structure examined is indeed prone to early fatigue \nand failure, when compared to PZT grown on electrodes that are oxygen donating. The \neffect of the oxygen donating electrodes is believed to reduce the number of oxygen \n 10\ndefects at the interface by allowing migration of oxygen during the generation of the \nperovskite phase. \n \nThe effect of such a large number of defected unit cells in the crystal would indicate that \nthere is a large strain at the electrode-PZT interface. This strain will be released during \ncycling at fields above the coercive but the defects are unlikely to reduce in number. \nThey are more likely to concentrate at boundaries, voids or other crystal defects where \nthe effect will be, initially, to increase the energy required for domain reversal followed by \na locking of the domains in the orientation of last the complete cycle.  \n \nConclusions \n \nThe paper shows that it is possible to use PFM to determine the strain behaviour of a \nthin film even when the surface is being displaced through only a few hundreds of pm. \nThe sensitivity of the technique to stray fields associated with those inherent in the \nsample means that it is possible to make an estimate, using the displacement of the \nhysteresis loops, as to the number of defected unit cells that are contributing to any \ninherent electric bias. In this case the bias at the interface was found to be ca 0.025C\/m2 \nwhich relates to 2.5% of unit cells having an oxygen defect. The polarity of the bias \nfound at the interface between the electrode and PZT was positive. This conclusion was \ndrawn as the variation in coercive field for domain reversal shows a larger positive \ncoercive field as compared to a negative field. The kinetics for domain reversal seem to \nbe more dependent on the nucleation of a new reversed domain from the interface than \non the absolute field applied to the film. The maximum strain that was achieved in the \nsample was 0.3%, with the piezoelectric constant, here quoted as, δ33 is around 30-\n 11\n40pm\/V. Both of these values are consistent with samples that have been tested on \nmore traditional equipment conforming to IEEE standards.  \n \nAcknowledgements \n \nThe author would like to thank the invaluable discussions with Dr R Dorey and J Southin \n(NOTE Mike I have not added you as an Ack in case you would like to add to the paper, \nif not then I will, naturally, ack you) and comments from Prof R Whatmore, Dr Q Zhang \nfor preparing the substrate and financial support from the McKeown foundation during \nthe research period. \n \nReferences \n \n1. Ramesh, R., S. Aggarwal, and O. Auciello, Materials Science and Engineering: \nR: Reports, 2001. 32(6): p. 191-236. \n2. Mikolajick, T., et al., 41(7): p. 947-950. \n3. Thiebaud, C., et al.,. Annales de Chimie Science des Materiaux, 2001. 26(1): p. \n145-149. \n4. Shaw, C.P., et al., Integrated Ferroelectrics, 2000. 29: p. 189-213. \n5. Shaw, C.P., et al., Integrated Ferroelectrics, 2001. 256: p. 159. \n6. Muralt, P., et al., 1995. 29(1-4): p. 67-70. \n7. Whatmore, R.W. and R. Watton, Ferroelectrics, 2000. 236(1): p. 259-279. \n8. Jiang, A.Q., et al., Journal of Applied Physics, 2002. 92(11): p. 6756. \n9. Zhang, Q., et al., Integrated Ferroelectrics, 1999. 23(1): p. 215-228. \n10. Zhang, J., et al., Solid State Communications, 2001. 118(5): p. 241-246. \n 12\n11. Ricote, J., Q. Zhang, and R.W. Whatmore, IEEE International Symposium on \nApplications of Ferroelectrics, 1998: p. 483-486. \n12. Luginbuhl, P., et al., Sensors and Actuators A: Physical, 1996. 54(1-3): p. 530-\n535. \n13. Lee, W.I. and J.K. Lee, Materials Research Bulletin, 1995. 30(10): p. 1185-1191. \n14. Zhang, Q., et al., Journal of Sol-Gel Science and Technology, 1998. 11(2): p. p \n141-152. \n15. Scott, J.F., Ferroelectrics, 2000. 236(1): p. 247-258. \n16. Dunn, S., A.P. De Kroon, and R.W. Whatmore, Journal of Materials Science \nLetters, 2001. 20: p. 179. \n17. Auciello, O., et al., MRS Bulletin, 1998. 23(1): p. 33-42. \n18. Alexe, M., et al., Applied Physics A: Materials Science and Processing, 2000. \n70(3): p. 247-251. \n19. Alexe, M., et al., Applied Physics Letters, 1999. 75(8): p. 1158. \n20. Dunn, S. and R.W.W. Whatmore, Nanotechnology, 2002. 13: p 456-459. \n21. Gruverman, A., et al., Nanotechnology, 1997. 8(3A): p. A38-A43. \n22. Gruverman, A., et al., Ferroelectric Thin Films VI; Materials Research Society \nSymposium Proceedings, 1998. 493: p. 53-58. \n23. Huang, Z., Q. Zhang, and R.W. Whatmore, Journal of Materials Science Letters, \n1998. 17(14): p. 1157-1159. \n24. Zhang, Q., R. Whatmore, and M.E. Vickers, Journal of Sol-Gel Science and \nTechnology, 1999. 15(1): p. 13-22. \n25. Zeng, J., et al., Applied Physics A: Materials Science and Processing, 1999. \n69(1): p. 93-96. \n26. Wouters, D.J. and H.E. Maes, Microelectronics and Reliability, 1996. 36(11-12): \np. 1763-1766. \n 13\n27. Scott, J.F., Ferroelectrics, 1998. 206-207(1-2): p. 365-379. \n28. Rao, A., V, S.A. Mansour, and A.L. Bement, Materials Letters, 1996. \n29(December 1996): p. 4. \n29. Li, A., et al., Thin Solid Films, 2000. 375(1-2): p. 220-223. \n30. Kim, T.S., H.-H. Park, and I.-S. Jin, Surface and Coatings Technology, 1998. \n100-101(1-3): p. 229-233. \n \n 14\nFigure Captions \n \nFigure 1; Schematic of modifications made to a standard SPM in order to complete PFM \ntype experiments. \n \nFigure 2; A captured ‘Scope trace’ indicating the surface displacement for the sample \nunder test at an applied sinusoidal bias of +\/- 10V. The image shows the surface \ndisplacement to be ca. 0.6mn and that there is very little noise introduced into the \nsystem. There is a high degree of stability in the trace which is typical of a system that \nhas been allowed to stabilise for a period of ca. 90 cycles. The horizontal axis in the \nimage is time or applied field to the film as the scan size was set to 0nm.  \n \nFigure 3; An SPM image of the resultant displacement of the tip for a sample showing \npoor tip-surface contact or poor sample grounding. The scan size is 0nm and z-scale is \n25nm. The apparent variation in topography is a direct result of the cantilever interacting \nwith the resultant electric field on the surface of the sample. The applied AC electric field \nis stepped from (at the front of the image) +\/- 0V to +\/- 10V (at the back of the image). \nPeaks in the displacement on the image coincide with peaks in the applied AC signal. \n \nFigure 4; A captured ‘Scope trace’ indicating the surface displacement for the sample \nunder test at an applied sinusoidal bias of +\/- 7V. The image shows the asymmetry \nassociated with a sample that is being driven above the coercive field in both directions \nof applied field. There is also more noise in the image which shows that the surface of \nthe sample is vibrating by ca. 300pm. The drift in the trace is symptomatic of a sample \nthat has not been allowed to stabilise after adjustment of the bias. The horizontal axis in \nthe image is time or applied field to the film as the scan size was set to 0nm.  \n 15\n \n \nFigure 5;Strain verses field plots for PZT (30\/70). The chart shows the increase in the \ndisplacement with increase in applied bias. It is possible to determine the coercive fields \nfrom this chart and at an applied bias of +10V this is shown to be +39V\/μm and -23V\/μm \nwhen standardised for displacement in the loops due to the internal field at the \nelectrode-PZT interface. The absolute values of coercive field are ca 30V\/μm. The \npiezoelectric constant of d33 can be calculated by determining the slope of the butterfly \nloop as it passes the zero applied field region. In this case the value is quoted δ33 and \nlies in the region of 30-40pm\/V. The maximum strain exhibited by the sample was shown \nto be ca. 0.3% for an applied bias of +10V. \n \nFigure 6; A hysteresis loop obtained for thin film PZT using standard technology. Figures \nof 40pm\/V, for d33, and +\/- ca.115C\/cm2, for the Ce, are typical for PZT (30\/70) grown in \nthe [111] orientation on SiO2\/Ti\/Pt when evaluated using ‘bulk’ techniques.  \n \nTable 1; d33, coercive field values for PZT (30\/70) samples measured with quasi DC \nPFM at various fields. \n \n \n \n \n \n 16\n \n \n \n \n \n \nSignal Generator\nPhoto Diodes\nLaser \nsignal \nData analysis \nBack electrode\nFerroelectric sample \nTopographic\n image\nScope trace \nTopographic analysis\n 17\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 18\n \n \n \n \n \n 19\n \n \n \n \n \n \n \n \n \n 20\n \n \n \nStrain verses applied field for PZT (30\/70)\n-0.05\n0\n0.05\n0.1\n0.15\n0.2\n0.25\n0.3\n-80 -60 -40 -20 0 20 40 60 80\nApplied field\/ (v\/μm)\nSt\nra\nin\n\/ (\n%\n)\nApplied AC signal +\/- 7V increasing to +\/- 10V in 1V steps\n \n \n \n 21\n \n \n \n \nPZT (30\/70)\n-60\n-50\n-40\n-30\n-20\n-10\n0\n10\n20\n30\n40\n50\n60\n-300 -200 -100 0 100 200 300\nField \/(kV\/cm)\nPo\nla\nri\nza\ntio\nn \n\/(C\n\/c\nm\n2 )\n \n 22\n \n \n \nApplied voltage δ33\/(pm\/V) + coercive field\/ (v\/μm) - coercive field\/ (v\/μm) \n7 30 8 n\/a \n8 28 16 18 \n9 36 16 24 \n10 41 32 30 \n \n \n \n \n"}