{"doi":"10.4067\/S0718-22442009000200012","coreId":"65269","oai":"oai:dro.dur.ac.uk.OAI2:6341","identifiers":["oai:dro.dur.ac.uk.OAI2:6341","10.4067\/S0718-22442009000200012"],"title":"Nuevas evidencias de cazadores recolectores terrestres del Holoceno medio y tardío en Tierra del Fuego : el sitio Cabo Monmouth 20.","authors":["Morello,  Flavia","Arroyo-Kalin, Manuel","Borrero,  Luis","Torres,  Jimena","Massone,  Mauricio","Cárdenas,  Pedro","Bahamonde,  Gabriel"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-01-01","abstract":"The Cabo Monmouth 20 site represents new evidence of Middle and Late Holocene occupations \\ud\n(ca. 5.000 years BP) for the north of Isla Grande, Tierra del Fuego. In this paper we evaluate archaeo-\\ud\nlogical evidence from a test pit excavation, synthesize stratigraphic and contextual data, and present a \\ud\nnew radiocarbon date (5,520 + 50 years BP) on shell material of anthropic origin. The latter confrms \\ud\nthe antiquity of the site, highlighting the presence of archaeological deposits in a co-eval palaeosol","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65269.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6341\/1\/6341.pdf","pdfHashValue":"24b40d9fb74feccb87fb6d5bad24cf33d165c4d8","publisher":"Universidad de Magallanes, Instituto de la Patagonia","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6341<\/identifier><datestamp>\n      2011-12-07T09:21:34Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Nuevas evidencias de cazadores recolectores terrestres del Holoceno medio y tardío en Tierra del Fuego : el sitio Cabo Monmouth 20.<\/dc:title><dc:creator>\n        Morello,  Flavia<\/dc:creator><dc:creator>\n        Arroyo-Kalin, Manuel<\/dc:creator><dc:creator>\n        Borrero,  Luis<\/dc:creator><dc:creator>\n        Torres,  Jimena<\/dc:creator><dc:creator>\n        Massone,  Mauricio<\/dc:creator><dc:creator>\n        Cárdenas,  Pedro<\/dc:creator><dc:creator>\n        Bahamonde,  Gabriel<\/dc:creator><dc:description>\n        The Cabo Monmouth 20 site represents new evidence of Middle and Late Holocene occupations \\ud\n(ca. 5.000 years BP) for the north of Isla Grande, Tierra del Fuego. In this paper we evaluate archaeo-\\ud\nlogical evidence from a test pit excavation, synthesize stratigraphic and contextual data, and present a \\ud\nnew radiocarbon date (5,520 + 50 years BP) on shell material of anthropic origin. The latter confrms \\ud\nthe antiquity of the site, highlighting the presence of archaeological deposits in a co-eval palaeosol.<\/dc:description><dc:subject>\n        Tierra del Fuego<\/dc:subject><dc:subject>\n         Middle Holocene<\/dc:subject><dc:subject>\n         terrestrial hunter-gatherers<\/dc:subject><dc:publisher>\n        Universidad de Magallanes, Instituto de la Patagonia<\/dc:publisher><dc:source>\n        Magallania, 2009, Vol.37(2), pp.191-203 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2009-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6341<\/dc:identifier><dc:identifier>\n        issn:0718-2244<\/dc:identifier><dc:identifier>\n        issn: 0718-2244<\/dc:identifier><dc:identifier>\n        doi:10.4067\/S0718-22442009000200012.<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6341\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.4067\/S0718-22442009000200012<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6341\/1\/6341.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 0718-2244","0718-2244"," 0718-2244","issn:0718-2244"]}],"language":{"code":"es","id":10,"name":"Spanish"},"relations":[],"year":2009,"topics":["Tierra del Fuego","Middle Holocene","terrestrial hunter-gatherers"],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n23 August 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nMorello, Flavia and Arroyo-Kalin, Manuel and Borrero, Luis and Torres, Jimena and Massone, Mauricio and\nCrdenas, Pedro and Bahamonde, Gabriel (2009) ’Nuevas evidencias de cazadores recolectores terrestres del\nHoloceno medio y tardo en Tierra del Fuego : el sitio Cabo Monmouth 20.’, Magallania., 37 (2). pp. 191-203.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.4067\/S0718-22442009000200012\nPublisher’s copyright statement:\nAdditional information:\nFunded by the Project FONDECYT 1060020 ’Arqueologa de cazadores-recolectores de Tierra del Fuego: el proceso de\ncolonizacin y el factor de aislamiento geogrfco, durante el Holoceno temprano y medio’ led by Flavia Morello (CEQUA).\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n191MAGALLANIA, (Chile), 2009. Vol. 37(2):191-203\nNUEVAS EVIDENCIAS DE CAZADORES RECOLECTORES TERRESTRES DEL HOLOCENO \nMEDIO Y TARDÍO EN TIERRA DEL FUEGO: EL SITIO CABO MONMOUTH 201\nFLAVIA MORELLO*, MANUEL ARROYO-KALIN**, LUIS BORRERO***, JIMENA TORRES****, \nMAURICIO MASSONE*****, PEDRO CáRDENAS** Y GABRIEL BAHAMONDE*\nRESUMEN\nLos hallazgos del sitio Cabo Monmouth 20 (CM20) representan nueva evidencia sobre ocupa-\nciones del Holoceno medio (ca. 5.000 años AP) y tardío, en el norte de Tierra del Fuego. Se evalúa la \ninformación recopilada en excavaciones de sondeo, sintetizando los datos estratigráficos y contextuales, \nademás de presentar un nuevo fechado realizado sobre material malacológico de origen antrópico, con \nuna datación de 5.520 + 50 años AP. Esta fecha confirma la antigüedad del sitio y la presencia de un \ndepósito arqueológico inserto en un paleosuelo coetáneo.\nPALABRAS CLAVE: Tierra del Fuego, Holoceno medio, cazadores terrestres.\nNEW EVIDENCE OF MIDDLE AND LATE HOLOCENE TERRESTRIAL HUNTER \nGATHERERS IN TIERRA DEL FUEGO: CABO MONMOUTH SITE\nABSTRACT\nThe Cabo Monmouth 20 site represents new evidence of Middle and Late Holocene occupations \n(ca. 5.000 years BP) for the north of Isla Grande, Tierra del Fuego. In this paper we evaluate archaeo-\nlogical evidence from a test pit excavation, synthesize stratigraphic and contextual data, and present a \nnew radiocarbon date (5,520 + 50 years BP) on shell material of anthropic origin. The latter confirms \nthe antiquity of the site, highlighting the presence of archaeological deposits in a co-eval palaeosol.\nKEYWORDS: Tierra del Fuego, Middle Holocene, terrestrial hunters.\n1 Estudio realizado en el marco del proyecto FONDECYT 1060020 “Arqueología de cazadores-recolectores de Tierra del \nFuego: el proceso de colonización y el factor de aislamiento geográfico, durante el Holoceno temprano y medio”.\n* Centro de Estudios del Hombre Austral (CEHA), Instituto de la Patagonia, Universidad de Magallanes y Centro de Estudios \ndel Cuaternario (CEQUA). flavia.morello@umag.cl. Av. Bulnes 01890, Punta Arenas, Chile.\n** Centro de Estudios del Hombre Austral (CEHA), Instituto de la Patagonia, Universidad de Magallanes y McBurney Geoar-\nchaeology Laboratory, Department of Archaeology, University of Cambridge. Inglaterra.\n*** DIPA-IMIHICIHU, CONICET, Argentina.\n**** Centro de Estudios del Cuaternario (CEQUA). Chile.\n***** Museo de Historia Natural de Concepción, DIBAM. Chile.\n192 F. MORELLLO et al.\nINTRODUCCIÓN\nLas investigaciones iniciadas en el año 2006 \nen torno al proceso de colonización terrestre de \nTierra del Fuego durante el Holoceno, son el mar-\nco de presentación de nueva evidencia recopilada \nsobre restos arqueológicos anteriores a la ocupación \nefectiva de la isla (ca 2.000 años AP, sensu Borrero \n1989) en el sitio Cabo Monmouth 20.\nCon el objetivo de discutir la dinámica cultu-\nral y las estrategias adaptativas de las poblaciones \nque habitaron la isla grande de Tierra del Fuego, \nChile, se planteó la necesidad de generar nuevas \nestrategias metodológicas para mejorar el registro \narqueológico conocido, entre otros aspectos. La \nmetodología aplicada (cfr. Morello et. al. 2009) fue \nexitosa, llevándonos al estudio más detallado del \nsitio que se presenta a continuación.\nEl sitio Cabo Monmouth 20 (CM20) es un \nextenso yacimiento arqueológico descubierto en el \nmarco de las prospecciones superficiales sistemáticas \ndesarrolladas en la costa Norte y Oeste de Tierra del \nFuego en el año 2006. Hasta el momento ha sido \nobjeto de dos campañas de excavación de sondeo \n(2007-2008), de una evaluación geoarqueológica \n(Arroyo-Kalin et. al. 2008) y de una tafonómica \n(Morello et. al. 2009).\nEl yacimiento está ubicado al sur de Porvenir \n(Fig. 1), sobre una barranca costera que en este \nsector tiene una altura estimada entre 6 y 10 msnm. \nPresenta una extensión aproximada de 1000 m N-S \ny 150 m W-E (Massone et. al. 2007) y se emplaza \nen una terraza paleolacustre asociada al Avance E \ndel Último Máximo Glacial (McCulloch 2007, 2008), \nque ha sido erosionada por el mar, conformando la \nbarranca (Figs. 2 y 3).\nLa visibilidad del lugar es mala a nula, no \nobstante se observan artefactos dispersos en el perfil \nexpuesto hacia la barranca costera y en superficie, \nen sectores alterados por roedores fosoriales (Cte-\nnomys sp.) y por dos huellas vehiculares que cruzan \nla terraza. Se registraron diversos materiales líticos \nen superficie, como lascas, núcleos (incluyendo dos \ndel tipo Levallois), raederas, fragmentos de bola, etc. \nTambién se observan algunos restos de fauna en \nsuperficie o en el perfil expuesto de la barranca, los \nque consideran guanaco (Lama guanicoe) -incluyen-\ndo un corte perimetral sobre epífisis datado-, lobo \nFig. 1. Ubicación del sitio Cabo Monmouth 20.\n193NUEVAS EVIDENCIAS DE CAZADORES RECOLECTORES TERRESTRES\nmarino, cetáceo y conchas dispersas y agrupadas \nen concentraciones.\nLos fechados radiocarbónicos de dos muestras \nrecolectadas en la campaña del año 2006 evidenciaron \nocupaciones del Holoceno medio y tardío. Junto a las \nevidencias estratigráficas, estos datos sugerían que el \nsitio era de gran interés para una mejor comprensión \ndel registro arqueológico de la Isla Grande. Estos \nprimeros dos fechados se realizaron sobre muestras \ntomadas del perfil expuesto de la barranca costera, en \nel sector sur del sitio. Una datación tardía de 2.410 + \n35 años AP (Ua-33947) fue realizada sobre un frag-\nmento de corte perimetral sobre diáfisis y epífisis distal \nde radio-ulna derecha de guanaco, que provenía de la \nprimera capa -superior- del perfil. De una segunda capa, \nposteriormente identificada como un paleosuelo que \nse expresa en varios puntos de la costa noroccidental \nde la isla, se obtuvo un fechado de 5.565 + 40 años \nAP (Ua-33946), datando directamente el sedimento \ndel paleosuelo (Morello et al. 2009).\nFig. 2. Croquis de CM20 y la ubicación de las unidades excavadas.\n194 F. MORELLLO et al.\nCon el objeto de verificar la información estrati-\ngráfica y contextual de estos dos fechados, se realizaron \nvarios sondeos en dos sectores del sitio. Primero se \nsondeó en el año 2007 en la zona inmediatamente \naledaña al lugar de recolección de las muestras data-\ndas y, durante el año 2008, se excavó en otra zona \ncercana, en donde se observó una concentración de \nmaterial cultural en un perfil erosionado de la barranca.\nA continuación se presenta la metodología \nutilizada, los resultados obtenidos, una discusión de \nsu relevancia y las conclusiones de estas excavacio-\nnes de sondeo.\nMETODOLOGÍA\nLa ubicación de las unidades de sondeo se \nsituó en las cercanías de los sectores datados y al \nperfil expuesto del año 2006, al sur del yacimiento. \nLa primera excavación realizada en el año 2007 se \nidentificó como Pozo de Sondeo 1 (GPS 19F 0408061 \nS\/ 4083509 E, Datum South American 69’) pero \nluego fue asignado a una grilla de unidades de 1 \nm2 establecidas durante los trabajos del año 2008.\nEl yacimiento se subdividió en dos mitades \narbitrariamente definidas por un eje imaginario \norientado según el norte magnético y otro eje \nperpendicular a éste que se subdividió en Oeste y \nEste. Los tres ejes comienzan en un punto ubicado \nal azar y que corresponde a la medida 0. Los Ejes \nse denominaron respectivamente Eje N, W y E. La \nzona de interés, estudiada en campañas anteriores, \nse ubica en la mitad Este (Fig. 2). \nLa subdivisión en ejes permitió generar un \ncuadriculado estándar para todo el yacimiento, divi-\ndiendo el área en unidades o cuadrículas de 1 x 1 m, \ndenominadas según su distancia con respecto a los \nejes diseñados. Así, por ejemplo, el Pozo de Sondeo \n1 (año 2007) se denomina Cuadrícula 80N\/280E. \nEsta excavación de sondeo abarca solamente la mitad \noeste de la unidad, por lo que se decidió seguir exca-\nvando solo áreas de 1 m x 50 cm, con su dimensión \nmayor orientada perpendicularmente a la barranca \ny en sectores muy cercanos al perfil expuesto. Así, \ndurante el año 2008 se excavó la mitad oeste de las \ncuadrículas 81N\/280E y 83N\/280E, conformando \nuna trinchera semi-continua de 4 m de largo, que nos \npermitió conocer la distribución de materiales arqueo-\nlógicos hacia el interior, alejándonos de la barranca.\nAdemás de este sector, se realizó un sondeo \npreliminar en la cuadrícula 72N\/238E, a 42 m al \noeste de la trinchera del eje 280E. Esta unidad \ntambién tuvo una extensión de 100 x 50 cm.\nEn todos los casos se excavó siguiendo niveles \nartificiales de 10 cm e intentando subdividir según \ncapas naturales. Se harneó todo el sedimento con \nuna malla de 4 mm, recolectándose todo el mate-\nrial cultural, excepto los fragmentos de conchas y \nlos fragmentos óseos de roedor, para los cuales se \ntomaron solamente algunas muestras para análisis \nradiocarbónicos y como registro. Una vez pro-\nfundizado hasta un estrato estéril se dibujaron los \nperfiles de la excavación y se dispuso de una malla \nen la base y las paredes, y luego se tapó todo con \nel sedimento extraído.\nLos materiales recolectados fueron sujeto de \nun análisis general, identificando las categorías de \nartefactos presentes, su frecuencia y peso, en el caso \nde los líticos, y la especie y unidad representada en \nel caso de los restos óseos.\nRESULTADOS\nLos resultados de las cuatro unidades exca-\nvadas se presentan a continuación.\nCuadrícula 80N\/280E (Pozo de Sondeo 1)\nLa superficie del pozo presenta una cubierta \nvegetal total de pasto bajo y arbustos en los alrededores. \nEn los primeros 10 cm, luego de retirar la champa \nde pasto, se registra un sedimento café, suelto, con \nFig. 3. Vista del sitio CM20, del lugar de sondeo (81N\/280E) \ny de la terraza glaciolacustre donde se emplaza.\n195NUEVAS EVIDENCIAS DE CAZADORES RECOLECTORES TERRESTRES\nraicillas cuya matriz es de arena fina con limo y es-\ncasas gravas. Sólo se observan conchas aisladas en \neste nivel (choritos y mauchos -Mytilus sp. y Nacella \nsp., respectivamente) y escasos huesos de roedor.\nEntre los 10-30 cm la matriz sedimentológica \nes la misma, correspondiendo al Estrato I. Comienzan \na registrarse algunas lascas medianas a pequeñas \ny otros desechos, y siguen observándose conchas \naisladas y dispersas, y escasos restos de roedor, a \nlo largo de la secuencia, pero entre los 20 y 40 cm \nla densidad de materiales líticos baja notablemente, \nlo que se observa en la Fig. 4, especialmente en las \nmedidas de peso total.\nHacia los 30-40 cm de profundidad la matriz \nde sedimento cambia su color a un café más oscuro, \norgánico, manteniendo su granulometría (arena \nfina y limo), correspondiendo a la transición hacia \nel Estrato II. Se observan escasos fragmentos de \ncarbón y espículas dispersas. En cuanto al material \narqueológico se registran algunas lascas, dos láminas \npequeñas y aumenta la proporción de conchas dis-\npersas y enteras (mauchos, Fisurella sp. y choritos). \nEl material (conchas, carbón y líticos) se concentra \nen el nivel basal, entre aproximadamente 40-50 \ncm de profundidad, registrándose lascas de mayor \ntamaño y una raedera, bastantes conchas dispersas \ny algunos escasos huesos de roedor. \nDebemos destacar que en todos los niveles los \nmateriales líticos se registraron en posición horizontal \ny no hay evidencia de procesos de disturbación, a \nexcepción de los escasos restos de roedores, domi-\nnados por coruro.\nHacia los 47 cm de profundidad, en la esquina \nSW de la unidad, se registra un sedimento de color \nclaro y de origen glaciar. Se sigue excavando la capa \nde arena fina con limo de color café oscuro, aunque \nhacia la base cambia y se presenta más compacta y \ncon más limo. La excavación continua hasta despejar \nel estrato de sedimento glaciar en todo el pozo. El \nnuevo Estrato III esta compuesto de un limo arcilloso \ncon concentraciones pequeñas y discontinuas de \ntefra que corresponderían a el volcán Reclus (com \npers. R. McCulloch 2006). Entre los 50-60 cm de \nprofundidad se reduce la excavación de la unidad \na la mitad norte (50 x 50 cm), llegando a despejar \notra capa de finales del Pleistoceno. En este sector \nel pozo llega a una profundidad máxima de 76 cm.\nCuadrícula 81N\/280E\nLa cubierta vegetal en esta zona es total (pasto \nbajo y arbustos en los alrededores) y el estrato bajo \nla champa de pasto corresponde a una arena fina \ncon limo y escasas gravas, color café claro.\nEntre los primeros niveles artificiales, 0-35 \ncm, se registran restos culturales dispersos, princi-\npalmente material lítico (lascas, microdesechos y \nfragmentos), algunas conchas de chorito y maucho \ny escasos huesos de roedor. El material se concentra \nprincipalmente en el nivel 10-20 cm (Fig. 5).\nFig. 5. Frecuencia de artefactos líticos recuperados \nen la cuadrícula 81N\/280E por nivel artificial.\nFig. 4. Grafico de barras con frecuencia y peso total \nde materiales líticos de la cuadrícula 80N\/280E \n(Pozo de Sondeo 1) por nivel artificial.\n196 F. MORELLLO et al.\nHacia los 30 cm se observa una disminución \nen la cantidad de materiales, con una alza entre \nlos 30-35 cm de profundidad y un nivel estéril de \nrestos líticos entre los 35-40 cm (solo se observaron \nconchas aisladas).\nLuego, entre los 40-50 cm se registra nueva-\nmente material lítico, con una concentración mayor \nque la de los niveles anteriores, observándose lascas \ninternas, secundarias y fragmentos, un guijarro con \nfractura bipolar y un percutor. El sedimento asociado \npresenta un leve aumento en la cantidad de gravas, \nes más compacto y de un color más oscuro, con \nraicillas dispersas. Corresponde a la transición hacia \nel Estrato II (paleosuelo) – Fig 6.\nEl nivel 50-60 cm se relaciona con el Estrato \nII, un paleosuelo enterrado, compuesto de una arena \nfina y más compacta, con abundante material orgá-\nnico y de color oscuro. Hacia la base se presenta el \nEstrato III, de origen glaciar, también estéril, y que \nregistra concreciones pequeñas de color blanco que \ncorresponden a la tefra del Reclus. \nCuadrícula 83N\/280E\nLa cubierta vegetal en esta unidad también \nes total y se presenta una estratigrafía muy similar a \nlas anteriores. En asociación con el Estrato I, entre \nlos 0-40 cm, se observan algunos materiales líticos \n(lascas internas, secundaria y otros desechos), escasos \nrestos de roedor y conchas aisladas. Aunque en los \nprimeros 10 cm no se registra ningún artefacto lítico.\nHacia los 40 cm de profundidad se recolec-\nta un núcleo y se observa un alza en la densidad \nde materiales líticos, registrándose en los niveles \n40-55 cm artefactos más grandes como una lasca \nsecundaria, lascas internas, un desecho de bola de \ngabro y desechos de talla indeterminados (Fig. 7). \nSe recolecta una astilla ósea de Mammalia en muy \nmal estado de conservación. \nEntre los 55-60 cm se pasa casi de manera \nimperceptible al Estrato II, ya que el paleosuelo no \npresenta un espesor mayor a 2 cm y por la humedad \nde los sedimentos se hace difícil identificarlo al exca-\nvar. No se registran materiales culturales asociados \na estos últimos 5 cm. El Estrato III, de origen glacial, \nse presenta bajo los 60 cm de profundidad, siendo \ntambién estéril.\nAl terminar esta última unidad del eje 280N, \nel conjunto de estas tres unidades excavadas con-\nforman una transecta perpendicular a la barranca \nque permite tener una visión sobre la distribución \nestratigráfica y de restos culturales desde el perfil \nerosionado hacia el interior o norte de la terraza \nglaciolacustre, donde se extiende el sitio CM20. En-\ntre los resultados comunes de estas tres cuadrículas \ndestaca una reiteración en el hallazgo de dos peaks \nFig. 7. Frecuencia y peso de restos líticos de la \ncuadrícula 83N\/280E por nivel artificial.\nFig. 6. Perfil Norte de la Cuadrícula 81N\/280E.\n197NUEVAS EVIDENCIAS DE CAZADORES RECOLECTORES TERRESTRES\nde concentración de restos líticos, uno aproximada-\nmente entre los 10-20 cm, que coincide bien con el \nestrato y el depósito arqueológico fechado en 2.410 \naños AP y, un segundo, con mayor concentración \nde artefactos y de mayor tamaño, los que se apoyan \ne insertan en el interior del paleosuelo – Estrato II \n– y que se relaciona directamente con la datación \nde éste con ca. 5.500 años AP.\nLa observación de la estratigrafía general de \nesta transecta indica que la capa de paleosuelo se \nadelgaza al alejarse del perfil de la barranca, hacia \nel Norte y el examen del paleosuelo en diversas ex-\nposiciones revela una superficie enterrada que no es \nparalela a la actual, también sugiriendo una diferente \npaleotopografía que se inclina hacia la barranca.\nCuadrícula 72N\/238E\nLa vegetación cubre alrededor del 50% de \nla superficie de esta unidad, generando notorias \ndiferencias de altura, con cavidades de erosión en \ndistintos sectores de la cuadrícula. Es por esto que \nantes de comenzar la excavación se saca la champa \nde pasto y se nivela horizontalmente en relación a los \nsectores erosionados y luego se comienza a excavar \ncon niveles artificiales (Fig. 8). En esta extracción \nde la champa se registra en harnero un fragmento \nde lasca y microdesechos.\nEntre 0-20 cm se registra el Estrato I, con \nlas mismas características que en las cuadrículas \nanteriores. Los restos recuperados corresponden a \nlascas internas, microdesechos, una lasca secundaria \ngrande, un núcleo, un cuchillo y otros desechos in-\ndeterminados, también se registran escasas conchas \n(chorito y maucho), huesos de roedor dispersos y \nuna patela de guanaco con abundantes marcas de \nradículas. Hacia la esquina NE, en el nivel 0-10 cm, \nse identifica una fosa de roedor. En la base del nivel \n10-20 cm, pero solo en la mitad Sur de la unidad, \ncomienza a vislumbrarse la transición del Estrato II \n(paleosuelo).\nAsociada a esta capa de transición, arena fina \ncon mayor porcentaje de limo y algunas gravas, se \nregistra un interesante conjunto de materiales cul-\nturales. Presenta una mayor frecuencia de conchas \nde choritos y mauchos, y se observan una lasca \nsecundaria grande, un núcleo y una lasca de dorso \nnatural grande apoyando sobre esta capa más oscura. \nFig. 8. Vista de la cuadrícula 72N\/238E al inicio de la excavación y el perfil expuesto por la barranca en \nel que se observa la extensión continua del paleosuelo y su asociación de restos líticos y conchas.\n198 F. MORELLLO et al.\nTambién lascas internas, microdesechos y algunas \nespículas de carbón dispersas, todo en la mitad sur \nde la cuadrícula.\nEn la mitad norte, en el nivel 20-30 cm, \ntambién comienza a observarse esta capa de tran-\nsición de arena limosa café oscuro y se registra otra \nconcentración de grandes líticos (lasca primaria, \nlasca de dorso natural y fragmento) y en el sector \nsur de la unidad siguen apareciendo líticos como un \nguijarro astillado y una lasca pequeña. En este nivel \nla existencia de una concentración de conchas es \nevidente, aunque siguen presentándose de manera \ndispersa y registrándose espículas de carbón y una \nde colorante ocre. Hacia la base del nivel, en la \nzona norte, se recolecta una raedera y un desecho \nde cuarzo, entre otras piezas (Fig. 9).\nEn general, todos los materiales se presentan \nen posición horizontal o ligeramente oblicua, lo \nque se podría asociar a la pendiente de la terraza, \ntambién observada en la distribución horizontal de \nlas capas naturales, que se inclinan o descienden \nlevemente hacia la barranca costera (Sur) – Fig. 10. \nEsta observación es extrapolable a todas las unidades \nexcavadas en CM20.\nLa excavación del nivel artificial 30-40 cm \nregistra la aparición del Estrato II, paleosuelo de \narena limosa muy oscura y compacta que se asocia \na concentraciones de conchas, mezcladas con len-\ntes carbonosos y de cenizas, y conchas quemadas, \nademás de materiales culturales y escasas espículas \nFig. 9. Grafico de barras con frecuencia y \npeso total de materiales líticos de la cuadrícula \n72N\/238E por nivel artificial.\nFig. 10. Perfiles estratigráficos de las unidades excavadas en el sitio.\n199NUEVAS EVIDENCIAS DE CAZADORES RECOLECTORES TERRESTRES\nde carbón (aunque el sedimento es de contenido \naltamente orgánico). Entre los restos líticos destaca \nun núcleo Levallois simplificado (sensu Pigeot 2003), \nuna lasca secundaria y lascas internas. Una muestra \nde conchas (Mytilus sp.) tomadas de este rasgo, de \nla zona sur de la unidad, fue datada en 5.520 + 50 \naños AP (Beta-255156), lo que ubica el contexto \narqueológico de manera contemporánea con el \npaleosuelo previamente datado (cfr. Supra).\nLa excavación de este nivel registra algunas \nastillas óseas en el sector norte del sondeo y luego \nuna concentración de materiales que están insertos \nen la parte superior del paleosuelo. Se trata de un \nhueso de cetáceo que podría presentar huellas de \ncorte pero la gran cantidad de marcas de radículas \nen su superficie no nos permite confirmar esta ob-\nservación. Otro fragmento óseo correspondiente a \nuna diáfisis de hueso largo de guanaco se presenta \nen las mismas condiciones de alteración y asociado \na dos lascas.\nEn el mismo nivel, bajo el paleosuelo, co-\nmienza a vislumbrarse el Estrato III, de origen \nglaciar. En la parte superior del nivel 40-50 cm, \nen la mitad sur de la unidad, se descubre esta capa \nglaciar. Más abajo, se extiende en toda la cuadrícula, \nuna vez terminada la excavación del paleosuelo. \nEn este punto se registra una lasca interna. En el \nEstrato III se detecta solamente un fragmento de \ndiáfisis de hueso largo de guanaco con coloración \nnegra (quemada o manganeso), apoyado en su \nparte superior.\nAl excavar algunos centímetros del Estrato III, \narcilla de color claro, se distinguen manchas como \nconcreciones de color blancuzco que corresponden a \nconcentraciones de tefra, tratándose de la erupción \ndel volcán Reclus. La ceniza volcánica se observa a \nlo largo de la barranca en el área estudiada. No se \nregistra material arqueológico asociado y se concluye \nla excavación.\nMateriales Óseos y Líticos\nLa densidad de materiales arqueológicos en \nlas unidades excavadas es mediana, llegando a un \npromedio de 74 restos por metro cuadrado, incluyendo \ntodos los niveles artificiales. Si consideramos sólo \nlos restos de fauna, la densidad puede considerarse \nbajísima, más si se excluyen los escasos restos de \ncoruro y las conchas dispersas presentes en todas las \nunidades. En las cuadrículas 80N\/280E y 81N\/280E \nno se registró ningún resto óseo, luego en la unidad \n83N\/280E sólo se recolectó una astilla de Mamma-\nlia. Con relación, destaca la diversidad de restos de \nfauna encontrados en la unidad 72N\/238E, pues \nallí se recuperar un resto de cetáceo, tres huesos de \nguanaco y algunas astillas de Mammalia, pero sigue \nsiendo llamativa la escasa presencia de restos óseos.\nPor consiguiente, la mayoría de los materiales \nrecuperados son restos líticos, principalmente dese-\nchos de talla, aunque también se registraron algunos \ninstrumentos formatizados por retoque marginal (Tabla \n1). Los derivados de núcleo presentes en las distintas \nTabla 1. Frecuencia de materiales líticos según categoría tecno-morfológica y cuadrícula.\nCATEGORÍA\nCUADRÍCULA\n80N\/280E 81N\/280E 83N\/280E 72N\/238E TOTAL\nraedera 1 1\ncuchillo 1 1\npercutor 1 1\nnúcleo 1 3 4\nlasca primaria 4 4\nlasca secundaria 4 2 4 6 16\nlasca dorso natural 1 2 3\nlasca interna 14 20 6 13 53\nlámina 2 2\nlasca de retoque 1 1\nlasca bifacial 1 1\nmicrodesecho 10 1 9 20\ndesecho de bola 1 1\ndesecho indeterminado 4 6 11 12 33\nTOTAL 26 43 24 48 141\n200 F. MORELLLO et al.\ncuadrículas señalan el desarrollo de actividades de \ntalla, estando representadas las primeras etapas \nde desbaste de núcleos, pero destacamos el escaso \nregistro de la etapa final de retoque de instrumentos \nsobre lasca y la casi ausencia de trabajo bifacial.\nLas actividades de desbaste incluyen la pre-\nsencia de un núcleo Levallois simplificado (sensu \nPigeot 2003), asociado a la fecha del paleosuelo \nde ca. 5.000 años AP, y similar a las dataciones del \nmismo tipo de método de desbaste registrado en \nPonsonby (Legoupil 2003). Al respecto, destacamos \nque en superficie se registraron al menos dos casos \nde núcleos Levallois recurrente.\nGeoarqueología\nEl análisis de cortes expuestos en la barranca \ncostera sugiere que la estratigrafía relevada en la ex-\ncavación no constituye una excepción a escala mayor \ndel paisaje. El llamado Estrato II corresponde a un \npaleosuelo detectable a todo lo largo de la explanada \nque constituye el sitio Cabo Monmouth. El estudio \nmicromorfológico del mismo muestra un suelo de \nmicroestructura granular, textura limo-arcillosa, y \nporosidad y agregados con claras indicaciones de \nbioturbación. Depositado en el mismo se observan \nraicillas reemplazadas por sesquióxidos y también \nfragmentos microscópicos de concha y carbón. La \npresencia de estos últimos apoya la interpretación \nde que los artefactos detectados en la excavación \narqueológica son contemporáneos con la formación \ndel paleosuelo. Inmediatamente bajo este último, en \nel sedimento arcillo-limoso que constituye el Estra-\nto III, se observa un fino lente de sedimento más \nclaro. Las observaciones microscópicas confirman \ncaracterísticas de una ceniza volcánica de color \namarillento. Estudios en ejecución nos permitirán \nconfirmar si ésta resulta comparable con la tefra del \nvolcán Hudson, lo que resulta plenamente compatible \ndesde un punto de vista cronológico. El Estrato III \naparece como un sedimento limo-arcilloso de colo-\nración tipo gley que en el microscopio no presenta \nestratificación y sí, en cambio, porosidades que \nsugieren actividad biológica. Hacia la parte inferior \ndel perfil hay un cambio hacia una estructura limo-\narenosa fina que presenta evidencias de la presencia \nde la tefra del Reclus. Ello sugiere una transición \ndesde un régimen de sedimentación caracterizado \npor depositación eólica a uno en el que el agente \nprincipal es el agua, seguido de la implantación de \ncondiciones anaeróbicas. Estas observaciones apoyan \nparcialmente la presencia de un lago glaciar antes \nde la depositación de la tefra del Reclus, ca. 12.500 \naños AP (McCulloch 2007, 2008).\nTafonomía\nResulta importante incorporar una evaluación \ntafonómica, pero esta necesidad se vuelve imperativa \ncuando se está presentando un caso novedoso. Co-\nmo se ha dicho, en Cabo Monmouth, una pradera \ncon arbustos, la visibilidad es muy baja, al punto \nque solo en ca. 9% de los casos analizados en una \nprospección sistemática de la localidad, basada \nen distintas tácticas, pudo ser juzgada como alta \n(Morello et. al. 2007). Por otra parte la visibilidad \ndisminuye al alejarse del borde de la barranca hacia el \ninterior, como lo evidencian los pozos de transectas \nC-5-C-6, D-6 y E-2 a E-6 (Morello et. al. 2007) de \nla prospección realizada en el año 2007.\nLas observaciones tafonómicas indican que \nel suelo es poco penetrable y son bajas las proba-\nbilidades de mezcla de huesos arqueológicos con \nmateriales recientes. En otras palabras, aunque \nexistan condiciones de buena depositación de res-\ntos, eso no parece crear un riesgo excepcional de \nmezcla. Las mezclas sólo parecen ocurrir en sec-\ntores erosionados. Si bien estos son cada vez más \namplios, se puede sostener que su acción de mezcla \nes controlable eligiendo -como se hizo- sectores no \nerosionados para excavar.\nEn el caso de Cabo Monmouth 20, como en \nmuchos otros a lo largo de este sector de costa, las \nverdaderas asociaciones secundarias se generan al pie \nde la barranca y son el resultado del retroceso de la \nmisma. Los casos de contaminación más esperables, \nen realidad, ocurren alejándose de la costa, en los \nsectores de actividad de Ctenomys sp., zona en la \nque se detectó la existencia de una corurera activa, \naunque dominada -como es usual- por madrigueras \nabandonadas.\nTodos los sondeos presentaron restos de \nroedores en distintos niveles, especialmente entre \n0-20 cm, y también en niveles inferiores asociados \nal paleosuelo. Son casos con asociaciones líticas \ny óseas arqueológicas verticalmente discretas, y \nsin evidencias de disturbación “a excepción de los \nescasos restos de roedores” (Morello y Cárdenas \n201NUEVAS EVIDENCIAS DE CAZADORES RECOLECTORES TERRESTRES\n2008: 60). En otras palabras, (1) la escasa acción \nde los roedores no afectó al paleosuelo, (2) la pre-\nsencia de los restos de roedor es cotérmino con la \nde los elementos culturales, pero siempre indicando \nactividad animal muy poco intensa. \nLa ausencia de indicadores culturales sobre \nrestos de roedores permite considerarlos un artefacto \nde depositaciones penecontemporáneas o posterio-\nres a la instalación humana. En pocas palabras, los \nroedores aparecen como agentes poco importantes \nen este depósito. La posición horizontal de los ha-\nllazgos, junto con la ausencia de marcas de roedor \nsobre los huesos -el principal agente “mezclador” \npotencial-, robustecen la credibilidad del conjunto.\nA pesar de esta situación de poca contami-\nnación, el sitio nos presenta un caso en el que la \ncomplejidad de la historia tafonómica, limita no solo \nla inferencia de conducta y, por extensión dietética \n-qué recursos llevan huellas de corte- (Blumenschi-\nne y Pobiner 2007), sino directamente la cultural. \nUn ejemplo es el caso del hueso de cetáceo. Sin \nembargo, aunque este no ofrece evidencia creíble \nde significado cultural -sea para consumo o como \nmateria prima-, su contexto si lo indica. Hemos \nvisto que, a diferencia de otros casos en la costa \ndel estrecho de Magallanes, es muy difícil explicar \nsu aparición en el sitio sobre un sustrato no marino \nexcepto a través de mediación cultural.\nEn resumen, las posibilidades de que la mezcla \nreciente haya afectado mucho a los conjuntos de Cabo \nMonmouth 20 son bajas. Los materiales ubicados \nhan sido dispersos, pero constituyen un innegable \ntestimonio de ocupación hacia el Holoceno medio.\nCONCLUSIONES\nLos estudios iniciales efectuados durante el \naño 2007, en especial el análisis geoarqueológico \ny el Pozo de Sondeo 1 (cuadrícula 80N\/280E), \nresultaron positivos en cuanto a confirmar la pre-\nsencia de un depósito arqueológico con artefactos \nlíticos y conchas asociadas a un fechado cercano \na 5.500 años AP. El contexto esta incorporado \nestratigráficamente en el interior de un paleosuelo \nque tiene la datación mencionada. Además se corro-\nboró la estrecha concordancia entre la estratigrafía \nregistrada en los perfiles expuestos en la barranca \ncostera - previamente datados en el año 2006 - y \nlas excavaciones de sondeo. \nConsiderando la coherencia estratigráfica en \nconjunto con la existencia de dos concentraciones \nde materiales líticos, uno en el nivel 10-20 cm y otro \nen la base entre los 40 y 50 cm de profundidad, \nes posible concluir que en el sector registramos \ndos ocupaciones estratigráficamente superpuestas \ny asociadas a los fechados de 2.410 y 5.565 años \nAP, respectivamente. Sin embargo, la densidad de \nmateriales óseos es baja y hay escasa presencia de \nrestos óseos de claro origen antrópico. No así, los \nartefactos líticos están bien representados e incluyen \ndiversas actividades de talla.\nLa información recopilada en la excavación \ndel sondeo 72N\/238E aporta, además, evidencia \nclara de la existencia de un agregado de concentra-\nciones discontinuas en el espacio y correspondiente \nal registro arqueológico del Holoceno medio. Esto, \nconsiderando un efecto reservorio aproximado de \n400 a 500 años para esta zona del estrecho de \nMagallanes da una data de ca. 5.000 años AP para \nel contexto arqueológico (cfr. San Román et. al. \n2009). Según lo muestran los sondeos realizados \nen dos sectores del yacimiento, el depósito se \nencuentra asociado a un paleosuelo (5.565 años \nAP) que presenta una extensa distribución en la \nlocalidad, y a ocupaciones posteriores que pueden \npreliminarmente ubicarse alrededor de los 2.410 \naños AP.\nLas excavaciones realizadas en las cuadricu-\nlas 81N\/280E y 83N\/280E permiten aclarar, en \neste sector, que una concentración de materiales \nlíticos se presenta en la capa de transición direc-\ntamente sobre el paleosuelo, pero el interior de \neste se registró estéril, probablemente debido a \nsu poco espesor. Además, es interesante destacar \nque la capa de paleosuelo se adelgaza a medida \nque los sondeos excavados se alejan del perfil de \nla barranca, hacia el N (Fig. 10). La conserva-\nción de restos óseos, en general, es muy mala y \npodríamos suponer que este adelgazamiento del \npaleosuelo podría estar asociado a procesos de \nerosión y tal vez explicar la casi total ausencia de \nhuesos en estas unidades.\nPara Cabo Monmouth 20 el registro predomi-\nnante de materiales en posición horizontal, extensiva \na todas las unidades, sugiere que ha habido poca \nmovilidad vertical en el caso del componente del \nHoloceno medio del sitio. Pero la presencia de al \nmenos una fosa de roedor clara en el Estrato I de la \n202 F. MORELLLO et al.\nexcavación de la cuadrícula 72N\/238E, además de \nmuchas otras observadas dispersas en la superficie \ndel yacimiento y la presencia constante de huesos \nde roedor dispersos en los sondeos, aunque en \npequeñas cantidades, sugiere que pueden haber pro-\ncesos de disturbación no detectados, especialmente \nasociados a los niveles entre 0-30 cm de profundi-\ndad. La notable presencia de marcas de radículas \nen los huesos de guanaco y cetáceo hallados en la \ntransición del horizonte superior y en el interior del \nEstrato II – paleosuelo – de esta última unidad, es \nun indicio de la importancia de este factor en los \nprocesos de disturbación del contexto datado en ca. \n5.000 años AP y, probablemente, en la explicación \nde la mala preservación y baja cantidad de restos \norgánicos conservados en este depósito. No obstante, \nla evaluación tafonómica del sitio y la localidad, en \ngeneral, indican que las posibilidades de mezcla con \nmateriales recientes es baja.\nLas dataciones del paleosuelo registrado en \nCabo Monmouth corresponden con condiciones \nmás húmedas, ya que para el Holoceno medio-\ntardío el incremento en la precipitación condujo \nal desarrollo de un bosque de Nothofagus más \ncerrado, como el que se observa actualmente en \nlas cercanías de Cordillera Darwin (cfr. McCulloch \ny Morello 2009). Tanto la presencia del paleosuelo \ncomo la abundancia de marcas de raíces en los \nrestos óseos, y su mala conservación, apoyan la \npresencia de diferencias en la vegetación actual con \nrespecto a la que debió predominar en el Holoceno \nmedio en la localidad.\nEl interés de los contextos descritos, su anti-\ngüedad cercana a 5.000 años y su cercanía a una \nbarranca costera en constante y rápida erosión, \nhacen que la excavación ampliada de una o dos de \nestas concentraciones de ocupaciones del Holoceno \nmedio sean una prioridad para las labores de terreno \nde los próximos años.\nAGRADECIMIENTOS\nJunto con agradecer el financiamiento de \nFONDECYT 1060020, quisiéramos dar nuestra \ngratitud a las personas que colaboraron en las \ncampañas de terreno: Magallanes Rovira y Manuel \nRomán. Además, los oportunos comentarios de \nFabiana Martin.\nBIBLIOGRAFÍA\nARROYO-KALIN, M, F. MORELLO, C. FRENCH Y P. CáRDE-\nNAS. 2008. Sedimentos y paleosuelos: una aproximación \ngeoarqueológica a la evolución del paisaje fueguino \ndurante el Holoceno. En: Informe de Avance, Año 2, \nProyecto FONDECYT 1060020, pp. 78-86. MS.\nBORRERO, L. 1989. Spatial Heterogeneity in Fuego-Patagonia. \nEn: Archaeological Approaches to Cultural Identity, \nShenan editor. One World Archaeology.\nBLUMENSCHINE, R. y B. POBINER, 2007. Zooarchaeology \nand the Ecology of Oldowan Hominin Carnivory. En: \nEvolution of the Human Diet. Editado por P.S. Ungar, \npp. 167-190, Oxford University Press, Oxford.\nLEGOUPIL, D. 2003. Cazadores-Recolectores de Ponsonby \n(Patagonia austral) y su paleoambiente desde VI al III \nmilenio A.C. editado por D. Legoupil. Universidad de \nMagallanes MAGALLANIA Vol. 31, número especial, \nPunta Arenas.\nMASSONE, M., F. MORELLO, E. CALáS, C. HUIDOBRO, G. \nBAHAMONDE, Y I. MARTINEZ. 2007. Prospección \narqueológica superficial en la costa norte y noroccidental \nde Tierra del Fuego. En: Informe de Avance, Año 1, \nProyecto FONDECYT 1060020, pp. 53-65. MS.\nMCCULLOCH, R. D. 2007. Field Report 2006. En Informe \nde Avance, Año 1, Proyecto FONDECYT 1060020, \npp. 13-22. MS.\n -2008. Field Report 2007. En: Informe de Avance, Año \n2, Proyecto FONDECYT 1060020. MS.\nMCCULLOCH, R. Y F. MORELLO. 2009. Evidencia glacial y \npaleoecológica de ambientes tardiglaciales y del Holoceno \ntemprano. Implicaciones para el poblamiento temprano \nde Tierra del Fuego. En: Arqueología de Patagonia: \nuna mirada desde el último confín, editado por M. \nSalemme, F. Santiago, M. álvarez, E. Piana, M. Vázquez \ny M.E. Mansur. Editorial Utopías, Ushuaia. En prensa.\nMORELLO, F. y P. CáRDENAS. 2008. Excavación de sondeo \nen Cabo Monmouth 20, Tierra del Fuego. En: Informe \nde Avance, Proyecto FONDECYT 1060020, 2° año, \npp. 57-63. MS.\nMORELLO, F., M. ARROYO-KALIN, M. MASSONE, I. MAR-\nTINEZ, C. HUIDOBRO, G. BAHAMONDE y P. CáR-\nDENAS. 2007. Evaluación de técnicas sub-superficiales \nde prospección: prospección de múltiples etapas de las \ncostas de la transgresión marina del Holoceno medio \nen el Norte y Oeste de Tierra del Fuego. En: Informe \nde Avance, Proyecto FONDECYT 1060020, 1er año, \npp. 29-52. MS.\n203NUEVAS EVIDENCIAS DE CAZADORES RECOLECTORES TERRESTRES\nRecibido: 30\/07\/2009 Aceptado: 01\/10\/2009 Versión final: 13\/10\/2009\nMORELLO, F.; L. BORRERO, J. TORRES, M. MASSONE, M. \nARROYO- KALIN, R. MCCULLOCH, E. CALAS, M. \nLUCERO, I. MARTÍNEZ Y G. BAHAMONDE. 2009. \nEvaluando el registro arqueológico de Tierra del Fuego \ndurante el Holoceno temprano y medio. En: Arqueolo-\ngía de Patagonia: una mirada desde el último confín, \neditado por M. Salemme, F. Santiago, M. álvarez, E. \nPiana, M. Vázquez y M.E. Mansur. Editorial Utopías, \nUshuaia. En prensa.\nPIGEOT, N. 2003. L’Économie de la taille de la pierre. En: \nCazadores-Recolectores de Ponsonby (Patagonia aus-\ntral) y su paleoambiente desde VI al III milenio A.C. \neditado por D. Legoupil, pp. 117-164. Universidad de \nMagallanes MAGALLANIA Vol. 31, número especial, \nPunta Arenas.\nSAN ROMáN, M.; M. FONTUGNE Y K. SALAS. 2009. Primeros \navances en la reconstrucción de secuencias de ocupación \nde cazadores recolectores marinos en el estrecho de \nMagallanes, Patagonia meridional. En: Arqueología \nde Patagonia: una mirada desde el último confín, \neditado por M. Salemme, F. Santiago, M. álvarez, E. \nPiana, M. Vázquez y M.E. Mansur. Editorial Utopías, \nUshuaia. En prensa.\n204 F. MORELLLO et al.\n"}