{"doi":"10.1371\/journal.pone.0003042","coreId":"61950","oai":"oai:nora.nerc.ac.uk:5486","identifiers":["oai:nora.nerc.ac.uk:5486","10.1371\/journal.pone.0003042"],"title":"Detection of large numbers of novel sequences in the metatranscriptomes of complex marine microbial communities","authors":["Gilbert, Jack A.","Field, Dawn","Huang, Ying","Edwards, Rob","Li, Weizhong","Gilna, Paul","Joint, Ian"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-08","abstract":"Background\\ud\nSequencing the expressed genetic information of an ecosystem (metatranscriptome) can provide information about the response of organisms to varying environmental conditions. Until recently, metatranscriptomics has been limited to microarray technology and random cloning methodologies. The application of high-throughput sequencing technology is now enabling access to both known and previously unknown transcripts in natural communities.\\ud\n\\ud\nMethodology\/Principal Findings\\ud\nWe present a study of a complex marine metatranscriptome obtained from random whole-community mRNA using the GS-FLX Pyrosequencing technology. Eight samples, four DNA and four mRNA, were processed from two time points in a controlled coastal ocean mesocosm study (Bergen, Norway) involving an induced phytoplankton bloom producing a total of 323,161,989 base pairs. Our study confirms the finding of the first published metatranscriptomic studies of marine and soil environments that metatranscriptomics targets highly expressed sequences which are frequently novel. Our alternative methodology increases the range of experimental options available for conducting such studies and is characterized by an exceptional enrichment of mRNA (99.92%) versus ribosomal RNA. Analysis of corresponding metagenomes confirms much higher levels of assembly in the metatranscriptomic samples and a far higher yield of large gene families with >100 members, ~91% of which were novel.\\ud\n\\ud\nConclusions\/Significance\\ud\nThis study provides further evidence that metatranscriptomic studies of natural microbial communities are not only feasible, but when paired with metagenomic data sets, offer an unprecedented opportunity to explore both structure and function of microbial communities – if we can overcome the challenges of elucidating the functions of so many never-seen-before gene families.\\ud\n\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/61950.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/5486\/1\/Gilbertjournal.pone.0003042%5B1%5D.pdf","pdfHashValue":"4f8515776a2e57b81a4645f725df27484e6a0dc8","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:5486<\/identifier><datestamp>\n      2017-01-19T12:06:23Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D5335<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      7375626A656374733D5339<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/5486\/<\/dc:relation><dc:title>\n        Detection of large numbers of novel sequences in the metatranscriptomes of complex marine microbial communities<\/dc:title><dc:creator>\n        Gilbert, Jack A.<\/dc:creator><dc:creator>\n        Field, Dawn<\/dc:creator><dc:creator>\n        Huang, Ying<\/dc:creator><dc:creator>\n        Edwards, Rob<\/dc:creator><dc:creator>\n        Li, Weizhong<\/dc:creator><dc:creator>\n        Gilna, Paul<\/dc:creator><dc:creator>\n        Joint, Ian<\/dc:creator><dc:subject>\n        Biology and Microbiology<\/dc:subject><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:subject>\n        Data and Information<\/dc:subject><dc:description>\n        Background\\ud\nSequencing the expressed genetic information of an ecosystem (metatranscriptome) can provide information about the response of organisms to varying environmental conditions. Until recently, metatranscriptomics has been limited to microarray technology and random cloning methodologies. The application of high-throughput sequencing technology is now enabling access to both known and previously unknown transcripts in natural communities.\\ud\n\\ud\nMethodology\/Principal Findings\\ud\nWe present a study of a complex marine metatranscriptome obtained from random whole-community mRNA using the GS-FLX Pyrosequencing technology. Eight samples, four DNA and four mRNA, were processed from two time points in a controlled coastal ocean mesocosm study (Bergen, Norway) involving an induced phytoplankton bloom producing a total of 323,161,989 base pairs. Our study confirms the finding of the first published metatranscriptomic studies of marine and soil environments that metatranscriptomics targets highly expressed sequences which are frequently novel. Our alternative methodology increases the range of experimental options available for conducting such studies and is characterized by an exceptional enrichment of mRNA (99.92%) versus ribosomal RNA. Analysis of corresponding metagenomes confirms much higher levels of assembly in the metatranscriptomic samples and a far higher yield of large gene families with >100 members, ~91% of which were novel.\\ud\n\\ud\nConclusions\/Significance\\ud\nThis study provides further evidence that metatranscriptomic studies of natural microbial communities are not only feasible, but when paired with metagenomic data sets, offer an unprecedented opportunity to explore both structure and function of microbial communities – if we can overcome the challenges of elucidating the functions of so many never-seen-before gene families.\\ud\n\\ud\n<\/dc:description><dc:date>\n        2008-08<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/5486\/1\/Gilbertjournal.pone.0003042%5B1%5D.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Gilbert, Jack A.; Field, Dawn; Huang, Ying; Edwards, Rob; Li, Weizhong; Gilna, Paul; Joint, Ian.  2008  Detection of large numbers of novel sequences in the metatranscriptomes of complex marine microbial communities.   PLoS ONE, 3 (8), e3042.   https:\/\/doi.org\/10.1371\/journal.pone.0003042 <https:\/\/doi.org\/10.1371\/journal.pone.0003042>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.plosone.org\/article\/info%3Adoi%2F10.1371%2Fjournal.pone.0003042<\/dc:relation><dc:relation>\n        doi:10.1371\/journal.pone.0003042<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/5486\/","http:\/\/www.plosone.org\/article\/info%3Adoi%2F10.1371%2Fjournal.pone.0003042","doi:10.1371\/journal.pone.0003042"],"year":2008,"topics":["Biology and Microbiology","Ecology and Environment","Data and Information"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Detection of Large Numbers of Novel Sequences in the\nMetatranscriptomes of Complex Marine Microbial\nCommunities\nJack A. Gilbert1*, Dawn Field2, Ying Huang3, Rob Edwards4,5, Weizhong Li3, Paul Gilna3, Ian Joint1\n1 Plymouth Marine Laboratory, Prospect Place, Plymouth, United Kingdom, 2NERC Centre for Ecology and Hydrology, CEH Oxford, Oxford, United Kingdom, 3California\nInstitute for Telecommunications and Information Technology, University of California San Diego, La Jolla, California, United States of America, 4Department of Computer\nScience, San Diego State University, San Diego, California, United States of America, 5Mathematics and Computer Science Division, Argonne National Laboratory,\nArgonne, Illinois, United States of America\nAbstract\nBackground: Sequencing the expressed genetic information of an ecosystem (metatranscriptome) can provide information\nabout the response of organisms to varying environmental conditions. Until recently, metatranscriptomics has been limited\nto microarray technology and random cloning methodologies. The application of high-throughput sequencing technology\nis now enabling access to both known and previously unknown transcripts in natural communities.\nMethodology\/Principal Findings: We present a study of a complex marine metatranscriptome obtained from random\nwhole-community mRNA using the GS-FLX Pyrosequencing technology. Eight samples, four DNA and four mRNA, were\nprocessed from two time points in a controlled coastal ocean mesocosm study (Bergen, Norway) involving an induced\nphytoplankton bloom producing a total of 323,161,989 base pairs. Our study confirms the finding of the first published\nmetatranscriptomic studies of marine and soil environments that metatranscriptomics targets highly expressed sequences\nwhich are frequently novel. Our alternative methodology increases the range of experimental options available for\nconducting such studies and is characterized by an exceptional enrichment of mRNA (99.92%) versus ribosomal RNA.\nAnalysis of corresponding metagenomes confirms much higher levels of assembly in the metatranscriptomic samples and a\nfar higher yield of large gene families with .100 members, ,91% of which were novel.\nConclusions\/Significance: This study provides further evidence that metatranscriptomic studies of natural microbial\ncommunities are not only feasible, but when paired with metagenomic data sets, offer an unprecedented opportunity to\nexplore both structure and function of microbial communities – if we can overcome the challenges of elucidating the\nfunctions of so many never-seen-before gene families.\nCitation: Gilbert JA, Field D, Huang Y, Edwards R, Li W, et al. (2008) Detection of Large Numbers of Novel Sequences in the Metatranscriptomes of Complex\nMarine Microbial Communities. PLoS ONE 3(8): e3042. doi:10.1371\/journal.pone.0003042\nEditor: Niyaz Ahmed, Centre for DNA Fingerprinting and Diagnostics, India\nReceived April 21, 2008; Accepted August 5, 2008; Published August 22, 2008\nCopyright: \u0001 2008 Gilbert et al. This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits\nunrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.\nFunding: This work is supported by a grant from the Natural Environment Research Council (NE\/C507902\/1) and is part of the core research program of the\nPlymouth Marine Laboratory, a collaborative centre of NERC. Supplementary funds for pyrosequencing were from a Science Budget award from the Biodiversity\nProgram of the Centre for Ecology and Hydrology. The project has been partially funded with US Federal funds from the National Institute of Allergy and\nInfectious Diseases, National Institutes of Health, Department of Health and Human Services, under Contract No. HHSN266200400042C. Funding for CAMERA was\nprovided by the Gordon and Betty Moore Foundation. No sponsors or funding agencies were involved in any of the design, or conduct of the study, nor the\ncollection, analysis or interpretation of the data, nor the preparation, review or approval of the manuscript.\nCompeting Interests: The authors have declared that no competing interests exist.\n* E-mail: jagi@pml.ac.uk\nIntroduction\nDNA sequence based metagenomics has become a standard\ntool for the analysis of natural microbial communities in marine\nenvironments [1,2,3]. It involves the sequencing of random\ncommunity DNA from environmental samples and subsequent\ndetermination of taxonomic and protein-encoding gene diversity.\nHowever, questions of how natural bacterial assemblages respond\nto perturbations in environmental conditions, are better answered\nby analysis of community mRNA than genomic DNA [4].\nHistorically, metatranscriptomic studies have involved either the\nuse of microarrays [5] or mRNA-derived cDNA clone libraries\n[6]. These approaches have produced significant insight into the\nmetatranscriptome of different communities but have limitations\nwhen exploring the diversity of natural communities. Firstly, a\nmicroarray only gives information about those sequences for\nwhich it was designed and it is usual to screen for gene sequences\nthat are already known (e.g. from a gene-library or metagenomic\nsources). Secondly, although transcript cloning avoids this problem\nthrough the random amplification and sequestering of environ-\nmental mRNA fragments, it introduces other biases; e.g. any\ncloned transcripts that encode toxic products or titrates host DNA-\nbinding factors will skew the relative abundance of sequences.\nMore recently, the first metatranscriptomic studies using high-\nthroughput sequencing technology (pyrosequencing) have been\npublished [7,8,9]. Two studies of soil communities have sequenced\ntotal RNA for the purpose of exploring both community structure,\nthrough the analysis of ribosomal RNA (rRNA), and community\nPLoS ONE | www.plosone.org 1 August 2008 | Volume 3 | Issue 8 | e3042\nfunction, through the study of mRNA [7,8]. The first study of a\nmarine microbial community metatranscriptome focused on mRNA\nanalysis and achieved an enrichment of ,50% mRNA [9].\nIdeally, if the study of mRNA is the prime purpose of a\nmetatranscriptomic study, further enrichment is desirable. Here\nwe present a study of a complex marine microbial metatran-\nscriptome enriched to 99.92% mRNA [10]. Metatranscriptomes\nwere generated from 4 samples taken at two time points in a\nreplicated mesocosm (11,000 liters) study involving an induced\nphytoplankton bloom [10]. Pyrosequencing technology (GS-FLX\npyrosequencer) was used to generate four metatranscriptomes and\nfour corresponding metagenomes with an average sequence length\nof 215 bp from the middle and end time point in the\nphytoplankton blooms. This experiment provided an opportunity\nto obtain replicate samples to explore the use of this approach for\ndetecting changes in the expression of genes over time. The\nprimary focus of the mesocosm experiment was to study the\nresponse of marine microbes to the increase in ocean acidification\nthat is resulting from dissolution of anthropogenic CO2 [10] and\nthese results will be described in detail elsewhere. The immediate\npurpose of this study was to 1) demonstrate the feasibility of\nobtaining highly enriched samples of mRNA (.90%) from these\ncommunities, 2) determine whether differences in expression could\nbe identified between time points of this controlled experiment\n[10], and finally 3) to determine what proportion of the most\nhighly expressed genes using such a methodology might be novel.\nMethods\nSampling, cDNA synthesis and sequencing\nWater samples were obtained from a replicated mesocosm study\n(two treatments, each in triplicate) established in coastal waters of a\nfjord close to Bergen, Norway (60.27uN: 5.22uE). Each mesocosm\ncontained 11,000 L of coastal water and two of the six mesocosms\nwere sampled for this study. To induce the phytoplankton bloom,\nnitrate and phosphate were added. Water samples were taken at\nthe peak and immediately following the collapse of the\nphytoplankton bloom from both a high CO2 and control\nmesocosm.\nThe nucleic acid extraction methodologies are briefly outlined\nin Gilbert et al. [10] but are fully described here. To isolate DNA\nand RNA, 15 L of water from each sample was filtered through a\n140 mm diameter, 1.6 mm GF\/A filter (Whatman), to reduce\neukaryotic cell abundance and maximize the proportion of\nprokaryotic cells. This filtration took only 3 minutes and the\nfiltrate was applied directly to a 0.22 mm Sterivex filter (Millipore)\nto allow rapid filtration of samples (,15 minutes per sample) to\nlimited mRNA degradation. Following filtration, each Sterivex\nwas pumped dry, frozen in liquid nitrogen and stored at 280uC\nuntil extraction. Total nucleic acid extraction was performed on\neach Sterivex using the method of Neufeld et al. [12]. Throughout\nthe protocol nuclease-free plastic consumables and DEPC-treated\nwater and reagents were used to limited degradation of mRNA.\nFollowing extraction, total nucleic acids were eluted in 200 ml of\nnuclease-free water.\nFor metagenomic analysis, 100 ml of the total nucleic acid\nextraction was purified for DNA by treatment with RiboShred-\nderTM RNase (Epicenter) following manufacturer’s instructions.\nPurified metagenomic DNA was quantified by nano-litre spectro-\nphotometry, diluted with nuclease-free water to 500 ng ml21 and\nthen stored at 280uC until pyrosequencing.\nFor metatranscriptomic analysis, 100 ml of the total RNA was\npurified using the RNA MinEluteTM clean-up kit (Qiagen); b-\nmercaptoethanol was added to the RLT buffer. Approximate\nRNA concentration was determined by nano-litre spectrophotom-\netry and checked for rRNA integrity using an Agilent bioanalyser\n(RNA nano6000 chip). Average RNA concentration was\n2.4 mg ml21. The integrity of rRNA was demonstrated by highly\ndefined, discrete rRNA peaks, with the 23S rRNA peak being 1.5–\n2 times higher than the 16S rRNA peak. Fully intact rRNA is\nessential for subtractive hybridization because degraded rRNA\nmolecules will not be fully subtracted from the total RNA pool.\nDNA contamination was removed from total RNA samples by\ntreating with the Turbo DNA-free enzyme (Ambion). 75 mg of\npurified total RNA was applied to the subtractive hybridization\nmethod (Microbe Express Kit, Ambion) to remove rRNA from the\nmRNA. Purified mRNA was eluted in 25 ml of TE buffer (10 mM\nTris-HCl pH 8.0, 1 mM EDTA) and was further purified with the\nMEGAclearTM kit (Ambion) to remove small RNAs and small\ncontaminants. Purified mRNA was eluted in 10 ml of nuclease free\nwater and stored at 280uC until further analysis. 0.5 ml of the\npurified mRNA was then checked using the Agilent bioanalyser\nfor removal of genomic DNA and ribosomal RNAs. The mRNA\nconcentration was estimated using the Agilent bioanalyser\nsoftware to average 450 ng ml21.\nmRNA was estimated to be approximately 8% of total RNA\nisolated. 9.5 ml of the purified mRNA was then applied to a\nreverse transcription reaction using the SuperScriptH III enzyme\n(Invitrogen) with random hexamer primers (Promega). The cDNA\nwas treated with RiboShredderTM RNase Blend (Epicentre) to\nremove trace RNA contaminants. To improve the yield of cDNA,\n1 ml of each sample was subjected to random amplification using\nthe GenomiPHITM V2 method (GE Healthcare) yielding approx-\nimately 4 mg of cDNA. GenomiPHI technology produces\nbranched DNA molecules that are recalcitrant to the pyrosequen-\ncing methodology. Therefore amplified samples were treated with\nS1 nuclease using the method of Zhang et al. [13]. DNA and\ncDNA were nebulized to produce an average size of 500 bp, then\ncleaned with AMPure beads (Agencourt) and sequenced using the\n454 Corporation’s GS-FLX instrument at the NERC-funded\nAdvanced Genomics Facility at the University of Liverpool\n(http:\/\/www.liv.ac.uk\/agf\/). Extraneous sequences resulting from\n.1 template molecule per picotitre well were removed from the\ndatasets (Table 1) as they include exact duplicates and failed\nsequences that are replete with uncharacterized nucleotides.\nMetatranscriptomic and metagenomic data sets were deposited\nin NCBIs Gene Expression Omnibus (GEO, http:\/\/www.ncbi.\nnlm.nih.gov\/geo\/) and are accessible through GEO Series\naccession number GSE10119. All data is also deposited with the\nShort Reads Archive (NCBI) under accession number\nSRA000266. These datasets are also available with richer\nannotates in ISATAB format [14] compliant with the ‘‘Minimum\nInformation about a (Meta) Genome Sequence’’ (MIGS) specifi-\ncation [15].\nClustering of DNA and mRNA and prediction of partial\nORFs (pORFs)\nClustering analysis was performed on the raw reads and\ntranslated peptide sequences (see below) using the CD-HIT\npackage [16]. The reads from all eight samples were clustered\ntogether with CD-HIT-EST program. Sequences were clustered if\nthe identity was $95% (++ or +2 strand) and the length of the\nalignment was $40 bp and $80% length of the shorter sequence.\nThe clustering results show the internal structure of the combined\ndataset including number of non-redundant sequences, distribu-\ntion of clustering, number of singletons, etc. The same analysis was\napplied to each individual sample by counting only the sequences\nfrom that sample. Results are shown in rows 5–11 in Table 1.\nNovel Marine Metatranscripts\nPLoS ONE | www.plosone.org 2 August 2008 | Volume 3 | Issue 8 | e3042\nT\na\nb\nle\n1\n.\nC\no\nm\np\nar\nis\no\nn\no\nf\nD\nN\nA\nan\nd\nm\nR\nN\nA\nfr\no\nm\nsa\nm\np\nle\ns\nfr\no\nm\nm\nid\n-\nan\nd\np\no\nst\n-p\nh\nyt\no\np\nla\nn\nkt\no\nn\nb\nlo\no\nm\n.\nM\nid\n-B\nlo\no\nm\nP\no\nst\n-B\nlo\no\nm\nC\no\nm\nb\nin\ne\nd\nd\na\nta\nD\nN\nA\n-H\nig\nh\nC\nO\n2\nm\nR\nN\nA\n-H\nig\nh\nC\nO\n2\nD\nN\nA\n-P\nre\nse\nn\nt\nD\na\ny\nm\nR\nN\nA\n-P\nre\nse\nn\nt\nD\na\ny\nD\nN\nA\n-H\nig\nh\nC\nO\n2\nm\nR\nN\nA\n-H\nig\nh\nC\nO\n2\nD\nN\nA\n-P\nre\nse\nn\nt\nD\na\ny\nm\nR\nN\nA\n-P\nre\nse\nn\nt\nD\na\ny\nA\nll\nD\nN\nA\nA\nll\nm\nR\nN\nA\nA\nll\nsa\nm\np\nle\ns\nT\no\nta\nl\nsi\nze\n(M\nb\np\n)\n4\n7\n,2\n8\n9\n,2\n8\n2\n3\n0\n,5\n6\n7\n,3\n7\n7\n3\n0\n,9\n9\n1\n,6\n8\n9\n3\n8\n,0\n2\n1\n,5\n2\n3\n5\n9\n,3\n1\n6\n,3\n6\n9\n2\n1\n,8\n0\n5\n,9\n5\n5\n6\n8\n,1\n8\n7\n,6\n7\n9\n2\n6\n,9\n8\n2\n,1\n9\n5\n2\n0\n5\n,7\n8\n4\n,9\n3\n9\n1\n1\n7\n,3\n7\n7\n,0\n5\n0\n3\n2\n3\n,1\n6\n1\n,9\n8\n9\nT\no\nta\nl\nN\no\n.\no\nf\nre\nad\ns\n2\n0\n9\n,0\n7\n3\n1\n3\n1\n,0\n8\n9\n1\n3\n4\n,9\n1\n5\n1\n6\n2\n,8\n7\n1\n3\n4\n4\n,2\n1\n6\n9\n6\n,2\n0\n1\n3\n0\n4\n,0\n2\n0\n1\n1\n6\n,1\n9\n2\n9\n9\n2\n,2\n2\n4\n5\n0\n6\n,3\n5\n3\n1\n,4\n9\n8\n,5\n7\n7\nA\nve\nra\ng\ne\nle\nn\ng\nth\n(b\np\n)\n2\n2\n6\n2\n3\n3\n2\n2\n9\n2\n3\n3\n1\n7\n2\n2\n2\n6\n2\n2\n4\n2\n3\n2\n2\n0\n7\n2\n3\n1\n2\n1\n5\n%\no\nf\nrR\nN\nA\ng\ne\nn\ne\nsa\n0\n.3\n3\n0\n.1\n6\n0\n.3\n1\n0\n.1\n0\n.1\n7\n0\n.0\n3\n0\n.2\n4\n0\n.0\n3\n0\n.2\n5\n0\n.0\n8\n0\n.1\n6\nA\nb\nso\nlu\nte\nn\nu\nm\nb\ne\nr\no\nf\nu\nn\niq\nu\ne\nn\nu\ncl\ne\no\nti\nd\ne\nse\nq\nu\ne\nn\nce\ncl\nu\nst\ne\nrs\nb\n1\n7\n0\n,5\n8\n0\n6\n5\n,7\n1\n7\n1\n1\n2\n,4\n5\n9\n6\n7\n,2\n8\n3\n2\n5\n7\n,3\n7\n5\n9\n,3\n4\n9\n2\n3\n2\n,7\n2\n9\n1\n0\n,7\n0\n3\n6\n3\n0\n,1\n5\n9\n1\n3\n3\n,4\n4\n7\n7\n2\n3\n,0\n5\n0\nN\no\nrm\nal\niz\ne\nd\nn\nu\nm\nb\ne\nr\no\nf\ncl\nu\nst\ne\nrs\nc\n8\n6\n,7\n9\n1\n5\n0\n,3\n2\n0\n8\n4\n,0\n9\n6\n4\n3\n,2\n1\n3\n8\n6\n,9\n9\n6\n9\n,3\n4\n9\n8\n7\n,1\n1\n2\n9\n,2\n8\n1\nn\n\/a\nn\n\/a\nn\n\/a\nT\no\nta\nl\nn\nu\nm\nb\ne\nr\no\nf\nre\nad\ns\nin\nto\np\ncl\nu\nst\ne\nr\n1\n2\n9\n8\n8\n2\n3\n9\n3\n2\n1\n9\n2\n,0\n1\n9\n2\n0\n2\n,4\n2\n1\n3\n6\n4\n8\n6\n0\n4\n8\n6\n6\nC\nlu\nst\ne\nri\nn\ng\n:\n1\nse\nq\nu\ne\nn\nce\n1\n4\n1\n,3\n4\n0\n5\n6\n,1\n2\n6\n9\n4\n,3\n8\n6\n5\n5\n,6\n9\n1\n2\n0\n0\n,5\n6\n9\n7\n,3\n9\n7\n1\n8\n3\n,0\n2\n8\n8\n,1\n0\n6\n4\n3\n7\n,1\n4\n9\n1\n0\n7\n,5\n9\n3\n4\n9\n4\n,6\n0\n4\n2\n–\n9\nse\nq\nu\ne\nn\nce\ns\n2\n9\n,2\n3\n2\n8\n,8\n2\n4\n1\n8\n,0\n7\n2\n1\n0\n,3\n6\n7\n5\n6\n,7\n2\n9\n1\n,1\n8\n2\n4\n9\n,6\n8\n1\n1\n,6\n7\n7\n1\n9\n1\n,8\n2\n2\n2\n3\n,2\n2\n4\n2\n2\n4\n,1\n9\n8\n1\n0\n–\n9\n9\nse\nq\nu\ne\nn\nce\ns\n8\n6\n5\n2\n1\n1\n,0\n3\n2\n7\n7\n5\n5\n2\n2\n0\n6\n7\n3\n1\n1\n8\n8\n2\n,0\n1\n1\n3\n,6\n3\n9\n1\n0\n0\n+\nse\nq\nu\ne\nn\nce\ns\n0\n1\n1\n5\n0\n1\n9\n3\n0\n2\n1\n8\n0\n2\n4\n7\n0\n6\n1\n9\n6\n0\n9\nSE\nED\nSu\nb\nsy\nst\ne\nm\nh\nit\ns\n1\n3\n0\n,5\n6\n7\n7\n5\n,8\n8\n4\n1\n2\n0\n,1\n4\n1\n8\n3\n,0\n7\n6\n1\n6\n1\n,7\n8\n9\n1\n6\n,5\n4\n5\n1\n7\n5\n,4\n7\n7\n1\n8\n,3\n1\n5\nn\n\/a\nn\n\/a\nn\n\/a\nT\no\nta\nl\np\nO\nR\nFs\nd\n4\n1\n9\n,5\n6\n5\n2\n8\n4\n,6\n6\n5\n2\n7\n9\n,0\n6\n1\n3\n4\n5\n,5\n0\n2\n5\n3\n2\n,3\n7\n3\n2\n3\n7\n,1\n8\n7\n6\n3\n7\n,8\n9\n6\n2\n8\n9\n,9\n5\n1\n1\n,8\n6\n8\n,8\n9\n5\n1\n,1\n5\n7\n,3\n0\n5\n3\n,0\n2\n6\n,2\n0\n0\nU\nn\niq\nu\ne\np\nO\nR\nFs\nat\n9\n5\n%\ne\n3\n5\n8\n,7\n0\n5\n1\n4\n0\n,7\n6\n3\n2\n4\n2\n,3\n1\n7\n1\n4\n7\n,6\n9\n7\n4\n3\n5\n,8\n7\n6\n3\n1\n,1\n0\n4\n5\n1\n5\n,2\n6\n6\n3\n6\n,1\n1\n3\n1\n,3\n4\n0\n,2\n4\n1\n2\n9\n9\n,8\n9\n8\n1\n,5\n7\n1\n,3\n4\n8\nP\nro\nte\nin\ncl\nu\nst\ne\nrs\nf\n3\n2\n1\n,8\n3\n9\n1\n2\n0\n,2\n2\n0\n2\n2\n3\n,8\n8\n8\n1\n2\n1\n,5\n4\n7\n3\n8\n2\n,7\n6\n2\n1\n6\n,6\n4\n1\n4\n5\n2\n,7\n5\n4\n1\n9\n,2\n5\n9\n1\n,0\n8\n3\n,6\n4\n4\n2\n3\n8\n,6\n5\n5\n1\n,2\n2\n8\n,6\n0\n1\nP\nro\nte\nin\ncl\nu\nst\ne\nrs\ng\nw\nit\nh\nsi\nm\nila\nri\nty\nto\n:\n1\n1\n2\n9\n6\n3\n4\n6\n8\n2\n9\n5\n1\n6\n3\n1\n5\n8\n9\n6\n9\n5\n1\n,1\n3\n1\n2\n,0\n2\n9\nP\nFA\nM\nh\n9\n1\n9\n1\n2\n3\n1\n4\n5\n6\n1\n3\n6\n3\n3\n7\n9\n7\n6\n5\n7\n1\nT\nIG\nR\nfa\nm\ni\n9\n0\n1\n0\n1\n2\n0\n7\n0\n3\n6\n6\n1\n4\n7\n6\nC\nO\nG\nj\n1\n0\n2\n1\n0\n1\n8\n0\n1\n7\n0\n4\n3\n1\n6\n5\n7\n2\nN\nu\nm\nb\ne\nr\no\nf\nn\no\nve\nl\nP\nro\nte\nin\ncl\nu\nst\ne\nrs\nk\n0\n2\n7\n6\n2\n4\n4\n4\n9\n4\n4\n7\n1\n2\n5\n0\n9\n2\n0\n2\n1\n0\n2\n6\n1\n2\n8\n7\nSi\nze\n,\ncl\nu\nst\ne\nri\nn\ng\nan\nd\nan\nn\no\nta\nti\no\nn\nd\nat\na\nw\ne\nre\ng\ne\nn\ne\nra\nte\nd\nb\ny\nC\nA\nM\nER\nA\n.\nrR\nN\nA\nan\nd\nsu\nb\nsy\nst\ne\nm\nh\nit\ns\nw\ne\nre\ng\ne\nn\ne\nra\nte\nd\nb\ny\nSE\nED\n.\na\nA\nn\nal\nys\nis\no\nf\nse\nq\nu\ne\nn\nce\ns\nag\nai\nn\nst\nth\ne\nR\nib\no\nso\nm\nal\nD\nat\nab\nas\ne\nP\nro\nje\nct\nII\n(R\nD\nP\n-I\nI)\nan\nd\nth\ne\nEu\nro\np\ne\nan\nR\nib\no\nso\nm\nal\nla\nrg\ne\nsu\nb\nu\nn\nit\n(L\nSU\n)d\nat\nas\ne\nt.\nb\nB\nas\ne\nd\no\nn\ncl\nu\nst\ne\nri\nn\ng\nat\n9\n5\n%\nid\ne\nn\nti\nty\no\nve\nr\n8\n0\n%\nle\nn\ng\nth\no\nf\na\nse\nq\nu\ne\nn\nce\nan\nd\no\nve\nr\n1\n2\n0\nb\np\n.\nc\nFo\nr\nd\nir\ne\nct\nco\nm\np\nar\nis\no\nn\no\nf\nsa\nm\np\nle\ns,\nin\nd\niv\nid\nu\nal\nra\nre\nfa\nct\nio\nn\nan\nal\nys\nis\n,b\ny\nR\n(h\ntt\np\n:\/\n\/w\nw\nw\n.r\n-p\nro\nje\nct\n.o\nrg\n\/)\nan\nd\nth\ne\nve\ng\nan\np\nac\nka\ng\ne\n(h\ntt\np\n:\/\n\/c\nc.\no\nu\nlu\n.f\ni\/˜\nja\nri\no\nks\na\/\nso\nft\nh\ne\nlp\n\/v\ne\ng\nan\n.h\ntm\nl)\n,w\nas\nu\nse\nd\nto\ne\nst\nim\nat\ne\nth\ne\nn\nu\nm\nb\ne\nr\no\nf\ncl\nu\nst\ne\nrs\nin\ne\nac\nh\nsa\nm\np\nle\naf\nte\nr\nad\nju\nst\nin\ng\nsa\nm\np\nle\nsi\nze\no\nf\ne\nac\nh\nd\nat\nas\ne\nt\nto\nb\ne\ne\nq\nu\niv\nal\ne\nn\nt\nto\nth\ne\nn\nu\nm\nb\ne\nr\no\nf\nre\nad\ns\nin\nth\ne\nsm\nal\nle\nst\nd\nat\nas\ne\nt\n(m\nR\nN\nA\n–\nH\nig\nh\nC\nO\n2\n).\nd\nP\nar\nti\nal\nO\np\ne\nn\nR\ne\nad\nin\ng\nFr\nam\ne\ns\n(p\nO\nR\nFs\n)\nfr\no\nm\nsi\nx\nre\nad\nin\ng\nfr\nam\ne\ntr\nan\nsl\nat\nio\nn\nfr\no\nm\nal\nlr\ne\nad\ns\nu\nsi\nn\ng\ntr\nan\nsl\nat\nio\nn\nta\nb\nle\n1\n1\n,s\nta\nrt\nin\ng\nat\nth\ne\nb\ne\ng\nin\nn\nin\ng\no\nf\na\nre\nad\no\nr\nfi\nrs\nt\nA\nT\nG\naf\nte\nr\np\nre\nvi\no\nu\ns\nst\no\np\nco\nd\no\nn\n,e\nn\nd\nin\ng\nat\nth\ne\ne\nn\nd\no\nf\na\nre\nad\n,o\nr\nat\na\nst\no\np\nco\nd\no\nn\nan\nd\nb\ne\nin\ng\nat\nle\nas\nt\n3\n0\nco\nn\nti\ng\nu\no\nu\ns\nam\nin\no\nac\nid\ns.\ne\nT\no\nta\nl\np\nO\nR\nF\nre\nad\ns\ncl\nu\nst\ne\nre\nd\nat\n9\n5\n%\nid\ne\nn\nti\nty\no\nf\no\nve\nr\n8\n0\n%\nle\nn\ng\nth\no\nf\nse\nq\nu\ne\nn\nce\ns.\nf C\nlu\nst\ne\nrs\nar\ne\nid\ne\nn\nti\nfi\ne\nd\nu\nsi\nn\ng\nth\ne\nre\np\nre\nse\nn\nta\nti\nve\nse\nq\nu\ne\nn\nce\ns\no\nf\ne\nac\nh\ncl\nu\nst\ne\nr\nfr\no\nm\nth\ne\n9\n5\n%\nst\ne\np\nto\ncl\nu\nst\ne\nr\nat\n6\n0\n%\nid\ne\nn\nti\nty\no\nf\no\nve\nr\n8\n0\n%\nle\nn\ng\nth\no\nf\nse\nq\nu\ne\nn\nce\ns.\ng\nT\nh\ne\nd\no\nm\nin\nan\nt\ncl\nu\nst\ne\nrs\n($\n1\n0\nn\no\nn\n-r\ne\nd\nu\nn\nd\nan\nt\nse\nq\nu\ne\nn\nce\ns)\nw\nit\nh\nth\ne\ne\nxc\nlu\nsi\no\nn\no\nf\nsp\nu\nri\no\nu\ns\np\nO\nR\nFs\n.\nh\nP\nro\nte\nin\nfa\nm\nili\ne\ns\nd\nat\nab\nas\ne\n.\ni T\nh\ne\nIn\nst\nit\nu\nte\nfo\nr\nG\ne\nn\no\nm\nic\nR\ne\nse\nar\nch\np\nro\nte\nin\nd\nat\nab\nas\ne\n.\nj N\nC\nB\nI\ncl\nu\nst\ne\nrs\no\nf\no\nrt\nh\no\nlo\ng\no\nu\ns\ng\nro\nu\np\ns\nd\nat\nab\nas\ne\n.\nk\nW\nit\nh\n$\n1\n0\nn\no\nn\n-r\ne\nd\nu\nn\nd\nan\nt\ncl\nu\nst\ne\nre\nd\nse\nq\nu\ne\nn\nce\ns\ne\nxc\nlu\nd\nin\ng\nsp\nu\nri\no\nu\ns\nO\nR\nFs\n.\nn\n\/a\n–\nn\no\nt\nan\nal\nyz\ne\nd\n.\nd\no\ni:1\n0\n.1\n3\n7\n1\n\/j\no\nu\nrn\nal\n.p\no\nn\ne\n.0\n0\n0\n3\n0\n4\n2\n.t\n0\n0\n1\nNovel Marine Metatranscripts\nPLoS ONE | www.plosone.org 3 August 2008 | Volume 3 | Issue 8 | e3042\nORFs (including pORFs) were then predicted. Since genes\ncannot be reliably predicted from such short reads, we applied the\nmethodology used in the Global Ocean Survey (GOS) study [2,3],\ncalling pORFs from all six reading frames. As the current study\nhad overall shorter reads than the GOS study (average of 215 bp\ninstead of 822 bp) pORFs had to contain at least 30 amino acids.\nIn total 3,026,200 pORFs were detected. The approach of six\nreading frame translation can result in many non coding (shadow)\npORFs, or spurious pORFs. However, this is less likely with short\nsequence data because the translations from non-coding frames\nare usually too short (due to random occurrence of stop codons) to\nrank as pORFs using our selected cut-off threshold.\nThe protein gene coding density, according to the most recent\nNCBI RefSeq database for microbial organisms (ftp:\/\/ftp.ncbi.nih.\ngov\/refseq\/release\/release-statistics\/RefSeq-release27.01062008.\nstats.txt), is about 0.25 million amino acid per 1 million base pairs\n(bp). This study, which obtained 162 million amino acids from\n323 million bp of sequence, shows only 50% of these pORFs were\nspurious. Clustering of pORFs can further help to exclude spurious\npORFs which are more likely to remain singletons.\nThe pORFs were clustered with two-step CD-HIT runs. At the\nfirst step, pORFs were clustered at 95% identity over 80% of\nsequence length in order to identify non-redundant sequences.\nThe non-redundant sequences were further clustered at 60%\nidentity, over 80% of sequence coverage, to find clusters of\nhomologous pORFs or protein families (see row d, e, f in Table 1).\nHere, we only use the non-redundant sequences to count the size\nof each cluster so that the large clusters reported in row g in\nTable 1 contain diverse sequences. The same clustering\ntechniques were also applied to the data from the metatranscrip-\ntomic study of Frias-Lopez and colleagues [9] (Table S1).\nDividing pORFs into ‘predicted, ‘spurious’ and ‘putative’\nThe clusters of pORFs were annotated by comparison to the\nPFAM database (http:\/\/PFAM.sanger.ac.uk\/) by Hmmer, TIGR-\nfam database (http:\/\/www.tigr.org\/TIGRFAMs\/) by Hmmer and\nthe COG database (http:\/\/www.ncbi.nlm.nih.gov\/COG\/) by\nRPS-BLAST (reversed PSI-BLAST). All analyses were annotated\nwith an expect value cut-off of 0.001. Hmmer analysis was\nperformed in fragmental mode, and each hit also had to pass the\nTC score. The pORFs with significant matches to these reference\ndatabases were confirmed as genes, while the pORFs that\noverlapped with them from a different reading frame (the shadow\npORFs) were deemed spurious pORFs. From this final analysis of\nthe 3,026,200 pORFs, 494,253 could be confirmed as predicted\nproteins, 459,150 excluded as spurious pORFs, and the remainder\n(2,072,797) marked as ‘‘putative proteins’’. The combined\npredicted and putative proteins were used for subsequent analysis.\nPCR detection of dominant orphan gene clusters in\nenvironmental DNA and mRNA\nTo validate the presence of highly expressed orphaned sequence\nclusters in the environment we randomly selected 27 of the most\nhighly expressed nucleotide clusters. It was necessary to establish\nthe presence of these sequences in both original DNA samples and\ncDNA samples to show they were not artefacts of cDNA\namplification by GenomiPHI. To further cluster the 609 dominant\nnucleotide clusters (.100 sequences per cluster) for the purpose of\ndesigning PCR primers, all clusters were re-clustered at 95%\nidentity over at least 40 base pairs. This allowed sequences with\nsmall 59 or 39 overlaps to be clustered together and increased the\nprobability that the sequences assayed represented different\ntranscripts. This reduced the number of dominant clusters from\n609 to 85 (Table S2) and resulted in a significant increase in the\nnumber of clusters with more than 5,000 reads each. The\nmaximum number of sequences in the largest cluster was 31,642\nand 15 clusters now contained more than 5,000 reads. This\nprovided a smaller pool of sequences for analysis and reduced the\nlikelihood of amplifying similar sequences.\nPrimers were designed to screen 27 of these potential transcripts\nusing the batch Primer3 online interface (http:\/\/probes.pw.usda.\ngov\/cgi-bin\/batchprimer3\/batchprimer3.cgi), with the following\nconservative rules. First, we targeted the ‘representative’ sequence\nof each cluster (as opposed to the consensus sequence) to maximize\nthe length of the query DNA sequence and avoid use of chimeric\nsequence that could have resulting from false assembly of the\noriginal 609 clusters. Second, we iteratively explored a range of\nparameters to find a rule that allows us to automatically create\nprimers (no manual inspection required) for all 85 loci using a\nsingle set of optimality criteria that were as stringent as possible. In\nthe end, we took the default parameters of the interface and\noptimized the following parameters: annealing temp (55uC),\noverall length of product (100 bp), primer size (20 bp), G+C\ncontent (50%) and minimum ‘‘maximum self-complementary’’.\nExact optimality criteria used for the selection of each batch of\nprimers is available from the authors.\nIndividual transcript sequences were amplified by PCR from the\nenvironmental DNA used for the metagenomic analyses (co-\nextracted with the mRNA used for the metatranscriptomic\napproach), purified mRNA prior to RT-PCR and cDNA prior\nto GenomiPHI amplification. Each of the 54 primers (http:\/\/\nnebc.nox.ac.uk\/nebcfs\/public\/Joint\/metatranscript_primers.xls)\nwere diluted to a working concentration of 10 pmol ml21.\nApproximately 10 ng of environmental DNA, cDNA or mRNA\nwas added to a 25 ml PCR reaction with final concentrations of\n16PCR buffer (Promega), 2.5 mM MgCl2, 0.2 mM deoxynucleo-\nside triphosphates (Invitrogen), 0.4 pmol of each primer, and 1\nunit of Taq DNA polymerase (Promega). Negative controls used\nwere Escherichia coli K12 genomic DNA and sterile water.\nReactions were cycled with a PTC 1000 thermal cycler (MJ\nResearch) using the following conditions; 94uC for 2 minutes, 30\ncycles of 94uC for 1 minute, 55uC for 1 minute, 72uC for\n2 minutes, and a final extension of 72uC for 10 minutes. Products\nwere visualised by agarose gel electrophoresis (1.8%).\nResults and Discussion\nWe demonstrate the feasibility of conducting metatranscrip-\ntomic studies on RNA samples highly enriched for mRNA from\nnatural microbial communities. This is the first time such a high\nlevel of enrichment has been achieved in a metatranscriptomic\nstudy (Table 2). Eight samples, four DNA and four mRNA,\nwere processed producing a total of 323,161,989 bp (117.4 Mbp\nof mRNA and 205.7 Mbp of DNA). This exceeds previously\npublished metatranscriptomic studies because of the inclusion of\nreplicated samples. By further contrast, this is equivalent to 5.1%\nof the total bp sequenced, and 19% of the number of reads of the\nrecent Global Ocean Survey (GOS) sequencing effort [2]. Here\nwe present an analysis of these data that confirms the high level\nof enrichment for mRNA and the high levels of assembly of\nmRNA sequences compared to the DNA of the metagenomes;\nwe also speculate on the potential coverage of the natural\nmetatranscriptome sampled and discuss potential biases intro-\nduced by this methodology and provide evidence against the\nlarge-scale generation of mosaics and artefacts by the use of\nGenomiPHI amplification. We then discuss the proportion of\nthese mRNAs that match protein databases, discuss the most\nabundant ‘known’ clusters, and compare the metatranscriptome\nNovel Marine Metatranscripts\nPLoS ONE | www.plosone.org 4 August 2008 | Volume 3 | Issue 8 | e3042\nwith the metagenome and with the first published study of a\nmarine metatranscriptome [9].\nDetermining the proportion of ribosomal RNA remaining\nin mRNA metatranscriptomic samples\nBoth DNA and mRNA sequences were analyzed using the\npublicly-available SEED MG-RAST (Metagenome Rapid Anno-\ntation using Subsystem Technology, http:\/\/metagenomics.the-\nseed.org [17,18]), which compares inputted sequences against a\ndatabase of metabolic systems from selected organisms. Taxo-\nnomic information for the metagenomes within SEED was\nobtained by comparison against three 16S rDNA databases (the\nRibosomal Database Project II (RDP), Greengenes, and the\nEuropean Ribosomal Database). Although rRNA comprises\napproximately 80–90% of total RNA in a typical bacterium\n[19], it averaged only 0.08% of the total number of sequences in\nthe four combined cDNA libraries (Table 1). The purification was\nfar more efficient than would be predicted for the methodology\nand capture-probe range of the Microbe Express kit (Ambion)\nused for the subtractive hybridisation of rRNA. This could be\nbecause the 16S rRNA probes used in the subtractive hybridisa-\ntion technique may hybridise to a more significant proportion of\nthe community than previously considered. While this might lead\nto a more substantial removal, it cannot explain the near-complete\nremoval seen in this study. A second more likely possibility is that\nthe multiple displacement amplification approach (GenomiPHI)\nused to amplify the available mRNA, inefficiently amplified rRNA\ndue to its inherent secondary structure that could have inhibited\nthe reaction (GE Healthcare technical services communication).\nBoth of these options should be further tested.\nComparisons of homology between datasets\nTo determine the similarity of each dataset to each other, total\nnucleic acids between each database and total partial ORFs\n(pORFs) between each database were compared to provide an\nindication of the number of homologous sequences shared\nbetween each pair of datasets (Table S3). This demonstrated\nthat each DNA dataset shared approximately 10% to 25% of the\nnucleic acid sequences and 20% to 33% of the pORF sequences.\nThis suggests that the majority of sequences within each group\nwere unique (singletons) to each dataset; a similar result was seen\nin the Global Ocean Survey when the metagenomes of different\nregions were compared [2]. The comparison between mRNA\ndatasets showed a clear delineation between mid-bloom and post-\nbloom, with mid-bloom mRNA sharing ,50% of their nucleic\nacid transcripts and post-bloom sharing .95% of their nucleic\nacid transcripts. This result was consistent when the datasets were\ncompared between time points, with ,50% of mid-bloom\ntranscripts being homologous with ,90% of post-bloom tran-\nscripts (Table S3). We postulate below that this difference could\nbe due to an over-abundance of viral transcripts in the post-bloom\nenvironment causing the metatranscriptomes to become more\nhomogenous.\nIt was expected that the metatranscriptome from the post-\nbloom environment would be more similar to the metagenome\nfrom the post-bloom environment than the mid-bloom samples.\nThe comparison clearly demonstrates this (Table S3). The mid-\nbloom metagenomes also had greater homology to the mid-bloom\nmetatranscriptomes than the post-bloom metatranscriptomes.\nClustering of DNA and mRNA sequences confirms higher\nlevels of assembly of mRNAs and differences between\ntime points\nTo determine the possible level of assembly of sequence clusters,\ntotal DNA and mRNA sequences were analyzed using a\nmetagenomic sequence analysis pipeline developed at CAMERA\n(Community Cyberinfrastructure for Advanced Marine Microbial\nEcology Research and Analysis [20]) (access to this pipeline can be\narranged by contacting the corresponding author). The number of\nunique sequences was calculated by clustering un-assembled\nsequence reads as described in the Materials and Methods [16].\nAs shown in Table 1 an average of 79% of the DNA-derived\nmetagenome sequences from both mid- and post-bloom samples\nwere unique (singletons). This confirms the low level of coverage of\nthe genomes in this sample and the high diversity. In contrast, the\nmRNA-derived sequences showed much higher levels of cluster-\ning, with an average of 45% of the sequences from the mid-bloom\n(time point 1) and only 9.5% of the post-bloom sequences (time\npoint 2) being unique (Table 1) (calculated by dividing the total\nnumber of unique sequence clusters by the total number of\nTable 2. Comparison of methods described by current manuscript with the three most recent methods for analysing microbial\nmetatranscriptomes.\nLeininger et al [7]; Urich et al [8] Frias-Lopez et al. [9] Gilbert et al [10] (and this study)\nHabitat Soil (Nutrient-poor, sandy-soil) Marine (oligotrophic ocean) Marine (eutrophic coastal waters)\nTotal biological samples 1 (1 metatranscriptome) 1 (1 metatranscriptome, 1 metagenome) 4 (4 metatranscriptomes, 4 metagenomes)\nTotal DNA\/RNA (Millions bp) ,25.32 ,60.1 ,323.2\nRNA purification methodology Griffiths et al [11] method from\n6 g of soil.\nmirVana RNA isolation kit (Ambion)\nfrom 1 L of sea water\nNeufeld et al, [12] method and MinElute RNA\ncleanup (Qiagen) from 15 L of seawater\nmRNA isolation and\namplification methodology\nN\/A * mRNA amplification using MEssageAmp\nII-Bacterial kit (Ambion)\nMicrobeExpress and Megaclear kit (Ambion).\nGenomiPHI amplification (GE Healthcare)\nRNA sequencing GS20-pyrosequencing GS-20 pyrosequencing GS-flx pyrosequencing\nAverage length 98 bp 112 bp 215 bp\nYield of mRNA sequences 8.2% 47.1% 99.9%\nYield of orphaned sequences 22% (60% of mRNA assigned tags)1 89.5%2 87%2\n1based on hits to nucleotide sequences using the MG-RAST Seed database.\n2based on hits to potential open reading frames using the PFAM, TIGRfam and COG protein databases.\n*Not performed, rRNA and mRNA expressly sequenced together to examine both community structure and function.\ndoi:10.1371\/journal.pone.0003042.t002\nNovel Marine Metatranscripts\nPLoS ONE | www.plosone.org 5 August 2008 | Volume 3 | Issue 8 | e3042\nsequence reads). Strikingly, only five of the 609 largest nucleotide-\nlevel mRNA clusters (those with$100 sequences) had an observed\nmatch in any of the DNA metagenomes. This low level of\nhomology between mRNA sequences and the community DNA\nmetagenome was previously noted [9] and is expected given the\nsparse sequence coverage for the much larger metagenome.\nAlternatively, this could be an overestimate of the lack of\nhomology as it is possible for any of the RNA clusters to actually\ncome from the same transcript. For example, an mRNA cluster\nfrom the first 25% of a given gene (average gene length ,950 bp\n[21]) would appear to have no match even if the DNA library\ncaptured the other 75% of the gene. Unfortunately, there is no\nway to resolve this issue given the small size of sequences currently\ngenerated with pyrosequencing methodology.\nTo directly compare the level of assembly (diversity) in the eight\nsamples, individual rarefaction was used to normalize the number\nof clusters to an equivalent sampling effort (i.e. that of the smallest\nsample) (Table 1). The number of clusters in all four DNA\nsamples was surprisingly uniform and was double the number of\nclusters from the mid-bloom and nine times from the post-bloom\nmRNA samples. These results show that the metatranscriptome is\nsmaller than the metagenome, assembles better, and that the\nexpression of genes is different for mid-bloom and post-bloom\ncommunities. Of these an average of 0.23% of mid-bloom and\n2.3% of post-bloom transcript clusters included more than 100\nsequences. In other words, the transcription profile became more\nhomogenous in the post-bloom situation.\nBased on this clustering, we compared the total number of clusters\nfound to the total number expected within a given water sample. To\ngenerate a rough estimate of potential metatranscriptome coverage,\nwe used the approach of Poretsky et al. [6] to estimate that each water\nsample contained ca. 80,000 unique transcripts. This estimate is based\non the observed number of dominant taxa and bacterial abundance\n(data not shown). This is the same order of magnitude as the number\nof unique mRNA sequences identified (Table 1) suggesting that this\nstudy may have achieved a reasonable coverage of the community\nmetatranscriptome (in comparison, the metagenomes were vastly\nunder-sampled). This is clearly an upper estimate, and given that the\ntop 609 nucleotide clusters could be collapsed with less conservative\nclustering criteria into 85 larger clusters (see Materials and Methods),\nthe actual number of transcripts could be 7-fold ormore lower. Indeed\nthe real value could be even lower, since one functional transcript may\nbe coded for by more than one cluster (Table 3). We have previously\nshown this for another gene, phnA, that encodes phosphonoacetate\nhydrolase; the phnA from one organism had twelve hits within the\nmetagenomic data, which were spread out over the gene [10]. Using\nthe clustering methodology outlined here, this method would have\nidentified this one gene as belonging to six different clusters due to\noverlap between the 12 sequences.\nEvidence against potential biases in detecting naturally\noccurring mRNA clusters introduced by GenomiPHI\nThere are two key biases that might be introduced using the\nmethodology presented here. Firstly, the time required to\nconcentrate the community by filtration is longer than the half-\nlife of mRNA, but this is true of most methods used to analyze the\nmetatranscriptome of aquatic samples [6]. Recent studies\nhowever, have used smaller volumes (e.g. ,1 L [9]), and the\ncurrent methodology would still be effective using these smaller\nvolumes. However, in the current study this methodology was run\nconcomitantly with other analyses that required a significant\namount of DNA, e.g. fosmid library production [10].\nSecondly, amplification of cDNA using GenomiPHI could\nintroduce artefactual sequences (although evidence of such a bias\nfor transcriptome amplification does not exist [22]). Such artefacts\ncould include mosaic or artefactual sequences that could explain\nthe large number of orphan transcripts found in this study. We\ntherefore performed four types of subsequent analyses to attempt\nto validate these clusters.\nFirstly, to generate empirical evidence of the presence of these\nclusters in the original water samples and to test for chimeras, a\nPCR analysis was performed that targeted 27 of the most highly\nexpressed orphan clusters. PCR reactions were performed on 1)\nthe original environmental DNA preparations, 2) unamplified\ncDNA and 3) mRNA (this was a negative control, since it is DNA-\nfree). Amplification products were detected for all 27 selected\ntarget sequences in at least one of the environmental DNA samples\n(Table S2). None of the sequences could be detected in any of the\n4 mRNA samples (negative controls) confirming an absence of\ncontamination of DNA. All 27 transcripts were found in all four\ncDNA samples. For the mid-bloom time points, 12 and 11 of the\ntranscripts respectively were identified in the high CO2 and\ncontrol environmental DNA samples (Table S2). Some, but not\nall, of these transcripts were of lower abundance when normalized\nto sequencing effort (data not shown).\nSecondly, this is the first published metatranscriptomic study to\ninclude biological replicates (Table 2) making it possible to\ncompare observed transcripts generated from independent\nsamples using the same methodology. Of the four metatranscrip-\ntomes analyzed, transcript clusters showed similar abundance in\nboth peak bloom samples and both post bloom samples (Table 1,\nTable S2). Since all four metatranscriptomes were generated\nusing the same mRNA enrichment methodology, this level of\nobserved similarity of abundant transcripts would not be expected\nby chance and provides strong evidence that the difference seen\nbetween time points in both the treatment and control samples are\ndue to biological differences in the composition of the community\nwithin the bloom (Table S2).\nThirdly, we compared the functional profiles of the metagen-\nomes and metatranscriptomes (Fig. 1). All eight data sets were\nannotated using similarity matching against SEED subsystems\n[17]. While this approach only validates transcripts with\nobservable homology to genes in known subsystems, it still shows\nthat the metatranscriptome functional profile does not significantly\ndiffer from that of the metagenome (one-way Anosim R=0.271,\np=.0.05). For this analysis, the number of sequences with\nsignificant identity to each metabolic gene in a functional category\nin the SEED subsystem database were normalised to the\nsequencing effort for each sample (Fig. 1) and sequences which\ncould not be annotated in this way were not included.\nFourthly, we compared the level of assembly and novelty between\nour four mRNA and DNA samples and that of the only previously\npublished metatranscriptomic study of a marine microbial commu-\nnity [9]. All samples were translated in all six reading frames into\ncontiguous peptides of at least 30 amino acids without a stop codon,\nspurious pORFs were removed, leaving 2,567,050 predicted or\nputative pORFs (See Materials and Methods, Table 1). These\npORFs were clustered to assess the diversity of function from each\nsample, and were compared against known databases to provide\nbasic annotation of known proteins and potential identification of\nnovel pORFs. As shown in Table 1, the majority of the highly\nclustered ($10 non-redundant sequences per cluster) transcripts\n(,94% mid-bloom and ,87% post-bloom) were novel clusters that\nmay represent uncharacterized proteins.\nThe mRNA samples from the current study yielded 1,2 orders\nof magnitude more novel protein clusters than their corresponding\nDNA samples when normalized to size (Table 1). Surprisingly,\nthis high level of diversity was actually exceeded by the previously\nNovel Marine Metatranscripts\nPLoS ONE | www.plosone.org 6 August 2008 | Volume 3 | Issue 8 | e3042\nT\na\nb\nle\n3\n.\nT\no\np\nte\nn\nm\no\nst\nab\nu\nn\nd\nan\nt\nid\ne\nn\nti\nfi\nab\nle\ntr\nan\nsc\nri\np\nts\nid\ne\nn\nti\nfi\ne\nd\nfr\no\nm\np\nO\nR\nF\ncl\nu\nst\ne\nri\nn\ng\n.\nR\na\nn\nk\nC\nO\nG\nID\nN\no\n.\no\nf\nS\ne\nq\ns\n(n\nr)\nN\no\n.\no\nf\ncl\nu\nst\ne\nrs\nA\nn\nn\no\nta\nti\no\nn\nT\nIG\nR\nfa\nm\nID\nN\no\n.\no\nf\nS\ne\nq\ns.\n(n\nr)\nN\no\n.\no\nf\ncl\nu\nst\ne\nrs\nA\nn\nn\no\nta\nti\no\nn\nP\nF\nA\nM\nID\nN\no\n.\no\nf\nS\ne\nq\ns.\n(n\nr)\nN\no\n.\no\nf\ncl\nu\nst\ne\nrs\nA\nn\nn\no\nta\nti\no\nn\n1\nC\nO\nG\n0\n2\n0\n9\n4\n6\n4\n(1\n4\n9\n)\n1\n2\nR\nib\no\nn\nu\ncl\ne\no\nti\nd\ne\nre\nd\nu\nct\nas\ne\n,\nal\np\nh\na\nsu\nb\nu\nn\nit\nT\nIG\nR\n0\n2\n5\n0\n5\n5\n2\n6\n(1\n9\n0\n)\n1\n3\nri\nb\no\nn\nu\ncl\ne\no\nsi\nd\ne\n-t\nri\np\nh\no\nsp\nh\nat\ne\nre\nd\nu\nct\nas\ne\n,\nad\ne\nn\no\nsy\nlc\no\nb\nal\nam\nin\n-d\ne\np\ne\nn\nd\ne\nn\nt\nP\nF0\n2\n4\n0\n7\n2\n7\n1\n4\n7\n(8\n1\n5\n)\n4\n4\nP\nu\nta\nti\nve\nvi\nra\nl\nre\np\nlic\nat\nio\nn\np\nro\nte\nin\n2\nC\nO\nG\n0\n4\n4\n3\n3\n3\n0\n(1\n5\n6\n)\n1\n1\nM\no\nle\ncu\nla\nr\nch\nap\ne\nro\nn\ne\nT\nIG\nR\n0\n2\n3\n4\n8\n3\n5\n9\n(1\n5\n8\n)\n1\n1\nch\nap\ne\nro\nn\nin\nG\nro\nL\nP\nF0\n0\n9\n1\n0\n1\n5\n1\n0\n1\n(5\n9\n5\n)\n2\n8\nR\nN\nA\nh\ne\nlic\nas\ne\n3\nC\nO\nG\n0\n4\n5\n9\n3\n5\n9\n(1\n5\n8\n)\n1\n1\nC\nh\nap\ne\nro\nn\nin\nG\nro\nEL\n(H\nSP\n6\n0\nfa\nm\nily\n)\nT\nIG\nR\n0\n2\n3\n5\n0\n3\n3\n0\n(1\n5\n6\n)\n1\n1\nch\nap\ne\nro\nn\ne\np\nro\nte\nin\nD\nn\naK\nP\nF0\n0\n0\n0\n5\n3\n7\n2\n(2\n1\n2\n)\n1\n8\nA\nB\nC\ntr\nan\nsp\no\nrt\ne\nr\n4\nC\nO\nG\n0\n3\n7\n6\n9\n6\n(4\n6\n)\n9\nC\nat\nal\nas\ne\n(p\ne\nro\nxi\nd\nas\ne\nI)\nT\nIG\nR\n0\n1\n3\n6\n9\n2\n1\n4\n(1\n0\n8\n)\n9\nca\nrb\nam\no\nyl\n-p\nh\no\nsp\nh\nat\ne\nsy\nn\nth\nas\ne\n,\nla\nrg\ne\nsu\nb\nu\nn\nit\nP\nF0\n0\n0\n0\n4\n3\n2\n6\n(1\n4\n9\n)\n1\n3\nA\nT\nP\nas\ne\nfa\nm\nily\nas\nso\nci\nat\ne\nd\nw\nit\nh\nva\nri\no\nu\ns\nce\nllu\nla\nr\nac\nti\nvi\nti\ne\ns\n(A\nA\nA\n)\n5\nC\nO\nG\n0\n4\n5\n8\n2\n1\n4\n(1\n0\n8\n)\n9\nC\nar\nb\nam\no\nyl\np\nh\no\nsp\nh\nat\ne\nsy\nn\nth\nas\ne\nla\nrg\ne\nsu\nb\nu\nn\nit\nT\nIG\nR\n0\n2\n1\n8\n8\n2\n3\n6\n(1\n2\n0\n)\n9\nac\ne\nta\nte\n–\nC\no\nA\nlig\nas\ne\nP\nF0\n0\n0\n1\n2\n3\n3\n0\n(1\n5\n6\n)\n1\n1\nH\nsp\n7\n0\np\nro\nte\nin\n6\nC\nO\nG\n5\n2\n6\n5\n2\n3\n6\n(1\n2\n6\n)\n9\nA\nB\nC\n-t\nyp\ne\ntr\nan\nsp\no\nrt\nsy\nst\ne\nm\nin\nvo\nlv\ne\nd\nin\nFe\n-S\ncl\nu\nst\ne\nr\nas\nse\nm\nb\nly\n,\np\ne\nrm\ne\nas\ne\nan\nd\nA\nT\nP\nas\ne\nco\nm\np\no\nn\ne\nn\nts\nT\nIG\nR\n0\n0\n6\n3\n0\n2\n2\n4\n(1\n0\n3\n)\n8\ne\nxc\nin\nu\ncl\ne\nas\ne\nA\nB\nC\n,\nA\nsu\nb\nu\nn\nit\nP\nF0\n0\n1\n1\n8\n3\n5\n9\n(1\n5\n8\n)\n1\n1\nT\nC\nP\n-1\n\/c\np\nn\n6\n0\nch\nap\ne\nro\nn\nin\nfa\nm\nily\n7\nC\nO\nG\n0\n0\n8\n6\n2\n1\n0\n(9\n6\n)\n8\nD\nN\nA\n-d\nir\ne\nct\ne\nd\nR\nN\nA\np\no\nly\nm\ne\nra\nse\n,\nb\ne\nta\n’\nsu\nb\nu\nn\nit\n\/1\n6\n0\nkD\nsu\nb\nu\nn\nit\nT\nIG\nR\n0\n0\n9\n3\n6\n2\n5\n7\n(1\n1\n8\n)\n8\nad\ne\nn\no\nsy\nlh\no\nm\no\ncy\nst\ne\nin\nas\ne\nP\nF0\n0\n0\n0\n6\n2\n9\n2\n(1\n2\n2\n)\n1\n0\nA\nT\nP\nsy\nn\nth\nas\ne\nal\np\nh\na\/\nb\ne\nta\nfa\nm\nily\n,\nn\nu\ncl\ne\no\nti\nd\ne\n-b\nin\nd\nin\ng\nd\no\nm\nai\nn\n8\nC\nO\nG\n0\n1\n7\n8\n2\n2\n4\n(1\n0\n3\n)\n8\nEx\nci\nn\nu\ncl\ne\nas\ne\nA\nT\nP\nas\ne\nsu\nb\nu\nn\nit\nT\nIG\nR\n0\n2\n0\n1\n3\n2\n1\n9\n(8\n2\n)\n7\nD\nN\nA\n-d\nir\ne\nct\ne\nd\nR\nN\nA\np\no\nly\nm\ne\nra\nse\n,\nb\ne\nta\nsu\nb\nu\nn\nit\nP\nF0\n0\n0\n0\n9\n3\n9\n9\n(1\n4\n8\n)\n1\n0\nEl\no\nn\ng\nat\nio\nn\nfa\nct\no\nr\nT\nu\nG\nT\nP\nb\nin\nd\nin\ng\nd\no\nm\nai\nn\n9\nC\nO\nG\n0\n4\n9\n9\n2\n5\n7\n(1\n1\n8\n)\n8\nS-\nad\ne\nn\no\nsy\nlh\no\nm\no\ncy\nst\ne\nin\ne\nh\nyd\nro\nla\nse\nT\nIG\nR\n0\n2\n5\n0\n6\n2\n6\n7\n(7\n8\n)\n7\nri\nb\no\nn\nu\ncl\ne\no\nsi\nd\ne\n-d\nip\nh\no\nsp\nh\nat\ne\nre\nd\nu\nct\nas\ne\n,\nal\np\nh\na\nsu\nb\nu\nn\nit\nP\nF0\n2\n8\n6\n7\n3\n2\n6\n(1\n0\n1\n)\n9\nR\nib\no\nn\nu\ncl\ne\no\nti\nd\ne\nre\nd\nu\nct\nas\ne\n,\nb\nar\nre\nl\nd\no\nm\nai\nn\n1\n0\nC\nO\nG\n0\n0\n8\n5\n2\n1\n9\n(8\n2\n)\n7\nD\nN\nA\n-d\nir\ne\nct\ne\nd\nR\nN\nA\np\no\nly\nm\ne\nra\nse\n,\nb\ne\nta\nsu\nb\nu\nn\nit\n\/1\n4\n0\nkD\nsu\nb\nu\nn\nit\nT\nIG\nR\n0\n1\n2\n4\n2\n1\n7\n8\n(8\n4\n)\n6\n2\n6\nS\np\nro\nte\nas\no\nm\ne\nsu\nb\nu\nn\nit\nP\n4\n5\nfa\nm\nily\nP\nF0\n0\n5\n0\n1\n2\n2\n8\n(1\n1\n6\n)\n8\nA\nM\nP\n-b\nin\nd\nin\ng\ne\nn\nzy\nm\ne\nT\nh\nis\nta\nb\nle\no\nn\nly\nin\ncl\nu\nd\ne\ns\nth\ne\np\nO\nR\nF\ncl\nu\nst\ne\nrs\nw\nit\nh\n.\n1\n0\nn\no\nn\n-r\ne\nd\nu\nn\nd\nan\nt\nse\nq\nu\ne\nn\nce\ns.\nN\no\n.o\nf\nSe\nq\ns.\nre\nfe\nrs\nto\nth\ne\nn\nu\nm\nb\ne\nr\no\nf\nse\nq\nu\ne\nn\nce\ns\nw\nh\nic\nh\nco\nn\ntr\nib\nu\nte\nto\nth\nat\ncl\nu\nst\ne\nr,\nin\nb\nra\nck\ne\nts\nar\ne\nth\ne\nn\nu\nm\nb\ne\nr\no\nf\nn\no\nn\n-r\ne\nd\nu\nn\nd\nan\nt\nse\nq\nu\ne\nn\nce\ns\nw\nh\nic\nh\nco\nn\ntr\nib\nu\nte\nto\nth\nat\ncl\nu\nst\ne\nr.\nd\no\ni:1\n0\n.1\n3\n7\n1\n\/j\no\nu\nrn\nal\n.p\no\nn\ne\n.0\n0\n0\n3\n0\n4\n2\n.t\n0\n0\n3\nNovel Marine Metatranscripts\nPLoS ONE | www.plosone.org 7 August 2008 | Volume 3 | Issue 8 | e3042\npublished Frias-Lopez study [9]. Clustering of that data according\nto the same criteria showed that ,98% of metatranscriptomic\nsequences were unique (Table S1). To directly compare the\nannotation of pORFs for this study with that of the Frias-Lopez\nstudy [9], we applied the same clustering techniques for the\ntranslated proteins to their raw data (Table S1). A total of 1,826\npORF clusters containing .10 non-redundant sequences were\nfound (DNA, rRNA and mRNA) and 865 pORF clusters\nremained after all rRNA clusters were removed. If the values for\nnovel protein clusters are normalised to sequencing effort, we see\nthat the Frias-Lopez study identified 1.86 the number of novel\nprotein sequences per sequencing effort when compared to the\ncurrent study. This phenomenon can be partially explained by the\ndifferences in read lengths between the studies (Table 2), as longer\nread lengths are more likely to be positively annotated than shorter\nread lengths [23,24].\nDifferences between sequence abundances in\nmetatranscriptomes and metagenomes\nThe benefits of applying both metatranscriptomic and metage-\nnomic analysis to the same biological samples include the potential\nto detect differential expression of mRNAs (function) between\ncommunities under different environmental conditions, while the\nmetagenome (DNA) can also provide a frame-of-reference for the\ntotal potential of the community metatranscriptome. Using the\nproportion of DNA and mRNA sequences that had homology to\nknown proteins, we were able to make phylum-level taxonomic\nassignments using annotations from the SEED databases [18]\n(Fig. 2). Comparison of the 4 DNA and 4 mRNA samples shows\nthem to be significantly different in taxonomic composition (by\none-way Anosim analysis, R= 0.385, p,0.03). Despite this,\ncomparisons of all subsets of the data failed to reveal any\nsignificant differences (perhaps due to small sample sizes – data not\nshown). This suggests that changes seem in mid- and post-bloom\ntime points are due more to changes in particular genes within\ntaxa, than large-scale changes in the abundances of phyla-level\ntaxonomic groups. Some potential qualitative changes can be seen\nwithin these patterns that may contribute to this significant\ndifference between DNA and mRNAs including an increased\nnumber of transcripts from the Bacteroidetes phylum (an important\ngroup in macromolecule degradation) during the mid-bloom\nsample compared to its proportion of the same sample of DNA\n(Bacteroidetes was only the 4th most abundant metagenomic group\nbut had the 3rd highest transcriptional activity) (Fig. 2).\nThe most abundant ‘known’ transcripts found in the\nmetatranscriptome and metagenome\nThe most abundant ‘known’ pORF clusters included a large\nnumber of housekeeping genes. All pORF clusters with .10 non\nredundant sequences were annotated by comparison to the\nPFAM, TIGRfam and COG databases (Table 3). Whilst the\nPFAM annotations yielded significant numbers of viral proteins,\nviral sequences were absent from both the TIGRfam and COG\nannotations (viral annotations discussed in next section).\nFigure 1. Relative abundance of sequence types identified for each sample. Number of sequences per metabolism subsystem were\nnormalised to sequencing effort for each sample and then relative abundance for each was calculated as a percentage.\ndoi:10.1371\/journal.pone.0003042.g001\nNovel Marine Metatranscripts\nPLoS ONE | www.plosone.org 8 August 2008 | Volume 3 | Issue 8 | e3042\nAmong the most abundant sequences with annotations are\nstress-induced chaperonin proteins (Table 3), which are poten-\ntially expressed in response to the low pH or high CO2\nconcentration stress found in the ocean acidification mesocosm\nsamples. This is corroborated by the distribution of sequences with\n,60% (1.46increase) of the chaperonin transcript sequences\ncoming from the high CO2 mesocosms. This is mirrored by the\nmetagenomic data in which ,55% (1.26increase) of the\nchaperonin gene sequences are found in the high CO2\nenvironment. However, it is possible that these proteins are\ninduced when the bacteria are being filtered, and hence this could\nbe an artefact caused by the sampling procedure; using smaller\nstarting volumes should alleviate this. Neither of these proteins\nwere identified as being abundant in the dominant pORF clusters\n(.10 non-redundant sequences) from study by Frias-Lopez et al.\n[9] which utilised only 1 L sampling volumes and may have\nreduced stress on the bacteria by reducing the filtration time.\nA range of proteins considered to be ubiquitous in cellular\nprocesses also ranked among the most abundant sequences that\ncould be annotated. These included ribonucleotide reductase\nproteins (COG0209, TIGR02505, TIGR02506, PF02867), which\nwere matched in all 3 reference databases (Table 3), as were\nproteins involved in ABC transporters, ATPase activity and AMP-\nbinding (COG5265, TIGR00630, PF00004, PF00005, PF00006,\nPF00501). RNA polymerases (COG0085, COG0086,\nTIGR02013) were only assigned by the COG and TIGRfam\nFigure 2. Percentage taxonomic affiliation of sequences identified in each dataset by BLAST against the SEED database. A –\ncommunity at peak of the phytoplankton bloom (61 SD). B - community after the phytoplankton bloom (61 SD). Standard deviations are calculated\nfrom comparison of the different treatments. Data shown are for the high CO2 treatment.\ndoi:10.1371\/journal.pone.0003042.g002\nNovel Marine Metatranscripts\nPLoS ONE | www.plosone.org 9 August 2008 | Volume 3 | Issue 8 | e3042\nannotations. Other abundant pORF clusters (.10 non-redundant\nsequences) encoded catalases\/peroxidises (COG0376), carbamoyl-\nphosphate syntheases (COG0458, TIGR01369), excinucleases\n(COG0178), S-adenosylhomocysteine hydrolase (COG0499,\nTIGR00936), acetate-CoA ligases (TIGR02188), 26S proteasome\nsubunit P45 family protein (TIGR01242), and elongation factor\nTu GTP binding domain (PF00009) (Table 3).\nAbundant viral sequences in the post-bloom time point\nsamples may contribute to the large number of orphan\ntranscript clusters found\nAt the end of any phytoplankton bloom, a substantial increase is\nexpected in the number of expressed viral transcripts. This was\nobserved in our post-bloom mRNA samples, in which transcripts\nwith viral homologues were on average 24.5 times more abundant\nthan viral DNA sequences (Fig. 2). While free viruses particles would\npass through the 0.22 mm filters used, and would therefore have low\nsequence abundance in the post-bloom samples, infected cells would\nbe expected to have overwhelming viral gene expression during lytic\ngrowth (Fig. 2). The large increase in viral transcription occurred\nimmediately after a substantial increase in bacterial abundance\nfollowing the phytoplankton bloom (data not shown).\nThe high expected abundance of viruses in the post-bloom\nenvironment suggests that many of the unknown predicted\nproteins maybe of viral origin [3]. This is supported by the\nannotation of the dominant pORF clusters (with .10 non-\nredundant sequences, Table 3) and Fig. 2. The most abundant\nsequence that could be annotated was PF02407, Putative Viral\nReplication Protein, and the second most abundant was PF00910,\nRNA helicase, which is thought to be involved in viral infection\n(Table 3). These sequences comprise 7.7% and 5% respectively of\nthe dominant clusters that can be annotated by comparison to the\nPFAM database (12.7% in total).\nFurthermore, these two proteins are more abundant in the post-\nbloom environment, with ,86% of these transcripts being found\nonly in the post-bloom samples. Interestingly, only a single\nhomologue for PF02407 was found in the post-bloom metagenomes.\nThis not only confirms the results seen in Fig. 2, but also\nunderscores a clear case of the biological significance of observed\ndifferences in the ratios of transcripts and their DNA sequences.\nFurther validation of metatranscriptomes and\nmetagenomes by direct comparison to an oligotrophic\nocean metatranscriptome\nBoth the validity and nature of mRNA transcripts from this\nexperiment were explored by direct comparison with the Frias-\nLopez data set (Table 2) [9]. There was some overlap of\nsequences, including both house-keeping genes and a few of the\nmost highly expressed novel orphan clusters. But the analysis also\nhighlights the extensive diversity between these samples which,\nwhile both taken from the marine environment, came from two\ndistinct marine habitats (Table 2).\nSpecifically, comparisons were generated using BLASTN\n(Table 4) for 3 versions of the two data sets: 1) total sequences,\n2) representative ntDNA sequences from each nucleotide cluster\nand 3) representative sequences from each pORF cluster. Both\nmRNA and DNA sequences were compared separately. Values for\nthe Frias-Lopez cDNA following removal of the rRNA sequences\nwere also used for comparison. The most abundant clusters of the\ncurrent study were also compared to the Frias-Lopez full mRNA\nand DNA datasets (Table 5).\nAbout 10% of the sequences in the two metagenomes are\nshared, but the shared proportion of DNA pORFs is higher (15%)\nfor the Frias-Lopez study and considerably lower (3.7%) for the\ncurrent study. Interestingly, this trend is confirmed by the DNA-\nmRNA comparisons in which the total proportion of DNA\nmatches is always far lower than the proportion of mRNA\n(Table 4). At the highest level of assembly, comparisons of pORF\nclusters reveal that 9% and 7.5% of the mRNAs are shared with\nthe relevant metagenome. Smaller proportions of the pORF\nmRNAs of each study (5.0% and 0.7%) showed similarities to each\nother suggesting that different subsets of the ‘‘potential metatran-\nscriptome’’ of the two communities are expressed in the two\nhabitats.\nTable 4. BLASTN comparison of total nucleic acids, representative sequences from nucleic acid clusters and representative\nsequences from pORF clusters from this study and the Frias-Lopez study [9].\nGilbert et al [10] and current study\nDNA, DNA nuc-clusters, DNA pORF clusters mRNA, mRNA nuc-clusters, mRNA pORF clusters\nFrias-Lopez et al [9] DNA 44261(10.7) 102637 (10.3) 19359 (4.67) 56835 (11.2)\nDNA nuc-clusters 35575 (10.6, 8.6) 59918 (9.5, 6) 15564 (4.65, 3.75) 11698 (8.8, 2.3)\nDNA-pORF clusters 59774 (15, 14.4) 40002 (3.7, 4) 21302 (5.5, 5.1) 17672 (7.5, 3.5)\nmRNA 64609 (52.4) 18602 (1.9) 58123 (45) 2680 (0.53)\nmRNA (rRNA removed) 15179 (24.1, 11.8) 15598 (1.57, 1.6) 13121 (20.8, 10.2) 2162 (0.43, 0.42)\nmRNA nuc-clusters 27094 (38.7, 21.1) 10689 (1.7, 1.07) 22289 (31.9, 17.4) 1942 (1.45, 0.38)\nmRNA nuc-clusters (rRNA removed) 8338 (19, 6.5) 9631 (1.5, 1) 6171 (14, 5) 1624 (1.2, 0.3)\nmRNA-pORF clusters 4330 (9, 3.4) 5484 (0.5, 0.55) 2372 (5, 1.8) 1736 (0.7, 0.34)\nFor each comparison two values are given, the first value is the percentage of Frias-Lopez data which is homologous to data from the current study; the second is the\npercentage of data from the current study which is homologous to the Frias-Lopez data. Comparisons were performed using BLASTN with the current studies dataset as\nreference database, and the Frias-Lopez dataset as the query. The (-b –v) parameter in BLASTN was set to 40,000. For every query sequence, every similar sequence in\nthe reference dataset is identified. Sequences from both datasets that meet the criteria of an E-value ,0.001 were included. Percentage values in parentheses are\ncalculated by dividing each value by the total number of sequences\/representative sequences for each dataset. For the Frias-Lopez data: Total DNA – 414,323, Total\nDNA nuc-clusters – 334,940, Total DNA pORF clusters – 390,599, Total mRNA – 128,234, Total mRNA (rRNA removed) - 63,111, Total mRNA nuc-clusters – 69,948, Total\nmRNA nuc-clusters (rRNA removed) - 43,948, Total mRNA-pORF clusters – 46,703. For the Gilbert data: Total DNA – 992,224, Total DNA nuc-clusters – 630,159, Total DNA\npORF clusters – 1,083,644, Total mRNA – 506,353, Total mRNA nuc-clusters – 133,447, Total mRNA pORF clusters – 238,655. Percentage values in bold are normalised by\ndivided each value through the Total DNA or Total RNA for the relevant study. Nuc-cluster refers to nucleotide clusters.\ndoi:10.1371\/journal.pone.0003042.t004\nNovel Marine Metatranscripts\nPLoS ONE | www.plosone.org 10 August 2008 | Volume 3 | Issue 8 | e3042\nShared sequences are expected to include housekeeping genes,\nas suggested by the homology between many of the largest\nidentifiable clusters found in both studies (Table 4 and Table 6).\nSimilarities among the mostly highly expressed abundant clusters\nare still very rare (Table 5). This could be a result of niche-specific\ngenes (or post-bloom specific genes in this study) and\/or the heavy\nviral load associated with the collapsing algal bloom conditions for\nthe current study. This viral load hypothesis is potentially\nconfirmed by an observed anomaly seen in Table 4. The relative\npercentage of total nucleic acid comparisons is higher than the\ncomparison between nucleic acid clusters (nuc-clusters) for each\nanalysis except when comparing our mRNA nucleotide clusters\n(mRNA nuc-clusters). The relative percentage increases from\n0.53% to 1.45%, and is seen again when comparing against the\nFrias-Lopez mRNA following removal of the rRNA, whereby the\nvalues are 0.43% increasing to 1.2% (Table 4). We hypothesise\nthat this anomaly is caused by the majority of the Frias-Lopez\nmRNA homolog’s being singletons in our mRNA data, hence on\nclustering, their contribution to the percentage calculation is more\nsignificant. This highlights the fact that the abundant sequences in\nour mRNA data are not abundantly expressed in the Frias-Lopez\ndata, which is to be expected if they are viral sequences.\nThe number of protein sequences that can be annotated\nthrough comparison to PFAM, TIGRfam or COG was approx-\nimately 2.5% prior to removal of rRNA sequences and 4.3%\nfollowing removal. This is far lower than the 36.5% from our study\nwhich could be annotated (8.5 fold more) (Tables 2 and Table\nS1). When comparing the annotation of the top 10 most abundant\npORF clusters (.10 non-redundant sequences) found in the Frias-\nLopez studies (Table 6) 6 (by PFAM), 7 (by TIGRfam) and 5 (by\nCOG) clusters are found in both studies as abundant clusters\n(.100 sequences per pORF cluster). For example, the 1st and 2nd\nmost abundant PFAM annotation for the Frias-Lopez study\n(PF00004) are the 4th and 10th most abundant PFAM annotation\nfor the current study (Table 3 & 6).\nSummary\nThe ability to assess natural metatranscriptomes of complex\nmicrobial communities under different environmental conditions\nrepresents a significant advance in our ability to link community\nstructure with function and DNA genotypes (sequences) with\ncorresponding phenotypes. The approach presented here expands\nthe available methodologies for assaying metatranscriptomes with\n.99% enrichment from total RNA (by removal of ribosomal\nRNA) and demonstrates that changes in expression of transcripts\ncan be observed between time points. The outputs of this study\ninclude a large number of novel, highly expressed sequence\nclusters and confirmation that the majority of these clusters are\norphaned and therefore further prove the utility of this approach\nfor use in discovering novel genetic capacity [9]. The computa-\ntional analyses produced in this study also demonstrates the critical\nimportance of access to public portals, namely CAMERA [20] and\nSEED [17,18], for the processing of such vast quantities of\ncomplex data.\nSupporting Information\nTable S1 Comparison of DNA and mRNA from samples\ncollected by Frias-Lopez et al [9].\nFound at: doi:10.1371\/journal.pone.0003042.s001 (0.04 MB\nRTF)\nTable S2 Information about the 85 most abundant nucleotide\nclusters. Including size, number of sequences in cluster, distribu-\ntion of abundance of mRNA and DNA sequences within each\ncluster and the presence or absence of those clusters for which\nPCR amplification from environmental DNA was performed.\nT1B1 refers to high CO2 from the mid-bloom; T1B6 refers to\npresent day CO2 from the mid-bloom; T2B1 refers to high CO2\nfrom the post-bloom; T2B6 refers to present day CO2 from the\npost-bloom.\nFound at: doi:10.1371\/journal.pone.0003042.s002 (0.27 MB\nRTF)\nTable S3 Number of (A) nucleotide sequence and (C) partial\nORF sequence homologues found between the eight datasets from\nthe current study. Percentage of (B) nucleotide sequence and (D)\npartial ORF sequence homologues found between the eight\ndatasets from the current study. T1B1=Mid-Bloom, High CO2.\nT1B6=Mid-Bloom, Present Day. T2B1=Post-Bloom, High\nCO2. T2B6=Post-Bloom, Present Day. pORF percentages are\nbased on total pORFs, denoted d in Table 2.\nFound at: doi:10.1371\/journal.pone.0003042.s003 (0.10 MB\nRTF)\nAcknowledgments\nThe authors would like to thank Margaret Hughes and Neil Hall from the\nNERC \/ University of Liverpool Advanced Genomics Facility, Simon\nThomas, and Bonnie Laverock from Plymouth Marine Laboratory and\nspecial acknowledgement to Ludovica Marzo at CEH for her expert help\nin designing the PCR primers used in the study.\nAuthor Contributions\nConceived and designed the experiments: JAG DF IJ. Performed the\nexperiments: JAG. Analyzed the data: JAG DF YH RAE WL PG.\nContributed reagents\/materials\/analysis tools: JAG IJ. Wrote the paper:\nJAG DF WL IJ.\nTable 5. BLASTN comparison of the reference sequences of the abundant nucleic acid clusters (.10 and .100 sequences per\ncluster) from the current study to the total combined mRNA and DNA sequences from the Frias-Lopez et al [9] study.\nFrias-Lopez et al [9] study\nmRNA homologues (%) DNA homologues (%)\nCurrent Study 3639 nucleotide clusters (10–99 sequences) 107 (2.9%) 326 (9%)\n85 nucleotide clusters (.100 sequences) 1 (1.2%) 4 (4.7%)\nThe 3649 clusters have .10 sequences and the 85 clusters are ‘contigs’ of all 609 clusters with .100 sequences (as described in the Materials and Methods).\ndoi:10.1371\/journal.pone.0003042.t005\nNovel Marine Metatranscripts\nPLoS ONE | www.plosone.org 11 August 2008 | Volume 3 | Issue 8 | e3042\nT\na\nb\nle\n6\n.\nT\no\np\n1\n0\nm\no\nst\nab\nu\nn\nd\nan\nt\nan\nn\no\nta\nta\nb\nle\ntr\nan\nsc\nri\np\nts\nfr\no\nm\nth\ne\nFr\nia\ns-\nLo\np\ne\nz\net\na\nl.\n[9\n].\nP\nF\nA\nM\nT\nIG\nR\nF\nA\nM\nC\nO\nG\nP\nF\nA\nM\nID\nA\nn\nn\no\nta\nti\no\nn\nA\nB\nT\nIG\nR\nfa\nm\nID\nA\nn\nn\no\nta\nti\no\nn\nA\nB\nC\nO\nG\nID\nA\nn\nn\no\nta\nti\no\nn\nA\nB\nP\nF0\n0\n0\n0\n4\nA\nT\nP\nas\ne\nfa\nm\nily\nas\nso\nci\nat\ne\nd\nw\nit\nh\nva\nri\no\nu\ns\nce\nllu\nla\nr\nac\nti\nvi\nti\ne\ns\n(A\nA\nA\n)\n1\n3\n2\nT\nIG\nR\n0\n0\n4\n8\n5\nT\nra\nn\nsl\nat\nio\nn\ne\nlo\nn\ng\nat\nio\nn\nfa\nct\no\nr\nT\nu\n6\n2\nC\nO\nG\n4\n5\n8\n5\nSi\ng\nn\nal\ntr\nan\nsd\nu\nct\nio\nn\nh\nis\nti\nd\nin\ne\nki\nn\nas\ne\n0\n8\nP\nF0\n1\n3\n7\n0\nN\nA\nD\nd\ne\np\ne\nn\nd\ne\nn\nt\ne\np\nim\ne\nra\nse\n\/d\ne\nh\nyd\nra\nta\nse\nfa\nm\nily\n4\n1\nT\nIG\nR\n0\n1\n2\n4\n2\n2\n6\nS\np\nro\nte\nas\no\nm\ne\nsu\nb\nu\nn\nit\nP\n4\n5\nfa\nm\nily\n6\n1\nC\nO\nG\n5\n1\n1\n6\n2\n6\nS\np\nro\nte\nas\no\nm\ne\nre\ng\nu\nla\nto\nry\nco\nm\np\nle\nx\nco\nm\np\no\nn\ne\nn\nt\n0\n6\nP\nF0\n3\n1\n4\n3\nEl\no\nn\ng\nat\nio\nn\nfa\nct\no\nr\nT\nu\nC\n-t\ne\nrm\nin\nal\nd\no\nm\nai\nn\n3\n1\nT\nIG\nR\n0\n2\n6\n3\n9\nA\nT\nP\n-d\ne\np\ne\nn\nd\ne\nn\nt\nC\nlp\np\nro\nte\nas\ne\nA\nT\nP\n-b\nin\nd\nin\ng\nsu\nb\nu\nn\nit\nC\nlp\nA\n6\n1\nC\nO\nG\n0\n0\n5\n0\nG\nT\nP\nas\ne\ns\n-\ntr\nan\nsl\nat\nio\nn\ne\nlo\nn\ng\nat\nio\nn\nfa\nct\no\nrs\n6\n2\nP\nF0\n0\n5\n2\n1\nD\nN\nA\ng\nyr\nas\ne\n\/t\no\np\no\nis\no\nm\ne\nra\nse\nIV\n,\nsu\nb\nu\nn\nit\nA\n2\n1\nT\nIG\nR\n0\n0\n9\n6\n2\nA\nT\nP\nsy\nn\nth\nas\ne\nF1\n,\nal\np\nh\na\nsu\nb\nu\nn\nit\n4\n1\nC\nO\nG\n1\n2\n2\n2\nA\nT\nP\n-d\ne\np\ne\nn\nd\ne\nn\nt\n2\n6\nS\np\nro\nte\nas\no\nm\ne\nre\ng\nu\nla\nto\nry\nsu\nb\nu\nn\nit\n0\n2\nP\nF0\n3\n1\n4\n4\nEl\no\nn\ng\nat\nio\nn\nfa\nct\no\nr\nT\nu\nd\no\nm\nai\nn\n2\n2\n1\nT\nIG\nR\n0\n1\n4\n7\n2\nG\nD\nP\n-m\nan\nn\no\nse\n4\n,6\n-d\ne\nh\nyd\nra\nta\nse\n3\n1\nC\nO\nG\n0\n1\n8\n7\nT\nyp\ne\nIIA\nto\np\no\nis\no\nm\ne\nra\nse\n(D\nN\nA\ng\nyr\nas\ne\n\/t\no\np\no\nII,\nto\np\no\nis\no\nm\ne\nra\nse\nIV\n),\nB\nsu\nb\nu\nn\nit\n4\n1\nP\nF0\n0\n2\n1\n6\nB\nac\nte\nri\nal\nD\nN\nA\n-b\nin\nd\nin\ng\np\nro\nte\nin\n1\n1\nT\nIG\nR\n0\n1\n0\n1\n7\nR\nib\no\nso\nm\nal\np\nro\nte\nin\nS4\n2\n1\nC\nO\nG\n0\n5\n6\n8\nD\nN\nA\n-d\nir\ne\nct\ne\nd\nR\nN\nA\np\no\nly\nm\ne\nra\nse\n,\nsi\ng\nm\na\nsu\nb\nu\nn\nit\n(s\nig\nm\na7\n0\n\/\nsi\ng\nm\na3\n2\n)\n4\n1\nP\nF0\n0\n1\n0\n1\nR\nib\nu\nlo\nse\nb\nis\np\nh\no\nsp\nh\nat\ne\nca\nrb\no\nxy\nla\nse\n,\nsm\nal\nl\nch\nai\nn\n0\n1\nT\nIG\nR\n0\n2\n5\n2\n1\nT\nyp\ne\nIV\np\nilu\ns\nb\nio\ng\ne\nn\ne\nsi\ns\/\nst\nab\nili\nty\np\nro\nte\nin\nP\nilW\n1\n1\nC\nO\nG\n1\n0\n8\n9\nG\nD\nP\n-D\n-m\nan\nn\no\nse\nd\ne\nh\nyd\nra\nta\nse\n3\n1\nP\nF0\n0\n0\n1\n6\nR\nib\nu\nlo\nse\nb\nis\np\nh\no\nsp\nh\nat\ne\nca\nrb\no\nxy\nla\nse\nla\nrg\ne\nch\nai\nn\n,\nca\nta\nly\nti\nc\nd\no\nm\nai\nn\n0\n1\nT\nIG\nR\n0\n0\n0\n3\n8\ntr\nan\nsl\nat\nio\nn\ne\nlo\nn\ng\nat\nio\nn\nfa\nct\no\nr\nP\n0\n1\nC\nO\nG\n0\n1\n8\n8\nT\nyp\ne\nIIA\nto\np\no\nis\no\nm\ne\nra\nse\n(D\nN\nA\ng\nyr\nas\ne\n\/t\no\np\no\nII,\nto\np\no\nis\no\nm\ne\nra\nse\nIV\n),\nA\nsu\nb\nu\nn\nit\n2\n1\nP\nF0\n1\n1\n0\n6\nN\nif\nU\n-l\nik\ne\nd\no\nm\nai\nn\n0\n1\nT\nIG\nR\n0\n0\n0\n5\n0\nR\nN\nA\nm\ne\nth\nyl\ntr\nan\nsf\ne\nra\nse\n,\nT\nrm\nH\nfa\nm\nily\n,\ng\nro\nu\np\n1\n0\n1\nC\nO\nG\n0\n2\n0\n6\nC\ne\nll\nd\niv\nis\nio\nn\nG\nT\nP\nas\ne\n0\n1\nP\nF0\n7\n7\n1\n9\nT\ne\ntr\nat\nri\nco\np\ne\np\nti\nd\ne\nre\np\ne\nat\n0\n1\nT\nIG\nR\n0\n0\n0\n6\n5\nC\ne\nll\nd\niv\nis\nio\nn\np\nro\nte\nin\nFt\nsZ\n0\n1\nC\nO\nG\n0\n2\n7\n8\nG\nlu\nta\nre\nd\no\nxi\nn\n-r\ne\nla\nte\nd\np\nro\nte\nin\n0\n1\n(B\n).\nIf\na\nh\no\nm\no\nlo\ng\nu\ne\nw\nas\nid\ne\nn\nti\nfi\ne\nd\nin\nth\ne\ncu\nrr\ne\nn\nt\nst\nu\nd\ny\n(A\n)\nth\nat\nto\no\nis\nin\ncl\nu\nd\ne\nd\n.\nN\nu\nm\nb\ne\nrs\nin\nco\nlu\nm\nn\ns\nA\nan\nd\nB\nre\nfe\nr\nto\nth\ne\nn\nu\nm\nb\ne\nr\no\nf\nse\nq\nu\ne\nn\nce\ns\nw\nh\nic\nh\nw\ne\nre\nas\nsi\ng\nn\ne\nd\nth\nis\np\nar\nti\ncu\nla\nr\np\nro\nte\nin\nan\nn\no\nta\nti\no\nn\n.\nO\nn\nly\np\nO\nR\nF\ncl\nu\nst\ne\nrs\nw\nit\nh\n.\n1\n0\nn\no\nn\n-r\ne\nd\nu\nn\nd\nan\nt\nse\nq\nu\ne\nn\nce\ns\nw\ne\nre\nin\ncl\nu\nd\ne\nd\nin\nth\nis\nan\nal\nys\nis\n.\nd\no\ni:1\n0\n.1\n3\n7\n1\n\/j\no\nu\nrn\nal\n.p\no\nn\ne\n.0\n0\n0\n3\n0\n4\n2\n.t\n0\n0\n6\nNovel Marine Metatranscripts\nPLoS ONE | www.plosone.org 12 August 2008 | Volume 3 | Issue 8 | e3042\nReferences\n1. DeLong EF, Preston CM, Mincer T, Rich V, Hallam SJ, et al. (2006)\nCommunity genomics among stratified microbial assemblages in the ocean’s\ninterior. Science 311: 496–503.\n2. Rusch DB, Halpern AL, Sutton G, Heidelberg KB, Williamson S, et al. (2007)\nThe Sorcerer II Global Ocean Sampling expedition: northwest Atlantic through\neastern tropical Pacific. PLoS Biol 5: 398–431.\n3. Yooseph S, Sutton G, Rusch DB, Halpern AL, Williamson SJ, et al. (2007) The\nSorcerer II Global Ocean Sampling expedition: expanding the universe of\nprotein families. PLoS Biol 5: 432–466.\n4. Handelsman J, Tiedje J, Alvarez-Cohen L, Ashburner M, Cann IKO, et al.\n(2007) The New Science of metagenomics: revealing the secrets of our microbial\nplanet. Washington, DC: The National Academies Press.\n5. Parro V, Moreno-Paz M, Gonzalez-Toril E (2007) Analysis of environmental\ntranscriptomes by DNA microarrays. Env Microbiol 9: 453–464.\n6. Poretsky RS, Bano N, Buchan A, LeCleir G, Kleikemper J, et al. (2005) Analysis\nof microbial gene transcripts in environmental samples. Appl Env Microbiol 71:\n4121–4126.\n7. Leininger S, Urich T, Schloter M, Schwark L, Qi J, et al. (2006) Archaea\npredominate among ammonia-oxidizing prokaryotes in soils. Nature 442:\n806–809.\n8. Urich T, Lanze´n A, Qi J, Huson DH, Schleper C, et al. (2008) Simultaneous\nAssessment of Soil Microbial Community Structure and Function through\nAnalysis of the Meta-Transcriptome. PLoS ONE 3: e2527. doi:10.1371\/\njournal.pone.0002527.\n9. Frias-Lopez J, Shi Y, Tyson GW, Coleman ML, Schuster SC, et al. (2008)\nMicrobial community gene expression in ocean surface waters. Proc Natl Acad\nSci USA 105: 3805–10.\n10. Gilbert JA, Thomas S, Cooley N, Kulakova A, Field D, et al. (2008) Potential for\nphosphonoacetate utilisation by marine bacteria in temperate coastal waters.\nEnv Microb; Accepted 20th July 2008.\n11. Griffiths RI, Whiteley AS, O’Donnell AG, Bailey MJ (2000) Rapid method for\ncoextraction of DNA- and rRNA-based microbial community composition. Appl\nEnviron Microbiol 66: 5488–5491.\n12. Neufeld JD, Scha¨fer H, Cox MJ, Boden R, McDonald IR, et al. (2007) Stable-\nisotope probing implicates Methylophaga spp and novel Gammaproteobacteria\nin marine methanol and methylamine metabolism. ISME J 1: 480–491.\n13. Zhang K, Martiny AC, Reppas NB, Barry KW, Malek J, et al. (2006)\nSequencing genomes from single cells by polymerase cloning. Nature Biotech 24:\n680–686.\n14. Sansone S-A, Rocca-Serra P, Brandizi M, Brazma A, Field D, et al. (2008) The\nfirst RSBI (ISA-TAB) workshop: ‘‘can a simple format work for complex\nstudies?’’. OMICS 12: 143–149.\n15. Field D, Garrity G, Gray T, Morrison N, Selengut J, et al. (2008) Towards a\nricher description of our complete collection of genomes and metagenomes: the\n‘‘Minimum Information about a Genome Sequence’’ (MIGS) specification.\nNature Biotech 26: 541–7.\n16. Li W, Godzik A (2006) Cd-hit: a fast program for clustering and comparing large\nsets of protein or nucleotide sequences. Bioinformatics 22: 1658–1659.\n17. Overbeek R, Begley T, Butler RM, Choudhuri JV, Chuang HY, et al. (2005)\nThe subsystems approach to genome annotation and its use in the project to\nannotate 1000 genomes. Nuc Acids Res 33: 5691–5702.\n18. Aziz RK, Bartels D, Best AA, DeJongh M, Disz T, et al. (2008) The RAST\nServer: Rapid Annotations using Subsystems Technology. BMC Genomics 9:\n75.\n19. Wendisch VF, Zimmer DP, Khodursky A, Peter B, Cozzarelli N, et al. (2001)\nIsolation of Escherichia coli mRNA and comparison of expression using mRNA\nand total RNA on DNA microarrays. Anal Biochem 290: 205–213.\n20. Seshadri R, Kravitz SA, Smarr L, Gilna P, Frazier M (2007) CAMERA: A\nCommunity Resource for Metagenomics. PLoS Biol 5: e75.\n21. Xu L, Chen H, Hu X, Zhang R, et al. (2006) Average Gene Length Is Highly\nConserved in Prokaryotes and Eukaryotes and Diverges Only Between the Two\nKingdoms. Mol Biol Evol 23: 1107–1108.\n22. Francois P, Garzoni C, Bento M, Schrenzel J (2007) Comparison of\namplification methods for transcriptomic analyses of low abundance prokaryotic\nRNA sources. J Microbiol Methods 68: 385–391.\n23. Wilson GA, Feil EJ, Lilley AK, Field D (2007) Large-scale comparative genomic\nranking of taxonomically restricted genes (TRGs) in bacterial and archaeal\ngenomes. PLoS ONE 2(3): e324. doi:10.1371\/journal.pone.0000324.\n24. Lipman DJ, Souvorov A, Koonin EV, Panchenko AR, Tatusova TA (2002)\nThe relationship of protein conservation and sequence length. BMC Evol Biol\n2: 20.\nNovel Marine Metatranscripts\nPLoS ONE | www.plosone.org 13 August 2008 | Volume 3 | Issue 8 | e3042\n"}