{"doi":"10.1080\/09585190701391867","coreId":"65938","oai":"oai:dro.dur.ac.uk.OAI2:4002","identifiers":["oai:dro.dur.ac.uk.OAI2:4002","10.1080\/09585190701391867"],"title":"Trust and justice in the formation of joint consultative committees.","authors":["Dietz,  G.","Fortin,  M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-07-01","abstract":"The paper identifies six phases in the creation of new joint staff-management consultative arrangements such as works councils or staff forums. Trust and justice theories are used to analyse the processes involved in initiating, designing, setting up and maintaining such a forum. The resulting framework considers both institutional and interpersonal aspects, and is intended to present researchers with a structure and an agenda for investigating the nature and consequences of the processes involved. The framework also provides initial guidelines to practitioners involved with establishing new consultative arrangements","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65938.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/4002\/1\/4002.pdf","pdfHashValue":"bb67f07b726ae092dfffcddff1be8c322806032f","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:4002<\/identifier><datestamp>\n      2011-09-01T15:38:38Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Trust and justice in the formation of joint consultative committees.<\/dc:title><dc:creator>\n        Dietz,  G.<\/dc:creator><dc:creator>\n        Fortin,  M.<\/dc:creator><dc:description>\n        The paper identifies six phases in the creation of new joint staff-management consultative arrangements such as works councils or staff forums. Trust and justice theories are used to analyse the processes involved in initiating, designing, setting up and maintaining such a forum. The resulting framework considers both institutional and interpersonal aspects, and is intended to present researchers with a structure and an agenda for investigating the nature and consequences of the processes involved. The framework also provides initial guidelines to practitioners involved with establishing new consultative arrangements. <\/dc:description><dc:subject>\n        Trust<\/dc:subject><dc:subject>\n         Justice<\/dc:subject><dc:subject>\n         Joint consultation<\/dc:subject><dc:subject>\n         Staff forums. <\/dc:subject><dc:publisher>\n        Routledge<\/dc:publisher><dc:source>\n        International journal of human resource management, 2007, Vol.18(7), pp.1159-1181 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-07-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:4002<\/dc:identifier><dc:identifier>\n        issn:0958-5192<\/dc:identifier><dc:identifier>\n        issn: 1466-4399<\/dc:identifier><dc:identifier>\n        doi:10.1080\/09585190701391867<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4002\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1080\/09585190701391867<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4002\/1\/4002.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1466-4399","0958-5192"," 1466-4399","issn:0958-5192"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Trust","Justice","Joint consultation","Staff forums."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n22 January 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nDietz, G. and Fortin, M. (2007) ’Trust and justice in the formation of joint consultative committees.’,\nInternational journal of human resource management., 18 (7). pp. 1159-1181.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1080\/09585190701391867\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \nDurham Research Online \n \nDeposited in DRO: \n22 January 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nAccepted for publication version \n \nCitation for published item: \nDietz, G. and Fortin, M. (2007) 'Trust and justice in the formation of joint consultative \ncommittees.', International journal of human resource management., 18 (7). pp. 1159-1181. \n \nFurther information on publishers website: \nhttp:\/\/dx.doi.org\/10.1080\/09585190701391867 \n \nPublisher’s copyright statement: \nThis is an electronic version of an article published in Dietz, G. and Fortin, M. (2007) 'Trust \nand justice in the formation of joint consultative committees.', International journal of human \nresource management., 18 (7). pp. 1159-1181. International journal of human resource \nmanagement  is available online at: \nhttp:\/\/www.informaworld.com\/openurl?genre=article&doi=10.1080\/09585190701391867 \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \n 1 \nTRUST AND JUSTICE IN THE FORMATION OF JOINT CONSULTATIVE \nCOMMITTEES. \n \nGraham Dietz & Marion Fortin, Durham Business School. \n \nAccepted for publication in International Journal of Human Resource Management. \n \n \n \nAbstract. \nThe paper identifies six phases in the creation of new joint staff-management consultative \narrangements such as a works council, or ‘staff forum’. Trust and justice theories are then used \nto analyse the processes involved in initiating, designing, setting up, and maintaining such a \nforum. The resulting framework considers both institutional and interpersonal aspects, and is \nintended to present researchers with a structure and an agenda for investigating the nature and \nconsequences of the processes involved. The framework also provides initial guidelines to \npractitioners involved with establishing new consultative arrangements. \n \n 2 \nTRUST AND JUSTICE IN THE FORMATION OF JOINT CONSULTATIVE \nCOMMITTEES. \n \nThis paper presents a theoretical framework for understanding the processes involved in \ndesigning, setting up, and maintaining new joint staff-management consultative arrangements \nsuch as a works council, or ‘staff forum’ (hereafter, for convenience, a ‘JCC’). While we are \nonly concerned with new JCCs, many of the arguments made are also likely to be valid for the \nadaptation of pre-existing arrangements.  \n \nThe literature on these processes is surprisingly thin. While the meaning and content of existing \nconsultative mechanisms has been explored in depth (Dundon et al., 2004; Wilkinson and \nAckers, 1995; Trevor, 1988; Marchington, 1987; Marchington et al., 2001; Gollan, 2001), we \nfound very little on the creation of new joint consultative committees. The exception is Broad’s \nlongitudinal study (1994) of the Company Council set up at a Japanese-owned manufacturing \nplant in Wales. Broad records the dynamics of the consultation from inception, and concludes \nthat the mismatch in participants’ emergent expectations made the forum inherently fragile.1 \nThere is rather more consultant-produced material, including guidelines and case studies from \nACAS (2005), the CIPD (Beaumont and Hunter, 2003; Wilmott, 2004), and the IPA (2001), but \nthis work tends, understandably, to be descriptive and prescriptive rather than explanatory.  \n \n                                                 \n1\n Broad split his longitudinal study into three phases: early, intermediate and a ‘later’ stage. He found that the \nmanagerially-imposed Council, which suffered from little administrative or facilitative support structures, proved an \nanonymous and hence ineffective forum for airing employees’ opinions, or for getting managers’ message back to \nthe shopfloor (which had been the managers’ principal aim). Within 12-18 months workers began to complain about \nthe Council’s limited instrumentality and of their initially high expectations being dashed (ibid: 31-35). Broad \nbelieved that “employee dissatisfaction with consultation could be explained by the performance of representatives \nand by the perception that the remit of the Council was too narrow” (ibid: 35). The sense of frustration swelled to \nthe point where the employees forced union recognition on the company, and the EEPTU union quickly realised that \nthe Council would only “deliver tangible results” if pressures were concurrently applied through the new collective \nbargaining processes (Broad, 1994: 33). Broad concludes: “Paradoxically, it is the perceived failure of the unitarism \nof joint consultation which has given additional credence to active shopfloor union involvement” (ibid: 37). \n 3 \nThis gap in the literature is all the more surprising since a decade has elapsed since Kessler and \nPurcell concluded their 1996 study of joint working parties by wondering why “so little attention \n[is] paid to the key issue of processes that make works councils or joint consultative committees \nmore or less successful?” (1996: 680). The arrival into UK law of the EU’s Information and \nConsultation Directive regulations has provided the contextual impetus for reviving this research \nagenda. Over the next few years, a perhaps unprecedented number of new JCCs will be \nestablished in Britain. Researchers have a rare opportunity to study the design and \nimplementation of joint consultative committees ‘from scratch’. To drive this future research \nagenda, theoretical frameworks and models are needed for describing the processes of \nestablishing JCCs and for predicting and explaining their character and outcomes over time, as \nwell as for guiding practitioners with some of the ‘milestone decisions’ they will face.  \n \nThe establishment of a JCC - an organisation’s managers providing a formal representative voice \nto employees, employees articulating their interests to managers via a representative delegation, \nwith potential implications for organisational decision-making – entails shifts in the exchange \nrelationship (Blau, 1964) between the two constituencies involved. Theory is therefore needed to \nhelp understand the dynamics of this shifting exchange and how parties deal with the risks \ninvolved. Such theory should be capable of generating predictions and explanations of these \ndynamics over time, and should focus upon the attitudes and behaviours displayed by the parties \ninvolved (Marchington, 1994: 685).  \n \nIn this paper, we use existing bodies of knowledge on the creation and consequences of both \ntrust and justice perceptions as our theoretical lenses through which to examine these dynamics. \nWe draw on both literatures, separately and in tandem, to generate a series of testable predictions \nand practitioner advice for each stage of establishing and maintaining a JCC, to predict the likely \n 4 \nimpact of different aspects of a JCC’s creation, and to explain a variety of observed outcomes. \nOur proposed framework suggests that different elements of trust and justice are likely to be \nexperienced directly at different stages, and the relative salience of these different elements for \nthe process will vary across the stages.  \n \nWe first present an overview of each construct, before outlining our rationale for looking at \nJCCs through these lenses. Consequently, we develop our staged process model, according to \ncurrent understanding of trust and justice processes. The implications of the proposed model for \npractice and future research are discussed.  \n \nTrust. \nMost conceptualisations of trust depict a three-stage process (McEvily et al., 2003) whereby the \ndecision to trust another - what Rousseau, Sitkin, Burt and Camerer (1998: 395) define as “the \nintention to accept vulnerability based upon positive expectations of [their] intentions or \nbehavior” – is based on beliefs about that party’s trustworthiness (Lewicki et al., 1998). The \ndecision to trust should lead to acts of trusting, manifest in ‘risk-taking in the relationship’ \n(Mayer et al., 1995), such as increasing one’s reliance on the other party, the disclosure of \nsensitive information, and deliberate reduced monitoring (see too Dirks and Ferrin, 2001).  \n \nMayer, Davis and Schoorman (1995) propose three distinct factors that constitute \ntrustworthiness: ability (the other party’s capacity to perform competently and reliably), \nbenevolence (the other party’s genuine care for the well-being of the trustor), and integrity (the \nother party’s consistent adherence to moral principles and conduct acceptable to the trustor, such \nas honesty, openness, fairness, and promise fulfilment). In any relationship based on trust - \nwhether it be positive or negative (i.e. distrust), or both (Lewicki et al., 1998; Saunders and \n 5 \nThornhill, 2004) - individuals appraise multiple sources of evidence for each of these \ncharacteristics, and aggregate their impressions into an overall evaluation of the trustworthiness \nof their target. This evaluation can encompass both trust and distrust, depending upon the \ntrustworthiness factor under consideration. Two sources of trust evidence are expected to \ninfluence participants’ engagement with the JCC: the trustworthiness of the voice process itself \n(i.e. the structures and protocols of the JCC: what Zucker (1986) terms ‘institutional’ forms of \ntrust), and the trustworthiness of the committee’s members (i.e. the interpersonal trust forged \namong the participants). Throughout our framework we consider each source of evidence. \n \nWe aim to specify which of the three characteristics of trustworthiness will be most influential \nduring which phase, and the events that can enhance or damage impressions of each \ncharacteristic. Benevolence and, in particular, integrity are typically considered more \nemblematic of trustworthiness, based on Reeder and Brewer’s (1979) ‘hierarchically restricted \nschema’, a psychological asymmetry whereby individuals tend to weigh positive information \nconcerning parties’ ability more heavily than negative information, but negative information \nmore heavily than positive information when related to integrity (see Kim et al., 2004). Failures \nof ability can be understood as ‘cock-ups’ if the overall evidence of competence is positive \nwhereas, by contrast, even single examples of compromised integrity will damage impressions \nof trustworthiness most, and can even cripple relationships for a long period after the actual \nincident. Hence, integrity (i.e. honesty, sound moral judgement) is a vital quality for a JCC and \nits participants to embody, and the worst trait to abuse.  \n \nTurning to theories of trust development, Lewicki and Bunker’s (1996) influential sequential \nmodel is divided into early, developing and mature phases, wherein the quality, or degree, of \ntrust increases or decreases over time, according to the accumulation of evidence on the other \n 6 \nparty’s trustworthiness. McKnight, Cummings and Chervany (1998) provide a further model for \n‘initial trust formation in new organisational relationships’.2 They posit that initial trust will \nemerge according to parties’ pre-disposition to trust, the presence or otherwise of institutional \nstructures, and various cognitive assessments of the other party’s conduct. Their essential \npremise is that the more positive antecedents of trust there are available to protagonists, the less \nfragile the initial relationship will be (1998: 482). However, once the initial exchanges have \npassed, new trust-building processes assume greater importance. \n \nThe single empirical study of trust in formal JCC arrangements we could find was Kerkhof, \nWinder and Klandermans’ study (2003) of Dutch works council members’ trust in management. \nThis found evidence for both instrumental and relational antecedents, with the relational aspects \ncorrelating more strongly. Other studies on trust and consultation\/ voice include Kessler and \nPurcell (1996) on joint working parties – not strictly comparable to a JCC scenario – which \nfound high levels of trust in successful cases. Driscoll (1978) examined employees’ \nindividualised engagement in voice mechanisms, and reported that two aspects predicted \nsatisfaction: “individuals’ participation in decisions (especially the fit between desired and \nperceived participation) and individuals’ trust in organisational decision-makers” (Driscoll, \n1978: 53). Spreitzer and Mishra (1999) examined what influenced senior managers’ decision to \nengage with their workforce in ‘employee involvement’ generally, rather than formal \nconsultative processes per se, and found that each dimension of employees’ trustworthiness \n(their competence, concern, reliability and openness) reduced managers’ perceived vulnerability.  \n \nJustice. \n                                                 \n2\n  For the authors, such a scenario is when parties have had no firsthand knowledge or experience of the other party. \nWhile this is unlikely to apply to the situation of a new JCC - where, typically, reps and managers will know (of) \neach other – their model offers compelling insights into our scenario. \n 7 \nThe related yet distinct concept we have chosen to complement the trust lens is organisational \njustice, defined as “the psychology of justice applied to organizational settings” (Byrne and \nCropanzano, 2001, P 4). Perceived organisational justice has been shown to have effects on \npeople’s attitudes, behaviours and outcomes, including motivation, well-being, performance, \nstealing, and even sabotage (Folger and Cropanzano, 1998). Commonly, justice researchers \ndifferentiate between distributive justice, procedural justice, interpersonal justice, and \ninformational justice (see Folger and Cropanzano, 1998; Colquitt et al., 2001).  \n \nTaking each in turn briefly, distributive justice concerns the fairness of outcomes. People use \ndifferent rules for different situations and types of relationships, including equity, equality and \nneed (e.g., Leventhal, 1976; Deutsch, 1975; Sampson, 1975). However, distributive justice in \nwork contexts is primarily based on perceptions of equity of outcomes received, typically \nderived from comparisons with referents or expectations (i.e. what party X believes that they \ndeserve) (Adams, 1965; Blau, 1964; Homans, 1961). In a JCC context, a comparison might for \nexample be made with consultation outcomes in other organisations, or with pre-JCC outcomes.  \n \nProcedural justice is the fairness of the decision-making processes leading to the outcomes \n(Thibaut and Walker, 1975). Process control, which justice researchers mean by the term “voice” \n(being able to voice one’s opinion during the procedure), is distinct from decision control (the \nability to influence the outcome). In simulated dispute-resolution procedures, process control \nwas shown to increase fairness perceptions of verdicts and acceptance, even if the outcome \ncould not be influenced. This finding has since been confirmed in a variety of contexts (Lind and \nTyler, 1988). While “voice” (as in being able to state one’s view) has been the most frequently \nresearched aspect of procedural fairness, other criteria have been identified, including \nconsistency across people and over time, the absence of bias, accuracy, mechanisms for \n 8 \ncorrecting wrong decisions, adherence to prevalent conceptions of morality, and \n‘representativeness’ (taking into account the opinions of all groups affected) (Leventhal, 1980).  \n \nInteractional justice is concerned with the interpersonal treatment people receive as procedures \nare enacted (Bies and Moag, 1986; Bies and Shapiro, 1987; Bies and Shapiro, 1988; Bies et al., \n1988). This dimension is often split into two elements: the quality of personal treatment, respect \nand sensitivity on the part of people enacting the procedures or determining outcomes, termed \n‘interpersonal justice’ (Greenberg, 1990), and the amount and quality of information and \nexplanations given for decision-making procedures and outcomes in terms of clarity, adequacy \nand sincerity of communications, which is termed ‘informational justice’ (Bies et al., 1988; \nGreenberg, 1993).  \n \nScholars have studied the interactions among the different types of justice. Under fair process \nconditions even unfavourable outcomes can be perceived as fair, known as the ‘fair process \neffect’ (Van den Bos et al., 1998). The opposite phenomenon, the ‘fair outcome effect’, has also \nbeen observed: in scenarios when no explicit information on procedural fairness is available, \npeople perceive the process as less fair when the outcome is unfavourable, but as more fair when \nthe outcome is favourable (see Cropanzano et al., 2001). Further contributions also propose a \n‘fair information effect’, whereby procedures and outcomes are perceived to be fairer when an \nexplanation for the decision is offered (Bies and Shapiro, 1987; Shaw et al., 2003)  \n \nThe formation of justice judgments has been explained on the basis of three forms of \ncounterfactual thinking (Folger and Cropanzano, 2001). Blame is only assigned for unjust \nbehaviour if an unfavourable condition has occurred (“would” it be better otherwise?), and the \nharm-doer has acted with discretion (“could” he\/she have acted in a different way?), and the \n 9 \naction has violated an ethical principle (“should” he\/she have acted differently?). If expectations \nregarding outcomes, procedures or treatment are disappointed, feelings of injustice are likely to \nresult. Importantly, justice anticipations have similar effects to justice perceptions, in that the \nmere anticipation of injustices causes people to react negatively (Shapiro and Kirkman, 2001). \nHowever, there is evidence that personal direct experience lead to much stronger judgments and \nreactions than mere expectations (Ambrose and Cropanzano, 2003).  \n \nWhy use trust and justice to examine JCCs? \nFirst, the introduction of a new JCC constitutes a re-configuration of the exchange relationship \nbetween managers and employees\/employee representatives. It is likely to be an unfamiliar and \nhence uncertain scenario and experience for most, if not all, parties. More importantly, ‘voice’ \nadjusts the distribution of power in any relationship, however partially, through increased \ninformation flows, access to sensitive information, and rendering decision-making processes \nmore transparent and potentially alterable. This entails risks for all parties. Spreitzer and Mishra \nsaw managers facing the paradox of how to “give up control without losing control” (1999: 156) \n– a phrase that, unconsciously or not, echoes Alan Fox’s (1974) famous remark that “to regain \ncontrol managers must share it” or, perhaps, Ramsay’s (1976: 137) arch paraphrasing: “to regain \ncontrol by making a show of appearing to share it”. For employee representatives, there is the \nrisk of taking part in a forum that may not have the unequivocal support of senior management, \nand hence marking oneself as a ‘troublemaker’. There is also the risk involved in assuming joint \nresponsibility for decision-making outcomes forged in the JCC. In sum, both managers and \nemployee representatives face a “fundamental social dilemma” (Lind, 2001: 61), wherein gains \nare expected to come from collaborating, but collaboration entails risks of vulnerability. Trust \nand justice perceptions are major influences on how parties manage this “fundamental social \n 10 \ndilemma”, and risk in general: trust helps people to decide how to respond, and people draw on \nfairness judgments in the absence of clear information on trustworthiness (Lind, 2001).  \n \nSecond, trust and justice emerge as important constructs throughout the JCC process, acting as \nantecedents; as determinants of the process itself; as outcomes themselves; and as influential \nmediators or moderators on other outcomes. In this respect, the two constructs offer a \ncomprehensive and integrative theoretical framework for the entire life-cycle of the JCC.  \n \nThird, and relatedly, trust and justice judgments are dynamic. They develop over time and are \nenhanced or damaged in line with updated evidence from what transpires. Each allows for, and \ncan predict and explain, vicious and virtuous cycles of engagement (cf. Heller et al., 1998: 212), \nand for switches between these two fates. Either and both can explain why parties might agree, \nor disagree but retain good relations, or fall out permanently; they can also accommodate and \nexplain forgiveness and redemption in a poor relationship, and a fall from grace in a good one. \n \nFourth, we use trust and justice in tandem for reasons of their mutual complementarities \n(Brockner & Siegel, 1996; Kerkhof et al., 2003; Lewicki et al., 2005; Saunders et al., 2002), but \nalso for their distinctive insights. Elements of trust explain particular aspects of the JCC process \nthat justice cannot, and vice versa. Theory and case study accounts support the presence of both \nsets of judgements, and this simultaneous usage.  \n \nFifth, institutional, organisational or structural procedures and interpersonal conduct are \nsignificant determinants of the effectiveness of JCCs (see Granovetter, 1985). In tandem, our \ntwo theories encompass parties’ perceptions of trustworthiness and fairness, and resulting \n 11 \nreactions, as generated by the JCC’s rules and protocols of engagement, and which emerge from \nthe relational interactions among the people sitting on the JCC.  \n \nThe five-stage process. \nWe now turn to our main task of examining the creation of JCCs through these two lenses. Since \nno stage models for the design, implementation and maintenance of a joint consultative \ncommittee appeared to be available in the academic literature, we examined the guidelines and \ndetailed case studies produced by leading consultants and advisory bodies, including ACAS \n(2005), the CIPD (Marchington et al., 2001; Beaumont and Hunter, 2003; Wilmott, 2004), and \nthe Involvement and Participation Association (IPA, 2002; IPA, 2004a; IPA, 2004b; IPA, 2005) \nto identify the six phases depicted in Figure 1: \n \nInsert Figure 1 (six stages) about here \n \nOur framework rests on the thesis that participants’ attitudes, reactions and behaviours are \ncrucial determinants of a consultation process (cf. Marchington, 1994), and that these are largely \ndetermined by participants’ perceptions of trustworthiness and fairness which, in turn, are \nevident in the process of creating the JCC itself, and from interactions with fellow JCC \nparticipants. These perceptions evolve with the cycle of events (Figure 1). The setting of \ntrustworthiness and justice expectations, whether parties share common or conflicting \nexpectations, and whether expectations are confirmed or disconfirmed, determine whether a JCC \nwill be effective, in terms of conduct, process and outcomes.   \n \nIn the remainder of the paper, we describe and discuss how our two theoretical lenses can be \nused to explain the interactions and likely outcomes that can emerge at each stage. We include in \n 12 \nour analysis and discussion commentary on the effects of structures, processes, and conduct, and \nwe analyse which aspects of justice and trustworthiness we expect to be particularly salient at \neach stage. Through our analysis, we suggest a number of predictions and recommendations. For \nparsimony, we confine our discussion primarily to the direct exchange relationship between the \nparticipants on the JCC (management delegates and employee representatives: see Figure 2). \nOther organisational relationships – featuring, for example, the firm’s owner (if not involved in \nthe JCC), its non-JCC participant managers, its HR function (where present), its trade union \nrepresentatives (where present) and the workforce - will have an impact on our main relationship \nof interest, but it is beyond the scope of a single paper to track each of these dynamics.  \n \nInsert Figure 2 (different relationships) about here \n \nUnderstanding pre-voice history (Stage T1). \nJCCs emerge in the context of prior relations among the main constituencies (Kessler and \nPurcell, 1996: 668), which we term the ‘pre-voice history’. This amounts to participants’, and \ntheir constituents’, accumulated evidence about the other parties - what the employees think of \nthe managers, and vice versa – which informs parties’ expectations about the likely levels of trust \nand fair treatment and outcomes in any future consultative process (Shapiro and Kirkman, 2001). \nGiven that people “generally select, interpret and recall information to be consistent with their \nprior beliefs or theories” (McKnight et al., 1998: 484), pre-dispositions and previously formed \ntrustworthiness and fairness judgments (fairness heuristics: Lind, 2001) will be highly influential \nin the early stages. Levels of perceived justice (distributive, procedural, informational) and trust \nin the other party, derived from the pre-voice history, are expected to have a direct effect on \nparties’ perceived need for a JCC. These judgements also act as powerful antecedents to each \nsubsequent stage in the process. The pre-voice history will have two initial effects: on who \n 13 \n‘triggers’ the initiation of a JCC and why (which is closely linked to parties’ initial support for, \nand commitment to, any future JCC) and secondly the willingness of the two parties to \ncollaborate. We present two broad scenarios: a generally negative pre-voice history, and a \ngenerally positive pre-voice history. \n \nIf prior relations have witnessed perceived injustices and\/or suffered from a breakdown of trust, \nwe predict that employees will be more motivated than managers to ‘trigger’ a request for a JCC, \nas a way to achieve redress. Employees will also be more likely to actively support the JCC that \nemerges (e.g. a surfeit of willing nominees, a good turnout in elections), and to direct energy \ntoward its success (e.g. plenty of agenda items generated from the shopfloor). However, since \nowners, and senior managers, have the organisational power to determine the nature of the JCC \nthat materialises we expect the eventuality of an employees’ trigger to be moderated by owners’, \nand senior managers’, support for, and commitment to, the principle of joint consultation. In \nnegative pre-voice scenarios, management may support the employees’ request in order to seek \nredemption from previous relationship failures or as a means of breaking a damaging cycle of \nrelations, or because of a belief in the benefits of joint consultation. Alternatively, managers may \nbe wary of supporting the provision of voice to a group of employees that, previous experience \nsuggests, is likely to be hostile. In this scenario, managers may move to deter or block progress \ntoward a JCC. Or they may seek to install a weak, ‘non-invasive’ forum. Trust and justice \ntheories suggest, however, that a failure to address employees’ concerns by resisting calls for a \nJCC would likely exacerbate feelings of injustice, and diminish managers’ perceived \ntrustworthiness further.  \n \nA problem for a JCC born into a hostile organisational context is that a lack of trust has been \nconsistently found to be problematic for initiating collaboration. Kramer (1996) found that \n 14 \npeople in such relationships were prone to “hypervigilance”, “paranoid cognitions” and “sinister \nattribution error”, making collaboration very difficult to establish. Similarly, high levels of \nanticipatory distributive injustice have proven to be positively related to resistance to change, \nand negatively related to employees’ commitment to team goals (Shapiro and Kirkman, 1999). \nThus, even following an employees’ trigger, collaboration will be much harder to secure in such \na scenario. Efforts will be needed to overcome the pernicious and inertial effects of a negative \npre-voice history. Failure to address poor prior relations will likely scupper any fledgling forum. \n \nThe other scenario is a prior history of mutual trust and perceived fairness within the \nestablishment. Of interest here is Driscoll’s finding (1978: 54) that ‘voice’ had little effect on \nrelationships already characterised by high levels of trust: if one’s interests are already being \naddressed, a JCC forum may be viewed as a superfluous ‘talking shop’. Hence, we predict that \nemployees will be unlikely to trigger JCCs in organisations enjoying generally positive \nrelationships – unless they anticipate future needs for more structured consultation arrangements. \nInstead, we predict that in benign scenarios managers themselves are more likely than \nemployees to initiate the creation of the JCC proactively. Their motives may vary as for the \nnegative scenario: one motive may again be a ‘defensive’ tactic against more ‘burdensome’ \narrangements being imposed upon them (Wilmott, 2004), or a desire only for minimal \ncompliance with regulatory requirements, while a pro-voice motive might stem from \ncommitment to a systematic process for employees’ involvement in organisational decision-\nmaking, perhaps as part of a ‘sophisticated’ approach to employee involvement\/HRM. We \nfurther expect that managers’ support for joint consultation in principle and managers’ trust in \nemployees (based on pre-voice history) will interact to determine managers’ support for a JCC. \nThe result is subject to the relative strength of each belief: even pro-voice managers will likely \nbe reluctant to support a JCC if they consider their employees to be untrustworthy (e.g. \n 15 \nincompetent, of malign intent, or dishonest), whereas managers’ support for joint consultation in \nprinciple may outweigh concerns over employees whose motives and capabilities are not known, \nambivalent or untested. However, a positive pre-voice history of trust pre-dispositions and \nfairness judgments will have a positive effect on parties’ willingness to collaborate.  \n \nGiven their hypothesised moderating influence on whether a JCC is triggered (in either pre-voice \nhistory scenario), British managers’ known antipathy toward any forms of representative voice \nat work,3 coupled with the Directive’s potentially formidable stipulation for employees to secure \nthe support of 10% of the workforce for a JCC, might explain why so few have been established \nsince the Directive came into force. \n \nWith the JCC itself, parties have the opportunity to break with the vicious or virtuous cycle of \npast relations, or to cement expectations accordingly. If parties are aware of trust and justice \ndynamics, the effects of proxy prior experiences can be mitigated by fresh, clear, direct evidence \nto the contrary produced during the establishment of the actual JCC. Providing observable \ncommitment to an effective voice process should enhance perceived trustworthiness and \nperceived justice, and help to confront scepticism or hostility, whereas not to do so may confirm \ncynics’ misgivings or fail to overcome suspicions. The first opportunity is the design of the \nregulations that govern the JCC.   \n \nThe design of the JCC, and the process of designing. (Stage T2). \nMcKnight and colleagues (1998) cite ‘situational normality’ - the belief that success is likely \nbecause everything seems to be “in order”, including people in their “normal roles” - as a key \n                                                 \n3\n Previous research has found ambivalence, if not outright hostility, among British managers to joint consultation \n(see Broad, 1994; Guest and Peccei, 2001; MacInnes, 1985; Marchington, 1987), with managers of small-medium \nenterprises – which are about to fall under the EU Directive’s scope - even more reluctant (see Cully et al., 2000). \n \n 16 \ninstitutional cue for trustworthiness development. However, a JCC, especially an organisation’s \nfirst ever attempt to formalise consultation, will be an abnormal situation for most participants, \neven if they know each other, as everyone will be in unfamiliar roles. This leaves the second \ninstitutional support, structurally-derived assurances such as regulations and commitments. \n \nWhat we call the JCC’s ‘protocols’ are important determinants for the development of trust and \njustice for at least four reasons. First, information about the other party is likely to be “very \nincomplete when the relationship begins” (McKnight et al., 1998: 479). In the absence of direct \nobservations of the other party in JCC situations, institutional supports will be highly influential \nin the very early phases. Participants will look for, and find, in the JCC’s design indicators of \nlikely future experiences of trustworthiness and justice. Trust and justice can be ‘designed in’, or \nout. Second, the design phase is perhaps the most important period for developing procedural \nfairness for the whole process, since the design will likely be participants’ first direct indication \nof procedural fairness in the actual JCC. Third, constraints built into the design can shape \nparticipants’ conduct. Protocols make explicit, and hence understood and shared, what all \nparticipants’ expectations should be on potentially contentious aspects of the JCC such as its \nremit, scope, and appropriate conduct, and by so doing can discourage the kinds of \ninconsistencies, abuses and disappointed expectations that lead to perceived injustices, and \ncompromised trustworthiness (Perrone et al., 2003; Slovic, 1993). As institutional sources of \nevidence, protocols serve as proxies for real (i.e. directly observed) justice and trustworthiness: \n“Believing that a situation is bounded by safeguards enables one to believe that the individuals \nin the situation are trustworthy” (McKnight et al., 1998: 479). Fourth, in the absence of an \neffective design, the JCC’s effectiveness is more dependent upon the quality of interpersonal \nengagement among its member participants which, given human fallibility and the potentially \nconflictual agenda of the forum, increases the scope for lapses or violations of fair treatment. \n 17 \nThis is inherently riskier. Neither the Directive4 nor the various consultants’ guidelines deliver \nmuch specification on design or process, in the understandable desire to avoid prescriptive ‘one-\nsize-fits-all’ models. As a consequence, the protagonists themselves must create fairness norms \nand build trust. Protocols can aid this process through, first, setting realistic expectations and \nestablishing shared understandings of engagement and, second, restricting unfair actions in the \nactual JCC. Both can have a positive effect on trust and justice in the JCC and on participants’ \nwillingness to support the JCC, and hence the fledgling forum’s sustainability. The design phase \nshould feature an attempt to produce a protocol outlining expectations on four main issues: what \nconstitutes consultation; information sharing and handling (sensitive) information; JCC \nmembership and members’ rights and obligations, and standards on behavioural conduct. \n \nThe fluid definitions available for information sharing versus consultation versus bargaining and \nnegotiation may lead to incompatible expectations among participants. Disappointed \nexpectations are likely to lead to negative justice judgments (Folger, 1986), and damaged trust. \nThus, one set of protocols should cover “where consultation sits on the line between the formal \n                                                 \n4\n The default position in the Directive aspires toward the development of trust and justice in some respects, but \nmilitates against it in others. The first positive contribution is that “whatever arrangements are in place they must be \nagreed with employees. Management cannot unilaterally impose the arrangements” (DTI, 2005). Thus, the design \nphase requires, at minimum, that employees endorse the design, but the intention seems to be that managers and \nemployees should engage directly in joint design. As we argue, this joint process can nurture direct evidence of the \nother party’s trustworthiness, and commitments to justice – or not. Second, consultation is defined as “the exchange \nof views and establishment of dialogue between the employees’ representatives and the employer… with a view to \nreaching an agreement” (emphasis added). The presence of this aspirational latter clause can shape participants’ \npre-disposition toward trust and commitment to all forms of justice. Third, the iterative stages of consultation \nenvisaged are the sharing of information at such time, and in such fashion and with such content as is appropriate to \nenable employees’ representatives to conduct an adequate study and prepare for consultation; the response from the \nemployee representatives at the JCC; management’s response to the representatives. On the positive side for trust \nand justice development, these strictures reflect specifications for meaningful voice (cf. Kessler & Purcell, 1996), \nand do allow for the prospect of procedural and informational justice and integrity to emerge. The clear aspiration is \nthat the forum reaches a mutually acceptable agreement (i.e. indicative of benevolence and distributive justice). \nFourth, the Directive specifies a consultative agenda that covers both parties’ immediate interests - the \nundertaking’s economic situation, recent and probable strategic and operational activities, and any decisions likely \nto require substantial changes to the organisation of work, future employment and contractual relations (ACAS, \n2005) - and is one on which mutually beneficial decision outcomes may be realised. But the may is important. The \nobvious weakness of the Directive’s conditions is that all of the above is only aspirational. The regulations do not \ninsist that there be an agreement, nor do they provide any of the sanctions or incentives found in the Dutch and \nGerman national works council legislation that can compel participants to reach a common position. In other words, \nthe Directive facilitates a very broad scope of choice for how the process of consultation takes place in practice. \n 18 \nnoting of views and joint decision-making, and what each party expects from it” (IPA, 2001: \n12): what Beaumont and Hunter (2003) call “consultation about consultation”.5 Justice theories \npoint toward the JCC needing at minimum to be seen to be capable of delivering outcomes that \nare considered “fair” (distributively just), and trust theories highlight the importance of at least \nnon-detrimental, and ideally, beneficial outcomes in order for trust to develop. It follows that the \nemployees’ input opportunity must be genuine and potentially influential on managers’ thinking \nand final decisions, and that the employee representatives’ support for the JCC’s decisions must \nbe credible and influential with the workforce. If this degree of influence is built into the design, \nit can encourage mutual confidence in the JCC’s ability as an institutional arrangement to effect \nchange (i.e. its credibility and instrumentality), and the ability of the participants as well. The \nlikelihood of receiving fair and\/or beneficial outcomes may also be interpreted as demonstrating \nboth parties’ benevolence, and will increase anticipated distributive justice (Shapiro and \nKirkman, 2001). In addition, employees who have demanded a JCC may see the facilitation of a \nbroad agenda, covering all matters of direct relevance to them, as indicative of managerial \nbenevolence, while a restrictive agenda, especially in the face of employees’ demands for greater \ninput, is likely to fuel concerns over benevolence (e.g. “they won’t listen to us”) and integrity \n(e.g. “what are they hiding?”). Without this capacity, we predict that no JCC will prosper and \nsurvive long, as disconfirmed expectations or unrealised ambitions will generate apathy and \ncynicism (see too Heller et al., 1998). This echoes Driscoll’s finding (1978): provide the voice \nthat is desired. However, given that both fairness and trust require expectations to be met, the \ninfluence of the JCC should be made explicit and should be achievable. 6 \n                                                 \n5\n According to the IPA, corporate policy matters typically necessitate an exchange of views, operational policies \nrequire more significant input from employees, while complex changes to working arrangements may benefit from \nestablishing an adjunct ‘joint task force’.  \n \n6\n Wilkinson and Ackers (1995: 855) cite a company handbook statement from a Japanese firm about the role of its \nworks council: “The Company Council is not a ‘talking shop’ without muscle, neither is it a traditional ‘works \ncouncil’ where managers and employee representatives sit and glare at each other from entrenched positions. It \nexists to share information, pool ideas, represent staff and company interests and come to agreed conclusions. It \ncannot dictate to Japanco what policy will be, but it can and will influence the company’s future direction in the \n 19 \n \nA second set of protocols concerns how information is distributed, when and to whom, and how \nit should be handled. Expectations regarding information exchange have an obvious impact on \ninformational justice. Such judgments depend on the information received being timely and \nadequate (Greenberg, 1990; Colquitt, 2001) - subject to expectations. The extent of information \nsharing will also part-determine the perceived fairness of JCC outcomes, since adequate \nexplanations (i.e. full information sharing) for unpopular decisions can offset the negative \nimpact of unfavourable decision outcomes (Brockner and Wiesenfeld, 1996). The meta-review \nby Shaw, Wild and Colquitt (2003) found that both explanation provision and explanation \nadequacy were found to be positively related to procedural and distributive justice perceptions. \nBeing given timely and adequate information is crucial for developing the ability of the reps to \nprepare a meaningful response. As such, low levels of information sharing – especially if this \nbecomes systematic - will quickly render the JCC impotent and trivialised, and lead to its \nneglect. Interestingly, information need not necessarily be confidential or sensitive for \ninformational justice to be perceived, yet the disclosure of sensitive information is a trust-\ninspired risk-taking act (Mayer et al., 1995), and constitutes a signal of wishing to invest in \nrelationship development (i.e. benevolence). Without both parties taking the risks of information \nsharing in confidence, it is difficult to envisage a trusting JCC. However, this raises difficult \nchallenges for participants’ integrity. The spirit of the Directive seems to intend for managers to \nprovide full, honest and timely disclosure of relevant organisational information, and for \nemployee representatives to respect sensitivities and confidentiality concerns. In practice, it \nseems that confidentiality is seldom a problem (IPA, 2001: 15). Securing full and honest \n                                                                                                                                                             \nmutual interests of Japanco and its employees. The biggest enemy and brake on progress is apathy. If we lose \ninterest in supporting the Company Council and its members then the company may stagnate and rot can set in – be \nactive and participate”. Note how it establishes clear expectations not only on the nature of procedural and \nbehavioural engagement, but also on its remit and influence. It also uses language to encourage trust through \nappeals to common interests, and caricatures of antagonistic engagement. It also identifies likely pitfalls. \n \n 20 \ninformation may be harder. For managers to feel confident in taking this risk they will need to \nalready trust the representatives (cf. Spreitzer and Mishra, 1999), and so pre-voice history will \nhave a direct bearing on whether, when and how much information is shared, and the quality and \nsensitivity of the information.7 \n \nJCC membership and members’ rights and obligations form the third set of protocols. The \ncriteria for procedural justice identified by Leventhal - representativeness, no bias, conformity to \nmorality, existence of recourse mechanisms, consistency, reliance on good information \n(Leventhal, 1980) - are likely to act as important antecedents in the context of JCCs. We have \nexamined good information above. Taking the others briefly in turn, the credible \nrepresentativeness of the JCC’s delegates themselves with respect to the organisation’s various \nconstituencies and employee types (ACAS, 2005), enhances their perceived credibility and the \ninstrumentality of the JCC as a structure: its ability and integrity, in trust terms. Clearly there \nshould be no managerial appointees, and the elections must be seen as fair and free from bias. \nThis can also inspire confidence in the efficacy of the forum in articulating the workforce’s \nconcerns, and the integrity of the JCC process and its organisational sponsors. Curiously, the \nconsultant-produced guidelines tend to overlook the representativeness of the management \ndelegation. For a JCC to be able to deliver tangible beneficial outcomes, and to have \ninstrumentality (i.e. to generate among different parties expectations of ability and the potential \nfor distributive justice), it follows that the participating managers, who tend to be appointees \nonly, should contain recognisably influential strategic decision-makers (ACAS, 2005). Access to \npower is vital, without which JCC members will soon learn that the forum lacks any real \ncapacity to modify organisational decision-making, and that this resides elsewhere. This will \n                                                 \n7\n ACAS (2005) and the IPA (2001) recommend that information sharing should begin when the employer has a \nrelatively solid, but not yet finalised, proposal to inform and consult about. Note how this is indicative of \ninformational justice. The information must precede any final decision for the JCC to even be capable of delivering \nprocedural and distributive justice. \n 21 \nprove corrosive of trust and justice, especially if the JCC has been promoted as an effective \nemployee voice. Guidelines and input opportunities should not systematically favour some JCC \nmembers over others (no bias). Recourse mechanisms will further enhance procedural justice, \nand integrity. Consistency of procedures across people and across time can be improved by the \nmere fact that protocols are developed – provided they are implemented consistently of course. \n \nFinally, interpersonal fairness has been shown to be a particular critical determinant of employee \nreactions in situations of change (Thornhill and Saunders, 2003). We anticipate a similar effect \nwith new JCCs. Official protocols on participants’ behavioural standards not only send \nindicative cues as to parties’ motives for future conduct, improving anticipations of future \nconduct but also, as public commitments, can constrain contrary behaviours. Examples include \ntreating participants with respect and due consideration to their opinions, honesty, avoiding \naggressive or insulting behaviours, abiding by ‘Chatham House’ rules, etc. Importantly, such \nprotocols should not exclude the option of dissent, but dissent should be articulated \nconstructively.  \n \nThree caveats apply to the anticipated effects of protocols. First, such strictures cannot ensure \njust and trustworthy conduct; these qualities are ultimately shaped by direct experience of \ninterpersonal relations. This illustrates the complex interplay between institutional structures and \nrelational conduct. Interpersonal relations may in part make up for a badly designed JCC in that \npersonal goodwill can lead to a joint revision of the formal terms of engagement, but poor \ninterpersonal relations may eventually undermine even an exemplary design. The second caveat \nrelates to the enduring research issue as to whether people’s trustworthiness is perceived to be of \ntheir own volition and hence genuine, or is deemed only to have been secured through \ncompliance with protocols and hence may not be sincere (Sitkin and Roth, 1993). Given the \n 22 \nseeming superiority of volitional trustworthiness, too many protocols may be interpreted as \nexcessive a priori constraint, signalling low trust and low anticipated justice. Sitkin and Roth \n(1993) have argued that regulations only address reliability concerns, and not value concerns \n(e.g. justice, benevolence, integrity) – this remains an area for future research in JCC contexts. \nThe right balance of protocols may differ according to context. With a poor pre-voice history, \nmore and detailed protocols are likely to be required; with a more benign history participants \nmay not see the need for extensive protocols. However, both McKnight and colleagues’ model \n(1998) and the supremacy of procedural justice concerns at the outset of the JCC (see Ambrose \nand Cropanzano, 2003), do suggest that protocols will help to facilitate trust and justice in the \ndifficult, uncertain, early phases.  \n \nLastly on design, our framework suggests that many of the potential insecurities above can be \ndiminished through the jointly undertaken creation of these protocols: employees and managers \ntogether. This will mean that participants engage with each other, and experience directly cues \non the trustworthiness and interpersonal fairness of the other party, rather than having to abstract \npossible inferences from the JCC’s institutional structures. Joint designing also adds to the \nprocedural justice criterion of “representativeness”, since the resulting design is more likely to \nbe reflective of all parties affected, and the capacity of the JCC to deliver beneficial outcomes. \nGiving both parties a voice in the design should therefore predict superior levels of trust, \ninterpersonal and procedural justice judgments, and thus more commitment to the JCC itself \n(Dirks et al., 1996; Korsgaard et al., 1995).8 \n \nPreparations prior to the first meeting. (Stage T3). \n                                                 \n8\n Pre-voice history may again prove influential here: if interpersonal justice and trustworthiness is unlikely to be \nmet, a joint design may be counter-productive, or will require significant time and potentially external facilitation to \nget right.  \n \n 23 \nEfforts to encourage trust and justice through protocols may increase the chances of trust and \njustice being realised in practice, but real world interpersonal interactions cannot be fully \nscripted. The inaugural meeting can be a fraught occasion, even despite a seemingly diligent \ndesign (see Beaumont and Hunter’s account (2005) of the JCC at WhiskyCo), especially so for \nfirst-time experiences of formal consultation. As even the anticipation of injustices can lead to \nresistance (Shapiro and Kirkman, 1999), it is important to create a degree of readiness for the \nJCC before the actual meetings. Prior preparations may prove beneficial by neutralising negative \npre-dispositions and cementing confident positive expectations, and by creating positive \ninterpersonal justice perceptions as well as distributive and informational justice anticipations. \nWe mean by ‘preparations’ any promotional activities and communications about the forum; \ntraining and support facilities provided to participants, and efforts to establish positive relations \nprior to the first official meeting.  \n \nPromotions.  \nStatements of public commitment and visible support for the JCC from each participating group \ncan help foster participants’, and their constituents’, confidence in the JCC, as well as goodwill \namong the participants themselves, since such statements – if perceived as credible and sincere - \nare indicative of benevolence. They also infer a conviction in the JCC’s likely efficacy, helping \nto create positive distributive and informational fairness anticipations. However, mis-alignment \nbetween “warm (promotional) words” and the actual design, and\/or with consequent delivered \noutcomes, will undermine any JCC even before its first meeting. Over-promotion is a risk during \nthis phase; trust and justice theories endorse communicating enthusiastic but realistic \nexpectations, to avoid fuelling cynicism and mistrust by building up and then disappointing \nentitlements or, worse, breaking promises (Schweitzer et al., forthcoming; Tomlinson et al., \n2004). Thus, we expect that promotions only have a positive long-term effect on trust and justice \n 24 \nperceptions if the expectations generated are aligned with the efficacy built into the JCC’s \ndesign. The promotional campaign can also acknowledge the shadow of the pre-voice history: to \nportray the new forum as a separate entity if relations have been negative (i.e. the JCC \nconstitutes a clear break from the past), but if relations have been broadly positive, the JCC may \nbe pitched as a continuation, and extension, of this.  \n \nTraining. \nUltimately, the JCC relies upon the effectiveness of its delegates. If either party suspects that \nother members, especially from the ‘other side’, are incapable of meaningful contributions to a \nconstructive dialogue, the JCC is unlikely to succeed. The provision of training enhances parties’ \nconfidence in the ability of the JCC itself, by producing – if successful - knowledgeable and \nskilled JCC members (thus addressing the ‘ability’ dimension of its participants’ trustworthiness \nand nurturing anticipatory distributive justice). It can also improve interpersonal communication, \nhelping to prevent misunderstandings that may spark feelings of distrust and interpersonal and \ninformational injustice. At minimum, participants should understand the purpose and scope of \nthe JCC, be capable of understanding the complexities of organisational decision-making, and \nhave the skills and sensitivities to offer relevant input. Common suggestions include the meaning \nof consultation; how to consult and be consulted; interpersonal conduct and communication in \nmeetings; basic finance skills and employment law; understanding organisational strategy; \nunderstanding trade unions (where present), and presentation skills (ACAS, 2005; Beaumont and \nHunter, 2003; IPA, 2001; Wilmott, 2004). Organisational support afforded to reps (e.g. training, \nbut also facilities and time-off for rep duties), may also be seen as an act of managerial \nbenevolence. Provision of training is expected to be positively associated with participants’ trust \nand justice perceptions, and with anticipations of the JCC’s effectiveness. Practitioner guidelines \nall recommend joint training which, if successful, should develop mutual expectations of \n 25 \ninterpersonal justice and trustworthiness, and align participants’ motives and ambitions \nregarding the JCC. However, future research could test whether joint training is superior to \nseparate training, given the two constituencies’ different learning needs.  \n \nPre-meetings. \nGiven that people trust those whom they know as people rather more than as role incumbents \n(McKnight et al., 1998), planned efforts to foster positive interpersonal relations prior to the first \nmeeting may increase trust. Such a ‘getting-to-know-you’ preparatory event may involve formal \ntrust-building\/ justice training (Greenberg, 1994; Skarlicki and Latham, 2005), or simply an \nopportunity to chat informally. If successful, this can provide additional evidence of participants’ \nlikely ability, benevolence and integrity, and can promote positive interpersonal justice \nperceptions, by strengthening JCC members’ attachment to one another (Korsgaard et al., 1995) \nand diminishing the effect of potentially polarising status differentials. Moreover, such an effort \nis over and above what is institutionally required, or has been normatively recommended, and \nhence may be seen as an example of organisational benevolence. \n \nOverall, we expect that greater use of these ‘preparation’ efforts will be positively associated \nwith higher levels of perceived trustworthiness and justice, and a more effective JCC. We also \nenvisage the preparations to have an effect on the support for JCCs and the future functioning of \nthe JCC, via their impact on different aspects of trustworthiness and justice.   \n \nThe first meeting (Stage T4). \nWhile pre-voice history, participants’ pre-dispositions and previous fairness experiences, the \ndesign, and preparatory support are all expected to be strong predictors of the initial interactions \namong the participants, these prior endeavours serve only as proxies for trust and justice, \n 26 \nbuilding anticipations about the treatment participants can expect. However, as Heller and \ncolleagues note, “formally prescribed (de jure) and actual (de facto) participation are far from \nperfectly correlated” (1998: 216). Any promotional communications and institutional protocols \ncan have only given information about the JCC, not from it directly. Moreover, since people \nreact more strongly to direct experiences than to mere expectations (Ambrose and Cropanzano, \n2003), and tend to privilege evidence from direct experience over institutional structures, these \nvariables’ influence will diminish over time once direct evidence of parties’ conduct emerges \n(McKnight et al., 1998). If there has been no previous joint endeavour (e.g. in the design, or \npreparations), the inaugural JCC meeting will be the first direct interaction among the final \ngroup of JCC participants. The meeting will also be participants’ first direct experience of de \nfacto issues pertaining to justice and trust such as the content of the consultative agenda, the \nextent of information sharing, the quality of interaction and dialogue. Both trust and justice rely \nupon participants’ actual experience of the JCC matching positive expectations, or disconfirming \nnegative ones. In short, the first meeting is a pivotal event for the further course of the JCC. \n \nIn such situations of change and uncertainty, people look out more for justice signals \n(Greenberg, 2001). Past longitudinal research in different contexts indicates that processes, \ninformation and interactions tend to be more important than actual outcomes early on in a \nchange or in a new exchange. Outcomes become more critical as time passes (Ambrose and \nCropanzano, 2003; Fortin, 2006). Cues to procedural justice have been found to be particularly \nimportant in the initial sense-making phases of relationships (Cropanzano et al., 2001). We \nexpect to observe a similar effect with new JCCs, with procedural rather than distributive \nconcerns dominating early proceedings.  Similarly, we expect participants to be less concerned \nin the first meeting with others’ benevolence (in the sense of bestowing benefits), and will value \nmore evidence of stable ability, integrity, and benevolence (in the sense of benign motives).  \n 27 \n \nThis presents participants with another intriguing dilemma that underscores the central point of \nneeding to understand, and carefully manage, expectations. The dilemma centres on the \nattraction, even temptation, of securing ‘quick wins’ (Weick, 1984; see also Kotter, 1995) to \ngenerate early momentum by demonstrating the JCC’s effectiveness, versus the need to get the \nprocesses and interpersonal conduct right, and as a result postponing the delivery of measurably \nbeneficial outcomes. While securing immediate wins can be a powerful indicator of benevolence \nand ability, and of distributive justice, this option can carry in its wake the risk of being \nunsustainable: the ‘honeymoon effect’ identified by Heller et al. (1998: 215). In addition, the \nReeder and Brewer schema (1979) cautions against prejudicing a reputation for integrity by \nneglecting process. Additionally, Heath, Knez and Camerer (1993) advise that the careful \nmanagement of preference formation or entitlements may avoid perceptions of change as an \nunfair violation of an entitlement, and a distributive injustice. Quick wins are also likely to focus \nparticipants’ judgments on distributive justice at the expense of procedural justice. This is \nsupported by van den Bos (2001) who found that people tend to give more weight to the justice \ninformation they receive first. In short, expectations of a viable process are more sustainable: \nboth parties may agree on fair procedures over time, but over the course of the consultation \nprocess it is unlikely that each party will always receive their desired outcomes. This suggests \nthat it is sensible of participants to steer away from trying to create artificially positive outcomes \nfor the first meeting, and to concentrate on building an effective process instead.  \n \nAs well as effective procedures, the quality of relational conduct is critical for the first meeting \n(i.e. actual, rather than institutionally-derived, trustworthiness and interpersonal justice). Indeed, \nas we argued above, interpersonal conduct may set the tone more powerfully than even protocols \nor preparations. Sensitive, respectful treatment enhances trust and justice and leads to increased \n 28 \ncollaboration (Colquitt et al., 2001) as, according to exchange theories (Blau, 1964; Cropanzano \nand Prehar, 1999, April), positive conduct is likely to be reciprocated, creating a “virtuous” cycle \nof reciprocity. Recall that the Dutch Kerkhof et al study (2003) found stronger evidence for \nrelational antecedents to trust in management than more instrumental (i.e. distributive) concerns. \n \nGiven its vital importance for the effectiveness of the entire consultative process, adequate \ninformation flows must be forthcoming from the very first meeting. The trust implied in sharing \nand receiving confidential information should strengthen relations (Mayer et al., 1995), while we \nhave argued above that failure to do so appropriately will hamper the JCC from the outset. \nHowever, Dirks and Ferrin (2001: 452) found support for trust’s effect on information sharing in \nonly six of ten studies. The conditions that facilitate information sharing remain under-explored. \n \nIn sum, we propose that for the first meeting, procedural fairness, interpersonal conduct and \ninformational justice will be more effective for nurturing trust and justice than delivering \ntangible benefits or decision outcomes. Note, however, that in Figure 1 a poor experience at the \nfirst meeting can be addressed by returning to the design of the JCC to rectify anomalies, or \nsources of confusion or suspicion. \n \nSubsequent meetings.  (Stage T5) \nEven if the preparations and the first meeting have gone well, progress requires sustained \nmomentum, not only to combat apathy (Wilmott, 2004: 46, 48-50), but also to avoid damaging \nwhat trust has been built up, and creating perceived injustices.  \n \nOne potential danger with providing elements of fair treatment is that people perceive them as \nentitlements. When they disappear, people who experienced fair treatment may react more \nnegatively than others who did not (Brockner et al., 2000). For the previous phase, we proposed \n 29 \nthat procedural, interpersonal and informational justice, and the ability and integrity dimensions \nof trustworthiness, are expected to be most influential in the first few meetings. Over time, after \nthe first few meetings, distributive and benevolence concerns will become more and more \nsalient, especially as participants begin to have direct experiences with the outcomes achieved \n(Ambrose and Cropanzano, 2003; Fortin, 2006). In other words, an effective procedure may \ncount for little in the long run if it fails to deliver tangible benefits. Desired outcomes of the \nconsultation process for employees include being informed, having influence on decision-\nmaking, and receiving tangible and intangible benefits from these decisions. Desired outcomes \nfor managers include better decision-making and\/or improved buy-in and support from \nemployees. Without following through on expectations generated with tangible outcomes, \nparticipants, but especially employees, will dismiss the forum as a ‘sham’ and a mere ‘talking \nshop’ (see Broad, 1994; also Gollan, 2001). \n \nWhitener et al (1998) cite ‘delegation and sharing of control’ – permitting an input into decision-\nmaking – as a trust-inspiring behaviour. However, such ‘voice’ may only reap its desired \npositive effects if consideration, an aspect of conduct relating to genuine attention to the other \nparty’s input, is present:  “If people’s input is solicited but ignored, voice is void of meaning” \n(Korsgaard et al., 2002: 64). Korsgaard and colleagues’ study found that consideration had a \npositive effect on commitment to group decisions, and on group attachment and trust in the \nleader, but levels for the latter two decreased when there was no consideration of input. Their \nresearch indicates that consideration has an effect on procedural fairness perceptions \nindependent of whether the input will actually be taken into account when making the decision.  \n \nDifferent forms of justice are interrelated, such that people typically react less negatively to \nunsatisfactory and unfair outcomes if procedures or conduct are fair, or if they have received \n 30 \nadequate explanations and information to justify the outcomes (Folger and Cropanzano, 1998). \nResearch indicates however that this effect may not be sustainable: people who have \nexperienced numerous injustices are less likely to accept explanations or social accounts \n(Davidson and Friedman, 1998). On this point, we reiterate that the quality of information flows \n(in clarity, adequacy, and sincerity terms) will be a further determinant of the course of JCCs \nover time (Bies et al., 1988). The use of convincing, honest explanations, apologies and social \naccounts for decisions is likely to significantly improve reactions to the JCC’s decisions, and \nmay also be taken as indication of a party’s ability and integrity (Sitkin and Bies, 1993; Bottom \net al., 2002). In the context of JCCs, information itself may prove a valued outcome (i.e. being \nmore informed), making the distinction between the four dimensions of justice somewhat fluid \nin this respect (an issue that has been described by Cropanzano and Ambrose, 2001). However, \nan interesting potential paradox is that the more employee reps understand pressures on \nmanagement in decision-making the more evidence may be accrued of the inherent conflict of \ninterest between the two parties (cf. Edwards, 1986), such that the provision of confidential \ninformation, far from enhancing trust and justice, may in fact contain the seeds of increased \nemployee cynicism and even militancy (see Broad, 1994).  \n \nIn sum, we anticipate that distributive justice and benevolence (in the sense of receiving \nmutually beneficial outcomes) will be the most important determinants of buy-in in the long \nterm. However, appropriate expectation setting in the beginning is crucial, as is the ability of \nparticipants to create wins for both parties.  \n \nThe medium-term future of the JCC.  \nWe have identified carry-over effects among the five stages, producing virtuous or vicious \ncycles of engagement. While we cannot argue that these developments will necessarily occur in \n 31 \na linear fashion – trust can be broken and repaired, and justice perceptions can change –\ntendencies towards either strengthening or weakening trust and justice perceptions are likely to \nbe observable at least in the medium-term future. Thus, we expect that the JCC will become \ninstitutionalised as a feature of the organisation if participants’ positive expectations and \nperceptions have been sustained, but will suffer from atrophy and wither into obscurity and \ndeath if these are repeatedly undermined or left unrealised.9 \n \nConclusions  \nBy using the lenses of trust and justice we hope to have provided a comprehensive framework \nfor researchers to investigate the exchange relationship between management delegates and \nemployee representatives on a joint consultative committee. The framework seeks to explain and \npredict the forum’s progress over time through what the different stakeholders may perceive to \nbe central determinants of the fairness and trustworthiness in the JCC process; the likely effects \nof various structural and conduct-based interventions, and the most important outcomes. We also \nhope the framework can help practitioners to manage the various stages of the establishment of a \nJCC by taking an incremental approach to nurturing and modifying participants’, and wider \nconstituencies’, expectations of trustworthiness and justice over the life-cycle of the JCC (cf. \nFigure 1). To do so, we posit that different aspects of fairness and trustworthiness need to be \nprioritised at different stages in the process.  \n \nFor future research, we believe that understanding the nature of a JCC in social exchange terms \nis valuable, and illuminating. Researchers will be unable to account fully for cycles of \n                                                 \n9\n MacInnes (1985: 104, cited in Marchington, 1987: 345) provides a vivid account of the demise of a JCC: \n“eventually either one of the parties decides the effort is not worthwhile and the attempt is abandoned, or \nconsultation becomes a very marginal activity, going through the motions on a diet of trivial issues. There is rarely a \ndramatic end. Usually committees become progressively less regular and meaningful as members fail to turn up or \nhave more pressing priorities. Eventually someone not only forgets to organise a meeting, others forget that they \nhave forgotten”. \n 32 \nengagement among JCC participants without reference to the perspectives of each ‘side’. To \nprivilege managers’ perceptions over those of the other parties runs the risk of telling only a \npartial story, and will lead to a reduced power to explain events over time. This points to the \nneed for multiple-rater\/ respondent study designs. Our iterative framework of highly \ninterdependent phases also necessitates research methods that track progress of participants’ \nbeliefs, interpretations of events and attitudes over time. This holds true both for qualitative and \nfor quantitative approaches: cross-sectional surveys or a ‘single snapshot’ set of interviews are \nunable to capture such processes.  \n \nThe deliberately vague official guidelines on the introduction of JCCs provide researchers with \nthe opportunity to compare very different approaches: how does trust and justice fare under \nminimum compliance with the Directive – putting in place a nominal amount of voice with little \ninput, consideration or infrastructural support - compared with a JCC that exceeds the statutory \nrequirements? Which interventions work best? Our framework strongly implies that a “bare \nbones” approach will be less than what is needed for a JCC to be ‘workable’ and sustainable. (Of \ncourse, this may be some managers’ tactic, to engineer employees’ indifference.) In order to \nbuild a sustainable JCC, parties need to take into account the four dimensions of justice as \noutlined above. Yet to reach higher levels of effectiveness, actions beyond the parameters of \njustice theory, and into the realm of trust (notably benevolence and confident risk-taking), may \nbe necessary. \n \nWhile morality and ethics have not been the focus of this paper, we do not intend to promote \ncynical window-dressing or setting shamefully low employee expectations in order to fulfil \nthem. Indeed, our framework suggests that such a strategy is not only ethically wrong, but also \nlikely to prove unsustainable, and ultimately counter-productive. \n 33 \n \nWe conclude with commentary on the risk taking that JCCs imply for both managers and reps. \nManagers face the dilemma between setting high or low expectations. Low expectations may be \neasier to fulfil and to sustain, but may forego opportunities for significant relationship \ndevelopment, and it is not sure whether the purposes of consultation can ultimately be served by \nthis tactic. High expectations on the other hand may be both harder to fulfil and to sustain, but \ncan potentially realise more positive outcomes, thereby becoming their own reward. Managers \nwill need to decide “how much voice do they dare?” Similarly, British trade unions’ long-\nstanding wariness of JCCs seems at present to be holding firm. But are they playing into \nmanagers’ hands by not raising employees’ expectations on what real voice should look like, \nand not taking this legislatively-backed opportunity to extend employees’ influence at work? It \nremains to be seen how far employee reps – unionised or otherwise - are willing to engage in \nopen and honest conversation with management and to bear the responsibilities that come with \nincreased involvement in decision-making. The question here is, “how much voice can \nemployees really cope with?”   \n 34 \nFigure 1: The six phases of the JCC process. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 2: The multiple relationships in a joint consultative committee. \n \nKEY:   The principal relationship under examination. \n  Additional organisational relationships that will affect the principal relationship. \n \n \n \n \n \n \n \n \n \n \n     \n \n \n \n \nManagers:                 \nJCC participants \nManagers:           \nnon-participants \nEmployee \nrepresentatives:     \nJCC participants Employees:  \nnon-participants \nTU-\naffiliated \nreps  \nNon-TU \nreps \nT1: Pre-voice history \nT2: Design of \nthe JCC \nT3: Preparations \nT4: 1st meeting \nT5: Subsequent \nmeetings \nThe JCC to ‘fade \nout’, or become \ninstitutionalised? \nNeed for a revised \ndesign? \nDecision to \nestablish a JCC \nRevised design \n 35 \nREFERENCES. \n \nACAS (2005) Information and consultation guidelines. Available on the ACAS website: \nwww.acas.org.uk. \nAdams, J. S. (1965) Inequity in Social Exchange. In Berkowitz, L. (ed) Advances in experimental social \npsychology. New York: Academic Press. \nAmbrose, M. L. & Cropanzano, R. (2003) A Longitudinal Analysis of Organizational Fairness: An \nExamination of Reactions to Tenure and Promotion Decisions. Journal of Applied Psychology, \n88: 266-275. \nBeaumont, P. & Hunter, L. (2003) Information and consultation: from compliance to performance, \nLondon: CIPD. \nBeaumont, P. & Hunter, L. (2005) The processes of consultation. Paper presented at the ‘Voice and \nvalue’ conference, London School of Economics, 18 March  \nBies, R. J. & Moag, J. (1986) Interactional Justice: Communication criteria of fairness. In Lewicki, R., \nSheppard, B. & Bazerman, M. (eds) Research on Negotiation in Organizations. Greenwich: JAI \nPress. \nBies, R. J. & Shapiro, D. L. (1987) Interactional Fairness Judgements: The Influence of Causal Accounts. \nSocial Justice Research, 1: 199-219. \nBies, R. J. & Shapiro, D. L. (1988) Voice and justification: Their influence on procedural fairness \njudgments. Academy of Management Journal, 31: 676-685. \nBies, R. J., Shapiro, D. L. & Cummings, L. L. (1988) Causal accounts and managing organizational \nconflict: Is it enough to say it's not my fault? Communication Research, 15: 381-399. \nBlau, P. M. (1964) Exchange and power in social life, New York: Wiley. \nBottom, W. P., Gibson, K., Daniels, S. & Murninghan, J. K. (2002) When talk is not cheap: Substantive \npenance and expressions of intent in rebuilding cooperation. Organization Science, 13: 497-513. \nBroad, G. (1994) Japan in Britain: the dynamics of joint consultation. Industrial Relations Journal, 25: \n26-38. \nBrockner, J., Chen, Y.-R., Mannix, E. A., Leung, K. & Skarlicki, D. P. (2000) Culture and Procedural \nFairness: When the Effects of What you do depend  on how you do it. Administative Science \nQuarterly, 45: 138-159. \nBrockner, J., & Siegel, P. 1996. Understanding the interaction between procedural and distributive \njustice: The role of trust. In R.M. Kramer & T.R. Tyler (Ed.) Trust in organizations: frontiers of \ntheory and research: 390-413. Thousand Oaks, CA: Sage. \nBrockner, J. & Wiesenfeld, B. M. (1996) An integrative framework for explaining reactions to decision: \nInteractive effects of outcomes and procedures. Psychological Bulletin, 120: 189-208. \nByrne, Z. S. & Cropanzano, R. (2001) The History of Organizational Justice: The Founders Speak. In \nCropanzano, R. (ed) Justice in the Workplace: From Theory to Practice. Mahwah, New Jersey: \nLawrence Erlbaum Associates. \nColquitt, J. A. (2001) On the Dimensionality of Organizational Justice: A Construct Validation of a \nMeasure. Journal of Applied Psychology, 86: 386-400. \nColquitt, J. A., Conlon, D. E., Wesson, M. J., Porter, C. O. & Ng, K. Y. (2001) Justice  at the millennium: \na meta-analytic review of 25 years of organizational justice research. Journal of Applied \nPsychology, 86: 425-445. \nCropanzano, R. & Ambrose, M. L. (2001) Procedural and Distributive Justice Are  More Similar than \nYou Think: A Monistic Perspective and a Research Agenda. In Greenberg, J. & Cropanzano, R. \n(eds) Advances in Organizational Justice. Stanford, California: Stanford University Press. \nCropanzano, R., Byrne, Z. S., Bobocel, R. & Rupp, D. (2001) Moral Virtues, Fairness Heuristics, Social \nEntities and Other Denizens of Organizational Justice. Journal of Vocational Behavior, 58: 164-\n209. \nCropanzano, R. & Prehar, C.A. (1999, April) Using social exchange theory to distinguish procedural \nfrom interactional justice. Paper presented at the Annual Meeting of the Society for Industrial \nand Organizatioanl Psychology. Atlanta, GA. \nCully M, O’Reilly A, Millward N, Forth J, Woodland S, Dix J & Bryson A (2000). Britain at work: as \ndepicted by the 1998 workplace employee relations survey.  London: Routledge \n 36 \nDavidson, M. & Friedman, R. A. (1998) When excuses don't work: the persistent injustice effect among \nBlack managers. Administrative Science Quarterly, 43: 154-183. \nDeutsch, M. (1975) Equity, equality, and need: What determines which value will be used as the basis for \ndistributive justice? Journal of Social Issues, 31: 137-149. \nDirks, K., Cummings, L. & Pierce, J. (1996) Psychological ownership in organizations: Conditions under \nwhich individuals promote and resist change. Research in Organizational Change and \nDevelopment, 9: 1-23. \nDirks, K & Ferrin, D.F (2001). The role of trust in organizational settings. Organization Science. 12: 450-\n467 \nDriscoll, J. W. (1978) Trust and participation in organizational decision-making as predictors of \nsatisfaction. . Academy of Management Journal, 21: 44-56. \nDundon, T., Wilkinson, A., Marchington, M. & Ackers, P. (2004) The meanings and purpose of \nemployee voice. International Journal of Human Resource Management, 15: 1149-1170. \nEdwards, P. (1986) Conflict at work, Oxford: Blackwell. \nFolger, R. (1986) Rethinking Equity theory: A referent cognitions model. In Bierhoff, H.-W., Cohen, R. \nL. & Greenberg, J. (eds) Justice in social relations. New York: Plenum. \nFolger, R. & Cropanzano, R. (1998) Organizational Justice and Human Resource Management, London: \nSage Publications. \nFolger, R. & Cropanzano, R. (2001) Fairness Theory: Justice as Accountability. In Greenberg, J. & \nCropanzano, R. (eds) Advances in Organizational Justice. Stanford, California: Stanford \nUniversity Press. \nFortin, M. (2006) Fairness, Outcomes, Expectations: exploring the drivers of individual reactions to \nplanned organisational change Ph.D. thesis. School of Business Studies. Dublin: Trinity College. \nFox, A. (1974) Beyond Contract: Work, Power and Trust Relations., London: Faber and Faber. \nGollan, P. (2001) Tunnel vision: non-union employee representation at Eurotunnel. Employee Relations, \n23: 376-400. \nGranovetter, M. (1985) Economic action and social structure: A theory of embeddedness. American \nJournal of Sociology, 91: 481-510. \nGreenberg, J. (1990) Organizational justice: Yesterday, today, and tomorrow. Journal of Management, \n16: 399-432. \nGreenberg, J. (1993) The social side of fairness: Interpersonal and informational classes of organizational \njustice. In Cropanzano, R. (ed) Justice in the workplae: Approaching fairness in human resource \nmanagement. Hillsdale, NJ: Erlbaum. \nGreenberg, J. (1994) Using socially fair treatment to promote acceptance of a work site smoking ban. \nJournal of Applied Psychology, 79: 288-297. \nGreenberg, J. (2001) The Seven Loose Can(n)ons of Organizational Justice. In Greenberg, J. & \nCropanzano, R. (eds) Advances in Organizational Justice. Stanford, California: Stanford \nUniversity Press. \nGuest, D.E. and Peccei, R. (2001). ‘Partnership at work: mutuality and the balance of advantage’. British \nJournal of Industrial Relations, 39: 207-236. \nHeath, C., Knez, M. & Camerer, C. (1993) The strategic management of the entitlement process in the \nemployment relationship. Strategic Management Journal, 14: 75-93. \nHeller, F., Pusic, E., Strauss, G. & Wilpert, B. (1998) Organizational participation: myth and reality, \nOxford: Oxford University Press. \nHomans, G. C. (1961) Social behaviour: Its elementary forms, London: Routledge and Kegan Paul. \nIPA (2001) Sharing the challenge ahead: informing and consulting with your workforce, London: \nInvolvement and Participation Association   \nIPA (2002) Informing & Consulting your Workforce: Peabody Trust, London: IPA. \nIPA (2004a) Informing & Consulting your Workforce: Handling restructuring at BP Exploration, \nLondon: IPA. \nIPA (2004b) Informing & Consulting your Workforce: United Welsh Housing Association, London: IPA. \nIPA (2005) Informing & Consulting your Workforce: The Egg People Forum, London: IPA. \nKerkhof, P., Winder, A. B. & Klandermans, B. (2003) Instrumental and relational determinants of trust in \nmanagement among members of Dutch works councils. Personnel Review, 32: 623-637. \n 37 \nKessler, I. & Purcell, J. (1996) The value of joint working parties. Work, Employment and Society, 10: \n663-682. \nKim, P.H, Ferrin, D.L., Cooper, C.D., & Dirks, K.T. 2004. Removing the shadow of suspicion: the \neffects of apology versus denial for repairing competence- versus integrity-based trust violations. \nJournal of Applied Psychology, 89 (1): 104-118. \nKorsgaard, M. A., Sapienza, H. J. & Schweiger, D. M. (2002) Beaten Before Begun: The Role of \nProcedural Justice in Planning Change. Journal of Management, 28: 497-516. \nKorsgaard, M. A., Schweiger, D. M. & Sapienza, H. J. (1995) Building Commitment, Attachment, and \nTrust in Strategic Decision-Making Teams: The Role of Procedural Justice. The Academy of \nManagement Journal, 38: 60-84. \nKotter, J. P. (1995) Leading Change: Why transformation efforts fail. Harvard Business Review: 59-67. \nKramer, R. M. (1996) Divergent realities and convergent disappointments in the hierarchic relation: Trust \nand the intuitive auditor at work In Kramer, R. M. & Tyler, T. R. (eds) Trust in organizations: \nfrontiers of theory and research. Thousand Oaks, CA: Sage. \nLeventhal, G. S. (1976) The distribution of rewards and resources in groups and organizations. In \nBerkowithz, L. & Walster, E. (eds) Advances in experimental social psychology. New York: \nAcademic Press. \nLeventhal, G. S. (1980) What should be done with equity theory? In Gergen, K. J., Greenberg, M. S. & \nWillis, R. H. (eds) Social exchanges: Advances in Theory and Research. New York: Plenum. \nLewicki, R., McAllister, D. & Bies, R. J. (1998) Trust and Distrust: New relationships and realities. \nAcademy of Management Review, 23: 438-458. \nLewicki, R. J. & Bunker, B. B. (1996) Developming and Maintaining Trust in Work Relationships. In \nKramer, R. M. & Tyler, T. R. (eds) Trust in Organizations: Frontiers of Theory and Research. \nThousand Oaks, CA: Sage. \nLewicki, R. J., Wiethoff, C. & Tomlinson, E. C. (2005) What is the Role of Trust in Organizational \nJustice? In Greenberg, J. & Colquitt, J. A. (eds) Handbook of Organizational Justice. Mahwah, \nNJ: Lawrence Erlbaum Associates. \nLind, E. A. (2001) Fairness Heuristic Theory: Justice Judgements as Pivotal Cognitions in Organizational \nRelations. In Greenberg, J. & Cropanzano, R. (eds) Advances in Organizational Justice. \nStanford, California: Stanford University Press. \nLind, E. A. & Tyler, T. R. (1988) The social psychology of procedural justice, New York: Plenum. \nMarchington, M. (1987) A review and critique of research on developments in joint consultation. British \nJournal of Industrial Relations, 25: 340-352. \nMarchington, M. (1994) The dynamics of joint consultation. In Sisson, K. (ed) Personnel Management: a \ncomprehensive guide to theory and practice in Britain. Oxford: Blackwell. \nMarchington, M., Wilkinson, A., Ackers, P. & Dundon, T. (2001) Management choice and employee \nvoice, London: CIPD. \nMayer, R. C., Davis, J. H. & Schoorman, F. D. (1995) An integrative model of organizational trust. \nAcademy of Management Review, 20: 709-734. \nMcEvily, B., Perrone, V. & Zaheer, A. (2003) Trust as an organizing principle. Organization Science, 14: \n91-103. \nMcKnight, D.H., Cummings, L.L. & Chervany, N.L. (1998) Initial trust formation in new organizational \nrelationships. Academy of Management Review, 12: 473-490. \nPerrone, V., Zaheer, A. & McEvily, B. (2003) Free to be trusted? Organizational constraints on trust in \nboundary spanners. Organization Science, 14: 422-439. \nRamsay, H. (1976) Participation: the shop floor view. British Journal of Industrial Relations, 14: 128-\n141. \nReeder, G. D. & Brewer, M. B. (1979) A schematic model of dispositional attribution in interpersonal \nperception. Psychological Review, 86: 61-79. \nRousseau, D. M., Sitkin, S. B., Burt, S. R. & Camerer, C. (1998) Not so different after all: A cross-\ndiscipline view of trust. Academy of Management Review, 23: 393-404. \nSampson, E. E. (1975) On justice as equality. Journal of Social Issues, 31: 45-64. \nSaunders, M.N.K, Thornhill, A. & Lewis, P. (2002) Understanding Employees' Reactions to the \nManagement of Change: An Exploration through an organizational justice framework. Irish \nJournal of Management, 23: 85-108 \n 38 \nSaunders M.N.K and Thornhill, A (2004) Trust and mistrust in organisations: An exploration using an \norganisational justice framework European Journal of Work and Organisational Psychology \n13.4, 492-515. \nSchweitzer, M.E., Hershey, J.C and Bradlow, E.T (forthcoming). 'Promises and lies: restoring violated \ntrust. Organizational Behavior and Human Decision Processses. \nShapiro, D. L. & Kirkman, B. L. (1999) Employees' reaction to the change to work teams: The influence \nof \"anticipatory\" injustice. Journal of Organizational Change Management, 12: 51-66. \nShapiro, D. L. & Kirkman, B. L. (2001). Anticipatory Injustice: The Consequences of Expecting Injustice \nin the Workplace. In Greenberg, J. & Cropanzano, R. (eds) Advances in Organizational Justice. \nStanford, California: Stanford University Press. \nShaw, J. C., Wild, E. & Colquitt, J. A. (2003) To Justify or Excuse?: A Meta-Analytic Review of the \nEffects of Explanations. Journal of Applied Psychology, 88: 444-458. \nSitkin, S. B. & Bies, R. J. (1993) The legalistic organization: definitions, dimensions, and dilemmas. \nOrganization Science, 4: 345-351. \nSitkin, S. B. & Roth, N. L. (1993) Explaining the limited effectiveness of legalistic ‘remedies’ for \ntrust\/distrust. Organization Science, 4: 367-392. \nSkarlicki, D. P. & Latham, G. P. (2005) How Can Training Be Used to Foster Organizational Justice? In \nGreenberg, J. & Colquitt, J. A. (eds) Handbook of Organizational Justice. Mahwah, New Jersey: \nLawrence Erlbaum Associates. \nSlovic, P. (1993) Perceived risk, trust, and democracy. Risk Analysis, 13: 675-682. \nSpreitzer, G. M. & Mishra, A. K. (1999) Giving up without losing control: trust and its substitutes’ \neffects on managers’ involving employees in decision-making. Group and Organization \nManagement, 24: 155-187. \nThibaut, J. & Walker, L. (1975) Procedural Justice. Hillsdale, NJ: Erlbaum. \nThornhill, A. & Saunders, M. N. (2003) Exploring Employees' Reactions to Strategic Change Over Time: \nThe Utilisation of an Organisational Justice Perspective. The Irish Journal of Management, 24: \n66-86. \nTomlinson, E.C., Dineen, B.R., & Lewicki, R.J. 2004. The road to reconciliation: antecedents of victim \nwillingness to reconcile following a broken promise. Journal of Management, 30: 2: 165-188. \nTrevor, M. (1988) Toshiba’s new British company: competitiveness through innovation in industry. \nLondon: Policy Studies Institute. \nVan den Bos, K. (2001) Fairness Heuristic Theory: Assessing the Information to Which People are \nReacting has a Pivotal Role in Understanding Organizational Justice. In Gilliland, S. W., Steiner, \nD. D. & Skarlicki, D. P. (eds) Theoretical and Cultural Perspectives on Organizational Justice. \nGreenwich, CT: IAP. \nVan den Bos, K., Wilke, H. A. M., Lind, E. A. & Vermunt, R. (1998) Evaluating outcomes by means of \nthe fair process effect: Evidence for different processes in fairness and satisfaction judgments. \nJournal of Personality and Social Psychology, 74: 1493-1503. \nWeick, K. (1984) Small Wins: Redefining the scale of social problems. The American Psychologist.  \nWhitener E.M., Brodt S.E., Korsgaard M.A. & Werner J.M. (1998). Managers as initiators of trust: an \nexchange relationship framework for understanding managerial trustworthy behaviour. Academy \nof Management Review, 23: 513-530 \nWilkinson, A. & Ackers, P. (1995) When two cultures meet: new industrial relations at Japanco. \nInternational Journal of Human Resource Management, 6: 849-871. \nWilmott, B. (2004) Information and consultation: a guide, London: CIPD. \nZucker, L. G. (1986) Production of trust: institutional sources of economic structure, 1840-1920. \nResearch into Organizational Behavior, 8: 53-111. \n \n \n"}