{"doi":"10.1029\/2007JA012752","coreId":"70933","oai":"oai:eprints.lancs.ac.uk:9388","identifiers":["oai:eprints.lancs.ac.uk:9388","10.1029\/2007JA012752"],"title":"Particle precipitation during ICME-driven and CIR-driven geomagnetic storms","authors":["Longden, N.","Denton, Michael H.","Honary, Farideh"],"enrichments":{"references":[{"id":16376283,"title":"A study of auroral absorption at 30 Mc\/s,","authors":[],"date":"1963","doi":"10.1139\/p63-061","raw":"Hartz, T. R., L. E. Montbriand, and E. L. Vogan (1963), A study of auroral absorption at 30 Mc\/s, Can. J. Phys., 41, 581–595.","cites":null},{"id":16376285,"title":"Analysis of riometer observations obtained during polar radio blackouts,","authors":[],"date":"1961","doi":"10.1016\/0021-9169(61)90048-4","raw":"Holt, O., B. Landmark, and F. Lied (1961), Analysis of riometer observations obtained during polar radio blackouts, J. Atmos. Terr. Phys., 23, 229–248.","cites":null},{"id":16376269,"title":"Are our ideas about Dst correct?,","authors":[],"date":"1999","doi":"10.1007\/s00585-999-0001-0","raw":"Grafe, A. (1999), Are our ideas about Dst correct?, Ann. Geophys., 17, 1–10.","cites":null},{"id":16376274,"title":"Auroral absorption of HF radio waves in the ionosphere: A review of results from the first decade of riometry,","authors":[],"date":"1969","doi":"10.1109\/proc.1969.7275","raw":"Hargreaves, J. K. (1969), Auroral absorption of HF radio waves in the ionosphere: A review of results from the first decade of riometry, P. IEEE, 57, 1348–1373.","cites":null},{"id":16376264,"title":"Coronal mass ejections: Initiation and detection,","authors":[],"date":"2003","doi":"10.1016\/s0273-1177(02)00888-8","raw":"Gopalswamy, N. (2003), Coronal mass ejections: Initiation and detection, Adv. Space Res., 31, 869–881.","cites":null},{"id":16376354,"title":"Corotating solar wind streams and recurrent geomagnetic activity: A review,","authors":[],"date":"2006","doi":"10.1029\/2006ja011745","raw":"Tsurutani, B. T., et al. (2006), Corotating solar wind streams and recurrent geomagnetic activity: A review, J. Geophys. Res., 111,A 0 7 S 0 1 , doi:10.1029\/2005JA011273.","cites":null},{"id":16376326,"title":"Correlated effects of energetic electrons at the 6.6 RE equator and the auroral zone during magnetospheric substorms,","authors":[],"date":"1968","doi":null,"raw":"Parks, G. K., R. L. Arnoldy, T. W. Lezniak, and J. R. Winckler (1968), Correlated effects of energetic electrons at the 6.6 RE equator and the auroral zone during magnetospheric substorms, Radio Sci., 3, 715–719.","cites":null},{"id":16376322,"title":"Cosmic radio-noise absorption bursts caused by solar wind shocks,","authors":[],"date":"2004","doi":"10.5194\/angeo-22-2973-2004","raw":"Osepian, A., and S. Kirkwood (2004), Cosmic radio-noise absorption bursts caused by solar wind shocks, Ann. Geophys., 22, 2973–2987.","cites":null},{"id":16376259,"title":"Criteria of interplanetary parameters causing intense magnetic storms (Dst <","authors":[],"date":"1987","doi":"10.1016\/0032-0633(87)90015-8","raw":"Gonzalez, W. D., and B. T. Tsurutani (1987), Criteria of interplanetary parameters causing intense magnetic storms (Dst <  100 nT), Planet.","cites":null},{"id":16376255,"title":"Day to day variability of riometer absorption,","authors":[],"date":"1984","doi":null,"raw":"A06205 LONGDEN ET AL.: ICME- AND CIR-DRIVEN PRECIPITATION 11 of 12 A06205Foppiano, A. J., and P. A. Bradley (1984), Day to day variability of riometer absorption, J. Atmos. Terr. Phys., 46, 689–696.","cites":null},{"id":16376262,"title":"de Gonzalez","authors":[],"date":"1999","doi":"10.1023\/a:1005160129098","raw":"Gonzalez, W. D., B. T. Tsurutani, and A. L. C. de Gonzalez (1999), Interplanetary origin of geomagnetic storms, Space Sci. Rev., 88, 529–562.","cites":null},{"id":16376252,"title":"Dependence of convective flows and particle precipitation in the high latitude ionosphere on the X and Z-components of the interplanetary magnetic field,","authors":[],"date":"1991","doi":"10.1029\/90ja02063","raw":"Cowley, S. W. H., J. P. Morelli, and M. Lockwood (1991), Dependence of convective flows and particle precipitation in the high latitude ionosphere on the X and Z-components of the interplanetary magnetic field, J. Geophys. Res., 96, 5557–5564.","cites":null},{"id":16376330,"title":"Development of the auroral absorption substorm: Studies of pre-onset phase and sharp onset using an extensive riometer network,","authors":[],"date":"1981","doi":"10.1016\/0032-0633(81)90095-7","raw":"Ranta, H., A. Ranta, P. N. Collis, and J. K. Hargreaves (1981), Development of the auroral absorption substorm: Studies of pre-onset phase and sharp onset using an extensive riometer network, Planet. Space Sci., 29, 1287–1313.","cites":null},{"id":16376246,"title":"Differences between CMEdriven storms and CIR-driven storms,","authors":[],"date":"2006","doi":"10.1029\/2005ja011447","raw":"Borovsky, J. E., and M. H. Denton (2006), Differences between CMEdriven storms and CIR-driven storms, J. Geophys. Res., 111, A07S08, doi:10.1029\/2005JA011447.","cites":null},{"id":16376319,"title":"Flux dropouts of plasma and energetic particles at geosynchronous orbit during large geomagnetic storms: Entry into the lobes,","authors":[],"date":"1995","doi":"10.1029\/94ja03025","raw":"Moldwin, M. B., M. F. Thomsen, S. J. Bame, D. J. McComas, J. Birn, G. D. Reeves, R. Nemzek, and R. D. Belian (1995), Flux dropouts of plasma and energetic particles at geosynchronous orbit during large geomagnetic storms: Entry into the lobes, J. Geophys. Res., 100, 8031–8043.","cites":null},{"id":16376248,"title":"Further studies of ionospheric and geomagnetic effects of sudden impulses,","authors":[],"date":"1973","doi":"10.1016\/0032-0633(73)90122-0","raw":"Brown, R. R., and V. M. Driatsky (1973), Further studies of ionospheric and geomagnetic effects of sudden impulses, Planet. Space Sci., 21, 1931–1935.","cites":null},{"id":16376266,"title":"Geomagnetic activity associated with Earth passage of interplanetary shock disturbances and coronal mass ejections,","authors":[],"date":"1991","doi":"10.1029\/91ja00316","raw":"Gosling, J. T., D. J. McComas, J. L. Phillips, and J. Bame (1991), Geomagnetic activity associated with Earth passage of interplanetary shock disturbances and coronal mass ejections, J. Geophys. Res., 96, 7831–7839.","cites":null},{"id":16376349,"title":"Geomagnetic negative sudden impulses: Interplanetary causes and polarization distribution,","authors":[],"date":"2002","doi":"10.1029\/2001ja900152","raw":"Takeuchi, T., T. Araki, A. Viljanen, and J. Watermann (2002), Geomagnetic negative sudden impulses: Interplanetary causes and polarization distribution, J. Geophys. Res., 107(A7), 1096, doi:10.1029\/2001JA900152.","cites":null},{"id":16376254,"title":"Geomagnetic storms driven by ICME- and CIR-dominated solar wind,","authors":[],"date":"2006","doi":"10.1029\/2005ja011436","raw":"Denton, M. H., J. E. Borovsky, R. M. Skoug, M. F. Thomsen, B. Lavraud, M. G. Henderson, R. L. McPherron, J. C. Zhang, and M. W. Liemohn (2006), Geomagnetic storms driven by ICME- and CIR-dominated solar wind, J. Geophys. Res., 111, A07S07, doi:10.1029\/2005JA011436.","cites":null},{"id":16376341,"title":"Ground based identification of dispersionless electron injections,","authors":[],"date":"2007","doi":"10.1029\/2006gl028329","raw":"Spanswick, E., E. Donovan, R. Friedel, and A. Korth (2007), Ground based identification of dispersionless electron injections, Geophys. Res. Lett., 34, L03101, doi:10.1029\/2006GL028329.","cites":null},{"id":16376358,"title":"High-resolution global storm index: Dst versus SYM-H,","authors":[],"date":"2006","doi":"10.1029\/2005ja011034","raw":"Wanliss, J. A., and K. M. Showalter (2006), High-resolution global storm index: Dst versus SYM-H, J. Geophys. Res., 111, A02202, doi:10.1029\/ 2005JA011034. M. H. Denton, F. Honary, and N. Longden, Space Plasma Environment and Radio Science Group, Department of Communication Systems, Lancaster University, Infolab 21, Lancaster LA1 4YW, UK. (n.longden@lancaster.ac.uk) A06205 LONGDEN ET AL.: ICME- AND CIR-DRIVEN PRECIPITATION 12 of 12 A06205","cites":null},{"id":16376245,"title":"High-Z energetic particles at geosynchronous orbit during the great solar proton event series of","authors":[],"date":"1992","doi":"10.1029\/92ja01139","raw":"Belian, R. D., G. R. Gisler, T. Cayton, and R. Christensen (1992), High-Z energetic particles at geosynchronous orbit during the great solar proton event series of October 1989, J. Geophys. Res., 97, 16,897–16,906.","cites":null},{"id":16376251,"title":"Interplanetary coronal mass ejections in the near-Earth solar wind during 1996–2002,","authors":[],"date":"2003","doi":"10.1029\/2002ja009817","raw":"Cane, H. V., and I. G. Richardson (2003), Interplanetary coronal mass ejections in the near-Earth solar wind during 1996–2002, J. Geophys. Res., 108(A4), 1156, doi:10.1029\/2002JA009817.","cites":null},{"id":16376352,"title":"Interplanetary origin of geomagnetic activity in the declining phase of the solar cycle,","authors":[],"date":"1995","doi":"10.1029\/95ja01476","raw":"Tsurutani, B. T., W. D. Gonzalez, A. L. C. Gonzalez, F. Tang, J. K. Arballo, and M. Okada (1995), Interplanetary origin of geomagnetic activity in the declining phase of the solar cycle, J. Geophys. Res., 100, 21,717–21,733.","cites":null},{"id":16376342,"title":"Investigations of ionospheric radio wave absorption processes using imaging riometer techniques,","authors":[],"date":"1996","doi":"10.1016\/0021-9169(95)00072-0","raw":"Stauning, P. (1996), Investigations of ionospheric radio wave absorption processes using imaging riometer techniques, J. Atmos. Terr. Phys., 58, 753–764.","cites":null},{"id":16376300,"title":"Ionospheric absorption of cosmic radio noise,","authors":[],"date":"1966","doi":"10.1007\/bf00173104","raw":"Hultqvist, B. (1966), Ionospheric absorption of cosmic radio noise, Space Sci. Rev., 5, 771–817.","cites":null},{"id":16376249,"title":"Large-scale electron bombardment of the atmosphere at the sudden commencement of a geomagnetic storm,","authors":[],"date":"1961","doi":"10.1029\/jz066i004p01035","raw":"Brown, R. R., T. R. Hartz, B. Landmark, H. Leinbach, and J. Ortner (1961), Large-scale electron bombardment of the atmosphere at the sudden commencement of a geomagnetic storm, J. Geophys. Res., 66, 1035–1041.","cites":null},{"id":16376306,"title":"McCrea (2004),The statistical dependence of auroral absorption on geomagnetic and solar wind parameters,","authors":[],"date":null,"doi":"10.5194\/angeo-22-877-2004","raw":"Kavanagh, A. J., M. J. Kosch, F. Honary, A. Senior, S. R. Marple, E. E. Woodfield, andI. W. McCrea (2004),The statistical dependence of auroral absorption on geomagnetic and solar wind parameters, Ann. Geophys., 22, 877–887.","cites":null},{"id":16376355,"title":"Modeling the Earth’s magnetospheric field confined within a realistic magnetopause,","authors":[],"date":"1995","doi":"10.1029\/94ja03193","raw":"Tsyganenko, N. A. (1995), Modeling the Earth’s magnetospheric field confined within a realistic magnetopause, J. Geophys. Res., 100, 5599–5612.","cites":null},{"id":16376257,"title":"Morphology of background auroral absorption,","authors":[],"date":"1985","doi":"10.1016\/0021-9169(85)90102-3","raw":"Foppiano, A. J., and P. A. Bradley (1985), Morphology of background auroral absorption, J. Atmos. Terr. Phys., 47, 663–674.","cites":null},{"id":16376337,"title":"Mu ¨hlhauser, andH. Rosenbauer","authors":[],"date":"1985","doi":"10.1029\/ja090ia01p00163","raw":"Sheeley, N.R., Jr.,R. A. Howard,M. J.Koomen,D.J. Michels,R. Schwenn, K.-H. Mu ¨hlhauser, andH. Rosenbauer (1985), Coronal mass ejections and interplanetary shocks, J. Geophys. Res., 90, 163–175.","cites":null},{"id":16376243,"title":"Near-equatorial, high-resolution measurements of electron precipitation at","authors":[],"date":"1981","doi":"10.1029\/ja086ia04p02295","raw":"Baker, D. N., P. Stauning, E. W. Hones Jr., P. R. Higbie, and R. D. Belian (1981), Near-equatorial, high-resolution measurements of electron precipitation at L ’ 6.6, J. Geophys. Res., 86, 2295–2313.","cites":null},{"id":16376308,"title":"Observations of the response time of high-latitude ionospheric convection to variations in the interplanetary magnetic field using EISCAT and IMP-8 data,","authors":[],"date":"1999","doi":"10.1007\/s00585-999-1306-8","raw":"Khan, H., and S. W. H. Cowley (1999), Observations of the response time of high-latitude ionospheric convection to variations in the interplanetary magnetic field using EISCAT and IMP-8 data, Ann. Geophys., 17, 1306–1335.","cites":null},{"id":16376280,"title":"On the prediction of auroral radio absorption on the equatorial side of the absorption zone,","authors":[],"date":"1987","doi":"10.1016\/0021-9169(87)90061-4","raw":"Hargreaves, J. K., M. T. Feeney, H. Ranta, and A. Ranta (1987), On the prediction of auroral radio absorption on the equatorial side of the absorption zone, J. Atmos. Terr. Phys., 49, 259–272.","cites":null},{"id":16376271,"title":"On the variation of auroral radio absorption with geomagnetic activity,","authors":[],"date":"1966","doi":"10.1016\/0032-0633(66)90136-x","raw":"Hargreaves, J. K. (1966), On the variation of auroral radio absorption with geomagnetic activity, Planet. Space Sci., 14, 991–1006.","cites":null},{"id":16376250,"title":"Quadruple conjugate pair observations of the sudden commencement absorption event on","authors":[],"date":"1972","doi":"10.1029\/ja077i028p05602","raw":"Brown, R. R., H. Leinbach, S.-I. Akasofu, V. M. Driatsky, and R. J. Schmidt (1972), Quadruple conjugate pair observations of the sudden commencement absorption event on June 17, 1965, J. Geophys. Res., 77, 5602–5607.","cites":null},{"id":16376317,"title":"Solar Wind Electron Proton Alpha Monitor (SWEPAM) for the Advanced Composition Explorer, Space Sci.","authors":[],"date":"1998","doi":"10.1007\/978-94-011-4762-0_20","raw":"McComas, D. J., S. J. Bame, P. Barker, W. C. Feldman, J. L. Phillips, P. Riley, and J. W. Griffee (1998), Solar Wind Electron Proton Alpha Monitor (SWEPAM) for the Advanced Composition Explorer, Space Sci. Rev., 86, 563–612.","cites":null},{"id":16376333,"title":"Sources of geomagnetic activity over the solar cycle: Relative importance of coronal mass ejections, high-speed streams, and slow solar wind,","authors":[],"date":"2000","doi":"10.1029\/1999ja000400","raw":"Richardson, I. G., E. W. Cliver, and H. V. Cane (2000), Sources of geomagnetic activity over the solar cycle: Relative importance of coronal mass ejections, high-speed streams, and slow solar wind, J. Geophys. Res., 105, 18,203–18,213.","cites":null},{"id":16376335,"title":"Sources of geomagnetic storms for solar minimum and maximum conditions during 1972–2000,","authors":[],"date":"2001","doi":"10.1029\/2001gl013052","raw":"Richardson, I. G., E. W. Cliver, and H. V. Cane (2001), Sources of geomagnetic storms for solar minimum and maximum conditions during 1972–2000, Geophys. Res. Lett., 28, 2567–2572.","cites":null},{"id":16376276,"title":"Studies of auroral absorption events at three magnetic latitudes - I. Occurrence and statistical properties of events,","authors":[],"date":"1967","doi":"10.1016\/0032-0633(67)90090-6","raw":"Hargreaves, J. K., and F. C. Cowley (1967), Studies of auroral absorption events at three magnetic latitudes - I. Occurrence and statistical properties of events, Planet. Space Sci., 5, 1571–1583.","cites":null},{"id":16376247,"title":"The ‘‘calm before the storm’’ in CIR\/magnetosphere interactions: Occurrence statistics, solar wind statistics, and magnetospheric preconditioning,","authors":[],"date":"2006","doi":"10.1029\/2005ja011397","raw":"Borovsky, J. E., and J. T. Steinberg (2006), The ‘‘calm before the storm’’ in CIR\/magnetosphere interactions: Occurrence statistics, solar wind statistics, and magnetospheric preconditioning, J. Geophys. Res., 111, A07S10, doi:10.1029\/2005JA011397.","cites":null},{"id":16376314,"title":"The 10th generation international geomagnetic reference field,","authors":[],"date":"2005","doi":"10.1029\/2005eo160006","raw":"Maus, S., et al. (2005), The 10th generation international geomagnetic reference field, Phys. Earth Planet. Inter., 151, 320–322.","cites":null},{"id":16376339,"title":"The ACE magnetic fields experiment,","authors":[],"date":"1998","doi":"10.1007\/978-94-011-4762-0_21","raw":"Smith, C. W., J. L’Heureux, N. F. Ness, M. H. Acun ˜a, L. F. Burlaga, and J. Scheifele (1998), The ACE magnetic fields experiment, Space Sci. Rev., 86, 613–632.","cites":null},{"id":16376279,"title":"The development of the substorm in auroral radio absorption,","authors":[],"date":"1975","doi":"10.1016\/0032-0633(75)90177-4","raw":"Hargreaves, J. K., H. J. A. Chivers, and W. J. Axford (1975), The development of the substorm in auroral radio absorption, Planet. Space Sci., 23, 905–911.","cites":null},{"id":16376311,"title":"The driving mechanisms of particle precipitation during the moderate geomagnetic storm of 7","authors":[],"date":"2007","doi":"10.5194\/angeo-25-2053-2007","raw":"Longden, N., F. Honary, A. J. Kavanagh, and J. Manninen (2007), The driving mechanisms of particle precipitation during the moderate geomagnetic storm of 7 January 2005, Ann. Geophys., 25, 2053–2068.","cites":null},{"id":16376244,"title":"The three-hour-range index measuring geomagnetic activity,","authors":[],"date":"1939","doi":"10.1029\/te044i004p00411","raw":"Bartels, J., N. H. Heck, and H. F. Johnston (1939), The three-hour-range index measuring geomagnetic activity, Terr. Magn. Atmos. Electr., 44,411–454.","cites":null},{"id":16376328,"title":"Theory on the precipitation of magnetospheric electrons at the time of sudden commencement,","authors":[],"date":"1972","doi":"10.1029\/ja077i001p00101","raw":"Perona, G. E. (1972), Theory on the precipitation of magnetospheric electrons at the time of sudden commencement, J. Geophys. Res., 77, 101–111.","cites":null},{"id":16376303,"title":"Two step development of geomagnetic storms,","authors":[],"date":"1998","doi":"10.1029\/97ja03337","raw":"Kamide, Y., N. Yokoyama, W. Gonzalez, B. T. Tsurutani, I. A. Daglis, A. Brekke, and S. Masuda (1998), Two step development of geomagnetic storms, J. Geophys. Res., 103, 6917–6921.","cites":null},{"id":16376261,"title":"What is a geomagnetic storm?,","authors":[],"date":"1994","doi":"10.1029\/93ja02867","raw":"Gonzalez, W., J. A. Joselyn, Y. Kamide, H. W. Kroehl, G. Rostoker, B. T. Tsurutani, and V. M. Vasyliunas (1994), What is a geomagnetic storm?, J. Geophys. Res., 99, 5771–5792.","cites":null},{"id":16376350,"title":"Why Kp is such a good measure of magnetospheric convection,","authors":[],"date":"2004","doi":"10.1029\/2004sw000089","raw":"Thomsen, M. F. (2004), Why Kp is such a good measure of magnetospheric convection, Space Weather, 2, S11004, doi:10.1029\/2004SW000089.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-06-05","abstract":"Interplanetary coronal mass ejections (ICME) and corotating interaction regions (CIR) alter the parameters of the solar wind and interplanetary magnetic field (IMF) that affect conditions in the Earth's magnetosphere and particle precipitation in the auroral zone. We perform a superposed epoch study of the effects of ICME-dominated and CIR-dominated solar wind on particle precipitation during geomagnetic storms. We use data from a set of 38 CIR events and 33 ICME events. Particle precipitation is inferred from cosmic noise absorption (CNA) recorded by the riometer at Abisko. The electron flux intensity at geosynchronous orbit close to the location of the riometer is taken from the synchronous orbit particle analyzer (SOPA) onboard the Los Alamos National Laboratory (LANL) satellite LANL-01A. The results show that mean CNA is more intense during the main phase of ICME-driven storms. In contrast, mean CNA remains elevated for a much longer period during CIR-driven storms indicating prolonged periods of particle precipitation. Enhanced CNA over a sustained period of time is observed during CIR-driven storms that are categorized as only weak or moderate in terms of the response that they drive in the Dst index (Dst >−100 nT). This result indicates that events which may be considered geomagnetically ineffective have a significant effect on particle precipitation in the auroral zone. The elevated CNA observed during CIR-driven storms is accompanied by elevated electron flux intensity, measured at geosynchronous orbit, over all channels in the 50–500 keV range at all local times","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70933.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/9388\/1\/art_894.pdf","pdfHashValue":"dd06d02bfd0034eaf8ab49b2d8ca1583bb8c45a0","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:9388<\/identifier><datestamp>\n      2018-01-24T03:21:38Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5141:51413735<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Particle precipitation during ICME-driven and CIR-driven geomagnetic storms<\/dc:title><dc:creator>\n        Longden, N.<\/dc:creator><dc:creator>\n        Denton, Michael H.<\/dc:creator><dc:creator>\n        Honary, Farideh<\/dc:creator><dc:subject>\n        QA75 Electronic computers. Computer science<\/dc:subject><dc:description>\n        Interplanetary coronal mass ejections (ICME) and corotating interaction regions (CIR) alter the parameters of the solar wind and interplanetary magnetic field (IMF) that affect conditions in the Earth's magnetosphere and particle precipitation in the auroral zone. We perform a superposed epoch study of the effects of ICME-dominated and CIR-dominated solar wind on particle precipitation during geomagnetic storms. We use data from a set of 38 CIR events and 33 ICME events. Particle precipitation is inferred from cosmic noise absorption (CNA) recorded by the riometer at Abisko. The electron flux intensity at geosynchronous orbit close to the location of the riometer is taken from the synchronous orbit particle analyzer (SOPA) onboard the Los Alamos National Laboratory (LANL) satellite LANL-01A. The results show that mean CNA is more intense during the main phase of ICME-driven storms. In contrast, mean CNA remains elevated for a much longer period during CIR-driven storms indicating prolonged periods of particle precipitation. Enhanced CNA over a sustained period of time is observed during CIR-driven storms that are categorized as only weak or moderate in terms of the response that they drive in the Dst index (Dst >−100 nT). This result indicates that events which may be considered geomagnetically ineffective have a significant effect on particle precipitation in the auroral zone. The elevated CNA observed during CIR-driven storms is accompanied by elevated electron flux intensity, measured at geosynchronous orbit, over all channels in the 50–500 keV range at all local times.<\/dc:description><dc:date>\n        2008-06-05<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/9388\/1\/art_894.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1029\/2007JA012752<\/dc:relation><dc:identifier>\n        Longden, N. and Denton, Michael H. and Honary, Farideh (2008) Particle precipitation during ICME-driven and CIR-driven geomagnetic storms. Journal of Geophysical Research, 113 (A06205). pp. 1-12. ISSN 0148-0227<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/9388\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1029\/2007JA012752","http:\/\/eprints.lancs.ac.uk\/9388\/"],"year":2008,"topics":["QA75 Electronic computers. Computer science"],"subject":["Journal Article","PeerReviewed"],"fullText":"Particle precipitation during ICME-driven and CIR-driven\ngeomagnetic storms\nN. Longden,1 M. H. Denton,1 and F. Honary1\nReceived 24 August 2007; revised 23 November 2007; accepted 28 January 2008; published 5 June 2008.\n[1] Interplanetary coronal mass ejections (ICME) and corotating interaction regions (CIR)\nalter the parameters of the solar wind and interplanetary magnetic field (IMF) that\naffect conditions in the Earth’s magnetosphere and particle precipitation in the auroral\nzone. We perform a superposed epoch study of the effects of ICME-dominated and\nCIR-dominated solar wind on particle precipitation during geomagnetic storms. We use\ndata from a set of 38 CIR events and 33 ICME events. Particle precipitation is\ninferred from cosmic noise absorption (CNA) recorded by the riometer at Abisko. The\nelectron flux intensity at geosynchronous orbit close to the location of the riometer is\ntaken from the synchronous orbit particle analyzer (SOPA) onboard the Los Alamos\nNational Laboratory (LANL) satellite LANL-01A. The results show that mean CNA is\nmore intense during the main phase of ICME-driven storms. In contrast, mean CNA\nremains elevated for a much longer period during CIR-driven storms indicating\nprolonged periods of particle precipitation. Enhanced CNA over a sustained period of time\nis observed during CIR-driven storms that are categorized as only weak or moderate\nin terms of the response that they drive in the Dst index (Dst >\u0001100 nT). This result\nindicates that events which may be considered geomagnetically ineffective have a\nsignificant effect on particle precipitation in the auroral zone. The elevated CNA\nobserved during CIR-driven storms is accompanied by elevated electron flux intensity,\nmeasured at geosynchronous orbit, over all channels in the 50–500 keV range at all\nlocal times.\nCitation: Longden, N., M. H. Denton, and F. Honary (2008), Particle precipitation during ICME-driven and CIR-driven geomagnetic\nstorms, J. Geophys. Res., 113, A06205, doi:10.1029\/2007JA012752.\n1. Introduction\n[2] Interaction between the solar wind and the Earth’s\nmagnetosphere can cause disturbances in the geomagnetic\nfield. The solar wind parameters that affect the level of\ngeomagnetic activity are the solar wind velocity (v) and the\nsouthward oriented component of the interplanetary mag-\nnetic field (IMF) in GSM coordinates (Bs) [e.g., Gonzalez\nand Tsurutani, 1987; Gosling et al., 1991; Gonzalez et al.,\n1999; Borovsky and Denton, 2006; Tsurutani et al., 2006,\nand references therein].\n[3] Two solar wind structures have been identified as the\nimportant drivers of geomagnetic storms; interplanetary\ncoronal mass ejections (ICME) and corotating interaction\nregions (CIR) [e.g., Richardson et al., 2000].\n[4] ICMEs are the interplanetary (IP) counterpart of\nmassive eruptions of magnetized solar plasma. Typically,\nan ICME is composed of an interplanetary shock wave, a\nsheath region of compressed solar wind and an ejecta [e.g.,\nGopalswamy, 2003]. The configuration of the magnetic\nfield in the sheath and the ejecta can lead to enhanced Bs.\nAlmost all shocks observed at 1 astronomical unit (AU) are\nassociated with an ICME [Sheeley et al., 1985], a feature\nshown to enhance geomagnetic effects [Gosling et al.,\n1991]. However, not all ICMEs are sufficiently fast to drive\na shock [Gosling et al., 1991]. In this paper, geomagnetic\nstorms driven by any combination of an ICME shock,\nsheath or ejecta are termed ICME driven storms.\n[5] CIRs are regions of compressed magnetic field and\nplasma that result from interaction between high-speed and\nslow-speed solar wind streams [e.g., Tsurutani et al., 1995,\n2006]. The fast-solar wind streams typically have speeds of\n\u0002750 to 800 kms\u00011, and emanate from coronal holes,\nwhereas slow-speed streams typically have speeds of\n\u0002300 to 400 kms\u00011, and originate from the streamer belt\nregion [e.g., Tsurutani et al., 2006]. As coronal holes can\npersist for longer than the rotation period of the Sun, the\nhigh-speed streams may reoccur with a frequency of \u000227\ndays. The term CIR is applied to the interaction region and\nthe period of high solar wind speed which follows each\ninteraction region in this paper.\n[6] The likelihood of the solar wind being dominated by\neither an ICME or CIR structure is dependent on the level\nof solar activity [e.g., Tsurutani et al., 1995; Gonzalez et\nal., 1999; Richardson et al., 2000, 2001]. CIRs usually\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 113, A06205, doi:10.1029\/2007JA012752, 2008\nClick\nHere\nfor\nFull\nArticle\n1Department of Communication Systems, Lancaster University,\nLancaster, UK.\nCopyright 2008 by the American Geophysical Union.\n0148-0227\/08\/2007JA012752$09.00\nA06205 1 of 12\noccur during the declining phase of solar activity. ICMEs\noccur throughout the entire solar cycle but are more frequent\nin the period around solar maximum [e.g., St. Cyr et al.,\n2000].\n[7] Features of geomagnetic storms have been observed\nto exhibit different characteristics dependent on the solar\nwind driver [e.g., Tsurutani et al., 2006; Borovsky and\nDenton, 2006; Denton et al., 2006]. CIR-driven storms\nare more likely to occur following an extended period of\ngeomagnetic calm than ICME-driven storms [Borovsky and\nDenton, 2006, and references therein] where a period of\ncalm is defined as Kp \u0003 1+ over one to two days. Borovsky\nand Denton [2006] have shown that ICMEs have a greater\ninfluence over the ring current than CIRs while CIRs have\nthe greater influence over magnetospheric convection,\nwhich can measured using the Kp index [Bartels et al.,\n1939; Thomsen, 2004]. The density and temperature of\nparticles at geosynchronous orbit also exhibit different\nprofiles during storms depending on the solar wind driver\n[Denton et al., 2006].\n[8] One manifestation of geomagnetic activity is the\nprecipitation of particles trapped in the magnetosphere into\nthe ionosphere in the auroral zone. Variation of ionospheric\ncharacteristics can have implications for High Frequency\n(HF) communication [e.g., Kavanagh et al., 2004]. Precip-\nitation of energetic electrons (E > 30 keV) in the D-region\nof the ionosphere can be inferred through measurement of\nthe level of absorption of cosmic radio noise (CNA)\nduring propagation through the ionosphere by ground-\nbased riometers.\n[9] The passage of geomagnetically effective ICMEs and\nCIRs can provide a number of driving mechanisms for\nenhanced electron precipitation [e.g., Longden et al., 2007].\nSubstorms, a feature common to all geomagnetic storms\n[e.g., Gonzalez et al., 1994] are known to drive precipitation\n[e.g., Hargreaves et al., 1975; Ranta et al., 1981]. This\nprecipitation is linked to the injection of particles at the time\nof substorm onset, with CNA observed around local mid-\nnight at the time of the initial injection and CNA observed\nin the local morning as the injected particles drift and\nharden [e.g., Stauning, 1996]. Precipitation can also be\ncaused by rapid compression of the magnetosphere resulting\nfrom changes in the incident solar wind pressure (Pdyn)\n[Brown et al., 1961, 1972; Brown and Driatsky, 1973;\nPerona, 1972]. Changes in Pdyn can be driven by solar\nwind features such as IP shocks and regions of high density.\nKavanagh et al. [2004] have shown that CNA is dependent\non the same solar wind parameters as geomagnetic activity,\nnamely v and Bs. CNA has been observed to reoccur with a\n27 day period during the declining phase of solar activity\n[Hultqvist, 1966 and references therein] implying a link\nbetween CIR activity and CNA.\n[10] The aim of the current study is to compare the\nmagnetospheric response in terms of electron precipitation\nduring ICME-driven and CIR-driven storms. We perform a\nsuperposed epoch analysis on riometer data during 33\nICME-driven and 38 CIR-driven storms. A broad correla-\ntion has previously been shown between energetic electron\nflux at geosynchronous orbit and CNA during substorms\n[e.g., Parks et al., 1968; Baker et al., 1981] and riometer\nmeasurements have been used to identify substorm activity\n[Spanswick et al., 2007]. We use electron flux intensity data\nfrom the synchronous orbit particle analyzer (SOPA) instru-\nment [Belian et al., 1992] onboard one of the Los Alamos\nNational Laboratory (LANL) satellites at geosynchronous\norbit to enable investigation of the relationship between this\nand CNA throughout the development of a storm.\n2. Instrumentation\n[11] Energetic electron precipitation is inferred from CNA\ndata from the widebeam riometer located at Abisko, Sweden\n(68.40\u0001N, 18.90\u0001E geographic). This riometer operates at\n30 MHz and is part of the chain of riometers operated by the\nSodankyla¨ Geophysical Observatory (SGO). Between 2000\nand 2006, the riometer at Abisko mapped to an L shell of\n\u00025.81 to \u00025.85 and had a magnetic latitude in the range\n\u000265.30\u0001N to \u000265.37\u0001N. Magnetic latitudes are given the\nCorrected Geomagnetic (CGM) coordinate system using the\nInternational Geomagnetic Reference Field (IGRF) model\n[e.g., Maus et al., 2005].\n[12] Electron flux intensity data are taken from the SOPA\ninstrument onboard the LANL-01A satellite located in\ngeosynchronous orbit. LANL-01A was located at a geo-\ngraphic longitude between 7.6\u0001E and 9\u0001E during these\nevents and ostensibly maps to an L shell of 6.6. During\n2000 to 2006, the footprint of a geomagnetic field line\nmapped from the equator at 6.6 RE at the longitude of the\nLANL-01A satellite using the Tsyganenko 89C model\n[Tsyganenko, 1995] was around 67\u0001N. The SOPA instru-\nment records electrons with energies in the range 50 keV to\n\u0002 26 MeV over 16 energy channels.\n[13] Observations of the solar wind conditions at the L1\npoint during the events are taken from the magnetic fields\nexperiment (MAG) instrument [Smith et al., 1998] and the\nSolar Wind Electron Proton Alpha Monitor (SWEPAM)\ninstrument [McComas et al., 1998] onboard the Advanced\nComposition Explorer (ACE) satellite. The parameters\nselected to indicate solar wind conditions were vx and Bz\n(GSM), due to their influence on the strength of the\ninterplanetary convective field, and vy (a measure of the\neast-west velocity of the solar wind. A change from west-\nerly direction (\u0001) to an easterly direction (+) is a typical\nsignature of a CIR event.\n3. Data Analysis\n3.1. Event Selection\n[14] Candidate ICME events were initially selected from\nthe list of ICMEs compiled by Cane and Richardson\n[2003]. This list covers the period from 1996 to 2002. Data\nare available from the LANL-01A satellite from October\n2000 and events occurring before this time were not used in\nthis study. Additional ICME events occurring between 2002\nand 2006 were identified from solar wind plasma and IMF\ndata. Candidate CIR events were selected from the list used\nby Denton et al. [2006], covering the period of 1993 to\n2005. These events were selected from a list of east\/west\ndeflections in the solar wind [R. McPherron, private com-\nmunication], with additions based on direct examination of\nsolar wind data. Again, events occurring prior to the\ncoverage of LANL-01A were discarded. ICME and CIR\nevents were also discarded when there was incomplete data\nA06205 LONGDEN ET AL.: ICME- AND CIR-DRIVEN PRECIPITATION\n2 of 12\nA06205\ncoverage during the event, when a subsequent event was\nobserved within 72 h of the time of the onset of the initial\nevent or when no clear minimum in the Dst index was\nobserved following the onset of the event. Applying these\ncriteria resulted in a set of 33 ICME events from 2000 to\n2006 and a set of 38 CIR events from 2003 to 2005 for\nanalysis. The prehistory of the solar wind or background\nconditions in the magnetosphere were not considered.\n3.2. Epoch Analysis\n[15] In this study, geomagnetic activity is inferred from\nthree indices; Dst, Kp and SYM-H. Dst is considered to be a\nmeasure of intensity of the ring current [e.g., Grafe, 1999,\nand references therein] and can be used to categorize storm\nintensity [e.g., Gonzalez et al., 1994]. The Kp index can\nalso be used to categorize storm intensity [e.g., Gosling et\nal., 1991] and is a proxy for the strength of magnetospheric\nconvection. The SYM-H index is a similar measure to the\nDst index but has a 1 min resolution [e.g., Wanliss and\nShowalter, 2006]. The higher resolution means that the\nSYM-H index can be used to investigate geomagnetic\nactivity on a smaller temporal scale, such as sudden\nimpulses (SI) [e.g., Takeuchi et al., 2002].\n[16] For each event, the Dst index was inspected to\nidentify the first clear minimum value following the arrival\nof the solar wind structure at the magnetosphere. The time\nof arrival can be estimated from the solar wind speed and\nthe time of initial observation by the ACE satellite [e.g.,\nKhan and Cowley, 1999] and is typically of the order of\nan hour for ICME and CIR events. Following Denton et al.\n[2006] the first minimum in Dst was used as the zero\nepoch for the event. Data were taken from 24 h prior to\nand 72 h following the zero epoch to cover the period from\nstorm onset through to recovery. Storm intensity was deter-\nmined from the lowest value of Dst observed throughout the\nduration of the storm. Table 1 shows a summary the number\nof storms at each intensity level according to driving struc-\nture. As storms may experience growth in more than one\nphase [e.g.,Kamide et al., 1998], the time of zero epoch is not\nnecessarily the time of minimum Dst. SOPA data with a\ntemporal resolution of 10 s and ACE data with a temporal\nresolution of 64 s were used. Linear interpolation was applied\nto the SOPA and ACE data to ensure consistent timing for\nthese data sets between events.\n[17] We have performed the analysis using data from\nstorms of all intensities and then from storms of weak to\nmoderate intensity only, to enable comparison of precipita-\ntion due to the solar wind driver during similar storm\nconditions.\n[18] Mean values as a function of epoch time were\ncalculated at the sampling rate for each data set for particle\nprecipitation, solar wind parameters and geomagnetic indi-\nces. An estimate for solar wind Pdyn was obtained from the\nproton number density and solar wind velocity data from\nthe ACE satellite.\n4. Results\n[19] The results of the superposed epoch analysis are\nshown in Figures 1 and 2. Figure 1 shows the results of\nthe study when data during storms of all intensities are\nconsidered and Figure 2 shows the results for storms of\nweak and moderate intensity only. In both figures, the\npanels show, from top to bottom, the mean electron flux\nintensity of 50–75 keV electrons from the LANL-01A\nsatellite, mean absorption from the Abisko riometer, mean\nvx, mean vy and mean IMF Bz from the ACE satellite, mean\nPdyn calculated from ACE data, and mean SYM-H, Kp and\nDst indices as a function of epoch time. A dashed line\nindicating a value of zero is shown for vy and Bz to highlight\nzero crossings. Figures 3 and 4 show the mean data from the\nepoch analysis study for CIR-driven and ICME-driven\nstorms of all intensities respectively with ±1 standard devi-\nation indicated by the dashed lines.\n[20] From Figure 1b, mean CNA from the Abisko riom-\neter during ICME-driven storms of all intensities shows an\nincrease from \u000210 h prior to the zero epoch. Two clear\npeaks are also evident in this data; the first \u00021 h prior to the\nzero epoch and the second \u00025 h following the zero epoch.\nFollowing the second peak, mean CNA is observed to decay\nto levels below that observed prior to the zero epoch. Mean\nCNA during CIR-driven storms also shows an increase from\n\u000210 h prior to the zero epoch. This CNA increases\ngradually and then remains elevated throughout the period\nof the study following the zero epoch.\n[21] From Figure 4b, it can be seen that the standard\ndeviation in the magnitude of CNA in ICME events\ndecreases \u000214 h after the zero epoch, around the time that\nthe mean value is seen to decrease. This is consistent with\nless intense precipitation at this time as the mean value of\nCNA and the deviation of intensities away from this mean\nare both reduced. The standard deviation in CNA during\nCIR events (Figure 3b) does not show a marked decrease at\na given time in the development of the storm, also consis-\ntent with enhanced precipitation following the zero epoch.\n[22] The most intense CNA is observed when ICMEs are\nthe dominant structure in the solar wind. However, CNA\nrelated to the passage of a CIR exceeds that related to\nICMEs over a sustained period of time. As a result of the\nsustained enhancement of CNA, total mean absorption\nduring CIR-driven storms slightly exceeds total mean ab-\nsorption during ICME-driven storms over the four day\nperiod of the study.\n[23] When mean CNA during weak and moderate storms\nonly is considered (Figure 2b), the profile during CIR\nevents is largely unchanged. This is unsurprising as only\n1 of the 38 events did not generate storms of these\nintensities. However, the 19 ICMEs that drove a weak or\nmoderate storm produced mean CNA somewhat different to\nthat observed during ICME-driven storms of all intensities.\nMean CNA is lower in magnitude during the lower intensity\nstorms throughout the period of the study. Two peaks\naround 2 h prior to and 5 h following the zero epoch can\nstill be identified but numerous additional peaks of equal\nTable 1. Frequency of Occurrence of Storm Intensity by Solar\nWind Driver\nStorm\nIntensity Range of D^st\nCIR\nEvents\nICME\nEvents\nWeak D^st > \u000150 nT 22 10\nModerate \u000150 \u0004 D^st > \u0001100 nT 15 9\nIntense \u0001100 \u0004 D^st > \u0001240 nT 1 12\nSuper D^st \u0003 \u0001240 nT 0 2\nA06205 LONGDEN ET AL.: ICME- AND CIR-DRIVEN PRECIPITATION\n3 of 12\nA06205\nmagnitude can be observed at other times in the study. Also,\nthe peak intensity of CNA during ICME-dominant solar\nwind is of similar magnitude to the peak CNA during CIR-\ndominant solar wind.\n[24] CIRs have a consistent structure; slow solar wind is\nfollowed by an interaction region which is then followed by\na period of fast solar wind. These results highlight the fact\nthat typical CIR-Earth interactions are similar in nature. In\ncontrast, ICME-Earth interactions are all very different in\nnature since they depend on the size, structure, density etc.\nof the associated solar wind structure.\n[25] The general trend in mean 50–75 keV electron flux\nintensity closely follows the trend in mean absorption at\nAbisko during CIR-driven storms. Mean 50–75 keV elec-\nFigure 1. Superposed epoch time series of data for the set of 38 CIR-driven storms and 33 ICME-driven\nstorms. From (a) to (i), the panels showmean electron flux intensity for electrons with energies in the range\n50–75 keV from the LANL-01A satellite, mean CNA from the Abisko riometer, mean solar wind velocity\nin the X and Y direction (GSM), mean IMF Bz (GSM), mean solar wind Pdyn, mean SYM-H, mean Kp and\nmean Dst. The zero epoch is the time of the first clear minimum in Dst for each event.\nA06205 LONGDEN ET AL.: ICME- AND CIR-DRIVEN PRECIPITATION\n4 of 12\nA06205\ntron flux intensity is initially low, gradually rising prior to\nthe zero epoch and remaining high throughout the rest of the\nperiod of the study. The similarity is less pronounced during\nICME-driven storms although is still somewhat elevated.\nHowever, when storms are considered individually, the\nsignificant correlation between CNA and 50–75 keV elec-\ntron flux intensity ranges from highly correlated (r > 0.8) to\nuncorrelated (r \u0005 0) over the four day period for both CIR-\nand ICME-driven storms. It should be noted that geomag-\nnetic activity can alter the mapping of equatorial field lines\n[e.g., Tsyganenko, 1995], affecting the spatial separation\nbetween the riometer at Abisko and the LANL-01A satellite\nFigure 2. Superposed epoch time series of data for the set of 37 CIR-driven storms and 19 ICME-driven\nstorms of weak and moderate intensity (Dst >\u0001100 nT). From (a) to (i), the panels show mean electron\nflux intensity for electrons with energies in the range 50–75 keV from the LANL-01A satellite, mean\nCNA from the Abisko riometer, mean solar wind velocity in the X and Y direction (GSM), mean IMF\nBz (GSM), mean solar wind Pdyn, mean SYM-H, mean Kp and mean Dst. The zero epoch is the time of\nthe first clear minimum in Dst for each event.\nA06205 LONGDEN ET AL.: ICME- AND CIR-DRIVEN PRECIPITATION\n5 of 12\nA06205\nFigure 3. Superposed epoch time series of data for the set of 38 CIR-driven storms. ±1 Standard\ndeviation from the mean is indicated for each data set. From (a) to (i), the panels show mean electron flux\nintensity for electrons with energies in the range 50–75 keV from the LANL-01A satellite, mean CNA\nfrom the Abisko riometer, mean solar wind velocity in the X and Y direction (GSM), mean IMF Bz\n(GSM), mean solar wind Pdyn, mean SYM-H, mean Kp and mean Dst. The zero epoch is the time of the\nfirst clear minimum in Dst for each event.\nA06205 LONGDEN ET AL.: ICME- AND CIR-DRIVEN PRECIPITATION\n6 of 12\nA06205\nFigure 4. Superposed epoch time series of data for the set of 33 ICME-driven storms. ±1 Standard\ndeviation from the mean is indicated for each data set. From (a) to (i), the panels show mean electron flux\nintensity for electrons with energies in the range 50–75 keV from the LANL-01A satellite, mean CNA\nfrom the Abisko riometer, mean solar wind velocity in the X and Y direction (GSM), mean IMF Bz\n(GSM), mean solar wind Pdyn, mean SYM-H, mean Kp and mean Dst. The zero epoch is the time of the\nfirst clear minimum in Dst for each event.\nA06205 LONGDEN ET AL.: ICME- AND CIR-DRIVEN PRECIPITATION\n7 of 12\nA06205\nin terms of the geomagnetic field. It is possible that during\ngeomagnetic storms the separation between the instruments\nexceeds the spatial extent of precipitation events.\n[26] Figure 5 shows mean CNA at Abisko and mean\nelectron flux intensity for electrons with energies in the\nrange 50–500 keV at LANL-01A during CIR- and ICME-\ndriven storms. Mean electron flux intensity in the higher\nenergy channels show a similar to profile to that of the 50–\n75 keV channel during CIR-driven storms; relatively low\nflux intensity at the start of the epoch period followed by a\ngradual increase with the onset of activity and sustained\nelevation. However, the time of onset of the increase in\nelectron flux intensity is dependent on the energy of the\nelectrons, with higher energy channels showing an increase\nat a later time than the lower energy channels. The electron\nflux intensity profile shows lower mean flux intensity across\nall channels in the 50–500 keV band prior to the onset of\nCIR-driven storms than prior to ICME-driven storm. The\nsignature of flux dropout is evident around the time of the\nzero epoch for storms driven by both structures. Flux\ndropouts at geosynchronous orbit have been linked to the\ngrowth phase of large geomagnetic substorms or storms\naltering the configuration of the magnetotail [Moldwin et\nal., 1995]. The mean electron flux intensity during ICME-\ndriven storms returns largely to pre-storm levels 1 to 2 days\nafter the zero epoch. The mean flux intensity remains\nelevated during CIR-driven storms, not returning to pre-\nstorm levels before the end of the epoch period (3 days).\nThe elevation of electron flux intensity is clear in all of the\nenergy channels shown.\n[27] Typical signatures of solar wind structures can be seen\nin the trends in the solar wind data used in the superposed\nepoch study. The mean solar wind vx (Figure 1c) steadily\nincreases from a slow speed (\u0002400 kms\u00011) to higher speeds\n(\u0002700 kms\u00011) during CIR events. A rapid elevation in vx\ncan be seen during ICME-dominated solar wind periods\njust prior to the time of zero epoch, followed by a gradual\nreturn to ambient speeds. When compared to the mean\nsolar wind velocity observed during weak and moderate\nICME-driven geomagnetic storms (Figure 2c), the rapid\nincrease around the zero epoch is not evident. This could\nbe an indicator of IP shock activity associated with the\nmore intense ICME-driven storms. Mean vy (Figure 1d) is\naround 0 kms\u00011 during ICME-dominated solar wind. A\nwest to east rotation is evident during CIR-dominated solar\nwind.\n[28] The mean IMF Bz (Figure 1e) is approximately 0 nT\nduring both ICME-driven and CIR-driven storms at all\nFigure 5. Superposed epoch time series of mean CNA at Abisko and mean geosynchronous electron\nflux intensity for electrons with energies in the range of 50–500 keV from the LANL-01A satellite.\nPanels (a) and (b) show the data from the set of 38 CIR-driven storms. Panels (c) and (d) show the data\nfrom the set of 33 ICME-driven storms. The zero epoch is the time of the first clear minimum in Dst for\neach event.\nA06205 LONGDEN ET AL.: ICME- AND CIR-DRIVEN PRECIPITATION\n8 of 12\nA06205\ntimes throughout the epoch study except immediately prior\nto the zero epoch, when a period of southward orientation is\nclear. The magnitude of the southward component for\nICME-dominated solar wind is greater than for CIR-dom-\ninated solar wind during storms of all intensities, implying a\ngreater rate of reconnection between the IMF and the\nmagnetosphere under ICME conditions. When periods of\nweak and moderate storm activity only are considered\n(Figure 2e), the southward component has an equal magni-\ntude for both solar wind structures allowing more meaning-\nful comparisons to be made.\n[29] Peaks in mean Pdyn during ICME-dominated solar\nwind are clear 2 to 3 h prior to the zero epoch and 1 to\n2 h following the zero epoch. The initial peak occurs at the\ntime of southward IMF. When storms of weak and moderate\nintensity only are considered (Figure 2f), the peaks in mean\nPdyn become much less pronounced. During CIR-dominated\nsolar wind, mean Pdyn shows a gradual increase prior to the\nzero epoch, around the time of the west to east rotation of the\nsolar wind.\n[30] The profiles in the mean Dst index (Figure 1f) and\nthe mean Kp index (Figure 1g) are as expected since ICME-\ndriven storms, on average, have a more intense signature in\nDst but also show more rapid recovery. CIR-driven storms\nare less intense in terms of Dst and there is no real trend\ntoward recovery within the subsequent 3 days. Peak mean\nKp is greater for ICME-driven storms but mean Kp remains\nelevated over a longer period of time during CIR-driven\nstorms, implying a longer period of magnetospheric con-\nvection [e.g., Denton et al., 2006].\n[31] Table 2 lists a summary of some of the descriptive\nstatistics of the parameters used in this study during CIR-\ndominant and ICME-dominant solar wind. These parame-\nters are taken from the data from the early phase of the\nstorm (from \u00011 day to +1\/2 day of the four day period) and\nfrom the later phase (from +1\/2 day to +3 days of the four\nday period) from the 38 CIR-driven storms and the 33\nICME-driven storms used for the epoch study. From Table 2,\nit can be seen that the most extreme values of the parameters,\nincluding CNA, vx and southward Bz, were observedwhen an\nICME was the dominant structure in the solar wind and the\nmost intense geomagnetic response, in both Dst and Kp, was\ndriven by an ICME. The average values of these parameters\nin the early phase were greater during ICME-driven storms\nand greater range and variation in most parameters is also\nobserved for ICME-driven storms compared to CIR-driven\nstorms. However, in the later phase of the storms the average\nvalues of CNA, vx and Kp are greater when CIRs are the\ndriver of the activity. This demonstrates the persistence of\nactivity following the onset of the storm due to the high-speed\nsolar wind stream following the CIR. The persistence of\nactivity is such that when data from the entire four day period\nof the epoch study is considered, average CNA during CIR-\ndriven storms (\u00020.60 dB) slightly exceeds that observed\nduring ICME-driven storms (\u00020.59 dB).\n5. Discussion\n[32] Solar wind and IMF conditions have a significant\nrole in the occurrence and strength of auroral zone particle\nprecipitation [e.g., Kavanagh et al., 2004]. Solar wind\nparameters that have been linked to driving mechanisms\nof precipitation include velocity, southward oriented IMF\n[e.g., Kavanagh et al., 2004] and dynamic pressure [Brown\net al., 1961]. In addition to a driving mechanism, a\nsufficient population of electrons is required for precipita-\ntion to occur [e.g., Kavanagh et al., 2004]. A number of\nmodels predict the occurrence of CNA from the Kp index\n[e.g., Foppiano and Bradley, 1984, 1985; Hargreaves,\n1966; Kavanagh et al., 2004]. Osepian and Kirkwood\n[2004] found a different response in CNA driven by IP\nshocks based on the background level of Kp prior to the\narrival of the shock.\n[33] The profile of mean CNA at the Abisko riometer\nduring the events selected for the study show that the\npassage of the solar wind structures drives enhanced ener-\ngetic electron precipitation in the auroral zone. However,\nthe profile in CNA differs dependent on the driving struc-\nture. In the early stages of the development of the storm,\nCNA is greater, on average, in ICME events. In the later\nstages of the storm, CNA is stronger during CIR events. It\nappears that the geomagnetic response to the passage of an\nTable 2. Summary of Descriptive Statistics of Parameters From the Set of 38 CIR-Driven Storms and 33 ICME-Driven Storms Used in\nthe Epoch Analysisa\nEarly Phase (\u00011 to +1\/2 Days)\nCIR-Driven Storms ICME-Driven Storms\nCNA, dB vx, kms\n\u00011 Bz, nT Dst, nT Kp CNA, dB vx, kms\n\u00011 Bz, nT Dst, nT Kp\nMin \u00010.17 \u0001714.05 \u000132.06 \u0001109 0 \u00010.48 \u00011007.9 \u000178.55 \u0001383 0\nMax 4.50 \u0001326.81 22.10 27 7 10.73 \u0001312.94 37.97 80 9\nMean 0.48 \u0001441.16 0.09 \u000111.83 2.50 0.74 \u0001470.14 \u00010.94 \u000134.94 3.33\nMedian 0.34 \u0001421.01 0.24 \u00015.25 2 0.43 \u0001435.77 \u00010.84 \u000114 3\nStd 0.11 19.76 0.93 4.70 0.18 0.28 22.50 2.46 14.88 0.33\nLate Phase (+1\/2 to +3 Days)\nCIR-Driven Storms ICME-Driven Storms\nCNA, dB vx, kms\n\u00011 Bz, nT Dst, nT Kp CNA, dB vx, kms\n\u00011 Bz, nT Dst, nT Kp\nMin \u00010.31 \u0001972.50 \u000119.87 \u000186 0 \u00010.31 \u00011006.40 \u000138.14 \u0001182 0\nMax 7.29 \u0001363.29 20.78 30 7.3 6.15 \u0001312.03 26.98 27 7.3\nMean 0.67 \u0001558.20 \u00010.06 \u000123.46 3 0.49 \u0001464.94 \u00010.27 \u000135.03 2.45\nMedian 0.49 \u0001551.25 \u00010.05 \u000122.50 3 0.33 \u0001439.85 \u00010.06 \u000122 2.15\nStd 0.14 6.45 0.77 1.90 0.11 0.13 20.86 0.96 7.25 0.22\naStatistics are given for the early phase of each event, from \u00011 day to +1\/2 day of the epoch, and for the later phase of each event, from +1\/2 day to +3\ndays of the epoch.\nA06205 LONGDEN ET AL.: ICME- AND CIR-DRIVEN PRECIPITATION\n9 of 12\nA06205\nICME is shorter than that driven by the passage of an CIR.\nGeomagnetic activity in the auroral zone, indicated by the\nKp index, is known to remain elevated for a longer period\nduring CIR events than during ICME events [e.g., Denton et\nal., 2006]. This is confirmed by mean Kp in this epoch\nstudy (Figure 1f). Solar wind velocity also remains elevated\ndue to the persistence of a high-speed stream following the\ncompression region. This means that both enhanced geo-\nmagnetic activity and a solar wind driver for particle\nprecipitation are provided by CIRs over a sustained period.\n[34] Electron precipitation exhibits a diurnal variation\n[e.g., Cowley et al., 1991; Foppiano and Bradley, 1984,\n1985; Hargreaves 1966, 1969; Hargreaves and Cowley,\n1967; Hargreaves et al., 1987; Hartz et al., 1963; Holt et\nal., 1961; Ranta et al., 1981; Kavanagh et al., 2004], with a\nclear minimum in the local evening. Solar wind driving\nmechanisms appear unable to stimulate significant precipi-\ntation at this time. This has been attributed to insufficient\nelectron flux at this local time [e.g., Kavanagh et al., 2004].\nThe diurnal effects are largely removed from the averaged\ndata in the epoch analysis results. Short-duration spikes in\nCNA, such as those driven by substorm activity in the\nmidnight sector, can also be de-emphasized by the averag-\ning process.\n[35] To identify possible diurnal effects, Figure 6 shows\nmean CNA from the riometer at Abisko and mean electron\nflux intensity from the LANL-01A satellite during the 38\nCIR-driven storms and 33 ICME-driven storms used in this\nstudy binned according to Universal Time (UT). In this\nfigure, ‘‘Day 0’’ refers to the day on which storm onset\noccurred and is independent of the time of the first clear\nminimum observed in the Dst index for each event.\n‘‘Day \u00011’’ is the day prior to the onset of the storm.\n‘‘Day 1’’ to ‘‘Day 4’’ are the days following the onset of the\nstorm, covering storm development and possible recovery.\nThe magnetic local time (MLT) of the Abisko riometer is\n\u0002UT +2 h 20 min and the MLT of the footprint of LANL-\n01A is \u0002UT +10 min.\n[36] From Figure 6, diurnal variation in CNA and electron\nflux intensity during both CIR-driven and ICME-driven\nstorms is clear. During ICME events, peak CNA is consis-\nFigure 6. Time series of mean CNA at Abisko and mean geosynchronous electron flux intensity\nfor electrons with energies in the range of 50–500 keV from the LANL-01A satellite. Panels (a)\nand (b) show the data from the set of 38 CIR-driven storms. Panels (c) and (d) show the data from\nthe set of 33 ICME-driven storms. The data has been binned according to UT. Day 0 refers to the\nday on which storm onset occurred.\nA06205 LONGDEN ET AL.: ICME- AND CIR-DRIVEN PRECIPITATION\n10 of 12\nA06205\ntent during the first three days of the period, indicating\nelevated CNA prior to the onset of the storm. After the onset\nof storm activity, mean CNA is elevated across a wider\nrange of local times. During the recovery phase of the storm,\npeak mean CNA decays. Mean geosynchronous electron\nflux intensity shows isolated, impulsive increases during the\nmain phase of storm activity, including in the local evening.\nHowever, there is no significant increase in the peak mean\ndaytime electron flux intensity with changing activity.\n[37] During the CIR events, mean CNA and mean electron\nflux intensity are low at all local times prior to the onset of\nstorm activity. The effect of the onset of the storm (‘‘Day 0’’)\nappears to have little effect on these parameters. During the\ndevelopment of the storm and apparent recovery, mean CNA\nand electron flux intensity across all energy channels in the\n50–500 keV range are elevated at all local times compared to\npre-storm levels. This elevation is sustained throughout the\nfour day period considered.\n[38] As CNA and geosynchronous electron flux intensity\nexhibit a local time dependency, the timing of the occur-\nrence of a precipitation event may affect whether it is\ndetected by the riometer and satellite used in this study\nand all precipitation events may not have been observed.\nFurther investigation of precipitation using data from a\nnumber of riometers should provide information about the\nspatial extent of precipitation events and local time effects\nduring CIR- and ICME-driven storms.\n[39] Borovsky and Steinberg [2006] found that 67% of\nCIR-driven storms occurred following a period of geomag-\nnetic calm, compared to 37% of ICME-driven storms. There\nis evidence of this ‘‘calm before the storm’’ in the low value\nof mean CNA and mean geosynchronous electron flux\nintensity prior to the onset of CIR-driven activity in this\nstudy. When storms of all intensities are used, an enhance-\nment in CNA is clear for both CIR events and ICME events\n\u0002 10 h prior to the zero epoch. Before this time, mean CNA\nfor ICME events exceeds that of mean CNA for CIR events.\nAdditionally, mean CNA falls to a level lower than that\nobserved initially. Higher levels of geomagnetic activity are\napparent prior to the zero epoch.\n[40] When storms of all intensities are considered, the\npeaks in CNA at Abisko during ICME-dominated solar\nwind occur around the time of increased in mean Pdyn.\nWhen weak and moderate storms only are considered, both\nthe increased Pdyn and CNA are no longer pronounced. This\nimplies that Pdyn is significant in the occurrence of precip-\nitation during ICME-driven storms. When individual ICME\nevents were investigated, impulses in Pdyn resulting in\ncompression of the magnetosphere seen as impulses in\nthe SYM-H index were identified during some events.\nHowever, it is difficult to identify instances of precipitation\ndirectly driven by impulses in Pdyn (sudden commencement\nabsorption) as often the impulses occurred during a back-\nground of ongoing precipitation.\n6. Conclusions\n[41] The results of the epoch analysis show that there is a\ndifference in particle precipitation during ICME-driven\nstorms when compared to CIR-driven storms:\n[42] (1) When events driving storms of all intensities are\nconsidered, mean CNA is more intense during ICME-driven\nstorms but also shorter-lived. Mean CNA during CIR-driven\nstorms increases gradually and remains elevated over a\nsustained period of time. When events driving an equivalent\nresponse in terms of storm magnitude are compared, mean\nCNA during CIR events is greater in magnitude as well as\nbeing sustained over a longer period, of the order of days,\nthan mean CNA during ICME events.\n[43] (2) Sustained CNA indicates the extended presence\nof driving mechanisms for particle precipitation during CIR-\ndriven storms and a sufficient population of particles. Mean\nelectron flux intensity at geosynchronous orbit for energies\nin the range 50–500 keV are also elevated over a sustained\nperiod during CIR-driven storms. The ‘‘calm before the\nstorm’’ reported by Borovsky and Steinberg [2006] prior to\nthe onset of CIR-driven storms is evident.\n[44] (3) Of the 38 CIR events selected for analysis, 37\nresulted in CIR-driven storms of weak or moderate intensity\nonly when categorized according the Dst index. During\nthese weak and moderate storms, a significant effect on\nparticle precipitation was observed.\n[45] Acknowledgments. The authors wish to thank all members of\nthe SOPA team for providing the SOPA data. Thanks are due to D. DeLapp\nfor providing web access to SOPA data. We would like to thank J. Manninen\nand the Sodankyla¨ Geophysical Observatory for the SGO riometer data. The\nACE solar wind and IMF data were obtained from the NASA CDAWeb\n(http:\/\/cdaweb.gsfc.nasa.gov). The Dst and Kp indices data were obtained\nfrom NOAA’s Space Physics Interactive Data Resources (http:\/\/spidr.ngdc.\nnoaa.gov). The SYM-H index data were obtained from the KyotoWorld Data\nCenter for Geomagnetism (http:\/\/swdcdb.kugi.kyoto-u.ac.jp). The authors\nwish to thank J. E. Borovsky, M. F. Thomsen, and A. J. Kavanagh for many\nhelpful discussions. The authors wish to thank R. McPherron for providing\nhis original list of CIR events.\n[46] Zuyin Pu thanks Nigel Meredith and another reviewer for their\nassistance in evaluating this paper.\nReferences\nBaker, D. N., P. Stauning, E. W. Hones Jr., P. R. Higbie, and R. D. Belian\n(1981), Near-equatorial, high-resolution measurements of electron preci-\npitation at L ’ 6.6, J. Geophys. Res., 86, 2295–2313.\nBartels, J., N. H. Heck, and H. F. Johnston (1939), The three-hour-range index\nmeasuring geomagnetic activity, Terr. Magn. Atmos. Electr., 44, 411–454.\nBelian, R. D., G. R. Gisler, T. Cayton, and R. Christensen (1992), High-Z\nenergetic particles at geosynchronous orbit during the great solar proton\nevent series of October 1989, J. Geophys. Res., 97, 16,897–16,906.\nBorovsky, J. E., and M. H. Denton (2006), Differences between CME-\ndriven storms and CIR-driven storms, J. Geophys. Res., 111, A07S08,\ndoi:10.1029\/2005JA011447.\nBorovsky, J. E., and J. T. Steinberg (2006), The ‘‘calm before the storm’’ in\nCIR\/magnetosphere interactions: Occurrence statistics, solar wind statis-\ntics, and magnetospheric preconditioning, J. Geophys. Res., 111, A07S10,\ndoi:10.1029\/2005JA011397.\nBrown, R. R., and V. M. Driatsky (1973), Further studies of ionospheric\nand geomagnetic effects of sudden impulses, Planet. Space Sci., 21,\n1931–1935.\nBrown, R. R., T. R. Hartz, B. Landmark, H. Leinbach, and J. Ortner (1961),\nLarge-scale electron bombardment of the atmosphere at the sudden com-\nmencement of a geomagnetic storm, J. Geophys. Res., 66, 1035–1041.\nBrown, R. R., H. Leinbach, S.-I. Akasofu, V. M. Driatsky, and R. J.\nSchmidt (1972), Quadruple conjugate pair observations of the sudden\ncommencement absorption event on June 17, 1965, J. Geophys. Res.,\n77, 5602–5607.\nCane, H. V., and I. G. Richardson (2003), Interplanetary coronal mass\nejections in the near-Earth solar wind during 1996–2002, J. Geophys.\nRes., 108(A4), 1156, doi:10.1029\/2002JA009817.\nCowley, S. W. H., J. P. Morelli, and M. Lockwood (1991), Dependence of\nconvective flows and particle precipitation in the high latitude iono-\nsphere on the X and Z-components of the interplanetary magnetic field,\nJ. Geophys. Res., 96, 5557–5564.\nDenton, M. H., J. E. Borovsky, R. M. Skoug, M. F. Thomsen, B. Lavraud,\nM. G. Henderson, R. L. McPherron, J. C. Zhang, and M. W. Liemohn\n(2006), Geomagnetic storms driven by ICME- and CIR-dominated solar\nwind, J. Geophys. Res., 111, A07S07, doi:10.1029\/2005JA011436.\nA06205 LONGDEN ET AL.: ICME- AND CIR-DRIVEN PRECIPITATION\n11 of 12\nA06205\nFoppiano, A. J., and P. A. Bradley (1984), Day to day variability of riometer\nabsorption, J. Atmos. Terr. Phys., 46, 689–696.\nFoppiano, A. J., and P. A. Bradley (1985), Morphology of background\nauroral absorption, J. Atmos. Terr. Phys., 47, 663–674.\nGonzalez, W. D., and B. T. Tsurutani (1987), Criteria of interplanetary\nparameters causing intense magnetic storms (Dst < \u0001100 nT), Planet.\nSpace Sci., 35, 1101–1109.\nGonzalez, W., J. A. Joselyn, Y. Kamide, H. W. Kroehl, G. Rostoker, B. T.\nTsurutani, and V. M. Vasyliunas (1994), What is a geomagnetic storm?,\nJ. Geophys. Res., 99, 5771–5792.\nGonzalez, W. D., B. T. Tsurutani, and A. L. C. de Gonzalez (1999), Inter-\nplanetary origin of geomagnetic storms, Space Sci. Rev., 88, 529–562.\nGopalswamy, N. (2003), Coronal mass ejections: Initiation and detection,\nAdv. Space Res., 31, 869–881.\nGosling, J. T., D. J. McComas, J. L. Phillips, and J. Bame (1991),\nGeomagnetic activity associated with Earth passage of interplanetary\nshock disturbances and coronal mass ejections, J. Geophys. Res., 96,\n7831–7839.\nGrafe, A. (1999), Are our ideas about Dst correct?, Ann. Geophys., 17,\n1–10.\nHargreaves, J. K. (1966), On the variation of auroral radio absorption with\ngeomagnetic activity, Planet. Space Sci., 14, 991–1006.\nHargreaves, J. K. (1969), Auroral absorption of HF radio waves in the\nionosphere: A review of results from the first decade of riometry, P. IEEE,\n57, 1348–1373.\nHargreaves, J. K., and F. C. Cowley (1967), Studies of auroral absorption\nevents at three magnetic latitudes - I. Occurrence and statistical properties\nof events, Planet. Space Sci., 5, 1571–1583.\nHargreaves, J. K., H. J. A. Chivers, and W. J. Axford (1975), The devel-\nopment of the substorm in auroral radio absorption, Planet. Space Sci.,\n23, 905–911.\nHargreaves, J. K., M. T. Feeney, H. Ranta, and A. Ranta (1987), On the\nprediction of auroral radio absorption on the equatorial side of the ab-\nsorption zone, J. Atmos. Terr. Phys., 49, 259–272.\nHartz, T. R., L. E. Montbriand, and E. L. Vogan (1963), A study of auroral\nabsorption at 30 Mc\/s, Can. J. Phys., 41, 581–595.\nHolt, O., B. Landmark, and F. Lied (1961), Analysis of riometer observa-\ntions obtained during polar radio blackouts, J. Atmos. Terr. Phys., 23,\n229–248.\nHultqvist, B. (1966), Ionospheric absorption of cosmic radio noise, Space\nSci. Rev., 5, 771–817.\nKamide, Y., N. Yokoyama, W. Gonzalez, B. T. Tsurutani, I. A. Daglis,\nA. Brekke, and S. Masuda (1998), Two step development of geomagnetic\nstorms, J. Geophys. Res., 103, 6917–6921.\nKavanagh, A. J., M. J. Kosch, F. Honary, A. Senior, S. R. Marple, E. E.\nWoodfield, and I. W. McCrea (2004), The statistical dependence of auroral\nabsorption on geomagnetic and solar wind parameters, Ann. Geophys., 22,\n877–887.\nKhan, H., and S. W. H. Cowley (1999), Observations of the response time of\nhigh-latitude ionospheric convection to variations in the interplanetary\nmagnetic field using EISCAT and IMP-8 data, Ann. Geophys., 17,\n1306–1335.\nLongden, N., F. Honary, A. J. Kavanagh, and J. Manninen (2007), The\ndriving mechanisms of particle precipitation during the moderate geo-\nmagnetic storm of 7 January 2005, Ann. Geophys., 25, 2053–2068.\nMaus, S., et al. (2005), The 10th generation international geomagnetic\nreference field, Phys. Earth Planet. Inter., 151, 320–322.\nMcComas, D. J., S. J. Bame, P. Barker, W. C. Feldman, J. L. Phillips,\nP. Riley, and J. W. Griffee (1998), Solar Wind Electron Proton Alpha\nMonitor (SWEPAM) for the Advanced Composition Explorer, Space\nSci. Rev., 86, 563–612.\nMoldwin, M. B., M. F. Thomsen, S. J. Bame, D. J. McComas, J. Birn, G. D.\nReeves, R. Nemzek, and R. D. Belian (1995), Flux dropouts of plasma\nand energetic particles at geosynchronous orbit during large geomagnetic\nstorms: Entry into the lobes, J. Geophys. Res., 100, 8031–8043.\nOsepian, A., and S. Kirkwood (2004), Cosmic radio-noise absorption bursts\ncaused by solar wind shocks, Ann. Geophys., 22, 2973–2987.\nParks, G. K., R. L. Arnoldy, T. W. Lezniak, and J. R. Winckler (1968),\nCorrelated effects of energetic electrons at the 6.6 RE equator and the\nauroral zone during magnetospheric substorms, Radio Sci., 3, 715–719.\nPerona, G. E. (1972), Theory on the precipitation of magnetospheric\nelectrons at the time of sudden commencement, J. Geophys. Res., 77,\n101–111.\nRanta, H., A. Ranta, P. N. Collis, and J. K. Hargreaves (1981), Develop-\nment of the auroral absorption substorm: Studies of pre-onset phase and\nsharp onset using an extensive riometer network, Planet. Space Sci., 29,\n1287–1313.\nRichardson, I. G., E. W. Cliver, and H. V. Cane (2000), Sources of geo-\nmagnetic activity over the solar cycle: Relative importance of coronal\nmass ejections, high-speed streams, and slow solar wind, J. Geophys.\nRes., 105, 18,203–18,213.\nRichardson, I. G., E. W. Cliver, and H. V. Cane (2001), Sources of geo-\nmagnetic storms for solar minimum and maximum conditions during\n1972–2000, Geophys. Res. Lett., 28, 2567–2572.\nSheeley, N. R., Jr., R. A. Howard, M. J. Koomen, D. J. Michels, R. Schwenn,\nK.-H. Mu¨hlhauser, and H. Rosenbauer (1985), Coronal mass ejections and\ninterplanetary shocks, J. Geophys. Res., 90, 163–175.\nSmith, C. W., J. L’Heureux, N. F. Ness, M. H. Acun˜a, L. F. Burlaga, and\nJ. Scheifele (1998), The ACE magnetic fields experiment, Space Sci.\nRev., 86, 613–632.\nSpanswick, E., E. Donovan, R. Friedel, and A. Korth (2007), Ground based\nidentification of dispersionless electron injections, Geophys. Res. Lett.,\n34, L03101, doi:10.1029\/2006GL028329.\nSt. Cyr, O. C., et al. (2000), Properties of coronal mass ejections: SOHO\nLASCO observations from January 1996 to June 1998, J. Geophys. Res.,\n105, 18,169–18,185.\nStauning, P. (1996), Investigations of ionospheric radio wave absorption\nprocesses using imaging riometer techniques, J. Atmos. Terr. Phys., 58,\n753–764.\nTakeuchi, T., T. Araki, A. Viljanen, and J. Watermann (2002), Geomagnetic\nnegative sudden impulses: Interplanetary causes and polarization distri-\nbution, J. Geophys. Res., 107(A7), 1096, doi:10.1029\/2001JA900152.\nThomsen, M. F. (2004), Why Kp is such a good measure of magnetospheric\nconvection, Space Weather, 2, S11004, doi:10.1029\/2004SW000089.\nTsurutani, B. T., W. D. Gonzalez, A. L. C. Gonzalez, F. Tang, J. K. Arballo,\nand M. Okada (1995), Interplanetary origin of geomagnetic activity in the\ndeclining phase of the solar cycle, J. Geophys. Res., 100, 21,717–21,733.\nTsurutani, B. T., et al. (2006), Corotating solar wind streams and recurrent\ngeomagnetic activity: A review, J. Geophys. Res., 111, A07S01,\ndoi:10.1029\/2005JA011273.\nTsyganenko, N. A. (1995), Modeling the Earth’s magnetospheric field con-\nfined within a realistic magnetopause, J. Geophys. Res., 100, 5599–5612.\nWanliss, J. A., and K. M. Showalter (2006), High-resolution global storm\nindex: Dst versus SYM-H, J. Geophys. Res., 111, A02202, doi:10.1029\/\n2005JA011034.\n\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\nM. H. Denton, F. Honary, and N. Longden, Space Plasma\nEnvironment and Radio Science Group, Department of Communication\nSystems, Lancaster University, Infolab 21, Lancaster LA1 4YW, UK.\n(n.longden@lancaster.ac.uk)\nA06205 LONGDEN ET AL.: ICME- AND CIR-DRIVEN PRECIPITATION\n12 of 12\nA06205\n"}