{"doi":"10.1017\/S0022112009990875","coreId":"103152","oai":"oai:epubs.surrey.ac.uk:2917","identifiers":["oai:epubs.surrey.ac.uk:2917","10.1017\/S0022112009990875"],"title":"Diffusion and the formation of vorticity staircases in randomly strained two-dimensional vortices","authors":["Turner, MR","Bassom, AP","Gilbert, AD"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-10-01","abstract":"The spreading and diffusion of two-dimensional vortices subject to weak external random strain fields is examined. The response to such a field of given angular frequency depends on the profile of the vortex and can be calculated numerically. An effective diffusivity can be determined as a function of radius and may be used to evolve the profile over a long time scale, using a diffusion equation that is both nonlinear and non-local. This equation, containing an additional smoothing parameter, is simulated starting with a Gaussian vortex. Fine scale steps in the vorticity profile develop at the periphery of the vortex and these form a vorticity staircase. The effective diffusivity is high in the steps where the vorticity gradient is low: between the steps are barriers characterized by low effective diffusivity and high vorticity gradient. The steps then merge before the vorticity is finally swept out and this leaves a vortex with a compact core and a sharp edge. There is also an increase in the effective diffusion within an encircling surf zone. In order to understand the properties of the evolution of the Gaussian vortex, an asymptotic model first proposed by Balmforth, Llewellyn Smith & Young (J. Fluid Mech., vol. 426, 2001, p. 95) is employed. The model is based on a vorticity distribution that consists of a compact vortex core surrounded by a skirt of relatively weak vorticity. Again simulations show the formation of fine scale vorticity steps within the skirt, followed by merger. The diffusion equation we develop has a tendency to generate vorticity steps on arbitrarily fine scales; these are limited in our numerical simulations by smoothing the effective diffusivity over small spatial scales","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"CAMBRIDGE UNIVERSITY PRESS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2917<\/identifier><datestamp>\n      2017-10-31T14:07:00Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6D617468737075626C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2917\/<\/dc:relation><dc:title>\n        Diffusion and the formation of vorticity staircases in randomly strained two-dimensional vortices<\/dc:title><dc:creator>\n        Turner, MR<\/dc:creator><dc:creator>\n        Bassom, AP<\/dc:creator><dc:creator>\n        Gilbert, AD<\/dc:creator><dc:description>\n        The spreading and diffusion of two-dimensional vortices subject to weak external random strain fields is examined. The response to such a field of given angular frequency depends on the profile of the vortex and can be calculated numerically. An effective diffusivity can be determined as a function of radius and may be used to evolve the profile over a long time scale, using a diffusion equation that is both nonlinear and non-local. This equation, containing an additional smoothing parameter, is simulated starting with a Gaussian vortex. Fine scale steps in the vorticity profile develop at the periphery of the vortex and these form a vorticity staircase. The effective diffusivity is high in the steps where the vorticity gradient is low: between the steps are barriers characterized by low effective diffusivity and high vorticity gradient. The steps then merge before the vorticity is finally swept out and this leaves a vortex with a compact core and a sharp edge. There is also an increase in the effective diffusion within an encircling surf zone. In order to understand the properties of the evolution of the Gaussian vortex, an asymptotic model first proposed by Balmforth, Llewellyn Smith & Young (J. Fluid Mech., vol. 426, 2001, p. 95) is employed. The model is based on a vorticity distribution that consists of a compact vortex core surrounded by a skirt of relatively weak vorticity. Again simulations show the formation of fine scale vorticity steps within the skirt, followed by merger. The diffusion equation we develop has a tendency to generate vorticity steps on arbitrarily fine scales; these are limited in our numerical simulations by smoothing the effective diffusivity over small spatial scales.<\/dc:description><dc:publisher>\n        CAMBRIDGE UNIVERSITY PRESS<\/dc:publisher><dc:date>\n        2009-10-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        attached<\/dc:rights><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2917\/2\/random.vortex.23.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2917\/4\/licence.txt<\/dc:identifier><dc:identifier>\n          Turner, MR, Bassom, AP and Gilbert, AD  (2009) Diffusion and the formation of vorticity staircases in randomly strained two-dimensional vortices   Journal of Fluid Mechanics, 638.  pp. 49-72.      <\/dc:identifier><dc:relation>\n        10.1017\/S0022112009990875<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2917\/","10.1017\/S0022112009990875"],"year":2009,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Under consideration for publication in J. Fluid Mech. 1\nDiffusion and the formation of vorticity\nstaircases in randomly strained\ntwo-dimensional vortices\nMATTHEW R. TURNER1†, ANDREW P. BASSOM2\n& ANDREW D. GILBERT1\n1Mathematics Research Institute,\nSchool of Engineering, Computing and Mathematics,\nUniversity of Exeter, Exeter EX4 4QF U.K.\n2School of Mathematics and Statistics,\nUniversity of Western Australia, Crawley 6009,\nAustralia\n(Received 29 July 2010)\nThe spreading and diffusion of two-dimensional vortices subject to weak, external,\nrandom strain fields is examined. The response to such a field of given angular frequency\ndepends on the profile of the vortex and can be calculated numerically. An effective\ndiffusivity can be determined as a function of radius and may be used to evolve the\nprofile over a long time scale, using a diffusion equation that is both nonlinear and non-\nlocal. This equation, containing an additional smoothing parameter, is simulated starting\nwith a Gaussian vortex. Fine-scale steps in the vorticity profile develop at the periphery\nof the vortex and these form a vorticity staircase. The effective diffusivity is high in the\nsteps where the vorticity gradient is low: between the steps are barriers characterised\nby low effective diffusivity and high vorticity gradient. The steps then merge before the\nvorticity is finally swept out and this leaves a vortex with a compact core and a sharp\nedge. There is also an increase in the effective diffusion within an encircling surf zone.\nIn order to understand the properties of the evolution of the Gaussian vortex, an\nasymptotic model first proposed by Balmforth, Llewellyn Smith and Young (J. Fluid\nMech. 426, 95–133, 2001) is employed. The model is based on a vorticity distribution that\nconsists of a compact vortex core surrounded by a skirt of relatively weak vorticity. Again\nsimulations show the formation of fine scale vorticity steps within the skirt, followed by\nmerger. The diffusion equation we develop has a tendency to generate vorticity steps on\narbitrarily fine scales; these are limited in our numerical simulations by smoothing the\neffective diffusivity over small spatial scales.\n1. Introduction\nThere has been much study of the evolution of passive scalars in fluid flows. In some\ncases, chosen either for mathematical convenience or with a certain application in mind,\nthe fluid flow is taken to be kinematic while in other instances it is obtained dynamically\nthrough full simulation of the Navier–Stokes equations. Those problems involving active\nscalars, in which the scalar feeds back on the flow field, are much less well understood.\nIn particular, within two-dimensional fluid flows the vorticity becomes a scalar which is\n† Present address: Environment and Technology, University of Brighton, Lewes Road,\nBrighton BN2 4GJ, U.K.\n2 M.R. Turner, A.P. Bassom & A.D. Gilbert\nsubject to mixing by the underlying fluid flow, but at the same time it specifies the flow.\nIt is then a subtle interaction of fluid stability and mixing properties that determines the\nevolution of such systems.\nHere the aim is to study this interaction and the subsequent diffusive evolution in a\nsimple two-dimensional geometry which is broadly relevant to geophysical applications.\nOur chosen model is a coherent vortex in an external, irrotational flow field, such as might\nbe generated by the motion of other coherent vortices in two-dimensional turbulence, or\nby the motion of boundaries. If a two-dimensional vortex, for simplicity say a Gaussian\nvortex, is subjected to a short period of weak, spatially uniform external strain, the\neffect is to distort the vortex and generate a spiral structure of vorticity pulled out\nby the differential rotation of the vortex. This is a mode with azimuthal wave number\nm = 2, and enstrophy, which is inviscidly conserved, is transferred from the mean to\nthe mode. This process was studied in detail by Bassom & Gilbert (1998, 1999) who\nidentified a number of distinct regimes. First is a dynamical feedback (or ‘rebound’)\nwhereby the enstrophy transfers from the m = 2 mode to the mean: the core of the vortex\ndynamically returns to axisymmetry, so suppressing the generation of fluctuations and\nmixing there. Although this behaviour was noted by Bassom & Gilbert (1998, 1999), it\nwas not until the work of Schecter et al. (2000) and Balmforth, Llewellyn Smith & Young\n(2001), henceforth referred to as BLSY, that it could be claimed to be well understood.\nThese latter authors used an asymptotic model to link the suppression of fluctuations\nto the existence of a so-called ‘quasi-mode’ in the vortex. Properties of quasi-modes are\na combination of those of continuous spectrum with others of a normal mode, including\nan exponential decay rate or Landau pole, first discussed in the fluid context by Briggs,\nDaugherty & Levy (1970) and more recently in general boundary layer flows by Shrira\n& Sazonov (2001).\nLeaving aside the technicalities of quasi-modes, the key point is that there is a dynam-\nical response of the vortex which has the effect of suppressing mixing in the core of the\nvortex. In many ways the core of the vortex has a damped ‘elastic’ response, as we discuss\nfurther below, which is a function of the vorticity profile. However the behaviour of the\nexternal strain is itself to modify the profile, and change the response to future strain.\nThis can be studied in a deterministic context by applying strain fields, and mapping\nout the dynamical response and the resulting modified profiles: papers that discuss this\ninclude BLSY and Turner & Gilbert (2007, 2009). In the present work the intention is\nto determine the effect of a continuous external forcing, so that the vortex spreads and\nevolves, changing its response as it does so. If the external strain is weak the spreading\noccurs on a slow time scale, and the response at any instant is given by a problem which\nis a linearisation about the profile at that time. If the external forcing is also random,\nwith a given correlation function, then a weakly nonlinear theory can be used to derive\na diffusion equation that governs the spread of the vortex. Since this spreading involves\nthe response of the vortex to each frequency in the external strain, and each response\ndepends on the whole profile, the diffusion equation on the long time scale is both non-\nlinear and non-local. Although it cannot be written down in an explicit form, it may be\nsimulated numerically and its properties explored.\nIn the coming section we investigate the particular case of a Gaussian vortex placed\nin a random strain field: our computations demonstrate the suppressed diffusion in the\ncore and the enhanced mixing further out in the tails, together with a number of other\nphenomena including the formation of vorticity staircases, with steps and transport bar-\nriers. To confirm these findings, and to obtain more detail and greater understanding of\nour results, we then consider the BLSY system of equations. These equations model the\ninteraction of a normal mode riding on a compact, central vortex, which is surrounded\nRandomly strained two-dimensional vortices 3\nby a ‘skirt’ of weak vorticity. This is a good, qualitative model of a Gaussian vortex and\nwe find similar phenomena as for the Gaussian case.\nA number of other studies have focused on the interaction of the dynamical effects of\nvorticity and the mixing properties of the flow within a deterministic setting. Haynes,\nPoet & Shuckburgh (2007) compare the transport in a kinematically prescribed flow\nmodelling a meandering jet, with a similar flow on a beta plane under topographic forcing.\nIn both cases the presence of barriers inhibits mixing: however in the dynamical case\nthere are significant changes in the flow field when a barrier is broken and vorticity is\nhomogenised in a large area of the flow. Perhaps the closest studies to the present paper\nare del Castillo Negrete (2000a,b): these papers consider a variety of models in which\nadvected scalars change the parameters of the flow, or a mapping such as the standard\nmap (see also Boffetta et al. 2003). In the model closest to ours, the ‘single wave model’,\nvorticity is advected by a shear flow whose profile is chosen so that it possesses a neutral,\nlarge-scale mode. The mode amplitude interacts with the vorticity distribution to give\na simplified system similar to that derived by BLSY. The presence of the neutral mode\nmeans that the flow tends to evolve a critical layer containing cat’s eyes and the mixing\nof vorticity within these eyes can have a strong effect on the flow field: for example\nintroducing weak vorticity into the eyes can lead to resonant oscillations and enhanced\nmixing (del Castillo Negrete 2000a).\nThe process of vorticity mixing in the presence of a neutral mode (del Castillo Negrete\n2000a,b) is very relevant to our study of a Gaussian vortex, even though this profile\npossesses no neutral modes (Briggs, Daugherty & Levy 1970). The reason is that, in\na sense we will explain, the Gaussian vortex ‘nearly’ has a neutral mode. This is the\napproach taken in BLSY, who break a Gaussian vortex into a compact, coherent core,\nfor example a top-hat or Rankine vortex, surrounded by a tail or skirt of weak vorticity.\nA Rankine vortex supports a neutral m = 2 normal mode (or Kelvin wave). This is\nundamped, but if weak vorticity is introduced at the radius where fluid particles co-\nrotate with the wave, that is in the critical layer, BLSY show how this can stabilise or\ndestabilise the wave. In a similar way, for qualitative purposes a Gaussian vortex can be\ntreated as having a core that supports a neutral mode, but which is damped by vorticity\nat the outer edges of the vortex: this combination forms a quasi-mode in the linear regime\ngiving the damped elastic behaviour mentioned above. If pushed hard enough cat’s eyes\nare created in the critical layer, with a profile modified sufficiently for a true neutral\nnormal mode to exist on the vortex (BLSY, Turner & Gilbert 2007).\nThese earlier studies have focused on the initial value problem, with linear behaviour\nsuch as quasi-mode damping, and the nonlinear generation of cat’s eyes beyond some\namplitude threshold. Our study here is distinguished by using a weak, random external\nforcing so that the vortex is always in a linear regime, and using a weakly nonlinear\nexpansion to set up a diffusion equation for the vorticity profile on a long time scale. A\nrelated study was presented by two of the present authors a decade ago, Bassom & Gilbert\n(1999), henceforth referred to as BG. There we again derived a weakly nonlinear system\nfor the evolution of the mean profile, and proceded to simulate it with a realisation of the\nrandom forcing included explicitly. Although some results were obtained, for example the\ndemonstration that the suppression of vorticity arising from the quasi-mode has the effect\nof decreasing the spread of the vortex compared to a passive scalar, it was not possible\nto follow the system very far in time. The present study, which can be considered a more\nadvanced version of BG, as the random component is ensemble averaged at the outset,\nwill highlight some of the limitations of that earlier work, in particular our present finding\nthat the interaction of dynamical and diffusive properties of vorticity in these systems\n4 M.R. Turner, A.P. Bassom & A.D. Gilbert\nleads to small scale instability and the generation of fine scale steps in the vorticity\nprofiles.\nThe remainder of the paper is structured as follows. In §2 we consider the case of the\nGaussian vortex in a random strain field: a diffusion equation is derived for the evolution\nof the profile on a long time scale and numerical experiments are performed. We attempt\nto throw more light on the processes involved by examining the BLSY model in §3.\nIn these sections theory is developed, followed by numerical simulations, but technical\ndetails are relegated to three appendices. Finally §4 offers some concluding discussion.\n2. Gaussian vortex in random strain\n2.1. Analytical development\nWe use the equations for inviscid planar flow written in the form\n∂tω = J(ψ, ω), ω = −∇2ψ, (2.1)\nwith the velocity field u = (r−1∂θψ,−∂rψ) in plane polar coordinates (r, θ) and\nrJ(a, b) ≡ (∂ra)(∂θb)− (∂θa)(∂rb).\nWe begin with an axisymmetric vortex, and adopt non-dimensional units based on its\nwidth and circulation. For example, our initial condition of a Gaussian vortex is\nω = ω = (4pi)−1e−r\n2\/4, (2.2)\nwhere ω is the mean vorticity profile, averaged over θ. With a general vorticity profile\nis an associated mean stream function ψ, angular velocity α and vorticity gradient rβ\ngiven by\nω = −r−1∂r(r∂rψ), α = −r−1∂rψ, β = r−1∂rω. (2.3)\nWe now impose a weak, external strain field on the vortex by requiring that\nψ(r, θ, t) ∼ (−2pi)−1 log r + εq(t)rmeimθ + c. c. (r →∞) (2.4)\nwhere c.c. denotes the complex conjugate. This is the monopolar field from the vortex\nplus the e±imθ components of a general multipolar field of complex amplitude εq(t) with\n0 < ε \u001c 1. The resulting flow is irrotational outside the vortex, at radii where ω is\neffectively zero. We will focus on the case m = 2 numerically, that of spatially uniform\nexternal strain, but leave the general value of m in the mathematical development for\nclarity. (We note that m = 1 gives translations and no mixing while we expect modes\nm > 2 to be similar to m = 2.)\nThe time dependence of the statistically stationary external flow is given by the cor-\nrelation function of q(t) and we shall consider two cases. The first of these is a flow that\nis delta correlated in time so that\n〈q(t)q∗(t′)〉 = δ(t− t′), w(p) = 1; (2.5)\nHere the brackets 〈·〉 denote an ensemble average and w(p) is a corresponding weight\nfunction which we note here for reference and which emerges in computing the feedback on\nthe mean profile in appendix A. Physically, this function w(p) describes the contribution\nto frequency p from the random function q(t). Our second example has a peak at a\nrotational frequency b and an exponential fall-off\n〈q(t)q∗(t′)〉 = a\n2\ne−a|t−t\n′| e−imb(t−t\n′), w(p) =\na2\n(p−mb)2 + a2 , (2.6)\nRandomly strained two-dimensional vortices 5\nso that the weight is largest around frequencies p = mb. The delta correlated case is\nrecaptured in the limit a→∞ for any fixed b.\nNow consider the evolution of the flow and vorticity field, for example starting from\nthe Gaussian initial condition (2.2). As time proceeds so the external flow generates\nfluctuations, that is components proportional to e±imθ in the vorticity field. For small\nε these are weak and governed by the equations for vorticity, linearised about the mean\nprofile ω. There is then a feedback, of magnitude ε2, from the quadratic terms, which\nleads to a slow drift of the mean profile ω, on a long time scale.\nTo obtain the equation for this drift, we begin by taking ε \u001c 1 in the external strain\n(2.4), and introduce a long time scale τ = ε2t together with a weakly nonlinear expansion\nω(r, t, τ) = ω(r, τ) + εωˆ(r, t, τ)eimθ + c. c.+ · · · , (2.7)\nψ(r, t, τ) = ψ(r, τ) + εψˆ(r, t, τ)eimθ + c. c.+ · · · . (2.8)\nDropping the hats yields equations for the fluctuating vorticity and stream function\n∂tω + imαω + imβψ = 0, −ω = (∂2r + r−1∂r − r−2m2)ψ. (2.9)\nThese evolve in the angular velocity field and background vorticity gradient given in (2.3)\nin terms of the mean profile. On the longer, τ time scale, the mean profile obeys\n∂τω + r−1∂r(rF ) = 0, F = 2mr−1 Im〈ωψ∗〉 (2.10)\nwhere the angled brackets denote an ensemble average over realisations of the random\nforcing, and also an average over evolution on the fast t time scale.\nOur aim is to solve the fluctuating problem and then derive the feedback on the mean\nprofile, in a form suitable for numerical time stepping. We use a Laplace transform\napproach and define\nf˜(p) =\n∫ ∞\n0\ndt eiptf(t), f(t) = − 1\n2pi\n∫\nΓ\ndp e−iptf˜(p). (2.11)\nHere Γ is a contour taken from +∞ to −∞ above all singularities of the function f˜(p).\nFrom (2.9), in Laplace transform space we have to solve\nω˜ ≡ −(∂2r + r−1∂r − r−2m2)ψ˜ =\nβ(r)\np\/m− α(r) ψ˜ (2.12)\nfor ψ˜(r, p) with\nψ˜(r, p) ∼ rmq˜(p) as r →∞ (2.13)\nand ψ˜(0, p) = 0. We formally write the solution as\nψ˜(r, p) = M(r, p)q˜(p), ω˜(r, p) = N(r, p)q˜(p). (2.14)\nAs discussed by Briggs, Daugherty & Levy (1970), there is a singularity whenever the\nexternal frequency p = mα(r) for some resonant radius r and the behaviour near such\npoints is relevant to us.\nSuppose then we consider a fixed value p = mα(s) for some s, and vary r; then the\nsolution to the above differential system has the following behaviour as r → s. The\nleading order, singular term for the vorticity is a simple pole\nN(r, p) = −C(p)µ(s)(r − s)−1 + · · · (2.15)\nand for the stream function is\nM(r, p) = C(p)[1 + µ(s)(r − s) log(s− r) + · · · ] +D(p)[(r − s) + · · · ], (2.16)\n6 M.R. Turner, A.P. Bassom & A.D. Gilbert\nfor r < s, while\nM(r, p) = C(p)[1 + µ(s)(r − s)(log(r − s) + iχ) + · · · ] +D(p)[(r − s) + · · · ] (2.17)\nfor r > s. The coefficients C and D depend on p and are fixed by the boundary conditions\nat r = 0 and infinity. The quantity µ(s) ≡ β(s)\/∂sα(s) while the angle χ is a phase shift\nwhich is chosen to select the correct branch of the logarithmic singularity in ψ˜. We have\nin mind letting the point p approach the real axis from above which means that for\n∂sα(s) > 0 the point s also approaches from above and the phase shift is χ = pi. On the\nother hand if ∂sα(s) < 0 (as in the Gaussian vortex) then s approaches from below and\nχ = −pi.\nThis gives a formal solution to the linear problem for the fluctations driven by any\nexternal frequency p. It then remains to calculate the feedback on the mean profile by\ncalculating the average 〈ωψ∗〉 in (2.10). We relegate this calculation to appendix A and\ngive only the final result here, which is a diffusion equation for ω(r, τ),\n∂τω + r−1∂r(rF ) = 0, F (r) = −κ(r)∂rω, (2.18)\nwith a radial vorticity flux F and an effective diffusivity taking the form\nκ∗(r) = m2r−2|C(p)|2w(p), p ≡ mα(r). (2.19)\nIn (2.18) and (2.19) as used for simulations, κ and κ∗ are not quite the same: κ is a\nsmoothed version of κ∗ in a sense that we will clarify shortly. We note that the quantities\nα, κ, κ∗, F and C all also change with τ as the underlying profile ω evolves but we\nsuppress this dependence for brevity: only the specification of the random forcing, w(p),\nis independent of τ . Instead it is more useful to emphasize the dependence of quantities\non radius r or frequency p as appropriate.\nThe content of equation (2.19) is worthy of some comment; at a given radius r, there\nis a crucial link to a frequency p via the angular velocity α(r): it is at this frequency\nthat the external forcing is resonant with the motion of fluid elements, accounting for the\nweighting factor w(p). The quantity C(p) controls the transport and is the strength in\n(2.15) of the singularity at the resonant radius r of the linear solution driven by external\nforcing of frequency p. Computing C(p) has to be done numerically for each radius r and\ndepends on the whole vorticity profile, through integration of the ordinary differential\nequation (2.12) involving the angular velocity α and vorticity gradient rβ, linked in turn\nto ω. The effective diffusivity κ∗(r) is always non-negative and the resulting diffusion\nequation is nonlinear and nonlocal, inheriting these properties from the Euler equation.\nThese features make further analytical progress difficult, at least in any general case, but\ncan be dealt with numerically.\nWe also mention the case of a passive scalar field σ. If we take a flow field with a fixed\nangular velocity α(r) and simply add on the non-axisymmetric component of the random\nstrain field (2.4) to obtain a prescribed, purely kinematic flow field, the resulting radial\nscalar flux is F = −κscalar(r)∂rσ with\nκscalar(r) = m2r−2r2mw(p), p ≡ mα(r). (2.20)\nThis is in agreement with results given in BG, up to normalisation. For large r, C(p) ' rm\nand so this is also the large-r form of the effective diffusivity (2.19).\nNotice that in the delta correlated case w(p) = 1, the scalar effective diffusivity (2.20)\nhas no dependence whatsoever on the axisymmetric component of the flow field. This is\na result of the limit of delta correlation: the external flow changes so rapidly that the\nadvection by the axisymmetric flow component is irrelevant. This is not the case for the\nfully dynamical vorticity problem: even in the delta correlated case, the profile enters into\nRandomly strained two-dimensional vortices 7\n(a) (b)\nFigure 1. Effective diffusivity (a) κ(r) plotted for the Gaussian vortex at τ = 0 (with the\nscalar diffusivity shown dotted), and (b) κ(y) plotted for the BLSY model at τ = 0 (see §3).\nthe quantity C(p) in (2.19). In some loose sense, the behaviour of the vortex introduces a\n‘memory’ into the problem: if a blob of passive scalar is moved to a different radius there\nis no dynamical response, whereas for a blob of vorticity the global flow field continues\nto evolve on its own time scale: this is the rebound phenomenon of BG, discussed in the\nintroduction and now understood as quasi-mode damping.\nFigure 1(a) shows the effective diffusivity κ(r) in (2.19) for the Gaussian profile, at\nτ = 0. (Figure 1(b) shows the analogous function (3.16) for the BLSY model discussed\nlater in §3). This has a number of interesting features. The corresponding scalar diffusivity\n(2.20) is shown dotted, and the two coincide for large r. Near the origin, say for r ≤ 3,\nthe vorticity diffusivity is much smaller than the scalar diffusivity: this is a consequence\nof the elastic behaviour of the vortex core discussed in the introduction. An external\nfrequency that is in the range to excite fluctuations in the core of the vortex will be\nmet with a wave-like response and no net transport. However further out, at r ' 4,\nκ(r) is rather larger than the scalar diffusivity: here the external forcing meets a large\nresponse from the vortex, essentially exciting the quasi-mode and giving strong mixing\nin the critical layer.\n2.2. Numerical results\nWe constructed a code to follow the vorticity on the long τ time scale. Starting with the\nprofile (2.2) the code integrates the diffusion equation defined by (2.18) and (2.19); α is\ncomputed from (2.3), C(p) is obtained from (2.12–2.17) and we used the delta correlated\ncase w(p) = 1 in all our computations (other choices give similar results). The details of\nthe numerical method are discussed in appendix B.\nIf the equations are solved with no smoothing at all (so that κ = κ∗) it turns out that\nthe results are sensitive to the radial grid used, from r = 0 to r = R: the finer the grid,\nthe closer the steps that form initially. Therefore to obtain numerical results that have a\nclear mathematical setting, that is are independent of resolution, we impose a cap on the\nvalues of the diffusivity, and smooth the diffusivity over a small length scale. Specifically\nonce we have computed κ∗(r) from (2.19), we replace it by\nκ = κscalarGδFδ(κ∗\/κscalar), (2.21)\nHere we first normalise κ using the scalar diffusivity, which grows with a power law\ndependence in (2.20). The first operation then caps this at a level δ−1,\nFδ(s) = δ−1 tanh(sδ), (2.22)\n8 M.R. Turner, A.P. Bassom & A.D. Gilbert\n(a)\n(b)\n(c)\nFigure 2. Evolution of a Gaussian vortex with smoothing (a) δ = 0.05, (b) δ = 0.02 and\n(c) δ = 0.015. The curves show a sequence of vorticity profiles ω (left panels) and effective\ndiffusivities log κ (right panels), plotted against r. In each panel the curves are separated by\nadditive constants and given in steps of (a) 0.02 and (b,c) 0.002 of τ , reading up the curves.\nand the second smooths it over a scale of order δ,\n(Gδf)(s) = pi−1\/2δ−1\n∫ Λδ\n−Λδ\ne−(s−s\n′)2\/δ2f(s′) ds. (2.23)\nThis smoothing is taken over Λ = 3 standard deviations of the Gaussian, and is done\nnumerically from r = Λδ to r = R − Λδ: this covers all the radii at which fine structure\ndevelops, and structure in the diffusivity and vorticity profile is eliminated at scales\nsmaller than δ. We discuss this smoothing further below.\nThe results of runs for the Gaussian initial condition are shown in figures 2 and 3: in\nthe two figures the corresponding subfigures (a,b,c) are distinguished by different values\nof the smoothing parameter δ. Figure 2(a) has the largest smoothing parameter, δ = 0.05:\nreading up the curves in the left panel shows the evolution of the profile. The Gaussian\ntail breaks up into a single step, which then disappears to leave a sharp-edged vortex.\nOn the right hand panel of (a) the evolution of the logarithm of the diffusivity, log κ(r),\nis shown: it may be seen that a double peak emerges; the first peak, around r = 3,\nRandomly strained two-dimensional vortices 9\n(a)\n(b)\n(c)\nFigure 3. Space-time diagram of the evolution of the vorticity gradient, −∂rω(r, τ), (left) panels\nand effective diffusivity κ(r, τ) (right panels), plotted in grey scales in the (τ, r)-plane for (a)\nδ = 0.05, 0 ≤ τ ≤ 0.2 (b) δ = 0.02, 0 ≤ τ ≤ 0.02 and (c) δ = 0.015, 0 ≤ τ ≤ 0.02. The grey\nscale coding is capped at levels −∂rω = 0.05, κ = 10, corresponding to black; zero is white. The\nvertical range is 0 ≤ r ≤ 5 and τ runs horizontally.\ncorresponds to the flat part of the step and the second peak lies just beyond the edge\nof the sharpening vortex. The two peaks then merge and move inwards, in concert with\nthe sharpening edge of the vortex. Another view of our results with this choice of δ is\nshown in figure 3(a). These panels depict the evolution of the vorticity gradient ∂rω(r, τ)\n(left) and effective diffusivity κ(r, τ) (right) in space-time or ‘butterfly’ diagrams. The\nleft panel shows the initial formation of a single vorticity step (with also some outgoing\nripples) in the left panel, followed by its sudden evaporation, to leave a sharp edged\nvortex. The behaviour of the vorticity gradient is linked to the effective diffusivity (right\npanel).\nThe evolution we see in figures 2(a) and 3(a) is the result of a runaway process in\nwhich the effective diffusivity rapidly increases at certain radii. Initially the behaviour\nof the vortex is roughly that of a damped, elastic mode, the quasi-mode. The damping\narises from the tail of the Gaussian vortex and limits the response to the external random\nstrain, giving the effective diffusivity plotted in figure 1(a), with a peak around r ' 4.\nThis peak has the effect of flattening the profile around r ' 4 by diffusion, leading to less\ndamping of the quasi-mode and so further enhancement of the effective diffusivity (the\npeak also moves inwards because of the modified profile). This process rapidly diffuses\nthe vorticity out from the edge of the vortex, to leave a sharp-edged vortex and high\neffective diffusivity outside. We can characterise this final state as a coherent vortex with\n10 M.R. Turner, A.P. Bassom & A.D. Gilbert\na very clear edge, surrounded by what is described as a ‘surf zone’ of enhanced diffusion\n(McIntyre & Palmer 1984).\nAs we reduce δ, increasingly fine scale structure appears in our runs. In figures 2(b,c)\nwe see a more complex picture emerging, in which the profile develops fine scale steps\ninitially (with outgoing ripples), followed by merger. Where the profile is flat the effec-\ntive diffusivity takes very large values, and where the profile shows sharp gradients, the\ndiffusivity is suppressed. We can think of the vertical regions as barriers, where reduced\ndiffusion inhibits transport, surrounding well-mixed regions. We note that there appears\nto be a limited range of radii where steps form initially, for the smaller values of δ used.\nThe reason for this became apparent in studying the BLSY model, and we give numerical\nresults for this in the next section, with some analytical justification in appendix C. In\nthe BLSY model with δ = 0, there is a range of radii for which a fine scale instability\ncan occur: a weak small-scale perturbation, wave number k \u001d 1, on the vorticity profile\nhas a growth rate proportional to k2. This effect, which is natural given the flattening\nprocess described above, gives results sensitive to grid scale, no matter what the numer-\nical scheme. The same effect appears to occur for the evolution of the Gaussian vortex\nand is the reason for the introduction of the smoothing parameter δ.\nWe stress that our results are dependent on the choice of the smoothing parameter, and\nthis requires some discussion and interpretation. Certainly introducing a smoothing effect\nin this way is not ideal, and the instabilities observed strictly show that the multiple scale\nframework is breaking down, the separation of time scales being lost. However smoothing\nthe distribution of κ is physically natural. The point is that in our weakly nonlinear\nframework there is no mechanism to saturate the response to an external frequency if\nthe vortex profile develops a neutral normal mode. However in the original unscaled\nproblem nonlinearity will step in and limit the excursions of fluid particles. In fact if a\nvortex is subjected to a single frequency p for a long time, there follows the development\nof cat’s eyes of a width ε1\/2 in the vortex profile. This is the width of the resonance,\nlimited by the local gradient of angular velocity (which incidentally does not generate the\nsame fine scales as the vorticity profile). It is thus natural to limit κ to be smooth over\nscales δ = O(ε1\/2). Similarly the diffusivity is dimensionally LU = O(ε3\/2) for motion\nacross a cat’s eye of width L = O(ε1\/2) with velocity U = O(ε): however this is on the\nshort t time scale and corresponds to a limit κ = O(ε−1\/2) on the long τ time scale.\nIn short it is natural to introduce a parameter δ of order ε1\/2 and to use it to smooth\nthe effective diffusivity over scales δ and cap at values δ−1. We normalise by the scalar\ndiffusivity in order not to cap the algebraic growth of κ for large r, which is reasonable\nas this is the true effect of random strain, with its growing velocity field as r → ∞. As\nwe do not have any more systematic way to estimate δ and its dependence on radius and\ntime, we have taken it to be constant for each run and explored the consequences as it\nis reduced. Finally we note that while smoothing κ over scale δ is crucial as it limits the\nscale of the formation of steps, capping the value of κ is less important. A number of\nways of doing this (including not doing so) were explored, and gave results that are very\nsimilar: the choice only changes just how flat the vorticity steps are, not their formation\nnor their merger and the stripping at the vortex edge.\n3. Random strain in the BLSY model\n3.1. Analytical development\nFor the Gaussian vortex we observed a clear range of radii where the effective diffusivity\nis enhanced, and where steps in the profile emerge and merge. The core of the vortex\nRandomly strained two-dimensional vortices 11\n(for example 0 ≤ r ≤ 2) is relatively unscathed. This suggests exploiting an asymptotic\nframework in which a simplified model is used for the vortex core. Fortunately such a\nframework exists and is derived in BLSY. The starting point is a compact vortex, for\nexample a Rankine vortex, with vorticity strictly zero at some radius, the edge of the\nvortex. The vortex is assumed to support a neutral, normal mode whose critical layer,\nwhere fluid particles co-rotate with the mode, lies at a radius rc which is outside the\nvortex. The model consists of an ODE for the complex amplitude ϕˆ(t) of the normal\nmode and a PDE for the evolution of weak vorticity ζ in the thin critical layer about the\nradius rc. This model captures at a qualitative level many phenomena that can occur\nin a Gaussian vortex subject to external strain fields: the ODE models the e±imθ wave-\nlike distortions of the central core, while the PDE captures the formation of cat’s eyes\nand mixing of vorticity on the periphery. The two are coupled: the normal mode creates\nmixing in the layer, and mixing of vorticity can feed back to stabilise or destabilise the\nnormal mode.\nThe governing equations for the forced BLSY model are\n∂tζ + y∂θζ + ∂y(y + ζ)∂θϕ = 0, (3.1)\ni∂tϕˆ = εq(t) + P\n∫ ∞\n−∞\ndy\n∮\ndθ\n2pi\nζe−imθ, (3.2)\nϕ(θ, t) = ϕˆ(t)eimθ + c. c. . (3.3)\nWe refer the reader to BLSY for a derivation and detailed description and only note here\nthat in (3.1) y is a scaled inwardly pointing radial coordinate with y = 0 corresponding to\nthe centre of the critical layer. The vorticity in the layer is y+ζ(y, θ, t), and is transported\nin the angular velocity of the vortex, the y∂θζ term, and because of radial motion from\nthe normal mode via the term involving the flow ∂θϕ. This flow is simply linked by (3.3)\nto the amplitude ϕˆ(t) of the normal mode, governed by the ODE (3.2). In this equation\nthe weak external random flow εq(t) is present, plus a feedback from the vorticity in the\ncritical layer involving a principal value integral over y.\nWe exploit the limit ε → 0 by introducing a long time scale τ = ε2t, and a weakly\nnonlinear expansion\nζ(y, t, τ) = ζ(y, τ) + εζˆ(y, t, τ)eimθ + c. c.+ · · · . (3.4)\nReplacing ϕˆ by εϕˆ, on the fast t time scale we have the system\n∂tζˆ + imyζˆ + (1 + ∂yζ)imϕˆ = 0, (3.5)\ni∂tϕˆ = q + P\n∫ ∞\n−∞\ndy ζˆ. (3.6)\nThis gives advection of vorticity fluctuations on a mean, background distribution y + ζ\nthat depends on y but does not vary on the short time scale t. On the longer τ time scale\nwe have a conservation equation for the mean profile\n∂τζ + ∂yF = 0, F = 2m Im〈ζˆϕˆ∗〉. (3.7)\nHere the brackets denote both an average over t as well as an ensemble average over the\ndistribution of random flow amplitude q(t). From now on we drop the hats from fluctu-\nating quantities; we shall also not stress the dependence on τ of the various quantities in\nthe problem.\nOur plan is to solve the fluctuating problem (3.5–3.6) for ζ and ϕ with any background\nmean profile ζ, and then isolate the flux F in (3.7) to give a diffusion equation for this\n12 M.R. Turner, A.P. Bassom & A.D. Gilbert\nprofile on the long time scale. Using (2.11), (3.5) and (3.6) in Laplace transform space\nbecome\n(−ip+ imy)ζ˜ + im(1 + ∂yζ)ϕ˜ = 0, (3.8)\npϕ˜ = q˜ + P\n∫ ∞\n−∞\ndy ζ˜, (3.9)\nand are solved straightforwardly (with zero initial conditions) so that\nζ˜(p) = K(y, p)M(p) q˜(p), ϕ˜(p) = M(p)q˜(p), (3.10)\nwhere\nK(y, p) =\n1 + ∂yζ(y)\np\/m− y , L(p) = P\n∫ ∞\n−∞\ndyK(y, p), M(p) =\n1\np− L(p) . (3.11)\nHere the principal value integral for L(p) refers to the limit y → ±∞, but in addition we\nneed to note that the contour Γ sits above the real axis, and when brought down meets\na pole at p = my from the definition of K(y, p). We can extract the integral over the\nsingular component (1 + ∂yζ(p\/m))\/(p\/m− y) and evaluate this exactly for p above the\nreal axis. There is then no obstruction to bringing the contour Γ down to the real axis,\nin other words making p real. Writing L = Lr + iLi in terms of real and imaginary parts\nwe have\nLr(p) = −P\n∫ ∞\n−∞\ndy\n∂yζ(y)− ∂yζ(p\/m)\ny − p\/m , Li(p) = −pi(1 + ∂yζ(p\/m)). (3.12)\nThis solution may seem rather formal but given a profile ζ(y), L and M are easily\nobtained numerically for any real value of p. Note that if the vorticity gradient is a\nconstant, ζ(y) = 0, then L(p) = −ipi. This gives a simple pole in\nM(p) = (p+ ipi)−1 (3.13)\nat p = −ipi which is used in the formula (3.16) below. This pole corresponds to the quasi-\nmode damping rate e−ipt = e−pit (as in BLSY). For more general profiles a computation\nof M(p) will give the damping rate for quasi-modes (e.g., Hall, Bassom & Gilbert 2003).\nGiven this solution it is now just a question of computing the average 〈ζˆϕˆ∗〉 that gives\nthe flux F in (3.7). This calculation is described in appendix A: the result is that the\nvorticity ω = y + ζ(y, τ) in the layer is governed by the diffusion equation for ζ,\n∂τζ + ∂yF = 0, F (y) = −κ(y)∂y(y + ζ), (3.14)\nwith diffusivity\nκ∗(y) = m2|M(p)|2w(p), p ≡ my. (3.15)\nHere we have the weight function w(p) from (2.5) or (2.6) and the quantity M(p) which\ngives the response of the vortex to frequency p and is determined by an integration (see\n(3.11)) over the vorticity distribution in the layer: as a result the diffusivity depends\nnonlinearly and non-locally on the profile y + ζ(y). At τ = 0 with a uniform gradient\ninitially, ω = y, we have\nκ∗(y) = m2(m2y2 + pi2)−1w(p), (3.16)\nand this is shown in figure 1(b) (for w(p) ≡ 1). This is analogous to the peak in the curve\nin 1(a), confirming that the BLSY framework should model the transport in the tail of\nthe Gaussian vortex. As in the Gaussian case, we cap and smooth κ∗ using a parameter\nRandomly strained two-dimensional vortices 13\n(a)\n(b)\nFigure 4. Evolution in the BLSY model with smoothing (a) δ = 0.05 and (b) δ = 0.01. The\ncurves show a sequence of vorticity profiles ω = y+ζ (left panels) and effective diffusivities log κ\n(right panels), plotted against y. In each panel the curves are separated by additive constants\nand given for τ = 0, 0.1, 0.2, etc., reading up the curves.\nδ to obtain κ, with\nκ = GδFδ(κ∗), (3.17)\nWe again have in mind linking δ to the quantity ε1\/2, where ε\u001c 1 is the strength of the\nforcing. (Note that in this case we have not normalised by a scalar diffusivity as there is\nno power law growth with increasing y.)\n3.2. Numerical results\nFigures 4 and 5 show numerical results for simulations of the diffusion equation (3.14)\nand (3.15) with M(p) computed as detailed in (3.11) and (3.12) below. Figure 4 (left)\nshows vorticity profiles analogous to those of ω in the left panels of figure 2, bearing\nin mind that y increases radially inwards. The corresponding effective diffusivities are\nshown in the right panels of the two figures. There are strong similarities between the full\nevolution of the Gaussian initial condition and the simplified BLSY model, confirming\nthe usefulness of the model in capturing many phenomena at a qualitative level. The\nBLSY system shows the development of a vorticity staircase. The flattened regions are\ncharacterised by strongly enhanced diffusivity: in between there are transport barriers,\nwhere the reduced diffusivity allows high gradients to persist.\nThe butterfly diagrams in figure 5 are analogous to those in figure 3 for the Gaussian\ncase. Again we see many similarities: steps are formed and merge, and there are also\nripples at the edge, moving towards the origin y = 0, particularly visible in 5(c,d),\nand seen in the Gaussian case in figure 3. Of course there are also differences, and we\nstress that the BLSY model is not an asymptotic approximation to a Gaussian vortex\nso comparisons are only qualitative. The key difference appears to be that in the BLSY\nmodel the critical layer is embedded in an infinitely wide vorticity gradient, on the\nappropriate small scale y, as is clear in figure 4. The gradient traps the vorticity staircase,\n14 M.R. Turner, A.P. Bassom & A.D. Gilbert\n(a)\n(b)\n(c)\n(d)\n(e)\nFigure 5. Space-time diagram of the evolution of the perturbation vorticity gradient ∂yζ(y, τ)\n(left panels) and the effective diffusivity κ(y, τ) (right panels), plotted in grey scales in the\n(τ, y)-plane for (a) δ = 0.2, (b) δ = 0.1, (c) δ = 0.05, (d) δ = 0.02 and (e) δ = 0.01. The\ngrey scale coding is capped at the level of 4, corresponding to black; zero is white. The ranges\nare −2 ≤ y ≤ 2 (vertical) and in the horizontal, (a) 0 ≤ τ ≤ 4 and (b) 0 ≤ τ ≤ 2 and (c–e)\n0 ≤ τ ≤ 1.\nRandomly strained two-dimensional vortices 15\n(a)\n(b)\nFigure 6. As in figure 5 for δ = 0.005 and (a) short times 0 ≤ τ ≤ 0.025 and (b) moderate\ntimes 0 ≤ τ ≤ 0.25.\nwhile the effective diffusivity κ(y) drops away on either side (figure 1(b)). This matches\nthe behaviour for the Gaussian vortex around r = 4, but there the random strain field\ntakes over for increasing radii and the effective diffusivity increases, as seen in figure 1(a).\nThis tends to make the Gaussian picture asymmetrical, and allows vorticity to be stripped\nto infinity, not possible in the BLSY model. (Note that there is some symmetry breaking\nin the numerical runs in figure 5: the mathematical problem is strictly symmetric in y,\nbut instabilities soon break this, whether seeded by rounding or truncation error, or by\ninitialising ζ with weak noise, as we do.)\nWe observe from figure 5 that as the smoothing parameter δ is reduced we obtain finer\nscales in the problem, and a more rapid onset of the growth of steps, over a very clearly\ndefined range of y values. To see this clearly figure 6 shows a run with δ = 0.005, the\nsmallest value used, with evolution over a short time interval in (a) and over a longer\ninterval in (b). Over the short time we see a rapid growth of fine scale structure and waves\n(limited by the value of δ); these form finely spaced steps which then show a merger\nprocess, over both short times in (a) and longer times in (b). The initial development\nat first suggests a ‘negative diffusion’ type instability with a growth rate increasing\nwith wave number k of the initial fluctuations, perhaps as O(k2). For example this is\nreminiscent of the Cahn–Hilliard equation where diffusion with a negative diffusivity is\ncontrolled on the smallest scales by a fourth derivative: fine structure develops initially\nand then scales increase as phase separation occurs and domains merge. However in our\nsimulations κ(y) ≥ 0 at all times, and also κ(r) ≥ 0 in the Gaussian case. The initial\ndevelopment of fine structure arises through the term (∂yκ)∂y(y + ζ), from expanding\nthe diffusive term ∂y(κ∂y(y + ζ)) in (3.14) as we now explain.\nSuppose we start a linear vorticity profile ω = y in the BLSY model, and add on a\nweak fine scale vorticity distribution ζ(y) = µ sin ky with µ \u001c 1 and k \u001d 1. Now the\ncorresponding κ will also be perturbed from (3.16) with a component of magnitude µ\nand wave number k. By calculating this it can be shown that at a point y the original\ndisturbance will have a local growth rate of\nγ(y) ' k2m2(m2y2 + pi2)−2w(my)(pi2 −m2y2), (3.18)\nand so the disturbance grows with a growth rate proportional to k2 (similar to a ‘negative\n16 M.R. Turner, A.P. Bassom & A.D. Gilbert\n+\n+\n− −\n+\n+\n−\n−\nexternal\nstep\nstrain\nvortex core\n(a) (b) (c)\nFigure 7. Schematic of process of quasi-mode damping suppressing mixing in the vertical part\nof a vorticity step, as described in the text.\ndiffusivity’ instability but without κ changing sign) in the band y ≤ pi\/m. The range of y\nfor which modes are predicted to grow is consistent with the emergence of fine scales in\nfigures 5 and 6; for example the latter figure shows an absence of fine scales outside the\nrange y . 1.4, to be compared with the prediction y < pi\/2 ' 1.57. This band is perhaps\na little narrower than the range indicated from theory, presumably because of nonlinear\neffects that will occur most quickly at the centre, but have a wider influence.\nThis calculation is detailed in appendix C. We believe this also gives an interpretation\nfor the formation of ever finer scales in the Gaussian vortex as δ → 0, and think it is\nlikely that there is a range of radii at which this can occur. It would be interesting to\ndetermine the range, but we do not know how to do this.\n4. Discussion\nWe have investigated the evolution of a coherent two-dimensional vortex subjected\nto weak, external, random strain, both starting with a Gaussian vortex and using the\nBLSY asymptotic model of compact vortex core and weak vorticity skirt. Averaging over\nthe external random strain allowed us to write down a diffusion equation for the mean\nvorticity profile. The effective diffusivity is linked explicitly to the stability properties of\nthe profile: although the link is nonlinear and non-local, it can be calculated to give the\ndiffusivity as a function of radius for any given vorticity profile.\nWe then time-stepped this diffusion equation to attempt to understand the coupling\nbetween mixing of vorticity and the vortex response for axisymmetric flow starting with\na Gaussian vortex and for the BLSY model. We have found that the dynamical response\ngives similar features in both cases with the generation of fine scale steps forming a\nvorticity staircase. In the flat regions of the steps the effective diffusivity is large, while\nin between small values of the effective diffusivity allow high gradients of vorticity to\npersist and form transport barriers. Merger processes tend to reduce the number of\nsteps, and in the Gaussian case we find that vorticity is stripped to infinity, leaving a\nsharp edged vortex. Surrounding this is a region where the effective diffusivity is large.\nMuch of what we see in the Gaussian case is reproduced in the BLSY model, which\nallowed us both to pursue higher numerical resolutions, and to understand the initial\ndevelopment of fine scales. In addition we can give a heuristic description of how the\nsharp vertical parts of steps are maintained in the profile, shown in figure 7 (see also\nHall, Bassom & Gilbert 2003). It amounts to the fact that there is damping of quasi-\nmodes (corresponding to a normal mode on the vortex core) in the presence of a vorticity\nRandomly strained two-dimensional vortices 17\ngradient at the appropriate critical radius. In figure 7(a) there is external rotating strain,\nfrequency p, acting on a vortex core surrounded by a co-rotating vertical vorticity step\nat r with p = mα(r). The external strain distorts the step into an ellipse in (b), creating\nthe +\/− vorticity anomaly and flow shown. This distorts the vortex core giving the\nsecondary vorticity anomaly and flow indicated in (c), which has the effect of countering\nthe original external strain and restoring the step to circular form. Thus an external\nfrequency that is tuned to mix vorticity in the vertical part of the step is damped and\nmixing suppressed. For a frequency that corresponds to a flat part of a step and a low\ngradient at the critical radius, no vorticity anomaly is created and so there is no damping\nmechanism.\nThe development of vorticity staircases and inhomogeneous mixing is mirrored in obser-\nvations and simulations of geophysical flows. For example, simulations of Norton (1994)\nand Waugh & Plumb (1994) of stratospheric polar vortex dynamics indicate a coherent\nvortex core, undergoing significant distortions (greater than in our study), surrounded\nby a ‘surf zone’ of breaking Rossby waves (McIntyre & Palmer 1984). Such sharp edged\nvortices can also be generated by the process of vortex stripping (e.g., Mariotti, Legras\n& Dritschel 1994), where the flow generates a hyperbolic separatrix at the edge of the\nvortex, which erodes vorticity on a very rapid time scale. The stripping we see, which\nleaves a sharp edge in simulations of the Gaussian vortex, is in some ways a milder\nprocess, as it results from the accumulation of weak random external strain over a long\ntime scale: nonetheless it too results from the algebraic growth of the random strain field\nwith radius. Steps in potential vorticity fields are also seen in atmospheric data; see for\nexample Dritschel & McIntyre (2008), who review observations, discuss physical mecha-\nnisms and present numerical simulations. Here the vorticity gradients in our models are\nreplaced by a background vorticity gradient or β-effect, which governs jet width scaling in\ngeophysical problems. Banded structures are seen in giant gaseous planets, most notably\nJupiter and Saturn, and emerge in simulations of randomly forced spherical shallow wa-\nter models and in convective deep models (Rotvig & Jones 2006; Scott & Polvani 2007;\nHeimpel & Aurnou 2007). It would be interesting to extend the present study to derive a\ndiffusion equation for fluid motions on a sphere for a two-dimensional fluid or a shallow\nwater system, building on the weakly nonlinear study of Garaud (2001), who followed\nthe effects of shear stability in flows relevant to the solar tachocline.\nThe weakest part of our study is the necessity to introduce a smoothing (and capping)\nof the effective diffusivity, via the parameter δ. This is forced upon us by the presence\nof instabilities of arbitrarily rapid growth rate, on the long time scale. These would in\npractice be controlled by nonlinearity on the short time scale, which is not present in our\nanalysis, nor are we aware of any easy way in which to incorporate it. The next step is\nto see whether full simulations of randomly forced vortices, with nonlinearity, reproduce\nthe results seen here and to see how far our assumptions of weak external forcing, and\nconsequent evolution of the profile on a long time scale, may be relaxed. Also, because we\ncannot justify the form of the smoothing and capping parameter δ, we have not explored\nthe very long time limit τ →∞: we expect mergers of steps in the two models to occur,\nover increasingly lengthy time scales, leaving a step-less compact vortex in the Gaussian\ncase. This would be interesting to explore in a full numerical model.\nA further direction of research would be in understanding the nature and role of the\nexternal forcing q(t) and its weight function w(p) in more realistic flows. For example\nin two-dimensional turbulence the irrotational flows of magnitude ε generated by other\nvortices would vary on a slow time scale of order εt, corresponding to a peak of w(p) at\nthe corresponding frequencies. The effects we have discussed would then come from the\nhigh frequency tail of this peak: although w(p) would fall off, the dynamics of the vortex\n18 M.R. Turner, A.P. Bassom & A.D. Gilbert\ntends to amplify the effects of frequencies p which interact with the quasi-mode, i.e. via\nthe resonant peak seen in figure 1(a), and pick out the frequencies that give mixing and\nstep formation at the periphery of the vortex on a the slower ε2t = τ time scale. This\nwould again be best studied by means of numerical simulations.\nAppendix A. Feedback on the mean profiles\nHere we discuss the feedback from the fluctuations on the mean profiles, firstly in\nthe BLSY case, and then in the axisymmetric (initially Gaussian) case. These require\nthe calculation of F in (3.7) and (2.10) respectively. To handle complex conjugation in\nthe Laplace transform framework we proceed as follows; note that we always keep the\ncoordinates r or y and time t real in our analysis. Given a complex analytic function f(z)\nwe define another one, f∗(z), by\nf∗(z) = (f(z∗))∗ (A 1)\nwhereupon we have\nf˜∗(p) =\n∫ ∞\n0\ndt e−iptf∗(t), f∗(t) = − 1\n2pi\n∫\nΓ′\ndp eiptf˜∗(p), (A 2)\nwhere Γ′ goes from +∞ to −∞ below all the singularities of f˜∗(p) and so is at the outset\nthe mirror image in the real axis of the contour Γ.\nFor the random amplitude q(t) of the forcing, we will need\n〈q˜(p)q˜∗(p′)〉 =\n∫ ∞\n0\ndt\n∫ ∞\n0\ndt′ 〈q(t)q∗(t′)〉 ei(pt−p′t′), (A 3)\nwhich in the delta correlated case (2.5) is\n〈q˜(p)q˜∗(p′)〉 = i(p− p′)−1, (A 4)\nand in the exponential case (2.6) is\n〈q˜(p)q˜∗(p′)〉 = a\n2\n(p′ −mb)2 + a2\ni\np− p′ +\na\n2(p′ −mb+ ia)(p−mb+ ia) . (A 5)\nA.1. BLSY model\nThe feedback onto the mean profile in the BLSY model in (3.7) is governed by 〈ζ(y, t)ϕ∗(t)〉\nand we have\n(−2pi)2ζ(y, t)ϕ∗(t) = (1 + ∂yζ)\n∫\nΓ\ndp\n∫\nΓ′\ndp′\ne−i(p−p\n′)t\np\/m− y M(p)M\n∗(p′) q˜(p)q˜∗(p′), (A 6)\nby (2.11), (A 2), (3.10) and (3.11). For our purposes we need to assume that M(p) is\nanalytic except for singularities S in a set bounded below the real axis. The distance\n∆ = ∆(τ) of S below the real axis, that is the width of the analyticity strip of M(p),\nwill generally decrease with τ as the vorticity profile evolves, and the theory breaks\ndown if ∆(τ) becomes zero: this is in fact what happens in the simulations, and why\nwe have to adopt a smoothing for the resulting large values of the diffusivity, modelling\nnonlinear saturation of the mixing. Although we have to adopt this ad hoc procedure for\nthe simulations, we set out the theory with the assumption that the profile at the given\ntime τ is stable, that is ∆(τ) > 0.\nRandomly strained two-dimensional vortices 19\np’\np\nmy\nS*\nS\n’\nFigure 8. Schematic picture of contours Γ and Γ′ in the complex plane, discussed in the text.\nEnsemble averaging and substituting the correlation function (A 4) for the delta cor-\nrelated case gives\n(−2pi)2〈ζ(y, t)ϕ∗(t)〉 = (1 + ∂yζ)\n∫\nΓ\ndp\n∫\nΓ′\ndp′\ne−i(p−p\n′)t\np\/m− y\ni\np− p′ M(p)M\n∗(p′). (A 7)\nFigure 8 depicts the contours Γ and Γ′ in the complex plane together with the singularities\nS of M(p) below the real axis, and singularities S∗ of M∗(p′) above. We close the Γ′\ncontour in the upper half plane using the exponential decay of eip\n′t there. This encloses\nthe pole p′ = p (but no pole at my) and any other singularities S∗ of M∗(p′). We can\nignore the effect of S∗ as singularities contribute only exponentially decaying terms,\ndecaying at least as e−∆(τ)t, that disappear on the fast time scale. In other words we are\nimplicitly averaging the right-hand side over the fast time scale, although we have not\nput in angled brackets for reasons of readability. We are left with\n(−2pi)〈ζ(y, t)ϕ∗(t)〉 = (1 + ∂yζ)\n∫\nΓ\ndp\n1\np\/m− y M(p)M\n∗(p). (A 8)\nWe note that we in fact only require the imaginary part to form the flux F in (3.7).\nTo deal with this integral, we bring the contour down to lie along the real axis, except\nat the pole p = my. On the real axis, since\nM(p)M∗(p) = |M(p)|2 for p real (A 9)\nfrom (A 1), we only obtain a real contributions to the integral, which we do not need. In-\ntegrating anti-clockwise around the semicircle above the pole p = my leaves an imaginary\ncontribution of ipi times the residue to give\n(−2pi) Im〈ζ(y, t)ϕ∗(t)〉 = (1 + ∂yζ)pim|M(my)|2. (A 10)\nThis yields the flux and effective diffusivity\nF = −κ(y)(1 + ∂yζ), κ(y) = m2|M(my)|2. (A 11)\nThe calculation is similar for the exponential correlation function (2.6) with (A 5) and\nintroduces the factor w(p) into (3.15).\nWe present an alternative derivation of the result for κ(y): we need this so that we\ncan proceed more swiftly in the case of an axisymmetric case next. We start with the\n20 M.R. Turner, A.P. Bassom & A.D. Gilbert\ncomplex conjugate version of (A 6), which is, after substituting the correlation function\n(A 4),\n(−2pi)2〈ϕ(y, t)ζ∗(t)〉 = (1 + ∂yζ)\n∫\nΓ\ndp\n∫\nΓ′\ndp′\ne−i(p−p\n′)t\np′\/m− y\ni\np− p′ M(p)M\n∗(p′), (A 12)\nand close the p′ contour in the upper half plane. Now we pick up the residues from the\npoles at p′ = p and at p′ = my in figure 8; the result can be written as\n(−2pi)〈ϕ(y, t)ζ∗(t)〉 = (1 + ∂yζ)\n∫\nΓ\ndp\nM(p)M∗(p)\np\/m− y\n(\n1− M\n∗(my)\nM∗(p)\ne−i(p−my)t\n)\n. (A 13)\nThis integral has a removable singularity at p = my and the integration contour may be\nmoved to lie entirely along the real axis! However we remember that we only require the\nimaginary part of this expression and that we are implicitly averaging over time. Except\nwithin an O(t−1) neighbourhood of p = my the exponential averages to zero to leave a\nquantity that is purely real and so can be discarded. The imaginary part of the integral\ncomes only from this neighbourhood and is at leading order\n(−2pi) Im〈ϕ(y, t)ζ∗(t)〉 = −(1 + ∂yζ)|M(my)|2\n∫ my+T\nmy−T\ndp\nsin((p−my)t)\np\/m− y , (A 14)\nwhere we have set t−1 < T \u001c 1 and reversed the contour direction. The integral here is\nmpi at leading order, and so the result is in agreement with (A 10).\nA.2. Axisymmetric flow\nWe now turn to the axisymmetric case in which the feedback on the mean profile in\n(2.10) involves\n(−2pi)2〈ψ(r, t)ω∗(r, t)〉 =\n∫\nΓ\ndp\n∫\nΓ′\ndp′M(r, p)N∗(r, p′)\ni\np− p′ e\n−i(p−p′)t, (A 15)\nfor the delta correlated case. For each value of p we close the p′ contour. The situation is\ndepicted in figure 8, if my is replaced by mα(r). From (2.15) with p′ = mα(s′) replacing\np there is a pole singularity in N(r, p′) as now p′ varies, which takes the form\nN(r, p′) = −C(mα(r))mβ(r)(mα(r)− p′)−1 + · · · (A 16)\n(using the definition of µ(r) below (2.17)). After picking up the residues from the two\npoles p′ = p and p′ = mα(r) of the p′ integration we are left with\n(−2pi)〈ψ(r, t)ω∗(r, t)〉 =\n∫\nΓ\ndpM(r, p)\n(\nN∗(r, p)− mβ(r)C\n∗(mα(r))\np−mα(r) e\n−i(p−mα(r))t\n)\n.\n(A 17)\nThe argument then follows that for the BLSY model after equation (A 13). The singu-\nlarity at p = mα(r) is removable and so we can deform the Γ contour to the real axis\nand reverse its direction. Away from p = mα(r) the exponential averages to zero, and\nthe product M(r, p)N∗(r, p) is real (as ψ˜ is a real multiple of ω˜ in (2.12)). In the O(t−1)\nneighbourhood of p = mα(r) only, there is a contribution to the imaginary part, leaving\n2pi Im〈ψ(r, t)ω∗(r, t)〉 = pimβ(r)|C(mα(r))|2. (A 18)\nThe resulting flux can be written as\nF = −κ(r)∂rω, κ(r) = m2r−2|C(mα(r))|2. (A 19)\nRandomly strained two-dimensional vortices 21\nSimilarly, for advection of a passive scalar we instead solve\n∂tσ + imασ = −imβψ = −imβrmq(t), (A 20)\nwhere α(r) is the angular velocity of a given flow field and β = r−1∂rσ to obtain (2.20).\nAppendix B. Numerical methods\nThe diffusion equation for the BLSY system\n∂τζ = ∂y(κ(y)∂yζ), (B 1)\nwith (3.11) and (3.15), was simulated numerically using a simply constructed code, sec-\nond order in space and time, in which the variable y is discretised with N points yj\nin the interval [−Y, Y ]. We use a corresponding grid of points pj = myj in the interval\n[−mY,mY ] where Y is chosen to be large enough to capture all the interesting behaviour\nin ζ. We set up the initial conditions and add very weak random noise to the vorticity\nvalues (at a level of 10−6) to trigger instabilities (otherwise these are generated by round-\ning or truncation error and so dependent on machine precision or choice of grid and time\nstep). The process is then as follows.\nWe evaluate ∂yζ at points yj on the grid using finite differences and then L(p) at the\ngrid points pj using (3.12) with Lr(p) written as\nLr(p) = −\n∫ Y\n−Y\ndy\n∂yζ(y)− ∂yζ(p\/m)\ny − p\/m + ∂yζ(p\/m) log\n∣∣∣∣Y + p\/mY − p\/m\n∣∣∣∣ . (B 2)\nFrom this we compute κ∗ at the gridpoints yj from (3.15) and (3.11). We cap and smooth\nκ∗ to give κ according to (3.17).\nThe mean profile is then stepped in time using a modified Crank–Nicolson method.\nStarting with the current field at time t = k∆t, this method would usually involve\nsolving nonlinear equations for the future field σ and the diffusivity κ at time t + ∆t.\nHowever as the diffusivity is a complicated functional of the field this is not practical.\nThus the method is combined with a predictor–corrector step: the present diffusivity is\nheld constant while the field alone is stepped from t to t + ∆t. This gives an estimate\nof the future field, from which an estimate of the future diffusivity may be computed\nand finally used to take another Crank–Nicolson step for the field from t to t + ∆t.\nThis process can be iterated, but tests indicate that two steps (one to estimate the\ndiffusivity and one to step the field) are sufficient. In figure 5, parameter values used are\n(a) (N,Y,∆t) = (8000, 10, 5 × 10−4), (b) (N,Y,∆t) = (16000, 10, 2 × 10−4) and (c,d,e)\n(N,Y,∆t) = (32000, 10, 10−4), and for figure 6 (N,Y,∆t) = (32000, 6, 2.5× 10−5).\nFor the full, Gaussian problem, a similarly structured code was written to time step\nthe diffusion equation\n∂τω = r−1∂r(rκ(r)∂rω), (B 3)\nwith κ given in (2.19) and C(p) in (2.12–2.17). The code starts with ω known on a radial\ngrid rj with N points from 0 to R. The quantities pj = α(rj) and β(rj) are calculated\nusing a cubic spline fit while for each grid point rj the code computes C(pj) as follows.\nWe let h be a small positive numerical parameter and interpolate the relevant functions\nonto a finer grid with M points, M \u001d N . The ODE (2.12) is integrated from r = h using\nψ˜(h, p) = hm and ∂rψ˜(h, p) = mhm−1 to r = rj − h using a fourth order Runge–Kutta\nscheme. The solution is then stepped over the critical point, from rj − h to rj + h, using\nthe jump conditions from (2.16), (2.17), namely\n[ψ˜]+− = 0, [∂rψ˜]\n+\n− = iχµ(rj)ψ˜(rj) (B 4)\n22 M.R. Turner, A.P. Bassom & A.D. Gilbert\n(in our case χ = −pi) and finally integrated out to R where ψ˜ ∝ rm. The solution is then\ndivided throughout by the (complex) constant of proportionality so as to satisfy (2.13)\nand the remaining value of ψ˜ at r = rj is then just C(pj). Note that a check on this part\nof the code exists: solutions obtained for a Gaussian mean profile are given in figure 3 of\nLe Dize`s (2000).\nOnce the code has C(pj) for each radius rj , it may evaluate κ(rj), smooth it and\nstep the mean profile ω by applying the modified Crank–Nicolson scheme used for the\nBLSY model, with a no-flux condition for the vorticity at the origin and a zero vorticity\nboundary condition at r = R. For the simulations shown in figures 2 and 3, parameter\nvalues used are (N,M,R, h) = (4000, 24N, 10, R\/M) and (a) ∆t = 10−4 and (b,c) 10−5.\nAppendix C. Instability in the BLSY model\nWe initially ran the code for the BLSY model with no smoothing δ = 0 and found\nthat the results depend strongly on numerical method, time-step and grid resolution. We\nwere led to consider the evolution of weak, small scale perturbations on a profile and\nto what extent these may be amplified or suppressed by their effect on κ. Consider a\nsmooth mean profile ζ(y) which is perturbed to\nζ(y) + ∆ζ(y) ≡ ζ(y) + µ sin ky, (C 1)\nwith µ\u001c 1 and k \u001d 1. We linearise retaining only terms of order µ, and it is convenient\nto use ∆ to denote the change in a quantity to this order. The perturbation above will\nsatisfy\n∂τ ∆ζ = ∆κ ∂2yζ + κ∂\n2\ny ∆ζ + (∂y ∆κ)(1 + ∂yζ) + (∂yκ)(∂y ∆ζ). (C 2)\nNow we have from (3.12),\n∆Lr(p) = piµk sin kp\/m, ∆Li(p) = −piµk cos kp\/m, (C 3)\nand also with p ≡ my from (3.15)\n∆κ(y) = −m2|M(p)|4w(p)(−2(p− Lr(p)) ∆Lr(p) + 2Li(p) ∆Li(p)), (C 4)\nwhich amounts to\n∆κ(y) = 2piµkm2|M(my)|4w(my)[(my − Lr(my)) sin ky + Li(my) cos ky]. (C 5)\nNow consider the four terms on the right hand side of (C 2). The first term, say (C 2-i),\nand the fourth term (C 2-iv) are of order k only, and can be neglected in comparison with\nterms of order k2. The second term (C 2-ii) is\nκ∂2y ∆ζ = −µk2κ sin ky, (C 6)\nwhich is the usual diffusion of the perturbation, while the third term (C 2-iii) involves\nthe leading, order k2 quantity\n∂y ∆κ ' 2piµk2m2|M(my)|4w(my)[(my − Lr(my)) cos ky − Li(my) sin ky]. (C 7)\nNow plainly the cos ky term here gives wave motion, but the sin ky term can give growth\nor decay. Combining terms from (C 2-ii) and (C 2-iii) gives the (real) growth rate of the\nmode as\nγ = −k2κ− 2pik2m2|M(my)|4w(my)Li(my)(1 + ∂yζ). (C 8)\nUsing the definition of κ from (3.15) and Li from (3.12), this can finally be written in\nRandomly strained two-dimensional vortices 23\nthe form\nγ(y) =\nκ(y)2k2\nm2w(my)\n[\nLi(my)2 − (my − Lr(my))2\n]\n. (C 9)\nThus we have a highly unstable behaviour, with wave number k possessing an order k2\ngrowth rate if this term is positive, i.e. if Li is sufficiently large. For the initial condition\nof a constant gradient ζ ≡ 0 we have Lr = 0, Li = −pi, giving formula (3.18) with\namplification of modes in the range |y| < pi\/m. Note that while the limitations of such a\nlocal theory of instability are well-known, the calculation is instructive as a simple means\nto understand the behaviour seen numerically.\nAcknowledgements\nWe thank the referees for helpful comments which improved the paper. We are grateful\nto the Leverhulme Trust which supported ADG by a Leverhulme Research Fellowship\nduring 2007–08, and to the EPSRC for research grant EP\/D032202\/1, which supports\nMT and annual visits of AB to Exeter. We are pleased to acknowledge useful discussions\nand references from David Dritschel, Ste´phane Le Dize`s and John Thuburn.\nREFERENCES\nBalmforth, N.J., Llewellyn Smith, S.G. & Young, W.R. 2001 Disturbing vortices. J. Fluid Mech.\n426, 95–133. Referred to as BLSY in the text.\nBassom, A.P. & Gilbert, A.D. 1998 The spiral wind-up of vorticity in an inviscid planar vortex.\nJ. Fluid Mech. 371, 109–140.\nBassom, A.P. & Gilbert, A.D. 1999 The spiral wind-up and dissipation of vorticity and a passive\nscalar in a strained planar vortex. J. Fluid Mech. 398, 245–270. Referred to as BG in the\ntext.\nBriggs, R.J., Daugherty, J.D. & Levy, R.H. 1970 Role of Landau damping in crossed-field electron\nbeams and inviscid shear flow. Phys. Fluids 13, 421–432.\nBoffetta, G., del Castillo Negrete, D., Lo´pez, C., Pucacco, G. & Vulpiani, A. 2003 Diffusive\ntransport and self-consistent dynamics in coupled maps. Phys. Rev. E 67 026224, 1–11.\ndel Castillo Negrete, D. 2000a Self-consistent dynamics in the single wave model. Physica A\n280, 10–21.\ndel Castillo Negrete, D. 2000b Self-consistent chaotic transport in fluids and plasmas. Chaos 10,\n75–88.\nDritschel, D.G. & McIntyre, M.E. 2008 Multiple jets as PV staircases: the Phillips effect and\nthe resilience of eddy-transport barriers. J. Atmos. Sci. 65, 855–874.\nGaraud, P. 2001 Latitudinal shear instability in the solar tachocline. Mon. Not. R. Astron. Soc.\n324, 68–76.\nHall, I.M., Bassom, A.P. & Gilbert, A.D. 2003 The effect of fine structure on the stability of\nplanar vortices. Eur. J. Mech. B\/Fluids 22, 179–198.\nHaynes, P.H., Poet, D.A. & Shuckburgh, E.F. 2007 Transport and mixing in kinematically and\ndynamically consistent flows. J. Atmos. Phys. 64, 3640–3651.\nHeimpel, M. & Aurnou, J. 2007 Turbulent convection in rapidly rotating spherical shells: a\nmodel for equatorial and high latitude jets on Jupiter and Saturn. Icarus 187, 540–557.\nLe Dize`s, S. 2000 Non-axisymmetric vortices in two-dimensional flows. J. Fluid Mech. 406,\n175–198.\nMariotti, A., Legras, B. & Dritschel, D.G. 1994 Vortex stripping and the erosion of coherent\nstructures in two-dimensional flows. Phys. Fluids 6, 3954–3962.\nMcIntyre, M.E. & Palmer, T.N. 1984 The ‘surf zone’ in the stratosphere. J. Atm. Terr. Phys.\n46, 825–849.\nNorton, W.A. 1994 Breaking Rossby waves in a model stratosphere diagnosed by a vortex-\nfollowing coordinate system and a technique for advecting material contours. J. Atmos.\nSci. 51, 654–673.\n24 M.R. Turner, A.P. Bassom & A.D. Gilbert\nRotvig, J. & Jones, C.A. 2006 Multiple jets and bursting in the rapidly rotating convecting\ntwo-dimensional annulus model with nearly plane-parallel boundaries. J. Fluid Mech. 567,\n117–140.\nSchecter, D.A., Dubin, D.H.E., Cass, A.C., Driscoll, C.F., Lansky, I.M. & O’Neil, T.M. 2000\nInviscid damping of asymmetries on a 2-d vortex. Phys. Fluids 12, 2397–2412.\nScott, R.K. & Polvani, L.M. 2007 Forced-dissipative shallow-water turbulence on the sphere and\nthe atmospheric circulation of the giant planets. J. Atmos. Sci. 64, 3158–3176.\nShrira, V.I. & Sazonov, I.A. 2001 Quasi-modes in boundary-layer-type flows. Part 1. Inviscid\ntwo-dimensional spatially harmonic perturbations. J. Fluid Mech. 446, 133–171.\nTurner, M.R. & Gilbert, A.D. 2007 Linear and nonlinear decay of cat’s eyes in two-dimensional\nvortices, and the link to Landau poles. J. Fluid Mech. 593, 255–279.\nTurner, M.R. & Gilbert, A.D. 2009 Spreading of two–dimensional axisymmetric vortices exposed\nto a rotating strain field J. Fluid Mech., in press.\nWaugh, D.W. & Plumb, R.A. 1994 Contour advection with surgery: a technique for investigating\nfine scale structure in tracer transport. J. Atmos. Sci. 51, 530–540.\n"}