{"doi":"10.5194\/angeo-21-1807-2003","coreId":"71180","oai":"oai:eprints.lancs.ac.uk:6618","identifiers":["oai:eprints.lancs.ac.uk:6618","10.5194\/angeo-21-1807-2003"],"title":"Coordinated interhemispheric SuperDARN radar observations of the ionospheric response to flux transfer events observed by the cluster spacecraft at the high-latitude magnetopause","authors":["Wild, J. A.","Milan, S. E.","Cowley, S. W. H.","Dunlop, M. W.","Owen, C. J.","Bosqued, J. M.","Taylor, M. G. G. T.","Davies, J. A.","Lester, M.","Sato, N.","Yukimatu, A. S.","Fazakerley, A. N.","Balogh, A.","Rème, H."],"enrichments":{"references":[{"id":16358963,"title":"A ﬂux transfer event observed at the magnetopause by the Equator-S spacecraft and in the ionosphere by the CUTLASS HF radar,","authors":[],"date":"1999","doi":"10.1007\/s00585-999-0707-z","raw":"Neudegg, D. A., Yeoman, T. K., Cowley, S. W. H., Provan, G., Haerendel, G., Baumjohann, W., Auster ,U., Fornac ¸on, K.-H., Georgescu, E., and Owen, C. J.: A ﬂux transfer event observed at the magnetopause by the Equator-S spacecraft and in the ionosphere by the CUTLASS HF radar, Ann. Geophysicae, 17, 707– 711, 1999.","cites":null},{"id":16359002,"title":"A new functional form to study the solar wind control of the magnetopause size and shape,","authors":[],"date":"1997","doi":"10.1029\/97ja00196","raw":"Shue, J.-H., Chao, J.K., Fu, H.C., Russell, C.T., Song, P., Khurana, K. K., and Singer, H. J.: A new functional form to study the solar wind control of the magnetopause size and shape, J. Geophys. Res., 102, 9497–9511, 1997.","cites":null},{"id":16358924,"title":"A simple illustrative model of open ﬂux tube motion over the dayside magnetopause,","authors":[],"date":"1986","doi":"10.1016\/0032-0633(89)90116-5","raw":"Geomag. Geoelectr., 38, 1223–1256, 1986. Cowley, S. W. H. and Owen, C. J.: A simple illustrative model of open ﬂux tube motion over the dayside magnetopause, Planet.","cites":null},{"id":16358944,"title":"A statistical study of dayside pulsed ionospheric ﬂows as seen by the CUTLASS Finland HF radar,","authors":[],"date":"2000","doi":"10.1007\/s00585-000-0445-8","raw":"McWilliams, K. A., Yeoman, T. K., and Provan, G.: A statistical study of dayside pulsed ionospheric ﬂows as seen by the CUTLASS Finland HF radar, Ann. Geophysicae, 18, 445–453, 2000.","cites":null},{"id":16358988,"title":"A survey of dayside ﬂux transfer events observed by","authors":[],"date":"1984","doi":"10.1029\/ja089ia02p00786","raw":"Rijnbeek, R. P., Cowley, S. W. H., Southwood, D. J., and Russell, C. T.: A survey of dayside ﬂux transfer events observed by ISEE 1 and 2 magnetometers, J. Geophys. Res., 89, 786–800, 1984.","cites":null},{"id":16358965,"title":"A survey of magnetopause FTEs and associated ﬂow bursts in the polar ionosphere,","authors":[],"date":"2000","doi":"10.1007\/s00585-000-0416-0","raw":"Neudegg, D. A., Cowley, S. W. H., Milan, S. E., Yeoman, T. K., Lester, M., Provan, G., Haerendel, G., Baumjohann, W., Nikutowski, B., B¨ uchner, J., Auster, U., Fornac ¸on, K.-H., and Georgescu, E.: A survey of magnetopause FTEs and associated ﬂow bursts in the polar ionosphere, Ann. Geophysicae, 18, 416– 435, 2000.","cites":null},{"id":16358927,"title":"A.,: Ground-based observations of the auroral zone and polar cap ionospheric responses to dayside transient reconnection,","authors":[],"date":"2002","doi":"10.5194\/angeo-20-781-2002","raw":"Davies, J. A., Yeoman, T. K., Rae, I. J., Milan, S. E., Lester, M., Lockwood, M., and McWilliams, K. A.,: Ground-based observations of the auroral zone and polar cap ionospheric responses to dayside transient reconnection, Ann. Geophysicae, 20, 781–794, 2002.","cites":null},{"id":16359017,"title":"A.: Modeling the Earth’s magnetospheric magnetic ﬁeld within a realistic magnetopause,","authors":[],"date":"1995","doi":"10.1029\/94ja03193","raw":"Tsyganenko, N. A.: Modeling the Earth’s magnetospheric magnetic ﬁeld within a realistic magnetopause, J. Geophys. Res., 100, 5599–5612, 1995.","cites":null},{"id":16359011,"title":"A.: What are ﬂux transfer events?,","authors":[],"date":"1988","doi":"10.1016\/0032-0633(88)90109-2","raw":"Southwood, D. J., Farrugia, C. J., and Saunders, M. A.: What are ﬂux transfer events?, Planet. Space Sci., 36, 503–508, 1988.","cites":null},{"id":16358929,"title":"C.:A multi-instrument study of ﬂux transfer event structure,","authors":[],"date":"1988","doi":"10.1029\/ja093ia12p14465","raw":"Farrugia, C. J., Rijnbeek, R. P., Saunders, M. A., Southwood, D. J., Rodgers, D. J., Smith, M. F., Chaloner, C. P., Hall, D. S., Christiansen, P. J., and Woolliscroft, L. J. C.:A multi-instrument study of ﬂux transfer event structure, J. Geophys. Res., 98, 14465– 14477, 1988.","cites":null},{"id":16358996,"title":"C.:ISEE observations of ﬂux transfer events at the dayside magnetopause,","authors":[],"date":"1979","doi":"10.1029\/gl006i001p00033","raw":"Russell, C. T. and Elphic, R. C.:ISEE observations of ﬂux transfer events at the dayside magnetopause, Geophys. Res. Lett., 6, 33– 36, 1979.","cites":null},{"id":16358969,"title":"Cluster PEACE observations of electrons during magnetospheric ﬂux transfer events,","authors":[],"date":"2001","doi":"10.5194\/angeo-19-1509-2001","raw":"Owen, C. J., Fazakerley, A. N., Carter, P. J., Coates, A. J., Krauklis, I. C., Szita, S., Taylor, M. G. G. T., Travnicek, P., Watson, G., Wilson, R. J., Balogh, A., and Dunlop, M. W.: Cluster PEACE observations of electrons during magnetospheric ﬂux transfer events, Ann. Geophysicae, 19, 1509–1522, 2001.","cites":null},{"id":16358946,"title":"Convection and auroral response to a southward turning of the IMF: Polar UVI, CUTLASS, and IMAGE signatures of transient magnetic ﬂux transfer at the magnetopause,","authors":[],"date":"2000","doi":"10.1029\/2000ja900022","raw":"Milan, S. E., Lester, M., Cowley, S. W. H., and Brittnacher, M.: Convection and auroral response to a southward turning of the IMF: Polar UVI, CUTLASS, and IMAGE signatures of transient magnetic ﬂux transfer at the magnetopause, J. Geophys. Res., 105, 15741–15756, 2000.","cites":null},{"id":16358977,"title":"CUTLASS Finland radar observations of the ionospheric signatures of ﬂux transfer events and the resulting plasma ﬂows,","authors":[],"date":"1998","doi":"10.1007\/s00585-998-1411-0","raw":"Provan, G., Yeoman, T. K., and Milan, S. E.: CUTLASS Finland radar observations of the ionospheric signatures of ﬂux transfer events and the resulting plasma ﬂows, Ann. Geophysicae, 16, 1411–1422, 1998.","cites":null},{"id":16358933,"title":"Darn\/SuperDARN: a global view of the dynamics of highlatitude convection,","authors":[],"date":"1995","doi":"10.1007\/bf00751350","raw":"Greenwald, R. A., Baker, K. B., Dudeney, J. R., Pinnock, M., Jones, T. B., Thomas, E. C., Villain, J.-P., Cerisier, J.C., Senior, C., Hanuise, C., Hunsucker, R. D., Sofko, G., Koehler, J., Nielsen, E., Pellinen, R., Walker, A. D. M., Sato, N., and Yamagishi, H.: Darn\/SuperDARN: a global view of the dynamics of highlatitude convection, Space Sci. Rev, 71, 761–796, 1995.","cites":null},{"id":16358931,"title":"Dynamics of auroral belt and geomagnetic disturbances,","authors":[],"date":"1967","doi":"10.1016\/0032-0633(67)90190-0","raw":"Feldstein, Y. I. and Starkov, G. V.: Dynamics of auroral belt and geomagnetic disturbances, Planet. Space Sci., 15, 209–229, 1967.","cites":null},{"id":16359019,"title":"Effects of the solar wind conditions on the global magnetospheric conﬁguration as deduced from data-based ﬁeld, in:","authors":[],"date":"1996","doi":null,"raw":"Tsyganenko, N. A.: Effects of the solar wind conditions on the global magnetospheric conﬁguration as deduced from data-based ﬁeld, in: “Proc. 3rd Internat. Conf. on Substorms (ICS-3)”, ESA SP-389, 181–185, 1996.","cites":null},{"id":16358985,"title":"First multispacecraft ion measurements in and near the Earth’s magnetosphere with the identical Cluster ion spectrometry (CIS) experiment,","authors":[],"date":"2001","doi":"10.5194\/angeo-19-1303-2001","raw":"R` eme H., Aoustin, C., Bosqued, J.-M., Dandouras, I., Lavraud, B., Sauvaud, J. A., Barthe, A., J. Bouyssou, J., Camus, Th., CoeurJoly, O., Cros, A., Cuvilo, J., Ducay, F., Garbarowitz, Y., Medale, J.L., Penou, E., Perrier, H., Romefort, D., Rouzaud, J., Vallat, C., Alcayd´ e, D., Jacquey, C., Mazelle, C., d’Uston, C., M¨ obius, E., Kistler, L. M., Crocker, K., Granoff, M., Mouikis, C., Popecki, M., Vosbury, M., Klecker, B., Hovestadt, D., Kucharek, H., Kuenneth, E., Paschmann, G., Scholer, M., Sckopke, N., Seidenschwang, E., Carlson, C. W., Curtis, D. W., Ingraham, C., Lin, R. P., McFadden, J. P., Parks, G. K., Phan, T., Formisano, V., Amata, E., Bavassano-Cattaneo, M. B., Baldetti, P., Bruno, R., Chionchio, G., Di Lellis, A., Marcucci, M. F., Pallocchia, G., Korth, A., Daly, P. W., Graeve, B., Rosenbauer, H., Vasyliunas, V., McCarthy, M., Wilber, M., Eliasson, L., Lundin, R., Olsen, S., Shelley, E. G., Fuselier, S., Ghielmetti, A. G., Lennartsson, W., Escoubet, C. P., Balsiger, H., Friedel, R., Cao, J-B., Kovrazhkin, R. A., Papamastorakis, I., Pellat, R., Scudder, J., and Sonnerup, B.: First multispacecraft ion measurements in and near the Earth’s magnetosphere with the identical Cluster ion spectrometry (CIS) experiment, Ann. Geophysicae, 19, 1303– 1354, 2001.","cites":null},{"id":16359036,"title":"First simultaneous observations of ﬂux transfer events at the high-latitude magnetopause by the Cluster spacecraft and pulsed radar signatures in the conjugate ionosphere by the CUTLASS and EISCAT radars,","authors":[],"date":"2001","doi":"10.5194\/angeo-19-1491-2001","raw":"Wild, J. A., Cowley, S. W. H., Davies, J. A., Khan, H., Lester, M., Milan, S. E., Provan, G., Yeoman, T. K., Balogh, A., Dunlop, M. W., Fornac ¸on, K.-H., and Georgescu, E.: First simultaneous observations of ﬂux transfer events at the high-latitude magnetopause by the Cluster spacecraft and pulsed radar signatures in the conjugate ionosphere by the CUTLASS and EISCAT radars, Ann. Geophysicae, 19, 1491–1508, 2001.","cites":null},{"id":16358928,"title":"Flux transfer events at the magnetopause and in the ionosphere,","authors":[],"date":"1990","doi":"10.1029\/gl017i012p02241","raw":"Elphic, R. C., Lockwood, M., Cowley, S. W. H., and Sandholt, P. E.: Flux transfer events at the magnetopause and in the ionosphere, Geophys. Res. Lett., 17, 2241–2244, 1990.","cites":null},{"id":16358921,"title":"Flux transfer events on the magnetopause: spatial distribution and controlling factors,","authors":[],"date":"1984","doi":"10.1029\/ja089ia08p06689","raw":"Berchem, J. and Russell, C. T.: Flux transfer events on the magnetopause: spatial distribution and controlling factors, J. Geophys. Res., 89, 6698, 1984.","cites":null},{"id":16358999,"title":"Flux transfer events: scale size and interior structure,","authors":[],"date":"1984","doi":"10.1029\/gl011i002p00131","raw":"Saunders, M. A., Russell, C. T., and Sckopke, N.: Flux transfer events: scale size and interior structure, Geophys. Res. Lett., 11, 131–134, 1984.","cites":null},{"id":16359022,"title":"Ground magnetic signatures of moving elongated plasma clouds,","authors":[],"date":"1990","doi":"10.1029\/ja095ia03p02405","raw":"Wei, C. Q. and Lee, L. C.: Ground magnetic signatures of moving elongated plasma clouds, J. Geophys. Res., 95, 2405–2418, 1990.","cites":null},{"id":16358975,"title":"High spatial and temporal resolution observations of the ionospheric cusp,","authors":[],"date":"1995","doi":"10.1007\/s00585-995-0919-9","raw":"Pinnock, M., Rodger, A. S., Dudeney, J. R., Rich, F., and Baker, K. B.: High spatial and temporal resolution observations of the ionospheric cusp, Ann. Geophysicae, 13, 919–925, 1995.","cites":null},{"id":16358947,"title":"IMF By and day-night conductivity effects in the expanding polar cap convection model,","authors":[],"date":"1987","doi":"10.1029\/ja092ia02p01193","raw":"Moses, J. J., Siscoe, G. L., Crooker, N. U., and Gorney, D. J.: IMF By and day-night conductivity effects in the expanding polar cap convection model, J. Geophys. Res., 92, 1193–1198, 1987.","cites":null},{"id":16358922,"title":"IMF BY-dependent plasma ﬂow and Birkeland currents in the dayside magnetosphere, 1, Dynamics Explorer observations,","authors":[],"date":"1985","doi":"10.1029\/ja090ia02p01577","raw":"Burch, J. L., Reiff, P. H., Menietti, J. D., Heelis, R. A., Hanson, W. B., Shawhan, S. D., Shelly, E. G., Sugiura, M., Weimer, D. R., and Winningham, J. D.: IMF BY-dependent plasma ﬂow and Birkeland currents in the dayside magnetosphere, 1, Dynamics Explorer observations, J. Geophys. Res., 90, 1577–9415, 1985.","cites":null},{"id":16359021,"title":"Initial EISCAT observations of plasma convection at invariant latitudes 70◦–77◦,","authors":[],"date":"1984","doi":"10.1016\/0021-9169(84)90081-3","raw":"van Eyken, A. P., Rishbeth, H., Willis, D. M., and Cowley, S. W. H.: Initial EISCAT observations of plasma convection at invariant latitudes 70◦–77◦, J. Atmos. Terr. Phys., 46, 635–641, 1984.","cites":null},{"id":16358995,"title":"Initial ISEE magnetometer results: magnetopause observations,","authors":[],"date":"1978","doi":"10.1007\/bf00212619","raw":"Russell, C. T. and Elphic, R. C.: Initial ISEE magnetometer results: magnetopause observations, Space Sci. Rev., 22, 681–715, 1978.","cites":null},{"id":16358993,"title":"Large-scale imaging of highlatitude convection with Super Dual Auroral Radar Network HF radar observations,","authors":[],"date":"1998","doi":"10.1029\/98ja01288","raw":"Ruohoniemi, J. M. and Baker, K. B.: Large-scale imaging of highlatitude convection with Super Dual Auroral Radar Network HF radar observations, J. Geophys. Res., 20797–20811, 103, 1998.","cites":null},{"id":16359000,"title":"Magnetic ﬂux transfer at the magnetopause based on singe X-line bursty reconnection,","authors":[],"date":"1988","doi":"10.1029\/gl015i004p00291","raw":"Scholer, M.: Magnetic ﬂux transfer at the magnetopause based on singe X-line bursty reconnection, Geophys. Res. Lett., 15, 291– 294, 1988.","cites":null},{"id":16359005,"title":"Magnetopause structure and attitude from Explorer 12 observations,","authors":[],"date":"1967","doi":"10.1029\/jz072i001p00171","raw":"Sonnerup, B. U. O. and Cahill, L. J.: Magnetopause structure and attitude from Explorer 12 observations, J. Geophys. Res., 72, 171–183, 1967.","cites":null},{"id":16358998,"title":"Midday auroral breakup events and related energy and momentum transfer from the magnetosheath,","authors":[],"date":"1990","doi":"10.1029\/ja095ia02p01039","raw":"Sandholt, P. E., Lockwood, M., Oguti, T., Cowley, S. W. H., Freeman, K. S. C., Lybekk, B., Egeland, A., and Willis, D. M.: Midday auroral breakup events and related energy and momentum transfer from the magnetosheath, J. Geophys. Res., 95, 1039– 1060, 1990.","cites":null},{"id":16358943,"title":"Modeled ground magnetic signatures of ﬂux transfer events,","authors":[],"date":"1987","doi":"10.1029\/ja092ia10p11231","raw":"McHenry, M. A. and Clauer, C. R.: Modeled ground magnetic signatures of ﬂux transfer events, J. Geophys. Res., 92, 11231– 11240, 1987.","cites":null},{"id":16358973,"title":"Observations of an enhanced convection channel in the cusp ionosphere,","authors":[],"date":"1993","doi":"10.1029\/92ja01382","raw":"Pinnock, M., Rodger, A. S., Dudeney, J. R., Baker, K. B., Newell, P. T., Greenwald, R. A., and Greenspan, M. E.: Observations of an enhanced convection channel in the cusp ionosphere, J. Geophys. Res., 98, 3767–3776, 1993.","cites":null},{"id":16358940,"title":"Observations of the response time of high latitude ionospheric convection to variations in the interplanetary magnetic ﬁeld using EISCAT and IMP-8 data,","authors":[],"date":"1999","doi":"10.1007\/s00585-999-1306-8","raw":"Khan, H. and Cowley, S. W. H.: Observations of the response time of high latitude ionospheric convection to variations in the interplanetary magnetic ﬁeld using EISCAT and IMP-8 data, Ann. Geophysicae, 17, 1306–1335, 1999. Lockwood, M., Sandholt, P. E., Cowley, S. W. H., and Oguti, T.: Interplanetary ﬁeld control of dayside auroral activity and the transfer of momentum across the dayside magnetopause, Planet.","cites":null},{"id":16358938,"title":"PEACE: A Plasma Elctron And Current Instrument, Space Sci.","authors":[],"date":"1997","doi":"10.1007\/978-94-011-5666-0_13","raw":"Johnstone, A. D., Alsop, C., Burge, S., Carter, P. J., Coates, A. J., Coker, A. J., Fazakerley, A. N., Grande, M., Gowen, R. A., Gurgiolo, C., Hancock, B. K., Narheim, B., Preece, A., Sheather, P. H., Winningham, J. D., and Woodliffe, R. D.: PEACE: A Plasma Elctron And Current Instrument, Space Sci. Rev., 79, 351–398, 1997.","cites":null},{"id":16358971,"title":"Plasma and magnetic ﬁeld characteristics of ﬂux transfer events,","authors":[],"date":null,"doi":"10.1029\/ja087ia04p02159","raw":"Paschmann, G., Haerendel, G., Papamastorakis, I., Sckopke, N., Bame, S. J., Gosling, J. T., and Russell, C. T.: Plasma and magnetic ﬁeld characteristics of ﬂux transfer events, J. Geophys. Res., 87, 2159–2168, 1982.","cites":null},{"id":16359015,"title":"Simultaneous optical and radar signatures of poleward-moving auroral forms,","authors":[],"date":"2000","doi":"10.1007\/s005850000251","raw":"Thorolfsson, A., Cerisier, J.C., Lockwood, M., Sandholt, P. E., Senior, C., and Lester, M.: Simultaneous optical and radar signatures of poleward-moving auroral forms, Ann. Geophysicae, 18, 1054–1066, 2000.","cites":null},{"id":16358942,"title":"Solar Wind Electron Proton Alpha Monitor (SWEPAM) for the Advanced Composition Explorer, Space Sci.","authors":[],"date":"1998","doi":"10.1007\/978-94-011-4762-0_20","raw":"McComas, D. J., Bame, S. J., Barker, P., Feldman, W. C., Phillips, J. L., Riley, P., and Griffee, J. W.: Solar Wind Electron Proton Alpha Monitor (SWEPAM) for the Advanced Composition Explorer, Space Sci. Rev., 86, 563–612, 1998.","cites":null},{"id":16358979,"title":"Statistical observations of the MLT, latitude and size of pulsed ionospheric ﬂows with the CUTLASS Finland radar,","authors":[],"date":"1999","doi":"10.1007\/s00585-999-0855-1","raw":"Provan, G. and Yeoman, T. K.: Statistical observations of the MLT, latitude and size of pulsed ionospheric ﬂows with the CUTLASS Finland radar, Ann. Geophysicae, 17, 855–867, 1999.","cites":null},{"id":16358991,"title":"Statistical patterns of high-latitude convection obtained from Goose Bay HF radar observations,","authors":[],"date":"1996","doi":"10.1029\/96ja01584","raw":"Ruohoniemi, J. M. and Greenwald, R. A.: Statistical patterns of high-latitude convection obtained from Goose Bay HF radar observations, J. Geophys. Res., 101, 21746–21763, 1996.","cites":null},{"id":16358939,"title":"Survey of ﬂux transfer events observed with the ISEE 1 spacecraft: dependence on the interplanetary magnetic ﬁeld,","authors":[],"date":"1997","doi":"10.1029\/97ja00481","raw":"Kawano, H. and Russell, C. T.: Survey of ﬂux transfer events observed with the ISEE 1 spacecraft: dependence on the interplanetary magnetic ﬁeld, J. Geophys. Res., 102, 11307–11313, 1997.","cites":null},{"id":16359004,"title":"The ACE Magnetic Fields Experiment, Space Sci.","authors":[],"date":"1998","doi":"10.1007\/978-94-011-4762-0_21","raw":"Smith, C. W., Acu˜ na, M. H., Burlaga, L. F., L’Heureux, J., Ness, N. F., and Scheifele, J.: The ACE Magnetic Fields Experiment, Space Sci. Rev., 86, 613–632, 1998.","cites":null},{"id":16359013,"title":"The Advanced Composition Explorer, Space Sci.","authors":[],"date":"1998","doi":"10.1007\/978-94-011-4762-0_1","raw":"Stone, E. C., Frandsen, A. M., Mewaldt, R. A., Christian, E. R., Marglies, D., Ormes, J. F., and Snow, F.: The Advanced Composition Explorer, Space Sci. Rev., 86, 1–22, 1998.","cites":null},{"id":16358923,"title":"The causes of convection in the Earth’s magnetosphere – a review of developments during the IMS,","authors":[],"date":"1982","doi":"10.1029\/rg020i003p00531","raw":"Cowley, S. W. H.: The causes of convection in the Earth’s magnetosphere – a review of developments during the IMS, Rev. Geophys. Space Phys., 20, 531–565, 1982. Cowley, S. W. H.: The impact of recent observations on theoretical understanding of solar wind-magnetosphere interactions, J.","cites":null},{"id":16358983,"title":"The Cluster Ion Spectrometry (CIS) Experiment, Space Sci.","authors":[],"date":"1997","doi":"10.1007\/978-94-011-5666-0_12","raw":"R` eme, H., Bosqued, J.-M., Sauvaud, J. A., Cros, A., Dandouras, J., Aoustin, C., Bouyssou, J., Camus, Th., Cuvilo, J., Martz, C., M’Edale, J. L., Perrier, H., Romefort, D., Rouzaud, J., D’uston, C., M¨ obius, E., Crocker, K., Granoff, M., Kistler, L. M., Popecki, M., Hovestadt, D., Klecker, B., Paschmann, G., Scholer, M., Carlson, C. W., Curtis, D. W., Lin, R. P., McFadden, J. P., Formisano, V., Amata, E., Bavassano-Cattaneo, M. B., Baldetti, P., Belluci, G., Bruno, R., Chionchio, G., Di Lellis, A., Shelley, E. G., Ghielmetti, A. G., Lennartsson, W., Korth, A., Rosenbauer, H., Lundin, R., Olsen, S., Parks, G. K., McCarthy, M., and Balsiger, H.: The Cluster Ion Spectrometry (CIS) Experiment, Space Sci. Rev., 79, 303–350, 1997.","cites":null},{"id":16358920,"title":"The Cluster Magnetic Field Investigation: overview of in-ﬂight performance and initial results,","authors":[],"date":"2001","doi":"10.5194\/angeo-19-1207-2001","raw":"Balogh, A., Carr, C. M., Acu˜ na, M. H., Dunlop, M. W., Beek, T. J., Brown, P., Fornac ¸on, K.-H., Georgescu, E., Glassmeier, K.-H., Harris, J., Musmann, G., Oddy, T., andSchwingenschuh, K.: The Cluster Magnetic Field Investigation: overview of in-ﬂight performance and initial results, Ann. Geophysicae, 19, 1207–1217, 2001.","cites":null},{"id":16358919,"title":"The Cluster magnetic ﬁelds investigation,","authors":[],"date":"1997","doi":"10.1007\/978-94-011-5666-0_3","raw":"Balogh, A., Dunlop, M. W., Cowley, S. W. H., Southwood, D. J., Thomlinson, J. G., Glassmeier, K.-H., Musmann, G., L¨ uhr, H., Buchert, S., Acu˜ na, M. H., Fairﬁeld, D. H., Slavin, J. A., Riedler, W., Schwingenschuh, K., and Kivelson, M. G.: The Cluster magnetic ﬁelds investigation, Space Sci. Rev., 79, 65–91, 1997.","cites":null},{"id":16358937,"title":"The effects of interplanetary magnetic ﬁeld orientation on dayside high-lattude ionospheric convection,","authors":[],"date":"1984","doi":"10.1029\/ja089ia05p02873","raw":"Heelis, R. A.: The effects of interplanetary magnetic ﬁeld orientation on dayside high-lattude ionospheric convection, J. Geophys. Res., 89, 2873–2880, 1984.","cites":null},{"id":16358935,"title":"The frontside boundary layer of the magnetopause and the problem of reconnection,","authors":[],"date":"1978","doi":"10.1029\/ja083ia07p03195","raw":"Haerendel, G., Paschmann, G., Sckopke, N., Rosenbauer, H., and Hedgecock, P. C.: The frontside boundary layer of the magnetopause and the problem of reconnection, J. Geophys. Res., 83, 3195-216, 1978.","cites":null},{"id":16358981,"title":"The inﬂuence of theIMFBy componentonthelocationofpulsedﬂowsintheday-1826","authors":[],"date":"1999","doi":null,"raw":"Provan, G., Yeoman, T. K., and Cowley, S. W. H.: The inﬂuence of theIMFBy componentonthelocationofpulsedﬂowsintheday-1826 J. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs side ionosphere observed by an HF radar, Geophys. Res. Lett., 26, 521–524, 1999.","cites":null},{"id":16358989,"title":"The ionospheric response to FTEs: the ﬁrst few minutes,","authors":[],"date":"1997","doi":"10.1007\/s00585-997-0685-y","raw":"Rodger, A. S. and Pinnock, M.: The ionospheric response to FTEs: the ﬁrst few minutes, Ann. Geophysicae, 15, 685–691, 1997.","cites":null},{"id":16358926,"title":"The ionospheric signature of ﬂux transfer events,","authors":[],"date":"1987","doi":"10.1029\/ja092ia04p03207","raw":"Southwood, D. J.: The ionospheric signature of ﬂux transfer events, J. Geophys. Res., 92, 3207–3213, 1987.","cites":null},{"id":16358945,"title":"The ionospheric signature of transient dayside reconnection and the associated pulsed convection return ﬂow,","authors":[],"date":"1999","doi":"10.1007\/s00585-999-1166-2","raw":"Milan, S. E., Lester, M., Greenwald, R. A., and Sofko, G.: The ionospheric signature of transient dayside reconnection and the associated pulsed convection return ﬂow, Ann. Geophysicae, 17, 1166–1171, 1999.","cites":null},{"id":16358941,"title":"The ionospheric signatures of ﬂux transfer events and solar wind dynamic pressure changes,","authors":[],"date":"1990","doi":"10.1029\/ja095ia10p17113","raw":"Lockwood, M., Cowley, S. W. H., Sandholt, P. E., and Lepping, R. P.: The ionospheric signatures of ﬂux transfer events and solar wind dynamic pressure changes, J. Geophys. Res., 95, 17113– 17135, 1990. Lockwood, M., Moen, J., Cowley, S. W. H., Farmer, A. D., Løvhaug, U. P., L¨ uhr, H., and Davda, V. N.: Variability of dayside convection and motions of the cusp\/cleft aurora, Geophys.","cites":null},{"id":16358967,"title":"The UV aurora and ionospheric ﬂows during ﬂux transfer events,","authors":[],"date":"2001","doi":"10.5194\/angeo-19-179-2001","raw":"Neudegg, D. A., Cowley, S. W. H., McWilliams, K. A., Lester, M., Yeoman, T. K., Sigwarth, J., Haerendel, G., Baumjohann, W., Auster, U., Fornac ¸on, K.-H., and Georgescu, E.: The UV aurora and ionospheric ﬂows during ﬂux transfer events, Ann. Geophysicae, 19, 179–188, 2001.","cites":null},{"id":16359007,"title":"Theoretical aspects of the ionospheremagnetosphere-solar wind coupling,","authors":[],"date":"1985","doi":"10.1016\/0273-1177(85)90110-3","raw":"Southwood, D. J.: Theoretical aspects of the ionospheremagnetosphere-solar wind coupling, Adv. Space Res., 5, 7–14, 1985.","cites":null},{"id":16358925,"title":"Wild et al.: Interhemispheric SuperDARN radar observations of FTEs 1825","authors":[],"date":"1992","doi":null,"raw":"Space Sci., 37, 1461–1475, 1989.J. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs 1825 Cowley, S. W. H. and Lockwood, M.: Excitation and decay of solar wind-driven ﬂows in the magnetosphere-ionosphere system, Ann. Geophysicae, 10, 103–15, 1992.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2003","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71180.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/6618\/1\/art_673.pdf","pdfHashValue":"9fb3d67e317ba2e73713747e3894d221bc26f97d","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:6618<\/identifier><datestamp>\n      2017-12-26T00:02:41Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5431<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Coordinated interhemispheric SuperDARN radar observations of the ionospheric response to flux transfer events observed by the cluster spacecraft at the high-latitude magnetopause<\/dc:title><dc:creator>\n        Wild, J. A.<\/dc:creator><dc:creator>\n        Milan, S. E.<\/dc:creator><dc:creator>\n        Cowley, S. W. H.<\/dc:creator><dc:creator>\n        Dunlop, M. W.<\/dc:creator><dc:creator>\n        Owen, C. J.<\/dc:creator><dc:creator>\n        Bosqued, J. M.<\/dc:creator><dc:creator>\n        Taylor, M. G. G. T.<\/dc:creator><dc:creator>\n        Davies, J. A.<\/dc:creator><dc:creator>\n        Lester, M.<\/dc:creator><dc:creator>\n        Sato, N.<\/dc:creator><dc:creator>\n        Yukimatu, A. S.<\/dc:creator><dc:creator>\n        Fazakerley, A. N.<\/dc:creator><dc:creator>\n        Balogh, A.<\/dc:creator><dc:creator>\n        Rème, H.<\/dc:creator><dc:subject>\n        T Technology (General)<\/dc:subject><dc:date>\n        2003<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/6618\/1\/art_673.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.5194\/angeo-21-1807-2003<\/dc:relation><dc:identifier>\n        Wild, J. A. and Milan, S. E. and Cowley, S. W. H. and Dunlop, M. W. and Owen, C. J. and Bosqued, J. M. and Taylor, M. G. G. T. and Davies, J. A. and Lester, M. and Sato, N. and Yukimatu, A. S. and Fazakerley, A. N. and Balogh, A. and Rème, H. (2003) Coordinated interhemispheric SuperDARN radar observations of the ionospheric response to flux transfer events observed by the cluster spacecraft at the high-latitude magnetopause. Annales Geophysicae, 21 (8). pp. 1807-1826. ISSN 0992-7689<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/6618\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.5194\/angeo-21-1807-2003","http:\/\/eprints.lancs.ac.uk\/6618\/"],"year":2003,"topics":["T Technology (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Annales Geophysicae (2003) 21: 1807–1826 c© European Geosciences Union 2003\nAnnales\nGeophysicae\nCoordinated interhemispheric SuperDARN radar observations of\nthe ionospheric response to flux transfer events observed by the\nCluster spacecraft at the high-latitude magnetopause\nJ. A. Wild1, S. E. Milan1, S. W. H. Cowley1, M. W. Dunlop2,†, C. J. Owen3, J. M. Bosqued4, M. G. G. T. Taylor3,*,\nJ. A. Davies1, M. Lester1, N. Sato5, A. S. Yukimatu5, A. N. Fazakerley3, A. Balogh2, and H. Re`me4,†\n1Department of Physics & Astronomy, University of Leicester, Leicester LE1 7RH, UK\n2Blackett Laboratory, Imperial College, London SW7 2BZ, UK\n3Mullard Space Science Laboratory, University College London, Holmbury St. Mary, Dorking, Surrey RH5 6NT, UK\n4CESR, BP 4346, 31028 Toulouse 4, France\n5National Institute of Polar Research, Tokyo 173-8515, Japan\n*now at: Los Alamos National Laboratory, Los Alamos, NM 87545, USA\n†now at: Rutherford Appleton Laboratory, Chilton, Didcot, Oxfordshire, OX11 0QX, UK\nReceived: 28 October 2002 – Revised: 10 March 2003 – Accepted: 25 March 2003\nAbstract. At 10:00 UT on 14 February 2001, the quar-\ntet of ESA Cluster spacecraft were approaching the North-\nern Hemisphere high-latitude magnetopause in the post-noon\nsector on an outbound trajectory. At this time, the interplan-\netary magnetic field incident upon the dayside magnetopause\nwas oriented southward and duskward (BZ negative, BY pos-\nitive), having turned from a northward orientation just over\n1 hour earlier. As they neared the magnetopause the mag-\nnetic field, electron, and ion sensors on board the Cluster\nspacecraft observed characteristic field and particle signa-\ntures of magnetospheric flux transfer events (FTEs). Follow-\ning the traversal of a boundary layer and the magnetopause,\nthe spacecraft went on to observe further signatures of FTEs\nin the magnetosheath. During this interval of ongoing pulsed\nreconnection at the high-latitude post-noon magnetopause,\nthe footprints of the Cluster spacecraft were located in the\nfields-of-view of the SuperDARN Finland and Syowa East\nradars located in the Northern and Southern Hemispheres, re-\nspectively. This study extends upon the initial survey of Wild\net al. (2001) by comparing for the first time in situ magnetic\nfield and plasma signatures of FTEs (here observed by the\nCluster 1 spacecraft) with the simultaneous flow modulations\nin the conjugate ionospheres in the two hemispheres. During\nthe period under scrutiny, the flow disturbances in the conju-\ngate ionospheres are manifest as classic “pulsed ionospheric\nflows” (PIFs) and “poleward moving radar auroral forms”\n(PMRAFs). We demonstrate that the ionospheric flows ex-\ncited in response to FTEs at the magnetopause are not those\nexpected for a spatially limited reconnection region, some-\nwhere in the vicinity of the Cluster 1 spacecraft. By examin-\ning the large- and small-scale flows in the high-latitude iono-\nsphere, and the inter-hemispheric correspondence exhibited\nduring this interval, we conclude that the reconnection pro-\ncesses that result in the generation of PIFs\/PMRAFs must\nCorrespondence to: J. A. Wild (j.wild@ion.le.ac.uk)\nextend over many (at least 4) hours of magnetic local time\non the pre- and post-noon magnetopause.\nKey words. Ionosphere (plasma convection) – Magne-\ntospheric physics (magnetosphere-ionosphere interactions;\nmagnetospheric configuration and dynamics)\n1 Introduction\nThe exact nature of the coupling mechanism between the so-\nlar wind and the Earth’s magnetosphere remains one of the\nkey outstanding questions in solar-terrestrial physics. Ob-\nservations supporting the supposition that reconnection pro-\ncesses at the high-latitude magnetopause are frequently tran-\nsient in nature were first presented by Haerendel et al. (1978),\nexploiting magnetic field measurements from the HEOS-2\nspacecraft. Using lower latitude magnetic field observations\nfrom the ISEE-1 and 2 spacecraft, Russell and Elphic (1978,\n1979) also reported transient signatures of magnetic recon-\nnection at the magnetopause with time scales of a few min-\nutes and a recurrence interval of∼5–10 min, and it was these\nauthors that went on to term these transient signatures “flux\ntransfer events” (FTEs). These transients are usually char-\nacterised by bipolar signatures in the magnetic field com-\nponent normal to the magnetopause (sometimes associated\nwith field tilting effects in the plane of the magnetopause)\nand a mixed plasma population of both magnetospheric and\nmagnetosheath origin (e.g. Paschmann et al., 1982; Farru-\ngia et al., 1988). The physical interpretation of FTEs of-\nfered by Russell and Elphic (1978, 1979) was based upon\ntransient (few minute) and spatially localised (few RE) inter-\nvals of magnetic reconnection at the magnetopause, an inter-\npretation that was subsequently supported by several studies\nshowing that FTEs were most frequently observed during in-\ntervals with southward directed fields in the magnetosheath\n1808 J. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs\n(e.g. Rijnbeek et al., 1984; Berchem and Russell, 1984;\nKawano and Russell, 1997). The size, longevity and evolu-\ntion of the reconnection site from which FTEs originate has\nbeen the subject of much debate; for example, Southwood et\nal. (1988) and Scholer (1988) postulated that the transient re-\nconnection region extends significantly further over the mag-\nnetopause surface than was originally suggested by Russell\nand Elphic (1978, 1979) whilst Milan et al. (2000), drawing\nupon UV auroral imager data and HF radar data, suggested\nthat the reconnection site may at any one time be spatially\nlocalised, but that it propagates wave-like over the magne-\ntopause for extended distances and intervals of time (at least\n∼10 min).\nClearly, the dayside ionospheric flow response to recon-\nnection processes at the magnetopause will depend upon\nthe prevailing reconnection geometry at the boundary, and\na range of theoretical descriptions have been proposed to\ndescribe the expected flow signatures that would result\nfrom patchy, extended, or wave-like reconnection sites (e.g.\nSouthwood, 1985, 1987; Cowley, 1986; McHenry and\nClauer, 1987; Lockwood et al., 1990; Wei and Lee, 1990;\nCowley et al., 1991; Cowley and Lockwood, 1992; Milan\net al., 2000). Motivated by the potential to exploit iono-\nspheric observations in order to diagnose reconnection pro-\ncesses at the magnetopause, a great deal of effort has been\nmade to observe the signatures of FTEs in the high-latitude\nionosphere. Among the first ground-based measurements to\nbe interpreted as potential flux transfer events were those\nof van Eyken et al. (1984), who reported a brief northward\nexcursion in a westward flow region observed by the EIS-\nCAT UHF incoherent scatter radar. Subsequently, Lock-\nwood et al. (1989, 1993) associated ionospheric flow en-\nhancements observed by the EISCAT system with dayside\nauroral transients that related to FTEs observed at the magne-\ntopause. In recent years high frequency (HF) coherent radars\nhave provided a wealth of observations that have been as-\nsociated with flux transfer events. HF radars often observe\nhigh velocity antisunward transient flow in the cusp iono-\nsphere and it was these signatures that were interpreted as\nthe response to transient magnetopause reconnection by Pin-\nnock et al. (1993, 1995) and Rodger and Pinnock (1997).\nSubsequently, quasi-periodic sequences of such events, of-\nten termed “pulsed ionospheric flows” (PIFs), have been re-\nported and examined both individually (Provan et al., 1998)\nand statistically (Provan and Yeoman, 1999). These are often\nalso seen as poleward-moving regions of enhanced backscat-\nter power, the radar counterpart of “poleward-moving auroral\nforms” (PMAFs), widely accepted to be the auroral signa-\nture of FTEs (e.g. Sandholt et al., 1990; Thorolfsson et al.,\n2000). In the text below we will refer to these radar PMAFs\nas “poleward-moving radar auroral forms” or PMRAFs. As\nnoted by Wild et al. (2001), care should be taken in the use\nof “PIF” and “PMRAF” nomenclature, which are often er-\nroneously used interchangeably. It is not always possible to\nsay whether isolated PMRAFs are associated with a PIF or\nnot, as no measurements of the ionospheric flow preceding\nor following the PMRAF are made (as no backscatter is ob-\nserved). The lack of backscatter before or after the PMRAF\ndoes not necessarily indicate that a change in convection flow\nhas occurred, only that no targets were present from which\nthe radar could scatter. However, the almost continuous ob-\nservations of the polar ionosphere provided by HF coherent\nradars have enabled the spatial extent of these events, their\nflow orientation, MLT occurrence, dependence on IMF ori-\nentation, and repetition frequencies to be extensively exam-\nined (Provan et al., 1998, 1999; Provan and Yeoman, 1999;\nMilan et al., 1999, 2000; McWilliams et al., 2000).\nEmploying ionospheric flow observations from the EIS-\nCAT radar system and magnetic field measurements from\nthe ISEE-1 and -2 spacecraft, Elphic et al. (1990) presented\nthe first simultaneous observations of an FTE at the mag-\nnetopause and the flow response in the near-conjugate iono-\nsphere. More recently, Neudegg et al. (1999) presented the\nfirst coordinated space- and ground-based study of FTEs to\nexploit measurements from a HF coherent radar system. Dur-\ning the case study presented, a southward turning of the IMF\nresulted in the observation of a clear magnetospheric FTE\nin the magnetometer data of the Equator-S spacecraft, lo-\ncated in the vicinity of the low-latitude morning-sector mag-\nnetopause. The timing of the observed FTEs closely matched\nthe onset of transient poleward-propagating flow features in\nthe SuperDARN Hankasalmi (CUTLASS) radar. It is worth\nnoting that since this study employed data acquired using\na non-standard radar mode, the ionospheric flow data pre-\nsented was of exceptionally high quality with better than\nusual spatial and temporal resolution. This allowed the au-\nthors to accurately deduce the resulting ionospheric convec-\ntion, which proved to be consistent with previous HF radar\nresults based solely upon ground-based data. Neudegg et\nal. (2001) went on to show that the high-latitude convec-\ntion response to the reconnection process associated with this\nmagnetopause FTE excited strong UV aurora equatorward of\nthe footprint of the newly-reconnected field lines. By carry-\ning out a statistical survey of FTEs observed in the vicinity\nof the magnetopause by the Equator-S spacecraft, Neudegg\net al. (2000) found a strong association with the characteristic\npulsed antisunward flows observed in the HF radar data at the\nconjugate ionospheric footprint of the spacecraft. They went\non to suggest that for FTEs with a repetition rate of greater\nthan ∼5 min, a clear one-to-one correlation often existed be-\ntween magnetopause and ionospheric events. For faster rep-\netition rates, the ionospheric response began to resemble that\nexpected from a continuous flow excitation. The overall flow\npatterns observed in association with the FTEs were in broad\nagreement with those predicted theoretically, but showed a\nwide variety of responses on an event-to-event basis.\nCombining, for the first time, magnetic field observations\nfrom the ESA Cluster mission and ground-based coherent-\nand incoherent-scatter radar measurements of the iono-\nspheric flow in the region of the dayside cusp, Wild et\nal. (2001) presented simultaneous observations of FTEs at\nthe high-latitude magnetopause and pulsed radar signatures\nin the conjugate Northern Hemisphere ionosphere. More\nspecifically, transient bipolar signatures in the magnetic field\nJ. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs 1809\ncomponent normal to the magnetopause, characteristic of\nFTEs at the high-latitude magnetopause, were observed to\ncoincide with pulsations in the ionospheric flow at the lat-\nitude of the Cluster footprint measured by the Hankasalmi\nSuperDARN (CUTLASS) HF radar. The radar features pul-\nsated in both velocity and backscatter power and were ob-\nserved propagating poleward, forming classic “pulsed iono-\nspheric flow” (PIFs) and “poleward-moving radar auroral\nforms” (PMRAFs) at higher latitudes. Furthermore, Wild\net al. (2001) demonstrated an excellent correspondence be-\ntween the FTEs observed at the magnetopause and the pul-\nsations in the dawnward component of the ionospheric flow\ndespite the radar measurements being displaced by some 2 h\nof MLT to the west of the estimated location of the Clus-\nter footprint. Considering the expected dawnward and pole-\nward motion of reconnected flux tubes in the Northern Hemi-\nsphere post-noon magnetosphere due to the duskward and\nsouthward directed IMF during the interval presented, it was\nsuggested by Wild et al. (2001) that the lower latitude west-\nward flow region corresponded to newly-opened flux tubes in\nwhich the first influences of each burst of reconnection were\nfelt. In addition, an apparent relationship between the zonal\nionospheric flow modulation and PIF\/PMRAF signatures at\nhigher latitudes was reported. More specifically, enhance-\nments in backscattered power observed in the lower-latitude\nwestward flow region generally preceded PIF or PMRAF sig-\nnatures at higher latitudes, implying that the PIF\/PMRAF\nevents originated near a latitude of 74◦–75◦ (close to the lat-\nitude of the Cluster footprint) and propagated poleward to\n∼80◦ where they resembled the more classic PIF\/PMRAF\nsignatures. An association between flow changes at lower\nlatitudes and PMRAF features at higher latitudes had pre-\nviously been reported in studies by Milan et al. (2000) and\nDavies et al. (2002). Consequently, Wild et al. (2001) went\non to concluded that PMRAFs are “fossils” of the iono-\nspheric structuring that takes place at the ionospheric foot-\nprint of the dayside merging gap and as such are useful trac-\ners of the convection flow on newly-reconnected field lines.\nThe occurrence of these fossils in relation to PIFs may yield\ninformation regarding the level of inductive smoothing of\nthe flow being excited by the reconnection process. Signif-\nicantly, it was suggested that the observation of a PMRAF\nmight be delayed from its associated burst of reconnection\nby up to several minutes.\nThe data presented in Wild et al. (2001) (hereafter re-\nferred to as Paper 1), were drawn from the first two weeks\nof Cluster science operations and constituted a “first results”\noverview of the interval 09:15–11:15 UT on 14 February\n2001. Since the preparation of Paper 1 a substantially ex-\ntended dataset, from both space- and ground-based instru-\nments, has become available and has allowed for a more\ncomprehensive investigation of the interval to be undertaken.\nThis paper will present hitherto unique simultaneous inter-\nhemispheric ground-based observations of the response to\nFTEs observed at the magnetopause by Cluster; a compre-\nhensive multi-spacecraft, multi-instrument in situ study of\nthe FTEs observed at the high-latitude magnetopause during\nthis interval will be presented in a future companion paper.\n2 Instrumentation\n2.1 SuperDARN radar data\nThe Super Dual Auroral Radar Network (SuperDARN)\n(Greenwald et al., 1995) comprises 15 HF coherent-scatter\nradars covering a large fraction of the auroral zone and polar\ncap in each hemisphere (nine in the Northern Hemisphere\nand six in the Southern Hemisphere). Each radar is fre-\nquency agile in the range 8–20 MHz, although they most\ncommonly operate at frequencies in the 10–14 MHz range,\nscattering multi-pulse sequences of HF radio waves from de-\ncametre scale electron density irregularities in the E- and F-\nregion ionosphere. By employing phased arrays of anten-\nnas, the radars are able to electronically steer the transmit-\nted pulse sequence, sounding 16 beams (each separated by\n3.24◦ in azimuth) with each beam subdivided into 75 range\ngates. During the interval of interest, all 15 SuperDARN\nradars were operating in a common mode in which each\nbeam was sounded for 3 s, thus completing a full scan of all\n16 beams (some 52◦ in aziumth) every 1 min, the shortfall\nbeing used for the processing and recording of data and to en-\nable all fifteen radars to “synchronize” and begin successive\nscans at predetermined times (such as minute boundaries).\nThe length of each of the 75 gates was set to 45 km with a\nrange to the first gate of 180 km. In addition to measuring\nthe backscattered power received at the radar, Doppler spec-\ntra are obtained by analysing the autocorrelation function of\nthe returned signals, from which the mean Doppler velocity,\nan estimate of the line-of-sight (l-o-s) plasma velocity, and\nDoppler spectral width are derived.\nThis study presents l-o-s backscattered power and Doppler\nvelocity observations from two SuperDARN radars, namely\nthe Finland and Syowa East radars. The Finland radar is\nlocated at Hankasalmi (62.3◦ N, 26.6◦ E) and forms part of\nthe Co-operative UK Twin Located Auroral Sounding Sys-\ntem (CUTLASS); the Syowa East radar is sited close to\nthe Syowa station (69.0◦ S, 39.6◦ E) in Antarctica. Figure 1\npresents the fields-of-view (f-o-v) of these radars in an MLT-\nmagnetic latitude coordinate system. The north magnetic\npole lies at the centre of the figure with lines of constant\nmagnetic latitude at 10◦ increments indicated by concentric\ndotted circles. The dotted radial lines represent meridians\nof magnetic local time at one hour increments, with mag-\nnetic midnight (noon) being located at the bottom (top) of\nthe figure and dawn (dusk) located on the right-(left-) hand\nside. For reference, the statistical location of the auroral oval\n(Feldstein and Starkov, 1967) for the appropriate level of ge-\nomagnetic activity (Kp = 4) and the coastlines of the North-\nern Hemisphere land masses at 10:20 UT on 14 February\n2001 have been overlaid. The overall f-o-v of the Finland\nradar at this time is represented by the solid blue lines with\nthe locations of three individual beams discussed in detail be-\nlow indicated by dot-dashed blue lines and numbered accord-\n1810 J. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs\nFigure 1\n24 MLT\n18 MLT                                                                                                                           06 MLT\n12 MLT\n80°\n70°\n60°\nFig. 1. A magnetic latitude-magnetic local time projection of the Northern Hemisphere at 10:20 UT on 14 February 2001. Lines of constant\ngeomagnetic latitude, starting at 80◦ N and then at 10◦ intervals, are indicated by dotted concentric circles. Magnetic local time meridians at\n1 h intervals are also indicated by dotted lines with magnetic noon (midnight) located at the top (bottom) of the figure and dawn (dusk) located\non the right- (left-) hand side. The Northern Hemisphere coastlines at this time are indicated in light grey and the statistical location of the\nauroral oval (Kp = 4) by solid dark grey lines. The overall field-of-view of the SuperDARN Finland radar is shown by the solid indigo lines.\nThe individual beams within the field-of-view referred to in the text are bounded by dot-dashed lines and numbered appropriately. Similarly,\nthe field-of-view and specific beams of the Southern Hemisphere SuperDARN Syowa East radar, mapped into the Northern Hemisphere, are\nalso indicated by red solid and dot-dashed lines, respectively. The Northern Hemisphere ionospheric footprint of the Cluster 1 spacecraft at\nthis time is indicated by the crossed circle.\ningly. Similarly, the overall f-o-v and three individual beams\nof the Southern Hemisphere Syowa East radar, mapped into\nthe Northern Hemisphere, are indicated by red solid and dot-\ndashed lines respectively. Finally, the magnetic footprint of\nthe Cluster 1 spacecraft at 10:20 UT on 14 February 2001 is\nshown in Fig. 1 by the black crossed circle. This footprint\nwas mapped from the location of the Cluster 1 spacecraft us-\ning the Tsyganenko-96 magnetic field model (Tsyganenko\n1995, 1996) and parameterised as discussed below.\nIn addition to the measurements of l-o-s Doppler veloc-\nity from the Finland and Syowa East radars, observations of\nionospheric flow from all the available SuperDARN radars\n(in both hemispheres) are employed to estimate the large-\nscale ionospheric convection pattern using the “map poten-\ntial” technique of Ruohoneimi et al. (1996, 1998). This tech-\nnique is discussed more fully below.\n2.2 ACE interplanetary data\nThe IMF and solar wind parameters required for this study\nwere measured by the MAG and SWEPAM instruments re-\nspectively, on board the Advanced Composition Explorer\n(ACE) spacecraft (McComas et al., 1998; Smith et al., 1998;\nStone et al., 1998), located some 237RE upstream from the\nEarth during the interval of interest. The propagation de-\nlay between field signatures appearing at the ACE spacecraft\nand their arrival at the subsolar magnetopause has been es-\ntimated using the technique of Khan and Cowley (1999).\nIn summary, this method takes into account the propaga-\ntion of IMF features with the solar wind to the bow shock\nand then across the magnetosheath to the magnetopause, us-\ning empirical model values of the location of these bound-\naries controlled by the observed solar wind parameters. For\nconditions during the period of interest (nSW∼1–3 cm−3,\nVSW∼500 km s−1), the propagation delay is determined to be\nJ. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs 1811\n∼55 min. For example, the IMF and solar wind parameters\ninput to the magnetic field and boundary models presented in\nFig. 2 and corresponding to 10:20 UT on 14 February 2001\nare those measured at the ACE spacecraft at 09:25 UT on the\nsame date, these being Pdyn = 1.5 nPa, IMF BY = 2.8 nT,\nand IMF BZ = −2.5 nT. Similarly, the ACE data presented\nbelow have been lagged by 55 min so that they may be com-\npared with Cluster observations near the magnetopause. The\nappropriate values of the Dst and Kp indices at the time were\n37 nT and 4, respectively, indicating moderate levels of geo-\nmagnetic activity.\n2.3 Cluster data\nFigure 2 presents the motion of the Cluster 1 (Rumba) space-\ncraft in the GSM X − Z plane during the interval from\n14:00 UT on 13 February 2001 to 18:00 UT on 14 Febru-\nary 2001. At this time, the apogee of the Cluster orbit was\nlocated at around 13:00 MLT, with the spacecraft passing\nthrough slightly earlier local times during their inbound mo-\ntion in the Southern Hemisphere and slightly later local times\nin the Northern Hemisphere moving outbound from perigee.\nThe locations of the Cluster 1, 2, 3, and 4 spacecraft relative\nto the Cluster 1 orbital path at 10:20 UT on 14 February 2001\nare indicated by indigo, green, yellow and red filled circles,\nrespectively. The inter-spacecraft separation has been exag-\ngerated by a factor of 20, in order to emphasise the tetra-\nhedral configuration of the quartet during this interval. A\ncut though a Shue et al. (1997) model magnetopause at the\napproximate location of the Cluster 1 spacecraft out of the\nGSM X−Z plane (YGSM ≈3.9RE) at 10:20 UT is indicated\nby the dashed indigo line. The magnetospheric field passing\nthrough the Cluster 1 spacecraft at this time inferred from\nthe Tsyganenko-96 field model (Tsyganenko 1995, 1996) is\nalso included, represented by the dotted black line. Both the\nmodel magnetopause location and magnetospheric field line\nmodel are parameterised by solar wind and IMF conditions.\nThe Shue et al. (1997) magnetopause location and shape is\ncontrolled by the solar wind dynamic pressure Pdyn, and the\nBZ component of the IMF whilst the Tsyganenko-96 field\nmodel utilises these and a further two parameters, namely the\nBY component of the IMF and the Dst index. Consequently,\nthe solar wind and IMF parameters employed to generate this\nfigure are those quoted above.\nThe Cluster fluxgate magnetometer (FGM) experiment\n(Balogh et al., 1997, 2001) comprises two triaxial fluxgate\nmagnetic field sensors on each of the four spacecraft (eight\nin total). In normal operation the outboard sensor, located at\nthe end of a 5 m boom, is used as the primary source of data.\nThe FGM sensors are calibrated such that the local magnetic\nfield vector can be measured with an accuracy approaching\n0.1 nT at high sample rates (up to 67 vectors s−1). The FGM\nmagnetic field data presented in this study were recorded by\nspacecraft 1 (Rumba) and have been analysed at a temporal\nresolution equal to the spin period of the spacecraft (∼4 s).\nObservations of the ion populations encountered by the\nCluster spacecraft are provided by the Cluster Ion Spectrom-\nCluster 1 (Rumba)\nCluster 2 (Salsa)\nCluster 3 (Samba)\nCluster 4 (Tango)\nFigure 2\nFig. 2. Plot showing the projection of the orbit of the Cluster 1\n(Rumba) spacecraft on to the GSM X − Z plane during the inter-\nval 14:00 UT on 13 February 2001 to 18:00 UT on 14 February\n2001. The relative locations of the four spacecraft at 10:20 UT on\n14 February are indicated by coloured circles, as described by the\nkey, where the separation from Cluster 1 has been magnified by a\nfactor of 20, in order to more clearly demonstrate the tetrahedral\nformation. This time also corresponds the Northern Hemisphere\nmap presented in Fig. 1. A Tsyganenko-96 model field line, as de-\nscribed in the text, has been drawn from the location of the Clus-\nter 1 spacecraft (black dotted line). In addition, a cut through the\nmodel magnetopause at YGSM ≈ 3.9RE (the approximate loca-\ntion of Cluster 1 at 10:20 UT) is indicated by the dashed blue line,\nwhilst the orientation of the Earth’s magnetic dipole is indicated by\nthe short black lines.\netry (CIS) experiment (Re`me et al., 1997, 2001). This instru-\nment is able to measure the full three-dimensional ion distri-\nbution of the major magnetospheric ions, namely H+, He+,\nHe++, and O+, from thermal energies to about 40 keV\/e.\nThe CIS experiment on board each of the Cluster space-\ncraft comprises two separate instruments: a COmposition\nand DIstribution Functions analyser (known as CODIF or\nCIS1) and a Hot Ion Analyser (HIA\/CIS2). The CODIF in-\nstrument is capable of measuring the mass per charge com-\nposition of the ion population with medium (22.5◦) angular\nresolution, whereas the HIA instrument offers no mass res-\nolution but has superior angular resolution (5.6◦). The CIS\ndata presented below were recorded by the HIA instrument\non board the Cluster 1 spacecraft and are presented at two\ndifferent temporal resolutions. First, moments of the three-\ndimensional distribution yielding the total ion number den-\n1812 J. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs\nsity (assuming that all measured ions are H+) are calculated\non board the spacecraft at spin (∼4 s) resolution; secondly,\nenergy-time ion spectrograms are retrospectively generated\nfrom the three-dimensional distributions acquired over three\nspins of the spacecraft (12 s).\nThe electron observations in the vicinity of the high-\nlatitude magnetopause included in this study were made\nby the Cluster Plasma Electron And Current Experiment\n(PEACE) (Johnstone et al., 1997; Owen et al., 2001). Each\nPEACE instrument (one per spacecraft) is equipped with two\nsensor heads, a Low- and a High-Energy Electron Analyser\n(LEEA and HEEA, respectively), which are mounted on op-\nposite sides of the spacecraft, each of which is capable of\nmeasuring electrons in the energy range 0.7 eV to ∼30 keV,\narriving from all directions during a spacecraft spin. During\nthe interval presented, the PEACE instrument was configured\nsuch that each sensor measured a subset of the maximum\npossible energy range with HEEA covering the upper part of\nthe energy range. Accordingly, the PEACE data included be-\nlow shows electron fluxes averaged over all look-directions\nof the HEEA sensor on board the Cluster 1 spacecraft and\nhas a temporal resolution equal to the spacecraft spin period\n(∼4 s).\n3 Observations\nThis paper focuses on ground-based radar observations of the\nionosphere, in both hemispheres, during a period when mag-\nnetic reconnection was occurring at the high-latitude dayside\nmagnetopause, characterised by the observation of a series\nof FTEs by the Cluster spacecraft. In order to examine the\nionospheric response to the inferred magnetospheric dynam-\nics, it is first necessary to present the in situ observations of\nFTEs in the vicinity of the magnetopause, and then show the\nground-based observations of the ionospheric flows that sub-\nsequently arose. However, as the in situ field and plasma\nobservations introduced in this section will be the subject of\na rigorous, multi-spacecraft, multi-instrument investigation\nto be published in a future companion study, this paper will\npresent an overview of the in situ data drawn from one Clus-\nter spacecraft only (Cluster 1).\n3.1 Cluster observations\nFigure 3 presents observations of the local magnetic field and\nparticle environment at the Cluster 1 spacecraft during the in-\nterval 09:15–11:15 UT on 14 February 2001, which includes\nthe outbound passage from the magnetosphere to the mag-\nnetosheath. Also displayed (upper panel) is the clock angle\nof the IMF measured upstream of the Earth and lagged by\n55 min, as discussed above. Since the upstream IMF con-\nditions and the magnetic field measured by the four Cluster\nspacecraft during this passage were discussed in detail in Pa-\nper 1, only a short review is presented here, in order to place\nthe newly available plasma observations in the context of the\nmagnetic field and ground-based signatures of FTEs reported\nby Wild et al. (2001).\nImmediately prior to the interval discussed here, the IMF\nwas oriented northward with a significant dawnward com-\nponent (BY negative, BZ positive). Following a reorien-\ntation at around 08:53 UT (lagged time) the IMF was di-\nrected predominantly southward (BZ∼−3 nT) and duskward\n(BY∼5 nT) during the interval presented, with corresponding\nIMF clock angles in the range 90–180◦, with the exception of\na few brief excursions into northward or dawnward orienta-\ntions. The magnitude of the IMF remained generally steady\nthroughout, varying slightly between 6 nT at the beginning\nof the interval and 5 nT toward the end.\nThe three panels beneath the ACE IMF data present ob-\nservations from the FGM instrument on board the Cluster 1\nspacecraft. As is usual when presenting magnetic field ob-\nservations from the region adjacent to the magnetopause, the\ndata are presented in a boundary-normal coordinate system\n(Russell and Elphic, 1978), where N is the estimated out-\nward normal to the magnetopause, L lies in the boundary\nand points north (such that the L − N plane contains the\nGSM Z axis), and M also lies in the boundary and points\nwest, orthogonal to L and N (such that (L,M,N ) forms a\nright-handed coordinate system). The first of these panels\npresents the BN component of the observed field, the second\npanel presents the total field magnitude, whilst the third panel\nshows the angle of the field in the plane of the magnetopause,\nαLM , defined as αLM = tan−1(BM\/BL). In order to present\nmagnetic field data in this coordinate system, it is, of course,\nfirst necessary to estimate the outward magnetopause normal\ndirection. In order to obtain a representative outward normal\ndirection for the magnetopause encountered during the cen-\ntral portion of the interval presented in Fig. 3, the minimum\nvariance analysis technique (Sonnerup and Cahill, 1967) was\napplied to the interval 10:00–10:40 UT, yielding an outward\nunit normal given by GSM components (+0.669, −0.262,\n+0.696). For a more detailed discussion regarding the de-\ntermination of this normal direction, the reader is directed to\nPaper 1.\nThe fifth and sixth panels of Fig. 3 present the total ion\nconcentration and energy-time spectrogram measured by the\nCIS HIA instrument on Cluster 1, respectively. Finally, the\nlower panel presents an energy-time spectrogram of electrons\nobserved by the HEEA sensor of the PEACE instrument, also\non board the Cluster 1 spacecraft.\nAt 09:15 UT on 14 February 2001 (the beginning of the\ninterval shown in Fig. 3) the Cluster 1 spacecraft was lo-\ncated within the magnetosphere at a radial distance of ap-\nproximately 10.9RE from the Earth and moving on an out-\nbound trajectory toward the high-latitude post-noon mag-\nnetopause. The observed magnetospheric field strength at\nthis time was ∼20 nT and directed mainly southward and\nwestward (BL negative, BM positive), as expected in the\nvicinity of the post-noon cusp. By 11:15 UT, the Cluster 1\nspacecraft had passed into the magnetosheath, the field be-\ning oriented southward and eastward (BL and BM negative)\nwhich, although still∼20 nT in magnitude, is consistent with\nJ. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs 1813\nIo\nn\ns\nEl\nec\ntr\no\nn\ns\nα\nFigure 3\n-2\n-1\n-1\n-1\n10\nLo\ng\n   D\nifferen\ntial En\nerg\ny Flu\nx\n(ev cm\n   sr   s   ev  )\nFig. 3. Plot of ACE and Cluster data for the interval 09:15–11:15 UT on 14 February 2001. The top panel shows the clock angle of\nthe interplanetary magnetic field measured at the ACE spacecraft and lagged by 55 min such that comparisons can be made with the Cluster\nobservation at the front of the magnetosphere. The next three panels present the component of the magnetic field normal to the magnetopause,\nthe total magnetic field strength, and the angle of the magnetic field in the plane of the magnetopause (the αLM parameter) measured by the\nFGM instrument on board the Cluster 1 (Rumba) spacecraft. The fifth and sixth panels present the total ion density profile and ion energy-\ntime spectrogram (all pitch angles) observed by the CIS2 (HIA) instrument on Cluster 1. Finally, the lower panel presents the electron energy\ndistribution measured in the field-parallel direction by the PEACE HEEA sensor, also on Cluster 1. Overlaid on this figure (dashed lines) are\nthe times of events originally identified by Wild et al. (2001) and discussed in the text. Specifically, the centre times of four magnetospheric\nFTEs, the entry into the boundary layer (BL), three crossings of the magnetopause (MP), and four magnetosheath FTEs are indicated.\nthe expected orientation of the field in the magnetosheath\nbased upon upstream IMF conditions. Plasma observations\nfrom the CIS and PEACE instruments also clearly indicate\nthe transition from magnetosphere- to magnetosheath-like\nplasma over the interval presented. The magnetospheric\nion concentration measured by CIS at the beginning of the\n1814 J. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs\ninterval was ∼ 0.1 cm−3, with the energy at the peak ion\nflux greater than ∼10 keV. This is compared to the observed\nion concentration of ∼10 cm−3 in the magnetosheath, where\nthe peak of ion energy distribution is significantly lower\n(∼1 keV). This transition from a hot, tenuous plasma to a\ncooler, denser plasma was reflected in measurements of the\nelectron population made by PEACE, which recorded a shift\nin the energy of the peak flux of the electron distribution from\na few keV in the magnetosphere to several tens of eV in the\nmagnetosheath.\nThe timings of several key features identified in Paper 1\nare indicated by dashed lines in the central portion of the\ninterval displayed in Fig. 3. At 10:09 UT, some 8 min prior to\nthe first magnetopause encounter, the spacecraft encountered\na boundary layer (marked “BL”) in which the magnetic field\nbecame increasingly variable, but generally veered toward\nthe direction of the field in the magnetosheath. Three clear\nmagnetopause crossings followed (labelled “MP”) occurring\nat ∼10:17 UT (magnetosphere-magnetosheath), ∼10:22 UT\n(magnetosheath-magnetosphere), and ∼10:33 UT (magneto-\nsphere-magnetosheath).\nPlasma observations, unavailable to us during the prepa-\nration of Paper 1, support our interpretation of three mag-\nnetopause transitions, the first of which was preceded by\nobservations of a boundary layer lasting several minutes.\nAt ∼10:09 UT CIS recorded an approximate factor of 20\nincrease in the ion concentration at the Cluster 1 space-\ncraft. Although variable over the next few minutes, this en-\nhanced ion concentration peaked at ∼7 cm−3 before settling\nat slightly lower values until just prior to the first magne-\ntopause crossing at ∼10:17 UT. This increase in concentra-\ntion was accompanied by a marked change in the ion popula-\ntion energy distribution from magnetosphere-like (∼10 keV)\nto more magnetosheath-like energies (several hundred eV to\na few keV). Significant structure, some of which appears\nto be energy dispersed, is also apparent within the bound-\nary layer. Following the first penetration of the magne-\ntopause at ∼10:17 UT, the observed plasma population was\nmagnetosheath-like in terms of ion concentration, ion energy\ndistribution and electron energy distribution. The subsequent\nmagnetopause crossing at∼10:22 UT returned the spacecraft\nto a plasma environment that was generally magnetosphere-\nlike in nature until ∼10:33 UT, when the spacecraft again\ncrossed the magnetopause, exiting the magnetosphere for the\nlast time on this pass.\nAs Cluster 1 approached the magnetopause for the first\ntime, the observed magnetic field became increasingly vari-\nable in both direction and magnitude. This was particu-\nlarly evident after∼09:00 UT, when the (lagged) IMF turned\nsouthward at the subsolar point. It is, therefore, highly\nlikely that the increased level of variability was directly\nlinked to sustained dynamic processes in the boundary re-\ngion. The most notable consequences of this are the four\nclear magnetospheric FTEs marked by the vertical dashed\nlines, observed at ∼09:45 UT, ∼09:54 UT, ∼09:59 UT,\nand ∼10:04 UT, prior to the entry into the boundary layer\nat ∼10:09 UT. These FTEs were characterised by bipolar\npositive-to-negative (“normal” polarity) perturbations in the\nnormal component of the magnetic field (BN ), and increases\nin the overall field strength. In addition, each FTE was\naccompanied by mixing of the magnetospheric and mag-\nnetosheath plasma populations. The exact nature of this\nmixing varied between the FTEs, although in general there\nwas an increase in the ion concentration, particularly at\nmagnetosheath-like energies (∼100 eV–5 keV) and, in some\ncases, a depletion of the more energetic magnetospheric\nion population. Similar enhancements of magnetosheath-\nlike plasma were observed in the electron measurements, al-\nthough the depletion of the magnetospheric electron popula-\ntion was more pronounced than in the case of the ions, pre-\nsumably reflecting the greater field-aligned mobility of the\nelectrons.\nFollowing the entry of Cluster 1 into the magnetosheath\nat ∼10:33 UT, further FTEs were observed with those\nat ∼10:36 UT, ∼10:43 UT, ∼10:46 UT, and ∼11:01 UT\n(marked by vertical dashed lines), being clear examples of\nFTE-like bipolar signatures in the magnetic field. These\nmagnetosheath FTEs are also associated with mixing of mag-\nnetosheath and magnetospheric plasma, with the enhance-\nment of magnetospheric electrons and ions being particularly\nprominent during the ∼10:46 UT event.\nIt is worth noting that analysis of the electron and ion\nobservations now available reveals further evidence of on-\ngoing dynamic processes at the high-latitude magnetopause\nthat was not obvious when considering the magnetic field\nobservations alone (as in Paper 1). From the outset of the\ninterval shown in Fig. 3 (almost 1 h prior to the first mag-\nnetopause encounter), there are indications of brief inter-\nvals of magnetosheath-like ion and electron fluxes and deple-\ntion of the magnetospheric electron population at Cluster 1.\nThe plasma observations also yield much additional struc-\nture associated with the magnetospheric and magnetosheath\nFTEs. In particular, it is possible to resolve short-lived\nenhancements in the magnetosheath-like ion and electron\nfluxes at ∼09:51 UT, ∼09:56 UT, ∼10:02 UT, ∼10:07 UT,\nand ∼10:27 UT. Once into the magnetosheath proper, addi-\ntional enhancements in the magnetospheric-like ion and elec-\ntron populations are apparent at ∼10:50 UT and ∼10:52 UT.\nWhilst it is not within the scope of this paper to analyse each\nof these events in detail, it is clear that throughout the inter-\nval 09:15–11:15 UT on 14 February 2001, magnetic recon-\nnection was occurring almost continuously at some locations\non the dayside magnetopause, which resulted in FTEs being\nobserved at the high-latitude post-noon boundary.\nOur interpretation of the field perturbations observed dur-\ning these FTE events is shown in Fig. 4a (we shall return to\nconsider Fig. 4b later). This shows a schematic of the day-\nside magnetopause viewed from the Sun, where the arrowed\ndashed lines show undisturbed magnetospheric field lines in\nthe magnetopause layer. Magnetic field lines interconnected\nwith the IMF\/magnetosheath are indicated by solid arrowed\nlines. We assume that the field perturbations observed by\nCluster were due to bursts of reconnection occurring east-\nward and equatorward of the spacecraft (although, as dis-\nJ. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs 1815\ncussed below, we do not suggest that reconnection is occur-\nring only in this region). In Fig. 4a reconnection is shown\noccurring at a point somewhere between the equator and the\nCluster spacecraft, near the point marked ‘1’ (the exact lo-\ncation is uncertain). Following reconnection, the combined\naction of the magnetosheath flow and the magnetic tension\nof the newly-opened field lines causes them to contract pole-\nward and westward in the Northern Hemisphere, forming\na sunward-moving boundary layer at the post-noon sector\nmagnetopause, such as is described, for example, by the sim-\nple magnetopause reconnection model of Cowley and Owen\n(1989). At subsequent times the open field line (shown by the\narrowed solid lines) is thus located at positions 2, 3, and 4. It\ncan thus be seen that the effect of the field tension is such as\nto cause newly-opened flux tubes at the Cluster location (near\n‘2’) to rotate towards a poleward and eastward orientation,\nin both the magnetosphere and magnetosheath. The west-\nward and poleward propagation of newly-opened magnetic\nflux tubes perturb the underlying (closed) magnetospheric\nflux tubes in the vicinity of Cluster such as to give positive-\nto-negative bipolar perturbations in the N component in both\nmagnetosphere and magnetosheath (as presented in Fig. 4a\nof Wild et al., 2001). This scenario is thus qualitatively con-\nsistent with the sense of the principal FTE field perturbations\nseen in Fig. 3. The ‘reversed’ and reduced field tilting effects\nobserved in the first three magnetospheric FTEs marked in\nthe figure, compared with the fourth, is taken to be due to the\nlarger distances from the magnetopause in the earlier events,\ncombined with the twisting of the field within the FTE struc-\nture, as found in earlier studies of ISEE1\/2 data (e.g. Cowley,\n1982; Paschmann et al., 1982; Saunders et al., 1984). The\nFTE structure as a whole is formed from the bundle of open\nfield lines produced by a given propagating burst of recon-\nnection (Milan et al., 2000; Wild et al., 2001). The twisting\nis often such that in the outer part of the FTE the field may\ntilt away from the direction of the field on the other side of\nthe boundary. Such tilts can also be produced in the unrecon-\nnected field immediately outside the FTE due to the flows\ninduced in the surrounding medium by the passage of the\nFTE structure (Southwood, 1985; Cowley, 1986).\nWhilst this interpretation of an active reconnection region\nlocated somewhere in the dusk sector equatorward of the\nCluster spacecraft is consistent with the observations, it is not\npossible to say whether the reconnection X-line lies on the\nequator or at higher or lower latitudes. Also, the Cluster data\nyields no information regarding the azimuthal extent of the\nreconnection region. For example, it is possible that recon-\nnection is also occurring in the pre-noon sector, as indicated\nin Fig. 4b. Here, reconnection has been assumed to occur at\nsome general location southward of the equatorial plane re-\nsulting in a similar evolution of newly-opened field lines to\nthat described in the Northern Hemisphere case presented in\nFig. 4a. Obviously, reconnected field lines with footprints in\nthe Northern Hemisphere are dragged tailward (dawnward)\nby field line tension effects and the motion of the solar wind\nand consequently away from the Cluster spacecraft.\n1\n2\n3\n4\n2´\nFigure 4\ni\nii\niii\niv\nii´\na.\nb.\nFig. 4. Sketch of the Earth’s dayside magnetopause in a view look-\ning from the Sun, showing (a) the temporal evolution of an open\nflux tube (solid lines marked ‘1’–‘4’) following a low-latitude re-\nconnection event in the dusk sector (near ‘1’) and (b) the temporal\nevolution of an open flux tube (solid lines marked ‘i’–‘iv’) follow-\ning a low-latitude reconnection event in the dawn sector (near ‘i’).\nThe grey arrows indicate the direction of open field line motion, in-\ncluding westward motion in the northern cusp and eastward motion\nin the southern cusp. The arrowed short-dashed lines indicate mag-\nnetospheric field lines within the magnetopause boundary region.\nWe also indicate the approximate location of the Cluster spacecraft.\n3.2 SuperDARN radar observations\nFigure 5 presents observations of received backscattered\npower and l-o-s ionospheric Doppler velocity as functions of\nmagnetic latitude and universal time from selected beams of\nthe Finland (Fig. 5a) and Syowa East (Fig. 5b) SuperDARN\nradars. These plots indicate backscattered signals that orig-\ninate from both ionospheric and ground scattering targets,\ncolour coded according to the scales indicated. Through-\n1816 J. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs\nFigure 5Fig. 5. Three pairs of backscatter power and Doppler shift measurements from (a) beams 1, 2, and 3 of the Finland radar and (b) beams 0,\n1, and 2 of the Syowa East radar, covering the same time interval as for the Cluster data in Fig. 3. In the Doppler shift panels, velocities are\nonly shown where significant power is observed. Grey backscatter indicates ground backscatter, and negative velocities represent Doppler\nshifts away from the radar along the line-of-sight. Poleward-moving radar auroral forms (PMRAFs) are indicated by arrows in the upper\npower panel for each radar; related events are observed in each of the other beams shown. Superimposed on each panel are the times of note\nidentified in the Cluster observations, as in Fig. 3.\nJ. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs 1817\nout the interval presented, the measured Doppler veloci-\nties at both the Finland and Syowa west radars were over-\nwhelmingly negative (flow away from the radars). Conse-\nquently, the velocity colour scales are such that only negative\nDoppler shifts are shown; where signals have been identi-\nfied as groundscatter (by exhibiting low Doppler velocity and\nnarrow Doppler spectral width) the appropriate velocity data\nare colour-coded grey. Also, attention is drawn to the differ-\nences in the colour-scales (both power and velocity) between\nFigs. 5a and b. This is necessary since the Syowa East radar\ngenerally observed stronger returned signals from lower ve-\nlocity (less negative) flows than the Finland radar. For com-\nparison, the timings of the key FTE and magnetopause en-\ncounters as discussed above and in Paper 1 are overlaid on\neach panel of Fig. 5.\nBeginning with a summary of the Northern Hemisphere\nobservations, first presented in Paper 1, the backscatter in the\nwesternmost portion of the Finland radar f-o-v (i.e. the beams\npresented) was characterised by a region of groundscatter at\nmagnetic latitudes equatorward of∼76◦, embedded in which\nwere regions of ionospheric scatter. The l-o-s Doppler ve-\nlocity of this ionospheric scatter of ≤ 300 m s−1 away from\nthe radar throughout. After approximately 10:10 UT, a re-\ngion of ionospheric backscatter developed slightly poleward\nof this (∼76◦–79◦) in which the l-o-s Doppler velocity was\nsignificantly higher (more negative). As discussed in Pa-\nper 1, inspection of the l-o-s velocity measurements in the\nregion of the estimated footprint of the Cluster spacecraft\ndid not reveal any significant pulsing of the ionospheric flow,\nprobably because the fluctuations did not have a significant\ncomponent in the l-o-s direction (which was predominantly\nmeridional) of the radar beam. It is the higher-latitude region\nof backscatter displayed in Fig. 5a that contains the clear-\nest radar signatures of FTEs, indeed examples of both PM-\nRAFs and PIFs are apparent during the interval. Two clear\nexamples of PMRAFs (narrow regions of backscatter with\nnegative Doppler velocity propagating ∼2◦ poleward over a\nperiod of a few minutes) were observed at ∼09:21 UT and\n09:41–09:45 UT in beams 1 to 3 of the Finland radar. During\nthe interval 10:10-10:50 UT, several further events were ob-\nserved that could be classified as both PMRAFs and PIFs; the\nbackscatter poleward of∼76◦ latitude during this period was\nalmost continuous but several poleward-moving enhance-\nments in the backscattered power associated with elevated\nl-o-s Doppler velocity were seen. These events are clearest\nin the backscattered power and Doppler velocity measure-\nments from beam 1 and are marked by arrows in the upper\npanel of Fig. 5a. Finally, two further PMRAFs with similar\ncharacteristics to those seen at the beginning of the interval\nare observed at ∼10:57 UT and ∼11:07 UT, and these are\nalso marked by arrows in Fig. 5a.\nTurning now to the newly available measurements from\nthe Syowa East radar (Fig. 5b), it is immediately appar-\nent that on this occasion the nature of the backscatter ob-\nserved in the northern and southern conjugate ionospheres\nwere markedly different. The Southern Hemisphere radar\nobserved a region of backscatter in the most poleward point-\ning beams of the f-o-v (beams 0–8) extending from ∼−75◦\nto −78◦ magnetic latitude. Unfortunately, this region of\nbackscatter did not generally include the ionospheric foot-\nprint of the Cluster spacecraft, and the observations pre-\nsented originate from∼2◦ poleward and∼1–2 h MLT further\nwest. In comparison to the Northern Hemisphere measure-\nments the echoes received at the Syowa East radar were sig-\nnificantly stronger (higher received signal power), but were\nassociated with generally smaller Doppler shifts. However,\nas in the Northern Hemisphere, the measured l-o-s Doppler\nvelocities were almost exclusively directed away from the\nradar (negative Doppler shifts). Of course, it must be re-\nmembered that the pointing direction of the Syowa East radar\nis quite different from the Finland radar; at ∼75◦ magnetic\nlatitude, the Finland radar beams presented in Fig. 5 (and\nshown in Fig. 1) point poleward and westward, whereas the\nSyowa beams (in the opposite hemisphere) point poleward\nand eastward. Consequently, the negative Doppler shifts ob-\nserved by the Syowa East radar during this interval corre-\nspond to a poleward and eastward flow component in the\nSouthern Hemisphere (compared to poleward and westward\nflow component observed by the Finland radar in the North-\nern Hemisphere). Also, the presented beams of the Syowa\nEast radar are more azimuthally pointing than those of the\nFinland radar and are, therefore, more sensitive to the zonal\ncomponent of the ionospheric flow. In further contrast to\nthe Northern Hemisphere observations, the flow within the\nbackscatter is broadly similar over the latitude range pre-\nsented (that is to say that the two bands of backscatter ob-\nserved in the Northern Hemisphere, each with substantially\ndifferent flow characteristics were not matched in the South-\nern Hemisphere). Embedded within and extending from the\nregion of Southern Hemisphere backscatter were several ex-\namples of PMRAFs\/PIFs (indicated by arrows in the power\npanel for beam 0). Due to the generally lower Doppler ve-\nlocities observed in the Southern Hemisphere (compared to\nthose in the higher latitude band of scatter in the North-\nern Hemisphere) the subtle differences between the velocity\nwithin the poleward moving structure and the surrounding\nbackscatter are not always obvious, although the PMRAFs\nare apparent, extending from the poleward edge of the scat-\nter at 09:20–09:22 UT, 09:26–09:32 UT, 09:53–09:57 UT,\n11:02–11:05 UT, and 11:06–11:10 UT.\nIn Paper 1, Wild and co-workers demonstrated a pulsing of\nthe flow in the lower latitude band of scatter observed in the\nNorthern Hemisphere. This pulsing was in addition to the\nPMRAF\/PIFS observed at higher latitudes and in the band\nof scatter that corresponded to the approximate latitude of\nthe Cluster footprint, albeit some 2 h of MLT westward. Fig-\nure 6a presents evidence of such pulsing, drawn from beam 3\nof the Finland radar (this beam was chosen as it has the\nlongest unbroken series of measurements in the lower lati-\ntude backscatter region). In order to highlight the l-o-s veloc-\nity fluctuations in the lower latitude band of radar backscat-\nter, a colour scale with a reduced velocity range compared\nto that in Fig. 5a has been employed. Using this modi-\nfied colour scale, the poleward-propagating organisation of\n1818 J. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs\na.\nb.\nc.\nFigure 6\nFig. 6. (a) Velocity data from beam 3 of the Finland radar, in a format similar to that in Fig. 5, but with a revised colour scale which reveals\nthe pulsing of the line-of-sight flow in the band of lower-latitude scatter. (c) Velocity data from beam 0 of the Syowa East radar, presented\nin the format of (a), albeit with a different colour scale and a reversed latitude axis. (b) The mean velocity averaged over the latitude range\nindicated by dashed horizontal lines in (a) and (c) (and given positive values in this case, though in each case the flow is directed away\nfrom the radars). The indigo trace corresponds to the Finland average velocities, whilst the red trace corresponds to the Syowa East average\nvelocities. Superimposed on each panel are the times of note identified in the Cluster observations, as in Fig. 3.\nthe velocity features in the latitude range ∼74.5◦–76.0◦ N is\nclear. In order to further emphasise the velocity pulsations,\nthe average l-o-s Doppler speed between these latitudes (in-\ndicated by dashed lines) is presented in Fig. 6b. This dis-\nplays the average flow speed measured in the direction away\nfrom the Finland radar (i.e. negative velocities), as indigo\ncircles joined by indigo lines. As reported in Paper 1, the\nenhancements in the average Doppler velocity measured by\nthe Finland radar occurred in association with each of the\nfour magnetospheric FTEs, with peak values occurring typi-\ncally 1-2 min after what had been judged to be the “centre”\ntime of the FTEs inferred from Cluster magnetic field data\n(indicated by dashed lines in Fig. 6). Of course, depending\nupon the relative propagation times from the reconnection\nsite over the magnetopause to the spacecraft, along the mag-\nnetic field to the ionosphere, and from then on to the radar\nJ. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs 1819\nfield-of-view, the relative timing of such pulses for individual\nevents will vary slightly. It is expected that these propagation\ntimes will typically be ∼1–5 min, therefore, ∼1–2 min dis-\nplacements in either direction are not unexpected, depending\nupon the various factors influencing the propagation delay\nin each case. This interpretation is supported by the Cluster\nplasma observations now available, indeed additional FTE-\nlike events identified from the electron and ion observations\ndiscussed above can be related to additional variations in the\nFinland radar flow observations and may further explain the\nsmaller velocity enhancements between the peaks associated\nwith each of the marked FTEs.\nIt is worthwhile to compare the average ionospheric flow\nvelocity at the approximate magnetic latitude of the Cluster\nfootprint in the Northern Hemisphere with those at equiva-\nlent latitudes in the Southern Hemisphere. The red circles\nand lines in Fig. 6b indicate the corresponding average flow\nspeed measured in the direction away from beam 0 of the\nSyowa East radar over the latitude range ∼74.5◦–76.0◦ S.\nThese data are drawn from the l-o-s Doppler velocity mea-\nsurements presented in Fig. 6c (and shown in Fig. 5b but\nwith differing velocity and latitude scales). It is immedi-\nately apparent that the average flow velocity in the South-\nern Hemisphere consists of similar velocity fluctuations\nto those observed in the Northern Hemisphere (typically\n∼200–300 m s−1 variations with ∼5–10 min periodicity) but\nsuperimposed upon a background flow of ∼300 m s−1. Note\nalso that at the beginning of the interval presented the South-\nern Hemisphere radar observed sustained backscatter with\nflow = 1000 m s−1 directed away from the radar, whilst in\nthe Northern Hemisphere scattering targets were not present.\nBy the end of the interval, the average flow velocity over the\n∼74.5◦–76.0◦ latitude range in both hemispheres had con-\nverged to approximately 400 m s−1 (±200 m s−1).\nThe Northern Hemisphere observations suggest a relation-\nship between the FTE signatures observed by Cluster at the\nhigh-latitude post-noon magnetopause and enhancements in\nl-o-s Doppler velocity and power observed in the backscatter\nechoes. In particular, these enhancements are observed in the\nlower latitude (∼74.5◦-76.0◦ N) westward flow region. As\nindicated in Fig. 4a, this westward flow is consistent with the\nexpected motion of recently connected magnetic flux tubes\nas they are dragged dawnward and poleward, first by mag-\nnetic tension effects acting on the kinked field lines, and then\nby the antisunward motion of the solar wind. It is espe-\ncially interesting that there is such excellent correspondence\nbetween the ground- and space-based observations, despite\nthe measurements of ionospheric flow being made ∼2 h of\nMLT to the west of the Cluster footprint. It is unfortunate\nthat similar observations could not be made in closer prox-\nimity to the Cluster footprint. However, as discussed above,\nthe radar look-direction in the ionosphere directly conjugate\nto the spacecraft was approximately north-south and, there-\nfore, insensitive to the westward flow variations, and it is\nexpected that the events and associated ground-based signa-\ntures under study are large in spatial scale. The observation\nof ionospheric flow modulations some 2 h of MLT westward\nof the Cluster footprint in the Northern Hemisphere iono-\nsphere adds further weight to this supposition. In Paper 1,\nWild et al. noted that some ground-based events were ob-\nserved without a clear FTE signature at the Cluster space-\ncraft, such as the Northern Hemisphere PMRAFs observed\nat ∼09:21 UT and ∼09:41 UT. It was proposed that this\nwas due to the greater displacement of the spacecraft from\nthe magnetopause at the beginning of the interval, with each\nspacecraft simply too far away from the boundary to ob-\nserved the related FTE signatures. With the benefit of plasma\nmeasurements it can be seen that this interpretation (based\nupon magnetic field measurements alone) is supported by\nobservations of weak enhancements of magnetosheath-like\nion and electron fluxes during the period prior to the FTE\nobserved at∼09:45 UT. Indeed, the∼09:21 UT PMRAF co-\nincided with a clear burst of magnetosheath-like ions, a re-\ngion of elevated magnetosheath-like and depleted magneto-\nspheric electron fluxes, and bipolar fluctuations in the nor-\nmal component of the magnetic field. Very brief (∼30 s)\nbursts of magnetosheath-like electron fluxes were also ob-\nserved around the time of the ∼09:41 UT PMRAF, although\nit is difficult to resolve distinct enhancements in the ion pop-\nulation associated with these features.\nThe Cluster magnetic field observations and the Northern\nHemisphere measurements of ionospheric flow presented in\nPaper 1 were interpreted as consistent with a propagating\nburst of low-latitude reconnection that originated near the\nnoon meridian and then propagated to later local times. Once\nthe reconnection patch had propagated sufficiently duskward\nof the Cluster spacecraft, the dawnward motion of newly-\nopened flux tubes gave rise to the field-tilting effects apparent\nin the in situ magnetic field measurements and the propagat-\ning transient features in the ground-based measurements of\nionospheric flow. Although it was acknowledged that such\na propagating burst of reconnection could also propagate to-\nward earlier local times, no observations were available to\ndetermine whether or not this was actually the case on this\noccasion.\nIn order to further elucidate the large-scale ionospheric\nflow pattern, the perturbations of which have been presented\nabove, we shall employ the “map potential” technique de-\nveloped by Ruohoniemi and Baker (1998). This technique\nyields large-scale global convection maps from the l-o-s ve-\nlocity measurements from multiple radars, via mathematical\nfitting of the data to an expansion of the electrostatic poten-\ntial in spherical harmonics. First, the l-o-s data are filtered\nand then mapped onto a polar grid. These “gridded” mea-\nsurements are then used to determine a solution for the elec-\ntrostatic potential distribution that is most consistent with\nthe available measurements. The electric potentials of the\nsolution then represent the plasma streamlines of the mod-\nelled convection pattern. As backscatter targets (and there-\nfore l-o-s velocity measurements) are not always available,\ninformation from the statistical model of Ruohoniemi and\nGreenwald (1996), parameterised by IMF conditions, is used\nto stabilise the solution where no measurements are made.\nFigure 7 presents the dayside Northern and Southern Hemi-\n1820 J. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs\n14 FEBRUARY 2001\n09:40:00 - 09:45:00 UT\n2000 m\/s\nm\/s\n \n0\n60\n65\n70\n75\n80\n85\n90\nA\nB\nE\nF\nG\nK\nT\nW\n-\n33\n-21\n-\n21\n-\n9\n-\n9\n-9\n3\n3\n15\n15\n15\n09 MLT15 MLT\n00 MLT\n12 MLT\n06 MLT18 MLT\n03 MLT21 MLT\nNORTHERN HEMISPHERE\n-60\n-65\n-70\n-75R\n-9\n3\n15\n \n0\n-80\n-85\n-90\nH\nJN\n-\n21\n-\n21\n-\n9\n-\n9\n-9\n-\n9\n3\n3\n15\n15\n27\n27\nSOUTHERN HEMISPHERE\n09 MLT15 MLT\n12 MLT\n06 MLT18 MLT\nAPL MODEL\n4<BT<6\nBz-\/By+\n+Z\n+Y\n  (5 nT)\n(-55 min)\nFigure 7\nFig. 7. Streamlines and vectors of the ionospheric flow derived from SuperDARN velocity measurements in the dayside Northern (upper\npanel) and Southern (lower panel) Hemisphere ionosphere, obtained from the “map-potential” technique described in the text. Solid (dashed)\nblack lines represent streamlines corresponding to negative (positive) equipotential contours. The data are presented on a geomagnetic grid\nwith lines of constant magnetic latitude at 5◦ increments indicated by the dotted concentric circles. Magnetic local time meridians are\nrepresented by solid lines at 06, 09, 12, 15, and 18 MLT. The velocity vectors are scaled and colour-coded to indicate flow speed as described\nin the key to the right. In addition, in the lower right corner we indicate the flow model employed to stabilize the potential solution in regions\nwhere no data are available, obtained from the statistical study of Ruohoniemi and Greenwald (1996).\nsphere ionospheric convection patterns, each averaged over\nthe period 09:40–09:45 UT on 14 February 2001. Dotted\nconcentric semi-circles indicate lines of constant magnetic\nlatitude in 5◦ increments whilst local noon is located at the\ntop of each plot with dawn on the right-hand side and dusk\non the left, as if the observer were looking down from a loca-\ntion above the northern magnetic pole. Note that for consis-\ntency, the same arrangement has been used for the Southern\nHemisphere. The temporal averaging (∼5 min) is necessary\nin this case, as there were generally insufficient l-o-s data in\neach individual scan (∼1 min) to satisfactorily constrain the\nsolution for the electrostatic potential. Although this tech-\nnique is equally applicable to both the Northern and Southern\nHemispheres, the Ruohoniemi and Greenwald (1996) statis-\ntical model is based upon measurements from the Northern\nHemisphere Goose Bay radar only. As no equivalent sta-\ntistical model of the large-scale Southern Hemisphere iono-\nspheric convection pattern is currently available, the North-\nern Hemisphere model is employed but with the IMF BY se-\nlection parameter reversed, i.e. it is assumed that the iono-\nspheric convection pattern is approximately anti-symmetrical\nin opposite hemispheres, due to the differing consequences\nof a non-zero dawn-dusk component of the IMF. For exam-\nple, during the interval presented, the (lagged) IMF condi-\ntions relevant to the parameterisation of the statistical model\nwere IMF BY + ve, BZ - ve with the field strength ∼5 nT,\nas indicated in the lower right-hand corner of Fig. 7. Con-\nsequently, the Ruohoniemi and Greenwald (1996) North-\nern Hemisphere convection pattern for 4 nT < |BIMF| < 6 nT\nwith BY + and BZ - was employed to stabilise the Northern\nHemisphere fit, whereas the 4 nT < |BIMF| < 6 nT with BY -\nand BZ - statistical convection pattern was used to stabilise\nthe Southern Hemisphere solution. In this study, spherical\nharmonic fits which use terms up to the fourth power are em-\nployed to fit the data from eight Northern Hemisphere and\nfour Southern Hemisphere SuperDARN radars. The loca-\ntions of the radars on the dayside (i.e. those appearing in\nFig. 7) at the time of the plot are indicated by alphabetical\nidentifiers, these being Finland (F), Iceland East (E), Ice-\nland West (W) and Goose Bay (G) in the Northern Hemi-\nJ. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs 1821\nsphere and Syowa East (N), Syowa South (J) and Halley Bay\n(H) in the Southern Hemisphere (the other radars being lo-\ncated on the nightside at this time). The solid (dashed) black\nlines represent the negative (positive) equipotential contours,\nand therefore, the ionospheric plasma flow streamlines, de-\ntermined from the map potential algorithm. The coloured\ndots indicate locations where radar l-o-s velocity data are\navailable. The vectors drawn from these dots, sometimes re-\nferred to as “true vectors”, are calculated by combining the\nmeasured l-o-s velocity and the component of the convection\nflow (from the fitted solution) that is orthogonal to the l-o-\ns direction (i.e. the radar beam) at each location. Both the\nvectors and the dots are colour coded according to the true\nvector’s velocity magnitude, as indicated by the colour scale\non the right-hand side of the figure; the length of the vector\nalso indicates the magnitude of the velocity at that location,\nthe scale is shown on the right-hand side of the figure. In gen-\neral, the true vectors in Fig. 7 are approximately aligned with\nthe derived flow streamlines, suggesting that in most cases,\nthe solution is a good fit to the l-o-s velocity data available.\nUnfortunately, by averaging over a 5-min period, short dura-\ntion velocity fluctuations, such as those presented in Fig. 5,\nare effectively smoothed out, and it is chiefly for this reason\nthat only two representative convection maps are presented\nhere. In any case, the map potential technique is not intended\nto accurately image small-scale features in the global con-\nvection pattern and given the limited backscatter observed\nduring the interval presented, it would perhaps be unwise\nto over-interpret the results. Nevertheless, the Northern and\nSouthern Hemisphere convection patterns presented in Fig. 7\nclearly illustrate the large-scale ionospheric flow observed\nby the radars during this interval, and onto which the small-\nscale flow disturbances discussed above are superimposed.\nIn the map corresponding to the Northern Hemisphere, the\nnoon sector ionospheric flow between∼75◦–80◦ N MLAT is\npredominantly westward, with ionospheric plasma moving\nalong streamlines from later to earlier local times and turn-\ning antisunward (as indicated by stronger poleward velocity\ncomponents in the western portion of the Finland radar f-o-\nv) as the flow diverts into the polar cap in pre-noon sector.\nThe flows measured by the Goose Bay radar are consistent\nwith this configuration with predominantly sunward flows\nbeing observed at lower latitudes in the dawn sector. This\nflow pattern is in contrast to that inferred from the Southern\nHemisphere data; as shown in the Syowa East l-o-s veloc-\nity measurements presented in Figs. 5 and 6, the ionospheric\nflow in the noon sector between ∼75◦–80◦ S MLAT is al-\nmost exclusively eastward with ionospheric plasma moving\nfrom earlier to later local times before diverting into the po-\nlar cap. More extensive backscatter in the Southern Hemi-\nsphere polar cap at this time has allowed the throat of the\nhigh-latitude convection pattern to be imaged with some con-\nfidence. In comparison to the Northern Hemisphere where\nthe flow into and across the polar cap appears to be directed\nalmost antisunward at ∼11 MLT, the Southern Hemisphere\nflow had a much larger duskward component at this loca-\ntion. However, it is interesting to note, despite the limited\nbackscatter available, the remarkable consistency of the flow\npatterns presented with the inferences regarding the motion\nof newly-reconnected field line footprints based upon line-\nof-sight data alone and the theoretical predictions of expected\nflow patterns based upon IMF conditions (Cowley and Lock-\nwood, 1992). The estimated pre-noon location of the throat\nof the convection pattern in both the Northern and South-\nern Hemispheres is, at least in part, a consequence of the\nRuohoniemi and Greenwald (1996) statistical model of iono-\nspheric convection employed by the map potential technique\nto stabilise the solution where no l-o-s data are available.\nThis model, based upon six years of observations from the\nGoose Bay SuperDARN radar, suggests that the throat of\nthe Northern Hemisphere high-latitude ionospheric convec-\ntion pattern is located in the pre-noon sector regardless of\nwhether the IMF has either a duskward or dawnward compo-\nnent. Consequently, the selection of the appropriate statisti-\ncal model for the Southern Hemisphere, corresponding to the\nreverse of the observed IMF BY component, is not expected\nto shift the convection Southern Hemisphere throat into the\npost-noon sector. Of course, irrespective of the chosen statis-\ntical model, the estimated convection flow in the regions con-\ntaining ionospheric scatter is influenced primarily by l-o-s\nvelocity data, as is the case in the vicinity of the Northern and\nSouthern Hemisphere convection throats presented here. The\nasymmetric location of the convection throat in the pre-noon\nsector for both positive and negative BY conditions has been\nreported previously. For example, Moses et al. (1987) pre-\nsented a time dependent model of ionospheric flow patterns\nthat incorporated a realistic day-night ionospheric conduc-\ntivity gradient. Once this conductivity variation was taken\ninto account, mirror symmetry between positive and negative\nIMF BY convection patterns was destroyed, and the model\nreproduced the main features of ion flow observations made\nby spacecraft over the polar cap (e.g. Heelis, 1984; Burch\net al., 1985). Furthermore, although the convection throat\nis located slightly dawnward of noon in both the Northern\nand Southern Hemisphere convection patterns presented in\nFig. 7, the asymmetry of the plasma motion into the throat\nin the ∼11:00 MLT sector is quite apparent (being predomi-\nnantly dawnward in the Northern Hemisphere and duskward\nin Southern Hemisphere). This suggests that in each hemi-\nsphere the region of the ionosphere that maps to the recon-\nnection location on the magnetopause, the so-called “merg-\ning gap”, is extended in azimuth and not limited to the rel-\natively narrow convection throat. Consequently, Fig. 7 hints\nat the extended (or multiple) nature of the reconnection site\n(or sites) necessary to produce the observed pulsations in\nthe ionospheric flow velocity and PIFs\/PMRAFs observed at\nhigher latitudes in both hemispheres. Given that the obser-\nvations presented above are consistent with the dusk-dawn\npropagation of newly-reconnected flux tubes over the Clus-\nter spacecraft in the Northern Hemisphere post-noon sector,\nit is to be expected that radar observations of the Northern\nHemisphere noon sector ionosphere will indicate enhance-\nments in the dawnward and poleward flow. The plasma\nstreamlines in the Northern Hemisphere convection map sug-\n1822 J. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs\nNOON\nDUSK DAWN\nNOON\nDUSK DAWN\nNOON\nDUSK DAWN\nNOON\nDUSK DAWN\nNORTHERN HEMISPHERE SOUTHERN HEMISPHERE\na. b.\nc. d.\nNORTHERN HEMISPHERE SOUTHERN HEMISPHERE\nFigure 8\nFig. 8. Schematic indicating the expected perturbations to the ionospheric open-closed field line boundary (OCFLB) and the resulting\nionospheric flows due to the addition of open flux during a flux transfer event. In each figure, the view is from a location above the northern\nmagnetic pole, with the noon meridian indicated by a long dashed line and dawn (dusk) located to the right (left) of the plot. In each case\nthe OCFLB is represented by a solid black line. The field-of-view of the Finland (Syowa East) radar is indicated in the Northern (Southern)\nHemisphere by the grey shaded region at approximately 10:00 UT. Where a perturbation (i.e. a region of newly-opened flux tubes appended\nto the OCFLB) is shown, the quasi-equilibrium position of the boundary is indicated by a short dashed line. Following integration into the\n(open) polar cap, the region of newly-opened flux is indicated by a dot-dashed line whilst the ionospheric flow that brings about the inclusion\nof this region into the polar cap is indicated by a shaded arrow. The expected Northern and Southern Hemisphere responses to the addition of\nopen flux in the post-noon sector are shown in (a) and (b) respectively. Similarly, the expected Northern and Southern Hemisphere responses\nto the addition of a spatially extended region open flux that straddles noon are shown in (c) and (d).\ngest the direct motion of the footprints of newly-opened flux\ntubes from the vicinity of Cluster (∼14:00 MLT) toward the\nFinland radar f-o-v. However, this is most certainly not the\ncase in the Southern Hemisphere. In order to pass in an\neasterly (duskward) direction through the Syowa East f-o-v\n(also located in the noon sector), the newly-opened flux tubes\nmust originate from a location significantly westward (dawn-\nward). Clearly, the flow perturbations and transient features\nobserved by these two radars are the result of either an X-line\nextended over many hours of local time (at least four) or mul-\ntiple reconnection sites separated in azimuth by a similar dis-\nplacement.\nReferring once again to Fig. 4, it is clear that low-latitude\nreconnection limited to a region duskward of the Cluster\nspacecraft (near to 1 in Fig. 4a) would not result in the iono-\nspheric disturbances observed close to noon in both hemi-\nspheres during this interval. Once reconnection had oc-\ncurred, newly-opened flux tubes in the Southern Hemisphere\nwould be dragged duskward and antisunward (away from\nnoon as indicated by 2’ in Fig. 4). This is illustrated schemat-\nically in Figs. 8a and 8b. Figure 8a presents a view of the day-\nside portion of the open-closed field line boundary (OCFLB)\nin the high-latitude Northern Hemisphere ionosphere look-\ning down from a location above the North Pole. The OCFLB\nitself is indicated by a solid black line, whilst the f-o-v of\nthe Finland radar is represented by the grey shaded area. In\nFig. 8a, a bundle of recently opened magnetic flux tubes have\nbeen appended to the equatorward edge of the OCFLB due\nto a spatially limited burst of reconnection somewhere in the\npost-noon sector. This has lead to a bulge in the boundary\naway from its quasi-equilibrium position in the post-noon\nsector, as indicated by the dashed line. Over time, this re-\ngion of newly-opened flux is integrated into the polar cap\n(indicated by the region bounded by the dot-dashed line) as\nthe newly-opened flux tubes are dragged dawnward and pole-\nward, by field tension effects acting on the kinked field lines,\nand then by the antisunward motion of the solar wind (indi-\ncated by the arrow). The resulting ionospheric flow is, there-\nfore, directed westward (dawnward) and poleward across the\nf-o-v of the Finland radar, consistent with the observations\npresented above. Figure 8b presents the corresponding sce-\nnario in the Southern Hemisphere ionosphere. Clearly the\nJ. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs 1823\nduskward and antisunward motion of the bundle of newly-\nopened flux tubes as they are integrated into the open polar\ncap region will result in the excitation of ionospheric flows\nthat are outside of, and directed away from, the f-o-v of the\nSyowa East radar.\nConsequently, if the magnetospheric and ionospheric sig-\nnatures of FTEs observed during this interval are the conse-\nquences of a burst of low-latitude reconnection, the South-\nern Hemisphere ionospheric flow disturbances must be in re-\nsponse to FTEs originating dawnward of the noon meridian\nand propagating duskward (as indicated in Fig. 4b). Cer-\ntainly, the observations presented indicate that during this in-\nterval, reconnection is not limited to a single, spatially lo-\ncalised region.\nMoreover, the reconnection processes responsible for the\nmagnetospheric and ionospheric dynamics observed during\nthe interval under scrutiny must be either multiple in nature\nor sufficiently extended so as to initiate FTE signatures over\nmany (∼4) hours of MLT. Whether or not multiple reconnec-\ntion sites are a consequence of the propagation of the recon-\nnection region wave-like over the magnetopause is difficult\nto determine from the data presented above, although the ob-\nservations in this case can be interpreted as consistent with\na reconnection site propagating away from noon. However,\na one-to-one correspondence between the pulsations in the\nionospheric flow at the approximate latitude of the Cluster\nfootprint in each hemisphere would suggest (i) a single re-\nconnection region that drives ionospheric flow bursts in both\nhemispheres almost simultaneously and (ii) that this recon-\nnection region must extend over many hours of local time,\nin order to drive noon-sector ionospheric flows that are op-\npositely directed (in azimuth at least) in each hemisphere.\nReturning to Fig. 6, the correspondence between the aver-\nage l-o-s flow velocity measured in the Northern and South-\nern Hemispheres is quite remarkable, especially between\n∼09:40–10:20 UT. Although there are insufficient data to\nperform a rigorous cross-correlation analysis of this appar-\nent correspondence, and despite an offset of ∼300 m s−1, it\nis clear that between ∼09:40–10:00 UT, the velocity varia-\ntions in the Southern Hemisphere lead those in the North-\nern Hemisphere by ∼2–3 min. Further correspondence can\nbe seen in the interval ∼10:00–10:20 UT, although the lag\nbetween the pulsations in each hemisphere appears greatly\nreduced. Certainly, it is possible to identify similarities be-\ntween the two average velocity profiles, albeit with a vari-\nable interhemispheric lag. Such small interhemispheric dif-\nferences are to be expected if the reconnection region driv-\ning the ionospheric flows is significantly extended in local\ntime, especially considering the significant IMF BY compo-\nnent prevailing during this interval.\nReconnection over a wide range of local times can be en-\nvisaged as a combination of the field line evolution presented\nin Figs. 4a and b, whilst the ionospheric response to such a\nspatially extended reconnection site is presented schemati-\ncally in Figs. 8c and d. The scenario indicated in Fig. 8c is\nsimilar to that in Fig. 8a, except that the reconnection region\nstraddles noon, extending over ∼4 h of local time. This re-\nconnection region has resulted in a bulge in the pre- and post-\nnoon sectors of the Northern Hemisphere OCFLB which,\nfor the reasons stated above, will be dragged dawnward and\npoleward across the quasi-equilibrium OCFLB. It is expected\nthat the motion of the ionospheric footprint of these flux\ntubes would not significantly alter the expected ionospheric\nflow within the f-o-v of Finland radar compared to the ex-\npected dawnward and poleward flows that would be excited\nby a spatially limited reconnection region in the afternoon\nsector (Fig. 8a). However, a reconnection site that extends\ninto the pre-noon sector will significantly alter the expected\nflow in the Syowa East radar located in the Southern Hemi-\nsphere, as indicated in Fig. 8d. The duskward and poleward\nmotion of the footprint of newly-opened flux tubes is directed\ninto the f-o-v of the Syowa East radar where observations\nof eastward and poleward flow are, therefore, expected. In\nother words, whilst the simultaneous observation of FTEs\nin the high-latitude post-noon magnetopause (from Cluster)\nand pulsed westward (dawnward) flow in the Northern Hemi-\nsphere noon-sector ionosphere (from the SuperDARN Fin-\nland radar) presented by Wild et al. (2001) were consistent\nwith either of the scenarios presented in Fig. 8a or Fig. 8c,\nthe observations of pulsed eastward (duskward) flow in the\nSouthern Hemisphere noon-sector ionosphere (from the Su-\nperDARN Syowa East radar) are consistent with Fig. 8d, but\nnot Fig. 8b. Thereforewe must conclude that during this in-\nterval, a sustained interval of pulsed magnetic reconnection\nwas occurring simultaneously in both the pre- and post-noon\nsectors. Furthermore, the correspondence between the flow\nmodulations in the Northern and Southern Hemisphere iono-\nspheres presented above suggest that reconnection was oc-\ncurring in a single spatially extended region spanning at least\n4 h of local time.\n4 Summary\nIn this paper we have extended the work of Wild et al. (2001)\nin order to compare the ionospheric flow response in both the\nNorthern and Southern Hemisphere ionospheres during an\ninterval in which the Cluster spacecraft, located in the vicin-\nity of the high-latitude post-noon magnetopause, observed a\nseries of FTEs. These FTEs were characterised by several\nlong-period (a few minutes) magnetic disturbances and the\nmixing of magnetosphere- and magnetosheath-like plasmas.\nThe magnetospheric FTEs were observed close to the loca-\ntion of, and are similar in form to the original “flux erosion\nevents” observed in HEOS2 data by Haerendel et al. (1978).\nAs demonstrated by Wild et al. (2001), the field perturbations\nobserved in these events, both in terms of the sense of the\nbipolar signatures in the field component normal to the mag-\nnetopause, and of the field shears observed in the plane of the\nmagnetopause, are consistent with the observation of open\nflux tubes connected to the Northern Hemisphere ionosphere\nwhich were formed by pulsed reconnection at the post-noon\nmagnetopause.\n1824 J. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs\nHigh frequency coherent-scatter radar observations of the\nNorthern Hemisphere ionospheric flow in the noon sector at\nthe magnetic latitude of the Cluster footprint indicate a band\nof backscatter which corresponds to the cusp ionosphere lo-\ncated just poleward of the open-closed field line boundary.\nThe flow within this region of backscatter is predominantly\nwestward and poleward, consistent with the BY positive IMF\nconditions at the time. The line-of-sight Doppler velocity\nand backscattered power within this region of backscatter, as\nmeasured by the SuperDARN Finland radar, was observed\nto pulse in close synchronization with the FTEs observed\nby Cluster. Furthermore, the flow and power pulses were\nobserved propagating poleward within the radar’s field-of-\nview, forming classic “pulsed ionospheric flow” and “pole-\nward moving radar auroral form” signatures. Measurement\nfrom the Syowa East radar which is located in the South-\nern Hemisphere conjugate to the Finland radar indicate that\nthe ionospheric flow is directed eastward and poleward, once\nagain consistent with the prevailing BY positive IMF condi-\ntions. The Southern Hemisphere observations also indicate a\npulsing of the flow and backscattered power at the approxi-\nmate latitude of the Cluster footprint and PIF\/PMRAF signa-\ntures at higher magnetic latitude. Furthermore, there appears\nto be a good correspondence with the features observed in the\nNorthern Hemisphere ionosphere during part of the interval\npresented.\nWhilst it is clear that both Northern and Southern Hemi-\nsphere radars are observing the classic ionospheric signatures\nof FTEs, only the Northern Hemisphere observations corre-\nspond to the in situ observations of FTEs made by the Cluster\nspacecraft. Following reconnection, flux tubes whose foot-\nprint remains in the Northern Hemisphere will be dragged\nwestward and poleward via the combination of magnetic\nfield tension and the antisunward motion of solar wind. This\nmotion results in the ionospheric footprint of post-noon sec-\ntor flux tubes being dragged through the field-of-view of the\nSuperDARN Finland radar. Asymmetry due to positive BY\ncomponent of the IMF causes the Southern Hemisphere por-\ntion of recently-reconnected flux tubes to propagate eastward\nand poleward. Consequently, the Southern Hemisphere foot-\nprints of flux tubes reconnected in the post-noon sector will\npropagate eastward and away from the field-of-view of the\nSyowa East radar located in the noon sector. In order to ob-\nserve the ionospheric signatures of newly-opened flux tubes\npropagating eastward and poleward in the field-of-view of\nthe Syowa East radar, there must exist a reconnection site\nin the pre-noon sector. Therefore, we conclude that during\nthe interval presented, the active reconnection region must\nbe sufficiently extended in local time (at least ∼4 h) to result\nin the ionospheric signatures of open flux tubes (i.e. FTEs)\nin both the pre- and post-noon sectors. This conclusion is\nconsistent with previous studies of reconnection process em-\nploying data from HF coherent radars that have suggested\nspatially extended reconnection patches on the dayside mag-\nnetopause (e.g. Milan et al., 2000; McWilliams et al., 2000).\nWe propose to investigate further intervals where inter-\nhemispheric observations of the ionospheric signatures of\nFTEs can be combined with in situ observations of FTEs at\nthe dayside magnetopause. It would be particularly inter-\nesting to identify intervals when the Cluster spacecraft are\nlocated closer to the noon-midnight meridian or when the\ndawn-dusk component of the IMF is less significant, in or-\nder to study the interhemispheric timing of the ionospheric\nresponse to bursts of reconnection at the magnetopause in\nmore detail.\nAcknowledgements. During the course of this study Drs. Jackie\nDavies and James Wild were supported by PPARC grant num-\nber PPA\/G\/O\/2001\/0014. Prof. Stan Cowley was supported by a\nPPARC Senior Fellowship (grant number PPAN\/N\/S\/2000\/00197).\nProf. N. Sato and Dr. A. S. Yukimatu were supported by a\nJSPS grant for scientific research (grant number A:11304029).\nThe CUTLASS HF radars are deployed and operated by the Uni-\nversity of Leicester, and are jointly funded by the UK Par-\nticle Physics and Astronomy Research Council (grant number\nPPA\/R\/R\/1997\/00256), the Finnish Meteorological Institute, and\nthe Swedish Institute of Space Physics. The Syowa HF radars are\ndeployed and operated by National Institute of Polar Research, and\nfunded by the Ministry of Education, Culture, Sports, Science and\nTechnology of Japan. We also thank all those SuperDARN PIs who\nprovided radar data and Norman Ness and the ACE Science Center\nfor providing the ACE magnetic field data presented in Fig. 3. JAW\nalso thanks Dr. A. S. Rodger for helpful discussions on this subject.\nTopical Editor T. Pulkkinen thanks P. E. Sandholt and another\nreferee for their help in evaluating this paper.\nReferences\nBalogh, A., Dunlop, M. W., Cowley, S. W. H., Southwood, D. J.,\nThomlinson, J. G., Glassmeier, K.-H., Musmann, G., Lu¨hr, H.,\nBuchert, S., Acun˜a, M. H., Fairfield, D. H., Slavin, J. A., Riedler,\nW., Schwingenschuh, K., and Kivelson, M. G.: The Cluster mag-\nnetic fields investigation, Space Sci. Rev., 79, 65–91, 1997.\nBalogh, A., Carr, C. M., Acun˜a, M. H., Dunlop, M. W., Beek, T. J.,\nBrown, P., Fornac¸on, K.-H., Georgescu, E., Glassmeier, K.-H.,\nHarris, J., Musmann, G., Oddy, T., and Schwingenschuh, K.: The\nCluster Magnetic Field Investigation: overview of in-flight per-\nformance and initial results, Ann. Geophysicae, 19, 1207–1217,\n2001.\nBerchem, J. and Russell, C. T.: Flux transfer events on the magne-\ntopause: spatial distribution and controlling factors, J. Geophys.\nRes., 89, 6698, 1984.\nBurch, J. L., Reiff, P. H., Menietti, J. D., Heelis, R. A., Hanson,\nW. B., Shawhan, S. D., Shelly, E. G., Sugiura, M., Weimer, D. R.,\nand Winningham, J. D.: IMF BY -dependent plasma flow and\nBirkeland currents in the dayside magnetosphere, 1, Dynamics\nExplorer observations, J. Geophys. Res., 90, 1577–9415, 1985.\nCowley, S. W. H.: The causes of convection in the Earth’s magne-\ntosphere – a review of developments during the IMS, Rev. Geo-\nphys. Space Phys., 20, 531–565, 1982.\nCowley, S. W. H.: The impact of recent observations on theoret-\nical understanding of solar wind-magnetosphere interactions, J.\nGeomag. Geoelectr., 38, 1223–1256, 1986.\nCowley, S. W. H. and Owen, C. J.: A simple illustrative model of\nopen flux tube motion over the dayside magnetopause, Planet.\nSpace Sci., 37, 1461–1475, 1989.\nJ. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs 1825\nCowley, S. W. H. and Lockwood, M.: Excitation and decay of so-\nlar wind-driven flows in the magnetosphere-ionosphere system,\nAnn. Geophysicae, 10, 103–15, 1992.\nCowley, S. W. H., Freeman, M. P., Lockwood, M., and Smith,\nM. F.: The ionospheric signature of flux transfer events, in “Clus-\nter: Dayside Polar Cusp”, ESA SP-330, ESA, Noordwijk, The\nNetherlands, 105–112, 1991.\nDavies, J. A., Yeoman, T. K., Rae, I. J., Milan, S. E., Lester, M.,\nLockwood, M., and McWilliams, K. A.,: Ground-based observa-\ntions of the auroral zone and polar cap ionospheric responses to\ndayside transient reconnection, Ann. Geophysicae, 20, 781–794,\n2002.\nElphic, R. C., Lockwood, M., Cowley, S. W. H., and Sandholt, P. E.:\nFlux transfer events at the magnetopause and in the ionosphere,\nGeophys. Res. Lett., 17, 2241–2244, 1990.\nFarrugia, C. J., Rijnbeek, R. P., Saunders, M. A., Southwood, D. J.,\nRodgers, D. J., Smith, M. F., Chaloner, C. P., Hall, D. S., Chris-\ntiansen, P. J., and Woolliscroft, L. J. C.:A multi-instrument study\nof flux transfer event structure, J. Geophys. Res., 98, 14 465–\n14 477, 1988.\nFeldstein, Y. I. and Starkov, G. V.: Dynamics of auroral belt and ge-\nomagnetic disturbances, Planet. Space Sci., 15, 209–229, 1967.\nGreenwald, R. A., Baker, K. B., Dudeney, J. R., Pinnock, M., Jones,\nT. B., Thomas, E. C., Villain, J.-P., Cerisier, J.C., Senior, C.,\nHanuise, C., Hunsucker, R. D., Sofko, G., Koehler, J., Nielsen,\nE., Pellinen, R., Walker, A. D. M., Sato, N., and Yamagishi,\nH.: Darn\/SuperDARN: a global view of the dynamics of high-\nlatitude convection, Space Sci. Rev, 71, 761–796, 1995.\nHaerendel, G., Paschmann, G., Sckopke, N., Rosenbauer, H., and\nHedgecock, P. C.: The frontside boundary layer of the magne-\ntopause and the problem of reconnection, J. Geophys. Res., 83,\n3195-216, 1978.\nHeelis, R. A.: The effects of interplanetary magnetic field orienta-\ntion on dayside high-lattude ionospheric convection, J. Geophys.\nRes., 89, 2873–2880, 1984.\nJohnstone, A. D., Alsop, C., Burge, S., Carter, P. J., Coates, A. J.,\nCoker, A. J., Fazakerley, A. N., Grande, M., Gowen, R. A., Gur-\ngiolo, C., Hancock, B. K., Narheim, B., Preece, A., Sheather,\nP. H., Winningham, J. D., and Woodliffe, R. D.: PEACE: A\nPlasma Elctron And Current Instrument, Space Sci. Rev., 79,\n351–398, 1997.\nKawano, H. and Russell, C. T.: Survey of flux transfer events ob-\nserved with the ISEE 1 spacecraft: dependence on the interplane-\ntary magnetic field, J. Geophys. Res., 102, 11 307–11 313, 1997.\nKhan, H. and Cowley, S. W. H.: Observations of the response time\nof high latitude ionospheric convection to variations in the in-\nterplanetary magnetic field using EISCAT and IMP-8 data, Ann.\nGeophysicae, 17, 1306–1335, 1999.\nLockwood, M., Sandholt, P. E., Cowley, S. W. H., and Oguti, T.:\nInterplanetary field control of dayside auroral activity and the\ntransfer of momentum across the dayside magnetopause, Planet.\nSpace Sci., 37, 1347–1365, 1989.\nLockwood, M., Cowley, S. W. H., Sandholt, P. E., and Lepping,\nR. P.: The ionospheric signatures of flux transfer events and solar\nwind dynamic pressure changes, J. Geophys. Res., 95, 17 113–\n17 135, 1990.\nLockwood, M., Moen, J., Cowley, S. W. H., Farmer, A. D.,\nLøvhaug, U. P., Lu¨hr, H., and Davda, V. N.: Variability of day-\nside convection and motions of the cusp\/cleft aurora, Geophys.\nRes. Lett., 20, 1011–1014, 1993.\nMcComas, D. J., Bame, S. J., Barker, P., Feldman, W. C., Phillips,\nJ. L., Riley, P., and Griffee, J. W.: Solar Wind Electron Proton\nAlpha Monitor (SWEPAM) for the Advanced Composition Ex-\nplorer, Space Sci. Rev., 86, 563–612, 1998.\nMcHenry, M. A. and Clauer, C. R.: Modeled ground magnetic sig-\nnatures of flux transfer events, J. Geophys. Res., 92, 11 231–\n11 240, 1987.\nMcWilliams, K. A., Yeoman, T. K., and Provan, G.: A statistical\nstudy of dayside pulsed ionospheric flows as seen by the CUT-\nLASS Finland HF radar, Ann. Geophysicae, 18, 445–453, 2000.\nMilan, S. E., Lester, M., Greenwald, R. A., and Sofko, G.: The\nionospheric signature of transient dayside reconnection and the\nassociated pulsed convection return flow, Ann. Geophysicae, 17,\n1166–1171, 1999.\nMilan, S. E., Lester, M., Cowley, S. W. H., and Brittnacher, M.:\nConvection and auroral response to a southward turning of the\nIMF: Polar UVI, CUTLASS, and IMAGE signatures of transient\nmagnetic flux transfer at the magnetopause, J. Geophys. Res.,\n105, 15 741–15 756, 2000.\nMoses, J. J., Siscoe, G. L., Crooker, N. U., and Gorney, D. J.: IMF\nBy and day-night conductivity effects in the expanding polar cap\nconvection model, J. Geophys. Res., 92, 1193–1198, 1987.\nNeudegg, D. A., Yeoman, T. K., Cowley, S. W. H., Provan, G.,\nHaerendel, G., Baumjohann, W., Auster ,U., Fornac¸on, K.-H.,\nGeorgescu, E., and Owen, C. J.: A flux transfer event observed\nat the magnetopause by the Equator-S spacecraft and in the iono-\nsphere by the CUTLASS HF radar, Ann. Geophysicae, 17, 707–\n711, 1999.\nNeudegg, D. A., Cowley, S. W. H., Milan, S. E., Yeoman, T. K.,\nLester, M., Provan, G., Haerendel, G., Baumjohann, W., Niku-\ntowski, B., Bu¨chner, J., Auster, U., Fornac¸on, K.-H., and\nGeorgescu, E.: A survey of magnetopause FTEs and associated\nflow bursts in the polar ionosphere, Ann. Geophysicae, 18, 416–\n435, 2000.\nNeudegg, D. A., Cowley, S. W. H., McWilliams, K. A., Lester, M.,\nYeoman, T. K., Sigwarth, J., Haerendel, G., Baumjohann, W.,\nAuster, U., Fornac¸on, K.-H., and Georgescu, E.: The UV aurora\nand ionospheric flows during flux transfer events, Ann. Geophys-\nicae, 19, 179–188, 2001.\nOwen, C. J., Fazakerley, A. N., Carter, P. J., Coates, A. J., Krauk-\nlis, I. C., Szita, S., Taylor, M. G. G. T., Travnicek, P., Wat-\nson, G., Wilson, R. J., Balogh, A., and Dunlop, M. W.: Clus-\nter PEACE observations of electrons during magnetospheric flux\ntransfer events, Ann. Geophysicae, 19, 1509–1522, 2001.\nPaschmann, G., Haerendel, G., Papamastorakis, I., Sckopke, N.,\nBame, S. J., Gosling, J. T., and Russell, C. T.: Plasma and\nmagnetic field characteristics of flux transfer events, J. Geophys.\nRes., 87, 2159–2168, 1982.\nPinnock, M., Rodger, A. S., Dudeney, J. R., Baker, K. B., Newell,\nP. T., Greenwald, R. A., and Greenspan, M. E.: Observations of\nan enhanced convection channel in the cusp ionosphere, J. Geo-\nphys. Res., 98, 3767–3776, 1993.\nPinnock, M., Rodger, A. S., Dudeney, J. R., Rich, F., and Baker,\nK. B.: High spatial and temporal resolution observations of the\nionospheric cusp, Ann. Geophysicae, 13, 919–925, 1995.\nProvan, G., Yeoman, T. K., and Milan, S. E.: CUTLASS Finland\nradar observations of the ionospheric signatures of flux transfer\nevents and the resulting plasma flows, Ann. Geophysicae, 16,\n1411–1422, 1998.\nProvan, G. and Yeoman, T. K.: Statistical observations of the MLT,\nlatitude and size of pulsed ionospheric flows with the CUTLASS\nFinland radar, Ann. Geophysicae, 17, 855–867, 1999.\nProvan, G., Yeoman, T. K., and Cowley, S. W. H.: The influence of\nthe IMFBy component on the location of pulsed flows in the day-\n1826 J. A. Wild et al.: Interhemispheric SuperDARN radar observations of FTEs\nside ionosphere observed by an HF radar, Geophys. Res. Lett.,\n26, 521–524, 1999.\nRe`me, H., Bosqued, J.-M., Sauvaud, J. A., Cros, A., Dandouras,\nJ., Aoustin, C., Bouyssou, J., Camus, Th., Cuvilo, J., Martz, C.,\nM’Edale, J. L., Perrier, H., Romefort, D., Rouzaud, J., D’uston,\nC., Mo¨bius, E., Crocker, K., Granoff, M., Kistler, L. M., Popecki,\nM., Hovestadt, D., Klecker, B., Paschmann, G., Scholer, M.,\nCarlson, C. W., Curtis, D. W., Lin, R. P., McFadden, J. P.,\nFormisano, V., Amata, E., Bavassano-Cattaneo, M. B., Baldetti,\nP., Belluci, G., Bruno, R., Chionchio, G., Di Lellis, A., Shel-\nley, E. G., Ghielmetti, A. G., Lennartsson, W., Korth, A., Rosen-\nbauer, H., Lundin, R., Olsen, S., Parks, G. K., McCarthy, M., and\nBalsiger, H.: The Cluster Ion Spectrometry (CIS) Experiment,\nSpace Sci. Rev., 79, 303–350, 1997.\nRe`me H., Aoustin, C., Bosqued, J.-M., Dandouras, I., Lavraud, B.,\nSauvaud, J. A., Barthe, A., J. Bouyssou, J., Camus, Th., Coeur-\nJoly, O., Cros, A., Cuvilo, J., Ducay, F., Garbarowitz, Y., Medale,\nJ. L., Penou, E., Perrier, H., Romefort, D., Rouzaud, J., Vallat, C.,\nAlcayde´, D., Jacquey, C., Mazelle, C., d’Uston, C., Mo¨bius, E.,\nKistler, L. M., Crocker, K., Granoff, M., Mouikis, C., Popecki,\nM., Vosbury, M., Klecker, B., Hovestadt, D., Kucharek, H.,\nKuenneth, E., Paschmann, G., Scholer, M., Sckopke, N., Sei-\ndenschwang, E., Carlson, C. W., Curtis, D. W., Ingraham, C.,\nLin, R. P., McFadden, J. P., Parks, G. K., Phan, T., Formisano,\nV., Amata, E., Bavassano-Cattaneo, M. B., Baldetti, P., Bruno,\nR., Chionchio, G., Di Lellis, A., Marcucci, M. F., Pallocchia,\nG., Korth, A., Daly, P. W., Graeve, B., Rosenbauer, H., Va-\nsyliunas, V., McCarthy, M., Wilber, M., Eliasson, L., Lundin,\nR., Olsen, S., Shelley, E. G., Fuselier, S., Ghielmetti, A. G.,\nLennartsson, W., Escoubet, C. P., Balsiger, H., Friedel, R., Cao,\nJ-B., Kovrazhkin, R. A., Papamastorakis, I., Pellat, R., Scudder,\nJ., and Sonnerup, B.: First multispacecraft ion measurements in\nand near the Earth’s magnetosphere with the identical Cluster ion\nspectrometry (CIS) experiment, Ann. Geophysicae, 19, 1303–\n1354, 2001.\nRijnbeek, R. P., Cowley, S. W. H., Southwood, D. J., and Russell,\nC. T.: A survey of dayside flux transfer events observed by ISEE\n1 and 2 magnetometers, J. Geophys. Res., 89, 786–800, 1984.\nRodger, A. S. and Pinnock, M.: The ionospheric response to FTEs:\nthe first few minutes, Ann. Geophysicae, 15, 685–691, 1997.\nRuohoniemi, J. M. and Greenwald, R. A.: Statistical patterns of\nhigh-latitude convection obtained from Goose Bay HF radar ob-\nservations, J. Geophys. Res., 101, 21 746–21 763, 1996.\nRuohoniemi, J. M. and Baker, K. B.: Large-scale imaging of high-\nlatitude convection with Super Dual Auroral Radar Network HF\nradar observations, J. Geophys. Res., 20 797–20 811, 103, 1998.\nRussell, C. T. and Elphic, R. C.: Initial ISEE magnetometer results:\nmagnetopause observations, Space Sci. Rev., 22, 681–715, 1978.\nRussell, C. T. and Elphic, R. C.:ISEE observations of flux transfer\nevents at the dayside magnetopause, Geophys. Res. Lett., 6, 33–\n36, 1979.\nSandholt, P. E., Lockwood, M., Oguti, T., Cowley, S. W. H., Free-\nman, K. S. C., Lybekk, B., Egeland, A., and Willis, D. M.: Mid-\nday auroral breakup events and related energy and momentum\ntransfer from the magnetosheath, J. Geophys. Res., 95, 1039–\n1060, 1990.\nSaunders, M. A., Russell, C. T., and Sckopke, N.: Flux transfer\nevents: scale size and interior structure, Geophys. Res. Lett., 11,\n131–134, 1984.\nScholer, M.: Magnetic flux transfer at the magnetopause based on\nsinge X-line bursty reconnection, Geophys. Res. Lett., 15, 291–\n294, 1988.\nShue, J.-H., Chao, J. K., Fu, H. C., Russell, C. T., Song, P., Khurana,\nK. K., and Singer, H. J.: A new functional form to study the solar\nwind control of the magnetopause size and shape, J. Geophys.\nRes., 102, 9497–9511, 1997.\nSmith, C. W., Acun˜a, M. H., Burlaga, L. F., L’Heureux, J., Ness,\nN. F., and Scheifele, J.: The ACE Magnetic Fields Experiment,\nSpace Sci. Rev., 86, 613–632, 1998.\nSonnerup, B. U. O. and Cahill, L. J.: Magnetopause structure and\nattitude from Explorer 12 observations, J. Geophys. Res., 72,\n171–183, 1967.\nSouthwood, D. J.: Theoretical aspects of the ionosphere-\nmagnetosphere-solar wind coupling, Adv. Space Res., 5, 7–14,\n1985.\nSouthwood, D. J.: The ionospheric signature of flux transfer events,\nJ. Geophys. Res., 92, 3207–3213, 1987.\nSouthwood, D. J., Farrugia, C. J., and Saunders, M. A.: What are\nflux transfer events?, Planet. Space Sci., 36, 503–508, 1988.\nStone, E. C., Frandsen, A. M., Mewaldt, R. A., Christian, E. R.,\nMarglies, D., Ormes, J. F., and Snow, F.: The Advanced Compo-\nsition Explorer, Space Sci. Rev., 86, 1–22, 1998.\nThorolfsson, A., Cerisier, J.C., Lockwood, M., Sandholt, P. E., Se-\nnior, C., and Lester, M.: Simultaneous optical and radar signa-\ntures of poleward-moving auroral forms, Ann. Geophysicae, 18,\n1054–1066, 2000.\nTsyganenko, N. A.: Modeling the Earth’s magnetospheric magnetic\nfield within a realistic magnetopause, J. Geophys. Res., 100,\n5599–5612, 1995.\nTsyganenko, N. A.: Effects of the solar wind conditions on the\nglobal magnetospheric configuration as deduced from data-based\nfield, in: “Proc. 3rd Internat. Conf. on Substorms (ICS-3)”, ESA\nSP-389, 181–185, 1996.\nvan Eyken, A. P., Rishbeth, H., Willis, D. M., and Cowley, S. W. H.:\nInitial EISCAT observations of plasma convection at invariant\nlatitudes 70◦–77◦, J. Atmos. Terr. Phys., 46, 635–641, 1984.\nWei, C. Q. and Lee, L. C.: Ground magnetic signatures of mov-\ning elongated plasma clouds, J. Geophys. Res., 95, 2405–2418,\n1990.\nWild, J. A., Cowley, S. W. H., Davies, J. A., Khan, H., Lester, M.,\nMilan, S. E., Provan, G., Yeoman, T. K., Balogh, A., Dunlop,\nM. W., Fornac¸on, K.-H., and Georgescu, E.: First simultaneous\nobservations of flux transfer events at the high-latitude magne-\ntopause by the Cluster spacecraft and pulsed radar signatures in\nthe conjugate ionosphere by the CUTLASS and EISCAT radars,\nAnn. Geophysicae, 19, 1491–1508, 2001.\n"}