{"doi":"10.1007\/s12104-009-9205-1","coreId":"197198","oai":"oai:lra.le.ac.uk:2381\/9434","identifiers":["oai:lra.le.ac.uk:2381\/9434","10.1007\/s12104-009-9205-1"],"title":"Resonance assignment and secondary structure of the middle MA-3 domain and complete tandem MA-3 region of the tumour suppressor protein Pdcd4","authors":["Waters, Lorna C.","Oka, Ojore","Muskett, Frederick W.","Strong, Sarah L.","Schmedt, Thore","Klempnauer, Karl-Heinz","Carr, Mark D."],"enrichments":{"references":[{"id":43693545,"title":"Carr MD (2006a) NMR assignment and secondary structure determination of the C-terminal MA-3 domain of the tumour suppressor protein Pdcd4.","authors":[],"date":null,"doi":"10.1007\/s10858-005-5887-6","raw":"PNAS 105(9):3274–3279. doi:10.1073\/pnas.0712235105 Waters LC, Bohm M, Veverka V, Muskett FW, Frenkiel TA, Kelly GP, Prescott A, Dosanjh NS, Klempnauer KH, Carr MD (2006a) NMR assignment and secondary structure determination of the C-terminal MA-3 domain of the tumour suppressor protein Pdcd4. J Biomol NMR 36(1):18. doi:10.1007\/s10858-005-5887-6 Waters L, Yue BG, Veverka V, Renshaw P, Bramham J, Matsuda S, Frenkiel T, Kelly G, Muskett F, Carr M, Heery DM (2006b) Structural diversity in p160\/CREB-binding protein coactivator complexes. J Biol Chem 281(21):14787–14795. doi:10.1074\/jbc.","cites":null},{"id":43693544,"title":"Structural basis for translational inhibition by the tumour suppressor Pdcd4.","authors":[],"date":"2009","doi":"10.1038\/emboj.2008.278","raw":"Biol Cell 101(6):309–317. doi:10.1042\/BC20080191 Loh PG, Yang HS, Walsh MA, Wang Q, Wang X, Cheng Z, Liu D, Song H (2009) Structural basis for translational inhibition by the tumour suppressor Pdcd4. EMBO J 28(3):274–285. doi:10.1038\/ emboj.2008.278 Shen Y, Delaglio F, Cornilescu G, Bax A (2009) TALOS?: a hybrid method for predicting protein backbone torsion angles from NMR chemical shifts. J Biomol NMR 44(4):213–223. doi:10.1007\/ s10858-009-9333-z Suzuki C, Garces RG, Edmonds KA, Hiller S, Hyberts SG, Marintchev A, Wagner G (2008) PDCD4 inhibits translation initiation by binding to eIF4A using both its MA3 domains.","cites":null},{"id":43693546,"title":"Structure of the C-terminal MA-3 domain of the tumour suppressor protein Pdcd4 and characterization of its interaction with eIF4A.","authors":[],"date":"2007","doi":"10.1038\/sj.onc.1210305","raw":"M600237200 Waters LC, Veverka V, Bohm M, Schmedt T, Choong PT, Muskett FW, Klempnauer KH, Carr MD (2007) Structure of the C-terminal MA-3 domain of the tumour suppressor protein Pdcd4 and characterization of its interaction with eIF4A. Oncogene 26(34): 4941–4950. doi:10.1038\/sj.onc.1210305 Yang HS, Jansen AP, Komar AA, Zheng X, Merrick WC, Costes S, Lockett SJ, Sonenberg N, Colburn NH (2003) The transformation suppressor Pdcd4 is a novel eukaryotic translation initiation factor 4A binding protein that inhibits translation. Mol Cell Biol 23(1):26–37. doi:10.1128\/MCB.23.1.26-37.2003 Resonance assignment and secondary structure of the middle MA-3 domain 53","cites":null},{"id":43693543,"title":"Transformation suppressor protein Pdcd4 interferes with JNK-mediated phosphorylation of c-Jun and recruitment of the coactivator p300 by c-Jun.","authors":[],"date":"2004","doi":"10.1038\/sj.onc.1208064","raw":"Bitomsky N, Bohm M, Klempnauer K (2004) Transformation suppressor protein Pdcd4 interferes with JNK-mediated phosphorylation of c-Jun and recruitment of the coactivator p300 by c-Jun. Oncogene 23(45):7484–7493. doi:10.1038\/sj.onc.1208064 Cavanagh J, Fairbrother WJ, Palmer AG, Skelton NJ, Rance M (eds) (2006) Chapter 6: experimental 1H NMR methods and chapter 7: heteronuclear NMR experiments. In: Protein NMR Spectroscopy: principles and practice, 2nd edn. Elsevier Academic Press, Amsterdam, pp 406–673 Lankat-Buttgereit B, Go¨ke R (2009) The tumour suppressor Pdcd4: recent advances in the elucidation of function and regulation.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-04","abstract":"Pdcd4 (Programmed Cell Death Protein 4) is a novel eukaryotic tumour suppressor protein, which is involved in the regulation of both transcription and translation (reviewed in Lankat-Buttgereit and Göke 2009). The protein contains two interacting MA-3 domains (MA-3M and MA-3C), which are linked by a short semi-flexible linker region (Waters et al. 2007; Suzuki et al. 2008). The MA-3 domains are involved in mediating specific protein–protein interactions with functional partners such as eIF4A (Yang et al. 2003 ). Here we report essentially complete backbone and side chain 15N, 13C and 1H assignments for a construct composed of the middle MA-3 domain and subsequent linker region (MA-3M) and backbone assignments for the entire tandem MA-3 region of Pdcd4 (Pdcd4 MA-3M-C). Analysis of the backbone chemical shift data obtained indicates that Pdcd4 MA-3M contains eight helical regions corresponding to over 74% of the protein backbone and that Pdcd4 MA-3M-C contains fifteen helical regions (72%). Comparison of the position of these helical regions with those observed in the crystal structures suggests that the solution and crystal structures of both proteins are very similar.Peer reviewedPublisher versio","downloadUrl":"http:\/\/link.springer.com\/article\/10.1007%2Fs12104-009-9205-1.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/9434\/2\/fulltext%5b1%5d.pdf","pdfHashValue":"2356bacddd08c152b1b4914f4ecb74edd29f4daa","publisher":"Springer Verlag","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/9434<\/identifier><datestamp>\n                2015-12-01T09:39:36Z<\/datestamp><setSpec>\n                com_2381_69<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_70<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nResonance assignment and secondary structure of the middle MA-3 domain and complete tandem MA-3 region of the tumour suppressor protein Pdcd4<\/dc:title><dc:creator>\nWaters, Lorna C.<\/dc:creator><dc:creator>\nOka, Ojore<\/dc:creator><dc:creator>\nMuskett, Frederick W.<\/dc:creator><dc:creator>\nStrong, Sarah L.<\/dc:creator><dc:creator>\nSchmedt, Thore<\/dc:creator><dc:creator>\nKlempnauer, Karl-Heinz<\/dc:creator><dc:creator>\nCarr, Mark D.<\/dc:creator><dc:description>\nPdcd4 (Programmed Cell Death Protein 4) is a novel eukaryotic tumour suppressor protein, which is involved in the regulation of both transcription and translation (reviewed in Lankat-Buttgereit and Göke 2009). The protein contains two interacting MA-3 domains (MA-3M and MA-3C), which are linked by a short semi-flexible linker region (Waters et al. 2007; Suzuki et al. 2008). The MA-3 domains are involved in mediating specific protein–protein interactions with functional partners such as eIF4A (Yang et al. 2003 ). Here we report essentially complete backbone and side chain 15N, 13C and 1H assignments for a construct composed of the middle MA-3 domain and subsequent linker region (MA-3M) and backbone assignments for the entire tandem MA-3 region of Pdcd4 (Pdcd4 MA-3M-C). Analysis of the backbone chemical shift data obtained indicates that Pdcd4 MA-3M contains eight helical regions corresponding to over 74% of the protein backbone and that Pdcd4 MA-3M-C contains fifteen helical regions (72%). Comparison of the position of these helical regions with those observed in the crystal structures suggests that the solution and crystal structures of both proteins are very similar.<\/dc:description><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPublisher version<\/dc:description><dc:date>\n2011-06-06T15:28:47Z<\/dc:date><dc:date>\n2011-06-06T15:28:47Z<\/dc:date><dc:date>\n2010-04<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nBiomolecular NMR Assignments, 2010, 4 (1), pp. 49-53.<\/dc:identifier><dc:identifier>\n1874-2718<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/9434<\/dc:identifier><dc:identifier>\nhttp:\/\/link.springer.com\/article\/10.1007%2Fs12104-009-9205-1<\/dc:identifier><dc:identifier>\n10.1007\/s12104-009-9205-1<\/dc:identifier><dc:identifier>\n1874-270X<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nCopyright © 2009 the Authors.  This article is published with open access at Springerlink.com, so that the final published version can be archived in institutional repositories and can be made publicly accessible immediately.  The original publication is also available at http:\/\/link.springer.com\/article\/10.1007%2Fs12104-009-9205-1.<\/dc:rights><dc:publisher>\nSpringer Verlag<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1874-2718","issn:1874-270X","1874-270x","1874-2718"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Article"],"fullText":"ARTICLE\nResonance assignment and secondary structure of the middle\nMA-3 domain and complete tandem MA-3 region of the tumour\nsuppressor protein Pdcd4\nLorna C. Waters • Ojore Oka • Frederick W. Muskett •\nSarah L. Strong • Thore Schmedt •\nKarl-Heinz Klempnauer • Mark D. Carr\nReceived: 7 October 2009 \/ Accepted: 2 December 2009 \/ Published online: 19 December 2009\n\u0001 The Author(s) 2009. This article is published with open access at Springerlink.com\nAbstract Pdcd4 (Programmed Cell Death Protein 4) is a\nnovel eukaryotic tumour suppressor protein, which is\ninvolved in the regulation of both transcription and transla-\ntion (reviewed in Lankat-Buttgereit and Go¨ke 2009). The\nprotein contains two interacting MA-3 domains (MA-3M and\nMA-3C), which are linked by a short semi-flexible linker\nregion (Waters et al. 2007; Suzuki et al. 2008). The MA-3\ndomains are involved in mediating specific protein–protein\ninteractions with functional partners such as eIF4A (Yang\net al. 2003). Here we report essentially complete backbone\nand side chain 15N, 13C and 1H assignments for a construct\ncomposed of the middle MA-3 domain and subsequent linker\nregion (MA-3M) and backbone assignments for the entire\ntandem MA-3 region of Pdcd4 (Pdcd4 MA-3M-C). Analysis\nof the backbone chemical shift data obtained indicates that\nPdcd4 MA-3M contains eight helical regions corresponding\nto over 74% of the protein backbone and that Pdcd4 MA-3M-C\ncontains fifteen helical regions (72%). Comparison of the\nposition of these helical regions with those observed in the\ncrystal structures suggests that the solution and crystal struc-\ntures of both proteins are very similar.\nKeywords Pdcd4 \u0001 MA-3 domain \u0001\nNMR resonance assignments \u0001 Secondary structure\nBiological context\nThe eukaryotic regulatory protein Pdcd4 (Programmed\nCell Death Protein 4) was initially discovered in a screen\nfor genes activated during apoptosis and later identified as\na tumour suppressor in studies of a mouse keratinocyte\nmodel of tumour promotion. A number of subsequent\nstudies have also highlighted Pdcd4’s role as a tumour\nsuppressor, for example, Pdcd4 has been shown to suppress\ntumour development in a mouse model of skin carcino-\ngenesis (reviewed in Lankat-Buttgereit and Go¨ke 2009).\nPdcd4 has been shown to play critical roles in the regula-\ntion of both transcription and translation, mediated via\nspecific protein–protein and perhaps protein-RNA interac-\ntions (Bitomsky et al. 2004; Yang et al. 2003).\nThe 469 residue mouse Pdcd4 protein contains at least\nthree domains, an N-terminal RNA-binding region (residues\n1–157) and two interacting MA3 domains (residues 157–275\nand 319–449), which are linked by a short semi flexible\nregion (Waters et al. 2007; Suzuki et al. 2008). To date the\nmajority of the molecular and structural studies of Pdcd4\nhave focused on the interaction between the two MA-3\ndomains of Pdcd4 and the eukaryotic translation initiation\nfactor eIF4A, with complex formation resulting in the\ninhibition of cap-dependent translation (Yang et al. 2003).\nThe structures of both the isolated C-terminal (MA-3C)\nMA-3 domain, and a construct composed of the middle\nMA-3 domain and subsequent linker region (MA-3M) of\nPdcd4 have been solved and were shown to be composed of\nthree or four layers of atypical HEAT repeats respectively\n(Waters et al. 2007; Suzuki et al. 2008). More recently, the\nLorna C. Waters and Ojore Oka are equal first authors.\nL. C. Waters (&) \u0001 O. Oka \u0001 F. W. Muskett \u0001\nS. L. Strong \u0001 M. D. Carr (&)\nDepartment of Biochemistry, Henry Wellcome Building,\nUniversity of Leicester, Lancaster Road,\nLeicester LE1 9HN, UK\ne-mail: lw83@le.ac.uk\nM. D. Carr\ne-mail: mdc12@le.ac.uk\nT. Schmedt \u0001 K.-H. Klempnauer\nInstitut fu¨r Biochemie, Westfa¨lische-Wilhelms-Universita¨t\nMu¨nster, Wilhelm-Klemm-Str. 2, 48149 Mu¨nster, Germany\n123\nBiomol NMR Assign (2010) 4:49–53\nDOI 10.1007\/s12104-009-9205-1\ncrystal structure of the entire tandem MA-3 region (MA-3M-C)\nhas also been determined (Loh et al. 2009). To date only the\nassignments for the Pdcd4 MA-3C have been deposited\n(BMRB accession number 6900).\nHere we report the determination of essentially complete\nsequence-specific backbone and side chain assignments for\nPdcd4 MA-3M and backbone assignments for Pdcd4\nMA-3M-C, as well as the positions of elements of regular\nsecondary structure.\nMethods and experiments\nUnlabelled and uniformly 15N and 15N\/13C labelled samples\nof mouse Pdcd4 MA-3M (residues 157–318) and Pdcd4\nMA-3M-C (residues 157–449) were prepared from pGex-6P-\n2-based E. coli expression vectors essentially as described\npreviously for Pdcd4 MA-3C (Waters et al. 2006a), however,\nfor Pdcd4 MA-3M-C transformed cells protein expression\nwas induced for 20 h at 15\u0002C. In addition, the cleaved Pdcd4\nconstructs and GST were separated by a second round of\nglutathione based affinity chromatography prior to gel fil-\ntration. A 13C labelled Pdcd4 MA-3M sample which was\nused for the 13C\/1H NOESY-HSQC experiment was pre-\npared as described above, but with the addition of non-\nisotopically labelled aromatic amino acids to the minimal\nmedia (His, Phe, Trp and Tyr at 50 mg\/l).\nNMR spectra of Pdcd4 MA-3M were acquired from\n0.35 ml samples of 0.5–1.5 mM Pdcd4 MA-3M in a 25 mM\nsodium phosphate, 100 mM sodium chloride, 0.5 mM DTT,\n10 lM EDTA, 200 lM AEBSF and 0.02% (w\/v) sodium\nazide buffer at pH 6.5, containing 10% D2O\/90% H2O or\n100% D2O as appropriate. All NMR data were acquired at\n25\u0002C on either 600 MHz Bruker Avance\/DRX systems or\nan 800 MHz Bruker Avance II spectrometer. The 2D and\n3D spectra recorded to obtain sequence specific assign-\nments for Pdcd4 MA-3M were:\n1H-1H TOCSY with mixing\ntimes of 35 and 55 ms, 1H-1H NOESY with an NOE\nmixing time of 100 ms; 15N\/1H HSQC; TOCSY-HSQC\nwith a mixing time of 55 ms; NOESY-HSQC with an NOE\nmixing time of 100 ms; 13C\/1H HCCH-TOCSY with a\nmixing time 19.6 ms, 13C\/1H HSQC-NOESY with an NOE\nmixing time of 100 ms; 15N\/13C\/1H HNCACB, CBCA\n(CO)NH and HNCO (reviewed in Cavanagh et al. 2006).\nTypical acquisition times in F1 and F2 for the 3D experi-\nments were 12–25 ms for 15N, 6.7–9.0 ms for 13C (35 ms\nfor HNCO experiments) and 15–22.5 ms for 1H, and with\nan acquisition time of 55–70 ms in F3 (\n1H). Typical\nacquisition times in F1 for 2D experiments were 50 ms for\n15N and 35 ms for 1H, with 80–100 ms in F2.\nNMR spectra of Pdcd4 MA-3M-C were acquired from\n0.35 ml samples of 0.15–0.50 mM Pdcd4 MA-3M-C in a\n25 mM sodium phosphate, 100 mM sodium chloride,\n2.5 mM DTT, 2.5 mM TCEP, 50 lM EDTA, 200 lM\nAEBSF, and 0.02% (w\/v) sodium azide buffer at pH 6.5,\ncontaining 5% D2O\/95% H2O. NMR data were acquired at\n35\u0002C on an 800 MHz Bruker Avance II spectrometer. The\n3D spectra recorded to obtain backbone assignments for\nPdcd4 MA-3M-C were:\n15N\/1H NOESY-HSQC with an\nNOE mixing time of 75 ms and 15N\/13C\/1H HNCA,\nHNCO, TROSY-HN(CO)CA and CBCA(CO)NH. Typical\nacquisition times in F1 and F2 for the 3D experiments were\n10–25 ms for 15N, 6.7–9.0 ms for 13C (22.5 ms for HNCO\nexperiments) and 16 ms for 1H, and with an acquisition\ntime of 60 ms in F3 (\n1H).\nThe majority of the 3D spectra were collected over\napproximately 72 h. The WATERGATE method was used\nto suppress the water signal when required. The 3D NMR\ndata were processed using Topspin (Bruker Biospin Ltd)\nwith linear prediction used to extend the effective acqui-\nsition times by up to twofold in F1 and F2. The spectra were\nanalysed using the Sparky package (T. D. Goddard and\nD. G. Kneller, SPARKY 3, University of California, San\nFrancisco).\nSequence-specific backbone and side chain resonance\nassignments were obtained for Pdcd4 MA-3M using the\napproach described previously (Waters et al. 2006b). Ini-\ntially, tentative sequence-specific backbone resonance\nassignments (N, NH, Ca and CO) for Pdcd4 MA-3M-C were\nobtained by transposing the assignments from the isolated\nMA-3 domains (acquired at 25\u0002C) onto the triple resonance\nspectra obtained for Pdcd4 MA-3M-C (acquired at 35\u0002C).\nAmbiguities between the assignments obtained for the\nindividual MA-3 domains and Pdcd4 MA-3M-C, arising\nfrom differences in the temperature at which the spectra were\nrecorded and\/or changes in the chemical environment of\nresidues located at the interface between the two MA-3\ndomains, were resolved by comparing the amide nitrogen\/\nproton and carbonyl chemical shifts of residues in HNCO\nspectra recorded at a range of temperatures (25 and 35\u0002C for\nthe individual MA-3 domains and 25, 30 and 35\u0002C for Pdcd4\nMA-3M-C). Finally, the inter-residue amide nitrogen\/proton\nto Ca connectivities observed in triple resonance spectra and\nthe NH to NH NOEs identified in NOESY-HSQC spectra\nwere used to confirm all the assignments made.\nFig. 1 Quality of the NMR spectra obtained for Pdcd4 MA-3M and\nPdcd4 MA-3M-C. Panel A shows an\n15N\/1H HSQC spectrum of Pdcd4\nMA-3M. The assignments of the signals from backbone amide groups\nare indicated by residue type and number. The region between 6.7 and\n7.8 ppm in 1H and 110.0 and 113.3 ppm in 15N contains, with the\nexception of E210, S224, T229 and I273, signals from the sidechain\namide groups of the asparagine and glutamine residues. The signal\nlocated at 10.0 ppm in 1H and 128.4 ppm in 15N ppm is from the\nindolic-NH group of W315. The assignments obtained for overlapped\nsignals in the region between 7.7 and 8.4 ppm in 1H and 116.6 and\n122.3 ppm in 15N are indicated in the enlarged region. Panel B shows\nan 15N\/1H HSQC spectrum of Pdcd4 MA-3M-C and panel C a three\ndimensional view of a 15N\/13C\/1H HNCO spectrum of Pdcd4 MA-3M-C\nc\n50 L. C. Waters et al.\n123\nResonance assignment and secondary structure of the middle MA-3 domain 51\n123\nExtent of assignments and data deposition\nPdcd4 MA-3M gives rise to well-resolved spectra, as\nillustrated by the 15N\/1H HSQC spectrum shown in Fig. 1a.\nThis allowed essentially complete backbone resonance\nassignments to be made. Despite the relatively large size of\nPdcd4 MA-3M-C (293 residues) and consequent overlap of\nsignals in 2D 15N\/1H HSQC spectra, we were also able to\nobtain comprehensive sequence-specific backbone reso-\nnance assignments. The quality of the NMR spectra\nobtained is illustrated by the HSQC and HNCO spectra\nshown in Fig. 1b, c.\nBackbone amide assignments were obtained for all\nresidues in Pdcd4 MA-3M except: D180, S214 and A291\n(98.1%), for all Ca and Cb signals apart from M218 (Cb\nonly), C288 and Q290 (98.5%) and for all CO signals,\nexcept for residues followed by a proline, and G179, A213,\nT233, Q290 and G318 (93.2%). In the case of Ha and Hb\nsignals, assignments were obtained for all residues except:\nP201, L207 (Hb3 only), R216, E217 (Hb2, Hb3), M218\n(Hb3 only), K221 (Hb3 only), P258, L260, R267, C288,\nQ290 and S317 (Hb3 only) (94.1%). For the remaining\nnon-exchangeable side chain signals (13C and 1H) complete\nassignments were obtained apart from: L188 ((Hd2)3),\nL193 (Cc), K197 (He3), P201 (Cc, Cd, Hc2, Hc3, Hd2,\nHd3), L207 (Cc, Hc), R216 (Cc, Cd, Hc2, Hc3, Hd2, Hd3),\nP248 (Cc), P258 (Cc, Cd, Hc2, Hc3, Hd2, Hd3), L260 (Cc,\nCd1, Cd2, Hc, (Hd1)3, (Hd2)3), R267 (Cc, Cd, Hc2, Hc3,\nHd2, Hd3), V269 (Cc1), Q290 (Cc, Hc2, Hc3) and W315\n(Hf2, Hg2) (93.5%).\nBackbone amide assignments were obtained for all\nnon-proline residues in Pdcd4 MA-3M-C except: D180,\nS214, A291, G319, H326, V328, K329, E330, I331,\nV356, H360, T397, D418, V419, S422 and S449 (94.0%),\nfor all Ca signals except: H326, V328, K329, E330,\nV356, I415, L417, D418, V419, S422, P448 and S449\n(95.9%), and for all CO signals except residues followed\nby a proline, and G179, A213, T233, Q290, G318, N325,\nL327, V328, K329, E330, E355, F359, I396, D414, L417,\nD418, H421, P448 and S449 (89.8%). The comprehensive\n15N, 13C and 1H resonance assignments obtained for\nPdcd4 MA-3M and Pdcd4 MA-3M-C have been deposited\nFig. 2 Location of the secondary structure elements in Pdcd4 MA-3M\nand Pdcd4 MA-3M-C. Panel A shows the amino acid sequence of\nPdcd4 MA-3M. Highlighted in blue on the sequence are the positions\nof the helical regions observed in the crystal structure of Pdcd4 MA-\n3M (Suzuki et al. 2008: PDB code 2RG8). Indicated underneath the\nsequence in purple and pink are the regions suggested to be helical by\nthe programmes TALOS (shown immediately below) and CSI\nrespectively. Residues for which no data could be obtained, due to\na lack of input chemical shifts, are highlighted in grey. Panel B shows\nthe amino acid sequence for the entire Pdcd4 MA-3M-C region.\nHelical regions are indicated as in panel A. In this case, residues\nhighlighted in blue show the positions of the helical regions observed\nin the crystal structure of Pdcd4 MA-3M-C (Loh et al. 2009: PDB code\n3EIJ)\n52 L. C. Waters et al.\n123\nat the BioMagResBank database (accession numbers\n16538 and 16542 respectively).\nAnalysis of the backbone chemical shifts of Pdcd4\nMA-3M, using the programme TALOS (Shen et al. 2009),\nshows that the domain contains eight helical regions (res-\nidues E161-H178, D180-L191, E195-E210, A213-L226,\nT233-D253, P255-D271, N276-K283 and Q290-S305).\nThese regions are in close agreement with the position of\nthe secondary structure elements observed in the crystal\nstructure of Pdcd4 MA-3M, as shown in Fig. 2a (Suzuki\net al. 2008). Similarly, analysis of the backbone chemical\nshifts of Pdcd4 MA-3M-C showed that there were 15 helical\nregions (residues E161-H178, T181-L191, M196-E210,\nA213-L226, T233-D253, P255-D271, N276-K283, V289-\nS305, I331-L340, I344-E355, H360-E373, S378-S393,\nI398-N416, Y423-A436 and K441-D445). These results are\nalso in close agreement with the position of the secondary\nstructure elements observed in the crystal structure of\nPdcd4 MA-3M-C, as shown in Fig. 2b (Loh et al. 2009).\nThe one exception is the absence of the N276-K283 helix\nin the crystal structure, where this region is instead com-\nposed of a series of bends and turns. However, it should be\nnoted that B-factors for this region are somewhat higher\nthan average. The NMR results reported here clearly\nindicate that the solution and crystal structures of both\nproteins are very similar.\nAcknowledgments This work was supported by grants from the\nWellcome Trust (083629, 080085 & 063632).\nOpen Access This article is distributed under the terms of the\nCreative Commons Attribution Noncommercial License which per-\nmits any noncommercial use, distribution, and reproduction in any\nmedium, provided the original author(s) and source are credited.\nReferences\nBitomsky N, Bohm M, Klempnauer K (2004) Transformation\nsuppressor protein Pdcd4 interferes with JNK-mediated phos-\nphorylation of c-Jun and recruitment of the coactivator p300 by\nc-Jun. Oncogene 23(45):7484–7493. doi:10.1038\/sj.onc.1208064\nCavanagh J, Fairbrother WJ, Palmer AG, Skelton NJ, Rance M (eds)\n(2006) Chapter 6: experimental 1H NMR methods and chapter 7:\nheteronuclear NMR experiments. In: Protein NMR Spectros-\ncopy: principles and practice, 2nd edn. Elsevier Academic Press,\nAmsterdam, pp 406–673\nLankat-Buttgereit B, Go¨ke R (2009) The tumour suppressor Pdcd4:\nrecent advances in the elucidation of function and regulation.\nBiol Cell 101(6):309–317. doi:10.1042\/BC20080191\nLoh PG, Yang HS, Walsh MA, Wang Q, Wang X, Cheng Z, Liu D,\nSong H (2009) Structural basis for translational inhibition by the\ntumour suppressor Pdcd4. EMBO J 28(3):274–285. doi:10.1038\/\nemboj.2008.278\nShen Y, Delaglio F, Cornilescu G, Bax A (2009) TALOS?: a hybrid\nmethod for predicting protein backbone torsion angles from NMR\nchemical shifts. J Biomol NMR 44(4):213–223. doi:10.1007\/\ns10858-009-9333-z\nSuzuki C, Garces RG, Edmonds KA, Hiller S, Hyberts SG,\nMarintchev A, Wagner G (2008) PDCD4 inhibits translation\ninitiation by binding to eIF4A using both its MA3 domains.\nPNAS 105(9):3274–3279. doi:10.1073\/pnas.0712235105\nWaters LC, Bohm M, Veverka V, Muskett FW, Frenkiel TA, Kelly\nGP, Prescott A, Dosanjh NS, Klempnauer KH, Carr MD (2006a)\nNMR assignment and secondary structure determination of the\nC-terminal MA-3 domain of the tumour suppressor protein\nPdcd4. J Biomol NMR 36(1):18. doi:10.1007\/s10858-005-\n5887-6\nWaters L, Yue BG, Veverka V, Renshaw P, Bramham J, Matsuda S,\nFrenkiel T, Kelly G, Muskett F, Carr M, Heery DM (2006b)\nStructural diversity in p160\/CREB-binding protein coactivator\ncomplexes. J Biol Chem 281(21):14787–14795. doi:10.1074\/jbc.\nM600237200\nWaters LC, Veverka V, Bohm M, Schmedt T, Choong PT, Muskett\nFW, Klempnauer KH, Carr MD (2007) Structure of the\nC-terminal MA-3 domain of the tumour suppressor protein Pdcd4\nand characterization of its interaction with eIF4A. Oncogene 26(34):\n4941–4950. doi:10.1038\/sj.onc.1210305\nYang HS, Jansen AP, Komar AA, Zheng X, Merrick WC, Costes S,\nLockett SJ, Sonenberg N, Colburn NH (2003) The transforma-\ntion suppressor Pdcd4 is a novel eukaryotic translation initiation\nfactor 4A binding protein that inhibits translation. Mol Cell Biol\n23(1):26–37. doi:10.1128\/MCB.23.1.26-37.2003\nResonance assignment and secondary structure of the middle MA-3 domain 53\n123\n"}