{"doi":"10.1186\/1471-2474-11-187","coreId":"19008","oai":"oai:eprints.bham.ac.uk:580","identifiers":["oai:eprints.bham.ac.uk:580","10.1186\/1471-2474-11-187"],"title":"The relationship between the presence of anti-cyclic citrullinated peptide antibodies and clinical phenotype in very early rheumatoid arthritis","authors":["Cader, Mohammed Z","Filer, Andrew D","Buckley, Christopher D.","Raza, Karim"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-08-23","abstract":"Background \\ud\nAnti-cyclic citrullinated peptide (anti-CCP) antibodies are highly specific for RA, but are not detectable in all RA patients. The aim of this study was to establish whether the clinical phenotypes of anti-CCP positive and negative disease are distinct at the earliest clinically apparent phase of disease. \\ud\n \\ud\nMethods \\ud\nPatients were recruited from the Birmingham early inflammatory arthritis clinic. Participants were included in the current study if they presented within 3 months of symptom onset and fulfilled 1987 ACR criteria for RA at some point during an 18 month follow-up. Data were collected on demographic variables, joint symptoms and tender (n = 68) and swollen (n = 66) joint counts. CRP, ESR, rheumatoid factor and anti-CCP2 status were measured. \\ud\n \\ud\nResults \\ud\n92 patients were included (48 anti-CCP positive). The anti-CCP positive and negative groups were comparable in terms of demographic variables, inflammatory markers, joint counts and 1987 ACR classification criteria, except that more anti-CCP positive patients were rheumatoid factor positive (83.3% vs. 11.4%, p < 0.01). There was no significant difference in the pattern of joint involvement, except for an increased prevalence of knee joint swelling in anti-CCP positive patients (42.9% vs. 22.2%, p = 0.03). \\ud\n \\ud\nConclusions \\ud\nPatients with and without anti-CCP antibodies present in a similar way, even within three months of clinically apparent disease that eventually develops into RA","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Biomed Central","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.bham.ac.uk:580<\/identifier><datestamp>\n      2011-12-20T10:38:37Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D52:5231<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The relationship between the presence of anti-cyclic citrullinated peptide antibodies and clinical phenotype in very early rheumatoid arthritis<\/dc:title><dc:creator>\n        Cader, Mohammed Z<\/dc:creator><dc:creator>\n        Filer, Andrew D<\/dc:creator><dc:creator>\n        Buckley, Christopher D.<\/dc:creator><dc:creator>\n        Raza, Karim<\/dc:creator><dc:subject>\n        R Medicine (General)<\/dc:subject><dc:description>\n        Background \\ud\nAnti-cyclic citrullinated peptide (anti-CCP) antibodies are highly specific for RA, but are not detectable in all RA patients. The aim of this study was to establish whether the clinical phenotypes of anti-CCP positive and negative disease are distinct at the earliest clinically apparent phase of disease. \\ud\n \\ud\nMethods \\ud\nPatients were recruited from the Birmingham early inflammatory arthritis clinic. Participants were included in the current study if they presented within 3 months of symptom onset and fulfilled 1987 ACR criteria for RA at some point during an 18 month follow-up. Data were collected on demographic variables, joint symptoms and tender (n = 68) and swollen (n = 66) joint counts. CRP, ESR, rheumatoid factor and anti-CCP2 status were measured. \\ud\n \\ud\nResults \\ud\n92 patients were included (48 anti-CCP positive). The anti-CCP positive and negative groups were comparable in terms of demographic variables, inflammatory markers, joint counts and 1987 ACR classification criteria, except that more anti-CCP positive patients were rheumatoid factor positive (83.3% vs. 11.4%, p < 0.01). There was no significant difference in the pattern of joint involvement, except for an increased prevalence of knee joint swelling in anti-CCP positive patients (42.9% vs. 22.2%, p = 0.03). \\ud\n \\ud\nConclusions \\ud\nPatients with and without anti-CCP antibodies present in a similar way, even within three months of clinically apparent disease that eventually develops into RA.<\/dc:description><dc:publisher>\n        Biomed Central<\/dc:publisher><dc:date>\n        2010-08-23<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.bham.ac.uk\/580\/1\/Cader_2010_BMC_Muskoloskeletal_Disorders.pdf<\/dc:identifier><dc:relation>\n        public<\/dc:relation><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/580\/1.hassmallThumbnailVersion\/Cader_2010_BMC_Muskoloskeletal_Disorders.pdf<\/dc:relation><dc:relation>\n        http:\/\/dx.doi.org\/10.1186\/1471-2474-11-187<\/dc:relation><dc:identifier>\n        Cader, Mohammed Z and Filer, Andrew D and Buckley, Christopher D. and Raza, Karim (2010) The relationship between the presence of anti-cyclic citrullinated peptide antibodies and clinical phenotype in very early rheumatoid arthritis. BMC Musculoskeletal Disorders, 11 (1). p. 187. ISSN 1471-2474<\/dc:identifier><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/580\/<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["public","http:\/\/eprints.bham.ac.uk\/580\/1.hassmallThumbnailVersion\/Cader_2010_BMC_Muskoloskeletal_Disorders.pdf","http:\/\/dx.doi.org\/10.1186\/1471-2474-11-187","http:\/\/eprints.bham.ac.uk\/580\/"],"year":2010,"topics":["R Medicine (General)"],"subject":["Article","PeerReviewed"],"fullText":"RESEARCH ARTICLE Open Access\nThe relationship between the presence of anti-\ncyclic citrullinated peptide antibodies and clinical\nphenotype in very early rheumatoid arthritis\nMohammed Z Cader1,2, Andrew D Filer1,2, Christopher D Buckley1,2, Karim Raza1,2*\nAbstract\nBackground: Anti-cyclic citrullinated peptide (anti-CCP) antibodies are highly specific for RA, but are not\ndetectable in all RA patients. The aim of this study was to establish whether the clinical phenotypes of anti-CCP\npositive and negative disease are distinct at the earliest clinically apparent phase of disease.\nMethods: Patients were recruited from the Birmingham early inflammatory arthritis clinic. Participants were\nincluded in the current study if they presented within 3 months of symptom onset and fulfilled 1987 ACR criteria\nfor RA at some point during an 18 month follow-up. Data were collected on demographic variables, joint\nsymptoms and tender (n = 68) and swollen (n = 66) joint counts. CRP, ESR, rheumatoid factor and anti-CCP2 status\nwere measured.\nResults: 92 patients were included (48 anti-CCP positive). The anti-CCP positive and negative groups were\ncomparable in terms of demographic variables, inflammatory markers, joint counts and 1987 ACR classification\ncriteria, except that more anti-CCP positive patients were rheumatoid factor positive (83.3% vs. 11.4%, p < 0.01).\nThere was no significant difference in the pattern of joint involvement, except for an increased prevalence of knee\njoint swelling in anti-CCP positive patients (42.9% vs. 22.2%, p = 0.03).\nConclusions: Patients with and without anti-CCP antibodies present in a similar way, even within three months of\nclinically apparent disease that eventually develops into RA.\nBackground\nRheumatoid arthritis (RA) is a chronic, inflammatory\ncondition typically manifesting clinically as a symmetri-\ncal polyarthritis. Rheumatoid synovitis is characterised\nby complex leukocyte and cytokine networks. The per-\nsistence of inflammation is mediated, in part, by the\nstromal micro-environment, but the underlying causes\nremain unclear [1,2]. Over the last decade there has\nbeen particular interest in antibodies to citrullinated\npeptides and proteins as important aetiological and pre-\ndictive factors in early RA [3-5]. Citrullination of pro-\nteins is a post-translational modification, which can\noccur as a normal part of cell apoptosis [6]. However,\nthis process may induce antibody formation in suscepti-\nble individuals [7], which may predate clinical arthritis\nby several years [8]. Subsequent environmental triggers\nmay enable anti-citrullinated protein\/peptide antibodies\nto enter joints and contribute to a chronic inflammatory\nresponse [9].\nAnti-cyclic citrullinated peptide (anti-CCP) antibodies\nare highly specific for RA, but are not detectable in all\npatients [10]. This raises the possibility that distinct\nmechanisms exist for the pathogenesis of synovitis in\nanti-CCP positive and negative patients. Indeed, anti-\nCCP positive patients show both environmental and\ngenetic associations not present in anti-CCP negative\nRA. For example, tobacco smoking is a well-recognised\nrisk factor for anti-CCP positive RA especially amongst\nHLA-DRB1 individuals expressing the ‘shared epitope’\n[11]. Furthermore anti-CCP positive patients have more\nsevere radiological destruction and poorer outcomes\n[12], and synovial pathology appears to differ according\nto anti-CCP status in the established phase of RA [13].\n* Correspondence: k.raza@bham.ac.uk\n1MRC Centre for Immune Regulation, School of Immunity and Infection, The\nUniversity of Birmingham, Birmingham B15 2TT, UK\nFull list of author information is available at the end of the article\nCader et al. BMC Musculoskeletal Disorders 2010, 11:187\nhttp:\/\/www.biomedcentral.com\/1471-2474\/11\/187\n© 2010 Cader et al; licensee BioMed Central Ltd. This is an Open Access article distributed under the terms of the Creative Commons\nAttribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), which permits unrestricted use, distribution, and reproduction in\nany medium, provided the original work is properly cited.\nA recent study of RA patients presenting within\n2 years of symptom onset, suggested no clinical pheno-\ntypic differences according to anti-CCP status [12].\nHowever, it is possible that as the disease evolves, all\nRA patients, regardless of anti-CCP status, develop a\ncommon pattern of joint involvement and that differ-\nences were not observed because the symptom duration\nat inclusion was too heterogeneous. Moreover, there is\nevidence that pathogenic mechanisms in the first few\nmonths may differ from those in longer duration disease\nand that this phase may be more responsive to therapy\n[14,15]. Hence we aimed to establish whether the clini-\ncal phenotypes of anti-CCP positive and negative disease\nwere distinct at the earliest clinically apparent phase of\nRA, within 3 months of symptom onset.\nMethods\nPatients were recruited from the rapid access early\ninflammatory arthritis clinic at Sandwell and West Bir-\nmingham Hospitals NHS Trust. Patients referred to the\nclinic by their General Practitioners were seen within\n2 weeks. Participants were included in the current study\nif they presented within 3 months of the onset of any\nsymptom attributed by the assessing Rheumatologist to\ninflammatory joint disease (pain, stiffness, swelling), had\nclinically apparent synovial swelling at baseline and ful-\nfilled 1987 American College of Rheumatology criteria\n(ACR) for RA, either at baseline or during 18 months\nfollow-up [16].\nData were collected on patient demographic variables,\nfulfillment of the ACR criteria, duration of symptoms\nand whether the mode of onset was acute or insidious.\nTender (n = 68) and swollen (n = 66) joint counts were\nperformed. CRP, ESR, rheumatoid factor and anti-CCP2\nstatus were measured at baseline. Radiographs were per-\nformed of the hands and feet. Systematic clinical follow-\nup was carried out at 1, 2, 3, 6, 12 and 18 months.\nThe anti-CCP positive and negative groups were com-\npared, with differences in means assessed using a two-\ntailed unpaired student t-test. Proportions were\ncompared using a chi-squared test. Data analysis was\nperformed using the Statistical Package for Social\nSciences, version 17.0 (SPSS Institute, Chicago, IL,\nUSA). P values < 0.05 were considered significant.\nPatients gave their informed consent prior to inclusion\ninto the programme. The study received ethical approval\nfrom the local research ethics committee.\nResults\nAt the time of this analysis 265 patients with an initial\nsymptom duration of less than 3 months and with com-\npleted follow-up had been recruited to the early synovi-\ntis cohort; of these, 92 patients (34.7%) fulfilled 1987\nACR criteria for RA at some point during follow-up and\nwere included in the present study. Of these 92 patients,\n48 patients had anti-CCP antibodies and 44 patients had\nno anti-CCP antibodies at inclusion. There were an\nadditional 35 patients (13.2%) with persistent unclassi-\nfied arthritis at the end of 18 month follow-up, all of\nwhom were anti-CCP negative. 21 of these patients were\ntreated with disease modifying anti-rheumatic drugs\n(DMARDs); if such agents had not been used, it is pos-\nsible that they may have eventually reached a diagnosis\nof RA.\nThe patient groups were comparable in terms of gen-\nder, age, ethnicity and smoking status (Table 1). In addi-\ntion, patients had similar durations of symptoms and\nmodes of onset. There were no significant differences in\nthe presence or duration of morning stiffness. Moreover,\nthe other 1987 ACR criteria for RA were equally likely\nto be present in the anti-CCP positive and negative\ngroups. This includes the presence of nodules and radi-\nological evidence of erosions, both of which were very\nrare at presentation. The exception, however, was that\nanti-CCP positive patients were significantly more likely\nto be seropositive for rheumatoid factor (83.3% vs.\n11.4%, p < 0.001). The mean number of ACR criteria\npresent at baseline was greater for anti-CCP positive\n(3.73) than for anti-CCP negative patients (3.23) (p =\n0.03). However, this was not significant after repeating\nthe analysis with rheumatoid factor status excluded.\nThere was also a significant difference in the proportion\nof patients meeting at least 4 criteria needed for a diag-\nnosis of RA at baseline (anti-CCP positive, 58.3%; anti-\nCCP negative, 36.4%; p = 0.04). However, there was no\ndifference in the mean time from symptom onset to the\nfulfillment of classification criteria for RA (anti-CCP\npositive, 158 days; anti-CCP negative, 131 days) in those\nwho did not fulfill classification criteria at baseline (Fig-\nure 1). It should be noted that the 1987 ACR criteria\nstipulate that articular symptoms and signs should have\nbeen present for at least 6 weeks; this criterion was\nincluded in the present analysis. 28 patients who even-\ntually fulfilled 1987 ACR criteria for RA (15 anti-CCP\npositive, 13 anti-CCP negative) were seen in clinic\nwithin 6 weeks of the onset of symptoms and hence, by\ndefinition, were unable to fulfill 1987 ACR critera for\nRA at baseline. Of these, 15 patients (8 anti-CCP posi-\ntive, 7 anti-CCP negative) would have met sufficient cri-\nteria needed for diagnosis at baseline, had the 6 week\ncriterion been disregarded.\nThere were no significant differences in the total ten-\nder or swollen joint counts, number of affected joint\nareas or 28-joint score (as used in the DAS28 scoring\nfor RA, data not shown). In addition, inflammatory mar-\nkers were comparable in both groups. Amongst different\njoint regions, a significantly different prevalence of swel-\nling was only seen in the knee joint, with a higher\nCader et al. BMC Musculoskeletal Disorders 2010, 11:187\nhttp:\/\/www.biomedcentral.com\/1471-2474\/11\/187\nPage 2 of 5\nprevalence in anti-CCP positive patients (43.8% vs.\n22.8%, p = 0.03) (Figure 2).\nDiscussion\nThis study shows that RA patients with and without\nanti-CCP antibodies present similarly, even within three\nmonths of symptom onset. This is perhaps surprising\ngiven the emerging consensus that anti-CCP positive\nand negative states represent distinct clinical entities.\nThere is mounting evidence suggesting not only sepa-\nrate molecular mechanisms underlying these two patient\ngroups, but also different genetic and environmental\npredispositions as well as a different clinical progression.\nHowever, consistent with a previous study of patients\npresenting within 2 years of onset, our data provide evi-\ndence that, despite these pathological differences, there\nis a shared clinical phenotype for RA presentation\nregardless of anti-CCP status. Not only do patients with\nanti-CCP positive and negative disease present with\nsimilar distributions of joint disease, but they also have\ncomparable ages of onset and levels of inflammation.\nHowever, anti-CCP positive patients do fulfill\nTable 1 Characteristics of patients with and without anti-CCP antibodie\nanti-CCP positive (n = 48) anti-CCP negative (n = 44) P value\nFemale (n (%)) 28 (58.3%) 22 (50.0%) 0.42*\nAge at inclusion, years (mean ± standard deviation) 56.6 ± 15.0 61.5 ± 14.7 0.12**\nEthnicity - Caucasian (n (%)) 38 (79.2%) 39 (88.6%) 0.22*\nSmoking status - Current\/ever smoked (n (%)) 31 (64.6%) 28 (63.6%) 0.92*\nSymptom duration, days (mean ± standard deviation) 49.3 ± 20.2 56.4 ± 22.3 0.12**\nMode of onset (n (%))\nAcute 25 (52.1%) 25 (56.8%) 0.65*\nInsidious 21 (43.8%) 18 (40.9%)\nUnspecified 2 (4.16%) 1 (2.27%)\nMorning Stiffness\nDuration, mins (mean ± standard deviation) 93.3 ± 89.5 123.8 ± 92.8 0.11**\nNo. patients ≥60 mins (n (%)) 28 (58.3%) 32 (72.7%) 0.15*\nSymmetry (n (%)) 35 (72.9%) 33 (75.0%) 0.82*\nHand joint involvement (n (%)) 43 (89.6%) 41 (93.2%) 0.54*\n≥ 3 joint areas involved (n (%)) 31 (64.6%) 30 (68.2%) 0.63*\nNodules (n (%)) 2 (4.17%) 1 (2.27%) 0.61*\nErosions (n (%)) 1 (2.08%) 2 (4.54%) 0.51*\nRheumatoid factor positive (n (%)) 40 (83.3%) 5 (11.4%) < 0.001*\n1987 ACR criteria for RA\nTotal No. (mean ± standard deviation) 3.73 ± 1.09 3.23 ± 1.14 0.03**\nNo. fulfilling ≥ 4 criteria (n (%)) 28 (58.3%) 16 (36.4%) 0.04*\nTender joint count (max 68) (mean ± standard deviation) 8.33 ± 7.80 9.66 ± 8.90 0.45**\nSwollen joint count (max 66) (mean ± standard deviation) 5.79 ± 4.51 7.07 ± 5.83 0.25**\nESR mm\/hr (mean ± standard deviation) 32.3 ± 20.1 38.7 ± 29.3 0.23**\nCRP mg\/L (mean ± standard deviation) 29.0 ± 27.0 31.4 ± 30.8 0.70**\nStatistical test applied: *Chi-squared test, **Unpaired student t-test\nFigure 1 Cumulative proportion of patients fulfilling 1987 ACR\nclassification criteria for RA over 18 month follow-up period.\nSolid line = anti-CCP antibody positive patients. Dashed line = anti-\nCCP antibody negative patients.\nCader et al. BMC Musculoskeletal Disorders 2010, 11:187\nhttp:\/\/www.biomedcentral.com\/1471-2474\/11\/187\nPage 3 of 5\nsignificantly more ACR criteria for RA than anti-CCP\nnegative patients. This is predominantly due to the fact\nthat anti-CCP positive patients more often express rheu-\nmatoid factor, a well described phenomenon [17]. Con-\nsequently, anti-CCP positive patients were more likely\nto have met at least 4 criteria, thereby fulfilling classifi-\ncation criteria for RA at initial presentation. However\nthere were no significant differences in the proportions\nof patients meeting each of the other six 1987 ACR cri-\nteria when then anti-CCP positive and negative patients\nwere compared.\nThis study has a number of limitations. Firstly, data\nare available to suggest that seropositivity for anti-CCP\nand rheumatoid factor are associated with delayed pre-\nsentation in patients with RA [18,19]. These surprising\nobservations raise the possibility that a subpopulation of\nseropositive individuals were not seen early enough for\ninclusion in our patient cohort. This may have intro-\nduced selection bias. Secondly, the study may have been\nunderpowered to detect more subtle clinical differences\nbetween patient groups. A retrospective power analysis\nwas carried out for each of the variables tested. This\nshowed that the study had an 80% power to detect a dif-\nference in proportions between anti-CCP positive and\nnegative groups of between 0.27 and 0.30 (27 to 30%)\ndepending upon the particular joint area under\nconsideration.\nInterestingly, this study showed an increased likeli-\nhood of knee involvement at presentation in anti-CCP\npositive patients. This finding is consistent with other\nresults of previous studies which have shown that anti-\nCCP positivity is associated with increased progression\nof radiological destruction and that initial knee involve-\nment is also a positive predictor of greater radiological\ndamage [20]. Our data suggest that the previously\nreported adverse outcomes of patients presenting with\nknee involvement may be due to the increased probabil-\nity of anti-CCP seropositivity in such patients.\nConclusions\nIn summary, anti-CCP positive and negative patients\nhave similar baseline clinical presentations. This does\nnot necessarily conflict with current opinion that antibo-\ndies to citrullinated peptides play an essential role in the\npathogenesis of RA. The role of anti-CCP status in pre-\ndicting progression of undifferentiated early arthritis\ninto RA is well established [21,22], as is the association\nwith increased bone destruction. It is possible that the\nshared clinical phenotype reported here may conceal dif-\nferences that are occurring at a pathological level. This\nhighlights the need to further investigate histological\nchanges in early RA, which may demonstrate differences\nin anti-CCP positive and negative patients and have\nimportant therapeutic implications.\nAuthor details\n1MRC Centre for Immune Regulation, School of Immunity and Infection, The\nUniversity of Birmingham, Birmingham B15 2TT, UK. 2Department of\nRheumatology, Sandwell and West Birmingham Hospitals NHS Trust,\nBirmingham B18 7QH, UK.\nAuthors’ contributions\nAll authors were involved in study design and in drafting and revision of the\nmanuscript. MZC, AF and KR performed the data collection, analysis and\ninterpretation of the results. All authors have read and approved the final\nmanuscript.\nAuthors’ Information\nMZC: MA, MB BChir, Academic Foundation Year 2 Doctor in Rheumatology;\nADF: PhD MRCP, Senior Lecturer in Rheumatology; CDB: PhD FRCP, Arthtitis\nResearch UK Professor of Rheumatology; KR: PhD FRCP, Senior Lecturer in\nRheumatology.\nFigure 2 Clinically apparent synovial swelling in individuals with and without anti-CCP antibody. Joint involvement expressed as a\npercentage of the patients seen in clinic, with 95% confidence intervals. Black bars = anti-CCP antibody positive patients. White bars = anti-CCP\nantibody negative patients. MCP = metacarpophalangeal; PIP = proximal interphalangeal; MTP = metatarsophalangeal.\nCader et al. BMC Musculoskeletal Disorders 2010, 11:187\nhttp:\/\/www.biomedcentral.com\/1471-2474\/11\/187\nPage 4 of 5\nCompeting interests\nKR, AF and CB hold unrestricted research grants from Wyeth, UCB and\nCellzome. This study was supported by the European Community’s Sixth\nFramework Programme (AutoCure).\nReceived: 10 May 2010 Accepted: 23 August 2010\nPublished: 23 August 2010\nReferences\n1. McInnes IB, Schett G: Cytokines in the pathogenesis of rheumatoid\narthritis. Nat Rev Immunol 2007, 7:429-442.\n2. Filer A, Raza K, Salmon M, Buckley CD: The role of chemokines in\nleucocyte-stromal interactions in rheumatoid arthritis. Front Biosci 2008,\n13:2674-2685.\n3. Schellekens GA, de Jong BA, van den Hoogen FH, van de Putte LB, van\nVenrooij WJ: Citrulline is an essential constituent of antigenic\ndeterminants recognized by rheumatoid arthritis-specific autoantibodies.\nJ Clin Invest 1998, 101(1):273-281.\n4. Raza K, Breese M, Nightingale P, Kumar K, Potter T, Carruthers DM,\nSitunayake D, Gordon C, Buckley CD, Salmon M, Kitas GD: Predictive value\nof antibodies to cyclic citrullinated Peptide in patients with very early\ninflammatory arthritis. J Rheumatol 2005, 32:231-238.\n5. von Delwig A, Locke J, Robinson JH, Ng WF: Response of Th17 cells to a\ncitrullinated arthritogenic aggrecan peptide in patients with rheumatoid\narthritis. Arthritis Rheum 2009, 62:143-149.\n6. Asaga H, Yamada M, Senshu T: Selective deimination of vimentin in\ncalcium ionophore-induced apoptosis of mouse peritoneal\nmacrophages. Biochem Biophys Res Commun 1998, 243(3):641-646.\n7. van Gaalen FA, van Aken J, Huizinga TW, Schreuder GM, Breedveld FC,\nZanelli E, van Venrooij WJ, Verweij CL, Toes RE, de Vries RR: Association\nbetween HLA class II genes and autoantibodies to cyclic citrullinated\npeptides (CCPs) influences the severity of rheumatoid arthritis. Arthritis\nRheum 2004, 50(7):2113-2121.\n8. Rantapaa-Dahlqvist S, de Jong BA, Berglin E, Hallmans G, Wadell G,\nStenlund H, Sundin U, van Venrooij WJ: Antibodies against cyclic\ncitrullinated peptide and IgA rheumatoid factor predict the\ndevelopment of rheumatoid arthritis. Arthritis Rheum 2003, 48:2741-2749.\n9. van Gaalen F, Ioan-Facsinay A, Huizinga TW, Toes RE: The devil in the\ndetails: the emerging role of anticitrulline autoimmunity in rheumatoid\narthritis. J Immunol 2005, 175(9):5575-5580.\n10. van Venrooij WJ, van Beers JJ, Pruijn GJ: Anti-CCP Antibody, a Marker for\nthe Early Detection of Rheumatoid Arthritis. Ann N Y Acad Sci 2008,\n1143:268-285.\n11. Linn-Rasker SP, van der Helm-van Mil AH, van Gaalen FA, Kloppenburg M,\nde Vries RR, le Cessie S, Breedveld FC, Toes RE, Huizinga TW: Smoking is a\nrisk factor for anti-CCP antibodies only in rheumatoid arthritis patients\nwho carry HLA-DRB1 shared epitope alleles. Ann Rheum Dis 2006,\n65(3):366-371.\n12. van der Helm-van Mil AH, Verpoort KN, Breedveld FC, Toes RE, Huizinga TW:\nAntibodies to citrullinated proteins and differences in clinical\nprogression of rheumatoid arthritis. Arthritis Res Ther 2005, 7(5):R949-958.\n13. van Oosterhout M, Bajema I, Levarht EW, Toes RE, Huizinga TW, van\nLaar JM: Differences in synovial tissue infiltrates between anti-cyclic\ncitrullinated peptide-positive rheumatoid arthritis and anti-cyclic\ncitrullinated peptide-negative rheumatoid arthritis. Arthritis Rheum 2008,\n58(1):53-60.\n14. Raza K, Falciani F, Curnow SJ, Ross EJ, Lee CY, Akbar AN, Lord JM,\nGordon C, Buckley CD, Salmon M: Early rheumatoid arthritis is\ncharacterized by a distinct and transient synovial fluid cytokine profile\nof T cell and stromal cell origin. Arthritis Res Ther 2005, 7(4):R784-795.\n15. Möttönen T, Hannonen P, Korpela M, Nissila M, Kautiainen H, Ilonen J,\nLaasonen L, Kaipiainen-Seppänen O, Franzen P, Helve T, Koski J,\nGripenberg-Gahmberg M, Myllykangas-Luosujärvi R, Leirisalo-Repo M: Delay\nto institution of therapy and induction of remission using single-drug or\ncombination-disease-modifying antirheumatic drug therapy in early\nrheumatoid arthritis. Arthritis Rheum 2002, 46(4):894-898.\n16. Arnett FC, Edworthy SM, Bloch DA, McShane DJ, Fries JF, Cooper NS,\nHealey LA, Kaplan SR, Liang MH, Luthra HS, Medsger TA Jr, Mitchell DM,\nNeustadt DH, Pinals RS, Schaller JG, Sharp JT, Wilder RL, Hunder GG: The\nAmerican Rheumatism Association 1987 revised criteria for the\nclassification of rheumatoid arthritis. Arthritis Rheum 1988, 31:315-324.\n17. Lee AN, Beck CE, Hall M: Rheumatoid factor and anti-CCP autoantibodies\nin rheumatoid arthritis: a review. Clin Lab Sci 2008, 21(1):15-18.\n18. Kumar K, Daley E, Carruthers DM, Situnayake D, Gordon C, Grindulis K,\nBuckley CD, Khattak F, Raza K: Delay in presentation to primary care\nphysicians is the main reason why patients with rheumatoid arthritis are\nseen late by rheumatologists. Rheumatology 2007, 46(9):1438-40.\n19. van der Linden MPM, le Cessie S, Raza K, van der Woude D, Knevel R,\nHuizinga TW, van der Helm-van Mil AH: Long-term impact of delay in\nassessment of early arthritis patients. Arthritis Rheum 2010.\n20. Linn-Rasker SP, van der Helm-van Mil AH, Breedveld FC, Huizinga TW:\nArthritis of the large joints - in particular, the knee - at first presentation\nis predictive for a high level of radiological destruction of the small\njoints in rheumatoid arthritis. Ann Rheum Dis 2007, 66(5):646-650.\n21. van der Helm-van Mil AH, le Cessie S, van Dongen H, Breedveld FC,\nToes RE, Huizinga TW: A prediction rule for disease outcome in patients\nwith recent-onset undifferentiated arthritis: how to guide individual\ntreatment decisions. Arthritis Rheum 2007, 56:433-440.\n22. van der Helm-van Mil AH, Detert J, le Cessie S, Filer A, Bastian H,\nBurmester GR, Huizinga TW, Raza K: Validation of a prediction rule for\ndisease outcome in patients with recent-onset undifferentiated arthritis:\nmoving toward individualized treatment decision-making. Arthritis Rheum\n2008, 58:2241-2247.\nPre-publication history\nThe pre-publication history for this paper can be accessed here:\nhttp:\/\/www.biomedcentral.com\/1471-2474\/11\/187\/prepub\ndoi:10.1186\/1471-2474-11-187\nCite this article as: Cader et al.: The relationship between the presence\nof anti-cyclic citrullinated peptide antibodies and clinical phenotype in\nvery early rheumatoid arthritis. BMC Musculoskeletal Disorders 2010 11:187.\nSubmit your next manuscript to BioMed Central\nand take full advantage of: \n• Convenient online submission\n• Thorough peer review\n• No space constraints or color figure charges\n• Immediate publication on acceptance\n• Inclusion in PubMed, CAS, Scopus and Google Scholar\n• Research which is freely available for redistribution\nSubmit your manuscript at \nwww.biomedcentral.com\/submit\nCader et al. BMC Musculoskeletal Disorders 2010, 11:187\nhttp:\/\/www.biomedcentral.com\/1471-2474\/11\/187\nPage 5 of 5\n"}