{"doi":"10.1017\/S0047279408002067","coreId":"65188","oai":"oai:dro.dur.ac.uk.OAI2:6666","identifiers":["oai:dro.dur.ac.uk.OAI2:6666","10.1017\/S0047279408002067"],"title":"Book review of 'Public policy analysis' by Peter Knoepfel, Corinne Larrue, Frederic Varone and Michael Hill, Bristol : Policy Press, 2007.","authors":["Dunstan,  K."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-01-26","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65188.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6666\/1\/6666.pdf","pdfHashValue":"aa5950cd68050195e78a0e4fb36dd65dbe4aa05f","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6666<\/identifier><datestamp>\n      2015-08-12T09:48:10Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Book review of 'Public policy analysis' by Peter Knoepfel, Corinne Larrue, Frederic Varone and Michael Hill, Bristol : Policy Press, 2007.<\/dc:title><dc:creator>\n        Dunstan,  K.<\/dc:creator><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:source>\n        Journal of social policy, 2010, Vol.37(3), pp.517-518  [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2010-01-26<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6666<\/dc:identifier><dc:identifier>\n        issn:0047-2794<\/dc:identifier><dc:identifier>\n        issn: 1469-7823<\/dc:identifier><dc:identifier>\n        doi:10.1017\/S0047279408002067<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6666\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1017\/S0047279408002067 <\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6666\/1\/6666.pdf<\/dc:identifier><dc:rights>\n        This paper has been published by Cambridge University Press in \"Journal of social policy\" (37: 3 (2008) 517-518)  http:\/\/journals.cambridge.org\/action\/displayJournal?jid=JSP. © Cambridge University Press 2008.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1469-7823","issn:0047-2794"," 1469-7823","0047-2794"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n29 April 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nDunstan, K. (2010) ’Book review of ’Public policy analysis’ by Peter Knoepfel, Corinne Larrue, Frederic\nVarone and Michael Hill, Bristol : Policy Press, 2007.’, Journal of social policy., 37 (3). 517-518 .\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1017\/S0047279408002067\nPublisher’s copyright statement:\nThis paper has been published by Cambridge University Press in ”Journal of social policy” (37: 3 (2008) 517-518)\nhttp:\/\/journals.cambridge.org\/action\/displayJournal?jid=JSP. Cambridge University Press 2008.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nhttp:\/\/journals.cambridge.org Downloaded: 29 Apr 2010 IP address: 129.234.252.6\nreviews 517\nand students, whether interested in the MEW approach, in social policy studies or in British\nsocial policy. Finally, it leaves the ground open for future work that may profit from further\narticulations between the MEW approach and other conceptualisations.\nsilvia ferreira\nLancaster University\nPeter Knoepfel, Corinne Larrue, Frederic Varone and Michael Hill (2007), Public Policy\nAnalysis. Bristol: Policy Press. £70.00, pp. 336, hbk.\ndoi:10.1017\/S0047279408002067\nKnoepfel et al. offer students and practitioners in all fields of public policy an opportunity\nto examine the entire policy process in one text. Public Policy Analysis, a translation from a\nsuccessful French text, is a comprehensive and detailed account of the modern policy-making\nprocess in Western Europe and importantly develops a model with which to study, implement\nand evaluate policies.\nPublic Policy Analysis is divided into three parts. The first and shortest part introduces the\ntheoretical framework that the proposed analysis model is based on. The authors briefly review\nthree traditional policy analysis schools, and state that their own approach makes use of all\nthree. They position their thinking within the action sciences in order to describe, understand\nand explain the public policy system, whilst aiming ‘to remain as neutral as possible with respect\nto specific theories so as to be able to accommodate . . . the broadest possible range of theories\ndeveloped’ (p. 13).\nIn the second part, the part I found to be the most valuable, the component parts of\na public policy are dissected. Whilst the aim here is to provide the prerequisite background\nfor the model presented later, the collection of chapters offer a clear and accessible review\nof the key concepts used in policy research. The insights it gives into the role of policy and\npolicy analysis in society, the categorisation of the different actors involved, the mobilisation of\nmultiple resources and the institutional rules that influence actors during the policy process are\nessential themes for any student or practitioner to become familiar with. Those who encounter\nissues on public policy, particularly undergraduates, would benefit from reading this section\nas an introductory piece to ‘set the scene’ as it promotes the practice of problematising these\nconcepts rather than using them unquestionably.\nThe final part of Public Policy Analysis involves an explanation of Knoepfel et al.’s analysis\nmodel. The model ‘aims to describe, understand and explain public policy in its entirety, from\nthe initial perception of a social problem to its eventual resolution through public intervention’\n(p. 116). Those without an academic background in the social sciences, beyond undergraduate\nlevel, may occasionally lose their way in this part of the text. The dense terminology, although\nnecessary, makes following the text hard-going at times; with the language also sometimes\nappearing overcomplicated. However, this is not a criticism of the translation, which I think\nwas extremely successful.\nThe book suggests that it aims to encourage a British audience to encounter new ideas\nand practices from the francophone world. Unfortunately I did not feel that this was realised.\nThe policy illustrations from Swiss and French policy, plus examples from the UK included for\nthe translation, were often brief and incongruent with the rest of the text. In my view this did\nnot enhance an overall understanding of the analysis model. It is easy to suggest that it would\nhave been more effective to cover fewer examples in greater depth, but this would inevitably\nhave diluted the impact of the main feature of the book – the analysis model. This initial\ndisappointment is mitigated to some extent by the comprehensive referencing by the authors,\nhttp:\/\/journals.cambridge.org Downloaded: 29 Apr 2010 IP address: 129.234.252.6\n518 reviews\nwho ensure that readers are signposted to sources where particular interests can be followed\nup.\nAlthough aimed at a wide readership, I would particularly recommend this book to\nstudents and practitioners involved in policy evaluation for two reasons. Firstly, the nature of\nthis type of work can lead us to become too focused on, and to develop expertise in, ‘our’\nparticular sector whether that may be housing, health or the environment. This book will\nencourage the reader to take a step back from their own work and consider its commonalities\nand linkages to thewider policy process at institutional, governmental and parliamentary levels.\nSecondly, the efforts of policy evaluation are inevitably focused on the final part of the policy\ncycle. Throughout the book Knoepfel et al. highlight the importance of each policy stage on the\nnext as well as the iterative implications for analysis. For example, an evaluation of a policy’s\neffect should examine the potential redefinition of the policy problem during its journey on to\nthe governmental agenda, through to its programming and implementation.\nThe scope of Public Policy Analysis is so comprehensive one might consider the task of\nanalysis daunting (which is probably true). However, the authors do not expect researchers\nto apply their complete model to policy analysis; and the success of this book should not\ndepend on this. Rather, the book is a prompt to researchers ‘to revisit the arguments presented,\ndevelop them further, complement them with other theoretical approaches and apply them\nin actual analysis situation’ (p. 273). What this book does exceptionally well, whilst remaining\ntheoretically neutral, is present an analytically and conceptually sophisticated account of public\npolicy. It has the potential to be used to teach and to inform high-quality research.\nkatie dunstan\nUniversity of Durham\nJane Lewis (ed.) (2006), Children, Changing Families and Welfare States. Cheltenham:\nEdward Elgar. £69.95, pp. 308, hbk.\ndoi:10.1017\/S0047279408002079\nThis edited collectionmakes a wide-ranging contribution to comparative family policy analysis.\nThrough empirical analysis, policies aimed at families in terms of ‘cash and care’ are examined\nacross many national contexts. The analysis is aimed at highlighting the similarities and\ndifferences between welfare states in detail. Through theoretical analysis, the contributors\nseek to identify the drivers and consequences of policy shifts.\nThere is a strong empirical and theoretical coherency running through the contributions,\nwith leading social policy analysts critically assessing the argument that Western welfare states\nare converging towards an adult worker and social investment approach to welfare reform. The\nbook presents mixed responses to this argument, empirically grounding the analysis within\nnational and regional level policy and social change. This brings us to the final focus of the\nbook,which is to ask: inwhose interests are thesepolicy shifts?Here there is a critical engagement\nwith issues of generational, ethnic, class and gender inequalities and the way policy discourses\nand changes reinforce, reconfigure or reduce these inequalities. Again there is a mixed response\nwithin the collection. On the positive side, increases in public investment and the development\nof new social rights within the variants of the social investment and adult worker approach\nare recognised. However the majority opinion is one where policy responses and the drivers of\npolicy change involve the generation of new risks and can reinforce existing inequalities.\nTo look at some of the empirical chapters in more detail, Jonathon Bradshaw presents an\nanalysis of policies aimed at assisting parents with the costs of raising children in 15 countries,\nincluding four non-European countries – Japan, Australia, Canada and New Zealand. Austria\n"}