{"doi":"10.1016\/j.jpowsour.2007.04.068","coreId":"102238","oai":"oai:epubs.surrey.ac.uk:1692","identifiers":["oai:epubs.surrey.ac.uk:1692","10.1016\/j.jpowsour.2007.04.068"],"title":"Investigations into the ex situ methanol, ethanol and ethylene glycol permeabilities of alkaline polymer electrolyte membranes","authors":["Varcoe, JR","Slade, RCT","Yee, ELH","Poynton, SD","Driscoll, DJ"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-11-08","abstract":"<p>Alkaline anion-exchange membranes (AAEMs) are being developed for metal-cation-free solid alkaline fuel cells. Reduced solvent uptakes were observed after immersion in methanol, ethanol and ethylene glycol relative to a Nafion®-115 proton-exchange membrane (PEM); this translated directly into lower alcohol permeabilities. Alkaline polymer electrolytes showed lowered degrees of swelling (membrane thickness), when immersed in methanol and ethanol, relative to Nafion-115. The open circuit voltages, VOCV, of the corresponding direct alcohol fuel cells were superior to acid equivalents with membranes of identical fully hydrated thicknessess; this is indicative of a combination of reduced alcohol permeabilities and changed electrokinetics on PtRu anode catalysts at high pH. VOCV values for the AAEM-DAFCs were higher with ethanol than with methanol (consequent on lower permeability to ethanol), but were lower with ethylene glycol. Promisingly, and contrary to Nafion equivalents, peak power densities were not reduced when C2 alcohols (C-C bond containing) replaced methanol.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"ELSEVIER SCIENCE BV","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1692<\/identifier><datestamp>\n      2017-10-31T14:02:47Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6368656D6963616C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1692\/<\/dc:relation><dc:title>\n        Investigations into the ex situ methanol, ethanol and ethylene glycol permeabilities of alkaline polymer electrolyte membranes<\/dc:title><dc:creator>\n        Varcoe, JR<\/dc:creator><dc:creator>\n        Slade, RCT<\/dc:creator><dc:creator>\n        Yee, ELH<\/dc:creator><dc:creator>\n        Poynton, SD<\/dc:creator><dc:creator>\n        Driscoll, DJ<\/dc:creator><dc:description>\n        <p>Alkaline anion-exchange membranes (AAEMs) are being developed for metal-cation-free solid alkaline fuel cells. Reduced solvent uptakes were observed after immersion in methanol, ethanol and ethylene glycol relative to a Nafion®-115 proton-exchange membrane (PEM); this translated directly into lower alcohol permeabilities. Alkaline polymer electrolytes showed lowered degrees of swelling (membrane thickness), when immersed in methanol and ethanol, relative to Nafion-115. The open circuit voltages, VOCV, of the corresponding direct alcohol fuel cells were superior to acid equivalents with membranes of identical fully hydrated thicknessess; this is indicative of a combination of reduced alcohol permeabilities and changed electrokinetics on PtRu anode catalysts at high pH. VOCV values for the AAEM-DAFCs were higher with ethanol than with methanol (consequent on lower permeability to ethanol), but were lower with ethylene glycol. Promisingly, and contrary to Nafion equivalents, peak power densities were not reduced when C2 alcohols (C-C bond containing) replaced methanol.<\/p><\/dc:description><dc:publisher>\n        ELSEVIER SCIENCE BV<\/dc:publisher><dc:date>\n        2007-11-08<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1692\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Varcoe, JR, Slade, RCT, Yee, ELH, Poynton, SD and Driscoll, DJ  (2007) Investigations into the ex situ methanol, ethanol and ethylene glycol permeabilities of alkaline polymer electrolyte membranes   J POWER SOURCES, 173 (1).  pp. 194-199.      <\/dc:identifier><dc:relation>\n        10.1016\/j.jpowsour.2007.04.068<\/dc:relation><dc:language>\n        EN<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1692\/","10.1016\/j.jpowsour.2007.04.068"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"1Investigations into the ex situ methanol, ethanol and ethylene glycol\npermeabilities of alkaline polymer electrolyte membranes\nJohn R. Varcoe,* Robert C. T. Slade, Eric Lam How Yee, Simon D. Poynton, Daniel J.\nDriscoll\nDepartment of Chemistry, University of Surrey, Guildford GU2 7XH, United Kingdom.\n* Corresponding Author: Tel: +44 (0)1483 682616; Fax: +44 (0)1483 686851; E-mail:\nj.varcoe@surrey.ac.uk\nAlkaline anion-exchange membranes (AAEMs) are being developed for metal-cation-\nfree solid alkaline fuel cells. Reduced solvent uptakes were observed after immersion in\nmethanol, ethanol and ethylene glycol relative to a Nafion®-115 proton-exchange\nmembrane (PEM); this translated directly into lower alcohol permeabilities. Alkaline\npolymer electrolytes showed lowered degrees of swelling (membrane thickness), when\nimmersed in methanol and ethanol, relative to Nafion-115. The open circuit voltages,\nVOCV, of the corresponding direct alcohol fuel cells were superior to acid equivalents\nwith membranes of identical fully hydrated thicknessess; this is indicative of a\ncombination of reduced alcohol permeabilities and changed electrokinetics on PtRu\nanode catalysts at high pH. VOCV values for the AAEM-DAFCs were higher with\nethanol than with methanol (consequent on lower permeability to ethanol), but were\nlower with ethylene glycol. Promisingly, and contrary to Nafion equivalents, peak\npower densities were not reduced when C2 alcohols (C-C bond containing) replaced\nmethanol.\nKeywords: Alkaline Membrane Fuel Cells, Alcohol Permeability, Direct Alcohol Fuel\nCells, Open Circuit Voltage; Alkaline Ionomers\n21. Introduction\nTraditionally, polymer electrolyte fuel cells have incorporated proton-exchange\nmembranes (PEMs) such as Nafion® produced by Du Pont (Fig. 1a). However, alkaline\nanion-exchange membranes (AAEMs) are being developed for application in hydrogen-\nand alcohol- fuelled metal-cation-free alkaline polymer electrolyte fuel cells (Figure\n1b): an alkaline ionomer replaces aqueous potassium hydroxide, the electrolyte in\ntraditional alkaline fuel cells (AFCs) [1]. Conductivities of > 0.03 S cm-1 at 30°C have\nbeen observed for fully-hydrated radiation-grafted-type AAEMs [2], contrary to the\nprevious wisdom that the conductivities of AAEMs were too low for successful\napplication in fuel cells. When operated in metal-cation-free mode, an AAEM\nperformed for > 230 h in methanol\/air fuel cell with minimal performance loss (< 100\nµV h-1) [3]; the performances of traditional AFCs (aqueous KOH – mobile metal cations\npresent result in the formation of metal carbonate precipitates) collapse to unacceptable\nlevels after only a few hours when operated in methanol\/air mode.\nThe principle, and widely touted, advantage of using alkaline ionomers in fuel cells,\nrather than the traditional acidic PEMs, is the potential use of non-Pt catalysts in the\nelectrodes [4,5]. A recent combined study involving in situ a.c. electrochemical\nimpedance spectroscopy and d.c. fuel cell testing has demonstrated that cathodes\ncontaining Ag\/C (4 mgAg cmgeo-2) perform as well as those containing Pt\/C (0.5 mgPt\ncmgeo\n-2) [6]. Furthermore, this study demonstrated that the major limiter of power\nperformance was the restricted mass-transport of water to the cathode catalyst sites:\nwater is now a stoichiometric reactant (H2O(g\/l) + ½O2(g) + 2e- \u0002 2OH-(membrane) –\nsee Fig. 1b). This inherent disadvantage can be offset with the use of thin AAEMs,\nwhich facilitate back-transport of water that has been electro-generated at the anode (i.e.\n3H2(g) + 2OH-(membrane) \u0002 2H2O(l\/g) + 2e-). Despite this, power densities at 50°C of\n> 120 mW cm-2 can be achieved in H2\/O2 fuel cell tests with thin (51 µm) AAEMs [7].\nThe aim of this study is to evaluate the alcohol permeabilities of AAEMs, in order to\nassess their suitability for application in direct alcohol fuel cells (DAFCs). Low\npermeabilities are mandatory because thin AAEMs are necessary for minimised\nionomer resistances and maximised water transport to the cathode catalyst sites. Initial\nindications, from a fuel cell study of a commercial AAEM (Morgane® ADP, Solvay\nS.A., Belgium), suggest AAEMs exhibit reduced methanol permeability compared to\nNafion [8]. Liquid methanol [9,10] and ethylene glycol [4,11] fuels (volumetric energy\ndensities of 6.1 and 5.3 kW h dm-3 respectively – cf. 2.6 kW h dm-3 for liquid hydrogen)\nhave both been evaluated previously in metal-cation-containing AAEM-DAFCs\n(M+OH- salts added to the aqueous alcohol fuel supply) where promising power\ndensities were reported; ethylene glycol electro-oxidation on Pt appears to be especially\nfacile in aqueous potassium hydroxide and potassium carbonate solutions (pH > 7\nelectrolytes) [12]. Ethanol (8.0 kW h dm-3) was also selected for evaluation in this study\nas it is a representative carbon-neutral biofuel.\n2. Experimental\nTwo AAEMs were selected from a previous investigation (AAEM-E and AAEM-C in\nreference [2]) for evaluation in this study alongside Nafion-115 (benchmark);\nmembrane pre-treatment procedures were unaltered. A selection of relevant physical\nproperties for these polymer electrolytes is presented in Table 1. All statistical data in\nthis study below relate to one sample standard deviation from the mean of multiple\nmeasurements over different samples of the same membranes. The alkaline membranes,\n4synthesised and stored in the Cl- anion form, were not converted to the hydroxide forms\nuntil immediately prior to any experiments being conducted on them. From our\nexperience, the hydroxide-anion-form AAEMs do not carbonate in air to any significant\nextent as has been verified by FT-Raman spectroscopy (which is very sensitive to the\npresence of CO32- and HCO3- species).\nThe solvent uptake related properties at room temperature were evaluated as follows.\nThe gravimetric solvent uptakes, SU, were determined using:\n%100×\n\u0004\n=\ndry\ndryS\nm\nmm\nSU (1)\nwhere mS is the mass of the ionomers after submersion in each undiluted solvent (water,\nmethanol, ethanol, ethylene glycol) for 1 week and mdry is the mass of the solvent free\nionomer that was dried for 7 days in a desiccator over anhydrous CaCl2(s) (relative\nhumidity RH = 0%) prior to immersion in the solvents. The thicknesses of the\nmembranes when dry and when solvent swollen were recorded with an outside\nmicrometer (2 µm precision); these values are used to indicate the degree of swelling.\nThe solvent contents (molecules of solvent per OH- anion) were evaluated using:\n%100××\n=\ndryS IECMW\nSU\u0006 (2)\nwhere SU(%) is the solvent uptake defined above, IECdry is the ion-exchange capacity of\nthe dry ionomer (mmol(OH-\/H+) g-1), and MWS is the relative molecular mass of the\nparticular solvent used.\nThe alcohol permeabilities at 20 ± 2°C were evaluated using the methodology described\nby Nasef et al. [13]. In summary, the ionomer was clamped between two chambers of a\npermeation cell (the set-up used was identical to that described in Figure 3 of reference\n[14]) so that 4.9 cm2 areas of each side of the membrane (that were directly aligned)\n5were exposed to the contents of the chambers. Chamber A (the feed) was filled with\naqueous methanol solution (VA = 55 cm3, CA = 15%mass) and chamber B (the permeate)\nwas filled with grade II water (VB = 50 cm3). The concentration of methanol in chamber\nB (CB) was monitored over time by removing 0.1 cm3 samples; a CSi Series 200 gas\nchromatograph with flame ionisation detector and a SolGel-WAX capillary column\n(SGE, Ringwood, Australia, 20 m x 0.25 mm i.d. and 1 µm film thickness) were used\nfor determination of the alcohol concentrations in these permeate samples. The\npermeability was calculated as follows [13]: \nA\nB\nCA\ntV\nP\n×\n×\n×= \u0007 (3)\nwhere P \/ cm2 s-1 is the alcohol permeability (= D x K where D is the alcohol diffusivity\nand K is the partition coefficient), \u0007 is the slope of CB vs. time plot, t is the ionomer\nthickness and A is the area of ionomer exposed to the solutions.\nEach membrane was studied at 50°C in a DAFC fuelled with each alcohol using an\nArbin Fuel Cell Test Station. Electrodes (25 cm2) were supplied by E-Tek division of\nPEMEAs (Somerset, NJ, USA); the anodes contained unsupported PtRu (1:1 atomic\nratio, 4 mgmetal cmgeo-2) catalyst on “type-A” carbon cloth (PTFE binder), and the\ncathodes contained unsupported Pt black (4 mgPt cmgeo-2). The electrode treatment and\nmembrane electrode assembly (MEA) fabrication procedures and fuel cell testing\nprotocols were as previously described [6]. The anodes were supplied with pre-heated\n(50°C) aqueous alcohol solutions (2 mol dm-3, 10 cm3 min-1, \u0006stoic = 7.8 at i = 1 A cm-2).\nThe cathodes were supplied with flowing oxygen (50°C, RH = 100%, 2 dm3 min-1, \u0006stoic\n= 23 at i = 1 A cm-2). No back-pressurisation was used in any fuel cell test. For each\nMEA the testing was conducted in the order methanol \u0001 ethanol \u0001 ethylene glycol (in\n6order of the number of potentially poisoning electro-oxidation products – see Section\n3.2). The fuel cell performance parameter of principle interest in relation to fuel\ncrossover is the open circuit voltage (VOCV \/ V).\n3. Results and Discussion\n3.1 Alcohol uptakes and permeabilities\nThe solvent uptake properties of the membranes are presented in Fig. 2(a-c). It is\nevident that the AAEMs exhibit a lower affinity towards methanol, ethanol and ethylene\nglycol than Nafion-115; this is most notable for methanol. Whereas the number of\nalcohol molecules per exchange group (\u0006) are significantly lower compared to water for\nthe AAEMs, this is not the case for the combination of PEM and methanol; this high\naffinity towards methanol explains the undesirably high level of methanol crossover that\nhas been observed in fuel cell tests with this PEM. Nafion shows a substantially lowered\n\u0006E (ethanol) compared to \u0006M, (methanol) as does AAEM-C; AAEM-E shows similar\n\u0006’s with all three alcohols (within experimental precision). As previously reported [2],\nthe water content of AAEM-C is restricted compared to AAEM-E and to Nafion, due to\nthe presence of additional cross-linking.\nNafion exhibits a higher degree of swelling compared to the AAEMs for most solvents.\nThe thickness increases, tinc = 100% x (ts – tdry) \/ tdry, with methanol are 47% for Nafion,\n20% for AAEM-C and 27% for AAEM-E; the corresponding values for ethanol are\n49%, 22% and 30% respectively. It has been previously reported that Nafion swells to a\nlarger extent in ethanol than methanol, as measured by gravimetric solvent uptake\nexperiments [15,16], and that this is the primary cause of extensive delamination of\nNafion-based MEAs in direct ethanol fuel cells. The ex situ results in this study, with\n7undiluted alcohols, suggest that there is only a small increase in swelling with ethanol\nfor Nafion-115 compared to the case with methanol; however, increases in thickness do\nnot represent a complete picture of the swelling behaviour of Nafion as swelling can\noccur parallel to the electrodes (i.e. dimensional changes in the ionomer area), which\ncan lead to considerable mechanical stresses within the MEA. The situation with\nethylene glycol is not so clear cut, particularly in view of the low swelling of Nafion in\nthis solvent (tinc = 26, 20 and 35% for Nafion-115, AAEM-C and AAEM-E\nrespectively). It was observed that white translucent regions form when Nafion is\nimmersed in ethylene glycol; this could indicate that highly viscous ethylene glycol\naffects morphology \/ microstructure of that PEM.\nFigure 3 presents the ex situ alcohol permeabilities for the polymer electrolyte\nmembranes. The low alcohol contents for the AAEMs reported above have directly\ntranslated into desirably lower alcohol permeabilities compared to Nafion. PM = (1.9 ±\n0.9) x 106 cm2 s-1 recorded for Nafion agrees with the value of (1.8 ± 0.1) x 106 cm2 s-1 \npreviously reported by Holdcroft et al. for Nafion-117 [17]. The ethanol permeabilities\nare lower than the methanol permeabilities for all membranes. Previous studies in the\nliterature report lower ethanol permeabilities compared to methanol for Nafion [16,18]\n(despite the higher levels of dimensional, particularly area, swelling as discussed\nabove); the issue of whether ethanol crossover has a more or a less pronounced effect on\nthe cathode potential is still subject to debate [16,19].\nIt is important to appreciate that the permeabilities measured in this study are ex situ.\nFig. 1 shows the fundamental change in the direction of ionic conduction on\nreplacement of the PEM with an AAEM. With a PEM the proton-conduction is in the\nsame direction as alcohol crossover (i.e. electro-osmotic drag exacerbates alcohol\n8crossover), but with an AAEM the two processes oppose; hence significantly reduced\nfuel crossover can be anticipated (especially at higher current densities). However, ex\nsitu measurements are still valid as most fuel cell performance losses due to fuel\ncrossover occur at low current densities, where the concentration of alcohol at the anode\nside of the ionomer is highest (i.e. where the concentration of alcohol in the catalyst\nlayers adjacent to the electrolyte membrane has not been depleted due to significant\nrates of alcohol oxidation).\n3.2 DAFC performance tests\nThe DAFC performance curves for each membrane fuelled with each alcohol are\npresented in Fig. 4(a-c). The performance parameter affected the most by in situ alcohol\ncrossover through the MEA is the open circuit voltage (VOCV \/ V) and these values are\npresented in Table 2. Enhanced fuel crossover generally leads to a lowering of VOCV.\nCaution is required though when comparing different systems: for example, differences\nbetween oxygen reduction on Pt in alkali and in acid (i.e. differences in electrokinetic\nparameters such as exchange current density) and varying levels of catalyst poisoning,\nfrom the diverse range of reaction intermediates and products formed when using\ndifferent fuels, can both have a marked effect on VOCV. Methanol is a C1 alcohol, whilst\nethanol and ethylene glycol are C2 alcohols with C-C bonds to break. Adsorbed carbon\nmonoxide, COads, is a major intermediate in the mechanism of the methanol oxidation\nreaction (MOR) [20,21], whilst additional species such as acetaldehyde and acetic acid\nare generated in the ethanol electro-oxidation reaction (EOR) [22,23]; an extended\nrange of potentially poisoning intermediates, such as glycolic and oxalic acids, are\ngenerated in the ethylene glycol oxidation reaction (EGOR) [24-26]. \n9AAEM-C (same hydrated thickness as Nafion-115) exhibits superior VOCV’s to Nafion\nfor all fuels; this relates well to the permeability data above. The thinner AAEM-E\nshows inferior VOCV’s to Nafion will all fuels; however, considering that the thickness\nhas been halved (increased absolute crossover levels), these values are still better than\nexpected. It is also evident from Table 2 that the reduced ethanol permeability compared\nto methanol that was observed for the AAEMs correlates well with the improved VOCV’s\nobserved. However, despite the reduced ethanol permeability compared to methanol for\nNafion, the VOCV is lower with the latter fuel; this is indicative of either amplified\ncatalyst poisoning, from the presence of EOR intermediates, or poor EOR kinetics when\nin an acidic environment. The VOCV’s were consistently lower with ethylene glycol than\nwith the other two fuels for all membranes (despite the lower ethylene glycol\npermeabilities compared to methanol); this is not surprising when considering the\ncomplexity, and the number of potentially poisoning intermediates, of the EGOR.\nNotwithstanding this, the VOCV’s for the AAEMs with ethylene glycol compared well\nwith the value obtained for Nafion; this is in line with the previous reports of\nelectrokinetically facile EGOR in high pH media [12].\nThe poor DAFC power densities produced with the AAEMs are evident in Figure 4 and\nTable 2. The current hypothesis is that a major contributor to these low performances is\nthe poor reactant mass transport characteristics of the employed electrodes (as discussed\nin detail in reference [6]); no electrode architecture is currently available that has been\nspecifically tailored\/optimised for use in solid-state AAEM-based alkaline fuel cells.\nA remarkable trend was observed regarding the relative performances of the three\ndifferent fuels. The power performance was substantially decreased with the Nafion-\ncontaining cells when replacing methanol with ethanol and ethylene glycol. However,\n10\nthe AAEM-based cells exhibited no such decrease in peak power densities; a higher\npeak power density was even observed with the C2 alcohols on testing of the thicker\nAAEM. The performance increases with ethanol and ethylene glycol are localised at\nlow current densities where electrokinetic factors predominate; this is consistent with\nthe VOCV data presented above and is in line with prevailing wisdom in that the\nelectrochemical rates of EOR and EGOR are superior in alkaline media than in low pH\nsystems. The anticipated performance increases on continued optimisation of the\nAAEM-based MEAs (especially with the development of electrode architectures that\nare specifically tailored for use in AAEM-DAFCs) will allow further investigation of\nthese promising EOR and EGOR characteristics. Carbon dioxide gas bubbles were not\nobserved in the anode outlet of the DAFCs with ethanol and ethylene glycol, contrary to\nwhat was observed with methanol; this suggests that the electrochemical reactions with\nthese fuels are terminating before the complete 12e- and 10e- oxidations to CO2\nrespectively. Beyond this initial observation, the nature of the electro-oxidation\nproducts of the AAEM-DAFCs have not been characterised to date.\n4. Summary\nAlkaline anion-exchange membranes (AAEM) exhibit reduced methanol, ethanol and\nethylene glycol permeabilities when compared to Nafion proton-exchange membrane\n(PEM). The reduced permeabilities directly contribute to the higher open circuit\nvoltages of direct alcohol fuel cells (when the alkaline and acidic ionomers being\ncompared are of similar thicknesses); this leads to the possibility of using thinner\nalkaline polymer electrolytes of lower absolute ionic resistances (to offset the\nintrinsically lower OH- conductivities in AAEMs compared to H+ conductivities in\n11\nPEMs). Initial observations indicate that ethanol and ethylene glycol oxidation\nelectrokinetics on PtRu catalysts are improved compared to methanol with the use of\nalkaline ionomers.\nAcknowledgments\nThe authors gratefully thank the U.K.’s Engineering and Physical Sciences Research\nCouncil for funding (Grant GR\/S60709\/01) and Keith Lovell (Defence Academy of the\nUnited Kingdom, Cranfield University, Shrivenham) for \b-ray irradiation.\nReferences\n1 J.R. Varcoe, R.C.T. Slade, Fuel Cells, 5 (2005) 187-200.\n2 J.R. Varcoe, Phys. Chem. Chem. Phys., DOI: 10.1039\/b615478f (2007).\n3 J.R. Varcoe, R.C.T. Slade, E. Lam How Yee, Chem. Commun., (2006) 1428-1429.\n4 C. Coutanceau, L. Demarconnay, C. Lamy, J.-M. Léger, J. Power Sources, 156 (2006)\n14-19.\n5 K. Matsuoka, Y. Iriyama, T. Abe, M. Matsuoka, Z. Ogumi, J. Power Sources, 150\n(2006) 27-31.\n6 J.R. Varcoe, R.C.T. Slade, G.L. Wright, Y. Chen, J. Phys. Chem. B, 110 (2006)\n21041-21049.\n7 J.R. Varcoe, R.C.T. Slade, E. Lam How Yee, S.D. Poynton, D.J. Driscoll, Chem.\nMater., DOI: 10.1021\/cm062407u (2007).\n8 E.H. Yu, K. Scott, J. Power Sources, 137 (2004) 248-256.\n9 E.H. Yu, K. Scott, J. Appl. Electrochem., 35 (2005) 91-96.\n10 A. Huang, C. Xia, C. Xiao, L. Zhuang, J. Appl. Polym. Sci., 100 (2006) 2248-2251.\n12\n11 Z. Ogumi, K. Matsuoka, S. Chiba, M. Matsuoka, Y. Iriyama, T. Abe, M. Inaba,\nElectrochemistry, 70 (2002) 980-983.\n12 K. Matsuoka, M. Inaba, Y Iriyama, T. Abe, Z. Ogumi, M. Matsuoka, Fuel Cells, 2\n(2002) 3539.\n13 M.M. Nasef, N.A. Zubir, A.F. Ismail, M. Khayet, K.Z.M. Dahlan, H. Saidi, R.\nRohani, T.I.S. Ngah, N.A. Sulaiman, J. Membr. Sci., 268, 2006, 96-108.\n14 M.M Nasef, N.A. Zubir, A.F. Ismail, K.Z.M. Dahlan, H. Saidi, M. Khayet, J. Power\nSources, 156 (2006) 200-210.\n15 S. Song, G. Wang, W. Zhou, X. Zhao, G. Sun, Q. Xin, S. Kontou, P. Tsiakaras, J.\nPower Sources, 140 (2004) 103-110.\n16 S. Song, W. Zhou, Z. Liang, R. Cai, G. Sun, Q. Xin, V. Stergiopoulos, P. Tsiakaras,\nAppl. Catal. B: Environ., 55 (2005) 65-72.\n17 A. Siu, B., Pivovar, J. Horsfall, K.V. Lovell, S. Holdcroft, J. Polym. Sci. B: Polym.\nPhys., 44 (2006) 2240-2252.\n18 S Song, P. Tsiakaras, Appl. Catal. B: Environ. 63 (2005) 187-193.\n19 V.A. Paganin, E. Sitta, T. Iwasita, W. Vielstich, J. Appl. Electrochem., 35 (2005)\n1239-1243.\n20 X. Zhang, K.-Y., Tsang, K.-Y. Chan, J. Electroanal. Chem., 573 (2004) 1-9.\n21 W.L. Holstein, H.D. Rosenfeld, J. Phys. Chem. B, 109 (2005) 2176-2186.\n22 S. Rousseau, C. Coutanceau, C. Lamy, J.-M. Léger, J. Power Sources, 158 (2006)\n18-24.\n23 C. Lamy, S. Rousseau, E.M. Belgsir, C. Coutanceau, J.-M. Léger, Electrochim. Acta,\n49 (2004) 3901-3908.\n13\n24 K. Matsuoka, Y. Iriyama, T. Abe, M. Matsuoka, Z. Ogumi, Electrochim. Acta, 51\n(2005) 1130-1139.\n25 C. Lamy, E.M., Belgsir, J.-M. Léger, J. Appl. Electrochem., 31 (2001) 799-809.\n26 A.O. Neto, T.R.R. Vasconcelos, M. Linardi, E.V. Spinacé, R.W.R.V. da Silva, J.\nAppl. Electrochem., 35 (2005) 193-198.\n14\nFigure 1: Schematic comparison of PEM- (a) and AAEM-containing (b) fuel cells.\nFigure 2: Solvent uptake properties (defined in section 2) of AAEM-E (\u0001), AAEM-C\n(\u0002) and Nafion-115 (\u0002) at room temperature. D = fully dehydrated, W = water, M =\nmethanol, E = ethanol and EG = ethylene glycol. SU is solvent uptake, \u0006 = solvent\nmolecules per exchange group and t = membrane thickness.\nFigure 3: Solvent permeabilities of AAEM-E (\u0001), AAEM-C (\u0002) and Nafion-115 (\u0002)\nat room temperature. M = methanol, E = ethanol and EG = ethylene glycol.\nFigure 4: Direct alcohol fuel cell performance curves at 50°C for (a) AAEM-E, (b)\nAAEM-C and (c) Nafion-115 with methanol (\u0002), ethanol (\u0002) and ethylene glycol\n(\u0001). Filled symbols represent Vcell and open symbols represent Pcell.\n15\nTable 1\nSelected properties of the various polymer electrolytes [2] \n AAEM-E AAEM-C Nafion-115\nExchange group -N+Me3 OH- -N+R3 OH- -SO3- H+\nNotes radiation-grafted ETFE additional cross-links\nIECdrya \/ mmol g-1 1.03 ± 0.11 1.14 ± 0.02 0.93 ± 0.07\ntFHb \/ µm 74 ± 2 153 ± 4 153 ± 3\ntdryb \/ µm 60 ± 2 135 ± 2 121 ± 3\nWUc (%) 40 ± 5 28 ± 2 40 ± 2\n\u0006FHd 21 ± 3 14 ± 1 24 ± 2\n\tFHe \/ S cm-1 0.030 ± 0.005 0.033 ± 0.002 0.093 ± 0.008\naIon-exchange capacity. b Ionomer thickness. c Gravimetric water uptake = 100% x\n(mFH – mdry) \/ mdry , where m represents the ionomer masses. d Water content (number\nof water molecules per OH- anion). e Through plane (normal) conductivity at 30°C in\nwater evaluated from 2-probe electrochemical impedance spectroscopic data. FH and\ndry represents fully hydrated fully dehydrated ionomers respectively.\nTable 2\nSelected fuel cell test data extracted from Fig. 4.\nAAEM-E AAEM-C Nafion-115\nVOCV\n\/ mV \nPmax\nmW cm-2 \nVOCV\n\/ mV \nPmax\n\/ mW cm-2 \nVOCV\n\/ mV \nPmax\n\/ mW cm-2 \nM 565 2.16 701 1.17 655 30.6\nE 632 2.09 749 1.71 636 7.42\nEG 513 1.99 604 1.57 550 8.6\n"}