{"doi":"10.1093\/pa","coreId":"55100","oai":"oai:eprints.lincoln.ac.uk:2245","identifiers":["oai:eprints.lincoln.ac.uk:2245","10.1093\/pa"],"title":"A question of expertise: the House of Lords and welfare policy","authors":["Bochel, Hugh","Defty, Andrew"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-01","abstract":"The expertise of its members is often cited as one of the distinctive features of the House of Lords. In particular it is frequently argued that because of its composition, and in particular the existence of the Crossbench Peers, debates in the Lords are more informed than in the Commons. Peers, it has been claimed, bring professional experience and expertise to the scrutiny of legislation, and have the time to maintain their expertise, in contrast to the Commons, where MPs, because of the demands of re-election and constituency business, are sometimes seen as being required to know a little about a wide range of subjects. Moreover, the presumed expertise of the Upper House has also been central to debates about the reform of the House of Lords, with assertions that any further reform should retain the Lords’ ability to provide distinctive and informed scrutiny.\\ud\n\\ud\nDrawing on a series of interviews with a large sample of MPs and Peers this article seeks to examine what is meant by parliamentary expertise by focusing on one particular policy area – welfare. It seeks to explore the nature of parliamentary expertise on welfare in both Houses, and suggests that in the field of welfare the Upper House may, in fact, be less expert than the House of Commons","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/55100.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/2245\/1\/Bochel__Defty_-_A_less_expert_house_-_parl_affs_%283%29_HB_for_IR.docx","pdfHashValue":"c8ec085a189b25910d2c040cc630d1a78b5a1e5d","publisher":"Oxford University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n    \n      oai:eprints.lincoln.ac.uk:2245<\/identifier><datestamp>\n      2014-07-17T12:34:10Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F4C:6A6163735F4C323330<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F4C:6A6163735F4C343130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/2245\/<\/dc:relation><dc:title>\n        A question of expertise: the House of Lords and welfare policy<\/dc:title><dc:creator>\n        Bochel, Hugh<\/dc:creator><dc:creator>\n        Defty, Andrew<\/dc:creator><dc:subject>\n        L230 UK Government\/Parliamentary Studies<\/dc:subject><dc:subject>\n        L410 UK Social Policy<\/dc:subject><dc:description>\n        The expertise of its members is often cited as one of the distinctive features of the House of Lords. In particular it is frequently argued that because of its composition, and in particular the existence of the Crossbench Peers, debates in the Lords are more informed than in the Commons. Peers, it has been claimed, bring professional experience and expertise to the scrutiny of legislation, and have the time to maintain their expertise, in contrast to the Commons, where MPs, because of the demands of re-election and constituency business, are sometimes seen as being required to know a little about a wide range of subjects. Moreover, the presumed expertise of the Upper House has also been central to debates about the reform of the House of Lords, with assertions that any further reform should retain the Lords’ ability to provide distinctive and informed scrutiny.\\ud\n\\ud\nDrawing on a series of interviews with a large sample of MPs and Peers this article seeks to examine what is meant by parliamentary expertise by focusing on one particular policy area – welfare. It seeks to explore the nature of parliamentary expertise on welfare in both Houses, and suggests that in the field of welfare the Upper House may, in fact, be less expert than the House of Commons.<\/dc:description><dc:publisher>\n        Oxford University Press<\/dc:publisher><dc:date>\n        2010-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/msword<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/2245\/1\/Bochel__Defty_-_A_less_expert_house_-_parl_affs_%283%29_HB_for_IR.docx<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/2245\/2\/A_question_of_expertise_-_the_House_of_Lords_and_welfare_policy.pdf<\/dc:identifier><dc:identifier>\n          Bochel, Hugh and Defty, Andrew  (2010) A question of expertise: the House of Lords and welfare policy.  Parliamentary Affairs, 63  (1).   pp. 66-84.  ISSN 0031-2290  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1093\/pa\/gsp019<\/dc:relation><dc:relation>\n        10.1093\/pa\/gsp019<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/2245\/","http:\/\/dx.doi.org\/10.1093\/pa\/gsp019","10.1093\/pa\/gsp019"],"year":2010,"topics":["L230 UK Government\/Parliamentary Studies","L410 UK Social Policy"],"subject":["Article","NonPeerReviewed"],"fullText":" 1\n \n \n \nA Question of Expertise? The House of Lords and welfare policy. \n \n \nAbstract \nThe expertise of its members is often cited as one of the distinctive features of the \nHouse of Lords. In particular it is frequently argued that because of its composition, \nand in particular the existence of the Crossbench Peers, debates in the Lords are more \ninformed than in the Commons. In contrast to the Commons where MPs, because of \nthe demands of re-election and constituency business, are required to know a little \nabout a wide range of subjects, Peers, it has been claimed bring professional \nexperience and expertise to the scrutiny of legislation, and have the time to maintain \ntheir expertise. Moreover, the presumed expertise of the Upper House is also central \nto debates about the reform of the House of Lords, with assertions that any further \nreform should retain the Lords ability to provide distinctive and informed scrutiny. \n \nDrawing on a series of interviews with a large sample of MPs and Peers from across \nparliament this paper seeks to examine what is meant by parliamentary expertise by \nfocusing on one particular policy area – welfare. It will seek to determine the nature \nof parliamentary expertise on welfare in both Houses and suggests that in the field of \nwelfare the Upper House may in fact be less expert than the House of Commons. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nProfessor Hugh Bochel  \n& Dr Andrew Defty \nDepartment of Policy Studies \nUniversity of Lincoln \nBrayford Pool \nLincoln LN6 7TS \nUK \nTel: +44 (0)1522 886089 \nEmail: adefty@lincoln.ac.uk \n \n \n 2\nA Less Expert House? The House of Lords and welfare policy. \n \nThe expertise of its members is often cited as one of the distinctive features of the \nHouse of Lords. The system of appointments to the House of Lords has seen the \ncreation of a second chamber which comprises some the most experienced politicians \nin the country, combined with a large number of prominent experts from a diverse \nrange of fields some of whom are prepared to take the Party Whips, whilst many have \nchosen to sit on the crossbenches. In particular it is often claimed that the system of \nLife Peerages introduced in 1958, has brought into the Lords many individuals who \nwould not otherwise have sought to take part in the legislative process, and through \nthe freedom offered by the crossbenches, are able to offer their expertise without \nfeeling constrained by membership of a political party. This, it is claimed, has created \na House which is less dominated by Party and as such is able to offer balanced and \ninformed scrutiny of legislation and Government policy.1 Indeed, it has become \naxiomatic that the Lords is not only a forum for expert scrutiny but also that the \nbreadth of expertise available in the House is such that it maintains a reservoir of \nexpertise on any subject which is likely to come before it, or as the Joint Committee \non House of Lords Reform succinctly observed ‘it has often been said that in the \nHouse of Lords an expert may be found on any subject’.2  \n \nAs the Joint Committee suggests, the presumed expertise of the Upper House has also \nbeen central to debates about reform of the House of Lords. Historically, proposals for \nHouse of Lords reform have started from the assumption that the House of Lords \nprovides distinctive and informed scrutiny and that whatever the intention of reform, \ncare should be taken to ensure that this ability is retained or if possible enhanced. \nLord Bryce, who chaired the Cabinet Committee on Lords reform in 1918, asserted \nthat second chambers should be reservoirs of ‘specialist knowledge and ripened \nwisdom’.3 The Life Peerages Act of 1958, whilst clearly designed to make the Lords \nmore democratic, also opened up the chamber to ‘good and intelligent citizens’ with \n‘special knowledge useful to the community’,4 and is now widely credited with \ndramatically enhancing the expertise of the House of Lords.  \n \nSince 1997, the Labour Governments’ proposals for reform have stressed that the \nexpertise and experience which its members bring to their scrutiny role is a distinctive \nfeature of the House of Lords, and that changes to the composition of the House \nshould not jeopardise this. The Government’s 1998 White Paper on House of Lords \nreform asserted that the second chamber should have a distinctive role in the \nlegislative process and that: \n \nThe most distinctive and important role of the present House of Lords is the \nspecialist expertise and independent perspective it can bring to the scrutiny of \nlegislation.5  \n \nThe subsequent report by the Royal Commission on the Reform of the House of Lords \noutlined proposals for a more democratic and representative House through the \ncreation of a chamber which reflected the overall balance of political opinion within \nthe country, and contained members from all parts of the country and all walks of life. \nAt the same time it argued that the House should have authority and that this should \nbe based in part on several existing characteristics of the House, notably the \n‘individual personal distinction’ of its members and ‘the breadth of experience and \n 3\nrange of expertise which they possess’.6 Similarly, the Parliamentary Joint Committee \non House of Lords Reform outlined five criteria which were desirable for a reformed \nsecond chamber: no domination by a single party; independence; expertise; legitimacy \nand representativeness. The current House, it asserted, already met the first three of \nthese criteria, and these should be ‘bolstered by greater representativeness’ and that \nfrom this a new legitimacy will ‘naturally develop’.7   \n \nIn its most recent proposals for reform the government appears to have moved away \nsomewhat from the notion that the House of Lords should provide expert scrutiny of \nlegislation. Whilst it continues to assert that members should ‘be able to bring \nindependence of judgement to their work’8 it suggests that if an appointed element \nwere retained in a reformed House, an individual’s ‘ability, willingness and \ncommitment to take part in the full work of the second chamber’9 would be more \nimportant than the expertise and experience they would bring to the chamber, and \nconcludes that: \n  \n a reformed second chamber would be able to get access to specific expertise and \nexperience through, for example, committees taking written and oral evidence, \nrather than through the appointment of members with particular expertise and \nexperience.10  \nNevertheless, the perceived expertise of the current House of Lords remains central to \nclaims for the retention of the House in its current form, or at least the retention of \nsome appointed element. Yet it is clear that whilst the democratic legitimacy of an un-\nelected second chamber has often, and continues to be the subject of considerable \ndebate, the expertise of the House of Lords is rarely questioned. It is widely accepted \nthat the House of Lords is an expert House, but in the various proposals for reform, \nand indeed in much of the academic literature, little effort has been made to define \nwhat is meant by expertise in this context, or to quantify or qualify the sources of the \nsecond chamber’s expertise. Indeed, the lack of research on parliamentary expertise \nmay be a significant gap in the parliamentary literature in general, given that both \nhouses of parliament are expected to provide some degree of informed scrutiny of \npolicy and legislation. It is particularly significant to debates about the operation of \nthe House of Lords, because whilst in the eyes of many, the current House of Lords \nmay lack democratic legitimacy, whatever authority and legitimacy it does have is \nderived from the expertise of its membership. If expertise is the distinctive feature of \nthe second chamber, and provides the basis for both current and future claims to \nlegitimacy then it is important to understand what this means. \n \nThis paper seeks to examine the nature and extent of expertise in the House of Lords \nby focusing on one particular policy area – welfare. It draws on two pieces of research \nby the authors on parliament and welfare policy. The first, undertaken during 2004 \nand 2005, focused primarily on the attitudes and activities of members of the House \nof Commons in relation to the formulation and scrutiny of welfare policy.11 That \nresearch drew on interviews with 76 MPs, a sample comprising ten per cent of the \nHouse of Commons. In addition ten peers were interviewed. The second piece of \nresearch was undertaken during 2007 and 2008, and involved interviews with a \nfurther 66 members of the House of Lords, taking the total number of Peers \ninterviewed to 76, ten per cent of the current House of Lords.  In each case the \nsamples were balanced to represent the balance of the parties with at least ten per cent \n 4\nof the main parties in each House interviewed, along with ten per cent of cross-bench \nPeers and of Bishops. The same questionnaire was used when interviewing MPs and \nPeers about welfare. This comprised a series of general questions about attitudes \ntowards the role of the state in welfare, and more specific questions on a number of \nareas of welfare policy. The general questions were designed to elicit the \ninterviewee’s general philosophy of welfare, with questions such as: what role should \nthe state play in welfare provision?; how should welfare provision be financed?; what \nare the most important areas? This was followed by more specific questions on four \npolicy areas: the NHS; pensions; benefits; and income maintenance. In addition, MPs \nand Peers were asked a number of questions about the operation of their respective \nHouses. These two studies, which in combination involved lengthy face-to-face \ninterviews with over 150 MPs and Peers, have provided extensive data on \nparliamentary attitudes to welfare, and also allow some comparison of the nature and \nextent of expertise on welfare within the two Houses of Parliament.    \n \nExpertise in the House of Lords \n \nIn interviews there was, perhaps not surprisingly, strong support among Peers from all \nparties for the idea of the House of Lords as an expert House. Peers referred to the \nwealth of expertise on all sides of the House, not just on the crossbenches, and said \nthat shared expertise tended to create cross-party affiliations of Peers with similar \nbackgrounds and experience. Peers referred to actively seeking out those with \nexpertise when legislation was being debated in the Lords, rather than looking to the \nParty Whips for guidance. Indeed, several Peers asserted that in many cases expertise \nwas more important than party loyalty, and that a well-informed speech by a \nrecognised expert was in some cases sufficient to carry a debate irrespective of party \npositions.  \n \nSeveral Peers repeated the axiom that in the House one could find an expert on any \nsubject, and one Labour Peer went so far as to claim that ‘on any subject there are 20 \nto 30 experts’ in the House of Lords. Others were more discerning and identified \nareas in which the expertise of the House was particularly evident. Several Peers \nreferred to the recent debates on the Human Fertilisation and Embryology Bill as \nexemplifying the House at its best, able to draw on world experts in the field, such as \nLord Winston. Other areas which Peers identified included those related to defence \nand the military, where the presence of the former Chiefs of Defence Staff or ‘War \nLords’ was felt to be particularly valuable, and the debates on Northern Rock, in \nwhich the House was able to draw on the expertise of many Peers with experience in \nthe financial sector. In the field of social policy, several Peers referred to a \nparticularly active group who speak on disability issues, including the Labour Peer \nLord Ashley, and the Crossbench Peer and Secretary-General of Mencap, Lord Rix. \n \nIn many, if not most, cases the expertise and experience of members of the House of \nLords was contrasted, explicitly or implicitly, with that displayed by members of the \nHouse of Commons, to the obvious detriment of the lower house. Significantly this \nincluded Peers with experience in both Houses. One former Conservative Cabinet \nMinister observed that the Lords was ‘a much better informed chamber by a mile,’ \nwhilst another claimed ‘debates here are generally better informed than in the \nCommons, because of the wider experience here’. This is a common feature of studies \non the House of Lords, where the expertise of the Upper Chamber is sometimes seen \n 5\nas the distinguishing feature between the two houses, so that, as Philip Norton has \nobserved, ‘while the House of Commons is increasingly a House of career politicians, \nthe Lords sees itself as being a House of experience and expertise’.12  \n \nThere are a number of reasons why the Lords is viewed as an expert House, and the \nCommons is not. Firstly, as Norton suggests, the House of Commons is a partisan \nchamber where the motive force is politics and the outcome and indeed the conduct of \ndebates is governed much more by party policy, political patronage and whipping, \nthan it is by the knowledge and contribution of individual MPs. Although several \nPeers said that the Lords was becoming more political, most claimed to be \nunconcerned by the Whips and also claimed that unlike MPs they were more likely to \nbe swayed by debates within the House if those speaking were recognised experts, \nalthough few offered any examples of this. Similarly, many Peers claimed that the \nHouse of Lords was a more consensual House, where issues were judged on their \nmerit, rather than simply along party lines. However, our research indicated that in \nrelation to welfare, the degree of cross-party consensus was rather greater in the \nHouse of Commons than in the Lords.13  \n \nUnderpinning these views of the differences between the houses is the notion that the \nHouse of Commons is dominated by career politicians, whereas members of the \nHouse of Lords are politicians with careers. The rise of the career politician, most \nfamously identified by King in the 1980s, has perhaps gained even greater credence in \nrecent years following the influx of some remarkably young MPs during and since the \n1997 General Election. According to this view MPs are entering parliament at an \nearly age, and seeking to remain there rather than pursuing a second career \nelsewhere.14 In contrast members of the House of Lords are likely to have entered \nParliament much later in life, after a successful career in some other field than \npolitics. It is this experience which lies at the basis of the Upper Chamber’s claim to \nprovide more informed scrutiny, as one Peer observed: \n \nThe chamber is packed with people who don’t care about their political \ncareers, who have made their money. Some MPs have never worked. \nMembers of the House of Lords have worked. \n \nMoreover, as several Peers observed, the relative lack of financial remuneration for \nsitting in the House of Lords means that many Peers must carry on working whilst \nsitting in the House. The part-time nature of the House is seen as further contributing \nto the expertise within the House by ensuring that members are able to maintain their \nparticular expertise, and also by exposing them to life beyond Westminster. As \nNorton has observed, the House of Lords has been ‘characterised as a full-time House \nof part-time members – an active chamber drawing on members whose expertise \nderives from work normally pursued outside the House’.15 Consequently, Peers \nfrequently referred to their work outside the Chamber, both in terms of informing \ntheir work within the House but also in keeping them ‘in touch’ with everyday life.  \n \nPeers, and particularly those who had served as MPs, also identified differences in the \nway in which two Houses operate, which they suggested had a significant impact on \nthe ability of the Upper House to express and retain its expertise. Most significantly, \nseveral Peers argued that they were more able to specialise and maintain their \nexpertise, because unlike MPs, they had more time at their disposal, primarily because \n 6\ntheir time is not dominated with dealing with the concerns of constituents. One Peer \nobserved that MPs are required to ‘act like social workers’ and consequently have \nlittle time for anything else, not least detailed scrutiny of legislation. Many of those \nPeers who had previously served as MPs appeared relieved to be free from \nconstituency duties, and believed this enabled them to be more effective \nparliamentarians, so that, as one Peer observed,  ‘I’ve got time to help people, I don’t \nmiss the constituents at all.’ \n \nIn addition to allowing Peers more time to specialise, it was also suggested that the \nlack of a constituency interest meant that Peers approach their work in a different \nmanner. MPs, it was argued, tended to adopt a more short-term tactical approach, \nwhereas Peers ‘have time to consider and reflect more broadly’, whilst others referred \nto the ‘strategic’ or ‘long-term view’ which was often in evidence in the Lords. As \none former MP, and respected expert on welfare bluntly declared: \n \nLots of tripe is talked about case work. I don’t need queues of people to tell \nme that the benefits system doesn’t work. It drags you down into tactical \nconsiderations. No one in the Commons has time for long-term strategic \nvision. \n \nFinally, perhaps the most significant difference between the two Houses, particularly \nin terms of expertise, is the presence of the Crossbenchers in the House of Lords. \nPeers from all sides of the House expressed strong support for the role of the \nCrossbenchers as a reservoir of parliamentary expertise which had drawn many \nindividuals into parliament who would not otherwise be there. Indeed, several Peers \nsuggested that the Crossbenchers are the only truly expert members of the House. \nSeveral Peers referred to the importance of the House of Lords Appointments \nCommission in bringing a more diverse range of expertise into the House. It was \nwarmly praised for bringing in a number of very good Crossbenchers, and had, \naccording to one Peer, ‘changed the complexion of the House.’ Several Crossbench \nPeers talked with some bemusement about their own elevation to the Peerage, but \nstrongly supported the idea of non-party political Peers and the inclusion of some \nappointed element within the House. An elected second chamber one suggested would \nbe ‘a disaster… you would just get the same old people’, whilst another declared: \n \nIf you made it elected you wouldn’t get people like me up here. I couldn’t \nafford it. I couldn’t run an election campaign. Then it wouldn’t be an expert \nHouse. \n \nA less expert House? The House of Lords and welfare \n \nAlthough there was strong support among many Peers for the view that the House of \nLords is an expert House, there was not, however, universal support for this position. \nSeveral Peers did, however, dissent from the prevailing view that debates in the Lords \nwere all well-informed and that the House of Lords is a more expert House than the \nCommons, as the following quotes from a prominent Labour Peer and a Liberal \nDemocrat Peer suggest. \n \nWe have some great well-informed debates but they are often not as good as \npeople think that they are. \n 7\n \nPeople with expertise here have it in particular areas but don’t have it in depth \nand across the board. \n \nIn researching parliamentary attitudes to welfare there was considerable evidence to \nsupport the view that whilst there are a great many experts in the House of Lords, the \nexpertise of the chamber as whole is patchy, and in some case limited, particularly \nwhen compared to the House of Commons. Peers’ responses to questions on welfare \nwere, at times, markedly different to those offered by MPs, and often appeared to be \nless informed. Peers were happy offering a general view of their beliefs on the role of \nthe state in welfare, although the language they used was markedly different to that \nemployed by MPs. In general there was a greater propensity for Peers to refer back to \nolder models of welfare provision and the language used by Peers was much closer to \nthat used by MPs interviewed for a similar project in the 1980s.16 Many Peers referred \nto the fundamental principles of the welfare state, with Peers’ from all parties \nreferring to the Beveridge model, which was rarely mentioned by MPs. Similarly, \nthere was amongst Peers from all sides, a widespread use of the metaphor of the state \nproviding a ‘safety-net’, an image which was widely used by MPs in the 1980s, but \nwhich has been replaced in the lexicon of many MPs today with newer ideas about the \nstate acting as an enabling mechanism to get people back into work. Although Peers’ \nresponses suggested that they were drawing on a body of knowledge acquired or \nbeliefs formulated some time ago, it may also indicate the long view which the more \nexperienced members of the Upper House are able to employ, and whether this means \nthat their knowledge is not up-to-date is difficult to tell. \n \nHowever, when asked about specific policy areas, Peers in general were much less \ncomfortable, and in many cases clearly unfamiliar with current developments in \npublic policy, or in some cases their own party’s policies. In interviews with Peers \nthere was much less discussion of specific welfare policies such as tax credits, \nPathways to Work, Sure Start, and even the report of the Pensions Commission, all of \nwhich featured heavily in interviews with MPs. Moreover, far from offering a party \npolitical diatribe as some MPs undoubtedly did, several Peers asked the interviewer \nwhat their party’s policy was on particular aspects of welfare policy. In most cases \nPeers appeared to rely heavily upon their own beliefs and personal experience, with \nthe result that they tended to have some knowledge of some areas, most notably the \nhealth service and pensions, but relatively little or no understanding of others, such as \nthe benefits system. Indeed, in total 18 Peers (one quarter of the sample) declined to \nanswer the question on benefits because they had no knowledge, experience, or \nunderstanding of it. No MPs did this. Moreover, because their knowledge was often \ndrawn from personal experience, in many cases Peers’ understanding was, by its very \nnature, patchy and anecdotal. Partly as a result of their age, many Peers had recent \nexperience of accessing healthcare and often referred to their personal experiences in \nthis context, whilst others mentioned the importance of the experiences of friends and \nfamily in informing their knowledge about welfare. Whilst such insights are clearly \nvaluable, they may be markedly less representative than the breadth of knowledge \nacquired by MPs, directly from their constituents, through visits to, for example, \nhospitals, Job Centres and care homes in their constituencies, or through party \nbriefings.  \n \n 8\nIt would however be wrong to say that this applied to all Peers interviewed. Several of \nthose Peers interviewed were highly knowledgeable and would clearly be considered \nexperts in various aspects of social policy, and in some cases they owed their position \nin the Lords to this. However, whilst there are undoubtedly some Peers with detailed \nknowledge of some aspects of welfare, this knowledge tends to be deep and specific \nand not broad, and moreover, it appears to be limited to a relatively small number of \nPeers. Very few Peers appear to have the kind of broad familiarity with the welfare \nstate that most MPs displayed, and those who did tended to be either front bench \nspokespeople on some aspect of welfare policy, or had recently come up to the Lords \nfrom the House of Commons. \n \nThere are a number of factors which may explain the relative lack of expertise in the \nHouse of Lords, particularly in the field of welfare, but perhaps also more widely. \nMost significantly, in the field of social policy it was quite clear that the constituency \nsystem, which many Peers identified as a barrier to the development of parliamentary \nexpertise, was a vital source of information for MPs, ensuring a detailed and constant \nexposure to the impact of welfare policy and administration. What MPs referred to as \ntheir ‘social work’ or ‘ombudsman’ function, is a particularly strong feature of the \nBritish constituency system and provides MPs with a useful, if not always welcome, \nbarometer of public experience of the public services. As one former Conservative \nsocial security Minister observed: \n \nYou get some members of the public who are experts in foreign affairs, \nbut you probably get a better picture of foreign affairs from here at \nWestminster. But in the welfare field, the punter is the expert. There is no \ndoubt that the debates on the Child Support Agency, and Tax Credits have \nbeen driven by constituents. That is one of the strengths of the \nconstituency system, you go back to your constituencies on a Friday and \npeople tell you what’s really going on. \n \nSeveral of those Peers who had been MPs recognised that this lack of contact with \nconstituents now impacted on their knowledge of the welfare policy environment, one \nopined that ‘it’s different since I stopped being an MP. Constituents were a big \ninfluence, but now I don’t get the phone calls, letters, etc. MPs tend to hear lots of \nproblems’ whilst another observed that ‘MPs are brought into contact with the real \nworld … As an MP you are in daily contact with social problems, in here you are \nisolated.’ \n \nIn addition, whilst the part-time nature of the Lords allows Peers to sustain their \nprofessional expertise through working outside the Chamber, the opportunities for \nthem to specialise and develop expertise within Westminster itself are  limited. Once \nagain this is particularly the case when compared with the position in the House of \nCommons. Members of the House of Lords have limited facilities for research, \nparticularly when compared to MPs. Many Peers bemoaned the lack of staff and \noffice space. They were, according to one Labour Peer, ‘massively less resourced’ \nthan MPs, whilst another asserted that the lack of research facilities and the \nrudimentary office structure encouraged ‘the cult of the amateur’, which was not \nconducive to informed scrutiny. Peers also referred to a relative lack of information \nand briefings from their party. Although it is doubtful that many would embrace more \nrigorous Whipping, there was a feeling amongst some Peers that they were effectively \n 9\nleft alone to get on with it and were not provided with sufficient information on policy \nand forthcoming legislation.  \n \nInterestingly, as a result of this, it was apparent that Peers make far more use of \nlobbying materials than do MPs. Whilst most MPs responded to questions about \nlobbying by brandishing the wastepaper basket, over half of Peers interviewed \nclaimed they found lobbying useful as a vital source of information on the nature and \nimplications of forthcoming legislation. \n \nPeers’ lack of knowledge about social welfare, and welfare policy may therefore lead \nus to qualify somewhat claims about the remarkable range of expertise to be found in \nthe House of Lords. Moreover, welfare is not an insignificant or arcane area of public \npolicy; indeed, it is the largest area of public expenditure. This raises the question that \nif the House of Lords is an expert House, where does its expertise lie? There is clearly \nscope for further research on this, but some existing studies have drawn attention to \nthe patchy nature of expertise in the House of Lords. Crewe, for example, revealed \nthat lawyers, company directors, former MPs and academics now dominate the \nHouse, whereas Doctors, social workers, teachers and even farmers are now rather \npoorly represented.17 Similarly, in the most recent edition of his work on the House of \nLords, Shell observes that ‘it is noticeable that some professions and some areas of \npublic service seem under-represented in the House’ noting in particular the paucity \nof teachers with the result that ‘the frequent debates on schools that take place there \nare marked by an absence of contributions from peers who have actually worked in \nschools’.18 \n \nOur research also suggests that claims about a relative lack of experience and \nexpertise among members of the House of Commons are somewhat unfair. There is in \nfact a great deal of expertise in the House of Commons, and whilst a greater \nproportion of MPs are undoubtedly entering the Chamber at an early age, many others \nalso have considerable experience of working in a wide range of professions before \nentering the Chamber. It is commonplace in studies of the House of Lords to provide \nexamples of the range of expertise on display in the average Lords’ debate, such as \nthe following example offered by Lord Howe: \n \nWhether in the scrutiny of legislation or in penetrating, well-mannered policy \ndebates, the Lords’ membership can, and does, deliver a huge diversity of \nindependent-minded expertise. A typical NHS debate, for example, featured \ntwo Deans of Medical Schools, a dentist, a former GP, two Consultants, \nProfessor of Nursing, the President of Mencap and former director of Age \nConcern. Almost any other subject would normally attract a comparably \nqualified cast.19 \n \nThis is certainly impressive, but it would be wrong to assume that one could not find a \nsimilar array of experience and expertise on display in debates in the House of \nCommons. For example, those MPs who contributed to the second reading of the \nHuman Fertilisation and Embryology Bill included two hospital registrars, one of \nwhom is a member of the BMA medical ethics committee; a former Dean of a School \nof Biological Sciences; a former reader in organic chemistry; University lecturers \nwith PhDs in biochemistry and philosophy; a former Director of BUPA; a psychiatric \n 10\nnurse; a social worker formerly employed by the National Carers Association, at least \ntwo former Health ministers, and assorted members of the Health select committee.20  \n \nIndeed the notion that the House of Commons does not contain experts was \ncontradicted by the comments of several MPs. Many MPs talked about the importance \nof expertise within the House of Commons, and also about capacity of the Commons \nto allow MPs to develop expertise. Many referred to the importance of select \ncommittees in allowing MPs to develop real expertise through contact with experts \nfrom outside Westminster, but also through stimulating their own work and \ninvestigations. Moreover, MPs also stressed the advantage of expertise in influencing \ndebate in the House. MPs who are recognised as experts are more likely to be \nconsulted by or have access to Ministers, and they may be more likely to catch the \nSpeaker’s eye in debates on which they are considered to be knowledgeable. \nAlthough the breadth of topics they are required to cover means that relatively few \nMPs are considered to be experts on social policy, a handful, such as the Labour MP \nFrank Field, the Conservative MP David Willets, and the Liberal Democrat MP Steve \nWebb, are seen by MPs from all parties as experts on welfare, and as such are more \nlikely to be listened to.  \n \nFinally, perhaps what is necessary is a clearer understanding of what is meant by \nexpertise. In the literature on the House of Lords, and indeed in debates over \nproposals for reform, it is often not clear what is meant by expertise. Quotes such as \nthat from Howe above, suggest that expertise is based upon qualifications and \nknowledge. However, it is also apparent that what is valued in the House of Lords is \nnot simply knowledge but also experience. Lord Puttnam, for example, asserted that, \n‘I recognise the importance of particular experience in life just as much as I do \nspecialist or academic knowledge’.21 Similarly, Crewe observed that: \n \nLearned speeches do not necessarily sway argument; knowledgeable \nbackbenchers can alienate if they are felt to be showing off or waffling, and \nanalytical contributions from academics are sometimes completely ignored. It \nmay be a House of ‘experts’ but if knowledge is gained from personal \nexperience it is often taken more seriously than the product of research. 22 \n \nYet expertise and experience are clearly not the same thing. One may be measurable, \nquantifiable, and the other may be acquired over time and may or may not be related \nto age. It may be more appropriate to talk about different kinds of expertise. We may \nwant to distinguish between expertise borne out of scholarship, and expertise which is \nthe product of experience. It may also be useful to distinguish between narrow and \ndeep expertise, such as that which might be acquired by a PhD candidate, a hospital \nconsultant, or a research scientist, and broad but general expertise such as one might \nexpect from a General Practitioner, a school teacher, or a senior judge. Both kinds of \nexpertise are necessary, and in some cases, the GP and the surgeon, for example, they \nmay inform each other. In this case it may be more productive to think of the two \ncomplementary Houses as perhaps displaying different kinds of expertise, and \nmoreover, doing so in different policy areas. \n \nIt is clear then that there is expertise in both Houses, and that expertise in Parliament \nis acquired in different ways. Some MPs and Peers enter Parliament with considerable \nexpertise based on their life outside Westminster, whilst others acquire or develop \n 11\ntheir expertise within Parliament itself. The capacity for developing expertise while in \nParliament is arguably greater in the Commons than in the Lords. These differences \nmay be significant. This research suggests that in the field of welfare, the House of \nLords is not a more expert House than the Commons, and the reasons for this relate, \nin part, to the difference between a House based on constituency representation and an \nappointed House. However, it may be that freedom from constituency business in the \nUpper House facilitates the expression or development of expertise in other areas, \nsuch as, perhaps, the law. The system of appointments certainly allows experts to be \nbrought into parliament, but whilst the House of Lords contains many experts, this \ndoes not necessarily make it an expert House. It is an appointed House containing \nexpertise in some areas, whilst the House of Commons may be viewed as an elected \nHouse also containing expertise in some areas.  \n \nConclusion \n \nThere is no doubt that there is a great deal of expertise in the House of Lords. Many \nPeers are well respected experts within their chosen fields, and there is no doubt that \nthe quality of debates in the Lords can be very high. Several factors have served to \ncreate and sustain this level of expertise. Principally the system of appointing \nindividuals to the House of Lords, as Life Peers, and also as Crossbenchers, has \nbrought into Parliament a large number of talented individuals from a diverse range of \nbackgrounds. Once in the Lords, the way in which the House operates serves to allow \nmembers to maintain their expertise, principally by allowing, indeed encouraging, \nmembers to maintain a professional life outside the Lords, and by not expecting Peers \nto take on the demands of representing a constituency.  \n \nHowever, whilst there is certainly a great deal of expertise in the House of Lords, it is \nnot clear that this makes the House as a whole more expert. The expertise of the \nHouse of Lords is somewhat patchy, and may be deficient in a number of key policy \nareas such as welfare, particularly when compared with the House of Commons. In \ninterviews, few Peers displayed the breadth and depth of knowledge of welfare \npolicies and of the impact of those policies on the recipients of state support that was \ndisplayed by most MPs. There are several reasons for this. The absence of a \nconstituency which many Peers consider to be beneficial in terms of allowing them \ntime to develop their knowledge, is in some cases, such as welfare, a barrier to the \nacquisition of the kind of detailed knowledge and first hand experience on which MPs \nfrequently draw. Moreover, the opportunities for Peers to develop their expertise \nwithin the House are limited. The lack of research facilities, particularly compared to \nthe House of Commons, means that the principal ways by which Peers sustain their \nexpertise is by retaining a professional life outside the Chamber, which may limit \ntheir ability to contribute to the work of the House in other ways. In contrast, the \ndirect and sustained access to constituents, coupled with the relative wealth of \nresources available to MPs, means that in some fields at least, the House of Commons \nmay be considered the more expert chamber. However, it is also apparent that \nattempts to define and quantify the expertise of either House is somewhat problematic \nand as a result has been largely neglected in debates over the reform of parliament. If \nthe expertise of the second chamber is to be used to legitimise the retention of an \nappointed House, or some appointed element, then a much clearer understanding of \nwhat is meant by expertise is required.  \n 12\n                                                                                                                                            \n1 See for example, G. Howe, ‘The Commons and the Lords: a comparison’ in N.J. Baldwin ed. \nParliament in the 21st Century, London: Politico’s, 2005; D. Puttnam, ‘A Democratic and Expert \nHouse’ Political Quarterly, 70, (4), 1999, pp.368-374; D. Shell, ‘The Future of the Second Chamber’ \nThe Political Quarterly, 71, (4), 2000, pp.390-395. \n2 Joint Committee on House of Lords Reform, House of Lords Reform: First Report, London: The \nStationery Office, 2002, p.18. \n3 D. Shell, The House of Lords, Manchester: Manchester University Press, 2007, p.74 \n4 H. Morrison, Government and Parliament: a survey from the inside, London: Oxford University \nPress, 1964, p. \n5 Cabinet Office, Modernising Parliament: Reforming the House of Lords, London: The Stationery \nOffice, 1998, para.9. \n6 Royal Commission on Reform of the House of Lords, A House for the Future, Cm.4534, London: The \nStationery Office, 2000, p.97. \n7 Joint Committee, House of Lords Reform: First Report, p.18. \n8 Ministry of Justice, An Elected Second Chamber: Further reform of the House of Lords, Cm.7438, \nLondon: The Stationery Office, July 2008, p.4. \n9 Ministry of Justice, An Elected Second Chamber p.5. \n10 Ministry of Justice, An Elected Second Chamber p.51. \n11 H. Bochel, and A. Defty, Welfare Policy under New Labour, Bristol: The Policy Press, 2007. \n12 P. Norton, Parliament in British politics, Basingstoke: Palgrave Macmillan, 2005, p.37. \n13 H. Bochel, and A. Defty, ‘Parliament and Welfare Policy: the changing role of the House of Lords’ \npaper presented at the PSA Annual Conference, University of Swansea, 2008. \n14 A. King, ‘The rise of the career politician in Britain – and its consequences’ British Journal of \nPolitical Science, 11, 1981, pp.249-85. \n15 Norton, Parliament in British Politics, p.38. \n16 H. Bochel, Parliament and Welfare Policy, Aldershot: Ashgate, 1992. \n17 E. Crewe, Lords of Parliament, Manchester: Manchester University Press, 2005,p. \n18 Shell, The House of Lords, p.66. \n19 Howe, ‘The Commons and Lords’  \n20 Human Fertilisation and Embryology Bill, 2nd Reading, Hansard, 12th May 2008, cols.1063-1161. \n21 Puttnam, ‘A Democratic and Expert House’, p.369. \n22 Crewe, Lords of Parliament, p.35. \n"}