{"doi":"10.2277\/0521809843","coreId":"66587","oai":"oai:dro.dur.ac.uk.OAI2:1009","identifiers":["oai:dro.dur.ac.uk.OAI2:1009","10.2277\/0521809843"],"title":"Frankenstein, Matilda, and the legacies of Godwin and Wollstonecraft.","authors":["Clemit,  P. A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":["Schor, Esther."],"datePublished":"2003","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66587.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1009\/1\/1009.pdf","pdfHashValue":"c4dd610d9957a21b40fae08773351946847c4334","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1009<\/identifier><datestamp>\n      2011-07-05T15:47:03Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Frankenstein, Matilda, and the legacies of Godwin and Wollstonecraft.<\/dc:title><dc:creator>\n        Clemit,  P. A.<\/dc:creator><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:source>\n        Schor, Esther. (Eds.).  The Cambridge companion to Mary Shelley. Cambridge: Cambridge University Press, pp. 26-44, Cambridge companions to literature<\/dc:source><dc:contributor>\n        Schor, Esther.<\/dc:contributor><dc:date>\n        2003<\/dc:date><dc:type>\n        Book chapter<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1009<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1009\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.2277\/0521809843<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1009\/1\/1009.pdf<\/dc:identifier><dc:rights>\n        © Cambridge University Press 2003.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":[],"subject":["Book chapter","PeerReviewed"],"fullText":"2\nPAMELA CLEMIT\nFrankenstein, Matilda, and the legacies\nof Godwin and Wollstonecraft\nIMy morhcr'sJ greatness of soul & my father high ralcms have perpetually\nreminded me that I ought [Q degenerate as little as I could from rhose from\nwhom I derived my being . . . my chief I1lCril must always be derived, first\nfrom the glory these wonderful beings have shed [?arolmdj me, & then for the\nenthusiasm I have for excellence & the ardem admiration I feci for those who\nsacrifice themselves for the public good. (L \" 4)\nIn this lerter of September 1827 to Frances Wright, the Scortish-born\nauthor and social reformer, Mary Shelley reveals juSt how much she felt\nher life and thought to be shaped by the social and polirical ideals of her\nparents, William Godwin, the leading radical philosopher of the '790S, and\nhis wife, the proto-feminist writer Mary Wollstonecraft. The multiple liter-\nary, political, and philosophical influences of Godwin and Wollstonecraft\nmay be traced in all six of Mary Shelley'S full-length novels, as well as in\nher tales, biographies, essays, and other shorter writings. Vet while she con-\nsistently wrote within the framework established by her parents' concerns,\nshe was no mere imitator of their works. \\Xlriring with an awareness of\nhow French revolutionary politics had unfolded through the Napoleonic era,\nMary Shelley eXTends and reformulates the many-sided legacies of Godwin\nand Wollstonecraft in extreme, imaginatively arresting ways. Those legacies\nreceived their most searching reappraisal in Frankenstein; 01; The Modern\nPrometheus (18I8), Mary Shelley's remarkable first novel, and were re-\nexamined a year later in Matilda, a novella telling the story of incestuous\nlove between father and daughter, which, though it remained unpublished\nuntil 1959, has now become one of her best-known works.\nThough Frankellsteill appeared anonymously, Mary Shelley advertised her\nprimary intellectual allegianee in the dedication of the first edition, \"To\nWilliam Godwin, Author of Political Justice, Caleb Williams, &c.\" Review-\ners, piqued by the absence of the author's name, were quick to draw parallels\nThe legacies of Godwio and Wollstooecralt\nwith Godwin's writings, but could nOt agree on the narure of those parallels.\nSir Walter Scott, in a long, insightful piece in Blackwood's Magazine, de-\nclared that Frankenstein was a novel on the same plan as Godwin's SL Leon:\nA Tale of the Sixteenth Century (1799), in which \"the author's principal ob-\nject ... is less to produce an effect by means of the marvels of tbe narrations,\nthan ro open new trains and channels of thought.'\" He surmised that the au-\nthor was Percy Bysshe Shelley, Godwin's son-in-law. The liberal Scots (later,\nEdinburgh) Magazi,w, owned by Archibald Constable, Godwin's friend and\npublisher, was torn between admiration and censure: \"Here is one of the\nproductions of the modern school in its highest style of caricature and exag-\ngeration. It is formed on the Godwinian manner, and has all the faults, but\nlikewise many of the beauties of that model.\" Again invoking St. Leon, the\nreviewer confessed Itimself fascinated as well as repelled by \"th.is wild fic-\ntion\" and arrribured irs \"monstrous conceptions\" to \"tbe wild and irreguJar\ntheories of the age. '\" In comrast, J. W. Croker, writing in the Tory Quarterly\nReview, compared Frankenstein to Godwin's latest novel, Mandeville: A Tale\nof the Seventeenth Century (1817), a confessional aCCOunt of spiraling reli-\ngious obsession:\nlFrankellsteinl is piously dedicated to l\\1r. Godwin, and is wrinen in the spirit\nof his school . .. Mr. Godwin is the patriarch of a literary family, whose chief\nskill is in delineating the wanderings of the intellect . .. His disciples are a\nkind of ollt-pensioners of Bedlam, and, like \"'Mad Bess'\" or '\"'Mad Tom,'\" arc\noccasionally visited with paroxysms of genius and fits of expression, which\nmake sober-minded people wonder and shudder.}\nWhile these early reviewers identified Mary Shelley's major intellectual\naffiliation, they did not grasp its full significance. What did it mean to be\nbrought up and educated in the Godwin \"schoo'''? From Iter birth on August\n30,1797, Mary Shelley was indissolubly linked to her parents' controversial\nwritings and reputations. Wollstonecrafr, who had married Godwin earlier\nthat year, died on September 10 ] 797 from complications following the\nbirth. The story of her life was disclosed to all when Godwin published\nMemoirs of the Author of A Vindication of the Rights of Woman in January\n] 798' This was a work of unprecedented biographical frankness, which\ncovered every phase of WoUstonecrafr's unorthodox career. It documented\nher friendship with. the married artist Henry Fuseli, ber residence in revo-\nlutionary France, her liaison with the American merchant Gilbert Imlay (to\nwhom she bore a child, Fanny), her twO anempts at suicide, her domes-\ntic \"experiment\" with Godwin, and, finally, her slow, painful death. 5 From\nGodwin's point of view, such candor was an anempt to enact in the public\nsphere the revolutionary doctrine of sincerity he had advocated in his works\nPAMELA CLEMIT\nof the early 1 790s: frank information about Wollstonecraft's unconventional\ndomestic circumstances was necessary to make her individual history an ef-\nfective agent of historical change. Contemporary readers, however, were\nshocked rather than liberated by what they perceived as cold-hearted reve-\nlations of Wollstonecraft's immorality, and Memoirs provoked widespread\nhostility from the cooservative press.\nEven before the publication of Memoirs, Godwin was regarded as a dan-\ngerously subversive \"disturber of the status quo. n6 An Enquiry conceming\nPolitical JIIstice, his great work of philosophical anarchism, appeared in\nFebruary 1793. Here Godwin argued that individuals, by the exercise of\nreason and judgment, have the power to emancipate themselves from the\nfalse opinion on which government is based, leadiog to the gradual dis-\nsolution of all legislative restraints.' This substantial philosophical treatise\nbecame an immediate success among revolutionary sympathizets of all per-\nsuasions. Despite Godwin's principled opposition to the use of force, his\nvigorous criticism of all forms of political authoriry seemed to offer leaders\nof the democratic reform movement a philosophical justification for their\npractical demands, and this may have prompted the government to debate\nhis prosecution,s The view that Godwin's theories posed a threat to social\nstability was reinforced by his next two works: Things As They Are; or, The\nAdvelltllres of Caleb Williams (1794), a novel dramatizing the impact of\naristocratic corruption on the individual; and Cllrsory Strictures (1794), a\npamphlet wrirten in defense of twelve leading radicals charged with high\ntreason in Octobet 1794. Indeed, by late 1797, Godwin's teachings were\nfelt to be so dangerous that the Anti-Jacobin, a satirical journal supported\nby government funds, launched a popular campaign to discredit him.- That\ncampaign found a new focus after the publication of Memoirs, in which\nGodwin not only politicized Wollstonecraft's arguments in favor of women's\nrights to equaliry and self-determination, but also conceptualized her as an\nagent of revolutionary social change. The ensuing reaction against the ad-\nvanced social theories of Godwin and Wollstonecraft lasted well into the\nnineteenth century.\nWhatever the legacy of fame or notoriery surrounding her parents, Mary\nShelley was brought up to share their central belief in the dury of engage-\nment in public debate on all pertinent moral, social, and political issues as a\nmeans of contributing to the general welfare. Apart from attending a local\nday school at the age of four and a boarding school at Ramsgate at the\nage of thirteen, Mary Shelley was educated at home. '0 The household in\nwhich she grew up comprised five children with no two parents in common:\nin addition to herself and Fanny Imlay, it included Jane Clairmont (later\nknown as Claire) and her half-brother Charles, the two children of\nThe legacies of Godwin and WolislOnecraft\nGodwin's second wife, Mary Jane Clairmom; William Godwin, Jr. was\nborn in r803, fifteen months after his parems' marriage. Apparently do-\nmesric complications did nor inhibir the family's vibrant intelleerual life.\nFrom his backgmund in eighreenth-cenrury Proresranr Dissent, Godwin de-\nrived a lasring belief in education as rhe key ro social change, and soughr ro\npur his enlighrened pedagogical rheories inro pracrice in raising his children.\nMary Shelley's early reading included her farher's works of reformisr hisrory,\nclassical lirerarure, and English grammar, wrirren for the children's book-\nshop esrablished by the Godwins in 1805.\" In these works, he developed a\nmode of wriring designed ro encourage children to rhink for themselves, and\nsought ro culrivate the reader's imaginarion as a means of fosrering moral\nautonomy. In addition, Mary Shelley read exrensively in Godwin's library,\nwhich included his own books and her mother's, along with a wealth of\nliterarure, history, science, and philosophy in both French and English En-\nlightenmem rraditions. Godwin also rook the children on regular ourings ro\npublic lectures, plays, and art galleries, and encouraged them to meet the\nmany distinguished writers, artisrs, scientists, and medical men - such as\nAmhony Carlisle, Coleridge, Humphry Davy, Fuseli, Hazlin, Charles and\nMary Lamb, and Wordsworth - who visited him at home. The Godwin\nhousehold thus provided Mary Shelley with an unusually wide-ranging ed-\nucation, in which differem forms of knowledge, scientific as well as literary,\nwere equally available as imellecrual and lirerary resources.\nWhen in July 1814 Mar)' Shelley, then aged sixreen, eloped ro the Conri-\nnent wirh anorher of her father's visirors, Percy Bysshe Shelley, and accompa-\nnied by Claire Clairmom, her Godwinian education continued ro nourish.\nAs she recalled in OctOber 1838: \"To be something great and good was\nthe precept given me by my father: Shelley reiterated ir\" (j tl 554). Percy\nBysshe Shelley's successive readings of Political Jllstice laid the foundations\nfor his own political philosophy. Three areas of Godwin's early teachings\nbecame central aspects of the younger man's thoughr: Godwin's insistence\non the connecrion between polirics and morality; his belief in the individual's\npotential for rational improvemem; and his arracks on monarchy, arisroc-\nracy, and all rhe forms of internalized values for which Percy Bysshe Shelley\nadopred the term \"CustOm.\"\" Percy Bysshe Shelley also sought ro fashion\nhis life in rerms of Godwin's early theories. When in January J 81Z he wrote\nto introduce himself ro Godwin as his imelleerual heir, he conceprualized his\nupbringing in rerms of his mentor's analysis of rhe corrupting effects of aris-\ntocracy, ro which, he declared, \"your inesrimable book on 'Political Justice'\"\nprovided an antidote. 'J Moreover, Percy Bysshe Shelley's elopement with\nMary Shelley, despite his marriage ro Harriet Westbrook, was planned in\nthe lighr of Godwio's early arguments against marriage as \"the most odious\nPAMELA ClEMIT\nof all monopolies\" '. - though in practice it led ro a two-year estrangement\nfrom Godwin. Over the next few years, up ro and including the writing\nof Frankenstein, Mary Shelley and her lover embarked on a shared, inten-\nsive course of reading, which induded all of Godwin's and Wollstonecraft's\nworks, documenting their progress in a collaborative journal designed to\nemulate the intellecrual reciprocity of Mary Shelley's parents.\nWhile Mary Shellcy and Percy Bysshe Shelley turned ro her parents' works\npartly in order ro legitimate their own experiment in revolutionary domestic-\nity, they also sought ro emulate her parents' roles as social and cultural critics.\nJust as Godwin and Wollstonecraft felt the events of the French Revolution\non their pulses, so roo the Shelleys bore witness ro the impact of the \"great\nand extraordinary events\" (History of a Six Weeks' Tour, SW VIII 21)\nof Napoleon's meteoric career, culminating in his defeat and the restoration\nof despotical governments in Europe. In August 1814, they traveled through\nFrench countryside ravaged just months earlier by Cossack troops, the\nfinal resulr of Napoleon's unsuccessful Russian campaign. In June J 8J6,\ntheir second continental tour rook them ro Geneva, the birthplace of Jean-\nJacques Rousseau, which prompted Mary Shelley to reflect on the whole\ncourse of ~itha[ revolution, which his writings mainly contributed to mature,\nand which, notwithstanding the temporary bloodshed and injustice with\nwhich it was polluted, has produced enduring benefits ro mankind, which\nall the chicanery of statesmen, nor even the great conspiracy of kings, can\nentirely render vain\" (History of a Six Weeks' Tour, NSW VIII 46). Later\nthat year, the Shelleys' attention shifted to the disturbing events at home,\nnotably the savage government response to the last phase of Luddite upris-\nings (J 8] r-J 6), in which workers in the manufacturing industries united to\ndestroy the machines which threatened their livelihood, and ro the Spa Fields\nriot of December 1816. 'S\nIn their reading, the Shelleys sought an intelligible explanation of how\nthe progressive ideals of the French Revolution had collapsed in despotism,\nboth at home and abroad. ,6 Alongside Godwin's philosophical theory of\nrevolution in Po\/itiCiJI justice and Wollsronecraft's eye-witness account, An\nHistoriCiJI and Moral View of.. . the French RevolutiOll (J794), they studied\ncounter-revolutionary theories of intellectual conspiracy, such as the Abbe\nBarruel's Memoirs, Illustrating the History of jacobinism (I797-98). They\ngave special anention to autobiographical and biographical writings, which\nhighlighted the inseparability of personal and historical experience. As well\nas reading Godwin's philosophical biographies, Life of Chaucer (1803) and\nLives of Edward and john Philips, Nephews and Pupils of Milton (1815),\nthey studied biographical sketches of revolutionary leaders, such as the loyal-\nist John Adolphus's BiographiCiJI Memoirs of the French Revolution (1799),\n30\nThe legacies of Godwin and Wollsronecraft\nand the self-justifying memoirs of persecuted Girondins (the moderate fac-\ntion in the French Legislative Assembly), such as Jean-Baptiste Louvet de\nCouvray's Narrative ofthe DQ\/lgers to which Jhave bem Exposed . .. (179S).\nAfter reading Wollsronecraft's aurobiographical work of revolutionary in-\nstrucrion, Letters Written . .. in Sweden, orway, and Denmark (1796),\nrhey rumed to the twO works thar had provided a model for her poliricized\nlanguage of sensibility, Rousseau's Confessions (178z-89) and Reveries of\nthe Solitary Walker (1 78z). Finally, and mosr important, rhe pair read widely\nin Godwin's novels, which employed a Rousseauvian confessional form to\nexplore the contradictory relarions berween rhe self and sociery. in addition\nro Wollstonecraft's unfinished Godwinian rale, The Wrongs of Woman; or,\nMaria (I798), they read and reread Godwin's four mature novels, Caleb\nWilliams, St. Leon, Fleetwood; or, The New Man of Feeling (1 80S), and\nMandeville, in which he continuously modified and reformulated his po-\nlirical principles in response to rhe histotical and cultural changes of the\npost-revolutionary era. 17\nFrankenstein's central, flawed aspiration to create \"a new species,\" which\n\"would bless lhim] as irs creator and source\" (F I iii 3Z), has often been\nread as a specific critique of Godwin's uropian idealism, as ser Out in the fusr\nedirion of Political justice. ,8 Such readings take their cue from Godwin's\nrentarive speculations concerning a furure srare of rational beings, which are\nbased on Benjamin Franklin's \"sublime conjecture ... rhar 'mind will one\nday become omniporent over matter'\" (Pj 460). Godwin wrires:\nThe men . . _will cease to propagatc, for they will no longer have any motive,\neither of error or duty. to induce them. In addition to this they will perhaps be\nimmortal. The whole will be a people of men, and not of children ... There\nwill be no war, no crime. no administration of justicc as it is called, and no\ngovernment. (PJ 46S)\nSuch projections concerning the regeneration of the individual and of sociery\nwere by no means unique to Godwin, bur were also present in the writings\nand speeches of French revolutionary ideologues. For example, Saint-Just\nand Robespierre each described the making of himself into a new man, de-\nvored to the Rousseauvian principle of \"public virtue\"; each announced plans\nfor the creation of a \"new race\" of socially autonomous citizens, educated by\nthe srare, whose attachment to family life would be broken. '9 Addirionally,\nby the time that Mary Shelley began wriring Frankenstein in 1816, Godwin\nhad reformulared his early account of moral action ro incorporare the privare\naffections, and had dramatized the socially and psychologically destructive\neffecrs of revolutionary aspirations in St. Leon.'O Frankenstein, as a critical\n3'\nPAMELA CLEMIT\nreassessment of the politics of the French revolutionary era which provides\n\"a retrospect on the whole process ... through Waterloo,\"\" has more in\ncommon with Godwin's and Wollstonecraft's fictions of hisrorical and cul-\ntural reappraisal than has been allowed.\nAs in the best-known Godwinian novels of the '790S, Caleb \\,(\/i\/\/iams\nand Maria, Frallkellstein achieves a balance between psychological and so-\ncial concerns, and between personal and political allegory.\" The central,\nhighly charged relationship between crearor and creature reenacts the com-\nplex bond of fear and fascination between the arisrocrat Falkland and his\nservant Caleb. [n the earlier novel, Caleb is cast as a \"monster\" for daring\nro challenge Falkland's social authority, but it is Falkland who becomes an\ninhuman tyrant. Mary Shelley builds on Godwin's use of the pursuit morif ro\ndestabilize convenrional moral values: in Frankenstein, the abandoned crea-\nrure returns ro confronr his \"monstrous\" father, and the pair act our a drama\nof enticement and threat that leads to widespread social destruction. [n her\nchoice of a multiple narrative mode, Mary Shelley was also influenced by\nMaria, in which Wollsronecraft presents several first-person narratives telling\nthe same, mutually reinforcing srory of the social oppression of women in\ndifferent classes of society. Mary Shelley similarly presents several versions\nof the same tale, but this time the stories arc told from competing angles,\nhighlighting her dissolution of moral and cultural certainties.\nYet Mary Shelley's skeptical treatment of revolutionary idealism is partly\nanticipated by Godwin's cosmopolitan hisrorical novel, St. Leoll, in which\nhe paid tribute ro Wollsronecraft's influence on his thought. In St. Leon as\nin Frankensteill, overweening public ambitions, symbolized by secret occult\npractices, lead ro the breakdown of family life. The conversations between\nthe French arisrocrat St. Leon and his endlessly sympathetic wife Marguerite\n(an idealized pomai! of Wollstonecraft) reflect the opposition of public\nand private values found in Letters (rom Norway, in which WollsronecIaft\nexplores the destructive impact of \"the chase after wealth\" on domestic\nrelationships.~}The plot of St. Leoll is structured as a series of bondings and\nseparations. Each experience of shared domestic tranquillity is disrupted by\nSr. Leon's obsessive striving for wealth, honor, and fame, which leads only\nro an unbearable social isolation: \"I possessed the gift of immortal life,\" re-\ncalls St. Leon, \"but 1 looked on myself as a monster that did nor deserve to\nexist.\"L< Yet St. Leon, like all of Godwin's protagonists, is an unreliable in-\nterpretet of his own hisrory, and the novel's final message is equivocal: while\nSt. Leon warns against the negleCt of domestic ties in pursuit of the ideal,\nhe is still fascinated by the prospeCt of wealth and social power. Similarly,\nFrankenstein is ultimately unwilling to abandon his misguided revolutionary\nambitions, despite their human cost.\n32\nThe legacies of Godwin a.nd Wollstonecrafr\nThe subtitle of Frankenstein, \"The Modem Prometheus,\" funher suggests\nthat Mary Shelley's study of revolutionary aspirations is specifically con-\ncerned with the question of Rousseau's influence. Rousseau, with his dual\nreputation as one of the intellectual fathers of French republicanism and as,\nin Wollstonecraft's phrase, \"'the true Promedleus of sentiment,\" was a cen-\ntral, ambivalent presence in her parents' post-revolurionary wrirings.\" This\nambivalence is especially evident in Fleetwood, where Godwin contrasts the\nphilanthropisr Macneil, who presides over a patriarchal idyll modeled on\nRousseau's novel, The ew Eloise (r76r), with the misanthropic \"new man\nof feeling\" of his subtitle, Fleerwood, who resembles Rousseau's aurobio-\ngrapbical persona in the Confessions. Macneil, a former friend of Rousseau,\nvolunteers an analysis of his character, in which he admits that Rousseau,\ntoward the end of his life, was deluded and \"lived ... in a world of his own.\"\nYet, Macneil declares, \"he bad such resources in his own mind ... his vein of\nenthusiasm was so sublime ... It was difficult for me to persuade myself that\nthe person I saw ar such rimes, was the same as ar others was beset with such\nhorrible visions.\"'· This ambivalent anirude ro Rousseau was sbared nor\nonly by Mary Shelley but also by other writers of her generation. '7 Byron,\nfor example, provided a highly equivocal ponrait of Rousseau in Childe\nHarold's Pilgrimage (hereafter CHP), Canto the Third, transcribed in part\nby Mary Shelley at the Villa Diodati in r 816. Like Napoleon, another rev-\nolutionary overreacher undone by a Promethean \"fire I And motion of the\nsoul\" (CHP III, lines 371-72.), Rousseau is both praised for his passionate\nsensibility and blamed for his inability ro control the forces it unleashed:\n\"as a rree I On fire by lightning; wirh ethereal flame I Kindled he was, and\nblasted\" (CHP Ill, lines 734-36). Such images of simultaneous creativity and\ndestruction underscore Mary Shelley'S rewriting of the Prometheus legend as\na critique of Rousseauvian \"enthusiasm,\" in which the use of competing firs't-\nperson narratives assigns the task of evaluation to the reader in Godwin's\nmanner.\nTo begin with, Mary Shelley's use of symbolic European locations high-\nlights the associations between Frankenstein and the aurobiographical\nRousseau. The novel's action centers on the republic of Geneva, where\nRousseau was born and where the Frankenstein family is established as a\npillar of bourgeois society, celebrated for its devotion ro public affairs, in the\nera of the French Revolurion. ,8 However, it is at the University of Ingolsradt,\nfamed as the birthplace of the D1uminati,'. a secret society pledged ro spread\negalitarian principles and infidelity (or atbeism), that Frankenstein begins\nhis revolutionary education. Here Frankenstein's affinity witb Rousseau is\nunderlined by his \"primitivisr\" reluctance ro abandon the ancient alchemi-\ncal dream of \"immortality and power\" (F Iii 2.7) in favor of \"progressive\"\n33\nPAMELA CLEl\\IIT\nscience.30 It is only after hearing M. Waldman echo this ancient ideal, in\nhis lecture on the \"new and almost unlimited powers\" (F Iii 28) of modern\nchemists to control and shape nature, that Frankenstein is persuaded of the\nvalidity of modern scientific endeavors. Under M. Waldman's tutelage, he is\ninspired with \"an almost supernatural enthusiasm\" (F I iii 30) for scientific\nenquiry, culminating in his project of solitary creation.\nMoreover, Frankenstein's rejection of his creature makes him guilty of\na crime that made Rousseau notorious: parental abandonment. Just as\nRousseau in the Confessions and Reveries repeatedly defended leaving his\nfive children by Therese Levasseur at a Paris orphanage,\" so toO Franken-\nstein seeks to justify his negligence by depicting the creature as a malignant\n\"devil,\" \"monster,\" and \"fiend\" (F II ii 67). Instead of acknowledging the\ncrearure's independent rights and needs, Frankenstein depicts him as a pro-\njecrion of his o\\'Vn worst qualities, adapting images of monstrosity drawn\nfrom anti-Jacobin propaganda: \"I considered rhe being whom I had cast\namong mankind ... nearly in the light of my own vampire, my own spirit\nlet loose from the grave, and forced to destroy all that was dear to me\" (F I\nvi 49). Frankenstein's final retreat into an imaginary world of dead friends-\n\"How did I cling to rheir dear forms ... and persuade myself that they still\nlived!\" (F III vii) 42) - further recalls the moral solipsism of Rousseau, who,\ndissatisfied with social reality, took refuge in \"an ideal world ... peopled\nwith beings after my own heart.\"\" Such parallels with Rousseau's life story\nestablish Frankenstein as another disappointed egotist in the manner of\nSt. Leon and Fleerwood, whose self-justifying confessional narrarive col-\nlapses into unwitting self-condemnation.\nMary Shelley's most powerful critique of Frankenstein occurs when she\nallows the creature to tell his own story. In contrast to Frankenstein's melo-\ndramatic outbursts, the creature's measured eloquence reflects a Rousseau-\nvian sensibility, rempered by Godwinian logic. Like Caleb Williams in his\nfinal courtroom meeting with FalkJand, the creature seeks an alternative to\n'·human laws, bloody as they may be\" by appealing directly to Franken-\nstein's sympathies: \"Ler your compassion be moved, and do not disdain me.\nListen to my tale: when you have heard that, abandon or commiserate me, as\nyou shall judge thar I deserve. But hear me\" (F II ii 66-67). Yet the creature\nis repeatedly frustrated in his efforts to find an unprejudiced listener within\nthe novel. Though the blind De Lacey's response to rhe creatute's story is rhe\nopposite to that of Frankenstein - \"there is something in your words,\" he\nsays, \"which persuades me that you are sincere\" (F II vii 91) - the younger\nDe Laceys are unable to acknowledge a being so different from themselves.\nThe role of the true arbiter of political justice is reserved for the reader of\nthe novel.\n34\nThe legacies of Godwin and \\'(lollsronecraft\nThe creature's life history is both the tale of a beleaguered individual sur-\nviving against the odds and an allegorical account of the progress of the\nhuman race. It is broadly structured as a narrative of natural goodness\ncorrupted by civil societ), in the manner of Rousseau's Discourse . .. on\nInequality among Men (J 755). Yet the creature speedily outgrows Rousseau's\nnorion of happiness that arises from the satisfaction of physical passions,\nand his developing moral and intellectual awareness reflects Godwin's and\nWollstonecraft's shared emphasis on the formative power of education and\ncircumstances. Moreover, unlike the essentiaUy solitary man in Rousseau's\nstate of nature, Frankenstein's creature instinctively seeks societ),. Tbus he\nlearns to read by listening to the cross-cultural exchanges between Felix De\nLacey and Sane., themselves fugitives from injustice in revolutionary Paris.\nAs he secretly shares in the De Laceys' patriarchal idyll, his lack of biologi-\ncal origins is offset by a comprehensive cultural education. His program of\nvicarious instruction begins with Volney's The Ruins; or, A Survey of the\nRevoilltions of Empires (J 791-92), a powerful Enlightenment critique of\nancient and modern governments as tyrannical and supported by religious\nfraud. This work gives him insight into the mixed nature of humankind and\ninto systematized social inequality: \"'Was man, indeed, at once so powerful,\nso virtuous, and magnificent, yet so vicious and base? ... I heard of the di-\nvision of properry, of immense wealth and squalid poverty; of rank, descent,\nand noble blood\" (F II v 80). The books that he finds by chance, Plutarch's\nParallel Lives, Milton's Paradise Lost, and Goethe·s The Sorrows of YOl\/llg\nWerther (1774), complement Volney's historical overview by focusing on\nissues of individual morality at different stages of Western civilization.\nSuch progressive reading-matter nOt only transforms the creature's sense\nof himself, but also equips him to launch a vigorous critique of Frankenstein's\nactions in borh public and private spheres. While the creature's Godwinian\nreading of Paradise Lost as \"a true history. _. of an omniporent God warring\nwith his creatures\" leads him to curse Frankenstein as a tyrannical God, he\nalso reproaches his creator for denying him full humanity: \"I was benevolent\nand good; misery made me a fiend. Make me happy, and 1 shall again be\nvirtuous\" (F II vii 87, ii 66).'3 \\l:\/hen Frankenstein reneges on his promise to\nCreate a female companion, his offspring's campaign of vengeful murders acts\nout Frankenstein's own withholding of love and drives home the arbitrary\nnature of the jusrice meted out to himself. As Percy Bysshe Shelley wrote in a\nreview of Frankenstei\", intended for the Examiner: \"Treat a person ill, and\nhe will become wicked ... divide him, a social being, from sociery, and you\nimpose upon him the irresistible obligations -malevolence and selfishness.\"H\nYet the creature's history is more ambiguous than this reading allows. In\nhis final, grief-stricken speech over his creator's corpse, he exclaims, \"Oh\n35\nPAMELA ClEMIT\nFrankenstein! generous and self-devoted being!\" (F III vii '53), and blames\nhimself for the failure of his crearor's revolutionary experiment.\nThis ambiguity toward Frankenstein and his project is reinforced by the\nanitude of Robert Walton, whose narrative of a failed voyage of discovery,\naddressed ro his sister Margaret Saville, frames that of Frankenstein and of\nhis creatute. At first glance, Walron's life history provides a corrective ro\nFrankenstein's tale of overreaching ambition. Though Walton, like Franken-\nstein, dreams of \"the inestimable benefit which I shall confer on mankind ro\nthe last generation,\" his framing narrative seems to relegate Frankenstein's\nstory to a cautionary rale: \"Learn from me, if nor by my precepts, at least\nby my example\" (F I, Lener I 8, iii 31). Similarly, Walron's longing for so-\nciety appears to provide a critical gloss on Frankenstein's srory of solitary\negotism: whereas Frankenstein laments what he perceives as his irrevocable\ndestiny, Walton recognizes the insufficiency of the individual and laments\nthe absence of a friend.\nYet Walron's narrative is full of conttadictions. He longs for a compan-\nion, yet he has put himself in the situation where he seems least likely to\nfind one. When he meets Frankenstein, he quickly begins to \"love him as a\nbrother,\" idolizing him as a figure of persecuted benevolence who resembles\nthe autobiographical Rousseau: \"I never saw a more interesting creature:\nhis eyes have generally an expression of wildness, and even madness; but\nthere are moments when, if anyone performs an act of kindness towards\nhim . .. his whole countenance is lighted up, as it were, with a beam of\nbenevolence and sweerness that I never saw equalled\" (F I, Lener IV 14).\nTheir final exchange is deeply ambivalent. Though Walton forgoes his hopes\nof \"utility and glory\" in compliance with the will of the sailors, who seek\nto return (0 society, this decision is presented in negative terms: '''Thus are\nmy hopes blasted by cowardice and indecision; I come back ignorant and\ndisappointed\" (F II. vii 150). Frankenstein, though chastened, is even more\nunwilling ro relinquish his ambitions. While he admits that his project was\nimpelled by \"a fit of enthusiastic madness,\" he exonerates himself of blame\nfor his treatment of the creature, and his last words ro Walron leave open\nthe possibiliry of the future success of similar quests for knowledge: \"Seek\nhappiness in rranquillity, and avoid ambition, even if it be only the appar-\nently innocent one of distinguishing yourself in science and discoveries. Yet\nwhy do f sal' this? I have myself been blasted in these hopes, yet another may\nsucceed\" (F III vii 151, T52).\nThe effect of these mixed messages from all three principal narrarors -\ncreator, creature, and explorer - is to present the reader with a moral\nchoice: as in earlier Godwinian novels, do we collude with the flawed pro-\ntagonist's version of events, or learn from his tale? Mary Shelley's ani tude\nThe legacies of Godwin and WoUstonecraft\ntoward revolutionary \"enthusiasm\" is anything but straightforward. While\nshe presents a critical study of Frankenstein's self-centered ambition, dra.ma-\ntizing the disastrous consequences of his neglect of the domestic affections,\nshe also emphasizes the social origins of the creature's \"monstrous\" deeds.\nSuch ambivalence is compounded by the use of a Rousseauvian confessional\nnarrative, with its inbuilt drive toward self-jusri.fication. Just as Frankenstein\nends his story by claiming that his ideal was not unworthy, even if historical\ncircumstances were unpropitious, so too the creature, in his last speech to\nWalton, asserts his fundamentally benevolent nature, thwarted by an unjust\nsociety: \"Once I falsely hoped to meet with beings, who, pardoning my out-\nward form, would love me for the excellent qualities which I was capable\nof bringing forth\" (F III vii ]54). Significantly, this notional image of sym-\npathetic communjry is momentarily enacted through Walton's will.ingness to\n\"pardon\" the creature's \"oum'ard form\" and listen to his tale. But, as in\nCaleb Williams, this ideal social transformation is unaffordable within the\nconstra.ints of \"things as they are,\" and the creature's extravagant plans for\nself-immolation complete the novel's breakdown of meaning. Even so, Mary\nShelley posits an alternative to Frankenstein's misguided attempt to force\nthe pace of historical change, outside the novel, by encouraging a gradual\ntransformation in moral consciousness through the experience of reading.\nIn Matilda, Mary Shelley abandons the multiple narrative mode of Frallkell-\nstein in favor of a confessional account of the motherless heroine's troubled\nrelations with her father and her would-be lover, Woodville, a Shelleyan\npoet-figure. The autobiographical format of Matilda (Mary Shelley spelled\nthe novel's title Matilda and the heroine's name, \"Mathilda\"), together witb\nits emotionally intense language, has traditionally led critics to read the\nwork as an uncontrolled expression of Mary Shelley'S psychological anx-\nieries following the deaths in September 18,8 and June ]819 of her twO\nyoung children.\" Yet to read Matilda merely as an expression of psychic cri-\nsis is to overlook her self-consciousness as a literary artist. The exploitation\nof autobiographical material and the use of a self-dramatizing, histrionic\nnarrator are established generic features of the Godwinian novel: Maria,\nSt. Leon, and Frankenstein, for example, all contain extreme, displaced ren-\nderings of the author's personal experience. In Matilda, as in earlier works\nin the Godwin \"schoo~\" authorial experience is redeployed in the service of\na larger ethical and political design.;6\nIndeed, the manuscripts of Matilda reveal that Mary Shelley deliberately\nchose the form of an autobiographical memoir after rejecting other narra-\ntive modes. The rough draft, entitled The Fields of Falley, shows that Mary\nShelley originally conceived of the noveHa as a cautionary tale of the errors\n37\nPAMEl.A ClEMIT\nof unchecked passion. In chapter one, she sets up an intricate narrative frame\nbased on Plaronic and Danrean allegories of the soul's journey through suf-\nfering ro union with the divine.J7 An unnamed narrator, mourning the loss\nof her loved ones, is conducted by Fanrasia, a mythical figure, to the Elysian\nFields, where the narraror overhears Mathilda, now immortal, telling her talc\nof earthlv sufferings ro the prophetess DiOtima, the instrucror of Socrates in\nPlaro's Symposium. Diotima responds to Mathilda's srory in overtly didactic\nterms: ··It is by the acqiuremenr Isicl of wisdom and the loss of the selfish-\nness that is now attatched ro the sole feeling that possesses you that you will\nat last mingle in that universal world of which we all now make a divided\npart\" (NSW II 407). Vet at the end of her narrative, Mathilda substitutes for\nDiotima's goal of collective wisdom a wish fot individual reunion with her\nfather. This discrepancy between the instructive tenor of the frame and the\nwish-fulfillmenr of the inset narrative reveals the unreliability of Mathilda's\naccounr and establishes her srory as a warning of the dangers of excessive\nfeeling. Mary Shelley's abandonmenr of the frame narrative indicates her\nrejection of overtly didactic fiction in favor of the indirect educative purpose\nof the Godwinian confessional mode.\nIn Matilda, the srory i rold by the heroine on her deathbed and addressed\nro Woodville. Like Other self-justifying Godwinian protagonists, Mathilda\npresenrs herself as the victim of \"a hideous necessity,\" presided over by \"ma-\nlignant fate\" (NS\\V II 6, 49). JUSt as Godwin's use of the flawed narraror\ninvites the reader to play an acrive interpretative rolc, so too the ambiguities\nand contradictions of Mathilda's narrative assign ro the reader the task of\nevaluating her guilt or innocence. Again, Mary Shelley follows Godwinian\nprecedents in structuring Matilda as a psychologically intense narrative of\ntemptation and fall. In fact Mathilda's srory involves two scenes of remp-\ntation, which are placed on either side of rhe twO cenrral chapters dealing,\nrespectively, with her prophetic dream of her father's death and with the\npursuit ending in her discovery of his actual death. In the first temptation\nsequence, Mathilda successfully persuades her father ro reveal the secret of\nhis mysterious, brooding behavior, which results in his declaration of his\nincestuou love for her. In the second, she unsuccessfully tempts Woodville\nro join her in a suicide pact by drinking laudanum. Vet the coherence of this\nrwo-part narrative is not merely a matter of structural symmetry: it also re-\nflects the troubled psychology of the flawed protagonist. Mathilda, cheated\nby her father's suicide of the deathly union she might have chosen, tries ro\nachieve a similar outcome with Woodville instead.\nAs in Frallkellsteill, Mary Shelley's debt to her parents' writings is not\nsimply a matter of basic similarities of plot and technique: at the heart of\nthe novella is a reappraisal of specific aspects of Godwin's social theories.\n;8\nThe legacies of Godwin and WollstOnecran\nIn particular, Marl' Shelley reevaluates Godwin's early belief in the unre-\nsttained exercise of ptivate judgment, the basis of the theory of gradual\nsocial improvement set out in Political justice,'S which formed the core of\nPercy Bysshe Shelley's political thought.\nThe first half of Matilda is modeled on the central scenes of Godwin's\nmost celebrated narrarive of revolutionary change, Caleb Williams. Like the\ninscrutable aristocrat Falkland, whose position is based on hypocrisy and\nimposture, Mathilda's father maintains a dignified public reserve but suffers\nsecret paroxysms of frenzy. Like Caleb, conjecturing the source of his mastet's\nagonies, Mathilda is fascinated by \"the diseased yet incomprehensible state\nof Iher fathet's1 mind\" (NSW II 20), and determined to seek out the cause.\nAfter listening to the account of her father's behavior by his servant, she\nwonders, \"Could there be guilt in it'\" (NSW II 24), directly echoing Caleb's\nconjecture about Falkland's suffering: \"Is this ... the fruit of conscious\nguilt ... '''39 JUSt as Caleb is hurried on by a \"fatal impulse,\" Mathilda\ndeclares, \"I hardly know what feelings resislt]lessly impelled me\"; while her\nfather's criticism of her \"frantic curiosity\" resembles Falkland's castigation\nof Caleb's \"foolish inquisitive humour\" (CW llO, NSW II 27, CW 123).\nMoreover, in the scene when Mathilda confronts her father and demands\nthe truth, Marl' Shelley exploits the conventional language of Godwinian\ngradualism. \"ILlet him receive sympathy ... Let him confide his misery\"\n(NSW II 25), Mathilda says to herself before meeting him, invoking the\nvalues extolled in Godwin's notional vision of transformed human relations\nat the end of Caleb Williams. When she first addresses het father, she claims\nto speak \"although with the tender affection of a daughter, yet also with the\nfreedom of a friend and equal\" (NSW II 26), gesturing tOward that erosion\nof parent-child distinctions which Godwin saw as an essential preliminary\nro social change:~o \"' rPJermir me to gain your confidence,\" she continues,\nalluding to \"the fotbearance that man is entitled to claim from man\" which\nGodwin argued should be exetcised toward all men and women as a means\nof fostering moral autOnomy, and which Caleb and Falkland fail to exercise\ntoward each other.\" When her father continues to tesist her entreaties, she\nexclaims, \"'You do nor trear me wirh candour,\" invoking the Dissenting\nprinciple which formed the moral undetpinning of Godwin's notinn of the\nduty of private judgment.'\"\nYet Mathilda's plea for unrestricted ftankness and sincerity leads to dis-\naster, Like those other £Jawed, historically ptemature revolutionaries, Caleb\nand Frankenstein, Mathilda starts out with benevolent intentions but ends\nup unleashing forces beyond her control. Her father's tevelation of his in-\ncestuous feelings, rather than leading to an imagined egalitarian partner-\nship, results in the breakdown of community, and, finally, death. \"A mighty\n39\n\"AMELA CLl~MIT\nrevolution had taken place with regard to me, n she sa)'s: \"the natural work\nof years had been transacted since the morning\" (NSW II 30). In the tever-\nsal that follows, both parties flee from the intimacy the)' formerly sought.\nInitially Mathilda's father assumes the role of a Godwinian social outcast,\nbut afrer his death she toO takes on this identity. In the second half of the\nnovella, she replicates her father's early mysterious behavior, anI)' this time\nthe story of disabling guilt, like Caleb's, is told from the inside.\nIn Matilda, Mary Shelley also sought to question Percy Bysshe Shelley's\npoetic assimilation of Godwin's theories. At first glance. Mathilda's rejec-\ntion of Woodville's consolation seems to repudiate the utopian vision of hu-\nman potential articulared by Percy Bysshe Shelley in Promethells Unbound\n(J820), his grand reworking of the Prometheus myth, begun in J8J8. Cer-\ntainly Woodville, the spokesman for Shelleyan optimism, is ambivalently\nportrayed. On the one hand he is an ideal poet-figure, compared to Plato\nand Christ, but at the same time he is morally naive: ··He seemed incapable\nof conceiving of the full extent of the power that selfishness & vice possesses\nin the world\" (NSW II 48). To some extent Woodville appears as a figure\nof admonishment, since he too, like both Mathilda and her father, has suf-\nfered the premature loss of a loved one - his fiancee Elinor - but, unlike\nMathilda and her father, he is consoled by his Godwinian faith in gradual\nbut irresistible progress. Vet for all his visionary insight into human ordering\nschemes, he is unable to respond sufficiently to Mathilda's human need.\nThe clash between Woodville's idealizing temperament and Mathilda's\nexperience of \"dreary reality\" (NSW II 56) is most evident when she tries\nto persuade him to join her in a suicide pact. In an effort to counteract\nMathilda's despair, Woodville putS forward an argument based on Godwin's\nbelief in the individual's duty to exercise his or her talents in pursuit of the\ngeneral good: \"If you can bestow happiness on another,\" he urges Mathilda,\n\"if you can give one other person only one hour of joy ought you nOttO live to\ndo it?\" (NSW II 60).4J Vet his optimistic theories are undercut by the conte,,\",\nin which they occur. Though his lessons momentarily comfort Mathilda, they\nalso provoke her most extreme expression of social alienation. Adopting the\nvocabulary of Frankenstein's cteature, she describes hetself as \"this outcast\nfrom human feeling; this monster with whom none might mingle in converse\nand love ... a marked creature, a pariah, only fit for death n (NSWII 61).\nWhile this impasse may suggest the limitations of utopian social theo-\nries in the face of individual suffering, it also raises the question of whether\nMathilda is beyond all help. As well as expressing skepticism concerning the\nvisionary idealism of Promethells Ul1bol\/7,d, Mary Shelley challenges Percy\nBysshe Shelley's darker vision of \"sad reality\" (SPP 140) in The Cenci (r8J9).\nThis play, subtitled\" A Tragedy, n represents the story of Beatrice Cenci, a\nThe legacies of Godwin and Wollstonecraft\nbeautiful young Italian atistocrat who was raped by her father, then con-\nspired ro kill him, and was executed for parricide in 1599. Though Mary\nShelley praised the fifth act of this playas \"the finest thing he [Percy Bysshe\nShelley I ever wrote\" (NSW II 286),\" in Matilda she rook issue with his rep-\nresentation of Beatrice's experience. \\X'hile he, in the Preface to The Cenci,\ndescribes Beatrice's story as a moral problem - since she, unlike Prometheus,\nreacts to her wrongs by doing evil- in the play itself, Beatrice is dramatized\nas a victim of domestic and social ryranny, who is \"violently thwarted from\nher nature by the necessity of circumstance and opinion\" (SPP 141).4' In\nMathilda's story, however, the role of Godwinian \"circumstance and opin-\nion\" is by no means clear-cut: instead Mary Shelley focuses on the disabling\nambiguities of the heroine's predicament. Though Mathilda's experience cen-\nters on incesruous feelings rather than on the physical act of incest, it is nev-\nertheless one from which she is unable to recover: \"say not to the lily laid\nprostrate by the srorm arise, and bloom as before. My heart was bleeding\nfrom its death's wound; I could live no otherwise\" (NSW II 45). It i this\nstate of psychological arrest that sets her apart from Woodville, and, she\nfeels, from all humanity, and renders her incapable of responding ro new\nexperiences. Each time Woodville leaves her, \"despair returned; the work of\nconsolation was ever to begin anew\" (NSW \" 55).\nThis disquieting perceprion thar suffering may be, in Wordsworth's phrase,\n\"permanent, obscure, and dark\" (The Borderers [J 797-981, III v 64), con-\nfirms Mary Shelley's fundamenral lirerary affiliarion wirh Godwin, not so\nmuch as the aurhor of rhe '790S, bur as rhe crearor of Mal1deville, which she\nlater praised as superior to all his works in \"forcible developemenr of human\nfeeling\" (NSW \" 250). In MGlldeville, Godwin takes as his subject an un-\nstable, self-dramatizing protagonist traumatized by past experiences of loss\nand betrayal. Pursuing his analysis of the disjunction between the self and\nsociety to a new extreme, he allows that the individt:al could be tbwarted as\nmuch by psychological impulse - in this case, the repressed passion of sibling\nincest - as by unfavorable historical circumstances. Mary Shelley's appro-\npriation of rhis dark vision in Matilda reveals that she continued to extend,\nmodify, and develop her parents' imaginative conceros beyond Franken.stein,\nand prepares for her further transmutations of their multiform, ambivalent\nlegacies in her subsequent novels.\nNOTES\nThis chapter was written during my tenure, mainly for other purposes, of an Arts\nand Humanities Board Research Leave Award, held in conjunction with a term's\nsabbatical granted by the University of Durham. 1 am grateful to both institurions\nfor their material support in this and in other areas of my research. My personal\n4]\nPAMELA CLEMIT\n(hanks ;He due (Q Doucci Devin Fischcr, Michael Rossington, and Lisa Vargo, for\nvaluable commenrs on a draft oi this chapter.\n1 ISir \\Xlaher ScottI, \"Remarks on Frar,kenstein,\" Blackwood's Edinburgh Maga-\nzine 2 (.8.8), 6'4.\n2 Review of Prankenstein, Ediuburgh [Scots} Magaz.\",e, 2nd ser. 2 (March 1818),\n249, :'51·, ;;!,53·\n3 U· \\'(,'. Crokerl, review of Frankenstein, Quarterly RCldew 18 U3n. 1818), 382.\n4 For details, sec Pamela Clcmil and Gina Luria \\Valker, Inrroduction [Q \\Xlilliam\n,odwin, Memoirs of the Author of A V;\"dieatioll of the Rights of \\{loman\n(Peterborough: Broadview Press, 2001), pp. 11-36.\n5 Godwin, MemOIrs, p. 106.\n6 Edward Wl. Said, Represemations of the Imel\/eetual: The '993 Reith Lectures\n(London: Vintage, '9941, p. x.\n7 The best accounr of Godwin's philosophic.al arguments i in Mark Philp,\nGodwlIIs Political jnstice (London: Duckwnrth, '986).\n8 Mary Shelley, \"Life of William Godwin\" 1.836-401, Godwin, ed. Pamela Clcmi\"\nLL IV 74, 86 (London: Pickering & Chano, 2002); but there is no repon of such\na debate in the official minutes of the Privy ouneil (Philp, Godwi,,\"s Political\nJustice, p. IOj).\n9 Sec Peter H. Marshall, \"\"illia\", GodwlIl (New Haven: Yale Universiry Press,\n'984), PI'· 2\"-33·\n10 Sources drawn on include Emily W. Sunstein, Mary\/ Shclll!)': Romance and Real·\nity (Boswn: Linle, Brown, 1989; rpl. Baltimore: Johns Hopkins Universlt)' Press,\n'99' I, pp. 29-6.; and BellY T. Bennell, Mal')' Wollsrollecrafr Shellry': All 1l1tro-\nd\",tiol1 (Baltimore: Johns Hopkins Universiry Press, 1998), pp. 7-16.\n11 For derails, sec Pamela Clemit, \"Philosophical Anarchism in rhe Schoolroom:\n~ illiam Godwin' Juvcnile Librar)'.• 805-25.- Biblioll: The Blllletill ofThe New\nYork 1'lIbile Libra')', 9 . •12 (Fall 2000 I pring 200'),44-7°.\n12 The most useful accounts of Percy B)'s he hcllcy's debts to Godwin remain\nKenneth Neill Cameron, Tbe YOllllg Shellry': Gellem of a Radical (London:\nVicror Gollancz, 195'), pp. 61-70; and P. M. . Dawson, The Unacknowledged\nLegislator: Sbellc')' alld I'olities (Oxford: Oxford Universit), Press, '980), pp. 76-\n'33·\n'3 Shelley 10 GodWin, January 3, 18J 2, PBSL I 227_\n'4 Godwin, An Enqniry cOlrceming Political jllstice I. 793 cdn.l, Political alld I'bi\/o-\nsophieal It\/rirmgs of William GodwlII, gen. cd. Mark Philp, 7 vols. (London:\nPickering & Challo, 1993), \"' 453· (Hereafter I'j.)\n•5 Sec E. P. Thompson. Tbe Makillg of the English Workillg Class (London: Victor\nGollancz, 1963; rev. cdn., Harmondswonh: Penguin, J 980), pp. 62.7-28, 69J-\n700; d. Mar)' Shelie)' to Leigh HUIll, March 2, J8'7, L 129.\n•6 Forrhe Shelle)'s' reading lists 'hrough 18 '4-' 7, ee j • 85-' oJ; nl)' aC(Qulll is also\nindebted '0 Gerald Mc iece, Shellry' alld the Revo\/utiollary Idea (Cambridge,\nMr\\: Harvard Universiry Prcss, 1969), pp. 1<r4 I.\n17 For details, sce Pamela Clemit, The Godwi\"ial1 Nouel: The Rational Fictions of\nGodwill, Broekdell BroWII, Mary Shell<), ( cw York: Oxford University Press,\n'993, rpt. 200'), 1'1'.35-'02.\n18 Eg., Lee Sterrenburg, \"Mary Shelley's Monster: Politics and Psyche in FrQnken-\nstein,\" EF 143-7J.\nThe legacies of Godwin and WolIsronecraft\nJ 9 My accoun[ is indebted to Carol Blum, Rousseau and the Republic of Virtue: The\nLanguage of Politics in the French Revolution (Ithaca, NY: Cornell University\nPress, 1986). pp. 133-52. 182-203.\n20 See Philp, Godwin's PoliticalJustice, pp. ] 42-53.2.02-09; Clemit. The Godwinian\nNovel, pp. 7<>-79, 88--95·\n2.1 Ronald Paulson, Representations of Revolution, '789-r820 (New Haven: Yale\nUniversity Press. 1983). p. 239.\n22 The following accoun[ of Frankenstein expands my argumen[s in The God-\nwinian Novel. pp. J39-74. Other sources drawn on include David Marshall,\nThe Surprising Effects of Sympathy: Marivaux, Diderot, Rousseau, and Mary\nShelley (Chicago: University of Chicago Press, 1988), pp. J 78-\"7; and Gregory\nDart. Rousseau, Robespie\"e and English Romanticism (Cambridge: Cambridge\nUniversity Press, 1999), pp. )-15.43-75·\n23 Mary \\'(Iollstonecraft, Lellers \\Y\/ritte'J during a Short Residence in Sweden,\nNorway, and Denmark, The Works of Mary Wollstonecraft, cds. Janel Todd and\nMarilyn Butler, 7 vols. (London: Pickering & Chana, 1989), VI 342.\n24 Godwin, St. Leon: ATale ofthe Sixteenth Century. Col\/ected Novels and Memoirs\nof \\Villiam Godwin, gen. ed. Mark Philp, 8 vols. (London: Pickering & Chano,\n1992.). IV 294·\n25 Mary \\'(7ollstonecraft. The Wrongs of Woma1l; or. Maria, Works, I 96; sec Gary\nKelly, \"'The Romance of Real Life': Autobiography in Rousseau and William\nGodwin,\" Mart mId NawrelL'Homme et La Nature 1 (1982.),93-101; Dan.\nRousseau. Robespierre, pp. 118-38.\n2.6 Godwin, Fleetwood; or. The New Man of Feeling, Collected Novels, V 159.\n27 See Edward Duffy, Rousseau in England: The Context for Shelley's Critique of\nthe Enlightenment (Berkeley: University of California Press, T979). pp. 71-85.\n28 Iam grateful to Patrick Vincent for making available to me his unpublished paper.\n\"'This Wretched Mockery of Justice': Frankenstein and Geneva,\" deli\\'ered at\nGeneva: An English Enclave, University of Geneva, November 1-2, 2001.\n29 Abbe Augustin Barruel, Memoirs, lJlustTating the History of jacobinism, trans.\nRnben Cliffnrd, 4 vols. (London, '797-8), III 444·\n30 Dart, Rousseau. Robespierre, pp. 1-2.\nJ! Eg. Jean-Jacques Rousseau, The Confessions, trans. J. M. Cohen (Harmonds-\nwonh: Penguin, '953), pp. 333-34; and The Reveries of the Solitary Walker,\ntrans. Peter France (Harmondsworth: Penguin, 1979), pp. 139-40.\n32 Rousseau, Confessions, p. 398.\n33 For Godwin's view of Milton's Satan, see Pj 146; d. Wollstonecraft's emphasis in\nMaria on Jemima's lack of pa.rental, especially maternal, care (\\Vorks, I 108-10).\n34 Percy Bysshc Shelley, \"'On 'Frankenstein; or, the Modern Prometheus'\" 11818},\nThe Prose Works of Percy Bysshe Shelle)\" cd. E. B. Murray (Oxford University\nPress, 1993), I 283.\n35 Eg., U. C. Knocpflmache~ \"Thoughrs on the Aggression of Daughlers,\" EF\nJl3-15; Terence Harpold. \"'Did You Get Mathilda from Papa?': Seduction\nFantasy and the Circulation of Mary Shelley's Mathilda,\" SiR 28 (Spring 1989),\n49-67; for biographical delails, sec Sun\"ein, Mary Shell,,>\" pp. 168-79.\n36 For a fuller statement of the argument developed in the rest of this chapter, sec\nmy \"From The Fields of Fancy to Matilda: Mary Shelley's Changing Conception\nof her Novella,\" Romanticism 3.2 (1997), t52-69, rpt. in MST 64-75.\n43\nPAMELA CLEM IT\n37 Mary Shelley transcribed her husband's translation of Plato's Symposium from\nJuly 2.0 [0 August 6, 1818, and the pair rcad Dame's Purgatorio together in\nFebruary and August 1819 (J I 22.0-2.2, 2-48, 2.94-95).\n38 See Philp, Godwin's Political Justice, pp. 16-23.\n39 Godwin. Things As They Are; or, The Adventures of Caleb Wlilliams, Collected\nNovels, III 101. (Hereafter C\\V.)\n40 Cf. PJ 18_\n4' Godwin, The Enquirer, Political and PhilosophiCLlI Writings, v 134; CWI 2.73.\n42 Philp, Godwin's Political Justice, pp. 24,95-\n43 Cf. PJ 53-\n44 For Mary Shelley's invol\\'cmcnt i.n the composition of The Cenci, see her j 839\n\"Note on The Cenci\" (NSIV II ,8,-83) and Bennett, MaT)' 1V0l\/stollecra!t Shelley,\npp- 47-4 8-\n45 For details, see Michael Rossington, \"Shelley, The Cenci and the French Revolu·\nr-ion, 'l in Revolution in \\'(Iritiflg: British Literary Responses to the French Revolu-\ntion, cd. Kelvin E\\'crest (Buckingham and Bristol: Open Universiry Press, 1991),\npp- '38-57-\n44\n"}