{"doi":"10.1093\/iclq","coreId":"66084","oai":"oai:dro.dur.ac.uk.OAI2:3269","identifiers":["oai:dro.dur.ac.uk.OAI2:3269","10.1093\/iclq"],"title":"Margins of appreciation : cultural relativity and the European Court of Human Rights in the post-Cold War era.","authors":["Sweeney, J. A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-04-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66084.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3269\/1\/3269.pdf","pdfHashValue":"2d3b8147aaa83596b77d5533e427c5d7a115f15a","publisher":"Oxford University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:3269<\/identifier><datestamp>\n      2011-08-25T08:33:49Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Margins of appreciation : cultural relativity and the European Court of Human Rights in the post-Cold War era.<\/dc:title><dc:creator>\n        Sweeney, J. A.<\/dc:creator><dc:subject>\n        Human Rights<\/dc:subject><dc:subject>\n         Margin of appreciation<\/dc:subject><dc:subject>\n         Cultural relativism<\/dc:subject><dc:subject>\n         Eastern Europe.<\/dc:subject><dc:publisher>\n        Oxford University Press<\/dc:publisher><dc:source>\n        International and comparative law quarterly, 2005, Vol.54(2), pp.459-474 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2005-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3269<\/dc:identifier><dc:identifier>\n        issn:0020-5893<\/dc:identifier><dc:identifier>\n        issn: 1471-6895<\/dc:identifier><dc:identifier>\n        doi:10.1093\/iclq\/lei003<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3269\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1093\/iclq\/lei003<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3269\/1\/3269.pdf<\/dc:identifier><dc:rights>\n        This is a pre-copy-editing, author-produced PDF of an article accepted for publication in, International and comparative law quarterly, following peer review. The definitive publisher-authenticated version, Sweeney, J. A. (2005) 'Margins of appreciation : cultural relativity and the European Court of Human Rights in the post-Cold War era.' , International and comparative law quarterly., 54 (2), pp. 459-474, is available online at:\\ud\nhttp:\/\/dx.doi.org\/10.1093\/iclq\/lei003<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":[" 1471-6895","0020-5893","issn:0020-5893","issn: 1471-6895"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":["Human Rights","Margin of appreciation","Cultural relativism","Eastern Europe."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n13 August 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nSweeney, J. A. (2005) ’Margins of appreciation : cultural relativity and the European Court of Human Rights\nin the post-Cold War era.’, International and comparative law quarterly., 54 (2). pp. 459-474.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1093\/iclq\/lei003\nPublisher’s copyright statement:\nThis is a pre-copy-editing, author-produced PDF of an article accepted for publication in, International and\ncomparative law quarterly, following peer review. The definitive publisher-authenticated version, Sweeney, J. A. (2005)\n’Margins of appreciation : cultural relativity and the European Court of Human Rights in the post-Cold War era.’ ,\nInternational and comparative law quarterly., 54 (2), pp. 459-474, is available online at:\nhttp:\/\/dx.doi.org\/10.1093\/iclq\/lei003\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n13 August 2008\nVersion of attached file:\nAccepted\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nSweeney, J. A. (2005) 'Margins of appreciation : cultural relativity and the European\nCourt of Human Rights in the post-Cold War era.', International and comparative law\nquarterly., 54 (2), pp.\u0000459-474.\nFurther information on publisher\u0000s website:\nhttp:\/\/dx.doi.org\/10.1093\/iclq\/lei003\nPublisher\u0000s copyright statement:\nThis is a pre-copy-editing, author-produced PDF of an article accepted for publication\nin, International and comparative law quarterly, following peer review. The definitive\npublisher-authenticated version, Sweeney, J. A. (2005) 'Margins of appreciation : cultural\nrelativity and the European Court of Human Rights in the post-Cold War era.' , International\nand comparative law quarterly., 54 (2), pp. 459-474, is available online at:\u0000\u0000http:\/\/dx.doi.org\/10.1093\/iclq\/lei003\nMARGINS OF APPRECIATION: CULTURAL RELATIVITY AND THE \nEUROPEAN COURT OF HUMAN RIGHTS IN THE POST-COLD WAR ERA \n \nJAMES A SWEENEY* \nLecturer, Newcastle Law School, University of Newcastle upon Tyne \n \nINTRODUCTION1 \n \nThe number of states participating in the Council of Europe’s system for the \nprotection of human rights has grown rapidly over recent years.  Established in 1949 \nwith an initial membership of 10 states, the Council has now grown to a membership \nof 46,2 dwarfing the EU in its geographical reach.  The most significant period of \nenlargement has been since the end of the Cold War as the formerly Communist states \nfrom central and eastern Europe flocked to the Council of Europe seeking assistance \nwith the process of democratisation.  The Council’s most prominent human rights \ntreaty, the European Convention on Human Rights, has entered into force for all but \n                                                 \n1 Elements of this article were delivered as a paper at the McCoubrey Centre for International Law, \nUniversity of Hull, in November 2003.  The research presented is derived from doctoral work \ncompleted at the University of Hull under the supervision of Dr W John Hopkins, Dr Lindsay Moir and \nthe late Prof Hilaire McCoubrey; Sweeney, ‘Margins of appreciation, cultural relativity and the \nEuropean Court of Human Rights’ (PhD thesis on file at the University of Hull).  Thanks also to Prof. \nIan Ward at Newcastle Law School who read and commented upon an earlier draft of this article.    \n2 ‘The Council of Europe’s Member States’ (Council of Europe) \n<http:\/\/www.coe.int\/T\/e\/com\/about_coe\/member_states\/default.asp> (14 October 2004).  The most \nrecent state to join was Monaco on the 5th October 2004. \n  \none of the 46 member states.3  This paper questions whether the European Court of \nHuman Rights’ recognition of a national ‘margin of appreciation’ has allowed these \nnew Contracting Parties too much leeway in the way they choose to protect, or more \nspecifically, to limit, the exercise of human rights.   \n \nIt is shown below that there have been concerns about the margin of appreciation \ndoctrine’s perceived culturally relativist basis.  It had been feared that the expansion \nof the Convention system would exacerbate the existing problems.  In responding to \nthese concerns it is argued that the variations permitted by the use of the margin of \nappreciation concept do not amount to cultural relativism.  Instead, a view of the \ninteraction of national and international human rights protection based upon \ninstitutional subsidiarity and a form of “ethical decentralisation” is proposed, based in \npart upon Michael Walzer’s work on thick and thin moral concepts.4 \n \nThe paper first sets out the parameters of the universality debate, and then goes on to \nintroduce and evaluate some of the recent and controversial judgments of the \nEuropean Court of Human Rights.     \n \nUNIVERSALITY AND RELATIVISM \n \n                                                 \n3 Monaco signed the ECHR and its protocols on the 5th October when it joined the Council, but it has \nyet to ratify them. \n4 M Walzer, Thick and Thin: Moral argument at home and abroad (Notre Dame University of Notre \nDame Press 1994) \n  \nThe universality of human rights is founded on the understanding that if all humans \nare equal, then the rights that they hold as a result of being human are the same \nregardless of the culture into which the individual happens to be born.5  This is the \nfundamental justification for the ideals expressed internationally in the work of \nUnited Nations and also regionally by the Council of Europe.  \n \nCultural relativists have argued that the concept of human rights is a western liberal \nidea and has no (or a different) value outside of the western context.  They contend \nthat universalists fail to understand their own enculturation and the resulting \nunconscious bias of their position.  Any system of social justice grounded in a given \nculture is a defence of the good life as conceptualised by that system, regardless of its \nsubstantive content.  The values promoted by the system are relative only to the \nsociety from which they are derived and are incapable of universality.  It is \nunjustifiable to impose upon one society a system of social justice deriving from \nanother.  The imposed system would be culturally alien and adherence to it could not \nbe guaranteed.6 \n \nEven from within a human rights system the extent to which a relativist position is \nadopted can pose problems for the protection of human rights.  The difficulty is that \nwherever there is a plurality of possible meanings for a given human right, then \n                                                 \n5 For an introduction to this justification for human rights, and to alternative justifications, see J \nShestack, ‘The philosophical foundations of human rights’ in Symonides (ed), Human Rights: \nConcepts and Standards, (Aldershot Ashgate \/ Dartmouth 2000)  \n6 A An-Na’im, ‘Human Rights in the Muslim World’, 3 Harvard Human Rights Journal (1990) 13.  \nThis perspective informs An-Na’im’s efforts to demonstrate that human rights values are in fact not \nalien to Islam. \n  \nwithout the philosophical means to make value judgments about the desirability of \ndifferent meanings or approaches, the relativist is compelled to tolerate any \npermutation of the right in question.7  The relativist is incapable of moral criticism \nbecause each differing morality is equally valid.  Thus in the name of respect for local \nculture, the international observer of human rights abuses is robbed of his or her \ncritical faculties.  However, a careful examination of relativism’s theoretical \nfoundations exposes significant logical problems with its arguments.   \n \nFirstly, as a prescriptive theory, cultural relativism contradicts itself.  As Fernando \nTeson has written, ‘if it is true that no universal moral principles exist, then the \nrelativist engages in self-contradiction by stating the universality of the relativist \nprinciple.’8  Similarly Alison Dundes Renteln argued that relativism9 is susceptible to \nthe charge of self-refutation because, ‘it asserts the absolute prescription that all \nprescriptions are relative.’10  Moreover, in spite of their purposed opposition to \nuniversal values, relativists reserve for themselves at least one universal value – that \nwe should follow, and be defined by, our own culture.  Notwithstanding the \n                                                 \n7 This type of relativism is what Teson has referred to as ‘metaethical relativism’. (F Teson, \n‘International Human Rights and Cultural Relativism’ 25 Virginia Journal of International Law (1985) \n869, 886).  Note however that Alison Renteln has argued that the premise of this type of relativism \n(labelled by her as ‘ethical relativism as descriptive (factual) hypothesis’) does not actually imply \ntolerance. (A Renteln, International Human Rights – Universalism Versus Relativism, (New York Sage \nPublications 1990)   \n8 Teson (n7) 888  \n9 By relativism, Renteln was referring to the particular strand she described as ‘ethical relativism as \nprescriptive (value) hypothesis’. \n10 Renteln (n7) 72 \n  \nconservative tendencies of such a position, it serves to demonstrate that the relativists \nhave not explained the foundation of their argument. \n \nThe second main theoretical problem with relativism can be described as the \n‘tolerance trap’.  If it is conceded that there is no universal meaning to ‘human rights’, \nthe existence in relative harmony of the varying conceptions of ‘human rights’ \nnecessitates their tolerance.  Indeed this is the core argument of the relativists.  Thus \nwe should tolerate and respect the choices made by unfamiliar systems of social \njustice because they promote what is valued by that particular society.  The logical \nproblem here is that relativism seeks to derive an ‘ought’ from an ‘is’ in violation of \nthe Humean dichotomy between normative and descriptive propositions.11  The \nobservation that cultural values vary from society to society, and that therefore what is \nheld worthy of protection also varies, is a description of a factual situation.  The ‘call \nfor tolerance’12 is, on the other hand, a normative judgment about what ought to be.  \nA normative proposition such as ‘we ought to tolerate diverse cultures’ can not be \ninferred from a purely factual statement such as ‘there are diverse cultures’.  It is one \nthing for colonial invaders to recognise that the locals have a different culture to them.  \nIt is quite another to halt the invasion on that basis. \n \nThere are considerable complications to both of these arguments, but for the purposes \nof this paper it is sufficient to recognise that the philosophical pedigree of cultural \n                                                 \n11 E Hatch, Culture and Morality, (New York Columbia University Press 1983) 67 \n12 ibid \n  \nrelativism is at least questionable.13  Of more immediate importance is the way that, \nin spite of its logical weaknesses, the rhetoric of cultural relativism has been high-\njacked by political elites in order to repress their own population.14  In this way \nculture may sometimes be motivated as a state’s untouchable ‘trump card’ reason fo\nfailing to comply (fully) with human rights standards.  Less controversially, relativism\ntends to be equated with a conservative view of public international law that affords \ngreater respect to state sovereignty (which is to some extent challenged by \ninternational human rights law).  This is a view that dominated socialist public \ninternational law and which could be expected to linger in the heritage of new \nContracting Parties to the ECHR from central and eastern Eu\nr \n \nrope.15     \n                                                \n \nIn the European context the importance of recognising tensions between universality \nand relativism has thus become clearer since the end of the Cold War.  The resulting \nexpansion of the Council of Europe is seen as a threat to the standards already put in \nplace by the European Court.  The former communist states have a different historical \nand legal background, and may seek to narrow the scope of the protected rights.  The \nway that the Court leaves a ‘margin of appreciation’ to states has been singled out as \n \n13 J Tilley, ‘Cultural Relativism’ 22 Human Rights Quarterly (2000) 501 contains a more intensive \ncritique of cultural relativism \n14 Donnelly, Universal human rights in theory and practice, (New York Cornell University Press 1989) \n119; Higgins, Problems and Processes in International Law, (Oxford OUP 1994) 96 \n15 The USSR for example historically treated human rights as an aspect of their ‘domestic jurisdiction’ \n(Art. 2(7) Charter of the UN) and vigorously promoted a policy on non-interference.  On the first steps \ntowards Russia’s modification of this attitude see T Schweisfurth, ‘The Acceptance by the Soviet \nUnion of the Compulsory Jurisdiction of the ICJ for Six Human Rights Conventions’ 2 European \nJournal of International Law (1991) 110 \n  \nthe means by which relativism will find its way into the Convention jurisprudence.  In \norder to assess such arguments it is necessary first to introduce the margin of \nappreciation itself. \n \nTHE EUROPEAN MARGIN OF APPRECIATION \n \nThe Court allows states a certain discretion to ‘do things their own way’ from time to \ntime.  This ‘margin of appreciation’ can be distinguished from the general discretion \nleft by the Convention to states in how to implement detailed human rights protection \nin their domestic law.16  The idea of a margin of appreciation is used in the Court’s \nreasoning to measure and police states’ discretion to interfere with or otherwise limit \nhuman rights in specific instances.  In essence it expresses that Contracting Parties \nhave some space in which they can balance for themselves conflicting public goods.  \nThe practice of recognising and respecting states’ margin of appreciation is derived \nfrom the case law of the Court and Commission, not from the text of the Convention \nitself.  Its relevance can be raised by the Court on its own initiative, or by the \nContracting Parties themselves, by way of a ‘defence’ to the allegation that they have \nviolated a Convention right. \n \nThe margin of appreciation doctrine’s implications for universality can be seen as far \nback as the well-known 1976 case of Handyside.17  The European Court was called \nupon to discuss to what extent free expression could be limited in order to protect \nmorals.  The Court stated that, \n                                                 \n16 As required by Art 1 ECHR \n17 Handyside v UK Series A No 24 (1979-80) 1 EHRR 737 \n  \nIt is not possible to find in the domestic law of the various Contracting States a uniform \nEuropean conception of morals.  The view taken by their respective laws of the requirements \nof morals varies from time to time and from place to place which is characterised by a rapid \nand far-reaching evolution of opinions on the subject….  Consequently, Article 10 para. 2 \nleaves to the Contracting States a margin of appreciation.18 [emphasis added]  \n \nThe Court thus appeared to recognise some form of inter-temporal, European, moral \ndiversity.  Such comments have provoked hostile reactions to the continued \nrecognition of a national margin of appreciation.  For example Lord Lester has \nexpressed his deep concern in the following terms: \nThe danger of continuing to use the standardless doctrine of the margin of appreciation is that, \nespecially in the enlarged Council of Europe, it will become the source of a pernicious \n'variable' geometry of human rights, eroding the acquis of existing jurisprudence and giving \nundue deference to local conditions, traditions, and practices.19     \n \nLord Lester’s concerns are not isolated.  Eyal Benvenisti has added that, \nThe juridical output of the [European Court of Human Rights] and other international bodies \ncarries the promise of setting universal standards for the protection and promotion of human \nrights.  These universal aspirations are, to a large extent, compromised by the doctrine of the \nmargin of appreciation….  Margin of appreciation, with its principled recognition of moral \nrelativism is at odds with the concept of the universality of human rights.20 \n \n                                                 \n18 ibid para 48 \n19 A Lester, ‘Universality versus subsidiarity: a reply’ 1 European Human Rights Law Review (1998) \n73, 76  \n20 E Benvenisti, ‘Margin of Appreciation, Consensus and Universal Standards’, 31 New York \nUniversity Journal of International Law (1999) 843, 844  \n  \nThese criticisms are not confined to commentators.  Judge De Meyer, in his partly \ndissenting Opinion in the Convention case of Z v Finland, was particularly critical of \nthe doctrine; \nIn the present judgment the Court once again relies on the national authorities' \"margin of \nappreciation\". I believe that it is high time for the Court to banish that concept from its \nreasoning. It has already delayed too long in abandoning this hackneyed phrase and recanting \nthe relativism it implies.21 \n \nThese concerns have only been amplified by the expansion of the Council of Europe.  \nFor example in 1999 Paul Mahoney asked, \nWill the ECHR standards be diluted, not just to accommodate the problems of the fledgling \ndemocracies [of central and eastern Europe], but generally, across the board for the whole of \nthe ECHR community?  Will the principles painstakingly built up over the years in the \njurisprudence of the Commission and Court be left by the wayside?22 \n \nLikewise Lord Lester’s suspicion of the margin of appreciation concept was \n‘increased by the fact that the Court's territorial jurisdiction is being rapidly widened \nto cover the inhabitants of some forty European countries of diverse political cultural \nbackgrounds and traditions.’23  \n \n                                                 \n21 Z v Finland Reports 1997-I (1998) 25 EHRR 371, Partly dissenting Opinion of Judge De Meyer, Part \nIII.  Judge De Meyer made similar comments in the footnote to his separate concurring opinion in \nAhmed & Others v UK Reports 1998-VI (2000) 29 EHRR 1  \n22 P Mahoney, ‘Speculating on the future of the reformed European Court of Human Rights’, 20 \nHuman Rights Law Journal (1999) 1, 3 \n23 Lester (n19) 74 \n  \nThe assumption seems to be that the margin of appreciation has its roots in cultural \nrelativism.  Moreover now that the Court must deal with the varying cultural and \ndevelopmental situations of the new Contracting Parties, it will be compelled to \ntolerate practices that threaten the universality of human rights.  As has already been \nestablished, a relativistic approach would be theoretically unstable, and may mask \nstate interests. \n \nNow that cases from central and eastern Europe are passing through the Convention \nsystem, the concerns expressed above can be addressed.  The next section gives two \ncontentious examples of cases that have arisen recently.24 \n \nILLUSTRATIVE CASES \n \nIn both cases discussed here, the Court found for the respondent state.  The states’ \nmargin of appreciation allows them some space within which to balance free \nexpression against other important interests where a public figure is publicly \ninsulted.25  These cases are contentious and potentially problematic because they \ncould suggest that the notion of a margin of appreciation has indeed become a \n                                                 \n24 The doctoral research from which this paper has developed examined all the cases concerning the \nnew Contracting Parties from central and eastern Europe.  Finland was excluded from the survey \nbecause its recent history rendered it more comparable with its western and northern European \nneighbours rather than the rest of the former Eastern bloc.  Turkey was excluded because its situation is \nunique and not so directly concerned with the collapse of communism.  See Sweeney (n1)  \n25 J McBride, ‘Judges, politicians and the limits to critical comment’ (1998) 23 Supp (Human Rights) \nELR 76   \n  \nrelativistic vehicle for subordinating human rights to local circumstances.  The later \npart of this paper will contest such a conclusion. \n \nIn the case of Tammer v. Estonia26 the applicant journalist challenged his conviction \nfor insulting a public figure.  In a published interview with another writer Tammer \nhad used allegedly offensive words to criticise Vilja Laanaru.  Laanaru and the former \nEstonian prime minister had an affair, and Laanaru had their child.  She was unable to \nlook after the child herself, and entrusted it to her parents.  Tammer’s comments \nrelated to another journalist’s plans to publish a biography of Laanaru.  Tammer used \nwords which branded Laanaru as an unfit and careless mother who had deserted her \nchildren, and someone who was willing to break up another’s marriage.  The Estonian \nwords have no direct translation into English.27    \n \nThe Government accepted that there had been an interference with Tammer’s freedom \nof expression, but argued that it was justified by reference to Article 10(2) ECHR.28  \nThe Court went on to hold that the interference was ‘prescribed by law’,29 in pursuit \nof ‘the protection of the reputation or rights of others’.30  It was still important to \nshow that the interference was ‘necessary in a democratic society.’   \n \nThe Court described the Government’s position as follows, \n                                                 \n26 Tammer v Estonia (No. 2) Reports of Judgments and Decisions 2001-I (2003) 37 EHRR 43 \n27 ibid, para 22.  The case report contains the following footnote: “The translation of the Estonian \nwords “abielulõhkuja” and “rongaema” is descriptive since no one-word equivalent exists in English.” \n28 ibid, para 33 \n29 ibid, para 38 \n30 ibid, para 40 \n  \nThe Government stressed that the applicant had not been convicted for describing the factual \nsituation or for expressing a critical opinion about Ms Laanaru’s personality or about her \nprivate or family life. His conviction was based on his choice of words in relation to her which \nwere considered to be insulting…. \n \nThe Government noted that the expressions [used] had a very special meaning in the Estonian \nlanguage, and that they had no equivalent in English. When interpreting the words and their \nmeaning their specific nature within the Estonian language and culture should also be taken \ninto account.31 [Emphasis added] \n \nIn Tammer the European Court eventually deferred to the opinion of the domestic \ncourts, which had imposed upon Tammer a fine of ten day’s pay.  The Estonian courts \nhad held that the words in question amounted to value judgements couched in \noffensive language, recourse to which was not necessary in order to express a \nnegative opinion. 32  Tammer’s choice of words had overstepped the permissible \nlimits of criticism, particularly since the comments related to Laanaru’s private rather \nthan public life.  The European Court agreed that Tammer could have formulated his \ncriticism of Laanaru’s actions without resorting to expressions that were so \nparticularly offensive.  As a result of this, the domestic authorities had not failed \nadequately to balance Tammer’s free expression against Laanaru’s reputation.  Taking \ninto account the measures imposed and Estonia’s margin of appreciation, the Court \nunanimously considered that the domestic authorities were, in the circumstances of \n                                                 \n31 ibid, paras 52-53 \n32 ibid, para 67 \n  \nthe case, thus entitled to interfere with the exercise of the applicant’s right to free \nexpression.33 \n \nBefore turning to the implications of this judgment, a second free expression case is \nintroduced.  The applicant in Janowski v Poland34 was also by profession a journalist.  \nHe was convicted of insulting two municipal guards in a public square.  Janowski had \nseen the municipal guards attempting to move some street vendors from the square \nbecause it was not an authorised place for retail.  Janowski interjected on behalf of the \nvendors, arguing that the guards had no authority to move them.  In the course of his \nadvice, Janowski called the municipal guards ‘dumb’ and ‘oafs’.35   \n \nThe applicant argued that his rights under Article 10 ECHR36 had been violated by his \nconviction for insulting the guards.  The Court held that there had been an \ninterference with the applicant’s rights under Article 10,37 that the interference was \nprescribed by law,38 and that the restriction pursued the legitimate aim of preventing \ndisorder.39  In this case, as in Tammer, the real area of debate was on the question of \n                                                 \n33 ibid, para 69 \n34 Janowski v Poland Reports of Judgments and Decisions 1999-I (2000) 29 EHRR 705 \n35 The terms used were ‘głupki’ and ‘ćwoki’ respectively.  \n36 The applicant had also alleged violations of Arts 3, 6 and 7(1), but the European Commission \ndeclared those complaints inadmissible. \n37 Janowski v Poland (n34) paras 22-23 \n38 ibid, para 24 \n39 ibid, paras 25-26.  The government also contended that their aim was to protect the ‘reputation and \nrights of others’, namely the municipal guards.  Having examined the facts of the case and the \nreasoning of the domestic courts, the European Court felt the aim of preventing disorder was the \ndominant aim.   \n  \nwhether the interference was ‘necessary in a democratic society.’  Following the \nCourt’s well-established methodology, in order to be ‘necessary’ the interference \nwould have to answer a ‘pressing social need’, be proportionate to the legitimate aim \ninvoked, and be supported by reasons that were both relevant and sufficient.   \n \nSignificantly Janowski argued that, since he was a journalist, his conviction had been \ntaken by others as a sign that the authorities were re-introducing censorship such as \nhad been common under communism.  He felt that this might mean that future \ncriticism of the state and its apparatus would be discouraged.40  Such an argument \nclearly invited the Court and Commission to take into account the particular \nconditions of the newly democratic Poland.   \n \nThe European Commission in Janowski had acknowledged that civil servants such as \nthe municipal guards acting in their official capacity were, like politicians, subject to \nwider acceptable limits of criticism than private parties.  In the context of the heated \nexchange, the Commission formed the view that those limits had not been \noverstepped by applicant.41  The government responded to this, arguing before the \nCourt that the applicant’s comments had not formed any part of a public debate, but \nwere confined to the particular situation.  In the light of this they argued that the \napplicant’s profession as a journalist was irrelevant.  The Court agreed with the \ngovernment.   \n                                                 \n40 ibid, para 27  \n41 It must be noted that the Commission was split 8\/7 in favour a finding a violation of the Convention.  \nThere was therefore a significant minority of Commissioners that felt the boundaries of the state’s \nmargin had not been overstepped in this case: Janowski v Poland (Application 25716\/94) (1997) \n(ECommHR) \n  \n The Court noted that it did not even have to balance public order against a wider \npublic interest in political criticism because Janowski’s remarks were not made in his \nprofessional capacity.42  It was also important that the applicant had been convicted \non the basis of his use of insulting words, and not simply for making critical remarks.  \nSuch had been confirmed by both national courts,43 and therefore the Court was not \nconvinced the Polish authorities’ actions could be likened to censorship.  Moreover \nthe applicant’s sentence had been reduced on appeal and his prison sentence quashed.  \nFor these reasons the European Court concluded that the national authorities had not \noverstepped their margin of appreciation in assessing the necessity of the contested \nmeasure.  There was no violation of Article 10. 44  \n \nIt is difficult not to have some sympathy with Mr Janowski, who clearly felt his \nintervention on behalf of the street vendors was for the public good.  It should \ntherefore be added at this stage that the Grand Chamber of the Court in Janowski was \nby no means unanimous in its decision to contradict the Commission.  A majority of \n12 to 5 found no violation of Article 10 and the President of the Court, Judge \nWildhaber, was in the minority.  Space precludes detailed analysis of the dissenting \nopinions, although in summary each disagrees that the applicant’s prosecution and \nsubsequent fine were ‘necessary’ within the meaning of Article 10(2).  The core of the \ndissentients’ argument was that the criminal legislation applied to Mr Janowski was \noverbroad in that it protected civil servants from criticism even where they exceeded \n                                                 \n42 Janowski (n34) para 32 \n43 ibid \n44 ibid para 35   \n  \ntheir lawful authority.  Judge Bonello was particularly concerned that in approving the \nPolish authorities’ position,  \n‘the Court […] broadcast a signal that it deems the verbal intemperance of a choleric to be \nmore open to disapproval than the infringement of the rule of law by those who are assigned \nto defend it.’   \n \nThese arguments are quite compelling, and should provoke discussion about the \nECtHR’s attitude to free expression in fledgling democracies where official authority \nhas frequently been used in the past to disguise corruption.  However, for the purposes \nof this article it is interesting to note the dissention did not centre upon the cultural or \ncontextual elements to the case.  The closest to such an argument is contained in the \nshort Dissenting Opinion of Judge Wildhaber, who, in coming to the conclusion that \nthe interference was not necessary in a democratic society, described the words used \nby Mr Janowski as merely “moderately insulting”.  By contrast, the majority had \nrelied upon the findings of the national court that the words used constituted \n“offensive and abusive verbal attacks”.45  Whilst in Janowski the Court had used the \nmargin of appreciation doctrine to take local conditions into account less explicitly \nthan it was asked to in Tammer, the majority must have placed more emphasis on the \nlocal interpretation of the words used than did Judge Wildhaber.  The Court was \ntherefore sensitive in both Tammer and Janowski to a local interpretation of the \ncontested words’ connotations.  The seriousness of the insulting words used in each \ncase underpins, explicitly or implicitly, the Court’s attempts to balance the other \ninterests at stake. \n \n                                                 \n45 ibid para 34 \n  \nASSESSING THE CASES \n \nThese two cases present a potentially significant problem.  It could be argued quite \neasily that allowing divergence in the way states choose to limit human rights \namounts to modulation of the rights’ essential character.  The margin conceded in \nTammer and Janowski may have allowed restrictions on human rights that would not \nbe permitted in other Contracting Parties.  This could suggest that the Court’s use of \nthe doctrine is indeed unduly relativistic, and confirms a worrying new trend in the \nEuropean Court’s jurisprudence.    \n \nHaving identified these cases and the nature of the problem, the rebuttal of these \nconcerns can be made in three steps.  Firstly, an examination of the outcome of cases \ndecided by the European Court in which the recognition of a margin of appreciation \nhas played a role, and which also involve states from central and eastern Europe, \nshows that the Court has been far from deferential to the new Contracting Parties.  \nSecondly, it is necessary to clarify what it really means to state that human rights are \nuniversal.  If even universal human rights contain some local modifications, then the \nECHR’s approach is not necessarily relativistic.  Thirdly, and finally, if it can be \nshown that the nature and basis of the margin of appreciation is not relativistic, then \nits use to accommodate local concerns in a limited number of cases is entirely \ncompatible with universality.  The doctrine’s conceptual roots can be found in a form \nof ethical de-centralisation or subsidiarity46 rather than cultural relativism.   \n \n                                                 \n46 cf G Carozza, ‘Subsidiarity as a structural principle of international human rights law’ 97 AJIL \n(2003) 38   \n  \nThe next parts of the paper address each of these three steps in turn, in the light of the \ncase law already introduced. \n \nCASES CONCERNING THE NEW CONTRACTING PARTIES \n \nThe two illustrative cases should be seen in the overall context of the Court’s recent \njurisprudence.  The Court’s general approach to these states can then be compared \nwith its attitude to the original contacting parties.  \n \nThe first case the Court ever decided on its merits was Lawless in 1961.47  This was \neight years after the Convention came into effect.  It was not until the 1968 case of \nNeumeister48 that the Court actually found against a respondent state, disclosing a \nviolation of Article 5(3).49   It had taken the Court fifteen years to find against a \nrespondent state.  Compared to its present workload and robust judgments, the Court’s \nearly operation was a slow and cautious business.50   \n \nIt is also important to recall that the margin of appreciation doctrine may not have \nplayed the same role at each point in the Convention’s life.  The Court’s recognition \n                                                 \n47 Lawless v Ireland (no. 3) Series A No 3 (1979-80) 1 EHRR 15 \n48 Neumeister v Austria Series A No 8 (1979-80) 1 EHRR 91 \n49 Nevertheless Neumeister was only the third case that the Court had examined on its merits.  The \nsecond, De Becker v Belgium Series A No 4 (1979-80) 1 EHRR 43, was struck off the list because the \nimpugned law was altered by the time that the Court heard the case. \n50 M Janis, R Kay, A Bradley, European human rights law, (Oxford OUP 2000) 25 \n  \nof the margin played a role in consolidating the Convention system in its infancy.51  \nHowever since around 1979 the margin has evolved into a useful framework to \nfacilitate heightened analysis of states’ justification for interference with Convention \nrights.52  The role played by the margin has developed over a period of at least \ntwenty-five years.    \n \nHungary was the first of the central and eastern European countries to join the \nConvention system, in 1990.  It was Bulgaria (which joined the Council of Europe in \n1992) that first had a case against it decided on the merits.  In the 1997 case of \nLukanov v Bulgaria,53 concerning the arrest and detention of a former Prime Minister \nof Bulgaria, the European Court found a violation of Article 5(2).  Thus it was only \nfive years between Bulgaria’s joining the system and it feeling the full force of the \nCourt.  Since then the Court has had a steady stream of cases concerning the new \nContracting Parties, having decided cases concerning Croatia, the Czech Republic, \nEstonia, Georgia, Hungary, Latvia, Lithuania, FYR Macedonia, Moldova, Poland, \nRomania, Russia, Slovakia, Slovenia, and Ukraine.  As of the 21st October 2004, no \njudgments have yet been issued concerning Albania, Armenia, Azerbaijan, Bosnia & \nHerzegovina, or Serbia & Montenegro.   \n \n                                                 \n51 Y Arai-Takahashi, The margin of appreciation doctrine and the principle of proportionality in the \njurisprudence of the ECHR, (Oxford Intersentia 2002) 232 recognises this, but argues that as a \n“transitional” doctrine alone contemporary use of the margin cannot adequately be defended.  \n52 H Yourow, The Margin of Appreciation Doctrine in the Dynamics of European Human Rights \nJurisprudence (The Hague Kluwer 1996) \n53 Lukanov v Bulgaria Reports of Judgments and Decisions 1997-II (1997) 24 EHRR 121  \n  \nIn the overwhelming number of cases emanating from central and eastern Europe \nwhich have been declared admissible a violation of at least one article of the \nConvention has been established.54  The Court first examined the new Contracting \nParties’ margin of appreciation in four cases in 1999, including the Janowski case \namongst them.55  In each of the first three cases the Court found for the respondent \nstate, which could certainly suggest that the Court was willing to take a more \ndeferential approach to the new Contracting Parties, potentially in order to aid their \ntransition to full participation in the Convention system.  Whilst this would achieve \nhistorical parity with its behaviour towards the original Contracting Parties, the \ninternal consistency of the Court’s contemporary jurisprudence would be threatened.   \n \nIn the fourth of the first four cases, Dalban v Romania, the Court found that the \nrespondent state had overstepped its margin.  Indeed since Dalban the Court has \nfound for the respondent state in very few cases where the margin of appreciation \ndoctrine was discussed, including the Janowski and Tammer cases.56  These cases \n                                                 \n54 ‘Survey of activities 2003’ (Council of Europe) \n<http:\/\/www.echr.coe.int\/Eng\/EDocs\/2003SURVEYCOURT.pdf> (15 October 2004), 32 gives a \nsnapshot of the Court’s activities.  This pattern is in line with Court’s approach to the other Contracting \nParties; once a complaint has been declared admissible it is often decided in favour of the applicant.  In \n2003 a violation of at least one Convention article was found in 521 out of the 548 cases that gave rise \nto a finding on the merits. \n55 Janowski v Poland (n34); Rekvényi v Hungary Reports of Judgments and Decisions 1999-III (2000) \n30 EHRR 519; Matter v Slovakia Application 31434\/96 (2001) 31 EHRR 32; Dalban v Romania \nReports of Judgments and Decisions 1999-VI (2001) 31 EHRR 39 \n56 In chronological order: Janowski v Poland, (n34); Rekvényi v Hungary (n55); Matter v Slovakia \n(n55); Constantinescu v Romania Reports of Judgments and Decisions 2000-VIII (2001) 33 EHRR 33; \nTammer v Estonia (No. 2) (n23); Gorzelik v Poland Application no. 44158\/98 (2004) 38 EHRR 4 (NB \n  \namount to less than a third of the cases against the central and eastern European states \ninvolving supervision of their margin of appreciation.  \n \nIn several of the cases where application of the margin of appreciation doctrine to one \nof the rights at issue resulted in a finding for the state, the Court nevertheless found a \nviolation of another substantive Convention right.  For example in Matter v Slovakia \nthe Court held that the state’s interference with Article 8 was justified, but found a \nviolation of Article 6(1).  Likewise in Constantinescu v Romania the Court upheld the \nrespondent state’s interference with Article 10, but found a violation of Article 6(1). 57   \n \nThe Janowski and Tammer cases thus fall into a very small category of cases where, \nhaving applied the concept of a margin of appreciation to one or more aspects of the \ncase, the Court failed to find any violation of the Convention.  The Court’s activity in \ngeneral and use of the margin of appreciation doctrine in particular has thus not \ndisplayed a marked restraint such as would suggests a weakening of the system’s \ninternal consistency.  The Court has been much quicker to act against the central and \neastern European states than it was against the original members of the Council of \nEurope. \n                                                                                                                                            \nThis decision has been reaffirmed by a Grand Chamber, see Gorzelik v Poland Application no \n44158\/98 Judgment of the Court 17.2.2004); Lesnik v Slovakia Application no. 35640\/97; 4 similar \ncases against Ukraine decided on 29.4.2003: Nazarenko Application No. 39483\/98, Dankevich (2004) \n38 EHRR 25, Aliev, Application No. 41220\/98, Khokhlich Application No. 41707\/98; Blecic v Croatia \nApplication No. 59532\/00; Kopecky v Slovakia Application No. 44912\/98  \n57 The four cases brought against Ukraine and decided on 29.4.2003 (n56) also disclosed several \nviolations of the Convention, even though some of the complaints under Article 8 were dismissed using \nmargin of appreciation analysis.   \n  \n In respect of the original states the Court balanced human rights against state \nsovereignty more warily.  Whilst participation in the ECHR system is still new to the \nCouncil’s recently joined members, the idea of submission to an international Court is \nnot as novel as it was for the original Contracting Parties.  The Court’s willingness to \nact against the new Contracting Parties is predicated upon its proven ability to act \nagainst the early participants in the system.  For many years, the only states capable of \nbeing found in violation of the Convention were western European states.  The new \nContracting Parties have witnessed the European Court act decisively against the very \nstates that initiated the system, so they may be less suspicious than the original \nparticipants that the Convention would be used merely as a political tool. \n \nUNIVERSALITY NOT UNIFORMITY \n \nThe cases introduced above are clearly in a minority of the European Court’s recent \ndecisions.  In order to analyse fully the threat to universality that cases such as \nTammer and Janowski pose the nature of universality itself should be questioned.  \nUniversality is not the same as uniformity, 58 and so local variations in the \nConventions standards may fall short of outright relativism.  The 1993 Vienna \nDeclaration and Programme of Action provides a useful summary of the UN’s \nposition, \nAll human rights are universal, indivisible and interdependent and interrelated. The \ninternational community must treat human rights globally in a fair and equal manner, on the \nsame footing, and with the same emphasis. While the significance of national and regional \n                                                 \n58 J S Davidson ‘Human Rights, Universality and Cultural Relativity: In Search of a Middle Way’  6 \nHuman Rights Law and Practice (2001) 97  \n  \nparticularities and various historical, cultural and religious backgrounds must be borne in \nmind, it is the duty of States, regardless of their political, economic and cultural systems, to \npromote and protect all human rights and fundamental freedoms.59 [emphasis added]  \n   \nThere has been discussion of the italicised section of the quotation,60 but it should be \ntaken as meaning that although human rights must be understood within their cultural \ncontext, they should not be subsumed under cultural practices.  It is to be expected, \nnevertheless, that even whilst maintaining ‘universal’ human rights, there may be \nsome defensible local qualification.  Critics of the margin of appreciation doctrine \nwho believe they have identified relativism in its operation may have instead merely \nidentified examples where the European Court has borne in mind the local and \nregional particularities of given states.  This does not amount to a denial of \nuniversality.     \n \nSince the differences acknowledged by the recognition of a national margin of \nappreciation do not necessarily amount to relativism, another explanation for the \nCourt’s position is required.  Michael Walzer’s approach to thick and thin conceptions \nof morality can be adapted to elaborate on the nature of the margin of appreciation \ndoctrine. \n \nTHICK AND THIN \n \n                                                 \n59 Vienna Declaration and Programme of Action, UN DOC. A\/CONF.157\/23 (12.7.1993); (1993) \nHRLJ 352, para 5 \n60 M Freeman, ‘Human rights and real cultures’, 1 Netherlands Quarterly of Human Rights (1998) 25, \n25 \n  \nMichael Walzer61 has argued that moral terms have ‘minimal’ and ‘maximal’ \nmeanings; that ‘thin’ and ‘thick’ accounts of them can be given.62  Thick and thin \nmoralities serve different purposes at different times, working in conjunction rather \nthan contradicting each other.  They exist contemporaneously, and it is the interaction \nbetween them that is seen when the European Court applies the margin of \nappreciation doctrine. \n \nIn order to explain the meaning of this dual account of morality, Walzer described \nhaving seen footage of anti-Communist protesters in Prague in 1989, carrying banners \nbearing slogans such as ‘truth’ and ‘justice’.  When they waved their banners, Walzer \nargued that they were not relativists – it was their hope that everyone, in any place in \nthe world, should associate with and support their cause.  The moral concerns here \nwere expressed ‘thinly’ and were of broad international appeal.63  However, after the \n‘velvet revolution’ 64 in November 1989 the same people, still presumably as clear in \ntheir pursuit of truth and justice, were more immediately concerned with what was \nbest for the ordering of their society in the post-Communist era, in the light of their \nhistory and culture.  In addressing the issues of designing or modifying a healthcare or \neducation system, or whether Czechoslovakia should remain united, they did not \ninsist with the same passion that the rest of the world endorse or reiterate their \n                                                 \n61 Walzer (n4) \n62 This element of Walzer’s work is not unique, though his interpretation of it is.  See eg C Geertz, The \nInterpretation of Cultures (New York Basic Books 1972), chapter 1, ‘Thick Description: Toward an \ninterpretive theory of culture’. \n63 Walzer (n4) 3 \n64 So called because it took place peacefully   \n  \ndecisions.65  These moral considerations were part of a complex thick morality bound \nup with the shared history and experiences of the actual people living in that particular \nsociety. \n \nThe idea of a moral minimalism does not, for Walzer, describe an emotionally \nshallow or substantively minor morality.  He has argued that,   \n[moral minimalism] is morality close to the bone.  There isn’t much that is more important \nthan “truth” and “justice”, minimally understood.  The minimal demands that we make on one \nanother are, when denied, repeated with passionate insistence.  In moral discourse, thinness \nand intensity go together, whereas with thickness comes qualification, compromise, \ncomplexity, and disagreement.66   \n \nWalzer has warned that however intuitively appealing it may be, it is incorrect to \nsuggest that pre-existing thinly constituted universal moral principles have, over time, \nbeen elaborated ‘thickly’ in the light of specific historical circumstances.  This \ndifferentiates Walzer’s views from other moral philosophers who have also used the \nterms ‘thick’ and ‘thin’ in this context.  Morality is instead ‘thick from the beginning, \nculturally integrated, fully resonant and it reveals itself thinly only on special \noccasions, when moral language is turned to specific purposes.’67   \n \nFor example there is in the world some agreement on the importance of living \ntogether in relative harmony, but in times of upheaval (or shortly afterwards) people \nmay be moved to express some of the core elements of these previously un-stated \n                                                 \n65 Walzer (n4) 4 \n66 ibid 6 \n67 ibid 4 \n  \nassumptions.  Applied to the human rights context it can be argued that the adoption \nof the Universal Declaration of Human Rights (UDHR) was the expression of thin \naspects of morality stated in the aftermath of World War II, but which actually existed \nas elements of differing particular thick moralities well before this.68   \n \nThe recognition that human rights can be understood thickly and thinly is significant \nbecause in all but the paradigm cases of flagrant human rights abuse, human rights \nprotection needs more than the examination of compliance with simple imperatives.  \nIt requires also an understanding of the multitude of actors in society, each with their \ndifferent interests and values.  National and international institutions must recognise \nthat therefore, in the first place, the social and political institutions of particular \nsocieties must deal with much of the actual protection of human rights.  This is the \nprescription of a gamut of positive action by all states to protect human rights, \ncoupled with international institutions recognising some realistic limits to their own \ncompetence.   \n     \nThe position advocated here thus recognises a margin within which different thickly \nconstituted efforts at the protection of human rights exist.  Human rights are generally \nuniversal, but in becoming embedded in society some local particularities affect the \nsubstantiation of human rights and result in specific qualifications.  It is the \ninteraction of thick and thin concepts of human rights that recognition of a margin of \n                                                 \n68 Walzer also notes that even an agreed minimal morality will often be forced into the idiom of a \nmaximal morality, (Walzer (n4) 9), which may explain why some cultures find the objective of human \nrights familiar but their expression as ‘rights’ alien.  \n  \nappreciation facilitates rather than the relativist subordination of human rights to local \nculture.69 \n \nTHE MARGIN OF APPRECIATION AND SUBSIDIARITY \n \nIt has so far been argued that the cases such as Janowski and Tammer belong to a very \nsmall group of cases where the European Court has used margin of appreciation \nanalysis and found for the respondent state.  Walzer’s work has been used to suggest \nthat universal human rights are poised to recognise local variations because they are \nin fact a concentrated product of those diffuse cultures rather than a challenge to \nthem.  This section of the paper elaborates upon how the Walzerian paradigm can be \nlinked to the concept of subsidiarity.   \n \nThe deference to action within a state’s margin expresses a form of subsidiarity, \nwhere on certain types of question the Court can devolve to Contracting Parties \nsupervised discretionary powers to balance human rights and national public interests \nwithin confined parameters.  This contains elements of ‘ethical decentralisation’, \ninasmuch as decentralisation carries with it the notion of delegation where the diffuse \nlower authorities remain loyal to the centre.  \n \n                                                 \n69 The extent to which Walzer’s work, his earlier writing in particular, is or is not relativist is moot; M \nWalzer, Spheres of Justice: a defence of pluralism and equality (New York Basic Books 1983).  The \nposition taken in this article is that Thick and Thin adds a universalist dimension to Walzer’s idea of \n‘Spheres of Justice’; cf R Bellamy ‘Justice in the community: Walzer on pluralism, equality and \ndemocracy’ in D Boucher & P Kelly (eds) Social Justice: From Hume to Walzer (Routledge London \n1998)   \n  \nIn the European Convention context the principle of ‘subsidiarity’ is normally \nunderstood in its institutional sense.  The intended effect of the ECHR is to encourage \nstates to bring their domestic law into conformity with the standards of the \nConvention, rather than for the Convention rights to be relied on directly.  Human \nrights ought to be protected by national authorities, rather than by the Strasbourg \ninstitutions.  In this sense the principle of subsidiarity is used to express that the \nConvention mechanisms are subsidiary to the activities of the Contracting Parties \nthemselves.  This observation is supported by the terms of the Convention, and has \nbeen consistently re-affirmed by the Court.70 \n \nThe principle of subsidiarity in this institutional sense clearly results from the division \nof power between national and international institutions.71  In addition to factors such \nas the separation of powers that affect all courts, the international institutional context \nof European Convention law thus adds another dimension.72  This international \nseparation of responsibilities is closely linked to subsidiarity in so far as both concern \n                                                 \n70 Handyside (n17) para 48; Z and Others v UK Reports of Judgment and Decisions 2001-V (2002) 34 \nEHRR 3, para 103; Subsidiarity is more commonly associated with law of the European Union (Art 5 \nEC Treaty; Art 1 Treaty on European Union).  Further discussion of the EU context of subsidiarity is \noutside the scope of the present paper, but is discussed in my paper ‘Universal values in an expanded \nEU: re-assessing the case-law on derogations from the four freedoms’ delivered at the Socio-Legal \nStudies Conference in Glasgow, April 2004 (copy with author). \n71 cf P Mahoney, ‘Marvellous richness of diversity or invidious cultural relativism’ 19(1) Human \nRights Law Journal (1998) 1 who describes the margin itself in these terms \n72 E Brems ‘The Margin of Appreciation Doctrine in the Case-Law of the European Court of Human \nRights’, 56 Zeitschrift fur Auslandisches offenthiches recht und volkerrecht (1996) 240, 293 \n  \nthe allocation of responsibilities, and therefore impact upon the balance between \ninternational human rights supervision and state sovereignty.73   \n \nIt terms of the practical allocation of responsibility the Court has objected to being \nseen as a court of fourth instance, and it will usually respect findings of law and fact \nby national courts.74  However there is another element of subsidiarity that cannot be \nexplained on solely practical grounds.  To understand this, the differing roles of the \nCourt must be acknowledged.    \n \nThe Court’s most obvious or classic role is to guard against flagrant human rights \nabuses, but it is not its only one.  Indeed the maturation of the Convention system has \nseen it evolve complex jurisprudence on almost all aspects of public life. The \nConvention therefore offers protection from human rights abuses at two levels.75  In \nits classic role it protects against ‘naked, bad faith abuse of power’.76  In this sense, \nthe Convention clearly required from the outset a standard of human rights, thinly \nconstituted, in response to the recent horrors of WWII.  However in protecting human \nrights the European Court also (and more frequently) has to deal with restrictions \nimposed in the name of the general interest, and which whilst impacting \ndisproportionately on the individual, were imposed in good faith.  According to \nMahoney,  \n                                                 \n73 Carozza (n46) 63 \n74 Edwards v UK Series A No 247 (1993) 15 EHRR 417, para 34; R Macdonald, F Matscher, & H \nPetzold (eds), The European system for the protection of human rights (Dordrecht Martinus Nijhof \n1993), 50 \n75 Mahoney (n71) 2-3 \n76 ibid, 4 \n  \nIt is only in this second context, once the first degree of protection has been assured, that the \ndoctrine of the margin of appreciation comes into play, that is to say, only if the preliminary \nconditions of normal democratic governance have been shown to exist.77  \n \nThis is quite correct, but should not be taken merely as a test for determining when \nthe margin is allowed to operate.  Instead, Mahoney’s observation encourages \nexamination of the cases’ character.  If the ‘good faith’ curtailment of human rights is \na consequence of balancing between conflicting national public interests within a \ndemocracy, then it can be said to take place within the thick elaboration of human \nrights in particular societies.  These questions are not so much to do with subsidiarity \nand the correct allocation of responsibilities on practical grounds, but concern respect \nfor moral and ethical sovereignty and self determination.       \n \nThe determination of the national public interest requires detailed knowledge of the \ndomestic situation, and so a margin may also be conceded on practical grounds.  \nNevertheless the sorts of questions that must be asked and answered about conflicting \npublic interests usually involve issues relating to rights-in-detail rather than rights in \nthe abstract; the realisation of human rights thickly constituted.  It is in response to \nthese questions within human rights thickly constituted that the margin plays its role \nin the decentralisation of certain moral and ethical questions. \n \nThis is the situation exemplified in the Janowski and Tammer cases, where the \nrespondent states accepted that they had interfered with a human right, and therefore \ndid not seek to dispute the interpretation or relevance of the right at stake.  In both \n                                                 \n77 ibid \n  \ncases it was the relative weight of the right and a countervailing public interest that \nthe national authorities sought to establish for themselves78 when they applied the \nright to the case at hand.  The justification for respecting the respondent state’s \nmargin is not cultural relativism.  In fact it is quite the opposite; it is that the state is \ncoming to its own conclusions within a realistic, diffuse, universal concept of human \nrights. \n \nThe process of decentralising is still however constrained by the Court’s classic role, \nthe protection of human rights thinly constituted.  Even where a wide margin is \ninvoked and discussed, the review function of the European Court is not ousted.79  \nThe principle of proportionality is a valuable tool in determining the outer limits of \nthe margin in particular cases.80  Whilst the Walzerian paradigm explains that the \nmargin of appreciation doctrine may play a role in respecting some choices about \nbalancing national public interests, a gross miscalculation of their relative weight \ncould still amount to a violation of the Convention.   \n \n                                                 \n78 ie by supplying reasons that were both “relevant and sufficient”; See Olsson v Sweden (no.1) Series \nA No 130 (1989) 11 EHRR 259 para 68; Lingens v Austria Series A No 103 (1986) 8 EHRR 103 para \n40 \n79 For example in Open Door and Dublin Well-Woman v Ireland the Court found a violation of Art 10 \nand stated that it ‘cannot agree [with the respondent state] that the State's discretion in the field of the \nprotection of morals is unfettered and unreviewable….’  This is significant because on questions of \nmorals the margin conceded is usually relatively wide;  Open Door and Dublin Well Woman v Ireland \nSeries A No 246-A (1993) 15 EHRR 244, para 68  \n80 Arai-Takahashi (n51) 190-205 \n  \nIn summary the principle of subsidiarity is already recognised as being central to an \nunderstanding of the European Court’s role.  It has also frequently been linked to the \nmargin of appreciation.  Within the idea of subsidiarity there is a narrow range of \ndecisions about the correct level of human rights supervision that are moral or ethical \nrather than practical in nature.  Whilst the concept of a national margin of \nappreciation may play a role in respect of subsidiarity in its practical institutional \nsense, it also has a role to play in respecting choices made within each European \nstate’s thickly constituted morality. \n \nCONCLUSION \n \nReturning to the two cases introduced above, alongside other recent cases it can be \nconcluded firstly that they do not herald a new transitional era of excessive deference \nto the new Contracting Parties from central and Eastern Europe.   \n \nSecondly, since uniformity is not required by universality, the limitations permitted in \nthe Janowski and Tammer cases do not necessarily undermine universality.  Indeed on \ncloser examination the variation which the Court used the margin of appreciation to \nrecognise could not be described as being based upon cultural relativism at all.  The \ncases do not suggest that, for whatever historical or cultural reason, free expression is \nnot a value of relevance in Estonia or Poland.  In neither case did the respondent state \nattempt to argue that the right itself was inapplicable to the situation.   \n \nThirdly it is now clear that the two cases expose questions relating to rights-in-detail; \nthey concern ‘good-faith’ interference with human rights in furtherance of other \n  \n  \ncollective interests.  In these circumstances considerations of institutional subsidiarity \nand ethical decentralisation justify in principle the existence and use of the margin of \nappreciation doctrine.  This, in turn, justifies the Court taking giving weight to the \nlocal meaning of the words at issue in Janowski and Tammer as part of its balancing \nexercise.  The way that the doctrine was used in the Janowski and Tammer cases \nshows a careful examination of the facts of each case, so that the discretion devolved \nto the respondent states in each was checked in order to guarantee loyalty to the \nconcept of human rights thinly constituted.  There was no question of automatic \ndeference.  The margin of appreciation doctrine is a structured, meaningful, but \nultimately conditional recognition of Contracting Parties' complex thickly constituted \nmorality.    \n \nBy examining two illustrative cases in their wider context, this paper has suggested \nthat the European Court’s continued recognition of a margin of appreciation has not \nresulted in a relativistic Court or the lowering of Convention standards.  The \ndoctrine’s use has been presented as a valuable tool for recognising and \naccommodating limited local variations within a nevertheless universal model of \nhuman rights.   \n"}