{"doi":"10.1016\/j.cropro.2009.08.007","coreId":"68675","oai":"oai:eprints.lancs.ac.uk:31774","identifiers":["oai:eprints.lancs.ac.uk:31774","10.1016\/j.cropro.2009.08.007"],"title":"Identification of rice blast disease-suppressing bacterial strains from the rhizosphere of rice grown in Pakistan.","authors":["Naureen, Zakira","Price, Adam H.","Hafeez, Fauzia Y.","Roberts, Michael R"],"enrichments":{"references":[{"id":908003,"title":"A manual for the practical study of root nodule bacteria. Blackwell Scientific Publications,","authors":[],"date":"1970","doi":null,"raw":"Vincent, J.M., 1970. A manual for the practical study of root nodule bacteria. Blackwell Scientific Publications, Oxford.","cites":null},{"id":900741,"title":"Adhesion of nitrogen fixing enteric bacteria to roots of grasses and cereals.","authors":[],"date":"1986","doi":null,"raw":"Korhonen, T.K., Lasilla, E. N., Laakso, T.,  Haahtela, K., 1986. Adhesion of nitrogen fixing enteric bacteria to roots of grasses and cereals. Plant and Soil 90, 59-69.","cites":null},{"id":899415,"title":"Application of acetylene reduction assay for measurement of nitrogen fixation.","authors":[],"date":"1973","doi":null,"raw":"Hardy, R.W.F., Burns, R.C.,  Holsten, R.D., 1973. Application of acetylene reduction assay for measurement of nitrogen fixation. Soil Biol. Biochem. 90, 245-254.","cites":null},{"id":902524,"title":"Association of cyanide with infection of birdfoot trefoil by Stemphylium loti.","authors":[],"date":"1970","doi":null,"raw":"Miller, R.L.,  Higgins, V.J., 1970. Association of cyanide with infection of birdfoot trefoil by Stemphylium loti. Phytopathol. 60, 104-110.","cites":null},{"id":905196,"title":"Azoarcus gen. nov., nitrogen-fixing proteobacteria associated with roots of Kallar grass (Leptochloa fusca (L.) Kunth) and description of two species., Azoarcus indigens sp. nov., and Azoarcus communis sp. nov.","authors":[],"date":"1993","doi":null,"raw":"Reinhold-Hurek, B., Hurek, T., Gillis, M., Hoste, B., Vancanneyt, M., Kersters, K., Peley, J., 1993. Azoarcus gen. nov., nitrogen-fixing proteobacteria associated with roots of Kallar grass (Leptochloa fusca (L.) Kunth) and description of two species., Azoarcus indigens sp. nov., and Azoarcus communis sp. nov. Int. J. Syst. Bacteriol. 43, 573-584.","cites":null},{"id":900514,"title":"Biological control of Rhizoctonia solani, the casual agent of rice sheath blight by antagonistc bacteria in greenhouse and field condition.","authors":[],"date":"2004","doi":null,"raw":"Kazempour, M.N., 2004. Biological control of Rhizoctonia solani, the casual agent of rice sheath blight by antagonistc bacteria in greenhouse and field condition. Plant Pathol J. 3, 88-96.","cites":null},{"id":900014,"title":"Biological control of seed rot and preemergence damping-off of chick pea with fluorescent Pseudomonads.","authors":[],"date":"1989","doi":null,"raw":"Kaiser, W.J., Harman, R.M.,  Weller, D.M., 1989. Biological control of seed rot and preemergence damping-off of chick pea with fluorescent Pseudomonads.  Soil Biol. Biochem. 21, 269-273.","cites":null},{"id":903720,"title":"Burkholderia, a genus rich in plant-associated nitrogen fixers with wide environmental and geographic distribution.","authors":[],"date":"2001","doi":null,"raw":"Paulina, E.L., Bustillos-Cristales, R.,  Caballero-Mellado, J., 2001. Burkholderia, a genus rich in plant-associated nitrogen fixers with wide environmental and geographic distribution. Appl. Environ. Microbiol. 67, 2790-2798.","cites":null},{"id":902896,"title":"Characterization and screening of plant growth promoting bacteria isolated from maize grown in Pakistani and Indonesian soil.","authors":[],"date":"2005","doi":null,"raw":"Naureen, Z., Yasmin, S., Hameed, S., Malik, K.A.,  Hafeez, F.Y., 2005. Characterization and screening of plant growth promoting bacteria isolated from maize grown in Pakistani and Indonesian soil. J. Basic Microbiol. 45, 447-459.","cites":null},{"id":905929,"title":"Combat of iron deprivation through a plant growth promoting fluorescent Pseudomonas strain GRP3A in mung bean (Vigna ratiata L.","authors":[],"date":"2002","doi":null,"raw":"Sharma, A., . Johri, B.N., 2002. Combat of iron deprivation through a plant growth promoting fluorescent Pseudomonas strain GRP3A in mung bean (Vigna ratiata L. Wilzeck). Microbiol. Res. 158, 77-81.","cites":null},{"id":902189,"title":"Determinants of Pseudomonas putida WCS358 involved in inducing systemic resistance in plants.","authors":[],"date":"2005","doi":null,"raw":"Meziane, H., Van der Sluis, I., Van Loon, L.C., Hofte, M.,  Bakker, P.A.H.M., 2005. Determinants of Pseudomonas putida WCS358 involved in inducing systemic resistance in plants. Mol. Plant Pathol. 6, 177-185.","cites":null},{"id":907487,"title":"Differential induction of systemic resistance in Arabidopsis by biocontrol bacteria.","authors":[],"date":"1997","doi":null,"raw":"van Wees, S.C.M., Pieterse, C.M.J., Trijssenaar, A., Van't Westende, Y., Hartog, F.,  van Loon, L.C., 1997. Differential induction of systemic resistance in Arabidopsis by biocontrol bacteria. Mol. Plant-Microbe Int. 10, 716-724.","cites":null},{"id":909053,"title":"Diversity analysis of antagonists from rice-associated bacteria and their application in biocontrol of rice diseases.","authors":[],"date":"2008","doi":"10.1111\/j.1365-2672.2007.03534.x","raw":"Yang, J.-H., Liu, H.-X., Zhu, G.-M., Pan, Y.-L., Xu, L.-P., Guo, J.-H., 2008. Diversity analysis of antagonists from rice-associated bacteria and their application in biocontrol of rice diseases. J. Appl. Microbiol. 104, 91-104.","cites":null},{"id":896480,"title":"Ecology of plant growth promoting strain of Pseudomonas fluorescens colonizing the maize endosphere in tropical soil.","authors":[],"date":"1998","doi":null,"raw":"Betelho, G.R., Guimaraes, V., De Bonis, M.,  Fonseca, M.E.F., Hagler, A.N.,  Hagler, L.C.M., 1998. Ecology of plant growth promoting strain of Pseudomonas fluorescens colonizing the maize endosphere in tropical soil. World J. Microbiol. Biotechnol. 14, 499-","cites":null},{"id":897820,"title":"Environmental factors modulating antibiotic and siderophore biosynthesis by Pseudomonas fluorescens biocontrol strains.","authors":[],"date":"1999","doi":null,"raw":"Duffy, B. K.,  Défago, G., 1999. Environmental factors modulating antibiotic and siderophore biosynthesis by Pseudomonas fluorescens biocontrol strains. Appl. Environ. Microbiol. 65, 2429-2438.   21","cites":null},{"id":904668,"title":"Evaluación in vitro del control biológico de la Fusariosis del fréjol. Tesis (Memoria de Título Ingeniería Agraria).","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":16709925,"title":"Evaluación in vitro del control biológico de la Fusariosis del fréjol. Tesis (Memoria de Título Ingeniería Agraria). Santiago, Chile, Universidad de Chile, Facultad de Ciencias Agrarias y Forestales.","authors":[],"date":"1995","doi":null,"raw":"Pumarino, A., 1995. Evaluación in vitro del control biológico de la Fusariosis del fréjol. Tesis (Memoria de Título Ingeniería Agraria). Santiago, Chile, Universidad de Chile, Facultad de Ciencias Agrarias y Forestales.","cites":null},{"id":907203,"title":"Induced resistance and phytoalexin accumulation in biological control of Fusarium wilt of carnation by Pseudomonas sp.","authors":[],"date":"1991","doi":null,"raw":"van Peer, R., Niemann, G.J.,  Schippers, B., 1991. Induced resistance and phytoalexin accumulation in biological control of Fusarium wilt of carnation by Pseudomonas sp. WCS417r. Phytopathol. 81, 728-734.","cites":null},{"id":906689,"title":"Induced resistance in plants and the role of pathogenesis-related proteins.","authors":[],"date":"1997","doi":null,"raw":"van Loon, L.C., 1997. Induced resistance in plants and the role of pathogenesis-related proteins. Eur. J. Plant Pathol. 103, 753-765.","cites":null},{"id":906218,"title":"Induced resistance to rice blast by antagonistic bacterium, Serratia marcescens strain B2.","authors":[],"date":"2002","doi":null,"raw":"Someya, N., Nakajima, M., Hibi, T., Yamaguchi, I.,  Akutsu, K., 2002. Induced resistance to rice blast by antagonistic bacterium, Serratia marcescens strain B2. J. Gen. Plant Pathol. 68, 177-182.","cites":null},{"id":896728,"title":"Induced systemic resistance (ISR) by Pseudomonas spp. impairs pre- and post-infection development of Pythium aphanidermatum on cucumber roots.","authors":[],"date":"1998","doi":null,"raw":"Chen, C., Bélanger, R.R., Benhamou, N.,  Paulitz, T.C., 1998. Induced systemic resistance (ISR) by Pseudomonas spp. impairs pre- and post-infection development of Pythium aphanidermatum on cucumber roots. Eur. J. Plant Pathol. 104, 877-886.","cites":null},{"id":900992,"title":"Induction of systemic resistance and salicylic acid accumulation in Oryza sativa, L. in the biological suppression of rice blast caused by treatments with Pseudomonas spp.","authors":[],"date":"1998","doi":null,"raw":"Krishnamurthy, K.,  Gnanamanickam, S.S., 1998 Induction of systemic resistance and salicylic acid accumulation in Oryza sativa, L. in the biological suppression of rice blast caused by treatments with Pseudomonas spp. World J. Microbiol. Biotechnol. 14, 935-","cites":null},{"id":896169,"title":"Induction of systemic resistance to Botrytis cinerea in tomato by Pseudomonas aeruginosa 7NSK2: Role of salicylic acid, pyochelin, and pyocyanin.","authors":[],"date":"2002","doi":null,"raw":"Audenaert, K., Pattery, T., Cornelis, P., Hofte, M., 2002. Induction of systemic resistance to Botrytis cinerea in tomato by Pseudomonas aeruginosa 7NSK2: Role of salicylic acid, pyochelin, and pyocyanin. Mol. Plant-Microbe Int. 15, 1147-1156.","cites":null},{"id":899965,"title":"Influence of soil quality on the function of inhibitory rhizobacteria.","authors":[],"date":"1998","doi":null,"raw":"Horwath, W.R., Elliott, L.F.,  Lynch, J.M., 1998. Influence of soil quality on the function of inhibitory rhizobacteria. Lett. Appl. Microbiol. 26, 87-92.   22","cites":null},{"id":898049,"title":"Involvement of the outer membrane lipopolysaccharides in the endophytic colonization of tomato roots by biocontrol Pseudomonas fluorescens strain WCS417r. New Phytol.","authors":[],"date":"1997","doi":null,"raw":"Duijff, B.J., Gianinazzi-Pearson, V.,  Lemanceau, P., 1997. Involvement of the outer membrane lipopolysaccharides in the endophytic colonization of tomato roots by biocontrol Pseudomonas fluorescens strain WCS417r. New Phytol. 135, 325-334.","cites":null},{"id":901244,"title":"Iron availability affects induction of systemic resistance to Fusarium wilt of radish by Pseudomonas fluorescens.","authors":[],"date":"1996","doi":null,"raw":"Leeman, M., den Ouden, E.M., van Pelt, J.A., Dirkx, F.P.M., Steijl, H., Bakker, P.A.H.M.,  Schippers, B., 1996a. Iron availability affects induction of systemic resistance to Fusarium wilt of radish by Pseudomonas fluorescens. Phytopathol. 86, 149-155.","cites":null},{"id":899678,"title":"Isolation and identification of diazotrophic bacteria from rice, wheat and kallar grass.","authors":[],"date":"1998","doi":null,"raw":"Hassan, U., Mirza, M.S., Menhaz, S., Rasul, G.,  Malik, K.A., 1998. Isolation and identification of diazotrophic bacteria from rice, wheat and kallar grass. In: Malik, K.A., Mirza, M.S.,  Ladha, J.K. (Eds.), Nitrogen fixation with non-legumes. Kluwer Academic Publishers, Dordrecht, pp. 197-205.","cites":null},{"id":908459,"title":"Isolation, characterization and beneficial effects of rice-associated plant growth-promoting bacteria from Zanzibar soils.","authors":[],"date":"2004","doi":null,"raw":"Yasmin, S., Baker, M.A.R., Malik, K.A.,  Hafeez, F.Y., 2004. Isolation, characterization and beneficial effects of rice-associated plant growth-promoting bacteria from Zanzibar soils. J. Basic Microbiol. 44, 241-252.","cites":null},{"id":903166,"title":"Methods for growing Azospirillum lipoferum and for counting it in pure culture and in association with plants.","authors":[],"date":"1977","doi":null,"raw":"Okon, Y., Albercht, S.L.,  Burris, R.H., 1977. Methods for growing Azospirillum lipoferum and for counting it in pure culture and in association with plants. Appl. Environ. Microbiol. 33, 85-88.","cites":null},{"id":896970,"title":"Microbial enzymes in biocontrol of plant pathogens and pests.","authors":[],"date":"2002","doi":null,"raw":"Chernin, L.,  Chet, I., 2002. Microbial enzymes in biocontrol of plant pathogens and pests. In: Burns, R.G.,  Dick, R.P. (Eds.), Enzymes in the environment: activity, ecology, and applications. Marcel Dekker, New York, pp. 171-225.","cites":null},{"id":908180,"title":"Microbial interactions and biocontrol in the rhizosphere.","authors":[],"date":"2001","doi":null,"raw":"Whipps, J.M., 2001. Microbial interactions and biocontrol in the rhizosphere. J. Exp. Bot. 52, 487-511.","cites":null},{"id":908787,"title":"Mitochondrial origins.","authors":[],"date":"1985","doi":null,"raw":"Yang, D.C., Oyaizu, Y., Oyaizu, H., Olsen, G.J.,  Woese, E.R., 1985. Mitochondrial origins. Proc. Natl. Acad. Sci. USA 82, 4443-4447.   26","cites":null},{"id":904909,"title":"Mixtures of plant growth-promoting rhizobacteria enhance biological control of multiple cucumber pathogens.","authors":[],"date":"1998","doi":null,"raw":"Raupach, G.S.,  Kloepper, J.W., 1998. Mixtures of plant growth-promoting rhizobacteria enhance biological control of multiple cucumber pathogens. Phytopathol. 88, 1158-1164.","cites":null},{"id":904052,"title":"Mobilization of phosphorus in soil in connection with vital activity of some microbial species.","authors":[],"date":"1948","doi":null,"raw":"Pikovskaya, R.I., 1948. Mobilization of phosphorus in soil in connection with vital activity of some microbial species. Microbiologiya  17, 362-370.   24","cites":null},{"id":906401,"title":"Molecular biology of disease resistance in rice.","authors":[],"date":"2001","doi":null,"raw":"Song, F.,  Goodman, R.M., 2001. Molecular biology of disease resistance in rice. Physiol. Mol. Plant Pathol. 59, 1-11.   25","cites":null},{"id":898569,"title":"Monitoring temporal and spatial variations in rhizosphere bacterial population diversity: A community approach for the improved selection of rhizosphere competent bacteria.","authors":[],"date":"2001","doi":null,"raw":"Goddard, V.J., Bailey, M.J., Darrah, P., Lilley, A.K.,  Thompson, I.P., 2001. Monitoring temporal and spatial variations in rhizosphere bacterial population diversity: A community approach for the improved selection of rhizosphere competent bacteria. Plant and Soil 232, 181-193.","cites":null},{"id":909346,"title":"Phylogeny of the phototrophic Rhizobium strain BTAi1 by polymerase chain reaction-based sequencing of a 16S rRNA gene segment.","authors":[],"date":"1991","doi":null,"raw":"Young, J.P.W., Downer, H.L.,  Eardly, D., 1991. Phylogeny of the phototrophic Rhizobium strain BTAi1 by polymerase chain reaction-based sequencing of a 16S rRNA gene segment. J. Bacteriol. 173, 2271-2277.   27","cites":null},{"id":907746,"title":"Plant immune responses triggered by beneficial microbes.","authors":[],"date":"2008","doi":null,"raw":"van Wees, S.C.M., Van der Ent, S.,  Pieterse, C.M.J., 2008. Plant immune responses triggered by beneficial microbes. Curr. Opin. Plant Biol. 2008, 11, 1–6.","cites":null},{"id":901675,"title":"Protein measurement with Folin phenol reagent.","authors":[],"date":"1951","doi":null,"raw":"Lowry, H.O., Rosebrough, N.J., Farr, A.G.,  Randall, R.J., 1951. Protein measurement with Folin phenol reagent. J. Biol. Chem. 193, 265-275.   23","cites":null},{"id":897567,"title":"Pseudomonas fluorescens WCS374r-induced systemic resistance in rice against Magnaporthe oryzae is based on pseudobactin-mediated priming for a salicylic acid-repressible multifaceted defense response.","authors":[],"date":"2008","doi":null,"raw":"De Vleesschauwer, D., Bakker, P.A.H.M., Djavaheri, M.,  Hofte, M 2008. Pseudomonas fluorescens WCS374r-induced systemic resistance in rice against Magnaporthe oryzae is based on pseudobactin-mediated priming for a salicylic acid-repressible multifaceted defense response. Plant Physiol. 148: 1996-2012.","cites":null},{"id":906431,"title":"Rhizobacteria of sugar beets: effects of seed application and root colonization on yield.","authors":[],"date":"1982","doi":null,"raw":"Sulsow, T.V., Schroth, M.N., 1982. Rhizobacteria of sugar beets: effects of seed application and root colonization on yield. Phytopathol. 72, 199-206.","cites":null},{"id":899164,"title":"Rhizobium, Bradyrhizobium and Agrobacterium strains isolated from cultivated legumes.","authors":[],"date":"2004","doi":null,"raw":"Hameed, S., Yasmin, S., Malik, K.A., Zafar, Y.,  Hafeez, F.Y., 2004. Rhizobium, Bradyrhizobium and Agrobacterium strains isolated from cultivated legumes. Biol. Fertil. Soils 39, 179-185.","cites":null},{"id":904346,"title":"Salicylic acid produced by Serratia marcescens 90-166 is not the primary determinant of induced systemic resistance in cucumber or tobacco.","authors":[],"date":"1997","doi":null,"raw":"Press, C.M. Wilson, M., Tuzun, S.,  Kloepper J.W., 1997. Salicylic acid produced by Serratia marcescens 90-166 is not the primary determinant of induced systemic resistance in cucumber or tobacco. Mol. Plant-Microbe Int. 10, 761–768.","cites":null},{"id":905457,"title":"Selected topics in biological control.","authors":[],"date":"1981","doi":null,"raw":"Schroth, M.N.,  Hancock, J.G., 1981. Selected topics in biological control. Annu. Rev. Microbiol. 35, 453-476.","cites":null},{"id":902598,"title":"Selection of bioantagonistic bacteria to be used in biological control of Rhizoctonia solani in tomato.","authors":[],"date":"2003","doi":null,"raw":"Montealegre, J.R., Reyes, R., Pérez, L.M., Herrera, R., Silva, P.,  Besoain, X., 2003. Selection of bioantagonistic bacteria to be used in biological control of Rhizoctonia solani in tomato. Electronic J. Biotechnol. 6, 115-127.","cites":null},{"id":900276,"title":"Soil-borne strain IC14 of Serratia plymuthica with multiple mechanisms of antifungal activity provides biocontrol of Botrytis cinerea and Sclerotinia sclerotiorum diseases.","authors":[],"date":"2003","doi":null,"raw":"Kamensky, M., Ovadis, M., Chet, I.,  Chernin, L., 2003. Soil-borne strain IC14 of Serratia plymuthica with multiple mechanisms of antifungal activity provides biocontrol of Botrytis cinerea and Sclerotinia sclerotiorum diseases. Soil Biol. Biochem. 35, 323-","cites":null},{"id":901370,"title":"Suppression of Fusarium wilt of radish by coinoculation of fluorescent Pseudomonas spp. and root-colonizing fungi.","authors":[],"date":"1996","doi":null,"raw":"Leeman, M., den Ouden, F.M., van Pelt, J.A., Cornelissen, C., Matamala-Garros, A., Bakker, P.A.H.M.,  Schippers, B., 1996b. Suppression of Fusarium wilt of radish by coinoculation of fluorescent Pseudomonas spp. and root-colonizing fungi. Eur. J. Plant Pathol. 102, 21-31.","cites":null},{"id":901925,"title":"Suppression of rice blast by preinoculation with avirulent Pyricularia oryzae and the nonrice pathogen Bipolaris sorokiniana.","authors":[],"date":"1998","doi":null,"raw":"Manandhar, H.K., Lyngs Jorgensen, H.J., Mathur, S.B.,  Smedegaard-Peterson, V., 1998. Suppression of rice blast by preinoculation with avirulent Pyricularia oryzae and the nonrice pathogen Bipolaris sorokiniana. Phytopathol. 88, 735-739.","cites":null},{"id":906930,"title":"Systemic resistance induced by rhizosphere bacteria.","authors":[],"date":"1998","doi":null,"raw":"van Loon, L.C., Bakker, P.A.H.M.,  Pieterse, C.M.J., 1998. Systemic resistance induced by rhizosphere bacteria. Annu. Rev. Phytopathol. 36, 453-483.","cites":null},{"id":898300,"title":"The genera Aeromonas and Plesiomonas. In: Balows,","authors":[],"date":"1992","doi":null,"raw":"Farmer, III, J.J., Arduino, M.J.,  Hickman-Brenner, F.W., 1992. The genera Aeromonas and Plesiomonas. In: Balows, A., Truper, H.G., Dworkin, M., Hardar, W.,  Schleifer, K.H. (Eds.), The Prokaryotes. Springer-Verlag, New York, pp. 3012-3045.","cites":null},{"id":898845,"title":"The genus Enterobacter. In: Balows,","authors":[],"date":"1992","doi":null,"raw":"Grimont, F.,  Grimont, P.A.D., 1992. The genus Enterobacter. In: Balows, A., Truper, H.G., Dworkin, M., Hardar, W.,  Schleifer, K.H. (Eds.), The Prokaryotes. SpringerVerlag, New York, pp. 2729-2815.","cites":null},{"id":903430,"title":"The role of chitinase of Serratia marcescens in biocontrol of Sclerotium rolfsii.","authors":[],"date":"1988","doi":null,"raw":"Ordentlich, A., Elad, Y.,  Chet, I., 1988. The role of chitinase of Serratia marcescens in biocontrol of Sclerotium rolfsii. Phytopathol. 78, 84-88.","cites":null},{"id":905683,"title":"Universal chemical assay for detection and determination of siderophores.","authors":[],"date":"1987","doi":null,"raw":"Schwyn, B.,  Neilands, J.B., 1987. Universal chemical assay for detection and determination of siderophores. Anal. Biochem. 160, 40-47.","cites":null},{"id":897279,"title":"Use of Plant GrowthPromoting Bacteria for Biocontrol of Plant Diseases: Principles, Mechanisms of Action, and Future Prospects.","authors":[],"date":"2005","doi":null,"raw":"Compant, S., Duffy, B., Nowak, J., Clément, C.,  Barka E.A., 2005. Use of Plant GrowthPromoting Bacteria for Biocontrol of Plant Diseases: Principles, Mechanisms of Action, and Future Prospects. Appl. Environ. Microbiol. 71, 4951–4959.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-12","abstract":"Sixteen bacterial strains isolated from the roots and rhizosphere of rice plants growing in saline and non-saline soils from the Shorkot area of Pakistan were tested for their ability to promote plant growth and reduce the incidence of rice blast disease. When applied to the soil, many of the isolated rhizobacterial strains increased seedling growth and\/or suppressed rice blast disease in greenhouse-grown plants of the cultivars Super Basmati and Azucena, but each cultivar responded to different subsets of the bacteria. In the cv Super Basmati, increased blast resistance was correlated with the production of siderophores by the rhizobacteria. Several strains inhibited the growth of the causative agent of rice blast disease, the fungal pathogen Magnaporthe grisea, in an in vitro dual culture assay. Direct bioantagonism was correlated with disease resistance in Super Basmati, but not in Azucena, and direct antagonism as a cause for the reduced disease incidence is also unlikely since no epiphytic colonisation of leaves was detected. Rhizosphere colonisation by the bacteria in plants grown in sterile sand was correlated with disease resistance in Super Basmati, but not in Azucena. As well as the differences in strains that protected each cv against blast disease, we also found that there were differences in the ability of some strains to protect plants against blast depending on soil type. Hence, there are complex interactions between rhizobacteria and rice plants with respect to biocontrol of rice blast disease, dependent upon both rice cv and soil type. The identity of strains that promoted high levels of disease protection, including three that performed well across all plant cultivars and growth conditions, was determined by 16S rRNA gene sequencing","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68675.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/31774\/1\/Zakira_CROPRO_preprint.pdf","pdfHashValue":"83dfe91ad2058ab4e90977b533fd7153c988381a","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:31774<\/identifier><datestamp>\n      2018-01-24T02:56:46Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5148:5148333031<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Identification of rice blast disease-suppressing bacterial strains from the rhizosphere of rice grown in Pakistan.<\/dc:title><dc:creator>\n        Naureen, Zakira<\/dc:creator><dc:creator>\n        Price, Adam H.<\/dc:creator><dc:creator>\n        Hafeez, Fauzia Y.<\/dc:creator><dc:creator>\n        Roberts, Michael R<\/dc:creator><dc:subject>\n        QH301 Biology<\/dc:subject><dc:description>\n        Sixteen bacterial strains isolated from the roots and rhizosphere of rice plants growing in saline and non-saline soils from the Shorkot area of Pakistan were tested for their ability to promote plant growth and reduce the incidence of rice blast disease. When applied to the soil, many of the isolated rhizobacterial strains increased seedling growth and\/or suppressed rice blast disease in greenhouse-grown plants of the cultivars Super Basmati and Azucena, but each cultivar responded to different subsets of the bacteria. In the cv Super Basmati, increased blast resistance was correlated with the production of siderophores by the rhizobacteria. Several strains inhibited the growth of the causative agent of rice blast disease, the fungal pathogen Magnaporthe grisea, in an in vitro dual culture assay. Direct bioantagonism was correlated with disease resistance in Super Basmati, but not in Azucena, and direct antagonism as a cause for the reduced disease incidence is also unlikely since no epiphytic colonisation of leaves was detected. Rhizosphere colonisation by the bacteria in plants grown in sterile sand was correlated with disease resistance in Super Basmati, but not in Azucena. As well as the differences in strains that protected each cv against blast disease, we also found that there were differences in the ability of some strains to protect plants against blast depending on soil type. Hence, there are complex interactions between rhizobacteria and rice plants with respect to biocontrol of rice blast disease, dependent upon both rice cv and soil type. The identity of strains that promoted high levels of disease protection, including three that performed well across all plant cultivars and growth conditions, was determined by 16S rRNA gene sequencing.<\/dc:description><dc:date>\n        2009-12<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/31774\/1\/Zakira_CROPRO_preprint.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.cropro.2009.08.007<\/dc:relation><dc:identifier>\n        Naureen, Zakira and Price, Adam H. and Hafeez, Fauzia Y. and Roberts, Michael R (2009) Identification of rice blast disease-suppressing bacterial strains from the rhizosphere of rice grown in Pakistan. Crop Protection, 28 (12). pp. 1052-1060. ISSN 0261-2194<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/31774\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/j.cropro.2009.08.007","http:\/\/eprints.lancs.ac.uk\/31774\/"],"year":2009,"topics":["QH301 Biology"],"subject":["Journal Article","PeerReviewed"],"fullText":" 1 \nIdentification of rice blast disease-suppressing bacterial strains from the \nrhizosphere of rice grown in Pakistan \n \nZakira Naureen1,2, Adam H. Price3, Fauzia Y. Hafeez2,4, \nand Michael R. Roberts1. \n1Lancaster Environment Centre, Lancaster University, Lancaster, LA1 4YQ, UK. \n2 Plant Microbiology Division, National Institute for Biotechnology and Genetic Engineering \n(NIBGE), P.O. Box 577, Jhang Road, Faisalabad 3800-Pakistan. \n3Institute of Biological and Environmental Sciences, University of Aberdeen, AB24 3UU, UK. \n \nCorresponding Author: \nDr. Michael R. Roberts \nE-mail: m.r.roberts@lancaster.ac.uk \nTel: +44 1524 510210 \nFax: +44 1524 593192 \n \n \n4Present Address: Department of Biosciences, COMSATS Institute of Information Technology, \nChak Shahzad Campus, Park Road, Islamabad, Pakistan. \n \n 2 \nAbstract \nSixteen bacterial strains isolated from the roots and rhizosphere of rice plants growing in \nsaline and non-saline soils from the Shorkot area of Pakistan were tested for their ability to \npromote plant growth and reduce the incidence of rice blast disease. When applied to the soil, \nmany of the isolated rhizobacterial strains increased seedling growth and\/or suppressed rice \nblast disease in greenhouse-grown plants of the cultivars Super Basmati and Azucena, but \neach cultivar responded to different subsets of the bacteria. In the cv Super Basmati, \nincreased blast resistance was correlated with the production of siderophores by the \nrhizobacteria. Several strains inhibited the growth of the causative agent of rice blast disease, \nthe fungal pathogen Magnaporthe grisea, in an in vitro dual culture assay. Direct \nbioantagonism was correlated with disease resistance in Super Basmati, but not in Azucena, \nand direct antagonism as a cause for the reduced disease incidence is also unlikely since no \nepiphytic colonisation of leaves was detected. Rhizosphere colonisation by the bacteria in \nplants grown in sterile sand was correlated with disease resistance in Super Basmati, but not \nin Azucena. As well as the differences in strains that protected each cv against blast disease, \nwe also found that there were differences in the ability of some strains to protect plants \nagainst blast depending on soil type. Hence, there are complex interactions between \nrhizobacteria and rice plants with respect to biocontrol of rice blast disease, dependent upon \nboth rice cv and soil type. The identity of strains that promoted high levels of disease \nprotection, including three that performed well across all plant cultivars and growth \nconditions, was determined by 16S rRNA gene sequencing. \n \nKey words \nRice, rhizobacteria, siderophores, blast disease, bioantagonism, induced systemic resistance.\n 3 \n1. Introduction \nRice is one of the most important staple foods for the increasing world population, especially \nin Asia. Diseases are among the most significant limiting factors that affect rice production, \ncausing annual yield losses conservatively estimated at 5% (Song and Goodman, 2001). More \nthan 70 diseases caused by fungi, bacteria, viruses or nematodes have been recorded on rice \n(Manandhar et al., 1998), among which rice blast (Magnaporthe grisea) is the most serious \nconstraint on high productivity (Song and Goodman, 2001). Resistant cultivars and the \napplication of pesticides have been used for blast control. However, the useful life-span of \nmany resistant cultivars is only a few years, due to the breakdown of the resistance in the face \nof high pathogenic variability of the pathogen population. The use of pesticides is costly as \nwell as environmentally undesirable. Thus, there is a need to develop strategies providing \ndurable resistance that are useful over a broad geographic area (Manandhar et al., 1998). \nAmong such new strategies, biocontrol agents appear to hold promise in blast \nmanagement. Since biological control is a key component of integrated disease management, \nit is important to search for plant growth-promoting rhizobacteria (PGPR) active against blast \nand to evaluate these antagonists for application in field conditions. Many microorganisms \nfrom the rhizosphere can positively influence plant growth and plant health and are referred \nto as PGPR (Compant et al., 2005). These microbes can act as biocontrol agents in several \nways, including niche exclusion, bioantagonism and induction of induced systemic resistance \n(ISR) against infection by fungal, bacterial and viral pathogens in different plant species \n(Compant et al., 2005). The mechanisms by which PGPR activate ISR are not yet understood, \nbut it is clear that there is substantial variation between different microbes and plants. A \nrange of different molecules have been identified as elicitors of ISR in different systems, \nincluding conserved effectors such as flagellar peptides and lipopolysaccharides, as well as \nantibiotics, cyclic lipopeptides and siderophores (Compant et al., 2005; Van Wees et al., \n 4 \n2008). The ability to secrete siderophores into the environment is an important feature of \nmany PGPR. Siderophores are iron-chelating compounds that many microbes use to acquire \niron from the soil. Siderophore-producing bacteria are able to out-compete other soil \nmicrobes, providing one mechanism for their bioantagonistic properties (Duffy and Défago, \n1999). In addition, siderophores have been identified as molecules able to activate ISR in \nseveral plant species, providing a second mechanism for protection of plants against disease \nby siderophore-producing PGPR (Leeman et al., 1996a; Audenaert et al., 2002; Meziane et \nal., 2005). Recently, the siderophore pseudobactin was found to be an important determinant \nof ISR against blast disease in rice (De Vleesschauwer et al., 2008). \nWe are working towards commercial development of PGPR as a method for both \nplant growth promotion and biocontrol. Many greenhouse studies (Kaiser et al., 1989; \nMontealegre et al., 2003) and field experiments (Kazempour, 2004) have been conducted to \nshow the efficacy of PGPR in disease management, but there are still relatively few \ncommercial applications of PGPR for this purpose. Here, we report on the selection of PGPR \nstrains for suppression of rice blast disease, and show that complex interactions exist between \nthe different biochemical and physiological properties of these strains and their ability to \npromote blast resistance in rice. \n \n2. Materials and methods \n2.1 Bacterial strains and growth conditions  \nBacterial strain Z2-7 had previously been isolated from rice grown in Zanzibar (Yasmin et \nal., 2004) and was taken from the BIRCEN culture collection, Plant Microbiology Division, \nNIBGE. All other strains were isolated from the roots or rhizosphere of the rice cv Super \nBasmati, cultivated in either saline or non-saline soils in the area of Shorkot, Pakistan. \nBacteria were isolated either from the rhizoplane or from roots of healthy rice plants, as \n 5 \nfollows: root pieces from rice plants were washed with tap water, placed inside tubes \ncontaining 2 mL of 0.5% MgSO4 and subjected to ultrasound at 50-55 KHz for 5 min \n(Pumarino, 1995). The bacterial suspension obtained was diluted 10-3, 10-5 and 10-7 for \nselection. For rhizospheric strains, 1 g of soil was placed in a tube containing 100 mL of \nsterile distilled water, and dilutions performed as above. For both types of samples, 0.1 mL of \neach dilution was spread on Luria Bertani (LB) agar and incubated at 28 + 2ºC until colony \ndevelopment was observed.  \n \n2.2 Morphological and physiological characterization  \nPurified bacterial strains were studied for colony and cell morphology using light microscopy \nand Gram staining (Vincent, 1970). Indole acetic acid (IAA) production by these bacterial \nstrains was estimated as described by Hameed et al., (2004) and P-solubilization was \nassessed on Pikovskaya’s medium containing tricalcium phosphate (Pikovskaya, 1948). \n \n2.3 Nitrogenase activity  \nNitrogenase activity of bacterial strains was determined in semi-solid nitrogen-free malate \nmedium (NFM; Okon et al., 1977) by using an acetylene reduction assay (ARA) (Hardy et \nal., 1973). Pure bacterial colonies were inoculated onto NFM medium in 10 mL McCartney \nvials and incubated at 28+2 oC for 48 h. Acetylene (10% v\/v in air) was injected to the vials. \nAfter incubation for 16 h at 28+2 oC, gas samples (100 µL) were analyzed for acetylene \nreduction on a gas chromatograph (Carlo Erba-Model GC 180-series 2150) using a Porapak-\nQ column and H2 flame ionization detector. Protein estimation was carried out to measure the \nspecific activity of the cultures as described by Lowry et al., (1951). \n \n2.4 Siderophore production  \n 6 \nSiderophore production was detected using the universal chrome azurol ‘S’ (CAS) assay \n(Schwyn and Neilands, 1987). CAS plates were streaked with overnight grown cultures and \nincubated at 28+2oC for 72 h (Sharma and Johri, 2002). \n \n2.5 Hydrogen cyanide production  \nProduction of HCN was determined by modified method of Miller and Higgins (1970). \nBacterial culture (48 h) was streaked on LB amended with glycine (4.4 g L-1) and a filter \npaper soaked in 0.5% (w\/v) picric acid in 1% Na2CO3 placed in the upper lid of the Petri \nplate. After incubation at 28±2ºC, changes in colour were examined.  \n \n2.6 Production of diffusible antibiotics  \nPotato dextrose agar plates, covered with a 0.2 µm cellophane membrane, were inoculated in \nthe centre with 100 µL of a bioantagonistic bacterial suspension (5 x 109 cfu mL-1). After \nincubation for 72 h at 28+2ºC, the membrane with the grown bacterial isolate was removed, \nand the plate was inoculated in the middle with a 10 mm disk of a pure culture of M. grisae. \nPlates were further incubated at 28+2ºC for 48 h and the growth of the pathogen (colony \nradius) was measured as the distance between the point of placement of fungal disk and \nactively growing edges of the fungus. Sterile double distilled water replaced the bacterial \nsuspension in control plates. Each experiment was run in triplicate and was repeated at least \nthree times. Results are expressed as mean % inhibition of the growth of the corresponding \nM. grisae isolate in the absence of any bacteria. Percent inhibition was calculated using the \nfollowing formula: % inhibition = (1 – [Fungal growth \/ Control growth]) x 100 \n \n2.7 Production of volatile antibiotics \n 7 \nTo check the production of volatile antibiotics, 100 µL of bacterial suspension (5x109 cfu \nmL-1), were placed at the centre of a Petri dish containing Kings’ B medium, and a 10 mm \ndisk of a 4-d old pure culture of M. grisae was placed at the centre of another Petri dish \ncontaining PDA. Both half plates were placed face to face preventing any physical contact \nbetween the pathogen and the bacterial suspension. Plates were then sealed to isolate the \natmosphere inside and to prevent loss of any volatiles formed. In control plates, bacterial \nsuspension was replaced with sterile double-distilled water. Plates were incubated at 28+2ºC \nfor 48 h and the growth of the pathogen was measured as mentioned above and compared to \ncontrols. Experiments were run in triplicate and repeated at least three times. Results are \nexpressed as mean % inhibition of the growth of the corresponding M. grisae isolate in the \nabsence of any bacteria. Percent inhibition was calculated as above. \n \n2.8 Protease and chitinase production \nBacterial isolates were checked for production of proteases by growing them on skimmed \nmilk agar (SKM) as described by Kazempour (2004). An ability to clear the skimmed milk \nsuspension in the agar was taken as evidence of the secretion of proteases. To assay the \nproduction of chitinases, bacteria were grown on medium containing chitin as the sole carbon \nsource (Montealegre et al., 2003). \n \n2.9 Pathogenicity of bacteria \nIn order to test whether bacteria were pathogenic to rice plants, seeds were immersed in a \nsuspension of the antagonistic bacteria (5x109 cfu mL-1) for 5 min (Raupach and Kloepper, \n1998). Sterile distilled water was used as a control. Once treated, seeds were germinated in \nautoclaved soil. Seedlings were maintained under glasshouse conditions at 25-28ºC with \ndaily watering with the addition of fertilizers. Height, number of leaves, and fresh weights \n 8 \nwere measured after 30 d. Experiments were repeated six times. Data was analyzed using the \nDuncan Multiple Test to test for significant differences. \n \n2.10 Dual culture antagonism assays \nM. grisea isolate Ch155 was originally collected in China by Professor Shen at the Chinese \nNational Rice Research Institute and distributed by Didier Tharreau, CIRAD, Montpellier, \nFrance. A 10 mm disk of a pure culture of M. grisea grown on potato dextrose agar (PDA) \nwas placed at the centre of a Petri dish containing PDA. A circular inoculum, made with a 6 \ncm diameter Petri dish dipped in a suspension of bacteria (5x109 cfu mL-1), was placed \nsurrounding the fungal culture. Plates were cultured for 72 h at 28 + 2ºC and growth diameter \nof the pathogen (distance between the point of placement of fungal disk and actively growing \nedges of the fungus) was measured and compared to control growth where the bacterial \nsuspension was replaced by sterile distilled water. Each experiment considering a single \nbacterial isolate was run in triplicate and was repeated at least three times. Results are \nexpressed as mean % inhibition of the growth of the corresponding M. grisea isolate in the \nabsence of any bacteria.  \nPercent inhibition was calculated as above. \n \n2.11 Disease resistance in greenhouse-grown rice plants \nPGPR inoculations. Rice seeds (cvs Super Basmati and Azucena) were sterilised and \ngerminated on moist filter paper in sterile Petri dishes. Ten days after germination, three \nseedlings were transplanted to each pot (25 cm diameter) containing autoclaved soil. Plants \nwere kept in the greenhouse at a temperature of 28 + 2ºC during the day and 25 + 2ºC at night \nfor 40 d. For inoculation of plants, bacterial cultures were grown in LB broth for 24-48 h at \n28 + 2ºC. Cell pellets were obtained by centrifugation at 6000 x g for 5 min, washed and \n 9 \nresuspended in sterile water. Soils in which seedlings were growing were inoculated with 1 \nmL of bacterial suspension (108 - 109 cells mL-1) of individual strains and plants left for 7 d \nunder standard conditions. Parallel experiments were performed in which plants were grown \nin autoclaved sand rather than soil. Plants were grown in same conditions, watered regularly \nwith autoclaved water and were given ¼ strength Hoagland’s solution for nutritional \nrequirements. \nChallenge inoculation. The blast fungus was cultured on rice flour agar (20 g L-1 rice flour, \n2.5 g L-1 yeast extract 1.5% agar) and incubated at 25oC under fluorescent lights with a 12 h \nphotoperiod for 2-3 weeks. Spores of the fungus were harvested by flooding the agar plate \ncultures with 5-7 mL sterile water containing 0.5% gelatine, filtered through 0.2 µm nylon \nmeshes and transferred immediately to a container containing ice to prevent spore \ngermination. Spore concentration was adjusted to 1x105 spores mL-1.  \n40-d-old rice plants of all of the treatments and control were transferred to the \ninoculation chamber 1 d before the inoculation to acclimatize the new environment (28 ± 5oC \nday and 25 ± 5oC night temperature and relative humidity above 90%). About 100 mL of the \nfungal spore inoculum was sprayed over the plants in the evening. Immediately after \ninoculation, the plants were covered with a polythene hood and black polythene sheets for 24 \nh to stimulate infection in the dark. Each experiment included five replicates per treatment \nand three plants per replicate. \nDisease assessment. Six days after fungal inoculation, each plant was assessed individually \nfor blast infection. Each leaf was scored for number and size of lesions. Disease incidence \nwas evaluated according to a lesion index: small brown spots (R; lesion diameter < 2mm), \nsmall brown lesion encircled by a whitish zone (RS; 2 mm ≤ lesion diameter < 5mm), small \nwhitish lesion encircled by a brown zone (MS; 2 mm ≤ lesion diameter < 5mm) and large  \nlesion (S; 5 mm ≤ lesion diameter ), and disease index = {(1×nR + 2 × nRS  + 3×nMS+ \n 10 \n4×nS) ÷ number of seedlings} (Someya et al., 2002). The experiment was carried out \nindependently on three occasions using a completely randomized block design with six \nreplications for each treatment. Mean disease index (MDI) data from each replicated \nexperiment was analysed by two-way ANOVA with strain and cv as the two factors. \nAfter initial disease scoring, plants were kept under normal greenhouse conditions for \nanother period of 40 d, and then percentage survival of the plants was calculated. \n \n2.12 Ephipytic and rhizospheric colonization by bacteria \nLeaf and root apex samples from 45 rice plants grown in sand inoculated with each bacterial \nstrain were taken 7, 25 and 45 d after inoculation to check for ephiphytic and rhizospheric \ncolonization of bacteria. Leaf and root extracts were made and serial dilutions of 10-3, 10-5 \nand 10-7 were made for selection of bacteria. For both types of samples, 0.1 mL of each \ndilution was placed on Luria Bertani (LB) agar and incubated at 28 + 2ºC for 48-72 h or until \ncolony development was observed.  \n \n2.13 Partial 16S rRNA amplification and sequencing \nDNA was extracted from selected bacterial isolates (DNeasy Tissue kit, QIAGEN) and used \nto amplify a fragment of the 16S ribosomal RNA gene (Yang et al., 1985) using universal \nprimers Y1 and Y2. The forward primer Y1 (5′-TGGCTCAGAACGAACGCTGGCGGC-3′) \ncorresponds to positions 20-43 in the Escherichia coli 16S rRNA sequence (Young et al., \n1991), and the reverse primer Y2 (5′-CCCACTGCTGCCTCCCGTAGGAGT-3′) corresponds \nto position 361-338 of the gene. Each 50 µL PCR reaction mixture contained 0.2 µL of Taq \nDNA Polymerase (50 U µL-1;  Promega), 5 µL 10x PCR buffer, 4 µL 2.5 mM dNTPs, 1 µL \nof each primer (100 ng µL-1) and 1µL template DNA (12.5 ng µL-1) and underwent 35 rounds \nof temperature cycling (94oC for 1 min, 50oC for 2 min and 72oC for 3 min). This was \n 11 \nfollowed by incubation at 72oC for 7 min. PCR products were purified using QIAquick PCR \nPurification Spin kits (QIAGEN) and directly used for sequence analysis (Lancaster \nUniversity Sequencing Facility). The sequences obtained were searched on BlastX \n(http:\/\/www.ncbi.nlm.nih.gov\/BLAST\/).  Sequences were deposited in the EMBL gene bank \ndatabase. \n \n3. Results  \n3.1 Isolation of bacterial strains \nA total of 16 bacterial strains isolated from the rhizosphere and roots of rice cultivated in \nnormal and saline soils from Shorkot in Pakistan were selected for detailed investigation. \nSpecies diversity investigation amongst these, indicated that they likely belong to a range of \ndifferent bacterial genera, including Enterobacter, Bacillus and Pseudomonas, as they \nshowed morphological characteristics most closely resembling these genera (Farmer et al., \n1992; Grimont and Grimont 1992; Hassan et al., 1998). \n \nDifferent strains exhibited different combinations of properties for nitrogen fixation, P \nsolubilization, and the production of siderophores, IAA, proteases, chitinases and HCN. \nAlthough only one strain (SPR7) showed HCN production, none were positive for N fixation. \nThe data are summarized in Table 1.  \n \n3.2 Pathogenicity and effects of bacteria on plant growth \nNo signs of pathogenicity, such as lesion formation or wilting were observed in the seedlings \nthat had been incubated with bacterial cultures. Significant differences were observed in plant \ngrowth promotion effects on both shoot fresh weights and seedling height by the bacteria in \ninoculated seedlings of both cultivars after one month (Table 2). \n 12 \n \n3.3 Disease suppression in greenhouse-grown plants \nWhen bacterial cultures were applied to the soil 7 d prior to pathogen inoculation, isolates \nBPS10, SPR4, WBPS1, Z2-7, SPS2, SPR5 and WBPR4 reduced the disease index to a range \nof 7.5% to 27.5% relative to controls in Azucena (Table 3). In Super Basmati plants, bacterial \nisolates WBPS1, BPS12, Z2-7, SPS2 and WBPS2 reduced the disease index to a range of \n17.5 % to 40 % compared to control plants in the absence of PGPR (Table 3). Other isolates \nhad smaller effects, but no strain tested failed to provide protection in at least one cv. \nStatistical analysis using two-way ANOVA indicated that both bacterial strain (F = 309, P < \n0.0001) and plant cv (F = 1280, P < 0.0001) affect the level of disease, and that there is also a \nsignificant interaction between strain and cv (F = 190, P < 0.0001). This latter result suggests \nthat the two cvs respond differently to the bacterial strains. \n \nTo investigate the source of this difference, we performed point biserial correlation analysis \nto examine possible relationships between the production of antibiotics, siderophores and \nhydrolytic enzymes, and disease resistance in the two rice cvs. The results indicate that blast \nresistance in Super Basmati is correlated with siderophore production (rpb = -0.59; P = 0.015), \nbut not in Azucena (rpb = -0.3; P = 0.254), suggesting that this difference may account, at least \nin part, for the interaction identified in the ANOVA analysis. These relationships are \nillustrated in Fig. 1, which also shows that in general, more strains were able to reduce \ndisease indices, and to a greater degree, in Azucena plants than in Super Basmati, irrespective \nof their ability to produce siderophores. There was no significant correlation between blast \nresistance and the production of antibiotics, chitinases or proteases by the bacteria. \n \n 13 \nAfter initial scoring for disease, plants were kept for a further period of 40 d under normal \ngrowth conditions to see whether or not plants that initially showed disease symptoms \nrecovered over time. Super Basmati plants inoculated with bacterial strains SPR7, SPR5, \nSPR4, WBPR4 and BPS10, which initially showed high disease incidence, were found to \nrecover almost completely from the disease, whereas un-inoculated control plants were \nalmost dead at that time. Similarly, in the case of rice cv Azucena, plants treated with \nbacterial strains WBPS1 and WBPS5 which were initially highly infected, showed 80% \nrecovery after 40 d of challenge inoculation with blast fungus (Table 4). \n \n3.4 Bioantagonistic activity against M. grisea \nIn the dual culture assays (Fig. 2) many of the bacterial strains significantly inhibited fungal \ngrowth over a period of 28 d (Table 3). Bacterial strains SPS2 and WBPR2 remained \nantagonistic at a level of 100 % even after 40 d of assay. No physical contact was observed \nbetween any of the bacteria tested and M. grisea; moreover, an inhibitory halo was observed \nin the case of a few bacterial strains, suggesting the presence of fungistatic metabolites \nsecreted by the bacteria. With bacterial strain SPS2, production of spores around the fungus \ncausing complete fungal lysis was observed (Fig. 2). The bacterial strains were further \ninvestigated for production of volatile and diffusible antibiotics, which may provide them \nwith bioantagonistic properties. Strains SPS2, Z2-7, WBPR2 and SPR7 produced both \nvolatile and diffusible antibiotics, whilst BPS10 produced diffusible antibiotics only (Table \n3). There appeared to be a strong association between siderophore production and in vitro \nantagonism (Fig. 3), which was confirmed by point biserial correlation analysis (rpb = 0.88; P \n< 0.0001). There was also a significant, albeit weaker correlation, between antibiotic \nproduction and antagonism (Fig. 3; rpb = 0.56; P = 0.023). On the other hand, there was no \ncorrelation between antagonism and either chitinase (rpb = -0.31; P = 0.246) or protease (rpb = \n 14 \n-0.13; P = 0.639) production. Since the majority of strains exhibited bioantagonistic activity \nagainst M. grisea, we plotted disease index against bioantagonism for Super Basmati and \nAzucena (Fig 4). There was a significant correlation between in vitro antagonism and the \nsuppression of blast disease in Super Basmati, but not in Azucena. Hence, direct antagonistic \nactivity cannot account for the disease suppressing activity of the PGPR strains in both rice \ncvs tested. \n \n3.5 Ephiphytic and rhizospheric colonization. \nTo investigate colonisation of both roots and shoots of rice plants by our selected bacterial \nstrains, we performed an experiment on plants grown in sterile sand, since we had no way of \nidentifying the applied PGPR from amongst the microbial populations in the soil used in the \nfirst experiment. None of the bacterial strains were found to colonize plant leaf surfaces, \nsuggesting that direct bioantagonistic activity is not a contributing factor to the reduction in \nblast disease incidence. Table 5 shows the levels of rhizospheric colonisation by the different \nstrains at different times after soil inoculation. Bacterial populations varied considerably \nbetween strains, but colonisation by each strain (with the exception of WBPS5), was similar \nfor both rice cvs. Bacterial population density for bacterial strains Z2-7, SPR7, SPR4, SPR5, \nSPS2 and WBPS1 remained high throughout the experiment in roots of both rice cvs, while \nthat of the rest of the bacterial strains decreased substantially over time. We reasoned that \npersistence of the strains in the rhizosphere may account in part for the varied level of disease \nsuppression between different PGPR treatments. Hence, disease indices were calculated \nfollowing blast infection of PGPR-inoculated sand-grown plants as before. Although in \ngeneral, the degree of disease protection afforded by the PGPR in sand was less than that \nobserved for soil-grown plants, there was a similar effect of each strain on plants grown both \nin sand and soil. There were some exceptions to this in the case of Azucena, where strains \n 15 \nSPR4, WBPS3 and WBPR2, showed substantial differences in the level of disease \nsuppression in soil compared to sand. When we examined the relationship between \ncolonisation and blast disease, we found a significant correlation between rhizosphere \ncolonisation (at 25 d) and disease index for Super Basmati (Pearson r = -0.62; P = 0.01), but \nnot for Azucena (Pearson r = 0.057; P = 0.83). \n \n3.6 Species identification by partial 16S rRNA sequencing \nBacterial isolates that were found to be most effective in controlling rice blast both in vitro \nand in vivo (SPS2, BPS10, BPS12, Z2-7, SPR4, SPR5 and SPR7), were identified using \npartial 16S rRNA gene sequencing. The sequences obtained were compared with those in \npublic databanks, and on the basis of similarities with existing sequences, we were able to \nidentify most isolates at least to the genus level, as shown in Table 1. \n \n4. Discussion \nA variety of bioantagonistic bacteria, including members of the genera Azospirillum, \nAzotobacter, Azoarcus, Pseudomonas, Bacillus and Enterobacter, are known to colonize the \nrhizosphere of most of the cereals, including maize, rice and wheat, and can be used as plant \ngrowth promoters and biocontrol agents (Reinhold-Hurek et al., 1993; Betelho et al., 1998; \nNaureen et al., 2005). The scope of this investigation was to isolate, characterize and select \nnovel bacteria from the rice rhizosphere with potentially useful capabilities in terms of plant \ngrowth promotion and biological suppression of one of the most devastating rice pathogens, \nM. grisea. Rice disease suppression by biocontrol agents is governed by a multitude of \nfactors. The influence of these factors varies with the type of biocontrol agent, plant cultivar \nand the nature of the pathogen targeted for control (Schroth and Hancock, 1981). There are \ndifferent modes of action of biocontrol bacteria, such as inhibition of the pathogen by \n 16 \nantimicrobial compounds (antibiosis), competition for iron through production of \nsiderophores (Duffy and Défago, 1999), parasitism that may involve production of \nextracellular enzymes, (for example, chitinases and proteases that can lyse pathogen cell \nwalls), and induction of plant resistance mechanisms (Whipps, 2001).  \n \nHere, we have identified new strains from a range of bacterial species with potential as \nbiocontrol agents based on their ability to suppress the incidence of rice blast when they were \napplied to the roots. Many of the strains tested also show direct bioantagonistic activity \nagainst the rice blast fungus, M. grisea, which correlates with their ability to produce \nsiderophores and antibiotics. Several of the strains also produce hydrolytic enzymes, which \nare also likely to play a role in direct antagonism (Ordentlick et al., 1988; Chernin and Chet, \n2002; Kamensky et al., 2003). Epiphytic colonisation assays, however, suggest that under the \nconditions tested, there is likely to be no physical contact between the bioantagonistic \nbacteria and the pathogen on leaf surfaces. This suggests the induction of systemic resistance \nin rice by these bacterial strains. Induced systemic resistance (ISR) is a phenomenon whereby \ndisease resistance against foliar pathogens is enhanced by rhizospheric bacteria or other \nantagonists which are spatially separated from the pathogen (van Loon et al., 1998). ISR has \nbeen recognised in a number of plant species, including radish (Raphanus sativus L.; Leeman \net al., 1996b), Arabidopsis (van Wees et al., 1997), cucumber (Cucumis sativus L.; Chen et \nal., 1998), carnation (Dianthus caryophyllus L.; van Peer et al., 1991), and tomato (Solanum \nlycopersicum; Duijff et al., 1997). In rice, several bacterial strains have previously been \nidentified that improve rice blast resistance, (Krishnamurthy and Gnanamanickam 1998, \nSomeya et al. 2002, Yang et al. 2008, De Vleesschauwer et al. 2008). Our study substantially \nexpands the collection, and it will now be of interest to investigate the molecular and cellular \n 17 \nresponses of rice plants to inoculation with our PGPR strains and their subsequent responses \nto blast infection to confirm the involvement of ISR in the suppression of blast disease. \n \nInterestingly, siderophore production was correlated with blast resistance in soil-grown cv \nSuper Basmati plants, but not in cv Azucena. No significant correlation was found between \ndisease index and either antibiotic, chitinase or protease production. Iron availability and \nsiderophore production have previously been identified as important determinants of ISR in \nseveral other systems, (Leeman et al., 1996a; Press et al., 1997; Audenaert et al., 2002; \nMeziane et al., 2005). Notably, it was found recently that the pseudobactin siderophore of P. \nfluorescens WCS374r is required for the establishment of ISR against rice blast disease (De \nVleesschauwer et al. 2008). It will be of interest in the future to identify the siderophores \nproduced by our new strains, and to characterise their effects on plants and microbes in more \ndetail. However, it is clear that siderophores are not a primary determinant of the biocontrol \npotential of the PGPR tested, since there is no correlation between siderophore production \nand blast disease in Azucena. Indeed, the ability of individual strains to provide protection \nagainst blast disease varied considerably between the two cultivars, indicating a complex \ninteraction between the PGPR and different rice cultivars. Inter- and intraspecific variation in \nplant ISR responses to PGPR is something which is commonly observed (van Loon, 1997). \n \nThe different levels of disease suppression in both rice cultivars grown in soil and sand might \nbe due to the different colonization pattern and secretion of secondary metabolites by the \nrhizobacteria. Root colonization is a key factor contributing to the performance of bacterial \ninoculants - an introduced strain can only be effective in promoting plant growth and \nbiocontrol activity if it is capable of associating with the roots of the plant (Goddard et al. \n2001). In the present study, most of the bacterial strains were found to colonize well in the \n 18 \nrhizosphere of both of the rice cultivars. In general bacterial strains Z2-7, SPR4, SPR5 SPR7, \nSPS2 and WBPS1 were found to persist better than the other strains, and this might be the \nreason for the better performance of these bacteria in controlling blast disease and enhancing \nplant health. The persistence of these strains could be attributed to siderophore production, \nsince the soil iron concentration during the experiment was as low as 5 ug g-1(data not \nshown). However, as indicated above, the situation is likely to be more complex than this, \nsince whilst disease incidence, siderophore production and rhizosphere colonisation are all \ncorrelated in the case of Super Basmati, they are not for Azucena. \n \nSome additional important capabilities of practical utility shown by some of these bacterial \nisolates were IAA production and P-solubilization, which suggested that these bacteria could \nbe used as plant growth promoters (Paulina et al., 2001; Naureen et al., 2005). These \nproperties might be responsible for the significant differences in seedling growth provided by \nthe different bacterial strains, and suggests that these bacteria could be used as inoculants for \nrice to improve plant health and yield. Almost all of the bacterial strains were found to \npromote seedling growth (height and fresh weight) compared to control plants, but \ninterestingly, bacterial strains that most improved seedling growth in Super Basmati were not \nas effective on Azucena plants, and vice versa. As for the promotion of disease resistance, this \nmay be because bacterial association with roots of different plant cultivars is not only strain \nand species-specific, but also depends largely upon root exudates (Korhoenon et al., 1986; \nNaureen et al., 2005). \n \nThe use of natural or genetically modified micro-organisms as soil inocula for the \ndevelopment of sustainable cropping systems is a promising area for development. However, \nthe successful release and application of PGPR in the field has been impeded partly because \n 19 \nsoil is a complex matrix that is difficult to manipulate with respect to environment and \nindigenous microbial populations. Soil type has been found to affect the ability of PGPR to \ncolonize the rhizosphere or root-soil interface, and can account for the varying performance \nof PGPR in different systems (Suslow and Schroth, 1982; Horwarth et al., 1998). During our \nresearch, we also observed a difference in performance of various bacterial strains in \npromoting growth and controlling blast in plants grown in soil versus sand. Higher disease \nincidences were observed in plants grown in sand compared to soil, particularly for Super \nBasmati. However, the plants survived more than 46 d, which was similar to the plants grown \nin soil.  In the case of Azucena, some strains had very different impacts on disease, depending \nwhether plants were grown in soil or sand, consistent with the fact that plant-inoculum \ninteractions can be strongly influenced by soil type (Horwarth et al., 1998). This could be due \nto difference in soil texture, availability of nutrients and colonization pattern of the bacterial \nstrains in the roots in the two soil types used (Goddard et al. 2001). Soil quality factors and \ncarrier delivery systems should be important considerations in field trials to evaluating the \nperformance of bacterial inoculants for agricultural applications. Strains SPS2, WBPS1 and \nZ2-7 reported here provided high levels of blast protection across all plant cultivars and \ngrowth substrates tested, and are therefore good candidates for such trials. \n \n \nAcknowledgements \nWe are grateful to the Pakistan Higher Education Commission for the award of a PhD \nstudentship to Zakira Naureen. We are also thankful to Ms. Sumera Yasmin (Plant \nMicrobiology Division, NIBGE, Pakistan) for her help in physiological characterization of \nisolated bacteria, and for helpful comments on the manuscript. \n 20 \nReferences \n1. Audenaert, K., Pattery, T., Cornelis, P., Hofte, M., 2002. Induction of systemic resistance \nto Botrytis cinerea in tomato by Pseudomonas aeruginosa 7NSK2: Role of salicylic acid, \npyochelin, and pyocyanin. Mol. Plant-Microbe Int. 15, 1147-1156. \n2. Betelho, G.R., Guimaraes, V., De Bonis, M.,  Fonseca, M.E.F., Hagler, A.N.,  Hagler, \nL.C.M., 1998. Ecology of plant growth promoting strain of Pseudomonas fluorescens \ncolonizing the maize endosphere in tropical soil. World J. Microbiol. Biotechnol. 14, 499-\n504. \n3. Chen, C., Bélanger, R.R., Benhamou, N.,  Paulitz, T.C., 1998. Induced systemic \nresistance (ISR) by Pseudomonas spp. impairs pre- and post-infection development of \nPythium aphanidermatum on cucumber roots. Eur. J. Plant Pathol. 104, 877-886. \n4. Chernin, L.,  Chet, I., 2002. Microbial enzymes in biocontrol of plant pathogens and \npests. In: Burns, R.G.,  Dick, R.P. (Eds.), Enzymes in the environment: activity, ecology, \nand applications. Marcel Dekker, New York, pp. 171-225.  \n5. Compant, S., Duffy, B., Nowak, J., Clément, C.,  Barka E.A., 2005. Use of Plant Growth-\nPromoting Bacteria for Biocontrol of Plant Diseases: Principles, Mechanisms of Action, \nand Future Prospects. Appl. Environ. Microbiol. 71, 4951–4959. \n6. De Vleesschauwer, D., Bakker, P.A.H.M., Djavaheri, M.,  Hofte, M 2008. Pseudomonas \nfluorescens WCS374r-induced systemic resistance in rice against Magnaporthe oryzae is \nbased on pseudobactin-mediated priming for a salicylic acid-repressible multifaceted \ndefense response. Plant Physiol. 148: 1996-2012. \n7. Duffy, B. K.,  Défago, G., 1999. Environmental factors modulating antibiotic and \nsiderophore biosynthesis by Pseudomonas fluorescens biocontrol strains. Appl. Environ. \nMicrobiol. 65, 2429-2438. \n 21 \n8. Duijff, B.J., Gianinazzi-Pearson, V.,  Lemanceau, P., 1997. Involvement of the outer \nmembrane lipopolysaccharides in the endophytic colonization of tomato roots by \nbiocontrol Pseudomonas fluorescens strain WCS417r. New Phytol. 135, 325-334. \n9. Farmer, III, J.J., Arduino, M.J.,  Hickman-Brenner, F.W., 1992. The genera Aeromonas \nand Plesiomonas. In: Balows, A., Truper, H.G., Dworkin, M., Hardar, W.,  Schleifer, \nK.H. (Eds.), The Prokaryotes. Springer-Verlag, New York, pp. 3012-3045. \n10. Goddard, V.J., Bailey, M.J., Darrah, P., Lilley, A.K.,  Thompson, I.P., 2001. Monitoring \ntemporal and spatial variations in rhizosphere bacterial population diversity: A \ncommunity approach for the improved selection of rhizosphere competent bacteria. Plant \nand Soil 232, 181-193. \n11. Grimont, F.,  Grimont, P.A.D., 1992. The genus Enterobacter. In: Balows, A., Truper, \nH.G., Dworkin, M., Hardar, W.,  Schleifer, K.H. (Eds.), The Prokaryotes. Springer-\nVerlag, New York, pp. 2729-2815. \n12. Hameed, S., Yasmin, S., Malik, K.A., Zafar, Y.,  Hafeez, F.Y., 2004. Rhizobium, \nBradyrhizobium and Agrobacterium strains isolated from cultivated legumes. Biol. Fertil. \nSoils 39, 179-185. \n13. Hardy, R.W.F., Burns, R.C.,  Holsten, R.D., 1973. Application of acetylene reduction \nassay for measurement of nitrogen fixation. Soil Biol. Biochem. 90, 245-254.  \n14. Hassan, U., Mirza, M.S., Menhaz, S., Rasul, G.,  Malik, K.A., 1998. Isolation and \nidentification of diazotrophic bacteria from rice, wheat and kallar grass. In: Malik, K.A., \nMirza, M.S.,  Ladha, J.K. (Eds.), Nitrogen fixation with non-legumes. Kluwer Academic \nPublishers, Dordrecht, pp. 197-205.  \n15. Horwath, W.R., Elliott, L.F.,  Lynch, J.M., 1998. Influence of soil quality on the function \nof inhibitory rhizobacteria. Lett. Appl. Microbiol. 26, 87-92. \n 22 \n16. Kaiser, W.J., Harman, R.M.,  Weller, D.M., 1989. Biological control of seed rot and pre-\nemergence damping-off of chick pea with fluorescent Pseudomonads.  Soil Biol. \nBiochem. 21, 269-273. \n17. Kamensky, M., Ovadis, M., Chet, I.,  Chernin, L., 2003. Soil-borne strain IC14 of \nSerratia plymuthica with multiple mechanisms of antifungal activity provides biocontrol \nof Botrytis cinerea and Sclerotinia sclerotiorum diseases. Soil Biol. Biochem. 35, 323-\n331. \n18. Kazempour, M.N., 2004. Biological control of Rhizoctonia solani, the casual agent of rice \nsheath blight by antagonistc bacteria in greenhouse and field condition. Plant Pathol J. 3, \n88-96. \n19. Korhonen, T.K., Lasilla, E. N., Laakso, T.,  Haahtela, K., 1986. Adhesion of nitrogen \nfixing enteric bacteria to roots of grasses and cereals. Plant and Soil 90, 59-69. \n20. Krishnamurthy, K.,  Gnanamanickam, S.S., 1998 Induction of systemic resistance and \nsalicylic acid accumulation in Oryza sativa, L. in the biological suppression of rice blast \ncaused by treatments with Pseudomonas spp. World J. Microbiol. Biotechnol. 14, 935-\n937. \n21. Leeman, M., den Ouden, E.M., van Pelt, J.A., Dirkx, F.P.M., Steijl, H., Bakker, \nP.A.H.M.,  Schippers, B., 1996a. Iron availability affects induction of systemic resistance \nto Fusarium wilt of radish by Pseudomonas fluorescens. Phytopathol. 86, 149-155. \n22. Leeman, M., den Ouden, F.M., van Pelt, J.A., Cornelissen, C., Matamala-Garros, A., \nBakker, P.A.H.M.,  Schippers, B., 1996b. Suppression of Fusarium wilt of radish by co-\ninoculation of fluorescent Pseudomonas spp. and root-colonizing fungi. Eur. J. Plant \nPathol. 102, 21-31. \n23. Lowry, H.O., Rosebrough, N.J., Farr, A.G.,  Randall, R.J., 1951. Protein measurement \nwith Folin phenol reagent. J. Biol. Chem. 193, 265-275. \n 23 \n24. Manandhar, H.K., Lyngs Jorgensen, H.J., Mathur, S.B.,  Smedegaard-Peterson, V., 1998. \nSuppression of rice blast by preinoculation with avirulent Pyricularia oryzae and the non-\nrice pathogen Bipolaris sorokiniana. Phytopathol. 88, 735-739. \n25. Meziane, H., Van der Sluis, I., Van Loon, L.C., Hofte, M.,  Bakker, P.A.H.M., 2005. \nDeterminants of Pseudomonas putida WCS358 involved in inducing systemic resistance \nin plants. Mol. Plant Pathol. 6, 177-185. \n26. Miller, R.L.,  Higgins, V.J., 1970. Association of cyanide with infection of birdfoot trefoil \nby Stemphylium loti. Phytopathol. 60, 104-110.   \n27. Montealegre, J.R., Reyes, R., Pérez, L.M., Herrera, R., Silva, P.,  Besoain, X., 2003. \nSelection of bioantagonistic bacteria to be used in biological control of Rhizoctonia solani \nin tomato. Electronic J. Biotechnol. 6, 115-127.  \n28. Naureen, Z., Yasmin, S., Hameed, S., Malik, K.A.,  Hafeez, F.Y., 2005. Characterization \nand screening of plant growth promoting bacteria isolated from maize grown in Pakistani \nand Indonesian soil. J. Basic Microbiol. 45, 447-459. \n29. Okon, Y., Albercht, S.L.,  Burris, R.H., 1977. Methods for growing Azospirillum \nlipoferum and for counting it in pure culture and in association with plants. Appl. \nEnviron. Microbiol. 33, 85-88. \n30. Ordentlich, A., Elad, Y.,  Chet, I., 1988. The role of chitinase of Serratia marcescens in \nbiocontrol of Sclerotium rolfsii. Phytopathol. 78, 84-88.  \n31. Paulina, E.L., Bustillos-Cristales, R.,  Caballero-Mellado, J., 2001. Burkholderia, a genus \nrich in plant-associated nitrogen fixers with wide environmental and geographic \ndistribution. Appl. Environ. Microbiol. 67, 2790-2798. \n32. Pikovskaya, R.I., 1948. Mobilization of phosphorus in soil in connection with vital \nactivity of some microbial species. Microbiologiya  17, 362-370. \n 24 \n33. Press, C.M. Wilson, M., Tuzun, S.,  Kloepper J.W., 1997. Salicylic acid produced by \nSerratia marcescens 90-166 is not the primary determinant of induced systemic resistance \nin cucumber or tobacco. Mol. Plant-Microbe Int. 10, 761–768. \n34. Pumarino, A., 1995. Evaluación in vitro del control biológico de la Fusariosis del fréjol.  \nTesis (Memoria de Título Ingeniería Agraria). Santiago, Chile, Universidad de Chile, \nFacultad de Ciencias Agrarias y Forestales. \n35. Raupach, G.S.,  Kloepper, J.W., 1998. Mixtures of plant growth-promoting rhizobacteria \nenhance biological control of multiple cucumber pathogens. Phytopathol. 88, 1158-1164. \n36. Reinhold-Hurek, B., Hurek, T., Gillis, M., Hoste, B., Vancanneyt, M., Kersters, K.,  \nPeley, J., 1993. Azoarcus gen. nov., nitrogen-fixing proteobacteria associated with roots \nof Kallar grass (Leptochloa fusca (L.) Kunth) and description of two species., Azoarcus \nindigens sp. nov., and Azoarcus communis sp. nov. Int. J. Syst. Bacteriol. 43, 573-584. \n37. Schroth, M.N.,  Hancock, J.G., 1981. Selected topics in biological control. Annu. Rev. \nMicrobiol. 35, 453-476. \n38. Schwyn, B.,  Neilands, J.B., 1987. Universal chemical assay for detection and \ndetermination of siderophores. Anal. Biochem. 160, 40-47. \n39. Sharma, A., . Johri, B.N., 2002. Combat of iron deprivation through a plant growth \npromoting fluorescent Pseudomonas strain GRP3A in mung bean (Vigna ratiata L. \nWilzeck). Microbiol. Res. 158, 77-81. \n40. Someya, N., Nakajima, M., Hibi, T., Yamaguchi, I.,  Akutsu, K., 2002. Induced resistance \nto rice blast by antagonistic bacterium, Serratia marcescens strain B2. J. Gen. Plant \nPathol. 68, 177-182. \n41. Song, F.,  Goodman, R.M., 2001. Molecular biology of disease resistance in rice. Physiol. \nMol. Plant Pathol. 59, 1-11. \n 25 \n42. Sulsow, T.V., Schroth, M.N., 1982. Rhizobacteria of sugar beets: effects of seed \napplication and root colonization on yield. Phytopathol. 72, 199-206. \n43. van Loon, L.C., 1997. Induced resistance in plants and the role of pathogenesis-related \nproteins. Eur. J. Plant Pathol. 103, 753-765. \n44. van Loon, L.C., Bakker, P.A.H.M.,  Pieterse, C.M.J., 1998. Systemic resistance induced \nby rhizosphere bacteria. Annu. Rev. Phytopathol. 36, 453-483. \n45. van Peer, R., Niemann, G.J.,  Schippers, B., 1991. Induced resistance and phytoalexin \naccumulation in biological control of Fusarium wilt of carnation by Pseudomonas sp. \nWCS417r. Phytopathol. 81, 728-734. \n46. van Wees, S.C.M., Pieterse, C.M.J., Trijssenaar, A., Van't Westende, Y., Hartog, F.,  van \nLoon, L.C., 1997. Differential induction of systemic resistance in Arabidopsis by \nbiocontrol bacteria. Mol. Plant-Microbe Int. 10, 716-724. \n47. van Wees, S.C.M., Van der Ent, S.,  Pieterse, C.M.J., 2008. Plant immune responses \ntriggered by beneficial microbes. Curr. Opin. Plant Biol. 2008, 11, 1–6. \n48. Vincent, J.M., 1970. A manual for the practical study of root nodule bacteria. Blackwell \nScientific Publications, Oxford. \n49. Whipps, J.M., 2001. Microbial interactions and biocontrol in the rhizosphere. J. Exp. Bot. \n52, 487-511. \n50. Yasmin, S., Baker, M.A.R., Malik, K.A.,  Hafeez, F.Y., 2004. Isolation, characterization \nand beneficial effects of rice-associated plant growth-promoting bacteria from Zanzibar \nsoils. J. Basic Microbiol. 44, 241-252. \n51. Yang, D.C., Oyaizu, Y., Oyaizu, H., Olsen, G.J.,  Woese, E.R., 1985. Mitochondrial \norigins. Proc. Natl. Acad. Sci. USA 82, 4443-4447. \n 26 \n52. Yang, J.-H., Liu, H.-X., Zhu, G.-M., Pan, Y.-L., Xu, L.-P., Guo, J.-H., 2008. Diversity \nanalysis of antagonists from rice-associated bacteria and their application in biocontrol of \nrice diseases. J. Appl. Microbiol. 104, 91-104. \n53. Young, J.P.W., Downer, H.L.,  Eardly, D., 1991. Phylogeny of the phototrophic \nRhizobium strain BTAi1 by polymerase chain reaction-based sequencing of a 16S rRNA \ngene segment. J. Bacteriol. 173, 2271-2277. \n 27 \nTable 1. Morphological and physiological characterization and identification of bacterial isolates from rice grown in saline and non-saline soils.  \nStrain1 Gram Reaction Siderophore IAA\n2\n P solubilization2 Chitinase production \nProtease \nproduction \nIdentification by morphology3 \nor 16S rRNA sequencing \n(Accession no.) \nZ2-7 (a) + + + - + - Bacillus cereus (EF579778) \nSPR7 (b) - + + - - - Enterobacter sp. B41 \n(EF579777) \nSPR4 (b) - + + - - - Serratia marcescens \n(EF579774) \nSPR5 (b) - + - - + + Burkholderia xenovorans  \n(EF579772) \nSPS2 (c) + + + - + + Bacillus subtilis (EF579773) \nWBPS1 (d) - + - + - + 3Pseudomonas sp. \nWBPS2 (d) - - - - - - 3Pseudomonas sp. \nWBPS3 (d) - - - - + - 3Enterobacter sp. \nWBPS5 (d) - - - +++ + + 3Pseudomonas sp. \nWBPS6 (d) - + - + + - 3Pseudomonas sp. \nBPS10 (e) - + + + - - Aeromonas hydrophila \n(EF579776) \nBPS12 (e) - + - + + - Enterobacter sp. (EF579775) \nWBPR2 (f) + + - - - + 3Bacillus sp. \nWBPR4 (f) - - + - + + 3Enterobacter sp. \nWBPR5 (f) - - - - + + 3Enterobacter sp. \nWBPR8 (f) - - - +++ + + 3Pseudomonas sp. \n \n1Origin of bacterial isolates: (a) Zanzibaar soil (Sumera et al. 2004), (b) rice roots from rice grown in saline soil, (c) saline soil, (d) rhizosphere \nof rice grown in saline soil, (e) non-saline soil, (f) rice roots from rice grown in non-saline soil. \n2+; present, -; absent; +++; enhanced activity. \n3tentative identification based on colony and cell morphology. \n 28 \nTable 2. Effect of inoculation of different bacterial strains on seedling height, fresh \nweight (shoot) and no. of leaves of rice seedlings of the cultivars Super Basmati and \nAzucena \nMean shoot length (mm) Avg. Fresh shoot weight (g) \nStrain Super Basmati Azucena Super Basmati Azucena \nControl 214 ± 2.11 e 215.8 ± 3.18 e 6.4 ± 2.01 d 6.6 ± 0.89 de \nZ2-7 272 ± 1.52 b 235 ± 2.34 d 8.2 ± 1.89 c 7.4 ± 0.921d \nSPR7 297 ± 3.68 a 231 ± 1.81 d 9.04 ± 1.58 a 7.2 ± 0.74d \nSPR4 291 ± 2.71 a 244 ± 3.03 c 9.01 ± 1.84 a 7.8 ± 1.02 c \nSPR5 264 ± 4.13 c 246 ± 2.68 c 8.5 ± 1.82 b 8 ± 1.68 c \nSPS2 274 ± 1.61 b 243 ± 2.14 c 8.8 ± 0.91 b 7.8 ± 0.54 c \nWBPS1 280 ± 3.01 b 259 ± 1.28 b 8.9 ± 1.72 a 8.2 ± 0.83 b \nWBPS2 239 ± 2.11 d 271 ± 5.04 a 7.1 ± 2.21 d 8.4 ± 2.00 b \nWBPS3 276 ± 5.61 b 227 ± 4.26 d 8.6 ± 2.38 b 6.8 ± 1.12d \nWBPS5 281 ± 1.36 b 241 ± 3.12 c 8.9 ± 1.16 a 7.4 ± 1.06d \nWBPS6 264 ± 4.42 c 250 ± 7.14 b 8.4 ± 1.76 c 8.1 ± 2.46 b \nBPS10 251 ± 3.01 c 257 ± 2.11 b 8 ± 1.52 c 8.1 ± 0.68 b \nBPS12 296 ± 1.21 a 247 ± 1.36 c 9.02 ± 0.94 a 7.9 ± 0.74c \nWBPR2 280 ± 3.12 b 259 ± 4.01 b 8.8 ± 1.01 b 8.1 ± 1.65 b \nWBPR4 284 ± 5.01 b 254 ± 1.93 b 8.7 ± 2.32 b 7.9 ± 0.69c \nWBPR5 254 ± 2.38 c 234 ± 2.01 d 7.9 ± 1.82 c 6.9 ± 0.74d \nWBPR8 247 ± 5.24 c 271 ± 3.38 a 7.1 ± 1.22 d 8.8 ± 1.32 a \n \nLetters represent statistical groupings of the data defined by the Duncan multiple \nrange test. \n \n 29 \nTable 3. The effects of bacterial isolates on disease index in blast-inoculated rice cultivars Super Basmati and Azucena grown in soil and sand, \nand on fungal growth in vitro. \n Disease Index M. grisea growth inhibition \nStrain \nSuper Basmati \n(soil)1 \nSuper Basmati \n(sand)1 \nAzucena \n(soil)1 \nAzucena \n(sand)1 Dual culture2 \nDiffusible \nantibiotics2 \nVolatile \nantibiotics2 \nControl 2 ± 0.05 2 ± 0.01 2 ± 0.07 2 ± 0.02 0 0 0 \nZ2-7 0.6 ± 0.04 0.91 ± 0.11 0.55 ± 0.04 1.16 ± 0.03 95 ± 0.57 84 ± 1.22 68 ± 3.24 \nSPR7 1.26 ± 0.02 1.48 ± 0.01 1.4 ± 0.06 1.85 ± 0.05 90 ± 0.34 61 ± 0.62 42 ± 0.74 \nSPR4 1.2 ± 0.01 1.92 ± 0.03 0.25 ± 0.03 1.37 ± 0.06 95 ± 0.26 0 0 \nSPR5 1.05 ± 0.07 1.88 ± 0.02 0.35 ± 0.02 0.52 ± 0.02 98 ± 0.11 0 0 \nSPS2 0.65 ± 0.02 0.67 ± 0.01 0.4 ± 0.02 0.45 ± 0.01 100 ± 0.02 98 ± 2.24 100 ± 0.00 \nWBPS1 0.35 ± 0.03 0.88 ± 0.03 0.9 ± 0.03 0.73 ± 0.11 80 ± 0.32 0 0 \nWBPS2 0.8 ± 0.02 1.62 ± 0.12 0.6 ± 0.03 1.13 ± 0.01 10 ± 0.12 0 0 \nWBPS3 1.75 ± 0.05 2 ± 0.04 1.3 ± 0.04 0.35 ± 0.03 23 ± 1.03 0 0 \nWBPS5 2.01 ± 0.02 2 ± 0.21 0.7 ± 0.03 0.71 ± 0.02 49 ± 2.34 0 0 \nWBPS6 1.25 ± 0.05 2 ± 0.02 0.85 ± 0.05 1.06 ± 0.06 30 ± 1.14 0 0 \nBPS10 1.99 ± 0.02 2 ± 0.06 0.15 ± 0.09 0.25 ± 0.02 80 ± 2.04 46 ± 0.34 0 \nBPS12 0.5 ± 0.02 1.84 ± 0.07 0.55 ± 0.07 1.53 ± 0.15 100 ± 0.00 0 0 \nWBPR2 1.2 ± 0.06 1.9 ± 0.13 1.23 ± 0.21 0.11 ± 0.13 100 ± 0.00 0 0 \nWBPR4 2.01 ± 0.04 2 ± 0.17 0.25 ± 0.02 0.14 ± 0.02 10 ± 0.28 0 0 \nWBPR5 2.03 ± 0.15 2 ± 0.23 0.95 ± 0.02 1.3 ± 0.01 5 ± 0.06 0 0 \nWBPR8 1.55 ± 0.06 1.91 ± 0.01 2.05 ± 0.14 1.3 ± 0.01 2 ± 0.28 0 0 \n1. Disease Index; mean and standard deviation. \n2. Mean % and standard deviation. \n 30 \nTable 4. Mean percent survival of rice plants of cvs Super Basmati and Azucena grown in \nsoil and sand, 46 d after challenge inoculation with M. grisea. \n Super Basmati Azucena \nStrain Soil Sand Soil Sand \nControl 0 ± 0.00 0 ± 0.00 0 ± 0.00 0 ± 0.00 \nZ2-7 100 ± 0.04 100 ± 0.00 80 ± 0.13 71 ± 0.03 \nSPR7 100 ± 0.00 100 ± 0.00 40 ± 2.14 46 ± 1.00 \nSPR4 80 ± 0.01 75 ± 0.00 100 ± 0.03 80 ± 0.02 \nSPR5 100 ± 0.12 100 ± 0.32 80 ± 0.00 70 ± 0.40 \nSPS2 100 ± 0.02 100 ± 0.21 100 ± 0.14 95 ± 0.00 \nWBPS1 100 ± 1.00 100 ± 0.3 80 ± 1.30 85 ± 0.04 \nWBPS2 72 ± 0.03 79 ± 0.00 65 ± 0.04 80 ± 1.53 \nWBPS3 0 ± 1.33 4 ± 2.13 0 ± 0.00 2 ± 0.00 \nWBPS5 10 ± 2.01 15 ± 1.00 80 ± 0.41 76 ± 3.30 \nWBPS6 32 ± 2.12 31 ± 3.30 80 ± 0.00 82 ± 0.23 \nBPS10 80 ± 0.12 78 ± 0.20 100 ± 0.21 100 ± 0.34 \nBPS12 60 ± 0.43 58 ± 0.32 60 ± 0.31 60 ± 0.02 \nWBPR2 21 ± 3.01 21 ± 2.05 36 ± 4.03 37 ± 0.52 \nWBPR4 80 ± 0.00 80 ± 0.00 100 ± 0.00 100 ± 0.00 \nWBPR5 8 ± 4.00 8 ± 4.50 40 ± 0.00 31 ± 0.00 \nWBPR8 10 ± 4.13 10 ± 2.54 25 ± 0.44 22 ± 0.05 \n \n 31 \nTable 5. Rhizospheric colonization (cfu ml-1) of Super Basmati plants by various bacterial \nisolates at different time intervals.   \nStrain Super Basmati Azucena \n \n7 days 25 days 45 days 7 days 25 days 45 days \nZ2-7 4.5x109 5x109 5x108 4.5x109 4.5x108 4.1x108 \nSPR7 4.6x109 5.0x109 5.0x108 4.6x109 4.1x109 3.5x108 \nSPR4 4.5x109 5.0x109 5.0x108 4.5x109 5.0x109 5.0x109 \nSPR5 4.5x109 5.0x109 5.0x108 4.5x109 5.0x108 4.5x107 \nSPS2 4.5x109 5.0x109 5.0x108 4.5x109 5.0x109 5.0x109 \nWBPS1 4.5x109 5.0x109 5.0x108 4.5x109 4.4x109 4.5x108 \nWBPS2 4.2x109 4.0x108 4.1 x107 4.2x109 4.1 x106 3.1x106 \nWBPS3 4.3x109 2.0x103 2.0x103 4.3x109 2.0x103 1.0x102 \nWBPS5 4.1x109 3.0x104 2.0x102 4.1x109 3.8x107 3.2x106 \nWBPS6 4.5x109 2.6x105 2.1x105 4.5x109 3.6x107 3.9x106 \nBPS10 4.3x109 4.3x109 5.0x106 4.3x109 4.3x109 4.5x107 \nBPS12 4.5x109 4.0x108 3.0x105 4.5x109 4.1x108 2.3x105 \nWBPR2 4.5x109 3.0x105 3.0x105 4.5x109 4.1x105 3.3x105 \nWBPR4 4.1x109 4.0x108 4.1 x107 4.1x109 4.5x108 3.9x106 \nWBPR5 4.3x109 4.0x106 2.0x104 4.3x109 4.1x106 4.2x104 \nWBPR8 4.5x109 3.0x105 2.0x105 4.5x109 3.2x105 3.2x105 \n \n 32 \nFigures \n \n \n \nFigure 1. Relationship between the production of siderophores and antibiotics by \nrhizobacteria and disease index in blast-inoculated cvs Super Basmati and Azucena rice  \ngrown in soil. \n 33 \n \n \nFigure 2. Dual culture bioantagonistic assay for inhibition of blast fungus by selected \nbacterial strains. Fungal cultures are in the centre of the plate; bacterial inoculants around the \nperimeter. \n \n 34 \n \n \nFigure 3. Relationship between the production of siderophores and antibiotics by \nrhizobacteria and in vitro antagonism of growth of M. grisea. \n \n 35 \n \n \nFigure 4. Relationship between the ability of PGPR to suppress blast disease in cvs Super \nBasmati and Azucena rice and their in vitro antagonistic activity against the blast fungus, M. \ngrisea. Linear regression lines are shown as dashed lines, with r2 values and the probability \nfor the significance of the correlation shown in the inset boxes. \n \n"}