{"doi":"10.1111\/1467-6419.00112","coreId":"208506","oai":"oai:eprints.lse.ac.uk:18905","identifiers":["oai:eprints.lse.ac.uk:18905","10.1111\/1467-6419.00112"],"title":"Scarce or abundant?: the economics of natural resource availability","authors":["Neumayer, Eric"],"enrichments":{"references":[{"id":17235893,"title":"(eds.) Integrative Assessment of Mitigation, Impacts and Adaptation to Climate Change (pp. 353-377),","authors":[],"date":"1996","doi":null,"raw":"Nakicenovic, W.D. Nordhaus, R. Richels and F.L. Toth (eds.) Integrative Assessment of Mitigation, Impacts and Adaptation to Climate Change (pp. 353-377), Proceedings of a Workhop held on 13-15 October 1993, Laxenburg: International Institute for Applied Systems Analysis. 45 Bringezu, Stefan and Schütz, Helmut (1996) Analyse des Stoffverbrauchs der  deutschen  Wirtschaft  -  Status  quo,  Trends  und  mögliche Prioritäten  für  Maßnahmen  zur  Erhöhug  der Ressourcenproduktivität,  in:  Jörg  Köhn  and  Maria  Welfens  (eds.) Neue  Ansätze  in  der  Umweltökonomie  (pp.  230-251),  Marburg: Metropolis-Verlag. British  Petroleum  (various  years)  BP  Statistical  Review  of  World  Energy, London: British Petroleum.","cites":null},{"id":17235890,"title":"(eds.) Modeling and measuring natural resource substitution,","authors":[],"date":"1981","doi":"10.2307\/134986","raw":"Berndt, Ernst R. and Field, Barry C. (1981) (eds.) Modeling and measuring natural resource substitution, Cambridge (Mass.) MIT Press. 44 Berndt, Ernst R. and Wood, David O. (1975) Technology, Prices, and the Derived Demand for Energy, Review of Economics and Statistics 57 (3), 259-268.","cites":null},{"id":17235898,"title":"[1983] Energy-Capital Substitution: A General Equilibrium Analysis, Collaborative Paper, International Institute for Applied Systems Analysis Laxenburg","authors":[],"date":"1993","doi":null,"raw":"Chichilnisky,  Graciela  and  Heal,  Geoffrey  (1993)  [1983]  Energy-Capital Substitution: A General Equilibrium Analysis, Collaborative Paper, International Institute for Applied Systems Analysis Laxenburg 1983. In Geoffrey Heal (ed.), The Economics of Exhaustible Resources (pp. 390-401), Hants: Edward Elgar.","cites":null},{"id":17236054,"title":"13 An important assumption is that there is no depreciation of man-made capital. As Dasgupta and Heal","authors":[],"date":"1979","doi":null,"raw":"13 An important assumption is that there is no depreciation of man-made capital. As Dasgupta and Heal (1979, p. 226) indicate, the basic results would go through as well with capital depreciation as long as capital depreciates at less than an exponential rate. Note also that technical progress which Dasgupta and Heal exclude could counteract exponential capital depreciation. On this, see the discussion in section 5.","cites":null},{"id":17236046,"title":"4 It also holds for uncertainty if agents form rational expectations and there is a complete set of contingent forward markets. Neither is very realistic. See Graham-Tomasi, Runge and Hyde","authors":[],"date":"1986","doi":null,"raw":"4 It also holds for uncertainty if agents form rational expectations and there is a complete set of contingent forward markets. Neither is very realistic. See Graham-Tomasi, Runge and Hyde (1986).","cites":null},{"id":17236048,"title":"6 A recent study of Moazzami and Anderson","authors":[],"date":"1994","doi":null,"raw":"6 A recent study of Moazzami and Anderson (1994) finds empirical support for Slade’s (1982)  ‘U-shaped’ price trend hypothesis, however.","cites":null},{"id":17236052,"title":"8 The exponential reserve index is computed as ln(r.s+1)\/r, where r is the average rate of consumption growth and s is the static reserve index (see Meadows et al.","authors":[],"date":"1972","doi":null,"raw":"8 The exponential reserve index is computed as ln(r.s+1)\/r, where r is the average rate of consumption growth and s is the static reserve index (see Meadows et al. 1972, p.","cites":null},{"id":17235949,"title":"A Biophysical Analysis of the Energy\/Real GDP Ratio: Implications for Substitution and Technical Change,","authors":[],"date":"1992","doi":"10.1016\/0921-8009(92)90037-s","raw":"Kaufmann, Robert K. (1992) A Biophysical Analysis of the Energy\/Real GDP Ratio: Implications for Substitution and Technical Change, Ecological Economics 6 (1), 35-56.","cites":null},{"id":17235906,"title":"A Martingale Characterization of the Price of a Non-renewable Resource with Decisions Involving Uncertainty,","authors":[],"date":"1985","doi":"10.1016\/0022-0531(85)90047-x","raw":"Deshmukh, Sudhakar D. and Pliska, Stanley R. (1985) A Martingale Characterization of the Price of a Non-renewable Resource with Decisions Involving Uncertainty, Journal of Economic Theory 35 (2), 322-342.","cites":null},{"id":17235988,"title":"A Nested CES Approach to Capital-Energy Substitution,","authors":[],"date":"1986","doi":"10.1016\/0140-9883(86)90022-8","raw":"Prywes, Menahem (1986) A Nested CES Approach to Capital-Energy Substitution, Energy Economics 8 (1), 22-28.","cites":null},{"id":17235996,"title":"A Reexamination of the Role of Thermodynamics for","authors":[],"date":"1997","doi":"10.1016\/s0921-8009(97)00078-5","raw":"Söllner, Fritz (1997) A Reexamination of the Role of Thermodynamics for Environmental Economics, Ecological Economics 22 (3), 175-201.","cites":null},{"id":17235973,"title":"A Test of the Hotelling Valuation Principle,","authors":[],"date":"1985","doi":"10.1086\/261284","raw":"Miller, Merton H. and Upton, Charles W. (1985) A Test of the Hotelling Valuation Principle, Journal of Political Economy 93 (1), 1-25.","cites":null},{"id":17235936,"title":"A Test of the Theory of Exhaustible Resources,","authors":[],"date":"1991","doi":"10.2307\/2937909","raw":"Halvorsen, Robert and Tim R.Smith (1991) A Test of the Theory of Exhaustible Resources, Quarterly Journal of Economics 106 (1), 123-140.","cites":null},{"id":17236002,"title":"An almost practical step toward sustainability,","authors":[],"date":"1993","doi":"10.1016\/0301-4207(93)90001-4","raw":"Solow, Robert M. (1993a) An almost practical step toward sustainability, Resources Policy 19 (3), 162-172.","cites":null},{"id":17235987,"title":"Backstop Technology and Growth: Doomsday or Steady State?,","authors":[],"date":"1996","doi":"10.1006\/jeem.1996.0017","raw":"Prell,  Mark  A.  (1996)  Backstop  Technology  and  Growth:  Doomsday  or Steady State?, Journal of Environmental Economics and Management 30 (2), 254-264.","cites":null},{"id":17235910,"title":"Capital-Energy Substitution","authors":[],"date":"1980","doi":"10.2307\/1924746","raw":"Field, Barry and Grebenstein, Charles (1980) Capital-Energy Substitution in U.S. Manufacturing, Review of Economics and Statistics 62 (2), 207-212. 48 Fisher, Anthony C. (1979) Measures of Natural Resource Scarcity. In V. Kerry Smith (ed.), Scarcity and Growth Reconsidered (pp. 249-275), Baltimore: The Johns Hopkins University Press.","cites":null},{"id":17235897,"title":"Capital-Energy Substitution and the Multi-Level CES Production Funtion,","authors":[],"date":"1994","doi":"10.1016\/0140-9883(94)90014-0","raw":"Chang, Kuo-Ping (1994) Capital-Energy Substitution and the Multi-Level CES Production Funtion, Energy Economics 16 (1), 22-26. 46 Chiang, Alpha C. (1984) Fundamental Methods of Mathematical Economics, New York: McGraw-Hill.","cites":null},{"id":17235935,"title":"Concepts and Measures of Natural Resource Scarcity with a Summary of Recent Trends,","authors":[],"date":"1984","doi":"10.1016\/0095-0696(84)90005-6","raw":"Hall, Darwin C. and Hall, Jane V. (1984) Concepts and Measures of Natural Resource Scarcity with a Summary of Recent Trends, Journal of Environmental Economics and Management 11 (4), 363-379.","cites":null},{"id":17236045,"title":"course, Georgescu-Roegen was not so naive as to overlook the fact that the earth is not a closed system. He merely claimed that using solar energy needs more nonsolar energy input than is gained in energy eventually (Georgescu-Roegen","authors":[],"date":"1986","doi":null,"raw":"3 Of course, Georgescu-Roegen was not so naive as to overlook the fact that the earth is not a closed system. He merely claimed that using solar energy needs more nonsolar energy input than is gained in energy eventually (Georgescu-Roegen 1986, p. 23). While this might be true for the present, there is absolutely no reason to expect that this has to be true in the future as well.","cites":null},{"id":17235994,"title":"Do Markets Underprice Natural-Resource Commodities?, Working Paper Nr. 962,","authors":[],"date":"1992","doi":null,"raw":"Slade, Margaret E. (1992) Do Markets Underprice Natural-Resource Commodities?, Working Paper Nr. 962, Washington D.C.: The World Bank.","cites":null},{"id":17235879,"title":"Economic arguments on the sufficiency of natural resources,","authors":[],"date":"1984","doi":null,"raw":"Aage, Hans (1984) Economic arguments on the sufficiency of natural resources, Cambridge Journal of Economics 8 (1), 105-113.","cites":null},{"id":17235940,"title":"Economic Depreciation of Mineral Stocks and the Contribution of El Serafy.","authors":[],"date":"1993","doi":null,"raw":"Hartwick, John M. and Anja Hageman (1993) Economic Depreciation of Mineral Stocks and the Contribution of El Serafy. In Ernst Lutz (ed.), Toward Improved Accounting for the Environment (pp. 211-235), Washington D.C.: The World Bank. 50 Hotelling, Harold (1931) The Economics of Exhaustible Resources, Journal of Political Economy 39 (2), 137-175.","cites":null},{"id":17235965,"title":"Economic Growth Versus the Environment,","authors":[],"date":"1975","doi":null,"raw":"Lecomber,  R.  (1975)  Economic  Growth  Versus  the  Environment,  London: Macmillan.","cites":null},{"id":17235981,"title":"Economic Indicators of Resource Scarcity: A Critical Essay,","authors":[],"date":"1990","doi":"10.1016\/0095-0696(90)90057-6","raw":"Norgaard, Richard B. (1990) Economic Indicators of Resource Scarcity: A Critical Essay, Journal of Environmental Economics and Management 19 (1), 19-25.","cites":null},{"id":17235982,"title":"Economic Indicators of Resource Scarcity: A More Critical Reply,","authors":[],"date":"1991","doi":"10.1016\/0095-0696(91)90043-i","raw":"Norgaard, Richard B. (1991) Economic Indicators of Resource Scarcity: A More Critical Reply, Journal of Environmental Economics and Management 21 (2), 195-199.","cites":null},{"id":17235904,"title":"Economic Theory and Exhaustible Resources, Cambridge:","authors":[],"date":"1979","doi":"10.3386\/w0436","raw":"Dasgupta, Partha and Heal, Geoffrey (1979) Economic Theory and Exhaustible Resources, Cambridge: Cambridge University Press. 47 De Bruyn, S.M. and Opschoor, J.B. (1997) Developments in the Throughput-Income  Relationship:  Theoretical  and  Empirical  Observations, Ecological Economics 20 (3), 255-268.","cites":null},{"id":17235887,"title":"Economists, Scientists, and Environmental Catastrophe,","authors":[],"date":"1972","doi":null,"raw":"Beckerman, Wilfred (1972) Economists, Scientists, and Environmental Catastrophe, Oxford Economic Papers 24 (3), 327-344.","cites":null},{"id":17235888,"title":"Empirical Consequences of the Hotelling Principle.","authors":[],"date":"1995","doi":null,"raw":"Berck, Peter (1995) Empirical Consequences of the Hotelling Principle. In Daniel  W. Bromley (ed.), Handbook of Environmental Economics (pp. 202-221), Cambridge: Cambridge University Press.","cites":null},{"id":17235928,"title":"Energy and Economic Myths,","authors":[],"date":"1975","doi":"10.2307\/1056148","raw":"Georgescu-Roegen, Nicholas (1975) Energy and Economic Myths, Southern Economic Journal 41 (3), 347-381.","cites":null},{"id":17235895,"title":"Energy Efficiency and Economic Fallacies: A Reply,","authors":[],"date":"1992","doi":"10.1016\/0301-4215(92)90059-b","raw":"Brookes, Len (1992) Energy Efficiency and Economic Fallacies: A Reply, Energy Policy 20 (5), 390-393.","cites":null},{"id":17235953,"title":"Energy Saving Resulting from the Adoptions of More Efficient Appliances,","authors":[],"date":"1987","doi":"10.5547\/issn0195-6574-ej-vol8-no4-8","raw":"Khazzoom, J. Daniel (1987) Energy Saving Resulting from the Adoptions of More Efficient Appliances, The Energy Journal 10 (1), 85-89.","cites":null},{"id":17235941,"title":"Energy Use in US Manufacturing: The Impacts of the Energy Shocks on Sectoral Output, Industry Structure, and Energy Intensity,","authors":[],"date":"1991","doi":null,"raw":"Howarth, Richard B. (1991) Energy Use in US Manufacturing: The Impacts of  the  Energy  Shocks  on  Sectoral  Output,  Industry  Structure,  and Energy Intensity, Journal of Energy Development 14 (2), 175-191.","cites":null},{"id":17235976,"title":"Eric (1998a) Is Economic Growth the Environment’s Best Friend,","authors":[],"date":null,"doi":null,"raw":"Neumayer,  Eric  (1998a)  Is  Economic  Growth  the  Environment’s  Best Friend, Zeitschrift für Umweltpolitik und Umweltrecht 21 (2), 161-176.","cites":null},{"id":17235977,"title":"Eric (1998b) Preserving Natural Capital in a World of Uncertainty and Scarce Financial Resources,","authors":[],"date":null,"doi":"10.1080\/13504509809469967","raw":"Neumayer, Eric (1998b) Preserving Natural Capital in a World of Uncertainty and Scarce Financial Resources, International Journal of Sustainable Development and World Ecology 5 (1), 27-42.","cites":null},{"id":17235908,"title":"Extinction and Market Forces: Two Case Studies,","authors":[],"date":"1995","doi":"10.1016\/0921-8009(94)00075-7","raw":"Farrow, Scott (1995) Extinction and Market Forces: Two Case Studies, Ecological Economics 13 (2), 115-123.","cites":null},{"id":17236009,"title":"Factor Substitutability in Australian Manufacturing with Emphasis on Energy Inputs,","authors":[],"date":"1982","doi":"10.1111\/j.1475-4932.1982.tb00349.x","raw":"Turnovsky, Michelle, Folie, Michael and Ulph, Alistair (1982) Factor Substitutability in Australian Manufacturing with Emphasis on Energy Inputs, Economic Record 58 (160), 61-72 Trainer, F.E. (1995) Can Renewable Energy Sources Sustain Affluent Society?, Energy Policy 23 (12), 1009-1026.","cites":null},{"id":17236050,"title":"Farzin","authors":[],"date":"1995","doi":null,"raw":"7 See Farzin (1995) for a more detailed and technical analysis.","cites":null},{"id":17235932,"title":"Foresight and Expectations in","authors":[],"date":"1986","doi":"10.2307\/3146389","raw":"Graham-Tomasi, Theodore, Runge, C. Ford and Hyde, William F. (1986) Foresight and Expectations in Models of Natural Resource Markets, Land Economics 62, (3), 234-249.","cites":null},{"id":17235993,"title":"Grade Selection Under Uncertainty: Least Cost Last and Other Anomalies,","authors":[],"date":"1988","doi":"10.1016\/0095-0696(88)90018-6","raw":"331-369), Wisconsin: University of Wisconsin Press. 55 Slade, Margaret E. (1988) Grade Selection Under Uncertainty: Least Cost Last  and  Other  Anomalies,  Journal  of  Environmental  Economics  and Management 15 (2), 189-205.","cites":null},{"id":17235974,"title":"Growth and Antigrowth: What Are the Issues?. In","authors":[],"date":"1974","doi":null,"raw":"Mishan, Ezra J. (1974) Growth and Antigrowth: What Are the Issues?. In A.  Weintraub,  E.  Schwartz  and  J.  Richard  Aronson  (eds.)  The  economic growth controversy (pp. 3-38), London: Macmillan.","cites":null},{"id":17235934,"title":"Growth with Exhaustible Resources and a Materials-Balance Production Function,","authors":[],"date":"1990","doi":null,"raw":"Gross,  L.S.  and  Veendorp,  E.C.H.  (1990)  Growth  with  Exhaustible  Resources  and  a  Materials-Balance  Production  Function,  Natural  Resource Modeling 4 (1), 77-94.","cites":null},{"id":17235909,"title":"Hossein","authors":[],"date":"1995","doi":"10.2139\/ssrn.317959","raw":"Farzin, Y. Hossein (1995) Technological Change and the Dynamics of Resource  Scarcity  Measures,  Journal  of  Environmental  Economics  and Management 29 (1), 105-120.","cites":null},{"id":17236024,"title":"Indicators of Sustainable Development: Some Lessons from Capital Theory,","authors":[],"date":"1991","doi":"10.1016\/0921-8009(91)90051-f","raw":"Victor, Peter A. (1991) Indicators of Sustainable Development: Some Lessons from Capital Theory, Ecological Economics 4 (3), 191-213.","cites":null},{"id":17235930,"title":"Infinite Resources: The Ultimate Strategy,","authors":[],"date":"1984","doi":"10.1126\/science.223.4635.456","raw":"Goeller, H.E. and Zucker, A. (1984) Infinite Resources: The Ultimate Strategy, Science 223 (4635), 456-462.","cites":null},{"id":17236006,"title":"Information and Exhaustible Resources: A Bayesian Analysis,","authors":[],"date":"1989","doi":"10.1016\/0095-0696(89)90009-0","raw":"Swierzbinski, Joseph and Mendelsohn, Robert (1989) Information and Exhaustible  Resources:  A  Bayesian  Analysis,  Journal  of  Environmental Economics and Management 16 (3), 193-208.","cites":null},{"id":17235999,"title":"Intergenerational equity and exhaustible resources,","authors":[],"date":"1974","doi":"10.2307\/2296370","raw":"Solow,  Robert  M.  (1974a)  Intergenerational  equity  and  exhaustible  resources, Review of Economic Studies Symposium, 29-46.","cites":null},{"id":17235937,"title":"Intergenerational Equity and the Investing of Rents from Exhaustible Resources,","authors":[],"date":"1977","doi":"10.2307\/2297349","raw":"Hartwick, John  M.  (1977)  Intergenerational  Equity and the Investing of Rents from Exhaustible Resources, American Economic Review 67 (5), 972-974.","cites":null},{"id":17236001,"title":"Is the end of the world at hand?. In","authors":[],"date":"1974","doi":null,"raw":"Solow,  Robert  M.  (1974b)  Is  the  end  of  the  world  at  hand?.  In  A. Weintraub, E. Schwartz and J. Richard Aronson (eds.) The economic growth controversy (pp. 39-61), London: Macmillan.","cites":null},{"id":17236030,"title":"Is the Entropy Law Relevant to the Economics of Natural Resource Scarcity?,","authors":[],"date":"1991","doi":"10.1016\/0095-0696(91)90040-p","raw":"Young, Jeffrey T. (1991) Is the Entropy Law Relevant to the Economics of Natural  Resource  Scarcity?,  Journal  of  Environmental  Economics  and Management 21 (2), 169-179.","cites":null},{"id":17235882,"title":"Mathematical Analysis for Economists,","authors":[],"date":"1938","doi":"10.2307\/2225442","raw":"Allen, R.G.D. (1938) Mathematical Analysis for Economists, London: Macmillan.","cites":null},{"id":17236022,"title":"Microeconomic Analysis,","authors":[],"date":"1992","doi":null,"raw":"Varian, Hal R. (1992) Microeconomic Analysis, New York: Norton.","cites":null},{"id":17235880,"title":"Mineral Depletion, With Special Reference to Petroleum,","authors":[],"date":"1990","doi":"10.2307\/2109733","raw":"Adelman, M.A. (1990) Mineral Depletion, With Special Reference to Petroleum, Review of Economics and Statistics 72 (1), 1-10.","cites":null},{"id":17235989,"title":"Mineral Reserves: Projected Lifetimes and Security of Supply,","authors":[],"date":"1984","doi":null,"raw":"Ray, George F. (1984) Mineral Reserves: Projected Lifetimes and Security of Supply, Resources Policy 10 (2), 75-80.","cites":null},{"id":17235975,"title":"Modelling Natural Resource Scarcity Using the ‘Error-Correction’ Approach,","authors":[],"date":"1994","doi":"10.2307\/136184","raw":"Moazzami, B. and Anderson, F.J. (1994) Modelling Natural Resource Scarcity Using the ‘Error-Correction’ Approach, Canadian Journal of Economics 27 (4), 801-812.","cites":null},{"id":17235985,"title":"Natural Resource and Environmental Economics,","authors":[],"date":"1996","doi":null,"raw":"Perman, Roger, Ma, Yue and McGilvray, James (1996) Natural Resource and Environmental Economics, Harlow: Addison Wesley Longman.","cites":null},{"id":17235889,"title":"Natural Resource Prices: Will They Ever Turn Up?,","authors":[],"date":"1996","doi":"10.1006\/jeem.1996.0032","raw":"Berck,  Peter  and  Roberts,  Michael  (1996)  Natural  Resource  Prices:  Will They Ever Turn Up?, Journal of Environmental Economics and Management 31 (1), 65-78.","cites":null},{"id":17235948,"title":"Natural Resource Scarcity: Empirical Evidence and Public Policy,","authors":[],"date":"1980","doi":"10.1016\/0095-0696(80)90006-6","raw":"Johnson,  Manuel  H.,  Bell,  Frederick  W.,  and  Bennett,  James  T.  (1980) Natural  Resource  Scarcity:  Empirical  Evidence  and  Public  Policy, Journal of Environmental Economics and Management 7 (3), 256-271.","cites":null},{"id":17235990,"title":"Natural Resources in a High-Tech Economy — Scarcity Versus Resourcefulness,","authors":[],"date":"1992","doi":"10.1016\/0301-4207(92)90001-p","raw":"Scott, Anthony and Pearse, Peter (1992) Natural Resources in a High-Tech Economy — Scarcity Versus Resourcefulness, Resources Policy 18 (3), 154-166.","cites":null},{"id":17235938,"title":"Natural Resources, National Accounting and Economic Depreciation,","authors":[],"date":"1990","doi":"10.1016\/0047-2727(90)90002-y","raw":"Hartwick,  John  M.  (1990)  Natural  Resources,  National  Accounting  and Economic Depreciation, Journal of Public Economics 43 (3), 291-304.","cites":null},{"id":17235992,"title":"Natural Resources, Population Growth, and Economic Well-Being,","authors":[],"date":"1987","doi":null,"raw":"Slade,  Margaret  E.  (1987)  Natural  Resources,  Population  Growth,  and Economic Well-Being, in: D. Gale Johnson and Ronald D. Lee (eds.) Population Growth and Economic Development: Issues and Evidence (pp.","cites":null},{"id":17236008,"title":"Neoclassical Economic Growth Theory and ‘Sustainability’.","authors":[],"date":"1995","doi":null,"raw":"Toman, Michael A., Pezzey, John and Krautkraemer, Jeffrey (1995) Neoclassical Economic Growth Theory and ‘Sustainability’. In Daniel W. Bromley  (ed.)  Handbook  of  Environmental  Economics  (pp.  139-165), Cambridge: Cambridge University Press.","cites":null},{"id":17235899,"title":"On Complete Recycling,","authors":[],"date":"1996","doi":"10.1016\/s0921-8009(96)00059-6","raw":"Converse, A.O. (1996) On Complete Recycling, Ecological Economics 19 (3), 193-194.","cites":null},{"id":17235886,"title":"On the Possibility of Continuing Expansion of Finite Resources,","authors":[],"date":"1986","doi":"10.1111\/j.1467-6435.1986.tb00766.x","raw":"Baumol, William J. (1986) On the Possibility of Continuing Expansion of Finite Resources, Kyklos 39 (2), 167-179.","cites":null},{"id":17235902,"title":"On Wilfred Beckerman's Critique of Sustainable Development,","authors":[],"date":"1995","doi":"10.3197\/096327195776679583","raw":"Daly, Herman E. (1995) On Wilfred Beckerman's Critique of Sustainable Development, Environmental Values 4 (1), 49-55.","cites":null},{"id":17235901,"title":"Operationalizing sustainable development by investing in natural capital,","authors":[],"date":"1994","doi":null,"raw":"Daly, Herman E. (1994) Operationalizing sustainable development by investing in natural capital, in: A. Jansson, M. Hammer, C. Folke and R. Costanza (eds.) Investing in Natural Capital: the Ecological Economics Approach to Sustainability (pp. 22-37), Washington D.C.: Island Press, 22-37.","cites":null},{"id":17235970,"title":"Recycling of Matter.","authors":[],"date":"1994","doi":"10.1016\/0921-8009(94)90073-6","raw":"Mansson, B.A. (1994) Recycling of Matter. A Response, Ecological Economics 9 (3), 191-192.","cites":null},{"id":17235950,"title":"Recycling of Matter. Further Comments,","authors":[],"date":"1994","doi":"10.1016\/0921-8009(94)90075-2","raw":"Khalil, E.L. (1994) Recycling of Matter. Further Comments, Ecological Economics 9 (3), 193-194. 51 Khatib, Hisham (1995) Energy Intensity: a New Look, Energy Policy 23 (8), 727-729.","cites":null},{"id":17235905,"title":"Resource Conservation, Sustainability and Technical Change. In","authors":[],"date":"1988","doi":null,"raw":"Deadman, D. and Turner, R. Kerry (1988) Resource Conservation, Sustainability and Technical Change. In R. Kerry Turner (ed.), Sustainable Enironmental Management Principles and Practice (pp. 67-101), London: Bethaven.","cites":null},{"id":17235969,"title":"Robert (1798) An Essay on the Principle of Population,","authors":[],"date":null,"doi":"10.2307\/2173616","raw":"Malthus,  Thomas  Robert  (1798)  An  Essay  on  the  Principle  of  Population, London: J. Johnson.","cites":null},{"id":17236020,"title":"Scarcity and Growth Revisited,","authors":[],"date":"1995","doi":"10.1068\/a271815","raw":"Uri, N.D. and Boyd, R. (1995) Scarcity and Growth Revisited, Environment and Planning A 27 (11), 1815-1832.","cites":null},{"id":17235884,"title":"Scarcity and Growth Revisited.","authors":[],"date":"1979","doi":null,"raw":"Barnett, Harold J. (1979) Scarcity and Growth Revisited. In V. Kerry Smith (ed.), Scarcity and Growth Reconsidered (pp. 163-217), Baltimore: The Johns Hopkins University Press.","cites":null},{"id":17235885,"title":"Scarcity and Growth: The Economics of Natural Resource Availability, Baltimore: The Johns Hopkins University Press.","authors":[],"date":"1963","doi":"10.2307\/1055967","raw":"Barnett,  Harold  J.  and  Morse,  Chandler  (1963)  Scarcity  and  Growth:  The Economics of Natural Resource Availability, Baltimore: The Johns Hopkins University Press. 43 Barney, Gerald O. (1980) The Global 2000 Report to the President of the U.S. — Entering the 21st Century, A Report Prepared by the Council on Environmental Quality and the Department of State, New York: Pergamon Press.","cites":null},{"id":17235947,"title":"Stanley (1865) The Coal Question: An Inquiry Concerning the Prospects of the Nation and the Probable Exhaustion of Our Coal Mines,","authors":[],"date":null,"doi":"10.1017\/s0016756800197468","raw":"Jevons, William Stanley (1865) The Coal Question: An Inquiry Concerning the Prospects of the Nation and the Probable Exhaustion of Our Coal Mines, London.","cites":null},{"id":17235900,"title":"Steady-state economics — Second edition with new essays,","authors":[],"date":"1992","doi":"10.4337\/9781847206947.00019","raw":"Daly, Herman E. (1992) Steady-state economics — Second edition with new essays, London: Earthscan, first published in 1977.","cites":null},{"id":17235972,"title":"Stuart (1862)","authors":[],"date":null,"doi":"10.1037\/12186-000","raw":"Mill,  John  Stuart  (1862)  Principles  of  Political  Economy,  5th  ed.,  London: Parker, Son, and Bourn.","cites":null},{"id":17235984,"title":"Substitution and Sustainability: Some Reflections on Georgescu-Roegen,","authors":[],"date":"1997","doi":"10.1016\/s0921-8009(97)00087-6","raw":"Pearce, David W. (1997) Substitution and Sustainability: Some Reflections on Georgescu-Roegen, Ecological Economics 22 (3), 295-297.","cites":null},{"id":17235968,"title":"Substitution between Energy and Non-Energy Inputs in the Netherlands 1950-1976,","authors":[],"date":"1979","doi":"10.2307\/2526494","raw":"Magnus, J.A. (1979) Substitution between Energy and Non-Energy Inputs in the Netherlands 1950-1976, International Economic Review 2 (2), 465-484.","cites":null},{"id":17236004,"title":"Sustainability: An Economist's Perspective.","authors":[],"date":"1993","doi":null,"raw":"Solow, Robert M. (1993b) Sustainability: An Economist's Perspective. In R.","cites":null},{"id":17235967,"title":"Sustainable Energy for Tomorrow’s World — The Case for an Optimistic View of the Future,","authors":[],"date":"1996","doi":"10.1016\/0301-4215(96)00060-2","raw":"Lenssen, Nicholas and Flavin, Christopher (1996) Sustainable Energy for Tomorrow’s World — The Case for an Optimistic View of the Future, Energy Policy 24 (9), 769-781.","cites":null},{"id":17235907,"title":"Testing the Efficiency of Extraction from a Stock Resource,","authors":[],"date":"1985","doi":"10.1086\/261311","raw":"Farrow, Scott (1985) Testing the Efficiency of Extraction from a Stock Resource, Journal of Political Economy 93 (3), 452-487.","cites":null},{"id":17235891,"title":"The ‘Recycle of Matter’ Debate. Physical Principles versus Practical Impossibility,","authors":[],"date":"1996","doi":"10.1016\/s0921-8009(96)00060-2","raw":"Biancardi, C., Tiezzi, E. and Ulgiati, S. (1996) The ‘Recycle of Matter’ Debate.  Physical  Principles  versus  Practical  Impossibility,  Ecological Economics 19 (3), 195-196.","cites":null},{"id":17235896,"title":"The Adequacy of Measures for Signalling the Scarcity of Natural Resources.","authors":[],"date":"1979","doi":null,"raw":"Brown, Gardner M. and Barry C. Field (1979) The Adequacy of Measures for Signalling the Scarcity of Natural Resources. In V. Kerry Smith (ed.), Scarcity and Growth Reconsidered (pp. 218-248), Baltimore: The Johns Hopkins University Press.","cites":null},{"id":17235997,"title":"The capital-energy complementarity debate revisited,","authors":[],"date":"1987","doi":null,"raw":"Solow, John L. (1987) The capital-energy complementarity debate revisited, American Economic Review 77 (4), 605-614.","cites":null},{"id":17235939,"title":"The Economics of Natural Resource Use,","authors":[],"date":"1986","doi":"10.2307\/3146476","raw":"Hartwick, John M. and Olewiler, Nancy D. (1986) The Economics of Natural Resource Use, New York: Harper & Row.","cites":null},{"id":17235933,"title":"The Energy-Capital Complementarity Controversy: a Progress Report on Reconciliation Attempts.","authors":[],"date":"1981","doi":null,"raw":"Griffin,  James  M.  (1981)  The  Energy-Capital  Complementarity  Controversy: a Progress Report on Reconciliation Attempts. In Berndt, Ernst R. and Field, Barry C. (eds.) Modeling and Measuring Natural Resource Substitution (pp. 70-80), Cambridge (Mass.) MIT Press. 49 Griffin, James M. and Gregory, Paul R. (1976) An Intercountry Translog Model of Energy Substitution Responses, American Economic Review 66 (5), 845-857.","cites":null},{"id":17235929,"title":"The Entropy Law and the Economic Process in Retrospect,","authors":[],"date":"1986","doi":"10.4159\/harvard.9780674281653","raw":"Georgescu-Roegen, Nicholas (1986) The Entropy Law and the Economic Process in Retrospect, Eastern Economic Journal 12 (1), 3-25.","cites":null},{"id":17235911,"title":"The Entropy Law and the Economic Process, Cambridge:","authors":[],"date":"1971","doi":"10.4159\/harvard.9780674281653","raw":"Georgescu-Roegen, Nicholas (1971) The Entropy Law and the Economic Process, Cambridge: Harvard University Press.","cites":null},{"id":17235881,"title":"The Genie out of the Bottle: World Oil since 1970,","authors":[],"date":"1995","doi":"10.2307\/20047599","raw":"Adelman, M.A. (1995) The Genie out of the Bottle: World Oil since 1970, Cambridge (Mass.) MIT Press.","cites":null},{"id":17235894,"title":"The Greenhouse Effect: the Fallacies in the Energy Efficiency Solution,","authors":[],"date":"1990","doi":"10.1016\/0301-4215(90)90145-t","raw":"Brookes, Len (1990) The Greenhouse Effect: the Fallacies in the Energy Efficiency Solution, Energy Policy 18 (2), 199-201.","cites":null},{"id":17235971,"title":"The Limits to Growth,","authors":[],"date":"1972","doi":"10.1349\/ddlp.1","raw":"Meadows,  Dennis,  Meadows,  Donella,  Zahn,  Erich  and  Milling,  Peter (1972) The Limits to Growth, New York: Universe Books. 52 Meadows, Donella, Meadows, Dennis and Randers, Jorgen (1992) Beyond the Limits: Global Collapse or a Sustainable Future, London: Earthscan.","cites":null},{"id":17235903,"title":"The Optimal Depletion of Exhaustible Resources,","authors":[],"date":"1974","doi":"10.2307\/2296369","raw":"Dasgupta, Partha and Heal, Geoffrey (1974) The Optimal Depletion of Exhaustible Resources, Review of Economic Studies Symposium, 3-28.","cites":null},{"id":17235986,"title":"The Optimal Exploration and Production of Non-renewable Resources,","authors":[],"date":"1978","doi":"10.1086\/260714","raw":"Pindyck,  Robert  S.  (1978)  The  Optimal  Exploration  and  Production  of Non-renewable Resources, Journal of Political Economy 86 (5), 841-861. 54 Pindyck, Robert S. (1979) Interfuel Substitution and the Industrial Demand for  Energy:  An  International  Comparison,  Review  of  Economics  and Statistics 61 (2), 169-179.","cites":null},{"id":17235883,"title":"The Role of Technological Change,","authors":[],"date":"1980","doi":"10.1016\/0095-0696(80)90027-3","raw":"Ayres, Robert U. and Miller, Steven M. (1980) The Role of Technological Change, Journal of Environmental Economics and Management 7 (4), 353-371.","cites":null},{"id":17235980,"title":"Thermodynamic and Economic Concepts as Related to Resource-Use Policies: Synthesis,","authors":[],"date":"1986","doi":"10.2307\/3146398","raw":"Norgaard, Richard B. (1986) Thermodynamic and Economic Concepts as Related  to  Resource-Use  Policies:  Synthesis, Land  Economics  62 (3), 325-327.","cites":null},{"id":17235892,"title":"Toward a Fossil Free Future: The Technical and Economic Feasibility of Phasing Out Global Fossil Fuel Use. In","authors":[],"date":"1993","doi":null,"raw":"Boyle, Stewart (1993) Toward a Fossil Free Future: The Technical and Economic  Feasibility  of  Phasing  Out  Global  Fossil  Fuel  Use.  In  N.","cites":null},{"id":17235931,"title":"Toward a New Iron Age? — Quantitative Modeling of Resource Exhaustion, Cambridge (Mass.)","authors":[],"date":"1987","doi":"10.2307\/3105089","raw":"Gordon, Robert B., Koopmans, Tjalling, Norhaus, William D. and Skinner, Brian J. (1987) Toward a New Iron Age? — Quantitative Modeling of Resource Exhaustion, Cambridge (Mass.) Harvard University Press.","cites":null},{"id":17235991,"title":"Trends in Natural-Resource Commodity Prices: An Analysis of the Time Domain,","authors":[],"date":"1982","doi":"10.1016\/0095-0696(82)90017-1","raw":"Slade, Margaret E. (1982) Trends in Natural-Resource Commodity Prices: An Analysis of the Time Domain, Journal of Environmental Economics and Management 9 (2), 122-137.","cites":null},{"id":17235978,"title":"Weak Versus Strong Sustainability: Exploring the Limits of Two Opposing Paradigms,","authors":[],"date":"1999","doi":"10.4337\/9781849805438","raw":"Neumayer, Eric (1999) Weak Versus Strong Sustainability: Exploring the Limits of Two Opposing Paradigms, Cheltenham: Edward Elgar.","cites":null},{"id":17235983,"title":"What is Energy Efficiency?,","authors":[],"date":"1996","doi":"10.1016\/0301-4215(96)00017-1","raw":"Patterson, Murray G. (1996) What is Energy Efficiency?, Energy Policy 24 (5), 377-390.","cites":null},{"id":17236047,"title":"who explain the apparent contradictory results as follows: Miller and Upton","authors":[],"date":"1989","doi":null,"raw":"5 On this, see also Swierzbinski and Mendelsohn (1989) who explain the apparent contradictory results as follows: Miller and Upton (1985) demonstrate that stockholders use the Hotelling-rule at each moment of time to forecast the value of their stocks. That time-trend tests of the Hotelling-rule (e.g. Farrow 1985 and Halvorsen and Smith 1991) have generally failed to support the rule is due to the fact that because of dynamic uncertainty and consistent updating in information the true mean rate of change in the resource price persistently deviates from the deterministic Hotelling-rule.","cites":null},{"id":17236026,"title":"World Development Report","authors":[],"date":"1992","doi":"10.1596\/978-0-1952-0876-4","raw":"World Bank (1992) World Development Report 1992 — Development and the Environment, New York: Oxford University Press. 57 World Bank (1991) World Tables 1991, Washington D.C.: The World Bank.","cites":null},{"id":17235979,"title":"World Dynamics: Measurement without Data,","authors":[],"date":"1973","doi":"10.2307\/2230846","raw":"Nordhaus,  William  D.  (1973)  World  Dynamics:  Measurement  without Data, Economic Journal 83 (332), 1156-1183. 53 Nordhaus, William D. (1992) Lethal Model 2: The Limits to Growth Revisited, Brookings Papers on Economic Activity 0 (2), 1-59.","cites":null},{"id":17235946,"title":"World Economic Outlook 1997,","authors":[],"date":"1997","doi":"10.5089\/9781557756480.081","raw":"IMF (1997) World Economic Outlook 1997, Washington D.C.: International Monetary Fund.","cites":null},{"id":17236044,"title":"World Oil Reserves\/Production Ratio in years (right scale) World Oil Reserves in Thousand Million Barrels (left scale) FIGURE 2 (Eric Neumayer) 2 World Natural Gas Reserves in Trillion Cubic Metres World Gas Reserves\/Production Ratio in Years","authors":[],"date":"1977","doi":null,"raw":"Metals and Minerals Commodity Price Index (1977-79=100) FIGURE 1 (Eric Neumayer) 1 5 25 World Oil Reserves\/Production Ratio in years (right scale) World Oil Reserves in Thousand Million Barrels (left scale) FIGURE 2 (Eric Neumayer) 2 World Natural Gas Reserves in Trillion Cubic Metres World Gas Reserves\/Production Ratio in Years FIGURE 3 (Eric Neumayer) 3 0 20 40 60 80 100 120 140 160 Aluminium Copper Iron Lead Mercury Nickel Tin Zinc Oil Gas Coal Exponential Reserve Index (Years) FIGURE 4 (Eric Neumayer) 4 1965 1967 1969 1971 1973 1975 1977 1979 1981 1983 1985 1987 1989 1991 1993 1995 3,5 4,5 5,5 World Primary Energy Cons. in mill. tonnes oil equivalent (LS) OECD Primary Energy Cons. in mill. tonnes oil equivalent (LS) World Energy intensity (consumption\/GDP*10^4) (RS) OECD energy intensity (consumption\/GDP*10^4) (RS) OECD World World OECD FIGURE 5 (Eric Neumayer) 5 ENDNOTES 1 However, the rise in oil prices was clearly linked to the exercise of market power by OPEC and not to dramatically rising natural scarcity, although there is some evidence that prices had started rising before 1973 (Slade 1982, p. 136). For a history of world oil prices see Adelman (1995). 2 Some natural resources are scarce on this world in a physical sense. If they have no productive use, nobody cares about this scarcity, however. Scarcity in an economic sense I define to be excess demand for the resource at a given price.","cites":null},{"id":17236029,"title":"World Resources — a joint publication from the World Resources Institute, United Nations’ Environment Programme, United Nations’ Development Programme and the World Bank,","authors":[],"date":"1996","doi":"10.1080\/00139157.1989.9929942","raw":"WRI (1996-97) World Resources — a joint publication from the World Resources Institute, United Nations’ Environment Programme, United Nations’ Development Programme and the World Bank, Washington D.C..","cites":null},{"id":17236027,"title":"World Tables","authors":[],"date":"1995","doi":"10.1596\/0-8213-4368-8","raw":"World Bank (1995) World Tables 1995, Washington D.C.: The World Bank.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2000-07","abstract":"Most natural resources that are used in production are non-renewable. When they become depleted they are lost for future use. Does it follow that the limited availability of natural resources will at some time in the future constrain economic growth as many environmentalists believe? While classical economists have shared the belief in limits to growth, the distinctive feature of modern neoclassical economics is its optimism about the availability of natural resources. This survey suggests that resource optimism can be summarised in four propositions. First, a rise in the price of a resource leads to a substitution of this resource with another more abundant resource and to a substitution of products that are intensive in this resource. Second, a rise in the price of a resource leads to increased recycling of the resource and to the exploration and extraction of lower quality ores. Third, man-made capital can substitute for natural resources. Fourth, technical progress increases the efficiency of resource use and makes extraction of lower quality ores economical. In a critical analysis of these four propositions it is shown that while the conjecture that natural resources will never constrain future economic growth is logically conceivable, we do not and indeed cannot know whether it will be possible in practice to overcome any resource constraint","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/208506.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/18905\/1\/Scarce%20or%20abundant%28lsero%29.pdf","pdfHashValue":"5fe6b2565a2107e2ca4d87a4e186073410947ce6","publisher":"Blackwell Publishing","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:18905<\/identifier><datestamp>\n      2012-09-04T10:19:03Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4759<\/setSpec><setSpec>\n      74797065733D434F4C4C53:4C53455F435F454F<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/18905\/<\/dc:relation><dc:title>\n        Scarce or abundant?: the economics of natural resource availability<\/dc:title><dc:creator>\n        Neumayer, Eric<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:subject>\n        HC Economic History and Conditions<\/dc:subject><dc:description>\n        Most natural resources that are used in production are non-renewable. When they become depleted they are lost for future use. Does it follow that the limited availability of natural resources will at some time in the future constrain economic growth as many environmentalists believe? While classical economists have shared the belief in limits to growth, the distinctive feature of modern neoclassical economics is its optimism about the availability of natural resources. This survey suggests that resource optimism can be summarised in four propositions. First, a rise in the price of a resource leads to a substitution of this resource with another more abundant resource and to a substitution of products that are intensive in this resource. Second, a rise in the price of a resource leads to increased recycling of the resource and to the exploration and extraction of lower quality ores. Third, man-made capital can substitute for natural resources. Fourth, technical progress increases the efficiency of resource use and makes extraction of lower quality ores economical. In a critical analysis of these four propositions it is shown that while the conjecture that natural resources will never constrain future economic growth is logically conceivable, we do not and indeed cannot know whether it will be possible in practice to overcome any resource constraint.<\/dc:description><dc:publisher>\n        Blackwell Publishing<\/dc:publisher><dc:date>\n        2000-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/18905\/1\/Scarce%20or%20abundant%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Neumayer, Eric  (2000) Scarce or abundant?: the economics of natural resource availability.  Journal of Economic Surveys, 14 (3).  pp. 307-335.  ISSN 0950-0804     <\/dc:identifier><dc:relation>\n        http:\/\/www.blackwellpublishing.com\/journal.asp?ref=0950-0804<\/dc:relation><dc:relation>\n        10.1111\/1467-6419.00112<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/18905\/","http:\/\/www.blackwellpublishing.com\/journal.asp?ref=0950-0804","10.1111\/1467-6419.00112"],"year":2000,"topics":["GE Environmental Sciences","HC Economic History and Conditions"],"subject":["Article","PeerReviewed"],"fullText":"  \nEric Neumayer  \nScarce or abundant?: the economics of \nnatural resource availability \n \nArticle (Accepted version) \n(Refereed) \n \n \nOriginal citation: \nNeumayer, Eric (2000) Scarce or abundant?: the economics of natural resource availability. \nJournal of economic surveys, 14 (3). pp. 307-335. ISSN 0950-0804  \nDOI: 10.1111\/1467-6419.00112 \n \n© 2000 Blackwell Publishing \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/18905\/ \nAvailable in LSE Research Online: September 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \n \nScarce or Abundant? \nThe Economics of Natural Resource Availability \n \nPublished in: \nJournal of Economic Surveys, 14 (3), 2000, pp. 307-335 \n \n \n \nEric Neumayer \nDepartment of Geography and Environment, London School of Economics \nand Political Science, Houghton Street, London WC2A 2AE, United King-\ndom \nEmail: e.neumayer@lse.ac.uk \n \nCorrespondence address: Same address. \n \n1 \nKey words: \nNatural resources, scarcity, availability, substitution, technical progress \n \nJEL-classification: Q20, Q30, Q40 \n \nAbstract \nMost natural resources that are used in production are non-renewable. \nWhen they become depleted they are lost for future use. Does it follow \nthat the limited availability of natural resources will at some time in the \nfuture constrain economic growth as many environmentalists believe? \nWhile classical economists have shared the belief in limits to growth, the \ndistinctive feature of modern neoclassical economics is its optimism about \nthe availability of natural resoures. This survey suggests that resource op-\ntimism can be summarised in four propositions. First, a rise in the price of \na resource leads to a substitution of this resource with another more \nabundant resource and to a substitution of products that are intensive in \nthis resource. Second, a rise in the price of a resource leads to increased \nrecycling of the resource and to the exploration and extraction of lower \nquality ores. Third, man-made capital can substitute for natural resources. \nFourth, technical progress increases the efficiency of resource use and \nmakes extraction of lower quality ores economical. In a critical analysis of \nthese four propositions it is shown that while the conjecture that natural \nresources will never constrain future economic growth is logically con-\nceivable, we do not and indeed cannot know whether it will be possible in \npractice to overcome any resource constraint. \n2 \n1. Introduction \nModern concern that limited availability of natural resources will con-\nstrain the possibilities for consumption growth or, for that matter, even \nnon-declining consumption dates back at least to Malthus (1798). He was \nconvinced that the limitedness of land put an absolute scarcity constraint \non food consumption growth. While population rose at a geometric rate, \nthe production of food could only be expanded at an arithmetic rate, Mal-\nthus thought. Hence, he believed that population could grow only until \nthe minimum subsistence level of per capita food consumption was trans-\ngressed and had to decline sharply afterwards — only to grow and hit the \nabsolute scarcity constraint afterwards again in an apparently endless vi-\ncious circle. Later on, Jevons (1865) warned against a running out of coal \nas an energy resource and expressed concern about detrimental conse-\nquences of rising coal extraction costs on economic growth and the com-\npetitiveness of British industry. \nWe know by now, of course, that both had been wrong: population \ngrew tremendously in the 19th century and, even more than 130 years af-\nter Jevons’s alarm, worldwide proven reserves of coal in 1996 would last \nfor another 224 years at current consumption rates (British Petroleum \n1997, p. 30). Moreover, coal is not seen as an essential resource anymore. \nMalthus and Jevons committed mistakes other resource pessimists re-\npeated later on. Malthus did not consider the power of technical progress \nand he was not aware of the fact that, as Ricardo (1817) first realised, land \navailability is more a question of relative as opposed to absolute scarcity, \n3 \ni.e. land is a heterogeneous resource and it is possible to get the same \namount of nutrition out of an ever lower quality acre by investing increas-\ning inputs. Jevons, for his part, underestimated the scope for exploration \nand finding new reserves of coal and neglected the powerful possibilities \nof substituting other energy resources for coal. One has to keep in mind, \nhowever, that concern about the availability of natural resources was \ndeeply rooted in mainstream economic thinking by that time and many \nclassical economists, most notably Mill (1862) and Ricardo (1817) shared \nthe belief that the economy had to stop growing sooner or later due to a \nresource constraint (Barbier 1989, chapter 1). In those days economics had \na reputation as a „dismal“ science (Barnett and Morse 1963, p. 2). \nIt was not before the so-called marginal revolution and the rise of neo-\nclassical economics at the turn of the century, mainly due to Marshall, \nWalras and Fisher, that concern about resource availability vanished. In its \nleading macroeconomic metaphor, the income-expenditure-cycle, the de-\npletion of natural resources is non-existent in a seemingly endless circular \nexchange of labour which produces goods to receive income which is in \nturn exchanged for the produced goods. Reality seemed to buttress this \nnew thinking: the economy kept on growing, especially in the ‘golden \nyears’ after the Second World War and even if it did not, as in the Great \nDepression, the reasons were no longer sought in limited natural re-\nsources. \nConcern about natural resource availability emerged again with the \npublication of the Club of Rome’s ‘Limits to growth’-report (Meadows et \n4 \nal. 1972). This concern became popular and widespread after the quadru-\npling of world oil prices, as OPEC first boycotted the U.S. and the Nether-\nlands for their support of Israel in the Yom-Kippur-War in 1973 and soon \nlearned to exercise leverage over the OECD-countries.1 Meadows et al. \nprophesied that the exhaustion of essential mineral and energy resources \nwould make economic growth infeasible some time in the next century. \nTherefore, a halt to economic growth and even an eventual economic con-\ntraction might be enforced through resource scarcity. Essentially the same \nmessage was echoed by the Global 2000 Report to the President of the U.S. \nin 1980 (Barney 1980) and twenty years after their first report Meadows et \nal. published an updated, but hardly revised restatement of their argu-\nment (Meadows et al. 1992). \nEconomists, contrary to the wider public, this time did not share the \nconcern about resource availability. Only some ‘outsiders’, regarded as \neccentrics by the mainstream economist community, had sympathy with \nthe report’s motivation and goal (Daly 1992, first published in 1977; Geor-\ngescu-Roegen 1971, 1975; Mishan 1974), without overlooking the criticisms \nthat could be raised against it. In economic terms Meadows et al. were \nsimply naive in extrapolating past trends without considering how techni-\ncal progress and a change in relative prices can work to overcome appar-\nent scarcity limits. This criticism was put forward vigorously in a fierce \nattack by neoclassical economists who rejected the report(s) as pure non-\nsense (Beckerman 1972, 1974; Solow 1974b; Nordhaus 1973, 1992). For \nthem the depletion of non-renewable resources had to be tackled with tra-\n5 \nditional economic instruments and had to be taken on board by neoclassi-\ncal economics (Solow 1974a,c, Dasgupta and Heal 1974, Stiglitz 1974) — \nbut limits to growth due to resource constraints were a non-problem. \nThis resource optimism of neoclassical economics is mirrored in what \nhas become known as a paradigm of sustainable development called \n‘weak sustainability’ (Solow 1974a, 1993a, 1993b; Hartwick 1977, 1990). \nWhile being concerned about the welfare of future generations, this para-\ndigm essentially assumes full substitutability of ‘natural capital’ in that the \ndepletion of natural resources can be compensated via investments into \nother forms of capital. Indeed, the fact that weak sustainability shares the \nresource optimism of neoclassical economics should come as no surprise \nas it can be interpreted as an extension to traditional neoclassical welfare \neconomics (see Neumayer 1999 for more detail). \nSo far, the pessimists have been wrong in their predictions. But one \nthing is also clear: to conclude that there is no reason whatsoever to worry \nis tantamount to committing the same mistake the pessimists are often \nguilty of — that is the mistake of extrapolating past trends. The future is \nsomething inherently uncertain and it is humans’ curse (or relief, if you \nlike) not to know with certainty what the future will bring. The past can be \na bad guide into the future when circumstances are changing. That the \nalarmists have regularly and mistakenly cried ‘wolf!’ does not a priori im-\nply that the woods are safe. \nAre natural resources scarce or abundant? Will they ever constrain \neconomic growth? Can they easily be substituted for by man-made capital \n6 \nand technical progress? These are the central questions addressed in this \nsurvey of the economics of natural resource availability. The distinctive \nfeature of mainstream modern economic thinking is its optimism about \nthe availability of natural resources. Simplifying somewhat, I would sug-\ngest that resource optimism can be summarised in the following four \npropositions: \n \nThe resource optimists’ creed \n \nIf some resource A is becoming scarce in an economic sense2 its price will \nrise which triggers the following four mutually non-exclusive effects: \n \na) Demand shifts away from resource A and another resource B becomes \neconomical and substitutes for resource A. Similarly, demand shifts \naway from products that are intensive in resource A. \nb) It becomes economical to explore and extract as well as recycle more of \nresource A. As a consequence, the price of resource A will decline \nagain, thus signalling an ease in economic scarcity. \nc) Man-made capital will substitute for resource A. \nd) More effort is put into technical and scientific progress in order to re-\nduce the necessary resource input per unit of output. Also technical and \nscientific progress make resource-extraction cheaper and thus the ex-\ntraction of a resource’s lower-quality ores economical. As a conse-\nquence prices will decline again, signalling an ease in economic scarcity. \n7 \n \nIf resource optimism is correct, then there is no need to worry about \nthe doomsayer’s prediction of a ‘running out’ of resources: Either the \nworld will not be running out of the resource or it will not matter if it does \nsince another resource or man-made capital will function as a substitute. \nThis survey critically examines each proposition of resource optimism. \nSection 2 examines the possibilities of substituting one natural resource \nthrough another one. Section 3 looks at the role prices play in making in-\ncreased exploration, extraction of low-grade ores and recycling of re-\nsources economical. Section 4 analyses the substitution possibilities of re-\nsources through man-made capital. Section 5 examines how technical pro-\ngress contributes to overcoming resource constraints. Section 6 concludes. \nNote that this survey only addresses the scarcity of natural resources as \nan input into the production of consumption goods. It does not look at the \nrole nature plays in absorbing pollution and waste and generating direct \nutility to individuals through environmental amenities. The two aspects \nare certainly linked due to the first law of thermodynamics (conservation \nof mass) which implies that no material can be destroyed, it can only be \ntransformed into other material, waste or pollution. But whether or not \nbinding constraints to economic activity are likely to arise from a scarcity \nof these ‘ecological resources’ is distinct from the availability of natural \nresources for production purposes and should best be left to a separate \nsurvey (see Neumayer 1998a, 1998b). \n8 \nAlso note that the availability of food resources is not surveyed here. \nIndeed, given the focus on natural resources used in the production of \nconsumption goods, the survey mainly looks at non-renewable resources \nas these are by far more important for production purposes than renew-\nable resources. For the German economy, e.g., Bringezu and Schütz (1996, \np. 4) estimate that the ratio of non-renewable to renewable resource intake \nis 50:1 in terms of weight. \n \n2. Substitution through other resources \nLet us first look at proposition a) of resource optimism which essentially \nsays that a resource B will substitute for resource A if the latter is running \nout either directly or indirectly as demand shifts away from consumption \ngoods that are intensive in resource A towards goods that are intensive in \nsome other resource B. If the proposition is correct, then there is no need \nto worry about the depletion of resource A and since A could be any re-\nsource, there is no need to worry about the depletion of any resource at \nall. The point is that the depletion of a resource does not matter economi-\ncally if it is or becomes unnecessary for production. It was this Beckerman \n(1972, p. 337) had in mind when he commented rather cynically on the \nfirst „Limits to Growth“-report: \n \nWhy should it matter all that much whether we do run out of some raw \nmaterials? After all (...) economic growth has managed to keep going up \n9 \nto now without any supplies at all of Beckermonium, a product named af-\nter my grandfather who failed to discover it in the nineteenth century. \n \nConversely, the existence of a resource does not matter economically as \nlong as it is without an economic use. As Ray (1984, p. 75) observes: \n \nAll materials used by industry were ‘new’ at some point in history; they \nhave become ‘resources’ as a result of scientific and technological advance \ndiscovering them and developing their use. Bauxite did not even have a \nname before it was discovered that it could be processed into a new metal: \naluminium. \n \nIt is clear, that proposition a) taken to its logical limit only applies to \nresources B that are quasi-undepletable, be they renewable or non-\nrenewable. An example of the former is renewable energy from solar in-\nflux that will provide its daily service for a very long time to come. An \nexample of the latter is cold fusion, which is based on a non-renewable \nresource and which might provide services some time in the future at rea-\nsonable costs without an immediate or even intermediate risk of running \nout. These two examples make clear that ultimately resource B must be \nsomething close to a ‘backstop technology’, i.e. a resource that can provide \nservices at constant marginal costs in infinite amount (Dasgupta and Heal \n1974). If such a resource exists, then the economy can be saved from \ndoomsday for an indefinite time (Prell 1996). \n10 \nIs a backstop technology possible? Strictly speaking, neither of our two \nexamples is really a backstop technology, because the amount of services \npotentially provided, although very huge indeed, is still finite. Presuma-\nbly, there cannot be any backstop technology in the strict sense, because \nthe first law of thermodynamics (conservation of mass) states that energy \ncannot be created anew and because the second law of thermodynamics \nstates that entropy in a closed system is monotonically increasing over \ntime, i.e. energy is used up and cannot be used over and over again (Söll-\nner 1997, pp. 181, 183). For all human relevance the universe is a closed \nsystem. But note: it is the universe that is a closed system, not the earth \nitself which is an open system in the sense that it is getting a steady, con-\nstant, finite influx of energy from the sun. It is a closed system only in so \nfar as it does not exchange matter with the outside. Georgescu-Roegen’s \n(1975, p. 370) suggestion that every car built today implies ‘fewer plow-\nshares for some future generations, and implicitly, fewer future human \nbeings, too’ due to the laws of thermodynamics is not correct in a system \nthat receives a steady, constant, finite influx of energy where it is not com-\npelling that entropy permanently increases. 3 \nNow, cold fusion may remain a natural scientist’s dream forever, but \nsolar energy comes close to a backstop technology for energy resources — \nat least in principle: the solar energy influx exceeds current total world \nenergy demand at about three orders of magnitude (Norgaard 1986, p. \n326). Whether this vast energy influx can be used at reasonable economic \ncosts is less clear, however. Lensson and Flavin (1996, p. 772) optimisti-\n11 \ncally suggest that, due to rapidly declining provision costs, solar and wind \nenergy as well as geothermal technologies will become fully competitive \nto fossil energy resources in the near future. They believe that the current \nenergy infrastructure which is mainly based on oil, gas and coal will be \ngradually replaced by an energy infrastructure based mainly on solar en-\nergy and other renewables and using hydrogen as the medium to transfer \nprimary energy to final energy users. They project world primary energy \nuse to rise by slightly less than 50% from 1990 to 2050 and project about \nhalf of this energy demand to be provided by renewables in 2050 and \nmore than 85% in 2100 (Lensson and Flavin 1996, p. 775). Boyle (1993) \nfrom the energy policy and research unit of Greenpeace International pro-\nvides a similar optimistic view. \nA different picture is painted by Trainer (1995) who represents the op-\nposite, pessimistic view. He believes that the prospects of renewable re-\nsources providing sufficient energy at reasonable economic costs are \nvastly over-estimated in neglecting difficulties of „conversions, storage \nand supply“ of renewable resources „for high latitudes“ (Trainer 1995, p. \n1009). He suggests that if the world must depend on renewable energy \nresources only, then it „must be based on materially simple lifestyles, a \nhigh level of local economic self-sufficiency, and a steady-state or zero-\ngrowth economy“ (Trainer 1995, p. 1025). \nWhich of the two projections will be closer to future reality, we do not \nknow. Projections are highly dependent on prophesying the future devel-\nopment of scientific and technical progress, the future growth of the \n12 \neconomies, populations and world energy demand, and on predicting fu-\nture changes in energy and environmental policies. Beyond the very im-\nmediate time span, these projections necessarily become closer and closer \nto sophisticated guesses and speculations lacking a sound and reliable sci-\nentific basis. Mistakes in past projections represent a case in point: many \nreports in the early 1970s overestimated the amount of nuclear power the \nworld would be using in the mid-1990s by a factor of six, while leading \nstudies in the early 1980s overestimated the cost of a barrel of oil by al-\nmost a factor of five (Lenssen and Flavin 1996, p. 770). These flawed esti-\nmates should remind us that our ability to project world energy supply \nand its composition, world energy demand and prices is very limited in-\ndeed in the intermediate and distant future. \nSo far we have only dealt with energy resources. Whether solar energy \nand other renewable energy resources can substitute for nonrenwable \nnon-energy resources is even less clear. Direct substitution possibilities \nmight be low, but a backstop energy technology has another advantage as \nwell: if it provides services at not too high costs it can boost the availabil-\nity of other resources that can be extracted economically — at least if we \nassume that ever lower quality ores can be extracted with ever rising en-\nergy and other inputs and that the costs of extraction do not rise steeply \nand rapidly towards infinity. It was this that Adelman (1990, p. 1) referred \nto in stating that „the total mineral in the earth is an irrelevant non-\nbinding constraint“, for the question really is whether it will be possible or \nnot to extract ever more resources from ever lower quality ores at reason-\n13 \nable economic costs. Energy is the one and only real limiting factor in the \nlong run, because given enough energy there will always be enough natu-\nral non-energy resources extractable from the crust of the earth. \nHowever, there does not seem to exist any serious study that has tried \nto compute the prospects of backstop technologies to substitute on a large \nscale for the depletion of non-energy resources in the long run or to facili-\ntate the mining of resource ores of low concentration — which would be \nan overwhelming task and presumably therefore has not been attempted \nyet. What we have are more or less optimistic statements, but no compre-\nhensive, detailed analysis — see, e.g., Gordon et al. (1987), Scott and \nPearse (1992), Beckerman (1995) or Goeller and Zucker (1984, p. 456) who \nassure the reader that they \n \n...believe that, with a few exceptions, the world contains plentiful retriev-\nable resources that can supply mankind with the necessary materials for \nthe very long term, and that these resources can probably be extracted \nand converted to useful forms indefinitely with acceptable environmental \nconsequences and within the boundaries of foreseeable economic con-\nstraints. \n \n \n3. The role of prices in overcoming resource constraints \nLet us look at proposition b) now. It highlights more than any of the other \nthree propositions the role resource prices play in overcoming resource \n14 \nconstraints. Prices serve different functions in an economy, the most im-\nportant being that they signal economic scarcity and that they act as a co-\nordination mechanism pushing the economy towards efficiency and trig-\ngering technical progress. That the pessimists have persistently either ig-\nnored or downplayed the role that prices play in easing resource con-\nstraints, allowed a former economics professor of mine to make the ironic \ncomment that the world has already run out of oil many times — appar-\nently without any dramatic damage. It is utterly naive, as Meadows et al. \n(1972) and many others have done, to compare current amounts of re-\nsource use with current proven reserves and simply extrapolate from the \npast that hence the resource will be depleted in x years. For the gradual \ndepletion of a resource affects its price which affects supply and demand \nto which the economy adapts permanently. This dynamic process makes \nmockery out of simple-minded static computations of a resource’s remain-\ning life-time. \nThe Hotelling (1931) rule highlights the role prices play in the econom-\nics of resource availability. The rule says that, under some restrictive as-\nsumptions (on which more will be said later on), the resource rent (that is \nthe price of the resource for the marginal unit minus the marginal cost for \nextracting this unit) must in a perfectly competitive economy rise at a rate \nequal to the interest rate for a given stock of a non-renewable resource. \nThe resource rent can be interpreted as the net marginal profit for the re-\nsource owner and is often called ‘Hotelling rent’. \n15 \nThe intuitive reason why the rule must hold in a context of rational \nutility maximising agents is as follows: imagine otherwise, e.g., that the \nresource rent rose at a rate lower than the interest rate. Then it would pay \nthe resource owner to liquidate more of the resource, deposit his receipts \nin a bank and earn interest on his account — which gives him a higher net \nrate of return than leaving the resource in the ground since by assumption \nresource rents rise at a lower rate than the interest rate. It would pay to \nliquidate more of the resource up until marginal extraction costs rise so \nmuch that the resource owner is just indifferent between extracting a mar-\nginal resource unit and leaving this unit in the ground. It might be profit-\nable to even liquidate the whole resource stock! Now imagine instead that \nthe resource rent rose at a higher rate than the interest rate. Then it would \npay the resource owner to leave more of the resource in the ground in or-\nder to extract it later on, thus getting a higher net rate of return than if he \nhad extracted the resource right now and had put the receipts in a bank \naccount. The deeper reason why the Hotelling-rule must hold is that for \nthe resource owner a stock of non-renewable resource is just another asset \nin his portfolio, so it has to earn an equal net rate of return as the other \nportfolio-assets do. Hence equilibrium is where resource rent rises at a \nrate equal to the interest rate. \nThat the resource rent rises at the interest rate holds true more gener-\nally, however, only in a setting of certainty about e.g. the size of the re-\nsource stock, the date of exhaustion, the existence and marginal costs of a \nbackstop technology etc.4 Deshmukh and Pliska (1985) show that the re-\n16 \nsource rent need not rise at the rate of interest if uncertainty is introduced. \nOne important aspect is the exploration of new reserves. Pindyck (1978) is \nthe seminal paper showing how prices (and resource rent) can fall over \ntime as the exploration of new reserves increases the available resource \nstock. The resource rent is responsive to changes in the underlying eco-\nnomic scarcity of a resource which suggests resource rent to be a good in-\ndicator of economic scarcity (see Hartwick and Olewiler 1986; Perman, Ma \nand McGilvray 1996, pp. 154-159). The resource rent reflects the opportu-\nnity cost of current resource extraction, i.e. the trade-off between resource \nextraction now and resource extraction in the future. It is a measure of an-\nticipated scarcity of the resource. Rising resource rents would indicate ris-\ning scarcity, whereas falling resource rents would indicate falling scarcity \nand no rise or fall would suggest no change in scarcity. \nUnfortunately, resource rent is not directly observable and hence in-\nherently difficult to measure. This is the reason why attempts to em-\npirically validate Hotelling’s rule have resulted in contradictory conclu-\nsions — see e.g. Miller and Upton (1985) versus Farrow (1985) and \nHalvorsen and Smith (1991) who reject the Hotelling hypothesis (for an \noverview see Berck 1995). Mackellar and Vining (1989, p. 522f.) even sug-\ngest that due to \n \n...changing unit extraction costs, producers’ price expectations, imperfect \ncompetition, exploration, inefficient capital markets, durability and recy-\ncling of the resource in question, and so on, virtually any path of real re-\n17 \nsource prices over the last century could be judged consistent with the \ntheory [of Hotelling].5 \n \nNote, however, that what Farrow (1985) and Halvorsen and Smith \n(1991) really reject is not the Hotelling-rule as such, which must hold in a \ncontext of rational utility maximisers, but the simplistic proposition that \nactual resource rent is rising at the interest rate. One has to keep in mind \nthat the Hotelling-rule only holds true for some rather restrictive assump-\ntions. Hartwick and Hagemann (1993, p. 222) have made this point clear: \n \nWe can summarize Hotelling’s rule this way: if, under quite restrictive as-\nsumptions regarding (a) mineral quality, (b) market uncertainty including \nstock size uncertainty, (c) agents’ foresight, and (d) the functioning of fu-\ntures markets, mineral stock owners are extracting at each date so as to \nmaximize the discounted future profits from their mineral holding, then \nthe rental earned on the marginal ton extracted will increase over time at \nthe rate of interest. (...) Failure to demonstrate that ‘rent rises at the rate of \ninterest’ might reflect the invalidity of any one of the assumptions on \nwhich this prediction is based. What such failure does not imply, how-\never, is that mineral stock owners are not maximizing discounted future \nprofits (that is, the current market value of the mineral deposit). \n \nBecause of the difficulties in measuring resource rent, studies of re-\nsource scarcity have come up with two alternative indicators: unit extrac-\ntion costs, i.e. the value of factor inputs per unit of output of the resource-\n18 \nextracting industry, and relative resource prices, i.e. the ratio of a resource \nprice index to an overall price index. \nThe relative resource price indicator is close to resource rent. It in-\ncludes the current extraction cost plus the resource rent, that is the oppor-\ntunity cost of current extraction. Its rationale is that with approximately \nconstant marginal current extraction costs the change in the overall re-\nsource price is a good proxy to the change in the unobservable resource \nrent, so that with rising resource scarcity the overall resource price would \nrise relative to a suitably defined overall price index. Its chief advantage is \nthat it is easily observable: „In today’s closely integrated global market-\nplace, most natural resource commodities trade at a single, U.S. dollar-\ndenominated price“ (Mackellar and Vining 1989, p. 525). The rationale for \nusing unit extraction costs instead is that if resource extraction is a Ricar-\ndian process, i.e. it starts from the high-quality ores and moves continually \nto the lower quality ores, then one would expect unit extraction costs to \nrise with rising resource scarcity. In a competitive context it is reasonable \nto presume that resource extraction broadly follows a Ricardian process \nfor then „the market serves as a sensing-selective mechanism, scanning all \ndeposits to take the cheapest increment or tranche into production“ \n(Adelman 1990, p. 3). Unit extraction costs are less easy to observe, at least \nin highly integrated resource industries because then it becomes difficult \nto isolate resource extraction costs proper from other costs such as trans-\nportation and processing costs (Mackellar and Vining 1989, p. 519). \n19 \nThe classical study of resource scarcity is Barnett and Morse (1963). It \nexamined unit extraction costs for the period 1870-1957 for agricultural, \nmineral and forest resources in the United States finding a general down-\nward trend with the exception of forestry. Barnett (1979) and Johnson, Bell \nand Bennett (1980) updated the original study to the 1970s coming to the \nsame principal conclusions of falling unit extraction costs which they in-\nterpreted as a decline in resource scarcity. \nAt the beginning of the eighties the studies undertaken by Slade (1982) \nand Hall and Hall (1984) shed some doubt on these findings. Slade (1982) \nexamined relative resource prices for several mineral and energy re-\nsources finding evidence for ‘U-shaped’ price trends, i.e. after prices had \nfallen over a substantial period of time, they were then starting to rise. \nSlade (1982, p. 136) concluded that „if scarcity is measured by relative \nprices, the evidence indicates that non-renewable natural-resource com-\nmodities are becoming scarce“. Similarly Hall and Hall (1984, p. 363) \nfound evidence for „measurable increasing scarcity of important natural \nresources“ in studying both unit extraction costs and relative resource \nprices for energy and forestry products in the United States. Both studies \nclaimed that part of the rise in oil prices in the 1970s was due to rising \nscarcity and not simply an artefact of the exercise of market power by \nOPEC (Slade 1982, p. 136, Hall and Hall 1984, p. 373). More recent studies \nhave mostly failed to support these findings of rising scarcity.6 Slade \n(1988, p. 200) herself admitted that there was no statistically significant \nupward trend in resource prices and Slade (1992, p. 7) concluded that \n20 \nthere is no evidence of an increase in unit extraction costs and that „when \nwe consider a century of data, the most striking feature is the decline in \nthe relative price of the majority of mineral commodities“. A recent study \nby Uri and Boyd (1995) equally failed to find any increase in unit extrac-\ntion costs or relative resource prices for several mineral resources. \nCan one conclude, therefore, that resources have not become more \nscarce in an economic sense over the past and will not become scarce in \nthe future? There are two objections to doing so: \n \n• As pointed out, empirical studies do not measure resource rent, the \ntheoretically correct indicator, but a surrogate indicator. Unfortunately, \nthe forward looking properties of the surrogate indicators are very \npoor. They can be very misleading, i.e. suggesting the opposite of the \ntrue underlying scarcity trend. What is more, they can be contradictory: \nBrown and Field (1978) detected a rising trend in the relative resource \nprice of lumber while at the same time the unit cost was falling. Why is \nit that the indicators can be very misleading and contradictory?7 \nTake unit extraction costs first. If the resource is becoming scarce, \nunit extraction costs will rise given that resource extraction follows a \nRicardian process. However, improvements in the extraction technol-\nogy countervail this effect and if technical change is sufficiently strong, \nunit extraction costs can fall in spite of rising future economic scarcity \n(Farzin 1995, p. 118). Unit extraction costs only measure the costs of ex-\ntracting already discovered deposits but do not reflect the costs of fu-\n21 \nture extraction (Fisher 1979, p. 257). It is a backward, not forward look-\ning indicator. “The unit cost measure does not warn us of impending \nphysical exhaustion” (Brown and Field 1979, p. 219). This is no mere \ntheoretical possibility: \n \nIn the 19th century, technical progress steadily reduced unit extraction \ncost in the U.S. lumber industry despite the fact that forest resources \nwere disappearing at a rapid rate. The number of some whale species \nin the oceans has dwindled while superior hunting methods have \nsteadily reduced unit extraction costs. (Mackellar and Vining 1989, p. \n520). \n \nRelative resource prices are in principle better suited to predict fu-\nture resource scarcity, since expectations about the future should enter \ncurrent prices. In the absence of a complete set of future markets, how-\never, relative resource prices also fail to reflect future scarcity accu-\nrately. That is, relative resource prices are only an imperfect forward-\nlooking indicator. To give an example: Farrow (1995) suggests that the \nmarket did not anticipate the end of hunting of passenger pigeons \nwhich became extinct “with hardly a ripple in its commercial price” \n(Brown and Field 1978, p. 241). More generally, often market prices do \nnot or, rather, cannot take into account ecological thresholds and irre-\nversibilities in depleting natural capital. Resource prices would be \nmuch higher if the environmental externalities were internalised. \n22 \nEqually, they cannot work for resources that are characterised by open \naccess. \nSince resource prices are supposed to function as a proxy for the un-\nobservable resource rent, problems arise if the link between the price \nand the rent is rather weak. This will be the case if, for example, substi-\ntution among other factor inputs in the processing of the resource is \nhigh, because then the price will rise less than the rent. Similarly, if the \nraw resource (e.g. bauxite) has a small share in the production costs of \nthe final good (e.g. aluminium), then the price for the final good will be \nmuch more influenced by changes in other factor prices than by the re-\nsource rent. Another major problem is the selection of an appropriate \ndeflator or numeraire to transform nominal into real resource prices. As \nHartwick and Olewiler (1986, p. 148ff.) report from other studies, trends \nin resource prices can be quite divergent depending on which deflator \n— e.g. index of factor inputs, index of intermediate goods, index of final \ngoods and services — is used. \nThe most fundamental objection against using relative resource \nprices as an indicator for resource scarcity was provided by Norgaard \n(1990, 1991). His argument is as follows: In an ideal system of complete \nmarkets, including futures and options markets, relative resource prices \nshould reflect present and future scarcity accurately. The problem is \nthat this full set of markets is not existent and that therefore traders in \nnatural resource markets have to form their own expectations about \nscarcity and the future price paths. Since these traders are boundedly \n23 \nrational utility maximisers with imperfect information and imperfect \nforesight, they might well be badly informed about real resource scar-\ncity. The same holds true if their only concern is over the next 5-10 \nyears, as Aage (1984, p. 108) suspects, or the next 10-20 years, as Ray \n(1984, p. 76) suggests. But if that is the case, then \n \n...the cost and price paths their decisions generate are as likely to re-\nflect their ignorance as reality. To control for whether or not allocators \nare informed, however, we would have to know whether resources are \nscarce. Since this is the original question, the exercise is logically im-\npossible. (Norgaard 1990, p. 19f.). \n \nInferring the real underlying scarcity trend from the time-series of \nthe indicator is therefore flawed from the beginning. Norgaard (1991, p. \n195) suggests that the only thing one can really test is whether or not al-\nlocators believe that a resource is scarce and not real scarcity. \n \n• Past trends cannot be simply extrapolated into the future (and most \ndefinitely not into the far future). That the resource constraint is not \nbinding yet, does not imply that it will not be so in due course. To give \nan example: The World Bank projects world output to rise at about \n3.2% p.a. (World Bank 1992, p. 9), which means that it would already be \nabout 3.5 times higher than present in 2030. It is not all that clear \nwhether there are sufficient resources for such a tremendous growth of \n24 \noutput. The point is that resource pessimists are concerned whether \nthere will be enough resources to satisfy a demand that exceeds past \nlevels of demand by orders of magnitude. \nSo far, reserves of both energy and non-energy resources have by \nand large persistently been rising over time. Figures 1 and 2 show the \ntrend in world oil and gas reserves, respectively, together with their \nstatic reserves index, that is the current reserves to current production \nratio in years. For both oil and gas both absolute reserves and the static \nreserves to production ratio are much higher than in 1965 (oil) or 1970 \n(gas), respectively. Figure 3 presents the exponential reserve index for \nmajor energy and non-energy resources in 1970 and 1992, respectively. \nThe exponential reserve index states how long current reserves would \nlast if future consumption were to grow at current rates of growth.8 It \nshows that even the exponential reserve index has increased over the \nlast 25 years in most cases or has only slightly decreased.9 But surely, \nthere is no guarantee that this fortunate trend will continue into the fu-\nture, especially as output and possibly resource input might be growing \nvery fast, as the group of nearly industrialised countries becomes larger \nand larger and continues to catch up with the high-income countries. \n \n \nSource: British Petroleum (various years). \nFigure 1. Word oil reserves. \n25 \n \n \nWhat about the prospects of recycling, that proposition b) also refers \nto? These prospects are limited as well. Strictly speaking, given a backstop \nenergy technology, the second law of thermodynamics imposes no physi-\ncal constraint on the possibilities of recycling material. In principle, given \nan unlimited supply of energy, all material could be recycled — a fact that \nfollows directly from the first law of thermodynamics (conservation of \nmass) and that was denied by Georgescu-Roegen first, but later on ac-\ncepted (Georgescu-Roegen 1986, p. 11). However, there is an economic \nconstraint since, for many materials, the costs of recycling material are \nlikely to become prohibitively high as the recycling rate tends towards 100 \nper cent. Recycling can ease a resource constraint for some time, but it \ncannot overcome it in the end. For a detailed discussion of the physical \nprinciples governing the possibilities of recycling material see Georgescu-\nRoegen (1986), Biancardi et al. (1993, 1996), Khalil (1994), Kummel (1994), \nMansson (1994), and Converse (1996). \n \nSource: British Petroleum (various years). \nFigure 2. World natural gas reserves. \nSource: Meadows et al. (1972), WRI (1996-97), British Petroleum (various years). \nFigure 3. Exponential reserve index for major resources. \n26 \n4. Substitution through man-made capital \nLet us turn to proposition c) now. Evidently, proposition a) cannot be a \nsatisfactory solution, if there is no backstop technology that can substitute \nfor all economically relevant resources and substituting them by renew-\nable resources is either infeasible or would hugely overstretch their regen-\nerative capacity.10 Equally, proposition b) cannot be a satisfactory solution \nif we take on a very long-run perspective, because in the end a non-\nrenewable resource is just that: non-renewable and it will be depleted in \nsome finite time.11 The resource might still be substituted with man-made \ncapital then. But can man-made capital substitute for an ever diminishing \nresource stock?12 The answer is yes under some restrictive assumptions, as \nproven by Solow (1974a) and Dasgupta and Heal (1979).13 \nDasgupta and Heal (1979) examine under which conditions a non-\nrenewable resource is essential and when it is inessential, where an essen-\ntial resource is defined as a resource for which „feasible consumption \nmust necessarily decline to zero in the long run“ (p. 199). To make analysis \npossible they have to assume some sort of production function and they \ntake the Constant-Elasticity-of-Substitution (CES) production function for \nreasons of simplicity. Since they assume that labour is constant, one can as \nwell normalise it to one and suppress it and put only man-made capital K \nand resource input R as arguments into the function. Hence the constant \nelasticity of substitution refers to the elasticity of substitution between re-\nproducible man-made capital and the non-renewable resource. Let us call \nthis elasticity σ. The CES-function can be represented as follows: \n27 \n \n{ }F t K t R t( ) ( ) ( ) ( ) ( )( ) \/ ( ) \/= + + − − −− − σ σα β α βσ σ σ σ 11 1 1  \n \nwhere F is produced output and α, β > 0, α+β < 1, and \n \nσ =\nd KR\nd MRSK R\nln( )\nln ,\n,  ⇒  σ ≥ 0.14 \n \nwhere MRS is the marginal rate of substitution between K and R: \n \nP\nP\nK\nF\nR\nF\ndR\ndKMRS\nK\nR\nRK =−==\n∂∂\n∂∂\n,  \n \nand PK, PR is the price of the man-made capital factor and of the resource \nfactor, respectively. The higher is σ, the better can resources be substituted \nby man-made capital. There are three cases to distinguish: First, σ > 1; sec-\nond, σ = 1 and third, σ < 1. \nThe first case is trivial and therefore uninteresting. To see this, note that \nwith σ > 1 all exponents become greater than zero and since resources en-\nter the production function only in an additive way they are inessential. \nHowever, for the same reason it is possible to have F(K,0) > 0, i.e. produc-\ntion without any input of resources, which contradicts the first law of \n28 \nthermodynamics. That something can be produced without any resource \ninput is a physical impossibility. σ > 1 can therefore be dismissed. \nThe third case is uninteresting as well. Note that for this case the aver-\nage product of the resource, F\/R, is \n \nF t\nR t\nR t\nK t\nR t( ) ( )\n( )\n( )\n( ) ( )\n( )( ) \/\n( ) \/\n=\n\n\n\n\n\n + + − −\n\n\n\n\n\n\n\n\n−\n−\n−\nσ\nσ\nα β α β\nσ σ\nσ σ\n11\n11  \n \nand it is bounded above as the resource becomes depleted, because as \nR→ 0, F\/R becomes \n \nlim ( ) ( )\n( )\nR\nF t\nR t→\n−\n=\n0\n1σ σβ  \n \nWith a finite resource stock and no technical progress, the bounded-\nness of the average product F\/R implies that total output is finite so that \noutput must decline to zero as time goes to infinity. In the limit with σ = 0 \nthe CES-function degenerates into a so-called Leontief production function \nof the form F(K,R) = min(vK,wR) with v>0, w>0, which means that all sub-\nstitution possibilities are ruled out and we reached perfect complementar-\nity (Varian 1992, p. 20). \nRemains the second case. With σ = 1 the CES function collapses into the \nCobb-Douglas production function of the following form (Chiang 1984, \npp. 428ff.): \n29 \n \n( ) ( ) ( )F K Rt t t= ⋅α β  \n \nIt is apparent, that the resource is not trivially inessential since without \nresources (R = 0) no production is possible, i.e. F = 0. However, dividing F \nby R and taking the partial derivative of F with respect to R shows that  \n \nF\nR\nK\nR\n=\n−\nα\nβ( )1   and  ( )∂ ∂ βF R FR= , \n \nso for σ = 1 both the average (F\/R) and marginal product (∂F\/∂R) of the \nresource are unbounded and both F\/R and ∂F\/∂R→ ∞ as R→ 0. This com-\nbination ensures that the case σ = 1 is non-trivial: It is not overtly clear \nwhether the resource is essential or not. Dasgupta and Heal (1979, p. 200-\n205) prove that it is not if α > β, that is if the elasticity of output with re-\nspect to man-made capital is higher than the elasticity of output with re-\nspect to the non-renewable resource. There is no direct intuition for this \nresult beyond the mathematical necessity. However, since in a competitive \neconomy these elasticities are equal to the share of total income going to \nthe factors man-made capital and resources, respectively (Euler’s theo-\nrem), Dasgupta and Heal (1979, p. 200) circumscribe the condition α > β \nwith the condition that man-made capital is „sufficiently important in \nproduction“. Solow (1974a, p. 39), Hartwick (1977, p. 974) and Dasgupta \nand Heal (1979, p. 205) suggest that man-made capital’s share is as much \n30 \nas four times higher than the share of resources, so that resources are not \nessential for the Cobb-Douglas case.15 \n \nThere are several objections that can be raised against being optimistic \nas a consequence of this analysis, however: \n \n1) The first objection is that we do not know whether σ is greater than, \nequal to or smaller than 1. There are econometric studies mainly on the \nrelationship between man-made capital and energy.16 Table 1 summa-\nrises the findings of several studies. It is important to note that the re-\nported values are not the σ‘s as defined above, but so-called ‘Allen par-\ntial elasticity of substitution’ values, σ(AES), with \n \n σ\n∂\n∂( )\nln\nln\nAES\nK\nP\nM\nE\nE=   \n \nwhere PE is the price of energy and ME is the share of energy in total \nproduction costs. σ(AES) is not bounded below by zero and its values \nare not directly transferable into values of σ. However, negative values \nof σ(AES) signal complementarity between man-made capital and en-\nergy and the more negative is σ(AES) the higher is the complementar-\nity. Vice versa for positive values of σ(AES) which signal substitutabil-\nity (Allen 1938, p. 509). \n \n31 \n \nTable 1 shows extreme variance in results ranging from com-\nplementarity to substitutability. There is much dispute about possible \nexplanations for these „notably contradictory“ (Solow 1987, p. 605) \nfindings, without a resolution.17 Some argue that time-series economet-\nric studies are likely to find complementarity, whereas cross-section \nanalyses are likely to find substitutability between energy and man-\nmade capital (Griffin 1981, pp. 71-74). This is because relative factor \nprice variations tend to be much more pronounced cross-sectionally \nTable 1. Estimates of the Capital-Energy Allen partial Elasticity of Substitution \nσ(AES) Sample Type of data Source \n- 1.39 U.S. 1947-71 time-series Hudson and Jorgenson \n(1974) \n- 3.22 U.S. 1947-71 time-series Berndt and Wood (1975) \n1.07 \/ 1.03 U.S.\/9 OECD- \ncountries \n1955-69 cross-section Griffin and Gregory (1976) \n1.22 7 OECD-countries 1963-74 time-series Özatalay et al. (1979) \n- 2.32 Netherlands 1950-76 time-series Magnus (1979) \n0.36 – 1.77 10 OECD-countries 1963-73 time-series Pindyck (1979) \n- 3.8 U.S. 1971 cross-section Field and Grebenstein(1980) \n2.26 Australia 1946-1975 time-series Turnovsky et al. (1982) \n- 1.35 U.S. 1971-76 cross-section  Prywes (1986) \n  2.17 Taiwan 1956-71 time-series Chang (1994) \n32 \nthan over time within one country. If these relative price differentials \nhave been existent for a long time, cross-section studies are likely to \nfind long-run equilibrium effects and in the long-run we would always \nexpect higher substitutability between factors than in the short run. \nLooking at table 1 shows, however, that some studies do not fit this ex-\nplanation. At best, it can therefore only be part of the story. Another \nexplanation offered by Berndt and Wood (1979, pp. 349f.) is that stud-\nies that find substitutability usually tend to include only three factors \n(labour, man-made capital and energy) in the production function, \nwhereas studies that find complementarity include materials as a \nfourth factor. But, again, there are some studies using four inputs and \nstill finding substitutability between capital and energy (e.g. \nTurnovsky et al. 1982). A third reason for the differing results is given \nby Solow (1987) and Chichilnisky and Heal (1993). They develop mod-\nels in which different countries can exhibit either substitutability or \ncomplementarity between energy and man-made capital in spite of \nhaving the same physical production function. These differences can \noccur because of differences in energy prices and differences in energy \ndemand conditions. Overall, it has to be said that a satisfactory expla-\nnation for the variance in results from econometric studies has not been \nfound yet and that we do not have a reliable answer on the question \nwhether energy and man-made capital are substitutes or complements. \nHence it is not possible to conclude that resources in reality are ines-\nsential. \n33 \n \n2) The second objection is that we cannot rule out the possibility that σ \nbecomes smaller than 1 as more and more of the resource is used up. \nThat is, σ is not constant over time, but itself a function of time, i.e. \nσ = σ(t). Dasgupta and Heal assume a CES production function for \nsimplicity, but there is no reason to expect that in reality the elasticity \nof substitution between man-made capital and resources is constant \nover time. As Dasgupta and Heal (1979, p. 207) admit themselves, con-\nstancy might be a flawed assumption as the resource is run down and \nthe ratio of man-made capital to resources becomes very high. Espe-\ncially in that phase even assuming σ = 1 might contradict physical laws \nsince it assumes that F\/R and ∂F\/∂R→ ∞ as R→ 0, i.e. the average prod-\nuct and the marginal product of the resource tend toward infinity as \nthe resource stock tends to zero. \n \n3) The third objection applies the same kind of argument to the share of \nman-made capital and the resource-share of total income. There is no \nreason to expect that in reality those shares remain constant as the \nstock of resource tends toward depletion (Slade 1987, p. 351). That is, α \nand β are not constant over time, but themselves functions of time, i.e. \nα = α(t) and β = β(t). Hence, even if σ was constantly equal to 1 \nthroughout, the elasticity of output with respect to the resource (β) \nmight supersede the elasticity of output with respect to man-made \ncapital (α) after which the resource will become essential. \n34 \n \n4) The fourth objection is that the dichotomy of man-made capital versus \nresources is an artificial and flawed one since man-made capital con-\nsists partly of resources. Victor (1991) looks at the properties of a Cobb-\nDouglas production function if it is assumed that man-made capital is \nitself produced from man-made capital, resources and labour: \nLet the production function F be of the form18 \n \n(1)  F K R Lc d e= , with c,d,e > 0 and c+d+e = 1 \n \nNow let the production function for producing man-made capital \ngoods be of the form \n \n(2)  K K R Lp q s= , with p, q, s > 0 and p+q+s = 1 \n \nSolving (2) for K gives \n \n(3)  K R L\nq\np\ns\np\n=\n− −\n( ) ( )\n1 1  \n \nSubstituting (3) into (1) and re-arranging we arrive at \n \n F R L\nc q\np\nd\nc s\np\ne\n=\n⋅\n−\n+\n⋅\n−\n+( ) ( )\n1 1  \n35 \n \nIt is obvious that man-made capital cannot infinitely substitute for \nan ever declining resource stock anymore. Of course, resources might \nstill be substituted for by an ever increasing labour input; but in con-\ntrast to man-made capital, labour is not a factor that can be increased \nindefinitely since labour is supplied by human beings who, by the way, \nalso consume natural resources. That is, in effect, given that resources \nare needed for the production of man-made capital goods, resources \nbecome essential for production even for the Cobb-Douglas case: Man-\nmade capital cannot infinitely substitute for vanishing resources. \n \n \n5. The role of technical progress in overcoming resource constraints \nLet us finally turn to proposition d). Technical progress can be divided \ninto what is known as ‘resource-augmenting’ technical progress and what \nI call ‘augmenting resource’ technical progress for lack of a terminus techni-\ncus. Resource-augmenting technical progress increases the efficiency of \nnatural resource use and means that ever more output can be produced \nfrom a given amount of natural resources or that for a given output ever \nless resource-input is needed, respectively.19 ‘Augmenting resource’ tech-\nnical progress reduces resource extraction costs which means that lower-\nquality ores of a resource become economical to extract. This implies that \nthe economically relevant resource stock increases although the total \nphysical stock of a finite non-renewable resource cannot be increased, of \n36 \ncourse. It is this Baumol (1986) had in mind when he spoke misleadingly \nof „the possibility of continuing expansion of finite resources“. Note that \nthis conjecture does not contradict the laws of thermodynamics, as Young \n(1991) erroneously suggested. \nIn some sense technical progress is the strongest proposition of the re-\nsource optimists. Let us turn to resource-augmenting technical progress \nfirst. If there is permanent resource augmenting technical progress, that is, \nif a unit of output can be produced with ever declining resource inputs, \nthen the resource is inessential even if substitution possibilities between \nman-made capital and resources are nil (Dasgupta and Heal 1979, p. 207). \nThe same holds true as Stiglitz (1974) proves for so-called Hicks-neutral \ntechnical progress, that is technical progress that cannot be attributed to a \nproduction factor, given \n \n• that the production function is Cobb-Douglas, i.e. σ = 1, \n• that m\/β is sufficiently large, where m is the rate of Hicks-neutral tech-\nnical progress and β is the income share of the resource, so that m\/β can \nbe loosely20 interpreted as the rate of resource-augmenting technical \nprogress (Toman, Pezzey and Krautkraemer 1995, p. 145). \n \nHowever, whether permanent resource augmenting technical progress \nis possible, especially in the limit as resource stocks go down, is unclear. \nAyres and Miller (1980) and Gross and Veendorp (1990) suggest that as-\nsuming so contradicts the first law of thermodynamics (conservation of \n37 \nmass). There are likely to be limits to increasing efficiency. While it might \nbe possible to reduce the required resource input per unit of output sig-\nnificantly for many resources, permanent efficiency increases face techni-\ncal difficulties and would be prohibitively costly to achieve. \nUnfortunately, it is rather difficult to measure resource-augmenting \ntechnical progress. Take energy use as an example. Often one finds figures \nof energy intensity which is declining over time.21 See figure 4 which \nshows the time trend in energy intensity for the world and for OECD-\ncountries. \n \n \nEnergy intensity is the ratio of energy input expressed in physical \nterms to the value of economic output, usually GDP.22 The problem with \nthis measurement is that it does not directly measure changes in the tech-\nnical energy efficiency of production which is what we are looking for \nwhen we want to measure resource-augmenting technical progress. A de-\ncline in the energy intensity of an economy can come about for a number \nof reasons other than technical progress itself, e.g. because of a change in \nthe sectoral structure of the economy, because of substitution of labour or \nman-made capital for energy, because of a change in the energy input mix \nSources: Primary Energy Input: British Petroleum (various years), GDP: World Bank (1991, \n1995) and IMF (1997) \nFigure 4. Energy consumption and energy intensity. \n38 \ntowards energy sources which can provide more useful work per unit of \nheat etc. (Patterson 1996, p. 381, Kaufmann 1992). Reliable evidence on this \npoint is hard to get. Kaufmann (1992) claims that his more complex \neconometric testing approach refutes earlier evidence from simpler regres-\nsion models, e.g. Howarth (1991), which found technical progress to be a \nstatistically significant and important contributor to the decline in energy \nintensity. Kaufmann (1992, p. 54), on the contrary, suggests „that most of \nthe changes are associated with shifts in the types of energies used and the \ntypes of goods and services consumed and produced“. Equally inconclu-\nsive is the situation for non-energy resources. Slade (1987, p. 351) cites \nevidence that suggests that technical progress has been resource-saving in \nsome sectors but resource-using in others. \nAnother caveat in inferring conclusions from looking at resource aug-\nmenting technical progress is that even if resource intensities are falling \nover time, absolute resource consumption may well rise if the rate of con-\nsumption growth is higher than the rate of resource augmenting technical \nprogress. Looking again at figure 4 shows that while energy intensities \nhave fallen over time both worldwide and for the OECD-countries, con-\nsumption of primary energy has continuously risen due to tremendous \npopulation and output growth.23 In fact, the two are even more closely \nrelated: Resource augmenting technical progress reduces the implicit price \nof energy, thus making production cheaper, boosting production and fa-\nvouring the substitution of energy for other factors of production, which \nin return implies, ceteris paribus, an increased demand for energy. Khaz-\n39 \nzoom (1987) and Brookes (1990, 1992) believe that this ‘rebound’-effect will \nin most cases be strong enough to lead to a net increase in energy use. \nHowarth (1997, p. 8) has shown, however, that this conjecture will only \nhold true under the conditions that „(i) energy accounts for a large frac-\ntion of the total cost of energy services and (ii) the production of energy \nservices constitutes a substantial fraction of economic activity“. He finds \nthat neither of these conditions is empirically plausible. \nLet us turn to ‘augmenting resource’ technical progress now. Slade’s \n(1982) and Berck and Roberts’s (1996) model show how improvements in \nthe resource extraction technology can lead to a persistent downward \ntrend in unit extraction costs and real resource prices over quite a long \ntime span although the total resource stock becomes physically smaller. \nTechnical progress can boost the economically relevant resource stock \nand ease the resource constraint over a significant time span. However, \nwhether there will be and can be permanent and at best exponential tech-\nnical progress is unclear, of course. That there has been enormous techni-\ncal progress in the past is beyond doubt, but there is no assurance that \nthere will also be permanent technical progress in the future. As Lecomber \n(1975, p. 45) has put it: „The central feature of technical advance is indeed \nits uncertainty“. It all boils down to whether you believe strongly in tech-\nnical progress or not. To get a flavour of the resource optimists’ faith, it is \nworth quoting Beckerman (1972, p. 338) at some length here: \n \n40 \nIn fact, given the natural concentrations of the key metals in the Earth's \ncrust as indicated by a large number of random samples the total natural \noccurrence of most metals in the top mile of the Earth's crust has been es-\ntimated to be about a million times as great as present known reserves. \nSince the latter amount to about a hundred years' supplies this means we \nhave enough to last about one hundred million years. Even though it may \nbe impossible at present to mine to a depth of one mile at every point in \nthe Earth's crust, by the time we reach the year A.D. 100,000,000 I am sure \nwe will think up something. If the idea that actual reserves might be a mil-\nlion times currently proved reserves seems unbelievable it should be borne \nin mind that existing proved reserves are probably about a million times \nas big as those known in the days of Pericles. \n \n \n6. Conclusion \nIt is important to note that the power of the resource optimists’ creed \nstems from the fact that not all four propositions need to hold true in isola-\ntion, but that any one of them or some combination thereof is already suf-\nficient to save the economy from doomsday. What makes an analysis of \nthese propositions difficult is that they are not amenable for refutation \nsince they ultimately rest on basic beliefs about future substitution possi-\nbilities or technical progress. Resource optimism has powerful theoretical \narguments as well as strong evidence up to now in favour. But as this sur-\nvey of the economics of natural resource availability has made clear, \nwhether the propositions of resource optimism will hold true for the fu-\n41 \nture as well is a different matter. These propositions are surely logically \nconceivable, but whether they are possible in practice and likely to occur, \nwe do not know. The only thing we do know is that they are not certain. \nThe world economy has so far exhibited a most remarkable capability \nto overcome resource constraints. Resources that were feared to become \nscarce at one time, often turned out to be abundantly available only a few \nyears later. This gives reason to hope. And yet there are good reasons to \nbe cautious as well: Never can there be any guarantee that the fortunate \nexperiences of the past will replicate in the future. This holds especially \ntrue in times of rapid change as ours. Whether the limited availability of \nnatural resources will ever constrain economic growth, we simply do not \nknow. As Lecomber (1975, p. 42) has written as long ago as 1975:  \n \nEverything hinges on the rate of technical progress and possibilities of \nsubstitution. This is perhaps the main issue that separates resource opti-\nmists and resource pessimists. The optimist believes in the power of hu-\nman inventiveness to solve whatever problems are thrown in its way, as \napparently it has done in the past. The pessimist questions the success of \nthese past technical solutions and fears that future problems may be more \nintractable. \n \n42 \nReferences \nAage, Hans (1984) Economic arguments on the sufficiency of natural re-\nsources, Cambridge Journal of Economics 8 (1), 105-113. \nAdelman, M.A. (1990) Mineral Depletion, With Special Reference to Petro-\nleum, Review of Economics and Statistics 72 (1), 1-10. \nAdelman, M.A. (1995) The Genie out of the Bottle: World Oil since 1970, Cam-\nbridge (Mass.) MIT Press. \nAllen, R.G.D. (1938) Mathematical Analysis for Economists, London: Macmil-\nlan. \nAyres, Robert U. and Miller, Steven M. (1980) The Role of Technological \nChange, Journal of Environmental Economics and Management 7 (4), 353-\n371. \nBarbier, Edward B. (1989) Economics, Natural-Resource Scarcity and Devel-\nopment, London: Earthscan. \nBarnett, Harold J. (1979) Scarcity and Growth Revisited. In V. Kerry Smith \n(ed.), Scarcity and Growth Reconsidered (pp. 163-217), Baltimore: The \nJohns Hopkins University Press. \nBarnett, Harold J. and Morse, Chandler (1963) Scarcity and Growth: The \nEconomics of Natural Resource Availability, Baltimore: The Johns Hop-\nkins University Press. \n43 \nBarney, Gerald O. (1980) The Global 2000 Report to the President of the U.S. — \nEntering the 21st Century, A Report Prepared by the Council on Envi-\nronmental Quality and the Department of State, New York: Perga-\nmon Press. \nBaumol, William J. (1986) On the Possibility of Continuing Expansion of \nFinite Resources, Kyklos 39 (2), 167-179. \nBeckerman, Wilfred (1972) Economists, Scientists, and Environmental Ca-\ntastrophe, Oxford Economic Papers 24 (3), 327-344. \nBeckerman, Wilfred (1974) In Defence of Economic Growth, London: Jona-\nthan Cape. \nBeckerman, Wilfred (1995) Small is Stupid — Blowing the Whistle on the \nGreens, London: Duckwort. \nBerck, Peter (1995) Empirical Consequences of the Hotelling Principle. In \nDaniel W. Bromley (ed.), Handbook of Environmental Economics (pp. \n202-221), Cambridge: Cambridge University Press. \nBerck, Peter and Roberts, Michael (1996) Natural Resource Prices: Will \nThey Ever Turn Up?, Journal of Environmental Economics and Manage-\nment 31 (1), 65-78. \nBerndt, Ernst R. and Field, Barry C. (1981) (eds.) Modeling and measuring \nnatural resource substitution, Cambridge (Mass.) MIT Press. \n44 \nBerndt, Ernst R. and Wood, David O. (1975) Technology, Prices, and the \nDerived Demand for Energy, Review of Economics and Statistics 57 (3), \n259-268. \nBerndt, Ernst R. and Wood, David O. (1979) Engineering and Econometric \nInterpretations of Energy-Capital Complementarity, American Eco-\nnomic Review 69 (3), 342-354. \nBiancardi, C., Tiezzi, E. and Ulgiati, S. (1993) Complete Recycling of Mat-\nter in the Frameworks of Physics, Biology and Ecological Economics, \nEcological Economics 8 (3), 1-5. \nBiancardi, C., Tiezzi, E. and Ulgiati, S. (1996) The ‘Recycle of Matter’ De-\nbate. Physical Principles versus Practical Impossibility, Ecological \nEconomics 19 (3), 195-196. \nBoyle, Stewart (1993) Toward a Fossil Free Future: The Technical and Eco-\nnomic Feasibility of Phasing Out Global Fossil Fuel Use. In N. \nNakicenovic, W.D. Nordhaus, R. Richels and F.L. Toth (eds.) Integra-\ntive Assessment of Mitigation, Impacts and Adaptation to Climate Change \n(pp. 353-377), Proceedings of a Workhop held on 13-15 October 1993, \nLaxenburg: International Institute for Applied Systems Analysis. \n45 \nBringezu, Stefan and Schütz, Helmut (1996) Analyse des Stoffverbrauchs \nder deutschen Wirtschaft - Status quo, Trends und mögliche \nPrioritäten für Maßnahmen zur Erhöhug der \nRessourcenproduktivität, in: Jörg Köhn and Maria Welfens (eds.) \nNeue Ansätze in der Umweltökonomie (pp. 230-251), Marburg: \nMetropolis-Verlag. \nBritish Petroleum (various years) BP Statistical Review of World Energy, \nLondon: British Petroleum. \nBrookes, Len (1990) The Greenhouse Effect: the Fallacies in the Energy Ef-\nficiency Solution, Energy Policy 18 (2), 199-201. \nBrookes, Len (1992) Energy Efficiency and Economic Fallacies: A Reply, \nEnergy Policy 20 (5), 390-393. \nBrown, Gardner M. and Field, Barry C. (1978) Implications of Alternative \nMeasures of Natural Resource Scarcity, Journal of Political Economy 86 \n(2), 229-243. \nBrown, Gardner M. and Barry C. Field (1979) The Adequacy of Measures \nfor Signalling the Scarcity of Natural Resources. In V. Kerry Smith \n(ed.), Scarcity and Growth Reconsidered (pp. 218-248), Baltimore: The \nJohns Hopkins University Press. \nChang, Kuo-Ping (1994) Capital-Energy Substitution and the Multi-Level \nCES Production Funtion, Energy Economics 16 (1), 22-26. \n46 \nChiang, Alpha C. (1984) Fundamental Methods of Mathematical Economics, \nNew York: McGraw-Hill. \nChichilnisky, Graciela and Heal, Geoffrey (1993) [1983] Energy-Capital \nSubstitution: A General Equilibrium Analysis, Collaborative Paper, \nInternational Institute for Applied Systems Analysis Laxenburg 1983. \nIn Geoffrey Heal (ed.), The Economics of Exhaustible Resources (pp. 390-\n401), Hants: Edward Elgar. \nConverse, A.O. (1996) On Complete Recycling, Ecological Economics 19 (3), \n193-194. \nDaly, Herman E. (1992) Steady-state economics — Second edition with new \nessays, London: Earthscan, first published in 1977. \nDaly, Herman E. (1994) Operationalizing sustainable development by in-\nvesting in natural capital, in: A. Jansson, M. Hammer, C. Folke and R. \nCostanza (eds.) Investing in Natural Capital: the Ecological Economics \nApproach to Sustainability (pp. 22-37), Washington D.C.: Island Press, \n22-37. \nDaly, Herman E. (1995) On Wilfred Beckerman's Critique of Sustainable \nDevelopment, Environmental Values 4 (1), 49-55. \nDasgupta, Partha and Heal, Geoffrey (1974) The Optimal Depletion of Ex-\nhaustible Resources, Review of Economic Studies Symposium, 3-28. \nDasgupta, Partha and Heal, Geoffrey (1979) Economic Theory and Exhausti-\nble Resources, Cambridge: Cambridge University Press. \n47 \nDe Bruyn, S.M. and Opschoor, J.B. (1997) Developments in the Through-\nput-Income Relationship: Theoretical and Empirical Observations, \nEcological Economics 20 (3), 255-268. \nDeadman, D. and Turner, R. Kerry (1988) Resource Conservation, Sustain-\nability and Technical Change. In R. Kerry Turner (ed.), Sustainable \nEnironmental Management Principles and Practice (pp. 67-101), London: \nBethaven. \nDeshmukh, Sudhakar D. and Pliska, Stanley R. (1985) A Martingale Char-\nacterization of the Price of a Non-renewable Resource with Decisions \nInvolving Uncertainty, Journal of Economic Theory 35 (2), 322-342. \nFarrow, Scott (1985) Testing the Efficiency of Extraction from a Stock Re-\nsource, Journal of Political Economy 93 (3), 452-487. \nFarrow, Scott (1995) Extinction and Market Forces: Two Case Studies, Eco-\nlogical Economics 13 (2), 115-123. \nFarzin, Y. Hossein (1995) Technological Change and the Dynamics of Re-\nsource Scarcity Measures, Journal of Environmental Economics and \nManagement 29 (1), 105-120. \nField, Barry and Grebenstein, Charles (1980) Capital-Energy Substitution \nin U.S. Manufacturing, Review of Economics and Statistics 62 (2), 207-\n212. \n48 \nFisher, Anthony C. (1979) Measures of Natural Resource Scarcity. In V. \nKerry Smith (ed.), Scarcity and Growth Reconsidered (pp. 249-275), Bal-\ntimore: The Johns Hopkins University Press. \nGeorgescu-Roegen, Nicholas (1971) The Entropy Law and the Economic Proc-\ness, Cambridge: Harvard University Press. \nGeorgescu-Roegen, Nicholas (1975) Energy and Economic Myths, Southern \nEconomic Journal 41 (3), 347-381. \nGeorgescu-Roegen, Nicholas (1986) The Entropy Law and the Economic \nProcess in Retrospect, Eastern Economic Journal 12 (1), 3-25. \nGoeller, H.E. and Zucker, A. (1984) Infinite Resources: The Ultimate Strat-\negy, Science 223 (4635), 456-462. \nGordon, Robert B., Koopmans, Tjalling, Norhaus, William D. and Skinner, \nBrian J. (1987) Toward a New Iron Age? — Quantitative Modeling of Re-\nsource Exhaustion, Cambridge (Mass.) Harvard University Press. \nGraham-Tomasi, Theodore, Runge, C. Ford and Hyde, William F. (1986) \nForesight and Expectations in Models of Natural Resource Markets, \nLand Economics 62, (3), 234-249. \nGriffin, James M. (1981) The Energy-Capital Complementarity Contro-\nversy: a Progress Report on Reconciliation Attempts. In Berndt, Ernst \nR. and Field, Barry C. (eds.) Modeling and Measuring Natural Resource \nSubstitution (pp. 70-80), Cambridge (Mass.) MIT Press. \n49 \nGriffin, James M. and Gregory, Paul R. (1976) An Intercountry Translog \nModel of Energy Substitution Responses, American Economic Review \n66 (5), 845-857. \nGross, L.S. and Veendorp, E.C.H. (1990) Growth with Exhaustible Re-\nsources and a Materials-Balance Production Function, Natural Re-\nsource Modeling 4 (1), 77-94. \nHall, Darwin C. and Hall, Jane V. (1984) Concepts and Measures of Natu-\nral Resource Scarcity with a Summary of Recent Trends, Journal of \nEnvironmental Economics and Management 11 (4), 363-379. \nHalvorsen, Robert and Tim R.Smith (1991) A Test of the Theory of Ex-\nhaustible Resources, Quarterly Journal of Economics 106 (1), 123-140. \nHartwick, John M. (1977) Intergenerational Equity and the Investing of \nRents from Exhaustible Resources, American Economic Review 67 (5), \n972-974. \nHartwick, John M. (1990) Natural Resources, National Accounting and \nEconomic Depreciation, Journal of Public Economics 43 (3), 291-304. \nHartwick, John M. and Olewiler, Nancy D. (1986) The Economics of Natural \nResource Use, New York: Harper & Row. \nHartwick, John M. and Anja Hageman (1993) Economic Depreciation of \nMineral Stocks and the Contribution of El Serafy. In Ernst Lutz (ed.), \nToward Improved Accounting for the Environment (pp. 211-235), Wash-\nington D.C.: The World Bank. \n50 \nHotelling, Harold (1931) The Economics of Exhaustible Resources, Journal \nof Political Economy 39 (2), 137-175. \nHowarth, Richard B. (1991) Energy Use in US Manufacturing: The Impacts \nof the Energy Shocks on Sectoral Output, Industry Structure, and \nEnergy Intensity, Journal of Energy Development 14 (2), 175-191. \nHowarth, Richard B. (1997) Energy Efficiency and Economic Growth, Con-\ntemporary Economic Policy 15 (4), 1-9. \nHudson, Edward and Jorgenson, Dale (1974) US Energy Policy and Eco-\nnomic Growth, Bell Journal of Economics 5 (2), 461-514. \nIMF (1997) World Economic Outlook 1997, Washington D.C.: International \nMonetary Fund. \nJevons, William Stanley (1865) The Coal Question: An Inquiry Concerning the \nProspects of the Nation and the Probable Exhaustion of Our Coal Mines, \nLondon. \nJohnson, Manuel H., Bell, Frederick W., and Bennett, James T. (1980) \nNatural Resource Scarcity: Empirical Evidence and Public Policy, \nJournal of Environmental Economics and Management 7 (3), 256-271. \nKaufmann, Robert K. (1992) A Biophysical Analysis of the Energy\/Real \nGDP Ratio: Implications for Substitution and Technical Change, Eco-\nlogical Economics 6 (1), 35-56. \nKhalil, E.L. (1994) Recycling of Matter. Further Comments, Ecological Eco-\nnomics 9 (3), 193-194. \n51 \nKhatib, Hisham (1995) Energy Intensity: a New Look, Energy Policy 23 (8), \n727-729. \nKhazzoom, J. Daniel (1987) Energy Saving Resulting from the Adoptions \nof More Efficient Appliances, The Energy Journal 10 (1), 85-89. \nKummel, R. (1994) Energy, Entropy-Economy, Ecology, Ecological Econom-\nics 9 (3), 194-195. \nLecomber, R. (1975) Economic Growth Versus the Environment, London: \nMacmillan. \nLenssen, Nicholas and Flavin, Christopher (1996) Sustainable Energy for \nTomorrow’s World — The Case for an Optimistic View of the Future, \nEnergy Policy 24 (9), 769-781. \nMackellar, F. Landis and Vining, Daniel R. Jr. (1989) Measuring Natural \nResource Scarcity, Social Indicators Research 21 (5), 517-530. \nMagnus, J.A. (1979) Substitution between Energy and Non-Energy Inputs \nin the Netherlands 1950-1976, International Economic Review 2 (2), 465-\n484. \nMalthus, Thomas Robert (1798) An Essay on the Principle of Population, \nLondon: J. Johnson. \nMansson, B.A. (1994) Recycling of Matter. A Response, Ecological Econom-\nics 9 (3), 191-192. \nMeadows, Dennis, Meadows, Donella, Zahn, Erich and Milling, Peter \n(1972) The Limits to Growth, New York: Universe Books. \n52 \nMeadows, Donella, Meadows, Dennis and Randers, Jorgen (1992) Beyond \nthe Limits: Global Collapse or a Sustainable Future, London: Earthscan. \nMill, John Stuart (1862) Principles of Political Economy, 5th ed., London: \nParker, Son, and Bourn. \nMiller, Merton H. and Upton, Charles W. (1985) A Test of the Hotelling \nValuation Principle, Journal of Political Economy 93 (1), 1-25. \nMishan, Ezra J. (1974) Growth and Antigrowth: What Are the Issues?. In \nA. Weintraub, E. Schwartz and J. Richard Aronson (eds.) The eco-\nnomic growth controversy (pp. 3-38), London: Macmillan. \nMoazzami, B. and Anderson, F.J. (1994) Modelling Natural Resource Scar-\ncity Using the ‘Error-Correction’ Approach, Canadian Journal of Eco-\nnomics 27 (4), 801-812. \nNeumayer, Eric (1998a) Is Economic Growth the Environment’s Best \nFriend, Zeitschrift für Umweltpolitik und Umweltrecht 21 (2), 161-176. \nNeumayer, Eric (1998b) Preserving Natural Capital in a World of Uncer-\ntainty and Scarce Financial Resources, International Journal of Sustain-\nable Development and World Ecology 5 (1), 27-42. \nNeumayer, Eric (1999) Weak Versus Strong Sustainability: Exploring the Lim-\nits of Two Opposing Paradigms, Cheltenham: Edward Elgar. \nNordhaus, William D. (1973) World Dynamics: Measurement without \nData, Economic Journal 83 (332), 1156-1183. \n53 \nNordhaus, William D. (1992) Lethal Model 2: The Limits to Growth Revis-\nited, Brookings Papers on Economic Activity 0 (2), 1-59. \nNorgaard, Richard B. (1986) Thermodynamic and Economic Concepts as \nRelated to Resource-Use Policies: Synthesis, Land Economics 62 (3), \n325-327. \nNorgaard, Richard B. (1990) Economic Indicators of Resource Scarcity: A \nCritical Essay, Journal of Environmental Economics and Management 19 \n(1), 19-25. \nNorgaard, Richard B. (1991) Economic Indicators of Resource Scarcity: A \nMore Critical Reply, Journal of Environmental Economics and Manage-\nment 21 (2), 195-199. \nÖzatalay, Savas, Grubaugh, Stephen and Long, Thomas Veach II (1979) \nEnergy Substitution and National Energy Policy, American Economic \nReview 69 (2), 369-371. \nPatterson, Murray G. (1996) What is Energy Efficiency?, Energy Policy 24 \n(5), 377-390. \nPearce, David W. (1997) Substitution and Sustainability: Some Reflections \non Georgescu-Roegen, Ecological Economics 22 (3), 295-297. \nPerman, Roger, Ma, Yue and McGilvray, James (1996) Natural Resource and \nEnvironmental Economics, Harlow: Addison Wesley Longman. \nPindyck, Robert S. (1978) The Optimal Exploration and Production of \nNon-renewable Resources, Journal of Political Economy 86 (5), 841-861. \n54 \nPindyck, Robert S. (1979) Interfuel Substitution and the Industrial Demand \nfor Energy: An International Comparison, Review of Economics and \nStatistics 61 (2), 169-179. \nPrell, Mark A. (1996) Backstop Technology and Growth: Doomsday or \nSteady State?, Journal of Environmental Economics and Management 30 \n(2), 254-264. \nPrywes, Menahem (1986) A Nested CES Approach to Capital-Energy Sub-\nstitution, Energy Economics 8 (1), 22-28. \nRay, George F. (1984) Mineral Reserves: Projected Lifetimes and Security \nof Supply, Resources Policy 10 (2), 75-80. \nRicardo, David (1817) Principles of Political Economy and Taxation, London: \nJohn Murray. \nScott, Anthony and Pearse, Peter (1992) Natural Resources in a High-Tech \nEconomy — Scarcity Versus Resourcefulness, Resources Policy 18 (3), \n154-166. \nSlade, Margaret E. (1982) Trends in Natural-Resource Commodity Prices: \nAn Analysis of the Time Domain, Journal of Environmental Economics \nand Management 9 (2), 122-137. \nSlade, Margaret E. (1987) Natural Resources, Population Growth, and \nEconomic Well-Being, in: D. Gale Johnson and Ronald D. Lee (eds.) \nPopulation Growth and Economic Development: Issues and Evidence (pp. \n331-369), Wisconsin: University of Wisconsin Press. \n55 \nSlade, Margaret E. (1988) Grade Selection Under Uncertainty: Least Cost \nLast and Other Anomalies, Journal of Environmental Economics and \nManagement 15 (2), 189-205. \nSlade, Margaret E. (1992) Do Markets Underprice Natural-Resource Commodi-\nties?, Working Paper Nr. 962, Washington D.C.: The World Bank. \nSöllner, Fritz (1997) A Reexamination of the Role of Thermodynamics for \nEnvironmental Economics, Ecological Economics 22 (3), 175-201. \nSolow, John L. (1987) The capital-energy complementarity debate revis-\nited, American Economic Review 77 (4), 605-614. \nSolow, Robert M. (1974a) Intergenerational equity and exhaustible re-\nsources, Review of Economic Studies Symposium, 29-46. \nSolow, Robert M. (1974b) Is the end of the world at hand?. In A. \nWeintraub, E. Schwartz and J. Richard Aronson (eds.) The economic \ngrowth controversy (pp. 39-61), London: Macmillan. \nSolow, Robert M. (1974c) The Economics of Resources or the Resources of \nEconomics, American Economic Review 64 (2), 1-14. \nSolow, Robert M. (1993a) An almost practical step toward sustainability, \nResources Policy 19 (3), 162-172. \nSolow, Robert M. (1993b) Sustainability: An Economist's Perspective. In R. \nDorfman and N. Dorfman (eds.) Selected Readings in Environmental \nEconomics (pp. 179-187), New York: Norton. \n56 \nStiglitz, Joseph (1974) Growth with Exhaustible Natural Resources: Effi-\ncient and Optimal Growth Paths, Review of Economic Studies Sympo-\nsium, 123-137. \nSwierzbinski, Joseph and Mendelsohn, Robert (1989) Information and Ex-\nhaustible Resources: A Bayesian Analysis, Journal of Environmental \nEconomics and Management 16 (3), 193-208. \nToman, Michael A., Pezzey, John and Krautkraemer, Jeffrey (1995) Neo-\nclassical Economic Growth Theory and ‘Sustainability’. In Daniel W. \nBromley (ed.) Handbook of Environmental Economics (pp. 139-165), \nCambridge: Cambridge University Press. \nTurnovsky, Michelle, Folie, Michael and Ulph, Alistair (1982) Factor Sub-\nstitutability in Australian Manufacturing with Emphasis on Energy \nInputs, Economic Record 58 (160), 61-72 \nTrainer, F.E. (1995) Can Renewable Energy Sources Sustain Affluent Soci-\nety?, Energy Policy 23 (12), 1009-1026. \nUri, N.D. and Boyd, R. (1995) Scarcity and Growth Revisited, Environment \nand Planning A 27 (11), 1815-1832. \nVarian, Hal R. (1992) Microeconomic Analysis, New York: Norton. \nVictor, Peter A. (1991) Indicators of Sustainable Development: Some Les-\nsons from Capital Theory, Ecological Economics 4 (3), 191-213. \nWorld Bank (1992) World Development Report 1992 — Development and the \nEnvironment, New York: Oxford University Press. \n57 \nWorld Bank (1991) World Tables 1991, Washington D.C.: The World Bank. \nWorld Bank (1995) World Tables 1995, Washington D.C.: The World Bank. \nWRI (1996-97) World Resources — a joint publication from the World Re-\nsources Institute, United Nations’ Environment Programme, United \nNations’ Development Programme and the World Bank, Washington \nD.C.. \nYoung, Jeffrey T. (1991) Is the Entropy Law Relevant to the Economics of \nNatural Resource Scarcity?, Journal of Environmental Economics and \nManagement 21 (2), 169-179. \n 0\n20\n40\n60\n80\n100\n120\n140\n160\n180\n1\n9\n6\n0\n1\n9\n6\n1\n1\n9\n6\n2\n1\n9\n6\n3\n1\n9\n6\n4\n1\n9\n6\n5\n1\n9\n6\n6\n1\n9\n6\n7\n1\n9\n6\n8\n1\n9\n6\n9\n1\n9\n7\n0\n1\n9\n7\n1\n1\n9\n7\n2\n1\n9\n7\n3\n1\n9\n7\n4\n1\n9\n7\n5\n1\n9\n7\n6\n1\n9\n7\n7\n1\n9\n7\n8\n1\n9\n7\n9\n1\n9\n8\n0\n1\n9\n8\n1\n1\n9\n8\n2\n1\n9\n8\n3\n1\n9\n8\n4\n1\n9\n8\n5\n1\n9\n8\n6\n1\n9\n8\n7\n1\n9\n8\n8\n1\n9\n8\n9\n1\n9\n9\n0\n1\n9\n9\n1\n1\n9\n9\n2\n1\n9\n9\n3\n1\n9\n9\n4\nMetals and Minerals Commodity Price Index (1977-79=100)\n \nFIGURE 1 (Eric Neumayer) \n1 \n100\n200\n300\n400\n500\n600\n700\n800\n900\n1000\n1100\n1\n9\n6\n5\n1\n9\n6\n6\n1\n9\n6\n7\n1\n9\n6\n8\n1\n9\n6\n9\n1\n9\n7\n0\n1\n9\n7\n1\n1\n9\n7\n2\n1\n9\n7\n3\n1\n9\n7\n4\n1\n9\n7\n5\n1\n9\n7\n6\n1\n9\n7\n7\n1\n9\n7\n8\n1\n9\n7\n9\n1\n9\n8\n0\n1\n9\n8\n1\n1\n9\n8\n2\n1\n9\n8\n3\n1\n9\n8\n4\n1\n9\n8\n5\n1\n9\n8\n6\n1\n9\n8\n7\n1\n9\n8\n8\n1\n9\n8\n9\n1\n9\n9\n0\n1\n9\n9\n1\n1\n9\n9\n2\n1\n9\n9\n3\n1\n9\n9\n4\n1\n9\n9\n5\n25\n29\n33\n37\n41\n45\nWorld Oil Reserves\/Production Ratio in years (right scale) World Oil Reserves in Thousand Million Barrels (left scale)\n \nFIGURE 2 (Eric Neumayer) \n2 \n \n30\n40\n50\n60\n70\n80\n90\n100\n110\n120\n130\n140\n150\n1\n9\n7\n0\n1\n9\n7\n1\n1\n9\n7\n2\n1\n9\n7\n3\n1\n9\n7\n4\n1\n9\n7\n5\n1\n9\n7\n6\n1\n9\n7\n7\n1\n9\n7\n8\n1\n9\n7\n9\n1\n9\n8\n0\n1\n9\n8\n1\n1\n9\n8\n2\n1\n9\n8\n3\n1\n9\n8\n4\n1\n9\n8\n5\n1\n9\n8\n6\n1\n9\n8\n7\n1\n9\n8\n8\n1\n9\n8\n9\n1\n9\n9\n0\n1\n9\n9\n1\n1\n9\n9\n2\n1\n9\n9\n3\n1\n9\n9\n4\n1\n9\n9\n5\nWorld Natural Gas Reserves in Trillion Cubic Metres World Gas Reserves\/Production Ratio in Years\n \nFIGURE 3 (Eric Neumayer) \n3 \n \n68\n27\n83\n22\n67\n43\n40\n19\n33\n40\n161\n31\n21\n93\n21\n13\n53\n15\n18\n16\n21\n90\n0 20 40 60 80 100 120 140 160\nAluminium\nCopper\nIron\nLead\nMercury\nNickel\nTin\nZinc\nOil\nGas\nCoal\nExponential Reserve Index (Years)\n1970\n1994\n \nFIGURE 4 (Eric Neumayer) \n4 \n2500\n3500\n4500\n5500\n6500\n7500\n8500\n1965 1967 1969 1971 1973 1975 1977 1979 1981 1983 1985 1987 1989 1991 1993 1995\n3\n3,5\n4\n4,5\n5\n5,5\nWorld Primary Energy Cons. in mill. tonnes oil equivalent (LS) OECD Primary Energy Cons. in mill. tonnes oil equivalent (LS)\nWorld Energy intensity (consumption\/GDP*10^4) (RS) OECD energy intensity (consumption\/GDP*10^4) (RS)\nOECD\nWorld \nWorld \nOECD\n \n \nFIGURE 5 (Eric Neumayer) \n5 \nENDNOTES \n                                                 \n1 However, the rise in oil prices was clearly linked to the exercise of market power by OPEC and not to dramatically rising natural scarcity, although there is some evidence \nthat prices had started rising before 1973 (Slade 1982, p. 136). For a history of world oil prices see Adelman (1995). \n2 Some natural resources are scarce on this world in a physical sense. If they have no productive use, nobody cares about this scarcity, however. Scarcity in an economic \nsense I define to be excess demand for the resource at a given price. \n3 Of course, Georgescu-Roegen was not so naive as to overlook the fact that the earth is not a closed system. He merely claimed that using solar energy needs more non-\nsolar energy input than is gained in energy eventually (Georgescu-Roegen 1986, p. 23). While this might be true for the present, there is absolutely no reason to expect that \nthis has to be true in the future as well. \n4 It also holds for uncertainty if agents form rational expectations and there is a complete set of contingent forward markets. Neither is very realistic. See Graham-Tomasi, \nRunge and Hyde (1986). \n5 On this, see also Swierzbinski and Mendelsohn (1989) who explain the apparent contradictory results as follows: Miller and Upton (1985) demonstrate that stockholders \nuse the Hotelling-rule at each moment of time to forecast the value of their stocks. That time-trend tests of the Hotelling-rule (e.g. Farrow 1985 and Halvorsen and Smith \n1991) have generally failed to support the rule is due to the fact that because of dynamic uncertainty and consistent updating in information the true mean rate of change in \nthe resource price persistently deviates from the deterministic Hotelling-rule. \n6 A recent study of Moazzami and Anderson (1994) finds empirical support for Slade’s (1982)  ‘U-shaped’ price trend hypothesis, however. \n7 See Farzin (1995) for a more detailed and technical analysis. \n8 The exponential reserve index is computed as ln(r.s+1)\/r, where r is the average rate of consumption growth and s is the static reserve index (see Meadows et al. 1972, p. \n68). For 1970, I have computed the average annual growth rate over the time period 1965-1970 and for 1994 the average annual growth rate over the time period 1985-1994 \nin order to average out coincidental annual fluctuations in consumption growth in the years for which the exponential reserve index is computed. \n6 \n                                                                                                                                                                                                                                                             \n9 In addition, as Ray (1984, p. 76) observes, in continents other than Europe and Northern America, „large areas (...), even parts that have been geologically classified as \nprobably rich in minerals (...), have been no more than partially explored“. \n10 It also has to be taken into account that the growing of renewable resources has its ecological price in the form of fertiliser and pesticide use as well as soil erosion. \n11 Although if we take on an even longer time perspective, fossil fuels will become renewed again, albeit at such a slow rate that this renewal is of no plausible relevance to \nhumankind. \n12 Daly (1994, p. 25) tries to refute the possibility of substituting man-made capital for natural capital (here: natural resources)  with a general argument: „One way to make \nan argument is to assume the opposite and show that it is absurd. If man-made capital were a near perfect substitute for natural capital, then natural capital would be a \nnear perfect substitute for man-made capital. But if so, there would have been no reason to accumulate man-made capital in the first place, since we were endowed by na-\nture with a near perfect substitute.“ Daly’s argument is incorrect, however. It says that if A is a near perfect substitute for B, then B must be a near perfect substitute for A. \nBut the conclusion does not follow from the premise. A might have some additional desirable properties that B does not have: For some production purposes A and B are \nalmost near perfect substitutes with almost linear isoquants. But for other purposes, A has some desirable properties that B does not have. Hence, A can substitute for the \ntotality of B, but not vice versa. Hence, there is reason to accumulate A and substitute for B. \n13 An important assumption is that there is no depreciation of man-made capital. As Dasgupta and Heal (1979, p. 226) indicate, the basic results would go through as well \nwith capital depreciation as long as capital depreciates at less than an exponential rate. Note also that technical progress which Dasgupta and Heal exclude could counter-\nact exponential capital depreciation. On this, see the discussion in section 5. \n14 Note that σ is bounded below by zero. With σ = 0, capital and resources are already perfect complements. A negative elasticity of substitution (σ < 0) is not possible. \n15 Slade (1987, p. 351) reports values that suggest that man-made capital’s share and the resources’ share are approximately equal. However, this is a misunderstanding. \nBerndt and Wood (1975), on which Slade based her values, included intermediate goods in the production function. Those intermediate goods do not fall from heaven and \npresumably the share of man-made capital in those intermediate goods is higher than the share of resources, so that the ultimate share of man-made capital is still consid-\nerably higher than that of resources, thus reconciling the reported values with those of Solow (1974a), Hartwick (1977) and Dasgupta and Heal (1979). \n7 \n                                                                                                                                                                                                                                                             \n16 In one of the rare attempts to estimate elasticities of substitution for non-energy resources, Brown and Field (1979, p. 241) found high elasticities of substitution for steel, \ncopper, pulp and paper through man-made capital and labour. Deadman and Turner (1988, p. 91) present qualitative evidence for low elasticities of substitution for Beryl-\nlium, Titanium and Germanium. \n17 See Berndt and Field (1981), Chichilnisky and Heal (1993), Prywes (1986), Solow (1987) and Chang (1994). \n18 Note that here labour is not assumed to be constant and therefore enters the production function explicitly. \n19 Resource augmenting technical progress is technical progress that can be attributed to the production factor natural resources. It is to be distinguished from technical \nprogress that augments other factors of production such as labour augmenting technical progress and from so-called Hicks-neutral technical progress that cannot be attrib-\nuted to any single production factor. \n20 ‘Loosely’ because formally it is not possible for the Cobb-Douglas production function to distinguish pure capital- from resource-augmenting technical progress. \n21 Energy intensity generally falls also cross-sectionally with rising incomes. There is an important caveat, however. To compare energy intensity cross-sectionally, the GDP \nof each country has to be converted from the local currency into a common denominator, usually into US$. Until recently, it was common to use official exchange rates. \nNow, however, the United Nations and the International Monetary Fund pay more attention to the purchasing power of currencies and have published GDP-figures meas-\nured in purchasing power parity. According to Khatib (1995, Table 1, p. 728) GDP in purchasing power parity is reasonably close to GDP as conventionally measured in the \nOECD-countries. For developing, and Eastern European countries as well as countries of the former Soviet Union, however, GDP is often 200% or even more higher if ex-\npressed in purchasing power parity than conventionally reported. China’s GDP, e.g., rises from 415 to 2,257 billion US$. Not surprisingly, Khatib finds that the energy in-\ntensity in developing countries drops significantly when GDP is calculated in purchasing power parity. The same is to be expected for resource intensities other than en-\nergy. \n22 This is the most often used measure for energy intensity. For other, more contested concepts of measuring energy efficiency see Patterson (1996). \n8 \n                                                                                                                                                                                                                                                             \n23 Recent evidence even seems to suggest that resource intensity might revert to rise again at high levels of income. De Bruyn and Opschoor (1997, p. 266) found evidence \nfor developed countries showing their aggregate consumption of materials, energy and transport „again increasing faster than GDP“ in the late 1980s and early 1990s after \nmore than a decade of delinking resource consumption from economic growth. \n"}