{"doi":"10.1007\/s12289-010-0889-7","coreId":"196588","oai":"oai:lra.le.ac.uk:2381\/8777","identifiers":["oai:lra.le.ac.uk:2381\/8777","10.1007\/s12289-010-0889-7"],"title":"A Review of the Semi-Solid Processing of Steel","authors":["Atkinson, Helen V.","Rassili, A."],"enrichments":{"references":[{"id":44779184,"title":"0745694A1, Method and apparatus of shaping semisolid metals, UBE Industries,","authors":[],"date":"1996","doi":null,"raw":"European Patent 0745694A1, Method and apparatus of shaping semisolid metals, UBE Industries, 1996.","cites":null},{"id":44779187,"title":"In fact this paper has been referenced incorrectly on Web of Science and should have as authors","authors":[],"date":null,"doi":null,"raw":"Ahmed R., Marc R., Regis B. (In fact this paper has been referenced incorrectly on Web of Science and should have as authors Rassili A., Robelet M., Bigot R.,) op. cit. [13] 213-8.","cites":null},{"id":44779162,"title":"In:","authors":[],"date":"2005","doi":"10.4028\/www.scientific.net\/msf.475-479.2579","raw":"Kang Y. L., Song R. B., Li J. G., Zhao A. M., In: Proc. 5 th Pacific Rim Int. Conf. On Advanced Materials and Processing, Materials Science Forum, Parts 1-5, 475-479:2579-82, 2005.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-04","abstract":"This paper was presented at the 13th International ESAFORM Conference on Material Forming, University of Brescia, Italy, April 7-9 2010, and published as International Journal of Material Forming, 2010, 3 (s1), pp. 791-795.  The final published version is available at http:\/\/www.springerlink.com\/, Doi: 10.1007\/s12289-010-0889-7.Steel is a particularly challenging material to semi-solid process because of the high temperatures involved and the potential for surface oxidation. Here the experience of semi-solid processing will be reviewed and the current situation in relation to commercial application assessed. The review will include discussion of the range of potential steel materials which are amenable to thixoforming including thermodynamic prediction of suitable alloy compositions","downloadUrl":"http:\/\/hdl.handle.net\/2381\/8777","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/8777\/1\/ESAFORM2010paperAtkinsonandRassili_EditPlenary.pdf","pdfHashValue":"dceac28fe5a201ca99eb98c0d61bdfc4dea995f4","publisher":"Springer Verlag","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/8777<\/identifier><datestamp>\n                2015-11-30T14:30:12Z<\/datestamp><setSpec>\n                com_2381_171<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_172<\/setSpec><setSpec>\n                col_2381_835<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nA Review of the Semi-Solid Processing of Steel<\/dc:title><dc:creator>\nAtkinson, Helen V.<\/dc:creator><dc:creator>\nRassili, A.<\/dc:creator><dc:subject>\nSteel<\/dc:subject><dc:subject>\nthixoforming<\/dc:subject><dc:subject>\nsemi-solid processing<\/dc:subject><dc:subject>\ndies<\/dc:subject><dc:description>\nThis paper was presented at the 13th International ESAFORM Conference on Material Forming, University of Brescia, Italy, April 7-9 2010, and published as International Journal of Material Forming, 2010, 3 (s1), pp. 791-795.  The final published version is available at http:\/\/www.springerlink.com\/, Doi: 10.1007\/s12289-010-0889-7.<\/dc:description><dc:description>\nSteel is a particularly challenging material to semi-solid process because of the high temperatures involved and the potential for surface oxidation. Here the experience of semi-solid processing will be reviewed and the current situation in relation to commercial application assessed. The review will include discussion of the range of potential steel materials which are amenable to thixoforming including thermodynamic prediction of suitable alloy compositions.<\/dc:description><dc:date>\n2010-11-15T15:01:24Z<\/dc:date><dc:date>\n2010-11-15T15:01:24Z<\/dc:date><dc:date>\n2010-04<\/dc:date><dc:type>\nConference paper<\/dc:type><dc:identifier>\nInternational Journal of Material Forming, 2010, 3 (s1), pp. 791-795<\/dc:identifier><dc:identifier>\n1960-6206<\/dc:identifier><dc:identifier>\nhttp:\/\/link.springer.com\/article\/10.1007%2Fs12289-010-0889-7<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/8777<\/dc:identifier><dc:identifier>\n10.1007\/s12289-010-0889-7<\/dc:identifier><dc:language>\nen<\/dc:language><dc:publisher>\nSpringer Verlag<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["1960-6206","issn:1960-6206"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Steel","thixoforming","semi-solid processing","dies"],"subject":["Conference paper"],"fullText":"____________________ \n* Corresponding author: Department of Engineering, University of Leicester, University Rd., Leicester, LE1 7RH, UK, Tel: 00-44-\n116- 2231019, Fax: 00-44-116-2522525, hva2@le.ac.uk \n \n \n \nA REVIEW OF THE SEMI-SOLID PROCESSING OF STEEL \n \n \n \nH. V. Atkinson\n1*\n, A. Rassili\n2\n \n \n1Department of Engineering, University of Leicester, University Rd., Leicester, LE1 7RH, UK \nhva2@le.ac.uk \n2PiMW (B56), University of Liège, Boulevard de Colonster, 4B-4000 Liège, Belgium. \na.rassili@ulg.ac.be \n \n \nABSTRACT: Steel is a particularly challenging material to semi-solid process because of the high temperatures \ninvolved and the potential for surface oxidation. Here the experience of semi-solid processing will be reviewed and the \ncurrent situation in relation to commercial application assessed. The review will include discussion of the range of \npotential steel materials which are amenable to thixoforming including thermodynamic prediction of suitable alloy \ncompositions.   \n \nKEYWORDS: Steel, thixoforming, semi-solid processing, dies. \n \n \n1 INTRODUCTION  \nIn this Introduction, background history on the semi-\nsolid processing of steel will be given and major themes \nfor the review drawn out. \nSemi-solid processing involves forming in the semi-solid \nstate between the solidus and the liquidus. The process \nwas first discovered by Flemings and his group at MIT \nin the early 1970s [1]. For successful forming, the \nmicrostructure in the semi-solid state must consist of \nspheroids of solid in a liquid matrix. The material then \nbehaves thixotropically i.e. when it is sheared it flows \nbut when allowed to stand it thickens again. The forming \nprocesses based on this behaviour have therefore been \nchristened thixoforming, thixoforging (when the solid \nfraction is high) and thixocasting (when the solid \nfraction is low). The Flemings group experimented at the \npilot plant scale with rheocasting (i.e. forming in the \nsemi-solid state direct from the cooling liquid metal \nrather than having an intermediate solidification step). \nThey formed a series of steels including AISI 304 and \n440C [e.g.2] but found that oxide inclusions tended to \nlead to variable mechanical properties. Aluminium \ncasting alloys and magnesium alloys proved highly \namenable to the process and in the 1980s there was \nextensive effort on the industrialisation of the thixo-\nprocesses for light alloys, with the more challenging \nhigh temperature alloys moving into the background. \nIn the early 1990s, a group based in Sheffield, UK, led \nby Kirkwood, Sellars and Kapranos, revived interest \nwith a consortium of UK based companies including \nRolls Royce. The Sheffield equipment used a vertically \nupwards acting ram within a vacuum chamber (to avoid \noxidation of the slug during heating) and a graphite die. \nSuch a die would not be suitable for long production \nruns but was relatively cheap in comparison with tool \nsteel dies and therefore suitable for an experimental \nprogramme. The Sheffield group saw the potential of \nceramic dies for thixoforming high temperature alloys \nand patented this idea [3]. The Sheffield work compared \nresults from spray formed materials  [4] (a relatively \nexpensive process) with the RAP (Recrystallisation and \nPartial Melting)  process [5] which simply involved \nmaterial in the conventionally cast and heavily deformed \nstate for T15, M2 and H13 tool steels and 440C stainless \nsteel, with encouraging results. The consortium then \nfocussed on M2 tool steel for extensive trials, partly \nbecause it has a reasonably large freezing range (>40˚C) \nin comparison with stainless alloys, and partly because \nits high alloy content leads to a relatively low solidus. \nAn example of the resulting gear toothed demonstrator is \nshown in Figure 1. \nModelling of the induction heating of the billet showed \nthat heat was being lost from the corners of the billet \nmaking these parts resistant to deformation; this led to \nprocess improvements [7]. At the end of this consortium \nproject in the early 1990s the main difficulty was that \nthere was no commercial manufacturer of equipment for \nsteel thixoforming and companies were not willing to \ntake the risk on the developmental stage.  \nIn parallel with the Sheffield work, the Thixoforming \nUnit at EFU in Germany led by Hirt was also aiming to \n \nFigure 1: M2 tool steel demonstrator [6] \n \nthixoform steels. It became clear that without the facility \nto shroud the billet during heating, the build up of oxide \non the surface prohibited successful processing. A major \ncollaborative project on thixoforming was initiated at \nRWTH Aachen and issues such as die longevity started \nto be explored. Work at Aachen [8] showed that, when \nthixoforming M2, the stresses induced in the die tool \nsteel were several times the yield strength and therefore \nceramic inserts were necessary. Meyer and Bleck (also at \nAachen) [9] showed Differential Thermal Analysis \n(DTA) results for M2 and compared with the calculated \nresults from a thermodynamic prediction package, \ntechniques which become powerful in enabling \namenable steels to be identified and characterised. At a \n1997 conference, work was also presented highlighting \nthat commercial wrought high speed steel bar could be \nthixoformed without any special treatment [10]. As we \nhave progressed into the 2000s, major EU consortia \n(‘THIXOCOMP’ and COST 541 ‘THIXOSTEEL’) and \nfurther work by a consortium based in Aachen have \naimed to overcome the major barriers to exploitation. \nThe themes in this review are: routes to thixoformable \nstarting materials; identification of suitable steels; \nmodelling of die fill and rheological property \nmeasurement; technology considerations; die \ndevelopment; properties of thixoformed products. \nConcluding remarks will then be given.  \n \n2 ROUTES TO THIXOFORMABLE \nSTARTING MATERIALS \nAs identified above [2], the Flemings group used \nrheocasting to obtain thixotropic material. However, this \nrequires the facilities to melt steel and hold it in the \nliquid state; many university laboratories have not had \nfacilities on this scale available. Rheo-routes are \npreferable as there is an energy saving relative to the \nroutes where there is an intermediate solidification step; \nthis saving is particularly crucial for a high melting \ntemperature such as steel. Routes where molten steel has \nbeen treated include the following. A group based in \nSeoul has produced stainless steel billets by Magneto \nHydrodynamic (MHD) stirring and shown excellent \nmicrostructures [11]. The University of Science and \nTechnology in Beijing has also electromagnetically \nstirred steels (in this case spring steels and stainless \nsteel) and then rheorolled the semi-solid slurry [12]. \nThere is liquid macrosegregation but this is being \nreduced through grooved rolling. At CRM in Liege in \nBelgium they have developed a specially designed \nhollow jet nozzle for continuous casting which allows \npowder injection and a low superheat to be combined to \nobtain a globular structure in the core of a continuously \ncast steel billet [13].  \nVarious workers [14-17] are investigating the use of a \ncooling slope (similar to the New Rheocasting-NRC- \nprocess or the work of Haga and co-workers [18,19]) \nwith some success.  Vibratory casting has also been used \n[20], including to obtain functionally graded material \nbased on hydroxyapatite and 316L stainless steel [21]. \nThere has been interest in whether steel can be \nthixoformed in the standard state in which it is received \nfrom a steel supplier. Bulte and Bleck [22] compared the \nmicrostructure after quenching from the semisolid state \nfor 100Cr6 rolled bar, laboratory cast billet and \nlaboratory cast billet with liquid core reduction. They \nfound no significant difference and therefore suggest \nprimary as-cast billet can be used. Omar and co-workers \n[23,24] have demonstrated that the high performance \nsteel HP9\/4\/30, which is very difficult to form by other \nroutes, can be successfully thixoformed in the as-\nsupplied state. Note that in the as-supplied state the \nmaterial is already recrystallised and therefore this route \ndoes not fit with the ‘classical’ solid state routes of RAP \nand SIMA (Strain Induced Melt Activated). \n \n3 IDENTIFICATION OF SUITABLE \nSTEELS \nThe original approach to identifying suitable steels \ninvolved examining the phase diagram. This showed that \nlow alloy, low carbon steels had narrow solidus-liquidus \nranges and therefore process control was likely to be \ndifficult. Work therefore focussed on high alloy, high \ncarbon compositions, which also tend to be the \ncompositions which are the most difficult to work by \nconventional means.   \nAs mentioned in the Introduction, the approach of \ncombining experimental results from Differential \nThermal Analysis (DTA) alongside thermodynamic \nprediction was then developed.  \nKazakov [25] identified parameters for the liquid \nfraction versus temperature curve for alloys to be \nsuitable for thixoforming. These have been adapted for \nsteels [26]: \n The solidus and liquidus temperatures, TS and TL, \nwhich must be as low as possible; \n The temperature at 50% liquid, T50%, which must be \nas low as possible; \n The melting interval, TL-TS, which must be as large as \npossible; \n The semi-melting interval, T50%-TS, which is of \ninterest as it approximates to the thixoforming window; \n The slope at 10 and 50% liquid, (df\/dT)10% and \n(df\/dT)50%, which must be as low as possible to \nensure a small sensitivity of liquid fraction to \ntemperature. \nFigures 2 and 3 show the prediction curves for a \nconventional steel 100Cr6 and a steel where the \ncomposition has been modified specifically for \nthixoforming and which is produced by Ascometal [27]. \n  \nFigure 2 Thermodynamic prediction of liquid fraction \nversus temperature for conventional steel 100Cr6 [27]. \n \nFigure 3 Thermodynamic prediction of liquid fraction \nversus temperature for a modified steel [27]. \n \nThe modified alloys have a lower solidus temperature \nand a wider process temperature range [28]. However, \nthe effect on resulting mechanical properties must also \nbe carefully weighed. \nPuttgen and Bleck [29] have carried out extensive DTA \nexperiments, showing that the cold work tool steel \nX210CrW12 and the tool steel HS 6-5-3 have a wide \nsemi-solid area (due to the dissolution of different \ncarbides) but a range of other steels have much narrower \nsemi-solid regimes. The bearing steel 100Cr6 is also \nhighly suitable. This steel and X210CrW12 have \ntherefore been extensively investigated in terms of the \nphase formation during processing [30]. Hallstedt et al. \n[31] have also used thermodynamic prediction, \nsuggesting that important criteria are the slope at 50% \nliquid and the temperature ranges between 40% liquid \nand 60% for thixocasting and 20% and 40% for \nthixoforging. \nLi et al. [32] have identified how the inverse peritectic \nreaction can lead to spheroidisation in stainless steels in \nthe semi-solid state. They argue that spheroidisation will \nalways occur in an alloy with a peritectic reaction \nindependent of the morphology in the solid state. They \nhave named this phenomenon Inverse Peritectic Induced \nSpheroidisation (IPIS) (Figure 4).   \n  \n \n \nFigure 4 Mechanism of spheroidisation resulting from \ninverse peritectic reaction during partial remelting [32]. \n \n4 MODELLING OF DIE FILL AND \nRHEOLOGICAL PROPERTY \nMEASUREMENT \nModelling of semi-solid processing has been reviewed \nby Atkinson [33]. The high temperatures involved with \nsteels make the experiments particularly challenging. \nModigell et al. [34] have developed a high temperature \nCouette rheometer to analyse flow properties up to \n1500˚C and have characterised X210CrW12. Cezard et \nal. [35] have derived input parameters for their finite \nelement simulation using Forge 2 software from \nsuccessive comparisons of the simulated load-\ndisplacement curves with experimental ones for \ncompression tests on steel semi-solid at different \ntemperatures. The constitutive equation is based on the \nmicro-macro approach. Omar et al. [36] have also \nobtained viscosity-shear  rate relationships from load-\ndisplacement curves. Hot compression is used to obtain \nflow stress curves but only around the solidus \ntemperature [37]. Shimahara et al. [38] have designed a \nspecial cyclinder sample with a shell to avoid the \nproblem of collapse of the sample during hot \ncompression as liquid develops. At temperatures just \nbelow and just above the solidus, Solek et al. [39] and \nKang et al. [40] have carried out experiments with a \nGleeble simulator to characterise rheological properties. \nAt present modelling of die fill is not well developed \nbecause of the difficulties with obtaining experimental \nparameters but the principles should be similar to those \nfor modelling semi-solid die fill in general [33]. \n \n5 TECHNOLOGY CONSIDERATIONS \nThe industrial development of steel thixoforming must \nbe accompanied by knowledge and control of the various \nparameters for the process: the identification of the steel \ngrades; the homogeneous high-temperature heating of \nthe slug before deformation; conception or re-conception \nof the part to adapt it to the process; the parameters for \nforming including ram velocity profile, hold time and \npressure at the end of the stroke, die temperature, die \nmaterial. The handling system is also important; it \nallows the slug to be transferred, in the semi-solid state, \nbetween the heating zone and the tooling and to evacuate \nthe thixoformed part so as to ensure the quality heat \ntreatment of the part. All these aspects contribute to \nachieving a cost for the finished part which is \ncompetitive with more conventional processes [41]. \nIndustrial developments include: non-contact \ntemperature measurement during heating [42]; the use of \nfuzzy logic to control the heating [43]; optimising the \ninduction coil geometry [44]; prediction of thermal \nlosses during transport and after insertion into the die \n[45]; a device on the hydraulic press to counteract the \ndecrease of the punch speed in the final stages of the \nstroke [46]; automated handling and industrial vision \nsystems [47,48]. \n \n6 DIE DEVELOPMENT \nDie development is one of the biggest challenges in \nsemi-solid processing steel; the dies tend to wear \nexcessively because of the high temperatures and \ntemperature changes involved, and also because of attack \nby the semi-molten steel. A series of different potential \nsolutions have been investigated including: oxide PVD \ncoatings on TZM (a Mo-based alloy) [49]; PACVD \nalumina films on hot working steel [50]; ceramic inserts \n(Si3N4, ZrSiO4) in a hot working steel shrink ring [51]. \nIn work at Aachen [52], three types of materials have \nbeen compared: thin film PVD and PACVD; thermally \nsprayed thick coatings and bulk ceramic materials. The \nresults showed that the behaviour was sensitive to the \nstresses at the surface of the die and therefore the die \nshould be made of different materials in different \npositions.  \nGas pressure sintered Si3N4 is an effective die material \nfor low die temperatures (300-400˚C) because of its high \nstrength and outstanding thermal shock resistance [53]. \nAt higher temperatures (1200˚C) high purity dense \nalumina is needed [53]. Bobzin et al. [54] examined the \nmost effective form of alumina coating, showing that \nusing the reactive pulsed PVD process it was possible to \nstabilize gamma-alumina on steel substrates and obtain \nexcellent performance for thixoforging X210CrW12 and \n100Cr6. \nLaser glazing of tool steels has been investigated [55] \nbut the beneficial surface layer did not persist at the \ntemperatures involved for thixoforming steels. Birol \n[56,57]  has investigated the performance of nickel-\nbased IN617 and of a CrNiCo alloy as die materials but \nwith limited success. He also showed that an increase in \nthe die bulk temperature from 450˚C to 550˚C gives a \nvery favourable effect from a thermal fatigue point of \nview [58]. \nPuttgen et al. [59] have investigated the thermal shock \nloading on coated samples, indicating a clear dependence \non the base material. The combination of Ni alloy 2.4631 \nand HVOF gave the best results. \nA self-heating ceramic tool (sintered alumina with a \nheating coil) has been successfully developed by \nMuenstermann et al. [60] for thixoextrusion of \nX210CrW12. Almost isothermal processing can be \nachieved. \nOverall, there are encouraging results for die \ndevelopment. What is needed now is cost comparison \ninformation allied with long life tests to identify the most \neconomic solutions. \n  \n7 PROPERTIES OF THIXOFORMED \nPRODUCTS \nPuttgen et al. [61] have summarised the experience of \nvarious workers in thixoforming finished parts including \na catalogue of the defects and giving suggestions for \nhow to avoid them. Runs with hundreds of parts in them \nhave been produced with various alloys but \nreproducibility has tended to be poor. They conclude that \nefforts are still needed to produce defect-free \ncomponents in serial production at competitive costs. \nSolid-liquid segregation, in particular, causes major \nvariations in carbon content through a component and \nthus inhomogeneous mechanical properties. Parts with \ngreat hardness and wear resistance can be produced [62-\n64] but there is a tendency to brittleness [65]. There is \nclearly further work to be done on optimising heat \ntreatment [66]. \n \n8 CONCLUSIONS \nSemi-solid processing of steel is a very active area for \nresearch and development. The main challenges now are \nwith die protection from degradation and with \nindustrialisation. Considerable progress has been made. \n \nACKNOWLEDGEMENT \nThe authors would like to acknowledge the EU project \nCOST 541 ‘Thixosteel’ and all their co-workers on that \nproject for stimulating discussions. \n \nREFERENCES \n[1] Spencer D. B., Mehrabian R., Flemings M. C., \nMetall Trans., 3:1925-32, 1972. \n[2] Young K. P., Riek, R. G., Flemings M. C., Metals \nTechnology, 6:130-137, 1979. \n[3] Kirkwood D.H., European patent No. 0305375 \nThixotropic materials, 1988. \n[4] Leatham A., Ogilvy A., Chesney P., Wood J. V., \nMetals and Mater., 5:140-3, 1989. \n[5] Boyed L. E., Kirkwood D. H., Sellars C. M., In: \nProc. 2\nnd\n World Basque Congress on New Structural \nMaterials, Spain, 285-95, 1988 (Publ. Vitoria \nGasteiz). \n[6] Kapranos P., Kirkwood D. H., Sellars C. M., Proc. \nInstn Mech Engrs Part B: J. of Engineering \nManufacture, 207:1-8, 1993. \n[7] Kapranos P., Gibson R. C., Kirkwood D. H., Hayes \nP. J., Sellars C. M., Mater. Sci. & Technol., 12:274-\n8, 1996. \n[8] Prange R., Neuschutz D., In: Proc. 5th Int. Conf. \nSemi-Solid Processing of Alloys and Composites, \nBhasin A K, Moore J J, Young K P, Midson S, (ed.), \npubl. Colorado School of Mines, 653-60, 1998. \n[9] Meyer S., Bleck W., op. cit. [8] 361-9. \n[10] Cabeza M. M., Verdeja J. I., Pero-Sanz J. A., Plaza \nD., In: Proc. 30\nth\n Annual Technical Meeting of the \nInternational Metallographic Society, Seattle, WA, \nPubl. ASM International, 425-8, 1997. \n[11] Kim K B, Lee H. I., Moon H. K., op. cit. [8] 415-22. \n[12] Song R., Kang Y., Zhao A., J. Mater. Process. \nTechnol., 198:291-9, 2008. \n[13] Walmag G., Naveau P., Rassili A., Sinnaeve M., In: \nProc. 10\nth\n Int. Conf. Semi-Solid Processing of \nAlloys and Composites, Hirt G., Rassili A., Buhrig-\nPolaczek A. (editors), publ. Trans Tech Publications \nLtd., Solid State Phenomena 141-143:415-20, 2008. \n[14] Seidl I., Kopp R., Steel Res. Int., 75:545-51, 2004. \n[15] Hirt G., Shimahara H., Seidl I., Kuthe F., Abel D., \nSchonbohm A., CIRP Annals-Manufacturing \nTechnology, 54:257-60, 2005. \n[16] Ramadan M., Takita M., Nomura H., El-Bagoury \nN., Mater. Sci. & Engng. A, 430:285-91, 2006. \n[17] Pahlevani F.,  Nili-Ahmadabadi M., Int. J. Cast \nMetals Research, 17:157-61, 2004. \n[18] European Patent 0745694A1, Method and apparatus \nof shaping semisolid metals, UBE Industries, 1996. \n[19] Haga T, Kouda T, Motoyama H, Inoue N, Suzuki S., \nIn: Proc. ICAA7, Aluminium Alloys: Their Physical \nand Mechanical Properties, Vol. 1:327-32, 1998. \n[20] Milostean D. C., Ioan I., Metalurgia International, \n13:49-54, 2008. \n[21] Ruys A. J., Kerdic J. A., Sorrell C. C., J. Mater. Sci., \n31:4347-55, 1996. \n[22] Bulte R., Bleck W., Steel Res. Int., 75:588-92, 2004. \n[23] Omar M. Z., Atkinson H.V., Palmiere E. J., Howe \nA. A., Kapranos P., Steel Res. Int., 75:552-60, 2004. \n[24] Omar M Z, Palmiere E J, Howe A A, Atkinson H V, \nKapranos P, Mater. Sci. Engng. A, 395:53-61, 2005. \n[25] Kazakov A. A., Adv. Mater. Process., 3:31-4, 2000. \n[26] Fraipont C., Lecomte-Beckers J., op. cit. [13] 523-7. \n[27] Lecomte-Beckers J., Rassili A., Robelet M., Poncin \nC., Koeune R., In: Proc. 9\nth\n Int Conf. Semi-Solid \nProcessing of Alloys and Composites, Kang C. G., \nKim S. K., Lee S. Y. (ed.), publ. Trans Tech \nPublications, Solid State Phenomena 116-117:54-7, \n2006. \n[28] Robelet M, Rassili A, Fischer D, op. cit. [27] 712-6. \n[29] Puttgen W, Bleck W, Steel Res. Int,75:531-6, 2004. \n[30] Puttgen W., Hallstedt B., Bleck W., Uggowitzer P. \nJ., Acta Mater., 55:1033-42, 2007. \n[31] Hallstedt B., Baltichev E., Shimahar H., Neuschutz \nD., ISIJ International, 46:1852-7, 2006. \n[32] Li J Y, Sugiyama S., Yanagimoto J., Chen Y L., Fan \nG W, J. Mater. Process. Technol. 208:165-70, 2008. \n[33] Atkinson H. V., Prog. Mater. Sci., 50:341-412, 2005 \n[34] Modigell M., Pape L., Maier H R. op. cit.[27] 606-9. \n[35] Cezard P, Favier V., Bigot R., Proc. 10th ESAFORM \nConf., AIP Conf. Proc. 907:1149-54, 2007. \n[36] Omar M. Z., Atkinson H. V., Palmiere E. J., Howe \nA. A., Kapranos P., op. cit. [27] 677-80. \n[37] Li J. Y., Sugiyama S., Yanagimoto J., J. Mater. \nProcess. Technol., 161:393-406, 2005. \n[38] Shimahara H., Baadjou R., Kopp R., Hirt G., op. cit. \n[27] 189-92. \n[39] Solek K P., Mitura Z., Karbowniczek, M., Kapranos \nP., Kuziak R., Dutkiewicz J., op. cit. [13] 325-30. \n[40] Kang Y. L., Song R. B., Li J. G., Zhao A. M., In: \nProc. 5\nth\n Pacific Rim Int. Conf. On Advanced \nMaterials and Processing, Materials Science Forum, \nParts 1-5, 475-479:2579-82, 2005. \n[41] Ahmed R., Marc R., Regis B. (In fact this paper has \nbeen referenced incorrectly on Web of Science and \nshould have as authors Rassili A., Robelet M., Bigot \nR.,) op. cit. [13] 213-8. \n[42] Schonbohm A, Gasper R, Abel D, op. cit.[27]734-7. \n[43] Behrens BA, Fischer D, Rassili A, op. cit.[13]121-6. \n[44] Rassili A, Robelet M, Fischer D, op. cit. [27]717-20. \n[45] Baadjou R., Knauf F., Hirt G., op. cit. [13] 37-42. \n[46] Cezard P., Bigot R., Becker E., Mathieu S., Pierret \nJ. C., Rassili A., op. cit. [35] 1155-60. \n[47] Kuthe F., Schonbohm A., Abel D., Kopp R., Steel \nRes. Int. 75:593-600, 2004. \n[48] Siegert K, Messmer G, op. cit. [47] 601-6.  \n[49] Lugscheider E., Hornig T., Kopp R., Kallweit J., \nMoller T., Adv. Engng. Mats., 3:998-1001, 2001. \n[50] Kurapov D., Schneider J. M., op. cit. [47] 577-80. \n[51] Behrens BA, Haller B, Fischer D, op. cit. [47]561-8. \n[52] Kopp R., Shimahara H., Schneider J. M., Kurapov \nD., Telle R., Munstermann S., Lugschneider E., \nBobzin K., Maes M., op. cit. [47] 569-76. \n[53] Munstermann S., Telle R., Material Wissenschaft \nund Werkstofftechnik 37:324-8, 2006. \n[54] Bobzin K., Lugscheider E., Maes M., Immich P., op. \ncit. [27] 704-7.  \n[55] Brabazon D, Naher S, Biggs P., op. cit. [13] 255-60.  \n[56] Birol Y, Ironmaking & Steelmaking, 36:555-60, \n2009. \n[57] Birol Y., Steel Res. Int. 80:165-71, 2009.  \n[58] Birol Y., Steel Res. Int., 80:588-92, 2009. \n[59] Puttgen W., Pant M., Bleck W., Seidl I., Rabitsch \nR., Testani C., Steel Res. Int. 77:342-8, 2006. \n[60] Muenstermann S., Uibel K., Tonnesen T., Telle R., \nJ. Mater. Process. Technol., 209:3640-9, 2009. \n[61] Puttgen W., Bleck W., Hirt G., Shimahara H., Adv. \nEngng. Mats., 9:231-245, 2007. \n[62] Uhlenhaut D. I., Kradolfer J., Puttgen W., Loffler J. \nF., Uggowitzer P. J., Acta Materialia, 54: 2727-34, \n2006. \n[63] Dziallach S., Puettgen W., Bleck W., op.cit.[13]695-\n700. \n[64] Munstermann S., Telle R, op. cit. [57] 171-6. \n[65] Omar M. Z., Atkinson H. V., Kapranos P., Jaharah \nA. G., op. cit. [35] 1185-90. \n[66] Rassili A., Pierret J. C., Vaneetveld G., Cezard P., \nBigot R., Robelet M., op. cit. [13] 689-94. \n"}