{"doi":"10.1103\/PhysRevC.59.731","coreId":"100719","oai":"oai:epubs.surrey.ac.uk:114","identifiers":["oai:epubs.surrey.ac.uk:114","10.1103\/PhysRevC.59.731"],"title":"Shape polarizations of two-quasiparticle <i>K<sup>π<\/sup><\/i> = 8<sup>- <\/sup>isomeric configurations","authors":["Xu, F. R.","Walker, P. M.","Wyss, R."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1999-02-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:114<\/identifier><datestamp>\n      2017-10-31T13:56:50Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/114\/<\/dc:relation><dc:title>\n        Shape polarizations of two-quasiparticle <i>K<sup>π<\/sup><\/i> = 8<sup>- <\/sup>isomeric configurations<\/dc:title><dc:creator>\n        Xu, F. R.<\/dc:creator><dc:creator>\n        Walker, P. M.<\/dc:creator><dc:creator>\n        Wyss, R.<\/dc:creator><dc:date>\n        1999-02-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/114\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Xu, F. R., Walker, P. M. and Wyss, R.  (1999) Shape polarizations of two-quasiparticle Kπ = 8- isomeric configurations   Physical Review C, 59.  pp. 731-734.      <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevC.59.731<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/114\/","10.1103\/PhysRevC.59.731"],"year":1999,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"PHYSICAL REVIEW C FEBRUARY 1999VOLUME 59, NUMBER 2Shape polarizations of two-quasiparticle Kp582 isomeric configurations\nF. R. Xu,1,* P. M. Walker,1 and R. Wyss2\n1Department of Physics, University of Surrey, Guildford, Surrey GU2 5XH, United Kingdom\n2Royal Institute of Technology, Physics Department, Frescativa¨gen 24, S-104 05 Stockholm, Sweden\n~Received 12 October 1998!\nTwo-quasiparticle Kp582 isomeric states in the A;130 and 180 regions are studied with configuration-\nconstrained calculations of potential-energy surfaces. Strong shape-polarization effects due to the two quasi-\nparticles are found. In particular, the nuclei 188Pb,186Hg, and 126Te can be polarized from ground-state spheri-\ncal or oblate shapes to prolate shapes, indicating a combination of K isomerism and shape isomerism as the\nFermi level approaches shell closure. @S0556-2813~99!02902-7#\nPACS number~s!: 21.60.Cs, 21.10.2k, 27.60.1j, 27.70.1qTwo-quasiparticle Kp582 isomeric states exist system-\natically in the even-even N574 and 106 isotones, and Z\n572 isotopes, with measured half-lives ranging from nano-\nseconds to hours. These states are associated with the neu-\ntron or proton 7\/21@404# ^ 9\/22@514# Nilsson configuration,\nor in the case of the N5106 isotones with the neutron\n9\/21@624# ^ 7\/22@514# configuration. Direct DK58 decays\nfrom the 82 isomers to the Ip581 members of Kp'01\nyrast bands have been widely observed ~see @1,2# and refer-\nences therein! with significantly lower hindrances in many\ncases than would be expected if K were a good quantum\nnumber. The fast decays could originate from configuration\nmixing @1,2# which is sensitive to the shapes of both the\nisomeric configurations and the rotating states to which they\ndecay. With rotational bands built on the isomers being ob-\nserved in many cases, it can be deduced ~e.g., from the esti-\nmated g-factors of the bands @3#! that the 82 isomeric states\ngenerally have approximately prolate shapes. Although no\nmore direct evidence exists for determining the deforma-\ntions, recent advances @4# with laser spectroscopic techniques\nare opening up the possibilities to measure the charge radii\nand electromagnetic moments for a wide range of isomers\nwith half-lives >100 ms. At the same time, theoretical cal-\nculations may be able to elucidate the important shape de-\ngrees of freedom, and provide a stimulus for future experi-\nmental measurements.\nIn the A;130 and 180 regions, where Kp582 isomers\nare observed, nuclear shapes can become very soft when\napproaching the Z550 and 82 closed shells. For example,\nshape coexistence is well known in the light Pt, Hg, and Pb\nnuclei ~see, e.g., @5,6#!. Significant shape changes could oc-\ncur in the process of quasiparticle excitations. Even for the\nwell-deformed rare-earth nuclei, it has been shown that one-\nquasiproton shape polarizations can be strong and important\nfor explaining many systematic behaviors, with calculations\nlimited to axially symmetric deformations @7#. For soft nu-\nclei, however, the inclusion of the axially asymmetric\ng-degree of freedom is necessary. Furthermore, g-distortion\ncan mix different K values, and hence strongly affect the\ndecay properties of the states. The degree to which the ob-\n*Permanent address: Department of Technical Physics, Peking\nUniversity, Beijing 100871, China.PRC 590556-2813\/99\/59~2!\/731~4!\/$15.00served 82 isomers can be considered to involve shape isom-\nerism, combined with K isomerism, remains an open ques-\ntion. The present paper addresses these issues through the\ncalculation of intrinsic shapes, using a newly developed\nconfiguration-constrained blocking method @8#.\nIn the configuration-constrained calculation of the\npotential-energy surface ~PES! of a given quasiparticle state,\nthe specified single-particle orbitals are kept singly occupied\nwhile changing the deformation. For axially symmetric\nshapes, single-particle orbitals can be specified by their V\n~individual spin-projection! values and it is straightforward\nto identify orbitals @7#. For axially asymmetric shapes, how-\never, V is no longer conserved, and one has to find a differ-\nent way to identify the specific configurations. We use a\nmethod in which we calculate a set of average Nilsson num-\nbers, ^N&,^nz&,^L& and ^uVu& for the configurations that we\nintend to constrain in deformation space. The orbitals in-\nvolved for the Kp582 isomeric states have well-defined and\nstable average Nilsson numbers in the deformation area con-\nsidered, and our configuration-constrained calculations can\nbe related unambiguously to the Nilsson configurations.\nCalculations have been performed with the nonaxial de-\nformed Woods-Saxon ~WS! potential @9# with universal pa-\nrameters @10#. In order to avoid the sudden collapse of proton\npairing around the Z550 and 82 closed shells, the Lipkin-\nNogami ~LN! description @7,11# is employed with monopole\npairing. The pairing interaction strength, G, is first deter-\nmined by the average gap method @12#. It has been pointed\nout @8# that the precise G value is particularly important for\ncalculations of configuration excitation energies, but not for\ndeterminations of shapes. The usual pairing strength can de-\nscribe the average behavior of odd-even mass differences,\nassuming that the quantity D1l2 is identified with the ex-\nperimental mass difference @7,12# ~where D is the pairing\ngap, and l2 can be considered as an additional Lagrange\nmultiplier to minimize particle-number fluctuations in the\nLN description!. However, the experimental mass difference\ncontains shape and blocking effects of adjacent odd-mass\nnuclei, while D1l2 does not. A method @8# to obtain a more\nrealistic pairing strength involves reproducing experimental\nmass differences using a five-point formula @12# in both ex-\nperiment and theory. In this method, the shape and blocking\neffects are included. The PES is computed by the Strutinsky\nmethod @7,13# with the standard liquid-drop model and pa-731 ©1999 The American Physical Society\n732 PRC 59F. R. XU, P. M. WALKER, AND R. WYSSrameters of Ref. @14#, in the quadrupole deformation\n(b2 , g) space and with hexadecapole deformation (b4)\nvariation. Such calculations provide a self-consistent way of\ntreating both pairing and deformation.\nIn the mass 130 region, the Kp582 states are based upon\nthe two-quasineutron n$7\/21@404# ^ 9\/22@514#% configura-\ntion. The two orbitals are close to the N574 neutron Fermi\nlevel. Experiments have observed 82 isomers in the even-\neven N574 isotones from 128Xe to 138Gd ~see @1# and ref-\nerences therein!. The present calculations show that shape\npolarization due to the two quasineutrons can be strong, par-\nticularly in the isotones with proton numbers close to the Z\n550 shell gap ~see Fig. 1!.\nIt is known that the A;130 nuclei have g soft shapes\n@15#. The g deformations have been used to explain the ob-\nserved features, such as the signature inversions in the rota-\ntional bands of odd-odd A;130 nuclei @16#. In the present\ncalculations for the N574 isotones, the ground state of\n54\n128Xe, for example, has a very g-soft shape with an energy\nminimum at g'30°, while the 82 isomeric state has an\napproximately prolate shape with g'6° and about a 20%\nincrease in b2 deformation ~see Fig. 1!. For the nucleus,\n52\n126Te, we predict strong shape polarization, though the two-\nquasiparticle 82 state has not been observed yet. The two\nquasineutrons can drive the nucleus from a weakly deformed\n(b2'0.05) oblate ground state to a prolate (b2'0.12)82\nstate. In contrast to the light Pt, Hg, and Pb nuclei ~see be-\nlow! 126Te has no shape-coexisting 01 state in our calcula-\ntion, but a shape-coexisting 82 state is predicted. In the case\nFIG. 1. The determined b2 , g deformations for the Kp582\nisomers and the ground states ~g.s.! in the N574 isotones.of 124Sn, however, the b2 deformation of the calculated 82\nstate becomes smaller, and the PES minimum is no longer\nwithin the deformation space considered.\nIt can be seen from Fig. 1 that the 82 isomers have larger\nb2 deformations than their corresponding ground states for\nZ<60, but the situation is reversed for Z>62. This reversal\nreflects the crossing between the n7\/21@404# and\nn9\/22@514# orbitals at b2'0.25(b4'20.01). Based on\nthese two orbitals, the two quasineutrons can drive nuclei\neither towards larger b2 deformations when b2,0.25 ~i.e.,\nin the Z<60 isotones! or towards smaller b2 values when\nb2.0.25 ~for Z>62). A similar reversal can also be seen in\nthe g deformations ~Fig. 1!. This is because the two\nquasineutrons have a weak g-deformation-driving force\nwhen b2>0.25 ~i.e., for Z>62). As representative ex-\namples, the calculated PES’s for 130Ba and 138Gd are shown\nin Fig. 2.\nThe Kp582 isomeric states in the A;180 nuclei are\nbuilt on the two-quasineutron n$9\/21@624# ^ 7\/22@514#% or\ntwo-quasiproton p$7\/21@404# ^ 9\/22@514#% configuration.\nSystematic experimetal observations can be found in Ref. @2#\n~and references therein!. The Z572 Hf isotopes have well-\ndeformed prolate shapes in both the ground states and the\nisomers ~shown in Fig. 3, g'0 in all cases!. In contrast, the\nN5106 isotones show more variable behaviors. It is well\nknown that various shapes can coexist for proton numbers\nclose to Z582 @5,6,17#. In the present calculations, the\nnucleus 186Hg, for example, has a b2'0.13 oblate ground\nstate and a b2'0.20 prolate coexisting 01 state with a cal-\nculated excitation energy of Ex'600 keV ~experimentally\nEx5523 keV @17#!. The nucleus 188Pb has a spherical\nground state, a b2'0.17 oblate coexisting 01 state with Ex\n'930 keV ~experimetally Ex5571 keV @18#! and a b2\n'0.20 prolate 01 state with Ex'1200 keV ~empirically Ex\nFIG. 2. The calculated PES’s for 130Ba ~left! and 138Gd ~right!.\nThe upper panels are for the ground states, and the lower panels for\nthe 82 isomers. Note that different deformation scales have been\nused in the plots ~because calculations for the 82 configurations\nhave to be limited to ugu,30° due to the requirements of the\nconfiguration-constrained procedure!. The intrinsic PES’s are\nreflection-symmetric about g50°.\nPRC 59 733SHAPE POLARIZATIONS OF TWO-QUASIPARTICLE . . .estimated to be 720 keV @19#!. Their calculated PES’s are\nshown in Fig. 4. For the 82 isomeric states of 186Hg and\n188Pb, the calculations predict sizable prolate deformations\n(b2;0.25; see Table I! implying striking examples of shape\ncoexistence between the isomers and their respective ground\nFIG. 3. The determined b2 deformations and g softnesses for\nthe Kp582 isomers and the ground states ~g.s.! in the N5106\nisotones and Z572 isotopes. For all the isomers, g;0°. The g\nsoftness is defined @21# as the difference in the g-value between the\nPES minimum and 100 keV above the minimum. For each of the\nZ572 isotopes, the g softness is about 5°.\nFIG. 4. Similar to Fig. 2, but for 186Hg ~left! and 188Pb ~right!.states. Indeed, an 82 isomer has been observed @17,20# in\n186Hg, with a rotational band that is consistent with a pro-\nlate, shape-coexisting interpretation. However, there is no\ncorresponding isomer yet observed in 188Pb, where our cal-\nculations indicate the greatest difference in b2-value be-\ntween the 82 state and the ground state.\nThe calculated excitation energies of the two-\nquasineutron 82 isomeric states are listed in Table I, show-\ning good agreement with the experimental values. The pre-\ndicted energy in 126Te is significantly higher than in the\nadjacent isotone 128Xe, which can be understood to be due to\na large particle-hole excitation energy between the\nn9\/22@514# and n7\/21@404# orbitals at small b2 deforma-\ntion. The predicted 82 isomer in 140Dy is calculated to have\nsimilar properties to its isotone 138Gd. It has been pointed\nout @8# that the detailed excitation energies can be affected\nby residual interactions between quasiparticles, zero-point\nrotational energies and possible non-orthogonality, which are\nnot accounted for in the present calculations. However, these\neffects should not significantly alter the predicted variations\nwith nucleon number, and they should not alter the calcu-\nlated deformations.\nAlthough quantitative transition-rate calculations are be-\nyond the scope of this work, it is nevertheless useful to dis-\ncuss briefly the way that the calculated shapes may influence\nthe half-lives of the isomers. The approach towards a closed\nshell might generally be expected to be accompanied by a\nbreakdown of the K quantum number, hence leading to\nshorter half-lives, due to decreasing b2 deformation and in-\ncreasing g deformation. However, inspection of Figs. 1 and\n3 does not support this view, at least not in a simple way.\nRather, the figures illustrate a divergence of the ground-state\nand isomer deformations ~both b2 and g) as the Z550 and\n82 closed shells are approached. The observed increase in the\nexperimental E1 hindrance factors @1,2# may reflect shape\ndifferences rather than K-value differences. Further clarifica-\ntion of this effect will be sought.\nTABLE I. Calculated excitation energies Ecal ~in keV! and de-\nformations of the two-quasineutron Kp582 isomers. The experi-\nmental energies Eexpt ~in keV! can be found in Refs. @1,2# and\nreferences therein.\nNuclei Eexpt Ecal b2 b4 ugu\n126Te 2980 0.12 20.005 0°\n128Xe 2787 2490 0.16 20.008 6°\n130Ba 2475 2390 0.18 20.015 6°\n132Ce 2340 2220 0.20 20.020 5°\n134Nd 2294 2140 0.22 20.023 10°\n136Sm 2264 2120 0.24 20.024 12°\n138Gd 2233 2130 0.25 20.028 13°\n140Dy 2150 0.26 20.039 9°\n176Yb 1050 1140 0.28 20.053 0°\n178Hf 1148 1320 0.27 20.055 0°\n180W 1529 1560 0.25 20.047 0°\n182Os 1832 1760 0.22 20.040 0°\n184Pt 1844 1885 0.24 20.028 1°\n186Hg 2217 2230 0.25 20.022 1°\n188Pb 2400 0.26 20.011 2°\n734 PRC 59F. R. XU, P. M. WALKER, AND R. WYSSIn conclusion, systematic investigations of the observed\ntwo-quasiparticle 82 isomeric states have been carried out\nwith configuration-constrained PES calculations. Strong\nshape polarizations have been found, especially in the nuclei\napproaching the Z550 and 82 closed shells. The calculated\nshape changes, particularly the g deformations, can be im-\nportant for understanding the observed behaviors of the iso-\nmers, such as the decay properties. The calculated excitationenergies reproduce well the measured values. Predictions of\nthe 82 states are made for 188Pb,126Te and 140Dy. The 188Pb\ncase could provide the most striking example of the effect of\nshape coexistence.\nThis work was supported by the U.K. Engineering and\nPhysical Sciences Research Council and the Swedish Natural\nResearch Council.@1# A. M. Bruce et al., Phys. Rev. C 55, 620 ~1997!.\n@2# P. M. Walker, G. D. Dracoulis, A. P. Byrne, T. Kibe´di, and A.\nE. Stuchbery, Phys. Rev. C 49, 1718 ~1994!.\n@3# D. M. Cullen et al., Phys. Rev. C 58, 846 ~1998!.\n@4# P. Campbell et al., in Second International Conference on Ex-\notic Nuclei and Atomic Masses, Shanty Creek Resort, Bellaire,\nMichigan, 1998, edited by Bradley M. Sherrill and Cary N.\nDavids, AIP Conf. Proc. No. 455 ~AIP, New York, 1998!.\n@5# W. Nazarewicz, Phys. Lett. B 305, 195 ~1993!.\n@6# R. Bengtsson, T. Bengtsson, J. Dudek, G. Leander, W. Naza-\nrewicz, and Jing-ye Zhang, Phys. Lett. B 183, 1 ~1987!.\n@7# W. Nazarewicz, M. A. Riley, and J. D. Garrett, Nucl. Phys.\nA512, 61 ~1990!.\n@8# F. R. Xu, P. M. Walker, J. A. Sheikh, and R. Wyss, Phys. Lett.\nB 435, 257 ~1998!.\n@9# W. Nazarewicz, J. Dudek, R. Bengtsson, T. Bengtsson, and I.\nRagnarsson, Nucl. Phys. A435, 397 ~1985!.\n@10# J. Dudek, Z. Szymanski, and T. Werner, Phys. Rev. C 23, 920\n~1981!.\n@11# H. C. Pradhan, Y. Nogami, and J. Law, Nucl. Phys. A201, 357~1973!.\n@12# P. Mo¨ller and J. R. Nix, Nucl. Phys. A536, 20 ~1992!.\n@13# V. M. Strutinsky, Yad. Fiz. 3, 614 ~1966!; Nucl. Phys. A95,\n420 ~1967!.\n@14# W. D. Myers and W. J. Swiatecki, Ann. Phys. ~N.Y.! 84, 395\n~1969!.\n@15# R. Wyss, A. Granderath, W. Lieberz, R. Bengtsson, P. von\nBrentano, A. Dewald, A. Gelberg, A. Gizon, J. Gizon, S. Har-\nrisopulos, A. Johnson, W. Nazrewicz, J. Nyberg, and K.\nSchiffer, Nucl. Phys. A505, 337 ~1989!.\n@16# R. Bengtsson, H. Frisk, F. R. May, and J. A. Pinston, Nucl.\nPhys. A415, 189 ~1984!.\n@17# W. C. Ma et al., Phys. Rev. C 47, R5 ~1993!.\n@18# N. Bijnens et al., Z. Phys. A 356, 3 ~1996!.\n@19# J. Heese et al., Phys. Lett. B 302, 390 ~1993!.\n@20# M. G. Porquet, G. Bastin, C. Bourgeois, A. Korichi, N. Perrin,\nH. Sergolle, and F. A. Beck, J. Phys. G 18, L29 ~1992!.\n@21# A. Granderath, P. F. Mantica, R. Bengtsson, R. Wyss, P. von\nBrentano, A. Gelberg, and F. Seiffert, Nucl. Phys. A597, 427\n~1996!.\n"}