{"doi":"10.1057\/sub.2009.29","coreId":"95675","oai":"oai:eprints.lse.ac.uk:25849","identifiers":["oai:eprints.lse.ac.uk:25849","10.1057\/sub.2009.29"],"title":"Book review: that obscured subject of violence","authors":["Kirby, Paul"],"enrichments":{"references":[{"id":17238384,"title":"100 Myths About The Middle East. London: Saqi Books. Horkheimer,","authors":[],"date":"2005","doi":null,"raw":"Halliday, Fred (2005) 100 Myths About The Middle East. London: Saqi Books. Horkheimer, Max (2004) [1947] Eclipse Of Reason. London: Continuum.","cites":null},{"id":17238385,"title":"Arab Political Humour.","authors":[],"date":"1985","doi":null,"raw":"Kishtainy, Khalid (1985) Arab Political Humour. London: Quartet Books.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-04","abstract":"An extended book review of Slavoj Zizek's 2008 book 'On Violence', published as part of a special issue on Slavoj Zizek and Political Subjectivity, in Subjectivity: International Journal of Critical Psychology, 3(1), April 201","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/95675.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/25849\/1\/That_obscured_subject_of_violence_%28LSERO_version_post_publication%29.pdf","pdfHashValue":"ccda929baac0407addd8b812fea3053444c00274","publisher":"Palgrave Macmillan","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:25849<\/identifier><datestamp>\n      2016-06-20T11:16:48Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5053<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D4952<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D504253<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/25849\/<\/dc:relation><dc:title>\n        Book review: that obscured subject of violence<\/dc:title><dc:creator>\n        Kirby, Paul<\/dc:creator><dc:subject>\n        JC Political theory<\/dc:subject><dc:description>\n        An extended book review of Slavoj Zizek's 2008 book 'On Violence', published as part of a special issue on Slavoj Zizek and Political Subjectivity, in Subjectivity: International Journal of Critical Psychology, 3(1), April 2010<\/dc:description><dc:publisher>\n        Palgrave Macmillan<\/dc:publisher><dc:date>\n        2010-04<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/25849\/1\/That_obscured_subject_of_violence_%28LSERO_version_post_publication%29.pdf<\/dc:identifier><dc:identifier>\n          Kirby, Paul  (2010) Book review: that obscured subject of violence.  Subjectivity, 3 (1).  pp. 117-121.  ISSN 1755-6341     <\/dc:identifier><dc:relation>\n        http:\/\/www.palgrave-journals.com\/sub\/index.html<\/dc:relation><dc:relation>\n        10.1057\/sub.2009.29<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/25849\/","http:\/\/www.palgrave-journals.com\/sub\/index.html","10.1057\/sub.2009.29"],"year":2010,"topics":["JC Political theory"],"subject":["Article","NonPeerReviewed"],"fullText":"  \nPaul Kirby\nThat obscured subject of violence [book \nreview] \n \nArticle (Submitted version) \n(Pre-refereed) \nOriginal citation: \nKirby, Paul (2010) That obscured subject of violence [book review]. Subjectivity, 3 (1). pp. 117-\n121. ISSN 1755-6341\n \nDOI: 10.1057\/sub.2009.29\n \n© 2010 Palgrave Macmillan\n \nThis version available at: http:\/\/eprints.lse.ac.uk\/25849\/ \n \nAvailable in LSE Research Online: November 2009 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s submitted version of the journal article, before the peer review \nprocess.  There may be differences between this version and the published version.  You are \nadvised to consult the publisher’s version if you wish to cite from it. \nFor more research by LSE authors go to LSE Research Online   \n'That Obscured Subject Of Violence'\nReview of Slavoj Žižek's On Violence\nTo be published in Subjectivity: International Journal of Critical Psychology, \nIssue 3(1), April 2010: Special Issue on Žižek and Political Subjectivity\nPre-Print Copy\nPaul Kirby\nDepartment of International Relations\nLondon School of Economics & Political Science\nHoughton Street\nLondon\nWC2A 2AE\np.kirby@lse.ac.uk\nNovember 2009\nThat Obscured Subject Of Violence\nS. Žižek, On Violence\nProfile Books, London, 2008, (Pbk)\nISBN-10: 1846680174; ISBN-13: 978-1846680175\n£12.99\nIn the preface to Eclipse Of Reason, written in 1944 as Europe was exhausting one of its greatest \ncycles of transformative violence, Max Horkheimer set himself in favour of thought and against any \nincitement to action which “obliterate[d] that very substance of reason in the name of which this \nprogress is espoused” (Horkheimer, 2004:vi). The same sentiment animates the opening passages \nof  On Violence,  in which Slavoj  Žižek rejects the “fake sense of urgency that pervades the left-\nliberal humanitarian discourse on violence” (p. 5). Instead, he proposes to 'look awry' at violence, \nto turn contemporary delusions and certainties in such a way as to better perceive a triumvirate: \nnot only the 'subjective' violence “performed by a clearly identifiable agent” but also the two forms \nof  'objective'  violence:  the  symbolic  violence  of  language  and  the  systemic  violence  which \nencompasses “the often catastrophic consequences of the smooth functioning of our economic and \npolitical systems” (p. 1). In doing so,  Žižek hopes to disentangle us from our obsession with the \npornography of  force,  our persistent cries  that  'something must  be done',  and our consequent \ndistraction from “the true locus of trouble” (p. 9). \nIt is a common enough accusation that Žižek makes more sense out of context than in it, and it is \nstill  true that our bursts of comprehension come not from a careful delineation of thought, but \nfrom provocations, diversions and interruptions. By these standards, there is plenty of insight to \nOn Violence,  from the biting characterisation of 'liberal communists' like Bill Gates who peddle \nboth the diseases of capitalism and the putative cure of philanthropy (pp. 13-25), to the Lacanian-\ninspired racial 'subject supposed to loot and rape' found in media depictions of a post-Katrina New \nOrleans (pp. 79-85). There is a persuasive diagnosis of the Parisian banlieue riots of 2005 as 'zero-\nlevel'  protests,  as  a  politics  consisting  of  the  simple  assertion of  visibility  (pp.  63-69),  and  of \ntolerance  as  an  ideological  category  that  replaces ideas  of  exploitation,  injustice  or  inequality \nthrough a 'culturalisation of politics' (p. 119). Indeed, much of the book is dedicated to this now \nwell-established  critique  of  tolerant  liberal  reason  which,  together  with  arguments  against  the \nanalytical  neglect  of  objective violence by 'the left',  builds towards a final  consideration of  the \nnature and promise of revolutionary violence. \nBut if Žižek stakes his case through such fragments, through a 'bric-a-brac of reflections', what does \nattention to them tell us about the argument which we are meant to be perceiving awry? Two lines \nof  thought seem particularly promising.  In the first,  Žižek returns to  the obstinate problem of \nideology,  pursued  in  this  case  as  a  generalised  set  of  social  rules  that  allows  Belief  without \nbelievers. These implicit codes operate as an “obscene underground” that generates behaviour in \nthe face of official disavowal, whether in the gap between homophobia and homosexual innuendo \nin the military or as a 'solution' to the false choice of torture at Abu Ghraib as originating from \neither the highest political authorities or as the initiative of brutal entrepreneurs from the lower \nranks (pp. 145-150). To see ideology in this way is to understand its capacity for generating inner \ndistance and to hint at how objective violence is obscured by its operations. \nIn the second compelling theme, a kind of emancipatory potential is recovered for the notion of \nequality-freedom from a reconsideration of the dialectic of the universal and the particular. The \ntension or gap between the brute reality of inequality and formal political rights is not, for Žižek, \nthe apparently crude one between a driving socio-economic structure and a peripheral 'echo' but a \ngap in which the superficial  appearance has its  own power to 're-articulate'  relations.  Symbolic \nfictions have efficiency (pp. 127-134). Similarly, 'abstract' notions like 'the rights of women' have a \nuniversal  power in particular life-worlds,  just  as  specific  struggles intrude on our imagining of \nhumanity  as  a  whole,  as  the  particular  “becomes  'for-itself',  and  is  directly  experienced  as  \nuniversal”  (p. 129).  Consequently, it  is not  enough to say that  the claims of universality  mask \nspecific  interests,  but  also  to  examine  how  form has  its  own  power  in  a  way  that  ultimately \nundermines  the  particularism  with  which  it  was  invested  (pp.  125-128).  Although  the \naccompanying  caricatures  of  feminists,  post-modernists  and  post-colonialists  obsessed  with \nidentity  politics  occasionally  reads  like  a  right-wing  fantasy  (as  if  there  are  legions  of  leftists \nadvocating 'respect' for female genital mutilation), this way of putting the problem does escape a \nnumber  of  false  antagonisms,  transferring  our  attention  to  how we  articulate  the  relationship \nbetween specificity and generality, between universality and difference, rather than compelling us \nto choose one or other side.\nOther themes appear similarly  promising but remain frustratingly insubstantial.  One trajectory \nsuggests that fetishistic disavowal is at the heart of any ethics. How, Žižek asks, could one continue \nto eat pork having seen the suffering of animals for oneself? We can only 'go on' if we choose to \nforget, if we accept that our ethico-political programmes must have a constituent outside, and that \nthis forgetting is not a flaw but the positive condition of possibility for ethical thought (pp. 45-49). \nAs usual, there is something persuasive here. But it is quickly drowned out by the unanswered \nquestions such a position raises. For example, at least part of the argument implies that ethical \ncommitment is a zero-sum game, so that we must accept, or rather ignore, some forms of suffering \nto alleviate others. Yet that a constant, real-time cognisance of all sentient misery is not possible \ndoes  not  exhaust  the  claims that  ethical  reasoning may  make on  us.  After  all,  if  to  recognise \nsuffering and not act on it is congruent with an ethical life, then what is the ethical status of the \ndecision to become a vegetarian? If we previously thought of ethics as following through on one's \nconvictions, even if the cost to oneself was great, should we now say that ethics is really about \nignoring one's own conscience, even if the cost to others is great?  And what are we do with the \nfollowing  paradox:  the  kind  of  position  in  liberal  communism  that  Žižek  lambasts  is  one  of \nfetishistic  disavowal  –  acknowledging  the  painful  inequalities  caused  by  capitalism  but  then \nforgetting  it  in  favour  of  self-satisfaction  at  its  own  philanthropy.  Can  we  not  say  that  this, \ncombined with the injunction to think instead of act, is precisely the mind-set best-suited to today's \npostmodern corporate power? \nThat would even seem to be an eminently Žižekian position, and there are several provocations in \nOn  Violence which  involve  not  only  analytical  thinness,  but  also  this  kind  of  apparent \ncontradiction. To take another example, it is argued that the ideological function of 'tolerance' is \nparalleled by the rationalistic attempt to “understand the Other from within”, an attempt which \nactually ends up imputing the most ridiculous beliefs as the true cause of action, as in the thesis \nthat suicide bombing is the 'rational' choice of those seeking 400 virgins in paradise (p. 71). But \nthis tempting line of thought is somewhat undermined when we are treated to precisely such a \nmanoeuvre by Žižek, who claims that both “thoroughly secularised writing” and Monty Python are \n“unimaginable  in  an  Islamic  culture”  (p.  90).  This  view  of  a  monolithic  'Islam'  incapable  of \nreligious satire or non-metaphysical reflection is not only inaccurate, but deprives us of the kind of \npsychoanalytical hay that  Žižek might have made of actual Islamic humour, as in the apparent \nwealth of jokes based on the ease with which the Arabic for 'God' can be turned into the word for \n'penis'1.\nBut  what  of  revolutionary  violence?  Žižek  casts  the  basic  problem  via  the  homology  between \nFreud's dream of Irma's injection and Job's encounter with the brutal will of God. In both cases, \ninterpreters attempt to mask the horror of the Real, “to disguise the impact of the trauma with a \nsymbolic semblance” (p. 153). Just as Freud and Job should have refused these gestures towards \nintelligibility and closure, so we must refuse the temptations of deeper meaning when considering \nWalter Benjamin's Angel of History. In a series of examples, Žižek makes clear that divine violence \nis not the will of the people, nor the necessary means adopted for a given end. It is not abstract and \npure. Like the Jacobin Terror, or the Red Terror, it fits Badiou's category of an Event. It lacks any \nBig Other which can confer upon it an agreed meaning within the symbolic order. Neither pure \nviolence nor the exception which founds the law, it is like the shattering of identity that goes under \nthe name of Love, hence Žižek's invocation of Che Guevara and revolution as “the subject's work of  \nlove” (p. 172). It follows that divine violence cannot be the tool of a vanguard on behalf of 'the \npeople', which is the sense in which Stalin's attempt at collectivisation, valourised here as “truly \ndaring...try[ing]  the  impossible”  (p.  177),  was  ultimately  insufficient,  since  it  turned  into  the \n'impotent'  simulacrum of  cleansing that  was the Purges.  Instead,  divine violence is  “the  heroic \nassumption of the solitude of sovereign decision...If it is extra-moral,  it is not 'immoral'...When \nthose  outside  the  structured  social  field  strike  'blindly',  demanding  and  enacting  immediate \njustice\/vengeance, this is divine violence” (p. 171). \nAn obvious immediate problem concerns  Žižek's replication of the binary choice of much liberal \ncommentary on revolution. On the one hand, the safe, 'realistic' world of inequality, consumption \nand false 'tolerance', run by a managerialist elite who dispense charity as they reap the rewards of \nthe system. On the other, an authentic subaltern resentment, dreams of impossible equality and \nthe transformative Event, necessarily horrific, which we cannot assuage with empty attempts at \nincremental progress, or even properly understand with our faulty ethical categories. The relevant \nquestion, so clarified, simply becomes whether to embrace or oppose such a historic moment. The \nforeclosure of other ways of thinking about social change is evident but the shift from a critique of \nfalse tolerance to a championing of true acts of revolutionary daring is somewhat obscured by the \nargument's  under-development.  We  do  not  discover  why  the  repudiation  of  all  these  liberal \nideological vices should lead us so swiftly to an acceptance that only a true Year Zero can realise an \nend to objective violence.\nThrough  all  this,  Žižek  is  certainly  endorsing  divine  violence  (p.  174),  but  what  kind  of \nendorsement is it? By the closing paragraphs, he is arguing that doing nothing can be the most \nviolent  choice,  can  cause  more  upheaval  than  the  current  dreams  of  humanitarians  or  the \napparently insufficient violence of Mao and Stalin. 'Pseudo-activity' (academic debates, campaigns, \nthe creation of  social  space for 'the multitude') only buttresses the violence of  a system which \nthrives on co-opting its adversaries (p. 183). In the hands of a different theorist, this may have \nbecome a political programme of refusal, an active withdrawing of participation in the games of \npower.  But  Žižek's  version  of  doing  nothing  is  more  thorough-going.  Although  apparently \nparadoxical, it can instead be read as the dialectical materialism of the pessoptimist, as a return to \na  Marxism  dismissive  of  the  progressive  illusions  of  the  bourgeoisie  but  confident  that  the \ndevelopment of capitalism itself will give birth to the divine violence of the proletariat.\nSuch a reading is starkly in conflict with the idea that 'super-structural' symbols have a meaningful \nimpact  on  the  possibilities  of  emancipation.  But  there  is  a  deeper  problem.  Presumably  our \nunderstanding of what constitutes 'suffering' is part of the symbolic order. The desire to alleviate \nsuffering and the  impetus  to  pay  attention to  the  forms of  objective  violence stems from this \nunderstanding, as does the desire for revolutionary social transformation. But if we are to equate \n'true' revolution with divine violence, and also to claim that divine violence is necessarily the kind \nof Event that remakes the entire symbolic order, then the very foundation on which the appeal to \nrevolutionary politics is built dissolves. On what grounds can such an indeterminate re-making of \nthe world be cast as desirable or necessary? Does doing so not simply leave us with an empty \nglorification of a contentless Act? Žižek does seem to intend something along these lines, but we do \nnot discover how such problems are to be resolved, or even if they count as problems at all. \nIn an earlier passage, Žižek revisits anti-Semitism to demonstrate the overdetermined fantasmatic \ndimension of hatred, of the abstract, but libidinally-invested, 'Jew' as the true target of violence (p. \n57).  But it  is  clear that  divine violence plays  a  similar  role in  On Violence,  as  a repository for \ncharged fantasies of its transformative potential. Žižek is, of course, too sophisticated a theorist to \nentertain the idea of ever escaping ideology, which is something like the necessary field of human \nexperience in his thought, but his embrace of this kind of revolutionary optimism, which passes \nwithout a serious consideration of  what it  entails,  allows him to commit fully  to the cleansing \npower of history. In this, he comes very close to what he once diagnosed as a kind of right-wing \nLacanianism2 – the kind that acknowledges the symbolic role of The Father but sees this not as \nsubversive  of  authoritarianism  but  as  its  ultimate  support,  the  required  psychoanalytical \njustification  for  whatever  whims  are  to  be  imposed  on  the  family  or  the  nation.  'Enjoy  your \nSymptom!' indeed. \nIn fact, what the sections on divine violence reveal is the fetishistic disavowal at the heart of Žižek's \nown position – a simultaneous desire to claim that,  despite its  origins,  the formal language of \nuniversal rights has ushered in a series of genuinely emancipatory developments and to see all our \nways of thinking about egalitarian politics as so impoverished as to necessitate the accumulated \nwrath of pure resentment enacted by a coming, but obscured, revolutionary Subject. There is both \nan appeal for thought over action and an implication that the kind of reclamation of reason and \nenlightenment that Horkheimer demanded is illusory. And it would seem then that inner distance \nis not simply the mark of ideology at work in contemporary militarism but also an attitude towards \nnecessary violence that we must accommodate, if not cultivate, at least in as far as we should set \naside  the  concerns  and revulsion that  would otherwise  form our  reaction to  its  consequences, \n“crazy and tasteless as it may sound” (p. 183). \nSo by the end of  On Violence, we are faced not so much with a triumvirate of violence as with a \nfulcrum and a strangely inverse relationship. In one scenario the two forms of objective violence \npersist and grow as we devote attention to the more superficial crimes of subjective violence. In the \nother,  the  eruption  of  (divine)  Subjective  violence  is  the  necessary  cost  for  the  possibility  of \neradicating objective violence, an aim that requires bloody raids on the territory of the impossible. \nSo it is that the possibility of investing our politics with an opposition to all three forms of violence \nevaporates, unremarked. And if there can be no such wholeness in our thinking, and no building of \nthe  structure of  the  new society within the  shell  of  the  old,  and if  the  extension of  particular \nstruggles into the realm of the universal is to be superseded by a  deus in machina, how will we \ndecide whether what is to come is nightmare or utopia?\nNotes:\n1.  See  Kishtainy (1985:12-13).  Both  of  Žižek's characterisations of  Islamic  culture are  common \nmyths, briefly dealt with by Halliday (2005:23-25, 85-86).\n2. During his 'Master Class on Jacques Lacan: A Lateral Introduction', May-June 2006, Birkbeck \nCollege, University of London\nReferences:\nHalliday, Fred (2005) 100 Myths About The Middle East. London: Saqi Books.\nHorkheimer, Max (2004) [1947] Eclipse Of Reason. London: Continuum.\nKishtainy, Khalid (1985) Arab Political Humour. London: Quartet Books.\n"}