{"doi":"10.1017\/S0047279404008542","coreId":"66053","oai":"oai:dro.dur.ac.uk.OAI2:3476","identifiers":["oai:dro.dur.ac.uk.OAI2:3476","10.1017\/S0047279404008542"],"title":"Cash versus services : 'worlds of welfare' and the decommodification of cash benefits and health care services.","authors":["Bambra,  C."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-04-01","abstract":"Welfare state models have focused almost exclusively on the study of cash benefits, and typologies established on this limited basis have been used to generalise about all forms of welfare state provision. This ignores the fact that welfare states are also about the actual delivery of services and\/or that countries vary in terms of the relative emphasis that they place upon cash benefits and welfare state services. This article explores the cash and services mix in, and between, welfare states with reference to recent welfare state typologies, most notably Esping-Andersen's decommodification-centred ‘worlds of welfare’. It compares the decommodification levels of the main cash benefits with the main area of service provision: health care. The resulting analysis suggests that when services are added into the comparative analysis of welfare state regimes there are five welfare state clusters: Social Democratic, Liberal, Conservative, and sub-groups within both the Liberal and Conservative regimes. The article concludes that, in order to maintain integrity or generalisability, future welfare state typologies need to reflect more adequately the role of services in welfare state provision","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66053.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3476\/1\/3476.pdf","pdfHashValue":"330d463275f6e518698ed2dde5a5f11eabcdbfa1","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:3476<\/identifier><datestamp>\n      2011-08-25T15:56:44Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Cash versus services : 'worlds of welfare' and the decommodification of cash benefits and health care services.<\/dc:title><dc:creator>\n        Bambra,  C.<\/dc:creator><dc:description>\n        Welfare state models have focused almost exclusively on the study of cash benefits, and typologies established on this limited basis have been used to generalise about all forms of welfare state provision. This ignores the fact that welfare states are also about the actual delivery of services and\/or that countries vary in terms of the relative emphasis that they place upon cash benefits and welfare state services. This article explores the cash and services mix in, and between, welfare states with reference to recent welfare state typologies, most notably Esping-Andersen's decommodification-centred ‘worlds of welfare’. It compares the decommodification levels of the main cash benefits with the main area of service provision: health care. The resulting analysis suggests that when services are added into the comparative analysis of welfare state regimes there are five welfare state clusters: Social Democratic, Liberal, Conservative, and sub-groups within both the Liberal and Conservative regimes. The article concludes that, in order to maintain integrity or generalisability, future welfare state typologies need to reflect more adequately the role of services in welfare state provision.<\/dc:description><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:source>\n        Journal of social policy, 2005, Vol.34(2), pp.195-213 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2005-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3476<\/dc:identifier><dc:identifier>\n        issn:0047-2794<\/dc:identifier><dc:identifier>\n        issn: 1469-7823<\/dc:identifier><dc:identifier>\n        doi:10.1017\/S0047279404008542<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3476\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1017\/S0047279404008542<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3476\/1\/3476.pdf<\/dc:identifier><dc:rights>\n        © 2005 Cambridge University Press.\\ud\n\\ud\nThis paper has been published in a revised form subsequent to editorial input by Cambridge University Press in \"Journal of social policy\" (34: 2 (2005) 195-213)  http:\/\/journals.cambridge.org\/action\/displayJournal?jid=JSP.\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1469-7823","issn:0047-2794"," 1469-7823","0047-2794"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n23 May 2008\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBambra, C. (2005) ’Cash versus services : ’worlds of welfare’ and the decommodification of cash benefits and\nhealth care services.’, Journal of social policy., 34 (2). pp. 195-213.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1017\/S0047279404008542\nPublisher’s copyright statement:\n2005 Cambridge University Press. This paper has been published in a revised form subsequent to editorial input by\nCambridge University Press in ”Journal of social policy” (34: 2 (2005) 195-213)\nhttp:\/\/journals.cambridge.org\/action\/displayJournal?jid=JSP.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 3042 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n \nDeposited in DRO: \n23 May 2008. \n \nVersion of attached file: \nPublished. \n \nPeer-review status of attached file: \nPeer-reviewed. \n \nCitation for published item: \nBambra, C. (2005) 'Cash versus services : 'worlds of welfare' and the \ndecommodification of cash benefits and health care services.' , Journal of social \npolicy., 34 (2), pp. 195-213. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1017\/S0047279404008542\n \nJnl Soc. Pol., 34, 2, 195–213 C© 2005 Cambridge University Press\ndoi:10.1017\/S0047279404008542 Printed in the United Kingdom\nCash Versus Services: ‘Worlds of Welfare’\nand the Decommodification of Cash\nBenefits and Health Care Services\nCLARE BAMBRA\nSocial Policy and Sociology, Collegiate Crescent Campus, Sheffield Hallam University,\nSheffield S10 2BP\nemail: c.bambra@shu.ac.uk\nAbstract\nWelfare state models have focused almost exclusively on the study of cash benefits, and\ntypologies established on this limited basis have been used to generalise about all forms of\nwelfare state provision. This ignores the fact that welfare states are also about the actual delivery\nof services and\/or that countries vary in terms of the relative emphasis that they place upon\ncash benefits and welfare state services. This article explores the cash and services mix in, and\nbetween, welfare states with reference to recent welfare state typologies, most notably Esping-\nAndersen’s decommodification-centred ‘worlds of welfare’. It compares the decommodification\nlevels of the main cash benefits with the main area of service provision: health care. The resulting\nanalysis suggests that when services are added into the comparative analysis of welfare state\nregimes there are five welfare state clusters: Social Democratic, Liberal, Conservative, and sub-\ngroups within both the Liberal and Conservative regimes. The article concludes that, in order\nto maintain integrity or generalisability, future welfare state typologies need to reflect more\nadequately the role of services in welfare state provision.\nIntroduction\nWelfare state modelling has long been a preoccupation of comparative social\npolicy (Wilensky and Lebraux, 1958; Titmuss, 1974; Therborn, 1987; Esping-\nAndersen, 1990; Castles and Mitchell, 1993). Recently, the literature has been\ndominated by the extensive, and on-going, debate that has surrounded Esping-\nAndersen’s influential analysis of welfare state decommodification and the\nresulting ‘three worlds of welfare’ typology (Esping-Andersen, 1990, 1999; Lewis,\n1992; Leibfried, 1992; Castles and Mitchell, 1993; Orloff, 1993; Borchost, 1994;\nDaly, 1994; Kangas, 1994; Ragin, 1994; Ferrera, 1996; Bonoli, 1997; Goodin\net al., 1999; Sainsbury, 1994, 1999; Abrahamson, 1999; Pitruzzello, 1999; Arts and\nGelissen, 2002; Kasza, 2002). However, what is remarkable about this debate is\nthat, while there are numerous critiques about his range (Leibfried, 1992; Castles\nand Mitchell, 1993; Ferrera, 1996; Bonoli, 1997), his methodology (Kangas, 1994;\nRagin, 1994; Pitruzzello, 1999) and the absence of gender in his typology\n196 clare bambra\n(Lewis, 1992; Orloff, 1993; Sainsbury, 1994, 1999; Bambra, 2004a), core procedures\nhave attracted less attention: the analytical focus on cash benefits (Alber, 1995;\nAbrahamson, 1999; Kautto, 2002; Bambra, 2005) and the creation of regimes that\ngeneralise about all forms of social policy provision from this base (Kasza, 2002).\nThis ignores the fact that welfare states are also about the actual delivery of\nservices, such as health, education or social care, and that, far from being internally\nconsistent, countries vary in terms of the relative emphasis that they place upon\ncash benefits and\/or welfare state services (Korpi and Palme, 1998; Castles, 1998;\nKautto, 2002). Indeed, welfare services may well account for the greatest differen-\nces both between and within countries’ welfare state arrangements (Castles, 1998).\nHealth care is by far the largest area of welfare state service delivery,\naccounting as it does for an average of 6.6 per cent of GDP in the EU member\nstates (Eurostat, 2001). Although it has been subject to extensive separate com-\nparative analysis (Ham, 1997; Moran, 1999, 2000; Freeman and Moran, 2000;\nFreeman, 2000), health care has been a significant and notable omission from\nthe broader welfare state literature and particularly the regimes debate (Bambra,\n2005). However, as some commentators such as Ginsburg (1992) and Moran\n(1999) have suggested, it is a strong example of internal welfare state inconsistency\nin the provision of cash benefits and welfare services. They assert that there is a\nsignificant difference between the principles behind the UK’s market-orientated\ncash benefit programmes and its state-dominated health care provision. This\ndiscrepancy has also been touched upon in exploratory research by the author\non the health care provision of different welfare states (Bambra, 2005). This\narticle takes such analysis further by examining in depth the cash and services\nmix in, and between, welfare states through the detailed comparison of the\ndecommodification levels of the main cash benefits (pensions, sickness and\nunemployment) with the main area of service provision: health care.\nThe article proceeds with a brief outline of Esping-Andersen’s ‘three worlds\nof welfare’ thesis and the subsequent debate that has emerged around it. It then\ndiscusses the concept of decommodification and presents an updated version\nof Esping-Andersen’s cash benefit decommodification index and a similarly\nconstructed health care services index. The results of these two indexes are\ncompared and used to explore the internal and external diversity of countries’\ncash benefit and welfare service arrangements, and what they mean for the ‘three\nworlds of welfare’ and welfare state modelling.\nThe ‘Three Worlds of Welfare’\nIn The Three Worlds of Welfare Capitalism, Esping-Andersen argues that ‘existing\ntheoretical models of the welfare state are inadequate’ (1990: 2) as their analysis\nrelies too heavily upon the misleading comparison of aggregate welfare state\nexpenditure. The focus on total expenditure figures conceals the variety of state\napproaches to welfare as, ‘even if the lion’s share of expenditure or personnel\ncash versus services 197\nTABLE 1. The three worlds of welfare.\nLiberal Conservative Social Democratic\nAustralia Austria Denmark\nCanada Belgium Finland\nIreland France Norway\nNew Zealand Germany Sweden\nUK Italy\nUSA Japan\nNetherlands\nSwitzerland\nSource: adapted from Esping-Andersen, 1990: 52.\nserves welfare aims, the kind of welfare provided will be qualitatively different,\nas will its prioritisation relative to competing activities’ (1990: 1). He asserts that\nit is therefore more beneficial to focus upon what a welfare state does, rather\nthan how much money it is afforded. On this basis, Esping-Andersen (1990:\n52) presents a three-fold typology of welfare state regimes based largely on the\nprinciple of labour market decommodification: Liberal, Conservative and Social\nDemocratic (see Table 1).\nIn the welfare states of the Liberal regime (UK, USA, Ireland, Canada,\nAustralia), state provision of welfare is minimal, benefits are modest and often\nattract strict entitlement criteria, and recipients are usually means-tested and\nstigmatised (Esping-Andersen, 1990: 26). In this model, the dominance of the\nmarket is encouraged both passively, by guaranteeing only a minimum, and\nactively, by subsidising private welfare schemes (ibid: 27). The Liberal welfare\nstate regime thereby minimises the decommodification effects of state welfare\nand a stark division exists between those, largely the poor, who rely on state aid\nand those who are able to afford private provision.\nThe Conservative welfare state regime (Germany, France, Austria, Belgium,\nItaly and, to a lesser extent, the Netherlands) is distinguished by its ‘status\ndifferentiating’ welfare programmes in which benefits are often earnings-related,\nadministered through the employer, and geared towards maintaining existing\nsocial patterns. The role of the family is also emphasised and the redistributive\nimpact is minimal. However, the role of the market is marginalised, and therefore\nEsping-Andersen places it between the low decommodifying Liberal regime and\nthe highly decommodifying Social Democratic regime (1990: 27).\nThe ‘third world of welfare’, the Social Democratic (Nordic countries), is the\nclearly the smallest regime cluster. Its provision is characterised by universal and\ncomparatively generous benefits, a commitment to full employment and income\nprotection, and a strongly interventionist state. The state is used to promote\nsocial equality through a redistributive social security system. Unlike the other\nwelfare state regimes, the Social Democratic regime type ‘promotes an equality\n198 clare bambra\nof the highest standards, not an equality of minimal needs’ and it provides ‘a\nmix of highly decommodifying and universalistic programs’ (Esping-Andersen,\n1990: 28).\nThe ‘worlds of welfare’ debate\nThis ‘three worlds’ typology has sparked a volatile and ongoing debate (Sainsbury,\n1999; Goodin et al., 1999; Pitruzzello, 1999; Arts and Gelissen, 2002; Kasza, 2002)\nand, indeed, much of the burgeoning comparative welfare state literature since\n1990 can be seen as a ‘settling of accounts’ with Esping-Andersen (Pierson, 1998:\n175). This debate has been dominated by three principle critiques: the range\n(Leibfried, 1992; Castles and Mitchell, 1993; Ferrera, 1996; Bonoli, 1997), the\nmethodology (Kangas, 1994; Ragin, 1994; Pitruzzello, 1999) and the omission\nof gender in the analysis (Lewis, 1992; Orloff, 1993; Borchost, 1994; Daly, 1994,\nSainsbury, 1999). Two other critiques of the ‘three worlds of welfare’ typology,\nand indeed of welfare state modelling as a whole, have been less prominent: the\nusefulness of the regimes concept (Kasza, 2002) and the focus on cash benefits\n(Alber, 1995; Abrahamson, 1999; Kautto, 2002).\nThe limited range\nThe range of countries used to construct Esping-Andersen’s typology has met\nwith criticism (Leibfried, 1992; Castles and Mitchell, 1993; Ferrera, 1996; Bonoli,\n1997). Leibfried (1992), Ferrera (1996) and Bonoli (1997) assert that a distinctive\nfourth type of welfare state regime is emerging in the countries of the Latin rim\nof the European Union (Spain, Portugal, Greece and, to a lesser extent, Italy).\nLeibfried (1992) describes these welfare states as ‘rudimentary’ because they are\ncharacterised by their fragmented system of welfare provision, which consists of\ndiverse cash benefit schemes that range from the meagre to the generous, and a\nhealth care system that provides only limited and partial coverage.\nCastles and Mitchell (1993) similarly challenge the notion that there are only\nthree worlds of welfare. They cross-classify the same 18 OECD nations used by\nEsping-Andersen and examine their high and low aggregate expenditure levels,\nand their high and low degrees of benefit equality. On the basis of this analysis,\nthey claim that a fourth, ‘radical’, world of welfare should be added to the thesis\n(Castles and Mitchell, 1993: 107). They argue that the UK, Australia and New\nZealand constitute a ‘radical’ form of welfare state regime, one in which ‘the\nwelfare goals of poverty amelioration and income equality are pursued through\nredistributive instruments rather than by high expenditure levels’ (Castles and\nMitchell, 1993: 107).\nThe methodological approach\nA more general methodological critique of Esping-Andersen has been\ndeveloped through the use of cluster analysis. Kangas (1994) performed a cluster\nanalysis of indicators of sickness insurance for the same 18 OECD countries. The\ncash versus services 199\nresults broadly confirmed Esping-Andersen’s ‘three worlds’ thesis, although the\nexistence of a coherent Liberal regime was questioned: no clear Liberal regime\ncluster was identified as, while the UK, Ireland, New Zealand and Australia\nwere merged together, the USA and Canada were separate outliers. However,\na more comprehensive cluster analysis (Pitruzello, 1999) of all three of Esping-\nAndersen’s decommodification factors (sickness, pensions and unemployment)\nrevealed a number of significant discrepancies. Pitruzzello’s research showed\nsignificant support for the existence and distinctiveness of welfare regimes, but it\nchallenged the empirical accuracy of the ‘three worlds’ typology: the antipodes\nwere identified as a distinctive fourth cluster and a sub-group of the corporatist\ncluster emerged. This suggested that there could be four or five ‘worlds of welfare’\n(Pitruzello, 1999: 23–50).\nThe gender blind ‘worlds of welfare’\nThis is perhaps the most developed and influential critique of the ‘three\nworlds of welfare’ (Esping-Andersen, 1999; Bambra, 2004). Feminist comment-\nators (such as Lewis, 1992; Borchost, 1994; Bussemaker and Kersbergen, 1994;\nDaly, 1994; Hobson, 1994; Lewis and Ostner, 1995; Sainsbury, 1994, 1999) have\nargued that Esping-Andersen’s ‘three worlds of welfare’ typology is deeply flawed\nbecause it marginalised women in its analysis. Aside from the overt absence of\nwomen in Esping-Andersen’s analysis, the critique revolves around three other\nissues: the gender blind concept of decommodification (Daly, 1994; Hobson,\n1994; Lewis, 1992), the unawareness of the role of women and the family in\nthe provision of welfare (Borchost, 1994; Bussemaker and Kersbergen, 1994;\nDaly, 1994), and the lack of consideration given to gender as a form of social\nstratification (Bussemaker and Kersbergen, 1994). These criticisms have in turn\nled to both theoretical attempts to ‘gender’ Esping-Andersen’s analysis (for\nexample, Orloff, 1993; O’Connor, 1993), and the construction of alternative\nwelfare state typologies in which gender has been a more overt and centralised\npart of the analysis (for example, Lewis, 1992; Lewis and Ostner, 1995; Sainsbury,\n1999). These alternative typologies, although often flawed themselves (Esping-\nAndersen, 1999), have undermined confidence in the comprehensiveness and\ngeneralisability of the ‘three worlds of welfare’ thesis, especially in respect to any\nclaims about women, welfare and the family.\nThe ‘illusion’ of welfare state regimes\nKasza (2002) has questioned the validity of the regimes concept itself. He\nargues that the concept of welfare regimes incorporates two flawed assumptions:\nfirstly, that most of the key social policy areas, such as income maintenance (cash\nbenefits), education, health or housing, within a welfare regime will reflect a\nsimilar, across the board, approach to welfare provision; and, secondly, that each\nregime type itself reflects ‘a set of principles or values that establishes a coherence\n200 clare bambra\nin each country’s welfare package’ (Kasza, 2002: 272). Kasza asserts that instead\nof an internal policy homogeneity or cohesion, welfare states and welfare regimes\nexhibit significant variation across different areas of social provision. He asserts\nthat the regime concept therefore ‘does not capture the complex motives that\ninform each country’s welfare programs’ and, in pursuit of consistency, it ignores\nthe fact that different areas of welfare state provision exhibit different cross-\nnational variations. Kasza’s critique has been shown to be particularly applicable\nto health care (Bambra, 2005) although it is not without its own limitations\n(Bambra, 2004a).\nThe dominance of cash over services\nThis critique focuses on Esping-Andersen’s decision to organise the principle\nof classification around the study of cash benefit programmes (Alber, 1995;\nAbrahamson, 1999; Kautto, 2002). The ‘three worlds of welfare’ typology is\nlargely based on a comparison of the decommodification of three cash benefit\nprogrammes: pensions, sickness benefits and unemployment benefits. This\nignores the fact that welfare states are also about the actual delivery of services,\nsuch as education, health or social services (Kautto, 2002). It is suggested that\ncountries vary in terms of the emphasis that they place upon welfare state\nservices and\/or social transfers: the Social Democratic welfare states have high\nspending on both cash benefits and welfare services; the Conservative countries\nare more inclined to fund cash benefits than welfare services; and the Liberal\ncountries are divided into two sub-groups, one that is prepared to spend a little\nmore on services and the other that is consistently low in all forms of social\nexpenditure (Castles, 1998). These differences are not adequately reflected in\nEsping-Andersen’s typology.\nThe later two critiques have been less extensively explored both empirically\nand within the regimes debate. This article will now examine what they may mean\nfor the ‘welfare modeling business’ (Abrahamson, 1999) and the construction of\ntypologies through the detailed comparison of a more up-to-date reconstruction\nof Esping-Andersen’s decommodification index with a current index of health\ncare services decommodification.\nDecommodification\nIt is important to acknowledge the importance of going beyond aggregate\nmeasures of welfare and so, in comparing the relative role of cash benefits and\nwelfare services, the concept of decommodification, as pioneered in comparative\nwelfare research by Esping-Andersen, has been kept. Decommodification refers\nto ‘the extent to which individuals and families can maintain a normal and\nsocially acceptable standard of living regardless of their market performance’\n(Esping-Andersen, 1987: 86). Commodification, on the other hand, refers to the\ncash versus services 201\nextent to which workers and their families are reliant upon the market sale of their\nlabour. Labour became extensively commodified during the industrial revolution\nas workers became entirely dependent upon the market for their survival (Esping-\nAndersen, 1990: 21). In the twentieth century, the introduction of social rights\nthat entailed entitlement to social welfare brought about a ‘loosening’ of the pure\ncommodity status of labour. The welfare state decommodified labour because\ncertain services and a certain standard of living became a right of citizenship and\nreliance on the market for survival decreased (1990: 22). However, it must be noted\nthat under capitalism, while the pure commodification of labour is possible, its\npure decommodification is not (O’Connor, 1993: 61). The issue is therefore the\nrelative degrees of protection from dependence on the labour market provided by\nthe welfare state in the form of cash benefits. When extended to cover health care\nprovision, decommodification refers to the extent to which an individual’s access\nto health care is dependent upon their market position and the extent to which\na country’s provision of health is independent from the market (Bambra, 2005).\nDecommodification indexes\nThe cash benefit and health care decommodification indexes are constructed\nin the same way as Esping-Andersen’s original indexes (Esping-Andersen, 1990:\n54; Bambra, 2004a, b, 2005) even though this methodology has met with some\ncriticism within the literature (Castles and Mitchell, 1993; Kangas, 1994; Ragin,\n1994; Pitruzello, 1999). It is important to replicate Esping-Andersen’s method to\nensure compatibility and comparability.\nCountries\nThe decommodification indexes include the same 18 OECD countries used\nby Esping-Andersen in the 1980s: Australia, Austria, Belgium, Canada, Denmark,\nFinland, France, Germany, Ireland, Italy, Japan, Netherlands, New Zealand,\nNorway, Sweden, Switzerland, the UK and the USA.\nData and sources\nThe data used to compile the indexes relate to the years 1997, 1998 and\n1999. The majority of data that have been used are of an international nature\n(such as that published by the Eurostat, UN or the OECD). The international\nnature of these data has helped to minimise any cross-national differences over\ntheir measurement, definition and collection. These measures should ensure data\ncomparability both between countries and between Esping-Andersen’s original\nindex and the ones in this article.\nMeasures\nThe cash benefits decommodification index is based on the assessment of a\nnumber of factors relating to the three main cash benefit programmes: pensions,\n202 clare bambra\nTABLE 2. Cash benefit index measures.\nPensions Unemployment Sickness\n(1) Minimum pension\nbenefits for a standard\nproduction worker\nearning average wages\n(1) Pre-taxation benefit\nreplacement rates for a\nstandard worker during\nthe first 26 weeks of\nunemployment\n(1) Pre-taxation benefit\nreplacement rates for a\nstandard worker during\nthe first 26 weeks of\nsickness\n(2) Standard pension benefits\nfor a normal worker\n(2) Number of weeks\nemployment prior to\nqualification for benefit\n(2) Number of weeks\nemployment prior to\nqualification for benefit\n(3) Contribution period\nrequired for a minimum\npension1\n(3) Number of waiting days\nbefore benefits are paid\n(3) Number of waiting days\nbefore benefits are paid\n(4) Individual’s share of\npension financing\n(4) Usual number of weeks\nin which benefit can be\nmaintained\n(4) Number of weeks in\nwhich benefit can be\nmaintained\n(5) Percentage of the\n(relevant) population\ncovered by the program\n(5) Percentage of the\n(relevant) population\ncovered by the program\n(5) Percentage of the\n(relevant) population\ncovered by the program\nNote: 1Esping-Andersen uses the contribution period for the standard pension as his measure-\nment. However, due to data availability problems, the contribution period for the minimum\npension benefit has been used here.\nSource: based on Esping-Andersen, 1990: 54.\nTABLE 3. Health care index measures.\nHealth care\n(1) Private health expenditure as a percentage of GDP – this factor refers to the extent of private\nfinancing by identifying the extent of a country’s total income that is spent on private health\ncare\n(2) Private hospital beds as a percentage of total bed stock – this factor is used to express the\nextent of private provision at a practical level within a health care system\n(3) The percentage of the population covered by the health care system – this shows the extent\nof general access provided by the public health care system\nSource: Based on Bambra, 2005.\nunemployment and sickness (see Table 2) (Esping-Andersen, 1990; Bambra,\n2004b).\nThe health care services decommodification index has been constructed\nthrough the assessment of three measures (see Table 3).\nThese factors have been selected because they assess the financing, provision\nand coverage of the private sector and are therefore useful indicators of the varied\nrole of the market in a health care system: the larger the size of the private health\nsector, in terms of expenditure and consumption, the larger the role of the market\nand therefore the lower the degree of health decommodification (Bambra, 2005).\ncash versus services 203\nTABLE 4. Degrees of decommodification.\nCash benefits Health care services\nUnadjusted Adjusted Unadjusted Adjusted\nFinland 34.6 7.5 50 7.3\nNorway 34.0 7.4 60 8.8\nSweden 34.7 7.5 50 7.3\nGermany 27.7 6.0 27.6 4.0\nNetherlands 28.0 6.1 28.8 4.2\nSwitzerland 29.7 6.4 30 4.4\nAustralia 13.5 2.9 20 2.9\nJapan 18.3 4.0 30 4.4\nUSA 14.0 3.0 9 1.3\nIreland 22.1 4.8 40 5.8\nNew Zealand 11.5 2.5 40 5.8\nUK 15.4 3.3 60 8.8\nAustria 31.1 6.7 39.6 5.8\nBelgium 31.9 6.9 39.6 5.8\nCanada 27.9 6.0 40 5.8\nDenmark 29.0 6.3 40 5.8\nFrance 31.5 6.8 39.8 5.8\nItaly 27.6 6.0 40 5.8\nTotal 462.5 100 684.4 100\nMethod\nThe process of scoring for each of the three constituent schemes in the\ncash benefits decommodification index (pensions, unemployment and sickness)\nreplicates that used by Esping-Andersen (1990: 50–54) and is by way of the\nnumerical description of the relationship of an individual country’s score to\nthe mean (and standard deviation) for four (one–four) of the five factors that\nmake up each index. On the basis of the values on each of these four indicators\nfor the 18 nations, a score of one for low decommodification, two for medium\nand three for high decommodification was given. Following Esping-Andersen,\nthe classification into three scores has been done on the basis of one standard\ndeviation from the mean, with adjustment where necessary for extreme outliers\n(1990: 54). These individual factor scores are then added together to get a final\nscore which is then weighted by factor five – the percentage of the (relevant)\npopulation covered by the programme. In line with Esping-Andersen’s approach\nand his concern for the importance of replacement rates, these variables have been\ngiven extra weight (multiplied by the factor of two) in each index. Finally, the\nresults of these three separate indexes – pension, unemployment and sickness –\nhave been combined to give the overall cash benefits decommodification score\nfor each country (see Tables 5, 6, and 7) (Bambra, 2004b).\nThe process of scoring in the health care decommodification index is\nidentical: the numerical description of the relationship of an individual country’s\n204\nc\nl\na\nr\ne\nb\na\nm\nb\nr\na\nTABLE 5. Pension decommodification index data (1998\/9).\nMinimum pension benefits for Standard pension benefits Contribution period Individual share\na standard production worker for a normal worker required for a of pension Labour market\nearning average wages (expressed (expressed as a replacement minimum pension financing coverage (take-up Index\nas a replacement rate %) rate %) (in years) (i) (%) rate %) (ii) Score (iii)\nFinland – 60 R 1.5 91 (16.4)\nNorway 34 79.8 R 2.6 79 13.4\nSweden 23.4 70 R 0 87 13.9\nGermany 0 35.3 5 6.8 84 7.6\nNetherlands – – R 3.4 70 (10.5)\nSwitzerland 19.5 – – 4.2 76 (9.9)\nAustralia 20.6 25.6 R – 50 (6.5)\nJapan 1.3 18.4 25 6.2 76 4.6\nUSA – 24.9 10 5.2 87 (7.0)\nIreland 30.3 46.4 3 2.0 82 9.8\nNew Zealand 25.8 35.8 R – 50 (6.5)\nUK 5 19.6 10 3.3 77 5.4\nAustria 33.9 – 1.5 3.7 89 (15.1)\nBelgium 41.9 63 R 4.4 84 14.3\nCanada 13.4 29.3 R 2.9 81 10.5\nDenmark 2 27.6 R 2.7 83 9.1\nFrance 40.1 – – 0.8 85 (15.3)\nItaly 20 – 5 2.9 89 (10.7)\nMean 22.23 41.21 8.50 3.29 79 10.4\nNotes: (i) R = residency requirement.\n(ii) The statistical sources merely use phrases such as ‘all employees’ or ‘all residents’ so these are approximate coverage rates that are based on the fact that\nthe largest group that is most often excluded from coverage are part-time workers (Eurostat, 1997b). Means-tested programmes receive a score of only 50% for\npopulation covered. This scoring is intended to reflect the lack of rights associated with means-tested programmes (Esping-Andersen, 1990: 54).\n(iii) Figures in brackets are where there are missing values for some factors and the index figure is therefore based on the averaging out of available factor data.\nSources: Clasen, 1994: 65–6; Stahlberg, 1997: 85; Eurostat, 1998: Figures 3.1, p. 51; 3.2, p. 52; Tables 3.1, p. 54–8; 3.2, p. 61–6; Eurostat, 2000: Tables 3, p. 163–97; 6,\np. 289–367; 10, p. 533–91; OECD, 1988: Tables 1.1, p. 16; 2.2, p. 21; Chart 2.1, p. 19; OECD, 1995a: 13–30; OECD, 1995b: 222; OECD, 1996: Tables 1.3, p. 19; 2.7, p. 40;\n2.8, p. 41; OECD, 1997: 17–29; US Census Bureau, 1999: 339–56; 378–94).\nc\na\nsh\nv\ne\nr\nsu\ns\nse\nr\nv\nic\ne\ns\n205\nTABLE 6. Unemployment decommodification index data (1998\/9).\nBenefit replacement rates Number of weeks of Usual number of weeks (Relevant) population\n(%) for a standard worker employment prior to Number of waiting days in which benefit covered by the programme Index\nduring the first 26 weeks qualification for benefit before benefit is paid can be maintained (take-up rate %) (iii) Score (iv)\nFinland 53 43 7 71 91 9.1\nNorway 62 52 3 156 79 10.3\nSweden 80 26 5 43 87 10.4\nGermany 37 52 0 52 (ii) 84 9.2\nNetherlands 70 26 0 26 70 9.1\nSwitzerland 70 – – – 76 –\nAustralia – – – – 50 –\nJapan 37 – – – 76 (7.6)\nUSA 50 – – – 87 (7.0)\nIreland\nNew Zealand 26 – – – 50 (2.5)\nUK 16 104 3 26 77 4.6\nAustria 22 52 0 20 (i) 89 7.1\nBelgium 46 45 0 unlimited 84 10.0\nCanada 55 – – – 81 (8.1)\nDenmark 60 52 0 52 83 9.1\nFrance 57 16 8 60 85 8.5\nItaly 30 104 0 26 89 6.2\nMean 46.71 50.92 2.42 49.00 79 7.8\nNotes: (i) For every 52 weeks past employment, an employee is entitled to 20 weeks unemployment benefit.\n(ii) Levels vary with contribution record e.g. 6 months contributions provide an entitlement to 12 months unemployment benefit. The minimum 6 months has\nbeen used in this case.\n(iii) The statistical sources merely use phrases such as ‘all employees’ or ‘all residents’ so these are approximate coverage rates that are based on the fact that\nthe largest group that is most often excluded from coverage are part-time workers (Eurostat, 1997b). Means-tested programmes receive a score of only 50% for\npopulation covered. This scoring is intended to reflect the lack of rights associated with means-tested programmes (Esping-Andersen, 1990: 54).\n(iv) Figures in brackets are where there are missing values for some factors and the index figure is therefore based on the averaging out of available factor data.\n(Sources: Eurostat, 1997b: 31–40; 45–55; 57–67; 91–8; 103–12; 115–25; 137–46; 147–56; 169–79; 181–93; 195–203; 213–20; Eurostat, 1998: Figures 3.1, p. 51; 3.2, p. 52;\nTables 3.1, p. 54–8; 3.2, p. 61–6; Eurostat, 2000: Tables 3, p. 163–97; 6, p. 289–367; 10, p. 533–91; OECD, 1995b: 222; OECD, 2000: Vol. 3, Table 1, p. 137).\n206\nc\nl\na\nr\ne\nb\na\nm\nb\nr\na\nTABLE 7. Sickness decommodification index data (1998\/9).\nBenefit replacement rates (Relevant) population\n(%) for a standard worker Number of weeks of Number of waiting Usual number of covered by the\nduring the first 26 weeks employment prior to days before benefit weeks in which benefit programme (take-up Index\nof sickness qualification for benefit is paid can be maintained rate %) (iii) Score (iv)\nFinland 70 0 9 43 91 9.1\nNorway 100 2 0 52 79 10.3\nSweden 80 0 1 no limit 87 10.4\nGermany 77(ii) 0 0 78 84 10.9\nNetherlands 70 0 0 52 70 8.4\nSwitzerland – – – – 76 –\nAustralia 26.7 – – – 50 (2.5)\nJapan – – – – 76 –\nUSA 0 n\/a n\/a n\/a 0 0\nIreland 26.6 39 3 52 82 5.7\nNew Zealand 38.3 – – – 50 (2.5)\nUK 17.5 26 3 52 77 5.4\nAustria 57.7(i) 2 3 52 89 8.9\nBelgium 60 26 1 52 84 7.6\nCanada – – – – 81 –\nDenmark 100 8 0 52 83 10.8\nFrance 50 26 3 52 85 7.7\nItaly 100 0 3 26 89 10.7\nMean 62.4 10.75 2.17 51.18 79 7.9\nNotes: (i) 6 weeks benefit at a replacement rate of 50%, remaining weeks at 60%.\n(ii) 6 weeks benefit at a replacement rate of 100%, remaining weeks at 70%.\n(iii) The statistical sources merely use phrases such as ‘all employees’ or ‘all residents’ so these are approximate coverage rates that are based on the fact that\nthe largest group that is most often excluded from coverage are part-time workers (Eurostat, 1997b). Means-tested programmes receive a score of only 50% for\npopulation covered. This scoring is intended to reflect the lack of rights associated with means-tested programmes (Esping-Andersen, 1990: 54).\n(iv) Figures in brackets are where there are missing values for some factors and the index figure is therefore based on the averaging out of available factor data.\nSources: Eurostat, 1998: Figures 3.1, p. 51; 3.2, p. 52; Tables 3.1, p. 54–8; 3.2, p. 61–6; Eurostat, 2000: Tables 3, p. 163–97; 6, p. 289–367; 10, p. 533–91; OECD, 1988:\nTables 1.1, p. 16; 2.2, p. 21; Chart 2.1, p. 19; OECD, 1995a: 13–30; OECD, 1995b: 222; OECD, 1996: Tables 1.3, p. 19; 2.7, p. 40; 2.8, p. 41; OECD, 1997: 17–29).\ncash versus services 207\nTABLE 8. Health care services index data (1998).\nPrivate health Private hospital Public health care\nexpenditure beds (% of total system coverage Index\n(% of GDP) bed stock) (% of population) score\nFinland 1.7 4.7 100.0 50\nNorway 1.3 0.32 100.0 60\nSweden 1.5 20.3 100.0 50\nGermany 2.3 50.1 92.2 27.6\nNetherlands 2.4 22.4(ii) 72.0 28.8\nSwitzerland 3.1 22.4(ii) 100.0 30\nAustralia 2.6 54.9 100.0 20\nJapan 1.6 71.2 100.0 30\nUSA 7.5 81.6 45.0 9\nIreland 1.7 22.4(ii) 100.0 40\nNew Zealand 1.8 25.8(iii) 100.0 40\nUK 1.0 3.7 100.0 60\nAustria 2.2 29.7 99.0 39.6\nBelgium 0.9 61.8 99.0 39.6\nCanada 2.9 0.8 100.0 40\nDenmark 2.7 0.0 100.0 40\nFrance 2.2 35.4 99.5 39.8\nItaly 2.3 24.0 100.0 40\nMean 2.0(i) 22.3(iv) 95.2 38.0\nNotes: (i) Adjusted for extreme outliers (USA).\n(ii) EU average.\n(iii) Unadjusted mean.\n(iv) Adjusted for extreme outliers (Denmark, and USA).\nSources: OECD, 2000: Chapters 3, 5, 7; WHO, 2002.\nscore to the mean (and standard deviation) for two (one and two) of the three\nfactors that make up the index. These individual factor scores are then added\ntogether to get a final score which is then weighted by factor three – the percentage\nof the population covered by the health care system on the basis of 100 per cent\ncoverage providing a weighting of 10, 92 per cent coverage a weighting of 9.2\nand so on (see Table 8). Coverage is used as a weight because, as with the use\nof coverage\/take-up rate in the cash benefit decommodification index, it is the\nmost important issue for public health care systems. A health care system that\nhas a high proportion of public funding and provision but that only provides\nservice access to a small proportion of the population cannot be regarded as\nhighly decommodifying.\nResults\nIn order to meaningfully compare the results of the two different indexes,\nthe different index scales have been equalised (see Table 4). The individual\ncountry score for each index has been translated into a percentage of the total\ndecommodification score produced by that index. So, for example, France’s\n208 clare bambra\nFrance, Austria\nDenmark\nCanada, Italy\nBelgium\nGermany Netherlands\nSwitzerland\nIreland\nFinland\nSweden\nNorway\nUK\nNew Zealand\nJapan\nAustraliaUSA\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n1 2 3 4 5 6 7 8 9 10\nHealth care services\nC\nas\nh\n b\nen\nef\nit\ns\nFigure 1. Decommodification of cash benefits compared with health care services.\nunadjusted cash benefits decommodification score was 31.5 and its health care\nservices score was 39.8, but when adjusted and expressed as a percentage of the\ntotal decommodification in the respective index they are 6.8 and 5.8.\nThe cash benefits index shows a wide variety of scores from 2.9 (Australia) to\n7.5 (Sweden). The health services index has a similar spread with scores ranging\nfrom the outlier score of 1.4 (USA) to 9.0 (Norway and UK). Some countries\nhave very similar scores in both the cash benefits and health care services indexes:\nAustralia scores 2.9 for cash benefit decommodification and 2.9 for health care\nservices decommodification, Canada and Italy both score 6.0 for cash benefits\nand 5.8 for health care services. Other countries have very divergent scores with\neither cash benefits or health care services exhibiting higher decommodification\nlevels. For example, Germany scores 6.0 for cash benefits but only 4.0 for health\ncare services, whereas the UK scores only 3.3 for cash benefits and 8.8 for health\ncare services.\nThese differences in internal decommodification scores can be more\nadequately explored by plotting the countries’ cash benefit decommodification\nscores against their health care services decommodification score (Figure 1).\nFigure 1 also demonstrates the inter-relationships of the countries and\nhow they divide into five groupings based on their above\/below average scores\n(depicted by the cross-hairs). The first group of countries (Finland, Norway and\nSweden) score highly in both cash benefit and health service decommodification.\nThe second group of countries (Germany, Switzerland and the Netherlands)\nscore more highly on cash benefits decommodification; and the third group of\ncountries (Ireland, New Zealand and the UK) score more highly on health care\nservice decommodification. The fourth group of countries (Australia, Japan and\ncash versus services 209\nthe USA) have low scores for both cash benefit and health service decommodi-\nfication. The decommodification scores of the fifth group of countries (Austria,\nBelgium, Canada, Denmark, France and Italy) are very close to the index average\nfor both cash benefits and health care services.\nDiscussion\nThese results suggest that there is significant internal diversity within the welfare\nstate arrangements of some countries. Ireland, New Zealand and the UK all\nhave higher decommodification scores for health care services than would be\nexpected from their ‘Liberal’ regime cash benefits score. Similarly, Germany, the\nNetherlands and Switzerland score lower for health care than would be expected\nfrom their ‘Conservative’ cash benefit score. This indicates that certain welfare\nstates do vary internally in terms of the emphasis that they place upon different\ntypes of social provision, with some focusing on cash benefits and others on\nwelfare services (Korpi and Palme, 1998; Castles, 1998; Kautto, 2002). Therefore\nit cannot be assumed that a country’s approach to one aspect of welfare state\nprovision can be generalised to explain all others (Kasza, 2002: 284; Bambra,\n2005). However, the results also show that some countries are more consistent in\ntheir approach to welfare state provision. Most notably, the Social Democratic\ncountries score similarly above average for cash benefits and health care services,\nand the USA, Japan and Australia score similarly low.\nMore significantly, the comparison of the two indexes also raises more\nquestions about the differences between countries and the number of different\ntypes of welfare state regimes (Leibfried, 1992; Castles and Mitchell, 1993; Kangas,\n1994; Ragin, 1994; Ferrera, 1996; Bonoli, 1997; Pitruzzello, 1999). The comparison\nsuggests that there are five possible welfare state groupings when cash benefits\nand health care services are compared with one another. The composition of\nthe high scoring group – Finland, Norway, Sweden – reflects a tenant of welfare\nregime theory: the existence of a distinctive Scandinavian regime that provides\nconsistently high levels of provision (Titmuss, 1974; Therborn, 1987; Esping-\nAndersen, 1990; Leibfried, 1992; Castles and Mitchell, 1993; Ferrera, 1996;\nBonoli, 1997; Korpi and Palme, 1998; Esping-Andersen, 1999; Sainsbury, 1999;\nKorpi, 2000). The position of countries such as Germany, Switzerland and the\nNetherlands, to some extent reflects comments that the Conservative regime\ncountries tend to place more emphasis upon cash benefits in their welfare mix\n(Castles, 1998), and the division of the Liberal regime countries – Australia,\nCanada, Ireland, New Zealand, the UK and the USA – into two distinctive\ngroups, one that is consistently low in welfare decommodification and one that\nis more service orientated, gives credence to claims about a fourth – radical (for\nexample, Castles and Mitchell, 1993) – world of welfare that is a sub-type of the\nLiberal regime.\n210 clare bambra\nThe identification of two additional groupings, sub-regimes, within the\nConservative and Liberal ‘worlds of welfare’, suggests that welfare services in these\ncountries are based upon different, politically structured, principles from their\nrespective cash benefit programmes. The Conservative sub-group countries –\nGermany, Switzerland and the Netherlands – all score more highly on cash\nbenefits than welfare services, and the Liberal sub-group countries – Ireland, New\nZealand and the UK – all score more highly on services than cash benefits. The\nimbalance within these countries’ welfare mix perhaps reflects Kasza’s assertions\nthat welfare policy making is politically inconsistent and disjointed. He asserts\nthat the cumulative nature of welfare policy making – the diverse histories of\ndifferent policy areas, the variation of policy actors across different fields, dif-\nferences in the policy-making process and the influence on policy of foreign\nwelfare models – all undermine the likelihood of a coherent approach to welfare\nprovision within a country (Kasza, 2002). These differences would be particularly\napparent in a comparison of such diverse aspects of welfare policy as cash benefits\nand health care services which, as Kasza points out, aside from a common\nnormative role in satisfying human need, have very little in common with one\nanother. However, it should also be noted that, in contrast to Kasza’s overall con-\nclusion that welfare states are too internally inconsistent to validate the regimes\nconcept, the majority of the 18 countries analysed in this article have shown con-\nsistency in their cash benefits and welfare services mix. It is perhaps therefore the\ncase that certain countries, such as Sweden on the one hand or the USA on the\nother, are more cohesive and uniform in their welfare state construction and\nthe political philosophy behind it, than others, such as the UK or Germany, that\ndemonstrate a more fragmented approach to cash benefits and welfare services.\nConclusions\nThis examination of the cash versus services mix of welfare state arrangements –\nthrough the comparison of decommodification levels of cash benefit programmes\nand health care services – has highlighted the importance of welfare services.\nIn demonstrating significant internal inconsistency within some countries’\nprovision of cash benefits and health care services, this article has reinforced\nand expanded the findings of earlier research on health care decommodification\n(Bambra, 2005) as well as Kasza’s more general critique of the ‘illusory’ nature of\nwelfare state regimes (Kasza, 2002). More significantly, though, the inclusion of\nservices has suggested that welfare states divide into not three (Esping-Andersen,\n1990, 1999), or four (Castles and Mitchell, 1993; Korpi and Palme, 1998; Korpi,\n2000; Bambra, 2005), but five different clusters (Pitzurello, 1999): (1) Finland,\nNorway, Sweden; (2) Germany, Netherlands, Switzerland; (3) Australia, Japan,\nUSA; (4) Ireland, New Zealand, UK; (5) Austria, Belgium, Canada, Denmark,\nFrance and Italy. However, it is unclear as to whether the extra two clusters\nshould be considered as distinctive regime types or merely as subgroups of the\ncash versus services 211\nLiberal and Conservative ‘worlds of welfare’, perhaps reflecting different political\nattitudes to the roles of cash benefits or welfare services. Further research into the\nfive clusters, perhaps incorporating other services such as social care or education,\nis needed before firmer conclusions can be drawn.\nWelfare states cannot be accurately analysed and classified by cash benefit\nprogrammes alone. Welfare state modelling, and the construction of typologies,\nneeds to encapsulate the full diversity of a welfare state, or welfare state regime, by\nexamining as many aspects of provision and service delivery as possible. Services\nare a vital element of welfare state provision and they need to be more adequately\nreflected in comparative research. It will be more fruitful if future attempts at\nwelfare state modelling combined both cash and services (Daly and Lewis, 2000).\nReferences\nAbrahamson, P. (1999), ‘The welfare modeling business’, Social Policy and Administration,\n33: 4, 394–415.\nAlber, J. (1995), ‘A framework for the comparative study of social services’, Journal of European\nSocial Policy, 5: 2, 131–49.\nArts, W. and Gelissen, J. (2002), ‘Three worlds of welfare or more?’, Journal of European Social\nPolicy, 12: 2, 137–58.\nBambra, C. (2004a), ‘The worlds of welfare: illusory and gender-blind?’, Social Policy and\nSociety, 3: 3, 201–11.\nBambra, C. (2004b), ‘Weathering the storm: convergence, divergence and the robustness of the\nworlds of welfare’, Social Policy Journal, 3: 3, 3–23.\nBambra, C. (2005), ‘Worlds of welfare and the health care discrepancy’, Social Policy and Society,\n4: 1.\nBonoli, G. (1997), ‘Classifying welfare states: a two-dimension approach’, Journal of Social Policy,\n26: 3, 351–72.\nBorchost, A. (1994), ‘Welfare state regimes, women’s interests and the EC’, in D. Sainsbury\n(ed.), Gendering Welfare States, London: Sage.\nBussemaker, J. and Kersbergen, K. (1994), ‘Gender and the welfare state: some theoretical\nreflections’, in D. Sainsbury (ed.), Gendering Welfare States, London: Sage.\nCasties, F. G. (1998), Comparative Public Policy: Patterns of Post-War Transformation,\nCheltenham: Edward Elgar.\nCastles, F. G. and Mitchell, D. (1993), ‘Worlds of welfare and families of nations’, in F. G. Castles\n(ed.), Families of Nations: Patterns of Public Policy in Western Democracies, Aldershot:\nDartmouth.\nClasen, J. (1994), ‘Social security – the core of the German employment centred social state?’,\nin J. Clasen and R. Freeman (eds.), Social Policy in Germany, London: Harvester\nWheatsheaf.\nDaly, M. (1994), ‘Comparing welfare states: towards a gender friendly approach’, in D. Sainsbury\n(ed.), Gendering Welfare States, London: Sage.\nDaly, M. and Lewis, J. (2000), ‘The concept of social care and the analysis of contemporary\nwelfare states’, British Journal of Sociology, 51: 2, 281–98.\nEsping-Andersen, G. (1987), ‘Citizenship and socialism: decommodification and solidarity in\nthe welfare state’, in G. Esping-Andersen and L. Rainwater (eds.), Stagnation and Renewal\nin Social Policy: The Rise and Fall of Policy Regimes, London: Sharpe.\nEsping-Andersen, G. (1990), The Three Worlds of Welfare Capitalism, London: Polity.\nEsping-Andersen, G. (1999), Social Foundations of Post-Industrial Economies, Oxford: Oxford\nUniversity Press.\n212 clare bambra\nEurostat (1997), Your Social Security Rights when Moving within the EU , Luxemburg: Eurostat.\nEurostat (1998), Social Protection for Dependency in Old Age in the 15 EU States and Norway,\nLuxemburg: Eurostat.\nEurostat (2000), Social Protection in the EU Member States, Luxembourg: Eurostat.\nEurostat (2001), Budgetary Challenges Posed by Ageing Populations: The Impact on Public\nSpending on Pensions, Health and Long-Term Care, Luxembourg: Eurostat.\nFerrera, M. (1996), ‘The southern model of welfare in social Europe’, Journal of European Social\nPolicy, 6: 1, 17–37.\nFreeman, R. (2000), The Politics of Health in Europe, Manchester: Manchester University Press.\nFreeman, R. and Moran, M. (2000), ‘Reforming health care in Europe’, in M. Ferrera and\nM. Rhodes (eds.), Recasting European Welfare States, London: Frank Cass.\nGinsburg, N. (1992), Divisions of Welfare: A Critical Introduction to Comparative Social Policy,\nLondon: Sage.\nGoodin, R., Headley, B., Muffels, R. and Dirvin, H. (1999),TheRealWorlds ofWelfareCapitalism,\nCambridge: Cambridge University Press.\nHam, C. (ed.) (1997), The Politics of Healthcare Reform: Learning from International Experience,\nBuckingham: Open University Press.\nHobson, B. (1994), ‘Solo mothers, social policy regimes, and the logics of gender’, in D. Sainsbury\n(ed.), Gendering Welfare States, London: Sage.\nKangas, O. (1994), ‘The politics of social security: on regressions, qualitative comparisons and\ncluster analysis’, in T. Janoski and A. Hicks (eds.), The Comparative Political Economy of\nthe Welfare State, Cambridge: Cambridge University Press.\nKasza, G. (2002), ‘The illusion of welfare regimes’, Journal of Social Policy, 31: 2, 271–87.\nKautto, M. (2002), ‘Investing in services in West European welfare states’, Journal of European\nSocial Policy, 12: 1, 53–65.\nKorpi, W. and Palme, J. (1998), ‘The paradox of redistribution and the strategy of equality:\nwelfare state institutions, inequality and poverty in the Western countries’, American\nSociological Review, 63: 662–87.\nKorpi, W. (2000), ‘Faces of inequality: gender, class and patterns of inequalities in different\ntypes of welfare states’, Social Politics, 7: 2, 127–91.\nLeibfried, S. (1992), ‘Towards a European welfare state’, in Z. Ferge and J. E. Kolberg (eds.),\nSocial Policy in a Changing Europe, Frankfurt: Campus-Verlag.\nLewis, J. (1992), ‘Gender and the development of welfare regimes’, Journal of European Social\nPolicy, 2: 3, 195–211.\nLewis, J. and Ostner, I. (1995), ‘Gender and the evolution of European social policy’, in\nS. Leibfreid and P. Pierson (eds.), European Social Policy, Washington, DC: Brookings\nInstitute.\nMoran, M. (1999), Governing the Healthcare State: A Comparative Study of the UK, the USA and\nGermany, Manchester: Manchester University Press.\nMoran, M. (2000), ‘Understanding the welfare state: the case of health care’, British Journal of\nPolitics and International Relations, 2: 2, 135–60.\nO’Connor, J. S. (1993), ‘Gendering welfare state regimes’, Current Sociology, 44: 2, 48–77.\nOECD (1988), Reforming Public Pensions, Paris: OECD.\nOECD (1995a), Private Pensions in OECD Countries: Canada, Paris: OECD.\nOECD (1995b), Employment Outlook, Paris: OECD.\nOECD (1996), Labour Market and Older Workers, Paris: OECD.\nOECD (1997), Private Pensions in OECD Countries: Australia, Paris: OECD.\nOECD (2000), Labour Force Statistics, Paris: OECD.\nOrloff, A. (1993), ‘Gender and the social rights of citizenship: the comparative analysis of gender\nrelations and welfare states’, American Sociological Review, 58: 303–28.\nPierson, C. (1998), Beyond the Welfare State, London: Polity.\nPitruzello, S. (1999),Decommodification and theWorlds ofWelfare Capitalism: ACluster Analysis,\nFlorence: European University Institute.\ncash versus services 213\nRagin, C. (1994), ‘A qualitative comparative analysis of pension systems’, in T. Janoski and\nA. Hicks (eds.), The Comparative Political Economy of the Welfare State, Cambridge:\nCambridge University Press.\nSainsbury, D. (1994), Gendering Welfare States, London: Sage.\nSainsbury, D. (1999), ‘Gender, policy regimes and politics’, in D. Sainsbury (ed.), Gender and\nWelfare State Regimes, Oxford: Oxford University Press.\nStahlberg, A. (1997), ‘Sweden: on the way from standard to basic security?’, in J. Classen (ed.),\nSocial Insurance in Europe, Bristol: Policy.\nTherborn, G. (1987), ‘Welfare state and capitalist markets’, Acta Sociologica, 30.\nTitmuss, R. (1974), Social Policy, London: Allen & Unwin.\nUnited States Census Bureau (1999), Statistical Abstract of the USA, Washington: US Census\nBureau.\nWilensky, H. and Lebaux, C. (1958), Industrial Society and Social Welfare, New York: Russell.\nWorld Health Organisation (WHO) (2002), ‘Health for all database’, accessed 1 March 2004 at\nhttp:\/\/www.curo.who.int\/.\n"}