{"doi":"10.1049\/ip-cta:20050049","coreId":"140984","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1100","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1100","10.1049\/ip-cta:20050049"],"title":"Predictive control for the ALSTOM gasifier problem.","authors":["Seyab, R. K. A.","Cao, Yi","Yang, Shuang-Hua"],"enrichments":{"references":[{"id":37923395,"title":"A.Pike, andM.Donne, “TheASTOMbenchmarkchallengeongasiﬁer control,” Proc. Instn Mech. Engrs. Part I,","authors":[],"date":"2000","doi":null,"raw":"[1] R.Dixon, A.Pike, andM.Donne, “TheASTOMbenchmarkchallengeongasiﬁer control,” Proc. Instn Mech. Engrs. Part I, Journal of Systems and Control Engineering, vol. 214, pp. 389–394, 2000.","cites":null},{"id":37923396,"title":"Advanced gasiﬁer control,”","authors":[],"date":"1999","doi":"10.1049\/cce:19990301","raw":"[2] R. Dixon, “Advanced gasiﬁer control,” Computing and Control Engineering Journal, IEE, vol. 10, no. 3, pp. 93–96, 1999.","cites":null},{"id":37923397,"title":"An advanced predictive control approach to the ASTOM gasiﬁer problem,”","authors":[],"date":"2000","doi":null,"raw":"[3] M. Rice, J. Rossiter, and J. Schurmans, “An advanced predictive control approach to the ASTOM gasiﬁer problem,” Proc. Instn Mech. Engrs. Part I, Journal of Systems and Control Engineering, vol. 214, pp. 405–413, 2000.","cites":null},{"id":37923398,"title":"Control of the ALSTOM gasiﬁer benchmark problem using H2 methodology,”","authors":[],"date":"2003","doi":"10.1016\/s0959-1524(03)00008-8","raw":"[4] C. Chin and N. Munro, “Control of the ALSTOM gasiﬁer benchmark problem using H2 methodology,” Journal of Process Control, vol. 13, pp. 759–768, 2003. [5] R. Dixon and A. W. Pike, “ALSTOM benchmark challenge on gasiﬁer control”, IEE Proc. Control Theory and Applications, under review for the special issue\/section on gasiﬁer control.","cites":null},{"id":37923399,"title":"Output response to step disturbance at 0%","authors":[],"date":null,"doi":null,"raw":"14List of Figures 1 Open-loopoutputresponsetoastepdisturbanceat30sat0%(solid), 50% (dashed) and 100% (dash-dotted) load conditions. . . . . . . 16 2 Output response to step disturbance at 0% load. . . . . . . . . . . 17 3 Input response to step disturbance at 0% load. . . . . . . . . . . . 18 4 Output response to sinusoidal disturbance at 0% load. . . . . . . . 19 5 Input response to sinusoidal disturbance at 0% load. . . . . . . . . 20 6 Output responses to a load setpoint change . . . . . . . . . . . . . 21 7 Input responses to a load setpoint change . . . . . . . . . . . . . . 22 8 Output response to a coal quality change of 18% in 100% load sinusoidal test . . . . . . . . . . . . . . . . . . . . . . . . . . . . 23 9 Input response to a coal quality change of 18% in 100% load sinusoidal test . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 24 1525             30             35 −15 −10 −5 C V , K J \/ k g 25             30             35 −0.4 −0.2 0.2 0.4 0.6 M a s s , t o n n e s 25             30             35 −0.1 −0.05 0.05 0.1 0.15 P r e s s u r e , b a r Time, s 25             30             35 −1 −0.5 0.5 T e m p , K Time, s","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-05-09T00:00:00Z","abstract":"Model predictive control (MPC) has become the first choice of control strategy\nin many cases especially in the process industry because it is intuitive and can\nexplicitly handle MIMO (multiple input multiple output) systems with input and\noutput constraints. The authors implemented a simple MPC algorithm based on the\nstate space formulation to control the ALSTOM gasifier. Among three operating\nconditions of the plant, 0% load condition is identified as the worst case. A\nlinearised state space model at 0% load condition of the non-linear plant is\nadopted as the internal model for performance prediction. Because of this\nchoice, the control system comfortably achieves performance requirements at the\nmost difficult load condition. Meanwhile, the case study shows that the model is\nalso adequate to pass all tests under other load conditions specified in the\nbenchmark problem. The MPC algorithm uses standard formulation and off-the-shelf\nsoftware with a few tunable parameters. Thus, it is easy to implement and to\ntune to achieve satisfactory performance","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140984.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1049\/ip-cta:20050049","pdfHashValue":"fe35349607070b5f2ca023ede19e6a96fd0507dd","publisher":"Institution of Electrical Engineers","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1100<\/identifier><datestamp>2014-02-18T16:21:38Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Predictive control for the ALSTOM gasifier problem.<\/dc:title><dc:creator>Seyab, R. K. A.<\/dc:creator><dc:creator>Cao, Yi<\/dc:creator><dc:creator>Yang, Shuang-Hua<\/dc:creator><dc:description>Model predictive control (MPC) has become the first choice of control strategy\nin many cases especially in the process industry because it is intuitive and can\nexplicitly handle MIMO (multiple input multiple output) systems with input and\noutput constraints. The authors implemented a simple MPC algorithm based on the\nstate space formulation to control the ALSTOM gasifier. Among three operating\nconditions of the plant, 0% load condition is identified as the worst case. A\nlinearised state space model at 0% load condition of the non-linear plant is\nadopted as the internal model for performance prediction. Because of this\nchoice, the control system comfortably achieves performance requirements at the\nmost difficult load condition. Meanwhile, the case study shows that the model is\nalso adequate to pass all tests under other load conditions specified in the\nbenchmark problem. The MPC algorithm uses standard formulation and off-the-shelf\nsoftware with a few tunable parameters. Thus, it is easy to implement and to\ntune to achieve satisfactory performance.<\/dc:description><dc:publisher>Institution of Electrical Engineers<\/dc:publisher><dc:date>2011-11-13T23:24:37Z<\/dc:date><dc:date>2011-11-13T23:24:37Z<\/dc:date><dc:date>2006-05-09T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Seyab, R.K.A.; Cao, Y.; Yang, S.H. Predictive control for the ALSTOM gasifier\nproblem. IEE Proceedings: Control Theory and Applications. Vol 153 Iss 3, 9 May\n2006, pp286- 292<\/dc:identifier><dc:identifier>1350-2379<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1049\/ip-cta:20050049<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/1100<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["1350-2379","issn:1350-2379"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":[],"subject":["Article"],"fullText":"PREDICTIVE CONTROL FOR THE ALSTOM\nGASIFIER PROBLEM\nR K Al Seyab‡ Y Cao‡∗ S H Yang†\n‡Cranfield University, UK\n†Loughborough University, UK\nKeywords: Nonlinear Systems, Optimal Control, Predictive Control, Process\nControl, ALSTOM Gasifier\nAbstract\nModel Predictive Control (MPC) has become the first choice of control\nstrategy in many cases especially in the process industry because it is intuitive\nand can explicitly handle MIMO systems with input and output constraints.\nIn this paper, a simple MPC algorithm based on the state space formulation\nis implemented to control the ALSTOM gasifier. Among three operating\nconditions of the plant, 0% load condition is identified as the worst case.\nA linearized state space model at 0% load condition of the nonlinear plant\nis adopted as the internal model for performance prediction. Due to this\nchoice, the control system comfortably achieves performance requirements\nat the most difficult load condition. Meanwhile, the case study shows that the\nmodel is also adequate to pass all tests under other load conditions specified\nin the benchmark problem. The MPC algorithm uses standard formulation\nand off-the-shelf software with a few tunable parameters. Thus, it is easy to\nimplement and to tune to achieve satisfactory performance.\n∗To whom correspondence should be addressed (y.cao@cranfield.ac.uk).\n1 Introduction\nThe ALSTOM gasifier, a complicated nonlinear process, was issued as a bench-\nmark control problem by the ALSTOM Power Technology Centre [1]. The control\nproblem involves several challenging issues, such as high order, high nonlinearity\nand strong interactions among process variables. Furthermore, the process has very\nstringent constraints on the process variables because of safety and environmental\nissues and the physical nature of these variables themselves.\nThe benchmark challenge was issued in two stages. The first round challenge,\nwhich was issued in 1997, included three linear models representing three operat-\ning conditions of the gasifier at 0%, 50%, and 100% load respectively. The chal-\nlenge requires the gasifier to be controlled at these load conditions to satisfy certain\ninput and output constraints in the presence of step and sinusoidal sink pressure\ndisturbances. A detailed description of the ALSTOM gasifier with design specifi-\ncations for this round challenge are available in [1]. Initial attempts to control the\ngasifier were presented at a meeting [2] held at Coventry University on 24th July\n1998. An overview of various control strategies and their comparison was given\nin [2]. One of the issues remaining unsolved in the first round challenge was that\nall controllers discussed at the meeting violated the process constraints by vari-\nous degrees. The only model predictive control (MPC) approach presented at the\nmeeting [3] involved the use of an additional inner loop to stabilize the process.\nThe inner loop controller was supervised by an outer loop to handle the process\nconstraints. A linear model at 100% load condition was used as the internal model\nfor the MPC controller. In a more recent work [4], a controller was designed using\nthe H2 methodology at 100% load condition. When comparing with other con-\ntrol strategies it was reported that “the controller is acceptable due to the small\npercentage of constraints violations”.\nThe second round challenge was issued in 2002 [5]. The original challenge\n2\nwas extended by providing participants with a nonlinear simulation model of the\ngasifier in MATLAB\/SIMULINK. In this round, in addition to the original distur-\nbance tests and the unsolved constraint violation issue, two extra tests were added:\nload change test and coal quality disturbance test [5].\nIn this work, a simple linear MPC approach is chosen to control the gasifier\nbecause MPC is known for its capability to handle multivariable interaction and\nprocess constraints in the most natural way. In the predictive controller, a quadratic\nprogramming (QP) problem is solved online to decide the optimum control moves\nto steer the output to follow a specified trajectory that keeps the process in the\nstable operating regions all the time. The novelty of the work is to identify the\nload condition at 0% as the most difficult case of all three operating conditions of\nthe gasifier to achieve performance specifications. Then, a linear state space model\naround 0% load point is used as the internal model for performance prediction.\nThe model works fairly well at other load levels. The controller is implemented\nby using quadprog function of MATLAB to solve the QP optimization problem.\nThis allows different constraints to be easily handled by the controller. Good results\nare obtained satisfying all the tests requirement given in [5] without any constraint\nviolation. Comparing to previous attempts proposed in [3, 4], the success of this\nwork should contribute to the right decision of selecting a linear nominal (internal)\nmodel for nonlinear system control. Some intuitive thinking behind this decision\nwill be explained in the paper. The full specification of the plant together with the\ncontrol objectives and performance tests, have been described in the introduction\npaper of the present issue [5], hence is omitted in the paper. The rest of this paper\nis organized as follows. Section 2 gives formulations of the predictive controller to\nbe used in the work. Details of control design are explained in section 3. Section 4\npresents simulation results obtained with the nonlinear simulation model controlled\nby the MPC controller. In section 5, some conclusions are drawn from this work.\n3\n2 Predictive control formulation\nAssume that the plant considered has manipulable input, u˜ ∈ Rnu and measured\noutput, y˜ ∈ Rny , which have steady-state values, u˜0 and y˜0 at the nominal op-\nerating point respectively. Around the operating point, the dynamic behaviour of\nthe plant can be approximated by the following linear discrete-time state-space\nequations:\nx(k + 1) = Ax(k) +Bu(k) (1)\ny(k) = Cx(k) + d(k)\nwhere k stands for kth sampling time, u(k) = u˜(k)− u˜0 and y(k) = y˜(k)− y˜0\nare deviation variables, d(k) the virtual disturbance estimated at output and x(k)\nthe internal state of the model. The model and plant are assumed to be coincident\nat a nominal operating point at t = 0. Hence, x(0) = 0, u(0) = 0, y(0) = 0 and\nd(0) = 0.\nAt kth sampling time, with the currently measured output, ym(k) = y˜(k) −\ny˜0 and the current state of the internal model, x(k), the future output within the\nprediction horizon, P can be estimated from the future input (to be determined\nwithin the moving horizon, M ), u(k) as follows: assuming\nd(k + i) = dk = ym(k)−Cx(k), for i = 1, . . . , P (2)\nthen\nY = ΦU +Ψx(k) +Ldk (3)\n4\nwhere\nY =\n[\nyT (k + 1) · · · yT (k + P )\n]T\nU =\n[\nuT (k) · · · uT (k +M − 1)\n]T\nΦ =\n\nCB 0 · · · 0\nCAB CB · · · 0\n.\n.\n.\n.\n.\n. · · · ...\nCAP−1B CAP−2B · · · ∑Pi=M CAP−iB\n\nΨ =\n\nCA\n.\n.\n.\nCAP\n\nL =\n[\nI · · · I\n]T\nFuture input, U is determined to follow the output reference, yr(k), and the input\nreference ur(k) = H0(yr(k) − dk), where H0 = C(I −A)−1B. Define input\nand output reference vectors as\nY r =\n[\nyTr (k + 1) · · · yTr (k + P )\n]T\nU r =\n[\nuTr (k) · · · uTr (k +M − 1)\n]T\nThen, U r =H(Y r −Ldk), where\nH =\n\nH0 0 · · · 0 0 · · · 0\n0 H0 · · · 0 0 · · · 0\n.\n.\n.\n.\n.\n. · · · ... ... · · · ...\n0 0 · · · H0 0 · · · 0\n\n5\nThe optimization problem is to minimize the performance cost:\nJ = 0.5(Y − Y r)TQ(Y − Y r) + 0.5(U −U r)TR(U −U r) (4)\ns.t. u ≤ u ≤ u\n|u(k + 1)− u(k)| ≤ δu\nwhere, output and input weighting matrices, Q and R are positive definite and u,\nu and δu are the lower, upper and maximum rate bounds of the input respectively.\nUsing the predictive equation (3), the optimization problem is equivalent to a\nstandard quadratic programming (QP) problem:\nJ = 0.5UTSU +UT (X1x(k)−X2(Y r −Ldk))\ns.t. U ≤ U (5)\n−U ≤ −U\nEU ≤∆u + Fu(k − 1)\n−EU ≤∆u − Fu(k − 1)\nwhere, u(k − 1) is the previous input, and other variables are defined as follows.\nS = ΦTQΦ+R\nX1 = ΦTQΨ\nX2 = ΦTQ+RH\nU =\n[\nuT · · · uT\n]T\nU =\n[\nuT · · · uT\n]T\n∆u =\n[\nδTu · · · δTu\n]T\n6\nE =\n\nI 0 · · · 0 0\n−I I · · · 0 0\n.\n.\n.\n.\n.\n. · · · ... ...\n0 0 · · · −I I\n\nF =\n[\nI 0 · · · 0\n]T\nNote, in the above formulation, output constraints are neglected to simplify the\nalgorithm and to fully use the plant capability. The QP problem (5) is efficiently\nsolvable by off-the-shelf software. The only tunable parameters in the above for-\nmulation areQ,R, P , M and the sampling time. Thus, the control strategy can be\neasily implemented and tuned to satisfy required performance.\nIn vector U , only the first nu rows, corresponds to u(k) are applied to the\nplant. The whole procedure is repeated at the next sampling instance.\nFor the unconstrained case, the optimal solution, corresponding to a state feed-\nback control law, can be obtained analytically:\nU = −K1x(k) +K2(yr − dk) (6)\nwhereK1 = S−1X1 andK2 = S−1X2. LetK be the first nu rows ofK1, then\nthe nominal stability (perfect model without input saturation) of the closed-loop\ncan be checked by calculating the eigenvalue of the matrix,A−BK.\n3 Control design\n3.1 Predictive control design\nThe first task of the control design to implement the above algorithm is to deter-\nmine an internal model of equation (1). Three operating conditions are specified\n7\nin the gasifier benchmark problem to represent 0%, 50% and 100% load condi-\ntions. All load conditions are subject to disturbance tests. Among these tests, it\nis observed that those under 0% load condition are most difficult to pass. That is\nunderstandable because a plant at a lower load condition (small throughput) nor-\nmally exhibits larger time lagging and a larger gain. Therefore, a control system\ntuned under a higher load condition will tend to be unstable (or stability margin\nreduced) at a lower load condition. On the other hand, a controller designed for a\nlower load condition is more likely to work well without re-tuning at higher load\nconditions although performance might deteriorate when compared with a re-tuned\ncontrollers at higher load conditions. Since the performance requirements at 50%\nand 100% load conditions are relatively easier to achieve, it is decided to use the\n0% load point as the nominal point to get the linearized state space model.\nA linearized state space model is obtained from the nonlinear simulation model\nat 0% load condition. This linear model is then reduced to 16 states via pole-zero\ncancellation (using Control System Toolbox functions, ssbal and minreal).\nThe 16-state model is then discretized with the sampling time selected as follows.\nNormally, the sampling time should be less than one tenth of 2pi\/ωb, where ωb\nis the required bandwidth of the closed-loop. The benchmark requires to reject a\nsine disturbance with a period of 25 seconds (0.04 Hz). Therefore, the sampling\ntime should be less than 2.5 seconds. On the other hand, the sampling time should\nnot be too large so that in step disturbance tests, the output variables will not de-\nviate from setpoints more than the specified limits before the controller can start\nto response. Several open-loop tests for a step disturbance of PSINK at three load\nconditions are performed. The outputs response results are shown in Figure 1. The\nresults show that, the worst response case is the 0% condition, where, without con-\ntrol, the pressure output can only stay within specified range for a period of 1.2\nseconds. Hence, the sampling time is selected to be 1 second. This satisfies the\n8\nrequirements for both disturbance tests.\nThe above algorithm is implemented in MATLAB as a SIMULINK s-function\nto replace the control block in the nonlinear simulation model provided in the\nbenchmark suit. The QP problem is solved by calling quadprog of the Opti-\nmization Toolbox at each sampling time. This is the major computation burden\nin the above algorithm and is solely determined by the control horizon, M . The\nprediction horizon, P has little effect on computation time, thus can be selected\nrelatively large to benefit stability.\nTo tune M and P , initially let P = M . By varying M from 1 s to 12 s, a stable\nperformance is obtained which satisfies all control specifications for 7 s ≤M ≤ 10\ns. When M ≥ 10 s, the improvement on the system performance is negligible but\ncomputation time increases significantly. Therefor M = 9 s is selected, which\ngives a good performance in all tests. To choose a suitable prediction horizon P , a\nreasonable range from the minimum value (P = M = 9 s) to P = 25 s has been\ntested. A stable response without any constraint violation is found within the range\n15 s ≤ P ≤ 20 s. No performance improvement can be observed when P ≥ 20 s.\nTherefore P = 20 s (the maximum value of the range) is chosen to ensure both the\nsystem stability and satisfactory control performance achieved within a reasonable\ncomputation time.\nThe weighting matrix, Q = diag(Q0, · · · ,Q0), where Q0 is diagonal and\ninitially set to be the inverse of the output error bounds. After online tuning, the\nfinal values are:\nQ0 =\n\n0.15 0 0 0\n0 100 0 0\n0 0 2.1 0\n0 0 0 2× 106\n\n(7)\n9\nAlso, the input weighting matrix R = diag(R0, · · · ,R0), where R0 is diagonal\nand set to the following value after online tuning;\nR0 =\n\n105 0 0 0\n0 5× 103 0 0\n0 0 5× 103 0\n0 0 0 104\n\n(8)\nUsing the above configuration, nominal stability is achieved at all three load condi-\ntions, i.e. the magnitudes of all eigenvalues of Ai −BiK are less than 1. Where,\nAi andBi are the discrete states and control matrices at different load conditions.\nOne of the advantages of MPC is that future setpoint change information is\nincorporable into the QP optimization problem to improve setpoint tracking per-\nformance. This is implemented in the gasifier controller.\n4 Simulation results\n4.1 Disturbance tests\nThe following two disturbance tests are performed for three load conditions for 300\nseconds:\n1. a step change of −0.2 bar in sink pressure (PSINK) at 30 s;\n2. a 0.04 Hz sinusoidal variation of amplitude 0.2 bar in PSINK beginning at\n30 s.\nThe maximum and minimum values as well as the peak rate change of the input\nvariables of the two tests under different load conditions are shown in Table 1.\nThe maximum absolute error between output variables and the corresponding\nsetpoints and the integral of absolute error (IAE) of these variables are given in\n10\nTable 2. Plots of output and input responses to disturbances at 0% load conditions\nare shown in Figures 2 to 5. For sinusoidal disturbance test, the results with extra\nsimulation time (1500 s) are provided to confirm the satisfactory of performance\nspecifications.\nThe output response plots together with Tables 1 and 2 show that the predictive\ncontroller based on a linear model identified at 0% load is able to keep the output\nvariables within the limits specified for both tests. Particularly, the performance at\n0% load is significantly improved from the one achieved by the PID configuration\nprovided in the benchmark. However, this improvement is traded with the price\nof performance deterioration at other load conditions although the performance\nspecifications are still satisfied at those load conditions.\n4.2 Load change test\nIn this test, the load is required to increase from 50% to 100% within a time period\n100 s to 700 s. Output, Input and load response data are collected during simulation\nand compared with the demand in Figures 6 and 7. Significant improvement (com-\nparing with the results using the PID controller provided in the benchmark) in the\nsetpoint tracking performance can be observed in the results. This improvement is\ndue to the advantage of predictive control to wisely use future setpoint information\nto obtain the best moves in the online optimization.\n4.3 Coal quality change test\nThe benchmark problem includes a test of coal quality changes by ±18%. Physi-\ncally, a positive coal quality change means an increase of energy per unit coal feed.\nTo maintain the same level of load, it is expectable that coal feed and char outlet\n(ash) will decrease at steady state due to energy balance. Similarly, a negative coal\nquality change will increase coal feed and char outlet at steady state. Therefore,\n11\nthe feasible range of a coal quality change is restricted by the input constraints.\nIf a coal quality change is beyond this feasible range, at steady-state some input\nsaturations are inevitable and the control problem becomes infeasible, i.e. there is\nno controller which can achieve the performance specification.\nSince an analytical model is no available, the feasible coal quality range is\ndetermined via simulation described as follows. Set the PID simulation model pro-\nvided in the benchmark by removing all actuator constraints. Then repeatedly per-\nform simulation until steady state by introducing a different coal quality change but\nwithout any other disturbance. By checking the steady-state input values against\ntheir constraints the following feasible coal quality ranges for different load condi-\ntions are identified.\n100% load −6.6% ≤ coal quality ≤ +7.1%\n50% load −14.1% ≤ coal quality ≤ +11.3%\n0% load −16% ≤ coal quality ≤ +18%\nAt the upper bounds of feasible coal quality ranges, WCHR reaches its lower bound\nat steady stated, whilst at the lower bounds of the feasible ranges WCHR saturates\nat its upper bound except at 100% load condition where WCOL, instead of WCHR,\nbecomes saturated at its upper bound. The above results show that a performance\ndeterioration is inevitable when a coal quality change is out of the above feasible\nrange. This deterioration is independent of control design because of the inherent\nlimitation imposed by the physical nature of the system.\nSuch performance deterioration is also observed for the MPC controller. It has\nbeen identified that the predictive controller can cope with coal quality change of\n±18% for all standard disturbance tests for up to 600 seconds. For simulation time\nlonger than 600 seconds, output specifications are violated in sinusoidal tests under\n0% load with a coal quality change of -18% and under 100% load with a coal\n12\nquality change of +18%. Steady state test for a longer time (for example 15000\nseconds) shows that the system cannot cope with a coal quality change either of\n-18% under 0% and 50% load conditions, or +18% under 50% and 100% load\nconditions.\nIn the presence of sinusoidal disturbance test at 100% load, for positive coal\nquality change, WCHR tends to zero at t ≥ 200 s as shown in figure 9. When this\nhappens for sufficiently long time, temperature starts to go up as more carbon has\nto be burned to balance high coal quality inlet (figure 8). Similarly, for sufficiently\nnegative coal quality change, WCHR, and WCOL will be saturated at their upper\nbounds. The gasification process in this case is under combusted and outlet gas\ntemperature will unavoidably drop. A working solution is to change output setpoint\nwhen an input saturation is detected so that the gasifier can maintain the same load\ndemand but without WCHR or WCOL saturations. This however is not within the\nspecifications of the benchmark problem and hence will not be discussed further.\n5 Conclusions\nA simple predictive controller has been developed to control the ALSTOM gasifier\nprocess. By using a linear state space model identified at 0% load condition as the\ninternal model, the controller is able to achieve all required performance specifi-\ncations within the input and output constraints. The performance deterioration at\n50% and 100% load conditions due to using a model linearized at 0% load point al-\nthough small, indicates that using a nonlinear predictive model might be necessary\nto improve performance at all load conditions. A prototype controller in Simulink\nhas been developed within a week, whilst tuning and simulation take another week\nto complete. The success of this case study reveals that nominal model selection\ncould be an important issue when using a linear model-based controller to control\n13\nnonlinear systems. Some theoretical work may have to be done in order to guide\nhow to select an appropriate linear nominal model for nonlinear system control in\ngeneral.\nReferences\n[1] R. Dixon, A. Pike, and M. Donne, “The ASTOM benchmark challenge on gasi-\nfier control,” Proc. Instn Mech. Engrs. Part I, Journal of Systems and Control\nEngineering, vol. 214, pp. 389–394, 2000.\n[2] R. Dixon, “Advanced gasifier control,” Computing and Control Engineering\nJournal, IEE, vol. 10, no. 3, pp. 93–96, 1999.\n[3] M. Rice, J. Rossiter, and J. Schurmans, “An advanced predictive control ap-\nproach to the ASTOM gasifier problem,” Proc. Instn Mech. Engrs. Part I,\nJournal of Systems and Control Engineering, vol. 214, pp. 405–413, 2000.\n[4] C. Chin and N. Munro, “Control of the ALSTOM gasifier benchmark problem\nusing H2 methodology,” Journal of Process Control, vol. 13, pp. 759–768,\n2003.\n[5] R. Dixon and A. W. Pike, “ALSTOM benchmark challenge on gasifier con-\ntrol”, IEE Proc. Control Theory and Applications, under review for the special\nissue\/section on gasifier control.\n14\nList of Figures\n1 Open-loop output response to a step disturbance at 30s at 0% (solid),\n50% (dashed) and 100% (dash-dotted) load conditions. . . . . . . 16\n2 Output response to step disturbance at 0% load. . . . . . . . . . . 17\n3 Input response to step disturbance at 0% load. . . . . . . . . . . . 18\n4 Output response to sinusoidal disturbance at 0% load. . . . . . . . 19\n5 Input response to sinusoidal disturbance at 0% load. . . . . . . . . 20\n6 Output responses to a load setpoint change . . . . . . . . . . . . . 21\n7 Input responses to a load setpoint change . . . . . . . . . . . . . . 22\n8 Output response to a coal quality change of 18% in 100% load\nsinusoidal test . . . . . . . . . . . . . . . . . . . . . . . . . . . . 23\n9 Input response to a coal quality change of 18% in 100% load sinu-\nsoidal test . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 24\n15\n25         30         35\n−15\n−10\n−5\n0\n5\n10\n15\nCV\n, K\nJ\/\nkg\n25         30         35\n−0.4\n−0.2\n0\n0.2\n0.4\n0.6\nM\nas\ns,\n to\nnn\nes\n25         30         35\n−0.1\n−0.05\n0\n0.05\n0.1\n0.15\nPr\nes\nsu\nre\n, b\nar\nTime, s\n25         30         35\n−1\n−0.5\n0\n0.5\n1\nTe\nm\np,\n K\nTime, s\nFigure 1: Open-loop output response to a step disturbance at 30s at 0% (solid),\n50% (dashed) and 100% (dash-dotted) load conditions.\n16\n0 100 200 300\n−15\n−10\n−5\n0\n5\n10\n15\nCV\n, K\nJ\/\nkg\n0 100 200 300\n−0.4\n−0.2\n0\n0.2\n0.4\n0.6\nM\nas\ns,\n to\nnn\nes\n0 100 200 300\n−0.1\n−0.05\n0\n0.05\n0.1\n0.15\nPr\nes\nsu\nre\n, b\nar\nTime, s\n0 100 200 300\n−1\n−0.5\n0\n0.5\n1\nTe\nm\np,\n K\nTime, s\nFigure 2: Output response to step disturbance at 0% load.\n17\n0 100 200 300\n0\n0.5\n1\n1.5\n2\n2.5\n3\n3.5\nCh\nar\n, k\ng\/\ns\n0 100 200 300\n0\n5\n10\n15\n20\nAi\nr, \nkg\n\/s\n0 100 200 300\n0\n2\n4\n6\n8\n10\nTime, s\nCo\nal\n, k\ng\/\ns\n0 100 200 300\n0\n1\n2\n3\n4\n5\n6\nSt\nea\nm\n, k\ng\/\ns\nTime, s\nFigure 3: Input response to step disturbance at 0% load.\n18\n0 500 1000 1500\n−15\n−10\n−5\n0\n5\n10\n15\nCV\n, K\nJ\/\nkg\n0 500 1000 1500\n−0.4\n−0.2\n0\n0.2\n0.4\n0.6\nM\nas\ns,\n to\nnn\nes\n0 500 1000 1500\n−0.1\n−0.05\n0\n0.05\n0.1\n0.15\nPr\nes\nsu\nre\n, b\nar\nTime, s\n0 500 1000 1500\n−1\n−0.5\n0\n0.5\n1\nTe\nm\np,\n K\nTime, s\nFigure 4: Output response to sinusoidal disturbance at 0% load.\n19\n0 500 1000 1500\n0\n0.5\n1\n1.5\n2\n2.5\n3\n3.5\nCh\nar\n, k\ng\/\ns\n0 500 1000 1500\n0\n5\n10\n15\n20\nAi\nr, \nkg\n\/s\n0 500 1000 1500\n0\n2\n4\n6\n8\n10\nTime, s\nCo\nal\n, k\ng\/\ns\n0 500 1000 1500\n0\n1\n2\n3\n4\n5\n6\nSt\nea\nm\n, k\ng\/\ns\nTime, s\nFigure 5: Input response to sinusoidal disturbance at 0% load.\n20\n0 10 20 30 40 50 60 70 80\n0\n50\n100\nLo\nad\n, %\nM\nCR\nActual\nDemanded\n0 10 20 30 40 50 60 70 80\n4.2\n4.4\n4.6\nCV\n, M\nJ\/\nkg\n0 10 20 30 40 50 60 70 80\n9\n10\n11\nM\nas\ns,\n T\n0 10 20 30 40 50 60 70 80\n15\n20\n25\nPr\nes\ns.\n, b\nar\n0 10 20 30 40 50 60 70 80\n1150\n1200\n1250\nTe\nm\np,\n K\nTime, minutes\nFigure 6: Output responses to a load setpoint change\n21\n0 10 20 30 40 50 60 70 80\n0\n2\n4\nCh\nar\n, k\ng\/\ns\n0 10 20 30 40 50 60 70 80\n10\n15\n20\nAi\nr, \nkg\n\/s\n0 10 20 30 40 50 60 70 80\n0\n5\n10\nCo\nal\n, k\ng\/\ns\n0 10 20 30 40 50 60 70 80\n0\n2\n4\nSt\nea\nm\n, k\ng\/\ns\nTime, minutes\nFigure 7: Input responses to a load setpoint change\n22\n0 500 1000 1500\n−15\n−10\n−5\n0\n5\n10\n15\nCV\n, K\nJ\/\nkg\n0 500 1000 1500\n−0.4\n−0.2\n0\n0.2\n0.4\n0.6\nM\nas\ns,\n to\nnn\nes\n0 500 1000 1500\n−0.1\n−0.05\n0\n0.05\n0.1\n0.15\nPr\nes\nsu\nre\n, b\nar\nTime, s\n0 500 1000 1500\n−1\n−0.5\n0\n0.5\n1\nTe\nm\np,\n K\nTime, s\nFigure 8: Output response to a coal quality change of 18% in 100% load sinusoidal\ntest\n23\n0 500 1000 1500\n0\n0.5\n1\n1.5\n2\n2.5\n3\n3.5\nCh\nar\n, k\ng\/\ns\n0 500 1000 1500\n0\n5\n10\n15\n20\nAi\nr, \nkg\n\/s\n0 500 1000 1500\n0\n2\n4\n6\n8\n10\nTime, s\nCo\nal\n, k\ng\/\ns\n0 500 1000 1500\n0\n1\n2\n3\n4\n5\n6\nSt\nea\nm\n, k\ng\/\ns\nTime, s\nFigure 9: Input response to a coal quality change of 18% in 100% load sinusoidal\ntest\n24\nTable 1: Input results\nStep, 100% load Maximum Minimum Peak rate\nWCHR 1.585 0.435 0.2\nWAIR 19.071 16.136 1\nWCOL 10.000 8.619 0.2\nWSTM 5.109 2.531 1\nStep, 50% load Maximum Minimum Peak rate\nWCHR 1.796 0.583 0.2\nWAIR 13.934 10.360 1\nWCOL 8.653 6.845 0.2\nWSTM 4.992 1.897 1\nStep, 0% load Maximum Minimum Peak rate\nWCHR 2.162 0.781 0.2\nWAIR 8.264 4.714 1\nWCOL 7.274 5.157 0.2\nWSTM 4.237 1.237 1\nSine, 100% load Maximum Minimum Peak rate\nWCHR 1.300 0.581 0.125\nWAIR 18.806 15.920 0.517\nWCOL 9.730 7.371 0.2\nWSTM 3.557 1.611 0.603\nSine, 50% load Maximum Minimum Peak rate\nWCHR 1.597 0.672 0.119\nWAIR 13.704 10.393 0.606\nWCOL 8.021 5.445 0.2\nWSTM 3.297 0.679 0.684\nSine, 0% load Maximum Minimum Peak rate\nWCHR 2.669 0.134 0.2\nWAIR 8.964 3.303 1\nWCOL 6.406 3.321 0.2\nWSTM 3.782 0 1\n25\nTable 2: Output results\nStep, 100% load Maximum absolute error IAE\nCVGAS 7.685 90.975\nMASS 12.915 —\nPGAS 0.0674 0.251\nTGAS 0.529 —\nStep, 50% load Maximum absolute error IAE\nCVGAS 7.370 75.022\nMASS 8.046 —\nPGAS 0.076 0.308\nTGAS 0.610 —\nStep, 0% load Maximum absolute error IAE\nCVGAS 9.084 86.041\nMASS 18.504 —\nPGAS 0.095 0.458\nTGAS 0.525 —\nSine, 100% load Maximum absolute error IAE\nCVGAS 4.911 868.240\nMASS 2.772 —\nPGAS 0.0313 5.178\nTGAS 0.273 —\nSine, 50% load Maximum absolute error IAE\nCVGAS 4.274 713.473\nMASS 5.290 —\nPGAS 0.033 5.773\nTGAS 0.323 —\nSine, 0% load Maximum absolute error IAE\nCVGAS 8.645 657.218\nMASS 35.783 —\nPGAS 0.083 10.110\nTGAS 0.814 —\n26\n"}