{"doi":"10.1016\/j.bios.2010.07.042","coreId":"139833","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/4760","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/4760","10.1016\/j.bios.2010.07.042"],"title":"Detection of β-amyloid peptide (1–16) and amyloid precursor protein (APP770) using spectroscopic ellipsometry and QCM techniques: A step forward towards Alzheimers disease diagnostics","authors":["Mustafa, M. K.","Nabok, Alexei","Parkinson, D.","Tothill, Ibtisam E.","Salam, Faridah","Tsargorodskaya, A."],"enrichments":{"references":[{"id":37954618,"title":"Artech House Inc,","authors":[],"date":"1994","doi":null,"raw":"Lvov Y., Decher G., 1994, Crystallography Reports, 39, 696-616 Nabok A, 2005, Artech House Inc, Boston, Nabok A, Tsargorodskaya A, Hassan AK, Starodub N.F., 2005, Appl. Surf. Sci., 246, 381-386 Nabok A., Tsargorodskaya A., Holloway A., Starodub N.F., Gojster O., 2007, Biosens. & Bioelectron., 22, 885-890 Nabok A, Tsargorodskaya A, Holloway A, Starodub NF, Demchenko A, 2007, Langmuir, 23, 8485-8490 Nabok A, Tsargorodskaya A, 2008, Thin Solid Films, 516, 8993-9001 Nabok A., Mustafa M.K., Parkinson D., Tsargorodskaya A., 2010, Sensors and Transduces, in press.Page 13 of 20 Accepted Manuscript Newton, J.R.A., D. Parkinson, M.R. Clench, 2006, Anal. Bioanal. Chem., 385, 692-699 Ramakrishna,  N.,  Smedman,  M.  and  Gillan,  B.,  1996, Arch.  Biochem.Biophys.,  326, 243-251 Seubert, P., Vigro-Pelfrey, C., Esch, F., Lee, M., Dovey, H., et al., 1992, Nature, 359, 325-330 Skerget K, et al , 2010, J Biol Chem., 285 (5), 3201-3210.","cites":null}],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2010-12-15","abstract":"A highly sensitive method of spectroscopic ellipsometry in total internal reflection mode (TIRE) was exploited for detecting β-amyloid peptide (Aβ1–16) in the direct immune reaction with monoclonal DE2 antibodies (raised against Aβ1–16) electrostatically immobilised on the surface of gold. A rapid detection of Aβ1–16 in a wide range of concentrations from 5 μg\/ml down to 0.05 ng\/ml was achieved using a cost-effective and label-free direct immunoassay format. TIRE dynamic spectral measurements proved that the immune reaction between DE2 monoclonal antibodies and Aβ1–16 is highly specific with the affinity constant KD = 1.46 × 10−8 mol\/l. The same DE2 antibodies were utilised for detection of amyloid precursor protein APP770, a larger protein containing Aβ1–16 domain, using the quartz crystal microbalance (QCM) measurements in liquid. A combination of QCM and TIRE kinetics results allowed the evaluation of the originally unknown concentration of APP770 in complete medium solution containing other proteins, salts, and amino acids","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139833.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.bios.2010.07.042","pdfHashValue":"65b48fd0f1071e16c5213e3a7d299e5b3079e0ae","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/4760<\/identifier><datestamp>2014-02-18T13:08:54Z<\/datestamp><setSpec>hdl_1826_2005<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Detection of β-amyloid peptide (1–16) and amyloid precursor protein (APP770) using spectroscopic ellipsometry and QCM techniques: A step forward towards Alzheimers disease diagnostics<\/dc:title><dc:creator>Mustafa, M. K.<\/dc:creator><dc:creator>Nabok, Alexei<\/dc:creator><dc:creator>Parkinson, D.<\/dc:creator><dc:creator>Tothill, Ibtisam E.<\/dc:creator><dc:creator>Salam, Faridah<\/dc:creator><dc:creator>Tsargorodskaya, A.<\/dc:creator><dc:subject>Alzheimer's disease<\/dc:subject><dc:subject>β-Amyloid peptide 1–16<\/dc:subject><dc:subject>Amyloid precursor protein (APP770)<\/dc:subject><dc:subject>Direct immunoassay<\/dc:subject><dc:subject>Total internal reflection ellipsometry<\/dc:subject><dc:subject>Quartz crystal microbalance<\/dc:subject><dc:description>A highly sensitive method of spectroscopic ellipsometry in total internal reflection mode (TIRE) was exploited for detecting β-amyloid peptide (Aβ1–16) in the direct immune reaction with monoclonal DE2 antibodies (raised against Aβ1–16) electrostatically immobilised on the surface of gold. A rapid detection of Aβ1–16 in a wide range of concentrations from 5 μg\/ml down to 0.05 ng\/ml was achieved using a cost-effective and label-free direct immunoassay format. TIRE dynamic spectral measurements proved that the immune reaction between DE2 monoclonal antibodies and Aβ1–16 is highly specific with the affinity constant KD = 1.46 × 10−8 mol\/l. The same DE2 antibodies were utilised for detection of amyloid precursor protein APP770, a larger protein containing Aβ1–16 domain, using the quartz crystal microbalance (QCM) measurements in liquid. A combination of QCM and TIRE kinetics results allowed the evaluation of the originally unknown concentration of APP770 in complete medium solution containing other proteins, salts, and amino acids.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2011-01-24T15:03:57Z<\/dc:date><dc:date>2011-01-24T15:03:57Z<\/dc:date><dc:date>2010-12-15<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>M.K. Mustafa, A. Nabok, D. Parkinson, I.E. Tothill, F. Salam and A. Tsargorodskaya, Detection of β-amyloid peptide (1–16) and amyloid precursor protein (APP770) using spectroscopic ellipsometry and QCM techniques: A step forward towards Alzheimers disease diagnostics, Biosensors and Bioelectronics, Volume 26, Issue 4, 15 December 2010, Pages 1332-1336<\/dc:identifier><dc:identifier>0956-5663<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.bios.2010.07.042<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/4760<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0956-5663","0956-5663"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Alzheimer's disease","β-Amyloid peptide 1–16","Amyloid precursor protein (APP770)","Direct immunoassay","Total internal reflection ellipsometry","Quartz crystal microbalance"],"subject":["Article"],"fullText":"Accepted Manuscript\nTitle: Detection of \u0002- amyloid peptide (1-16) and amyloid\nprecursor protein (APP770) using spectroscopic ellipsometry\nand QCM techniques: a step forward towards Alzheimers\ndisease diagnostics.\nAuthors: M.K. Mustafa, A. Nabok, D. Parkinson, I.E. Tothill,\nF. Salam, A. Tsargorodskaya\nPII: S0956-5663(10)00417-3\nDOI: doi:10.1016\/j.bios.2010.07.042\nReference: BIOS 3923\nTo appear in: Biosensors and Bioelectronics\nReceived date: 19-4-2010\nRevised date: 2-7-2010\nAccepted date: 13-7-2010\nPlease cite this article as: Mustafa, M.K., Nabok, A., Parkinson, D., Tothill, I.E.,\nSalam, F., Tsargorodskaya, A., Detection of \u0002- amyloid peptide (1-16) and amyloid\nprecursor protein (APP770) using spectroscopic ellipsometry and QCM techniques: a\nstep forward towards Alzheimers disease diagnostics., Biosensors and Bioelectronics\n(2010), doi:10.1016\/j.bios.2010.07.042\nThis is a PDF file of an unedited manuscript that has been accepted for publication.\nAs a service to our customers we are providing this early version of the manuscript.\nThe manuscript will undergo copyediting, typesetting, and review of the resulting proof\nbefore it is published in its final form. Please note that during the production process\nerrors may be discovered which could affect the content, and all legal disclaimers that\napply to the journal pertain.\nPage 1 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n1\nDetection of - amyloid peptide (1-16) and amyloid precursor protein \n(APP770) using spectroscopic ellipsometry and QCM techniques:\na step forward towards Alzheimers disease diagnostics.\nM.K.Mustafa1*, A.Nabok1, D.Parkinson2, I.E.Tothill3, F.Salam3, A.Tsargorodskaya1\n1 Materials and Engineering Research Institute, Sheffield Hallam University, Howard \nStreet, S1 1WB, UK\n2 Biomedical Research Centre, Sheffield Hallam University, Howard Street, S1 1WB, UK\n3 Cranfield Health, Cranfield University, Bedfordshire, MK43 0AL, UK\n*Corresponding author, E-mail address: m.k.mustafa@shu.ac.uk, fax: +44 1142253501\nPage 2 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n2\nAbstract\nA highly sensitive method of spectroscopic ellipsometry in total internal reflection mode \n(TIRE) was exploited for detecting - amyloid peptide (A1-16) in the direct immune \nreaction with monoclonal DE2 antibodies (raised against A1-16) electrostatically \nimmobilised on the surface of gold. A rapid detection of A1-16 in a wide range of \nconcentrations from 5 μg\/ml down to 0.05 ng\/ml was achieved using a cost-effective and \nlabel-free direct immunoassay format. TIRE dynamic spectral measurements proved that \nthe immune reaction between DE2 monoclonal antibodies and A1-16 is highly specific \nwith the affinity constant KD = 1.4610-8 (mol\/l). The same DE2 antibodies were utilised \nfor detection of amyloid precursor protein APP770, a larger protein containing A1-16\ndomain, using the quartz crystal microbalance (QCM) measurements in liquid. A\ncombination of QCM and TIRE kinetics results allowed the evaluation of the originally \nunknown concentration of APP770 in complete medium solution containing other \nproteins, salts, and amino-acids.\nKeywords: Alzheimer's disease, β-amyloid peptide 1-16, amyloid precursor protein \n(APP770), direct immunoassay, total internal reflection ellipsometry, quartz crystal \nmicrobalance\nPage 3 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n3\n1.  Introduction\n    One of the major neuropathological hallmarks of Alzheimer’s disease (AD) is the \ndeposition of  amyloid (A) in the form of senile plaques (SPs) and often in the walls of \ncerebral and meningeal blood vessels. The central core of SPs consists of an insoluble \ndeposit of 1-42 amino acid peptide known as -Amyloid peptide or A (Clark, 1985, \nGlenner, 1984). Until recently it was believed that aberrant processing gives rise to \ndeposition of A and hence AD, but it has recently been shown that A is produced \nunder normal circumstances in healthy cells in vitro (Haass, 1992; Hyman, 1992;\nSeubert, 1992) and is detected in the cerebrospinal fluid of healthy individuals (Seubert\n1992; Ramakrishna, 1996). A is derived from a larger transmembrane spanning protein \nknown as the amyloid precursor protein (APP) the role of which is not clearly identified. \nAPP consists of a single trans-membrane spanning domain, a large extracellular N \nterminus and a short intracellular C terminus (Kang et al., 1987). The A region of APP \ncorresponds to amino acids 11-15 of the transmembrane domain and 28 amino acids of \nthe extracellular domain (Kang et al.,1987). Alternative splicing of the APP gene gives \nrise to at least 10 protein isoforms. Three of the APP isoforms known to contain A are \nAPP770 (full length APP), APP751 (minus exon 8) and APP695 (minus exons 7 and 8). \n     Current clinical practice of AD diagnostics is based upon detection of A1–42 in \nELISA sandwich immunoassay (Ibach, 2006), quite reliable but expensive and laborious \nprocedure; such procedure is not suitable for early diagnostics of AD. Therefore, the \ndevelopment of express and cost-effective methods AD diagnostics (particularly at early \nstages of AD) is in great demand nowadays, considering ageing population in developed \ncountries. Several attempts in this direction were made recently using different bio-\nsensing technologies of scanning tunneling microscopy (Kang, 2009), and surface \nplasmon resonance (SPR) (Hegnerova et al., 2009; Skerget, 2010; Haes et al., 2005). A \nwell-established method of SPR has attracted great deal of attention because of its high \nsensitivity in bio-chemical analysis. \n     A relatively new method of total internal reflection ellipsometry (TIRE) (Westpal, \n2002; Arwin, 2004), which is closely related to SPR but offers even higher sensitivity, \nwas successfully implemented recently as an analytical tool in different bio-sensing \nPage 4 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n4\nprojects, for example for detection of low molecular weight toxins (Nabok et al., 2005, \nNabok et al., 2007a, Nabok et al., 2007b, Nabok et al., 2008). The sensitivity of TIRE \nwas sufficient for detection of mycotoxins and alkylphenols in sub-ng\/ml concentrations \nin the direct immunoassay format.\n     Although A is the actual marker for AD, the detection of a smaller water soluble \npeptide A1-16 will be a step forward in the development of a rapid and cost-effective \nbioanalytical tool for AD diagnostics. The immunoassay with specific monoclonal DE2 \nantibodies raised against A1-16 (Newton and Parkinson, 2006) was utilized in this work \nin conjunction with the method of TIRE. In addition, TIRE dynamic spectra \nmeasurements were performed to study the kinetics of the immune reaction and \nsubsequent evaluation of the affinity constant.\n     The proposed method of detection (i.e. TIRE immunoassay with DE2 antibodies) was \ntested recently using much larger antigen molecules of amyloid precursor protein APP770\ncontaining A1-16 target domain (Nabok et al., 2010). The APP770 molecules in rather \nsmall concentrations (from few nmol\/l down to tens of pmol\/l) were detected in a \ncomplex solution, e.g. complete medium (CM). In this work QCM microfluidic \nmeasurements were performed to monitor in-situ the immune reaction between APP770\nand DE2 antibodies in complete medium (CM), a complex mixture of different salts, \namino-acids and proteins (other than APP). The latter factor constitutes an additional \nchallenge and brings the procedure closer to a real biomedical analysis.\n2.   Experimental details\n2.1 Samples preparation and immunoassay details \n     -amyloid peptide 1-16 was synthesized by automatic solid phase peptide synthesis \nwith standard Fmoc precursors on a PTI Symphony synthesizer.  The cleaved peptide was \npurified by reverse-phase HPLC. Monoclonal antibody against -amyloid peptide was\nproduced by immunisation of mice with a conjugate of synthetic A1-16 linked to keyhole \nlimpet haemocyanin (KLH) with glutaraldehyde. The clone DE2 was selected on the \nbasis of stable production of IgG1 that recognised both synthetic A1-16 and natural \nPage 5 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n5\nAPPsderived from human cell lines by immunoblotting. Screening with peptides taken \nfrom within A1-16 was used to show the epitope recognized by DE2 is within the \nsequence A9-14. Bulk DE2 was produced by culturing hybridoma cells in DMEM \nmedium supplemented with 5% fetal bovine serum to exhaustion (Campbell, Pearson and \nParkinson, 1999 )\n     A human APP770 expression vector was produced by reverse-transcriptase PCR of a \ncDNA library prepared from mRNA from HeLa cells. The full-length transcript was \nsubcloned into a pCI-neo expression vector (Promega Corp.) which was used to transfect \nChinese hamster ovary (CHO) cells by calcium phosphate precipitation. Transfected cell \nwere selected by culturing in medium containing 0.3 mg\/ml G418. G418-resistant cells \nwere expanded into DMEM medium supplemented with 10% FBS and selected for \nAPP770 secretion by immunoblotting with DE2. The technology of production of APP770\nwas described in detail in (Newton and Parkinson, 2006)\n    The substrates for TIRE measurements were prepared by consecutive thermal \nevaporation of chromium (31 nm) and gold (303 nm) layers on standard microscopic \nglass slides without breaking the vacuum of about 10-6 Torr, using the Edwards E306A\nevaporation unit. The presence of thin Cr layer improves the adhesion of Au layer to \nglass. Prior immobilisation of antibodies, the surface of gold was modified with the layer \nof mercaptoethyl sodium sulfonate to enhance the negative surface change on sensing \nsurface (Surjaya et al., 2008). Similar treatment was used to modify the surface of gold \nelectrodes of quartz resonators.\n     The method of electrostatic layer-by-layer deposition (Lvov and Decher, 1994; \nNabok, 2005) was used for immobilisation of proteins on the surface. DE2 antibodies \nwere electrostatically attached to the surface via the polycationic layer of poly(allylamine \nhydrochloride) (PAH, 2 mg\/ml). An intermediate layer of Protein G (0.02 mg\/ml) \nmolecules at pH 7.5 (charge = -2.2) having a binding site to the second domain of IgG \nwas used to orient DE2 with their Fab-fragments towards the solution; such procedure \nimproved the sensitivity in about 3 times as compared to randomly adsorbed antibodies\n(Starodub et al., 2005). The structure of sensing layer is schematically shown in Figure 1 \n(lower inset). All the chemicals used (apart from DE2, A1-16, and APP770), i.e. Triz-HCl \nbuffer, protein G, PAH, were acquired from Sigma-Aldrich. \nPage 6 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n6\n2.2  Experimental methods \n      The method of total internal reflection ellipsometry (TIRE) used in this work \ncombines the advantages of highly sensitive spectroscopic ellipsometry with \nexperimental conveniences of Kretschmann surface plasmon resonance (SPR) \n(Kretschmann, 1971). The TIRE experimental set-up in Figure 1 was built on the basis of \nan automatic spectroscopic J.A. Woollam ellipsometer M2000 operating in the 370-1000 \nnm spectral range and exploiting the rotating compensator principle. The addition of 680\ntrapezoidal prisms allows coupling of the light beam into a thin gold film deposited on \nthe BK7 glass slide at the conditions close to total internal reflection. A cell of 0.2 ml in \nvolume with the inlet and outlet was sealed against the gold coated slide via rubber O-\nring to enable the injection of solutions into the cell and thus performing molecular \nadsorption and different biochemical reactions on the gold surface. \nFigure 1\n     In contrast to the conventional biosensing analytical tool of SPR based upon \nmonitoring the intensity of reflected p-polarised light, the method of TIRE detects two \nparameters  and  related, respectively, to the amplitude ratio (Ap\/As) and the phase \nshift (p-s) of p- and s- components of polarised light:\nsp\ns\np\nA\nA\ntn   , . (1)\n     In this work the  spectra were selected for further analyze because of superior \nsensitivity as compared to () spectra (Nabok et al., 2005). Recording of single TIRE\nspectroscopic scans was performed in a standard Trisma\/HCl buffer solution (pH 7.5) \nafter completing each adsorption (or binding) step. The cell was rinsed between \nadsorption steps by purging the same buffer solution ten times of the cell volume.\n     Upper inset of Figure 1 shows typical of () and () spectra recorded in such TIRE \nmeasurements. A phase drop of  from 2700 down to -900 is characteristic to the \nparticular ellipsometric instrument used, while in theory is varied between 0-360. The \ncorrection of negative values of  by adding 3600 transforms  spectrum into a \nPage 7 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n7\nmonotonically increased curve (see inset Fig. 1) and eventually improve the resolution of \nTIRE measurements. \n     The kinetic of molecular adsorption (binding) has been monitored in-situ during the \nincubation period for each reagent using dynamic TIRE scans, i.e. recording a number of \nspectra after a certain time interval (typically 15 - 20 minutes). Then, the time \ndependencies of either  or  at a selected wavelength were extracted for the study of \nkinetics of molecular adsorption or binding.   \nThe emphasis of the QCM measurements was to prove a possibility of detection of \nAPP770 in a complex CM solution in immune assay with monoclonal DE2 antibody \nspecific to the A1-16 domain, a part of a large trans-membrane protein APP770. A fully \nautomated QCMA-1 biosensor instrument and sensor chips from Sierra Sensors GmbH\nwere used. QCMA-1 chips combine two sensing spots on the same AT-cut quartz crystal \nwith a fundamental frequency of 19.5 MHz enabling in-situ monitoring of both the active \nand control sensor channels simultaneously. The operating temperature of the QCM \nsensor chip was maintained at 25ºC throughout the experiments.\n     The QCM chips were prepared following the same procedure as described above in \nTIRE sample preparation. Then the chip was docked to the QCMA-1 instrument and \nprimed with running buffer (10 mM PBS, pH 7.4) at a flow rate of 50 μl min-1. In the \nimmobilization stage, PAH (10 mg\/ml) was first injected using automated programme \ninjection needle and was kept at both channels for 400 s. The same incubation time and \nflow rate has been used for subsequent immobilization of Protein G and DE2 antibody. \nDE2 antibody was not introduced in the control channel.\n     The response of QCMA-1 sensor to binding of APP770 from its solution in CM was \nrecorded simultaneously in both active and control channels for 300 s incubation time \nand 50 μl min-1 flow rates. Every adsorption (binding) steps were ended with the surface \nregeneration using 0.1 M HCl. \n3.   Results and discussion\n     Figure 2 shows typical set of TIRE  spectra recorded in a standard Tris\/HCl \nbuffer solution (pH 7.5) after completing every adsorption (or binding) steps in the \nPage 8 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n8\nfollowing sequence: PAH, Protein G, DE2 antibodies and A1-16 in different \nconcentrations of 0.05 ng\/ml, 0.5 ng\/ml, 5.0 ng\/ml, 50 ng\/ml, 500 ng\/ml and 5000 ng\/ml. \nThe () spectra presented in this figure were corrected by adding 3600 to the negative \nvalues, which allowed us to improve the sensitivity of detection: the small spectral shift \n(smaller than the wavelength increment), which is normally not resolved in original () \nspectra, became visible after such alteration.\nFigure 2\n     The parameters of the adsorbed layers such as thickness (d) and refractive index (n) \nwere evaluated by fitting the TIRE spectra to the model system using the J.A. Woollam \nsoftware (Woolam, 2002). A four-layer model for TIRE measurements (Nabok et al., \n2008) shown in Table 1 consists of BK7 glass (as an environment), Cr\/Au layer, adsorbed \nlayer, and water (as a substrate) was employed.\nTable 1\n     The dispersion functions of refractive indices for BK7 glass and water were taken \nfrom WVASE32 library (Woolam, 2002). The effective parameters for Cr\/Au layer (the \nthickness and dispersion of a complex refractive index) were obtained for every sample \nby fitting the spectra recorded on bare gold surface; the obtained parameters were then \nused as fixed parameters for further TIRE data fitting of the same sample. The TIRE data \nfitting procedure was described in detail in our previous publications (Nabok et al., 2007,\n2008). The Cauchy dispersion model for the adsorbed layer was used (Woolam, 2002):\n     \n42\n)(\n\n nnn\nCB\nAn  (2)   \nwith the fixed parameters An=1.396, Bn=0.01, and Cn=0 yielding a value of refractive \nindex n=1.42 (at 633 nm) for all the molecular adsorbed layers. This approach is close to \nthe real situation since all molecular layers used (polymers and proteins) have similar \nrefractive index close to 1.42. The imaginary part of the refractive index (extinction \ncoefficient) was fixed at zero (k=0) assuming that all molecular layers are optically \nPage 9 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n9\ntransparent in the selected spectral range of 370-1000 nm. In such conditions, all changes \nin the adsorbed layers are associated with the thickness. The obtained changes in the \neffective thickness of A1-16 layer in respect to the layer of DE2 antibodies are \nsummarized in supplementary Table S1. The thickness values (d) represent effective \nthickness of molecular layers adsorbed on the surface; these values together with the \nmean square error came as result of TIRE data fitting.  The increase in the effective \nthickness (d) corresponds to the thickness increment caused by adsorption (binding) of \nrespective molecules.  Because the TIRE experiments on A1-16 binding were carried out \non the same sample (without surface regeneration) in the sequential increasing of A1-16 \nconcentration starting with the smallest concentration of 0.05 ng\/ml, the accumulative \nconcentration of A1-16 was used in the Table S1 as well as in the calibration curve \n(Figure 3).\n     The obtained values of thickness correlate with the size (or molecular weight) of \nadsorbed molecules as well as with their concentrations on the surface. The thickness \nincrement (d) increases from 0.756 nm for the smallest PAH molecules (molecular \nweight for repeated unit is 93.5, molecular weight of the polymer (MW=70 KDa), to \n2.112 nm for Protein G (MW=25 KDa), and up to 8.637 nm for large DE2 molecules \n(MW=120 KDa). \n     The calibration curve in Figure 3, i.e. the dependence of the increase in the effective \nthickness of adsorbed layer (Cauchy layer) vs the accumulative concentration of A1-16 , \nappeared as a classical sigmoid curve typical for immune reactions. The linear range \nstretches from 2 to 500 ng\/ml; and the trend to saturation is observed at concentrations \nhigher than 5 μg\/ml. The minimal detected concentration of A1-16 was 0.05 ng\/ml, which \nis an excellent result for direct immunoassay. Such high sensitivity of TIRE method is \nvery promising for future diagnostics of AD. \nFigure 3\n     Typical time dependencies of  and  at a selected wavelength of 500ng\/ml (shown \nas inset in Figure 4) were extracted from TIRE dynamic spectral measurements during \nbinding of A1-16 molecules to DE2 antibodies immobilised on the surface. Such kinetic\nPage 10 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n10\ncurves were recorded for different concentrations of the antigen (A1-16). Typical kinetic \ncurves for low concentrations of A1-16 given in supplementary Figure S1 demonstrated \nthat 20 min incubation time was sufficient to reach the saturation even at the lowest \nconcentration of A1-16 of 0.05 ng\/ml. Then a well-developed procedure of the evaluation\nof the rates of adsorption (ka) and desorption (kd) of the immune reaction was applied \n(Liu, 2003; Nabok et al., 2007a, Nabok et al., 2007b, Nabok et al., 2008). The \ncharacteristic time constant (τ) of the immune reaction was evaluated by fitting the data\nto the exponential function, bta  )\/exp(  . The inverse value of time constant,\nda kCkS  \n1\n was plotted against the concentration of the antigen (C) in Figure 4, \nand the values of ka and kd were found, respectively, from the gradient and intercept of \nthe  linear graph. The values of )(1085.3 115   smollka  and )(1064.5 13  skd\nobtained from the graph in Figure 4 allowed the calculation of the association and affinity \nconstants as \nd\na\nA k\nk\nK   and \nA\nD K\nK\n1 , respectively. The obtained values of \n)\/(. mollK A\n710836   and )\/(. lmolKD 810461   are typical for highly specific immune \nreaction with monoclonal antibodies. \nFigure 4\n     The immune reaction between APP770 and DE2 antibodies immobilised on the surface \nwas studied with the QCM micro-fluidic method. Supplementary Figure S2 (a) shows \nfrequency responses during adsorption of layers of PAH, Protein G and DE2 antibody in\nactive channel. The optimal incubation time during these adsorption stages was 400 s. \nThe effect of CM was tested separately, and the results are shown in supplementary \nFigure S2 (b). The comparison of responses to injection of CM in the active channel \n(coated with DE2) and the reference channel (without DE2) showed practically no \ndifference. This proves the insignificance of non-specific binding of other proteins \npresent in CM.\n     Figure 5 shows changes in the resonance frequency in the active channel of QCMA-1 \nfor 2, 4, 8, and 16 times dilution of APP770 in CM. As one can see 300 s is sufficient time \nPage 11 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n11\nto achieve the saturation of responses. The response is proportional to the concentration \nof APP770 (MW = 115 kDa). The baseline was recorded during injection of pure PBS \nbuffer solution. \n     The value of )\/(. lmolKD\n810461   obtained here for A1-16 allows the correction of \nour previously reported concentration of APP770 in stock solution (Nabok et al, 2010).  \nAssuming that the APP770 (which contains A1-16 domain) have the same affinity to DE2 \nantibodies as A1-16, and using the concentrations of DE2 (N = 4.73.1012 cm-2) and APP770\n(n = 1.08.1011 cm-2) from our previous work (Nabok et al, 2010), the initial concentration \nof APP770 in stock solution in CM can be precisely calculated as\n)\/(. lmol\nnN\nn\nKC D\n10\n0 10712\n\n\n . The minimal concentration of APP770 detected in \nQCM experiments was therefore )\/(.\/ lmolC 110 1005116\n . The results showed that our \nprevious estimation (Nabok et al, 2010) was not far away from reality.\n4.  Conclusions \n     This work demonstrated the detection of A1-16 in concentrations down to 0.05 ng\/ml \nusing the method of TIRE in direct immune assay format with monoclonal DE2 \nantibodies. This approach provides the means of rapid, simple, label-free and low cost-\neffective detection of  amyloid peptide 1-16. The successful TIRE and QCM \nexperiments with amyloid precursor protein APP770 in a complex solution of CM give a \ngood prognosis for further progress in detection of larger molecules of  amyloid peptide \n1-42, the actual marker of Alzheimer's disease, in real biological samples. \nAcknowledgements\nThe corresponding author wishes to thank the Universiti Tun Hussein Onn, Malaysia \n(UTHM) and Ministry of Higher Education, Malaysia (MoHE) for financial support of \nhis PhD study at Sheffield Hallam University, UK.\nPage 12 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n12\nReferences\nArwin H, Poksinski M., Johansen K., 2004, Appl. Optics, 43, 3028-3036.\nCampbell E, Pearson RCA, Parkinson D, 1999, J. Neuroscience Methods, 93,  133-138.\nClark, M.J., Gagnon, J., Williams, A.F. and Barclay, A.N., 1985, EMBO, 4, 113-118. \nGlenner, G.G. and Wong, C.W., 1984, Biochem. Biophys Res Comm., 120, 885-890.\nHaass, C., Hung, A.Y., Vigo-Pelfrey, C., Mellon, A., Ostaszewski, B.L., et al., 1992,\nNature, 359, 322-327.\nHaes A. J., Chang L., Klein W.L., Van Duyne R.P., 2005, J. Am. Chem. Soc., 127, 2264-\n2271.\nHegnerova K., Bockova M., Vaisocherova H., Kristofikova Z., Ricny J., Ripova D., \nHomola J., 2009, Sensors Actuators B, 139, 69-73\nHyman, B.T., Tanzi, R.E., Marzloff, K., Barbour, R., Shenk, D., et al., 1992,\nJ.Neuro.Exp.Neurol., 51, 76-83.\nIbach B., Binder H., Dragon M., Poijansky S.,. Haen E, et al., 2006, Neurobiology of \nAging, 27, 1202–1211\nKang, J., Lemeire, H.G., Utterbeck, A., Salbaum, J.M., Masters, C.L., et al., 1987,\nNature, 325, 733-736\nKang DY, Lee JH, Oh BK, Choi JW., 2009, Biosens Bioelectron., 24 (5), 1431-1436.\nKretschmann E., 1971, Z. Phys., 241, 313-324\nLiu X., Wei J., Song D., 2003, Analytical Biochemistry 314, 301-309.\nLvov Y., Decher G., 1994, Crystallography Reports, 39, 696-616\nNabok A, 2005, Artech House Inc, Boston, \nNabok A, Tsargorodskaya A, Hassan AK, Starodub N.F., 2005, Appl. Surf. Sci., 246, \n381-386\nNabok A., Tsargorodskaya A., Holloway A., Starodub N.F., Gojster O., 2007, Biosens. & \nBioelectron., 22, 885-890\nNabok A, Tsargorodskaya A, Holloway A, Starodub NF, Demchenko A, 2007,\nLangmuir, 23, 8485-8490\nNabok A, Tsargorodskaya A, 2008, Thin Solid Films, 516, 8993-9001\nNabok A., Mustafa M.K., Parkinson D., Tsargorodskaya A., 2010, Sensors and \nTransduces, in press.\nPage 13 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n13\nNewton, J.R.A., D. Parkinson, M.R. Clench, 2006, Anal. Bioanal. Chem., 385, 692-699\nRamakrishna, N., Smedman, M. and Gillan, B., 1996, Arch. Biochem.Biophys., 326, \n243-251\nSeubert, P., Vigro-Pelfrey, C., Esch, F., Lee, M., Dovey, H., et al., 1992, Nature, 359,\n325-330\nSkerget K, et al , 2010, J Biol Chem., 285 (5), 3201-3210.\nSuryajaya, Nabok, A.V., Tsargorodskaya, A., Hassan A.K., and Davis, F., 2008, Thin \nSolid Films, 516, 8917-8925\nStarodub N.F, Nabok A.V., Starodub V.M., Ray A.K,.Hassan A.K, Ukrainian Bio-\nChemical Journal, 73 (4) (2001), 55-64  \nWestpal, P., Bornmann, A., 2002, Sensors and Actuators B:Chemical, 84, 2, 278-282.\nWoollam J.A., 2002, J.A. Woollam Co., Inc. \nPage 14 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n14\nFigure captions:\nFigure 1    TIRE experimental setup. Upper inset shows typical () and () spectra for \nuncoated Cr\/Au layer recorded in TrisHCl buffer as well as corrected () spectrum;\nThe structure of a sensing layer is given on lower inset.\nFigure 2   Zoomed-in section of corrected () spectra recorded on of bare Au (1), \nafter adsorption of  PAH (2), Protein G (3), DE2 antibodies (4); and after consecutive\nbinding of Aβ1-16 of different concentrations: 0.05ng\/ml (5), 0.5ng\/ml (6) 5 ng\/ml(7) 50\nng\/ml (8), 500 ng\/ml (9), and 5 μg\/ml (10). \n                   \nFigure 3    Calibration curve for -amyloid peptide 1-16.\nFigure 4    The evaluation of the rates of adsorption (ka) and desorption (kd) from the \nkinetics of binding of Aβ1-16 to DE2 antibody. Inset shows typical binding kinetics of \nand  in the course from it’s 500ng\/ml solution in Tris\/HCl buffer) and the evaluation.\nFigure 5     Typical QCMA-1 sensor responses to binding of APP770 of different\nconcentrations (dilutions) in CM to DE2 antibodies immobilised on the surface.\nPage 15 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 1 \nFigure 1 \n \n \n \n \nPolariser photodiode     \ndetector array\ninlet outlet\n68 Prism\nO-ring\nM2000 Ellipsometer\nLight source\nanalyser\nrotating \ncompensator\nGlass\nCr\nAu\nPr.G\nDE2\nA\nPAH\n300 400 500 600 700 800 900\n28\n30\n32\n34\n36\n38\n40\n42\n44\n\n d\ne\ng\nre\ne\ns\n\n d\ne\ng\nre\ne\ns\n, nm\n-65\n0\n65\n130\n195\n260\n325\n390\n455\n \n\n\n' =+360\n0\n\n d\ne\ng\nre\ne\ns\n\n d\ne\ng\nre\ne\ns\n \nFigure(s)\nPage 16 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 2 \nFigure 2 \n \n695 700 705 724 725 726 727 728 729 730\n260\n261\n262\n263\n264\n265\n\n, \nd\ne\ng\nre\ne\ns\n,nm\n1 2 3 4,5 6 7 8  9 10\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPage 17 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 3 \nFigure 3 \n \n0.01 0.1 1 10 100 1000 10000 100000\n0.9\n1.2\n1.5\n1.8\n2.1\n2.4\n2.7\n\nd\n, \nn\nm\nC, ng\/ml\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPage 18 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 4 \nFigure 4 \n \n \n0 100 200 300 400 500\n0\n2\n4\n6\n8\n10\n12\n14\n16\n18\n20\n0 5 10 15 20\n31.05\n31.10\n31.15\n31.20\n31.25\n31.30\n\n, \nd\ne\ng\nre\ne\ns\n\n, \nd\ne\ng\nre\ne\ns\nt, min\n249\n250\n251\n252\n253\n\n\nS\nlo\np\ne\n (\nm\nin\n-1\n)\nC (ng\/ml)\ny = 0.3385+ 0.01816x\nt = 9.796 ± 0.106 (min) \n = a*exp(-x\/t1) + b\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPage 19 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 5 \nFigure 5 \n \n                                        \n                                        \n                                        \n                                        \n                                        \n                                        \n                                        \n0 100 200 300 400 500 600\n0\n400\n800\n1200\n1600\n2000\n2400\n  Surface \nregeneration\nInjection\n-\nf, \nH\nz\nTime,s\nAPP 1:2\nAPP 1:4\nAPP 1:8\nAPP 1:16\nPBS\n \n \n \nPage 20 of 20\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 1 \nTable 1.  The four-layer model for TIRE data fitting \n \nLayer Parameters Comments \n3. BK-7 glass \n   (ambient) \nn, k dispersions \nfrom WVASE32 library \nn=1.515, k=0 at 633nm \nfixed during fitting \n2. Cr\/Au film  \nn = 0.359 0.078; k = 2.857 0.114 \nat 633nm  \nd  is varied in the range of 25-30 nm  \nThe values of d, and \ndispersions for n and k were \nobtained by fitting TIRE data \nfor every new sample, then \nkept fixed in further fittings \n1. Adsorbed  \n    layer \nCauchy model:  \nA= 1.396,  B = 0.01,  C = 0 \ngiving  n= 1.42, k = 0 at 633nm  \nparameters of Cauchy model \nA, B, and C are fixed;  \nd is variable \n0. Water  \n   (substrate) \nn, k dispersions from WVASE32 \nlibrary, n=1.33, k=0, at 633nm \nfixed during fitting \n \n  \n \n \n \nTable(s)\n"}