{"doi":"10.1109\/JSTQE.2004.836021","coreId":"100895","oai":"oai:epubs.surrey.ac.uk:296","identifiers":["oai:epubs.surrey.ac.uk:296","10.1109\/JSTQE.2004.836021"],"title":"Mode-Locking in Broad-Area Semiconductor Lasers Enhanced by Picosecond-Pulse Injection","authors":["Kaiser, J","Fischer, I","Elsasser, W","Gehrig, E","Hess, O"],"enrichments":{"references":[{"id":871530,"title":"and","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":871386,"title":"Authorized licensed use limited to: University of Surrey. Downloaded on","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":858501,"title":"Control of the spatiotemporal emission of a broad-area semiconductor laser by spatially filtered feedback,”","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":855787,"title":"Dynamics of high-power diode lasers,” in Topics in Applied Optics,","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":870682,"title":"Elsäßer is a Member of the German Physical Society. He was awarded the Otto-Hahn-Medal","authors":[],"date":"1985","doi":null,"raw":null,"cites":null},{"id":858078,"title":"External resonator design for high-power laser diodes that yields 400","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":863737,"title":"Fast phenomena in semiconductor lasers,”","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":867882,"title":"Fischer received the Research Prize of the Adolf-Messer Foundation","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":867205,"title":"he joined the Institute of Applied Physics,","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":869250,"title":"He received the diploma degree in physics from the Technical University of Karlsruhe,","authors":[],"date":"1980","doi":null,"raw":null,"cites":null},{"id":866490,"title":"Ingo Fischer was born in Marburg,","authors":[],"date":"1966","doi":null,"raw":null,"cites":null},{"id":856435,"title":"Injection behavior of high-power broad-area diode lasers,”","authors":[],"date":"1987","doi":null,"raw":null,"cites":null},{"id":857394,"title":"Injection locking of individual broad-area lasers in an intergated high-power diode array,”","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":853765,"title":"Lateral modes of broad area semiconductor lasers: Theory and experiment,”","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":856662,"title":"Narrow bandwidth operation of high-power broad-area diode laser using casacded phase-conjugate injection locking,”","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":864760,"title":"Optical signal generation at millimeter-wave repetition rates using semiconductor lasers with pulsed subharmonic optical injection,”","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":872847,"title":"Ortwin Hess received the diploma and Dr.rer.nat degrees from the Technical","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":861042,"title":"Passive and active mode locking of a semiconductor laser without an external cavity,”","authors":[],"date":"1985","doi":null,"raw":null,"cites":null},{"id":862369,"title":"Passive FM locking in InGaAsP semiconductor lasers,”","authors":[],"date":"1989","doi":null,"raw":null,"cites":null},{"id":859078,"title":"Picosecond pulse generation with a CW GaAlAs laser diode,”","authors":[],"date":"1978","doi":null,"raw":null,"cites":null},{"id":864053,"title":"Self-mode-locking of quantum cascade lasers with giant ultrafast optical nonlinearities,”","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":861684,"title":"Short pulse and high-frequency signal generation in semiconductor lasers,”","authors":[],"date":"1989","doi":null,"raw":null,"cites":null},{"id":863027,"title":"Short pulse generation using multisegment modelocked semiconductor lasers,”","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":854490,"title":"Spatio-temporal characteristics of filamentation in broad-area semiconductor lasers,”","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":865058,"title":"Spatio-Temporal Dynamics and Quantum Fluctuations in Semiconductor Lasers, Springer Tracts in Modern Physics.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":855036,"title":"Spatio-temporal dynamics of broad area semiconductor lasers and its characterization,”","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":870042,"title":"to 1985, he was with the Max-Planck-Institute for Solid State Research,","authors":[],"date":"1981","doi":null,"raw":null,"cites":null},{"id":873402,"title":"to 1992, he was a Research Associate with Heriot-Watt University, Edinburgh, UK and also with the University of Tucson, Tuscon, AZ. From","authors":[],"date":"1990","doi":null,"raw":null,"cites":null},{"id":872180,"title":"to 2003, she was a Senior Research Associate with the Theoretical Quantum Electronics Group,","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":865742,"title":"was born in Stuttgart, Germany, in 1974. He received the diploma degree from","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":868582,"title":"Wolfgang Elsäßer (M’94-SM’97) was born in","authors":[],"date":"1954","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-01-01","abstract":"<p>We present combined experimental and theoretical investigations of the picosecond emission dynamics of broad-area semiconductor lasers (BALs). We enhance the weak longitudinal self-mode-locking that is inherent to BALs by injecting a single optical 50-ps pulse, which triggers the output of a distinct regular train of 13-ps pulses. Modeling based on multimode Maxwell-Bloch equations illustrates how the dynamic interaction of the injected pulse with the internal laser field efficiently couples the longitudinal modes and synchronizes the output across the laser stripe. Thus, our results reveal insight into the complex interplay between lateral and longitudinal dynamics in BALs, at the same time indicating their potential for short optical pulse generation.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:296<\/identifier><datestamp>\n      2017-10-31T13:57:39Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/296\/<\/dc:relation><dc:title>\n        Mode-Locking in Broad-Area Semiconductor Lasers Enhanced by Picosecond-Pulse Injection<\/dc:title><dc:creator>\n        Kaiser, J<\/dc:creator><dc:creator>\n        Fischer, I<\/dc:creator><dc:creator>\n        Elsasser, W<\/dc:creator><dc:creator>\n        Gehrig, E<\/dc:creator><dc:creator>\n        Hess, O<\/dc:creator><dc:description>\n        <p>We present combined experimental and theoretical investigations of the picosecond emission dynamics of broad-area semiconductor lasers (BALs). We enhance the weak longitudinal self-mode-locking that is inherent to BALs by injecting a single optical 50-ps pulse, which triggers the output of a distinct regular train of 13-ps pulses. Modeling based on multimode Maxwell-Bloch equations illustrates how the dynamic interaction of the injected pulse with the internal laser field efficiently couples the longitudinal modes and synchronizes the output across the laser stripe. Thus, our results reveal insight into the complex interplay between lateral and longitudinal dynamics in BALs, at the same time indicating their potential for short optical pulse generation.<\/p><\/dc:description><dc:date>\n        2004-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/296\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Kaiser, J, Fischer, I, Elsasser, W, Gehrig, E and Hess, O  (2004) Mode-Locking in Broad-Area Semiconductor Lasers Enhanced by Picosecond-Pulse Injection   IEEE Journal of Selected Topics in Quantum Electronics, 10 (5).       <\/dc:identifier><dc:relation>\n        10.1109\/JSTQE.2004.836021<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/296\/","10.1109\/JSTQE.2004.836021"],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"968 IEEE JOURNAL OF SELECTED TOPICS IN QUANTUM ELECTRONICS, VOL. 10, NO. 5, SEPTEMBER\/OCTOBER 2004\nMode-Locking in Broad-Area Semiconductor Lasers\nEnhanced by Picosecond-Pulse Injection\nJoachim Kaiser, Ingo Fischer, Wolfgang Elsäßer, Senior Member, IEEE, Edeltraud Gehrig, and Ortwin Hess\nAbstract—We present combined experimental and theoretical\ninvestigations of the picosecond emission dynamics of broad-area\nsemiconductor lasers (BALs). We enhance the weak longitu-\ndinal self-mode-locking that is inherent to BALs by injecting a\nsingle optical 50-ps pulse, which triggers the output of a distinct\nregular train of 13-ps pulses. Modeling based on multimode\nMaxwell–Bloch equations illustrates how the dynamic interaction\nof the injected pulse with the internal laser field efficiently couples\nthe longitudinal modes and synchronizes the output across the\nlaser stripe. Thus, our results reveal insight into the complex\ninterplay between lateral and longitudinal dynamics in BALs, at\nthe same time indicating their potential for short optical pulse\ngeneration.\nIndex Terms—Broad-area semiconductor lasers (BALs), mode-\nlocking, picosecond pulses, semiconductor lasers, spatiotemporal\ndynamics.\nI. INTRODUCTION\nBROAD-AREA semiconductor lasers (BALs) areedge-emitting semiconductor lasers with an extended\nwidth of the emitting area of typically 50–200 m to obtain\nhigh output powers of several watts. Their emission is dom-\ninated by a multitude of complex phenomena ranging from\nstatic beam filamentation, regular pulsations, and laterally mi-\ngrating filaments to irregular, chaotic spatiotemporal dynamics\non nano- and picosecond timescales [1]–[5]. This is associated\nwith the excitation of multiple longitudinal and lateral modes,\nwhich typically cover a spectral width of 1–2 nm. These phe-\nnomena are a consequence of the extended resonator geometry\nand the highly nonlinear interaction of the intense optical field\nwith the semiconductor gain medium.\nMotivated by the perspective of widening the field for BALs\nin high-power applications, most of the recent efforts have been\nfocused on an improvement of their extremely poor spatial and\ntemporal coherence. Comprehensive strategies have been pur-\nsued to control the complex emission dynamics and to generate\nspectrally narrow, preferably single-mode operation by means\nof optical injection [6]–[8] or feedback [9], [10]. In contrast to\nthat, it might also be beneficial to exploit the strong intrinsic\nnonlinearities. In particular, mode-locking of the multiple lon-\ngitudinal modes—a subject which has in many aspects attracted\nManuscript received January 12, 2004; revised July 27, 2004.\nJ. Kaiser, I. Fischer, and W. Elsäßer are with the Institute of Applied Physics,\nDarmstadt University of Technology, 64289 Darmstadt, Germany (e-mail:\njoachim.kaiser@physik.tu-darmstadt.de).\nE. Gehrig and O. Hess are with the Advanced Technology Institute, School\nof Electronics and Physical Sciences, University of Surrey, Surrey GU2 7XH,\nU.K. (e-mail: e.gehrig@surrey.ac.uk).\nDigital Object Identifier 10.1109\/JSTQE.2004.836021\nextensive interest ever since the breakthrough of the semicon-\nductor laser [11]–[19]—could lead to applications of BALs in\nshort optical pulse or high repetition rate signal generation at\nhigh powers.\nIn addition, fundamental questions arise from the fact that\nthe BALs emission does not only consist of many longitudinal\nmodes, but each of these modes consists in fact of a multitude\nof different lateral modes typically up to the tenth order. This\nallows for a variety of phenomena associated with locking of\nthe various modes: lateral modes of different longitudinal order\nor different lateral modes within the same longitudinal mode\norder might couple. In addition, coexistence of partial mode-\nlocking of lateral and longitudinal modes might occur. Thus,\nimportant questions include: in which way does mode-locking\nactually occur in BALs and how do the lateral modes contribute?\nIs it possible to control and enhance in particular longitudinal\nmode-locking to obtain a picosecond pulse source? The answers\nto these investigations provide basic insight into the interplay\nbetween longitudinal and lateral modes and into the complex\nnonlinear spatiotemporal interactions of BALs.\nIn this paper, we demonstrate that weak self-mode-locking\ntypically occurs in free-running BALs and manifests itself in\nfast regular intensity pulsations of the emitted light at the cavity\nroundtrip time. It can be substantially enhanced to almost com-\npletely pulsed emission across the entire width of the laser. We\nachieve this by injection of a single optical 50-ps pulse into the\nBAL, which initiates the output of a sharp regular train of 13-ps\nshort optical pulses persisting for about 100 cavity-roundtrips.\nThese investigations are extended by numerical modeling based\non multimode Maxwell-Bloch equations. From the modeling,\nwe can explain how the propagating injected pulse is able to en-\nhance and stabilize the mode-locking by dynamically coupling\nthe different longitudinal modes. The calculations also show the\ndestabilizing influence of the lateral modes and spatial interac-\ntions which finally reduce the strong longitudinal mode-locking,\ngiving rise to the formation of laterally migrating filaments as\nbefore the optical injection.\nII. EXPERIMENTAL RESULTS\nThe measurements have been performed using a standard\nBAL with a quantum-well active area emitting at a wave-\nlength around 800 nm with a stripe width of 100 m and a\ncavity-length of 2 mm. The front facet of the BAL is imaged\nonto the entrance slit of a single-shot streak camera, which\ndetects laterally and temporally resolved nearfield images of\nthe output intensity with a temporal resolution of 5 ps. Details\nof the streak camera setup can be found in [4]. Fig. 1 depicts\na 1.6-ns long streak image of the solitary BAL operated at\n1077-260X\/04$20.00 © 2004 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:19 from IEEE Xplore.  Restrictions apply.\nKAISER et al.: MODE-LOCKING IN BALS ENHANCED BY PICOSECOND-PULSE INJECTION 969\nFig. 1. Streak camera image of the nearfield emission of the free-running laser.\n1.5 (threshold current mA). The vertical axis\nof the image displays the lateral position on the laser facet,\nwhile the horizontal axis shows the temporal evolution of the\nemitted intensity. We observe the well-known filamentation\nand the existence of lateral instabilites and laterally migrating\nfilaments on timescales of a few hundred picoseconds. This\ndynamical behavior has been reported before and is explained\nby coupling of lateral modes due to an interplay between spatial\nholeburning, self-focusing and diffraction [4].\nIn addition to the dynamics on timescales of a few hundred\npicoseconds, the laser exhibits a fast regular intensity modula-\ntion. The modulation period of 54 ps (18.5 GHz) corresponds to\nthe longitudinal mode separation of 0.04 nm in the 2-mm-long\ncavity. It indicates the existence of partial self-coupling of the\nlongitudinal modes in these devices. The formation of the lat-\neral dynamics as well as the fast intensity pulsation has also been\nfound and explained in numerical modeling of BALs [20]. It is a\nparticular consequence of the spatially extended active medium\nof these lasers along with the various timescales of propagation\nand spatial holeburning. Thereby, we find in particular that the\noccurence of the lateral instabilities in the BAL supports the for-\nmation of the longitudinal mode-locking.\nIn general, we have observed this kind of moderate intensity\npulsation at the cavity roundtrip period in many BALs, there-\nfore, being one of their distinct emission features. This is in\ncontrast to conventional solitary narrow stripe emitters were\nself-mode-locking in free running operation to our knowledge\nis usually not observed, with the exceptions of degraded devices\ncontaining regions of saturable absorption [12] or, as recently re-\nported, in a quantum cascade laser exhibiting giant nonlinearity\n[18].\nIn the following, we concentrate on the fast round-trip pulsa-\ntion. Therefore, we analyzed the emission in the shortest acces-\nsible time window of 620 ps allowing the highest temporal reso-\nlution. This is shown in Fig. 2(a). The fast round-trip modulation\nat 54-ps repetition rate becomes even more apparent in the spa-\ntially integrated time series depicted in Fig. 2(b), which has been\nobtained from Fig. 2(a) by numerically integrating the intensity\nacross the whole stripe width. To enhance the formation of the\nintensity pulsation, we additionally inject an optical picosecond\npulse into the BAL and investigate its propagation and its im-\npact on the emission. For this, a wavelength-tunable (around 800\nnm), 7-nm-wide, 150-fs pulse from a Ti:sapphire-laser is used.\nFig. 2. Streak camera images of (a) the nearfield emission of the free-running\nlaser and (c) several nanoseconds after injection of the optical pulse; (b) and (d)\nshow the corresponding spatially integrated output power versus time.\nIt is sent through 25 m of optical single-mode fiber, which tem-\nporally broadens it to about 50 ps, and is injected via a focusing\nlens into the BAL through the rear facet, while the emission\nfrom the front facet is again imaged onto the streak camera. The\nenergy of the injected pulse inside the BAL is roughly estimated\nto 20 pJ, which means that its peak power is comparable to, or\nslightly larger than the power of the solitary BAL’s emission.\nThe impact of the injected pulse is considerable. First, it excites\nrelaxation oscillations, which are damped after a few nanosec-\nonds. At the same time, however, the injection of the Ti:sapphire\npulse changes the emission of the BAL from the moderately\nmodulated continuous wave (CW)-operation of Fig. 2(a) to al-\nmost completely pulsed output. The pulses persist even after the\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:19 from IEEE Xplore.  Restrictions apply.\n970 IEEE JOURNAL OF SELECTED TOPICS IN QUANTUM ELECTRONICS, VOL. 10, NO. 5, SEPTEMBER\/OCTOBER 2004\nFig. 3. Evolution of the pulse duration after injection of the 50-ps pulse\nas function of the number of cavity-roundtrips. The value of 13 ps plotted\nafter the axis break is the finally stable pulsewidth which persists for several\nnanoseconds.\nrelaxation oscillations have been damped. This situation is de-\npicted in Fig. 2(c) and (d), which shows the emission of the BAL\nabout 2 ns after the pulse injection. The streak image [Fig. 2(c)]\nshows that the pulsed emission is not confined to a restricted\nregion of the laser. In spite of pronounced lateral intensity vari-\nations, which indicate strong beam filamentation, the pulses are,\nin fact, perfectly synchronized across the entire laser stripe, re-\nsulting in the high output peaks in the spatially integrated plot\nin Fig. 2(d). The pulse duration amounts to 13 ps with an energy\nof several picojoules. The consecutive pulses have a repetition\nperiod of 54 ps.\nAnalyzing streak-camera images which are taken beginning\nat the time of the injection of the external pulse, we are able to\nfollow the formation of the final 13-ps pulsation from the initial\ninjection of the 50-ps pulse. The evolution of the pulse duration\nfor consecutive roundtrips is plotted in Fig. 3. We remarkably\nfind that the initial pulse shortens during the first roundtrips until\nit reaches its final value of 13 ps. We should note that neither the\nshortening nor the finally stable 13-ps pulses can be explained\nsimply by dispersion compensation of the injected pulse due\nto the semiconductor group velocity dispersion (GVD). The in-\njected pulse is indeed strongly chirped after propagation through\nthe fiber. However, the GVD of the BAL has been determined to\nbe m . It has the same sign as the fiber\ndispersion and cannot compensate the initial chirp. Therefore,\nwe interpret the results as a successive enhancement of the lon-\ngitudinal mode-locking as the injected pulse dynamically cou-\nples the longitudinal modes of the BAL while propagating. It\nis worth noting that the establishment of the final 13-ps pulse\ntrain is fairly insensitive to the position and angle of the initial\npulse injection and it also works when the center wavelength of\nthe pulse is tuned about 10 nm away from the solitary BAL’s\nemission wavelength. This indicates that the coupling of the\ninjected pulse to the laser modes is rather a dynamic process\nthan an initial coherent preparation. It requires a few roundtrips\nfor building up the locking of all the modes. The high modu-\nlation depth and the small duration of the pulses—13 ps is a\nreasonable value for a semiconductor laser without having addi-\ntional subsequent chirp compensation—imply that almost per-\nfect mode-locking is achieved under these conditions.\nFor support of this interpretation and to gain insight into the\nphysical mechanisms, we perform numerical simulations of the\nBAL dynamics under optical picosecond pulse injection.\nIII. MODELING RESULTS AND DISCUSSION\nIn recent years, numerous models have been set up to de-\nscribe and simulate the behavior of semiconductor lasers. Listed\nin order of increasing complexity, these are: phenomenological\nrate equations for the (spatially homogeneous) carrier and\nphoton dynamics, semiclassical laser theory on the basis of\nMaxwell-Bloch equations for the spatio-temporal dynamics of\nthe optical fields and the electron-hole plasma, and quantum\ntheoretical descriptions of the full light and matter dynamics in\nthe semiconductor laser with consideration of quantum fluc-\ntuations. The advantage of the semiclassical Maxwell-Bloch\ntheory is the spatially and temporally resolved description\nof the coupled light-matter dynamics. This theory provides,\nin particular, a systematic inclusion of all physical processes\nrelevant in a given material system and of nonlinear effects\nwith their respective characteristic interaction lengths and time\nscales ranging from femtoseconds up to nanoseconds.\nThe numerical results presented in this paper are based on\nthe semiclassical laser theory, which is appropriate for a real-\nistic description of physical properties (e.g., temporal dynamics,\nspatial and spectral beam quality) of spatially extended semi-\nconductor lasers. The simulations on the coupled spatiotem-\nporal light-field and carrier dynamics in the BAL use an effec-\ntive multimode Maxwell-Bloch approach [21]. The multimode\nMaxwell-Bloch equations consist of coupled spatio-temporally\nresolved wave equations for the counterpropagating light fields\nincluding propagation, diffraction, and longitudinal mode dy-\nnamics and two-level Bloch equations for the dynamics of the\ncarriers. The dynamic spatio-temporal interplay of longitudinal\nmodes that typically affects the emission dynamics of BALs is\nincluded via a multimode expansion of the fields. Due to the ex-\nplicit inclusion of longitudinal modes and the consideration of\ntransverse light field and carrier dynamics, the model allows the\nself-consistent inclusion of the coexistence and the interaction\nof many transverse and longitudinal modes responsible for the\ncomplex light field and mode dynamics. We would like to note\nthat our model is not appropriate for the simulation of micro-\nscopic carrier effects such as carrier-heating, highly nonlinear\ncarrier distributions, phonon dynamics, or many-body effects.\nA suitable description of these phenomena which is beyond the\nscope of the paper would require a microscopic description [21].\nThe parameters of the laser structure were taken in ac-\ncordance with the experimental values as far as they were\naccessible. These are wavelength, cavity length, width,\nindex-guiding, and mirror reflectivities. For the remaining\nlaser parameters we have taken reasonable values. This allows\nfor a qualitative explanation of the observed effects, whereas\nquantitative reproduction of details of the spatio-temporal\nemission dynamics is beyond the scope of this paper.\nFig. 4 displays in two time-traces the calculated nearfield dy-\nnamics of the optically injected BAL. In the simulations the in-\njection of the light pulse, which has in this case been assumed\nunchirped, and had a pulse duration of 50 ps, was realized via the\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:19 from IEEE Xplore.  Restrictions apply.\nKAISER et al.: MODE-LOCKING IN BALS ENHANCED BY PICOSECOND-PULSE INJECTION 971\nFig. 4. Modeling results of the spatiotemporal nearfield emission dynamics\nof the BAL after optical pulse injection. In analogy to the experimental streak\ncamera images, the horizontal axis shows time and the vertical axis the lateral\nposition on the laser facet. Both images display 1000 ps of the time evolution,\n(a) starting 200 ps and (b) 3200 ps after pulse injection. The lateral width of the\nemission is approximately 100 \u0016m.\nboundary conditions of the wave equations. Figs. 4(a) and (b)\nshow the dynamics of the emitted light fields in a time window\nof 1000 ps, respectively. The plots visualize the buildup and\ndecay of a longitudinal mode-locking: in the first time-trace\n[Fig. 4(a)], 200 ps after the injection, the injected light pulse\nstarts its dynamic interaction with the laser-internal light field.\nAfter a few roundtrips in the active area, the pulse has estab-\nlished a synchronization of the complex transverse light-field\ndynamics of the free-running laser leading to the formation of\nregular pulses with a lateral light field distribution that extends\nover the whole width of the laser, comparable to the experi-\nmental result shown in Fig. 2(c). The periodicity of the emitted\nlight pulses thereby corresponds to the roundtrip time in the\nBAL. The periodic intensity modulations that can be seen in the\nfree-running laser thus are triggered by the propagating light\npulse leading to locking of the longitudinal modes.\nIn the second time window, starting 3200 ps after the injec-\ntion of the light pulse, the transverse light pattern has changed\nsignificantly. A complex transverse light field dynamics arises\nleading to asymmetric intensity patterns. The amplitude of the\npropagating pulse is reduced by dynamic wave-mixing between\nthe propagating pulse and the laser-internal light fields resulting\nfrom the nonlinear interaction with the active charge carrier\nplasma of the laser medium leading to a decrease in its influence\nand consequently to a stronger influence of the laser internal dy-\nnamics. In this temporal regime, the coupling of the longitudinal\nmodes of the BAL has diminished and the laser emission is char-\nacterized by the spatio-temporal light field dynamics character-\nizing the free-running BAL. As a result, the light field dynamics\nis now dominated by the mutual interplay of light diffraction,\nhole-burning, and carrier scattering leading to a complex lon-\ngitudinal and transverse light field dynamics. In particular, we\nobtain the transverse dynamics that is typical for the free-run-\nFig. 5. Calculated evolution of the pulse duration after injection of the 50-ps\npulse as function of the number of cavity-roundtrips.\nning laser: the intensity moves across the laser facet alternating\nfrom one side to the other on a slower timescale of several hun-\ndreds of picoseconds related to locking of lateral modes. Thus,\nit qualitatively resembles the experimental streak-image of the\nfree-running laser as displayed in Fig. 1. The duration of the\nlongitudinal mode-locking regime depends on the intensity of\nthe injected light pulse and the injection current in the BAL.\nTypically, it persists for several nanoseconds, i.e., in the order\nof 50–100 roundtrips.\nThe results illustrate the ambivalent effect of the multiple lat-\neral modes of the BAL on the longitudinal mode-locking. On\nthe one hand, it is the lateral extension of the BAL that supports\nthe buildup of the moderate roundtrip pulsation in free running\noperation, making the pulsation one of the typical features of the\nemission dynamics of BALs. Moreover, in the regime of strong\nlongitudinal mode-locking after the pulse injection, higher order\nlateral modes of different longitudinal order are contributing\nto the longitudinal mode-locking, so that the pulsed emission\nextends and is synchronized across the entire laser stripe. On\nthe other hand, the lateral width of the laser is finally respon-\nsible for a decrease of the pronounced pulsation generated by\nthe pulse injection when lateral modes drop out of the longitu-\ndinal mode-locking. This happens due to lateral instabilities and\nlocking of lateral modes of different order within the same lon-\ngitudinal order. So, finally, the emission is governed by a mix-\nture of partial longitudinal and lateral self-coupling as is typical\nfor free running BALs.\nIntegration of the light fields at the output facet in transverse\ndirection allows the calculation of the duration of the emitted\npulses in dependence of the number of roundtrips. The com-\nputational results, which are summarized in Fig. 5, clearly re-\nveal a reduction in pulse duration, indicating the occurrence of\nlongitudinal mode-locking. They confirm the experimental re-\nsults of Fig. 3. The pulse duration approaches a value of 14 ps,\nwhich is similar to the experimentally obtained result. We would\nlike to note that the close agreement between theory and exper-\niment exists although an ideal (unchirped) pulse has been used\nin the modeling in order to clearly identify mode-locking as the\npulse shortening mechanisms. Since the spectral width of the\ninjected pulse in this case is less than the longitudinal mode sep-\naration, it cannot simultaneously couple to the numerous longi-\ntudinal modes coexisting in the gain spectrum of the BAL. This\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:19 from IEEE Xplore.  Restrictions apply.\n972 IEEE JOURNAL OF SELECTED TOPICS IN QUANTUM ELECTRONICS, VOL. 10, NO. 5, SEPTEMBER\/OCTOBER 2004\nindicates that the observed mode-locking is a dynamic effect\noriginating from an interplay between pulse propagation and\nspatio-spectral mode dynamics.\nIV. CONCLUSION\nWe have investigated longitudinal mode-locking in BALs.\nThese lasers are attractive devices for mode-locking because\nof their high-power, multiple longitudinal mode operation, and\nintrinsic optical nonlinearities. The spatial and spectral com-\nplexity of BALs leads among other features to a distinct fast\npulsation by a partial self-mode-locking in free-running opera-\ntion already. We have shown, that by injection of an initial op-\ntical pulse almost perfect mode-locking across the entire width\nof the laser resulting in the emission of a 13-ps pulses is achieved\nover several nanoseconds. Without further control, however, the\npulse emission finally decreases and laterally migrating fila-\nments evolve. Thus, we expect that by successive injection of\noptical pulses synchronized to a suitable subharmonic of the\nBAL roundtrip time stable picosecond pulse emission over a\nlong time and at high powers should be possible.\nREFERENCES\n[1] R. J. Lang, A. G. Larsson, and J. G. Cody, “Lateral modes of broad\narea semiconductor lasers: Theory and experiment,” IEEE J. Quantum\nElectron., vol. 27, pp. 312–320, Mar. 1991.\n[2] H. Adachihara, O. Hess, E. Abraham, P. Ru, and J. V. Moloney, “Spa-\ntiotemporal chaos in broad-area semiconductor lasers,” J. Opt. Soc.\nAmer. B, vol. 10, pp. 658–665, 1993.\n[3] J. R. Marciante and G. P. Agrawal, “Spatio-temporal characteristics of\nfilamentation in broad-area semiconductor lasers,” IEEE J. Quantum\nElectron., vol. 33, pp. 1174–1179, July 1997.\n[4] T. Burkhard, M. O. Ziegler, I. Fischer, and W. Elsäßer, “Spatio-temporal\ndynamics of broad area semiconductor lasers and its characterization,”\nChaos Solitons Fractals, vol. 10, pp. 845–850, 1999.\n[5] E. Gehrig and O. Hess, “Dynamics of high-power diode lasers,” in Topics\nin Applied Optics, R. Diehl, Ed. Heidelberg, Germany: Springer, 2000,\nvol. 3, pp. 55–82.\n[6] G. L. Abbas, S. Yang, V. W. S. Chan, and J. G. Fujimoto, “Injection\nbehavior of high-power broad-area diode lasers,” Opt. Lett., vol. 12, pp.\n605–607, 1987.\n[7] H. Horiuchi, T. Shimura, T. Omatsu, O. Matuba, and K. Kuroda,\n“Narrow bandwidth operation of high-power broad-area diode laser\nusing casacded phase-conjugate injection locking,” Appl. Phys. B, vol.\n68, pp. 1021–1025, 1999.\n[8] Y. Liu, H. K. Liu, and Y. Braiman, “Injection locking of individual\nbroad-area lasers in an intergated high-power diode array,” Appl. Phys.\nLett., vol. 81, pp. 978–980, 2002.\n[9] V. Raab and R. Menzel, “External resonator design for high-power laser\ndiodes that yields 400 mW of TEM power,” Opt. Lett., vol. 27, pp.\n167–169, 2002.\n[10] S. K. Mandre, I. Fischer, and W. Elsäßer, “Control of the spatiotemporal\nemission of a broad-area semiconductor laser by spatially filtered feed-\nback,” Opt. Lett., vol. 28, pp. 1135–1137, 2003.\n[11] P.-T. Ho, L. A. Glasser, E. P. Ippen, and H. A. Haus, “Picosecond pulse\ngeneration with a CW GaAlAs laser diode,” Appl. Phys. Lett., vol. 33,\npp. 241–242, 1978.\n[12] K. Y. Lau, I. Ury, and A. Yariv, “Passive and active mode locking of a\nsemiconductor laser without an external cavity,” Appl. Phys. Lett., vol.\n46, pp. 1117–1119, 1985.\n[13] P. W. Smith, Y. Silberberg, and D. A. B. Miller, “Mode locking of semi-\nconductor diode lasers using saturable excitonic nonlinearities,” J. Opt.\nSoc. Amer. B, vol. 2, pp. 1228–1235, 1985.\n[14] K. Y. Lau, “Short pulse and high-frequency signal generation in semi-\nconductor lasers,” J. Lightwave Technol., vol. 7, pp. 400–419, Feb. 1989.\n[15] L. F. Tiemeijer, P. I. Kuindersma, P. J. A. Thijs, and G. L. J. Rikken, “Pas-\nsive FM locking in InGaAsP semiconductor lasers,” IEEE J. Quantum\nElectron., vol. 25, pp. 1385–1392, June 1989.\n[16] D. J. Derickson, R. J. Helkey, A. Mar, J. R. Karin, J. G. Wasserbauer,\nand J. E. Bowers, “Short pulse generation using multisegment mode-\nlocked semiconductor lasers,” IEEE J. Quantum Electron., vol. 28, pp.\n2186–2202, Oct. 1992.\n[17] P. P. Vasil’ev, I. H. White, and J. Gowar, “Fast phenomena in semicon-\nductor lasers,” Rep. Prog. Phys., vol. 63, pp. 1997–2042, 2000.\n[18] R. Paiella, F. Capasso, C. Gmachl, D. L. Sivco, J. N. Baillargeon, A. L.\nHutchinson, A. Y. Cho, and H. C. Liu, “Self-mode-locking of quantum\ncascade lasers with giant ultrafast optical nonlinearities,” Science, vol.\n290, pp. 1739–1742, 2000.\n[19] Y. J. Wen, H. F. Liu, and D. Novak, “Optical signal generation at mil-\nlimeter-wave repetition rates using semiconductor lasers with pulsed\nsubharmonic optical injection,” IEEE J. Quantum Electron., vol. 37, pp.\n1183–1193, Sept. 2001.\n[20] O. Hess and T. Kuhn, “Maxwell-Bloch equations for spatially inhomo-\ngeneous semiconductor lasers. II. Spatiotemporal dynamics,” Phys. Rev.\nA, Gen. Phys., vol. 54, pp. 3360–3368, 1996.\n[21] E. Gehrig and O. Hess, Spatio-Temporal Dynamics and Quantum\nFluctuations in Semiconductor Lasers, Springer Tracts in Modern\nPhysics. Heidelberg, Germany: Springer, 2003, vol. 189.\nJoachim Kaiser was born in Stuttgart, Germany, in\n1974. He received the diploma degree from Darm-\nstadt University of Technology, Darmstadt, Germany,\nin 2000, where he is currently working toward the\nPh.D. degree.\nHis research interests include spatio-temporal\nemission properties of broad-area lasers, fem-\ntosecond spectroscopy of semiconductor lasers, and\nintensity noise properties of VCSELs and RCLEDs.\nIngo Fischer was born in Marburg, Germany, in\n1966. He received the diploma and Ph.D. degrees\nin physics from the Philipps University, Marburg,\nGermany, in 1992 and 1995, respectively.\nIn 1995, he joined the Institute of Applied Physics,\nDarmstadt University of Technology, Darmstadt,\nGermany, where his research activities are centered\naround spatial, spectral, and dynamical emission\nproperties of semiconductor lasers. His studies\nconcentrate on nonlinear dynamics, synchronization\nof coupled lasers, VCSEL emission, high-power\nlaser emission, femtosecond spectroscopy and THz generation. He has had\nresearch stays with Air Force Research Laboratories, Albuquerque, NM, in\n1999, and ATR, Kyoto, Japan, in 1999 and 2000.\nDr. Fischer received the Research Prize of the Adolf-Messer Foundation in\n2000 and the first Hassian Cooperation Prize of the Technology Transfer Net-\nwork in 2004.\nWolfgang Elsäßer (M’94-SM’97) was born in Pforzheim, Germany, in 1954.\nHe received the diploma degree in physics from the Technical University of\nKarlsruhe, Karlsruhe, Germany, in 1980, the Ph.D. degree in physics from the\nUniversity Stuttgart, Stuttgart, Germany, in 1984, and the Habilitation degree\nin experimental physics from the Philipps-University Marburg, Marburg, Ger-\nmany, in 1991.\nFrom 1981 to 1985, he was with the Max-Planck-Institute for Solid State Re-\nsearch, Stuttgart, Germany. From 1985 to 1995, he was with Philipps-University\nMarburg. Since 1995, he has been a Full Professor with the Institute for Applied\nPhysics, Darmstadt University of Technology, Darmstadt, Germany. He was on\nsabbatical leave in 1992 with the Ecole Nationale Superieure des Telecommuni-\ncations, Paris, France. His research stays have included Trinity College, Dublin,\nIreland, in 1990, 1996, 1999, and 2000.\nDr. Elsäßer is a Member of the German Physical Society. He was awarded the\nOtto-Hahn-Medal (1985), the Werner-von-Siemens-Medal (1985), the Rudolf-\nKaiser Prize (1991), and the IEE J. J. Thomson Premium (1995).\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:19 from IEEE Xplore.  Restrictions apply.\nKAISER et al.: MODE-LOCKING IN BALS ENHANCED BY PICOSECOND-PULSE INJECTION 973\nEdeltraud Gehrig received the diploma and\nDr.rer.nat degrees in physics from the University of\nKaiserslautern, Kaiserslautern, Germany, in 1995\nand 1999, respectively.\nFrom 2000 to 2003, she was a Senior Research\nAssociate with the Theoretical Quantum Electronics\nGroup, DLR Stuttgart, Stuttgart, Germany. Since\nApril 2003, she has been a Senior Research Asso-\nciate with the University of Surrey, Surrey, U.K. Her\nresearch include biophotonic systems, molecular\nmotors, ultrafast nonlinear dynamics, dynamics and\ncontrol of high-power semiconductor lasers and amplifiers, luminescence, and\nquantum dot lasers.\nOrtwin Hess received the diploma and Dr.rer.nat de-\ngrees from the Technical University of Berlin, Berlin,\nGermany, in 1990 and 1993, respectively.\nFrom 1990 to 1992, he was a Research Associate\nwith Heriot-Watt University, Edinburgh, UK and also\nwith the University of Tucson, Tuscon, AZ. From\n1993 to 1994, he was a Postdoctoral Researcher with\nthe University of Marburg, Marburg, Germany. From\n1994 to 2003, he was the Head of the Theoretical\nQuantum Electronics Group , Institute of Technical\nPhysics, DLR Stuttgart, Stuttgart, Germany. He had\na Habilitation in Theoretical Physics at the University of Stuttgart in 1997\nand became an Adjunct Professor in 1998. Since 2001, has been an Honorary\nProfessor at Tampere University of Technology, Tampere, Finland. He was\na Visiting Professor with Stanford University, Stanford, CA, from 1997 to\n1998 and also with the University of Munich, Munich, Germany, from 2000\nto 2001. Since March 2003, he has held the Chair of Computational Quantum\nElectronics at the Advanced Technology Institute, the University of Surrey,\nSurrey, U.K. His research interests are focussed on the theory and mathematical\nmodeling of the ultrafast optics and complex laser dynamics (quantum dot\nlasers, control of spatio-temporal laser dynamics, ultrafast effects in active\nsemiconductor media), nano-photonic materials (quantum dots, photonic\ncrystals, synthetic opals, liquid crystals, bio-molecules), biomodeling, as well\nas nano-thermodynamics and nano-rheology. Together with his research group,\nhe strives to computationally explore the terahertz-world and nano-space of\nnovel advanced technologies in photonics as well as nano- and biomedical\nelectronics.\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:19 from IEEE Xplore.  Restrictions apply.\n"}