{"doi":"10.1016\/j.scitotenv.2010.09.033","coreId":"54070","oai":"oai:nora.nerc.ac.uk:12573","identifiers":["oai:nora.nerc.ac.uk:12573","10.1016\/j.scitotenv.2010.09.033"],"title":"Sedimentary records of sewage pollution using faecal markers in contrasting peri-urban shallow lakes","authors":["Vane, C.H.","Kim, A.W.","McGowan, S.","Leng, M.J.","Heaton, T.H.E.","Kendrick, C.P.","Coombs, P.","Yang, H.","Swann, G.E.A."],"enrichments":{"references":[],"documentType":{"type":0.5555555556}},"contributors":[],"datePublished":"2010","abstract":"Sewage contamination in shallow lake sediments is of concern because the pathogens, organic matter and nutrients contribute to the deterioration of the water-bodies' health and ecology. Sediment cores from three shallow lakes (Coneries, Church and Clifton Ponds) within Attenborough nature reserve located downstream of sewage treatment works were analysed for TOC, C\/N, δ13C, δ15N, bacterial coliforms and faecal sterols. 210Pb and 137Cs activities were used to date the sediments. Elemental analysis suggests that the source of organic matter was algal and down profile changes in δ13C indicate a possible decrease in productivity with time which could be due to improvements in sewage treatment. δ15N for Coneries Pond are slightly higher than those observed in Church or Clifton and are consistent with a sewage-derived nitrate source which has been diluted by non-sewage sources of N. The similarity in δ15N values (+ 12‰ to + 10‰) indicates that the three ponds were not entirely hydrologically isolated. Analysis by gas chromatography\/mass spectrometry (GC\/MS) reveals that Coneries Pond had sterol concentrations in the range 20 to 30 μg\/g (dry wt.), whereas, those from Clifton and Church Ponds were lower. The highest concentrations of the human-sourced sewage marker 5β-coprostanol were observed in the top 40 cm of Coneries Pond with values up to 2.2 μg\/g. In contrast, Church and Clifton Pond sediments contain only trace amounts throughout. Down-profile comparison of 5β-coprostanol\/cholesterol, 5β-coprostanol\/(5β-coprostanol + 5α-cholestanol) and 5β-epicoprostanol\/coprostanol as well as 5α-cholestanol\/cholesterol suggests that Coneries Pond has received appreciable amounts of faecal contamination. Examination of 5β-stigmastanol (marker for herbivorous\/ruminant animals) down core concentrations suggests a recent decrease in manure slurry input to Coneries Pond. The greater concentration of β-sitosterol in sediments from Church and Clifton Ponds as compared to Coneries is attributed in part to their greater diversity and extent of aquatic plants and avian faeces.\\ud\n\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/54070.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/12573\/1\/Sewage_Paper_NORA_2010.pdf","pdfHashValue":"641dbeee70c3bc448de61156d821a3a3073daa1c","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:12573<\/identifier><datestamp>\n      2012-11-22T12:16:30Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/12573\/<\/dc:relation><dc:title>\n        Sedimentary records of sewage pollution using faecal markers in contrasting peri-urban shallow lakes <\/dc:title><dc:creator>\n        Vane, C.H.<\/dc:creator><dc:creator>\n        Kim, A.W.<\/dc:creator><dc:creator>\n        McGowan, S.<\/dc:creator><dc:creator>\n        Leng, M.J.<\/dc:creator><dc:creator>\n        Heaton, T.H.E.<\/dc:creator><dc:creator>\n        Kendrick, C.P.<\/dc:creator><dc:creator>\n        Coombs, P.<\/dc:creator><dc:creator>\n        Yang, H.<\/dc:creator><dc:creator>\n        Swann, G.E.A.<\/dc:creator><dc:description>\n        Sewage contamination in shallow lake sediments is of concern because the pathogens, organic matter and nutrients contribute to the deterioration of the water-bodies' health and ecology. Sediment cores from three shallow lakes (Coneries, Church and Clifton Ponds) within Attenborough nature reserve located downstream of sewage treatment works were analysed for TOC, C\/N, δ13C, δ15N, bacterial coliforms and faecal sterols. 210Pb and 137Cs activities were used to date the sediments. Elemental analysis suggests that the source of organic matter was algal and down profile changes in δ13C indicate a possible decrease in productivity with time which could be due to improvements in sewage treatment. δ15N for Coneries Pond are slightly higher than those observed in Church or Clifton and are consistent with a sewage-derived nitrate source which has been diluted by non-sewage sources of N. The similarity in δ15N values (+ 12‰ to + 10‰) indicates that the three ponds were not entirely hydrologically isolated. Analysis by gas chromatography\/mass spectrometry (GC\/MS) reveals that Coneries Pond had sterol concentrations in the range 20 to 30 μg\/g (dry wt.), whereas, those from Clifton and Church Ponds were lower. The highest concentrations of the human-sourced sewage marker 5β-coprostanol were observed in the top 40 cm of Coneries Pond with values up to 2.2 μg\/g. In contrast, Church and Clifton Pond sediments contain only trace amounts throughout. Down-profile comparison of 5β-coprostanol\/cholesterol, 5β-coprostanol\/(5β-coprostanol + 5α-cholestanol) and 5β-epicoprostanol\/coprostanol as well as 5α-cholestanol\/cholesterol suggests that Coneries Pond has received appreciable amounts of faecal contamination. Examination of 5β-stigmastanol (marker for herbivorous\/ruminant animals) down core concentrations suggests a recent decrease in manure slurry input to Coneries Pond. The greater concentration of β-sitosterol in sediments from Church and Clifton Ponds as compared to Coneries is attributed in part to their greater diversity and extent of aquatic plants and avian faeces.\\ud\n\\ud\n<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/12573\/1\/Sewage_Paper_NORA_2010.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Vane, C.H.; Kim, A.W.; McGowan, S.; Leng, M.J.; Heaton, T.H.E.; Kendrick, C.P.; Coombs, P.; Yang, H.; Swann, G.E.A..  2010  Sedimentary records of sewage pollution using faecal markers in contrasting peri-urban shallow lakes.   Science of the Total Environment, 409 (2). 345-356.  https:\/\/doi.org\/10.1016\/j.scitotenv.2010.09.033 <https:\/\/doi.org\/10.1016\/j.scitotenv.2010.09.033>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.sciencedirect.com\/science\/journal\/00489697<\/dc:relation><dc:relation>\n        10.1016\/j.scitotenv.2010.09.033<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/12573\/","http:\/\/www.sciencedirect.com\/science\/journal\/00489697","10.1016\/j.scitotenv.2010.09.033"],"year":2010,"topics":[],"subject":["Publication - Article","PeerReviewed"],"fullText":"1 \n \nSedimentary records of sewage pollution using faecal markers in contrasting 1 \nperi-urban shallow lakes. 2 \n 3 \nC. H. Vane 1*, A.W. Kim 1, S. McGowan 2, M.J. Leng 3, T.H.E. Heaton3, C.P. Kendrick3, P. 4 \nCoombs1., H. Yang4., G.E.A. Swann3 5 \n 6 \n1British Geological Survey, Keyworth, Nottingham, NG12 5GG 7 \nNG12 5GG, UK, 2 School of Geography, University of Nottingham, University Park, 8 \nNottingham, NG7 2RD, UK, 3NERC Isotope Geosciences Laboratory, British Geological 9 \nSurvey, Keyworth, Nottingham, NG12 5GG, 4Environmental Change Research Centre, 10 \nUniversity College London, WC16BT 11 \n 12 \n*Corresponding author. Tel+44 (0)115 936 3017; fax+44 (0)115 936 3460. E-mail address: 13 \nchv@bgs.ac.uk 14 \n 15 \nKeywords: Attenborough; Coprostanol; Gravel Pit; Pb-210; Sewage; Stable Isotopes 16 \n 17 \nABSTRACT: Sewage contamination in shallow lake sediments is of concern because the 18 \npathogens, organic matter and nutrients contribute to the deterioration of the water-bodies 19 \nhealth and ecology. Sediment cores from three shallow lakes (Coneries, Church and Clifton 20 \nPonds) within Attenborough nature reserve located downstream of sewage treatment works 21 \nwere analysed for TOC, C\/N, δ13C, δ15N, bacterial coliforms and faecal sterols. 210Pb and 22 \n137Cs activities were used to date the sediments. Elemental analysis suggest that the  source of 23 \norganic matter was algal and down profile changes in δ13C indicate a possible decrease in 24 \nproductivity with time which could be due to improvements in sewage treatment. δ15N for 25 \nConeries Pond are slightly higher than those observed in Church or Clifton and are consistent 26 \nwith a sewage-derived nitrate source which has been diluted by non-sewage sources of N.  27 \nThe similarity in δ15N values (+12‰ to +10‰) indicate that the three ponds were not entirely 28 \nhydrologically isolated. Analysis by Gas-Chromatography Mass-Spectrometry (GC\/MS) 29 \nreveal that Coneries Pond had sterol concentrations in the range 20 to 30 µg\/g (dry wt.), 30 \nwhereas, those from Clifton and Church Ponds were lower. The highest concentrations of the 31 \nhuman-sourced sewage marker 5β−coprostanol were observed in the top 40 cm of Coneries 32 \nPond with values of up to 2.2 µg\/g. In contrast, Church and Clifton Pond sediments contain 33 \n2 \n \nonly trace amounts throughout. Down-profile comparison of 5β−coprostanol\/cholesterol, 1 \n5β−coprostanol\/(5β−coprostanol+5α−cholestanol) and 5β-epicoprostanol\/coprostanol as well 2 \nas 5α−cholestanol\/cholesterol suggest that Coneries Pond has received appreciable amounts 3 \nof faecal contamination. Examination of 5β-stigmastanol, (marker for herbivorous \/ ruminant 4 \nanimals), down core concentrations suggest a recent decrease in manure slurry input to 5 \nConeries Pond. The greater concentration of β-sitosterol in sediments from Church and 6 \nClifton Ponds as compared to Coneries is attributed in part to their greater diversity and 7 \nextent of aquatic plants and avian faeces.   8 \n 9 \n1. Introduction 10 \n 11 \nSewage pollution is a major cause of decreasing water quality in rivers and lakes within the 12 \nUK and throughout the world. The presence of human and animal faecal matter at elevated 13 \nconcentrations in waters and surface sediments in shallow lakes is of widespread concern for 14 \ntwo reasons. Firstly, the complex chemical mixture causes nutrient enrichment, 15 \neutrophication, toxic algal blooms and water column anoxia which in turn can lead to a 16 \nreduction in species diversity and ecosystem instability. Secondly, untreated sewage can, 17 \nunder specific conditions, provide a growth medium for bacterial and viral pathogens that if 18 \ningested by humans leads to diseases such as Salmonella, Cholera, Diarrhoea, Typhoid, 19 \nGastroenteritis and Hepatitis A (Mudge and Ball, 2006).  20 \n 21 \nEstimation of sewage pollution is normally elicited from the quantification of total coliforms, 22 \nfaecal coliforms and faecal Streptococci, which, although not pathogenic, serve as proxies for 23 \npathogenic bacteria and total sewage input. However, the use of these indicator organisms 24 \nprovides little information concerning the source or age of the faecal material and requires 25 \nthat waters and sediments be analysed soon after collection. A complementary approach to 26 \nevaluate sewage discharge and accumulation in rivers, lakes, estuaries and marine 27 \nenvironments is to characterise specific groups of molecules contained within the sewage 28 \n3 \n \nsuch as faecal sterols (Bull et al., 2002; Leeming et al., 1996; Mudge et al., 1999; Mudge and 1 \nDuce, 2005; Peng et al., 2005; Readman et al., 2005; Seguel et al., 2001). 2 \n 3 \nPrevious investigations of faecal sterol contents in waters and sediments have tracked 4 \nconcentrations of between five to seventeen sterols including coprostanone, coprostanol, 5 \nepicoprostanol, cholesterol, cholestanol, campestrol, stigmasterol, β-sitosterol, fucosterol and 6 \nstigmastanol (Isobe et al., 2002; Leeming et al., 1996; Shah et al., 2006). The abundance and 7 \ndistribution of faecal sterols in excreta is controlled in part by an animal’s diet as well as 8 \nbacterially-mediated reductive modifications in the gut and also endogenous production of 9 \nsterols such as cholesterol (Leeming et al., 1996). For example, in the intestinal tracts of 10 \nmany higher mammals, the biological precursor compound cholesterol is converted to 5β-11 \nstanols via biohydrogenation of the ∆5 double bond to give 5β(H) stereoisomers. Similarly, 12 \ncholesterol is converted in the gut of higher mammals to coprostanol via various 13 \nintermediates by oxidation of the OH group at the C-3 position (Bull et al., 2002). Once in the 14 \naquatic or terrestrial environment compounds such as coprostanol can undergo further 15 \nmicrobial reduction to yield the product epicoprostanol (Bull et al., 2002).  16 \n 17 \nThe Attenborough Ponds Nature Reserve (52º 53’58’’N, 1º 14’09’’W) is located within the 18 \nconurbation of Nottingham, UK, and is designated a site of special scientific interest (SSSI) 19 \nprimarily because of the wide diversity of birds.  The ponds are a series of ex-gravel pits 20 \ncovering an area of about 1.67 km2 located on the floodplain of the River Trent. Excavation 21 \nof Church Pond occurred from 1962-1965, Coneries Pond 1966-1968 and Clifton Pond 1964-22 \n68.  Their location, similar size (0.49 to 0.1 km2), depth (~3m) and mode of formation make 23 \nthem ideally suited to ecosystem-scale comparisons.  The ponds (including Church, Clifton 24 \n4 \n \nand Coneries Ponds) have varying histories of connectivity to the polluted Erewash, which 1 \ndrains a heavily urbanised catchment and receives effluent from seven sewage treatment 2 \nplants. The first discharge information for the sewage treatment works were issued between 3 \n1981 and 1990 (Severn Trent Water, unpublished.). Methods of sewage treatment for works 4 \ndischarging into the river prior to this time are unavailable. In 1972, the course of the 5 \nErewash was diverted directly into Coneries Pond, which was at that time hydrologically 6 \nconnected to Church and Clifton Pond during periods of high water level. In 1981, 7 \nengineering works isolated Clifton from Coneries Pond, resulting in the system that exists 8 \ntoday where Church and Clifton Pond are isolated from the Erewash and Coneries Pond 9 \nsystem in all but the most extreme flood events.  Consequently Coneries waters are enriched 10 \nin total P (TP; 540 µg\/L) and total dissolved inorganic nitrogen (TDIN; 6 mg\/L) and are 11 \nturbid whereas Clifton (TP 73 µg\/L, TDIN 0.2 mg\/L), and Church (TP 184 µg\/L, TDIN 0.2 12 \nmg\/L) have much lower nutrient concentrations and clear water (mean concentrations 13 \nbetween 2005-2008) (Cross, 2009). 14 \n 15 \nThe objectives of this work were three fold: (i) Identify the main sources of organic matter 16 \nentering the Ponds; (ii) Establish whether Coneries, Church and Clifton Ponds had received 17 \nthe same amounts of faecal organic matter through time; and (iii) ascertain using sterol 18 \nbiomarker whether the source(s) of faecal organic matter had changed. 19 \n 20 \n2. Sampling and methods  21 \n 22 \n2.1 Sample Collection 23 \n 24 \n5 \n \nSediment cores were collected on 22 and 23rd May 2007 from Church Pond (SK 51600, 1 \n34150), Clifton Pond (SK 52300, 33697) and Coneries Pond (SK  51234, 33856) (Fig. 1).  2 \nThe deepest part of the lake was located for coring using a handheld echo sounder and 3 \nposition marked using a Garmin 12 GPS system. Cores were sampled using a wide-diameter 4 \n(14 cm i.d.) Livingstone type corer specially designed for the retrieval of large volumes of 5 \nsediment.  The core tube was pushed into the sediment until an impenetrable layer (basal 6 \ngravel and sands) assumed to mark the inception of the lakes was reached. After each 7 \nsuccessful deployment-retrieval cycle the core was transported back to shore, whereupon the 8 \ncore was extruded and sampled every 1 cm for coliform counting and every 2 cm for 9 \nelemental and isotopic analyses. Sub-samples for faecal sterol and stanol concentrations were 10 \ncollected  at 4 cm resolution  (~10 g wet\/wt) and were stored in polyethylene bags and 11 \ntransported back to the laboratory at ~4 ºC, then immediately frozen (–70 °C). Aside from the 12 \nbasal gravel\/ sand layer none of the cores showed a clear sediment stratigraphy being 13 \ncomprised of a homogeneous mixture of dark organic rich silty clay.    14 \n 15 \n2.2 210Pb and 137Cs Chronology 16 \n 17 \nDried sediment samples from cores taken from Church Pond and Clifton Pond were analysed 18 \nfor 210Pb, 226Ra, 137Cs and 241Am by direct gamma assay in the Bloomsbury Environmental 19 \nIsotope Facility (BEIF) at University College London, using ORTEC HPGe GWL series 20 \nwell-type coaxial low background intrinsic germanium detector (Appleby et al., 1986). Lead-21 \n210 was determined via its gamma emissions at 46.5keV, and 226Ra by the 295keV and 22 \n352keV gamma rays emitted by its daughter isotope 214Pb following 3 weeks storage in 23 \nsealed containers to allow radioactive equilibration. Cesium-137 and 241Am were measured 24 \n6 \n \nby their emissions at 662kev and 59.5kev (Appleby et al., 1986). The absolute efficiencies of 1 \nthe detector were determined using calibrated sources and sediment samples of known 2 \nactivity. Corrections were made for the effect of self absorption of low energy gamma rays 3 \nwithin the sample (Appleby et al., 1992).  4 \n 5 \n2.3 %TOC, C\/N, carbon and nitrogen isotope ratios 6 \n 7 \nTotal organic carbon and nitrogen from which we derive weight C\/N ratios were analysed 8 \nalongside carbon (δ13C) and nitrogen (δ15N) isotope ratios.  %C, %N and δ13C were measured 9 \non homogenized, acid-washed sediment while the δ15N was measured on raw homogenized 10 \nsediment. 13C\/12C analyses were performed by combustion in a Costech Elemental Analyser 11 \n(EA) on-line to a VG TripleTrap and Optima dual-inlet mass spectrometer, with δ13C values 12 \ncalculated to the VPDB scale using within-run laboratory standards calibrated against NBS-13 \n18, NBS-19 and checked using NBS-22. Replicate analysis of well-mixed samples indicated 14 \na precision of + <0.1‰ (1 SD). %TOC and C\/N ratios were calibrated against an Acetanilide 15 \nstandard, with a precision of + <0.1 for C\/N. All C and N values in this current work are 16 \nexpressed on a weight ratio basis. 15N\/14N analysis was performed on a ThermoFinnigan 17 \nsystem comprising an elemental analyser linked under continuous flow with a Delta+XL 18 \nmass spectrometer. Isotope ratios were calculated as δ15N versus atmospheric N2 by 19 \ncomparison with standards calibrated against IAEA N-1 and N-2. Analytical precision (1 20 \nS.D.) is typically <0.3‰. 21 \n 22 \n2.4 Coliforms 23 \n 24 \n7 \n \nIn the laboratory two grams of sub-sample was transferred to a sterile universal container 1 \nusing aseptic technique. To each sub-sample 20 ml of sterile demineralised water was added 2 \nand the contents centrifuged at 750 g for 10 minutes to disassociate bacterial cells from 3 \nsediment samples (Furtado and Casper, 2000). The supernatant was then removed and used 4 \nfor microbial inoculations. The method used for enumeration studies was based on the 5 \nstandard method of membrane filtration (MF). The supernatant was filtered through a 0.45 6 \nµm cellulose nitrate filter (Gelman). Each filter was then placed onto a petri dish containing a 7 \npad saturated with Membrane Lauryl Tryptose Broth (Oxoid). The dishes were incubated for 8 \n24 hours at 35 ºC. Yellow colonies of between 1 mm and 3 mm were counted as presumptive 9 \ncoliform bacteria (total coliforms). 10 \n 11 \n2.5 Faecal Steroid Preparation 12 \n 13 \nSediments were freeze-dried, sieved through a mesh aperture of 2 mm and ground to a fine 14 \npowder in a ball mill (Retsch PM400).  A 4-5 g aliquot of each powdered sediment was 15 \nplaced on a watch-glass and spiked with deuterated cholesterol (cholesterol-2,2,3,4,4,6-d6) 16 \nstandard in toluene (5 ng\/µl) (Sigma Chemical Co.). Thereafter, sediments were extracted 17 \nwith methanol\/dichloromethane (MeOH\/DCM) (1:1 v\/v) using an accelerated solvent 18 \nextraction system ASE 200 (Dionex) operated at a temperature of 100 °C and a pressure of 19 \n1500 psi. Activated copper powder (2 g) was added to remove elemental sulphur. The solvent 20 \nwas removed by evaporation using a turbovap system. The residue was reconstituted in 1 ml 21 \nacetone, then transferred onto the surface of a silica gel column containing 5% H2O 22 \ndeactivated silica (100-200 mesh) using a glass pipette. The silica column (1 × 9 cm) was 23 \nfirst eluted with 20 ml hexane\/DCM (3:1 v\/v) then 40 ml DCM and finally with 30 ml 24 \n8 \n \nacetone\/DCM (3:7 v\/v). The latter two fractions were combined, the solvent evaporated under 1 \na gentle stream of N2 and the residue dissolved in 0.5 ml acetone prior to quantitative transfer 2 \nto a glass vial (1.75 ml). Acetone was removed by evaporation with N2 and the sample 3 \nreconstituted in 0.9 ml of pyridine to which perylene-d12 extraction efficiency standard in 4 \ntoluene was added. Prior to analysis, mixtures were silylated by heating in an oven at 50°C 5 \nfor 30 min with 50 µl of N, O bis (trimethylsilyl)trifluoroacetamide (BSTFA) with 1% TMCS  6 \n(Sigma Chemical Co.) . 7 \n 8 \n2.6 Gas Chromatography-Mass Spectrometry 9 \n 10 \nFaecal sterols were analysed using a Varian CP3800 series gas chromatograph (GC) directly 11 \ncoupled with a Varian 1200L triple Quadropole MS\/MS system (GC\/MS). Sample injection 12 \n(1.0 µl) was in splitless mode. Compounds were separated using a Varian Factor 4 VF-5MS 13 \ncolumn (30 m length × 0.25 mm i.d. × 0.25 µl film thickness). The oven temperature was 14 \nprogrammed from 60 °C (1 min isothermal) to 250 °C at 20 °C min-1 then to 310 °C at 4 °C 15 \nmin-1 and held isothermally at 310 °C for 10 min. The mass spectrometer was operated at 70 16 \neV with a mass range of m\/z 30-550 (beam current 150 µA, source temperature 150 °C) with 17 \nhelium as carrier gas at a flow rate of 1 ml\/min. Data acquisition was carried out using a 18 \nVarian MS workstation v6.5. Peak assignments were made by comparison with published 19 \nmass spectra and mass spectra and retention times of authentic standard compounds 20 \n(Appendix 1). The limit of quantification for individual compounds ranged from 0.01-0.04 21 \nµg\/g (dry wt), procedural blanks as well as reagent blanks contained no significant amounts 22 \nof sterols.     23 \n 24 \n9 \n \n2.7 Faecal Biomarker Nomenclature 1 \n 2 \nCommon compound names were used throughout this work to enable comparison with 3 \nprevious studies. The eleven faecal sterols measured were cholestane (5α-cholestane), 4 \ncoprostanol (5β-cholestan-3β-ol), 5β-epicoprostanol (5β-cholestan-3α-ol), cholesterol 5 \n(cholest-5-en-3β-ol), 5α-cholestanol (5α-cholestan-3β-ol), coprostan-3-one (5β-cholestan-3-6 \none), campesterol (24α-methyl-5-cholesten-3β-ol), stigmasterol (3β-hydroxy-24-ethyl-5,22-7 \ncholestadiene), fucosterol ((3β,24E)-stigmasta-5,24(28)-dien-3-ol),  β-sitosterol (24-8 \nethylcholest-5-en-3β-ol) and 5β-stigmastanol (24α-ethyl-5α-cholestan-3β-ol); chemical 9 \nstructures are presented in Appendix 1. 10 \n 11 \n2.8 Statistical Analyses 12 \n 13 \nMulti-variate ordination techniques were carried out using the vegan package in R (Oksanen 14 \net al., 2010; R Development Core Team, 2010) to explore the dominant patterns and inter-15 \nrelationships in the sterol data. Following Detrended Correspondence Analysis (DCA), which 16 \nindicated a linear response, Principal Component Analysis (PCA) was carried out to assess 17 \nthe main gradients of variation at each of the three sites. All data were down-weighted to 18 \nreduce the influence of abundance sterols on the ordination outputs with samples containing 19 \nno measureable sterol concentrations removed from the dataset. Sample depth 62 cm at 20 \nChurch Pond was also removed as an outlier in the ordination analyses, due to the high 21 \namount of coprostanol within the sample. 22 \n 23 \n10 \n \n3. Results and Discussion 1 \n 2 \n3.1 Lead-210 activity and artificial fallout radionuclides 3 \n 4 \nCores from Church and Clifton were first assessed using 137Cs radionuclide and 210Pb activity 5 \nin order to develop a sediment chronology (Figs. 2 and 3). Lead-210 (half-life is 22.3 year) is 6 \na naturally-produced radionuclide, derived from atmospheric fallout (termed unsupported 7 \n210Pb). Caesium-137 (half-life is 30 years) and 241Am are artificially produced radionuclides, 8 \nintroduced to the study area by atmospheric fallout from nuclear weapons testing deposition 9 \n(maximal ~1963) and nuclear reactor accidents (e.g. Chernobyl, Ukraine 1986). They have 10 \nbeen extensively used in the dating of recent sediment in lakes and estuaries (Appleby, 2001; 11 \nVane et al., 2009).  12 \n 13 \nThe 137Cs activity versus depth profile for Church Pond reveals a broad peak between 20 and 14 \n44 cm, suggesting 1963 occurs between these depths (Fig. 2). Unsupported 210Pb activity, 15 \ncalculated by subtracting 226Ra activity from total 210Pb activity, declines more or less 16 \nexponentially with depth in the top 20 cm (Fig. 2). Deeper than 20 cm, unsupported 210Pb 17 \nactivities show non-monotonic features, with relatively low unsupported 210Pb at 29.5 cm.  18 \nThe inventory of unsupported 210Pb yields a mean unsupported 210Pb flux to the sediments at 19 \n137 Bq m-2 yr-1, which is at a similar level of deposition in the region. Lead-210 chronologies 20 \nwere calculated using the CRS dating model (Appleby and Oldfield, 1978). The raw CRS 21 \ndating model places the 1963 layer at 40 cm, which is in between 20 and 44 cm suggested by 22 \nthe 137Cs record.  The average sedimentation rate of the core was about 0.28 g cm-2 yr-1. 23 \nSedimentation rates calculated by unsupported 210Pb data were relatively uniform but with a 24 \nsharp peak, suggesting rapid accumulation in the late 1970s and may represent disturbance of 25 \n11 \n \nlake bed material associated with blockage of the lake from the Coneries chain ca. 1980.    1 \nPrior to isolation, variable river flows would have resulted in high sedimentation rates and a 2 \ngreater degree of sediment disturbance. Once isolated, the monotonic decline in Pb-210 3 \nactivity is consistent with a more stable depositional environment. Historical records date the 4 \ntime of last gravel extraction and presumably the on-set of sedimentation in Church Pond at 5 \n1964 and in 1967 at Clifton Pond.   6 \n 7 \nThe Clifton Pond 137Cs profile is poorly defined (Fig. 3) and consequently radionuclide 8 \ndepositional events such as Chernobyl and maximal emissions from atomic weapons testing 9 \nare not identifiable. The relatively constant 137Cs activities below 19 cm may be due to 10 \nvariable deposition of material transported into the lake while it was connected to the main 11 \nlake chain.  There is an irregular decline in unsupported 210Pb in the top 20 cm of the core, 12 \nbut little net decline in unsupported 210Pb activities below this with low unsupported 210Pb 13 \nactivities suggesting relatively high and variable sedimentation rates, with sediment 14 \ndisturbance. Mean unsupported 210Pb flux to the sediments was calculated at 148 Bq m-2 yr-1. 15 \n210Pb chronologies were calculated using the CRS dating model. Mean sedimentation rate 16 \nwas about 0.29 g cm-2 yr-1 and was higher between the 1960s and 1980s. The 210Pb profile is 17 \nconsistent with greater disturbance below ca. 20cm core depth (1980s), suggesting that the 18 \nisolation of Clifton Pond in 1981 resulted in more uniform sediment deposition and less 19 \nsediment disturbance (Sayer and Roberts, 2001).  As for Church Pond, the lake inception date 20 \nof 1964 would infer more rapid sedimentation in the lower part of the core than calculated by 21 \nthe CRS model.  22 \n 23 \n3.2 %TOC, C\/N and carbon isotope ratios 24 \n12 \n \n 1 \nThese data are presented in Figure 4. Downcore %TOC profiles for the three ponds show a 2 \nsystematic decrease in organic carbon content from the surface to the base (approximately 75 3 \ncm). The organic carbon contents range from ca. 2 to 6% in Coneries, 2 to 5% in Church, and 4 \n4 to 5% in Clifton. These concentrations are fairly typical of modern shallow lakes located in 5 \na peri-urban environment accumulating decaying vegetation from a variety of sources, as 6 \nwell as atmospheric and waterborne anthropogenic pollution. C\/N ratios are widely used as 7 \nsource indicators for organic matter (Meyers, 1997)  and tend to range 3-9 (in aquatic; protein 8 \nrich plants), 10-20 (in aquatic\/terrestrial plants) and > 20 (in terrestrial biomass; protein poor 9 \nplants) and are thus used as an indicator of changes in allochthonous and autochthonous 10 \norganic matter in freshwater systems (Meyers and Teranes, 2001). In the Attenborough 11 \nPonds, C\/N ratios are fairly constant at between 8-10; values which tend to be indicative 12 \norganic matter of aquatic origin. From the work of (Cross, 2009) this most likely represents 13 \nphytoplankton (Aulacoseira, Asterionella,  Synedra), cryptophyceae (Cryptomonas, 14 \nRhodomonas), and chlorophyceae (Ankyra, Chalmydomonas, Tetradon, Tetrastrum). Cross 15 \n(2009) reported elevated concentrations of the latter class of green algae, ranging from 73 16 \nµg\/L in Coneries Pond to 13 µg\/L in Clifton Pond. 17 \n 18 \nMost types of algae produce organic matter with δ13C values about 20‰ lower than the value 19 \nfor dissolved bicarbonate (HCO3-), the main reservoir of inorganic carbon (Leng et al., 2005). 20 \nOn this basis the δ13C values of –29 to –25‰ typical of the ponds’ sediments would suggest a 21 \nbicarbonate source with δ13Cbicarbonate within the range –9 to –5‰; values that are higher than 22 \nthose typical of UK groundwaters (Andrews et al., 1993; Andrews et al., 1997), suggesting an 23 \nadditional source of inorganic carbon (e.g. atmospheric CO2, through long residence time, or 24 \ncarbonate from limestone aquifers). δ13Cbicarbonate values will also be influenced by organic 25 \n13 \n \nproductivity, with values increasing with production as the lighter isotopes are utilised by the 1 \nalgae and incorporated into the organic sediment. A reduction in the proportion of additional 2 \nsources of inorganic carbon, or a decrease in productivity are therefore some of the factors 3 \nwhich might cause changes in the ponds’ organic δ13C values (Leng et al., 2005). The upward 4 \ndecrease in core δ13C values might for example reflect reduced limestone influence with the 5 \ncessation of quarrying, or changes in nutrient inputs with changes in sewage management. 6 \n 7 \n3.3 Nitrogen isotope ratios 8 \nIn common with carbon, the isotope composition of sources of nitrogen and factors 9 \ninfluencing productivity are amongst the most important controls on the δ15N values of 10 \norganic matter depositing to sediment in these shallow, well-mixed lakes (Leng et al., 2005). 11 \nA comparison of the up-core changes in δ15N and δ13C values in fact reveals some co-12 \nincidence: the largest changes for both values are observed for Coneries between 70 to 60 cm 13 \ndepth, and for Church between 50 to 0 cm depth. However, the fact that the changes are in 14 \nthe opposite direction (δ15N increasing and δ13C decreasing upwards) tends to argue against a 15 \nchange in organic productivity as the dominant cause. We therefore consider the potential 16 \nsources of N. 17 \nSewage is clearly a major potential source of nutrient N in some of the Attenborough ponds. 18 \nIn many cases it has high δ15N values, above +10‰ (Heaton, 1986; Kendall et al., 2007), and 19 \nthis is confirmed for our study by a single analysis of Erewash river nitrate from close to the 20 \nToton sewage works in April 2007, which gave a δ15N value of +14.2‰. In contrast, most 21 \nother sources of  N (atmospheric deposition, fertilisers, soils, etc.) tend to have δ15N values 22 \nwell below +10‰ (Heaton, 1986; Kendall et al., 2007), and where N-fixing cyanobacteria 23 \ncontribute to sediment (as they may do in Church and Clifton Ponds (Cross, 2009)), this will 24 \n14 \n \nalso reduce δ15N values. Sediments in lakes in remote regions of the UK, for example, 1 \ntypically have δ15N values below +5‰ (Jones et al., 2004). In simple source terms we would 2 \ntherefore expect δ15N values to be most affected by the relative proportions of sewage and 3 \nnon-sewage inputs of N to the different ponds; and increases in macrophyte δ15N in response 4 \nto increased sewage inputs have been well documented elsewhere (Cole et al., 2004). 5 \nIt is therefore perhaps surprising that the δ15N values of recent sediments in the Church, 6 \nClifton and Coneries Ponds are so similar: the uppermost sections of the cores all have δ15N 7 \nvalues between +10 to +12‰ (Figure 4), and sediment traps have also yielded δ15N values 8 \nabove +10‰ for all three ponds. These values may be expected for Coneries Pond, which is 9 \ndirectly supplied by the Erewash. The fact that Church and Clifton Ponds have similarly high 10 \nδ15N values suggests that they may also derive much of their nutrient N from a similar 11 \nsewage source, albeit at a lower concentration. This could occur as leakage of Erewash water 12 \nthrough the gravel banks surrounding Church and Clifton Ponds. 13 \n 14 \n3.4  Coliform counts 15 \n 16 \nTotal coliform counts in sediment cores from Clifton, Church and Coneries Ponds are 17 \npresented in Figure 5. Bacterial coliform numbers were highest between 0-10 cm for all three 18 \ncores and no coliforms were detected at depths >64 cm at any of the sites. Coliform numbers 19 \nin Church and Coneries were maximal at ∼400 colony forming units (CFU)\/g sediment, 20 \nwhereas the coliform counts for Church remained at <200 CFU\/g sediment throughout (Fig. 21 \n5). Comparison of the depth profiles reveals that Clifton and Church were somewhat similar, 22 \nwith the greatest coliform numbers just beneath the sediment surface and no detectable 23 \ncoliforms observed between 30-40 cm and 50-60 cm. In contrast, relatively high numbers of 24 \n15 \n \ncoliforms were detected between 20-30 cm and 30-40 cm as well as 50-60 cm at Coneries 1 \n(Fig. 5). Research on faecal coliforms in sediments and waters has shown extended survival 2 \nin the former due in part to factors such as organic matter content and sorption which 3 \nprovides protection against bacteriophage (Burton et al., 1987; Stenstrom and Carlander, 4 \n2001). However, survival of viable enteric bacteria (Pseudomnas aeruginosa, Salmonella 5 \nNewport, Escherichia coli and Klebsiella pneumoniae) in two lake and two river sediments in 6 \nUSA extended to no more than a few months (Burton et al., 1987). Similarly, T50- values of 7 \nE. coli, faecal enterococci, Clostridium and coliphages in constructed wetland sediments 8 \nranged from 27-370 days (Stenstrom and Carlander, 2001). Sediments act as a reservoir for 9 \nbacteria and can via the mechanism of sediment re-suspension contribute to bacterial 10 \nnumbers in overlying surface waters (Obiri-Danso and Jones, 2000). In light that indictor 11 \norganism tests such as total coliform counting require viable bacteria, and that the literature 12 \nsuggest that these are not particularly long lived, it is not unexpected that the highest number 13 \nof coliforms were observed in the uppermost interval of the sediment cores. The frequent 14 \noccurrence of detectable coliforms down core at Coneries maybe attributed to the combined 15 \neffect of either: Coneries receiving a greater amount and more regular supply of faecal matter 16 \nthan either Clifton or Church; or bioturbation of the sediment column.  17 \n 18 \n3.5 Sterol and Stanol Concentrations 19 \n 20 \nTotal sterol concentrations decrease down profile in all three shallow lake sediment cores. 21 \nChurch and Clifton are broadly similar, with the highest values observed at the surface (0-4 22 \ncm) and a gradual fall in sterol concentration to <10 µg\/g at 12-16 cm (Fig. 6). Small changes 23 \nin sterol concentrations occur from 12-16 to 56-60 cm and an increase in sterol values occurs 24 \nin Clifton at 58-68 cm and Church at 60-64 cm (Fig. 6).  In contrast, Coneries total sterol 25 \n16 \n \ndepth-profile shows higher concentrations in the range of 20 to 30 µg\/g at the surface to 36-1 \n40 cm depth; thereafter, there is a progressive decrease in concentrations to the base of the 2 \ncore at 74 cm. 3 \n 4 \nTen of the eleven individual sterols were observed in this study; the compound 5α-cholestane 5 \nwas not detected in any of the sediments. As expected cholesterol is the most abundant sterol 6 \nin the surface sediments at Coneries with concentrations in the range of 4.1 to 8.5 µg\/g 7 \nwhereas, β-sitosterol is the principal sterol at the surface in Church and Clifton with 8 \nconcentrations in the range of 6.5 and 16.1 µg\/g (Fig. 6). β-sitosterol is known to be derived 9 \nfrom vascular plants and together with cholesterol, stigmasterol and campesterol are the main 10 \nsterols which undergo reduction by enteric bacteria to yield 5β-stanols (Leeming et al., 1996).  11 \nThe greater concentration of β-sitosterol in the surface sediment at Church and Clifton as 12 \ncompared to Coneries may be due to the diverse range of aquatic plants whereas Coneries is 13 \ndevoid of aquatic plants. However, sterols from avian faeces are reported to be mainly 14 \ncomprised of β-sitosterol with lower amounts of  cholesterol as well as 24-15 \nethylepicoprostanol and trace quantities of other sterols (Shah et al., 2007). Therefore, the 16 \npredominance of β-sitosterol in the surface sediments at Clifton and Church could be due to 17 \ndirect input from higher plants or possibly  from the accumulation of avian derived faecal 18 \nmatter or a combination of the two. The latter multiple-source explanation is probably most 19 \nplausible because Attenborough Ponds is an important wildlife refuge for ~80 species of 20 \nbirds and the shallow gravel-pit lakes are vegetated with Phragmites communis (Reed) Typha 21 \nlatifolia (Bull-rush) and Spargamium erectum (Bur-reed) and the banks are populated with 22 \nwillow, ash and alder trees. Although this supposition appears to contradict the TOC, C\/N 23 \nand δ13C interpretation  (section 3.2) which suggests that all three ponds mainly accumulated 24 \norganic carbon from algal sources, it should be borne in mind that molecular biomarkers 25 \n17 \n \nincluding sterols presented herein only represent a small fraction of the bulk organic matter 1 \nthat maybe undetected in the bulk measurements. 2 \n 3 \nA different situation occurs in Coneries Pond where 5β-stigmastanol is present at relatively 4 \nhigh concentrations of up to 14.5 µg\/g at 32-36 cm depth (Fig. 6). Previous studies have 5 \nreported that 5β-stigmastanol is derived from the intestinal microbial reduction of the plant 6 \nderived marker sitosterol (Grimalt et al., 1990). Therefore, the presence of 5β-stigmastanol at 7 \nelevated concentrations relative to other sterols could indicate faecal matter from herbivorous 8 \nanimals and, particularly, ruminant animals such as cows and sheep. Within Coneries Pond, 9 \nthe high proportion of 5β-stigmastanol relative to other sterol markers in the mid-portion of 10 \nthe core profile suggests a possible manure\/slurry input and that the accumulation had 11 \nrecently decreased as evidenced by the decline in 5β-stigmastanol values at the near surface 12 \n<10 cm (Fig. 6). Clear evidence that Coneries has also received input from plant matter is 13 \nsuggested by the presence of another sterol plant marker, campesterol, at concentrations up to 14 \n3.5 µg\/g in 12 out of 18 sediment levels analysed (Reeves and Patton, 2005). The absence of 15 \naquatic plants in Coneries Pond confirm the notion that plant derived matter and associated 16 \nsterols have been washed into the shallow lake. Comparison of the Clifton total sterol and 5β-17 \nstigmastanol profiles show a clear co-variance which suggests that the small increase in total 18 \nsterol values at 58 cm depth was probably due to input of herbivore faecal matter. 19 \n 20 \n Concentrations of coprostanol in the samples from Coneries range from 2.2 at surface to 0.04 21 \nµg\/g (dry wt) at a depth of 70 cm with an average of 0.64 µg\/g (Fig. 6). In contrast, 22 \ncoprostanol concentrations are low and declined rapidly at Church and Clifton with the 23 \nexception of a single coprostanol peak at a depth of 62 cm in Church. In general, sediments 24 \nwith coprostanol concentrations of 0.5 µg\/g are considered to have received appreciable 25 \n18 \n \namounts of sewage pollution (Readman et al., 2005). Thus, using this criteria, almost the 1 \nentire Coneries core is polluted with sewage, Church is contaminated at 2 cm and 62 cm 2 \ndepth and Clifton is not polluted, the highest coprostanol concentration being 0.4 µg\/g at 3 \nsurface. This likely reflects the fact that although both Church and Clifton Ponds were 4 \nconnected to the Erewash system prior to 1981, they were less directly connected than 5 \nConeries, which lies directly between the main river inflow and the major outflow. Although 6 \ntreated sewage effluent is discharged into the Erewash in liquid form, the high abundance of 7 \ncoprostanol in Coneries as compared to Church and Clifton supports the view that faecal 8 \nsterols rapidly partition into the solid phase (Mudge and Ball, 2006) and their accumulation is 9 \nthen controlled by fluvial\/lacustrine sedimentation processes.  10 \n 11 \n16B3.3 Application of sewage indicator ratios to source apportionment  12 \n 13 \nThe ratio 5β-coprostanol to total sterol provides one measure of human derived sewage input; 14 \nit has also been demonstrated that human faecal contamination is indicated by 15 \ncoprostanol:cholesterol values >0.2.  Raw untreated sewage typically has a 5β-coprostanol \/ 16 \ncholesterol ratio of ~10, which decreases through a sewage treatment plant (STP) such that in 17 \nthe discharged liquid wastewaters the ratio is approximately 2; undiluted STP wastewaters 18 \nmay be identified by this high ratio. As the faecal matter is dispersed in the environment, the 19 \nratio will decrease as more (non-faecal) cholesterol from animals is encountered (Grimalt and 20 \nAlbaiges, 1990; Grimalt et al., 1990).  In this study, coprostanol was detected in 16 out of 18 21 \nsediment levels in Coneries Pond, ranging from 2.2 ng\/g at the surface to 0.1 ng\/g at a depth 22 \nof 62 cm (Fig. 6). Down core, coprostanol to cholesterol ratios are greater than or equal to the 23 \n0.2 threshold value in 14 of the 18 sediment depth intervals, confirming that Coneries Pond 24 \n19 \n \nhas been subject to human sourced faecal matter which had been treated (Fig. 7). One 1 \nplausible explanation is that the sewage treatment plants on the Erewash had discharged into 2 \nthe river which flows into Coneries Pond. Lower ratios ranging from 0.1 to 1.9 occur in the 3 \nthree levels at the base of the sediment core suggesting lower contribution of sewage sourced 4 \nfaecal matter in the early 1970s. In contrast, sediments from Clifton or Church Ponds gave 5 \ncoprostanol:cholesterol ratios ranging from 0 to < 0.2, which suggests that the sediments have 6 \nnot been subject to a significant amount of human-sourced sewage pollution (Fig. 7). Taken 7 \ntogether this suggests that earth embankments that separate the Ponds (Fig. 1) may act as 8 \nfilters for the particulate organic matter (including sewage).  9 \n 10 \n 11 \nHuman sourced faecal contamination can be tracked in sediments using the proportion of 12 \ncoprostanol:(coprostanol+5α-cholestanol) (Grimalt et al., 1990; Grimalt and Albiages, 1990). 13 \n5α-cholestanol is formed naturally in the environment by bacteria and generally does not 14 \nhave a faecal origin. Sediments with coprostanol:(coprostanol+5α-cholestanol) values > 0.7 15 \nare considered contaminated with human faecal matter whereas those with values < 0.3 are 16 \ncategorised as uncontaminated. Sediments with ratios between these criteria can not be 17 \nreadily apportioned on the basis of this ratio alone. In this work, Coneries sediments at 54, 18 \n62, 66 and 70 cm depth gave ratios of 1.0 because no 5α-cholestanol was detected; at 19 \nshallower depths, ratios varied in a non-systematic manner from 0.1 to 0.34 (Fig. 7). 20 \nExamination of the Clifton coprostanol:(coprostanol+5α-cholestanol) profile showed low 21 \nvalues indicating minimal human faecal pollution and similarly Church yielded ratios of 22 \nbetween 0 to <0.3 with the exception of  62 cm depth which gave a value of 1.0 (Fig. 7).  23 \nDuring sewage treatment, 5β-coprostanol may be converted to the 5β-cholestan-3α-ol form, 24 \nepicoprostanol, and there is also a slow conversion of 5β-coprostanol to epi-coprostanol in 25 \n20 \n \nthe environment and so this ratio will indicate either the degree of treatment of sewage or its 1 \nage in the environment (Mudge and Ball, 2006). In the current study Coneries 5β-coprostanol 2 \nto epicoprostanol ratio varied from 0.2 to 0.6 and Clifton gave ratios of 1.1 and 0.6 at 2 and 6 3 \ncm depth respectively (Fig. 7). A cross-plot of the 5β-coprostanol \/ cholesterol ratio against 4 \nthe epi-coprostanol \/ 5β-coprostanol ratio can indicate both faecal contamination and 5 \ntreatment (Fig. 8). The sediments from Church and Clifton Pond indicate little sewage input 6 \nand \/ or a high degree of treatment whereas sediments from Coneries Pond plot in an area 7 \nindicative of greater sewage input. 8 \n 9 \nIt has been previously reported that in sediments, bacteria preferentially produce 5α-10 \ncholestan-3β-ol (5α-cholestanol) from cholesterol rather than the 5β isomer (Bull et al., 2003; 11 \nBull et al., 2002). This reaction occurs principally in anaerobic reducing sediments and the 12 \n5α-cholestanol \/ cholesterol ratio may be used as a secondary (process) biomarker for such 13 \nconditions. No cut-off values have been suggested for this marker and so it is used in a 14 \nrelative sense; the greater the ratio, the more reducing the environment.  The 5α-cholestanol \/ 15 \ncholesterol vertical profiles are presented in Figure 9. Clifton sediments show a rather 16 \nconstant value of ~1, Church sediments were maximal at 2.8, whereas Coneries values range 17 \nfrom 0.5 to 6.1 indicating a possibly more reducing environment at 20 to 50 cm (Fig. 9). It is 18 \nalso plausible that the rise in 5α-cholestanol \/ cholesterol ratios between 50 to 25 cm depth in 19 \nConeries could be related to changing redox conditions in the sedimentary column and or 20 \nvarying sewage treatment practices such as the introduction of filter beds and activated 21 \nsludge plants. 22 \n 23 \n3.3 Principal component analysis 24 \n21 \n \nPCA indicates that a single variable at each lake is dominating the main patterns of 1 \nvariability in the sterol data with the first axis explaining 82.5%, 71.0% and 67.7% of the 2 \nvariability for Clifton, Church and Coneries Pond respectively (Figs. 10-11). Combining the 3 \ndatasets together indicates that that this variable is constant across all sites (PCA axis 1 4 \neigenvalue = 0.613) and when combining sites individually (Fig. 10 Clifton and Church). 5 \nThe first axis is dominated by sterol characteristic of faecal matter such as β-sitosterol and 6 \nand the by product of sewage treatment epicoprostanol. 7 \n 8 \nThe presence of faecal sterols strongly aligned to the first PCA axis that are representative of 9 \nincreasing faecal matter content suggests that the first PCA axis represents a sewage gradient, 10 \nreinforcing our interpretation that the three lakes have been strongly dominated by changes in 11 \ninflux over their history. The observation that the uppermost samples in each lake are 12 \nincreasing aligned and to the right of PCA axis 1 (increasing faecal matter input) further 13 \nsuggest that inputs have significant increased in recent time. Conversely, the cluster of 14 \nsample depth below c. 30 cm to the centre and left of the axis suggest that another unknown 15 \nvariable is controlling sterol input. 16 \n 17 \n4. Conclusions 18 \n 19 \nThe application of bulk geochemical and isotopic (TOC, C\/N, δ13C, δ15N), total coliforms and 20 \neleven faecal sterol biomarkers in sediment cores from three shallow lakes have proved 21 \nuseful for several reasons.  22 \n 23 \n1) In a system of ponds where some are supposedly isolated the δ13C and δ15N show 24 \nsignificant inter-lake consistency. Taken together, C\/N and δ13C values indicate that 25 \n22 \n \nthe main source of organic matter in the sediments was of algal origin possibly 1 \naugmented by minor contributions of vegetation and that the productivity of the lakes 2 \nvaried temporally. One plausible explanation is that the changes in productivity were 3 \ndriven by improvements in sewage treatment works (which remove nutrients other 4 \nthan N, utilised by phytoplankton) located upstream of the ponds and nitrate pollution 5 \ndoes not decrease with time. δ15N values of up to +12‰ suggest that Coneries Pond 6 \nreceived a greater amount of sewage pollution than the other ponds. The relatively 7 \nelevated δ15N of +10‰ at Church and Clifton implies that they also receive treated 8 \nsewage effluent from the Erewash and connected Coneries Pond. 9 \n 10 \n2)  Molecular level characterisation of sterol and stanol content of sediment cores from 11 \nthree shallow peri-urban lakes (ex-gravel pits) reveal that Coneries Pond had received 12 \na greater input of sewage than Church or Clifton Ponds. Using the coprostanol \/ 13 \ncholesterol criteria of >0.2 to indicate sewage pollution it is possible to infer that 14 \nConeries has continually received and accumulated sewage since it’s excavation in 15 \n1968. We hypothesise that the greater amounts of treated human sourced faecal matter 16 \nin Coneries as compared to Church or Clifton is a function of partitioning of faecal 17 \nsterols to the particulate phase and, the sinking of these particulates when the Erewash 18 \ncurrent slows as it enters Coneries Pond.   19 \n 20 \n3) This study also demonstrates the utility of a molecular approach to understanding 21 \nthe shallow lake sediments in that the dominance of β-sitosterol indicated vegetation 22 \nsourced organic matter in Clifton and Church Pond even when bulk geochemical and 23 \nisotope do not. Furthermore, the concentration of specific biomarkers such as 5β-24 \ncoprostanol and ratio of coprostanol to cholesterol ratios clearly distinguish human 25 \nfrom ruminant sources at Coneries Pond. However, application of epicoprostanol to 26 \n23 \n \n5β-coprostanol ratios and 5β-coprostanol to cholesterol values to infer the degree of 1 \ntreatment of sewage or its age in the environment gave results which were ambiguous. 2 \n 3 \nOverall, the extraction and analysis of sewage biomarkers in sediments provides 4 \nenvironmental forensic information that complements bulk geochemical and isotopic data and 5 \nsupplements traditional microbiological methods used in the study of lakes.  6 \n 7 \n4. Acknowledgements 8 \nThe authors would like to thank Dr Thomas Davidson and colleagues of the University 9 \nCollege London for assistance in coring Attenborough Ponds, Iain Cross and Teresa 10 \nNeedham (University of Nottingham) for help with the field and laboratory work, Cemex and 11 \nNottinghamshire Wildlife Trust for permitting access to the site and Sandy Aitken for 12 \nproviding historical information about the formation of the ponds. We are also grateful to 13 \nthree anonymous reviewers for constructive comments.  Severn Trent Water Ltd. provided 14 \ninformation about discharge consents into the River Erewash. The fieldwork was funded by 15 \nthe School of Geography, University of Nottingham. This paper is published by permission 16 \nof the Executive Director, British Geological Survey. 17 \n 18 \n8B5.  References 19 \nAndrews JE, Riding R, Dennis PF. Stable isotopic compositions of recent fresh-water 20 \ncyanobacterial carbonates from the British Isles: local and regional environmental 21 \ncontrols. Sedimentology 1993; 40: 303-314. 22 \nAndrews JE, Riding R, Dennis PF. The stable isotope record of environmental and climatic 23 \nsignals in modern terrestrial microbial carbonates from Europe. Palaeogeography 24 \nPalaeoclimatology Palaeoecology 1997; 129: 171-189. 25 \n24 \n \nAppleby PG. Chronostratigraphic techniques in recent sediments. In: Last WM, Smol JP, 1 \neditors. Tracking environmental change using lake sediments: Basin analysis, coring 2 \nand chronostratigraphic techniques. 1. Kluwer Academic Publishers, Dordrecht, 2001, 3 \npp. 171-203. 4 \nAppleby PG, Nolan PJ, Gifford DW, Godfrey MJ, Oldfield F, Anderson NJ, et al. 210Pb 5 \ndating by low background gamma counting. Hydrobiologia 1986; 143: 21-27. 6 \nAppleby PG, Richardson N, Nolan PJ. Self-absorption corrections for well-type germanium 7 \ndetectors. Nuclear Instruments & Methods in Physics Research Section B-Beam 8 \nInteractions with Materials and Atoms 1992; 71: 228-233. 9 \nBull ID, Elhmmali MM, Roberts DJ, Evershed RP. The application of steroidal biomarkers to 10 \ntrack the abandonmentof a roman wastewater course at the Agora (Athens, Greece). 11 \nArchaeometry 2003; 45: 149-161. 12 \nBull ID, Lockheart MJ, Elhmmali MM, Roberts DJ, Evershed RP. The origin of faeces by 13 \nmeans of biomarker detection. Environment International 2002; 27: 647-654. 14 \nBurton GA, Gunnison D, Lanza GR. Survival of pathogenic bacteria in various freshwater 15 \nsediments Applied and environmental microbiology 1987; 53: 633-638. 16 \nCole ML, Valiela I, Kroeger KD, Tomasky GL, Cebrian J, Wigand C, et al. Assessment of a 17 \n15N isotopic method to indicate anthropogenic eutrophication in aquatic ecosystems. 18 \nJ. Environ. Qual 2004; 33. 19 \nCross ID. The effects of nutrients and hydrology on shallow lake plankton at Attenborough 20 \nnature reserve, Nottinghamshire. Department of Geography, University of 21 \nNottingham. PhD, 2009, pp. 383. 22 \nFurtado ALS, Casper P. Different methods for extracting bacteria from freshwater sediment 23 \nand a simple method to measure bacterial production in sediment samples. Journal of 24 \nMicrobiological Methods 2000; 41: 249-257. 25 \n25 \n \nGrimalt JO, Albaiges J. Characterisation of the depositional environments of the Erbo Delta 1 \n(western Mediterranean) by the study of sedimentary lipid markers Marine Geology 2 \n1990; 95: 207-224. 3 \nGrimalt JO, Fernandez P, Bayona JM, Albaiges J. Assesment of fecal sterols and ketones as 4 \nindicators of urban sewage inputs to coastal waters. Environmental Science & 5 \nTechnology 1990; 24: 357-363. 6 \nHeaton THE. Isotopic studies of nitrogen pollution in the hydrosphere and atmosphere-a 7 \nreview. Chemical Geology 1986; 59: 87-102. 8 \nIsobe KO, Tarao M, Zakaria MP, Chiem NH, Minh LY, Takada H. Quantitative application 9 \nof fecal sterols using gas chromatography -mass spectrometry to investigate fecal 10 \npollution in tropicakl waters:Western Malaysia and Mekong Delta, Vietnam. . 11 \nEnvironmental Science and Technology 2002; 36: 4497-4507. 12 \nJones RI, King L, Dent MM, Maberly SC, Gibson CE. Nitrogen stable isotope ratios in 13 \nsurface sediments, epilithon and macrophytes from upland lakes with differing 14 \nnutrient status. Freshwater Biology 2004; 49: 382-391. 15 \nKendall C, Elliott EM, Wankel SD. Tracing anthropogenic inputs of nitrogen to ecosystems. 16 \nIn: Lajtha RMaK, editor. Stable Isotopes in Ecology and Environmental Science. 17 \nBlackwell Publishing, 2007, pp. 375-449. 18 \nLeeming R, Ball A, Ashbolt N, Nichols P. Using faecal sterols from humans and animals to 19 \ndistinguish faecal pollution in recieving waters. Water Research 1996; 30: 2893-2900. 20 \nLeng MJ, Lamb A.L., Heaton T.H.E., Marshall J.D., Wolfe B.B., Jones M.D, et al. Isotopes 21 \nin lake sediments. . In: Leng MJ, editor. Isotopes in Palaeoenvironmental Research. 22 \nSpringer, Dordrecht, 2005, pp. 148-176 pp. 23 \nMeyers PA. Organic geochemical proxies of paleoceanographic, paleolimnologic, and 24 \npaleoclimatic processes. Organic Geochemistry 1997; 27: 213-250. 25 \n26 \n \nMeyers PA, Teranes JL. Sediment organic matter. In: Last WM, Smol JP, editors. Tracking 1 \nenvironmental change using lake sediments. :Physical and geochemical methods. 2. 2 \nKluwer Academic Publishers, Dordrecht, 2001, pp. 239-269. 3 \nMudge SM, Ball AS. Sewage. In: Morrison RD, Murphey BL, editors. Environmental 4 \nForensics, Contaminant Specific Guide. Elsevier, Amsterdam, 2006, pp. 36-53. 5 \nMudge SM, Bebianno MJAF, East JA, Barreira LA. Sterols in the Ria Formosa lagoon, 6 \nPortugal. Water Research 1999; 33: 1038-1048. 7 \nMudge SM, Duce CE. Identifying the source, transport path and sinks of sewage derived 8 \norganic matter. Environmental Pollution 2005; 136: 209-220. 9 \nObiri-Danso K, Jones K. Intertidal sediments as reservoirs for hippurate negative 10 \ncampylobacters, salmonellae and faecal indicators in three EU recognised bathing 11 \nwaters in North West England. Water Research 2000; 34: 519-527. 12 \nPeng X, Zhang G, Mai B, Hu J, Li K, Wang Z. Tracing anthropogenic contamination in the 13 \nPearl River estuarine and marine environment of South China Sea using sterols and 14 \nother organic molecular markers. Marine Pollution Bulletin 2005; 50: 856-865. 15 \nReadman JW, Fillmann G, Tolosa I, Bartocci J, Mee LD. The use of steroid markers to assess 16 \nsewage contamination of the Black Sea. Marine Pollution Bulletin 2005; 50: 310-318. 17 \nReeves AD, Patton D. Faecal sterols as indicators of sewage contamination in estuarine 18 \nsediments of the Tay Estuary, Scotland:an extended baseline survey Hydrology and 19 \nEarth System Sciences 2005; 9: 81-94. 20 \nSayer CD, Roberts N. Establishing realistic restoration targets for nutrient-enriched shallow 21 \nlakes:linking diatom ecology and palaeoecology at the Attenborough Ponds, U.K. 22 \nHydrobiologia 2001; 448: 117-142. 23 \nSeguel CG, Mudge SM, Salgado C, Toledo M. Tracing Sewage in the Marine Environment: 24 \naltered signatures in Concepcion Bay, Chile. Water Research 2001; 35: 4166-4174. 25 \n27 \n \nShah VG, Hugh Dunstan R, Geary PM, Coombes P, Roberts TK, Von Nagy-Felsobuki E. 1 \nEvaluating potential applications of faecal sterols in distinguishing sources of faecal 2 \ncontamination from mixed faecal samples. Water Research 2007; 41: 3691-3700. 3 \nShah VKG, Dunstan H, Taylor W. An efficient diethyl ether-based soxhlet protocol to 4 \nquantify faecal sterols from catchment waters. Journal of Chromatography A 2006; 5 \n1108: 111-115. 6 \nStenstrom TA, Carlander A. Occurrence and die-off of indictor organisms in the sediment in 7 \ntwo constructed wetlands. Water Science and Technology 2001; 44: 223-30. 8 \nVane CH, Jones DG, Lister TR. Mercury Contamination in Surface Sediments and Sediment 9 \nCores of the Mersey Estuary, UK. Marine Pollution Bulletin 2009; 58: 928-946. 10 \n 11 \n 12 \n 13 \n 14 \n28 \n \n 1 \nFig 1.   The Attenborough Nature Reserve Nottinghamshire, UK containing the Coneries, 2 \nClifton and Church Ponds. 3 \n29 \n \n 1 \nFig 2. Fallout radionuclide concentrations in Church Pond core showing (a) total 210Pb, (b) 2 \nunsupported 210Pb, (c) 137Cs concentrations versus depth, and (d) radiometric chronology  3 \nshowing the CRS model 210Pb dates. 4 \n 5 \n30 \n \n 1 \nFig 3. Fallout radionuclide concentrations in Clifton Pond core showing (a) total 210Pb, (b) 2 \nunsupported 210Pb, (c) 137Cs concentrations versus depth, and (d) radiometric chronology 3 \nshowing the CRS model 210Pb dates. 4 \n 5 \n31 \n \n 1 \n 2 \nFig 4. Comparison of organic carbon (TOC), organic carbon to nitrogen ratios (C\/N), and 3 \norganic δ13C and δ15N values in sediment cores from Attenborough Ponds, Nottinghamshire, 4 \nU.K. 5 \n 6 \n 7 \n 8 \n32 \n \n 1 \nFig 5. Comparison of total coliform counts in sediment cores from Attenborough Ponds, (a) 2 \nConeries Pond, (b) Church Pond and (c) Clifton Pond. 3 \n33 \n \n 1 \nFig 6. Variation in total sterol and faecal sterol concentrations in sediment cores from 2 \nAttenborough Ponds. In general, 5β-sitosterol is derived from plants, 5β-stigmastanol is 3 \nsourced from faecal matter from herbivorous animals and, coprostanol is from human sewage 4 \npollution (See section 3.2 for additional interpretations). 5 \n 6 \n34 \n \n 1 \nFig 7. Ratios of sterol sewage marker compounds in sediment cores from Attenborough 2 \nPonds. Only Coneries Pond shows sustained sewage input. 3 \n 4 \n35 \n \n 1 \nFig 8.  Cross-plot of epi-coprostanol\/5β-coprostanol with 5β-coprostanol\/cholesterol.  2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n 10 \n 11 \n 12 \n 13 \n 14 \n36 \n \n 1 \n 2 \nFig 9. Variation in the ratio of 5α-cholestanol to cholesterol in sediment cores  from 3 \nAttenborough Ponds.  4 \n37 \n \n 1 \nFig 10.  PCA axis one and two biplot for sterol sewage marker compounds Coneries Pond 2 \ncore. 3 \n38 \n \n 1 \nFig 11. PCA axis one and two combined biplot for Clifton and Church Ponds with the 2 \nremoval of the ordination outliner 62 cm at Church. 3 \n 4 \n 5 \n39 \n \n 1 \nAppendix 1. The structure of sterol and stanol sewage markers analysed in this study. 2 \n"}