{"doi":"10.1063\/1.1339999","coreId":"101802","oai":"oai:epubs.surrey.ac.uk:1235","identifiers":["oai:epubs.surrey.ac.uk:1235","10.1063\/1.1339999"],"title":"Conditioning of hydrogenated amorphous carbon thin films for field emission via current stressing","authors":["Carey, JD","Silva, SRP"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2001-01-15","abstract":"<p>The effects of electrical current stressing on the field emission characteristics of hydrogenated amorphous carbon (<i>a<\/i>-C:H) thin films are reported. In these <i>a<\/i>-C:H films an initial conditioning treatment of the film is often required before the onset of stable emission and only after several voltage cycles do the values of the threshold field tend to converge. By stressing of the film by applying a predetermined current through the film, the initial conditioning treatment can be removed and stable and reproducible emission observed. Retesting of the current stressed films shows that the films remain fully conditioned provided a sufficiently high stress current was initially used.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1235<\/identifier><datestamp>\n      2017-10-31T14:01:11Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1235\/<\/dc:relation><dc:title>\n        Conditioning of hydrogenated amorphous carbon thin films for field emission via current stressing<\/dc:title><dc:creator>\n        Carey, JD<\/dc:creator><dc:creator>\n        Silva, SRP<\/dc:creator><dc:description>\n        <p>The effects of electrical current stressing on the field emission characteristics of hydrogenated amorphous carbon (<i>a<\/i>-C:H) thin films are reported. In these <i>a<\/i>-C:H films an initial conditioning treatment of the film is often required before the onset of stable emission and only after several voltage cycles do the values of the threshold field tend to converge. By stressing of the film by applying a predetermined current through the film, the initial conditioning treatment can be removed and stable and reproducible emission observed. Retesting of the current stressed films shows that the films remain fully conditioned provided a sufficiently high stress current was initially used.<\/p><\/dc:description><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        2001-01-15<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1235\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Carey, JD and Silva, SRP  (2001) Conditioning of hydrogenated amorphous carbon thin films for field emission via current stressing   APPLIED PHYSICS LETTERS, 78 (3).  pp. 347-349.      <\/dc:identifier><dc:relation>\n        10.1063\/1.1339999<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1235\/","10.1063\/1.1339999"],"year":2001,"topics":[],"subject":["Article","NonPeerReviewed"],"fullText":" Conditioning of hydrogenated amorphous carbon thin films  \nfor field emission via current stressing \n \nJ.D. Carey a) and S.R.P. Silva \nSchool of Electronic Engineering, Information Technology and Mathematics, \nUniversity of Surrey, Guildford, GU2 7XH, United Kingdom \n \nThe effects of electrical current stressing on the field emission characteristics of hydrogenated \namorphous carbon (a-C:H) thin films are reported. In these a-C:H films an initial conditioning \ntreatment of the film is often required before the onset of stable emission and only after several \nvoltage cycles do the values of the threshold field tend to converge. By stressing of the film by \napplying a pre-determined current through the film, the initial conditioning treatment can be \nremoved and stable and reproducible emission observed. Retesting of the current stressed films \nshows that the films remain fully conditioned provided a sufficiently high stress current was \ninitially used. \n  \n \n \n \n \n \n \n \n \n \n \na)  Electronic mail: David.Carey@surrey.ac.uk  \n  \n \n \nAppl. Phys. Lett. 78, (2001) 347\n 2\nAmorphous carbon (a-C) and its hydrogenated alloy (a-C:H) have been shown to emit electrons \nat relatively low electric fields and thus have potential applications as cold cathode materials.   \n[1, 2]  A-C:H films deposited by r.f. plasma enhanced chemical vapour deposition (PECVD) also \nhave the advantage of being able to be produced over large areas at low temperatures and often \nexhibit rms roughnesses of less than 1 nm. However, in these ‘mirror smooth’ films it has often \nbeen noted that a conditioning or initiation of the film is required before the onset of \nreproducible field emission (FE). [3, 4] This often involves the cycling of the voltage upward \nand downward over 1-2 cycles and is sometimes accompanied by surface damage due to \nmicroarcing. [3] Similar conditioning treatments have also been reported necessary in tetrahedral \namorphous carbon (ta-C) [5, 6] and in diamond films grown by chemical vapour deposition. [7] \nThe exact nature of this conditioning step and the role of the damage-induced surface \nmicroprotrusions is not fully understood though conditioning may involve an increase in the \nconcentration of threefold coordinated carbon atoms at the expense of fourfold coordinated \natoms [8]. For a practical a-C(:H) based display the values of the threshold field (Eth) should be \nas reproducible as possible. Furthermore, to limit the spread in the drive voltages, the hysteresis \nin the current-voltage (I-V) characteristics should be kept to a minimum. In this Letter we report \non the results of current stressing treatments on a-C:H films. By varying the stressing current not \nonly can the need for the initial conditioning treatment be removed but the width of the \nhysteresis present in the I-V characteristic kept to a minimum.      \nFilms were deposited on the water-cooled earthed electrode of a Plasma Technology \nDP800 capacitively coupled r.f. PECVD system onto n-type 1-2 Ω cm Si substrates. Feed gases \nof CH4 (30 sccm) and He (75 sccm) were used. The deposition pressure was 200 mTorr and an \nr.f. power of 200 W was used which resulted in negative dc self bias of about 10 V. These films \nare polymeric in nature with a H content of up to 50 % [9] and a low paramagnetic spin density \nof about 3 x 1017 cm-3. [10]  The film thickness was measured using ellipsometry.   \nAppl. Phys. Lett. 78, (2001) 347\n 3\nThe FE characteristics of the films were examined using a sphere-to-plane geometry with \na 5 mm stainless steel ball bearing suspended 30 µm above the film with a high positive potential \napplied in a vacuum better than 4 x 10-6 mbar. The anode is attached to a Vacuum Generators \nhigh precision translator possessing a 2.5 µm step resolution. Although a spherical anode is used \nit is assumed that the electric field between the anode and the surface of the film can be modelled \nas a parallel plate. The high voltage is stepped up and down four times and the macroscopic \nelectric field is defined as the applied voltage divided by the vacuum separation; Eth is defined as \nthe macroscopic electric field which gives an emission current of 1 nA. It should be noted that in \nimproperly conditioned films there may be significant differences in values of Eth depending on \nwhether the current is read on the upward voltage cycle or on the downward cycle. As a measure \nof this ‘hysteresis effect’ the difference in the applied fields between the upward and downward \nvoltage cycles at a current of 1 nA is used. Current stressing of the films was performed by \ncontacting the anode to the film and passing a current through the film up to a pre-determined \nlevel. Each film was tested before stressing by applying a field of up to 100 V\/µm and only those \nsamples which did not emit after this preliminary test were subject to current stressing. Atomic \nforce microscopy (AFM) imaging was carried out using a Digital Instruments Nanoscope IIIa \nsystem. Atomic force micrographs, not presented here, show that the rms surface roughness of \nthe as-deposited films to be less than 0.4 nm on a 5 µm square scan area. No evidence of surface \nprotrusions was visible and the as-deposited films can be considered as ‘mirror smooth’.  \nFor the current stressing measurements several identical films from the same deposition \nrun were examined. In order to minimise any possible dependence on the film thickness [11], the \nsame film thickness, in this case 57 nm, was used. For reference the typical value of Eth for films \nwhich did emit after conventional conditioning is about 30 V\/µm. The three current stress levels \nchosen were 10-8,  5.2 x 10-8  and 2 x 10-7 A. The FE characteristics of the film stressed to 10-8 A \n(not shown) exhibited emission but with an Eth of over 85 V\/µm and a width of the first cycle \nhysteresis loop of over 20 V\/µm.  Subsequent voltage cycles resulted in a reduction of Eth, \nAppl. Phys. Lett. 78, (2001) 347\n 4\nthough the average threshold field obtained from the latter three cycles was 66 ± 4 V\/µm.  \nStressing to a higher current of 5.2 x 10-8 A results in an initial emission at a field of 48 V\/µm \nthough a hysteresis width of 20 V\/µm, as shown in Fig. 1. The I-V characteristics of the film \nbefore stressing is also presented and shows that no emission had occurred from this film even \nup to fields of 90 V\/µm. The threshold field continues to decrease after subsequent voltage \ncycles and finally reached 40 V\/µm after the 4th cycle. The average value of Eth obtained from \nthis film is 38 ± 10 V\/µm, higher than that obtained from a film which underwent the \nconventional conditioning treatment. It is evident from Fig.1 that since the width of the first \ncycle is 20 V\/µm the film is not fully conditioned.    \nThe I-V characteristic of the film stressed to 2 x 10-7 A is shown in Fig. 2 on the same \nscale as used in Fig. 1. In this case the value of Eth for the 1st cycle was only 34 V\/µm, which \nsubsequently decreased to 30, 26 and 27 V\/µm in the remaining three cycles. The average Eth of \n28 ± 2 V\/µm is comparable to the values of Eth for films which have undergone an conventional \nconditioning treatment. The width of the I-V hysteresis loop was about 2 V\/µm in each run and \nFig. 2 shows no evidence of a conditioning cycle after current stressing. Since the FE \ncharacteristics are different and are observed to improve with higher stress currents, we can \neliminate the mechanical effects of contacting between the anode and film as the primary reason \nfor the improvements. \nAn AFM study of the edge of the stressed area of film stressed to 2 x 10-7 A shows that \nthe surface morphology has altered. An AFM image of the edge of the stressed area of film \nstressed to 2 x 10-7 A is shown in Fig. 3 (a) where three distinct regions, labelled 1, 2 and 3, have \nbeen identified. Region 1 consists of surface protrusions the majority of which are less than 80 \nnm in height and the film possesses an rms roughness of about 44 nm. The surface protrusions of \nregion 3 are less than 120 nm in height and the rms roughness is 105 nm. By contrast the \nprotrusions of region 2 are over 800 nm in height and the roughness is 170 nm. To examine \nAppl. Phys. Lett. 78, (2001) 347\nwhether the protrusions are the source of the emitted electrons we have used the simplified \nFowler-Nordheim (FN) equation to relate the emission current I to the local field βF via \n)exp(\n2\/322\nF\nbFaAI β\nφ\nφ\nβ −= ,      (1) \nwhere a = 1.54 x 10-6 A eV V-2, b = 6.83 x 107 eV-3\/2 V cm-1, A is the emission area, φ is the front \nsurface barrier height (in eV) and β is the field enhancement factor for a field F. Figure 3 (b) \nshows the best fits using Eq. 1 to one of the I-V characteristics of the film stressed to 2 x 10-7 A \nand one of the characteristics of an unstressed but conditioned film. The slopes of the two lines \nare –4.98 x 106 and –3.2 x 106, which for barriers of 4 eV result in values of β of 110 and 170 \nrespectively.  If a lower effective barrier of 2.5 eV is used, β values of the 54 and 84, \nrespectively result. Since the value of β from the stressed film is less than that from the \nunstressed film and the values of the Eth are similar, we believe that that the surface protrusions \ndo not play a significant role in the emission process. Values of β ~250, attributed to surface \nprotrusions, were reported in the study by Talin et al. of FE from ta-C and were proposed as the \nsource of the emission. [5] \nIn order to examine whether the current induced conditioning is permanent the films were \nretested some hours after the initial stressing had been performed. In order to prevent any \npossible atmospheric contamination the samples remained held under vacuum during this period. \nFigure 4 (a) shows that even after just 15 h in the sample that was stressed to 5.2 x 10-8 A, Eth \nhad risen to about 50 V\/µm, similar to the value obtained in the first cycle after this sample had \njust been stressed, indicating some form of ‘healing’ process had occurred. By contrast Fig. 4 (b) \nshows that in the film stressed to 2 x 10-7 A shows no evidence of a conditioning cycle is \nrequired 23 hours after the original current stressing had occurred. Only the first two I-V \ncharacteristics are presented in Fig. 4 (b) and values of Eth obtained after 23 hours are 30 and 32 \nV\/µm with a hysteresis width of 2-3 V\/µm. Testing after 87 h revealed similar results to those \n 5\nAppl. Phys. Lett. 78, (2001) 347\nobtained after testing after 23 h with the values of Eth for the first two cycles being 31 and 32 \nV\/µm, again showing that the film has remained conditioned.  \nClearly conditioning of the film through current stressing results in favourable FE \ncharacteristics, though it also results in the presence of surface debris. It is also worth pointing \nout that the lowest values of Eth obtained from the stressed films are almost the same as those \nobtained from those films which underwent a conventional conditioning treatment. In the study \nby Mercer et al. [8] a scanning tunnelling microscope tip was used to effectively current stress \nta-C films by generating a highly spatially localised electric field. They observed that after \nramping the tip-sample bias and current, nanostructures of about 100 nm in extent form. By \nusing high resolution spatially-resolved electron energy loss spectroscopy (EELS) they showed \nthat the predominant bonding configuration changes from predominately four-fold coordinated C \nto three-fold coordinated. The net effect of the conditioning or the current stressing treatments \nmay well be to generate conductive sp2 rich areas either in the from of filaments or clusters \nthrough localised Joule heating. Missert et al. proposed that the presence of conductive filaments \nis related to the deposition conditions under which the film was grown. [12] Since the deposition \nconditions for the films in this study were kept the same the current stressing may well be \nincreasing the number of such filaments\/clusters extending  though  the film.   \n In conclusion by current stressing of wide gap a-C:H films it has been demonstrated that \nthe initial conditioning treatment often required in the FE characteristics from various types of a-\nC:H films can be removed but at the expense of creating surface protrusions. For sufficient \ncurrent stress levels the film remains conditioned for periods of at least 87 hours.   \n \nAcknowledgements \nThis work has been sponsored by the EPSRC no. GR\/L77638. The authors would like to \nacknowledge the helpful discussions with Prof. J. M. Shannon from Philips Research \nLaboratories, Redhill.  \n 6\nAppl. Phys. Lett. 78, (2001) 347\n 7\n \nReferences \n1     See, for example, Amorphous Carbon: State of the Art, Proceedings of the First International \nspecialist meeting on amorphous carbon. Ed. S. R. P. Silva, J. Robertson, W.I. Milne and G. \nA. J. Amaratunga, (World Scientific, Singapore, 1998). \n2  J. E. Jaskie, MRS Bulletin, 21, 59 (1996). \n3     P. W. May, S. Hohn, W. N. Wang and N. A. Fox, Appl. Phys. Lett. 72, 2182 (1998). \n4  J. D. Carey, C. H. Poa, R. D. Forrest, A. P. Burden, and S.R.P. Silva, J. Vac. Sci. Technol.  \nB 18, 1051 (2000) \n5   A. A. Talin, T. E. Felter, T. A. Friedmann, J. P. Sullivan and M. P. Siegal, J. Vac. Sci. \nTechnol. A 14, 1719 (1996) \n6    A. Ilie, A. C. Ferrari, T. Yagi and J. Robertson, Appl. Phys. Lett. 76, 2627 (2000). \n7    A. T. Sowers, B. L. Ward, S. L. English, and R. J. Nemanich, J. Appl. Phys. 86, 3973 (1999). \n8    T. W. Mercer, N. J. DiNardo, J. B. Rothman, M. P. Siegal, T. A. Friedmann, L. J. Martinez \nMiranda, Appl. Phys. Lett. 72, 2244 (1998). \n9    N. P. Barradas, R. U. A. Khan, J. V. Anguita, S. R. P. Silva, U. Kreissig, R. Grötzschel,  and \nW. Möller, Nucl. Instrum. Methods B 161-163, 969 (2000). \n10   M. Collins, R. C. Barklie, J. V. Anguita, J. D. Carey and S. R. P. Silva, Diamond Relat. \nMater. 9, 781 (2000). \n11  R. D. Forrest, A. P. Burden, S. R. P. Silva, L. K. Cheah,  and X. Shi, Appl. Phys. Lett. 73, \n3784 (1998). \n12  N. Missert, T. A. Friedmann, J. P. Sullivan and R. G. Copeland, Appl. Phys. Lett. 70, 1995 \n(1997). \n \n \n \n \nAppl. Phys. Lett. 78, (2001) 347\n 8\n \n \nFigure captions \n \nFigure 1. Emission current versus electric field for films stressed to 5 x 10-8 A. The applied field \nis cycled up and down four times as indicated by ({) for run 1, (Υ) for run 2, (n) for run 3 and \n(V) for run 4. The emission current for the film before stressing is indicted by (ν). Not all data \npoints are shown for clarity. \n \nFigure 2. Emission current versus electric field for films stressed to 2 x 10-7 A. The applied field \nis cycled up and down four times as indicated by ({) for run 1, (Υ) for run 2, (n) for run 3 and \n(V) for run 4. The emission current for the film before stressing is indicted by (ν). Not all data \npoints are shown for clarity. \n \nFigure 3. (a) AFM topography of the surface of the film stressed to 2 x 10-7 A area three regions \nindicated by dashed lines. The center of stressed area is in region 3. (b) Fowler-Nordheim \nrepresentation of the I-V characteristics of  the film stressed to 2 x 10-7 A (n) and one of the \ncharacteristics of a conditioned but unstressed film (Υ).  \n \nFigure 4. Emission current versus electric field for films (a) stressed to 5 x 10-8 A and retested \nafter 15 h (U and ν)  and (b) stressed to 2 x 10-7 A and retested after 23 ({ and Υ) and 87 h  (n \nand V). Only the first two cycles of each retest are shown for clarity.    \n \n \n \n \n \nAppl. Phys. Lett. 78, (2001) 347\n 9\n \n \n \n10-12\n10-10\n10-8\n10-6\n10-4\n0 20 40 60 80\nIs = 5.2 x 10\n-8 A\nAfter \nstressing\nBefore \nstressing\nElectric field (V\/µm)\nEm\nis\nsi\non\n c\nur\nre\nnt\n (A\n)\n \n \n \n \n \n \n \n \nCarey and Silva Figure 1 \nAppl. Phys. Lett. 78, (2001) 347\n 10\n \n \n \n10-12\n10-10\n10-8\n10-6\n10-4\n0 20 40 60 80\nIs= 2 x 10\n-7 A\nAfter \nstressing\nBefore \nstressing\nElectric field (V\/µm)\nEm\nis\nsi\non\n c\nur\nre\nnt\n (A\n)\n \n \n \n \n \n \n \n \nCarey and Silva Figure 2 \nAppl. Phys. Lett. 78, (2001) 347\n 11\n \n \n(a) \nCenter of stressed area \n  Region  1            2             3 \n-50\n-45\n-40\n2x10-6 3x10-6 4x10-6\n1\/Field (cm V-1)\nln\n (I\n\/F\n2 )\n  l\nn(\nA \ncm\n2  \nV-\n2 )\n(b) \n0 25 50 75 100 125 \n0\n25 \n50 \n100 \n75 \n125 \nµm \n1500 nm\n \n \n \n750 nm \n \n \n0 nm \n \nCarey and Silva Figure 3 \n \nAppl. Phys. Lett. 78, (2001) 347\n 12\n \n \n \n10-12\n10-10\n10-8\n10-6\n10-4\n0 20 40 60 80\n(a)\nE\nm\nis\nsi\non\n c\nur\nre\nnt\n (A\n)\n10-12\n10-10\n10-8\n10-6\n0 20 40 60 80\n(b)\nElectric field (V\/µm)\nE\nm\nis\nsi\non\n c\nur\nre\nnt\n (A\n)\n \n \n \n \n \nCarey and Silva Figure 4 \nAppl. Phys. Lett. 78, (2001) 347\n"}