{"doi":"10.1109\/TWC.2007.05912","coreId":"71508","oai":"oai:eprints.lancs.ac.uk:817","identifiers":["oai:eprints.lancs.ac.uk:817","10.1109\/TWC.2007.05912"],"title":"Mobility Tracking in Cellular Networks Using Particle Filtering.","authors":["Mihaylova, L","Angelova, D","Honary, S","Bull, D","Canagarajah, N","Ristic, B"],"enrichments":{"references":[{"id":16344747,"title":"[1] “Location is everything: positioning in wireless networks (a special issue),”","authors":[],"date":"2005","doi":null,"raw":"[1] “Location is everything: positioning in wireless networks (a special issue),” IEEE Signal Processing Mag., vol. 22, no. 4, July 2005.10 IEEE TRANSACTIONS ON WIRELESS COMMUNICATIONS, VOL. 6, NO. 10, OCTOBER 2007 [2] Z. R. Zaidi and B. L. Mark, “Real-time mobility tracking algorithms for cellular networks based on Kalman ﬁltering,” IEEE Trans. Mobile Comput., vol. 4, no. 2, pp. 195–208, 2005.","cites":null},{"id":16344758,"title":"A hidden semi-Markov model with missing data and multiple observation sequences for mobility tracking,”","authors":[],"date":"2003","doi":"10.1016\/s0165-1684(02)00378-x","raw":"[6] S.-Z. Yu and H. Kobayashi, “A hidden semi-Markov model with missing data and multiple observation sequences for mobility tracking,” Signal Processing, vol. 83, no. 2, pp. 235–250, 2003.","cites":null},{"id":16344769,"title":"A survey of maneuveuvering target tracking, part I: Dynamic models,”","authors":[],"date":"2003","doi":"10.1117\/12.391979","raw":"[12] X. R. Li and V. Jilkov, “A survey of maneuveuvering target tracking, part I: Dynamic models,” IEEE Trans. Aerospace Electron. Syst., vol. 39, no. 4, pp. 1333–1364, 2003.","cites":null},{"id":16344775,"title":"A tutorial on particle ﬁlters for online nonlinear\/non-Gaussian Bayesian tracking,”","authors":[],"date":"2002","doi":"10.1109\/78.978374","raw":"[14] M. Arulampalam, S. Maskell, N. Gordon, and T. Clapp, “A tutorial on particle ﬁlters for online nonlinear\/non-Gaussian Bayesian tracking,” IEEE Trans. Signal Processing, vol. 50, no. 2, pp. 174–188, 2002.","cites":null},{"id":16344766,"title":"An adaptive state estimator solution to the maneuvering target tracking problem,”","authors":[],"date":"1975","doi":"10.1109\/tac.1975.1100961","raw":"[10] R. Moose, “An adaptive state estimator solution to the maneuvering target tracking problem,” IEEE Trans. Automatic Control, vol. 20(3), pp. 359–362, June 1975. [11] R. Singer, “Estimating optimal tracking ﬁlter performance for manned maneuvering targets,” IEEE Trans. Aerosp. Electron. Syst., vol. 6, pp.","cites":null},{"id":16344755,"title":"An integrated mobility and trafﬁc model for resource allocation in wireless networks,”","authors":[],"date":"2000","doi":"10.1145\/345867.345880","raw":"[5] H. Kobayashi, S.-Z. Yu, and B. Mark, “An integrated mobility and trafﬁc model for resource allocation in wireless networks,” in Proc. 3rd ACM International Workshop on Wireless Mobile Multimedia. ACM Press, 2000, pp. 39–47.","cites":null},{"id":16344785,"title":"Beyond the Kalman Filter: Particle Filters for Tracking Applications. Artech House,","authors":[],"date":"2004","doi":null,"raw":"[17] B. Ristic, S. Arulampalam, and N. Gordon, Beyond the Kalman Filter: Particle Filters for Tracking Applications. Artech House, 2004.","cites":null},{"id":16344826,"title":"Complexity analysis of the marginalized particle ﬁlter,”","authors":[],"date":"2005","doi":"10.1109\/tsp.2005.857061","raw":"[31] R. Karlsson, T. Sh¨ on, and F. Gustafsson, “Complexity analysis of the marginalized particle ﬁlter,” IEEE Trans. Signal Processing, vol. 53, no. 11, pp. 4408–4411, Nov. 2005.","cites":null},{"id":16344806,"title":"Efﬁcient particle ﬁltering for multiple target tracking with application to tracking in structural images,”","authors":[],"date":"2003","doi":"10.1016\/s0262-8856(03)00087-8","raw":"[23] S. Maskell, M. Rollason, N. Gordon, and D. Salmond, “Efﬁcient particle ﬁltering for multiple target tracking with application to tracking in structural images,” Image and Video Computing, vol. 21, no. 10, pp. 931–939, 2003.","cites":null},{"id":16344824,"title":"Estimation with Applications to Tracking and Navigation.","authors":[],"date":"2001","doi":"10.1002\/0471221279","raw":"[30] Y. Bar-Shalom, X. R. Li, and T. Kirubarajan, Estimation with Applications to Tracking and Navigation. John Wiley and Sons, 2001.","cites":null},{"id":16344761,"title":"Joint mobility tracking and hard handoff in cellular networks via sequential Monte Carlo ﬁltering,” in","authors":[],"date":"2002","doi":"10.1109\/infcom.2002.1019344","raw":"[7] Z. Yang and X. Wang, “Joint mobility tracking and hard handoff in cellular networks via sequential Monte Carlo ﬁltering,” in Proc. IEEE Conf. on Computer Communications (Infocom) 2002.","cites":null},{"id":16344830,"title":"Lyudmila Mihaylova is a Lecturer at the Department of Communication Systems,","authors":[],"date":"2000","doi":null,"raw":"Lyudmila Mihaylova is a Lecturer at the Department of Communication Systems, Lancaster University, United Kingdom. Prior this she was a Research Fellow with the Signal and Image Processing group at the University of Bristol, UK (2004-2006) and had visiting positions with the SYSTEMS group, at the University of Ghent, Belgium (2002-2004) and with the Robotics group of Katholieke Universiteit Leuven, Belgium (2000-2002). From 1996 to 2000 she was a Research Assistant at the Bulgarian Academy of Science and an Adjunct Assistant Professor at the Technical University of Soﬁa, Bulgaria. She received M.Sc. degree in Systems and Control Engineering (1989), M.Sc. degree in Applied Mathematics and Informatics (1991) and her Ph.D. degree in Systems and Control Engineering (1996), all from the Technical University of Soﬁa, Bulgaria. Her interests are in the area of nonlinear ﬁltering, statistical signal and image processing, autonomous intelligent systems, and sensor data fusion. Dr. Mihaylova is a member of the IEEE, Signal Processing Society and of the International Society of Information Fusion.","cites":null},{"id":16344802,"title":"Marginalized particle ﬁlters for mixed linear\/ nonlinear state-space models,”","authors":[],"date":"2005","doi":"10.1109\/tsp.2005.849151","raw":"[22] T. Sch¨ on, F. Gustafsson, and P. Nordlund, “Marginalized particle ﬁlters for mixed linear\/ nonlinear state-space models,” IEEE Trans. Signal Processing, vol. 53, no. 7, pp. 2279–2289, July 2005.","cites":null},{"id":16344827,"title":"Mobile positioning using wireless networks: Possibilities and fundamental limitations based on available wireless network measurements,”","authors":[],"date":"2005","doi":"10.1109\/msp.2005.1458284","raw":"[32] F. Gustafsson and F. Gunnarsson, “Mobile positioning using wireless networks: Possibilities and fundamental limitations based on available wireless network measurements,” IEEE Signal Processing Mag., vol. 22, no. 4, pp. 41–53, 2005.","cites":null},{"id":16344764,"title":"Mobility estimation based on an autoregressive model,”","authors":[],"date":"2004","doi":"10.1109\/glocom.2004.1378999","raw":"[8] Z. R. Zaidi and B. L. Mark, “Mobility estimation based on an autoregressive model,” Electrical Engineering Department of George Mason University, USA, Tech. Rep., 2004.","cites":null},{"id":16344749,"title":"Mobility modeling, location tracking, and trajectory prediction in cellular networks,”","authors":[],"date":"1998","doi":"10.1109\/49.709453","raw":"[3] T. Liu, P. Bahl, and I. Chlamtac, “Mobility modeling, location tracking, and trajectory prediction in cellular networks,” IEEE J. Sel. Areas Commun., vol. 16, no. 6, pp. 922–936, Aug. 1998.","cites":null},{"id":16344773,"title":"Mobility tracking in cellular networks with sequential Monte Carlo ﬁlters,” in","authors":[],"date":"2005","doi":"10.1109\/icif.2005.1591843","raw":"[13] L. Mihaylova, D. Bull, D. Angelova, and N. Canagarajah, “Mobility tracking in cellular networks with sequential Monte Carlo ﬁlters,” in Proc. Eight International Conf. on Information Fusion 2005.","cites":null},{"id":16344809,"title":"On sequential Monte Carlo sampling methods for Bayesian ﬁltering,”","authors":[],"date":"2000","doi":"10.1007\/978-1-4757-3437-9_4","raw":"[25] A. Doucet, S. Godsill, and C. Andrieu, “On sequential Monte Carlo sampling methods for Bayesian ﬁltering,” Statistics and Computing, vol. 10, no. 3, pp. 197–208, 2000.","cites":null},{"id":16344813,"title":"Particle ﬁltering for partially observed Gaussian state-space models,”","authors":[],"date":"2002","doi":"10.1111\/1467-9868.00363","raw":"[26] C. Andrieu and A. Doucet, “Particle ﬁltering for partially observed Gaussian state-space models,” J. of R. Statist. Soc. B., vol. 64, no. 4, pp. 827–836, 2002. [27] N. Bergman, A. Doucet, and N. Gordon, “Optimal estimation and Cram´ er-Rao bounds for partial non-Gaussian state space models,” Ann.","cites":null},{"id":16344795,"title":"Particle ﬁlters for positioning, navigation and tracking,”","authors":[],"date":"2002","doi":"10.1109\/78.978396","raw":"[20] F. Gustafsson, F. Gunnarsson, N. Bergman, U. Forssell, J. Jansson, R. Karlsson, and P.-J. Nordlund, “Particle ﬁlters for positioning, navigation and tracking,” IEEE Trans. Signal Processing, vol. 50, no. 2, pp. 425–437, 2002.","cites":null},{"id":16344817,"title":"Posterior Cram´ er-Rao bounds for discrete-time nonlinear ﬁltering,”","authors":[],"date":"1998","doi":"10.1109\/78.668800","raw":"[29] P. Tichavsky, C. Muravchik, and A. Nehorai, “Posterior Cram´ er-Rao bounds for discrete-time nonlinear ﬁltering,” IEEE Trans. Signal Processing, vol. 46, no. 5, pp. 1386–1396, 1998.","cites":null},{"id":16344788,"title":"Rao-Blackwellisation of sampling schemes,”","authors":[],"date":"1996","doi":"10.1093\/biomet\/83.1.81","raw":"[18] G. Casella and C. Robert, “Rao-Blackwellisation of sampling schemes,” Biometrica, vol. 83, no. 1, pp. 84–94, 1996.","cites":null},{"id":16344752,"title":"Robust mobility tracking for cellular networks,” in","authors":[],"date":"2002","doi":"10.1109\/icc.2002.996893","raw":"[4] B. Mark and Z. Zaidi, “Robust mobility tracking for cellular networks,” in Proc. IEEE Intl. Communications Conf., May 2002, pp. 445–449.","cites":null},{"id":16344791,"title":"Sequential Monte Carlo ﬁltering techniques applied to integrated navigation systems,” in","authors":[],"date":"2001","doi":"10.1109\/acc.2001.945666","raw":"[19] P.-J. Nordlund and F. Gustafsson, “Sequential Monte Carlo ﬁltering techniques applied to integrated navigation systems,” in Proc. American Control Conf., 2001, pp. 4375–4380.","cites":null},{"id":16344799,"title":"Sequential Monte Carlo Filters and Integrated Navigation. Licentiate Thesis, Link¨ oping","authors":[],"date":"2002","doi":null,"raw":"[21] P.-J. Nordlund, Sequential Monte Carlo Filters and Integrated Navigation. Licentiate Thesis, Link¨ oping University, Sweden, 2002.","cites":null},{"id":16344778,"title":"Sequential Monte Carlo methods for dynamic systems,”","authors":[],"date":"1998","doi":"10.2307\/2669847","raw":"[15] J. Liu and R. Chen, “Sequential Monte Carlo methods for dynamic systems,” J. American Statistical Association, vol. 93, no. 443, pp. 1032– 1044, 1998.","cites":null},{"id":16344781,"title":"The Unscented Kalman Filter, Ch. 7: Kalman Filtering and Neural Networks,","authors":[],"date":"2001","doi":"10.1002\/0471221546.ch7","raw":"[16] E. Wan and R. van der Merwe, The Unscented Kalman Filter, Ch. 7: Kalman Filtering and Neural Networks, edited by S. Haykin. Wiley Publishing, September 2001, pp. 221–280.","cites":null},{"id":16344815,"title":"Tracking a manoeuvring target using angle-only measurements: Algorithms and performance,”","authors":[],"date":"2003","doi":"10.1016\/s0165-1684(03)00042-2","raw":"[28] B. Ristic and M. Arulampalam, “Tracking a manoeuvring target using angle-only measurements: Algorithms and performance,” Signal Processing, vol. 83, no. 6, pp. 1223–1238, 2003.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-10","abstract":"Mobility tracking based on data from wireless cellular networks is a key challenge that has been recently investigated both from a theoretical and practical point of view. This paper proposes Monte Carlo techniques for mobility tracking in wireless communication networks by means of received signal strength indications. These techniques allow for accurate estimation of Mobile Station’s (MS) position and speed. The command process of the MS is represented by a first-order Markov model which can take values from a finite set of acceleration levels. The wide range of acceleration changes is covered by a set of preliminary determined acceleration values. A particle filter and a Rao-Blackwellised particle filter are proposed and their performance is evaluated both over synthetic and real data. A comparison with an Extended Kalman Filter (EKF) is performed with respect to accuracy and computational complexity. With a small number of particles the RBPF gives more accurate results than the PF and the EKF. A posterior Cram´er Rao lower bound (PCRLB) is calculated and it is compared with the filters’ rootmean-square error performance","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71508.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/817\/1\/Mihaylova_ToWC%2D05%2D912.pdf","pdfHashValue":"7a4f6abc2196288723acac3652f908a4bf13282b","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:817<\/identifier><datestamp>\n      2018-01-24T03:16:52Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5141:51413735<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Mobility Tracking in Cellular Networks Using Particle Filtering.<\/dc:title><dc:creator>\n        Mihaylova, L<\/dc:creator><dc:creator>\n        Angelova, D<\/dc:creator><dc:creator>\n        Honary, S<\/dc:creator><dc:creator>\n        Bull, D<\/dc:creator><dc:creator>\n        Canagarajah, N<\/dc:creator><dc:creator>\n        Ristic, B<\/dc:creator><dc:subject>\n        QA75 Electronic computers. Computer science<\/dc:subject><dc:description>\n        Mobility tracking based on data from wireless cellular networks is a key challenge that has been recently investigated both from a theoretical and practical point of view. This paper proposes Monte Carlo techniques for mobility tracking in wireless communication networks by means of received signal strength indications. These techniques allow for accurate estimation of Mobile Station’s (MS) position and speed. The command process of the MS is represented by a first-order Markov model which can take values from a finite set of acceleration levels. The wide range of acceleration changes is covered by a set of preliminary determined acceleration values. A particle filter and a Rao-Blackwellised particle filter are proposed and their performance is evaluated both over synthetic and real data. A comparison with an Extended Kalman Filter (EKF) is performed with respect to accuracy and computational complexity. With a small number of particles the RBPF gives more accurate results than the PF and the EKF. A posterior Cram´er Rao lower bound (PCRLB) is calculated and it is compared with the filters’ rootmean-square error performance.<\/dc:description><dc:date>\n        2007-10<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/817\/1\/Mihaylova_ToWC%2D05%2D912.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/TWC.2007.05912<\/dc:relation><dc:identifier>\n        Mihaylova, L and Angelova, D and Honary, S and Bull, D and Canagarajah, N and Ristic, B (2007) Mobility Tracking in Cellular Networks Using Particle Filtering. IEEE Transactions on Wireless Communications, 6 (10). pp. 3589-3599.<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/817\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1109\/TWC.2007.05912","http:\/\/eprints.lancs.ac.uk\/817\/"],"year":2007,"topics":["QA75 Electronic computers. Computer science"],"subject":["Journal Article","PeerReviewed"],"fullText":"IEEE TRANSACTIONS ON WIRELESS COMMUNICATIONS, VOL. 6, NO. 10, OCTOBER 2007 1\nMobility Tracking in\nCellular Networks Using Particle Filtering\nL. Mihaylova, Member, IEEE, D. Angelova, S. Honary, D. R. Bull, Senior Member, IEEE,\nC. N. Canagarajah, Member, IEEE, and B. Ristic, Member, IEEE\nAbstract— Mobility tracking based on data from wireless\ncellular networks is a key challenge that has been recently inves-\ntigated both from a theoretical and practical point of view. This\npaper proposes Monte Carlo techniques for mobility tracking in\nwireless communication networks by means of received signal\nstrength indications. These techniques allow for accurate estima-\ntion of Mobile Station’s (MS) position and speed. The command\nprocess of the MS is represented by a first-order Markov model\nwhich can take values from a finite set of acceleration levels.\nThe wide range of acceleration changes is covered by a set\nof preliminary determined acceleration values. A particle filter\nand a Rao-Blackwellised particle filter are proposed and their\nperformance is evaluated both over synthetic and real data. A\ncomparison with an Extended Kalman Filter (EKF) is performed\nwith respect to accuracy and computational complexity. With a\nsmall number of particles the RBPF gives more accurate results\nthan the PF and the EKF. A posterior Crame´r Rao lower bound\n(PCRLB) is calculated and it is compared with the filters’ root-\nmean-square error performance.\nIndex Terms— Mobility tracking, wireless networks, hybrid\nsystems, sequential Monte Carlo methods, Rao-Blackwellisation.\nI. INTRODUCTION\nMOBILITY tracking is one of the most important fea-tures of wireless cellular communication networks [1].\nData from two types of station are usually used: base stations\n(BSs) the position of which is known, and mobile stations\n(MSs) or mobile users for which location and motion are\nestimated.\nMobility tracking techniques can be divided in two\ngroups [2]: i) methods in which the position, speed and\npossibly the acceleration are estimated, and ii) conventional\ngeo-location techniques, which only estimate the position\ncoordinates. Previous approaches for mobility tracking rely on\nKalman filtering [2]–[4], hidden semi-Markov models [4]–[6]\nand sequential Monte Carlo (MC) filtering [7].\nManuscript received November 17, 2005; revised October 23, 2006 and\nApril 16, 2007; accepted July 3, 2007. The associate editor coordinating the\nreview of this paper and approving it for publication was F. Daneshgaran.\nL. Mihaylova is with Lancaster University, Dept. of Communication\nSystems, UK (email: mila.mihaylova@lancaster.ac.uk).\nD. Angelova is with the Bulgarian Academy of Sciences, Bulgaria (email:\ndonka@bas.bg).\nS. Honary is with HW Communications Ltd., UK (email:\nSouroush@hwcomms.com).\nD. Bull and N. Canagarajah are with the Dept. of Electrical and\nElectronic Engineering, Univ. of Bristol, UK (email: {dave.bull, nis-\nhan.canagarajah}@bristol.ac.uk).\nB. Ristic is with DSTO, Australia (email: branko.ristic@dsto.defence.\ngov.au).\nDigital Object Identifier 10.1109\/TWC.2007.05912.\nTwo types of measurements are usually used: pilot signal\nstrength from different BSs measured at the mobile unit and\nthe corresponding propagation times.\nThe Kalman-filtering algorithms developed in [2] for real-\ntime tracking of a MS in cellular networks have limitations\ndue to the necessity for linearisation. This leads to the\nshortcomings in accuracy caused by this approximation. The\ntwo algorithms proposed in [2] use the pilot signal strengths\nfrom neighbouring BSs (i.e., the Received Signal Strength\nIndication (RSSI)), although signal measurements such as\ntime-of-arrival (TOA) are also suitable. The model of the\nMS is considered to be linear, driven by a discrete command\nprocess corresponding to the MS acceleration. The command\nprocess is modelled as a semi-Markov process over a finite\nset of acceleration levels. The first algorithm in [2] consists\nof an averaging filter for processing pilot signal strength\nmeasurements and two Kalman filters, one to estimate the dis-\ncrete command process and the other to estimate the mobility\nstate. The second algorithm employs a single Kalman filter\nwithout pre-filtering the measurements and is able to track a\nMS even when a limited set of pilot signal measurements is\navailable. Both proposed algorithms can be used to predict\nfuture mobility behaviour, which can be utilised in resource\nallocation applications.\nYang and Wang [7] developed an MC algorithm for joint\nmobility tracking and hard handoff detection in cellular\nnetworks. In their work, mobility tracking involves on-line\nestimation of the location and speed of the mobile, whereas\nhandoff detection involves on-line prediction of the pilot signal\nstrength at some future time instants. The optimal solution of\nboth problems is prohibitively complex due to the nonlinear\nnature of the system. The MC joint mobility tracking and\nhandoff detection algorithm designed in [7] is compared with a\nmodified EKF and it is shown that the MC technique provides\nmuch better accuracy than the EKF.\nIn this paper we focus on mobility tracking based on signal\nstrength measurements. In contrast to previous work [2], [3],\n[7], [8], mobility tracking is formulated as an estimation\nproblem of hybrid systems which have a base state vector and\na mode (modal) state vector. The base states are continuously\nevolving, whilst the modal states can undergo abrupt changes.\nThis formulation together with the sequential MC approach\nprovides us with a powerful tool for mobility tracking. A\nparticle filter (PF) and a Rao-Blackwellised particle filter\n(RBPF) are developed and their performance investigated\ncompared to an EKF with respect to accuracy and compu-\ntational complexity.\n1536-1276\/07$25.00 c© 2007 IEEE\n2 IEEE TRANSACTIONS ON WIRELESS COMMUNICATIONS, VOL. 6, NO. 10, OCTOBER 2007\n \nka  \nkr  \ntime correlated  \nrandom acceleration \nku  \ncommands \n1m  \n2m  \nMm  \nFig. 1. Structure of the mobility acceleration chain.\nThe structure of the paper is as follows. Section II formu-\nlates the problem. Section III presents the mobility state and\nobservation models. A particle filter for mobility estimation\nin wireless cellular networks is presented in Section IV and\na Rao-Blackwellised particle filter is designed in Section V.\nSection VI considers the relevant PCRLB. The performance of\nthe designed algorithms is evaluated using synthetic and real\ndata in Section VII. Finally, conclusions and ongoing research\nissues are highlighted in Section VIII.\nII. PROBLEM FORMULATION\nWe consider the problem of mobility tracking in cellular\nnetworks within the sequential MC framework. The dynamics\nof the mobility unit is described by the equation\nxk = f(xk−1,mk,uk,wk), (1)\nwhere xk ∈ Rnx is the system base state, uk ∈ Rnu specifies\nthe command process, and wk ∈ Rnw is the state noise, with\nk ∈ N being the discrete time and N is the set of natural\nnumbers. The modal (discrete) state mk characterising the\ndifferent system modes (regimes), can take values over a finite\nset M, i.e., mk ∈M.\nThe measurement equation is of the form\nzk = h(xk,vk), (2)\nwhere zk ∈ Rnz is the observation, and vk ∈ Rnv is the\nmeasurement noise. Functions f(.) and h(.) are nonlinear in\ngeneral.\nIt is assumed that the observations are taken at discrete\ntime points Tk, with a discretisation time step T . The ac-\nceleration uk of the mobile unit is usually highly correlated,\nbut sometimes it undergoes rapid changes caused by various\nreasons such as traffic lights and road turns. Following [3],\n[7], [8], the motion of the moving user can be modeled as a\ndynamic system driven by a command uk = (ux,k, uy,k)′ and\na correlated random acceleration rk = (rx,k, ry,k)′ at time k,\ni.e., the total acceleration is ak = uk + rk (see Fig. 1).\nIII. MOBILITY STATE AND OBSERVATION MODELS\nDifferent state mobility models have previously been used in\ncellular networks such as the constant acceleration model [9]\nand Singer-type models [2], [4], [10]. In this paper we choose\na discrete-time Singer-type model [7] because it captures\ncorrelated accelerations and allows for prediction of position,\nspeed and acceleration of mobile users. Originally proposed in\n[11] for tracking targets in military systems, the Singer model\nhas served as a basis for developing effective manoeuvre mod-\nels for various applications (see [12] for a detailed survey),\nincluding user mobility patterns. In the original Singer model\nthere is no control process and the acceleration is considered\nas a random process, which has a time autocorrelation. The\nSinger-type model from [2] includes a command process in\nexplicit form. Yang and Wang consider a simpler form of this\nmobility model [7]. In our previous paper [13] we investigated\nthe Singer-type model adopted for mobility tracking by [2].\nHowever, we found that the model of [7] gives better results\nand at the same time is simpler since it enables a more efficient\ncalculation of the PCRLBs. In this paper we adopt their model.\nThe state of the moving mobile at time instant k is defined\nby the vector xk = (xk, x˙k, x¨k, yk, y˙k, y¨k)′ where xk and yk\nspecify the position, x˙k and y˙k specify the speed, and x¨k and\ny¨k specify the acceleration in the x and y directions in a two-\ndimensional space.\nThe motion of the mobility user can be described by the\nequation\nxk = A(T, α)xk−1 +Bu(T )uk +Bw(T )wk, (3)\nwhere uk = (ux,k, uy,k)′ is a discrete-time command process\nand the respective matrices in (3) are of the form\nA(T, α) =\n(\nA˜ 03×3\n03×3 A˜\n)\n,Bi(T ) =\n(\nB˜i 03×1\n03×1 B˜i\n)\n,\n(4)\nA˜=\n1 T T 2\/20 1 T\n0 0 α\n , B˜u=\nT 2\/2T\n0\n , B˜w=\nT 2\/2T\n1\n .\n(5)\nThe subscript i in the matrix B(T ) in (4) stands for u or w\nrespectively. The random process wk is a 2×1 vector, T is the\ndiscretisation period. The parameter α is the reciprocal of the\nmanoeuvre time constant and thus depends on how long the\nmanoeuvre lasts. Since wk is a white noise, E[wkw′k+j ] = 0,\nfor j 6= 0. The covariance matrix Q of wk is Q = σ2wI , where\nI denotes the unit matrix and σw is the standard deviation.\nThe unknown command processes ux,k and uy,k are mod-\nelled as a first-order Markov chain that takes values from a\nset of acceleration levels Mx and My , and the process uk\ntakes values from the set M =Mx×My = {m1, . . . ,mM},\nwith transition probabilities piij = P (uk =mj |uk−1 =mi),\ni, j = 1, . . . ,M and initial probability distribution µi,0 =\nP{m = mi} for modes mi ∈ M such that µi,0 ≥ 0 and∑M\ni=1 µi,0 = 1.\nA. Observation Model\nA commonly used model [2], [7] in cellular networks for\nthe distance between a mobile and a given base station (BS)\nrelies on the RSSI, which is the pilot signal strength received\nat the mobile. Denote by zk,i the RSSI signal received by\na given mobile from the i-th BS with coordinates (ai, bi) at\ntime k. The RSSI can be modelled as a sum of two terms: path\nloss and shadow fading. Fast fading is neglected assuming that\na low-pass filter is used to attenuate the Rayleigh or Rician\nfade. Therefore, the RSSI (measured in dB) that the mobile\nMIHAYLOVA et al.: MOBILITY TRACKING IN CELLULAR NETWORKS USING PARTICLE FILTERING 3\nunit receives from a particular BS i at time k can be modelled\nas the following function\nzk,i = z0,i − 10ηlog10(dk,i) + vk,i, (6)\nwhere z0,i is a constant characterising the transmission power\nof the BS, depending on factors such as wavelength, antenna\nheight and gain of cell i; η is a slope index (typically η = 2\nfor highways and η = 4 for microcells in a city); dk,i =√\n(xk − ai)2 + (yk − bi)2 is the distance between the mobile\nunit and the base station; (ai, bi) is the position of the i-th\nBS; vk,i is the logarithm of the shadowing component, which\nwas found in [3] to be a zero mean, stationary Gaussian\nprocess with standard deviation σv,i, typically from 4 – 8\ndB. The shadowing component can considerably worsen the\nestimation process as it is shown in [2], [4]. This difficulty\ncan be overcome by pre-filtering the measurements (e.g. by an\naveraging filter [2]) in order to reduce the observation noise.\nTo locate the mobile station (MS) in a two-dimensional\nplane, a minimum of three distance measurements to neigh-\nbouring BSs are sufficient to enable triangulation. Within\nthe GSM system the MS is constantly monitoring up to 7\nneighbouring BSs in order to establish the need for handovers.\nFor the considered problem the observation vector consists\nof the three largest RSSI denoted zk,1, zk,2, zk,3. Hence, the\nmeasurement equation is of the form\nzk = h(xk) + vk, (7)\nwith h(xk) = (h1(xk), h2 (xk), h3(xk))′, hi(xi,k) = z0,i −\n10ηlog(dk,i), a measurement vector zk = (zk,1, zk,2, zk,3)′,\nshadowing components vk = (vk,1, vk,2, vk,3)′ assumed to\nbe uncorrelated both in time and space and having Gaussian\ndistribution, vk,i = N (0, σ2v,i).\nIV. MOBILITY TRACKING AND PREDICTION WITHIN\nBAYESIAN FRAMEWORK\nWe now consider the sequential estimation of the mobility\nof a user within the Bayesian framework. Since the command\nprocess u is unknown, we are considering a hybrid particle\nxk = (x′k,m\n′\nk)\n′ that fully characterises the target state\nand mode. The mobility state xk can be evaluated at each\ntime instant from the conditional probability density function\np(xk|z1:k) and a set of measurements z1:k , {z1, . . . , zk}\nup to time instant k via the Chapman-Kolmogorov equation\np(xk|z1:k−1)=\n∫\nRnx\np(xk|xk−1)p(xk−1|z1:k−1)dxk−1. (8)\nAfter the arrival of the measurement zk at time k, the posterior\nstate probability density function (pdf) can be updated via\nBayes rule\np(xk|z1:k) = p(zk|xk)p(xk|z1:k−1)\np(zk|z1:k−1) , (9)\nwhere p(zk|z1:k−1) is a normalising constant. The analytical\nsolution to the above equations is intractable. Hence, we utilise\nthe MC technique [14] which has proven to be very suitable\nand powerful for dealing with nonlinear system dynamics.\nThe MC approach relies on a sample-based construction of\nthese probability density functions. Multiple particles (sam-\nples) of the variables of interest are generated, each one\nassociated with a weight which characterises the belief that the\nobject is in this state. An estimate of the variable of interest\nis obtained by the weighted sum of particles. Two major\nstages can be distinguished: prediction and update. During\nthe prediction each particle is modified according to the state\nmodel, including the addition of random noise in order to\nsimulate the effect of the noise on the variable of interest.\nThen in the update stage, each particle’s weight is re-evaluated\nbased on the new sensor data. A resampling procedure is\ndealing with the elimination of particles with small weights\nand replicates the particles with higher weights.\nA. A Particle Filter for Mobility Tracking\nThe developed particle filter (PF) is based on multiple\nmodels for the unknown acceleration u. A detailed scheme\nof the PF is given below, where N denotes the number of\nparticles.\nA particle filter for mobility tracking\nInitialisation\nI. k = 0, for j = 1, . . . , N ,\ngenerate samples {x(j)0 ∼ p(x0),m(j)0 ∼ P0(m) },\nwhere P0(m) are the initial mode probabilities for the\naccelerations and set initial weights W (j) = 1\/N .\nII. For k = 1, 2, . . . ,\n1) Prediction Step\nFor j = 1, . . . , N , generate samples\nx\n(j)\nk = A(T, α)x\n(j)\nk−1+Bu(T )u\n(j)(m(j)k )+Bw(T )w\n(j)\nk ,\nwhere w(j)k ∼ N (0,Q), and under the constraint:\nif V =\n√\n(x˙(j)k )2 + (y˙\n(j)\nk )2 > Vmax, (10)\nαc = arctan{y˙(j)k \/x˙(j)k },\nx˙\n(j)\nk = Vmaxcos(αc), y˙\n(j)\nk = Vmaxsin(αc),\nend\nm\n(j)\nk ∼ {pi`m}Mm=1, m = 1, . . . ,M for ` =m(j)k−1;\nMeasurement Update: evaluate the importance weights\n2) for j = 1, . . . , N , on the receipt of a new measurement,\ncompute the weights\nW\n(j)\nk =W\n(j)\nk−1L(zk|x(j)k ). (11)\nThe likelihood L(zk|x(j)k ) is calculated using (7)\nL(zk|x(j)k ) ∼ N (h(x(j)k ), σv).\n3) for j = 1, . . . , N , normalise the weights,\nWˆ\n(j)\nk =W\n(j)\nk \/\n∑N\nj=1W\n(j)\nk .\nOutput\n4) The posterior mean E[xk|z1:k]\nxˆk = E[xk|z1:k] =\nN∑\nj=1\nWˆ\n(j)\nk x\n(j)\nk . (12)\nCalculate posterior mode probabilities\n4 IEEE TRANSACTIONS ON WIRELESS COMMUNICATIONS, VOL. 6, NO. 10, OCTOBER 2007\n5) for j = 1, . . . , N ,\nP (mk = `|z1:k) =\n∑N\nj=1 1(m\n(j)\nk = `)Wˆ\n(j)\nk ,\nwhere 1(.) is an indicator function such that\n1(mk) =\n{\n1, if mk = `;\n0, otherwise.\nCompute the effective sample size\n6) Neff = 1\/\n∑N\nj=1(Wˆ\n(j)\nk )\n2\n,\nSelection step (resampling) if Neff < Nthresh\n7) Multiply\/ suppress samples {x(j)k ,m(j)k } with high\/ low\nimportance weights Wˆ (j)k , in order to obtain N new\nrandom samples approximately distributed according to\nthe posterior state distribution. The residual resampling\nalgorithm [15], [16] is applied. This is a two step process\nmaking use of sampling-importance-resampling scheme.\n* For j = 1, . . . , N , set W (j)k = Wˆ\n(j)\nk = 1\/N .\nThe PF takes into account the fact that the speed of the\nmobile unit cannot exceed certain values (Eq. (10)). Other\nrefined schemes for accounting for constraints can also be\napplied [17].\nV. A RAO-BLACKWELLISED PARTICLE FILTER FOR\nMOBILITY TRACKING\nA major drawback of particle filtering is that it can become\nprohibitively expensive when a large number of particles is\nused. However, the complexity can be reduced by a procedure\ncalled Rao-Blackwellisation [17]–[23].\nRao-Blackwellisation is a technique for improving particle\nfiltering by analytically marginalising some of the variables\n(linear, Gaussian) from the joint posterior distribution. The\nlinear part of the system model is then estimated by a Kalman\nfilter (KF), an optimal estimator, whilst the nonlinear part is\nestimated by a PF. This leads to the fact that a KF is attached\nto each particle. In the mobility tracking problem the positions\nof the mobile unit are estimated with a PF, whilst the speeds\nand accelerations with a KF. Since the measurement equation\nis highly nonlinear, the particle filter is used to approximate\nthis distribution. After estimating the positions, these estimates\nare given to the KF as measurements. As a result of the\nmarginalisation, the variance of the estimates can be reduced\ncompared with the standard PF.\nSimilarly to the Rao-Blackwellisation approach, the mixture\nKalman filtering approach proposed by Chen and Liu [24]\nrepresents the system in a linear conditional dynamic model.\nIn this way the problem is solved by multiple Kalman filters\nrun with the MC sampling approach. A formulation of the\nRao-Blackwellisation problem is given in [25], [26] in a way\ndifferent from that in [20]. In the implementation of our Rao-\nBlackwellised PF for mobility tracking we follow the approach\nproposed in [19] and [20]. In contrast to these works we design\na RBPF which has a command process in the system model.\nThe mobility model (1)-(2) is rewritten in the form(\nxpfk\nxkfk\n)\n=\n(\nI Apf\n0 Akf\n)(\nxpfk−1\nxkfk−1\n)\n+\n(\nBpfu\nBkfu\n)\nuk\n+\n(\nBpfw\nBkfw\n)\nwk, (13)\nzk = h(x\npf\nk ) + vk, (14)\nwhere xpf = (x, y)′, ‘pf’ is short for particle filter, xkf =\n(x˙, x¨, y˙, y¨)′, ‘kf’ is short for Kalman filter and w is assumed\nGaussian. Equations (13)-(14) have the same properties as\nequations (1)-(2). Since the noise wk is Gaussian,\nwk =\n(\nwpfk\nwkfk\n)\n∈ N ∼ (0,Q),Q =\n(\nQpf M\nM ′ Qkf\n)\n, (15)\nThe mobility model is a Singer-type model which accounts\nfor correlations between the state vector components. Hence,\nwe cannot assume that the process noise wpf is uncorrelated\nwith wkf , i.e. M 6= 0.\nInstead of directly estimating the pdf p(xk|z1:k), with the\nentire state vector, consider the pdf p(xpfk ,x\nkf\nk |z1:k). Using\nthe Bayes rule, this pdf can be factorised into two parts\np(xpfk ,x\nkf\nk |z1:k) = p(xkfk |xpfk , z1:k)p(xpf |z1:k). (16)\nSince the measurements z1:k are conditionally independent on\nxkfk , the probability p(x\nkf\nk |xpfk , z1:k) can be written as\np(xkfk |xpfk ,z1:k) = p(xkfk |xpfk ). (17)\nConsider now the system\nxkfk = A\nkfxkfk−1 +B\nkf\nu uk +B\nkf\nw w\nkf\nk ,\nzk = Apfx\nkf\nk−1 +B\npf\nu uk +B\npf\nw w\npf\nk , (18)\nwhere zk = xpfk − f(xpfk ). Since the system (18) is linear\nand Gaussian, the optimal solution is provided by the KF. We\ncan assume a Gaussian form of the pdf (17), i.e.\np(xkfk |xpfk ) ∼ N (xˆkfk|k−1,P kfk|k−1), (19)\nwhere the estimate vector xˆkfk|k−1 and the corresponding\ncovariance matrix P kfk|k−1 are calculated by the Kalman filter.\nThe second pdf from (16) can be written recursively [19]\np(xpfk |z1:k) =\np(zk|xpfk )p(xpfk |xpf1:k−1)\np(zk|z1:k−1) p(x\npf\n1:k−1|z1:k−1).\n(20)\nDue to the nonlinear measurement equation we apply a PF\nto solve (20). The weights are recursively calculated based on\nthe likelihoods p(zk|xpf,(j)k ). The particles will be sampled\naccording to p(xpf,(j)k |xpf,(j)1:k−1). Using the state equation for\nthe xpf from (13) and having in mind (19), the prediction\nstep in the particle filter can be performed as follows\nx\npf,(j)\nk+1 ∼ N (xpf,(j)k +Apf xˆkf,(j)k|k−1 +Bpfu u(j)k+1,\nApfP\nkf,(j)\nk|k−1(A\npf )′ +Bpfw Q\npf (Bpfw )\n′. (21)\nMIHAYLOVA et al.: MOBILITY TRACKING IN CELLULAR NETWORKS USING PARTICLE FILTERING 5\nFor each particle, one Kalman filter estimates xkf,(j)k+1|k, j =\n1, . . . , N . It should be noted that the prediction of the non-\nlinear variables is used to improve the estimates of the linear\nstate variables.\nNext, we present the developed RBPF. Note that in the\nKF update and prediction steps, the filter gain Kk, the\npredicted and estimated covariance matrices, P kfk|k, P\nkf\nk−1|k\nare calculated once, which reduces the computational load.\nA Rao-Blackwellised PF for mobility tracking\nInitialisation\n1) k = 0, for j = 1, . . . , N ,\ngenerate samples {xpf,(j)0 ∼ p(xpf0 ),m(j)0 ∼ P0(m) },\nwhere P0(m) are the initial mode probabilities for the\naccelerations. Initialise the Kalman filters by {xˆkf,(j)0|−1 ∼\nN\n(\nxˆkf0|−1,P\nkf\n0|−1\n)\n} and set initial weights W (j)0 =1\/N .\nParticle Filter Prediction Step\n2) For j = 1, . . . , N ,\nPredict the particles\nx\npf,(j)\nk+1 = N (xpf,(j)k +Apfxkf,(j)k|k−1 +Bpfu u(m(j)k+1),\nApfP kfk|k−1(A\npf )T +Bpfw Q\npf\nw (B\npf\nw )\n′), (22)\nwhere m(j)k+1 ∼ {pi`m}Mm=1 for ` =m(j)k ;\n3) Update step of the Kalman filters\nKk = P\nkf\nk|k−1(A\npf )′(Sk)−1, (23)\nP kfk|k = P\nkf\nk|k−1 −KkApfP kfk|k−1, (24)\nSk = ApfP\nkf\nk|k−1(A\npf )′ +Bpfw Q\npf (Bpfw )\n′, (25)\nFor j = 1, 2, . . . , N\nx\nkf,(j)\nk|k = x\nkf,(j)\nk|k−1 +Kk(z\n(j)\nk −Apf xˆkf,(j)k|k−1), (26)\nwhere z(j)k = x\npf,(j)\nk+1 −xpf,(j)k and under the constraint:\nif V =\n√\n(ˆ˙x(j)k|k)\n2 + (ˆ˙y(j)k|k)\n2 > Vmax, (27)\nαc = arctan{ˆ˙y(j)k|k\/ˆ˙x(j)k|k},\nˆ˙x(j)k|k = Vmaxcos(αc), ˆ˙y\n(j)\nk|k = Vmaxsin(αc),\nend\n4) Prediction step of the Kalman filters\nP kfk+1|k =DP\nkf\nk|kD\n′ +Bkfw Q¯\nkf (Bkfw )\n′\n, (28)\nwhere\nC =M ′(Qpf )−1, (29)\nD = Akf −CApf , (30)\nQ¯\nkf = Qkf −M ′(Qpf )−1M , (31)\nFor j = 1, 2, . . . , N\nx\nkf,(j)\nk+1|k =Dxˆ\nkf,(j)\nk|k +Cz\n(j)\nk +B\nkf\nu u(m\n(j)\nk+1). (32)\nMeasurement Update: evaluate the importance weights\n5) Compute the weights\nW\n(j)\nk+1 =W\n(j)\nk L(zk+1|xpf,(j)k+1 ). (33)\nThe likelihood L(zk+1|xpf,(j)k+1 ) is calculated from (7)\nL(zk+1|xpf,(j)k+1 ) ∼ N (h(xpf,(j)k+1 ), σv).\n6) Normalise weights, Wˆ (j)k+1 =W (j)k+1\/\n∑N\nj=1W\n(j)\nk+1.\n7) Output\nxˆpfk+1 ≈\nN∑\nj=1\nWˆ\n(j)\nk+1x\npf,(j)\nk+1 , (34)\nxˆkfk+1 ≈\nN∑\nj=1\nWˆ\n(j)\nk+1xˆ\nkf,(j)\nk+1|k, (35)\nCalculate posterior mode probabilities\n8) P (mk+1 = `|z1:k+1) =\n∑N\nj=1 1(m\n(j)\nk+1 = `)Wˆ\n(j)\nk+1,\nwhere 1(.) is an indicator function such that\n1(mk) =\n{\n1, if mk = `;\n0, otherwise.\nSelection step (resampling)\n9) If Neff < Nthresh resample {xpf,(j)k+1 , xkf,(j)k+1\/k,m(j)k+1}\nin the same way as in the PF.\n10) Set k = k + 1 and return to step 2.\nA. Mobility Prediction\nBased on the approximation of the filtering distribution\np(xk|z1:k) we seek to estimate the t-step ahead prediction\ndistribution (t ≥ 2). In a general prediction problem we are\ninterested in computing the posterior t-step ahead prediction\ndistribution p(xk+r|z1:k) given by [7], [25]\np(xk+t|z1:k) =\n∫\nRnx\np(xk|z1:k)\n[\nk+t∏\ni=k+1\ndxk:k+t−1\n]\n, (36)\nwhere xk+t = {xk,uk, . . . ,xk+t,uk+t}. Then\nthe solution to the t step ahead prediction can\nbe given by performing the following steps.\nr step ahead prediction\n* For i = 1, . . . , t, For j = 1, 2, . . . , N , sample\nx\n(j)\nk+i=A(T, α)x\n(j)\nk+i−1+Bu(T )u\n(j)(mk+i)+Bw(T )w\n(j)\nk+i,\nwhere w(j)k+i ∼ N (0,Q),\nm\n(j)\nk+i ∼ {pi`m}M`=1, m = 1, . . . ,M for ` = m(j)k+i−1;\nThen the predicted state estimate of the mobile unit is equal to\nxˆk+t\/k =\nNmc∑\nj=1\nW\n(j)\nk x\n(j)\nk+t|k. (37)\n6 IEEE TRANSACTIONS ON WIRELESS COMMUNICATIONS, VOL. 6, NO. 10, OCTOBER 2007\nVI. POSTERIOR CRAME´R-RAO LOWER BOUND (PCRLB)\nThe posterior CRLB (PCRLB) [17], [27], [28] characterises\nthe best achievable theoretical accuracy in nonlinear filtering.\nThis is of paramount importance for assessing the level of\napproximation introduced by the algorithms.\nConsider a sequence of target states (a trajectory) Xk =\n{x1,x2, . . . ,xk} estimated based on the set of measurements\nz1:k. Since the hybrid estimation problem deals with joint\nestimation of the state vector xk and the mode variable mk,\nthe PCRLB is the inverse Jk of the information matrix and\nis defined as follows [29]\nJk , E{[∇Yk log p(Yk,z1:k)][∇Yk log p(Yk, z1:k)]′},\n(38)\nwhere Yk = [Xk,Mk]′, with Mk = {m1, . . . ,mM} being\nthe random regime sequence; ∇Yk is the first-order partial\nderivative operator with respect to Yk. The analytical deriva-\ntion of the PCRLB for hybrid state estimation is a difficult\nproblem. In the derivation of the PCRLB we follow the\napproach from [17] (Ch. 4, p. 76).\nWhen the target trajectory is generated in a deterministic\nway and the sequence of modes is deterministic, then the\nPCRLB is identical to the covariance matrix propagation of\nthe Extended Kalman Filter (EKF) with Jacobians evaluated\nat the true state vector xk and true regimes. This is a very\n“optimistic” bound. This bound is often calculated in practice\n[17] and most tracking system specifications consider purely\ndeterministic trajectories. In our work we also calculate the\nPCRLB for a deterministic trajectory. If the target trajectory\nis deterministic, but the sequence of modes is random, the\nPCRLB can be calculated in a similar way [17].\nVII. PERFORMANCE EVALUATION\nExample 1. The developed MC algorithms have been eval-\nuated over a conventional hexagonal cellular network (similar\nto those in [7]). It is supposed that a map of the cellu-\nlar network is available and the centre coordinates of the\nbase stations are known. The simulated service area contains\n64 base stations with cell radius of 2 km, as shown in\nFig. 2. The mobile can move to any cell of the network\nwith varying speed and acceleration. The sequence of modes\nin the testing scenario is generated in a deterministic way.\nShort-time manoeuvres are followed by uniform motions. The\ndiscrete-time command processes ux,k and uy,k can change\nwithin the range [−5, 5] [m\/s2]. The command process uk\nin the filters is assumed to be a Markov chain, taking values\nbetween the following acceleration levels M = Mx ×My =\n{(0.0, 0.0), (3.5, 0.0), (0.0, 3.5), (0.0,−3.5), (−3.5, 0.0)},\nin units of [m\/s2]. The simulated trajectory of the mobile is\ngenerated deterministically according to the mobility model\n(3) and, with this trajectory, the RSSI signals are randomly\ngenerated according to the observation equation (7) with\ndifferent random noise realisations for each simulation run.\nThe randomness of the RSSI comes from the randomness of\nthe shadowing component. At any sampling time, the observed\nRSSI signal is chosen to be the three largest signal powers\namong all 64 BSs in the network. The simulation parameters\nare summarised in Table 1.\n3500 4000 4500 5000 5500 6000 6500 7000 7500\n8500\n9000\n9500\n10000\n10500\n11000\n11500\nx coordinate, [m]\ny\n c\no\no\nrd\nin\nat\ne,\n [\nm\n]\n \n \nBS\nBS\ntrajectory\nEKF\nPF: N=300\nRBPF: N=300\nFig. 2. Centres of the base stations, the actual trajectory of the mobile unit,\nestimated trajectories by the EKF, PF and RBPF from a single realisation.\nAfter partitioning the state vector according to (13) within\nthe RBPF scheme the respective matrices of the PF and KF\nacquire the form:\nApf =\n(\nT T 2\/2 0 0\n0 0 T T 2\/2\n)\n,Bpfu =\n(\nT 2\/2 0\n0 T 2\/2\n)\n,\nQpf =\n(\nq11 0\n0 q11\n)\nσ2w, M\npf =\n(\nq12 q13 0 0\n0 0 q12 q13\n)\n,\nAkf =\n\n1 T 0 0\n0 α 0 0\n0 0 1 T\n0 0 0 α\n ,Bkfu =\n\nT 0\n0 0\n0 T\n0 0\n ,\nBkfw =\n\nT 0\n1 0\n0 T\n0 1\n , Qkf =\n\nq22 q23 0 0\nq23 q33 0 0\n0 0 q22 q23\n0 0 q33 q33\nσ2w,\nBpfw = B\npf\nu ,\nwhere qij , i, j = 1, 2, 3 have the form q11 = T 4\/4,\nq12 = T 3\/2, q13 = T 2\/2, q22 = T 2, q23 = T , q33 = 1.\nTable 1. Simulation parameters\nDiscretisation time step T 0.5 [s]\nCorrelation coefficient α 0.6\nPath loss index η 3\nBase station transmission power z0,i 90\nCovariance σ2w of the noise wk in (3) 0.52 [m\/s2]2\nMaximum speed Vmax 45 [m\/s]\nTransition probabilities pi,i 0.8\nInitial mode probabilities µi,0 1\/M, i = 1, ...,M, M = 5\nThreshold for resampling Nthresh = N\/10\nNumber of Monte Carlo runs Nmc = 100\nCovariance σ2v of the noise vi,k [42] [dB]2\nThe estimated and actual trajectories of the mobile unit over\na single realisation are given in Fig. 2.\nThe position root-mean-square error (RMSE) [30]\nRMSE =\n√\n1\nNmc\n∑Nmc\nm=1\n[(xˆk − xk)2 + (yˆk − yk)2] (39)\nMIHAYLOVA et al.: MOBILITY TRACKING IN CELLULAR NETWORKS USING PARTICLE FILTERING 7\n50 100 150 200 250 300\n10\n15\n20\n25\n30\n35\n40\nsp\nee\nd\n, \n[m\n\/s\n]\nTime, [s]\nFig. 3. Actual speed of the moving unit. This figure shows the abrupt\nmanoeuvre in the MS motion.\n0 50 100 150 200 250 300\n0\n100\n200\n300\n400\n500\n600\nTime, [s]\nP\no\nst\nio\nn\n R\nM\nS\nE\n (\nx\n a\nn\nd\n y\n c\no\nm\nb\nin\ned\n),\n [\nm\n]\n \n \nEKF\nPF: N=300\nRBPF: N=300\nCRLB\nFig. 4. RMSE of x and y positions combined of the EKF, PF and RBPF\nfor Nmc = 100 runs. The PF and RBPF particles are N = 300.\nis used to assess the closeness of the estimated trajectory\n{xˆk, yˆk} to a given trajectory {xk, yk} over Nmc = 100 MC\nruns. The location PCRLB is determined as\nlocation PCRLB =\n√\n(P k(1, 1) + P k(4, 4)), (40)\nwhere P is the covariance matrix of the EKF having Jacobians\nevaluated for the true state vector xk.\nFigures 4-5 present the position and speed RMSE of the\nPF and RBPF, respectively, with N =300 particles. The RBPF\nand PF outperform the EKF. This is very pronounced during\nthe manoeuvres where the EKF peak dynamic errors are the\nhighest. Figures 6-9 presents results from the PF and RBPF\nwith a different number of particles. The position RMSE of the\nPF increases with N = 100 compared with the case with N =\n500 (Figures 6-7). The RBPF, on the other hand exhibits very\ngood performance with a small number of particles (Figures\n8-9, N = 200) which is his advantage.\nThe trade-off between accuracy and complexity is an im-\nportant issue and for marginalised PFs has been analysed in\n[31]. On average, for these 100 Monte Carlo runs, when the\n0 50 100 150 200 250 300\n0\n10\n20\n30\n40\n50\nTime, [s]\nS\np\nee\nd\n R\nM\nS\nE\n (\nx\n a\nn\nd\n y\n c\no\nm\nb\nin\ned\n),\n [\nm\n\/s\n]\n \n \nEKF\nPF: N=300\nRBPF: N=300\nCRLB\nFig. 5. RMSE of x˙ and y˙ speeds combined of the EKF, PF and RBPF (with\nN = 300) for Nmc = 100 runs.\n0 50 100 150 200 250 300\n0\n100\n200\n300\n400\n500\n600\nTime, [s]\nP\no\nst\nio\nn\n R\nM\nS\nE\n (\nx\n a\nn\nd\n y\n c\no\nm\nb\nin\ned\n),\n [\nm\n]\n N100\n N200\n N300\n N1000\nFig. 6. PF Position RMSE (x and y combined) of the PF with N =\n100, 200, 300 and 1000.\nPF is working with N = 500 particles, and the RBPF with\n200 particles, the average computational time of the RBPF is\nreduced by 60% compared with the PF. If the RBPF operates\nwith 100 particles, the reduction of its computational time\ncompared with the PF with N = 500 is more than 70% with\nreduced accuracy.\nIn conclusion, the developed RBPF has similar accuracy to\nthe PF with respect to the position and speed, with decreased\ncomputational time when we use a small number of particles,\ne.g., N = 200. The PF accuracy is worsen when N < 500.\nFigure 10 shows the accuracy of the algorithms for\ndifferent numbers of particles and the average computational\ntime for one cycle of the algorithms over 100 MC runs. It\ncan be seen from the table, that position RMSEs of the RBPF\nwith N=200 particles is nearly the same as the position RMS\nerrors of the PF with N=300. Thus, a similar performance\ncan be achieved by the RBPF with decreased computational\nresources.\n8 IEEE TRANSACTIONS ON WIRELESS COMMUNICATIONS, VOL. 6, NO. 10, OCTOBER 2007\n0 50 100 150 200 250 300\n0\n5\n10\n15\n20\n25\n30\n35\n40\n45\n50\nTime, [s]\nS\np\nee\nd\n R\nM\nS\nE\n (\nx\n a\nn\nd\n y\n c\no\nm\nb\nin\ned\n),\n [\nm\n\/s\n]\n N100\n N200\n N300 N1000\nFig. 7. RMSE of x˙ and y˙ speeds combined of the PF with N =\n100, 200, 300 and 1000.\n0 50 100 150 200 250 300\n150\n200\n250\n300\n350\nTime, [s]\nP\no\nst\nio\nn\n R\nM\nS\nE\n (\nx\n a\nn\nd\n y\n c\no\nm\nb\nin\ned\n),\n [\nm\n]\nN=100\nN=200\nN=300N=1000\nFig. 8. Position RMSE (x and y combined) of the RBPF with N =\n100, 200, 300, 500 and 1000.\nExample 2. The performance of the mobility tracking al-\ngorithms has been investigated with real RSSIs, collected\nfrom BSs in Glasgow, United Kingdom. The mobile station\nwas a vehicle driving in the city centre. More than 400 BSs\nare available in the area where the car operated. However,\nonly data from the six with the highest RSSIs were provided\nto the algorithms. Figure 11 presents the map of the urban\nenvironment, with the nearest base stations and the trajectory\nof the car (shown augmented in Figure 12). The vehicle\ntrajectory contains both patterns with sharp manoeuvres and\nrectilinear motion, including a stretch at the end where the\nvehicle is parked. Additional information for the road is\nincluded as position constraints in the algorithms. The MC\nalgorithms have shown efficiency in all these conditions. Apart\nfrom the signal strengths, a GPS system collected the actual\npositions of the moving MS, with the sampling period, T =\n0.5 s. Figure 13 shows the actual MS trajectory together with\nthe estimated trajectories and Figure 14 gives the respective\nposition RMSEs.\n0 50 100 150 200 250 300\n10\n15\n20\n25\n30\n35\nTime, [s]\nS\np\nee\nd\n R\nM\nS\nE\n (\nx\n a\nn\nd\n y\n c\no\nm\nb\nin\ned\n),\n [\nm\n\/s\n]\nN=100\nN=200\nN=300\nN=1000\nFig. 9. Speed RMSE (x˙ and y˙ combined) of the RBPF with N =\n100, 200, 300, 500 and 1000.\n \n \n RBPF PF EKF \nN 100 200 300 500 1000 100 200 300 500 1000  \nRMSE pos, [m] 228.5 204.1 193.5 193.2 192.4 303.8 223.2 199.7 184.2 177.0 303.5 \nRMSE speed, \n[m\/s] \n18.2 16.8 15.8 15.7 15.27 17.64 15.5 14.72 14.02 13.75 20.0 \nTime, [s] 0.097 0.191 0.301 0.517 1.07 0.097 0.185 0.284 0.467 0.9994 0.0011 \n \nFig. 10. Table containing RMSEs (averaged over the whole time period) of\nthe MC algorithms for different numbers of particles, from the EKF, and the\nrespective computational time. All results are from 100 MC runs.\nThe robustness of the algorithms to outliers and miss-\ning data can be increased when the measurement error is\nmodeled with a mixture of Gaussians [32]. In this partic-\nular implementation, we present results with one Gaussian\ncomponent, p(vk) = N (µv,σ2v), where the nonzero mean\nµv and the covariance σ2v are calculated from RSSI data\n(µv = (−1.96,−4.66,−3.23)′, σv = diag{3.93, 6.99, 6.20}).\nThe other parameters of the filters are: σw = 0.00015, α =\n0.1, η = 4, Vmax = 10 [m\/s] and M = Mx × My =\n{(0.0, 0.0), (5.5, 0.0), (0.0, 5.5), (0.0,−5.5), (−5.5, 0.0)}.\nThe advantages of the MC methods compared to the EKF\ninclude their ability to easily incorporate constraints (e.g.,\nspeed, road constraints) and to deal efficiently with high level\nnonlinearities.\nThe behaviour of the MC filters is similar in both examples.\nBased on the above results we draw the following conclusions:\ni) The PF is sensitive to changes in the motion of the mobile\nunit. This sensitivity of the PF leads to higher peak-dynamic\nerrors during abrupt manoeuvres. In the presence of a sequence\nof abrupt manoeuvres a divergence of the PF is not excluded\nif it operates with a small number of particles. The probability\nof divergence could be reduced if a high number of particles is\nused which, however, increases the computational complexity.\nii) The RBPF exhibits better accuracy during the periods with\nabrupt changes. The ‘measurements’ at time instant k for the\nKalman filter in the RBPF represent the difference between\nthe estimated and predicted locations of the particles at time\ninstances k− 1 and k, respectively. This is one of the reasons\nMIHAYLOVA et al.: MOBILITY TRACKING IN CELLULAR NETWORKS USING PARTICLE FILTERING 9\n \nFig. 11. The area in Glasgow, United Kingdom, where the vehicle is moving.\nThe nearest BSs, the start and destination positions are indicated on the map.\n \nFig. 12. The vehicle trajectory (from the left to the right side). The start\nand destination positions are indicated on the map.\nfor these particularities of its performance. Both MC filters\noutperform the EKF.\nVIII. CONCLUSIONS\nThis paper has presented two sequential MC techniques\nfor mobility tracking, namely a particle filter and a Rao-\nBlackwellised particle filter. An assessment of their best\nachievable theoretical accuracy has been made. They have\nshown efficient mobility tracking in wireless networks over\nboth synthetic and real received signal strength measurements.\nThe designed filters are compared with the EKF technique\nand their enhanced performance with respect to the EKF is\ndemonstrated over scenarios with abrupt manoeuvres. Advan-\ntages of the RBPF compared with the PF are: i) decreased\ncomputational complexity because it exhibits similar accuracy\nwith smaller number of particles; ii) smaller peak-dynamic\nerrors during abrupt manoeuvres which is very important for\nthe practice. Posterior Crame´r-Rao lower bounds have been\ncalculated that characterise the lower limit for the average\nmean-square error of the state estimates.\n1.94 1.95 1.96 1.97 1.98 1.99 2\nx 10\n4\n1.97\n1.975\n1.98\n1.985\n1.99\n1.995\n2\n2.005\n2.01\nx 10\n4\nx coordinate, [m]\ny\n c\no\no\nrd\nin\nat\ne,\n [\nm\n]\n \n \ntrajectory\nEKF\nPF\nRBPF\nStart\nDestination\nFig. 13. Actual trajectory (from the GPS), and estimated trajectories by the\nEKF, PF and RBPF. N = 1000 particles are used in the MC algorithms.\n0 50 100 150 200 250 300 350 400 450\n0\n10\n20\n30\n40\n50\n60\n70\n80\nTime, [s]\nR\nM\nS\nE\n p\no\nsi\nti\no\nn\n, \n[m\n]\n \n \nEKF\nPF\nRBPF\nFig. 14. Position RMSE of the EKF, PF and RBPF. N = 1000 particles\nare used in the MC algorithms.\nOpen issues for future research include road-map assisted\nmobility tracking of single and multiple mobile units, inves-\ntigation of different measurement models (including varying\nmeasurement time interval) and the fusion of data from\ndifferent modalities.\nIX. ACKNOWLEDGEMENTS\nWe would like also to thank the anonymous reviewers and\nAssociate Editor for their constructive comments and sug-\ngestions. This research is sponsored by the Tracking Cluster\nproject DIFDTC\/CSIPC1\/02 with the UK MOD Data and\nInformation Fusion Defence Technology Centre, the EPSRC\nproject EP\/E027253\/1 and partially by the Bulgarian Science\nFund MI-1506\/05 and Center of Excellence BIS21++, 016639.\nREFERENCES\n[1] “Location is everything: positioning in wireless networks (a special\nissue),” IEEE Signal Processing Mag., vol. 22, no. 4, July 2005.\n10 IEEE TRANSACTIONS ON WIRELESS COMMUNICATIONS, VOL. 6, NO. 10, OCTOBER 2007\n[2] Z. R. Zaidi and B. L. Mark, “Real-time mobility tracking algorithms\nfor cellular networks based on Kalman filtering,” IEEE Trans. Mobile\nComput., vol. 4, no. 2, pp. 195–208, 2005.\n[3] T. Liu, P. Bahl, and I. Chlamtac, “Mobility modeling, location tracking,\nand trajectory prediction in cellular networks,” IEEE J. Sel. Areas\nCommun., vol. 16, no. 6, pp. 922–936, Aug. 1998.\n[4] B. Mark and Z. Zaidi, “Robust mobility tracking for cellular networks,”\nin Proc. IEEE Intl. Communications Conf., May 2002, pp. 445–449.\n[5] H. Kobayashi, S.-Z. Yu, and B. Mark, “An integrated mobility and traffic\nmodel for resource allocation in wireless networks,” in Proc. 3rd ACM\nInternational Workshop on Wireless Mobile Multimedia. ACM Press,\n2000, pp. 39–47.\n[6] S.-Z. Yu and H. Kobayashi, “A hidden semi-Markov model with missing\ndata and multiple observation sequences for mobility tracking,” Signal\nProcessing, vol. 83, no. 2, pp. 235–250, 2003.\n[7] Z. Yang and X. Wang, “Joint mobility tracking and hard handoff in\ncellular networks via sequential Monte Carlo filtering,” in Proc. IEEE\nConf. on Computer Communications (Infocom) 2002.\n[8] Z. R. Zaidi and B. L. Mark, “Mobility estimation based on an autore-\ngressive model,” Electrical Engineering Department of George Mason\nUniversity, USA, Tech. Rep., 2004.\n[9] Y. Bar-Shalom and X. Li, Estimation and Tracking: Principles, Tech-\nniques and Software. Artech House, 1993.\n[10] R. Moose, “An adaptive state estimator solution to the maneuvering\ntarget tracking problem,” IEEE Trans. Automatic Control, vol. 20(3),\npp. 359–362, June 1975.\n[11] R. Singer, “Estimating optimal tracking filter performance for manned\nmaneuvering targets,” IEEE Trans. Aerosp. Electron. Syst., vol. 6, pp.\n473–483, July 1970.\n[12] X. R. Li and V. Jilkov, “A survey of maneuveuvering target tracking,\npart I: Dynamic models,” IEEE Trans. Aerospace Electron. Syst., vol. 39,\nno. 4, pp. 1333–1364, 2003.\n[13] L. Mihaylova, D. Bull, D. Angelova, and N. Canagarajah, “Mobility\ntracking in cellular networks with sequential Monte Carlo filters,” in\nProc. Eight International Conf. on Information Fusion 2005.\n[14] M. Arulampalam, S. Maskell, N. Gordon, and T. Clapp, “A tutorial\non particle filters for online nonlinear\/non-Gaussian Bayesian tracking,”\nIEEE Trans. Signal Processing, vol. 50, no. 2, pp. 174–188, 2002.\n[15] J. Liu and R. Chen, “Sequential Monte Carlo methods for dynamic\nsystems,” J. American Statistical Association, vol. 93, no. 443, pp. 1032–\n1044, 1998.\n[16] E. Wan and R. van der Merwe, The Unscented Kalman Filter, Ch. 7:\nKalman Filtering and Neural Networks, edited by S. Haykin. Wiley\nPublishing, September 2001, pp. 221–280.\n[17] B. Ristic, S. Arulampalam, and N. Gordon, Beyond the Kalman Filter:\nParticle Filters for Tracking Applications. Artech House, 2004.\n[18] G. Casella and C. Robert, “Rao-Blackwellisation of sampling schemes,”\nBiometrica, vol. 83, no. 1, pp. 84–94, 1996.\n[19] P.-J. Nordlund and F. Gustafsson, “Sequential Monte Carlo filtering\ntechniques applied to integrated navigation systems,” in Proc. American\nControl Conf., 2001, pp. 4375–4380.\n[20] F. Gustafsson, F. Gunnarsson, N. Bergman, U. Forssell, J. Jansson,\nR. Karlsson, and P.-J. Nordlund, “Particle filters for positioning, navi-\ngation and tracking,” IEEE Trans. Signal Processing, vol. 50, no. 2, pp.\n425–437, 2002.\n[21] P.-J. Nordlund, Sequential Monte Carlo Filters and Integrated Naviga-\ntion. Licentiate Thesis, Linko¨ping University, Sweden, 2002.\n[22] T. Scho¨n, F. Gustafsson, and P. Nordlund, “Marginalized particle filters\nfor mixed linear\/ nonlinear state-space models,” IEEE Trans. Signal\nProcessing, vol. 53, no. 7, pp. 2279–2289, July 2005.\n[23] S. Maskell, M. Rollason, N. Gordon, and D. Salmond, “Efficient particle\nfiltering for multiple target tracking with application to tracking in\nstructural images,” Image and Video Computing, vol. 21, no. 10, pp.\n931–939, 2003.\n[24] R. Chen and J. Liu, “Mixture Kalman filters,” J. Royal Stat. Soc. B,\nvol. 62, pp. 493–508, 2000.\n[25] A. Doucet, S. Godsill, and C. Andrieu, “On sequential Monte Carlo\nsampling methods for Bayesian filtering,” Statistics and Computing,\nvol. 10, no. 3, pp. 197–208, 2000.\n[26] C. Andrieu and A. Doucet, “Particle filtering for partially observed\nGaussian state-space models,” J. of R. Statist. Soc. B., vol. 64, no. 4,\npp. 827–836, 2002.\n[27] N. Bergman, A. Doucet, and N. Gordon, “Optimal estimation and\nCrame´r-Rao bounds for partial non-Gaussian state space models,” Ann.\nInst. Statist. Math., vol. 53, no. 1, pp. 97–112, 2001.\n[28] B. Ristic and M. Arulampalam, “Tracking a manoeuvring target using\nangle-only measurements: Algorithms and performance,” Signal Pro-\ncessing, vol. 83, no. 6, pp. 1223–1238, 2003.\n[29] P. Tichavsky, C. Muravchik, and A. Nehorai, “Posterior Crame´r-Rao\nbounds for discrete-time nonlinear filtering,” IEEE Trans. Signal Pro-\ncessing, vol. 46, no. 5, pp. 1386–1396, 1998.\n[30] Y. Bar-Shalom, X. R. Li, and T. Kirubarajan, Estimation with Applica-\ntions to Tracking and Navigation. John Wiley and Sons, 2001.\n[31] R. Karlsson, T. Sho¨n, and F. Gustafsson, “Complexity analysis of the\nmarginalized particle filter,” IEEE Trans. Signal Processing, vol. 53,\nno. 11, pp. 4408–4411, Nov. 2005.\n[32] F. Gustafsson and F. Gunnarsson, “Mobile positioning using wireless\nnetworks: Possibilities and fundamental limitations based on available\nwireless network measurements,” IEEE Signal Processing Mag., vol. 22,\nno. 4, pp. 41–53, 2005.\nLyudmila Mihaylova is a Lecturer at the Depart-\nment of Communication Systems, Lancaster Univer-\nsity, United Kingdom. Prior this she was a Research\nFellow with the Signal and Image Processing group\nat the University of Bristol, UK (2004-2006) and had\nvisiting positions with the SYSTEMS group, at the\nUniversity of Ghent, Belgium (2002-2004) and with\nthe Robotics group of Katholieke Universiteit Leu-\nven, Belgium (2000-2002). From 1996 to 2000 she\nwas a Research Assistant at the Bulgarian Academy\nof Science and an Adjunct Assistant Professor at the\nTechnical University of Sofia, Bulgaria. She received M.Sc. degree in Systems\nand Control Engineering (1989), M.Sc. degree in Applied Mathematics and\nInformatics (1991) and her Ph.D. degree in Systems and Control Engineering\n(1996), all from the Technical University of Sofia, Bulgaria. Her interests\nare in the area of nonlinear filtering, statistical signal and image processing,\nautonomous intelligent systems, and sensor data fusion. Dr. Mihaylova is\na member of the IEEE, Signal Processing Society and of the International\nSociety of Information Fusion.\nDonka Angelova received the MS degree in me-\nchanical engineering from the Technical University\nof Sofia, Bulgaria, a Ph.D. degree in Electrical\nEngineering. Currently, she is an Associate Research\nProfessor of the Bulgarian Academy of Sciences\n(Institute for Parallel Information Processing) in\nSofia, Bulgaria. She works as a key researcher and\nis involved in academic and industrial projects (Bul-\ngarian and international) in the areas of multi-target\ntracking, detection and multi-sensor data fusion. The\ncurrent research interests of Dr. Angelova includes\nthe application of sequential Monte Carlo methods to the problems of applied\nnonlinear estimation and filtering and decision making\n \n \nSouroush Honary has background in Satellite Com-\nmunications and GNSS Positioning systems and\nhe was an engineer firstly at DERA Defford, and\nthen at Visteon Corporation (where he was involved\nwithin the design of Navigation Systems and Elec-\ntronic Toll Collection for the German ‘Toll Collect’\nproject). Since leaving Visteon Corporation to move\nto HW Communications Ltd in 2002, Souroush\nhas applied extensive research into methods for\novercoming vulnerabilities within GNSS based so-\nlutions. More recently, his research has been more\nfocused upon ubiquitous positioning by utilising surrounding communication\ninfrastructures. Dr Honary currently has the lead role for the integration and\nvalidation of advanced hybrid positioning within EU framework 6 project\nDAIDALOS, where significant advancements to A-GPS and GSM\/802.11\npositioning are in progress. His key responsibilities within this EU Framework\n6 project include: Development of context aware location determination tech-\nniques MANET Multi-Hop positioning which will enable Mobile Terminals\nto make use of the positioning capabilities of other Mobile Terminals in close\nproximity, and Work for multi-layered hybrid mobile positioning protocols.\nMIHAYLOVA et al.: MOBILITY TRACKING IN CELLULAR NETWORKS USING PARTICLE FILTERING 11\nDavid Bull is Professor of Signal Processing and\nHead of the Electrical and Electronic Engineering\nDepartment at the University of Bristol, United\nKingdom. Prior to his current appointment he has\nbeen a Systems Engineer at Rolls Royce and sub-\nsequently a Lecturer at Cardiff University. He leads\nthe Signal Processing activities within the Centre\nfor Communications Research where he is Deputy\nDirector. He has been a member of the UK Foresight\nPanel and the Steering Group for the DTI\/EPSRC\nLINK programme in Broadcast Technology and is\ncurrently on the EPSRC Peer Review College. He is a past director of the\nVCE in Digital Broadcasting and Multimedia Technology and is currently\nChairman and Technical Director of ProVision Communication Technologies\nLtd., specialising in wireless multimedia communications. David Bull has\nworked widely in the fields of 1 and 2-D signal processing and has published\nover 250 papers, various articles and two books. He has won two IEE Premium\nawards for this work. His current research is focused on the problems of\nimage and video communications for both low bit rate wireless, internet and\nbroadcast applications. In particular he is working on error resilient source\ncoding, linear and non-linear filterbanks, scalable coding methods, motion\nestimation, data fusion and architectural optimisation.\nNishan Canagarajah is Professor of Multimedia\nSignal Processing at Bristol, United Kingdom. Prior\nto this he was an Research Assistant and lecturer at\nBristol investigating digital signal processing (DSP)\naspects of mobile radio receivers. He has BA (Hons)\nand a Ph.D. in DSP Techniques for Speech Enhance-\nment both from the University of Cambridge. His\nresearch interests include image and video coding,\nimage segmentation, content based video retrieval,\n3D video, image fusion and the application of signal\nprocessing to audio and medical electronics. He is\nwidely supported in these areas by industry, EU and the EPSRC. He has\nbeen involved in a number of FP5 and FP6 projects where the team has been\ndeveloping novel image\/video processing algorithms. He has published more\nthan 150 papers and two books. He is a member of the EPSRC College.\nBranko Ristic received a B.Eng. degree from the\nUniversity of Novi Sad (Serbia) in 1984, and his\nM.Sc. degree from Belgrade University (Serbia) in\n1991, both in Electrical Engineering. He received\na PhD in Signal Processing from Queensland Uni-\nversity of Technology (Australia) in 1995. Between\n1984 and 1994 he held various reserach\/engineering\npositions at IBK Institute Vinca (Belgrade), Queens-\nland University, and QUT in Brisbane. During 1995\nhe was a Senior DSP engineer in GEC Marconi\nSystems (Sydney) and since 1996 he is a senior\nresearch scientist with DSTO, Australia. During 2003\/04 he spent a year\nin IRIDIA (Universite´ libre de Bruxelles, Belgium) on a study leave. His\nmain research interests include target tracking, sensor fusion, belief function\ntheory, non-linear filtering. He published over 80 technical papers and co-\nauthored the book Beyond the Kalman filter, Artech House, 2004. He co-\ndeveloped and currently lectures a post-graduate course “Multi-Sensor Data\nFusion” at the University of Adelaide. He served on technical committees of\nseveral international conferences and received twice the best paper award at\ninternational conferences.\n"}