{"doi":"10.1063\/1.2354473","coreId":"66058","oai":"oai:dro.dur.ac.uk.OAI2:3420","identifiers":["oai:dro.dur.ac.uk.OAI2:3420","10.1063\/1.2354473"],"title":"Polarized optical spectroscopy applied to investigate two poly(phenylene-vinylene) polymers with different side chain structures.","authors":["Palsson, L-O.","Vaughan, H. L.","Monkman, A. P."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-10-01","abstract":"Two related poly(phenylene-vinylene) (PPV) light-emitting polymers have been investigated by means of polarized optical spectroscopy. The purpose of the investigation was to investigate the nature of the interactions in thin films and to examine what impact the difference in side chain structure and molecular weight in poly(2[prime]-methoxy-5-2-ethyl-hexoxy)-1,4-phenylene vinylene (MEH-PPV) and poly(2-(3[prime],7[prime]-dimethyloctyloxy)-5-methoxy-1,4-phenylene-vinylene) (OC1C10-PPV) has on the electronic and optical properties of the two polymers. Aligning the polymers by dispersing them in anisotropic solvents and stretched films shows that the side chains have an impact on the relative orientations of the transition dipole moments. In anisotropic solvents the linear dichroism is larger for MEH-PPV than for the related polymer OC1C10-PPV, while in stretched films the opposite situation prevails. A lower polarization of the luminescence from OC1C10-PPV, relative to MEH-PPV, was also obtained independent of alignment medium used. The data therefore suggest that while mechanical stretching may align the OC1C10-PPV to a greater degree, the emitting species is distinct from the absorbing species. The circular dichroism (CD) spectra of both polymers undergo dramatic changes when the liquid phase and the solid state (film) are compared. The solution CD spectra shows no evidence of interchain interactions; instead the spectra of both systems indicate a helical conformation of the polymers. The CD spectra of films are dramatically different with the strong Cotton effect being observed. This points to the formation of an aggregate in the film, with an associated ground state interaction, an interchain species such as a physical dimer, or a more complex higher aggregate","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66058.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3420\/1\/3420.pdf","pdfHashValue":"7f249f1cc2eec10d904edc6663441a36fb534d92","publisher":"American Institute of Physics","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:3420<\/identifier><datestamp>\n      2014-06-06T13:35:44Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Polarized optical spectroscopy applied to investigate two poly(phenylene-vinylene) polymers with different side chain structures.<\/dc:title><dc:creator>\n        Palsson, L-O.<\/dc:creator><dc:creator>\n        Vaughan, H. L.<\/dc:creator><dc:creator>\n        Monkman, A. P.<\/dc:creator><dc:description>\n        Two related poly(phenylene-vinylene) (PPV) light-emitting polymers have been investigated by means of polarized optical spectroscopy. The purpose of the investigation was to investigate the nature of the interactions in thin films and to examine what impact the difference in side chain structure and molecular weight in poly(2[prime]-methoxy-5-2-ethyl-hexoxy)-1,4-phenylene vinylene (MEH-PPV) and poly(2-(3[prime],7[prime]-dimethyloctyloxy)-5-methoxy-1,4-phenylene-vinylene) (OC1C10-PPV) has on the electronic and optical properties of the two polymers. Aligning the polymers by dispersing them in anisotropic solvents and stretched films shows that the side chains have an impact on the relative orientations of the transition dipole moments. In anisotropic solvents the linear dichroism is larger for MEH-PPV than for the related polymer OC1C10-PPV, while in stretched films the opposite situation prevails. A lower polarization of the luminescence from OC1C10-PPV, relative to MEH-PPV, was also obtained independent of alignment medium used. The data therefore suggest that while mechanical stretching may align the OC1C10-PPV to a greater degree, the emitting species is distinct from the absorbing species. The circular dichroism (CD) spectra of both polymers undergo dramatic changes when the liquid phase and the solid state (film) are compared. The solution CD spectra shows no evidence of interchain interactions; instead the spectra of both systems indicate a helical conformation of the polymers. The CD spectra of films are dramatically different with the strong Cotton effect being observed. This points to the formation of an aggregate in the film, with an associated ground state interaction, an interchain species such as a physical dimer, or a more complex higher aggregate.<\/dc:description><dc:publisher>\n        American Institute of Physics<\/dc:publisher><dc:source>\n        Journal of chemical physics, 2006, Vol.125, pp.164701-164707 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2006-10-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3420<\/dc:identifier><dc:identifier>\n        issn:0021-9606<\/dc:identifier><dc:identifier>\n        issn: 1089-7690<\/dc:identifier><dc:identifier>\n        doi:10.1063\/1.2354473<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3420\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1063\/1.2354473<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3420\/1\/3420.pdf<\/dc:identifier><dc:rights>\n        © 2006 American Institute of Physics. This article may be downloaded for personal use only. Any other use requires prior permission of the author and the American Institute of Physics. The following article appeared in Palsson, L-O., Vaughan, H. L. and Monkman, A. P. (2006) Polarized optical spectroscopy applied to investigate two poly(phenylene-vinylene) polymers with different side chain structures, Journal of Chemical Physics, 125, 164701-164707 and may be found at http:\/\/dx.doi.org\/10.1063\/1.2354473.\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0021-9606"," 1089-7690","issn:0021-9606","issn: 1089-7690"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n26 April 2011\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nPalsson, L-O. and Vaughan, H. L. and Monkman, A. P. (2006) ’Polarized optical spectroscopy applied to\ninvestigate two poly(phenylene-vinylene) polymers with different side chain structures.’, Journal of chemical\nphysics., 125 . pp. 164701-164707.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1063\/1.2354473\nPublisher’s copyright statement:\nCopyright (2006) American Institute of Physics. This article may be downloaded for personal use only. Any other use\nrequires prior permission of the author and the American Institute of Physics. Palsson, L-O. and Vaughan, H. L. and\nMonkman, A. P. (2006) ’Polarized optical spectroscopy applied to investigate two poly(phenylene-vinylene) polymers\nwith different side chain structures.’, Journal of chemical physics., 125 . pp. 164701-164707. and may be found at\nhttp:\/\/dx.doi.org\/10.1063\/1.2354473\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nPolarized optical spectroscopy applied to investigate two\npoly„phenylene-vinylene… polymers with different side chain structures\nLars-Olof Pålsson,a\u0001 Helen L. Vaughan, and Andrew P. Monkman\nPhotonics Materials Institute, Department of Physics, Durham University, South Road,\nDH1 3LE Durham, United Kingdom\n\u0001Received 6 December 2006; accepted 18 August 2006; published online 23 October 2006\u0002\nTwo related poly\u0001phenylene-vinylene\u0002 \u0001PPV\u0002 light-emitting polymers have been investigated\nby means of polarized optical spectroscopy. The purpose of the investigation was to investigate\nthe nature of the interactions in thin films and to examine what impact the difference in side\nchain structure and molecular weight in poly\u00012\u0001-methoxy-5-2-ethyl-hexoxy\u0002-1,4-phenylene\nvinylene \u0001MEH-PPV\u0002 and poly\u00012-\u00013\u0001 ,7\u0001-dimethyloctyloxy\u0002-5-methoxy-1,4-phenylene-vinylene\u0002\n\u0001OC1C10-PPV\u0002 has on the electronic and optical properties of the two polymers. Aligning the\npolymers by dispersing them in anisotropic solvents and stretched films shows that the side chains\nhave an impact on the relative orientations of the transition dipole moments. In anisotropic solvents\nthe linear dichroism is larger for MEH-PPV than for the related polymer OC1C10-PPV, while in\nstretched films the opposite situation prevails. A lower polarization of the luminescence from\nOC1C10-PPV, relative to MEH-PPV, was also obtained independent of alignment medium used. The\ndata therefore suggest that while mechanical stretching may align the OC1C10-PPV to a greater\ndegree, the emitting species is distinct from the absorbing species. The circular dichroism \u0001CD\u0002\nspectra of both polymers undergo dramatic changes when the liquid phase and the solid state \u0001film\u0002\nare compared. The solution CD spectra shows no evidence of interchain interactions; instead the\nspectra of both systems indicate a helical conformation of the polymers. The CD spectra of films are\ndramatically different with the strong Cotton effect being observed. This points to the formation of\nan aggregate in the film, with an associated ground state interaction, an interchain species such as\na physical dimer, or a more complex higher aggregate. © 2006 American Institute of Physics.\n\u0003DOI: 10.1063\/1.2354473\u0004\nINTRODUCTION\nAn important and very attractive feature of organic light-\nemitting polymers \u0001LEPs\u0002 is the possibility of tuning the\nelectronic properties of the system. A way to achieve this is\nthrough the introduction and modification of the side chains\/\nfunctional group structure, which in turn results in an impact\non the optical and transport properties. This is best exempli-\nfied with the various LEPs within the poly\u0001phenylene-\nvinylene\u0002 \u0001PPV\u00021–3 and the polyfluorenes4–6 that have been\nsynthesized to date. With structural variations within these\ntwo classes of polymers, markedly different transport prop-\nerties have been observed.7–12 In addition, it should also be\nmentioned that side chains play an important role in increas-\ning the solubility and thus ease the processing of the LEP,\nwhich is significant in the engineering process of the device.\nThe best example here is the PPV system for which the solu-\nbility was improved significantly by the addition of side\nchains\/functional groups.2,13,14\nThe key objective has therefore been to enable the con-\ntrol of the interactions, but in this context it is of utmost\nimportance prior to this to first understand the character of\nthe interactions. There are several different proposals regard-\ning the nature of the interactions in the solid state, i.e., thin\nfilms. These include polaron pairs and excimers, but also\naggregates with an associated ground state interaction\n\u0001physical dimers\u0002 have been considered.15–22 The basis for\nthe physical aggregate is a sufficiently strong interchain in-\nteraction predominantly via a dipole-dipole interaction. If\nthis interaction is strong enough, there will be a significant\nimpact on the electronic transition \u00011Ag→2Bu\u0002 leading to a\nDavydov splitting of the absorption band.23 In some cases\nthis splitting can be unraveled through the appearance of a\nnew absorption band as was observed in Refs. 24 and 25. In\ngeneral it is, however, very difficult to study and distinguish\nthese new bands using the linear absorption spectra of com-\nplex systems such as the LEPs. This is due to the fact that\nthere is extensive inhomogeneous broadening of the elec-\ntronic transition resulting in relatively broad and featureless\nabsorption bands. It is therefore not uncommon that the\nDavydov splitting is hidden under the broad and structureless\nprofile.\nAn alternative approach is therefore needed, and a pow-\nerful method in this context is to probe the absorption spectra\nusing circular dichroism \u0001CD\u0002 spectroscopy. For a review on\nCD spectroscopy and related techniques we refer to the\ntexts.26,27 CD spectroscopy has been successfully used in ex-\namining the light-harvesting complexes of photosynthetic\nsystems of plants and bacteria. For instance, the organization\nand relative orientation of the chromophores \u0001bacteria chlo-\na\u0002Author to whom correspondence should be addressed. Fax: \u000144-\u00010\u0002191-\n3343585. Electronic mail: lars-olof.palsson@durham.ac.uk\nTHE JOURNAL OF CHEMICAL PHYSICS 125, 164701 \u00012006\u0002\n0021-9606\/2006\/125\u000216\u0001\/164701\/7\/$23.00 © 2006 American Institute of Physics125, 164701-1\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nrophylls a and b\u0002 in the bacterial light-harvesting complex\nLH 2 was determined using a combination of CD and lin-\nearly polarized spectroscopies.28 In addition, experimental\nspectra have been analyzed using a framework of exciton\ntheory, resulting in a detailed understanding of the optical\nproperties of these systems.29,30 CD spectroscopy on LEPs\nhas also been used in a few cases. These studies have indi-\ncated strong interactions and exciton delocalization, mainly\nin the solid state \u0001films\u0002.31–34\nThe PPV polymer was the first material used that suc-\ncessfully produced electroluminescence in thin films.1 The\nPPV system has very intriguing properties, for instance, an\nunusually high nonlinear response, and the system has ac-\ncordingly been studied extensively within a range of experi-\nmental optical techniques, among them are site-selection lu-\nminescence and electroabsorption, etc.35–40 However, there\nare still unresolved questions regarding the nature of the in-\nteractions, particularly the interchain type, and the strength\nof the interactions. With this in mind two related PPV LEPs\nwere investigated using CD spectroscopy in combination\nwith polarized linear spectroscopy: linear dichroism \u0001LD\u0002\nand polarized luminescence \u0001PL\u0002. We observed that the side\nchain structure has a clear impact on the alignment of the\npolymer system. The most significant result is that CD spec-\ntroscopy clearly indicates that the interchain interactions lead\nto the formation of a physical dimer with an associated\nground state interaction.\nMATERIALS AND METHODS\nThe LEPs were obtained from Covion and investi-\ngated without further modifications. Figure 1 shows\nthe structures of the two materials. The molecular\nweights of these two polymers are markedly different; for\npoly\u00012\u0001-methoxy-5-2-ethyl-hexoxy\u0002-1,4-phenylene vinylene\n\u0001MEH-PPV\u0002 the upper limit is \u0005300 000 g\/mol, while for\npoly\u00012-\u00013\u0001 ,7\u0001-dimethyloctyloxy\u0002-5-methoxy-1,4-phenylene-\nvinylene\u0002 \u0001OC1C10-PPV\u0002 the molecular weight can be as\nhigh as 1 900 000 which corresponds to \u00057000 repeat\nunits.41,42 Dry powder was dissolved under stirring in tolu-\nene. For films the concentration was \u00055 mg\/ml, and films\nwere made by spin coating at 1500 rpm\/30 s deposition on a\nglass plate. For linearly polarized spectroscopy, the LEPs\nwere oriented using an anisotropic solvent or stretched poly-\nethylene \u0001PE\u0002 films. The anisotropic solvent used was the\nnematic liquid crystal \u0001LC\u0002 BL001 \u0001Merck Pool Ltd.\u0002, and\nthe LEP\/LC mixture \u0001\u00051% % w\/w\u0002 \u0001stirred for \u000524 h\u0002 was\nfilled into cells with antiparallel alignment layers by capil-\nlary force. The PE films were prepared by a method adapted\nfrom a previous work.35 80 mg of spectrophotometric grade\nPE \u0001Aldrich\u0002 was added to 85 g of fresh o-xylene \u0001Aldrich\u0002\nin a conical flask left uncovered so any water in the solution\ncould evaporate. This mixture was heated to \u0005120 °C in an\noil bath and stirred vigorously until the PE had dissolved \u0001\n\u00051 h\u0002. The temperature was reduced to \u000590 °C, and a so-\nlution of o-xylene containing 4 mg of polymer was added\nand allowed to mix thoroughly \u0001\u000510 min\u0002. The hot solution\nwas poured into clean glass petri dishes cooled by an ice-\nwater bath and upon cooling formed either a gelatinous or\ncrystalline film. Strips of the film were carefully heated \u0001to\n\u0005100 °C\u0002 over the edge of a hot plate and manually\nstretched to more than ten times their original length. The\nresulting stretched film had good optical properties.\nAbsorption spectra were measured using a Lambda 19\nPerkin Elmer spectrophotometer, and PL was measured with\na Jobin Yvon Horiba Fluoromax 2 equipped with Glan-\nThomson polarizers. Polarized luminescence emission spec-\ntra \u0001Fijk\u0002 were obtained, where the notations i, j, and k de-\nnote two different orientation directions: V \u0001vertical\u0002 or H\n\u0001horizontal\u0002 as follows: i is the polarization of the excitation,\nj is the orientation of the alignment direction, and k is the\nemission polarization. The CD and LD measurements were\nperformed on a home built system. Monochromated light\n\u0001Bentham monochromator\u0002 from a tungsten halogen lamp\n\u0001ORIEL\u0002, linearly polarized by a Glan-Thomson polarizer,\nwas used as the probe light in a transmission experiment.\nThe modulation of the polarization of the light was achieved\nwith a photoelastic modulator \u0001Hinds, PEM\u0002. The linearly\npolarized light for LD was accordingly produced through a\nhalf wave \u0001\u0002 \/2\u0002 modulation, and the circularly polarized\nlight for CD was produced through a quarter wave \u0001\u0002 \/4\u0002\nmodulation. The transmitted light was detected using a home\nbuilt amplified photodiode detector. Transmission spectra\nwere subsequently obtained by normalization to a blank\nlamp spectrum. The signal was detected using a lock-in am-\nplifier \u0001Ortec 5210\u0002 through the well-known field modulation\nlock-in technique. The experimental setup was controlled by\na personal computer \u0001PC\u0002 through the general purpose inter-\nface bus \u0001GPIB\u0002 interface with a LABVIEW 7.0 program. The\ntransmission spectra were subsequently converted to absor-\nbance spectra in accordance with the Beer-Lambert law.\nFIG. 1. The two LEPs used in this study. Polymer \u0001a\u0002 is MEH-PPV while\npolymer \u0001b\u0002 is OC1C10-PPV.\n164701-2 Pålsson, Vaughan, and Monkman J. Chem. Phys. 125, 164701 \u00022006\u0001\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nRESULTS AND DISCUSSION\nLinear dichroism and polarized luminescence\nThe LD of the two LEPs in anisotropic host showed a\nclear difference in magnitude as is evident from Figs. 2 and\n3. The LD is given by the difference in absorption parallel\nand perpendicular to an alignment direction,\nLD = A\u0006 − A\u0001. \u00011\u0002\nAn LD\u00030 means accordingly that the transition dipole mo-\nments are aligned along the orientation direction rather than\nperpendicular to it. The data show that when normalized to\nthe isotropic absorption, the LD\u00030 of MEH-PPV is clearly\nlarger than that which was obtained for OC1C10-PPV \u0001Fig. 2\nand 3\u0002. From the LD data an average orientation angle \u0004 of\nthe transition dipole to the alignment direction can be calcu-\nlated using the relation43\n\u0007 12 \u00013 cos2 \u0004 − 1\u0002\b\u0005 = LDAiso , \u00012\u0002\nwhere Aiso is the isotropic absorption, Aiso= \u00011\/3\u0002\u0001A\u0006+2A\u0001\u0002.\n\u0005 is an order parameter of the medium, in this case the\nanisotropic solvent. For nematic LCs it has been demon-\nstrated that \u0005 takes a range of values, 0.5\u0006\u0005\u00060.7.44 Using\na value of \u0005=0.7 for the anisotropic solvent we obtain the\nupper limit of the orientation, and for MEH-PPV an angle of\n\u0004=25° is obtained, while for OC1C10-PPV, we obtained \u0004\n=41°. The difference in orientation angle must be due to the\ndifference in side chain structure between the two LEPs, and\nthere can be two possible explanations for this difference.\nFirstly, the more extended side chain in OC1C10-PPV has an\nimpact on the overall alignment of the polymer backbone. It\nis not unlikely that the more extended side chain in\nOC1C10-PPV can have isomers, which in turn can affect\nchain packing and alignment. Secondly, it is possible that the\nside chain has an impact on the charge distributions and thus\naffects the direction of the transition dipole moment although\nwe regard this as a less likely explanation of the observed\neffect. An impact on the alignment due to the molecular\nweight is an unlikely factor in this context. The impact on the\ndifference in molecular weight is mainly seen in the large\ndifference in the number of repeat units of these two LEPs.\nFor both systems of this study, this number is much larger\nthan the spectroscopic unit; it is therefore unlikely that the\nmolecular weight has an impact on the optical properties.\nFigures 2 and 3 also show the PL of the LEPs dispersed\nin anisotropic solvents. For both systems there clearly is a\npolarization of the emission. A measure of the degree of\nluminescence polarization can be appreciated from the di-\nchroic ratio of the two PL components, FVVV \/GFVVH, where\nG is an instrumental correction factor, G=FHVV \/FHVH.45 Cal-\nculating the luminescence anisotropy for ordered systems is\nnot possible as the value of the denominator, FVVV\n+2GFVVH, does not reflect the total intensity, which in turn\nmakes normalization impossible.45,46 The dichroic ratio for\nthe LEPs dispersed in the LCs is calculated at the lumines-\ncence maximum \u0001575 nm\u0002, returning a value of 2.55 for\nMEH-PPV, while OC1C10-PPV\/BL001 returned a value of\n1.45. In comparing the dichroic ratio of the two LEP sys-\ntems, we note that the data are in conjunction with the LD\ndata which also revealed a higher degree of alignment rela-\ntive to the orientation direction for MEH-PPV as compared\nto OC1C10-PPV. A control measurement comparing FVVH to\nFVHV was also performed and this revealed that FVVH\n\u0003FVHV \u0001data not shown\u0002. From this observation we conclude\nthat the loss in polarization is not due to absorbing and emit-\nting dipoles being nonparallel, even when alignment is good.\nInstead it must be due to electronic energy transfer to a small\npopulation of emitting sites in the reddest part of the inho-\nmogeneous distribution function.\nFigures 4 and 5 show the result of stretched PE films,\ndoped with the LEP systems. As the film is manually\nstretched the long chains of the inert PE align along the\nstretching direction, so do the LEP chains.26 This is indepen-\ndent of an internal interaction, whereas alignment in LCs is\ngoverned by a guest-host interaction. The LD of both LEPs\nFIG. 2. Absorption, luminescence, and LD for MEH-PPV in the anisotropic\nhost, the LC mixture BL001. For the luminescence the excitation wave-\nlength is 490 nm.\nFIG. 3. Absorption, luminescence, and LD for OC1C10-PPV in the aniso-\ntropic host, the LC mixture BL001. For the luminescence the excitation\nwavelength is 490 nm. See text for details.\n164701-3 Polarized optical spectroscopy of PPV polymers J. Chem. Phys. 125, 164701 \u00022006\u0001\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nin PE films had a magnitude larger than that which was ob-\nserved in the anisotropic solvent, which in turn points to a\nbetter alignment. The trend was different though, with\nOC1C10-PPV showing a slightly higher LD as compared to\nMEH-PPV. This result was supported by polarized excitation\nspectra of both LEPs \u0001data not shown\u0002 which showed a\nhigher polarization for OC1C10-PPV. The data therefore sug-\ngest that for mechanical alignment, the side chain structure\nof OC1C10-PPV is possibly more flexible and can be more\neasily aligned along the polymer backbone. It can be seen in\nFigs. 4 and 5 that the degree of polarization of the lumines-\ncence is higher in both LEP PE films as compared to the\nanisotropic solvent. As was observed in the anisotropic host,\nthe polarization of the luminescence is larger for MEH-\nPPV\/PE films as compared to OC1C10-PPV\/PE films as\njudged by the dichroic ratios. For MEH-PPV\/PE film we\nobtained a dichroic ratio of 9.45, while for OC1C10-PPV\/PE\nfilm the returned value was 5.75.\nFinally we note that all LD spectra \u0001Figs. 2–5\u0002 follow the\nabsorption profiles quite well in the red tail of the LD spec-\ntra. Dividing the LD with the isotropic absorption also re-\nsulted in a wavelength dependent profile resembling the ob-\nserved LD \u0001data not shown\u0002. This fact points to a more\nrandom orientation of the absorbing species with the lowest\nenergies in the broad inhomogeneous distribution function.\nFor the opposite to prevail, no difference on the orientation\nof the dipoles in the red tail of the absorption band, a wave-\nlength independent plateau is expected,47 which is clearly not\nobserved in this study. It is very likely that these low energy\nsites also are responsible for the luminescence and that these\nare in the receiving end of an electronic energy transfer pro-\ncess. The slightly less polarized luminescence of these spe-\ncies is therefore consistent with the lower polarization at the\ntail of the LD spectra.\nCircular dichroism\nCD is the difference between left hand and right hand\ncircularly polarized light. The result is accordingly an optical\nrotation which is quantified as a rotational strength and is in\nturn related to an experimental observable. Via the Rosenfeld\nequation there is a formalism that connects the microscopic\nproperty to the experimental observable.26,27 The Rosenfeld\nequation has various forms, and we refer to the texts cited\nhere for more detailed reading.26,27 In this context the rel-\nevant system is the physical dimer with an associated ground\nstate interaction. This interaction is described by two inter-\nacting dipoles \u0001a ,b\u0002 and is given by,\nVab\u0001R\u0002 =\n\u0007¯a · \u0007¯b\nR3\n−\n3\u0001\u0007¯a · R¯ \u0002\u0001\u0007¯b · R\u0002\nR5\n. \u00013\u0002\nIf the interaction is sufficiently strong the result will be a\nsplit of the energy levels, i.e., a Davydov splitting.23 For the\nsimple case of a homodimer these energies are E±\n=Ea,b±Vab \/2. The rotational strength is directly affected by\nthe dipole-dipole interaction, and it can be shown that the\nrotational strength of ground to excited state transition for a\ndegenerate dimer is 26\nRge \b −\nEaEb\n\t\u0001Ea\n2\n− Eb\n2\u0002\n\t \u0007¯a · \u0007¯b − 3\u0001\u0007¯a · R¯ab\u0002\u0001\u0007¯b · R¯ab\u0002\nRab\n2 \n\n\n\u000b\u0007¯a\u0007¯b · R¯ab\f . \u00014\u0002\nAccording to this formalism the measured spectrum will take\nthe shape of a bisignate transition with the opposite sign of\neach component, which in turn will depend upon the relative\norientation and interaction of the two dipoles. We remark\nthat while this formalism strictly applies to a heterodimer,\nthe interchain species could clearly meet this criterion. There\nis significant inhomogeneous broadening in these polymer\nsystems to justify this assumption. In addition, at the point of\nthe strongest interactions chain deformations could clearly\naffect the site energies.\nFigures 6 and 7 show the CD spectra of the two LEPs\ndispersed in an isotropic solvent. Both spectra have similar\nshapes with an asymmetric and weak Cotton effect in the\n450–600 nm region. In both systems the high energy com-\nponent has a stronger absorption and this could in principle\nbe due to an exciton splitting, presumably then from an in-\nFIG. 4. Absorption \u0001dotted line\u0002 and LD \u0001solid line\u0002 for stretched PE films.\nNormalized luminescence at \u0002exc=525 nm from MEH-PPV in a stretched\nPE film. See text for details.\nFIG. 5. Absorption \u0001dotted line\u0002 and LD \u0001solid line\u0002 for stretched PE films.\nNormalized luminescence at \u0002exc=525 nm from OC1C10-PPV in a stretched\nPE film. See text for details.\n164701-4 Pålsson, Vaughan, and Monkman J. Chem. Phys. 125, 164701 \u00022006\u0001\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\ntrachain aggregate. The impact on the CD spectra of a poly-\nthiophene due the medium was investigated by Langeveld-\nVoss et al.,31 and the result of their study is that a CD\nspectrum with a strong bisignate Cotton effect only is ob-\ntained for what is considered to be a poor solvent \u0001mixture\u0002\nfor this particular polymer, and Oda et al.32 made the same\nobservations for a polyfluorene. Both these authors therefore\nconcluded that the medium had forced the polymers into an\naggregated state.\nRegarding the observations in this study, an alternative\nexplanation for the CD spectra in Figs. 6 and 7 is instead that\nthe shape of the spectra is due to the conformation of the\npolymer rather then being indicative of exciton splitting. The\nmain basis for this conclusion is the weak bisignate Cotton\neffect which makes it difficult to attribute the CD spectra of\nthe solutions to an aggregated state. Using a theoretical ap-\nproach it can be shown that a CD spectrum with a positive or\nnegative signal originates from a helical conformation of the\npolymer system.27 For instance, Sato et al. have examined\npolysilenes in solution and obtained CD spectra with a posi-\ntive signal only, thus attributing their observation to the he-\nlical conformation of the system.48 We can also refer to stud-\nies using x-ray scattering techniques applied to some LEP\nsystems showing that the polymer chain adapts a helical\nconformation.49 In addition, this hypothesis was backed up\nby density functional theory calculations on a semiconduct-\ning polymer.50\nFurthermore, in a study on oriented LEPs \u0001MEH-PPV\u0002\nin a nanoscale architecture it was observed that the electronic\nenergy transfer is more efficient between individual polymer\nchains then along the chain.51 As the rate of energy transfer\nis directly related to the coupling strength52 the conclusion of\nthat study is that interchain interactions are stronger than the\nintrachain interactions. This could in turn explain the ab-\nsence of the bisignate Cotton effect \u0001indicative of a dipole-\ndipole interaction\u0002 in the CD spectra of the LEPs in the iso-\ntropic solvent \u0001Figs. 6 and 7\u0002. Hence, we argue that the\nhelical conformation of the polymer is the dominating factor\nin the shape of the CD spectra obtained for the LEPs in the\nisotropic solvent \u0001Figs. 6 and 7\u0002. In the same context these\ndata also suggest that electronic energy transfer between\nchain segments in solution is not as efficient as in the solid\nstate, in agreement with what was observed in Ref. 51.\nThe CD spectra of the films are dramatically different in\ncomparison to the solutions as can be seen in Figs. 8 and 9.\nThe change in shape of the CD must accordingly be attrib-\nuted to the formation of an interchain aggregate in accor-\ndance with what was observed by Langeveld-Voss et al.31\nand Oda et al.32 In this scenario we assume that the 2Bu state\nhas been split into the two states given by the linear combi-\nnation with energy eigenvalues E±=E2Bu ±Vab \/2. As for the\nsymmetry of the system, we note that the PPV systems can in\nprinciple be described by C2h symmetry,36,53 although this\nassumes an ideal conformation of the polymer chain. The\nreality is, however, different; experimental data suggest that\nstructural disorder breaks up the symmetry.53 For the dimer,\nat the point of closest contact, the situation may be different.\nThe local symmetry at this point could clearly be described\nby a C2h symmetry and in that case the transitions \u00011Ag\n→2Bu+ ,2Bu−\u0002 would be allowed by symmetry. The observed\nCD spectra of Figs. 8 and 9 suggest that this is indeed the\ncase.\nFIG. 6. Circular dichorism \u0001solid line\u0002 and absorption \u0001dot\u0002 for MEH-PPV\nin an isotropic solvent.\nFIG. 7. Circular dichorism \u0001solid line\u0002 and absorption \u0001dot\u0002 for OC1C10-PPV\nin an isotropic solvent.\nFIG. 8. Circular dichorism \u0001solid line\u0002 and absorption \u0001dot\u0002 of the MEH-\nPPV spin coated film.\n164701-5 Polarized optical spectroscopy of PPV polymers J. Chem. Phys. 125, 164701 \u00022006\u0001\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nWhile it would be reasonable to assume that a physical\ndimer is formed between two adjacent polymer chains, at the\npoint of the closest contact providing a maximal strength in\nthe dipole-dipole interaction, the CD spectra of the two LEP\nsystems show a complexity beyond what would be expected\nof the molecular hetero\/homodimer. In such a case one\nwould expect that the linear absorption spectrum would con-\nvert into a bisignate Cotton effect of the CD spectrum. It is\ntherefore not unlikely that the obtained CD spectra, in fact,\nare due to aggregates of different coupling strengths. Particu-\nlarly, OC1C10-PPV shows a complexity in its CD spectrum\nthat suggests that this might be the case.\nWe note that in following the CD spectra from long\nwavelengths towards shorter ones, the progression of the\nCotton effect is different as compared to what has been ob-\nserved for polythiophene polymers and polyfluorene.32–34\nHowever, for the polyfluorene system it was concluded that\nintrachain interactions as well as interchain interactions con-\ntribute to the CD signal which in turn complicates the inter-\npretation of the data.32 As the CD signal is sensitive to the\ndipole-dipole interaction, it will also be affected by the rela-\ntive \u0001mutual\u0002 orientation of the interaction dipoles. This\nwould, in principle, imply that the relative orientations of the\ninteraction species are different in this case. This impact will\nappear in the spectra through the progression of the Cotton\neffect.26,27 If the rotational strength, in going from long\nwavelength regions towards shorter ones, has a progression\nR\u000b0→R\u00030 it would mean that the interacting dipoles have\na mutual orientation angle less than 90° \u0001with the precondi-\ntion that the dipoles are coplanar\u0002.26,27 We note that both\npolymers follow this progression for the red part of the ab-\nsorption spectrum or wavelengths in the region of\n650–500 nm \u0001as seen in Figs. 8 and 9\u0002. This accordingly\nsuggests that the dipole moments are oriented in a coplanar\nclose to parallel fashion. With respect to the dipole-dipole\ninteraction \u0003Eq. \u00013\u0002\u0004 such a configuration is not the optimal\none. The most favorable case is a head-to-tail configuration,\nbut this is an unlikely arrangement for an interchain aggre-\ngate. In passing we note that a perpendicular \u0001mutual\u0002 ar-\nrangement would result in V=0 and a vanishing CD signal,\nbut this is clearly not the case for the LEPs studied here.\nCONCLUSIONS\nWe conclude that the suggested arrangement of the di-\npoles in a near coplanar parallel configuration, based upon\nthe CD spectra, fits well with the LD data. These experi-\nments clearly suggest that the preferential orientation of the\ndipole moments is along the polymer backbone. The overall\npicture is that for the two LEPs in anisotropic solvents, the\nabsorption dipoles are better aligned as compared to the\nemitting dipoles. The data suggest that luminescence origi-\nnates from a localized distinct state on the longest segments.\nFor MEH-PPV\/PE films this state is oriented closer to paral-\nlel to the alignment direction than is the case for\nOC1C10-PPV \u0001in both PE films and anisotropic solvents\u0002.\nFinally, in comparing these LEPs it appears as if there is no\nmajor difference in the strength of the intermolecular inter-\nactions although they are more complex in OC1C10-PPV. For\nthese two LEPs it appears that the only significant impact the\nside chains have on the system is the overall alignment, with\nOC1C10-PPV having a larger deviation relative to the poly-\nmer backbone as compared to MEH-PPV, when dispersed in\nthe anisotropic solvent. However, this detrimental effect is to\nsome extent overcome in the stretched films. It has been\nsuggested using ellipsometry that the polymer backbone of\nMEH-PPV is relatively stiff.54 This is clearly a contributing\nfactor for the degree of alignment possible for the LEPs \u0001un-\nfortunately there are no data for OC1C10-PPV, which there-\nfore prevents a comparison\u0002.\nThe results obtained in this present work provide a better\nunderstanding of the nature of the interactions in LEP sys-\ntems. For the PPV systems, in particular, this topic has been\ndebated extensively. Based on studies of the PL, it has been\nsuggested that the aggregate formed when going from liquid\nto the solid state is an excited state species only, i.e., an\nexcimer.16 The main argument in favor of excimer formation\nis the strong redshift of the PL of films as compared to\nsolutions.13,22 However, alternative interpretations of the\nphotophysics of PPV systems suggested instead that there are\nindeed ground state interactions.55 Nguyen et al. concluded\nthat for MEH-PPV films, a red edge in the absorption spec-\ntrum is related to an interchain aggregate.7,8 Furthermore, the\nobservations of large nonlinear responses would suggest\nrelatively strong interactions and this is inconsistent with a\nscenario of excimer formations.36–38 The data in this present\nstudy clearly show that there are very strong interactions in\nthe ground state of films. The transformation of the CD spec-\ntra in going from solutions to films can only be explained by\nthis fact. It is also apparent that linear spectroscopies are\ninsufficient in this context, mainly due to the broad absorp-\ntion of the PPV based systems. With the transformation of\nthe CD signal in both the LEP systems of this study, in going\nfrom liquid to solid state, we have accordingly obtained a\nvery strong argument against a scenario in which excimers\nare the main source of the PL in these two LEPs. In view of\nthe results of this study and previous work, it is therefore\nclear that physical dimers are the prevailing type of interac-\ntion in these systems, in agreement with observations made\nFIG. 9. Circular dichorism \u0001solid line\u0002 and absorption \u0001dot\u0002 of the\nOC1C10-PPV spin coated film.\n164701-6 Pålsson, Vaughan, and Monkman J. Chem. Phys. 125, 164701 \u00022006\u0001\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\non other LEP systems.31–34 This work also shows that CD\nspectroscopy is a powerful approach in addressing questions\nof this character.\nACKNOWLEDGMENTS\nFinancial support from CENAMPS, One North East\n\u0001ONE\u0002 and SONY Deutschland, MSL, Stuttgart, Germany, is\ngratefully acknowledged. We also acknowledge Jonathan\nChrister for performing some of the preliminary experiments\nof this study.\n1 J. H. Burroughes, D. D. C. Bradley, A. R. Brown, R. N. Marks, K.\nMackay, R. H. Friend, P. L. Burn, and A. B. Holmes, Nature \u0001London\u0002\n347, 539 \u00011990\u0002.\n2 D. Braun and A. J. Heeger, Appl. Phys. Lett. 58, 1982 \u00011991\u0002.\n3 E. M. Conwell, in Primary Photo Excitations in Conjugated Polymers,\nedited by N. Serdar Sacrifti \u0001World Scientific, Singapore, 1997\u0002.\n4 T. Pauck, R. Hennig, M. Perner, U. Lemmer, U. Siegner, R. F. Mahrt, U.\nScherf, K. Müllen, H. Bässler, and E. O. Göbel, Chem. Phys. Lett. 244,\n171 \u00011995\u0002.\n5 M. Redecker, D. D. C. Bradley, K. J. Baldwin, D. A. Smith, M. Inbaseka-\nran, W. W. Wu, and E. P. Woo, J. Mater. Chem. 9, 2151 \u00011999\u0002.\n6 J. Teetsov and M. A. Fox, J. Mater. Chem. 9, 2117 \u00011999\u0002.\n7 T.-Q. Nguyen, I. B. Martini, J. Liu, and B. J. Schwartz, J. Phys. Chem. B\n104, 237 \u00012000\u0002.\n8 T.-Q. Nguyen, K. Doan, and B. J. Schwartz, J. Chem. Phys. 110, 4068\n\u00011999\u0002.\n9 S. A. van Syke, C. H. Chen, and C. W. Tang, Appl. Phys. Lett. 69, 2160\n\u00011996\u0002.\n10 G. G. Malliaras and J. C. Scott, J. Appl. Phys. 83, 5349 \u00011998\u0002.\n11 C. Adachi, M. A. Baldo, M. E. Thompson, and S. R. Forrest, J. Appl.\nPhys. 90, 5048 \u00012001\u0002.\n12 H. L. Kwok, Rev. Adv. Mater. Sci. 5, 62 \u00012003\u0002.\n13 R. Jakubiak, Z. Bao, and L. Rothberg, Synth. Met. 114, 61 \u00012000\u0002.\n14 N. C. Greenham, S. C. Moratti, D. D. C. Bradley, R. H. Friend, and A. B.\nHolmes, Nature \u0001London\u0002 365, 628 \u00011993\u0002.\n15 M. Yan, L. J. Rothberg, E. W. Kwock, and T. M. Miller, Phys. Rev. Lett.\n75, 1992 \u00011995\u0002.\n16 S. A. Jenekhe and J. A. Osaheni, Science 265, 765 \u00011994\u0002.\n17 J. P. M. Hsu, M. Yan, T. M. Jedju, L. J. Rothberg, and B. R. Hsieh, Phys.\nRev. B 49, 712 \u00011994\u0002.\n18 J. M. Leng, S. Jeglinski, X. Wei, R. E. Brenner, Z. V. Vardeny, F. Gou,\nand S. Mazumudar, Phys. Rev. Lett. 72, 156 \u00011994\u0002.\n19 M. B. Sinclair, D. McBranch, T. W. Hagler, and A. J. Heeger, Synth. Met.\n49–50, 593 \u00011992\u0002.\n20 D. D. C. Bradley, R. H. Friend, F. L. Pratt, K. S. Wong, W. Hayes, H.\nLindenberger, and S. Roth, in Electronic Properties of Conjugated Poly-\nmers, Springer Series in Solid State Sciences Vol. 76, edited by H. Kuz-\nmany, M. Mehring, and S. Roth \u0001Springer, New York, 1987\u0002, p. 113.\n21 E. M. Conwell, J. Pearlstein, and S. Shaik, Phys. Rev. B 54, R2308\n\u00011996\u0002.\n22 I. D. W. Samuel, G. Rumbles, and C. J. Collison, Phys. Rev. B 52,\nR11573 \u00011995\u0002.\n23 A. S. Davydov, Theory of Molecular Excitons \u0001Plenum, New York,\n1971\u0002.\n24 L.-O. Pålsson, C. Wang, D. L. Russel, A. P. Monkman, M. R. Bryce, G.\nRumbles, and I. D. W. Samuel, Chem. Phys. 279, 229 \u00012002\u0002.\n25 D. D. C. Bradley, M. Grell, X. Long, H. Mellor, A. Grice, M. Inbaseka-\nran, and E. P. Woo, Proc. SPIE 3145, 254 \u00011997\u0002.\n26 A. Rodger and B. Norde’n, Circular Dichroism & Linear Dichroism \u0001Ox-\nford University Press, Oxford, UK, 1997\u0002.\n27 E. Charney, The Molecular Basis of Optical Activity: Optical Rotatory\nDispersion and Circular Dichroism: Principles and Applications \u0001Wiley,\nChichester, USA, 1979\u0002.\n28 J. M. Kramer, J. D. Pennoyer, R. Van Grondelle, W. H. J. Westerhius, R.\nA. Niederman, and J. Amesz, Biochim. Biophys. Acta 767, 335 \u00011984\u0002.\n29 V. Liuola, L. Valkunas, and R. Van Grondelle, J. Phys. Chem. B 101,\n7343 \u00011997\u0002.\n30 V. I. Novoderezhkin and A. P. Razjivin, Photochem. Photobiol. 62, 1035\n\u00011995\u0002.\n31 B. M. W. Langeveld-Voss, R. A. J. Jansen, and E. W. Meijer, J. Mol.\nStruct. 521, 285 \u00012000\u0002.\n32 M. Oda, H.-G. Nothofer, U. Scherf, V. Sˆunjić, D. Richter, W. Regenstein,\nand D. Neher, Macromolecules 35, 6792 \u00012002\u0002.\n33 K. P. R. Nilsson, J. Rydberg, L. Baltzer, and O. Inganäs, Proc. Natl. Acad.\nSci. U.S.A. 100, 10170 \u00012002\u0002.\n34 K. P. R. Nilsson, M. R. Andersson, and O. Inganäs, J. Phys.: Condens.\nMatter 14, 10011 \u00012002\u0002.\n35 T. Hagler, K. Pakbaz, K. Vossm, and A. Heeger, Phys. Rev. B 44\u000116\u0002,\n8652 \u00011991\u0002.\n36 S. J. Martin, D. D. C. Bradley, P. A. Lane, H. Mellor, and P. L. Burn,\nPhys. Rev. B 59, 15133 \u00011999\u0002.\n37 M. Leiss, S. Jeglinski, Z. V. Vardeney, M. Ozaki, K. Yoshino, Y. Ding,\nand T. Benton, Phys. Rev. B 56, 15712 \u00011997\u0002.\n38 U. Raicher, H. Bässler, D. D. C. Bradley, and M. Hennecke, Phys. Rev. B\n42, 9830 \u00011990\u0002.\n39 S. Heun, R. F. Mahrt, A. Greiner, U. Lemmer, H. Bässler, D. A. Halliday,\nD. D. C. Bradley, P. L. Burns, and A. B. Holmes, J. Phys.: Condens.\nMatter 5, 247 \u00011993\u0002.\n40 H. Bässler and B. Schweitzer, Acc. Chem. Res. 32, 173 \u00011999\u0002.\n41 S. S. Sartori, S. De Feyter, J. Hofkens, M. Van der Auweraer, F. De\nSchryver, K. Brunner, and J. W. Hofstraat, Macromolecules 36, 500\n\u00012003\u0002.\n42 Y.-L. Fan and K.-F. Lin, J. Polym. Sci., Part A: Polym. Chem. 43, 2520\n\u00012005\u0002.\n43 H. van Amerongen, H. Vasmel, and R. Van Grondelle, Biophys. J. 54, 65\n\u00011988\u0002.\n44 P. G. de Gennes and J. Prost, The Physics of Liquid Crystals \u0001Clarendon,\nOxford, UK, 1993\u0002; C. Booth and P. Raynes, Phys. World 10, 33 \u00011997\u0002.\n45 J. Michl and E. W. Thulstrup, Spectroscopy with Polarized Light. Solute\nAlignment by Photoselection in Liquid Crystals, Polymers, and Mem-\nbranes \u0001VCH, Deerfield Beach, FL, 1995\u0002; J. R. Lakowicz, Principles of\nFluorescence Spectroscopy \u0001Plenum, New York, 1999\u0002.\n46 M. Hennecke, T. Damerau, and K. Müllen, Macromolecules 26, 3411\n\u00011993\u0002.\n47 J. A. I. Oksanen, V. M. Helenius, P. H. Hynninen, H. Van Amerongen, J.\nE. I. Korppi-Tommola, and R. Van Grondelle, Photochem. Photobiol. 64,\n356 \u00011996\u0002.\n48 T. Sato, K. Terao, A. Teramoto, and M. Fujiki, Polymer 44, 5477 \u00012003\u0002.\n49 M. Knaapila, R. Stepanyan, M. Torkkeli et al., Phys. Rev. E 71, 041802\n\u00012005\u0002.\n50 J. P. Foreman and A. P. Monkman, J. Phys. Chem. A 107, 7604 \u00012003\u0002.\n51 T. Q. Nguyen, J. Wu, V. Doan, B. J. Schwartz, and S. H. Tolbert, Science\n288, 652 \u00012000\u0002.\n52 T. Förster, Ann. Phys. 2, 55 \u00011948\u0002.\n53 S. Wachsmann-Hogiu, L. A. Peteanu, L. A. Liu, D. J. Yaron, and J.\nWildeman, J. Phys. Chem. B 107, 5133 \u00012003\u0002.\n54 M. Tammer and A. P. Monkman, Adv. Mater. \u0001Weinheim, Ger.\u0002 14, 210\n\u00012002\u0002.\n55 R. Chang, J. H. Hsu, W. S. Fann et al., Chem. Phys. Lett. 317, 142\n\u00012000\u0002.\n164701-7 Polarized optical spectroscopy of PPV polymers J. Chem. Phys. 125, 164701 \u00022006\u0001\nDownloaded 26 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\n"}