{"doi":"10.1017\/S0142716407070361","coreId":"71490","oai":"oai:eprints.lancs.ac.uk:847","identifiers":["oai:eprints.lancs.ac.uk:847","10.1017\/S0142716407070361"],"title":"Syntactic awareness and reading ability: is there any evidence for a special relationship?","authors":["Cain, Kate"],"enrichments":{"references":[{"id":16343104,"title":"British Picture Vocabulary Scale.","authors":[],"date":"1992","doi":null,"raw":"Dunn, L. M., Dunn, L. M., Whetton, C., & Pintillie, D. (1992). British Picture Vocabulary Scale. Windsor: NFER-Nelson.","cites":null},{"id":16343099,"title":"Children's reading comprehension ability: Concurrent prediction by working memory, verbal ability, and component skill.","authors":[],"date":"2004","doi":"10.1037\/0022-0663.96.1.31","raw":"Cain, K., Oakhill, J., & Bryant, P. E. (2004). Children's reading comprehension ability: Concurrent prediction by working memory, verbal ability, and component skill. Journal of Educational Psychology, 96, 671-681.","cites":null},{"id":16343129,"title":"Cognitive and linguistic factors in learning to read. In","authors":[],"date":"1992","doi":null,"raw":"Tunmer, W. E., & Hoover, W. (1992). Cognitive and linguistic factors in learning to read. In P. B. Gough, L. C. Ehri & R. Treiman (Eds.), Reading acquisition (pp. 175-214). Hillsdale, NJ: Lawrence Erlbaum Associates.","cites":null},{"id":16343112,"title":"Concurrent and longitudinal predictors of reading: The role of metalinguistic and short-term memory skills.","authors":[],"date":"1998","doi":"10.1598\/rrq.33.3.4","raw":"Muter, V., & Snowling, M. (1998). Concurrent and longitudinal predictors of reading: The role of metalinguistic and short-term memory skills. Reading Research Quarterly, 33, 320-337.","cites":null},{"id":16343119,"title":"Development of grammatical-sensitivity, phonological, and short-term memory skills in normally achieving and learning disabled children.","authors":[],"date":"1988","doi":"10.1037\/\/0012-1649.24.1.28","raw":"Siegel, L. S., & Ryan, E. B. (1988). Development of grammatical-sensitivity, phonological, and short-term memory skills in normally achieving and learning disabled children. Developmental Psychology, 24, 28-37.","cites":null},{"id":16343121,"title":"Development of working memory in normally achieving syntactic awareness and literacy 23 and subtypes of learning disabled children.","authors":[],"date":"1989","doi":"10.2307\/1131037","raw":"Siegel, L. S., & Ryan, E. B. (1989). Development of working memory in normally achieving syntactic awareness and literacy 23 and subtypes of learning disabled children. Child Development, 60, 973-80.","cites":null},{"id":16343114,"title":"Factors influencing syntactic awareness skills in normal readers and poor comprehenders.","authors":[],"date":"2000","doi":"10.1017\/s0142716400002046","raw":"Nation, K., & Snowling, M. J. (2000). Factors influencing syntactic awareness skills in normal readers and poor comprehenders. Applied Psycholinguistics, 21, 229-241.","cites":null},{"id":16343073,"title":"Grammatical awareness and learning to read: A critique. In","authors":[],"date":"1994","doi":null,"raw":"Bowey, J. A. (1994). Grammatical awareness and learning to read: A critique. In E. M. H. Assink (Ed.), Literacy Acquisition and Social Context (pp. 122-149). London: Harvester Wheatsheaf.","cites":null},{"id":16343108,"title":"Implicit and explicit syntactic knowledge and reading in pre-adolescents.","authors":[],"date":"1999","doi":"10.1348\/026151099165212","raw":"Gaux, C., & Gombert, J. E. (1999). Implicit and explicit syntactic knowledge and reading in pre-adolescents. British Journal of Developmental Psychology, 17, 169-188. syntactic awareness and literacy 22 Goff, D. A., Pratt, C., & Ong, B. (2005). The relations between children's reading comprehension, working memory, language skills and components of reading decoding in a normal sample. Reading and Writing: An Interdisciplinary Journal, 18, 583-616.","cites":null},{"id":16343102,"title":"Is there a causal link from phonological awareness to success in learning to read?","authors":[],"date":"2004","doi":"10.1016\/s0010-0277(03)00164-1","raw":"Castles, A., & Coltheart, M. (2004). Is there a causal link from phonological awareness to success in learning to read? Cognition, 91, 77-111.","cites":null},{"id":16343096,"title":"Metalinguistic ability and early reading achievement.","authors":[],"date":"1988","doi":"10.1017\/s0142716400008067","raw":"Bowey, J. A., & Patel, R. K. (1988). Metalinguistic ability and early reading achievement. Applied Psycholinguistics, 9, 367-383.","cites":null},{"id":16343126,"title":"Metalinguistic awareness and reading acquisition. In","authors":[],"date":"1984","doi":"10.1007\/978-3-642-69113-3_9","raw":"Tunmer, W., & Bowey, J. A. (1984). Metalinguistic awareness and reading acquisition. In W. E. Tunmer, J. A. Bowey, C. Pratt & M. L. Herriman (Eds.), Metalinguistic awareness in children: Theory, research, and implications. Berlin: Spring-Verlag.","cites":null},{"id":16343123,"title":"Studying the consequences of literacy within a literate society: The cognitive correlates of print exposure.","authors":[],"date":"1992","doi":"10.3758\/bf03208254","raw":"Stanovich, K. E., & Cunningham, A. E. (1992). Studying the consequences of literacy within a literate society: The cognitive correlates of print exposure. Memory and Cognition, 20, 51-68.","cites":null},{"id":16343069,"title":"Syntactic awareness and verbal performance from preschool to fifth grade.","authors":[],"date":"1986","doi":"10.1007\/bf01067676","raw":"Bowey, J. A. (1986a). Syntactic awareness and verbal performance from preschool to fifth grade. Journal of Psycholinguistic Research, 15, 285-306.","cites":null},{"id":16343071,"title":"Syntactic awareness in relation to reading skill and ongoing comprehension monitoring.","authors":[],"date":"1986","doi":"10.1016\/0022-0965(86)90041-x","raw":"Bowey, J. A. (1986b). Syntactic awareness in relation to reading skill and ongoing comprehension monitoring. Journal of Experimental Child Psychology, 41, 282-299.","cites":null},{"id":16343065,"title":"Syntactic competence and reading ability in children.","authors":[],"date":"1990","doi":"10.1016\/0022-0965(90)90053-b","raw":"Bentin, S., Deutsch, A., & Liberman, I. Y. (1990). Syntactic competence and reading ability in children. Journal of Experimental Child Psychology, 48, 147-172.","cites":null},{"id":16343067,"title":"Test for Reception of Grammar - 2: Harcourt Assessment.","authors":[],"date":"2003","doi":null,"raw":"Bishop, D. V. M. (2003). Test for Reception of Grammar - 2: Harcourt Assessment.","cites":null},{"id":16343117,"title":"The connection between phonological, syntactic and semantic skills and children's reading and spelling.","authors":[],"date":"1993","doi":"10.1007\/bf03174079","raw":"Rego, L. L. B., & Bryant, P. E. (1993). The connection between phonological, syntactic and semantic skills and children's reading and spelling. European Journal of Education, 8, 235-246.","cites":null},{"id":16343131,"title":"The development of grammatical sensitivity and its relationship to early reading achievement.","authors":[],"date":"1986","doi":"10.2307\/747708","raw":"Willows, D. M., & Ryan, E. B. (1986). The development of grammatical sensitivity and its relationship to early reading achievement. Reading Research Quarterly, 21, 253-266.","cites":null},{"id":16343115,"title":"The Neale Analysis of Reading Ability - Revised (NARA-II).","authors":[],"date":"1997","doi":"10.1111\/j.2044-8279.1986.tb03047.x","raw":"Neale, M. D. (1997). The Neale Analysis of Reading Ability - Revised (NARA-II). Windsor: NFER-Nelson.","cites":null},{"id":16343110,"title":"The relationships between phonological sensitivity, syntactic processing, and verbal working memory in the reading performance of third-grade children.","authors":[],"date":"1996","doi":"10.1006\/jecp.1996.0062","raw":"Gottardo, A., Stanovich, K. E., & Siegel, L. (1996). The relationships between phonological sensitivity, syntactic processing, and verbal working memory in the reading performance of third-grade children. Journal of Experimental Child Psychology, 63, 563-582.","cites":null},{"id":16343127,"title":"The role of language-related factors in reading disability. In","authors":[],"date":"1989","doi":"10.1007\/978-94-011-1988-7_6","raw":"Tunmer, W. E. (1989). The role of language-related factors in reading disability. In D. Shankweiler & I. Y. Liberman (Eds.), Phonology and Reading Disability: Solving the Reading Puzzle (pp. 91-131). Ann Arbor: University of Michigan Press.","cites":null},{"id":16343106,"title":"Using children's literacy activities to predict growth in verbal cognitive skills: A longitudinal investigation.","authors":[],"date":"1996","doi":"10.1037\/\/0022-0663.88.2.296","raw":"Echols, L. D., West, R. F., Stanovich, K. E., & Zehr, K. S. (1996). Using children's literacy activities to predict growth in verbal cognitive skills: A longitudinal investigation. Journal of Educational Psychology, 88, 296-304.","cites":null},{"id":16343133,"title":"Working memory, comprehension skill and the resolution of text anomaly.","authors":[],"date":"1989","doi":"10.1111\/j.2044-8295.1989.tb02325.x","raw":"Yuill, N. M., Oakhill, J. V., & Parkin, A. J. (1989). Working memory, comprehension skill and the resolution of text anomaly. British Journal of Psychology, 80, 351-361. syntactic awareness and literacy 24","cites":null},{"id":16343124,"title":"Working memory, short-term memory, and speech rate as predictors of children's reading performance at different ages.","authors":[],"date":"2001","doi":"10.1037\/\/0022-0663.93.4.720","raw":"Swanson, H. L., & Howell, M. (2001). Working memory, short-term memory, and speech rate as predictors of children's reading performance at different ages. Journal of Educational Psychology, 93, 720-734.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2007-09-28","abstract":"Syntactic awareness has been linked to word reading and reading comprehension (Tunmer & Bowey, 1984). The predictive power of two syntactic awareness tasks (grammatical correction, word-order correction) for both aspects of reading was explored in eight- and ten-year-olds. The relative contributions of vocabulary, grammatical knowledge, and memory to each were assessed. After vocabulary, memory explained variance on the word-order correction task; in contrast grammatical knowledge explained performance on the grammatical correction task. The relation between syntactic awareness and reading comprehension was mediated by vocabulary, grammatical knowledge, and memory; in contrast, word reading and syntactic awareness shared unique variance not explained by these controls. The implications for how we measure syntactic awareness and its relation with reading ability are discussed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71490.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/847\/1\/Cain_AP_2007.pdf","pdfHashValue":"f1a0533150bd0b44f92fc4a97550e674ed684aa1","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:847<\/identifier><datestamp>\n      2018-01-24T03:17:41Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D42:4246<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Syntactic awareness and reading ability: is there any evidence for a special relationship?<\/dc:title><dc:creator>\n        Cain, Kate<\/dc:creator><dc:subject>\n        BF Psychology<\/dc:subject><dc:description>\n        Syntactic awareness has been linked to word reading and reading comprehension (Tunmer & Bowey, 1984). The predictive power of two syntactic awareness tasks (grammatical correction, word-order correction) for both aspects of reading was explored in eight- and ten-year-olds. The relative contributions of vocabulary, grammatical knowledge, and memory to each were assessed. After vocabulary, memory explained variance on the word-order correction task; in contrast grammatical knowledge explained performance on the grammatical correction task. The relation between syntactic awareness and reading comprehension was mediated by vocabulary, grammatical knowledge, and memory; in contrast, word reading and syntactic awareness shared unique variance not explained by these controls. The implications for how we measure syntactic awareness and its relation with reading ability are discussed.<\/dc:description><dc:date>\n        2007-09-28<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/847\/1\/Cain_AP_2007.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0142716407070361<\/dc:relation><dc:identifier>\n        Cain, Kate (2007) Syntactic awareness and reading ability: is there any evidence for a special relationship? Applied Psycholinguistics, 28 (4). pp. 679-694. ISSN 1469-1817<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/847\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S0142716407070361","http:\/\/eprints.lancs.ac.uk\/847\/"],"year":2007,"topics":["BF Psychology"],"subject":["Journal Article","PeerReviewed"],"fullText":" \n \nCain, K. (2007). Syntactic awareness and reading ability: is there any evidence for a special \nrelationship? Applied Psycholinguistics, 28, 679-694. \nSyntactic awareness and reading ability: is there any evidence \nfor a special relationship? \n \nRunning head:  syntactic awareness and reading ability  \n \n R1: syntactic awareness and reading ability 1 \n \nRunning head:  syntactic awareness and reading ability  \nSyntactic awareness and reading ability: is there any evidence \nfor a special relationship? \nDr Kate Cain \nLancaster University \n \n \nMailing address: \nDepartment of Psychology \nLancaster University \nLancaster \nLA1 4YF \nUK \n \nemail: k.cain@lancs.ac.uk \ntele: 01524 93990 \nfax: 01524 593744 \n \n R1: syntactic awareness and reading ability 2 \n \nAbstract \nSyntactic awareness has been linked to word reading and reading comprehension \n(Tunmer & Bowey, 1984). The predictive power of two syntactic awareness tasks \n(grammatical correction, word-order correction) for both aspects of reading was explored in \neight- and ten-year-olds. The relative contributions of vocabulary, grammatical knowledge, \nand memory to each were assessed. After vocabulary, memory explained variance on the \nword-order correction task; in contrast grammatical knowledge explained performance on the \ngrammatical correction task. The relation between syntactic awareness and reading \ncomprehension was mediated by vocabulary, grammatical knowledge, and memory; in \ncontrast, word reading and syntactic awareness shared unique variance not explained by these \ncontrols. The implications for how we measure syntactic awareness and its relation with \nreading ability are discussed. \n \nword count = 119 \n \n R1: syntactic awareness and reading ability 3 \n \nSyntactic awareness and reading ability: is there any evidence for a special \nrelationship? \n \nSyntactic (or grammatical) awareness refers to the ability to manipulate and reflect on the \ngrammatical structure of language. Tasks that assess this ability include word order \ncorrection tasks, in which the words of a sentence are presented in a jumbled order and have \nto be re-arranged, e.g. ‘strokes the cat Sue’, and grammatical correction tasks, where a \ngrammatical or morphological anomaly in a sentence must be repaired, e.g. ‘The girl eat the \nchocolate’. Syntactic awareness is a metalinguistic skill, distinct from the comprehension or \nproduction of a sentence, because it concerns the ability to consider the structure rather than \nthe meaning of a sentence. Performance on measures of syntactic awareness improves with \nage and is related to reading ability (Bowey, 1986a, 1986b; Siegel & Ryan, 1989). The \ncurrent research had two aims. First to determine the contribution made by vocabulary, \ngrammatical knowledge and memory to performance on different measures of syntactic \nawareness. Second, to investigate whether or not these skills mediate the relations between \nsyntactic awareness and reading ability.  \nThe central focus in the study of syntactic awareness has been its relation to reading \nability. Syntactic awareness has been hypothesised to relate specifically to both word reading \nand reading comprehension. It is thought to aid word recognition skills by enabling a reader \nto use the syntactic constraints of a sentence to decode unfamiliar words (Rego & Bryant, \n1993; Tunmer, 1989; Tunmer & Hoover, 1992) and reading comprehension by facilitating \nsentence- and text-level integration and monitoring skills (Tunmer & Bowey, 1984). \nSyntactic awareness predicts 5-year-olds’ ability to use context to read words that they are \nunable to read in isolation (Rego & Bryant, 1993) and 9-year-old’s accuracy at reading words \nin context (Muter & Snowling, 1998). Some studies find a specific relation between word \n R1: syntactic awareness and reading ability 4 \n \nreading and syntactic awareness even after controlling for receptive vocabulary (Bowey, \n1986a) and other variables such as short-term memory (Willows & Ryan, 1986), although \nstudies that control for additional measures, such as sentence repetition do not (Bowey & \nPatel, 1988). \nA number of studies have considered the relations between syntactic awareness and \nreading comprehension. The two skills are correlated in 6-10-year-olds (Bowey, 1986b; \nBowey & Patel, 1988) and syntactic awareness in Grade 1 predicts reading comprehension \none year later via its influence on decoding and listening comprehension (Tunmer, 1989). \nCross-sectional studies of children with poor reading comprehension report weaknesses on \nmeasures of syntactic awareness relative to same-age good comprehenders (Bentin, Deutsch, \n& Liberman, 1990; Gaux & Gombert, 1999; Nation & Snowling, 2000; Siegel & Ryan, \n1988). Some studies find that syntactic awareness explains unique variance in reading \ncomprehension after language and memory control measures (Willows & Ryan, 1986), \nalthough others do not (Bowey & Patel, 1988). \nDespite over two decades of research investigating syntactic awareness and reading \nability, the relation between the two is not clear: some studies report a specific relation \nbetween syntactic awareness and either word reading ability or reading comprehension, \nwhereas other work suggests that the relation is mediated by language skills. Some of these \ndifferences may be explained by the use of different age groups: all of the skills investigated \n(reading ability, vocabulary, and metalinguistic awareness) develop with age, and the \nstrength of the relations between them may change. In a longitudinal study of 5-8 year olds, \nDemont and Gombert (1996) found that the predictive power relations between different \nmeasures of syntactic awareness, word reading and reading comprehension changed over \ntime. For example, 5-6 year-olds’ syntactic awareness was the only unique predictor of \nreading comprehension at 8-9 years (after vocabulary and IQ controls), whereas in previous \n R1: syntactic awareness and reading ability 5 \n \nyears phonological awareness (related to word reading skill) was also important. Another \nsource of differences is the use of a variety of syntactic awareness tasks, which may make \ndifferent demands on syntactic knowledge and memory and may rely on different processing \nstrategies. These factors and their relation to performance on different measures of syntactic \nawareness will be considered next.  \nMany studies have controlled for vocabulary as a measure of general language ability \n(e.g., Bowey, 1986a, 1986b; Bowey & Patel, 1988; Willows & Ryan, 1986). Another \nlanguage ability that may influence performance on measures of syntactic awareness is \ncomprehension of different grammatical structures. If an assessment of syntactic awareness \nincludes late-acquired grammatical structures with which the child is not overly familiar, the \ntest might become one of knowledge rather than one of metalinguistic awareness. Tests of \ngrammatical correction require the detection and repair of a grammatical or morphological \nanomaly in a sentence, e.g., ‘The rabbit eat the carrot’, whereas word-order correction tasks \ndo not. Thus, some measures of syntactic awareness may be more dependent upon syntactic \nknowledge than others. Sentence-level comprehension is necessary to understand at the level \nof the paragraph and syntactic knowledge is correlated with passage comprehension (e.g., \nGoff, Pratt, & Ong, 2005). There do not appear to be any investigations of the relation \nbetween reading comprehension and syntactic awareness that have included measures of \nsyntactic knowledge or sentence comprehension that are independent of metalinguistic skill. \nA comprehensive assessment of children’s understanding of different syntactic structures was \nincluded in the current work, to determine how this knowledge was related to performance on \ndifferent measures of syntactic awareness and whether or not it mediated the relation between \nsyntactic awareness and reading comprehension.  \nAssessments of syntactic awareness tap into memory processes, so memory capacity \nmay be an important determinant of performance on these tasks. Grammatical correction \n R1: syntactic awareness and reading ability 6 \n \ntasks require the storage of the sentence while the error is identified and corrected before a \nresponse is made. Word-order correction tasks involve the storage and re-arrangement of the \njumbled words. Both tasks tap into short-term storage of verbal information and, perhaps, the \ncapacity to simultaneously process and store information. Memory is correlated with word \nreading and reading comprehension (Cain, Oakhill, & Bryant, 2004; Swanson & Howell, \n2001) as well as with syntactic awareness (e.g. Siegel & Ryan, 1988) but syntactic awareness \npredicts reading ability after statistically controlling for memory (e.g., Gaux & Gombert, \n1999; Gottardo, Stanovich, & Siegel, 1996; Willows & Ryan, 1986).  \nThe type of syntactic awareness task used and the length of each trial may influence \nits relation with memory. Bowey (1994) suggests that word-order correction and grammatical \ncorrection trials make different demands on memory. Item length varies considerably (from \nbetween 3-10 words) in some measures of syntactic awareness (e.g., Bowey, 1986a; Gottardo \net al., although these studies included memory controls). Independent measures of short-term \nand working memory were included in the current study to determine whether memory is \ndifferentially related to performance on these measures of syntactic awareness and to control \nfor its relation with both syntactic awareness and reading. For each task, length of item was \nalso manipulated to explore further the influence of memory on performance.  \nAlternative measures of syntactic awareness may rely on different processing \nstrategies. Although grammatical knowledge is required to understand the meaning of certain \nstructures such as passives, the meanings of other sentences may be grasped from the \ncomponent words even if errors are apparent, e.g., ‘my sisters is going shopping.’ Bowey \n(1994) proposes that word-order correction tasks (e.g., ‘ran after the boy bus the’) rely more \nheavily on semantic processing strategies than grammatical correction tasks (e.g., ‘Yesterday, \nhe visit his mother’) and that the contribution of semantic processing strategies to word-order \ncorrection tasks may be reduced by the use of semantically reversible materials, such as ‘ran \n R1: syntactic awareness and reading ability 7 \n \nafter the goat the donkey’. If so, reading comprehension should be more strongly related to \nperformance on the word-order correction task, and specifically to semantically reversible \nitems because of a shared reliance on meaning-based processing strategies, compared to \nperformance on the grammatical correction task. However, the reversibility of the items on \nword-order correction tasks affects performance of both good and poor comprehenders \nsimilarly (Nation & Snowling, 2000), which suggests that strategies or skills other than \nsemantic processing are important determinants of performance on this task. In the current \nresearch, scores on measures of grammatical correction and word-order correction (including \na comparison of items that were either semantically reversible or constrained) were examined \nin relation to reading comprehension performance.  \nThis review demonstrates that there is a need to take another look at syntactic \nawareness and the factors that may contribute to success on these tasks (knowledge of \ngrammatical structures, memory, task factors, as well as vocabulary) and also at the relations \nbetween syntactic awareness and word reading and reading comprehension. The research \nquestions were as follows:  \n1a. Which skills influence performance on measures of syntactic awareness? \nA primary aim of this research was to determine how comprehension of different \ngrammatical structures and memory were related to performance on two different measures of \nsyntactic awareness and whether this relation changes with age over and above vocabulary, \nwhich has often been used as an index of general language ability in previous studies.  \n1b. Does item length influence the predictive power of memory for the two different measures \nof syntactic awareness?  \nA subsidiary aim was to explore how memory influenced performance on the two tasks. It \nwas predicted that performance on the word-order correction task would be more adversely \n R1: syntactic awareness and reading ability 8 \n \naffected by item length (number of words in the trial) than grammatical correction, because \nthe former is more dependent on memory, as proposed by Bowey (1994).  \n2a. Is there a special relation between syntactic awareness and reading ability? \nThe second main aim was to determine whether the two different measures of syntactic \nawareness shared a specific relation with word reading in context and reading comprehension \nskill, over and above the measures of language and memory, and whether this relation \nchanges with age.  \n2b. Does item type influence the predictive power of word-order correction for reading \ncomprehension?  \nA subsidiary aim was to explore whether word-order correction items that can be processed \nwith meaning-based strategies share a stronger relation with reading comprehension than \nthose that are more dependent on syntactic strategies. Support for this would be a stronger \nrelation between reading comprehension and semantically constrained items in the word-\norder correction task.  \nTo address these research questions, we investigated the relations between word \nreading accuracy, reading comprehension and two measures of syntactic awareness in two \ngroups of young children aged 7-8 and 9-10 years. The relative contributions made by \nreceptive vocabulary, comprehension of different grammatical structures, short-term and \nworking memory to performance on these tasks was assessed.  \nMethod \nParticipants \nChildren were selected from 10 classes in three schools serving mixed catchment areas in the \neast of England. One hundred and ninety-six children aged 7-8 and 9-10 years completed a \ngroup-administered vocabulary assessment (see below). All other assessments were \nindividually administered in a quiet room in the child’s school. Children were excluded from \n R1: syntactic awareness and reading ability 9 \n \nfurther assessment on the following basis: their performance on the vocabulary assessment \n(see below) was at floor or ceiling; their first language was not English; they had a statement \nof special needs; parental permission to participate in the study was not provided 1. The \nanalyses reported are based on participating individuals for whom there were complete data: \n49 7-8-year-olds (26 boys, 24 girls; mean age = 7 years, 9 months, SD=3.35) and 50 9-10-\nyear-olds (26 boys, 26 girls; mean age = 9 years, 9 months, SD = 3.64). \nControl measures \nVocabulary. Receptive vocabulary has been used as an index of language ability in \nprevious studies of syntactic awareness (e.g. (Bowey, 1986b). Receptive vocabulary was \nmeasured with a group-administered version of the BPVS-II (Dunn, Dunn, Whetton, & \nPintillie, 1992, see Stanovich & Cunningham, 1992, for a similar modification). The test \ncomprised 38 words. The experimenter read out the word and the child ticked the \ncorresponding picture in their individual booklet. One point was awarded for each correct \nanswer. Reliability, assessed by calculating Cronbach’s alpha over items, was adequate: α = \n0.73.  \nGrammatical knowledge. Children completed the Test for Reception of Grammar - II \n(TROG-II, (Bishop, 2003), a standardised assessment of receptive grammatical knowledge. \nIn this test, children are presented with four pictures and an orally presented sentence and are \nrequired to select the picture that represents the meaning of the sentence. There are four items \nto test each grammatical contrast and testing is discontinued when five consecutive blocks of \nfour items are failed. Standardised scores are available but raw scores (total number of blocks \npassed) are used in the analyses with both age groups and are reported in Table 1. The \nreported internal reliability is high at .88.  \nShort-term memory. The ability to store and recall verbal information was tested in \nthe following way. Children were presented aurally with lists of digits increasing in length, \n R1: syntactic awareness and reading ability 10 \n \nstarting with just two digits. The task was to repeat back the digits, in the order of \npresentation. There were two items at each level and testing was discontinued when two \nconsecutive errors were made. The number of trials correctly completed was the measure \nused in the analyses. \nWorking memory. The digit reading working memory test developed by Yuill, \nOakhill, and Parkin (Yuill, Oakhill, & Parkin, 1989) was used to assess storage and \nprocessing. Children read groups of three digits and were required to remember the final digit \nfrom each group. They were presented with three trials containing two groups of digits, three \ntrials with three groups of digits, and three trials with four groups of digits. Children were \ninstructed to recall the items in the order of presentation. Two practice items with corrective \nfeedback were given. The total number of items recalled is reported, with a maximum \npossible of 27. The reliability of this test reported by Seigneuric, Ehrlich, Oakhill and Yuill \n(2000) is .67.  \nReading ability.  \nThe Neale Analysis of Reading Ability - II (NARA-II; Neale, 1997) is an \nindividually-administered test, in which children read texts increasing in length. After each \ntext a set of questions to tap memory for literal details and inferable information is asked. \nWord reading errors are corrected up to a prescribed limit: testing is discontinued when this is \nreached. The test provides a word reading accuracy score, based on the number of word \nreading errors made, and a reading comprehension score, based on the number of \ncomprehension questions answered correctly. Raw scores are used in the analyses where age \nis a factor; age-equivalent scores are reported in Table 1. Children completed Form 1, for \nwhich reliability for this age range is between .82-.86 for word reading accuracy, and \nbetween .93-.95 for reading comprehension. \nSyntactic awareness.  \n R1: syntactic awareness and reading ability 11 \n \nChildren completed two measures of syntactic awareness: grammatical correction and \nword-order correction.  \nGrammatical correction. This task comprised twelve items with four examples each \nof the following error types: subject-copula verb agreement, e.g. ‘the baby are sick’; subject-\nverb agreement, e.g. ‘The girls climbs the tree’; tense agreement, e.g. ‘Yesterday, John learn \nhis spellings’. In the current study, there were two items of 4-6 words and two items of 9-10 \nwords, for each error type. Children were told ‘I am going to read out some sentences that are \nwrong and I want you to fix them, to make them better.’ They were given three practice items \nwith corrective feedback. One repetition of each item was provided, if necessary. One point \nwas awarded for each correct answer.  \nThe measurement of performance on grammatical correction tasks is confounded by \nautomatic corrections, particularly for younger children (Bowey, 1986a). Scores on \ngrammatical correction tasks can be adjusted to take into account spontaneous corrections, an \napproach adopted in the current study. Spontaneous corrections were measured in a different \nsession, in which  children’s ability to imitate ungrammatical sentences was recorded. \nChildren heard twelve new items of the same error types and were instructed to repeat the \nsentence exactly as they heard it ‘even it sounds wrong’. Three practice items with corrective \nfeedback were given. In addition, when two consecutive experimental items were corrected \nby the child rather than repeated, the instruction to repeat back exactly what the child had \nheard was reiterated. The younger children made more spontaneous corrections than did the \nolder children, t(97) = 3.49, p < .005. Performance on the grammatical correction task was \ncorrected for performance on the imitation task (total grammatical performance minus \ngrammatical imitation). The total scores across all trials are used in the primary analyses and \nthe comparison between short and long items is reported separately to address the relevant \n R1: syntactic awareness and reading ability 12 \n \nsubsidiary aim. The total scores are reported in Table 1. Reliability over all items was \nadequate, α = 0.69.  \nWord-order correction. This task comprised twelve items: six were potentially \nsemantically reversible, e.g. ‘the donkeys the horse races’ and six were semantically \nconstrained, e.g. ‘the girl the kittens brushes’. There were either five or eight words in each \ntrial. Each item was read out to the child with normal prosody such that the error was not \nemphasised. Two points were awarded for each response in which the grammatical \nagreement was preserved, and one point was awarded when the response made sense but the \ngrammatical agreement was changed, e.g. ‘the donkeys race the horse’. The total scores (sum \nof short and long trials) are reported in Table 1. Reliability over all items was adequate, α = \n0.75. \nResults \nDescriptive statistics \nDescriptive statistics for each age group’s performance are reported in Table 1. The older age \ngroup obtained higher scores than the younger children on all measures. Cohen’s d is \nreported as a measure of effect size (.2 = small, .5 = medium, and .8 = large effect) for all \nsignificant t-test comparisons. \n------------------------------------------ \nINSERT TABLE 1 AROUND HERE \n------------------------------------------ \nInterrelations between measures \nThe zero-order correlations between all measures are reported in Table 2. The main \nfindings were as follows. Performance on the word-order correction task was correlated with \nreading ability and knowledge of vocabulary, as has been found in previous work. In \naddition, it was correlated with grammatical knowledge and digit recall in both age groups, \n R1: syntactic awareness and reading ability 13 \n \nand also digit working memory for the younger children. For the older children, scores on the \ngrammatical correction task were correlated with the same measures. Grammatical correction \ndid not show the same pattern of performance for the younger children. Different aspects of \nmemory were important for the two age groups. For the older children, working memory was \nan important predictor of reading ability; for the younger children digit recall correlated with \nboth word reading accuracy and reading comprehension.  \n------------------------------------------ \nINSERT TABLE 2 AROUND HERE \n------------------------------------------ \nWhich skills influence performance on measures of syntactic awareness? \nA series of fixed-order hierarchical multiple regressions with performance on either \nthe word-order correction or grammatical correction tasks was conducted, to assess the \nrelative contributions made by vocabulary knowledge, grammatical knowledge, and memory. \nSeparate analyses were conducted for each age group. Three pairs of analyses were \nconducted for the older age group, to determine the predictors of performance on the word-\norder correction task. In the first pair of analyses, vocabulary scores were entered in the first \nstep. In one analysis, grammatical knowledge and digit recall were entered in the second and \nthird step, respectively; the order of entry was reversed in the second analysis of this pair. \nThe same principle was used for a pair of analyses in which grammatical knowledge was \nentered in the first step, and again for a pair of analyses in which digit recall was entered in \nthe first step.  \nFor the younger children a memory composite score was created, because both \naspects of memory were correlated with performance on the word-order correction task. \nScores on the digit recall and digit working memory task were standardized and the \ncomposite was used in the analyses2. The analyses were not conducted for the grammatical \n R1: syntactic awareness and reading ability 14 \n \ncorrection task, because performance on this task did not relate to memory or vocabulary \nknowledge in this age group. The results are summarised in Table 3.  \n------------------------------------------ \nINSERT TABLE 3 AROUND HERE \n------------------------------------------ \nWhen word-order correction was the criterion, the two sets of analyses produce near \nidentical patterns of prediction. For both age groups, vocabulary predicted unique variance in \nperformance on the word-order correction task when entered last, after grammatical \nknowledge and digit recall. Similarly, memory predicted unique variance when entered in the \nthird step. Grammatical knowledge only reliably predicted performance on this task when \nentered first. For the older children, the final R2 was .35, and the β values were: vocabulary = \n.44, p < .001; memory = .32, p < .015; grammatical knowledge = .11, ns. For the younger \nchildren, the results were very similar. The final R2 was .34, and the β values were: \nvocabulary = .35, p < .001; memory = .37, p < .015; grammatical knowledge = .08, ns. When \nthe grammatical correction task was the criterion (older age-group only) vocabulary and \ngrammatical knowledge were both reliable predictors and explained significant proportions \nof variance when entered at the third step. The three variables explained 39.6% of the \nvariance, and the β values were: vocabulary = .38, p < .01; memory = .18, ns; grammatical \nknowledge = .33, p < .015.  \nDoes item length influence the predictive power of memory for the two different measures of \nsyntactic awareness?  \nPaired-sample t-tests confirmed that both age groups performed most poorly on the \nlong trials of each task. The mean scores for short and long trials are reported in Table 1. The \nvalues for the word order correction task were t(48) = 4.58, p < .001 and t(49) = 3.16, p < \n.005, for the younger and older children respectively;  The values for the grammatical \n R1: syntactic awareness and reading ability 15 \n \ncorrection task were t(48) = 9.39, p < .001 and t(49) = 10.50, p < .001. Fixed-order multiple \nregression analyses, parallel to those described above, with performance on the long and short \nitems as separate dependent variables were conducted. For the older children, memory \nexplained a significant 9% of the variance for performance on the long items of the word-\norder correction task when entered in the third step after vocabulary and grammatical \nknowledge. The model explained 27.6% of the variance, in total. Memory also explained an \nadditional but nonsignificant proportion of the variance for short items, 5.5% (p = .079), \nwhen entered last in the model, which accounted for 21.4% of the variance in total. Memory \ndid not contribute to the prediction of long or short items on the grammatical correction task. \nFor the younger age group, memory explained significant unique variance for both long \n(6.2%) and short items (9%) of the word-order correction task, when entered at the final step.  \nWhat mediates the relationship between syntactic awareness tasks and reading?  \nPerformance on both measures of syntactic awareness was correlated with word \nreading accuracy and reading comprehension scores in the older age group. To determine \nwhether the relations between performance on the syntactic awareness tasks and reading were \nmediated by the language and memory variables, two pairs of fixed-order hierarchical \nmultiple regressions were conducted: one with word reading accuracy as the criterion; the \nother with reading comprehension. Parallel pairs of analyses were conducted for each \ncriterion. In the first analysis of a pair, word-order correction (or grammatical correction) was \nentered in the first step and the remaining ‘control’ variables (vocabulary, grammatical \nknowledge, and memory) in the second step. In the second analysis the order of entry was \nreversed. For the younger age group, the analyses were conducted for the word-order \ncorrection task only and the memory composite score was included as one of the control \nvariables. The results are summarised in Table 4 (both groups: word-order correction) and \nTable 5 (older children only: grammatical correction). \n R1: syntactic awareness and reading ability 16 \n \n------------------------------------------ \nINSERT TABLE 4 AROUND HERE \n------------------------------------------ \n \n------------------------------------------ \nINSERT TABLE 5 AROUND HERE \n------------------------------------------ \n \nFor the older children, word-order correction was a unique predictor of word reading \naccuracy after the control variables. The relations between the different measures and the \nyounger children’s word reading accuracy were weak and did not reach statistical \nsignificance. The results for the prediction of reading comprehension were consistent for both \nage groups: performance on the word-order correction task did not predict a significant \nproportion of additional variance in reading comprehension after the control variables. \nSimilarly, grammatical correction was not a unique predictor of variance in word reading \naccuracy or reading comprehension (older children only).  \nDoes item type influence the predictive power of word-order correction for reading \ncomprehension?  \nSemantic processing strategies can be used to process semantically constrained trials, \ne.g., ‘the girl the kittens brushes’, but do not help with semantically reversible ones, e.g., ‘the \ndonkeys the horse races’. Each age group found the latter items the hardest. For the older \nchildren, Ms = 4.34 (1.23) and 3.68 (1.28), t(49) = 3.16, p < .001; For the younger children, \nthe means in order were: Ms = 3.89 (1.46) and 3.15 (1.48), t(48) = 2.84, p < .01.  There was \nevidence that meaning-based processing strategies might underpin the relation between some \nword-order correction tasks and reading comprehension in the older age group. For these \n R1: syntactic awareness and reading ability 17 \n \nchildren, there was a moderately sized and significant correlation between the semantically \nconstrained items and reading comprehension skill, r = .41, p < .005, and performance on \nthese items explained an additional and significant proportion of variance in reading \ncomprehension (R2 = .066, p < .05) in a multiple regression analysis after the vocabulary, \ngrammatical knowledge, and memory controls. Performance on the reversible items did not \ncorrelate significantly with reading comprehension for this age group, r = .23, p > .10. The \nmagnitude of the difference between the two correlations was significant, t(47) = 1.94, p < \n.05 (one-tailed).  In the younger sample, both item types were correlated with \ncomprehension: reversible items, r = .42, p < .005; semantically constrained r = .31, p < .05, \nbut neither explained unique variance in the prediction of reading comprehension after the \ncontrol variables. \nDiscussion \nThis study demonstrated that different language and memory skills were related to \ndifferent measures of syntactic awareness suggesting that different measures of syntactic \nawareness are not equivalent. There was little support for a special relation between syntactic \nawareness and reading comprehension: the data suggest that the correlation between the two \nmight arise because of variance shared with language and memory skills.  In contrast, there \nwas evidence that word reading and syntactic awareness share unique variance that is not \nexplained by vocabulary and grammatical knowledge or memory. The implications for how \nwe measure and conceptualise syntactic awareness, and its relation with reading ability, are \ndiscussed, in turn. \nWord-order correction and grammatical correction tasks are both widely used \nmeasures of syntactic awareness. They appear to tap into different additional skills. \nVocabulary was the strongest predictor of both measures of syntactic awareness, explaining \nunique variance in addition to the proportion associated with grammatical knowledge and \n R1: syntactic awareness and reading ability 18 \n \nmemory, a finding that is consistent with previous research (e.g., Bowey, 1986a, 1986b; \nWillows & Ryan, 1986). The novel finding is the contrast between memory and grammatical \nknowledge as predictors. For both age groups, memory was associated with performance on \nthe word-order correction task, in which words are stored and reordered. Grammatical \nknowledge was an important variable in grammatical correction tasks, where grammatical \nand morphological anomalies are presented; it did not predict performance on the word-order \ncorrection task over and above vocabulary and memory. These findings provide empirical \nsupport for Bowey’s (1994) proposal that word-order correction tasks are more dependent on \nmemory than are grammatical correction tasks. In addition, the findings indicate that \nperformance on the grammatical correction task is more closely associated with grammatical \nknowledge than is performance on the word-order correction tasks. For the younger age \ngroup, grammatical knowledge was the only variable that correlated significantly with \nperformance on the grammatical correction task. Together the results strongly suggest that \nthese two measures of syntactic awareness are not equivalent.  \nThe tasks compared in the current research are two of the most widely-used measures \nof syntactic awareness and they each have different strengths and weaknesses. The current \nfindings indicate that language and\/or memory demands must be considered when choosing a \nmeasure of syntactic awareness. Additional factors may also influence performance. Bowey \n(1994) suggested that word-order correction tasks might be heavily influenced by semantic \nprocessing strategies. In the current study items that could be processed with meaning-based \nstrategies, semantically constrained trials, were easier than those than required syntactic \nconstraints to be considered, the semantically reversible trials (see also Nation & Snowling, \n2000). In addition, only performance on the semantically constrained trials predicted reading \ncomprehension skill (for the older children).  \n R1: syntactic awareness and reading ability 19 \n \nSyntactic awareness has been linked theoretically to both word reading and reading \ncomprehension. The current findings strongly suggest that the relation between syntactic \nawareness and reading comprehension is indirect and arises from the variance shared with \nvocabulary, grammatical knowledge and memory. There is one important qualification: for \nthe older children, reading comprehension shared unique variance with items on word-order \ncorrection tasks that were dependent on semantic (or meaning-based) processing strategies. \nIn contrast, the word-order correction task shared a unique relation with word reading ability, \nat least for the older children. This finding is consistent with Gottardo et al.’s study, in which \nsyntactic awareness explained unique variance in word reading skills after memory controls \nand Demont and Gombert’s (1996) work, where vocabulary and IQ were controlled. \nHowever, grammatical correction was not predictive of word reading level in the current \nstudy. The findings strongly suggest that the presence or absence of relations between \nsyntactic awareness and word reading and reading comprehension may depend on which task \nis used to assess syntactic awareness.  \nThe pattern of relations between reading ability, vocabulary, grammatical knowledge \nand the two measure of syntactic awareness was not the same for each age group. The \nreliabilities of the measures were all adequate, thus it is reasonable to assume that the \ndifferences found in the pattern of correlations for the two age groups reflected the strength \nof the relations between these variables with age. Indeed, Demont and Gombert (1996) found \nthat different metalinguistic skills influenced both word reading and reading comprehension \nat different time points in their longitudinal work. This is not surprising when we consider the \nliterature on phonological awareness, another metalinguistic skill associated with reading \nability. There is strong evidence that different aspects of phonological awareness may have \ndifferent developmental trajectories: awareness of syllables appears to arise spontaneously \nand is evident even in very young children, whereas there is an ongoing debate about whether \n R1: syntactic awareness and reading ability 20 \n \nor not phonemic awareness requires an external stimulus such as reading instruction (Castles \n& Coltheart, 2004).  \nThis study presents some interesting findings but questions remain. We need to \ndetermine how best to control methodologically for the tendency of young children to \nautomatically correct ungrammatical sentences. The adjustment used in the current work is \nnot precise because it is not clear what proportion of correct trials are the result of \nspontaneous corrections rather than identification and deliberate correction. This may account \nfor the absence of correlations between performance on the grammatical correction task and \nthe other measures for the younger children who produced many spontaneous corrections in \nthe imitation condition. Future research needs to address the precise nature of any causal \nrelations between syntactic awareness and different aspects of reading ability with \nlongitudinal designs and intervention studies. We also need to determine whether syntactic \nawareness impacts upon different aspects of reading at different stages of reading \ndevelopment. In relation to this point, the contribution of phonological processing skills to \nthe apparent link between syntactic awareness and word reading skill should be considered \n(see Gottardo et al, 1997).  \nThis research has demonstrated that different language and memory skills support \ndifferent measures of syntactic awareness. These findings suggest that different measures of \nsyntactic awareness are not comparable, a conclusion that has implications for the theoretical \nconstruct and the study of this aspect of metalinguistic awareness. The current findings \nsupport the hypothesis that syntactic awareness may facilitate the development of word \nreading in context; they also suggest that the relations between syntactic awareness and \nreading comprehension may reflect the importance of memory and language to both \nmeasures, rather than a special relationship between the two.  \n \nsyntactic awareness and literacy 21 \n \nReferences \nBentin, S., Deutsch, A., & Liberman, I. Y. (1990). Syntactic competence and reading ability \nin children. Journal of Experimental Child Psychology, 48, 147-172. \nBishop, D. V. M. (2003). Test for Reception of Grammar - 2: Harcourt Assessment. \nBowey, J. A. (1986a). Syntactic awareness and verbal performance from preschool to fifth \ngrade. Journal of Psycholinguistic Research, 15, 285-306. \nBowey, J. A. (1986b). Syntactic awareness in relation to reading skill and ongoing \ncomprehension monitoring. Journal of Experimental Child Psychology, 41, 282-299. \nBowey, J. A. (1994). Grammatical awareness and learning to read: A critique. In E. M. H. \nAssink (Ed.), Literacy Acquisition and Social Context (pp. 122-149). London: \nHarvester Wheatsheaf. \nBowey, J. A., & Patel, R. K. (1988). Metalinguistic ability and early reading achievement. \nApplied Psycholinguistics, 9, 367-383. \nCain, K., Oakhill, J., & Bryant, P. E. (2004). Children's reading comprehension ability:  \nConcurrent prediction by working memory, verbal ability, and component skill. \nJournal of Educational Psychology, 96, 671-681. \nCastles, A., & Coltheart, M. (2004). Is there a causal link from phonological awareness to \nsuccess in learning to read? Cognition, 91, 77-111. \nDunn, L. M., Dunn, L. M., Whetton, C., & Pintillie, D. (1992). British Picture Vocabulary \nScale. Windsor: NFER-Nelson. \nEchols, L. D., West, R. F., Stanovich, K. E., & Zehr, K. S. (1996). Using children's literacy \nactivities to predict growth in verbal cognitive skills: A longitudinal investigation. \nJournal of Educational Psychology, 88, 296-304. \nGaux, C., & Gombert, J. E. (1999). Implicit and explicit syntactic knowledge and reading in \npre-adolescents. British Journal of Developmental Psychology, 17, 169-188. \nsyntactic awareness and literacy 22 \n \nGoff, D. A., Pratt, C., & Ong, B. (2005). The relations between children's reading \ncomprehension, working memory, language skills and components of reading \ndecoding in a normal sample. Reading and Writing: An Interdisciplinary Journal, 18, \n583-616. \nGottardo, A., Stanovich, K. E., & Siegel, L. (1996). The relationships between phonological \nsensitivity, syntactic processing, and verbal working memory in the reading \nperformance of third-grade children. Journal of Experimental Child Psychology, 63, \n563-582. \nMuter, V., & Snowling, M. (1998). Concurrent and longitudinal predictors of reading: The \nrole of metalinguistic and short-term memory skills. Reading Research Quarterly, 33, \n320-337. \nNation, K., & Snowling, M. J. (2000). Factors influencing syntactic awareness skills in \nnormal readers and poor comprehenders. Applied Psycholinguistics, 21, 229-241. \nNeale, M. D. (1997). The Neale Analysis of Reading Ability - Revised (NARA-II). Windsor: \nNFER-Nelson. \nRego, L. L. B., & Bryant, P. E. (1993). The connection between phonological, syntactic and \nsemantic skills and children's reading and spelling. European Journal of Education, 8, \n235-246. \nRego, L. L. B., & Bryant, P. E. (1993). The connection between phonological, syntactic and \nsemantic skills and children's reading and spelling. European Journal of Psychology \nof Education, 13, 235-246. \nSiegel, L. S., & Ryan, E. B. (1988). Development of grammatical-sensitivity, phonological, \nand short-term memory skills in normally achieving and learning disabled children. \nDevelopmental Psychology, 24, 28-37. \nSiegel, L. S., & Ryan, E. B. (1989). Development of working memory in normally achieving \nsyntactic awareness and literacy 23 \n \nand subtypes of learning disabled children. Child Development, 60, 973-80. \nStanovich, K. E., & Cunningham, A. E. (1992). Studying the consequences of literacy within \na literate society: The cognitive correlates of print exposure. Memory and Cognition, \n20, 51-68. \nSwanson, H. L., & Howell, M. (2001). Working memory, short-term memory, and speech \nrate as predictors of children's reading performance at different ages. Journal of \nEducational Psychology, 93, 720-734. \nTunmer, W., & Bowey, J. A. (1984). Metalinguistic awareness and reading acquisition. In W. \nE. Tunmer, J. A. Bowey, C. Pratt & M. L. Herriman (Eds.), Metalinguistic awareness \nin children: Theory, research, and implications. Berlin: Spring-Verlag. \nTunmer, W. E. (1989). The role of language-related factors in reading disability. In D. \nShankweiler & I. Y. Liberman (Eds.), Phonology and Reading Disability: Solving the \nReading Puzzle (pp. 91-131). Ann Arbor: University of Michigan Press. \nTunmer, W. E., & Hoover, W. (1992). Cognitive and linguistic factors in learning to read. In \nP. B. Gough, L. C. Ehri & R. Treiman (Eds.), Reading acquisition (pp. 175-214). \nHillsdale, NJ: Lawrence Erlbaum Associates. \nWillows, D. M., & Ryan, E. B. (1986). The development of grammatical sensitivity and its \nrelationship to early reading achievement. Reading Research Quarterly, 21, 253-266. \nYuill, N. M., Oakhill, J. V., & Parkin, A. J. (1989). Working memory, comprehension skill \nand the resolution of text anomaly. British Journal of Psychology, 80, 351-361. \n \n \nsyntactic awareness and literacy 24 \n \nAcknowledgements \nThis work was supported by a Research Promotion Fund Grant from the University of \nEssex. I would like to thank the schools in Essex who participated in this research and Simon \nBignell who assisted with the data collection. My thanks to Judy Bowey and two anonymous \nreviewers for their comments on an earlier version of this paper.  \nsyntactic awareness and literacy 25 \n \nFootnotes \n \n1. Forty-two children (21.4%) were excluded from the original sample on the basis of their \nvocabulary scores. A further 37 were excluded because they either had a statement of special \neducational needs, spoke English as an additional language, or parental permission was not \ngiven. The precise numbers for each category are not known because the teachers did not \nrelease this information.  \n \n2. Individual analyses with either digit recall or working memory raw scores produced the \nsame pattern of results.  \nsyntactic awareness and literacy 26 \n \nTable 1 \nMeans (and standard deviations) for each age group on all measures \n \n Young \n(7-8 years) \nOld \n(9-10 years) \nt-test (df=97) Cohen’s d \nNARA-II word reading \naccuracy: age equivalent \n8;7 (19.86) 10;11 (22.43) 6.62, p < .001 1.33 \nNARA-II reading \ncomprehension: age \nequivalent \n7;10 (14.17) 9;6 (19.34) 6.34, p < .001 1.28 \nTROG: blocks correct (max \n= 20) \n11.61 (3.08) 14.42 (2.71) 4.81, p < .001 .97 \nVocabulary (max = 38) 22.04 (3.05) 27.08 (3.47) 7.67, p < .001 1.54 \nDigit working memory (max \n= 27) \n15.18 (4.52) 19.40 (4.27) 4.77, p < .001 .96 \nDigit recall (trials correct) 7.59 (1.80) 8.40 (1.76) 2.26, p < .03 .46 \nGrammatical correction, \ntotal score (adjusted for \nrepetitions) (max=12) \n5.97 (3.92) 7.88 (3.56) 2.53, p < .015 .51 \nGrammatical correction, \nshort items (adjusted for \nrepetitions) (max=6) \n4.57 (1.78) 5.16 (1.48)   \nGrammatical correction, \nlong items (adjusted for \nrepetitions) (max=6) \n1.40 (2.70) 2.72 (2.35)   \nWord-order correction, total \nscore (max = 24) \n7.05 (2.30) 8.02 (2.27)   \nWord-order correction, short \nitems (max = 12) \n4.00 (1.32) 4.30 (1.25)   \nWord-order correction, long \nitems (max = 12) \n3.05 (1.39) 3.72 (1.37)   \n \n"}