{"doi":"10.1111\/j.1475-2743.2006.00060.x","coreId":"140547","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/2118","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/2118","10.1111\/j.1475-2743.2006.00060.x"],"title":"Compatible measurements of volumetric soil water content using a neutron probe\nand Diviner 2000 after field calibration.","authors":["Burgess, Paul J.","Reinhard, Berend Richard","Pasturel, P."],"enrichments":{"references":[{"id":37942888,"title":"Calibration equations for Diviner","authors":[],"date":"2004","doi":"10.1111\/j.1475-2743.2004.tb00343.x","raw":"Groves SJ & Rose SC 2004. Calibration equations for Diviner 2000 capacitance measurements of volumetric soil water content of six soils. Soil Use and Management 20, 96-97.","cites":null},{"id":37942891,"title":"Can the PR1 capacitance probe replace the neutron probe for routine soil-water measurement? Soil Use and","authors":[],"date":"2005","doi":"10.1079\/sum2005332","raw":"Mwale SS, Azam-Ali SN & Sparkes DL 2005.  Can the PR1 capacitance probe replace the neutron probe for routine soil-water measurement?  Soil Use and Management 21, 340-347 Paltineanu IC & Starr JL 1997. Real-time soil water dynamics using multisensor capacitance probes: laboratory calibration.  Soil Science Society of America Journal 61, 1576-1585.","cites":null},{"id":37942887,"title":"Determination of soil moisture by neutron scattering.","authors":[],"date":"1952","doi":"10.1097\/00010694-195205000-00007","raw":"Gardner W & Kirkham D 1952.  Determination of soil moisture by neutron scattering.   Soil Science 73, 391-401.","cites":null},{"id":37942886,"title":"Dual field calibration of capacitance and neutron soil water sensors in a shrinking-swelling clay soil.","authors":[],"date":"2004","doi":"10.2136\/vzj2004.1390","raw":"Fares A Buss P Dalton M El-Kadi AI & Parsons LR 2004. Dual field calibration of capacitance and neutron soil water sensors in a shrinking-swelling clay soil. Vadose Zone Journal 3, 1390-1399.","cites":null},{"id":37942889,"title":"Evaluacion de una sonda FDR para la estimacióde la evolución del contenido de agua en el suelo y para el control de riegos en olivar. In:","authors":[],"date":"2003","doi":null,"raw":"Hidalgo J Pastor M & Hidalgo JC 2003.  Evaluacion de una sonda FDR para la estimacióde la evolución del contenido de agua en el suelo y para el control de riegos en olivar.  In: Estudios de la Zona No Saturada del Suelo Vol. VI, (eds J Álvarez-Benedí & P Marinero), Instituto Tecnológico Agrario de Castilla y León, Valladolid Spain,  pp 171-176.","cites":null},{"id":37942892,"title":"Light and water use in a poplar silvoarable system. MSc by Research Thesis,","authors":[],"date":"2004","doi":null,"raw":"Pasturel P 2004. Light and water use in a poplar silvoarable system. MSc by Research Thesis, Cranfield University, Silsoe, UK Sentek Pty Ltd 2003. Sentek Diviner 2000 User Guide Version 1.2.  Australia: Sentek Pty Ltd, Stepney, South Australia.","cites":null},{"id":37942885,"title":"Neutron Probe Practice. Institute of Hydrology. Report 19. Burgess","authors":[],"date":"1987","doi":null,"raw":"Bell JP 1987. Neutron Probe Practice. Institute of Hydrology. Report 19. Burgess PJ Incoll LD Corry DT Beaton A & Hart BJ 2004.  Poplar growth and crop yields within a silvoarable agroforestry system at three lowland sites in England.  Agroforestry Systems 63, 157-169.","cites":null},{"id":37942890,"title":"Some problems associated with the neutron probe in swelling\/shrinking clay soil.","authors":[],"date":"1987","doi":"10.1111\/j.1365-2389.1987.tb02132.x","raw":"Jarvis NJ & Leeds-Harrison PB 1987. Some problems associated with the neutron probe in swelling\/shrinking clay soil. Journal of Soil Science 38, 149-156.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-12-01T00:00:00Z","abstract":"Field calibrations for a neutron probe and a capacitance sensor (Diviner 2000)\nfor measuring the soil water content of a shrinking–swelling clay soil were\nsubstantially different from commonly used default values. Using our field\ncalibrations, the two instruments estimated similar changes in the cumulative\nwater content of a soil profile (0–1 m depth) over one growing se","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140547.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1111\/j.1475-2743.2006.00060.x","pdfHashValue":"a5e4084878eb093442e6d1e82fa4ff425c4fc09c","publisher":"Blackwell Publishing Ltd.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/2118<\/identifier><datestamp>2011-10-18T15:32:38Z<\/datestamp><setSpec>hdl_1826_8<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Compatible measurements of volumetric soil water content using a neutron probe\nand Diviner 2000 after field calibration.<\/dc:title><dc:creator>Burgess, Paul J.<\/dc:creator><dc:creator>Reinhard, Berend Richard<\/dc:creator><dc:creator>Pasturel, P.<\/dc:creator><dc:subject>Capacitance sensor<\/dc:subject><dc:subject>shrinking-swelling clay<\/dc:subject><dc:subject>soil texture<\/dc:subject><dc:subject>neutron probe<\/dc:subject><dc:description>Field calibrations for a neutron probe and a capacitance sensor (Diviner 2000)\nfor measuring the soil water content of a shrinking–swelling clay soil were\nsubstantially different from commonly used default values. Using our field\ncalibrations, the two instruments estimated similar changes in the cumulative\nwater content of a soil profile (0–1 m depth) over one growing sea<\/dc:description><dc:publisher>Blackwell Publishing Ltd.<\/dc:publisher><dc:date>2011-09-29T17:00:37Z<\/dc:date><dc:date>2011-09-29T17:00:37Z<\/dc:date><dc:date>2006-12-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>P.J. Burgess, B.R. Reinhard, & P. Pasturel, Compatible measurements of volumetric soil water content using a neutron probe and Diviner 2000 after field calibration. Soil Use and Management, December 2006, 22 (4) 401-404.<\/dc:identifier><dc:identifier>0266-0032<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1111\/j.1475-2743.2006.00060.x<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/2118<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0266-0032","0266-0032"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Capacitance sensor","shrinking-swelling clay","soil texture","neutron probe"],"subject":["Article"],"fullText":"1 \n \nCopy of paper:  Burgess, P.J., Reinhard, B.R. & Pasturel, P. (2006).  \nCompatible measurements of volumetric soil water content using a \nneutron probe and Diviner 2000 after field calibration.  Soil Use and \nManagement, December 2006, 22: 401-404. \n \nCompatible measurements of volumetric soil water \ncontent using a neutron probe and Diviner 2000 after \nfield calibration \n \nP.J. Burgess1*, B.R. Reinhard12 & P. Pasturel1 \n \n1Cranfield University, Cranfield, Bedfordshire, MK43 0AL, UK.   \n2Büro für Ökologie und Landschaft GmbH, Litzibuch, CH-8966 Oberwil-Lieli, Switzerland \n*Corresponding author. E-mail: P.Burgess@cranfield.ac.uk \n \nKey words: Capacitance sensor, shrinking-swelling clay, soil texture, neutron probe \n \nAbstract.  Field calibrations for a neutron probe and a capacitance sensor (Diviner 2000) for \nmeasuring the soil water content of a shrinking-swelling clay soil were substantially different \nfrom commonly-used default values.  Using our field calibrations, the instruments estimated \nsimilar changes in the cumulative water content of a soil profile (0 to 1 m depth) over one \ngrowing season. \n \nINTRODUCTION \nIrrigation scheduling and environmental monitoring require accurate, portable and cost-\neffective methods for measuring volumetric soil water content (θv).  Since the 1950s, soil \nwater content has been measured using neutron scattering (Gardner and Kirkham, 1952) and \nit is common practice in the UK to use the default calibration equations for clay, silt and \nsand soils described by Bell (1987).  Soil water content can also be measured using \ncapacitance sensors calibrated for soil texture (Groves and Rose, 2004; Mwale et al., 2005).  \n Between April and October 2003 the soil water content in a shrinking-swelling clay \nsoil was measured using a Wallingford-type neutron probe (Bell, 1987) and a Diviner 2000 \ncapacitance sensor (Sentek Pty, Stepney, South Australia).  Using Bell’s (1987) default \ncalibration for a clay soil and a site-specific calibration for the capacitance sensor, the two \ntechniques showed substantial divergence in calculated soil water content (Pasturel, 2004). \nThe objective of the research, described here, was to determine if recalibrations of the \nneutron probe and capacitance sensor, against gravimetrically-determined volumetric water \ncontents, could remove the divergence.  \n \n2 \n \nMETHOD \nAll of the soil water content measurements were taken in a clay soil within an experimental \nsite at Silsoe, Bedfordshire, UK (lat. 52°0’ N; long. 0°25’ W) described by Burgess et al. \n(2004).  The vegetation comprised widely-spaced (10 m x 6.4 m) 11 to 13-year-old poplar \ntrees (Populus spp) with an understorey of grass, bare earth or field beans (Vicia faba).  The \nsoil, classified as belonging to the Holdenby soil series, comprises 55% clay (< 2 µm), 26% \nsilt (2 to 63 µm), and 19% sand (0.063 to 2 mm), with some stones (< 60 mm) to 0.80 m \ndepth, and it swells and shrinks in response to wetting and drying.  \n For the calibration four 1 m long neutron probe aluminium access-tubes (external \ndiameter: 44 mm) each spaced 0.5 m from a corresponding 1.5 m long PVC Diviner access \ntube (diameter: 56 mm) were installed along an 8 m transect.   During installation, a clay and \nwater mixture was added around the Diviner access-tubes to minimise air gaps.  During the \nnext two months, neutron probe and Diviner measurements were taken at depths of 0.25, \n0.40, 0.60 and 0.80 m below the soil surface within each of the four pairs of access-tubes.  \nThe neutron probe measurement comprised a count ratio (CR) determined by dividing the \nmean of five 16 seconds field measurements at each depth (Rs) by a 64 second standard \ncount (Rw) inside a drum of water.  The Diviner was used to determine a scaled frequency \n(SF) calculated from the mean value of three frequency counts at each depth (Fs) and inside \n200 litre containers containing either air (Fa) or water (Fw) at 22 °C (equation 1): \n \nwa\nsa\nFF\nFFSF −\n−=                                       (1)                             \nImmediately after these measurements, standard cutting rings (54 mm diameter and 20 mm \ndeep) were used to remove three undisturbed soil samples centred at depths of 0.25, 0.40, \n0.60 and 0.80 m next to each access tube.  The mean bulk density and water content (±0.01 \ng) were determined by weighing the samples, placing in a drying oven at 105 °C for 72 h, \nand reweighing.  Analysis of variance was used to determine if mean bulk density varied \nwith soil depth, and new calibration equations were established from regressions of \nvolumetric water content against instrument reading (count ratio or scaled frequency) using \nGenstat version 8.0 (Lawes Agricultural Trust).   \nThe mean soil-profile (0 to 1 m depth) water contents (units: cm3 cm-3), measured in \nthe experimental site between April and October 2003 (Pasturel, 2004), were then \nrecalculated using the new calibrations.  With the neutron probe, the mean water content \nbetween a depth of 0 and 0.25 m was assumed to be the same as that at the shallowest \nreading i.e. a depth of 0.25 m.  With the capacitance sensor, soil water measurements had \nbeen taken in 0.10 m increments between depths of 0.10 and 1.00 m. \n  \nRESULTS AND DISCUSSION \nThe analysis of variance indicated that the mean dry bulk density (1.30 ± 0.015 g cm-3 ; n = \n32) was similar between the four depths and four pairs of access-tubes.  There was a positive \nlinear relationship between volumetric water content (θv) and the neutron probe count ratio \n(CR) (Figure 1a; equation 2) which was not significantly affected by depth (P=0.05): \n θv = 0.754 (± 0.076) CR + 0.057 (± 0.039)   (R2=0.87; n = 16)              (2) \n  The slope of the calibration suggests a 21% reduction in calculated water use \ncompared to Bell’s (1987) default calibration for clay (Table 1a).  Although neutron probes \nhave been widely used for soil water monitoring in temperate clay soils and are often \nconsidered to be a standard for other methods, these results reinforce the need to develop \nsite-specific calibrations (Fares et al. 2003).  Although few neutron probe calibrations for \ntemperate clay soils are cited in the literature, Jarvis and Leeds-Harrison (1987) report a \nsimilar calibration for a clay soil at a depth of 0.30 m at the same site (Table 1a).   \n \n \n3 \n \n \na) Neutron probe b) Diviner 2000 \n0.35\n0.40\n0.45\n0.50\n0.40 0.45 0.50 0.55\nNeutron probe count ratio CR\nVo\nlu\nm\net\nric\n w\nat\ner\n c\non\nte\nnt\n θ\nv (\ncm\n3  c\nm\n-3\n)\n \n \n0.35\n0.40\n0.45\n0.50\n0.5 0.6 0.7 0.8 0.9 1.0\nDiviner scaled frequency SF\nLegend: z: 20 cm, {: 25 cm,  U: 40 cm,  \u0091: 60 cm,  \u0085: 80 cm depth \n \nFigure 1 Relation between the gravimetrically-determined volumetric water content (θv ) of  \nthe clay soil at up to five depths (20 to 80 cm) and the associated a) neutron probe count ratio \n(CR) and b) the Diviner 2000 scaled frequency readings (SF).  The best fit regressions \n(equations 2 and 3) are shown as solid black lines. \n \n \n \nTable 1 Calibration equations and coefficients of determination (R2) used to calculate \nvolumetric water content (θv; cm3 cm-3) from a) the count ratio (CR) measured with a \nWallingford neutron probe on clay soils in the UK, and b) the scaled frequency (SF) \nmeasured with a Diviner 2000 on soils with a high clay content.  \n \nInstrument and \nsoil texture \nCalibration equation R2 Bulk density\n(g cm-3) \nReference \na) Neutron probe     \nClay (20 to 80 cm) θv = 0.754 CR + 0.057 0.87 1.30 Current study \nClay (30 cm) θv = 0.769 CR + 0.038 0.87 1.30 Jarvis and Leeds-Harrison (1987) \nClay and peat θv = 0.958 CR – 0. 012 na  na Bell (1987) \nb) Diviner 2000     \nClay (field) θv = 0.475 SF 0. 418 + 0 0.81 1.30 Current study \n θv = 0.228 SF  + 0.250 0.78 1.30 Current study \nClay (laboratory) θv = 0.514 SF 3. 371 + 0 0.93 1.09 Groves and Rose (2004) \nSilty clay (field) θv = 0.465 SF  –  0.139 0.80 1.29 Hidalgo et al. (2003) \nna = not available.    \n \n \n4 \n \nAs recommended by Sentek Pty Ltd (2003), a power law relationship was first used to \ncalibrate the scaled frequency of the Diviner and the soil water content (Figure 1b; equation \n3): \n θv = 0.475 (±0.006) SF 0.4187 (±0.0523)            (R2=0.80; n=17)                      (3)                            \nA linear model of the form: θv = 0.228 (±0.030) SF + 0.250 (±0.026) had an equivalent but \nslightly lower coefficient of determination (R2 = 0.78).  In the field, the predicted change in \nsoil water content per change in the scaled frequency was substantially less than that \ndetermined for clay in a laboratory study by Groves & Rose (2004) (Table 1b).  Capacitance \nprobes, such as the Diviner, measure a relatively small soil volume (approximately 0.10 m \nfrom the access tube) and are sensitive to macro-pores and cracks (Paltineanu & Starr, 1993).  \nThe lack of correspondence between our calibration and other soils with a high clay content \n(e.g. Hidalgo et al. 2003) may be a result of differences in the chemical composition of the \nsoil, the range of the soil water content, the electroconductivity of the soil solution,  \ntemperature changes (Paltineanu & Starr, 1993), or the presence of stones and possible \nchanges in soil texture with depth (Mwale et al. 2005).  The differences in calibration \nequations again highlights the importance of site-specific calibrations for accurate \nmeasurement of soil water content.  \n \nThe new calibrations were used to re-calculate the soil water contents (0 to 1 m depth) of the \nclay soil between April and October 2003 using the raw data collected by Pasturel (2004).   \nWith these calibrations, the two instruments gave similar (P = 0.05) absolute values for soil \nwater content at the start and the end of the season (Figure 2) suggesting that the calibrations \nwere correct.  The two methods also predicted a similar (P = 0.05) net change in the water \ncontent (153-170 mm) of the top 1 m of soil between 29 April and 15 October (Figure 2).  \nThe main difference between the two methods was that the Diviner measurements showed a \nsudden rise in soil water content on 30 July.  Following 20 mm of rainfall between 24 and 30 \nJuly, this may be due to the greater sensitivity of the Diviner 2000 readings to water \npreferentially running along the outside of the access tube and into the soil.  In addition the \nshallowest reading with the capacitance sensor was at a depth of 0.10 m compared to 0.25 m \nfor the neutron probe.   \ns.e.d.\n0.25\n0.30\n0.35\n0.40\n0.45\n0.50\n0.55\n01-Apr 01-May 01-Jun 01-Jul 01-Aug 01-Sep 01-Oct\nDate\nVo\nlu\nm\net\nric\n s\noi\nl w\nat\ner\n c\non\nte\nnt\n θ\nv (\ncm\n3  c\nm\n-3\n)\n \nFigure 2 Mean water content for the soil profile (0 to 1 m depth) as measured with the \nneutron probe \u008b and the Diviner 2000 F between 29 April and 15 October 2003 using the \nfield-determined calibrations equations 2 and 3.  Error bars show the standard error of the \ndifference between the neutron probe and Diviner readings (n=11). \n5 \n \nCONCLUSION \nFor a shrinking-swelling clay, the field calibration equations for a neutron probe and Diviner \n2000 capacitance sensor were substantially different from default or laboratory-determined \nequations obtained by previous authors.  By using the field, rather than the default, \ncalibrations the two instruments gave similar estimates of the change in the water content of \na soil profile (0 to 1 m depth) over a growing season.  \nACKNOWLEDGEMENT \nThe field measurements from April to October 2003 were undertaken when Pascal Pasturel \nwas funded by European Union project No. QLK5-CT-2001-00560. \n \nREFERENCES \nBell JP 1987. Neutron Probe Practice. Institute of Hydrology. Report 19. \n \nBurgess PJ Incoll LD Corry DT Beaton A & Hart BJ 2004.  Poplar growth and crop yields \nwithin a silvoarable agroforestry system at three lowland sites in England.  Agroforestry \nSystems 63, 157-169. \n \nFares A Buss P Dalton M El-Kadi AI & Parsons LR 2004. Dual field calibration of \ncapacitance and neutron soil water sensors in a shrinking-swelling clay soil. Vadose Zone \nJournal 3, 1390-1399. \n \nGardner W & Kirkham D 1952.  Determination of soil moisture by neutron scattering.   Soil \nScience 73, 391-401. \n \nGroves SJ & Rose SC 2004. Calibration equations for Diviner 2000 capacitance \nmeasurements of volumetric soil water content of six soils. Soil Use and Management 20, \n96-97. \n \nHidalgo J Pastor M & Hidalgo JC 2003.  Evaluacion de una sonda FDR para la estimacióde \nla evolución del contenido de agua en el suelo y para el control de riegos en olivar.  In: \nEstudios de la Zona No Saturada del Suelo Vol. VI, (eds J Álvarez-Benedí & P Marinero),  \nInstituto Tecnológico Agrario de Castilla y León, Valladolid Spain,  pp 171-176. \n \nJarvis NJ & Leeds-Harrison PB 1987. Some problems associated with the neutron probe in \nswelling\/shrinking clay soil. Journal of Soil Science 38, 149-156. \n \nMwale SS, Azam-Ali SN & Sparkes DL 2005.  Can the PR1 capacitance probe replace the \nneutron probe for routine soil-water measurement?  Soil Use and Management 21, 340-347  \n \nPaltineanu IC & Starr JL 1997. Real-time soil water dynamics using multisensor capacitance \nprobes: laboratory calibration.  Soil Science Society of America Journal 61, 1576-1585. \n \nPasturel P 2004. Light and water use in a poplar silvoarable system. MSc by Research \nThesis, Cranfield University, Silsoe, UK \n \nSentek Pty Ltd 2003. Sentek Diviner 2000 User Guide Version 1.2.  Australia: Sentek Pty \nLtd, Stepney, South Australia. \n"}