{"doi":"10.1186\/1471-2164-7-65","coreId":"100941","oai":"oai:epubs.surrey.ac.uk:342","identifiers":["oai:epubs.surrey.ac.uk:342","10.1186\/1471-2164-7-65"],"title":"The Use of Whole Genome Amplification to Study Chromosomal Changes in Prostate Cancer: Insights into Genome-Wide Signature of Preneoplasia Associated with Cancer Progression","authors":["Hughes, S","Yoshimoto, M","Beheshti, B","Houlston, R S","Squire, J A","Evans, A"],"enrichments":{"references":[{"id":944181,"title":"A: Antisense MDM2 oligonucleotides restore the apoptotic response of prostate cancer cells to androgen deprivation. Prostate","authors":[],"date":"2004","doi":"10.1002\/pros.20044","raw":null,"cites":null},{"id":944833,"title":"Camara-Lopes LH: Abnormal expression of MDM2 in prostate carcinoma. Mod Pathol","authors":[],"date":"2001","doi":"10.1038\/modpathol.3880330","raw":null,"cites":null},{"id":936924,"title":"Chinnaiyan AM: Recurrent fusion of TMPRSS2 and ETS transcription factor genes in prostate cancer. Science","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":922840,"title":"Collins C: Evaluation of genetic patterns in different tumor areas of intermediate-grade prostatic adenocarcinomas by high-resolution genomic array analysis. Genes Chromosomes Cancer","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":931276,"title":"Cornelisse CJ: Different mechanisms of chromosome 16 loss of heterozygosity in well- versus poorly differentiated ductal breast cancer. Genes Chromosomes Cancer","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":924248,"title":"CS: Genome-wide screening for complete genetic loss in prostate cancer by comparative hybridization onto cDNA microarrays. Oncogene","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":941452,"title":"DH: Myc confers androgen-independent prostate cancer cell growth.","authors":[],"date":"2003","doi":"10.1172\/jci19035","raw":null,"cites":null},{"id":945714,"title":"DJ: Androgens negatively regulate forkhead transcription factor FKHR (FOXO1) through a proteolytic mechanism in prostate cancer cells.","authors":[],"date":"2004","doi":"10.1074\/jbc.M314143200","raw":null,"cites":null},{"id":927680,"title":"E: Two methods of whole-genome amplification enable accurate genotyping across a 2320-SNP linkage panel. Genome Res","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":936221,"title":"Ekman P: Clinical significance of chromosome 8p, 10q, and 16q deletions in prostate cancer. Prostate","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":934911,"title":"Frierson HFJ: Loss of heterozygosity at 13q14 and 13q21 in high grade, high stage prostate cancer. Prostate","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":931992,"title":"Genetic alterations in 102 primary gastric cancers by comparative genomic hybridization: gain of 20q and loss of 18q are associated with tumor progression. Mod Pathol","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":930597,"title":"Houlston RS: Microarray comparative genomic hybridisation analysis of intraocular uveal melanomas identifies distinctive imbalances associated with loss of chromosome 3.","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":935560,"title":"Identification of genetic markers for prostatic cancer progression. Lab Invest","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":944966,"title":"Inoue S: EBAG9\/RCAS1 expression and its prognostic significance in prostatic cancer.","authors":[],"date":"2003","doi":"10.1002\/ijc.11205","raw":null,"cites":null},{"id":939305,"title":"JW: PIK3CA is implicated as an oncogene in ovarian cancer. Nat Genet","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":938484,"title":"JW: Positional cloning of ZNF217 and NABC1: genes amplified at 20q13.2 and overexpressed in breast carcinoma.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":933484,"title":"Kallioniemi OP: Genetic changes in primary and recurrent prostate cancer by comparative genomic hybridization. Cancer Res","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":923539,"title":"Kallioniemi OP: Highimpact of copy number on gene expression. Neoplasia","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":929167,"title":"L: Genome-wide single-nucleotide polymorphism arrays demonstrate high fidelity of multiple displacementbased whole-genome amplification. Electrophoresis","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":924946,"title":"Lasken RS: Comprehensive human genome amplification using multiple displacement amplification.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":925593,"title":"Lasken RS: Rapid amplification of plasmid and phage DNA using Phi 29 DNA polymerase and multiply-primed rolling circle amplification. Genome Res","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":932748,"title":"Lichter P: Mapping of chromosomal gains and losses in prostate cancer by comparative genomic hybridization. Genes Chromosomes Cancer","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":942757,"title":"MP: Multiple tumor marker analyses (PSA, hK2, PSCA, trp-p8) in primary prostate cancers using quantitative RT-PCR.","authors":[],"date":"2003","doi":"10.1016\/S1569-9056(03)80234-8","raw":null,"cites":null},{"id":926976,"title":"Multiple displacement amplification of genomic DNA.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":943493,"title":"ON: Prostate stem cell antigen: a cell surface marker overexpressed in prostate cancer.","authors":[],"date":"1998","doi":"10.1073\/pnas.95.4.1735","raw":null,"cites":null},{"id":920885,"title":"Persistence of high-grade prostatic intra-epithelial neoplasia under combined androgen blockade therapy. Hum Pathol","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":922219,"title":"Pinkel D: Comparative genomic hybridization for molecular cytogenetic analysis of solid tumors. Science","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":926268,"title":"PM: Whole genome analysis of genetic alterations in small DNA samples using hyperbranched strand displacement amplification and array-CGH. Genome Res","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":942141,"title":"Prostate stem cell antigen (PSCA) expression in human prostate cancer tissues and its potential role in prostate carcinogenesis and progression of prostate cancer. World J Surg Oncol","authors":[],"date":"2004","doi":"10.1093\/jjco\/hyh073","raw":null,"cites":null},{"id":928360,"title":"Sellers WR: Genome coverage and sequence fidelity of phi29 polymerase-based multiple strand displacement whole genome amplification. Nucleic Acids Res","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":921585,"title":"Squire JA: Identification of numerical chromosomal changes detected by interphase fluorescence in situ hybridization in high-grade prostate intraepithelial neoplasia as a predictor of carcinoma. Arch Pathol Lab Med","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":929840,"title":"Squire JA: Use of whole genome amplification and comparative genomic hybridisation to detect chromosomal copy number alterations in cell line material and tumour tissue. Cytogenet Genome Res","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":937728,"title":"SS: Optimization and evaluation of T7 based RNA linear amplification protocols for cDNA microarray analysis.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":939958,"title":"T: Expression and copy number analysis of TRPS1, EIF3S3 and MYC genes in breast and prostate cancer.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":924848,"title":"The use of whole genome amplification in the study of human disease. Prog Biophys Mol Biol","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":934211,"title":"Vogel W: Linkage of aggressive prostate cancer to chromosome 7q31-33 in German prostate cancer families.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":940689,"title":"Zunino F: Role of c-myc protein in hormone refractory prostate carcinoma: cellular response to paclitaxel. Biochem Pharmacol","authors":[],"date":"2004","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-01-01","abstract":"<p>Background: Prostate cancer (CaP) is a disease with multifactorial etiology that includes both genetic and environmental components. The knowledge of the genetic basis of CaP has increased over the past years, mainly in the pathways that underlie tumourigenesis, progression and drug resistance. The vast majority of cases of CaP are adenocarcinomas that likely develop through a pre-malignant lesion and high-grade prostatic intraepithelial neoplasia (HPIN). Histologically, CaP is a heterogeneous disease consisting of multiple, discrete foci of invasive carcinoma and HPIN that are commonly interspersed with benign glands and stroma. This admixture with benign tissue can complicate genomic analyses in CaP. Specifically, when DNA is bulk- extracted the genetic information obtained represents an average for all of the cells within the sample. Results: To minimize this problem, we obtained DNA from individual foci of HPIN and CaP by laser capture microdissection ( LCM). The small quantities of DNA thus obtained were then amplified by means of multiple-displacement amplification (MDA), for use in genomic DNA array comparative genomic hybridisation (gaCGH). Recurrent chromosome copy number abnormalities (CNAs) were observed in both HPIN and CaP. In HPIN, chromosomal imbalances involving chromosome 8 where common, whilst in CaP additional chromosomal changes involving chromosomes 6, 10, 13 and 16 where also frequently observed. Conclusion: An overall increase in chromosomal changes was seen in CaP compared to HPIN, suggesting a universal breakdown in chromosomal stability. The accumulation of CNAs, which occurs during this process is non- random and may indicate chromosomal regions important in tumourigenesis. It is therefore likely that the alterations in copy number are part of a programmed cycle of events that promote tumour development, progression and survival. The combination of LCM, MDA and gaCGH is ideally suited for the identification of CNAs from small cell clusters and may assist in the discovery of potential genomic markers for early diagnosis, or identify the location of tumour suppressor genes (TSG) or oncogenes previously unreported in HPIN and CaP.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:342<\/identifier><datestamp>\n      2017-10-31T13:57:52Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:62696F736369656E6365735F6D65646963696E65:6D6F6C65635F6D6963726F62<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/342\/<\/dc:relation><dc:title>\n        The Use of Whole Genome Amplification to Study Chromosomal Changes in Prostate Cancer: Insights into Genome-Wide Signature of Preneoplasia Associated with Cancer Progression<\/dc:title><dc:creator>\n        Hughes, S<\/dc:creator><dc:creator>\n        Yoshimoto, M<\/dc:creator><dc:creator>\n        Beheshti, B<\/dc:creator><dc:creator>\n        Houlston, R S<\/dc:creator><dc:creator>\n        Squire, J A<\/dc:creator><dc:creator>\n        Evans, A<\/dc:creator><dc:description>\n        <p>Background: Prostate cancer (CaP) is a disease with multifactorial etiology that includes both genetic and environmental components. The knowledge of the genetic basis of CaP has increased over the past years, mainly in the pathways that underlie tumourigenesis, progression and drug resistance. The vast majority of cases of CaP are adenocarcinomas that likely develop through a pre-malignant lesion and high-grade prostatic intraepithelial neoplasia (HPIN). Histologically, CaP is a heterogeneous disease consisting of multiple, discrete foci of invasive carcinoma and HPIN that are commonly interspersed with benign glands and stroma. This admixture with benign tissue can complicate genomic analyses in CaP. Specifically, when DNA is bulk- extracted the genetic information obtained represents an average for all of the cells within the sample. Results: To minimize this problem, we obtained DNA from individual foci of HPIN and CaP by laser capture microdissection ( LCM). The small quantities of DNA thus obtained were then amplified by means of multiple-displacement amplification (MDA), for use in genomic DNA array comparative genomic hybridisation (gaCGH). Recurrent chromosome copy number abnormalities (CNAs) were observed in both HPIN and CaP. In HPIN, chromosomal imbalances involving chromosome 8 where common, whilst in CaP additional chromosomal changes involving chromosomes 6, 10, 13 and 16 where also frequently observed. Conclusion: An overall increase in chromosomal changes was seen in CaP compared to HPIN, suggesting a universal breakdown in chromosomal stability. The accumulation of CNAs, which occurs during this process is non- random and may indicate chromosomal regions important in tumourigenesis. It is therefore likely that the alterations in copy number are part of a programmed cycle of events that promote tumour development, progression and survival. The combination of LCM, MDA and gaCGH is ideally suited for the identification of CNAs from small cell clusters and may assist in the discovery of potential genomic markers for early diagnosis, or identify the location of tumour suppressor genes (TSG) or oncogenes previously unreported in HPIN and CaP.<\/p><\/dc:description><dc:date>\n        2006-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/342\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Hughes, S, Yoshimoto, M, Beheshti, B, Houlston, R S, Squire, J A and Evans, A  (2006) The Use of Whole Genome Amplification to Study Chromosomal Changes in Prostate Cancer: Insights into Genome-Wide Signature of Preneoplasia Associated with Cancer Progression   BMC Genomics, 7 (1).       <\/dc:identifier><dc:relation>\n        10.1186\/1471-2164-7-65<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/342\/","10.1186\/1471-2164-7-65"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"BioMed CentralBMC Genomics\nssOpen AcceResearch article\nThe use of whole genome amplification to study chromosomal \nchanges in prostate cancer: insights into genome-wide signature of \npreneoplasia associated with cancer progression\nSimon Hughes1, Maisa Yoshimoto1, Ben Beheshti2, Richard S Houlston3, \nJeremy A Squire*1,4,6 and Andrew Evans5,6\nAddress: 1Applied Molecular Oncology, Ontario Cancer Institute, Princess Margaret Hospital, Toronto, Ontario M5G 2M9, Canada, 2Faculty of \nMedicine, University of Toronto, Toronto, Ontario M5G 2M9, Canada, 3Section of Cancer Genetics, Institute of Cancer Research, Sutton SM2 5NG, \nUK, 4Department of Medical Biophysics, Faculty of Medicine, University of Toronto, Toronto, Ontario M5G 2M9, Canada, 5Department of \nPathology, Princess Margaret Hospital, Toronto, Ontario M5G 2M9, Canada and 6Department of Laboratory Medicine and Pathobiology, \nUniversity of Toronto, Toronto, Ontario M5G 1L5, Canada\nEmail: Simon Hughes - simon.hughes@cancer.org.uk; Maisa Yoshimoto - myoshimo@uhnres.utoronto.ca; \nBen Beheshti - ben.beheshti@utoronto.ca; Richard S Houlston - richard.houlston@icr.ac.uk; Jeremy A Squire* - jeremy.squire@utoronto.ca; \nAndrew Evans - andrew.evans@uhn.on.ca\n* Corresponding author    \nAbstract\nBackground: Prostate cancer (CaP) is a disease with multifactorial etiology that includes both genetic and\nenvironmental components. The knowledge of the genetic basis of CaP has increased over the past years, mainly\nin the pathways that underlie tumourigenesis, progression and drug resistance. The vast majority of cases of CaP\nare adenocarcinomas that likely develop through a pre-malignant lesion and high-grade prostatic intraepithelial\nneoplasia (HPIN). Histologically, CaP is a heterogeneous disease consisting of multiple, discrete foci of invasive\ncarcinoma and HPIN that are commonly interspersed with benign glands and stroma. This admixture with benign\ntissue can complicate genomic analyses in CaP. Specifically, when DNA is bulk-extracted the genetic information\nobtained represents an average for all of the cells within the sample.\nResults: To minimize this problem, we obtained DNA from individual foci of HPIN and CaP by laser capture\nmicrodissection (LCM). The small quantities of DNA thus obtained were then amplified by means of multiple-\ndisplacement amplification (MDA), for use in genomic DNA array comparative genomic hybridisation (gaCGH).\nRecurrent chromosome copy number abnormalities (CNAs) were observed in both HPIN and CaP. In HPIN,\nchromosomal imbalances involving chromosome 8 where common, whilst in CaP additional chromosomal\nchanges involving chromosomes 6, 10, 13 and 16 where also frequently observed.\nConclusion: An overall increase in chromosomal changes was seen in CaP compared to HPIN, suggesting a\nuniversal breakdown in chromosomal stability. The accumulation of CNAs, which occurs during this process is\nnon-random and may indicate chromosomal regions important in tumourigenesis. It is therefore likely that the\nalterations in copy number are part of a programmed cycle of events that promote tumour development,\nprogression and survival. The combination of LCM, MDA and gaCGH is ideally suited for the identification of\nCNAs from small cell clusters and may assist in the discovery of potential genomic markers for early diagnosis,\nor identify the location of tumour suppressor genes (TSG) or oncogenes previously unreported in HPIN and CaP.\nPublished: 30 March 2006\nBMC Genomics2006, 7:65 doi:10.1186\/1471-2164-7-65\nReceived: 27 November 2005\nAccepted: 30 March 2006\nThis article is available from: http:\/\/www.biomedcentral.com\/1471-2164\/7\/65\n© 2006Hughes et al; licensee BioMed Central Ltd.\nThis is an Open Access article distributed under the terms of the Creative Commons Attribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), \nwhich permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.Page 1 of 10\n(page number not for citation purposes)\nBMC Genomics 2006, 7:65 http:\/\/www.biomedcentral.com\/1471-2164\/7\/65Background\nThe worldwide occurrence CaP is increasing and it has\nnow overtaken lung cancer as the most commonly diag-\nnosed malignancy in men in the Western World. In spite\nof significant progress in its clinical management, com-\nparatively little is known about the aetiology of the dis-\nease and predicting outcome is still a challenge for most\nclinicians. Histopathologically, CaP displays considerable\nheterogeneity and can contain a substantial admixture of\npre-malignant HPIN glands within cancerous foci. HPIN\nis currently considered to be the most likely precursor to\ninvasive CaP [1]. However, most of these foci are latent\nand rarely develop into clinically detectable cancer.\nUnfortunately, a significant number (3%) do progress\nand can become aggressive and lethal [2]. The major diffi-\nculty facing clinicians is the identification of patients pre-\nsenting with early stage CaP, who are likely to develop\nlife-threatening disease. As a result, intensive research is\ncurrently underway to identify the key alterations that\nmay prove to be important for both classification and\nprognosis prediction.\nThe advent and development of CGH, which started in the\nearly 1990's [3], has revolutionised cytogenetics and\nallowed for genome-wide screening of numerous cancer\ntypes and the identification of genomic CNA, which may\ncontribute to cancer development and progression. The\naccumulation of genetic changes that occurs during the\nstepwise evolution from normal tissue to metastasis,\nalthough likely due to increased genetic instability, may\nindicate the chromosomal locations of TSG or oncogenes\nthat are important in tumourigenesis. When first intro-\nduced, CGH used metaphase chromosomes targets to\nidentify CNAs. However, recent advances have substituted\nthese with arrayed DNA sequences that provide higher res-\nolution, 1 Mb versus 10 Mb, and greater ease of analysis.\nWhole genome scans of CaP patients and cell lines have\nidentified consistent, chromosomal alterations, which\ninclude recurrent loss of chromosomal regions from 5p,\n6q, 8p, 10q, 13, 16q and 17p, in addition to gain on 1q,\n3q 7p, 7q, 8q 11p, 17q and Xpq [4-6]. Nonetheless, one\npotential limitation with current CGH methodology is its\nrequirement for microgram quantities of genomic DNA.\nWhen studying cell lines this is not necessarily a matter for\nconcern, as it is relatively straightforward to produce a suf-\nficient quantity of clonal cells to obtain many micrograms\nof DNA. However, when studying patient tissue if DNA is\n\"bulk extracted\" from a heterogeneous non-clonal\ntumour mass the data obtained will represent an average\nvalue for all cells within the specimen and any clinically\ninformative genetic changes, restricted to small cell clus-\nters, may be masked. As a result, when studying a hetero-\ngeneous tissue, such as prostate, it is essential to obtain\npure cell populations via methods such as macrodissec-\ntion or LCM. The DNA extracted from the dissected mate-\nrial can then be amplified using a whole genome\namplification (WGA) technique [7], such as MDA [8-11].\nThe combination of LCM and WGA can generate suffi-\ncient amounts of DNA for extensive genome analyses.\nSeveral large studies have demonstrated the ability of\nMDA to accurately amplify human genomic DNA. When\nused in SNP genotyping [12,13] an estimated 99.82% of\nthe genome is covered with a reported concordance, to\nnon-amplified DNA, of greater than 99% [14]. In addi-\ntion, the sequence error rate is only 7.6 × 106 [13] and pre-\nvious results obtained from gaCGH, using amplified\nDNA, are almost indistinguishable from those obtained\nfrom non-amplified DNA [10,15].\nAn understanding of the molecular mechanisms behind\ncancer development will enable identification of molecu-\nlar and cytogenetic biomarker(s) that may be useful in\npredicting early transformation into an aggressive pheno-\ntype, as well as, providing fundamental insights into the\nregulatory pathways of genome  integrity that may lead to\nmultistep field cancerization and HPIN and CaP. In the\npresent study, we describe the use of LCM, MDA and\ngaCGH, using a 1 Mb array (Spectral Genomics, USA) to\ninvestigate copy number changes occurring in prostate\ncancer by the analysis of 7 prostatic samples containing\nHPIN and 8 CaP specimens.\nResults\nTo determine whether whole genomic amplification\nexhibited bias or a distortion of imbalance assignments,\ncontrol CGH experiments comparing the results obtained\nbefore and after amplification (normal male versus nor-\nmal male, normal male versus normal female and DNA\nfrom a cancer cell line versus normal control DNA) from\nthe same original DNA samples were performed. These\nare presented in Additional Files 1, 2, 3 and it is evident\nthat no major distortion of imbalance was introduced by\namplification of genomic DNA.\nA summary of the chromosomal CNAs detected by CGH\nfor the 7 HPIN and 8 CaP samples is shown in Table 1 and\n2 and displayed graphically in Figure 1 (for HPIN blue =\nloss, yellow = gain; for CaP red = loss, green = gain). Figure\n2 shows the frequency of CNAs detected at the level of\neach chromosomes arm for HPIN and CaP. The general\npattern of loss or gain was very similar in the HPIN and\nCaP samples, however CaP samples possessed signifi-\ncantly more aberrations (90 CNAs) than HPIN samples\n(41 CNAs) (P<0.001, chi square test). The average\nnumber of CNAs for the 7 HPIN samples was 5.8 (range 3\nto 8, median 6). For the 8 CaP samples an average of\n11.25 (range 5 to 18, median 11.5) amplifications or dele-\ntions were observed. When studied at the 850 cytoband\nlevel (minus X and Y chromosome cytobands), HPINPage 2 of 10\n(page number not for citation purposes)\nBMC Genomics 2006, 7:65 http:\/\/www.biomedcentral.com\/1471-2164\/7\/65samples had the total of 65 affected bands (average 9,\nrange 4 to 14) and CaP samples 143 affected breakpoints\nbands (average 18, range 8 to 27). This difference is statis-\ntically significant (P<0.001, chi square test). In addition,\nfor both the HPIN and CaP samples there were a signifi-\ncantly greater number of cytobands lost than gained\n(P<0.01, chi squared test) (Table 1).\nIn the 7 HPIN samples recurrent chromosomal changes,\ndetected in greater  than 25% of cases, were losses found\non 8p (7 out of 7 cases, 100%), 6q,  13q, 16q (2 out of 7\ncases, 28.5%, each), whereas gains were found on 8q  and\n16p (3 out of 7 cases, 43%, each), 1p, 7p and 20q (2 out\nof 7 cases,  28.5%, each). For the 8 CaP samples recurrent\nchromosomal changes,  detected in greater than 25% of\ntumours, were losses on 8p (8 out of 8  cases, 100%), 10q\n(6 out of 8 cases, 75%), 13q (5 out of 8 cases,  62.5%), 6q\n(4 out of 8 cases, 50%), 1p, 16q (3 our of 8 cases, 37.5%),\n5q, 12p, 18q (2 out of 8 cases, 25%, each) and gains on\n7q (6 out of 8  cases, 75%), 7p, 8q (5 out of 8 cases,\n62.5%, each), 4p, 16p, 19p (2 out  of 8 cases, 25%).  \nSmall consensus regions of consistent CNA were observed\nfor both HPIN and CaP samples (Table 3), in >25% of\nsamples. For example, 8p region was consistently lost in\nHPIN (100%), but within the cytoband 8p11.23-p23.2\nthat was commonly lost in >50% of the HPIN samples.\nSimilarly, 8p was consistently lost in CaP (100%), but\nChromosomal alterations observed for HPIN and CaP DNA samplesFigure 1\nChromosomal alterations observed for HPIN and CaP DNA samples. Blue bars indicate loss in HPIN and yellow bars indicate \ngain in HPIN. Red bars indicate loss in CaP and green bars indicate gain in CaP.\nTable 1: Frequency of chromosome copy number abnormalities and affected cytoband breakpoints in CaP and HPIN.\nType Breakpoints CNAs\nLoss Gain Total Loss Gain Total\nCaP 84 59 143 52 38 90\nHPIN 32 33 65 21 20 41\nCaP+HPIN 116 92 208 73 58 131Page 3 of 10\n(page number not for citation purposes)\nBMC Genomics 2006, 7:65 http:\/\/www.biomedcentral.com\/1471-2164\/7\/65within the cytoband 8p11.22-p23.2 that was commonly\nlost in >60% of the CaP samples. A list of the genes\npresent within these consensus or commonly lost regions\nis displayed in Table 3.\nDiscussion\nChromosome copy number abnormalities (CNAs) are\ncommon in most cancers, with specific regions of ampli-\nfication or deletion being associated with specific tumour\ntypes, stages or outcomes [16-18]. The introduction of\nmetaphase CGH [3] to study these CNAs has eliminated\nthe requirement to obtain metaphase spreads from the\ntumour samples, which was often challenging due to tech-\nnical difficulties in culturing certain tissues. Though met-\naphase CGH allows for more samples to be examined, it\nprovides a relatively limited resolution and still requires\nsubstantial cytogenetic experience to analyse the results.\nThe recent development of array CGH has opened up the\nfield of CGH research and permitted more laboratories to\nstudy an ever-increasing number of tumour types and\nstages. The application of BAC microarrays to analyse\nhuman samples is straightforward and their high-\nthroughput nature makes them the method of choice for\nrapid detection of genetic alterations.\nWhen analysing heterogeneous tumour samples, the\ngaCGH results obtained from \"bulk extracted\" DNA are\nlikely to be inaccurate. However, with the use of LCM and\nMDA we have been to able obtain highly purified HPIN\nand CaP DNA and thus identify the particular chromo-\nsomal changes associated with the two disease stages.\nIn this study, we have used a 2,400-element BAC microar-\nray with a resolution of ~1 Mb to study CNAs in a set of\n15 patient samples comprised of 7 HPIN cases and 8 CaP\ncases. For the 7 HPIN cases, 41 genomic alterations (20\ngains, 21 losses) were identified, in contrast to the 90\ngenomic alterations (38 gains, 52 losses) seen for the 8\nCaP cases. As with other cancers, CaP development and\nprogression is likely to be the outcome of a series of step-\nwise genetic changes. The accumulation of CNAs, which\noccurs during this process, although likely due to\nincreased genetic instability, is non-random and may\nindicate chromosomal regions important in tumourigen-\nesis. It is suggested that failure in the fidelity of homolo-\ngous recombination within the repetitive sequences, that\ncomprise the kinetochore complex, could lead to recur-\nrent loss of 8p and gain of 8q by rearrangement of chro-\nmosome 8-specific alphoid centromeric sequences. Thus,\nthe high fidelity process of homologous recombination\ncan be the major DNA repair pathway, which is indispen-\nsable for the maintenance of genetic stability.\nExamination of our array results indicates that aberrations\ninvolving parts or all of 1p, 6q, 7p, 7q, 8p, 8q, 10q, 13q\n16p and 16q are most common, which is concordant with\nTable 2: Chromosomal changes in microdissected HPIN and CaP DNA samples.\nTumour Type Loss Gain\nCaP 2-02 HPIN 3q13.33-q21.1; 6p24.1-pter; 8p11.1-p23.2; 13q14.3-q31.2 1p21.3-p31.1; 2q24.3-q31.1; 8q23.3-qter; 11p14.3-p15.1\nCaP 5-02 HPIN 6q14.1-q16.3; 8p23.1-pter; 16q21-qter 1p22.3-p31.1; 7p15.1-p15.3; 8q13.3-qter\nCaP 24-01 HPIN 2p23.1-p25.2; 4q22.1-q34.1; 8p11.23-pter 3q21.2-q24; 12q14.3-q21.33\nCaP 37-02 HPIN 8p23.1-pter; 7p22.1-pter; 20q11.22-q13.11\nCaP 70-01 HPIN 6q16.3-q22.1; 8p11.21-pter; 13q13.1-q14.3 7p21.3-p22.1; 8q21.11-qter; 16p12.3-pter; 20q11.23-q13.2\nCaP 74-01 HPIN 8p21.1-pter; 10q21.3-q23.1; 18q21.32-q22.2; 21q21.3-qter 7q32.3-q36.1; 16p12.3-p13.13; 20p11.23-p12.1\nCaP 36-02 HPIN 8p11.23-pter; 10q23.31-q25.1; 16q22.1-qter 16p12.2-pter; 17q24.2-qter\nCaP 7-99 Cancer 2q14.2-q21.2; 5q14.1-q22.1; 6q16.1-q21; 8p21.3-p23.1; \n10q22.1-q23.33; 13q14.11-q22.2\n4q21.21-q21.23; 7p15.3-p21.3; 7q11.23\nCaP 7-01 Cancer 1p21.1-p32.3; 2q33.1-q33.3; 5q14.1-q21.3; 6q16.1-q22.1; \n8p11.23-pter; 10q23.31-qter; 13q12.13-q14.11\n4p13-p15.1; 4q22.2-q24; 7q31.1-qter; 8q21.11-qter; 9p22.3-\np24.1; 14q13.1-q21.3\nCaP 7-02 Cancer 2q24.2-q31.1; 7q22.3-qter; 8p11.22-pter; 10q22.2-q23.33; \n18q11.1-q22.3\nCaP 11-01 Cancer 8p11.21-pter; 10q22.2-q23.33; 12p13.2; 13q13.3-q32.2; \n16q24.1-qter; 22q11.21-qter\n1q32.1; 5q14.2-q14.3; 8q13.3-q21.2\nCaP 11-02 Cancer 1p13.1-p13.2; 1p22.3; 2p16.3; 6q12-q16.1; 8p21.1-pter; \n10q25.3-q26.11\n7p22.1-pter; 7q11.23; 8q22.3-qter; 16p12.2-pter; 19p; \n19q13.33-qter\nCaP 14-00 Cancer 6p24.1-pter; 8p11.21-pter; 10q23.31-q23.32; 15q22.33-q24.1 1p21.3-p32.1; 3q25.33-q27.3; 4p13-p15.1; 4q13.1-q13.3; \n7p15.3-p22.1; 7q21.11-q21.3; 7q31.1-q31.33; 8q11.22-qter; \n11q14.1-14.3\nCaP 14-02 Cancer 1p13.1-p13.2; 1p22.3; 6q16.1-q16.3; 8p21.2-p23.1; 8q12-qter; \n10q21.1-q21.2; 10q23.1-q23.32; 10q25.2-q26.11; 11q22.3-\nqter; 12p13.2; 13q12.3-q21.33; 15q13.1-q21.3; 16q12.2-qter\n7p22.1-pter; 7q11.23; 8p23.2-pter; 18q21.1; 20q11.21-q13.12\nCaP 32-02 Cancer 3q26.33-q27.3; 8p11.22-p23.2; 13q13.3-qter; 16q23.1-qter; \n18q21.33-q22.1\n1p35.2-p36.11; 7p22.1-p22.2; 7q11.23; 15q11.2-q22.32; \n16p12.2-13.11; 19p13.11-pterPage 4 of 10\n(page number not for citation purposes)\nBMC Genomics 2006, 7:65 http:\/\/www.biomedcentral.com\/1471-2164\/7\/65previous metaphase [19,20] and array CGH [4,21] results.\nIt is therefore likely that the alterations in copy number\nare part of a programmed cycle of events that promote\ntumour development and progression as well having an\nimpact on disease-specific survival.\nA comparison of the CNAs present in the HPIN and CaP\nsamples identified a significant increase in copy number\nfor 7q (P<0.01, chi square test) and a significantly\nincreased frequency of loss for 10q (P<0.01, chi square\ntest) and 13q (P<0.0001, chi square test). In genotype\/\nphenotype correlations, gain of chromosome 7q [22] and\nloss of 13q [23] have been associated with advancing\ntumour stage and aggressiveness, which is in agreement\nwith the results presented here. However, gain of 8q [24]\nand loss of 16q [25] have also been linked to tumour pro-\ngression, but our data do not show any significant differ-\nence for these CNAs in our HPIN and CaP samples. This\nwould suggest that 8q and 16q CNA's are likely to be early\nevents in tumourigenesis. In addition, they may also iden-\ntify HPIN and CaP samples that are likely to progress.\nApart from the commonly reported CNAs, additional\nalterations that have been less frequently reported in ear-\nlier CGH studies have also been identified. These include\ngains on 12q (HPIN) and loss of 4q and 10q (HPIN and\nCaP). Whether the identification of 12q and 4q regions\nwill provide additional insight into CaP progression is not\nyet clear. Further analysis using a platform such as tissue\nmicroarrays, which permits the screening of different dis-\nSummary of chromosomal losses and gains in a) HPIN (n = 7) and b) CaP (n = 8)Figure 2\nSummary of chromosomal losses and gains in a) HPIN (n = 7) and b) CaP (n = 8). Number of samples of each type with gain or \nloss of the chromosome arm is shown by black and grey bars, respectively.Page 5 of 10\n(page number not for citation purposes)\nBMC Genomics 2006, 7:65 http:\/\/www.biomedcentral.com\/1471-2164\/7\/65ease stages from large patient cohorts, will help better\nidentify their frequency and also the potential use of\ngenomic imbalance in diagnosis of CaP. The value of\ngenomic analysis in CaP was recently demonstrated by the\ndiscovery of a high frequency of chromosomal transloca-\ntions leading to rearrangement of the fusion oncoproteins\nERG or ETV1 with TMPRSS2 [26].\nA common problem when analysing archival tissue is the\navailability of a suitable quality and quantity of RNA to\nstudy expression changes. Though RNA amplification tech-\nniques [27] can generate a sufficient quantity, obtaining\nRNA of the required quality is often challenging. Previous\nreports have demonstrated a relationship between altera-\ntions in chromosomal copy number and alterations in\nTable 3: Consensus regions of copy number gain. Names in bold indicate those genes that have been implicated in prostate cancer. \nThe * symbol indicates the same candidate genes from HPIN.\nChromosome Region Frequency Candidate genes\nHPIN Gain\n1p 1p22.3 – p31.1 37.5% IGFBP10\n2q 2q24.3 – q31.1 25% TLK1, ITGA6\n7p 7p22.1 37.5% NUDT1, PDGFA\n7p15.1 – p15.3 25% GPNMB, AHR\n8q 8q21.11 – qter >37.5% PTK2, RAD21, MLZE, WISP1, NOV, ENPP2, MYC, PSCA, PTP4A3, KCNK9, TPD52, MMP16, \nNBS1, FABP5, E2F5, BAALC, EBAG9\n12q 12q14.3 – q21.33 25% MDM2\n16p 16p12.3 – p13.13 37.5% BFAR\n20q 20q11.23 – q13.11 25% MMP9, C20ORF1, SRC, GHRH, E2F1, DNLC2A, BASE, CDC91L1, WFDC2, SLPI, \nCYP24, BMP7, CSE1L\nHPIN Loss\n4q 4q34.1 25% FAT, MORF4, CASP3\n6q 6q16.3 37.5%\n8p 8p11.23 – p23.3 >50% SFRP1, NKX3A, TRIM35, REAM, RB1CC1, PDGFRL, FGL1, TNFRSF10B, LZTS1, DLC1, MTSG1, \nTUSC3, FLJ32642, MTSS1, PINX1, DEFB1, CSMD1\n10q 10q23.1 25%\n10q23.2 – q25.1 25% PTEN, MXI1, LGI1, PDCD4, LAPSER1, RNF27, SUFU, CASP7, LIMAB1, NEURL\n13q 13q13.1 – q14.13 RFP2, TSC22, DBM, DDX26, KCNRG\n13q14.3 25% DLEU2, DLEU1, CHC1L, FAM10A4, FKHR\n16q 16q22.1 – qter 37.5% TERF2, CDH1, DERPC, WWOX, OKL38, CBFA2T3, CDH13, WFDC1, MAF, FOXF1, MVD\n18q 18q21.32 – q22.2 25% PMAIP1\nCaP Gain\n4p 4p13 – p15.1 25% UCHL1, CD38\n7p 7p22.1 50% *\n7q 7q11.23 50% LIMK1, CLDN4, HSPB1\n7q31.1 – q31.33 25% NRCAM, PTPRZ1, POT1\n8q 8q21.11 – qter >50% *\n16p 16p12.2 – p13.13 25% *\n19p 19p13.11 – pter 25% VAV1, RAB3D, ELAVL1, JUN-B, JUN-D,EPOR, DRIL1, BSG, ANGPTL4\nCaP Loss\n1p 1p22.3 37.5%\n1p13.1 – p13.2 25% ST7L\n5q 5q14.2 – q14.3 25%\n6q 6q16.1 50%\n8p 8p11.22 – p23.3 >50% *\n10q 10q22.2 – q23.33 >37.5% UNC5B, BMPR1A, BLNK, PTEN\n10q25.3 – q26.11 37.5% DMBT1, TACC2, WDR11, FGFR2, DEC, BCCIP\n12p 12p13.2 25% CD9\n13q 13q13.3 – q26.11 >50% BRCA3, KLF5 *\n16q 16q24.1 – qter 37.5% *\n18q 18q21.33 – q22.1 25% *\n* indicates the same candidate genes from HPIN. Names in bold indicate those genes that have been implicated in prostate cancer.Page 6 of 10\n(page number not for citation purposes)\nBMC Genomics 2006, 7:65 http:\/\/www.biomedcentral.com\/1471-2164\/7\/65gene expression [28,29]. The ability to distinguish these\nregions will point to genes, which may either directly\n(tumour suppressor gene loss or oncogene gain) or indi-\nrectly contribute to tumour development and progression.\nAs a result, CGH can be used as a surrogate for gene identi-\nfication. Candidate genes, which have previously been\nimplicated in CaP have been highlighted in bold in Table\n3. The roles of MYC [30-32], PSCA [33-35], and MDM2\n[36-38] have all been well reported and alterations in gene\ndosage correlate well with their change in expression.\nHowever, other candidate genes have been less well stud-\nied. For example, EBAG9, whose increased expression in\nCaP is a negative prognostic indicator, has a potential role\nin progression by enabling cancer cells to evade the\nimmune response [39]. NBS1, which has been identified as\na founder mutation causing an increased susceptibility to\nprostate cancer [40], is involved in processing\/repair of\nDNA double strand breaks and in cell cycle checkpoints,\nthus its deregulation will likely contribute to chromosomal\ninstability. FKHR, which is a member of the FOXO fork-\nhead transcription factor family, is thought to play a regu-\nlatory role in several cellular functions including cell\nproliferation and survival [41]. Loss of FKHR expression, as\nobserved in CaP cell lines, is likely to abrogate this control\nleading to tumour cell growth. Though these genes have\npreviously been implicated in CaP there are additional\ngenes, including both oncogenes and tumour suppressor\ngenes, which reside within all of the affected regions that\nmay play an important role in the aetiology of the disease.\nFurther analysis of these other candidates may identify\ntheir potential as molecular targets for diagnosis and treat-\nment.\nSeveral of the genes present within altered regions of the\ngenome are associated with genetic pathways, indicating\nthat these pathways are likely to be important in prostate\ntumourigenesis.\nConclusion\nThe combination of techniques used in this study has\nallowed for the identification of consistent regions of\ncopy number change, ranging from specific cytobands to\nwhole chromosomes, starting with as little as 5–10 ng of\nDNA. Through our use of LCM, we have also identified\nseveral lower frequency CNAs which may not have been\ndetected when using bulk extracted DNA due to the heter-\nogeneous nature of prostate tissue. In addition, several\ninteresting candidate genes have been observed within the\naltered chromosomal regions. Although some have\nalready been extensively studied others, which have not,\nmay prove to be of clinical importance. Genetic screening\nstrategies that combine FISH and immunohistochemistry\nfor the detection of various combinations of chromo-\nsomal gains and\/or losses and altered gene expression are\nlikely to be of great use in diagnosis and prognosis predic-\ntion.\nMethods\nTissue accrual\nFresh prostate tissue was obtained from radical prostatec-\ntomies performed at The University Health Network\n(UHN), Toronto, with the informed patient consent and\napproval of the institutional research ethics board. The tis-\nsue was embedded in OCT frozen section medium\n(Stephens Scientific, Riverdale NJ, USA) and stored at -\n80°C until required. For all samples, the presence of\nHPIN and CaP was verified by histologic assessment of\nfrozen sections by a urological pathologist (A.E.).\nCohort selection\nPatient samples for gaCGH analysis were selected based\non two criteria; first, the presence of clearly identifiable\nregions of HPIN and\/or CaP and second, the availability\nof good quality high molecular weight DNA. DNA quality\nwas assessed by DNA extraction from a single tissue sec-\ntion and visualisation by agarose gel electrophoresis. A\ncohort consisting of 15 cases (7 HPIN and 8 CaP derived\nfrom different patients) were selected based on these cri-\nteria.\nLaser capture microdissection\nThe selected fresh-frozen prostate tissue samples were cut\nonto microscope slides (8 µm thickness) and stained\nusing the HistoGene LCM frozen section staining kit (Arc-\nturus, USA). Foci of HPIN and CaP were identified from\nstained prostate tissue sections and a minimum of 1000\ncells were removed from these regions by LCM using the\nCell Robotics LaserScissors system (Cell Robotics Inc.,\nUSA).\nDNA extraction\nDNA was extracted using the QIAamp DNA Micro Kit\n(Qiagen, USA) and the DNA concentration was deter-\nmined using the PicoGreen dsDNA Quantitation kit\n(Molecular Probes Inc., USA). Both procedures were per-\nformed following manufacturers instructions.\nStrand displacement amplification\nDNA was amplified using the GenomiPhi Amplification\nKit (Amersham Biosciences, USA) according to manufac-\nturer's instructions. Briefly, amplification was carried out\nin two individual steps. The step 1 reaction mixture con-\ntained 5–10 ng (1000 to 2000 cell equivalents) of DNA\n(from diluted reference or test DNA) in 1 µl of sterile\nwater and 9 µl of Sample Buffer. This mixture was heated\nat 95°C for 3 minutes and then chilled on ice. The step 2\nreaction (amplification) mixture contained 9 µl of Reac-\ntion Buffer, 1 µl of Enzyme Mix and the 10 µl from Step\n1. The amplification reaction was incubated at 30°C forPage 7 of 10\n(page number not for citation purposes)\nBMC Genomics 2006, 7:65 http:\/\/www.biomedcentral.com\/1471-2164\/7\/6516–18 hours. The enzyme was inactivated by heating at\n65°C for 10 minutes, followed by cooling to 4°C. This\nmethod of WGA consistently produced in excess of 5 µg\nof DNA from a starting concentration of 5–10 ng.\nAssessment of DNA quality and strand displacement \namplification\nFive microlitres of each amplification reaction was electro-\nphoresed through a 1% agarose gel and stained with\nethidium bromide in order to assess product yield and\nproduct length. All amplification products were purified\nby phenol-chloroform extraction and DNA concentration\nand purity were determined by measuring absorbance at\nA260 and A280.\nSpectral genomic BAC arrays\nThe genomic DNA arrays used in these experiments were\nobtained from Spectral Genomics Inc. and consist of\napproximately 2400 unique BAC and PAC clones, which\nprovide an average genomic resolution of 1 Mb. CGH\nexperiments were performed using the amplified patient\nDNA as the \"test\" and amplified female placental DNA as\nthe \"normal\". In addition, control experiments were per-\nformed, corresponding to DNA before and after amplifi-\ncation (normal non-neoplastic prostate epithelial DNA\nversus normal non-neoplastic prostate epithelial DNA,\nnormal non-neoplastic prostate epithelial DNA versus\nnormal female placental DNA and DNA from a cancer cell\nline versus normal control DNA).\nReference DNA and test DNA were first digested overnight\nat 37°C using 10 units of RsaI (Invitrogen) in a 10 µl reac-\ntion. The digested DNA was labeled using the protocol\noptimized by Spectral Genomics, with separate labeling\nreactions for Cy3 and Cy5 being set up for both reference\nand test DNA. Briefly, labeling reaction were set up con-\ntaining 2 µg of DNA, 20 µl of 2.5× random primer\/reac-\ntion buffer mix (Invitrogen) and sterile water up to a final\nvolume of 45 µl. The reaction mix was boiled for 5 min-\nutes prior to cooling on ice and the addition of 2.5 µl of\nSpectral labeling buffer (Spectral Genomics, Houston,\nU.S.A), 1.5 µl of either Cy3-dCTP (1mM, Applied Biosys-\ntems, Foster City, U.S.A) or Cy5-dCTP (1 mM, Applied\nBiosystems) and 1 µl of Klenow Fragment (BioPrime labe-\nling kit, Invitrogen). The reaction was mixed gently and\nthen incubated for 2 hours at 37°C. Following incubation\nthe reaction was stopped by the addition of 5 µl 0.5 M\nEDTA (pH8) and heating at 72°C for 10 minutes.\nThe Cy3 labeled test DNA was combined with the Cy5\nlabeled normal reference DNA and vice versa. Each com-\nbined probe was mixed with 45 µl of Spectral Hybridisa-\ntion Buffer (Spectral Genomics), 11.3 µl of 5 M NaCl and\n110 µl of room temperature isopropanol. The samples\nwere incubated in the dark at room temperature for 10–15\nminutes and centrifuged at 16,000 x g for 10 minutes and\nthe supernatant discarded. The pellets were then washed\nwith 500 µl of 70% ethanol. The supernatant was carefully\nremoved and the pellets air-dried at room temperature in\nthe dark. For hybridisation, the pellets were first resus-\npended in 10 µl of sterile water prior to being mixed with\n30 µl of Spectral Hybridisation Buffer II (Spectral Genom-\nics) by pipetting. The reconstituted probes were then incu-\nbated at 72°C for 10 minutes, placed on ice for 5 minutes\nand then incubate for 30 minutes at 37°C. The probes\nwere hybridised to BAC arrays, covered with a 22 × 60 mm\ncoverslip and incubated for 12–16 hours at 37°C in a\nhumidified chamber.\nThe wash buffers, with the exception of Wash I, were pre-\nwarmed to 50°C. The slides were gently dipped into and\nout of Wash I (2× SSC, 0.5% SDS) until the coverslip\ndetached from the slide. The slides were then washed once\nin Wash II (2 × SSC, 50% deionized Formamide, pH 7.5)\nfor 20 minutes, followed by successive washes in Wash III\n(2× SSC, 0.1% NP-40, pH 7.5) for 20 minutes and Wash\nIV (0.2× SSC, pH 7.5) for 10 minutes. All washes were per-\nformed at 50°C, with the exception of Wash I. The slides\nwere briefly submerged in distilled deionized water for 5–\n10 seconds and centrifuged for 5 minutes at 750 rpm to\ndry.\nData collection and analysis\nThe slides were scanned using an Axon GenePix 4000 A\nconfocal scanner, each fluorescence signal was collected\nseparately and quantified with the GenePix Pro 3.0 soft-\nware (Axon Instruments, U.S.A). The data was normalised\nand analysed using Normalise Suite v2.4 [42], all regions\nof loss or gain were determined as those that were 2 stand-\nard deviations above the mean baseline for each separate\nsample.\nAuthors' contributions\nSH and MY designed and carried out the study, in addi-\ntion to preparing the final manuscript for publication. BB\nhelped with the analysis of the data. AE helped in the\nselection of cases and worked closely with JS in the study\ndesign and coordination.\nAdditional material\nAdditional File 1\nGenomic comparison of gaCGH results obtained from non-amplified male \nDNA versus non-amplified male DNA hybridisation and amplified male \nDNA versus amplified male DNA hybridisation. Blue line indicates the \nchromosome position plotting of amplified DNA data. Black line indicates \nthe chromosome position plotting of non-amplified DNA data.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1471-\n2164-7-65-S1.png]Page 8 of 10\n(page number not for citation purposes)\nBMC Genomics 2006, 7:65 http:\/\/www.biomedcentral.com\/1471-2164\/7\/65Acknowledgements\nWe would like to thank the researchers at Princess Margaret Hospital tis-\nsue procurement facility for their help and technical assistance in securing \ngood quality samples for this study. We also like to thank Roger Lasken for \nhis advice. This work was supported by the National Cancer Institute of \nCanada with funds from the Canadian Cancer Society and by awards to S.H. \nand M.Y. from the United States Army Medical Research and Materiel \nCommand [DAMD17-03-1-0154].\nReferences\n1. van der Kwast TH, Labrie F, Tetu B: Persistence of high-grade\nprostatic intra-epithelial neoplasia under combined andro-\ngen blockade therapy.  Hum Pathol 1999, 30:1503-1507.\n2. Al-Maghrabi J, Vorobyova L, Toi A, Chapman W, Zielenska M, Squire\nJA: Identification of numerical chromosomal changes\ndetected by interphase fluorescence in situ hybridization in\nhigh-grade prostate intraepithelial neoplasia as a predictor\nof carcinoma.  Arch Pathol Lab Med 2002, 126:165-169.\n3. Kallioniemi A, Kallioniemi OP, Sudar D, Rutovitz D, Gray JW, Wald-\nman F, Pinkel D: Comparative genomic hybridization for\nmolecular cytogenetic analysis of solid tumors.  Science 1992,\n258:818-821.\n4. van Dekken H, Paris PL, Albertson DG, Alers JC, Andaya A, Kowbel\nD, van der Kwast TH, Pinkel D, Schroder FH, Vissers KJ, Wildhagen\nMF, Collins C: Evaluation of genetic patterns in different\ntumor areas of intermediate-grade prostatic adenocarcino-\nmas by high-resolution genomic array analysis.  Genes Chromo-\nsomes Cancer 2004, 39:249-256.\n5. Wolf M, Mousses S, Hautaniemi S, Karhu R, Huusko P, Allinen M,\nElkahloun A, Monni O, Chen Y, Kallioniemi A, Kallioniemi OP: High-\nresolution analysis of gene copy number alterations in\nhuman prostate cancer using CGH on cDNA microarrays:\nimpact of copy number on gene expression.  Neoplasia 2004,\n6:240-247.\n6. Clark J, Edwards S, Feber A, Flohr P, John M, Giddings I, Crossland S,\nStratton MR, Wooster R, Campbell C, Cooper CS: Genome-wide\nscreening for complete genetic loss in prostate cancer by\ncomparative hybridization onto cDNA microarrays.  Onco-\ngene 2003, 22:1247-1252.\n7. Hughes S, Arneson N, Done S, Squire J: The use of whole genome\namplification in the study of human disease.  Prog Biophys Mol\nBiol 2005, 88:173-189.\n8. Dean FB, Hosono S, Fang L, Wu X, Faruqi AF, Bray-Ward P, Sun Z,\nZong Q, Du Y, Du J, Driscoll M, Song W, Kingsmore SF, Egholm M,\nLasken RS: Comprehensive human genome amplification\nusing multiple displacement amplification.  Proc Natl Acad Sci U\nS A 2002, 99:5261-5266.\n9. Dean FB, Nelson JR, Giesler TL, Lasken RS: Rapid amplification of\nplasmid and phage DNA using Phi 29 DNA polymerase and\nmultiply-primed rolling circle amplification.  Genome Res 2001,\n11:1095-1099.\n10. Lage JM, Leamon JH, Pejovic T, Hamann S, Lacey M, Dillon D, Seg-\nraves R, Vossbrinck B, Gonzalez A, Pinkel D, Albertson DG, Costa J,\nLizardi PM: Whole genome analysis of genetic alterations in\nsmall DNA samples using hyperbranched strand displace-\nment amplification and array-CGH.  Genome Res 2003,\n13:294-307.\n11. Lasken R: Multiple displacement amplification of genomic\nDNA.  In Whole Genome Amplification: Methods Express Edited by:\nHughes SLR. Oxford, Scion Publishing Ltd.; 2005:99-118. \n12. Barker DL, Hansen MS, Faruqi AF, Giannola D, Irsula OR, Lasken RS,\nLatterich M, Makarov V, Oliphant A, Pinter JH, Shen R, Sleptsova I,\nZiehler W, Lai E: Two methods of whole-genome amplification\nenable accurate genotyping across a 2320-SNP linkage\npanel.  Genome Res 2004, 14:901-907.\n13. Paez JG, Lin M, Beroukhim R, Lee JC, Zhao X, Richter DJ, Gabriel S,\nHerman P, Sasaki H, Altshuler D, Li C, Meyerson M, Sellers WR:\nGenome coverage and sequence fidelity of phi29 polymer-\nase-based multiple strand displacement whole genome\namplification.  Nucleic Acids Res 2004, 32:e71.\n14. Tzvetkov MV, Becker C, Kulle B, Nurnberg P, Brockmoller J,\nWojnowski L: Genome-wide single-nucleotide polymorphism\narrays demonstrate high fidelity of multiple displacement-\nbased whole-genome amplification.  Electrophoresis 2005,\n26:710-715.\n15. Hughes S, Lim G, Beheshti B, Bayani J, Marrano P, Huang A, Squire JA:\nUse of whole genome amplification and comparative\ngenomic hybridisation to detect chromosomal copy number\nalterations in cell line material and tumour tissue.  Cytogenet\nGenome Res 2004, 105:18-24.\n16. Hughes S, Damato BE, Giddings I, Hiscott PS, Humphreys J, Houlston\nRS: Microarray comparative genomic hybridisation analysis\nof intraocular uveal melanomas identifies distinctive imbal-\nances associated with loss of chromosome 3.  Br J Cancer 2005,\n93:1191-1196.\n17. Cleton-Jansen AM, Buerger H, Haar N, Philippo K, van de Vijver MJ,\nBoecker W, Smit VT, Cornelisse CJ: Different mechanisms of\nchromosome 16 loss of heterozygosity in well- versus poorly\ndifferentiated ductal breast cancer.  Genes Chromosomes Cancer\n2004, 41:109-116.\n18. Kimura Y, Noguchi T, Kawahara K, Kashima K, Daa T, Yokoyama S:\nGenetic alterations in 102 primary gastric cancers by com-\nparative genomic hybridization: gain of 20q and loss of 18q\nare associated with tumor progression.  Mod Pathol 2004,\n17:1328-1337.\n19. Joos S, Bergerheim US, Pan Y, Matsuyama H, Bentz M, du Manoir S,\nLichter P: Mapping of chromosomal gains and losses in pros-\ntate cancer by comparative genomic hybridization.  Genes\nChromosomes Cancer 1995, 14:267-276.\n20. Visakorpi T, Kallioniemi AH, Syvanen AC, Hyytinen ER, Karhu R,\nTammela T, Isola JJ, Kallioniemi OP: Genetic changes in primary\nand recurrent prostate cancer by comparative genomic\nhybridization.  Cancer Res 1995, 55:342-347.\n21. Yano S, Matsuyama H, Matsuda K, Matsumoto H, Yoshihiro S, Naito\nK: Accuracy of an array comparative genomic hybridization\n(CGH) technique in detecting DNA copy number aberra-\ntions: comparison with conventional CGH and loss of heter-\nAdditional File 2\nGenomic comparison of gaCGH results obtained from non-amplified male \nversus non-amplified female DNA hybridisation and amplified male \nDNA versus female DNA hybridisation. Blue line indicates the chromo-\nsome position plotting of amplified DNA data. Black line indicates the \nchromosome position plotting of non-amplified DNA data.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1471-\n2164-7-65-S2.png]\nAdditional File 3\nGenomic comparison of gaCGH results obtained from non-amplified \nDNA from the colorectal cell line DLD1 versus non-amplified control \nDNA male hybridisation and amplified DNA from the colorectal cell line \nDLD1 versus amplified control DNA hybridisation. Blue line indicates the \nchromosome position plotting of amplified DNA data. Black line indicates \nthe chromosome position plotting of non-amplified DNA data. Detection \nof gain and loss is shown by cyan and pink bars, corresponding to ampli-\nfied and non-amplified DNA, respectively.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1471-\n2164-7-65-S3.png]\nAdditional File 4\nH&E sections show an example of LCM. Dissection of HPIN. Top picture \nrepresents the tissue before dissection, middle picture is after dissection, \nand bottom picture is the cap tissue.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1471-\n2164-7-65-S4.tiff]Page 9 of 10\n(page number not for citation purposes)\nBMC Genomics 2006, 7:65 http:\/\/www.biomedcentral.com\/1471-2164\/7\/65Publish with BioMed Central   and  every \nscientist can read your work free of charge\n\"BioMed Central will be the most significant development for \ndisseminating the results of biomedical research in our lifetime.\"\nSir Paul Nurse, Cancer Research UK\nYour research papers will be:\navailable free of charge to the entire biomedical community\npeer reviewed and published immediately upon acceptance\ncited in PubMed and archived on PubMed Central \nyours — you keep the copyright\nSubmit your manuscript here:\nhttp:\/\/www.biomedcentral.com\/info\/publishing_adv.asp\nBioMedcentral\nozygosity analysis in prostate cancer.  Cancer Genet Cytogenet\n2004, 150:122-127.\n22. Paiss T, Worner S, Kurtz F, Haeussler J, Hautmann RE, Gschwend JE,\nHerkommer K, Vogel W: Linkage of aggressive prostate cancer\nto chromosome 7q31-33 in German prostate cancer fami-\nlies.  Eur J Hum Genet 2003, 11:17-22.\n23. Dong JT, Boyd JC, Frierson HFJ: Loss of heterozygosity at 13q14\nand 13q21 in high grade, high stage prostate cancer.  Prostate\n2001, 49:166-171.\n24. Alers JC, Rochat J, Krijtenburg PJ, Hop WC, Kranse R, Rosenberg C,\nTanke HJ, Schroder FH, van Dekken H: Identification of genetic\nmarkers for prostatic cancer progression.  Lab Invest 2000,\n80:931-942.\n25. Matsuyama H, Pan Y, Yoshihiro S, Kudren D, Naito K, Bergerheim\nUS, Ekman P: Clinical significance of chromosome 8p, 10q, and\n16q deletions in prostate cancer.  Prostate 2003, 54:103-111.\n26. Tomlins SA, Rhodes DR, Perner S, Dhanasekaran SM, Mehra R, Sun\nXW, Varambally S, Cao X, Tchinda J, Kuefer R, Lee C, Montie JE, Shah\nRB, Pienta KJ, Rubin MA, Chinnaiyan AM: Recurrent fusion of\nTMPRSS2 and ETS transcription factor genes in prostate\ncancer.  Science 2005, 310:644-648.\n27. Zhao H, Hastie T, Whitfield ML, Borresen-Dale AL, Jeffrey SS: Opti-\nmization and evaluation of T7 based RNA linear amplifica-\ntion protocols for cDNA microarray analysis.  BMC Genomics\n2002, 3:31.\n28. Collins C, Rommens JM, Kowbel D, Godfrey T, Tanner M, Hwang SI,\nPolikoff D, Nonet G, Cochran J, Myambo K, Jay KE, Froula J, Cloutier\nT, Kuo WL, Yaswen P, Dairkee S, Giovanola J, Hutchinson GB, Isola\nJ, Kallioniemi OP, Palazzolo M, Martin C, Ericsson C, Pinkel D, Albert-\nson D, Li WB, Gray JW: Positional cloning of ZNF217 and\nNABC1: genes amplified at 20q13.2 and overexpressed in\nbreast carcinoma.  Proc Natl Acad Sci U S A 1998, 95:8703-8708.\n29. Shayesteh L, Lu Y, Kuo WL, Baldocchi R, Godfrey T, Collins C, Pinkel\nD, Powell B, Mills GB, Gray JW: PIK3CA is implicated as an\noncogene in ovarian cancer.  Nat Genet 1999, 21:99-102.\n30. Savinainen KJ, Linja MJ, Saramaki OR, Tammela TL, Chang GT, Brink-\nmann AO, Visakorpi T: Expression and copy number analysis of\nTRPS1, EIF3S3 and MYC genes in breast and prostate can-\ncer.  Br J Cancer 2004, 90:1041-1046.\n31. Cassinelli G, Supino R, Zuco V, Lanzi C, Scovassi AI, Semple SC, Zun-\nino F: Role of c-myc protein in hormone refractory prostate\ncarcinoma: cellular response to paclitaxel.  Biochem Pharmacol\n2004, 68:923-931.\n32. Bernard D, Pourtier-Manzanedo A, Gil J, Beach DH: Myc confers\nandrogen-independent prostate cancer cell growth.  J Clin\nInvest 2003, 112:1724-1731.\n33. Zhigang Z, Wenlv S: Prostate stem cell antigen (PSCA) expres-\nsion in human prostate cancer tissues and its potential role\nin prostate carcinogenesis and progression of prostate can-\ncer.  World J Surg Oncol 2004, 2:13.\n34. Fuessel S, Sickert D, Meye A, Klenk U, Schmidt U, Schmitz M, Rost\nAK, Weigle B, Kiessling A, Wirth MP: Multiple tumor marker\nanalyses (PSA, hK2, PSCA, trp-p8) in primary prostate can-\ncers using quantitative RT-PCR.  Int J Oncol 2003, 23:221-228.\n35. Reiter RE, Gu Z, Watabe T, Thomas G, Szigeti K, Davis E, Wahl M,\nNisitani S, Yamashiro J, Le Beau MM, Loda M, Witte ON: Prostate\nstem cell antigen: a cell surface marker overexpressed in\nprostate cancer.  Proc Natl Acad Sci U S A 1998, 95:1735-1740.\n36. Chang CJ, Freeman DJ, Wu H: PTEN regulates Mdm2 expres-\nsion through the P1 promoter.  J Biol Chem 2004,\n279:29841-29848.\n37. Mu Z, Hachem P, Agrawal S, Pollack A: Antisense MDM2 oligonu-\ncleotides restore the apoptotic response of prostate cancer\ncells to androgen deprivation.  Prostate 2004, 60:187-196.\n38. Leite KR, Franco MF, Srougi M, Nesrallah LJ, Nesrallah A, Bevilacqua\nRG, Darini E, Carvalho CM, Meirelles MI, Santana I, Camara-Lopes\nLH: Abnormal expression of MDM2 in prostate carcinoma.\nMod Pathol 2001, 14:428-436.\n39. Takahashi S, Urano T, Tsuchiya F, Fujimura T, Kitamura T, Ouchi Y,\nMuramatsu M, Inoue S: EBAG9\/RCAS1 expression and its prog-\nnostic significance in prostatic cancer.  Int J Cancer 2003,\n106:310-315.\n40. Cybulski C, Gorski B, Debniak T, Gliniewicz B, Mierzejewski M,\nMasojc B, Jakubowska A, Matyjasik J, Zlowocka E, Sikorski A, Narod\nSA, Lubinski J: NBS1 is a prostate cancer susceptibility gene.\nCancer Res 2004, 64:1215-1219.\n41. Huang H, Muddiman DC, Tindall DJ: Androgens negatively regu-\nlate forkhead transcription factor FKHR (FOXO1) through a\nproteolytic mechanism in prostate cancer cells.  J Biol Chem\n2004, 279:13866-13877.\n42. Beheshti B, Braude I, Marrano P, Thorner P, Zielenska M, Squire JA:\nChromosomal localization of DNA amplifications in neurob-\nlastoma tumors using cDNA microarray comparative\ngenomic hybridization.  Neoplasia 2003, 5:53-62.Page 10 of 10\n(page number not for citation purposes)\n"}