{"doi":"10.1017\/S1744552305004052","coreId":"206772","oai":"oai:eprints.lse.ac.uk:15649","identifiers":["oai:eprints.lse.ac.uk:15649","10.1017\/S1744552305004052"],"title":"Review essay: categories and concepts: mapping maps in Western legal thought","authors":["Stramignoni, Igor"],"enrichments":{"references":[{"id":17230820,"title":"(1927\/1996) Being and Time.","authors":[],"date":null,"doi":"10.1007\/978-90-481-9923-5_6","raw":"HEIDEGGER, Martin (1927\/1996) Being and Time. Albany, N.Y.: State University of New York Press.","cites":null},{"id":17230826,"title":"(1929–1930\/1995) The Fundamental Concepts of Metaphysics.","authors":[],"date":null,"doi":null,"raw":"HEIDEGGER, Martin (1929–1930\/1995) The Fundamental Concepts of Metaphysics. Bloomington, Indiana: Indiana University Press.","cites":null},{"id":17230819,"title":"(1965\/1988) Madness and Civilisation : A History of Insanity in the Age of Reason.","authors":[],"date":null,"doi":"10.2307\/2799941","raw":"FOUCAULT, Michel (1965\/1988) Madness and Civilisation : A History of Insanity in the Age of Reason. New York: Vintage.","cites":null},{"id":17230815,"title":"(1966\/1970) The Order of Things: An Archaeology of the Human Sciences.","authors":[],"date":null,"doi":"10.1177\/030631277200200104","raw":"FOUCAULT, Michel (1966\/1970) The Order of Things: An Archaeology of the Human Sciences. London: Tavistock.","cites":null},{"id":17230810,"title":"(2000)(a) ‘Preface’ English Private Law.","authors":[],"date":null,"doi":null,"raw":"BIRKS, Peter (2000)(a) ‘Preface’ English Private Law. Oxford: Oxford University Press.","cites":null},{"id":17230811,"title":"(2000)(b) ‘Three Kinds of Objection to","authors":[],"date":null,"doi":null,"raw":"BIRKS, Peter (2000)(b) ‘Three Kinds of Objection to Discretionary Remedialism’ 29 Western Australian Law Review 29: 1.","cites":null},{"id":17230839,"title":"(b) ‘The King’s One too Many Eyes: Language, Thought and Comparative Law’ Utah Law Review 739.","authors":[],"date":"2002","doi":null,"raw":"STRAMIGNONI, Igor (2002) (b) ‘The King’s One too Many Eyes: Language, Thought and Comparative Law’ Utah Law Review 739.","cites":null},{"id":17230816,"title":"47 For one example, see Vandervelde","authors":[],"date":"1992","doi":null,"raw":"47 For one example, see Vandervelde (1992) (regrettably, this important article is ignored by Waddams in his book).","cites":null},{"id":17230817,"title":"48 For a powerful attempt to answer to this difficult question, see Derrida","authors":[],"date":"1994","doi":null,"raw":"48 For a powerful attempt to answer to this difficult question, see Derrida (1994).","cites":null},{"id":17230832,"title":"After Government? On Representing Law Without","authors":[],"date":"2005","doi":"10.1111\/j.1468-2230.2005.00526.x","raw":"ROBERTS, Simon (2005) ‘After Government? On Representing Law Without the State’ Modern Law Review 68: 1.","cites":null},{"id":17230836,"title":"Classification of obligations and the impact of constructivist epistemologies’","authors":[],"date":"1997","doi":"10.1111\/j.1748-121x.1997.tb00416.x","raw":"SAMUEL, Geoffrey (1997) ‘Classification of obligations and the impact of constructivist epistemologies’ Legal Studies 17: 448.","cites":null},{"id":17230828,"title":"Comparative Legal Studies: Traditions and Transitions. Cambridge:","authors":[],"date":"2003","doi":"10.1017\/cbo9780511522260.001","raw":"LEGRAND, Pierre and MUNDAY, Roderick (2003) Comparative Legal Studies: Traditions and Transitions. Cambridge: Cambridge University Press.","cites":null},{"id":17230827,"title":"De l’Esprit des droits et de leur relativite´.","authors":[],"date":"1939","doi":null,"raw":"JOSSERAND, Louis (1939) De l’Esprit des droits et de leur relativite´. Paris: Dalloz.","cites":null},{"id":17230814,"title":"E ˆ tre cra ˆ","authors":[],"date":"2000","doi":"10.4000\/critiquedart.2227","raw":"DIDI-HUBERMAN, Georges (2000) E ˆ tre cra ˆ ne – lieu, contact, pense´e, sculpture. Paris: Les E ´ ditions de Minuit.","cites":null},{"id":17230829,"title":"English Law and the Renaissance’,","authors":[],"date":"1957","doi":null,"raw":"MAITLAND, Sir Frederic W. (1957) ‘English Law and the Renaissance’, in H.M. Cam (ed.) Selected Historical Essays of F W Maitland. Cambridge: Cambridge University Press, 135 ff.","cites":null},{"id":17230813,"title":"Force de Loi: Le ‘fondement mystique de l’autorite´’. Paris: Galile ´ e.","authors":[],"date":"1994","doi":null,"raw":"DERRIDA, Jacques (1994) Force de Loi: Le ‘fondement mystique de l’autorite´’. Paris: Galile ´ e.","cites":null},{"id":17230840,"title":"Francesco’s Devilish Venus:","authors":[],"date":"2004","doi":null,"raw":"STRAMIGNONI, Igor (2004) ‘Francesco’s Devilish Venus: Notations on the Matter of Legal Space’ California Western Law Review 41: 147–240.","cites":null},{"id":17230808,"title":"Homo Sacer: Sovereign Power and Bare Life.","authors":[],"date":"1998","doi":"10.2307\/3685567","raw":"AGAMBEN, Giorgio (1998) Homo Sacer: Sovereign Power and Bare Life. Stanford, California: Stanford University Press.","cites":null},{"id":17230818,"title":"La Volonte´ de savoir.","authors":[],"date":"1976","doi":"10.7202\/705637ar","raw":"FOUCAULT, Michel (1976\/1979) La Volonte´ de savoir. London: Allen Lane.","cites":null},{"id":17230842,"title":"Legal Essays and Addressess. Cambridge:","authors":[],"date":"1939","doi":"10.1017\/s0008197300125620","raw":"WRIGHT OF DURLEY, Lord (1939) Legal Essays and Addressess. Cambridge: Cambridge University Press. IGOR STRAMIGNONI 426","cites":null},{"id":17230833,"title":"Naufragi senza spettatore. L’idea di Progresso.","authors":[],"date":"1995","doi":null,"raw":"ROSSI, Paolo (1995) Naufragi senza spettatore. L’idea di Progresso. Milan: il Mulino.","cites":null},{"id":17230837,"title":"SAMUEL,Geoffrey(2002)‘EnglishPrivateLaw: Oldand NewThinking intheTaxonomyDebate’","authors":[],"date":null,"doi":null,"raw":"SAMUEL,Geoffrey(2002)‘EnglishPrivateLaw: Oldand NewThinking intheTaxonomyDebate’ Oxford Journal of Legal Studies 24: 335.","cites":null},{"id":17230831,"title":"The Blank Slate.","authors":[],"date":"2002","doi":"10.1037\/e597062010-001","raw":"PINKER, Steven (2002) The Blank Slate. London: Allen Lane.","cites":null},{"id":17230812,"title":"The Faces of Justice and State Authority: A Comparative Approach to the Legal Process.","authors":[],"date":"1986","doi":null,"raw":"DAMAS ˆ KA, Mirjam R. (1986) The Faces of Justice and State Authority: A Comparative Approach to the Legal Process. New Haven; London: Yale University Press.","cites":null},{"id":17230841,"title":"The Gendered Origins of the Lumley Doctrine: Binding Men’s Consciences and Women’s Fidelity’","authors":[],"date":"1992","doi":"10.2307\/796874","raw":"VANDERVELDE, Lea (1992) ‘The Gendered Origins of the Lumley Doctrine: Binding Men’s Consciences and Women’s Fidelity’ Yale Law Journal 101: 775.","cites":null},{"id":17230809,"title":"The Law of Restitution at the End of an Epoch’","authors":[],"date":"1999","doi":null,"raw":"BIRKS, Peter (1999)(b) ‘The Law of Restitution at the End of an Epoch’ Western Australian Law Review 28: 13.","cites":null},{"id":17230834,"title":"The Metaphysics of Tracing: Substituted Title and Property Rhetoric’","authors":[],"date":"1996","doi":null,"raw":"ROTHERHAM, Craig (1996) ‘The Metaphysics of Tracing: Substituted Title and Property Rhetoric’ (1996) Osgoode Hall Law Journal 34: 321.","cites":null},{"id":17230830,"title":"The Origins of European Thought. Cambridge:","authors":[],"date":"1994","doi":"10.1017\/s003693060005626x","raw":"ONIANS, R.B. (1994) The Origins of European Thought. Cambridge: Cambridge University Press.","cites":null},{"id":17230835,"title":"Trust Property and Unjust Enrichment: Tracing into the Proceeds of Life Insurance Policies’ Cambridge Law","authors":[],"date":"2000","doi":"10.1017\/s0008197300270207","raw":"ROTHERHAM, Craig (2000) ‘Trust Property and Unjust Enrichment: Tracing into the Proceeds of Life Insurance Policies’ Cambridge Law Journal 440.","cites":null},{"id":17230838,"title":"When Law Stands Still: Land Contracts","authors":[],"date":"2001","doi":null,"raw":"STRAMIGNONI, Igor (2001) ‘When Law Stands Still: Land Contracts in English Law and Law’s ‘Abandonment’ of Everyday Life’ Law and Critique 12: 105. STRAMIGNONI,Igor(2002)(a)‘AttheMarginsoftheHistoryofEnglishLaw:TheInstitutional,theSocioPolitical and the ‘‘Blotted-out’’’ Legal Studies 22: 420.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/206772.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/15649\/1\/Categories%20and%20concepts%20%28lsero%29.pdf","pdfHashValue":"0a07443b3d1276c9ce7020c6ed767429dd4ab746","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:15649<\/identifier><datestamp>\n      2012-09-04T15:05:24Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4C4C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/15649\/<\/dc:relation><dc:title>\n        Review essay: categories and concepts: mapping maps in Western legal thought<\/dc:title><dc:creator>\n        Stramignoni, Igor<\/dc:creator><dc:subject>\n        K Law (General)<\/dc:subject><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:date>\n        2005<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/15649\/1\/Categories%20and%20concepts%20%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Stramignoni, Igor  (2005) Review essay: categories and concepts: mapping maps in Western legal thought.  International Journal of Law in Context, 1 (4).  pp. 411-426.  ISSN 1744-5523     <\/dc:identifier><dc:relation>\n        http:\/\/journals.cambridge.org\/action\/displayJournal?jid=IJC<\/dc:relation><dc:relation>\n        10.1017\/S1744552305004052<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/15649\/","http:\/\/journals.cambridge.org\/action\/displayJournal?jid=IJC","10.1017\/S1744552305004052"],"year":2005,"topics":["K Law (General)"],"subject":["Article","PeerReviewed"],"fullText":"  \nIgor Stramignoni \nReview essay: categories and concepts: \nmapping maps in Western legal thought \n \nArticle (Published version) \n(Refereed) \n \nOriginal citation: \nStramignoni, Igor (2005) Review essay: categories and concepts: mapping maps in Western \nlegal thought. International journal of law in context, 1 (4). pp. 411-426. \nDOI: 10.1017\/S1744552305004052 \n \n© 2009 Cambridge University Press \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/15649\/ \nAvailable in LSE Research Online: September 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \nReview essay\nCategories and concepts: mapping maps\nin western legal thought\nDimensions of private law\nBy Stephen Waddams. Cambridge: Cambridge University Press, 2003. 272 pp. ISBN 0521816432. £19.99.\nReview by Dr Igor Stramignoni\nLecturer in European Private Law at the London School of Economics and Political Science\n1. The question of classification\n‘Li omini e le parole son fatti.’ (Leonardo da Vinci)1\nIt is quite extraordinary how, to this day, the matter of legal classifications should still raise so much\nanxiety amongst lawyers, particularly lawyers in England. After all, the timemust be long gone when\ncommon lawyers may have felt under the threat of Rome and of her ‘civilians’ (those lawyers who\nwere trained in the jus civile)2 – and even today’s impending ‘danger’ of joining Europe and its laws\ncould hardly be convincingly fought off, one would think, by worrying about the somewhat fragile\nweapon of legal classifications.\nSo then why so much continuing anxiety about legal classifications? What might be at stake\nbeneath or within the on-going debate on the desirability of mapping legal categories and legal\nconcepts? A recent book by Professor Stephen Waddams of the University of Toronto returns\nprecisely to that debate – the extent to which legal classifications might or might not be desirable –\nand it does so with much expertise and, as we will see, a wealth of historical information in support\nof the doubter. The result is a valuable book that should be read by all those who are interested in\nlegal history and in comparative law, as well as in current legal problems such as whether a common\nlaw of Europe is possible or even necessary.\nNevertheless, one wonders whether the book under consideration has fully achieved the task in\nhand – or not. That task, it seems to me, cannot have been merely to restage, however instructively,\nsome degree of scepticism about the enterprise of classification – and in fact, many of the\narguments and materials included in the book (though by no means all of them) are likely to be\nfamiliar to a number of its readers. Surely, by contrast, the task of the book must have been to\nhighlight what one could call the question of classification – whether legal classifications can really\nadd anything substantial, or essential, to what one may or may not already know about the legal\nworld such classifications are designed to map. My own view is that, contrary to their harmless\nappearance and in spite of the intentions of many proponents and users, legal classifications can\nand often do make all the difference, and that is perhaps one reason why they continue to cause so\nmuch anxiety amongst so many lawyers. More particularly, the anxiety could be triggered by the\n1 ‘Men and words are facts’ (1992, K 110 v) (author’s translation).\n2 This was Maitland’s notoriously controversial thesis: Maitland (1957).\nInternational Journal of Law in Context, 1,4 pp. 411–426 (2005) Cambridge University Press\nDOI: 10.1017\/S1744552305004052 Printed in the United Kingdom\nseparations and oppositions that those classifications both lay out and eminently reaffirm – and by\nthe ensuing estrangement such separations and oppositions can consequently evoke. Now,\nestrangement is not necessarily a bad thing and yet, in this case, it could signal a much larger\nproblem – what could be the meaning of legal classifications and the legal ‘territory’ they presume to\nrepresent or picture, in a world where democracy and the rule of law seem to have themselves\nbecome rather boundless templates. The answer, however, is not, I submit, to go back to an imagined\ncorpus of English law somehow purified of its many actual dimensions – as our book seems ultimately\nto suggest. Indeed, in my view, to turn to such a corpus would be just as problematic as postulating a\nclassifiable legal territory of whatever shape or form. My point, accordingly, is precisely this. The\nalternatives typically on offer in the debate on classifications – a classifiable legal territory or an\nimmemorial, pure corpus of English law – cannot be today successfully decided (if they ever could be)\nand this ‘undecidability’ might well be what the continuing anxiety about classifications could be\nmore fundamentally about. To the extent that such a deeper anxiety hovers untouched over the\narguments and materials of the book, its author in my view neglects a central challenge that can no\nlonger today be credibly postponed – and, therefore, he does not make his case as forcefully as he\nmight have initially hoped. In what follows, I first review the arguments and materials of the book,\nand then give some more thought to what I have called the question of legal classification.3\n2. The many dimensions of private law\nThe subject matter of the work in question (its quasi-Cartesian object, one is tempted to say) is Anglo-\nAmerican private law – or, what mutual rights and obligations individuals may have under Anglo-\nAmerican private law. The author does not likemaps, schemes or diagrams – that is, any pre-ordained\nattempt at sketching out ‘the relation to each other of categories (organizing divisions) and concepts\n(recurring ideas) in private law’ (p. 1). Instead, he argues, concepts have operated in Anglo-American\nlaw ‘cumulatively and in combination’ – which must then mean that no allocation of a particular\nlegal issue to a single category can really be feasible or meaningful (pp. 1–2). Indeed, all sorts of\npeople on all sorts of occasions have, the author recalls, argued the same: Oliver Wendell Holmes in\nthe latter part of the nineteenth century, Lord Halsbury at the turn of the twentieth, and then Lord\nWilberforce, R. Goff, Lord Nicholls, Lister v. Hesley Hall Ltd,4 Dobson v. Dobson,5 Bazley v. Curry,6 etc.\nNot that legal classifications are unknown in the Anglo-American world. Blackstone, for one,\nfamously spoke of legal maps and, in his Commentaries, of a general map of English law organised\ninto rights andwrongs, and then rights of persons and rights of things, and private wrongs and public\nwrongs – but his proposed classification, many came soon to feel, was both over ambitious and\nsomewhat too rigid. Or he set out to produce something ‘more akin to the plan of an existing\nbuilding than to a map of geographical territory’ (p. 5). In particular, Blackstone’s main failure was\nthat he did not really discuss contract law – which had to wait for explicit recognition until after\nPowell’s Essay upon the Law of Contracts and Agreements of 1790 and, more importantly, the translation\ninto English of Pothier’s highly influential Traite´ des obligations. Even then, English contract law\n3 Contents and materials of the book are reviewed in section 2. For the question of legal classification, see\nsections 3 and 4.\n4 [2002] 1 AC 215.\n5 [1999] 2 SCR 753.\n6 [1999] 2 SCR 534.\n7 ‘Actual consent to be bound has been neither sufficient nor necessary in Anglo-American contract law: not\nsufficient, because it is ineffective in the absence of a bargain or a formality; not necessary, because\ncontractual words and conduct are given effect according to the meaning reasonably ascribed to them by\nthe promise, not that actually intended by the promisor’ (Waddams, p. 7).\nIGOR STRAMIGNONI412\nresisted the imposition of any single classifying concept – most obviously, consent.7 What is more, its\ndelictual and proprietary associations could perhaps be ignored but not erased by subsequent classi-\nfication schemes.8 Erasing such associations, our author points out, would have meant abandoning\nthe central concept of breach of contract as a wrong, abolishing covenant and debt, renouncing equity\nas a source of contractual obligation, separating contract from property, and replacing the primary\nlegal obligation of fulfilment of contracts – all far too radical changes in the absence of some codifying\nlegislation (p. 8). Even such other schemes as for example Anson’s – who in his Principles of the English\nLaw of Contract tried to overcome the problems by multiplying rather than reducing the categories of\nobligation (contract, delict, breach of contract, judgment, quasi-contract, and miscellaneous) –\nattracted attention but failed to convince. Halsbury’s Laws of England had 164 titles for the law, but,\nsurprisingly, none for such things as public or private law, property, obligations etc. By contrast,\nSmith’s Leading Cases managed to discuss much of the existing law on the basis of about 60 judicial\ndecisions. At that time lawyers were thinking generally in terms of contract and tort – but neither\nMaitland nor Pollock approved of the effort (Pollock considered it a-historical). Unjust enrichment –\nwhich in 1914 had been pushed aside as a result of the continued attempt to classify all law as either\ncontract or tort – would later on re-emerge from quasi-obscurity as fully independent of either.9 This\nwas of course a victory of the law of unjust enrichment and of the influence of academic writing – but\nit was also, our author feels, an implicit yet clear confirmation that no ‘diagrammatic’ classification can\never be exhaustive enough or unassailable. Not, at least, in Anglo-American law.\nWhy can Anglo-American classifications never be exhaustive or unassailable? First, our author\nargues, because maps, classifications, schemes and the like cannot be reconciled with change. Judges\nmay well be deemed to declare the law, whether upon the use of maps or otherwise – but this fiction\nfinally collapses when liability is imposed in novel circumstances. Secondly, there is no uniformity\nin legal decisions – neither where reasoning nor where conclusions are concerned. Thirdly, the\nhistorical separation in English law of courts of common law and of equity generated categories and\nconcepts that are different depending on the jurisdiction of origin, and they have not yet been\nproperly or totally integrated. Not only that but also, for example, the law of maritime salvage or of\nmatrimonial obligations typically resist classification in terms of common law or equitable cate-\ngories or concepts – for they have an altogether different history. Fourthly, classifications clash\nagainst the complexity of the relation between facts and law:\n‘The facts of the case are defined in relation to legal principles, but the principles themselves\nare formulated in relation to facts, real or hypothetical. Facts may be stated at countless levels\nof particularity, and legal issues and legal rules may be formulated at countless levels of\ngenerality.’ (p. 14)\nThis is an important point for, our author continues, the selection of legally relevant facts is a question\nof judgment that, as such, can never be a truly separate affair from the formulation of the applicable\nlegal rule. That is to say, ‘facts are selected and then marshalled to fit perceived rules of law, but the\nrules themselves change in response to the facts’ (p. 14). In particular, the instability resulting from\nsuch a predicament may soon let loose of any correspondence between the names of legal categories\nand what they suggest (pp. 15–16). And generally it may cause linguistic difficulties that may well\nhave no genuine solution. Finally, other difficulties militating against classifications include the\nrelation in English law between property and obligation, the appeal to judgment characteristic of the\n8 ‘[T]he primary right of the promise remained a right to compensation for loss caused by wrongdoing, overlaid\non the earlier concepts of covenant and debt, and supplemented by the power of the court of equity, where it\nthought it appropriate, to decree specific performance, to issue injunctions, and to declare and enforce trusts’\n(Waddams, p. 8).\n9 Cf. Fibrosa Case [1943] AC 32.\nREVIEW ESSAY 413\nlegal decision-making process, the interaction between private law and public policy, the relation of\njudge-made law to legislation (they are not as separate as usually argued), and the near-impossibility\ninmost instances of allocating a dispute ‘to one concept or discrete set of principles to the exclusion of\nothers’ (pp. 20–1). That said, classifications may be perfectly valuable – they have, for example, a\nrhetorical use calculated to persuade. And yet, the sad point is that they tend to lack adequate\nhistorical foundations. So much so that thorough historical investigation will show how –\n‘non conforming instances have in the past been neither infrequent nor unimportant, and\ncannot therefore by measurable criteria be called marginal or insignificant; whether they can\nbe called anomalous or unprincipled depends on the independent persuasive force of the\nprinciple to which it is asserted that they ought to have conformed, something that cannot be\ntested by historical evidence.’ (p. 22)\nIndeed, principles – categories and concepts – may well be used to condemn a past inconsistent with\nthem but, then, such a past should not be summoned in support of those principles. Thus:\n‘[a]n account of private law might possibly be supported entirely on non-historical\ngrounds . . . but then the account would not necessarily reflect past or present law. On the\nother hand accounts that do claim to be descriptive of or supported by past or present law\nmust reckon with the evidence of what the law has actually been.’ (p. 22)\nThat Anglo-American legal categories and concepts may resist classification is easily shown. Take for\nexample principle, utility and policy. Contrary to what one might expect, ‘from a historical stand-\npoint they appear rather as complementary strands in a single rope, or different dimensions of a\nsingle phenomenon’ – witness for example the famous Omychund v. Barker,10 whereby the language\nof William Murray (later Lord Mansfield), Dudley Rider (later Chief Justice of the King’s Bench) and\nLord Chancellor Harwicke unequivocally referred to principle, utility and policy at the same time\n(pp. 191–2). Our author reviews numerous instances where either principle or utility or policy were\nexplicitly or implicitly taken to be the exclusive basis of private law (pp. 192–206). But such a position,\nhe argues, clashes with much historical evidence that law can change by judicial decision so much\nthat, in practice, the distinction between judicial and legislative functions becomes ‘elusive’ (p. 211).\nOr that expropriation, compulsory purchase, or eminent domain – the classic problem of Bradford\nCorporation v. Pickles,11 Allen v. Flood12 and one might add Josserand’s ‘abus de droit’ (1927) – are a\nquestion of both private rights and public interest (pp. 211 ff). Or that historically and analytically\nthe status of maritime salvage is unclear (pp. 215 ff). Or, finally, that in private law compensatory\nconsiderations were often ‘tainted’ by punitive ones (pp. 217 ff).\nTurn now to the distinction between property and obligation. Obviously Gaius knew what he\nwas talking about when he separated rights in rem (against a thing) from rights in personam (against a\nperson) from actiones (remedies) – but such expressions ‘lack consistent meaning in Anglo-American\nlaw, and often both have been applicable simultaneously’ (p. 172). There may be many reasons for\nsuch a plight – for example, the view that property is but a ‘bundle of rights’, or the linguistic opacity\ncharacteristic of the term (it is often unclear whether the law protects property in a strict or in a\nwider sense), or else the impossibility of establishing the ‘true’ nature of property (p. 173). On\ninspection, ‘[o]nce the concept of property has been extended beyond land and tangible things,\nthere is no way of saying what is property, or what is not property, without consulting a particular\nsystem of law at a particular time’ (p. 174). In fact, in today’s intensely technological society property\n10 (1744) 1 Atk 21.\n11 [1895] AC 587, HL.\n12 [1898] AC 1, HL.\nIGOR STRAMIGNONI414\n(or some sort of proprietary interest) is often created entirely ex novo – perhaps by resorting to the\nrhetoric of property and despite pronouncements to the effect that, for example, ‘information’ is not\na thing under the criminal law of theft.13 Alternatively, the distinction between property and\nobligation blurs where – like in the case of conversion – a dispute over title to goods is actionable\nin tort, fault notwithstanding (p. 176). Or, where a proprietary right can never be enforced by\ninjunction or, conversely, a contractual right (for example, a license for the use of land) can be\nenforced by injunction (pp. 177–8). Or, where an answer is sought for the question whether\nconstructive trusts are purely a (proprietary) remedy (a solution that, Peter Birks believed, would\ninevitably lead to some random and unprincipled creation of property rights) (pp. 181–2 and n. 51;\nBirks, 1999(a), p. 686; Birks, 1999(b), p. 56 ff; Birks, 2000(b)).14 Or, finally, where one considers tracing –\nwhose ‘reasons of justice have included concepts both of property and of unjust enrichment, and\nit is not possible to choose one of these to the exclusion of the other’ (pp. 185–6; also Rotherham\n1996; 2000).\nNot even contract, wrongdoing or unjust enrichment can be persuasively presented as being in\nmutual isolation from each other, or else as being subordinated to one another. Instead, historical\nsurvey reveals that such concepts ‘have often interacted with each other, and . . . cannot therefore be\nfully understood without attention to their mutual interdependence’ (p. 142).15 Neither can domestic\nobligations be wholly separated – nor in Anglo-American law have they ever been successfully\nseparated – from other areas of private law. Indeed, contract, wrongdoing and unjust enrichment are\nclearly behind some of the dramatic changes that took place in the realm of family law in the second\nhalf of the twentieth century – and public policy too has been influential in that traditionally\nmarginalised area of the law of obligations (Ch. 7).\nTake contract. On closer examination, contractual liability cannot always be kept separate from\nother forms of private law liability – say on the basis that unlike physical harm, damage to economic\ninterests affects the injured person ‘only sometimes’ (p 40, n. 5). Instances such as the U.S. decision in\nInternational News Service v. Associated Press (1918)16 remind us that contractual liability may well be\nestablished in cases where there is no prior legal right – yet there is some wrongful conduct ‘that has\nmade it possible thenceforth to say that the plaintiff had a legal right’ (p. 41, author’s emphasis). Other\nwell-known cases of contractual considerations blending with considerations of property, trust,\nwrongdoing and unjust enrichment include interference with contractual relations, use of land and\nsometimes chattels in contravention of contractual restrictions agreed by the previous owner, and\ncases where the claimant is a third party in respect of the defendant in breach (but the list, of course,\nis longer) (pp. 43–44). Recognising a direct action in tort has, in such cases, proved illusory (p. 47).17\nBut, our author clarifies, the point really is that such examples demonstrate the ‘instability of the\nmethods of classifying obligations’ (p. 48). Could those not be, for example, property damage cases,\nrather than contractual? And, on the other hand, do not they show obvious affinities with those\nregarding third party beneficiaries to contracts? The answer to both questions is yes, except that in\nthe latter instance English law unlike American law had ironically come to accept ‘the logic of a\nstringent classification of concepts’ – only however to conclude that, regretfully, the result was\nclearly gross injustice.18\n13 R v. Stewart [1988] 1 SCR 963.\n14 Contra see Waddams, pp. 182 ff.\n15 On the interplay between contract, wrongdoing and unjust enrichment, see also Waddams, Ch. 8.\n16 248 US 215 (1918).\n17 See also Waddams, Ch. 8.\n18 ‘[T]he beneficiary could not sue because she was not a party to the contract; the promisee’s estate could sue,\nbut could recover no substantial damages because it had suffered no loss’ (p. 50).\nREVIEW ESSAY 415\nNor can the protection of reliance via estoppel be persuasively explained in terms of any other\nsingle concept. Close to both contract and tort, estoppel is neither always contractual (a means of\nenforcing promises) nor always tortious (a means of redressing wrongdoing) – nor, for that matter, is\nit always proprietary or always ever explicable in terms of unjust enrichment. This seems clear in\nmany land cases – whereby the promisee relies on the promise only to find out that later on the\npromise is revoked. Typically in such cases there is no contract (the promise was gratuitous) and no\nproperty has been legally transferred – but neither, sometimes, is there any guilt or enrichment by\nthe promisor (p. 59, n. 7). Nevertheless, equity protects the promisee and it does so based on a\ncombination of considerations rather than on any one of them exclusively.19 Indeed, equity does so\nwith those contracts but also, for example, with contracts for the sale of land or with secret trusts\n(pp. 62–3). In such cases – and in many others – classification is either impossible or meaningless.\nEven –\n‘[t]he establishment of a fourth category of obligations, or consignment of the reliance cases to a\nseparate ‘miscellaneous’ category, would scarcely resolve the difficulties, because reliance has\nnot been so much separate from the concepts of property, contract, tort, and unjust enrichment,\nas intimately linked with all of them.’ (p. 79, author’s emphasis)\nWhere Anglo-American tort law is concerned – our author argues – one of the most powerful\narguments against classification lies in the ambiguous sovereignty of the principle ‘no liability\nwithout fault’. Pollock and Wright doubted the existence of such a principle as far back as 1923 and\n1939 respectively (p. 80) – but Lord Denning, too, voiced his scepticism on this on more than one\noccasion (p. 81). Cases of compensation without fault include – among others – the objective\nstandard of competence (where inexperience, inherent incapacity, or a momentary or pardonable\nlapse of judgment do not generally count), the law of general average contribution in maritime law,\nexpropriation or taking of land for public use, nuisance, flooding of land (whereby one landowner\ncan preserve her own property only by damaging that of a neighbour) and other necessity cases,\nharm caused by unusual or hazardous enterprises (property can be destroyed in order to prevent fire,\nor criminal activities, or the spread of a disease etc.), the law of vicarious liability, the law of product\nliability, and the law that imposes liability for animals (cattle trespass, dangerous animals etc.). All\nthese cases ‘cannot be fully explained in terms of wrongdoing (in the ordinary sense of the word), but\nneither can they readily be explained in terms of any other single concept’ (p. 82).20 A general\nprinciple of strict liability is not easily formulated – in particular as it is difficult ‘to distinguish an\nidentifiable enterprise (to which is it judged to be feasible and desirable to allocate costs of the\ndamage it causes) from the ordinary activities of everyday life’ (p. 92). Nor does there seem to be\nmuch historical evidence in support of the view that strict liability is an anomalous exception to a\ngeneral principle of fault – if, that is, one agrees with John Fleming (writing on the rejection of\nRylands v. Fletcher in theHigh Court of Australia) that such a general principle could hardly be seen to\nhave overtaken (at last) ‘a rule redolent of archaism’ (pp. 91–3 and notes).\nManymore issues in Anglo-American private law seem tomake the case for classifications rather\nimpervious. For example, if the claimant suffered no loss, must wrongfully acquired gains be\ndisbursed? This bitterly contested question has caused much conceptual agonising – not least\nbecause in many cases claimants do in fact suffer some loss, though a difficult one to quantify –\nand, yet, it is unlikely that this question will ever leave the shadowy territories that lie in-between\nrestitution, contract, tort or property (pp. 107 ff.). For ‘[w]e may take the issue out of unjust\nenrichment, but it is not so easy to take unjust enrichment out of the issue’ (p. 112). Sometimes\n19 See Gillett v. Holt [2001] 1 Ch 210 (CA) at 225, 234 – in Waddams, pp. 61–2.\n20 Waddams, Ch. 5, reviews individually each of the cases mentioned in the text and several others.\nIGOR STRAMIGNONI416\nfor example claimants have been able to recover a reasonable fee in spite of the fact that the tort had\nbeen waived. Here the law deems claimants to have given prior approval to the wrongful conduct by\nthe defendant – but this fictio is neither accidental nor irrelevant. To insist that such cases have been\nconcerned onlywithwrongdoing, and not also unjust enrichment, or contract, or other legal concepts\nwould be, our author believes, ‘to oversimplify’ – as ‘the contract that might have been made if the\ndefendant had acted lawfully has often been an important consideration’ (p. 112, author’s emphasis).\nAnd what about those instances where judicial opinion is very significantly divided between\ncompensatory, restitutionary and even proprietary considerations – for example, where claimants\nare awarded money as defendants have failed to respect restrictions on the use of land albeit doing so\nthrough no prejudice to the other party? Here the resolution of the issue could only come through\nthe simultaneous application of elements of tort and elements of unjust enrichment (p. 117). And if\nthis and many other cases of interdependence of legal concepts have often given the appearance of\ncircularity to legal reasoning – well, our author observes, that ‘does not show that the conclusions\nreached have been accidental, arbitrary, or unprincipled’ (p. 119).21\n3. Joanna Wagner, or Which is the body of law?\nMy aim thus far has been to follow as closely as possible the reasoning and materials of the book – to\ntry and listen to them on their own terms. The gist of it, it has emerged, is a mainly historical\nargument against classification. On surface, Waddams does not absolutely deny the usefulness of\nclassifications but, rather, he cautions against an excessive or improper use of them by lawyers. Yet\nsuch a cautionary note is rather strong – as even a mixed approach between what he characterises as\nthe internal (descriptive) viewpoint of history and the external (prescriptive) viewpoint of classifica-\ntions is looked upon by him with dislike. Surely, concurrence is largely unavoidable – for ‘the\nassessment of what the law is at the time of assessment, or of what it was at any previous time, is\nitself a complex process’ involving all sorts of interlocking operations (historical enquiry, judgment,\nsynthesis, prediction etc.) (p. 222). Yet one should not underestimate how –\n‘concurrence carries the risk of distorting an understanding of the past. There is a danger that the\nuniversal idea may be used to excise or to marginalize aspects of the past that do not conform to\nit, while at the same time implying that the past, conveniently pruned by these means, offers\nsupport for the idea.’ (p. 22)\nThus the present of any legal classification is firmly separated from and contrasted with the pre-\nexisting, pre-eminent, immemorial past of legal history. That past, Waddams concedes, has many\ndimensions – here, the dimensions of Anglo-American private law. Yet for him that past is one and its\nintegrity should be preserved. That is why the many dimensions of that past cannot and, indeed,\nshould not be captured by any one classification, nomatter howwell thought out the classification is\nor well meaning its particular proponents.\nThe heart of the book, then, must really lie in the story of Johanna Wagner and the rival opera\nhouses (Ch. 2). The background to the story is the rather brutal competition between two London\ntheatre managers – Benjamin Lumley and Frederick Gye – for the services of oneMsWagner, a singer\nof some fame. In November 1851 Wagner had agreed with Lumley on a three-month engagement\nand a fee of £1,200. While under the agreement Lumley was to make an advance payment on 15\nMarch and Wagner start on 1 April 1852 – Wagner subsequently asks and obtains a postponement\nuntil 15 April. Meanwhile, however, Wagner has become increasingly unsure of the arrangement –\nnot least because of her employer’s supervening financial difficulties and subsequent failure to make\n21 More cases of profits derived from wrongs are discussed throughout Waddams, Ch. 5.\nREVIEW ESSAY 417\nthe agreed advance payment. Thus, offered a better contract by Gye, Wagner takes up the offer and\ngoes up to London. The debut, announced for 24 April at Covent Garden, is blocked by an injunction\nat Lumley’s request restraining Wagner from appearing.22 This leads to an initial ‘contract’ case\n(between Lumley and Wagner)23 followed almost immediately by a second ‘tort’ case (between the\ntwo theatre managers).24\nNeither the contract opera case – our book argues – nor the tort case could lend themselves to\nclassification in a satisfactory way – except, that is, by distorting the past and the relevant historical\nrecord. First:\n‘the fact that the advance money had not been paid on 15 March – apparently an important\nbreach of Lumley’s obligation – was held by three judges not to be legally conclusive, and for\nthree quite different and inconsistent reasons . . .This . . . shows how a fact, apparently relevant,\nmay be made irrelevant by framing of the legal issues, or by findings of other facts.’ (p. 27)\nSecondly, the injunction against Gye was issued – on a strict interpretation – in the absence of any\nfirm basis in either contract or tort.25 Thirdly, Gye’s conduct could well be classified as wrongful – as\nindeed Lumley v. Gye resolved to do – yet a close reading of the records shows that both the contract\ncase and the tort one were dotted with all sorts of contract, tort, unjust enrichment, property and\npublic policy considerations that make classification unconvincing. Clearly, courts in those\ninstances used overall judgment, not logic (p. 36). And, clearly, they did not reach conclusions ‘by\nallocating the facts to pre-existing categories, or by reference to anything like a pre-existing map or\nscheme, but by the operation of several concurrent and cumulative considerations’ (p. 38).\nWhat the above shows, in sum, is that – in the opinion of the author of our book – no external\ngrid, picture or other image of the corpus of Anglo-American law would do. Instead, only some\npatient, internal, historical retracing of that corpus and of what is relevant at each point in time to a\nparticular legal issue could realistically hope to produce useful if never final results. For Johanna\nWagner has indeed some ‘body’ (or profile) at law but that body is not, and could never be, what\nmight show up at any given time based on some clever yet essentially inadequate legal classification –\nnor, for that matter, what could appear on screen ‘at the click of button’ (Birks, 2000(a), p. xxx).\nThat might be so – but one wonders, does the strong cautionary note struck by Waddams and\nepitomised by the twin opera cases go far enough in bringing out the question of classification? There is\nno need here to rehearse the well-known reasons of the advocates of classifications.26 Nor dowe need\nhere to contrast them with the reasons of the sceptics – our book, as we have seen, does it well.27\n22 ‘Just as Gye’s victory was short-lived, so also was Lumley’s, for in the end Wagner did not sing at either\ntheatre, and the 1852 season was a disaster for Lumley, and for Her Majesty’s Theatre, which closed from\n1853 to 1855, Lumley attributing the closure largely to JohannaWagner’s defection. Lumley eventually lost\nhis legal action against Gye for damages, so in the end Lumley, Gye, Wagner, and the opera-going public –\neveryone in fact except the lawyers – were all losers’ (pp. 25–6).\n23 Lumley v. Wagner (1852) 1 De G M & G 604, 21 LJ Ch 898, 16 Jur 871, 19 LT 264.\n24 Lumley v. Gye (1853) 2 El & Bl 216, 22 LJQB 463 (demurrer) and (1854) 18 Jur 468 n., 23 LT 66, 157, 23 LJQB\n116 n. (verdict).\n25 Such an extraordinary result, our author interestingly adds, could only be explained by the likely hostility of\nthe court towards Wagner and Gye – following a recent case where Lumley had profited handsomely from\nthe contractual breach of another opera singer, thus showing how damages was a hopeless remedy in the\ncircumstances.\n26 Arguments and counter-arguments concerning the motion are authoritatively summarised by Birks\n(2000(a)).\n27 Unfortunately, however, the book relies on but does not really discuss the work of Geoffrey Samuel\nadvocating an epistemology centred around a persona understood as ‘an actor not on a single stage; the\nactor is defined, at least in part, by changing sets and props depending upon the nature of the relations in\nplay’ (2002, p. 355).\nIGOR STRAMIGNONI418\nInstead, let us take this opportunity to pause and simply consider how the alternatives typically on\noffer in the debate on classifications continue to be either a ‘real’ legal territory that can be pictured\n(proponents of classifications) or a legal corpus that, although some sort of reality too, could never be\nfully grasped by any one picture or classification (sceptical view). But then, one wonders, is it still so\nvery meaningful today to draw firm lines between external and internal realities, between territories\nand corpora, between the perfect space represented by a good classification and the imperfect space\nrepresented by any one of the various dimensions of private law? In short, does the opposition\nbetween Johanna Wagner’s two bodies – the internal body, so to speak (corpus, essence or structure),\nand the external one (its territory as represented by this or that classification) – does any such\nopposition really allow the question of classification to come any further into view? Or is it perhaps\nthe case that inside and outside, territories and corpora, classifications and dimensions – these all raise\nproblems that, paradoxically, become all the more pressing today as those territories and corpora,\nclassifications and dimensions, come more and more intensely under scrutiny? And if that is the\ncase, what then would be truly at stake beneath or within those territories or corpora, classifications\nor dimensions? What I would like to note here is that, ironically, both camps in the classification\ndebate encounter but do not seem to notice a very central problem that, however, they both reaffirm\nthrough their silent backing of oppositional western rationalities – the problem, that is, of legal space.\nBoth camps, in other words, concern themselves with what they take to be the reality of Anglo-\nAmerican private law (territory or corpus) – but, then, they leave the conditions of possibility of that\nreality to the side. And yet, I argue, it is precisely the status of what is thus, each time, ‘blotted-out’\nthat might be so very eminently at stake in many of today’s debates over the future of western\ndemocracy and the rule of law.28\n4. Being territory, being corpus\nTerritories and corpora are undoubtedly a most interesting instance of human thought, particularly\nlegal thought – and they do bring with themselves the problem of what should or could be included\nin those figures and what, by contrast, would be best left out of them. More fundamentally, however,\nboth territories and corpora raise, I suggest, serious questions about the divisions and ensuing\noppositions that they highlight – and so, therefore, they raise questions about legal thought itself.\nMore resolutely (in my view) thanmost other twentieth century philosophers, Martin Heidegger\nundertook the responsibility of showing how, from Plato onwards, what would one day be called\n‘western’ thought has been continuously characterised by the rather troubling cipher of separation –\nthinking for us was always a matter of attributing different ontologies to not always necessarily\nseparate beings. In that sense, modern western thought must be traced back to Cartesianism and its\nlasting but – for Heidegger – puzzling endorsement of Descartes’ ‘cogito ergo sum’.29 According to\nCartesianism, it is one’s own thinking I (somewhat concealed under the popular Latin rendition of\nDescartes’ pronouncement – ‘cogito’, ‘I think’, ‘ergo sum’, ‘therefore I am’) that each time provides the\nultimate certainty of the existence of the object of that thinking (starting with one’s own self). Or, to\nput it differently, the realisation of the object of thinking, human as opposed to godly thinking,\nfollows from the separating of it from a thinking human subject (mind, spirit). Therefore, the old\nontological question ‘why is there something rather than nothing’ is answered by the moderns by\nsaying: because we doubt, we think, the existence of what there is (or, we are certain about things\nbecause we are able to think them). But – for Heidegger – it is precisely upon that inaugural, double\ngesture of separation of the cogito from the bare, undifferentiated fact of existing and, then, of the\n28 I have argued this more fully in Stramignoni (2001, 2002, 2004).\n29 In the natural sciences, by contrast, one will think of Galileo or Newton.\nREVIEW ESSAY 419\nobject from its subject that western rationality takes a new, reflexive turn in its obstinate if perilous\nreification of the world – a reification, in particular, that systematically forgets the being of what there\nis (Heidegger, 1927\/1996).30 By thinking the way we do, we put the world into ‘boxes’ (categories and\nconcepts, territories or corpora) but then we end up treating them as natural or real or else as\nessentially or structurally true – thus forgetting or ignoring the unique being they originally are.\nThus, in a world like today’s where old differences are waning and new differences are apparently on\nthe rise – the old question surfaces again: why is there something rather than nothing?Which is the\nreality we are looking for? What difference does it make? Can any such reality be successfully\nreproduced (the proponents of classification would answer yes) or can it not (sceptical view)?\nIf the difference between Joanna Wagner’s two bodies (territory or corpus) lies in the gesture of\nseparation that each time engenders them, then the larger question posed by such a gesture would\nseem to be – what is thought?Where and when, for example, does one’s own thinking of ‘love’, ‘fear’,\n‘animal’, ‘table’, etc. – occur? In short, which is the place of thought? Such questions are neither idle\nnor abstract – as the natural sciences are only now beginning to discover.31 For a ‘history of the\npresent’ (Foucault, 1976\/1977, Ch. 1), moreover, such questions are of interest as they must have\nhelped us focus on our different objects of knowledge by giving them (shall we say) colour, body, and\narticulation – by making them visible and helping us ‘box’ them.\nNotoriously, and in spite of antiquity’s penchant for heart, chest and praecordia (Onians, 1994,\np. 23 ff.),32 moderns took the head and in particular the cranium to be the place of thought33 – but\nthen, in time, they looked at head and cranium in radically different ways. As Georges Didi-\nHuberman elegantly reminds us (2000), modern scientific rationality has normally treated the\nhead as a ‘box’ (thus favouring an external view of the head) (p. 9), yet at the beginning of modernity\nLeonardo had been fascinated by the internal rather than external aspects of it34 and, in particular, by\nthe ‘system of contact’ (‘syste`me de contact’) between the cranium itself and what is enclosed by it –\n‘the mass of the brains, of course, but also the tissues, membranes, humours or muscles that clothe,\nprotect, work as interfaces or isolate’ (Didi-Huberman, 2000, p. 18).35 In short, Leonardo had likened\nthe head to an onion rather than to a separate, external container (as later moderns would do). In\nonions, Leonardo had noted, container and content coincide – an observation implicitly but impor-\ntantly doing away with any pre-modern yet still current sense of hierarchy between centre and\nperiphery (Didi-Huberman, 2000, pp. 18–20).\nIf the head is the modern seat of thought, the legal world is or often in modernity it has been\ntaken to be the privileged place of legal thought. Thus, placing (legal) thought – in the specific sense\nof giving it a name and a fixed abode in the space and time of law – becomes a fundamental, even\nfoundational gesture of western legal modernity. With it legal modernity, quite literally, takes place\nand makes all the difference. So much so that it is within the legal world and within the legal world\nonly that, from now on, legal thought and themost significant products thereof should be found – or\n30 That is what Heidegger called the question of being – of the being that each time there is (he called this\n‘Da-sein’, an intentionally vague term indicating the human being, whose own being is eminently implicated\nby this question).\n31 For a review – in praise of human nature – see Pinker, 2002.\n32 Interestingly, Greeks, Romans and Anglo-Saxons held the same view on this matter (Onians, 1994, pp. 38–9).\n33 For antiquity, the head was rather the life or holy seat of life (Onians, 1994, pp. 96 ff).\n34 ‘C’est qui le fascine d’abord, dans le craˆne humain, c’est ce qu’il nomme son «coˆte` interne»; c’est la «cavite´ des orbites»,\navec sa «profondeur» dissimule´e; c’est, en general, tous les «trous visibles», et ceux qui se voient moins comme ces\ncanaux par ou`, selon lui, les larmes remontent directement du coeur jusque vers les yeaux’ (Didi-Huberman,\n2000, p. 15).\n35 ‘La masse du cervau, bien suˆr, mais aussi les tissues, membranes, humeurs ou muscles qui enrobent, prote`gent, servent\nd’interfaces ou d’isolants’ (Didi-Huberman, 2000, p. 18).\nIGOR STRAMIGNONI420\nsomanymoderns came to insist. That ‘Pandora box’ syndrome (the idea that the legal world and only\nthe legal world must contain things legal) does, of course, make sense, at least prima facie. In\nmodernity we think and act legally in courts, parliaments and universities – or so it would appear.\nThinking and acting legally in courts, parliaments and universities must then mean that legal briefs,\ncase law, legislation, academic research and other instances of legal thought must be part and parcel\nof the whole we think we inhabit (the legal world in question). As in our intensely word-oriented\nJudaic-Christian cultures such thought is at once elevated to an eminent position and then reduced\nto categories and concepts, such categories and concepts turn out to be both what helps us place legal\nthought and, recursively, the only place of legal thought. Indeed – or so it has often been argued – the\nabsence of such categories and concepts must mean that they (the ‘others’) have no legal thought\nworthy of notice.36 Alternatively, the absence of one or another of the authorised items on the list, or\nelse the relative strength of one of them over the others, could nurture the broader but peculiar\nconcern of comparativismwith legal families and the like. Thus, for example, the absence of trust in a\nparticular legal world could be seen to highlight the Englishness of English law (where trust\nflourished) and the otherness of others. Or else, the absence of a general principle of tort liability\ncould be taken to underline, elsewhere, the Italianness of Italian law (where Art. 2043 of the Codice\nCivile asserts such a principle) and the otherness of others.37\nNow, the Pandora box syndromemaywell have helped ourmodernity frame legal thought as this\nor that part of an autonomous legal territory, legal corpus or legal family – it may well have helped us\ngive each particular object of knowledge some colour, body and articulation at law – but it also has\nbrought dramatically to the surface the deep, constitutive tension – separation, split, schism – of\nwestern thought, and of legal thought in particular. Which for example might be the body of (Anglo-\nAmerican) law? Is it a territory that can be captured by a good (external) classification or is it a multi-\nfaceted corpus that, as such, can only be represented through one of its many but ultimately\ninessential dimensions? The ensuing problem, however, is not so much which point of departure\nis true (external or internal, territory or corpus) – pace for example the parallel debate regarding\nwhether a particular instance of legal thought provides evidence of the existence of a legal system or\nthat of a pre-existing, underlying or surviving legal tradition. Nor, more generally, is the problem\nwhether we are about to witness a clash of civilisations or, by contrast, the end of history. Rather, the\nproblem – and accompanying, continuing anxiety – seems to be that the alternatives on offer can never be\nsuccessfully decided. That is to say, the problem is that once territories or corpora are duly separated\nlawyers will attempt with increasing determination to manipulate them – they will single-handedly\nseek to ‘box’ them – only, however, soon to be displaced by those very territories or corpora in always\nnew directions with the result, amongst other things, of being themselves eventually subjected to\ntheir own initial object of thinking. Thus, Foucault argued, subject and object are brought into the\ngrip of a palpable tension whereby the subject remains inextricably tied up with its object and the\nobject with its subject – in what could be aptly described as the impermanent gaze of a host of\ndifferent histories, knowledges and pouvoirs.38 Or, the long-standing Cartesian separation of an object\nfrom a subject – ‘box’ from master, ruled from ruler etc. – starts slowly at first, and then more and\nmore pervasively, to blur. In short, it becomes undecidable.\nPut differently, the problem today seems to be that categories and concepts as objects of legal\nthinking name a space that lawyers (like scientists but unlike angels) are only too keen to tread, and\nyet they can only tread within limits that, as it turns out, are just as baffling as they are productive.\n36 Legal pluralism has put the more extreme manifestations of that rather exclusionary attitude toward\nalternative forms of regulation to final rest (Roberts, 2005).\n37 For a range of compelling alternatives to comparativism, see Legrand and Munday (2003).\n38 This is, in many ways, the thrust of several of Foucault’s works (1961, 1963\/1973, 1976\/1977).\nREVIEW ESSAY 421\nSo – the question now becomes – which is the subject and which the object? Modern legal spaces, no\ndoubt, are more and more open spaces than ever before. That means that they can be inspected from\nwithin – the way Leonardo liked to do it with the human head: first with a knife, then with a brush\n(he called this method ‘notomia’)39 – or alternatively, they can be inspected from without. For\nexample, Du¨rer – perhaps the most scientific of Renaissance visual artists, given his obsessive\nconcern for Euclidean geometry – famously found a way of keeping the proportions of the head\nuntouched while drawing them from every available, external point of view (Didi-Huberman, 2000,\np. 22). That is to say, he succeeded to put the head in perspective – looking at it from without while\neach time creating a different visual place (‘lieu visuel librement mis en œvre’) (Didi-Huberman, 2000,\np. 28). Similarly, to the extent that maps, schemes or diagrams may help us find ex ante our way into\nthe world, a certain organisation of categories and concepts may well amount to a veritable map of a\nlegal territory as this might look from without (this would be a Du¨rer-like approach). Alternatively,\nan opposite, internalmodus operandi could be adopted (Leonardo’s approach) whereby categories and\nconcepts might evoke this or that legal corpus. Yet the more urgent point is that this modern anxiety\nto open up, chart or tread the space we have ourselves discovered or designed – Nietzsche in his\nmadness might have diagnosed it as a crystal clear instance of all too crazy but all too human will to\npower – is also what may have left legal modernity, as it were, behind itself.\nIn suggesting this, however, what I wish to highlight is a position, not necessarily a failure – a\nsense of on-going displacement rather than of a place yet to be reached. I mean to suggest, in other\nwords, that the different spaces that we have each time opened up, treaded or charted remain true for\nthe different cultures that have expressed them – but, we should now recognise, they often turn out\nto be rather empty or ghostly places – or at least not as real or reliable spaces as initially believed.40 In\nthat case, the question becomes not so much which legal territory to classify or which corpus to\nretrace, but how is each time the territory or else the corpus evoked by our different legal cultures. For\nexample, is the problem whether the tort law that has emerged in England since 1932 is a territory\nthat can be mapped or, by contrast, a corpus that can never be completely reproduced – or is it rather,\nsay, what linguistic, labour-related and life-shaping gestures might have locked the judiciary into the\nrecursive consideration of a particular set of human activities as tortious or non-tortious? Is the\nproblem whether a particular combination of categories and concepts gathered under the template\nof negligence will help us understand English law better – or is it also, and more problematically,\nwhat forces, currents and (strong) undercurrents such a template might or might not be capable of\ndeploying to imbricate and redirect our sense of the self and of the other in the innumerable\nrelationships of everyday life? And, finally, is our object of analysis (what each time we take to be\nthe law) not the result of an eventful heartland that, as such, can only be wandered along (or perhaps\neven exited)41 but never positively explored? This is what I would call the matter of legal space – a\ncrucial matter that, in my view, necessitates some serious attention.\nIn particular, the matter of legal space would be not so much a physical, metaphysical or even a\nhidden reality, but rather somewhat of a fleeting event, an unexpected making sense, a momentous\nyet always momentary positioning – no longer, therefore, a question of internal or external, fixed or\nnear-fixed, points of view but a question of just how each time and in different ways each legal\n39 ‘Le cose mentali che non son passate per il senso son vane e nulla verita` partoriscano se non dannosa, e perche` tal\ndiscorsi nascan da poverta` d’ingegno, poveri son sempre tali discorsori, e se saran nati ricchi, e’ moriran poveri nella lor\nvecchiezza . . . E tu, che di’ esser meglio il vedere fare la notomia che vedere tali disegni, diresti bene . . . che in tali\ndisegni si dimostrano in una sola figura; nella quale, con tutto il tuo ingegno, non vedrai e non arai la notizia se non\nd’alquante poche vene; delle quali io, per averne piena e propria notizia, ho disfatti piu` di dieci corpi umani ’ (Leonardo\nda Vinci, 1992, W 19070v).\n40 For an argument that this might have always been understood to be the risk, see Rossi (1995).\n41 A recent proposal of ‘exodus’ comes from Hardt and Negri (2000).\nIGOR STRAMIGNONI422\nterritory or corpus becomes what it is (taken to be). ‘Boxing’, we noted, helped us give our thought\ncolour, body and articulation at law. English judges, for example, are still said to be and to act quite\ndifferently from their continental brethrens (Damasˆka, 1986). And in England the law of contract is\nstill generally felt to have a different colour, body and articulation from other branches of private\nlaw. In both instances, a number of internal and external tensions are routinely examined. But,\nI suggest, a more urgent sort of question would no longer ask, so much, whether or not the judiciary\nor the law of contract etc. can or cannot be adequately mapped or classified. Increasingly today that\nseems to be an undecidable sort of query – one attempting to separate mapping territories (thus the\nproponents of classifications) from ‘mapping maps’ (like the sceptics ultimately do). Either way, it\nseems to me, there is still some powerful mapping involved – the ‘boxing’ attempts of the modern subject\nvis-a`-vis (and this is the point) its increasingly intractable, increasingly imperious object (this or that\njudiciary, this or that law of contract, this or that concept of family etc.). As it turns out, lawyers of a\n‘civilian’ persuasion prefer to map territories (legal systems or traditions) rather than maps. Those of\nAnglo-American persuasion, by contrast, prefer to map maps – to put what maps there are back into\nthe familiar regions of an immemorial legal corpus. Both camps, of course, have their internal\ndissidents. And both hope to capture the object of their desires and to bring it home (that much is\nclear). But what, incredibly, is still little considered is how, self-confined into an intricate, Escher-like\nmaze of territories and corpora, western lawyers remain put while everything else around them\ncontinues, thankfully, to move.\nSo, Foucault argued in his Preface to theOrder of Things (1966\/1970), the problemwithmapping is\nnot so much one of inclusion or indeed of exclusion – as the debate on legal classifications\nexemplified by the book under consideration continually if anxiously seems to presume. Much\nmore fundamentally – for Foucault – the problem is the extent to which mapping can hide the\noutside, so to speak, of thought. Consider an exotic taxonomy:\n‘In the wonderment of this taxonomy, the thing we apprehend in one great leap, the thing\nthat . . . is demonstrated as the exotic charm of another system of thought, is the limitation of our\nown, the stark impossibility of thinking that.’ (Foucault, 1966\/1970, p. xv, author’s emphasis)\nThus, we come to realise, what is unthinkable about a classifiable legal territory or about an\nimmemorial legal corpus is not simply what they define or prescribe as regular or exceptional\n(although that, too, can be rather problematic) – but that in separating regular and exceptional\nthey localise what they separate, thus exorcising the possibility of thinking ‘dangerous’, unexpected,\nor imaginative combinations. Unthinkable is indeed the site of the resulting proximities – the\ncommon ground whichmade the distribution of each territory or corpus possible.42 And, on showing\nthat distribution while at the same time suppressing the very site that made it possible, each\nmapping exhibits a particular disorder but also ‘a worse kind of disorder . . . I mean the disorder in\nwhich fragments of a large number of possible orders glitter separately in the dimension, without\nlaw or geometry, of the heteroclite’ (Foucault, 1966\/1970, p. xvii, author’s emphasis). That is to say,\nwhere there is mapping there is no home for any other order – not even a utopian home.43 Instead,\nthere will be heterotopias – injunctions that simply yet powerfully disturb all established language as\nthey ‘desiccate speech, stop words in their tracks, contest the very possibility of grammar at its\nsource; they dissolve the myths and sterilise the lyricism of our sentences’ (Foucault, 1966\/1970,\np. xviii). Finally, mapping also speaks of aphasia – for being homeless (in the sense of being radically\noutside, neither included into nor excluded from any territory or corpus) must mean being radically\n42 ‘Where could they ever meet, except in the immaterial sound of the voice pronouncing their enumeration,\nor on the page transcribing it?’ (Foucault, 1970, p. xvi).\n43 Here Foucault seems to read Heidegger more radically than elsewhere.\nREVIEW ESSAY 423\nunable to speak – and that, too, is the trouble with mapping. So, then, mapping points to a ‘kind of\nthought without space, to words and categories that lack all life and place, but are rooted in a\nceremonial space’ (Foucault, 1966\/1970, p. xix) – complex as it is strange, exotic, and unfamiliar.\nThus, we suddenly come to realise, there is ‘at the other extremity of the earth we inhabit, a culture\nentirely devoted to the ordering of space, but one that does not distribute the multiplicity of existing\nthings into any of the categories that make it possible for us to name, speak, and think’ (ibid.). Or, we\nsuddenly discover the other that we are.\nSo, what is so problematic about mapping, according to Foucault, is the extent to whichmapping\nblots-out ‘outside’ space (‘du dehors’) – thus neither so much the space that becomes visible from\ninside (here, the many dimensions of a legal corpus) nor the space that can be made visible from\noutside (the territory of a legal classification). Foucault adopts here a quintessentially Heideggerian\ninsight – an understanding of things as world, finitude and solitude – that now becomes a strategy to\nmake words and things move (Heidegger, 1929–1930\/2001). What mapping urgently asks, Foucault\nsuggests, is the question of order44 – but then, in so doing, mapping interrogates less the structure of\nthat order (whether internal or external) than one’s distance from it.45 Order – for Foucault – is\n‘at one and the same time, that which is given in things as their inner law, the hidden network\nthat determines the way they confront one another, and also that which has no existence except\nin the grid created by a glance, an examination, a language.’ (Foucault, 1966\/1970, p. xx)\nOrder is both those regions – both the inside and the outside of life, both the already encoded and the\nreflexive code – and those regions are far from each other. But, Foucault continues, that is precisely\nthe point. For between the inside and the outside, between the already encoded and the reflexive code\n‘there is a middle region that liberates order itself’ (Foucault, 1966\/1970, p. xxi). That middle region,\nthat in-between,\n‘in so far as it makes manifest the modes of being of order, can be posited as the most\nfundamental of all: anterior to words, perceptions and gestures . . .more solid, more archaic,\nless dubious, always more ‘true’ than the theories that attempt to give those expressions explicit\nform, exhaustive application, or philosophical foundation. Thus, in every culture, between the\nuse of what one might call the ordering codes and reflections upon order itself, there is the pure\nexperience of order and of its modes of being.’ (Foucault, 1966\/1970, p. xxi)\nThe pure experience of order – that is, according to Foucault, what is more problematically at stake in\nthings like a legal classification or a legal corpus.46 Not just the reflexive code of the classification\nitself (what legal territory it presumes to represent) nor, by contrast, the encoded order of the\nhistorical record (a legal corpus with its multiple dimensions) – but the pure experience of order.\nThat experience, Foucault noticed, emerges when we investigate the space of order through which\nknowledge was constituted, the epistemological field of a knowledge ‘envisaged apart from all\ncriteria having reference to its rational value or to its objective forms’ (Foucault, 1966\/1970,\np. xxii). In short, that experience emerges when we engage not so much in the history of ideas or\nin the history of science as, rather, in a true ‘archaeology of knowledge’ (Foucault, 1966\/1970, p. xxii).\n44 Comparative lawyers would be well placed to deal with the question of order, precisely because of their\nbeing ‘‘distant from home’’ – Stramignoni (2002 (b)).\n45 That is, in my view, a central problem with constructivist epistemologies that aptly remind the enthusiasts\nof classifications of the artificiality of the legal sphere – yet imply for their analyses a stable and recurring\nobject of sort that shows just the same drawbacks as the Cartesian object fatally criticised by Heidegger and\nFoucault. System theorists, by contrast, employ Heideggerian and Foucaldian insights to radicalise western\nliberal thought – an enterprise that opens, it seems, more questions than it hopes to resolve.\n46 For a development of this insight, see Agamben (1998).\nIGOR STRAMIGNONI424\n5. Conclusions\nSo, onemight ask, where do the work of Heidegger and Foucault leave us in the classification debate?\nAnd where do they leave, in particular, judges and lawyers who are pressed by the urgent necessities\nof their daily legal business? It is difficult to obtain universal guidance here as, clearly, such a\nguidance would be part of the problem. Instead, the point is that we might need to suspend\njudgement – each one of us individually, or as a ‘multitude’ (Hardt and Negri, 2000) – and think\nlegal mapping afresh. Gilles Deleuze, for example, indicated a particular way forward in a brilliant\nessay on the role of statements in discourse (e´nonce`s) – that could be productively elaborated by\nlawyers (Deleuze, 1986\/1999). Likewise, Didi-Huberman continues to probe the different places of\nthought in western art (lieux de la pense´e) by experimenting on the possibility of ‘touching’ thought\n(toucher la pense´e) (Didi-Huberman, 2000). So then, we might ask, will we be able one day soon to\n‘touch’ the places of legal thought that we are as well as inhabit – thus recovering the distance that\nseparates us inside as well as outside, privately as well as publicly?\nManymore are working on the samewavelength as Heidegger and Foucault – expanding on their\nlegacy. Heidegger, it is increasingly recognised, opened the way to an unparallel, critical reasses-\nsment of the Cartesian legacy of western thought – including legal thought – that can no longer be\nsafely ignored. Later on, Foucault started along the same path – showing how, paradoxically, the\nrelentless reification of the world by the subject, father, king or legislator brings into view the outside\nof the internal\/external orderings on which modernity has based its powerful if precarious sover-\neignty over the ‘other’. But then, as both Heidegger and Foucault understood, western ways of\nthinking must systematically leave out what a basic sense of justice would require us to tend to\nwith no delay. What then seems to be the problem today – as far as the debate on legal classifications\nis concerned – is not so much that of ascertaining which might be Johanna Wagner’s ‘real’ body\n(whether a classifiable legal territory or an unclassifiable legal corpus) but, rather, the pure experience\nof that body and the undecidability that it entails.47\nFor how could it ever be just that which could never be properly decided?48\nReferences\nAGAMBEN, Giorgio (1998) Homo Sacer: Sovereign Power and Bare Life. Stanford, California: Stanford\nUniversity Press.\nBIRKS, Peter (1999)(a) ‘Book Review’ Law Quarterly Review 115: 681.\nBIRKS, Peter (1999)(b) ‘The Law of Restitution at the End of an Epoch’ Western Australian Law Review\n28: 13.\nBIRKS, Peter (2000)(a) ‘Preface’ English Private Law. Oxford: Oxford University Press.\nBIRKS, Peter (2000)(b) ‘Three Kinds of Objection to Discretionary Remedialism’ 29 Western Australian\nLaw Review 29: 1.\nDAMASˆKA, Mirjam R. (1986) The Faces of Justice and State Authority: A Comparative Approach to the Legal\nProcess. New Haven; London: Yale University Press.\nDELEUZE, Gilles (1986\/1999) Foucault. London: Athlone.\nDERRIDA, Jacques (1994) Force de Loi: Le ‘fondement mystique de l’autorite´’. Paris: Galile´e.\nDIDI-HUBERMAN, Georges (2000) Eˆtre craˆne – lieu, contact, pense´e, sculpture. Paris: Les E´ditions de Minuit.\nFOUCAULT, Michel (1966\/1970) The Order of Things: An Archaeology of the Human Sciences. London:\nTavistock.\n47 For one example, see Vandervelde (1992) (regrettably, this important article is ignored by Waddams in his\nbook).\n48 For a powerful attempt to answer to this difficult question, see Derrida (1994).\nREVIEW ESSAY 425\nFOUCAULT, Michel (1963\/1973) Birth of the Clinic. London: Tavistock.\nFOUCAULT, Michel (1976\/1977) Discipline and Punish: The Birth of the Prison. London: Allen Lane.\nFOUCAULT, Michel (1976\/1979) La Volonte´ de savoir. London: Allen Lane.\nFOUCAULT, Michel (1965\/1988) Madness and Civilisation : A History of Insanity in the Age of Reason. New\nYork: Vintage.\nHARDT, Michael and Negri, Antonio (2000) Empire. Cambridge, Mass.; London: Harvard University\nPress.\nHEIDEGGER, Martin (1927\/1996) Being and Time. Albany, N.Y.: State University of New York Press.\nHEIDEGGER, Martin (1929–1930\/1995) The Fundamental Concepts of Metaphysics. Bloomington, Indiana:\nIndiana University Press.\nJOSSERAND, Louis (1939) De l’Esprit des droits et de leur relativite´. Paris: Dalloz.\nLEGRAND, Pierre and MUNDAY, Roderick (2003) Comparative Legal Studies: Traditions and Transitions.\nCambridge: Cambridge University Press.\nLEONARDO DA VINCI (1992) Scritti. Milan: Mursia.\nMAITLAND, Sir Frederic W. (1957) ‘English Law and the Renaissance’, in H.M. Cam (ed.) Selected\nHistorical Essays of F W Maitland. Cambridge: Cambridge University Press, 135 ff.\nONIANS, R. B. (1994) The Origins of European Thought. Cambridge: Cambridge University Press.\nPINKER, Steven (2002) The Blank Slate. London: Allen Lane.\nPOLLOCK, Sir Frederick (1923) ‘A Plea for Historical Interpretation’ Law Quarterly Review 39: 162.\nROBERTS, Simon (2005) ‘After Government? On Representing Law Without the State’ Modern Law\nReview 68: 1.\nROSSI, Paolo (1995) Naufragi senza spettatore. L’idea di Progresso. Milan: il Mulino.\nROTHERHAM, Craig (1996) ‘The Metaphysics of Tracing: Substituted Title and Property Rhetoric’ (1996)\nOsgoode Hall Law Journal 34: 321.\nROTHERHAM, Craig (2000) ‘Trust Property and Unjust Enrichment: Tracing into the Proceeds of Life\nInsurance Policies’ Cambridge Law Journal 440.\nSAMUEL, Geoffrey (1997) ‘Classification of obligations and the impact of constructivist epistemologies’\nLegal Studies 17: 448.\nSAMUEL, Geoffrey (2002) ‘English Private Law: Old and New Thinking in the TaxonomyDebate’Oxford\nJournal of Legal Studies 24: 335.\nSTRAMIGNONI, Igor (2001) ‘When Law Stands Still: Land Contracts in English Law and Law’s\n‘Abandonment’ of Everyday Life’ Law and Critique 12: 105.\nSTRAMIGNONI, Igor (2002) (a) ‘At theMargins of the History of English Law: The Institutional, the Socio-\nPolitical and the ‘‘Blotted-out’’’ Legal Studies 22: 420.\nSTRAMIGNONI, Igor (2002) (b) ‘The King’s One too Many Eyes: Language, Thought and Comparative\nLaw’ Utah Law Review 739.\nSTRAMIGNONI, Igor (2004) ‘Francesco’s Devilish Venus: Notations on the Matter of Legal Space’\nCalifornia Western Law Review 41: 147–240.\nVANDERVELDE, Lea (1992) ‘The Gendered Origins of the Lumley Doctrine: Binding Men’s Consciences\nand Women’s Fidelity’ Yale Law Journal 101: 775.\nWRIGHT OF DURLEY, Lord (1939) Legal Essays and Addressess. Cambridge: Cambridge University Press.\nIGOR STRAMIGNONI426\n"}