{"doi":"10.5194\/angeo-20-1335-2002","coreId":"71191","oai":"oai:eprints.lancs.ac.uk:6606","identifiers":["oai:eprints.lancs.ac.uk:6606","10.5194\/angeo-20-1335-2002"],"title":"Field-aligned currents and ionospheric parameters deduced from EISCAT radar measurements in the post-midnight sector","authors":["Sugino, M.","Fujii, R.","Nozawa, S.","Nagatsuma, T.","Buchert, S. C.","Gjerloev, J. W.","Kosch, M. J."],"enrichments":{"references":[{"id":16358676,"title":"A new Digital All-Sky Imager experiment for optical auroral studies in conjunction with the STARE coherent radar system,","authors":[],"date":"1998","doi":"10.1063\/1.1148697","raw":"Kosch, M. J., Nielsen, E., and Hagfors, T.: A new Digital All-Sky Imager experiment for optical auroral studies in conjunction with the STARE coherent radar system, Rev. Sci. Instrum., 69, 578– 584, 1998a.","cites":null},{"id":16358678,"title":"A plasma vortex revisited: The importance of including ionospheric conductivity measurements,","authors":[],"date":"2000","doi":"10.1029\/2000ja900102","raw":"Kosch, M. J., Amm, O., and Scourﬁeld, M. W. J.: A plasma vortex revisited: The importance of including ionospheric conductivity measurements, J. Geophys. Res., 105, 24889–24898, 2000.","cites":null},{"id":16358677,"title":"A self-consistent explanation for a plasma vortex associated with the brightening of an auroral arc,","authors":[],"date":"1998","doi":"10.1029\/98ja02480","raw":"Kosch, M. J., Scourﬁeld, N. W. J., and Nielsen, E.: A self-consistent explanation for a plasma vortex associated with the brightening of an auroral arc, J. Geophys. Res., 103, 29383–29391, 1998b.","cites":null},{"id":16358681,"title":"A two-dimensional magnetometer array for ground-based observations of auroral zone electric currents during the International Magnetospheric Study (IMS),","authors":[],"date":"1979","doi":null,"raw":"K¨ uppers, F., Untiedt, J., Baumjohann, W., Lange, K., and Jones, A. G.: A two-dimensional magnetometer array for ground-based observations of auroral zone electric currents during the International Magnetospheric Study (IMS), J. Geophys., 46, 429, 1979.","cites":null},{"id":16358684,"title":"Auroral arc classiﬁcation scheme based on the observedarc-associatedelectricﬁeldpattern,","authors":[],"date":"1984","doi":null,"raw":"Marklund, G.: Auroral arc classiﬁcation scheme based on the observedarc-associatedelectricﬁeldpattern, Planet.SpaceSci., 32, 193–211, 1984.","cites":null},{"id":16358662,"title":"Auroral arc electrodynamic parameters measured AE-C and the Chatanika radar,","authors":[],"date":"1981","doi":"10.1029\/ja086ia06p04671","raw":"de la Beaujardi` ere, O., Vondrak, R., Heelis, R., Hanson, W., and Hoffman, R.: Auroral arc electrodynamic parameters measured AE-C and the Chatanika radar, J. Geophys. Res., 86, 4671–4685, 1981.","cites":null},{"id":16358656,"title":"Auroral ionospheric quiet summer time conductances,","authors":[],"date":"1988","doi":null,"raw":"Brekke. A. and Hall, C.: Auroral ionospheric quiet summer time conductances, Ann. Geophysicae, 6, 361–376, 1988.","cites":null},{"id":16358658,"title":"Auroral radar and rocket double-probe observations of the electric ﬁeld across the Harang discontinuity,","authors":[],"date":"1978","doi":"10.1029\/gl005i008p00687","raw":"Cahill, L. J., Greenwald, R. A., and Nielsen, E.: Auroral radar and rocket double-probe observations of the electric ﬁeld across the Harang discontinuity, Geophys. Res. Lett., 5, 687–690, 1978.","cites":null},{"id":16358690,"title":"Auroral zone E-region conductivities during solar minimum derived from EISCAT data,","authors":[],"date":"1988","doi":null,"raw":"Schlegel, K.: Auroral zone E-region conductivities during solar minimum derived from EISCAT data, Ann. Geophysicae, 6, 129–138, 1988.","cites":null},{"id":16358694,"title":"Convection electric ﬁelds and electrostatic potential over 61◦","authors":[],"date":"1990","doi":"10.1029\/ja091ia01p00233","raw":"Senior, C., Fontaine, D., Caudal, G., Alcayd´ e, D., and Fontanari, J.: Convection electric ﬁelds and electrostatic potential over 61◦ < 3 < 72◦ invariant latitude observed with the European incoherent scatter facility. 2. Statistical results, Ann. Geophysicae, 8, 257–272, 1990.","cites":null},{"id":16358696,"title":"Direct determination of large-scale magnetospheric ﬁeld-aligned currents with SuperDARN,","authors":[],"date":"1995","doi":"10.1029\/95gl01317","raw":"Sofko, G. J., Greenwald, R., and Bristow, W.: Direct determination of large-scale magnetospheric ﬁeld-aligned currents with SuperDARN, Geophys. Res. Lett., 22, 2041–2044, 1995.","cites":null},{"id":16358691,"title":"Drifting black aurorae?,","authors":[],"date":"1990","doi":"10.1029\/ja095ia01p00241","raw":"Schoute-Vanneck, H., Scourﬁeld, M. W. J., and Nielsen, E.: Drifting black aurorae?, J. Geophys. Res., 95, 241–246, 1990.","cites":null},{"id":16358692,"title":"Effect of electric ﬁelds on the daytime high-latitude E- and F-regions,","authors":[],"date":"1975","doi":"10.1029\/ja080i022p03121","raw":"Schunk, R. W., Raitt, W. J., and Banks, P. M.: Effect of electric ﬁelds on the daytime high-latitude E- and F-regions, J. Geophys. Res., 80, 3121–3130, 1975.","cites":null},{"id":16358660,"title":"EISCAT data base for ionospheric modelling: Fregion and topside ionosphere,","authors":[],"date":"1995","doi":"10.1016\/0273-1177(95)00096-w","raw":"Collis, P. N.: EISCAT data base for ionospheric modelling: Fregion and topside ionosphere, Adv. Space. Res., 16, 37–46, 1995.","cites":null},{"id":16358663,"title":"EISCAT: An updated description of technical characteristics and operational capabilities,","authors":[],"date":"1983","doi":"10.1029\/rs018i006p00867","raw":"Folkestad, K., Hagfors, T.. and Westerlund, S.: EISCAT: An updated description of technical characteristics and operational capabilities, Radio Sci., 18, 867–879, 1983.","cites":null},{"id":16358683,"title":"Electrodynamic coupling of the magnetosphere and ionosphere,","authors":[],"date":"1990","doi":"10.1007\/bf00704239","raw":"Lysak, R. L.: Electrodynamic coupling of the magnetosphere and ionosphere, Space Sci. Rev., 52, 33–87, 1990.","cites":null},{"id":16358666,"title":"Electrodynamic parameters in the nighttime sector during auroral substorms,","authors":[],"date":"1994","doi":"10.1029\/93ja02210","raw":"Fujii, R., Hoffman, R. A., Anderson, P. C., Craven, J. D., Sugiura, M., Frank, L. A., and Maynard, N. C.: Electrodynamic parameters in the nighttime sector during auroral substorms, J. Geophys. Res., 99, 6093–6112, 1994.","cites":null},{"id":16358671,"title":"Extension of the MSIS thermosphere model into the middle and lower atmosphere,","authors":[],"date":"1991","doi":"10.1029\/90ja02125","raw":"Hedin, A. E.: Extension of the MSIS thermosphere model into the middle and lower atmosphere, J. Geophys. Res., 96, 1159–1172, 1991.","cites":null},{"id":16358659,"title":"Field-aligned currents deduced from EISCAT radar observations and implications concerning the mechanism that produces region 2 currents,","authors":[],"date":"1987","doi":"10.1029\/ja092ia06p06000","raw":"Caudal, G.: Field-aligned currents deduced from EISCAT radar observations and implications concerning the mechanism that produces region 2 currents, J. Geophys. Res., 92, 6000–6012, 1987.","cites":null},{"id":16358675,"title":"Field-aligned currents in geospace: substance and significance, in: Magnetospheric Current Systems,","authors":[],"date":"2000","doi":"10.1029\/gm118p0107","raw":"Iijima, T.: Field-aligned currents in geospace: substance and significance, in: Magnetospheric Current Systems, (Eds) Ohtani, S., Fujii, R., Hesse, M., and Lysak, R. L., AGU Geophysical Monograph 118, pp. 107–129, 2000.","cites":null},{"id":16358700,"title":"Field-aligned currents in high latitudes estimated from Millstone Hill radar observations of ion drifts,","authors":[],"date":null,"doi":"10.1029\/ja087ia04p02553","raw":"Yasuhara, F., Kamide, Y., and Holt, J. M.: Field-aligned currents in high latitudes estimated from Millstone Hill radar observations of ion drifts, J. Geophys. Res., 87, 2553–2557, 1982.","cites":null},{"id":16358673,"title":"Field-aligned currents in the dayside cusp observed by Triad,","authors":[],"date":"1976","doi":"10.1029\/ja081i034p05971","raw":"Iijima, T. and Potemra, T. A.: Field-aligned currents in the dayside cusp observed by Triad, J. Geophys. Res., 81, 5971–5979, 1976.","cites":null},{"id":16358652,"title":"Ground-based measurements of an arc-associated electric ﬁeld,","authors":[],"date":"1993","doi":"10.1016\/0021-9169(93)90021-p","raw":"Aikio, A. T., Opgenoorth, H. J., Persson, M. A. L., and Kaila, K. U.: Ground-based measurements of an arc-associated electric ﬁeld, J. Atmos. Terr. Phys., 55, 797–803, 1993.","cites":null},{"id":16358699,"title":"High-resolution television observations of black aurora,","authors":[],"date":"1997","doi":"10.1029\/96ja03106","raw":"Trondsen, T. S. and Cogger, L. L.: High-resolution television observations of black aurora, J. Geophys. Res., 102, 363–378, 1997.","cites":null},{"id":16358654,"title":"International geomagnetic reference ﬁeld: The seventh generation,","authors":[],"date":"1997","doi":"10.5636\/jgg.49.123","raw":"Barton, C. E.: International geomagnetic reference ﬁeld: The seventh generation, J. Geomag. Geoelectr., 49, 123–148, 1997.","cites":null},{"id":16358655,"title":"Ionospheric and ﬁeld-aligned current systems in the auroral zone: A concise review,","authors":[],"date":"1983","doi":"10.1016\/0273-1177(82)90363-5","raw":"Baumjohann, W.: Ionospheric and ﬁeld-aligned current systems in the auroral zone: A concise review, Adv. Space. Res., 2, 55–62, 1983.","cites":null},{"id":16358698,"title":"L.J.: Precipitatingelectron energy ﬂux and auroral zone conductance – An empirical model,","authors":[],"date":null,"doi":null,"raw":"Spiro, R.W., Reiff, P.H., andMaher, Jr., L.J.: Precipitatingelectron energy ﬂux and auroral zone conductance – An empirical model, J. Geophys. Res., 87, 8215–8227, 1982.","cites":null},{"id":16358674,"title":"Large-scale characteristics of ﬁeldaligned currents associated with substorms,","authors":[],"date":"1978","doi":"10.1029\/ja083ia02p00599","raw":"Iijima, T. and Potemra, T. A.: Large-scale characteristics of ﬁeldaligned currents associated with substorms, J. Geophys. Res., 83, 599–615, 1978.","cites":null},{"id":16358664,"title":"Large-scale distributions of ionospheric horizontal and ﬁeld-aligned currents inferred from EISCAT,","authors":[],"date":"1996","doi":"10.1007\/s00585-996-1284-z","raw":"Fontaine, D. and Peymirat, C.: Large-scale distributions of ionospheric horizontal and ﬁeld-aligned currents inferred from EISCAT, Ann. Geophysicae, 14, 1284–1296, 1996.","cites":null},{"id":16358668,"title":"Latitudinal structures of nightside ﬁeld-aligned currents and their relationships to the plasma sheet regions,","authors":[],"date":"1993","doi":"10.1029\/92ja02031","raw":"Fukunishi, H., Takahashi, Y., Nagatsuma, T., Mukai, T., and Machida, S.: Latitudinal structures of nightside ﬁeld-aligned currents and their relationships to the plasma sheet regions, J. Geophys. Res., 98, 11235–11255, 1993.","cites":null},{"id":16358697,"title":"Magnetospheric plasma pressures in the midnight meridian: Observations from 2.5 to 35RE,","authors":[],"date":"1989","doi":"10.1029\/ja094ia05p05264","raw":"Spence, H. E., Kivelson, M. G., Walker, R. J., and McComas, D. J.: Magnetospheric plasma pressures in the midnight meridian: Observations from 2.5 to 35RE, J. Geophys. Res., 94, 5264– 5272, 1989.","cites":null},{"id":16358653,"title":"Method of characteristics in spherical geometry applied to a Harang discontinuity situation,","authors":[],"date":"1998","doi":"10.1007\/s00585-998-0413-2","raw":"Amm, O.: Method of characteristics in spherical geometry applied to a Harang discontinuity situation, Ann. Geophysicae, 16, 413– 424, 1998.","cites":null},{"id":16358672,"title":"Observations of ionosphere\/magnetosphere interactions from the Dynamics Explorer satellites,","authors":[],"date":"1989","doi":null,"raw":"Hoffman, R. A.: Observations of ionosphere\/magnetosphere interactions from the Dynamics Explorer satellites, AGARD, Ionospheric Structure and Variability on a Global Scale and Interactions with Atmosphere and Magnetosphere p. 17 (SEE N90-11361 02-46), April, 1989.","cites":null},{"id":16358688,"title":"On calculating ionospheric conductivities from the ﬂux and energy of precipitating electrons,","authors":[],"date":"1987","doi":"10.1029\/ja092ia03p02565","raw":"Robinson, R. M., Vondrak, R. R., Miller, K., Dabbs, T., and Hardy, D. A.: On calculating ionospheric conductivities from the ﬂux and energy of precipitating electrons, J. Geophys. Res., 92, 2565–2569, 1987.","cites":null},{"id":16358657,"title":"Properties of spikelike shear ﬂow reversals observed in the auroral plasma by Atmosphere Explorer","authors":[],"date":"1976","doi":"10.1029\/ja081i022p03886","raw":"Burch, J. L., Lennartsson, W., Hanson, W. B., Heelis, R. A., Hoffman, J. H., and Hoffman, R. A.: Properties of spikelike shear ﬂow reversals observed in the auroral plasma by Atmosphere Explorer C, J. Geophys. Res., 81, 3886–3896, 1976.","cites":null},{"id":16358689,"title":"Regional estimation of electric ﬁelds and currents in the polar ionosphere,","authors":[],"date":"1995","doi":"10.1029\/94gl03076","raw":"Sato, M., Kamide, Y., Richmond, A. D., Brekke, A., and Nozawa, S.: Regional estimation of electric ﬁelds and currents in the polar ionosphere, Geophys. Res. Lett., 22, 283–286, 1995.","cites":null},{"id":16358686,"title":"Regions of strongly enhanced perpendicular electric ﬁelds adjacent to auroral arcs,","authors":[],"date":"1990","doi":"10.1016\/0021-9169(90)90044-n","raw":"Opgenoorth, H. J., H¨ aggstr¨ om, I., Williams, P. J. S., and Jones, G. O. L.: Regions of strongly enhanced perpendicular electric ﬁelds adjacent to auroral arcs, J. Atmos. Terr. Phys., 52, 449– 458, 1990.","cites":null},{"id":16358693,"title":"Relationship between ﬁeld-aligned currents, diffuse auroral precipitation and the westwardelectrojetintheearlymorningsector,","authors":[],"date":null,"doi":"10.1029\/ja087ia12p10469","raw":"Senior, C., Robinson, R. M., and Potemra, T. A.: Relationship between ﬁeld-aligned currents, diffuse auroral precipitation and the westwardelectrojetintheearlymorningsector, J.Geophys.Res., 87, 10469–10477, 1982.","cites":null},{"id":16358695,"title":"Solar and particle contributions to auroral heightintegrated conductivities from EISCAT data: a statistical study,","authors":[],"date":"1991","doi":null,"raw":"Senior, C.: Solar and particle contributions to auroral heightintegrated conductivities from EISCAT data: a statistical study, Ann. Geophysicae, 9, 449–460, 1991.","cites":null},{"id":16358665,"title":"Spatial relationships between region 2 ﬁeld-aligned currents and electron and ion precipitation in the evening sector,","authors":[],"date":"1990","doi":"10.1029\/ja095ia11p18939","raw":"Fujii, R., Hoffman, R. A., and Sugiura, M.: Spatial relationships between region 2 ﬁeld-aligned currents and electron and ion precipitation in the evening sector, J. Geophys. Res., 95, 18939– 18947, 1990.1348 M. Sugino et al.: Field-aligned currents and ionospheric parameters Fujii, R., Nozawa, S., Matuura, N., and Brekke, A.: Study on neutral wind contribution to the electrodynamics in the polar ionosphere using EISCAT CP-1 data, J. Geophys. Res., 103, 14731– 14739, 1998.","cites":null},{"id":16358669,"title":"STARE: A new radar auroral backscatter experiment in northern Scandinavia,","authors":[],"date":"1978","doi":"10.1029\/rs013i006p01021","raw":"Greenwald, R. A., Weiss, W., Nielsen, E., and Thomson, N. R.: STARE: A new radar auroral backscatter experiment in northern Scandinavia, Radio Sci., 13, 1021–1039, 1978.","cites":null},{"id":16358670,"title":"Statistical and functional representations of the pattern of auroral energy ﬂux, number ﬂux, and conductivity,","authors":[],"date":"1987","doi":"10.1029\/ja092ia11p12275","raw":"Hardy, D. A., Gussenhoven, M. S., Raistrick, R., and McNeil, W. J.: Statistical and functional representations of the pattern of auroral energy ﬂux, number ﬂux, and conductivity, J. Geophys. Res., 92, 12275–12294, 1987.","cites":null},{"id":16358679,"title":"Statistical average estimates of high latitude ﬁeld-aligned currents from","authors":[],"date":"2001","doi":"10.1016\/s0273-1177(01)00168-5","raw":"Kosch, M. J. and Nielsen, E.: Statistical average estimates of high latitude ﬁeld-aligned currents from the STARE and SABRE coherent VHF radar systems, Adv. Space Res., 27, 1239–1244, 2001.","cites":null},{"id":16358667,"title":"Statistical characteristics of electromagnetic energy transfer between the magnetosphere, the ionosphere, and the thermosphere,","authors":[],"date":"1999","doi":"10.1029\/98ja02750","raw":"Fujii, R., Nozawa, S., Buchert, S. C., and Brekke, A.: Statistical characteristics of electromagnetic energy transfer between the magnetosphere, the ionosphere, and the thermosphere, J. Geophys. Res., 104, 2357–2365, 1999.","cites":null},{"id":16358685,"title":"Studies of the E-region neutral wind in the disturbed auroral ionosphere,","authors":[],"date":"1995","doi":"10.1029\/95ja00676","raw":"Nozawa, S. and Brekke, A.: Studies of the E-region neutral wind in the disturbed auroral ionosphere, J. Geophys. Res., 100, 14717– 14734, 1995.","cites":null},{"id":16358687,"title":"The EISCAT ionospheric radar: the system and its early results,","authors":[],"date":"1985","doi":null,"raw":"Rishbeth, H. and Williams, P. J. S.: The EISCAT ionospheric radar: the system and its early results, Q. J. R. Astron. Soc., 26, 478– 512, 1985.","cites":null},{"id":16358682,"title":"The electrodynamics of a drifting auroral arc,","authors":[],"date":"1994","doi":null,"raw":"Lewis, R. V., Williams, P. J. S., Jones, G. O. L., Opgenoorth, H. J., and Persson, M. A. L.: The electrodynamics of a drifting auroral arc, Ann. Geophysicae, 12, 478–480, 1994.","cites":null},{"id":16358680,"title":"The importance of conductivity gradients in ground-based ﬁeld-aligned current studies,","authors":[],"date":"2001","doi":"10.1016\/s0273-1177(01)00203-4","raw":"Kosch, M. J., Scourﬁeld, M. W. J., and Amm, O.: The importance of conductivity gradients in ground-based ﬁeld-aligned current studies, Adv. Space Res., 27, 1277–1282, 2001.","cites":null},{"id":16358661,"title":"The relationship between electric ﬁelds, conductances and currents in the high-latitude ionosphere: astatisticalstudyusingEISCATdata,","authors":[],"date":"1999","doi":"10.1007\/s00585-999-0043-3","raw":"Davies. J. A. and Lester, M.: The relationship between electric ﬁelds, conductances and currents in the high-latitude ionosphere: astatisticalstudyusingEISCATdata, Ann.Geophysicae, 17, 43– 52, 1999.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71191.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/6606\/1\/art_306.pdf","pdfHashValue":"9311a4c18091e83f8be10a671b2025e357a0d469","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:6606<\/identifier><datestamp>\n      2018-01-24T03:14:45Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5431<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Field-aligned currents and ionospheric parameters deduced from EISCAT radar measurements in the post-midnight sector<\/dc:title><dc:creator>\n        Sugino, M.<\/dc:creator><dc:creator>\n        Fujii, R.<\/dc:creator><dc:creator>\n        Nozawa, S.<\/dc:creator><dc:creator>\n        Nagatsuma, T.<\/dc:creator><dc:creator>\n        Buchert, S. C.<\/dc:creator><dc:creator>\n        Gjerloev, J. W.<\/dc:creator><dc:creator>\n        Kosch, M. J.<\/dc:creator><dc:subject>\n        T Technology (General)<\/dc:subject><dc:date>\n        2002<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/6606\/1\/art_306.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.5194\/angeo-20-1335-2002<\/dc:relation><dc:identifier>\n        Sugino, M. and Fujii, R. and Nozawa, S. and Nagatsuma, T. and Buchert, S. C. and Gjerloev, J. W. and Kosch, M. J. (2002) Field-aligned currents and ionospheric parameters deduced from EISCAT radar measurements in the post-midnight sector. Annales Geophysicae, 20 (9). pp. 1335-1348. ISSN 0992-7689<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/6606\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.5194\/angeo-20-1335-2002","http:\/\/eprints.lancs.ac.uk\/6606\/"],"year":2002,"topics":["T Technology (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Annales Geophysicae (2002) 20: 1335–1348 c© European Geophysical Society 2002\nAnnales\nGeophysicae\nField-aligned currents and ionospheric parameters deduced from\nEISCAT radar measurements in the post-midnight sector\nM. Sugino1, R. Fujii1, S. Nozawa1, T. Nagatsuma2, S. C. Buchert3, J. W. Gjerloev4, and M. J. Kosch5\n1Solar-Terrestrial Environment Laboratory, Nagoya University, Chikusa-ku, Nagoya 464-8601, Japan\n2Communications Research Laboratory, 4-2-1 Nukui-kita, Koganei, Tokyo 184-8795, Japan\n3Swedish Institute of Space Physics, Uppsala Division, Box 537, 751 21 Uppsala, Sweden\n4National Research Council, NASA\/Goddard Space Flight Center, Building 2, CODE 696, Greenbelt, MD 20771, USA\n5Department of Communications Systems, Lancaster University, Lancaster. LA1 4YR, UK\nReceived: 21 February 2002 – Revised: 20 June 2002 – Accepted: 2 July 2002\nAbstract. Attempting to derive the field-aligned current\n(FAC) density using the EISCAT radar and to understand the\nrole of the ionosphere on closing FACs, we conducted spe-\ncial radar experiments with the EISCAT radar on 9 October\n1999. In order to derive the gradient of the ionospheric con-\nductivity (grad6) and the divergence of the electric field (div\nE) nearly simultaneously, a special experiment employed an\nEISCAT radar mode which let the transmitting antenna se-\nquentially point to four directions within 10 min; two pairs\nof the four directions formed two orthogonal diagonals of a\nsquare.\nOur analysis of the EISCAT radar data disclosed that 6P\ndiv E and E · grad6P produced FACs with the same di-\nrection inside a stable broad arc around 05:00 MLT, when\nthe EISCAT radar presumably crossed the boundary between\nthe large-scale upward and downward current regions. In the\nmost successfully observed case, in which the conductances\nand the electric field were spatially varying with little tempo-\nral variations, the contribution of 6P div E was nearly twice\nas large as that of E · grad6P . On the other hand, the con-\ntribution of (b×E) · grad6H was small and not effective in\nclosing FACs.\nThe present EISCAT radar mode along with auroral im-\nages also enables us to focus on the temporal or spatial varia-\ntion of high electric fields associated with auroral arcs. In the\npresent experiment, the electric field associated with a sta-\nble arc was confined in a spatially restricted region, within\n∼ 100 km from the arc, with no distinct depletion of elec-\ntron density. We also detected a region of the high arc-\nassociated electric field, accompanied by the depletion of\nelectron density above 110 km. Using auroral images, this\nregion was identified as a dark spot with a spatial scale of\nover 150× 150 km. The dark spot and the electron depletion\nwere likely in existence for a limited time of a few minutes.\nCorrespondence to: M. Sugino\n(msugino@stelab.nagoya-u.ac.jp)\nKey words. Ionosphere (auroral ionosphere; electric fields\nand currents; particle precipitation)\n1 Introduction\nThe field-aligned current (FAC) plays a crucial role in the\ntransfer of momentum and energy between the solar wind,\nthe magnetosphere, and the ionosphere. Satellite observa-\ntions have revealed its global distribution (e.g. Iijima and\nPotemra, 1976) and have also enabled us to determine the\ngeneration mechanisms of FACs in the magnetosphere (see\na review by Iijima, 2000). On the other hand, observa-\ntions from the ground, especially using incoherent scatter\n(IS) radars, can provide the temporal and spatial variations\nof ionospheric currents connecting FACs. If spatial distri-\nbutions of the ionospheric conductances and electric fields,\ni.e. the gradient of the ionospheric conductances and the\ndivergence of the electric fields, are known, then the FAC\ndensity is fully determined. In order to understand how the\nionospheric current is connected as a closure current to the\nFAC, ground-based observations covering a wide area of the\nionosphere are indispensable. Based on EISCAT radar ex-\nperiments, the aim of this study is to better understand the\nionospheric current closure of FACs and the relative contri-\nbution of the electric field and the ionospheric conductance\nto the FAC.\nSeveral studies have attempted to determine the charac-\nteristics of FACs deduced from ground measurements. Us-\ning a quiet-time model of the ionospheric conductance and\nmeasurements of the electric field by the IS radar at Mill-\nstone Hill, Yasuhara et al. (1982) estimated the global distri-\nbution of FACs on two quiet days. They suggested that the\nlarge-scale FACs were controlled mainly by the electric field\nand not as strongly by the ionospheric conductances. Us-\ning a real conductance measurement with the EISCAT radar\nin the meridian scanning mode, Caudal (1987) deduced the\n1336 M. Sugino et al.: Field-aligned currents and ionospheric parameters\nT\n \nromsø\nM\n \nagnetic field line\nG\n \neomagnetic\nEast\n1\n \n20 km\nE\n2\n \n40 km\nGe\n \nomagnetic\nNorth\nW\nN\nS\nFig. 1. An illustration of the idealized EISCAT radar mode. The\ntransmitting antenna is sequentially pointed to four positions. Ide-\nally, two pairs of the four directions would form the two orthogonal\ndiagonals of a square. In each of the four positions, the electric field\nin the F-region (240 km) is measured with three antennas, and the\nPedersen and Hall conductivities are determined along the Tromsø\nbeam.\ndistribution of FACs on a summer day, which was in gen-\neral agreement with that derived statistically by Iijima and\nPotemra (1976). Sorting by the geomagnetic activity index\nKp, Fontaine and Parmirat (1996) showed statistical distri-\nbutions of the horizontal currents and FACs that were based\non models of the large-scale convection (Senior et al., 1990)\nand conductance (Senior, 1991) derived statistically from ob-\nservations with the EISCAT radar.\nThese studies based on IS radar measurements are mainly\nconcerned with the large-scale global distribution of FACs.\nHowever, they employed meridian scanning modes, and the\nEarth’s rotation was utilized for obtaining longitudinal dis-\ntributions. Thus, the global distribution obtained can be jus-\ntified only when it has negligibly small temporal variations.\nIn order to understand more accurately how the FAC is con-\nnected to its closure current and the relative contribution of\nionospheric parameters to the FAC, a two-dimensional mea-\nsurement within the time scale of the variations is essential.\nAlso, differences in the Pedersen and Hall current contribu-\ntions to FACs are of great interest.\nBased on an algorithm by Amm (1998), Kosch et al. (2000,\n2001) showed the FAC distribution of a plasma flow vortex\nassociated with the brightening of an auroral arc. They il-\nlustrated that the downward current region resulted mostly\nfrom diverging horizontal Pedersen currents. Assuming a\nHall-to-Pedersen conductance ratio, they estimated conduc-\ntances from the Scandinavian Magnetometer Array (SMA)\n(Ku¨ppers et al., 1979) and Scandinavian Twin Auroral Radar\nExperiment (STARE) (Greenwald et al., 1978) data. Al-\nthough STARE is a powerful tool to obtain two-dimensional\nmaps of the electric field, it can provide reliable ionospheric\nelectric fields only when they exceed 15 mV\/m (Cahill et al.,\n1978). As shown by several studies, the conductance and the\nelectric field closely interact with each other (e.g. de la Beau-\njardie`re et al., 1981; Baumjohann, 1983; Marklund, 1984).\nHence, it is indispensable to measure these parameters si-\nmultaneously and precisely for a better understanding of the\nthree-dimensional current systems.\nA merit of using the EISCAT radar is that we can accu-\nrately measure temporal and spatial variations of both the\nconductance and the electric field. In order to determine\nhow the ionospheric current is connected to the FAC quan-\ntitatively, we made a special experiment with the EISCAT\nradar on 9 October 1999. Since the proposed method to de-\ntermine the FAC must be validated as to whether it provides a\nmeaningful current density or direction, a comparison study\nbased on simultaneous observations with other instruments\nis important. We present a comparative study using simulta-\nneous observations, such as auroral images and satellite data.\nAn enhancement of the ionospheric electron density or the\nPedersen conductivity is generally seen in an upward FAC re-\ngion due to auroral precipitation. The paired downward FAC\nis expected to require a larger ionospheric electric field than\nthe upward FAC, to close the ionospheric current connect-\ning different Pedersen conductivity regions. Low-altitude\nsatellite observations show that some kind of upward FACs\nwith intense precipitation are associated with smaller elec-\ntric fields; sometimes the electric field appears to be even\nshort-circuited (e.g. Hoffman, 1989). This relatively small\nelectric field is usually considered to be the combination of\nthe magnetospheric electric field and the polarization electric\nfield produced by the charge accumulation due to the inho-\nmogeneity of the ionospheric conductivity (e.g. Baumjohann\net al., 1983). It should be emphasized that the polarization\nelectric field, arising from the density inhomogeneity in the\npolar ionosphere, can drive FACs of ionospheric origin. The\npolarization electric field can play a role in the re-distribution\nof the electric field and hence, the modification of the current\nsystems (e.g. Lysak, 1990). Although the development of\nthe polarization electric field is discussed theoretically, it has\nnot been well understood observationally. Thus, the investi-\ngation of the electric fields associated with auroral arcs also\nenables us to understand how ionospheric closure currents\nand FACs are distributed around auroral arcs.\nM. Sugino et al.: Field-aligned currents and ionospheric parameters 1337\n1\n3\n2\n \n (Tromsø)\nMagnetic field-aligned line\nof Tromsø at 240 km\n5\n7\n6\n8\n5\n \n0km\n5\n \n0km 5\n \n0km 5\n \n0km5\n \n0km\n5\n \n0km\n5\n \n0km5\n \n0km (\n \nTromsø)\n4\nN\nS\nEW\nFig. 2. Beam positions at 240 km height in the mode employed, taking into account the Earth’s rotational effect. The spatial scale for electric\nfield measurements at 240 km height is 100 km in the first set of beams (1–2–3–4), and 50 km in the second set (5–6–7–8). The spatial scale\nfor the conductance measurement becomes 50 (25) km in the first (second) set.\nKosch et al. (2000) showed the region of diverging iono-\nspheric electric fields associated with a sudden brightening\nof the arc. They suggested that the region corresponded to\na downward FAC and black auroras; however, no black au-\nroras could be identified in their all-sky TV data, owing to\nits limited resolution. Using an all-sky camera and the EIS-\nCAT radar, Lewis et al. (1994) revealed the presence of a\nband of enhanced electric field on only one side of a drifting\nauroral arc, but its development was not detected by all-sky\ncamera images. Although several studies have reported the\ncharacteristics of a region with an enhanced electric field, its\ntemporal development is still not clear. Based on both EIS-\nCAT radar measurements and auroral images, we also focus\non the temporal or spatial variation of the region with high\nelectric fields associated with auroral arcs.\n2 EISCAT radar mode employed\nIn this study we have used the tristatic European Incoher-\nent Scatter (EISCAT) radar, the so-called Kiruna-Sodankyla¨-\nTromsø (KST) UHF radar system (Folkestad et al., 1983;\nRishbeth and Williams, 1985). Scattered signals from the\nradar beam transmitted at Tromsø (69.6◦ N, 19.2◦ E, 66.2◦\ninvariant latitude) are received at three stations; Tromsø it-\nself, Kiruna, and Sodankyla¨, and thus, the three-dimensional\nion velocity can be calculated. The electric field (E) can\nbe determined from the three-dimensional ion velocity at an\naltitude (240 km in our mode) in the F-region, where ions\nmove by E × B drift, since the ion gyrofrequency is much\ngreater than the ion-neutral collision frequency here. The\nmagnetic field (B) is derived from the International Geomag-\nnetic Reference Field (IGRF) model (Barton, 1997). Along\nthe Tromsø beams, EISCAT radar measurements also pro-\nvide the electron density and ion\/electron temperatures with\na height resolution of about 3 km in the E-region, and of\nabout 20 km in the F-region. Thus, the Pedersen and Hall\nconductivities (σP and σH ) can be calculated using formulas\nby Brekke and Hall (1988) and the MSISE-90 neutral atmo-\nspheric model (Hedin, 1991). The Pedersen and Hall con-\nductances (6P and 6H ) are calculated by integrating them\nover the height range from 90 to 300 km. The adoption\nof the lower height limit of 90 km may be justified, except\nunder extremely energetic precipitation, which could pro-\nduce as much as 15% of the Hall conductance below 90 km\n(Schlegel, 1988). From these ionospheric parameters we can\nderive the ionospheric current (J ) as,\nJ = JP + JH = 6PE +6H (b ×E) , (1)\nwhere JP and JH are the height-integrated Pedersen and\nHall currents, respectively, and b is the unit vector in the di-\nrection of the Earth’s magnetic field. The experiment also\nenables us to determine the relative contribution of the gradi-\nent of the ionospheric conductance and the divergence of the\nelectric field to the FAC density j‖ (positive away from the\nionosphere) in the following way,\n−j‖ = divJ = 6P divE +E · grad6P\n+(b ×E) · grad6H +6Hdiv (b ×E) . (2)\nEach of these terms depends on both the electric field and\nthe conductance. The first term depends on the divergence of\nthe electric field, and is called the term of “magnetospheric\norigin FAC” (e.g. Sofko et al., 1995). The second and third\nterms, called the terms of “ionospheric origin FAC”, depend\non the gradient of Pedersen and Hall conductances, respec-\ntively. Since our method assumes that the ionospheric elec-\ntric field is a curl-free potential electric field (rot E = 0), the\nlast term should be zero.\nIn order to derive the gradient of the ionospheric conduc-\ntance and divergence of the electric field, we conducted a\nspecial experiment using the EISCAT radar. Figure 1 is an il-\nlustration of the idealized EISCAT radar mode. The transmit-\nting antenna is sequentially pointed to four positions, similar\n1338 M. Sugino et al.: Field-aligned currents and ionospheric parameters\n50\n0 \nnT\n20 21 22 23 00 01 02 03\n-1000\n-800\n-600\n-400\n-200\n0\n200\n400\nY\nX\nZ\n20 21 22 23 00 01 02 03\nUT (hour)\n(a) (c)(b) (d)(e)\nAU \nAL \n [nT]\nFig. 3. Ground-based magnetometer data at Tromsø (upper) and the\nAU − AL index (lower) during our experiment.\nto CP-2 mode (see e.g. Collis, 1995). Ideally, two pairs of the\nfour directions would form the two orthogonal diagonals of a\nsquare, as illustrated in Fig. 1. In each of the four positions,\nthe electric field in the F-region (240 km) is measured with\nthe three antennas, and the Pedersen and Hall conductivities\nare determined along the Tromsø beam.\nThe Earth rotates once a day under the ionosphere with the\nrotation speed of about 10 km\/min at Tromsø (69.6◦ N). Tak-\ning into account this rotational effect, we designed our radar\nmode to make the four beam positions form a square in the\nionosphere, where the patterns of the electric field (equiva-\nlently the plasma convection) and precipitation (the auroral\noval) do not move with the Earth’s rotation, but rather are\nfixed in the Sun-Earth coordinates. Figure 2 illustrates the\nbeam positions at 240 km height in our special radar mode\nemployed. It is noted that the transmitting antenna is di-\nrected nearly along the geomagnetic field in the beam po-\nsition 4. Also, beam 2 points vertically upward. When the\ntransmitting antenna is not directed along the magnetic field\nline at Tromsø , the measurements in the E- (conductances)\nand F- (electric fields) regions are not on the same magnetic\nfield line. However, this may not be a serious problem if the\nelectric field and the ionospheric conductances are linearly\nvarying in the square region concerned, which is implicitly\nassumed in this method.\nWhat we are able to derive is, for example, the divergence\nof the electric field with the spatial scale approximately the\nsame as, or larger than, the spatial size of the square ob-\nserving region. Contributions from smaller scale variations\ncannot be taken into account. In our radar mode we alter-\nnately measured two sets of the four beam directions, in or-\nder to investigate the distributions of the parameters in dif-\nferent spatial scales. As shown in Fig. 2, the spatial scale\nfor electric field measurements at 240 km height is 100 km in\nthe first set of beam positions (1–2–3–4), and 50 km in the\nsecond set (5–6–7–8). The height-dependent Pedersen con-\nductivity is typically largest around 120 km in height. Hence,\nthe adopted spatial scale for the conductance measurement\nbecomes 50 km in the first set and 25 km in the second set.\nThe time resolution of the post-integrated parameters is about\n2 min. To complete one antenna cycle consisting of four posi-\ntions requires 10 min, which may allow us, under some con-\nditions, to assume that the measured distribution is a spatial\ndistribution without temporal variations.\n3 Observations\nWe conducted our experiment with the EISCAT radar from\n20:30 UT on 9 October to 02:30 UT on 10 October 1999.\nFigure 3 shows the ground-based magnetometer data at\nTromsø (upper panel) andAU−AL index (lower panel) dur-\ning this experiment. A relatively quiet period can be seen,\nexcept from 21:00–24:00 UT, when disturbances due to sub-\nstorms are identified. The geomagnetic disturbance level is\nKp = 3− (18:00–21:00 UT on 9 October, 00:00-03:00 UT\non 10 October) and Kp = 3 (21:00–24:00 UT on 9 October).\nSince our method to calculate a FAC density assumes lit-\ntle temporal variations within 10 min, we selected suitable\ntime periods from the whole experiment interval by checking\nthe digital all-sky imager (DASI) data (Kosch et al., 1998a).\nFigure 4 shows all-sky images of the selected events we\nwill present later. Little temporal variations are seen, ex-\ncept in case (a). The all-sky camera is located at 69.3◦ N,\n20.4◦ E, about 50 km from the EISCAT transmitter. The\nspatial coverage is 67.6–72.6◦ N, 13.5–26.0◦ E geographic\n(about 520 × 520 km) with 10 × 10 km resolution. The co-\nordinates used here are positions mapped to a 100 km alti-\ntude. The intensity is calibrated in Rayleighs for 557.7 nm.\nThe observation starting time (UT) and beam position cor-\nresponding to numbers (1–8) in Fig. 2 are noted in the top\nof each image of Fig. 4. The white dot near the center of\neach image is the position of the EISCAT radar beam (not\nradar site) at 100 km altitude. Thus, the white dot shows\nthe point where the ionospheric conductance is precisely ob-\nserved, and it shifts sequentially along with the beam scan-\nM. Sugino et al.: Field-aligned currents and ionospheric parameters 1339\n22:50:00 (1) 22:52:30 (2) 22:55:00 (3) 22:57:30 (4)\n\nC\u000b\n00:10:00 (1) 00:12:30 (2) 00:15:00 (3) 00:17:30 (4)\n00:30:00 (1) 00:32:30 (2) 00:35:00 (3) 00:37:30 (4)\n\nD\u000b\n\nE\u000b\n01:50:00 (1) 01:52:30 (2) 01:55:00 (3) 01:57:30 (4)\n02:00:00 (5) 02:02:30 (6) 02:05:00 (7) 02:07:30 (8)\n\nF\u000b\n\nG\u000b\nFig. 4. All-sky images of the selected events. The spatial coverage is 67.6–72.6◦ N, 13.5–26.0◦ E geographic (about 520 × 520 km) at\n10 × 10 km resolution. Mapping is for 100 km altitude. The intensity is calibrated in Rayleighs for 557.7 nm. The white dot near the\ncenter of each image is the position of the EISCAT radar beam at 100 km altitude. The observation starting time (UT) and beam position\ncorresponding to numbers (1–8) are noted in the top of each image. The dark triangle in the top right corner of every image is the mountain\nnear Skibotn, Norway.\n1340 M. Sugino et al.: Field-aligned currents and ionospheric parameters\nS\nN\nW E\n(a) 2250 - 2300\n8.4\n13.6\n9.4\n11.6\n9.5\n11.3\n3.9\n7.1\n(b) 0010 - 0020\n11.5\n15.1\n9.0\n11.9\n8.0\n11.0\n9.1\n11.9\n(c) 0030 - 0040\n8.0\n8.9\n10.8\n11.6\n7.8\n8.4\n8.2\n9.4\n(d) 0150 - 0200\n13.6\n18.1\n9.7\n12.8\n12.8\n17.6\n13.9\n20.4\n(e) 0200 - 0210\n13.0\n16.7\n15.1\n20.4\n13.9\n19.7\n14.8\n19.8\nFig. 5. Spatial variations of the con-\nductance and the electric field observed\nwith the EISCAT radar. Each position\nof the quadrilateral corresponds to the\nfour beam positions, respectively; bot-\ntom (south, beam 1 or 5), top (north,\nbeam 2 or 6), left (west, beam 3 or 7),\nand right (east, beam 4 or 8). Each thick\nline indicates the strength and direction\nof the electric field. The Pedersen (up-\nper) and Hall (lower) conductances are\ndenoted in the unit of S.\nS\nN\nW E\n1000(mA\/m)\nJ\nP\n(mA\/m)\nJ\nH\n(mA\/m)\n(a) 2250 - 2300\n260\n425\n370\n458\n405\n483\n313\n562\n(b) 0010 - 0020\n70\n92\n35\n47\n220\n303\n105\n137\n(c) 0030 - 0040\n52\n58\n41\n44\n150\n161\n147\n168\n(d) 0150 - 0200\n212\n283\n217\n285\n178\n243\n280\n409\n(e) 0200 - 0210\n92\n118\n136\n183\n71\n101\n111\n149\nFig. 6. Spatial variations of the cal-\nculated height-integrated Pedersen and\nHall currents, assuming that both of the\nconductance and the electric field are\nmeasured on the same magnetic field\nline. Each thick (thin) line indicates the\nstrength and direction of the Pedersen\n(Hall) current.\nning. The dark triangle in the top right corner on each image\nis a mountain near Skibotn, Norway.\nFigure 5 shows spatial variations of the conductance and\nthe electric field observed with the EISCAT radar in the se-\nlected cases corresponding to Fig. 4. Each position of a\nquadrilateral corresponds to the four beam positions, respec-\ntively; bottom (south, beam 1 or 5), top (north, beam 2 or 6),\nleft (west, beam 3 or 7), and right (east, beam 4 or 8). Each\nthick line denotes the strength and direction of the electric\nfield. The Pedersen (upper) and Hall (lower) conductances\nare also denoted in the unit of S. Note that, except for the\nbeam 4, the measurements of conductances and electric fields\nare not on the same magnetic field line. Using an approxima-\ntion that both the conductance and electric field are measured\non the same magnetic field line, we present spatial variations\nof the calculated height-integrated Pedersen (JP ) and Hall\n(JH ) currents in Fig. 6. Each thick (thin) line indicates the\nstrength and direction of the Pedersen (Hall) current.\nFigure 7 presents the calculated FAC density using the for-\nmula (2). Each term (except the last term) of the formula\n(2) and the total FAC density are plotted. Also, northward\nand eastward components of 6P div E and E · grad6P are\nshown. A positive value means an upward current density.\nIn order to examine how temporally stable the ionospheric\nparameters are, rot E is also plotted. Ideally, rot E becomes\nzero. The greater the amplitude of rot E is, the less valid our\nassumption becomes.\n4 Results\nIn case (a), during 22:50–23:00 UT, a lot of temporal varia-\ntions are seen in the aurora camera, as depicted in the top four\npanels of Fig. 4. At first, we will present the cases in which\nM. Sugino et al.: Field-aligned currents and ionospheric parameters 1341\n ( a) (b) ( c) ( d) (e)  \n-4\n-2\n0\n2\n4\n \n[10-6A\/m2]\n ( a) (b) ( c) ( d) (e)  \n-4\n-2\n0\n2\n4\n \n[10-6A\/m2]\n ( a) (b) ( c) ( d) (e)  \n-4\n-2\n0\n2\n4\n \n[10-6A\/m2]\n ( a) (b) ( c) ( d) (e)  \n-4\n-2\n0\n2\n4\n \n[10-6A\/m2]\n ( a) (b) ( c) ( d) (e)  \n-4\n-2\n0\n2\n4\n \n[10-6A\/m2]\n ( a) (b) ( c) ( d) (e)  \n-4\n-2\n0\n2\n4\n \n[10-6A\/m2]\n ( a) (b) ( c) ( d) (e)  \n-4\n-2\n0\n2\n4\n \n[10-6A\/m2]\n ( a) (b) ( c) ( d) (e)  \n-4\n-2\n0\n2\n4\n \n[10-6A\/m2]\n(a) (b) (c) (d) (e)\n-0.4\n-0.2\n0.0\n0.2\n0.4\n \n[10-6V\/m2]\nFig. 7. Calculated FAC densities de-\nduced from EISCAT radar measure-\nments. Each term (except the last term)\nof the formula (2), the total FAC den-\nsity, and rot E are plotted. Also, north-\nward and eastward components of 6P\ndiv E and E · grad6P are plotted. A\npositive value means an upward current\ndensity.\nthe ionosphere is relatively stable, and then discuss the case\n(a).\n4.1 Cases (b) 00:10-00:20 UT and (c) 00:30-00:40 UT on\n10 October 1999\nThe EISCAT radar observed a region around a relatively\nsmall-scale auroral arc. Both the ground-based magnetome-\nter data in Fig. 3 and auroral images in Figs. 4b and c indicate\nthat temporal variations are small during these time periods.\nDuring 00:10–00:20 UT in Fig. 5b, the conductance in the\nsouth position is larger than that in the other three positions,\nwith a small electric field. An anti-correlation between the\nconductance and the electric field strength is seen. This has\nbeen reported as one of the common features of auroral arcs\n(e.g. Baumjohann, 1983; Marklund, 1984). Figure 4b con-\nfirms that the arc is located at the southward position of the\nlarger square formed by the four beam directions. While the\nelectric field in the north position is also small, with a low\nconductance, however, this seems due to the large distance\nbetween the north position and the arc (100 km at 240 km al-\ntitude). This small electric field in the north position implies\nthat the background convection electric field is also small.\nOn the other hand, in the vicinity neighboring the arc, the\nelectric field is enhanced with a low conductance in the east\nand west positions.\nDuring 00:30–00:40 UT in Fig. 5c, a conductance en-\nhancement can be seen in the north position with a small\nelectric field. Figure 4c depicts a narrow arc similar to that\nshown in Fig. 4b, however, the arc is located in the north of\nthe region measured with the EISCAT radar. Also, in the\nvicinity of the arc, enhancements of the electric field can be\nseen.\nIn summary, during these periods, the relatively high elec-\ntric field associated with the narrow arc is confined to a spa-\ntially restricted region, within 100 km from the arc. This\narc-associated electric field is rather stable. In Fig. 7 for\ncases (b) and (c), 6P div E produces an upward FAC, while\nE · grad6P produces the opposite direction of the FAC.\n4.2 Cases (d) 01:50-02:00 UT and (e) 02:00-02:10 UT on\n10 October 1999\nThe EISCAT radar surveyed a region around a broad auroral\nband. Both ground-based magnetometer data at Tromsø in\nFig. 3 and auroral images in Figs. 4d and e suggest that the\n1342 M. Sugino et al.: Field-aligned currents and ionospheric parameters\nFig. 8. Magnetic field measurements\nobtained by the flux-gate magnetome-\nter carried on the Ørsted satellite. Bx ,\nBy , Bz and B are shown after sub-\ntraction of the preliminary Ørsted main\nfield model, where X is positive geo-\ngraphic north, Y is positive east, Z is\npositive down, and B is the total mag-\nnetic field strength. The closest position\nof the EISCAT radar is indicated by the\nstar.\ntemporal variation is also small during these periods. The\nthickness of the auroral arc is larger compared with the arc\nseen in the previous cases (b) and (c), and its border is not\nso well defined. The AU − AL index in Fig. 3 suggests that\nthese cases are during what appears to be a prolonged growth\nphase of a minor substorm.\nDuring 01:50–02:00 UT, the conductances in the south and\neast positions are larger than those in the other two positions\nin Fig. 5d. The electric field is also not small with high con-\nductances. This feature is different from that in the previous\ncases, which showed an anti-correlation between the conduc-\ntance and the electric field. Figure 4d suggests that the EIS-\nCAT radar sounded a region northwestward of the broad arc.\nOn the other hand, during 02:00–02:10 UT, the conduc-\ntivity is high and has the maximum in the north position in\nFig. 5e. The electric field is small on each of the four po-\nsitions, suggesting that the EISCAT radar sounded a region\ninside of the broad arc. This is confirmed by the auroral im-\nages in Fig. 4e. It is noted that, in case (e), the EISCAT radar\nmeasured a smaller square region formed by the beam posi-\ntions 5–8.\nAs shown in Fig. 7, for cases (d) and (e), a downward FAC\nappears in the north of the arc during 01:50–02:00 UT, and an\nupward FAC inside the arc during 02:00–02:10 UT. In cases\n(d) and (e), both 6P divE andE ·grad6P produce the same\ndirection FAC. On the other hand, (b×E) · grad6H is small\nand not effective in closing the FAC. Hence, the divergence\nof the electric field and the gradient of the Pedersen conduc-\ntance play a significant role in closing the FAC through the\nionosphere.\nIn Fig. 5, except in case (a), one notices that all of the\nstable arcs have a conductivity gradient in the east-west di-\nrection and that the conductivity in the east position is higher\nthan that in the west position in each case. Also in Fig. 4, the\nstable arcs are brighter toward the east. From the viewpoint\nof the current closure in the ionosphere, however, the conduc-\ntivity gradient in the north-south direction plays a more cru-\ncial role than that in the east-west direction, since the north-\nsouth component of the electric field is generally larger than\nthe east-west component, as seen in Fig. 5. Hence, the term\nE · grad6P is highly dependent on the north-south gradi-\nent of the ionospheric Pedersen conductivity. While the term\n(b×E)·grad6H depends mainly on the east-west gradient of\nthe ionospheric Hall conductivity, this gradient is not so large\nM. Sugino et al.: Field-aligned currents and ionospheric parameters 1343\n22:56:00                22:57:00                 22:58:00                22:59:00\n23:00:00                23:01:00                 23:02:00                23:03:00\nFig. 9. All-sky images with a time resolution of 1 min, around the time when a dark spot was observed.\ncompared with the north-south gradient of the Pedersen con-\nductivity, as shown in Fig. 5e. Thus, the FACs close through\nthe Pedersen current rather than through the Hall current in\nthe ionosphere in this specific case.\n4.3 Case (a) 22:50-23:00 UT on 9 October 1999\nDuring this time period, the Ørsted satellite passed over the\nEISCAT radar at 22:54 UT. The magnetic field measurements\nobtained from the fluxgate magnetometer carried on board\nthe Ørsted satellite are shown in Fig. 8. Bx , By , Bz and\nB are magnetic fields after subtraction of the Earth’s main\nfields from the observed magnetic fields, where X is geo-\ngraphic north, Y is east, Z is down, and B is the total mag-\nnetic field strength, B = (B2x +B2y +B2z )1\/2. Notice that the\nlargest perturbations are seen in the Y -direction, indicating\nthat the Ørsted trajectory is nearly perpendicular to the FAC\nsheets. The Ørsted observation indicates that a large-scale\ndownward FAC region is located between about 72.6◦ N and\n69.0◦ N, while an upward FAC region is located between\nabout 69.0◦ N and 63.5◦ N. The nearest position to the EIS-\nCAT radar (indicated by the star in Fig. 8) is located at the\nseparation between the two large-scale current sheets. When\nthe Earth rotates and a substorm evolves, the EISCAT radar\nappears to be shifted back and forth between the two FAC re-\ngions. In the vicinity of the EISCAT radar, the Ørsted satel-\nlite observes many small-scale FACs within the large-scale\nFACs. This is a common feature of an auroral substorm dur-\ning this MLT (e.g. Fujii et al., 1994). The AU − AL index\nin Fig. 3 also suggests that this case (a) is during the late\nrecovery phase of a substorm.\nSeveral temporal variations are seen in the auroral images,\nas depicted in Fig. 4a. Especially in the east position (22:58–\n23:00 UT), the auroral image shows a dark spot adjacent to\na narrow bright arc. Correspondingly, the EISCAT radar de-\ntects a very high electric field (∼ 80 mV\/m) and low conduc-\ntances in this position, as exhibited in Fig. 5a. This elec-\ntric field seems unstable and different from the arc-associated\nelectric fields, as shown in cases (b) and (c), which are rather\nstable. We have selected this case (a) because a noteworthy\ndark spot was detected. It should be noted that the FAC cal-\nculated from the four position measurements with the EIS-\nCAT radar is probably not accurate because this case vio-\nlates the necessary assumption of no temporal variation over\n10 min. This is confirmed by the calculation of rot E, which\nis much larger than in the other cases shown in Fig. 7.\nWith a time resolution of 1 min, Fig. 9 depicts the de-\ntailed temporal variation of the dark spot around the observed\ntime. The dark spot is clearly identified only during 22:58–\n2:300 UT, drifting eastward slowly. Simultaneously, a nar-\nrow bright arc appears southward of the dark spot. Also south\nof the arc, a narrow dark region can be seen during 22:58–\n22:59 UT. We observed another dark spot around 21:46 UT\n(not shown here) also lasting for a limited time of a few min-\nutes.\nFigure 10 shows EISCAT radar measurements of the\nheight distribution of the Pedersen (thick line) or Hall (thin\nline) conductivity and the electron density. During 22:58–\n23:00 UT, the EISCAT radar sounded inside of the dark spot,\nas shown in Fig. 4a, with the field-aligned beam position 4.\nThe low conductances and the enhanced electric field can be\nseen. The electric field is directed to the narrow arc, and\nthus, the Pedersen current also flows from the dark spot to-\nward the arc. Above 110 km altitude, the electron density is\ndepleted. The measurements at several altitudes are missing\ndue to weak backscatters from low electron densities with\nrelatively large errors (as denoted by the crosses in Fig. 10).\nSuch a depletion especially leads to a reduction of the Ped-\n1344 M. Sugino et al.: Field-aligned currents and ionospheric parameters\nersen conductivity, since it has a maximum around 120 km\naltitude. As seen in Fig. 4a, the beam position 4 is south of\nthe darkest area in the dark spot, where the maximum de-\npletion of electron density occurs and thus, the more intense\ndownward FAC are expected.\n5 Discussion\n5.1 Stable narrow arc\nIn cases (b) and (c), the stable electric field associated with\nthe narrow arc is confined to a spatially restricted region,\nwithin∼ 100 km from the arc. Based on radar measurements,\na number of studies have reported features of arc-associated\nelectric fields. Aikio et al. (1993) showed that the width\nof an arc-associated electric field was estimated to be less\nthan, or equal to, 45 km. Opgenoorth et al. (1990) suggested\nthat the width of very high perpendicular electric fields, as-\nsociated with a reduced electron density, was estimated to\nbe of the order of the arc width (about 20 km). Lewis et\nal. (1994) estimated the horizontal extent of the electric field\nto be about 40 km. It is also noted that the arc-associated\nelectric field shown by Opgenoorth et al. (1990) or Lewis\net al. (1994) accompanies a reduction of the electron den-\nsity, while our observed arc-associated electric field in cases\n(b) and (c) is not accompanied with such a strong reduction.\nPast studies showed that the arc-associated electric field was\nobserved only on one side of the narrow arc. Baumjohann\n(1983) has explained that the ambient electric field is north-\nward (southward) directed in the evening (morning) sector\nand thus, the arc-associated meridional electric field must be\nanti-symmetric with respect to the southern (northern) bor-\nder of the arc, being northward (southward) directed in a\nregion a few kilometers south (north) of the arc and south-\nward (northward) inside the arc. However, our observation in\ncases (b) and (c) exhibits the arc-associated electric field on\nboth the northward and southward sides outside the narrow\narc. On both sides, the arc-associated electric field directs\ntowards the narrow arc in a spatially restricted region. This\nfeature is rather similar to that of the event shown by Burch et\nal. (1976), who determined the characteristics of pairs of op-\npositely directed spikes in ionospheric convection velocities\nusing data from AE-C spacecraft. Their convection velocities\nare associated with the inverted-V type auroral electron pre-\ncipitation. They suggested that the relationship between the\nelectron precipitation and the electric field spikes was consis-\ntent with an upward-flowing FAC that was fed by Pedersen\ncurrents from the adjacent regions of strong convection.\nIn Fig. 7, for cases (b) and (c), 6P div E produces an\nupward FAC, while E · grad6P produces an opposed down-\nward FAC. Sato et al. (1995) have reported a similar situ-\nation at the equatorward edge of the large-scale downward\nregion 1 current. A small rot E in Fig. 7 for cases (b) and\n(c) shows that the temporal variation is small. However, it\nis suspected that the region observed with the EISCAT radar\nincludes both upward and downward FAC regions in these\ncases. As described by Marklund (1984), if a transverse\nheight-integrated current has a difference between two ob-\nserved positions, there is a FAC between the two. For ex-\nample, in Fig. 6c, the Pedersen current in the west or east\nposition is larger (∼ 150 mA\/m) than that in the south or\nnorth position (∼ 50 mA\/m). This implies that a northwest-\nward Pedersen current (∼ 150 mA\/m) flows in the center of\nthe four observed positions. Thus, it is expected that FACs\nflow upward in the northern half of the four positions, and\ndownward in the southern half. Similarly in Fig. 6b, a south-\neastward Pedersen current is expected to flow in the center of\nthe four positions, with an upward FAC in the northern half\nand a downward FAC in the southern half. Thus, we con-\nclude that the spatial scale of the region observed with the\nEISCAT radar was too large in comparison to the spatial cur-\nrent structure, in order to apply formula (2) reliably for cases\n(b) and (c). In these cases, we cannot confirm whether 6P\ndiv E and E · grad6P really produce FACs with opposing\ndirections, as reported by Sato et al. (1995).\n5.2 Stable broad arc\nAs shown in Fig. 7, for cases (d) and (e), a downward\nFAC is inferred to exist north of the arc, and an upward\nFAC inside the broad arc. In cases (d) and (e), both 6P\ndiv E and E · grad6P produce the same direction FAC.\nOnly in the north-south direction, in case (e), 6P div E and\nE·grad6P produce FACs with opposing directions, in agree-\nment with the result by Sato et al. (1995). On the other hand,\n(b × E) · grad6H is small and not effective in closing the\nFAC.\nIn Fig. 4e, the aurora moves slightly westward with the\npassage of time, keeping its form, and is favorable for our\nradar mode, taking into account the Earth’s rotational effect.\nAlso in case (e), the area scanned by the beam positions 5–\n8 is small (see Fig. 2) and the calculated rot E is extremely\nsmall (see Fig. 7). Therefore, the situation in case (e) is the\nmost appropriate one out of all our cases, in order to calculate\na FAC using formula (2). The calculated FAC is also the most\nreliable in case (e) rather than that in any of the other cases.\nThe upward FAC density by 6P div E and E · grad6P are\n∼ 1.3 and ∼ 0.7µA\/m2, respectively, and thus the contribu-\ntion of6P divE is nearly twice as large as that ofE·grad6P\nin case (e).\nThese results are consistent with the results by Kosch et\nal. (2000) and Kosch and Nielsen (2001). However, they dis-\ncussed a plasma vortex associated with a black aurora, which\nseems similar to the dark spot shown in case (a). Our results\nare based on observations of the stable arc around 02:00 UT\n(∼ 05:00 MLT) in cases (d) and (e). We have also checked\nseveral auroral images and could find auroral forms with the\nsame features in the early morning on other days (not shown\nhere). Thus, the arc in cases (d) and (e) is considered to be\na common feature seen in the early morning. Unfortunately,\nthe electric fields in these cases are not very large, and thus,\nit is difficult for STARE to measure reliable electric fields\nM. Sugino et al.: Field-aligned currents and ionospheric parameters 1345\nElectric Field [mV\/m] \nConductance [S]\n[S\/m]\n \nConductivity\n[\/m3]\n \nElectron Density\n22\n55\n - \n22\n57\n \nbe\nam\n 3\nE north = -38\nE east = 18\nE = 42\nHall = 11.3\nPedersen = 9.5 10-8 10-7 10-6 10-5 10-4 10-3 10-2\n100\n120\n140\n160\n100\n120\n140\n160\n109 1010 1011 1012\n100\n120\n140\n160\n100\n120\n140\n160\nA\nlti\ntu\nde\n [k\nm\n]\n22\n58\n - \n23\n00\n \nbe\nam\n 4\nE north = -78\nE east = 10\nE = 79\nHall = 7.1\nPedersen = 3.9 10-8 10-7 10-6 10-5 10-4 10-3 10-2\n100\n120\n140\n160\n100\n120\n140\n160\n109 1010 1011 1012\n100\n120\n140\n160\n100\n120\n140\n160\nA\nlti\ntu\nde\n [k\nm\n]\n23\n00\n - \n23\n02\n \nbe\nam\n 5\nE north = -20\nE east = 8\nE = 22\nHall = 16.3\nPedersen = 16.3 10-8 10-7 10-6 10-5 10-4 10-3 10-2\n100\n120\n140\n160\n100\n120\n140\n160\n109 1010 1011 1012\n100\n120\n140\n160\n100\n120\n140\n160\nA\nlti\ntu\nde\n [k\nm\n]\nFig. 10. EISCAT radar measurements\nof the altitude profile of the Pedersen\n(thick line) and Hall (thin line) conduc-\ntivities and the electron density, around\nthe time when a dark spot was observed.\nand to deduce the FAC density, as demonstrated by Kosch et\nal. (2000).\nTwo major high-latitude FAC systems have been statisti-\ncally shown to exist (Iijima and Potemra, 1976). In the dawn\nsector, the poleward currents, denoted as region 1 currents,\nflow into the ionosphere, and the equatorward currents, de-\nnoted as region 2 currents, flow away from the ionosphere.\nThis distribution is consistent with our calculated FAC in\ncases (d) and (e), which is downward north of the stable\narc, and upward to the south. In Fig. 3, the ground mag-\nnetometer observation around 02:00 UT indicates 1Z ∼ 0,\nmeaning that the electrojet current center may be located\nnear Tromsø. In the morning sector, Senior et al. (1982) and\nSato et al. (1995) have inferred that the center of the west-\nward electrojet current is located near the region 1\/region 2\nFAC reversal. Thus, the ground magnetometer data showing\n1Z ∼ 0 are consistent with our calculated FAC distribution.\nThe estimated FAC densities (∼ 2µA\/m2) have the same or-\nder as the reported FAC densities by satellite observations\n(e.g. Iijima and Potemra, 1978; Fukunishi et al., 1993).\nIn Fig. 5, except in case (a), all of the stable arcs have a\nconductivity gradient in the east-west direction, and the con-\nductivity in the east position is higher than that in the west\nposition in each case. Also in Fig. 4, the stable arcs are\nbrighter towards the east. This indicates that particle precip-\nitation, which is effective in enhancing ionospheric conduc-\ntivities, should be greater going from midnight to the dawn\nside. As mentioned before, we see similar stable arcs in au-\nrora images on other days, and the stable arcs in Fig. 4 are\nthus considered to be a common feature around these MLTs.\nIn the ionosphere, the conductivity is well determined by\nthe precipitating electron energy and electron energy flux\n(e.g. Spiro et al., 1982; Robinson et al., 1987; Hardy et al.,\n1987). The conductivity gradient in the north-south direc-\ntion plays a crucial role in producing the FAC rather than\nthat in east-west direction, as mentioned before. On the\nother hand, in the magnetosphere, the plasma pressure is con-\ntributed mainly by hot ions (e.g. Spence et al., 1989). In the\nmagnetosphere, a pressure-gradient force on the plasma in\nthe equatorial plane plays a crucial role on FAC generation\n(e.g. Iijima, 2000).\n5.3 Narrow bright arc and dark spot\nIn case (a), we see a region with a very high electric field\nadjacent to a narrow bright arc. In the auroral images, this\nregion is identified as a dark spot. The region is estimated to\nhave a spatial dimension, over 150 × 150 km, that is much\nlarger than that reported for “black auroras” (see a brief re-\nview by Kosch et al., 1998b). This implies that our observed\n1346 M. Sugino et al.: Field-aligned currents and ionospheric parameters\ndark spot may be different from phenomena of black auro-\nras. According to the definition, the black aurora is a lack of\nemission in a small, well-defined region within an otherwise\nuniform, diffuse background or within auroras exhibiting a\ndegree of shear behavior intermediate between that of dif-\nfuse and discrete aurora (see Trondsen and Cogger, 1997).\nBlack auroras appear to be a common feature of the late re-\ncovery phase of an auroral substorm. Several high spatial\nand temporal resolution optical observations have identified\nblack auroras. Schoute-Vanneck et al. (1990) measured 40\nblack filaments to find a typical width of 1 km, and length of\n5–20 km. Trondsen and Cogger (1997) measured 31 black\nauroral patches and arc segments and found a typical width\nof 0.5–1.5 km.\nOn the other hand, the plasma vortex analyzed by Kosch\net al. (2000) has a spatial dimension, 200× 200 km, which is\nof the same order as our observed dark spot. If the dark spot\nis a similar feature of the plasma vortex shown by Kosch et\nal. (2000), a downward FAC is expected in the dark spot. In-\ndeed, our observed depletion of electron density over 110 km\naltitude implies that the dark spot occurs in the downward\nFAC, which carries ionospheric electrons into the magneto-\nsphere as a current carrier. As mentioned before, the po-\nsition observed by the beam 4 is on the south side of the\ndarkest point in the dark spot, where the greatest depletion of\nelectron density occurs and thus, the more intense downward\nFAC is expected. In the case analyzed by Kosch et al. (2000),\nthe strongest downward FAC in the center of the plasma vor-\ntex is also far from the bright arc (∼ 100 km).\nThere may be an alternative explanation for the electron\ndensity depletion within the dark spot. High electric fields\ncan alter the ion composition and also lead to an electron\ndensity decrease due to enhanced recombination. According\nto the result by Schunk et al. (1975), this decrease is seen\nmainly in the F-region, however, it is noted that the density\ndepletion we detected within the dark spot is seen also in the\nE-region (above 110 km).\nWhen the dark spot is identified, a narrow bright arc\nappears simultaneously south of the dark spot. Aikio et\nal. (1993) have reported the simultaneous intensification of\nthe arc-associated electric field and the optical brightening\nof the auroral arc. Due to the beam swing, the EISCAT radar\ncould observe both inside the dark spot and the narrow arc.\nDuring 23:00–23:02 UT, the EISCAT radar sounded inside\nthe narrow arc with the beam position 5. Both the Peder-\nsen and Hall conductances increase with a smaller electric\nfield. Moving from inside the dark spot to inside the narrow\narc, the height-integrated Pedersen current does not change\nmuch. In our case (a), the electric field points from the dark\nspot into the narrow arc; thus, one can conclude that the Ped-\nersen current is the closure current between the dark spot and\nthe narrow arc. Using the observed conductance and the elec-\ntric field, we can quantitatively estimate the height-integrated\nPedersen and Hall currents; 310 and 560 mA\/m inside the\ndark spot during 22:58–23:00 UT, and 360 and 360 mA\/m\ninside the narrow arc during 23:00–23:02 UT, respectively.\nThe difference in the Pedersen and Hall currents between the\ntwo regions is 50 and 200 mA\/m, respectively. It should be\nnoted, however, that these values have some ambiguity, be-\ncause there is a time lag between observations of the two re-\ngions. The dark spot became fainter when the EISCAT radar\nmeasured inside the narrow arc during 23:00–23:02 UT. This\nmay imply that the current morphology changes. Also, in-\nside the narrow arc, the conductivities and the electric field\nare not measured on the same magnetic field line by the beam\nposition 5. This may add an error to the calculated current in-\nside the arc. However, this difference in the Pedersen current\nis smaller than that of about 100 mA\/m in case (b).\n5.4 EISCAT radar mode employed and future\nThe neutral wind cannot be measured in our observations,\nand is neglected in the present analysis. In the ionosphere,\nthe electric field is the sum of the potential electric field (de-\nrived from the plasma motion in the F-region) and the neutral\ndynamo electric field U×B, where U is the neutral wind ve-\nlocity. The neutral wind velocity varies greatly with altitudes\nin the E-region (e.g. Nozawa and Brekke, 1995); thus, the\ndynamo electric fieldU×B is also highly altitude dependent.\nThe amplitude of the dynamo electric field occasionally be-\ncomes comparable to that of the potential electric field (Fujii\net al., 1998, 1999). Thus, especially in the case with tem-\nporal variations, we may not ignore the contribution of the\nneutral wind and the dynamo electric field. A more detailed\nanalysis considering the distribution of the neutral wind and\ndiv (E + U × B) will be needed for a better understanding.\nIt should be noted that the EISCAT radar data and the anal-\nysis inevitably include errors (see Fujii et al., 1998). Each\nmeasured parameter has an error at the time of the measure-\nment and the data processing. The errors of the ion veloc-\nity can provide uncertainties for the electric field, less than\n± 3 mV\/m for quiet periods and less than ± 6 mV\/m during\nhigh electric field conditions in our experiment. The average\nerror of the electron density is about ± 6% and can provide\nuncertainties for the conductivity. However, it is not possible\nto evaluate errors of the conductivity quantitatively. The dif-\nference between the real neutral atmosphere and the model\natmosphere used (MSISE-90) may also give significant er-\nrors to the ion-neutral or electron-neutral collision frequen-\ncies and thereby to the conductivities, but we do not have the\nmeans to estimate these uncertainties.\nIn the mode employed, the EISCAT radar alternately ob-\nserved at two different scales; 100 or 50 km at 240 km al-\ntitude. The smaller one is sufficient to detect differences in\nionospheric conductivities and electric fields, while the larger\none seems too large for several auroral features. Also, the\nconductance is determined across magnetic field lines when\nthe transmitting antenna is not directed along the magnetic\nfield line. For example, with the lowest elevation beam 1,\nthe horizontal scale is ∼ 2 km for the height range of 10 km.\nThis may also add an error to the calculated conductance, es-\npecially for the narrow arc. The smaller the spatial scale for\nmeasurements is, the smaller this error becomes.\nM. Sugino et al.: Field-aligned currents and ionospheric parameters 1347\nIn the future, using a mode in which the EISCAT radar\nsounds on a smaller spatial scale as quickly as possible, we\nwill investigate the closure of FACs also in the evening sec-\ntor. As illustrated by Senior et al. (1982), the distribution of\nauroral precipitation and electric fields in the evening sector\nis different from that in the morning sector investigated in\npresent study. Fujii et al. (1990) suggested that the conduc-\ntivity gradient controlled significantly the amplitude of the\nFAC density and that E · grad6P worked more effectively\nin comparison with 6P div E in the evening sector. The\nionospheric current intensity in the evening sector is char-\nacterized by a relatively strong electric field (e.g. Davies\nand Lester, 1999), and this situation is favorable for observa-\ntions with STARE, which can obtain the distribution of elec-\ntric fields in a wider area. The EISCAT radar is capable of\nproviding the conductivity information; thus, a simultaneous\nstudy with STARE and satellites will allow us not only to\nexamine the validity of our FAC derivation, but also to bet-\nter understand the ionospheric roles on the magnetosphere-\nionosphere coupling.\n6 Summary\nWe have conducted special experiments with the EISCAT\nradar on 9 October 1999, in an attempt to derive FACs from\nthe spatial distributions of ionospheric currents, in order to\nunderstand the ionospheric current closure of FACs. The re-\nsults are as follows:\n1. If the ionosphere is stable during the time periods con-\ncerned, rot E becomes relatively small and justifies our\napproximation.\n2. The electric field associated with a narrow arc was con-\nfined in a spatially restricted region, within ∼ 100 km\nfrom the arc, with no distinct depletion of electron den-\nsity. This electric field was directed towards the arc on\nboth the northward and southward sides.\n3. Inside a stable broad arc, 6P divE andE ·grad6P pro-\nduced FACs with the same direction around 05:00 MLT,\nwhen the EISCAT radar presumably crossed the bound-\nary between the large-scale upward and downward cur-\nrent regions. In the most successfully observed case, the\ncontribution of 6P div E is nearly twice as large as that\nof E · grad6P . On the other hand, the contribution of\n(b×E) ·grad6H was small and not effective in closing\nFACs.\n4. During the recovery phase of a substorm, a region of\nvery high electric field was observed adjacent to a nar-\nrow bright arc within the large-scale FACs. The Peder-\nsen current is the closure current across the narrow arc.\nIn the region of the very high electric field, the electron\ndensity is depleted above 110 km altitude. In the auro-\nral images, this region is identified as a dark spot with\na spatial scale of over 150 × 150 km. The dark spot\nand the electron depletion were likely in existence for a\nlimited time of a few minutes.\nAcknowledgements. We are indebted to the director and staff of\nEISCAT for operating the facility and supplying the data. EISCAT\nis an international association supported by Finland (SA), France\n(CNRS), the Federal Republic of Germany (MPG), Japan (NIPR),\nNorway (NFR), Sweden (NFR) and the United Kingdom (PPARC).\nThanks also to the staff of WDC-C2, Kyoto University for provid-\ning geomagnetic indices. The IMAGE data was kindly supplied by\nthe Auroral Observatory, University of Tromsø.\nTopical Editor M. Lester thanks U. P. Lovhaug and K. Schlegel\nfor their help in evaluating this paper.\nReferences\nAikio, A. T., Opgenoorth, H. J., Persson, M. A. L., and Kaila, K. U.:\nGround-based measurements of an arc-associated electric field,\nJ. Atmos. Terr. Phys., 55, 797–803, 1993.\nAmm, O.: Method of characteristics in spherical geometry applied\nto a Harang discontinuity situation, Ann. Geophysicae, 16, 413–\n424, 1998.\nBarton, C. E.: International geomagnetic reference field: The sev-\nenth generation, J. Geomag. Geoelectr., 49, 123–148, 1997.\nBaumjohann, W.: Ionospheric and field-aligned current systems in\nthe auroral zone: A concise review, Adv. Space. Res., 2, 55–62,\n1983.\nBrekke. A. and Hall, C.: Auroral ionospheric quiet summer time\nconductances, Ann. Geophysicae, 6, 361–376, 1988.\nBurch, J. L., Lennartsson, W., Hanson, W. B., Heelis, R. A., Hoff-\nman, J. H., and Hoffman, R. A.: Properties of spikelike shear\nflow reversals observed in the auroral plasma by Atmosphere Ex-\nplorer C, J. Geophys. Res., 81, 3886–3896, 1976.\nCahill, L. J., Greenwald, R. A., and Nielsen, E.: Auroral radar and\nrocket double-probe observations of the electric field across the\nHarang discontinuity, Geophys. Res. Lett., 5, 687–690, 1978.\nCaudal, G.: Field-aligned currents deduced from EISCAT radar ob-\nservations and implications concerning the mechanism that pro-\nduces region 2 currents, J. Geophys. Res., 92, 6000–6012, 1987.\nCollis, P. N.: EISCAT data base for ionospheric modelling: F-\nregion and topside ionosphere, Adv. Space. Res., 16, 37–46,\n1995.\nDavies. J. A. and Lester, M.: The relationship between electric\nfields, conductances and currents in the high-latitude ionosphere:\na statistical study using EISCAT data, Ann. Geophysicae, 17, 43–\n52, 1999.\nde la Beaujardie`re, O., Vondrak, R., Heelis, R., Hanson, W., and\nHoffman, R.: Auroral arc electrodynamic parameters measured\nAE-C and the Chatanika radar, J. Geophys. Res., 86, 4671–4685,\n1981.\nFolkestad, K., Hagfors, T.. and Westerlund, S.: EISCAT: An up-\ndated description of technical characteristics and operational ca-\npabilities, Radio Sci., 18, 867–879, 1983.\nFontaine, D. and Peymirat, C.: Large-scale distributions of iono-\nspheric horizontal and field-aligned currents inferred from EIS-\nCAT, Ann. Geophysicae, 14, 1284–1296, 1996.\nFujii, R., Hoffman, R. A., and Sugiura, M.: Spatial relationships\nbetween region 2 field-aligned currents and electron and ion pre-\ncipitation in the evening sector, J. Geophys. Res., 95, 18 939–\n18 947, 1990.\n1348 M. Sugino et al.: Field-aligned currents and ionospheric parameters\nFujii, R., Nozawa, S., Matuura, N., and Brekke, A.: Study on neu-\ntral wind contribution to the electrodynamics in the polar iono-\nsphere using EISCAT CP-1 data, J. Geophys. Res., 103, 14 731–\n14 739, 1998.\nFujii, R., Hoffman, R. A., Anderson, P. C., Craven, J. D., Sugiura,\nM., Frank, L. A., and Maynard, N. C.: Electrodynamic parame-\nters in the nighttime sector during auroral substorms, J. Geophys.\nRes., 99, 6093–6112, 1994.\nFujii, R., Nozawa, S., Buchert, S. C., and Brekke, A.: Statistical\ncharacteristics of electromagnetic energy transfer between the\nmagnetosphere, the ionosphere, and the thermosphere, J. Geo-\nphys. Res., 104, 2357–2365, 1999.\nFukunishi, H., Takahashi, Y., Nagatsuma, T., Mukai, T., and\nMachida, S.: Latitudinal structures of nightside field-aligned cur-\nrents and their relationships to the plasma sheet regions, J. Geo-\nphys. Res., 98, 11 235–11 255, 1993.\nGreenwald, R. A., Weiss, W., Nielsen, E., and Thomson, N. R.:\nSTARE: A new radar auroral backscatter experiment in northern\nScandinavia, Radio Sci., 13, 1021–1039, 1978.\nHardy, D. A., Gussenhoven, M. S., Raistrick, R., and McNeil, W. J.:\nStatistical and functional representations of the pattern of auroral\nenergy flux, number flux, and conductivity, J. Geophys. Res., 92,\n12 275–12 294, 1987.\nHedin, A. E.: Extension of the MSIS thermosphere model into the\nmiddle and lower atmosphere, J. Geophys. Res., 96, 1159–1172,\n1991.\nHoffman, R. A.: Observations of ionosphere\/magnetosphere inter-\nactions from the Dynamics Explorer satellites, AGARD, Iono-\nspheric Structure and Variability on a Global Scale and Inter-\nactions with Atmosphere and Magnetosphere p. 17 (SEE N90-\n11361 02-46), April, 1989.\nIijima, T. and Potemra, T. A.: Field-aligned currents in the dayside\ncusp observed by Triad, J. Geophys. Res., 81, 5971–5979, 1976.\nIijima, T. and Potemra, T. A.: Large-scale characteristics of field-\naligned currents associated with substorms, J. Geophys. Res., 83,\n599–615, 1978.\nIijima, T.: Field-aligned currents in geospace: substance and signif-\nicance, in: Magnetospheric Current Systems, (Eds) Ohtani, S.,\nFujii, R., Hesse, M., and Lysak, R. L., AGU Geophysical Mono-\ngraph 118, pp. 107–129, 2000.\nKosch, M. J., Nielsen, E., and Hagfors, T.: A new Digital All-Sky\nImager experiment for optical auroral studies in conjunction with\nthe STARE coherent radar system, Rev. Sci. Instrum., 69, 578–\n584, 1998a.\nKosch, M. J., Scourfield, N. W. J., and Nielsen, E.: A self-consistent\nexplanation for a plasma vortex associated with the brightening\nof an auroral arc, J. Geophys. Res., 103, 29 383–29 391, 1998b.\nKosch, M. J., Amm, O., and Scourfield, M. W. J.: A plasma vortex\nrevisited: The importance of including ionospheric conductivity\nmeasurements, J. Geophys. Res., 105, 24 889–24 898, 2000.\nKosch, M. J. and Nielsen, E.: Statistical average estimates of high\nlatitude field-aligned currents from the STARE and SABRE co-\nherent VHF radar systems, Adv. Space Res., 27, 1239–1244,\n2001.\nKosch, M. J., Scourfield, M. W. J., and Amm, O.: The importance\nof conductivity gradients in ground-based field-aligned current\nstudies, Adv. Space Res., 27, 1277–1282, 2001.\nKu¨ppers, F., Untiedt, J., Baumjohann, W., Lange, K., and Jones,\nA. G.: A two-dimensional magnetometer array for ground-based\nobservations of auroral zone electric currents during the Interna-\ntional Magnetospheric Study (IMS), J. Geophys., 46, 429, 1979.\nLewis, R. V., Williams, P. J. S., Jones, G. O. L., Opgenoorth, H. J.,\nand Persson, M. A. L.: The electrodynamics of a drifting auroral\narc, Ann. Geophysicae, 12, 478–480, 1994.\nLysak, R. L.: Electrodynamic coupling of the magnetosphere and\nionosphere, Space Sci. Rev., 52, 33–87, 1990.\nMarklund, G.: Auroral arc classification scheme based on the ob-\nserved arc-associated electric field pattern, Planet. Space Sci., 32,\n193–211, 1984.\nNozawa, S. and Brekke, A.: Studies of the E-region neutral wind in\nthe disturbed auroral ionosphere, J. Geophys. Res., 100, 14 717–\n14 734, 1995.\nOpgenoorth, H. J., Ha¨ggstro¨m, I., Williams, P. J. S., and Jones,\nG. O. L.: Regions of strongly enhanced perpendicular electric\nfields adjacent to auroral arcs, J. Atmos. Terr. Phys., 52, 449–\n458, 1990.\nRishbeth, H. and Williams, P. J. S.: The EISCAT ionospheric radar:\nthe system and its early results, Q. J. R. Astron. Soc., 26, 478–\n512, 1985.\nRobinson, R. M., Vondrak, R. R., Miller, K., Dabbs, T., and Hardy,\nD. A.: On calculating ionospheric conductivities from the flux\nand energy of precipitating electrons, J. Geophys. Res., 92,\n2565–2569, 1987.\nSato, M., Kamide, Y., Richmond, A. D., Brekke, A., and Nozawa,\nS.: Regional estimation of electric fields and currents in the polar\nionosphere, Geophys. Res. Lett., 22, 283–286, 1995.\nSchlegel, K.: Auroral zone E-region conductivities during solar\nminimum derived from EISCAT data, Ann. Geophysicae, 6,\n129–138, 1988.\nSchoute-Vanneck, H., Scourfield, M. W. J., and Nielsen, E.: Drift-\ning black aurorae?, J. Geophys. Res., 95, 241–246, 1990.\nSchunk, R. W., Raitt, W. J., and Banks, P. M.: Effect of electric\nfields on the daytime high-latitude E- and F-regions, J. Geophys.\nRes., 80, 3121–3130, 1975.\nSenior, C., Robinson, R. M., and Potemra, T. A.: Relationship be-\ntween field-aligned currents, diffuse auroral precipitation and the\nwestward electrojet in the early morning sector, J. Geophys. Res.,\n87, 10 469–10 477, 1982.\nSenior, C., Fontaine, D., Caudal, G., Alcayde´, D., and Fontanari,\nJ.: Convection electric fields and electrostatic potential over\n61◦ < 3 < 72◦ invariant latitude observed with the European\nincoherent scatter facility. 2. Statistical results, Ann. Geophysi-\ncae, 8, 257–272, 1990.\nSenior, C.: Solar and particle contributions to auroral height-\nintegrated conductivities from EISCAT data: a statistical study,\nAnn. Geophysicae, 9, 449–460, 1991.\nSofko, G. J., Greenwald, R., and Bristow, W.: Direct determination\nof large-scale magnetospheric field-aligned currents with Super-\nDARN, Geophys. Res. Lett., 22, 2041–2044, 1995.\nSpence, H. E., Kivelson, M. G., Walker, R. J., and McComas, D.\nJ.: Magnetospheric plasma pressures in the midnight meridian:\nObservations from 2.5 to 35RE , J. Geophys. Res., 94, 5264–\n5272, 1989.\nSpiro, R. W., Reiff, P. H., and Maher, Jr., L. J.: Precipitating electron\nenergy flux and auroral zone conductance – An empirical model,\nJ. Geophys. Res., 87, 8215–8227, 1982.\nTrondsen, T. S. and Cogger, L. L.: High-resolution television obser-\nvations of black aurora, J. Geophys. Res., 102, 363–378, 1997.\nYasuhara, F., Kamide, Y., and Holt, J. M.: Field-aligned currents in\nhigh latitudes estimated from Millstone Hill radar observations\nof ion drifts, J. Geophys. Res., 87, 2553–2557, 1982.\n"}