{"doi":"10.1109\/TPDS.2007.70787","coreId":"65472","oai":"oai:dro.dur.ac.uk.OAI2:5741","identifiers":["oai:dro.dur.ac.uk.OAI2:5741","10.1109\/TPDS.2007.70787"],"title":"Embedding long paths in k-ary n-cubes with faulty nodes and links.","authors":["Stewart,  I. A.","Xiang,  Y."],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2008-08-01","abstract":"Let $k \\geq 4$ be even and let $n \\geq 2$. Consider a faulty k-ary n-cube $Q_n^k$ in which the number of node faults $f_n$ and the number of link faults $f_e$ are such that $f_n + f_e \\leq 2n-2$. We prove that given any two healthy nodes s and e of $Q_n^k$, there is a path from s to e of length at least $k^n - 2f_n - 1$ (resp. $k^n - 2f_n - 2$) if the nodes s and e have different (resp. the same) parities (the parity of a node in $Q_n^k$ is the sum modulo 2 of the elements in the n-tuple over {0, 1, ..., k-1} representing the node). Our result is optimal in the sense that there are pairs of nodes and fault configurations for which these bounds cannot be improved, and it answers questions recently posed by Yang, Tan and Hsu, and by Fu. Furthermore, we extend known results, obtained by Kim and Park, for the case when n = 2","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65472.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5741\/1\/5741.pdf","pdfHashValue":"bb2b293a6935466bc7d20e8a08d0f80e1d1898f4","publisher":"IEEE","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5741<\/identifier><datestamp>\n      2011-11-10T11:09:14Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Embedding long paths in k-ary n-cubes with faulty nodes and links.<\/dc:title><dc:creator>\n        Stewart,  I. A.<\/dc:creator><dc:creator>\n        Xiang,  Y.<\/dc:creator><dc:description>\n        Let $k \\geq 4$ be even and let $n \\geq 2$. Consider a faulty k-ary n-cube $Q_n^k$ in which the number of node faults $f_n$ and the number of link faults $f_e$ are such that $f_n + f_e \\leq 2n-2$. We prove that given any two healthy nodes s and e of $Q_n^k$, there is a path from s to e of length at least $k^n - 2f_n - 1$ (resp. $k^n - 2f_n - 2$) if the nodes s and e have different (resp. the same) parities (the parity of a node in $Q_n^k$ is the sum modulo 2 of the elements in the n-tuple over {0, 1, ..., k-1} representing the node). Our result is optimal in the sense that there are pairs of nodes and fault configurations for which these bounds cannot be improved, and it answers questions recently posed by Yang, Tan and Hsu, and by Fu. Furthermore, we extend known results, obtained by Kim and Park, for the case when n = 2.<\/dc:description><dc:publisher>\n        IEEE<\/dc:publisher><dc:source>\n        IEEE transactions on parallel and distributed systems, 2008, Vol.19(8), pp.1071-1085 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2008-08-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5741<\/dc:identifier><dc:identifier>\n        issn:1045-9219<\/dc:identifier><dc:identifier>\n        doi:10.1109\/TPDS.2007.70787<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5741\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1109\/TPDS.2007.70787<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5741\/1\/5741.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["1045-9219","issn:1045-9219"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n02 July 2009\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nStewart, I. A. and Xiang, Y. (2008) ’Embedding long paths in k-ary n-cubes with faulty nodes and links.’,\nIEEE transactions on parallel and distributed systems., 19 (8). pp. 1071-1085.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1109\/TPDS.2007.70787\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \nDurham Research Online \n \nDeposited in DRO: \n01 July 2009 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status of attached file: \nPublished \n \nCitation for published item: \nStewart, I. A. and Xiang, Y. (2008) 'Embedding long paths in k-ary n-cubes with faulty nodes \nand links.', IEEE transactions on parallel and distributed systems., 19 (8). pp. 1071-1085. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1109\/TPDS.2007.70787 \n \nPublisher’s copyright statement: \nThis material is presented to ensure timely dissemination of scholarly and technical work. \nCopyright and all rights therein are retained by authors or by other copyright holders. All \npersons copying this information are expected to adhere to the terms and constraints \ninvoked by each author's copyright. In most cases, these works may not be reposted without \nthe explicit permission of the copyright holder.  \n \n©2008 IEEE. Personal use of this material is permitted. However, permission to \nreprint\/republish this material for advertising or promotional purposes or for creating new \ncollective works for resale or redistribution to servers or lists, or to reuse any copyrighted \ncomponent of this work in other works must be obtained from the IEEE. \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nEmbedding Long Paths in k-Ary n-Cubes\nwith Faulty Nodes and Links\nIain A. Stewart and Yonghong Xiang\nAbstract—Let k \u0002 4 be even and let n \u0002 2. Consider a faulty k-ary n-cube Qkn in which the number of node faults fv and the number of\nlink faults fe are such that fv þ fe \u0003 2n\u0004 2. We prove that given any two healthy nodes s and e of Qkn, there is a path from s to e of\nlength at least kn \u0004 2fv \u0004 1 (respectively, kn \u0004 2fv \u0004 2) if the nodes s and e have different (respectively, the same) parities (the parity of\na node in Qkn is the sum modulo 2 of the elements in the n-tuple over f0; 1; . . . ; k\u0004 1g representing the node). Our result is optimal in\nthe sense that there are pairs of nodes and fault configurations for which these bounds cannot be improved, and it answers questions\nrecently posed by Yang et al. [22] and by Fu [11]. Furthermore, we extend known results, obtained by Kim and Park [15], for the case\nwhen n ¼ 2.\nIndex Terms—Interconnection networks, k-ary n-cubes, fault tolerance, embeddings, longest paths.\nÇ\n1 INTRODUCTION\nTHE choice of how we connect the processors in adistributed-memory parallel machine is a fundamental\ndesign decision. There are numerous, often conflicting\nconsiderations to bear in mind. For instance, we would\nlike our interconnection topology to be symmetric, have a\nsmall diameter, be recursively decomposable, be highly\nconnected, be regular of low degree, support rapid and easy\ninterprocessor communication, support the simulation of\nother machines based on other topologies, and so on. There\ndoes not exist an interconnection topology that is optimal\non all accounts, and trade-offs generally have to be made.\nAn extremely popular interconnection topology is the\nhypercube. The hypercube has been used as the interconnec-\ntion topology of a number of distributed-memory multi-\nprocessors suchas theCosmicCube [19], theAmetekS\/14 [4],\nthe iPSC [9], [10], the Ncube [5], [10], and the CM-200 [6], and\nthe properties of hypercubes relevant to parallel computing\nhave been well studied. One drawback of the hypercube is\nthat as the dimension of a hypercube increases, so does the\ndegree of its nodes. Consequently, given a collection of\nprocessors, if we wish to connect these processors in the\ntopology of a hypercube, then we have no choice as to the\ndegree of thenodes of the resultingnetwork. The k-ary n-cube\nhas been proposed as an alternative to the hypercube. The\nk-ary n-cube is very “hypercube-like” andhas similar proper-\nties to the hypercube. Furthermore, the two parameters\navailable, k andn, allowus to regulate the degree of the nodes\nyet still incorporate large numbers of processors, although\nusually at a cost to some other property such as the diameter\nor the connectivity. A number of distributed memory multi-\nprocessors have been built with a k-ary n-cube forming the\nunderlying topology, such as theMosaic [20], the iWARP [7],\nthe J-machine [18], the Cray T3D [14], and the Cray T3E [3].\nAs more and more processors are incorporated into\nparallel machines, faults become more common, be it faults\nin the processors themselves or faults on the interprocessor\nconnections. Given the significant cost of parallel machines,\nwe would prefer to be able to tolerate small numbers of\nfaults and still be able to use our parallel machine. A key\nproperty we would like our “faulty” machine to have is that\na large number of the healthy processors should remain in a\nconnected component and be able to undertake significant\nparallel computations. Numerous existing algorithms for\nk-ary n-cubes utilize the orderings of processors and involve\nthe use of long paths and cycles (note that a path in a\nmultiport bidirectional network results in a closed path\ncontaining the nodes of the path exactly twice), and we\nwould wish to utilize such structures even in the presence\nof faults. Also, fundamental and abundant in parallel\ncomputing are linear arrays and rings of processors, and\nat the very least, our faulty machine should be able to\nsimulate (the large number of) algorithms designed for\nmachines whose processors are joined in the form of linear\narrays or rings (see, for example, [2] and [16]). We remark\nthat our situation is of a different nature to that where a\nfaulty network is to simulate another (healthy) network but\nwhere this simulation comes about due to an embedding of\nthe healthy network in the faulty network with low load,\ncongestion, and\/or dilation (such a scenario can be found\nin, for example, [1], [8], [12], and [17], where hypercubes,\narrays, and butterflies are considered).\nIn this paper, we continue the study of the k-ary n-cube\nwith regard to the existence of long paths and cycles in the\npresence of limited numbers of node and link faults. We are\nmotivated by the work in four recent publications. In [15],\nKim and Park study the existence of Hamiltonian paths in\ntwo-dimensional tori. They provide conditions when a two-\ndimensional torus with at most two faulty nodes is\nHamiltonian, Hamiltonian-connected, and bi-Hamiltonian\nconnected. In [11], Fuproves that ann-dimensionalhypercube\nwith f \u0003 n\u0004 2 faulty nodes is such that there is a path of\nlength at least 2n \u0004 2f \u0004 \u0002 between any two distinct healthy\nIEEE TRANSACTIONS ON PARALLEL AND DISTRIBUTED SYSTEMS, VOL. 19, NO. 8, AUGUST 2008 1071\n. The authors are with the Department of Computer Science, Durham\nUniversity, Science Labs, South Road, Durham DH1 3LE, UK.\nE-mail: {i.a.stewart, yonghong.xiang}@durham.ac.uk.\nManuscript received 23 June 2007; revised 10 Sept. 2007; accepted 11 Sept.\n2007; published online 11 Oct. 2007.\nRecommended for acceptance by B. Parhami.\nFor information on obtaining reprints of this article, please send e-mail to:\ntpds@computer.org, and reference IEEECS Log Number TPDS-2007-06-0208.\nDigital Object Identifier no. 10.1109\/TPDS.2007.70787.\n1045-9219\/08\/$25.00 \u0002 2008 IEEE Published by the IEEE Computer Society\nAuthorized licensed use limited to: University of Durham. Downloaded on July 1, 2009 at 10:58 from IEEE Xplore.  Restrictions apply.\nnodes, where \u0002 ¼ 1 if the two nodes have different parities\nand \u0002 ¼ 2 otherwise. In [13], Hsieh and Chang show that Fu’s\nresult holds even when f \u0003 2n\u0004 5 but only so long as every\nhealthy node is adjacent to at least two healthy nodes (the so-\ncalled conditional fault assumption). In [22], Yang et al.\nproved that in a k-ary n-cubewhere k is odd, if the number of\nfaulty nodes and links is at most 2n\u0004 3, then there is a\nHamiltonian cycle, and if the number of faulty nodes and\nlinks is at most 2n\u0004 2, then there is a Hamiltonian path\njoining any two distinct healthy nodes. Note that Yang et al.\nprove no results when k is even beyond remarking that when\nk is even, the k-ary n-cube is bipartite, and so, if there is one\nfaultynode, then there canbenoHamiltonian cycle, and there\nexists a pair of distinct healthy nodes not joined by a\nHamiltonian path.\nOur main result is given as follows: Let k \u0002 4 be even\nand let n \u0002 2. In a faulty k-ary n-cube Qkn in which the\nnumber of node faults fn and the number of link faults fe\nare such that fn þ fe \u0003 2n\u0004 2, given any two healthy\nnodes s and e of Qkn, there is a path from s to e of length\nat least kn \u0004 2fn \u0004 1 (respectively, kn \u0004 2fn \u0004 2) if the nodes\ns and e have different (respectively, the same) parities. Our\nresult resolves the situation in [22] when k is even, answers\nthe questions posed by Yang et al. and by Fu, and extends\nknown results, obtained by Kim and Park, for the case when\nn ¼ 2. The rest of this paper is devoted to a proof by\ninduction of our main theorem. Section 2 contains the basic\ndefinitions. In Section 3, we deal with the base case of the\ninduction, and in Section 4, we deal with the inductive step.\nWe present our conclusions in Section 5.\n2 BASIC DEFINITIONS\nThe k-ary n-cube Qkn, for k \u0002 3 and n \u0002 2, has kn nodes\nindexed by f0; 1; . . . ; k\u0004 1gn, and there is a link\nððu1; u2; . . . ; unÞ, ðv1; v2; . . . ; vnÞÞ if and only if there exists\nd 2 f1; 2; . . . ; ng such that minfjud \u0004 vdj; k\u0004 jud \u0004 vdjg ¼ 1\nand ui ¼ vi, for every i 2 f1; 2; . . . ; ng n fdg. Many structural\nproperties of k-ary n-cubes are known, but of particular\nrelevance for us is that a k-ary n-cube is node symmetric;\nthat is, given any two distinct nodes v and v0 of Qkn, there is\nan automorphism of Qkn mapping v to v\n0. Throughout, we\nassume that the addition of tuple elements is modulo k.\nAn index d 2 f1; 2; . . . ; ng is often referred to as a\ndimension. We can partition Qkn over dimension d by fixing\nthe dth element of any node tuple at some value v, for\nevery v 2 f0; 1; . . . ; k\u0004 1g. This results in k copies\nQd;0; Qd;1; . . . ; Qd;k\u00041 of Qkn\u00041 (with Qd;v obtained to fix\nthe dth element at v), with corresponding nodes in\nQd;0; Qd;1; . . . ; Qd;k\u00041 joined in a cycle of length k (in\ndimension d). Such a partition proves to be extremely\nuseful (in proofs by induction, as we shall see).\nThe parity of a node v ¼ ðv1; v2; . . . ; vnÞ of Qkn is defined to\nbe\nPn\ni¼1 vi modulo 2. We speak of a node as being odd or\neven according to whether its parity is odd or even. A pair of\nnodes fv;v0g is odd (respectively, even) if v and v0 have\ndifferent (respectively, the same) parities.\nWe write paths in Qkn as sequences of incident links, and\nwhen k is even, paths necessarily consist of links joining,\nalternatively, odd and even nodes. We often refer to a\npath as \u0003ðu;vÞ; the notation denotes that this is a path\njoining node u and node v. On occasion, we might refer to a\nlink ðx;yÞ as appearing on a path \u0003ðu;vÞ or, equivalently,\nthe path \u0003ðu;vÞ as containing the link ðx;yÞ; when we do,\nthe notation denotes that if we traverse the path \u0003ðu;vÞ\nstarting at node u, then we shall reach node x immediately\nbefore we reach node y. If \u0003ðu;vÞ is a path and x and y are\nnodes on this path, then \u0003ðx;yÞ denotes the subpath of\n\u0003ðu;vÞ starting at x and ending at y.\nA fault in Qkn refers to a faulty node or a faulty link. If a\nnode is faulty, then we imagine that the node and its\nincident links do not exist; if a link is faulty, then we\nimagine that this link does not exist. When we refer to a\npath in a faulty Qkn, we mean that all nodes and links on\nthe path should be nonfaulty, that is, healthy (unless\notherwise stated).\nWe repeatedly apply the following construction through-\nout. Suppose that we have partitioned a k-ary n-cube Qkn\nover some dimension d so as to obtain k-ary ðn\u0004 1Þ-cubes\nQd;0; Qd;1; . . . ; Qd;k\u00041 and that we have a path \u0003ðu;vÞ in Qkn of\nlength l. Suppose also that ðxi;yiÞ is a link of \u0003ðu;vÞ, with\nxi, yi 2 Qd;i and that we have another path \u00030ðxiþ1;yiþ1Þ of\nlength l0 that shares no nodes in common with \u0003ðu;vÞ,\nwhere xiþ1 and yiþ1 are the neighbors of xi and yi,\nrespectively, in Qd;iþ1. We refer to the path obtained by\nremoving the link ðxi;yiÞ from \u0003ðu;vÞ and replacing it with\nthe path ðxi;xiþ1Þ, \u00030ðxiþ1;yiþ1Þ, ðyiþ1;yiÞ, so as to obtain a\nnew path from u to v of length lþ l0 þ 1, as the join of\n\u0003ðu;vÞ to \u00030ðxiþ1;yiþ1Þ over ðxi;yiÞ. We can equally well join\ntwo paths over a subpath rather than a link; with the above\nnotation, we would remove a subpath \u0003ðxi;yiÞ from \u0003ðu;vÞ\nand replace it with the path ðxi;xiþ1Þ, \u00030ðxiþ1;yiþ1Þ,\nðyiþ1;yiÞ. We have analogous constructions should we wish\nto join a cycle and a path to obtain a path or two cycles to\nobtain a cycle (when joining a cycle, we lose one edge from\nthe cycle).\nHenceforth, for reasons of clarity, we drop the use of\nbold type to denote the nodes of Qkn (hitherto, we have used\nbold type to emphasize the representation of nodes as\ntuples of elements).\n3 THE BASE CASE\nIn this section, we deal with the base case of our\nforthcoming inductive proof of the main result, namely,\nwhen we have a k-ary 2-cube with no more than two faults.\nWe begin with some notation specific to our constructions\nin this section.\nWe consider Qk2 as a k\u0005 k grid with wraparound, and we\nthink of a node vi;j as indexed by its row i and column j.\nGiven two row indices i, j 2 f0; 1; . . . ; k\u0004 1g, where j 6¼ i,\nwe define the row torus rtði; jÞ to be the subgraph of Qk2\ninduced by the nodes on rows i, iþ 1; . . . ; j if i < j or\nrows i; iþ 1; . . . ; k\u0004 1; 0; . . . ; j if j < i but with all column\nlinks between nodes on row j and nodes on row i removed\nif i ¼ jþ 1 or (i ¼ 0 and j ¼ k\u0004 1). Throughout, we assume\nthat the addition of row or column indices is modulo k.\nWe define the following paths in the row torus rtð0; 1Þ\n(of some Qk2). The names of these paths are derived from the\nshape of their pictorial representations (see the figures\ncoming up). Also, if i ¼ 0, then i ¼ 1, and if i ¼ 1, then i ¼ 0.\nThe paths are given as follows:\n1072 IEEE TRANSACTIONS ON PARALLEL AND DISTRIBUTED SYSTEMS, VOL. 19, NO. 8, AUGUST 2008\nAuthorized licensed use limited to: University of Durham. Downloaded on July 1, 2009 at 10:58 from IEEE Xplore.  Restrictions apply.\nCþmðvi;j; vi;jÞ ¼ ðvi;j; vi;jþ1Þ; ðvi;jþ1; vi;jþ2Þ; . . . ;\nðvi;m\u00041; vi;mÞ; ðvi;m; vi;mÞ; ðvi;m; vi;m\u00041Þ;\nðvi;m\u00041; vi;m\u00042Þ; . . . ; ðvi;jþ1; vi;jÞ;\nwhere 0 \u0003 i \u0003 1; 0 \u0003 j \u0003 k\u0004 1;\n0 \u0003 m \u0003 k\u0004 1; and m 6¼ j:\nC\u0004mðvi;j; vi;jÞ ¼ ðvi;j; vi;j\u00041Þ; ðvi;j\u00041; vi;j\u00042Þ; . . . ;\nðvi;mþ1; vi;mÞ; ðvi;m; vi;mÞ; ðvi;m; vi;mþ1Þ;\nðvi;mþ1; vi;mþ2Þ; . . . ; ðvi;j\u00041; vi;jÞ;\nwhere 0 \u0003 i \u0003 1; 0 \u0003 j \u0003 k\u0004 1;\n0 \u0003 m \u0003 k\u0004 1; and m 6¼ j:\nNþðvi;j; vi;j0 Þ ¼ ðvi;j; vi;jÞ; ðvi;j; vi;jþ1Þ; ðvi;jþ1; vi;jþ1Þ;\nðvi;jþ1; vi;jþ2Þ; ðvi;jþ2; vi;jþ2Þ; ðvi;jþ2;\nvi;jþ3Þ; ðvi;jþ3; vi;jþ3Þ; ðvi;jþ3; vi;jþ4Þ;\n. . . ; ðvi;j0\u00041; vi;j0 Þ; where 0 \u0003 i \u0003 1;\n0 \u0003 j 6¼ j0 \u0003 k\u0004 1; and jj\u0004 j0j is even:\nN\u0004ðvi;j; vi;j0 Þ ¼ ðvi;j; vi;jÞ; ðvi;j; vi;j\u00041Þ; ðvi;j\u00041; vi;j\u00041Þ;\nðvi;j\u00041; vi;j\u00042Þ; ðvi;j\u00042; vi;j\u00042Þ; ðvi;j\u00042;\nvi;j\u00043Þ; ðvi;j\u00043; vi;j\u00043Þ; ðvi;j\u00043; vi;j\u00044Þ;\n. . . ; ðvi;j0þ1; vi;j0 Þ; where 0 \u0003 i \u0003 1;\n0 \u0003 j0 6¼ j \u0003 k\u0004 1; and jj\u0004 j0j is even:\nZþðvi;j; vi;j0 Þ ¼ ðvi;j; vi;jþ1Þ; ðvi;jþ1; vi;jþ1Þ;\nðvi;jþ1; vi;jþ2Þ; ðvi;jþ2; vi;jþ2Þ;\nðvi;jþ2; vi;jþ3Þ; ðvi;jþ3; vi;jþ3Þ;\nðvi;jþ3; vi;jþ4Þ; ðvi;jþ4; vi;jþ4Þ;\n. . . ; ðvi;j0 ; vi;j0 Þ; where 0 \u0003 i \u0003 1;\n1 \u0003 j 6¼ j0 \u0003 k\u0004 1; and jj\u0004 j0j is even:\nZ\u0004ðvi;j; vi;j0 Þ ¼ ðvi;j; vi;j\u00041Þ; ðvi;j\u00041; vi;j\u00041Þ;\nðvi;j\u00041; vi;j\u00042Þ; ðvi;j\u00042; vi;j\u00042Þ;\nðvi;j\u00042; vi;j\u00043Þ; ðvi;j\u00043; vi;j\u00043Þ;\nðvi;j\u00043; vi;j\u00044Þ; ðvi;j\u00044; vi;j\u00044Þ;\n. . . ; ðvi;j0 ; vi;j0 Þ; where 0 \u0003 i \u0003 1;\n1 \u0003 j0 6¼ j \u0003 k\u0004 1; and jj\u0004 j0j is even:\nIn addition, we define Cþj ðvi;j; vi;jÞ ¼ C\u0004j ðvi;j; vi;jÞ ¼ ðvi;j; vi;jÞ.\nWe also use the above notation to describe paths in other\nrow tori of the form rtðl; lþ 1Þ in Qk2. Furthermore, if we\nwrite, for example, Nþðvi;j; vi;jþ1Þ, Z\u0004ðvi;j; vi;jÞ or some other\nillegal node pairing, then we regard the path so denoted as\nbeing the empty path.\nWe beginwith two lemmas: the first concerning paths in a\nrow torus rtð0; 1Þ in which there is a faulty node and the\nsecond concerning paths in a row torus rtð0; p\u0004 1Þ in which\nthere are no faults. These two lemmas are used repeatedly in\ntheproofsof the subsequentpropositions, eachofwhichdeals\nwith a specific configuration of faults relating to the base case.\nLemma 1. Let k \u0002 4 be even and consider the row torus rtð0; 1Þ\nin Qk2, where one node of the row torus is faulty. If the pair of\ndistinct healthy nodes fs; eg of the row torus is odd\n(respectively, even), then there is a path \u0003ðs; eÞ in the row\ntorus joining s and e of length at least 2k\u0004 3 (respectively,\n2k\u0004 4).\nProof. By the symmetric properties of the row torus rtð0; 1Þ,\nwithout loss of generality, we may assume that the fault\nis the node v0;0.\nSuppose that s and e are both odd. Without loss of\ngenerality, there are four cases. (Throughout, we proceed\nby a case-by-case analysis, eliminating some cases by\napplying automorphisms of rtð0; 1Þ such as “reflections\nin the vertical bisecting plane” or “toroidal rotations.”)\nCase a. s and e both lie on row 0, with s ¼ v0;i, e ¼ v0;j,\nand i < j. Consider the path\nCþj\u00041ðv0;i; v1;iÞ; Z\u0004ðv1;i; v1;1Þ; ðv1;1; v1;0Þ; ðv1;0; v1;k\u00041Þ;\nN\u0004ðv1;k\u00041; v1;jÞ; ðv1;j; v0;jÞ:\nThis path has length 2k\u0004 2 and is as depicted in Fig. 1a.\nCase b. s and e lie on different rows, with s ¼ v0;i,\ne ¼ v1;j, and i < j. Consider the path\nCþj\u00041ðv0;i; v1;iÞ; Z\u0004ðv1;i; v1;1Þ; ðv1;1; v1;0Þ; ðv1;0; v1;k\u00041Þ;\nN\u0004ðv1;k\u00041; v1;jþ1Þ; ðv1;jþ1; v0;jþ1Þ; ðv0;jþ1; v0;jÞ; ðv0;j; v1;jÞ:\nThis path has length 2k\u0004 2 and is as depicted in Fig. 1b.\nCase c. s and e lie on different rows, with s ¼ v0;i and\ne ¼ v1;0. Consider the path\nCþk\u00041ðv0;i; v1;iÞ; Z\u0004ðv1;i; v1;1Þ; ðv1;1; v1;0Þ:\nThis path has length 2k\u0004 2 and is as depicted in Fig. 1c.\nCase d. s and e both lie on row 1, with s ¼ v1;i, e ¼ v1;j,\nand i < j. Consider the path\nN\u0004ðv1;i; v1;0Þ; ðv1;0; v1;k\u00041Þ; N\u0004ðv1;k\u00041; v1;jþ1Þ;\nðv1;jþ1; v0;jþ1Þ; ðv0;jþ1; v0;jÞ; C\u0004iþ1ðv0;j; v1;jÞ:\nThis path has length 2k\u0004 2 and is as depicted in Fig. 1d.\nSuppose now that s and e are both even. Without loss\nof generality, there are three cases.\nCase e. s and e both lie on row 0, with s ¼ v0;i, e ¼ v0;j,\nand i < j. Consider the path\nCþj\u00041ðv0;i; v1;iÞ; Z\u0004ðv1;i; v1;2Þ; ðv1;2; v1;1Þ; ðv1;1; v1;0Þ;\nðv1;0; v1;k\u00041Þ; N\u0004ðv1;k\u00041; v1;jþ1Þ; ðv1;jþ1; v0;jþ1Þ; ðv0;jþ1; v0;jÞ:\nSTEWART AND XIANG: EMBEDDING LONG PATHS IN K-ARY N-CUBES WITH FAULTY NODES AND LINKS 1073\nFig. 1. Cases (a), (b), (c), and (d) when k ¼ 8.\nAuthorized licensed use limited to: University of Durham. Downloaded on July 1, 2009 at 10:58 from IEEE Xplore.  Restrictions apply.\nThis path has length 2k\u0004 4 and is similar to the path\ndepicted in Fig. 1a.\nCase f. s and e lie on different rows, with s ¼ v0;i,\ne ¼ v1;j, and i < j. Consider the path\nCþj\u00041ðv0;i; v1;iÞ; Z\u0004ðv1;i; v1;2Þ; ðv1;2; v1;1Þ; ðv1;1; v1;0Þ;\nðv1;0; v1;k\u00041Þ; N\u0004ðv1;k\u00041; v1;jÞ:\nThis path has length 2k\u0004 4 and is similar to the path\ndepicted in Fig. 1b.\nCase g. s and e both lie on row 1, with s ¼ v1;i, e ¼ v1;j,\nand i < j. Consider the path\nN\u0004ðv1;i; v1;1Þ; ðv1;1; v1;0Þ; ðv1;0; v1;k\u00041Þ; N\u0004ðv1;k\u00041; v1;jþ2Þ;\nðv1;jþ2; v0;jþ2Þ; ðv0;jþ2; v0;jþ1Þ; ðv0;jþ1; v0;jÞ; C\u0004iþ1ðv0;j; v1;jÞ:\nThis path has length 2k\u0004 4 and is similar to the path\ndepicted in Fig. 1d.\nSuppose now that one of s and e is odd and the other\nis even and, further, that s and e lie on the same row.\nWithout loss of generality, there are three cases.\nCase h. s and e both lie on row 0, with s ¼ v0;i odd,\ne ¼ v0;j even, and i < j. Consider the path\nCþj\u00041ðv0;i; v1;iÞ; Z\u0004ðv1;i; v1;1Þ; ðv1;1; v1;0Þ; ðv1;0; v1;k\u00041Þ;\nN\u0004ðv1;k\u00041; v1;jþ1Þ; ðv1;jþ1; v0;jþ1Þ; ðv0;jþ1; v0;jÞ:\nThis path has length 2k\u0004 3 and is as depicted in\nFig. 2h.\nCase i. s and e both lie on row 1, with s ¼ v1;i odd,\ne ¼ v1;j even, and 0 6¼ i < j. Consider the path\nCþj\u00041ðv1;i; v0;iÞ; Z\u0004ðv0;i; v0;2Þ; ðv0;2; v0;1Þ; ðv0;1; v1;1Þ;\nðv1;1; v1;0Þ; ðv1;0; v1;k\u00041Þ; N\u0004ðv1;k\u00041; v1;jÞ:\nThis path has length 2k\u0004 3 and is as depicted in\nFig. 2i.\nCase j. s and e both lie on row 1, with s ¼ v1;0 and\ne ¼ v1;j even. Consider the path\nðv1;0; v1;k\u00041Þ; N\u0004ðv1;k\u00041; v1;jþ2Þ; ðv1;jþ2; v0;jþ2Þ;\nðv0;jþ2; v0;jþ1Þ; ðv0;jþ1; v0;jÞ; C\u00041 ðv0;j; v1;jÞ:\nThis path has length 2k\u0004 3 and is as depicted in Fig. 2j.\nSuppose now that one of s and e is odd and the other\nis even and, further, that s and e lie on different rows.\nWithout loss of generality, there are five cases.\nCase k. s lies on row 0, and e lies on row 1, with s ¼ v0;i\nodd, e ¼ v1;j even, and i < j. Consider the path\nCþj\u00041ðv0;i; v1;iÞ; Z\u0004ðv1;i; v1;1Þ; ðv1;1; v1;0Þ; ðv1;0; v1;k\u00041Þ;\nN\u0004ðv1;k\u00041; v1;jÞ:\nThis path has length 2k\u0004 3 and is as depicted in\nFig. 3k.\nCase l. s and e lie on different rows, with s ¼ v0;i odd,\ne ¼ v1;i even, and i 6¼ 1. Consider the path\nZ\u0004ðv0;i; v0;3Þ; ðv0;3; v0;2Þ; ðv0;2; v1;2Þ; ðv1;2; v1;1Þ; ðv1;1; v1;0Þ;\nðv1;0; v1;k\u00041Þ; N\u0004ðv1;k\u00041; v1;jÞ:\nThis path has length 2k\u0004 3 and is as depicted in Fig. 3l.\nCase m. s and e lie on different rows, with s ¼ v0;i\neven, e ¼ v1;i odd, and i < j. Consider the path\nCþj\u00041ðv0;i; v1;iÞ; Z\u0004ðv1;i; v1;2Þ; ðv1;2; v1;1Þ; ðv1;1; v1;0Þ;\nðv1;0; v1;k\u00041Þ; N\u0004ðv1;k\u00041; v1;jþ1Þ; ðv1;jþ1; v0;jþ1Þ;\nðv0;jþ1; v0;jÞ; ðv0;j; v1;jÞ:\nThis path has length 2k\u0004 3 and is as depicted in Fig. 3m.\nCase n. s and e lie on different rows, with s ¼ v0;i even\nand e ¼ v1;0. Consider the path\nCþj\u00041ðv0;i; v1;iÞ; Z\u0004ðv1;i; v1;2Þ; ðv1;2; v1;1Þ; ðv1;1; v1;0Þ:\nThis path has length 2k\u0004 3 and is as depicted in Fig. 3n.\nCase o. s and e lie on different rows, with s ¼ v0;i even\nand e ¼ v1;i odd. Consider the path\nZ\u0004ðv0;i; v0;2Þ; ðv0;2; v0;1Þ; ðv0;1; v1;1Þ; ðv1;1; v1;0Þ;\nðv1;0; v1;k\u00041Þ; N\u0004ðv1;k\u00041; v1;jþ1Þ; ðv1;jþ1; v1;jÞ:\nThis path has length 2k\u0004 3 and is as depicted in Fig. 3o.\nThe result follows. tu\nThe following lemma proves to be useful throughout.\n1074 IEEE TRANSACTIONS ON PARALLEL AND DISTRIBUTED SYSTEMS, VOL. 19, NO. 8, AUGUST 2008\nFig. 2. Cases (h), (i), and (j) when k ¼ 8.\nFig. 3. Cases (k), (l), (m), (n), and (o) when k ¼ 8.\nAuthorized licensed use limited to: University of Durham. Downloaded on July 1, 2009 at 10:58 from IEEE Xplore.  Restrictions apply.\nLemma 2. Let k \u0002 4 be even and consider the row torus\nrtð0; p\u0004 1Þ in Qk2, where 2 \u0003 p \u0003 k. If the pair of distinct\nnodes fs; eg of the row torus is odd (respectively, even), then\nthere is a path \u0003ðs; eÞ in the row torus joining s and e of length\npk\u0004 1 (respectively, pk\u0004 2).\nProof. We proceed by induction on p. Suppose that p ¼ 2\nand consider the row torus rtð0; 1Þ. Without loss of\ngenerality, we may assume that e ¼ v0;0.\nSuppose that s ¼ v0;i is odd. The path\nCþk\u00041ðs; v1;iÞ; Z\u0004ðv1;i; v1;1Þ; ðv1;1; v1;0Þ; ðv1;0; eÞ\nhas length 2k\u0004 1.\nSuppose that s ¼ v0;i is even. The path\nCþk\u00041ðs; v1;iÞ; Z\u0004ðv1;i\u00042; v1;2Þ; ðv1;2; v1;1Þ; ðv1;1; v1;0Þ; ðv1;0; eÞ\nhas length 2k\u0004 2.\nSuppose that s ¼ v1;i is odd. The path\nCþk\u00041ðs; v0;iÞ; Z\u0004ðv0;i; eÞ\nhas length 2k\u0004 1.\nSuppose that s ¼ v1;i is even. The path\nCþk\u00041ðs; v0;iÞ; Z\u0004ðv0;i; v0;1Þ; ðv0;1; eÞ\nhas length 2k\u0004 2. Therefore, the result holds for p ¼ 2.\nSuppose, as our induction hypothesis, that the result\nholds for all p such that 1 \u0003 p < q, where 1 < q \u0003 k\u0004 1.\nConsider rtð0; qÞ.\nCase a. It is not the case that s lies on row 0 and e lies\non row q, and it is not the case that s lies on row q and e\nlies on row 0.\nWithout loss of generality, assume that s and e lie in\nrtð0; q \u0004 1Þ. By the induction hypothesis, there is a path\n\u0003ðs; eÞ in rtð0; q \u0004 1Þ of length qk\u0004 1 (respectively, qk\u0004 2)\nif fs; eg is odd (respectively, even). A simple counting\nargument yields that the path \u0003ðs; eÞ must contain a link\nðvq\u00041;i; vq\u00041;iþ1Þ lying on row q \u0004 1. Consider the path\n\u0003ðs; vq\u00041;iÞ; ðvq\u00041;i; vq;iÞ; ðvq;i; vq;i\u00041Þ; ðvq;i\u00041; vq;i\u00042Þ; . . . ;\nðvq;iþ2; vq;iþ1Þ; ðvq;iþ1; vq\u00041;iþ1Þ; \u0003ðvq\u00041;iþ1; eÞ:\nThis path is as required (with reference to our construc-\ntion as detailed at the beginning of this section, an\nalternative description of this path would be as that\nobtained by joining \u0003ðs; eÞ to the cycle\nðvq;0; vq;1Þ; ðvq;1; vq;2Þ; . . . ; ðvq;k\u00042; vq;k\u00041Þ; ðvq;k\u00041; vq;0Þ;\nover the links ðvq\u00041;i; vq\u00041;iþ1Þ and ðvq;i; vq;iþ1ÞÞ.\nCase b. The node s lies on row 0, and the node e lies\non row q.\nIf e ¼ vq;i, then define e0 ¼ vq\u00041;i\u00041. Note that e is odd\nif and only if e0 is odd. By the induction hypothesis, there\nis a path \u0003ðs; e0Þ in rtð0; q \u0004 1Þ of length qk\u0004 1 (respec-\ntively, qk\u0004 2) if fs; eg is odd (respectively, even). The\npath\n\u0003ðs; e0Þ; ðe0; vq;i\u00041Þ; ðvq;i\u00041; vq;i\u00042Þ; ðvq;i\u00042; vq;i\u00043Þ;\n. . . ; ðvq;iþ1; eÞ\nis as required.\nThe result follows by induction. tu\nWe now deal with the first scenario in the base case.\nProposition 3. Consider the k-ary 2-cube Qk2, where k \u0002 6 is\neven and where two of the nodes are faulty. Let s and e be any\ntwo distinct nonfaulty nodes. There is a path of length at least\nk2 \u0004 5 (respectively, k2 \u0004 6) from s to e if fs; eg is odd\n(respectively, even).\nProof. Without loss of generality, suppose that the\ntwo faulty nodes are f0 ¼ v0;0 and f1 ¼ vp;p0 , with p 6¼ 0.\nWe begin by partitioning Qk2 into three or four row tori.\nIf p 2 f1; 2; k\u0004 2; k\u0004 1g, then\n. if p ¼ 1 or p ¼ 2, then we partition Qk2 into\nA¼ rtðk\u0004 1; 0Þ, B ¼ rtð1; 2Þ, and X ¼ rtð3; k\u0004 2Þ,\nand\n. if p ¼ k\u0004 2 or p ¼ k\u0004 1, then we partition\nQk2 i n t o A ¼ rtð0; 1Þ, X ¼ rtð2; k\u0004 3Þ, a nd\nB¼ rtðk\u0004 2; k\u0004 1Þ.\nIf p 62 f1; 2; k\u0004 2; k\u0004 1g, then\n. if p 6¼ 3 is odd, then we partition Qk2 into\nA¼ rtð0; 1Þ, X¼ rtð2; p\u0004 2Þ, B ¼ rtðp\u0004 1; pÞ, and\nY ¼ rtðpþ 1; k\u0004 1Þ,\n. if p ¼ 3, then we partition Qk2 into A ¼ rtðk\u0004 1; 0Þ,\nX ¼ rtð1; 2Þ, B ¼ rtð3; 4Þ, and Y ¼ rtð5; k\u0004 2Þ,\n. if p is even, then we partition Qk2 into\nA ¼ rtð0; 1Þ, X¼ rtð2; p\u0004 1Þ, B ¼ rtðp; pþ 1Þ, and\nY ¼ rtðpþ 2; k\u0004 1Þ.\nThe outcome is that we have one of the two partitioned\nstructures as in Fig. 4, where consecutive row tori are\njoined by column links. In particular, without loss of\ngenerality, we may assume that when the partition\ninvolves three row tori, we have the situation as in\nFig. 4a, with f0 ¼ v0;0 2 A ¼ rtð0; 1Þ, X ¼ rtð2; k\u0004 3Þ\nand f1 2 B ¼ rtðk\u0004 2; k\u0004 1Þ; and when the partition\ninvolves four row tori, we have the situation as in\nFig. 4b, with f0 ¼ v0;0 2 A ¼ rtð0; 1Þ, X ¼ rtð2; q \u0004 1Þ,\nf1 2 B ¼ rtðq; q þ 1Þ, and Y ¼ rtðq þ 2; k\u0004 1Þ, for some\neven q, where 4 \u0003 q \u0003 k\u0004 4.\nSTEWART AND XIANG: EMBEDDING LONG PATHS IN K-ARY N-CUBES WITH FAULTY NODES AND LINKS 1075\nFig. 4. Partitioned Qk2 ’s.\nAuthorized licensed use limited to: University of Durham. Downloaded on July 1, 2009 at 10:58 from IEEE Xplore.  Restrictions apply.\nThroughout the proof, \u0002 ¼ 1 if fs; eg is odd, and \u0002 ¼ 2\nif fs; eg is even.\nCase a. Qk2 is partitioned into three row tori.\nSubcase a.1. The nodes s and e both lie in A.\nBy Lemma 1, there exists a path \u0003Aðs; eÞ in A of length\nat least 2k\u0004 2\u0004 \u0002. A simple counting argument yields\nthat there is at least one link of \u0003Aðs; eÞ lying on row 1;\nwithout loss of generality, let ðv1;i; v1;iþ1Þ be such a link\n(the case when the link is ðv1;iþ1; v1;iÞ is almost identical).\nBy Lemma 2, there exists a path \u0003Xðv2;i; v2;iþ1Þ in X of\nlength kðk\u0004 4Þ \u0004 1. Let \u0003ðs; eÞ be obtained by joining\n\u0003Aðs; eÞ to \u0003Xðv2;i; v2;iþ1Þ over ðv1;i; v1;iþ1Þ. Again, a simple\ncounting argument yields that there are at least two\nnonincident links of \u0003ðs; eÞ lying on row k\u0004 3; without\nloss of generality, let ðvk\u00043;j; vk\u00043;jþ1Þ be such a link where\nvk\u00042;j 6¼ f1 6¼ vk\u00042;jþ1. By Lemma 1, there exists a path\n\u0003Bðvk\u00042;j; vk\u00042;jþ1Þ in B of length at least 2k\u0004 3. The path\nobtained by joining \u0003ðs; eÞ to \u0003Bðvk\u00042;j; vk\u00042;jþ1Þ over\nðvk\u00043;j; vk\u00043;jþ1Þ has length at least k2 \u0004 4\u0004 \u0002.\nSubcase a.2. The node s is in A, and the node e is in X.\nChoose v1;i such that v1;i is odd if and only if s is even\nand v2;i 6¼ e (a simple counting argument yields that such\na node v1;i exists). By Lemma 1, there exists a path\n\u0003Aðs; v1;iÞ in A of length at least 2k\u0004 3. By Lemma 2,\nthere exists a path \u0003Xðv2;i; eÞ in X of length kðk\u0004 4Þ \u0004 \u0002.\nLet \u0003ðs; eÞ be the path\n\u0003Aðs; v1;iÞ; ðv1;i; v2;iÞ; \u0003Xðv2;i; eÞ:\nA simple counting argument yields that \u0003ðs; eÞ contains\nat least two nonincident links on row k\u0004 3; without loss\nof generality, let ðvk\u00043;j; vk\u00043;jþ1Þ be a link of \u0003ðs; eÞ such\nthat vk\u00042;j 6¼ f1 6¼ vk\u00042;jþ1. By Lemma 1, there exists a\npath \u0003Bðvk\u00042;j; vk\u00042;jþ1Þ in B of length at least 2k\u0004 3. The\npath obtained by joining \u0003ðs; eÞ to \u0003Bðvk\u00042;j; vk\u00042;jþ1Þ over\nðvk\u00043;j; vk\u00043;jþ1Þ has length at least k2 \u0004 4\u0004 \u0002.\nSubcase a.3. The node s is in A, and the node e is in B.\nChoose v1;i such that v1;i is odd if and only if s is even\nand v1;i 6¼ s. By Lemma 1, there exists a path \u0003Aðs; v1;iÞ in\nA of length at least 2k\u0004 3. Choose vk\u00042;j such that vk\u00042;j is\nodd if and only if e is even and f1 6¼ vk\u00042;j. By Lemma 1,\nthere exists a path \u0003Bðvk\u00042;j; eÞ in B of length at least\n2k\u0004 3. By Lemma 2, there exists a path \u0003Xðv2;i; vk\u00043;jÞ in\nX of length kðk\u0004 4Þ \u0004 \u0002. The path\n\u0003Aðs; v1;iÞ; ðv1;i; v2;iÞ; \u0003Xðv2;i; vk\u00043;jÞ; ðvk\u00043;j; vk\u00042;jÞ;\n\u0003Bðvk\u00042;j; eÞ\nhas length at least k2 \u0004 4\u0004 \u0002.\nSubcase a.4. The nodes s and e both lie in X.\nBy Lemma 2, there exists a path \u0003Xðs; eÞ in X of length\nkðk\u0004 4Þ \u0004 \u0002. A simple counting argument yields that\n\u0003Xðs; eÞ always contains at least one link on row 2 and\nalso that there are two nonincident links on row k\u0004 3,\nunless we have the special situation where k ¼ 6, s and e\nhave a common neighbor on row k\u0004 3with this neighbor\nnot lying on \u0003Xðs; eÞ, and neither s nor e is adjacent on\n\u0003Xðs; eÞ to a node on row k\u0004 3. Suppose that there are two\nnonincident links on row k\u0004 3.Without loss of generality,\nlet ðvk\u00043;j; vk\u00043;jþ1Þ and ðv2;i; v2;iþ1Þ be links of \u0003Xðs; eÞ,\nwhere vk\u00042;j 6¼ f1 6¼ vk\u00042;jþ1. By Lemma 1, there exists a\npath \u0003Bðvk\u00042;j; vk\u00042;jþ1Þ (respectively, \u0003Aðv1;i; v1;iþ1Þ) in B\n(respectively, A) of length at least 2k\u0004 3. Without loss of\ngenerality, suppose that the nodes vk\u00043;j, vk\u00043;jþ1, v2;i, and\nv2;iþ1 come in thatorder aswemovealong thepath\u0003Xðs; eÞ.\nThe path\n\u0003Xðs; vk\u00043;jÞ; ðvk\u00043;j; vk\u00042;jÞ; \u0003Bðvk\u00042;j; vk\u00042;jþ1Þ;\nðvk\u00042;jþ1; vk\u00043;jþ1Þ; \u0003Xðvk\u00043;jþ1; v2;iÞ; ðv2;i; v1;iÞ;\n\u0003Aðv1;i; v1;iþ1Þ; ðv1;iþ1; v2;iþ1Þ; \u0003Xðv2;iþ1; eÞ\nhas length at least k2 \u0004 4\u0004 \u0002.\nAlternatively, suppose that we are in the special\nsituation described above (and so, k ¼ 6). Without loss of\ngenerality, suppose that s ¼ v3;0 and e ¼ v3;2, so the path\nðv3;3; v3;4Þ; ðv3;4; v3;5Þ is a subpath of \u0003Xðs; eÞ. If f1 6¼ v4;4,\nthen we can find two links ðv3;j; v3;jþ1Þ and ðv2;i; v2;iþ1Þ of\n\u0003Xðs; eÞ, as above, and so obtain our path as required.\nTherefore, suppose that f1 ¼ v4;4. Let \u0003Bðv4;3; v4;5Þ be\nthe path\nðv4;3; v4;2Þ; ðv4;2; v4;1Þ; ðv4;1; v4;0Þ; ðv4;0; v4;5Þ;\nand join \u0003Xðs; eÞ to \u0003Bðv4;3; v4;5Þ over ðv3;3; v3;4Þ; ðv3;4; v3;5Þ\nto obtain the path \u0003ðs; eÞ of length 16\u0004 \u0002. We can now\njoin \u0003ðs; eÞ to the cycle induced by the nodes on row 5\nover two appropriate links and to an appropriate path\n\u0003Aðv1;i; v1;iþ1Þ in A of length at least 9, as we did above, to\nobtain our required path of length at least 32\u0004 \u0002 (that\nis, k2 \u0004 4\u0004 \u0002).\nThe remaining subcases are essentially identical to\nthose already considered.\nCase b. Qk2 is partitioned into four row tori.\nIf s and e lie inA [X [B, thenby the analysis for case a,\nthere is a path \u0003ðs; eÞ in A [X [B (and the connecting\ncolumn links) of length at least kðq þ 2Þ \u0004 4\u0004 \u0002 (note that\nall paths constructed in case a actually lie in the row torus\ninduced by A [X [B). A simple counting argument\nyields that there is at least one link of \u0003ðs; eÞ on row q þ 1 or\non row 0; without loss of generality, suppose that it is\nrow q þ 1 and let ðvqþ1;j; vqþ1;jþ1Þ be such a link. By\nLemma 2, there exists a path \u0003Y ðvqþ2;j; vqþ2;jþ1Þ in Y of\nlengthkðk\u0004 1\u0004 q \u0004 1Þ \u0004 1. Join\u0003ðs; eÞ to\u0003Y ðvqþ2;j; vqþ2;jþ1Þ\nover ðvqþ1;j; vqþ1;jþ1Þ to obtain a path of length at least\nk2 \u0004 4\u0004 \u0002. A similar argument holds should s and e lie in\nB [ Y [A.\nNecessarily, the only remaining case is when s lies in\nX and e lies in Y . Let v0;i be such that s and e do not lie\non column i and v0;i is odd if and only if e is odd. By\nLemma 2, there exists a path \u0003Y ðvk\u00041;i; eÞ in Y of length\nkðk\u0004 1\u0004 q \u0004 1Þ \u0004 1. Let v1;j be such that s does not lie\non column j and v1;j is odd if and only if s is odd. By\nLemma 2, there exists a path \u0003Xðs; v2;jÞ in X of length\nkðq \u0004 2Þ \u0004 1. By Lemma 1, there exists a path \u0003Aðv1;j; v0;iÞ\nin A of length at least 2k\u0004 2\u0004 \u0002. Let \u0003ðs; eÞ be the path\n\u0003Xðs; v2;jÞ; ðv2;j; v1;jÞ; \u0003Aðv1;j; v0;iÞ; ðv0;i; vk\u00041;iÞ; \u0003Y ðvk\u00041;i; eÞ:\nNecessarily, there are at least two nonincident links of\n\u0003Xðs; v2;jÞ on row q \u0004 1; without loss of generality, let\nðvq\u00041;m; vq\u00041;mþ1Þ be such a link with vq;m 6¼ f1 6¼ vq;mþ1.\nBy Lemma 1, there exists a path \u0003Bðvq;m; vq;mþ1Þ in B of\nlength 2k\u0004 3. The path obtained by joining \u0003ðs; eÞ to\n\u0003Bðvq;m; vq;mþ1Þ over ðvq\u00041;m; vq\u00041;mþ1Þ has length at least\nk2 \u0004 4\u0004 \u0002. The result follows. tu\n1076 IEEE TRANSACTIONS ON PARALLEL AND DISTRIBUTED SYSTEMS, VOL. 19, NO. 8, AUGUST 2008\nAuthorized licensed use limited to: University of Durham. Downloaded on July 1, 2009 at 10:58 from IEEE Xplore.  Restrictions apply.\nWe deal with the case when k ¼ 4 later (as we do also for\nsubsequent propositions).\nThe next proposition deals with the next scenario in the\nbase case.\nProposition 4. Consider the k-ary 2-cube Qk2, where k \u0002 6 is\neven and where one of the nodes is faulty. Let s and e be any\ntwo distinct nonfaulty nodes. There is a path of length at least\nk2 \u0004 3 (respectively, k2 \u0004 4) from s to e if fs; eg is odd\n(respectively, even).\nProof. The proof is a much simplified version of the proof of\nProposition 3. Essentially, we partition Qk2 into two row\ntori, A ¼ rtð0; 1Þ and X ¼ rtð2; k\u0004 1Þ, and follow the\nconstructions in subcases a.1, a.2, and a.4 of Case a. The\nresult follows. tu\nWe now consider when there are only faulty links in Qk2,\nbut first, we construct some basic Hamiltonian circuits on\nrow tori. Consider the row torus rtð0; p\u0004 1Þ in Qk2, for\nsome even p, where 2 \u0003 p \u0003 k\u0004 1. For every even\ni 2 f0; 1; . . . ; p\u0004 2g, build the following cycle Ci:\nðvi;0; vi;1Þ; ðvi;1; vi;2Þ; . . . ; ðvi;k\u00042; vi;k\u00041Þ; ðvi;k\u00041; viþ1;k\u00041Þ;\nðviþ1;k\u00041; viþ1;k\u00042Þ; . . . ; ðviþ1;1; viþ1;0Þ; ðviþ1;0; vi;0Þ:\nJoin the cycle C0 to the cycle C2 over the links ðv1;0; v1;1Þ and\nðv2;0; v2;1Þ and denote the resulting cycle by E0;0. Now, join\nE0;0 to the cycle C4 over the links ðv3;0; v3;1Þ and ðv4;0; v4;1Þ\nand denote the resulting cycle by E0;0 also. Proceed in this\nway to obtain the Hamiltonian cycle E0;0 of the row torus\nrtð0; p\u0004 1Þ rooted at v0;0.\nIf 3 \u0003 p \u0003 k\u0004 1 is odd, then build the cycle E0;0 in the\nrow torus rtð0; p\u0004 2Þ and join it to the cycle induced by the\nnodes on row p\u0004 1 over the links ðvp\u00042;0; vp\u00042;1Þ and\nðvp\u00041;0; vp\u00041;1Þ. Denote the resulting cycle as the cycle E0;0\nof rtð0; p\u0004 1Þ rooted at v0;0. The Hamiltonian cycle E0;0 in\nrtð0; 6Þ in Q72 can be visualized as in Fig. 5.\nNote that we also have the Hamiltonian cycles E0;i of\nrtð0; p\u0004 1Þ, for all p 2 f2; 3; . . . ; kg and i 2 f1; 2; . . . ; k\u0004 1g,\nobtained by starting the above process at the root node v0;i\nas opposed to node v0;0.\nProposition 5. Consider the k-ary 2-cube Qk2, where k \u0002 6 is\neven and where there is one faulty link. Let s and e be any\ntwo distinct nodes in the row torus rtð0; p\u0004 1Þ, where\n2 \u0003 p \u0003 k. There is a path in rtð0; p\u0004 1Þ from s to e of\nlength pk\u0004 1 (respectively, pk\u0004 2) if fs; eg is odd (respec-\ntively, even).\nProof. By Lemma 2, we may assume that the faulty link lies\nin rtð0; p\u0004 1Þ. Without loss of generality, we may assume\nthat the faulty link is either ðva;0; vaþ1;0Þ or ðva;0; va;1Þ,\nwhere 0 \u0003 a \u0003 p\u0004 2. As before, \u0002 ¼ 1 if fs; eg is odd, and\n\u0002 ¼ 2 if fs; eg is even.\nCase a. a ¼ 0, and the faulty link is ðv0;0; v1;0Þ.\nSubcase a.1. s and e lie on row 0.\nIf s ¼ v0;i and e ¼ v0;j, then without loss of generality,\nwe may assume that i < j and that it is not the case that\ni ¼ 0 and j ¼ k\u0004 1.\nSuppose that it is not the case that i ¼ 1 and j ¼ k\u0004 1.\nLet \u00030ðs; eÞ be the path\nðs; v0;i\u00041Þ; ðv0;i\u00041; v0;i\u00042Þ; . . . ; ðv0;jþ1; eÞ:\nNote that the length of \u00030ðs; eÞ is odd if and only if fs; eg\nis odd, so there are an even number of nodes on row 0\nthat are not on \u00030ðs; eÞ if and only if fs; eg is odd. Let C\nbe the cycle induced by the nodes on row 1. Iteratively\njoin C to appropriate links ðv0;l; v0;lþ1Þ over ðv1;l; v1;lþ1Þ so\nthat the nodes used on row 0 do not already appear on\n\u00030ðs; eÞ. Links should be replaced (by paths) so that if\nfs; eg is odd (respectively, even), then every node of\nrtð0; 1Þ appears on the (amended) cycle C or on \u00030ðs; eÞ\n(respectively, except one). Join \u00030ðs; eÞ to C over two\ncorresponding links (this is always possible) and denote\nthe new path by \u0003Aðs; eÞ. The path \u0003Aðs; eÞ has length\n2k\u0004 \u0002. This construction can be visualized in Fig. 6,\nwhere the dashed links show how \u00030ðs; eÞ is joined to the\namended C.\nSuppose that i ¼ 1 and j ¼ k\u0004 1. Let \u00030ðs; eÞ be\nthe path\nðs; v0;2Þ; ðv0;2; v0;3Þ; . . . ; ðv0;k\u00042; eÞ:\nLet C be the cycle induced by the nodes on row 1. Join\n\u00030ðs; eÞ to C over ðv0;1; v0;2Þ and ðv1;1; v1;2Þ and denote the\nnew path by \u0003Aðs; eÞ. The path \u0003Aðs; eÞ has length 2k\u0004 2.\nIf p ¼ 2, then we are done. If p > 3, then let D be the\nHamiltonian cycle E2;0 in the row torus rtð2; p\u0004 1Þ, and if\np ¼ 3, then let D be the cycle induced by the nodes on\nrow 2. Join \u0003Aðs; eÞ to D over two corresponding links,\nand the resulting path is as required.\nSubcase a.2. s lies on row 0, and e lies on row 1.\nLet s ¼ v0;i and e ¼ v1;j; without loss of generality, we\nmay assume that i 6¼ k\u0004 1. If i 6¼ 1, then let e0 be a\nneighbor of s on row 0 that does not lie in the same\ncolumn as e. If i ¼ 1 and j 6¼ 2, then let e0 ¼ v0;2. Either\nSTEWART AND XIANG: EMBEDDING LONG PATHS IN K-ARY N-CUBES WITH FAULTY NODES AND LINKS 1077\nFig. 5. The Hamiltonian cycle E0;0 in rtð0; 6Þ in Q72.\nFig. 6. Joining \u00030ðs; eÞ to the amended cycle C.\nAuthorized licensed use limited to: University of Durham. Downloaded on July 1, 2009 at 10:58 from IEEE Xplore.  Restrictions apply.\nway, let \u00030ðs; e0Þ be a path on row 0 of length k\u0004 1. If\ni ¼ 1 and j ¼ 2, then let e0 ¼ v0;3 and let \u00030ðs; e0Þ be a path\non row 0 of length k\u0004 2.\nLet s0 be the neighbor of e0 on row 1 and let \u00031ðs0; eÞ be\na path on row 0 that contains the link ðv1;0; v1;1Þ. Define\nthe path \u0003Aðs; eÞ as\n\u00030ðs; e0Þ; ðe0; s0Þ; \u00031ðs0; eÞ:\nIteratively join \u0003Aðs; eÞ to appropriate links ðv1;l; v1;lþ1Þ\nover ðv0;l; v0;lþ1Þ so that the nodes used on row 1 do not\nalready appear on \u0003Aðs; eÞ. Links should be replaced\n(by paths) so that if fs; eg is odd (respectively, even),\nthen every node of rtð0; 1Þ appears on (the amended)\n\u0003Aðs; eÞ (respectively, except one).\nIf p ¼ 2, then we are done. If p > 3, then let D be the\nHamiltonian cycle E2;0 in the row torus rtð2; p\u0004 1Þ, and if\np ¼ 3, then let D be the cycle induced by the nodes on\nrow 2. Join \u0003Aðs; eÞ to D over the links ðv1;0; v1;1Þ and\nðv2;0; v2;1Þ. The resulting path is as required.\nNote that if p ¼ 2, then we have covered all cases, so\nhenceforth, we assume that p \u0002 3.\nSubcase a.3. s lies on row 0, and e lies on rows\n2; 3; . . . ; p\u0004 1.\nSuppose that s ¼ v0;i. If i 6¼ 1, then define e0 ¼ v0;i\u00041,\nand if i ¼ 1, then define e0 ¼ v0;iþ1. Define the path\n\u00030ðs; e0Þ to be the path on row 0 of length k\u0004 1. Let e00 be\nthe neighbor of e0 on row 1, and let e000 be a neighbor of e00\non row 1 that does not lie in the same column as e. Define\nthe path \u00031ðe00; e000Þ as the path of length k\u0004 1 on row 1.\nDefine the path \u0003Aðs; e000Þ as\n\u00030ðs; e0Þ; ðe0; e00Þ; \u00031ðe00; e000Þ:\nThe path \u0003Aðs; e000Þ has length 2k\u0004 1.\nLet s0 be the neighbor of e000 on row 2. If p \u0002 4, then by\nLemma 2, there is a path \u0003Xðs0; eÞ in rtð2; p\u0004 1Þ of length\nkðp\u0004 2Þ \u0004 \u0002, and the path\n\u0003Aðs; e000Þ; ðe000; s0Þ; \u0003Xðs0; eÞ\nis as required. If p ¼ 3, then define the path \u0003Xðs0; eÞ to be\na path on row 2 and let \u0003ðs; eÞ be the path\n\u0003Aðs; e000Þ; ðe000; s0Þ; \u0003Xðs0; eÞ:\nIteratively join \u0003ðs; eÞ to appropriate links ðv2;l; v2;lþ1Þ\nover ðv1;l; v1;lþ1Þ so that the nodes used on row 2 do not\nalready appear on \u0003ðs; eÞ. Links should be replaced (by\npaths) so that if fs; eg is odd (respectively, even), then\nevery node of row 2 appears on the amended path\n(respectively, except one). The resulting path is as\nrequired.\nSubcase a.4. s and e lie on row 1.\nProceed as in subcase a.1 to build a path (analogous\nto) \u0003Aðs; eÞ. The path \u0003Aðs; eÞ is such that it contains a link\non row 1. Join \u0003Aðs; eÞ to the cycle D, as constructed in\nsubcase a.1 and over corresponding links, to obtain a\nrequired path.\nSubcase a.5. s lies on rows 1; 2; . . . ; p\u0004 1, and e lies on\nrows 2; 3; . . . ; p\u0004 1.\nBy Lemma 2, there exists a path \u0003ðs; eÞ in rtð1; p\u0004 1Þ of\nlength ðp\u0004 1Þk\u0004 \u0002. There is at least one link of \u0003ðs; eÞ on\nrow 1 that is not incident with v1;0. Join \u0003ðs; eÞ to the cycle\ninduced by the nodes on row 0 over two corresponding\nlinks to obtain a required path.\nCase b. 0 6¼ a 6¼ p\u0004 2, and the faulty link is ðva;0; vaþ1;0Þ.\nSubcase b.1. s and e lie on rows 0; 1; . . . ; a.\nBy Lemma 2, there is a path \u0003Aðs; eÞ in rtð0; aÞ of\nlength ðaþ 1Þk\u0004 \u0002. Either there exist two disjoint links of\n\u0003Aðs; eÞ on row a, and so, we have a link of \u0003Aðs; eÞ on\nrow a that is not incident with va;0, or k ¼ 6, and the\nnodes va;2; va;3; va;4 constitute s, e, and a node not on\n\u0003Aðs; eÞ. However, in this latter case, let E0;0 be the\nHamiltonian cycle in rtð0; aÞ but with the subpath from s\nto e involving (some of) the nodes va;2; va;3; va;4 removed\n(therefore, the length of this subpath is one if fs; eg is odd\nand two if fs; eg is even). Either way, we obtain a path,\ncall it \u0003Aðs; eÞ, in rtð0; aÞ of length ðaþ 1Þk\u0004 \u0002 with the\nproperty that there is a link of \u0003Aðs; eÞ on row a that is not\nincident with va;0.\nJoin \u0003Aðs; eÞ to the Hamiltonian cycle Eaþ1;0 of\nrtðaþ 1; p\u0004 1Þ over some appropriate links, and the\npath obtained is as required.\nSubcase b.2. s lies on rows 0; 1; . . . ; a, and e lies on\nrows aþ 1; aþ 2; . . . ; p\u0004 1.\nSuppose that we can choose e0 on row a such that\nva;0 6¼ e0 6¼ s, e and e0 are not adjacent, and fs; e0g ¼ fs; eg.\nIf so, then by Lemma 2, there is a path \u0003Aðs; e0Þ in rtð0; aÞ\nof length ðaþ 1Þk\u0004 \u0002 so that e is not adjacent to e0. Define\ns0 to be the neighbor of e0 on row aþ 1. By Lemma 2,\nthere is a path \u0003Xðs0; eÞ in rtðaþ 1; p\u0004 1Þ of length\nðp\u0004 a\u0004 1Þk\u0004 1. The path\n\u0003Aðs; e0Þ; ðe0; s0Þ; \u0003Xðs0; eÞ\nis as required.\nAlternatively, suppose that e0 does not exist. This only\nhappens when k ¼ 6, and (s ¼ va;2 and e ¼ vaþ1;4) or\n(s ¼ va;4 and e ¼ vaþ1;2). Define e0 ¼ va;3 and let E0;0 be\nthe Hamiltonian cycle in rtð0; aÞ with the link ðs; e0Þ\nremoved; call this path \u0003Aðs; e0Þ. By Lemma 2, there\nis a path \u0003Xðvaþ1;3; eÞ in rtðaþ 1; p\u0004 1Þ of length\nðp\u0004 a\u0004 1Þk\u0004 1. The path\n\u0003Aðs; e0Þ; ðe0; vaþ1;3Þ; \u0003Xðvaþ1;3; eÞ\nis as required.\nCase c. a ¼ 0, and the faulty link is ðv0;0; v0;1Þ.\nSubcase c.1. s and e lie on row 0.\nLet \u00030ðs; eÞ be the path on row 0 that contains the\nfaulty link ðv0;0; v0;1Þ and let C be the cycle induced by the\nnodes on row 1. Join \u00030ðs; eÞ to C over the links ðv0;0; v0;1Þ\nand ðv1;0; v1;1Þ and denote the resulting path by \u0003ðs; eÞ.\nIteratively join \u0003ðs; eÞ to appropriate links ðv0;l; v0;lþ1Þ\nover ðv1;l; v1;lþ1Þ so that the nodes used on row 0 do not\nalready appear on \u0003ðs; eÞ. Links should be replaced (by\npaths) so that if fs; eg is odd (respectively, even), then\nevery node of row 0 appears on the amended path\n(respectively, except one). Denote the amended path by\n\u0003ðs; eÞ also.\nIf p > 3, then let D be the Hamiltonian cycle E2;0 in\nrtð2; p\u0004 1Þ, and if p ¼ 3, then let D be the cycle induced\nby the nodes of row 2. Joining \u0003ðs; eÞ to D over\ntwo corresponding links yields a path as required.\n1078 IEEE TRANSACTIONS ON PARALLEL AND DISTRIBUTED SYSTEMS, VOL. 19, NO. 8, AUGUST 2008\nAuthorized licensed use limited to: University of Durham. Downloaded on July 1, 2009 at 10:58 from IEEE Xplore.  Restrictions apply.\nSubcase c.2. s lies on row 0, and e lies on row 1.\nSuppose that s ¼ v0;i and e ¼ v1;j. Without loss of\ngenerality, we may assume that i is odd.\nIf fs; eg is odd and 1 \u0003 j < i, then define \u0003ðs; eÞ as\nCþ0 ðs; v1;iÞ; Z\u0004ðv1;i; v1;jþ2Þ; ðv1;jþ2; v1;jþ1Þ; ðv1;jþ1; v0;jþ1Þ;\nðv0;jþ1; v0;jÞ; C\u00041 ðv0;j; eÞ:\nIf fs; eg is odd and i < j \u0003 k\u0004 1, then define \u0003ðs; eÞ as\nC\u00041 ðs; v1;iÞ; Zþðv1;i; v1;j\u00042Þ; ðv1;j\u00042; v1;j\u00041Þ; ðv1;j\u00041; v0;j\u00041Þ;\nðv0;j\u00041; v0;jÞ; Cþk\u00041ðv0;j; eÞ:\nIf fs; eg is odd and i ¼ j, then define \u0003ðs; eÞ as Cþ0 ðs; eÞ,\nand if i 6¼ 1, then define C as the cycle\nC\u00041 ðv0;i\u00041; v1;i\u00041Þ; ðv1;i\u00041; v0;i\u00041Þ:\nIf fs; eg is even and 2 \u0003 j < i, then define \u0003ðs; eÞ as\nCþ0 ðs; v1;iÞ; Z\u0004ðv1;i; v1;jþ3Þ; ðv1;jþ3; v1;jþ2Þ; ðv1;jþ2; v0;jþ2Þ;\nðv0;jþ2; v0;jþ1Þ; ðv0;jþ1; v0;jÞ; C\u00040 ðv0;j; eÞ:\nIf fs; eg is even and j ¼ 0, then define \u0003ðs; eÞ as\nC\u00041 ðs; v1;iÞ; Zþðv1;i; v1;k\u00041Þ; ðv1;k\u00041; eÞ:\nIf fs; eg is even and i < j \u0003 k\u0004 1, then define \u0003ðs; eÞ as\nC\u00041 ðs; v1;iÞ; Zþðv1;i; v1;j\u00043Þ; ðv1;j\u00043; v1;j\u00042Þ; ðv1;j\u00042; v1;j\u00041Þ;\nðv1;j\u00041; v0;j\u00041Þ; ðv0;j\u00041; v0;jÞ; Cþ0 ðv0;j; eÞ:\nIf p > 3, then let D be the Hamiltonian cycle E2;0 of\nrtð2; p\u0004 1Þ, and if p ¼ 3, then let D be the cycle induced\nby the nodes on row 2. If there is a cycle C, then join C\nand D over two corresponding links and denote the\nnew cycle by D also. Now, join \u0003ðs; eÞ to the cycle D, and\nthe path obtained is as required.\nSubcase c.3. s lies on row 0, and e lies on\nrows 2; 3; . . . ; p\u0004 1.\nSuppose that p > 3. If fs; eg is even, then let the\nnode e0 on row 1 be such that e0 and s have a common\nneighbor on row 0 and also such that e0 does not lie on\nthe same column as e. If fs; eg is odd, then let e0 be the\nneighbor of s on row 1. By the construction in\nsubcase c.2, there is a path \u0003Aðs; e0Þ in rtð0; 1Þ of\nlength 2k\u0004 \u0002.\nLet s0 be the neighbor of e0 on row 2 (note that s0 6¼ e\nand that fs0; eg is odd). By Lemma 2, there is a path\n\u0003Xðs0; eÞ in rtð2; p\u0004 1Þ of length ðp\u0004 2Þk\u0004 1. The path\n\u0003Aðs; e0Þ; ðe0; s0Þ; \u0003Xðs0; eÞ\nis as required.\nSuppose that p ¼ 3. Let s0 be a neighbor of e on row 2\nso that s0 does not lie on the same column as s and let e0\nbe the neighbor of s0 on row 2. By the construction in\nsubcase c.2, there is a path \u0003Aðs; e0Þ in rtð0; 1Þ of length\n2k\u0004 \u0002. Let \u0003Xðs0; eÞ be the path on row 2 of length k\u0004 1.\nThe path\n\u0003Aðs; e0Þ; ðe0; s0Þ; \u0003Xðs0; eÞ\nis as required.\nSubcase c.4. s and e lie on row 1.\nLet s ¼ v1;i and e ¼ v1;j; without loss of generality,\nwemay assume that i < j. Let \u00031ðs; eÞ be the path on row 1\ncontaining the link ðv1;0; v1;1Þ. Join \u00031ðs; eÞ to the cycle\ninduced by the nodes on row0over the links ðv1;0; v1;1Þ and\nðv0;0; v0;1Þ and denote the resulting path by \u0003Aðs; eÞ.\nIteratively join \u0003Aðs; eÞ to appropriate links ðv1;l; v1;lþ1Þ\nover ðv0;l; v0;lþ1Þ so that the nodes used on row 1 do not\nalready appear on \u0003Aðs; eÞ. Links should be replaced (by\npaths) so that iffs; eg isodd(respectively, even), thenevery\nnode of row 1 appears on the amended path (respectively,\nexcept one). Denote the amended path by \u0003ðs; eÞ.\nIf p \u0002 4, then let D be the Hamiltonian cycle E2;1 of\nrtð2; p\u0004 1Þ, and if p ¼ 3, then letD be the cycle induced by\nthenodesonrow2. Join\u0003ðs; eÞ toDover twocorresponding\nlinks, and the resulting path is as required.\nSubcase c.5. s lies on row 1, and e lies on rows\n2; 3; . . . ; p\u0004 1.\nSuppose that p \u0002 4. Let e0 be a neighbor of s on row 1\nsuch that e does not lie on the same column as e0. We\nnow define a path \u0003Aðs; e0Þ in rtð0; 1Þ. If s ¼ v1;1 and\ne0 ¼ v1;0, then define \u0003Aðs; e0Þ as\nNþðs; v1;k\u00041Þ; ðv1;k\u00041; v0;k\u00041Þ; ðv0;k\u00041; v0;0Þ; ðv0;0; e0Þ;\nand if s ¼ v1;0 and e0 ¼ v1;1, then define \u0003Aðs; e0Þ as\nN\u0004ðs; v1;2Þ; ðv1;2; v0;2Þ; ðv0;2; v0;1Þ; ðv0;1; e0Þ:\nOtherwise, let \u00031ðs; e0Þ be the path on row 1 containing\nthe link ðv1;0; v1;1Þ and join \u00031ðs; e0Þ to the cycle induced\nby the nodes on row 0 (which contains the faulty link)\nover the links ðv1;0; v1;1Þ and ðv0;0; v0;1Þ, denoting the\nresulting path by \u0003Aðs; e0Þ (joining as we do results in the\npath \u0003Aðs; e0Þ being fault free).\nLet s0 be the neighbor of e0 on row 2. By Lemma 2,\nthere is a path \u0003Xðs0; eÞ in rtð2; p\u0004 1Þ of length\nðp\u0004 2Þk\u0004 \u0002. The path\n\u0003Aðs; e0Þ; ðe0; s0Þ; \u0003Xðs0; eÞ\nis as required.\nSuppose that p ¼ 3. Let e0 be a node on row 1 such that\ns 6¼ e0 and e0 is in a column adjacent to the column on\nwhich e lies. Clearly, fs; eg is odd if and only if fs; e0g\nis odd. We now build a path \u0003Aðs; e0Þ in rtð0; 1Þ;\nwithout loss of generality, we may assume that s ¼ v1;i,\ne0 ¼ vi;j, and i < j, with i 6¼ 0 (as usual, we can apply\nautomorphisms of rtð0; 1Þ if necessary). If fs; eg is odd\nand i 6¼ 1, then define \u0003Aðs; e0Þ as\nC\u00041 ðs; v0;iÞ; Zþðv0;i; v0;j\u00041Þ; ðv0;j\u00041; v0;jÞ; Cþ0 ðv0;j; e0Þ:\nIf fs; eg is odd and i ¼ 1, then define \u0003Aðs; e0Þ as\nNþðs; v1;j\u00041Þ; ðv1;j\u00041; v0;j\u00041Þ; ðv0;j\u00041; v0;jÞ; Cþ0 ðv0;j; e0Þ:\nIf fs; eg is even and s 6¼ 1, then define \u0003Aðs; e0Þ as\nC\u00041 ðs; v0;iÞ; Zþðv0;i; v0;j\u00042Þ; ðv0;j\u00042; v0;j\u00041Þ; ðv0;j\u00041; v0;jÞ;\nCþ0 ðv0;j; e0Þ:\nIf fs; eg is even and s ¼ 1, then define \u0003Aðs; e0Þ as\nNþðs; v1;j\u00042Þ; ðv1;j\u00042; v0;j\u00042Þ; ðv0;j\u00042; v0;j\u00041Þ; ðv0;j\u00041; v0;jÞ;\nCþ0 ðv0;j; e0Þ:\nSTEWART AND XIANG: EMBEDDING LONG PATHS IN K-ARY N-CUBES WITH FAULTY NODES AND LINKS 1079\nAuthorized licensed use limited to: University of Durham. Downloaded on July 1, 2009 at 10:58 from IEEE Xplore.  Restrictions apply.\nLet s0 be the neighbor of e0 on row 2 and let \u0003Xðs0; eÞ be\nthe path on row 2 of length k\u0004 1. The path\n\u0003Aðs; e0Þ; ðe0; s0Þ; \u0003Xðs0; eÞ\nis as required.\nSubcase c.6. s and e lie on rows 2; 3; . . . ; p\u0004 1.\nSuppose that p \u0002 4. By Lemma 2, there is a path\n\u0003Xðs; eÞ in rtð2; p\u0004 1Þ of length ðp\u0004 2Þk\u0004 \u0002. Let C be the\ncycle\nC\u00041 ðv1;0; v0;0Þ; ðv0;0; v1;0Þ:\nJoining \u0003Xðs; eÞ to C over two corresponding links yields\na required path.\nSuppose that p ¼ 3. If (s ¼ v2;0 and e ¼ v2;1) or (e ¼ v2;0\nand s ¼ v2;1), then let \u0003Xðs; eÞ be the path on row 2 of\nlength k\u0004 1; otherwise, let \u0003Xðs; eÞ be the path on row 2\nnot containing the link ðv2;0; v2;1Þ. Join \u0003Xðs; eÞ to C over\ntwo corresponding links and denote the resulting path\nby \u0003ðs; eÞ.\nIf (s ¼ v2;0 and e ¼ v2;1) or (e ¼ v2;0 and s ¼ v2;1), then\n\u0003ðs; eÞ is as required. Otherwise, iteratively join \u0003ðs; eÞ to\nappropriate links ðv2;l; v2;lþ1Þ over ðv1;l; v1;lþ1Þ so that the\nnodes used on row 2 do not already appear on \u0003ðs; eÞ.\nLinks should be replaced (by paths) so that if fs; eg is\nodd (respectively, even), then every node of row 2\nappears on the amended path (respectively, except one).\nThe path so obtained is as required.\nCase d. The faulty link is ðva;0; vaþ1;0Þ, where\n1 \u0003 a \u0003 p\u0004 3.\nSubcase d.1. s and e lie on rows 0; 1; . . . ; aþ 1.\nBy case c, there is a path \u0003Aðs; eÞ in rtð0; aþ 1Þ of\nlength ðaþ 2Þk\u0004 \u0002. If a 6¼ p\u0004 3, then let C be the\nHamiltonian cycle Eaþ2;0 of rtðaþ 2; p\u0004 1Þ, and if\na ¼ p\u0004 3, then let C be the cycle induced by the nodes\non row p\u0004 1. Joining \u0003Aðs; eÞ and C over two corre-\nsponding links yields a path as required.\nSubcase d.2. s lies on rows 0; 1; . . . ; aþ 1, and e lies on\nrows aþ 2; aþ 3; . . . ; p\u0004 1.\nSuppose that a 6¼ p\u0004 3. Let the node e0 on row aþ 1\nbe such that s 6¼ e0 and fs; eg ¼ fs; e0g. By case c, there is\na path \u0003ðs; e0Þ in rtð0; aþ 1Þ of length ðaþ 2Þk\u0004 \u0002. Let s0\nbe the node on row aþ 2 adjacent to e0. By Lemma 2,\nthere is a path \u0003Xðs0; eÞ in rtðaþ 2; p\u0004 1Þ of length\nðp\u0004 a\u0004 2Þk\u0004 1. The path\n\u0003Aðs; e0Þ; ðe0; s0Þ; \u0003Xðs0; eÞ\nis as required.\nSuppose that a ¼ p\u0004 3. Let the node e0 on row aþ 1\nbe such that e0 6¼ s and e0 lies on a column adjacent to the\ncolumn on which e lies. By case c, there is a path \u0003ðs; e0Þ\nin rtð0; p\u0004 2Þ of length ðp\u0004 1Þk\u0004 \u0002. Let s0 be the\nneighbor of e0 on row p\u0004 1 and let \u0003Xðs0; eÞ be the\npath of length k\u0004 1 on row p\u0004 1. The path\n\u0003Aðs; e0Þ; ðe0; s0Þ; \u0003Xðs0; eÞ\nis as required. tu\nProposition 6. Consider the k-ary 2-cube Qk2, where k \u0002 6 is\neven and where two of the links are faulty. Let s and e be\nany two distinct nodes. There is a path of length k2 \u0004 1\n(respectively, k2 \u0004 2) from s to e if fs; eg is odd (respectively,\neven).\nProof. Without loss of generality, we may assume that\nðv0;0; v1;0Þ is a faulty link. Partition Qk2 into rtðk\u0004 1; 0Þ and\nrtð1; k\u0004 2Þ. As usual, \u0002 ¼ 1 if fs; eg is odd, and \u0002 ¼ 2\nif fs; eg is even.\nCase a. Both s and e lie in rtðk\u0004 1; 0Þ.\nBy Proposition 5, there is a path \u0003Aðs; eÞ in rtðk\u0004 1; 0Þ of\nlength 2k\u0004 \u0002. Either there is a link of \u0003Aðs; eÞ on row k\u0004 1\nthat is not incident with any faulty link or there is a link of\n\u0003Aðs; eÞ on row 0 that is not incident with any faulty link;\nwithout loss of generality, suppose that ðvk\u00041;i; vk\u00041;iþ1Þ is a\nlink of \u0003Aðs; eÞ such that neither ðvk\u00041;i; vk\u00042;iÞ nor\nðvk\u00041;iþ1; vk\u00042;iþ1Þ is faulty (the alternative case is similar).\nBy Proposition 5, there is a path \u0003Xðvk\u00042;i; vk\u00042;iþ1Þ in\nrtð1; k\u0004 2Þ of length ðk\u0004 2Þk\u0004 1. The path obtained by\njoining \u0003Aðs; eÞ to \u0003Xðvk\u00042;i; vk\u00042;iþ1Þ over ðvk\u00041;i; vk\u00041;iþ1Þ is\nas required.\nCase b. s lies in rtðk\u0004 1; 0Þ and e lies in rtð1; k\u0004 2Þ.\nLet ðvk\u00041;i; vk\u00042;iÞ be a healthy link such that s 6¼ vk\u00041;i,\ne 6¼ vk\u00042;i, and fs; vk\u00041;ig ¼ fs; eg. By Proposition 5, there\nis a path \u0003Aðs; vk\u00041;iÞ in rtðk\u0004 1; 0Þ of length 2k\u0004 \u0002, and\nthere is a path \u0003Xðvk\u00042;i; eÞ in rtð1; k\u0004 2Þ of length\nðk\u0004 2Þk\u0004 1. The path\n\u0003Aðs; vk\u00041;iÞ; ðvk\u00041;i; vk\u00042;iÞ; \u0003Xðvk\u00042;i; eÞ\nis as required. tu\nFinally, we deal with the case when there is one faulty\nnode and one faulty link.\nProposition 7. Consider the k-ary 2-cube Qk2, where k \u0002 6 is\neven and where there is a faulty node and a faulty link. Let s\nand e be any two distinct nonfaulty nodes. There is a path of\nlength at least k2 \u0004 3 (respectively, k2 \u0004 4) from s to e if fs; eg\nis odd (respectively, even).\nProof. Without loss of generality, we may assume that the\nfaulty node is v0;0. Moreover, we may assume that either\nthe faulty link does not lie in rtð0; 1Þ or the faulty link is\nðv0;0; v0;1Þ (again, by applying the usual automorphisms).\nHowever, if the faulty link is ðv0;0; v0;1Þ, then we can\nassume that there are no faulty links as the fact that v0;0 is\na faulty node means that the link ðv0;0; v0;1Þ is never used.\nThus, we can assume that the faulty link does not lie in\nrtð0; 1Þ. As usual, \u0002 ¼ 1 if fs; eg is odd, and \u0002 ¼ 2 if fs; eg\nis even.\nCase a. Both s and e lie in rtð0; 1Þ.\nBy Lemma 1, there is a path \u0003Aðs; eÞ in rtð0; 1Þ of\nlength at least 2k\u0004 2\u0004 \u0002. Either there is a link of \u0003Aðs; eÞ\non row 0 that is not incident with v0;0 nor a faulty link or\nthere is a link of \u0003Aðs; eÞ on row 1 that is not incident with\na faulty link. Without loss of generality, suppose that\nðv1;i; v1;iþ1Þ is a link of \u0003Aðs; eÞ that is not incident with a\nfaulty link (the alternative case is similar). By Proposition\n5, there is a path \u0003Xðv2;i; v2;iþ1Þ in rtð2; k\u0004 1Þ of length\nðk\u0004 2Þk\u0004 1. The path obtained by joining \u0003Aðs; eÞ to\n\u0003Xðv2;i; v2;iþ1Þ over ðv1;i; v1;iþ1Þ is as required.\nCase b. s lies in rtð0; 1Þ, and e lies in rtð2; k\u0004 1Þ.\nLet v1;i be such that s 6¼ v1;i, ðv1;i; v2;iÞ is healthy and\nfs; v1;ig ¼ fs; eg. By Lemma 1, there is a path \u0003Aðs; v1;iÞ in\n1080 IEEE TRANSACTIONS ON PARALLEL AND DISTRIBUTED SYSTEMS, VOL. 19, NO. 8, AUGUST 2008\nAuthorized licensed use limited to: University of Durham. Downloaded on July 1, 2009 at 10:58 from IEEE Xplore.  Restrictions apply.\nrtð0; 1Þ of length at least 2k\u0004 2\u0004 \u0002. By Proposition 5, there\nis a path \u0003Xðv2;i; eÞ in rtð2; k\u0004 1Þof length ðk\u0004 2Þk\u0004 1. The\npath\n\u0003Xðs; v1;iÞ; ðv1;i; v2;iÞ; \u0003Xðv2;i; eÞ\nis as required. tu\nFrom Propositions 3, 4, 6, and 7, we obtain the base case\nfor our main result so long as k \u0002 6. However, when k ¼ 4,\na simple computer program (implementing an exhaustive\nsearch) verifies that Propositions 3, 4, 6, and 7 all still hold\n(we leave this verification as an exercise). Hence, we have\nthe following result.\nTheorem 8. Let k \u0002 4 be even. In a faulty k-ary 2-cube Qk2 in\nwhich the number of node faults fv and the number of link\nfaults fe are such that fv þ fe \u0003 2, given any two healthy\nnodes s and e of Qk2, there is a path from s to e of length at least\nk2 \u0004 2fv \u0004 1 (respectively, k2 \u0004 2fv \u0004 2) if the nodes s and e\nhave different (respectively, the same) parities.\n4 THE INDUCTIVE STEP\nIn this section, we complete the proof by induction of our\nmain theorem. The following lemma simplifies the situation\nconsiderably.\nLemma 9. LetQkn have 2n\u0004 2 faulty nodes and links,wheren \u0002 4.\nThere exists a dimension d such that when we partitionQkn over\ndimension d, the resulting k-ary ðn\u0004 1Þ-cubes Qd;0; Qd;1; . . . ;\nQd;k\u00041 each contain at most 2n\u0004 4 faulty nodes and links.\nProof. Suppose, as our induction hypothesis, that n \u0002 5 and\nthat the result holds for Qkn\u00041 (with 2n\u0004 4 faults). Let Qkn\nhave 2n\u0004 2 faults. Partition Qkn over dimension 1; if\nthe resulting k-ary ðn\u0004 1Þ-cubes Q1;0; Q1;1; . . . ; Q1;k\u00041 are\nsuch that each contains at most 2n\u0004 4 faults, then we are\ndone. Therefore, without loss of generality, suppose that\nQ1;0 contains 2n\u0004 2 or 2n\u0004 3 faults.\nSuppose thatQ1;0 contains 2n\u0004 3 faults, and so, there is\nexactly one fault not in Q1;0. Temporarily regard some\nfault, w, say, of Q1;0 as healthy and apply the induction\nhypothesis to Q1;0 (note that wmight be a node or a link).\nThus, there is a dimension d such that when we partition\nQ1;0 over dimension d, the resulting k-ary ðn\u0004 2Þ-cubes\neach contain atmost 2n\u0004 6 faults. Consequently,whenwe\npartition Qkn over dimension d, each of the resulting\nk-ary ðn\u0004 1Þ-cubes contains at most 2n\u0004 4 faults (the\n“temporarily healthy fault” w needs to be recast as faulty,\nand there is one other fault not in Q1;0 to consider).\nSuppose that Q1;0 contains 2n\u0004 2 faults, and so, there\nare no faults outside Q1;0. Temporarily regard two faults,\nw and w0, say, of Q1;0 as healthy and apply the induction\nhypothesis to Q1;0. Thus, there is a dimension d such that\nwhen we partition Q1;0 over dimension d, the resulting\nk-ary ðn\u0004 2Þ-cubes each contain at most 2n\u0004 6 faults.\nConsequently, when we partition Qkn over dimension d,\neach of the resulting k-ary ðn\u0004 1Þ-cubes contains at most\n2n\u0004 4 faults (the two “temporarily healthy faults” w and\nw0 need to be recast as faulty).\nIn order for the result to follow by induction, all we\nneed to do is to verify the statement of the lemma for\nwhen n ¼ 4. Let the faults of Qk4 be wi, for i ¼ 1; 2; . . . ; 6.\nPartition Qk4 over dimension 1. Either each resulting k-ary\n3-cube contains at most four faults, and we are done, or\nthe nodes involved in at least five of fwi : i ¼ 1; 2; . . . ; 6g\nhave identical first components (if wi is a link, then the\nnodes involved in wi are the nodes of the link, and if wi is\na node, then the node involved in wi is the node itself).\nWe may assume that it is the latter and that the five faults\nwhose first components (of the nodes involved) are\nidentical are w1, w2, w3, w4, and w5.\nPartition Qk4 over dimension 2. Either each resulting\nk-ary 3-cube contains at most four faults, and we are\ndone, or one of the resulting k-ary 3-cubes contains either\nfive or six faults. We may assume that the second\ncomponents of w1, w2, w3, and w4 are identical.\nPartition Qk4 over dimension 3. Either each resulting\nk-ary 3-cube contains at most four faults, and we are\ndone, or one of the resulting k-ary 3-cubes contains either\nfive or six faults. We may assume that the third\ncomponents of w1, w2, and w3 are identical.\nPartition Qk4 over dimension 4. Either each resulting\nk-ary 3-cube contains at most four faults, and we are\ndone, or one of the resulting k-ary 3-cubes contains either\nfive or six faults. We may assume that the fourth\ncomponents of w1 and w2 are identical. This yields a\ncontradiction as either w1 and w2 are nodes, and w1 6¼ w2,\nor w1 or w2 is a link joining a node to itself. The\nresult follows. tu\nLet us reexamine the proof of Lemma 9. Ideally, we\nwould like Lemma 9 to apply when n ¼ 3, but the argument\nin the proof fails. However, we can classify exactly the fault\nconfigurations leading to failure.\nSuppose that Qk3 has four faulty nodes. Following\nthrough the argument in the proof of Lemma 9 yields that\nup to isomorphism, the situations where the argument fails\nis when the four faults are of the form ð0; 0; 0Þ, ða; 0; 0Þ,\nð0; b; 0Þ, and ð0; 0; cÞ, for some a, b, and c all different\nfrom zero.\nSuppose that Qk3 has three faulty nodes and one faulty\nlink. Without loss of generality, suppose that the faulty\nlink lies in dimension 1. Following the argument in\nLemma 9 yields that up to isomorphism, the situations\nwhere the argument fails is when the three faulty nodes\nare of the form ð0; 0; 0Þ, ð0; b; 0Þ, and ð0; 0; cÞ, for some b\nand c different from zero, and the faulty link is of the\nform ðða; 0; 0Þ; ðaþ 1; 0; 0ÞÞ, for some a.\nSuppose thatQk3 has two faulty nodes and two faulty links.\nWithout loss of generality, suppose that one of the faulty\nlinks lies in dimension 1 with the other in dimension 2\n(the two links cannot lie in the same dimension, as otherwise,\nwe could partition over this dimension and be done).\nFollowing the argument in Lemma 9 yields that up to\nisomorphism, the situations where the argument fails is\nwhen the two faulty nodes are of the form ð0; 0; 0Þ and ð0; 0; cÞ,\nfor some c different from zero, and the faulty links are of\nthe form ðða; 0; 0Þ; ðaþ 1; 0; 0ÞÞ and ðð0; b; 0Þ; ð0; bþ 1; 0ÞÞ,\nfor some a and b.\nSuppose that Qk3 has one faulty node and three faulty\nlinks. Without loss of generality, suppose that one of the\nfaulty links lies in dimension 1, one in dimension 2, and\none in dimension 3. Following the argument in Lemma 9\nSTEWART AND XIANG: EMBEDDING LONG PATHS IN K-ARY N-CUBES WITH FAULTY NODES AND LINKS 1081\nAuthorized licensed use limited to: University of Durham. Downloaded on July 1, 2009 at 10:58 from IEEE Xplore.  Restrictions apply.\nyields that up to isomorphism, the situations where the\nargument fails is when the faulty node is of the form (0,\n0, 0) and the faulty links are of the form ðða; 0; 0Þ; ðaþ 1;\n0; 0ÞÞ, ðð0; b; 0Þ; ð0; bþ 1; 0ÞÞ, and ðð0; 0; cÞ; ð0; 0; cþ 1ÞÞ, for\nsome a, b, and c.\nSuppose thatQk3 has four faulty links. In this case, Lemma9\nholds, as at least two faulty links lie in the same dimension,\nand we can partition over this dimension. We shall use these\nobservations in the proof of the following theorem.\nThroughout the rest of the paper, we adopt the\nfollowing notation. Suppose that we partition Qkn over some\ndimension d to get the k-ary ðn\u00041Þ-cubes Qd;0;Qd;1; . . . ;Qd;k\u00041.\nLet x be a node ofQd;i, say. Then, we refer to the node inQd;j\ncorresponding to x (that is, the node of Qd;j whose name is\nidentical to that of x except that its dth component is j as\nopposed to i) as xj. We also refer to the node x as xi.\nTheorem 10. Let Qkn be a k-ary n-cube, for some n \u0002 2 and some\neven k \u0002 4, with fv faulty nodes and fe faulty links, where\n0 \u0003 fv þ fe \u0003 2n\u0004 2. If s and e are distinct healthy nodes\nand fs; eg is odd (respectively, even), then there exists a path\nfrom s to e of length at least kn \u0004 2fv \u0004 1 (respectively,\nkn \u0004 2fv \u0004 2).\nProof. We proceed by induction on n. The base case of the\ninduction is handled by Theorem 8. Suppose, as our\ninduction hypothesis, that the result holds for Qkm, where\nn \u0002 3, and for all m < n. Let Qkn be a k-ary n-cube as in\nthe statement of the theorem. Throughout, \u0002 ¼ 1 if fs; eg\nis odd, and \u0002 ¼ 2 if fs; eg is even.\nSuppose that n \u0002 4. By Lemma 9, we may assume that\nwhen we partition Qkn over dimension 1, the resulting\nk-ary ðn\u0004 1Þ-cubes Q1;0; Q1;1; . . . ; Q1;k\u00041 each contain at\nmost 2n\u0004 4 faults. Suppose that the number of faulty\nnodes in Q1;i is fi, for i ¼ 0; 1; . . . ; k\u0004 1.\nCase a. s and e lie in Q1;0.\nBy the induction hypothesis, there is a path \u00030ðs; eÞ in\nQ1;0 of length at least k\nn\u00041 \u0004 2f0 \u0004 \u0002. Let ðw0; z0Þ be a link of\n\u00030ðs; eÞ for whichw1 and z1 are healthy nodes (ofQ1;1) and\nðw0; w1Þ and ðz0; z1Þ are healthy links (a simple counting\nargument shows the existence of such a link). By the\ninduction hypothesis, there is a path \u00031ðw1; z1Þ in Q1;1 of\nlength at least kn\u00041 \u0004 2f1 \u0004 1. Let \u0003ðs; eÞ be the join of\n\u00030ðs; eÞ to\u00031ðw1; z1Þover ðw0; z0Þ. Thepath\u0003ðs; eÞhas length\nat least 2kn\u00041 \u0004 2ðf0 þ f1Þ \u0004 \u0002. Proceeding similarly and\niteratively with appropriate paths in Q1;2; Q1;3; . . . ; Q1;k\u00041\nyields a path from s to e of the required length.\nCase b. s lies in Q1;0, and e lies in Q1;a, for a 6¼ 0.\nA simple counting argument yields that there exists a\nhealthy node w0 2 Q1;0 n fe0g such that fs; w0g is odd, wi\nis healthy, for all i ¼ 0; 1; . . . ; k\u0004 1, and all links\no f fðwi; wiþ1Þ : i ¼ 0; 1; . . . ; k\u0004 2g [ fðwk\u00041; w0Þg a r e\nhealthy. By the induction hypothesis, there exists a path\n\u00030ðs; w0Þ in Q1;0 of length at least kn\u00041 \u0004 2f0 \u0004 1.\nSuppose that a 6¼ 1. A simple counting argument yields\nthat there exists a healthy node z1 2 Q1;1 n fe1g such that\nfw1; z1g is odd, zi is healthy, for all i ¼ 0; 1; . . . ; k\u0004 1, and\nall links of fðzi; ziþ1Þ : i ¼ 0; 1; . . . ; k\u0004 2g [ fðzk\u00041; z0Þg are\nhealthy. By the induction hypothesis, there exists a path\n\u00031ðw1; z1Þ in Q1;1 of length at least kn\u00041 \u0004 2f1 \u0004 1. Denote\nthe path\n\u00030ðs; w0Þ; ðw0; w1Þ; \u00031ðw1; z1Þ\nby \u0003ðs; z1Þ.\nSuppose that a 6¼ 2. By the induction hypothesis, there\nexists a path \u00032ðz2; w2Þ in Q1;2 of length at least\nkn\u00041 \u0004 2f2 \u0004 1. Denote the path\n\u0003ðs; z1Þ; ðz1; z2Þ; \u00032ðz2; w2Þ\nby \u0003ðs; w2Þ.\nProceeding iteratively in this way yields a path\n\u0003ðs; za\u00041Þ or \u0003ðs; wa\u00041Þ, depending upon whether a\u0004 1\nis odd or even, respectively, of length at least\nakn\u00041 \u0004 2ðf0 þ f1 þ . . .þ fa\u00041Þ \u0004 1. Without loss of gen-\nerality, suppose that the path is \u0003ðs; za\u00041Þ (the other case\nis similar). The node za is odd if and only if the node s is\nodd; hence, fs; eg ¼ fza; eg.\nBy the induction hypothesis, there exists a path\n\u0003aðza; eÞ in Q1;a of length at least kn\u00041 \u0004 2fa \u0004 \u0002. Denote\nthe path\n\u0003ðs; za\u00041Þ; ðza\u00041; zaÞ; \u0003aðza; eÞ\nby \u00030ðs; eÞ. The path \u00030ðs; eÞ has length at least\nðaþ 1Þkn\u00041 \u0004 2ðf0 þ f1 þ . . .þ faÞ \u0004 \u0002.\nA simple counting argument yields that there is a\nlink ðxa; yaÞ of \u0003aðza; eÞ such that xaþ1 and yaþ1 are both\nhealthynodes and ðxa; xaþ1Þ and ðya; yaþ1Þ are bothhealthy\nlinks (to see this, note that \u0003aðza; eÞ has length at least\nkn\u0004 1 \u0004 2fa \u0004 \u0002 \u0002 22n\u0004 2 \u0004 2ð2n\u0004 4Þ \u0004 2 ¼ 22n\u0004 2 \u0004 4nþ 6,\nand so, there are at least 22n\u00043 \u0004 2nþ 3 mutually disjoint\nlinks on \u0003aðza; eÞ; as there are at most 2n\u0004 2 faulty links in\nour Qkn and 2\n2n\u00043 \u0004 2nþ 3 > 2n\u0004 2, when n \u0002 3, at least\none such link ðxa; yaÞ of \u0003aðza; eÞ must be as required). By\nthe induction hypothesis, there is a path \u0003aþ1ðxaþ1; yaþ1Þ in\nQ1;aþ1 of length at least kn \u0004 2faþ1 \u0004 1. Form the path\nobtained by joining \u00030ðs; eÞ to \u0003aþ1ðxaþ1; yaþ1Þ over ðxa; yaÞ\nanddenote thispathby\u000300ðs; eÞ. Thepath\u000300ðs; eÞhas length\nat least ðaþ 2Þkn\u00041 \u0004 2ðf0 þ f1 þ . . .þ faþ1Þ \u0004 \u0002. Proceed-\ning similarly and iteratively in Q1;aþ2; Q1;aþ3; . . . ; Q1;k\u00041\nresults in a path from s to e of the required length\n(the construction can be visualized as in Fig. 7).\nNow, suppose that n ¼ 3 and suppose further that we\nhave no faulty links (we deal with when there are faulty\nlinks later). From the observation following Lemma 9, we\nmay assume that we have four faulty nodes and that\nthese nodes are ð0; 0; 0Þ, ða; 0; 0Þ, ð0; b; 0Þ, and ð0; 0; cÞ,\nfor some a, b, and c, all different from zero; otherwise, the\nconstruction above in cases 1 and 2 can be used to build\nour path. Partition Qk3 over dimension 1 to obtain the\nk-ary 2-cubes Q1;0; Q1;1; . . . ; Q1;k\u00041; note that ð0; 0; 0Þ,\nð0; b; 0Þ, and ð0; 0; cÞ lie in Q1;0.\n1082 IEEE TRANSACTIONS ON PARALLEL AND DISTRIBUTED SYSTEMS, VOL. 19, NO. 8, AUGUST 2008\nFig. 7. The construction in case b.\nAuthorized licensed use limited to: University of Durham. Downloaded on July 1, 2009 at 10:58 from IEEE Xplore.  Restrictions apply.\nCase c. s and e lie in Q1;0.\nTemporarily suppose that (0, 0, 0) is healthy. By\nTheorem 8, there is a path \u00030ðs; eÞ in Q1;0 of length at least\nk2 \u0004 4\u0004 \u0002 but upon which (0, 0, 0) may lie. If ð0; 0; 0Þ lies\non \u00030ðs; eÞ, then choose y0 ¼ ð0; 0; 0Þ; otherwise, choose y0\nto be any node of \u00030ðs; eÞ different from s and e.\nLet y\u00040 and y\nþ\n0 be thenodes immediately before andafter\ny0, respectively, on \u00030ðs; eÞ. Without loss of generality, we\nmay suppose that y\u0004k\u00041 and y\nþ\n1 are healthy nodes (and that\nðy\u00040 ; y\u0004k\u00041Þ and ðyþ0 ; yþ1 Þ are healthy links; recall that there is\none faulty nodeoutsideQ1;0).A simple counting argument\nyields that there exists ahealthynodewk\u00041 2 Qk\u00041 n fy\u0004k\u00041g\nsuch that fy\u0004k\u00041; wk\u00041g is odd and wi is healthy, for all i ¼\n1; 2; . . . ; k\u0004 1 (and the linksof fðwi; wiþ1Þ : i ¼ 0; 1; . . . ; k\u0004\n2g are healthy; to see this, note that there are at least bðk2 \u0004\n1Þ=2chealthynodeswk\u00041 forwhichfy\u0004k\u00041; wk\u00041g is odd, and\nthis number is greater than zero). By Theorem 8, there\nexists a path \u0003k\u00041ðy\u0004k\u00041; wk\u00041Þ in Q1;k\u00041 of length at least\nk2 \u0004 2fk\u00041 \u0004 1.\nA simple counting argument yields that there\nexists a healthy node zk\u0004 2 2 Qk\u0004 2 n fyþk\u0004 2 ; wk\u0004 2g\nsuch that fwk\u00042; zk\u00042g is odd and zi is healthy, for\nall i ¼ 1; 2; . . . ; k\u0004 1 (and the links of fðzi; ziþ1Þ : i ¼\n0; 1; . . . ; k\u0004 3g are healthy). By Theorem 8, there exists\na path \u0003k\u00042ðwk\u00042; zk\u00042Þ in Qk\u00042 of length at least\nk2 \u0004 2fk\u00042 \u0004 1.\nProceeding iteratively in this way yields a path\n\u00030ðs; z1Þ defined as\n\u0003 s; y\u00040\n\u0002 \u0003\n; y\u00040 ; y\n\u0004\nk\u00041\n\u0002 \u0003\n; \u0003k\u00041 y\u0004k\u00041; wk\u00041\n\u0002 \u0003\n; ðwk\u00041; wk\u00042Þ;\n\u0003k\u00042ðwk\u00042; zk\u00042Þ; ðzk\u00042; zk\u00043Þ; . . . ; ðz2; z1Þ:\nBy Theorem 8, there is a path \u00031ðz1; yþ1 Þ in Q1;1 of length\nat least k2 \u0004 2f1 \u0004 2. Consider the path \u000300ðs; eÞ defined as\n\u00030ðs; z1Þ; \u00031 z1; yþ1\n\u0002 \u0003\n; yþ1 ; y\nþ\n0\n\u0002 \u0003\n; \u00030 y\nþ\n0 ; e\n\u0002 \u0003\n:\nThe length of this path is k3\u00042\u0002k\u00041i¼1 fi\u00046\u0004\u0002¼k3\u00048\u0004\u0002.\nHence, the path \u000300ðs; eÞ is as required (the construction\ncan be visualized as in Fig. 8).\nCase d. s lies in Q1;0, and e does not lie in Q1;0.\nFor the moment, regard the node x0 ¼ ð0; 0; 0Þ as\nhealthy. By Theorem 8, there is a path \u00030ðs; x0Þ in Q1;0 of\nlength at least k2 \u0004 5 if fs; x0g is odd and k2 \u0004 6 if fs; x0g\nis even. Let w0 be the node of \u00030ðs; x0Þ adjacent to x0.\nWithout loss of generality, we may assume that w1 and\nðw0; w1Þ are healthy. There are two possibilities: either\ne 2 Q1;1 or e 2 Q1;m, where 0 6¼ m 6¼ 1.\nSuppose that e 2 Q1;1 and w1 ¼ e. A simple counting\nargument yields that there exists a link ðy0; z0Þ of \u00030ðs; w0Þ\nsuch that y0 6¼ w0 6¼ z0 and y1, z1, ðy0; y1Þ, and ðz0; z1Þ are\nhealthy. By Theorem 8, there is a path \u00031ðy1; z1Þ inQ1;1 that\navoids e and is of length at least k2 \u0004 2ðf1 þ 1Þ \u0004 1. Let\n\u0003ðs; eÞ be the path obtained by joining\n\u00030ðs; w0Þ; ðw0; eÞ\nto \u00031ðy1; z1Þ over the link ðy0; z0Þ. As fs; x0g ¼ fs; eg, the\nlength of \u0003ðs; eÞ is at least 2k2 \u0004 2f1 \u0004 6\u0004 \u0002.\nSuppose that e 2 Q1;1 and w1 6¼ e. By Theorem 8, there\nis a path \u00031ðw1; eÞ in Q1;1 of length at least k2 \u0004 2f1 \u0004 1 if\nfw1; eg is odd and kn\u00041 \u0004 2f1 \u0004 2 if fw1; eg is even. Define\nthe path \u0003ðs; eÞ as\n\u00030ðs; w0Þ; ðw0; w1Þ; \u00031ðw1; eÞ:\nIf fs; eg is odd, then fs; x0g ¼ fs; w1g 6¼ fw0; eg, and the\nlength of \u0003ðs; eÞ is at least 2k2 \u0004 2f1 \u0004 7. If fs; eg is even,\nthen fs; x0g ¼ fs; w1g ¼ fw0; eg, and the length of \u0003ðs; eÞ\nis at least 2k2 \u0004 2f1 \u0004 8.\nHence, if e 2 Q1;1, then we have a path \u0003ðs; eÞ in\nQ1;0 [Q1;1 of length at least 2k2 \u0004 2f1 \u0004 6\u0004 \u0002 (the\nconstructions can be visualized as in Fig. 9).\nA simple counting argument yields that there is a link\nðu1; v1Þ of \u0003ðs; eÞ such that ðu1; u2Þ and ðv1; v2Þ are both\nhealthy. By Theorem 8, there is a path \u00032ðu2; v2Þ in Q1;2 of\nlength at least k2 \u0004 2f2 \u0004 1. Join the path \u0003ðs; eÞ to the\npath \u00032ðu2; v2Þ over the link ðu1; v1Þ and denote the\nresulting path by \u0003ðs; eÞ also. Proceeding iteratively in\nthis way in Q1;3; Q1;4; . . . ; Q1;k\u00041 yields a path \u0003ðs; eÞ\nwhose length is at least k3 \u0004 2\u0002k\u00041i¼1 fi \u0004 6\u0004 \u0002 ¼ k3 \u0004 8\u0004 \u0002.\nHence, the path \u0003ðs; eÞ is as required.\nAlternatively, suppose that e 2 Q1;m, where 0 6¼ m 6¼ 1.\nLet y1 2 Q1;1 be such that fs; y1g is odd, ym 6¼ e, and yi is\nhealthy, for i ¼ 1; 2; . . . ; k\u0004 1 (and the links of fðyi; yiþ1Þ :\ni ¼ 1; 2; . . . ; k\u0004 2g are healthy). By the construction above,\nthere is apath \u00030ðs; y1Þ inQ1;0 [Q1;1 of length 2k2 \u0004 2f1 \u0004 7.\nSuppose that m 6¼ 2. Let z2 2 Q1;2 be such that fz2; y2g\nis odd, za 6¼ e, and zi is healthy, for i ¼ 1; 2; . . . ; k\u0004 1\n(and the links of fðzi; ziþ1Þ : i ¼ 2; 3; . . . ; k\u0004 2g are\nhealthy). By Theorem 8, there is a path \u00032ðy2; z2Þ in Q1;2\nof length k2 \u0004 2f2 \u0004 1.\nSuppose that m 6¼ 3. By Theorem 8, there is a path\n\u00033ðz3; y3Þ in Q1;3 of length k2 \u0004 2f3 \u0004 1. Proceeding in this\nSTEWART AND XIANG: EMBEDDING LONG PATHS IN K-ARY N-CUBES WITH FAULTY NODES AND LINKS 1083\nFig. 8. The construction in case c. Fig. 9. The constructions in case d when e 2 Q1;1.\nAuthorized licensed use limited to: University of Durham. Downloaded on July 1, 2009 at 10:58 from IEEE Xplore.  Restrictions apply.\nway, we obtain paths \u00032ðy2; z2Þ; \u00033ðz3; y3Þ; . . . ; and so on,\nuntil \u0003m\u00041ðym\u00041; zm\u00041Þ if m is odd or \u0003m\u00041ðzm\u00041; ym\u00041Þ if\nm is even. Applying Theorem 8 again yields a path\n\u0003mðzm; eÞ or \u0003mðym; eÞ in Q1;m, depending upon whether\nm is odd or even, respectively. If m is odd (respectively,\neven), then \u0003mðzm; eÞ (respectively, \u0003mðym; eÞ) has length\nat least k2 \u0004 2fm \u0004 1 if fzm; eg (respectively, fym; eg) is\nodd and k2 \u0004 2fm \u0004 2 if fzm; eg (respectively, fym; eg) is\neven.\nIf m is odd, then let \u0003ðs; eÞ be defined as\n\u00030ðs; y1Þ; ðy1; y2Þ; \u00032ðy2; z2Þ; ðz2; z3Þ; \u00033ðz3; y3Þ; . . . ;\nðzm\u00041; zmÞ; \u0003mðzm; eÞ;\nand if m is even, then let \u0003ðs; eÞ be defined as\n\u00030ðs; y1Þ; ðy1; y2Þ; \u00032ðy2; z2Þ; ðz2; z3Þ; \u00033ðz3; y3Þ; . . . ;\nðym\u00041; ymÞ; \u0003mðym; eÞ:\nIt can easily be verified that if m is odd, then\nfs; eg ¼ fzm; eg, and if m is even, then fs; eg ¼ fym; eg.\nThus, the length of the path \u0003ðs; eÞ is at least\nðmþ 1Þk2 \u0004 2\u0002mi¼1fi \u0004 6\u0004 \u0002. If m 6¼ k\u0004 1, then the path\n\u0003ðs; eÞ can be iteratively joined to a path in Q1;i of length\nk2 \u0004 2fi \u0004 1, for i ¼ mþ 1;mþ 2; . . . ; k\u0004 1, just as we\ndid above, to obtain a path, also denoted \u0003ðs; eÞ, of length\nat least k3 \u0004 2\u0002k\u00041i¼1 fi \u0004 6\u0004 \u0002. Hence, our path \u0003ðs; eÞ is as\nrequired.\nCase e. s and e lie in Q1;p and Q1;m, respectively, where\nm 6¼ 0 6¼ p 6¼ m.\nWithout loss of generality, suppose that p > m. Let\ns0 2 Q1;0 be such that s0, s0k\u00041 and ðs0k\u00041; s0Þ are healthy and\nfs0; sg is odd. By the construction in Case d above, there\nis a path \u00030ðs0; eÞ in Q1;0 [Q1;1 [ . . . [Q1;m of length at\nleast ðmþ 1Þk2 \u0004 2\u0002ai¼0fi \u0004 7.\nLet wp be a node of Qp such that fs; wpg is odd,\nw0 6¼ s0, and wi is healthy, for i ¼ p; pþ 1; . . . ; k\u0004 1 (and\nthe l inks of fðwi; wiþ1Þ : i ¼ p; pþ 1; . . . ; k\u0004 2g are\nhealthy). By Theorem 8, there is a path \u0003pðs; wpÞ in Q1;p\nof length at least k2 \u0004 2fp \u0004 1.\nLet ypþ1 be a node of Q1;pþ1 such that fwpþ1; ypþ1g is\nodd, y0 6¼ s0, and yi is healthy, for i ¼ pþ 1; pþ 2; . . . ;\nk\u0004 1 (and the links of fðyi; yiþ1Þ : i ¼ pþ 1 ; pþ 2; . . . ;\nk\u0004 2g are healthy). By Theorem 8, there is a path\n\u0003pþ1ðwpþ1; ypþ1Þ in Qpþ1 of length at least k2 \u0004 2fpþ1 \u0004 1.\nAgain, by Theorem 8, there are paths \u0003pþ2ðypþ2; wpþ2Þ,\n\u0003pþ3ðwpþ3; ypþ3Þ, and so on, up to \u0003k\u00042ðyk\u00042; wk\u00042Þ if p is\neven and \u0003k\u00042ðwk\u00042; yk\u00042Þ if p is odd that are of lengths\nk2 \u0004 2fpþ2 \u0004 1; k2 \u0004 2fpþ3 \u0004 1; . . . ; k2 \u0004 2fk\u00042 \u0004 1, respec-\ntively; note that fs; eg ¼ fwk\u00041; s0k\u00041g if p is odd (respec-\ntively, fs; eg ¼ fyk\u00041; s0k\u00041g if p is even). Yet again, by\nTheorem 8, there is a path \u0003k\u00041ðwk\u00041; s0k\u00041Þ (respectively,\n\u0003k\u00041ðyk\u00041; s0k\u00041Þ) in Qk\u00041 of length at least k2 \u0004 2fk\u00041 \u0004 \u0002 if\np is even (respectively, odd). Let \u0003ðs; eÞ be the path\n\u0003pðs; wpÞ; ðwp; wpþ1Þ; \u0003pþ1ðwpþ1; ypþ1Þ; ðypþ1; ypþ2Þ;\n\u0003pþ2ðypþ2; wpþ2Þ; . . . . . . ; s0k\u00041; s0\n\u0002 \u0003\n; \u00030ðs0; eÞ:\nThe path \u0003ðs; eÞ has length at least\nðk\u0004 pþm\u0004 1Þk2 \u0004 2\u0002mi¼0fi \u0004 2\u0002k\u00041i¼p fi \u0004 2\u0004 \u0002:\nIf p 6¼ mþ 1, then the path \u0003ðs; eÞ can be iteratively\njoined to a path in Q1;i of length k\n2 \u0004 2fi \u0004 1, for\ni ¼ mþ 1;mþ 2; . . . ; p\u0004 1, just as we did in Case d, to\nobtain a path, also denoted \u0003ðs; eÞ, of length at least\nk3 \u0004 2\u0002k\u00041i¼1 fi \u0004 6\u0004 \u0002. Hence, our path \u0003ðs; eÞ is as required.\nCase f. s and e lie in Q1;m, where m 6¼ 0.\nBy Theorem 8, there is a path \u0003mðs; eÞ in Q1;m of\nlength at least k2 \u0004 2fm \u0004 \u0002. There exists a link ðwm; ymÞ\nof \u0003mðs; eÞ such that wmþ1, ymþ1, ðwm;wmþ1Þ, and\nðym; ymþ1Þ are healthy. By Theorem 8, there exists a\npath \u0003mþ1ðwmþ1; ymþ1Þ in Q1;mþ1 of length at least\nk2 \u0004 2fmþ1 \u0004 1. Join \u0003mðs; eÞ to \u0003mþ1ðwmþ1; ymþ1Þ over\nðwm; ymÞ and denote this path by \u0003ðs; eÞ also. The path\n\u0003ðs; eÞ can be iteratively joined to a path in Q1;i of\nlength k2 \u0004 2fi \u0004 1, for i ¼ mþ 2;mþ 3; . . . ;m\u0004 1, to\nobtain a path of length at least k3 \u0004 8\u0004 \u0002 as required.\nNow, suppose that we have one faulty link. Partition\nover the dimension containing this faulty link, and if\neach resulting k-ary 2-cube Q1;0; Q1;1; . . . ; Q1;k\u00041 contains\nat most two faults, then apply the construction as in\nCases a and b to build our path. Hence, we may assume\nthat Q1;0 contains three faulty nodes. However, if we\nfollow exactly the constructions in each of Cases c, d, e,\nand f, then these constructions still apply, and we obtain\na path of the required length. Exactly the same can be\nsaid of the scenarios when we have two and three faulty\nlinks. The result now follows. tu\nWe note that givenQkn, where k \u0002 4 is even, and fn and fe,\nwhere fn þ fe \u0003 2n\u0004 2, there are configurations of fn faulty\nnodes, fe faulty links, and pairs of distinct healthy nodes so\nthat the longest path joining the two nodes has length exactly\nkn \u0004 2fn \u0004 1 (respectively, kn \u0004 2fn \u0004 2) if the parities of the\ntwo nodes are different (respectively, the same). Hence, in\nthis sense, our result can be viewed as optimal.\nAlso, there are configurations of 2n\u0004 1 faulty nodes inQkn\nand pairs of healthy nodes such that the longest path joining\nthe two nodes has length one; take healthy adjacent nodes x\nand y where all other neighbors of x are faulty. Hence, the\ntotal number of faults in Theorem 10 cannot be increased.\n5 CONCLUSIONS\nTheorem 10, allied with the result in [22], fully resolves the\nsituation regarding the existence of longest cycles in\nk-ary n-cubes where the total number of faults (nodes and\nlinks) is at most 2n\u0004 2 and where the faults are configured\nin a “worst case” scenario with respect to the pair of nodes\nin question. Of course, there are configurations of, for\nexample, 2n\u0004 2 faulty nodes in Qkn where certain pairs of\nnodes have paths joining them of lengths strictly greater\nthan the bounds stated in Theorem 10. It would be\ninteresting to build the longest paths joining pairs of nodes\nbut taking into account the configuration of faults (though\nthis would appear to be a demanding task).\nWe expect that if we assume the conditional fault\nassumption, then we should be able to tolerate more faults\nyet still prove a result analogous to Theorem 10. It would be\nworthwhile to investigate this scenario, and we conjecture\nthat the path lengths will be exactly as in Theorem 10.\nThe existence of paths and cycles in (faulty) interconnec-\ntion networks does not guarantee that we can efficiently\nconstruct these paths and cycles using a distributed\nalgorithm implemented on the underlying topology (see\n1084 IEEE TRANSACTIONS ON PARALLEL AND DISTRIBUTED SYSTEMS, VOL. 19, NO. 8, AUGUST 2008\nAuthorized licensed use limited to: University of Durham. Downloaded on July 1, 2009 at 10:58 from IEEE Xplore.  Restrictions apply.\n[21] regarding the issues involved with the distributed\nembedding of a Hamiltonian cycle in a faulty k-ary n-cube).\nThe existence of an efficient distributed algorithm that\n“implements” Theorem 10 should be investigated.\nREFERENCES\n[1] B. Aiello and T. Leighton, “Coding Theory, Hypercube Embed-\ndings and Fault Tolerance,” Proc. Third Ann. ACM Symp. Parallel\nAlgorithms and Architectures (SPAA ’91), pp. 125-136, 1991.\n[2] S.G. Akl, Parallel Computation: Models and Methods. Prentice Hall,\n1997.\n[3] E. Anderson, J. Brooks, C. Grassl, and S. Scott, “Performance of the\nCray T3E Multiprocessor,” Proc. ACM\/IEEE Conf. Supercomputing,\npp. 1-17, 1997.\n[4] W.C. Athas and C.L. Seitz, “Multicomputers: Message-Passing\nConcurrent Computers,” Computer, vol. 21, pp. 9-24, 1988.\n[5] Y. Bruck, R. Cypher, and C.-T. Ho, “Efficient Fault-Tolerant Mesh\nand Hypercube Architectures,” Proc. 22nd Int’l Symp. Fault-\nTolerant Computing (FTCS ’92), pp. 162-169, 1992.\n[6] J.-P. Brunet and S.L. Johnsson, “All-to-All Broadcast and\nApplications on the Connection Machine,” Int’l J. Supercomputer\nApplications, vol. 6, pp. 241-256, 1992.\n[7] S. Borkar, R. Cohen, G. Cox, S. Gleason, T. Gross, H.T. Kung,\nM. Lam, B. Moore, C. Peterson, J. Pieper, L. Rankin, P.S. Tseng,\nJ. Sutton, J. Urbanski, and J. Webb, “iWarp: An Integrated\nSolution to High-Speed Parallel Computing,” Proc. Int’l Conf.\nSupercomputing, pp. 330-339, 1988.\n[8] R.J. Cole, B.M. Maggs, and R.K. Sitaraman, “Reconfiguring Arrays\nwith Faults I: Worst-Case Faults,” SIAM J. Computing, vol. 26,\npp. 1581-1611, 1997.\n[9] R. Duncan, “A Survey of Parallel Computer Architectures,”\nComputer, vol. 23, pp. 5-16, 1990.\n[10] T.H. Duncan, “Performance of the Intel iPSC\/860 and Ncube 6400\nHypercubes,” Parallel Computing, vol. 17, pp. 1285-1302, 1991.\n[11] J.-S. Fu, “Longest Fault-Free Paths in Hypercubes with Vertex\nFaults,” Information Sciences, vol. 176, pp. 759-771, 2006.\n[12] J. Hastad, T. Leighton, and M. Newman, “Reconfiguring a\nHypercube in the Presence of Faults,” Proc. 19th Ann. ACM Symp.\nTheory of Computing (STOC ’97), pp. 274-284, 1997.\n[13] S.-Y. Hsieh and N.-W. Chang, “Optimal Node-to-Node Path\nEmbedding in Hypercubes with Conditional Faults,” IEEE Trans.\nParallel and Distributed Systems, to be published.\n[14] R.E. Kessler and J.L. Schwarzmeier, “CRAY T3D: A New\nDimension for Cray Research,” Proc. 38th IEEE CS Int’l Conf.\n(Compcon ’93), pp. 176-182, 1993.\n[15] H.-C. Kim and J.-H. Park, “Fault Hamiltonicity of Two-Dimen-\nsional Torus Networks,” Proc. Fifth Japan-Korea Joint Workshop\nAlgorithms and Computation (WAAC ’00), pp. 110-117, 2000.\n[16] F.T. Leighton, Introduction to Parallel Algorithms and Architectures:\nArrays. Trees. Hypercubes. Morgan Kaufmann, 1992.\n[17] F.T. Leighton, B.M. Maggs, and R.K. Sitaraman, “On the Fault\nTolerance of Some Popular Bounded-Degree Networks,” SIAM\nJ. Computing, vol. 27, pp. 1303-1333, 1998.\n[18] M.D. Noakes, D.A. Wallach, and W.J. Dally, “The J-Machine\nMulticomputer: An Architectural Evaluation,” Proc. 20th Ann. Int’l\nSymp. Computer Architecture (ISCA ’93), pp. 224-235, 1993.\n[19] C.L. Seitz, “The Cosmic Cube,” Comm. ACM, vol. 28, pp. 22-33,\n1985.\n[20] C.L. Seitz, W.C. Athas, C.M. Flaig, A.J. Martin, J. Scizovic,\nC.S. Steele, and W.-K. Su, “Submicron Systems Architecture\nProject Semiannual Technical Report,” Technical Report Caltec-\nCS-TR-88-18, California Inst. of Technology, 1988.\n[21] I.A. Stewart, “Distributed Algorithms for Building Hamiltonian\nCycles in k-Ary n-Cubes and Hypercubes with Faulty Links,” Proc.\n12th Int’l Conf. Parallel and Distributed Systems (ICPADS ’06),\npp. 308-318, 2006.\n[22] M.-C. Yang, J.J.M. Tan, and L.H. Hsu, “Hamiltonian Circuit and\nLinear Array Embeddings in Faulty k-Ary n-Cubes,” J. Parallel and\nDistributed Computing, vol. 67, no. 4, pp. 362-368, 2007.\nIain A. Stewart received the MA degree in\nmathematics from the University of Oxford in\n1983 and the PhD degree in mathematics the\nUniversity of London in 1986, respectively. He\nis currently a professor in the Department\nof Computer Science, Durham University,\nUnited Kingdom. Previously, he was a lecturer\nat the University of Newcastle upon Tyne, a\nreader at the University of Wales, Swansea,\nand a professor at the University of Leicester,\nUnited Kingdom. His research interests are primarily in computational\ncomplexity, finite model theory, and descriptive complexity, although he\nalso has interests in graph theory and algorithms, interconnection\nnetworks for parallel and distributed computing, theoretical aspects of\nartificial intelligence, and group theory.\nYonghong Xiang received the BS degree in\nmathematics from Hunan Normal University,\nChina, in 1997 and theMSdegree in fundamental\nmathematics from Yunnan Normal University,\nChina, in 2000. He is currently a PhD student in\nthe Department of Computer Science, Durham\nUniversity, United Kingdom. From 2000 to 2005,\nhe worked as an assistant lecturer and lecturer in\nthe School of Information and School of Soft-\nware, Yunnan University, China, and was an\nacademic visitor to Durham University in 2005. His current research\ninterests are interconnection networks for parallel and distributed\ncomputing, graph theory, and algorithms.\n. For more information on this or any other computing topic,\nplease visit our Digital Library at www.computer.org\/publications\/dlib.\nSTEWART AND XIANG: EMBEDDING LONG PATHS IN K-ARY N-CUBES WITH FAULTY NODES AND LINKS 1085\nAuthorized licensed use limited to: University of Durham. Downloaded on July 1, 2009 at 10:58 from IEEE Xplore.  Restrictions apply.\n"}