{"doi":"10.1080\/03003930701795014","coreId":"65532","oai":"oai:dro.dur.ac.uk.OAI2:5567","identifiers":["oai:dro.dur.ac.uk.OAI2:5567","10.1080\/03003930701795014"],"title":"Local government modernisation in England : a critical review of the LGMA evaluation studies.","authors":["Laffin,  M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-02-01","abstract":"New Labour has subjected English local government to an unparalleled period of reform. This article reviews the Local Government Modernisation Agenda evaluation studies commissioned by central government. The review identifies valuable insights from the studies into the contemporary state of English local government, central government and central-local relations. However, the studies also illustrate the need for research on public service reform to include analyses of the political origins of reform policies and the political-bureaucratic issues involved in their implementation. It is also argued that future research needs to rediscover the value of studying local politics 'in the round', the impact of socio-economic and non-local factors on local policy outcomes and the role of new sources of policy influence in the channels of central-local relations","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65532.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5567\/1\/5567.pdf","pdfHashValue":"320e94be1453b41fc92e2491389ef1b6050bcbdd","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5567<\/identifier><datestamp>\n      2011-11-03T16:19:30Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Local government modernisation in England : a critical review of the LGMA evaluation studies.<\/dc:title><dc:creator>\n        Laffin,  M.<\/dc:creator><dc:description>\n        New Labour has subjected English local government to an unparalleled period of reform. This article reviews the Local Government Modernisation Agenda evaluation studies commissioned by central government. The review identifies valuable insights from the studies into the contemporary state of English local government, central government and central-local relations. However, the studies also illustrate the need for research on public service reform to include analyses of the political origins of reform policies and the political-bureaucratic issues involved in their implementation. It is also argued that future research needs to rediscover the value of studying local politics 'in the round', the impact of socio-economic and non-local factors on local policy outcomes and the role of new sources of policy influence in the channels of central-local relations. <\/dc:description><dc:publisher>\n        Routledge<\/dc:publisher><dc:source>\n        Local government studies, 2008, Vol.34(1), pp.109-125 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2008-02-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5567<\/dc:identifier><dc:identifier>\n        issn:0300-3930<\/dc:identifier><dc:identifier>\n        issn: 1743-9388<\/dc:identifier><dc:identifier>\n        doi:10.1080\/03003930701795014<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5567\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1080\/03003930701795014<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5567\/1\/5567.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0300-3930"," 1743-9388","0300-3930","issn: 1743-9388"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n26 January 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nLaffin, M. (2008) ’Local government modernisation in England : a critical review of the LGMA evaluation\nstudies.’, Local government studies., 34 (1). pp. 109-125.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1080\/03003930701795014\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \nDurham Research Online \n \nDeposited in DRO: \n26 January 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nAccepted for publication version \n \nCitation for published item: \nLaffin, M. (2008) 'Local government modernisation in England : a critical review of the LGMA \nevaluation studies.', Local government studies., 34 (1). pp. 109-125. \n \nFurther information on publishers website: \nhttp:\/\/dx.doi.org\/10.1080\/03003930701795014 \n \nPublisher’s copyright statement: \nThis is an electronic version of an article published in Laffin, M. (2008) 'Local government \nmodernisation in England : a critical review of the LGMA evaluation studies.', Local \ngovernment studies., 34 (1). pp. 109-125. Local government studies is available online at: \nhttp:\/\/www.informaworld.com\/smpp\/content~db=all?content=10.1080\/03003930701795014 \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n1 \nLocal Government Modernisation In England: A Critical Review of the LGMA \nEvaluation Studies  \n[Local Government Studies, 34 (1), pp. 109-125] \n \nMartin Laffin \n \nDurham University \n \n \nABSTRACT \n \nNew Labour has subjected English local government to an unparalleled period of reform.  \nThis article reviews the Local Government Modernisation Agenda evaluation studies \ncommissioned by central government. The review identifies valuable insights from the \nstudies into the contemporary state of English local government, central government and \ncentral-local relations. However, the studies also illustrate the need for research on public \nservice reform to include analyses of the political origins of reform policies and the political-\nbureaucratic issues involved in their implementation. It is also argued that future research \nneeds to rediscover the value of studying local politics „in the round‟, the impact of socio-\neconomic and non-local factors on local policy outcomes and the role of new sources of \npolicy influence in the channels of central-local relations.  \n \nIntroduction \n \nThe last decade of Labour government in the UK has been associated with an ambitious \nprogramme of public service reforms. In England key reform initiatives have been directed at \nlocal government and those other units of devolved government responsible for delivering \nmajor services such as health. Indeed, the present Labour government has devoted more \nattention to local government than any of the three earlier post-war Labour governments. For \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n2 \ntraditionally, it has been the Conservative party which worried away at local government, \ninitiating the three great postwar English local government reorganisations. In another break \nwith Labour tradition, the government has celebrated and extended, rather than rolled back, \nthe mixed economy of local service delivery inherited from the Conservatives. In particular, \nthe government has inaugurated an intensive period of reform intended to „modernise‟ and \nreinvigorate English local councils (elsewhere in the UK the new devolved governments have \nresponsibility for local government in their areas, Laffin 2007). These English reforms have \nsought a „radical re-focussing of councils‟ traditional roles‟ and the elimination of the „old \nculture of paternalism and inwardness‟ (DETR 1998: 8, quoted in Bovaird and Martin 2003: \n18).  \n \nThe government has looked to re-engineer local authorities as strategic leaders within their \nlocal communities, enabling services to be delivered rather than necessarily delivering all \nservices themselves. The four successive stages of the Local Government Modernisation \nAgenda (LGMA), from1997 onwards, have involved twenty plus individual policies. These \npolicies range from new performance management regimes (Best Value then Comprehensive \nPerformance Assessments) to new council constitutions which require authorities to replace \ntheir traditional committee-based decision-making structures with an executive in the form of \na leader-and-cabinet or an elected mayor, based on a distinction between „executive‟ and \nlegislative‟ roles. Other notable LGMA policy initiatives include Local Public Service \nAgreements between central government and individual local authorities, requirements to \nestablish „joined-up‟ local strategic partnerships and a new approach to local coordination in \nLocal Area Agreements. A range of other policies are also included in the LGMA but are \nomitted from this article for reasons of space – these policies include funding competitions to \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n3 \nbe recognised as „Beacon Councils‟, new ethical codes for councillors and standards \ncommittees for councils. \n \nThe LGMA reforms offer a valuable case study of a central government‟s capacity to manage \nchange at the local level and underlines the dilemmas of reform confronting Labour as a \nsocial democratic government in the early 21\nst\n century. Labour party interests have driven \nmuch of the policy and at least partly explain the apparently greater urgency the government \nhas attached to town hall rather than Whitehall reform. In its pursuit of electability the party \nleadership remains suspicious of its own local government activists, especially any \nresurgence of the left and union power in local government which is perceived, among the \nParliamentary Labour Party leadership, as having damaged Labour electorally in the turbulent \n1980s (Entwistle and Laffin 2005). In additional, falling electoral turnouts and \nunrepresentative councillors threaten the legitimacy of local government and the viability of \nlocal parties as the vital local-level underpinning for the national parties. Not least the key \nrole of local authorities as responsible for a quarter of public spending and for key public \nservices (especially education and social care) in England has always ensured the sustained \ninterest of central policymakers.  \n \nThis article reviews some of the evaluations commissioned by the local government ministry \nin England in its various organisational embodiments, presently as the Department of \nCommunity and Local Government (CLG). These evaluation studies cover all of the twenty \nLGMA policies but exclude other policy initiatives directed at local government but \nemanating from the big public service departments, especially in education and health – a \nsignificant limitation as will be seen later. Articles reporting the main findings of these \nevaluations have now been published in the themed Local Government Studies series, \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n4 \nintroduced by Downe and Martin (2006), of which this article is one contribution. Some of \nthe evaluation findings have also been published in other journals such as Public \nAdministration and the full reports to government are available on the CLG website. The first \npart of this review summarises the main findings of the LGMA evaluation studies which \nprovide valuable insights into the present state of English local government and governance \nand, incidentally, the workings of central departments and central-local government relations. \nThe second part discusses these findings in a broader political and historical context and \nidentities some gaps in our knowledge of local government and politics as well as of central-\nlocal relations. \n \nSummarising the LGMA Studies \n \nThe sheer range of LGMA policies raises the question of whether they represent a coherent \nprogramme of reform. Downe and Martin (2006: 472-1; see also Geddes and Martin 2000) \nidentify four successive waves of LGMA policies with each wave driven by different aims \nand strategies with limited evidence of „any synergy between them‟. They concluded that the \nLGMA was a case of evolution rather than planning. Central policy-makers tried out one set \nof modernisation initiatives then, when these appeared not to have succeeded, they introduced \na new set. On top of the LGMA initiatives, the big service departments – the Departments of \nHealth, Education and Skills (now Department for Children, Schools and Families), Culture \nand Sport and the Home Office – have added their own policy initiatives to the local policy \nmix. Consequently, local authority councillors and officers have been left to puzzle over „the \nmultiple, often competing demands that have been placed on them‟ (Down and Martin 2006: \n471). Indeed, for them the LGMA was less pressing than the requirements of these service \ndepartments. Down and Martin (2006: 482) quote one chief executive who pointed out that \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n5 \nthe LGMA initiatives only took up about 20 per cent of a typical chief executive‟s time, \nwhereas the other 80 per cent was absorbed in responding to initiatives generated from the \nWhitehall service departments. Strikingly, key coordination problems have arisen from \napparently quite simple failures within Whitehall to align service targets and funding regimes \nacross central departments (2006: 470) rather than from difficulties created by novel cross-\ncutting issues. The numerous, separate inspectorates – the Audit Commission, Social Services \nInspectorate, Office for Standards in Education etc. – have further compounded these \ncoordination problems with their own requirements and expectations (Davis et al. 2004). The \nLGMA research implies that the big spending departments have eclipsed the role of the CLG \nas the local government-sponsoring department. The academic evaluators themselves \nconclude that their task was limited by their inability to adopt a „whole systems approach \nwhich can evaluate policy impacts across departmental boundaries‟ (Down and Martin 2006: \n486). When this limitation was discussed early on the evaluation programme, the then \nDepartment of Environment, Transport and the Regions (DETR) ruled that it could only \ncommission research which evaluated their policies not those of other departments and that to \ninitiate joint, inter-departmental research would be too difficult and time-consuming to be \nworthwhile (Martin 2003). A good example of the deep-seated nature of problems of inter-\ndepartmental coordination. \n \nLocal authorities emerge from the evaluation studies as largely passive recipients of central \npolicy initiatives. Central policies eclipse local accountability. Members and officers reported \nthat they were „following central government‟s lead, rather than setting their own agendas‟ \nand „the evidence suggests that to date the LGMA has encouraged an environment in which \nmany authorities rely upon strong external pressure exerted by Government policies to \nmotivate change‟ (Martin and Bovaird 2005: 86). Many authorities reported that current \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n6 \ncentral policies, like the Comprehensive Performance Assessments (CPA) (explained below), \nhave led them to see themselves as more accountable to central government and less to local \npeople (Ashworth and Skelcher 2005). Even so, central initiatives were seen as „broadly \ncongruent with their own authorities‟ local priorities‟, unlike those of the pre-1997 \nConservative policies (Cowell and Martin 2003: 168). Although Cowell and Martin do not \ntell us how far this congruency might reflect a Labour party consensus across the central-\nlocal divide at the time of their research, or whether such a consensus will disappear as more \ncouncils fall to the Conservatives as Labour succumbs to mid-term blues. Nonetheless, they \nidentify significant local government frustration with central government. The government \nsimultaneously demands that local authorities should become community leaders yet persists \nin allocating powers to bodies – such as schools, health agencies and housing associations – \noutside the direct control of those local authorities (Cowell and Martin 2003: 169).  \n \nThe government, then, remains averse to any reforms associated with Big Government \nbureaucratic solutions. It has continued the Conservative‟s stress on a mixed economy of \nprovision at the local level, casting local authorities in an enabling rather than delivering role. \nOne key solution to local coordination problems are Local Strategic Partnerships (LSPs) \nintroduced under the Local Government Act 2000. Central policymakers see LSPs as „a more \nfluid set of institutional structures and relationships‟ which will remedy the „perceived \ndeficiencies of traditional, large bureaucratic “silos”‟ (Geddes et al. 2007). LSPs have now \nbeen established in most localities. They are organisations, with no direct executive powers, \nwhich bring together the different parts of the public sector as well as the private, business, \ncommunity and voluntary sectors in order to join up and plan their various activities. They \nare less centrally-prescribed than CPAs. Geddes et al. (2007) find that LSPs are struggling to \nreconcile their ambitious remit with the realities of both resource constraints and a \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n7 \nquestionable legitimacy given their „ambiguous relationship to local democratic \naccountability‟. In other words, tensions exist between LSPs, as a form of participatory \ndemocracy, and representative democracy, embodied in elected councillors. This tension is \nreflected in the „unease among local authorities and councillors about the potential leaching \nof power to LSPs, contributing to the fragmentation of accountability and dilution of local \ndemocracy (Geddes 2006: 82). Nevertheless, the government is determined to expand the \nscope of partnership working by grafting Local Area Agreements (LAAs) onto the LSPs. The \nLAAs were initially piloted in 2005 and, from 2007, have been extended to all upper tier and \nunitary authorities. LAAs unify a range of different funding streams into four funding streams \nfor a local authority. The LSP can then make recommendations for local priorities within \neach of these funding streams which are then submitted to negotiations with central \ngovernment (CLG 2006). Geddes et al. (2007) see LAAs as likely to enhance those LSPs \nwhich already work well but argue that they will compound the problems of those already \nencountering difficulties. Even so, while LSPs may have serious deficiencies, they have the \nvirtue of opening up local policy debates beyond the limitations imposed by party control \n(Geddes 2006: 84). Nonetheless, Geddes usefully brings in the wider issues of power. He \nargues that the impact of LSPs will be reinforce policy maintenance, limiting the „space of \nleft\/progressive programmes‟ and „challenges to the „mainstream‟ because they give „greater \npower and legitimacy than before to private capital and to managerialist public sector \ninterests in local public policy‟(2006: 85), but he does not provide any supporting evidence. \n \nLocal Public Service Agreements (LPSAs), introduced to all upper tier authorities in 2001, \ndid promise to improve inter-departmental coordination and re-balance the central-local \nrelationship. Essentially LPSAs are extensions of the central government Treasury-\ndepartment public service agreements to local government. They are agreements between a \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n8 \nlocal authority and central government (that is a range of service departments and CLG) via \nthe Government Offices which represent those departments at the regional-level. LPSAs set \nout an authority‟s commitment to deliver specific improvements in performance and the \ngovernment‟s commitment to reward these improvements. About twelve specific \nimprovement targets, seen as likely to be „stretching‟ for the authority, are jointly identified. \nThese targets are derived from the priorities established in an authority‟s community strategy \nin consultation with the LSP. The targets are a mixture of national targets and locally-defined \ntargets, although national targets predominate (Sullivan and Gillansers 2005). Target \nattainment is rewarded with a performance reward grant (PRG) and new freedoms and \nflexibilities for successful local authorities. LPSAs promised quite new possibilities for real \nnegotiations between central government and individual local authorities, in which local \npriorities could be given a new emphasis. The practice has proved rather different. Sullivan \nand Gillanders (2005) provide considerable evidence that the big Whitehall service \ndepartments are using the LPSAs to tighten their embrace of local authorities, although they \nare more cautious in their final conclusions. Those involved, from both central and local \ngovernment, largely experienced the process of negotiation as „not a real negotiation‟ but \nrather as „central officials “telling” local officials how things are going to be‟ (Sullivan and \nGillanders 2005: 562). This experience was compounded by the relatively junior status of the \ncivil servants involved who had little discretion to accommodate local authority requests. \nSullivan and Gillanders remain silent on the contribution of elected members – is the \nimplication that these negotiations are left to the officers correct?  The other major limitation \nof the LPSAs is the rationalistic, economic model underlying them. The assumption is that \ncentral government objectives and priorities can be cascaded down to the local level and that \nthe causal mechanisms underlying social problems are well understood. In reality the process \nof agreeing targets is „hampered by a lack of understanding of cause and effect and \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n9 \ninadequate data, and complicated by the need to meet ODPM‟s “value for money” criteria‟ \n(2005: 561). Thus, despite the rhetoric of consultation associated with the introduction of \nLPSAs, doubtless much of it really meant by local government ministers, in practice the \nLPSAs have been driven by ministers in the more powerful service departments.  \n \nThe clear message from the LGMA studies, then, is that the performance management \nregimes imposed on local government have had a greater impact on local authorities than \nLPSAs.  The first centrally-imposed performance management regime, labelled „Best Value‟, \nwas generally well-received in local government. Not least as authorities saw Best Value as \nless prescriptive than the previous Conservative government‟s Compulsory Competitive \nTendering. After three years of Best Value ministers still believed that „the majority of  \ncouncils was underperforming and would only improve if subject to intensive, top down \nperformance management.‟ (Downe and Martin 2006: 468). In 2001 ministers introduced the \nComprehensive Performance Assessment (CPA) to supersede Best Value. As the name \nsuggests, CPA is authority-wide in scope, unlike Best Value reviews which focussed on \nspecific local services. Like Best Value, they are policed by the Audit Commission. CPA \ninspections have a punitive component with those authorities at the bottom end of the Audit \nCommission‟s performance league table publicly „named-and-shamed‟ and compelled to \nallow external intervention and recovery support. Senior managers, and even occasionally \npolitical leaders, have been moved out of these authorities and interim management teams \nappointed (Turner and Whiteman 2005). Yet the incentives involved in CPAs are limited. \nEven the high performing authorities have received few of the additional freedoms or „earned \nautonomy‟ promised by central government through the LPSA negotiations (Sullivan and \nGillanders 2005). Nonetheless, the CPA can claim significant success. By 2005 the Audit \nCommission judged almost three-quarters of unitary and upper tier authorities to be „good‟ or \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n10 \n„excellent‟; although, paradoxically, the overall performance of local government and public \nsatisfaction with it was declining (Martin and Bovaird 2005). The Audit Commission‟s \njudgements have been particularly important for the standing of local government. Ministers \nare now seeing a sharp contrast between a now apparently rejuvenated local government and \ncentral departments characterised by severe management failings, recently exposed in \nadministrative failures in the Home Office, the Department of Environment, Farming and \nRural Affairs, and elsewhere, and in the twelve departmental Capability Reviews.   \n \nHow far have CPAs changed relationships within local authorities? Senior officers, in \nparticular, face quite new (or is it just different?) pressures to act as leaders. They are now \nheld responsible to an unprecedented extent for management failings (Entwistle et al. 2005). \nIt might be speculated that CPAs are both a threat to and an opportunity for chief executives \nand other senior officers. The threat has already been mentioned, but the opportunity may lay \nin how the CPA gives officers a new set of arguments for the primacy of management and, \ntherefore, their own role. Or does the importance of the CPA inevitably suck the executive \nmembers into management? Or is there is a trend towards member-officer „co-leadership‟? \nwith the CPA pressures creating a shared perspective between senior members and officers?  \nThe broader political modernisation agenda has fuelled the professionalisation of political \nleadership. The greatly increased pay for executive members enables them to spend more \ntime on service delivery issues, again with possible implications for the member-officer \nrelationship (Entwistle et al. 2005). The new political decision-making structures, \nimplemented in the Local Government Act 2000, have not reshaped decision-making to the \nextent envisaged. The new council constitutions have not significantly modified the dynamics \nof member-officer relations (Entwistle et al. 2005). The radical, high profile option of elected \nmayors has not been widely adopted. Stoker and his colleagues (2003; Gains et al. 2005; John \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n11 \n2004) find that only 11 or less than three per cent of English councils have such mayors. \nNonetheless, almost all the rest have adopted the leader-cabinet system with the separation of \nexecutive and scrutiny roles for councillors. Most authorities have adopted these new \nstructures under central duress and have largely preserved „many of the institutional attributes \nof the past system‟ under the surface (Gains et al. 2005: 26). Similarly, Leach and Copus \n(2004: 353) find that in most councils the scrutiny function remains underdeveloped as the \nresult of „the intransigent nature of most party group behaviour‟. Thus the requirements to \nimplement this model have largely reinforced existing trends towards the centralisation of \ndecision-making within councils (John 2004). Nonetheless, Gains et al. (2005) and John \n(2004) are also keen to stress is that these types of change take time to bed in and they detect \na dynamic whereby as more and more authorities make them work, others are likely to \nfollow.  \n \nDiscussion: Key Themes and Future Research  \n \nThis section develops the discussion further with the aim of placing some of these policy \ndevelopments in a wider historical and political context. It identifies some key findings and \nhypotheses and proposes questions for further research. The discussion is organised in four \nsections: the persistence of centralism and the passivity of the locality, the resilience of \ndepartmentalism, the continuing significance of party and central-local relations.  \n \nThe Persistence of Centralism and the Passivity of the Locality \n \nThe strong message of the LGMA studies is that central government is driving change with \nlocal authorities taking their cues from the centre rather than the locality. Stewart (2000: \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n12 \n101), a seasoned observer of British local government, notes that local government has been \ncurrently „curiously passive‟ with individual authorities experiencing central policies as \nimposed so that „metaphors that imply interaction, such as “partnership” or “resource-\nexchange”, seem far away from the reality of central-local relationships as experienced in \nmany authorities‟ (2000: 102). Certainly, he sees little evidence to support any alternative \nthesis along the lines of locally-based networks with a „self-governing‟ momentum stressed \nby Rhodes (1997). It should be added that this passivity and deference towards the centre is \nthe norm rather than the exception in the history of British local government. Past instances \nof local authority resistance to the centre, notably during the politically turbulent 1980s, have \nbeen historical anomalies. Even then, those Labour authorities which challenged the \nConservative central government did so for partisan rather than territorial reasons (Lansley et \nal. 1989). The long-standing nationalisation of local politics has always limited the forces of \nlocalism. \n \nHistorically, policy-makers and reformers at the centre have sought to manage local \nauthorities by influencing the officer structure and forming alliances with them usually \nagainst local politicians. This is exactly the reforming strategy which Edwin Chadwick and \nother reformers advocated in the mid nineteenth century (Laffin 1986: 37-40). CPA is \nstrongly in this tradition. It has worked because CPA has acquired the crucial support of local \nallies, mainly chief executives and other senior officers rather than among the elected \nmembers, essentially because the formers‟ career prospects and even survival have come to \nhinge on the CPA results. CPA has also worked because it was backed by an enforcement \nsystem capable of detailed monitoring and able to penalise errant authorities in the form of \nthe Audit Commission with its powers of „naming-and-shaming‟. Thus, it could be proposed \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n13 \nthat the capacity of the centre to implement policies require, as necessary and sufficient \nconditions, the support of local allies plus an enforcement mechanism.  \n \nNonetheless, the extent and specificity of central government intervention is historically \nunparalleled. As I have argued elsewhere (Laffin 2006) in more nuanced detail, during the \npostwar „Golden Age‟ of public service expansion the concerns over local autonomy were \nmuted. Local authorities enjoyed sustained growth and mostly followed the centrally-\nsponsored and profession-dominated consensus across the major policy areas. During their \nperiod of office, the Conservatives pursued a politics of austerity (arguably with limited \nimpact on the overall levels of public expenditure) which involved them seeking detailed \ncontrol over local government spending. Once New Labour entered office, Labour ministers \nsought to reinvest in the public services, especially after 2000. New Labour has increased \nspending but in a tightly controlled way, concerned to gain value for money but also to limit \nthe possibilities of a resurgence of producerist interests, especially public sector unionism, \nand the urban left of the 1980s. In particular the origins of Best Value and political \nmodernisation lie in the pursuit of Labour electability and the need to reform the Labour \nparty locally (Entwistle and Laffin 2005).  \n \nMeanwhile, as the LGMA studies show, LPSAs have not fulfilled their promise of \nrebalancing the central-local relationship. LPSAs appear to involve an element of negotiation \nor bargaining between the centre and individual local authorities. They are based on a \ncontractual view of the relationship in which central government actors, as the principal, \nspecify what they expect from individual local authorities, the agents. Indeed, the default \nsetting for the big Whitehall service departments is that local authorities are their agents and, \ntherefore, departments have seen the LPSAs as control mechanisms. Accordingly, some of \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n14 \nthe LGMA studies report an assumption among central actors that is those in local \ngovernment, not them, who have to adapt (for example Sullivan and Gillanders 2005). This \nfailure suggests that such policy planning systems cannot in themselves change relationships \nbut are bound to replicate the underlying power asymmetries. Even so, it may be that some \nauthorities are more effective than others in extracting concessions from the centre – do \nLPSA negotiations take place outside the „political‟ arena? are big, political significant \nauthorities, more successful at playing this game than smaller authorities?  \n \nThe advent of Local Area Agreements (LAAs), which enable funds to be allocated jointly to \nlocal authorities and other local agencies, raises similar questions about central-local \nrelationships. Are LAAs reshaping central-local relations? LAAs could also contribute to a \nbottom-up driven change within central departments as the latter respond to new priorities \nexpressed via the LAAs. But does central government have the capacity, quite apart from the \nwillingness, to build on LAAs? could managing through LAAs kick-start a more corporate \napproach towards devolved government in Whitehall? Do the regional-level Government \nOffices, responsible for negotiating then, have to capacity to do so? In 2006 the Government \nannounced its intention „to move the GOs from being mainly administrative, programme-\nfocused organisations to strategic and transformational offices that add real value in \nsupporting the delivery of key local and regional outcomes‟ (para. 4.8) but with a reduction \nof a third in staff (HM Treasury 2006).  The new expectation that GOs should be „strategic‟ \nand „transformational‟ seems to contrast sharply with their capacity and size. GOs are \nrelatively small with limited representation from the Senior Civil Service. Thus local \ngovernment chief officers and leading local councillors can find themselves dealing with \nlower middle-level officials, whom they often perceive as having a less certain grasp of „how \nthings work‟ than themselves. This anecdotal evidence suggests that GOs have some way to \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n15 \ngo if they are to fulfil the role identified by Treasury. That role would also suggest that GOs \nwould need greater discretion than they presently enjoy. Yet the more discretion they enjoy, \nthe less legitimacy they will have in the absence of any oversight from a regionally-elected \nlevel of government. Again there is scope for research to track how far GOs are acquiring an \nenhanced and „transformational‟ role. \n \nMeanwhile, at the local level LAAs could pose interesting and new political-bureaucratic \nchallenges for senior councillors and officers – how do they seek to manage these \npartnerships? Are policy outcomes as well as processes changing? More generally, the \ngrowing complexity of the central-local relations system could be creating new possibilities \nfor those in local authorities to use the system actively rather than passively as traditionally \nhas been the case, but is this happening? Is complexity enabling authorities to respond \nflexibly to „local problems‟? Do they as individual authorities take a strategic view of these \nand try to manage their relationship in such a way as to preserve some local discretion and\/or \nimplement their own priorities despite these planning systems?  \n \nThe Resilience of Departmentalism \n \nParadoxically, although the LGMA studies are ostensibly about local government, they \ncontain important findings about the current working of central government. The government \nhas signally failed to impose a consistent strategy across its dealings with the devolved public \nservices despite the pronounced centralising trends of both the Prime Minister and \nChancellor. Despite the rhetoric of „joined-up‟ government, the LGMA studies identify a \nwide range of policy inconsistencies in central government‟s approach to local government. \nThese inconsistencies have left those in local authorities trying to manage upwards as they \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n16 \nstruggled to make up for the coordination deficit. Stoker (2004) argues that these policy \ninconsistencies reflect a strategy of „government by lottery‟. This policy randomness is \nactually a deliberate New Labour strategy intended to destabilise local actors to encourage \nthem to unlearn old ways and embrace the new ways of working endorsed by the \ngovernment. As Coulson (2004) argues, a more conventional explanation is both more \nplausible and economical. Thus these inconsistencies reflect Whitehall‟s deeply \ndepartmentalised nature with ministers themselves competing with each other, pursuing new \ninitiatives without considering how these fit into any overall strategy for government. Not \nleast, of course, service ministers tend to favour greater central controls to advance their own \nservices.  \n \nThis finding of a resilient departmentalism confirms the findings of earlier Whitehall research \nstudies. Marsh and colleagues, for instance, conclude that „despite the attempts to “join-up” \ngovernment, departments continue to segment the operation of the executive‟ (Marsh et al. \n2001: 249). The recent capability reviews of central departments reach similar conclusions \n(the capability reviews are a central government version of the CPA but have narrower remits \nand are overseen by the Cabinet Office and not by an independent body). Nearly all the \ntwelve Whitehall departments scrutinised to date are criticised for a lack of collaboration with \nother departments. CLG itself faces an uphill struggle to assert itself as the coordinating \ndepartment for local government against the over-weaning influence of the service \ndepartments. Although the CLG Permanent Secretary is fighting back. In his response to his \nDepartment‟s Capability review he proposes „delivery agreements‟ „with key government \ndepartments within the next six months, which [will] establish a shared view of the priority \ntasks we need to deliver together‟ (Cabinet Office 2006: 6). Of course, coordination problems \nare endemic in government and policy-makers can never escape such tensions, perhaps \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n17 \ncontrary to received wisdom among some government advisers. Are these problems simply \nendemic? Or do they reflect, at least in part, political and\/or bureaucratic failings quite \nspecific to this government or to this period in time? Can a reinvigorated local government \nministry, in the form of CLG, achieve its newly-stated or restated ambition of coordinating \nthe service departments? \n \nCowell and Martin (2003: 177) question whether existing policies will be able to achieve the \ntypes of joined-up government currently advocated by government. They identify a pay-off \nbetween greater vertical integration between central ministries and local delivery agencies \nand less horizontal integration at the local level. Thus supporting a working hypothesis that \nthe stronger the vertical, top-down central-local structures, the weaker will be the horizontal \nrelationships. This hypothesis, of course, implies that the central push for greater local \n„community leadership‟ conflicts with the pull of the compliance culture generated by tight \ncentral requirements and inspectorates.      \n \nThe limited remit of LGMA studies has meant that LGMA researchers have not been able to \nexplore the relative impact of other central policies directed at local services. Although, they \nreport a great deal on the local problems of joining up central initiatives, they have little to \nsay on the major changes to local authorities‟ departmental structures. Yet local authorities \nare shifting towards multi-disciplinary and problem-focussed organisations in which \ntraditional professional competencies and commitments are losing their status. The best \nexample of this shift are the directorates of children‟s services in which all top tier and \nunitary authorities are compelled, under the Every Child Matters agenda and the Children‟s \nAct 2004, to bring together all services relating to children. As a result the new directorates \nare mega-department responsible for approaching three-quarters of these authorities‟ budgets. \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n18 \nThis requirement follows the 2004 Laming Report into the death of a child which the various \npublic services involved had failed to prevent through poor interagency coordination and \nother problems. But as yet little is known about how this restructuring is changing internal \nrelationships. Are local authorities more effectively joining-up services, both internally and \nwith other agencies, through these enlarged departments? What are the knock-on effects for \nother services? How has professionalism and professional influence, long identified by critics \nas an endemic weakness of local government, been affected by this restructuring? \n \nThe Continuing Significance of Parties \n \nThe LGMA policies assumed that the traditional party mechanisms needed to be modernised \nand complemented, even over-ridden, by elected mayors, executive members and new forms \nof participatory democracy. The LGMA studies necessarily refer back to official policy \nrationales and objectives and mostly evaluate the LGMA policies in those terms. However, \npowerful reasons also exist for the Labour parliamentary leadership to be anxious to „reform‟ \nlocal government. During the 1980s and 1990s that leadership had identified Labour local \nauthorities, especially those captured by the left and afflicted with overbearing union \nmilitancy, as major reasons for Labour‟s loss of electoral credibility nationally. So significant \neffort was put into designing policies, such as Best Value and political modernisation (seen as \na way of marginalising party activists), to improve the image of Labour local government and \nreduce the influence of the local government unions (Entwistle and Laffin 2005). The LGMA \nresearchers overlook these party political drivers, even in their academic outputs..  \n \nThe political modernisation of council decision-making, then, had as much to do with \nreforming the Labour party as it did with reforming local government. Political \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n19 \nmodernisation won little support among Labour local councillors, and for that matter from the \nother main parties as well, who mostly responded in a passive-aggressive way. As Lowndes \nand Wilson (2003: ) point out, political modernisation illustrates an old lesson of \nadministrative reform – while it is relatively easy to change organisation forms, the \nunderlying institutional patterns usually prove less tractable. The weak implementation of \nmodernisation also supports another lesson of administrative reform, a lesson often neglected \nin both the British and the international literature on administrative reform, that these reforms \nare fundamentally political. Thus, as proposed earlier in relation to CPA, to be effective \ncentral government interventions require both local allies and an enforcement mechanism. \nThus CPA has had a greater impact on local authorities than political modernisation which \nlacks such allies and an enforcement mechanism.  \n \nThe local branches of the national parties, not the least the Labour party as the main object of \nmany of these reforms, remain resistant to reform. Pratchett (2004: 222) notes that over the \nlast ten years the main political parties have further increased their dominance of local \ngovernment, yet at the same time the decline in party membership poses pressing questions \nover the continuing effectiveness of the party as the democratic link between citizen and \ngovernment. Copus (2004: 277) argues that the political parties have become exclusive, \nalienating rather than engaging citizens locally. The introduction of the „executive-\nlegislative‟ distinction into local government, grouping councillors into „executive members‟ \nand backbenchers sitting on „scrutiny‟ committees has been achieved less effective scrutiny \nthan expected. Leach (2006: 136), drawing on the LGMA studies, concludes that „many \nauthorities have found it difficult to move away from the traditional agendas, processes and \nreports of the old committee system‟ which impede scrutiny. \n \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n20 \nThe LSPs offer a potential alternative link between the citizen and government. Skelcher \n(2004, p. 41) accepts the continuing decline in traditional electoral politics but discerns „signs \nof a new politics emerging around some partnership activity in a way that mobilizes and \nengages citizens in the governance of their communities‟ but is not more specific. Of course, \npartnerships do not necessarily increase participation, as Skelcher recognises. Geddes (2006: \n830) is pessimistic and sees LSPs as entrenching rather than challenging the status quo. \nGeddes et al.‟s (2007) LSP evaluation do not provide the right evidence to test this argument \nas it relies heavily on the comments of those directly involved and does not analyse them \nwithin their broader local political settings. Although, as Geddes et al. point out, LSPs are the \ntype of institutional innovation which needs time to bed in. The difficulty as well with LSPs \nis that they have been seen as a „one-size-fits-all‟ solution yet, like all partnerships, to work \nthey require consensus and tend to lack conflict resolution mechanisms. There is also a \ncollective action problem. Local authorities have strong incentives to establish partnerships as \nthese are now objects of inspection under the CPA, yet the other partners do not have the \nsame incentives. The voluntary sector has the incentive of grants but other statutory agencies \nand business have little incentive to become involved. Are LSPs, then, simply recasting \nexisting power relationships? How do they relate to the political parties? It would be useful to \nhave studies of LSPs which locate them in the context of local politics. Thus scope exists for \nstudies of the external as well as the internal relationships of local authorities. Studies of local \nauthorities or local political systems „in the round‟ (e.g. Dearlove, 1974, Newton 1976, \nSaunders 1979) have gone out of fashion. Notably, Pratchett (2004: 229) refers to two studies \nnow over 30 years old (Jones 1969 and Newton 1976) as still providing „valuable insights \ninto the significance of local politics and the different ways it works‟. These earlier studies \nare refreshingly readable and give insights into the realities of local politics all too often \nmissing from the more recent literature. They do convey a sense of the realities of local \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n21 \npolitics and, influenced by the US community power debate of the time, pose issues of power \nand conflict – political versus professional-bureaucratic power, managers versus unions and \nparty versus pressure group politics.  \n \nOf course, such locally-focussed studies can exaggerate the autonomy of the local. They have \nan in-built bias against exogenous factors such as the socio-economic characteristics of the \nlocality. The work of Andrews et al. raises key issues here (Andrews et al., 2005; Andrews et \nal. 2006). They refer back to an older tradition of local government research which stresses \nexternal constraints on inter-authority variations in expenditure decisions (Danziger 1978, \nSharpe and Newton 1984) and pinpoint a serious weakness of the Audit Commission‟s \napproach to CPA. They find that those councils which enjoy the advantages of large size and \neconomic prosperity are more likely to achieve high ratings than those which face diverse \nservice needs. As they stress, this conclusion has important practical policy implications at a \ntime when central government is making decisions to intervene or issue plaudits to authorities \nbased on CPA ratings.  \n \nCentral-Local Relations and the Non-Local Determinants of Local Policy  \n \nAlthough the LGMA studies are relevant to central-local relations, those relations remain \nunder-researched. Yet, as the earlier discussion makes clear, a full understanding of local \ngovernment requires an appreciation of the political and administrative dynamics at the \nnational level. My own research, with a colleague, has shown how the intra-party politics of \nthe Labour party shaped Best Value and other modernisation policies (Entwistle and Laffin \n2005) and how the decline of professional influence nationally has had major implications for \nprofessional power and traditional departmental structures locally (Laffin and Entwistle \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n22 \n2000). This research suggests that Dunleavy‟s criticism of an earlier local government \nliterature remains valid today for the LGMA studies – that they under-estimate the \nconsequences for local policy outcomes of the non-local factors of national party control, the \nlocal government professions (or nowadays their fluctuating fortunes) and big business based \noutside the locality (Dunleavy 1980). To this list, as local government has become local \ngovernance, four further sources of real or potential non-local influence can be added. Firstly, \nthe other vertical policy hierarchies which have their own „siloed‟ interests – for example the \nhealth service, the Home Office plus the police and the Housing Corporation plus housing \nassociations. Secondly, the inspectorates (such as the Audit Commission) which arguably \nhave become key mechanisms whereby central policymakers learn about the state of local \ngovernment. Thirdly, the new type of commercial service companies, like SERCO and \nCAPITA, which have come to play a prominent role in service delivery, initially in the more \nroutine functions but increasingly in managing more complex tasks in education and other \nareas. Fourthly, the „mega-charities‟ which have become increasingly involved in service \ndelivery and bring a different set of concerns to delivery from those of local authorities. The \nsignificance of these sources of policy influence, at both national and local levels, represent a \nvital agenda for further research (for more details see Laffin 2006). \n \nConclusions  \n \nThis review of the LGMA studies has sought to put a different, less official spin on the \nresearch findings generated by the LGMA research studies. Significant scope does exist for \nthese findings to be interpreted in a wider historical and political context. Indeed, the LGMA \ncase illustrate the need for research on public service reform to include analyses of the \npolitical origins of reform policies and the political-bureaucratic issues involved in their \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n23 \nimplementation. Specifically, in the case of LGMA these imperatives include those of party \nelectability, managing intra-party tensions and the crucial relationship with the public sector \nunions. These imperatives are vital to any explanation of why New Labour has attached such \nimportance to local government reform. Not least, too, future research needs to rediscover the \nvalue of studying local politics in the round, the impact of socio-economic factors on local \npolicy outcomes and the vital role of central-local relations.  \n \nReferences \n \nAndrews, R., Boyne, G., Law, J. and Walker, R. (2005), External Constraints on Local \nService Standards: The Case of Comprehensive Performance Assessment in English Local \nGovernment, Public Administration 83 (3), pp. 639-656. \n \nAndrews, R., Boyne, G. and Enticott, G. (2006), Performance Failure in the Public Sector: \nMisfortune or mismanagement? Public Management Review 8 (2), 273-296. \n \nAshworth, R. and Skelcher, C. (2005), Meta-Evaluation of the Local Government \nModernisation Agenda: Progress Report on the Accountability of the Best Value Regime \n(London: ODPM). \n \nBovaird, A. and Martin, S. (2003) Evaluating the Local Government Modernisation Agenda: \n„joined up‟ local government research”, Local Government Studies, 29 (4):17-30.  \n \nBrooks, J. (2000), Labour‟s Modernisation of Local Government, Public Administration, 78 \n(3): 593-612. \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n24 \n \nCabinet Office (2006), Capability Review of Communities and Local Government (London: \nCabinet Office). \n \nCabinet Office (2006a), Partnership in Public Services: an action plan for third sector \ninvolvement (London: Cabinet Office). \n \nCopus, C. (2004), Party Politics and Local Government (Manchester: Manchester University \nPress). \n \nCoulson, A. (2004), New Labour and the Politics of Local Governance, Local Government \nStudies, 30 (1): 108-115.  \n \nCowell, R. and Martin, S. (2003), The Joy of Joining Up: Modes of Integrating the Local \nGovernment Modernisation Agenda, Environment and Planning C: Government and Policy, \n21: 159-179. \n \nDanziger, J. (1978), Making Budgets (London: Sage). \n \nDavis, H., J. Downe and S. Martin (2004), The Changing Role of the Audit Commission \nInspection of Local Government (York: Joseph Rowntree Foundation). \n \nDowne, J. and Martin, S. (2006), Joined Up Policy in Practice? The Coherence and Impacts \nof the Local Government Modernisation Agenda, Local Government Studies, 32 (4): 456-\n488. \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n25 \n \nDunleavy (1980), Urban Political Analysis (London: Macmillan). \n \nEntwistle, T., Martin S. and Enticott, G., Leadership and Service Improvement: Dual Elites or \nDynamic Dependency? Local Government Studies, 31 (5): 541-554. \n \nEntwistle, T. and Laffin, M. (2003), The Multiple Strategies of the Local Government \nAssociation: Partner, Player or Think-tank? Policy and Politics 31 (1): 37-50.  \n \nEntwistle, T. and Laffin, M. (2005), „The Prehistory of the Best Value Regime‟, Local \nGovernment Studies, 31 (2): 205-218. \n \nGains, F., Peter, J. and Stoker, G. (2005), Path Dependency and the Reform of English Local \nGovernment, Public Administration, 83 (1): 25-45. \n \nGeddes, M. (2006), „Partnership and the Limits to Local Governance in England: \nInstitutionalist Analysis and Neoliberalism‟, International Journal of Urban and Regional \nResearch, 30 (1): 76-97. \n \nGeddes, M. Davies, J. and Fuller, C. (2007), Evaluating Local Strategic Partnerships: Theory \nand Practice of Change, Local Government Studies 33 (1): 97-116. \n \nGoldsmith, M. and E. Page (1987), Britain‟ in Goldsmith and Page (ed.), Central and Local \nGovernment Relations: A Comparative Analysis of West European Unitary States (London: \nSage): 68-87. \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n26 \n \nJohn, P (2004), Strengthening Political Leadership: More than Mayors? in Stoker and \nWilson: 25-42. \n \nLaffin, M. (2007), „Comparative Central-Local Relations: Regional centralism, governance \nand intergovernmental relations‟, Public Policy and Administration, 22, 1.  \n \nLaffin, M. and T. Entwistle (2000) „New Professions, Old Problems: The Changing National \nWorld of the Local Government Professions‟, Policy and Politics, 28, 2, pp. 207-220. \n \nLaffin, M. (2006), Rediscovering Central-Local Relations in England, paper presented to the \nPublic Administration Committee Annual Conference, Durham University, 4-6\nth\n September. \n \nLaffin, M. (1986), Professionalism and Policy: the Role of the Professions in the Central-\nLocal Government Relationship (Aldershot: Gower). \n \nLansley, S., S. Goss and C. Wolmar (1989), Councils in Conflict: The Rise and Fall of the \nMunicipal Left (Basingstoke: Macmillan). \n \nLeach, S. (2006), Local Politics in Britain (Policy Press: Bristol). \n \nLeach, S. and Copus, C. (2004), Scrutiny and the Political Party Group in UK Local \nGovernment: New Models of Behaviour, Public Administration 82 (2): 331-354. \n \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n27 \nLowndes, V. (1999), Management Change in Local Governance in G. Stoker (ed.),  The New \nManagement of British Local Government (Basingstoke: Macmillan): 22-39. \n \nLowndes, V. and Wilson, D. (2003), Balancing Revisability and Robustness? A New \nInstitutionalist Perspective on Local Government Modernisation, Public Administration, 81 \n(2): 275-298. \n \nMarsh, D., Richards, D. and Smith, M. (2001), Changing Patterns of Governance in the \nUnited Kingdom: Reinventing Whitehall? (Basingstoke: Palgrave). \n \nMartin, S. (2003), Local Government Research: Carers, Coroners or Collaborators? paper \npresented to ESRC Seminar Series on „Local Government and Local Governance‟, University \nof Birmingham. \n \nMartin, S. J. (2005), Public Service Improvement: Current Developments and Future \nResearch Agendas, Local Government Studies, 31 (5): 531-2005.  \n \nMartin, S. J. and Bovaird, A. (2005), Meta-Evaluation of the Local Government \nModernisation Agenda: Progress Report on Service Improvement in Local Government \n(London: ODPM). \n \nNewton, K. (1976), Second City Politics: Democratic Processes and Decision-Making in \nBirmingham (Oxford: Oxford University Press). \n \nODPM (2004), Local Area Agreements: A Prospectus (ODPM: London). \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n28 \n \nPratchett, L. (2004), Making Local Politics Work in Stoker and Wilson, British Local \nGovernment: 213-229. \n \nRhodes, R. (1997), Understanding Governance: Policy Networks, Governance, Reflexivity \nand Accountability (Buckingham: Open University). \n \nRhodes, R. (1986), The National World of Local Government (London: Allen & Unwin). \n \nSaunders, P. (1979), Urban Politics: A Sociological Interpretation (London: Hutchinson). \n \nSharpe, L. J. and Newton, K. Does Politics Matter? (Oxford: The Clarendon Press). \n \nSkelcher, C. (2004), The New Governance of Communities, in Stoker and Wilson, British \nLocal Government. \n \nStewart, J. (2000), The Nature of British Local Government (Basingstoke: Palgrave). \n \nStewart, J. (2003),  Modernising British Local Government: An Assessment of Labour’s \nReform Programme (Basingstoke: Palgrave). \n \nStoker, G. (2004), Transforming Local Government: From Thatcher to New Labour \n(Basingstoke: Palgrave). \n \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n29 \nStoker, G. F. Gains, P. John, N. Rao and A. Harding (2003), Implementing the 2000 Act with \nRespect to New Council Constitutions and the Ethical Framework (Manchester: IPEG). \n \nStoker, G. and Wilson, D. (2004), British Local Government into the 21\nst\n Century \n(Basingstoke: Palgrave). \n \nSullivan, H. and Gillanders, G. (2005), Stretched to the Limit? The Impact of Local Public \nService Agreements on Service Improvements and Central-Local Relations, Local \nGovernment Studies, 31 (5): 555-574. \n \nSullivan, H., Barnes, M. and Matka, E. (2006), Collaborative Capacity and Strategies in \nArea-Based Initiatives, Public Administration84 (2): 289-310. \n \nSullivan, H., Downe, J. , Entwistle, T. and Sweeting, D. (2006), The Three Challenges of \nCommunity Leadership‟, Local Government Studies, 32 (4): 489-508. \n \nSullivan, H., Knops, A., Barnes, M. and Newman, J. (2004), Central-local Relations in an Era \nof Multi-Level Governance: The Case of Public Participation Policy in England, 1997-2001, \nLocal Government Studies, 30 (2): 245-265.   \n \nTurner, D.  and Whiteman, P. (2005), Learning from the Experience of Recovery: The \nTurnaround of Poorly Performing Local Authorities, Local Government Studies, 31 (5): 627-\n654. \n \n \ns:\\staff\\dro - durham research online\\fulltext\\departments\\business school\\5567\\local government modernisation in england.doc \n30 \n \n"}