{"doi":"10.1080\/0968776010090305","coreId":"14239","oai":"oai:generic.eprints.org:359\/core5","identifiers":["oai:generic.eprints.org:359\/core5","10.1080\/0968776010090305"],"title":"Can virtual seminars be used cost‐effectively to enhance student learning?","authors":["Halfpenny, Peter","Wellings, Sonja"],"enrichments":{"references":[{"id":1042986,"title":"C&IT and the learning society - some post-Dearing thoughts',","authors":[],"date":"1997","doi":null,"raw":"Timms, D. (1997), 'C&IT and the learning society - some post-Dearing thoughts', SocInfo Journal, 3 (December), 2-11.","cites":null},{"id":1879922,"title":"Can virtual seminars be used cost-effectively to enhance student learning?","authors":[],"date":"1997","doi":"10.1080\/0968776010090305","raw":"siPeter Halfpenny and Sonjo Wellings Can virtual seminars be used cost-effectively to enhance student learning? Davis, N. (1997), 'Do electronic communications offer a new learning opportunity in education?', in B. Somekh and N. Davis (eds), Using Information Effectively in Teaching and Learning, London: Routledge.","cites":null},{"id":198323,"title":"Co-operative learning and achievement',","authors":[],"date":"1990","doi":null,"raw":"Johnson, D. W. and Johnson, R. T. (1990), 'Co-operative learning and achievement', in S. Sharan (ed.), Cooperative Learning: Theory and Research, New York: Praeger.","cites":null},{"id":198325,"title":"Computer mediated tutorial support for conventional university courses',","authors":[],"date":"1997","doi":"10.1046\/j.1365-2729.1997.00025.x","raw":"Light, P., Colbourn, C. and Light, V. (1997), 'Computer mediated tutorial support for conventional university courses', Journal of Computer Assisted Learning, 13, 228-35.","cites":null},{"id":198316,"title":"Computer systems for distributed and distance learning',","authors":[],"date":"2000","doi":"10.1046\/j.1365-2729.2000.00134.x","raw":"Anderson, M. and Jackson, D. (2000), 'Computer systems for distributed and distance learning', Journal of Computer Assisted Learning, 16, 213-28.","cites":null},{"id":1042982,"title":"Computer-mediated communication as a learning resource',","authors":[],"date":"1997","doi":"10.1046\/j.1365-2729.1997.00024.x","raw":"McAteer, E., Tolmie, A., Duffy, C. and Corbett, J. (1997), 'Computer-mediated communication as a learning resource', Journal of Computer Assisted Learning, 13, 219-27.","cites":null},{"id":198322,"title":"Global Networks:","authors":[],"date":"1993","doi":"10.2307\/1576017","raw":"Harasim, L. (1993), Global Networks: Computers and International Communication, Cambridge, Mass.: MIT Press.","cites":null},{"id":1042987,"title":"Implementing a CMC tutor group for an existing distance education course',","authors":[],"date":"2000","doi":"10.1046\/j.1365-2729.2000.00129.x","raw":"Weller, M. (2000), 'Implementing a CMC tutor group for an existing distance education course', Journal of Computer Assisted Learning, 16, 178-83.","cites":null},{"id":1042983,"title":"Institutional design for group-based learning by computerconferencing', in","authors":[],"date":"1997","doi":null,"raw":"Pincas, A. (1997), 'Institutional design for group-based learning by computerconferencing', in C. Bell, M. Boroden and A. Trott (eds), Independent Flexible Learning, London: Kogan Page.","cites":null},{"id":198320,"title":"Looking backwards: US efforts to use technology to transform undergraduate education',","authors":[],"date":"1994","doi":null,"raw":"Ehrmann, S. (1994), 'Looking backwards: US efforts to use technology to transform undergraduate education', in J. Martin, J. Darby and B. Kjollerstrom (eds), Higher Education 1998 Transformed by Learning Technology, Oxford: CTISS Publications.","cites":null},{"id":198318,"title":"Making hypertext lecture notes more interactive: undergraduate reactions',","authors":[],"date":"1997","doi":"10.1046\/j.1365-2729.1997.00026.x","raw":"Crook, C. (1997), 'Making hypertext lecture notes more interactive: undergraduate reactions', Journal of Computer Assisted Learning, 13, 236-44.","cites":null},{"id":198319,"title":"NetSem: electrifying undergraduate seminars',","authors":[],"date":"1995","doi":null,"raw":"Duffy, C., Arnold, S. and Henderson, F. (1995), 'NetSem: electrifying undergraduate seminars', Active Learning, 2, 52-48.","cites":null},{"id":198324,"title":"Rethinking University Teaching: A Framework for the Effective Use of Educational Technology,","authors":[],"date":"1993","doi":"10.4324\/9780203304846","raw":"Laurillard, D. (1993), Rethinking University Teaching: A Framework for the Effective Use of Educational Technology, London: Routledge.","cites":null},{"id":1042984,"title":"Sociology: the internet as an extended classroom',","authors":[],"date":"1998","doi":"10.1177\/089443939801600107","raw":"Schneider, A. (1998), 'Sociology: the internet as an extended classroom', Social Science Computer Review, 16, 40-52.","cites":null},{"id":198317,"title":"The geology@bristol experience',","authors":[],"date":"1995","doi":null,"raw":"Browning, P. and Williams, J. (1995), 'The geology@bristol experience', Active Learning, 2 (July), 34-8.","cites":null},{"id":1042985,"title":"Using IT to manage a third year module',","authors":[],"date":"1997","doi":null,"raw":"Stainfield, J. (1997), 'Using IT to manage a third year module', Active Learning, 6, 30-4.","cites":null},{"id":198321,"title":"Using Virtual Seminars to Enhance Student Learning,","authors":[],"date":"2000","doi":"10.3402\/rlt.v9i3.12039","raw":"Halfpenny, P. and Wellings, S. (2000), Using Virtual Seminars to Enhance Student Learning, Manchester: Centre for Applied Social Research, University of Manchester.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2001","abstract":"This paper describes a virtual seminar initiative designed to investigate the extent to which computer‐mediated communication (CMC) can cost‐effectively strengthen staff‐student interaction and enhance student group discussion, and thereby improve collaborative learning. After setting the scene by means of a brief review of the discursive potential of CMC, the establishment of an asynchronous bulletin board system on three modules in the Department of Sociology at the University of Manchester using industry standard software is described. Detailed time diaries kept by all staff involved revealed that organizing and running the virtual seminars were very much less time‐consuming than running face‐to‐face seminars. However, analysis of the students’ access to and mage of the virtual seminars indicates that some of them were disadvantaged by CMC and that they favoured face‐to‐face contact with lecturers over virtual seminars. The latter should therefore be part of a portfolio of teaching techniques rather than the sole form of collaborative learning. The conclusion is that a significant obstacle to benefiting from CMC is the further demand on staff time that results from adding virtual seminars as a supplement to existing teaching practices. Even though these extra demands may be modest, effectively deploying the discursive potential of CMC to enhance student learning increases staff effort rather than reducing it, as many have hoped or promised it would","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14239.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/359\/1\/ALT_J_Vol9_No3_2001_Can%20virtual%20seminars%20be%20used%20c.pdf","pdfHashValue":"2212c446f64a9fca77363d6fc792c9f317ed7e7b","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:359<\/identifier><datestamp>\n      2011-04-04T09:13:09Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/359\/<\/dc:relation><dc:title>\n        Can virtual seminars be used cost‐effectively to enhance student learning?<\/dc:title><dc:creator>\n        Halfpenny, Peter<\/dc:creator><dc:creator>\n        Wellings, Sonja<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        This paper describes a virtual seminar initiative designed to investigate the extent to which computer‐mediated communication (CMC) can cost‐effectively strengthen staff‐student interaction and enhance student group discussion, and thereby improve collaborative learning. After setting the scene by means of a brief review of the discursive potential of CMC, the establishment of an asynchronous bulletin board system on three modules in the Department of Sociology at the University of Manchester using industry standard software is described. Detailed time diaries kept by all staff involved revealed that organizing and running the virtual seminars were very much less time‐consuming than running face‐to‐face seminars. However, analysis of the students’ access to and mage of the virtual seminars indicates that some of them were disadvantaged by CMC and that they favoured face‐to‐face contact with lecturers over virtual seminars. The latter should therefore be part of a portfolio of teaching techniques rather than the sole form of collaborative learning. The conclusion is that a significant obstacle to benefiting from CMC is the further demand on staff time that results from adding virtual seminars as a supplement to existing teaching practices. Even though these extra demands may be modest, effectively deploying the discursive potential of CMC to enhance student learning increases staff effort rather than reducing it, as many have hoped or promised it would.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2001<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/359\/1\/ALT_J_Vol9_No3_2001_Can%20virtual%20seminars%20be%20used%20c.pdf<\/dc:identifier><dc:identifier>\n          Halfpenny, Peter and Wellings, Sonja  (2001) Can virtual seminars be used cost‐effectively to enhance student learning?  Association for Learning Technology Journal, 9 (3).  pp. 43-52.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776010090305<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/359\/","10.1080\/0968776010090305"],"year":2001,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Can virtual seminars be used cost-effectively to\nenhance student learning?\nPeter Halfpenny and Sonja Wellings\nUniversity of Manchester\nemail: p.halfpenny@man.ac.uk\nThis paper describes a virtual seminar initiative designed to investigate the extent to\nwhich computer-mediated communication (CMC) can cost-effectively strengthen staff-\nstudent interaction and enhance student group discussion, and thereby improve\ncollaborative learning. After setting the scene by means of a brief review of the discursive\npotential of CMC, the establishment of an asynchronous bulletin board system on three\nmodules in the Department of Sociology at the University of Manchester using industry\nstandard software is described. Detailed time diaries kept by all staff involved revealed\nthat organizing and running the virtual seminars were very much less time-consuming\nthan running face-to-face seminars. However, analysis of the students' access to and\nmage of the virtual seminars indicates that some of them were disadvantaged by CMC\nand that they favoured face-to-face contact with lecturers over virtual seminars. The\nlatter should therefore be part of a portfolio of teaching techniques rather than the sole\nform of collaborative learning. The conclusion is that a significant obstacle to benefiting\nfrom CMC is the further demand on staff time that results from adding virtual seminars\nas a supplement to existing teaching practices. Even though these extra demands may be\nmodest, effectively deploying the discursive potential of CMC to enhance student\nlearning increases staff effort rather than reducing it, as many have hoped or promised it\nwould.\nIntroduction\nWith the expansion of university student numbers over the past decade, deteriorating\nstaiT-student ratios have necessitated a re-evaluation of teaching and learning practices. In\ngeneral, the amount of direct contact between staff and students has diminished. Lecture\naudiences have grown larger and there is less opportunity within or immediately after\nlectures for interaction between students and lecturers. Seminars, classes and tutorials have\nalso grown and they often have fifteen or more students in them, allowing on average only\nfour minutes or fewer of active participation by each member over the course of an hour's\n43\nPeter Halfpenny and Sonja Wettings Can virtual seminars be used cost-effectively to enhance student learning?\nsession. These sessions are also increasingly taught by postgraduate teaching assistants,\nrather than the lecturers responsible for the modules, and some have become fortnightly\nrather than weekly. Overall, the opportunities for students to engage actively in group\ndiscussions guided directly by academic staff have decreased substantially - even though\nthis is widely recognized as one of the most effective learning experiences (Johnson and\nJohnson, 1990).\nA potentially cost-effective way of reintroducing staff-guided student collaborative learning\nis through virtual seminars - discussions that take place electronically over the campus\nnetwork. Virtual seminars have numerous virtues: they are independent of place and time in\nthat students can contribute whenever they wish from wherever they can access a networked\ncomputer; they permit many-to-many communication and enable collaborative learning\nthrough text-based interactions; they promote thoughtful and reflective commentary and\nheighten critical awareness; they improve accessibility and learner control by making it\ndifficult for one student to dominate the discussion and easier for shy students to contribute;\nand they encourage student-centred teaching (Davis, 1997; Duffy, Arnold and Henderson,\n1995; Harasim, 1993; Pincas, 1997; Stainfield, 1997). These features can give computer-\nmediated communication (CMC) advantages over traditional face-to-face tutorials. As the\nDearing Report noted, 'computer-based programmes, such as tutorials . . . can be highly\ninteractive and provide activities that students need to develop their understanding of\nothers' ideas and the articulation of their own' (Dearing, 1997, para 8.24).\nThe coming revolution?\nRapid advances in computing technology and the emergence of industry standard software\nover recent years has made educational applications of CMC more viable (Anderson and\nJackson, 2000; Ehrmann, 1994). Students come to university ever more computer literate\nand with prior experience of the Web. Staff have increasing knowledge of information and\ncommunications technologies and universities have been putting the infrastructure and\nsupport in place.\nFollowing these developments, there have been growing numbers of higher education\ncourses that are computer-assisted. In some cases the technology is still being used as a\nrepository, merely storing course materials, or an administrative tool for organizing\nteaching tasks. For example, Schneider (1998) describes how he set up a 'teaching home\npage' at the University of Texas Tech to provide course information which could be more\neasily accessed by students and readily updated to take account of current events and\nstudent feedback. Similarly, Browning and Williams (1995) suggest that CMC can be used\nto make lecture notes available to' students for extra revision or to catch up if they have\nmissed a lecture.\nIn other cases, the communicative potential of the technology is used to introduce an\ninnovative learning environment centred on asynchronous collaborative activities. For\nexample, Duffy et al (1995) describe how on-line undergraduate seminars in music history\nat the University of Glasgow took place using NetSem, a widely available asynchronous\nconferencing system. The reasons for introducing the system were primarily pedagogical:\nthe aim was to improve the quality of seminars by encouraging more active debate and\ndeveloping critical thinking skills. Students particularly valued the flexibility and\n44\nALT-J Volume 9 Number 3\nconvenience that the system offered (many contributions being made late at night or over\nthe weekend) and contributions were found to be relatively lengthy and well researched.\nThe investigators reported that the seminars provided students with a 'dynamic' and\n'enjoyable' experience and the staff involved concluded that seminar contributions\nproduced interesting, informed and engaged argument.\nIt was the discursive potential of CMC allied with concerns about the economics of on-\nline education that prompted the initiative described below.\nThe Manchester Sociology Department initiative\nIn the 1998\/9 academic year, the Department of Sociology at the University of Manchester\nwas awarded funding by the University-based Enterprise Centre for Learning and\nCurriculum Innovation to introduce an asynchronous bulletin board system on selected\nmodules. The aim was to investigate the extent to which CMC could cost-effectively\nstrengthen staff-student interaction and enhance staff-guided student group discussion, on\nthe assumption that this would improve learning.\nAfter taking the advice of technical staff and reviewing what systems had been used\npreviously in similar initiatives, three virtual seminars were set up on the faculty Web server\nby an information systems development officer using the Microsoft FrontPage bulletin\nboard facility. The seminars could be accessed from any Internet-connected computer\nusing standard Web browsers. Overall provision by the university at the time was\napproximately one networked computer per 12.5 students in the faculty.\nParticipants and procedure\nOne of the three selected modules was a final-year undergraduate course in Social\nDivisions (SD), taken by over fifty students. Teaching comprised a weekly one-hour\nlecture, following which the students were divided into four groups, each of which\nnormally met for weekly one-hour face-to-face tutorials. After forming the tutorial groups,\nthe members of one were told that the traditional face-to-face seminar was to be\nsubstituted in its entirety by a virtual seminar. The thirteen students in this group were\ngiven the option of switching to one of the remaining three face-to-face tutorial groups,\nbut none did. To prevent the virtual seminar from being perceived by students as merely\noptional - something that could be ignored - they were instructed to take part in\ndiscussing each week's lecture topic online. However, participation was not mandatory and\nstudents were not individually chided if they did not join the discussion.\nThe second module was a postgraduate class of thirty-two students taking a course in\nQualitative Research Methods (QRM). In this case, the virtual seminar acted as a\nsupplement to the weekly two-hour teaching period in which there was a lecture followed\nby face-to-face discussion between students and the lecturer. The students were encouraged\nto use the virtual seminar to continue the discussion or raise further issues, after first\nintroducing themselves and their research interests in the forum.\nFinally, one virtual seminar was set up as an adjunct to a postgraduate course on Research\nDesign (RD) taken by forty students. In this case, the students were informed that the\nseminar was available, but it was not incorporated into the teaching, which included\nlectures, demonstrations and class exercises in a weekly three-hour period.\n45\nPeter Halfpenny and Sonja Weffings Can virtual seminars be used cost-effectivel)' to enhance student learning?\nTwo control groups were identified in order that a comparison could be made of the staff\neffort involved in running and maintaining virtual seminars with the effort involved in\nrunning face-to-face tutorials. In the case of SD, the control was one of the other three\ntutorial groups for that module, which met weekly for a one-hour face-to-face discussion\nbetween the students and a postgraduate tutor. In the case of QRM, the control was\nanother postgraduate course with the same format of a weekly two-hour session that\nincluded both a lecture and a discussion period. For convenience this will be referred to as\nthe QRM face-to-face seminar, though it was a module on Conversation Analysis. There\nwas no control for the adjunct virtual seminar in RD.\nAll the virtual seminars took place in the second semester of the 1998\/9 academic year for\na period of ten teaching weeks. In each case the module lecturer acted as the moderator for\nthe virtual seminar. At the beginning of the semester, all students attended a half-hour\nhands-on training session on how to access their virtual seminar, how to read contributions\nand make their own, and how to abide by the rules of 'netiquette'.\nEvaluation methods\nIn order to monitor staff effort, all those involved in virtual seminar activity kept diaries in\nwhich they recorded the length of time taken on all virtual seminar-related activities. Staff\nresponsible for the control groups also kept records of the time they spent preparing for\nand running their face-to-face seminars.\nA short pre-seminar questionnaire was administered to students to assess their levels of\ncomputer literacy and to determine their access to networked computers. Students' use of\nseminars was monitored by a count of their contributions and simple content analysis of\nthe discussion threads. Student evaluation of the virtual seminars was obtained by means\nof a self-completion questionnaire administered at the end of the semester. The outcome\nof the investigation into student evaluation of the virtual seminars is reported in more\ndetail elsewhere (Halfpenny and Wellings, 2000). After briefly considering student usage,\nthis paper focuses primarily on staff effort involved in setting up and running the virtual\nseminars and their cost-effectiveness in enhancing staff-student interaction.\nAccess and usage\nLow levels of computer literacy, problems in accessing on-line learning facilities and\ntechnical difficulties experienced during use are commonly acknowledged limitations of\nmany computer-based teaching initiatives. However, in this study, computer literacy was\nhigh: on the preliminary questionnaire, 97 per cent of the students involved reported that\nthey used a computer for word-processing on a regular basis (that is, a few times a month\nor more), only 7 per cent said that they had never used the Web and 15 per cent that they\nhad never used email. The technical support made available throughout the semester was\ncalled upon only once. Responses to the student evaluation questionnaire indicate that\naccess was not a major difficulty for most participants in this study: 78 per cent of\npostgraduates and 80 per cent of undergraduates reported no problems, even though they\nrelied on heavily used campus computer clusters, with only 8 per cent of undergraduates\nhaving a network connection off-campus, although this figure rose to 40 per cent for the\npostgraduates.\nUsage of the virtual seminars varied, with the postgraduate QRM seminar attracting most\ncontributions: overall, 91 per cent of the thirty-two students in the group contributed and\n46\nALT-] Volume 9 Number 3\nbetween them they made seventy-four contributions. The SD virtual seminar attracted\neighteen contributions from 54 per cent of the thirteen students in the group. The quality\nof usage mirrored the quantity: compared with the undergraduate SD virtual seminar, in\nthe QRM postgraduate virtual seminar contributions were longer, discussion threads\ncontained more contributions, and more topics were student-initiated rather than tutor-\ninitiated. That the supplement QRM virtual seminar was both more used and more\nproductively used than the substitute SD virtual seminar was unexpected, given that the\nlatter group had no alternative means of accessing the module lecturer whereas the former\ngroup had a weekly face-to-face discussion period with their lecturer. This unanticipated\nfinding confirms the result of previous studies which have shown that pedagogic con-\nventions, including the prior learning experience and expectations of students, influences\ntheir engagement with on-line learning (Laurillard, 1993; Light, Colbourn and Light,\n1997; McAteer, Tolmie, Duffy and Corbett, 1997). In this case, the postgraduates - who are\nmore likely to take responsibility for their own learning than undergraduates - responded\nmore fully to the opportunity to participate in the virtual seminar, even though they had\nmore opportunities for face-to-face discussion than the undergraduates.\nThe RD adjunct virtual seminar, which unlike the other two virtual seminars was not\npromoted as an integral part of the teaching, was little used: only eleven contributions\nfrom 13 per cent of its forty student members. Because of the low usage, and the lack of a\ncontrol group, the RD seminar is not discussed further.\nThere was a noticeable gender disparity among contributors to the QRM virtual seminar\n(although not in the SD and RD virtual seminars). The group as a whole comprised\nnineteen women (59 per cent) and thirteen men (41 per cent). Of the twenty-five known\ncontributors (four others participated anonymously), ten were female (40 per cent) and\nfifteen were male (60 per cent). Males were also more likely to participate in the debates. Of\nthe seventy-four contributions made, fifty-six came from male participants (76 per cent).\nOthers have been alert to gender disparities in the use of CMC (for example, Light et al.,\n1997) and it might be that females perceive the technology as more suited to 'nerd' males.\nThe findings on access and usage reveal that some students were (at least initially) far less\nexperienced computer users than others, a minority did report that access was a problem,\nnearly half the undergraduates did not actively participate in their virtual seminar, and\nwomen contributed to the postgraduate virtual discussions less than men. In other words,\nsome students are disadvantaged by CMC and it is important to ensure that this is not to the\ndetriment of their learning. Avoiding this entails integrating virtual seminars into a portfolio\nof teaching techniques and not using CMC as the sole form of collaborative learning.\nStaff effort\nIt required remarkably little staff time to set up the virtual seminars. Because lecturers had\ncourse material readily available on disk, it took the IS development officer (who had\nprevious experience of FrontPage) no more than fifteen minutes per course to set up each\nvirtual seminar and transfer course material to the site. No further maintenance of the sites\nwas needed. The development officer also delivered the thirty-minute training sessions to\neacfi of the virtual seminar groups. Only one student asked for assistance subsequently,\nmaking an email enquiry concerning access. No other students or members of staff sought\nassistance of any kind.\n47\nPeter Halfpenny and Sonja Wellings Can virtual seminars be used cost-effectively to enhance student learning?\nSeminar type\nSD virtual\nSD face-to-face\nQRM virtual\nQRM face-to-face\nThe seminar\nSeminar\npreparation and\nadministration\n5\n657\n30\n410\nRunning\nthe\nseminar\n150\n565\n76\n1200\nCommunicating with individual\nstudents outside the seminar\nAcademic\nmatters\n5\n110\n172\n205**\nNon-\nacademic\nmatters\n65\n41\nOther*\n10\n200\n10\n0\nTotal time\n(minutes)\n170\n1597\n329\n1815\n*For virtual seminars 'other' was replying to emails; for face-to-face seminars 'other' was mainly photocopying.\n**For the QMR face-to-face control group, the lecturer did not distinguish between the time spent on\nacademic and non-academic matters.\nTable I: Time (in minutes) spent on seminar activities.\nStaff diary records reveal that the time they spent organizing and running seminars, and\ncommunicating with seminar students, was considerably less for the virtual seminars than\nfor the control face-to-face seminars (see Table 1). This is clearest in the case of SD, where\nthe virtual seminar was a substitute for a face-to-face one. The total time spent by the\nvirtual seminar tutor on all seminar-related activities (170 minutes) was around a tenth of\nthe time spent by the face-to-face tutor (1,597 minutes). Substituting a face-to-face seminar\nby a virtual one resulted in a major saving of staff time.\nFace-to-face SD seminar preparation involved spending time planning how to use the\nweekly discussion periods, which was not necessary for virtual seminars. Face-to-face\nseminar administration involved keeping a register of attendance and writing to absentees,\nwhereas there was less check on virtual seminar 'attendance' and messages were quickly\ntransmitted to students via the bulletin board or by email. Even if the time taken to set up\nthe SD virtual seminar (less than fifteen minutes) and the student training (thirty minutes)\nis included, the total time devoted to the preparation for and administration of the\nsubstitute virtual seminar (fifty minutes) was substantially less than for the control face-to-\nface seminar (657 minutes).\nRunning the substitute SD virtual seminar took much less time (150 minutes) than being\npresent throughout the weekly face-to-face tutorials (565 minutes), although it should be\nnoted that the time spent running the virtual seminar might have increased had students\nmade more use of it.\nTime spent talking with individual students outside the SD seminar about academic and\nnon-academic matters was much greater for the face-to-face seminar (175 minutes) than\nthe virtual seminar (five minutes), probably because the face-to-face tutor was on hand to\nbe approached. To a modest extent face-to-face talk was replaced by email communication\nbetween individual students and the virtual seminar tutor (ten minutes).\nThe face-to-face SD tutor spent over three hours (200 minutes) photocopying material for\nthe seminar, a task which the virtual seminar tutor was spared because material on disk\ncould be posted on the bulletin board in seconds. Even had the virtual seminar tutor\nchosen to distribute material that was initially in print form, scanning and posting it on the\n48\nALT-J Volume 9 Number 3\nbulletin board would have taken much less time than making multiple photocopies of it.\nConversely, if the photocopying had been done by central support services and therefore\nremoved from the time cost of the face-to-face seminar, the total time of running the\nsubstitute SD virtual seminar (170 minutes) would still have been only about an eighth of\nthe total time taken for the face-to-face seminar (1,397 minutes). Moreover, arranging for\nthe photocopying to be done centrally would have cost the face-to-face seminar tutor at\nleast a little time.\nThese findings contradict the common claim (for example, by Timms, 1997) that\ncomputer-based teaching and learning is more costly in time than traditional methods.\nOne reason is probably that often in the past custom software has been developed - a time-\nconsuming approach - whereas in this study a simple proprietary package was used. Also,\nit is important to compare like with like. In this study, the time taken to prepare module\noutlines and lectures, and to set and mark essays and examinations, has been omitted\nbecause these activities are common to the course regardless of the form of the seminar.\nHowever, all seminar-related activities have been included in the comparison, not just the\ndiscussion face-to-face and on-line. Nevertheless, a more thorough-going costing would be\npossible, that included the time needed to support and maintain the university computer\nclusters and the campus network (as opposed, perhaps, to supporting and maintaining the\ntutorial rooms). Similarly, money costs have not been included.\nIn the case of QRM, the figures in Table 1 need to be interpreted carefully. The time spent\npreparing for, administering and running the supplement virtual seminar (106 minutes)\nwas in addition to the time spent on preparing for, administering and running the weekly\ntwo-hour teaching session that included both a lecture and a face-to-face discussion\nperiod. The latter took 1,610 minutes in the control group. This indicates that a supple-\nment virtual seminar adds only modestly to the time involved in running a postgraduate\ncourse - only an additional 7 per cent. However, again it should be noted that the time\nspent running the virtual seminar might have increased had students made more use of it.\nTime spent talking with individual students outside the QMR seminar about academic and\nnon-academic matters was approximately the same for the virtual seminar (213 minutes) as\nfor the face-to-face seminar (205 minutes). This indicates that if the lecturers are physically\npresent, as both were in the weekly two-hour teaching periods, then students take the\nopportunity to talk to them. In the case of the QMR virtual seminar, face-to-face talk was\nsupplemented by only a modest amount of email communication between individual\nstudents and the virtual seminar tutor (ten minutes). This suggests that, as seen earlier with\nSD, face-to-face communication with tutors is preferred by students over email.\nCost\nThe study demonstrates that, as a substitute for face-to-face seminars, virtual seminars are\nmuch less costly in academic staff time: less than three hours for a virtual seminar\ncompared with nearly twenty-seven hours for a weekly one-hour face-to-face seminar over\na ten-week period. The time savings are realized in all activities related to the seminar:\npreparation, administration, running the seminar and communicating with individual\nstudents outside the seminar about academic and non-academic matters. The extra cost in\nsupport staff time in setting up the virtual seminar, posting teaching materials and training\nstudents in how to use the seminar is negligible, at less than one hour.\n49\nPeter Halfpenny and Sonja Wellings Can virtual seminars be used cost-effectively to enhance student learning?\nHowever, there are two caveats. First, the virtual seminars in this study were relatively little\nused. Had the discussion threads been more numerous or more extended, then the staff\ntime in contributing to and guiding them would have increased. Nevertheless, it is unlikely\nthat running even a very active virtual seminar would absorb anything close to the time\ntaken to run a face-to-face seminar. The highest use of a virtual seminar, in the QRM\nmodule, amounted to 74 contributions over a ten-week period, at a cost in staff time of 4.4\nminutes per student contribution on average. Assuming that the time per contribution\nremained equal to this, there would need to be 408 contributions over the semester\n(equivalent to 12.8 contributions per student) before the total staff time running the virtual\nseminar surpassed that running the face-to-face seminar.\nSecond, for a combination of technical, pedagogic and equal opportunity reasons, virtual\nseminars are better integrated into teaching when used as a supplement to, rather than a\nsubstitute for, face-to-face seminars. Given this, the time taken in running a virtual seminar\nwould be additional to the time given to other means of teaching - they represent a further\ndemand on academic staff. Suggestions that CMC could ease the burden on staff caused\nby falling staff\/student ratios while maintaining the quality of teaching raise false hopes.\nEffectiveness\nIt was not an objective of the study to test the effectiveness of virtual seminars in terms of\nlearning outcomes. Instead, the principal aim was more narrowly focused: to assess their\neffectiveness in giving students greater access to lecturer-guided discussion, on the\nassumption that this enhances collaborative learning. Some of the findings are positive:\nover all three virtual seminars, 44 per cent of the students who responded to the evaluation\nquestionnaires said that they enjoyed being able to make contributions in their own time,\n40 per cent reported that they found the quality of contributions from others to be of a\nhigh standard, and 30 per cent said that the contributions increased their understanding of\nthe subject. All these percentages were higher for the more actively used virtual seminars.\nHowever, only 17 per cent overall thought that the virtual seminar gave them better access\nto the lecturer, the majority of this small percentage being students in the SD substitute\nvirtual seminar who had no other means of direct access to their lecturer. Moreover, 83 per\ncent of the members of the two actively used virtual seminars. (QRM and SD) said that\nthey would have preferred to attend a face-to-face seminar. Meeting a tutor in a face-to-\nface seminar generates additional contact too: in the case of the undergraduate SD\nmodule, over the course of the semester the face-to-face seminar tutor spent 110 minutes\ncommunicating with individual students about academic matters and sixty-five minutes\nabout non-academic matters, whereas the virtual seminar tutor spent just five minutes on\nthe first of these and no time on the second, and only ten minutes on email communication\nwith individual students by way of compensation for the lack of face-to-face contact.\nThe findings demonstrate that whatever the benefits of incorporating virtual seminars into\nthe range of teaching methods employed on a module, students still value face-to-face\ndiscussion with their lecturers and tutors, in class and individually. However, a caveat is\nappropriate here too. If virtual seminars become more prevalent, students might become\nmore favourable towards them than indicated by the results above, which are based on\nrelatively little used virtual seminars in an environment where the students had not\nexperienced them before. Although the present evidence suggests that face-to-face contact\n50\nALT-J Volume 9 Number 3\nwith lecturers is still greatly favoured by students over CMC, further study will be needed\nas virtual seminars become more prevalent.\nConclusion\nThe case with which virtual seminars can be set up and the growing use of the Internet\nmake it likely that more and more lecturers will use CMC over the coming years. This was\nencouraged by the Dearing Report, which called for higher education institutions to\ndevelop suitable C&IT strategies at national and local level, and to adopt these tech-\nnologies as teaching and learning resources. However, the findings from this study, together\nwith the results of past evaluations, suggest that CMC is not a cost-effective remedy to the\nerosion of staff-student ratios.\nMany commentators see the obstacles to the effective integration of CMC purely in terms\nof the lack of resources to provide better technological infrastructure and access, and\nappropriate training and support for both staff and students. Others take a broader view,\nraising concerns that the current culture of teaching and learning within universities is a\nmore substantial barrier to the full potential of CMC being realized than lack of resources\n(Crook, 1997; Laurillard, 1993; Light et al., 1997; Timms, 1997; Weller, 2000).\nThis study suggests that there is a third problem, beyond the resources for C&IT and the\nculture of teaching and learning. The constant search for cheaper ways of delivering higher\neducation has generated widespread enthusiasm for computer assistance for several\ndecades. Yet this study, like others before it, reveals that even a shift from using computers\nto store information to employing them as aids to discussion misses a key component of\nquality education - face-to-face interaction between teachers and learners. The collaborat-\nive learning opportunities provided by classroom-based tutorials can be usefully\nsupplemented but not adequately substituted by CMC. Supplementary virtual seminars\nrequire an extra input by academic staff which, though modest, is still an increase in the\ndemands upon their time. The third problem is, then, that computers cannot replace\nacademic staff, and that the effective integration of CMC into teaching and learning\nincreases staff effort rather than reduces it.\nAcknowledgements\nThe authors wish to thank the Enterprise Centre for funding; Shoba Arun, Nick Crossley,\nFiona Devine and Rod Watson for participating as seminar tutors; Nick Gould, the\nFaculty Information Systems Development Officer, for support; and all the students\ninvolved for their participation.\nReferences\nAnderson, M. and Jackson, D. (2000), 'Computer systems for distributed and distance\nlearning', Journal of Computer Assisted Learning, 16, 213-28.\nBrowning, P. and Williams, J. (1995), 'The geology@bristol experience', Active Learning, 2\n(July), 34-8.\nCrook, C. (1997), 'Making hypertext lecture notes more interactive: undergraduate\nreactions', Journal of Computer Assisted Learning, 13, 236-44.\nsi\nPeter Halfpenny and Sonjo Wellings Can virtual seminars be used cost-effectively to enhance student learning?\nDavis, N. (1997), 'Do electronic communications offer a new learning opportunity in\neducation?', in B. Somekh and N. Davis (eds), Using Information Effectively in Teaching\nand Learning, London: Routledge.\nDearing, R. (1997), The Report of the National Committee of Inquiry into Higher\nEducation, London: HMSO.\nDuffy, C., Arnold, S. and Henderson, F. (1995), 'NetSem: electrifying undergraduate\nseminars', Active Learning, 2, 52-48.\nEhrmann, S. (1994), 'Looking backwards: US efforts to use technology to transform\nundergraduate education', in J. Martin, J. Darby and B. Kjollerstrom (eds), Higher\nEducation 1998 Transformed by Learning Technology, Oxford: CTISS Publications.\nHalfpenny, P. and Wellings, S. (2000), Using Virtual Seminars to Enhance Student Learning,\nManchester: Centre for Applied Social Research, University of Manchester.\nHarasim, L. (1993), Global Networks: Computers and International Communication,\nCambridge, Mass.: MIT Press.\nJohnson, D. W. and Johnson, R. T. (1990), 'Co-operative learning and achievement', in\nS. Sharan (ed.), Cooperative Learning: Theory and Research, New York: Praeger.\nLaurillard, D. (1993), Rethinking University Teaching: A Framework for the Effective Use of\nEducational Technology, London: Routledge.\nLight, P., Colbourn, C. and Light, V. (1997), 'Computer mediated tutorial support for\nconventional university courses', Journal of Computer Assisted Learning, 13, 228-35.\nMcAteer, E., Tolmie, A., Duffy, C. and Corbett, J. (1997), 'Computer-mediated com-\nmunication as a learning resource', Journal of Computer Assisted Learning, 13, 219-27.\nPincas, A. (1997), 'Institutional design for group-based learning by computer-\nconferencing', in C. Bell, M. Boroden and A. Trott (eds), Independent Flexible Learning,\nLondon: Kogan Page.\nSchneider, A. (1998), 'Sociology: the internet as an extended classroom', Social Science\nComputer Review, 16, 40-52.\nStainfield, J. (1997), 'Using IT to manage a third year module', Active Learning, 6, 30-4.\nTimms, D. (1997), 'C&IT and the learning society - some post-Dearing thoughts', SocInfo\nJournal, 3 (December), 2-11.\nWeller, M. (2000), 'Implementing a CMC tutor group for an existing distance education\ncourse', Journal of Computer Assisted Learning, 16, 178-83.\n52\n"}