{"doi":"10.1007\/s00484-007-0085-8","coreId":"64219","oai":"oai:nora.nerc.ac.uk:672","identifiers":["oai:nora.nerc.ac.uk:672","10.1007\/s00484-007-0085-8"],"title":"Is earlier spring migration of Tatarstan warblers expected under climate warming?","authors":["Askeyev, Oleg  V.","Sparks, Tim H.","Askeyev, Igor  V.","Tryjanowski, Piotr"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"We analysed data on the arrival dates of four species of leaf warbler (genus Phylloscopus) collected in Tatarstan between 1957 and 2004. There was no evidence, over the whole period that the warblers returned to their breeding sites significantly earlier, mainly because local temperatures for April and May, months when the majority of birds arrived from their wintering grounds, did not increase significantly. However, arrival dates of two species (Chiffchaff P.collybita and Willow warbler P.trochilus) were strongly related to local temperature in April and Greenish warbler P.trochiloides to that in May. As expected, arrival dates for the three species wintering in Africa (Chiffchaff, Willow and Wood warblers P.sibilatrix) correlated positively with one another (P<0.01 in all cases), but were not correlated with arrival dates of Greenish warbler (P>0.5 in all cases), a species wintering in the Indian sub-continent","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/64219.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/672\/2\/ASKEYEVolegwarblerv2.pdf","pdfHashValue":"9d84eb401cba59e15794f7efce1b5a80b244eb54","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:672<\/identifier><datestamp>\n      2012-11-22T11:46:00Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533233<\/setSpec><setSpec>\n      7375626A656374733D533236<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/672\/<\/dc:relation><dc:title>\n        Is earlier spring migration of Tatarstan warblers expected under climate warming?<\/dc:title><dc:creator>\n        Askeyev, Oleg  V.<\/dc:creator><dc:creator>\n        Sparks, Tim H.<\/dc:creator><dc:creator>\n        Askeyev, Igor  V.<\/dc:creator><dc:creator>\n        Tryjanowski, Piotr<\/dc:creator><dc:subject>\n        Meteorology and Climatology<\/dc:subject><dc:subject>\n        Zoology<\/dc:subject><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        We analysed data on the arrival dates of four species of leaf warbler (genus Phylloscopus) collected in Tatarstan between 1957 and 2004. There was no evidence, over the whole period that the warblers returned to their breeding sites significantly earlier, mainly because local temperatures for April and May, months when the majority of birds arrived from their wintering grounds, did not increase significantly. However, arrival dates of two species (Chiffchaff P.collybita and Willow warbler P.trochilus) were strongly related to local temperature in April and Greenish warbler P.trochiloides to that in May. As expected, arrival dates for the three species wintering in Africa (Chiffchaff, Willow and Wood warblers P.sibilatrix) correlated positively with one another (P<0.01 in all cases), but were not correlated with arrival dates of Greenish warbler (P>0.5 in all cases), a species wintering in the Indian sub-continent.<\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2007<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/672\/2\/ASKEYEVolegwarblerv2.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Askeyev, Oleg V.; Sparks, Tim H.; Askeyev, Igor V.; Tryjanowski, Piotr.  2007  Is earlier spring migration of Tatarstan warblers expected under climate warming?   International Journal of Biometeorology, 51. 459-463.  https:\/\/doi.org\/10.1007\/s00484-007-0085-8 <https:\/\/doi.org\/10.1007\/s00484-007-0085-8>     \n <\/dc:identifier><dc:relation>\n        http:\/\/springerlink.metapress.com\/content\/xj1112l653v58gvq\/?p=76cd0fb5e7ac46ce9bb5616e585eecd5&pi=0<\/dc:relation><dc:relation>\n        doi:10.1007\/s00484-007-0085-8<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/672\/","http:\/\/springerlink.metapress.com\/content\/xj1112l653v58gvq\/?p=76cd0fb5e7ac46ce9bb5616e585eecd5&pi=0","doi:10.1007\/s00484-007-0085-8"],"year":2007,"topics":["Meteorology and Climatology","Zoology","Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":" 1\nOleg V. Askeyev · Tim H. Sparks · Igor V. Askeyev · Piotr Tryjanowski \n \nIs earlier spring migration of Tatarstan warblers expected under climate warming ? \n \nO.V. Askeyev \nThe Institute of Natural Systems Ecology, Tatarstan Academy of Sciences, Kazan, Russia \n \nT.H. Sparks (\r) \nNERC Centre for Ecology and Hydrology, Monks Wood, Abbots Ripton, Huntingdon, \nCambridgeshire PE28 2LS, UK \ne-mail: ths@ceh.ac.uk \n \nI.V. Askeyev  \nThe Federal Service for Veterinary, Fish, Game and Phytosanitary Control in the Tatarstan \nRepublic, Kazan, Russia \n \nP. Tryjanowski \nDepartment of Behavioural Ecology, Adam Mickiewicz University, Umultowska 89, PL-61-614 \nPoznań, Poland \n \n \n 2\nAbstract We analysed data on the arrival dates of four species of leaf warbler (genus \nPhylloscopus) collected in Tatarstan between 1957 and 2004. There was no evidence, over the \nwhole period that the warblers returned to their breeding sites significantly earlier, mainly \nbecause local temperatures for April and May, months when the majority of birds arrived from \ntheir wintering grounds, did not increase significantly. However, arrival dates of two species \n(Chiffchaff P.collybita and Willow warbler P.trochilus) were strongly related to local \ntemperature in April and Greenish warbler P.trochiloides to that in May. As expected, arrival \ndates for the three species wintering in Africa (Chiffchaff, Willow and Wood warblers \nP.sibilatrix) correlated positively with one another (P<0.01 in all cases), but were not correlated \nwith arrival dates of Greenish warbler (P>0.5 in all cases), a species wintering in the Indian sub-\ncontinent. \n \nKeywords co-fluctuation, phenology, temperature, migration route, Russia, Phylloscopus, \nwintering areas \n \n 3\nIntroduction \nThe timing of when birds return to their breeding area is a key component of studies of the \nimpact of climate change upon bird populations (reviews in: Sparks et al. 2003; Lehikoinen et al. \n2004). Moreover, research on the arrival time of birds from wintering grounds to breeding \nlocations is an important part of many phenological studies (Sparks 1999; Walther et al. 2002; \nSparks et al. 2003). However, a bias probably exists in studies on bird phenology, strongly \nfocused on very well known species, which may limit our knowledge on the functioning of \necological systems. The same is true of the geographical locations of many studies; the majority \nof which have been conducted in Western Europe or North America (review in: Lehikoinen et al. \n2004). The reported results fit very well with changes in climate during recent decades (Sparks et \nal. 2003; Lehikoinen et al. 2004; Root et al. 2006). Spring arrival dates of birds to their breeding \nplaces have been shown to correlate very well with local temperatures, as well as with \ntemperatures on migratory routes and in wintering grounds (Sparks et al. 2003; Gordo et al. \n2005; Mitrus et al. 2005). However in some parts of the world, temperature has not increased \nsignificantly, or increased only in periods (months) of relatively minor importance to migrating \nbirds. If in such places birds still arrived earlier, how would this affect predictions of climate \nchange influences on bird migration?  \n We tested this question with data from one location in central Euroasia surrounding \nKazan in the Tatarstan Republic (Russia), where observed changes in surface temperature were \nrelatively low (Karolay and Wu 2005) in comparison with other regions where phenological \nshifts have been reported (summary in: Walther et al. 2002; Lehikoinen et al. 2004). As the study \nsubject we used four species of leaf warblers from the genus Phylloscopus. In the study area, five \nbreeding species of Phylloscopus warblers are present (Askeyev and Askeyev 1999). These are \nChiffchaff Phylloscopus collybita, Willow warbler P.trochilus, Wood warbler P.sibilatrix, \nGreenish warbler P.trochiloides and Arctic warbler P.borealis. In this paper we examine data on \n 4\nthe first four of these species, which are quite common breeding species in the study area. Due to \nlack of sufficient data, because the species is relatively rare, we excluded Arctic warbler from \nfurther analysis. All these species are long-distance migrants with wintering areas in Africa \n(Chiffchaff, Willow and Wood warblers) or the Indian sub-continent and China (Greenish \nwarbler) – for maps of distributions and basic biological information see Katti and Price (2003). \nThis study provides a great opportunity to test co-fluctuations between morphologically and \nhabitually similar bird species, but which differ in their wintering grounds. If conditions on \nmigratory routes and in wintering places are important (as we assume, see above and Sparks et \nal. 2003; Gordo et al. 2005; Mitrus et al. 2005), the three African warblers should show similar \narrival patterns different from the Indian wintering species (Hubalek 2005). \n Our purposes in this paper are (1) to document the changes in arrival time of the leaf \nwarblers (genus Phylloscopus) in the 1957-2004 period, (2) to identify relationships between \ntime of arrival and air temperature in the breeding site in Tatarstan, (3) to examine the potential \nco-fluctuations between the arrival time of the four studied species.  \n \nMaterials and methods \nStudy area \nObservations of birds were carried out in the Kazan region of the Tatarstan Republic, Russia. \nThis region covers a large area of c.2500 km2 centred on the city of Kazan (55°45′ N, 49°08′ E ), \nand includes various habitats (sub-taiga coniferous–deciduous mixed forests, farmland, rivers, \nlakes, and town and villages). The relief is a mostly flat or undulating lowland (55 – 220 m a.s.l). \nThe continental climate of the region is typical of Eastern Europe. The average annual \ntemperature is 3.6°C and monthly mean temperatures range from -12.1°C in January to 19.4°C in \nJuly. The lowest temperature recorded in our study period was -52°C, and the maximum 39°C. \nAverage annual precipitation is c.530 mm and snow cover lies for 141–164 days.  \n 5\n \nPhenological observations \nFrom 1957–1979, dates of the observations of the first occurrence of warblers were recorded by \nKazan scientists (V.A. Popov, B.V. Nekrasov, R.A. Zatcepina, A.V. Popov, V.G. Ivliev) and \nthese records were extracted from the archive of the Laboratory of Biomonitoring at INSE \n(Institute of Natural Systems Ecology). Some data were published in Zatcepina (1978). \nObservations from 1980 to 2004 were recorded by two of the authors (IA and OA) of this paper. \nObservations were made daily from transects across the Kazan region and the recorder effort has \nbeen similar throughout the 48 years of study. \n \nMeteorological data \nMonthly mean air temperature data for the period from 1957 to 2004 were calculated as the \naverage of the Raifa (55°55’ N, 48°43’ E) and Kazan meteorological stations and collected \naccording to standard WMO protocols. \n \nStatistical analysis \nCalendar dates were transformed into days after March 1 (e.g. 1 for 1 March etc) prior to \nanalysis. Trends were calculated by regression methods. All statistical analyses were applied \naccording to the recommendations of Sokal and Rohlf (1995) and were conducted using \nMINITAB v.13. \n \nResults \nArrival date \nNone of the four species significantly changed their first arrival dates over the whole study \nperiod (Fig. 1), although Wood warbler was nearly significant (P=0.064).  \n 6\n \nThe influence of temperatures  \nAn examination of Kazan March temperatures in the 1957-2004 period (Fig. 2) do reveal a \nconsistent trend towards warmer conditions (P=0.004) by an estimated 4.1ºC over the 48 years. \nHowever, there was nearly a significant decrease in May temperature (P=0.055) equating to \n2.2ºC over 48 years. There was no significant change in February (P=0.14) or April (P=0.48) \ntemperatures.  \n Regressions between first arrival dates and the mean monthly temperatures for the month \nof mean arrival and the preceding month are shown in Table 1. With the exception of Wood \nwarbler, the species displayed a significant negative relationship with the temperature of the \nmonth of mean arrival (Fig. 3). The combined coefficients (Table 1) suggested a response to \nlocal temperatures of between 0.23 days\/°C and 1.55 days\/°C. Thus, fine tuning of arrival dates \nto local conditions (which may also reflect temperatures over a larger continental area) was \napparent. \n \nCo-fluctuation among species \nArrival dates of the three species wintering in Africa correlated very well (Fig. 4, r = 0.41 to \n0.65, n = 31 to 45 years, P < 0.008 in all three cases) but they did not correlate significantly with \narrival dates of Greenish warbler, wintering in the Indian subcontinent and China (Fig. 4; r = - \n0.01 to 0.11, n = 39 to 41 years, P > 0.51 in all three cases). \n \nDiscussion \nThe Phylloscopus warblers belong to a group of birds very popular for migratory studies, \nincluding phenology (Sparks 1999; Tryjanowski et al. 2002). However, European studies \ntypically concern two, sometimes three species (mainly Chiffchaff and Willow Warbler), and to \n 7\ndate we have not found a paper that focuses on the arrival dates of Greenish warbler. Greenish \nwarbler has a limited distributional range in Europe and is limited mainly to eastern and northern \nparts of the continent (Cramp 1992) and it overwinters in India, which is rather exceptional for \nEuropean avifauna (Mitrus et al. 2005). However our results are in contrast with Western and \nCentral European studies, where there is an increasing body of evidence that migrant birds are \nreturning earlier (reviewed in Lehikoinen et al. 2004) including three Phylloscopus warblers e.g. \nSokolov et al. 1998; Tryjanowski et al. 2005; Tøttrup et al. 2006). In this paper we  examined \nfirst arrival dates since information on the complete migration distribution is not available from \nthis part of Russia. Tryjanowski et al. (2005) and others have warned about possible dangers in \nusing this measure of phenology, although Sparks et al. (2005) and others have shown broad \nagreement between first and mean arrival dates. In this part of Russia the arrival period is \nrelatively short so that first birds are rapidly followed by others and we believe the first arrival \ndate to be representative. \nIn the analysed leaf warbler species we did not find significantly earlier arrival in \nTatarstan, which is not such a great surprise because local temperatures in the spring months did \nnot consistently increase. Indeed, the contrast between rising March and falling May \ntemperatures would be expected to affect fauna and fauna in different ways depending on the key \nmonths driving their phenology. However, because arrival dates of three of the analysed species \ncorrelated very well with local temperatures we predict that warblers can be good phenological \nindicators in the case of increasing temperatures. We have used a unique data set of observations \nthat could be useful in understanding the reaction of birds to climate change, even where \ntemperature changes are not detected. Three species’ (Chiffchaff, Willow and Greenish warblers) \narrival dates correlated well with April or May temperatures, an appropriate period for arrivals in \nTatarstan. That for Wood warbler didn’t quite achieve significance (P=0.116) with April \ntemperature, Table 1). As found by Marra et al. (2005) in North America the response to \n 8\ntemperature can be relatively modest, c. 1day\/°C, in locations where temperatures have not \nconsistently risen. Greater responses have been found elsewhere in Europe (e.g. Lehikoinen et al. \n2004).  \nInterestingly, the arrival dates of the African migrants co-fluctuated in a similar way \n(sensu Hubalek 2005), completely independent of the Indian migrant, the Greenish warbler. This \nsupports earlier suggestions that birds react not only to temperature in the breeding ground, but \non the whole migration route (e.g. Gordo 2005; Hubalek 2005; Mitrus et al. 2005; Tøttrup et al. \n2006). They probably start migration to breeding places from different wintering places \naccording to local signals, and just experience similar conditions at the end of their migratory \nroute. However, part of our explanation is of a speculative nature, because knowledge about the \ncues used by birds in the wintering grounds is very scarce, especially in the Indian sub-continent \nwhose wintering species are of relatively low research interest in Europe (c.f. Mitrus et al 2005). \n \nAcknowledgements We would like to thank V.G. Ivliev for data from the archive of the \nLaboratory of Biomonitoring at INSE. \n \nReferences \nAskeyev IV, Askeyev OV (1999) Birds of the Tatarstan Republic. Akademia Nauk Tatarstana, \nKazan (in Russian).  \nCramp S (ed) (1992) The Birds of the Western Palearctic. Vol VI. Oxford University Press, \nOxford \nGordo O, Brotons L, Ferrer X, Comas P (2005) Do changes in climate patterns in wintering areas \naffect the timing of the spring arrival of trans-Saharan migrant birds? Global Change \nBiology 11: 12-21 \n 9\nHubalek Z (2005) Co-fluctuation among bird species in their migration timing. Folia zool. 54: \n159-164 \nKaroly DJ, Wu Q (2005) Detection of regional surface temperature trends. J Climate 18: 4337-\n4343 \nKatti M, Price TD (2003) Latitudinal trends in body size among over-wintering leaf warblers \n(genus Phylloscopus). Ecography 26: 69-79 \nLehikoinen E, Sparks TH, Zalakevicius M (2004) Arrival and departure dates. Adv Ecol Res 35: \n1-21 \nMarra PP, Francis CM, Mulvihill RS, Moore FR (2005) The influence of climate on the timing \nand rate of spring bird migration. Oecologia 142: 307-315.  \nMitrus C, Sparks TH, Tryjanowski P (2005) First evidence of phenological change in a \ntranscontinental migrant overwintering in the Indian sub-continent: the Red-breasted \nFlycatcher Ficedula parva. Ornis Fenn 82: 13-19 \nRoot TL, MacMynowski DP, Mastrandrea MD, Schneider SH (2006) Human-modified \ntemperatures induce species changes: joint attribution. Proc Natl Acad Sci USA 102: 7465-\n7469 \nSokal RR, Rohlf FJ (1995) Biometry. 3rd ed. Freeman, New York \nSokolov LV, Markovets MYu, Shapoval AP, Morozov YuG (1998) Long-term trends in the \ntiming of spring migration of passerines on the Courish Spit of the Baltic Sea. Avian Ecol \nBehav 1: 1-21 \nSparks TH (1999) Phenology and the changing pattern of bird migration in Britain. Int J \nBiometeorol 42: 134-138 \nSparks TH, Crick HQP, Dunn PO, Sokolov LV (2003) Birds. In: Schwatz MD (ed) Phenology: \nAn Integrative Environmental Science. Kluwer, New York, pp 421-436 \n 10\nSparks TH, Bairlein F, Bojarinova JG, Hüppop O, Lehikoinen EA, Rainio K, Sokolov LV, \nWalker D (2005) Examining the total arrival distribution of migratory birds. Global \nChange Biology 11: 22-30 \nTøttrup AP, Thorup K, Rahbek C (2006) Patterns of change in timing of spring migration in \nNorth European songbird populations. J Avian Biol 37: 84-92 \nTryjanowski, P, Kuzniak S, Sparks T (2002) Earlier arrival of some farmland migrants in \nwestern Poland. Ibis 144: 62-68 \nTryjanowski P, Kuzniak S, Sparks TH (2005) What affects the magnitude of change in first \narrival dates of migrant birds? J Ornithol 146: 200-205 \nWalther GR, Post E, Convey P, Menzel A, Parmesan C, Beebee TJ, Fromentin JH, Hoegh-\nGuldberg O, Bairlein F (2002) Ecological responses to recent climate change. Nature 416: \n389-395 \nZatcepina RA (1978) Sylividae family. In: The birds of Volga-Kama region. Moscow, pp 94–\n134 (in Russian). \n 11\n \nTable 1 Summary of regression models between first arrival dates and mean monthly \ntemperatures of the month of mean arrival and the preceding month. Significant coefficients (P < \n0.05) are shown in bold. \n \n Regression coefficients ±SE    \n March April May \nSum of \ncoefficients\nR2 \nP \nChiffchaff -0.18±0.25 -1.40±0.29 -1.55 40.7 <0.001\nWillow warbler 0.13±0.18 -1.17±0.20 -1.04 44.8 <0.001\nWood warbler -0.56±0.35 0.33±0.38 -0.23 8.1 0.20\nGreenish warbler -0.33±0.28 -0.92±0.30 -1.25 21.2 0.011\n \n \n \n \n \n \n \n \n200519951985197519651955\nApr 29\nApr 19\nApr 9\nyear\nFi\nrs\nt a\nrri\nva\nl d\nat\ne\nChiffchaff\n200519951985197519651955\nMay 4\nApr 24\nApr 14\nyear\nFi\nrs\nt a\nrri\nva\nl d\nat\ne\nWillow  Warbler\n200519951985197519651955\nMay 9\nApr 29\nApr 19\nyear\nFi\nrs\nt a\nrri\nva\nl d\nat\ne\nWood Warbler\n200519951985197519651955\nMay 29\nMay 19\nMay 9\nyear\nFi\nrs\nt a\nrri\nva\nl d\nat\ne\nGreenish Warbler\n \n \n \n \nFig. 1 Patterns of first arrival dates of the four Phylloscopus warblers 1957-2004. Horizontal lines represent mean \ndates \n 12\n200519951985197519651955\n20\n10\n0\n-10\n-20\nyear\nm\non\nth\nly \nm\nea\nn \nte\nm\npe\nra\ntu\nre\n \n \n \n \nFig. 2 Patterns in mean monthly temperatures from February (lower) to May (upper). A significant increase in \nMarch and an almost significant decrease in May temperatures were apparent in the time frame. Horizontal lines \nrepresent mean temperatures in the 1957-2004 period\n 13\n \n \n \n \n1050\nApr 29\nApr 19\nApr 9\nApril temperature\nFi\nrs\nt a\nrri\nva\nl d\nat\ne\nChiffchaff\n1050\nMay 4\nApr 24\nApr 14\nApril temperature\nFi\nrs\nt a\nrri\nva\nl d\nat\ne\nWillow Warbler\n1050\nMay 9\nApr 29\nApr 19\nApril temperature\nFi\nrs\nt a\nrri\nva\nl d\nat\ne\nWood Warbler\n18138\nMay 29\nMay 19\nMay 9\nMay temperature\nFi\nrs\nt a\nrri\nva\nl d\nat\ne\nGreenish Warbler\n \nFig. 3 Relationships between first arrival date and local temperatures in the most significant of either the month of \nmean first arrival or the preceding month \n \n \n \n \n \n 14\nChiffchaff\nWillow warbler\nWood warbler\nGreenish warbler\n \n \nFig. 4 A matrixplot showing the relationship between the first arrival dates of the four Phylloscopus warblers \n \n 15\n"}