{"doi":"10.1016\/j.quascirev.2008.06.011","coreId":"62186","oai":"oai:nora.nerc.ac.uk:5002","identifiers":["oai:nora.nerc.ac.uk:5002","10.1016\/j.quascirev.2008.06.011"],"title":"Progressive proglacial to subglacial deformation and syntectonic sedimentation at the margins of the Mid-Pleistocene British Ice Sheet : evidence from north Norfolk, UK","authors":["Phillips, Emrys","Lee, Jonathan","Burke, Helen F"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008","abstract":"Detailed analysis and interpretation of the stratigraphy and structures developed within polydeformed sediments exposed in the coastal section between West Runton and Sheringham (eastern England) has allowed the characterisation of the glacitectonic signature associated with the advance of a major Mid-Pleistocene (Anglian) ice sheet. The sequence of pre-glacial deposits and glacial sediments laid down during earlier southerly directed ice advances (D1–D2) is deformed and disrupted by an ice advance from the west\/southwest that marks a major change in ice flow dynamics in northern East Anglia. The\\ud\nsimplest interpretation of this deformation event (D3) is in terms of a progressive proglacial to subglacial\\ud\ndeformation model. Proglacial deformation occurred in advance of the ice margin and was dominated by\\ud\nthrusting. Positive topographic features which developed above the propagating thrusts controlled\\ud\nsediment dispersal patterns within outwash sandur, leading to the formation of small sub-basins\\ud\nbetween these morainic ridges. The accretion of the wedge-shaped, proglacial thrust moraines to the\\ud\nmain push moraine formed at the margin of the advancing glacier may have temporarily stalled forward\\ud\nmotion of the ice. Thrusting and large-scale folding associated with ice-marginal deformation led to the\\ud\nstacking of material excavated from further up-ice onto the stoss-side of these accreted thrust-related\\ud\nmoraines that allowed the glacier to override the obstruction. Subglacial deformation was highly variable\\ud\nin its style and intensity ranging from heterogeneous folding and thrusting, through to more pervasive\\ud\nductile shearing associated with the formation of a subglacial shear zone. The thickness and complexity\\ud\nof this shear zone increases up-ice, where it is characterised by a thick glacitectonic me´ lange. The pore\\ud\nwater content of the deforming sediments controlled the pattern of deformation within the shear zone.\\ud\nHowever, an increase in the efficiency of the drainage system towards the front of the glacier would have\\ud\nled to a rapid thinning of this water-enhanced zone of ductile shear. Evidence from north Norfolk\\ud\nsuggests that zones of preferential pore water flow within the glacier bed are a major controlling factor\\ud\non the location of the subglacial shear zone. Consequently, the bulk of the forward motion of the glacier\\ud\nmay not be accommodated by shearing within the sediments immediately below its base, but occur at\\ud\na deeper level within the deforming bed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/62186.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/5002\/1\/phillips_et_al_QSR_paper_2008.pdf","pdfHashValue":"8ec615f0861c37851a9545e60b67a4201ebe77c6","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:5002<\/identifier><datestamp>\n      2012-11-22T11:53:23Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533135<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/5002\/<\/dc:relation><dc:title>\n        Progressive proglacial to subglacial deformation and syntectonic sedimentation at the margins of the Mid-Pleistocene British Ice Sheet : evidence from north Norfolk, UK<\/dc:title><dc:creator>\n        Phillips, Emrys<\/dc:creator><dc:creator>\n        Lee, Jonathan<\/dc:creator><dc:creator>\n        Burke, Helen F<\/dc:creator><dc:subject>\n        Glaciology<\/dc:subject><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        Detailed analysis and interpretation of the stratigraphy and structures developed within polydeformed sediments exposed in the coastal section between West Runton and Sheringham (eastern England) has allowed the characterisation of the glacitectonic signature associated with the advance of a major Mid-Pleistocene (Anglian) ice sheet. The sequence of pre-glacial deposits and glacial sediments laid down during earlier southerly directed ice advances (D1–D2) is deformed and disrupted by an ice advance from the west\/southwest that marks a major change in ice flow dynamics in northern East Anglia. The\\ud\nsimplest interpretation of this deformation event (D3) is in terms of a progressive proglacial to subglacial\\ud\ndeformation model. Proglacial deformation occurred in advance of the ice margin and was dominated by\\ud\nthrusting. Positive topographic features which developed above the propagating thrusts controlled\\ud\nsediment dispersal patterns within outwash sandur, leading to the formation of small sub-basins\\ud\nbetween these morainic ridges. The accretion of the wedge-shaped, proglacial thrust moraines to the\\ud\nmain push moraine formed at the margin of the advancing glacier may have temporarily stalled forward\\ud\nmotion of the ice. Thrusting and large-scale folding associated with ice-marginal deformation led to the\\ud\nstacking of material excavated from further up-ice onto the stoss-side of these accreted thrust-related\\ud\nmoraines that allowed the glacier to override the obstruction. Subglacial deformation was highly variable\\ud\nin its style and intensity ranging from heterogeneous folding and thrusting, through to more pervasive\\ud\nductile shearing associated with the formation of a subglacial shear zone. The thickness and complexity\\ud\nof this shear zone increases up-ice, where it is characterised by a thick glacitectonic me´ lange. The pore\\ud\nwater content of the deforming sediments controlled the pattern of deformation within the shear zone.\\ud\nHowever, an increase in the efficiency of the drainage system towards the front of the glacier would have\\ud\nled to a rapid thinning of this water-enhanced zone of ductile shear. Evidence from north Norfolk\\ud\nsuggests that zones of preferential pore water flow within the glacier bed are a major controlling factor\\ud\non the location of the subglacial shear zone. Consequently, the bulk of the forward motion of the glacier\\ud\nmay not be accommodated by shearing within the sediments immediately below its base, but occur at\\ud\na deeper level within the deforming bed.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2008<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/5002\/1\/phillips_et_al_QSR_paper_2008.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Phillips, Emrys; Lee, Jonathan; Burke, Helen F.  2008  Progressive proglacial to subglacial deformation and syntectonic sedimentation at the margins of the Mid-Pleistocene British Ice Sheet : evidence from north Norfolk, UK.   Quaternary Science Reviews, 27 (19-20). 1848-1871.  https:\/\/doi.org\/10.1016\/j.quascirev.2008.06.011 <https:\/\/doi.org\/10.1016\/j.quascirev.2008.06.011>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.sciencedirect.com\/science\/journal\/02773791<\/dc:relation><dc:relation>\n        10.1016\/j.quascirev.2008.06.011<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/5002\/","http:\/\/www.sciencedirect.com\/science\/journal\/02773791","10.1016\/j.quascirev.2008.06.011"],"year":2008,"topics":["Glaciology","Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Progressive proglacial to subglacial deformation and syntectonic \nsedimentation at the margins of the Mid-Pleistocene British Ice Sheet: \nevidence from north Norfolk, UK. \n \nEmrys Phillips 1*, Jonathan R. Lee 2,3, Helen Burke 2 \n1British Geological Survey, Murchison House, West Mains Road, Edinburgh EH9 3LA, \nScotland, UK \n2British Geological Survey, Keyworth, Nottingham, NG12 5GG, UK \n3Department of Geography, Royal Holloway, University of London, Egham, Surrey, TW20 \n0EX, UK. \n*corresponding author \ntelephone: +44 (0)131-667-1000 fax: +44 (0)131-668-2683 e-mail: erp@bgs.ac.uk \n \nAbstract \nDetailed analysis and interpretation of the stratigraphy and structures developed within \npolydeformed sediments exposed in the coastal section between West Runton and \nSheringham (eastern England) has allowed the characterisation of the glacitectonic signature \nassociated with the advance of a major Mid-Pleistocene (Anglian) ice sheet. The sequence of \npre-glacial deposits and glacial sediments laid-down during earlier southerly directed ice \nadvances (D1-D2) are deformed and disrupted by an ice advance from the west\/southwest that \nmarks a major change in ice flow dynamics in northern East Anglia. The simplest \ninterpretation of this deformation event (D3) is in terms of a progressive proglacial to \nsubglacial deformation model. Proglacial deformation occurred in-advance of the ice margin \nand was dominated by thrusting. Positive topographic features which developed above the \npropagating thrusts controlled sediment dispersal patterns within outwash sandur, leading to \nthe formation of small sub-basins between these morainic ridges. The accretion of the wedge-\nshaped, proglacial thrust moraines to the main push moraine formed at the margin of the \nadvancing glacier may have temporarily stalled forward motion of the ice. Thrusting and \nlarge-scale folding associated with ice-marginal deformation led to the stacking of material \nexcavated from further up-ice onto the stoss-side of these accreted thrust-related moraines that \nallowed the glacier to override the obstruction. Subglacial deformation was highly variable in \nits style and intensity ranging from heterogeneous folding and thrusting, through to more \npervasive ductile shearing associated with the formation of a subglacial shear zone. The \n 1\nthickness and complexity of this shear zone increases up-ice, where it is characterised by a \nthick glacitectonic mélange. The pore water content of the deforming sediments controlled the \npattern of deformation within the shear zone. However, an increase in the efficiency of the \ndrainage system towards the front of the glacier would have led to a rapid thinning of this \nwater-enhanced zone of ductile shear. Evidence from north Norfolk suggests that zones of \npreferential pore water flow within the glacier bed are a major controlling factor on the \nlocation of the subglacial shear zone. Consequently, the bulk of the forward motion of the \nglacier may not be accommodated by shearing within the sediments immediately below its \nbase, but occur at a deeper level within the deforming bed. \n \n1. Introduction \nThe analysis and interpretation of the structural features (folds, faults, tectonic fabrics) \ndeveloped within subglacially (e.g. Berthelsen, 1979; Ben and Evans, 1996; Boulton et al., \n1996; Hart and Rose, 2001; Phillips et al., 2007; Lee and Phillips, 2008) and proglacially (e.g. \nBerthelsen, 1979; Hart, 1990; Boulton et al., 1999; Phillips et al., 2002; Benediktsson et al., \n2008) deformed sediments can provide important information on the character of glacier-\ninduced deformation events (e.g. McCarroll and Rijsdijk, 2003). The application of \ntechniques routinely used by structural geologists has provided key insights into the often \ncomplex polyphase deformation histories recorded by glacigenic sequences (e.g. van der \nWateren, 1986; van Gijssel, 1987; van der Wateren et al., 2000; Phillips et al., 2002) leading \nto a greater understanding of the stresses responsible for their development (e.g. Berthelsen, \n1979, Pedersen, 1993). Deformation typically involves folding and thrusting, comparable to \nstructures found in foreland fold-and-thrust belts developed in response to crustal shortening \nand mountain building in areas of plate tectonic convergence. This has invariably led to the \napplication of a thin-skinned thrust tectonic model to deformed glacigenic sequences (e.g. \nCroot, 1987; van Gijssel, 1987; Pedersen, 1987; Aber et al., 1989; Bakker, 2004; Andersen et \nal., 2005). Research on glacitectonic structures is also providing information on, and allows \nthe elucidation of, the nature of ice-marginal sedimentation and dynamics during glacial \ncycles (e.g. van der Wateren, 1986, 1995; Croot, 1988; Aber et al., 1989; Ben and Evans, \n1993; Harris et al., 1997; Phillips et al., 2002; Hiemstra et al., 2005).  \nThe role played by water in controlling the style and apparent intensity of subglacial \nand, to a lesser extent, proglacial deformation is also increasingly being recognised (Boulton \net al., 1974; van Gijssel, 1987; Boulton and Caban, 1995; Boulton et al., 2001; Baroni and \nFasano, 2006; Lee and Phillips, 2008). The introduction of water into the deforming sequence \n 2\ncan lead to the development of structures typically equated with intense ductile shearing (e.g. \nsheath folds, ductile shears) even at very low strains (van der Wateren et al., 2000; Phillips \nand Merritt, 2008; Lee and Phillips, 2008), aid in thrust propagation\/displacement (van \nGijssel, 1987; Andersen et al., 2005), and with increasing pore water pressure, the variable \nliquefaction and disruption of the sediment pile (Phillips et al., 2002; Phillips et al., 2007) or \neven catastrophic failure and water-escape (van der Meer et al., 1999; Rijsdijk et al., 1999). \nStructures formed during subglacial deformation have also been used in support of the \n‘deforming bed’ model (Boulton, 1986; Boulton and Hindmarsh, 1987; Hart and Boulton, \n1991b; Hart and Roberts, 1994; Roberts and Hart, 2000, 2005). Several studies have \nsuggested that deformation within the bed of a glacier was a major controlling factor on the \ndynamics of major Pleistocene ice sheets in both North America and northern Europe \n(Boulton and Jones, 1979; Licciardi et al., 1998; Piotrowski et al., 2001). Such deformable \nbeds are also thought to exist beneath several contemporary ice masses, including the West \nAntarctic Ice Sheet (Alley et al., 1987; Evans et al., 2006). Temporal and spatial changes in \nthe nature of subglacial deformation may control glacier movement (Alley, 1993), leading to \nthe development of a ‘stick-slip’ model for basal ice flow (Fischer and Clarke, 1997; Hoeoke \net al., 1997; Fischer et al., 1999). Evidence in the geological record for such a pattern of ice \nflow, suggests that the subglacial bed is in reality a ‘mosaic’ composed of zones of ‘stable’ \nand ‘deforming’ beds that change configuration in time and space (Piotrowski and Kraus, \n1997; Piotrowski et al., 2004; Evans et al., 2006; Lee and Phillips, 2008). \nThis paper contributes to the study of glacier induced deformation by examining the \nstructural evolution of highly contorted early Mid-Pleistocene pre-glacial and glacial \nsediments exposed along the north Norfolk coast in eastern England (Fig. 1). In this area, \nsediments exhibit a highly heterogeneous and often deformed appearance and have been \nreferred to by Banham (1968, 1975, 1988) as the ‘Contorted Drift’. The variation in intensity \nand style of deformation recorded by these sediments is consistent with a progression from \nthrust-related proglacial deformation to a more complex pattern of subglacial ductile folding, \nthrusting and ductile shearing. The formation of the gravitational basins into which a thick \nglacial outwash sequence were being deposited prior to deformation, the postulated ‘sag \nbasins’ of Banham (1975, 1988), Hart (1987) and Ehlers et al. (1991), has been critically re-\nexamined. A generalised model of proglacial to subglacial deformation and the role played by \npore water content on the proglacial thrust propagation and subglacial shear zone \ndevelopment are presented. \n \n 3\n2. Location of study site and geological context \nThe focus of this study is the coastal cliff sections (c. 1.5 km in length) between West Runton \n[National Grid Reference (NGR): TG 181 432] and Sheringham [NGR: TG 165 433] on the \nnorth Norfolk coast of eastern England (Fig.1). The topography of north Norfolk is dominated \nby a west-east trending push moraine\/outwash complex called the Cromer Ridge that \nintersects the coastline at Trimingham (Hart, 1990). From Trimingham, westwards around the \ncoast for approximately 14 km to Sheringham, the cliffs range in height from 40 to 60 m OD \nand display a variably deformed sequence of Lower to Mid-Pleistocene pre-glacial and glacial \nsediments resting unconformably upon chalk bedrock (Banham, 1968; Hart and Boulton, \n1991a; Lunkka, 1994; Rose et al., 2001; Lee et al., 2004a; Hamblin et al., 2005). Pre-glacial \nfluvial and shallow marine deposits correspond to the Cromer Forest-bed Formation and \nWroxham Crag Formation, respectively (West, 1980; Briant et al., 1999; Allen and Keen, \n2000; Rose et al., 2001; Pawley et al., 2004; Lee et al., 2006). The overlying glacial sequence \nconsists of a number of tills and associated outwash sediments widely considered to have \nbeen deposited contemporaneously by coexisting British (Lowestoft Formation till) and \nScandinavian (North Sea Drift\/Cromer Tills) ice sheets during the early Mid-Pleistocene \nAnglian Glaciation (Marine Isotope Stage (MIS) 12) (Mitchell et al., 1973; Perrin et al., 1979; \nBowen et al., 1986; Ehlers and Gibbard, 1991; Hart and Boulton, 1991a; Lunkka, 1994; \nBowen, 1999; Fish and Whiteman, 2001).  \n More recently, a new glacial stratigraphy for the region has been proposed based upon \ndetailed geological mapping, lithological analyses, and the examination of available sections \nand borehole information (Lee et al., 2004a). This new stratigraphy breaks down the \nglacigenic sequence into four distinctive and mappable formations, namely the Happisburgh, \nLowestoft, Sheringham Cliffs and Brition’s Lane formations (Lee et al., 2004a; Hamblin et \nal., 2005). Of critical significance is the identification that the middle (of three) North Sea \nDrift tills, the Second Cromer Till (Banham, 1968) or Walcott Till Member (Lee et al., \n2004a), forms part of a mappable continuum with till of the Lowestoft Formation (s.s. \nLowestoft Till) and, therefore, forms a regionally extensive chronostratigraphic (Anglian) \nmarker horizon that can be traced across much of eastern and central Britain (Hamblin et al., \n2000, 2005). Two other fundamental new ideas have evolved from this stratigraphic work. \nFirstly, detailed provenancing work undertaken on the North Sea Drift\/Cromer Tills has \ndemonstrated that they are not Scandinavian as previously considered, but derived from a \nBritish-based ice sheet (Lee et al., 2002, 2004a). Secondly, that some of the glacial deposits \npreviously assigned to MIS 12 may correspond to earlier and\/or later Middle Pleistocene \n 4\nglaciations (Hamblin et al., 2000, 2005; Lee et al., 2004b; Clark et al., 2004). This model is \nnot supported by all lines of evidence, most notably molluscan\/small mammal biostratigraphy \n(Preece and Parfitt, 2000) and luminescence dating (Pawley et al., 2008), and there remains an \napparent conflict between multiple lines of stratigraphic evidence.  \n At West Runton itself, Lower and Mid-Pleistocene deposits rest upon Upper \nCretaceous chalk bedrock. The pre-glacial part of this sequence consist of organic freshwater \nmuds (Cromer Forest-bed Formation) and shallow marine sands and gravels (Wroxham Crag \nFormation) (West, 1980). The overlying glacigenic sediments are highly deformed (the \n‘Contorted Drift’ of Banham, 1975, 1988) and, therefore, establishing a local stratigraphy on \nwhich to base any structural interpretation has proved difficult (see Banham, 1975, 1988; \nHart, 1987; Hart et al., 1990; Hart and Boulton, 1991b; Hart and Roberts, 1994; Roberts and \nHart, 2000, 2005). Although locally disrupted by thrusting and folding, elements of the glacial \nsuccession can be recognised (Table 1), and the regional stratigraphy of Lee et al. (2004a) and \nHamblin et al. (2005) has proved to be the most robust when attempting to unravel the \ncomplex deformation history recorded by the glacial deposits exposed at West Runton (see \nbelow). The majority of the previous studies have agreed that the deformational overprint on \nthe West Runton succession was subglacial in origin (Hart, 1987; Hart and Boulton, 1991b; \nHart and Roberts, 1994), and has been used in support of the deforming bed model of glacier \nmovement (Roberts and Hart, 2005). This interpretation is in marked contrast to that of Eyles \net al. (1989), who considered the entire sequence as having been deposited in a glaciomarine \nenvironment as a sequence of subaqueous gravity flows. \n \n3. Methodology \nThe depositional setting and subsequent deformation history of the glacial and pre-glacial \nsediments exposed between West Runton and Sheringham have been investigated using a \nrange of macro-scale techniques. The section was described on the basis of its macro-scale \nfeatures with particular emphasis placed on recording the type of bedding, sediment type, bed \ngeometry and structure (both sedimentary and glacitectonic). The orientation of folds, \nfoliations, faults, and lineations, as well as bedding present within the lower 1 to 2 m of the \ncliff face were recorded from a number of points along the length of the section. The sense of \nasymmetry of various fold phases and movement on the faults, and inter-relationships \nbetween the various generations of structures were established. Successive generations of \nfolds (F1, F2…..Fn), fabrics (S1, S2…..Sn) and lineations (L1, L2…..Ln) are distinguished by \nthe nomenclature normally used in structural geological studies (S1 earliest fabric to Sn \n 5\nlatest). However, this nomenclature does not necessarily imply that these structures were \ndeveloped in response to separate deformation events (D1, D2…..Dn). A sequence of \noverlapping photographs were taken of the cliffs enabling the analysis of the larger-scale \nstructures developed along the entire length of the coastal section. Due to significant changes \nin perspective between some of the photographs, the interpretive section is divided into \nseveral overlapping segments (Figs. 2, 4 and 5). A large format (A0) supplement of this \nphotographic interpretation and structural synthesis of the West Runton to Sheringham coastal \nsection have been made available by the authors for download. \n \n4. Deformation structures and stratigraphical relationships between West Runton and \nSheringham \nPublished studies (e.g. Hart and Roberts, 1994; Roberts and Hart, 2005) have largely focused \nupon the highly complex, but relatively small-scale, structures present within the tills exposed \nat the base of the cliff section. The re-examination of the coastal section between West \nRunton and Sheringham, however, has recognised the presence of a number of large-scale \ndeformation structures (folds, thrusts, shear zones) within this polydeformed succession, and \nthat the style and intensity of deformation varies from east to west. This has lead to a major \nreinterpretation of the deformation history recorded by these sediments. For ease of \ndescription the section has been divided into three subsections or ‘structural domains’ (Figs. \n1, 2, 4 and 5) which exhibit a similar range of deformation structures. The relationships \nbetween the main lithological units and the range of large to small-scale deformation \nstructures present within each of these subsections are described below. \n \n4.1. Domain 1 \nThe sequence exposed at the eastern end of the coastal section (Fig. 2) is relatively \nundeformed and dominated by bedded, yellow to yellow brown, glaciofluvial outwash sands \nand gravels; the Runton Sand and Gravel Member (RSGM, Table 1). Sedimentary structures \n(normal grading, cross-bedding, ripple-drift lamination, trough cross-bedding) preserved \nwithin this relatively thick (up to c. 15 m thick) sand-dominated sequence clearly demonstrate \nthat it is the right-way-up and has not undergone large-scale overturning during deformation. \nBedding in the majority of the section is horizontal to very-gently dipping, but locally \nsteepens (sub-vertical) immediately adjacent to a number of wedge-shaped prisms of till, \nforming large, open, ‘dish-like’ synformal structures (Fig. 2). Banham (1975, 1988) and Hart \nand Roberts (1994) interpreted these broad (50-150 m across) sand-filled features as having \n 6\nformed in response to loading, their so-called ‘sag basins’ (also see Roberts and Hart, 2000; \nLunkka, 1994). At the eastern end of Domain 1 the RSGM rests directly upon the sands and \ngravels of the Wroxham Crag Formation (WCF, Table 1) (Fig. 2a). This boundary varies from \nan erosive sedimentary contact where the RSGM clearly cuts down through the glacial \ndeposits into the underlying sedimentary sequence, to a glacitectonic boundary formed by a \nsharp planar thrust. Further west, the RSGM and WCF are separated by the variably \ndeformed, massive to finely laminated calcareous silts and clays of the Marl Bed (MB) of the \nSheringham Cliffs Formation (Table 1). The contact between the marl and underlying WCF is \ntectonic and formed by a subhorizontal to gently west-dipping thrust. Thrust-bound slices (up \nto 50 cm thick) of the finely stratified\/foliated, brown-grey Bacton Green Till Member \n(BGTM) locally occur along this décollement (Figs. 2 and 3a). Bedding within the marl is \nlocally folded and off-set by a number of small-scale thrusts which link into the décollement \nsurface at its base. The lamination within the hanging walls of these thrusts is deformed by at \nleast one set of small-scale normal and reverse faults, and in some instances is disrupted by a \nfine, vein-like network of hydrofractures filled by laminated to massive calcareous mud. In \nthe centre and towards the western end of Domain 1, larger-scale east-verging folds and \nthrusts located within the MB locally propagate upwards through the sequence to deform the \noverlying RSGM (Fig. 2c). The east-directed thrusts have occasionally resulted in the \nemplacement of small (up to 1-2 m in length), variably folded lenses of marl into the basal \nsequence of the RSGM (see Fig. 2e). Locally the metre-scale folds deforming the boundary \nbetween the MB and RSGM are convolute in form and comprise narrow, steeply inclined, \nflame-like antiforms of marl projecting upwards into the overlying sands, separated by broad, \nopen synforms (Fig. 3b). The axial surfaces of the folds dip towards the west, with the folds \nshowing a slight asymmetry towards the east\/east-northeast. \n The main structural features present within Domain 1 are a number of  large (10-15 m \nhigh, 8-10 m across), symmetrical to asymmetrical, ‘saw-tooth’ or ‘wedge-shaped’, fault-\nbound structures composed of thrusted and folded Bacton Green Till, Marl Bed and \noccasionally Wroxham Crag Formation (Figs. 2 and 3a). For ease of description these \ninternally complex features are informally referred to as ‘till-prisms’. The overall size and \ncomplexity of these structures increases towards the west where they are associated with a \ngreater intensity of deformation within the RSGM. The layering\/bedding present within the \nthrust-bound slices of BGTM and MB steepens upwards, becoming sub-vertical within the \nupper parts of the ‘till-prism’. Tight to isoclinal, recumbent to inclined folds which deform the \nstratification\/layering within the till, are locally truncated by the thrusts which form the \n 7\ncontacts with the adjacent slabs of marl. The base of the ‘till-prisms’ are marked by either a \nsharp planar thrust (Fig. 3a) or wider ductile shear zone; both of which link into the \ndécollement surface at the top of the structurally underlying WCF (see Fig. 2). The shear zone \n(10-30 cm thick) is marked by finely foliated sand and silty sand containing thin stringers of \nclay-rich till. The eastern-margins of the ‘till-prisms’ are typically steeply inclined and \nformed by either a single, listric normal fault (downthrow to east), or a number of steeply \ninclined (60-80°), east\/east-northeast-dipping, planar normal faults (also downthrow to east). \nThe latter also occur within the adjacent RSGM and result in localised drag folding and \ndisruption of bedding within these sands. The western margins of the ‘till-prisms’ are curved, \nand marked by either the disturbed\/tectonised erosive base of the RSGM, or an arcuate, west-\ndipping, east\/east-northeast-directed thrust which over steepens towards the tip of the ‘prism’.  \nBedding within RSGM immediately adjacent to the ‘till-prism’ occurs parallel to the \nvariably tectonised contact, and appears to locally ‘drape’ over the top of these bodies. In the \ncentral part of Domain 1, bedding within the RSGM defines two open anticlines linked by a \nsyncline (Fig. 2d). These folds are developed above two smaller (8-10 m high), closely spaced \n‘till-prisms’. Elsewhere, however, individual sand and gravel beds thin towards the margin of \nthe ‘till-prism’ and apparently either lap onto, or are truncated against this boundary. These \nrelationships are best seen at the eastern end of the domain, as further west the RSGM \nbecomes increasingly deformed. This deformation, where present, is most pronounced on the \nwestern side of the ‘till-prisms’, where the sands and gravels are folded (east\/east-northeast-\nverging) and thrusted (east\/east-northeast-directed) (Fig. 2). \n \n4.2. Domain 2 \nContinuing further westward along the coastal section, Domain 2 (Fig. 1) is characterised by a \nmarked increase in the intensity of deformation (Fig. 4). The eastern end of the domain is \ndominated by a large (c. 25 m high, c. 35 m wide) wedge-shaped structure composed of east-\ndipping, fault\/thrust-bound slabs of MB and WCF, juxtaposed against the eastern side of a \ntriangular shaped mass of till (Figs. 3c and 4). This feature is composed of an outer layer of \nBGTM overlying a core of dark grey Happisburgh Till Member (HTM) (Figs. 3c and 4). \nImmediately to the west, the RSGM contains a number of thrust-bound lenses of MB and \nBGTM. (Figs. 3d and 3e). This imbricate\/thrust-stacked sequence is deformed by a large-\nscale, recumbent to gently inclined syncline (Fig. 3e and 4), the axial surface of which dips at \na low-angle towards the west. Large-scale fore-sets (Fig. 3d) are well-preserved in the RSGM \non the lower limb of this syncline indicating that the sequence is the right-way up. The folded \n 8\nand thrusted sediments of the RSGM are structurally underlain by the massive to highly \ndeformed (folded and thrusted) diamictons of the BGTM overlying the HTM, which form the \nlower part of the cliff (Fig. 4). The boundary between the tills and overlying sands is tectonic \nand locally off-set by steeply west\/northwest-dipping reverse faults. \nThe complex, wedge-like feature at the eastern end of Domain 2 is morphologically \nand structurally similar to the ‘till-prisms’ of Domain 1, and comprises a tectonically-stacked \nsequence of MB, BGTM, HTM and WCF, forming a steep-sided, symmetrical to weakly \nasymmetrical, ‘saw-toothed’ body which apparently ‘deflects’ or ‘distorts’ bedding in the \noverlying sands and gravels. The base of this structure is flat and marked by a subhorizontal \nthrust (Figs. 3c and 4). This thrust forms a prominent décollement surface at the top of the \nstructurally underlying WCF. Bedding within the sands and gravels, immediately below this \nthrust is transposed into a finely spaced glacitectonic foliation defining a 10 to 30 cm thick \nzone of ductile shear at the top of the WCF. No obvious kinematic indicators were recognised \nwithin this shear zone; consequently the sense of movement across this structure is uncertain.  \nThe eastern margin of the ‘till-prism’ is apparently a primary sedimentary contact \nformed by the erosive base of the RSGM, resting upon a 3 to 4 m thick slab of MB. The base \nof the marl is marked by a 25 to 40 cm thick shear zone composed of highly foliated and \nfolded sand (Fig. 3f) derived from the underlying WCF. Kinematic indicators (asymmetry of \nfolds, sigmoidal S-C-like fabric geometries, see Passchier and Trouw, 1996) present within \nthis high strain zone indicate a sense of shear towards the east\/east-northeast. The slabs of MB \nand WCF which form the eastern face of this till-prism dip towards the east and terminate \nnear the top of the cliff, forming a fault-bound, hollow with ‘stepped’ sides and filled by \nRSGM (Fig. 4). Bedding within the sand is deformed by an upright, open synform. The \nwestern margin of the ‘till-prism’ is formed by an arcuate, steeply to gently dipping thrust \nwhich becomes progressively shallower dipping westwards, where it passes into the \ntectonised zone separating the BGTM and RSGM. \n \n4.3. Domain 3 \nDomain 3 (Fig 1) represents the remainder of the coastal section between West Runton and \nSheringham (Fig. 5). In this domain, the glacigenic and pre-glacial sediments are highly \ndeformed with deformation resulting in the modification and local overprinting of the \nsedimentological characteristics and stratigraphical relationships between the various units. \nThe sequence can be divided into four main components; the grey massive to moderately \nfoliated HTM at the base of the cliff, overlain by the highly folded and foliated BGTM, which \n 9\ngrades upwards into the RSGM, and a glacitectonic mélange derived from both the BGTM \nand RSGM. Both the BGTM and RSGM contain thrust-bound, locally stacked lenses or rafts \nof WCF (Figs. 5 and 6a), MB, Sheringham Cliffs Formation clay, chalky Walcott Till \nMember (WTM), sand and chalk bedrock. This highly deformed sequence corresponds to the \n‘Laminated Diamicton’ of Hart and Roberts (1994).  \nThe thickness of the HTM and BGTM increases westwards where they dominate the \nexposed sequence (Fig. 5). The contact between the two tills, although irregular, is generally \nsharp. The HTM does, however, exhibit an increase in intensity of deformation towards this \nboundary where it possesses an intense domainal foliation (S1), deformed by tight to isoclinal \n(Fig. 6b), locally intrafolial (Fig. 6c), recumbent to gently inclined folds (F1\/2). Eye-shaped \nfold interference patterns also occur within the HTM (Fig. 6d), showing that the till has \naccommodated several phases of folding. The S1 foliation is defined by pale grey, carbonate-\nrich layers and stringers of disaggregated chalk (Figs. 6c, e and f) which have locally \nundergone attenuation and boudinage (Fig. 6f) (also see Hart and Roberts, 1994; Roberts and \nHart, 2000, 2005). S-C and ECC (extensional crenulation cleavage, see Passchier and Trouw, \n1996) fabric geometries and off-sets on small-scale faults developed within the till yield an \neasterly-directed sense of shear (Fig. 6f). The HTM locally contains highly distorted augen or \nrafts of WTM (Fig. 7a). Flame-like projections and tails extending from the WTM pass \nlaterally into the banded S1 fabric within the HTM. This suggests that the compositional \nlayering within the HTM may have been partially derived from the incorporation of the WTM \nduring deformation. S1 in the HTM is co-planar to the locally intense foliation present within \nthe BGTM and glacitectonic layering within the structurally overlying mélange. The \norientation of S1 within both tills is highly variable (Fig. 8a). However, on a lower \nhemisphere stereographic projection of dip and dip azimuth, the data forms two distinct \nclusters indicating that over the entire length of the section S1 dips either at a shallow angle \ntowards the east-northeast, or more steeply towards the northwest (Fig. 8a). As in the HTM, \nthe foliation within the BGTM is deformed by easterly verging, small- to meso-scale, tight to \nisoclinal, recumbent to gently inclined folds (Figs. 7b, c and d). In some cases, these folds are \ndisharmonic with S1 becoming progressively disrupted and diffuse towards the hinge, \nindicative of the till locally containing a high-pore water content during deformation. \nElsewhere, the F1\/2 folds are developed in the hanging walls of S1-parallel, typically easterly \ndirected thrusts and ductile shear zones (Fig. 7d). The gently plunging F1\/2 folds are non-\ncylindrical with curvilinear fold axial traces resulting in the observed range in fold trend \nshown on Fig. 8b. The folds deform a locally well-developed, north\/north-northeast plunging \n 10\n(Fig. 8c) stretching lineation (L1) developed upon S1 surfaces (Fig. 7e). This lineation, \ntherefore, predates folding. A second, southwest-plunging crenulation lineation (L2) is locally \ndeveloped in the hinges of the F1\/2 folds (Figs. 7c and 8c). The early recumbent to gently \ninclined folds are themselves deformed by later upright to moderately inclined, asymmetrical, \neasterly verging, small to meso-scale folds (F2\/3) which plunge towards the southeast (Fig. \n8b). \n The boundary between the BGTM and the overlying RSGM is gradational and \nirregular in form. At the eastern end of Domain 3, the RSGM has partially retained its well-\nbedded character and the boundary with the underlying BGTM can be located to within 20 to \n30 cm. In this area the RSGM is highly folded and thrusted (Figs. 5a to d) recording an \noverall transport direction towards the east. Further to the west, bedding is increasingly \ndisrupted and overprinted by a glacitectonic layering which is coplanar with S1 in the \nunderlying BGTM. In this part of the section (Figs. 5f to h), the BGTM is much thicker (up to \n20 m thick) and comprises a sandy till which grades upwards, over several metres, into a \nhighly deformed mélange facies. The mélange was apparently derived from glacitectonic \nmixing of the BGTM and RSGM, consequently, locating the boundary between these two \nunits can be problematic. A similar division of the BGTM into a lower, stratified sandy till \nfacies and upper mélange facies has been recognised by Lee and Phillips (2008) in its type \nsection exposed 15 km southeast at Bacton Green. The intensity of deformation within the \nmélange, which included both ductile folding and later brittle thrusting (see Figs. 5g and h), is \nvariable and appears to have been focused\/partitioned into discrete zones. In these highly \ndeformed zones the mélange contains slab-like, asymmetrical to tightly folded lenses of sand \n(Figs. 5 and 7f) which are wrapped by the foliation within the host sediment. The geometry of \nthese sand lenses records an overall sense of shear towards the east. The thrusts dip at \nmoderate to low angles towards the west and are marked by, or occur within broader zones \n(up to c. 1-2 m thick) of enhanced ductile shear. Elsewhere, the layering and relict bedding \nwithin the mélange are folded by small to meso-scale east-verging structures. In one part of \nthe section, the layering and sand lenses contained within the mélange have been deflected \nupwards, becoming increasingly fragmented and disrupted towards the top of the cliff (Fig. \n9a). At its base this zone of disruption is c. 3 m across and represents an inverted funnel-\nshaped water-escape conduit (Figs. 5g and 9a).  \nAlong the length of Domain 3, the gradational contact between the BGTM and RSGM \nperiodically rises to form a series of large (up to 10-15 m across), symmetrical to \nasymmetrical ridge-like features (Fig. 5). The till (both BGTM and HTM) within, and \n 11\nadjacent to these ridges is more intensely folded and thrusted (for example, see Fig. 5b). \nFurthermore, both the BGTM and mélange in the vicinity of these features contain a number \nof stacked, fault-bound slices of WCF, MB and RSGM (Fig. 5). The largest of these thrust \nslices or rafts is composed of well-bedded WCF and is over 50 m in length (Fig. 5f). The \neastern end of this raft is deformed by a large-scale, southeast-plunging antiform (Figs. 5f and \n6a). The shape of the ridges and associated deformation (including imbrication of the \nsequence) is comparable to that observed within the ‘till-prisms’ recognised in Domains 1 and \n2.  \nThe contact between the BGTM and RGSM, and that separating the BGTM from the \nunderlying HTM, are folded by a number of meso-scale (3-5 m), convolute-like, upright to \nsteeply inclined synforms (Fig. 9a, also see Figs. 5a c and e). These convolute folds deform \nthe earlier developed S1 fabric and F1\/2 folds within the tills. The limbs of the convolute \nfolds are locally deformed by a set of southeast-plunging, inclined folds (F2\/3) which result in \nthe ‘pinching’ of the limbs of the synform and partial isolation of the fold nose (Fig. 9a). The \ncores of these convolute structures are composed a rounded to tear-drop shaped mass of thinly \nbedded to massive sand and gravel apparently derived from the RSGM and\/or WCF. Folded, \nisolated slabs, lenses and augen (up to 1-2 m across) of sand derived from the WCF and \nRSGM occur within both the HTM and BGTM (Figs. 9c and d, also see Figs 5a to d). The \nasymmetry of the folds and overall shape of these sand bodies indicates a sense of shear \ntowards the east. \nAt the western end of Domain 3, the boundary between the HTM and RGTM is \nmarked by a thin (≤ 2 m thick), but laterally extensive thrust-bound raft of WCF overlying \nchalk (Fig. 5h). The raft preserves intact the sharp, erosive contact between these well-bedded \nsands and gravels, and the underlying chalk bedrock (Fig. 9e). In contrast, the chalk (10 to 40 \ncm thick) is massive and putty-like in texture, and cut by narrow (1-3 cm wide) shear zones \ncomposed of highly deformed HTM (see Fig. 9e). The HTM immediately below the raft \ncontains highly deformed stringers and lenses of chalk, defining a variably developed \nfoliation parallel to the base of this bedrock slab. This fabric wraps around small rounded \nclasts (up to c. 5 cm in diameter) of chalk (± flint) included within the HTM. These clasts are \nenclosed within symmetrical to asymmetrical pressure shadows and\/or elongate carbonate-\nrich tails which record an overall east-directed sense of shear. Elongate slab-like to \nasymmetrical lenticular chalk rafts (up to 2.5 m in length), occur elsewhere within the HTM, \nalso indicate an east-directed sense of shear and are variably deformed by recumbent F1 folds \n(Fig. 9f).  \n 12\n 5. Proglacial to subglacial deformation model for West Runton \nBased upon the structural analysis outlined above, a number of broad conclusions can be \nmade regarding the deformation history recorded by the Middle Pleistocene sequence exposed \nbetween West Runton and Sheringham: \n• the West Runton-Sheringham sequence can be divided into three sections or structural \n‘domains’ which internally share a similar deformation history; \n• there is a marked increase in the intensity of deformation from east to west along the \nlength of the section (Domain 1 = least deformed, Domain 3 = most intense \ndeformation); \n• this increase in intensity is accompanied by a change from simple thrusting and \nimbrication in the east (Domain 1), through to a more complex history, towards the \nwest (Domain 3), involving several phases of folding, thrusting and water-escape; \n• although there is a clear variation in both the style and intensity of deformation across \nthe three domains, the asymmetry of the folds, direction of transport on the thrusts, \nand asymmetry of deformed sand lenses, or augen, all yield a similar east\/east-\nnortheast directed sense of shear, consistent with ice advancing from the west\/ \nsouthwest. \nThe major deformation structures (folds and thrusts) developed within these \nglacitectonically disturbed sediments are shown in Fig. 10. The simplest interpretation of \nthese structures is in terms of a progressive proglacial to subglacial deformation model, \ninduced by ice advancing from the west\/southwest. The sequence exposed between West \nRunton and Sheringham consists of pre-glacial deposits or glacial sediments laid-down during \nearlier ice advances. The provenance of both the HTM and BGTM indicate that they were \nderived from ice advancing from the north (Lee et al., 2002, 2004a). The westerly derivation \nof the ice resulting in deformation at West Runton marks a major change in ice flow direction. \n \n5.1. Proglacial deformation (Domain 1) \nStructural Domain 1 records a relatively simple deformation history dominated by east-\ndirected thrusting and the development of the steep-sided ‘till-prisms’ which locally \n‘puncture’ the relatively undeformed RSGM (Figs. 2 and 10). This thrust-dominated \ndeformation is interpreted as having taken place in a proglacial setting in advance of the \nencroaching ice sheet. At the eastern end of the section, thrusting and associated ductile \n 13\nshearing occurs at, or near to the top of the WCF (Fig. 10). This thrust system appears to \nrepresent part of the main décollement surface which formed at the base of the deforming \nsediment pile or could represent the reactivation of a palaeo-décollement surface formed \nearlier during the accretion of the Happisburgh Till (Lee, 2001). The overlying RSGM shows \nvery little evidence of deformation, apart from immediately adjacent to the ‘till-prisms’ \n(labelled TP1 to TP 4 on Fig 10) where bedding steepens rapidly, and is locally off-set by \nnormal faults. Further west, thrusting occurred within the finely laminated MB and resulted in \nthe localised thrust-repetition and stacking of the pre-glacial sequence (Fig. 10). The base of \nthe RSGM, in this area, varies from a sharp erosive contact cutting down into the underlying \nMB, through to a glacitectonic contact, marked by either a thrust or deformed by narrow, tight \nantiforms and open synforms (Figs. 2 and 3b). These convolute-style folds indicate that the \nmarl locally possessed a relatively high pore water content leading to soft-sediment \ndeformation rather than thrusting. As previously stated, deformation within the RSGM is \nfocused adjacent to the till-prisms, but further east, west-dipping thrusts ramp upwards from \nthe basal décollement at the top of the underlying pre-glacial sediments to deform these well-\nbedded sand and gravels (see Figs. 2 and 10). This westerly increase in the intensity of \ndeformation probably reflects an increase in the degree of shortening within the hanging wall \nof the basal décollement nearer to the ice margin. \n The main structures developed in Domain 1, the ‘till-prisms’ (Figs. 2 and 10), are \ncomposed of highly deformed (folded and thrusted) BGTM and thrust-bound slices of MB \nand WCF. Consequently, these wedge-shaped features are interpreted as glacitectonic in \norigin. They are thought to have formed in response to deformation occurring near to the tips \nof the propagating thrusts as they ramped upwards through the sedimentary sequence in \nadvance of the approaching ice sheet (see Fig. 11). Initial deformation led to folding, followed \nby thrusting and stacking of detached slices of the BGTM and, in some instances, the \nunderlying pre-glacial sediments. The size and complexity of the ‘till-prisms’, in general, \nincreases towards the west, i.e. in an up-ice direction (Fig. 11). The steep margins of these \nfeatures (see Figs. 2, 3a and 10) are thought to preserve the original geometry of the ‘till-\nprisms’. Consequently, their upward growth would have resulted in the observed folding and \nnormal faulting of the adjacent RSGM (Fig. 11) as these unconsolidated sediments collapsed \noff of the sides of these thrust-related structures. In between the ‘prisms’, bedding within the \nRSGM was deformed into broad, open, dish-like synclines.  \nThe 3D geometry of the thrust-related ‘till-prisms’ is uncertain due to the 2D nature of \nthe coastal section. However, during the early stages of deformation and propagation of the \n 14\nthrusts into the foreland, the tip of the main décollement surface is likely to have been \ncomposed of several short thrust-segments, rather than a single laterally extensive growth tip. \nThis would have resulted in the growth of several short, arcuate ‘till-prisms’ associated with \neach thrust segment. As deformation continued the individual thrust-segments would have \nbegun to coalesce, leading to the development of a single elongate, sinuous, ridge-like thrust-\nrelated moraine. \n \n5.2. ‘Ice-marginal’ deformation (Domain 2) \nStructural Domain 2 is characterised by thrusting, folding and large scale imbrication of the \nsequence, as well as the more pervasive deformation of the RSGM (Figs. 4 and 10). The \nmarked increase in the intensity and complexity of thrusting and folding in this part of the \nsection (Figs. 4, 3e and 10), is consistent with deformation having occurred in an ice-marginal \nsetting. The eastern end of the ice-marginal zone is marked by a large, internally complex \n‘till-prism’ (TP5 on Fig. 10) with the subhorizontal thrust at its base (Fig. 3c) representing an \nup-ice extension of the basal décollement beneath the proglacially deformed RSGM (Fig. 10). \nThe E-dipping, thrust-bound slabs of MB and WCF, juxtaposed against the eastern (down-ice \nside) of this large wedge-shaped structure (Figs. 3c, 4 and 10) appear to have slipped down \n(gravity driven) this steep face. The resultant hollow formed above these displaced blocks was \nfilled with RSGM. The presence of a large wedge-shaped till body within the path of the \nadvancing ice sheet would have impeded forward motion of the ice. The temporary stalling of \nthe ice is likely to have resulted in the observed thrusting and large-scale folding of the \nRSGM, MB and BGTM (Figs. 3e and 4) as these sediments were stacked against the western. \nup-ice, side of the ‘till-prism’ to form a large, internally complex push moraine (Fig. 10). \nEventually the stacking of detached slabs of glacial and pre-glacial sediment against this \nmoraine would have allowed the ice sheet to overcome the obstruction and resume its easterly \ndirected advance.  \nThe accretion of a large, relatively impermeable wedge of till within the moraine is \nlikely to have locally affected the pattern of subglacial drainage beneath the ice sheet (Figs. \n11 and 12). It may have effectively blocked the main exit for subglacial meltwater, leading to \nan increase in pore water pressure and\/or content beneath the ice sheet. The subglacial \ndrainage pattern would have then been forced to change with meltwater having to flow around \nthe margins of, or even beneath the push moraine (Fig. 12). The laterally extensive WCF, \nwhich lies beneath the deformed glacigenic sequence (Fig. 10), could have provided a \npathway for subglacial meltwater to escape beneath the till-rich moraine, feeding pressurised \n 15\npore water into either: (a) the décollement horizon at the base of the proglacially deforming \nsequence; or (b) into the sediments immediately beneath this structure. This would have led to \nthe lowering basal-friction, leading to an increase in thrust-gliding, changing the geometry of \nthe thrusts and increasing the length of the detached thrust sheets (see van Gijssel, 1987; \nNieuwland et al., 2000). The locally developed convolute folds and hydrofracturing within the \nMB provide evidence for the introduction of pressurised pore water into the basal décollement \nat some point during deformation. The effects of soft-sediment deformation and water-\nenhanced thrusting would have decreased away from the ice margin as the meltwater escaped \nthrough the permeable sands and gravels of the WCF and RSGM.  \n \n5.3. Subglacial deformation (Domain 3) \nStructural Domain 3 represents the most pervasively deformed part of the sequence (Figs. 5 \nand 10). The intensity of this deformation increases towards the west and is accompanied by a \nmarked increase in the thickness of the BGTM (see Fig. 10). This thick till can be divided into \na lower, highly foliated facies, structurally overlain by a pervasively deformed glacitectonic \nmélange. The complex association of folding, thrusting, mélange generation and water-escape \nrecorded by the HTM, BGTM and RSGM is interpreted as having occurred in response to \nprogressive subglacial deformation (cf. Banham, 1975, 1988; Hart and Boulton, 1991b; Hart \nand Roberts, 1994; Roberts and Hart, 2000, 2005).  \nThe deformation histories recorded by the HTM and overlying BGTM are clearly \npolyphase and included several phases of folding and fabric development. The earliest \ndeformation events recorded by these tills would have accompanied their deposition. \nHowever, recognising these syndepositional deformation events, (D1 = HTM, D2 = BGTM), \nhas been problematic due to the pervasive nature of the later (D3) subglacial deformation \nevent. The orientations of the F1\/2 folds (Figs. 6b to d) and S1 fabrics within the tills are \nhighly variable (Figs. 8a and b). The asymmetry of these folds (where it can be established), \nsense of movement on the associated thrusts (Fig 7d) and sense of shear recorded by small-\nscale kinematic indicators (e.g. shear bands, minor faults and ECC fabrics; Fig. 6f) within the \ntills are in general consistent with the east-directed deformation imposed during D3. This \nsuggests that earlier developed D1\/D2 structures within the tills have either been overprinted \nor strongly modified during the later event. The curvilinear nature of the F1\/2 fold axial \ntraces, the presence of disharmonic folding and the locally diffuse nature of the S1 fabric are \nconsistent with the BGTM possessing a relatively high pore water content at the time of \ndeformation. This points to a very short period of time separating the deposition of the BGTM \n 16\nduring D2 (ice advance from the north) and its subsequent ‘reworking’ or ‘remobilisation’ \nduring D3 (ice advance from the west\/southwest), or recharge at some point between D2 and \nD3. \nPublished macro-fabric orientations from West Runton record a pronounced northeast \nto southwest orientation of clast axes (Roberts and Hart, 2000) indicative of clast alignment \nassociated with a uni-axial stress field that is characteristic of high strains within subglacial \ndeforming beds (Hart, 1994; Benn, 1994). In detail the clustered macrofabrics are complex \nwith clast long axes plunging either to the southwest or northeast (see fig. 19 Roberts and \nHart, 2000). The development of this clast macrofabric may have accompanied the formation \nof the northeast\/north-northeast-plunging L1 stretching lineation developed upon S1 surfaces \n(Figs. 7e, 8c). If correct this would suggest an ice movement direction from the northeast, \nconsistent with macrofabric and flute evidence obtained from other sites (Happisburgh, \nTrimingham) in north Norfolk (Lunkka, 1988, 1994). However, shear planes from some sites \nat Trimingham and Happisburgh also show evidence of ice advance from the north and \nnorthwest (Hart, 1987; Lee, 2001). Roberts and Hart (2000) interpreted the West Runton \nmacrofabric data as recording an ice movement direction from the northwest, with clast \nfabrics defining a girdle distribution transverse to ice flow. It is possible that the macrofabrics \nwere imposed during the deposition of the HTM and BGTM. However, the complexity of \nclast long axis orientation suggests that they may have been modified during D3. \nAs D3 progressed, the early structures (F1\/2 folds and S1 fabrics) were folded by \nmoderately to steeply inclined, small- to meso-scale easterly verging folds (F2\/3). A number \nof these folds are convolute in form (Fig. 9b) and result in the infolding of RSGM into the \nstructurally underlying BGTM and HTM. These meso-scale soft-sediment deformation \nstructures provide further evidence that the BGTM and RSGM were highly mobile during D3 \nconsistent with a high pore water contents and\/or pressures during subglacial deformation. \nEast-directed thrusting during D3 largely post-dated folding and resulted in the stacking of \nthrust-bound slabs (or rafts) of HTM, BGTM, WCF and RSGM (Fig. 10). This modified the \noriginal stratigraphic relationships between these units and led to the tectonic thickening of \nthe sediment pile beneath the ice sheet. The thrusts probably formed during earlier proglacial \nto ice-marginal deformation and were periodically reactivated in response to shear imposed \nby the overriding ice. The contrast between the highly ductile soft-sediment deformation and \nmore brittle thrusting indicates that pore water contents\/pressures fluctuated during D3, either \nin response to seasonal fluctuations in meltwater production and\/or changes in the efficiency \nin the drainage at the front of the ice sheet.  \n 17\nThe symmetrical to asymmetrical ridge-like features in the subglacially deformed part \nof the section (labelled TP6 to 12 on Fig. 10) are morphologically and structurally similar to \nthe thrust-related moraines (‘till-prisms’) developed in response to proglacial deformation \n(see above). However, the over-steepened, wedge-shaped morphology of these features is less \npronounced within Domain 3, consistent with their modification during subglacial D3 \ndeformation. The presence of these relict proglacial features within the bed of the overriding \nice sheet apparently acted as a focus for continued (subglacial) thrusting and shearing. The \nresultant brittle thrusts and ductile shear zones propagated upwards into deform the mélange \nfacies of the BGTM (see section adjacent to TP12, Fig. 10). On the immediate up-ice side of \none of these overridden moraines (TP12, Fig 10), the mélange is cut by a large-scale water-\nescape conduit (Figs. 5g and 9a). The base of this water-escape feature terminates or roots \ninto the contact between the BGTM and underlying HTM, suggesting that pressurised pore \nwater was flowing along this lithological boundary. The presence of water-escape features \nprovides further evidence that the BGTM was saturated with water at the time of deformation \nand that pore water pressures locally exceeded the cohesive shear strength of these sediments. \nThe location of this conduit in the immediate up-ice side of one of these remnant ‘till-prisms’ \nsuggests that there may be a link between the two structures. Glacier induced stress would \nhave built up on the up-ice side of these relict proglacial features, not only leading to \nthrusting, but potentially an increase in pore water pressure. This localised pressure increase \nmay have controlled the location of the observed, potentially catastrophic, water-escape.  \n \n6. Formation of a subglacial shear zone in response to subglacial deformation \nThe intensity of subglacial deformation recorded by the BGTM and RSGM increases towards \nthe western end of the West Runton to Sheringham section (Figs. 10 and 12). This is \naccompanied by the marked thickening of the BGTM and disruption and variable overprinting \nof bedding in the RSGM. The boundary between the two units becomes increasingly ‘blurred’ \nwith the gradation between the BGTM and RSGM leading to the conclusion that the mélange \nformed as a result of the glacitectonic mixing of the two units during D3. At Bacton Green, 15 \nkm to the southeast, the mélange facies of the BGTM has been interpreted by Lee and Phillips \n(2008) as having developed in response to the development of a subglacial shear zone. At \nWest Runton, the subglacial shear zone (D3 in age) is represented by the mélange facies (c. \n20-25 m thick) of the BGTM which thickens westwards (i.e. in an up-ice direction) where it is \ncomposed of a complex, anastomosing network of shallowly to moderately west-dipping \nthrusts and broader ductile shear zones wrapping around apparently lower strain areas (Fig. \n 18\n12; also see Fig. 15). In these low strain domains, the glacitectonic layering and locally \npreserved bedding are deformed by east-verging asymmetrical shear folds.  \nTwo contrasting models have been published to explain the evolution and deformation \nof subglacial tills. The first suggests that subglacial deformation is pervasive and that all \nsubglacial till facies (melt-out tills, lodgement tills…etc) ultimately undergo shearing and \nshould, therefore, be classified as deforming bed tills (van der Meer et al., 2003; Menzies et \nal., 2006). The second model argues that a spatial and temporal ‘mosaic’ comprising actively \ndeforming and stable (non-deforming) zones develop within the subglacial deforming bed \n(Piotrowski and Kraus, 1997) in response to either the degree of water-induced decoupling at \nthe ice-bed-interface (IBI) (Hoffman and Piotrowski, 2001), or the ability of the subglacial \nbed to drain inter-granular pore water (Piotrowski et al., 2004). Evans et al. (2006) and Lee \nand Phillips (2008) argue that the deformation of the glacier bed comprises elements of both \nmodels with the pattern of deformation changing temporally and spatially. \nAs at Bacton Green, macroscopic structural evidence from the West Runton to \nSheringham section suggests that subglacial deformation of the BGTM and RSGM involved a \nshifting pattern of relatively ‘high’ and ‘low’ strain zones. During the earlier stages of D3 \nshear stress imposed by the overriding glacier ice was being transmitted throughout the entire \nsubglacial bed resulting in the formation and contemporaneous deformation of the mélange, \nwith ductile folding also effecting the lower parts of the BGTM and upper part of the HTM \n(Fig. 12); as predicted by Hart and Boulton (1991b) and van der Wateren et al. (2000). \nSubsequently, deformation within the mélange was preferentially partitioned into discreet \nzones of enhanced ductile shear. This partitioning is likely to have been controlled by the \nvariation in pore water content and the rate of thickening of the mélange, with deformation \nbeing focused into the relatively weaker, ‘water-rich’ (dilated) parts of the sequence (cf. \nEvans et al., 2006; Lee and Phillips, 2008). The highly deformed and disrupted nature of the \nmélange suggests that it probably accommodated the bulk of the shear being transmitted into \nthe deforming bed and, therefore, the majority of the displacement achieved by the overriding \nglacier ice. During the later stages of D3, however, ductile deformation was superseded by \nbrittle thrusting. This change in deformation mechanism probably reflects a fall in the pore \nwater content and locking up of the subglacial shear zone. Dewatering during the later stages \nof D3 was probably instigated by the overburden pressure exerted by the overriding ice and \nassisted by the tectonic thickening and accretion of the deforming bed (Lee and Phillips, \n2008). \n 19\nThe thickening of the BGTM, in particular, the highly deformed mélange facies, \ntowards the west (Fig. 10) indicates that the subglacial shear zone also widened in this up-ice \ndirection. The initial formation of the shear zone, followed by the disruption and mixing of \nthe RSGM with upper part of the BGTM, may have been aided by the migration of meltwater \nthrough the sediment pile. The enhanced drainage near to the front of the glacier would negate \nthe build up of meltwater, limiting the potential for water-enhanced ductile shear in this more \nice-marginal setting (see Fig. 12). Instead deformation was dominated by heterogeneous \nfolding and thrusting. Further up-ice, however, subglacial drainage would become \nincreasingly restricted, with the overlying glacier forming an impermeable ‘cap’ forcing water \nto travel laterally through the deforming sediment pile or at the ice-bed-interface. The over-\nconsolidated nature of the HTM near the base of the sequence would have concentrated this \nfluid flow within the BGTM and overlying RSGM. As deformation progressed, the \nintroduction of additional subglacial meltwater from up-ice would have led to the increasing \ndilation and weakening of the BGTM and RSGM. This would have resulted in the expansion, \nboth vertically (upwards) and laterally (sideways) of the shear zone, progressively \nincorporating more of the adjacent sediments into the glacitectonic mélange. The developing \nshear zone would have provided an ideal pathway for fluid migration, further feeding this \nwater lubricated system. During the later stages of D3, the water content of the sediment \ndecreased and fluid enhanced shearing was arrested, leading to the ‘locking up’ and ‘collapse’ \nof the subglacial shear zone. This ‘locking’ of the system is recorded by renewed brittle \nthrusting during the later stages of D3. Importantly, field evidence suggests that rather than \ndeveloping immediately below the overlying glacier (as predicted by the deforming bed \nmodel Boulton and Hindmarsh, 1987; Hart and Boulton, 1991b), the shear zone formed along \na major lithological boundary deep within the deforming sediment pile (Fig. 12). The \nlithological contrasts (clayey till beneath, sand above) would have led to the focusing of fluid \nflow along this boundary, indication that water content is a major contributing factor in the \nsighting of the subglacial shear zone.  \nThe periodic accretion of impermeable prisms of till to the push moraine at the front \nof the advancing glacier (Fig. 12; see section 3.2) would have locally retarded\/blocked ice-\nmarginal drainage, leading to a further build-up of pore water contents\/pressures up-ice. In \ntheory this process could have led to the rapid down-ice expansion of the subglacial shear \nzone. As this ‘till-prism’ was overridden, meltwater would once again be able to drain from \nthe front of the glacier and the zone of water enhanced shear would have retreated back up-\nice. Seasonal or longer term fluctuations in pore water pressure and\/or content in the \n 20\nsubglacial environment, coupled with the periodic accretion of till-rich slabs into the push \nmoraine could have lead to several periods of ‘expansion’ and ‘contraction’ of the subglacial \nshear zone. The result was that the sediments within the deforming bed were imprinted with a \ncomplex sequence of cross-cutting, polyphase deformation structures during D3. \n \n7. Syntectonic proglacial deposition of the glacial outwash sands of the Runton Sand and \nGravel Member \nBanham (1975, 1988), Hart (1987) and Roberts and Hart (2000) have regarded the large dish-\nlike basins at West Runton to have formed through gravity loading of the underlying saturated \ntills (BGTM and HTM) by the braided outwash sediments (RSGM). They concluded that the \nsub-vertical aspect of the layering with the wedge-like till bodies separating these so-called \n‘sag basins’ occurred in response to diapiric loading during basin formation. One major \nproblem with this model is that it requires the complete removal of a thick sequence (up to c. \n20-25m) of till from beneath these basins, without disturbing the bedding within the central \npart of the basin (see Figs 2 and 10). No features supporting the ‘expansion’ of the sediment \npile adjacent to the basins by material displaced from beneath these depositional centres, or \nevidence of large-scale ‘mushroom-like’ folding (Banham, 1975, 1988), or small-scale \ndiapiric movement of till, have been recognised in the West Runton to Sheringham section. \n The simplest interpretation of the RSGM is that it represents a glacitectonically \ndisturbed proglacial outwash succession. This sand and gravel sequence cut down into, and \nremoved parts of, the older, glacial and pre-glacial sedimentary succession. The pattern of \nerosion may have been controlled either by: (a) a palaeotopographic surface left after the \nretreat of the ice which laid down the BGTM; or (b) the development of a peripheral fore-\nbulge in front of an advancing glacier in response to loading caused by the weight of ice \n(similar to features developed elsewhere in the geological record in front of large-scale thrust \nsheets). The RSGM outwash is thought to have been laid down in front of the westerly \nadvancing ice responsible for the bulk of the deformation at West Runton to Sheringham. As \nthe glacier encroached into, and progressively overrode this succession it resulted in the \nobserved proglacial to subglacial deformation continuum. The overall size and geometry of \nthe ‘till-prisms’ (see Fig. 11), formed in response to proglacial thrusting, suggests that they \nare likely to have formed positive topographic features within outwash sandur, controlling \nsediment distribution and the formation of rounded to elongate sub-basins between the \nmoraines (Figs. 11 and 13). The growth of these moraines during sedimentation would have \nled to deformation (e.g. normal faulting) of the sediments at the margins of the sub-basins, \n 21\nwhilst deposition continuing in the centre of the basin (Fig. 11). As the glacier encroached \nfurther to the east, the RSGM in the centre of the sub-basins would have progressively \ndeformed and been eventually overridden. \n \n8. Discussion \n8.1. Implications for the glacial history of north Norfolk \nThe deformation history erected for the glacigenic sequence at West Runton contributes to the \nbroader understanding of the glacial history of north Norfolk during the Middle Pleistocene. \nThe highest stratigraphic unit within this deformed succession is the Bacton Green Till \nMember of the Sheringham Cliffs Formation (Table 1). This demonstrates that this till and all \nlower units within the sequence, namely the Happisburgh Till, Walcott Till and Marl Bed \n(Table 1), had all been deposited prior to deformation. The deposition of the BGTM occurred \nin association with an ice advance from the north\/northwest (Banham, 1968, 1988; Lee et al., \n2004a). However, kinematic indicators from West Runton (this study) and other sites within \nthe region such as Bacton Green (Lee and Phillips, 2008), indicate that the till and underlying \nsediment pile was subsequently overridden and deformed during an ice advance from the \nwest\/southwest. Regionally, this later ice advance appears to be associated with the deposition \nof the chalk-rich Weybourne Town Till Member or ‘Marly Drift’ across much of north \nNorfolk (West and Donner, 1956; Perrin et al., 1979; Straw, 1983; Ehlers et al., 1991; Fish \nand Whiteman, 2001; Pawley et al., 2004; Pawley, 2006) (Fig. 14).  \nThe predominantly ductile style of deformation and mixing suggests that pore water \ncontent and\/or pressure, especially within the BGTM, was high at the onset\/during this later \ndeformation event. This implies firstly, that either a short time interval existed between the \ndeposition of the BGTM and its subsequent remobilisation, or secondly, that pore water \ncontent within the BGTM was recharged between deposition and deformation and that a long \ntime period existed between the two. Whilst the second option cannot be discounted as ice-\nmarginal areas of temperate ice sheets are often water-rich landsystems (Evans and Twigg, \n2002), the wider regional stratigraphy would appear to preclude the possibility of two Middle \nPleistocene ice advances from the west\/southwest during different glaciations. Critical \nevidence is the preservation of MIS 11 Hoxnian (Holsteinian) sites situated on Lowestoft \nFormation till at Barnham (Ashton et al., 1994), Elvedon (Ashton et al., 2000) and West Stow \n(Preece et al., 2007) in Central East Anglia that would have been highly tectonised or even \ndestroyed has they been overridden by a later ice advance. The simplest model is that the \nLowestoft Formation till (WTM and Lowestoft Till Member of southern and central East \n 22\nAnglia), BGTM and Weybourne Town Till Member were deposited during the same (MIS \n12) glacial episode but during different ice marginal oscillations (Fig. 14). \n \n8.2. Generalised model of progressive proglacial to subglacial deformation  \nThe proposed model of proglacial to subglacial deformation erected for the polydeformed \nsequence exposed between West Runton and Sheringham has implications for the study of \nsimilar sequences which have undergone glacitectonic disturbance. \nThe intensity and extent of proglacial deformation will be dependant upon not only the \nsize of the glacier\/ice sheet, but also the nature of the sequence within the foreland, to the \nfront of the advancing glacitectonic thrust-complex. At West Runton proglacial deformation \nappears to have occurred well in advance of the ice margin and was dominated by thrusting. \nThe length of exposed section which has undergone proglacial thrusting (Domain 1) suggests \nthat in some instances deformation may extend over 0.5 to 1 km in front of the advancing \nglacier. Initially deformation within the foreland will be focused around the ends of the \npropagating thrusts as they ramp upwards through the proglacial sequence (Fig. 15). These \nindividual thrusts curve downward linking into a prominent décollement surface, or basal \nthrust, located at a deeper level within the sediment pile. At West Runton this basal \ndécollement developed along a laterally extensive, major lithostratigraphic boundary which \nseparates the older pre-glacial succession and underlying chalk bedrock, from the younger \nglacial sediments. The presence of laterally extensive planes of weakness (e.g. a lithological \nboundary, the sediment-bedrock interface) within the proglacial succession will control the \ndepth of this décollement and the thickness of the deforming sequence. The overall \ncomplexity and intensity of proglacial deformation within the hanging wall of this \ndécollement increases towards the ice front. This is primarily due to a progressive increase in \nthe amount of shortening having to be accommodated by the sediment pile nearer to the ice \nmargin.  \nExperimental data suggests that the structural style and geometric characteristics of \nthe proglacial thrust-complex developing above the basal décollement is strongly controlled \nby the frictional properties of the sequence beneath this surface (Davis et al., 1984; \nNieuwland et al., 2000). The presence of low-frictional, water-rich sediments (e.g. Marl Bed) \nwithin the sediment pile may assist thrust propagation into the foreland (Fig. 15) (cf. van \nGijssel, 1987; Andersen et al., 2005). At West Runton, soft-sediment deformation of the MB \nindicates that it possessed a high pore water content at the time of deformation, leading to \nthrust-sheet gliding and detachment of much longer slabs of relatively undeformed sediment; \n 23\naiding in the preservation the proglacial sub-basins filled by the RSGM. The frictional \nproperties of the sediments beneath the basal décollement may be changed from, for example, \nhigh-frictional sand, to a low-frictional substrate by the simple addition of meltwater; the \nlatter resulting in the dilation and weakening of the sediment. This would have the effect of \nlubricating the basal thrust, focusing proglacial deformation into this water-rich zone and \npotentially switching off deformation within its hanging wall. A change in hydrogeological \nsystem at the ice margin from one which allowed ‘open’ or ‘free’ drainage of subglacial \nmeltwater, to a more ‘restricted’ system which retards the escape of meltwater from beneath \nthe glacier, may result in pressurised pore water being forced deeper into the sediment pile \nand further out into the foreland (Fig. 15). At West Runton, this change in the \nhydrogeological system may have occurred in response to the accretion of a large, \nimpermeable wedges-like bodies of till into the push-moraine (see Figs. 11 and 15). \nSubglacial meltwater would then have been forced around, or beneath this impermeable \nbarrier into the permeable sands and gravels of the WCF. This laterally extensive \nlithostratigraphic unit would have enabled meltwater to penetrate further out into the \nproglacial foreland, aiding deformation of the sediment pile. Seasonal fluctuations in \nsubglacial meltwater production may, therefore, lead to a variation in the rate of thrust \npropagation into the foreland and an increase in proglacial deformation during the \nspring\/summer. \nDeformation at the leading edge of the main thrust, or associated out-of-sequence \nthrusting, can lead to the development of positive topographic features or thrust-related \nmoraines some distance in front of the advancing ice front (Figs. 13 and 15). These features \nmay be composed of a combination of thrusted older glacial sediments and\/or detached slabs \nof bedrock. At West Runton these thrust-related moraines are thought to have controlled \nsediment dispersal and led to the formation of small sub-basins between the morainic ridges. \nThe accretion and incorporation of these proglacial morainic features into the main push \nmoraine forming at the margin of the advancing glacier may, depending on their size, \ntemporarily stalled forward motion of the ice. Thrusting and large-scale folding associated \nwith ice-marginal deformation would lead to the stacking of material excavated from further \nup-ice onto the stoss-side of these accreted proglacial thrust-related features (Fig. 15). This \ntype of deformation is a characteristic feature of many ancient and recent push moraines; for \nexample the Lamstedt Moraine (Germany) (van Gijssel, 1987), Dammer push moraine \n(Germany) (van der Wateren, 1987), the Cromer Ridge (eastern England) (Hart, 1990), \nHolmstrǿbreen push moraine complex (Spitsbergen) (Boulton et al., 1999), and the 1890 end \n 24\nmoraine at Brúarjökull (Iceland) (Benediktsson et al., 2008). The effect would be to lower the \ngradient of the ice-contact margin so that the glacier can override the obstruction. As they are \noverridden the positive topography of the thrust-related ridges would be lowered and their \nridge-like form dissected. Subsequent subglacial deformation may lead to the progressive \nmoulding of these relict proglacial features to form streamlined features composed of folded \nand thrusted glacial sediment and possibly bedrock (Fig. 15). At West Runton, these \noverridden relict proglacial features appear to have been a focus for later subglacial thrusting. \nSubglacial deformation can be highly variable in its style and intensity (e.g. Hart and \nBoulton, 1991b; Benn and Evans, 1996) ranging from heterogeneous folding and thrusting, \nthrough to more pervasive ductile shearing and the formation of a subglacial shear zone. \nThese events may be superimposed upon earlier, penecontemporaneous, proglacial phase of \ndeformation potentially leading to a complex polyphase deformation history during a single \nphase of ice advance (e.g. van der Wateren, 1986; van Gijssel, 1987; Phillips et al., 2002). \nDeformation structures developed during the proglacial deformation or even older \ndeformation events may be reactivated leading to the reworking of earlier glacitectonic \ndeposits. This may lead to the modification, overprinting or superposition of several phases of \nfolds, fabrics and clast macrofabrics within an older till (e.g. BGTM). It is possible, therefore, \nthat some of the tills in the geological record are ‘polycyclic’ and have undergone several \n(?unrelated) phases of deformation prior to dewatering and final consolidation. This \n‘recycling’ may aid in the homogenisation of the tills and the formation of the ‘tectomict’ of \nvan der Meer et al. (2003). \nThe intensity of subglacial deformation increases up-ice and can lead to the overprint \nof the original stratigraphical relationships between the units within the deforming bed. At \nseveral sites along the north Norfolk coast (e.g. West Runton, this study; Bacton Green, Lee \nand Phillips, 2008) this has accompanied the generation of a glacitectonic mélange and \nformation of a subglacial shear zone. Deformation within the shear zone is thought to \naccommodate most of the movement of the overriding glacier, with deformation being \npartitioned into an anastomosing network of relatively ‘high strain’ zones which progressively \nshift through the deforming bed (Piotrowski and Kraus, 1997; Hoffman and Piotrowski, 2001; \nvan der Meer et al., 2003; Piotrowski et al., 2004; Evans et al., 2006; Lee and Phillips, 2008). \nPartitioning of deformation is likely to have been controlled by the variation in pore water \ncontent, which, in extreme cases, may lead to the decoupling of the glacier from its bed. \nDuring dewatering the shear zone begins to ‘lock’ and earlier ductile deformation is \nsuperseded by a more brittle mechanism, such as thrusting. Evidence from West Runton \n 25\nindicates that the thickness and complexity of the subglacial shear zone increases in an up-ice \ndirection (see Figs. 10 and 15). The increased efficiency of drainage near the glacier margin \nleads to a rapid thinning, or even ‘collapse’, of the subglacial shear zone. The net result is a \nrapid deceleration in forward motion adjacent to the ice front, leading to the overall \ncompressive nature of deformation within the ice near to the glacier margin (Fig. 15). The \nwidth of this ‘deceleration zone’ is dependant upon the proximity of the onset of subglacial \nshear zone formation to the ice front, which is in turn linked to the efficiency of the subglacial \nto ice marginal drainage system. \nIn many studies it is assumed that the subglacial shear zone develops immediately \nbelow the overriding glacier (Hart, 1994; Roberts and Hart, 2005), consistent with the \ndeforming bed model (Boulton and Hindmarsh, 1987; Hart and Boulton, 1991b) and leading \nto an increase in intensity of deformation upwards through the sediment pile (Hart and \nBoulton, 1991b; van der Wateren et al., 2000). At West Runton, however, subglacial shear \nwas instigated along a major lithological boundary located at a deeper level within the bed, \nrather than at the ice-sediment interface (see Fig. 15). The lithological contrast between \nrelatively impermeable clay-rich till beneath (BGTM) and free-draining sand and gravel \n(RSGM) above, led to the concentration in the flow of meltwater along this boundary leading \nto the partitioning of water-enhance ductile shear along this contact. The presence of zones of \npreferential pore water flow within the bed of the glacier could represent a major contributing \nfactor in the sighting of the subglacial shear zone. Consequently, the bulk of the forward \nmotion of the glacier may not be accommodated by shearing within the sediments \nimmediately below its base, but occur at a deeper level within the deforming bed (c.f. Truffer \net al., 2000). \n \n9. Conclusions \nA number of conclusions can be made regarding the polyphase deformation history recorded \nby the pre-glacial and glacial sediments exposed in the coastal section between West Runton \nand Sheringham (eastern England): \n \n• The simplest interpretation of the main glacitectonic event (D3) to have effected these \nsediments is in terms of a progressive proglacial to subglacial deformation model. \nThis event was associated with the advance of a major Middle Pleistocene (Anglian) \nice sheet from the west\/southwest, marking a major change in ice flow direction across \nnorth Norfolk.  \n 26\n • Proglacial deformation occurred well in advance of the ice margin and was dominated \nby thrusting, leading to the formation of steep-sided moraines composed of detached \nblocks of highly deformed till. These thrust-related moraines are through to have \nformed positive topographic features within the outwash sandur which controlled \nsedimentation during the deposition of the Runton Sand and Gravel Member.  \n \n• The basal thrust or décollement beneath the proglacially deforming sequence was \nlocated along a major lithostratigraphic boundary separating the older pre-glacial \nsuccession (Wroxham Crag Formation) and underlying chalk bedrock, from the \nyounger glacial sediments. \n \n• Accretion of the proglacial thrust-related moraines to the main push moraine formed at \nthe margin of the advancing glacier may have temporarily stalled forward motion of \nthe ice. Thrusting and large-scale folding associated with ice-marginal deformation led \nto the stacking of material excavated from further up-ice onto the stoss-side of these \naccreted moraines enabling the glacier to override these temporary obstructions.  \n \n• Subsequent subglacial deformation was highly variable in its style and intensity \nranging from heterogeneous folding and thrusting, through to more pervasive ductile \nshearing and the formation of a subglacial shear zone. These events were \nsuperimposed upon earlier, penecontemporaneous, proglacial and ice marginal phases \nof deformation, and accompanied the remobilisation and reworking of earlier \nglacitectonic deposits. \n \n• The thickness and complexity of the subglacial shear zone increases in an up-ice \ndirection where it is characterised by a thick glacitectonic mélange. Fluctuations in \npore water content and\/or pressure are thought to have controlled the pattern of \ndeformation within the shear zone with an increase in the efficiency of drainage \ntowards the front of the glacier leading to a rapid thinning, or ‘collapse’, of the shear \nzone. This would have led to a potentially rapid deceleration in forward motion \nadjacent to the ice front and overall compressive flow regime within the ice near to the \nglacier margin.  \n 27\n • Evidence from the north Norfolk coast indicates that the subglacial shear zone \npreferentially developed along a major lithostratigraphic boundary within the \ndeforming sediment pile. This suggests that the bulk of glacier may not be \naccommodated by shearing within the sediments immediately below its base, but \noccur at a deeper level within the deforming bed. \n \n10. Acknowledgements \nThis work forms part of the Quaternary Palaeoenvironments and Landscapes Project of the \nBritish Geological Survey. Andrew Finlayson, Nick Golledge, Richard Hamblin, Brian \nMoorlock, Julian Murton, Steven Pawley, Jim Rose, Dave Roberts, Richard Waller and Colin \nWhiteman are thanked for many discussions. Martyn Stoker is thanked for his comments of \nan earlier draft of the manuscript. John Hiemstra and Geoff Thomas are both acknowledged \nfor their very constructive reviews of this paper. This paper is published with the permission \nof the Executive Director of the British Geological Survey (NERC).  \n \n11. References \nAber, J.S., Croot, D.G., Fenton, M.M. 1989. Glaciotectonic Landforms and Structures. \nKluwer, Dordrecht.  \n \nAllen, P., Keen, D.H. 2000. Uppermost Norwich Crag and Lower part of the Cromer Forest-\nbed Formations. In Lewis, S.G., Whiteman, C.A., Preece, R.C. (Eds). The Quaternary of \nNorfolk and Suffolk, Field Guide. Quaternary Research Association, London, 29-34. \n \nAlley, R.B., Blankenship, D.D., Bentley, C.R. and Rooney, S.T. 1987. Till beneath Ice Stream \nB, 4. A coupled ice–till flow model. Journal of Geophysical Research 92, 8921–8929. \n \nAndersen, L.T., Hansen, D.L., Huuse, M. 2005. Numerical modelling of thrust structures in \nunconsolidated sediments: implications for glaciotectonic deformation. Journal of Structural \nGeology 27, 587-596. \n \n 28\nAshton, N.M., Bowen, D.Q., Holman, J.A., Hunt, C.O., Irving, B.G., Kemp, R.A., Lewis, \nS.G., McNabb, J., Parfitt, S., Sedddon, M.B. 1994. Excavations at the Lower Palaeolithic site \nat East Farm, Barnham, Suffolk 1989-92. Journal of the Geological Society of London 151, \n599-605. \n \nAshton, N., Lewis, S.G., Parfitt, S.A. 2000. East Farm, Barnham, Suffolk (TL 875787). In \nLewis, S.G., Whiteman, C.A., Preece, R.C. (Eds). The Quaternary of Norfolk and Suffolk, \nField Guide. Quaternary Research Association, London, 165-166. \n \nBakker, M.A.J. 2004. The internal structure of Pleistocene push moraines: a multidisciplinary \napproach with emphasis on ground-penetrating radar. Unpublished PhD thesis, Queen Mary, \nUniversity of London. \n \nBanham, P.H. 1968. A preliminary note on the Pleistocene stratigraphy of north-east Norfolk. \nProceedings of the Geologists’ Association 79, 469-474. \n \nBanham, P.H. 1975. Glacitectonic structures: a general discussion with particular reference to \nthe contorted drift of Norfolk. In Wright, A.E., Moseley, F. (Eds). Ice Ages: Ancient and \nModern. Seel House Press, Liverpool, 69-94. \n \nBanham, P.H. 1988. Polyphase glacitectonic deformation in the Contorted Drift of Norfolk. In \nCroot (Ed). Glaciotectonics: Forms and Processes. Balkema, Rotterdam, 27- 32. \n \nBaroni, C., Fasano, F. 2006. Micromorphological evidence of warm-based glacier deposition \nfrom the Picker Hills Tillite (Victoria Land, Antarctica). Quaternary Science Reviews 25, \n976-992. \n \nBenediktsson, I.O., Möller, P., Ingólfsson, Ó., van der Meer, J.J.M., Kjær, K.H., Krüger, J. \n2008. Instantaneous end moraine and sediment wedge formation during the 1890 glacier \nsurge of Brúarjökull, Iceland Quaternary Science Reviews 27, 209-234. \n \nBenn, D.I. 1994. Fabric shape and the interpretation of sedimentary fabric data. Journal of \nSedimentary Research A64, 910-915. \n \n 29\nBenn, D.I., Evans, D.J.A. 1993. Glacimarine deltaic deposition and ice-marginal tectonics: the \n‘Loch Don Sand Moraine’, Isle of Mull, Scotland. Journal of Quaternary Science 8, 279-291. \n \nBenn, D.I., Evans, D.J.A. 1996. The interpretation and classification of subglacially deformed \nmaterials. Quaternary Science Reviews 15, 23-52.  \n \nBerthelsen, A. 1979. Recumbent folds and boudinage structures formed by subglacial shear: \nan example of gravity tectonics. Geologie en Mijnbouw 58, 253-260. \n \nBoulton, G.S. 1986. A paradigm shift in glaciology. Nature 322, 18. \n \nBoulton, G.S., Jones, A.S. 1979. Stability of temperate ice caps and ice sheets resting on \ndeformable sediment. Journal of Glaciology 24, 29-43. \n \nBoulton, G.S. and Hindmarsh, R.C.A. 1987. Sediment deformation beneath glaciers: rheology \nand geological consequences. Journal of Geophysical Research 92, 9059–9082. \n \nBoulton, G.S., Caban, P. 1995. Groundwater flow beneath ice sheets, Part II. Its impact on \nglacier tectonic structures and moraine formation. Quaternary Science Reviews 14, 563-587. \n \nBoulton, G.S. Dent, D.L., Morris, E.M. 1974. Subglacial shearing and crushing, and the role \nof water pressures in tills from south-east Iceland. Geografiska Annaler 56A, 135-145. \n \nBoulton, G.S., van der Meer., J.J.M., Hart, J., Beets, D., Ruegg, G.H.J., van der Wateren, \nF.M., Jarvis, J. 1996. Till and moraine emplacement in a deforming bed surge – an example \nfrom a marine environment. Quaternary Science Reviews 15, 961-987. \n \nBoulton, G.S., van der Meer., J.J.M., Hart, J., Beets, D., Hart, J.K., Ruegg, G.H.J.. 1999. The \nsedimentary and structural evolution of a recent push moraine complex: Holmstrǿbreen, \nSpitsbergen. Quaternary Science Reviews 18, 339-371. \n \nBoulton, G.S., Dobbie, K.E., Zatsepin, S. 2001. Sediment deformation beneath glaciers and \nits coupling to the subglacial hydraulic system. Quaternary International 86, 3-28. \n \n 30\nBowen, D.Q., Rose, J., McCabe, A.M., Sutherland, D.G. 1986. Quaternary glaciations in \nEngland, Ireland, Scotland, and Wales. Quaternary Science Reviews 5, 299-340. \n \nBowen, D.Q (Ed) 1999. A Revised Correlation of Quaternary Deposits in the British Isles. \nGeological Society of London Special Report No. 23. \n \nBriant, R.M., Rose, J., Branch, N.P., Lee, J.A. 1999. ‘Pre-glacial’ Quaternary sediments from \nTrimingham, north Norfolk, England. Bulletin of the Geological Society of Norfolk 49, 15-\n47. \n \nClark, P.U., Alley, R.B. and Pollard, D. 1999. Northern Hemisphere ice-sheet influences on \nglobal climate change. Science 286, 1104–1111. \n \nCroot, D.G. 1987. Glaciotectonics: Forma and Processes. Balkema, Rotterdam. \n \nDavis, D., Suppe, J., Dahlen, F.A. 1984. Mechanics of fold-and-thrust belts and accretionary \nwedges: Cohesive Coulomb theory. Journal of Geophysical Research 89, 10087-10101. \n \nEhlers, J., Gibbard, P.L. 1991. Anglian glacial deposits in Britain and the adjoining offshore \nregions. In Ehlers, J., Gibbard, P. L., Rose, J. (Eds). Glacial Deposits of Great Britain and \nIreland. Balkema, Rotterdam, 17-24. \n \nEhlers, J., Gibbard, P.H., Whiteman, C.A. 1991. The glacial deposits of northwest Norfolk. In \nEhlers, J., Gibbard, P. L., Rose, J. (Eds). Glacial Deposits of Great Britain and Ireland. \nBalkema, Rotterdam, 223-232. \n \nEvans, D.J.A., Twigg, D.R. 2002. The active temperate glacial landsystem: a model based on \nBreiðamerkurjökull and Fjallsjokull, Iceland. Quaternary Science Reviews 21, 2143-2177. \n \nEvans, D.J.A., Phillips, E.R., Hiemstra, J.F., Auton, C.A. 2006. Subglacial till: Formation, \nsedimentary characteristics and classification. Earth Science Reviews 78, 115-176. \n \n 31\nEvans, J., Dowdeswell, J.A., Ó Cofaigh, C., Benham, T.J., Anderson, J.B. 2006. Extent and \ndynamics of the West Antarctic Ice Sheet on the outer shelf of the Pine Island Bay during the \nlast glaciation. Marine Geology 230, 53-72. \n \nEyles, N., Eyles, C.H., McCabe, A.M. Sedimentation in an ice-contact subaqueous setting: the \nMid-Pleistocene ‘North Sea Drifts’ of Norfolk, UK. Quaternary Science Reviews 8, 57-74. \n \nFish, P.R., Whiteman, C.A. 2001. Chalk micropalaeontology and the provenancing of Middle \nPleistocene Lowestoft Formation till in eastern England. Earth Surface Processes and \nLandforms 26, 953-970. \n \nFischer, U.H., Clarke, G.K.C. 1997. Stick-slip sliding behaviour at the base of a glacier. \nAnnals of Glaciology 24, 390-396. \n \nFischer, U.H., Clarke, G.K.C., Blatter, H. 1999. Evidence for temporally varying sticky spots \nat the base of Trapridge Glacier, Yukon Territory, Canada. Journal of Glaciology 45, 352-\n360. \n \nHamblin, R.J.O, Moorlock, B.S.P., Rose, J. 2000. A New Glacial Stratigraphy for Eastern \nEngland. Quaternary Newsletter 92, 35-43. \n \nHamblin, R.J.O., Moorlock, B.S.P., Rose, J., Lee, J.R., Riding, J.B., Booth, S.J., Pawley, S.M. \n2005. Revised Pre-Devensian glacial stratigraphy in Norfolk, England, based on mapping and \ntill provenance. Geologie en Mijnbouw 84, 77-85. \n \nHart, J.K. 1987. The genesis of the north east Norfolk Drift. Unpublished PhD thesis, \nUniversity of East Anglia. \n \nHart, J.K. 1990. Proglacial glaciotectonic deformation and the origin of the Cromer Ridge \npush moraine complex, North Norfolk, England. Boreas 19, 165-180. \n \nHart, J.K. 1994. Till fabric associated with deformable beds. Earth Surface Processes and \nLandforms 19, 15-32. \n 32\n Hart, J.K., Boulton, G.S. 1991a. The glacial drifts of Norfolk. In: Ehlers, J., Gibbard, P. L., \nRose, J. (Eds). Glacial Deposits of Great Britain and Ireland. Balkema, Rotterdam, 233-243. \n \nHart, J.K., Boulton, G.S. 1991b. The interrelation of glaciotectonic and glaciodepositional \nprocesses within the glacial environment. Quaternary Science Reviews 10, 335-350. \n \nHart, J.K., Roberts, D.H. 1994. Criteria to distinguish between glaciotectonic and \nglaciomarine sedimentation: I – Deformation style and sedimentology. Sedimentary Geology \n91, 191-213. \n \nHart, J.K, Rose, J. 2001. Approaches to the study of glacier bed deformation. Quaternary \nInternational 86, 45-58. \n \nHart, J.K., Hindmarsh, R.C.A., Boulton, G.S. 1990. Different styles of subglacial deformation \nin the context of the Anglian ice sheet. Earth Surface Processes and Landforms 15, 227-241. \n \nHarris, C., Williams, G., Brabham, P., Eaton, G., McCarroll, D. 1997. Glaciotectonized \nquaternary sediments at Dinas Dinlle, Gwynedd, North Wales, and their bearing on the style \nof deglaciation in the Eastern Irish Sea. Quaternary Science Reviews 16, 109-127. \n \nHiemstra, J.F., Rijsdijk, K.F., Evans, D.J.A., van der Meer, J.J.M. 2005. Integrated micro- and \nmacro-scale analyses of Last Glacial Maximum Irish Sea diamicts from Abermaw and Treath \ny Mwnt, Wales, UK. Boreas 34, 61-74. \n \nHoffmann, K., Piotrowski, J.A. 2001. Till mélange at Amsdorf, central Germany: sediment \nerosion, transport and deposition in a complex, soft-bedded glacial system. Sedimentary \nGeology 140, 215–234. \n \nHoeoke, R. LeB., Hanson, B., Iverson, N.R., Jansson, P. and Fischer, U.H. 1997. Rheology of \ntill beneath Storglaciären, Sweden. Journal of Glaciology 43, 172-179. \n \n 33\nLee, J.R. 2001. Genesis and palaeogeographic significance of the Corton Diamicton (basal \nmember of the North Sea Drift Formation), East Anglia, UK. Proceedings of the Geologist’s \nAssociation 112, 43-67. \n \nLee, J.R. 2003. Early and Middle Pleistocene lithostratigraphy and palaeoenvironments in \nnorthern East Anglia, UK. Unpublished PhD Thesis, Royal Holloway University of London. \n \nLee, J.R., Rose, J., Riding, J.B., Hamblin, R.J.O., Moorlock, B.S.P. 2002. Testing the case for \na Middle Pleistocene Scandinavian glaciation in Eastern England: evidence for a Scottish ice \nsource for tills within the Corton Formation of East Anglia, UK. Boreas 31, 345-355. \n \nLee, J.R., Booth, S.J., Hamblin, R.J.O., Jarrow, A.M., Kessler, H., Moorlock, B.S.P., Morigi, \nA.N., Palmer, A., Pawley, S.J., Riding, J.B., Rose, J. 2004a. A new stratigraphy for the glacial \ndeposits around Lowestoft, Great Yarmouth, North Walsham and Cromer, East Anglia, UK. \nBulletin of the Geological Society of Norfolk 53, 3-60. \n \nLee, J.R., Rose, J., Hamblin, R.J.O., Moorlock, B.S.P. 2004b. Dating the earliest lowland \nglaciation of eastern England: a pre-MIS 12 early Middle Pleistocene Happisburgh \nGlaciation. Quaternary Science Review 23, 1551-1566. \n \nLee, J.R., Rose, J., Candy, I., Barendregt, R.W. 2006. Sea-level changes, river activity, soil \ndevelopment and glaciation around the western margins of the southern North Sea Basin \nduring the Early and early Middle Pleistocene: evidence from Pakefield, Suffolk, UK. Journal \nof Quaternary Science 21, 155-179. \n \nLee, J.R., Phillips, E.R. 2008. Progressive soft sediment deformation within a subglacial shear \nzone – a hybrid mosaic-pervasive deformation model for Middle Pleistocene glaciotectonised \nsediments from Eastern England. Quaternary Science Reviews 27, 1350-1362. \n \nLicciardi, J.M., Clark, P.U., Jenson, J.W., MacAyeal, D.R. 1998. Deglaciation of a soft-\nbedded Laurentide Ice Sheet. Quaternary Science Reviews 17, 427-448. \n \n 34\nLunkka, 1988. Sedimentation and deformation of the North Sea Drift Formation in the \nHappisburgh area, north Norfolk. In Croot, D. (Ed). Glaciotectonics: Forms and Processes. \nBalkema, Rotterdam, 109-122.  \n \nLunkka, J.P. 1994. Sedimentation and lithostratigraphy of the North Sea Drift and Lowestoft \nTill Formations in the coastal cliffs of northeast Norfolk, England. Journal of Quaternary \nScience 9, 209-233. \n \nMcCarroll, D., Rijsdijk, K.F. 2003. Deformation styles as a key for interpreting glacial \ndepositional environments. Journal of Quaternary Science 18, 473-489. \n \nMenzies, J., van der Meer, J.J.M., Rose, J. 2006. Tills – as a glacial “tectomict”, its internal \narchitecture and the development of a “typing” method for till differentiation. \nGeomorphology 75, 172-200. \n \nMitchell, G.F., Penny, L.F., Shotton., F.W., West, R.G. 1973. A Correlation of Quaternary \nDeposits in the British Isles. Geological Society of London Special Report No.4, 99pp. \n \nNieuwland, D.A., Leutscher, J.H., Gast, J. 2000. Wedge equilibrium in fold-and-thrust belts: \nprediction of out-of-sequence thrusting based on sandbox experiments and natural examples. \nGeologie en Mijnbouw\/Netherlands Journal of Geosciences 79, 81-91. \n \nPasschier, C.W., Trouw, R.A.J. 1996. Microtectonics. Springer-Verlag, Berlin, Heidelberg, \nNew York. pp 289. \n \nPawley, S.M. 2006. Quaternary Glaciations of north and west Norfolk. Unpublished PhD \nThesis, University of London. \n \nPawley, S.M., Rose, J., Lee, J.R., Moorlock, B.S.P., Hamblin, R.J.O. 2004. Early and Middle \nPleistocene sedimentology and lithostratigraphy of Weybourne, northeast Norfolk, England.  \nProceedings of the Geologists’ Association 115, 25-42. \n \n 35\nPawley, S.M., Bailey, R.J., Rose, J., Moorlock, B.S.P., Hamblin, R.J.O., Booth, S.J., Lee, J.R. \n2008. Age limits on Middle Pleistocene glacial sediments from OSL dating, North Norfolk, \nUK. Quaternary Science Reviews, in press. \n \nPedersen, S.A.S. 1993. The glaciodynamic event and glaciodynamic sequence. In Aber, J.S. \n(Ed.) Glaciotectonics and Mapping Glacial Deposits. Canadian Plains Research Centre, \nUniversity of Regina, Canada, 67-85. \n \nPerrin, R.M.S., Rose, J., Davies, H. 1979. The distribution, variation and origins of pre-\nDevensian tills in eastern England. Philosophical Transactions of the Royal Society of \nLondon B287, 535-570. \n \nPhillips, E.R., Merritt, J. 2008. Evidence for multiphase water-escape during rafting of shelly \nmarine sediments at Clava, Inverness-shire, NE Scotland. Quaternary Science Reviews 27, \n988-1011. \n \nPhillips, E.R., Evans, D.J.A., Auton, C.A. 2002. Polyphase deformation at an oscillating ice \nmargin following the Loch Lomond Readvance, central Scotland, UK. Sedimentary Geology \n149, 157-182. \n \nPhillips, E.R., Merritt, J., Auton, C., Golledge, N. 2007. Microstructures in subglacial and \nproglacial sediments: understanding faults, folds and fabrics, and the influence of water on the \nstyle of deformation. Quaternary Science Reviews 26, 1499-1528. \n \nPreece, R.C., Parfitt, S.A. 2000. The Cromer Forest-bed Formation: new thoughts on an old \nproblem. In Lewis, S.G., Whiteman, C.A., Preece, R.C. (Eds). The Quaternary of Norfolk and \nSuffolk, Field Guide. Quaternary Research Association, London, 1-27. \n \nPreece, R.C., Parfitt, S.A., Bridgland, D.R., Lewis, S.G., Rowe, P.J., Atkinson, T.C., Candy, \nI., Debenham, N.C., Penkman, K.E.H., Rhodes, E.J., Schwenniger, J-L., Whittaker, J.E., \nGleed-Owen, C. 2007. Terrestrial environments during MIS 11: evidence from the \nPalaeolithic site at West Stow, Suffolk, UK. Quaternary Science Reviews 26, 1236-1300. \n \n 36\nPreece, R.C., Parfitt, S.A. 2008. The Cromer Forest-bed Formation: some recent \ndevelopments relating to early human occupation and lowland glaciation. In Candy, I., Lee, \nJ.R., Harrison, A.M. (Eds). The Quaternary of northern East Anglia, Field Guide. Quaternary \nResearch Association, London, in press. \n \nPiotrowski, J.A., Kraus, A. 1997. Response of sediment to ice sheet loading in northwestern \nGermany: effective stresses and glacier bed stability. Journal of Glaciology 43, 495–502. \n \nPiotrowski, J.A., Mickelson, D.M., Tulaczyk, S., Krzyszkowski, D., Junge, F.W., 2001. Were \ndeforming subglacial beds beneath past ice sheet really widespread? Quaternary Science \nReviews 86, 139-150. \n \nPiotrowski, J.A., Larsen, N.K., Junge, F.W. 2004. Reflections on soft subglacial beds as a \nmosaic of deforming and stable spots. Quaternary Science Reviews 23, 993-1000. \n \nRoberts, D.H., Hart, J.K. 2000. The Glacial Deposits of West Runton. In Lewis, S.H., \nWhiteman, C.A. and Preece, R.C. (Eds.). The Quaternary of Norfolk and Suffolk, Field \nGuide. Quaternary Research Association, London, 77-84. \n \nRoberts, D.H., Hart, J.K. 2005. The deforming bed characteristics of a stratified till \nassemblage in north East Anglia, UK: investigating controls on sediment rheology and strain \nsignatures. Quaternary Science Reviews 24, 123-140. \n \nRose, J., Moorlock, B.S.P., Hamblin, R.J.O. 2001. Pre-Anglian fluvial and coastal deposits in \nEastern England: lithostratigraphy and palaeoenvironments. Quaternary International 79, 5-\n22. \n \nRijsdijk, K.F., Owen, G., Warren, W.P., McCarroll, D., van der Meer, J.J.M. 1999. Clastic \ndykes in over-consolidated tills: Evidence for subglacial hydrofracturing at Killiney Bay, \neastern Ireland. Sedimentary Geology 129, 111-126. \n \nStraw, A. 1983. Pre-Devensian glaciation of Lincolnshire (Eastern England) and adjacent \nareas. Quaternary Science Reviews 2, 239-260. \n \n 37\nTruffer, M., Harrison, W.D., Echelmeyer, K.A. 2000. Glacier motion dominated by processes \ndeep in underlying till. Journal of Glaciology 46, 213-221. \n \nvan Gijssel, K. 1986. A lithostratigraphic and glacitectonic reconstruction of the Lamstedt \nMoriane, Lower Saxony (FRG). In van der Meer, J.J.M (Ed). Tills and Glaciotectonics. \nBalkema, Rotterdam. \n \nvan der Meer, J.J.M., Kjaer, K., Krüger, J. 1999. Subglacial water escape structures and till \nstructure, Sléttjökull, Iceland. Journal of Quaternary Science 14, 191-415. \n \nvan der Meer, J.J.M., Menzies, J., Rose, J. 2003. Subglacial till: the deforming glacier bed. \nQuaternary Science Reviews 22, 1659-1685.  \n \nvan de Wateren, F.M. 1986. Structural geology and sedimentology of the Dammer Berge \npush moraine, FRG. In van der Meer, J.J.M. (Ed). Tills and Glaciotectonics. Balkema, \nRotterdam. 157-182 \n \nvan der Wateren, F.M. 1995. Process of glaciotectonism. In Menzies, J. (Ed). Glacial \nEnvironments. Modern Glacial Environments: Processes, Dynamics and Sediments vol. 1. \nButterworth-Heinemann, Oxford, 309-335. \n \nvan der Wateren, F.M., Kluiving, S.J., Bartek, L.R. 2000. Kinematic indicators of subglacial \nshearing. In Maltman, A.J., Hubbard, B., Hambrey, J.M. (Eds). Deformation of Glacial \nMaterials. Geological Society, London, Special Publications 176, 259-291. \n \nWest, R.G. 1980. The pre-glacial Pleistocene of the Norfolk and Suffolk coasts. Cambridge \nUniversity Press, Cambridge. \n \nWest, R.G., Donner, J.J. 1956. The glaciations of East Anglia and the East Midlands: a \ndifferentiation based on stone orientation measurements of the tills. Quarterly Journal of the \nGeological Society of London, 112, 146-184. \n \nFigures \n 38\nFig. 1. Map showing the location of the West Runton to Sheringham section and Domains 1, \n2 and 3 which are referred to within the text (a), and northern East Anglia (b). \n  \nFig. 2. Detailed structural interpretation (Domain 1) of the eastern end of the West Runton to \nSheringham section (see Fig. 1). The individual sections (a) to (e) cover the whole of Domain \n1 with varying degrees of overlap between the sections. Approximate height of cliff face = 20 \nto 25 m.  \n \nFig. 3. (a) Steep-sided, wedge-like feature (‘till-prism’, see text) composed of thrust-bound \nslices of BGTM and Marl. The planar thrust at the bottom of this thrust-related feature forms \na prominent décollement surface separating the deformed sediments from the underlying \nWCF; (b) Convolute folding effecting  the base of the RSGM and underlying Marl; (c) Large, \nsteep-sided, wedge-like feature composed of thrust-bound slices of BGTM, HTM, WCF and \nMarl; (d) Well-bedded and cross-bedded sands and gravels of the RSGM stacked with thrust \nbound slices of Marl and BGTM; (e) Large-scale synform deforming thrust-stacked sequence \nof RSGM, BGTM and Marl; (f) Ductile shearing associated with thrusted base of a large, \ndetached slab of Marl. \n \nFig. 4. Detailed structural interpretation (Domain 2) of part of the West Runton to \nSheringham section (see Fig. 1). Approximate height of cliff face = c. 30 m. \n \nFig. 5. Detailed structural interpretation (Domain 3) of the remainder of the West Runton to \nSheringham section (see Fig. 1). The individual sections (a) to (h) cover the whole of Domain \n3 with varying degrees of overlap between the sections. Approximate height of cliff face = 25 \nto 35 m. \n \nFig. 6. (a) Easterly verging antiform deforming a thrust-bound raft of well-bedded WCF; (b) \nRecumbent to very gently inclined, isoclinal fold deforming the S1 foliation present within \nthe upper part of the HTM; (c) Highly attenuated intrafolial folds within the HTM; (d) Eye-\nshaped fold interference patterns developed within the HTM showing that it has undergone \nseveral phases of folding; (e) Layering\/foliation within the HTM defined by chalk-rich layers. \nThis foliation locally wraps around rounded to angular chalk clasts; (f) Low-angle extensional \nfaults and extensional crenulation cleavage (ECC) deforming the layering\/S1 foliation within \nthe HTM. \n 39\n Fig. 7. (a) Irregular, highly deformed ‘raft’ of Walcott Till Member wrapped by the foliation \nwithin the HTM. Elongate, tail-like off shoots from the chalky Walcott Till extend into the \nfoliation within the host HTM; (b) Recumbent to very gently inclined, isoclinal fold \ndeforming the layering\/S1 foliation present within the upper part of the BGTM; (c) \nCrenulation lineation (L2) developed in the hinge of a recumbent fold deforming the S1 \nfoliation within the BGTM; (d) Recumbent folds cut by later thrusts within the BGTM \nshowing that ductile folding was followed by at least one phase of E-directed brittle faulting; \n(e) Well-developed stretching lineation (L1) developed upon S1 foliation surfaces within the \nBGTM; (f) Asymmetrical, sheared lenses or augen of sand within the glacitectonic mélange \nfacies of the BGTM. \n \nFig. 8. Lower hemisphere stereographic plots of structural data measured from the West \nRunton to Sheringham section. (a) Dip and dip azimuth of the S1 foliation within the HTM \nand BGTM; (b) Orientation of  folds. Small symbols recumbent folds (F1\/2), large symbols \nupright to steeply inclined folds (F2\/3); (c) Orientation of the stretching lineation (L1) and \ncrenulation lineation (L2). \n \nFig. 9. (a) Large subvertical water-escape conduit deforming the mélange facies of the \nBGTM; (b) Convolute-style synform deforming the foliation and early recumbent folds \npresent within the BGTM and HTM. The core of the fold is composed of a deformed lens of \nsand and gravel possibly derived from the RSGM; (c) Folded, rotated lens\/augen of pale \ncoloured sand within the HTM. This sand lens may represent a detached (rootless) fold hinge; \n(d) Rootless fold deforming a steeply inclined lens or slab of well-bedded sand. This sand \nlens is lithologically similar to the RSGM and is entirely isolated within the HTM; (e) raft of \nWCF and chalk bedrock structurally overlying HTM. The contact between the basal sands \nand gravels of the WCG and underlying chalk is undeformed and represents an original \nerosive contact (see text for details). (f) Recumbent (F1\/2) folding of a lenticular chalk raft \nenclosed within the HTM. \n \nFig. 10. A composite structural section through the complete West Runton to Sheringham \nsection showing the variation in the style and intensity of deformation from east to west (see \ntext for details). \n \n 40\nFig. 11. Diagram showing the proposed proglacial to ice-marginal deformation model to \nexplain the range of features observed at the eastern end of the West Runton to Sheringham \nsection (Domains 1 and 2). (a) Cross-section. (b) Plan view showing how the possible \ndevelopment of small, sub-basins between the topographic ridges formed by the developing \ntill-prisms. \n \nFig. 12. Diagram showing shear zone development and mélange generation within the \nsubglacially deformed part (Domain 3) of the West Runton to Sheringham and the effects of \n‘open’ and ‘restricted’ drainage at the front of the glacier on the down-ice extent of the shear \nzone. \n \nFig. 13. 3D block diagram showing the location of the sub-basins between the morainic ridges \nformed above the till-prisms developed in response to proglacial deformation. \n \nFig. 14. Schematic diagram showing the development of the West Runton glacial sequence \nand its wider regional context in eastern England and the southern North Sea: a) Ice advance \nof British ice from the west and northwest depositing the Kimmeridge-rich Lowestoft Till \n(black lines), and British North Sea advance from the north depositing the Walcott Till; b) \nWastage of the British North Sea ice, creation of an ice marginal area over northeast Norfolk \n(stippled area) and deposition of the Bacton Green Till as a thick sequence of subaqueous \ndebris flow; c) Retreat of British North Sea ice to the north, British ice advance west and \nnorth-westwards across north Norfolk depositing the Weybourne Town Till. \n \nFig. 15. Diagram showing the proposed generalised model of progressive proglacial to \nsubglacial deformation based upon the features observed at West Runton to Sheringham. \n \nTables \nTable 1. Lower and lower Mid-Pleistocene stratigraphy of northern East Anglia with \nparticular reference to units that crop-out within the West Runton – Sheringham area of study \nshown in bold (modified from Lee et al., 2004a; Pawley et al., 2004). \n \nLithostratigraphy \n(Subgroup \/ Formation \/ Member) \nSediment Environment & Process Chronostratigraphy \nBriton’s Lane Formation \nBriton’s Lane Sand & Gravel Member \nRunton Sand & Gravel Member \n \nSands and gravels \nSands and gravels \n \nProglacial outwash \nProglacial outwash \n \n 41\n 42\n(RSGM) \n    \nSheringham Cliffs Formation    \nWeybourne Town Till Member \nBacton Green Till Member (BGTM) \nIvy Farm Laminated Member \nMarl Bed (MB) \nVery chalky diamicton \nSandy diamicton \nStratified silts and clays \nStratified marl \nGlaciation – till \nGlaciation – till \nGlaciolacustrine \nGlaciolacustrine \n \n   Mid-Pleistocene \nLowestoft Formation    \nLowestoft Till Member Chalky, clayey diamicton Glaciation – till  \nWalcott Till Member (WTM) Silty, clayey diamicton Glaciation – till  \n    \nHappisburgh Formation    \nHappisburgh Till Member (HTM) Sandy, grey diamicton Glaciation – till  \n    \nWroxham Crag Formation (WCF)    \nMundesley Member (MM) Sands and gravels Shallow marine lower Mid-Pleistocene \n    \nCromer Forest-bed Formation    \nWest Runton Freshwater Bed Organic muds Floodplain  \n    \nWroxham Crag Formation    \nMundesley Member Gravels, sands & muds Tidal, shallow marine Lower Pleistocene \n    \nWhite Chalk Subgroup White, flinty chalk Deep marine Upper Cretaceous \n \n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}