{"doi":"10.1080\/713755996","coreId":"70802","oai":"oai:eprints.lancs.ac.uk:10441","identifiers":["oai:eprints.lancs.ac.uk:10441","10.1080\/713755996"],"title":"When insight just won’t come: The failure of visual cues in the nine-dot problem.","authors":["Chronicle, E. P.","Ormerod, Thomas C.","MacGregor, J. N."],"enrichments":{"references":[{"id":16394840,"title":"An examination of the alleged role of “fixation” in the solution of several “insight” problems.","authors":[],"date":"1981","doi":null,"raw":"Weisberg, R. W. & Alba, J. W. (1981)  An examination of the alleged role of “fixation” in the solution of several “insight” problems.  Journal of Experimental Psychology: General,110: 169-192. When insight just won't come Page 28","cites":null},{"id":16394808,"title":"An Introduction to Cognitive Psychology: Processes and Disorders.","authors":[],"date":"1999","doi":"10.4324\/9781315871554","raw":"Groome, D. (1999).  An Introduction to Cognitive Psychology: Processes and Disorders. London: Psychology Press.","cites":null},{"id":16394803,"title":"Analogical problem-solving.","authors":[],"date":"1980","doi":"10.1016\/0010-0285(80)90013-4","raw":"Gick, M. L. & Holyoak, K. J. (1980).  Analogical problem-solving.  Cognitive Psychology, 12, 306-355.","cites":null},{"id":16394811,"title":"Effects of strategy instructions and practice on nine-dot problem solving.","authors":[],"date":"1985","doi":"10.1037\/\/0278-7393.11.1-4.804","raw":"Lung, C. T. & Dominowski, R. L. (1985)  Effects of strategy instructions and practice on nine-dot problem solving.  Journal of Experimental Psychology: Learning, Memory and Cognition, 111: 804-811.","cites":null},{"id":16394825,"title":"Gilhooly (Eds.) Advances in the Psychology of Thinking,","authors":[],"date":"1997","doi":null,"raw":"In: M. T. Keane & K. J. Gilhooly (Eds.)  Advances in the Psychology of Thinking, Vol. 1.  New York, Harvester Wheatsheaf. When insight just won't come Page 27 Ormerod, T. C., Chronicle, E. P. & MacGregor, J. N. (1997)  Facilitation in variants of the nine-dot problem: perceptual or cognitive mediation?  Poster presented at the 18 th Annual Conference of the Cognitive Science Society, Stanford CA, August 7-10.","cites":null},{"id":16394821,"title":"Human problem solving. Englewood Cliffs, N.J.:","authors":[],"date":"1972","doi":"10.1080\/00140137308928443","raw":"Newell,  A., & Simon, H.A. (1972).  Human problem solving.  Englewood Cliffs, N.J.: Prentice-Hall Ohlsson, S. (1990)  Information-processing explanations of insight and related phenomena.","cites":null},{"id":16394814,"title":"Information-processing and insight: A process model of performance on the nine-dot and related problems.","authors":[],"date":"2000","doi":"10.1037\/\/0278-7393.27.1.176","raw":"MacGregor, J, N., Ormerod, T. C. & Chronicle, E. P. (2000).  Information-processing and insight: A process model of performance on the nine-dot  and related problems. . Journal of Experimental Psychology: Learning, Memory and Cognition, in press.","cites":null},{"id":16394832,"title":"Invariants of human behaviour.","authors":[],"date":"1990","doi":"10.1146\/annurev.psych.41.1.1","raw":"Simon, H.A. (1990)  Invariants of human behaviour.  Annual Review of Psychology, 41, 1-19.","cites":null},{"id":16394829,"title":"Problem solving.","authors":[],"date":"1963","doi":"10.1038\/scientificamerican0463-118","raw":"Scheerer, M.  (1963).  Problem solving.  Scientific American, 208: 118-128.","cites":null},{"id":16394836,"title":"Psychology (2 nd edition).","authors":[],"date":"1990","doi":null,"raw":"Wade, C. & Tavris, C. (1990)  Psychology (2 nd edition).  New York, Harper and Row.","cites":null},{"id":16394805,"title":"Reasoning the fast and frugal way: Models of bounded rationality.","authors":[],"date":"1996","doi":"10.1093\/acprof:oso\/9780199744282.003.0002","raw":"Gigerenzer, G. & Goldstein, D.G. (1996)  Reasoning the fast and frugal way: Models of bounded rationality.  Psychological Review, 103, 650-669.","cites":null},{"id":16394801,"title":"Ten years of the rational analysis of cognition.","authors":[],"date":"1999","doi":"10.1016\/s1364-6613(98)01273-x","raw":"Chater, N., & Oaksford, M.  (1999)  Ten years of the rational analysis of cognition.  Trends in Cognitive Sciences, 3, 57-65.","cites":null},{"id":16394800,"title":"The nine-dot problem: beyond perceptual organisation.","authors":[],"date":"1969","doi":"10.3758\/bf03335259","raw":"Burnham, C. A. & Davis, K. G. (1969)  The nine-dot problem: beyond perceptual organisation.  Psychonomic Science, 17, 321-323.","cites":null},{"id":16394817,"title":"Vision.","authors":[],"date":"1982","doi":"10.1038\/298691a0","raw":"Marr, D. (1982)  Vision.  San Francisco, Freeman.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2001","abstract":"The nine-dot problem is a classic in the field of human problem solving. Cognitive accounts of the problem's difficulty have been criticized on the grounds that the experimental methods on which they rely for support involve a qualitative change to the task requirements of the problem. The three experiments reported here utilize visual and visual-procedural hints to examine the notion that its difficulty is rooted in a mismatch between problem shape and solution shape. Experiment 1 demonstrated that a perceptual cue to the shape of the solution in the form of shading gave rise to only minimal improvements in performance; an additional hint about the relevance of the shading gave rise to modest, but not statistically significant, improvements. Experiment 2 replicated these findings against an additional control condition in which a solely verbal hint to violate the perceptual boundary of the problem shape was given. Furthermore, when both the verbal and visual hints were provided, performance improved only slightly. Experiment 3 provided participants with experience in producing the shape of the correct solution in problem variants closely related to the nine-dot problem. Performance on the transfer task, the basic nine-dot problem, remained at floor, however. These data suggest that visual constraint relaxation is unlikely to be the sole process by which the insight required to find a solution is achieved. The results are interpreted in terms of a previously proposed computational model of performance","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70802.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/10441\/2\/Microsoft_Word_%2D_QJEP_insight_accepted.pdf","pdfHashValue":"5685405508584f4d2a19473f0ef1440e173daa81","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:10441<\/identifier><datestamp>\n      2018-01-24T00:01:43Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D42:4246<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        When insight just won’t come: The failure of visual cues in the nine-dot problem.<\/dc:title><dc:creator>\n        Chronicle, E. P.<\/dc:creator><dc:creator>\n        Ormerod, Thomas C.<\/dc:creator><dc:creator>\n        MacGregor, J. N.<\/dc:creator><dc:subject>\n        BF Psychology<\/dc:subject><dc:description>\n        The nine-dot problem is a classic in the field of human problem solving. Cognitive accounts of the problem's difficulty have been criticized on the grounds that the experimental methods on which they rely for support involve a qualitative change to the task requirements of the problem. The three experiments reported here utilize visual and visual-procedural hints to examine the notion that its difficulty is rooted in a mismatch between problem shape and solution shape. Experiment 1 demonstrated that a perceptual cue to the shape of the solution in the form of shading gave rise to only minimal improvements in performance; an additional hint about the relevance of the shading gave rise to modest, but not statistically significant, improvements. Experiment 2 replicated these findings against an additional control condition in which a solely verbal hint to violate the perceptual boundary of the problem shape was given. Furthermore, when both the verbal and visual hints were provided, performance improved only slightly. Experiment 3 provided participants with experience in producing the shape of the correct solution in problem variants closely related to the nine-dot problem. Performance on the transfer task, the basic nine-dot problem, remained at floor, however. These data suggest that visual constraint relaxation is unlikely to be the sole process by which the insight required to find a solution is achieved. The results are interpreted in terms of a previously proposed computational model of performance.<\/dc:description><dc:date>\n        2001<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1080\/713755996<\/dc:relation><dc:identifier>\n        Chronicle, E. P. and Ormerod, Thomas C. and MacGregor, J. N. (2001) When insight just won’t come: The failure of visual cues in the nine-dot problem. Quarterly Journal of Experimental Psychology Series a Human Experimental Psychology, 54 A (3). pp. 903-919. ISSN 0272-4987<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/10441\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1080\/713755996","http:\/\/eprints.lancs.ac.uk\/10441\/"],"year":2001,"topics":["BF Psychology"],"subject":["Journal Article","PeerReviewed"],"fullText":"  \n \nWhen insight just won’t come: The failure of visual cues in the nine-dot problem. \nEdward P. Chronicle \nThomas C. Ormerod \nDepartment of Psychology, Lancaster University, Lancaster, UK \nJames N. MacGregor \nSchool of Public Administration, University of Victoria, Victoria, Canada. \n \nPre-publication copy of Chronicle, E. P., Ormerod, T. C., & MacGregor, J. N. \n(2001). When insight just won't come: The failure of visual cues in the \nnine-dot problem. Quarterly Journal of Experimental Psychology, 54A, \n903-919. \n \nAddress for correspondence: \nDr Edward Chronicle \nDepartment of Psychology \nLancaster University \nLancaster LA1 4YF \nUK \nWhen insight just won't come \nPage 2 \nAcknowledgements \nPreliminary reports of the experiments described in this paper were given at a meeting of the \nExperimental Psychology Society, Oxford, 18-19 March 1999 and Mind III: Spatial \nCognition, Dublin, 17-19 August 1998. \nWhen insight just won't come \nPage 3 \nAbstract \nThe nine-dot problem is a classic in the field of human problem solving.  Cognitive accounts \nof the problem’s difficulty have been criticised on the grounds that the experimental methods \non which they rely for support involve a qualitative change to the task requirements of the \nproblem.  The three experiments reported here utilise visual and visual-procedural hints to \nexamine the notion that its difficulty is rooted in a mismatch between problem shape and \nsolution shape.  Experiment 1 demonstrated that a perceptual cue to the shape of the solution \nin the form of shading gave rise to only minimal improvements in performance; an additional \nhint about the relevance of the shading gave rise to modest, but not statistically significant, \nimprovements.  Experiment 2 replicated these findings against an additional control condition \nin which a solely verbal hint to violate the perceptual boundary of the problem shape was \ngiven.  Furthermore, when both the verbal and visual hints were provided, performance \nimproved only slightly.  Experiment 3 provided participants with experience in producing the \nshape of the correct solution in problem variants closely related to the nine-dot problem.  \nPerformance on the transfer task, the basic nine-dot problem, remained at floor, however.  \nThese data suggest that visual constraint relaxation is unlikely to be the sole process by which \nthe insight required to find a solution is achieved. The results are interpreted in terms of a  \npreviously-proposed computational model of performance. \nWhen insight just won't come \nPage 4 \nThe nine-dot problem is a classic problem in the psychology of thinking, and provides a \npowerful demonstration of human failure to solve what appears to be a straightforward spatial \nproblem with a simple task description.  The problem is illustrated in Figure 1a.  The task is \nto connect all nine dots with four straight lines, drawn without lifting pencil from paper or \nretracing a line.  The great majority of published accounts of performance on the problem \nreport that 0% of participants are able to solve it, despite experimental manipulations that \neither utilise a large number of participants (Weisberg and Alba, 1981, Experiment 1b: \napproximately 50 participants), allow a good deal of time for a solution to be attempted \n(Burnham and Davis, 1969: 10 minutes per attempt), or give participants many separate \nattempts (Weisberg and Alba, 1981, Experiment 1a: 100 attempts).  The highest solution rate \nreported for naïve participants was 9.4% (Lung and Dominowski, 1985).  A popular \nexplanation for the problem’s difficulty is that perception of the dot array is governed by the \nGestalt law of Pragnanz, causing the mental representation of the dots as a square (Scheerer, \n1963).  Participants are unable to solve the problem because they fixate upon the square, and \nconsequently fail to consider solution options that do not fall within the boundary of this \nfigure.  This account persists in textbooks of Psychology (e.g., Wade and Tavris, 1990; \nGroome, 1999) despite the existence of alternative accounts that propose cognitive rather than \nperceptual factors as the source of the problem’s difficulty (e.g. Weisberg and Alba, 1981; \nLung and Dominowski, 1985).  \nTypically, cognitive accounts seek support from some form of instructional or training \nmanipulation which facilitates, or conversely fails to facilitate, problem-solving performance \nin a way that cannot, it is argued, be accounted for within a Gestalt tradition.  For example, \nBurnham and Davis (1969) report a number of instructional manipulations that led to only \nsmall amounts of facilitation.  The most important manipulation was to instruct participants \nthat they could go outside the square formed by the dots, which was intended to override the \nset formed by perceptual grouping of the dots.  Participants receiving this instruction did seek \nsolutions by drawing lines outside the dot array perimeter, unlike those receiving no \ninstruction, but only 4 out of 15 participants successfully solved the problem. Burnham and \nDavis suggest that the failure of this manipulation to remove all aspects of the problem’s \nWhen insight just won't come \nPage 5 \ndifficulty argues against an account in which problem difficulty is caused by the imposition of \na rigid perceptual organisation on the dot array.  Similar results are reported by Weisberg and \nAlba (1981, Experiment 1), who instructed participants that they had exhausted all the \nsolution possibilities that lay within the square (we subsequently refer to this as the \n‘exhausted square’ hint), and that they would have to go outside the square in order to solve \nthe problem.  They found that only 3 out of 15 participants given this hint solved it within 10 \nattempts. \n The conclusion drawn by Burnham and Davis (1969) and by Weisberg and Alba \n(1981) was that the failure of participants to solve the problem when instructed to explore \nsolution options outside the square falsifies a Gestalt account of difficulty, since this \nmanipulation explicitly overrides the self-imposed perceptual organisation of the problem \narray. This argument seems to us to be conceptually flawed.  The operation of the Gestalt law \nof Pragnanz (e.g., as implemented in Marr’s, 1982, theory of the full primal sketch) is at an \nautomatic and pre-conscious level, and cannot be over-ridden by conscious control. Thus, \nwhilst participants may be instructed to act contrary to their perceptual processing of the \nproblem array, perceptual organisation takes place regardless and may well continue to exert \nan influence over problem-solving performance in opposition to overt instruction.  So, far \nfrom demonstrating that an explicit dismissal of the ‘square’ interpretation fails to facilitate \nperformance, the instructional manipulation may simply be unsuccessful in over-riding the \norganisation and subsequent influence of the problem’s perceptual characteristics. \nWeisberg and Alba (1981) also report data from their first experiment in which \nperformance was strongly facilitated by presenting parts of the solution along with the \n‘exhausted square’ hint. In one condition one line of the solution was already drawn (a \nstraight diagonal line extending from a point outside of the square and passing through the \nbottom right-hand dot and extending to the top left dot), and 9 out of 13 participants solved \nthe problem, taking an average of 5 attempts to do so.  In a second condition participants \nwere provided with the first two lines of a correct solution already drawn, the first being the \ndiagonal line described above, the second being a horizontal line starting at the end of the \nWhen insight just won't come \nPage 6 \ndiagonal line, passing through the dots on the top row and extending to a non-dot point one \nunit to the right. All 17 participants in this condition solved the problem, generally on their \nfirst or second attempt. Weisberg and Alba suggest that the absence of complete facilitation \nwith the one-line group indicates that the source of difficulty in the problem is not one of \nfixation upon the square figure.  Whilst the facilitation shown by adding lines to the problem \nrepresentation or by instructing problem-solvers on the characteristics of the required solution \nis undeniable, it is hardly surprising. Including in the instructions a component of the solution \nor a procedure for constructing the whole solution is surely bound to improve performance. \nWhere we differ from Weisberg and Alba is in the interpretation of their findings.  In the case \nof the nine-dot problem, the addition of solution components not only changes the visual \ndisplay of the problem, but also qualitatively changes the performance options available to \nparticipants, effectively restricting them to only two starting points (the ends of the drawn \nlines).  Facilitation is cognitively mediated in these experiments, but this may be the case only \nbecause the task faced by participants is changed qualitatively, by restricting the space of \npossible solutions and then making a search of the restricted space a task requirement.  In \nother words, these manipulations show only that if you tell participants how to solve the \nproblems, then they can solve them: they do not properly test the influence of perceptual \norganisation upon problem-solving performance. \nMore compelling evidence for a cognitive basis to the nine-dot problem’s difficulty \ncomes from experiments in which facilitation emerges through transfer of experience from a \ntraining task. Weisberg and Alba (1981, Experiment 2) found that nearly half the participants \ntrained on problems whose solutions required lines extending beyond the boundary of the \nproblem array solved the nine-dot problem, whereas no participant trained on problems \nwhose solutions remained within the problem array was able to solve the nine-dot problem.  \nThey interpret these results as demonstrating that performance on the nine-dot problem \nreflects the transfer of task-specific experience to the problem.  People, they argue, generally \nWhen insight just won't come \nPage 7 \nencounter dot arrays such as the nine-dot problem in the context of joining-the-dots tasks, and \ntherefore consider only the space of dot-to-dot lines in developing their solutions.  Presenting \nlines that do not end on dots, and training in solutions that have lines that do not terminate in \ndots, creates relevant experience that can be applied in the solution of the problem. \nA similar training manipulation is reported by Lung and Dominowski (1985). They \nfound that the most powerful facilitation is gained through a combination of training and \ninstruction.  They argue that it is not the retrieval of specific experience that blocks \nperformance on the nine-dot problem.  Instead, they suggest that it is the addition of a \nconstraint that all lines must begin and end on dots that makes the problem difficult, since the \nsolution requires lines to turn on a position where there is no dot to anchor them. This is \nsimilar to Weisberg and Alba’s (1981) account, since the source of problem difficulty is \nproposed to be the failure to consider non-dot points in solution attempts.  \nThe instructional and training manipulations reported in the literature do undoubtedly \nreduce problem difficulty, but they are all open to the same criticism that they present \nparticipants with components of the solution. One might argue that the most surprising aspect \nof these attempts at facilitation is that they are not perfect, suggesting that there must be some \nother aspect of the problem that determines difficulty beyond the conscious cognitive \nstrategies adopted by participants.  Interestingly, the strongest facilitation in nine-dot \nperformance comes from a presentational manipulation.  Burnham and Davis (1969) report \nthat between 80% and 95% of participants were able to solve an eleven dot variant of the \nproblem (illustrated in Figure 1b) within 10 minutes.  They interpret this manipulation as \nproviding “a direction and rationale for drawing the necessary four lines for the solution”, that \nis, offering a template for the solution pattern.  Having dismissed the Gestalt account on the \nbasis of their ‘hint’ data, they do not examine the possibility that the eleven-dot problem is \nfacilitative precisely because the figure presented by the problem matches the figure required \nby the solution.  However, their data are compatible with this problem-solution perceptual \nWhen insight just won't come \nPage 8 \nmapping account, and also with the dot-to-dot account of Weisberg and Alba (1981) and the \ndot-turning-points account of Lung and Dominowski (1985). \nPreviously, we proposed that problem difficulty arises because of figural factors, \nspecifically because of the problem of mapping the arrow-like shape of the correct solution \non to the Gestalt (a square) of the standard nine-dot problem (Ormerod, Chronicle and \nMacGregor, 1997).  We will refer to this as the problem-solution perceptual mapping \naccount.  The eleven-dot problem of Burnham and Davis is easy to solve because the problem \nand solution both form arrow shapes. As a test of this hypothesis a revised version of the \neleven-dot problem, shown in Figure 1c, was given to participants (Ormerod et al, 1997, \nExperiment 2). In this problem, dots that are additional to the standard nine-dot problem (the \ntop right and bottom left dots) were left unfilled, and participants were instructed to solve the \nstandard nine-dot problem using these additional dots as guides to the solution. Thus the \navailability of the extra dots for line extension and turning points was maintained but the \nperceptual salience of the arrow shape of the solution was reduced. After five trials, only 33% \nof participants solved this problem, compared with between 80 and 95% in Burnham and \nDavis’ (1969) studies. An apparently minor perceptual change in the problem representation, \nin which the standard nine-dot problem was made distinct within the arrow-like eleven-dot \nproblem, inhibited performance. We argued that the drop in solution rates could not be \naccounted for by either of the cognitive accounts of problem difficulty: rather, the availability \nof solution shape information was the critical determinant of success. The provision of \nadditional dots as guides and the instruction for participants to use them in constructing their \nsolution effectively reduces the problem to one of drawing dot-to-dot lines as specified in \nWeisberg and Alba’s (1981) account and removes the non-dot turning-points implicated in \nLung and Dominowski’s (1985) account. However, like some of the studies criticised above, \nour experiment (Ormerod et al, 1997) effectively changed the task demands of the problem: it \nmay be, for example, that participants did not fully understand the instruction to utilise the \nWhen insight just won't come \nPage 9 \nunfilled dots in solving the nine-dot problem.  To provide a proper test of previous accounts \nagainst our problem-solution perceptual mapping account requires interventions that do not \nqualitatively change the task demands of the problem itself. \nMore recently we proposed a computational model of performance on the nine-dot \nand similar problems (MacGregor, Ormerod and Chronicle, 2000) which is capable of more \ndetailed predictions than previous cognitive approaches.  The model is in the tradition of \ninformation-processing models of problem-solving (Newell and Simon, 1972) and consists of \nthree main components, comprising i) scope of search, ii) move selection, and iii) move \nevaluation based on a criterion of progress towards the goal.  The scope of search is governed \nby mental “lookahead”, the number of lines the person considers in advance.  In the case of \nthe nine-dot problem, this may range from a minimum of one to a maximum of four. Move \nselection is governed by the locally-rational strategy of choosing the line(s) which intersect(s) \nthe maximum number of dots, within the limits imposed by lookahead. Selecting moves that \nmaximise the number of dots cancelled represents a form of “hill-climbing” or “difference \nreduction”, and is consistent with the view that humans make choices under conditions of \nbounded rationality (Chater and Oaksford, 1999; Gigerenzer and Goldstein, 1996; Simon, \n1990).  Move evaluation tests the move(s) suggested by this operator against a criterion of \nprogress based on the ratio of the number of dots remaining to the number of lines remaining.  \nThe intuitive basis of this is the notion that the perceived progress supplied by a move will \ndepend not just on the number of dots cancelled, but on their number relative to the number \nof dots and lines remaining.  Thus, for example, a move that cancels one dot only may be \nunacceptable when many dots and few lines remain, but acceptable if few dots and many lines \nremain.  The criterion we propose is  that to be acceptable a move must cancel a minimum of \nthe ratio of the remaining number of dots to lines.  Criterion-failure results when no \nacceptable move can be found, and may lead to modification or abandonment of the primary \noperator.   \nWhen insight just won't come \nPage 10 \nTo exemplify these three components, consider a participant who is tackling the \nstandard nine-dot problem shown in Figure 1a.  Imagine that he or she has a lookahead value \nof two, and that he or she intends to start at the bottom left-hand corner dot.  One of the most \nlikely moves for this person to make is simply to draw round two sides of the dot array.  This \ncancels five dots, and thus satisfies the criterion described above (as more than half of the \ndots are cancelled by using exactly half the number of lines available).  Another participant \noperating at a lookahead value of three will, in all likelihood, draw round three sides of the \ndot array, thus cancelling more than three-quarters of the dots with three out of four lines.  \nBoth participants will, however, then find themselves unable to find a successful solution: \nthey have been misled by the early success of their primary operator.  Note that both these \nmoves are apparent in data from human solvers: furthermore, moves that do not conform to \nthe model's predictions - such as going from the bottom left-hand dot, up one dot, then over \nto the middle dot - are only infrequently observed. \nThe model outlined above predicts that anyone operating at less than four lookahead \nwill fail to solve the nine-dot problem, at least on initial attempts.  This is because, at \nlookahead values of one, two and three, criterion-failure does not occur early enough in the \nsolution process to prompt a search for alternative, non-model, moves.  The results for the \nnine-dot problem reported in our first experiment (MacGregor et al, 2000) supported these \npredictions, with 96% of classifiable first responses being consistent with the model.  Model \ncompliance dropped to 71% on the second attempt, and to 53% on subsequent attempts, \nsuggesting that repeated failures may lead to a search for other strategies.  Nevertheless, the \noverall level of model compliance was high.  The model also accurately predicted relative \nsuccess rates for problems such as those shown in Figure 2 (MacGregor et al, 2000). \nIn contrast to these positive predictions the present article is concerned with a set of \nnegative predictions, where the model and its associated results suggest performance failures \nin the face of experimental manipulations that, on all other reasonable grounds, might be \nWhen insight just won't come \nPage 11 \nexpected to greatly facilitate performance on the nine-dot problem.  The article reports three \nexperiments designed to test the importance of figural factors, in which visual cues to the \nsolution of the nine-dot problem are provided in a manner designed to avoid the conceptual \ndifficulties in earlier research identified above. That is, the visual cues neither change the task \nrequirement for participants, nor explicitly provide components of either the solution itself or \nof the “insight” required to find a successful solution (that is, drawing lines outside of the \nsquare boundary implied by the nine-dot array).  Experiment 1 examines the effect of \nproviding (a) a solution-relevant, Gestalt organisation superimposed on the problem in the \nform of shading, and (b) the same superimposed shading with an additional written hint as to \nits relevance.  Under both the traditional Gestalt account and our problem-solution mapping \naccount (Ormerod et al, 1997), this manipulation should facilitate problem solution. Indeed, \nsince the solution form is itself available as a percept, it should remove all aspects of problem \ndifficulty.  The computational model we recently proposed, however, would seem to predict \nlittle or no facilitation, since extending lines as implied by the shading is unnecessary to \nachieve maximum dot cancellation (except when the value of lookahead is at the maximum \nof four moves).  The provision of the written hint in the second condition was suggested by \nthe finding of Gick and Holyoak (1980) that hints are necessary to facilitate the use of \nsolution-relevant information in some problem-solving situations.  Experiment 2 is similar to \nExperiment 1, but employs a control condition in which a verbal hint to go outside the square \nshape of the problem was given, in order to directly compare the effects of verbal and \nperceptual hints.  Experiment 3 uses a training-transfer paradigm to examine whether \nexperience with the production of a directly transferable solution shape may successfully \nfacilitate performance on the nine-dot problem. \nWhen insight just won't come \nPage 12 \nExperiment 1 \nMethod \n Design \n Two groups of participants were tested in two hint conditions: Shading Only, and \nShading plus Hint.  A no-hint condition was not included in the design because of the robust \nand often-replicated floor effect with the nine-dot problem presented alone – instead we used \nprevious results to estimate the expected frequency of solvers under the null hypothesis of no \neffect of hint. \n Participants \n Eighty-seven people volunteered to participate in the experiment during a \nDepartmental Open Day.  Four did not follow instructions correctly and their sheets were \ndiscarded.  In the remaining 83, there were 38 men and 44 women, with ages ranging from 18 \nto 65 (mean age: 45 years).  One participant declined to give age and gender information. \n Materials \n Each participant was provided with a single sheet, on which were printed the problem \ninstructions, problem and visual cue, written hint (in the second condition only) and questions \nabout prior experience with the problem, plus spaces to record age and gender.  The problem \nand visual cue are reproduced in Figure 1d.  The problem instructions were as follows:  \n“Your task is to draw four lines which, between them, go through all the nine dots.  However, \nyou must abide by the following constraints: the lines must be straight; the lines must be \nconnected; once you have started drawing you must not lift your pen off the page; you must \nnot retrace over a line you have already drawn.”  In the Shading plus Hint condition, the \nfollowing was printed above the problem: “HINT: You may find it helpful to consider the \nshading under the nine dots when trying to find a solution”. \nProcedure \n Both groups of participants were tested in a group setting in a University lecture \ntheatre.  Problem sheets for the two conditions were distributed in random order, and \nparticipants asked to keep the sheet face down until told to turn over.  The experimenter \nexplained the general purpose of the experiment, and went through the problem instructions \nWhen insight just won't come \nPage 13 \nverbally, answering any queries that participants had.  Participants were then told to \ncommence the problem, and were given three minutes to complete it.  Following the \nprocedure participants were told of the purpose of the experiment, and shown the solution. \n___________________________________ \nFigure 1 about here \n___________________________________ \nResults \nOf the 83 participants, 25 stated that they had seen the nine-dot problem and solution before: \ndata from these participants were excluded from further analysis.  Of the remaining 31 in the \nShading Only condition, 5 (16%) solved the problem, while 8 of 27 (30%) in the Shading \nplus Hint condition solved it. Analysis of the solution accuracy data showed no significant \ndifference between the two conditions in the proportion of participants finding a correct \nsolution (χ\n2\n=1.51, df=1; p=0.22).   \nFurther comparisons were made against expected frequencies of solution based on the \nresults reported in previous published studies.  Three of the published studies for which \nsample sizes were given reported zero solvers, based on samples of 15 (Burnham and Davis, \n1969), 15 and 12 (Weisberg and Alba, Experiments 1 and 1c, respectively).  Two studies \nreported three solvers, based on samples of 32 and 33 (from Weisberg and Alba, 1981, \nExperiment 1a and Lung and Dominowski, 1985, respectively).  We took the average of these \nresults as the population solution rate (5.6%) against which to test the goodness-of-fit of the \npresent sample results, using the one–sample Kolmogorov-Smirnov test (the χ\n2\n test was not \nused because of small expected frequencies).  For neither condition did the observed \nprobability of solving significantly exceed the expected value (DMAX = .11, p>0.20 for the \nShading Only condition, and DMAX = 0.24, p>0.05 for the Shading plus Hint).   \n Failed solution attempts were examined for information regarding the problem \nsolving process.  Of the 26 failed attempts in the Shading Only condition 10 (38%) were \nblank.  Similarly, of the 19 in the Shading plus Hint condition, 9 (47%) were blank.  The \nremainder were classified in two ways: first, in terms of whether or not the solution attempt \nwas consistent with the computational model, and second, in terms of whether or not any \nWhen insight just won't come \nPage 14 \nattempt at a line extension beyond the square shape of the nine dots had been made.  Here and \nin the following experiments, we report percentages based first on classifiable attempts only, \nthen on all responses (including blanks and unclassifiable attempts) in the format aa%\/bb%.  \nStatistical tests are based on the former.  In the Shading Only condition, eight attempts \n(50%\/31%) were consistent with the model, and in the Shading plus Hint condition, five \nattempts (50%\/26%) were consistent.  Of all the non model-consistent attempts in both \nconditions, five extended a line beyond the square, three (19%\/12%) in the Shading Only \ncondition, and two (20%\/11%) in Shading plus Hint.  The difference was not significant, \np=.57, Fisher exact test. \nDiscussion \nThe results of Experiment 1 provided little or no evidence that, when given a visual cue as to \nthe shape of the solution, participants are more likely to solve the nine-dot problem than with \nno visual cue present.  The shaded solution shape seems, on the face of it, to provide an \nunambiguous pointer to the solution, and it is perhaps surprising that so few participants \ncapitalised upon it. With an explicit written hint to use the cue to construct the solution, \nsuccess rates improved slightly, but not to a degree that was significantly greater than the \nproportion in the Shading Only condition or, for that matter, the proportion expected with no \nhint at all, based on previous research.  At an intuitive level, it remains surprising that only \n30% of participants found a solution in this case even when (a) the shape of the solution was \nperceptually available and (b) the written hint clearly indicated the relevance of this \nalternative shape information.  These data tend, on the face of it, to argue against our previous \nsuggestion (Ormerod et al, 1997) that problem\/solution shape incongruence underlies the \ndifficulty of the nine-dot problem.  They are, however, consistent with our more recent \ncomputational approach (MacGregor et al, 2000). \n A more detailed analysis of failed solution attempts further supported the conclusion \nthat there were little or no differences between the two conditions.  In many cases participants \nsimply failed to produce any response.  However, of those who did, 50% in each condition \ngenerated solution attempts that were consistent with the computational model, while \nWhen insight just won't come \nPage 15 \nrelatively few extended lines beyond the boundary of the nine dots.  We comment further on \nthe observed level of model compliance in the General Discussion. \nOne disadvantage with the design of Experiment 1 is that no direct comparison was \npossible between the visual cues we used and the verbal “exhausted square” hint used by \nWeisberg and Alba (1981).  Although the facilitation provided by the shaded solution shape \nwas surprisingly small, it remains possible that some aspect of the particular stimuli or \nprocedure prevented participants from successfully finding a solution.  In order to address this \npotential concern, Experiment 2 was conducted.  \nExperiment 2 \nMethod \n Design \n Three groups of participants were tested in three hint conditions: (1) written hint to go \noutside the square shape of the problem, henceforth the Exhausted Square condition, (2) \nshading plus a written hint to use the shading as an aid (identical to condition B in \nExperiment 1, henceforth the Shading plus Hint condition), (3) shading plus a written hint to \nuse the shading, plus a written hint to go outside the square shape of the problem (the \nShading plus Both Hints condition). \n Participants and procedure \n One hundred and forty-nine people volunteered to participate in the experiment during \nseveral Departmental Open Days.  There were 63 men and 84 women, with ages ranging from \n16 to 62 (mean age: 42 years).  Two participants declined to give gender information, and \nthree declined to give age information. \n Problem sheets were very similar to those used in Experiment 1.  In the Exhausted \nSquare condition, the shaded solution shape was omitted, and the following written hint \npresented above the problem: “HINT: Solution attempts whose lines remain entirely within \nthe square shaped pattern made by the nine dots cannot succeed”.  The Shading plus Hint \ncondition had the shaded solution shape and the following written hint: “HINT: You may find \nit helpful to consider the shading under the nine dots when trying to find a solution”.  The \nWhen insight just won't come \nPage 16 \nShading plus Both Hints condition had shading plus both of the written hints above. In other \nrespects the procedure was identical to that used in Experiment 1. \nResults \nOf the 149 participants, 39 stated that they had seen the nine-dot problem and solution before: \ndata from these participants were excluded from further analysis. Of the remaining 110 there \nwere 44, 27 and 39 in the Exhausted Square, Shading plus Hint and Shading plus Both Hints \nconditions. The number (percentages) solving in these conditions were 7 (16%), 7 (26%) and \n13 (33%), respectively.  There was no overall significant difference among conditions, χ\n2\n= \n3.43, df=2, p=.18. \n As in Experiment 1, failed solution attempts were examined in detail.  Of the 83 failed \nattempts, 41 (49%) were blank.  The remaining failed attempts were classified for model \nconsistency, and overall, 60%\/30% were consistent with the model.  Broken down by \ncondition, the rates were 45%\/24%, 75%\/30% and 71%\/38% for the Exhausted Square, \nShading plus Hint and Shading plus Both Hints conditions, respectively. The conditions did \nnot differ significantly in this respect, χ\n2\n= 2.40, df=2, p=.30.  There were six cases of failed \nsolution attempts which extended a line beyond the square, four (20%\/11%) in the Exhausted \nSquare condition, zero in the Shading plus Hint condition and two (14%\/8%) in Shading plus \nBoth Hints condition.  The difference between conditions was not significant, χ\n2\n= 1.87, df=2, \np=.39. \n \nDiscussion \nThe Exhausted Square and Shading plus Hint conditions gave rise to a comparable pattern of \nperformance; it is further notable that the Exhausted Square condition gave rise to similar \nlevels of performance when compared with the equivalent condition from Weisberg and Alba \n(1981), where 4 of 15 participants solved the problem.  In addition, the results replicated \nthose of the first experiment for the Shading plus Hint condition, with 26% solving compared \nwith 30% in Experiment 1.  As with Experiment 1, a potentially surprising feature of the data \nwas that solution rates were not considerably higher, particularly in the Shading plus Both \nHints condition, where it could be argued that participants have explicit hints for cognitive \nWhen insight just won't come \nPage 17 \nstrategy (to go outside the square shape), implicit hints to overcome fixation on the Gestalt of \nthe problem (the shaded solution shape) and an explicit instruction that the anti-fixation hint \nmight be useful, and as such ought to be solving the problem with near-100% success.   \nHowever, the clear prediction of our computational model is that in all conditions of \nExperiment 2, neither shading nor hints will influence performance, as participants are \ndominated by the initially successful operator of maximum dot cancellation.  Consequently, \nfor example, drawing the first three lines of a solution around three sides of the square formed \nby the nine dots cancels seven dots, the maximum possible.  There is therefore no motivation \nto consider using the information provided by the hints to seek moves that extend beyond the \ndot array. \nIt is however possible to suggest that a remaining component of the problem’s \ndifficulty lies in the execution of the drawn solution. That is, to achieve insight into the \nsolution of the nine-dot problem requires not only the provision of solution hints, but also the \nexperience of the procedures involved in their application.  A third experiment was conducted \nto investigate this possibility. \nExperiment 3 \nIn an attempt to provide participants with experience of producing a solution exactly \nakin to the solution required for the nine-dot problem, Experiment 3 trained participants on \nthree problem variants with an identical solution shape, which we know from previous \nresearch can be reliably solved by naïve participants (MacGregor et al , 2000). These \nproblems should therefore provide suitable production experience.  Thus the experiment \nemployed a training and transfer design.  Participants first received three problems in which \nthey were trained to produce the solution shape of the nine-dot problem using eleven-, \ntwelve- and thirteen-dot problem variants.  They then received the standard nine-dot problem \nas the transfer task.  \nThe stimuli used are shown in Figure 2.  In the lower panel, the eleven-dot problem \nconsisted of the original nine-dot problem plus two additional dots, one located one unit to \nthe left of the upper left-hand dot and a second dot one unit below the bottom-right hand dot \nof the original nine-dot.  The twelve-dot problem was next generated from this eleven-dot \nWhen insight just won't come \nPage 18 \nversion by adding one more dot one diagonal unit from its bottom left-hand dot. Finally (for \nthe lower panel) the thirteen-dot problem was obtained by adding one more dot one diagonal \nunit from the bottom left of the twelve-dot.  Each of these problems has dots located at the \ninflection points at the head of the familiar “arrow” shaped solution of the nine-dot problem, \nand are henceforth termed the \"Head Complete\" problems.  The training stimuli shown in the \nupper panel of Figure 2 were next obtained by removing dots from the ‘head’ of this arrow \n(henceforth termed the \"Head Incomplete\" problems).  That is, the twelve-dot problem in the \nupper panel was produced by deleting the bottom right-hand dot from the thirteen-dot \nproblem.  Similarly, the eleven-dot problem was obtained by deleting the top left-hand dot \nfrom this twelve-dot version.  (Note that the thirteen-dot problem was identical in both \nconditions).   \nOur previous work with problem variants such as those shown in Figure 2 \n(MacGregor et al, 2000) suggested that the Head Complete and Head Incomplete conditions \nwould provide an effective manipulation of the number of times a correct solution shape \nwould be produced.  In the Head Complete conditions shown in the lower panel in Figure 2, \nparticipants were expected to solve reliably by drawing the arrow shaped solution on to the \ndots provided.  In contrast, for the eleven and twelve-dot Head Incomplete problems, \nparticipants were not expected to draw the arrow shaped solution.  If, as suggested above, a \nresidual source of difficulty in the nine-dot problem is that participants require experience of \nexecuting the solution in order to solve it, then it would be predicted that the Head Complete \nconditions would lead to higher levels of transfer than the Head Incomplete conditions.  A \nfurther factor of Order was also included, with training problems either being built up from \neleven to thirteen dots across problems or reduced.  Order was included to test whether \ntransfer would be more likely when training problems became successively better \napproximations, from the point of view of perceptual similarity, to the nine-dot transfer \nproblem.  It should be noted that the number of dots forming the tail of the arrow shape of \nthese problems does not influence performance despite seemingly providing a cue as to a \nstarting point (MacGregor et al, 2000, Experiment 2). \nWhen insight just won't come \nPage 19 \nIn contrast to the preceding predictions, our computational model (MacGregor et al, \n2000) predicts little or no transfer to the nine-dot problem.  For the Head Complete training \nproblems participants will, in fact, receive reinforcement if they perform according to the \nmaximum dot-cancellation operator of the model, since this will generally be accompanied by \nsuccessful completion of those problems.  Thus they should continue to be dominated by this \noperator on the nine-dot problem, which more-or-less guarantees that a correct solution will \nnot be found (except in those cases where criterion-failure occurs, which in turn requires a \nlookahead of four lines).  For the Head Incomplete training problems, the model similarly \npredicts little or no transfer to the nine-dot problem.  Participants will remain consistent to the \nmodel, and generally attempt to maximise the number of dots cancelled per move: this will \nresult in only low levels of correct solutions to the eleven and twelve dot training problems. \n \nMethod \n Design \n The factors manipulated were (a) Problem, either thirteen-dot, twelve-dot, eleven-dot, \nor nine-dot, (b) Shape, either Head Complete or Head Incomplete and (c) Order of training \ntrials, either 13-12-11, or 11-12-13.  Factor (a) was assigned within-participants, factors (b) \nand (c) between groups. \n Participants \n The participants were 188 undergraduate psychology student volunteers.  As the \nexperiment was carried out on a group basis with limited time available, identifiers and age \ninformation were not collected. \n Materials \n Each participant received a printed problem booklet.  The first page gave general \ninstructions relevant to all four problems; the instructions were identical to those used in \nExperiment 1.  The following four pages contained the four problems in the appropriate order \nfor the experimental condition.  The two Shape conditions for the eleven, twelve and thirteen-\ndot problems are shown in Figure 2. A final page asked some debriefing questions about \nparticipants’ prior knowledge of the nine-dot problem. \nWhen insight just won't come \nPage 20 \n___________________________________ \nFigure 2 about here \n___________________________________ \nProcedure \n Testing of participants was undertaken as part of undergraduate lecture classes.  \nProblem booklets were distributed to participants, and the instructions outlined verbally by \nthe experimenter, any queries being answered at this time.  Participants were given three \nminutes for each problem, and were asked to turn the page to the next problem by the \nexperimenter at the correct time intervals.  At the end of the testing period, the purpose of the \nexperiment and the correct solution were explained to the group of participants. \nResults \nSeventy participants indicated that they had seen the nine-dot problem on a previous \noccasion, and their solutions were therefore excluded from further analysis.  Each solution to \neach problem from the remaining 118 participants was scored 1 for a correct solution, and 0 \nfor incorrect. \n The main results are illustrated in Table 1, which shows the percentage of participants \nproducing a correct solution for the sixteen conditions.  Overall, the percentages of \nparticipants solving the thirteen, twelve, eleven and nine-dot problems were 71%, 43%, 29% \nand 5%, respectively. This overall pattern of results was consistent with our previous findings \n(MacGregor et al, 2000). \n As a manipulation check, the total numbers of times participants produced solutions \nof the correct shape (the standard arrow-shape shown in Figure 2) were submitted to a \nbetween participants analysis of variance, with Pattern and Order as the factors.  As expected, \nthere was a highly significant effect of pattern, with Head Complete problems giving rise to \nmany more correctly shaped solutions (mean = 2.18) than Head Incomplete problems (mean = \n0.88; F(1, 114) = 49.3; p<0.001, MSe = 0.95).  Neither the main effect of Order nor the \ninteraction between Pattern and Order were significant. \n Performance on the nine-dot test trial was also analysed using a between-participants \nanalysis of variance, with Pattern and Order of Training as the factors.  The results indicated \nWhen insight just won't come \nPage 21 \nno significant effects (all p’s>.05), and performances were low across all four conditions \n(Table 1). \n___________________________________ \nTable 1 about here \n___________________________________ \nFailed responses to the nine-dot problem were classified in terms of whether or not \nthey were consistent with the computational model.  There were a total of 88 classifiable \nresponses (unclassifiable responses were either blank or ambiguous), of which 61 (69%\/54%) \nwere model consistent.  For the Head Complete shapes, the number (percentages) of model \nconsistent responses were eight (80%\/47%) and 21 (72%\/58%), for the thirteen to eleven and \neleven to thirteen orders of training, respectively.  The comparable results for the Head \nIncomplete conditions were 13 (52%\/42%) and 19 (79%\/68%).  The results were analysed \nusing a 2x2 between groups analysis of variance, which indicated no significant effect of \nShape, Order of Training, or their interaction (all p’s > .05).   \nThe results were further analysed in terms of the number of failed solutions to the \nnine-dot problem that exhibited a line extension beyond the square outline of the dots.  Of the \n93 completed responses, 14 showed line extensions. For the Head Complete shapes, the \nfrequencies (percentages) of line extensions were one (8%\/6%) and two (7%\/6%), for the \nthirteen to eleven and eleven to thirteen orders of training, respectively.  The comparable \nresults for the Head Incomplete conditions were eight (31%\/25%) and three (12%\/9%).  A \n2x2 between groups analysis of variance indicated no significant effects (all p’s > .05).   \n \nDiscussion \nSolution rates to the nine-dot problem were low across all four combinations of training \nfactors, and were not significantly different from each other.  The training manipulation gave \nrise to significantly more experience with correct solution shape production in the Head \nComplete conditions, as expected.  The lack of transfer of the shape of the solution from the \ntraining problems to the test problem in the Head Complete conditions argues strongly that \nWhen insight just won't come \nPage 22 \nsimple experience with solution shape does not make the nine-dot problem easier to solve.  \nThis is so despite (a) the identical shape of the solution in all cases; (b) the fact that the nine-\ndot problem array is embedded within each of the problem variants, and (c) the fact that in the \n13 to 11 condition, the order of training trials let the participants experience problems that \nwere progressively more and more similar to the transfer problem.  This failure to transfer \nexperience with the solution shape to the nine-dot problem is consistent, however, with the \nprediction of our computational model.  Since criterion failure will be rare (limited to people \noperating at a lookahead of four lines) there is no impetus to entertain “non-model” moves, \nsuch as line extensions, thereby guaranteeing failure. \nA more detailed test of the model’s predictions was again made by examining the \npercentage of model consistent solutions to the nine-dot problem.  Overall, 69%\/54% of \nresponses were consistent with the model, and although there were more in the Head \nComplete than Incomplete conditions, the difference was not statistically significant.  A \npossible criticism of the experimental method used in Experiment 3 is that participants may \nnot have been sufficiently aware of the spatial relationship between the training and test \nproblems. Indeed, the results we report in Ormerod et al (1997), where participants failed to \nsolve an eleven-dot problem in which the standard nine-dot problem was made distinct, tend \nto support this view.  However, this experiment was a one-trial study, in which participants \ndid not benefit from any transfer or instructional manipulation.  Therefore, in order to \nexamine this point in the context of a training-transfer paradigm, a further 25 participants \nwere presented with the training and test problems shown in Figure 3.  The first training \nproblem was the standard twelve-dot problem used in Experiment 3 and the second training \nproblem had the relevant nine dots distinguished by being unfilled circles.  The test problem \nconsisted only of the nine unfilled circles in the normal nine-dot pattern.  Solution rates were \n88, 84 and 12% respectively.  This pattern of data demonstrates that the failure to transfer in \nExperiment 3 was not due to confusion over how the test problem was embedded in the \ntraining problem: when this relation was made transparently clear, the failure to transfer \nremained. \n___________________________________ \nWhen insight just won't come \nPage 23 \nFigure 3 about here \n___________________________________ \n \nGeneral Discussion \nIn this paper we have argued that previous attempts to study the operation of hints in the nine-\ndot problem have been problematic because they qualitatively changed the problem-solver’s \ntask.  In addition, they have generally focussed on strategic types of hints presented at a \ncognitive level.  In the experiments reported here, attempts were made to provide visual and \nperceptual-procedural cues to a solution, without varying the task, and without providing \nelements of the solution itself.  It appears from all three experiments, however, that these cues \nto the solution do not provide a great deal of facilitation.  In general, therefore, it might be \nconcluded that experiencing the shape of the solution is not in itself sufficient to prompt \napplication of that shape to the nine-dot problem.   \n These findings are of considerable interest from a theoretical point of view. The nine-\ndot problem has frequently been regarded in the literature as a problem that requires insight \nfor a solution.  Ohlsson (1990, p.4) defines insight as occurring “…in the context of an \nimpasse, which is unmerited in the sense that the thinker is, in fact, competent to solve the \nproblem”.  In the nine-dot case, adult solvers are undoubtedly competent to solve, but \nencounter an impasse which, again in Ohlsson’s terms, has usually been regarded as being \nbreakable only by the process of constraint relaxation.  That is to say, the inferred constraint \non the part of participants to remain within the square shape implied by the array is relaxed, \nso that lines may extend beyond the figural boundary and a solution be found.  In the \nexperiments reported here, we would argue that the visual cues provided guide the \nparticipants strongly towards constraint relaxation – and yet the impasse is broken only in a \nsmall minority of cases, judging by solution rates.  We therefore suggest that it may be \nworthwhile to consider the process of insight in this problem in a slightly different light. \n The results of these experiments do not appear to be consistent with either the \ntraditional Gestalt account or our problem-solution mapping account (Ormerod et al, 1997).  \nFurthermore, the general failure of quite directive hints to encourage participants to use non-\nWhen insight just won't come \nPage 24 \ndot points in constructing a solution is at odds with the theoretical position of Weisberg & \nAlba (1981) and Lung & Dominowski (1985).  Rather, the findings reported here appear to be \nmore consistent with our recent computational modelling approach (MacGregor et al, 2000), \nwhich proposes an operator that seeks to “cancel” as many dots in the problem as possible \nwith each solution line.  In the model, a solution to the nine-dot problem can only be achieved \nif the average dot cancellation by each line equals 2.25 – this criterion, in turn, can only be \nachieved if there is sufficient lookahead to find the appropriate solution.  According to the \nmodel, provision of visual cues to the problem’s solution will not affect the application of the \ncancellation criterion and so should not influence performance on the standard nine-dot \nproblem, where the criterion is never violated. The model also has advantages over previous \ncognitive accounts in being able to explain both success and failure in problems that do not \nrequire non-dot point inclusion. \nThe overall rates of model compliant responses to the nine-dot problem ranged from \n45%\/24% to 80%\/47% in the present experimental conditions. These figures are substantially \nlower than the figure of 96% found previously for a first attempt, and are more in accordance \nwith the rates we have reported of 71% for a second attempt and 53% for subsequent attempts \n(MacGregor et al, 2000).  A possible reason for this difference is that the latter study gave \nparticipants one minute for each of ten attempts, whereas the present experiments allowed \nthree minutes for one attempt.  It may be that in the present case some participants’ nominal \nfirst attempt may effectively have been a second or third attempt because they used the \nadditional time to try to discard moves mentally.  \nTo summarise, we would claim that it is reasonable to regard the processes of \ncriterion failure and lookahead embodied in a hill-climbing model of nine-dot problem-\nsolving as belonging to the route to insight that Ohlsson (1990) terms “re-encoding\".  In other \nwords, a fundamental reconceptualisation of how the problem may be tackled is required: \nconstraint relaxation in and of itself is not sufficient to promote successful solutions.  \nFurthermore, it is clear that visual hints designed to aid constraint relaxation, such as those \nexamined in the foregoing experiments, are unlikely to impact upon the development of \noperator lookahead, as lookahead is usually thought of as being constrained more by working \nWhen insight just won't come \nPage 25 \nmemory or other capacity limitations than by perceptual factors.  In general, therefore, the \nfindings reported here make it very clear that the answer to a problem may be capable of \neluding human solvers even when it is literally staring them in the face – and furthermore, \nwhen they are explicitly told that it is staring them in the face.  \nWhen insight just won't come \nPage 26 \nReferences \n \nBurnham, C. A. & Davis, K. G. (1969)  The nine-dot problem: beyond perceptual \norganisation.  Psychonomic Science, 17, 321-323. \nChater, N., & Oaksford, M.  (1999)  Ten years of the rational analysis of cognition.  Trends in \nCognitive Sciences, 3, 57-65. \nGick, M. L. & Holyoak, K. J. (1980).  Analogical problem-solving.  Cognitive Psychology, \n12, 306-355. \nGigerenzer, G. & Goldstein, D.G. (1996)  Reasoning the fast and frugal way: Models of \nbounded rationality.  Psychological Review, 103, 650-669. \nGroome, D. (1999).  An Introduction to Cognitive Psychology: Processes and Disorders.  \nLondon: Psychology Press. \nLung, C. T. & Dominowski, R. L. (1985)  Effects of strategy instructions and practice on \nnine-dot problem solving.  Journal of Experimental Psychology: Learning, Memory \nand Cognition, 111: 804-811. \nMacGregor, J, N., Ormerod, T. C. & Chronicle, E. P. (2000).  Information-processing and \ninsight: A process model of performance on the nine-dot  and related problems. .  \nJournal of Experimental Psychology: Learning, Memory and Cognition, in press. \nMarr, D. (1982)  Vision.  San Francisco, Freeman. \nNewell,  A., & Simon, H.A. (1972).  Human problem solving.  Englewood Cliffs, N.J.: \nPrentice-Hall \nOhlsson, S. (1990)  Information-processing explanations of insight and related phenomena.  \nIn: M. T. Keane & K. J. Gilhooly (Eds.)  Advances in the Psychology of Thinking, \nVol. 1.  New York, Harvester Wheatsheaf. \nWhen insight just won't come \nPage 27 \nOrmerod, T. C., Chronicle, E. P. & MacGregor, J. N. (1997)  Facilitation in variants of the \nnine-dot problem: perceptual or cognitive mediation?  Poster presented at the 18\nth\n \nAnnual Conference of the Cognitive Science Society, Stanford CA, August 7-10. \nScheerer, M.  (1963).  Problem solving.  Scientific American, 208: 118-128. \nSimon, H.A. (1990)  Invariants of human behaviour.  Annual Review of Psychology, 41, 1-19. \nWade, C. & Tavris, C. (1990)  Psychology (2\nnd\n edition).  New York, Harper and Row. \nWeisberg, R. W. & Alba, J. W. (1981)  An examination of the alleged role of “fixation” in \nthe solution of several “insight” problems.  Journal of Experimental Psychology: \nGeneral,110: 169-192. \nWhen insight just won't come \nPage 28 \n \n \n \n \nTable 1. Percentage of solvers as a function of the three experimental factors in Experiment 3. \nProblem    13 12 11 9  N \n \nShape  Order \n \nComplete 13 to 11  78 89 78 6  18 \n \nIncomplete 13 to 11  69 9 9 3  32 \n \nComplete 11 to 13  81 72 39 0  36 \n \nIncomplete 11 to 13  59 19 9 13  32 \nWhen insight just won't come \nPage 29 \nFigure headings \nFigure 1.  (a) The standard nine-dot problem; (b) the eleven-dot version used by Burnham and \nDavis (1969);(c) the eleven-dot variant used by Ormerod et al (1997) and (d) the shading hint \nused in Experiments 1 and 2;.  In all cases, the requirement is to draw four connected straight \nlines through all the dots, without lifting pen from paper, and without retracing. \nFigure 2.  Problems used in Experiment 3.  The requirement for each problem is exactly as \nfor the standard nine-dot problem shown in Figure 1a.  The correct solution is shown only for \nthe thirteen-dot problem; the solution is identical in all problems. \nFigure 3.  Supplementary problems for Experiment 3.  Panel (a) shows the first training \nproblem, panel (b) the second training problem, and panel (c) the standard nine-dot transfer \nproblem.  The solution is in all cases identical to that shown in Figure 2. \n \n"}