{"doi":"10.3366\/edinburgh","coreId":"65790","oai":"oai:dro.dur.ac.uk.OAI2:4743","identifiers":["oai:dro.dur.ac.uk.OAI2:4743","10.3366\/edinburgh"],"title":"W. G. Sebald : image, archive, modernity.","authors":["Long, J. J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-12-01","abstract":"Offering a unique and original reading of Sebald's dazzling oeuvre, this title argues that his work is concerned first and foremost with the problem of modernity. It focuses in particular on the numerous archival institutions and processes that lie at the very heart of modernity and are repeatedly thematised throughout Sebald's work","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65790.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/4743\/1\/4743.pdf","pdfHashValue":"a7d157e619d88553cb2147426d7438d858e3a4dc","publisher":"Edinburgh University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:4743<\/identifier><datestamp>\n      2016-11-09T16:03:32Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        W. G. Sebald : image, archive, modernity.<\/dc:title><dc:creator>\n        Long, J. J.<\/dc:creator><dc:description>\n        Offering a unique and original reading of Sebald's dazzling oeuvre, this title argues that his work is concerned first and foremost with the problem of modernity. It focuses in particular on the numerous archival institutions and processes that lie at the very heart of modernity and are repeatedly thematised throughout Sebald's work.<\/dc:description><dc:publisher>\n        Edinburgh University Press<\/dc:publisher><dc:source>\n        Edinburgh: Edinburgh University Press<\/dc:source><dc:date>\n        2007-12-01<\/dc:date><dc:type>\n        Book<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:4743<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4743\/<\/dc:identifier><dc:identifier>\n        https:\/\/doi.org10.3366\/edinburgh\/9780748633876.001.0001<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4743\/1\/4743.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Book","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n26 May 2009\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nLong, J. J. (2007) ’W. G. Sebald : image, archive, modernity.’, Edinburgh: Edinburgh University Press.\nFurther information on publisher’s website:\nhttp:\/\/www.eupjournals.com\/book\/9780748633876\nPublisher’s copyright statement:\nAdditional information:\nIntroduction deposited in Durham Research Online.\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n \n \n \nDurham Research Online \n \nDeposited in DRO: \n26 May 2009 \n \nPeer-review status of attached file: \nPeer-reviewed \n \nPublication status of attached file: \nPublished \n \nCitation for published item: \nLong, J. J. (2007) ‘Introduction' in W. G. Sebald : image, archive, modernity. Edinburgh: \nEdinburgh University Press, pp.1-23. \n \nFurther information on publisher’s website: \nhttp:\/\/www.eupjournals.com\/book\/9780748633876 \n \n \n \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \n1INTRODUCTION\nFRAGMENTS OF MODERNITY: ON THE CRITICAL RECEPTION OF SEBALD\nSince his death in a road accident in December 2001, W. G. Sebald has become\none of the most written-about contemporary German authors. Conferences\ndevoted to his work have been held in Davidson (North Carolina), Munich,\nParis, Sydney, Marbach am Neckar and elsewhere, and the secondary literature\ndevoted to his work is now extensive – to say nothing of interviews, reviews,\nobituaries and further publications in press. While these scholarly writings\ndiscuss a wide range of thematic and formal aspects of Sebald’s work, it is pos-\nsible to identify a limited number of topoi that recur in almost all the criticism\nso far published: the Holocaust, trauma and memory, melancholy, photogra-\nphy, travel and flânerie, intertextuality and Heimat.1 It is my contention that\nthese individual topoi can in fact be seen as epiphenomena of a much wider\n‘meta-problem’ in Sebald’s work, one to which only a small number of critics\nhave drawn explicit attention, but which dominates his work from start to\nfinish. That is the problem of modernity.\nBy modernity, I understand the seismic social, economic, political and cul-\ntural transformations that took place in European societies from the eighteenth\ncentury onwards.2 These changes have their roots in a longer history that goes\nback to developments that occurred in the decades around 1500 (the ‘discov-\nery’ of the New World, the Renaissance, the Reformation and the emergence of\nmercantilism). These moments conventionally represent the threshold between\nthe medieval and early modern periods. But the eighteenth century witnesses\n1\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 1 Phil's G4 Phil's G4:Users:phil:Public: PHIL'S\naccelerated change in economic, political and social organisation as a result of\nthree related factors: Enlightenment thought, the Industrial Revolution and the\nFrench Revolution. The changes that characterise modernity are both numer-\nous and varied, but one might single out the following as especially salient fea-\ntures: the industrialisation of production and the transformation of knowledge\ninto technology on which industry depended; the unprecedented exploitation\nof natural resources; increasing standardisation and rationalisation in both the\nproduction and consumption of serially produced goods; rapid urban growth\nand concomitant demographic shifts as societies moved from being largely\nrural and agrarian to being predominantly industrial and urban; a series of\ndevelopments in communications technology, including the telegraph, tele-\nphone and steam press, that facilitated the binding together of diverse and geog-\nraphically dispersed audiences; the spread of new transport networks through\nrailways, motorised road travel and aviation; and an increasingly rapid circu-\nlation of goods within an ever-expanding world market. Within the context of\nthis study, of particular significance is the expansion of the nation state sus-\ntained by a proliferation of bureaucratic apparatuses and a range of civic insti-\ntutions whose intended function was the regulation, discipline and control of\npopulations.\nThe ways in which modernity is thematised in Sebald’s writings can best be\nillustrated by surveying the various topics that have come to dominate Sebald\nresearch. One of the most widespread but also most problematic readings of\nSebald is as a writer of ‘Holocaust literature’. Journalistic reception of his work\nin Britain and the United States frequently portrayed Sebald in this light, and\nreferred to his living ‘in exile’ in such a way as to imply expulsion or inner com-\npulsion rather than economic migration, thereby implicitly establishing paral-\nlels between Sebald and the protagonists of The Emigrants and Austerlitz.3 The\nemphasis on the Holocaust as the central concern of Sebald’s work has been par-\nticularly prominent among anglophone critics. This is not to say that German\ncritics have ignored the Holocaust, but in quantitative terms it remains the\nprovince of anglophone criticism.4 It is effectively impossible to discuss the\nHolocaust without touching on the question of modernity. The ‘Final Solution’\nhas been conceived of as a pathological reaction to the experience of modernity,\nor as a kind of negation of modernity, a regression from the rational processes\nof civilisation to an archaic state of barbarism. Other scholars, such as Zygmunt\nBauman (2000) and Tzvetan Todorov (1999), have countered this view, arguing\nthat the Holocaust was an event whose very conditions of possibility lay in the\ntechnological rationality and bureaucracy characteristic of modernity itself.\nA third way is suggested by Dominick LaCapra, who advocates elucidation of:\nthe intricate conjunction of [the Holocaust’s] distinctively modern fea-\ntures (such as the seemingly dominant role of instrumental rationality,\nW. G. SEBALD – IMAGE, ARCHIVE, MODERNITY\n2\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 2 Phil's G4 Phil's G4:Users:phil:Public: PHIL'S\nbureaucratization, and massive technical resources) with the recurrence\nof often repressed forces, such as scapegoating with ‘sacrificial’ dimen-\nsions. (1994: 94)\nHowever one seeks to understand the Holocaust, though, an examination of its\nrelationship to modernity is inescapable.\nSebald scholars have in recent years – notably since the publication of\nAusterlitz in 2001 – begun to notice that the thematisation of the Holocaust in\nhis work goes hand in hand with a profound concern with the longer history\nof modernity. In an article by Arthur Williams, for example, the ‘metanarrative’\nof the Holocaust slips over into another metanarrative according to which the\nbeginnings of the catastrophes of twentieth-century history are located firstly\n(and somewhat arbitrarily) ‘around 1905’ (2001: 80), and then in the seven-\nteenth century (83). Thus even within the work of a critic who insists more than\nmost on the centrality of the Holocaust, there is an acknowledgment, however\nfleeting, that Sebald is actually concerned with what Mark Anderson calls the\nlongue durée of European modernity (2003: 104). To quote Anderson once\nmore, ‘[T]he roads in Sebald’s work do not all lead to Theresienstadt. The view\nof human devastation and darkness is much larger, at once geophysical and\nmetaphysical, though their roots lie in a profound meditation on the violence\nof European modernity’ (120).5 This ‘profound meditation’ has yet to be\nexplored in detail, even though it haunts other areas of Sebald research.\nThe question of memory, for example, is generally addressed with reference\nto the remembrance of the victims of Nazism in Sebald’s work.6 The so-called\n‘memory boom’ has been identified as a feature of the past quarter-century of\nWestern cultural life, and is seen by Andreas Huyssen as a response to specific\nlate-twentieth-century technical processes – such as fast-speed information net-\nworks, Baudrillardian simulacra, and a threatening sense of non-synchronicity\nand heterogeneity – that are transforming our Lebenswelt (1995: 7). Yet\nmemory has long formed an integral part of the way in which European soci-\neties sought to come to terms with the nature of modernity. In his book\nStranded in the Present: Modern Time and the Melancholy of History, Peter\nFritzsche locates the beginnings of this trend in the French Revolution and the\nEuropean wars that followed it, which, he argues, produced major shifts in his-\ntorical consciousness and a heightened awareness of the need to preserve the\npast. The experience of exile, for example, led to French aristocrats’ conserv-\ning the artifacts of both exile and the Ancien Régime, thereby establishing loss\nand remembrance as fundamental components of identity (2004: 79). One\nmight, with Richard Terdiman, locate the origins of the memory crisis at an\neven earlier point, in the changes wrought by shifts in production brought\nabout by machines and the capitalisation of European economies (1993: 29).\nThe continual production of the new in capitalism has as its concomitant the\nINTRODUCTION\n3\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 3 Phil's G4 Phil's G4:Users:phil:Public: PHIL'S\ncontinual destruction of the old, and the acceleration of obsolescence itself. In\nthis light, modernity was, from quite an early stage, understood as something\nthat perpetually generated loss. Two effects can be seen to emerge from this.\nThe first was to establish remembrance of loss as an imperative and thereby to\nlink European identities to the recollected past. The second was to induce a\ncrisis of memory at both individual and collective levels, engendered by a pro-\nfound sense of historical rupture, a sense that the world had decisively changed,\nand consequently also a ‘massive disruption of traditional forms of memory’\n(Terdiman 1993: 5). The expanding institutions of preservation and collection\ndetailed by Fritzsche (2004), Susan Crane (2000) and Wolfgang Ernst (2003),\nthe emergence of history as a distinct academic discipline, and ultimately also\nthe hypertrophied historical consciousness lambasted by Nietzsche in Vom\nNutzen und Nachteil der Historie für das Leben (1988) [On the Use and Abuse\nof History for Life] can all be seen as symptoms of the memory crisis at a col-\nlective level. In the sphere of individual life, it was primarily psychoanalysis, for\nwhich memory is both the source of the problem and the resource of the cure,\nthat established the determining role of the past for a subject’s present life.\nOne characteristic of the memory crisis is that memory ceases to be a pure\nmatter of consciousness, and comes to reside instead in the very material of our\nsocial or psychic life. This is clear in the role that the institutions of memory –\nmuseums, archives, historiography, newspapers, photography – came to play in\nthe course of the nineteenth century. Even in psychoanalysis, though, the\nunconscious exists within us but functions without our participation or our\nexplicit allegiance (Terdiman 1993: 34). Furthermore, Freud’s attempts to find\nsuitable metaphors for the functioning of the unconscious led him repeatedly\nto material metaphors: archaeology, the ‘mystic writing pad’, and, most\ntellingly photography, which was a metaphor that Freud repeatedly invoked,\nrejected and reinstated, from ‘A Note on the Unconscious in Psychoanalysis’\n(Freud 1958a) to Moses and Monotheism (Freud 1964). These metaphors\nimply that consciousness is always already infected by external mnemotechni-\ncal supplements; the artifacts of modernity are permanently lodged in the\npsyche as a kind of internal prosthesis. Memory and modernity are indissolubly\nlinked.\nOf the various media of memory, photography is the one most obviously\npresent in Sebald’s work.7 Photography is in many ways the emblematic medium\nof modernity. Roland Barthes implied that the history of the world can be\ndivided up into ‘before’ and ‘after’ photography (1977: 44), and Vilém Flusser\nsees the development of photography as a revolutionary moment on a par\nwith the invention of linear writing in the second millennium BC (2000: 10).\nJonathan Crary, on the other hand, sees photography as one part of a reorgan-\nisation of the ‘ways in which vision was discussed, controlled, and incarnated in\ncultural and scientific practices’ (1990: 7). For Crary, then, the visual regime of\nW. G. SEBALD – IMAGE, ARCHIVE, MODERNITY\n4\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 4 Phil's G4 Phil's G4:Users:phil:Public: PHIL'S\nmodernity begins not with photography, but with a ‘radical abstraction and\nreconstruction of optical experience’ (9) whose origins lay in the emergence\nof physiological optics in the late eighteenth and early nineteenth century.\nFurthermore, as a technical mode of representation that allows for potentially\ninfinite mechanical reproduction, photography embodies the principles of tech-\nnological rationality and seriality that govern capitalist production. Beyond\nthat, however, photography also participates in numerous institutions, practices\nand discourses that lie at the heart of the modern European nation state: the dis-\ncourses of criminology, anthropology, ethnography and race; the politics of\ncolonialism; the implementation of ‘scientific management’; the institutions of\ndiscipline and surveillance, and of the nuclear and extended family, to name just\na few. In the context of Sebald’s work, photography is most often discussed in\nrelation to the crisis of memory, with particular focus on Sebald’s questioning\nof photography’s referentiality and mnemonic capacity. As we will see, however,\nthe function of photography in Sebald’s work exceeds by far the question of\nmemory and touches on many of the discourses and practices of modernity that\nI have briefly outlined above.\nWritings on photography frequently dwell on the inherent melancholy of the\nmedium,8 and melancholy is also one of the more obvious features of Sebald’s\nprose.9 Mary Cosgrove argues that Sebald’s texts are dominated by an under-\nstanding of history as melancholy, which maroons the subject in the ruins of\nthe immediate post-war years (Cosgrove 2006a: 218–20). In this light, the title\nof Peter Fritzsche’s book Stranded in the Present aptly conveys the state of\nSebald and his narrators. Fritzsche argues, furthermore, that this sense of\nhistory is a specifically modern phenomenon: ‘Part of modern experience was\na deepening sense of loss, a feeling of disconnection with the past, and a\ngrowing dread of the future’ (2004: 49).10\nBut this is not the only link between melancholy and modernity. Wolf\nLepenies’ seminal work Melancholie und Gesellschaft (1998) [Melancholy and\nSociety] offers an historical sociology of melancholy. In the foreword to the\n1998 edition, Lepenies argues that the melancholy of the intellectual becomes\na topos in Europe at the point when capitalism and the protestant work ethic\ninstal the vita activa as the behavioural norm within bourgeois society, and\nmarginalise the vita contemplativa (XXI). Whereas melancholy in the seven-\nteenth century was worldly and internal to the social system that it served to\nstabilise (74), the melancholic of the eighteenth century – particularly but not\nsolely in Germany – was excluded from political power (83). Though his melan-\ncholy was a reaction to this political disenfranchisement, it strove to conceal its\nown origins by positing the individual psyche as the cause of the melancholy\n(84–5). Lepenies points to the recurrence of a melancholy response to political\nsetbacks in German history. He draws explicit parallels between the melancholy\nof the eighteenth-century German bourgeoisie, for whom political power failed\nINTRODUCTION\n5\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 5 Phil's G4 Phil's G4:Users:phil:Public: PHIL'S\nto keep pace with economic emancipation, and the post-war Federal Republic’s\nreaction to the moral and political catastrophe of Nazism (83–4). This tradition\nhas been extended by Peter Morgan to encompass the left’s response to the\nfailures of 1968, and he sees Sebald as a belated and extreme example of this\ndefining linke Melancholie or leftist melancholy (2005: 89). There are numer-\nous other correspondences between Lepenies’ bourgeois melancholic and the\nSebaldian narrator, foremost among them being the tendency to flânerie as a\nway of protesting (albeit vainly) against commodification, and the elevation of\nnature to the status not only of a refuge (1998: 135), but of a mute recipient of\nthe melancholic’s emotional investments and projections (108). Like memory,\nthen, melancholy is an aspect of Sebald’s texts that might appear to be irre-\nducibly individual or psychological, but once historicised emerges as one more\nelement in a wider exploration of modernity.\nIntimately related to the question of nature is that of Heimat, that untrans-\nlatable German word that basically means home, the place in which one is born\nand grows up and to which one feels a particular affinity. As most commenta-\ntors note, the discourse of Heimat as it developed in the late nineteenth and\nearly twentieth centuries was structured around a series of binary oppositions\nthat:\nset country against city, province against metropolis, tradition against\nmodernity, nature against artificiality, organic culture against civilization,\nfixed, familiar, rooted identity against cosmopolitanism, hybridity, alien\notherness, or the faceless mass. (Boa and Palfreyman 2000: 2)\nIndeed, the tradition-modernity binary actually subsumes the other pairings;\nHeimat-discourse is a product of modernity.11 The notion of Heimat is, of\ncourse, dependant on its opposite and other, namely ‘die Fremde’ – the strange,\nforeign, geographically removed.12 Sebald’s peripatetic narrators repeatedly\nencounter new places, people and things. Their penchant for walking links\nthem with the flâneur, that emblematic figure of urban modernity who, in his\nBenjaminian incarnation, responds to the rise of early commodity culture\nexemplified by the Parisian arcades, and to other features of urban life: the\nmass, alienation, the need to develop a shorthand form of making sense of fleet-\ning urban encounters.13 But Sebald’s walkers are not tied exclusively to the\nurban environment. Eluned Summers-Bremner (2004), for example, suggests\nthat Sebald’s narrators’ rural wanderings are an attempt to re-appropriate the\nlegacy of the Wandervogel movement from its ideological debasement in\nNazism. This movement originated in 1896, and its celebration of nature and\nof the human body’s own locomotion, together with its revival of folk-song,\ncan, like Heimat-discourse, be seen as a response to the forces of industrialisa-\ntion, urbanisation and mechanisation. As such, the Wandervögel were a late\nmanifestation of a longer history of walking as leisure pursuit that had begun\nW. G. SEBALD – IMAGE, ARCHIVE, MODERNITY\n6\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 6 Phil's G4 Phil's G4:Users:phil:Public: PHIL'S\nwith the Romantics in the late eighteenth century and stemmed from precisely\nthe same motives (Solnit 2000: 83–4 and 104–17). Thus the modes of walking\nthematised in Sebald’s works – urban flânerie and Romantic rural wandering –\nare products of modernity. Sebald’s travelogues can be linked to modernity in\nother ways as well. Bianca Theisen, for example, sees Sebald’s work as follow-\ning a distinctively modern tradition of travel writing. She argues that the travel\ngenre shifts in the eighteenth century from being an object-orientated account\nproviding information about foreign countries and journeys to being a more\nclearly ‘fictional’, subject-orientated genre. This was facilitated by improved\ntransport infrastructure, improved safety, and the greater accessibility of travel.\nTravel literature no longer needed to communicate information; rather, it\ncouched travel experiences in personal reflections and awareness of a world\nthat was already mediated by literature (2004: 166).\nThis implies, of course, that eighteenth-century travel writing was deeply\nintertextual, and intertextuality is the final major field of Sebald research.14 If,\nas Gabriella Rovagnati (2005b: 146) claims, the practice of intertextuality is as\nold as literature itself and only the term is of recent provenance, intertextuality\nis clearly one area of investigation that ostensibly eludes the modernity prob-\nlematic. And yet it is possible to historicise intertextuality. One of the problems\naddressed by W. K. Wimsatt and Monroe Beardsley in their famous article ‘The\nIntentional Fallacy’ (1970) was the high degree of allusiveness demonstrated by\nmodernist poetry. This points to the emergence of a form of intertextuality in\nthe work of Eliot and Pound – but also Joyce, Roussel, Kafka, Borges and\nnumerous others – that was perceived as something new. Writing of painting,\nFoucault remarks that modernism was the first form of ‘museum art’ because it\nentertained a self-reflexive relationship to the tradition of painting and the insti-\ntutions of art. Indeed, paintings such as Manet’s Olympia acknowledge ‘the new\nand substantial relationship of painting to itself, as a manifestation of the exist-\nence of museums and the particular reality and interdependence that paintings\nacquire in museums’ (1977: 92). By thus thematising tradition in their paintings,\nthe impressionists demonstrated their profound allegiance to one of modernity’s\ncentral institutions. The same may be said of modernist writing: ‘Flaubert pro-\nduced the first literary work whose exclusive domain is that of books’ (92). The\ninstitutions of literature are, of course, different, but in an age that saw the wide-\nspread opening of public libraries, the professionalisation of criticism, and the\nemergence of vernacular literatures as university disciplines that were deeply\nbound up with the constitution of national identity,15 allusion in literature was\na way of building into the text one’s own relationship to the canon in a way that\ncould be appreciated only by those professionals in possession of sufficient\nknowledge to notice the allusions and of the power to grant access to the canon.\nSuch, I would argue, is the intertextuality of Sebald. It is an allusiveness aimed\nat academics and designed to ensure the works’ canonicity.\nINTRODUCTION\n7\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 7 Phil's G4 Phil's G4:Users:phil:Public: PHIL'S\nThere is more to the question of intertextuality than this. A further develop-\nment characteristic of modernity is the realisation that the self is constituted of\ndiscourses that lie beyond the confines of consciousness. This is articulated by\nthe German Romantics and finds its programmatic expression in Novalis’\nlaconic dictum ‘Das Ich ist eine Kunst, ein Kunstwerck’ [‘The self is an art, a\nwork of art’]. This is tantamount to the insight that literary subjectivity is a con-\nstruct, a notion that is foregrounded time and time again in the literature of the\nnineteenth and, more conspicuously, the twentieth century. The deployment of\nintertextuality in Sebald’s works is clearly indebted to this Romantic tradition,\nbeginning with Vertigo and The Emigrants, whose narrators and protagonists\n‘must continuously confront the “truth” that [their] consciousness is insep-\narable from the endlessly reiterated narrative patterns of Western literature’\n(Kilbourn 2006: 63), and reaching an apotheosis in the figure of Jacques\nAusterlitz, the fabric of whose entire existence consists of references and allu-\nsions to other writers, philosophers and historians. In its use as both a guaran-\ntee of canonicity and a mode of subject-formation, intertextuality can be seen\nas a further continuation of the engagement with modernity that exists else-\nwhere in Sebald’s work.\nWherever one looks in the literature on Sebald, then, one is confronted with\ntopoi that are ineluctably and inextricably connected to the problems of moder-\nnity. In saying this, I do not wish to suggest that existing criticism on Sebald is\nmisguided or irrelevant. My point is rather that modernity is a concern that per-\nmeates Sebald’s writings, and the various themes that dominate Sebald schol-\narship testify, in symptomatic fashion, to this wider problematic.\nThis book offers an account of Sebald’s relationship to modernity. My central\nfocus is the (photographic) image and the archive. As I argue in more detail\nbelow, these are so central both to modernity and to Sebald’s narrative project\nthat they facilitate a wide-ranging exploration of modernity in Sebald’s work\nand allow me to touch – sometimes directly, sometimes tangentially – on all the\ncritical concerns mentioned above. Furthermore, it will emerge that the very\nstructural and formal properties of Sebald’s writing are themselves governed by\nan archival logic that can be understood only in relation to the problem of\nmodernity.\nMODERNITY AND THE ARCHIVE\nOne of the most striking and memorable moments in W. G. Sebald’s oeuvre\noccurs towards the end of Austerlitz, when the protagonist launches an attack,\nsimultaneously vituperative and comic, on the new Bibliothèque Nationale in\nParis. He comes to the conclusion that the more perfect a system of informa-\ntion storage and retrieval is designed to be, the more likely this perfection is to\nflip over into chronic dysfunction and constitutional susceptibility to collapse\n(A 392–3\/395). And yet the new Bibliothèque Nationale is built on the site of\nW. G. SEBALD – IMAGE, ARCHIVE, MODERNITY\n8\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 8 Phil's G4 Phil's G4:Users:phil:Public: PHIL'S\na Nazi facility for the cataloguing and ‘redistribution’ of goods confiscated\nfrom Parisian Jews. This was itself a vast archival enterprise, and foregrounds\nthe close connection between archives and power.\nFor Sebald, who spent much of his professional life reading and writing\nabout Austrian literature, the theme of the archive as a site of both power and\nmalfunction will have been intimately familiar. The supreme example comes\nfrom an episode in Kafka’s The Castle, in which the protagonist K. visits an offi-\ncial of the castle bureaucracy in order to find out more about his duties as a\nland surveyor.16 The gouty and bed-ridden official orders his wife Mizzi to help:\nThe woman opened the cabinet at once. K and the Superintendant looked\non. The cabinet was crammed full of papers. When it was opened two\nlarge packages of papers rolled out, tied round in bundles, as one usually\nbinds firewood; the woman sprang back in alarm. ‘It must be down below,\nat the bottom’, said the Superintendant, directing operations from the\nbed. Gathering the papers in both arms the woman obediently threw them\nall out of the cabinet so as to read those at the bottom. The papers now\ncovered half the floor. ‘A great deal of work is got through here,’ said the\nSuperintendant nodding his head, ‘and that’s only a small fraction of it.\nI’ve put away the most important pile in the shed, but the great mass of\nit has simply gone astray’. (1992: 62)\nSylvio Vietta, who begins his book on modern German literature by quoting\nthis passage, sees the image of administrative and epistemological chaos as an\nimage of the modern, ein Bild der Moderne. Vietta notes that in Kafka, all\nattempts at transmitting information and attaining knowledge tend to degen-\nerate into the chaotic and labyrinthine. The representation of cognitive situ-\nations that become increasingly confused is, he argues, typical of the literature\nof the modern age, from the late eighteenth century to the present. It is a liter-\nature dominated by a profound sense of epistemological and linguistic crisis, in\nwhich the apprehension of any kind of totality is impossible, and the fragment\nor detail all that remains (1992: 7–8).\nYet in its concentration on collapse and confusion, Vietta’s reading of Kafka\nremains one-dimensional, for the episode he analyses attests, too, to another\naspect of modernity, namely the assumption that contingency and uncertainty\ncan be managed through the error-free functioning of the administrative appar-\natus. The Superintendant tells K. the ‘unpleasant truth’ that the community has\nno need of a land surveyor, but denies that his being summoned was in any\nway down to bureaucratic malfunction. The files themselves provide proof:\n‘ “[I]t was only certain auxiliary circumstances that entered and confused the\nmatter, I’ll prove it to you from the official papers,” ’ states the Superintendant\n(64). ‘ “It is a working principle of the Head Bureau that the very possibility of\nerror must be ruled out of account. This ground principle is justified by the\nINTRODUCTION\n9\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 9 Phil's G4 Phil's G4:Users:phil:Public: PHIL'S\nconsummate organization of the whole authority, and it is necessary if the\nmaximum speed in transacting business is to be attained” ’ (66). The self-\nunderstanding of modernity itself is based not on a pervasive sense of episte-\nmological chaos, but on an unbroken faith in the rationality of the archive.\nA third facet of modernity also emerges from K.’s experiences in the house of\nthe Superintendant, and that is the tendency of the apparatus to take on a life\nof its own and to function without human agency. If, for example, a case has\ndragged on for a long time, it sometimes happens that an arbitrary decision is\nsuddenly reached. ‘ “It’s as if the administrative apparatus were unable any\nlonger to bear the tension, the year-long irritation caused by the same affair –\nprobably trivial in itself – and had hit upon the decision by itself, without\nthe assistance of the officials,” ’ explains the Superintendant (70). In Sebald’s\nexample, the ludicrous lengths to which a visitor has to go in order to gain\nentrance to the Bibliothèque Nationale (A 386–91\/388–95) partly involve\ntransfer from one level of the library to another by means of a moving walkway,\nthe German Förderband (conveyor belt) demonstrating by its proximity to\nFließband (production line) (and by the fact that in Duden’s definition a\nFörderband is designed to carry goods, not people) the similarity of the library\nto processes of industrial production. This inversion, according to which\nhumans become subservient to the demands of the apparatus, dramatises an\naspect of modernity that theorists from Marx to Foucault and beyond have\nsought to comprehend, namely the role of the apparatus in the constitution of\nthe modern subject.\nWhat we encounter in both the inhuman monumentality of Sebald’s\nBibliothèque Nationale and the shambolic amateurishness of Kafka’s filing\ncupboard is a series of ambivalences that lie at the heart of cultural responses\nto modernity. On the one hand, there is an acknowledgment of modernity’s\ndrive towards rationalisation, bureaucratisation and documentation across a\nlarge and expanding range of human activity. On the other hand, there is a\nsense that these processes tend to subject individuals to the exigencies of the\napparatus, which in turn produces effects of subjectivity that may be more or\nless negatively evaluated. Furthermore, the archival apparatus has in both\ncases expanded to such an extent that it exceeds the cognitive capacity of any\nsingle individual fully to apprehend it. Increasing rationalisation thus para-\ndoxically gives rise to a perception of precisely the confusion and epistemo-\nlogical chaos to which Vietta refers. One of the recurring thematic emphases\nin accounts of modernity, from Baudelaire and Marx to David Harvey, is that\nprocesses of rationalisation are experienced as flux, ephemerality, instability,\ndisorientation and fragmentation. Though it may be a lousy translation\nof Marx’s dictum ‘alles Ständische und Stehende verdampft’, the title of\nMarshall Berman’s book (1988) neatly sums up the sentiment: All that is Solid\nMelts into Air.17\nW. G. SEBALD – IMAGE, ARCHIVE, MODERNITY\n10\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 10 Phil's G4 Phil's G4:Users:phil:Public: PHIL'\nIn this book, I trace the ways in which these ambivalences manifest them-\nselves in Sebald’s work. Following Sebald (who is himself following Kafka), I\nexplore these problems with reference to the archive. As a political technology,\nan epistemological technology, and a technology of representation, the archive\nis one of modernity’s signature artifacts. Mary Ann Doane (2002) argues that\nmodernity is characterised by a generalised ‘archival desire’, a desire to which\na large range of institutions and recording technologies responded. Michel\nFoucault, too, identifies the archival idea as a distinctly modern phenomenon,\nnoting that:\nthe idea of accumulating everything, the idea of constituting a sort of\ngeneral archive, the desire to contain all times, all ages, all forms, all tastes\nin one place, the idea of constituting a place of all times that is itself\noutside of time and protected from its erosion, the project of thus organ-\nising a sort of perpetual and indefinite accumulation of time in a place that\nwill not move – well, in fact, all of this belongs to our modernity.\n(Foucault 2000: 182)18\nThe archive also lies at the very heart of Sebald’s narrative project. His work is\nprofoundly concerned with the material and infrastructural basis of knowledge\nsystems, and his narrators spend an inordinate amount of time in museums and\ngalleries, libraries and archives, zoos and menageries. They betray a fascination\nwith timetables, inventories, ledgers, albums, ships’ logs, atlases, newspapers,\ndiaries, letters and photographs. In short, they are obsessed with processes of\narchivisation and with the places where the past has deposited traces and frag-\nments that have been preserved and in many cases systematised, catalogued, or\nindexed.\nMy use of the word ‘archive’ is deliberately broad. Media theorist Wolfgang\nErnst is at pains to distinguish the archive proper from the museum and library\non the one hand, and, on the other, from the metaphorical extension of the term\nsuch as one finds in recent French philosophy. For Ernst, who is deeply indebted\nto a specifically German form of Archivwissenschaft, the archive is first and\nforemost a juridico-political instrument of state administration. He sees it as\nnon-narrative (and at times even non-discursive), and opposes it to the use of\narchives by historians which, he argues, constitutes a misreading and misuse of\nthe archive proper (2002: 8). Ernst repeatedly makes the point that archives\nbecome available to the historian once their immediate political functionality\nis lost: ‘It is precisely at the point where there is no longer a connection between\nthe documents and power that the archive is opened and the work of the his-\ntorian begins, retroactively’ (8). While his later book Im Namen von Geschichte\ntraces the encroaching influence of the idea of the nation and the demands\nof historiography on archival practice (2003: 594–615), Ernst discusses the\narchive almost exclusively on the level of the state. There are two fundamental\nINTRODUCTION\n11\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 11 Phil's G4 Phil's G4:Users:phil:Public: PHIL'\nproblems with this approach. The first is that it is narrow and normative, and\nproves incapable of accounting either for archival practices and institutions\nthat exist below the level of the state or for other modes of storage and tax-\nonomy that share in an archival epistemology. The second is that Ernst’s con-\nception of power is monolithic and naïve. The notion that the relationship\nbetween archives and power disappears the moment archival material is no\nlonger of instrumental use to a particular state neglects the fact that, as Foucault\nhas shown, modes of knowledge are implicated in power relationships that\ncannot be reduced to a top-down model of state prohibition. What is needed is\na concept of the archive that acknowledges the vast plurality of archival prac-\ntices that emerge in modernity, and an understanding of power that might\naccount for their biopolitical functioning.\nThe term ‘archive’ as used here thus encompasses a wide range of institutions\nand practices that are linked by several fundamental defining qualities. Jacques\nDerrida’s Archive Fever, while not without its problems (as we shall see at\nseveral points throughout this study), begins with a meditation on what con-\nstitutes an archive by linking the word to its etymology in the archeion, the\noffice of the archons or chief magistrates of ancient Athens. Derrida posits an\n‘archontic function’, which unites the right to interpret archival documents (‘to\nspeak the law’) with a place of domiciliation and the provision of a stable sub-\nstrate for the archive (1995: 2). But he goes on to note that this archontic power\n‘also gathers the functions of unification, of identification, of classification’ and\nwhat he calls ‘consignation’ or gathering together (3). Derrida’s concern with\nFreud in Archive Fever saddles him with a psychoanalytic conception of power\nas prohibition or patriarchal law. This is again excessively monolithic. The\nother aspects of Derrida’s definition of the archontic function, however,\nrespond precisely to the need for a more inclusive notion of the archive. If\nthe archive is defined not by immediate etatist functionality but by the princi-\nples of unification, identification, classification and gathering, then clearly\nmuseums, libraries, and all kinds of collection fall within its purview.\nIt is true that the modern public archive came into being in order to ‘solidify\nand memorialise first monarchical and then state power’ (Steedman 2001: 69).\nMore importantly, archives emerged as part of the modernising state: the House\nof Savoy instituted an archive in Turin in the early eighteenth century, followed\nby Peter the Great in St Petersburg in 1720 and Maria Theresia in Vienna in\n1749. The 1760s and 1770s saw the establishment of princely and civic\narchives in Warsaw, Venice and Florence, while the National Archives in France\nwere founded in 1790, and the British Public Records Office in 1838 (69). And\nyet state archives represent just one of numerous institutions, practices and\ntechnologies that characterise modernity’s obsession with collecting, preserving\nand classifying. Many (though by no means all) of these ended up serving the\ninterests of the expanding nineteenth-century state, but they did so not on the\nW. G. SEBALD – IMAGE, ARCHIVE, MODERNITY\n12\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 12 Phil's G4 Phil's G4:Users:phil:Public: PHIL'\nbasis of a global or unitary strategic co-ordination, but as a result of myriad\nlocalised, tactical deployments of power.\nThis terminology is, of course, borrowed from Foucault (1980: 142),19\nwhose account of the relationship between power and knowledge provides, I\nbelieve, the most powerful approach to the study of practices and institutions\nof collection, taxonomy, archivisation and display in modernity.20 In his later\nwork, Foucault develops what he calls an ‘analytic of power’, a term designed\nto distinguish his mode of descriptive analysis from theory as such. In\nDiscipline and Punish (1979), volume one of The History of Sexuality (1990),\nand a series of shorter writings and interviews, he traces the ways in which trad-\nitional forms of sovereignty, based on centralised juridical (i.e. monarchical or\nprincely) power, become dispersed in the later eighteenth and early nineteenth\ncenturies, proliferating along new pathways and entering into new relation-\nships. In a discussion of Machiavellian notions of the art of governing, Foucault\nargues that in the case of juridical power the prince represents a transcendent\nprinciple, and that the state functions in circular fashion to maintain and extend\nthe power of the prince. Governmental power, on the other hand, takes as its\nobject individuals and populations, and seeks to control and harness them to a\nvariety of ends whose legitimacy derives from sources external to the self-\nserving calculation of juridical power (2002b). Foucault sums up these differ-\nences as follows:\nFrom the idea that the state has its own nature and its own finality, to the\nidea that man is the true object of the state’s power, as far as he produces\na surplus strength, as far as he is a living, working, speaking being, as far\nas he constitutes a society, and as far as he belongs to a population and\nan environment, we can see the increasing intervention of the state in the\nlife of the individual.21\nHowever, this kind of state intervention differs in fundamental ways from the\noperation of juridical power. While the latter functioned through edicts, laws\nand promulgations supported by whatever means of coercion and enforcement\nthe prince could command, governmental power works through highly differ-\nentiated tactics for manipulating behaviour in specific desired directions. ‘The\neighteenth century’, writes Foucault, ‘invented . . . a synaptic regime of power,\na regime of its exercise within the social body, rather than from above it’ (1980:\n39). Foucault labels this specifically modern form of power ‘power\/knowledge’,\n‘disciplinary power’, or ‘biopower’, terms that designate a reorganisation of\nrelations between knowledge, power and the body. His account thus concerns\nitself with ‘the point where power reaches into the very grain of individuals,\ntouches their bodies and inserts itself into their actions and attitudes’ (39). For\nan example of such a transformation in the techniques of power, we need look\nno further than the work of Sebald himself. In the final chapter on sericulture\nINTRODUCTION\n13\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 13 Phil's G4 Phil's G4:Users:phil:Public: PHIL'\nin The Rings of Saturn, the narrator juxtaposes, in good Foucauldean fashion,\na monarchical and a governmental approach to the development of a German\nsilk industry. He notes that in the eighteenth century, orchestrated attempts by\nthe rulers of the German states to establish such an industry by decree were\ndoomed to failure. Writing in 1826, just a few years after the final collapse of\nthis enterprise, one Josef von Hazzi published a treatise on sericulture in which\nhe attributes this failure to ‘authoritarian management, endeavours to create\nstate monopolies, and an administrative system that buried any entrepreneur-\nial spirit under a quite risible pile of regulations’ (RS 290\/343). Von Hazzi goes\non to advocate the quasi-organic development of sericulture in the domestic\nsphere as a way of rendering economically productive all those normally\nexcluded from labour: children and women, domestic servants, the elderly and\nthe poor. This, he added, would not only increase Germany’s international com-\npetitiveness, but would contribute to the moral improvement of the population\nby disciplining those not used to work (RS 290\/343). One could hardly wish\nfor a better illustration of power exercised ‘within the social body, rather than\nfrom above it’.\nAs Foucault makes clear, the exercise of disciplinary power depends on\nseveral interrelated factors. Bodies can be rendered docile by voluntary sub-\nmission to explicit regulations, but in disciplinary power, such regulations are\nbolstered by a series of other techniques that include the distribution of bodies\nin space; constant surveillance, observation, registration and examination; and\nthe consequent accumulation of a vast documentary apparatus bearing infor-\nmation about individuals. Power thus conceived is not purely repressive; it is\nalso productive. In the first instance, clearly, it serves to produce a ‘docile [body]\nthat may be subjected, used, transformed and improved’ (1979: 136) – a means\nof extending the body’s economic utility while reducing its capacity for\ndisobedience (138). Beyond this, however, disciplinary power produces certain\n‘subjectivity effects’. These are related to two fundamental technologies that\ntake centre stage in Foucault’s work: panopticism and confession.\nIn Discipline and Punish, Foucault adduces the example of Jeremy Bentham’s\npanopticon. The panopticon consists of a central tower encircled by an annular\nbuilding divided into cells that extend the entire depth of the building and have\nwindows facing inwards towards the tower and outwards to allow light to cross\nthe cell from one side to the other. The consequent effect of backlighting allows\nan observer installed in the central tower to observe those shut up in the cells.\nThe cells ‘are like so many cages, so many small theatres, in which each actor\nis alone, perfectly individualized and constantly visible’ (1979: 200). The effect\nof the panopticon is:\nto induce in the inmate a sense of conscious and permanent visibility that\nassures the automatic functioning of power. So to arrange things that the\nW. G. SEBALD – IMAGE, ARCHIVE, MODERNITY\n14\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 14 Phil's G4 Phil's G4:Users:phil:Public: PHIL'\nsurveillance is permanent in its effects even if it is discontinuous in its\naction; that the perfection of power should tend to render its actual exer-\ncise unnecessary; that this architectural apparatus should be a machine\nfor creating and sustaining a power relation independent of the person\nwho exercises it; in short that the inmates should be caught up in a power\nsituation of which they themselves are the bearers. (201)\nIn order to achieve this, the inmate must know that he is observed even though\nthere is no need that he actually is observed; indeed, the inmate must never know\nwhether or not he is being observed, but must always be aware that he may\nalways be so. This is the essence of panopticism, a disciplinary regime that is\nillustrated in paradigmatic fashion by the panopticon. Power becomes both indi-\nvidualised and automatised, embodied not in a person but in ‘a certain concerted\ndistribution of bodies, surfaces, lights, gazes; in an arrangement whose internal\nmechanisms produce the relation in which individuals are caught up’ (202).\nPanopticism thus forces the subject to internalise relations of power, leading\nto a level of self-surveillance and self-policing that renders the use of overt coer-\ncion largely unnecessary.22 Furthermore, it allows knowledge to be gathered\nabout individuals through the process of observation. Commenting on this\naspect of Foucault’s work, Dreyfus and Rabinow write:\nNot only has power introduced individuality in the field of observation,\nbut power fixes that objective individuality in the field of writing. A vast,\nmeticulous documentary apparatus becomes an essential component of\nthe growth of power . . . The modern individual – objectified, analyzed,\nfixed – is a historical achievement. There is no universal person on whom\npower has performed its operations and knowledge, its inquiries. Rather,\nthe individual is the effect and object of a certain crossing of power and\nknowledge. He is the product of complex strategic developments in the\nfield of power and the multiple developments in the human sciences.\n(1983: 160)\nFoucault’s primary examples are drawn for the most part from French military,\neducational, medical and penal establishments of the eighteenth and nineteenth\ncenturies, and their related disciplines: psychiatry, criminology, clinical medi-\ncine. But the salient disciplinary techniques he identifies, and the configuration\nof power within which they operate, provide a highly fruitful framework for\nthe study of a wide variety of other practices and institutions that bear directly\non the subject of this study, namely modernity, the image and the archive in the\nwork of W. G. Sebald.\nIn the first volume of the History of Sexuality, Foucault extends his investi-\ngation of power to the sphere of sexuality. He denies that it is a realm of authen-\ntic and natural expression that is external to and threatened by power, and\nINTRODUCTION\n15\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 15 Phil's G4 Phil's G4:Users:phil:Public: PHIL'\nreconfigures it in terms of what he calls the dispositif of sexuality.23 The more\none seeks sexual emancipation and proclaims the ‘truth’ about sexuality, he\nargues, the more one becomes involved in the discourse of sexuality. This dis-\ncourse is supported by the technology of confession, which Foucault sees as a\ncentral component in the expanding apparatuses for the discipline and control\nof bodies and populations that emerge in modernity:\nThe confession has spread its effects far and wide. It plays a part in justice,\nmedicine, education, family relationships, and love relations, in the most\nordinary affairs of everyday life, and in the most solemn rites; one con-\nfesses one’s crimes, one’s sins, one’s thoughts and desires, one’s illnesses\nand troubles . . . One confesses in public and in private, to one’s parents,\none’s educators, one’s doctor, to those one loves; one admits to oneself, in\npleasure and in pain, things it would be impossible to tell anyone else, the\nthings people write books about. One confesses – or is forced to confess.\n(1990: 59)\nIt is not, however, merely the act of confession that enmeshes the subject\nwithin relations of power; it is that self-examination is tied to myriad institu-\ntions and practices of social control. Specifically, a range of medical, psychi-\natric and legal institutions and moral doctrines support the notion that\nself-examination and confession of one’s (primarily sexual) thoughts lead to the\ndiscovery of the truth about the self. Thus the confession inscribes selfhood\nwithin a network of power relations with those whose possession of the keys\nto interpretation endows them with the authority to articulate the truth of these\nconfessions. Like panopticism, confession entails a massive mise en discours\nand a set of procedures for recording the intimate impulses of the self. The\nquantity of diaries, memoirs and agendas that frequently furnish the material\nof Sebald’s narratives show that confession is not only a central aspect of\nSebald’s work, but is inseparable from archival technologies.\nAnd yet despite the discursive overlaps between Sebald and Foucault, and\ndespite the numerous allusions to Foucault in Sebald’s work, the representation\nof the archive in Sebald is not reducible to an illustration of Foucault’s theses\non power\/knowledge. Indeed, Sebald’s reception of Foucault is characterised by\na thoroughgoing ambivalence that emerges clearly in his critical writings.24\nThese demonstrate a sustained engagement with Foucault at a point when\nFrench theory had yet to make any significant impact on German studies in\nBritain, but evince also a desire to escape the totalising account of power that\nFoucault offers.25 The following quotations come from Sebald’s first collection\nof essays on Austrian literature, Die Beschreibung des Unglücks:\nWhoever fails to accommodate himself to the system feels persecuted and\nsurrounded by rules and prohibitions. ‘The world is a single, monstrous\nW. G. SEBALD – IMAGE, ARCHIVE, MODERNITY\n16\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 16 Phil's G4 Phil's G4:Users:phil:Public: PHIL'\njurisprudence. The world is a prison!’ says a so-called madman in Thomas\nBernhard. He knows what he’s talking about. The prison is a panoptic\nconstruction. The guard in the tower always has the inmates within his\nfield of view without having to leave his seat. Beyond its control function,\nprison architecture embodies the system of the order of surveillance.\nThose who are hunted feel nothing so painfully as permanent observa-\ntion . . . In Kafka’s Trial verbs like to glance, see, be seen, look up, look\nat, look around, observe, attract the gaze of others, follow with one’s eyes\nand similar occur with remarkable frequency. Josef K. knows that he is\neverywhere exposed. The eye of God has proliferated. The eye of the law\nsends its agents through the streets, and in the totalitarian regime that\nKafka saw on the horizon everyone is called upon to spy on his neighbour.\nThe system of power is thus not only one of hierarchisation but of cont-\niguity. It proliferates downwards, conquers the foundations, spreads lat-\nerally, so that escape becomes impossible. (BU 96–7)\nFoucault set out the fundamental ambivalence in the discourse on sex,\nwhich in the verbal elaboration of sentiment not only enables the eman-\ncipation of sexuality, but, in the very same process, brings it under more\nprecise social control through the claims of pastoral, psychological, jurid-\nical, and psychiatric interests. (BU 39–40)\nIn the first quotation, Sebald might initially appear to appropriate Foucault’s\nanalytic of power wholesale. And yet closer inspection reveals that Sebald’s\nreading of Foucault significantly reduces the radical force of the latter’s theses.\nFirstly, Sebald reinstals the law, as a secular representative of the divine, as a\nsource of prohibition and the organising authority behind all systems of sur-\nveillance. Secondly, human subjectivity is clearly conceived as something that\nexists outside the disciplinary apparatus, rather than being constituted by it.\nFinally, Sebald understands the lateral extension of power through panopticism\nas a feature of totalitarian regimes, whereas Foucault expends considerable\nenergy demonstrating that democratic government operates precisely through\nthese mechanisms. The second quotation, too, betrays a somewhat tendentious\nreading of Foucault. In the first volume of the History of Sexuality, Foucault\nseeks to counter the thesis of sexual emancipation that Sebald puts forward\nhere. As we have seen, Foucault argues that the notion of sexuality as an authen-\ntic realm of expression that power seeks to restrict and control is an illusion\nthat is fostered by the dispositif of sexuality itself. The more one seeks sexual\nemancipation and proclaims the ‘truth’ about sexuality, he argues, the more one\nimplicates the self within institutional structures of power\/knowledge. The\nquasi-dialectical relationship between sexual emancipation and social control\nthat emerges from Sebald’s gloss turns out to be precisely the ‘repressive hypoth-\nesis’ that Foucault rejects.\nINTRODUCTION\n17\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 17 Phil's G4 Phil's G4:Users:phil:Public: PHIL'\nThese essays from Die Beschreibung des Unglücks testify to a remarkable\ndegree of intellectual coherence on Sebald’s part, for in a 1975 essay on Peter\nHandke’s play Kaspar, he articulates similar views on the relationship between\ndiscipline and subjectivity.26 The essay is preceded by an epigraph from\nFoucault’s Madness and Civilisation that deals with the problem of recon-\nstructing the history of madness in the light of the fact that the images and fan-\ntasies of the mad have never been recorded for posterity. The tenor of much of\nthe essay, however, is more closely related to Discipline and Punish, even\nthough it is unlikely that Sebald would have read that work before writing his\npiece on Kaspar, since both appeared in the same year. Nevertheless, it is clear\nthat from this relatively early stage in his career, Sebald was concerned with the\nway in which power is written on the body. So, for example, he notes that the\nfigure of Kaspar in Handke’s play appears to perform the actions of a clown,\nbut whereas clowning is the intentional performance of incompetence and\ntherefore funny, Kaspar’s clownish antics are unwilled, and he soon learns to\navoid mishaps (which the clown, of course, does not). Sebald goes on to argue\nthat Kaspar internalises this clownish behaviour, with the result that what\nappears to be progress – namely his increasing ability to function as a compe-\ntent social being – is in fact ‘nothing but the gradual humiliation of a trained\ncreature’ (CS 60\/61). The final word in the German is ‘der Dressierte’, one who\nhas been fully trained to perform certain tasks or actions. It is frequently used\nin the German translation of Discipline and Punish to refer to the production\nof docile bodies. The big difference between Sebald and Foucault is that the\nformer can conceive of ‘Dressur’ only in terms of humiliation. For Sebald, dis-\ncipline merely distorts subjectivity; it possesses no productive aspect.\nThe concern with power, subjectivity and the body that emerges in the\nKaspar essay suggests one reason for Sebald’s eager reception of Foucault’s late\nwork. But the notion of the pristine subject not yet distorted by socially\nimposed models of behaviour, which emerges clearly in this essay, might also\naccount for the profound ambivalence towards Foucault’s work that we find\nelsewhere in Sebald’s critical writings. On the one hand, he adopts Foucauldean\nterminology and appears to align himself with Foucault’s analysis of power. On\nthe other, he nevertheless continues to operate with an implied notion of sub-\njective autonomy that Foucault’s work sought to invalidate. It is this ambiva-\nlence that determines the structure of this book. In Part I, I pursue a largely\nFoucauldean agenda in investigating the ways in which the image and the\narchive in Sebald’s work are implicated in structures of power\/knowledge and\nproduce the corresponding subjectivity effects, though I am also attentive to the\nways in which such structures are critiqued, undermined or circumvented.\nLooking first at museums and collections, then at photography, and finally at\nvarious disciplinary images and archives, I explore the contribution of these dis-\nciplinary structures to the construction of the subject within Sebald’s four main\nW. G. SEBALD – IMAGE, ARCHIVE, MODERNITY\n18\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 18 Phil's G4 Phil's G4:Users:phil:Public: PHIL'\nprose narratives: Vertigo, The Emigrants, The Rings of Saturn and Austerlitz.\nThe analysis in Part I is primarily thematic, and offers an overview of the\narchive as a constant focus of Sebald’s texts in order to do justice to the high\ndegree of thematic coherence evinced by his work. In Part II, I offer differenti-\nated analyses of each of Sebald’s major prose works in turn. The focus remains\non the image, the archive and their relationship to power in modernity, but I\nexpand the terms of reference to include the narratological dimension of\nSebald’s work. In so doing, I examine the extent to which Sebald’s narratives\noffer possibilities for resisting modernity’s disciplinary imperatives.\nIn Chapter 5, on Vertigo, I examine the ways in which the text thematises a\nspecifically modern abdication of subjective interiority to a series of mnemotech-\nnical supplements. The effect of this is to fragment experience and problematise\nthe relationship between individual episodes and the narrative totality. The task\nfaced by the narrator is to discover or construct a narrative and epistemological\nmodel that will allow the disparate elements of experience to coalesce into a more\nmeaningful whole. The hidden correspondences that he establishes between\nostensibly isolated events represent the moment when the rationality of archival\nepistemology flips over into magic, constituting the topography of the text\nin terms of wonder and thereby promoting an anti-disciplinary perception of\nmodernity. In my reading of The Emigrants (Chapter 6), I turn my attention to\nthe family archive and in particular the family album. In Foucault-inspired writ-\nings on family photography, the emphasis is on the production of bourgeois sub-\njectivity and the reproduction of the ideology of the nuclear and extended family.\nCritical studies of domestic photography have thus tended to dwell on the disci-\nplinary aspects of the practice and its participation in a fundamentally panoptic\nprocess of self-surveillance. While never fully denying the disciplinary aspects of\nphotography, The Emigrants undertakes a rehabilitation of the family album and\ndomestic photography. Furthermore, in its very structure – which relies exten-\nsively on metaphorical similarity – it constitutes the text itself as an archival space\nof preservation and stability amid historical flux and subjective trauma.\nIn Chapter 7, on The Rings of Saturn, I continue this investigation into the\narchival nature of the text. By wandering without maps, and exploring the\nempty spaces that the map deems functionally irrelevant, Sebald’s narrator\ndemonstrates a desire to escape the biopolitical effects of modernity’s archives,\nof which the map is emblematic. This wandering goes hand in hand with a\npoetics of digression. The rejection of modern modes of transport in favour of\nwalking and the rejection of an easily consumable text in favour of digression\ncan be seen as complementary components in Sebald’s critique of modernity.\nAnd yet this critique can take place only from within the very structures against\nwhich it seeks to rebel. The only way in which dilatoriness can be prevented\nfrom degenerating into complete incoherence in The Rings of Saturn is through\nthe adoption of an archival structure for the text itself, as episodes follow on\nINTRODUCTION\n19\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 19 Phil's G4 Phil's G4:Users:phil:Public: PHIL'\nfrom each other not on the basis of causality or narrative logic, but on the basis\nof similarity. The archive, then, can be seen to contain the possibility of mean-\ninglessness or incoherence, and yet it also represents the intrusion of a tech-\nnology of modernity into the very fabric of a text that seeks to resist it.\nAusterlitz forms the subject of Chapter 8, and involves in many respects the\nmost complex treatment of the archive. The protagonist spends his academic\ncareer amassing compendious architectural knowledge as a form of compensa-\ntion for his own lost memories of his past. The archive here thus replaces\n‘authentic’ memory as a kind of ‘prosthesis of the inside’ (Derrida). And yet the\nputatively authentic memory that Austerlitz seeks to retrieve also emerges as\nexternal to the self, for its retrieval depends on the archives that he discovers in\nTheresienstadt and Prague. The archive is both a symptom of Austerlitz’s lack\nof memory and, at the moment of discovery that constitutes the provisional telos\nof the narrative, the resource of the cure. There is thus no escape: Austerlitz\nseems to represent an extreme example of a subject constituted entirely by the\narchive. At the same time, however, the archive remains always incomplete. At\nthe end of the text, Austerlitz sets off in search of his father, following traces that\nhe finds in a Parisian archive. The epistemological promise of the archive is never\nfulfilled, which is why it leaves the end of this particular text open and the sub-\njectivity of Austerlitz in a permanent state of incompletion.\nIn conclusion, I address the question of why the archives of modernity the-\nmatised in Sebald’s work originate largely not in the late twentieth, but in the\nlate nineteenth and early twentieth centuries. I argue that Sebald’s narrative\nproject borrows from the method of Foucault himself. Just as Foucault saw the\nkeys to understanding modern society in the developments of the eighteenth\nand nineteenth century, so Sebald sees the key to the contemporary world in\nstructures and technologies developed a century ago but whose effects – pace\nthose who argue that Sebald posits 1945 as the end of history – continue to be\nfelt. This in turn leads to a re-evaluation of Sebald’s view of history, and pos-\nition within literary history.\nNOTES\n1. This list is not, of course, exhaustive, but it does account for the vast majority of\nwritings on Sebald.\n2. The literature on modernity is multi-disciplinary and truly vast, with the inevitable\nconsequence that attempts to define it are bound to be partial and incomplete. In\nwriting this brief synthesis, I have drawn on Harvey 1990, Berman 1988, Kern\n1983, Hansen 1995, and Habermas 1988 and 1990.\n3. See, for example, Alvarez 2001, and the obituaries quoted in Fuchs 2004a: 11.\nSignificantly, Sebald himself explicitly rejected the epithet ‘exile’ in an interview\nwith Löffler 1997b: 131.\n4. See, for example, Crownshaw 2004, Duncker 2003, Duttlinger 2004, Garloff 2004,\nGunther 2006, Hall 2000, Pane 2005, Anne Parry 1997, Taberner 2004, Whitehead\n2004.\nW. G. SEBALD – IMAGE, ARCHIVE, MODERNITY\n20\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 20 Phil's G4 Phil's G4:Users:phil:Public: PHIL'\n5. As my argument in this study shows, I would add ‘historical’ to ‘geophysical and\nmetaphysical’.\n6. Anne Fuchs’ book Die Schmerzensspuren der Geschichte contains the most exten-\nsive and nuanced discussion of Sebald and memory (2004a). See also, for example,\nAtze 2005b, Bere 2001, Chandler 2003, Denneler 2000, Horstkotte 2005b,\nKilbourn 2004, Loquai 1995, Reineke 2003, Weber 1993, Witthaus 2006.\n7. In addition to works already cited, see Barzilai 2006, Boehncke 2003, Chaplin\n2006, Harris 2001, Horstkotte 2005a, Long 2003, Tischel 2006.\n8. Melancholy and loss constitute a dominant topos of photography studies. Siegfried\nKracauer’s essay ‘Die Photographie’ (Kracauer 1963), a foundational text of\nmodern photographic theory, opens with a meditation on the ability of photogra-\nphy to communicate a sense of irrevocably past time and bring about a melancholy\nrealisation of loss. Benjamin’s Kunstwerk essay is, as Ariella Azoulay notes, a\nmelancholy anticipation of the loss of aura of the artwork (2001: 18). More recent\ncritics, from Barthes to Marianne Hirsch, have persistently drawn on this aspect of\nthe photograph in their theoretical work.\n9. On Sebald and melancholy, see Bond 2004, Heidelberger-Leonard 2001, Löffler\n2003 and Santner 2006: 43–5 and 62–3.\n10. It should be noted, however, that Fritzsche is decidedly more optimistic about the\npossibilities of melancholy and nostalgia as historiographical modalities.\n11. On Sebald and Heimat, see Ecker 2006, Fuchs 2006a and 2004a: 109–63, Lobsien\n2004.\n12. In addition to the essays cited below, see the following on Sebald and travel: Bales\n2003, Beck 2004, Gregory-Guider 2005, Kastura 1996, Sill 1997b, and Zilcosky\n2004.\n13. See the section on the flâneur in Benjamin 1973: 35–66. Keith Tester’s volume The\nFlâneur (1994) offers interesting contemporary perspectives on the phenomenon.\nEspecially valuable are the essays by Shields (1994) and Bauman (1994).\n14. Intertextual approaches to Sebald are offered by Atze 1997b, Kilbourn 2006,\nKlebes 2004, Prager 2006, Schedel 2004, Sill 1997a, Steinmann 2006, Theisen\n2006. Since Sebald’s Arbeitsbibliothek has been made available to scholars, there\nhas been a proliferation of studies examining ‘Sebald and x’. See, for example, Atze\n2004, 2005a and 2005b, Rovagnati 2005a, Loquai 2005a. For a more traditional\npiece of ‘source criticism’, see Gasseleder 2005.\n15. The first chairs of German philology were established in Göttingen (1805) and\nBerlin (1807), in other words either side of the defeat and reorganisation of the\nGerman lands by Napoleon in 1806. These professorial posts can thus be seen as\npart of the massive effort to mobilise history and historical consciousness, particu-\nlarly that of the Middle Ages, in order to reconstitute symbolically the lost Holy\nRoman Empire, and foster a specifically German national consciousness. Central to\nthis enterprise was the Monumenta Germaniae historica, a collection of sources\npertaining to Germany in the Middle Ages (see Ernst 2003: 91–270). The first chairs\nof modern German literature were established in 1874 and 1877 in Berlin – once\nagain immediately after a major war with France, and once again as a form of sym-\nbolically bolstering the German nation. Similar developments can be witnessed,\nbelatedly, in Britain (see Eagleton 1981: 17–53).\n16. Sebald devoted two critical essays to The Castle, and as many critics have shown,\nhis works are saturated with explicit and implicit intertextual references to Kafka.\nIn addition to the Kafka episode discussed here, examples of malfunctioning\narchives can be found in Thomas Bernhard’s The Lime Works and Extinction,\nMusil’s The Man without Qualities, Norbert Gstrein’s Das Register, and many\nother works.\nINTRODUCTION\n21\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 21 Phil's G4 Phil's G4:Users:phil:Public: PHIL'\n17. Cf. Marx and Engels 1989: 23. See also Berman 1988: 16; Harvey 1990: 20–30;\nBenjamin 1973.\n18. My understanding of the archive is unrelated to Foucault’s eccentric definition of\nthe word in The Archaeology of Knowledge. Foucault’s concept of the archive turns\nout to have nothing to do with preservation, ordering and storage. On the contrary,\nit is the ‘system of enunciability’ that underlies and enables any given statement-\nevent. This concept of the archive, as the general system for the formation and trans-\nformation of statements, oscillates between language and corpus, between the\nlatency of what can be said, and the actuality of what is (2002a: 146). Foucault thus\n‘dematerialises’ the archive, and turns it into an abstract system. By contrast, I see\narchives as fundamentally material practices and institutions that participate in the\npower\/knowledge nexus explored by Foucault in his later work.\n19. In an interview with Jacques-Alain Miller and others, Foucault was repeatedly chal-\nlenged to clarify his ostensibly paradoxical thesis of a strategy without a subject.\nFoucault’s answers are not always entirely convincing or satisfactory (1980:\n202–4). However, the history of ethnographic collections offers one illustration of\nprecisely the mechanisms Foucault describes. A point that emerges forcefully from\nGlenn Penny’s book Objects of Culture: Ethnology and Ethnographic Museums in\nImperial Germany (2002) is that the science of ethnology, which came to be seen\nas the colonial discipline par excellence, in fact emerged from a set of diverse factors\nand interest groups that included scientists, civic associations, private patrons, col-\nlectors, dealers and museum visitors. Elizabeth Edwards’ analysis of archives and\nanthropological photography in Raw Histories: Photographs, Anthropology and\nMuseums (2001) concentrates on the ‘social biography’ of photographs. Edwards\nshows that rather than embodying a monolithic ‘colonial gaze’, collections of\nanthropological photographs often came together on an ad hoc basis, a serendipi-\ntous result of diverse networks of exchange whose purpose was often sociable\nrather than scientific or commercial. Any strategy underlying colonial representa-\ntion and display thus has to be seen as an ‘effect of finalisation’ (Foucault 1980:\n204), not as an origin.\n20. For Foucauldean accounts of museums, see, for example, Bennett 1995 and\nHooper-Greenhill 1992. On photographic archives, see Sekula 1992, Gunning\n1995, Tagg 1988, Maxwell 1999, and Lalvani 1996. On disciplinarity and vision\ngenerally see also Crary 1990 and 1999. On medical cultures of archiving and\ndisplay see McGrath 2002 and Cartwright 1995.\n21. Foucault, lecture delivered at Stanford University, Palo Alto, California, 1979,\nquoted in Dreyfus and Rabinow 1983: 138.\n22. One might think in this context of the CCTV cameras installed everywhere in\nBritain’s cities, on the roads, in public buildings of all kinds and even in private\nhouseholds. The startling proliferation of surveillance techniques in the UK has\nmade Foucault’s work more relevant than ever for an understanding of the func-\ntioning of social power.\n23. The French term dispositif designates what Dreyfus and Rabinow term a ‘grid of\nintelligibility’ (1983: 121). The English translation uses the word ‘deployment’,\nwhich is highly problematic in that it implies a degree of conscious agency from a\nhigher authority, rather than the emergence within the social body of an intelligible\nrelation between discourse and power.\n24. Though various critics have drawn attention to the potential importance of Foucault\nfor an understanding of Sebald’s work, there has as yet been no sustained attempt\nto evaluate the relationship between the two writers. I offer an initial approach to\nthis issue in Long 2006a. See also Santner 2006: 115, 181–4; Albes 2002: 296;\nJackman 2004: 461; Theisen 2004: 175; Öhlschläger 2006a: 111–26, 133–7.\nW. G. SEBALD – IMAGE, ARCHIVE, MODERNITY\n22\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 22 Phil's G4 Phil's G4:Users:phil:Public: PHIL'\n25. The totalising aspects of Foucault’s later thought have been criticised in particular\nfrom within feminism and Marxism. See, for example, Butler 1990, Hayles 1998,\nHabermas 1988, Jameson 1983 and 1991.\n26. Handke’s play is one of several Sprachstücke or ‘language plays’ that he wrote in\nthe 1960s. It concerns the protagonist’s acquisition of language and social integra-\ntion. The title is, of course, a reference to Kaspar Hauser, the foundling and ‘child\nof nature’ who turned up in Nuremburg in 1828. Though apparently a teenager, he\nhad no memory and the behaviour of a young child.\nINTRODUCTION\n23\nM994 SEBALD TEXT M\/UP.qxd  18\/9\/07  9:11 am  Page 23 Phil's G4 Phil's G4:Users:phil:Public: PHIL'\n"}