{"doi":"10.1177\/0021934710378747","coreId":"53710","oai":"oai:eprints.lincoln.ac.uk:2979","identifiers":["oai:eprints.lincoln.ac.uk:2979","10.1177\/0021934710378747"],"title":"Representation of Africa online: sourcing practice and frames of reference","authors":["Ogunyemi, Ola"],"enrichments":{"references":[{"id":830725,"title":"Agenda Setting’","authors":[],"date":"2009","doi":"10.1007\/978-3-322-90440-9_12","raw":"19Coleman, Renita, McCombs, Maxwell, Shaw, Donald & Weaver, David (2009) ‘Agenda Setting’ in Karin Wahl-Jorgensen & Thomas Hanitzsch (eds) The Handbook of Journalism Studies, pp. 147 - 160. New York: Routledge Deuze, Mark (2003) ‘The Internet and its journalisms: considering the consequences of different types of newsmedia online’, New Media and Society 5 (2), June: 203 – 30.","cites":null},{"id":829356,"title":"Alternative Journalism.","authors":[],"date":"2008","doi":"10.3366\/edinburgh\/9780748617692.003.0002","raw":"Atton, Chris & Hamilton, James F. (2008) Alternative Journalism. Los Angeles. Sage.","cites":null},{"id":830982,"title":"American Media and African Culture’,","authors":[],"date":"1992","doi":null,"raw":"Ebo, B. (1992) ‘American Media and African Culture’, pp. 15 – 25 in B. Hawk (ed.) Africa’s Media Image. New York: Praeger.","cites":null},{"id":831874,"title":"And now…Positive Africa.","authors":[],"date":"2008","doi":"10.1080\/03064229908536537","raw":"Jere-Malanda, Regina (2008) And now…Positive Africa. New African magazine, June, pp. 36 – 40.","cites":null},{"id":831657,"title":"Dateline Africa: Journalists Assess Africa Coverage’","authors":[],"date":"1992","doi":null,"raw":"Hultman, Tami (1992) ‘Dateline Africa: Journalists Assess Africa Coverage’ in B. Hawk (ed.) (1992) Africa’s media image. London: Praeger.","cites":null},{"id":833268,"title":"Deliberativeness of online political discussion. A content analysis of the Guangzhou Daily website.","authors":[],"date":"2008","doi":"10.1080\/14616700802207771","raw":"Zhou Xiang, Chan, Yeun-Ying and Peng, Zhen-Mei (2008) Deliberativeness of online political discussion. A content analysis of the Guangzhou Daily website. Journalism Studies, Vol. 9, No. 5, pp. 759 – 770.","cites":null},{"id":832355,"title":"Discussion lists and public policy on iGhana: Chimps and feral activist’","authors":[],"date":"2006","doi":null,"raw":"Schaefer, John Philip (2006) ‘Discussion lists and public policy on iGhana: Chimps and feral activist’ in Kyra Landzelius, Native on the Net. Indigenous and Diasporic Peoples in the Virtual Age, pp. 202 – 219. Routledge: London & New York,.","cites":null},{"id":831407,"title":"Encoding\/decoding","authors":[],"date":"1980","doi":"10.1007\/978-3-531-91839-6_17","raw":"Hall, Stuart (1980) Encoding\/decoding in S. Hall, D. Hobson, A. Lowe and P. Willis (eds) Culture, media language. Hutchinson, London.","cites":null},{"id":833034,"title":"Foreign news in the western agencies’,","authors":[],"date":"1984","doi":null,"raw":null,"cites":null},{"id":829812,"title":"Framing the victim. Domestic violence media and social problems. London: Aldine Transaction.","authors":[],"date":"2008","doi":null,"raw":"Berns, Nancy (2008) Framing the victim. Domestic violence media and social problems. London: Aldine Transaction.","cites":null},{"id":830234,"title":"Gatewatching: Collaborative online news production.","authors":[],"date":"2005","doi":null,"raw":"Bruns, Axel (2005) Gatewatching: Collaborative online news production. New York: Peter Lang.","cites":null},{"id":18447742,"title":"Live Aid Legacy. London:VSO 20Weaver,","authors":[],"date":"2001","doi":null,"raw":"VSO (2001) Live Aid Legacy. London:VSO 20Weaver, D.H. & Wilhoit, C.C. (1984) ‘Foreign news in the western agencies’, in R.L. Stevenson & D.L. Shaw (eds) Foreign News and the New World Information Order, pp. 153 – 85. Ames, IA: The Iowa State University Press.","cites":null},{"id":832788,"title":"Marginalized, negative or trivial?","authors":[],"date":"2009","doi":null,"raw":"Scott, Martin (2009) ‘Marginalized, negative or trivial? Coverage of Africa in the UK press’, Media, Culture & Society, Vol 31(4): 533 – 557.","cites":null},{"id":829125,"title":"Media and Ethnic Minority.","authors":[],"date":"2005","doi":null,"raw":"Alia, Valerie & Bull, Simone (2005) Media and Ethnic Minority. Edinburgh. Edinburgh University Press.","cites":null},{"id":830023,"title":"Suit, Tie and a Touch of Juju – The ideological construction of Africa: A discourse analysis of news","authors":[],"date":"1995","doi":"10.1177\/0957926595006004002","raw":"Brookes, H. (1995) ‘Suit, Tie and a Touch of Juju – The ideological construction of Africa: A discourse analysis of news on Africa in the British Press’, Discourse and Society 6 (4): 461-94.","cites":null},{"id":831286,"title":"The Ethical Journalist.","authors":[],"date":"2010","doi":null,"raw":"Foreman, Gene (2010) The Ethical Journalist. West Sussex: Wiley-Blackwell.","cites":null},{"id":829576,"title":"The impact of the internet on users’","authors":[],"date":"2008","doi":"10.4135\/9781446216316.n5","raw":"Bakker, Piet & Sadaba, Charo (2008) ‘The impact of the internet on users’ pp. 86 – 101 in Lucy Kung, Robert G. Picard & Ruth Towse, The Internet and the Mass Media. Los Angeles: Sage.","cites":null},{"id":830481,"title":"The Internet and Democratic Citizenship. Theory, Practice and Policy. Cambridge:","authors":[],"date":"2009","doi":"10.1017\/cbo9780511818271","raw":"Coleman, Stephen & Blumler, Jay G. (2009) The Internet and Democratic Citizenship. Theory, Practice and Policy. Cambridge: Cambridge University Press.","cites":null},{"id":832318,"title":"The Mass Media: Image and Reality – Africa’s Media Image by","authors":[],"date":"1994","doi":"10.1017\/s0022278x00012696","raw":"Martin, R. (1994) ‘The Mass Media: Image and Reality – Africa’s Media Image by Beverly G. Hawk’, Journal of Modern African Studies, 32 (1): 183 – 9.","cites":null},{"id":832094,"title":"The paradox of journalistic representation of the other.","authors":[],"date":"2007","doi":"10.1177\/1464884907083118","raw":"Leung, Christine C.M. & Huang, Yu (2007) The paradox of journalistic representation of the other. Journalism, Vol 8(6): 675 – 697.","cites":null},{"id":832547,"title":"Women viewing violence. London: British Film Institute.","authors":[],"date":"1992","doi":"10.1177\/096466399400300409","raw":"Schlesinger, Philip, R. Emerson Dobash, Russell P. Dobash & C. Kay Weaver (1992) Women viewing violence. London: British Film Institute.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-04","abstract":"The dominant perspective on the representation of Africa in the western media claims that western media coverage is bias and crisis orientated and the liberal perspective claims that the coverage of Africa is not as negative as is often assumed. However, there is a paucity of literature on the representation of Africa online. This research enquiry is relevant because literature claims that the Internet has the potential to resolve the journalistic predicament of representing other culture through political participation and deliberation. But this requires a re-orientation of the sourcing practice of news organization to embrace sensitivity to and knowledge of African cultures. Moreover, the journalistic predicament can be resolved or not depending on the news gathering approach adopted by the news organization. Literature has identified two approaches, that is, ‘gatekeeping’ used mainly by dominant traditional media and ‘gatewatching’ used by alternative media in their quest to counter mainstream ideology. \\ud\nThis study examines the impacts of the ‘gatewatching’ approach adopted by Africa Have Your Say (AHYS) website on its representation and frames of reference of Africa. It uses on-site observation, in-depth interviews and textual analysis to gather data. The study found that although the sourcing practice at the AHYS is elaborate and complex, the ‘gatewatching’ approach makes its susceptible to second level agenda setting. Hence, its frame repeats the attributes and tone used by the mainstream traditional media. However, a minority of users did not use repeat this frame in their comments","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/53710.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/2979\/1\/Representation_online.pdf","pdfHashValue":"e799591cfa84b83c9eed0c714b42e4bed6b10b11","publisher":"Sage","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:2979<\/identifier><datestamp>\n      2013-12-04T22:37:10Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F50:6A6163735F50353030<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/2979\/<\/dc:relation><dc:title>\n        Representation of Africa online: sourcing practice and frames of reference<\/dc:title><dc:creator>\n        Ogunyemi, Ola<\/dc:creator><dc:subject>\n        P500 Journalism<\/dc:subject><dc:description>\n        The dominant perspective on the representation of Africa in the western media claims that western media coverage is bias and crisis orientated and the liberal perspective claims that the coverage of Africa is not as negative as is often assumed. However, there is a paucity of literature on the representation of Africa online. This research enquiry is relevant because literature claims that the Internet has the potential to resolve the journalistic predicament of representing other culture through political participation and deliberation. But this requires a re-orientation of the sourcing practice of news organization to embrace sensitivity to and knowledge of African cultures. Moreover, the journalistic predicament can be resolved or not depending on the news gathering approach adopted by the news organization. Literature has identified two approaches, that is, ‘gatekeeping’ used mainly by dominant traditional media and ‘gatewatching’ used by alternative media in their quest to counter mainstream ideology. \\ud\nThis study examines the impacts of the ‘gatewatching’ approach adopted by Africa Have Your Say (AHYS) website on its representation and frames of reference of Africa. It uses on-site observation, in-depth interviews and textual analysis to gather data. The study found that although the sourcing practice at the AHYS is elaborate and complex, the ‘gatewatching’ approach makes its susceptible to second level agenda setting. Hence, its frame repeats the attributes and tone used by the mainstream traditional media. However, a minority of users did not use repeat this frame in their comments.<\/dc:description><dc:publisher>\n        Sage<\/dc:publisher><dc:date>\n        2011-04<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/2979\/1\/Representation_online.pdf<\/dc:identifier><dc:identifier>\n          Ogunyemi, Ola  (2011) Representation of Africa online: sourcing practice and frames of reference.  Journal of Black Studies, 42  (3).   pp. 457-478.  ISSN 0021-9347  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1177\/0021934710378747<\/dc:relation><dc:relation>\n        10.1177\/0021934710378747<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/2979\/","http:\/\/dx.doi.org\/10.1177\/0021934710378747","10.1177\/0021934710378747"],"year":2011,"topics":["P500 Journalism"],"subject":["Article","PeerReviewed"],"fullText":"Representation of Africa online: sourcing practice and frames of reference \n \nAbstract: \nThe dominant perspective on the representation of Africa in the western media claims that \nwestern media coverage is bias and crisis orientated and the liberal perspective claims that the \ncoverage of Africa is not as negative as is often assumed. However, there is a paucity of \nliterature on the representation of Africa online. This research enquiry is relevant because \nliterature claims that the Internet has the potential to resolve the journalistic predicament of \nrepresenting other culture through political participation and deliberation. But this requires a \nre-orientation of the sourcing practice of news organization to embrace sensitivity to and \nknowledge of African cultures. Moreover, the journalistic predicament can be resolved or not \ndepending on the news gathering approach adopted by the news organization. Literature has \nidentified two approaches, that is, ‘gatekeeping’ used mainly by dominant traditional media \nand ‘gatewatching’ used by alternative media in their quest to counter mainstream ideology.   \nThis study examines the impacts of the ‘gatewatching’ approach adopted by Africa \nHave Your Say (AHYS) website on its representation and frames of reference of Africa. It \nuses on-site observation, in-depth interviews and textual analysis to gather data. The study \nfound that although the sourcing practice at the AHYS is elaborate and complex, the \n‘gatewatching’ approach makes its susceptible to second level agenda setting. Hence, its \nframe repeats the attributes and tone used by the mainstream traditional media. However, a \nminority of users did not use repeat this frame in their comments. \nKeywords: internet, sourcing practice, deliberative democracy, representation, agenda \nsetting. \n 1\nIntroduction: \nRecently, there are two conflicting perspectives among scholars regarding the representation \nof Africa in the western media. One dominant\/traditional perspective claims that the coverage \nof African issues is marginalised and contains negative stereotypes. For example, the \nVoluntary Service Overseas (VSO) “blames the UK media for creating the widespread public \nperception that people in the developing world are victims, less than human and inferior” \n(VSO, 2001:3; Brookes, 1995). This perspective attributes such representation to what VSO \nreferred to as the ‘Live Aid Legacy’ and\/or to ideological orientation by arguing that \n“western media, influenced by their ideological position and\/or national interest \nconsiderations, will use their hegemonic power systematically to construct negative images \n(ie violent and conflictual) and media representations of underprivileged others, usually the \nless-developed countries (Weaver & Wilhoit, 1984; Leung & Huang, 2007:676). Therefore, \nthe hegemonic articulation of Africa revolves around poverty, instability, disease, illiteracy \nand conflict.  \n However, a liberal perspective challenges the above claim by stating that “…the \ncoverage of Africa, in the UK press at least, is not as negative as is often assumed” (Scott, \n2009:548). It contradicts the assumption that the “western media portrays Africa in a \ndisproportionately negative way” (Ebo, 1992:15; Scott, 2009:548) on the grounds that “parts \nof Africa are places of famine and disease and not to report on such topics would itself be a \ndistortion” (Martin 1994:186; Scott, 2009:548). Moreover, some western journalists claim \nthat “….the problem of access to official sources is severe enough in Africa to kill stories that \nwould otherwise be aired. What do you do as an American journalistic institution…when you \nhave the other side, and the other side wont give it to you?” (Hultman, 1992:232). But surely, \nthe Internet has the potential to resolve the issues at the core of these perspectives by enabling \nethnographic communication about Africa, that is, communication from African perspectives. \nBut presently, the analysis of the representation of Africa in the western media will \nremain contentious because “as globalization and migration continue to encourage the \ninteraction of different peoples and cultures, so the media portrayal of different parts of the \nworld plays an increasingly important role in either discouraging or promoting respect for \nother cultures” (Scott, 2009:535). Furthermore, because African countries demand \nrecognition of their milestone achievements in overcoming political and economic challenges \nby noting the irony of news values that “while many Western households still decry and hold \n 2\nvisions of horrific newsreels of civilians and children with hacked limbs in Sierra Leone, they \nhave seen little or no reportage of that country’s remarkable transition to peace which \nculminated in one of the continent’s most peaceful multi-party elections and transfers of \npower in October last year (Jere-Malanda, 2008:37). However, the pre-eminence of \nnegativity as a news value negates achievements as salient news in the mainstream media.   \n Our understanding of the representation of Africa will not be complete without \nanalysing how the potential of the Internet could be harnessed to resolve the journalistic \npredicament of representing other cultures. But this entails a re-orientation of sourcing \npractice to include “…effective and sensitive ways of hearing and acknowledging the \nmillions of voices and actions, not to mention silences and inactions, that constitute \nmeaningful human interaction” (Coleman & Blumler, 2009:168). Furthermore, it will entail, \non the part of online journalists, a sensitivity to, firsthand knowledge of African culture and a \ncommitment to democratic principles such as “inclusion (a voice for all), openness \n(electronic provision of information), security and privacy (a safe place), responsiveness \n(listening and responding to people) and deliberation (making the most of people’s ideas) \n(Coleman & Blumler, 2009:149).  \nThere is a growing evidence of the articulation of geopolitical and socio-cultural \nissues from African perspectives on the Internet. A case example is the repatriation of \nchimpanzees from USA to Ghana which created much furore in the Ghanaian press but not in \nwestern press. The opposition to the repatriation quickly spread to online forum where \nopposition activists claim that “the chimps had been infected with HIV or cancers, and \narticulated fears that the animals might bring infections to Ghana” (Schaefer’s 2005:207). \nThis animated online deliberation culminated in a rare evidence of the power of collective \nvoice by forcing the “NDC-dominated Parliament to cancel the chimp relocation programme” \n(ibid). This outcome undermines the argument of the critics of deliberative democracy \n“...about the impossibility of vast, physical and temporally dispersed groups of people being \nable to participate in anything resembling a collective conversation” (Coleman & Blumler, \n2009:19).  \nThe choice of the Africa Have Your Say (AHYS), owned by the BBC World Service \n(BBCWS), as a case study is based on the claim that it “often provides very positive and \nbalanced coverage of Africa and is faithfully relied upon by persons in Africa” (Martin, \n1994:186; Scott, 2009:551). Moreover, the AHYS newsroom is staffed by both black African \n 3\nand Caucasian journalists with wide knowledge and experience of Africa. The editor, David \nStead, who has a journalistic career spanning 22 African countries claim that “the AHYS is \ncommitted to recruit journalists that understand Africa and knowledge of African politics, \neconomics and culture. Therefore, the recruitment process is pretty rigorous in the BBC, \nregardless of gender and religion. Talent and ability are the key” (interview 2009).  \nHowever, the feedback from users indicates that the AHYS has yet to provide positive \nand balanced coverage of Africa as a user noted: “Do us a favour in 2008 by showing to the \nworld the other side of Africa that is not WARS, AIDS, LESS THAN A DOLLARD A DAY kind \nof stories. Things are changing in Africa, be part of this good news coming out from Africa \nnow and help reduce the ill feelings about Europe in Africa before it is too late. Let your TV \nstations create a programme for Africa even if it is once a week, hope that will be good. \nUnderstand that if Africa is okay today, much of EU´s problems will reduce” (Africa Have \nYour Say website, 2008)1. \nNonetheless, the Internet has the potential to propel African issues to escape \n“generations of alienation from media production, negative imagery and media \nmythologizing...” (Alia & Bull, 2005:103) on the hand; and to enable Africans “to \ncommunicate their world views, their cultural products, their commerce, to a global \naudience” (ibid:104) on the other. Therefore, the AHYS positions itself as a contact zone for \ndeliberation between the moderators, the users and the political establishment. A case \nexample was when the forum instigated an interactive question time between the users and \nPresident Attah of Ghana. According to David Stead, “people like a chance to hold leaders to \naccount. So, we allow the users to question leaders. In doing that, we give users access to \nAfrican leaders and to knowledge they may otherwise not get access to” (interview 2009). As \na result, the forum has enhanced its reputation as “unquestionably a medium of \npredominantly active users; a medium for engaging more widely in, and not just presenting \nand following, civic dialogue; provides relatively inexpensive public access to large stores of \nretrievable data…; and facilitates lateral, peer-to-peer and many-to-many interactive \nexchange” (Coleman & Blumler, 2009:12).  \nThe overriding aim of any website for Africans is to connect two worlds, that is, the \nAfricans in diaspora and at home in order to achieve “…both culturally specific self-\nrepresentation and transcultural and global coalition-building” (Alia & Bull, 2005:106). This \nrationale differentiates them from the alternative internet which aims to “fill the gaps that its \n 4\nreporters believe have been left by the mainstream media” (Atton & Hamilton, 2008:79) on \nthe one hand; and “operates a practice of open publishing, where all submissions are \npublished” (ibid:80) on the other. Rather, the sourcing practice at the websites for Africans \nrevolves around monitoring or ‘gatewatching’ of the mainstream news agenda. Moreover, \nthey tend to use mainstream formulas, that is, “story structures (such as the inverted \npyramid), sourcing routines that emphasize elite groups in society and news values that \nprivilege events over explanation” (ibid:79). This limits their ability to produce alternative \nperspectives on Africa and reduces their function to the moderation of negative frames of \nreference. However, the moderation process at the AHYS is rigorous in line with the house \nrules but flexible enough to allow users to communicate their meaning.  \n  It is pertinent to differentiate the websites for Africans from citizen media because, \nunlike the latter, they are not “primarily projects of self education” (Atton & Hamiltion, \n2008:122). However, they share a common orientation in “the provision of opportunities for \nordinary people to tell their own stories, and to reconstruct their culture and identity using \ntheir own symbols, signs and language” (ibid:122). To illustrate, rape issues in Africa has \nalways been constructed from the perspective of the West, but thanks to the AHYS forum, the \nDarfur women were able to construct the trauma of rape from the prism of their culture by \nstating that “before it was a big problem and the father or brothers of the girl would kill the \nperson responsible. But now rape has become common because of the fighting. Previously, \nthe girls would be cast out of society and no young man would marry them. She would be \nostracised....Society is changing our ideas and they are supporting these women more by \nletting them live a normal live...” (Sudan survivors, 2007)2. This is an example of how \nauthentic representation can overturn the effects of negative news value.  \nBut the gatewatching role of the AHYS entrenches inter-media agenda setting which \nhappens when “elite media transmit their agenda of important issues to other media” \n(Coleman et al, 2009:147). At the level of the moderators, issues and the frames of reference \nin the mainstream are given prominence. And at the level of the users, issues and the frames \nof reference are recalled and internalised. This is usually the case when users depend on the \nmedia as primary resource for constructing “...their own conceptions of what is normal and \nacceptable” (Berns, 2008:35). Trends in media exposure indicate that “already today, 1.5 \nbillion people use the Internet. In a few years, once the Internet has become genuinely \nmobile, over 4 billion users and billions more devices and objects will be connected \nanywhere and anytime”3.  \n 5\nLiterature supports the thesis that there is a correlation between media and public \nagenda setting with increase in media exposure among audiences. For example, it found \nevidence of second level agenda setting whereby “the attributes and tone that the media use \nin their descriptions are the attributes and tone foremost in the public mind” (Coleman et al, \n2009:148). From this perspective, users can exhibit traits of second level agenda setting in the \nfollowing ways. First, users who adopt the dominant or hegemonic frame will “...fully shares \nthe text’s code and accepts and reproduces the preferred reading (the reading which may not \nhave been the result of any conscious intention on the part of the creator of the text) (Hall, \n1980:118). Consequently, a study on violence against women found that “people with no \nfirsthand experience reflect the official reality of abuse” (Berns, 2008:52) by repeating “the \nreasons, including financial problems, love, guilt, threats, and no social support” (ibid:51).  \nSecond, users who adopt the oppositional (counter-hegemonic) frame will \n“...understands the preferred reading but does not share it and may bring alternative ways of \ndealing with it” (Hall, 1980:118). This is because “having experiences beyond the media \nallowed them to compare and validate, or invalidate, their media based experiences” (Berns, \n2008:47). Third, users who adopt personal experience frame “…will draw upon a variety of \nsources in their interpretation of debate. These sources include their own…, stories from \nfriends, their experience with advocates and other professionals, as well as references from \nthe media” (Berns, 2008:46). Consequently, previous study conclude that “viewers with life-\nexperience were more sensitive to televised violence, more subtle and complex in their \nreadings, more concerned about possible effects and more demanding in their expectations of \nthe producers of such content” (Schlesinger, Dobash, Dobash, and Weaver, 1992:165; Berns, \n2008:48). And fourth, users who adopt hierarchy of credibility frame will think “...it matters \nwho is talking in determining how much influence the message has on others” (Berns, \n2008:44).  \nBut in teasing out these frames, we need to understand the complexity of the sourcing \npractice at the Africa Have Your Say (AHYS) for evidence of inter-media agenda setting and \nto analyse the extent to which the moderators and the users adopt the mainstream media’s \nframes of reference. The first task is explored through on-site observation of the AHYS \nnewsroom and an in-depth interview with moderators and editor. The second task is explored \nthrough textual analysis of the content of AHYS and in-depth interview with moderators and \neditor. The scope of study is from 23 November to 23 December, 2008 during which 10 \ndebates and comments were posted. \n 6\nSourcing practice at the Africa Have Your Say website \nThe sourcing practice at the websites for African diasporas could be analysed from the \nconcept of ‘gatewatching’ expounded by Bruns (2005) to contrast the functions of the \nalternative media from the mainstream media. It means that alternative media “gatewatches \nthe output of both mainstream and other alternative media and re-presents selections from \nthat output in ways that encourage comparison and criticism” (Atton & Hamilton, 2008:80). \nLikewise, the Africa Have Your Say (AHYS) monitors issues around the world and represent \nthem from African perspectives. The editor confirms this by stating that “world issues are our \nstory point. For instance, we apply the protest in Iran to the African scene, for example, to \nMadagascar and Kenya. The Russian debate puts Africa on the world stage. The global \neconomic downturn is now affecting Africa looking at why that was and how remittances \nhave been cut, house prices skyrocketed and private entrepreneurship plummeted through \nrecession. We have made African voices heard in all our programmes” (interview 2009).  \n My on-site observation took place during the Russia-Africa debate and I was able to \nobserve and participate in the sourcing practice. The monitoring process began by selecting \nworld issues relevant to Africa and the first visit of the Russian President Dimitry Medvedev \nto a number of African countries was a prominent news agenda. Moreover, it took place a \nfew weeks before the visit of President Barrack Obama to Africa. As usual, the AHYS \nmoderators post a debate on the website to garner opinions from users and select a few \ncomments to read out and a few sources to speak on the Live Radio ‘Phone-in’ programme at \n17hrs. The tone of the debate conforms with the BBC professional news values, that is, “the \ntone of AHYS is informed, provocative, lively, journalistic and rigorous” (editorial \ndocument). For example, there is evidence of provocation in the opening question of the \ndebate, that is, ‘Does Africa need Russia?’ Then journalistic principle of balance is applied \nwhen the moderators posed the follow-up question ‘but does Russia need African more than \nAfrica needs Russia?’  \nMoreover, the construction of the debate is informative by providing establishing \nstatement that “analysts say Russia is keen to increase its sphere of influence on the continent \nand tap into potential investment opportunities. During the cold war, Russia played a \ncontroversial role in shaping the politics and economics of Africa…”4. The debate then ended \nwith a series of questions to solicit response from the users. The AHYS received a total \ncomment of 253 but 244 were published and nine were rejected. The moderation of \n 7\ncomments is rigorous without interfering with user’s communicative competence. A \nmoderator explains the criteria for moderation to me by stating “we moderate the way you \nexpress your view online. We also moderate for offensive comments and relevancy. We also \nchoose comments that help a debate”, that is, that enhances the vibrancy of conversation \nonline” (interview 2009). However, the reason for rejecting comments is not because of an \ninfringement of the ‘house rules’ but because they are not relevant to the debate. Although \nthe moderators monitor the use of about 312 profanities, very few users infringe them. \nAccording to a moderator, “users understand the rules. They are astute about how they want \nto project they views. They understand they are coming on BBC platform” (interview 2009). \nThe next stage in the sourcing routine happens in the newsroom when the moderators \nand the editor meet for their morning conference. The sequence of the radio programme is \nmapped out on the ‘story board’ including the names of contacts and moderators make \ncontributions to enhance the quality of presentation. Once a decision is made, the callers are \nthen informed and put on standby a few minutes before the broadcast. The editorial document \nalso set out the AHYS’ relationship with callers\/listeners by stating that “the AHYS puts the \ncallers\/listeners first and the programme is driven by their stories and experiences” (editorial \ndocument). The whole rationale hinges on the principle that “through taking part in AHYS, \ncallers will have been given the opportunity to tell their story, give their point of view and \nengage on air with other contributors as part of a pan-African conversation. Listeners should \nfeel better informed, inspired by the stories and empowered by a sense that Africa’s voice is \nbeing heard and that decision makers are being held to account” (ibid). \nThis elaborate sourcing practice suggests that the AHYS is geared towards advancing \nthe principles of deliberative democracy. First, the AHYS allow “access to balanced \ninformation” (Coleman & Blumler, 2009:40) by being a ‘contact zone’ not just for debate but \nalso for retrieving information about global issues through relevant links and blogs. Second, \nthe AHYS is “an open agenda, that is, “the agenda must be open to revision or expansion by \nthe deliberating citizens” (Coleman & Blumler, 2009:19) by allowing “callers to suggest \nideas where these reflect genuine concerns and help the programme in its ambition to be \nrelevant” (editorial document). Third, the AHYS considers “issues expansively” (Coleman & \nBlumler, 2009:40) by “providing space for strong debate on significant issues, at times \ngenerating news by highlighting under-reported stories and major issues ignored by the media \nor those in power” (editorial document). Fourth, the AHYS gives users “freedom from \nmanipulation or coercion” (Coleman & Blumler, 2009:40) by using variety of techniques for \n 8\ncollating information and contacting sources which include BBC Studios, satellite phones, \nemail, text, facebook, and twitter. Fifth, the AHYS has evolved “a rule based framework for \ndiscussion” (Coleman & Blumler, 2009:40) by “hearing firsthand from those engaged with \nthe stories and issues which affect the continent” (editorial document).  \nFurthermore, the AHYS seems to meet the sixth principle because it enables \n“participation by an inclusive sample of citizens…” (Coleman & Blumler, 2009:40) by \nencouraging diversity and seeking “to be accessible to the views and opinions of a wide range \nof contributors which we will mediate impartially, allowing free-flowing debate” (editorial \ndocument). Seventh, the AHYS provides “scope for free interaction between participants” \n(Coleman & Blumler, 2009:40) by being an “interactive BBC programme connecting \nAfricans wherever they are to discuss what matters to them” (editorial document). And \nfinally, the AHYS recognises “differences between participants” and rejects “status-based \nprejudice” (Coleman & Blumler, 2009:40) by selecting a clear and focused subjects for \ndebate which “resonate with listeners around Africa” and aiming for the “highest production \nstandards with clear branding and signposting (editorial document). However, the inclusive \nsample of users on the forum may not necessarily represent a wide range of perspectives on \nthe issues. \n Another relevant dimension of the sourcing practice at the AHYS is that it monitors \nAfrican websites especially for news that affects British citizens in Africa. For example, the \nAHYS monitors and reviews the comments on the ‘Sudanese thinker blog’ via \nwww.sudanesethinker.com  by noting that “Sudanese blogs and forums have largely \ncondemned the arrest of British teacher Gillian Gibson for letting her young schoolchildren \nname a teddy bear Muhammad”. Moreover, it noted that “some called the whole issue \n‘pathetic’ and termed Ms Gibson's act ‘an honest and innocent mistake’. The media in Sudan \nand the Middle-East have largely ignored the case”. The AHYS monitors Amjad's blog which \ncarries “comments criticizing the Sudanese authorities” on the same issue. The AHYS also \nsources information via the facebook and found that a “group formed in www.facebook.com \nis demanding Gibson's release. The ‘Release Gillian Gibbons Now’ group carries postings \nfrom Sudanese contributors, condemning the arrest and demanding her immediate release”5.  \n The AHYS monitors the global blogosphere on the Gibson case and notes that “a brief \nsurvey by BBC Monitoring on 29 November 2007 indicated that the story was not yet \nfeaturing prominently in the global blogosphere. For example, a search on the Technorati \n 9\nwebsite at 0945 GMT produced fewer than 300 hits, mostly from US and UK bloggers. \nHowever, many of these postings were merely links to factual reports on mainstream news \nwebsites such as International Herald Tribune . The affair has been widely reported in the UK \npress, and the London-based pan-Arab press have carried factual reports. However, media in \nthe Middle East appear to be playing down the story, which has so far been overshadowed by \ncomment on the Annapolis meeting”6.  \n The AHYS monitors other African blogs on a wide range of issues. For instance, in the \naftermath of the political crisis in Kenya it monitored www.mashada.com – “a prominent \nonline forum frequented by Kenyans in the diaspora”. According to its moderator, \"this \nforum exists to facilitate civil discussions and debates. Condescending, rude, and annoying \nremarks and insults are awarded with temporary and permanent bans\". AHYS began the \nreview with an establishing statement that “Kenyan's political crisis sparked by the disputed \npresidential election continues to dominate debate on the country's blogs and online forums. \nOrange Democratic Movement (ODM) leader Raila Odinga says he was robbed of victory in \nDecember by Mwai Kibaki, who was declared the winner”. However, the AHYS found that \n“while some bloggers condemned attacks on ‘unarmed, innocent and defenceless’ Kikuyus, \nothers supported the displacement of Kikuyus who ‘grabbed peoples land’”. The AHYS also \nfound on a rival blog, that is, kenya.rcbowen.com  a comment by Justice that “the ethnic \nKalenjin community should immediately occupy their ancestral lands which [late] President \nJomo Kenyatta took from them and dished out to his Kikuyu”. Finally, the AHYS balanced \nthe review of the blog with an overview of newspapers in Kenya “that The Standard and \nDaily Nation newspapers have reported that leaflets were circulating in Central Province - the \nKikuyu heartland - warning members of other ethnic communities to leave. The reports said \nthat close to 1,200 people had left their homes in fear and were camping at police stations, \nand that at least four of them were suffering from bad knife wounds, after they were \nattacked”7. \n  Of course, there are other websites for Africans that the AHYS do not monitor or \nreview. Most of these can be categorised broadly into “‘meta and comment’ sites; and ‘share \nand discussion’ sites” - two of the ‘four types of online journalism’ identified by Deuze \n(2003). For example, the www.nigeriavillagesquare.com falls under the former while the \nAHYS is a hybrid of both. However, the ‘Ghana Forum’ and ‘Say It Loud' analysed in \nSchaefer’s (2006) study could be classified as ‘share and discussion’ sites because they are \ncontact zones “where members of the Ghanaian diasporic opposition community meet and \n 10\ndebate with members of the domestic political community and interested others” (Schaefer, \n2006:203). The www.ghanaweb.com and http:\/\/saharareporters.com\/ are hybrid of news, \ncomment and index site. For example, it gives priority to top stories, crime, politics, diaspora, \nregional, health and religion on the top of the index page. This is followed by sports, \nbusiness, entertainment, country, opinion and members. The index page ends with A-Z \nresource on a wide range of subjects. The Sahara Reporters’ site which also has a video link \ndescribes itself as “an online community of international reporters and social advocates \ndedicated to bringing you commentaries, features, news reports from a Nigerian-African \nperspective”8.  \n There is no doubt that the Africans are appropriating the Internet to represent Africa \nfrom African perspectives and to project their cultural and African identities. However, the \nlow penetration of Internet estimated at 6.7 percent compared to 24.7 percent of the world \naverage8 indicates the depth of the digital divide which puts the Africans at home at a \ndisadvantaged compared to the counterpart in diaspora. Moreover, there is evidence of digital \ndivide between countries. For instance, the continent’s top ten internet countries are Egypt at \n12.6 million people, Nigeria at 11m, Morocco at 10.3m, South Africa at 4.6m, Sudan at 3.8m, \nAlgeria at 3.5m, Kenya at 3.4m, Tunisia at 2.8m, Uganda at 2.5 and Zimbabwe at 1.4m9. The \nInternet penetration in the remaining 43 African countries is not statistically significant to \nwarrant any mention. The implication is that digital divide will undermine efforts by websites \nfor Africans to mount any significant challenge against the negative representation of Africa \nand their ability to rival the global media in terms of reach, capital and network of contacts. \nRegarding reach, the AHYS is an integral part of a conglomeration of websites owned \nby the BBC World Service to extend its programming “…in 37 languages in real audio on the \nInternet…”10. Their remit is to ‘…connect and engage audiences by facilitating an informed \nand intelligent dialogues – a global conversation – which transcends international borders and \ncultural divides, and…give audiences opportunities to create, publish and share their own \nviews and stories”11. Regarding capital, the AHYS is funded from the extra grant of £64 \nmillion the World Service received over three years12 in 2001. However, the websites for \nAfricans are constrained by capital because they are mostly authored by enthusiasts and \nformer journalists. The hope of generating income from the net is also remote because their \nhierarchy of credibility is low in the estimation of advertisers. Regarding network of contacts, \nthe websites for Africans cannot compete either. Whereas, the editor of AHYS takes pride in \nthe statement that the “network of reporters and our contacts” is the AHYS’ unique selling \n 11\npoint. Furthermore, “we have 200 African stringers across Africa. Hence, our ability to report \nAfrica in a pan-African way is second to none. For instance, Capitol Radio in Kenya may be \ngood on Kenyan issues but listeners cannot use it to find out what is going on in Nigeria. So, \nif you want to know where your country ‘fits in’ in African terms, then AHYS provides that” \n(interview 2009).   \nHowever, it is fair to note that both the AHYS and websites for Africans share a \ncommon editorial practice by being a platform for breaking news, eyewitness account and \ncommentary. For example, Sahara Reporters broke the news of the political assassination of \nOtunba Dipo Dina, a governorship candidate of the Action Congress (AC) in the 2007 \nelections in Ogun State, and warned that “the murder of Dipo Dina has once again raised the \npolitical temperature of the Southwest in particular; and Nigeria in general as we move \ntowards 2011 elections”13. This news agenda contrast with that of the AHYS which focused \non the debate titled ‘How can Africa help Haiti’14. Nonetheless, both websites cater for the \ninformation needs of users and serve as ‘contact zone’ for global conversation. \n \nAn analysis of frame of reference used by users \nUser empowerment and interactivity are at the core of the appeal of the AHYS among \nAfricans at home and in diaspora. But let us begin by analysing the data about the profile of \nthe users and their location. According to the editor, “the users of AHYS are literate and they \ncut across a wide age group, urban, middle class people and are engaged with global issues” \n(interview 2009). For Africans at home, this means the forum is for the cosmopolitan user \nwho can afford to buy computers and subscribe to internet service provider and\/or access \nfrom office or the Internet café. However, the penetration of AHYS to rural Africa is a goal \nthat the BBC World Service is pursing and the moderators think it is possible to achieve it in \nthe near future because of the penetration of mobile phone in Africa and its use for internet \nconnection. But for Africans in diasporas, the profile means that the forum is for the educated \nuser who is interested in African and global affairs and eager to make a contribution. The \nstudy examined the ten debates in Table 1 for location of users.  \n \nChart 1: AHYS User Location  \n 12\nChart 1 above indicates that the users are mostly located in USA, UK and Canada. \nThis is not surprising because Africans in diaspora have better access to computer and \ninternet facilities. Unlike their counterpart who must overcome the challenges of incessant \npower failure, high tariff internet connection, unaffordable computer prices, scarcity of \ninternet café, internet\/media illiteracy etc. These and other socio-economic and political \nchallenges exacerbate the digital divide between the Africans at home and in diaspora. \nHowever, users in Nigeria and Ghana have a strong showing and this may be a reflection of \ncolonial heritage which continue to manifest itself through language, education, media and \nother cultural industries. This colonial heritage may explain why the “forum has no single \nuser from Burundi and occasionally get some from Rwanda” (interview 2009). The data also \nreveals that a significant number of users did not indicate their location. This is an optional \npreference and some users decide to exercise the right to anonymity. The category ‘others’ \nrepresent countries where the data found less than twenty users.     \n    \nChart 2: The frame of reference in users’ comments \nAs mentioned earlier, the frame of reference used by moderators can engender second \nlevel agenda setting among users. This is evident through the repetition of attributes and tone \nused by moderators. Chart 2 above confirms that majority of users (57 percent) accept the \nframe\/tone of the debates and are most likely to use the hierarchy of credibility to enhance \ntheir argument. For example, an unedited comment by a user in response to the debate titled \n‘Is violence against women inevitable?’ states:   \n“In Africa or anywhere else, this bit of news ‘Women and girls in Cambodia are \nfacing an increasing risk of rape and sexual assault says a government report. Doesn’t give \nmuch hope or…does it? Men are animals though more in some parts of the world than others. \nEducation will go a long way to solve the problem but its not a final solution as long as minds \nare sick and laws in some countries allow men to get away with it” – Artur de Freitas, \nJohannesburg, South Africa. \n It is noteworthy how the user cited government report to justify the claim that it is \nwidespread and not limited to a particular part of the world. The user also vent out anger on \nthe government for not tightening the law.  \n 13\nHowever, a significant number of users (43 percent) rejected the frame\/tone and are \nmost likely to cite sources outside of the media to enhance their argument. For example, an \nunedited comment by a user on a debate titled ‘Is Ghana’s star dimming?’ notes: \n“how can our star continue to shine if we continue to obey our bosses, IMF, WORLD \nBANK, and the West, embarking on programmes like the ERPs, SAPs. Privatisations, etc \nhave left us more poor, look at what Dr Kwame Nkrumah our first president did, no \ngovernment have been able to make an impact on our development process than him. Our star \nis black for that matter I can say that the ‘black’ star problems needs ‘black’ solutions and not \n‘white’ solutions. This is the only way our star can shine, thanks” – Emmanuel Wullingdool, \nAccra. \nMoreover, such users use a combination of sources to justify their opinion, that is, \nstatistics, reference to other media outlets and hierarch of credibility. For example, a user \ncountered the hegemonic attribution and tone of the debate titled ‘Is violence against women \ninevitable?’ by stating: \n“it’s not just Africa. from a BBC article: one third of women in Wales suffer from \nsome sort of violence, three members of the Welsh assembly have disclosed that they have \nbeen raped, a NUS survey of Welsh students found that 64% knew women whose partners \nhad hit them, and 41% knew women who had been pressured into sex, a third believed a \nwoman was responsible or being raped if she was drunk or flirtatious, and a quarter thought \nshe was to blame if she walked alone in a deserted area” – Chris X, Edinburgh. \n From the above, the data reveals evidence of second level agenda setting as majority \nof users repeat the frame and tone used by moderators. That implies that the issues are \n‘unobtrusive’ for the first category of users, that is, “those with which people have little to no \npersonal experience, are the ones most likely to become important to people if they are high \non the media’s agenda” (Coleman, 2009:153). Therefore, they have a high propensity to \ninternalise moderators’ frame. But the issues are ‘obtrusive’ for the second category of users, \nthat is, they have a high propensity to use alternative frames or to draw from “direct or \npersonal experience with an issue” (ibid:153). Hence, they have a propensity to use \noppositional (counter-hegemonic) frame and tone in their comments.  \n \nAn analysis of the frame of reference used by moderators \n 14\nAs mentioned earlier, monitoring or ‘gatewatching’ is an integral part of the sourcing practice \nat the AHYS. As a result, the moderators are predisposed to reflect the frames of reference in \nthe mainstream or alternative media. The analysis of the ten debates in Table 1 will give us an \ninsight into the extent of the inter-media agenda setting.  \nTable 1: Published and Rejected Comments. \nTable 1 reveals a grand total of 1496 comments out of which 85.49 percent was \npublished and 6.28 percent was rejected. This high publication rate suggests that the forum is \nuser friendly and the moderators are committed to diversity of opinions and deliberation \namong users. The textual analysis reveals that three of the debates embed economic frame, \ntwo embed socio-cultural frame, one embeds legal\/socio-cultural frame, one embeds health \nframe, two embed political frame and one embeds legal\/ethical frame. Interestingly, the \neconomic frame is most likely to harbour mixed and negative tones, the socio-cultural frame \nharbours mixed tone, the legal\/socio-cultural harbours negative tone, the health frame \nharbours neutral tone, the political frame harbours mixed and negative tones, and the \nlegal\/ethical harbours negative tone. To illustrate, the debate titled ‘Is Ghana's star dimming?’ \nis an example of a political frame but with mixed tone. It harbours hegemonic articulation of \ndemocratic institution in Ghana by insinuating instability, vote rigging and lack of \ntransparency. This provoked a high response rate with a total of 564 comments. Below is an \nunedited comment by a user in response to the hegemonic construction of African political \nreality on the forum: \n‘I think most of the international media left disappointed here, because there was not \nmuch story to be carried out right after the polls, my reasons are simply, there was not no \nnews on rigged, beating or any negative story to report. Supposedly there was this negative \nstuff, you will see how the big media will trumpet them all over the world and paint African \nblack’ – Yaw Tawiah, Adenta \nMoreover, moderators used hierarchy of credibility to underpin the political frame. \nFor example, it cited the announcement by Ghana’s Electoral Commission that the \npresidential election will be decided in a second round vote. This was reinforced by statistics \nof percentage of the vote won which was below the 50 percent needed to score an outright \nwin. Such use of hierarchy of credibility is a common journalistic practice to demonstrate \nimpartiality and objectivity. However, there was no evidence that the moderators balanced \n 15\nthe views of official sources with eyewitness accounts. Hence, the moderators need to do \nmore to recognise the latter as reliable sources. \nThe debate titled ‘Is violence against women inevitable?’ is an example of \nlegal\/socio-cultural frame with negative tone. The moderators used the hierarchy of \ncredibility by quoting statistics from the World Health Organization (WHO) regarding the \nspate of the abuse across developing countries. For example, “50% of women in Ethiopia, \nTanzania, Bangladesh and Peru reported they were subjected to physical or sexual violence \nby their partners, with figures reaching staggering 71% in rural Ethiopia. In South Africa, the \ngovernment says more than 55,000 rape cases are reported every year – the highest on the \ncontinent”. However, it did not contrast these incidents with statistics from developed \ncountries. Hence, it has a tendency to cause moral panic and reinforce negative stereotypes of \nAfrica among users.  \nThe debate titled ‘Does HIV\/AIDS still scare you?’ is an example of health frame but \nwith neutral tone. The moderators did not reinforce the hegemonic articulation of infectious \nAfrica that is common in mainstream media. Therefore, the debate opens thus: “when Aids \nfirst began to spread in the early 1980s it brought fear and confusion with many seeing it as a \ndeath sentence”. This tone will motivate users to draw upon their personal experience. The \nmoderator went further to question why expectations about vaccine being produced have not \nbeen met, two decades after the claim was made. This use of hierarchy of credibility put the \nblame squarely at the door of experts and pharmaceutical companies. The debate was \narticulated from the perspective of the victim. \nOverall, the data reveals that the moderators gave prominence to economic, political \nand socio-cultural frames but with a fixation on mixed and negative tones. Consequently, \nsome users with limited exposure to other sources of information may continue to hold a \nstereotypical view of Africa. This analysis should be instructive for the moderators because it \nilluminates how the construction of the debate could engender second level agenda setting \namong users, that is, “the attributes and the tone that the media use in their descriptions are \nthe attributes and tone foremost in the public mind” (Coleman et al, 2009:149).  \n \nConclusion: \n 16\nThe study reveals that the sourcing practice at the AHYS is underpinned by monitoring or \n‘gatewatching’. This is further confirmed by the editor in describing the souring routine that \n“generally, topics for debate are generated from what is on the news. It is then framed for the \nwebsite and later presented on AHYS radio. The moderator also writes a feature on the \nbreaking news for the website. This process ensures that the debate and conversation last for \na week” (interview 2009). The implication is that the AHYS is susceptible to inter-media \nagenda setting with a tendency to repeat the frame of reference in the mainstream media. \nTherefore, the forum has been found to perpetuation some negative stereotypes in \nrepresenting Africa. The forum needs to device a team driven and flexible souring routine in \norder to realise the potential of the Internet to foster better understanding of other culture. \nPresently, such flexibility is limited to responding to mainstream news agenda as noted by the \neditor that “the team is flexible enough to change the topic if there is a breaking news” (ibid). \nWhat is needed is an overhaul of the souring practice to elicit the best of technical skills, \nprofessional values, sensitivity to and knowledge of Africa.  \nSuch sourcing practice will make issues more ‘obtrusive’ to users and make the forum \na reference point in their analysis of messages in television which came out top in order of \npreference in a survey by the Pew Center for the People & the Press in 2008. The survey \nfound that “eight out of ten Americans get the news every day, but the sources of the news \nare changing…, 57 percent of those seeking news watched television, 35 percent listened on \nthe radio, 34 percent read newspapers, and 29 percent went online” (Foreman, 2010:11-12). \nThe future trend is that preference for online news will continue to rise. Therefore, \nrepresentation of Africa online needs to be accurate, devoid of negative stereotypes, informed \nby knowledge of Africa and African cultural practices.   \n 17\nNotes \n1 Africa Have Your Say (AHYS) Website \nhttp:\/\/news.bbc.co.uk\/2\/hi\/talking_point\/africa_have_your_say\/default.stm \nAccessed April 6, 2009.  \n2 Sudan survivors answer your questions \nhttp:\/\/newsvote.bbc.co.uk\/mpapps\/pagetools\/print\/news.bbc.co.uk\/1\/hi\/world\/afri\nca\/7  accessed Oct 29, 2009.  \n3 http:\/\/ec.europa.eu\/information_society\/activities\/foi\/index_en.htm  accessed \nNovember 20, 2009). \n4 Africa Have Your Say (AHYS) Website \nhttp:\/\/news.bbc.co.uk\/2\/hi\/talking_point\/africa_have_your_say\/default.stm \nAccessed June 9, 2009.  \n5 Bloggers condemn Sudan for arrest http:\/\/news.bbc.co.uk\/go\/pr\/fr\/-\n\/1\/hi\/world\/africa\/7119391.stm accessed November 12, 2009.  \n6 Battle of the blogs in Kenya http:\/\/news.bbc.co.uk\/go\/pr\/fr\/-\n\/2\/hi\/africa\/7189291.stm  accessed  November 12, 2009. \n7 Ibid \n8 Sahara Reporters  http:\/\/saharareporters.com\/  accessed 26 January, 2010. \n9 www.internetworldstats.com  accessed  November 12, 2009. \n10 www.bbc.co.uk\/worldservice\/us\/anual_review\/2006\/ accessed September 25, \n2009.  \n11 ibid \n12 www.fco.gov.uk\/en\/newsroom\/latest-news\/?view=Speech&id=2148677 accessed \nNovember 12, 2008. \n13 Sahara Reporters http:\/\/www.saharareporters.com\/ accessed 26 January, 2010. \n 18\n14 http:\/\/newsforums.bbc.co.uk\/nol\/thread.jspa?forumID=7421&edition=1&ttl=201\n00126153642  accessed 26 January, 2010. \n15 www.fco.gov.uk\/en\/newsroom\/latest-news\/?view=PressR&id=2021148 accessed \nNovember 12, 2009. \n \n \nReferences \nAlia, Valerie & Bull, Simone (2005) Media and Ethnic Minority. Edinburgh. Edinburgh \nUniversity Press. \nAtton, Chris & Hamilton, James F. (2008) Alternative Journalism. Los Angeles. Sage. \nBakker, Piet & Sadaba, Charo (2008) ‘The impact of the internet on users’ pp. 86 – 101 in \nLucy Kung, Robert G. Picard & Ruth Towse, The Internet and the Mass Media. Los Angeles: \nSage.   \nBaroness Scotland (2002) Baroness Scotland Publicises BBC World Service Internet Services \nto UK Minority Ethnic Communities  \nwww.fco.gov\/en\/newsroom\/latest-news\/?view=PressR&id=2021148 Accessed November, \n12, 2008. \nBerns, Nancy (2008) Framing the victim. Domestic violence media and social problems. \nLondon: Aldine Transaction. \nBrookes, H. (1995) ‘Suit, Tie and a Touch of Juju – The ideological construction of Africa: A \ndiscourse analysis of news on Africa in the British Press’, Discourse and Society 6 (4): 461- \n94. \nBruns, Axel (2005) Gatewatching: Collaborative online news production. New York: Peter \nLang. \nColeman, Stephen & Blumler, Jay G. (2009) The Internet and Democratic Citizenship. \nTheory, Practice and Policy. Cambridge: Cambridge University Press. \n 19\nColeman, Renita, McCombs, Maxwell, Shaw, Donald & Weaver, David (2009) ‘Agenda \nSetting’ in Karin Wahl-Jorgensen & Thomas Hanitzsch (eds) The Handbook of Journalism \nStudies, pp. 147 - 160. New York: Routledge \nDeuze, Mark (2003) ‘The Internet and its journalisms: considering the consequences of \ndifferent types of newsmedia online’, New Media and Society 5 (2), June: 203 – 30. \nEbo, B. (1992) ‘American Media and African Culture’, pp. 15 – 25 in B. Hawk (ed.) Africa’s \nMedia Image. New York: Praeger. \nForeman, Gene (2010) The Ethical Journalist. West Sussex: Wiley-Blackwell. \nHall, Stuart (1980) Encoding\/decoding in S. Hall, D. Hobson, A. Lowe and P. Willis (eds) \nCulture, media language. Hutchinson, London. \nHultman, Tami (1992) ‘Dateline Africa: Journalists Assess Africa Coverage’ in B. Hawk \n(ed.) (1992) Africa’s media image. London: Praeger.  \nJere-Malanda, Regina (2008) And now…Positive Africa. New African magazine, June, pp. 36 \n– 40. \nLeung, Christine C.M. & Huang, Yu (2007) The paradox of journalistic representation of the \nother. Journalism, Vol 8(6): 675 – 697. \nMartin, R. (1994) ‘The Mass Media: Image and Reality – Africa’s Media Image by Beverly \nG. Hawk’, Journal of Modern African Studies, 32 (1): 183 – 9. \nSchaefer, John Philip (2006) ‘Discussion lists and public policy on iGhana: Chimps and feral \nactivist’ in Kyra Landzelius, Native on the Net. Indigenous and Diasporic Peoples in the \nVirtual Age, pp. 202 – 219. Routledge: London & New York,. \nSchlesinger, Philip, R. Emerson Dobash, Russell P. Dobash & C. Kay Weaver (1992) \nWomen viewing violence. London: British Film Institute.  \nScott, Martin (2009) ‘Marginalized, negative or trivial? Coverage of Africa in the UK press’, \nMedia, Culture & Society, Vol 31(4): 533 – 557. \nVSO (2001) Live Aid Legacy. London:VSO \n 20\nWeaver, D.H. & Wilhoit, C.C. (1984) ‘Foreign news in the western agencies’, in R.L. \nStevenson & D.L. Shaw (eds) Foreign News and the New World Information Order, pp. 153 \n– 85. Ames, IA: The Iowa State University Press. \nZhou Xiang, Chan, Yeun-Ying and Peng, Zhen-Mei (2008) Deliberativeness of online \npolitical discussion. A content analysis of the Guangzhou Daily website. Journalism Studies, \nVol. 9, No. 5, pp. 759 – 770.  \n \n 21\n"}