{"doi":"10.1098\/rsta.2002.1112","coreId":"71176","oai":"oai:eprints.lancs.ac.uk:6622","identifiers":["oai:eprints.lancs.ac.uk:6622","10.1098\/rsta.2002.1112"],"title":"Solar wind-magnetosphere-ionosphere interactions in the earth's plasma environment","authors":["Cowley, S. W. H.","Davies, J. A.","Grocott, A.","Khan, H.","Lester, M.","McWilliams, K. A.","Milan, S. E.","Provan, G.","Sandholt, P. E.","Wild, J. A.","Yeoman, T. K."],"enrichments":{"references":[{"id":16359293,"title":"A correlation between extended intervals of ULF wave power and storm-time geosynchronous relativisitic electron flux enhancements.","authors":[],"date":"2000","doi":"10.1029\/2000gl003822","raw":"Mathie,  R.A. & Mann,  I.R. 2000 A correlation between extended intervals of ULF wave power and storm-time geosynchronous relativisitic electron flux enhancements. Geophys. Res. Lett. 27, 3261-3264.","cites":null},{"id":16359299,"title":"A survey of dayside flux transfer events observed by","authors":[],"date":"1984","doi":"10.1029\/ja089ia02p00786","raw":"Rijnbeek, R.P., Cowley,  S.W.H., Southwood,  D.J. & Russell,  C.T. 1984 A survey of dayside flux transfer events observed by ISEE 1 and 2 magnetometers. J. Geophys. Res. 89, 786-800.","cites":null},{"id":16359297,"title":"A survey of magnetopause FTEs and associated flow bursts in the polar ionosphere.","authors":[],"date":"2000","doi":"10.1007\/s00585-000-0416-0","raw":"Neudegg, D.A., Cowley, S.W.H., Milan, S.E., Yeoman, T.K., Lester, M., Provan, G., Haerendel, G., Baumjohann, W., Nikutowski, B., Büchner, J., Auster, U., Fornacon, K.-H. & Georgescu, E. 2000 A survey of magnetopause FTEs and associated flow bursts in the polar ionosphere. Ann. Geophysicae 18, 416-435.   12 Pinnock,  M., Rodger,  A.S., Dudeney,  J.R., Rich,  F. & Baker,  K.B. 1995 High spatial and temporal resolution observations of the ionospheric cusp. Ann. Geophysicae 13, 919-925.","cites":null},{"id":16359295,"title":"Convection and auroral response to a southward turning of the IMF: Polar UVI, CUTLASS, and IMAGE signatures of transient magnetic flux transfer at the magnetopause.","authors":[],"date":"2000","doi":"10.1029\/2000ja900022","raw":"Milan,  S.E., Lester,  M., Cowley,  S.W.H. & Brittnacher,  M. 2000 Convection and auroral response to a southward turning of the IMF: Polar UVI, CUTLASS, and IMAGE signatures of transient magnetic flux transfer at the magnetopause. J. Geophys. Res. 105, 15741-15755.","cites":null},{"id":16359302,"title":"Dayside auroral configurations: Responses to southward and northward rotations of the interplanetary magnetic field.","authors":[],"date":"1998","doi":"10.1029\/98ja01541","raw":"Sandholt,  P.E., Farrugia,  C.J., Moen,  J. & Cowley  S.W.H. 1998 Dayside auroral configurations: Responses to southward and northward rotations of the interplanetary magnetic field. J. Geophys. Res. 103, 20279-20295.","cites":null},{"id":16359306,"title":"Dynamic cusp aurora and associated pulsed reverse convection during northward interplanetary magnetic field.","authors":[],"date":"2000","doi":"10.1029\/2000ja900025","raw":"Sandholt,  P.E., Farrugia,  C.J., Cowley,  S.W.H., Lester,  M., Denig,  W.F., Cerisier,  J.-C., Milan,  S.E., Moen,  J., Trondsen, E., & Lybekk, B. 2000 Dynamic cusp aurora and associated pulsed reverse convection during northward interplanetary magnetic field. J. Geophys. Res. 105, 12869-12894.","cites":null},{"id":16359287,"title":"Excitation of twin-vortex flow in the nightside high-latitude ionosphere during an isolated substorm.","authors":[],"date":"2001","doi":"10.5194\/angeo-20-1577-2002","raw":"Grocott, A., Cowley, S.W.H., Sigwarth, J.B., Watermann, J.F. & Yeoman, T.K. 2001 Excitation of twin-vortex flow in the nightside high-latitude ionosphere during an isolated substorm. Ann. Geophysicae, submitted.","cites":null},{"id":16359316,"title":"FIGURE 7. Meridian scanning photometer observations of the dayside cusp emission obtained from Ny Ålesund (Svalbard) on 16","authors":[],"date":"2001","doi":null,"raw":"[From Grocott and Cowley 2001] FIGURE 7. Meridian scanning photometer observations of the dayside cusp emission obtained from Ny Ålesund (Svalbard) on 16 December 1998.  The format is the same as for figure 3.  [From Sandholt et al. 2000] SHORT TITLE Earth’s plasma environment o o o o o o n T m \/ s M L T M L T M L T M L T -33 -33 -2 -21 -21 -9 -9 -9 I n t e n s i t y ( k R ) D e c : : U T ( -U T ) = k V + Z ( n T ) + Y ( -7 m i n )    85 o o o o o o","cites":null},{"id":16359313,"title":"First simultaneous observations of flux transfer events at the high-latitude magnetopause by the Cluster spacecraft and pulsed radar signatures in the conjugate ionosphere by the CUTLASS and EISCAT radars.","authors":[],"date":"2001","doi":"10.5194\/angeo-19-1491-2001","raw":"Wild,  J.A., Cowley,  S.W.H., Davies, J.A., Khan,  H., Lester,  M., Milan,  S.E., Provan,  G., Yeoman,  T.K., Balogh,  A., Dunlop, M.W., Fornacon, K.-H., & Georgescu, E. 2001 First simultaneous observations of flux transfer events at the high-latitude magnetopause by the Cluster spacecraft and pulsed radar signatures in the conjugate ionosphere by the CUTLASS and EISCAT radars. Ann. Geophysicae, in press.","cites":null},{"id":16359284,"title":"Flux transfer events at the magnetopause and in the ionosphere.","authors":[],"date":"1990","doi":"10.1029\/gl017i012p02241","raw":"Elphic, R.C., Lockwood, M., Cowley, S.W.H. & Sandholt, P.E. 1990 Flux transfer events at the magnetopause and in the ionosphere. Geophys. Res. Lett. 17, 2241-2244.","cites":null},{"id":16359281,"title":"Ground-based observations of the auroral zone and polar cap ionospheric responses to dayside transient reconnection.","authors":[],"date":"2001","doi":"10.5194\/angeo-20-781-2002","raw":"Dordrecht: Kluwer Acad. Publ.   11 Davies, J.A., Yeoman, T.K., Rae, I.J., Milan, S.E., Lester, M., McWilliams, K.A. & Lockwood, M. 2001 Ground-based observations of the auroral zone and polar cap ionospheric responses to dayside transient reconnection. Ann. Geophysicae, submitted.","cites":null},{"id":16359300,"title":"Initial ISEE magnetometer results: magnetopause observations.","authors":[],"date":"1978","doi":"10.1007\/bf00212619","raw":"Russell, C.T. & Elphic, R.C. 1978 Initial ISEE magnetometer results: magnetopause observations. Space Sci. Rev. 22, 681-715.","cites":null},{"id":16359314,"title":"Interhemispheric observations of nightside ionospheric electric fields in response to IMF Bz and By changes and substorm","authors":[],"date":"2000","doi":"10.1007\/s00585-000-0897-x","raw":"Yeoman, T.K., Lewis, R.V., Khan, H., Cowley, S.W.H. & Ruohoniemi, J.M. 2000 Interhemispheric observations of nightside ionospheric electric fields in response to IMF Bz and By changes and substorm pseudobreakup. Ann. Geophysicae 18, 897-907.   13 FIGURE CAPTIONS FIGURE 1. Cut through the noon-midnight meridian plane showing the principal features of the Earth’s plasma environment.  The solid lines with arrows show magnetic field lines, while the dashed lines show the bow shock and magnetopause as marked.  The coloured dots show the principal plasma populations originating in the solar wind (green) and the Earth’s ionosphere (blue). Both plasma sources contribute to the hot plasma sheet population located at the centre plane of the tail (red). [After Cowley 1993] FIGURE 2. Combined Cluster-CUTLASS radar measurements obtained on 14 February 2001.  The top three panels show Cluster magnetometer data in boundary normal co-ordinates.  The bottom three panels show power and Doppler velocity measurements from beam 3 of the CUTLASS HF radar.  Vertical dashed lines indicate the principal flux transfer events (marked ‘FTE’), magnetopause transitions (‘MP’), and the inner edge of the magnetopause boundary layer observed in the Cluster data.  [Adapted from Wild et al. 2001] FIGURE 3. Meridian scanning photometer observations of the dayside cusp emission obtained from Ny  Ålesund (Svalbard) on 30  November 1997.  Colour-coded contours of 630  nm emission intensity are plotted versus zenith angle (degrees) and time (UT).  For magnetic local time, add ~3 h.  The photometer scans in the magnetic meridian, with north at the top, zenith at the centre, and south at the bottom.  [From Sandholt et al. 1999] FIGURE 4. Four successive images of the UV aurora obtained at 3 min intervals on 26 August 1998 by the UVI instrument on the Polar spacecraft are shown in the grey pixels, on which are superposed CUTLASS Finland observations of Doppler velocity as indicated by the colour scale on the right.  The field-of-view of the radar is indicated by the dashed-line wedge.  The noon meridian   14 is the vertical line at upper right in each plot, while the dusk meridian is the horizontal line at lower left.  The dashed circles indicate magnetic latitude at steps of 10      \tet al. 2000] FIGURE 5. Plasma streamlines and flow vectors derived from SuperDARN radar measurements on 2 December 1999 (black) are shown projected onto a geomagnetic grid and are superposed on a UV auroral image obtained from the Polar VIS camera (blue).  The red vectors are magnetic disturbance vectors which have been rotated anti-clockwise by 90       !&quot;\t\t they are due wholly to overhead Hall currents.  The auroral intensities are indicated by the scale on the right hand side, while the scale for the flow and magnetic vectors is shown at upper left.  The logo at lower right indicates the concurrent direction and strength of the IMF in the Y-Z plane.  The time given at upper centre represents the centre time of the 32.5 s integration interval of the UV image, while the interval shown in brackets is the 2-min interval of the radar scan, which contains this centre time.  [From Grocott et al. 2001] FIGURE 6. SuperDARN radar data for two 2 min intervals on 2 December 1999 are shown projected onto a magnetic grid in a similar format to figure 5.  The simultaneous direction of the IMF is indicated by the logo in the lower right hand corner of each plot.  The difference between the maximum and minimum ionospheric potentials associated with the flow are given at lower left.","cites":null},{"id":16359292,"title":"Interplanetary field control of dayside auroral activity and the transfer of momentum across the dayside magnetopause.","authors":[],"date":"1989","doi":"10.1016\/0032-0633(89)90106-2","raw":"Lockwood, M., Sandholt, P.E., Cowley, S.W.H. & Oguti, T. 1989 Interplanetary field control of dayside auroral activity and the transfer of momentum across the dayside magnetopause. Planet. Space Sci. 37, 1347-1365.","cites":null},{"id":16359283,"title":"Interplanetary magnetic field and the auroral zones.","authors":[],"date":"1961","doi":"10.1103\/physrevlett.6.47","raw":"Dungey, J.W. 1961 Interplanetary magnetic field and the auroral zones.  Phys. Rev. Lett. 6, 47-48.","cites":null},{"id":16359286,"title":"Ionospheric flows and magnetic disturbance during extended intervals of northward but By-dominated IMF.","authors":[],"date":"2001","doi":"10.5194\/angeo-21-509-2003","raw":"Grocott,  A. & Cowley,  S.W.H. 2001 Ionospheric flows and magnetic disturbance during extended intervals of northward but By-dominated IMF. Ann. Geophysicae, submitted.","cites":null},{"id":16359311,"title":"Localised activation of the distant tail neutral line just prior to substorm onsets.","authors":[],"date":"1998","doi":"10.1029\/98ja01037","raw":"Watanabe, M., Pinnock, M., Rodger, A.S., Sato, N., Yamagishi, H., Yukimatu, A.S., Greenwald, R.A., Villain, J.-P. & Hairston,  M.R. 1998 Localised activation of the distant tail neutral line just prior to substorm onsets. J. Geophys. Res. 103, 17651-17669.","cites":null},{"id":16359317,"title":"m s-1","authors":[],"date":"2000","doi":"10.1109\/ieeestd.2000.94439","raw":"12 MLT 06 MLT 00 MLT 18 MLT -21 -21 -9 -9 -9 2000 m s-1 +Z   (5 nT) +Y (-76 min)      = 39 kV 02 Dec 1999 05:16 -05:18 UT","cites":null},{"id":16359301,"title":"Midday auroral breakup events and related energy and momentum transfer from the magnetosheath.","authors":[],"date":"1990","doi":"10.1029\/ja095ia02p01039","raw":"Sandholt, P.E., Lockwood, M., Oguti, T., Cowley, S.W.H., Freeman, K.S.C., Lybekk, B., Egeland, A. & Willis, D.M. 1990 Midday auroral breakup events and related energy and momentum transfer from the magnetosheath. J.","cites":null},{"id":16359308,"title":"Multi-stage substorm expansion: Auroral dynamics in relation to plasma sheet particle injection, precipitation, and plasma convection.","authors":[],"date":"2001","doi":null,"raw":"Sandholt,  P.E., Farrugia,  C.J., Lester,  M., Cowley,  S.W.H., Milan,  S.E., Denig,  W.F., Lybekk,  B., Trondsen,  E., & Vorobjev, V. 2001 Multi-stage substorm expansion: Auroral dynamics in relation to plasma sheet particle injection, precipitation, and plasma convection. J. Geophys. Res. in press.","cites":null},{"id":16359291,"title":"Observations of two complete substorm cycles during the Cassini Earth swing–by: Cassini magnetometer data in a global context.","authors":[],"date":"2001","doi":"10.1029\/2001ja900049","raw":"Khan, H.,  Cowley, S.W.H.,  Kolesnikova, E.,  Lester, M.,  Brittnacher, M.J.,  Hughes, T.J.,  Hughes, W.J.,  Kurth, W.S., McComas, D.J.,  Newitt, L.,  Owen, C.J.,  Reeves, G.D.,  Singer, H.J.,  Smith, C.W.,  Southwood, D.J.,  & Watermann, J.F. 2001 Observations of two complete substorm cycles during the Cassini Earth swing–by: Cassini magnetometer data in a global context. J. Geophys. Res., in press.","cites":null},{"id":16359298,"title":"Statistical observations of the MLT, latitude and size of pulsed ionospheric flows with the CUTLASS Finland radar.","authors":[],"date":"1999","doi":"10.1007\/s00585-999-0855-1","raw":"Provan, G. & Yeoman, T.K. 1999 Statistical observations of the MLT, latitude and size of pulsed ionospheric flows with the CUTLASS Finland radar. Ann. Geophysicae 17, 855-867.","cites":null},{"id":16359296,"title":"Structure and dynamics of magnetic reconnection for substorm onsets with Geotail observations.","authors":[],"date":"1998","doi":"10.1029\/97ja02190","raw":"Nagai, T., Fujimoto, M., Saito, Y., Machida, S., Teresawa, T., Nakamura, R., Yamamoto, T., Mukai, T., Nishida, A. & Kokubun, S. 1998 Structure and dynamics of magnetic reconnection for substorm onsets with Geotail observations. J. Geophys. Res. 103, 4419-4440.","cites":null},{"id":16359304,"title":"The dynamic cusp aurora on 30","authors":[],"date":"1999","doi":"10.1007\/s00585-999-1155-5","raw":"Sandholt,  P.E., Farrugia,  C.J. & Lybekk,  B. 1999 The dynamic cusp aurora on 30 November 1997: Response to southward turning of the IMF. Ann. Geophysicae 17, 1155-1165.","cites":null},{"id":16359289,"title":"The frontside boundary layer of the magnetopause and the problem of reconnection.","authors":[],"date":"1978","doi":"10.1029\/ja083ia07p03195","raw":"Haerendel, G., Paschmann, G., Sckopke, N., Rosenbauer H. & Hedgecock P.C. 1978 The frontside boundary layer of the magnetopause and the problem of reconnection. J. Geophys. Res. 83, 3195-3216.","cites":null},{"id":16359279,"title":"The magnetosphere and its interaction with the solar wind and with the ionosphere.","authors":[],"date":"1993","doi":"10.1007\/978-94-011-2048-7_7","raw":"Cowley, S.W.H. 1993 The magnetosphere and its interaction with the solar wind and with the ionosphere. In The behaviour of systems in the space environment (ed. R.N. DeWitt, D.P.  Duston & A.K. Hyder), pp.  147-181.","cites":null},{"id":16359294,"title":"Two-dimensional electric field measurements in the ionospheric footprint of a flux transfer event.","authors":[],"date":"2001","doi":"10.1007\/s005850000295","raw":"McWilliams,  K.A., Yeoman,  T.K. & Cowley,  S.W.H. 2001 Two-dimensional electric field measurements in the ionospheric footprint of a flux transfer event. Ann. Geophysicae 18, 1584-1598.","cites":null},{"id":16359309,"title":"What are flux transfer events?","authors":[],"date":"1988","doi":"10.1016\/0032-0633(88)90109-2","raw":"Southwood, D.J., Farrugia, C.J. & Saunders M.A. 1988 What are flux transfer events? Planet. Space Sci. 36, 503-508.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2003-01","abstract":"The properties of the Earth’s coupled magnetosphere-ionosphere system are dominated by its interaction with the solar wind plasma, mediated by magnetic reconnection processes at the magnetopause interface. In this paper we focus on recent progress and remaining questions concerning the nature of these interactions, how they depend on the orientation of the interplanetary magnetic field (IMF), and the consequences which follow for internal dynamics. The progress we report, on flux transfer events and substorms during intervals of southward IMF, and magnetopause and tail processes during intervals of northward IMF, emphasise the great diagnostic power of combined in situ and remote sensing observations from space and on the ground","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71176.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/6622\/1\/Roy_Soc_Paper_Revised.pdf","pdfHashValue":"5f2ee87aad932faa005889b61960eda8c7a611e3","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:6622<\/identifier><datestamp>\n      2018-01-24T03:14:55Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Solar wind-magnetosphere-ionosphere interactions in the earth's plasma environment<\/dc:title><dc:creator>\n        Cowley, S. W. H.<\/dc:creator><dc:creator>\n        Davies, J. A.<\/dc:creator><dc:creator>\n        Grocott, A.<\/dc:creator><dc:creator>\n        Khan, H.<\/dc:creator><dc:creator>\n        Lester, M.<\/dc:creator><dc:creator>\n        McWilliams, K. A.<\/dc:creator><dc:creator>\n        Milan, S. E.<\/dc:creator><dc:creator>\n        Provan, G.<\/dc:creator><dc:creator>\n        Sandholt, P. E.<\/dc:creator><dc:creator>\n        Wild, J. A.<\/dc:creator><dc:creator>\n        Yeoman, T. K.<\/dc:creator><dc:description>\n        The properties of the Earth’s coupled magnetosphere-ionosphere system are dominated by its interaction with the solar wind plasma, mediated by magnetic reconnection processes at the magnetopause interface. In this paper we focus on recent progress and remaining questions concerning the nature of these interactions, how they depend on the orientation of the interplanetary magnetic field (IMF), and the consequences which follow for internal dynamics. The progress we report, on flux transfer events and substorms during intervals of southward IMF, and magnetopause and tail processes during intervals of northward IMF, emphasise the great diagnostic power of combined in situ and remote sensing observations from space and on the ground.<\/dc:description><dc:date>\n        2003-01<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/6622\/1\/Roy_Soc_Paper_Revised.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1098\/rsta.2002.1112<\/dc:relation><dc:identifier>\n        Cowley, S. W. H. and Davies, J. A. and Grocott, A. and Khan, H. and Lester, M. and McWilliams, K. A. and Milan, S. E. and Provan, G. and Sandholt, P. E. and Wild, J. A. and Yeoman, T. K. (2003) Solar wind-magnetosphere-ionosphere interactions in the earth's plasma environment. Philosophical Transactions of the Royal Society of London A, 361 (1802). pp. 113-126. ISSN 0264-3820<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/6622\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1098\/rsta.2002.1112","http:\/\/eprints.lancs.ac.uk\/6622\/"],"year":2003,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":" 1 \nSolar wind-magnetosphere-ionosphere interactions in the Earth’s plasma \nenvironment \n \nBY S.W.H. COWLEY1, J.A. DAVIES1, A. GROCOTT1, H. KHAN1, M. LESTER1, K.A. MCWILLIAMS1, \nS.E. MILAN1, G. PROVAN1, P.E. SANDHOLT2, J.A. WILD1, AND T.K. YEOMAN1 \n1Department of Physics & Astronomy, University of Leicester, Leicester LE1 7RH, UK \n2Department of Physics, University of Oslo, N-0316 Oslo, Norway \n \nThe properties of the Earth’s coupled magnetosphere-ionosphere system are dominated \nby its interaction with the solar wind plasma, mediated by magnetic reconnection at the \nmagnetopause interface.  As a consequence, Earth’s magnetospheric dynamics depend \nprimarily on the concurrent orientation of the interplanetary magnetic field (IMF).  In \nthis paper we illustrate current understanding of the system through the results of a \nnumber of recent case studies, and highlight remaining issues.  The discussion centres \non flux transfer events and substorms during intervals of southward IMF, and \nmagnetopause and tail processes during intervals of northward IMF.  We emphasise the \ngreat diagnostic power of combined in situ and remote sensing observations from space \nand on the ground. \n \nKey index words:  Magnetosphere, ionosphere, solar wind interactions \n \n1. INTRODUCTION \nKnowledge of the Earth’s magnetosphere is of major practical relevance as it is the plasma medium \nin which a range of applications spacecraft must be designed to operate, used e.g. for \ncommunications, navigation, meteorology, and defence.  The ionospheric plasma medium is also \nimportant in a range of applications, such as HF communications, direction-finding, and ‘over-the-\n 2 \nhorizon’ radars.  In this paper we briefly review recent progress in understanding the major physical \nprocesses which govern the properties of these coupled plasma systems, and some open questions. \nThe main factor which governs the properties of the near-Earth plasma medium is its interaction \nwith the solar wind plasma, which blows continuously outward from the Sun at speeds ~400 km s–1.  \nThe structures to which this interaction gives rise are sketched in figure 1, in which the solar wind \nblows from left to right.  The arrowed lines indicate magnetic field lines, while the dashed lines \nshow important boundaries, namely the bow shock, formed because the solar wind is supersonic in \nthe Earth’s frame, and the magnetopause, the boundary of the Earth’s magnetic field, inside of \nwhich lies the magnetosphere.  To a first approximation the magnetosphere deflects the solar wind \nand frozen-in interplanetary magnetic field (IMF) around the Earth, forming a magnetic cavity \nwhich extends ~10 Earth radii (RE \u0001 6400 km) upstream from the Earth, determined by pressure \nbalance.  However, the diagram also indicates the most important dynamical process occurring in \nthe system, which is that at a 10-20% level the interplanetary flux which is brought up to the \nmagnetopause by the solar wind becomes connected to the Earth’s field by magnetic reconnection \n(Dungey 1961).  The reconnection process shown in the figure is that which occurs when a large \nmagnetic shear is present at the subsolar boundary, i.e. when the IMF ‘points south’.  In this case \n‘open’ flux tubes are formed which connect the Earth’s polar regions into interplanetary space.  The \nprocesses which occur when the IMF points northward will be addressed below.  In the situation \nshown in figure 1, the open tubes produced on the dayside are subsequently carried into the \nnightside by the solar wind, and are stretched out into a long comet-like tail which extends \ndownstream to distances of ~1000 RE.  Further reconnection in the centre of the tail, as shown, then \nreleases closed flux tubes back towards the Earth and eventually to the dayside, where the process \nrepeats.  The consequence is a large-scale cyclical flow in the magnetosphere, and in the polar \nionosphere to which it maps, with a typical cycle time of about half a day. \nThis cyclical flow (the ‘Dungey cycle’) is also largely deterministic of the plasma populations \nfound inside the magnetosphere, as indicated by the dotted regions in the figure.  Plasma of solar \n 3 \nwind origin (green dots) gains access to the magnetosphere via open field lines, producing boundary \nlayers inside the magnetopause which extend down to the dayside ionosphere forming the cool (few \nhundred eV) ‘dayside cusp’ precipitation.  On the nightside, this plasma flows downstream in the \ntail lobes and into the centre of the tail, where it is heated in the reconnection process to form the \nhot (several keV) plasma sheet population (red dots).  Cold plasma (few tens of eV) from the polar \nionosphere, consisting of oxygen ions as well as protons (and electrons) (shown by the outer region \nof blue dots), also flows into the tail and becomes heated to form part of the plasma sheet.  Dense \ncold (few eV) ionospheric plasma is also present in an inner core of flux tubes (inner blue dots), \nforming the plasmasphere.  These inner flux tubes do not take part in Dungey-cycle flow, but \ninstead rotate with the Earth.  Geostationary orbit, where many applications spacecraft are placed, is \nlocated near this boundary between hot and cold plasma.  Since the boundary can move due to IMF-\ninduced modulations of Dungey-cycle flow, a cold dense plasma environment can, at short notice, \nbe replaced by hot tenuous plasma flowing in from the tail.  This plasma behaviour makes \ngeostationary orbit a tough environment from a space engineering viewpoint, additional to the \neffect of penetrating relativisitic electrons from the outer radiation belt, whose fluxes appear to \ndepend instead on the solar wind speed via the power in magnetospheric ULF waves (Mathie and \nMann, 2000). \n \n2. FLUX TRANSFER EVENTS \nIn this section we consider the nature of the primary reconnection process at the dayside \nmagnetopause for large subsolar magnetic shear, which initiates the flow cycle outlined above.  \nObservations of fields and plasma at the magnetopause more than twenty years ago showed that the \nprocess is characteristically pulsed on time scales of 5-10 min, forming ‘flux transfer events’ \n(FTEs) (Haerendel et al. 1978; Russell and Elphic 1978).  The magnetic signatures of more recent \nexamples, observed by the Cluster 1 spacecraft on 14 February 2001, are shown in figure 2 (Wild et \nal. 2001).  Here the spacecraft was located in the post-noon sector at ~14.3 h MLT, and at ~61\u0002\u0003\n 4 \nmagnetic latitude, and moved outward over the one-hour interval shown from a geocentric distance \nof 11.3 to 12.2 RE.  The three magnetic components in the upper panels of the figure are in \nboundary normal co-ordinates (determined from minimum variance analysis of the data), in which \nN is the outward normal to the magnetopause, and L and M lie in the boundary pointing roughly \nnorthward and westward, respectively.  Initially the spacecraft was located inside the \nmagnetosphere, but crossed into the magnetosheath (the shocked solar wind downstream of the bow \nshock) across a boundary layer (the inner edge marked as ‘BL’) and three magnetopause transitions \n(marked ‘MP’).  Both inside the magnetosphere and in the magnetosheath, characteristic bipolar \nsignatures were observed in the BN field component (marked ‘FTE’) which are interpreted as being \ndue to bursts of reconnection which produce bulges of open flux propagating over the \nmagnetopause (Southwood et al. 1988).  Statistical studies show that the occurrence of these \nsignatures is strongly favoured during intervals of large magnetic shear at the subsolar \nmagnetopause (Rijnbeek et al. 1984), thus supporting this interpretation. \nIf they are produced by reconnection, FTEs should also be accompanied by pulsed flow in the \ndayside magnetosphere and ionosphere, and pulsed precipitation in the dayside cusp.  It has been \nfound that both these effects are characteristic of intervals of large subsolar magnetic shear \n(Lockwood et al. 1989; Pinnock et al. 1995; Sandholt et al. 1990), though simultaneously-observed \nevents in space and in the ionosphere remain a rarity (Elphic et al. 1990; Neudegg et al. 2000), \nmainly for logistical reasons.  The lower panels of figure 2 show simultaneous data from beam 3 of \nthe CUTLASS Finland HF radar, obtained in the cusp ionosphere near the estimated Cluster \nmagnetic footprint.  The upper of these panels shows the backscatter power, the middle panel the \nline-of-sight Doppler velocity, and the lower panel the mean Doppler velocity in the latitude band \ndefined by the dashed lines in the middle panel, which encompassed the latitude of the footprint of \nCluster.  It can be seen that pulses in both the backscatter power and Doppler velocity occur in \nsynchronism with the FTEs observed by Cluster, the latter directly implying input of momentum \ninto the magnetosphere.  Several of these pulses also appear to act as sources for poleward-moving \n 5 \nfeatures in the radar backscatter, which occur commonly in cusp radar data (e.g. Provan and \nYeoman 1999).  Similar poleward-moving forms are also commonly observed in dayside auroral \ndata, and an example from another interval is shown in figure 3 (Sandholt et al. 1999).  Here we \nshow meridian-scanning photometer (MSP) data from Ny Ålesund (Svalbard), obtained in the post-\nnoon sector on 30 November 1997, specifically for the oxygen red line emission (630 nm), which \ntypically is excited at ~250 km altitude by low-energy (tens to hundreds of eV) electrons.  In \ncommon with the radar data, a pulsed band of precipitation is present (which drifts slowly \nequatorward in this case following a southward turn of the IMF), in which the pulses are associated \nwith transient auroral forms which propagate poleward. \nIt is clearly difficult to determine the geometry and propagation of FTEs either from single \nspacecraft in situ data at the magnetopause, or from local measurements on the ground.  Progress \nusing in situ data requires multi-spacecraft observations, work on which is currently opening up via \nnewly available four-spacecraft data from the Cluster mission.  In addition, important clues can also \nbe obtained from ‘global’ ground-based observations of the aurora and radar backscatter.  Results \nfrom the first published study of the latter nature are shown in figure 4 (Milan et al. 2000).  Here we \nshow four successive images of the UV aurora obtained at 3 min intervals on 26 August 1998 by \nthe UVI instrument on the Polar spacecraft, projected onto a magnetic grid with noon at the top and \ndusk to the left.  In the first image, a kink is visible in the auroral band at ~1430 MLT and ~72\u0002\u0003\nlatitude.  This evolves into an eastward-propagating bifurcation in the second image, which has \nreached ~1630 MLT in the third image, and ~1800 MLT in the fourth (where a further event is also \nstarting to form nearer to noon).  It seems clear that these auroral effects and the transients observed \nin the MSP data shown in figure 3 are related phenomena, and indicate that (in the present case \nduring an interval of positive IMF By), the transients start in the post-noon sector, and propagate \neastward over ~6 h of MLT in ~10 min.  The coloured pixels overlaid on the auroral data show the \nregions of radar backscatter observed simultaneously by the CUTLASS Finland radar.  The data \nplotted in the pixels represent the line-of-sight Doppler velocity.  It can be seen that ‘poleward-\n 6 \nmoving radar auroral forms’ are observed, co-located with the UV auroras, in which the Doppler \nvelocity indicates the presence of strong westward flows (consistent with the field tension effects \nexpected for positive IMF By).  These data are interpreted as representing the response to individual \n‘FTE’ bursts of reconnection, which are thus envisaged to propagate wave-like on the \nmagnetopause from near noon to the magnetospheric flanks over intervals of ~10 min or more.  The \nUV aurora is excited by the precipitation of accelerated electrons in regions of upward field-aligned \ncurrent, while the radar backscatter results from ionospheric irregularities which grow in the \nstructured ionosphere produced by the precipitation and flow (Davies et al. 2001).  Patches of \nrelated backscatter have been tracked in their motion across the polar cap over several tens of \nminutes (McWilliams et al. 2001).  Results such as these are currently in the process of elucidating \nthe dynamics of the dayside magnetopause for large subsolar magnetic shear, and substantial future \nprogress is anticipated from co-ordinated measurements with Cluster.  However, the underlying \nreason for the pulsed nature of FTEs has yet to be determined. \n \n3. SUBSTORMS \nDuring intervals of large subsolar magnetic shear at the dayside magnetopause, the open flux \nproduced is transported to the nightside by the solar wind, and the magnetic flux in the tail lobes \nincreases.  This growth lasts typically for 30-50 min before the tail becomes unstable, and rapid \nreconnection begins within the near-Earth dusk side plasma sheet, at down-tail distances of 20-\n30 RE (Nagai et al. 1998).  As a consequence, much of the pre-existing plasma sheet is pinched off \nfrom Earth in this sector, forming a plasmoid which propagates tailward out of the magnetosphere \nat speeds of 500-1000 km s–1, as sketched schematically in figure 1.  Earthward of the reconnection \nregion, the newly closed field lines collapse towards the Earth, compressing and heating the tail \nplasma, and causing bright auroras at the feet of the field lines.  Such events are called substorms, \nwhich are another feature characteristic of intervals of (or just following) southward IMF. \n 7 \nThe region of bright nightside auroras which occurs during a substorm is called the ‘substorm \nauroral bulge’ and within it large westward-directed currents flow (a few million amps), which \nclose via field-aligned currents at its eastward and westward ends.  These currents produce large \n(few hundred nT) southward-directed perturbation magnetic fields on the ground in the region \nunderneath the bulge (the induced line voltages associated with which are a matter of serious \nconcern for power distribution companies).  These currents are not driven by large electric fields, \nhowever, but are rather associated with very large electrical conductivities produced in the bulge \nionosphere by the precipitating auroral electrons.  Instead, the electric field is found to be strongly \nsuppressed within the bulge, corresponding to a suppression of the plasma velocity (related to the \nelectric field by V = E ×B( ) B2 , where B is the magnetic field) (e.g. Yeoman et al. 2000; Khan et \nal. 2001).  To date, the electrodynamic origin of this suppression and its coupling with the \nmagnetosphere have yet to be determined, whether it is associated, for example, with enhanced ion-\nneutral frictional drag which is communicated to the magnetosphere, or whether it might involve \nlarge-scale ionosphere-magnetosphere decoupling by field-aligned voltages. \nOn the other hand, tail reconnection contributes to the Dungey cycle by closing open flux tubes \nin the lobes and returning them to Earth, so we would expect it to excite magnetospheric flow.  \nIndeed, localised nightside flow intensifications are known to occur during all phases of the \nsubstorm cycle in association with localised ‘poleward boundary intensifications’ of the auroras and \n‘bursty bulk flows’ in the tail, taken to be the signatures of azimuthally localised bursts of tail \nreconnection (e.g. Watanabe et al. 1998).  Substorms should produce similar effects but on a larger \nscale, and very recently detailed flow observations by the SuperDARN HF radar array during a \nsmall high-latitude substorm have revealed clear evidence for excitation of large-scale nightside \nflow (Grocott et al. 2001).  Figure 5 shows a plot of radar flow vectors (black) and inferred \nstreamlines of the ionospheric plasma flow for a 2 min interval occurring ~10 min after substorm \nexpansion onset.  These have been superposed on a simultaneous UV auroral image obtained by the \nVIS camera on the Polar spacecraft (blue).  The red vectors also show magnetic perturbation \n 8 \nvectors, which have been rotated anti-clockwise by 90\u0002\u0003\u0004\u0005\u0006\u0007\u0003\b\u0007\t\b\u0003\b\u0007\n\u000b\u0003\f\r\u000e\u000f\b\u0003\u000e\u000f\u0003\b\u0007\n\u0003\u0010\u000e\u0011\n\u0006\b\u000e\r\u000f of the \nflow if they are produced wholly by an overhead Hall current.  It can be seen that the flow is of \ntwin-vortex form, with anti-sunward flow over the polar cap and return sunward flow at lower \nlatitudes, typical of the Dungey cycle, but where the flow vectors tend to be deflected around the \nbrightest part of the auroral bulge in the midnight sector.  The few flow vectors observed within the \nlatter tend to be small, in accordance with the flow suppression mentioned above.  Overall, the \nvoltage associated with the flow, equal to 67 kV during the interval shown, increased from ~40 kV \nprior to onset, to a peak of ~80 kV after ~15 min, and then declined to ~35 kV over ~10 min of \nrecovery.  Flow excitations during larger substorms have also been reported by Sandholt et al. \n(2001). \n \n4. THE MAGNETOSPHERE FOR NORTHWARD IMF \nWhile FTEs and substorms are the primary characteristics of the magnetosphere for large \nsubsolar magnetic shear, the properties of the magnetosphere for low subsolar magnetic shear are \nmore subtle and less well determined.  Observations of dayside auroras (such as those shown in \nfigure 3) suggest that open flux production does not switch off entirely until the ‘clock’ angle of the \nIMF (the angle in the Y-Z plane relative to north) decreases to become less than ~45\u0002\u0003\u0012\n\u0013\u0014\u0013\u0003\u0015\t\u000f\u0010\u0007\r\u0016\b\u0003\net al. 1998).  The magnetosphere thus remains weakly driven by open flux production when the \nIMF is northward but dominated by the By component.  An interesting question then concerns \nwhether substorms, perhaps weak or more infrequent, occur under such circumstances.  This has \nrecently been investigated by Grocott and Cowley (2001) who examined magnetometer and radar \nflow data during extended (several hour) intervals of northward but By-dominated IMF.  They \nfound that weak By-asymmetric flow was continuously present in the ionosphere, interspersed every \nhour or so by strong surges of nightside flow lasting a few tens of minutes.  Examples of the former \nand latter types of flow are shown on the left and right sides of figure 6, respectively, in a similar \nformat to figure 5.  These two observation intervals were separated by 30 min under similar \n 9 \ninterplanetary field conditions.  No large ground magnetic perturbations characteristic of substorms \nwere observed, including during the flow surges, indicating that the ionospheric conductivity was \nnot significantly enhanced by auroral precipitation (no auroral data is available in these cases).  \nHowever, the flow surges do appear to be associated with contractions of the polar cap, and hence \nwith open flux destruction by tail reconnection.  The reconnection is presumably confined to the \nmore distant tail, rather than occurring near-Earth as during substorms. \nIn addition to the reduction of open flux production as the IMF turns northward, the dayside \nreconnection sites migrate to higher latitudes and begin to encompass reconnection with previously \nopened flux in the tail lobes.  When a significant By component is still present, this ‘lobe \nreconnection’ appears to involve one lobe only for a given field line, so that the amount of open \nflux in the system does not change, only the mapping of the open field lines to the magnetosheath.  \nThe dynamical consequence is that the open flux is ‘stirred’ into By-dependent vortical motion by \nfield tension effects on the ‘new’ open field lines.  However, when the IMF is closely northward \n(the limits not yet having been precisely determined), lobe reconnection appears to be able to occur \nin both northern and southern hemispheres for given flux tubes, at least sequentially.  This process \nthen removes open flux from the tail, and adds new closed field lines to the dayside.  The \ncharacteristic magnetospheric feature of this process is boundary layer plasmas adjacent to the \nmagnetopause which have continuous properties across the boundary between open and closed field \nlines.  Characteristic features in the dayside auroras are shown in figure 7, which shows 630 nm \nMSP data from Ny Ålesund in the same format as figure 3, during an interval in which the IMF \nclock angle was typically less than ~20\u0002\u0003\u0012\u0015\t\u000f\u0010\u0007\r\u0016\b\u0003\n\b\u0003\t\u0016\u0013\u0003\u0017\u0018\u0018\u0018\u0019\u0013\u0003\u0003\u001a\b\u0003\u0006\t\u000f\u0003\u001b\n\u0003\u0004\n\n\u000f\u0003\b\u0007\t\b\u0003\u0010\u0005\u0011\u000e\u000f\u0014\u0003\b\u0007\n\u0003\n\t\u0011\u0016\u000b\u0003\npart of the interval the band of precipitation grew substantially in thickness via a series of ‘steps’ at \nthe poleward border.  This is interpreted as being due to a sequence of discrete two-lobe \nreconnection events which appended new closed flux tubes to the dayside magnetopause.  Weak \n‘reversed’ flow cells were observed, as expected, in simultaneous radar data. \n \n 10 \n5. SUMMARY \nThe Earth’s coupled magnetosphere-ionosphere is a complex plasma system whose dynamics are \ndriven principally by the solar wind via magnetic reconnection at the boundary.  As such, the \nsystem responds strongly to the direction of the IMF, and is typically in a state of change as the \nIMF direction changes.  Research over the past ~25 years has succeeded in establishing much of the \nmorphology and characteristic behaviours of the system, but major questions remain to be \nanswered, such as why magnetopause reconnection is characteristically pulsed, and what \ndetermines the location and onset of the tail reconnection region during substorms.  While many of \nthe initial fundamental discoveries were made using either space-based data alone (e.g. the \nexistence of FTEs), or ground-based data alone (e.g. the existence of substorms), future progress \nrequires a more holistic approach, requiring co-ordinated multi-point space- and ground-based \nobservations, combined with theory and modelling.  In addition, a full understanding of the solar-\nterrestrial environment also requires co-ordinated studies of the solar and heliospheric drivers of \nmagnetospheric and ionospheric activity, as well as studies of the latter’s consequences in the \nupper, middle and lower atmosphere, topics which are addressed elsewhere in these proceedings. \n \nACKNOWLEDGEMENTS \nWork at the University of Leicester was funded by PPARC Grants PPA\/G\/O\/1999\/00181 \n(Rolling Grant science support), PPA\/R\/R\/1997\/00256 (CUTLASS National Facility support), and \nPPA\/N\/S\/2000\/00197 (SWHC Senior Fellowship).  The auroral observation programme at Ny \nÅlesund is supported by the Norwegian Research Council (Norges forskningsråd) and the \nNorwegian Polar Research Institute. \n \nREFERENCES \nCowley, S.W.H. 1993 The magnetosphere and its interaction with the solar wind and with the ionosphere. In The \nbehaviour of systems in the space environment (ed. R.N. DeWitt, D.P. Duston & A.K. Hyder), pp. 147-181. \nDordrecht: Kluwer Acad. Publ. \n 11 \nDavies, J.A., Yeoman, T.K., Rae, I.J., Milan, S.E., Lester, M., McWilliams, K.A. & Lockwood, M. 2001 Ground-based \nobservations of the auroral zone and polar cap ionospheric responses to dayside transient reconnection. Ann. \nGeophysicae, submitted. \nDungey, J.W. 1961 Interplanetary magnetic field and the auroral zones.  Phys. Rev. Lett. 6, 47-48. \nElphic, R.C., Lockwood, M., Cowley, S.W.H. & Sandholt, P.E. 1990 Flux transfer events at the magnetopause and in \nthe ionosphere. Geophys. Res. Lett. 17, 2241-2244. \nGrocott, A. & Cowley, S.W.H. 2001 Ionospheric flows and magnetic disturbance during extended intervals of \nnorthward but By-dominated IMF. Ann. Geophysicae, submitted. \nGrocott, A., Cowley, S.W.H., Sigwarth, J.B., Watermann, J.F. & Yeoman, T.K. 2001 Excitation of twin-vortex flow in \nthe nightside high-latitude ionosphere during an isolated substorm. Ann. Geophysicae, submitted. \nHaerendel, G., Paschmann, G., Sckopke, N., Rosenbauer H. & Hedgecock P.C. 1978 The frontside boundary layer of \nthe magnetopause and the problem of reconnection. J. Geophys. Res. 83, 3195-3216. \nKhan, H., Cowley, S.W.H., Kolesnikova, E., Lester, M., Brittnacher, M.J., Hughes, T.J., Hughes, W.J., Kurth, W.S., \nMcComas, D.J., Newitt, L., Owen, C.J., Reeves, G.D., Singer, H.J., Smith, C.W., Southwood, D.J., & \nWatermann, J.F. 2001 Observations of two complete substorm cycles during the Cassini Earth swing–by: Cassini \nmagnetometer data in a global context. J. Geophys. Res., in press. \nLockwood, M., Sandholt, P.E., Cowley, S.W.H. & Oguti, T. 1989 Interplanetary field control of dayside auroral activity \nand the transfer of momentum across the dayside magnetopause. Planet. Space Sci. 37, 1347-1365. \nMathie, R.A. & Mann, I.R. 2000 A correlation between extended intervals of ULF wave power and storm-time \ngeosynchronous relativisitic electron flux enhancements. Geophys. Res. Lett. 27, 3261-3264. \nMcWilliams, K.A., Yeoman, T.K. & Cowley, S.W.H. 2001 Two-dimensional electric field measurements in the \nionospheric footprint of a flux transfer event. Ann. Geophysicae 18, 1584-1598. \nMilan, S.E., Lester, M., Cowley, S.W.H. & Brittnacher, M. 2000 Convection and auroral response to a southward \nturning of the IMF: Polar UVI, CUTLASS, and IMAGE signatures of transient magnetic flux transfer at the \nmagnetopause. J. Geophys. Res. 105, 15741-15755. \nNagai, T., Fujimoto, M., Saito, Y., Machida, S., Teresawa, T., Nakamura, R., Yamamoto, T., Mukai, T., Nishida, A. & \nKokubun, S. 1998 Structure and dynamics of magnetic reconnection for substorm onsets with Geotail observations. \nJ. Geophys. Res. 103, 4419-4440. \nNeudegg, D.A., Cowley, S.W.H., Milan, S.E., Yeoman, T.K., Lester, M., Provan, G., Haerendel, G., Baumjohann, W., \nNikutowski, B., Büchner, J., Auster, U., Fornacon, K.-H. & Georgescu, E. 2000 A survey of magnetopause FTEs \nand associated flow bursts in the polar ionosphere. Ann. Geophysicae 18, 416-435. \n 12 \nPinnock, M., Rodger, A.S., Dudeney, J.R., Rich, F. & Baker, K.B. 1995 High spatial and temporal resolution \nobservations of the ionospheric cusp. Ann. Geophysicae 13, 919-925. \nProvan, G. & Yeoman, T.K. 1999 Statistical observations of the MLT, latitude and size of pulsed ionospheric flows \nwith the CUTLASS Finland radar. Ann. Geophysicae 17, 855-867. \nRijnbeek, R.P., Cowley, S.W.H., Southwood, D.J. & Russell, C.T. 1984 A survey of dayside flux transfer events \nobserved by ISEE 1 and 2 magnetometers. J. Geophys. Res. 89, 786-800. \nRussell, C.T. & Elphic, R.C. 1978 Initial ISEE magnetometer results: magnetopause observations. Space Sci. Rev. 22, \n681-715. \nSandholt, P.E., Lockwood, M., Oguti, T., Cowley, S.W.H., Freeman, K.S.C., Lybekk, B., Egeland, A. & Willis, D.M. \n1990 Midday auroral breakup events and related energy and momentum transfer from the magnetosheath. J. \nGeophys. Res. 95, 1039-1060. \nSandholt, P.E., Farrugia, C.J., Moen, J. & Cowley S.W.H. 1998 Dayside auroral configurations: Responses to \nsouthward and northward rotations of the interplanetary magnetic field. J. Geophys. Res. 103, 20279-20295. \nSandholt, P.E., Farrugia, C.J. & Lybekk, B. 1999 The dynamic cusp aurora on 30 November 1997: Response to \nsouthward turning of the IMF. Ann. Geophysicae 17, 1155-1165. \nSandholt, P.E., Farrugia, C.J., Cowley, S.W.H., Lester, M., Denig, W.F., Cerisier, J.-C., Milan, S.E., Moen, J., \nTrondsen, E., & Lybekk, B. 2000 Dynamic cusp aurora and associated pulsed reverse convection during northward \ninterplanetary magnetic field. J. Geophys. Res. 105, 12869-12894. \nSandholt, P.E., Farrugia, C.J., Lester, M., Cowley, S.W.H., Milan, S.E., Denig, W.F., Lybekk, B., Trondsen, E., & \nVorobjev, V. 2001 Multi-stage substorm expansion: Auroral dynamics in relation to plasma sheet particle injection, \nprecipitation, and plasma convection. J. Geophys. Res. in press. \nSouthwood, D.J., Farrugia, C.J. & Saunders M.A. 1988 What are flux transfer events? Planet. Space Sci. 36, 503-508. \nWatanabe, M., Pinnock, M., Rodger, A.S., Sato, N., Yamagishi, H., Yukimatu, A.S., Greenwald, R.A., Villain, J.-P. & \nHairston, M.R. 1998 Localised activation of the distant tail neutral line just prior to substorm onsets. \nJ. Geophys. Res. 103, 17651-17669. \nWild, J.A., Cowley, S.W.H., Davies, J.A., Khan, H., Lester, M., Milan, S.E., Provan, G., Yeoman, T.K., Balogh, A., \nDunlop, M.W., Fornacon, K.-H., & Georgescu, E. 2001 First simultaneous observations of flux transfer events at the \nhigh-latitude magnetopause by the Cluster spacecraft and pulsed radar signatures in the conjugate ionosphere by the \nCUTLASS and EISCAT radars. Ann. Geophysicae, in press. \nYeoman, T.K., Lewis, R.V., Khan, H., Cowley, S.W.H. & Ruohoniemi, J.M. 2000 Interhemispheric observations of \nnightside ionospheric electric fields in response to IMF Bz and By changes and substorm pseudobreakup. Ann. \nGeophysicae 18, 897-907. \n 13 \n \nFIGURE CAPTIONS \nFIGURE 1. Cut through the noon-midnight meridian plane showing the principal features of the \nEarth’s plasma environment.  The solid lines with arrows show magnetic field lines, while the \ndashed lines show the bow shock and magnetopause as marked.  The coloured dots show the \nprincipal plasma populations originating in the solar wind (green) and the Earth’s ionosphere (blue).  \nBoth plasma sources contribute to the hot plasma sheet population located at the centre plane of the \ntail (red). [After Cowley 1993] \n \nFIGURE 2. Combined Cluster-CUTLASS radar measurements obtained on 14 February 2001.  The \ntop three panels show Cluster magnetometer data in boundary normal co-ordinates.  The bottom \nthree panels show power and Doppler velocity measurements from beam 3 of the CUTLASS HF \nradar.  Vertical dashed lines indicate the principal flux transfer events (marked ‘FTE’), \nmagnetopause transitions (‘MP’), and the inner edge of the magnetopause boundary layer observed \nin the Cluster data.  [Adapted from Wild et al. 2001] \n \nFIGURE 3. Meridian scanning photometer observations of the dayside cusp emission obtained from \nNy Ålesund (Svalbard) on 30 November 1997.  Colour-coded contours of 630 nm emission \nintensity are plotted versus zenith angle (degrees) and time (UT).  For magnetic local time, add \n~3 h.  The photometer scans in the magnetic meridian, with north at the top, zenith at the centre, \nand south at the bottom.  [From Sandholt et al. 1999] \n \nFIGURE 4. Four successive images of the UV aurora obtained at 3 min intervals on 26 August 1998 \nby the UVI instrument on the Polar spacecraft are shown in the grey pixels, on which are \nsuperposed CUTLASS Finland observations of Doppler velocity as indicated by the colour scale on \nthe right.  The field-of-view of the radar is indicated by the dashed-line wedge.  The noon meridian \n 14 \nis the vertical line at upper right in each plot, while the dusk meridian is the horizontal line at lower \nleft.  The dashed circles indicate magnetic latitude at steps of 10\u0002\u0003\u001c\u0011\r\u001d\u0003\b\u0007\n\u0003\f\r\u0016\n\u0013\u0003\u0003\u001e\u001f\u0011\r\u001d\u0003 \u000e\u0016\t\u000f\u0003et al. \n2000] \n \nFIGURE 5. Plasma streamlines and flow vectors derived from SuperDARN radar measurements on \n2 December 1999 (black) are shown projected onto a geomagnetic grid and are superposed on a UV \nauroral image obtained from the Polar VIS camera (blue).  The red vectors are magnetic disturbance \nvectors which have been rotated anti-clockwise by 90\u0002\u0003\u000e\u000f\b\r\u0003\b\u0007\n\u0003\u0010\u000e\u0011\n\u0006\b\u000e\r\u000f\u0003\r\u001c\u0003\b\u0007\n\u0003\u001c\u0016\r!\"\u0003\t\u0004\u0004\u0005\u001d\u000e\u000f\u0014\u0003\b\u0007\t\b\u0003\nthey are due wholly to overhead Hall currents.  The auroral intensities are indicated by the scale on \nthe right hand side, while the scale for the flow and magnetic vectors is shown at upper left.  The \nlogo at lower right indicates the concurrent direction and strength of the IMF in the Y-Z plane.  The \ntime given at upper centre represents the centre time of the 32.5 s integration interval of the UV \nimage, while the interval shown in brackets is the 2-min interval of the radar scan, which contains \nthis centre time.  [From Grocott et al. 2001] \n \nFIGURE 6. SuperDARN radar data for two 2 min intervals on 2 December 1999 are shown projected \nonto a magnetic grid in a similar format to figure 5.  The simultaneous direction of the IMF is \nindicated by the logo in the lower right hand corner of each plot.  The difference between the \nmaximum and minimum ionospheric potentials associated with the flow are given at lower left.  \n[From Grocott and Cowley 2001] \n \nFIGURE 7. Meridian scanning photometer observations of the dayside cusp emission obtained from \nNy Ålesund (Svalbard) on 16 December 1998.  The format is the same as for figure 3.  [From \nSandholt et al. 2000] \n \n \n 15 \nSHORT TITLE \nEarth’s plasma environment \n\n\n\n    8\n5\no\n    8\n0\no\n    7\n5\no\n    7\n0\no\n    6\n5\no\n    6\n0\no\n1\n0\n0\n n\nT\n2\n0\n0\n0\n m\n\/s\n1\n2\nM\nL\nT\n0\n6\nM\nL\nT\n0\n0\nM\nL\nT\n1\n8\nM\nL\nT\n-33\n-33\n-2\n1\n-21\n-21-9\n-9\n-9\n3\n3\n1\n5\n15\n0 5 1\n0\n1\n5\n2\n0\nIntensity (kR)\n0\n2\n D\ne\nc 1\n9\n9\n9\n                   0\n0\n:5\n4\n:0\n6\n U\nT\n     (0\n0\n5\n4\n - 0\n0\n5\n6\n U\nT\n)\n =\n 6\n7\n kV\n+\nZ\n   (5\n n\nT\n)\n+\nY\n(-7\n4\n m\nin\n)\n    85 o\n    80 o\n    75 o\n    70 o\n    65 o\n    60 o\n12 MLT\n06 MLT\n00 MLT\n18 MLT\n-2\n1\n-9\n-9\n3\n3\n2000 m s-1\n+Z   (5 nT)\n+Y\n(-76 min)\n     = 31 kV\n02 Dec 1999\n04:46 -\n04:48 UT\n    85 o\n    80 o\n    75 o\n    70 o\n    65 o\n    60 o\n12 MLT\n06 MLT\n00 MLT\n18 MLT\n-2\n1\n-21\n-9\n-9\n-9\n3\n3\n2000 m s-1\n+Z   (5 nT)\n+Y\n(-76 min)\n     = 39 kV\n02 Dec 1999\n05:16 -\n05:18 UT\n\n"}