{"doi":"10.1007\/s10666-007-9103-9","coreId":"113918","oai":"oai:epubs.surrey.ac.uk:3014","identifiers":["oai:epubs.surrey.ac.uk:3014","10.1007\/s10666-007-9103-9"],"title":"Modelling tracer dispersion from landfills","authors":["Carpentieri, M","Giambini, P","Corti, A"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-09","abstract":"Several wind tunnel experiments of tracer dispersion from reduced-scale landfill models are presented in this paper. Different experimental set-ups, hot-wire anemometry, particle image velocimetry and tracer concentration measurements were used for the characterisation of flow and dispersion phenomena nearby the models. The main aim of these experiments is to build an extensive experimental data set useful for model validation purposes. To demonstrate the potentiality of the experimental data set, a validation exercise on several mathematical models was performed by means of a statistical technique. The experiments highlighted an increase in pollutant ground level concentrations immediately downwind from the landfill because of induced turbulence and mean flow deflection. This phenomenon turns out to be predominant for the dispersion process. Tests with a different set-up showed an important dependence of the dispersion phenomena from the landfill height and highlighted how complex orographic conditions downwind of the landfill do not affect significantly the dispersion behaviour. Validation exercises were useful for model calibration, improving code reliability, as well as evaluating performances. The Van Ulden model proved to give the most encouraging results","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:3014<\/identifier><datestamp>\n      2017-10-31T14:07:30Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6D617468737075626C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/3014\/<\/dc:relation><dc:title>\n        Modelling tracer dispersion from landfills<\/dc:title><dc:creator>\n        Carpentieri, M<\/dc:creator><dc:creator>\n        Giambini, P<\/dc:creator><dc:creator>\n        Corti, A<\/dc:creator><dc:description>\n        Several wind tunnel experiments of tracer dispersion from reduced-scale landfill models are presented in this paper. Different experimental set-ups, hot-wire anemometry, particle image velocimetry and tracer concentration measurements were used for the characterisation of flow and dispersion phenomena nearby the models. The main aim of these experiments is to build an extensive experimental data set useful for model validation purposes. To demonstrate the potentiality of the experimental data set, a validation exercise on several mathematical models was performed by means of a statistical technique. The experiments highlighted an increase in pollutant ground level concentrations immediately downwind from the landfill because of induced turbulence and mean flow deflection. This phenomenon turns out to be predominant for the dispersion process. Tests with a different set-up showed an important dependence of the dispersion phenomena from the landfill height and highlighted how complex orographic conditions downwind of the landfill do not affect significantly the dispersion behaviour. Validation exercises were useful for model calibration, improving code reliability, as well as evaluating performances. The Van Ulden model proved to give the most encouraging results.<\/dc:description><dc:date>\n        2008-09<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        attached<\/dc:rights><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/3014\/2\/ENMO5-revised_PP.pdf<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/3014\/4\/licence.txt<\/dc:identifier><dc:identifier>\n          Carpentieri, M, Giambini, P and Corti, A  (2008) Modelling tracer dispersion from landfills   Environmental Modeling and Assessment, 13 (3).  pp. 415-429.      <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s10666-007-9103-9<\/dc:relation><dc:relation>\n        10.1007\/s10666-007-9103-9<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/3014\/","http:\/\/dx.doi.org\/10.1007\/s10666-007-9103-9","10.1007\/s10666-007-9103-9"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"MODELLING TRACER DISPERSION FROM LANDFILLS \n \nMatteo Carpentieri a, Paolo Giambini a, Andrea Corti b \na Dipartimento di Energetica “S.Stecco”, Università degli Studi di Firenze, Via S.Marta 3, 50139 Firenze, Italy. \nb Dipartimento di Ingegneria dell’Informazione, Università degli Studi di Siena, Via Roma 56, 53100 Siena, \nItaly. \ne-mail addresses: matteo.carpentieri@pin.unifi.it; paolo.giambini@pin.unifi.it; corti@dii.unisi.it \n \n \nABSTRACT \n \nSeveral wind tunnel experiments of tracer dispersion from two small-scale landfill models are \npresented in this paper. Hot Wire Anemometry, Particle Image Velocimetry and tracer concentration \nmeasurements were used for the characterisation of flow and dispersion phenomena nearby the landfill \nmodel. The experimental data-set was then used in a validation exercise. \n \nKeywords: Landfill, Wind tunnel, PIV, Air pollution, Validation, Dispersion modelling. \n \n \n1. INTRODUCTION \n \nAtmospheric emissions from municipal waste landfills (MWLs) can be of great concern for urban \npopulation, since more and more plants are being placed near urban areas. The migration of gas away \nfrom the landfill boundaries and its release into the surrounding environment presents serious \nenvironmental concerns, including potential health hazards, fires and explosion, unpleasant odours, air \npollution and global warming [1]. In particular, odour dispersion can heavily affect the quality of life \nof people living near landfills [2]. \n Dispersion modelling is a useful tool and is currently applied for regulatory purposes and air quality \nmanagement in many different contexts. Despite the increasing importance of landfilling for air \nquality issues, the use of dispersion models (mathematical models, either parametric or numerical) for \nthis type of sources has still some limitations: \n(a) most of the models have been developed for single stack point sources; they can often be extended \nto single or multiple area sources, but the physical processes involved are different, thus they require a \ncareful and accurate validation before their use for regulatory purposes; \n(b) the characterisation of the emission is much more difficult than in standard dispersion modelling \n(for single industrial stacks, for example), due to the high variability (both in space and time) of the \namount of gas released, its multi-pollutant nature and the remarkable size of the source (see, e.g. [3]); \n(c) odour modelling is an even more difficult task; traditional dispersion modelling differ from odour \ndispersion modelling in a variety of ways [3], particularly for receptor characterisation (odour \nperception, averaging time, etc.) \nModel validation can be defined as the process of showing that the conceptual model and the \nmathematical code provide an adequate representation of the problem. It requires comparison of model \nresults with experimental data [4] [5] [6] [7]. \nEarly model validation studies were performed in the 1980s mainly by U.S.EPA, American \nMeteorological Society (AMS) and Electric Power Research Institute (EPRI) [8] [9] [10]. These early \nstudies eventually resulted in the development of the BOOT evaluation software [11], that is the basis \nof all of the latest advanced statistical evaluation procedures, such as the Model Validation Kit [12] \nand the ASTM methodology [13]. \nOne of the main problems related to model validation is the lack of experimental data for cases \ndifferent from the well-studied single elevated stack [14]. As far as landfill gas dispersion modelling is \nconcerned, in particular, several field measurements have been performed in recent years, mainly \naimed at estimating emissions rather than validating dispersion models (see, e.g., [2]), but, to our \nknowledge, extensive experimental data sets for model validation purposes does not exist yet. \nWind tunnel experimental techniques have been extensively used for validation purposes despite their \nlimitations and simplifications due to their many advantages with respect to field measurements (see, \ne.g., [5]). Wind tunnel experiments for ground level area sources are available (for example, [15]), but, \nup to now, no data exist for the case of an elevated landfill in relief. This case, which represents the \nusual case for waste landfills, differs substantially from the ground level source case, as can be seen in \nthe following sections. \nThe objective of the work presented in this paper is mainly to build an extensive experimental data set \nuseful for model validation purposes. Based on previous wind tunnel experiments [16], new tests were \ncarried out on landfill physical models using hot-wire anemometry (HWA) and particle image \nvelocimetry (PIV) for flow measurements, and a flame ionisation detector (FID) for tracer \nconcentration measurements. The correctness of the physical modelling assumptions were also \nverified, and new experimental set-ups were analysed (different MWL heights, flat and complex, \nthough gentle, terrain). In order to demonstrate the usefulness of the experimental data set, a validation \nexercise on several mathematical models was performed by means of a statistical technique derived \nfrom the BOOT software [17]. \n \n \n2. METHODOLOGY \n \n2.1 Wind tunnel experiments \nThe experiments were carried out at the CRIACIV (Wind Engineering and Building Aerodynamics \nResearch Centre) environmental boundary layer wind tunnel (BLWT), located in Prato, Italy. This \nBLWT is a suck-down open jet wind tunnel housed in a closed building. The working section is  2.4 m \nwide, 1.6 m high and 4 m long. These dimensions allow to simulate atmospheric flows with a scaling \nfactor between 1:200 and 1:400. The wind tunnel motor has a maximum power of 160 kW, allowing \nwind speeds in the range 0.5 to 30 m\/s; only neutral atmosphere conditions can be simulated [18]. \nWind flow measurements in the wind tunnel, useful to assess the correct reproduction of the full-scale \nboundary layer (BL) and to characterise the flow induced by the landfill relief, were performed using \nPitot tubes and single hot-wire anemometers. For an in-depth study of the 3-dimensional flow field \ndownwind of the landfill relief, PIV measures were also carried out. The tracer concentration \nmeasurement system is equipped with two flame ionisation detectors (FIDs), connected to 24 sample \nlines placed inside the BWLT and allows to obtain reliable experimental set-ups useful for the \nvalidation of mathematical models. \nThe small-scale models are truncated-pyramid shaped with a square base (104x104 cm2), a top area \nsize of 48x48 cm2 and two different heights (model L, height hmodel=7.5 cm, and model H, height \nhmodel=13 cm). The sizes of the two models were chosen based on the geometry of an existing landfill, \nlocated in Montebelluna, Italy, applying a 1:200 scaling factor. The emission source device was a PVC \nbox, perforated on the top side in order to allow a steady gas emission through capillary tubes \nuniformly placed on the top area. The device reliability had been demonstrated in a previous study by \nmeans of tracer emission visualisation experiments [19]. \nAs far as emission is concerned, pure ethylene was chosen as tracer gas in order to obtain a non-\nbuoyant gas, as in the case of landfill gas [3]. MWL emission is also characterized by a release speed \nW0 close to zero. Hence, it can be considered a passive emission [20]. In these conditions, there are \nnot limitations in emission scaling [21][22], and the following equation remains valid for all wind \nspeeds: \nmodel\n22\n!\n!\n\"\n#\n$\n$\n%\n&\n=\nQ\nHCU\nQ\nHCU refrefrefref  (1) \nwhere Href is the BL depth, Uref the wind speed at Href, C and Q, respectively, measured volumetric \nconcentration and tracer flow rate. This scaling rule was verified by performing dispersion tests with \ndifferent flow speeds (2 and 5 m\/s at a height of 5 cm). \nThe BL was generated by using vortex generators located at the beginning of the flow development \nzone (Irwin spires 1 m height and Counihan spires 1.5 m height, figure 1) and roughness distributions \nplaced on the wind tunnel floor with variable heights (10 and 20 mm). The BL characteristics were \nverified without the landfill model by means of flow measurements using a single hot-wire \nanemometer at different distances from the axes origin (x=33 cm and x=157 cm; the axes origin is \nplaced in the centre of the landfill model, the x co-ordinate is directed along the wind direction, the y \nco-ordinate is placed horizontally the z axis is the vertical direction). Mean flow vertical profiles for a \nreference flow speed of 3.1 m\/s at the BL top, Href (corresponding approximately to 2 m\/s at a height \nof 5 cm) are reported in figure 2 with the corresponding turbulence intensity profiles Ix.  The wind \ntunnel set-up allowed to create a neutral BL, about 0.7 m deep (Href equal to 140 m at full scale), \nrepresentative of a rural site. In fact, the height of the BL reproduced in the wind tunnel is lower than \nthe height of a typical neutral BL, but this fact does not compromise the applicability of this study for \ntwo reasons [23]:  \n since the landfill model was immersed in the constant stress layer of the wind tunnel (hmodel<20% \nHref), matching the ratio h\/zo (where h is the height of the landfill and zo is the aerodynamic \nroughness) is more important than matching h\/Href in determining a corresponding full-scale size \nof the landfill; \n the results from the wind tunnel experiments are used to validate the mathematical model \nsimulations, and the scale used in both wind tunnel and the mathematical model simulations was \nidentical. \nMean wind speed vertical profiles are well approximated both by a power-law with an exponent α \nranging from 0.15 to 0.17, and by a logarithmic-law with a roughness length z0 ranging between 0.25 \nand 0.5 mm (5-10 cm at full scale) and a value of u*\/Uref approximately equal to 0.05 (where u* is the \nfriction velocity). \nIn this study we analysed only one wind direction and the following configurations: \n Model H and flat terrain; \n Model L and complex terrain, simulated using a 2-dimensional hill placed downwind of the MWL \n(the top of the hill is placed at a distance x of 190 cm from the centre of the landfill). The hill is \ncharacterized by the U.S. EPA profile described by the following parametric equations with \nparameter ξ, h=11.25 cm maximum height of the hill and a=56.25 cm half of the longitudinal \nlength of the hill. \n \n( )\nx\na\nm a\n= +\n+ !\n\"\n#\n$\n$\n%\n&\n'\n'\n1\n2\n1\n2\n2 2 2 2\n(\n( (\n    ( )\n( )\nz m a\na\nm a\n= ! !\n+ !\n\"\n#\n$\n$\n%\n&\n'\n'\n1\n2\n1\n2 2\n1 2\n2\n2 2 2 2\n(\n( (\n    \n21\n2\n1\n!\n!\n\"\n#\n$\n$\n%\n&\n+'\n(\n)\n*\n+\n,\n+=\na\nh\na\nh\nm  \nThese set-ups allowed to compare the new data with results from previous experiments on Model L in \nflat terrain [16]. \nIn order to characterise the flux behaviour induced by the landfill relief and the hill (complex gentle \nterrain), vertical mean flow and turbulence intensity profiles were measured along the centreline (y=0 \ncm) at different distances from the centre of the landfill (x=33 cm, 57 cm, 107 cm, 157 cm, and 257 \ncm) at each configuration. The reference wind velocity was set to 3.1 m\/s at the BL edge, \ncorresponding to approximately 2 m\/s at 5 cm. \nIn order to characterise tracer dispersion, several concentration profiles were measured for the two \nconsidered configurations: \n- A longitudinal mean concentration profile, measured at a height z=1 cm (corresponding to 2 m \nat full scale), along the centreline (y=0 cm); \n- Transverse mean concentration profiles, measured at a height z=1 cm (corresponding to 2 m at \nfull scale), at distances of  70, 130, 190, 250 and 310 cm from the landfill centre; \n- Vertical mean concentration profiles, measured at distances of  70, 130, 190, 250 and 310 cm \nfrom the landfill centre, along the centreline. \nIn addition, in order to analyze the 3-dimensional flow downwind of the landfill, PIV measurements \nwere carried out with the Model L (flat terrain). In particular the following analyses were performed \n(figure 3): \n- Flow visualisation tests on the horizontal plane (x-y) at a height z=1 cm with the image centred \nin the points 1 (x=70 cm, y=0cm), 2 (x=70 cm, y=-24cm) and 3(x=70 cm, y=-52cm) ; \n- Flow visualisation tests on the vertical plane (x-z) along the centreline (y=0) with the image \ncentred in the points 1 (x=70 cm, z=6.5 cm), 4 (x=52 cm – landfill bottom-area edge, z=6.5 cm), \n5 (x=38 cm, z=6.5 cm) and 6 (x=24 cm – landfill top-area edge, z=6.5 cm) \n- Flow visualisation tests on the vertical plane (x-z) at distances y=-24 cm (point 2, image centred \nat x=70 cm, z=6.5 cm) and y=-54 cm (point 3, image centred at x=70 xm, z= 6.5 cm) \n \n2.2 Validation exercise \nDue to the lack of specific mathematical codes that can be used to simulate pollutant dispersion from \nnear-ground area sources, a validation exercise was performed in order to calibrate some models and \nto evaluate their performances. The following three models were chosen: SAFE_AIR, which showed \nencouraging results in a validation exercise with area sources [15] and allows to analyze the terrain \neffects by means of the diagnostic mass-consistent model (WINDS); ISC3, which is a widely used \nmodel formerly recommended by U.S. EPA guidelines for point sources, but capable of simulating \narea sources as well [24]; and, a model specifically built for near-ground releases and based on the \nvertical concentration distribution proposed by Van Ulden [25] and applied in [2]. The last two models \ndo not include a model for the calculation of three-dimensional wind fields in complex terrain. \nThe validation exercise was performed using a methodology based on graphical comparisons of \nsimulated and measured profiles and on statistical indices [17]. The statistical indices used here are \nsome of  the so-called Model Validation Kit (MEAN, BIAS, FB, SIGMA, FS, COR, FA2 and NMSE \n[12] [26]); beside these other less common indices were considered (WNNR and NNR [27]). \nMEAN can be related to both observed and simulated concentrations, it is defined as: \n!== i\no\nio\nobserved\nN\nC\nCMEAN ;       !== i\ns\nis\nsimulated\nN\nC\nCMEAN ; \nwhere N is the total number of the receptors and o\ni\nC  ( s\ni\nC ) is the observed (simulated) concentration at \nthe i-th receptor; a perfect model would give \nsimulatedobserved\nMEANMEAN = . \nBIAS is defined as: \nso\nCCBIAS != ; \na perfect model would give BIAS = 0, while if BIAS > 0 (< 0) the model on average underestimates \n(overestimates) the observed concentrations.  \nFB (Fractional Bias) is defined as: \n2)( so\nso\nCC\nCC\nFB\n+\n!\n= ; \nit ranges between – 2 and + 2, a perfect model would give FB = 0, while if FB > 0 (< 0) the model on \naverage underestimates (overestimates) the observed concentrations.  \nSIGMA, that is to say “standard deviation”, can be related to both observed and simulated \nconcentrations, it is defined as: \n( )\n!\n\"\n==\ni\noo\nio\nobserved\nN\nCC\nSIGMA\n2\n# ;      \n( )\n!\n\"\n==\ni\nss\nis\nsimulated\nN\nCC\nSIGMA\n2\n# ; \na perfect model would give \nsimulatedobserved\nSIGMASIGMA = . \nFS (Fractional Standard deviation) is defined as: \n2)( so\nso\nFS\n!!\n!!\n+\n\"\n= ; \nit ranges between – 2 and + 2, a perfect model would give FS = 0, while if FS > 0 (< 0) the spreading \nof the simulated concentration values is smaller (bigger) than the spreading of the measured ones.  \nCOR (linear CORrelation coefficient) is defined as: \n( )( )\nso\nssoo\nCCCC\nCOR\n!!\n\"\"\n= ; \na perfect model would give COR = + 1, it ranges between – 1 and + 1. \nFA2 (fraction within a FActor of 2) is defined as: \nfraction of data with 25.0 !!\no\ni\ns\ni\nC\nC\n; \na perfect model would give FA2 = 1. \nNMSE (Normalised Mean Square Error) is defined as: \n( )\nso\nso\nCC\nCC\nNMSE\n2\n!\n=  or, if iC o\ni\n!\" 0 , \n( )\n!\n! \"\n=\ni ii\ni ii\nks\nks\nNMSE\n22\n1\n; \nwhere o\ni\ns\nii\nCCk =  and oo\nii\nCCs = ; a perfect model would give NMSE = 0, the value of this index \nis always positive. \nWNNR (Weighted Normalized mean square error of the Normalized Ratios) is defined as:  \n( )\n!\n! \"\n=\ni ii\ni ii\nks\nks\nWNNR\nˆ\nˆ1\n2\n2\n; \nwhere \nii\nkk 1ˆ =  (if ki > 1) and ii kk =ˆ  (if 1!ik ); a perfect model would give WNNR = 0, the value \nof this index is always positive. \nNNR (Normalized mean square error of the distribution of Normalized Ratios) is defined as: \n( )\n!\n! \"\n=\ni i\ni i\nk\nk\nNNR\nˆ\nˆ1\n2\n; \na perfect model would give NNR = 0, the value of this index is always positive. \nThe MEAN, BIAS and FB indices give information about the ‘on average’ model behaviour only. The \nSIGMA and FS indices give information about the spreading of the concentrations. COR gives \ninformation about the linear correlation of the data. The FA2, NMSE, WNNR and NNR indices give \ninformation about the ratios between simulated and measured concentrations; only the FA2 and NNR \nindices, out of all indices considered, depend solely on the ratios between simulated and measured \nconcentrations, and not on the data set itself, so they are the only indices strictly usable to compare \nsimulations of different experiments. NMSE gives more relevance to errors relative sometimes to the \nhighest measured concentrations, sometimes to the lowest ones; WNNR gives more relevance to errors \nrelative to the highest measured concentrations; NNR gives the same relevance to errors independently \nof the position of the data within the concentration range [27].  \nIn any case values of statistical indices different from the values expected for a perfect model do not \nnecessarily mean that a model is completely wrong in predicting the measurements due to the presence \nof inherent uncertainty. \nMoreover, the “acceptability” criterion of Chang and Hanna [28] has been used, where models \nperformances are defined acceptable if FA2>0.5, -0.3<FB<0.3 and NMSE <4.  \nReference data used in the validation exercise are the concentration profiles measured during the \nexperiments with Model H and flat terrain, appropriately converted to the full scale values. \n \n \n3. RESULTS \n \n3.1 Experiments with the Model H \nHot-wire anemometry measures \nVertical mean wind flow and turbulence intensity profiles (fig. 4) show a considerable reduction in \nterms of wind velocity (speed at a height of 5 cm changes from 2 m\/s for flat terrain to 0.4 m\/s in \npresence of the landfill) and a substantial increase of turbulence intensity compared to the reference \nprofile. These flow modifications induced by the landfill relief are remarkable in the BL lower levels \nand their influence decreases along z-axis and with distance along x-axis; disturbance effects are still \nsignificant at a distance of x=257 cm. \nComparisons of measures carried out with the two models (fig. 5 and 6) put in evidence that an \nincrease of model height causes an intensification of the flow modifications, characterised by a greater \ndecrease of the wind velocity and an increase of the turbulent phenomena downwind of the model (fig. \n5). In the presence of Model L, the disturbance effects decrease more quickly with the height and with \nthe distance compared to Model H; the modification effects disappear at x=157 cm (fig. 6). \n \nTracer concentration measurements \nThe concentration results are reported in the non-dimensional form of equation (1). The mean \nconcentration profile along the centreline is reported in figure 7 (top-left). The highest concentrations \ncan be observed close to the landfill relief; the gradient has higher values next to the emission source \nand decreases with distance down to near zero at the end of the working section. Transverse \nconcentration profiles (fig. 7, top-right) show a symmetric behaviour and a progressive plume spread \nin the y-direction when the distance from the model increases (fig. 8, right). Vertical profiles (fig. 7, \nbottom-left) show a characteristic rising and expanding bent-over plume. Wind tunnel measurements \nalso allowed a ground-level concentration map to be constructed (fig. 7 bottom-right).  \nDifferent dispersion parameters have been calculated using experimental measures, i.e. mean height of \nthe plume, <z>, and vertical and lateral spread (sigmaz and sigmay), in order to analyze the plume \nbehaviour downwind of the source. \n( ) ( )!!\n\"\"\n>=<\n00\ndzzCdzzzCz  ( ) ( ) ( )!!\n\"\"\n><#=\n00\n22 dzzCdzzCzzsigmaz    \n( ) ( )!!\n\"\"\n=\n00\n22 dyyCdyyCysigmay  \nThe mean height of the plume (fig. 8, left) is lower than the emission height (equal to 13 cm) along the \nwhole working section of the BWLT. This result demonstrates how turbulent flow and streamline \ndeflection downwind of the landfill deflect downwards the tracer, causing an increase on the ground \nlevel concentrations (GLCs). Besides, it is possible to observe a constant growth of the plume height, \ndue to the presence of reflection effects of the ground. The plotted variation of sigmaz and sigmay (fig. \n8, left) versus distance shows the vertical and lateral spreads of the plume, showing a decreasing \nspread rate with increasing distance.  \nComparisons of measures carried out with the two models at different flow speeds (fig. 9), show how \ndispersion behaviour, in terms of non-dimensional concentration, is dependent to geometric shape of \nthe source, but independent to wind speed. For the Model H case we can observe lower concentrations \nnear the ground and higher concentrations at higher levels. This phenomenon is justified by the higher \nemission height and by a much greater turbulence intensity that characterised the Model H \nconfiguration; as a matter of fact, these elements cause a large spread and consequently a decrease of \nthe tracer concentrations. Wind speed invariance allowed us to check the non-dimensional \nconcentration parameters used during the experiments. \n \n3.2 Experiments with Model L in complex terrain  \nHot-wire anemometry measures \nThe presence of the hill downwind of the landfill causes a flow deflection characterised by an increase \nof the wind velocity above the hill and a small modification of wind flow downwind of the hill (fig. \n11,); disturbance effects (increase of turbulence intensity and decrease of wind velocity), as a matter of \nfact, affect only the lower part of the BL and vanish at a distance of about 60 cm from the hill, at \nx=257 cm (fig. 12). Upwind from the hill (fig. 10), on the contrary, wind flow seems unchanged, \nvertical mean wind flow and intensity turbulence profiles results substantially the same in both the \ncases (with and without the hill).  \nTracer concentration measurements \nLongitudinal, transversal and vertical profiles in this second configuration, following the same \nmethodology of the previous case, are reported in figure 13; a GLC map (fig. 13, bottom-right) and \nestimates of some dispersion parameters (fig. 14) were also produced. \nComparing the data (fig. 15) from the flat and gentle terrain configurations, it can be noted how, \nupwind of the hill, the dispersion behaviour remains substantially unchanged (non-dimensional \nconcentration and flow characteristics keep similar values); downwind from the hill a small decrease \nof GLC and an increase of tracer concentration at elevated heights can be observed; this fact is due to \ntracer deflection and to induced turbulence related to the presence of the hill. When the distance from \nhill increases, disturbance effects tend to disappear quickly. Thus, it can be stated that changes induced \nby the hill (gentle terrain) does not modify too much pollutant levels and the dispersion behaviour. \n \n3.3 PIV experiments  \nPIV measurements performed downwind from the landfill allow to obtain velocity contour, vector and \nvorticity maps related to several horizontal and vertical sections. \nHorizontal visualizations (fig. 16) show that the direction of the flow is quite uniform, while the wind \nspeed increases with the distance from the landfill; x-y plane measurements do not show the presence \nof vortices. This is also confirmed by vorticity maps, which show (fig. 17) a small variability. \nHowever, the landfill relief does not seem to sensibly affect the flow behaviour on parallel planes to \nthe ground. \nVertical sections (fig. 18 and 20) show a regularity of the flow direction as well. The measurements , \nhowever, did highlight the downwards flow deflection (fig. 18) and higher vorticity (fig. 19). \nHowever, this effect vanished at x=70 cm from the landfill centre, where the parallel flow is \nestablished again (fig. 20) and the vorticity is less variable (fig. 21). \n \n3.4 Model validation exercise \nA sensitivity analysis on the three mathematical models was carried out considering different \nparameters, such as the downwash effect, the dispersion coefficients σz and σy, the number of point \nsources (for the simulation of the area source) and flow speed (table 1). This study allowed us to \nestablish calibration conditions and to define the most important elements in model performances. \nStatistical analysis and graphical comparisons show, as reported in table 1, that all codes are very \nsensible to the downwash effect induced by the landfill relief; as a matter of fact, the models tend to \nunderestimate GLCs if no “downwash effect” correction is applied. The number of circular sources \nand the flow speed are less important for model performance, while the choice of dispersion \ncoefficients is rather significant, particularly for Gaussian models. \nThe best configurations for the codes resulting from the sensitivity analysis are the following: \n- SAFE AIR: emission area simulated using 49 circular sources; emission height He = 0; Briggs \n“open country” σ-functions. \n- ISC3: area source algorithm; He = 0; rural σ-functions. \n- Van Ulden: emission area simulated using 49 circular sources; He = 5.8 m; Pasquill-Gifford-\nTurner σ-functions. \nStatistical analysis (tab. 2) and graphical comparisons (fig. 22) of the calibrated models show how all \nthe models have much greater difficulties in the reproduction of vertical profiles, while GLC \npredictions are definitely better. The acceptability criteria of Chang and Hanna [28] is verified only for \nGLC data. The best model seems to be the Van Ulden code, although SAFE_AIR also performs \nreasonably well; the worst performing model in the present case, according to this analysis, is ISC3. \nFor a better understanding of models capabilities, a comparison with the experiments on model L has \nbeen performed. Statistical analysis and graphical comparisons related to this configuration are \nreported respectively in table 3 and figure 23. \nVan Ulden model is the best also in this case. As a matter of fact, by adjusting the emission height in \nthe algorithm it was possible to verify the Chang and Hanna criteria [28]. \nCompared to validation exercises for simpler cases (such as standard single stack point sources and \nflat terrain) [29] [30], this study shows that the models predictions are less satisfactory; in the point \nsource cases,  mathematical simulation results verify Chang and Hanna criteria both for the GLC data \nand the vertical profiles. This conclusion was expected because the applied models were originally \nbuilt to simulate point sources at elevated heights. \n \n \n4. CONCLUSIONS \n \nWind tunnel experiments have been carried out on small scale physical models of landfills. The large \nexperimental data-set obtained in this study are very useful for the following purposes: \n1. Characterization and understanding of pollutant dispersion downwind from an elevated area \nsource.  \n2. Development and verification of physical small-scale models representing MWL. \n3. Calibration and performance evaluation of mathematical models. \nIn order to show the potentiality and the usefulness of the data produced they have been further \nanalysed and applied in a validation exercise involving some mathematical models. \nThe experiments highlighted an increase of pollutant GLC immediately downwind from the landfill \ndue to induced turbulence and mean flow deflection. This phenomenon is similar to the “downwash \neffect” in industrial buildings and turns out to be predominant for the dispersion process; its \nidentification was obtained by longitudinal and vertical concentration profiles with different set-ups \nand by an evaluation of mean plume height. Besides, the presence of the downwash effect is \nconfirmed by mathematical model simulations, that show how not considering the downwash effect \ncauses an underestimation of GLC. Tests with a different landfill height and in complex terrain were \nalso very useful. The former showed an important dependence of the dispersion phenomena from the \nlandfill height, while the latter highlighted how gentle orographic conditions downwind of the landfill \ndo not affect significantly the dispersion behaviour.  \nTo check the validity of the experimental set-up, a verification of the non-dimensional concentration \nparameter used during the experiments was carried out. Wind speed independence was demonstrated \nfor this purpose. \nValidation exercises were useful for model calibration, improving code reliability, as well as \nevaluating performance. As far as this study is concerned, simulations using the Van Ulden model are \nthe most encouraging. Results obtained from this model are acceptable according to the Chang & \nHanna criterion [28]. \nThe obtained data-set can be further extended and improved in future experiments. For example, \nfuture experiments can include different wind directions and hills with different shape, as well as more \ncomplex terrains downwind form the landfill relief. \n \n5. REFERENCES \n \n[1] El-Fadel, M., Findikakis, A.N. & Leckie, J.O. (1997). Environmental impacts of solid waste \nlandfilling. Journal of Environmental Management, 50, 1-25 \n[2] Sarkar, U. &  Hobbs, S.E. (2003). Landfill odour: assessment of emissions by the flux footprint \nmethod. Environmental Modelling and Software, 18, 155-163 \n[3] Sarkar, U., Hobbs, S.E. & Longhurst, P. (2003). Dispersion of odour: a case study with a municipal \nsolid waste landfill site in North London, United Kingdom. Journal of Environmental Management, \n68, 153-160 \n[4] Borrego, C., Schatzmann, M. & Galmarini, S. (2003). Quality assurance of air quality models. (In \nMoussiopoulos, N. (Ed.), SATURN – Studying atmospheric pollution in urban areas – EUROTRAC2 \nsubproject final report (pp. 155-183). Heidelberg: Springer Verlag) \n[5] Schatzmann, M., Rafailidis, S. & Pavageau, M. (1997). Some remarks on the validation of small-\nscale dispersion models with field and laboratory data. Journal of Wind Engineering and Industrial \nAerodynamics, 67-68, 885-893 \n[6] Schatzmann, M. & Leitl, B. (2002). Validation and application of obstacle-resolving urban \ndispersion models. Atmospheric Environment 36, 4811-4821 \n[7] Van Aalst, R., Edwards, L., Pulles, T., De Saeger, E., Tombrou, M. & Tønnesen, D. (1998). \nGuidance report on preliminary assessment under EC air quality directives. Technical Report no. 11 \n(European Environment Agency) \n[8] Hanna, S.R. (1988). Air quality model evaluation and uncertainty. JAPCA – The International \nJournal of the Air Pollution Control Association, 38, 406-412 \n[9] Hanna, S.R. (1993). Uncertainties in air-quality model predictions. Boundary-Layer Meteorology, \n62, 3-20 \n[10] Weil, J.C, Sykes, R.I. & Venkatram, A. (1992). Evaluating air-quality models – Review and \noutlook. Journal of Applied Meteorology, 31, 1121-1145 \n[11] Hanna, S.R. (1989). Confidence limits for air quality model evaluations as estimated by bootstrap \nand jackknife resampling methods. Atmospheric Environment, 23, 1385-1398 \n[12] Olesen, H.R. (2005). User’s guide to the Model Validation Kit. Initiative on Harmonisation \nwithin Atmospheric Dispersion Modelling for Regulatory Purposes, from http:\/\/www.harmo.org\/kit \n[13] ASTM (2000). Standard guide for statistical evaluation of atmospheric model performance. \nAmerican Society of Testing and Materials, D 6589-00 \n[14] Carpentieri, M. (2006). Modelling air quality in urban areas. PhD thesis, University of Florence \n[15] Cavallaro, M., Canepa, E. & Ratto, C.F. (2003, September). A validation exercise of the P6 \ndispersion model using wind tunnel data about area source. (Paper presented at the PHYSMOD2003 \nWorkshop, Prato, Italy) \n[16] Carpentieri, M., Corti, A. & Zipoli, L. (2004). Wind tunnel experiment of tracer dispersion \ndownwind from a small-scale physical model of a landfill. Environmental Modelling and Software, \n19, 881-885 \n[17] Canepa, E. & Builtjes, P.J.H. (2001). Methodology of model testing and application to dispersion \nsimulation above complex terrain. International Journal of Environment and Pollution, 16, 101-115 \n[18] Augusti, G., Borri, C., Giordano, S., Spinelli, P. & Niemann, H. (1990). Il progetto della galleria \ndel vento a strato limite sviluppato dall’Università di Firenze (Paper presented at the 1st Convegno \nnazionale di Ingegneria del Vento, Firenze, Italy) \n[19] Zipoli, L. (2002). Misure anemometriche e diffusionali in galleria del vento applicate al caso di \nemissione di tracciante inquinante da discariche di R.S.U. Dissertation, University of Florence \n[20] Nicolas, J., Craffe, F. & Romain, A.C. (2006). Estimation of odor emission rate from landfill \nareas using the sniffing team method. Waste Management, 26, 1259-1269 \n[21] Robins, A.G. (1977). Wind tunnel modelling of plume dispersal. CEGB Report R\/M\/R247, \nCentral Electricity Generating Board, Research Division, Marchwood Engineering Laboratories \n[22] Obasaju, E.D. & Robins, A.G. (1998). Simulation of pollutant dispersion using small scale \nmodels - an assessment of scaling options. Environmental Monitoring and Assessment, 52, 239-254 \n[23] Scaperdas, A. (2000). Modelling air flow and pollutant dispersion at urban canyon intersections. \nPhD Thesis, Imperial College of Science and Technology, University of London \n[24] U.S. EPA (1992). Comparison of a revised area source algorithm for the industrial source \ncomplex short term model and wind tunnel data. EPA-454\/R-92-014. \n[25] Van Ulden, A.P. (1978). Simple estimates for vertical diffusion from sources near the ground. \nAtmospheric Environment, 12, 2125-2129 \n[26] Hanna, S.R., Strimaitis, D.G. & Chang, J.C. (1991). Hazard response modelling uncertainty (a \nquantitative method): User’s guide for software for evaluation of hazardous gas dispersion models. \nFinal Report, vol. I (Westford: Sigma Research Corp.) \n[27] Poli, A.A. & Cirillo, M.C. (1993). On the use of the normalized mean square error in evaluating \ndispersion model performance. Atmospheric Environment, 15, 2427-2434 \n[28] Chang, J.C. & Hanna, S.R. (2004). Air quality model performance evaluation. Meteorology and \nAtmospheric Physics, 87, 167-196 \n[29] Manfrida, G., Corti, A. & Contini, D. (1999, October). Comparison between different dispersion \nmodels with wind tunnel small scale measurements. (Paper presented at the 6th International \nConference on Harmonization within Atmospheric Dispersion Modelling for Regulatory Purposes, \nRouen, France) \n[30] Corti, A., Zanobini, M. & Canepa, E. (2002). Use of wind tunnel measurements for mathematical \ncomparison and validation. (In Sportisse, B. (Ed.), Air Pollution Modelling and Simulation (pp. 341-\n354). Heidelberg: Springer-Verlag)  \nTABLES: \n \n \n Sensitivity analysis Sensitivity level Calibration conditions \nN° of circle sources low 49 sources \nInitial-σ low (0;0;0.369Ds) \nDownwash effect high He = 0 \nDispersion coeff. σ medium Briggs open country \nSAFE AIR \nWind speed low v = 2 m\/s at 10 m \nDownwash effect high Area source algorithm (He=0) ISC3 \nWind speed null - \nn° of circe source low 49 sources \nDispersion coeff. σy low P-G-T \nDownwash effect high He = 5.8 m \nVAN ULDEN \nWind speed null - \nTable 1. Sensitivity analysis results \n \n  \n  FB FS COR FA2 NMSE WNNR NNR \nMeasures 0.00 0.00 1.00 1.00 0.00 0.00 0.00 \nSAFE AIR 0.11 0.10 0.92 0.76 0.17 0.19 0.28 \nISC3 -0.17 -0.29 0.89 0.71 0.34 0.44 0.54 \nAll available \ndata \nVan Ulden 0.09 0.14 0.92 0.74 0.18 0.20 0.22 \nMeasures 0.00 0.00 1.00 1.00 0.00 0.00 0.00 \nSAFE AIR 0.00 0.07 0.97 0.99 0.03 0.03 0.03 \nISC3 -0.32 -0.33 0.98 0.97 0.21 0.20 0.13 \nGround-level \ndata \n \nVan Ulden -0.01 0.12 0.96 0.97 0.07 0.08 0.05 \nMeasures 0.00 0.00 1.00 1.00 0.00 0.00 0.00 \nSAFE AIR 0.53 0.17 0.79 0.38 0.93 0.95 1.08 \nISC3 0.52 -0.16 0.69 0.30 1.30 1.66 2.21 \nVertical \nprofiles data \nVan Ulden 0.46 0.18 0.82 0.37 0.74 0.75 0.70 \nTable 2. Statistical indices calculated using all the available data, GLCs and vertical profiles related to Model H \nin flat terrain. Model performances are defined acceptable if FA2>0.5, -0.3<FB<0.3 and NMSE <4 \n(“acceptability” criteria of Chang & Hanna [28]) \n \n   FB FS COR FA2 NMSE WNNR NNR \nMeasures 0.00 0.00 1.00 1.00 0.00 0.00 0.00 \nSAFE AIR 0.42 0.53 0.99 0.83 0.42 0.42 0.30 \nISC3 0.35 0.36 0.97 0.77 0.27 0.27 0.35 \nAll available \ndata \nVan Ulden 0.20 0.16 0.97 0.86 0.09 0.09 0.14 \nMeasures 0.00 0.00 1.00 1.00 0.00 0.00 0.00 \nSAFE AIR 0.42 0.54 0.99 0.97 0.38 0.38 0.18 \nISC3 0.30 0.32 0.99 0.97 0.18 0.18 0.09 \nGround-level \ndata \n \nVan Ulden 0.14 0.03 0.97 1.00 0.04 0.04 0.04 \nMeasures 0.00 0.00 1.00 1.00 0.00 0.00 0.00 \nSAFE AIR 0.43 0.52 0.98 0.71 0.48 0.48 0.41 \nISC3 0.44 0.39 0.97 0.63 0.44 0.44 0.68 \nVertical \nprofiles data \nVan Ulden 0.30 0.26 0.98 0.74 0.19 0.19 0.26 \nTable 3. Statistical indices calculated using all the available data, GLCs and vertical profiles related to Model L \nin flat terrain. Model performances are defined acceptable if FA2>0.5, -0.3<FB<0.3 and NMSE <4 \n(“acceptability” criteria of Chang & Hanna [28]) \n \n \nFIGURES: \n \n \nFigure 1. Vortex generators (Irwin and Counihan spires) located at the beginning of the flow development zone \n \n   \nFigure 2. Mean flow vertical profiles (left) and turbulence intensity profiles Ix(right) without landfill model along \nthe centreline \n \n \nFigure 3. Schematic of the PIV measurement locations \n \n \nFigure 4. Mean wind velocity vertical profiles (left) and turbulence intensity profiles Ix(right) with landfill Model \nH at different distances along the centreline \n \n  \nFigure 5. Comparison of vertical mean wind flow (top) and intensity turbulence Ix (bottom) profiles carried out \nwith model H, model L and without model at the distance x=57 cm from the landfill centre \n \n  \nFigure 6. Comparison of vertical mean wind flow (top) and intensity turbulence Ix (bottom) profiles carried out \nwith model H, model L and without model at the distance x=157 cm from the landfill centre \n \n  \n \nFigure 7. Longitudinal, vertical, transverse mean concentration profiles  and GLC map (bottom-right) carried out \nwith model H. All results are reported in non-dimensional form CUrefHref\/Q. \n \n \nFigure 8. Mean height  <z> (left), lateral sigmay and vertical sigmaz spread  versus distance from the source \n(right) carried out with model H. The dashed lines indicate <z>+sigmaz  and  <z>-sigmaz  and h (bold line) is the \nheight of the landfill model. \n  \nFigure 9. Comparisons of longitudinal (left) and vertical at x=70 cm (right) concentration profiles measured with \ndifferent flow velocities (2, 5 m\/s) and model heights (7.5 cm “L”; 13 cm “H”)  \n \n \nFigure 10. Comparisons of vertical mean wind flow (left) and intensity turbulence Ix (right) profiles carried out \nwith model L,  with and without the hill at the distance x=57 cm from the landfill centre (upwind of the hill). \n \n  \nFigure 11. Comparisons of vertical mean wind flow (top) and intensity turbulence Ix (bottom) profiles carried out \nwith model L,  with and without hill at the distance x=200 cm from the landfill centre (downwind of the hill). \n \n  \nFigure 12. Comparisons of vertical mean wind flow (left) and intensity turbulence Ix (right) profiles carried out \nwith model L,  with and without hill at the distance x=257 cm from the landfill centre. \n \n  \n \nFigure 13. Longitudinal, vertical, transverse non-dimensional concentration profiles and GLC map (bottom-\nright) carried out with model L and complex (gentle) terrain. All results are reported in non-dimensional form \nCUrefHref\/Q. \n \n Figure 14.Mean height  <z> (bottom-centre), lateral sigmay and vertical sigmaz spread (bottom-right) versus \ndistance from the source carried out with model L and complex (gentle) terrain. The dashed lines indicate \n<z>+sigmaz and  <z>-sigmaz  and h (bold line) is the height of the landfill model. \n \n \nFigure 15. Comparisons of upwind (left)  and downwind (right) of the hill vertical concentration profiles \nmeasured with different orographic conditions (flat and complex terrain). \n \n \n \n  \nFigure 16. Velocity contour and vector maps related to the horizontal plane x-y at height z=1 cm with the image \ncentred in point  1 (x=70 cm, y=0 cm - left) and point 2 (x=70cm, y=24 cm - right). Analysis area is about 18x18 \ncm2. \n \n       \nFigure 17. Vorticity maps related to the horizontal plane x-y at height  z=1 cm with the image centred in point  1 \n(x=70 cm, y=0 cm - left) and point 2 (x=70cm, y=24 cm - right). Analysis area is about 18x18 cm2. \n \n  \nFigure 18. Velocity contour and vector maps related to the vertical plane x-z  along the centreline (y=0 cm) with \nthe image centred in point 6 (x=24 cm - left) and point 4 (x=52 cm - right). Analysis area is about 12x12 cm2. \n \n  \nFigure 19. Vorticity maps related to the vertical plane x-z  along the centreline (y=0 cm) with the image centred \nin point 6 (x=24 cm - left) and point 4 (x=52 cm - right). Analysis area is about 12x12 cm2. \n \n \n   \nFigure 20. Velocity contour and vector maps related to the vertical planes x-z  with the image centred in  point 1 \n(x=70 cm, y=0 cm - left) and point 2 (x=70 cm, y=24 cm - right). Analysis area is about 10x10 cm2. \n \n    \nFigure 21. Vorticity maps related to the vertical planes x-z  with the image centred in point 1 (x=70 cm, y=0 cm - \nleft) and point 2 (x=70 cm, y=24 cm - right). Analysis area is about 12x12 cm2. \n \n \n Figure 22.  Comparisons of longitudinal (left) and vertical at x=260 m (right) concentration measurements and \nsimulation data of the three mathematical models with model H in flat terrain. \n \n \nFigure 23.  Comparisons of longitudinal (left) and vertical at x=140 m (right) concentration measurements and \nsimulation data of the three mathematical models with model L in flat terrain. \n"}