{"doi":"10.1016\/j.chb.2010.08.004","coreId":"197476","oai":"oai:lra.le.ac.uk:2381\/9727","identifiers":["oai:lra.le.ac.uk:2381\/9727","10.1016\/j.chb.2010.08.004"],"title":"What I won’t do in pixels: Examining the limits of taboo violation in MMORPGs","authors":["Whitty, Monica T.","Young, Garry","Goodings, Lewis"],"enrichments":{"references":[{"id":43711824,"title":"Cyber-flirting: Playing at love on the Internet.","authors":[],"date":"2003","doi":"10.1177\/0959354303013003003","raw":"Whitty, M. T. (2003). Cyber-flirting: Playing at love on the Internet. Theory and Psychology, 13 (3), 339-357.","cites":null},{"id":43711826,"title":"Cyberspace romance: The psychology of online relationships.","authors":[],"date":"2006","doi":null,"raw":"Whitty, M. T. & Carr, A. N. (2006). Cyberspace romance: The psychology of online relationships. Basingstoke: Palgrave Macmillan.","cites":null},{"id":43711803,"title":"Descartes’ error: Emotion, reason, and the human brain.","authors":[],"date":"1994","doi":"10.7202\/051028ar","raw":"Damasio, A.R. (1994). Descartes’ error: Emotion, reason, and the human brain. New York: Avon.","cites":null},{"id":43711818,"title":"Experimental study of the differential effects of playing versus watching violent video games on children’s aggressive behavior.","authors":[],"date":"2008","doi":"10.1002\/ab.20245","raw":"Polman, H., de Castro, B. O., & van Aken, M. A. G. (2008). Experimental study of the differential effects of playing versus watching violent video games on children’s aggressive behavior. Aggressive Behavior, 34(3), 256-264.","cites":null},{"id":43711831,"title":"Games without frontiers: On the moral and psychological implications of violating taboos within multi-player virtual spaces.","authors":[],"date":"2010","doi":"10.1016\/j.chb.2010.03.023","raw":"Young, G., & Whitty, M. T, (2010). Games without frontiers: On the moral and psychological implications of violating taboos within multi-player virtual spaces. Computers in Human Behavior, 26, 1228-1236.","cites":null},{"id":43711821,"title":"Healers and Interrogators: Psychology and the United States Torture Regime. Psychoanalytic Dialogues,","authors":[],"date":"2008","doi":"10.1080\/10481880802297624","raw":"Soldz, S. (2008). Healers and Interrogators: Psychology and the United States Torture Regime. Psychoanalytic Dialogues, 18, 592-613.","cites":null},{"id":43711814,"title":"I wish I were a warrior: The role of wishful identification on the effects of violent video games on aggression in adolescent boys.","authors":[],"date":"2007","doi":"10.1037\/0012-1649.43.4.1038","raw":"Konijn, E.A. & Bushman, B.J. (2007). I wish I were a warrior: The role of wishful identification on the effects of violent video games on aggression in adolescent boys. Developmental Psychology, 43 (4), 1038-1044.","cites":null},{"id":43711827,"title":"Internet fantasy violence: A test of aggression in an online game.","authors":[],"date":"2005","doi":"10.1080\/03637750500111781","raw":"Williams, D., & Skoric, M. (2005). Internet fantasy violence: A test of aggression in an online game. Communication Monographs, 72 (2), 217-233.","cites":null},{"id":43711823,"title":"Life on the screen: Identity in the age of the Internet.","authors":[],"date":"1995","doi":"10.1177\/135485659700300112","raw":"Turkle, S. (1995). Life on the screen: Identity in the age of the Internet. London: Weidenfeld & Nicolson.","cites":null},{"id":43711812,"title":"Media Propaganda and Spectacle in the War on Iraq: a Critique of U.S. Broadcasting Networks.","authors":[],"date":"2004","doi":"10.1177\/1532708603262723","raw":"Kellner, D. (2004). Media Propaganda and Spectacle in the War on Iraq: a Critique of U.S. Broadcasting Networks. Cultural Studies, 4, 329-338.","cites":null},{"id":43711805,"title":"Neural correlates of internally generated disgust via autobiographical recall: A functional magnetic resonance imaging investigation.","authors":[],"date":"2004","doi":"10.1016\/j.neulet.2004.08.007","raw":"Fitzgerald, D.A., Posse, S., Moore, G.J., Tancer, M.E., Nathan, P.J., & Phan, K.L. (2004). Neural correlates of internally generated disgust via autobiographical recall: A functional magnetic resonance imaging investigation. Neuroscience Letters, 370, 91-96.","cites":null},{"id":43711819,"title":"Real wrongs in virtual communities.","authors":[],"date":"2003","doi":"10.1023\/b:etin.0000017737.56971.20","raw":"Powers, T.M. (2003). Real wrongs in virtual communities. Ethics in Information Technology, 5, 191-198.Sherry, J. (2001). The effects of violent video games on aggression: A meta-analysis. Human Communication Research, 27, 409-Sherry, J. (2001). The effects of violent video games on aggression: A meta-analysis. Human Communication Research, 27, 409-431.","cites":null},{"id":43711807,"title":"Reevaluation of the impact of violent video games.","authors":[],"date":"1993","doi":"10.1177\/000992289303200205","raw":"Funk, J. B. (1993). Reevaluation of the impact of violent video games. Clinical Pediatrics, 32, 86-90.","cites":null},{"id":43711820,"title":"Reflecting on the development of interpretative phenomenological analysis and its contribution to qualitative research in psychology,","authors":[],"date":"2004","doi":null,"raw":"Smith (2004). Reflecting on the development of interpretative phenomenological analysis and its contribution to qualitative research in psychology, Qualitative Research in Psychology, 1(1), 39-54.","cites":null},{"id":43711829,"title":"The demographics, motivations and derived experiences of users of massively-multiuser online graphical environments.","authors":[],"date":"2006","doi":"10.1162\/pres.15.3.309","raw":"Yee, N. (2006). The demographics, motivations and derived experiences of users of massively-multiuser online graphical environments. PRESENCE: Teleoperators and Virtual Environments, 15, 309-329.","cites":null},{"id":43711809,"title":"The effects of technological advancement and violent content in video games on players' feelings of presence, involvement, physiological arousal, and aggression.","authors":[],"date":"2007","doi":"10.1111\/j.1460-2466.2007.00356.x","raw":"Ivory, J. D., & Kalyanaraman, S. (2007). The effects of technological advancement and violent content in video games on players' feelings of presence, involvement, physiological arousal, and aggression. Journal of Communication, 57, 532-555.","cites":null},{"id":43711817,"title":"The priming effects of avatars in virtual settings.","authors":[],"date":"2009","doi":"10.1177\/0093650209346802","raw":"Peña, J., & Hancock, J. T., & Merola, N. A. (2009). The priming effects of avatars in virtual settings. Communication Research, 36, 838-856.","cites":null},{"id":43711801,"title":"This study was funded by a Nuffield Foundation grant. What I won’t do in pixels 33 7. References","authors":[],"date":"2003","doi":null,"raw":"This study was funded by a Nuffield Foundation grant. What I won’t do in pixels 33 7. References Anderson, C. A., Berkowitz, L., Donnerstein, E., Huesmann, L. R., Johnson, J. D., Linz, D., Malamuth, N. M., & Wartella, E. (2003). The influence of media violence on youth. Psychological Science in the Public Interest, 4 (3), 81-110.","cites":null},{"id":43711802,"title":"Torture and the ticking bomb.","authors":[],"date":"2007","doi":"10.1002\/9780470692486","raw":"Brecher, B. (2007). Torture and the ticking bomb. Malden, MA.: Blackwell Buchman, D. D., & Funk, J. B. (1996). Video and computer games in the ‘90s: Children’s time commitment and game preference. Child Today, 24, 12-16.","cites":null},{"id":43711822,"title":"Using Instant Messaging for Internet-based interviews.","authors":[],"date":"2006","doi":"10.1089\/cpb.2006.9.552","raw":"Steiger, S., & Goritz, A. (2006). Using Instant Messaging for Internet-based interviews. CyberPsychology & Behavior, 9 (5), 552-559.","cites":null},{"id":43711830,"title":"Virtually Real Emotions and the Paradox of Fiction: Implications for the use of virtual environments in psychological research.","authors":[],"date":"2010","doi":"10.1080\/09515080903532274","raw":"Young, G. (2010). Virtually Real Emotions and the Paradox of Fiction: Implications for the use of virtual environments in psychological research. Philosophical Psychology, 23(1), 1-21. Young, G., & Whitty, M T. (in press). Should gamespace be a taboo-free zone? Moral and psychological implications for single-player video games. Theory & Psychology.","cites":null},{"id":43711816,"title":"What I won’t do in pixels 34","authors":[],"date":"1979","doi":null,"raw":"What I won’t do in pixels 34 Linton, D. (1979). Why is pornography offensive? The Journal of Value Inquiry, 13 (1), 57-62.","cites":null},{"id":43711825,"title":"What I won’t do in pixels 35","authors":[],"date":"2008","doi":"10.1016\/j.chb.2010.08.004","raw":"What I won’t do in pixels 35 Whitty, M. T. (2008). Liberating or debilitating? An examination of romantic relationships, sexual relationships and friendships on the Net. Computers in Human Behavior, 24, 1837-1850.","cites":null},{"id":43711828,"title":"Who plays, how much, and why? Debunking the stereotypical gamer profile.","authors":[],"date":"2008","doi":"10.1111\/j.1083-6101.2008.00428.x","raw":"Williams, D., Yee., N., & Caplan, S. E. (2008). Who plays, how much, and why? Debunking the stereotypical gamer profile. Journal of Computer-Mediated Communication, 13 (4), 993-1018.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-09-02","abstract":"This paper examined the emotional impact that engaging in or witnessing Symbolic Taboo Activities (STAs), as represented in MMORPGs (massively multiplayer online role-playing game), such as killing, torture and rape, has on adults. We focused our study on two games: World of Warcraft and Sociolotron. The study employed Interpretative Phenomenological Analysis (IPA), which was chosen because of its emphasis on ‘lived experienced’ and how participants make sense of their experiences. Five participants, all over the age of 18 years, were interviewed via Instant Messenger, four of which were men. Most of our participants felt they could easily separate gamespace from the real world; however, when asked to examine specific actions in-depth, we found this was not the case for all STAs. Activities that did not have a sanctioned equivalence (e.g., rape) were found by most to be more difficult to separate, especially emotionally. However, this was not the case for all participants. The findings suggest that not all individuals can psychologically cope with engaging in and\/or witnessing certain STAs in MMORPGs. The results, we believe are important for game designers, censoring bodies of video games and psychologists.Peer-reviewedPost-prin","downloadUrl":"http:\/\/hdl.handle.net\/2381\/9727","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/9727\/1\/Whitty_what%20I%20won%27t%20do%20in%20pixels.pdf","pdfHashValue":"5e5400ced84044c02af8a7aa654093469da97102","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/9727<\/identifier><datestamp>\n                2011-10-05T01:01:47Z<\/datestamp><setSpec>\n                com_2381_304<\/setSpec><setSpec>\n                com_2381_9551<\/setSpec><setSpec>\n                col_2381_399<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nWhat I won’t do in pixels: Examining the limits of taboo violation in MMORPGs<\/dc:title><dc:creator>\nWhitty, Monica T.<\/dc:creator><dc:creator>\nYoung, Garry<\/dc:creator><dc:creator>\nGoodings, Lewis<\/dc:creator><dc:subject>\nSymbolic Taboo Activities<\/dc:subject><dc:subject>\nVideogames<\/dc:subject><dc:subject>\nWorld of warcraft<\/dc:subject><dc:subject>\nSociolotron<\/dc:subject><dc:subject>\nPsychological harm<\/dc:subject><dc:subject>\nViolent video games<\/dc:subject><dc:description>\nThis paper examined the emotional impact that engaging in or witnessing Symbolic Taboo Activities (STAs), as represented in MMORPGs (massively multiplayer online role-playing game), such as killing, torture and rape, has on adults. We focused our study on two games: World of Warcraft and Sociolotron. The study employed Interpretative Phenomenological Analysis (IPA), which was chosen because of its emphasis on ‘lived experienced’ and how participants make sense of their experiences. Five participants, all over the age of 18 years, were interviewed via Instant Messenger, four of which were men. Most of our participants felt they could easily separate gamespace from the real world; however, when asked to examine specific actions in-depth, we found this was not the case for all STAs. Activities that did not have a sanctioned equivalence (e.g., rape) were found by most to be more difficult to separate, especially emotionally. However, this was not the case for all participants. The findings suggest that not all individuals can psychologically cope with engaging in and\/or witnessing certain STAs in MMORPGs. The results, we believe are important for game designers, censoring bodies of video games and psychologists.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPost-print<\/dc:description><dc:date>\n2011-10-04T13:13:12Z<\/dc:date><dc:date>\n2011-10-04T13:13:12Z<\/dc:date><dc:date>\n2010-09-02<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nComputers in Human Behavior, 2011, 27 (1), pp. 268-275.<\/dc:identifier><dc:identifier>\n0747-5632<\/dc:identifier><dc:identifier>\nhttp:\/\/www.sciencedirect.com\/science\/article\/pii\/S0747563210002475<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/9727<\/dc:identifier><dc:identifier>\n10.1016\/j.chb.2010.08.004<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\n© 2010 Elsevier Ltd.  Deposited with reference to the publisher's archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:publisher>\nElsevier<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0747-5632","issn:0747-5632"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Symbolic Taboo Activities","Videogames","World of warcraft","Sociolotron","Psychological harm","Violent video games"],"subject":["Article"],"fullText":"What I won’t do in pixels 1 \nWhitty, M.T., Young, G., & Goodings, L. (2011). What I won’t do in \npixels: Examining the limits of taboo violation in MMORPGs. \nComputers in Human Behavior, 27, 268-275. \n \nWhat I won’t do in pixels: Examining the limits of taboo violation in MMORPGs \nMonica T. Whitty \nGarry Young \nLewis Goodings \n \nThis paper examined the emotional impact that engaging in or witnessing Symbolic \nTaboo Activities (STAs), as represented in MMORPGs (massively multiplayer online \nrole-playing game), such as killing, torture and rape, has on adults. We focused our \nstudy on two games: World of Warcraft and Sociolotron. The study employed \nInterpretative Phenomenological Analysis (IPA), which was chosen because of its \nemphasis on ‘lived experienced’ and how participants make sense of their \nexperiences. Five participants, all over the age of 18 years, were interviewed via \nInstant Messenger, four of which were men. Most of our participants felt they could \neasily separate gamespace from the real world; however, when asked to examine \nspecific actions in-depth we found this was not the case for all STAs. Activities that \ndid not have a sanctioned equivalence (e.g., rape) was found by most to be more \ndifficult to separate, especially emotionally. However, this was not the case for all \nparticipants. The findings suggest that not all individuals can psychological cope with \nengaging in and\/or witnessing certain STAs in MMORPGs. The results, we believe \nare important for game designers, censoring bodies of video games and psychologists. \n \nWhat I won’t do in pixels 2 \nKeywords: MMORPGs, videogames, taboos, world of warcraft, sociolotron, \npsychological harm, violent video games \nWhat I won’t do in pixels 3 \nWhat I won’t do in pixels: Examining the limits of taboo violation in MMORPGs \n \n1. Introduction \nPsychological research into videogames has focused mostly on the \nrelationship between gaming and aggression, online identities, and the social and \naddictive nature of these spaces. However, psychologists have spent little time \nexamining whether there are certain aspects of a game (including how it looks, the \nrules of the game, and what behaviours ought to be constrained or allowed in the \ngame) or certain role playing behaviours or interactions that are deemed inappropriate \nor upsetting for players. For example, are some killings too graphic? Is it ok to engage \nin sexual talk or erotic activities in these games and, if so, what are the accepted limits \nof these activities? Is cannibalism a psychologically healthy fantasy to engage in \nwithin a game? How does it feel to play out rape in a game? In this study, we were \ninterested in the emotional impact that engaging in or witnessing Symbolic Taboo \nActivities (STAs), as represented in MMORPGs (massively multiplayer online role-\nplaying game), such as killing, torture and rape, has or might have on the individual \nadult. Research of this kind, we believe, will assist organisations involved in the \ncensoring and rating of games, psychologists (both researchers and therapists), game \ndesigners, as well as the individuals who opt to play these games. \n \n \n1.1. Symbolic taboo activities in games \nNumerous video games include representations of activities that are taboo, \ncriminal or immoral to engage in offline. Many games, for instance, contain graphical \nrepresentations of violence, where individuals maim and kill (e.g., Left 4 Dead 2; Kill \nWhat I won’t do in pixels 4 \nZone 2; Soldier of Fortune 2), and in a growing number murder, mutilate and even \ntorture (Reservoir Dogs). In some games these acts are an integral part of the plotline \nand gameplay (Manhunt 2, Postal 2, MadWorld). In a few cases, it is even possible to \nwitness the cannibalisation of victims. The Resident Evil series, Evil Dead, and \nF.E.A.R. all feature cannibalism, although more in the form of a threat to the player \nthan something he\/she engages in. It is rarely the case, however, that characters \nengage in acts of rape or incest. Exceptions to this are Phantasmagoria (rape is \npossible), The House of the Dead: Overkill (in which incest is implied by an action), \nand No More Heroes (where it is a feature of the game narrative, but not interaction). \nRape is a key feature within Battle Raper (defeated female opponents can be raped \nand sexually assaulted); and in RapeLay the entire gameplay centres on hunting down \nand raping a mother and her virgin daughters, although it is also possible to rape other \nwomen. \nIn MMORPGs, players take on the role of a fictional character, typically in a \nfantasy world, and have agency over many of their character’s actions. MMORPGs \ndiffer from single player games in that many people are logged onto the game at the \nsame time and opponents and team players include both computer generated and \ncharacters controlled by real people. The worlds created in these games continue to \nevolve even when the player is absent from the game – examples include EverQuest, \nWorld of Warcraft, Final Fantasy XI and, more recently, Warhammer. The popularity \nof these games continues to grow. More recently, the nature of this interaction with \nsome MMORPGs has become more ‘adult’ based. Age of Conan, Warhammer, 2 \nMoons, and Requiem: Bloodymare, for example, provide increased opportunities for \nextreme violence and more graphic depictions of violent outcomes. Continuing the \nadult theme, Sociolotron promotes itself as a world with different values and rules in \nWhat I won’t do in pixels 5 \nwhich you are allowed to explore your ‘darker side’. Sex, both consensual and non-\nconsensual, is permitted and graphically represented, as is politically incorrect \nbehaviour, including blasphemy and all forms of discrimination. The general \nphilosophy of the game seems to be that if you are given the freedom to express \nyourself within this space then you should allow others to do the same. Exempt from \nthis freedom, however, is any form of simulated paedophilia. It is explicitly stated on \nthe game’s homepage that this is unacceptable (a point we shall return to). Similarly, \nin Pangaea, a game originating in Korea, sex is either a main feature of the gameplay, \nor appears indirectly in gambling and fantasy battle options – female warriors lose \ntheir clothes when hurt or wounded, for example, becoming fully naked when killed. \nContinuing the cybersex theme is 3 Feel – launched as the first English adult \nMMORPG. \n \n1.2. Video games and aggressive behaviour \nGiven the amount of violence and adult content in video games, there has been \na growing concern in society regarding which of these games children ought to have \naccess to. With regards to psychological research, the main focus has been on whether \nplaying these games causes children to become more aggressive (Buchman & Funk, \n1996; Funk, 1993). In a review of the literature, Anderson et al. (2003) found that \nmany studies reported a number of short-term effects of playing video games, such as \nthe increased likelihood of physically and verbally aggressive behaviour, and \nincreased aggressive thoughts and emotions. Sherry’s (2001) meta-analysis likewise \nfound that games have some kind of effect on aggression; however, the effect is \nsmaller than that produced by watching television. Moreover, the treatment time in \nthe studies she considered varied from 5 to 75 minutes, making it difficult to \nWhat I won’t do in pixels 6 \ndetermine precisely how long the effect actually lasts. Few studies have focused on \nonline games. Williams and Skoric’s (2005) longitudinal study of MMO  (Massively \nMultiplayer Online) players found no evidence for the claim that online violent games \ncause substantial increases in real-world aggression; neither did playing online violent \ngames result in more accepting beliefs about violent behaviours. However, Ivory and \nKalyanaraman (2007) found that the more immersed an individual was in a game the \ngreater their physiological and self-reported levels of arousal, and aggression. \nSimilarly, Polman, de Castro and van Aken (2008) found that actively engaging in a \nviolent video game produced higher levels of aggression than passively watching the \nsame game (in boys but not girls). Interestingly, Konijn and Bushman (2007) found \nthat boys who felt more immersed in the game, and identified more with the \nprotagonist, exhibited more aggressive behaviour. In summary, then, it appears that \ngames, including online video games, can lead to a small increase in aggressive \nbehaviour in some individuals. \n \n1.3. Possible psychological impact of violating offline taboos in gamespace \nWhilst a comprehensive understanding of the degree to which violent games \nbreed violence is of course important research that ought to be undertaken, it is not \nour main concern in this study. We were instead concerned with whether engaging in \nor witnessing ‘Symbolic Taboo Activities’ (STAs) in MMORPGs has a negative \npsychological impact on gamers.  \nIn previous work it has been theorised that engaging in STAs in gamespace \nmight elicit disgust or distress emotional responses possibility unanticipated by the \nplayer (Young & Whitty, in press). This theory is based on previous work on disgust. \nDamasio’s (1994) somatic marker hypothesis, for instance, contends that our visceral \nWhat I won’t do in pixels 7 \nresponse to certain events is automated through habituation. So much so that merely \nthinking about similar events can trigger a physiological response. Similarly, \nFitzgerald et al. (2004) argue that the excitation of neural pathways underlying our \nresponse to disgust-eliciting objects\/events can occur even in the absence of external \ntriggers. Therefore, if the mere thought of taboos is sufficient to elicit deep disgust, \nthen it seems reasonable to conjecture that any virtual display of taboos will likewise \nelicit a visceral response. Moreover, if such responses are elicited, is the gamer able to \ncope, psychologically, with engaging in or witnessing such activities? \nIn order to cope psychologically with engaging in activities such as killing, \ntorture and rape in gamespace, it might be necessary to make a clear distinction \nbetween gamespace and ordinary life. Whitty and Carr (2006) have argued that: \nthe fundamental essence of play is the freedom, the license to create and be set \napart from ordinary life. Yet, on the other hand, for this to be accomplished, \nconstraint is required in the form of rules and other factors related to space and \ntime. Thus, in an interesting twist of logic, freedom is created only through \nconstraint. (p. 58) \nWith respect to cyberspace, Whitty and her colleague (2003, Whitty & Carr, 2006) \nhave argued that it is very difficult to completely separate the realm of cyberspace and \nthe offline world. Turkle (1995) has also made this argument with respect to MUDS \n(a similar space to MMORPGs but in text only) “the computer can be similarly \nexperienced as an object on the border between self and not-self … People are able to \nsee themselves in the computer. The machine can seem a second self” (p. 30). \nEngaging in play can be liberating and conducive to the development of the self as \nwell as psychological growth; however, it can also be debilitating, especially when \nplay aligns itself too closely with reality (Whitty & Carr, 2006). According to \nWhat I won’t do in pixels 8 \nprevious psychologists, it is therefore important to understand the emotional \nresponses and meanings that are imported into the realm of play. With respect to our \nstudy, MMORPGs can appear like a completely different reality, with characters that \ndid not exist in the real world (e.g., goblins and wizards); however, not all games do. \nMoreover, MMORPGS involve individuals playing against other real individuals. \nTherefore, we are interested in whether people respond differently to actions that \nappear fantastical versus games that mimic closely the real world and whether this \nvaries depending on whether the action is played out against the computer compared \nto a ‘real person’ operating the character. We also wish to examine whether it is easier \nto separate some gamespaces from the real world compared with others, and whether \nthis separation assists in coping with the STAs gamers engage in or witness in play, or \nwhether it is even necessary to make a clear distinction between gamespace and \nordinary life. \n It may well be that some actions are easier to deal with in gamespace \ncompared to others. For example, Young and Whitty (in press) have pointed out that \nsome taboo activities in the real world are sanctioned. Killing, for example, can occur \nin legitimate or illegitimate ways. A sanctioned equivalent of killing is state \nauthorised execution, or the death of combatants during a war. Torture, they point out, \nhas been justified in the past by legitimate authorities (Soldz, 2008), and in some \ncases still is; or at least its legitimate use is debated (in the ticking bomb scenario, for \nexample; see Brecher, 2007). The unofficial ‘Law of the Sea’, they state, maintains \nthat cannibalism is acceptable, or is at least tolerated, when one’s life depends on it \nand the victim is already dead, or was selected through the mutually agreed drawing \nof lots. However, they contend that it is difficult to think of a sanctioned equivalent in \nWhat I won’t do in pixels 9 \nthe case of rape or necrophilia, or of cases in which one’s life might depend on an act \nof incest or bestiality.  \n Videogames often involve killings against a more traditional ‘enemy’ (e.g., \nCall of Duty, Modern Warfare saga), or against hordes of fictional evil mutants, or \nalien or demonic beings (Left 4 Dead 2). In World of Warcraft, it is possible to \ncannibalise opponents, but this is carried out in order to re-energise one’s life force. \nSuch actions, Young and Whitty (in press) argue, fall within the remit of sanctioned \nequivalence, and therefore constitute an acceptable form of gameplay. Less clear, they \nsuggest, is the justification for taking on the role of a contract killer (e.g., Hitman) or \nserial killer (Postal 2, Manhunt 2), irrespective of whether one’s character is \nrealistically depicted or presented in fantasy alien or demonic guise (God of War); \nwhich in turn suggests that activities that have no sanctioned equivalence in a game \nmight be more distressing to play out. This study intends to examine the principle of \nsanctioned equivalence within MMORPGs to determine whether individuals are \nbetter able to cope with symbolic taboo activities that have ‘real world’ sanctioned \nequivalence. \n \n1.4. Current study \nThis is an exploratory study that is interested in the psychological impact \n(and\/or the perceived psychological impact) of engaging in or witnessing STAs in \nMMORPGs. Although it is important to examine the psychological impact of \nengaging in STAs on both children and adults, we have chosen to focus on an adult \npopulation in this study. Researchers in the past have been interested in adults and \nplay and what aspects of play they can cope with psychologically (Whitty & Carr, \n2006). Moreover, the majority of MMORPGs players are adults (e.g., Williams, Yee \nWhat I won’t do in pixels 10 \n& Caplan, 2008; Yee, 2006). In fact, in one of the most recent studies on MMORGPs, \nWilliams et al. found, in a sample of 7000, less than seven percent were younger than \n18 years of age. Therefore, we believe that an adult population is a valid starting point \nfor such an investigation. We were interested in MMORPGs, rather than single player \ngames (where the individual plays against a computer), because of the increased \ninvolvement within the game of other offline players, both as team members or \nopponents, and the impact this may have on decisions players make regarding how \nthey play or experience the game.  \n \n2. Method \nThe study employed Interpretative Phenomenological Analysis (IPA), which \nwas chosen because of its emphasis on ‘lived experienced’ and how participants make \nsense of their experiences (Smith, 2004). IPA focuses on how individuals perceive \ntheir world and what that experience means for them. The main structure of the \nanalysis using IPA is as follows: (1) the thorough re-reading of interview texts and \nmaking initial notes on the left-hand margin of the page; (2) the notation of the \nemerging themes in the right-hand margin of the page; (3) recognising how the \nthemes cluster together; (4) the production of a table of themes which highlight both \nthe sub-ordinate and emergent themes. Each of these stages requires working closely \nwith the text to develop the themes that will extract the core meaning of the \nindividual’s experience. The process takes a hermeneutic approach and so requires \ncontinually returning to the data to ground the interpretation of the themes. \n \n2.1. Materials \nWhat I won’t do in pixels 11 \n It was decided to recruit participants from two MMORPGs – World of \nWarcraft (WoW) and Sociolotron. WoW was chosen because of its popularity and \ngame structure. Here, individuals can, and often do, engage in actions prohibited \noffline (e.g., stealing, torturing and killing). Moreover, the world is a fantasy world \nwhere most creatures do not exist in the ‘real world’. Sociolotron was chosen because \nit permits, and might even be said to encourage, individuals to engage virtually in \nmany offline taboo activities (e.g., rape, and racist behaviour). The only restriction in \nthis game, for legal reasons, is that players cannot role-play paedophilias. Although \nthis game is not graphically sophisticated, the characters are human and the places \nwithin the game resemble real life much more than WoW does.  \nGiven that we were conducting an exploratory study and making no attempt to \ngeneralise to MMORPG players we wanted to recruit participants from two very \ndifferent games. WoW does not include STAs such as rape, nor does it encourage \nengaging in sexual behaviours. However, it does include killing, a form of \ncannibalism, torture and stealing. It is also not impossible for such players to imagine \nhow they would experience engaging in other STAs, such as rape or paedophilia. In \ncontrast, Sociolotron does focus on all forms of sex and STAs and this allowed us to \nask people about their experiences in engaging in these forms of STAs. Our aim was \nto examine if some individuals do cope and enjoy engaging in STAs as well as for \nthose who do not the reasons why and the potential psychological detrimental effects \nthey felt that engaging in such STAs might have on them. Hence, we felt it important \nto include two very different games in order to gain greater insight into different types \nof individuals’ experiences of engaging in STAs. \nWe note that the two games involve engaging in different types of STAs. The \nplayers that choose not to or did not have the option of playing out certain STAs \nWhat I won’t do in pixels 12 \ncould imagine what it might be like for them engaging in such activities and why they \nmight choose to engage in or avoid such actions. It would of course be unethical for \nus to force our participants to play out activities that they elected to not play in their \ngames or to request them to play a game with STAs that they did not feel comfortable \nplaying. \n We decided to interview participants using an Instant Messenger (IM) \nprogramme. Steiger and Goritz’s (2006) study on instant messaging as a method for \ninterviewing found IM to be a feasible and in many ways a superior method to other \nmethods of data collection. They state, that: \nthe risk of receiving false data in IM interviews is small. Not only is the \nquality of the obtainable data satisfying but also the contact rate, response rate, \nand retention rate….Also, there is the advantage of the presence of human \nintelligence during the interview. However, these benefits come at the cost of \nmore time effort. (p. 558) \nFor our study, IM also seemed appropriate given that our sample were internet savvy \nand claimed to be regular users of IM.  \nA semi-structured interview was created for the study. Participants were asked \nto discuss in-depth about how they experienced the game and how this compared to \ntheir ‘real world’ experiences. They were asked about the types of STAs they had \nplayed, witnessed, or would be prepared to play in the game and how they felt about \nengaging in these activities. Moreover, they were asked if they believed their \nexperience would be different if the game appeared more lifelike (e.g., improvement \nin graphics) and, if so, how. Participants were also asked about any moral codes they \nhad imported into the game, and whether engaging in STAs had altered their ‘real \nworld’ moral codes. \nWhat I won’t do in pixels 13 \n \n2.2. Procedure \nPrior to commencing the study ethics clearance was gained from the \nuniversity’s ethics committee. The participants were recruited from the official game \nforums for individuals 18 years and older. After gaining permission from the \nmoderators of the site, information about the study, and an invitation for inviting \nparticipants to contact the research assistant, were placed on the online chat forum \ndedicated to ‘general discussion’. This was carried out on both WoW and Sociolotron \nchat room forums. Each of the posts asked the gamers to email the research assistant \nif they wished to partake in the investigation. In each case, the posts were specifically \ndesigned to adhere to the forum guidelines and regulations.   \n When an interested gamer contacted the research assistant, the assistant then \nengaged in an email exchange providing the participant with further information \nabout the study. If the participant agreed to be interviewed, they were sent an \ninformation sheet and a consent form via email to sign and return to the research \nassistant. Notably, the email exchange provided an opportunity to build up a rapport \nprior to the IM interview. It was entirely possible that participants played more than \none MMORPG; however, we asked them to focus in the interview on either WoW or \nSociolotron. Participants were then given the opportunity to decide which IM \nprogramme they preferred to use and a time was agreed for the interview. Interview \nduration ranged from 1-3 hours.  \n \n2.3. Participants \nA total of 5 participants were recruited (3 from WoW and 2 from Sociolotron). \nThe sample size is in keeping with the ideographic nature of IPA (Smith, 2004). The \nWhat I won’t do in pixels 14 \nparticipants consisted of 4 males and 1 female (who played Sociolotron). They all \nresided in the UK. The participants’ ages ranged from 19-41 years, with a mean of \n30.80 years (SD= 10.54). All WoW players had been playing for 4 years and the \nSociolotron 2 years (which notably has been as long as this game has been in \nexistence at the time). Participant 5 claimed to have been involved in the design of \nSociolotron. Average hours of playing the game per week ranged from 19-35 hours, \nwith a mean of 25.60 hours (SD=6.50). Participants’ details can be seen in Table 1. \n \nTable 1 \nDescription of participants \n \nParticipant Game Age Sex Years playing Average hours per week \n1 WoW 19 M 4 26 \n2 WoW 32 M 4 19 \n3 Wow 21 M 4 20 \n4 Sociolotron 41 F 2 35 \n5 Sociolotron 41 M 2 28 \n \n \n3. Results \nSeven superordinate themes emerged through analysis of the data. These \nthemes and their emergent themes are summarised in Table 2. They are described in \nmore detail below, together with quotes to illustrate these themes. Given that the \ninterviews were using an IM programme, the quotes we have provided here are \nverbatim. \nWhat I won’t do in pixels 15 \n \nTable 2 \n \nTable of superordinate and emergent themes \n \nSuperordinate theme Emergent theme \n1. Separating gamespace from \nthe real world \nDifferent experience to other spaces \n The unrealistic appearance of the game  \n Could separate even if it looked more realistic \n Just a game\/play\/escape \n Anonymity provides opportunities to be more playful \n  \n2. Sanctioned equivalence Self-defence \n Baddies versus goodies \n Cannibalism \n Torture \n Bondage \n  \n3. Can’t separate all symbolic \ntaboos \nProblems with activities when there is no sanctioned \nequivalence (e.g., ganking; rape) \n Some taboos are worse than others \n Even if game looks unreal \n  \n4. Taboos ought to be But, game needs more than offline equivalent taboos \nWhat I won’t do in pixels 16 \npermissible in the game in order to be interesting \n But don’t want to witness it themselves \n But still personally affects them \n Do not think less of people who participate in these \ntaboos \n  \n5. Having real players impacts \non game play \nConcern for children (e.g., children) \n Gaming moral code \n Lack of concern – even if suspect negative affect  \n Cheating as in any other sport \n  Symbolic depraved actions (e.g., tea bagging) \n  \n6. Emotions experienced from \nengaging in symbolic taboo \nactivities \nEnjoyment (e.g., killing, provoking reactions) \n Anger \n Shame \n  \n7. Comparing real self with \ngame self \nSimilarities between self and online character \n Differences between self and online character \n Deliberately separates self from character \n Real world morality remains the same  \n Change to offline self (e.g., sexuality) \nWhat I won’t do in pixels 17 \n \n \nTheme 1: Separating gamespace from the real world \nThe superordinate themes focused on participants’ ability to separate \ngamespace from the real world. Reasons given (emergent themes) for why they were \nvery capable of separating the spaces included: ‘Different experience to other spaces’; \n‘The unrealistic appearance of the game’; ‘Could separate even if it looked more \nrealistic’; ‘Just a game\/play\/escape’; and ‘Anonymity provides opportunities to be \nmore playful’. \n Participant 1 described the experience as magical and unlike anything he had \nexperienced previously. All five participants discussed how the game appeared very \nunrealistic, which allowed for a psychological split between gamespace and the real \nworld. Games were described as looking cartoonish, just pixels, and actions, such as \ndeath, not resembling the same action offline.  \nIt would certainly feel different if the game appeared more real, however, the \ngame itself has always been quite cartoonish, graphics-wise. While the \ngraphics aren’t bad, I don't think there would be any danger of someone not \nbeing able to seperate the game from reality (P1, L125) \n \nin the end it’s just a bunch of pixels with some text (P4, L705) \n \nfirstly, this isn’t exactly a violent game - there's tiny splashes of blood, and the \nanimations don't often show any physical contact between characters (P3, \nL100) \n  \nWhat I won’t do in pixels 18 \nAlthough participants discussed in detail how the games did not resemble the \nreal world in appearance, participants 3, 4 and 5 stated that they believed they would \nstill easily be able to separate the spaces, even if the graphics did make the game \nappear more real.  \nI: what if the game looked more real - and I know you were involved with the \nbeta version so you will have a good insight on this - would you still feel \ncomfortable with rape? \nP5: I have played other sex games such as Red Light and Second life which \nhave more realistic graphics but personally it is still just pixels to me I have \nno real attachment to any of my characters which is why I was so \n“dangerous” in S [Sociolotron]. I didnt care if my characters got raped or \nkilled, even perma death [when a character dies permanently] didnt bother me. \n(P5, L108) \n  \nParticipants 1 and 5 discussed how the game for them was an escape and that \nthe MMORPG was simply a game where they could act out behaviours they would \nnever contemplate doing offline. \nAbout the illegal activities - I would say it is just a game. There is no way I \nwould kill someone in realy life, or even hit them with an axe. I guess being \nable to do things you can't do in real life is seen as an escape by many \nplayer…if you aren't very happy with your real life situation it is possible to \nturn on the game, put on some headphones and escape to a completely \ndifferent world. (P1, L113) \n \nP5: you do eat bodily fluids though, sperm and blood are used to make potions \nWhat I won’t do in pixels 19 \nI: do you feel ok with this? \nP5: in the context of the game, yes \n(P5, L238) \n  \nParticipant 5 talked about some of the extreme actions he was able to act out \nin Sociolotron, especially with regards to role-playing. He suggests that he was able to \ndo this because of the separation of his real self from the gaming character, as well as \nthe anonymity afforded to him.  \n…he had so many women admirers in the game [referring to his character] it \nbecame ridiculous. Men hated him and chased him all over London trying to \nkill him, which was extremely funny. and as far as how it made me feel to be \nhated, dont forget, to me he was just pixels on the screen it wasnt personal, in \nfact people who roleplayed with my other characters would sound off about \nhim to me without a clue that it was me who played him (P5, L101) \n \nTheme 2: Sanctioned equivalence \n Many of the symbolic taboo activities identified by the participants were of \nactivities that under certain circumstances are deemed acceptable in the real world. \nThe emergent themes for this superordinate theme included: ‘Self-defence’; ‘Baddies \nversus goodies’; ‘Cannibalism’; ‘Torture’; and ‘Bondage’. World of Warcraft appears \nto have built into the game these sanctioned equivalent scenarios, such as the one \ndescribed below: \nThere’s one quest in which you have to give electric shocks to a non-player \ncharacter for information, he asks  you to stop and expresses quite a bit of \nWhat I won’t do in pixels 20 \npain but you can continue until he tells you what you need to know, as well as \ncarrying on after (P3, L254) \n \nThe ‘baddies and goodies’ emergent theme was perhaps more akin to what \nindividuals might find acceptable in a movie rather than a replication of real life. \nwell in part of the game there is a place, a raid, that you go to as a group. \nthere is an evil guy there that you hve to find and eventually kill, who has been \ntorturing people (P1, L230) \n \nTheme 3: Can’t separate all symbolic taboos \n Although all five participants felt that it was very easy to separate gamespace \nfrom the real world participants 2, 3 and 4 found some symbolic taboo activities \ndifficult to engage in.  The emergent themes for this superordinate theme were:  \n‘Problems coping with activities when there is no sanctioned equivalence’; ‘Some \ntaboos are worse than others’; and ‘Difficulties separating even if the game appears \nunreal’. The three activities that were identified as not having a sanctioned \nequivalence were ganking, rape, and paedophilia. Ganking is a term made up by \ngamers to explain when a group of characters gang up on one or more players that do \nnot have a chance to defend themselves. Participant 4 discussed her upset about ‘nice’ \npeople getting raped in Sociolotron. Her discourse sounds very similar to how \nindividuals might talk about someone being raped offline, especially with regards to \nher emotional reaction. \nwow \nerm... I just typed out I would rape.....however \n*wouldn't [correction to ‘would’ in previous sentence] \nWhat I won’t do in pixels 21 \nif I caught a rapist I likely would \nand likely use my sword to do it with (P4, L725) \n \nP4: a ‘nice’ character being raped outside a bar by a demon with a weapon \nI: ok \nP4: nobody could do anything about it because of the game machanics at the \ntime that did get to me \nI: I bet \nP4: partly because there was nothing I could do to help I: partly because the \ngirl didn't deserve that treatment \nIt made me feel sad (P4, L266) \n \nParticipant 3 makes an interesting distinction between rape and torture compared to \ncannibalism, suggesting that rape and torture are worse because they are more likely \nto occur in real life, whereas cannibalism is more likely to be an action in a horror \nfilm. \ni think you have an incredibly poor opinion of humanity if you think it's a \ntrope of humanity is to rape and torture! no, what i meant was cannibalism is \na common attribute of zombies from horror films and the like – it’s what they \ntend to do,  it’s part of what makes them zombies. i don't think rape and \ntorture are part of what makes us human! also, rape and torture are \nfar.......more tangible, more immediate, more threatening. cannibalism is an \nexotic threat, something far removed from everyday life, hence it being far \neasier to include in a fantasy environment (P3, L330) \n \nWhat I won’t do in pixels 22 \nParticipant 3 also comments that rape in a game would be unacceptable to him, unlike \nother taboo violations. \nrape is a little different to bring into a fantasy world without still being \nsomehow realistic the very idea is abhorrent ( P3, L351) \n \nTheme 4: Taboos ought to be permissible in the game \n  Participants 2, 3 and 4 discuss that, in principal, many symbolic taboos ought \nto be permissible in the game. They state this qualifying that these are just games and \nso individuals who want to engage in them ought to be permitted to do so. However, \neach said that despite being permissible that: ‘The game needs more than offline \nequivalent taboos in order to be interesting’; ‘They don’t want to witness it \nthemselves’; and ‘They still personally affect them’. Participant 3 makes an \ninteresting real world parallel to explain their belief that it should be permitted so long \nas they don’t have to witness it: \n Actually, i think that could make a lot of sense if some people could do it in a \ngame form and not do it in the real world almost like methadone but i'd rather \nthey had their own online world to do that in, so i'm not exposed to it! (P3, \nL461) \nMoreover, participant 4 qualifies that they ‘do not think any less of people who do \nparticipant in these taboos in gamespace’. \nP4: yes, therefore I do know people who rape etc, and I don't think any less of \nthem for it as such (P4, L909) \n \nTheme 5: Having real players impacts on game play \nWhat I won’t do in pixels 23 \n  We opted in this study to examine MMORPGs, rather than single player \ngames, as we wanted to examine how it felt to engage in symbolic taboo activities in \nthe presence as well as against others. As highlighted earlier, ganking, an activity \ncarried out against real people in the game, was seen as unacceptable by our \nparticipants. For superordinate theme 5 the following emergent themes emerged: \n‘Concern for others (e.g., children)’; ‘Gaming moral code’; ‘Lack of concern for \nothers’; ‘cheating’ and ‘Symbolic depraved actions’. Participant 5 said that he felt \nstrongly that children ought not to be allowed to play an adult MMORPG such as \nSociolotron. Participant 2, who played the fantasy based MMORPG, World of \nWarcraft, discussed how the way he played the game was constrained because he was \naware that some of the players were children. \nYou never know if it's a 12 year old kid behind the character, so I play \nhonestly. (P2, L127) \n  When questioned, participants 1 and 2 discussed their gaming moral codes. \nThey talked about the importance of being polite and respectful to others in the game.  \nCertainly, WoW requires a lot of interaction and communication - both \nvaluable skills requiring a good moral backbone to work effectively. If \nsomeone said \"Hey, nobhead, wanna heal me in that dungeon or are you \nchicken?\" they wouldn't get many replies. (P2, L769) \n  Not all participants, however, said that it was important to be kind and \nrespectful towards others – although they were still clearly aware of the presence of \nothers. Participant 5 was interested in others’ reactions towards his role playing, even \nif there were negative.  \nP5: yes thats fair, I was far more interested in how people reacted to various \nstimulae whether that was rape torture, of being killed. there was a wide \nWhat I won’t do in pixels 24 \ndiversity of reactions from stunned silence to manic outbursts where they \nreally beleived it was happening to them. (P5, L153) \nParticipant 3 points out how cheating in World of Warcraft is equivalent to cheating \nin any sport. He also talked about a symbolic depravity activity, called ‘tea bagging’, \nwhich was invented by gamers in their role play to taunt other players. \na taunting practice some players do when defeating others - they 'teabag', \nwhich is rapidly making your character sit down and stand up on the other \nplayer's corpse's head, simulating, well...look it up  (P3, L295) \n \nTheme 6: Emotions experienced from engaging in symbolic taboo activities \n Participants discussed a range of emotions from engaging in symbolic taboo \nactivities. The emergent themes for this superordinate theme were: ‘Enjoyment’; \n‘Anger’; and ‘Shame’. Participant 1 talked about the enjoyment he experienced from \nwatching a kill. Participant 5 (the Sociolotron players) discussed at length his \nenjoyment in engaging in taboo violations that provoked reactions from others. \nother players react in various ways to your roleplay, I was a verygood \nroleplayer and watching then get angry, frustrated or just downright rude was \nfascinating for me (P5, L46) \n \nI: did you enjoy the fact that others were uncomfortable with homosexuality or \nincest?  \nP5: Ohhh yes  (P5, L56)  \n Participant 1 talked about his anger with regards to witnessing torture in World of \nWarcraft. Whereas, Participant 3 discussed the anger he felt from the thought of \nincluding rape in the same game. Participant 4, who had originally engaged in rape \nWhat I won’t do in pixels 25 \nactivities in Sociolotron, discussed her change of view on this and how witnessing it \nnow does make her feel angry. \nP4: first off a feeling of anger (P4, L126) \n Furthermore, Participant 4 felt a real sense of shame from playing the game \nSociolotron, stating that she wouldn’t want her family to know that she played the \ngame. \n \nTheme 7: Comparing ‘real self’ with ‘game self’ \n  In order to learn more about how well participants could separate the real \nworld from their gamespace we asked them how much of themselves they saw in their \ncharacter. The emergent themes included: ‘Similarities between self and online \ncharacter’; ‘Differences between self and online character’; ‘Deliberately separates \nself from character’; ‘Real world morality remains the same’ and ‘Change to offline \nself (e.g., sexuality)’.  \nParticipants 1 and 2 identified some similarities. \nWell gnomes in game are known for their engineering - they like things that go \nboom. the same could probably be said for me; i've always liked fireworks etc. \n(P1, L329) \n \nIt's weird, but even without role playing, you do end up inflicting a personality \non your characters - to some degree. My mage seems clumbsy - like me. (P2, \nL352) \nParticipants 2 and 5 believed they were nothing like their gaming characters. \nThe rogue seems sneaky and a bit of a loner, which isn't true of me. I like my \nalone time, sure, but I wouldn't say I was a loner. (P2, L353) \nWhat I won’t do in pixels 26 \nParticipant 5 goes onto say how he deliberately ensures that his gaming character is \nvery different to the person he is. Participant 3 does the same thing, emphasising his \nview that it is psychologically important to do so. \nwell i'm trying to delineate a difference between the player and the character \nthey're playing as - my character, who is a female alien shaman, probably \nwouldn't torture. i haven't played cod [Call of Duty], so i don't know what the \ncharacter you play as there is like, but i will say that i personally make a \nconscious separation between myself and my character, as i believe most \nstable individuals do. (P3, L280) \n Participants 4 and 5 (the Sociolotron players), in their interviews, reflected on their \nreal world morality, stating that playing the game did not alter their morality in any \nway. \nI: would you say that playing this game has made you reconsider your sense \nof morality in the real world?  \nP5: not for me, I have my own real life code that I dont think will ever change. \nbut inside the game If im playing Jack the ripper..then its his morals that i use \n(P5, L287) \nParticipant 4 is the only participant to discuss how playing the game altered \nher ‘real self’. This was with regards to engaging in sexual activities with Sociolotron \nthat she had not previously experienced in the real world. \nP4: met someone fairly early on \nI: ok \nP4: hmmmm ... trying to word this \nI: right \nWhat I won’t do in pixels 27 \nP4: they showed me I had an interest in the same sex r\/l [real life] it wasn't \nsomething I had ever considered \nI: ok can you say more \nP4: I don't mean I met her or anything like that she was over in the US \nI: right ok \nP4: we just talked a lot about all sorts of different things \nI: and how did you feel? \nP4: we had sex together as characters \nI: right \nP4:well, it was quite a bombshell \nI: go on \nP4: but she was right \nI: so do you feel you found that out through the game? \nP4: yes \nI: go on \nP4: so it did change me r\/l [real life] well it is for me oops soory (P4, L560) \n \n4. Discussion \nThis study examined the psychological impact (and\/or the perceived \npsychological impact) of engaging in or witnessing STAs in MMORPGs. Using IPA \nas the methodology allowed for an intensive and detailed analysis of the gamers’ \naccounts. Gamers were highly reflective on how they experienced the game and how \nit impacted their everyday lives. Employing IPA also allowed us to gain insights into \nthe individuals’ experiences of gaming. As our analysis elucidates, not everyone \nexperienced playing MMORPGs in the same way. Some participants’ experiences \nWhat I won’t do in pixels 28 \nwere more positive than others and, importantly, our research demonstrates that there \nwas no clear agreement on which aspects of the game individuals could or believed \nthey would be able to cope with. \n Many of our participants felt they could easily separate gamespace from the \nreal world, and that playing the game provided them with some escape from ordinary \nlife. They discussed how liberating this felt for them, which is in line with previous \nwork that has argued that virtual worlds can be liberating for individuals (Whitty & \nCarr, 2006). Participants believed that the unrealistic look of the game (with respect to \ngraphics in the case of Sociolotron and the characters and virtual world of WoW) \nassisted them in separating the two spaces. This might be important for game \ndesigners to consider, especially given that games are beginning to appear more \nlifelike and gaming narratives are increasingly based on real world events (e.g., Call \nof Duty, Modern Warfare saga). Some of our participants did, however, believe they \nwould be able to separate the game from the real world even if the graphics were \nimproved, and so it might be worthwhile examining similar research questions \nproposed here with individuals who play games that more closely resemble the real \nworld. \n Previous theorists are unconvinced by the notion that individuals can easily \nseparate virtual reality and the real world (Turkle, 1995; Whitty, 2003; Whitty & \nCarr, 2006). They have insisted that individuals still import part of themselves into \nthis space. Moreover, they believe that engaging in play in these spaces provokes real \nemotional responses. We also found this in our study. Participants reported an array of \npositive and negative emotions. Of particular interest were the emotions of shame and \nanger. Participants 3 and 4 felt anger at the thought of witnessing rape in the game. \nThese same players talked about MMORPGs as just games, which they believed they \nWhat I won’t do in pixels 29 \ncould easily separate from real life. Participant 4 felt shame at the thought of family \nmembers learning about her playing Sociolotron: much the same, perhaps, as some \nmight feel about being caught out viewing pornography (Linton, 1979). \n In addition to the ‘real’ emotions reported by our participants, we found that \neven the participants who felt they could separate the real world and gamespace note \nsome important exceptions to this rule. Participant 2, for example, said he would \nengage in any STA within the game, because it is just a game; however, later he \ndiscussed how his game play is constrained because he is playing with children in the \ngame. Participant 3 discussed in detail how easily he could separate gamespace and \nthe real world, but when asked to consider enacting rape in gamespace he claimed he \ncould not because this would still feel real to him. In fact, he said the very idea of it \nwas abhorrent. \nAccording to Kreitman (2006), emotional responses to fiction are only able to \noccur, and are therefore only able to bridge the gulf between fictional and real worlds \nif the novel characteristics and constructs applied to works of fiction are derived from \nactual experience. Fiction presents us with an “unreal entity with real characteristics” \n(p. 616). The commitment we demand of fictional objects is not, therefore, existential \n(we do not require that they actual exist); rather, we seek authenticity. Real world \nauthenticity is measured by the number of attributes of a certain kind possessed by \nthe object of fiction (see Young, 2010 for further details). Consequently, for Powers \n(2003), what the gamer is communicating, even through the virtual nature of his\/her \naction, is “socially significant expression” (p. 193) that in the absence sanctioned \nequivalence (for example) may appear gratuitous. \nYoung and Whitty’s (in press) principle of ‘sanctioned equivalence’ therefore \nprovides some explanation for why certain aspects of the game were easier to separate \nWhat I won’t do in pixels 30 \nfrom the real world and real emotions. Their theory states that gamers should cope \nbetter with engaging in STAs that are deemed acceptable in the real world under \ncertain circumstances (e.g., killing the enemy at war). WoW is constructed in such a \nway as to create two opposing sides (good and evil), where gamers decide which side \nthey wish to belong to. This is quite similar, one might argue, to discourses about real \nwars and terrorism (e.g., Kellner, 2004) and how war is depicted in film. The \nparticipants in this study talked about acceptable STAs in the game, such as \ncannibalism (to restore the health of their character) and torture (when information \nwas required), which arguably under similar circumstances in the real world would be \nacceptable. When there were no clear real world sanctioned equivalence, participants \nwere more likely to have difficulty accepting activities in the game. This was \nespecially the case for rape. Yet, in the case of Sociolotron, those opposed to rape \nnevertheless accepted its permissibility within the gameplay. Participant 4, for \nexample, talked about how she initially coped well with rape in the game and still \nbelieves, in principle, that it should exist within the gameplay; but currently she feels \nthat it is something she finds difficult to cope with and watching it makes her angry. \nDespite her feelings, Participant 4 went on to state that she did not think any less of \nthose who engaged in rape in the game. Irrespective of personal opposition and \nunwillingness to engage in certain STAs, then, some players of Sociolotron (for \nexample) nevertheless accept that such activity is a legitimate part of the game. \nHowever, such reluctance to take part was not the case for all participants. Participant \n5 was very adamant about rape being something he felt very comfortable role-playing, \nand that it did not affect him outside of the game. \n The extent to which gamers identify with their character might also give some \ninsights into whether that individual can cope with engaging in STAs in the game. \nWhat I won’t do in pixels 31 \nParticipant 5 was adamant about his ability to separate real world moral codes from \nthe game as well as being nothing like his game character. Notably, he engaged in \nmore STAs than any of the other participants (this included activities that had no \nsanctioned equivalence). In contrast, Participant 3 stated that he separated his real self \nfrom his gaming character and that it was important psychologically to do so. \nNevertheless, we note, he still felt anger at the thought of engaging in symbolic rape \nin the game. And so, separation between one’s gaming character and real self are \npossibly not enough.  \nPreliminary research conducted on the design of avatars and behaviour in \nMMORPGs might give further explanation. Pena, Hancock and Merola (2009), have \nsuggested that in virtual settings white clothes should be chosen over black in order to \nincrease cohesion and red to increase competition. It is noteworthy that in the film \nAvatar the avatars who were characterised as a peaceful species were all blue. While \nour research did not delve into the look of the participants’ characters in the game, \nthese early findings suggest that the look and choice of an avatar could play a role in \nthe way an individual experiences MMORPGs. Perhaps it is not only the way the \ngame looks, but also the colour and appearance of the gamer’s avatar that alters an \nindividual’s experience. Future research on the experience of STAs in MMORPGs \nmight consider this possibility. \nWith regards to transferability, we found that one of our participants learnt \nsomething new about herself from engaging in certain sexual activities in Sociolotron \nthat she transferred to the real world; her discovery was learning that she is bisexual \n(an identity often stigmatised in Western society). Participant 4 described her new \nfound identity in a positive way and something she wanted to share with the \ninterviewer. Previously, it has been argued that cyberspace is potentially a safe space \nWhat I won’t do in pixels 32 \nto learn about and experience sexuality (Whitty, 2003, 2008). Perhaps engaging in \nthis sexual play in Sociolotron freed up this gamer to other ways of being typically \nshunned in the real world. While we do not rule out that some of the behaviours learnt \ncould be negative (e.g., aggression) our research found that positive aspects about \noneself can be learnt in MMORPGs and transferred into the real world. \n \n5. Conclusions \n There are of course a number of limitations to this study that we need to \nrecognise. The sample, we note, consisted of all hard core players. Homogeneous \nsamples are ideal for IPA (Smith, 2004); however, as a consequence, we are left \nwondering whether individuals who are less frequent or novice players have similar \nexperiences to our sample. More research is required to examine whether this is the \ncase. We are also limited by our focus on just two MMORPGs. Future research might \nconsider a range of MMORPGs, including games that focus on real historical events. \nWe have much yet to learn about how individuals cope with engaging in STAs \nin MMORPGs. Our research findings confirm that this is an important area of \nresearch to continue examining. Importantly, we found that not all individuals’ \nexperiences were the same. We recommend that future researchers also consider \nindividual differences. Understanding how individuals experience STAs provides \nimportant information for game designers and those bodies responsible for rating and \ncensoring games. Moreover, it is important for psychologists to learn more about how \nindividuals transfer their experience in MMORPGs to the real world and whether they \ncan psychologically cope with engaging in certain activities in MMORPGs. \n6. Acknowledgements \nThis study was funded by a Nuffield Foundation grant. \nWhat I won’t do in pixels 33 \n7. References \nAnderson, C. A., Berkowitz, L., Donnerstein, E., Huesmann, L. R., Johnson, J. D., \nLinz, D., Malamuth, N. M., & Wartella, E. (2003). The influence of media \nviolence on youth. Psychological Science in the Public Interest, 4 (3), 81-110. \nBrecher, B. (2007). Torture and the ticking bomb. Malden, MA.: Blackwell \nBuchman, D. D., & Funk, J. B. (1996). Video and computer games in the ‘90s: \nChildren’s time commitment and game preference. Child Today, 24, 12-16. \nDamasio, A.R. (1994). Descartes’ error: Emotion, reason, and the human brain. New \nYork: Avon. \nFitzgerald, D.A., Posse, S., Moore, G.J., Tancer, M.E., Nathan, P.J., & Phan, K.L. \n(2004). Neural correlates of internally generated disgust via autobiographical \nrecall: A functional magnetic resonance imaging investigation. Neuroscience \nLetters, 370, 91-96. \nFunk, J. B. (1993). Reevaluation of the impact of violent video games. Clinical \nPediatrics, 32, 86-90. \nIvory, J. D., & Kalyanaraman, S. (2007). The effects of technological advancement \nand violent content in video games on players' feelings of presence, \ninvolvement, physiological arousal, and aggression. Journal of \nCommunication, 57, 532-555. \nKellner, D. (2004). Media Propaganda and Spectacle in the War on Iraq: a Critique of \nU.S. Broadcasting Networks. Cultural Studies, 4, 329-338. \nKonijn, E.A. & Bushman, B.J. (2007). I wish I were a warrior: The role of wishful \nidentification on the effects of violent video games on aggression in \nadolescent boys. Developmental Psychology, 43 (4), 1038-1044. \nKreitman, N. (2006). Fantasy, Fiction, and Feelings. Metaphilosophy, 37(5), 605-622. \nWhat I won’t do in pixels 34 \nLinton, D. (1979). Why is pornography offensive? The Journal of Value Inquiry, 13 \n(1), 57-62. \nPeña, J., & Hancock, J. T., & Merola, N. A. (2009). The priming effects of avatars in \nvirtual settings. Communication Research, 36, 838-856. \nPolman, H., de Castro, B. O., & van Aken, M. A. G. (2008). Experimental study of \nthe differential effects of playing versus watching violent video games on \nchildren’s aggressive behavior. Aggressive Behavior, 34(3), 256-264. \nPowers, T.M. (2003). Real wrongs in virtual communities. Ethics in Information \nTechnology, 5, 191-198.Sherry, J. (2001). The effects of violent video games \non aggression: A meta-analysis. Human Communication Research, 27, 409-\n431  \nSherry, J. (2001). The effects of violent video games on aggression: A meta-analysis. \nHuman Communication Research, 27, 409-431. \nSmith (2004). Reflecting on the development of interpretative phenomenological \nanalysis and its contribution to qualitative research in psychology, Qualitative \nResearch in Psychology, 1(1), 39-54. \nSoldz, S. (2008). Healers and Interrogators: Psychology and the United States Torture \nRegime. Psychoanalytic Dialogues, 18, 592-613. \nSteiger, S., & Goritz, A. (2006). Using Instant Messaging for Internet-based \ninterviews. CyberPsychology & Behavior, 9 (5), 552-559. \nTurkle, S. (1995). Life on the screen: Identity in the age of the Internet. London: \nWeidenfeld & Nicolson. \nWhitty, M. T. (2003). Cyber-flirting: Playing at love on the Internet. Theory and \nPsychology, 13 (3), 339-357. \nWhat I won’t do in pixels 35 \nWhitty, M. T. (2008). Liberating or debilitating? An examination of romantic \nrelationships, sexual relationships and friendships on the Net. Computers in \nHuman Behavior, 24, 1837-1850. \nWhitty, M. T. & Carr, A. N. (2006). Cyberspace romance: The psychology of online \nrelationships. Basingstoke: Palgrave Macmillan. \nWilliams, D., & Skoric, M. (2005). Internet fantasy violence: A test of aggression in \nan online game. Communication Monographs, 72 (2), 217-233. \nWilliams, D., Yee., N., & Caplan, S. E. (2008). Who plays, how much, and why? \nDebunking the stereotypical gamer profile. Journal of Computer-Mediated \nCommunication, 13 (4), 993-1018. \nYee, N. (2006). The demographics, motivations and derived experiences of users of \nmassively-multiuser online graphical environments. PRESENCE: \nTeleoperators and Virtual Environments, 15, 309-329. \n Young, G. (2010). Virtually Real Emotions and the Paradox of Fiction: Implications \nfor the use of virtual environments in psychological research. Philosophical \nPsychology, 23(1), 1-21. \nYoung, G., & Whitty, M T. (in press). Should gamespace be a taboo-free zone? Moral \nand psychological implications for single-player video games. Theory & \nPsychology. \nYoung, G., & Whitty, M. T, (2010). Games without frontiers: On the moral and \npsychological implications of violating taboos within multi-player virtual \nspaces. Computers in Human Behavior, 26, 1228-1236. \n \n"}