{"doi":"10.1086\/367971","coreId":"65995","oai":"oai:dro.dur.ac.uk.OAI2:3768","identifiers":["oai:dro.dur.ac.uk.OAI2:3768","10.1086\/367971"],"title":"The mesolithic and neolithic subsistence in Denmark : new stable isotope data.","authors":["Richards,  M. P.","Price,  T. D.","Koch,  E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-04-01","abstract":"The change in subsistence at the Mesolithic\/Neolithic transition in Denmark is often characterized as rapid, with a dramatic shift from a marine diet in the Mesolithic to a terrestrial-based diet in the Neolithic. This view has been largely based on the work of Tauber (1981), who observed this dietary shift in stable carbon isotope values for human bone from various coastal sites. Crucial to Tauber's argument are the radiocarbon dates he obtained for each of the isotope samples, for the ages are used to categorize samples as Mesolithic or Neolithic. In this reassessment of his pioneering work, we report on new carbon and nitrogen stable isotope values and radiocarbon dates for Danish Mesolithic and Neolithic humans, including some obtained by remeasuring a number of Tauber's samples. We first briefly describe the Late Mesolithic and Early Neolithic in Denmark and the major characteristics of the transition. We next consider the work by Tauber that has been seminal in studies of the transition. In subsequent sections we present new radiocarbon dates and stable isotope measurements from human skeletal material from the Mesolithic and Neolithic. The concluding discussion summarizes our results and emphasizes the need for more analyses of radio- and stable isotopes from this important transition period","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65995.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3768\/1\/3768.pdf","pdfHashValue":"ecaf4fedc6dd31fef13ff6f30ffe4b7eae1e854b","publisher":"University of Chicago Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:3768<\/identifier><datestamp>\n      2011-08-31T08:14:13Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The mesolithic and neolithic subsistence in Denmark : new stable isotope data.<\/dc:title><dc:creator>\n        Richards,  M. P.<\/dc:creator><dc:creator>\n        Price,  T. D.<\/dc:creator><dc:creator>\n        Koch,  E.<\/dc:creator><dc:description>\n        The change in subsistence at the Mesolithic\/Neolithic transition in Denmark is often characterized as rapid, with a dramatic shift from a marine diet in the Mesolithic to a terrestrial-based diet in the Neolithic. This view has been largely based on the work of Tauber (1981), who observed this dietary shift in stable carbon isotope values for human bone from various coastal sites. Crucial to Tauber's argument are the radiocarbon dates he obtained for each of the isotope samples, for the ages are used to categorize samples as Mesolithic or Neolithic. In this reassessment of his pioneering work, we report on new carbon and nitrogen stable isotope values and radiocarbon dates for Danish Mesolithic and Neolithic humans, including some obtained by remeasuring a number of Tauber's samples. We first briefly describe the Late Mesolithic and Early Neolithic in Denmark and the major characteristics of the transition. We next consider the work by Tauber that has been seminal in studies of the transition. In subsequent sections we present new radiocarbon dates and stable isotope measurements from human skeletal material from the Mesolithic and Neolithic. The concluding discussion summarizes our results and emphasizes the need for more analyses of radio- and stable isotopes from this important transition period. <\/dc:description><dc:publisher>\n        University of Chicago Press<\/dc:publisher><dc:source>\n        Current anthropology, 2003, Vol.44(2), pp.288-294 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2003-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3768<\/dc:identifier><dc:identifier>\n        issn:0011-3204<\/dc:identifier><dc:identifier>\n        issn: 1537-5382<\/dc:identifier><dc:identifier>\n        doi:10.1086\/367971<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3768\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1086\/367971<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3768\/1\/3768.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1537-5382","issn:0011-3204"," 1537-5382","0011-3204"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n26 June 2008\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nRichards, M. P. and Price, T. D. and Koch, E. (2003) ’The mesolithic and neolithic subsistence in Denmark :\nnew stable isotope data.’, Current anthropology., 44 (2). pp. 288-294.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1086\/367971\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n26 June 2008\nVersion of attached file:\nPublished\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nRichards, M. P. and Price, T. D. and Koch, E. (2003) 'The mesolithic and neolithic\nsubsistence in Denmark : new stable isotope data.', Current anthropology., 44 (2),\npp. 288-294.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1086\/367971\nPublisher’s copyright statement:\n288\nReports\nMesolithic and Neolithic\nSubsistence in Denmark: New\nStable Isotope Data\nmichael p . r ichards , t . douglas price , and\neva koch\nDepartment of Archaeological Sciences, University of\nBradford, Bradford, West Yorkshire, U.K. BD7 1DP\n(m.p.Richards@bradford.ac.uk)\/Department of\nAnthropology, University of Wisconsin–Madison, 5240\nSocial Science Building, 1180 Observatory Drive,\nMadison, Wis. 53706, U.S.A.\/Nationalmuseet,\nFrederiksholms Kanal 12, DK-1220 København K,\nDenmark. 4 iv 02\nThe change in subsistence at the Mesolithic\/Neolithic\ntransition in Denmark is often characterized as rapid,\nwith a dramatic shift from a marine diet in the Meso-\nlithic to a terrestrial-based diet in the Neolithic. This\nview has been largely based on the work of Tauber (1981),\nwho observed this dietary shift in stable carbon isotope\nvalues for human bone from various coastal sites. Cru-\ncial to Tauber’s argument are the radiocarbon dates he\nobtained for each of the isotope samples, for the ages are\nused to categorize samples as Mesolithic or Neolithic.\nIn this reassessment of his pioneering work, we report\non new carbon and nitrogen stable isotope values and\nradiocarbon dates for Danish Mesolithic and Neolithic\nhumans, including some obtained by remeasuring a\nnumber of Tauber’s samples. We first briefly describe the\nLate Mesolithic and Early Neolithic in Denmark and the\nmajor characteristics of the transition. We next consider\nthe work by Tauber that has been seminal in studies of\nthe transition. In subsequent sections we present new\nradiocarbon dates and stable isotope measurements from\nhuman skeletal material from the Mesolithic and Neo-\nlithic. The concluding discussion summarizes our re-\nsults and emphasizes the need for more analyses of radio-\nand stable isotopes from this important transition period.\nthe mesolithic-neolithic transition in\ndenmark\nThe Mesolithic and Neolithic archaeological record in\nDenmark is exceptional in Western Europe. It has rich\nartifactual evidence from both periods and provides us\nwith some of the best material data for exploring the\n\u0001 2003 by The Wenner-Gren Foundation for Anthropological Re-\nsearch. All rights reserved011-3204\/2003\/4402-0006$1.00\nprocess of change that occurred at the Mesolithic\/Neo-\nlithic transition.\nThe Late Mesolithic Ertebølle culture is found in\nnorthern Germany, Denmark, and extreme southwest-\nern Sweden between approximately 5400 and 3900 cal\nb.c. (Larsson 1990, Price 1991). The Ertebølle is char-\nacterized by both flaked and ground stone assemblages.\nAn elaborate blade technology, projectile points, and\nflake and core axes are typical, and ground stone artifacts\ninclude axes, celts, and other tools. A wide range of fish-\ning gear, including nets, weirs, leisters, hooks, and har-\npoons, is known from this period. Ceramic containers\ncame into use after 4700 cal b.c. in several forms. This\npottery and other distinctive artifact types such as T-\nshaped antler axes, bone rings, and Danubian shaft-hole\nadzes document the exchange of both ideas and materials\nbetween Scandinavian hunter-gatherers and the farmers\nof Central Europe 100 km or so to the south (Fischer\n1981, Zvelebil and Rowley-Conwy 1984).\nThe primary focus of settlement in the Ertebølle was\nalong the coast, where hunter-gatherers used boats and\npaddles, erected large fishing weirs, and successfully ex-\nploited the rich resources of both the sea and the land.\nFish, fowl, mollusks, crustaceans, and sea mammals\nwere all prey for them, and a wide range of fish from\nboth marine and freshwater habitats was taken with a\nvariety of equipment (see, e.g., Enghoff 1994). Large shell\nmiddens along some coasts document the incorporation\nof shellfish into Mesolithic diets. Terrestrial resources\nwere also varied and abundant. Red deer, wild pig, and\nroe deer were the primary terrestrial animals of eco-\nnomic importance. Other animals were also hunted and\ntrapped, including a variety of small fur-bearing species:\nmarten, otter, wolf, wildcat, and squirrel. Plant foods also\ncontributed substantially to the diet. Enormous quan-\ntities of hazelnut shells are found at many Mesolithic\nsites, along with the remains of acorns, water chestnuts,\nand nettles, and fruits such as wild strawberry, apple,\nand sloe, hawthorn, rowan berries, and raspberries (Price\n1989, Regnell 1995, Zvelebil 1995). A recent study of the\nplant remains from Tybrind Vig, dating to 5600–4000 cal\nb.c., indicates the variety of plants, including aquatic\nspecies, used by Mesolithic peoples (Kubiak-Martens\n1999).\nEvidence is often present at coastal sites for summer,\nautumn, and winter residence, making year-round oc-\ncupation likely. The picture is one of large settlements\nextending 200–300 m along the coast (Andersen 1991,\nPrice et al. 2001). House structures are rare (cf. Sørensen\n1995), but cemeteries are an important hallmark of later\nMesolithic settlements (e.g., Albrethsen and Pedersen\n1977; Larsson 1984, 1989). Numerous examples of\ntrauma and violent death among Mesolithic burials sug-\ngest conflict, perhaps a result of intergroup raiding.\nVolume 44, Number 2, April 2003 F 289\nThe Early Neolithic in Denmark, known as the Funnel\nBeaker culture (TRB), is conventionally dated between\n3900 and 3300 cal b.c. Funnel Beaker pottery and pol-\nished flint axes are its hallmarks. Cereal cultivation and\nanimal husbandry were practiced, with domesticated\nplants including emmer and einkorn wheat and naked\nand hulled barley (Koch 1998) and domesticated cattle,\npig, sheep, and dog. The oldest reliable published radi-\nocarbon date for a domestic animal other than the dog\ncomes from a cow bone at the site of Øga˚rde in the Store\nA˚mose, Zealand, ca. 3850 cal b.c. (Koch 1998, Persson\n1999).\nEvidence for the Danish Early Neolithic comes from\nsettlements, long barrows with timber burial chambers,\nbog site offerings, and flint mines. The number of initial\nNeolithic settlement sites is limited; both residential\nsites and hunting stations are known, often on top of\ncoastal Ertebølle sites. In general, however, Early Neo-\nlithic sites are situated in the interior, on lakes or\nstreams where fresh water was easy obtainable and con-\nditions for cattle grazing were favorable (Madsen and Jen-\nsen 1982). Residential sites are small and have thin cul-\ntural layers compared with Late Mesolithic settlements,\nsuggesting that coresident groups in the Neolithic were\nsmaller or perhaps more mobile (e.g., Andersen 1993).\nThis change may represent reduced numbers of people\nor perhaps changes in settlement associated with cattle\npastoralism.\nEvidence for substantial forest clearance or extensive\ncultivation is lacking before 3300 b.c. (Andersen and\nRasmussen 1993). The basic pattern of subsistence in-\nvolved terrestrial hunting and gathering, seal hunting,\nfishing, cereal cultivation, cattle breeding, and pig herd-\ning. Cattle were the most common livestock and in-\ncreased in number in the course of the Funnel Beaker\nperiod, representing more than 80% of the domestic an-\nimals at some younger sites.\nThe transition from the Mesolithic to the Neolithic is\na fascinating process. There is evidence for both change\nand continuity and for both rapid and slow transforma-\ntion. The evidence for change takes the form of new\nartifacts (TRB pottery, polished flint axes), new types of\ngraves (earthen long barrows), more inland settlements,\nexotic domestic plants and animals, and an emphasis on\nterrestrial foodstuffs. At the same time, continuity can\nbe observed in the basic lithic industry, utilitarian pot-\ntery, and occupation of the same coastal localities. The\noverwhelming impression is one of the addition of new\nfeatures to an existing cultural system. Because of the\nevidence for continuity, the transition is generally\nthought to represent the indigenous adoption of agri-\nculture rather than colonization by foreigners (Koch\n1998, Nielsen 1987, Price 2000b).\nThe rate of the transition can be understood as either\nslow or rapid. On the one hand, there were probably\nNeolithic groups at the mouth of the Oder, no more than\n100 km distant, by 4500 b.c.; Mesolithic societies along\nthe coast of the Baltic and the North Sea resisted the\nspread of the Neolithic for almost 1,500 years. Although\nthere was some exchange of raw materials and finished\nproducts, the boundary between Mesolithic and Neo-\nlithic prevented the spread of domesticates and certain\nNeolithic features. On the other hand, once the barrier\nwas raised, the Neolithic moved across northern Ger-\nmany and southern Scandinavia like wildfire. Funnel\nBeaker ceramics are first found on the coast of Meck-\nlenburg after 4100 b.c. and by 3900 b.c. in the Stockholm\narea of east-central Sweden, more than 700 km away\n(Hallgren et al. 1998, Lu¨bke 2001, Price 2000b). Such\nrapid rates for the transition are generally thought to\nreflect demic diffusion associated with the Neolithic\nCardial or Linearbandkeramik expansion in Europe\n(Price 2000a).\nThe shift from coastal to terrestrial resources docu-\nmented by Tauber is an important component of most\nexplanations of the transition. Some argue for resource\nstress, particularly declines in marine productivity as-\nsociated with the climate changes of this period (Rowley-\nConwy 1984, Larsson 1990). Others emphasize the shift\nto inland settlement as reflecting resource stress or in-\ncoming populations (Madsen 1985, Nielsen 1987). Fi-\nscher (1981), Jennbert (1985), and Price (1996) consider\ncompetition and prestige models responsible for the tran-\nsition, and still others, such as Whittle (1996), see the\nadoption as somehow motivated by spiritual or religious\nchanges in society. It is difficult to overestimate the im-\nportance of the coastal-terrestrial shift in diet described\nby Tauber in discussions of the transition from hunting\nto farming in the Stone Age of Scandinavia. The em-\nphasis on a rapid change in diet and a concomitant shift\nfrom coastal to inland settlement has been particularly\npronounced since Tauber’s 1981 publication.\ntauber’s isotope data\nTauber’s study, the first application of stable isotope\nanalysis of prehistoric human skeletal material in Eu-\nrope, was remarkably sophisticated for its time. Tauber\nmeasured the stable carbon isotope (d13C) values of ra-\ndiocarbon-dated humans from the Mesolithic, Neolithic,\nand younger contexts in Denmark and found that the\nMesolithic humans from coastal sites had strongly ma-\nrine d13C values (approaching \u000112‰) that contrasted\nwith the terrestrial d13C values (ca. \u000120‰) of humans in\nthe subsequent Neolithic period and indeed all of the\nlater time periods he examined. When he expanded this\ninitial study to include more Mesolithic and Neolithic\nsamples (Tauber 1983, 1986), he found the same pattern.\nHe concluded that there was a dramatic change in diet\nwith the introduction of the Neolithic into Denmark.\nWe have replotted the data from Tauber (1983) in figure\n1.\nThe apparent rapid change in diet at the Mesolithic\/\nNeolithic transition may be misleading, as the data have\nnot been corrected for the marine-reservoir effect. The\ndifferences in radiocarbon ages between organisms that\nderive their carbon from the ocean and those that derive\nit from the atmosphere are well known (Stuiver and Bra-\nziunus 1993). There is, on average, a difference of 400\nradiocarbon years between similar-aged samples that de-\n290 F current anthropology\nFig. 1. Radiocarbon ages and associated d13C values of humans from Mesolithic and Neolithic contexts in\nDenmark, taken from Tauber (1983). The radiocarbon ages have been converted from calibrated ages b.c. (origi-\nnally calibrated by Tauber using the Clark [1975] calibration curve) to uncalibrated radiocarbon years b.p.\nrive their carbon from these two different reservoirs.\nTherefore, if the marine d13C values of the Ertebølle hu-\nmans are reflecting a marine diet and the carbon in that\ncollagen comes mostly from the marine reservoir, the\nradiocarbon ages for late Ertebølle humans may be too\nold by 200–400 years. Applying this correction to the\nlatest Ertebølle humans makes them contemporary with\nthe earliest Neolithic humans. Assuming the validity of\nthis correction here, the latest Ertebølle and the earliest\nTRB actually overlapped.\nHowever, correcting Tauber’s radiocarbon dates for the\nmarine-reservoir effect is not necessarily valid, because\nthose dates are not conventional radiocarbon dates. By\nconvention the d13C of all radiocarbon samples has to be\nmeasured to account for 14C fractionation and corrected\nto a standardized average of \u000125‰ (Stuiver and Polach\n1977). A d13C difference of 1‰ between the sample and\nthe average subtracts about 16 radiocarbon years from\nthe date. Marine shells have a d13C of 0‰ and therefore\nhave to be corrected by 25 # 16p 400 years. Therefore,\n400 radiocarbon years have to be subtracted from the raw\nradiocarbon age to make it a conventional radiocarbon\nage. But Tauber (1983) argues that the marine-reservoir\neffect in northern Europe is 400 years and that there is\nno need to subtract 400 radiocarbon years from the age\nof the shell sample when it has to be added on again to\naccount for the marine-reservoir effect. Therefore,\nTauber does not correct marine samples for fractionation\nto \u000125‰ before reporting them. We interpret this as\nmeaning that he did the same with his bone dates when\nthey had d13C values of \u000112‰ (indicating a marine diet)\nand did not adjust them to the internationally accepted\nvalue of \u000125‰. Therefore, it is impossible to apply a\nmarine calibration to the dates because they are not con-\nventional radiocarbon ages and are probably close to the\nvalue they should be if they had been corrected for the\nmarine effect.\nTo further illustrate this point, we focus now on two\nof the most interesting samples, the latest Mesolithic\nand earliest Neolithic dates from the site of Dragsholm.\nThese burials are only two metres apart, and one is a\nmale and the other two females. Two of the burials have\nbeen dated (Brinch Peterson 1974). The earlier, female\nburial has a d13C value indicating a marine diet and is\nburied with Mesolithic artifacts, and the later, male bur-\nial has a d13C value indicating a terrestrial-protein diet\nand is buried with Neolithic artifacts. If the female date\nis marine-corrected (Stuiver and Braziunus 1993) and the\nmale calibrated using the atmosphere curve (Stuiver et\nal. 1998), the calibrated ages overlap, but this would be\nremarkable in that the two individuals have very differ-\nent subsistence practices and material culture. If, how-\never, we correct the date of the female burial to make it\na conventional radiocarbon age and then apply the ma-\nrine correction, it is unlikely that the burials overlap,\nand the female burial is older than the male (table 1).\nUnfortunately, the original raw radiocarbon and iso-\ntope data for the Mesolithic and Neolithic humans\n(Tauber 1981, 1983, 1986) have never been published. We\nhave suggested some possibilities for correcting and re-\ninterpreting the dates, but without access to the original\ndata it is impossible to do this accurately and confi-\nVolume 44, Number 2, April 2003 F 291\ntable 1\nDragsholm Radiocarbon Dates and d13C Values\nSample Age\/Sex d13C 14C Age b.p. Calibrated b.c. Corrected to \u000125‰ b.p. Recalibrated b.c.\nK-2224 Adult female \u000111.5 5,160 \u0002 100 3960–3460 (marine\ncurve)a\n5,375 \u0002 100 3910–3690\nK-2291 Adult male \u000121.5 4,840 \u0002 100 3730–3510 (atmo-\nspheric curve)b\nn.a. n.a.\naStuiver and Braziunus (1993).\nbStuiver et al. (91998).\ndently. Therefore, for the remainder of this paper we will\nfocus on dates that we know conform to the current\nconventions for reporting radiocarbon dates.\nnew 14c data\nSince Tauber’s time a significant number of new radio-\ncarbon dates for Mesolithic and Neolithic humans in\nDenmark has become available, and as part of the ra-\ndiocarbon dating process d13C values for bone collagen\nhave also been measured. We have plotted these new data\nin figure 2. With these data the change in subsistence at\nthe Mesolithic\/Neolithic transition that Tauber reported\nis still apparent, but it is shifted farther back in time,\ncoinciding better with the dates for the first appearance\nof TRB material culture in this region. Interestingly,\nthese shifted values are almost identical to the dates for\nthe earliest Neolithic of Britain and Ireland (Williams\n1989). The data also indicate an interesting increase in\nthe proportion of marine foods in Mesolithic diets over\ntime.\nd13c and d15n values\nSince Tauber’s pioneering work it has become easier to\nmeasure the stable nitrogen isotope (d15N) value of bone\ncollagen along with the d13C value. Both of these collagen\nisotopes tell us about the protein portion of lifetime (ap-\nproximately ten years prior to death) diets (Ambrose and\nNorr 1993). Whereas the d13C value indicates whether\nthe dietary protein was from marine or terrestrial sources\n(Chisholm, Nelson and Schwarcz 1982), the d15N value\nindicates the trophic level of the protein consumed, col-\nlagen d15N values in humans being 2–4‰ higher than the\nd15N value of dietary protein (Schoeninger and DeNiro\n1984). We report the carbon and nitrogen isotope values\nfor a number of Danish Mesolithic and Neolithic indi-\nviduals in table 2 and fig. 3. The individual from Tybrind\nVig and two samples from Vedbæk (graves 3 and 5) were\nmeasured by Tauber in the early 1980s.\nMost of the samples were prepared following standard\ncollagen preparation procedures (Richards and Hedges\n1999). In short, whole bone samples were demineralized\nin 0.5M HCl at 5\u0003C for 2–5 days. The samples were then\ngelatinized for 48 hours at 75\u0003C in sealed tubes, and the\nresultant gelatin was filtered and then lyophilized before\ncombustion. The Aldersro samples were also ultrafil-\ntered (30 kd) before lyophilization (Brown, Nelson, and\nSouthon 1988). Isotope measurements for most of the\nsamples were undertaken at the University of Oxford;\ntwo of the Vedbæk (graves 5 and 8) samples were mea-\nsured at Simon Fraser University.\nmesolithic stable isotope values\nTauber (1983) reported a d13C value of \u000116‰ for Tybrind\nVig, which dates to ca. 6,750\u000280 b.p. (K-3558) (Andersen\n1987). Our measurement of the d13C value was \u000117.6‰,\nindicating less marine protein in the diet. The associated\nd15N value is low, 8.5‰, supporting the idea that terres-\ntrial foods were the dominant protein sources in this\nindividual’s diet. Tauber obtained three d13C values for\nVedbæk, \u000113‰, \u000114.5‰, and \u000115.5‰, similar to the\nvalues we found. Our d15N values range from about 12‰\nto 14‰. Comparing these d15N values with those of ma-\nrine fauna suggests that shellfish or smaller fish were\nlikely the staple protein source of individuals with d15N\nvalues of about 12‰, with the addition of some larger\nfish for the individuals with d15N values closer to 14‰\n(Richards and Hedges 1999). The d15N values are too low\nto indicate that larger fish or marine mammals were the\ndominant protein sources. In contrast, similar-aged Mes-\nolithic humans from Scotland and Brittany had d15N val-\nues of about 15–16‰ (Richards and Mellars 1998, Schult-\ning and Richards 2001), probably indicating the\nconsumption of fish rather than higher-trophic-level ma-\nrine mammals or shellfish.\nneolithic stable isotope values\nThe Neolithic samples are from various bog bodies in\nthe Store A˚mose region of central Zealand (Koch 1998)\nand from the megalithic tomb of Aldersro (see Richards\nand Koch n.d. for discussion). The d13C values for all of\nthe Neolithic individuals clearly indicate an absence of\nsignificant amounts of marine protein in their diets. The\nd15N values are fairly high, indicating a probable diet of\nmainly animal protein, either meat or milk. It is unlikely\nthat freshwater fish were consumed in any significant\nquantities by these individuals, as significant consump-\ntion of freshwater fish leads to human d15N values of\ngreater than 12‰ (Bonsall et al. 1997). Two of the samples\nwere from juveniles, and because weaning and growth\nhave physiological effects on juvenile d15N values (Her-\nring, Saunders, and Katzenberg 1998) we do not attempt\nto interpret the results on them here.\n292 F current anthropology\nFig. 2. Radiocarbon ages and associated d13C values of humans from Mesolithic and Neolithic contexts in\nDenmark, taken mainly from Persson (1999) and excluding all of the data from Tauber (1981, 1983, 1986).\ndiscussion\nThe new radiocarbon and d13C values presented here con-\nfirm Tauber’s findings indicating a dramatic change in\ndiet associated with the introduction of Neolithic ma-\nterial culture into Denmark. However, measurements of\nboth the d13C and d15N values for Mesolithic and Neo-\nlithic humans show that there is no distinct Mesolithic\ndiet. The Mesolithic isotope data indicate a complex\nrange of diets, with some individuals, despite being bur-\nied in middens, having partially terrestrial-protein-based\ndiets. The later Neolithic diets, in contrast, are remark-\nably uniform, indicating the avoidance of marine in favor\nof terrestrial protein. We cannot tell, using isotopes,\nwhether the terrestrial protein is from the domesticated\nplants and animals that appear in Denmark in this pe-\nriod, but we believe that this is a reasonable assumption.\nThe Danish stable isotope evidence presented by\nTauber was a model study, and others have attempted\nto see if the same pattern of a relatively rapid change in\ndiet occurred in other areas of Europe at the Mesolithic\/\nNeolithic transition. Lubell et al. (1994) compared in-\ndividuals from midden sites that were estuarine, not\nclearly marine, with Neolithic burials from caves in Por-\ntugal, and their data show generally that Mesolithic diets\nhad a strong marine component and that by the middle\nNeolithic there was a significant shift to mainly terres-\ntrial foods. Recent stable isotope work in Brittany has\nshown that Mesolithic diets were largely marine-based\n(Schulting and Richards 2001). In the United Kingdom\nthe scarcity of Mesolithic human remains is a problem,\nbut a few studies do show the importance of marine foods\nin the diets of Late Mesolithic coastal peoples from the\nsite of Oronsay (Richards and Mellars 1998). There is\nnow, however, a substantial amount of isotope data on\nEarly and Middle Neolithic humans indicating a com-\npletely terrestrial diet (Richards and Hedges 1999). In\nsouth-eastern and eastern interior Europe there is stable\nisotope evidence of an aquatic-based diet (likely fresh-\nwater fish) along the Danube (Bonsall et al. 1997) and\nthe Dneiper (Lillie and Richards 2000) that continued to\nbe important in Neolithic times. Generally, Denmark\nhas the best stable isotope data in northern Europe for\nthe Mesolithic and Neolithic periods, and these data in-\ndicate a clear dietary transition which is echoed in the\nBreton and U.K. data. Earlier sites in southern and east-\nern Europe do not show such a transition. Stable isotope\nanalysis in Europe is in its infancy, however, and new\nisotope data are being produced all the time that may\nlead to a clearer picture of dietary changes across the\nMesolithic\/Neolithic transition throughout Europe.\nconclusions\nDenmark presents us with an excellent data set with\nwhich to explore the Mesolithic\/Neolithic transition in\nEurope. Stable isotope measurements of human bone by\nTauber in the 1980s indicated the Mesolithic diets were\nmainly marine-based and Neolithic diets terrestrial-\nbased. He saw a rapid change in diets associated with\nthe introduction of the Neolithic. His data have never\nbeen published comprehensively, and there are questions\nabout how he arrived at the calibrated ages he reports.\nSpecifically, it is largely unclear from his data that he\nhas taken marine-reservoir effects into account. New\nd13C data associated with radiocarbon dates taken from\nVolume 44, Number 2, April 2003 F 293\ntable 2\nCarbon and Nitrogen Isotope Values for Mesolithic and Early Neolithic Human Bone from Denmark\nSample Site Age\/Sex Age 14C Age b.p. 14C No. 14C d13C d13C d15N CN %C %N %Yield\nCE7 Tybrind Vig Adult F E-Ert 6,750 \u0002 80 K-3558 \u000115.7 \u000117.6 8.5 3.7 27.7 8.8 1.7\nGrave 3 Vedbæk Adult F L-Ert 6,050 \u0002 750 K-2781 \u000115.3 \u000113.6 11.3 3.0 36.1 13.9 5.2\nGrave 4 Vedbæk Adult M L-Ert — — \u000113.4 13.8 3.1 31.3 11.8 4.9\nGrave 5 Vedbæk Adult M L-Ert 6,290 \u0002 75 K-2782 \u000113.4 \u000116.5 11.9 3.2 32.9 12.2 6.5\nGrave 8 Vedbæk Adult F L-Ert — — \u000114.7 10.6 3.0 35.2 13.4 —\nGrave 9 Vedbæk Adult M L-Ert — — \u000113.6 13.0 3.1 34.6 13.1 2.0\nDK-2 Ostrup, Store A˚mose Adult F TRB 4,510 K-5142 \u000119.6 9.9 3.2 43.5 16.0 6.8\nDK-3 Ostrup, Store A˚mose Adult M TRB 4,530 \u0002 90 K-5741 \u000120.7 \u000120.0 10.0 3.3 46.5 16.2 12.5\nDK-4 Undlose, Store A˚mose Adult F TRB 4,760 \u0002 95 K-6300 \u000120.2 \u000120.3 8.2 3.3 44.3 15.8 15.1\nDK-5 Bodal, Store A˚mose Adult M TRB 5,025 \u0002 40 AAR-5360 \u000120.8 \u000120.7 8.0 3.2 43.1 15.6 6.7\nARX-516 Aldersro Adult F TRB 4,010 \u0002 50 AAR-6544 \u000120.6 \u000120.7 7.5 3.2 43.4 15.8 6.7\nARX-528 Aldersro Adult F TRB 4,410 \u0002 55 AAR-6545 \u000119.5 \u000119.4 8.0 3.2 43.0 15.6 6.9\nARX-537 Aldersro Adult M TRB 4,190 \u0002 60 AAR-6546 \u000119.6 \u000119.8 8.0 3.3 42.0 15.1 3.2\nARX-553 Aldersro Child (3–5) TRB — — \u000119.9 8.8 3.2 42.8 15.7 5.9\nARX-572 Aldersro Child (5–7) TRB 4,060 \u0002 45 AAR-6547 \u000120.2 \u000120.2 6.3 3.2 44.9 16.3 9.8\nARX-987 Aldersro Adult TRB 4,410 \u0002 55 AAR-6548 \u000119.6 \u000119.6 9.3 3.3 40.5 14.4 6.5\nARX-1115 Aldersro Adult TRB 4,420 \u0002 60 AAR-6549 \u000119.7 — — — — — 0.3\nARX-1191 Aldersro Adult TRB 4,100 \u0002 50 AAR-6551 \u000119.9 \u000120.0 8.7 3.2 45.1 16.7 9.4\nARX-1184 Aldersro Adult TRB 4,350 \u0002 50 AAR-6550 \u000119.2 \u000119.2 9.0 3.2 45.1 16.4 5.2\nnote: Errors (1j) are \u0002 0.3‰ for the d13C values and \u0002 0.4‰ for the d15N values. E-Ert, early Ertebølle; L-Ert, Late Ertebølle; M,\nMesolithic; TRB, Funnel Beaker. The Tybrind Vig date and two Vedbæk dates (graves 3 and 5) are from Tauber (1983) and therefore\nmay not be conventional radiocarbon ages. The Store A˚mose dates are taken from Koch (1998) and the Aldersro dates from Richards\nand Koch (n.d.). The Vedbæk grave 5 isotope results are the average of two measurements made at Oxford (d13C p \u000116.35, d15N p\n12.09) and at Simon Fraser University (d13C p \u000116.55, d15N p 11.78). The grave 8 isotope measurement was made at Simon Fraser\nUniversity. The 14C d13C values were determined by the radiocarbon labs when the dates were measured.\nthe literature support Tauber’s findings but push back\nthe age of the transition to about 5,200 b.p. (4000 cal\nb.c.), where Tauber’s dates put it at closer to 5,000 b.p.\n(3800 cal b.c.). New d13C and d15N data for a number of\nthe samples Tauber measured as well as new samples\nalso show a difference between Mesolithic and Neolithic\ndiets, although the numbers are small. However, the new\ndata also show that Mesolithic diets were more complex\nthan previously recognized, with some individuals in the\nMesolithic having largely terrestrial diets.\nReferences Cited\na l b r e t h s e n , s . e . , a n d e . b r i n c h p e t e r s e n . 1977. Ex-\ncavation of a Mesolithic cemetery at Vedbæk, Denmark.\nAmerican Antiquity 47:1–28.\na m b ro s e , s . h . , a n d l . n o r r . 1993. “Experimental evi-\ndence for the relationship of the carbon isotope ratios of whole\ndiet and dietary protein to those of bone collagen and carbon-\nate,” in Prehistoric human bone: Archaeology at the molecu-\nlar level. Edited by Joseph B. Lambert and Gisela Grupe, pp.\n1–37. Munich: Springer-Verlag.\na n d e r s e n , s . h . 1987. “Tybrind Vig: A submerged Ertebølle\nsettlement settlement in Denmark,” in European wetlands in\nprehistory. Edited by J. M. Coles and J. L. Lawson. Oxford: Ox-\nford University Press.\n———. 1991. Bjørnsholm, a stratified køkkenmødding on the\ncentral Limfjord, North Jutland. Journal of Danish Archaeology\n10:59–96.\n———. 1993. “Mesolithic coastal settlement,” in Digging into\nthe past. Edited by S. Hvass and B. Storgaard, pp. 65–69. Aar-\nhus: Aarhus Universitetsforlag.\na n d e r s e n , s . t . , a n d p . r a s m u s s e n . 1993. Geobotanishe\nundersøgelse af Kulturlandskabet Histories. Copenhagen:\nDGU, Miljøministeret.\nb o n s a l l , c . , r . l e n n o n , k . m c s w e e n e y, c . s t e -\nw a r t , d . h a r k n e s s , v. b o ro n e a n t , v. b a r t o s i e w -\ni c z , r . p a y t o n , a n d j . c h a p m a n . 1997. Mesolithic and\nearly Neolithic in the Iron Gates: A palaeodietary perspective.\nJournal of European Archaeology 5:50–92.\nb r i n c h p e t e r s e n , e . 1974. Gravene ved Dragsholm: Fra\njægere till bønder for 6000 a˚r siden. Nationalmuseets Arbejds-\nmark, pp.112–20.\nb ro w n , t . a . , d . e . n e l s o n , a n d j . r . s o u t h o n . 1988.\nImproved collagen extraction by modified Longin method. Ra-\ndiocarbon 30:171–77.\nc h i s h o l m , b . s . , d . e . n e l s o n , a n d h . p . s c h w a r c z .\n1982. Stable carbon ratios as a measure of marine versus ter-\nrestrial protein in ancient diets. Science 216:1131–32.\nc l a r k , r . m . 1975. A calibration curve for radiocarbon dates.\nAntiquity 49:251–66.\ne n g h o f f , j . b . 1994. Fishing in Denmark during the Ertebølle\nperiod. International Journal of Osteoarchaeology 4:65–96.\nfi s c h e r , a . 1981. Trade in Danubian shaft-hole axes and the\nintroduction of Neolithic economy in Denmark. Journal of\nDanish Archaeology 1:7–12.\nh a l l g r e n , f . , u . d j e r w, m . g e i j e r s t a m , a n d m .\ns t e i n e k e . 1998. Skogsmossen, an Early Neolithic settlement\nsite and sacrificial fen in the northern borderland of the Fun-\nnel-Beaker culture. Tor 29.\nh e r r i n g , d . a . , s . r . s a u n d e r s , a n d m . a . k a t z e n -\nb e r g . 1998. Investigating the weaning process in past popula-\ntions. American Journal of Physical Anthropology 105:425–39.\nj e n n b e r t , k . 1985. Neolithisation: A Scanian perspective.\nJournal of Danish Archaeology 4:196–97.\nk o c h , e . 1998. Neolithic bog pots from Zealand, Møn, Lolland,\nand Falster. Copenhagen: Nordiske Fortidsminder.\nk u b i a k - m a r t e n s , l . 1999. The plant food component of the\ndiet at the late Mesolithic (Ertebølle) settlement at Tybrind\nVig, Denmark. Vegetation History and Archaeobotany 8:\n294 F current anthropology\nFig. 3. Bone collagen d13C and d15N values for various Mesolithic and Neolithic humans from Denmark. Errors\nare \u0002 0.3‰ on the d13C values and \u0002 0.4‰ on the d15N values. filled circle, Vedbæk Mesolithic; filled square,\nTybrind Vig Mesolithic; filled triangle, Store A˚mose Neolithic; asterix, Aldersro Neolithic.\n117–27.\nl a r s s o n , l . 1984. The Skateholm Project: A Late Mesolithic\nsettlement and cemetery complex at a South Swedish bay.\nMeddelanden fra˚n Lunmds Universite´s Historiska Museum\n1983–84:5–38.\n———. 1989. “Ethnicity and traditions in Mesolithic mortuary\npractices of southern Scandinavia,” in Archaeological ap-\nproaches to cultural identity. Edited by S. J. Shennan, pp.\n210–18. London: Unwin Hyman.\n———. 1990. The Mesolithic of southern Scandinavia. Journal of\nWorld Prehistory 4:257–310.\nl i l l i e , m . , a n d m . p . r i c h a r d s . 2000. New radiocarbon\ndates and palaeodietary evidence from the Ukrainian Meso-\nlithic. Journal of Archaeological Science 27:965–72.\nl u b e l l , d . , m . j a c k e s , h . s c h w a r c z , m . k n y f , a n d\nc . m e i k l e j o h n . 1994. The Mesolithic–Niolithic transition\nin Protugal: Isotopic and dental evidence of diet. Journal of Ar-\nchaeological Science 21:201–16.\nl u¨ b k e , h . 2001. “New investigations on submarine Stone Age\nsettlements in the Wismar Bay area,” in Meso2000: Proceed-\nings of the VIth International Congress on the Mesolithic. Ed-\nited by L. Larsson. Lund.\nm a d s e n , t . 1985. Comments on early agriculture in Scandina-\nvia. Norwegian Archaeological Review 18 (1–2):91–93.\nm a d s e n , t . , a n d h . j . j e n s e n . 1982. Settlement and land\nuse in Early Neolithic Denmark. Analecta Praehistorica Lei-\ndensia 15:63–86.\nn i e l s e n , p . o . 1987. The beginning of the Neolithic: Assimi-\nlation or complex change? Journal of Danish Archaeology 5:\n240–43.\np e r s s o n , p . 1999. Neolitikums bo¨rjan: Underso¨kningar kring\njordbrukets introduktion i Nordeuropa. Vol. 1. Kust till kust-\nbo¨cker. Uppsala and Go¨teborg.\np r i c e , t . d . 1989. “The reconstruction of Mesolithic diets,” in\nThe Mesolithic in Europe. Edited by C. Bonsall, pp. 48–59. Ed-\ninburgh: John Donald.\n———. 1991. The Mesolithic of northern Europe. Annual Review\n———. 1996. “The first farmers of southern Scandinavia,” in The\norigins and spread of agriculture and pastoralism in Eurasia.\nEdited by D. R. Harris, pp. 346–62. London: UCL Press.\n———. Editor. 2000a. Europe’s first farmers. Cambridge: Cam-\nbridge University Press.\n———. 2000b. “The introduction of farming in northern Eu-\nrope,” in Europe’s first farmers. Edited by T. D. Price, pp.\n260–300. Cambridge: Cambridge University Press.\np r i c e , t . d . , a . b . g e b a u e r , s . u . h e d e , c . s . l a r s e n ,\ns . m a s o n , j . n i e l s e n , n . n o e - n y g a a r d , a n d d .\np e r ry. 2001. Excavations at Smakkerup Huse: Mesolithic set-\ntlement in northwest Zealand, Denmark. MS.\nr e g n e l l , m . , m a r i e - j o s e´ g a i l l a r d , t h o m a s s e i p\nb a r t h o l i n , a n d p e r k a r s t e n . 1995. Reconstruction of\nenvironment and history of plant use during the late Meso-\nlithic (Ertebølle culture) at the inland settlement of Bo¨keberg\nIII, southern Sweden. Vegetation History and Archaeobotany\n4:67–91.\nr i c h a r d s , m . p . , a n d r . e . m . h e d g e s . 1999. Stable iso-\ntope evidence for similarities in the types of marine foods used\nby Late Mesolithic humans at sites along the Atlantic coast of\nEurope. Journal of Archaeological Science 26:717–22.\nr i c h a r d s , m . p . , a n d e . k o c h . n.d. Neolitisk kost: Analy-\nser af kvælstof-isotopen 15N i menneskeskeletter fra yngre\nstenalder. Aarbøger for nordisk Oldkyndighed og Historie\n1999. In press.\nr i c h a r d s , m . p . , a n d p . a . m e l l a r s . 1998. Stable iso-\ntopes and the seasonality of the Oronsay middens. Antiquity\n72 (275):178–84.\nro w l e y - c o n w y, p . 1984. The laziness of the short-distance\nhunter: The origins of agriculture in western Denmark. Journal\nof Anthropological Archaeology 3:300–324.\ns c h o e n i n g e r , m . , a n d m . d e n i ro . 1984. Nitrogen and\ncarbon isotopic composition of bone collagen from marine and\nterrestrial animals. Geochimica et Cosmochimica Acta 48:\n625–39.\ns c h u l t i n g , r . j . , a n d m . p . r i c h a r d s . 2001. Dating\nof Anthropology 20:211–33.\nVolume 44, Number 2, April 2003 F 295\nwomen and becoming farmers: New palaeodietary and AMS\ndating evidence from the Breton Mesolithic cemeteries of Te´v-\niec and Ho¨edic. Journal of Anthropological Archaeology 20:\n314–44.\ns ø r e n s e n , s . a . 1995. Lollikhuse: A dwelling site under a\nkitchen midden. Journal of Danish Archaeology 11:19–29.\ns t u i v e r , m . a n d t . b r a z i u n u s . 1993. Modelling atmo-\nspheric 14C influences and 14C ages of marine samples to\n10,000 bc. Radiocarbon 35:137–90.\ns t u i v e r , m . a n d h . a . p o l a c h . 1997. Discussion: Report-\ning of 14C data. Radiocarbon 19:355–63.\ns t u i v e r , m . , p . j . r e i m e r , e . b a r d , j . w. b e c k , g . s .\nf u r r , k . a . h u g h e n , b . k ro m e r , g . m c c o r m a c , j .\nv a n d e r p l i c h t , a n d m . s p u r k . 1998. INTCAL98 radio-\ncarbon age calibration, 24,000–0 cal b.p. Radiocarbon 40:1041-\n84.\nt a u b e r , h . 1981. 13C evidence for dietary habits of prehistoric\nman in Denmark. Nature 292:332–33.\n———. 1983. 14C dating of human beings in relation to dietary\nhabits. PACT 8:365–75.\n———. 1986. “Analysis of stable isotopes in prehistoric popula-\ntions,” in Innovative trends in prehistoric archaeology. Edited\nby B. Herrmann. Mitteilungen der Berliner Gesellschaft fu¨r\nAnthropologie, Ethnologie und Urgeschichte 7.\nw h i t t l e , a . 1996. Europe in the Neolithic. Cambridge: Cam-\nbridge University Press.\nw i l l i a m s , e . 1989. Dating the introduction of food production\ninto Britain and Ireland. Antiquity 63:510–21.\nz v e l e b i l , m . 1995. Plant use in the Mesolithic and its role in\nthe transition to farming. Proceedings of the Prehistoric Soci-\nety 60:35–74.\nz v e l e b i l , m . , a n d p . ro w l e y - c o n w y. 1984. Transition\nto farming in northern Europe: A hunter-gatherer perspective.\nNorwegian Archaeological Review 17:104–28.\n"}