{"doi":"10.1109\/EURAD.2007.4404981","coreId":"101782","oai":"oai:epubs.surrey.ac.uk:1213","identifiers":["oai:epubs.surrey.ac.uk:1213","10.1109\/EURAD.2007.4404981"],"title":"Design of a Travelling-Wave Aperture-Coupled Circularly-Polarized Concentric Ring Array","authors":["Min, Chunwei","Free, Charles E"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-01-01","abstract":"<p>A concentric ring array utilizing microstrip radiating elements to produce circular polarisation is proposed. Optimized design data are presented, and the design validated through measured data for a 10GHz prototype antenna. The new antenna structure offers design flexibility, and the opportunity to control the amplitude and phase of the exciting signal.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1213<\/identifier><datestamp>\n      2017-10-31T14:01:04Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1213\/<\/dc:relation><dc:title>\n        Design of a Travelling-Wave Aperture-Coupled Circularly-Polarized Concentric Ring Array<\/dc:title><dc:creator>\n        Min, Chunwei<\/dc:creator><dc:creator>\n        Free, Charles E<\/dc:creator><dc:description>\n        <p>A concentric ring array utilizing microstrip radiating elements to produce circular polarisation is proposed. Optimized design data are presented, and the design validated through measured data for a 10GHz prototype antenna. The new antenna structure offers design flexibility, and the opportunity to control the amplitude and phase of the exciting signal.<\/p><\/dc:description><dc:date>\n        2007-01-01<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1213\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Min, Chunwei and Free, Charles E  (2007) Design of a Travelling-Wave Aperture-Coupled Circularly-Polarized Concentric Ring Array  In: 2007 European Radar Conference.     <\/dc:identifier><dc:relation>\n        10.1109\/EURAD.2007.4404981<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1213\/","10.1109\/EURAD.2007.4404981"],"year":2007,"topics":[],"subject":["Conference or Workshop Item","NonPeerReviewed"],"fullText":"Design of a Travelling-Wave Aperture-Coupled \nCircularly-Polarized Concentric Ring Array \nChunwei Min and Charles E. Free \nAdvanced Technology Institute \nUniversity of Surrey, Guildford Surrey GU2 7XH, UK \nC.Min@surrey.ac.uk \n \nAbstract— A concentric ring array utilizing microstrip radiating \nelements to produce circular polarisation is proposed. Optimized \ndesign data are presented, and the design validated through \nmeasured data for a 10GHz prototype antenna. The new antenna \nstructure offers design flexibility, and the opportunity to control \nthe amplitude and phase of the exciting signal. \nI. INTRODUCTION \nCircular arrays, with applications in radio direction finding, \nnavigation, and smart antenna systems, where azimuthal \npatterns are mainly considered and analysed, permit design \nflexibility for gain control and pattern synthesis in the \nelevation plane. Many researchers have utilized circular arrays \nfor beam-forming applications, such as [1] and [2]. In this \npaper, the elevation properties of a circular array using \nmicrostrip patches fed by apertures through a travelling-wave \n(TW) channel are addressed. A TW feed system in \nconjunction with non-resonant apertures provides control of \nthe power fed to each of the radiating elements. The circular \npolarisation (CP) was achieved by extending the technique \nproposed by Huang [3]. Following the method established by \nLum et al. [6], we used an annular arrangement of radiating \npatches, with appropriate phase delays to generate the CP \nsignal. The power coupled to each radiating element was \ndesigned to be identical for minimisation of amplitude \nexcitation error. Phase shifters were introduced between \nadjacent radiating elements to generate CP and to compensate \nfor the phase lag due to a portion of energy coupled to the \nprevious radiating element. A key feature of the proposed \nmultilayer structure is that it can easily be integrated with \nother microwave circuits. \nII. ANTENNA STRUCTURE AND ANALYSIS \nThe electric fields (E) of a circular array can be expressed \nas the element radiation function (Es) multiplied by the array \nfactor, and \n \n( ) ( ) ( )( )∑\n=\n−−\n−−=\nN\nn\nRj\nns\nnneEE\n1\ncossin,, φφφθβφαφθφθ  (1) \n \nwhere α is the polarisation angle relative to the normal vector, \nN is the total number of elements, R is the ring radius, β is the \npropagation constant, and φn=2π(n-1)\/N is the spatial \nexcitation phase of the n-th element. The above expression is \nbased on the centre of the ring being at the origin of the \nspherical polar coordinate system. It was found that the ring \nradius has an effect on the gain and grating lobe level. A \nlarger ring radius results in higher gain operation, but grating \nlobes may start to appear. Fig. 1 shows the configuration of \nthe proposed design. The microstrip-line channel is formed on \none side of the circuit and the radiating elements on the other. \nThe microstrip and radiating elements share a common ground \nplane which contains apertures to couple power from the \nmicrostrip line to the patches. In the current work, eight \nradiating patches were used, positioned with a ring radius of \n35mm and a polarisation angle of π\/2. \n \n \nFig. 1  Configuration of the proposed TW-fed circular array \n \nThe aperture-coupled feed technique was first proposed by \nPozar [5] in which a non-resonant aperture slot was utilized \nfor the excitation of radiating elements. This technique is able \nto be applied on a TW structure for many applications. The \npropagating fields along the feed line induce magnetic current \nalong the aperture slot, and a portion of energy is coupled to \nthe radiating element at resonance. Since the power is coupled \nout through the slots, leaving less for the remaining patches, \nincreased coupling is required for patches excited further \ndown the line. The coupling is adjusted by offsetting the \npatches from the line with a distance (dos). This concept \nprovides design flexibility to guarantee that each radiating \n978-2-87487-004-0 © 2007 EuMA October 2007, Munich Germany\nProceedings of the 4th European Radar Conference\n240\nAuthorized licensed use limited to: University of Surrey. Downloaded on March 18,2010 at 11:56:23 EDT from IEEE Xplore.  Restrictions apply. \nelement is able to receive an identical amount of power from \nthe feed line. It should be noted that a larger offset of the slot \nresults in less power being coupled to the patch. A schematic \nmodel for a lossless feed network was developed to aid in the \nanalysis of the proposed design. The radiating elements were \nconnected in cascade to work out the coupling required for the \nsequential elements. To obtain identical amounts of power for \neach element, the coupling factor of the n-th element must \nsatisfy the following relationship \n \n( )( ) ( )121 111 −−⋅⋅⋅−−= n\nRad\nn\nP\nρρρ\nρ                 (2) \n \nThe fraction (ρn) of power coupled to the n-th patch can be \nsimplified as follows, \n \n( ) Rad\nRad\nn Pn\nP\n11 −−\n=ρ                               (3) \n \nwhere PRad is the normalized power accepted by each patch. In \nthe proposed work, PRad was chosen to be 0.1 which means \nthat the n-th patch would accept one-tenth of the input power. \nHaving less left for the latter patches, larger portions of \ncoupling are required from the remaining power. This analysis \nestablishes design criteria for the offset required on each \nradiating element to receive the same amount of power. Fig. 2 \nshows the coupling behaviour with different offset distances. \n \n \nFig. 2 Variation of the coupling factor along different offset distances at \n10GHz \n \nThe quality of CP relies on precise amplitude and excitation \nof linearly polarized elements in an array. In the present \ndesign, meandered-line sections were used to create the \nrequired phase delay between each element. Compensation is \nrequired for the phase delay (∆θn) during the feedline-to-slot \ncoupling of each element. As shown in Fig. 3, a small slot \noffset leading to large coupled power, results in a relatively \nlarge phase delay. \nThe proposed antenna design was fabricated using \nRT\/duroid® 5880 with εr=2.2 and tanδ=0.0009. The substrate \nthicknesses for the feed network and patches are 0.508mm and \n1.016mm, respectively. Based on the above substrate \ninformation, the physical dimensions of design are given as \nfollows: Lp=8.3mm, Wp=10.6mm, Lap=5.4mm (λg\/4 at 10GHz), \nWap=0.54mm, and Wms=1.6mm (50Ω). Table 1 summarizes \nthe parameters of offset (dos), fractional portion of coupled \npower (ρn), and phase delay (∆θn). \n \n \nFig. 3 Calculated offset distance versus phase delay at 10GHz with the \nsubstrate information given below \n \nTABLE I \nDESIGN PARAMETERS \nIndex, n dos, mm ρn, % ∆θn, deg \n1 2.93 10 0.57 \n2 2.86 11 0.68 \n3 2.79 13 0.82 \n4 2.7 14 1.03 \n5 2.59 17 1.34 \n6 2.45 20 1.8 \n7 2.26 25 2.53 \n8 1.94 33  \n \nIII. MEASUREMENT AND DISCUSSION \nThe measured S-parameter response is shown in Fig. 4. \nWhen input power is propagating through the TW channel, \nsome will go through the structure to the output port, \nencountering power loss in the substrate, while some will \nreflect back.  Since the proposed antenna is a two-port device, \nit is not sufficient to just define the operating bandwidth using \nthe reflection coefficient (S11). Including the normalized \npower loss (PL) through the feed network which was the \nmeasurement of the feed network only and shown in Fig. 5, \nand its transmission coefficient (S21), the normalized power \ndelivered to the radiating elements (PRad) can be written in the \nfollowing equation, and the result is shown in Fig. 6. \n \nLRad PSSP −−−=\n2\n21\n2\n111                   (4) \n \nThe return loss bandwidth of a one-port antenna can be \ndefined as the frequency range where 90% (|S11|<-10dB) of \ninput power is delivered to the radiating element. For a two-\nport TW antenna structure, a portion of the input power is \nreflected back while some is propagating through the lossy \n241\nAuthorized licensed use limited to: University of Surrey. Downloaded on March 18,2010 at 11:56:23 EDT from IEEE Xplore.  Restrictions apply. \nfeed network to the matched load. The remaining power is \ndelivered to the patches. The operating bandwidth may be \ndefined according to the power accepted by the radiating \nelements. As shown in Fig. 6, peak radiation is about 52% at \n10.04GHz which means that half of the input power is \ndelivered to the patches through aperture slots. Based on this \ndiscussion, the measured bandwidth of the proposed antenna \nis the frequency range where the radiation is greater than \n46.8% around design’s centre frequency, and is about 8%. \nAccording to the design specifications, since each radiating \nelement should accept 10% of input power from the TW \nchannel, a total amount of 80% at design’s centre frequency \nshould be obtained. The main reason may be the misalignment \nerror between the slots and patches which will result in errors \nin the coupling to the patches. \nThe measured radiation patterns in the principal planes are \nshown in Fig. 7 and these are in close agreement with the \npredicted patterns around boresight. The higher level of \ngrating lobes was due to the selection of a relatively large ring \nradius, but this is an inherent property of circular arrays of \nradiating patches. The front-to-back ratio was found to be \nabout 10dB at the design centre frequency which was lower \nthan expected. It is thought that the poor front-to-back ratio \nmay be due to back-side radiation from the slots, and this \ncould be minimized in a more advanced design. The optimum \nCP operation was obtained at 9.9GHz with axial ratio (AR) of \n0.7dB. As shown in Fig. 8, the axial ratio bandwidth (ARBW) \nwas measured to be 5% from 9.8 to 10.3GHz. \n \n \nFig. 4 Measured response of the proposed antenna \n \n \nFig. 5 Power loss (PL) of the feed network \n \n \nFig. 6 Radiation (PRad) of the proposed antenna \n \n \nFig. 7 Measured patterns of principal elevation planes at 10GHz \n \n \nFig. 8 Measured axial ratio over frequencies \n \nIV. CONCLUSION \nThe concept of a travelling-wave, aperture-coupled, \ncircularly-polarized, concentric ring array has been \nestablished through practical measurement. It was found that \nmisalignment between the layers results in amplitude \nexcitation error and has an influence on the performance of \nantenna. This alignment error becomes critical in mm-wave \nfrequencies. A feed network utilizing microstrip lines offers a \nphysical contact medium for further integrations of solid-state \ncomponents, and is capable of wideband operation. The \nproposed concentric ring structure provides the potential for \npattern control, whilst maintaining CP operation. The \n242\nAuthorized licensed use limited to: University of Surrey. Downloaded on March 18,2010 at 11:56:23 EDT from IEEE Xplore.  Restrictions apply. \nmeasured data confirms the proposed coupling power theory \nto be viable on TW structures. And this may be able to be \napplied on other types of feed lines and structures as long as \nthe coupling mechanism is formed. Further work will be \nfocused on the extension of model with the inclusion of lossy \nfeed network, reducing unwanted lobes, and improving the \naxial ratio over a wider bandwidth. \nACKNOWLEDGMENT \nThe authors would like to acknowledge the financial \nsupport given by P. E. Composites Ltd. \nREFERENCES \n[1] P. Ioannides and C. A. Balanis, “Uniform circular and rectangular \narrays for adaptive beamforming applications,” IEEE Antennas \nWireless Propag. Lett., vol. 4, pp. 351-354, 2005. \n[2] S. Kumar and L. Shafai, “Beam focusing properties of circular \nmonopole array antenna on a finite ground plane,” IEEE Trans. \nAntennas Propag., vol. 53, no. 10, pp. 3406-3409, Oct. 2005. \n[3] J. Huang, “A technique for an array to generate circular polarization \nwith linear polarized elements,” IEEE Trans. Antennas Propag., vol. \nAP-34, no. 9, pp. 1113-1123, Sep. 1986. \n[4] S. D. Targonski and D. M. Pozar, “Design of wideband circularly \npolarized aperture-coupled microstrip antennas,” IEEE Trans. \nAntennas Propag., vol. 41, no. 2, pp. 214-220, Feb. 1993. \n[5] D. M. Pozar, “A microstrip antenna aperture coupled to a \nmicrostripline,” Electron. Lett., vol. 21, pp. 49-50, Jan. 1985. \n[6] K. M. Lum, C. Laohapensaeng, and C. Free, “A novel travelling-wave \nfeed technique for circularly polarized planar antennas,” IEEE Microw. \nWireless Compon. Lett., vol. 15, no. 3, Mar. 2005. \n[7] C. A. Balanis, Antenna Theory, 2nd Ed., John Wiley & Sons, 1997, \nChapter 6, pp. 324-328. \n \n243\nAuthorized licensed use limited to: University of Surrey. Downloaded on March 18,2010 at 11:56:23 EDT from IEEE Xplore.  Restrictions apply. \n"}