{"doi":"10.1364\/JOSAB.20.000391","coreId":"66418","oai":"oai:dro.dur.ac.uk.OAI2:1554","identifiers":["oai:dro.dur.ac.uk.OAI2:1554","10.1364\/JOSAB.20.000391"],"title":"Measurement of propagation constant in waveguides with wideband coherent terahertz spectroscopy.","authors":["Hadjiloucas, S.","Galvao, R. K. H.","Bowen, J. W.","Martini, R.","Brucherseifer, M.","Pellemans, H. P. M.","Bolivar, P. H.","Kurz, H.","Digby, J.","Parkhurst, G. M.","Chamberlain, J. M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-05","abstract":"A quasi-optical technique for characterizing micromachined waveguides is demonstrated with wideband time-resolved terahertz spectroscopy. A transfer-function representation is adopted for the description of the relation between the signals in the input and output port of the waveguides. The time-domain responses were discretized, and the waveguide transfer function was obtained through a parametric approach in the z domain after describing the system with an autoregressive with exogenous input model. The a priori assumption of the number of modes propagating in the structure was inferred from comparisons of the theoretical with the measured characteristic impedance as well as with parsimony arguments. Measurements for a precision WR-8 waveguide-adjustable short as well as for G-band reduced-height micromachined waveguides are presented","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66418.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1554\/1\/1554.pdf","pdfHashValue":"5fe433fc368dff3469df901453e3f6f0a901d5e4","publisher":"Optical Society of America","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1554<\/identifier><datestamp>\n      2010-11-10T12:08:05Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Measurement of propagation constant in waveguides with wideband coherent terahertz spectroscopy.<\/dc:title><dc:creator>\n        Hadjiloucas, S.<\/dc:creator><dc:creator>\n        Galvao, R. K. H.<\/dc:creator><dc:creator>\n        Bowen, J. W.<\/dc:creator><dc:creator>\n        Martini, R.<\/dc:creator><dc:creator>\n        Brucherseifer, M.<\/dc:creator><dc:creator>\n        Pellemans, H. P. M.<\/dc:creator><dc:creator>\n        Bolivar, P. H.<\/dc:creator><dc:creator>\n        Kurz, H.<\/dc:creator><dc:creator>\n        Digby, J.<\/dc:creator><dc:creator>\n        Parkhurst, G. M.<\/dc:creator><dc:creator>\n        Chamberlain, J. M.<\/dc:creator><dc:description>\n        A quasi-optical technique for characterizing micromachined waveguides is demonstrated with wideband time-resolved terahertz spectroscopy. A transfer-function representation is adopted for the description of the relation between the signals in the input and output port of the waveguides. The time-domain responses were discretized, and the waveguide transfer function was obtained through a parametric approach in the z domain after describing the system with an autoregressive with exogenous input model. The a priori assumption of the number of modes propagating in the structure was inferred from comparisons of the theoretical with the measured characteristic impedance as well as with parsimony arguments. Measurements for a precision WR-8 waveguide-adjustable short as well as for G-band reduced-height micromachined waveguides are presented. <\/dc:description><dc:subject>\n        Optical devices<\/dc:subject><dc:subject>\n         Waveguides<\/dc:subject><dc:subject>\n         Spectroscopy<\/dc:subject><dc:subject>\n         Far infrared<\/dc:subject><dc:subject>\n         Thin films<\/dc:subject><dc:subject>\n         Ultrafast optics<\/dc:subject><dc:subject>\n         Pulse shaping<\/dc:subject><dc:subject>\n         Microwaves.<\/dc:subject><dc:publisher>\n        Optical Society of America<\/dc:publisher><dc:source>\n        Journal of the Optical Society of America B : optical physics, 2003, Vol.20(2), pp.391-401 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2003-05<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1554<\/dc:identifier><dc:identifier>\n        issn:0740-3224<\/dc:identifier><dc:identifier>\n        issn: 1520-8540<\/dc:identifier><dc:identifier>\n        doi:10.1364\/JOSAB.20.000391<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1554\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1364\/JOSAB.20.000391<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1554\/1\/1554.pdf<\/dc:identifier><dc:rights>\n        © Copyright 2003 Optical Society of America.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1520-8540","issn:0740-3224"," 1520-8540","0740-3224"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":["Optical devices","Waveguides","Spectroscopy","Far infrared","Thin films","Ultrafast optics","Pulse shaping","Microwaves."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n10 November 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nHadjiloucas, S. and Galvao, R. K. H. and Bowen, J. W. and Martini, R. and Brucherseifer, M. and Pellemans,\nH. P. M. and Bolivar, P. H. and Kurz, H. and Digby, J. and Parkhurst, G. M. and Chamberlain, J. M. (2003)\n’Measurement of propagation constant in waveguides with wideband coherent terahertz spectroscopy.’, Journal\nof the Optical Society of America B : optical physics., 20 (2). pp. 391-401.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1364\/JOSAB.20.000391\nPublisher’s copyright statement:\nCopyright 2003 Optical Society of America.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nMeasurement of propagation constant in\nwaveguides with wideband\ncoherent terahertz spectroscopy\nSillas Hadjiloucas\nDepartment of Cybernetics, The University of Reading, Whiteknights, Reading, RG6 6AY, UK\nRoberto K. H. Galva˜o\nDivisa˜o de Engenharia Eletroˆnica, Instituto Tecnolo´gico de Aerona´utica, Sa˜o Jose´ dos Campos, SP, 12228-900,\nBrazil\nJohn W. Bowen\nDepartment of Cybernetics, The University of Reading, Whiteknights, Reading, RG6 6AY, UK\nRainer Martini, Martin Brucherseifer, Harm P. M. Pellemans, Peter Haring Bolı´var, and Heinrich Kurz\nInstitut fu¨r Halbleitertechnik, Rhejnisch Westfalische Technische Hochschule Aachen Sommerfeldstrasse,\n52056 Aachen, Germany\nJohn Digby and Geoffrey M. Parkhurst\nDepartment of Physics, University of Nottingham, Nottingham NG7 2RD, UK\nJ. Martyn Chamberlain\nDepartment of Electronic and Electrical Engineering, The University of Leeds, Leeds, LS2 9JT, UK\nReceived February 22, 2002; revised manuscript received July 14, 2002\nA quasi-optical technique for characterizing micromachined waveguides is demonstrated with wideband time-\nresolved terahertz spectroscopy. A transfer-function representation is adopted for the description of the rela-\ntion between the signals in the input and output port of the waveguides. The time-domain responses were\ndiscretized, and the waveguide transfer function was obtained through a parametric approach in the z domain\nafter describing the system with an autoregressive with exogenous input model. The a priori assumption of\nthe number of modes propagating in the structure was inferred from comparisons of the theoretical with the\nmeasured characteristic impedance as well as with parsimony arguments. Measurements for a precision\nWR-8 waveguide-adjustable short as well as for G-band reduced-height micromachined waveguides are pre-\nsented. © 2003 Optical Society of America\nOCIS codes: 230.7370, 300.6270, 350.4010, 320.5540, 310.6870.\n1. INTRODUCTION\nAt microwave frequencies, measurements of the scatter-\ning parameters, attenuation coefficients, and characteris-\ntic impedances of waveguide components are performed\nwith four- or six-port network analyzers.1–5 In such mea-\nsurements, the most common calibration item is the pre-\ncision air–dielectric coaxial transmission line or air line,\nalthough some calibration techniques have also been de-\nscribed with an attenuator as a calibration item.6–10\nNetwork analyzers are calibrated with at least three\nknown terminations, and the characteristic impedance is\nconventionally determined with reference to a standard\nimpedance line. In two-port network analyzers, through-\nreflect-line or line-reflect-line measurements,11,12 in\nwhich the line standard is placed between the two ports,\nare used for calibration purposes, whereas in reflectome-\nters, air lines in conjunction with terminations as calibra-\ntion items are used. However, as the frequency is in-\ncreased to 100 GHz, very few manufacturers can provide\nvector measurement capability, the waveguide samples\nbecome smaller, and the repeatability of the measure-\nment becomes increasingly dependent on the ability of the\nuser to couple sufficient power to the waveguide ports and\nto accurately measure the power ratios between the ana-\nlyzer’s ports under different calibration conditions.13–15\nFurthermore, the manufacture of precision reference ter-\nminations becomes difficult. At these higher frequencies,\na quasi-optical approach for building instruments with\nhigh-density polyethylene lenses and mirrors that control\nthe diffractive spreading of the beam offers significant ad-\nHadjiloucas et al. Vol. 20, No. 2 \/February 2003 \/J. Opt. Soc. Am. B 391\n0740-3224\/2003\/020391-11$15.00 © 2003 Optical Society of America\nvantages such as very low loss, multioctave operation,\nand noncontact coupling to the test ports.16–18\nGenerally, it is possible to quasi-optically measure the\nscattering matrix (S parameters) of a two-port device un-\nder single-mode excitation with a null-balance bridge re-\nflectometer and a de-embedding procedure.19 Because\nthe position of the focusing elements in a quasi-optical in-\nstrument must remain fixed during a set of measure-\nments, as would be necessary to measure a range of wave-\nguide lengths, the distance between the feed antennas,\nand consequently the degree of coupling to the test\nbeams, would be different for each test piece, causing an\nerror in the measured S parameters. Therefore a trans-\nmissometer cannot be implemented, and a reflectometer\nin conjunction with a one-port de-embedding procedure is\nused. This approach implies that the only requirement is\nensuring that a constant separation and alignment is\nmaintained between the reflectometer test port and the\nfeed antenna on each test piece. Each one-port test piece\nis a length of waveguide terminated in a short and con-\nnected to the reflectometer by a two-port device consisting\nof a further length of waveguide, the feed antenna, and\nany additional optics necessary to improve coupling be-\ntween the reflectometer and the feed antenna.\nIn a previous study,20 we used a continuous-wave (cw)\nbroadband source coupled to a polarizing Martin–Puplett\ndispersive Fourier-transform spectrometer (DFTS) oper-\nated in reflectance mode to measure the characteristic im-\npedance in waveguides when these were shorted at differ-\nent lengths. The limited signal-to-noise ratio of our\nsystem, however, did not permit us to report propagation-\nconstant measurements at that time. Time gating was\nused to separate the individual reflection signatures of\nthe device under test from those of the antenna–lens sys-\ntem which formed the measurement port of the spectrom-\neter. The procedure is equivalent to the frequency-\nsweeping process with a vector network analyzer, the only\ndifference being that it is performed directly in the time\ndomain, and thus the need for the extra Fourier trans-\nform necessary for time gating is obviated. Furthermore,\nthe use of two known waveguide lengths, with the short-\nest length used to provide a background interferogram,\nimplies that the whole process is directly referenced to\nthe impedance of free space provided by the reference arm\nin the interferometric spectrometer and that no other ref-\nerence calibration standard is required. In this paper, in\norder to circumvent the limited power output of the\nmercury-arc lamp used in cw DFTS, an alternative quasi-\noptical technique for characterizing terahertz (THz) mi-\ncromachined waveguides21 is proposed using identical\nwaveguides of different lengths and wideband coherent\nterahertz spectroscopy. Our one-port approach differs\nfrom the two-port approach reported by Grischowski’s\ngroup.22–27\nA difficulty that arises when conventional time-domain\nterahertz spectroscopy is used for the characterization of\nwaveguides intended for operation near 100 GHz is that\nmost of the power output from the wideband pulsed\nsource occurs at frequencies (e.g., 1–3 THz) where the\nwaveguide can support a number of modes. The power\noutput over the single-mode bandwidth of the waveguide\nis often rather low, leading to a poor signal-to-noise ratio\nthere. At frequencies where multimode propagation can\noccur, a meaningful analysis is only possible if the extent\nto which each waveguide mode has been excited is known.\nThis paper introduces a combination of wavelet-filtering\nand system-identification techniques to improve the\nsignal-to-noise ratio and to characterize the multimode\npropagation.\n2. EXPERIMENTAL SETUP\nThe experimental setup for generating and detecting THz\nradiation is shown in Fig. 1. A 76-MHz repetition-rate\nmode-locked Ti:sapphire laser producing optical pulses\nwith durations of \u0002140 fs is used to resonantly excite\n(with an excitation power of 270 mW) the lowest inter-\nband transitions of an InGaAs emitter that is located at\nthe focal point of a parabolic reflector.28,29,30 The optical\npulse generates an electron–hole plasma, and the acceler-\nated carriers generate a pulse of THz radiation that is\nhorizontally polarized along the direction of the surface\nfield of the InGaAs emitter. THz pulses emitted by the\nphotoconductive element are transmitted through a verti-\ncal 10-\u0003m center-to-center spacing free-standing\ntungsten-wire polarizing beam-splitter grid. The propa-\ngating THz beam, which has a Gaussian transverse am-\nplitude distribution, is focused by the second parabolic\nmirror to feed at normal incidence, in a copolar manner,\nthe open port of the waveguide under test. The optics are\ndesigned to give frequency-independent coupling at the\ntest port. The function of the second polarizing grid at\n\u000245° with respect to the horizontal is to ensure that only\nthe linearly polarized component of the pulse at \u000345°\nwith respect to the horizontal is transmitted. Upon 180°\nreflection at the backshort, the modified terahertz pulse\nexits the waveguide and is retransmitted through the 45°\ngrid in a time-reversed manner, the vertically polarized\ncomponent being reflected by the vertical grid and focused\nwith a parabolic mirror to a time-gated (28-mW gate-\npower, 1-\u0003A photocurrent) ion-implanted silicon-on-\nsapphire photoconductive dipole antenna.31 Such a con-\nfiguration permits measurements to be performed at\nexactly normal incidence (with respect to the azimuth) to\nthe device under test, which is important in order to pre-\nvent measurement artifacts that can occur when a\nslightly divergent input and output beam configuration is\nused. Additionally, the high cross-polar levels originat-\ning from the focusing action of the paraboloids are sup-\npressed to levels governed by the cross-polar performance\nof the grids, in order to allow a precise analysis of polar-\nization dependencies. However, there is a power penalty,\nas only 1\/4 of the emitted THz power is used for the mea-\nsurements. An interesting feature of the experimental\nsetup is that the Ti:sapphire laser pulses used to excite\nthe photoconductive switch are in the visible part of the\nspectrum and co-propagate with the THz beam. This en-\nsures that the focal point of the paraboloid, which is simi-\nlar for both the visible and the THz pulses, can be easily\nidentified. This proves useful for an initial coarse align-\nment of the test piece with the THz beam. Further opti-\nmization of the coupling between the waveguide struc-\ntures under test and the THz E-field was ensured by\nminimizing the magnitude of the reflected pulse at the en-\n392 J. Opt. Soc. Am. B\/Vol. 20, No. 2 \/February 2003 Hadjiloucas et al.\ntrance of the structure. A microscope fitted with a ver-\nnier scale in the eyepiece and a five-axis translational\/\nrotational stage were used for the final alignment\nprocedure. The procedure ensured high repeatability in\nthe measurements.\nOne sequence of measurements was performed on a\ncommercially available precision WR-8 waveguide-\nadjustable short. The time-domain interferograms\nshown in Fig. 2(a), corresponding to five different posi-\ntions of the adjustable backshort at 1-mm spacings, were\nrecorded with a lock-in amplifier (\u0004 \u0004 300 ms) after coav-\neraging three scans (1000 measurements per step with\n100-ms wait states). The small oscillations at 0 mm in\nFig. 2(a) are due to the impedance mismatch between the\nwaveguide and free space. Use of an adjustable short to\nprovide different test waveguide lengths ensured that a\nconstant degree of coupling was maintained between the\nTHz beam and the test piece throughout the measure-\nment sequence.\nIn another sequence of measurements, the time-\ndomain signatures for four lengths of G-band (140–220\nGHz) 1300 \u0003m \u0005 80 \u0003m micromachined21 reduced-\nheight waveguide were recorded [Fig. 2(b)] after sequen-\ntially placing them at the test port of the interferometer\nwith the alignment procedure described earlier. The test\npieces, which differed from each other by a unit length of\n1.83 mm, were coupled to the beam with nominally iden-\ntical integrated reduced-height slotted horn antennas\nflared in the H plane. The cutting of an exponentially ta-\npered slot from the upper surface of the basic H plane sec-\ntoral horn (Fig. 3) resulted in a design that did not suffer\nthe disadvantage of a restricted aperture height. Al-\nthough the design implied that the beam would be astig-\nmatic, adjustment of the horn parameters (flare angle, ap-\nerture width, slot angle, and position of the slot apex\nrelative to the start of the horn flare) had been performed\nto produce a pattern with reasonable E- and H-plane\nbeam widths. The far-field pattern of this antenna has\nbeen previously characterized in the 150–200-GHz fre-\nquency range (single-mode operation), showing an eleva-\ntion of 34° at the E plane for optimal coupling (Fig. 4).\nThe THz pulse produced by the photoconductive antenna\nhas frequency components up to 3 THz.\n3. SYSTEM IDENTIFICATION WITH AN\nAUTOREGRESSIVE WITH EXOGENOUS\nINPUT MODEL\nThe use of parametric models to obtain a filtered version\nof the Fourier-transformed signal has been already re-\nFig. 1. Experimental setup for waveguide characterization.\nFig. 2. (a) Time-domain reflection signatures for five different\nWR-8 waveguide lengths 1 mm apart and (b) for four reduced-\nheight micromachined waveguides 5\u0005g , 6\u0005g , 7\u0005g , and 8\u0005g long.\nFig. 3. Photograph of micromachined waveguide with antennas\nat both ends.\nFig. 4. Copolar far-field patterns for the integrated antenna at\n197 GHz.\nHadjiloucas et al. Vol. 20, No. 2 \/February 2003 \/J. Opt. Soc. Am. B 393\nported in the past.32–34 In this paper, however, we pro-\npose the use of a parametric input\/output model and an\nidentification procedure to obtain the frequency response\nof a waveguide test piece. Ratioing the measured spectra\nU( j\u0006) and Y( j\u0006) for the shorter (one-unit length) and\nlonger (two-unit lengths) waveguides, respectively, should\nresult in the effective complex insertion loss function\nH( j\u0006) for a unit-length d (double-pass) waveguide with a\n180° phase shift due to the reflection at the backshort.\nThis can be interpreted in the following manner. With\nreference to Fig. 5, let P( j\u0006) be the Fourier transform of\nthe excitation pulse, which is supposed to be the same for\nall experiments. This is a reasonable assumption, since\nsignals acquired with a lock-in technique are coaveraged\nafter several pulses, thus reducing the effect of pulse-to-\npulse variability. In addition, let G1( j\u0006) and G2( j\u0006) be\nthe frequency responses of the antenna section coupling\nthe pulse into the shorter and longer waveguides, respec-\ntively. Since the antenna–waveguide structure is a re-\nciprocal device, it is possible to write\nU\u0007 j\u0006\b \u0004 H\u0007 j\u0006\bG1\n2\u0007 j\u0006\bP\u0007 j\u0006\b, (1)\nY\u0007 j\u0006\b \u0004 H2\u0007 j\u0006\bG2\n2\u0007 j\u0006\bP\u0007 j\u0006\b. (2)\nSuch a model formulation is valid as long as the electrical\nsize of the antenna tapers slowly, ensuring a smooth tran-\nsition between the waveguide structure and free space, or\ncan be gated out, so that Fabry–Perot effects of the re-\nflected pulse need not be taken into account (Appendix A).\nThis is usually the case when either the structure is non-\ndispersive or when the structure is long enough. Close\ninspection of the time-domain signatures in Fig. 2 showed\nthat this formulation was adequate for our data set, since\nif there were such Fabry–Perot effects in the devices un-\nder test, multiple reflection signatures of gradually lower\nmagnitude would have been identifiable at distances\ngiven from 4n¯d\/c (where n¯ is the effective refractive in-\ndex of the waveguide structure of length d assuming mul-\ntimode propagation and c is the speed of light in vacuum).\nRatioing Y( j\u0006) with U( j\u0006) after assuming that the dif-\nference between G1( j\u0006) and G2( j\u0006) is negligible, yields\nH( j\u0006), that is\nH\u0007 j\u0006\b \u0004\nY\u0007 j\u0006\b\nU\u0007 j\u0006\b\n. (3)\nNotice that the complex insertion loss H( j\u0006) can be re-\ngarded as the frequency response of a linear system that\nproduces an output y(t) for an input u(t), where y and u\nare the measured time-domain responses. In this man-\nner, it is possible to obtain H( j\u0006) through a parametric\napproach, in which the system is described by an autore-\ngressive with exogenous input (ARX) model of the form\ny\tk\n \u0002 a1y\tk \u0003 1\n \u0002 ... \u0002 anay\tk \u0003 na\n\n\u0004 b1u\tk \u0003 nk\n \u0002 b2u\tk \u0003 nk \u0003 1\n\n\u0002 ... \u0002 bnbu\tk \u0003 nk \u0003 nb \u0002 1\n \u0002 \u000b\tk\n, (4)\nwhere y\tk\n is the response measured at time kTs and\n\fa1 ,..., ana, b1 ,..., bnb\r are model coefficients, na is the\nnumber of poles (equivalent to the system order), (nb\n\u0003 1) is the number of zeros, nk is a pure time delay, and\n\u000b\tk\n is a residual, which is to be minimized by the iden-\ntification process. Hence H( j\u0006) can be obtained from\nthe discretized z-domain transfer function H(z) given by\nH\u0007z \b \u0004\nY\u0007z \b\nU\u0007z \b\n\u0004 z\u0003nk\nb1 \u0002 b2z\n\u00031 \u0002 ... bnbz\n\u0003nb\u00021\n1 \u0002 a1z\n\u00031 \u0002 ... anaz\n\u0003na\n\u0004 z\u0003nk\nN\u0007z \b\nD\u0007z \b\n. (5)\nThe frequency response can be obtained from the\nz-domain transfer function by making z \u0004 exp( j\u0006Ts),\nwhere Ts is the sampling time (27 fs for the backshort\ndata and 3.6 fs for the micromachined waveguide data).\nIt is well known in linear-systems theory that the roots of\nD(z) [termed poles of H(z)] are associated with the\nmodes of the system. The roots of N(z) [termed zeros of\nH(z)] are associated with the weights of each TEmn mode\nin the overall response of the system (n \u0002 m modes in to-\ntal). In addition, H(z) can be expanded (Appendix B) in\nthe following partial fractions form:\nH\u0007z \b \u0004 z\u0003nk\u000e\ni\u00041\nn\u0002m\nwi\n1 \u0002 fiz\n\u00031\n1 \u0002 ci1z\n\u00031 \u0002 ci2z\n\u00032 , (6)\nwhere n \u0002 m \u0004 na\/2 [since the order of the denominator\nof H(z) is na and there are n \u0002 m terms in the expan-\nsion, each one with a second order denominator]. Each\npartial fraction describes a propagating mode inside the\nwaveguide. The ith mode will have weight wi , a reso-\nnant frequency of oscillation \u0006ni , and a damping ratio \u000f i\ngiven by the roots of the polynomial in the ith denomina-\ntor. It is worth noting that this is the minimal represen-\ntation needed to describe a mode, since the first-order\nterm in the numerator of the partial fraction will account\nfor the cut-on effect in the frequency domain, whereas the\nsecond-order term in the denominator will ensure that\nthe response is attenuated at high frequencies. For mod-\neling parsimony, no extra zeros or poles are incorporated\nin the description of each mode. Parameters ai and bi\ncan be obtained by minimizing the mean-square value of\nthe residual \u000b\tk\n over the time horizon used for identifi-\ncation (Appendix C), with a least-squares procedure.\nWhen choosing the order of the model (that is, na), one\ncan make an assumption on the number of modes that are\npropagating in the structure. It is convenient to make nb\nequal to na (na \u0010 nb always for a causal system), which is\nthe most general formulation for a given number of\nmodes. The value of nk can be accurately estimated after\nobserving the time-domain signatures as recorded by set-\nting the calibrated delay line of the spectrometer from\nFig. 5. Backshorted micromachined reduced-height waveguide\nstructures of different lengths coupled to exponentially flared an-\ntenna structure, as used for the experiments.\n394 J. Opt. Soc. Am. B\/Vol. 20, No. 2 \/February 2003 Hadjiloucas et al.\n\u0011\u0007\u0006\b \u0004 tan\u00031\tIm(H\u0007 j\u0006\b)\/Re(H\u0007 j\u0006\b)\n. (7)\nCareful observation of Eq. (5) above shows that it is\nequivalent to the more familiar equation of the complex\ninsertion loss Hˆ(\u0006) in dispersive Fourier-transform\nspectrometry35:\nHˆ\u0007 j\u0006\b \u0004 H\u0007\u0006\bexp\t\u0003j\u0012\u0007\u0006\b\n, (8)\nwhere \u0011(\u0006) \u0004 z\u0003nk\u0002z\u0004exp( j\u0006Ts) . The theoretical cut-off\nwavelength \u0005c for each TEmn mode that excites the rect-\nangular waveguide structures is calculated from the\nknown waveguide dimensions a, b by36\n\u0005cmn \u0004\n2\u0002ab\n\u0002m2 b\na\n\u0002 n2\na\nb\n. (9)\nThe guide wavelength \u0005g inside the waveguide can then\nbe calculated for each mode from \u0005gmn \u0004 \u0005\/(1\n\u0003 \u0005\/\u0005cmn)\n1\/2, where \u0005 is the wavelength in free space.\nThe theoretical phase delay at each frequency for each\nmode is \u0011mn \u0004 \u0013 \u0002 2\u00132d\/\u0005gmn, where the length 2d cor-\nresponds to a double-pass measurement and the factor \u0013\narises from the reflection of the incident wave from the\nbackshort in the waveguide. In order to calculate the\noverall phase, vectorial addition was performed for all the\npropagating modes inside the waveguide. Since each\nmode is attenuated to a different degree, its contribution\nmust be weighted by a weight wi and the attenuation con-\nstant \u0014:\nH\u0007 j\u0006\b \u0004 \u000e\ni\u00041\nm\u0002n\nwi\fexp\t\u0003\u0014 i\u0007\u0006\b2d\nexp\t j\u0011 i\u0007\u0006\b\n\r. (10)\nFigure 6(a) is a plot of the measured and theoretical\nphase differences \u0015\u0011m and \u0015\u0011th , respectively, for the five\ndifferent WR-8 waveguide samples with the shortest\nsample as the zero phase reference and the consecutive\nwaveguide lengths as samples. It can be observed that\nthe measured slope for each consecutive waveguide\nlength is an integral multiple of the slope of the shorter\nwaveguide. The same procedure was followed for the\nreduced-height micromachined waveguides [Fig. 6(b)],\nwhere a unit length of 5\u0005g was used for the background\ninterferogram and successive waveguide lengths of 6\u0005g ,\n7\u0005g , and 8\u0005g have been used as samples. This is in good\nagreement with the theoretical calculations, showing that\nthe focused THz pulse couples well to the test port and ex-\ncites the fundamental TE10 mode. This is a consequence\nof the focusing action of the parabolic reflector that pref-\nerentially couples to the TE10 mode as well as the filtering\naction of the grid to the modes that have a cross-polar\ncomponent. Such a conclusion is further supported from\ncalculations of theoretical phase delay assuming all\nmodes up to 3 THz propagate through the structures and\nthat there is equal power in each mode that deviates from\nthe experimental values. The theoretical calculations\nimply that most of the power is distributed among two\nmodes, and thus a fourth-order model should be adopted\nfor the backshort experiment. In a similar manner, a\nsixth-order model corresponding to three waveguide\nmodes was adopted for the analysis of the micromachined\nwaveguide data.\nCareful examination of the phase velocity of the re-\nceived signal for the WR-8 short as well as for the micro-\nmachined waveguides shows that the propagation of THz\npulses inside the waveguide is almost dispersion free\nwithin the bandwidth of the excitation pulse, indicating\nthat the micromachining technique employed in the con-\nstruction of the waveguides is capable of producing inter-\nnal waveguide surfaces with sufficiently fine tolerances to\nsupport frequencies well above 200 GHz. Such results\nare also in good agreement with the high-quality surface\nfinish observed in TEM pictures.21 It is worth noting\nthat most recently,25 Grischkowsky’s group has also ob-\nserved dispersion-free propagation of THz pulses in wave-\nguide structures.\nThe a priori assumption on the number of modes propa-\ngating in the structure, as well as the hypothesis of expo-\nnential decay of each mode (energy dissipation), implies\nthat the ARX model has a low-pass filtering effect in the\noriginal data set. This implies that using a parametric\nmodel to represent the waveguide has the added advan-\ntage of reducing the number of coefficients that need to be\nobtained. In fact, the process of ratioing spectra to ob-\ntain the complex insertion loss corresponds to identifying\nN\/2 complex-valued Fourier coefficients, whereas in the\nidentification procedure, only na \u0002 nb real-valued param-\nFig. 6. (a) Consecutive phase measurements with the first back-\nshort position (1 mm) used as a background interferogram and\nbackshort positions at 2 mm, 3 mm, 4 mm, and 5 mm treated as\nsamples; (b) phase measurements for reduced-height microma-\nchined waveguides with the 5\u0005g sample used for the background\ninterferogram and consecutive lengths as samples. Dashed\ncurves represent simulated results assuming the TE10 mode only\npropagating through the structure.\nHadjiloucas et al. Vol. 20, No. 2 \/February 2003 \/J. Opt. Soc. Am. B 395\neters are involved. This reduction in the number of de-\nscriptive elements results in an improvement in the con-\nfidence of the estimation, since the ratio between the\nnumber of experimental data to the number of unknowns\nincreases. A parallel can be traced to the improvement\nin the signal-to-noise ratio that is enjoyed when the num-\nber of spectral bins is decreased with boxcar filtering. In\nthis sense, the identification procedure can be regarded as\na filtering process, which reduces the number of features\nto be estimated.\n4. WAVELET-TRANSFORM FILTERING\nBefore the identification procedures, the signals were\nmean centered, and the wavelet transform was used for\nfiltering. For this purpose, a decomposition with the db4\nmother wavelet37,38 with two scale levels was employed\n(Fig. 7). The wavelet transform of the discrete signal\nrepresenting the reflection signatures in the time domain\nf(t) with N points was written as\nWf\u0007a, b \b \u0004 \u000e\nt\u00040\nN\u00031\nf\u0007t \b\u0016a,b\u0007t \b, (11)\nwhere the wavelet function \u0016a,b(t) was built from a\nmother wavelet function \u0016 (t):\n\u0016a,b\u0007t \b \u0004\n1\n\u0002a\n\u0016\u0003 t \u0003 ba \u0004 , (12)\nwhere subscript a \u0002 R* is now the ‘‘scale’’ (or ‘‘dilation’’)\nthat determines the width of the wavelet and subscript\nb \u0002 R defines the position of the wavelet in time. Pa-\nrameters a and b were discretized in the following man-\nner: a \u0004 2 j, b \u0004 j2k, where j and k are integer num-\nbers. The transform result yields the discrete\nwavelet-transform coefficients, which are indexed by j\n(scale level) and k (translation index). A threshold of\n0.01 times the largest wavelet coefficient was adopted in\nthe filtering procedure, and the inverse wavelet transform\nwas then employed. The effect of such filtering is shown\nin Fig. 8. The fast wavelet transform was implemented\naccording to Mallat’s filter-bank algorithm.39 Wavelet fil-\ntering was preferred because it is known to yield better\nresults than conventional filters (such as boxcar, moving\naverage, Fourier, or dynamic filters) when the frequency\ncontent of the signal changes with time.40–43 This is the\ncase in our experiments, where some waveguide modes\ndie out quicker than others.\n5. RESULTS\nThe System Identification Toolbox of Matlab 5.3 was used\nto obtain models in the form of Eq. (4). Figure 9(a) shows\nthe insertion loss of a unit-length waveguide (as calcu-\nlated by the ARX model) after ratioing the spectra ob-\ntained with the backshort adjusted to 3 mm with that at 2\nmm. These results are similar to those obtained after ra-\ntioing spectra with the backshort positioned at 5 and 4\nmm, respectively. Results corresponding to the effective\ninsertion loss due to two unit lengths of waveguide are\nalso shown. Taking into account the confidence levels\n(one sigma) of the identification procedure, the results\nshown in Fig. 9(b) are in agreement with the requirement\nthat the measured insertion loss for a two-unit length\nwaveguide should be equal to the squared value of that of\na single-unit waveguide. The measured time-domain re-\nsponse and the predicted response with a fourth-order\nARX model are in excellent agreement, as shown in Fig.\n10. The observed increased insertion loss at higher fre-\nquencies is attributed to the variation of the conductivity\nof gold with frequency.\nFigure 11(a) shows the autocorrelation values of the\nARX modeling residual \u000ek \u000b\tk\n\u000b\tk \u0003 x\n, where x is a\ntime shift between two points of the ARX residual se-\nquence and Fig. 11(b) shows the cross correlation\n\u000ek \u000b\tk\nu\tk \u0003 x\n between the modeling residual and the\ninput signal for different time shifts k. Ideally, the auto-\ncorrelation should be zero for delays different from zero\n(white noise), and there should be no cross correlation be-\ntween the residual and the input, since any correlation\nwould indicate that part of the residual could be predicted\nfrom the input. Since the autocorrelation of the residu-\nals is small, the assumption of whiteness in the noise can\nbe assumed to be valid. If colored noise were present, an\nautoregressive with moving average and exogenous input\n(ARMAX) model might provide a better description of the\ndata.\nResults for the micromachined waveguides after as-\nsuming that all the excitation energy is contained in three\npropagating modes are shown in Fig. 12(a). The inser-\ntion loss for one, two, and three waveguide lengths of mi-\ncromachined waveguides is calculated after a 5\u0005g-long\nwaveguide piece is used to record a background interfero-\ngram and 6\u0005g , 7\u0005g , and 8\u0005g waveguide lengths as\nsamples. The confidence levels (one sigma) of the identi-\nfication procedure are also shown [Fig. 12(b)].\nThe pole-zero charts in Fig. 13 and Fig. 14 provide\nmore details of the results obtained by the ARX model for\nFig. 7. Block diagram of the wavelet-transform filtering proce-\ndure. hd and gd are low-pass and high-pass decomposition fil-\nters, respectively, whereas hr and gr are their reconstruction\ncounterparts.\nFig. 8. (a) Original time-domain signature of the backshort and\n(b) the wavelet-transform filtered signal.\n396 J. Opt. Soc. Am. B\/Vol. 20, No. 2 \/February 2003 Hadjiloucas et al.\nthe backshort and micromachined waveguide cases, re-\nspectively. The horizontal and vertical axes represent\nthe respective real and imaginary parts of the poles and\nzeros in the complex plane. The dashed isoclines provide\nvalues of natural frequencies \u0006n and damping ratios \u000f for\nthe propagating modes. The isoclines are obtained from\nz \u0004 exp\tTs\u0007\u0003\u000f\u0006n \u0006 j\u0006n\u0002\u00071 \u0003 \u000f2\b\n, (13)\nwhere 0 \u0017 \u000f \u0017 1, \u0006n \u0010 0 by fixing \u000f and varying \u0006n or by\nfixing \u0006n and varying \u000f. It is worth noting that the con-\nfidence locus of the zeros is much larger than the confi-\ndence locus of the poles. This was to be expected, since it\nis easier to estimate poles than zeros, as the former are\nassociated with the exponential decay and frequency of\noscillation of the modes, whereas the zeros are associated\nwith the weights of each mode, which are intuitively more\ndifficult to obtain. In addition, if more modes were as-\nsumed in the model, the radii of the confidence zones of\nthe poles and zeros would increase, since the number of\nunknowns would be larger, for the same number of obser-\nvations. The inset in Fig. 13 shows that the confidence\nlevels in the model decrease significantly when the model\nis overparametrized. Since the autocorrelation function\nof the residual is within the one standard error bounds, it\ncan be concluded that the model is appropriate to describe\nthe data set.\nFigure 14 shows a pole-zero chart depicting the three\npropagating modes described by the ARX model inside an\nantenna-coupled reduced-height waveguide when a wave-\nguide length of 5\u0005g is used as a background and a wave-\nguide length of 6\u0005g is used as a sample. Results after ra-\ntioing the 8\u0005g to the 6\u0005g waveguide lengths are also\nshown, as well as the one sigma confidence limits of the\nmodel. The symmetry around the horizontal axis is be-\ncause the poles and zeros appear as conjugate pairs. It is\nworth noting that the poles are similar in both cases, but\nFig. 9. (a) Calculated transmission coefficient of a unit-length\nand a two-unit-length waveguide for the backshort and (b) confi-\ndence levels (one sigma) of the identification procedure.\nFig. 10. Measured (thin curve) time-domain response for the\nd3 \/d2 case and predicted (thick curve) response with a fourth-\norder model.\nFig. 11. Residual statistics for the d3 \/d2 case, with a fourth-\norder model. The autocorrelation values (a) of the modeling re-\nsidual \u000b\tk\n and (b) the cross correlation between the modeling re-\nsidual and the input signal. The dashed curves are the bounds\nof the region in which the residual statistics should be with a\n68% confidence level (one sigma) for a conveniently chosen model\nstructure.\nFig. 12. (a) Calculated transmission coefficient of a waveguide\nof unit length of reduced height and (b) confidence levels (one\nsigma around the d5 \/d6 curve) of the identification procedure.\nFig. 13. Pole-zero diagram for the d3 \/d2 backshort case, with a\nfourth-order model. The over-parameterized sixth-order model\nin the inset is also shown for illustrative purposes.\nHadjiloucas et al. Vol. 20, No. 2 \/February 2003 \/J. Opt. Soc. Am. B 397\nthe same is not true for the zeros. In fact, some of the\nzeros are outside the unit circle, which is the stability\nboundary in the z domain. This would imply that the\ncorresponding mode may initially oscillate in the opposite\ndirection of the excitation pulse (‘‘undershoot’’). How-\never, it is possible that those zeros ended up outside the\nunit circle due to numerical artifacts. In fact, since their\nuncertainty region is large, their actual position could\nwell be inside the circle.\nAt each frequency \u0006, the energy of a wave traveling in\nthe waveguide is attenuated by a factor \u0002H( j\u0006)\u0002 when it\npasses twice through a waveguide section of unit length.\nHence after traveling a distance d, the energy will have\ndecayed by a factor \u0002H( j\u0006)\u0002d\/2 \u0004 exp\tlog(\u0002H( j\u0006)\u0002d\/2)\n\n\u0004 exp\t\u00030.5d log(\u0002H( j\u0006)\u0002\u00031)\n. Thus the magnitude of\nthe propagation constant at frequency \u0006 is seen to be\nequal to \tlog(\u0002H( j\u0006)\u0002\u00031)\n\/4. An effective propagation\nconstant for the multimode propagation can therefore be\ncalculated as shown in Fig. 15. The weights of the modes\nassumed to be propagating in the structure calculated\nfrom the ARX model are shown in Table 1. The magni-\ntude of the propagation constant for each mode could be\ninferred from each partial fraction in Eq. (6).\n6. CONCLUSIONS\nA quasi-optical de-embedding technique for characteriz-\ning micromachined waveguides with cut-on frequencies\n\u0007100 GHz is demonstrated with wideband time-resolved\nterahertz spectroscopy. A transfer-function representa-\ntion is adopted for the description of the relation between\nthe signals in the input and output ports of the\nwaveguides. The time-domain responses were dis-\ncretized, and the waveguide transfer function was ob-\ntained through a parametric approach in the z domain af-\nter describing the system with an ARX model. Before the\nidentification procedure, filtering was performed in the\nwavelet domain to minimize signal distortion and the\nnoise propagating in the ARX model. The model identi-\nfication procedure requires isolating the phase delay in\nthe structure, and therefore the time-domain signatures\nmust be first aligned with respect to each other before\nthey are compared. The model also requires an a priori\nassumption of the number of modes propagating in the\nstructure. An initial estimate on the number of modes\npropagating in the structure was provided by comparing\nthe measured phase delay in the structure with theoreti-\ncal calculations that take into account the physical di-\nmensions of the waveguide. Parsimony arguments were\nalso used to minimize the risk of overfitting the model pa-\nrameters. Overparametrized models can be easily iden-\ntified in a pole-zero diagram, as the one sigma confidence\nlevel for such models increases significantly. The direct\nrelation between the complex insertion loss function com-\nmonly measured in THz spectroscopy and the polynomial\nrepresentation of the ARX model were explicitly shown.\nThe modeling procedure was also described within the\nframework of filtering. The advantages of exciting the\nstructure with a spectrally rich source (a femtosecond\npulse) were discussed within the framework of the identi-\nfication procedure. Measurements for a precision WR-8\nwaveguide adjustable short as well as for G-band\nreduced-height micromachined waveguides are pre-\nsented.\nAPPENDIX A: TREATMENT OF MULTIPLE\nREFLECTIONS\nAny significant impedance mismatch in the antenna\/\nwaveguide structure should result in multiple-reflection\nsignatures that would appear separated in the time do-\nmain by distances 4n¯d as shown in Fig. 16:\nFig. 14. Pole-zero chart of three propagating modes in an\nantenna-coupled reduced-height waveguide when a waveguide\nlength of 5\u0005g is used as a background and a waveguide length of\n6\u0005g is used as a sample (the limits of the 68% confidence loci for\nthe zeros are represented as ellipses in a thick curve). Results\nafter ratioing the 8\u0005g to the 6\u0005g waveguide lengths are also\nshown (in this case the confidence loci for the zeros are repre-\nsented as ellipses in a thin curve).\nFig. 15. Calculation of the effective (multimoded) magnitude of\nthe propagation constant for a micromachined waveguide of unit\nlength \u0005g .\nTable 1. Mode Characteristics Calculated with\nthe ARX Model for the d5 Õd6 Data Seta\nMode Poles \u0002w\u0002% f c1 c2\n1 0.9682; 0.9613 74.91 \u00030.998 \u00032.073 1.074\n2 0.5114 \u0006 0.6539j 6.94 1.923 \u00031.484 1.451\n3 \u0003 0.3235 \u0006 0.7585j 18.15 0.069 0.951 1.471\naCoefficients relate to Eq. (6), and mode weights are expressed as per-\ncentages of excitation.\n398 J. Opt. Soc. Am. B\/Vol. 20, No. 2 \/February 2003 Hadjiloucas et al.\nS0\u0007 j\u0006\b \u0004 P\u0007 j\u0006\bR12\u0007 j\u0006\b,\nS1\u0007 j\u0006\b \u0004 P\u0007 j\u0006\bT12\n2\u0007 j\u0006\bR23\u0007 j\u0006\b,\nS2\u0007 j\u0006\b \u0004 P\u0007 j\u0006\bT12\n2\u0007 j\u0006\bR23\n2\u0007 j\u0006\bR12\u0007 j\u0006\b, (A1)\nS3\u0007 j\u0006\b \u0004 P\u0007 j\u0006\bT12\n2\u0007 j\u0006\bT23\n2\u0007 j\u0006\bH\u0007 j\u0006\b,\nS4\u0007 j\u0006\b \u0004 P\u0007 j\u0006\bT12\n2\u0007 j\u0006\bT23\n2\u0007 j\u0006\bR23\u0007 j\u0006\bH\n2\u0007 j\u0006\b.\nAfter estimating H( j\u0006) by inserting different waveguide\nlengths, the fractions\nS0\u0007 j\u0006\b\nS1\u0007 j\u0006\b\n,\nS2\u0007 j\u0006\b\nS1\u0007 j\u0006\b\n,\nS3\u0007 j\u0006\b\nS2\u0007 j\u0006\b\n,\nS4\u0007 j\u0006\b\nS3\u0007 j\u0006\b\ncan be used to calculate R12( j\u0006), R23( j\u0006), T12( j\u0006),\nT23( j\u0006). These fractions can be obtained by ARX para-\nmetric identification; that is, instead of ratioing Si\u00021( j\u0006)\nagainst Si( j\u0006), we are identifying a linear system that\nhas an output y(t) \u0004 si\u00021(t) for an input u(t) \u0004 si(t).\nOne can also write\nH\u0007 j\u0006\b \u0004\nS5\u0007 j\u0006\b\nS4\u0007 j\u0006\b\n1\nR23\u0007 j\u0006\b\n(A2)\nto obtain a new estimate of H( j\u0006) from the multiple-\nreflection signatures S4( j\u0006) and S5( j\u0006). If this new es-\ntimate is substantially different from the one originally\nobtained, the process of estimating R12( j\u0006), R23( j\u0006),\nT12( j\u0006), and T23( j\u0006) would be repeated.\nAPPENDIX B: ANALOGY BETWEEN AN\nAUTOREGRESSIVE WITH EXOGENOUS\nINPUT MODEL AND A DISPERSIVE\nFOURIER-TRANSFORM SPECTROMETER\nWith reference to Eq. (5), dropping the z\u0003k term and fac-\ntorizing the denominator,\nH\u0007z \b \u0004 \u000e\ni\u00041\nn\u0002m\nwi\n1 \u0002 fiz\n\u00031\n\u00071 \u0003 pi1z\n\u00031\b\u00071 \u0003 pi2z\n\u00031\b\n, (B1)\nwhere \f pi1 , pi2\r, i \u0004 1 ... na\/2, are the roots (the poles of\nthe transfer function) of D(z). Let \u0018 i(z) \u0004 H(z)(1\n\u0003 pi1z\n\u00031)(1 \u0003 pi2z\n\u00031); then \u0018 i( pi1) \u0004 wi(1 \u0002 fi pi1\n\u00031),\nsince all other terms vanish if there are no multiple poles.\nSimilarly, \u0018 i( pi2) \u0004 wi(1 \u0002 fi pi2\n\u00031), and therefore a sys-\ntem of two equations with two unknowns (wi and fi) can\nbe solved. Setting\nH\u0007z \b\u0002z\u0004exp\u0007 j\u0006Ts\b\n\u0004 \u000e\ni\u00041\nn\u0002m\nwi\n1 \u0002 fi exp\u0007\u0003j\u0006Ts\b\n1 \u0002 ci1 exp\u0007\u0003j\u0006Ts\b \u0002 ci2 exp\u0007\u00032j\u0006Ts\b\n\u0004 \u000e\ni\u00041\nn\u0002m\n\u0007\u0014 i \u0002 j\u0019 i\b \u0004 A exp\u0007 j\u0012 \b, (B2)\nit follows that\nThis formulation of the problem directly relates the ARX\nmodel identification procedure to the more familiar equa-\ntions for the complex insertion loss commonly used in\nDFTS.\nAPPENDIX C: AUTOREGRESSIVE WITH\nEXOGENOUS INPUT IDENTIFICATION\nPROCEDURE\nLet y\tk\n and u\tk\n, \fk \u0004 1 ... N\r, be the signals measured\nfor the longer and shorter waveguides, respectively. Let\nalso\n\u0002 \u0004 \t\u0003a1 \u0003a2 ¯ \u0003ana b1 b2 ¯ bnb\nT (C1)\n(where T signifies the transpose) be the vector of model\ncoefficients and\nFig. 16. Multiple reflections due to impedance mismatch be-\ntween air–antenna and antenna–waveguide interfaces.\nH\u0007 j\u0006\b \u0004 \u000e\ni\u00041\nn\u0002m\nwi\n\t1 \u0002 fi cos\u0007\u0006Ts\b\n \u0003 jfi sin\u0007\u0006Ts\b\n\t1 \u0002 ci1 cos\u0007\u0006Ts\b \u0002 ci2 cos\u00072\u0006Ts\b\n \u0003 j\tci1 sin\u0007\u0006Ts\b \u0002 ci2 sin\u00072\u0006Ts\b\n\n, (B3)\nA \u0004\u0002\u0003 \u000e\ni\u00041\nm\u0002n\n\u0014 i\u0004 2 \u0002 \u0003 \u000e\ni\u00041\nm\u0002n\n\u0019 i\u0004 2, (B4)\n\u0012 \u0004 a tan\u0003 \u000e\ni\u00041\nm\u0002n\n\u0019 i\u0005 \u000e\ni\u00041\nm\u0002n\n\u0014 i\u0004 , (B5)\n\u0014 i \u0004 wi\n\t1 \u0002 fi cos\u0007\u0006Ts\b\n\t1 \u0002 ci1 cos\u0007\u0006Ts\b \u0002 ci2 cos\u00072\u0006Ts\b\n \u0002 fi sin\u0007\u0006Ts\b\tci1 sin\u0007\u0006Ts\b \u0002 ci2 sin\u00072\u0006Ts\b\n\n\t1 \u0002 ci1 cos\u0007\u0006Ts\b \u0002 ci2 cos\u00072\u0006Ts\b\n\n2 \u0002 \tci1 sin\u0007\u0006Ts\b \u0002 ci2 sin\u00072\u0006Ts\b\n\n2 , (B6)\n\u0019 i \u0004 wi\n\t1 \u0002 fi cos\u0007\u0006Ts\b\n\tci1 sin\u0007\u0006Ts\b \u0002 ci2 sin\u00072\u0006Ts\b\n \u0003 fi sin\u0007\u0006Ts\b\t1 \u0002 ci1 cos\u0007\u0006Ts\b \u0002 ci2 cos\u00072\u0006Ts\b\n\n\t1 \u0002 ci1 cos\u0007\u0006Ts\b \u0002 ci2 cos\u00072\u0006Ts\b\n\n2 \u0002 \tci1 sin\u0007\u0006Ts\b \u0002 ci2 sin\u00072\u0006Ts\b\n\n2 .\n(B7)\nHadjiloucas et al. Vol. 20, No. 2 \/February 2003 \/J. Opt. Soc. Am. B 399\nbe the matrix of regressors. It is then possible to write\nyˆ \u0004 \u0003\u0002, where\nyˆ\u0007N\u0003na\b\u00051 \u0004 \t yˆ\tna \u0002 1\n yˆ\tna \u0002 2\n ¯ yˆ\tN\n\nT,\n(C3)\nwhere the hat denotes an estimated value. In this man-\nner, a vector of prediction errors can be written as \u0004 \u0004 y\n\u0003 \u0003\u0002, where\ny\u0007N\u0003na\b\u00051 \u0004 \t y\tna \u0002 1\n y\tna \u0002 2\n ¯ y\tN\n\nT.\n(C4)\nLeast-squares estimation consists of minimizing the sum\nof the squared errors, given by J \u0004 \u0004T\u0004, with respect to \u0002\n(i.e., \u001aJ\/\u001a\u0002 \u0004 0). The result is the least-squares esti-\nmate of \u0002, denoted by \u0002ˆ, which is obtained as \u0002ˆ\n\u0004 (\u0003T\u0003)\u00031\u0003Ty, provided \u0003T\u0003 is nonsingular. The\nstandard error of the estimate \u0002ˆ is given by the square\nroot of the diagonal elements of matrix S, given by\nS \u0004 \u0007\u0003T\u0003\b\u00031\u0006 \u0007y \u0003 yˆ\bT\u0007y \u0003 yˆ\b\n\u0007N \u0003 na\b \u0003 \u0007na \u0002 nb\b\n\u0007 , (C5)\nwhere yˆ \u0004 \u0003\u0002ˆ. The term in square brackets in Eq. (C5)\nis the square of the standard error of the estimate for y,\nadjusted for the number of observations (N \u0003 na) in the\ntime domain and estimated variables (na \u0002 nb). It is\nworth noting that the influence of noise in the estimation\nprocess will be reduced if there is not too much collinear-\nity between the columns of \u0003. This translates into the\nfollowing requirements:\n(a) The length of the waveguide inserted must be large\nenough to produce a detectable difference between signals\ny and u.\n(b) The values of u should not be strongly correlated to\ntheir past values. This is ensured if u has a rich spectral\ncontent. For instance, if u is a sinusoid, u\tk\n is a linear\ncombination of u\tk \u0003 1\n and u\tk \u0003 2\n, for all k. If u is a\ncombination of sinusoids of two different frequencies,\nu\tk\n is a linear combination of u\tk \u0003 1\n ,..., u\tk \u0003 4\n.\nIt is then seen that, the larger the number of frequencies\npresent at u, the larger the number of columns that can\nbe placed in the u part of \u0003.\n(c) The values of y should not be strongly correlated to\ntheir past values. Correlations of this sort can arise,\neven if u is spectrally rich, because the system may filter\nout some frequencies (low-pass action). Problems may\nthen arise if the number of columns in the y part of \u0003\n(model order na) is too large (overparametrization).\nACKNOWLEDGMENTS\nS. Hadjiloucas and H. P. M. Pellemans would like to ac-\nknowledge financial support from the European Commu-\nnity through the Training and Mobility of Researchers\ngrant FMRX-CT96-0092. R. K. H. Galva˜o was supported\nby Fundac¸a˜o de Amparo a` Pesquisa do Estado de Sa˜o\nPaulo under postdoctorate grant 00\/09390-6.\nREFERENCES\n1. R. W. Beatty, G. F. Engen, and W. J. Anson, ‘‘Measurement\nof reflection and losses of waveguide joints and connectors\nusing microwave reflectometer techniques,’’ IRE Trans. In-\nstrum. 9, 219–226 (1960).\n2. G. F. Engen, ‘‘An extension to the sliding short method of\nconnector and adapter evaluation,’’ J. Res. Natl. Bur. Stand.\n75, 177–183 (1971).\n3. M. P. Weidman, ‘‘A semi-automated six port for measuring\nmillimeter-wave power and complex reflection coefficient,’’\nIEEE Trans. Microwave Theory Tech. 25, 1083–1085\n(1977).\n4. G. F. Engen, ‘‘The six port reflectometer: an alternative\nnetwork analyzer,’’ IEEE Trans. Microwave Theory Tech.\n25, 1075–1083 (1977).\n5. G. F. Engen, ‘‘A (historical) review of the six-port measure-\nment technique,’’ IEEE Trans. Microwave Theory Tech. 45,\n2414–2417 (1997).\n6. G. F. Engen, ‘‘Calibration of an arbitrary six-port junction\nfor measurement of active and passive circuit parameters,’’\nIEEE Trans. Instrum. Meas. 22, 295–299 (1973).\n7. G. F. Engen, ‘‘Calibrating the six-port reflectometer by\nmeans of sliding terminations,’’ IEEE Trans. Microwave\nTheory Tech. 26, 951–957 (1978).\n8. T. E. Hodgetts, ‘‘A numerically stable algorithm for calibrat-\ning single six-ports for national microwave reflectometry,’’\nNPL Rep. DES 102 (National Physical Laboratory, Tedding-\nton, UK, 1990).\n9. H. J. Eul and B. Schiek, ‘‘A generalized theory and new cali-\nbration procedures for network analyzer self-calibration,’’\nIEEE Trans. Microwave Theory Tech. 39, 724–731 (1991).\n10. K. J. Silvonen, ‘‘A general approach to network analyzer\ncalibration,’’ IEEE Trans. Microwave Theory Tech. 40, 754–\n759 (1992).\n11. G. F. Engen and C. A. Hoer, ‘‘Thru-Reflect-Line: an im-\nproved technique for calibrating the dual six-port automatic\nnetwork analyzer,’’ IEEE Trans. Microwave Theory Tech.\n27, 987–993 (1979).\n12. G. F. Engen, ‘‘Calibration technique for automated network\nanalyzers with application to adapter evaluation,’’ IEEE\nTrans. Microwave Theory Tech. 22, 1255–1260 (1974).\n13. C. A. Hoer, ‘‘Performance of a dual six port network ana-\nlyzer,’’ IEEE Trans. Microwave Theory Tech. 27, 993–998\n(1979).\n14. B. Knudsen, G. F. Engen, and B. Guldbrandsen, ‘‘Accuracy\nassessment of the scalar network analyzer using sliding\ntermination techniques,’’ IEEE Trans. Instrum. Meas. 38,\n480–483 (1989).\n15. D. J. Bannister, E. J. Griffin, and T. E. Hodgetts, ‘‘On the\ndimensional tolerances of rectangular waveguide for reflec-\ntometry at millimetric wavelengths,’’ NPL Rep. DES 95\n(National Physical Laboratory, Teddington, UK, 1989).\n16. J. R. Birch and R. N. Clarke, ‘‘Dielectric and optical mea-\nsurements from 30 to 1000 GHz,’’ J. Inst. Electron. Rad.\nEng. 52, 565–584 (1982).\n17. L. C. Oldfield, J. P. Ide, and E. J. Griffin, ‘‘A multistate re-\nflectometer,’’ IEEE Trans. Instrum. Meas. 25, 198–201\n(1985).\n18. D. Thompson, R. D. Pollard, and R. E. Miles, ‘‘One-port\n\u0003\u0007N\u0003na\b\u0005\u0007na\u0002nb\b \u0004 \u0006 y\tna\n y\tna \u0003 1\n ¯ y\t1\n u\tna\n u\tna \u0003 1\n ¯ u\tna \u0003 nb \u0002 1\ny\tna \u0002 1\n y\tna\n ¯ y\t2\n u\tna \u0002 1\n u\tna\n ¯ u\tna \u0003 nb \u0002 2\n] ] ¯ ] ] ] ¯ ]\ny\tN \u0003 1\n y\tN \u0003 2\n ¯ y\tN \u0003 na\n u\tN \u0003 1\n u\tN \u0003 2\n ¯ u\tN \u0003 nb\n\n\u0007 (C2)\n400 J. Opt. Soc. Am. B\/Vol. 20, No. 2 \/February 2003 Hadjiloucas et al.\nS-parameter measurements using quasi-optical multistate\nreflectometer,’’ Electron. Lett. 34, 1222–1224 (1998).\n19. S. Hadjiloucas, J. W. Bowen, J. W. Digby, J. M. Chamber-\nlain, and D. P. Steenson, ‘‘Quasi-optical characterization of\nwaveguides at frequencies above 100 GHz,’’ J. M. Chamber-\nlain and P. Harrison, eds., Conference on Terahertz Spec-\ntroscopy and Applications, Munich, Proc. SPIE 3828, 357–\n365 (1999).\n20. J. W. Bowen, S. Hadjiloucas, and L. S. Karatzas, ‘‘Charac-\nteristic impedance measurements of a WR-10 waveguide\nsample with a dispersive Fourier transform spectrometer,’’\nin Applied Optics and Optoelectronics, A. T. Augousti, ed.\n(Institute of Physics, Bristol, UK, 1998), pp. 181–186.\n21. J. W. Digby, C. E. McIntosh, G. M. Parkhurst, B. M. Towl-\nson, S. Hadjiloucas, J. W. Bowen, J. M. Chamberlain, R. D.\nPollard, R. E. Miles, D. P. Steenson, L. S. Karatzas, N. J.\nCronin, and S. R. Davies, ‘‘Fabrication and characterization\nof micro-machined rectangular waveguide components for\nuse at millimeter wave and terahertz frequencies,’’ IEEE\nTrans. Microwave Theory Tech. 48, 1293–1303 (2000).\n22. R. W. McGowan, G. Gallot, and D. Grischkowsky, ‘‘Propaga-\ntion of ultra-wideband, short Pulses of THz radiation\nthrough sub-mm diameter circular waveguides,’’ Opt. Lett.\n24, 1431–1433 (1999).\n23. G. Gallot, S. P. Jamison, R. W. McGowan, and D. Grisch-\nkowsky, ‘‘THz waveguides,’’ J. Opt. Soc. Am. B 17, 851–863\n(2000).\n24. D. Grischkowsky, ‘‘Optoelectronic characterization of trans-\nmission lines and waveguides by THz time-domain spec-\ntroscopy,’’ IEEE J. Sel. Top. Quantum Electron. 6, 1122–\n1135 (2000).\n25. S. P. Jamison, R. W. McGowan, and D. Grischkowsky,\n‘‘Single-mode waveguide propagation and reshaping of\nsub-ps terahertz pulses in sapphire fibers,’’ Appl. Phys.\nLett. 76, 1987–1989 (2000).\n26. R. Mendis and D. Grischkowsky, ‘‘Plastic ribbon THz\nwaveguides,’’ J. Appl. Phys. 88, 4449–4451 (2000).\n27. R. Mendis and D. Grischkowsky, ‘‘Undistorted guided wave\npropagation of subpicosecond THz pulses,’’ Opt. Lett. 26,\n846–848 (2001).\n28. P. R. Smith, D. H. Auston, and M. C. Nuss, ‘‘Subpicosecond\nphotoconducting dipole antennas,’’ IEEE J. Quantum Elec-\ntron. 24, 255–260 (1988).\n29. M. C. Nuss and J. Orenstein, ‘‘Millimeter and submillime-\nter wave spectroscopy of solids,’’ in Topics Current Chemis-\ntry, E. Gru¨ner, ed. (Springer-Verlag, Heidelberg 1998), Vol.\n74, pp. 7–50.\n30. P. Haring Bolivar, ‘‘Coherent THz spectroscopy,’’ in Semi-\nconductor Quantum Optoelectronics: From Quantum\nPhysics to Smart Devices, A. Miller, M. Ebrahimzahdeh,\nand D. M. Finlayson, eds. (Institute of Physics, Bristol, UK,\n1999), Chap. 5, pp. 151–192.\n31. P. Haring Bolı´var, M. Brucherseifer, H. P. M. Pellemans,\nand H. Kurz, ‘‘Time domain THz spectroscopy and sensing,’’\nin THz Sources and Systems, R. E. Miles, P. Harrison, and\nD. Lippens, eds. (Kluwer Academic, Dordrecht, The Nether-\nlands, 2001), pp. 315–328.\n32. S. M. Kay and S. L. Marple, Jr., ‘‘Spectrum analysis, a mod-\nern perspective,’’ Proc. IEEE 69, 1380–1419 (1981).\n33. S. T. D. Dorney, R. G. Barasniuk, and D. M. Mittleman,\n‘‘Material parameter estimation with terahertz time-\ndomain spectroscopy,’’ J. Opt. Soc. Am. A 18, 1562–1571\n(2001).\n34. L. Ljung, System Identification, Theory for the User, 2nd ed.\n(Prentice Hall, Upper Saddle River, N.J., 1999).\n35. J. R. Birch and T. J. Parker, ‘‘Dispersive Fourier transform\nspectrometry,’’ in Infrared and Millimeter Waves, K. J. But-\nton, ed. (Academic, Orlando, Fla., 1979), Vol. 2, Chap. 3, pp.\n137–271.\n36. N. Marcuvitz, Waveguide Handbook (Peregrinus, London,\n1993).\n37. I. Daubechies, Ten Lectures on Wavelets (Society for Indus-\ntrial and Applied Mathematics, Philadelphia, 1992).\n38. M. Misiti, Y. Misiti, G. Oppenheim, and J. M. Poggi, Wavelet\nToolbox User’s Guide (Mathworks, Natick, Mass., 1996).\n39. S. G. Mallat, ‘‘A theory for multiresolution signal decompo-\nsition: the wavelet representation,’’ IEEE Pattern Anal.\n11, 674–693 (1989).\n40. H. Krim, D. Tucker, S. G. Mallat, and D. Donoho, ‘‘On de-\nnoising and best signal representation,’’ IEEE Trans. Inf.\nTheory 45, 2225–2238 (1999).\n41. I. Daubechies, S. Mallat, and A. S. Willsky, ‘‘Special issue on\nwavelet transforms and multiresolution signal analysis:\nintroduction,’’ IEEE Trans. Inf. Theory 38, 529–531 (1992).\n42. S. Qian and D. Chen, Joint Time-Frequency Analysis—\nMethods and Applications (Prentice-Hall, Upper Saddle\nRiver, N.J., 1996).\n43. U. L. Pen, ‘‘Application of wavelets to filtering of noisy\ndata,’’ Philos. Trans. R. Soc. London, Ser. A 357, 2561–2571\n(1999).\nHadjiloucas et al. Vol. 20, No. 2 \/February 2003 \/J. Opt. Soc. Am. B 401\n"}