{"doi":"10.1111\/j.1467-9566.2007.01028.x","coreId":"69826","oai":"oai:eprints.lancs.ac.uk:21093","identifiers":["oai:eprints.lancs.ac.uk:21093","10.1111\/j.1467-9566.2007.01028.x"],"title":"Saying no to the staff: an analysis of refusals in a care home for people with severe communication difficulties.","authors":["Finlay, W. M. L.","Antaki, Charles","Walton, Chris"],"enrichments":{"references":[{"id":16339187,"title":"A","authors":[],"date":"1995","doi":"10.2307\/853961","raw":"Beach, W A (1995) Preserving and constraining options: &quot;okays&quot; and 'official priorities in medical interviews. In G H Morris and R J Chenial (eds) The Talk of the Clinic. Hillsdale, NJ: LEA Beamer, S. & Brookes, M. (2001) Making decisions: best practice and new ideas for supporting people with high support needs to make decisions. London: VIA Bradshaw, J. (2001) Complexity of staff communication and reported level of understanding skills in adults with intellectual disability. Journal of Intellectual Disability Research, 45, 233-243 Browder, D.M., Cooper, K.J. & Lim, L. (1998) Teaching adults with severe disabilities to express their choice of settings for leisure activities. Education and Training in Mental Retardation and Developmental Disabilities, 33, 228-238                                                                                                                Saying no to staff…. 23 Cooper, K.J. & Browder, D.M. (1998) Enhancing choice and participation for adults with severe disabilities in community-based instruction. Journal of the Association for People with Severe Handicaps, 23, 252-260 Department of Health (2005) Independence, well-being and choice: Our vision for the future of social care for adults in England. Green Paper – Consultation Document. London: HMSO Dersley, I., & Wootton, A. J. (2001). In the heat of the sequence: Interactional features receding walkouts from argumentative talk. Language in Society, 30, 611 Dowson, S. (1997). Empowerment within services: a comfortable delusion. In P. Ramcharan, G. Roberts, G. Grant & J. Borland (eds) Empowerment in everyday life: learning disability.","cites":null},{"id":16339243,"title":"A little book about person-centred planning.","authors":[],"date":"1988","doi":null,"raw":"O'Brien, J. & Lyle O'Brien, C. (1988). A little book about person-centred planning. Inclusion Press, Toronto.","cites":null},{"id":16339246,"title":"A simplest systematics for the organization of turn-taking for conversation.","authors":[],"date":"1974","doi":"10.2307\/412243","raw":"Sacks, H., Schegloff, E. A., & Jefferson, G. (1974). A simplest systematics for the organization of turn-taking for conversation. Language, 50, 696-735.","cites":null},{"id":16339250,"title":"Assessing opportunities for choice-making: a comparison of self- and staff reports.","authors":[],"date":"1995","doi":null,"raw":"Stancliffe, R.J. (1995) Assessing opportunities for choice-making: a comparison of self- and staff reports. American Journal on Mental Retardation, 99, 418-429 Stancliffe, R.J. (1997) Community living-unit size, staff presence, and residents’ choicemaking. Mental Retardation, 35, 1-9.","cites":null},{"id":16339242,"title":"Communications between staff and adults with intellectual disabilities in naturally occurring settings.","authors":[],"date":"1999","doi":"10.1046\/j.1365-2788.1999.00191.x","raw":"London: Jessica Kingsley McConkey, R., Morris, I. & Purcell, M. (1999) Communications between staff and adults with intellectual disabilities in naturally occurring settings. Journal of Intellectual Disability Research, 43, 194-205 Nozaki, K. & Mochizuki, A. (1995) Assessing choice making of a person with profound disabilities: a preliminary analysis. Journal of the Association for People with Severe Handicaps, 20, 196-201 O’Brian, J. & Lovett, H. (1993) Finding a way toward everyday lives: the contribution of person-centred planning. Harrisburg: Pennsylvania Department of Public Welfare.","cites":null},{"id":16339213,"title":"Conversation Analysis.","authors":[],"date":"1998","doi":"10.1177\/000169939904200305","raw":"Hutchby, I and Wooffitt, R (1998) Conversation Analysis. Oxford: Polity Press.","cites":null},{"id":16339241,"title":"Daily decisionmaking in community residences: a social comparison of adults with and without mental retardation.","authors":[],"date":"1988","doi":null,"raw":"Kishi, G., Teelucksingh, B., Zollers, N., Park-Lee, S. & Meyer, L. (1988) Daily decisionmaking in community residences: a social comparison of adults with and without mental retardation. American Journal on Mental Retardation, 92, 430-435 Learning Disability Taskforce (2004) Rights, independence, choice and inclusion. London: Learning Disability Taskforce Lovett, H. (1996) Learning to listen: positive approaches and people with difficult behaviour.","cites":null},{"id":16339249,"title":"Improving services, improving lives: evidence and key themes. Interim report. London: Office of the Deputy Prime Minister.","authors":[],"date":"2005","doi":null,"raw":"Social Exclusion Unit (2005) Improving services, improving lives: evidence and key themes. Interim report. London: Office of the Deputy Prime Minister.","cites":null},{"id":16339244,"title":"Improving the life chances of disabled people.","authors":[],"date":"2005","doi":"10.1108\/13663666200500022","raw":"Prime Minister’s Strategy Unit (2005) Improving the life chances of disabled people. London: HMSO.","cites":null},{"id":16339211,"title":"Interaction and the Standardised Survey Interview. Cambridge:","authors":[],"date":"2000","doi":"10.1017\/cbo9780511489457.001","raw":"Houtkoop-Steenstra, H (2000) Interaction and the Standardised Survey Interview. Cambridge: Cambridge University Press.","cites":null},{"id":16339251,"title":"Longitudinal study of deinstitutionalization and the exercise of choice. Mental Retardation, 35, 159-169 Saying no to staff…. 25","authors":[],"date":"1997","doi":"10.1352\/0047-6765(1997)035<0159:lsodat>2.0.co;2","raw":"Stancliffe, R.J. & Abery, B.H. (1997) Longitudinal study of deinstitutionalization and the exercise of choice. Mental Retardation, 35, 159-169                                                                                                                Saying no to staff…. 25 Stancliffe, R.J., Abery, B.H. & Smith, J. (2000) Personal control and the ecology of community living settings: beyond living-unit size and type. American Journal on Mental Retardation, 105, 431-454 Wareing, D and Newell, C (2005)  Commonsense and the doing of supported care: A case study Journal of Intellectual & Developmental Disability 30, 104 - 114 Wooffitt, R (2005) Conversation Analysis and Discourse Analysis. London and New York: Sage.","cites":null},{"id":16339184,"title":"NB authors' references are not included in this submission","authors":[],"date":"1994","doi":null,"raw":"[NB authors' references are not included in this submission draft] Antaki, C., 1994, Explaining and Arguing: The social organisation of accounts, London: Sage Bannerman, D.J., Sheldon, J.B., Sherman, J.A. & Harchik, A.E. (1990) Balancing the rights to habilitation with the right to personal liberties: the rights of people with developmental disabilities to eat too many doughnuts and take a nap. Journal of Applied Behavior Analysis, 23, 79-89.","cites":null},{"id":16339207,"title":"Opportunities to express preferences and make choices among students with severe disabilities in classroom settings.","authors":[],"date":"1987","doi":null,"raw":"Houghton, J., Bronicki, G.J.B. & Guess, D. (1987) Opportunities to express preferences and make choices among students with severe disabilities in classroom settings. Journal of the Association for People with Severe Handicaps, 12, 18-27.","cites":null},{"id":16339217,"title":"Preliminary notes on a possible metric which provides for a 'standard maximum' silence of approximately one second in conversation. In","authors":[],"date":"1988","doi":null,"raw":"Jefferson, G (1988) Preliminary notes on a possible metric which provides for a 'standard maximum' silence of approximately one second in conversation. In  D Roger and P Bull (eds) Conversation. Clevedon, England: Multilingual Matters Jenkinson, J.C. (1993) Who shall decide? The relevance of theory and research to decisionmaking by people with an intellectual disability. Disability, Handicap and Society, 8, 361-375                                                                                                                Saying no to staff…. 24 Jenkinson, J., Copeland, C., Drivas, B., Scoon, H., Yap, M.L. (1992) Decision-making by community residents with an intellectual disability. Australia and New Zealand Journal of Developmental Disabilities, 18, 1-8.","cites":null},{"id":16339247,"title":"Repair after next turn: the last structurally provided defense of intersubjectivity in conversation.","authors":[],"date":"1992","doi":"10.1086\/229903","raw":"Schegloff, E.A. (1992) Repair after next turn: the last structurally provided defense of intersubjectivity in conversation. American Journal of Sociology, 97, 1295-1345.","cites":null},{"id":16339252,"title":"Speech to and from a severely retarded young Down's syndrome child. In","authors":[],"date":"1989","doi":null,"raw":"Wootton, A (1989) Speech to and from a severely retarded young Down's syndrome child. In M. Beveridge, G, Conti-Ramsden, & I Leudar (eds) The language and communication of mentally handicapped people. London: Chapman-Hall.","cites":null},{"id":16339192,"title":"Studies in Ethnomethodology. Englewood Cliffs,","authors":[],"date":"1967","doi":"10.2307\/2574750","raw":"Garfinkel, H (1967) Studies in Ethnomethodology. Englewood Cliffs, NJ: Prentice Hall Guess, D., Benson, H.A. & Siegel-Causey, E. (1985) Concepts and issues related to choicemaking and autonomy among persons with severe disabilities. Journal of the Association for Persons with Severe Handicaps, 10, 79-86 Harris, J. (2003) Time to make up your mind: why choosing is difficult. British Journal of Learning Disabilities, 31, 3-8.","cites":null},{"id":16339195,"title":"The Resident Choice Scale: a measure to assess opportunities for self-determination in residential settings.","authors":[],"date":"2004","doi":"10.1111\/j.1365-2788.2004.00499.x","raw":"Hatton, C., Emerson, E., Robertson, J. Gregory, N., Kessissoglou, S. & Walsh, P.N. (2004) The Resident Choice Scale: a measure to assess opportunities for self-determination in residential settings. Journal of Intellectual Disability Research, 48, 103-113.","cites":null},{"id":16339245,"title":"The social construction of Intellectual disability.","authors":[],"date":"2004","doi":"10.1017\/cbo9780511489884","raw":"Rapley. M (2004) The social construction of Intellectual disability. Cambridge, England: Cambridge University Press.","cites":null},{"id":16339204,"title":"Valuing People: making things better (The Government’s annual report on Learning Disability,","authors":[],"date":"2005","doi":null,"raw":"HM Government (2005) Valuing People: making things better (The Government’s annual report on Learning Disability, 2005). Norwich: TSO Holt, L. and Drew, P. (1998) 'Figures of speech: idiomatic expressions and the management of topic transition in conversation', Language and Society 27(4): 495-522.","cites":null},{"id":16339189,"title":"Who’s in control?: decision-making by people with learning difficulties who have high support needs. London: Values Into Action.","authors":[],"date":"2001","doi":null,"raw":"London: Jessica Kingsley Edge, J. (2001) Who’s in control?: decision-making by people with learning difficulties who have high support needs. London: Values Into Action.","cites":null},{"id":16339248,"title":"Whose text? Whose context?&quot;,","authors":[],"date":"1997","doi":"10.1177\/0957926597008002002","raw":"Schegloff, E.A., 1997, &quot;Whose text? Whose context?&quot;, Discourse & Society, 8, pp.165-187.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-01","abstract":"People with severe communication difficulties may attempt to exercise control over their lives by verbally or non-verbally refusing an activity proposed by supporters. We detail examples in which such refusals are treated by care home staff as a temporary reluctance, warranting further attempts to persuade the individual to co-operate. We identify the following conversational (and bodily) practices by which staff achieve their institutional ends: appreciating a resident's behaviour as something other than refusal; formulating the invitation again in a no-blame format; minimising the task required; escalating the invitation to a request and an order; moving the person bodily; and positively glossing the proceedings. Dealing with refusals illustrates the dilemma faced by institutional personnel in health and care settings in accepting choices which might disrupt the efficient management of the service","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69826.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/21093\/1\/Saying_no_to_the_staff.pdf","pdfHashValue":"d898c0b6fbd4b6c488e47489c102821c90d3c6ef","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:21093<\/identifier><datestamp>\n      2018-01-24T02:35:45Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D42:4246<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Saying no to the staff: an analysis of refusals in a care home for people with severe communication difficulties.<\/dc:title><dc:creator>\n        Finlay, W. M. L.<\/dc:creator><dc:creator>\n        Antaki, Charles<\/dc:creator><dc:creator>\n        Walton, Chris<\/dc:creator><dc:subject>\n        BF Psychology<\/dc:subject><dc:description>\n        People with severe communication difficulties may attempt to exercise control over their lives by verbally or non-verbally refusing an activity proposed by supporters. We detail examples in which such refusals are treated by care home staff as a temporary reluctance, warranting further attempts to persuade the individual to co-operate. We identify the following conversational (and bodily) practices by which staff achieve their institutional ends: appreciating a resident's behaviour as something other than refusal; formulating the invitation again in a no-blame format; minimising the task required; escalating the invitation to a request and an order; moving the person bodily; and positively glossing the proceedings. Dealing with refusals illustrates the dilemma faced by institutional personnel in health and care settings in accepting choices which might disrupt the efficient management of the service.<\/dc:description><dc:date>\n        2008-01<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/21093\/1\/Saying_no_to_the_staff.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1111\/j.1467-9566.2007.01028.x<\/dc:relation><dc:identifier>\n        Finlay, W. M. L. and Antaki, Charles and Walton, Chris (2008) Saying no to the staff: an analysis of refusals in a care home for people with severe communication difficulties. Sociology of Health and Illness, 30 (1). pp. 55-75. ISSN 0141-9889<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/21093\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1111\/j.1467-9566.2007.01028.x","http:\/\/eprints.lancs.ac.uk\/21093\/"],"year":2008,"topics":["BF Psychology"],"subject":["Journal Article","PeerReviewed"],"fullText":"                                                                                                               Saying no to staff…. 0    \n 0\nSaying no to the staff: an analysis of refusals in a home for people with severe \ncommunication difficulties \n \n \nAbstract \nPeople with severe communication difficulties may attempt to exercise control \nover their lives by refusing an activity proposed by supporters. We detail examples in \nwhich such refusals are treated by service staff as a temporary reluctance, warranting \nfurther attempts to persuade the individual to cooperate. We identify the following \nconversational (and bodily) practices by which staff achieve their institutional ends: \nappreciating resident's behaviour as something other than refusal; formulating the \ninvitation again in a no-blame format; minimising the task required; escalating the \ninvitation to a request and an order; moving the person bodily; and positively glossing \nthe proceedings. Dealing with refusals illustrates the dilemma faced by institutional \npersonnel in accepting choices which might disrupt the efficient management of the \nservice. \n \n                                                                                                               Saying no to staff…. 1    \n 1\nSaying no to the staff: an analysis of refusals in a home for people with severe \ncommunication difficulties \nRecent government proposals on social exclusion and disability in the United \nKingdom stress that social care services should promote choice, control and \nempowerment (e.g. Department of Health, 2005; HM Government, 2005; Prime \nMinister’s Strategy Unit, 2005; Social Exclusion Unit, 2005). These concerns accord \nwith the notion of person-centred support based on work emanating from the U.S.A. \n(e.g. O’Brian & Lovett, 1993; O'Brien & Lyle O'Brien, 1988).  \nHowever, policy-makers also recognize that there are barriers to the promotion \nof empowerment in services. For example, the recent UK government report \nImproving the Life Chances of Disabled People (Prime Minister’s Strategy Unit, \n2005) discusses two main barriers: supports are often not fitted to the individual, \nrather disabled people are expected to fit into existing services (for examples see \nBeamer & Brooks, 2001); and services tend to focus on incapacity, inability and risk, \nwith the result that dependency is created. Indeed, this report identifies a ‘culture of \ncare and dependency’ (p73) in health and social care services in the UK, in which \nthose with ‘significant cognitive and\/or communication impairments are particularly \nat risk of being denied choice and control in their lives’ (p78; see Hatton et al, 2004; \nKishi, Teelucksingh, Zollers, Park-Lee & Meyer, 1988, Stancliffe, Abery & Smith, \n2000,  for further evidence).  \nThe problems in translating policy goals of choice and autonomy into practice \nfor people with learning difficulties have been discussed by many commentators (e.g. \nBeamer & Brookes, 2001; Dowson, 1997; Edge, 2001; Guess, Benson & Siegel-\nCausey, 1985; Harris, 2003; Jenkinson, 1993; Jenkinson et al, 1992; Kishi et al, 1988; \nLovett, 1996; Stalker & Harris, 1998). Even with changes in the ways services are \ncommissioned and the types of services available, without a sensitive workforce these \nbroader values will not be achieved (Department of Health, 2005; Social Exclusion \nUnit, 2005). This is particularly the case for those with multiple, complex support \nneeds, who reports have identified as benefiting least from current policy initiatives in \nthe UK (HM Government, 2005; Learning Disability Task Force, 2004).  \nChoice and control are issues that arise in the way people talk to each other, in \nwhich utterances are taken up and which are ignored, in how and what options are \noffered, in how preferences are expressed, how information is presented, how spaces \nare opened up for people to express preferences and how spaces are shut down. While \n                                                                                                               Saying no to staff…. 2    \n 2\nthis applies to all people with intellectual disabilities, the expression and recognition \nof preferences in everyday interactions are particularly important for people with \ncommunication difficulties, who may have restricted access to other sites in which \nthey might exercise control over their lives. However, detailed examination of how \nthis is done in recorded interaction between staff and people with intellectual \ndisabilities is rare (for examples of such research, see McConkey, Morris and Purcell, \n1999, and Authors reference). When it comes to interaction between staff and people \nwith severe communication difficulties, there is, so far as we know, no published \nanalysis of video records of routine care-home encounters (although see Houghton, \nBronicki & Guess, 1987, for a classroom observational study). \nThis paper seeks to remedy the lack by examining, in detail, one crucial aspect \nof choice in a residential service setting: the person's right to refuse. Refusing a \nmember of staff's invitation or instruction is a particularly sensitive issue, shot \nthrough with difficulties for both sides. Its sensitivities make it particularly vulnerable \nto contamination by the research method chosen. How staff respond to residents' \nrefusals is not likely to be easily captured in a questionnaire survey, nor will more \nqualitative forms of investigation - for example, interviews with staff, or questions to \nself-advocacy groups with residents - necessarily yield the detail we want. \nRetrospective accounts are undermined by memory loss, the desire to please the \ninterviewer, and a concern to tell a coherent (but possibly inaccurate) story.  \nThe most reliable data to study (especially when the events are complex) are \nvideo records, informed by ethnographic background. Analysis of video-recorded \ndetails of the actual exchange between staff member and resident is, we argue, \nnecessary to bring out the particular practices that are used (especially on the staff's \nside) to manage the balance between respecting the resident's rights, on the one hand, \nand pursuing the institution's legitimate goals on the other.  \n \nMethod \nOverview \nWe shall present a qualitative analysis of episodes of residents in a social care \nhome declining to take part in an activity put to them by staff. Because the \ninteractions are complex, and the analysis detailed, considerations of space limit us to \ntwo episodes that illustrate the wider theme. In each case the reader will see how a \nresident initially declines to take part in an activity, then how the staff treat this \n                                                                                                               Saying no to staff…. 3    \n 3\nrefusal, pursue compliance, bring the episode to a conclusion, and put a positive gloss \non proceedings.  \n \nData \nThe examples presented here come from an ethnographic project which took \nplace in three residential services for people with intellectual disabilities. These three \nservices were located within an NHS Care Trust in the South of England. Over the \ncourse of nine months, a researcher (one of this article's authors, CW) collected video \nand audio recordings, and ethnographic field notes of everyday interactions in these \nhomes. The examples here were taken from one home for people with high support \nneeds in which even the most communicatively able residents only have recourse to \nvocabularies of a small number of intelligible words or signs. The residents are \ntherefore highly reliant on members of staff to interpret and act on the few words, \nsigns, sounds, gestures or facial expressions that they may use to express themselves \nor make their needs known. Further, many of the residents are reliant on staff for \naspects of intimate care, such as the promotion of continence. Thus, members of staff \nare institutionally compelled by their ‘duty of care’ to pursue and promote particular \npractices and activities at particular times of the day.  \nThe names of all residents and members of staff have been replaced with \npseudonyms, and any other information that might lead to their identification has been \nchanged.  \n \nMethod \nOur approach involves looking in detail at what happens in these situations, in \nparticular how each person designs their utterances, and how those utterances develop \nin sequence. In this respect our approach is broadly informed by Conversation \nAnalysis (for an overview of Conversation Analysis see Hutchby and Wooffitt, 1998, \nand for a comparison with other forms of discourse analysis, Wooffitt, 2005). Within \nthe field of research on intellectual disability, Conversation Analysis (henceforth, CA) \nhas been used to study the communicative competence of people with intellectual \ndisabilities (e.g. Wootton, 1989), the practices of clinical assessment and service \nevaluation (e.g. Authors refs), the management of service-user meetings (e.g. Authors \nrefs), the interactional production of ‘incompetence’ and ‘acquiescence’ (and \nresistance to this – Rapley, 2004) and the ways in which service-user identities are \n                                                                                                               Saying no to staff…. 4    \n 4\nconnected to staff identities in case worker consultations (Wareing and Newell, 2005) \namong other topics. \nConversation Analysis permits us to inspect the very fine details of interaction, \nand thus provides us direct empirical  grounds for our claims.  This is important \nwhen the issue being studied is irredeemably local and interactional, as of course is \n'refusing' or 'resisting' (or its counterparts 'inviting', 'insisting' and so on). Our use of \nCA is bolstered by essential support from our ethnographic research on site. This is \ncrucial here, as the communication difficulties of the residents are so marked that \nspecial background is crucial to interpret what particular behaviours and vocalisations \nmight mean to the residents and staff. Thus, for example, one needs to know that a \nresident's apparently meaningful silence in response to a previous turn is accountable \nby their general inability to produce speech; or that a certain resident uses a certain \nvocalisation generally to signal distress or pain; and so on. \n \nAnalysis \nOne activity: being weighed \nWe have chosen two episodes within a single morning's activity (the residents' \nmonthly weigh-in), so as to reduce the ethnographic background information \nnecessary for the reader to understand the framework of what is going on. However, \neven though we focus on this one activity, what we shall see is in keeping with the \nroutine proposals and acceptance of\/resistance to other activities in this service. \n \nEthnographic background \nRecording residents' weight serves a monitoring function as an index of the \nresidents' health. It takes place monthly. During the daytime in this house, residents \nare usually occupied (or indeed sit or wander unoccupied) in the lounge or in other \nrooms. Weighing normally involves asking the residents firstly to come through to the \ndining room, or leading them into it, and then getting them to approach and step up \nonto a set of ordinary bathroom scales about two inches high.  That is what happens \non this occasion. \nWhile some of the residents come immediately for weighing, the recording \nshows that others appear reluctant and are encouraged repeatedly. A couple of \nresidents appear to be apprehensive about stepping up onto the scales, and only do so \nwhile holding onto the staff or the wall, suggesting that , for some at least, there may \n                                                                                                               Saying no to staff…. 5    \n 5\nbe a problem of balance or a fear of falling. The episodes we examine here concern \nthe three staff on duty (one of whom is off-camera, in another room) and two \nresidents, Matthew and Steven, who each (in separate episodes) display obvious \nresistance to getting on the scales. We shall describe Matthew's case first.  \n \nCase 1. Matthew's refusal to be weighed, and how staff deal with it. \nWe join at the point where staff member Sandy ushers in residents Matthew and \nMona. They enter a room in which are visible two residents not apparently engaged in \nany specific activity; the researcher Chris, standing out of the way, camera in hand; \nand staff member Jill, who comes forward to receive them. Mona is slightly behind \nMatthew, who thus becomes first to be asked to take part in the activity. \nAt this point it is useful to record that Matthew is a 36 year-old man of small \nstature (a little over 4 feet tall). Matthew has a vocabulary supposed to number some \n20 words, though few of these are evident on a day-to-day basis. He also makes use of \nexpressive sounds and gestures, particularly in situations that he finds dissatisfying or \ndistressing.   \nBefore the first extract we should explain what the reader will see. In an effort \nto capture as much of the details of the speakers' delivery, and the timing, of their \nspeech and actions, we have used conventional CA notation. The full glossary is in an \nAppendix to this article, but it is worth explaining two features which, unfortunately, \nimpede easy reading, yet are crucial for understanding what is happening. One is the \nuse of descriptions in italics (e.g. back to camera, leans down to face Matthew) in an \nattempt to capture relevant parts of the visible scene. The other is the use of square \nbrackets ([) on adjacent lines to show that the material enclosed is done at the same \ntime. So, for example, in Extract 1, in the one second between Jill's two turns at \nspeech (lines 5 and 8), we see Sandy take Mona past Matthew towards the weighing \nscales.  \n \nExtract 1: VA5 min 1.59. Matthew's first refusal \n01     Jill     ((back to camera, leans down to face Matthew, holds   \n02 →1         out hand  towards him)) >↑dy'wanna get weighed?<    \n03            (.3) \n04     Matt   ((while turning away from Jill to face the table)) °nehr° \n05     Jill     no:? \n06            [                       (1.0)                  ] \n                                                                                                               Saying no to staff…. 6    \n 6\n07            [((Sandy takes Mona past Matthew towards scales)) ] \n08     Jill     go on then, (.2) Mona can go:, \n \nRefusal acknowledged and the matter dropped. \nStaff member Jill offers Matthew what will be the first of many invitations to be \nweighed (marked \"1\" in line 2). How does he react? Ethnographic observation \nprovides background evidence that Matthew's soft utterance at line 4, which we \ntranscribe as \"°nehr°\" is a sound that he uses elsewhere to signify a range of negatives \n- disagreement, distaste or, as we may understand it here, dissent.  \nBy itself this background information is only suggestive, and as CA theorists \nobserve, potentially misleading (see, for example, Schegloff, 1997, on the use of \nalleged background context). What is decisive is two immediate sources: Matthew's \nown turning away from Jill, which is a generally-shared convention requiring no \nspecial interpretation; and - most manifestly - Jill and Sandy's immediate \nunderstanding that Matthew means 'no'. Jill explicitly does a check-confirming \"no?\" \n(see Houtkoop-Steenstra, 2000 especially ch. 6 on how questioners deal with \nanswers), and Sandy endorses this understanding by beginning to lead the other \nresident past Matthew to take her turn. Jill concurs. \nThe immediate availability of the next resident allows the staff members to drop \nthe issue of Matthew's compliance. A period follows in which Mona is successfully \nweighed, without incident. Then another resident, Julie, appears and is brought to the \nscales and weighed, though with somewhat more trouble (which we shall not describe \nhere). Jill then turns to Matthew again.  \n \nExtract 2: VA5 min 3.05. Matthew's second refusal \n01     (?)     [ ((noises & laughter celebrating Julie's weighing))]    \n02 →2 Jill     [((off camera, presumably to Matthew)) >d'y wanna<  \n03            another go, \n04            (.3) \n05     Chris   w'done Jul [i.e. \n06 →3 Jill               [d'y wan' another go, \n07            (.5) \n08     (?)     ( (laughter)) \n09            (.3) \n10     (?)     (              ) \n11            [((camera now swings round to find Jill bending \n12            [down and holding Matthew's hand))               \n13 →4 Jill     c'mon (.3) >sh'we get weighed?<  \n                                                                                                               Saying no to staff…. 7    \n 7\n14     Matt   [(°nerh°)= \n15            [((Matthew turns away to table))] \n16     Jill     =weighed? (.)  [no (.) we had a clear no: there, \n17                         [((Jill drops M's hand, straightens, \n18            looks up & away from Matthew but to no one in  \n19            particular, then to Chris, then back to Matthew  \n20            again))                                       \n21     Chris   Right. \n \nNo-blame reissue of invitation \nRecall that in its first incarnation, (in Extract 1 above) the staff's request to \nMatthew was a simple invitation: \"dy'wanna get weighed?\", which was refused. \nNotice how Jill re-issues the request (marked \"2\" in line 2). She asks: 'd'y wanna \nanother go'. This on the face of it is odd, as he has not 'had a go' yet, in the sense of \nmaking any attempt to approach, still less stand on, the scales. This is a no-blame \nrepair (repair, as a feature of conversation, has been studied since Sacks, Schegloff \nand Jefferson's seminal 1974 article on turn-taking in conversation) of Jill's initial \nquestion, which elides responsibility for the problem it caused. Indeed, it implies that \nthere was no problem, and that the request had been already partially successful, as if \nMatthew had in fact made a stab at mounting the scales. It is met with silence. Jill \nreissues it (\"3\", line 6), as if it had not been heard or understood; but no-blame \nformulation or not, this third invitation also fails. \nJill is then more direct, asking: ‘Shall we get weighed?’ (invitation 4, line 13). \nThe collective phrasing (‘we’) implies the task is one they are both doing together, \nrather than being an individual matter of choice for Matthew. This is another no-\nblame repair, as it issues the invitation as if for the first time. It implies that the two \nprevious attempts have been simply misunderstood, or not heard, or been otherwise \ninoperative; no blame attaches to Matthew (or to Jill) for their failures. This is a \nregular feature of self-initiated repairs (which are the preferred form; see Schegloff, \n1992). However, Matthew still refuses (line 14). He repeats the \"nehr\" sound we \nnoted in Extract 1 above, and turns away from Jill to face the table. Better evidence \nthat what he says and does is taken as a refusal is made manifest by his interlocutors: \nJill expressly announces (to the room at large, but possibly for the researcher Chris's \nbenefit) \"we had a clear 'no' there\". Three no-blame reissues of the invitation to get \nweighed have failed. \n \n                                                                                                               Saying no to staff…. 8    \n 8\nA dilemma for staff \nWhat, now, are the members of staff to do? On the one hand, they could accept \nMatthew's four refusals. That would be in the spirit of the overarching institutional \npolicy of encouraging and respecting choice, enshrined in this residential home's \nwritten '\"philosophy of care \" and at each level of authority above it, from the policies \nof the regional Trust to those of the national Department of Health. This seems to be \nthe line that Jill takes, as the extract below - which follows on immediately from the \none above - shows. \n \nExtract 3: VA5 min 3.10. Jill apparently respects Matthew's refusal \n22            (.3) \n23     Jill     [you don’t have to.                         ] \n24            [((walks away from Matthew, towards scales))  ] \n25            (1.0) \n \nJill announces that Matthew need not be weighed, and seemingly walks away. \nHis choice of refusing an activity seems to be respected. \nHowever, while respectful of individual rights, the service staff are also subject \nto two forces that pull the other way. One is that they may consider it to be in the \nresidents' best interests to get weighed, so that any health-related fluctuations will be \nspotted. This, of course, generalises to any activity which the institution believes is \nsubject to health and safety issues; our ethnography reveals it in such activities as \ntoileting, food-preparation, and so on. The other consideration that the staff may have \nin mind is that they personally, as employees, will be held accountable for a missing \nentry in the records. If either of these forces hold sway, the staff may feel entitled to \nmobilize a commonplace practice, often seen in this (and other) residences: to treat \nMatthew's 'refusal' as a merely temporary reluctance that will melt under persuasion \nand good-natured cajoling. It is this latter practice than wins out in this case. See how, \nin extract 4 below (which carries on immediately from extract 3), Jill breathes new \nlife into Matthew's weighing. \n \nExtract 4: VA5 min 3.12. Jill revives the invitation with a minimised task \n26     Jill     ((off camera)) what I will do is= \n27     Chris   ='e's gorris eye on it (.) °though°= \n28     Jill     [= try seeing (1.2)  if (2.4)                  ] \n29     Sandy  [((approaches him and holds her hand out))    ] \n                                                                                                               Saying no to staff…. 9    \n 9\n30 →5        [you wannu go there (°'n    °)                ] \n31            [((Jill brings scales over to Matthew and places ]  \n32            [them at his feet))                          ] \n33            [((Matthew slowly turns 90° away from Jill))   ] \n34     Jill     ↑d'you want to step on 'em?                         \n            \nMinimised task \nDespite herself explicitly announcing that Matthew need not be weighed, Jill \nsuggests there is some room for interpretation. Her ‘What I will do\" (line 26) proposes \nanother course of action to pursue her request, implying - again in a formulation that \ndoes not blame Matthew - that the fault may have been in the difficulty of what was \noriginally wanted. Chris the researcher seems to endorse the possibility that \nMatthew’s no was not definitive by saying ‘He’s got his eye on it (i.e. the set of \nscales), though.’  \nJill goes to get the scales, implying that it was the distance (a few feet) that was \nthe problem. Sandy takes her cue from Jill's actions by explicitly approaching \nMatthew with her hand outstretched (as if to help him onto the scales) and issuing a \ndirect invitation (marked \"5\", line 30). Jill arrives with the scales and places them at \nMatthew's feet. She then issues the sixth invitation: \"d'you want to step on them?\" \n(line 34). Extract 5 follows immediately. \n \nExtract 5: VA5 min 3.19. Matthew's sixth refusal  \n35 →6 Matt   °nehr° ((Matthew edges his feet away from the scales))  \n36     Jill     no::? \n37            [((Jill picks up scales)) \n38     Sandy  [((makes sweeping gesture and giggles)) \n39     Sandy  ( you need to take the [ oh he said     ) \n40            [((Jill carries scales back, facing camera, smiling))  ] \n41     Jill     [                   [↓°no:.°                   ] \n42     Jill     that was a no:.        \n43     Chris    yeah.  \n44     Sandy  ((walks past Matthew, touching him on shoulder as  \n45            she passes & leaves the room)) \n46            (.5) \n47     Jill     okay::h ((deposits scales in original position and  \n48            walks back towards Matthew)) \n49     Chris   so who’s left. \n50     Jill     [((turns head over her shoulder back towards Chris)) ] \n51            [that was a no.                                  ] \n52            ((Jill walks past Matthew, ruffles his hair as  she passes  \n53            and follows Sandy out of the room)) \n                                                                                                               Saying no to staff…. 10 \n   \n 10\n54     Sandy  ((from outside the room , apparently in reponse to \n55            Chris' question)) Perry and (  ). \n \nAt the start of extract 5, Jill has placed the scales at Matthew’s feet. Matthew \nrepeats the nehr sound and shuffles his feet away from the scales. Jill echoes this as a \nconventional no refusal, and removes the scales (lines 40-2). In line 47 she says ‘Ok’ \nwhich is commonly used to as a pivot between topics (Beach 1995) and reiterates her \nunderstanding that Matthew’s behaviour constituted a refusal (line 51). Chris, the \nresearcher, goes along with this proposed termination of the issue, making operative \nthe new, but institutionally relevant (and business-as-usual) topic of next-to-be-\nweighed. \n \nSummary of staff's treatment of Matthew's refusals so far. \nAt this point we can see that Matthew has given multiple signs that he does not \nwant to take part in the activity. Apart from his non-standard vocalisation, he has \nturned his body away from the direction of the scales, looked away, not taken a hand \noffered to him, and not stepped onto (indeed, edged away from) the scales when they \nwere brought to him. We have also seen that although these behaviours are recognized \n(indeed explicitly announced) to be refusals, the staff persist in their requests, \nindicating that Matthew's refusals are not treated as definitive.  \nHowever, neither Jill nor Sandy are ordering Matthew to get on the scales, or \ninvoking their authority as staff members. They are solving their dilemma (between \nrespect and persistence) by no-blame encouragement – their responses treat \nMatthew’s refusal as either due to lack of support or encouragement on their part, or \ndue to problems in the way they have issued the invitation.  \nJill's \"okay\", and the move to next-resident-in-the-queue, suggests that \nMatthew's part in the episode is over. However, although Sandy and Jill have now \nmoved out of the room, we hear Rose, who has been in the kitchen, make an \nintervention. Extract six follows some 20 seconds on from extract five (the line \nnumbers give an indication of how much material we have skipped). \n \nExtract 6: VA5 min 3.31. Rose's intervention and Matthew's seventh refusal. \n(Rose is off- screen throughout; she is looking through from the adjoining kitchen) \n67             [((Matthew advances to a glass-fronted cabinet and  ]  \n68             [makes to open its door.))                        ] \n69     Rose    Matthew. \n                                                                                                               Saying no to staff…. 11 \n   \n 11\n70             [                   (1.5)                       ] \n71             [((Matthew immediately withdraws hand, head       ] \n72             [orientation moves midway between cabinet and the  ] \n73             [direction of Rose's voice)).                       ] \n74     Chris    °C'mon°, \n75 →7 Rose     (g)won stand on thee- scale. \n76             ((Matthew glances at Rose, then looks at floor, slowly  \n77             turning body back away from cabinet, towards table; \n78             he brings his hands together across his chest)) \n79     Matt    neeah:. \n \nA change in register: escalation \nA simple narrative will help convey what is happening in (and just before) \nExtract 6. Matthew makes his way to a cabinet which houses videotapes, which the \nethnographic record shows are among Matthew's favourite objects. In other words, he \nlooks to initiate a quite different activity, under his own steam. Matthew is about to \ntouch the cabinet when Rose calls his name. He freezes. In contrast to Jill and Sandy, \nRose opens with an utterance from a different register. At line 75 (marked 7) Rose \nissues the direct order: “(g)won stand on thee- scale”. In response, Matthews turns \naway from the scales and says “Neaah”. Rose counters this with a disaffiliative, \nchallenging \"yes” (line 80 below, marked 8). Clearly, Rose is dealing with Matthew's \nrefusal very differently. She is upgrading Jill and Sandy's no-blame invitations - \ninsistent as they were - to an unambiguous instruction. Matthew covers his face and \nrepeats \"neeah” (line 81). \n \nExtract 7: VA5 min 3.56. Rose insists; more refusals (follows immediately on \nfrom above) \n80→8  Rose     yes:. \n81     Matt    neeah. ((head down, raises right hand to cover side of  \n82             head nearest Rose)) \n83→9  Rose     YES, \n84     Matt    nu- euh. ((drops hand, brings hands back in front of  \n85             chest)) \n86            ((some talk is hearable from the next room, but it seems \n87             unrelated to this exchange and we do not transcribe it  \n88             here)) \n89→10 Rose  ↑go on,  (.)↑stand on the [sca:les \n90     Matt         ((jerks hand down)) [nee:aurh ((begins to move  \n91             back to table, away from scales)) \n92→11 Rose    I say yes. \n93             ((Matthew turns and walks towards exit door, hands  \n94             clasped)) \n                                                                                                               Saying no to staff…. 12 \n   \n 12\n95→12 Rose    Come on. (.) MATTHew. \n96             ((Matthew stops, turns away from Rose, towards wall)) \n97→13 Rose   THIS way, \n98             ((Matthew stands right up against, and facing, the wall,  \n99            hands clasped))                                  \n \nThere is no mistaking Rose's position on the matter: Matthew's refusal is \nunacceptable. Her attempts to get Matthew to comply are more brusque than Sandy or \nJill – she raises her voice in line 83, directly counters Matthew’s vocalisations with \nher own ‘Yes’, and then re-issues the order ‘Go on, stand on the scales’ (marked 9 & \n10). When Matthew still says ‘nee:aurh’ and moves away from the scales (lines 90 & \n91), she explicitly acknowledges her own will to be different from his own: ‘I say yes’ \n(marked 11, line 92). Each of these steps is characteristic of the escalation of \nargument (see Antaki, 1994, Dersley & Wootton, 2001). The result of this approach is \nwhat we might see as a more extreme display of refusal by Matthew – he withdraws, \nto go and stand facing the wall (lines 98 & 99).  \nThe conflict is unresolved, but fades as Jill and Sandy return with another \nresident. We hear no more from Rose. A little over a minute passes as they weigh this \nother resident, then seat him in a chair nearby. We rejoin the scene as Sandy \napproaches Matthew, who has been standing square-on to the wall the whole time, \nthough with head turned to follow the action.  \n \nBodily persuasion as a last resort  \nFor reasons of space we do not transcribe this stretch of action (a transcript is, \nhowever, available from the authors). Briefly, Matthew is facing the wall throughout. \nSandy brings the scale next to his feet, puts her arms around him. As she gently tries \nto manoeuvre him onto the scales, Matthew makes distressed-sounding vocalisations. \nSandy repeatedly says ‘come on’ in a sing-song voice, the intonation of which seems \ndesigned to respond to Matthew’s – while he is making crying noises after her \ninvitations, she uses a lilting, soothing intonation pattern (see Rapley, 2004 for a \ndiscussion on workers using sing song intonations to people with intellectual \ndisabilities).  \nThis description shows two contradictory things: Sandy’s gentle encircling of \nMatthew with her arms, and her soothing pitch might be heard as indicating her \nsupport for Matthew and a visible indication that she has heard his distress; on the \n                                                                                                               Saying no to staff…. 13 \n   \n 13\nother hand, her persistence in the face of this points to a refusal to accept his response. \nAgain, at the end of the extract, Matthew adopts a more extreme response – he pulls \naway from her and faces the wall, leaning his forehead against it. This position is \nuncompromising. \n \nCoda: a positive gloss \nAt this point, the staff bring in and weigh another resident, so their business \nwith Matthew seems finally to be over. But it is not, quite. There is a revealing coda \nwhich brings out an important resource the staff have of explaining away problems by \nappeal to a quirk of Matthew’s personality. We pick up the story about half a minute \nafter the end of the last extract. The staff's focus has been on another resident. We join \njust after Sandy has loudly, but indecipherably, addressed her colleague in the next \nroom, then starts to move off.  \n \nExtract 8: VA5 min 6.48. Sandy finds another activity for Matthew \n01    Sandy  (                    ) ((said loudly, but not clearly.  \n02           Possibly designed for a listener in another room; there  \n03           is a faint reply, possibly from Jill, off-screen)) \n04    Sandy  ((about to move past Matthew)) (           ) \n05    Sandy  ((stands in front of Matthew and looks at him)) hmm? \n06            (.5) \n07    Sandy  come on let's go. ((holds hand out to him)) \n08           [                     (2.0)                       ]  \n09    Matt   [((hands clasped, does not take hers))                ] \n10    Sandy  come on, \n11    Matt   °nurh° \n12    Sandy  >you’re not coming,< ((drops hand))  \n13    Matt   nuh. ((edges away)) \n14    Sandy  alright then, (.) see you later. \n15           ((Sandy walks towards doorway and stops there))  \n16    Sandy  y'com:in?  \n17           (.)  \n18    Sandy  ↑come on \n19           (4.0) \n20    Sandy  come on Matthew. \n21           (2.0) \n22    Chris   ((moves towards matthew)) we goin'? \n23           [                        (5.0)                   ] \n24           [((Matthew stands without moving as Chris brings    ] \n25           camera to within touching distance))                ] \n26    Matt   ((starts  [to move towards door)) \n27    Sandy         [look at you::, (1.0) you have to- (.2) wait for  \n                                                                                                               Saying no to staff…. 14 \n   \n 14\n28→14       your own  [time °to come° ((Sandy goes off screen)) \n29    Chris            [yep, \n30           ((Matthew leaves dining room)) \n \nHere Sandy is no longer inviting Matthew to be weighed. In a signal that that \nbusiness is now over, she is inviting him to leave the dining room with her. In this \nextract we see that Sandy’s initial invitation ‘come on let’s go’ (line 7) is not \nresponded to. She then goes to stand in doorway and we can see she treats Matthew’s \nnon-response as a ‘no’ by saying ‘you’re not coming’ and ‘all right, see you later’. \nHowever, just as we have seen in previous extracts, this does not lead to the invitation \nbeing dropped, and she repeats ‘come on’ twice after this. Chris picks this up, and in \nline 26 Matthew begins to respond. So far, that merely repeats the pattern we have \nalready established. What is especially revealing about the extract is what Sandy now \nsays in lines 27-8, as an explanation of Matthew's tardiness in accepting her invitation \nto leave the room: ‘you have to wait for your own time to come’ (marked 14, lines 27 \n& 28).  \nWe would suggest that what Sandy is mobilising is a rhetorical trope which puts \na positive gloss on Matthew's behaviour - and on the staff's reaction to it. It claims \nthat Matthew's 'refusals' are (merely) signs of his well-known, universal and long-\nstanding disposition to want to do things at his own pace.  Sandy makes this as a \ncomment on his reluctance to leave the room, but it comes hard on the heels of the \nprotracted, and unconsummated, business of his failure to be weighed, and might \ntherefore be applicable to both. In both cases, what will have looked like \"refusing\" \nmight therefore be treated as a matter of him just wanting to \" wait for his own time\" \nto agree. This formulation, is, as Holt and Drew (1998) notice about such idioms, \ndesigned to bring a trouble to a conclusion by setting it down to an immutable and \nunchallengeable description of the way the world is.  \n \nCase 2. Steven's refusal to be weighed, and how staff deal with it.  \nMatthew's many refusals were dealt with in a variety of ways by staff; we now \nmove on to the case of another resident, Steven, to pick up similarities and \ndifferences. Steven is registered blind and has his eyes shut most of the time. Because \nof his lack of vision Steven requires physical assistance to move around the house. He \nis more verbally capable than Matthew; his vocabulary is greater and he is able to \nconstruct phrases several words in length. However, like Matthew his communicative \n                                                                                                               Saying no to staff…. 15 \n   \n 15\nabilities are not readily apparent on a day-to-day basis and typically they only become \napparent when he is prompted and supported to use them. \nAt the start of extract 9 below, Sandy and Matthew are in the kitchen when Jill \nand Steven appear in the doorway, arms linked. Sandy is behind them.  \n \nExtract 9: VA5 min. 6.19. Steven stops (refuses?) in dining room doorway        \n01     Jill      say hello Chri::s               \n02     Sandy   Oh [:: \n03     Chris       [Oh and Steven as well (.) ↑hi Steven  \n04     Steven   ((halts in doorway)) \n05     Jill      ((also stops, looking back at him))  \n06     Jill      whereyu going? (.) >d’yu wantu< come in  \n07→1          and have a nice drink, (.) 'n get weighed  \n08     Steven   ((shuffles feet in doorway but not going in,   \n09             arms linked with Jill))   \n10             [                 (1.7)                      ] \n11→2  Jill      [drink and weighed?                          ] \n12             [                 (1.5)                      ] \n13     Steven   [((head sways side to side, brings hand to mouth,  ] \n14             [ turns head against door))                    ] \n15→3  Jill      d’yu wantu come in? (1.6) Steven? \n16     Steven   ((lifts and turns head so facing into room, takes  \n17             hand from mouth)) \n18             [                 (2.8)                      ] \n19     Jill      [((moves arm down from linked arm with Steven  ] \n20             [and takes his hand. Leads him a [into room))  \n21     Jill                                   [↑come on  \n22     Steve    ((stops, drops head, brings palm of hand to open  \n23             mouth as if biting)) \n24     Jill      no [::↑ \n25     Steven      [((pulls hand away, turns away from her and  \n26             steps back into doorway, facing door, hands clasped  \n27             together)) \n28              [                  (1.6)                      ] \n29             [((Jill shakes head and turns back into doorway)) ] \n30→4  Jill      no, (.) we’ve go' a clear no here ((steps back into \n31             doorway)) \n32             ((Jill takes Steven’s hand, facing into corridor))  \n33     Jill      where d’yu want to go \n34     Steven    ((shakes head)) (°fro oom°) \n35     Jill      [((drops head nearer his mouth))  \n36     Jill      [where? \n37     Steven   (°th' fro oom°)  \n38     Jill      front room? (( Jill and Steven, hand-in-hand, begin  \n39             to walk down corridor)) (1.2) \n40     Jill      front room? ((they disappear from shot)) \n      \n                                                                                                               Saying no to staff…. 16 \n   \n 16\nRepair to a more minimal request \nWe see in the extract above, as we did with Matthew, how the staff come to \nreissue the invitation in a more minimal form. When Steven halts in the doorway (line \n4), this might be a refusal. Jill treats it as (merely) a change of direction by asking \nwhere he wants to go, then repeats her invitation. Possibly recognizing potential \ntrouble, she prefaces the weighing invitation with offering him a drink (‘drink and \nweighed’ – lines 7 and 11, marked 1 and 2), as if the two activities are coupled. \nHowever, Steven then turns and faces the doorframe (line 15). Rather than \nrecognizing this as his refusal, she re-issues the invitation, this time editing out the \nactivity (weighing) and offering a general invitation to enter the room: ‘d’yu wantu \ncome in?’ (line 15). Faced with no clear acceptance of this invitation (there follows a \nsilence for 2.5 seconds; this is very indicative of a dispreferred, in conventional \nmetrics of pausing - see Jefferson, 1988), Jill then issues a call for his attention (his \nname with a questioning intonation – marked 3, line 15). As we saw with Matthew, \nthis way of dealing with refusals is a no-blame repair; it formulates his non-response \nas due to a lack of attention to her question rather than his declining the invitation \nAt line 16, Steven turns and once more faces into the kitchen. Jill treats his shift \nin body orientation as an opportunity to proceed further. She advances a few steps, \nholding Steven’s hand and leading him into the room, saying ‘come on’ (line 21). \nThis change in Steven’s bodily position can be seen, then, as potentially interpretable \nas a change in his attitude towards entering the room. Like the sequence in extract 9, it \nis precisely these types of events which provide licence for staff persistence, since \nthey indicate that refusals might not always be definitive.  \nHowever, Steven then stops and brings his open palm to his mouth (as if he \nwere biting himself – line 22). Jill’s ‘no’ at this point might be a request for him not to \nbite his hand, or she might be voicing her interpretation of his behaviour (i.e. he does \nnot want to go into the kitchen). Steven then pulls his hand from hers, turns away \nfrom Jill and the kitchen, and steps back to the doorway. At line 30 (marked 4) Jill \nclearly treats Steven as refusing (‘we’ve got a clear no here’; c.f. the same \nannouncement about Matthew, Extract 2, line 16)), and she stops trying to get him \nweighed by asking him where he wants to go. Steven provides a verbal response \nwhich we were unable to hear clearly on the recording, but which Jill’s takes to be \n‘front room’ (a term used in the UK to refer to the ‘lounge’ or ‘sitting room’). They \nthen leave the kitchen, and we can see that Steven’s choice has been respected. \n                                                                                                               Saying no to staff…. 17 \n   \n 17\nHowever, as with Matthew's case, what seems to be a respectful conclusion is \nonly a temporary hiatus. We pick up the action with extract 11. Here we see Sandy \ntrying to weigh David. The scene begins about one minute after Steven has left the \nkitchen at the end of extract 10. Sandy comes out of lounge with Steven, holding his \nhand and walking with him towards the kitchen. Matthew passes them. Jill is standing \nin the corridor.  \n \nExtract 11: VA5 min 7.50. Steven is led back to the kitchen. \n 01     Sandy   d’you wanna be weighed darling (.)  mh? \n 02             [                    (1.7)                          ] \n 03             [((Sandy leads Steven down corridor towards kitchen))   ] \n 04 →5 Jill      that’s as far’s I gottim  \n 05     Sandy   [                   (1.4)                           ]  \n 06             [((Sandy leads Steven down corridor towards kitchen))   ] \n 07     Jill      Matthew’s runnin away \n 08     Sandy   mkay \n 09             [                    (4.0)                          ] \n 10             [((Sandy still leading Steven along, Jill follows))        ] \n 11             ((Steven stops  [ on threshold of kitchen and backs away)) \n 12                           [((Sandy stops, turns back))  \n 13     Sandy                [(    ) [(giggles) \n 14     Jill                         [see what I mean \n 15     Steve    [((backs out of doorway into corridor)) \n 16     Sandy    ((holding Steven’s hand, points at floor by Steven’s  \n 17              feet)) put the weigh .hhh put the scale there (.4) then, \n 18     Jill      [ss get you (down) \n 19             [((Jill walks past Sandy into kitchen)) \n 20     Sandy   [we'll put the scale here \n 21                          2.0 \n 22     Sandy   why don't you wanna be weighed       \n  \nReformulation of ‘refusal’ \nIn the first instance it was Jill who was taking the lead in trying to persuade \nSteven to get on the scales. A minute later, Sandy has a go, and it may be that she is \nmore successful. We pick up the scene as she is leading him down the corridor back \nto the dining-room: 'd’you wanna be weighed darling' (line 1). That staff effectiveness \nis an issue is evidenced by Jill’s comment, as they walk down the corridor, ‘that’s as \nfar as I got him’ (marked 5, line 4). This way of construing the situation is one which \nplaces staff success or failure at getting the task done as central, rather than their \nsuccess at recognizing Steven’s expression of preference. \n                                                                                                               Saying no to staff…. 18 \n   \n 18\nAgain we see Steven doing things that staff interpret as expressing his desire not \nto be weighed. He pulls back in the doorway and edges back into the corridor. Sandy \nthen suggests bringing the scales from the kitchen and putting them at his feet. Just as \nwith Matthew (extract 4), this attempt to solve the problem treats his behaviour as \n(possibly) a refusal to go into the kitchen, or to walk the extra steps to the scales, \nrather than to get weighed per se. However, her next question ‘why don't you wanna \nbe weighed’ (line 22) treats his behaviour as a refusal to get on the scales. Note that \nthis is not a question that Steven would normally be able to answer given his \ncommunicative difficulties, but rather is one which fills the gap when Jill is getting \nthe scales, and one which credits Steven with reasons for his refusal. In a further \ndevelopment (not shown), Jill persists (‘mm? … come on’) and Steven makes a \nmuffled shrieking noise, moving further away again. In response to this, Sandy drops \nher enquiries about being weighed and suggests a different activity – singing. This \nmight be glossed as a distraction sequence, since it occurs while Jill is fetching the \nscales and they are about to try to weigh him again (extract 12).  \n \nExtract 12: VA5 min 8.17.  Steven is almost manoeuvred onto the scales \n35      Jill      don’t think [he will t’be honest \n36                        [((Jill returns holding scales)) he feels un (.9) \n37              ((puts scales down in doorway by Steven’s feet)) \n38      Jill      [safe \n39→6   Steven   [EUUoo:.hh ((shriek with open palm covering mouth)) \n40              ((drops hands to chest-height when vocalisation stops)) \n41      Jill      [Steven? \n42      Sandy   [t’s allright, \n43→7           [((Sandy hands on Steven’s waist, she moves his body round \n44              so he is facing kitchen and scales)) \n45      Steven   eeyooo:: \n46→7   Jill        >Come on sweetheart< (( takes Steven’s wrist))   \n47      Jill      [can you step on here?  \n48      Steven   [ºeeyooº \n49      Jill      step [up \n50      Steven        [ºooº ((edging towards scale, hands clasped together,  \n51               Sandy’s arms around his back, Jill holding his hand)) \n52      Sandy   step up \n53               ((Steven puts right foot on scales)) \n54→8    Jill      [well do::ne \n55→8    Sandy   [good ma::n \n56              ((Steven raises left foot into air)) \n57      Jill      now  [step up \n58      Sandy        [step up \n                                                                                                               Saying no to staff…. 19 \n   \n 19\n59                    [((Steven has one foot on scales, other foot waving in air,  \n60              Sandy supporting. Brings one hand clenched fist to mouth)) \n61      Sandy   eh he [he \n62      Jill            [we:ll do::ne, \n \nWhen Jill brings the scales and places them at Steven’s feet, she offers her own \nexplanation for his refusal, which is that he feels unsafe (standing on the scales – lines \n36 & 38). This is a different explanation from those implied in the previous extract \n(that it was an issue of staff effectiveness or a problem with entering the dining room), \nand one which suggests Sandy will not be successful. Almost simultaneously, Steven \nmakes a loud shriek (marked 6, line 39). Both staff treat this as a sign of distress and \nadopt a soothing tone towards him, saying ‘Steven’ and ‘that’s allright’ in light, sing-\nsong voices.  \n \nBodily movement again used as a last resort  \nHowever, rather than orienting to his shriek as a reaction to their continued \nencouragement of him to get on the scales, they simultaneously manoeuvre his body \naround towards the scales (marked 7, lines 43 and 46), and gently encourage him to \nget on them. His compliance is rewarded by praise in lines 54 and 55 (marked 8), and \nby the end of the extract he has one foot on the scales and one foot in the air, his body \nsupported by both Jill and Sandy. The weighing seems to have been successful. \n \nCoda \nJust as it looks as though their persistence has been rewarded, Steven moves his \nfirst foot off and slowly drops to floor, with Jill supporting him under his arms. Again \nto save space in this article, we describe this stretch rather than present the full \ntranscript (which is available from the authors). \nRather than putting both feet on the scales, Steven drops to the ground, and ends \nup sitting on the scales with his legs outstretched on the floor. Both staff laugh, and \nalthough Jill then reads the scales, calling out \"five stones\", the researcher Chris \nobserves ‘that doesn’t work’ (i.e. it is likely be a highly inaccurate reading). \nNevertheless, rather than take issue with Steven’s continued refusal to be weighed, Jill \npraises him for what she thinks he is doing on the scales: pretending to drive, and they \nboth give him physical reassurance by stroking or patting him. When they invite him \nto stand up again, he produces a vocalisation Jill is unable to interpret (‘what \n                                                                                                               Saying no to staff…. 20 \n   \n 20\ndarling?), but which sounds on the tape like ‘I don’t’. Steven might be indicating here \nthat he does not want to stand up - this interpretation is supported by the fact that he \nmakes no move to get up when encouraged, and begins to sing while rocking back \nand forth. Both Jill and Sandy take up his change of activity, laughing, clapping and \njoining in. After the singing is over, they help him up and back to the lounge without \ntrying to get him back on the scales again. His successful refusal, and creative change \nof activity, is accepted by both Jill and Sandy. Their praise at the end displays, to all \nparties, that Steven’s exercise of choice has been accepted with good humour and \nwithout damaging their relations with him. \n \nDiscussion \nRefusing staff requests is a test of the staff and the system, as it puts in conflict \ntwo opposing institutional objectives: to respect choice and to get the job done. We \nset out in this article to use video records to examine, for the first time, what happened \non two occasions when residents with severe communication difficulties tried to \nrefuse an activity proposed to them by staff.  \nWe have, we think, achieved two things. The first is that we have put flesh on \nthe observation that it can be hard to for people who have little symbolic language to \nexercise choice in routine aspects of their lives. The second is to have revealed the \ndetailed work-practices by which staff members - usually sympathetically and \nunaggressively, but not always - override residents' refusals. In our examples, \nalthough the staff repeatedly recognized that residents preferred not to be weighed, \nand that it was not necessary, nevertheless they persisted in encouraging them. These \nscenes starkly show the conflict between two service agendas – that of encouraging \nself-determination and empowerment through offering support in ‘person-centred’ \nways, and that of providing ‘care’ through a set of routine institutional procedures (for \ndiscussions of this conflict see Bannerman et al, 1990; Dowson, 1997; Harris, 2003; \nJenkinson, 1993; Jenkinson et al, 1992; Kishi et al, 1988; Stancliffe, Abery & Smith, \n2000). We see here that although the former is recognized and acknowledged by the \nstaff, the latter seems often to dictate their responses. Indeed it takes some persistence \nand creativity on the part of residents Steven and Matthew before they find their \nwishes finally respected (and we must acknowledge that eventually the staff do \nrespect their choices). Neither was successfully weighed on the morning in question.  \n                                                                                                               Saying no to staff…. 21 \n   \n 21\nWhile in some contexts it might be argued that the staff members are persisting \nto ensure the safety or health of the resident, we believe this is not the case in the \nexamples presented here. There is no life-or-death issue at stake in insisting that every \nresident participates in the weighing session, and this is acknowledged by the staff. \nRather, we believe the activities being insisted upon are being pursued for the sake of \ngetting all residents ‘done’ at the same time, in pursuit of a tidy schedule of work \nactivities, and because these interactions are locations for the demonstration and \ninstantiation of staff effectiveness and authority. The institutional imperative trumps \nthe residents' exercise of choice. \nThe extracts illustrate a range of resources on the part of residents that staff \nrecognize as refusals: edging one’s feet away from an activity, stopping in the \ndoorway of the room in which the activity will occur, turning one’s head away, \nstanding facing the wall, standing still when encouraged to approach a piece of \nequipment, the use of ‘proto-words’ such as Mathew’s ‘nehr'\/'neeyah’, and \nvocalisations such as shrieks. In response to these, staff have a range of resources with \nwhich they attempt to counter these refusals: appreciating resident's behaviour as \nsomething other than refusal; formulating the invitation again in a no-blame format; \nminimising the task required; escalating the invitation to a request and an order (with \ngentle 'sing-song' intonation, or more brusquely); moving the person bodily; and \npositively glossing the proceedings. We should note the gentle way in which the staff \nalmost always acted, and that when they did accept the refusal, they did so in a ‘no-\nblame’ way – for example, stroking Matthew's back and shoulder (indicating their \nrelationship was still intact) and celebrating and joining in the Steven's creative \nresponse of treating the scales as a horse and singing an appropriate song. The drive to \nmaintain intersubjectivity (Garfinkel, 1967) - an agreed, positive, display of \nunderstanding what is going on - is as strong in this residential home as it is anywhere \nin social life. \nIt is important to set these extracts in the context of other sorts of invitations that \noccur in the house. Our ethnographic work, over some nine months, revealed similar \nbehaviour in a range of situations in which residents are being invited to do things \n(e.g. go to the toilet, go to the dining room for a meal). On some occasions, the \nresident simply does not respond – that is they make no vocalisation or movement that \nis easily interpretable as an acceptance or refusal, although a non-response might be \ntaken to indicate a refusal. However, in these situations the staff usually persist in \n                                                                                                               Saying no to staff…. 22 \n   \n 22\ntheir encouragement, and eventually the resident might comply. We saw this where \nMathew is invited to leave the kitchen by Sandy. Since this means that non-responses \ncan sometimes be ambiguous, or that residents can change their minds after some \nencouragement, this gives a certain licence for staff to persist when initial invitations \ndo not appear to be accepted. In the extracts above, however, what we see are staff \nacknowledging that the person has said no, yet still persisting. \nIn conclusion: we have examined in detail two episodes in which people with \nsevere communication difficulties attempt to refuse care activities suggested by staff. \nEmpirical studies which seek to understand and promote self-determination have \ntended to focus on broad indices of choice in such things as food, leisure activities and \nliving arrangements (eg Hatton et al, 2004; Stancliffe 1995, 1997; Stancliffe & Abery, \n1997; Stancliffe et al, 2000), or on developing techniques to teach people choice-\nmaking skills (eg Browder, Cooper & Lim, 1998; Cooper & Browder, 1998; Nozaki \n& Mochizuki, 1995). This paper documents what we can learn about the abstractions \nof empowerment and disempowerment as they cash out in lived experience. \n \nReferences \n[NB authors' references are not included in this submission draft] \nAntaki, C., 1994, Explaining and Arguing: The social organisation of accounts, London: \nSage \nBannerman, D.J., Sheldon, J.B., Sherman, J.A. & Harchik, A.E. (1990) Balancing the rights \nto habilitation with the right to personal liberties: the rights of people with developmental \ndisabilities to eat too many doughnuts and take a nap. Journal of Applied Behavior Analysis, \n23, 79-89. \nBeach, W A (1995) Preserving and constraining options: \"okays\" and 'official priorities in \nmedical interviews. In G H Morris and R J Chenial (eds) The Talk of the Clinic. Hillsdale, NJ: \nLEA \nBeamer, S. & Brookes, M. (2001) Making decisions: best practice and new ideas for \nsupporting people with high support needs to make decisions. London: VIA \nBradshaw, J. (2001) Complexity of staff communication and reported level of understanding \nskills in adults with intellectual disability. Journal of Intellectual Disability Research, 45, \n233-243 \nBrowder, D.M., Cooper, K.J. & Lim, L. (1998) Teaching adults with severe disabilities to \nexpress their choice of settings for leisure activities. Education and Training in Mental \nRetardation and Developmental Disabilities, 33, 228-238 \n                                                                                                               Saying no to staff…. 23 \n   \n 23\nCooper, K.J. & Browder, D.M. (1998) Enhancing choice and participation for adults with \nsevere disabilities in community-based instruction. Journal of the Association for People with \nSevere Handicaps, 23, 252-260 \nDepartment of Health (2005) Independence, well-being and choice: Our vision for the future \nof social care for adults in England. Green Paper – Consultation Document. London: HMSO  \nDersley, I., & Wootton, A. J. (2001). In the heat of the sequence: Interactional features \nreceding walkouts from argumentative talk. Language in Society, 30, 611 \nDowson, S. (1997). Empowerment within services: a comfortable delusion. In P. Ramcharan, \nG. Roberts, G. Grant & J. Borland (eds) Empowerment in everyday life: learning disability. \nLondon: Jessica Kingsley \nEdge, J. (2001) Who’s in control?: decision-making by people with learning difficulties who \nhave high support needs. London: Values Into Action. \nGarfinkel, H (1967) Studies in Ethnomethodology. Englewood Cliffs, NJ: Prentice Hall \nGuess, D., Benson, H.A. & Siegel-Causey, E. (1985) Concepts and issues related to choice-\nmaking and autonomy among persons with severe disabilities. Journal of the Association for \nPersons with Severe Handicaps, 10, 79-86 \nHarris, J. (2003) Time to make up your mind: why choosing is difficult. British Journal of \nLearning Disabilities, 31, 3-8. \nHatton, C., Emerson, E., Robertson, J. Gregory, N., Kessissoglou, S. & Walsh, P.N. (2004) \nThe Resident Choice Scale: a measure to assess opportunities for self-determination in \nresidential settings. Journal of Intellectual Disability Research, 48, 103-113. \nHM Government (2005) Valuing People: making things better (The Government’s annual \nreport on Learning Disability, 2005). Norwich: TSO \nHolt, L. and Drew, P. (1998) 'Figures of speech: idiomatic expressions and the management \nof topic transition in conversation', Language and Society 27(4): 495-522. \nHoughton, J., Bronicki, G.J.B. & Guess, D. (1987) Opportunities to express preferences and \nmake choices among students with severe disabilities in classroom settings. Journal of the \nAssociation for People with Severe Handicaps, 12, 18-27. \nHoutkoop-Steenstra, H (2000) Interaction and the Standardised Survey Interview. \nCambridge: Cambridge University Press. \nHutchby, I and Wooffitt, R (1998) Conversation Analysis. Oxford: Polity Press. \nJefferson, G (1988) Preliminary notes on a possible metric which provides for a 'standard \nmaximum' silence of approximately one second in conversation. In  D Roger and P Bull (eds) \nConversation. Clevedon, England: Multilingual Matters \nJenkinson, J.C. (1993) Who shall decide? The relevance of theory and research to decision-\nmaking by people with an intellectual disability. Disability, Handicap and Society, 8, 361-375 \n                                                                                                               Saying no to staff…. 24 \n   \n 24\nJenkinson, J., Copeland, C., Drivas, B., Scoon, H., Yap, M.L. (1992) Decision-making by \ncommunity residents with an intellectual disability. Australia and New Zealand Journal of \nDevelopmental Disabilities, 18, 1-8. \nKishi, G., Teelucksingh, B., Zollers, N., Park-Lee, S. & Meyer, L. (1988) Daily decision-\nmaking in community residences: a social comparison of adults with and without mental \nretardation. American Journal on Mental Retardation, 92, 430-435 \nLearning Disability Taskforce (2004) Rights, independence, choice and inclusion. London: \nLearning Disability Taskforce \nLovett, H. (1996) Learning to listen: positive approaches and people with difficult behaviour. \nLondon: Jessica Kingsley \nMcConkey, R., Morris, I. & Purcell, M. (1999) Communications between staff and adults \nwith intellectual disabilities in naturally occurring settings. Journal of Intellectual Disability \nResearch, 43, 194-205 \nNozaki, K. & Mochizuki, A. (1995) Assessing choice making of a person with profound \ndisabilities: a preliminary analysis. Journal of the Association for People with Severe \nHandicaps, 20, 196-201 \nO’Brian, J. & Lovett, H. (1993) Finding a way toward everyday lives: the contribution of \nperson-centred planning. Harrisburg: Pennsylvania Department of Public Welfare. \nO'Brien, J. & Lyle O'Brien, C. (1988). A little book about person-centred planning. Inclusion \nPress, Toronto. \nPrime Minister’s Strategy Unit (2005) Improving the life chances of disabled people. London: \nHMSO. \nRapley. M (2004) The social construction of Intellectual disability. Cambridge, England: \nCambridge University Press. \nSacks, H., Schegloff, E. A., & Jefferson, G. (1974). A simplest systematics for the \norganization of turn-taking for conversation. Language, 50, 696-735. \nSchegloff, E.A. (1992) Repair after next turn: the last structurally provided defense of \nintersubjectivity in conversation. American Journal of Sociology, 97, 1295-1345. \nSchegloff, E.A., 1997, \"Whose text? Whose context?\", Discourse & Society, 8, pp.165-187. \nSocial Exclusion Unit (2005) Improving services, improving lives: evidence and key themes. \nInterim report. London: Office of the Deputy Prime Minister. \nStancliffe, R.J. (1995) Assessing opportunities for choice-making: a comparison of self- and \nstaff reports. American Journal on Mental Retardation, 99, 418-429 \nStancliffe, R.J. (1997) Community living-unit size, staff presence, and residents’ choice-\nmaking. Mental Retardation, 35, 1-9. \nStancliffe, R.J. & Abery, B.H. (1997) Longitudinal study of deinstitutionalization and the \nexercise of choice. Mental Retardation, 35, 159-169 \n                                                                                                               Saying no to staff…. 25 \n   \n 25\nStancliffe, R.J., Abery, B.H. & Smith, J. (2000) Personal control and the ecology of \ncommunity living settings: beyond living-unit size and type. American Journal on Mental \nRetardation, 105, 431-454 \nWareing, D and Newell, C (2005)  Commonsense and the doing of supported care: A case \nstudy Journal of Intellectual & Developmental Disability 30, 104 - 114 \nWooffitt, R (2005) Conversation Analysis and Discourse Analysis. London and New York: \nSage. \nWootton, A (1989) Speech to and from a severely retarded young Down's syndrome child. In \nM. Beveridge, G, Conti-Ramsden, & I Leudar (eds) The language and communication of \nmentally handicapped people. London: Chapman-Hall. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nAcknowledgements \nThe research reported here was facilitated by grant number Res-148-25-0002 from the \nUnited Kingdom ESRC. \n                                                                                                               Saying no to staff…. 26 \n   \n 26\nTranscription Symbols \n \n(.)            Just noticeable pause \n(.3), (2.6)    Examples of timed pauses \nword [word  \n     [word     The start of overlapping talk. \n.hh, hh        In-breath (note the preceding full stop) and out-breath respectively. \nwo(h)rd        (h) shows that the word has  \"laughter\" bubbling within it \nwor-           A dash shows a sharp cut-off \nwo:rd          Colons show that the speaker has stretched the preceding sound. \n(words)        A guess at what might have been said if unclear \n(   )          Very unclear talk.  \nword= \n=word          No discernible pause between two sounds or turns at talk \nword, WORD     Underlined sounds are louder, capitals louder still \n°word°          Material between \"degree signs\" is quiet \n>word word<    Faster speech \n<word word>    Slower speech \n→              Analyst's signal of a significant line \n((sobbing))    Attempt at representing something hard, or impossible, to write phonetically \n \n"}