{"doi":"10.1080\/00219266.2003.9655869","coreId":"193318","oai":"oai:lra.le.ac.uk:2381\/1513","identifiers":["oai:lra.le.ac.uk:2381\/1513","10.1080\/00219266.2003.9655869"],"title":"An exercise to teach bioscience students about plagiarism","authors":["Willmott, Christopher J. R.","Harrison, Tim M."],"enrichments":{"references":[{"id":44672949,"title":"Pharmacology, 4th edition. p.657 Edinburgh: Churchill Livingstone WHO","authors":[],"date":"1999","doi":null,"raw":"Rang H.P., Dale M. and Ritter J.M. (1999) Pharmacology, 4th edition. p.657 Edinburgh: Churchill Livingstone WHO (2000) Global Tuberculosis Control World Health Organisation report 2000 Geneva Switzerland (available online at http:\/\/www.who.int\/gtb\/publications\/globrep00\/PDF\/GTBR2000full.pdf , accessed April 15th 2002)","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2003-06","abstract":"Plagiarism is an issue of increasing concern to educators, yet students are not always clear about the boundaries between acceptable and unacceptable practice. An exercise to help bioscience students make this important distinction is described.Peer reviewedPost prin","downloadUrl":"http:\/\/www.tandfonline.com\/10.1080\/00219266.2003.9655869","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/1513\/1\/05%20plagiarism%20article%20%28revised%209_02%29.pdf","pdfHashValue":"4e42161ad66a9f3c98df788e556a48f40b856d29","publisher":"Routledge (Taylor & Francis) on behalf of the Society of Biology","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/1513<\/identifier><datestamp>\n                2016-01-08T09:41:50Z<\/datestamp><setSpec>\n                com_2381_69<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_70<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nAn exercise to teach bioscience students about plagiarism<\/dc:title><dc:creator>\nWillmott, Christopher J. R.<\/dc:creator><dc:creator>\nHarrison, Tim M.<\/dc:creator><dc:subject>\nInappropriate use of source materials<\/dc:subject><dc:subject>\nPlagiarism<\/dc:subject><dc:description>\nPlagiarism is an issue of increasing concern to educators, yet students are not always clear about the boundaries between acceptable and unacceptable practice. An exercise to help bioscience students make this important distinction is described.<\/dc:description><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPost print<\/dc:description><dc:date>\n2009-12-08T16:10:06Z<\/dc:date><dc:date>\n2009-12-08T16:10:06Z<\/dc:date><dc:date>\n2003-06<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nJournal of Biological Education, 2003, 37 (3), pp. 139-140<\/dc:identifier><dc:identifier>\n2157-6009 (electronic)<\/dc:identifier><dc:identifier>\n0021-9266 (paper)<\/dc:identifier><dc:identifier>\nhttp:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/00219266.2003.9655869<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/1513<\/dc:identifier><dc:identifier>\n10.1080\/00219266.2003.9655869<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:rights>\nCopyright © 2003 Taylor & Francis.  Deposited with reference to the publisher's archiving policy available on the SHERPA\/RoMEO website.  This is an Author's Accepted Manuscript of an article published in Journal of Biological Education, 2003, 37 (3), pp. 139-140.  Journal of Biological Education, 2003 [copyright Taylor & Francis], available online at: http:\/\/www.tandfonline.com\/10.1080\/00219266.2003.9655869<\/dc:rights><dc:publisher>\nRoutledge (Taylor & Francis) on behalf of the Society of Biology<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007"],"year":2003,"topics":["Inappropriate use of source materials","Plagiarism"],"subject":["Article"],"fullText":" 1 \n \n \nAn exercise to teach bioscience students about plagiarism \n \nChris J.R. Willmott* and Tim M. Harrison \nDepartment of Biochemistry, University of Leicester, Leicester, LE1 7RH, UK \nTel: +44 (0) 116 2522094 \nE-mail address: cjrw2@le.ac.uk \n* Author for correspondence \n \nRunning title: bioscience plagiarism exercise \n \nKey word: plagiarism \nBrief description: An exercise to help bioscience students distinguish between \nappropriate and inappropriate use of source materials. \n 2 \n \n \n \nAn exercise to teach bioscience students about plagiarism \n \n \n \nBrief description: An exercise to help bioscience students distinguish between \nappropriate and inappropriate use of source materials. \n \n 3 \n \nAbstract: Plagiarism is an issue of increasing concern to educators, yet students \nare not always clear about the boundaries between acceptable and unacceptable \npractice.  An exercise to help bioscience students make this important distinction is \ndescribed. \n \nIntroduction: There is an old joke to the effect that quoting from one source is \ncopying, from two sources is plagiarism and from three or more is research.  The \ndeliberate or accidental re-presentation of somebody else’s work as your own is \ncertainly not a new phenomenon, but it has become a matter of pressing relevance \nin current education.  One reason for the renewed interest in plagiarism has clearly \nbeen the rise of the internet as a source of material, and a range of software \npackages have become available for tracking down examples of plagiarism after \nthey have been perpetrated.  Believing, however, that prevention is better than \ncure (and certainly better than mere confirmation of guilt) we have introduced \nteaching about plagiarism into our first year undergraduate programmes.  This \nincludes the exercise described here to illustrate the difference between \nappropriate and inappropriate use of source materials.  It has initially been used as \npart of our Key Skills programme for Medical Biochemistry and Medical Genetics \nstudents, but has also be used in introductory tutorials with first year \nundergraduates on a wider range of bioscience courses.  It could be used equally \nwell with A level biologists and could easily be adapted for an alternative audience. \n \nDescription of the exercise: After a brief introduction students are given the \nworksheet (Figure 1) and asked to decide which of the versions of the original are \n 4 \nguilty of plagiarism and which are not.  They are then given about ten minutes to \nwork through the sheet individually before feedback and discussion.   \n \nDuring the discussion, the following points are drawn out about the different \nversions of the essay on the worksheet: \n1. The first version listed is an ‘ice-breaker’.  It is clearly a verbatim account \nand is thus seriously guilty of plagiarism. \n2. The second version is marginally better, but is still not acceptable.  The \noriginal work has been acknowledged as a source of ideas and information, \nbut no indication has been made that the text itself has actually been used. \n3. In this case the addition of quote-marks makes an important distinction \nform the previous versions.  The author is clearly acknowledging that both \nthe ideas and the word order have come from the textbook.  It is not \ntherefore guilty of plagiarism.  We include this version to highlight a \ndifferent weakness, namely that stringing together a series of quoted chucks \nof text is a poor way to construct an essay and work written in this way is \ntherefore likely to score low marks. \n4. This version of the essay is fine.  The quotation is indicated and is used in \nan appropriate way; it is being critiqued by the author and contrasted with \na view supported by a second reference.  Not plagiarised. \n5. Here we get to the crux of the matter.  The fifth and sixth versions of the \nessay are illustrations of practice that undergraduate students early in their \nstudies consider acceptable but we do not.  They are derivatives of the \noriginal work with only cosmetic alterations.  The wording and sentence \n 5 \nconstruction of version 5 bears a very close relationship with the source and \nis guilty of plagiarism. \n6. Similarly, this is a ‘thesaurused’ or word-swapping version of the same text.  \nA few words have been replaced with synonyms but this is not sufficient to \nbe considered new work. \n7. The author of the final essay has made a serious attempt to produce a novel \naccount of the subject.  It is still not perfect – lined up as it is here with one \noriginal source document there are still echoes of the thought processes \nwithin the work and we would ideally want the student to draw on a \nnumber of sources in order that the essay has genuine originality.  \nNevertheless, significant effort has gone into bringing freshness to the text \nand we would consider that this is not guilty of plagiarism. \n \nThis exercise is delivered as part of a session on locating, using and citing suitable \nreference materials.  We also give practical advice on strategies to avoid accidental \nplagiarism.  These include care at the note-taking stage to identify direct quotes \n(e.g. by use of a highlighter pen or a box around the text) to avoid returning later to \nthe notes and inadvertently remembering them as being further from the original \nthan in fact they are.  We encourage the students to take a short break between \nreading their textbook and submitting anything to paper, so that they are less \nlikely to reproduce word for word the original material. \n \nOver the last three years, this session has been warmly received by our students.  \nIn feedback questionnaires from a recent cohort over 50% of respondents identified \nthe tutorial on plagiarism and referencing as the one in the module from which \n 6 \nthey had learnt the most.  “Before this session I had no idea about the rules on \nplagiarism” wrote one.  “The problem of plagiarism was made clear and we were \ntaught how to avoid its use” (sic) added a second.  Given that the occurrence of \nplagiarism in a first year course essay was the original impetus for the introduction \nof this exercise, it is gratifying that we have detected no similar problems in essays \nwritten since the tutorial was introduced.   \n \nReferences \nRang H.P., Dale M. and Ritter J.M. (1999) Pharmacology, 4th edition. p.657 \nEdinburgh: Churchill Livingstone \nWHO (2000) Global Tuberculosis Control World Health Organisation report 2000 \nGeneva Switzerland (available online at \nhttp:\/\/www.who.int\/gtb\/publications\/globrep00\/PDF\/GTBR2000full.pdf , accessed \nApril 15th 2002) \n \n"}