{"doi":"10.1063\/1.2835717","coreId":"70094","oai":"oai:eprints.lancs.ac.uk:13095","identifiers":["oai:eprints.lancs.ac.uk:13095","10.1063\/1.2835717"],"title":"A portable energy-sensitive cosmic neutron detection instrument","authors":["Monk, Stephen","Joyce, Malcolm","Jarrah, Z.","King, D.","Oppenheim, Matthew"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-02","abstract":"The construction and testing of a portable energy-sensitive neutron instrument are described. This instrument has been designed and constructed for the primary purpose of characterizing cosmic-ray neutron fields in the upper atmosphere and in cosmic reference field facilities. The instrument comprises a helium-3 proportional counter surrounded by 15 mm of lead and 140 mm of polyethylene creating a spherical structure with a diameter of 34 cm. The instrument also incorporates 12 boron-coated diodes, six on the outside of the polyethylene layer with six placed within the structure. The dimensions, materials, and arrangement of these in the instrument have previously been optimized with the CNPX Monte Carlo simulation software to provide a compromise between the requirements of portability and spectral response. Testing took place at several locations and experimental data from the instrument's operation at the high-altitude Jungfraujoch laboratory in the Swiss alps are presented","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70094.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/13095\/1\/2008%2Dportable%2Denergy.pdf","pdfHashValue":"59d8805af5eb29185811c0dbf86dea228e61395d","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:13095<\/identifier><datestamp>\n      2018-01-24T02:23:44Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5141:51413735<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        A portable energy-sensitive cosmic neutron detection instrument<\/dc:title><dc:creator>\n        Monk, Stephen<\/dc:creator><dc:creator>\n        Joyce, Malcolm<\/dc:creator><dc:creator>\n        Jarrah, Z.<\/dc:creator><dc:creator>\n        King, D.<\/dc:creator><dc:creator>\n        Oppenheim, Matthew<\/dc:creator><dc:subject>\n        QA75 Electronic computers. Computer science<\/dc:subject><dc:description>\n        The construction and testing of a portable energy-sensitive neutron instrument are described. This instrument has been designed and constructed for the primary purpose of characterizing cosmic-ray neutron fields in the upper atmosphere and in cosmic reference field facilities. The instrument comprises a helium-3 proportional counter surrounded by 15 mm of lead and 140 mm of polyethylene creating a spherical structure with a diameter of 34 cm. The instrument also incorporates 12 boron-coated diodes, six on the outside of the polyethylene layer with six placed within the structure. The dimensions, materials, and arrangement of these in the instrument have previously been optimized with the CNPX Monte Carlo simulation software to provide a compromise between the requirements of portability and spectral response. Testing took place at several locations and experimental data from the instrument's operation at the high-altitude Jungfraujoch laboratory in the Swiss alps are presented.<\/dc:description><dc:date>\n        2008-02<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1063\/1.2835717<\/dc:relation><dc:identifier>\n        Monk, Stephen and Joyce, Malcolm and Jarrah, Z. and King, D. and Oppenheim, Matthew (2008) A portable energy-sensitive cosmic neutron detection instrument. Review of Scientific Instruments, 79 (2). ISSN 1089-7623<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/13095\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1063\/1.2835717","http:\/\/eprints.lancs.ac.uk\/13095\/"],"year":2008,"topics":["QA75 Electronic computers. Computer science"],"subject":["Journal Article","PeerReviewed"],"fullText":"A portable energy-sensitive cosmic neutron detection instrument\nS. D. Monk and M. J. Joyce\nDepartment of Engineering, Lancaster University, Lancaster LA1 4YR, United Kingdom\nZ. Jarrah\nHybrid Instruments Ltd., Priory Close, St. Mary’s Gate, Lancaster LA1 4WA, United Kingdom\nD. King\nBAE SYSTEMS (Military Air Solutions), Warton, Preston PR4 1AX, United Kingdom\nM. Oppenheim\nComputing Department, InfoLab21, South Drive, Lancaster University, Lancaster LA1 4WA, United Kingdom\n\u0001Received 13 July 2007; accepted 26 December 2007; published online 14 February 2008\u0002\nThe construction and testing of a portable energy-sensitive neutron instrument are described. This\ninstrument has been designed and constructed for the primary purpose of characterizing cosmic-ray\nneutron fields in the upper atmosphere and in cosmic reference field facilities. The instrument\ncomprises a helium-3 proportional counter surrounded by 15 mm of lead and 140 mm of\npolyethylene creating a spherical structure with a diameter of 34 cm. The instrument also\nincorporates 12 boron-coated diodes, six on the outside of the polyethylene layer with six placed\nwithin the structure. The dimensions, materials, and arrangement of these in the instrument have\npreviously been optimized with the MCNPX Monte Carlo simulation software to provide a\ncompromise between the requirements of portability and spectral response. Testing took place at\nseveral locations and experimental data from the instrument’s operation at the high-altitude\nJungfraujoch laboratory in the Swiss alps are presented. © 2008 American Institute of Physics.\n\u0003DOI: 10.1063\/1.2835717\u0004\nI. INTRODUCTION\nRadiation environments exhibit a broad range of charac-\nteristics because of the variety of sources that exist and also\nbecause of the substances in such environments that can at-\ntenuate and modify the primary radiations. For example,\nnuclear reactors based on the fission process tend to produce\nradiation environments comprising neutron and \u0001-ray com-\nponents, with the neutron component peaked in energy at\napproximately 0.7 MeV and rarely extending beyond\n10 MeV. In contrast, medical radiotherapy environments can\nyield neutrons as a result of spurious reactions in the mate-\nrials of linear accelerators and the surroundings. These are\nusually slowed down very rapidly by surrounding materials\nto a level at which they are in thermal equilibrium with the\nenvironment, thus they are termed thermal neutrons with en-\nergies around 0.0253 eV. At the opposite end of the energy\nspectrum, high-energy reactions that occur as a result of, for\nexample, positively charged subatomic particles incident on\nnuclear targets in a particle accelerator, can spawn neutrons\nwith extreme energies that are dependent, in part, on the\nenergy of the incident particles. A knowledge of the energy\nspectrum of an environment comprising neutron radiation is\nimportant because the radiation weighting factor for neutrons\nis dependent on their energy.\nAll of the examples of radiation environments described\nabove are manmade. There are, of course, naturally occur-\nring radiation environments such as that arising as a result of\nthe reactions of cosmic rays in the upper atmosphere. Posi-\ntive particles of cosmic origin constantly inundate the earth\nwith energies of up to at least 1020 eV.1 The interaction of\nthis radiation with nitrogen and oxygen in the atmosphere\nyields secondary particles, a significant proportion of which\nare neutrons. The energy spectrum of this radiation field is\ndistinctly harder than that normally associated with terrestrial\nenvironments. The fluence rate of cosmic-ray neutrons in-\ncreases up to an altitude of approximately 20 000 m \u0001the\nPfotzer maximum\u0002 beyond which it falls off, as shown in\nFig. 1. The earth’s magnetic field acts to modulate the flu-\nence rate of cosmic radiation that is incident on the planet’s\natmosphere. This causes the cosmic-ray neutron fluence rate\nand energy spectrum to vary as a function of latitude.2\nCosmic-ray neutrons pose a threat to modern memory-\nintensive electronics because the interaction of these par-\nticles in semiconductor materials can yield both reversible\nand irreversible, i.e., soft and hard errors. In some cases, they\ncan result in catastrophic failure of a device or system. This\nis a particular concern should such electronics be part of an\navionic control system as the failure could undermine the\noperation of the aircraft.\nIf electronic devices and systems are to be tested in the\nreal environment, access to high-altitude platforms is neces-\nsary. These “laboratories” include high-altitude research air-\ncraft and parasitic experiments on commercial aircraft opera-\ntions. However, the use of such platforms is often expensive\nas several measurements can be necessary, due to the low\nfluence rate characteristics of these environments. Further-\nmore, any variation in the flightpath of an aircraft, or as a\nresult of transient solar activity, can change the field. For\nREVIEW OF SCIENTIFIC INSTRUMENTS 79, 023301 \u00012008\u0002\n0034-6748\/2008\/79\u00012\u0002\/023301\/8\/$23.00 © 2008 American Institute of Physics79, 023301-1\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/rsi.aip.org\/rsi\/copyright.jsp\nthese reasons, a comprehensive survey of the extensive range\nof relevant avionic components at high altitudes is widely\nregarded as impractical. Consequently, researchers can be re-\nliant on the use of ground-based cosmic reference facilities,\nsuch as CERF \u0001CERN\u0002, the Theodor Svedberg Laboratories\n\u0001Sweden\u0002, TRIUMF \u0001Canada\u0002, and Los Alamos National\nLaboratories \u0001New Mexico\u0002. These environments afford\ngreater experimental flexibility than possible at high alti-\ntudes, which are cheaper and the fields are often more con-\nsistent and better understood.\nA key question can arise when comparing ground-based\nreference field facilities with the environment of interest:\nHow does the spectrum of the cosmic-ray neutron field and\nthat generated at a ground-based reference facility compare?\nThis question can be answered, in part, via simulation using\na computational modeling method, such as the Monte-Carlo\nmethod. This method has been rigorously tested and is pos-\nsibly the most convenient approach, especially for environ-\nments with energies less than 20 MeV. The use of Monte-\nCarlo techniques for cosmic-ray neutron energies is also\npossible although the outcomes are often held with less con-\nfidence due to the larger uncertainties in the neutron cross-\nsectional data at these energetic extremes. An alternative ap-\nproach is to actually measure the field with a neutron\nmetrology instrument. While this might appear to be a super-\nficially easy and obvious solution, given the long history\nunderpinning neutron detection and measurement, this is not\nthe case. The response of most portable neutron spectrometry\ninstrumentation, as discussed in our related studies,3–5 is lim-\nited to energies of less than 20 MeV. Alternatively, Bonner\nsphere sets have been used to characterize neutron environ-\nments on-board high-altitude, dedicated research aircraft.6\nHowever, these sets have to be extended to spheres of sig-\nnificantly greater diameters to accommodate the higher ener-\ngies present in these environments. This limits the ease with\nwhich such experimental measurements can be made on-\nboard commercial aircraft due to the size and mass of the set\nnecessary. Conversely, because transient solar events are un-\npredictable and their dynamics are not well understood, it is\nunlikely that either the modeling approach or an empirical\nmeasurement would reflect the neutron spectrum of such an\nevent with sufficient accuracy. A worthwhile comparison of\nelectronic upset cross sections measured in terrestrial facili-\nties with measurements made upon capabilities.\nIn this paper, we report on the construction and testing of\na portable, three-band, cosmic-ray neutron detector that may\nalleviate some of the difficulties described above. In an ear-\nlier publication,7 the method used to determine the basic ge-\nometry of the instrument was described which employed the\nhigh-energy Monte-Carlo code MCNPX. In this paper, we de-\nscribe the construction of the instrument and report on its\noperation in a specific natural radiation environment at the\nhigh-altitude Jungfraujoch laboratory. Our research builds on\nthe extended REM counterprinciple1,8,9 and the two-band\narea survey dosimetry principle.10,11 The innovation in our\ndesign is the utilization of boron-coated diodes at two radii\nwithin the moderating structure, surrounding a heavy-metal\nspallation layer and a central proportional counter.\nII. DESIGN SPECIFICATIONS\nBonner spheres12,13 and survey meters operate via the\ndetection of thermal neutrons in a single detector located\nwithin a shell of hydrogenous material. The hydrogenous\nmaterial is necessary to slow the neutrons down to the ther-\nmal region in which the response of the central detector is\nmaximized. Variation in the amount of hydrogenous material\ncauses the peak response of the instrument to shift in energy,\ntherefore enabling a degree of spectroscopic control over the\nresponse. Charge is liberated inside the central gas-filled de-\ntector as a result of the capture of neutrons with, mostly,\nhelium-3 or boron-10 \u0001the latter in the form of boron trifluo-\nride gas\u0002 and it is this electrical signal that is subsequently\nprocessed.\nThis fundamental principle has been extended in the de-\nsign of the instrument described in this work. Unfortunately,\nthe very large homogeneous polyethylene moderators neces-\nsary in Bonner spheres designed to cater for the higher en-\nergies in cosmic-ray neutron environments are unwieldy.\nThis can be overcome, to a certain degree, by augmenting\nthe standard Bonner sphere design to include some high-Z\nmaterial surrounding the central detector to encourage \u0001n ,xn\u0002\nreactions.1,14 A total of 12 silicon diode detectors have been\nadded to the polyethylene moderator structure. Each of these\nhas been coated with a 0.7 mm layer of natural boron. The\nboron-10 component of this essentially converts thermal neu-\ntrons to charged particles which, in turn, are detected in the\nsilicon detector. In the original work performed to optimize\nthe instrument design,7 lithium-6 was used as a converter on\nthe surface of the photodiode. However, as boron was more\nreadily available, it was utilized in the actual construction\ninstead.\nThe purpose of the diodes is to optimize the instrument’s\nresponse in the intermediate and thermal energy ranges. They\nare arranged in concentric shells with six placed on the pe-\nrimeter of the sphere, to capture the low-energy neutron\ncomponent, and six embedded within the moderator structure\nto capture the intermediate energy component. It is antici-\npated that an unfolding program will eventually be written\nwhich will convert the raw data recorded by the discrete\nsensors into neutron field information. The design of the in-\nstrument is based on the outcome of several thousand simu-\nFIG. 1. MCNPX simulation results of the total neutron fluence rate evident at\nvarying altitudes vs altitude.\n023301-2 Monk et al. Rev. Sci. Instrum. 79, 023301 \u00012008\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/rsi.aip.org\/rsi\/copyright.jsp\nlations using the Monte Carlo simulation package MCNPX.7,15\nThe conditions imposed in the original design remit were\nthat the sensor should detect neutrons within an energy range\nof thermal to hundreds of MeV, should be sufficiently du-\nrable to withstand the effects of transportation within a com-\nmercial plane and reasonably portable. Parameters varied in-\ncluded the type and thickness of neutron multiplier used to\nsurround the counter, the amount of polyethylene moderator\nused, and the location of boron-coated photodiodes within\nthe structure. The specifications of the detector were calcu-\nlated as follows:7\n• The SP9 proportional counter at the center of the instru-\nment should be surrounded by a 1.5 cm thick layer of lead.\n• This structure should be surrounded by a further 14 cm of\npolyethylene, equating to a total sphere diameter of 34 cm.\n• Six boron-coated photodiodes should be placed on the out-\nside of the instrument.\n• A further six boron-coated diodes should be placed within\nthe structure at a distance of 14 cm from the center of the\ncounter.\nIII. ASSEMBLY OF THE INSTRUMENT\nAn SP9 proportional counter with a diameter of 33 mm\n\u0001Centronic Ltd.16\u0002 was used as the former to machine the\nlead spallation shield \u0001Goodfellow17\u0002 to the required shape.\nThis provides a uniform layer of lead 15 mm thick around\nthe central detector. The SP9 counter is operated with the aid\nof a Canberra18 preamplifier \u0001model 2006\u0002, which provides\nthe required 900 V potential to bias the gas counter. A\n63 mm diameter spherical hole was drilled into the center of\na sphere of polyethylene for the detector-lead assembly. The\npolyethylene has a density of 0.95 g cm−3 and the sphere a\ndiameter of 340 mm \u0001John Caunt Scientific Ltd.19\u0002. A thin\nbore hole was made in the polyethylene for the stem of the\nSP9 counter. Finally, six holes of depth 40 mm and diameter\n30 mm were bored into the outside of the sphere. These\nholes were machined equidistantly to maintain the isotropic\nresponse of the instrument. The boron-coated photodiodes\nwere then inserted into these holes. Plugs were machined\nfrom polyethylene to plug the holes once the inner layer of\nphotodiodes was in place. A schematic diagram of the detec-\ntor design is provided in Fig. 2. To increase the sensitivity of\nthe instrument and extend the detection range, twelve Cen-\ntronic OSD 15 T \u0001Ref. 16\u0002 photodiodes were coated with\nboron to provide a sensitizing layer for neutrons. The\nboron-10 isotope in this layer is exploited to provide reac-\ntions of the type\n5\n10B + 0\n1n⇒ 3\n7Li + 2\n4\u0002 , \u00011\u0002\nthus converting incident neutrons to alpha particles, the latter\nbeing more easily detected in the silicon layer. Although the\nprocess is not 100% efficient, with suitable calibration, it\nprovides an adequate indication of incoming neutrons within\na small volume as corroborated before by many groups in-\ncluding Brushwood et al.10 The photodiodes provide a sili-\ncon surface area of 15 mm2 and a footprint of 63 mm2. The\nphotodiode is integrated into a circular preamplifier circuit\nfabricated on a printed circuit board \u0001Hybrid Instruments\nLtd.20\u0002 with a diameter of 30 mm. An example of one these\nis shown in Fig. 3. This small circuit board is attached to a\nsix-wire cable of length 2 m \u0001three grounds, +12 V, −12 V,\nand a signal line\u0002 connected to the main electronics module.\nSix of the photodiodes were placed within the drilled holes\nin the sphere at a depth of 40 mm, with the other six located\non the outside of the instrument once the holes were plugged\nwith polyethylene.\nAt the heart of the system is the main electronics module\nshown in Fig. 4. This is contained in an aluminum box 260\n\u0003160\u000370 mm3, and contains three printed circuit boards\ndesigned to perform the essential tasks required in this appli-\ncation. The boards are powered by two switched-mode\npower supplies powered by the mains, which produce dc\npotentials of +24 and −24 V. The three circuit boards are\n• Regulator board: utilizing a series of regulators to obtain\nsmooth dc voltages of +12, −12, +15, and −15 V used by\nthe instrument.\n• High voltage board: employs a high voltage module\n\u0001EMCO High voltage Corp.21\u0002 to transform +12 to\n+900 V, the voltage required to operate the SP9 propor-\ntional counter.\n• Linear amplifier board: containing 13 line driver circuits\nused to ensure the signals received from the SP9 counter\nand the photodiodes are strong enough to travel through\nthe 12 m cable to the logging computer.\nFIG. 2. \u0001Color online\u0002 Basic detector design.\nFIG. 3. \u0001Color online\u0002 Boron diode design.\n023301-3 Cosmic neutron detection instrument Rev. Sci. Instrum. 79, 023301 \u00012008\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/rsi.aip.org\/rsi\/copyright.jsp\nThe module has several inputs and outputs:\n• 12, six pin connections to the photodiode preamps \u0001three\ngrounds, +12 V, −12 V, and 1 signal line\u0002.\n• Two power input lines \u0001+24, −24 V\u0002.\n• One 900 V SHV connection to the SP9 preamplifier.\n• One BNC connection to receive signal from SP9 counter.\n• One 9 pin D connection to power \u0001+24, −24, +12, −24 V,\nGND\u0002.\n• One 15 pin connection to convey signals to the software\ncontrol package.\nThe module is cooled by a fan to expel hot air away\nfrom the circuit through a 40 mm diameter hole in the top of\nthe module. This arrangement was tested and constrained the\ntemperature satisfactorily to within the operational tempera-\nture limits of all the components in the module.\nSignal processing and data logging are performed within\na bespoke LABVIEW environment \u0001National Instruments22\u0002.\nThis enables easy communication with external hardware de-\nvices via several interfaces, such as Universal Serial Bus\n\u0001USB\u0002, General Purpose Interface Bus \u0001GPIB\u0002, or, as in this\ncase, data acquisition \u0001DAQ\u0002. The 13 signals from the sen-\nsors and two grounds are interfaced to the software via a\n6062E PCMCIA DAQ card \u0001National Instruments\u0002. The\nDAQ card has a maximum data rate of 500 kHz and a total\nof 16 input and two output channels. With 13 channels in\nuse, a data rate of 40 kHz is possible per channel, corre-\nsponding to a data point recorded every 25 \u0004s. The pulses\nfrom the SP9 counter and the photodiodes are 100 \u0004s long\nand thus the sampling frequency is suitable for the intended\npoint of the current array of data values is below this is per\n1000 data points \u0001corresponding to 0.025 s\u0002 to prevent an\nerroneous noisy pattern resulting in the registration of a sig-\nnificant number of false positives. Within the likely test en-\nvironments, it is highly unlikely that more than one neutron\nwould be registered in a 0.025 s period. A typical screenshot\nis shown in Fig. 5. The computer used in the operation was a\nDell D410 laptop with a Pentium M 1.6 processor and\n512 Mbytes of RAM. This proved to be sufficient for the\ntask in hand. The instrument in full is shown in Fig. 6.\nIV. TESTING DURING CONSTRUCTION\nTesting of the three-band detector has taken place at sev-\neral development facilities while the instrument has been un-\nder construction.\nThe various discrete sensing elements were tested at the\nWeapons Neutron Research \u0001WNR\u0002 facility at the Los Ala-\nmos National Laboratories.23 At the heart of these laborato-\nries is an 800 MeV linear proton accelerator producing a\nproton beam which strikes a tungsten target. The resultant\nneutron beam is collimated and directed into the Irradiation\nof Chips and Electronics \u0001ICE\u0002 House. The spectrum of this\nradiation field closely matches the atmospheric spectrum\nwith an energy range between 100 keV and 600 MeV with a\ntotal fluence rate of 4.1\u0003105 cm−2 s−1. 1 h in the full\nstrength beam is equal to approximately 1\u0003106 h at an alti-\ntude of 39 000 ft. The WNR Facility provides neutron and\nproton beams for basic, applied, and defense-related re-\nsearch, and offers virtually unlimited space in which to place\nany equipment, as shown in Fig. 7. The energy range of the\nbeam is too high for any of the thermal sensors in the instru-\nment, although the lower energy scatter neutrons were cap-\ntured by simply placing the various sensors in areas outside\nof the main beam.\nThis trial also presented an opportunity to develop and\ntest the software used to record and log the neutron events.\nWithin the ICE house, the test area is separated from the\nmonitoring area by a wall of approximately 2 m in height.\nThe first two of the five results shown in Table I are taken\nwhen the counter was within the monitoring area. These two\nresults indicate that when the neutron beam is on in the test\narea, the fluence rate has increased by 100% in comparison\nto the background reading. The result with the SP9 counter\nin the actual beam, actually revealed an almost constant state\nof saturation. It should be noted that the absolute fluence rate\nFIG. 4. \u0001Color online\u0002 Central electronics box. FIG. 5. \u0001Color online\u0002 The software interface used to record and log\nneutrons.\nFIG. 6. \u0001Color online\u0002 The complete instrument.\n023301-4 Monk et al. Rev. Sci. Instrum. 79, 023301 \u00012008\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/rsi.aip.org\/rsi\/copyright.jsp\nvalues should be ignored as, at this point, virtually any pulse\narising from the counter was recorded as a neutron, whereas\nthe majority of these would be almost certainly be due to \u0001\nradiation arising as a result of neutron scattering reaction in\nthe surrounding material of the laboratory.\nBasic testing of the instrument was conducted at the ISIS\nfacility as part of the SPAESRANE collaboration24 \u0001Ruther-\nford Appleton Laboratory, Oxford, U.K.\u0002.25 The ISIS facility\nconsists of a proton synchrotron, and several targets, one of\nwhich enables neutron production with a measured fluence\nrate of 6.7\u0003104 cm−2 s−1. However, unlike at WNR \u0001Los\nAlamos\u0002, the test area was \u0001at time of testing\u0002 of very limited\nsize with restricted access to the beam. This meant that the\nLancaster instrument could not be used in its completed for-\nmat due to restrictions on space, although the 13 individual\nsensors could be, thus restricting the sensitivity range to ther-\nmal neutrons. Unfortunately, on this occasion significant lev-\nels of noise on one of the photodiode data lines was suffi-\ncient to result in cross-talk with other lines and thus no\nmeaningful data were recorded, even from the SP9 channel.\nIn the course of the development of the Lancaster instru-\nment, several visits were made to the BAE Systems neutron\nfacility \u0001Barrow-in-Furness, U.K.\u0002. This facility has several\ncalibrated neutron and \u0001-ray sources including caesium-137\n\u0001662 keV\u0002, cobalt-60 \u00011.1 and 1.3 MeV\u0002 and cobalt-57\n\u000112 keV\u0002. This resource was especially beneficial to the\nproject as direct comparison could be made with the re-\nsponse of lithium-coated photodiodes \u0001Centronic OSD\n7.5 T\u0002, fabricated and tested by BAE Systems at the site. The\nfacility consists of a large room with a camera constantly\nmonitoring the output of an oscilloscope in the test area. A\nsmall observation room nearby allows the camera output to\nbe monitored without exposure to the radioactive sources.\nAn americium-beryllium source \u0001Liverpool University,\nU.K.\u0002 was used to test the instrument at incremental stages in\nits construction to improve the portability of the set up and\ngeneral operational logistics prior to testing further afield. A\nweak americium-beryllium source \u0001Lancaster University,\nU.K.\u0002 capable of producing regular low-flux, low-energy\nneutron output proved to be an essential tool in the\ndevelopment of the Lancaster instrument. Its location al-\nlowed an extremely fast test-fix-test turnaround due to its\nobvious proximity to the development area in the Engineer-\ning department.\nV. COMPLETE INSTRUMENT TESTING AT THE\nJUNGFRAUJOCH RESEARCH LABORATORY\nThe JungFrauJoch research laboratory is located in\nsouthern Switzerland, 3580 m above sea level at a mean air\npressure of 653 mbars. Extensive research is undertaken at\nthis location in the fields of hydrology, meteorology, glaciol-\nogy, radiation, astronomy, and cosmic rays. The station con-\nsists of several parts such as the railway station, restaurant,\naccommodation block, and research station itself, all con-\nnected by an underground tunnel network. The building at\nthe highest altitude \u0001known as the Sphinx\u0002 consists of two\nlarge laboratories, a weather observation station, a workshop,\ntwo terraces for scientific experiments, and a meteorological\ncupola. The station is shown in Fig. 8.\nFrom November 2006 until April 2007, the completed\nthree-band neutron-ray detector was installed in the upper\nlaboratory in the Sphinx building. The instrument was moni-\ntored constantly on a remote basis via a Virtual Network\nConnection. This allowed remote real-time data analysis at\nLancaster University throughout the 5 months’ test period.\nAs a reading for each sensor was recorded every hour, an\nenormous data set was recorded throughout the course of the\ninstrument’s operation with over 48 000 total results re-\ncorded to disk. Only a limited number of these can be shown\nin this publication. The mean fluence rate logged by the as-\nsorted sensors is shown in Table II with the average thermal\nneutron fluence rate for the six photodiodes on the outside of\nthe structure \u0001the outer layer\u0002 and the corresponding value\nfor the six photodiodes imbedded 3 cm inside \u0001the inner\nlayer\u0002. The average neutron fluence rate recorded at the out-\nFIG. 7. \u0001Color online\u0002 The test area in the ICE house, LANL.\nTABLE I. Early LANL results achieved using the SP9 counter.\nLocation Fluence rate \u0001cm−2 s−1\u0002\nIn monitoring area \u0001beam off\u0002 0.183\nIn monitoring area \u0001beam on\u0002 0.363\nIn test area \u0001beam off\u0002 0.181\nIn test area \u0001beam on\u0002 3.65\nIn beamline \u0001beam off\u0002 0.182\nIn beamline \u0001beam on\u0002 15.33\nFIG. 8. \u0001Color online\u0002 The JungFrauJoch mountain.\n023301-5 Cosmic neutron detection instrument Rev. Sci. Instrum. 79, 023301 \u00012008\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/rsi.aip.org\/rsi\/copyright.jsp\nside of the structure was 0.001 83 cm−2 s−1 compared to an\naverage fluence rate of 0.001 91 cm−2 s−1 recorded at a depth\nof 3 cm within the instrument.\nVI. CALIBRATION\nAlthough the boron-coated photodiodes operate with the\nsame basic principle, the chances of two diodes exhibiting\nidentical responses are negligible due to inevitable discrep-\nancies in the boron layer thickness and consistency. To en-\nsure that the neutron fluence rate recorded with the boron\nphotodiodes and the SP9 proportional counter is normalized,\nan experiment was set up in the Physics Department of Lan-\ncaster University, utilizing an americium-beryllium radioac-\ntive source. The 12 photodiodes and SP9 counter were\nplaced in a circular shape of radius 10 cm, with the source in\nthe center ensuring an even fluence rate distribution through-\nout the sensors’ arrangement, as shown in Fig. 9. The sensors\nwere left running for 3 h to afford a comprehensive compari-\nson between them. The total number of neutrons recorded by\neach of the detectors is shown in Table III, along with the\naverage fluence rate. It appears that in transit from the Jung-\nFrauJoch mountain peak, diode numbers 7 and 11 were bro-\nken since no neutron response was observed from these sen-\nsors in this calibration. The SP9 proportional counter is, as\nwould be expected, the most sensitive of the neutron detec-\ntion instruments used and accordingly exhibited the highest\nresponse here; 150 37 neutrons over the course of 3 h corre-\nsponding to a fluence rate of 0.2841 cm−2 s−1\nVII. ADJUSTED RESULTS\nAlthough two of the photodiodes were damaged, the re-\nsults from the other ten photodiodes and the SP9 counter\nwere adjusted using the calibration results. The normalized\nresults are shown in Table IV. Furthermore, the normalized\nneutron fluence rate recorded by the centrally located\nproportional counter is shown in Fig. 10, with similar results\nshown for the total outer and inner layers of diodes \u0001Figs. 11\nand 12\u0002.\nVIII. CONCLUSIONS\nIn this paper, we have described the construction of a\nportable, energy-sensitive three-band neutron detector. Fur-\nthermore, we have illustrated how the instrument has been\nTABLE II. Total neutron counts and fluence rate for each individual sensor\nin the instrument over 5 months \u0001raw data\u0002 at the JungFrauJoch research\nstation.\nSensor Total counts \u0001cm−2\u0002 Fluence rate \u0001cm−2 s−1\u0002\nSP9 999 26 0.008 44\nDiode 1 325 13 0.002 75\nDiode 2 259 87 0.002 19\nDiode 3 187 33 0.001 58\nDiode 4 204 53 0.001 73\nDiode 5 173 27 0.001 46\nDiode 6 147 80 0.001 25\nDiode 7 293 47 0.002 48\nDiode 8 157 80 0.001 33\nDiode 9 185 80 0.001 57\nDiode 10 171 83 0.001 51\nDiode 11 204 40 0.001 73\nDiode 12 336 13 0.002 84\nOuter 216 32 0.001 83\nInner 225 96 0.001 91\nFIG. 9. \u0001Color online\u0002 Calibration configuration with 13 neutron sensors\neach 10 cm from AmBe source.\nTABLE III. Total counts, fluence rate, and calibration factor of each sensor\nwhen 10 cm from AmBe source.\nSensor Total counts \u0001cm−2\u0002 Fluence rate \u0001cm−2 s−1\u0002 Weighting \u0001%\u0002\nSP9 15 037 0.2841 100\nDiode 1 131 0.0809 28.46\nDiode 2 167 0.1031 36.28\nDiode 3 43 0.0265 9.34\nDiode 4 11 0.0067 2.39\nDiode 5 40 0.0247 8.69\nDiode 6 37 0.0228 8.04\nDiode 7 ¯ ¯ ¯\nDiode 8 41 0.0253 8.91\nDiode 9 31 0.0191 6.73\nDiode 10 9 0.0056 1.96\nDiode 11 ¯ ¯ ¯\nDiode 12 143 0.0883 31.07\nOuter 429 0.0441 15.53\nInner 224 0.0346 12.17\nTABLE IV. Calibration adjusted results from the JungFrauJoch experiment.\nSensor Norm. fluence rate\nSP9 0.008 44\nDiode 1 0.009 65\nDiode 2 0.006 05\nDiode 3 0.016 93\nDiode 4 0.072 26\nDiode 5 0.016 83\nDiode 6 0.015 52\nDiode 7 ¯\nDiode 8 0.014 96\nDiode 9 0.023 29\nDiode 10 0.076 92\nDiode 11 ¯\nDiode 12 0.009 14\nOuter 0.022 87\nInner 0.031 07\n023301-6 Monk et al. Rev. Sci. Instrum. 79, 023301 \u00012008\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/rsi.aip.org\/rsi\/copyright.jsp\ntested at international neutron reference facilities. The detec-\ntor consists of an SP9 proportional counter of diameter\n33 mm surrounded with a 15 mm thick layer of lead to en-\ncourage spallation reactions. This structure is enclosed by a\nfurther 140 mm thick spherical layer of hydrogenous poly-\nethylene designed to reduce the energy of incident high-\nenergy neutrons to a level detectable with thermal capture\ntechniques. 12 photodiodes have been coated with a thin\nlayer of boron to encourage alpha particle emission as a re-\nsult of thermal neutron capture. Six of these diodes are\nplaced on the outside of the polyethylene structure to capture\nthermal neutrons with further six located at 3 cm within the\nlayer to detect incoming neutrons of an intermediate energy.\nThe data gathered by these 13 discrete sensors can be com-\nbined to produce a neutron field description using unfolding\ntechniques combined with work completed in an earlier\npublication.7\nThe instrument, at various states during its construction,\nhas been tested at several national and international facilities.\nThese include the Los Alamos National Laboratories \u0001New\nMexico\u0002, The ISIS facility \u0001Oxfordshire\u0002, BAE Systems, the\nPhysics departments at Lancaster and Liverpool Universities,\nand the JungFrauJoch research station \u0001Switzerland\u0002. The re-\nsults obtained from the first set of trials were carried out to\noptimize sensor design. The second trial was carried out at\nthe JungFrauJoch research station, to test the completed in-\nstrument. The results acquired from the instrument while lo-\ncated at the JungFrauJoch site indicate a normalized fluence\nrate of 0.0084 of thermal neutrons at the center of the instru-\nment, a normalized fluence rate of 0.022 87 recorded at the\noutside of the structure and a normalized fluence rate of\n0.031 07 recorded at a depth of 3 cm within the instrument.\nUnfortunately, the JungFrauJoch research station experi-\nences lengthy power cuts which will obviously render the\ninstrument unoperational for long periods of time, as can be\nobserved in Fig. 10 where for three periods of time, the\npower was off long enough for null values to be recorded by\nthe instrument. This effect is also observable on Figs. 11 and\n12, but is not so obvious due to the proximity of the base line\nto the x axis. Shorter periods of downtime were highly prob-\nable throughout the testing period meaning that absolute val-\nues cannot be held in high regard. However, as a cut in\npower would be expected to affect all of the channels, the\nratio between the channels should not be affected by this\nproblem. For future work, an uninterruptable power supply\nwill be used.\nLarge neutron fluence rate peaks were noted at several\nperiods by both the inner and outer layers of photodiodes,\nmost noticeably on the 17th of March 2007. This particular\npeak is only slight in the result set derived from the central\nSP9 counter, an approximate rise of 30% above average\ncompared with a rise of around 2500% above average for the\ninner layer of photodiodes. The neutron monitor based in the\nlaboratory does not feature a peak on this date, indicating a\nfalse positive registered by the Lancaster University spec-\ntrometer.\nAs mentioned earlier in the report, an unfolding algo-\nrithm has yet to be written to convert the raw data recorded\nby each sensor, into a neutron field. Until this has been\nachieved, there is no way to know whether the data recorded\nby the spectrometer match the traditional theoretical field at\nthis position.\nThe original aim of this work was to construct an\nenergy-sensitive portable robust cosmic-ray neutron spec-\ntrometer. Obviously the failure of diodes 7 and 11 indicates\nthat the instrument is not robust enough to completely satisfy\nthese criteria. However, in future work, we plan to make\nanother version of the instrument with several key improve-\nments:\n• Implement an unfolding program to convert the raw data to\nspectroscopic information.FIG. 11. Total neutron counts received by outer layer of diodes.\nFIG. 12. Total neutron counts received by inner layer of diodes.FIG. 10. Total neutron counts received by central SP9 counter.\n023301-7 Cosmic neutron detection instrument Rev. Sci. Instrum. 79, 023301 \u00012008\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/rsi.aip.org\/rsi\/copyright.jsp\n• Improve robustness of the boron-coated photodiodes\nthrough perfected circuit design.\n• Implemented wireless connectivity between the diodes and\nthe laptop computer.\n• Improved neutron-gamma discrimination.\nACKNOWLEDGMENTS\nWe would like to acknowledge the support of BAE Sys-\ntems and the help and advice of Richard Jenkins at BAE\nSystems \u0001Barrow\u0002, John Windsor at Lancaster University\nPhysics Department and Chris Frost at ISIS. We are also\nindebted to Louise Wilson, Martin Fisher, Joan Fisher, Kurt\nHemund, and Gertrud Hemund at the JungFrauJoch Re-\nsearch Laboratory, the SPAESRANE consortium members\nand Bruce Takala at Los Alamos National Laboratories.\n1 C. Benson, M. J. Joyce, B. O’Connell, and J. Silvie, IEEE Trans. Nucl.\nSci. 47, 2417 \u00012000\u0002.\n2 H. R. Vega-Carillo and E. Manzanares-Acuna, Nucl. Instrum. Methods\nPhys. Res. A 524, 146 \u00012004\u0002.\n3 J. A. Weaver, M. J. Joyce, A. J. Peyton, and J. Roskell, Nucl. Instrum.\nMethods Phys. Res. A 476, 143 \u00012002\u0002.\n4 J. A. Weaver, M. J. Joyce, and A. J. Peyton, Rev. Sci. Instrum. 72, 2043\n\u00012001\u0002.\n5 B. D’Mellow and M. J. Joyce, Radiat. Phys. Chem. 71, 727 \u00012004\u0002.\n6 P. Goldhagen, M. Reginatto, T. Kniss, J. W. Wilson, R. C. Singleterry, I.\nW. Jones, and W. Van Steveninck, Nucl. Instrum. Methods Phys. Res. A\n476, 42 \u00012002\u0002.\n7 S. D. Monk and M. J. Joyce, Radiat. Prot. Dosim. 123, 3 \u00012007\u0002.\n8 C. Birattari, A. Ferrari, C. Nuccetelli, M. Pelliccioni, and M. Silari, IEEE\nTrans. Nucl. Sci. 297, 230 \u00011990\u0002.\n9 C. Birattari, A. Ferrari, C. Nuccetelli, M. Pelliccioni, and M. Silari, Ra-\ndiat. Prot. Dosim. 44, 193 \u00011992\u0002.\n10 J. M. Brushwood, P. A. Beeley, and N. M. Spyrou, Nucl. Instrum. Meth-\nods Phys. Res. A 476, 304 \u00012002\u0002.\n11 D. T. Bartlett, R. J. Tanner, and D. G. Jone, Radiat. Prot. Dosim. 74, 267\n\u00011997\u0002.\n12 R. L. Bramblett, R. I. Ewing, and T. W. Bonner, Nucl. Instrum. Methods\n9, 1 \u00011960\u0002.\n13 D. J. Thomas and A. V. Alvera, Nucl. Instrum. Methods Phys. Res. A 476,\n12 \u00012002\u0002.\n14 V. Vylet, Nucl. Instrum. Methods Phys. Res. A 476, 26 \u00012002\u0002.\n15 See \u0001http:\/\/mcnpx.lanl.gov\/\u0002.\n16 Centronic House, King Henry’s Drive, Croydon, Surrey CR9 0BG, En-\ngland.\n17 Ermine Business Park, Huntingdon, Cambridgeshire PE29 6WR, England.\n18 800 Research Parkway, Meriden, CT 06450.\n19 John Caunt Scientific Limited, P.O. Box 1052, Oxford OX2 6YE.\n20 Hybrid Instruments Ltd. Engineering Department, Lancaster University,\nLA1 4YR.\n21 EMCO High Voltage Corporation, 70 Forest Products Road, Sutter Creek,\nCA 95685.\n22 National Instruments U.K., Measurement House, Newbury Business Park\nLondon Road Newbury, Berkshire RG14 2PS.\n23 See \u0001http:\/\/wnr.lanl.gov\/home.htm\u0002, P.O. Box 1663 Los Alamos, NM\n87545.\n24 See \u0001www.spaesrane.com\u0002.\n25 See \u0001http:\/\/www.isis.rl.ac.uk\/\u0002.\n023301-8 Monk et al. Rev. Sci. Instrum. 79, 023301 \u00012008\u0002\nAuthor complimentary copy. Redistribution subject to AIP license or copyright, see http:\/\/rsi.aip.org\/rsi\/copyright.jsp\n"}