{"doi":"10.1080\/00131911003637014","coreId":"18995","oai":"oai:eprints.bham.ac.uk:592","identifiers":["oai:eprints.bham.ac.uk:592","10.1080\/00131911003637014"],"title":"Is there a crisis in school science education in the UK?","authors":["Smith, Emma"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-05","abstract":"This paper reviews the extent to which contemporary concerns over the recruitment, training and retention of scientists have persisted among science education policy makers. Drawing upon key government reports that have been commissioned in order to review the position of science education and training over the last 90 years, we consider the historical context of contemporary 'moral panics' about the position of science education in schools. Three themes emerge: the nature and purpose of the school science curriculum, the recruitment of science undergraduates, and the teaching of science in schools. The review suggests that many of the concerns which pre-occupy us today, such as the perceived ‘quality’ of the science teaching workforce, are the very same that existed when science was first introduced as a school subject. This raises issues about the role of policy in influencing educational change more generally but also questions whether there ever was a ‘golden age’ for science education in the UK","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Taylor & Francis","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.bham.ac.uk:592<\/identifier><datestamp>\n      2012-01-01T01:05:05Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5131<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42:4C4232333631<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42:4C4231363033<\/setSpec><setSpec>\n      7375626A656374733D4C:4C31<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Is there a crisis in school science education in the UK?<\/dc:title><dc:creator>\n        Smith, Emma<\/dc:creator><dc:subject>\n        LB2361 Curriculum<\/dc:subject><dc:subject>\n        Q Science (General)<\/dc:subject><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LB1603 Secondary Education. High schools<\/dc:subject><dc:subject>\n        L Education (General)<\/dc:subject><dc:description>\n        This paper reviews the extent to which contemporary concerns over the recruitment, training and retention of scientists have persisted among science education policy makers. Drawing upon key government reports that have been commissioned in order to review the position of science education and training over the last 90 years, we consider the historical context of contemporary 'moral panics' about the position of science education in schools. Three themes emerge: the nature and purpose of the school science curriculum, the recruitment of science undergraduates, and the teaching of science in schools. The review suggests that many of the concerns which pre-occupy us today, such as the perceived ‘quality’ of the science teaching workforce, are the very same that existed when science was first introduced as a school subject. This raises issues about the role of policy in influencing educational change more generally but also questions whether there ever was a ‘golden age’ for science education in the UK.<\/dc:description><dc:publisher>\n        Taylor & Francis<\/dc:publisher><dc:date>\n        2010-05<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.bham.ac.uk\/592\/1\/Ed_Review_paper_final_post%2Dprint.pdf<\/dc:identifier><dc:relation>\n        public<\/dc:relation><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/592\/1.hassmallThumbnailVersion\/Ed_Review_paper_final_post%2Dprint.pdf<\/dc:relation><dc:relation>\n        http:\/\/dx.doi.org\/10.1080\/00131911003637014<\/dc:relation><dc:identifier>\n        Smith, Emma (2010) Is there a crisis in school science education in the UK? Educational Review, 62 (2). pp. 189-202. ISSN 0013-1911<\/dc:identifier><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/592\/<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["public","http:\/\/eprints.bham.ac.uk\/592\/1.hassmallThumbnailVersion\/Ed_Review_paper_final_post%2Dprint.pdf","http:\/\/dx.doi.org\/10.1080\/00131911003637014","http:\/\/eprints.bham.ac.uk\/592\/"],"year":2010,"topics":["LB2361 Curriculum","Q Science (General)","LB Theory and practice of education","LB1603 Secondary Education. High schools","L Education (General)"],"subject":["Article","PeerReviewed"],"fullText":"1 \n \n'This is an electronic post-print version of an article published in Educational Review \nVol. 62, No. 2 (2010): 189-202. Educational Review is available online at: \nhttp:\/\/www.tandf.co.uk\/journals\/titles\/0013-1911.asp.  \n \nIs there a crisis in school science education in the UK? \n \nSmith, E., (2010), Is there a crisis in school science education in the UK? Educational  \n Review, 62(2), pp189-202. \n \nAbstract \n \nThis paper reviews the extent to which contemporary concerns over the recruitment, \ntraining and retention of scientists have persisted among science education policy \nmakers. Drawing upon key government reports that have been commissioned in order \nto review the position of science education and training over the last 90 years, we \nconsider the historical context of contemporary 'moral panics' about the position of \nscience education in schools. Three themes emerge: the nature and purpose of the \nschool science curriculum, the recruitment of science undergraduates, and the \nteaching of science in schools. The review suggests that many of the concerns which \npre-occupy us today, such as the perceived ‘quality’ of the science teaching \nworkforce, are the very same that existed when science was first introduced as a \nschool subject. This raises issues about the role of policy in influencing educational \nchange more generally but also questions whether there ever was a ‘golden age’ for \nscience education in the UK. \n \n \nIntroduction \n \n‘Grave shortage of science teachers’ \n \n‘1500 unfilled university places’  \n \n‘University science places unfilled’  \n \nHeadlines such as these taken from The Times newspaper are not unfamiliar to those \ninvolved in training the next generation of scientists, engineers and technologists. We \nfrequently read that science undergraduates are less well qualified in comparison with \nArts and Humanities undergraduates; that too few Physics teachers have appropriate \nqualifications; that falling numbers on degree programmes result in the closure of \nuniversity Physics and Chemistry departments and so on. But what is perhaps most \ninteresting about these headlines is not that they reflect contemporary concerns about \nthe state of science education but rather that each headline was written over 40 years \nago by commentators who appear to be concerned with the very same ‘science \nproblems’ that preoccupy us today. In this paper, we are interested in the extent to \nwhich perspectives on the 'science problem' have changed over time and consequently \nin asking whether there ever was a 'golden age' for science education in the UK? \nDrawing upon key Government reports that have been commissioned in order to \nreview the position of science education and training over the last 90 years, we \n2 \n \nconsider the historical context of contemporary 'moral panics' about school science \neducation.  \n \nAs we shall see here, the evolution of school science education from its status as a \nminority subject a century ago to its current position at the core of the National \nCurriculum in England and Wales has not been straightforward. In the later part of the \nNineteenth Century, curriculum debates were focussed largely around the primacy of \nthe Mathematical and Classical curriculum versus the status of 'newer' subjects such \nas modern languages and science (Turner 1980, Delamont 1988). Curriculum \nreformists during this period, most notably the British Association for the \nAdvancement of Science (BAAS), sought to establish a science curriculum in the \ncountry's schools and thus seek parity of esteem between the Classical and Scientific \nsubjects (Layton 1981). Their efforts, in particular, were directed towards the large \npublic schools which had traditionally been more resistant to the teaching of science. \nThus leading to worries among some reformists about the 'unequal diffusion of \nscientific knowledge' between the different social classes: 'it would be an \nunwholesome and vicious state of society in which those who are comparatively \nunblessed with fortune's gifts should be generally superior in intellectual attainment to \nthose above them in station' (Lord Wrottesley, cited in Layton 1981, p190). This \nresistance to the teaching of science in some of the country's most prestigious public \nschools can largely be explained by the close relationship these schools held with the \nUniversities, particularly Oxford and Cambridge, as well as the Army and Civil \nService: the entrance examinations for which required a knowledge of the Classics \nwhich left little room for the teaching of Science. For example, between 1906 and \n1915, 11% of scholarships awarded by the Oxford Colleges were for Science, \ncompared with 63% for Classics (Jenkins 1979). \n \nThese demands for a curriculum for science, and with it debate over the nature of such \na curriculum, gathered pace during the time of the Great War. Writing in The Lancet \nin 1918, EH Starling complained about the ‘gross deficiencies of our educational \nsystem … it is the absence of sciences and scientific method…which has been \nresponsible for our failures of leadership in the conduct of the war, whether at home \nor on the Western front’ (p365). While at the same time Bell was concerned that \nscience education was not keeping pace with the advances being made in scientific \ninvestigation and discovery: ‘public education is still dominated by traditional aims \nand little is being accomplished in inculcating the scientific temper of thought’ (Bell, \n1915, p634). Concerns about scientific illiteracy were not confined to the country's \nschools, long standing deficits in the scientific knowledge of the political elite and the \nhigher levels of the Civil Service were also evident, as this excerpt from the 'Neglect \nof Science' committee's memorandum to The Times newspaper in 1916 shows: \n \n'It is not our intention here to enumerate the catalogue of specific instances in \nwhich a want of understanding of 'physical' science' has led the ministry and \nexecutive into error. This has been done elsewhere, but as an example of the \nignorance which we deplore we may instance the public statement of a \nmember of the Government, unchallenged when made, that his colleagues \nshould be excused for not having prevented the exportation of lard to \nGermany, since it had only recently been discovered that glycerine (used in \nthe manufacture of explosives) could be obtained from lard. The fact is, on the \ncontrary, that the chemistry of soap-making and the accompanying production \n3 \n \nof glycerine is very ancient history' (The Times 2nd February 1916, p10, see \nalso Adlam 1919). \n \nArguably these concerns over an apparent lack of scientific expertise among the \npolitical elite remain relevant to this day. At the start of 2009, only two members of \nthe UK government and shadow cabinet had a scientific background: one a medical \ndoctor and the second a Chemistry graduate. \n \nIn 1918, in response to concerns regarding this apparent ‘neglect of science’, the \ngovernment commissioned JJ Thomson, then Chair of the Royal Society, to lead a \nreview into the natural sciences in the school curriculum. The concern of the \nCommittee about the status of Science was evident from the opening sentence of their \nreport:  \n \n‘Not for the first time our educational conscience has been stung by the \nthought that we are as a nation neglecting science’ (Committee to Enquire into \nthe Position of Natural Science in the Educational System of Great Britain, \n1918, p1). \n \nFollowing the Thomson Committee's report there have been a number of influential \nGovernment-commissioned reports aimed at understanding and remedying the issue \nof education and training in the sciences. Indeed, whether it is the early Twentieth \nCentury 'neglect of science', or 'the swing from science' we saw during in the 1960s \nand 1970s or the 'science problems' that we hear about today, concerns about the \npurpose of science education, how it is taught, who teaches it and to which types of \nstudents, have a very long pedigree indeed (see for example, Sykes 1998).  \n \nIn undertaking this brief review of key government committee reports which relate to \nscience education and training, three themes emerge: the nature and purpose of the \nschool science curriculum, the recruitment of science undergraduates, and the \nteaching of science in schools.  \n \nThe schooling of science \n \nWe begin here by considering the aims of school science education and in doing so \nsuggest two potentially conflicting roles for science education: to provide scientific \ntraining in preparation for university plus a broader social aim of educating a \nscientifically literate population. \n \nIn 1867 the Taunton Committee was commissioned to oversee a curriculum for \nscience; its recommendations were to set down the blue print for school science \neducation that was to remain for next half century (Layton 1981). The Committee \nlisted five arguments for the teaching of science in school: that it would provide \nmental training and encourage the development of deductive and reasoning skills; that \nit would form part of a well-rounded education for all students, even those whose \naptitude lay in non-science areas; that a knowledge of science was important for all \ncitizens as well as for society; and finally that learning science was both pleasurable \nand useful (Jenkins 2007). In practice, however, it was the focus on mental training \nwhich prevailed, with even the BAAS advocating that the advancement of science \neducation be 'untrammelled by considerations of utility' (Layton 1981, p197). Much \n4 \n \nmore recently, the Royal Society’s State of the Nation review of 14-19 Science and \nMathematics Education (Royal Society 2008) has brought further attention to the dual \nchallenges for science education. The first of which, according to the report, is to \nprovide science and mathematics education that is ‘appropriate for students of all \nlevels of attainment in an environment where more students remain in education post-\n16’ and the second to ‘give a solid core grounding in science and mathematics to \nthose who will probably not continue studying these subjects post-16’ (p17). Thus we \nhave a potential tension between the schooling of scientific method in the pursuit of \nknowledge and the practical utility of scientific knowledge: a tension which arguably \nprevails.  \n \nAccording to Hurd (1991, p251), in the 200-year history of school science teaching, \ncourses have been taught and organised as ‘mirror images’ of the research disciplines \nfound in universities, which required early specialisation in preparation for university \ncourses. The need for such early specialism in the sciences had long been criticised \nfor limiting the opportunities for students to study science in the later years of \nsecondary school because of choices they may have made at the age of 14: ‘a key area \nof conflict is the extent to which science teaching should prepare a technical and \nscientific elite or should be available to and serve the needs of the majority’ (Walford \n1985, p158). Such criticisms perhaps point to the divisive nature of school science \nwhich, according to Young (1976, p59), produces three types of people: the pure \nscientists who are interested in the pursuit of the truth and who seek an ‘abstracted \nunderstanding’ of science; the applied scientists whose pragmatic approach leads to \nthe economy for example defining the goals of science; and finally the failures, who \nare anti-science, anti-technology and see science as ‘domination’. These concerns are \nnot new, as far back as 1915 the need for a broader curriculum was made apparent: \n‘the teaching of science needs a complete reorganisation from bottom to top from the \npoint of view of developing the keenest possible interest in the student for a broader \nknowledge of scientific discoveries’ (Bell 1915, p635). \n \nThe issue of a broader secondary science curriculum was also raised by the Thomson \nCommittee who advocated science teaching which drew attention to everyday life and \nthe natural phenomenon of science in which science should be ‘kept as closely \nconnected with human interests as possible’ (Committee to Enquire into the Position \nof Natural Science in the Educational System of Great Britain, 1918, paragraph 47). \nAlthough requiring some specialism post-16 so that ‘the imaginative and logical \nfaculties can be best trained by the intensive study of a few subjects’ (paragraph 58), \nthe Committee recommended that ‘those specialising in science should continue some \nliterary study, and those specialising in literary subjects should give some time to \nscience work of an appropriate kind’ (page 239). They also recommended the \ndevelopment of advanced courses in the natural sciences for those not wishing to \nspecialise at university, such courses could be developed by the teacher but ought to \ninclude elements of astronomy, geology, meteorology, physiology and the \ndevelopment of scientific ideas. \n \nForty years later, the Crowther report into the 15-18 curriculum also concluded that \nthe curriculum of the sixth form 'cannot be drawn up with the needs of only future \nuniversity students in mind' (Ministry of Education, 1959, paragraph 422). Echoing \nthe Thomson Committee's concerns that science specialists ought to be literate and \narts specialists numerate, the report was critical of the congested pre-16 curriculum as \n5 \n \nwell as of the potential negative impact on future careers of limiting subject choices at \n14, particularly in science. They argued that this specialisation is made 'not \nnecessarily because of any educational evidence that this is the right age for boys (sic) \nto make their choice, but in the belief that if they do not start early, they will not be \nsufficiently prepared by 18 to meet university requirements' (paragraph 314).  \n \nIn 2005, concerns over the specialist nature of the curriculum were again apparent in \none of the more recently published reports on the issue: ‘a balance must be struck in \nthe curriculum between what is suitable for the minority who wish to specialise in \nscience and what might be more valuable for the majority who will not become \nscientists’ (Save British Science 2005, p45). In order to achieve this balance the \nauthors advocate, perhaps unsurprisingly, that science remain compulsory in school \nbut that the curriculum be much broader so as to encourage more humanities and arts \nstudents to study science as well as teaching science taught across other curriculum \nareas, for example in History or Religious Education.  \n \nAs we have seen, the debate over the purpose of science education in schools \ncontinues, with some commentators arguing for alternative models for the science \ncurriculum which consider science achievements as ‘benefiting the common good and \nfostering the welfare of individuals’ (Hurd 1991 p251). To some extent there has been \na lack of agreement over what this society oriented science curriculum should look \nlike but in general there is some consensus that the ‘traditional discipline bound \nscience curriculum with the principle goal of preparing students for the practice of \nscience is outmoded in terms of the ethos of modern science, the nation’s economy \nand citizens’ education’ (Hurd 1991, p257). Indeed, from the Nuffield Science \nprogrammes of the 1960s, to the GCSE double science award at the end of the 1980s, \nto Curriculum 2000 and the Twenty First Century Science programme there have \nbeen continued attempts to improve the school science curriculum which its critics \ncontinue to perceive to be unapproachable and unappealing (Roberts 2002, p72). \n \nWhen science became a core component of the National Curriculum in England and \nWales in 1989, the debate over enforced specialisation at 14 and the need for a \nbroader curriculum ought to have been resolved: now all students were to spend a \nsignificant proportion (for many around 20%) of their time studying science through \nto the end of compulsory schooling. However, a new phase of the debate has begun \nwith the Government  now promising that by 2014, 90% of state schools will offer \nsingle subject science teaching (or triple science) and the number studying for \nseparate GCSEs in Chemistry, Physics and Biology will be doubled (Brown 2009). \nThis further broadening of the science curriculum is, of course, in the hope that more \nyoung people will be encouraged to study the subject beyond the age of 16, an issue \nwe return to in the next section. \n \nThe quality and supply of undergraduate scientists \n \nOur discussion of the aims and purposes of school science education has revealed \nlong standing concerns that a narrow science curriculum and enforced early \nspecialisation has led to science becoming an elite subject largely studied by the more \nable and which has limited relevance to the ordinary citizen. In this next section, we \nconsider the claim that school science has failed to provide sufficient entrants of high \n6 \n \nenough quality to fulfil the needs of Higher Education and as a consequence the \ncountry’s ability to compete economically.  \n \nBetween the two Wars the number of science and technology students studying at \nEnglish Universities and University Colleges had hardly varied (Jenkins 1979). This \nwas to change following the economic and social changes which accompanied the end \nof the Second World War. In 1963 the Macmillan Government commissioned Lord \nRobbins to review the medium and long-term expansion of Higher Education and in \nparticular to consider how the sector would cope with the predicted shortfall of \nuniversity places caused by the large numbers of young people who were born after \nthe War and who would be eligible to enter higher education between 1965 and 1968 \n(Committee of Higher Education 1968). In addition to recommending the expansion \nof the Higher Education sector, the Robbins Committee also advocated the \nintroduction of broader courses, especially at A-level, as well as combined degree \nprogrammes: \n \n‘We do not believe, for example, that it is in the public interest that a student \nof natural science or technology is frequently not competent in even one \nforeign language, a student of economics is often without the desirable \ncomplement of mathematics and a student of history or literature may be \nunaware of the significance of science and the scientific method’ (paragraph \n204). \n \nHowever in actuality, the expansion of the Higher Education system as advocated by \nRobbins had an arguably less desirable impact on the teaching of the sciences at \nuniversity. Between 1962 and 1967 the proportion of candidates following the \nsciences at first year A-level fell from 42% of the cohort to 31%; at the same time, the \nproportion of candidates admitted to study science and technology at university fell \nfrom 46% of the cohort to 41%, leading to fears that if things continued as they were, \nuniversity science faculties would find themselves ‘increasingly recruiting rather than \nselecting candidates’ (Council for Scientific Policy, 1968, paragraph 6).  Such \nconcerns about an apparent ‘swing from science’ led to another government \ncommissioned review of the sciences in Higher Education. The subsequent report: the \nInquiry into the flow of candidates into Science and Technology in Higher Education \n(known as the Dainton report), followed the Robbins Report in also recommending a \nbroad range of sixth form studies as a means of encouraging more able young people \nto study the sciences at Higher Education so that ‘irreversible decisions for or against \nscience, engineering and technology should be postponed as late as possible’ \n(paragraph 174). The report went further to advocate a review of university entry \nrequirements and the trial of new science, engineering and technology courses \nspecifically designed to attract ‘able entrants who are not already committed to these \nfields of study’ (paragraph 193). Indeed, according to the Dainton Report this ‘swing \nfrom science’ was a consequence of increased competition from other popular and \n‘less rigorous’ (p79) subjects, a desire by students for a broader curriculum which \nmeant they opted for more mixed subjects at A level which made studying the \nsciences at university more difficult, an unimaginative science curriculum which was \nout of touch with society and poor science teaching; all of which now necessitated a \nrevision of university entrance requirements to attract candidates from outside the \n‘science stream’ (Council for Scientific Policy 1968).  \n \n7 \n \nOne reason given for the apparent relative decline in the number of students studying \nscience post-16 was the increased choice of mixed arts and science options that were \nnow available to a growing sixth form population, many of whom would additionally \nhave had to have chosen to specialise in the sciences around age 13 (McPherson 1969, \nCouncil for Scientific Policy 1968, Duckworth and Entwistle 1974). Two groups in \nparticular were affected by the increase in the number of students staying on post-16: \ngirls and students of lower ability. Neither group according to Duckworth and \nEntwistle (1974) were likely to study the sciences: \n \n‘The sciences have not really ‘lost’ many recruits because of a change in \npupils’ attitudes towards science, rather some have been attracted away by the \nwelcome diversification of sixth form courses while others, ‘new’ sixth \nformers, have never been serious candidates for science (or languages) courses \nbecause they find these subjects particularly difficult’ (p53).  \n \nOf course, the same argument could be made for the apparent decline in the share of \nundergraduate students opting to study the sciences that we see today. In other words, \nthat the relatively recent expansion of Higher Education has attracted students who \nwere not likely to study science anyway. One indication that this might be the case is \nthe lack of variation in the characteristics of undergraduates who have chosen to study \nthe Physical Sciences over the last twenty five years or so: they are still largely high \nachieving, traditional aged, white, middle class men (Smith 2008). \n \nThe consequence of a wider choice of subjects at A-level on the uptake of science at \nuniversity is interesting. According to Osborne et al. (2003), the percentage of \nstudents pursing science or science and mathematics post 16 has declined by more \nthan one half, a trend which began in the 1980s and is a consequence of greater choice \nof mixed A level combinations.  Indeed the introduction of AS levels as part of the \nCurriculum 2000 reforms reflected the desire from many quarters for a broadening of \nthe curriculum that extends even beyond the Robbins report. While AS qualifications \nappear to have been successful in broadening the curriculum experience for students, \nthey have resulted in a decline in the percentage taking the three sciences at A level \n(Howson and Sprigade 2006). Although the ten most popular three A level \ncombinations are still science based and between them account for 10% of the A level \ncohort (Bell 2003).  \n  \nIndeed, the issue of a broader A level curriculum divides opinion between those who \nfeel the country can ‘ill afford’ to produce three times as many arts and humanities \nspecialists as science specialists (Osborne 2003, p1052) and those who criticise \nscience teaching, both in school and at university, for perpetuating a scientific and \ntechnical elite: ‘science teaching began and continues with its main purpose to \nmaintain the supply of future scientists’ (Young 1951, p51, see also Walford 1985, \nCommittee of Higher Education 1963, Starling, 1918). Once more this is a criticism \nthat is by no means new: ‘science courses in college seem to be dominated largely by \nthe aim of training for higher specialisation and the tendency is to eliminate more and \nmore of the general student body’ (Bell 1915, p635).  \n \nThe perceived lack of quality of science undergraduates in comparison to those in \nother fields has been an issue at least since the 1960s (McVey 1970). For example, the \nBlack Papers which were published towards the end of the decade were particularly \n8 \n \nscathing in their assessment of A level candidates: from 1965 onward apart from the \nvery best candidates in mathematics ‘no scientific or technological subject was able to \nrequire a standard of performance on the part of its best candidates (those achieving \nAAA to BCC) to match economics, geography, English, French or history (Pollard \n1969, p78). Once at university, science undergraduates were more likely to leave \nbefore completing their degree: in 1966 12.8% of Physical Science (excluding \nmathematics) students did so, compared with 6.3% in the Arts. According to McVey \n(1970) the ‘rot set in’ during the 1960s with the expansion of the universities and the \npure and applied science faculties (p28). The author cites a 1964 article in the Times \nEducational Supplement reporting more than 900 unfilled places in science and \ntechnology which no suitably qualified candidate could fill despite ‘undemanding’ \nentry qualifications.  \n \nThe poor skills demonstrated by undergraduate students once they had been accepted \nonto their degree course, is a particularly longstanding issue. Indeed, the 2002 Roberts \nreview into the supply of science professionals suggests that the decline in the \nnumbers of students taking science A-levels may result in a lowering of quality \namong the undergraduate intake, particularly if the need to fill places results in offers \nbeing made to less well qualified applicants (Roberts 2002).  \n \nThis is a particular issue for mathematics where concerns are often raised about the \ndeclining number and quality of students entering this and other numerate disciplines \n(Smith 2004, Smithers and Robinson 2006). For example, we frequently read about \nstudents who are unable to cope with the mathematics content of their courses and \nwho possess insufficient mathematical skill for the study of Physics and Engineering \nand in cases where there are students who can cope with the mathematics, they fail to \napply it (Gill 1999, Smith 2004, UK Mathematics Foundation 2005, Royal Society \n2007, Jones 2009). However, many of the issues raised here aren’t particularly new: \nback in 1971 it was reported that ‘many students of science subjects arrive at \nuniversity with little faculty and less interest in maths’ (cited in Gill 1999, p83).  The \nreasons for the problem today are perhaps clearer: fewer students now have two \nmathematics A-levels and some, given the broader curriculum and choice of \nqualifications now on offer, may have no mathematics A-level at all. In addition, the \nmathematics A level syllabus and assessment techniques have changed enormously \nover the last twenty years or so, not so the Undergraduate mathematics syllabus that is \ntaught to physics students, for example: this has ‘scarcely changed in living memory’ \n(Gill 1999, p86). Even so the recommendations for change are seen mainly to lie with \nthe schools and the need to strengthen mathematics teaching at secondary school as \nwell as the quality of the teachers themselves in order to ensure that there is a marked \nincrease in ‘the number of students taking and enjoying a serious A level in \nmathematics’ (UK Mathematics Foundation 2005, p1). \n \nDespite the concerns of the authors of the Black Papers, science and mathematics A-\nlevels are still high status subjects which are likely to be taken by the highest attaining \nstudents (Selkirk 1972, Walford 1985, Bell 2003 and 2003a, Leslie 2003, Croxford \n1997).  Indeed, debates about the quality of science undergraduates reveal an \ninteresting paradox: on the one hand the students who study these subjects post 16 are \namong the most able in their cohort, but on the other ‘the sciences are both objectively \nharder and widely perceived to be so’ (Coe et al 2008, p136). In an environment \nwhere all subjects are treated as equivalent, for example, in league tables and \n9 \n \nuniversity entry requirements, there may be incentives for students to take easier \nsubjects which may in turn impact upon recruitment to the sciences (Coe et al 2008). \nIndeed the elite status of the pure sciences in particular is perhaps one explanation for \nthe apparent post-16 ‘swing from science’ we experienced during the 1960s and \nwhich is arguably being replicated in participation in science subjects at HE today.  \nPut simply it is that able students who are interested in the sciences were always \nlikely to choose to study these subjects post-16 and were always potential recruits to \nHigher Education and were relatively unaffected by more recent widening \nparticipation agendas. Where attrition from the sciences among this group may have \noccurred is to the newer scientific disciplines such as psychology. \n \n \nPoor teaching \n \n‘The teaching of natural science presents a sorry spectacle of inadequacy or \nmisdirected effort all along the line’ (Bell 1915, p635). \n \n‘By far the most serious problem for science education is the supply of \nsuitably trained teachers, particularly at secondary school’ (Save British \nScience 2005, p53). \n \nAccording to the Royal Society, ‘teachers are the largest single source of variance in \nlearning other than the students themselves’ (Royal Society 2006, p3), but, as the \nabove quotations show, concerns over the quality of school science teaching are not \nnew. Back in 1918, the Thomson Committee blamed competition from industry for \nthe shortage of well-qualified teachers and advocated both an increase in salaries and \na ‘revolution’ (paragraph 72) in the public’s attitudes towards teachers: \n \n‘The first and indispensable condition for any real improvement in the \nteaching of science in schools of all kinds is that effective steps should be \ntaken to secure an adequate supply of properly qualified teachers. The supply \nis inadequate for existing needs…’ (Committee to Enquire into the Position of \nNatural Science in the Educational System of Great Britain 1918, paragraph \n71). \n \nFollowing the First World War, restrictions on scientific Research and Development \nmeant that what industrial expansion which did take place was largely in areas which \nrecruited non-graduate scientists. Consequently as the primary career destination for \nthe increasing numbers of science graduates was teaching, a period of 'chronic over-\nsupply' of teachers ensued (Jenkins 1979, p230). In fact it was not until after the \nSecond World War and the subsequent generation of scientists that the Thomson \nCommittee's concerns about industrial competition for teachers were fully realised.  \nIndeed, after World War II rapid industrial expansion and the demand from industry \nfor physics and chemistry graduates, in particular, resulted in the concerns about \nquality and supply to the profession that persist today (Smithers and Robinson 2005, \nMoor et al. 2006). By the time of the 1953 Morris report into the supply of teachers, \nthere was a widely acknowledged 'serious inadequacy' in the supply of mathematics \nand science teachers, what teachers were in post were of poor quality and there were \nseveral examples of schools sharing science staff to overcome shortages. The Morris \nreport concluded that shortages were a 'national problem' (paragraph 46) and that the \n10 \n \noutput of mathematics and science graduates could not supply the needs of the three \nmain competitors: school, industry and the universities. Their concerns are illustrated \nin Table 1 below: \n \n11 \n \nTable 1: First degree mathematics and pure science students, England and Wales, \n19521\n \n \n Teacher training (%) Research\/PG courses or \nuniversity teaching (%) \nIndustry or \ncommerce (%) \nMen 20 40 33 \nWomen 50 25 20 \n \nThe Morris report was followed in 1959 by the Crowther report which again pointed \nto the scarcity of good sixth form science teaching and of the need to attract both male \nand female teachers of the highest calibre (Ministry of Education, 1959). Similar \nconcerns were echoed by Robbins in 1963 and by Dainton in 1968 who argued that in \n1965 36% of mathematics teachers and 22% of physics teachers were not qualified in \nthe subject they taught and that 27% of maths teachers had no qualifications in any \nscience subject at all (Council for Scientific Policy 1968). \n \nBy the 1970s, Physics teaching in particular was viewed as a ‘dying art’ (Young 1976 \np48), there were difficulties in recruiting science specialists, particularly females and \nconsequently the country was sort of about 3400 mathematics teachers (Jones 1973). \nIndeed, in 1977 it was estimated that 38% of all mathematics teaching (or 9000 \nteachers) in maintained secondary schools was undertaken by teachers whose \nqualifications were 'weak' or nonexistent. By the time of the 1982 Cockroft report \n(Committee of Inquiry into the teaching of mathematics in schools, 1982) into the \nteaching of mathematics (commissioned in response to a lack of suitably qualified \nmaths teachers), a shortage of good mathematics teachers had been a concern for \nmany years, both a consequence of rising birth rate and increased competition for \nmathematicians from commerce and industry.  \n \nMore recently the Robert’s review has drawn attention to the ‘consistent failure’ (p. 4) \nto recruit sufficient numbers of suitably qualified candidates to Initial Teacher \nTraining Programmes, as well as over the levels of initial training that teachers \nreceive and the concern that teachers were teaching in science areas not covered by \ntheir degree (Roberts 2002). Similar situations have been reported by Smithers and \nRobinson (2005), Moor et al. (2006) and Margo et al. (2008).   \n \nAlongside such concerns about the supply and quality of the science teaching \nprofession, there has been no shortage of suggested remedies. The Robbins review, \nfor example, advocated alternative undergraduate courses: \n \n‘the great majority of undergraduate students of mathematics have neither the \naim nor the ability to become mathematicians of the front rank, and for them \nsomewhat less concentration would be appropriate in order to make way for \nthe study of some other suitable subject such as physics or chemistry’ \n(Committee on Higher Education 1963, p92). \n \n                                                 \n1 The remainder of graduates were employed by the government or nationalised industry. These figures \naccount for 2\/3 of graduates and exclude those doing national service, who were unemployed or for \nwhom no information was available. \n \n12 \n \nThe Dainton Report along with the Roberts Review and the organisation Save British \nScience have all suggested the use of ‘positive incentives’ (Council for Scientific \nPolicy 1968, paragraph 186) such as increased earnings for classroom science \nteachers, improved ‘on the job’ training and sabbatical leaves and teh development of \nschemes to encourage doctoral scientists to spend time in schools. By 2002 such \nincentives included financial incentives aimed at attracting more high quality trainees \nand sizeable ‘golden hello’ payments for those who successfully complete their \ninduction teaching period in priority subjects. Today a prospective teacher trainee in \nmathematics or science can expect a £9000 tax free bursary plus golden hello \npayments of up to £5000. \n \nDespite such incentives, it seems we are in no better a position today with regard to \nthe quality of the science and mathematics teaching workforce than we were in the \nyears prior to the Second World War. For example a recent study into the deployment \nof mathematics and science teachers reports that one fifth of Physics teachers were \nsubject specialists, compared with 44% of Biology teachers, and also that high \nattaining schools in more affluent areas were more likely to employ science specialists \nthan schools working in more challenging circumstances (Moor et al. 2006). \n \n \nDiscussion \n \n“This is Britain’s path to the future, lit by the brilliant light of science” (Blair, 2006) \n \nIn his speech to the Royal Society in November 2006, then Prime Minister Tony Blair \ndeclared himself to be ‘born again’ and ‘fascinated’ by the scientific process. In \naddition to praising the entrepreneurial skills of British scientists, and the pivotal role \nof science in our ‘knowledge economy’, his speech evoked a heady mixture of \nscientific accomplishments: advances in genetic sequencing, stem cell research, \nnanotechnologies and the science of climate change - which he likened to the ‘moon \nlanding of our day’. In this speech the former Prime Minister described much of what \nis important, exciting and challenging in the field, even going so far as to describe \nscientists as ‘stars’ who should be celebrated on a par with our famous actors and \nsportsmen and women. But Blair also confessed to a prior view of science as being for \n‘people who were devoid of emotion, the boffins, the ones who took an extraordinary \ninterest in things I found irritating’. This view of science as being something that \n‘other people do’ is not unfamiliar (see for example, the results from PISA 2006, \n(OECD 2007), Holman 2005) and although it contrasts starkly with Blair’s image of \nscientists working at the frontier of knowledge, it is nevertheless a view that persists. \nIn the UK, the media is replete with stories of science in crisis: fewer young people \nare enrolling in the sciences at university (BBC 2007), there are insufficient well-\nqualified science teachers in schools (Guardian 2008) and the cost to the economy of \nthe ‘swing’ from the sciences is estimated in billions of pounds (The Times 2008).  \n \nThe response to this ‘crisis account’ surrounding the supply and skills of future \nScience Technology Engineering and Mathematics (STEM) professionals by the \nBrown government has been an ambitious 10 year Science and Innovation framework \n(HMT 2004). The aim of which is: \n \n13 \n \n“for the UK to be a key knowledge hub in the global economy, with a \nreputation not only for outstanding scientific and technological discovery, but \nalso as a world leader in turning that knowledge into new products and \nservices” (HMT 2004, p5). \n \nThe government’s commitment to make ‘Britain the best country in the world in \nwhich to be a scientist’ (Brown 2009) is underlined by recession proof increases in the \nScience Budget to around £11.24 billion (or of about 17.5% between 2007\/08 and \n2010\/11) (House of Commons 2008). The motivations behind such initiatives are \nlargely economic and represent industry’s concerns for a suitably skilled workforce \n(CBI 2008), particularly in the face of competition from other established and \nemerging economies, such as India and China (Society of Chemical Industry 2006, \nLeitch Review of Skills 2006). Central to addressing the ‘skills shortage’ is increasing \nrecruitment to the STEM subjects at school, at university and through vocational and \nwork based provision, a commitment underlined by the Higher Education Funding \nCouncil’s new £21 million STEM Centre at the University of Birmingham.  \n \nAs before, the key to developing the nations’ scientific skills base is once again \nthrough increasing recruitment, an expanded network of training provision, a better \nqualified teacher workforce and a more scientifically literate population. Or as \nGordon Brown suggested in a recent speech at Oxford University: ‘while not \neveryone is in the business of science, science is everybody’s business’ (Brown \n2009). But as this paper has attempted to show these preoccupations with the science \nagenda are not new. Indeed, this brief examination of several key government reports \ninto the position of school science in the UK over the last 90 years has revealed some \nlong established trends. From its very inception as a school subject, concerns have \nbeen raised over the nature and purpose of the school science curriculum and its dual \nobjective of training a scientific elite and ensuring that we are a nation of \nscientifically literate citizens. With this has come tension between the need for a \nspecialist science curriculum at age 14 which allows a smooth transition to further \nstudy and the desire for a broader curriculum which has room for a wider treatment of \nthe field of science. Making science a compulsory component of school science in \n1989 has arguably shifted this tension to the post-16 curriculum where a broader \nchoice of subjects has, according to some commentators, further diluted specialism \nand resulted in a decline in both the quality and quantity of university applicants. One \npossible explanation for why recruitment to the Physical Sciences, in particular, has \nfailed to keep up with the recent expansion of Higher Education more generally is that \nthe new recruits to Higher Education are those who were unlikely to study science \nanyway. Physical Science students have among the highest entry qualifications of all \nUK Higher Education students, with some exceptions, most would have continued to \nuniversity regardless of the programme of recent expansion and so perhaps we should \nnot be surprised that patterns of participation have not kept pace with subjects with \narguably less demanding entry requirements. A further concern is, of course, the \nquality of the teaching profession and problems with the recruitment of teachers with \nthe appropriate skills to teach science, again an issue that has been pertinent for as \nlong as science has been taught in schools. \n \nIn summary, a reading of government commissioned reports and other research does \nseem to suggest that the concerns that preoccupy the STEM agenda today are not \nparticularly new: many of the same concerns that were raised by the Thomson \n14 \n \nCommittee in 1918 were revisited by Roberts in 2002. All of which really asks, if not \nnow - when more students are studying science at school than ever before, when over \n40% of university undergraduates are studying science or science-related disciplines \nand when one third of Physical Science graduates undertake postgraduate research \ndegrees  - then when was there a ‘golden age’ for science education in the UK? \n \nReferences \n \nAdlam, G.H.J., (1919), Compulsion by examination, School Science Review, 1(2),  \n pp33-36. \nBBC (2007), Foreigners ‘prop up UK science’, BBC news online, 13th September  \n 2007. \nBell, J.C., (1915), Editorial: the teaching of natural science, Journal of Educational  \n Psychology, 6(10), pp634-635 \nBell, J.F., Malacova, E., Shannon, M., (2003), The changing pattern of A level\/AS  \n uptake in England, The Curriculum Journal, 16(3), pp391-400. \nBell, J.F., Malacova, E., Shannon, M., (2003a), The changing pattern of A level\/AS  \n uptake in England, paper presented at the BERA conference September 2003. \nBlair, T., (2006), Our Nation’s Future – Science, speech given to the Royal Society,  \n Oxford, UK, 3rd November 2006, accessed October 2008, from  \n www.number10.gov.uk\/Page10342 \nBrown, G., (2009), The Romanes Lecture given at the Sheldonian Theatre  \n Oxford, 27th February 2009, accessed May 2009 from  \n www.number10.gov\/Page18472 \nCBI (2008), Taking stock: CBI Education and skills survey 2008, London: CBI  \n accessed June 2009 from http:\/\/www.cbi.org.uk\/pdf\/skills_report0408.pdf \nCoe, R., Searle, J., Barmby, P., Jones, K., Higgins, S., (2008), Relative difficulty of  \nexaminations in different subjects, Report for SCORE, accessed May 2009  \nfrom http:\/\/sv.iop.org\/News\/Community_News_Archive\/2008\/file_30371.doc \nCroxford, L., (1997), Participation in science subjects: the effect of the Scottish \n curriculum framework, Research Papers in Education, 12(1), pp69-89 \nCommittee to Enquire into the Position of Natural Science in the Educational System  \n of Great Britain (1918), Natural Science in Education: Being the Report of the  \n Committee to Enquire into the Position of Natural Science in the Educational  \n System of Great Britain, London: HMSO (the Thomson report). \nCommittee of Inquiry into the teaching of mathematics in schools (1982),  \n Mathematics Counts: Report of the Committee of Inquiry into the teaching of  \n mathematics in schools, London: HMSO (the Cockroft report). \nCommittee on Higher Education (1963), Higher Education, Report of the Committee  \n appointed by the Prime Minister under the Chairmanship of Lord Robbins,  \n London: HMSO, (the Robbins Report) \nCouncil for Scientific Policy (1968), Inquiry into the flow of candidates into science  \n and technology in Higher Education, London: HMSO, (the Dainton report). \nDelamont, S., (1989), Knowledgeable Women, London: Routledge \nDuckworth, D., Entwistle, N.J., (1974), The swing from science: a perspective from  \n hindsight, Educational Research, 17, pp48-53. \nGill, P., (1999), The physics\/maths problem again, Physics Education, 34(2) pp83-87. \nThe Guardian (2008), Women in Science, Engineering and Technology, The  \n Guardian newspaper, 30th October 2008, pp2-23. \nHolman, J., (2005), Bring on the science specialists, Times Education Supplement,  \n15 \n \n 28th October 2005, p21. \nHooper, D., (1980), A national problem, Physics Education, 15, pp217-219. \nHouse of Commons (2008), House of Commons Innovation, Universities, Science and  \n Skills Committee Science Budget Allocations Fourth Report of Session 2007– \n 08, London: HMSO. \nHowson, J., Sprigade, A., (2006), From pupil to scientist – more or less? Paper  \n presented at The Royal Society Conference ‘Increasing the uptake of science  \n post-16’ 10th March 2006. \nHMT (2004), Science and Innovation Investment Framework 2004-2014, London:  \n HM Treasury. \nHurd, P.D., (1991), Closing the educational gap between science technology and  \n society, Theory into Practice, 30(4), pp251-259. \nJenkins, E., (1979), From Armstrong to Nuffield, Studies in Twentieth Century  \n Science Education in England and Wales, London: John Murray. \nJenkins, E., (2007), School science: a questionable construct? Journal of Curriculum  \n Studies, 39(3), pp265-282. \nJones, C.L., Littlejohn, G.M., McPherson, A.F., (1973), Aversion to science teaching  \n as a factor in the choice of science subjects, Science Studies, 3(2), pp173-179. \nJones, H., (2009), Fundamental problems, The Times Higher Education Supplement,  \n 2nd July 2009.  \nLayton, D., (1981), The Schooling of Science in England, 1854-1939, in The  \nParliament of Science, MacLeod, R., Collins, P., (Eds.), Northwood: Science  \nReviews Ltd. \nLeitch Review of Skills, (2006), Prosperity for all in the global economy - world class  \n skills: Final Report, London: HMSO. \nMargo, J., Benton, M., Withers, K., Sodha, S., with Tough, S., (2008), Those who  \n can?, London: IPPR \nMcPherson, A., (1969), ‘Swing from Science’ or retreat from reason? Universities  \n Quarterly, Vol. 24, pp29-43. \nMcVey, P.J., (1970), Are public examinations fair to science students? Physics  \n Education, 13, pp28-32. \nMinistry of Education (1953), Graduate teachers of mathematics and science: a  \n report of the national advisory council on the training and supply of teachers,  \n London: HMSO (the Morris report). \nMinistry of Education (1959), 15 to 18: a report of the Central Advisory Council for  \n Education (England), London: HMSO (the Crowther report). \nMoor, H., Jones, M., Johnson, F., Martin K., Cowell, E., Bojke, C., (2006),  \n Mathematics and Science in Secondary Schools: The Deployment of Teachers  \n and Support Staff to Deliver the Curriculum, DfES Research Report  \n 708, Nottingham: DfES \nPollard, A., (1969), ‘O’ and ‘A’ level: keeping up the standards, in Black Paper Two:  \n the crisis in education, Cox, C.B., Dyson, A.E., London: Critical Quarterly  \n Society. \nOECD (2007), Programme for International Student Assessment (PISA), accessed  \n September 2008 from http:\/\/www.oecd.org\/dataoecd\/15\/13\/39725224.pdf \nOsborne, J., Simon, S., Collins, S., (2003), Attitudes towards science: a review of the  \n literature and its implications, International Journal of Science Education,  \n 25(9), pp1049-79. \nRoberts, G., (2002), SET for Success: The study of people with science, technology  \nengineering and mathematical skills, London: HMSO. \n16 \n \nRoyal Society (2006), Increasing the uptake of science post-16, report of a Royal \nSociety Conference Held on March 10th 2006. \nRoyal Society (2007), The UK’s mathematics and Science teaching workforce, A state  \n of the nation report 2007, London: The Royal Society. \nRoyal Society (2008), Science and mathematics education, 14 –19 A ‘state of the  \n nation’ report on the participation and attainment of 14–19 year olds in  \n science and mathematics in the UK, 1996–2007, accessed June 2009 from  \n http:\/\/royalsociety.org\/downloaddoc.asp?id=5698 \nSave British Science (2005), Science Agenda for the Period 2005-2010, \nSelkirk, F., Subject Choice at GCE Advanced Level, Universities Quarterly, Winter \n 1972, pp74-89. \nSmith, A., (2004), Making Mathematics Count: The report of Professor Adrian  \n Smith’s Inquiry into Post-14 Mathematics Education, accessed June 2009  \n http:\/\/www.tda.gov.uk\/upload\/resources\/pdf\/m\/mathsinquiry_finalreport.pdf \nSmithers, A., Robinson, P., (2005), Physics in Schools and Colleges: Teacher  \n Deployment and Student Outcomes, University of Buckingham. \nSmithers, A., Robinson, P., (2006), Physics in School and Universities, II Patterns  \n and Policies, University of Buckingham. \nSociety of Chemical Industry (2006), Strategic chemistry-based science education  \n into the 21st Century, Paper 2, London: SOCI Insight. \nStarling, E.H., (1918), Natural science in education: notes on the report of the  \n Committee on the Position of Natural Science in the Education System of  \n Great Britain, The Lancet, 192(4959), pp365-8 \nSykes, R., (1998) Podium: Science must allay the public’s fears; from an inaugural  \n speech by the President of the Association for the Advancement of Science,  \n The Independent, 14th September 1998. \nThe Times (2008), Can’t do attitude to maths ‘has cost economy £9bn’, The Times  \n Newspaper, 3rd June 2008, page 9. \nTurner, F.M., (1980), Public Science in Britain 1880-1919, Isis, 71(4), pp589-608. \nUK Mathematics Foundation (2005), Where will the next generation of UK  \n mathematicians come from? University of Manchester: Manchester Institute or  \n Mathematical Sciences \nWalford, G., (1985), The construction of a curriculum area: science in society’ British  \n Journal of Sociology of Education, 692), pp155-171. \nYoung, M., (1976), The Schooling of Science, in Explorations in the politics of school  \n knowledge, Whitty, G., Young, M., (eds), Driffield: Studies in Education Ltd,  \n Nafferton Books. \n \n"}