{"doi":"10.1080\/00420980701426657","coreId":"71616","oai":"oai:eprints.lancs.ac.uk:628","identifiers":["oai:eprints.lancs.ac.uk:628","10.1080\/00420980701426657"],"title":"London and New Yorks advertising and law clusters and their networks of learning: relational analyses with a politics of scale.","authors":["Faulconbridge, James R."],"enrichments":{"references":[{"id":16350681,"title":"59th Annual agency report. London: Advertising Age Allen, J.(2000.) Power\/economic knowledge. Symbolic and Spatial formations.","authors":[],"date":"2006","doi":null,"raw":"Advertising Age, A.  (2006). 59th Annual agency report. London: Advertising Age Allen, J.(2000.)  Power\/economic knowledge.  Symbolic and Spatial formations. In Bryson, J, P W Daniels, N Henry, J Pollard (Eds).","cites":null},{"id":16350688,"title":"A and Cohendet, P.(2004.) Architectures of knowledge: Firms capabilities and communities.","authors":[],"date":"1992","doi":"10.1111\/j.1944-8287.2006.tb00299.x","raw":"Amin, A and Cohendet, P.(2004.)  Architectures of knowledge: Firms capabilities and communities. Oxford University Press, Oxford Amin, A and Thrift, N. (1992)  Neo-Marshallian nodes in global networks. International journal of urban and regional research 16 pp 571-587 Amin A and Thrift N (1994)  Living in the global.  In Amin A and Thrift N (Eds) Globalisation, institutions and regional development in Europe.  Oxford University Press, Oxford.","cites":null},{"id":16350700,"title":"Abandoning Madison Avenue: the relocation of advertising services in New York city.","authors":[],"date":"1997","doi":"10.2747\/0272-3638.18.7.568","raw":"Leslie, D. (1997)  Abandoning Madison Avenue: the relocation of advertising services in New York city. Urban Geography 18 (7), pp 568-590 Maister, D.(2003.)  Managing the professional service firm. Simon Schuster, London Mansfield, B. (2005)  Beyond rescaling: reintegrating the 'national' as a dimension of scalar relations. Progress in Human Geography 29 (4), pp 458-473 Markusen A (1999)  Fuzzy concepts, scanty evidence, policy distance: the case for rigour and policy relevance in critical regional studies.  Regional studies 33(9) 869-884.","cites":null},{"id":16350742,"title":"Available from http:\/\/www.econ.cam.ac.uk\/cgibin\/cbr_wp3.pl?conf_file=cbr.conf&terms=1999&series=camdae&criteria=creatio n-date&boolean=AND&case=Insensitive OECD.","authors":[],"date":"2000","doi":null,"raw":"154. Available from http:\/\/www.econ.cam.ac.uk\/cgibin\/cbr_wp3.pl?conf_file=cbr.conf&terms=1999&series=camdae&criteria=creatio n-date&boolean=AND&case=Insensitive OECD.  (2000). Knowledge management in the learning economy. Paris: OECD    51 Orlikowski WJ (2002)  Knowing in practice: enacting a collective capability in distributed organizing.  Organization Science 13 (3) 249-273.","cites":null},{"id":16350691,"title":"Cities: reimagining the urban. Polity press,","authors":[],"date":"2002","doi":null,"raw":"Amin, A and Thrift, N.(2002.)  Cities: reimagining the urban. Polity press, Cambridge Anderson, B (1991) Imagined Communities: Reflections on the Origin and Spread of Nationalism. Verso, London.","cites":null},{"id":16350695,"title":"Clusters and knowledge: local buzz, global pipelines and the process of knowledge creation.","authors":[],"date":"2004","doi":"10.1191\/0309132504ph469oa","raw":"Bathelt, H, Malmberg, A and Maskell, P. (2004)  Clusters and knowledge: local buzz, global pipelines and the process of knowledge creation. Progress in Human Geography 28 (1), pp 31-56   47 Beaverstock, J V, Smith, R and Taylor, P J. (1999)  The long arm of the law: London's law firms in a globalising world economy. Environment and Planning A 13 pp 1857-1876 Blanc, H and Sierra, C. (1999)  The internationalisation of R& D by multinationals: a trade-off between external and internal proximity. Cambridge Journal of Economics 23 pp 187-206 Brenner, N. (2001)  The limits to scale?  Methodological reflections on scalar structuration. Progress in Human Geography 25 (4), pp 591-614 Bridge, G and Wood, A. (2005)  Geographies of knowledge, practices of globalization: learning from the oil exploration and production industry. Area 37 (2), pp 199-208 Bunnell TG and Coe NM (2001)  Spaces and scales of innovation.  Progress in Human Geography 25(4) 569-589.","cites":null},{"id":16350740,"title":"Neo-marshallian nodes, global networks and firm competitiveness: the media cluster of central London. ESRC centre for business research working paper no.","authors":[],"date":"1999","doi":null,"raw":"Nachum, L and Keeble, D. (1999)  Neo-marshallian nodes, global networks and firm competitiveness:  the media cluster of central London. ESRC centre for business research working paper no. 138. Available from http:\/\/www.econ.cam.ac.uk\/cgibin\/cbr_wp3.pl?conf_file=cbr.conf&terms=1999&series=camdae&criteria=creatio n-date&boolean=AND&case=Insensitive Nachum, L and Keeble, D. (2000)  Foreign and indigenous firms in the media cluster of central London. ESRC centre for business research working paper no.","cites":null},{"id":16350708,"title":"Regions, networks and fluids: anaemia and social topology.","authors":[],"date":"1994","doi":"10.1177\/030631279402400402","raw":"Mol A and Law J (1994)  Regions, networks and fluids: anaemia and social topology.  Social studies of science 24 641-671.","cites":null},{"id":16350705,"title":"Space of politics. Cambridge: Polity Press pp 279-294 50 McDowell L","authors":[],"date":"1997","doi":null,"raw":"Space of politics. Cambridge:  Polity Press  pp 279-294   50 McDowell L (1997)  Capital culture- gender at work in the city.  Blackwell, Oxford.","cites":null},{"id":16350684,"title":"Symbolic and Spatial formations. London: Routledge pp 15-33 Amin A","authors":[],"date":"2002","doi":null,"raw":"Power\/economic knowledge.  Symbolic and Spatial formations. London: Routledge  pp 15-33 Amin A (2002) Spatialities of globalisation.  Environment and Planning A 34 385-399.","cites":null},{"id":16350698,"title":"The economic geography of the internet age.","authors":[],"date":"2001","doi":"10.3386\/w8450","raw":"Leamer, E and Storper, M. (2001)  The economic geography of the internet age. Journal of international business studies 32 (4), pp 641-655 Leslie DA (1995)  Global scan: the globalization of advertising agencies concepts, and campaigns.  Economic Geography 71(4) 402-426.","cites":null},{"id":16350737,"title":"The exaggerated death of geography: learning, proximity and territorial innovation systems.","authors":[],"date":"2004","doi":"10.1093\/jeg\/4.1.3","raw":"Morgan, K. (2004)  The exaggerated death of geography: learning, proximity and territorial innovation systems. Journal of economic geography 4 (1), pp 3-21 Morris, C and Empson, L. (1998)  Organisation and Expertise: An Exploration of Knowledge Bases and the Management and Consulting Firms. Accounting organizations and society 23 (5\/6), pp 609-624 Murdoch J (1995)  Actor-networks and the evolution of economic forms: combining description and explanation in theories of regulation flexible specialization and networks.  Environment and Planning A 27  731-757.","cites":null},{"id":16350745,"title":"The local innovation system as source of variety: openness and adaptability in New York City's garment district. Environment and Planning","authors":[],"date":"2002","doi":"10.1080\/00343400220146740","raw":"Rantisi, N. (2002)  The local innovation system as source of variety: openness and adaptability in New York City's garment district. Environment and Planning D 36 (6), pp 587-602 Saxenian, A and Hsu, J-Y. (2001)  The Silicon Valley-Hsinchu connection: Technical communities and industrial upgrading. Industrial and corporate change 10 (4), pp 893-920 Storper, M and Venables, A J. (2003)  Buzz: face-to-face contact and the urban economy. Journal of economic geography 4 pp 351-370 Sturgeon, T J. (2003)  What really goes on in Silicon Valley?  Spatial clustering and dispersal in modular production networks. Journal of economic geography 3 pp 199-215 Swyngedouw, E.(1997.)  Neither global nor local: 'Glocalization' and the politics of scale. In Cox, K (Eds). Spaces of Globalisation  New York:  Guildford pp 137-166 Thrift, N.(1995)  A hyperactive world. In Johnston, R J, P J Taylor, M J Watts (Eds). Geographies of global change.  Remapping the world.  Oxford:  Blackwell pp 29-43 Trubek, D M, Dezalay, Y, Buchanan R and Davis, J R. (1994)  Global restructuring and the law: studies of the internationalization of legal fields and the creation of transnational arenas. Case Western reserve law review 44 (2), pp 407-498   52 UNCTAD.  (2004). Trade and development aspects of professional services and regulatory frameworks. New York and Geneva:  United Nations conference on trade and development Warf, B. (2001)  Global dimensions of US legal services. The professional geographer 53 (3), pp 398-406 Company Holding company group Worldwide Revenue (millions in 2005) Global offices  Key global clients Publicis worldwide Publicis $2,685 Allied Domecq Hewlett Packard Ericsson McCann-Erickson worldwide Interpublic £1,461 Coca-Cola Mastercard Cereal Partners BBDO worldwide Omnicom $1,259 Mars Gilette Guiness J Walter Thompson WPP $1,313 Vodafone Shell Diaego TBWA Omnicom $950 Addidas Sony News International Leo Burnett worldwide Publicis $807 Heinz Proctor & Gamble Morgan Stanley Ogilvy & Mather worldwide WPP $801 Ford BP American Express Grey worldwide* WPP* $629 Glaxosmithkline Proctor & Gamble Nokia Euro RSCG worldwide Havas $496 Intel Danone Cadbury Trebor Basset Young & Rubicam WPP $18,678 11,387 Colgate-Palmolive LEGO WPP $473 Colgate-Palmolive LEGO","cites":null},{"id":16350696,"title":"The manufacture of knowledge. An essay on the constructivist and contextual nature of science.","authors":[],"date":"1981","doi":"10.2307\/3104685","raw":"Regional Studies 33 (4), pp 319-332 Knorr-Cetina K (1981)  The manufacture of knowledge.  An essay on the constructivist and contextual nature of science.  Pergamon, Oxford.   49 Latour B (1987)  Science in action: how to follow scientists and engineers through society.  Open university press Milton Keynes.","cites":null},{"id":16350703,"title":"The social construction of scale.","authors":[],"date":"2000","doi":"10.1191\/030913200674086272","raw":"Marston, S. (2000)  The social construction of scale. Progress in Human Geography 24 (2), pp 219-242 Marston, S, Jones, J P and Woodward, K. (2005)  Human geography without scale. Transactions of the Institute of British Geographers NS 30 pp 416-432 Martin, R and Sunley, P. (2003)  Deconstructing clusters: chaotic concept or policy panacea. Journal of economic geography 3 pp 5-35 Massey, D.(1999.)  Space of politics. In Massey, D, J Allen, P Sarre (Eds).","cites":null}],"documentType":{"type":0.4444444444}},"contributors":[],"datePublished":"2007","abstract":"A preoccupation in cluster literatures has been with theorising the way learning occurs and knowledge is produced. Studies have highlighted the complementary local and global learning networks involved. This paper engages with this debate through empirical examination of the networks of learning that exist within and between the clusters of advertising and law firms in London and New York. Based on data gained from interviews, the paper shows that existing literatures devalue and differentiate local versus global learning networks, ignoring the ways the organization and nature of learning and knowledge production at local and global scales can be similar and equally valuable. It therefore suggests using relational conceptualisations to understand and describe the trans-local relational learning networks. It also shows, however, that a politics of scale influences the behaviours of actors in these networks, suggesting recent calls to completely jettison scale from geographers analytical toolkits might be too hasty","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71616.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/628\/1\/L_%26_NY_clusters_and_networks_of_learning_%2D__final.pdf","pdfHashValue":"2524e491e05650d468200ceda0c5193a5b102f2c","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:628<\/identifier><datestamp>\n      2018-01-24T03:14:17Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D47:4731<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        London and New Yorks advertising and law clusters and their networks of learning: relational analyses with a politics of scale.<\/dc:title><dc:creator>\n        Faulconbridge, James R.<\/dc:creator><dc:subject>\n        G Geography (General)<\/dc:subject><dc:description>\n        A preoccupation in cluster literatures has been with theorising the way learning occurs and knowledge is produced. Studies have highlighted the complementary local and global learning networks involved. This paper engages with this debate through empirical examination of the networks of learning that exist within and between the clusters of advertising and law firms in London and New York. Based on data gained from interviews, the paper shows that existing literatures devalue and differentiate local versus global learning networks, ignoring the ways the organization and nature of learning and knowledge production at local and global scales can be similar and equally valuable. It therefore suggests using relational conceptualisations to understand and describe the trans-local relational learning networks. It also shows, however, that a politics of scale influences the behaviours of actors in these networks, suggesting recent calls to completely jettison scale from geographers analytical toolkits might be too hasty.<\/dc:description><dc:date>\n        2007<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/628\/1\/L_%26_NY_clusters_and_networks_of_learning_%2D__final.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1080\/00420980701426657<\/dc:relation><dc:identifier>\n        Faulconbridge, James R. (2007) London and New Yorks advertising and law clusters and their networks of learning: relational analyses with a politics of scale. Urban Studies, 44 (9). pp. 1635-1656. ISSN 0042-0980<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/628\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1080\/00420980701426657","http:\/\/eprints.lancs.ac.uk\/628\/"],"year":2007,"topics":["G Geography (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":" 1\nLondon and New York’s advertising and law \nclusters and their networks of learning: \nrelational analyses with a politics of scale? \n \nJames R Faulconbridge \nDepartment of Geography \nLancaster University \nLancaster  \nLA1 4YW \n \nTelephone: +44 (0)1524 592203 \nFax: +44 (0)1524 847099 \nEmail: j.faulconbridge@lancaster.ac.uk \n \n \nForthcoming in Urban Studies \n \n \n \n 2\nAbstract \n \n \nA preoccupation in cluster literature has been with theorising the \nway learning occurs and knowledge is produced.  Studies have \nhighlighted the complementary local and global learning networks \ninvolved.  This paper engages with this debate through empirical \nexamination of the networks of learning that exist within and \nbetween the clusters of advertising and law firms in London and \nNew York.  Based on data gained from interviews, the paper shows \nthat existing literatures devalue and differentiate local versus global \nlearning networks, ignoring the way both the organization and \nnature of learning and knowledge production at local and global \nscales can be similar and equally valuable.  It therefore suggests \nusing relational conceptualisations to understand and describe the \ntrans-local relational learning networks. It also shows, however, \nthat a politics of scale influences the behaviours of actors in these \nnetworks, suggesting recent calls to completely jettison scale from \ngeographers analytical toolkits might be too hasty. \n \n 3\nLondon and New York’s advertising and law clusters and their \nnetworks of learning: relational analyses with a politics of \nscale? \n \n \n1) Introduction \nAcademic interest in clusters, learning regions and associated \nideas is evidenced by the volume of scholarship and intensity of debate \nabout the usefulness of, and spatial characteristics and practices related \nto such concepts (see Martin and Sunley [2003] for a critical review).  A \nprimary preoccupation has been with better theorising the complementary \nlocal (cluster\/region) and global (stretched) spaces of knowledge \nproduction and flow and the way this informs competitive and flexible \nresponses to changing marketplaces (Keeble et al., 1999; Saxenian and \nHsu, 2001; Sturgeon, 2001).  Consequently, to suggest that such spaces \nare knowledge ‘nodes in global networks’ (Amin and Thrift, 1992) is now \nsomewhat banal.  As Nachum and Keeble (1999, 12) suggest, \n“Networking and collaboration with other local firms and \norganisations…play[s] a major role in recent theories of local \nclusters…However, such linkages are also becoming a global \nphenomenon, one that has come to coexist with networking and \ncollaboration within particular localities” .  It has proven somewhat more \npertinent to engage in explorations that attempt to deepen understanding \n 4\nof the different practices involved in the local and global geographies of \nlearning (Leamer and Storper, 2001; Storper and Venables, 2004).  Such \nstudies now commonly refer to the differentiated ‘urban buzz’ and ‘global \npipelines’ of knowledge creation and ‘flow’ that together sustain \nsuccessful clusters but through dissimilar forms of learning (Bathelt et al., \n2004). \n This paper uses case studies of advertising and law professional \nservice firms (PSFs) in London and New York to explore, but also \nsuggest ways to subtly reconfigure the way we theorise the geographies \nand practices involved in such local-global, ‘buzz’ and ‘pipeline’ learning.  \nIt suggests that recent conceptualisations have effectively deconstructed \none misleading dichotomy (that of locally bound, impervious clusters) but \ncreated another by suggesting there are dichotomised practices of \nlearning at local (buzz) and global (pipeline) scales.  The paper therefore \ncalls for recognition of the scale transcending practices of learning and \nthe relational forces that render less meaningful local-global distinctions \n(Amin and Cohendet, 2004). In doing this it follows the logic of calls for \nthe avoidance of scalar binaries (Brenner, 2001; Jessop, 2000; Massey, \n1999; Swyngedouw, 1997) whilst also, to a certain extent, being \nsympathetic towards suggestions that the concept of scale itself might be \nmisleading and counterproductive (Thrift, 1995; Marston et al. 2005). It \ndoes this by promoting a relational methodology where a priori \nassumptions of scale-defined practices are replaced with analyses of the \n 5\nvarious length networks of social practice (Amin, 2002; Dicken et al. \n2001; Murdoch, 1995), as inspired by work on actor-network theory \n(Latour, 1987; Mol and Law, 1994). This reveals, however, a socially \nconstructed politics of scale within the networks of learning studied that \nsuggests discussions of scale might be valuable for explaining subtle \nvariations in not the value or fundamental relational practices of learning, \nbut in the behaviours and influences on certain actors involved in the \nlearning process.  \n  The rest of the paper, therefore, develops this argument over \nfour further sections.  Section two reviews extant literatures describing \nthe local and global practices of learning that influence the \ncompetitiveness of firms in urban clusters.  It suggests analyses are \nneeded that prioritise a relational, network perspective so as to \nacknowledge the scale-blurring practices involved in learning and avoid \ncreating a value-laden, hierarchical binary between local and global \nspaces of learning.  It also suggests, however, that discussions of the \npolitics of scale may yet still be valuable in such analyses. Sections three \nand four develop this idea through an exploration of empirical material \ncollected from interviews with advertisers and lawyers in London and \nNew York.  This shows that the form and outcomes in terms of learning of \nthe embedded network architectures that exist within and between the \nregions studied are fundamentally the same.  Therefore, it is argued that \ndistinctions such as ‘local buzz’ and ‘global pipelines’ might obscure \n 6\nimportant continuities in the nature of learning at local and global points in \nrelational networks.  This analysis also shows, however, that \nunderstanding of the social construction and effects of a politics of scale \ncontinues to be important because of the way scale rhetoric’s inform the \nbehaviour of actors in relational networks. Therefore, it is suggested that \npurging scale for geographers’ analytical toolkits may result in throwing \nthe baby out with the bathwater. Section five draws these ideas together \nand suggests ways forward for analysing such learning ecologies and the \nrelational spaces that define learning as a social practice.  \n   \n2) Scale transcending networks of knowledge and learning? \nThe practices of learning performed at the local scale have been \nwidely described under the rubric of ‘urban buzz’ (Bathelt et al., 2001; \nHenry and Pinch, 2001; Storper and Venables, 2004).  This gossip, \nrumour and discussion of industry specific topics involved have been \ndescribed as a uniquely local asset for two reasons.  First, buzz is said to \nbe the result of serendipitous encounters facilitated by spatial proximity \nbetween individuals working in the same professional domain (Henry and \nPinch, 2001; Leamer and Storper, 2001).  Studies suggest chance \nencounters, for example on the street or in restaurants and bars of a city, \ncreate the ‘networks’ that enable learning and the informal ‘flow’ of tacit \nknowledge.  As a result, “participating in the buzz does not require \nparticular investments.  This sort of information and communication is \n 7\nmore or less automatically received by those who are located within the \nregion” (Bathelt et al., 2004, 38).   \nSecond, buzz is said to also benefit from a number of \ncomplementary factors that enable individuals to make sense of \nconversations and, therefore, learn.  ‘Shared heuristics’ possessed by \nthose working in the same region \"enable firms to understand the local \nbuzz in a meaningful and useful way…Firms develop similar language, \ntechnology attitudes and interpretative schemas” (Bathelt et al., 2004, \n39).  In addition, both Morgan (2004) and Storper and Venables (2004, \n353-354) argue that face-to-face contact, facilitated when individuals \nwork in close physical proximity to one-another, also eases learning \nbecause of the trust-rich reciprocal relationships it produces.  \nConsequently, this means “Buzz cities…are places where, more than \never, critical problems of coordination in the modern economy are \nresolved through F2F [face-to-face] contact” (Storper and Venables, \n2004, 366). \nThe value of such local ‘buzz’ has increasingly been suggested to \nbe complemented by what Bathelt et al. (2004) describe as learning \nthrough ‘global pipelines’.  This idea draws on long-developed arguments \nabout the simultaneous importance of local but also global relational \nspaces of learning in economic activities (Amin and Thrift, 1992; 2002; \nGertler, 2004; Simmie, 2003) and suggestions that knowledge production \n“involve[s] a complex and evolving integration, at different levels, of local, \n 8\nnational and global factors [not] exclusively at one particular scale but \ninstead across various spatial scales simultaneously” (Bunnel and Coe, \n2001, 570).  However, descriptions of the integration of local buzz with \nglobal pipelines often continues to suggest that there are stark contrasts \nbetween ‘local’ buzz and “nonincremental knowledge flows [that] are \noften generated through ‘network pipelines’, rather than through \nundirected, spontaneous ‘local broadcasting’” (Bathelt et al., 40).  The \nimplication of global spaces of ‘pipeline’ knowledge being \n‘nonincremental’ is that whilst “[l]ocal buzz is beneficial to innovation \nprocesses because it generates opportunities for a variety of \nspontaneous and unanticipated situations…global pipelines are instead \nassociated with the integration of multiple selection environments \nthat…feed local interpretations and usage of knowledge” (Bathelt et al., \n42).  In effect, globally stretched learning is said to be of a lower order of \nvalue, complementing but only consolidating what can be gained from \nlocal buzz.  Indeed, Nachum and Keeble (2000, 28) conclude their \nanalysis of the global integration of London’s global advertising agencies \nby arguing that “non-codified, not easily transferable, types of knowledge, \nare best transmitted when the parties involved are in close geographical \nproximity, and internal linkages within the TNC cannot provide similar \nbenefits to those accruing through local interaction”.  In effect, they return \nto the troublesome local-tacit\/global-explicit binary scholars have strived \nto deconstruct in recent times (Allen, 2000; Amin and Cohendet, 2004).      \n 9\n \n \n2.1) Relational, non-scalar, analyses of learning \nThis paper argues that setting up the geographies of knowledge \nas local-global (buzz and pipeline) serves to create a new and unhelpful \nqualitative dichotomy in relation to the practices of, and value-added \ngained from, local and global spaces of learning.  This is problematic for \ntwo reasons. First, studies such as that of Grabher (2001) suggest the \npractices and nature of learning at both urban (village) and global (group) \nscales share similar architectures and characteristics.  Conceptualising \nthe social space enabling learning as a heterarchy1, Grabher argues that \nthe same forms of social organization allow advertisers working in \nLondon’s Soho district to learn from conversations with both their local \nrivals and distant members of the global advertising group.  \nConversations thrive on rivalry, can involve disagreement, but benefit \nfrom highly convergent logics, motivations and heuristics whether with \nother members of the London village or the global group (see also \nSaxenian and Hsu, 2001). Amin and Cohendet (2004, 86) summarise \nneatly such arguments when they state that it is misleading to “assume \nthat knowledge falls into bundles organized along neat geographical \nscales and contours…Instead, [we] defines spaces of knowledge and \nlearning in terms of the traces of corporate organization and \n 10\ncommunication – that is, as organized spaces of varying length, space, \nand duration”.   \nSecond, creating scalar binaries in analyses of the value of \nlearning ignores calls for analytical approaches that do not assume \ngeographies of economic, political and social practice delimited by \nbounded, discrete, spatial scales (Jessop, 2000; Marston, 2000; \nSwyngedouw, 1997).  This requires a new spatial ontology to overcome \ndistinctions such as local and global, as prescribed to local buzz and \nglobal pipeline learning, and to recognise the long and short, local but \nalso global nature of many practices. Indeed, it has long been recognised \nthat the use of the concept of scale requires recognition of three \npresumptions (Marston, 2000, 221-222): \n1. That scale “…is not simply an external fact awaiting \ndiscovery but a way of framing conceptions of reality” \n(Delaney and Leitner, 1997, 94-95).  \n2. That a politics of scale acts as a social framing device and \nhas material effects on practice. \n3. That the framings created by scale are contingent and \ncontested and should not be assumed to be universal or \nenduring. \nRecently, however, Marston et al. (2005, 417) have gone beyond simply \nrecognising such contingencies and called for “a flat ontology, one that \ndoes not rely on the concept of scale”. Here, the major critique of existing \n 11\nscalar ontology is that they combine, confuse and misappropriate \n‘horizontal’ or ‘size’ measures of scale that describe spatial reach with \n‘vertical’ or ‘level’ analyses of power where assumptions of hierarchy exist \nbetween local and global. For Marston et al. both approaches do the \nsame work and describe the variable capacity of scale-defined practices, \nas is the case in the local-buzz global-pipeline distinction. However, as \nwe know from discussions of the ‘glocalization’ of economic and political \nprocesses (Jessop, 2000; Swyngedouw, 1997), such binaries are \nmisleading. We also know, as Marston et al. also go on to argue, that a \nbinary between micro-level, local scale action and macro-level, global \naction is equally problematic. As Brenner (2001, 602, original emphasis) \ndescribes this problem: \n \n“The tendency to blend scalar concepts into other geographical \ncategories continues to be prevalent in contemporary human \ngeography…I believe the problem results in no small measure from the \ncircumstance that our most elementary scalar terms (e.g. local, urban, \nregional, national and global) are also commonly used spatial qualifiers \nto connote the substantive sociological content of particular social, \npolitical and economic processes…Unfortunately, this grammatical \ninconvenience has significantly compromised the theoretical precision of \nmany otherwise highly illuminating contributions to sociospatial theory”. \n \n 12\nWe can see such a compromise when local, cluster-based learning gets \ndescribed as incremental, in-depth, trust-based, meaningful and \nfacilitated by a rich social ecology, whilst learning facilitated by non-local \npractice is described as being nonincremental, based on scanning and \nplagued by uncertainty. In this sense, the flat ontology of Marston et al. \n(2005) seems particularly useful. This takes inspiration from actor-\nnetwork theory and in particular Latour’s (1987) call to ‘follow the \nnetworks’ and approach spatial analyses without any pre-ordained ideals \nabout the scaled nature of space.  Such analyses are based on what \nThrift (2000b, 222, original emphasis) calls a “topologie sauvage which \ncannot be fixed or frozen, but can only keep on making encounters”. For \nMurdoch (1995, 749) this means “[t]he question of scale (global, local), \ntherefore, can be posed in another way: what links local actors to \nnonlocal actors…and how do these nonlocal actors effect [actions] at a \ndistance?” As a result, “the words ‘local’ and ‘global’ offer points of view \non networks that are by nature neither local nor global, but are more or \nless long and more or less connected” (Latour, 1987, 122; cited in \nMurdoch, 1995, 750).  \nFor Marston et al. (2005) a flat ontology follows such an approach \nwhilst also recognising the influence on the behaviours of actors of \ngeographical ‘sites’ such as cities in which social action unfolds. Their \nontology and any associated methodology do not frame geographical \nresearch in terms of scale (regions) but instead in terms of practice \n 13\n(learning). Marston et al. (2005, 423) add a caveat to this argument, \nhowever, and emphasise that “While we do not find ourselves at odds \nwith the possibilities of flow-thinking per se, we are troubled by what we \nsee as liberalist trajectories (absolute freedom of movement) driving such \napproaches”. Consequently they also suggest acknowledging the “large \nvariety of blockages, coagulations and assemblages…that congeal in \nspace and social life”. This leads them to talk of ‘milieu’, ‘neighbourhood’ \nand ‘locales’ as ‘sites’ that influence social practice (Marston et al. 2005, \n426). The question this raises is whether, on occasions, such analyses \nrequire discussions of the material effects of socially constructed politics \nof scale. They suggest these sites are “actualized out of a complex \nnumber of connective, potential processes” (Marston et al. 2005, 426). \nHowever, Collinge (2006, 249), also drawing on the ideas of actor-\nnetwork theory, reminds us that a socially constructed view sees scale in \na similar light, as “a function of network connections, connections in \nwhich physical boundaries and differences of scale are achieved through \nthe differential enrolment of objects within these networks”.   \nPerhaps, then, what this discussion of a flat ontology provides is, \nfirst, a reminder of the importance of ontology and methodologies that \nprioritise social practice rather than scale, something widely promoted for \nsome time within geography (Amin, 2002; Amin and Thrift, 2002; \nMurdoch, 1995; Thrift, 1995; 2000). Second, it also prompts us to be \nclear in our definition of the concept of scale. Geographers ‘fuzzy \n 14\nconcepts’ have received much attention (Markenusen, 1997) and whilst \nthe debate about scale has been long and intense, many of the \nconversations have talked past one-another using different \nconceptualisations of scale itself (Brenner, 2001). There now seems little \ndoubt that horizontal or vertical definitions of scale are misleading, and \nmost geographers have purged these from their discussions. However, \ndiscussions of the material effects on individuals and groups of socially \nconstructed politics of scale continue (e.g. Collinge, 2006; Mansfield, \n2005). Indeed, some time ago Swyngedouw (1997, 141) suggested that, \n“In short, scale (at whatever level) is not and can never be the starting \npoint for sociospatial theory. Therefore, the kernel of the problem is \ntheorizing and understanding ‘process’”. He, therefore, called for “the \nabolition of the ‘global’ and the ‘local’ as conceptual tools and suggest[ed] \na concentration on the politics of scale and their metaphorical and \nmaterial production and transformation” (Swyngedouw, 1997, 142).  \nHere I argue that the importance of using a (flat) ontology and \nmethodology and that prioritises social practice and not scalar units is \nevidenced by the insights such an approach provides into the trans-scalar \npractices of learning and their horizontally and vertically indistinguishable \ncharacteristics. However, I also show that, on occasions, a politics of \nscale has material effects on the behaviour of individuals and groups. \nThis does not create a local-global binary in the value or fundamental \npractice of learning, but does means scale is a useful analytical device \n 15\nfrom which we can leverage explanations of social practice and the subtle \nspatial variations that exist. Such assertions can, however, only be made \na posteriori based upon empirical knowledge of the networks of social \npractice. As Bathelt et al. (2004, 37) acknowledge, there have been few \ndetailed empirical examinations of how learning takes place in clusters \nand through globally stretched networks. As a result, it has proven \ndifficult to apply a practice-focussed methodology that focuses upon the \nfine-grained social interactions that allow learning. Here I want to attempt \nto provide such an analysis that allows the long and short networks of \nsocial practice to be examined with, where empirically proven to be \nrelevant, a posteriori, discussions of the effects of a socially constructed \npolitics of scale included.   \n \n3) ‘Buzzing networks’ in and between London and New York’s \nadvertising and law clusters \n \nIt is timely to explore the geographies of learning in advertising \nand law PSFs because of the increasing recognition of their vital role in \nthe global economy (OECD, 2000; UNCTAD, 2004).  As ‘lubricators’ of \nthe economic activities of other capitalist actors, these firms provide \nknowledge-rich services to clients in the form of professional advice that \nenables the most effective management of business activities (Morris and \nEmpson, 1998).  For advertisers, this is advice to clients about how to \n 16\neffectively market products and solicit demand from consumers. For \ncorporate lawyers it is advice about how clients might complete major \ntransactions that allow, for example, the merger of two firms or the \nfinancial restructuring of an existing business entity.   \nThe importance of advertising as a global industry is \ndemonstrated by the value of the combined annual revenue of the \nWorld’s 50 largest agencies.  This totalled over US$36 billion in 2005 \n(Advertising Age, 2006), much of which is concentrated in the top 10 \nfirms (see table 1).  London is well recognised as one of the key \ninternational centres of advertising expertise and activities (Clarke and \nBradford, 1989; Grabher, 2001; Leslie, 1995; Nachum and Keeble, 2000) \nwith, particularly during the early 1990’s, firms tending to locate \nthemselves within the Soho district of the city.  Grabher (2001) notes that \nthis ‘ad village’ is a vital source of learning because of the social \ninteraction and ‘buzz’ like conversations that occur.  New York plays a \nsimilarly important role in the global advertising industry. Leslie (1997) \nnotes that, reflecting the trend in London, advertising agencies \ntraditionally clustered around the thoroughfare of Madison Avenue in New \nYork and, more recently, around the southerly districts of Manhattan’s \ncultural quarter (part of which is ironically called SoHo, an acronym for \nSouth of Houston Street).  Here, individuals and firms again profit from \ninteractions that allow collective learning in a similar way to in Soho, \nLondon.   \n 17\n[Insert table 1 here] \n \nAt the same time, Faulconbridge (2006), Grabher (2001) and Leslie \n(1995; 1997) also note that globally stretched learning is equally \nimportant to the competitiveness of these firms.  This is facilitated, in \nparticular, by the corporate networks of the transnational advertising \nagencies\/groups working in each city.  Firms such as Saatchi and Saatchi \nand McCann Erickson are at the centre of the advertising clusters, as are \nthe major media groups such as WPP and Interpublic that the \ntransnational agencies are a part of (see table 1).  Grabher (2001) \ndescribes how important inter-personal networks develop between \nindividuals in different offices of global advertising firms and groups, \nthereby locating individuals in complex local-global webs of learning. \nLeslie (1995) suggests the emergence of such transnational networks of \nknowledge was one of the major outcomes of the intensive period of \nglobalization effecting advertising agencies in the 1980’s.     \nThe clusters of legal PSFs in London and New York have, \nsurprisingly, been less well explored in academic literatures and, despite \ntheir documented existence (The Corporation of London, 2003; Warf, \n2001), uncertainty exists as to whether any form of collective learning \noccurs.  Extant literatures reveal that London is an important location for \nthe activities of transnational law firms and is also a highly interconnected \nlocation in a global network of legal practice.  17% of US law firms’ \n 18\noverseas offices are in London (Beaverstock et al., 2000), as are 16% of \nUS law firms overseas workers (Warf, 2001). A massive 80% of total FDI \nby US law firms is focused on London (Cullen-Mandikos and \nMacPherson, 2002)2.  New York is recognized as similarly important for \nthe activities of transnational law firms (Beaverstock et al., 1999; Warf, \n2001).  However, for both cities there is little, if any, literature that \nexamines the affect of the clustering of legal PSFs and the potential it \ncreates for collective learning. Nor is there analysis of whether the firms \npresent, such as Clifford Chance and Baker and McKenzie (see table 2), \nbenefit from globally stretched knowledge networks.  This seems \nsomewhat surprising and troublesome and is a void this study can begin \nto fill.   \n[Insert table 2 here] \n \nThis paper, therefore, draws on insights gained from 58 interviews with \nadvertisers and lawyers working for transnational advertising and legal \nPSFs in London and New York to examine the long and short networks of \nlearning and professionals draw upon.  Interviews were conducted \nbetween September 2003 and June 2004, lasted between 30 and 80 \nminutes (50 on average), and were tape recorded and latterly \ntranscribed.  Interviewees were questioned about: the extent to which \nthey talked to and learned from other advertisers or lawyers; what type of \narchitectures (events) facilitated this learning; and the spatial reach of \n 19\nthese interactions.  The aim was, drawing on the flat ontology and \nnetwork methodology outlined in the previous section, to understand the \nvarious spaces of learning without resorting to analyses of local versus \nglobal scales.  To maintain anonymity, the quotes from interviewees used \nhere are identified only by the prefix A for advertisers and L for lawyers \nand interviewee number.   \n \n3.1) Geographies of learning           \nThe advertisers interviewed confirmed previous suggestions, \nwhilst lawyers illustrated the logical suspicion that the clusters of each \nindustry in London and New York result in a form of urban collective \nlearning.  The knowledge this produces is valuable because it informs \ndecision making, strategy and understanding of the challenges all \nadvertisers and lawyers working in each city’s marketplace share.  \nConversations focus upon pertinent issues such as, for lawyers, changes \nin legislation, and for advertisers, the reactions of consumers to recent \nadverts.  As two interviewees described their conversations: \n“I keep my ears open and you learn things.  You tend to talk about \nissues you’re all talking about, it’s more like what are the issues, big \nissues that agencies are facing.  So discussing how people deal with \nthese things, these ‘hot topics’… It’s a forum in which I think people \ncement their views” (A4). \n \n 20\n“Conversations with other lawyers act as a sounding board for second \nopinions, discussions of black letter law.  So when we need to address \nthe detail of a development it’s useful to discuss the detail…Legal or \nregulatory questions, transactional questions we’re not sure of the \nanswer to, its useful to see if anyone else out there knows the answer” \n(L8). \n \nIn the same sentence, however, interviewees would often also describe \nthe importance of conversations with overseas colleagues that prove \nequally valuable.  These conversations would usually take place between \ncounterparts doing the same job but in different offices. For advertisers in \nLondon this often meant talking to someone in New York or another \nEuropean office whilst for advertisers in New York it usually meant \nspeaking to someone in London or one of the Latin and South American \noffices. Conversations allow learning in relation to issues such as: the \nmost effective way to deal with the affects of global media events on the \nbehaviours of consumers throughout the World (e.g. the September 11th \nterrorist attacks).  For lawyers conversations were held with colleagues in \nother major financial centres such as Frankfurt, Paris or Hong Kong and \ndealt with, for example, innovations in the structuring of cross-border \ndeals. As one lawyer noted: \n“So when you’re up against a problem, first you walk down the corridor \nand talk to your colleagues, but if they can’t find a solution, and you think \nthere is more mileage to be had out of this, you pick up the phone and \n 21\ntalk to the partners who you think might have something to offer here, \nand they might be in Germany, in New York, or in France” (L9). \n \nAll of the firms studied also engaged in various form of ‘best practice’ \ntransfer within the firm (Gertler, 2001) which included the use of \nstandardised client relationship management systems, financial \nmanagement tools and human resource practices. The extent to which \nstandardization was possible varied between advertising and law with \nmore use of best practice in the former. However, best practice transfer \nwasn’t the primary objective of conversations between colleagues. \nRather, as one interviewee, whose comments were representative of all \nthose interviewed, described the value of globally stretched \nconversations (and compare this to the earlier quotes in relation to the \nnature of ‘urban’ buzz): \n“It’s very easy to get on with people, very easy to share stuff, but \nbecause, although there tends to be quite fundamental differences with \nthat markets relationship with a brand or product, there are useful \napproaches to a certain extent that are shared.  So you talk to people to \nhear about their experiences with the same product or brand or with a \nsimilar strategy or idea.  And that colours your thinking, adds flavours to \nthe way you understand the issues” (A8). \n \nInterviewees described, then, the equal value of local and global, long \nand short, networks of learning. This is significant because of how they \n 22\nalso described the similar architectures associated with ‘urban’ and \n‘global’ conversations that together informed their work.   \n \n4) Architectures of learning \n \n4.1) Inter-personal networks of learning \nVarious forms of interpersonal network facilitate learning from \nbuzz in the advertising and law clusters in London and New York.  One of \nthe architectures of learning was a result of the internal churning of \nregional labour markets in each city (Keeble et al., 1999).  The \nprofessionals interviewed had worked, on average, for three firms within \nLondon or New York during their career.  Staying in contact with past \ncolleagues was a valuable way of participating in discussions about \nshared advertising or legal challenges.  This principally took the form of \ninfrequent luncheon or after work meetings with, on average, \ninterviewees having one meeting a week with a past colleague and \nmeeting the same individual once every two or three months.  Several \ninterviewees suggested they would strategically arrange such meetings \nwhen they had a particular issue they wanted to share with, and ‘pick the \nbrains’ of, a past colleague.  As one interviewee described such \nmeetings: \n“It’s the friends and colleagues you meet and then people move and you \nstay in touch and that becomes and industry network…and talking about \n 23\nadverts is useful because you get an opinion from someone you respect, \nan opinion that is reasonably informed and probably slightly different \nfrom the ones you’ll get from people who work at the same place as you.  \n” (A2). \n \nAs suggested above and in extant literatures (Grabher, 2001; Leslie, \n1997), these conversations develop the ability of individuals and firms to \nrespond effectively (in a ‘protean way’) to the latest client demands and \nevolving marketplaces.  Also, as Rantisi (2002) described in relation to \nthe fashion industry, keeping up with rival firms and both knowing about \nand, where appropriate, adopting and adapting their strategies is vital. Of \ncourse, for advertisers and especially lawyers, maintaining client \nconfidentiality means it is not possible to hold conversations that reveal \nthe details of a specific campaign or transaction.  However, all \ninterviewees agreed that it was possible to describe the situation without \ndivulging confidential material, therefore still being able to hold a \nconversation at a level of detail that allows learning3.  \nThe lawyers interviewed also have a number of non-transactional, \nuntraded, relationships with professionals outside of the legal industry \nthat provided an additional form of inter-personal network.  The \ncorporately orientated work of global legal PSFs means that it is essential \nto understand the thinking and norms of major financial institutions \ninvolved in, for example, the financing of the mergers and acquisitions \n 24\nglobal legal PSFs specialise in structuring.  Consequently, the bars and \nrestaurants were important places where lawyers would meet with \nprofessionals working for financial institutions to discuss the latest gossip, \nthinking and product developments in large investment banks such as \nMerrill Lynch.  Lawyers developed such contacts by cultivating \nrelationships with members of financial institutions involved in past \ntransactions and staying in touch with past colleagues who leave to \nbecome ‘in house’ lawyers for financial organizations.  As one lawyer \ndescribed this facet or urban buzz: \n“You often get to hear tip-bits or have good friends who are at clients.  \nI’ve got a very good friend who’s at one of our major investment bank \nclients who I talk to regularly.  It’s the only way you’re going to see what \nproducts are being developed by the banks and the legal approaches \nassociated with them and the expectations about how we’ll handle them.  \nAlso, he inevitably, as well as being a client of ours, is a client of all the \nother magic circle firms and in the same way that we’ll be wining and \ndining him he’ll be wined and dined by lots of other firms. So he’s a very \nuseful source of knowledge about what other people are up to in the law \nindustry too…and these kinds of insights are what keep you at the \ncutting edge in the law community, right up to date with how things are \nevolving” (L3). \n  \nIn this sense, then, the bars and restaurants of London and New York \nare, as others have suggested, important for knowledge production \n 25\nthrough buzz.  However, the empirical material suggests such meetings \nare not serendipitous encounters but, instead, planned interactions \nbetween previously familiar parties.  Indeed, of all the advertisers and \nlawyers interviewed, only two advertisers suggested they benefited from \nfrequenting coffee houses, bars and other public places.  However, this \nwas not because of the other people they serendipitously met, but \nbecause of the inspiration gained from watching the general public and \nfrom being in a different environment to that of the everyday office.  As \ninterviewees frequently commented, there is rarely time to frequent the \nlocal bars and restaurants surrounding the clusters in London and New \nYork because of the pressures to complete projects4.  Moreover, \ninterviewees suggested they only wanted to have such conversations \nwith ‘trusted confidantes’, something that further meant serendipitous \nencounters were unproductive.   \nThe empirical material also highlighted the fact that such \ninterpersonal networks and meetings are not exclusively local \narchitectures and practices of learning.  Both advertisers and lawyers \nhold conversations with colleagues, but this time present colleagues, \nworking in an overseas office of the same firm. These people form a \nnetwork of overseas peers that are regularly spoken to and, based on the \ninsights gained, learned from.  Such networks are formed in two ways.  \nFirst, as a result of the cross-border project teams used in both \nadvertising and legal PSFs to meet the needs of transnational \n 26\ncorporations  for integrated global services.  The constant formation and \nreformation of such teams, and the churching of individuals between \nteams, allows advertisers and lawyers to work, meet and develop \nfriendships with a number of their overseas counterparts.  As one \ninterviewee noted: \n“People develop relationships in the team, get to know each other and \ntalk about problems, share ideas and get a lot by learning from one-\nanother’s insights.  They’ll then stay in touch when the team splits up, \nand just because one person is say working on a confectionary product \nand the others doing cars doesn’t mean they can’t learn from each other” \n(A2)  \n \nAs Grabher (2004) has shown, there is much greater complexity to this \nprocess of relational network formation, something that cannot be fully \nexplored here except through a few key illustrations.  For example, whilst \nthe exchange of insights between individuals within teams is \ncommonplace and extensive, most individuals only maintain one or two of \nthe relationships once the team is disbanded and the project completed. \nFor those networks sustained, however, interviewees described how they \nspoke to their overseas colleagues at least once a week and usually for \nbetween 15 and 45 minutes, sometimes to ask for specific advice, and \nother times for a general chat that might incidentally lead to an \ninformative discussion that resulted in valuable learning. This would also \nbe supplemented by email-based interactions, something that often \n 27\ninvolved the sending and receiving of documents, case studies and, for \nadvertisers, images, diagrams, and even adverts themselves. In the \nterminology of actor-network theory these acted as ‘immutable mobiles’, \nhelping ‘stabilise’ interpretations (see below) and reinforce the learning \nprocess (Latour, 1987). All interviewees agreed, however, that such \n‘virtual’ communication and the use of documents was only beneficial \nwhen coupled to the telephone conversations described previously.  \nThe second way of developing relational networks with overseas \ncolleagues was through the global practice group used by the firms \nstudied. In both advertising and law firms each individual is part of one or \nmore practice groups which bring together individuals with shared lines of \nwork (e.g. account planning in advertising and mergers and acquisitions \nin law).  These more permanent teams also lead to the cultivation of a \nnumber on inter-personal networks that, through regular conversations \noutside of the formal activities of the practice group lead to learning.  As \none interviewee noted: \n“We’re divided into practice groups and then in each of those global \nstreams you will have different practice areas and then within those \nsmaller groupings it much easier to get people together so that at least if \nall your capital markets partners worldwide sort of know each \nother…Then if you get stuck on something in London and you need \nsome help you’ve got someone to call and I’ll call the same people \nseveral times a week when I’m doing something particularly difficult” \n(L2). \n 28\n \nTalking to fellow professionals with whom a long-term relationship has \nbeen nurtured is not, then, a practice that can be defined or delimited by \nscale or spatial (metric) categories and cannot solely be associated with \nthe local scale.  Moreover, as the quotations used show, the quality of the \nlearning cannot be differentiated based on a scale register with both local \nand global points in relational networks having equal value. This would \nseem to support suggestions that a ‘flat’ ontology is needed when \napproaching research so as to prioritise the spatial dynamics of social \npractice.  The next section builds on this idea to further highlight the scale \ntranscending architectures of learning \n \n 4.2) Coordinated learning events \nThe empirical material explored above questions the importance \nof serendipitous encounters in the learning process, something that can \nbe further reinforced by examining the role of coordinated learning events \nand the learning they facilitate.  Conversations and meetings mediated \nthrough the professional associations for advertisers and lawyers in \nLondon and New York are key coordinated learning events facilitating \nbuzz.  In each city a number of professional associations exist.  In \nLondon, the Institute of Practitioners in Advertising and Account Planning \nGroup were regular mentioned by advertisers, whilst for lawyers The City \nof London Law Society and the Networking for Know-how group were \nimportant.  In New York, advertisers drew attention to the role of the \n 29\nAmerican Association of Advertising Agencies whilst lawyers described \nthe importance of the Association of the Bar of the City of New York.   \nFor all of these professional associations, whilst have differing \nstructures, key activities include: lobbying regulators to promote the \nadoption of preferable legislation; providing guidance about management \nissues; and providing training to members in relation to common areas of \nneed.  To fulfil these roles, the professional associations use various \nforms on social gatherings that bring together individuals from a range of \nfirms within the city’s they are based (i.e. London and New York).  These \nevents take the form of discussion forums, committee meetings and \ntraining events that take place on a frequency varying between weekly \nand quarterly.  Those interviewees that participated in the activities of \nprofessional associations (42 out of the 58 interviewed) attended all \nevents when they are less frequent but only selected events (on average \nonce a month) when they are more regular.   \nOne of the affects of such events is to facilitate the forging of new \nrelationships between professional working at rival firms and, through the \npresence of several professionals in one room, to stimulate conversations \nabout shared challenges (Faulconbridge, 2007). This is typical of the \ninter-firm, horizontal and vertical cluster-based learning described in \nexisting literatures (Bathelt et al. 2004; Henry and Pinch, 2001) and \nprovides the opportunity to benefit from timely and relevant conversations \nwith knowledgeable peers.   Consequently, the buildings of professional \n 30\nassociations are filled with ‘urban buzz’ during the events organized.  As \none interviewee described the benefits of professional associations for \ncatalysing such buzz: \n    “…increasingly it is a knowledge exchange and we get together and have \nmeetings focussed on a particular topic, a topic that’s challenging all of us at the \ntime.  And we use the time before and after the meetings to talk about our \nrespective experience on particular topics” (L20). \n \nInterviewees also described conversations with their overseas colleagues \nthat were facilitated through similar coordinated learning events. In the \nglobal practice groups discussed earlier formal interaction between \nmembers occurs in a number of ways. Telephone conference calls in \nwhich all members of the team join in take place, normally on a weekly \nbasis and lasting up to one hour. Surprisingly, video conferencing \ncontinues to play a negligible role in facilitating such interactions. Two \nfactors are significant here. First, and less significant, the limited \navailability of videoconferencing suites, even in the biggest firms. \nSecond, and of greatest importance to all interviewees, the continued \npoor quality of many videoconferencing links. At the time of interviews \n(2003 and 2004), despite recent advances in technology, there was still \ngeneral dissatisfaction at fragmented picture and sound quality. Clearly \nthis situation is changing rapidly and may have changed significantly \nsince the interviews were conducted.   \n 31\nIn addition but less frequently, normally annually, residential \npractice group conferences also provide a forum for such learning but on \na face-to-face basis. The ensuing discussions mirror, as the following \nquote from an advertisers suggest, those held at the professional \nassociations in London and New York: \n“There’s an international planning group [in the firm] called [group x] that \ntry to help each other out with case studies and ideas when we’re doing \nsomething and that becomes very useful because you get different \nperspectives…it’s really useful to know who’s doing the same thing as \nyou but say in London because they might talk about something that \nreally makes you stop and think about what you’re doing” (A29). \n \nThe empirical material suggests, then, that buzz from a network of peers \nhas both local and global geographies with slightly recalibrated, but \nfundamentally the same organizing architectures.  Existing studies often \nfail to fully document these social practices that facilitate learning. As the \ndetailed empirical examination provided here shows, when done this \nquestions both the architectures of local buzz that are often described \n(serendipitous meetings) and the local contingency of such network \npractices.  For interviewees, it was the ability to learn from both urban \nand global buzz simultaneously (as well as from conversations with \ncolleagues working in the same office), thus resulting in a synergistic form \nof learning, that was key to successfully meetings clients needs.  This, \nand the commonality of the practices involved in these various learning \n 32\nnetworks, suggests that drawing a binary between local and global \npractice is misleading and, therefore, that a flat ontology potentially \nprovides a valuable way of placing practice at the centre of geographers \nattention, rather than scale . The discussion below exploring the social \nspaces constituting these networks reinforces this idea. It does, however, \nalso suggest that scale might still be an important analytical tool but only \nwhen used to examine the material effects of a politics of scale on the \npractices of the advertisers and lawyers studied.  \n \n \n \n5) The embeddedness of learning networks \n \n 5.1) Mutual understanding and shared cognition \nAs has been noted elsewhere (Amin and Cohendet, 2004; Bathelt \net al. 2004; Blanc and Sierra, 1999; Leamer and Storper, 2001), for \nlearning to occur in any group or community it is vital that conversations \nare smoothed by the existence of a form of shared cognitive space.  For \nadvertisers and lawyers in London and New York such spaces existed in \nboth the local and global networks of learning described because of the \ncommon professional interests of those interacted with.  The majority of \nadvertising and legal PSFs in London and New York serve marketplaces \ndominated by large (often global) corporate clients whose projects can \n 33\ninvolve budgets of millions of pounds or dollars.  As a result, everyone in \nthese cities faces similar challenges both in terms of client demands and \nmarket related issues (i.e. consumer responses to adverts and \nlegislatives hurdles and changes).  Meanwhile, whilst advertising and \nlegal marketplaces have important and continued local specificities, there \nis some degree of similarity in the problems faced by all advertisers and \nlawyers throughout the World working for the type of transnational firms \nstudied (Faulconbridge, 2006; Trubek et al., 1994).   \nConsequently, sense making, understanding and learning is \nfacilitated in conversations between advertisers and lawyers within the \nsame, and also located in different cities throughout the World by the fact \nthat individuals share: understanding of the challenges faced and their \nlikely solutions; experience of the practices involved in serving such a \nmarketplace; aims and aspirations in relation to advancing both the \nindustry and the products offered to clients; and understanding of the \ncontext, norms and conventions of service production and delivery.  \nBlanc and Sierra (1999) refer to this as various forms of ‘relational \nproximity’.  As two interviewees described this embedding force, the first \ntwo about the local dimensions and the second two the global \ndimensions: \n“…we sit down and say ‘how do we think this particular section of the act \nis actually going to work, what do we think these words actually mean?’  \nAnd in that environment [of a professional association], it made sense for \n 34\npeople to say ‘well I think is maybe this, possibly this’ because it was \nnew to all of us but we all understand the implications and issues it \ncreates…It’s a mixture of learning and sharing your views and thoughts” \n(L3).  \n \n“Its very easy to get on with people [in other offices], very easy to share \nstuff, but because although there tends to be quite fundamental \ndifferences with that markets relationship with a brand or product there \nare useful approaches to a certain extent that are shared and can be \nused to target consumers anywhere in the world” (A8). \n \nThese shared practices are, in particular, tied to the different professional \nroles in advertising and law firms (e.g. account planner or merger and \nacquisitions specialist).  A common analogy used repeatedly by lawyers \nsummarises this idea nicely.  Interviewees repeatedly suggested (using \nvariations on the theme) that, for example, a corporate lawyer in London \nhas more in common with a corporate lawyer in New York that an \nimmigration lawyer at London’s Heathrow Airport.  The same idea was \nechoed by advertisers (i.e. two planners, one in London one in New York, \nhave more in common than a planner and a creative both in London).  \nAgain this suggests that a flat ontology is important to tease out the \nsubtleties of this type of social space and its effect on practices and \nnetworks of learning. However, as the discussion below shows, this does \n 35\nnot necessarily mean discussion of socially constructed politics of scale \nshould be eradicated.  \n \n5.2) Trust \nInterviewees suggested they had to be able to trust the judgment \nof those they spoke to and learned from and, in particular, be sure these \nindividuals were not misleading them or failing to be reciprocal in the \nsharing of insights.  Consequently, urban buzz produced through \ninterpersonal networks was lubricated by trust produced in various ways.  \nFor interpersonal networks with past colleagues trust existed because of \npreviously established relationships, whilst also being reinforced over \ntime as individuals benefited from the advice and ideas gained in \nconversations.  Inevitably, this meant that most networks were based on \npersonal preferences and restricted to below ten people in number. In the \nprofessional associations that facilitate learning, trust grows over time as \nregular attendees get to know one-another and a community forms, \ngelled together by reciprocal relations, the genuine helpfulness of other \nmembers and, consequently, the advantages gained from insights shared \n(Faulconbridge, 2007).  Those who do not display such behaviours are \nquickly excluded from the type of relationships and interactions that \nproduce buzz. As two interviewees described these trust-filled \nrelationships and their importance in facilitating learning from buzz:     \n 36\n“…you have to understand, respect and like them [past colleagues you \nstay in touch with].  For me it’s the trusting and respecting part that’s \nimportant, valuing their opinion, and knowing from past experience you \ncan rely on them ” (A8). \n \n“Trusting people [spoken to at a professional association meeting] is \nvital, it won’t work without that.  You’re not willing to give up any of your \ninformation to people who you don’t trust or who will abuse it and also \nyou’ll only do it once or twice to people who don’t return it” (L8).     \n \nThe trusting relationships that emerged between individuals participating \nin the activities of professional associations was also further consolidated \nby recognition of the fact that everyone present was working in the same \nlocal context with the same ambitions and challenges. This further \nreinforced relationships because, as one advertiser put it, “we talk about \nshared experience, and what we have in common is that we all work in \nadvertising in London and face the same challenges, do similar kind of \nwork” (A17). Of course, at the same time it is also important to note that a \nform of self-selection takes place in these groups which can make them \nhard to break into, particularly for those who do not fit the social model for \nmembers of the group. Junior professionals have to ‘prove’ their worth in \nterms of their willingness and ability to provide useful insights; women \n(particular in the legal industry but less so in advertising) have to deal \nwith the often masculine environment and behaviours associated with \n 37\nsuch groups (see McDowell, 1997); ethnic minority groups, that are \nsignificantly underrepresented in the social makeup of these industries, \nare nearly always absent. Indeed, it is symbolic that whilst those \ninterviewed as part of this research were selected randomly all were \nwhite and only 17 (29 percent) were female. Of those attending the \nevents organised by professional associations only seven (17 percent) \nwere female.  \nInterviewees suggested it was similarly essential that the advice \nand ideas gained from non cluster based buzz could also be relied upon \nin the same way and, therefore, that relationships were again embedded \nin trust.  The process of developing trust in overseas colleagues was a tri-\npart process.  First, trust developed over time as a result of recurrent \ninteractions in much the same was as it did in relationships producing \nurban buzz. As one interviewee described the importance of overcoming \nany challenges faced so as to develop such ‘strong’ relationships: \n“So over time you build a significant network of people which allows you \nto be a lot more effective because they know and understand what \nyou’re dealing with, they accept your work when you say something and \nthat’s incredibly important.  and it would be naive to imagine there aren’t \ncultural differences but I think they are less acute if you are working in an \norganization where people are spending more time getting to know each \nother through one means or another ” (L21). \n \n 38\nSecondly, trusting relationships with overseas colleagues were \nreinforced by the security of speaking to someone working for the same \nfirm.  Maister (2003, 307) suggests a ‘one-firm-firm’ logic often exists in \nPSFs which encourages everyone to trust and respect all colleagues.  \nThis is based on the fact that in all PSFs both securing and then \nmaintaining employment in the leading firms, such as those studied here, \nis only possible through a high level of profit generating professional \nperformance5.  The majority of interviewees reflected this idea and, whilst \nalways being more cautious of previously un-encountered individuals \nthan well known colleagues, to some degree felt they could automatically \ntrust overseas colleagues. As one lawyer put it \n“I think everyone feels pretty prized as a [firm x] lawyer so you can \nalways pretty much guarantee that you can ask a question to someone \nthat you’ve never met nor had any contact with and you’ll get something \nback.  So I think there is a big mutual respect” (L8). \n   \nFinally, trust in overseas colleagues was developed through face-\nto-face contact.  Contrary to the argument put forward in some literatures \n(e.g. Morgan, 2004), interviewees suggested that occasional face-to-face \nencounters at practice group conferences or during business trips could \nalso cement relationships into trusting, reciprocal and socially embedded \nfoundations that then smooth the non face-to-face, telephone based, \nlearning.  As two interviewees commented: \n 39\n“At our conferences, so say for example the recent European \nconference, the chatting, exchanging ideas over coffee, lunch etc is \nmore important than the actual speakers.  Getting to know these people \nsocially, having a drink with them is really important.  Then you’ve got \nsomeone to call in the future” (A4). \n \n“its important to have met with them before, you know their approach \nand you have trust in them… It’s a matter of building up trusts, building \nup relationships…That familiarity, that ability to judge the person, to \njudge whether they’re taking the right decisions” (L7). \n \nThe empirical material reveals, then, that to understand the influences of \ntrust on practices of learning and the spatiality of trusting relationships it \nis important to approach research with the type of ‘flat’ ontology Marston \net al. (2005) describe. This prevents a priori assumptions being made \nabout the scale-boundedness of such social phenomena.  In particular, \nsuggestions that trust can only be produced through spatial proximity and \nregular face-to-face contact (Morgan, 2004; Leamer and Storper, 2001) \nwould seem to oversimplify the processes involved in its production and \ncreate an unnecessary local fetish. This analysis also begins to suggest, \nhowever, that a posteriori discussions of the material effects of a politics \nof scale, used to understand the socio-spatial nuances involved in such \nprocesses, are not necessarily as misleading as some might suggest. \nThe development of trust between individuals present at the events of \n 40\nprofessional associations is, in part, facilitated by recognition from \nprofessionals that everyone in the city faces a number of shared \nchallenges. This produces an important shared sense of ‘imagined’ or \n‘epistemic’ community’ (Anderson 1992; Knorr-Cetina, 1981). \nInterviewees suggested that feeling part of a defined local community \nencouraged collaboration and the sharing of ideas and insight with \nindividuals at rival firms (see Faulconbridge [2007] for more detail). This \nimagining of a local community in the minds of professionals also often \ngels around a desire to make the community globally competitive. In this \nsense it transcends hierarchical representations of scale but reveals the \nimportance of a politics of scale as a metaphorical device for facilitating \ncollaboration between competing firms and creating a valuable \n‘institutional thickness’ that lubricates the learning process (Amin and \nThrift, 1994). As one interviewee noted: \n“It’s a very small market place with probably 15 or less trying to be that \ntype of [large corporate law] firm and we all know each other because \nwe deal with each other all of the time.  We all face similar challenges \nneed to find solutions to common problems so it makes sense to be \nopen and share things” (L9). \n \nA number of the London and New York branches of the professional \nassociations that advertisers and lawyers talked about often (but not \nalways) played a supplementary role in this process, championing \ndiscourse that creates a politics of scale and reinforces the idea that \n 41\nbenefits can be gleaned from contributing to the local community. As \ntable 3 suggests, those promoting such a message highlight the role of \ntheir activities in maintaining and strengthening the local community. \nHere, then, we see the potential material effects of a politics of scale on \nactors in relational processes. This should not be used as an excuse to \ncreate a dichotomy between local and global practices of learning. The \neffects described have also been used by transnational professional \nassociations associated with advertising and law firms and, as table 3 \nalso suggests, The International Competition Network and The Account \nPlanning Group all refer to the global in relation to their activities and use \nrhetoric of global community to bring advertisers and lawyers together \nfrom different firms and countries. Moreover, a similar process and effect \ncan also be seen in relation to the use of the ‘one firm-firm’ rhetoric \ndescribed as creating trust in ‘global’ relations. For advertisers \nparticularly, the ‘one global firm’ ideal described is a social construction – \nboth in terms of the ‘safety’ it provides but also in terms of its boundaries. \nAdvertising agencies are part of larger global groups (table 1) and, in \nreality, the global firm is all agencies within this group. However, all \nadvertisers agreed that trust only existed between those working for the \nsame agency brand, not everyone within the real firm, the holding group. \nMeanwhile, lawyers often extent the one firm-firm logic to lawyers working \nat alliance firms, even though they are not part of the formally defined \nfirm itself. This suggests, then, that exploring the effects of the heuristic \n 42\nvalue of scale and the associated politics of scale that contribute to the \nconstruction of this can potentially help us understand empirical findings \nwhen used in such a retrospective, reflective analytical fashion, rather \nthan as an ontology that informs methodology and analysis.  \n     \n  6) Discussion and concluding thoughts \nThe remit of this paper was to explore the opposition between \n‘local buzz’ and ‘global pipelines’ that has come to represent the way \nlearning and knowledge are discussed in relation to clusters.  Through \nanalysis of case studies of advertising and law PSFs in London and New \nYork the empirical material analysed reveals important similarities in the \nway ‘buzz’ is produced in long and short, local and global learning \nnetworks  Indeed, this in-depth examination of the practices of learning, \nsomething often missing in existing studies of clusters and trans-local \nlearning networks (Bathelt et al. 2004), reveals that similar architectures \nof learning exists between individuals in close and less close physical \nproximity with relational proximity being the defining factor in the success \nof learning (Amin and Cohendet, 2004; Blanc and Sierra, 1999; \nFaulconbridge, 2006). In particular, planned interactions are shown to be \nmore important than serendipitous encounters whilst shared cognitive \nspaces and trusting relationships exist at all points in the learning \nnetworks studied. This contradicts a number of existing arguments \n(Bathelt et al. 2004; Morgan, 2005; Storper and Venables, 2004). Of \n 43\ncourse, there are complex influences and how relational learning \nnetworks emerge.  In particular, this paper highlights how the \ndevelopment of such networks takes place over an extended period of \ntime and also involves important socio-political dynamics that can both \nexclude individuals and complicate the development of embedded \nnetwork forms. But, nevertheless, this still suggests that using metric \nmeasures of proximity as a proxy for degrees of social proximity are \nproblematic.    \nIt is important to recognise that some of these findings might be \nparticular to PSFs and, in particular, global PSFs.  However, studies of, \namongst others, the software (Orlikowski, 2002) and oil industries (Bridge \nand Wood, 2005) have yielded similar findings. The arguments put \nforward also reflect those in a range of other debates with, for example, \nthere being recognition (e.g. Amin and Thrift, 2002) that urban spaces \ncannot be adequately understood through spatial binaries or spatially \n(locally) constrained studies.  In its place, studies of the porosity and \nfluidity of urban space are suggested.  The findings presented in this \npaper indicate that, more than ever, the competitiveness of a city’s \nclusters is influenced by the tying-in of firms to organized spaces of \nlearning that create networks of buzz with both local and global \ndimensions.   \n This brings us back to questions about the role of scale in such \ndiscussions. The contention that the geographies of learning and \n 44\nknowledge should not be typified by scale based delimitations such as \nlocal-global (Allen, 2000) and instead be recognised as contested, fluid \nand dependent on the spatial organizational of learning practices (Amin \nand Cohendet, 2004) are reinforced by the findings of this paper. It \nseems wise, then, to avoid the a priori association of socio-spatial \npractices such as learning with labels derived from a scalar ontology such \nas ‘local-incremental’ and ‘global-nonincremental’ (Jessop, 2000; Marston \net al. 2005).  However, as the empirical material suggests, this does not \nmean jettisoning scale from geographers’ lexicons is necessarily the best \nway forward.  Rather, we must avoid preordained scalar specification and \ndelimitation of the networks by tracing the practices of, and constraints on \nsocial endeavours such as learning so as to fully understand the \nintricacies involved. As was shown above, this can lead to important \nscalar reflections being made a posteriori based on discoveries of the \nmaterial effects of a socially constructed politics of scale. As suggested \nthen, recent calls for a ‘flat ontology’ (Marston et al. 2005) provide an \nimportant reminder about the importance of choosing appropriate \nontology and methodologies when engaging in geographical research. \nThey also highlight the importance of clarity in the meaning and use of \nscale terminologies. Nevertheless, this should not lead us to ignore the \nimportant role for scale as an analytical device for exploring and \nunderstanding the material effects of scale politics (Collinge, 2006), \nsomething that means throwing the baby out with the bath water and \n 45\ncompletely purging scale from our vocabularies might be inappropriate. It \nwould seem, then, that the future challenge for geographers involves the \nadoption of suitable practice based, network methodologies for research, \nsuch as that proposed by Dicken et al. (2001), that allow both the \nparticularities of place and scale to be understood but without resorting to \nmisleading spatial fetishes.  \n \n \n \n \n \n \n \n \n \nAcknowledgements: \n \nTBC \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 46\nReferences \n \n \nAdvertising Age, A.  (2006). 59th Annual agency report. London: Advertising \nAge \nAllen, J.(2000.)  Power\/economic knowledge.  Symbolic and Spatial \nformations. In Bryson, J, P W Daniels, N Henry, J Pollard (Eds).  \nPower\/economic knowledge.  Symbolic and Spatial formations. London:  \nRoutledge  pp 15-33 \nAmin A (2002) Spatialities of globalisation.  Environment and Planning A 34 \n385-399. \nAmin, A and Cohendet, P.(2004.)  Architectures of knowledge: Firms \ncapabilities and communities. Oxford University Press, Oxford \nAmin, A and Thrift, N. (1992)  Neo-Marshallian nodes in global networks. \nInternational journal of urban and regional research 16 pp 571-587 \nAmin A and Thrift N (1994)  Living in the global.  In Amin A and Thrift N (Eds)  \nGlobalisation, institutions and regional development in Europe.  Oxford \nUniversity Press, Oxford. \nAmin, A and Thrift, N.(2002.)  Cities: reimagining the urban. Polity press, \nCambridge \nAnderson, B (1991) Imagined Communities: Reflections on the Origin and \nSpread of Nationalism. Verso, London. \nBathelt, H, Malmberg, A and Maskell, P. (2004)  Clusters and knowledge: \nlocal buzz, global pipelines and the process of knowledge creation. Progress in \nHuman Geography 28 (1), pp 31-56 \n 47\nBeaverstock, J V, Smith, R and Taylor, P J. (1999)  The long arm of the law: \nLondon's law firms in a globalising world economy. Environment and Planning A \n13 pp 1857-1876 \nBlanc, H and Sierra, C. (1999)  The internationalisation of R& D by \nmultinationals: a trade-off between external and internal proximity. Cambridge \nJournal of Economics 23 pp 187-206 \nBrenner, N. (2001)  The limits to scale?  Methodological reflections on scalar \nstructuration. Progress in Human Geography 25 (4), pp 591-614 \nBridge, G and Wood, A. (2005)  Geographies of knowledge, practices of \nglobalization: learning from the oil exploration and production industry. Area 37 \n(2), pp 199-208 \nBunnell TG and Coe NM (2001)  Spaces and scales of innovation.  Progress \nin Human Geography 25(4) 569-589. \nClarke, D B and Bradford, M G. (1989)  The uses of space by advertising \nagencies within the United Kingdom. Geografiska Annaler B: Human Geography \n71B pp 139-151 \nCorporation of London (2003). Financial service clustering and its significance \nfor London. London:  The Corporation of London \nCullen-Mandikos, B and MacPherson, A. (2002)  US foreign direct investment \nin the London legal market: an empirical analysis. The professional geographer \n54 (4), pp 491-499 \nDicken, P, Kelly, P F, Olds, K and Yeung, H W-C. (2001)  Chains and \nnetwork, territories and scales: towards a relational framework for analysing the \nglobal economy. Global Networks 1 (2), pp 89-112 \n 48\nFaulconbridge, J R. (2006)  Stretching tacit knowledge beyond a local fix? \nGlobal spaces of learning in advertising professional service firms. Journal of \nEconomic Geography 6 pp 517-540 \nFaulconbridge, J R. (2007)  Exploring the role of professional associations in \ncollective learning in London and New York's advertising and law professional \nservice firm clusters. Environment and Planning A 39 pp \nGertler MS (2001)  Best practice?  Geography, learning and the institutional \nlimits to strong convergence.   Journal of Economic Geography 1 5-26 \nGrabher, G. (2001)  Ecologies of creativity:  the village, the group and the \nheterarchic organisation of the British advertising industry. Environment and \nPlanning A 33 pp 351-374 \nGrabher, G. (2004)  Learning in projects, remembering in networks? \nCommunality, sociality and connectivity in project ecologies. European urban \nand regional studies 11 (2), pp 103-123 \nHenry, N and Pinch, S. (2000)  Spatialising knowledge: placing the knowledge \ncommunity of Motor Sport Valley. Geoforum 31 pp 191-208 \nJessop, R. (2000)  The crisis of the national spatio-temporal fix and the \ntendencial ecological dominance of globalizing capitalism. International journal of \nurban and regional research 24 (2), pp 323-360 \nKeeble, D, Lawson, C, Moore, B and Wilkinson, F. (1999)  Collective learning \nprocess, networking and institutional thickness in the Cambridge Region. \nRegional Studies 33 (4), pp 319-332 \nKnorr-Cetina K (1981)  The manufacture of knowledge.  An essay on the \nconstructivist and contextual nature of science.  Pergamon, Oxford. \n 49\nLatour B (1987)  Science in action: how to follow scientists and engineers \nthrough society.  Open university press Milton Keynes. \nLawyer The (2005). The global 100 (2004 edition). London, The Lawyer. \nLeamer, E and Storper, M. (2001)  The economic geography of the internet \nage. Journal of international business studies 32 (4), pp 641-655 \nLeslie DA (1995)  Global scan: the globalization of advertising agencies \nconcepts, and campaigns.  Economic Geography 71(4) 402-426. \nLeslie, D. (1997)  Abandoning Madison Avenue: the relocation of advertising \nservices in New York city. Urban Geography 18 (7), pp 568-590 \nMaister, D.(2003.)  Managing the professional service firm. Simon Schuster, \nLondon \nMansfield, B. (2005)  Beyond rescaling: reintegrating the 'national' as a \ndimension of scalar relations. Progress in Human Geography 29 (4), pp 458-473 \nMarkusen A (1999)  Fuzzy concepts, scanty evidence, policy distance: the \ncase for rigour and policy relevance in critical regional studies.  Regional studies \n33(9) 869-884. \nMarston, S. (2000)  The social construction of scale. Progress in Human \nGeography 24 (2), pp 219-242 \nMarston, S, Jones, J P and Woodward, K. (2005)  Human geography without \nscale. Transactions of the Institute of British Geographers NS 30 pp 416-432 \nMartin, R and Sunley, P. (2003)  Deconstructing clusters: chaotic concept or \npolicy panacea. Journal of economic geography 3 pp 5-35 \nMassey, D.(1999.)  Space of politics. In Massey, D, J Allen, P Sarre (Eds).  \nSpace of politics. Cambridge:  Polity Press  pp 279-294 \n 50\nMcDowell L (1997)  Capital culture- gender at work in the city.  Blackwell, \nOxford. \nMol A and Law J (1994)  Regions, networks and fluids: anaemia and social \ntopology.  Social studies of science 24 641-671. \nMorgan, K. (2004)  The exaggerated death of geography: learning, proximity \nand territorial innovation systems. Journal of economic geography 4 (1), pp 3-21 \nMorris, C and Empson, L. (1998)  Organisation and Expertise: An Exploration \nof Knowledge Bases and the Management and Consulting Firms. Accounting \norganizations and society 23 (5\/6), pp 609-624 \nMurdoch J (1995)  Actor-networks and the evolution of economic forms: \ncombining description and explanation in theories of regulation flexible \nspecialization and networks.  Environment and Planning A 27  731-757. \nNachum, L and Keeble, D. (1999)  Neo-marshallian nodes, global networks \nand firm competitiveness:  the media cluster of central London. ESRC centre for \nbusiness research working paper no. 138. Available from \nhttp:\/\/www.econ.cam.ac.uk\/cgi-\nbin\/cbr_wp3.pl?conf_file=cbr.conf&terms=1999&series=camdae&criteria=creatio\nn-date&boolean=AND&case=Insensitive   \nNachum, L and Keeble, D. (2000)  Foreign and indigenous firms in the media \ncluster of central London. ESRC centre for business research working paper no. \n154. Available from http:\/\/www.econ.cam.ac.uk\/cgi-\nbin\/cbr_wp3.pl?conf_file=cbr.conf&terms=1999&series=camdae&criteria=creatio\nn-date&boolean=AND&case=Insensitive   \nOECD.  (2000). Knowledge management in the learning economy. Paris:  \nOECD  \n 51\nOrlikowski WJ (2002)  Knowing in practice: enacting a collective capability in \ndistributed organizing.  Organization Science 13 (3) 249-273. \nRantisi, N. (2002)  The local innovation system as source of variety: openness \nand adaptability in New York City's garment district. Environment and Planning D \n36 (6), pp 587-602 \nSaxenian, A and Hsu, J-Y. (2001)  The Silicon Valley-Hsinchu connection: \nTechnical communities and industrial upgrading. Industrial and corporate change \n10 (4), pp 893-920 \nStorper, M and Venables, A J. (2003)  Buzz: face-to-face contact and the \nurban economy. Journal of economic geography 4 pp 351-370 \nSturgeon, T J. (2003)  What really goes on in Silicon Valley?  Spatial \nclustering and dispersal in modular production networks. Journal of economic \ngeography 3 pp 199-215 \nSwyngedouw, E.(1997.)  Neither global nor local: 'Glocalization' and the \npolitics of scale. In Cox, K (Eds). Spaces of Globalisation  New York:  Guildford  \npp 137-166 \nThrift, N.(1995)  A hyperactive world. In Johnston, R J, P J Taylor, M J Watts \n(Eds). Geographies of global change.  Remapping the world.  Oxford:  Blackwell  \npp 29-43 \nTrubek, D M, Dezalay, Y, Buchanan R and Davis, J R. (1994)  Global \nrestructuring and the law: studies of the internationalization of legal fields and the \ncreation of transnational arenas. Case Western reserve law review 44 (2), pp \n407-498 \n 52\nUNCTAD.  (2004). Trade and development aspects of professional services \nand regulatory frameworks. New York and Geneva:  United Nations conference \non trade and development  \nWarf, B. (2001)  Global dimensions of US legal services. The professional \ngeographer 53 (3), pp 398-406 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 53\n \nCompany \n \nHolding \ncompany group \n \nWorldwide Revenue \n(millions in 2005) \n \n \nGlobal offices Key global clients \n \nPublicis worldwide \n \nPublicis \n \n$2,685 \n \n170 \nAllied Domecq \nHewlett Packard \nEricsson \n \nMcCann-Erickson worldwide \n \nInterpublic \n \n£1,461 \n \n417 \nCoca-Cola \nMastercard \nCereal Partners \n \nBBDO worldwide \n \nOmnicom \n \n$1,259 \n \n283 \nMars \nGilette \nGuiness \n \nJ Walter Thompson \n \nWPP \n \n$1,313 \n \n227 \n \nVodafone \nShell \nDiaego \n \nTBWA \n \nOmnicom \n \n$950 \n \n233 \nAddidas \nSony \nNews International \n \nLeo Burnett worldwide \n \nPublicis \n \n$807 \n \n480 \n \nHeinz \nProctor & Gamble \nMorgan Stanley \n \nOgilvy & Mather worldwide \n \nWPP \n \n$801 \n \n314 \n \nFord \nBP \nAmerican Express \n \nGrey worldwide* \n \nWPP* \n \n$629 \n \n237 \n \nGlaxosmithkline \nProctor & Gamble \nNokia \n \nEuro RSCG worldwide \n \nHavas \n \n$496 \n \n84 \nIntel \nDanone \nCadbury Trebor Basset \n \nYoung & Rubicam \n \nWPP \n \n$18,678 \n \n283 \n \n11,387 \nColgate-Palmolive \nLEGO \n \n \nWP  \n \n \n$473 \n \n304 \nColgate-Palmolive \nLEGO \n \nTable 1.  The 10 leading global agencies by turnover. \nSource: Advertising Age (2006); Fieldwork. \n* Grey Worldwide was original part of the ‘Grey Global group’ but was acquired by WPP in 2005. \n \n \n \n \n 54\n \n \n \n \nFirm \n \n \n \nGlobal turnover (£m) \n(2004) \n \n \nGlobal offices  \n \n \nClifford Chance \n \n914 \n \n34 \n \n \nSkadden Arps Slate \nMeagher & Flom \n \n \n785 \n \n23 \n \nFreshfields Bruckhaus \nDeringer \n \n780 \n \n28 \n \nLinklaters \n \n805 \n \n31 \n \nBaker & McKenzie \n \n670 \n \n69 \n \nAllen & Overy \n \n666 \n \n26 \n \nLatham & Watkins \n \n658 \n \n22 \n \nWhite & Case \n \n \n \n520 \n \n39 \n \nWeil Gotshal & \nManges \n \n494 \n \n16 \n \nJones Day \n \n \n \n649 \n \n18 \n \n \nTable 2.  They 10 key  global law firms as of January 2005. \nSource: The lawyer (2005) and Fieldwork. \n 55\n \n \n Professional \nassociation \n \n \nRole of scale \n \nRhetoric deployed to promote association’s aims \n \n \nThe City of \nLondon Law \nSociety \n \nLocal politics of scale - ‘The City’ acts as a device \nto identify a community, spatially signified by the \ncontemporary boundaries of the City of London. \nHowever, the global reach of the association’s \nactions also point to the dangers of conflating such \na politics of scale with hierarchical or vertical \nscalar binaries and divisions. \n \n“We are a powerful force in ensuring that the views and concerns of City solicitors are \nrepresented and heard in national and international debates which affect their \npractice…Through the work of sixteen specialist Committees, the Society researches \nand debates current legal issues and makes recommendations on new developments. The \nCommittees produce work of national and international significance which is available \nto members” (http:\/\/www.citysolicitors.org.uk\/Legal_activities\/default.asp?s=3 \n[accessed 23\/10\/06])  \n \nThe Association \nof the Bar of \nNew York City \n \nLocal politics of scale - Again, ‘the city’ and its \n‘community’ is used as a symbolic device to \njustify the existence of the association.  \n \n“In December 1869, a letter was circulated among some of the city's lawyers addressing \nthose improprieties. It called for the creation of a new bar association to ‘sustain the \nprofession in its proper position in the community, and thereby enable it . . . to promote \nthe interests of the public’ .... Because of the strength and dedication of its members, the \nAssociation continually renews its spirit and that of the community it serves” \n(http:\/\/www.nycbar.org\/AboutUs\/index.htm [accessed 23\/10\/06])  \n  \nThe Account \nPlanning Group \n \nGlobal politics of scale - Justification for \nengagement with the overseas members of the \ngroup comes from being part of a global \ncommunity. \n \n“The UK APG is, as the name suggests, a UK-based organisation, but we have members \nall over the world, and we're keen to support Planners and other Account \nPlanning organisations around the planning planet” (http:\/\/www.apg.org.uk\/about-\nus\/international.cfm [accessed 23\/10\/2006]) \n \n The \nInternational \nCompetition \nNetwork \n \n Global politics of scale -  taking part in the \nactivities of the association benefits the global \ncommunity of lawyers and traders \n \n“The ICN brings international antitrust enforcement into the 21st century. By enhancing \nconvergence and cooperation, the ICN promotes more efficient, effective antitrust \nenforcement worldwide. Consistency in enforcement policy and elimination of \nunnecessary or duplicative procedural burdens stands to benefit consumers and \nbusinesses around the globe” (http:\/\/www.internationalcompetitionnetwork.org\/ \n[accessed 23\/10\/06]). \n \nTable 3. The role of a politics of scale in encouraging engagement with the activities of professional associations. \n 56\nAcknowledgements \nThe empirical material reported here was collected as part of a PhD project \ndesigned and executed at Loughborough University, UK with the support of Jon \nBeaverstock and Peter Taylor. I am grateful to Ash Amin for providing the spur to \nwrite this paper and for the invite to participate in the Dynamics of Institutions and \nMarkets in Europe workshop on Communities of Practice at Durham University in \nOctober 2006. Discussions at this workshop helped consolidate the ideas reported \nhere. Of course, all the usual disclaimers apply.   \n \n \n                                            \n1\n Grabher (2001, 353-354) defines a heterarchy as a form of social organization.  This has \nfive characteristics the affect how the system operates: the tolerance of internal diversity; \nrivalry between members and groups; tags that define the rules and protocols used to \ncondition understanding; project organization that allow for collaboration; and reflexivity that \nallows the appropriateness of assumptions to be challenged. \n \n2\n This process was, in part, driven by the deregulation of the Law Society in the UK in 1990 in \nwhat was referred to as the legal ‘big bang’.  For the first time foreign practitioners were \npermitted to become registered lawyers on completion of transfer tests or, where the \n 57\n                                                                                                                             \nindividual was suitably experienced, through an interview assessment (Cullen-Mandikos and \nMacPherson, 2002). \n \n3\n For a number of lawyers in particular, there was always concern that the type of \nconversations described above might be counter-productive.  As one lawyer put it, “it’s a pride \npoint… I’d be very surprised if someone from a big firm rang me and said ‘I don’t know what’s \ngoing on here’ I’d be very surprised, I mean I’d be rubbing my hands with glee” (6).  This was \na minority view (expressed by only five lawyers) but an important caveat to discussions about \nsuch extra-organizational interactions.      \n \n4\n This is, for lawyers, in part a consequence of the way lawyers charge for their services.  \nClients are billed by the hour and, therefore, all lawyers are under pressure to put is as many \nbillable hours as possible.  On average, firms expect lawyers to bill somewhere in the region \nof 2000-2500 hours a year to clients.  This works out at between 38 and 48 hours a week, \nexcluding any holidays.  With four weeks holiday this increases to 41 and 52 hours a week.  \nHowever, particularly in New York, holidays were a privilege not an expectation and often not \ntaken.   \n \n5\n PSFs generally use the ‘up or out system’ (Morris and Pinnington, 2002) whereby individuals \nonly secure and maintain employment if they demonstrate the potential to attract clients, \n 58\n                                                                                                                             \ndevelop in their level of competence and gradually gained promotion as a reflection of this, \nbecoming partner within a set period of time.  Those unable to ‘move up’ in the firm in this \nway are ‘forced out’, thereby ensuring everyone in the firm is a high performer. \n"}