{"doi":"10.1144\/SP319.14","coreId":"59494","oai":"oai:nora.nerc.ac.uk:8231","identifiers":["oai:nora.nerc.ac.uk:8231","10.1144\/SP319.14"],"title":"Can CO2 hydrate assist in the underground storage of carbon dioxide?","authors":["Rochelle, C.A.","Camps, A.P.","Long, D.","Milodowski, A.","Bateman, K.","Gunn, D.","Jackson, P.","Lovell, M.A.","Rees, J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":["Long, David","Lovell, Mike A","Rees, John","Rochelle, Christopher"],"datePublished":"2009","abstract":"The sequestration of CO2 in the deep geosphere is one potential method for reducing anthropogenic emissions to the atmosphere without necessarily incurring a significant change in our energy-producing technologies. Containment of CO2 as a liquid and an associated hydrate phase, under cool conditions, offers an alternative underground storage approach compared with conventional supercritical CO2 storage at higher temperatures. We briefly describe conventional approaches to underground storage, review possible approaches for using CO2 hydrate in CO2 storage generally, and comment on the important role CO2 hydrate could play in underground storage. Cool underground storage appears to offer certain advantages in terms of physical, chemical and mineralogical processes, which may usefully enhance trapping of the stored CO2. This approach also appears to be potentially applicable to large areas of sub-seabed sediments offshore Western Europe","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/59494.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/8231\/1\/Rochelle_et_al_final_as_published.pdf","pdfHashValue":"8b3c30a9c1a92a9549358e6572759942ffa0fa06","publisher":"Geological Society of London","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:8231<\/identifier><datestamp>\n      2012-11-22T12:07:13Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D626F6F6B5F73656374696F6E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8231\/<\/dc:relation><dc:title>\n        Can CO2 hydrate assist in the underground storage of carbon dioxide?<\/dc:title><dc:creator>\n        Rochelle, C.A.<\/dc:creator><dc:creator>\n        Camps, A.P.<\/dc:creator><dc:creator>\n        Long, D.<\/dc:creator><dc:creator>\n        Milodowski, A.<\/dc:creator><dc:creator>\n        Bateman, K.<\/dc:creator><dc:creator>\n        Gunn, D.<\/dc:creator><dc:creator>\n        Jackson, P.<\/dc:creator><dc:creator>\n        Lovell, M.A.<\/dc:creator><dc:creator>\n        Rees, J.<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        The sequestration of CO2 in the deep geosphere is one potential method for reducing anthropogenic emissions to the atmosphere without necessarily incurring a significant change in our energy-producing technologies. Containment of CO2 as a liquid and an associated hydrate phase, under cool conditions, offers an alternative underground storage approach compared with conventional supercritical CO2 storage at higher temperatures. We briefly describe conventional approaches to underground storage, review possible approaches for using CO2 hydrate in CO2 storage generally, and comment on the important role CO2 hydrate could play in underground storage. Cool underground storage appears to offer certain advantages in terms of physical, chemical and mineralogical processes, which may usefully enhance trapping of the stored CO2. This approach also appears to be potentially applicable to large areas of sub-seabed sediments offshore Western Europe.<\/dc:description><dc:publisher>\n        Geological Society of London<\/dc:publisher><dc:contributor>\n        Long, David<\/dc:contributor><dc:contributor>\n        Lovell, Mike A<\/dc:contributor><dc:contributor>\n        Rees, John<\/dc:contributor><dc:contributor>\n        Rochelle, Christopher<\/dc:contributor><dc:date>\n        2009<\/dc:date><dc:type>\n        Publication - Book Section<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8231\/1\/Rochelle_et_al_final_as_published.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Rochelle, C.A.; Camps, A.P.; Long, D.; Milodowski, A.; Bateman, K.; Gunn, D.; Jackson, P.; Lovell, M.A.; Rees, J..  2009  Can CO2 hydrate assist in the underground storage of carbon dioxide?    In: Long, David; Lovell, Mike A; Rees, John; Rochelle, Christopher, (eds.) Sediment-hosted gas hydrates : new insights on natural and synthetic systems.  London, UK, Geological Society of London, 171-183.  (Special publications Geological Society, 319).      \n <\/dc:identifier><dc:relation>\n        http:\/\/sp.lyellcollection.org\/content\/vol319\/issue1\/<\/dc:relation><dc:relation>\n        10.1144\/SP319.14<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/8231\/","http:\/\/sp.lyellcollection.org\/content\/vol319\/issue1\/","10.1144\/SP319.14"],"year":2009,"topics":["Earth Sciences"],"subject":["Publication - Book Section","PeerReviewed"],"fullText":" \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \nCan CO2 hydrate assist in the underground storage of carbon dioxide? \n \n \nC. A. ROCHELLE1*, A. P. CAMPS1,2, D. LONG3, A. MILODOWSKI1, K. BATEMAN1,  \nD. GUNN1, P. JACKSON1, M. A. LOVELL2 AND J. REES1 \n \n1 British Geological Survey, Keyworth, Nottingham NG12 5GG, UK \n2 Department of Geology, University of Leicester, Leicester LE1 7RH, UK \n3 British Geological Survey, Edinburgh EH9 3LA, UK \n* Corresponding author, caro@bgs.ac.uk \n \n \nAbstract  \n \nThe sequestration of CO2 in the deep geosphere is one potential method for reducing \nanthropogenic emissions to the atmosphere without necessarily incurring a significant change \nin our energy-producing technologies. Containment of CO2 as a liquid and an associated \nhydrate phase, under cool conditions, offer an alternative underground storage approach \ncompared to conventional supercritical CO2 storage at higher temperatures. We briefly \ndescribe conventional approaches to underground storage, review possible approaches for \nusing CO2 hydrate in CO2 storage generally, and comment on the important role CO2 hydrate \ncould play in underground storage. Cool underground storage appears to offer certain \nadvantages in terms of physical, chemical and mineralogical processes, which may usefully \nenhance trapping of the stored CO2. This approach also appears to be potentially applicable to \nlarge areas of sub-seabed sediments offshore Western Europe. \n \n \n \n8796 words, 73 references, 6 figures \n \nKeywords: Carbon dioxide. CO2, underground storage, sequestration, hydrate \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nRunning title: CO2 HYDRATE AND UNDERGROUND STORAGE \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \nIt is now widely accepted the rising levels of carbon dioxide (CO2) in the Earth’s atmosphere \nare causing global climate change, and this is a subject of international concern (e.g. IPCC \n1990, 2007). Furthermore, if something is not done to reduce emissions of greenhouse gases \nto the atmosphere, predictions suggest an unprecedented rate of future temperature increase, \nwith unknown, but possibly rapid, consequences for the global climate. Measurements show \nthat global temperatures rose by 0.3-0.6°C in the 20th century. If the trends in current \nemissions continue there are suggestions (Karl et al. 2000; RCEP 2000) that the global mean \ntemperature is likely to be about 3°C higher than at present by the end of the 21st century. The \nmain difficulty in attempting to combat climate change is the world population’s high \ndependence on fossil fuels as an energy source. Alternatives such as solar energy and other \nrenewables are making a useful contribution, and some countries presently rely heavily on \nnuclear power, nonetheless, the culture and lifestyle of many countries appear to be strongly \nlinked to fossil fuel usage for many years to come. \n \nAssuming that we continue to burn fossil fuels, yet wish to mitigate CO2 emissions to the \natmosphere, we are faced with a limited number of alternatives: \n1. To reduce our CO2 emissions by using lower carbon fuels (e.g. gas instead of coal); \n2. To utilise the produced CO2; \n3. To dispose of the CO2 in another domain of the planet, such as the geosphere, the \nterrestrial biosphere or the oceans. \nIn order to stabilise atmospheric CO2 concentrations at current values, it may be necessary to \nreduce CO2 emissions by 60% or more over the next 50 years (RCEP 2000). Although many \ncountries are making strenuous efforts to reduce their CO2 emissions, this is proving \nextremely difficult because all countries, and not just the developing ones, continue to strive \nfor economic growth - which requires energy. Even those countries that have managed to \nmake significant reductions in their energy intensity have struggled to reduce overall \nemissions. Almost the only exceptions are countries that have greatly reduced their use of \ncoal or have developed a substantial nuclear energy base (e.g. Sweden). Therefore, it seems \nlikely there will be no reduction in the production of CO2, at least in the short term. \n \nAlthough large-scale utilisation of waste CO2 is initially attractive, it has major problems, as \nconverting it into useful substances requires large energy inputs. In many cases, if these \nenergy inputs are in the form of fossil fuels, a net saving of CO2 emissions becomes \nimpossible. Alternatively, we could prevent the CO2 entering the atmosphere in the first place. \nAt present we are disturbing the balance of the natural ‘carbon cycle’ where carbon is slowly \ncycled between atmosphere, biosphere, hydrosphere and geosphere, by rapidly transferring \nlarge amounts of carbon from the geosphere into the atmosphere. By storing (or sequestering) \nvast volumes of CO2 securely without any land use or verification problems, we may be able \nto redress some of this imbalance. One possible location for such a store is within porous \nrocks underground (the geosphere). In essence, geological storage aims to put the carbon \ndirectly back into the place from which it originally came (in the form of fossil fuels), thereby \navoiding the atmospheric part of the carbon cycle. \n \n \nThe underground storage of CO2 \n \nUnderground storage is a feasible means of sequestering very large quantities of CO2 \nproduced by point sources such as fossil fuel fired power plants (e.g. Freund & Ormerod \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \n1996; Haugen & Eide 1996; Holloway 1996a,b; Baines & Worden 2004a and references \ntherein). Currently this is already being demonstrated, with 1-2 Mtonnes of CO2 injected \nannually at both the Sleipner gas field, North Sea (Baklid et al. 1996; IEA GHG 1998) and \nthe Weyburn oil field, southern Saskatchewan, Canada (Moberg 2001; Malik & Islam 2000; \nWilson & Monea, 2004). \n \nThe concept of underground sequestration (in its conventional form) involves first capturing \nthe CO2 at source to produce a pure CO2 stream (e.g. via amine scrubbing of power plant flue \ngases). This is followed by compression to liquefy the CO2 prior to transportation by pipeline \nto the injection site. Once at the injection site, the CO2 can be injected via wells into deep \nreservoir rocks capped by very low permeability seals such as shales or clays. Injection could \nbe into traps directly analogous to oil or natural gas fields (e.g. Bergman et al. 1996), or as at \nSleipner into large aquifers.  \n \nIf the CO2 is injected at a depth of about 800 metres or more, and assuming average \ngeological conditions in the world’s sedimentary basins, pressure and temperature will \nincrease beyond the point where CO2 becomes supercritical (approximately 31°C, 74 bars) \n(Fig. 1). The density of supercritical CO2 varies depending on pressure and temperature. \nHowever, for many currently-envisaged storage conditions it is likely to have a density in the \norder of 700 kg m-3 - far denser than gaseous CO2 (approximately 2 kg m-3 at Earth surface \nconditions), but less dense than formation porewater (approximately just greater than 1000 \nkg m-3 depending on salinity). As a consequence, stored CO2 will occupy much less volume \nthan gaseous CO2, effectively greatly increasing the storage potential of sedimentary basins. \n \nAfter injection, the CO2 will initially be stored in a free state as a buoyant ‘pure’ phase below \nan impermeable caprock (described as ‘physical trapping’ by Bachu et al. [1994]), in much \nthe same way as methane in natural gas fields. However, over time it will dissolve in the \nformation water of the reservoir (‘solubility trapping’). Once dissolved, it will no longer be \nbuoyant, and hence its migration will only be driven by very slow regional-scale groundwater \nflow. The dissolved CO2 will lower the pH of the formation water, and over even longer \ntimescales (measurable in 100s or 1000s of years) this dissolved CO2 will react with minerals \nwithin the rocks to precipitate calcite or other carbonate minerals (described as ‘mineral \ntrapping’ by Bachu et al. [1994]). This will result in the immobilisation of at least a \nproportion of the carbon for geologically significant timescales (e.g. Baker et al. 1995; \nCzernichowski-Laurol et al. 1996a,b; Gunter et al. 1993, 1997; Rochelle et al. 1999, 2004). \nThe extent of such reactions will depend upon various factors such as the composition of the \nporewater, the composition of the rocks and minerals it encounters, as well as the in-situ \npressure and temperature. \n \nIf the underground storage of CO2 is to be a practicable large-scale disposal method, there is a \nneed to ensure it will remain safely underground, and not return to the atmosphere within \nrelatively short geological timescales (i.e. thousands of years). This would allow natural \nbuffering processes (e.g. oceanic and forestry sinks) to have sufficient time to reduce global \natmospheric CO2 levels to environmentally acceptable levels. Indeed, acceptable performance \nwill need to be demonstrated in order to satisfy operational, regulatory and public acceptance \ncriteria. The generally good track record of CO2-assisted enhanced oil recovery operations \nand purpose-designed underground storage of natural gas shows underground storage can be \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \npracticable and leakage minimised, at least over anthropogenic or ‘industrial’ decadal \ntimescales. \n \nWith underground sequestration, it is possible that the CO2 could be retained for timescales of \ntens of thousands to millions of years (e.g. Holloway 1997; Pearce et al. 1996). Indeed, many \nnatural CO2 fields have been discovered that are far older than this (e.g. Baines & Worden \n2004b; Czernichowski-Lauriol et al. 1996a; Pearce et al. 1996, 2004; Zheng et al. 2001). For \nexample, the CO2 in the natural carbon dioxide field at Pisgah Anticline in Central \nMississippi, USA is thought to have originated from thermal metamorphism of Jurassic \ncarbonates by the Jackson Dome igneous intrusion during late Cretaceous times (Studlick et \nal. 1990), which ended some 65 million years ago. Thus, given appropriate geological \nstructures, the underground storage of CO2 appears to be a safe and practicable way of \nreducing anthropogenic emissions of CO2 to the atmosphere. \n \n \nHow can hydrates help with CO2 sequestration? \n \nUntil recently, the majority of hydrate studies within the natural environment have \nconcentrated on methane hydrate (CH4) an ice-like compound naturally stable in certain sea \nfloor sediments. Many of these studies have focussed on the release of methane through \nnatural processes, possibly linked to long-term changes in climate or through human activity \n(i.e. global warming or production of CH4 as an energy source). Over the past few years \nhowever, there has been growing interest in hydrates as a store for anthropogenic CO2, \nlocking up CO2 in an easily formed solid phase in domains of the planet where it will not be \nreleased to the atmosphere over relatively short timescales. \n \nIn addition to the current approaches to deep CO2 storage described previously, there is \nanother approach involving storage at cooler temperatures, but still at high-pressure \nconditions beneath permafrost regions or in sediments below the floor of deep oceans. This \n‘cool storage’ approach has received relatively little attention even though it may offer certain \nadvantages in terms of long-term containment of CO2. In particular, under appropriate \nconditions (typically <10°C and with hydrostatic heads >400 m) CO2 hydrate becomes stable, \nand this could help immobilize CO2 for geologically-important timescales (e.g. Koide et al. \n1996). \n \n \nTrapping CO2 as a hydrate phase on the ocean floor \n \nPrior to discussing the benefits of immobilising CO2 as a hydrate within sediments, it is first \nuseful to summarise other proposed methodologies for storing CO2 as a hydrate phase. Much \nresearch has focussed on releasing liquid CO2 into the deep oceans, either as droplets within \nthe water column, or as pools on the ocean floor (e.g. Austvik & Løken 1992; Brewer et al. \n1999; Hirai et al. 1997; IPCC 2005; Warzinski et al. 2000). Interaction of the CO2 with \nseawater under the in-situ pressure and temperature conditions would favour CO2 hydrate \nformation, either as ‘skins’ around liquid CO2 or as more solid masses over longer times. \nAlthough the CO2 hydrate would eventually dissipate through equilibration with the seawater, \nthe slow rate of reaction and slow turnover of the deep oceans may allow the CO2 to be \nlocked up in hydrate form for timescales measurable in at least hundreds of years (e.g. Wilson \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \n1992; Herzog 1996). There are two main limitations in applying this approach. Firstly, there \nhas been much concern about the impact that large quantities of CO2 would have on marine, \nespecially benthic, organisms. Secondly, the emplacement of large quantities of waste CO2 \ninto the deep oceans is currently prohibited under the terms of international agreements, such \nas the ‘London Dumping Convention’ (IMO 1997) and ‘OSPAR Convention‘ (OSPAR 1992) \n \nOther studies have also considered confining CO2 hydrate directly to shallow sediments on \nthe deep sea floor (e.g. IEA GHG 2004). This approach involves trapping CO2 in pure hydrate \nform, transporting the CO2 hydrate as large blocks on board ships, and then releasing them to \nfall to the deep sea floor, and possibly even into soft sediments. Again, this approach would \nnot be permissible under the above international conventions. \n \nThese approaches involve storage of CO2 hydrate on the ocean floor or within the top few \nmetres of sediment. One consequence of this is a high potential that dissolution of CO2 into \nthe bottom waters will reduce seawater pH and adversely impact the marine ecosystem. Such \nimpacts could be avoided if the CO2 were stored in a stable form with minimum risk of \nrelease to the ocean floor. One possible approach would be to create CO2 hydrate deeper \nwithin the sediment, far below the few 10s of cm of bioturbated sediment, and at a depth \nwhere it would not affect marine organisms. Indeed, the presence of significant accumulations \nof CH4 hydrate in such sediments testifies to its potential as a long-term store of gas trapped \nin hydrate form.  \n \n \nTrapping CO2 as a hydrate phase during methane extraction \n \nOne way to help offset the costs of CO2 storage in sediments would be to combine it with the \nrecovery of hydrocarbons. In the case of hydrates, several studies have investigated the use of \ninjected CO2 to liberate methane gas (CH4) from hydrate in sediments, and in the process lock \nup CO2 in CO2 hydrate (e.g. IEA GHG 2000a,b; Nakano 1998). The methane gas could then \nbe captured and marketed. Although initially attractive, this approach has some potential \nproblems, notably the distributed nature of methane hydrate in marine sediments and the costs \nof working offshore may make this approach overly expensive. Although sub-permafrost \nhydrates may be less costly in terms of drilling compared to those below the seabed, the \ngenerally remote location of most permafrost areas may mean they are further away from \nlarge sources of CO2, and hence CO2 transportation or pipeline costs would be higher. Finally, \nthe injected CO2 and liberated methane would mingle within the sediment, and thus a mixed \ngas could be produced at the production well. This could necessitate expensive separation \nequipment to get the methane to saleable quality. \n \n \nDirect trapping of CO2 as a hydrate phase within sediments \n \nApplications of CO2 hydrate storage involve the direct geological disposal of CO2, and two \ndifferent scenarios can be envisaged: \n1. As a secondary chemical containment mechanism, resulting from the (unintended) \nupward migration of CO2 from a deep, warm storage reservoir (i.e. escape from a deep \nstore of supercritical CO2); \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \n2. As a primary containment mechanism, where CO2 hydrate forms an impermeable \n‘cap’ over a larger quantity of liquid CO2.  \n \nFirstly, secondary chemical containment provides a backup trapping mechanism, should \ndeeper barriers be breached and effectively building ‘redundancy’ into the storage scheme. As \nmentioned earlier, the deep storage of CO2 involves injection into warm rocks that are at least \n800 m deep. Although detailed geological characterisation of deep storage facilities would be \ncarried out, it is always possible that some CO2 may migrate upwards at some time. This \ncould occur along unidentified small faults\/fractures below the resolution of geophysical \nimaging, or along poorly sealed boreholes. If the CO2 store lay below a deep enough and cold \nenough body of water, or below a region of thick permafrost, then upward-migrating CO2 \ncould enter a zone of CO2 hydrate stability within the sediments. The formation of CO2 \nhydrate could then enhance any natural low permeability caprock, slowing the ascent of CO2, \nor even possibly blocking flow pathways (such as can happen when methane hydrate \ncompletely blocks pipelines). \n \nOther studies have suggested that CO2 hydrate may also be able to form locally, within \nsediments seemingly too warm to form hydrate. A preliminary study by Pruess (2003) \nmodelled what would happen if liquid CO2, rising along a flow pathway, started to boil off as \nit depressurised. The latent heat of vapourisation required to boil off the CO2 would cool the \nsurrounding rocks, possibly to the point at which CO2 hydrate, or even ice, would form. As a \nresult, flow pathways could be reduced or even blocked. In the Pruess (2003) model, a cool \nzone several hundreds of metres thick was predicted to form, which could slow the ascent of \nthe CO2 and cause it to spread out laterally. Pruess (2003) also notes however, that the \npreliminary model was somewhat idealised, and needs to be improved by containing more \nrealistic geological structures. \n \nSecondly, using CO2 hydrate as a primary containment mechanism for stored CO2 has been \nconsidered in several studies (e.g. IEA GHG 2000a; Koide et al. 1997; Sasaki & Akibavashi \n2000; Someya et al. 2006). This approach involves injecting (usually liquid) CO2 into deep-\nwater sediments or sub-permafrost sediments just below the CO2 hydrate stability zone. As \nthe slightly buoyant liquid CO2 rises, it would enter cooler rocks lying within the hydrate \nstability zone. The precipitation of significant amounts of CO2 hydrate within pore spaces \ncould impede further upward migration of CO2. On a larger-scale, the liquid CO2 would \nspread out forming a ‘pool’ capped with an impermeable layer of CO2 hydrate (Fig. 2) \n(together with any pre-existing natural low permeability caprock). \n \nAny liquid CO2 able to find a way through the cap of CO2 hydrate or natural caprock would \nitself react to form CO2 hydrate as long as it encountered water-rich sediment. With a \nsufficiently thick hydrate stability zone therefore, the hydrate cap would have a capacity to \nself-seal, building redundancy into the storage scheme. For CO2, this self-sealing would be \nfacilitated by the ability of CO2 hydrate to form relatively rapidly (probably faster than for \nmethane hydrate) under appropriate conditions (e.g. Brewer et al. 1999; Riestenberg et al. \n2004; Sakai et al. 1990; Someya et al. 2006). However, this may not be immediately adjacent \nto the hydrate cap, previous studies have found methane transport along fractures through the \nlower parts of the hydrate stability zone (Gorman et al. 2002), for example. These fractures \nwere hydrate-lined and prevented water reacting with the methane, though they could not be \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \nmaintained in the shallower, more plastic sediments, and gas migration was stopped here due \nto more extensive hydrate formation. \n \n \nCO2 hydrate stability within sediments \n \nWhether CO2 hydrate acted as a primary or secondary trapping phase (or even its formation \nduring the liberation of methane from CH4 hydrate), it is necessary to know over what \nconditions\/depths CO2 hydrate is stable and how CO2 hydrate forms within sediments. The \nformer is important for large-scale predictions to identify suitable regions with potential for \nCO2 storage - assuming the underlying geology is suitable. Indeed, the IEA Greenhouse Gas \nR&D Programme has already identified the need for such work (IEA GHG 2000a). Large-\nscale predictions will also be necessary to identify regions where methane hydrate may also \nbe stable (e.g. on one hand so as not to ‘pollute’ an exploitable CH4 hydrate resource, or on \nthe other hand, to explore areas for possible liberation of methane from CH4 hydrate during \nCO2 hydrate formation). \n \n \nMapping hydrate stability zones – the large scale \n \nIn an attempt to address the issue of where CO2 hydrate may be stable on a regional scale, a \npreliminary theoretical study has been undertaken to estimate CO2 (and CH4) hydrate stability \nzones for sediments offshore western Europe (Rochelle & Camps 2006; Camps 2007). As a \nbasis for the calculations, an empirical relationship between pure methane and pure water was \nused. This was presented in the JOIDES Pollution Prevention and Safety Panel report \n(JOIDES, 1992), where the equilibrium is described by the equation: \n \n ln P = A-B\/T [1] \n \nwhere A and B = constants determined by experimental hydrate stability data. \n \nUsing this relationship an algorithm was developed to enable calculation of CO2 and CH4 \nhydrate stability zones. An appropriate temperature reduction was included to account for the \nchanges in equilibrium conditions due to the presence of seawater (salinity reducing hydrate \nstability). Constants were determined from data constructed using CSMHYD (Sloan, 1998), \nwhich calculates hydrate equilibrium formation conditions. \n \nFor each location (latitude and longitude), the program uses input of water depth (i.e. \npressure), bottom water temperature and geothermal gradient. GEBCO global bathymetry \ndata sets have been used to provide detailed bathymetry for offshore Europe (IOC et al. \n2003). To determine bottom water temperatures CTD cast temperature data have been \ngathered from various sources, including ICES (the International Council for the Exploration \nof the Sea), BODC, the Coriolis Data Service, and IOS reports [e.g. Read et al. 1991, \nSaunders & Cooper, 1987]). Within the model, water depths are relatively well-constrained, \nand based upon high resolution, detailed datasets. Less information is available on bottom \nwater temperatures, and the largest area of uncertainty is the resolution of geothermal gradient \ndata because the available information is limited. A value of 30°C\/km was used in the model, \nbut it is acknowledged that in reality, certain areas may have higher or lower geothermal \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \ngradients, and this would affect predicted hydrate stability, particularly at a local scale (see \nCamps et al. this volume). For example, a higher geothermal gradient would result in a \nthinner hydrate stability zone (and vice versa). For the data shown in Fig. 3 an increase in \ntemperature of 1°C results in a decrease in CO2 hydrate stability zone thickness of about 35-\n40 m. \n \nThe calculated CO2 (and CH4) hydrate stability zones were plotted using the contouring \npackage SURFER and output as maps of hydrate thickness (Fig. 3). Calculations predict that \nCO2 hydrate will be stable over large regions, with the base of the CO2 hydrate stability zone \nreaching a depth of up to about 450 m below the ocean floor. Given that the distribution of the \nhydrate stability zone shown in Fig. 3 is largely controlled by the position of the continental \nslope, and given the scale of the map, the uncertainty over geothermal gradients mainly \ncontrols the thickness of the CO2 hydrate zone rather than its spatial distribution. \nNevertheless, the preliminary model does indicate that there is potential for the formation of a \nthick cap of CO2 hydrate above a store of liquid CO2. \n \nThe information in Fig. 3 is also useful when considering the most appropriate locations for \nthis type of storage methodology. For example, the relatively shallow seas around most of the \nUK preclude the formation of CO2 hydrate in near-shore sediments (for all but the very NW \nof Scotland). As a consequence, this approach would necessitate considerable investment in \npipelines to enable access to the deep cold sediments necessary for this type of storage. \nConversely, Portugal, northern Spain, SW France and parts of Norway, show greater potential \nwhere relatively deep waters lie close to shore. Although this does not identify whether \nsuitable geological structures exist in these regions (or for that matter, whether large point \nsources of CO2 exist close to these coastal regions), it can illustrate this approach to both \nindustry and environmental policy makers this approach, and whether it is worthwhile \nconsidering for inclusion in their portfolio of possible CO2 management and mitigation \nstrategies. \n \n \nHydrate within pore spaces – the small scale \n \nAssuming porous sediments of suitable extent exist within the CO2 hydrate stability zone, \nthere is a need to know what impact CO2 hydrate formation will have on the sediments and \nwhich sediments are most suitable. This might include whether hydrate will form in the centre \nof pores or on grain surfaces, whether it will cement grains together and make the sediment \nstronger, and\/or whether precipitation will create an effective impermeable barrier to upward \nCO2 migration. It will also be important to consider whether the origin of the CO2 influences \nhydrate precipitation. For example, there may be differences in the nature of the hydrate when \nformed purely from dissolved CO2 (i.e. in water-saturated rock adjacent to any CO2 ‘pool’), \ncompared to that formed from within the CO2-rich phase (i.e. within the CO2 ‘pool’). \n \nLaboratory-based studies can provide useful insights into processes controlling the above, but \nalthough there have been various studies on CO2 hydrate, very few of them bring together the \nsediments, water of appropriate salinity, and conditions appropriate to geological storage. As \npart of this study, CO2 hydrate has been formed within synthetic sandy sediments under both \nseawater-saturated and seawater poor conditions (Camps 2007). These reflect the conditions \nwhich may exist adjacent to, and within an underground store of CO2. Damp sediments were \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \nused to represent CO2-dominated conditions within the main storage region - it being assumed \nthat most water would have been displaced from the pores except for a thin film on the grain \nsurfaces. This provided an open pore network for CO2 ingress. As a consequence of thin water \nfilms and of easy CO2 ingress, hydrate formation was rapid and widespread throughout the \nsediment sample. The CO2 hydrate replaced the water film completely and cemented the \ngrains together (Fig. 4). In some pores larger hydrate crystals formed, reaching sizes of about \n100 µm. Other parts of the pores remained open, and it is possible that CO2 could still migrate \nthrough the sample – albeit in a restricted manner. The limiting factor for hydrate growth \nappears to have been the availability of water, which was all converted to hydrate (cf Gorman \net al. 2002). An interesting consequence of this was halite precipitation (Camps 2007; Camps \net al. this volume), which previous workers have predicted may form during hydrate growth \nin areas of restricted water availability (Harrison et al. 1995; Lorenz & Müller 2003). \n \nSediments saturated with water were used to represent conditions adjacent to the main storage \narea – it being assumed that CO2 would either diffuse into the surrounding water, or CO2-\nsaturated porewater would migrate away from the CO2-water interface. In the experiments \nonly the upper part of the wet sediment was in contact with the CO2. At the CO2-water \ninterface precipitation of CO2 hydrate was rapid, and some evidence of halite precipitation \nwas again observed (Camps 2007). Further into the sediment, though still relatively close to \nthe CO2-water interface (in these experiments a few mm), hydrate filled all the intergranular \npore space and cemented sediment grains together. The formation of this hydrate appears to \nhave greatly reduced the transport of CO2 into the rest of the sediment, leaving the majority of \nthe remaining sediment uncemented. However, observations of the zone between the \ncemented and uncemented sediment (both visual and by SEM) suggest that hydrate tends to \nbe restricted to the centres of pore spaces. \n \nCementation of sediment grains by CO2 hydrate is advantageous for underground CO2 storage \nbecause: \n1. It traps stored CO2 as a solid phase; \n2. It makes the sediment more stable; this could be particularly important given the \nsediments are expected to be relatively poorly consolidated; \n3. CO2 migration through the sediments is reduced or, with sufficient hydrate formation, \npossibly even stopped. \nThe latter point is particularly important as it relates to the thickness of the hydrate ‘cap’ \nneeded to contain a ‘pool’ of stored CO2. In several of our simple laboratory experiments it \nwas found that only a very thin (approximately 2 mm) hydrate layer was enough to restrict \nCO2-water reaction and prevent further hydrate formation (at least over timescales of days-\nweeks). Similar observations have been made by other workers, who studied the release of \nliquid CO2 into the deep ocean (e.g. Aya et al. 2000). More relevant however, are \nobservations from complex laboratory experiments, which show that a relatively thin layer of \nrapidly-formed CO2 hydrate is capable of withstanding a significant differential pressure \nacross it (Someya et al. 2006). Although more work is needed to ascertain the effects of other \nfactors (such as hydrate strength, salinity, sediment mineralogy etc), the information currently \navailable seems to suggest that a relatively thin ‘cap’ of CO2 hydrate may be perfectly able to \nprevent a slightly buoyant ‘pool’ of stored liquid CO2 from rising. \n \n \nOther CO2 trapping mechanisms operating near the hydrate stability zone \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \n \nCO2 hydrate will not be the only trapping mechanism for stored CO2. In order to ascertain the \noverall potential for CO2 storage it is important to consider the other mechanisms that will \noperate within, or close to the CO2 hydrate stability zone. \n \n \nDensity and viscosity \n \nMost of the schemes currently being considered for underground CO2 storage involve in-situ \nconditions above the critical point of CO2 (i.e. >31.1°C, >73.8 bar), where a supercritical \nphase is stable (Fig. 1). The density of this supercritical phase will vary with temperature and \npressure, but may typically be of the order of 700 kg m-3. As a consequence, a low \npermeability caprock (e.g. shale or evaporite) is needed to prevent the buoyant CO2 rising \ntowards the surface. \n \nWithin deep-water sediments or below permafrost regions, pressures may be as equally high \nas in a deep aquifer storage system, but temperatures may be much lower. Under these \nconditions the stable phase of CO2 is likely to be a liquid, which is likely to have a higher \ndensity than that of supercritical CO2 (e.g. Sasaki & Akibayashi 2000) (see Fig. 5). For \nexample, at 10 MPa [100 bar] warm CO2 at 30°C occupies more pore space than does cool \nCO2 at 10°C (in this case by about 20%). Thus, for similarly sized reservoirs, significantly \ngreater quantities of CO2 could be stored under cooler conditions. \n \nThere are other benefits from cool storage. As well as requiring less volume for storing the \nsame weight of CO2, the increased density would reduce buoyancy forces driving vertical \nmigration. This could mean that a thinner caprock may be sufficient to contain the stored CO2. \nCooler temperatures would also increase the viscosity of CO2. For example, at a pressure of \n10 MPa [100 bar], data in Vesovic et al. (1990) indicate that CO2 viscosity at 30°C is \napproximately 70 µPa s-1, but at 10°C this increases to approximately 110 µPa s-1 (an increase \nof nearly 60%). As a consequence, vertical migration of cool CO2 is likely to be slower than \nwarm CO2. Both increased density and increased viscosity are advantageous, in reducing the \npotential for CO2 to escape. \n \n \nSolubility \n \nCompared to many other gases, CO2 is relatively soluble in water, and its dissolution into \nformation porewater will occur once it is injected underground. Indeed, previous studies have \nshown a significant amount (>10%) of stored CO2 can be trapped as a dissolved phase over \nintermediate timescales (e.g. Johnson et al. 2001, 2004; Wilson & Monea 2004). Once \ndissolved, the CO2 will no longer be subject to the same buoyancy-driven upward migration \nas supercritical CO2. Consequently, enhancing the amount of dissolved CO2 will aid long-\nterm storage. \n \nCO2 solubility increases with decreasing temperature up to the point where CO2 hydrate is \nstable (Fig. 6). Therefore, porewaters adjacent to areas of CO2 hydrate formation (i.e. just \noutside the hydrate stability zone) may also be able to store significant amounts of CO2. For \nexample, for seawater salinities and 10 MPa [100 bar] pressure, the solubility of CO2 is \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \napproximately 25% greater at about 10°C compared to that at 30°C. In general terms \ntherefore, given that liquid CO2 is stable at temperatures below that of supercritical CO2, the \nstorage of liquid CO2 favours solubility trapping (and at sufficiently low temperatures, \nmineral trapping as a hydrate). Consequently, it appears to offer some benefits in terms of \nlong-term containment. \n \nCO2 solubility is however, also controlled by ionic strength (salinity), pressure and pH. It \ndecreases with increasing ionic strength, increases with increasing pressure, and increases \nwith increasing pH. Overall CO2 solubility is also controlled by the pH of the groundwater \nthrough linked equilibria such as: \n \n CO2 (aq) + H2O  ⇔   CO2 (aq)+ H2O  ⇔   H2CO3°  ⇔   HCO3- + H+ [2] \n \nAs a consequence, mineral assemblages that allow fluid-rock reactions to buffer pH at higher \nvalues will facilitate higher CO2 solubility (Gunter et al. [1993] and Rochelle et al. [2004]). \nAssessment of the amount of CO2 held in dissolved form therefore needs to be made on an \nindividual site-by-site basis using appropriate in-situ temperature, pressure and fluid \ncompositions. \n \nThere is one final advantage to dissolved CO2. Formation water enriched in CO2 is denser \nthan its CO2-free equivalent. It is possible, therefore (given a thick enough reservoir rock), \nthat ‘plumes’ of CO2-rich water may descend slowly from the CO2-water interfaces of a \nstorage scheme. This process facilitates further CO2 dissolution through increased CO2-water \nmixing. It also makes the trapped CO2 descend further underground, as opposed to ascending \nas would occur if CO2 were in its buoyant free-phase. \n \n \nMineral trapping \n \nAlthough CO2 hydrate is likely to form relatively rapidly at low temperatures, it is not the \nonly solid phase, which may form. CO2-water-rock reactions may also produce a variety of \nsecondary carbonate minerals that would enhance mineral trapping (e.g. Bachu et al. 1994; \nBaker et al. 1995; Gunter et al. 1993, 1997; Harrison et al. 1995; Rochelle et al. 2004). It is \nnoted however, that the rate and extent of such reactions is likely to be much slower under \ncool conditions than under warm storage conditions. Nonetheless, limited precipitation of \ncarbonate minerals could still occur under conditions close to the hydrate stability zone, \nhelping to trap CO2. For example, Gunter et al. (1997) suggested that detrital Ca-rich feldspar \nmight react to form calcite: \n \n CaAl2Si2O8 + CO2 (aq) + 2 H2O  ⇒   CaCO3 + Al2Si2O5(OH) 4 [3] \n anorthite                                        calcite         kaolinite \n \nSimilarly, Johnson et al. (2001, 2004) postulated that in saline solutions K-rich feldspar might \nreact to form a different carbonate mineral, dawsonite: \n \n KAlSi3O8 + Na+ + CO2 (aq) + H2O  ⇒   NaAlCO3(OH) 2 + 3 SiO2 + K+ [4] \n K-feldspar                                              dawsonite           quartz\/  \n                                                                                           chalcedony\/cristobalite  \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \n \nReactions such as these are likely to be relatively slow however, and be dependent upon the \nabundance and dissolution rates of the dissolving minerals. While they enhance the appeal of \nCO2 sequestration through this approach, they are an added bonus, but may provide relatively \nlittle contribution in the short term compared to CO2 hydrate formation. \n \n \nSummary \n \nThe underground storage of CO2 is increasingly seen as a possible method for reducing \nanthropogenic emissions of this greenhouse gas to the atmosphere without necessarily \ndramatically changing our energy-producing technologies. Most of the current approaches are \naimed at storage within deep porous rocks below 800 m, where in-situ conditions of pressure \nand temperature are sufficient for injected CO2 to exist as a buoyant supercritical phase. \nThere is however, an alternative approach to underground storage – using liquid CO2 and \nassociated CO2 hydrate. This requires similarly high pressures, but would operate at lower \ntemperatures – such as might be found beneath the floors of cold, deep oceans, or permafrost \nregions. Although this concept of ‘cool storage’ has received much less attention compared to \nthat of ‘warm storage’, it does appear to offer certain advantages in terms of the mechanisms \nthat may trap the stored CO2: \n1. In terms of the free CO2 phase, liquid CO2 can have a significantly higher density \ncompared to supercritical CO2, so more of it can be stored in an equivalent volume of \nrock. Its lower buoyancy and higher viscosity would also help reduce the rate of \nvertical migration from the storage horizon; \n2. In terms of dissolved CO2, its solubility increases significantly at lower temperatures \n(up to the point where CO2 hydrate precipitates); \n3. In terms of storing CO2 as solid phases, cool conditions would allow for the \nprecipitation of CO2 hydrate as well as carbonate minerals. CO2 hydrate would be \nadvantageous as it forms rapidly, only requiring the presence of water and CO2. It \ncould form via 2 routes; intentionally – as a primary storage mechanism, or \nunintentionally – as a secondary ‘backup’ storage mechanism (e.g. as a result of \nleakage of CO2 from a deep, warm reservoir to shallower, cooler horizons). As a \nprimary storage mechanism it may form an impermeable ‘cap’ above a ‘pool’ of liquid \nCO2, enhancing the sealing properties of a natural caprock. \n \nIf CO2 hydrate is to play a role in underground storage, we need to be able to predict where it \nwill be stable on a regional scale. This has been done for offshore Western Europe and \nalthough this does not identify local geological structures suitable for CO2 storage, it does \nshow that large regions have the potential for CO2 hydrate formation in deep-water sediments. \nWe also need to know about smaller-scale processes, such as the relationship between CO2 \nhydrate and sediment grains at a pore scale, and how this influences the overall physical \nproperties of the sediment. Results from laboratory experiments show that hydrate formation \nis rapid and that it can act as a cement to the sediment grains, although its morphology may \ndiffer if grown in water-saturated or CO2-saturated conditions. Experimental results also \nindicate that even a relatively thin layer of hydrate can be effective at greatly retarding CO2 \nmigration rates. This suggests that even a relatively thin ‘cap’ of CO2 hydrate may be able to \nprevent a slightly buoyant ‘pool’ of stored liquid CO2 from rising. \n \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \nIn conclusion, there could be a role for CO2 storage under cool conditions, and CO2 hydrate \ncould have an important part to play in this. However, in assessing the overall storage \npotential of an individual storage scheme, it will be important to consider all possible trapping \nmechanisms, and not just those involving CO2 hydrate. To achieve this fully will require the \nclose co-operation of those with in-depth knowledge of both hydrate phases and underground \nCO2 storage. Much work remains to be undertaken to fully understand how CO2 hydrate can \nbest contribute to underground storage and the complex inter-relationship it may have with \nsediments. Sequestration of CO2 as hydrate could provide another technique to add to the \nportfolio of strategies that could help reduce emissions of anthropogenic CO2 to the \natmosphere. \n \n \nAmeena Camps acknowledges the Natural Environment Research Council for funding under \ngrant NER\/S\/A\/2003\/11923. Erik Lindberg is thanked for the use of the Sintef CO2 density \nmodel. Peter Miles and Mark Rodger are thanked for their useful comments that helped \nimprove this paper. This paper is published with the permission of the Executive Director of \nthe British Geological Survey (NERC). \n \n \nReferences \n \nAtkins, P. W. 1982. Physical Chemistry (2nd ed.), Oxford University Press. \n \nAustvik, T. & Løken, K. P. 1992. Deposition of CO2 on the seabed in the form of hydrates. . \nEnergy Conversion and management, 33(5-8), 659-666. \n \nAya, I., Yamane, K. & Kojima, R. 2001. Simulation experiment of CO2 storage at 3600 m \ndeep ocean floor. In (D. Williams, B. Durie, P. McMullan, C. Paulson & A. Smith eds) \n‘Proceedings of the 5th International Conference on Greenhouse Gas Control Technologies \nGHGT-5’, CSIRO Publishing, Collingwood, Australia, 423-428. \n \nBachu, S., Gunter, W. D., & Perkins, E. H. 1994. Aquifer disposal of CO2: hydrodynamic and \nmineral trapping. Energy Conversion and Management, 35, 269-279. \n \nBaines, S. J. & Worden, R. H. 2004a. Geological Storage of Carbon Dioxide. Geological \nSociety Special Publication number 233, 255p. \n \nBaines, S. J. & Worden, R. H. 2004b. The long-term fate of CO2 in the subsurface: natural \nanalogues for CO2 storage. In (S.J. Baines and R.H. Worden eds) ‘Geological Storage of \nCarbon Dioxide’, Geological Society Special Publication number 233, 59-85. \n \nBaker, J. C., Bai, G. P., Hamilton, P. J., Golding, S. D. & Keene, J. B. 1995. Continental-\nscale magmatic carbon dioxide seepage recorded by dawsonite in the Bowen-Gunnedah-\nSydney basin system, eastern Australia. Journal of Sedimentary Research, A65(3), 252-530. \n \nBaklid, A., Korbø L. R. & Owren, G. 1996. Sleipner Vest CO2 disposal, CO2 injection into a \nshallow underground aquifer. Society of Petroleum Engineers, 36600, 269-277. \n \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \nBergman, P. D., Drummond, C. J., Winter, E. M. & Chen, Z-Y. 1996. Disposal of power \nplant CO2 in depleted oil and gas reservoirs in Texas. Proceedings of the Third International \nConference on Carbon Dioxide Removal, Massachusetts Institute of Technology, Cambridge, \nMA, USA, 9-11 September 1996. \n \nBrewer, P. G., Friederich, G., Peltzer, E. T. & Orr, F. M. Jr (1999). Direct experiments on the \nocean disposal of fossil fuel CO2. Science, 284, 943-945. \n \nCamps, A. P. 2007. Hydrate formation in near surface ocean sediments. Unpublished PhD \nthesis, Leicester University. \n \nCamps, A. P., Long, D., Rochelle, C. A. & Lovell, M. A. 2009. Mapping Hydrate Stability \nZones Offshore Scotland. In: Long, D., Lovell, M. A., Rees, J. G. & Rochele, C. A. (eds) \nSediment-Hosted Gas Hydrates: New Insights on Natural and Synthetic Systems. Geological \nSociety, London, Special Publications, 319, 81–91. \n \nCzernichowski-Lauriol, I., Sanjuan, B., Rochelle, C., Bateman, K., Pearce, J. & Blackwell, P. \n1996a. Inorganic geochemistry. Chapter 7 in ‘The Underground Disposal of Carbon Dioxide’ \n(S. Holloway ed.), Final Report of Joule II Project Number CT92-0031. \n \nCzernichowski-Lauriol, I., Sanjuan, B., Rochelle, C., Bateman, K., Pearce, J. & Blackwell, P. \n1996b. Analysis of the geochemical aspects of the underground disposal of CO2. In ‘Deep \nInjection Disposal of Hazardous and Industrial Wastes, Scientific and Engineering Aspects’ \n(J.A. Apps and C.-F. Tsang eds), Academic Press, ISBN 0-12-060060-9, 565-583. \n \nEnick, R. M. & Klara, S. M. 1990. CO2 solubility in water and brine under reservoir \nconditions. Chemical Engineering Communications, 90, 23-33. \n \nFreund, P. & Ormerod, W. 1996. Progress towards storage of CO2. Proceedings of the Third \nInternational Conference on Carbon Dioxide Removal, Massachusetts Institute of \nTechnology, Cambridge, MA, USA, 9-11 September, 1996. \n \nGorman, A. R., Holbrook, W. S., Hornbach, M. J., Hackwith, K. L., Lizarralde, D. & Pecher, \nI. 2002. Migration of methane gas through the hydrate stability zone in a low-flux hydrate \nprovince. Geology, 30(4), 327-330. \n \nGunter, W. D., Perkins, E. H. & McCann, T. J. 1993. Aquifer disposal of CO2-rich gases: \nreaction design for added capacity. Energy Conversion Management, 34, 941-948. \n \nGunter, W. D., Wiwchar, B. & Perkins, E. H. 1997. Aquifer disposal of CO2-rich greenhouse \ngases: extension of the time scale of experiment for CO2-sequestering reactions by \ngeochemical modelling. Mineralogy and Petrology, 59, 121-140. \n \nHarrison, W. J., Wendlandt, R. F. & Sloan, E. D. 1995. Geochemical interactions resulting \nfrom carbon dioxide disposal on the seafloor. Applied Geochemistry, 10, 461-475. \n \nHaugen, H. A. & Eide, L. I. 1996. CO2 Capture and Disposal: The realism of large scale \nscenarios. Energy Conversion and Management, 37 (6-8), 1061-1066. \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \n \nHerzog, H. J., Adams, E. E., Auerbach, D. & Caulfield, J. 1996. Environmental impacts of \nocean disposal of CO2. Energy Conversion and Management, 37(6-8), 999-1005. \n \nHirai, S., Okazaki, K., Tabe, Y. & Hijikata, Y. 1997. Numerical simulation for dissolution of \nliquid CO2 droplets covered with clathrate film in intermediate depth of ocean. Energy \nConversion and management, 38 (supplement) S313-S318. \n \nHolloway, S. 1996a. An overview of the Joule II project ‘The Underground Disposal of \nCarbon Dioxide’, Energy Conversion and Management, 37 (6-8), 1149-1154. \n \nHolloway, S. (ed.) 1996b. The Underground Disposal of Carbon Dioxide, Final Report of \nJoulle II Project Number CT92-0031. British geological Survey, 355p, ISBN 0 85272 280 X. \n \nHolloway, S. 1997. An overview of the underground disposal of carbon dioxide. Energy \nConversion and Management, 38 (supplement) S193-S198. \n \nIEA GHG 1998. Sleipner aquifer storage of CO2. Greenhouse Issues, 34, 4. \n \nIEA GHG 2000a. Issues underlying the feasibility of storing CO2 as hydrate deposits. IEA \nGreenhouse Gas R&D Programme Report PH3\/25. \n \nIEA GHG 2000b. Natural gas and methane hydrates. IEA Greenhouse Gas R&D Programme \nReport PH3\/27. \n \nIEA GHG 2004. Gas hydrates for deep ocean storage of CO2. IEA Greenhouse Gas R&D \nProgramme Report PH4\/26. \n \nIMO 1997. Convention on the prevention of marine pollution by dumping of wastes and other \nmatter (London Convention 1972). Compilation of the full texts of the London Convention \n1972 and of the 1996 Protocol thereto. LCo2\/Circ.380, 63p, International Maritime \nOrganisation, London. \n \nIOC, IHO & BODC, 2003. Centenary Edition of the GEBCO Digital Atlas, published on CD-\nROM on behalf of the Intergovernmental Oceanographic Commission and the International \nHydrographic Organization as part of the General Bathymetric Chart of the Oceans, British \nOceanographic Data Centre, Liverpool, U.K. \n \nIPCC 1990. Scientific assessment of climate change. Working group 1 report of the \nIntergovernmental Panel on Climate Change, WNO, Geneva. World Wide Web Address: \nhttp:\/\/www.ipcc.ch\/ipccreports\/assessments-reports.htm \n \nIPCC 2005. Carbon dioxide capture and storage. Working Group 3 report of the \nIntergovernmental Panel on Climate Change (B. Metz, O. Davidson, H. de Coninck, M. Loos \n& L. Meyer eds), Cambridge University press, New York, 431p. \n \nIPCC 2007. Forth Assessment Report: Climate Change. Published by the IPCC. World Wide \nWeb Address: http:\/\/www.ipcc.ch\/ipccreports\/assessments-reports.htm \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \n \nJohnson, J. W., Nitao, J. J. & Knauss, K. G. 2004. Reactive transport modelling of CO2 \nstorage in saline aquifers to elucidate fundamental processes, trapping mechanisms and \nsequestration partitioning. In (S.J. Baines and R.H. Worden eds) ‘Geological Storage of \nCarbon Dioxide’, Geological Society Special Publication number 233, 87-106. \n \nJohnson, J. W., Nitao, J. J., Steefel, C. I. & Knauss, K. G. 2001. Reactive transport modelling \nof geologic CO2 sequestration in saline aquifers: the influence of intra-aquifer shales and the \nrelative effectiveness of structural, solubility, and mineral trapping during prograde and \nretrograde sequestration. In ‘Proceedings of the First National Conference on Carbon \nSequestration, Washington, DC, May 14-17, 2001’. \n \nJOIDES, 1992. JOIDES Pollution Prevention and Safety Panel, Ocean Drilling Program \nGuidelines for Pollution Prevention and Safety. Joides Journal 18, Special Issue No7, 24pp. \n \nKarl, T. R., Knight, R. W. & Baker, B. 2000. The record breaking global temperatures of \n1997 and 1998: evidence for an increase in the rate of global warming? Geophysical research \nletters, 27, 719-722. \n \nKing, M. B., Mubarak, A., Kim, J. D. & Bott, T. R. 1992. The mutual solubilities of water \nwith supercritical and liquid carbon dioxide. Journal of Supercritical Fluids, 5, 296-302. \n \nKoide, H., Takahashi, M., Shindo, Y., Tazaki, Y., Ijiima, M., Ito, K., Kimura, N., & Omata, \nK. 1997. Hydrate formation in sediments in the sub-seabed disposal of CO2. Energy Vol. 22, \nNo. 273, 279-283. \n \nKojima, R. Yamane, K. & Aya, I. 2003. Dual nature of CO2 solubility in hydrate forming \nregion. In: ‘Greenhouse gas Control Technologies’ (J. Gale & Y. Kaya eds), Elsevier \nScience. \n \nKuk, M. S. & Montagna, J. C. 1983. Solubility of oxygenated hydrocarbons in supercritical \ncarbon dioxide. In: ‘Chemical Engineering at Supercritical Fluid Conditions’, 101-111, Ann \nArbor Science, Ann Arbor, U.S.A. \n \nLorenz, S. & Müller, W. 2003. Modelling of halite formation in natural gas storage aquifers. \nProceedings of the ‘TOUGH Symposium 2003’, Lawrence Berkeley National Laboratory, \nBerkeley, California, May 12-14, 2003. \n \nMalik, Q. M. & Islam, M. R. 2000. CO2 injection in the Weyburn field of Canada: \nOptimization of enhanced oil recovery and greenhouse gas storage with horizontal wells. \nSociety of Petroleum Engineers, 59327, 16p. \n \nMoberg, R. 2001. The Weyburn CO2 monitoring and storage project. Greenhouse Issues, 57, \n2-3. \n \nNakano, S., Yamamoto, K. & Ohgaki, K. 1998. Natural gas exploitation by carbon dioxide \nfrom gas hydrate fields – high-pressure phase equilibrium for an ethane hydrate system. \nProceedings of the Institution of Mechanical Engineers, 212 Part A, 159-163. \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \n \nOSPAR 1992. Convention for the protection of the marine environment of the north-east \nAtlantic, 32p, OSPAR Commission, London. \n \nPearce, J., Czernichowski-Lauriol, I., Lombardi, S., Brune, S., Nador, S., Baker, J., Pauwels, \nH., Hatziyannis, G., Beaubien, S. & Faber, E. 2004. A review of natural CO2 accumulations in \nEurope as analogues for geological sequestration. In (S.J. Baines and R.H. Worden eds) \n‘Geological Storage of Carbon Dioxide’, Geological Society Special Publication number 233, \n29-41. \n \nPearce, J., Holloway, S., Wacker, H., Nelis, M. K., Rochelle, C. A. & Bateman, K. 1996. \nNatural occurrences as analogues for the geological disposal of carbon dioxide. Energy \nConversion and Management, 37, 1123-1128. \n \nPruess, K. 2003. Numerical simulation of leakage from a geologic disposal reservoir for CO2, \nwith transitions between super- and sub-critical conditions. Proceedings of the ‘TOUGH \nSymposium 2003’, Lawrence Berkeley National Laboratory, Berkeley, California, May 12-\n14, 2003. \n \nRCEP 2000. Energy – the changing climate. Twenty-second report of the Royal Commission \nOn Environmental Polution, Cm 4749, 292pp. \n \nRead, J. F., Pollard, R. T & Hirst, C. 1991. CTD data from the north east Atlantic, April 1989, \ncollected on RSS Discovery Cruse 181. Institute of Oceanographic Sciences, Deacon \nLaboratory, Report no. 285, 157pp. \n \nRiestenberg, D., Chiu, E., Gborigi, M., Liang, L., West, O. R. & Tsouris, C. 2004. \nInvestigation of jet breakup and droplet size distribution of liquid CO2 and water systems – \nimplications for CO2 hydrate formation for ocean carbon sequestration. American \nMineralogist, 89, 1240-1246. \n \nRochelle, C. & Camps, A. 2006. Underground storage of CO2 as a liquid and solid hydrate. \nGreenhouse Issues, 82, 8-9. \n \nRochelle, C. A., Czernichowski-Lauriol, I. & Milodowski, A. E. 2004. The impact of \nchemical reactions on CO2 storage in geological formations, a brief review. In (S.J. Baines \nand R.H. Worden eds) ‘Geological Storage of Carbon Dioxide’, Geological Society Special \nPublication No. 233, 87-106. \n \nRochelle, C. A., Pearce, J. M. & Holloway, S. 1999. The underground sequestration of carbon \ndioxide: containment by chemical reactions. In ‘Chemical Containment of Waste in the \nGeosphere’, Geological Society Special Publication No. 157, 117-129. \n \nSakai, H., Gamo, T., Kim, E.-S., Tsutsumi, M., Tanaka, T., Ishibashi, J., Wakita, H., Yamano, \nM. & Oomori, T. 1990. Venting of carbon dioxide-rich fluid and hydrate formation in mid-\nOkinawa trough backarc basin. Science, 248, 1093-1096. \n \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \nSasaki, K. & Akibayashi, S. 2000. A calculation model for liquid CO2 injection into shallow \nsub-seabed aquifer. In ‘Gas Hydrates, challenges for the future’ (G.D. Holder & P.R. Bishnoi \neds), Annals of the New York Academy of Sciences, Volume 912, 211-225. \n \nSaunders, P. M. & Cooper, S. 1987. CTD data on the Iberian Abyssal Plain. Institute of \nOceanographic Sciences, Deacon Laboratory, Report no. 247, 70pp. \n \nSloan, E. D. Jr. 1998. Clathrate Hydrates of Natural Gases. Marcell Dekker Inc, 359pp. \n \nSomeya, S., Saito, K., Nishio, M. & Tsutsui, K. 2006. CO2 sequestration under a sealed layer \nwith clathrate hydrate in sediments. Proceedings of ‘Sediment-hosted gas hydrates: New \ninsights on natural and synthetic systems’, 25-26 January 2006, London, p 34, Geological \nSociety. \n \nStudlick, J. R. J., Shew, R. D., Basye, G. L. & Ray, J. R. 1990. A giant carbon dioxide \naccumulation in the Norphlet Formation, Pisgah Anticline, Mississippi. In: ‘Sandstone \nPetroleum Reservoirs’, Barwis, J. H., McPherson, J. G. & Studlick, J. R. J. eds, 181-203, \nSpringer Verlag, New York. \n \nVesovic, V., Wakeham, W. A., Olchowy, G. A., Sengers, J. V., Watson, J. T. R. & Millat, J. \n1990. The transport properties of carbon dioxide. Journal of Physics and Chemistry \nRefference Data, 19(3), 763-808. \n \nWarzinski, R. P., Lynn, R. J. & Holder, G. D. 2000. The impact of CO2 clathrate hydrate on \ndeep ocean sequestration of CO2 – Experimental observations and modeling results. In ‘Gas \nHydrates, challenges for the future’ (G. D. Holder and P. R. Bishnoi eds), Annals of the New \nYork Academy of Sciences, Volume 912, 226-234. \n \nWiebe, R. 1941. The binary system carbon dioxide-water under pressure. Chemical Reviews, \n29, 475-481. \n \nWiebe, R. & Gaddy, V. L. 1939. The solubility in water of carbon dioxide at 50, 75 and 100°, \nat pressures to 700 atmospheres. Journal of the American Chemical Society, 61, 315-318. \n \nWiebe, R. & Gaddy, V. L. 1940. The solubility of carbon dioxide in water at various \ntemperatures from 12 to 40° and at pressures to 500 atmospheres. Critical phenomena. \nJournal of the American Chemical Society, 62, 815-817. \n \nWilson, M. & Monea, M. (eds) 2004. IEA GHG Weyburn CO2 Monitoring & Storage project \nSummary Report 2000-2004. Volume 3 of the proceedings of the ‘7th International \nConference on Greenhouse Gas Control Technologies’, September 5-9, 2004, Vancouver, \nCanada, Petroleum Technology Research Centre, Regina, 273p. \n \nWilson, T. R. S. 1992. The deep ocean disposal of carbon dioxide. Energy Conversion and \nManagement, 33(5-8), 627-633. \n \nZheng, L., Wang, S., Liao, Y. & Feng, Z. 2001. CO2 gas pools in Jiyang sag, China. Applied \nGeochemistry, 16, 1033-1039. \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \nFig. 1. CO2 phase diagram (modified after Atkins 1982). \n \nFig. 2. Schematic diagram showing the relative position of injected liquid CO2 and \nassociated ‘cap’ of CO2 hydrate. \n \nFig. 3. Map of predicted thickness (m) of the CO2 hydrate stability zone within seabed \nsediments for offshore Western Europe. Note that the Mediterranean Sea is not \ncovered by this study. \n \nFig. 4. Cryogenic SEM photomicrograph of sand grains (light grey) coated with a film of \nCO2 hydrate (dark grey) that has been partly removed from the grains in places. \nNote larger crystals of CO2 hydrate in the larger pore spaces – a good example is \njust to the right of the centre of the image. (Experiment using sand and synthetic \nseawater). \n \nFig. 5. Variation in CO2 density over a range of temperatures, for an assumed hydrostatic \nhead of 1 km (10 MPa) (prepared using a density model courtesy of Sintef). CO2 \ndensity is about 20% greater at 10°C compared to 30°C. \n \nFig. 6. Variation in CO2 solubility over a range of temperatures, for an assumed hydrostatic \nhead of 1 km (10 MPa) and for seawater-like salinities (prepared using data from \nEnick & Klara 1990; King et al. 1992; Kojima et al. 2003; Kuk & Montagna, 1983; \nWiebe 1941; Wiebe & Gaddy 1939, 1940). \n \n \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \nTemperature (°C)\n-56.4°C 25.0°C 31.1°C\n73.7\n67.9\n5.2\n1.0\n-78.5°C\nPressure\n(bar)\nSolid Liquid\nGas\nCritical\npoint\nTriple\npoint\nSupercritical\nfluid\n \n \nFig. 1. CO2 phase diagram (modified after Atkins 1982). \n \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \n \n \nFig. 2. Schematic diagram showing the relative position of injected liquid CO2 and \nassociated ‘cap’ of CO2 hydrate. \n \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \n \n \nFig. 3. Map of predicted thickness (m) of the CO2 hydrate stability zone within seabed \nsediments for offshore Western Europe. Note that the Mediterranean Sea is not \ncovered by this study. \n \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \n \n \nFig. 4. Cryogenic SEM photomicrograph of sand grains (light grey) coated with a film of \nCO2 hydrate (dark grey) that has been partly removed from the grains in places. \nNote larger crystals of CO2 hydrate in the larger pore spaces – a good example is \njust to the right of the centre of the image. (Experiment using sand and synthetic \nseawater). \n \n \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \n \n \nFig. 5. Variation in CO2 density over a range of temperatures, for an assumed hydrostatic \nhead of 1 km (10 MPa) (prepared using a density model courtesy of Sintef). CO2 \ndensity is about 20% greater at 10°C compared to 30°C. \n \n \n \nCO2 HYDRATE AND UNDERGROUND STORAGE \n \n \n \n \n \n \n \nFig. 6. Variation in CO2 solubility over a range of temperatures, for an assumed hydrostatic \nhead of 1 km (10 MPa) and for seawater-like salinities (prepared using data from \nEnick & Klara 1990; King et al. 1992; Kojima et al. 2003; Kuk & Montagna 1983; \nWiebe 1941; Wiebe & Gaddy 1939, 1940). \n \n \n \n"}