{"doi":"10.1108\/20428301111140912","coreId":"220183","oai":"oai:eprints.lse.ac.uk:37529","identifiers":["oai:eprints.lse.ac.uk:37529","10.1108\/20428301111140912"],"title":"Mental health care clusters and payment by results: considerations for social inclusion and recovery","authors":["Clark, Michael"],"enrichments":{"references":[{"id":17291433,"title":"Department of Health","authors":[],"date":"2010","doi":null,"raw":"London: DH Department of Health (2010) Mental Health Care Clustering Booklet 2010\/11.","cites":null},{"id":17291434,"title":"Policy Watch. Mental Health and Social Inclusion.","authors":[],"date":"2010","doi":"10.5042\/mhsi.2010.0234","raw":"London: DH Lawton-Smith S (2010) Policy Watch.  Mental Health and Social Inclusion.  14(4): 3-6 Self R, Rigby A, Leggett C and Paxton R (2008) Clinical Decision Support Tool: A rational needs-based approach to making clinical decisions.  Journal of Mental Health, 17(1): 33-48.","cites":null},{"id":17291432,"title":"The National Service Framework for Mental Health: modern standards and service models.","authors":[],"date":"1999","doi":"10.1037\/e616522007-001","raw":"Department of Health (DH) (1999) The National Service Framework for Mental Health: modern standards and service models.  London: DH Department of Health (2010) Equity and Excellence.  Liberating the NHS.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-01","abstract":"Purpose - This paper aims to critically examine the emerging policy agenda of payment by results (PbR) and care clusters in order to identify how to engage with it to ensure it is supportive of social inclusion and recovery. Design\/methodology\/approach - Care clusters and PbR for mental health care are critically examined. Findings - There is scope in the ongoing development of care clusters and associated pathways to continue the progressive developments towards recovery and social inclusion in the commissioning and delivery of mental health care, but they need to be nurtured and actively pursued. Practical implications - The care clusters and developments building on them provide scope for supporting social inclusion and recovery practice, but also some risks; hence, those with an interest in furthering such practice need to engage now locally and nationally with care clusters developments. Originality\/value - PbR is being pursued as a policy for commissioning mental health care in England, based on a model of care clusters. This paper discusses the move to PbR and its possible implications for the recovery and social inclusion agenda","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/220183.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/37529\/1\/Mental_health_care_clusters_and_payment_by_results%28lsero%29.pdf","pdfHashValue":"829f277796c4f81c6d67ee04c1b1abb5c85350cc","publisher":"Pier Professional","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:37529<\/identifier><datestamp>\n      2012-02-23T11:27:41Z<\/datestamp><setSpec>\n      74797065733D43454E54524553:4C53455F52435F4E53534352<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/37529\/<\/dc:relation><dc:title>\n        Mental health care clusters and payment by results: considerations for social inclusion and recovery<\/dc:title><dc:creator>\n        Clark, Michael<\/dc:creator><dc:subject>\n        HV Social pathology. Social and public welfare. Criminology<\/dc:subject><dc:subject>\n        RA Public aspects of medicine<\/dc:subject><dc:description>\n        Purpose - This paper aims to critically examine the emerging policy agenda of payment by results (PbR) and care clusters in order to identify how to engage with it to ensure it is supportive of social inclusion and recovery. Design\/methodology\/approach - Care clusters and PbR for mental health care are critically examined. Findings - There is scope in the ongoing development of care clusters and associated pathways to continue the progressive developments towards recovery and social inclusion in the commissioning and delivery of mental health care, but they need to be nurtured and actively pursued. Practical implications - The care clusters and developments building on them provide scope for supporting social inclusion and recovery practice, but also some risks; hence, those with an interest in furthering such practice need to engage now locally and nationally with care clusters developments. Originality\/value - PbR is being pursued as a policy for commissioning mental health care in England, based on a model of care clusters. This paper discusses the move to PbR and its possible implications for the recovery and social inclusion agenda.<\/dc:description><dc:publisher>\n        Pier Professional<\/dc:publisher><dc:date>\n        2011-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/37529\/1\/Mental_health_care_clusters_and_payment_by_results%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Clark, Michael  (2011) Mental health care clusters and payment by results: considerations for social inclusion and recovery.  Mental Health and Social Inclusion, 15 (2).  pp. 71-77.  ISSN 2042-8316     <\/dc:identifier><dc:relation>\n        http:\/\/www.pierprofessional.com\/mhsiflyer\/<\/dc:relation><dc:relation>\n        10.1108\/20428301111140912<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/37529\/","http:\/\/www.pierprofessional.com\/mhsiflyer\/","10.1108\/20428301111140912"],"year":2011,"topics":["HV Social pathology. Social and public welfare. Criminology","RA Public aspects of medicine"],"subject":["Article","PeerReviewed"],"fullText":"  \nMichael Clark \nMental health care clusters and payment by \nresults: considerations for social inclusion \nand recovery \n \n Article (Accepted version) \n(Refereed) \n \n \nOriginal citation: \nClark, Michael (2011) Mental health care clusters and payment by results: considerations for \nsocial inclusion and recovery. Mental Health and Social Inclusion, 15 (2). pp. 71-77. ISSN 2042-\n8316 \nDOI: 10.1108\/20428301111140912 \n \n© 2011 Pier Professional Limited \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/327529\/ \nAvailable in LSE Research Online: Feb 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \n \nMental health care clusters and payment by results: considerations for \nsocial inclusion and recovery By Michael Clark  \nAbstract: Recovery and social inclusion ideas and practices have evolved and become widely embedded in mental health care in England over the last decade.  These progressive developments need to be nurtured and actively pursued by ensuring that future developments impinging on how mental health care is commissioned and delivered explicitly support them.  Payment by Results is being pursued as a policy for commissioning mental health care in England, based on a model of care clusters.  These clusters provide some scope for supporting social inclusion and recovery practice, but also some risks.  This paper critically examines this emerging policy agenda to identify how we can engage with it to ensure it is supportive of social inclusion and recovery.  \nIntroduction: After 10 years of the National Service Framework for Mental Health (Department of Health, 1999) and subsequent policy developments, those connected with mental health care in England have become acclimatised to progressive developments for social inclusion and recovery for people who have experienced mental health problems.  We should be mindful of how these ideas were evolved, took root and informed service and practice development in mental health care in England, and of how this had to be actively developed.  These improvements were not a natural phenomenon and we should not expect them to remain static – they may develop forwards or backwards. With the change in government following the May 2010 election, we are in a state of flux and uncertain policy direction.  This includes the White Paper \nLiberating the NHS (DH 2010) with its proposals for profound restructuring of the NHS.  A new mental health policy is said to be imminent, but will land in the middle of this massive structural reform of the NHS, as well as a period of financial retrenchment. Obviously, it is hoped the improvements towards recovery and social inclusion can continue to flourish in this new world, but we have to be very conscious of the challenges.  Progress is more likely if people actively work on emerging policies to build on them to strengthen the cause of inclusion and recovery.  We should not underestimate the need to continue to vigorously pursue this agenda, as there are potential risks in the opposite direction from the economic climate and loss of progressive direction during the major system reform of the NHS. A significant continuity throughout this transition between governments has been the national commitment to move to a model of Payment by Results (PbR) \nin mental health care.  This paper discusses the move to PbR and its possible implications for the recovery and social inclusion agenda.  \nCare clusters and Payment by Results for mental health care: A consortium of mental health care providers in the North East of England developed a model of care clusters (see Self et al 2008).  This model encompasses descriptions of groupings of people needing mental health support based on them having similar needs.  The model moves away from purely diagnostic descriptions of people (though not wholly) to one of broadly described needs (see figure 1 below).  There are three super clusters of these groupings, namely non-psychotic (clusters 1-8), psychotic (clusters 10-17) and organic (clusters 18-21).   \n \nFigure 1:  The mental health care clusters  \nCARE CLUSTER 1:  Common Mental Health Problems (Low Severity) This group has definite but minor problems of depressed mood, anxiety or other disorder but they do not present with any distressing psychotic symptoms.  \nCARE CLUSTER 2:  Common Mental Health Problems (Low Severity with greater need) This group has definite but minor problems of depressed mood, anxiety or other disorder but not with any distressing psychotic symptoms.  They may have already received care associated with cluster 1 and require more specific intervention or previously been successfully treated at a higher level but are re-presenting with low level symptoms.  \nCARE CLUSTER 3:  Non Psychotic (Moderate Severity) Moderate problems involving depressed mood, anxiety or other disorder (not including psychosis). \nCARE CLUSTER 4:  Non-psychotic (Severe)  This group is characterised by severe depression and\/or anxiety and\/or other increasing complexity of needs.  They may experience disruption to function in everyday life and there is an increasing likelihood of significant risks.  \nCARE CLUSTER 5:  Non-psychotic Disorders (Very Severe)   This group will be severely depressed and\/or anxious and\/or other.  They will not present with distressing hallucinations or delusions but may have some unreasonable beliefs.  They may often be at high risk for suicide and they may present safeguarding issues and have severe disruption to everyday living.   \nCARE CLUSTER 6:  Non-psychotic Disorder of Over-valued Ideas Moderate to very severe disorders that are difficult to treat.  This may include treatment resistant eating disorder, OCD etc, where extreme beliefs are strongly held, some personality disorders and enduring depression.  \nCARE CLUSTER 7:  Enduring Non-psychotic Disorders (High Disability)  This group suffers from moderate to severe disorders that are very disabling.  They will have received treatment for a number of years and although they may have improvement in positive symptoms considerable disability remains that is likely to affect role functioning in many ways.  \nCARE CLUSTER 8:  Non-Psychotic Chaotic and Challenging Disorders This group will have a wide range of symptoms and chaotic and challenging lifestyles.  They are characterised by moderate to very severe repeat deliberate self-harm and\/or other impulsive behaviour and chaotic, over dependent engagement and often hostile with services.  \nCARE CLUSTER 10:  First Episode Psychosis This group will be presenting to the service for the first time with mild to severe psychotic phenomena.  They may also have depressed mood and\/or anxiety or other behaviours.  \nDrinking or drug-taking may be present but will not be the only problem.  \nCARE CLUSTER 11:  Ongoing Recurrent Psychosis (Low Symptoms) This group has a history of psychotic symptoms that are currently controlled and causing minor problems if any at all.  They are currently experiencing a period of recovery where they are capable of full or near functioning.  However, there may be impairment in self-esteem and efficacy and vulnerability to life.  \nCARE CLUSTER 12:  Ongoing or recurrent Psychosis (High Disability) This group have a history of psychotic symptoms with a significant disability with major impact on role functioning.  They are likely to be vulnerable to abuse or exploitation.   \nCARE CLUSTER 13:  Ongoing or Recurrent Psychosis (High Symptom & Disability)  This group will have a history of psychotic symptoms which are not controlled.  They will present with severe to very severe psychotic symptoms and some anxiety or depression.  They have a significant disability with major impact on role functioning.  \nCARE CLUSTER 14:  Psychotic Crisis They will be experiencing an acute psychotic episode with severe symptoms that cause severe disruption to role functioning.  They may present as vulnerable and a risk to others or themselves. \nCARE CLUSTER 15:  Severe Psychotic Depression This group will be suffering from an acute episode of moderate to severe depressive symptoms.  Hallucinations and delusions will be present.  It is likely that this group will present a risk of suicide and have disruption in many areas of their lives. \nCARE CLUSTER 16:  Dual Diagnosis This group has enduring, moderate to severe psychotic or affective symptoms with unstable, chaotic lifestyles and co-existing substance misuse.  They may present a risk to self and others and engage poorly with services.  Role functioning is often globally impaired.  \nCARE CLUSTER 17:  Psychosis and Affective Disorder – Difficult to Engage This group has moderate to severe psychotic symptoms with unstable, chaotic lifestyles.  There may be some problems with drugs or alcohol not severe enough to warrant dual diagnosis care.  This group have a history of non-concordance, are vulnerable & engage poorly with services.  \nCARE CLUSTER 18:  Cognitive Impairment (Low Need) People who may be in the early stages of dementia (or who may have an organic brain disorder affecting their cognitive function) who have some memory problems, or other low level cognitive impairment but who are still managing to cope reasonably well.  Underlying reversible physical causes have been rule out.             \nCARE CLUSTER 19:  Cognitive Impairment or Dementia Complicated (Moderate Need) People who have problems with their memory, and or other aspects of cognitive functioning resulting in moderate problems looking after themselves and maintaining social relationships.  Probable risk of self-neglect or harm to others and may be experiencing some anxiety or depression.   \nCARE CLUSTER 20:  Cognitive Impairment or Dementia Complicated (High Need) People with dementia who are having significant problems in looking after themselves and whose behaviour may challenge their carers or services.  They may have high levels of anxiety or depression, psychotic symptoms or significant problems such as aggression or agitation.  The may not be aware of their problems.  They are likely to be at high risk of self-neglect or harm to others, and there may be a significant risk of their care arrangements breaking down.  \nCARE CLUSTER 21:  Cognitive Impairment or Dementia (High Physical or Engagement) People with cognitive impairment or dementia who are having significant problems in looking after themselves, and whose physical condition is becoming increasingly frail.  They may not be aware of their problems and there may be a significant risk of their care arrangements breaking down.down. \nCARE CLUSTER 0:  Variance  Despite careful consideration of all the other clusters, this group of service users are not adequately described by any of their descriptions.  They do however require mental health care and will be offered a service.   \n \nNote:   In the original version of the clusters model there was a cluster 9, Substance abuse, but this has been removed for now from the Department of Health model for Payment by Results, leaving 9 as a blank. \n Source: Department of Health (2010) Mental Health Care Clustering Booklet 2010\/11. London: DH   Allocation to the clusters is based on assessment using the Mental Health Clustering Tool, a framework of items based on the Health of the Nation Outcomes Scale (HoNOS) (Wing et al 1999) with additional questions (see figure 2 below). \nFigure 2:  The Mental Health Clustering Tool Each item is rated by staff on a scale of 0, no problem, to 4, severe to very severe problem. \nPART 1: Health of the Nation Outcomes Scale 1.  Overactive, aggressive, disruptive or agitated behaviour (current) 2.  Non-accidental self-injury (current)  3.  Problem-drinking or drug-taking (current)  4.  Cognitive problems (current)  5.  Physical illness or disability problems (current)  6.  Problems associated with hallucinations and delusions (current)  7.  Problems with depressed mood (current)  8.  Other mental and behavioural problems (current)  9.  Problems with relationships (current)  10.  Problems with activities of daily living (current)  11.  Problems with living conditions (current)  12.  Problems with occupation and activities (current)  13. Strong unreasonable beliefs occurring in non-psychotic disorders only. (current)  (Additional current question to HoNOS) \nPART 2:  Historical questions, additional to HoNOS A.  Agitated behaviour\/ expansive mood (historical)  B.  Repeat self-harm (historical)  C.  Safeguarding Children & Vulnerable Dependent Adults (historical)  D.  Engagement (historical)  E.  Vulnerability (historical)   Source: Department of Health (2010) Mental Health Care Clustering Booklet 2010\/11. London: DH  From the care clusters will stem pathways of care for individuals.  In principle these will be defined by the individual’s needs and the care cluster the person is deemed to be in.   How these clusters and pathways are defined and understood in practice will be significant, then, in how inclusion and recovery are experienced by individuals. This model of care clusters is being proposed by the Department of Health as the basis for Payment by Results (PbR) in mental health care.  PbR is a mode of governance begun under the Labour administrations and continues to be in vogue under the Coalition Government.  The presumptions of PbR are that it provides clearer transparency and incentives to service providers to achieve \ndefined goals or results, payment being dependent upon achieving them, and thereby leads to better value for money to commissioners and the tax payer. Acute hospital care has been moving to PbR with more of their activities being classified by Health Resource Groups (HRGs) (e.g. hip replacements, heart bypass operations etc.).  HRGs are the currency for acute PbR, or the things the commissioner purchases.   For each unit of currency a tariff (amount of money) is paid.  This PbR model in acute care may be characterised as payment by \nactivity as thus far there has been little in the tariff payments dependent on achieving actual results, though the model continues to evolve with more thought given to best practice pathways and defined results as a basis of payments. For PbR in mental health care the intention is to use the 21 care clusters as the currency, with tariffs to be set for each.  Setting a tariff will be challenging given the long term nature of many periods of mental ill health and the diversity of conditions and needs individuals can experience, but it remains the goal of PbR. We should be clear that at this stage only the care cluster model has been defined and widely accepted.  There are no accompanying pathways and no tariffs.  These will be fundamental to how the system operates and how people experience care.  \nWhat are the possible implications for social inclusion and recovery? With the moves to clusters and pathways, a starting point in considering the issues for social inclusion is to examine the language in the clusters and allocation tool.  Care clusters may provide a clarity that eventually enables greater social inclusion, but as a starting point the current language of the care clusters is either ambiguous or unhelpful.  Telling someone he or she has a common mental health problem may make him or her feel less stigmatised (like a common cold), or it may feel dismissive at the time of distress.  To be openly categorised as ‘non-psychotic chaotic and challenging’ or ‘difficult to engage’ is probably not a helpful opening gambit towards social inclusion.  Similarly the descriptions of the clusters do not help with social inclusion.  They are dominated by descriptions of symptoms and problems.   The Mental Health Allocation Tool has the potential to draw out some social inclusion issues, such as relationships, activities of daily living, accommodation and occupation.  However, these have to be dragged out from under the cover of the process as things seem heavily dominated by risk and symptom issues and a problem oriented starting point, rather than a strengths one.  Nor does this process of assessment and allocation start by asking individuals what their recovery goals are.  Of course, the clusters and allocation tool could just be used by clinicians and services as a bureaucratic exercise that has little bearing on changing the ethos of their practice, which could be good or not.   The risk and likelihood, however, is that clusters will dramatically influence service ethos and delivery; hence, it \nwould be better if from the beginning they directly and explicitly supported the desired recovery and inclusion orientation.  From a position of wishing to promote recovery and social inclusion then, the language of the clusters model could benefit from a rewrite to make more explicit the issues of recovery and social inclusion.  Similarly the allocation tool, which can not easily be rewritten as it is based on HoNOS, at least needs an explicit emphasis placed on a more positive use of the information, leaning towards strengths and social inclusion.  We should also begin to make it clearer how these can be made to work within a more recovery and inclusion service ethos and environment.  Looking to what is yet to be developed for the care clusters model, perhaps we can discern a more hopeful position for promoting recovery and social inclusion.  Clusters will lead to pathways of care.  Pathway is a metaphor to convey an image of a person moving through a service, a journey.  This could convey a very narrow understanding of pathways i.e. highly reductionist and directing along a very constrained, common route, with little variation based on individual needs and preferences.  If defined in this manner, such pathways might run counter to individual inclusion and recovery.  Pathways could also, however, be defined in a manner that overcomes these negative connotations, and which offers more information and transparency for service users.  The model of pathways could also explicitly foreground recovery and social inclusion issues.  Pathways could provide consistency of care to ensure people receive what is best and what they are entitled to, including recovery and inclusion based values and practice.  Offering a suggested pathway to people provides clarity for initial negotiation and engagement, and a communication device for all parties to be clear on what is expected.    We need to be mindful of how PbR interacts with personalisation, though this will require us to have a critically and sensitively engaged understanding of what personalisation actually means in mental health and social care.  Flexibility to offer standard components of care in a more personal way would be a starting point.  Further flexibility to tailor addition elements of the care pathway to individual’s needs and preferences, and perhaps their own budgets, would be a further level of personalisation.  How might we build pathways that have clear recovery and social inclusion goals?  We need to be clear of the principles, practices and processes of social inclusion that would need to be explicit in pathways.  The principles would be to clearly ground the pathways in values and therapeutic aims that are clearly supportive of recovery and social inclusion.  Practices would explicitly set out issues and interventions that are relevant to social inclusion.  Processes would establish the detail of modes of working, such as care planning, that support recovery and socially inclusive practice.  The good news is that there are articulated recovery and inclusion principles, we have an evidence base for many supportive practices, and we know more about \ngood processes of care, all of which can support recovery and inclusion.  The challenge will be of interpretation and codification into exemplar pathways to guide commissioning and practice.  It is interesting reading much NICE guidance for mental health, in which the full guidance documents often have statements that would support inclusion and recovery.  Yet, discussion of this guidance often defaults to only discussing the detail of specific interventions, such as medication or psychological therapies.  This is not to say that the broader values of the NICE guidance are not operationalised in individual clinical settings, but this would be more likely if the pathways could be defined in ways to make inclusion and recovery at the forefront of how care is thought of and delivered.  A simple reductionist approach, such as a menu of specific NICE endorsed therapeutic interventions, may run the risk of undermining recovery and inclusion. Further anchor points to build inclusion and recovery into this model of clusters and PbR are outcomes and quality indicators.  Under the proposals of Liberating \nthe NHS, outcomes are to be a fundamental conceptual and organisational principle for health and social care in England.  As pointed out by Lawton-Smith (2010), getting these outcomes right for mental health care will be extremely challenging, but profoundly important to what happens to actual delivered care.  Making defined outcomes for the clusters and pathways directly supportive of recovery and inclusion would be a major statement.   Tying them to a tariff model is profoundly challenging in principle and in practice, and would need to be cautiously developed and tested, but is a goal we should examine to help the system to evolve to incorporate better support recovery and inclusive practices.  The incentives, disincentives and perverse incentives that a tariff model can contain will need careful attention, and it is here that the current void developing through structural reform of the NHS is challenging, for it is not clear who will be able to direct these issues. A further risk for social inclusion and recovery from the PbR policy for mental health is that it is presently only directed at the NHS, and not social care.  This perennial fault line between health and social care for people experiencing mental health problems could undergo a further fracture through PbR.  This is not inevitable, but it is something to be mindful of and to work against.  Then there are the other dimensions of inclusion and recovery that need even wider systems working than health and social care, such as accommodation and vocational outcomes.  Ensuring that a model of clusters and pathways, and an associated system of PbR, encourages and rewards such broad systems working, rather than fragmenting systems, will be a challenge.  \nConclusion: The multi-faceted and holistic nature of social inclusion and mental health means that no one policy development is the crux for delivering improvements for people. As those who have progressed social inclusion have long since recognised, we need to seek to influence and work with as wide a range of conceptual debates and policy developments as possible.  These include work and welfare policies, as well as arts and education, and debates about \npersonalised public services.  More recently, we would add the need to engage with debates about the Big Society. We should be clear, though, that in a sense some policies are more foundational than others, and these are the health and social care policies.  If these are not supportive of inclusion and recovery, services experienced by users and their families and carers are less likely to take account of broader inclusion issues. In emergent approaches and policies like clusters and PbR there will be much that is yet to be defined, and there will be many moving to influence the writing of these missing components in ways that suit their perspectives and interests.  Those interested in furthering social inclusion for mental health service users need to engage with these developments to ensure they help individuals and enhance their recovery, inclusion and capabilities in the desired rounded manner.  \nReferences: Department of Health (DH) (1999) The National Service Framework for Mental \nHealth: modern standards and service models.  London: DH Department of Health (2010) Equity and Excellence.  Liberating the NHS.  London: DH Department of Health (2010) Mental Health Care Clustering Booklet 2010\/11. London: DH Lawton-Smith S (2010) Policy Watch.  Mental Health and Social Inclusion.  14(4): 3-6 Self R, Rigby A, Leggett C and Paxton R (2008) Clinical Decision Support Tool: A rational needs-based approach to making clinical decisions.  Journal of Mental Health, 17(1): 33-48.  Wing, J. K., Curtis, R. H. & Beevor, A. S. (1999) Health of the Nation Outcome Scales (HoNOS). British Journal of Psychiatry, 174 (5), 432-434.     \n"}