{"doi":"10.1109\/IWSSC.2007.4409390","coreId":"102781","oai":"oai:epubs.surrey.ac.uk:2319","identifiers":["oai:epubs.surrey.ac.uk:2319","10.1109\/IWSSC.2007.4409390"],"title":"Comparison of SC-FDMA and HSUPA in the return-link of evolved S-UMTS architecture","authors":["Janaaththanan, S","Kasparis, C","Evans, BG"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-01-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2319<\/identifier><datestamp>\n      2017-10-31T14:05:03Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:63637372<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2319\/<\/dc:relation><dc:title>\n        Comparison of SC-FDMA and HSUPA in the return-link of evolved S-UMTS architecture<\/dc:title><dc:creator>\n        Janaaththanan, S<\/dc:creator><dc:creator>\n        Kasparis, C<\/dc:creator><dc:creator>\n        Evans, BG<\/dc:creator><dc:date>\n        2007-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2319\/1\/SRF002290.pdf<\/dc:identifier><dc:identifier>\n          Janaaththanan, S, Kasparis, C and Evans, BG  (2007) Comparison of SC-FDMA and HSUPA in the return-link of evolved S-UMTS architecture   2007 INTERNATIONAL WORKSHOP ON SATELLITE AND SPACE COMMUNICATIONS, IWSSC '07, CONFERENCE PROCEEDINGS.  pp. 56-60.      <\/dc:identifier><dc:relation>\n        http:\/\/ieeexplore.ieee.org\/xpls\/abs_all.jsp?arnumber=4409390&tag=1<\/dc:relation><dc:relation>\n        10.1109\/IWSSC.2007.4409390<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2319\/","http:\/\/ieeexplore.ieee.org\/xpls\/abs_all.jsp?arnumber=4409390&tag=1","10.1109\/IWSSC.2007.4409390"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Comparison of SC-FDMA and HSUPA in the Return-\nLink of Evolved S-UMTS Architecture\nS.Janaaththanan, C. Kasparis, and Barry G. Evans,\nCentre for Communication Systems Research,\nUniversity of Surrey,\nGuildford, GU2 7XH, United Kingdom.\n{ S.Janaaththanan, C.Kasparis,B .Evans I @ surrey.ac.uk\nAbstract- Single Carrier Frequency Division Multiple Access prior to the Inverse Discrete Fourier Transform (IDFT) block.\n(SC-FDMA), a multiple access technique similar to Orthogonal With this DFT block, it spreads the energy of individual\nFrequency Division Multiple Access (OFDMA), presently modulation symbols over a number of sub-carriers in the DFT\nfeatures as a strong candidate in the return link of the Long Time block. Figure 1 shows the block diagram of the signal\nEvolution (LTE) of T-UMTS. In the satellite domain there is an blockFigure 1 shows Itia observedignat\nemerging research interest in extending mobile broadcasting processing blocks involved in SC-FDMA. It is observed that\nsystem architectures that include complementary ground the main difference between OFDMA and SC-FDMA is the\ncomponents, in providing bi-directional data services to mobile DFT and inverse DFT (IDFT) blocks at the transmitter and\nusers. In such 'evolved S-UMTS' architecture, compatibility with receiver, respectively. Depending on the ratio between the\ncurrent (CDMA based) and future (OFDMA\/SC-FDMA) based) number of DFT sub-carriers and the number of IDFT sub-\nT-UMTS physical layer techniques is of high relevance, if satellite carriers at the transmitter, the DFT spreading cancels the\nnetworks are to assume a complementary role to terrestrial ones. '\nIn this paper, we first give an overview of SC-FDMA and then mixing of signals caused by the IFFT, and thus generates\ncompare, via simulations, the performance of the technique with transmitted signals with lower Peak-to-Average Power Ratio\nthat of the WCDMA-based High Speed Uplink Packet Access (PAPR) than traditional OFDMA signals [3],[4].\n(HSUPA) that has been defined in Release 6 of T-UMTS. The\nperformance evaluations are performed over channels that are\nrepresentative of the evolved S-UMTS architectures. Emphasis in NSuib- ml d P\nthe study is also given to realistic channel estimation and taking p point cat -_.r o6it PS\ninto account the effects of the amplifier's non-linearity. Other Mappig IDFT\nelements addressed in this paper are the impact of linearization\ntechniques, and the pilot channel design in order to achieve FDE - Frequency Domain Equalization\nrobust estimation in the presence of non-linear channels. CP Cyclic Prefix\nKeywords- SC-FDMA, HSUPA, LTE, DFT, TWTA.\nN\n_ bLarre M\npoint Dre-Ma1pngj point !fr\nI INTRODUCTION\nThe delivery of broadcasting services to handheld devices via Fig.\n1. Signal Processing Block Diagram of SC-FDMA Scheme [4].\nhybrid satellite-terrestrial networks is already a commercial SC-FDMA is classified into two types depending on how\nreality in the far-east and is also expected to be available in the DFT spread symbols are mapped onto the sub-carriers in\nEurope in the near future [1]. The efficiency of such networks the IDFT block- Localized SC-FDMA (L-SC-FDMA) and\nin supporting high-speed links even in urban environments is Interleaved SC-FDMA (I-SC-FDMA). As shown in Figure 2,\nan important motivation in considering an upgrade of the in L- SC-FDMA the DFT spread symbols are mapped onto\nhybrid system in supporting bi-directional data services, consecutive points in the IDFT block, whereas in I-SC-\nAmong other issues, such extension would require to choose a FDMA, the symbols are mapped onto sub-carriers which are a\nphysical layer\/multiple access technology. A crucial factor in certain distance apart. Thus, in the fading channel, I-SC-\nmaking this choice is compatibility with T-UMTS, where FDMA exploits the frequency diversity more efficiently. At\npresently CDMA is adopted, and SC-FDMA is considered as a the same time, it has lower PAPR when compared with the\nstrong 'LTE' candidate for achieving better spectral efficiency Localized SC-FDMA. However, interleaved mapping is more\nand robustness with respect to amplifier non-linearity, relative challenging for channel estimation, and extracting\nto OFDMA [2]. synchronization parameters. Here we focus our study mainly\nSC-FDMA [2], also called Discrete Fourier Transform on L-SC-FDMA, as it is under investigation for 3GPP LTE\n(DFT) spread Orthogonal Frequency Division Multiple Access [3], [4], [5].\n(OFDMA), performs the DFT spreading, in the transmitter,\n1-4244-0939-X\/07\/$25.OO ©C 2007 IEEE 56\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 12,2010 at 16:18:49 UTC from IEEE Xplore.  Restrictions apply. \ntriangular Toeplitz channel filtering matrix, which is given as:\nh(O) 0 0 0\nh(0) 0 0 0\n*1_, m I . fI i ~ ^ Ho= h(L) h(O) 0 0\nI\n~~~~~~~~0h(L) 0\n...........................~~~~~~~~~~.@, @........... .. .111I_ r 11 lI 11Oh(L) . . O\n...0 0 h(L) ... h(0)\nHI models the edge effect caused by the excess delay spread\n-\n~~~~~~~~~ofthe propagation channel and results in ISI with previouslyFig. 2. Sub-carrier mapping of Localized and Interleaved SC-FDMA tedpoagtonctransmitted symbol xi_1.\nIn this study we also consider the effect ofa pre-distortion 0 h(L) ... h(1)\ntechnique for mitigating the effects of the non-linear Traveling\n... ...\nO h(L)\n...\nWave Tube Amplifier (TWTA). Hi = ° ° ° h(L)\nThe remainder of this paper is organized as follows: in\nSection II, we introduce the system modeling of SC-FDMA, ... ... ... ... ...\nHSUPA, Power Amplifier, and Polynomial based Pre- 0 0 0 ... 0\ndistorters. Section III provides the simulation parameters and The removal of the CP at the receiver can be modeled by a\nthe frame structures used. In Section IV, we report the linear matrix: TR =[OKXCC,IKXK] , which effectively also\ncomparative results between SC-FDMA and HSUPA systems removes the second term in the summation in (1). Thus the\nunder different mobile satellite channel scenarios. resulting signal is given as:\nFurthermore, the investigation of a CAZAC (Constant y = T H0T F- MQu + TRn\nAmplitude Zero Autocorrelation) pilot sequence in the non- l l\nlinear channel estimation for SC-FDMA is also included The effect of the inclusion and removal of the CP is that the\nFinally, Section IV concludes the paper. effective channel matrix H has a circulant structure:\nh(O) 0 ... 0 h(L) ... h(])\nII. SYSTEM MODELLING h (O) ... ... 0 h (L)\nIn this Section, a brief overview of SC-FDMA is provided h (L) ... ... 0 ... 0 h (L)\nwith the help of matrix notations [6]. Thereafter, the H = h (L) ... h(0) 0 ... 0\nperformance characteristics of the TWTA and the modeling of\nL\n... ... h(0) 0\nPolynomial Pre-distorter are given.\n0 ... ... h(L) ... h(0) 0\nA. SC-FDMA 0 0° 0 h(L) hh(0)\nThe discrete base-band model of a standard SC-FDMA Since, any circulant matrix is diagonalized by the FFT matrix:\nsystem was incorporated for analysis, as shown in Figure 1. A = FHF\n-1\nLet Ui be the ith block of transmitted data, which consists of\nA FHF\nwhere A = diag(SX, .. XK) and 2 is the channelL\n-QPSK symbols. The first processing stage is DFT rth\nspreading, denoted by the linear DFT matrix Q of rsos tteifeunybn\nAt the receiver, following the FFT processing and channeldimensionM xM Then, the zero insertion and sub-carrier estimation (using localized pilot tones transmitted in the short\nmappings are modeled as linear transformations on the DFT\nspread signal, represented by the matrix M . Remaining base- b M\nband stages at the transmitter are the IFFT and CP insertion, domain (prior to IDFT dispreading). Denoting ii as the\nwhich are modeled by the linear matrices F - and TcP , estimated channel response of the ith sub-channel, the MMSE\nrespectively. Thus, following all these processing stages the estimate of the signal sample on the ith sub-carrier, is obtained\ntransmit SC-FDMA signal is given as: as:\n= T F-1MQu^Xi- CP iXi=Zi\nProvided that timing is recovered accurately at the receiver, = X + NR\nthe received signal is given as: Where z and x. are the received signal at the ith sub-carriery=H0x +H1xi1 (1) and its corresponding estimate, respectively. Finally, the\nwhere n is a vector which contains samples of the Gaussian eqaie sybo is desra usn h DT prto n\nnoise (zero mean and variances of 62). In (1), it is assumed this followed by demodulation and detection in the time\nthat the channel is modeled as an FIR filter of L+1 taps; domain.\nh = [h(O),...h(L)] , and H0 represents the PxP upper\n57\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 12,2010 at 16:18:49 UTC from IEEE Xplore.  Restrictions apply. \nB. Travelling Wave Tube Amplifier Characteristics and SC-FDMA, respectively. For SC-FDMA, coding and\nFigure 3 describes the non-linear nature of the used TWTA modulation were selected as those of the WCDMA (HSUPA)\namplifier [1]. These characteristics were used in EU-FP6 reference parameter [2], [8].\nproject MAESTRO and are based on actual measurements. Considering the simulation of WCDMA (HSUPA), a 10 ms\nTTI was considered, although the standard also supports a TTI\nC. Polynomial based-Predistorter of 2ms. In HSDPA, the Enhanced Dedicated Physical Data\nIn order to compensate the non-linear distortion introduced Channel (E-DPDCH) is defined for carrying data and the\nby the TWTA amplifier, a pre-distortion technique is utilized Enhanced Dedicated Physical Control Channel (E-DPCC) is\nat the transmitter. The polynomial based pre-distorter is defined for the purposes of channel estimation, which is\nconideed er,snceit onergs fste tan he ookUp transmitted in parallel to the E-DPDCH. In particular,consiere here,bsinedpr-istconverge fasteFr thanlicthe LeookdU following spreading, the E-DPCC chips are mapped onto theTabler (olUT)mbase pre-distorter [7] Foree simplicty, selownd orthogonal component of the QPSK signal, while E-DPDCHorderpolynomialpr-itreismdldwhtefooin chips are mapped onto the in-phase component. In the\ncoefficients; simulations, the total transmit power is assumed to be equally\ny'm= 2 2 divided between the two channels [8].\nyap 0.4503A -0.0682A+0.5198) ()Case 1\nypha = 0.O0448A2 0.5082A+0.0168) (3) -StlieoiwthLnofigt7(LOS])\nWhere A denotes the amplitude of the SC-FDMA signal0.\nz Qsample. Parametes y amp and yph represent the 9\ncorresponding amplitude and phase distortion introduced by No of 20-DMsamples5\nthe Polynomial pre-distorter. Case 3\nF~~~~~~~~~~~~F7satelllite only with Non-Line of Sight (NLOS)i\n5 1 0 1 5 20 25 30 35\nNo of SC-FDMA samples\nCase 5\n0 AM\n-AMI ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Satellitewith3 terrestrial repeaters (urban environment)l\n0~ . .. ... .. .\n-205 -15 20-10 -5 0 5 10 C-~eeee e0eeee\nIBC [dB] 0 5 101 15 20 25 30 3\nNo of SC-FDMA sample\n60 - ...\n~~~~~~~~~~~~~~Fig.4. Multi-path Power Delay profile, representive for evolved S-UMTS-\n- . - -~~~~~~~~~~~~~~~~~~~~~~\n.\n- Sampling frequency =7.68 MSamples\/Sec. [1].\n- ~~~AM-PMI\n20-..... .......... TABLEt1: TRANSMISSION PARAMETERS USED FOR THE SIMULATION OF\nWCDMA(HSUPA) [8].\nRate\n-20 -15 -10 -5 0 5 10 MranporlatuierOVSF Codeafter 2IBC [dB] Block of Code\no CdeRate A A Tx\nSize Blocks on Coe tes'u\nFig. 3. AM-AM and AM-PM characteristics of a S-band Traveling Wave I I I I I I-\nTube Amplifier(TWTA) [1]. 2560 1 QPSK 0(4,1)1 0.33 115 130 128\nIII. SIMULATION PARAMETERS\nFor the simulation of SC-FDMA, the sub-frame format and\ntransmission parameters defined in [2] were adopted. The sub-\nThis section provides the simulation parameters used in this frame format is shown in figure 2; each sub-frame consists of 6\nstudy and the corresponding frame structures used both in SC- long blocks obtained from the IFFT operation and with the\nFDMA and WCDMA (HSUPA). Furthermore, these corresponding CP insertion, 2 short blocks carrying the\nsimulations were performed on three different multi-path reference signal are multiplexed in between the long blocks as\nchannel profiles: a). satellite only with Line of Sight (LOS), shown in Figure 5.\nb).satellite only with Non-Line of Sight (NLOS), and\nc).satellite with three terrestrial repeaters (urban environment). 1 sub-frame = 0.5 me\nFigure 4 shows the normalized power delay profile of theseSBBI\nthree channels, reSpectively [1]. In the tapped-delay line OPLB1 1O B# PL 3C B# OP LB 5 P l2 t- LB#6\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 12,2010 at 16:18:49 UTC from IEEE Xplore.  Restrictions apply. \nTABLE 2: TRANSMISSION PARAMETERS USED FOR THE SIMULATION OF SC- channel estimation, which is not present in SC-FDMA.\nFDMA [2].\n~~~~However, the overall performance of the two systems is\nsimilar to Figure 6.\nAssumed Spectrum Allocation 5MHzlo......\nSym bol ate 7.68M s\/s\n.- h\n-\n-FD -C h.5\nSub-Frame Duration 0O5ms ......-................... e - WCDMA-Ch.i\nMAEl --WC CC\nLong Block Size (microsecond! 66.67\/300\/512 ...........W.................\nNumber of occupied sub-\ncarriers\/Number of Samples)\nShort Bloc Size mirosecondblocks \/1inthe..sub-frame)..1.2 5...... 6.. 7..8..9..100 3..\nb. [dB]..\nSumb-aresper Reorontf5( ResorceUnitdpesLonFi...6..Performance.... of....WCDMA.... and C-MAfrdfentmbl\ncarrirs\/NuberoSamles).....Block)...channel.. profiles..with.perfect channel..... estimation.\nPoints in the DFT Spreading 25~~~~~~~~~~~~~~~~~~blcki th u -fa e\nReference Signal Structure for Loca~~~~~~~~~~~~~~~~~~~~~~~lzedsbcrintesu-rs(arred)y h 10 »,ICDMAChI\nW 102 5 6 7 8\ncomparing and evaluating the performan~~~~~~~~~~~Blc, based onieswihpefetchnnlthemtin\nBLER VsEb\/Nocurves, of SC-FDMA and WCDMA~~~~~~~~~~~~~~~~~............................. C-DM C.\n(PSUPA) in theDF'Sretundinkg fh evove S-UMTS.In.al 10............. 12 13 1\nFigure 6 gives thesimulation results obtained for three Fig. 7. Performance of WCDMA and SC-FDMA fordifferentmobile~~~~~~~~~~~~~~~~~~~01\n-D WCDM Ch.\nestimation. In this case,complete transmit power is allocated SO-EDMA Oh.1~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~..... CDA h.\napproximatelythesameperformance over channel cases 1 &..~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~..........................................\n3.pHoever WCDMaperorm betterinsovr thocs channel......5,................hich is com bined'satellite+repeater' channel. This is due ~~~~~~~~~~~~~~~~~~~............... %....... ...A.totherakereceivermodel adopted with the WCDMA system,\n.~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~...................~b......\nwhich (has sixfingers) is able to detect long delayed channel o~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~U ......... ................ ....... ... ......................taps by allocating fingers to them. On the other hand, the SC-\n~~~~~~~~~~~~~~~~~~~~~~~~j............................ ... ........ ..............\nFhigurec7tivnpesensimilarulaioresultsasi iue6 ute wih8fefomneorE\/o[BFi...WCDMA......and.....C-.....MA. for.different mobilerealistic(pilotbased)channel estimation. As explained in the channel profiles with TWTA (realistic channel Estimation).\nallocatedauaigte efraceaeohto...the E-CPC.reomnedinth.HUP.Fgue. cmpre te erorane of th two systemsin.\npLERfomace Onbthe othversan, inSC-FDMA, 26piottoe assuming.......realistic........channel....estimatio. Sne nW D A\nkeptreatthisvpopotion Thereftonre, ulthe ch tanneldestimthes in thFignal safomples havWConstant aCMpltdsfodixfedeat0mdbil\nWdMAfe arem ore-at relableltha tatsfsC-FdMApdueetothanel Cneuety thanel ampflewifieristidriv nen costisateontl. tIO\nfactithatimore powerhisaaecmllocted toanpits inweWCDMaloaned 0dB..and.therefore.the ..transmitted.signal is- ditrtdonyb\ntogether. wIth the presened ofa noise saveraigeffctpoine th1ie0hs hf f47dges(rm Fgr )\n59 CMAC.\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 12,2010 at 16:18:49 UTC from IEEE Xplore.  Restrictions apply. \nConcerning this in-band distortion, it is obvious from Figure 8 introduced by the TWTA amplifier. This is demonstrated in\nthat this can be perfectly corrected via channel estimation. Figure 10 with an IBO of 0 dB (i.e. at saturation point) is used\nThis is explained by the simulation results, as the results from in all cases. It is also observed that the pre-distorter gives only\nFigure 8 are almost identical to those presented in Figure 7. a small performance advantage, which is very much identical\nOn the other hand, in SC-FDMA, there is a significant to the performance already, obtained using the CAZAC\nvariation in the amplitudes of the signal samples and thus sequence. Therefore, the use of CAZAC sequence gives the\nresults in performance degradation compared to the results same performance advantage as the polynomial pre-distorter.\npresented in Figure 7. The important point here is that theV.performance of the SC-FDMA system, in the presence of non-V. CNLSO\nlinearity, depends substantially on the structure of the pilot In this paper, we have studied, via simulation, the\nsequences used for channel estimation. In particular, if the performances of WCDMA (HSUPA) and SC-FDMA in the\nselected sequence is characterized by high PAPR in the time return link of an evolved-S-UMTS architecture that includes\ndomain (after IFFT), then large portion of its energy will be terrestrial repeaters.\nsaturated by the TWTA, resulting in poor channel estimation. We have shown that for single user transmission, both\nSo far, we have followed a non-systematic approach to design schemes provide approximately the same performance in the\nthe pilot sequence, in which several pilot sequences were satellite only (case 1 & 3) environment and WCDMA shows\nrandomly generated in the frequency domain and the one better performance in 'satellite+ repeater' (case 5) channel\nwhich provided the best link performance was retained for environment. More non-linear effect would be expected, if the\nsimulation. To be more systematic, we considered CAZAC signals from many users are multiplexed in the code\/user(Constant Amplitude Zero Auto-Correlation) sequence [9] as domain.\nan appropriate pilot sequence for this type of scenario. We have also shown that the in-band distortion introduced\nSubsequently, Figure 9 shows small performance by the TWTA is perfectly compensated by channel estimationimprovements are achieved with the CAZAC sequence. in WCDMA whereas, in SC-FDMA, 1.5-2dB degradation is\n.............SO-EDMA.Ch.1.(amp) observed mainly due to the non-linear amplifier. Although the\n-s -SC-FDMA Ch.3 (amp)\n-*-SC-FDMA Ch.5 (amp) polynomial pre-distorter improves the performance by about 0-\n............-0- SC-FDMA Ch.1 (amp+CAZAC)\n11......... SC-FDMA Ch.3 (amnp+CAZAC) 3-0.7dB, the same level of performance advantage is possible\ni: .....................C.......by adopting the CAZAC sequence for channel estimation. It\n2r aperformance is concerned, the use of the CAZAC sequence\n(i.e. improved channel estimation) and channel coding give\n%~ ............similar performance to the pre-distorter. However, further\ninvestigation needs to be done on the signal spectrum in order\n........................................................ito dem onstrate its effect on the out of band radiation. In\n4 5 6 7 8 9 1 0 1 1 1 2 1 3 14\nEb\/No [dB]\nFig. 9. Performance of SC-FDMA for different mobile channel profiles with REFE-RENCES\nrealistic channel estimation using CAZAC sequence.[1 S.CoiG.ECoaz,MNe,anA.Vel-orl,OD vs\nSC-FDMA Ch.3(amp) HSDPA comparison for Satellite Digital Multimedia Broadcasting\n..............SO-EDM.Ch.3.(amp\nSC-FDMA Ch.5(amp) Systems\", IEEE Globecom. Conference, Dec. 2005, pp. 2922-2926.\n.-..... 0- SC-FDMA Ch.1 (amp+PD( [2] 3GPP TR 25.913 Requirements for Evolved UTRA (E-UTRA) and\n101........ SC-FDMA Ch.3 (amp+PD(1>>- SC-FDMA Ch.5 (amp+PD( Evolved UTRAN (E-UTRAN, V.7.0).\n.........[3] R. Bachl, P. Gunreben, S. Das, and S. Tatesh, \"The Long Term\nLUl-::::r Technical Journal, vol. 11, pp. 25-51, Mar. 2007.\n..............i[4] Hyung G. Myung, Junsung Lim, and David J. Goodman, \"Single Carrier\n.................FDMA..for..Up..ink .Wireless Transmission,\"reessTaIEEEsiVehicularVeic Technologyog\n..........................M agazine,.....vol....1,..no.3,in ,pp.. 30-38, pp Sept. 2006.6\n10 ...[5]....H....G.....M..ung............Lim,.....and....D.---------Goodman,5] yPeak-to-AverageGodan,\"PaktoAPowerPwe\n.........................................................Ratio of Single Carrier FDM Signals with Pulse Shaping\", IEEE\n-,I ~~~~~~~~~~~~[6]J. ZHANG, C. HUANG, G. LIU, and P. ZHANG, \"Comparison of the104 5 6 7 8 9 1 0 1 1 1 2 1 3 14 Link Level Performance between OFDMA and SC-FDMA,\" IEEE\nEb\/NO [dB] Chinacom'06, p. 1-, Oct.206\nFig. 10. Performance of SC-FDMA for different mobile channel profiles [7] C. Hsing-Hung, M. Ching-Shyang, W. Yeong-Cheng, and C. Jiunn-\nwith realistic channel estimation (polynomial pre-distorter) Tsair,\"Joint Polynomial and Look-Up-Table Power Amplifier\nLinearization Scheme,\" IEEE VTC'03, vol.2, pp. 1345-1349, Apr. 2003.\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 12,2010 at 16:18:49 UTC from IEEE Xplore.  Restrictions apply. \n"}