{"doi":"10.1103\/PhysRevB.74.047302","coreId":"100797","oai":"oai:epubs.surrey.ac.uk:194","identifiers":["oai:epubs.surrey.ac.uk:194","10.1103\/PhysRevB.74.047302"],"title":"One-neutron knockout in the vicinity of the N=32 sub-shell closure: Be-9(Cr-57,Cr-56+gamma)X","authors":["Gade, A","Janssens, RVF","Bazin, D","Brown, BA","Campbell, CM","Carpenter, MP","Cook, JM","Deacon, AN","Dinca, D-C","Freeman, SJ","Glasmacher, T","Horoi, M","Kay, BP","Mantica, PF","Mueller, WF","Terry, JR","Tostevin, JA","Zhu, S"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-10-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMERICAN PHYSICAL SOC","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:194<\/identifier><datestamp>\n      2017-10-31T13:57:07Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/194\/<\/dc:relation><dc:title>\n        One-neutron knockout in the vicinity of the N=32 sub-shell closure: Be-9(Cr-57,Cr-56+gamma)X<\/dc:title><dc:creator>\n        Gade, A<\/dc:creator><dc:creator>\n        Janssens, RVF<\/dc:creator><dc:creator>\n        Bazin, D<\/dc:creator><dc:creator>\n        Brown, BA<\/dc:creator><dc:creator>\n        Campbell, CM<\/dc:creator><dc:creator>\n        Carpenter, MP<\/dc:creator><dc:creator>\n        Cook, JM<\/dc:creator><dc:creator>\n        Deacon, AN<\/dc:creator><dc:creator>\n        Dinca, D-C<\/dc:creator><dc:creator>\n        Freeman, SJ<\/dc:creator><dc:creator>\n        Glasmacher, T<\/dc:creator><dc:creator>\n        Horoi, M<\/dc:creator><dc:creator>\n        Kay, BP<\/dc:creator><dc:creator>\n        Mantica, PF<\/dc:creator><dc:creator>\n        Mueller, WF<\/dc:creator><dc:creator>\n        Terry, JR<\/dc:creator><dc:creator>\n        Tostevin, JA<\/dc:creator><dc:creator>\n        Zhu, S<\/dc:creator><dc:publisher>\n        AMERICAN PHYSICAL SOC<\/dc:publisher><dc:date>\n        2006-10-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/194\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Gade, A, Janssens, RVF, Bazin, D, Brown, BA, Campbell, CM, Carpenter, MP, Cook, JM, Deacon, AN, Dinca, D-C, Freeman, SJ, Glasmacher, T, Horoi, M, Kay, BP, Mantica, PF, Mueller, WF, Terry, JR, Tostevin, JA and Zhu, S  (2006) One-neutron knockout in the vicinity of the N=32 sub-shell closure: Be-9(Cr-57,Cr-56+gamma)X   PHYSICAL REVIEW C, 74 (4), ARTN 0.       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevB.74.047302<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/194\/","10.1103\/PhysRevB.74.047302"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"ar\nX\niv\n:n\nuc\nl-e\nx\/\n06\n08\n05\n3v\n1 \n 3\n0 \nA\nug\n 2\n00\n6\nOne-neutron knockout in the vicinity of the N = 32 sub-shell closure:\n9Be(57Cr,56Cr+γ)X\nA. Gade,1, 2 R.V. F. Janssens,3 D. Bazin,1 B.A. Brown,1, 2 C.M. Campbell,1, 2 M.P. Carpenter,3\nJ.M. Cook,1, 2 A.N. Deacon,4 D.-C. Dinca,1, 2 S. J. Freeman,4 T. Glasmacher,1, 2 M. Horoi,5\nB.P. Kay,4 P.F. Mantica,1, 6 W.F. Mueller,1 J.R. Terry,1, 2 J.A. Tostevin,7 and S. Zhu3\n1National Superconducting Cyclotron Laboratory, Michigan State University, East Lansing, Michigan 48824\n2Department of Physics and Astronomy, Michigan State University, East Lansing, Michigan 48824\n3Physics Division, Argonne National Laboratory, Argonne, IL 60439\n4School of Physics and Astronomy, Schuster Laboratory,\nUniversity of Manchester, Manchester M13 9PL, United Kingdom\n5Department of Physics, Central Michigan University, Mount Pleasant, MI 48859\n6Department of Chemistry, Michigan State University, East Lansing, MI 48824\n7Department of Physics, School of Electronics and Physical Sciences,\nUniversity of Surrey, Guildford, Surrey GU2 7XH, United Kingdom\n(Dated: February 8, 2008)\nThe one-neutron knockout reaction 9Be(57Cr,56Cr+γ)X has been measured in inverse kinematics\nwith an intermediate-energy beam. Cross sections to individual states in 56Cr were partially untan-\ngled through the detection of the characteristic γ-ray transitions in coincidence with the reaction\nresidues. The experimental inclusive longitudinal momentum distribution and the yields to indi-\nvidual states are compared to calculations that combine spectroscopic factors from the full fp shell\nmodel and nucleon-removal cross sections computed in a few-body eikonal approach.\nNeutron-rich Ca, Ti and Cr isotopes have at-\ntracted much attention recently. The strong proton-\nneutron monopole interaction in these exotic nuclei with\npif7\/2ν(fp) configurations causes a shift in the energy of\nthe νf5\/2 neutron single-particle orbit as protons fill the\npif7\/2 shell and results in the development of an N = 32\nsub-shell closure in 52Ca, 54Ti and 56Cr [1]. Nuclei\nin the vicinity of this new sub-shell closure have been\nstudied extensively in β-decay experiments [2, 3, 4, 5],\nintermediate-energy Coulomb excitation [6, 7], deep-\ninelastic heavy-ion collisions [8, 9], fusion-evaporation re-\nactions [10, 11, 12] and secondary fragmentation [13].\nWe report on the study of the one-neutron knockout re-\naction 9Be(57Cr,56Cr+γ)X. Direct one-nucleon removal\nat intermediate beam energies [14] has been used ex-\ntensively to study single-particle structure in neutron-\nrich and proton-rich exotic nuclear species (see, e.g.,\n[15, 16, 17, 18, 19, 20]). Single-particle cross sections\nand longitudinal momentum distributions are computed\nusing few-body reaction theory, in the eikonal and sudden\napproximations [21, 22], and employing Skyrme Hartree-\nFock calculations [23, 24] to reduce uncertainties in the\ninput to the reaction calculation. Spectroscopic factors,\nwhich relate to the occupancy of single-particle orbits,\ncan be deduced from experimental cross sections by com-\nparison to reaction theory and pose stringent tests for\nmodern shell-model calculations far from stability [25].\nThe longitudinal momentum distribution of the knock-\nout residues is used – in analogy to the angular distri-\nbution in low-energy transfer reactions – to identify the\norbital angular momentum l carried by the knocked-out\nnucleon.\nIn this paper we discuss the magnitude of the inclu-\nsive cross section, the small branch for the knockout to\nthe ground state of 56Cr and the shape of the inclusive\nmomentum distribution as compared to that predicted\non the basis of single-particle strengths from large-scale\nshell-model calculations in the fp shell.\nA secondary beam cocktail containing 57Cr was ob-\ntained via fast fragmentation of a 130 MeV\/nucleon 76Ge\nprimary beam delivered by the Coupled Cyclotron Fa-\ncility of the National Superconducting Cyclotron Lab-\noratory at Michigan State University. The production\ntarget, 423 mg\/cm2 thick 9Be, was located at the mid-\nacceptance position of the A1900 fragment separator [26].\nThe separator was operated at 1% momentum accep-\ntance.\nThe 57Cr projectiles, with an average mid-target en-\nergy of 77 MeV\/nucleon, interacted with a 375 mg\/cm2\nthick 9Be target placed at the pivot point of the\nlarge-acceptance, high resolution S800 magnetic spectro-\ngraph [27]. The event-by-event particle identification and\nthe reconstruction of the momentum distribution of the\nknockout residues were performed with the focal-plane\ndetector system [28]. The energy loss in the S800 ion-\nization chamber, the time of flight taken between plastic\nscintillators and the position and angle information of\nthe reaction products in the S800 focal plane were em-\nployed to identify the reaction residues produced upon\ncollision with the 9Be target (Fig.1). The spectrograph\nwas operated in focus mode, where the incoming exotic\nbeam is momentum focused onto the secondary reaction\ntarget. The difference in the time of flight measured be-\ntween two scintillators before the secondary target pro-\nvided the particle identification of the incoming beam.\nSelection of the incoming species allowed a separation of\n2knockout residues and fragmentation products of the dif-\nferent constituents of the beam. Incoming 55V and 57Cr\nprojectiles overlapped in time of flight, but possible con-\ntamination from 56Cr produced by proton pickup on 55V\nis highly unlikely because of momentum mismatch.\n800\n700\n600\n500\n400\nTime of flight (arb. units)\nEn\ner\ngy\n lo\nss\n (a\nrb.\n un\nits\n) 56Cr 57Cr\nV55\nFIG. 1: (Color online) Energy loss vs. time of flight particle\nidentification spectra for the one-neutron knockout reaction\nsetting and the unreacted incoming beam. The right panel\nshows the incoming, unreacted cocktail beam passing through\nthe 9Be target. This unreacted setting has been used to de-\ntermine the normalization of the incoming rate of 57Cr. The\nleft panel shows the spectrum obtained with the one-neutron\nremoval reaction residues centered in the S800 focal plane.\nA software gate has been applied on incoming 55V and 57Cr\nin the time-of-flight difference measured between two plastic\nscintillators before the target.\nAn inclusive cross section of σinc = 122(8) mb was de-\ntermined for the one-neutron knockout from 57Cr to all\nbound final states of 56Cr. This was obtained from the\nyield of knockout residues divided by the number of in-\ncoming projectiles relative to the number density of the\n9Be reaction target. The fraction of incoming 57Cr pro-\njectiles in the cocktail was determined from the unreacted\nspectrograph setting shown in the right panel of Fig. 1.\nThe number of incoming 57Cr in the reaction setting is\nthen derived from this fraction relative to scalers count-\ning the total incoming particle flux. The main uncer-\ntainties stem from the choice of the software gates used\nfor particle identification (2.5%), the composition of the\nbeam (3%), and the momentum acceptance of the S800\nspectrograph (5%). These systematic errors are assumed\nto be independent and have been added in quadrature.\nThe 9Be reaction target was surrounded by SeGA, an\narray of 32-fold segmented HPGe detectors [29], arranged\nin a configuration with two rings (90◦ and 37◦ central\nangles with respect to the beam axis, equipped with ten\nand seven detectors, respectively). The segmentation of\nthe SeGA detectors allows for an event-by-event Doppler\nreconstruction where the angle of the γ-ray emission is\ndeduced from the position of the segment that registered\nthe highest energy deposition.\nThe SeGA total photopeak efficiency of 2.2% for 1.33-\n1000600 1400 1800 2200\n0\n10\n20\n30\n40\n50\n60\n++\n2 0++\n+(3   )\nEnergy (keV)\nCo\nun\nts \n\/ 7\n k\neV\n56Cr\n2281 keV\n0\n2\n6\n+(2   )\n+\n+\n+\n+\n(2  )(3  )\n4 2\n6 4\n+\n+ +\n+\n58(11)%\n3(10)%\n1002(7) keV\n4\n447(5) keV\n1066(8) keV\n1173(7) keV\n1831 keV\n13.5(31)%\n13.2(38)%\n12.7(60)% 3252 keV\n2077 keV\n1007 keV\n0 keV\n.\nFIG. 2: Gamma-ray spectrum detected in coincidence with\n56Cr knockout residues. The observed transitions are in agree-\nment with the level scheme established in [10, 11]. The pop-\nulation of individual excited states in the knockout reaction\nis derived from γ-ray intensities relative to the number of\nknockout residues taking the level scheme into account. The\nfraction of 2.6% for the knockout to the ground state is ob-\ntained after subtraction.\nMeV photons energy was determined with standard cal-\nibration sources. The latter also provided the detector\nresponse used to correct the in-beam data for the Lorentz\nboost arising from the velocity of the emitting reaction\nresidues (v\/c = 0.36).\nThe Doppler-reconstructed γ-ray spectrum detected in\ncoincidence with 56Cr reaction residues is shown in Fig. 2.\nThe γ-ray transitions observed in the present experiment\nare in agreement with the results from [10, 11] and con-\nfirm the known level scheme, given as an inset in Fig. 2.\nUsing the known γ-ray branching ratios and the level\nscheme, the cross sections for the one-neutron knockout\nto specific final states were deduced from the balance\nbetween the observed feeding and dexcitation patterns.\nThese intensity balances can be rather uncertain in in-\nstances where unobserved γ-ray decays are possible.\nThe spectroscopic factors leading to the ground state\nand the 2+ state (1.007 MeV) of 56Cr were calculated\nin the full fp shell-model space with the GXPF1A in-\nteraction [34, 35] using the codes cmichsm [36] and\noxbash [37]. The results are summarized in Fig. 3\nand Table I. The calculations predict a 3\/2− ground\nstate for 57Cr, in agreement with an early β-decay mea-\nsurement [38] and consistent also with more recent ex-\nperimental observations [3, 12]. The calculations in-\ndicate a severely fragmented single-particle strength as\nthe derived spectroscopic factors are: C2S(0+, p3\/2) =\n0.24, C2S(2+, p3\/2) = 0.32, C\n2S(2+, f7\/2) = 0.03,\nC2S(2+, f5\/2) = 0.006 and C\n2S(2+, p1\/2) = 0.007, with\nthe remaining spectroscopic strength, that sums up to\nthe neutron occupation number of 13, going to levels up\nto about 8 MeV in 56Cr (the neutron decay threshold\n3is Sn = 8.26 MeV [39]). Such high excitation ener-\ngies imply that there may be several hundred levels to\nconsider. For an estimate of the cross section related\nto these states, we take the remaining (p1\/2, f5\/2, p3\/2)\nstrength of C2S(p3\/2) = 2.15, C\n2S(f5\/2) = 1.81 and\nC2S(p1\/2) = 0.47 to be centered at 4 MeV in excita-\ntion and the deeper f7\/2 hole strength of about 8 units\nto be centered at 8 MeV in excitation energy. Clearly,\nthe value C2S(f7\/2) = 8 should be viewed as an upper\nlimit for f7\/2 occupation as it assumes that no spectro-\nscopic strength is lost to unbound states above the neu-\ntron threshold. This complex scenario with spectroscopic\nstrength to many excited states below threshold leads to\nthe following conclusion: the measured population of ex-\ncited states quoted in Fig. 2 must include both the direct\npopulation in the one-neutron knockout process and un-\nobserved, discrete feeding from many higher-lying excited\nstates. The high partial cross section carried by the 2+1\nstate is likely dominated by indirect, unobserved feeding.\nThis state will act as doorway state funnelling the major-\nity of the spectroscopic strength feeding the higher-lying,\nexcited states that are predicted to be populated in the\none-neutron knockout by the shell-model calculation.\nThe theoretical cross sections quoted in Fig. 3 are ob-\ntained by combining the spectroscopic factors from the\nshell-model calculations and the single-particle cross sec-\ntions from eikonal reaction theory in the following way:\nthe cross sections σi(I\npi) for the knockout of a single nu-\ncleon with quantum numbers (n, l, j), leaving the core\nin a specific final state Ipi, factorize into a part that de-\nscribes nuclear structure (the spectroscopic factor C2S)\nand a contribution characterizing the reaction process\n(the single-nucleon removal unit cross section σsp) as\nσi(I\npi) =\n∑\nj\n(\nA\nA− 1\n)3\nC2S(j, Ipi)σsp(j, Sn + Ef (I\npi))\n(1)\nwith summation over all the allowed angular-momentum\ntransfers j. The A-dependent term is a center-of-mass\ncorrection [30, 31] to the shell-model spectroscopic fac-\ntors in the fp shell. The effective separation energy of\nthe nucleon is Sn + Ef (I\npi) where Sn = 5.176 MeV is\nthe ground-state neutron separation energy of the pro-\njectile [39] and Ef (I\npi) denotes the excitation energy of\nthe final state of the core. The single-particle cross sec-\ntions are the sum of contributions from both the stripping\nand diffractive dissociation mechanisms [14]:\nσsp = σstr + σdif . (2)\nThe single-particle cross sections entering eq. (1) were\nobtained within the eikonal approach of Refs. [14, 32].\nThe stripping and diffractive contributions have been\ncomputed from the core- and neutron-target S matri-\nces, which were calculated from the 9Be and 56Cr den-\nsities using Glauber theory, as discussed in [14]. We as-\nsumed a Gaussian matter density for 9Be with a rms\nradius of 2.36 fm. The 56Cr density was taken from\nSKX Hartree-Fock (HF) calculations [23]. The core-\nneutron relative motion wave functions were calculated\nin a Woods-Saxon potential. The diffuseness parameter\nwas fixed at a = 0.7 fm, consistent with previous publica-\ntions [14]. The radius parameter r0 was selected for each\nsingle-particle orbit (nlj) individually to reproduce the\nrms separation of neutron and core as calculated within\nthe SKX HF wave function. The depths of the binding\npotentials were chosen to reproduce the effective separa-\ntion energy of each final state.\nTABLE I: Results of the schematic calculation of the knock-\nout process from 57Cr to 56Cr. Given are the energy Ef of\nthe final state in 56Cr, the spectroscopic factor C2S for the\nneutron knockout from orbit nlj and the stripping and diffrac-\ntive contribution to the single-particle cross section σsp and\nresulting theoretical partial cross section σi as calculated in\nthe few-body eikonal reaction theory.\nEf nlj C\n2S σstr σdif σsp σi\n(MeV) (mb) (mb) (mb) (mb)\n0.0 0+1 2p3\/2 0.24 14.56 6.17 20.73 5.25\n1.0 2+1 2p3\/2 0.32 12.83 5.15 17.98 6.07\n1f7\/2 0.03 9.57 3.18 12.75 0.40\n1f5\/2 0.006 8.07 2.61 10.67 0.07\n2p1\/2 0.007 12.87 5.17 18.04 0.13\n4.0 2p3\/2 2.15 9.57 3.37 12.94 29.33\n1f5\/2 1.81 6.70 1.97 8.67 16.55\n2p1\/2 0.47 9.63 3.40 13.02 6.45\n8.0 1f7\/2 7.97 6.47 1.78 8.24 69.28\nsum 13 sum 133.5\nThe large inclusive cross section for knockout from\n57Cr to 56Cr can be traced to the large neutron occu-\npancy of orbitals that, in one-neutron removal, populate\nbound excited states of 56Cr. Remarkably, the small the-\noretical cross section for the knockout to the ground state\nis also in agreement with the experimental observation\n(see Fig. 2) and is a consequence of the very small asso-\nciated spectroscopic factor of C2S = 0.24. In the shell\nmodel, the 2p3\/2, 1f5\/2 and 2p1\/2 single-particle orbits\nare very close in energy, with the result that a simple\ndescription of 57Cr as a single neutron outside a N = 32\ncore fails.\nThe inclusive parallel momentum distribution of the\n56Cr residues is compared with the theoretical expecta-\ntion in Fig. 4. The latter combines the momentum dis-\ntributions for the removal of a neutron from 2p3\/2, 1f5\/2,\n2p1\/2 and 1f7\/2 orbits (Table I), calculated from the same\nS matrices as used for the single-particle cross sections,\n4p 3\/2\n.\n.\n.\n.\n.\np1\/2 p3\/2\n7\/2f5\/2f\np1\/2 p3\/2\n5\/2f\n7\/2f σ=69.28mb\nΣσ=52.33mb\nmbΣσ=6.67\nσ=133.5\n1 MeV\n0 MeV\nσ=5.25 mb\nmb\n}\n8 MeV\n4 MeV\n.}\nFIG. 3: Schematic shell-model level scheme, configurations,\nand resulting theoretical cross sections for the population\nof excited states in 56Cr. The shell-model calculation is\nschematic. The cross sections are calculated from eikonal re-\naction theory as described in the text (Table I).\nand the method of [22, 33]. The theoretical inclusive mo-\nmentum distribution is then the sum of these individual\ndistributions, weighted with the corresponding spectro-\nscopic factors. The calculated shape was convoluted with\nthe measured momentum profile of the unreacted 57Cr\nbeam to account for the incoming momentum spread and\nthe straggling in the target. The measured momentum\ndistribution is asymmetric with the high-momentum side\nbeing accurately reproduced by the calculation while a\ntail extends toward lower momenta. Such asymmetric\nshapes have been reported before [40, 41, 42] in nucleon\nknockout reactions of well-bound systems and indicate\n(as yet unquantified) effects that go beyond eikonal re-\naction theory. In the eikonal theory, the partial cross\nsections are determined: (i) structurally, by the single-\nparticle overlap for each transition, and (ii) dynamically,\nby the nucleon- and residue-target S-matrices. The ex-\npressions for the single-particle cross sections are inclu-\nsive with respect to all final states of the target (using\ncompleteness) when assuming these can be considered\ndegenerate with the target ground state for the purpose\nof the reaction dynamics (the adiabatic approximation)-\nthe result is that the S-matrices are calculated at fixed\nenergy. This is expected to be a very good approxi-\nmation at intermediate energy. Expressing the eikonal\nresidue momentum distribution requires additional ap-\nproximations, e.g. the neglect of residue final-state inter-\nactions, while this observable now probes the dynamics\nmore closely. This extra sensitivity indicates a small re-\ndistribution of the integrated single-particle cross section\nwith momentum compared to that from the approximate\n(energy non-conserving) eikonal model kinematics, with\na low-energy tail characteristic of (dissipative) target ex-\ncitations that are treated only approximately (adiabati-\ncally) in the eikonal model. The approximations required\nfor the integrated partial cross section on the other hand\nare more robust, as was discussed above (further discus-\nsion can be found in [42]). The overall agreement in the\nshapes of the measured and and calculated inclusive mo-\nmentum distributions is consistent with the schematic\ndistribution of single-particle strength adopted and the\nshell-model space chosen within this approach appears\nvalid.\n1000\n800\n600\n400\n200\n0\n19.619.218.8\np (GeV\/c)\nCr56 57Cr\nCo\nun\nts \n\/ (\n52\n M\neV\n\/c)\nFIG. 4: (Color online) Inclusive parallel momentum distribu-\ntion of the 56Cr knockout residues in comparison to a model\ncalculation. The theoretical inclusive momentum distribution\n(solid red line) is calculated using the eikonal stripping reac-\ntion mechanism. The weights attributed to the individual\ncontributions of knockout from 2p3\/2, 1f5\/2, 2p1\/2, and 1f7\/2\norbits are taken from the corresponding theoretical cross sec-\ntions presented in Table I. The momentum profile of the unre-\nacted 57Cr projectile beam passing through the target (dashed\nblue line) is also shown.\nIn summary, the one-neutron knockout reaction\n9Be(57Cr,56Cr+γ)X has been investigated. The spectro-\nscopic strength was found to be spread over a large num-\nber of 56Cr levels. Nevertheless, calculations were able to\nreproduce the main observables, i.e, the magnitude of the\ninclusive cross section of σinc = 122(8) mb as well as the\nshape of the inclusive parallel momentum distribution.\nThese results can be viewed as a further illustration of\nthe potential of direct one-nucleon removal reactions at\nintermediate energy and the associated theoretical frame-\nwork for spectroscopic investigations of exotic nuclei.\nThis work was supported by the National Science\nFoundation under Grants No. PHY-0110253, PHY-\n9875122, and PHY-0244453, by the U.S. Department of\nEnergy, Office of Nuclear Physics, under Contract No.\nW31-109-ENG-38, and by the UK Engineering and Phys-\nical Sciences Research Council grant EP\/D003628.\n[1] T. Otsuka, et al. Phys. Rev. Lett. 87, 082502 (2001).\n[2] J.I. Prisciandaro et al., Phys. Lett. B510, 17 (2001).\n5[3] P. F. Mantica et al., Phys. Rev. C 67, 014133 (2003).\n[4] P. F. Mantica et al., Phys. Rev. C 68, 044311 (2003).\n[5] S.N. Liddick et al., Phys. Rev. Lett. 92, 072502 (2004);\nPhys. Rev. C 70, 064303 (2004); Phys. Rev. C 72, 054321\n(2005).\n[6] D.-C. Dinca et al., Phys. Rev. C 71, 041302(R) (2005).\n[7] A. Bu¨rger et al., Phys. Lett. B622, 29 (2005).\n[8] R.V.F. Janssens et al., Phys. Lett. B546, 55 (2002).\n[9] B. Fornal et al., Phys. Rev. C 70, 064304 (2004); Phys.\nRev. C 72, 044315 (2005).\n[10] S. Zhu et al., to be published.\n[11] D. E. Appelbe et al., Phys. Rev. C 67, 034309 (2003).\n[12] A. N. Deacon et al., Phys. Lett. B622, 151 (2005).\n[13] A. Gade et al., Phys. Rev. C 73, 037309 (2006).\n[14] P. G. Hansen and J. A. Tostevin, Annu. Rev. Nucl. Part.\nSci. 53, 219 (2003).\n[15] A. Navin et al., Phys. Rev. Lett. 81, 5089 (1998).\n[16] T. Aumann et al., Phys. Rev. Lett. 84, 35 (2000).\n[17] E. Sauvan et al., Phys. Lett. B491, 1 (2000).\n[18] A. Gade et al., Phys. Rev. Lett. 93, 042501 (2004).\n[19] J. R.Terry et al., Phys. Rev. C 69, 054306 (2004).\n[20] B. A. Brown, P. G. Hansen, B. M. Sherrill, and J. A.\nTostevin, Phys. Rev. C 65, 061601(R) (2002).\n[21] J. A. Tostevin, J. Phys. G 25, 735 (1999).\n[22] C. A. Bertulani and A. Gade, Comp. Phys. Comm., in\npress.\n[23] B. A. Brown, Phys. Rev. C 58, 220 (1998).\n[24] B. A. Brown, W. A. Richter, and R. Lindsay, Phys. Lett.\nB483, 49 (2000).\n[25] B. A. Brown, Prog. Part. Nucl. Phys. 47, 517 (2001).\n[26] D. J. Morrissey et al., Nucl. Instrum. Methods in Phys.\nRes. B 204, 90 (2003).\n[27] D. Bazin et al., Nucl. Instrum. Methods in Phys. Res. B\n204, 629 (2003).\n[28] J. Yurkon et al., Nucl. Instrum. Methods in Phys. Res.\nA 422, 291 (1999).\n[29] W. F. Mueller et al., Nucl. Instr. and Meth. A 466, 492\n(2001).\n[30] A. E. L. Dieperink and T. de Forest, Phys. Rev. C 10,\n543 (1974).\n[31] B. A. Brown, A. Csoto, and R. Sherr, Nucl. Phys. A597,\n66 (1996).\n[32] J. A. Tostevin, Nucl. Phys. A682, 320c (2001).\n[33] C. A. Bertulani and P. G. Hansen, Phys. Rev. C 70,\n034609 (2004).\n[34] M. Honma, T. Otsuka, B. A. Brown, and T. Mizusaki,\nPhys. Rev. C 65, 061301 (2002).\n[35] M. Honma et al., in Proceedings of Fourth Interna-\ntional Conference on Exotic Nuclei and Atomic Masses\n(ENAM04), Eur. Phys. J. A 25, suppl. 1, 499 (2005).\n[36] M. Horoi, B.A. Brown, and V. Zelevinsky, Phys. Rev. C\n67, 034303 (2003).\n[37] B.A. Brown, A. Etchegoyen and W.D.M. Rae, The com-\nputer code OXBASH, MSU-NSCL Report No. 524, 1998.\n[38] C. N. Davids et al., Phys. Rev. C 17, 1815 (1978).\n[39] G. Audi et al., Nucl. Phys. A 279, 337 (2003).\n[40] J. Enders et al., Phys. Rev. C 65, 034318 (2002).\n[41] A. Gade et al., Phys. Rev. C 69, 034311 (2004).\n[42] A. Gade et al., Phys. Rev. C 71, 051301(R) (2005).\n"}